{"organizations": ["Bolton Wanderers"], "uuid": "a5fb3411078266213d60c766d04e7d573e2d46e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sportsmole.co.uk", "main_image": "http://b.smimg.net/13/32/owen-coyle-wigan-athletic.jpg", "site_section": "http://www.sportsmole.co.uk/rss.xml", "section_title": "Sports Mole", "url": "http://www.sportsmole.co.uk/football/bolton-wanderers/on-this-day/feature/otd-owen-coyle-sacked-by-bolton_250224.html", "country": "IE", "title": "On this day: Owen Coyle sacked by Bolton Wanderers", "performance_score": 0, "site": "sportsmole.co.uk", "participants_count": 0, "title_full": "On this day: Owen Coyle sacked by Bolton Wanderers", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T08:00:00.000+03:00", "replies_count": 0, "uuid": "a5fb3411078266213d60c766d04e7d573e2d46e5"}, "author": "", "url": "http://www.sportsmole.co.uk/football/bolton-wanderers/on-this-day/feature/otd-owen-coyle-sacked-by-bolton_250224.html", "ord_in_thread": 0, "title": "On this day: Owen Coyle sacked by Bolton Wanderers", "locations": ["UK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Darren Plant", "Owen Coyle"], "text": "Football On this day: Owen Coyle sacked by Bolton Wanderers On this day in 2012, manager Owen Coyle parted company with Bolton Wanderers after they struggled on their return to the Championship. By Darren Plant , ReporterFiled: Friday, October 9, 2015 at 06:00 UK \nWhen Bolton Wanderers ' 11-year stay in the Premier League ending in May 2012, the future of manager Owen Coyle was thrown up in the air as the club contemplated life outside of the top flight. It had also been revealed that the Trotters were heavily in debt, with as much as £110m said to be owed to owner Eddie Davies . \nHowever, the decision was made to retain the services of Coyle, who had previously helped Bolton to 14th place in each of the previous two seasons as well as guiding them to the FA Cup semi-finals. The fact that Bolton had only suffered one defeat in their six remaining Premier League games had left supporters relatively optimistic that the club were in decent shape on the field, while the likes of Keith Andrews , Matt Mills and Jay Spearing arrived at the Reebok Stadium to boost the first-team squad, which had seen seven established players depart for pastures new. \nJust seven weeks into the season, though, the club's hierarchy opted to make a change in the dugout and on this day three years ago, Coyle was sacked as manager of the North-West outfit. They had started the season solidly enough, picking up four points from three games which included a 2-0 victory at home to Derby County, but throughout their first 10 games, they struggled for consistency. \nThree days before his exit, Coyle had insisted that he would not resign from his position, despite revealing that a defeat at Millwall was the lowest point of his managerial career, but after discussions with chairman Phil Gartside , the decision was made for the club to go in a different direction. \n© Getty Images \nIn an official club statement, Gartside said: \"Owen poured his heart and soul into the job, both on and off the pitch, and he led our club with great dignity during some very challenging times. It is the right time for a change. We set a target at the beginning of the season and want to get back on track. I would like to place on record our sincere thanks to Owen, Sandy Stewart and Steve Davis for all their hard work during their time at Bolton Wanderers.\" \nCoyle, who had also played for Bolton between 1993 and 1995, said: \"I have always been driven to act in the best interests of the club and care passionately about it. I had fantastic times here as a player and it has been a privilege to have held the post of manager. I want to thank the fans for their backing since I returned, the chairman Phil Gartside and the owner Eddie Davies for their support and friendship and the club's staff and players for all their effort and commitment. I wish everyone connected with Bolton Wanderers all the very best.\" \nBolton reacted by appointing Dougie Freedman , who had established himself as one of the most highly-rated managers outside of the Premier League after ensuring that Crystal Palace remained in the Championship, despite their off-the-field problems. His time at the club proved to be a disappointment, however, as Bolton failed to make the playoffs during his two seasons in charge before he left by mutual consent in October 2014. \nAs for Coyle, a short-lived spell at Wigan Athletic was followed by a surprise move to the MLS, where he was handed the chance to manage Houston Dynamo. The 49-year-old has won 13 of his 36 games in charge, with the club currently sitting in eighth position in the Western Conference. Enter your email address to subscribe to Sports Mole 's free daily transfer newsletter! Sent twice a day during the transfer window. Follow @SMTrotters to get every Bolton headline from Sports Mole, and follow @SportsMole for the latest breaking news stories Recommended Next on SM Di Canio 'applies for Bolton job' Liverpool name Jurgen Klopp new manager Live Commentary: Portugal 1-0 Denmark - as it happened Televised FL December fixtures revealed Bolton to appoint Allardyce?", "external_links": [], "published": "2015-10-09T08:00:00.000+03:00", "crawled": "2015-10-09T08:35:40.439+03:00", "highlightTitle": ""}