{"organizations": ["NFL"], "uuid": "c121c704312c05021cd37b1382dff925076c1fcc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wralsportsfan.com", "main_image": "http://wwwcache.wralsportsfan.com/asset/football/nfl/panthers/2015/10/05/14947826/14947828-1444053862-646x485.jpg", "site_section": "http://www.wralsportsfan.com/news/rss/697/", "section_title": "Sports Fan stories from WRAL.com", "url": "http://www.wralsportsfan.com/4-0-panthers-byproduct-of-nfl-schedule-/14948297/", "country": "US", "title": "Ovies: 4-0 Panthers byproduct of NFL schedule?", "performance_score": 0, "site": "wralsportsfan.com", "participants_count": 0, "title_full": "Ovies: 4-0 Panthers byproduct of NFL schedule?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T17:30:00.000+03:00", "replies_count": 0, "uuid": "c121c704312c05021cd37b1382dff925076c1fcc"}, "author": "", "url": "http://www.wralsportsfan.com/4-0-panthers-byproduct-of-nfl-schedule-/14948297/", "ord_in_thread": 0, "title": "Ovies: 4-0 Panthers byproduct of NFL schedule?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "4-0 Panthers byproduct of NFL schedule? \nPosted 10:04 a.m. today Your friends e-mail addresses (comma separated): * Subject: * You must enter the characters with black color that stand out from the other characters More on this More Panthers Stories By Joe Ovies \nCharlotte, N.C. — The Carolina Panthers are 4-0 a quarter of the way through the NFL season after a sloppy, but effective 37-23 win over the hapless Tampa Bay Buccaneers. The Panthers are joined by the New England Patriots, Cincinnati Bengals, Denver Broncos, Green Bay Packers and division rival Atlanta Falcons as the remaining unbeaten teams in the league. \nHow good is this Carolina team in comparison to their peers? Well, it depends on how you want to spin it. \nI think it's reasonable to believe the Panthers aren't in the same entirely-way-too-early Super Bowl discussion like the Patriots and Packers. It's also rational to believe the Panthers aren't the most suspect team in the group. \nRodney Harrison, analysis for NBC Sports' Football Night in America, thinks otherwise. When asked by host Dan Patrick which team he was most skeptical of at this point in the season, Harrison tabbed the Panthers because \"they haven't played anyone.\" Rodney Harrison with the schedule hot takes on the #Panthers pic.twitter.com/kmtPKB3aTi — Will Thompson (@thrillis4) October 5, 2015 \nHarrison's point, along with anyone else who questions Carolina's slate of games, is fair. The Jacksonville Jaguars, Houston Texans, New Orleans Saints and Tampa Bay Buccaneers all share 1-3 records. And let's be candid, the Panthers have faced teams quarterbacked by Blake Bortles, Ryan Mallet, Luke McCown and rookie Jameis Winston. \nHowever, it's important to note Carolina is 4-0 without defensive leader Luke Kuechly (concussion) and a dearth of offensive weapons. It's not like any quarterback in the NFL would trade places with Cam Newton right now so they could hook up with Brenton Bersin. \nThe main issue with labeling the Carolina Panthers as the fraud of the group is that the mental exercise of picking apart a schedule could easily be applied to the Denver Broncos and Atlanta Falcons. \nThe Broncos have notched wins over Baltimore (1-3), Kansas City (1-3), Detroit (0-3), and Minnesota (2-2). None of their wins have been efficient displays of football. Quarterback Peyton Manning has thrown six touchdowns and five interceptions, leaving the Broncos to rely on their defense to save the day. \nThe Falcons could have easily lost to the New York Giants, but quarterback Eli Manning derped up late-game clock management. They beat the Dallas Cowboys with Tony Romo and Dez Bryant on the sideline. The Falcons then beat Philadelphia (1-3) and the same feckless Texans squad the Panthers took out in Week 2. \nSee, the answer isn't so easy. \nRegardless, nothing is guaranteed for NFL teams with hot starts. Plenty fizzle out and miss the playoffs or suffer devastating injuries that alter the course of the season. What's important for the Carolina Panthers is that they've already knocked out two NFC South division wins before hitting the bye-week. The NFC really is kind of a mess. The Packers are going to have to play somebody in the conference championship game. Don’t know who though. — Darin Gantt (@daringantt) October 5, 2015 Credits", "external_links": [], "published": "2015-10-05T17:30:00.000+03:00", "crawled": "2015-10-06T03:40:15.986+03:00", "highlightTitle": ""}