{"organizations": ["Farley Video Photos Northern Iowa Panthers", "NCAA"], "uuid": "55e5122f955eeff10eb57dfea865e0a84882087d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thegazette.com", "main_image": "http://www.thegazette.com/storyimage/GA/20151017/ARTICLE/151019646/AR/0/AR-151019646.jpg", "site_section": "http://feeds.feedburner.com/~r/GazetteOnlineSports/~6/1", "section_title": "Eastern Iowa Sports News and Information from Gazette Online", "url": "http://www.thegazette.com/subject/sports/uni-searching-for-answers-after-third-straight-loss-20151017", "country": "US", "title": "UNI searching for answers after third straight loss", "performance_score": 0, "site": "thegazette.com", "participants_count": 0, "title_full": "UNI searching for answers after third straight loss", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T04:14:00.000+03:00", "replies_count": 0, "uuid": "55e5122f955eeff10eb57dfea865e0a84882087d"}, "author": "", "url": "http://www.thegazette.com/subject/sports/uni-searching-for-answers-after-third-straight-loss-20151017", "ord_in_thread": 0, "title": "UNI searching for answers after third straight loss", "locations": ["Ill.", "Iowa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mark Farley"], "text": "UNI searching for answers after third straight loss UNI searching for answers after third straight loss Panthers inconsistency, lack of balance ‘100 percent on the head coach' according to Farley Video Photos Northern Iowa Panthers head coach Mark Farley walks off the field following their loss in their NCAA football game at Hancock Stadium in Normal, Ill. on Saturday, Oct. 3, 2015. (Stephen Mally/The Gazette) Iowa Football Data Center \nI've covered Iowa football at The Gazette since 1999 Saturday October 17, 2015 \nColumnist giving commentary and information about sports in Iowa. Sunday October 18, 2015 \nYour source for Iowa sports and more. Saturday October 17, 2015 \nCovering Iowa State and central Iowa for Eastern Iowa Saturday October 17, 2015 \nKernels baseball, RoughRiders hockey and a lot of things in between. Saturday October 17, 2015 \nI cover high school sports and Iowa women's basketball. Friday October 16, 2015 \nYour source for all things auto racing in Eastern Iowa. Wednesday September 23, 2015 \nSharing community and high school contributed stories Friday October 16, 2015 Jeremiah Davis , The Gazette October 17, 2015 | 11:16 pm \nCEDAR FALLS — After three straight losses, it’s not exactly hyperbole to say things aren’t going well for Northern Iowa football. \nAs a coach who has a hand in every aspect of what the Panthers do, head man Mark Farley shoulders each one of the losses and searches for answers to fix what’s wrong. \nAnd after a 24-19 loss on homecoming to Western Illinois on Saturday, there are plenty of answers to find. \n“Everybody has to take responsibility for their segment to get ready to play, but it’s 100 percent on the head coach. It’s my responsibility for the whole thing,” Farley said. “I don’t duck from it. I take it on head on, and I hope that’s the way our players take this on. That’s the example that will be set, that we attack our problems. We don’t got around our problems, we go through our problems. \n“I’ll take responsibility for every phase. If it isn’t right, then it’s my fault. When I go home tonight, I always worry about what I could have done better myself instead of what someone else could’ve done. … It’s my fault, is the way I’ll sleep tonight. I’ve got to figure it out and then use those other people to mold it the way we want.” \nThe Panthers (2-4, 0-3 Missouri Valley Football Conference) never led in a game where five starters were lost to injury. Quarterback Sawyer Kollmorgen started and went 12 of 25 for 94 yards and an interception, but was unable to return with an undisclosed injury — though Farley said he “was not allowed to return to the game” one week after not being allowed to return because of a concussion. Running back Darrian Miller, tight end Braden Lehman, linebacker Jared Farley and cornerback Edwin Young all also did not return after injuries. \nA sellout crowd of 16,324 (the first since Oct. 12, 2013) was never really a factor at the UNI-Dome, going silent after an early interception return for a touchdown by the Leathernecks (5-1, 3-0) and never really gaining any volume or energy advantage over the opponent. \nBut it wasn’t just the Dome that felt flat to those in attendance. UNI managed just 261 yards of total offense (170 passing, 91 rushing), and the defense — while holding WIU to just three points in the second half — allowed 396 total yards to the Leathernecks. It was a handful of big plays, though, that led to scores and chewed up clock. \nDefensive back Deiondre Hall, who moved to safety after Joe Feldpausch was lost to injury last week, had an interception return of his own for a touchdown — which set a new school career record at four — that briefly lit up a listless crowd. \nUltimately it was for naught. Hall, fellow defensive back Makinton Dorleant and quarterback Aaron Bailey all were unsure why the UNI-Dome felt so flat on and off the field. Each pointed to the Panthers not giving the fans much to cheer for early. \n“We just came out flat and slow. It’s as simple as that. We came out fighting in the second half, but just couldn’t make enough plays in the end,” Hall said. “It’s the Dome magic, you know, and we came out flat and slow, so everybody was kind of on their toes not knowing. When they got those two quick touchdowns, you could feel the crowd (wondering). That’s having a 12th man on the field, and I don’t want to say we didn’t have that, but early on we didn’t do so well.” \nIf it was a question before kickoff as to if UNI would have to win out to make the FCS Playoffs, there’s no doubt now. Farley said after the game, “we have to win out. There’s no question about that.” \nThe 15th-year coach pointed to a lack of balance and consistency in execution as to what’s led the Panthers to this point, where there’s nowhere to go but up in the MVFC standings. He’s concerned with energy needed to win out and finding a way to be productive. He stopped short of a laundry list of specifics beyond that, though. \nJust like he shoulders the losses, he didn’t want to make excuses for him or anyone else — for the third straight week. \n“I could think of a thousand things to answer (what’s wrong), but instead of having reasons, we have to find answers,” Farley said. “I could (find reasons), but I think I’d just be talking to talk. Our back is against the wall, no question right now. If you win out, you’re still in good shape. You wish you won one of these tougher games. But I hate to lose at home. \n“We just aren’t consistent enough in phases. I don’t know. We’ve just got to find the answer, because we can ramble and make up stuff, but we’re just not (sure).” \nl Comments: (319) 368-8884; jeremiah.davis@thegazette.com Your Next Articles", "external_links": [], "published": "2015-10-18T04:14:00.000+03:00", "crawled": "2015-10-18T21:13:36.684+03:00", "highlightTitle": ""}