{"organizations": ["NCAA", "Utah", "DESERET"], "uuid": "9fbd97523a5bde086ca61cbc695c6c1cec6b4cfe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wftv.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/11/52/75/a2d7076c120849ec9c278490cf0fb71e-924f73f3d9c443598192589fbcc5727f-0.jpg", "site_section": "http://www.wftv.com/feeds/categories/sports/", "section_title": "News | Sports", "url": "http://www.wftv.com/ap/ap/top-news/no-5-utah-uses-6-takeaways-to-beat-no-23-californi/nnzWZ/", "country": "US", "title": "No. 5 Utah uses 6 takeaways to beat No. 23 California 30-24", "performance_score": 0, "site": "wftv.com", "participants_count": 0, "title_full": "No. 5 Utah uses 6 takeaways to beat No. 23 California 30-24", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T09:20:00.000+03:00", "replies_count": 0, "uuid": "9fbd97523a5bde086ca61cbc695c6c1cec6b4cfe"}, "author": "", "url": "http://www.wftv.com/ap/ap/top-news/no-5-utah-uses-6-takeaways-to-beat-no-23-californi/nnzWZ/", "ord_in_thread": 0, "title": "No. 5 Utah uses 6 takeaways to beat No. 23 California 30-24", "locations": ["California", "Salt Lake Tribune", "Utah", "Salt Lake City"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Trevor Davis", "Cory Butler-Byrd", "Travis Wilson", "Bubba Poole", "Kenny Lawler", "Dominique Hatfield"], "text": "Updated: 2:20 a.m. Sunday, Oct. 11, 2015 | Posted: 2:20 a.m. Sunday, Oct. 11, 2015 No. 5 Utah uses 6 takeaways to beat No. 23 California 30-24 Related View Larger Utah's Dominique Hatfield grabs an interception away from California's Kenny Lawler in the first half during an NCAA college football game Saturday, Oct. 10, 2015, in Salt Lake City. (Scott Sommerdorf/The Salt Lake Tribune via AP) DESERET NEWS OUT; LOCAL TELEVISION OUT; MAGS OUT; MANDATORY CREDIT View Larger Utah's Cory Butler-Byrd grabs at California's Trevor Davis as he catches a touchdown pass in the first half during an NCAA college football game Saturday, Oct. 10, 2015, in Salt Lake City. (Scott Sommerdorf/The Salt Lake Tribune via AP) DESERET NEWS OUT; LOCAL TELEVISION OUT; MAGS OUT; MANDATORY CREDIT View Larger Utah's Bubba Poole, left, is tackled after a catch in the first half during an NCAA college football game against California, Saturday, Oct. 10, 2015, in Salt Lake City. (Scott Sommerdorf/The Salt Lake Tribune via AP) DESERET NEWS OUT; LOCAL TELEVISION OUT; MAGS OUT; MANDATORY CREDIT View Larger Utah's Cory Butler-Byrd looks to make a tackle in the first half during an NCAA college football game against California, Saturday, Oct. 10, 2015, in Salt Lake City. (Scott Sommerdorf/The Salt Lake Tribune via AP) DESERET NEWS OUT; LOCAL TELEVISION OUT; MAGS OUT; MANDATORY CREDIT View Larger Utah's Devontae Booker runs for a touchdown in the first half during an NCAA college football game against California, Saturday, Oct. 10, 2015, in Salt Lake City. (Scott Sommerdorf/The Salt Lake Tribune via AP) DESERET NEWS OUT; LOCAL TELEVISION OUT; MAGS OUT; MANDATORY CREDIT View Larger Utah's Travis Wilson looks for a receiver in the first half during an NCAA college football game against California, Saturday, Oct. 10, 2015, in Salt Lake City. (Scott Sommerdorf/The Salt Lake Tribune via AP) DESERET NEWS OUT; LOCAL TELEVISION OUT; MAGS OUT; MANDATORY CREDIT Sponsored Links The Associated Press SALT LAKE CITY — \nUtah spent the last two weeks downplaying its rise to No. 5 in the polls. The Utes sent a message Saturday night that they have no plans on going anywhere but up. \nThe team picked to finish fifth in the Pac-12 South is now the lone undefeated team remaining in the conference after a 30-24 victory over No. 23 California. \nUtah had a season-high six takeaways, picking off five of Jared Goff's passes. Cal had one last possession and drove to the 21, but Boobie Hobbs knocked down Goff's fourth-down pass with 26 seconds left. \nDevontae Booker ran for a season-high 222 yards and two touchdowns and added a team-high 45 receiving yards for the Utes (5-0, 2-0 Pac-12). They sit alone atop to the conference and are firmly in the College Football Playoffs discussion. \nGoff threw for 340 yards and two touchdowns. The Heisman contender couldn't overcome the ball-control issues that put the Golden Bears (5-1, 2-1) in a hole. \nThe Utes entered the game with seven interceptions and Marcus Williams, Justin Thomas, Gionni Paul and Dominique Hatfield all picked off passes in the first half. Hatfield had another interception in the fourth quarter. \nUtah quarterback Travis Wilson couldn't recapture the magic that led to a 42-point victory at Oregon two weeks ago. He finished with 170 yards, one touchdown and two interceptions. \nThe first half took nearly two hours as the two teams combined for seven turnovers. \nThe Utes missed several opportunities to grab a sizable lead with erratic offense. Utah scored 17 of its 24 first-half points off turnovers, but was held scoreless on two possessions after turnovers and settled for three on another. The seven-point halftime lead could have been much more had the Utes been able to put up more than three off two of Goff's interceptions and Daniel Lasco's fumble. \nCornerback Cory Butler-Byrd gave Utah a 17-10 lead in the third quarter with a 54-yard touchdown catch. The junior college transfer was considered as a full-time receiver before the season, but was moved to defense permanently during fall camp. The touchdown was the first of his career at Utah. \nGoff may have been a turnover machine with four first-half interceptions, which matched his season total from the first five games, but he never became tentative. The four interceptions were a career high and he had 30 minutes left to play. His first truly bad throw may have been the fourth-quarter interception to Hatfield when he threw off his back foot while being pressured. The Golden Bears were driving to tie the game. \nThe five interceptions were the most for Cal it had five against Arizona State in 1998. Copyright The Associated Press Sign up for our WFTV Morning News Headlines Newsletter Sign Up", "external_links": [], "published": "2015-10-11T09:20:00.000+03:00", "crawled": "2015-10-11T09:34:16.959+03:00", "highlightTitle": ""}