{"organizations": [], "uuid": "00fcd51a250f6c64a7f6676e97d1a164e3894789", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.expressandstar.com", "main_image": "", "site_section": "http://www.expressandstar.com/sport/feed", "section_title": "Midlands Sport News - West Midlands Sport - Sports News Scores « Express & Star", "url": "http://www.expressandstar.com/sport/wolverhampton-wanderers-fc/2015/10/01/tim-spiers-comment-there-are-few-better-owners-than-steve-morgan/", "country": "GB", "title": "Tim Spiers comment: There are few better owners than Steve Morgan", "performance_score": 0, "site": "expressandstar.com", "participants_count": 0, "title_full": "Tim Spiers comment: There are few better owners than Steve Morgan", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T17:15:00.000+03:00", "replies_count": 0, "uuid": "00fcd51a250f6c64a7f6676e97d1a164e3894789"}, "author": "", "url": "http://www.expressandstar.com/sport/wolverhampton-wanderers-fc/2015/10/01/tim-spiers-comment-there-are-few-better-owners-than-steve-morgan/", "ord_in_thread": 0, "title": "Tim Spiers comment: There are few better owners than Steve Morgan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tim Spiers"], "text": "Tweet \nThere were 66 hours between the moment Wolves dropped the biggest of bombshells on Monday and the moment Jez Moxey fronted up to the press on Thursday morning, statement (or notes) in hand. \nWolves fans had waited patiently for answers to the many critical questions that Monday's announcement and vague statement posed. \nMoxey spoke for 31 minutes and filled in some of those gaps. \nBut, perhaps inevitably, yet more questions were posed by what we heard. And whether the answers given were satisfactory is certainly open to debate. \nA lack of 'time and energy' was the primary reason offered as to why Steve Morgan, a self-confessed workaholic who has invested so much in Wolves and Wolverhampton and who cares so passionately about this football club, wants to give it all up. \nA man who couldn't be held back when storming onto the pitch after defeat to Bournemouth last season to remonstrate with the referee, such is his passion for the team, a man who kicked and headed every ball when watching his adopted, beloved Wolverhampton Wanderers. \nIn 2009, when somehow juggling his takeover of housebuilding firm Redrow and financing Wolves' promotion to the Premier League, time wasn't an issue. But it is now. \nMorgan's personal issues – his divorce and life with a new partner - have undoubtedly played a part and must be respected. \nBut without hearing all this from the man himself, how can we be satisfied with a decision, and the suggested reasons behind it, that effects the jobs and lives of so many people? It is a decision that has thrown the club into limbo – a limbo that may last for years. \nMoxey, unprompted, suggested in his statement that 'vitriol' from supporters could be one of many reasons, and that he would be 'disappointed' if that was the case. \nLater he contradicted this with \"at no point has he said to me that supporters have driven him out\". \nAnd then in a video interview with the club, he said it would be 'folly' not to suggest that criticism taken by Morgan wasn't a factor. \nHe had added in the press conference: \"But I'm not sure I'd necessarily be want to be 'paying' for (receiving criticism), and I'm sure that's a factor in all of the owners who decide to move on.\" \nMoxey isn't going to sit there and say that the supporters drove Morgan out. \nWas it the sole reason? No. But was it an important part of his decision? Undoubtedly. \nThe chief executive also suggested that Saturday's 'stressful, difficult' game at Preston, when Wolves struggled so much to break down the home team despite them having one man, and then another, sent off, rendered it not a surprise when he took a call on Sunday night from Morgan summonsing him to a meeting the following morning. \nMoxey's first thought, with the Preston game and the abuse that Morgan took from fans fresh in both men's minds, was that the chairman was stepping down. More on this story:", "external_links": [], "published": "2015-10-01T17:15:00.000+03:00", "crawled": "2015-10-02T10:40:48.450+03:00", "highlightTitle": ""}