{"organizations": [], "uuid": "e2736359580bea4c023cf67fad991ecd965f66c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bellinghamherald.com", "main_image": "http://www.bellinghamherald.com/static/images/bellinghamherald/facebook.jpg", "site_section": "http://www.bellinghamherald.com/sports/?widgetName=rssfeed&widgetContentId=712015&getXmlFeed=true", "section_title": "College & Professional Sports News, Scores & Photos | BellinghamHerald.com &", "url": "http://www.bellinghamherald.com/sports/article41389107.html", "country": "US", "title": "Timberwolves coach Flip Saunders dies at 60", "performance_score": 0, "site": "bellinghamherald.com", "participants_count": 1, "title_full": "Timberwolves coach Flip Saunders dies at 60", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T10:00:00.000+02:00", "replies_count": 0, "uuid": "e2736359580bea4c023cf67fad991ecd965f66c9"}, "author": "JERRY ZGODA Star Tribune (Minneapolis)", "url": "http://www.bellinghamherald.com/sports/article41389107.html", "ord_in_thread": 0, "title": "Timberwolves coach Flip Saunders dies at 60", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Timberwolves coach Flip Saunders dies at 60 By JERRY ZGODA Star Tribune (Minneapolis) Order Reprint of this Story \nLong after he was deemed too small to make it big in the sport he so loved, Flip Saunders rose from collegiate-playing and professional-coaching careers to become one of the most powerful team executives in the entire National Basketball Association during his second time around with the Timberwolves. \nThe Timberwolves announced Sunday \"with extreme sadness\" that its part-owner, president of basketball operations and head coach had died just a few months after he began chemotherapy for Hodgkin's lymphoma. \nHe was 60. \nAt birth, an infant named Philip Daniel after his grandfathers weighed 4 pounds and 14 ounces, a slight size that forever shaped the life of a boy everyone came to know by his nickname. \nOnce wrongly told on Cleveland's west-side playgrounds that a 5-foot-2 freshman was too tiny to play for his high school's varsity team, he grew - and the term is used loosely in a basketball context - to become an Ohio prep star, a Big Ten starter with the Gophers and a realist who soon thereafter knew his life's work awaited in coaching. \nWhen an uncle once told him he wished little Flip were four inches taller, little Flip answered back, saying he wouldn't have tried so hard if he had been four inches taller. \nInstead, he became a career coach famed for his thick playbook and sometimes obsessive attention to detail, a coach who chased the dream from major-college basketball to the sport's minor league all the way to the NBA. That's where he coached the Wolves for nearly a decade the first time around and then both managed and coached the team his second time there. \n\"Don't listen to what people say,\" Saunders told a reporter in 2009, \"because they don't understand the will that you have.\" \nSaunders was diagnosed with Hodgkin's lymphoma - a cancer of the immune system - in June and began chemotherapy shortly thereafter. In August, the team announced his condition, saying he intended to work uninterrupted while being treated for a cancer his doctors considered the cancer very curable. \n\"I am attacking this with the same passion I do everything in my life, knowing this is a serious issue,\" Saunders said in a team statement issued that day. \"I also know that God has prepared me to fight this battle.\" \nThat evening, Saunders tweeted, \"The outpouring of support today has been overwhelming and has truly reminded me that the goodness of people should never be questioned.\" \nIn September, the team announced Saunders had been hospitalized because of complications resulting from his completed chemotherapy treatments. It promoted associate head coach Sam Mitchell to interim head coach and expanded general manager Milt Newton's duties until Saunders returned from a leave of absence that the team termed would be months rather than weeks. \nHe is survived by wife, Debbie, daughters Mindy, Rachel and Kimberly and his oldest child, son Ryan, a Wolves assistant coach. \nIntroduction to Minnesota \nSaunders arrived in Minnesota 42 years ago to play for a demanding, defensive-minded young coach and fellow Ohioan named Bill Musselman. He never really left, keeping his family in their Medina home even when he later would coach for NBA teams in Detroit and Washington as well as work for Connecticut-based ESPN between coaching gigs. \nHe returned to Minnesota full-time to run the Wolves basketball operations in May 2013, more than eight years after friend and former college coach Kevin McHale fired him as coach the first time around. \nSaunders is by a lopsided margin the winningest coach in franchise history - with a 654-592 record in nearly 11 full seasons - and is the only man to coach the team into the playoffs, something he did coaching a superstar he helped raise named Kevin Garnett for eight consecutive seasons, from 1997 to 2004. \nHis father, Walter, a former Marine, was a disciplinarian who taught him the value of hard work, perseverance and just where always to draw the line and did so without ever raising his voice. His mother Kay, a former hairdresser, gave him many things, including the nickname her youngest son carried with him almost all his life. \nA salon customer used to call her firstborn son, Greg, a nickname she liked so much she gave it to her other son when he was born seven years after her eldest. \nThe nickname, Flip, stuck, all his life. \nThe kid considered too little started as a freshman for his high-school team by his senior season there scored 32 points a game and was named Ohio's Class A Player of the Year. When future NBA star Adrian Dantley chose Notre Dame over the Gophers, Saunders accepted Minnesota's offer and became a passing, playmaking guard on talented teams, including the one coached by Jim Dutcher that went 24-3 his senior year with future No. 1 overall draft pick Mychal Thompson and a freshman named McHale on it. (The record was later wiped away because of recruiting violations incurred during the Musselman coaching era.) \nWhen he went to NBA rookie camp with his hometown Cleveland team that next summer, Cavaliers coach Bill Fitch told Saunders he'd be his agent if Saunders were 6-5, but kindly suggested the 5-11 point guard pursue coaching instead. \nSaunders followed the recommendation, from his first job at Golden Valley Lutheran community college - where, at age 21, he was younger than some of his players - to assistants' jobs under Dutcher at his alma mater and in Tulsa. \nGophers mentors \nFrom Musselman, he learned his attention to detail and the intensity required to win. From Dutcher, he learned to let go, discovering he could prepare players at practice and then allow them the freedom needed when it was time to perform. \nAfter coaching 11 collegiate seasons, he made a leap of faith with a young, growing family and took a chance on professional basketball, joining Musselman's son, Eric, in the Continental Basketball Association. He coached seven years there in far-flung outposts such as Rapid City, S.D., La Crosse, Wis., and Sioux Falls, S.D., won two championships and twice was named Coach of the Year, all the while adapting in a league where players came and went like the prairie wind. \nWhile there, he attended NBA training camps run by Pat Riley and Phil Jackson and estimated he had read every book ever written by or about an NBA coach. \n\"When you stop learning, that's when you stop,\" he said in 2000. \"I think I'm better than I was five years ago and I hope I'll be better five years from now.\" \nWhile there, his playbook grew to legendary thickness and where he toted along a little sign with each move. \n\"Adapt or die,\" he often said it read. \"Just like the dinosaurs.\" \nJob hunting \nWhen Mankato, Minn., businessman Glen Taylor saved the Timberwolves from moving to New Orleans by buying the franchise in 1994, Saunders shipped a copy of the playbook - entitled the \"History of Basketball\" - from Sioux Falls and later drove a couple hours to visit with Taylor, a meeting that left the billionaire impressed with Saunders' analytical skills and business sense and ready to hire him for one of his other business if he had not hired McHale and Saunders to run the front office of a floundering expansion franchise. \nJust weeks into their management jobs, the pair drafted a teenager directly out of high school named Garnett. Not long into their first season together, McHale fired coach Bill Blair and moved Saunders to the bench. \nHe would coach 1,344 NBA regular-season and playoffs games with three franchises over the next 20 years, reaching the conference final once with the Wolves and three times in Detroit. He coached 866 of those with the Wolves, until he was fired 51 games into his 10th season and just months after he coached them to the Western Conference finals against the Los Angeles Lakers. \nHis firing left him bitter for some time over the way it was handled by McHale and things said by Taylor that suggested Saunders had lost the attention of his players. \nEventually, he renewed through the years a friendship with Taylor that led to discussions in 2012 when Taylor sought to sell the team. By then, Saunders was out of coaching, having accepted an ESPN commentary job after Washington fired him in January that year. By then, he also knew from conversations with network executives that the NBA's next television contract was headed toward the stratosphere. \nThose discussions with Taylor seeking a suitable buyer with whom Saunders might be involved led him to convince Taylor that he shouldn't sell the team at all. Instead, the two in time agreed that Saunders would return to run the team, replacing fired David Kahn, and own a small piece of the team. Given escalating franchise prices and player salaries buoyed by the league's new $24 billion television contract, Saunders' share could be worth tens of millions of dollars. A year later, he named himself to coach the team as well after Rick Adelman decided to retire. \n\"I've made a lot of great decisions in my life and a lot of things in business that have worked well,\" Taylor said the day he announced Saunders as president of basketball operations. \"Occasionally, I've made a wrong decision and perhaps supporting Flip leaving our organization as coach is one of those things I've done wrong.\" \nAll that in the past had been forgotten and forgiven. Saunders returned to the Wolves to work for the man who once fired him and reshaped a team that still hasn't made the playoffs since he coached them in 2004. \nHe turned star Kevin Love's discontent into an opportunistic trade that brought back potential superstar Andrew Wiggins two summers ago and coached the team purposely through a lousy season that brought the No. 1 overall pick and Karl-Anthony Towns last summer. The jury remains well out on big contracts to which he signed oft-injured Nikola Pekovic and Ricky Rubio. \n\"Just because something happens in business doesn't mean that it should destroy your relationships,\" Saunders said that same day. \"When things first happened, you're hurt a little bit, but it didn't take long to know the relationship we had. The longer I was away, the more I maybe I appreciated the relationship and maybe Glen did, too. And that's why I think the relationship grew stronger as the years progressed.\" \n(Staff writer Amelia Rayno contributed to this article.) Related content", "external_links": [], "published": "2015-10-25T10:00:00.000+02:00", "crawled": "2015-10-26T05:53:48.064+02:00", "highlightTitle": ""}