{"organizations": [], "uuid": "931c1843e0153647faf9ddfda855ad413386aaee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usatoday.com", "main_image": "http://www.gannett-cdn.com/-mm-/307266c84b51d864da85db955c31517c71c587e2/c=0-212-3968-2444&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/22/USATODAY/usatsports/6852a3457b4a872f850f6a7067007241.jpg", "site_section": "http://www.usatoday.com/sports/", "section_title": "USA Today | Sports", "url": "http://www.usatoday.com/story/sports/mlb/2015/10/22/more-pitchers-involved-in-gambling-scandal-in-japan-baseball/74374122/", "country": "US", "title": "More pitchers involved in gambling scandal in Japan baseball", "performance_score": 0, "site": "usatoday.com", "participants_count": 1, "title_full": "More pitchers involved in gambling scandal in Japan baseball", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T10:37:00.000+03:00", "replies_count": 1, "uuid": "931c1843e0153647faf9ddfda855ad413386aaee"}, "author": "", "url": "http://www.usatoday.com/story/sports/mlb/2015/10/22/more-pitchers-involved-in-gambling-scandal-in-japan-baseball/74374122/", "ord_in_thread": 0, "title": "More pitchers involved in gambling scandal in Japan baseball", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Photo: The Associated Press)\nCONNECT 1 TWEET LINKEDIN COMMENT EMAIL MORE TOKYO (AP) — A gambling scandal has hit Japanese professional baseball at the worst possible time.\nJust days before Japan's version of the World Series begins and as baseball is vying to get back in the Olympics, the sport has been hit by an ugly incident involving the most popular team.\nNippon Professional Baseball announced on Wednesday that two more pitchers from the Yomiuri Giants had bet on professional baseball games.\nThe announcement follows revelations two weeks ago that Giants pitcher Satoshi Fukuda had bet on games involving his team as well as Major League Baseball. Fukuda did not appear for the top team this season, so there is no suspicion that he fixed games, but gambling is a violation of NPB's charter.\nYomiuri president Hiroshi Kubo said pitchers Shoki Kasahara and Ryuya Matsumoto admitted to gambling on baseball, but have not been involved in any game-fixing.\n\"This is extremely regrettable,\" NPB commissioner Katsuhiko Kumazaki said. \"Baseball holds a special place thanks to the support it has had for a long time from many fans.\"\nAccording to the Giants, Kasahara had bet on 10 professional baseball games between April and October last year and also gambled on high school baseball games. Matsumoto bet on more than 10 games between June and October last year.\nFukuda bet on 10 NPB games and 10 major league games in an attempt to win back over $8,000 he lost gambling on high school baseball games in August.\nThe Giants have launched an investigation and consulted with police on the matter as gambling on pro sports is illegal.\nBaseball and softball have been out of the Olympics since 2008, and their joint bid to be included in the Tokyo 2020 Olympics had been considered a virtual certainty because of the popularity of those sports in Japan.\nHowever International Olympic Committee vice president John Coates doesn't think the scandal will harm that cause.\n\"This is a problem that is frowned on in sports in Japan and it's not going to effect the decision to be taken with baseball,\" Coates said at an IOC \"project review\" of Tokyo's Olympic preparations last week.\nThe Central League champion Yakult Swallows will play the Pacific League champion SoftBank Hawks in the Japan Series starting on Saturday.\nCONNECT 1 TWEET LINKEDIN COMMENT EMAIL MORE Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.\nTOP VIDEOS", "external_links": ["http://www.gannett-cdn.com/-mm-/3f8d1029c95871a4d31ca8ee90bf9a01fd81e505/c=212-0-3755-2657&r=x404&c=534x401/local/-/media/2015/10/22/USATODAY/usatsports/6852a3457b4a872f850f6a7067007241.jpg", "https://twitter.com/intent/tweet?url=http%3A//usat.ly/1LNFOKu&text=More%20pitchers%20involved%20in%20gambling%20scandal%20in%20Japan%20baseball&via=usatoday", "http://www.linkedin.com/shareArticle?url=http%3A//usat.ly/1LNFOKu&mini=true"], "published": "2015-10-22T10:37:00.000+03:00", "crawled": "2015-10-22T11:41:21.283+03:00", "highlightTitle": ""}