{"organizations": [], "uuid": "65f3e5f74139cda0ed7bdd13fc949e2f3240dac3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "http://www.bostonherald.com/sites/default/files/media/2015/04/02/040215soxjw18.jpg", "site_section": "http://bostonherald.com/sports/red_sox_mlb", "section_title": "Sports: Red Sox &amp; MLB | Boston Herald", "url": "http://bostonherald.com/sports/red_sox_mlb/boston_red_sox/2015/10/lauber_dumping_hanley_ramirez_should_be_red_sox_first", "country": "US", "title": "Lauber: Dumping Hanley Ramirez should be Red Sox' first choice", "performance_score": 0, "site": "bostonherald.com", "participants_count": 2, "title_full": "Lauber: Dumping Hanley Ramirez should be Red Sox' first choice | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 1, "uuid": "65f3e5f74139cda0ed7bdd13fc949e2f3240dac3"}, "author": "Scott Lauber", "url": "http://bostonherald.com/sports/red_sox_mlb/boston_red_sox/2015/10/lauber_dumping_hanley_ramirez_should_be_red_sox_first", "ord_in_thread": 0, "title": "Lauber: Dumping Hanley Ramirez should be Red Sox' first choice", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "First, a disclaimer:\nIt’s early.\nThe matchup still hasn’t been set for the AL Championship Series. The World Series won’t start for 13 days. Heck, it will be another two weeks before the Red Sox gather their pro scouts in Arizona for a summit to discuss potential trade targets.\nSo yes, it’s early — wicked early as we say around here — for president of baseball operations Dave Dombrowski to speak with much specificity about the offseason strategy. Everyone realizes the Sox’ needs: A No. 1 starter, a few late-inning relievers with wipeout stuff, an outfielder capable of playing every day in case Jackie Bradley Jr. or Rusney Castillo isn’t. But not even Dombrowski knows how those pieces will be acquired, the plan subject to change multiple times before pitchers and catchers report to Fort Myers in February.\nAs long as everyone understands that, make what you will of this: Asked yesterday if next season’s Opening Day first baseman is, at present, on the roster, Dombrowski pointed at Hanley Ramirez without asking anyone to hold him to it.\n“The reality is — everybody’s an intelligent person here — if you say you’re set in the outfield, we have a DH, the rest of our infield is pretty well-set, what spot does that leave open? First base,” Dombrowski said. “We’re committed to trying, to making the effort, and I believe he’s committed to making the effort, Hanley, to play first base. That’s our focus and our plans. We need to do everything we can to make that work.”\nFor now, that means staying in touch with Ramirez, who according to Dombrowski, is home in Fort Lauderdale, working with his personal conditioning coach to come back from a strained right shoulder that ended his season Aug. 26 and prevented him from playing first base in a game down the stretch.\nRamirez never has played first base. Because he’s a natural infielder, the Sox claim they are counting on him being able to do it, especially if he drops 15-20 pounds, as they have asked, to improve his agility. But Ramirez was an unmitigated train wreck in left field, and if he isn’t any more diligent about becoming a good first baseman, his latest position switch won’t go any better.\nSurely, Dombrowski knows that. He can’t possibly feel good about it.\nMoreover, Ramirez will leave soon for a two-week planned vacation, according to Dombrowski. When he returns, general manager Mike Hazen said the Sox don’t have plans to send him to play first base (other players, including infielder Travis Shaw, have gotten winter ball assignments) because they don’t want the 31-year-old slugger to risk further injury.\nSo, the soonest the Red Sox would see Ramirez at first base is spring training, another reason they would prefer not to see him at all.\n“We’ll have plenty of time to look at that,” Hazen said. “We’d have to ramp him up physically (for winter ball), then shut him back down. We’re just going to focus on him coming in next year.”\nOr, you know, brainstorm on how to send Ramirez away.\nDombrowski said he got a phone call “out of the blue” yesterday from a rival general manager who wanted to discuss “some other ideas I’ve never even thought about.” As the offseason goes along, he and Hazen surely will receive and make more calls like that, and they’re all but certain to bring up Ramirez’ name early and often.\nOne potential way to dump Ramirez might be taking on another team’s unwanted contract. Dombrowski has made similar trades before, most notably sending Prince Fielder (and $30 million of his salary) from Detroit to Texas for second baseman Ian Kinsler before the 2014 season. Dombrowski has even been known to get creative, too, involving a third team in order to pull the trigger on a deal.\n“I’ve had years where, yeah, you can’t move that contract and you just know that’s what’s happening,” Dombrowski said recently, speaking generally about the challenge of unloading a hefty contract. “But if you just take the general philosophy that that’s the way it’s going to be, that doesn’t do you any good either. You just keep an open mind. You never know what will happen.”\nDombrowski has undoubtedly contemplated the sweetness of life without Ramirez, one half of the Sox’ “Gold Bust Twins” with third baseman Pablo Sandoval. After signing a four-year, $88 million contract last November, Ramirez played in 105 games and batted .249 with 19 homers (10 of which came in April) and a .717 OPS. His defense was so bad — and, after April, his bat so silent — that he was worth less than the value of a replacement player, according to Fangraphs’ WAR metric.\nFor all of those reasons, and the fact that he’s owed $66 million through 2018, the Sox might not be able to unload Ramirez, in which case they will have no choice but to commit to him as their first baseman.\nAnd so, on Oct. 13, Dombrowski must speak as though the Red Sox are preparing for that situation.\n“We’re committed to it,” Dombrowski said of Ramirez at first base. “I believe he’s committed to it. His representatives are committed to it. Will it work? Time will tell.”\nIndeed, in time, the Sox must be hoping Ramirez will be some other team’s problem.", "external_links": [], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-15T23:11:43.211+03:00", "highlightTitle": ""}