{"organizations": [], "uuid": "266583ed754cf4c12c0672cfbb006654ec48af8d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "http://images.worldnow.com/AP/images/8971696_G.jpg", "site_section": "http://www.cbs8.com/category/13548/college-sports-news", "section_title": "College Sports: NCAA news, scores, updates &amp; more - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30214205/international-issue-how-to-make-peanut-butter-and-jelly", "country": "US", "title": "International issue: How to make peanut butter and jelly", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "International issue: How to make peanut butter and jelly - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "266583ed754cf4c12c0672cfbb006654ec48af8d"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30214205/international-issue-how-to-make-peanut-butter-and-jelly", "ord_in_thread": 0, "title": "International issue: How to make peanut butter and jelly", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By DOUG FERGUSON\nAP Golf Writer INCHEON, South Korea (AP) - The Presidents Cup is being held in Asia for the first time, and one critical component got lost in translation.\nHow to make a peanut butter and jelly sandwich.\nThat's been a staple for years during long days of matches and even some practice rounds. But it took most of the week at the Jack Nicklaus Golf Club Korea for the food handlers to understand exactly what they wanted.\nOn the first day, the Americans got their order of the PB&J - one sandwich was filled with peanut butter, another was filled with jelly.\nDavis Love III, an assistant captain at these matches, politely explained that the peanut butter and jelly are in the same sandwich. The next day was a slight improvement. The sandwich featured a piece of bread that was spread with peanut butter, another piece of bread, then the jelly and then more bread, much like a club sandwich.\n\"We finally showed him what we wanted,\" Love said. \"You spread the peanut butter on the bread, then the jelly. He said, 'OK, I can do that. But it's gross.'\"\nAlas, the Americans finally got the sandwiches they wanted.\nThe International team? That still required some work.\nNick Price's team was asked what kind of sandwiches they wanted for the final practice session on Thursday. The request was for ham and cheese, and peanut butter and jelly. And that's what they got - only it was one sandwich.\nBetween two slices of bread were ham, cheese, peanut butter and jelly.\nNow that's gross.\n___\nTEAM BONDING: International captain Nick Price is finding out what previous captains have tried to deal with at the Presidents Cup - how to pull a team together from nations all over the world except European countries and the United States.\nThis team comes from seven countries on three continents and speaks at least six languages - English, Thai, Japanese, Korean, Hindi and Afrikaans (Anirban Lahiri of India also speaks Bengali and Punjabi).\nBut that wasn't the problem to which Price referred.\n\"I'm not the only captain who's had this dilemma,\" he said. \"We don't know our team until three weeks before. We wait until Monday on the Presidents Cup before we can all get together.\"\nHe said U.S. captains are able to pull together the core of the team at just about any tournament.\n\"Our team is so fragmented,\" Price said. \"I'm not making excuses. I'm just telling you how it is.\"\nMaybe that will change soon. Eleven of this year's International team - except for Thongchai Jaidee - has PGA Tour cards for next season. That includes Sang-moon Bae, of course, who still has a PGA Tour card but most likely won't be on the next team. He has to start his mandatory military service in South Korea.\n___\nTHE HANDSHAKE: Phil Mickelson and Zach Johnson went retro in celebrating good shots and holes won at the Presidents Cup.\nNo high-fives. No chest-bumps. And certainly not that \"Fresh Prince of Bel-Air\" move that Tiger Woods and Matt Kuchar so awkwardly introduced at the last Presidents Cup two years ago at Muirfield Village.\nMickelson and Johnson settled on a firm handshake. That's it.\n\"It's a gentleman's game,\" Johnson said.\nMickelson is the emotional type, especially at these cup competitions. Johnson is a little more subdued, which is why he said he meshed so well with Jason Dufner last time. Mickelson played with Keegan Bradley in his last nine team matches dating to the 2012 Ryder Cup.\n\"Keegan, who I played with the last three team events, is very excited and energetic,\" Mickelson said. \"And Zach has never really been one to overly celebrate. So we came up with just a very subdued handshake to celebrate our successes.\"\nLook for more of it on Friday when they are paired again in fourballs.\n\"There's so many good things that we can do together,\" Johnson said. \"Rather than getting up there and doing a chest bump or the big old whatever ... we just kept it simple. Just a nice, classy handshake when things went well. We're here to have fun. Nothing more than that. Good shots deserve a handshake.\"\n___\nRICKIE'S APPETITE: Rickie Fowler was the talk of the Korean barbecue night earlier this week, though he apparently didn't have much time to talk because he was busy chowing down everything that came his way.\nThe barbecue was a mystery to some. Branden Grace talked about a pot of soup that was boiling when a live octopus was added. Jordan Spieth said there were a few items that he chose not to try. But not Fowler. Spieth went so far as to say that Fowler \"licked the bowl.\"\nFowler did not deny these allegations.\n\"I don't think I let a dish go by that I didn't eat,\" Fowler said.\nAs for the bowl?\n\"It might have found some tongue,\" he said with a grin.\n___\nDIVOTS: Phil Mickelson tied Tiger Woods for most foursomes wins with 11 when Lefty and Zach Johnson won their match on Thursday. Mickelson has played in all 11 Presidents Cup, and already holds records for most matches played at 48. He needs three more wins to tie Woods for total matches won (24). Woods has played in eight Presidents Cups. Mickelson, however, could also set a record for most singles matches lost if he doesn't win on Sunday. He now is tied with Vijay Singh. ... Charl Schwartzel, rested on Thursday as he recovers from a virus, was practicing on the putting green with his teammates Thursday. He is playing Friday.\n ", "external_links": [], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T14:14:58.570+03:00", "highlightTitle": ""}