{"organizations": [], "uuid": "edf85da0d73fe8768c9d75a4295944520ebee9a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.miamiherald.com", "main_image": "http://www.miamiherald.com/news/politics-government/elections-2016/a3sshw/picture38253201/ALTERNATES/LANDSCAPE_1140/GOP%202016%20Trump(2)", "site_section": "http://www.miamiherald.com/?widgetName=rssfeed&widgetContentId=712015&getXmlFeed=true", "section_title": "Breaking News, Sports, Weather & More | MiamiHerald.com &", "url": "http://www.miamiherald.com/news/politics-government/elections-2016/article38253207.html", "country": "US", "title": "Donald Trump does Vegas, and Vegas digs it", "performance_score": 0, "site": "miamiherald.com", "participants_count": 1, "title_full": "Donald Trump does Vegas, and Vegas digs it", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T01:05:00.000+03:00", "replies_count": 0, "uuid": "edf85da0d73fe8768c9d75a4295944520ebee9a3"}, "author": "Patricia Mazzei \npmazzei@miamiherald.com", "url": "http://www.miamiherald.com/news/politics-government/elections-2016/article38253207.html", "ord_in_thread": 0, "title": "Donald Trump does Vegas, and Vegas digs it", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Donald Trump does Vegas, and Vegas digs it \nDonald Trump packed a theater that seats 1,600 \nTrump rallies are a big production \nThe candidate took credit for shaking up House GOP leadership Republican presidential candidate Donald Trump speaks at a rally Thursday in Las Vegas. JOHN LOCHER AP Donald Trump impersonator Robert Ensler puts in an appearance at a Trump campaign event Thursday in Las Vegas. Patricia Mazzei The Miami Herald 1 of 2 Order Reprint of this Story LAS VEGAS \nThe winding line stretched along the Treasure Island casino Thursday morning for people who had no interest — not now — in gambling. \n“Do you have any more tickets?” asked people outside the Mystère Theater who weren’t inquiring — not today — about Cirque du Soleil. \nThis is what it’s like to attend an event for Donald Trump for president. \n“We are beyond sold out,” Charles Muñoz, Trump’s Nevada campaign director, told the stragglers. “It’s a good problem to have on a Thursday at noon.” \nThe theater doors opened. The crowd whooped. Red “Make America Great Again” hats started filing in. \n“Slow down! Do not push!” Muñoz urged. Several earpiece-wearing men wearing placid smiles played bouncer. Attendees got their hands stamped, like in a nightclub. \nIt was nearly two hours before Trump was due. \nMuñoz said Trump held the event at the theater because it seats 1,600. The largest venue at Trump’s own hotel across the Strip? It accommodates only 400. \n“It’s going to be huge,” Muñoz said, somehow managing not to wink. \nInside, the speakers blared classic rock and more unusual tunes for politics — “Memory,” from the musical Cats ; “The Music of the Night,” from The Phantom of the Opera , and “Nessun Dorma,” from the opera Turandot (the late Luciano Pavarotti’s rendition). \nI’m tired of what his country has become. I’m tired of the establishment telling us what we need. I’m tired of the political correctness. If you don't like America, get the hell out. \nBarbara Teixeira, Donald Trump supporter \nThere weren’t enough Trump campaign signs to go around. “Is that yours?” one woman asked another, pointing to a sign lying on a seat. “Yes, it’s mine,” the woman responded, grabbing it zealously. \nA Trump impersonator strolled in, drawing hollers from fans who thought he was the real deal. \n“They know about me,” Robert Ensler, the impersonator, said about “Trump’s people.” “I tried out for The Apprentice a few years ago. I used to wear a wig back then.” \nHe handed out his palm card, titled “A tribute to Donald Trump.” (Subtitle: “A Real-Life Portrayal of The Man, His Money, His Attitude and His Presidential Candidacy!”) He pursed his lips, à la Donald. \nAs she waited, Barbara Teixeira ticked off her reasons for backing Trump. \n“I’m tired of what his country has become. I’m tired of the establishment telling us what we need. I’m tired of the political correctness,” said the 76-year-old Republican. “If you don't like America, get the hell out.” \nPromptly at noon, Trump made his grand entrance, surrounded by a phalanx of cameras. \n“They have hundreds and hundreds of people standing outside. They didn’t get in,” Trump announced. “They didn’t get the good real estate! You got the good real estate.” \nHe pointed at a row of TV crews standing in the center of the theater: “They never pan the crowd. They’re terrible. The media is terrible.” \n“Boo!” the audience yelled. “Pan the cameras!” \n(“I go home, and I say, ‘I’m going to watch myself on television,’” Trump said later, describing his post-primary debate routine. “Who wouldn't do that?” Also: “I’m a ratings machine.”) \nThey have hundreds and hundreds of people standing outside. They didn’t get in. They didn’t get the good real estate! You got the good real estate. \nDonald Trump \nHe took credit for House Republican Leader Kevin McCarthy dropping out of the race to replace Speaker John Boehner. “It’s bedlam in Washington,” Trump said. “It’s a mess.” \nWhen, about 40 minutes into what would end up being an hour-long monologue, he mentioned being featured on the cover of People magazine, a woman in the front row held the issue up in the air with so much verve that Trump called her up onstage. She beamed, waved an American flag and told the candidate she is from Colombia. \n“I’m Hispanic, and I’m for Mr. Trump!” she screamed, jumping up and down. She raised her arms in a triumphant V. \n“I swear to you, I never met her before,” Trump said. He suggested the magazine cover was Photoshopped — “I have a wart at the end of my nose! But that’s OK because they meant it well. They wanted me to look like Cary Grant” — then signed the edition at the woman’s request and kissed her on the cheek. \n“Trump! Trump! Trump! PRESIDENT TR MP!” shrieked a hoarse man in the audience, almost losing what was left of his voice. \nAs Trump walked offstage, the speakers played Aerosmith’s “Dream On.” Trump air-drummed. Related content", "external_links": [], "published": "2015-10-09T01:05:00.000+03:00", "crawled": "2015-10-09T04:01:04.555+03:00", "highlightTitle": ""}