{"organizations": ["Barcelona"], "uuid": "9a042e1f541144c7e269f8e89e33b2eff228234e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chinapost.com.tw", "main_image": "http://www.chinapost.com.tw/news_images/20151010/p09c.jpg", "site_section": "http://www.chinapost.com.tw/rss/sports.xml", "section_title": "China Post Online - Sports News", "url": "http://www.chinapost.com.tw/sports/soccer/2015/10/10/447928/Brazil-lose.htm", "country": "", "title": "Brazil lose against Chile; Ecuador beat Argentina", "performance_score": 0, "site": "chinapost.com.tw", "participants_count": 0, "title_full": "Brazil lose against Chile; Ecuador beat Argentina", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T19:01:00.000+03:00", "replies_count": 0, "uuid": "9a042e1f541144c7e269f8e89e33b2eff228234e"}, "author": "", "url": "http://www.chinapost.com.tw/sports/soccer/2015/10/10/447928/Brazil-lose.htm", "ord_in_thread": 0, "title": "Brazil lose against Chile; Ecuador beat Argentina", "locations": ["South America", "Ecuador", "Argentina", "Brazil", "TWN SHARE Tweet RIO DE JANEIRO", "Argentina Brazil", "Russia", "Chile"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Stephen Wade"], "text": "Brazil lose against Chile; Ecuador beat Argentina By Stephen Wade ,APOctober 10, 2015, 12:01 am TWN SHARE Tweet RIO DE JANEIRO -- Brazil showed Thursday it can't win against the best without Barcelona star Neymar, losing 2-0 at Chile as qualifying in South America opened for the 2018 World Cup in Russia. \nIt was the same story for Argentina without its Barcelona marquee player Lionel Messi, falling 2-0 at home against Ecuador. \nChile won behind second-half goals by Eduardo Vargas and Alexis Sanchez. \nNeymar is sitting out the final two games of a four-match suspension he received just over three months ago in the Copa America. He will also miss next week's match against Venezuela. \nChile had more energy and more chances in the match in Santiago. Sanchez hit the post late in the first half and Mauricio Isla did the same early in the second before Chile broke through. \nVargas scored in the 72nd minute, chipping in a free kick from Matias Fernandez. Sanchez added a second goal in the final minute before stoppage time, scoring on a counterattack from close range. \nChile proved again it's the best team in South America. Three months ago the Chileans won the Copa America, defeating Argentina in the final. \nBrazil continues to struggle even under new coach Dunga. \nIt went out in the quarterfinals of the Copa America, and was humiliated a year ago in the World Cup semifinals on home soil, pummeled 7-1 by eventual champion Germany. \nArgentina, the continent's other power, went down to Ecuador in Buenos Aires on second-half goals by Frickson Erazo and Felipe Caicedo. \nMessi is out with a left-knee injury and is expected to return in late November. \nArgentina had many of its other top players on the field, including Angel Di Maria, Sergio Aguero and Javier Macherano. \nIn other qualifiers on Thursday, Uruguay overcame the altitude in La Paz to defeat Bolivia 2-0 with goals from Martin Caceres and Diego Godin. \nPlaying at 3,650 meters (12,000 feet), Uruguay won without two suspended player — Luis Suarez and Edinson Cavani. It was Uruguay's first victory in the thin air of La Paz. \nSuarez is still suspended for biting Italy's Giorgio Chiellini at the 2014 World Cup in Brazil. Cavani was suspended for a red card picked up in the Copa America against Chile. \nTeofilo Gutierrez and Edwin Cardona scored in Colombia's 2-0 victory over Peru in the Colombian city of Barranquilla. \nParaguay defeated Venezuela 1-0 with a goal from Derlis Gonzalez in the 84th minute. \nIn Tuesday's second round, the match-ups are: Ecuador vs. Bolivia; Uruguay vs. Colombia; Paraguay vs. Argentina; Brazil vs. Venezuela; Peru vs. Chile. SHARE", "external_links": [], "published": "2015-10-09T19:01:00.000+03:00", "crawled": "2015-10-10T08:04:38.528+03:00", "highlightTitle": ""}