{"organizations": [], "uuid": "606355d97075a9a375846d60fd42aeb7f5f761ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/nhl", "section_title": "NHL News, Scores, Schedule, Standings, Stats, Photos, Videos - Ice Hockey - MSN Sports", "url": "http://www.msn.com/en-us/sports/nhl/five-nhl-teams-flying-under-the-radar/ar-AAf2unC", "country": "US", "title": "Five NHL teams flying under the radar", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "Five NHL teams flying under the radar", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "606355d97075a9a375846d60fd42aeb7f5f761ae"}, "author": "Kevin Allen, USA TODAY Sports", "url": "http://www.msn.com/en-us/sports/nhl/five-nhl-teams-flying-under-the-radar/ar-AAf2unC", "ord_in_thread": 0, "title": "Five NHL teams flying under the radar", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Five NHL teams flying under the radar USA Today Sports 12 hrs ago by Kevin Allen, USA TODAY Sports © Mark Humphrey, AP Mark Humphrey, AP The Anaheim Ducks are a trendy pick to win it all in 2015-16. History says the Chicago Blackhawks will again be among the NHL’s best. The Tampa Bay Lightning are too skilled not to be a factor this season.\nAdChoices But intriguing teams are flying under the radar. Here are five that will perform better than you think they will:\nColumbus Blue Jackets : With the offensive might this team possesses and the presence of Sergei Bobrovsky in net, the Blue Jackets could win the Metropolitan Division.\nThe primary reason they weren’t in the playoffs last season was injuries.\nThe Blue Jackets are spending more than $45 million in cap space on forwards, and they should be among the most dangerous offenses. If Brandon Saad, Ryan Johansen and Nick Foligno play together, they will be formidable. Don’t forget the Blue Jackets closed last season with a 12-0-1 run.\nThe only question is whether their defense is strong enough. They also need a strong start, which is not a Blue Jackets tradition.\nDallas Stars: With the addition of Patrick Sharp and Valeri Nichushkin’s health restored, the Stars could lead the NHL in goals. The addition of Johnny Oduya and the continued development of younger defensemen such as John Klingberg could make them sneaky effective on defense.\nGiving up Trevor Daley in the Sharp trade won't hurt the Stars. Advanced stats say the Stars were more effective when he wasn’t on the ice last season.\nWhat we don’t know is whether the Stars’ goaltending will be strong enough. Kari Lehtonen and Antti Niemi are the options, and neither played his best last season. If they play well, the Stars are a playoff team.\nSan Jose Sharks: The Sharks are the team hiding in the weeds. No one is paying attention, and they might be more threatening than they have been in recent years.\nWe know this team has firepower. But GM Doug Wilson upgraded the team’s defense with the Paul Martin signing. He stabilizes the back end. Plus, Joel Ward gives the team more bite. Younger players, particularly Tomas Hertl, will be improving.\nBut the real change comes in net where Martin Jones is the guy. He adds freshness to this team. He can be a difference-maker.\nBuffalo Sabres: The Sabres should score at least 40 to 50 more goals than they did last season. They should give up far fewer goals.\nIf Evander Kane, Ryan O’Reilly and Tyler Ennis play together, they will be effective. Meanwhile, center Jack Eichel is an extraordinary rookie. Fans have seen glimpses of greatness. There is more to come.\nThis team could win 10-12 more games than last year, when they went 23-51-8.\nEdmonton Oilers: Everyone is talking about Connor McDavid for good reason. He has magic in his game.\nBut the real change in this team has been brought by general manager Peter Chiarelli and coach Todd McLellan\nThe Oilers will be tighter defensively and play with a much higher compete level. If goalie Cam Talbot does his part, it wouldn’t be unthinkable to see them within striking distance of the playoffs.\nGo to MSN Home", "external_links": ["http://www.usatoday.com/sports/", "http://go.microsoft.com/fwlink/?LinkID=286759"], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-03T06:47:33.141+03:00", "highlightTitle": ""}