{"organizations": [], "uuid": "fa2631f4cddc558e634079aed15d7311827dc103", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.detroitnews.com", "main_image": "http://www.gannett-cdn.com/-mm-/6e5f15608968a498e633da415369ad7daaa4d2b7/c=0-613-2586-2074&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/08/DetroitNews/DetroitNews/635799105219466618-AA.jpg", "site_section": "https://feeds.feedblitz.com/detroit/sports", "section_title": "Detroit News - Sports", "url": "http://www.detroitnews.com/story/sports/mlb/tigers/2015/10/08/two-tigers-starters-pen-help-at-top-of-avilas-wish-list/73593634/", "country": "US", "title": "Two Tigers starters, 'pen help at top of Avila's wish list", "performance_score": 0, "site": "detroitnews.com", "participants_count": 7, "title_full": "Two Tigers starters, 'pen help at top of Avila's wish list", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T17:33:00.000+03:00", "replies_count": 7, "uuid": "c080a3a8024086694d43f8c2c8f0c7473d77f978"}, "author": "detroitnews.com", "url": "http://www.detroitnews.com/story/sports/mlb/tigers/2015/10/08/two-tigers-starters-pen-help-at-top-of-avilas-wish-list/73593634/#post-0", "ord_in_thread": 0, "title": "Two Tigers starters, 'pen help at top of Avila's wish list", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Al Avila (Photo: Robin Buckson, Detroit News) \n17 CONNECT 5 TWEET LINKEDIN 6 COMMENT EMAIL MORE Detroit – Tigers general manager Al Avila, in an 80-minute session with the media Thursday, provided a sketch of the team's plan for the offseason.\nAt the top of the list, as he has said before, is to acquire through trade or free agency, two starting pitchers and \"at least a couple of arms\" for the bullpen.\n\"There are a lot of good pitchers out there, a lot of average pitchers and some bad pitchers,\" he said. \"Notice I didn't say any great or outstanding pitchers.\"\nAvila, though he could not and would not mention names, said he hoped to land a No. 3 starter and a back end of the rotation starter. Justin Verlander and Anibal Sanchez project to be the top two in the rotation. He also said Daniel Norris, Matt Boyd, Shane Greene and possibly Michael Fulmer, who pitched at Double-A last year, could be in the mix for the No. 5 spot.\nAs for the bullpen, he referred to Drew VerHagen and Alex Wilson as two of the positive developments of the 2015 season, but he wouldn't say that a seventh- or eighth-inning reliever, or closer, was presently on the roster.\nHe said Neftali Feliz, who the Tigers have under control for another season, is also in the conversation for those three roles.\nAvila mentioned that the list of potential free-agent closers was not overwhelming, and that he and his staff will be looking to identify pitchers who, though they may not have been closers last season, have the makeup and the stuff to handle the role.\nIn other words, the Tigers may be looking for some diamonds in the rough to bolster their bullpen.\nOf Bruce Rondon, whom the Tigers sent home early because of a lack of effort, Avila said he will have to earn a spot on the club next season.\n\"I was told that the first guy to sign up for TigerFest and the (winter) caravan was Bruce Rondon,\" Avila said. \"That is a good sign. Rondon is still trying to figure it out. Everybody learns at a different pace. Maturity arrives at different times for different people.\"\nRondon will pitch in the Venezuelan winter ball league.\nTyler Collins   (Photo: Robin Buckson, Detroit News) \nFinding a starting left fielder was also on the list, Avila said, but it would depend on how much money was left over after fixing the pitching staff. He said Tyler Collins showed that \"he is capable of playing at the big league level.\"\nHe also left the door open to the possibility of re-signing Rajai Davis, who will be a free agent.\n\"We are open for business,\" Avila said. \"I can't get into specifics, but, like always, we will have a very competitive payroll.\"\nThe only free agent-to-be who was told he likely wouldn't be pursued was utility infielder Josh Wilson. Avila also said it was most likely that his son, catcher Alex Avila, would find a better situation in free agency elsewhere.\nAl Avila also said the Tigers have initiated discussions with right-fielder J.D. Martinez on a contract extension. Martinez is arbitration-eligible and under the Tigers' control for two more years.\nTwitter @cmccosky", "external_links": [], "published": "2015-10-08T17:33:00.000+03:00", "crawled": "2015-10-08T22:46:16.021+03:00", "highlightTitle": ""}