{"organizations": ["San Antonio Spurs", "Philips Arena", "Spurs", "Eastern Conference", "Hawks"], "uuid": "50f1e7a3e89fb1731562e8d5523cead17f2b79f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.statesboroherald.com", "main_image": "http://media.morristechnology.com/webmedia/upload/statesboro_herald/article/2015/10/14/hawks_logo.jpg", "site_section": "http://www.statesboroherald.com/syndication/feeds/rss/3/", "section_title": "Sports", "url": "http://www.statesboroherald.com/section/3/article/70643/", "country": "US", "title": "Sefolosha plays in first game since run-in with police", "performance_score": 0, "site": "statesboroherald.com", "participants_count": 0, "title_full": "Sefolosha plays in first game since run-in with police", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T04:56:00.000+03:00", "replies_count": 0, "uuid": "50f1e7a3e89fb1731562e8d5523cead17f2b79f5"}, "author": "", "url": "http://www.statesboroherald.com/section/3/article/70643/", "ord_in_thread": 0, "title": "Sefolosha plays in first game since run-in with police", "locations": ["New York City", "Manhattan", "ATLANTA", "Atlanta", "Toronto"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["DeMarre Carroll", "Thabo", "Kent Bazemore", "Thabo Sefolosha", "Sefolosha", "PAUL NEWBERRY"], "text": "Posted: October 14, 2015 9:58   14, 2015 9:56 p.m. By PAUL NEWBERRY AP Sports Writer ATLANTA — After a win in court, Thabo Sefolosha was back on the court for theAtlanta Hawks. Sefolosha played his first game since an April encounter with New York City police left him with a broken right leg. He came in with 3:52 left in the first quarter of a preseason game against the San Antonio Spurs on Wednesday night. The 6-foot-7 forward missed Atlanta's first two preseason games while standing trial on the charges resulting from the incident with police, which occurred last season outside a trendy Manhattan nightclub during the final week before the playoffs. Sefolosha turned down a lenient plea deal and was acquitted of all charges last week. \"I wanted to show that I didn't do anything wrong,\" he said. \"I wanted to prove that for my family and myself and all the basketball fans. It's a good feeling, but I'm ready to put it behind me. I'm glad it worked out. Justice was served.\" Sefolosha is eager to focus on basketball again after missing the Hawks' run to the Eastern Conference final. He hopes to win a starting job at small forward, the position manned last season by DeMarre Carroll. He left over the summer as a free agent to sign with Toronto. Kent Bazemore has started the first three preseason games for Atlanta. Now that Sefolosha is back, the competition figures to get interesting over the rest of the preseason, though he expected to play less than 15 minutes against the Spurs. \"I'm excited to be back on the court and see how my body feels,\" Sefolosha said, sitting at his locker before the game. \"I'm getting closer to 100 percent but I'm not there yet.\" Less than an hour before tipoff, Sefolosha was getting in some extra shooting on the practice court. When he entered the game, he was greeted with chants of \"Thabo! Thabo! Thabo!\" from the crowd at Philips Arena. A full recovery is his top priority. \"Whether I'm starting or not,\" Sefolosha said, \"the best was I can help the team is being healthy.\"  ", "external_links": [], "published": "2015-10-15T04:56:00.000+03:00", "crawled": "2015-10-15T05:48:46.681+03:00", "highlightTitle": ""}