{"organizations": [], "uuid": "90657cad665a82931f1fe312f7068dd1a1a89ad0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.detroitnews.com", "main_image": "http://www.gannett-cdn.com/-mm-/6874ee6a2cbc458bc2e06b49e13337dd506ed99d/c=0-209-3028-1920&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/11/DetroitNews/DetroitNews/635801213734107082-101015-dy-MSUvRutgersFtbl1100.jpg", "site_section": "https://feeds.feedblitz.com/detroit/sports#", "section_title": "Detroit News - Sports", "url": "http://www.detroitnews.com/story/sports/2015/10/11/mounting-injuries-drain-spartans-depth/73769942/", "country": "US", "title": "Mounting injuries drain Spartans' depth", "performance_score": 0, "site": "detroitnews.com", "participants_count": 2, "title_full": "Mounting injuries drain Spartans' depth", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T06:27:00.000+03:00", "replies_count": 1, "uuid": "e7246ea2508736ae9640631b8b6b8bd3e21272cb"}, "author": "detroitnews.com", "url": "http://www.detroitnews.com/story/sports/2015/10/11/mounting-injuries-drain-spartans-depth/73769942/#post-0", "ord_in_thread": 0, "title": "Mounting injuries drain Spartans' depth", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Michigan State offensive lineman Jack Allen gets an emergency tape job on his ankle during a timeout at the end of the game. (Photo: Dale G. Young, Detroit News) \nCONNECT TWEET LINKEDIN COMMENT EMAIL MORE Piscataway, N.J. — The detractors and critics will call it an excuse, but the mounting injuries for No. 4 Michigan State are getting hard to ignore.\nSince before the season started, when linebacker Ed Davis was lost for the season with a knee injury, Michigan State has been touting the next-man-up approach. After Saturday's 31-24 victory over Rutgers, that was a bit harder.\nThe Spartans are conceding nothing, and few would carrying an undefeated record into the seventh week of the season. But losses were significant once again, with running back Madre London leaving with a right leg injury, offensive lineman Jack Allen suffering an ankle injury and cornerback Darian Hicks getting hit in the head and not returning in the second half.\n\"Yeah, I mean that's football,\" Michigan State coach Mark Dantonio said. \"Sometimes that's gonna happen and some things are sort of freakish things, you know, that you can't plan for. But we have a plan, who's playing, if somebody goes down, so that's what we do.\"\nThe Spartans were already plenty banged up coming into the game.\nJunior tackle Jack Conklin (knee) and junior tight end Josiah Price (ankle) were held out again while junior tackle Kodi Kieler (knee) played for the first time since the Oregon game. But he was in and out of the game on Saturday and was clearly not 100 percent.\n\"He was hurting out there and everybody recognized that,\" Dantonio said. \"We tried to get him out a little bit too, but I know he ended up playing at the end as well. He's a tough guy and just kept playing.\"\nDETROIT NEWS\nCook withstands pressure in win over Rutgers\nThe injuries on Saturday were added to season-ending injuries already suffered by Davis, cornerback Vayante Copeland and tackle Dennis Finley. Safety RJ Williamson is also out until late in the season.\nThe injury to Hicks left Michigan State with just two cornerbacks — Arjen Colquhoun and Jermaine Edmondson — who have played. True freshmen Josh Butler and Tyson Smith traveled, but Dantonio resisted putting at least Butler into the game.\nHe might not have that luxury moving forward.\n\"Very close. Very close,\" Dantonio said of pulling off Butler's redshirt. \"We're gonna play true freshmen if that's the case. He's next man up. We're trying to hold the redshirt. The guy is a very good player. Josh Butler is a very good player but he's a freshman and so we're trying to hold the redshirt for him, but we may have to play him.\"\nWho exactly is ready to go next week for the showdown with Michigan remains to be seen, but quarterback Connor Cook expects some help.\n\"Guys are going to get healthy next week,\" Cook said. \"We've got some guys that should get back. Josiah should be back, Jack Conklin should be back. I don't know what's up with Jack Allen, but he'll probably end up playing too.\n\"But like I said before, if you're really concerned about stuff like that, then you shouldn't be out there playing. We have so many other guys on this team, and they might not have the experience but they're waiting on their opportunity to step in there and shine.\"\nmcharboneau@detroitnews.com \ntwitter.com/mattcharboneau", "external_links": [], "published": "2015-10-11T06:27:00.000+03:00", "crawled": "2015-10-11T11:22:11.454+03:00", "highlightTitle": ""}