{"organizations": ["Wellfleet OysterFest", "Coast Guard"], "uuid": "317be70c0bbd79e27a4eafe470e5c21a4299c6d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.capecodtimes.com", "main_image": "http://www.capecodtimes.com/storyimage/CC/20151014/SPORTS/151019669/AR/0/AR-151019669.jpg", "site_section": "http://www.capecodtimes.com/sports?template=rss&mime=xml", "section_title": "Sports - capecodtimes.com", "url": "http://www.capecodtimes.com/article/20151014/SPORTS/151019669/101016/NEWS?rssfeed=true", "country": "US", "title": "Fishing around: In praise of the oyster, a beloved bivalve", "performance_score": 0, "site": "capecodtimes.com", "participants_count": 0, "title_full": "Fishing around: In praise of the oyster, a beloved bivalve", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T14:41:00.000+03:00", "replies_count": 0, "uuid": "317be70c0bbd79e27a4eafe470e5c21a4299c6d0"}, "author": "", "url": "http://www.capecodtimes.com/article/20151014/SPORTS/151019669/101016/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "Fishing around: In praise of the oyster, a beloved bivalve", "locations": ["Scorton Creek", "Chapin Beach", "Nauset Light", "Cape", "Washington", "Peaked Hill", "Brooks Road", "West Coast", "London", "Cape Cod Bay", "California", "Harwich", "Oyster Bay", "San Francisco Bay", "East Coast", "Bass River", "Paris", "Oakland", "Dublin", "Cotuit", "Sconset", "Wellfleet", "Nantucket"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Alex Hay", "Dionis", "Jack London", "Peter", "Woody Allen", "Hay", "Jonathan Swift", "Charles Frazier", "Dick", "Hemingway", "Mashpee-Wakeby", "Rob Conery", "Porter"], "text": "Posted Oct. 14, 2015 at 9:59 PM Updated at 6:41 AM Posted Oct. 14, 2015 at 9:59 PM Updated at 6:41 AM » Social News Jonathan Swift was born in Dublin in 1667. This was so long ago that his official occupation is listed as pamphleteer, which was like an early kind of Twitter feed. Most famous for writing Gulliver’s Travels, he also said, “It was a brave man who first ate an oyster.” Oysters look weird. They’re hard to open, and even if you just pick one up they can cut you. The writer Jack London counted among his professions —along with jailbird and boxer, seal hunter and sailor — that of oyster pirate. “I wanted to be where the winds of adventure blew. And the winds of adventure blew the oyster pirate sloops up and down the San Francisco Bay,” wrote London. This was a different time. San Francisco Bay grew oysters, but they were never abundant. West Coast oysters were smaller and tasted different. What oysters they could coax to grow had to be imported from Washington state. But with the completion of the intercontinental railway in 1869, bigger, tastier East Coast oysters were available to area entrepreneurs. Taking seed from the trains, they were able to replant them in submerged lands bought cheap from the new state of California. It worked, for a while. But it wasn’t 10 years before they formed a monopoly and eliminated competition. Prices skyrocketed under the cabal, beyond the means of working families. London was just one local who participated in the redress. The (moral and ideological) complete opposite of these shameful oyster thefts that plagued the Cape in recent years, this was some independents standing up to the big company; the little guy against the corporation. Lower prices for working families endeared the “pirates” to the local populace, and even the cops of the day frequently looked the other way at the raids. Local sentiment was united against the big oyster monopoly. London was one of the scallywags out there scratching a living from oysters. They’d work all night and sell at dawn to the markets in Oakland. Oysters flow through our literature for thousands of years, from the Roman times to today. Perhaps the most quoted oyster-ism is from Hemingway, who said in the first chapter of his Paris memoir, A Moveable Feast, that, “As I ate the oysters with their strong taste of the sea and their faint metallic taste that the cold white wine washed away … I lost that empty feeling and began to be happy and to make plans.” In his luminous Civil War novel Cold Mountain, Charles Frazier describes a three-day party at a grand house where, “They slept only from dawn to noon and lived on little but oysters and champagne and pastry.” They’re not for everyone. Woody Allen said, “I will not eat oysters. I want my food dead. Not sick, not wounded. Dead.” Cole Porter sang of falling in love, “even oysters out in Oyster Bay do it.” Oyster farming has existed since at least the first century BC and is celebrated through the ages. A local celebration is planned for this weekend, in fact, in Wellfleet. Organizer Alex Hay enjoys the Wellfleet OysterFest, roaring into its 14th year, because, “It brings together the locals to put out our best products for all to enjoy. It’s long and tiring, but we come back for more every year.” Hay said this year they’re working to continue to improve flow and accessibility (the event is very busy) and to improve sound quality. Despite the rush-hour scrum, Hay says, “I am always amazed at how the crowds are always courteous and respectful, enjoying the Fest and having a good time.” Come, pay homage Saturday and Sunday to this most glorious of bivalves, celebrated though the ages in word and song, wherever the winds of adventure blow. So while Trump is just playing a different game than everyone else, it’s time to ask… What’s going on? 1. Buzzards Bay/Cape Cod Canal:. Buzzards pretty slow, but the Canal is more than making up for that. One intrepid newspaper editor of my acquaintance, acting on some “intel” he received, did well at the east end the other day. And on Wednesday, the whole Canal was giving up fish — big boys in the middle with more schoolies to the east end. It was called “phenomenal.” 2. Islands: Dick’s Bait said this week was “nothing earth-shattering” but some fish came up, including a junior angler in the Derby who hooked a big 10.75-bonito. They’re still picking away at albies, too, a good sign for this time in October. The Derby wraps up Saturday and there’s always hope for the last-minute winner emerging from the sea for a late leader board upset. Nantucket has big blues off Coatue and bass off Sconset and Dionis. 3. Cape southside beaches and estuaries: Woods Hole still has some bass around, biting on eels this week. Poppy spit and Cotuit had solid action on bass and blues all week. Decent action on schoolies in Bass River. And one (reportedly huge) striper came up from the sands at Brooks Road in Harwich. 4. Nantucket Sound: Some action for guys jigging bass on Middle Ground, but nothing crazy. Tautog are biting on the rock piles, but tog anglers reported that abundant seabass (whose season is closed) are going nuts on their rigs. They even had some mahi mahi this week off East Chop and in the middle of Vineyard Sound, not something you see every day. 5. The Great Backside Beach: Decent action at Coast Guard and Nauset Light, where bait has been keeping moving stripers interested. Tuna bite remains strong up around Peaked Hill, the Golf Ball and Race Point. 6. Cape Cod Bay: Chapin Beach had a lot of peanut bunker the other day, but the fish chasing them were on the small side. Scorton Creek reported just OK. Freshwater: Trout are biting, largemouth bass are slowing down. Peter’s Pond had some nice rainbows and Mashpee-Wakeby was another spot mentioned. Catch em up! Information for this column was assembled from a variety of liars, exaggerators, mis-informants, ne’er-do-wells and roustabouts. In other words, from fishermen. Contributing writer Rob Conery can be contacted at robconery@yahoo.com. capecodtimes.com Posted Oct. 14, 2015 at 9:59 PM Updated at 6:41 AM", "external_links": [], "published": "2015-10-15T14:41:00.000+03:00", "crawled": "2015-10-15T19:59:59.409+03:00", "highlightTitle": ""}