{"organizations": [], "uuid": "5cf41295e856eab73434850ca38999171f166dce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dansvilleonline.com", "main_image": "http://www.dansvilleonline.com/storyimage/NE/20151020/SPORTS/151029984/AR/0/AR-151029984.jpg", "site_section": "http://www.dansvilleonline.com/sports?template=rss&mime=xml", "section_title": "Sports - The Dansville Online", "url": "http://www.dansvilleonline.com/article/20151020/SPORTS/151029984/2000/NEWS?rssfeed=true", "country": "US", "title": "Section V Boys Soccer Preview: The second season", "performance_score": 0, "site": "dansvilleonline.com", "participants_count": 1, "title_full": "Section V Boys Soccer Preview: The second season", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T20:04:00.000+03:00", "replies_count": 0, "uuid": "5cf41295e856eab73434850ca38999171f166dce"}, "author": "Sean Curran Tribune Sports", "url": "http://www.dansvilleonline.com/article/20151020/SPORTS/151029984/2000/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "Section V Boys Soccer Preview: The second season", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Oct. 20, 2015 at 12:04 PM Hornell, N.Y. While other teams were busy moving decimal points, and calculating the Section V seeding points right down to the last possible tenth, Burt Turner and his Alfred-Almond Eagles were easily wrapping up their third straight Steuben County Division II title and the top seed for the upcoming Section V, Class D1 tourney. By virtue of their 15-1 regular-season record (8-0 SCAA D-II), the Eagles earned a first-round bye and await the winner of today's No. 9 Fillmore-No. 8 Northstar Christian contest. The winner travels to the Almond on Friday for a 6 p.m. kick-off. A-A has shut out its last eight straight opponents, outscoring them 39-0 during the stretch. A-A has also recorded 13 shutouts on the year, including a 2-0 decision over the Haverling Rams — the No. 5 seed in Section V, Class B1 — back on Sept. 17 in Bath. “I’m going to say that we do feel confident. I’m not going to kid you about that. The boys have stayed humble and worked hard. We are just going to try and stick to the things that made us good, and that is good, solid defense and doing the simple things correctly,” said Turner. The Eagles are led by two of Section V’s more explosive playmakers in Jake Johnston and Levi Lawrence. Johnston has scored 17 goals on the season and added nine assists. Lawrence has tallied seven goals on the season with four assists, but has made his impact by anchoring the lockdown Eagle defense. “I think Levi Lawrence’s aggressiveness really serves his teammates well. He backs down from nobody and no team. He can be frightening with his anticipation and his fearlessness. He really serves our team well in the middle,” said Turner. “And Jake Johnston, if you haven’t seen him play, he can be frightening with his speed. He has great speed and great instincts, as well as a great ability to finish when given the opportunity.” While sectional play has been known to oust a few high seed early, Alfred-Almond is hoping to avoid an early departure by sticking to the basics and executing their X’s and O’s. “Of course we will throw in a few wrinkles that I won’t share publicly, but the most important things is executing. Winning soccer doesn’t change in sectionals. Playing good soccer in the regular season is the same process as playing good soccer in the postseason. It’s those who can keep their head under pressure and succeed in the hectic nature,” said Turner. As for the remainder of the D1 bracket, Arkport/Canaseraga earned the No. 4 seed and will have a bye until Saturday, where they will face the winner No. 12 Hammondsport and No 5. HAC. Dalton Steiner and Tanner Berglund have led the Blue Jays into the four seed. Steiner has 15 goals and six assists on the season, while Berglund has 16 goals and eight assists. Page 2 of 2 - No. 6 Jasper-Troupsburg will start off the local slate of boys sectional teams when they welcome No. 11 Honeoye to town tonight at 6 p.m. J-T is led by Brady Payne, with 16 goals and Zach Sherman, who has recorded 64 saves on the season and had 11 shut outs. In class B2, No. 3 Hornell (10-3-1) looks to seniors Sam Dagon and Isaac Snowden to continue their stellar play into the playoffs. Hornell faces off with No. 6 Pal-Mac Saturday at 6 p.m. in the Maple City. If the Red Raiders should advance, they would take on the winner of No. 2 Greece Odyssey and No. 7 Newark. On the top half of the bracket, No. 1 Livonia looks to capitalize on a successful regular season. They host the winner of No. 8 Midlakes- No. 9 Waterloo on Saturday in Livonia. After that, they will square off against the winner of No. 4 Penn Yan and No. 5 Bath-Haverling. In class B2, No. 1 Wellsville looks to make a big splash after finishing the regular season with a 12-2-2 record. The Lions will likely square off against Dansville, should the Mustangs survive their battle with No. 9 Marcus Whitman. No. 7 Wayland-Cohocton faces an uphill route to the sectional finals. First they must pull off the upset over No. 2 North Rose Wolcott. Should they survive, they will face the winner of No. 3 Holley and No. 6 Attica. Class C2 features a rarity, as Keshequa has been awarded the second seed, despite the fact that they finished the regular season undefeated at 14-0-2. Keshequa is led by a couple of goal-scoring sophomores, Damon Rathbun and Dustyn Zangerle. Rathbun has 18 goals and 11 assists on the season, while Zangerle is not far behind with 14 goals and eight assists. The No. 2 Indians will have to wait a few days before finding out their opponent, but it will be either No. 7 Bradford/Dundee or No. 10 Marion. No. 8 Campbell-Savona begins their slate Wednesday at 6 p.m. against No. 9 Pavilion/York. If they win that game, they travel to Geneseo Saturday where they would meet the No. 1 Blue Devils. All seedings and game times can be found on the official Section V website. By Sean Curran", "external_links": [], "published": "2015-10-20T20:04:00.000+03:00", "crawled": "2015-10-21T01:01:08.087+03:00", "highlightTitle": ""}