{"organizations": ["Redskins", "Bucs", "Washington Post"], "uuid": "9d8a84fef0acb3ebfb7833f838de54df99b077b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonpost.com", "main_image": "http://img.washingtonpost.com/rf/image_908w/2010-2019/WashingtonPost/2015/10/25/Sports/Images/skins121445806631.jpg", "site_section": "http://www.washingtonpost.com/rss/sports", "section_title": "Sports", "url": "https://www.washingtonpost.com/news/football-insider/wp/2015/10/25/jay-gruden-postgame-the-players-were-up-to-the-challenge/", "country": "US", "title": "Jay Gruden, postgame: 'The players were up to the challenge'", "performance_score": 0, "site": "washingtonpost.com", "participants_count": 0, "title_full": "Jay Gruden, postgame: 'The players were up to the challenge'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T00:44:00.000+02:00", "replies_count": 0, "uuid": "9d8a84fef0acb3ebfb7833f838de54df99b077b6"}, "author": "", "url": "https://www.washingtonpost.com/news/football-insider/wp/2015/10/25/jay-gruden-postgame-the-players-were-up-to-the-challenge/", "ord_in_thread": 0, "title": "Jay Gruden, postgame: 'The players were up to the challenge'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Randolph", "Scott Allen", "Jay Gruden", "Gene Wang", "Gabe Hiatt", "Thomas Johnson"], "text": "Jay Gruden, postgame: ‘The players were up to the challenge’ Resize Text Comments 0 By Gabe Hiatt October 25 at 6:38 PM The Washington Post's Gene Wang and Scott Allen discuss the Redskins' Week 7 against the Bucs. (Thomas Johnson and Randolph Smith/The Washington Post) \nOn what happened at halftime: “We decided to challenge them a little bit. The players were up to the challenge and they came out and played. This isn’t about anything I said before the game or ‘ Code Red ’ or halftime adjustments or anything like that. It’s about 46 men coming out of the break and stepping up and making some plays.” \nOn the offense speeding up in the second half: “This was a players’ game. The players came out and made some plays. First-half play calls weren’t that much different than the second. It was just about them guys making some plays and stepping up, Kirk making some big-time throws and guys making runs after the catch and getting into a rhythm. We had some runs, which helped. We just got into the rhythm of our offense. The first half we had no rhythm, and nothing really went in a positive way on both sides of the ball. I think we had 20 yards in the first quarter. They had 200. It was a total domination by Tampa. Hats off to all our guys for stepping up and winning this thing.” Jay Gruden’s team earned a satisfying come-from-behind victory. (Katherine Frey/The Washington Post) \nOn ‘Code Red:’ “The ‘ Code Red ’ had absolutely nothing to do with anything. It was just something I said after the game. These guys knew the importance of this football game. They know the importance of every game. I just like the way that we came out. We laid an egg again in the first quarter. I like the fact that nobody blinked. They all came together. They all played together. Nobody stopped believing. The offense rallied. The defense got some big stops. That’s what football’s all about. That’s what team football’s all about, man. So I’m happy for each and every one of those guys. It had nothing to do with any ‘Code Reds’ or talks at halftime.” \nOn Bashaud Breeland stopping Doug Martin: “Play of the day. They score there and the game is over. And that shows what type of guy he is. And I talk about Breeland being the ultimate competitor. If he takes that one play off for one instant, they go up by 10 and the game’s over, most likely. He hustled, got him down at the 5. We got the big stop and held them to a field goal. We go down and score, so I think there’s a lot of plays – When we go back and watch this film, I think there’s a lot of effort plays like that. There’s a lot of things we can improve on, obviously, but when you see effort plays like that, they stand out and they make your team better in the long run.” \nOn what the comeback says about Kirk Cousins: “He’s a quarterback and there’s going to be pressure on him every week. How he responds to that is going to make him. He’s going to have his ups and downs as a professional quarterback in the National Football League. Everybody does, and you have to fight through that. You have to stay the course, be patient, go through your reads, your progressions, keep your head up. And he’s done that. So I’m very happy for Kirk. I’m very happy for the entire offense. The pass protection was outstanding when we had to have it. The receivers made big-time catches for him when they had to, so it’s not just about Kirk, but I am happy that he was able to do what he did with all the scrutiny around him. But he’s kept a level head and did a great job today.” \nOn Gruden’s emotions at halftime compared with after the game: “I was a little bit upset. It is quite the emotional roller coaster to say the least. But you got to have faith in your team. And you have to make sure they understand the importance of each play of each game, and I think they did that. They came out and they were under pressure, under scrutiny, obviously, a big deficit, and they came back and fought. You know we got the big touchdown, got the onside kick, got the momentum back and we were able to keep it and make some big plays. This football – this game of football, each week is an emotional roller coaster. Each day. You read the paper, you do this. Somebody’s talking good. Somebody’s talking bad. This week, hopefully we’ll have some good things said about us. Hopefully we can keep it going for more than a week in a row.” \nOn if the onside kick was based on a look or based on Dustin Hopkins: “Both. I think [Special Projects/Special Teams Assistant] Coach [Bret] Munsey, he’s part of our special teams staff, and [Special Teams Coordinator Ben] Kotwica and [Assistant Special Teams Coach Bradford] Banta, they did a great job of sniffing it out. They saw the alignment there. We worked on it all during practice, and we saw the looks a couple of times we kicked off before that. We liked the opportunity to take a shot with it. And starting the third quarter, if we scored, that’s when we were going to do it. And it worked out perfectly. Great kick. Great kick by Hopkins, and big play. Big play on the game.” \nOn Jordan Reed: “He’s a great route runner in zone when they play zone. And when they play man, we feel like we like the matchup. He did a good job of winning man-to-man matchups whether it’s under routes or slant routes like he did at the end of the game. It’s a tough deal for defensive coordinators, defenses to deal with. You can see what type of impact he has on our offense when we’re rolling. One, he’s got to win, which he did many times. And then, two, he’s got to read zone. And then, three, we’ve got to have protection and Kirk’s got to throw it. And so Jordan had a big-time game, had a big-time impact on this game today.” \nOn going into the bye with a win: “There’s a little bit of relief, but we’re 3-4. We’ve got a bye week and we’re still probably going to be right around last place in our division, but it’s a huge win for our psyche, again. We’ll come back and we’ll have a great week of practice when we come back off the bye and we’ll get ready for the New England Patriots. So it’s going to be another great challenge. We can enjoy this for a little while. They’ve deserved some enjoyment around here for a long time, and then we’ve got to get back to work. So not much relief in sight.” \nOn special teams, punter Tress Way and Dustin Hopkins: “Tress did outstanding, man. He had some rush, and he still got the ball off and made some big-time punts, and the coverage was outstanding. Hop, I mean, he’s kicking the ball into the wind out of the end zone. We score with 30 seconds to go in the game and we’re kicking off against the wind, it’s very easy they could get a return to our 35 or our 40 if he squibs it or whatever, but he kicked the ball in the end zone and put them backed up at the 20. That’s a huge kick. The extra point is big against the wind. He’s been making kicks all year for us. He’s been a great addition to our football team and special teams overall has done an excellent job.” \nOn if he was worried about a second straight Buccaneers blowout: “Well, you’re upset with what’s taking place. They were able to do whatever they wanted. They were able to throw the ball up top and score. They were able to run the ball and knock it down our throats. We weren’t able to do anything. We couldn’t run the ball. We couldn’t throw the ball. We couldn’t protect. So there was not a lot of positive to take out of the first half other than that one scoring drive that we had. It was 24-7 at the half. It’s just matter of teaching our fundamental football, having these guys step up man-on-man and make some plays. And I think they all did that in the second half.” \nOn Pierre Garcon’s reaction to the halftime deficit: “He’s one of those guys that gets very emotional and very angry, yes. We have a few of those guys. That’s not a position you ever want to be in on the sideline. Anybody who wants to aspire to be a coach, be down 24 to nothing in front of a bunch of pro athletes. It’s not fun. But it’s a matter of keeping them up, keeping them upbeat and keeping them positive and letting them know that we can get back in this. And the touchdown to make it 24-7 to cut it 17, I was upset at the fourth-and-two conversion where we had the false start or the illegal motion, that was a big play I thought, but we bounced back and made some plays. I think everyone in the locker room was perturbed at that time.” \nOn making the comeback in front of the alumni: “It’s huge. I talked to our team last night about the alumni being here. These guys paved the way for them as athletes and as professional football players for the Washington Redskins, we want to make them proud and show them that all the work that they put into this organization did not go for naught. To come back and battle back and give them something to cheer about on their alumni weekend, man, it was an awesome feeling. It was great to shake a lot of those guys’ hands and it was huge to get a victory in front of them. Because, like I said, they paved the way for all of us.” \nOn keeping Tampa off balance without a running game: “I think around here if you watch us on tape, I still think we have the threat of the run. Even though we may not be successful I still think we can get the play-actions off of them and we can still get some of the bootlegs, which helped a little bit today. But we do have to do better, 18 carries for 31 yards or 51 yards is not good enough. We have to continue to work on our running game and figure out what is slowing us down. Like I said, it’s a combination. Sometimes if you can’t run it, you’ve got to throw it, and that’s what we had to do today.” \nOn if Matt Jones is better suited to the offense than Alfred Morris: “No, it has nothing to do with suited. We run the same runs with Alfred and Matt. There’s a couple differences, but Alfred’s been unlucky. He hasn’t had good looks. Matt’s had a couple good looks, but like I said, man, if we can’t run the ball with any consistency, it’s going to be hard to get either one of them touches, let alone both. So we’re not down on Alfred. We’re not down on Matt. We’re not down on the running game. We just got to keep working. It’s a major part of our offense moving forward.” \nOn the play calls from the 6-yard line: “We were going to throw that wonderful bubble screen to [Jamison] Crowder if we got the look. That would really tick a lot of people off. But we had man-to-man instead with Jordan Reed on a safety, and that’s the side we decided would work. So we had kind of a double whammy there. But it was a good play. It was a good route, a great route by Jordan. Not easy to win in that tight space. He won on the first one, too, the fade. Kirk just overthrew him. We came back to the quick slant on him.” \nMore from The Post :", "external_links": [], "published": "2015-10-26T00:44:00.000+02:00", "crawled": "2015-10-26T00:50:46.212+02:00", "highlightTitle": ""}