{"organizations": [], "uuid": "8b1569567083ae44a79238642b012e886541b572", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.indiatvnews.com", "main_image": "http://images.indiatvnews.com/sportscricket/IndiaTv8e8e9f_gambhir-final.jpg", "site_section": "http://www.indiatvnews.com/rssfeed/sports_cricket_news.xml", "section_title": "Sports >> Cricket News", "url": "http://www.indiatvnews.com/sports/cricket/ranji-shocker-gautam-gambhir-in-a-showdown-with-manoj-tiwary-18393.html", "country": "SG", "title": "Ranji shocker: Gautam Gambhir in a showdown with Manoj Tiwary", "performance_score": 0, "site": "indiatvnews.com", "participants_count": 0, "title_full": "Ranji shocker: Gautam Gambhir in a showdown with Manoj Tiwary", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T22:45:00.000+03:00", "replies_count": 0, "uuid": "8b1569567083ae44a79238642b012e886541b572"}, "author": "", "url": "http://www.indiatvnews.com/sports/cricket/ranji-shocker-gautam-gambhir-in-a-showdown-with-manoj-tiwary-18393.html", "ord_in_thread": 0, "title": "Ranji shocker: Gautam Gambhir in a showdown with Manoj Tiwary", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Gautam Gambhir"], "text": "5 times Gautam Gambhir got into a nasty brawl (Watch videos) \nNew Delhi: India discards Gautam Gambhir and Manoj Tiwary were today involved in an ugly on-field altercation and nearly came to blows during the Ranji Trophy match between Delhi and Bengal at the Feroz Shah Kotla stadium here. \nDelhi captain Gambhir, who had been involved in ugly on-field confrontations even in the past, had an angry exchange of words with his Bengal counterpart before the umpire had to step in to defuse the situaion. \nUmpire K Srinath had to come between the two players as Gambhir moved towards Tiwary to hit him. The Bengal skipper too came charging at Gambhir, the former Indian captain and opener who has played 56 Tests and 147 ODIs for the country. \nA livid Gambhir did not pay heed to Srinath's attempts at pacifying him and tried to get him out of the way. \nTouching an umpire is a grave offence in cricket, which could invite a ban. \nThe two players were summoned for a hearing after the day's play by Match Referee Valmick Buch but the quantum of punishment, if any, will only be known tomorrow after the match ends. \nThe incident happened in the eighth over when Partha Sarathi Bhattacharjee got out of Manan Sharma's bowling and Tiwary came in to bat at No. 4 wearing a cap. \nTiwary first took guard and was about to take strike. But he stopped the bowler and signalled at the dressing room to bring his helmet as a pacer was operating from the other end. \nDelhi players felt that it was a deliberate time wasting tactic. \nManan ticked off Manoj and he told him to lay off. All of a sudden, Gambhir, at first slip, got into the action and started abusing the Bengal skipper, who then retaliated. Read Also: Shaam ko mil tujhe maroonga: Gautam Gambhir threatens Manoj Tiwary, pushes umpire \n\"I have huge respect for Gautam gambhir for whatever he has done for the country but today he crossed the limit with his comments. He made personal comments. I was really shocked as I did not start it at all. He is much senior to me and Irespect him,\" Tiwary said in his defence. \n\"I had kept my helmet beside the boundary rope as it has become wet and I wanted to dry it. That was about it and everyone saw I was not the first one to react. He tried to hit but could not. He pushed the umpire who came in between. It's their in the video, you all have seen it.\" Gambhir, on his part, merely said, \"nothing happened,\" \nwhen asked for a reaction. Delhi coach Vijay Dahiya, on the other hand, tried to downplay the incident. \n\"It happens when two captains are passionate about the game. The match referee will decide based on umpire's report. This is not first time it has happened and neither is it the last time,\" he said. \nBengal bowler Pragyan Ojha also said that these kind of incidents should not be seen as shocking on the field. \n\"I know cricket is a gentleman's game but when men play, these things happen. This is not the first time it has happened on cricket field and let's talk about Bengal'sperformance than this small incident,\" he said. \nThe furore started with Gambhir saying: \" Shaam ko mil tujhe maroonga (Meet me in the evening, I will hit you). And Tiwary retorted, saying: \" Shaam kya abhi bahar chal (Why wait till evening, let's go out and settle it now\"). \nUmpire Srinath then sprinted from the bowler's end. Gambhir, with his fists raised, charged towards Tiwary,who was also not ready to back down. Umpire Srinath came in the middle, but Gambhir to everyone's horror pushed the umpire trying to get him out of the way. \nManoj was then seen shouting at Gambhir, saying: \"Did I tell you anything? Why did you have to come in between.\" \nBengal manager Sameer Dasgupta was also summoned by match referee to hear his team's version, while Delhi was represented by Manoj Kapoor. \nThe left handed Gambhir, who was a regular in the Indian team till a few years back, played 56 Test, scoring 4046 runs with nine centuries and 21 fifties at a decent average of 42.58. \nIn ODIs, he scored 5238 runs in 147 matches at 39.68. He hit 11 hundred and 34 half-centuries. He played 37 T20s and managed 932 runs at 27.41. \n ", "external_links": [], "published": "2015-10-24T22:45:00.000+03:00", "crawled": "2015-10-26T02:55:42.533+02:00", "highlightTitle": ""}