{"organizations": [], "uuid": "d60266de563a656334e2b1b3054294f8a5929c94", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/Portal/6/Sports.aspx", "section_title": "Sports - Ahram Online ", "url": "http://english.ahram.org.eg/NewsContent/6/55/161075/Sports/World/Chelsea-boss-Mourinho-to-appeal-fine,-backed-by-Pu.aspx", "country": "EG", "title": "Chelsea boss Mourinho to appeal fine, backed by Pulis - World", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Chelsea boss Mourinho to appeal fine, backed by Pulis - World - Sports - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "d60266de563a656334e2b1b3054294f8a5929c94"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/6/55/161075/Sports/World/Chelsea-boss-Mourinho-to-appeal-fine,-backed-by-Pu.aspx", "ord_in_thread": 0, "title": "Chelsea boss Mourinho to appeal fine, backed by Pulis - World", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Mourinho handed suspended ban, fined for ref comments Chelsea manager Jose Mourinho will appeal against a heavy fine imposed on him by the English Football Association for criticising referees, he said on Friday.\nMourinho was fined 50,000 pounds ($77,425) and threatened with a future stadium ban on Wednesday for saying referees were afraid to award penalties to the Premier League champions after Chelsea's 3-1 home defeat by Southampton on Oct. 3.\n\"I have to be honest with myself so I have to appeal,\" he told a news conference on Friday, a day after calling the punishment \"an absolute disgrace\".\nHe was backed up by West Bromwich Albion manager Tony Pulis, who told reporters earlier that the fine was \"an extraordinary amount of money\".\n\"Where does it all go?\" Pulis asked. \"Does it go to charity? I've been fined a few times by the FA and when I asked, I didn't get an answer.\"\nPulis wants the League Managers Association and the Premier League to call a meeting of all managers to discuss similar cases that have occurred this season.\n\"We have to have a meeting to find out what's going on,\" he said.\nThe FA later told Reuters that money from fines \"is all put back into football, including the grass roots of the game\".\nMourinho will be hoping to avoid any further controversy on Saturday in what Chelsea would normally expect to be a straightforward home game against Aston Villa, who have a poor record at Stamford Bridge.\nBut the champions themselves are on a bad run and in the bottom six of the Premier League, after only one win in their last five league games and one in four at home.\n\"We can't run away from the reality of the numbers,\" Mourinho told reporters.\n\"Every game is must-win for different reasons and we need points.\n\"Every team coming now to Stamford Bridge doesn't fear us, they believe they can get a result.\"\nHe believes, however, that a busy fixture-list in the league, Champions League and League Cup could help improve results and confidence.\n\"It is a great month, non-stop, so many matches. To play and play again is the best thing that can happen.\"\n(For more sports news and updates, follow Ahram Online Sports on Twitter at @AO_Sports and on Facebook at AhramOnlineSports .)", "external_links": ["https://twitter.com/AO_Sports", "https://www.facebook.com/AhramOnlineSports?fref=ts"], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-17T17:50:40.351+03:00", "highlightTitle": ""}