{"organizations": [], "uuid": "cce631d4ee63edfc216bef3384cf0774a0745dcb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "", "site_section": "http://www.financialexpress.com/section/sports/", "section_title": "Sports News:Sports News Headlines,Cricket News Updates,Cricket News Live Score | The Financial Express", "url": "http://www.financialexpress.com/article/fe-columnist/the-spine-angle/156431", "country": "IE", "title": "The spine angle", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "The spine angle | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T07:29:00.000+02:00", "replies_count": 0, "uuid": "cce631d4ee63edfc216bef3384cf0774a0745dcb"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/fe-columnist/the-spine-angle/156431", "ord_in_thread": 0, "title": "The spine angle", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Inside track Paradise lost, will it be regained? Youtube pay I remember poring over Gary Player’s Golf Begins at 50 when I was 15 years old. My grandfather had just developed a severe back condition and the doc had asked him to lay off golf. He gave me the book and urged me to work on a golf swing that would, above all, put the least amount of strain on the body.\nPlayer, the legendary South African player, was the first pro to incorporate a serious physical regimen, which included strength exercises, yoga and stretching, in his golf training routine. That book outlined a radical departure from the ‘square-to-square’ swing, which had been popularised by the golf stars of the day, including Jack Nicklaus and Tom Watson. Immediately identifiable by the ‘reverse C’ finish position, this swing used a great amount of lateral leg drive and put a tremendous amount of strain on the lower back. Player, ridiculed at the time for his ‘walk-through’ swing, advocated more wrist movement and weight transfer, a bit like a boxer landing a punch. I’m not sure how many people picked up Player’s swing in the 1980s. I, for one, was not impressed, as teenagers are wont not to be, with anything that dropped distance in favour of some amorphous gains in the future.\nToday’s golfers look a lot like the illustrations in that book. The ‘reverse-C’ is relegated mostly to history and most players work at finishing with a straight back, facing the target. A couple of years back, I played with Sumit Rathor, a single-handicapper and member of the manging committee of the Karnataka Golf Association GC in Thailand. I hit my clubs at least one club longer than Rathor, but that was totally beside the point: not only did he have a lovely smooth swing, but was deadly accurate and reasonably long off the tee. But what shocked me most was the absence of calluses on his hands. Now, anyone who plays golf more than once a week is likely to have workman’s hands in varying degrees. Now, Rathor’s gentle swing did not leave any marks, especially since (shockingly, for a golfer of his calibre) he never practised. “I want to play golf all my life. And I feel that my back will only be able to make that many swings. I don’t want to waste those on the driving range!”\nNow that sounds like anathema to golfers who like banging balls at the range. Working at the game is an inseparable part of playing golf. But it’s a sobering thought and a good one to remember the next time you’re hitting balls at the range without a target or a conscious understanding of what you’re trying to achieve. Then it’s just exercise at best and physically bad for you at worst.\nOf course, the pros have no option but to hit thousands of golf balls. And that takes a toll. I wasn’t surprised to hear about what may be literally the last nail in Tiger Woods’ coffin, at least as far as his pro career is concerned. Woods, who had a second back surgery recently, will be taking an extended break from the game to rehabilitate his spine. Coming back to pro golf, competing and winning is pure fantasy right now—Woods hasn’t won in three years and this break isn’t likely to do his confidence any good.\nAt least to me, there are two things to be weaned from a retrospective of Woods’ career: he was the first golfer to usher in the ‘power’ era in golf. From a naturally lanky teenager, he transformed his body in the gym to suit how he wanted to hit the golf ball. What he made up in speed and power he lost in flexibility, which, ironically, is what he says he wants to regain now. Secondly, he was obsessed with the golf swing, committing to at least three major rebuilds over the course of his career. Golf’s history is littered with instances of promising players losing their game due to their obsession with the ‘prefect golf swing’. The best players—whether it’s Fred Couples, Bernhard Langer, Sam Snead or Annika Sorenstam—have stuck to their iterations of the golf swing. Something that worked for them and which they refined and refined. It’s a good idea to work at golf, but possibly not such a good one to try and mould your swing into an image of another player, or some fantasy ideal.\nThat said, of course, there is room to improve, and that starts with the body, not with the swing. “Lots of times, when people come to me for a lesson, I send them off with a series of exercises to practice for a couple of months. Saves them money and time,” says Pritam Saikia, who runs the Ultimate Performance Centre at the Golden Greens GC in Gurgaon. Saikia’s students typically work out, go for runs and play football as part of their daily golf regimen in addition to hitting balls and playing the course.\n“Yes, you can have an individual golf swing, but it has to adhere to certain well-established fundamentals. And if you have weak glutes and legs, or are too stiff in the shoulders, for example, then your body just can’t make those moves. Trying to do so will result in certain injury,” he says.\nTwo such players, who’d hurt themselves out of competitive golf for a bit made a welcome return at the ongoing UBS Hong Kong Open that ends today. At the time this column was written, defending champion Anirban Lahiri was nipping at the heels of the leader-group after the opening two rounds. But much more heartening than Lahiri’s tied-fifth position was the presence of two of my favourite golfers in the top 10. Jeev Milkha Singh, the indefatigable veteran from Chandigarh, and Gaganjeet Bhullar—who, in my opinion, has the sweetest golf swing that Indian golf has ever seen—both are in action on the international stage after extended injury layoffs.\nI would put my money on Bhullar regaining his pre-eminent spot amongst the current crop of players very quickly as long as he stays fit, while for Singh, one can only hope that he stays injury-free long enough to add a few more titles to his kitty. Singh has always put himself through a punishing playing schedule and had to deal with a string of injuries over the years. Still, at 43 years of age, he’s still playing, and competing. That’s more than what one can say about a certain Mr Woods.\nA golfer, Meraj Shah also writes about the game\n 25, 2015 12:29 am", "external_links": [], "published": "2015-10-25T07:29:00.000+02:00", "crawled": "2015-10-25T09:01:52.818+02:00", "highlightTitle": ""}