{"organizations": ["Redskins"], "uuid": "eed2dc0c84b3d4c8ce348281f4692e5eb8969e3a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pendletontimespost.com", "main_image": "", "site_section": "http://pendletontimespost.com//feed/sec/6000/", "section_title": "PendletonTimesPost.com - Sports News", "url": "http://www.pendletontimespost.com/view/story/b8641041a50d4af3804c6b2b2a817957/FBN--Redskins/", "country": "US", "title": "Redskins, Cousins falter in second half, fall to Jets 34-20", "performance_score": 0, "site": "pendletontimespost.com", "participants_count": 0, "title_full": "Redskins, Cousins falter in second half, fall to Jets 34-20", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T01:18:00.000+03:00", "replies_count": 0, "uuid": "eed2dc0c84b3d4c8ce348281f4692e5eb8969e3a"}, "author": "", "url": "http://www.pendletontimespost.com/view/story/b8641041a50d4af3804c6b2b2a817957/FBN--Redskins/", "ord_in_thread": 0, "title": "Redskins, Cousins falter in second half, fall to Jets 34-20", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Gruden", "MIKE FARRELL"], "text": "Gruden says Cousins still the Redskins' man under center after 34-20 loss to Jets By MIKE FARRELL Associated Press   6:18   6:18   \nNew Jersey (545) \n\nEAST RUTHERFORD, New Jersey — Even as the losses continue and the interceptions mount, Kirk Cousins remains the quarterback of the Washington Redskins . \nFor now, anyway. \nJay Gruden gave Cousins a vote of confidence following a 34-20 loss to the New York Jets on Sunday. When asked if Cousins was the starter for the rest of the season, Gruden said: \"Yeah, that's the intent.\" \nGruden needs more production from his entire team, including Cousins. The Redskins had no running game to speak off, generating only 34 yards. \n\"You hate to pin this game on Kirk,\" Gruden said. \"I know he could have played better. We had no running game whatsoever. Kirk is not in a stage in his career right now, nor is anybody on our roster, to carry our team throwing the ball as much as we would have had to today.\" \nAnd once again, Washington suffered a third-quarter meltdown, giving up 17 points in the frame as the Jets rallied from a 13-10 halftime deficit. The Redskins have been outscored 46-3 in the third quarter this season. \n\"The third quarter's been a nightmare for us,\" Gruden said. \nCousins was 25 of 43 for 196 yards with a touchdown to Pierre Garcon and two interceptions. He has two interceptions each in four games this season — all losses. Cousins has no INTs in Washington's two wins. \n\"If I start to doubt, I'm not going to ever get to the level I want to go,\" Cousins said. \"I've got to keep going, learn from mistakes.\" \nThe Jets, on the other hand, cleaned up their early mistakes. \nRyan Fitzpatrick threw two touchdown passes and ran for another score. Chris Ivory ran for 146 yards and a TD on 20 carries for the Jets, who improved to 4-1 for the first time since the 2010 team opened 5-1. Brandon Marshall had seven catches for 111 yards, and Eric Decker also caught a TD pass. \nThe Jets, coming off a bye week, trailed at halftime with the Redskins (2-4) scoring their points off three turnovers by Bashaud Breeland, who had an interception and two fumble recoveries. \nBut New York opened the second half with 24 straight points to take control against a Washington team without several starters, including wide receiver DeSean Jackson, left tackle Trent Williams and cornerbacks DeAngelo Hall and Chris Culliver. \n\"If you want to be a great team,\" Marshall said, \"you've got to be able to punch through adversity.\" \nThe Redskins downgraded Jackson to out Saturday; he hasn't played since the season opener because of a left hamstring injury. Tight end Jordan Reed, center Kory Lichtensteiger and backup running back Matt Jones were also out. \nWith so many injuries, even Robert Griffin III was active — as the Redskins' third-string quarterback — for the first time this season. \n\"I don't like to make excuses about anything,\" Gruden said. \"I just know that we had an opportunity to play the New York Jets today with 46 able players, and they were better than us. They were better coached, better prepared.\" \nNick Folk tied it at 13 with a 39-yard field goal early in the second half. Two plays later, the Jets got the ball back when Darrelle Revis made an easy interception of Cousins' pass for Ryan Grant. \nWith the ball at the Redskins 18, the Jets wasted no time as Fitzpatrick took off up the middle, got a big block from tight end Kellen Davis near the goal line and got into the end zone for a 20-13 lead. \nMarshall made it 26-13 with a terrific fingertips catch just off his shoe tops, getting inside of Breeland on a low throw. He then scooted down the sideline for a 35-yard TD — as Breeland sat on the field with his head in his hands in disbelief. \nNew York got the ball back when Marcus Gilchrist picked off Cousins' deep pass for Jamison Crowder. Decker caught a 2-yard pass to put the Jets comfortably in front, 34-13 early in the fourth quarter. \nThe Redskins crept closer when Jeron Johnson blocked Ryan Quigley's punt and Rashad Ross recovered in the end zone with just under four minutes left. But Davis recovered the onside kick. \n\"The second half, we laid an egg,\" Gruden said. \"A big egg.\" \nNOTES: Redskins S Trenton Robinson sprained an ankle and a thumb. ... Washington dropped to 4-1 on the road against the Jets. ... Dustin Hopkins kicked a career-best 54-yard field goal in the second quarter. \nOnline: \nAP NFL website: http://www.pro32.ap.org and AP NFL Twitter feed: http://www.twitter.com/AP_NFL \n ", "external_links": [], "published": "2015-10-19T01:18:00.000+03:00", "crawled": "2015-10-19T01:31:27.609+03:00", "highlightTitle": ""}