{"organizations": [], "uuid": "b84aa2c695c6b4859ff08652b379ee0c26086a28", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "dailytrojan.com", "main_image": "http://dailytrojan.com/wp-content/uploads/2015/02/DT-facebook1.png", "site_section": "http://dailytrojan.com/category/sports//feed/", "section_title": "Daily Trojan » Sports", "url": "http://dailytrojan.com/2015/10/25/womens-soccer-defeats-colorado-3-0/", "country": "US", "title": "Women’s soccer defeats Colorado 3-0", "performance_score": 0, "site": "dailytrojan.com", "participants_count": 1, "title_full": "Women’s soccer defeats Colorado 3-0", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:36:00.000+02:00", "replies_count": 0, "uuid": "b84aa2c695c6b4859ff08652b379ee0c26086a28"}, "author": "Daily Trojan Staff", "url": "http://dailytrojan.com/2015/10/25/womens-soccer-defeats-colorado-3-0/", "ord_in_thread": 0, "title": "Women’s soccer defeats Colorado 3-0", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "0 Comments / in Soccer , Sports \nThe women’s soccer team continued its outstanding run of form this weekend, edging Utah 1-0 on Friday before downing Colorado 3-0 on Sunday. \nThe Women of Troy improved to 12-4-1 on the season. Only one of those four losses came in conference play. \nFriday’s game against Utah was of the grind-it-out genre. It was not the team’s most dominant performance, but USC still managed to get the result. gainst a stingy Utes side. \nThe lone goal came from the penalty spot, courtesy of junior midfielder Mandy Freeman. \nThere was never a doubt on Sunday though, as the Women of Troy nabbed two first-half goals and never looked back against Colorado. \nJunior forward Savannah Levin got on the end of a Freeman cross to open the scoring in the ninth minute. The goal was Levin’s first of the campaign. \nMorgan Andrews then doubled the lead at 23 minutes, as she fired a penalty kick past Buffs goalkeeper Scout Watson. The goal gave the Women of Troy breathing room and allowed them to play a freeflowing style as the match progressed. \nAndrews struck again at 51 minutes off of a Kayla Mills corner kick. The powerful midfielder soared for a header inside the box, made solid connection and found the top corner of the goal. Andrews, who now has five goals on the season, was dominant against a talented Buffs team on Sunday. \n“It just came down to going in as hard as we can and matching their aggressiveness,” she said. \nMeanwhile, head coach Keidane McAlpine felt that his team rebounded from a sluggish performance on Friday and was thus able to come out firing on Sunday. \n“I thought we learned a lot from Friday,” McAlpine said. \nElite teams can prove that an average performance is a mere aberration, which was certainly the case for USC this weekend. The Utah game was a decent showing, whereas the bounce-back performance against Colorado was as convincing as it gets. \nThe Women of Troy have a stacked roster, an outstanding coach and fantastic team chemistry. \n“You just really want to just show what you have and that you’re having fun out there,” Andrews said. “I worked as hard I could for my teammates, and they did the same thing for me.” \nThe Women of Troy work for each other, hold themselves accountable and have fun. \nWhile it is important to have a good time out there, playing a proper game and dominating possession makes the experience enjoyable. \nNot only did the Women of Troy see more of the ball than the Buffs, but they also logged 29 shots on the afternoon. That means they took a shot about every three minutes, which shows just how explosive this team is on offense. \nThat said, offensive fireworks must be complemented by defensive fortitude. \n“Because our offense was so good, the defensive side was good as well,” McAlpine said. \nConsistent play on offense took a tremendous amount of pressure off of the defense against the Buffaloes. \nDespite the fact that USC dominated, the defense stood tall when it was asked to do so. \n“I thought our organization on the defensive end was pretty good most of the day, so it was a really, really solid day,” McAlpine said. \nMcAlpine was encouraged by his team’s improvement on Sunday. \n“We were a little bit more on the front foot, making better decisions, and thus turned into early goals and early chances, which was great for us,” he said. \nThe Women of Troy are not only making chances — they are taking them. They are riding a five-game win streak and have outscored their opponents 13-2 during that stretch. \nThe Colorado game was the last home contest of the year for the Women of Troy, who were celebrating their seniors on Sunday. In front of a capacity crowd of 568 at McAlister Field, the team honored its eight seniors before putting on a show for the faithful. \nMcAlpine was appreciative of the crowd’s support and added that his team was able to feed off the enthusiasm coming from the bleachers. \n“It was the perfect way for these seniors to play their last home game,” he said. \nThe Women of Troy, ranked No. 24 in the country, will head north to take on Stanford and Cal this week. \n“Now we’ve got Stanford sitting in front of us. We’ve got to bring the proper energy to the game,” McAlpine said. Share this entry", "external_links": [], "published": "2015-10-26T02:36:00.000+02:00", "crawled": "2015-10-26T04:43:20.369+02:00", "highlightTitle": ""}