{"organizations": ["US Open"], "uuid": "d00dde6c3d21c467eb94634d14d60f55cb3e3ae4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/338899c6f3b836523a18bfd59165be75.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/tennis/eugenie-bouchard-sues-over-us-open-fall/6937873/", "country": "JE", "title": "Eugenie Bouchard sues over US Open fall", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "Eugenie Bouchard sues over US Open fall", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T06:46:00.000+03:00", "replies_count": 0, "uuid": "d00dde6c3d21c467eb94634d14d60f55cb3e3ae4"}, "author": "", "url": "http://www.sport.co.uk/tennis/eugenie-bouchard-sues-over-us-open-fall/6937873/", "ord_in_thread": 0, "title": "Eugenie Bouchard sues over US Open fall", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Eugenie Bouchard"], "text": "Eugenie Bouchard sues over US Open fall 15 Oct 2015 03:46:53 \ncomments \nEugenie Bouchard has launched legal action against the United States Tennis Association and USTA National Tennis Center following her fall at the US Open on September 4. \nThe 21-year-old Canadian withdrew from the grand slam tournament due to concussion prior to a fourth-round match. Seeded 25th at Flushing Meadows, she suffered a head injury in a fall behind the scenes after playing mixed doubles late in the day . \nA lawsuit filed in the United States District Court for the Eastern District of New York, in Brooklyn, alleges negligence and includes a demand for a jury trial, with Bouchard seeking damages. \nIt includes the allegation that Bouchard \"was caused to slip and fall on a dangerous condition created by the defendants in the physiotherapy room attendant to the women's locker room\". \nThe lawsuit says that Bouchard slipped on \"a slippery, foreign and dangerous substance\" on the tiled floor of the physiotherapy room, alleging the defendants either caused or should have known of the floor condition, and that Bouchard was not made aware. The substance involved is not specified in the case papers. \nThe lawsuit adds that Bouchard sustained a \"severe injury to her head, including, but not limited to, a concussion\", and that the head injury also caused her to withdraw or retire from the subsequent Japan Open, Wuhan Open, China Open and Hong Kong Open tournaments, resulting in a fall of 13 rankings places. \nBouchard was runner-up at Wimbledon in 2014 and after a run of disappointing results this season was enjoying a positive run at the US Open. \nThe lawsuit says she continues to suffer pain as a consequence of the fall, resulting in medical costs, a loss of income and affecting her quality of life. The USTA has declined to comment on the lawsuit. Related Sport News", "external_links": [], "published": "2015-10-15T06:46:00.000+03:00", "crawled": "2015-10-15T20:07:06.589+03:00", "highlightTitle": ""}