{"organizations": [], "uuid": "bd8e0c7d922615ea963c3bb7b55b7b952bee2413", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mcall.com", "main_image": "http://www.trbimg.com/img-53fdf16a/turbine/mc-fb-default-image-20140827", "site_section": "http://www.mcall.com//sports/rss2.0.xml", "section_title": "Sports - The Morning Call", "url": "http://www.mcall.com/sports/college/mc-lafayette-georgetown-football-1010-20151010-story.html", "country": "US", "title": "Georgetown Homecoming Day win over Lafayette", "performance_score": 0, "site": "mcall.com", "participants_count": 1, "title_full": "Georgetown Homecoming Day win over Lafayette - The Morning Call", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T05:14:00.000+03:00", "replies_count": 0, "uuid": "bd8e0c7d922615ea963c3bb7b55b7b952bee2413"}, "author": "mcall.com", "url": "http://www.mcall.com/sports/college/mc-lafayette-georgetown-football-1010-20151010-story.html", "ord_in_thread": 0, "title": "Georgetown Homecoming Day win over Lafayette", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON – Lafayette quarterback Drew Reed was sacked three times in one second-quarter series on Saturday afternoon on Georgetown's Multi-Sport Field.\nSomehow, Lafayette eventually managed to score a touchdown on that possession.\nThat's the good news. That's all the good news.\nThe bad news is the Leopards did very little else noteworthy in the other 53 minutes, 15 seconds, falling behind 24-7 in the first half as Georgetown opened its Patriot League season with a surprisingly easy 38-7 victory.\nThe Hoyas converted five of seven third-down situations in the first half to gain control, stuffed the Lafayette running game from start to finish and made it a happy Homecoming Day for the sun-drenched crowd of 3,104.\n\"We got completely outplayed and beaten,\" Lafayette head coach Frank Tavani said after his team was dropped to 1-5 overall and 0-2 in the league. \"I have to look at everything and see what we can do, particularly offensively. We've got five games, four league games, left.\n\"I said all along we'd come down here and have a tough football game, but to get spanked like that is not something we saw coming. I know everybody's disappointed and nobody is more disappointed than I am. Our alumni and fans have every right to be upset, and I'm the guy they should be upset with.\"\nIt's going to be difficult for Lafayette to live by Tavani's 24-hour rule this week because every player in the game has to be befuddled — not by another loss, but by the fact that Georgetown executed it with such authority.\nThe Hoyas, who were thumped by Harvard 45-0 a week ago, looked like anything but an outmanned unit.\nWhile there are some lopsided games from which the losing team can take away some positive results, this was one that was far more one-sided that the final score indicated.\nGeorgetown came in averaging just 84 yards a game on the ground. It got 153, and senior Jo'el Kimpela, who had 84 on 14 carries, looked much more impressive than that. Kyle Nolan, the Hoyas quarterback, was 28-for-36 passing for 311 yards and five touchdowns while shredding a Lafayette defense that often seemed clueless.\nThe scouting report on Georgetown undoubtedly touched on the team's tendency to use the screen pass. But on the first series Nolan made a perfect fake and lobbed the ball to Matt Buckman, who was never touched by the Leopards while scoring on a 19-yard screen play.\nThat was only the beginning of a day on which Georgetown, despite committing 11 penalties for 130 yards, never was out of control.\nThe Hoya defense, which came in allowing an average of 173 yards per game rushing, gave Lafayette only nine net yards on 20 carries. Georgetown had 11 tackles for loss and sacked Reed four times.\nLafayette had another familiar bug take a bite, too, when freshman kicker Jacob Bissell had his third straight field goal (and fourth of the season) blocked on the second play of the second quarter while Georgetown led only 10-0.\nWhen a Hoya punt attempt went awry the Leopards got the ball on the Georgetown 27. The offense got nothing, and on fourth-and-10, Bissell's 44-yard attempt was hit by Garrett Powers. Tavani said the block came from the same place that was the problem twice against Fordham, despite the fact the Leopards had \"done it over and over again\" in practice during the week.\"\n\"You have to credit [Georgetown coach] Rob [Sgarlata] and his staff and his players for coming out and executing a great game plan and we were inept on offense and defense was not playing much better,\" Tavani said.\nThe dilemma for Lafayette doesn't get any easier because unbeaten Harvard is coming to Fisher Stadium in six days.\n\"It's about pride in yourself, pride in each other and pride in the program,\" Tavani said. The faint hope of any turnaround now appears even more grim, but Tavani did say, \"We've got to go in there and do something, and believe me, I've done some pretty drastic things [in the past].\" He didn't elaborate.\nThe Hoyas, who are now 3-3 overall, ended a two-game losing streak to the Leopards.\nNolan, a 6-6 senior, had five touchdown passes in the first five games for the Hoyas, but he doubled that with Saturday's performance. Five receivers had four or more catches, with Jake DiCicco and Matt Buckman getting two touchdowns apiece and Justin Hill getting one.\n\"The frustration continues,\" Tavani said. \"We just have to find a way to get out of this hole.\"\nRetired sports columnist Paul Reinhard is a freelance writer.", "external_links": [], "published": "2015-10-11T05:14:00.000+03:00", "crawled": "2015-10-11T11:26:34.661+03:00", "highlightTitle": ""}