{"organizations": [], "uuid": "4c1b0c0de949398eb2a330d294fd05456fdd754f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/punjab/kejriwal-visits-punjab-firing-victims-kin-condemns-police-action/149993.html", "country": "US", "title": "Kejriwal visits Punjab firing victims' kin; condemns police action", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "Kejriwal visits Punjab firing victims' kin; condemns police action", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T03:00:00.000+03:00", "replies_count": 0, "uuid": "4c1b0c0de949398eb2a330d294fd05456fdd754f"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/punjab/kejriwal-visits-punjab-firing-victims-kin-condemns-police-action/149993.html", "ord_in_thread": 0, "title": "Kejriwal visits Punjab firing victims' kin; condemns police action", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tribune News Service\nFaridkot/Moga, October 24\nDelhi Chief Minister Arvind Kejriwal on Saturday went after the Punjab Police over the death of two Sikhs in police firing during anti-desecration protests at Faridkot and asked the SAD-BJP government to restore peace in the state. Kejriwal, who was on his first visit to Punjab since becoming the Chief Minister in February, met the families of the two youths — Gurjit Singh (26) of Sarawan village and Krishan Singh (43) of Behbal Khurd village — and assured the all-possible help. He later told reporters that Gurjit was killed in the police firing when he went to serve langar (a community kitchen) to about 300 peaceful protesters. “As per rules, the police fire warning shots in the air and then into the ground ... it was completely wrong,” he said. Keriwal demanded immediate arrest of those behind the sacrilege and strict action against the policemen who opened fire on the protesters and their seniors who ordered firing. “We condemn the incident of sacrilege. Punjab is burning and we appeal to the state government to arrest those behind the incident. I demand that a copy of the FIR be given to Gurjit’s family, so that they could be aware of its contents,” the Delhi Chief Minister said. He said the state was on the “boil” after alleged incidents of sacrilege and asked the SAD-BJP government to take immediate steps to restore peace. Gurjit and Krishan were part of the protests over the desecration of ‘birs’ of Guru Granth Sahib and were killed in police firing on October 14. The incident provoked widespread criticism of the state government and the Punjab Police. In the wake of the incident, Punjab Deputy Chief Minister Sukhbir Singh Badal put Moga SSP Charanjit Sharma under suspension for “lapses” in the line of duty. Under pressure from several quarters, the Punjab Police on Wednesday registered a case under various sections of the IPC in connection with the matter. It is being probed by a team led by ADGP Crime-cum-Director of Bureau of Investigation, Punjab, I.P.S. Sahota. Meanwhile, Sikh activists today blocked the Moga-Ferozepur national highway at Dagru, Moga-Kotkapura national highway at Rode village and Moga-Ludhiana national highway at the main square in Moga city, which forced Kejriwal to change the route and skip his visit to Moga. In Jalandhar, Congress MLA from Sultanpur Lodhi held a protest at Sultanpur against the registration of case against Sikh protesters by the Kapurthala Police. Kejriwal’s visit assumes significance as the AAP is eyeing the 2017 Assembly poll in the state. The state gave four MPs to the party in the General Election, of whome two were recently suspended for “anti-party” activities. Tension mounted in Kotkapura on October 12 after over 100 pages of the Sikh holy book were found scattered on a street in Bargari village. Two persons died in police firing two days later. (With inputs from PTI)", "external_links": [], "published": "2015-10-24T03:00:00.000+03:00", "crawled": "2015-10-24T20:19:32.809+03:00", "highlightTitle": ""}