{"organizations": [], "uuid": "93644f5faa68e9bc81ef3efe940900ddcd80c119", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.commercialappeal.com", "main_image": "http://media.jrn.com/images/73232.jpg", "site_section": "http://www.commercialappeal.com/sports/index.rss", "section_title": "Sports", "url": "http://www.commercialappeal.com/sports/white-station-routs-germantown-22a411a3-3bcf-1d35-e053-0100007ff395-336517351.html", "country": "US", "title": "White Station routs Germantown", "performance_score": 0, "site": "commercialappeal.com", "participants_count": 1, "title_full": "White Station routs Germantown", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T07:57:00.000+03:00", "replies_count": 0, "uuid": "93644f5faa68e9bc81ef3efe940900ddcd80c119"}, "author": "John Varlas", "url": "http://www.commercialappeal.com/sports/white-station-routs-germantown-22a411a3-3bcf-1d35-e053-0100007ff395-336517351.html", "ord_in_thread": 0, "title": "White Station routs Germantown", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Credit: Nikki Boertman October 23, 2015 - White Station's John Lyons (5) leaps over a tackle attempt by Germantown's Nick Norman Friday evening at the Fairgrounds. (Nikki Boertman/The Commercial Appeal) Credit: Nikki Boertman October 23, 2015 - White Station quarterback Burk Williams, right, scrambles for a first down as Germantown's Trey Goins closes in from behind Friday evening at the Fairgrounds. (Nikki Boertman/The Commercial Appeal) Credit: Nikki Boertman October 23, 2015 - White Station quarterback Burk Williams, right, scrambles for a first down as Germantown's Trey Goins closes in from behind Friday evening at the Fairgrounds. (Nikki Boertman/The Commercial Appeal) Related Coverage White Station cruises; Brighton hands Munford first loss With an offense that averages over 400 yards per contest, it would be easy to overlook the White Station defense. Easy, but a big mistake.\nThe Spartans — ranked sixth in The Commercial Appeal's Dandy Dozen — got a terrific defensive effort and (ho-hum) three touchdown catches from Dillon Mitchell to defeat Germantown, 38-0, Friday at the Fairgrounds.\nWhite Station improves to 6-3 overall and 5-1 in Region 4-6A to keep pace with Whitehaven and Cordova, both of which also won on Friday.\n\"It may sound like coach-talk but I don't overlook them,\" said Spartans coach Joe Rocconi. \"There may be some but we don't listen to them anyway. Any time you can get a shutout in this league ... I'm proud of our guys.\"\nThe Spartans held the Red Devils (4-5, 3-3) to 98 yards, including just 43 on the ground.\n\"It starts with the defensive line,\" said defensive back Myles Baker, who blanketed Germantown's Rodney Williams throughout the game and made a touchdown-saving deflection in the second quarter to snuff out the Red Devils' best threat of the night.\n\"Our pass coverage is nothing without the defensive line. I think we are (overlooked) because of the numbers we put up (offensively) but we're not worried about that. We don't worry about the numbers or the rankings, one of that.\"\nWhile the Spartans were thwarting the Red Devils at every turn, Mitchell was making the spectacular look routine. He caught eight passes for 156 yards and scored on receptions of 27, 29 and 51 yards.\nAnd — in a recurring theme this season — he had two touchdowns called back, both of which came in the first two minutes of the game.\n\"We had a little adversity in the first quarter but I'm not going to talk about that,\" Rocconi said.\nMitchell — who is headed to Oregon — capped a 46-yard opening drive by catching a pass from Burk Williams. On the drive that followed Baker's big defensive play, he took a little screen pass from Williams and tight-roped down the right sideline to make it 17-0 at halftime.\nGermantown fumbled on its first drive of the third quarter and Mitchell made them pay, hauling in a 51-yard touchdown despite the best efforts of Red Devils' defensive back Anterrious Branch.\nThe Spartans extended their lead to 32-0 on the next possession when John Lyons blocked a punt and recovered it in the end zone. Williams capped a 279-yards night with a 40-yard touchdown pass to Ty Woods in the fourth.", "external_links": ["http://media.jrn.com/images/200*254/684535.jpg", "http://media.jrn.com/images/659414.jpg", "http://media.jrn.com/images/200*136/659414.jpg", "http://media.jrn.com/images/200*165/664813.jpg", "http://media.jrn.com/images/664813.jpg", "http://media.jrn.com/images/684535.jpg"], "published": "2015-10-24T07:57:00.000+03:00", "crawled": "2015-10-24T10:44:40.444+03:00", "highlightTitle": ""}