{"organizations": [], "uuid": "b5a4a36b0b2921727b25b282752207c66bc82f24", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "http://images.worldnow.com/AP/images/9010567_G.jpg", "site_section": "http://www.cbs8.com/category/149655/sports", "section_title": "Sports - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30254395/with-howard-back-in-goal-us-loses-to-costa-rica-1-0", "country": "US", "title": "With Howard back in goal, US loses to Costa Rica 1-0", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "With Howard back in goal, US loses to Costa Rica 1-0 - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "b5a4a36b0b2921727b25b282752207c66bc82f24"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30254395/with-howard-back-in-goal-us-loses-to-costa-rica-1-0", "ord_in_thread": 0, "title": "With Howard back in goal, US loses to Costa Rica 1-0", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By RONALD BLUM\nAP Sports Writer HARRISON, N.J. (AP) - Storm clouds hover over U.S. coach Jurgen Klinsmann.\nThe Americans finished fourth in the CONCACAF Gold Cup, their poorest performance since 2000. They lost a playoff against Mexico on Saturday for the region's berth in the 2017 Confederations Cup.\nNot even Tim Howard's first game in goal in 15 months stopped the slump. Joel Campbell's 70th-minute goal led Costa Rica over the overwhelmed U.S. 1-0 in an exhibition Tuesday night, the Americans' fifth defeat in six games. The U.S. has lost three straight home games for the first time since 1997.\nKlinsmann turned meteorologist for his analysis.\n\"There are not only sunshine days,\" he said. \"We had a lot of sunshine, 2012, 2013, 2014. Now it's raining a little bit, and you've got to go through that. Maybe you have to go through a little bit of mud as well.\"\nCosta Rica outshot the U.S. 14-5, and the Americans created almost no scoring chances. Klinsmann changed eight of his starters from Saturday, keeping only defender Geoff Cameron, midfielder Jermaine Jones and forward Jozy Altidore. And all three were replaced at the start of the second half.\n\"I understand if some people are really critical because of the disappointment with the Gold Cup and because of the big disappointment on Saturday, and I respect that,\" Klinsmann said. \"But at the same time, when everything goes not my way, I get even hungrier to turn it around the other way.\"\nU.S. Soccer Federation President Sunil Gulati has repeatedly backed Klinsmann, who took over in 2011 and is signed through 2018 as coach and technical director.\nKlinsmann created a stir this week when he sent Fabian Johnson home to Germany, angry he asked to be substituted in the 111th minute against Mexico.\nStill, there was a bit of good news for the U.S. The under-23 team beat Canada 2-0 on second-half goals by Marc Pelosi and Jordan Kiesewetter and will play Colombia in March for a spot in next year's Olympics. The youth team lost to Honduras on Saturday, wasting a chance for one of CONCACAF's automatic berths.\n\"I'm going to look everywhere for younger players hopefully developing,\" Klinsmann said, \"and hopefully getting to a point where that transition that we talk about since more than a year really happens.\"\nHoward, now 36, took a one-year sabbatical from the national team after making 15 saves in the 2-1 round-of-16 loss to Belgium at last year's World Cup, wanting to use international breaks for family time. When Howard returned last month, Klinsmann installed him as his No. 2 behind Brad Guzan, the 31-year-old who had been Howard's primary backup.\nKlinsmann anticipates the pair will rotate going forward.\n\"We have two exceptional international-caliber goalkeepers and we need both of them,\" he said.\nBefore a crowd of just 9,214 in almost two-thirds empty Red Bulls Arena, Howard tipped Campbell's 25-yard shot over the crossbar in the 59th.\nA turnover by second-half sub Jonathan Spector led to the goal. Dave Myrie, who had just entered, crossed for Campbell, and the forward beat Danny Williams into space and sent a 12-yard, left-footed shot just past Howard's outstretched right arm into the far corner. Campbell, who has struggled for playing time at Arsenal, scored his 11th international goal but first since Costa Rica played Uruguay in last year's World Cup.\nHoward made an excellent sliding stop on Marcos Urena in the 88th.\n\"It was just great to pull the shirt on again and get all the hype and the talk over with,\" Howard said. \"I was just wanting to get a shot and just get back into the swing of things.\"\nThe Americans open qualifying for the 2018 World Cup against St. Vincent and the Grenadines in St. Louis on Nov. 13, then play at Trinidad and Tobago four days later.\n\"Every cycle is a rebirth and you have to shake things up,\" Howard said. \"You have to try new players. Other players get older. Some of your best players who are top dogs today are going to be old as dirt in 2018 and they're not going to be able to perform. So there's that balance, right, of getting a result today versus trying to bleed new guys in. So it's not doom and gloom. I think we're a good team.\"\nHe predicted \"we'll get two wins against St. Vincent, against Trinidad, and everybody will be happy again.\"\nKlinsmann used his weather metaphor.\n\"Sooner or later the clouds will pass by,\" he said, \"and we're going to find some sun again.\"\n All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-14T08:30:46.710+03:00", "highlightTitle": ""}