{"organizations": [], "uuid": "67d4740199633725877c5064d07f560f56683a7f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/Category/6/55/Sports/World.aspx", "section_title": "World - Sports - Ahram Online ", "url": "http://english.ahram.org.eg/NewsContent/6/55/152600/Sports/World/Aguero-out-for-a-month-with-muscle-tear.aspx", "country": "EG", "title": "Aguero out for a month with muscle tear", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Aguero out for a month with muscle tear - World - Sports - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "67d4740199633725877c5064d07f560f56683a7f"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/6/55/152600/Sports/World/Aguero-out-for-a-month-with-muscle-tear.aspx", "ord_in_thread": 0, "title": "Aguero out for a month with muscle tear", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Man City's Aguero injured on Argentina duty Aguero hits five as Man City crush Newcastle to go top Aguero penalty gives Man City 2-1 win over 'Gladbach Striker Sergio Aguero, injured during Argentina's shock 2-0 home defeat by Ecuador in a World Cup qualifier, said on Friday he would be out for a month.\nAguero tore a muscle in his left thigh half an hour into the team's opening South American qualifier for the 2018 World Cup in Russia at the River Plate stadium on Thursday.\n\"I think I'll be a month without playing,\" Aguero said as he left a Buenos Aires clinic where he had tests.\n\"I'll go the AFA (Argentine Football Association) national team compound to carry on with treatment. To recover from the tear I'll surely need a month although it will depend how it evolves,\" he told TyC Sports.\nNow Aguero, out of Tuesday's second qualifier away to Paraguay in Asuncion, looks set to also miss next month's home match against arch-rivals Brazil.\n\"I'd been playing very frequently and was in doubt (for Thursday's match) until the last minute but as player you always want to be there and never know what can happen,\" Aguero added.\nAguero had scored five goals in Manchester City's 6-1 win over Newcastle United last weekend, coming off before the end as a precaution.\nThe AFA confirmed injuries to Aguero and midfielder Lucas Biglia, who have joined a growing Argentina injury list that includes Lionel Messi, also likely to miss qualifiers in November against Brazil and away to Colombia.\nDefender Marcos Rojo and midfielders Fernando Gago, Ever Banega and Roberto Pereyra are also on coach Gerardo Martino's injury list\nArgentina's defeat was their first in 40 matches at the River Plate stadium dating back 22 years, during which time they have lost one home qualifier to Brazil in Rosario in September 2009.\n ", "external_links": ["https://twitter.com/AO_Sports", "https://www.facebook.com/AhramOnlineSports?fref=ts"], "published": "2015-10-10T03:00:00.000+03:00", "crawled": "2015-10-10T21:38:48.702+03:00", "highlightTitle": ""}