{"organizations": [], "uuid": "a2d915bddfeedc44f1ccb386cb44551e36353aea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.charlotteobserver.com", "main_image": "http://www.charlotteobserver.com/latest-news/1x5e3x-Luke-Kuechly-Talks-About-Concussion/ALTERNATES/LANDSCAPE_1140/Luke%20Kuechly%20Talks%20About%20Concussion", "site_section": "http://www.charlotteobserver.com/sports/?widgetName=rssfeed&widgetContentId=8167599&getXmlFeed=true", "section_title": "Sports News, Scores & Photos | CharlotteObserver.com &", "url": "http://www.charlotteobserver.com/sports/nfl/carolina-panthers/article38982774.html", "country": "US", "title": "Carolina Panthers linebacker Luke Kuechly returns to lineup after monthlong recovery", "performance_score": 0, "site": "charlotteobserver.com", "participants_count": 1, "title_full": "Carolina Panthers linebacker Luke Kuechly returns to lineup after monthlong recovery", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T00:45:00.000+03:00", "replies_count": 0, "uuid": "a2d915bddfeedc44f1ccb386cb44551e36353aea"}, "author": "Jonathan Jones \njjones@charlotteobserver.com", "url": "http://www.charlotteobserver.com/sports/nfl/carolina-panthers/article38982774.html", "ord_in_thread": 0, "title": "Carolina Panthers linebacker Luke Kuechly returns to lineup after monthlong recovery", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Carolina Panthers linebacker Luke Kuechly returns to lineup after monthlong recovery \nAll-Pro player cleared to play Sunday against Seattle Seahawks \nKuechly said overcoming concussion often felt like he was in timeout \nHe failed a test with the independent doctor at least once Kuechly has been out a month since sustaining first concussion ever but expects to play Sunday at Seattle. sfowler@charlotteobserver.com Carolina Panthers linebacker Luke Kuechly (center) warms up during Tuesday’s practice. David T. Foster III dtfoster@charlotteobserver.com 1 of 2 \nPanthers linebacker Luke Kuechly had never suffered a concussion before last month, but he knew almost immediately that’s what he had when it happened. \nAnd because it was unlike anything he’d ever experienced , frustration set in. \n“You can’t tape it up. You can’t suck it up,” Kuechly said Tuesday. “You’ve just got to wait for it to go away. That was probably the most difficult part, knowing that you can’t really tough it out. You’ve just got to sit there and wait.” \nKuechly had to wait 30 days, but an independent doctor passed Carolina’s All-Pro middle linebacker through the NFL’s concussion protocol and Kuechly will play this week in Seattle for the first time since Week 1. \nThe past month for Kuechly has been a series of tests, exercises and demonstrations of restraint by the Panthers’ coaching and training staffs. And it all stemmed from one tackle. \nLate in the second quarter against Jacksonville, Kuechly went to tackle running back T.J. Yeldon. Rather than getting his helmet on the side of Yeldon, Kuechly caught the running back square, and crumpled to the ground. \nFor the first week or so, things came slowly to Kuechly. He didn’t have to stay in a dark room or wear sunglasses, he said, but he was “a little cloudy” on things. \nKuechly said he knew he wouldn’t play the following week against the Texans, but he remained hopeful each week after that. \n“I was kind of taking it week-by-week,” he said. “I was hoping, ‘This week I’m going to be good. We’re good, we’re good.’ And then I wasn’t good.” \nSome weeks Kuechly would be on the practice field with his teammates doing light, non-contact exercises as he tried to progress through the protocol. Other weeks he stayed inside team facilities working on his conditioning, not once going out to the practice field. \nWhen teammates returned to the locker room drenched in sweat and joking about something that happened at practice, Kuechly would be walking out of the training room and would hear it all. \n“Man, it’s like you’re in timeout,” Kuechly said. “You can’t go out and play with your friends. It’s like detention at recess.” \nBehind the scenes, Kuechly stayed in meeting rooms. But because of his head injury, the Panthers didn’t want him in the film room and in meetings more than he needed to be. During one week this past month, Kuechly was so heavily involved that head athletic trainer Ryan Vermillion banned him from meetings for a few days, Panthers coach Ron Rivera said. \n“There were times where you could tell it was frustrating him,” Rivera said. “He wanted to be back out there. Ryan Vermillion and the staff did a heck of a job slowing him down. He really tried to push himself. That’s who he is. He wants to be out there.” \nIt’s unclear how many times Kuechly saw the independent neurologist, but he was not cleared at least once by the doctor. He’d be tested on his memory and how quickly he could recall certain things. \nMaybe he’d be shown a series of shapes, and after a few tests he’d then be asked to recall the shapes and draw them. Or he’d be told a list of words once or twice, and in 10 minutes after more tests, he’d be asked to recite them. \n“You guys think it’s easy now, but if you get smacked in the head good, it’s a little more difficult,” he said. \nMonday afternoon, after spending the weekend back home in Cincinnati training, he passed the test, and Tuesday he was back on the field with a helmet for the first time in a month. \nKuechly must still get into football shape. Rivera promises not to keep him on the field for 100 percent of the snaps Sunday. \nBut the coach is impressed with Kuechly’s recovery. \n“It’s like he picked up right where he left off – communicating, running around all over the place, everything that’s typical of Luke,” Rivera said. “It was great to have him out there. It was a long process, but the process was what we needed it to be.”", "external_links": [], "published": "2015-10-14T00:45:00.000+03:00", "crawled": "2015-10-14T13:27:04.945+03:00", "highlightTitle": ""}