{"organizations": [], "uuid": "20c2692e56a7992ad0dbaec18f544a6240c78343", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "chicago.suntimes.com", "main_image": "http://bullseye-prod.aggrego.org//wp-ag/wp-content/uploads/sites/71/2015/10/COUNCIL-092515_31_56369225.jpg?o=eyJ3aWR0aCI6MCwiaGVpZ2h0IjowLCJ4IjowLjUsInkiOjAuNX0%3D&amp;s=UuqlfE8%2FIJD0daiRR%2BMzOcM9VKI%3D", "site_section": "http://chicago.suntimes.com/", "section_title": "Chicago Sun-Times | Chicago : News : Politics : Things To Do : Sports", "url": "http://chicago.suntimes.com/opinion/7/71/1020875/andy-shaw-7", "country": "US", "title": "Andy Shaw: Premature to consider privatizing 3-1-1 center", "performance_score": 0, "site": "suntimes.com", "participants_count": 1, "title_full": "Andy Shaw: Premature to consider privatizing 3-1-1 center | Chicago Sun-Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T00:00:00.000+03:00", "replies_count": 0, "uuid": "20c2692e56a7992ad0dbaec18f544a6240c78343"}, "author": "| emailAddress.indexOf('@') == -1) {errorString = 'Please enter your email address';} var isError = false; if (errorString.length > 0) isError = true; if (isError) alert(errorString); return !isError;}", "url": "http://chicago.suntimes.com/opinion/7/71/1020875/andy-shaw-7", "ord_in_thread": 0, "title": "Andy Shaw: Premature to consider privatizing 3-1-1 center", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Follow @Andyshawbga\nMayor Rahm Emanuel’s draconian 2016 budget wasn’t much of a surprise when he released it a few weeks ago.\nMost of the proposals, including a massive property tax hike and new garbage collection fees, were leaked in advance.\nBut the spending blueprint included one unexpected suggestion: Privatizing the city’s 3-1-1 operation — the non-emergency response center that gets nearly 4 million calls annually.\nThe City Council, which is now considering the mayor’s budget, was blind-sided by the idea of spinning off all or part of the call center, which would eliminate up to 73 jobs.\nOPINION\nFollow @Andyshawbga\nThe administration argues that 3-1-1, which began in the late 1990s, needs major technical upgrades that could cost taxpayers up to $30 million.\nTurning it over to a private contractor could lower that price tag and save an estimated $1 million a year in salaries, benefits and other expenses, according to the mayor’s office.\nThe Better Government Association encourages a serious ongoing assessment of government programs with an eye toward greater efficiency, more accountability and better service.\nBut we’re wondering why 3-1-1 is surfacing now, and raising more questions than it answers.\nThe timing is odd because the administration recently sent an enlightened privatization ordinance to the Council for approval, so it’s logical for the city to wait until it’s analyzed, and then adopted, before embarking on new privatization initiatives.\nThe BGA has some skin in the game because our Policy Unit, which operates separately from BGA Investigations, spent months working with City Hall to draft an ordinance that protects taxpayers from another parking meter privatization debacle.\nThe result is the Privatization Transparency, Accountability and Protection Ordinance, a measure that subjects outsourcing of major city assets and services to a thorough examination by aldermen, independent experts and the public, and enough time to get it right.\nIn July, Emanuel introduced the ordinance to “ensure that any potential privatization in the future would be appropriately evaluated, publicly debated, and, if accepted, would be subject to ongoing oversight.”\nThe ordinance has 40 aldermanic co-sponsors but hasn’t been heard in committee yet, so it’s premature to consider privatizing 3-1-1, and the lesser-reported but still significant privatization of city-administered HIV clinics, until the rigorous process that was drafted, sponsored and touted by the mayor has been approved.\nHere’s another question for the administration:\nWhy not consider using the city’s recently revitalized Infrastructure Trust to handle a 3-1-1 conversion?\nThe Trust was touted at its 2012 inception as an innovative public-private partnership that would attract investment and facilitate improvements.\nBut it hasn’t done much, so Emanuel recently appointed new board members to jump-start it, and they quickly established an ambitious goal: Replacing outdated city lighting with more efficient, environmentally friendly illumination.\nSo it’s worth asking if the Infrastructure Trust Board should consider public-private 3-1-1 options since there’s no privatization ordinance in place yet?\nPrivatization can be a viable option for government, but City Hall should be exceedingly cautious before going that route with 3-1-1 because major changes in public safety protocols and other critical city services demand heightened scrutiny.\nA flawed 3-1-1 conversion could easily become another parking meter abomination, or an out-and-out emergency, and that’s the last thing City Hall needs in the face of daunting fiscal challenges and intractable gun violence.\nAndy Shaw is President & CEO of the Better Government Association .\nEmail: ashaw@bettergov.org\nFollow Andy Shaw on Twitter: Follow @andyshawbga\nTweets by @Andyshawbga", "external_links": ["https://twitter.com/andyshawbga", "http://www.bettergov.org/blogs/think_tank/emanuel_alderman_introduce_longawaited_privatization_ordinance/", "https://twitter.com/Andyshawbga", "http://www.bettergov.org/action_policy/infrastructure_trust.aspx"], "published": "2015-10-12T00:00:00.000+03:00", "crawled": "2015-10-12T02:07:06.114+03:00", "highlightTitle": ""}