{"organizations": [], "uuid": "c77e351ab7cc37cf34e340b32522d820e104c353", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dallasnews.com", "main_image": "http://www.dallasnews.com/incoming/20151002-1443826984-mavericks-media-day-basketball.jpg.ece/BINARY/original/1443826984-Mavericks-Media-Day-Basketball.jpg", "site_section": "http://www.dallasnews.com/sports/dallas-cowboys/", "section_title": "Dallas Cowboys News - Sports News for Dallas, Texas ", "url": "http://www.dallasnews.com/sports/dallas-mavericks/20151002-the-mavericks-have-a-blooper-reel-at-center-but-he-might-be-best-option.ece", "country": "US", "title": "The Mavericks have a blooper reel at center, but he might be best option", "performance_score": 0, "site": "dallasnews.com", "participants_count": 2, "title_full": "The Mavericks have a blooper reel at center, but he might be best option | Dallas Morning News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T02:03:00.000+03:00", "replies_count": 1, "uuid": "9167c0983fcb332da8212195e17e4c0f22dcbf85"}, "author": "Eddie Sefko", "url": "http://www.dallasnews.com/sports/dallas-mavericks/20151002-the-mavericks-have-a-blooper-reel-at-center-but-he-might-be-best-option.ece#post-0", "ord_in_thread": 0, "title": "The Mavericks have a blooper reel at center, but he might be best option", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Mavericks have nearly 21 feet worth of centers that have legitimate NBA experience.\nAll of them bring something a little different.\nJaVale McGee is just hoping to bring something.\nAnything.\nThe 7-footer who has been plagued by leg problems the last two seasons has always been a little bit of an \"out there\" kind of person. He's made lots of highlight reels, but often times for the wrong reasons, such as passing the ball to nobody on the other end of the court.\nHe's been a blooper-reel editor's best friend.\nBut at 27, he's still a very young center who has more athleticism than the rest of the Mavericks' center hopefuls put together. If he ever gets healthy - and that's admittedly a big if - and if he can stay focused on the court, he's got oodles of talent and could be a starting center for years to come.\nBut he's a long way from that right now. He hasn't been cleared to do any real basketball work, other than take some jump shots and his ballhandling.\nHe's played just 28 games the last two seasons and if he makes the Mavericks' roster - something that everybody expects - he's probably not going to be ready to contribute until the regular season has already begun.\n\"I don't even believe in hope,\" McGee said. \"I just let it happen. Whatever happens, however fast it's supposed to happen, it'll happen.\"\nDon't take that as a sign that McGee is pessimistic about his future. Far from it. He's got time on his side. Centers typically play into their mid-30s and often have some of their best seasons after the age of 30.\nFor now, he's just doing what he needs to do to try to get clearance to actually play basketball again. He has not been allowed to cut hard on his legs nor has he been approved for jumping to his full elevation. Those are kind of important things in basketball.\n\"I've never been in a situation like this in my life,\" he said. \"It's definitely made me stronger mentally. I just stay high-spirited and work hard at the things that I can do. I'm getting everything right. If they don't see that, then it's not meant to be.\"\nThe Mavericks have Samuel Dalembert and projected starter Zaza Pachulia who are assured spots on the roster. McGee would be a long-term project who the Mavericks think could pay big dividends later in the season.\nBut young big men Dwight Powell, Salah Mejri and Jarrid Famous are hoping to carve out playing time.\nThat said, McGee could be the best option, based on his skill set, which includes good shot-blocking skills and a very active body, when it's healthy. He's a little like Tyson Chandler, but without the skins on the wall.\n\"I definitely feel like I fit very well here,\" McGee said. \"Tyson's game is sort of like mine. We're both athletic, but I'm a little faster and more agile.\"\nRick Carlisle has seen what McGee can do in the past and he's willing to be patient when it comes to evaluating whether the big man can help the Mavericks at come point this season.\n\"He was cleared last week for increased activity,\" Carlisle said. \"So he's able to do a little more movement on the floor and able to do jump-shooting. It's really impossible to say what the timetable is. But he's doing well and has had no setbacks.\n\"We know what he's capable of doing. He has a body of work. We know he's an NBA player and has the ability to be a starting player in the NBA. And we know he's very motivated to play. He's just had a very odd rehab situation that's been addressed and he's doing much better.\"\nOn Twitter:\n @ESefko", "external_links": ["https://twitter.com/ESefko"], "published": "2015-10-03T02:03:00.000+03:00", "crawled": "2015-10-03T11:37:05.072+03:00", "highlightTitle": ""}