{"organizations": ["Houston and Poplar Bluff", "Mountain Grove Middle School", "Lady Wildcats", "Macy Loveless", "Winona", "Lady Panthers"], "uuid": "0003421df88fdcb6d3e73b368e8652faf3d71749", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ozarkssportszone.com", "main_image": "http://imgsrv.ozarkssportszone.com/image/DbGraphic/201510/3171599.jpg", "site_section": "http://www.kspr.com/sports/21051914_21051920?format=rss_2.0&view=feed", "section_title": "Sports Top Stories", "url": "http://www.ozarkssportszone.com/Winona-tops-heavy-hearted-Mountain-Grove/22025854", "country": "US", "title": "Winona tops heavy-hearted Mountain Grove", "performance_score": 0, "site": "ozarkssportszone.com", "participants_count": 0, "title_full": "Winona tops heavy-hearted Mountain Grove", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T08:53:00.000+03:00", "replies_count": 0, "uuid": "0003421df88fdcb6d3e73b368e8652faf3d71749"}, "author": "", "url": "http://www.ozarkssportszone.com/Winona-tops-heavy-hearted-Mountain-Grove/22025854", "ord_in_thread": 0, "title": "Winona tops heavy-hearted Mountain Grove", "locations": ["Mountain Grove", "Mo.", "Winona", "West Plains"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kyndal Thomason", "McBride", "Francie McBride", "Telsa McGee", "Kacie Callison", "Watson", "Winona", "Maddie Shelley", "Kacey Watson", "Callison", "McGee"], "text": "Posted : Thursday, 01 October 2015 11:29PM Winona tops heavy-hearted Mountain Grove By Whitney Keith stories@ky3.com Mtn. Grove, Mo. (For OzarksSportsZone.com) -- A pall hung over the Mountain grove High School Gymnasium that couldn't be entirely blamed on the Lady Panthers' 2-0 defeat at the hands of a Class 1 State-ranked Winona squad. Early this week, the school had closed early so that staff and students, including several members of the Lady Panthers' squad, could attend the funeral of Mountain Grove Middle School student Macy Loveless, who had passed away after a long battle with cancer.“It's been an emotional week for a lot of my players,” said Lady Panthers helmsman Kacie Callison. CLICK HERE FOR PHOTOS In addition to the devastating loss of the member of the school family, the Lady Panthers dropped a 0-2 decision to Class 1 Eminence on Monday evening.“Typically, in the past, good teams have brought out good things in my kids and they've played harder, but that didn't happen, either Monday night or tonight,” Callison said. The Lady Panthers never gained a foothold in the first set against a hard-hitting Winona squad, leading to a 10-25 defeat. The second set looked much different. Although the Lady Wildcats led the entire set, the scoring was much tighter, with Mountain Grove getting as close as three points to tying the score. The end result was a four-point match at 21-25, Winona.“I felt like we played pretty solid tonight considering that we have two girls who are very sick,” said Lady Wildcats' coach Francie McBride. “Our defense was very good and that's something we've been working on. Callison said that the mental aspect of the game seemed to be the hardest for her squad in this bout.“(during the second set) I felt like we played with a little more determination, but we still had a few moments of just trying to coast, which you can't really do in volleyball,” she said. Callison noted that outside hitter Kacey Watson led the team with 6 kills, while senior defensive specialist Maddie Shelley led the squad in digs with eight. Watson, a second-year, sophomore starter, said that the squad went 23-25 against Mountain View, and went three sets against West Plains. “I know we can play, if we put the effort into it,” she said. McBride noted that 5'8” junior Kyndal Thomason led the Lady Wildcats in kills with 10.“She is one of the ones who is sick, so I thought that was a pretty good night for her,” McBride added with a smile. Libero Telsa McGee, a 5'3” senior, led the squad with 20 digs.“I thought did well in playing as a team and working together,” McGee said. Next action for the Lady Panthers is the Eminence High School Volleyball Classic. The Lady Wildcats will have back-to-back contests against Houston and Poplar Bluff next Monday and Tuesday nights, respectively, and will compete in the Ozark Volleyball Tournament next week.“I'm hoping somehow between now and Saturday we can flip things around,” Callison said with a smile. The match dropped the Lady Panthers' record to 6-11-2, while it raised the Lady Wildcats' record to 17-4-2.", "external_links": [], "published": "2015-10-02T08:53:00.000+03:00", "crawled": "2015-10-02T12:51:38.713+03:00", "highlightTitle": ""}