{"organizations": [], "uuid": "8023b313c6275f3e4099aad121ea6a16a5d6e75b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-562d76ca/turbine/ct-obama-chicago-gun-control-visit-20151025", "site_section": "http://www.chicagotribune.com/", "section_title": "Chicago Tribune: Chicago breaking news, sports, business, entertainment, weather and traffic - Chicago Tribune", "url": "http://www.chicagotribune.com/news/ct-obama-chicago-gun-control-visit-20151025-story.html", "country": "US", "title": "Obama wants nationwide gun laws to fill in gaps left by local efforts", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Obama wants nationwide gun laws to fill in gaps left by local efforts - Chicago Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T03:04:00.000+02:00", "replies_count": 0, "uuid": "8023b313c6275f3e4099aad121ea6a16a5d6e75b"}, "author": "Christi Parsons", "url": "http://www.chicagotribune.com/news/ct-obama-chicago-gun-control-visit-20151025-story.html", "ord_in_thread": 0, "title": "Obama wants nationwide gun laws to fill in gaps left by local efforts", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "One evening in late August about half a mile from President Barack Obama’s Chicago home, someone in a passing car pulled up to a silver Volkswagen and fired several shots through the driver’s side window, killing the driver, execution-style.\nThe suspected gang shooting happened close to a playground, an elementary school and a high school, where football practice was wrapping up for the night.\nThe crime terrified Obama’s old neighbors and highlighted just how closely the problem of gun violence hits for the president as it rages unabated in Chicago. Obama’s home city is at the center of a debate about the effectiveness of the kinds of gun laws the president backs.\nCritics say the stream of deadly shootings are proof that gun laws don’t work, given the tough stance Chicago officials adopted toward gun ownership in the 1980s and 1990s.\nBut Obama’s team believes that Chicago, with its 408 homicides so far this year, is evidence of the need for exactly what he’s pushing: national laws that make it harder to get around the local restrictions simply by driving across a state or city line.\n“It’s the patchwork of laws that doesn’t serve us,” said one Obama adviser. “People just go to other jurisdictions with looser laws.”\nScene of the Crime: Struggling with police and the death of another son Peter Nickeas Felicia Humphries drifted into the crime tape and out, into the tape and out, her every movement tracked by a handful of officers who pleaded for her to stay back.They were gentle with Humphries, whose pleas to see her son were also gentle.The scene before Humphries early Sunday on the West Side...\nFelicia Humphries drifted into the crime tape and out, into the tape and out, her every movement tracked by a handful of officers who pleaded for her to stay back.They were gentle with Humphries, whose pleas to see her son were also gentle.The scene before Humphries early Sunday on the West Side...\n(Peter Nickeas) Obama will talk about the need for tougher gun laws with police chiefs gathered in Chicago on Tuesday, aides say, as part of a broader conversation about violence and how police can work more effectively with their communities to combat it.\nHe’s traveling to Chicago simply because that’s the site of the annual gathering of the International Association of Chiefs of Police, but advisers say he’s well aware of the symbolism in returning to his hometown amid this debate.\nChicago has long been a battleground for both pro- and anti-gun forces. Three decades ago, in the wake of the assassination attempts on President Ronald Reagan and Pope John Paul II, the City Council banned new sales and registration of handguns in the city in 1982. Chicago was the first major city to take that step.\nNow, with Obama renewing his rhetoric about more gun control in the wake of massacres at a church in South Carolina and a community college in Oregon and considering imposing gun safety rules by executive order, critics once again are pointing to the president’s hometown for proof of the folly.\nRepublican presidential candidates Donald Trump, Carly Fiorina and Chris Christie have all talked about gun deaths in Chicago in arguing against the need for stricter gun safety laws.\n“You look at Chicago, it's got the toughest gun laws in the United States,” Trump told ABC News this month. “You look at other places where they have gun laws that are very tough, they do, generally speaking, worse than anybody else.”\n2 dead, 11 wounded in shootings in Chicago, including slaying near Obama's home Peter Nickeas, Carlos Sadovi and Megan Crepeau Two men were killed and 11 people were wounded in shootings in Chicago since Tuesday afternoon, including a man in his 20s who was gunned down near a park about half a mile from President Barack Obama's home in Kenwood.Reginald Sanson, 25, was driving in the 5000 block of South Dorchester Avenue...\nTwo men were killed and 11 people were wounded in shootings in Chicago since Tuesday afternoon, including a man in his 20s who was gunned down near a park about half a mile from President Barack Obama's home in Kenwood.Reginald Sanson, 25, was driving in the 5000 block of South Dorchester Avenue...\n(Peter Nickeas, Carlos Sadovi and Megan Crepeau) The argument isn’t as clear-cut as the candidates make it. Although the City Council drew attention for its strict gun laws in the 1980s, the Supreme Court decided in 2010 that Chicago’s handgun ban violated the Second Amendment to the Constitution.\nAcademics have never conclusively proved a causal relationship between tougher gun laws and lower crime rates, though nationwide surveys conducted by gun control groups strongly suggest one.\nThat’s enough for the president to conclude that tougher laws are worth a try, but not enough for skeptics who think it doesn’t merit the government intrusion into private gun ownership.\nChicago offers evidence for both sides.\nFor gun control advocates, Illinois is something of a model. The Law Center to Prevent Gun Violence gave Illinois a B-plus grade in 2014 for its laws, behind only a handful of states with tougher regulations.\nBut at the same time, Chicago has seen a spike in violence, inspiring the nickname “Chi-raq.” The city has recorded almost as many homicides already this year as last year as a whole. In August alone, the month that the suspected gangland shooting occurred near the president’s home, there were 54 homicides.\n“Chicago just does not look like a good case study for gun control,” said Eugene Kontorovich, a professor at Northwestern University Law School, who researches and writes on the subject. “That’s a reality that all who support gun control proposals have to keep in mind. The world is permeable.”\nBut for Obama’s neighbors -- including the lawmaker who took his seat in the Illinois Senate -- the Chicago ordinances and Illinois laws never had a chance to work because of the city’s proximity to states with much laxer laws. The city is within a two-hour drive of Milwaukee, and Gary, is so close it is practically a suburb. Their states earned a C-minus and D-minus in the gun law grades, respectively.\nIn fact, some 60 percent of the guns associated with crimes in Chicago come from out of state, according to Chicago Police Department statistics. Mississippi, with an F on the score card, is another source.\n“You can pass all the laws you want, but if people can just drive to Indiana, Wisconsin and Mississippi, it doesn’t make a difference if nothing is done at the federal level,” said state Sen. Kwame Raoul.\nOn Raoul’s street, not far from the Obama family home, there have been two shootings in the past two months. He is so worried about the safety of his teenagers that he doesn’t let them walk anywhere. He drives them.\nWhen he travels to Springfield to debate the subject with lawmakers from around the state, though, he worries about the overemphasis on urban violence. In a recent debate about the heroin problem seeping out of the cities and into rural areas, he drew a parallel to gun violence.\n“These problems don’t remain quarantined,” Raoul said. “They are coming to your community, too.”\nSkeptics like Kontorovich agree that borders governing gun laws are porous, but they question whether another layer of laws or executive orders will make any difference.\n“The reality is that state and local borders are permeable,” Kontorovich said. “But national laws licensing laws will only regulate the legal market, not the black market.”\n Shootings Illinois General Assembly", "external_links": ["http://www.trbimg.com/img-562d76ca/turbine/ct-obama-chicago-gun-control-visit-20151025", "http://www.trbimg.com/img-562d10aa/turbine/ct-scene-of-the-crime-mother-loses-another-son-20151025", "http://www.trbimg.com/img-55dd420e/turbine/ct-chicago-shooting-violence-20150825"], "published": "2015-10-26T03:04:00.000+02:00", "crawled": "2015-10-26T06:11:09.408+02:00", "highlightTitle": ""}