{"organizations": [], "uuid": "f4a0b38ba6b8f64e17b73bfbc940ebbf211632ef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.boston.com", "main_image": "http://p.o0bc.com/rf/image_1920x1190/Boston/2011-2020/2015/10/08/Boston.com/Metro/Images/IMG_5559A.jpg", "site_section": "http://boston.com/", "section_title": "Boston, MA news, breaking news, sports, video | Boston.com", "url": "http://www.boston.com/news/local/massachusetts/2015/10/08/fitchburg-man-believes-possible-shark-run-saved-his-life/FGbL42cuZ20No0HRh7xFxN/story.html", "country": "", "title": "Fitchburg man believes possible shark run-in saved his life - Massachusetts news", "performance_score": 0, "site": "boston.com", "participants_count": 1, "title_full": "Fitchburg man believes possible shark run-in saved his life - Massachusetts news", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "f4a0b38ba6b8f64e17b73bfbc940ebbf211632ef"}, "author": "boston.com", "url": "http://www.boston.com/news/local/massachusetts/2015/10/08/fitchburg-man-believes-possible-shark-run-saved-his-life/FGbL42cuZ20No0HRh7xFxN/story.html", "ord_in_thread": 0, "title": "Fitchburg man believes possible shark run-in saved his life - Massachusetts news", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Eugene Finney didn’t think he’d be attacked by a shark while on vacation, and he never thought he’d credit one with saving his life.\nFinney, 39, who is from Fitchburg, was swimming off the California coast this summer when he was hit by something that left a long cut down his back, The Boston Globe reported. He later read in a local paper that witnesses had spotted sharks in the area around the same time, and assumed that’s what attacked him in the water.\nWhen Finney left California and came back home, his pain came with him. Doctors ran tests and told him that he had experienced bruising in his thoratic cavity, according to the Globe . The tests also showed that Finney had another problem: a small, cancerous tumor on his right kidney.\n Doctors were able to act fast, the Globe reported, removing the Stage 1 tumor in September and saving Finney’s kidney.\n“I’m pretty damn lucky,” Finney told the Globe . “I’m thankful I got this nudge.”\nRead the full Globe story here .\nRelated gallery: 13 sharks that roam the waters of New England\nPrevious -- of -- Next Basking sharks are easily recognized by their large, conical mouths, which they keep open as they swim so they can eat. Wikimedia Commons Previous -- of -- Next Blue sharks have sleek bodies, which makes them fast swimmers. However, commercial fishermen find them highly desirable for their fins for shark fin soup. Wikimedia Commons Previous -- of -- Next Dusky sharks, which have saw-edged upper teeth, are some of the slowest growing and latest maturing shark species, which makes them vulnerable to overfishing. Wikimedia Commons Previous -- of -- Next Cousins of the great white, mako sharks have a high metabolic rate, which keeps the temperature of their bodies warmer than the surrounding water. Wikimedia Commons Previous -- of -- Next Male porbeagle sharks impregnate females by biting them to latch onto them as they mate. This often leaves the females with scars. Wikimedia Commons Previous -- of -- Next Advertisement Previous -- of -- Next The sand tiger shark is the only known shark that stores air in its stomach to stay afloat. Wikimedia Commons Previous -- of -- Next Sandbar sharks avoid surf zone beach areas, instead preferring to swim in bays, river mouths, and harbors. Wikimedia Commons Previous -- of -- Next At just 60 inches, smooth dogfish sharks are considered small for their species. They can change color from light to dark to camoflauge themselves from predators. Wikimedia Commons Previous -- of -- Next Smooth hammerhead sharks can hear low frequency vibrations made by wounded fish. Wikimedia Commons Previous -- of -- Next The spiny dogfish is one of the most well-traveled sharks, with some swimming more than 5,000 miles. Because there are so many of them, they are the most studied sharks. Wikimedia Commons Previous -- of -- Next Advertisement Previous -- of -- Next Thresher sharks join together to surround schools of fish, which they kill by swiping them with their tails. Wikimedia Commons Previous -- of -- Next Young tiger sharks have vertical stripes, which is how the breed got its name, but the markings fade once the sharks reach adulthood. Wikimedia Commons Previous -- of -- Next White sharks can detect one drop of blood in 25 gallons of water. Wikimedia Commons", "external_links": ["http://www.bostonglobe.com/metro/2015/10/08/fitchburg-man-says-possible-run-with-shark-led-discovery-tumor/C4x8q97z43DwmZWCnR441K/story.html"], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-09T02:04:59.601+03:00", "highlightTitle": ""}