{"organizations": [], "uuid": "27be3abecb4c30a04043094eb406ca41240f2a20", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.azcentral.com", "main_image": "http://www.gannett-cdn.com/-mm-/59409befe1c8004efb1a90fc39443e9eb5ab78a4/c=0-0-5148-2909&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/23/Phoenix/Phoenix/635812306863451783-USATSI-8822254.jpg", "site_section": "http://www.azcentral.com/sports/", "section_title": "azcentral sports - Phoenix Arizona Sports news, scores, schedules, photos, videos", "url": "http://www.azcentral.com/story/sports/college/nau/2015/10/23/nau-football-looks-rebound-vs-weber-state/74315174/", "country": "US", "title": "NAU football looks to rebound vs. Weber State", "performance_score": 0, "site": "azcentral.com", "participants_count": 1, "title_full": "NAU football looks to rebound vs. Weber State", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T01:59:00.000+03:00", "replies_count": 0, "uuid": "27be3abecb4c30a04043094eb406ca41240f2a20"}, "author": "azcentral.com", "url": "http://www.azcentral.com/story/sports/college/nau/2015/10/23/nau-football-looks-rebound-vs-weber-state/74315174/", "ord_in_thread": 0, "title": "NAU football looks to rebound vs. Weber State", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Saturday’s Game\nWeber State (4-3, 3-1 Big Sky) at Northern Arizona (3-3, 1-2 Big Sky)\nWhere: Walkup Skydome\nWhen: 4 p.m.\nNAU update: The Lumberjacks are coming off of arguably their worst performance of the season in a 38-24 road loss Oct. 10 to previously winless UC Davis. NAU had won each of the previous three matchups, but gave up nearly 500 yards of total offense and allowing UC Davis more than 40 minutes possession time. NAU still has one of the most explosive offenses in the conference behind greyshirt freshman quarterback Case Cookus, who was named to the CFPA midseason watch list for the FCS National Performer of the Year Trophy. The trophy is awarded to the best player in FCS, with Cookus garnering consideration after leading the nation in passing efficiency (189.0) and yards per pass attempt (10.55) while also throwing for 1,414 yards, 15 touchdowns, with just two interceptions, and 66.4 percent completion. His best target this season has been sophomore wide receiver Emmanuel Butler, who leads the team with 30 catches, 697 receiving yards and nine receiving touchdowns. The Lumberjacks are 2-0 this season at home.\nLeading passer: Case Cookus, Fr.: 1,414 yards, 15 touchdowns, two interceptions\nLeading rusher: Casey Jahn, Sr.: 579 rushing yards, two touchdowns\nLeading receiver: Emmanuel Butler, So.: 30 catches, 697 yards, nine touchdowns\nWeber State update: Weber State is riding back-to-back nail-biter victories at the STATS FCS Top 25 poll then-No. 12 Montana (24-21 in overtime) and at home against North Dakota (a 25-24 win). In both victories, it was the Weber State defense that came up huge. Against Montana, freshman defensive lineman Filipe Sitake recovered a fumble in overtime to set up the game-winning field goal. Against North Dakota, sophomore linebacker Emmett Tela forced and recovered a fumble to set up the go-ahead score, then intercepted a pass to clinch the hard-fought win. Leading the Weber State offense is junior quarterback Jadrian Clark, who has completed half of his passes this season for 1,049 yards and seven touchdowns with six interceptions. Weber State is 2-2 on the road this season, but its two road losses have come against FBS opponent Oregon State and FCS then-No. 2 North Dakota State.\nLeading passer: Jadrian Clark, Jr.: 1,049 yards, seven touchdowns, six interceptions\nLeading rusher: Eric Wilkes, So.: 464 rushing yards, one touchdown\nLeading receiver: Cameron Livingston, Jr.: 22 catches, 272 yards, two touchdowns", "external_links": [], "published": "2015-10-24T01:59:00.000+03:00", "crawled": "2015-10-24T05:13:15.253+03:00", "highlightTitle": ""}