{"organizations": ["Kansas City Royals"], "uuid": "5145a8098cd9b340cc9e5a5153fd9a4e0eb08f97", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.google.com", "main_image": "http://imgick.nj.com/home/njo-media/width620/img/njcom_photos/photo/2015/10/24/19042618-large.jpg", "site_section": "http://news.google.com/news?pz=1&cf=all&ned=us&hl=en&topic=s&output=rss", "section_title": "Sports - Google News", "url": "http://news.google.com/news/url?sa=t&fd=R&ct2=us&usg=AFQjCNFBh1YeC_7hE-pe9TBWWOp2z9bAOg&clid=c3a7d30bb8a4878e06b80cf16b898331&cid=52778977072254&ei=RMQsVvDLIJzqa-yEq5gP&url=http://www.nj.com/mets/index.ssf/2015/10/why_mets_aces_have_met_their_match_in_world_series.html", "country": "IL", "title": "Why Mets aces have met their match in World Series with Kansas City Royals - NJ.com", "performance_score": 0, "site": "google.com", "participants_count": 0, "title_full": "Why Mets aces have met their match in World Series with Kansas City Royals - NJ.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T12:22:00.000+02:00", "replies_count": 0, "uuid": "5145a8098cd9b340cc9e5a5153fd9a4e0eb08f97"}, "author": "", "url": "http://news.google.com/news/url?sa=t&fd=R&ct2=us&usg=AFQjCNFBh1YeC_7hE-pe9TBWWOp2z9bAOg&clid=c3a7d30bb8a4878e06b80cf16b898331&cid=52778977072254&ei=RMQsVvDLIJzqa-yEq5gP&url=http://www.nj.com/mets/index.ssf/2015/10/why_mets_aces_have_met_their_match_in_world_series.html", "ord_in_thread": 0, "title": "Why Mets aces have met their match in World Series with Kansas City Royals - NJ.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments \nNEW YORK — When Matt Harvey steps on the Kauffman Stadium mound Tuesday sometime after 8:07 mph in the bottom of the first inning of Game 1, he will embody the very essence of what has gotten the Mets to the World Series. He is young, talented and has a right arm that pumps fastballs at upwards of 95 mph with ease and regularity. Jacob deGrom will follow him the next day and then Noah Syndergaard and Steven Matz. \nNo team has more pitching talent in its rotation than the Mets. No rotation in the National League throws harder than the Mets. And no team could be better suited to hit the Mets than the Royals. \nIt will turn the World Series into a matchup of strength vs. strength -- the Mets' hard-throwing rotation against a lineup that devours pitchers of just that sort. \n\"Our guys strike people out, so if we're not striking people out, we better catch the baseball,\" manager Terry Collins said . \"So now we've really got to make sure defensively, we've got the right people there. So I still think we'll strike people out because our guys have got some good stuff, again that's why it's going to be exciting to watch these matchups as they unfold. RELATED: Can Mets' Daniel Murphy keep up 'crazy' pace (7 homers in 9 games) in World Series? \n\"Our good pitching against their good hitting ... It's the World Series, it's going to be fun.\" \nThe Royals will present an obstacle unlike the others the Mets have faced so far in this postseason. Unlike the Dodgers, they have a lineup that runs deep. Unlike the Cubs, they grind at-bats and hardly ever strikeout. \nIn fact no team in baseball makes contact more often than Kansas City. The Royals led all of baseball in contact rate this season. And struck out less frequently than any team too. \nIn many ways, it is an offense that resembles Daniel Murphy more than any other Met. They swing often -- more than all but five teams at pitches out of the strike zone -- and hardly miss. They finished last in the sport in walk rate and second-to-last in walks. \n\"It's going to be tough,\" Royals left fielder Alex Gordon told the New York Post . \"With deGrom, Syndergaard and Harvey they have great pitching. It will be a tough test for us. Hopefully we come through.'' \nBut the problem for the Mets staff will be that not only is the Royals collection of hitters talented and antagonistic, it could undermine their very strength. \nThe Mets' group of starters threw more pitches at 95 mph or harder this season than any other team in baseball. Which suits the Royals just fine. They wallop hard-throwers. \nThe Royals led baseball with a .284 batting average against pitches thrown at 95 mph or harder, according to baseballsavant.com . They also had the lowest strikeout rate and were second in slugging percentage. \nIt will be a test for a rotation that has been able to overpower hitters this month and all season. The Mets staff leads all playoff teams with a 2.65 ERA and 69 strikeouts in 54 1/3 innings. And there is no intention to deviate away from what has worked so far. \n\"Successful pitchers pitch to their strengths,\" Collins said. \n\"Hey look, if you're a fastball and that's your main pitch, that's what you're throwing. What you've got to do is make good pitches with it. So we're not going to change the way we go about things. We've still got to pitch to our strength and our strength is power. And so we'll use that and then we'll change speeds and throw strikes and again, if you make quality pitches, your chance for success is gonna rise. That's what we've done, we've made big pitches when we've needed to.\" \nThen again, the Royals have never seen a of pitchers like the kind the Mets will push at them. \nHarvey is a snarling right-hander who relishes the spotlight. DeGrom has emerged into a gritty and brilliant postseason pitcher, winning three games already this month. Syndergaard is precocious 6-foot-6 who fires 100 mph fastballs and a curveball that can leave batters flailing in the wind. And Matz has pitched well in just eight starts all year after rising to become one of the top pitching prospects in the sport. \nThe Royals have also not faced as much firepower as the Mets will present. They have seen the fifth fewest amount of pitches at 95 mph or harder this year. And no other team can present talent on the mound like the Mets can game after game. \nRELATED: 4 Kansas City Royals who pose biggest threat to Mets in World Series \n\"What makes this team very good is the depth of the starting pitching,\" David Wright said. \"And it seems like every game, especially when you're running out those four starters, you have an ace-type on the mound for you. Where it's just a lot of teams in baseball just don't have that.\" \nIt's why the Mets still feel self-assured heading into the World Series. Five days of rest allowed them to rest their starters after signs of fatigue and to line it up in the order of their preference. \nHarvey will start Game 1 and could pitch in as many as three games this series. DeGrom will start Game 2 with the extra rest Collins had hoped for. Syndergaard will pitch Game 3 at Citi Field, where he has been markedly better than on the road. \nAfter years of building, after identifying itself as an organization rich in pitching and taking the care to nurture it here, the Mets are confident heading into the World Series that their rotation can bring them a trophy. \n\"Our starting pitching gives us a shot against anybody,\" general manager Sandy Alderson said. \"With that in mind, I'm looking forward to playing Kansas City. But I do think the depth of our starting pitching gives us a good chance against anyone.\"", "external_links": [], "published": "2015-10-25T12:22:00.000+02:00", "crawled": "2015-10-25T14:00:49.661+02:00", "highlightTitle": ""}