{"organizations": ["NCAA", "Virginia Tech"], "uuid": "9a039cd9f2691e3710add0daf3c8ccd2099fc43e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.postandcourier.com", "main_image": "http://www.postandcourier.com/storyimage/CP/20151018/PC0312/151019307/AR/0/AR-151019307.jpg", "site_section": "http://www.postandcourier.com/apps/pbcs.dll/section?Category=PC2007&template=rss", "section_title": "National Sports", "url": "http://www.postandcourier.com/article/20151018/PC0312/151019307/1032&ampsource=RSS", "country": "US", "title": "The Hangover, Part VII: Scouting Miami", "performance_score": 0, "site": "postandcourier.com", "participants_count": 0, "title_full": "The Hangover, Part VII: Scouting Miami", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T16:37:00.000+03:00", "replies_count": 0, "uuid": "9a039cd9f2691e3710add0daf3c8ccd2099fc43e"}, "author": "", "url": "http://www.postandcourier.com/article/20151018/PC0312/151019307/1032&ampsource=RSS", "ord_in_thread": 0, "title": "The Hangover, Part VII: Scouting Miami", "locations": ["Fla", "Miami", "Miami Gardens"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Rashawn Scott"], "text": "Email @Aaron_Brenner Oct 18 2015 8:37 am Oct 18 8:43 am Miami wide receiver Rashawn Scott (11) celebrates with teammates after his fourth quarter touchdown pass catch against Virginia Tech in an NCAA college football game, Saturday, Oct. 17, 2015, in Miami Gardens, Fla. Miami won the game 30-20. (AP Photo/Joe Skipper) × \nWho : No. 5 Clemson (6-0, 3-0 ACC) at Miami (4-2, 1-1) \nWhen : Oct. 24, noon \nWhere : Sun Life Stadium (64,982) | Miami Gardens, Fla. \nTV : ABC \nClemson Radio : Clemson Radio Network (WQSC-AM 1340 in Charleston) | Affiliates \nOpposing beat writer to follow : Susan Miller Degnan, Miami Herald ( @SMillerDegnan ) \nWhat to know about Miami : The Hurricanes opened with easy wins over Bethune-Cookman and Florida Atlantic, and held off a furious rally by Nebraska, for a 3-0 start. Then back-to-back road games didn’t go Miami’s way, losing at Cincinnati and Florida State by a combined 16 points, before Saturday afternoon’s 30-20 win over Virginia Tech ... head coach Al Golden, oft-embattled in his job security, fell to 3-9 against top-25 opponents in the Florida State loss during his five seasons in Coral Gables. He was 0-5 vs. ranked teams in five years at Temple ... Golden’s home record with Miami is 22-8; he’s never had a .500 or worse home mark since taking the Miami job ... moving forward without Duke Johnson but with Brad Kaaya, the U leads the ACC in passing offense by a wide margin, and ranks 19th nationally with 307.5 yards per game ... senior wide receiver Rashawn Scott’s 74.3 yards a game ranks second in the conference, and he’s averaging 13.5 yards per reception ... through its first six games, Miami only allowed 19 tackles for loss, which is good for second-fewest nationally. The Hokies did notch five Saturday ... however, Miami’s 33 tackles for loss on defense ranks 10th in the ACC on a per-game basis ... Miami’s turnover margin, gaining 13 and losing two on the year, is the best in the country. \nWhen last they met : No. 16 Miami 30, Clemson 21 on Oct. 2, 2010 in Clemson : After only turning the ball over twice in their first three games, Kyle Parker and the Tigers combined for six cough-ups while Jacory Harris threw for four touchdowns. Parker threw three picks and lost two fumbles. “It was really miraculous it was that close,” Clemson coach Dabo Swinney said afterward. “I told the guys most of this falls on me,” added Parker. \nAll-time series : Miami leads 6-3, but the series is tied at 3-all when the game’s played in south Florida. The home team has actually lost all four matchups (two wins a piece) since Miami joined the ACC, and that includes three overtime games in 2004, 2005 and 2009. The Tigers have only beaten the Hurricanes once in regulation: back in 1950, a 15-14 squeaker in the Orange Bowl when both teams were undefeated. Frank Howard was the head coach, and the Tigers won on a fourth-quarter safety. History is fun. \nWhich Clemson Tiger is licking his chops : Sophomore receiver Artavis Scott, the ACC’s No. 3 receiver whose band of Florida-born Tigers (receivers Deon Cain and Ray-Ray McCloud, tight end Jordan Leggett, nickelback Travis Blanks, safety Jayron Kearse and cornerback Mackensie Alexander) have circled this one on the calendar for a while. \nWho’s keeping the Clemson coaches up at night : Sophomore quarterback Brad Kaaya, who leads the ACC with 1,795 yards on 61.2 percent completions, firing 10 touchdowns against one interception. As a freshman in 2014, Kaaya had the highest passer rating (145.88) of all ACC qualified quarterbacks, percentage points higher than Jameis Winston. \nExtra point : Miami last won a bowl game on Dec. 31, 2006 in the MPC Computers Bowl, a 21-20 triumph over Nevada in Boise, Idaho. The Hurricanes’ head coach that day was Larry Coker, who’d already been fired. \n-AB", "external_links": [], "published": "2015-10-18T16:37:00.000+03:00", "crawled": "2015-10-18T17:57:56.020+03:00", "highlightTitle": ""}