{"organizations": [], "uuid": "b354081e241e96d8158c9ca186466da356017f28", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com/asset/1200_630/562a64471400002b003c8ffa.jpeg?cache=ipuXrCIlVz", "site_section": "http://www.huffingtonpost.com/tag/combat-sports/feed", "section_title": "Combat Sports on Huffington Post", "url": "http://www.huffingtonpost.com/entry/ufc-reinstates-jon-jones_562a6322e4b0aac0b8fcb021", "country": "US", "title": "UFC Reinstates Former Champion Jon Jones", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "UFC Reinstates Former Champion Jon Jones", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T16:05:00.000+03:00", "replies_count": 0, "uuid": "b354081e241e96d8158c9ca186466da356017f28"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/entry/ufc-reinstates-jon-jones_562a6322e4b0aac0b8fcb021", "ord_in_thread": 0, "title": "UFC Reinstates Former Champion Jon Jones", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "UFC Reinstates Former Champion Jon Jones He can return to the octagon effective immediately. Juliet Spies-Gans Editorial Fellow, HuffPost Sports Posted: 10/23/2015 01:05 PM EDT Brandon Magnus/Zuffa LLC via Getty Images \nThe UFC officially reinstated former champion Jon Jones to its roster on Friday morning, less than a month after he pleaded guilty in a hit-and-run case involving a pregnant woman . \n“ We've made it clear to Jon that this new opportunity to compete in UFC is a privilege and not a right, and that there are significant expectations we have regarding his conduct moving forward,\" stated UFC Chairman and CEO Lorenzo Fertitta. “We’re happy to read and see reports that he has embraced the terms of his plea agreement and is using this experience to grow and develop as a person.” \nJones’ statement on the matter centered on proving his character moving forward. \n“ I am grateful for the opportunity to resume my career and I am excited to show how much I've grown as a person outside of the octagon,” he wrote on Facebook. “It took me losing almost everything I had worked for to realize how much I had … This marks the beginning of a new chapter in my life and my career and let me assure you, the best is yet to come.” \nThanks to the reinstatement, Jones can now return to the octagon effective immediately. \nLast month, Jones was charged with leaving the scene of an accident, following the April 2015 hit-and-run in which he wrecked his SUV, injured a pregnant woman, left the scene, then came back to take cash from his rental car. He was subsequently arrested and suspended from the UFC. \nThe UFC was careful to include that Jones’ reinstatement is contingent on the fighter completing the terms of his plea agreement.", "external_links": [], "published": "2015-10-23T16:05:00.000+03:00", "crawled": "2015-10-24T01:53:26.860+03:00", "highlightTitle": ""}