{"organizations": ["Princeton", "Harvard"], "uuid": "3aad6ab1ecf4ae248f41dbbfbaf7483d218f73a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.google.com", "main_image": "http://thumbnails.thecrimson.com.s3.amazonaws.com/photos/2015/10/24/135719_1309702.JPG.635x423_q95_crop-smart_upscale.jpg", "site_section": "http://news.google.com/news?pz=1&cf=all&ned=us&hl=en&topic=s&output=rss", "section_title": "Sports - Google News", "url": "http://news.google.com/news/url?sa=t&fd=R&ct2=us&usg=AFQjCNGTm0_pH58kLZSIHUWL28XLHro4oA&clid=c3a7d30bb8a4878e06b80cf16b898331&cid=52778976458466&ei=UDcsVsDnHIOkaqPxncgB&url=http://www.thecrimson.com/article/2015/10/24/harvard-princeton-football/", "country": "IL", "title": "Football Pummels Princeton, 42-7, Preserving Perfect Record - Harvard Crimson", "performance_score": 0, "site": "google.com", "participants_count": 0, "title_full": "Football Pummels Princeton, 42-7, Preserving Perfect Record - Harvard Crimson", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T23:48:00.000+03:00", "replies_count": 0, "uuid": "3aad6ab1ecf4ae248f41dbbfbaf7483d218f73a0"}, "author": "", "url": "http://news.google.com/news/url?sa=t&fd=R&ct2=us&usg=AFQjCNGTm0_pH58kLZSIHUWL28XLHro4oA&clid=c3a7d30bb8a4878e06b80cf16b898331&cid=52778976458466&ei=UDcsVsDnHIOkaqPxncgB&url=http://www.thecrimson.com/article/2015/10/24/harvard-princeton-football/", "ord_in_thread": 0, "title": "Football Pummels Princeton, 42-7, Preserving Perfect Record - Harvard Crimson", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Andrew Fischer", "David Steinbach"], "text": "By David Steinbach , CRIMSON STAFF WRITER October 24, 2015 Senior wide receiver Andrew Fischer amassed 190 yards on 10 catches, including one for a touchdown. Harvard throttled Princeton at home on Saturday, 42-7. Y. Kit Wu \nFor the first time all season on Saturday, the undefeated Harvard football team encountered adversity. After 27 minutes of play against visiting Princeton, the Crimson found itself locked in a 7-7 tie. \nThe explosive Harvard offense that fans have grown accustomed to seeing throughout the first five games of the season was decidedly absent. The Crimson lost two fumbles and failed to convert on a pair of fourth downs in the first half, and the home crowd of 17,000 buzzed with tension. \nBut Harvard (6-0, 3-0 Ivy) proved that it was more than up for the challenge. Beginning with the final drive of the first half, the Crimson scored a touchdown on five consecutive possessions. Another dominant defensive performance kept a potent Princeton (4-2, 1-2) attack from ever getting rolling. \nWhat was once a battle had quickly transformed into a rout that ended with Harvard prevailing, 42-7. The Crimson finished with 647 yards of total offense, scored at least 40 points for the sixth time in a row, and notched the program’s 20th consecutive victory. \n“I thought we came out a little sloppily offensively, a little uncharacteristic in terms of our ball security,” Crimson coach Tim Murphy said. “But the touchdown at the end of the half gave us a little of momentum. We made a couple of adjustments at halftime, the kids played really hard with a lot of conviction in the second half, and obviously we had a pretty good game.” \nIndeed, with three minutes remaining in a first half of relatively sloppy offensive play, Harvard desperately needed a spark. It found one through a 94-yard touchdown drive capped by a sliding, five-yard reception from senior tight end Ben Braunecker in the front of the end zone. \nThe touchdown exposed cracks in what had previously been a staunch Tigers defense. The dam officially broke soon thereafter. \nThe four Crimson touchdowns on as many possessions in the second half came through a balance of running and passing that has been a staple of Harvard’s offense so far this year. On Saturday, those units contributed their best performances of the season. \nSenior quarterback Scott Hosch finished with a career-high 437 yards passing, the most from a Crimson player since the team’s loss to Princeton in 2012. Hosch benefited from standout performances from Braunecker and senior wide receiver Andrew Fischer, each of whom reeled in a touchdown and finished with 133 and 190 receiving yards, respectively. \nHaving missed the last two games with an upper-body injury, Fischer certainly appeared to be 100 percent on Saturday. The senior returned kicks and made leaping catches all over the field, highlighted by an over-the-shoulders reception on a corner route for a 14-yard touchdown that gave Harvard a 28-7 third-quarter lead. \n“Fisch, he’s just a great player, and I know that he’s going to win routes,” Hosch said. “I know if I get the ball anywhere in his area, he’s going to compete for it…. We know that if the offense is a little stagnant, we know that Fisch is going to make a play.” \nBut when the Tigers focused too much on defending the pass, senior running back Paul Stanton was there to punish them. Stanton finished with 119 rushing yards, including dashes from two and nine yards out for touchdowns in the second half. \nDwelling excessively on such a complete and controlling offensive performance, however, runs the risk of overlooking a defensive showing that may have been the most impressive yet in the Crimson’s march to a 6-0 record. A Princeton offense that totaled 75 points in its last two contests looked lost most of the afternoon. \nPaced by nine tackles apiece from captain Matt Koran and senior linebacker Jacob Lindsey, the Harvard defense surrendered just 55 rushing yards and quickly forced Princeton to become one-dimensional. Tigers quarterback Chad Kanoff threw for 236 yards but proved unable to string drives together, forcing the Princeton punting unit to take the field 11 times. \nThe lone offensive highlight for the Tigers came on a second-quarter drive that featured two third-down conversions and a two-yard touchdown pass. Seemingly bothered by the scoring drive that marked the first time in 212 minutes the Harvard defense had allowed a touchdown, the unit promptly entered full lockdown mode. \nSure enough, those were all the points Princeton would get. \n“It’s uncharacteristic of our defense to give up a touchdown right now,” Koran said. “If we give up a touchdown, we take it pretty seriously…. We just regrouped on the sideline. We were doing everything right before that, so we just got back to the basics.” \nDespite moving the ball consistently in the first half, the Crimson repeatedly had nothing to show for its possessions due to untimely mistakes on offense. Along with a pair of lost fumbles, Harvard failed to convert on two fourth-down attempts. \nHeld scoreless in the opening quarter for the first time all season, the Crimson eventually rode the explosive Fischer-Braunecker dual threat down the field to its first touchdown of the day on a Hosch rush early in the second quarter. \nYet while the dogfight persisted throughout the first half, the Crimson never trailed. The team has found itself behind for only 17 total seconds throughout the first six games of what has thus far been a dominant season. On Saturday, the Crimson demonstrated once again that it is head-and-shoulders above its competition—even when that competition was billed as Harvard’s first true test of the 2015 season in the form of Princeton. \n“That was the biggest thing that we talked about after the game, that we needed that adversity,” Koran said. “Seeing that adversity was huge for our defense, huge for our offense. Just knowing when to step up and make big plays and how to do that and being comfortable doing that.” \n–Staff writer David Steinbach can be reached at dsteinbach@college.harvard.edu. Want to keep up with breaking news? Subscribe to our email newsletter. Read more in Sports", "external_links": [], "published": "2015-10-24T23:48:00.000+03:00", "crawled": "2015-10-25T03:59:10.243+02:00", "highlightTitle": ""}