{"organizations": [], "uuid": "36814e0b1a8309daca6a337471a4dc3c51fc6275", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deseretnews.com", "main_image": "http://img.deseretnews.com/images/article/hires/1614314/1614314.jpg", "site_section": "http://www.deseretnews.com/sports/index.rss", "section_title": "Sports news and headlines for the Utah Jazz, BYU Cougars, Utah Utes and high schools, Salt Lake City sports, Utah sports - Deseret News", "url": "http://www.deseretnews.com/article/865639471/Impact-players-BYU-hopes-to-get-some-players-more-experience-against-Wagner.html", "country": "US", "title": "Impact players: BYU hopes to get some players more experience against Wagner", "performance_score": 0, "site": "deseretnews.com", "participants_count": 2, "title_full": "Impact players: BYU hopes to get some players more experience against Wagner | Deseret News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 2, "uuid": "36814e0b1a8309daca6a337471a4dc3c51fc6275"}, "author": "", "url": "http://www.deseretnews.com/article/865639471/Impact-players-BYU-hopes-to-get-some-players-more-experience-against-Wagner.html", "ord_in_thread": 0, "title": "Impact players: BYU hopes to get some players more experience against Wagner", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A brief look at some of the players who could have an impact on the game as Wagner College travels to Provo for a game against the Cougars.\nUpcoming Games BYU Football BYU football stats & schedule Wagner @ BYU Lavell Edwards Stadium, Provo Oct. 24, 1:00 p.m. 2 Days 20 Hrs 9 Mins 16 Secs More Coverage BYU football: The Wagner Seahawks in 6 numbers PROVO — BYU finishes its monthlong homestand this weekend against Wagner College of the Northeast Conference. With a win, the Cougars will become bowl eligible for the 11th time under head coach Bronco Mendenhall.\nThe visiting Seahawks are winless so far this season, being outscored 144-63 in their five games against other FCS teams. The long trip from Staten Island, New York, to Provo probably won’t yield any different results, but there are still some players to watch for on Saturday.\nBeau Hoge/Koy Detmer, Jr. — In seven previous games against FCS opponents under Mendenhall, BYU is averaging more than 50 points per game while giving up less than 10. This game should be no different and it becomes a question of when — not if — one (or possibly both) of these two freshmen quarterbacks enter the game.\nBYU fans got a brief look at Hoge in the game against East Carolina when starter Tanner Mangum exited the game with a hamstring injury. Hoge struggled in that appearance completing only one pass attempt for 9 yards before Mangum returned. Ideally, Mangum will get some game reps during the first quarter and by the fourth quarter, a Detmer will be lined up at quarterback for the first time since Ty Detmer played his last game in 1991.\nFrancis Bernard – Assuming Mendenhall has the ability to get some of the players further down the depth chart in the game for long stretches Saturday afternoon, BYU fans should expect to see plenty of Bernard. The freshman has already played in four games this season, so him getting more playing time shouldn’t come as a surprise.\nLook for the 235-pounder to improve on his 196 total yards with plenty of rush attempts and possibly catches out of the backfield. His stats for Saturday will probably be more determined upon how much the offensive coaches allow the quarterbacks to throw the football when the game is under control.\nTevita Mo’Unga – The 340-pound freshman from Murrieta, California, has played in four games already this season while junior Travis Tuiloma was injured, but he hasn’t registered any statistics. Tuiloma has increasingly returned to the field over the last two weeks, but he should probably expect to get a bit more rest during this weekend’s game.\nMo’Unga will be tasked with disrupting the run game and clogging the middle of the line when he is on the field. BYU fans will want to see how he compares to Tuiloma.\nAlex Thomson – The sophomore signal-caller probably has the size to play football at a bigger school than Wagner (6-foot-5 and 220 pounds), but he has struggled so far this year. Thomson has completed only about 53 percent of his pass attempts for 602 yards and five touchdowns on the season.\nHe has added 134 yards and a touchdown on the ground, but has thrown three interceptions as well. Thomson may have the opportunity to improve his passing stats this weekend if the Seahawks get behind early and play more of the Cougar back-ups as the game goes on.\nTim Hayes/Bruce Brittingham – These two defensive backs are some of the leaders of the Seahawk defense. Brittingham leads the team with 32 total tackles, including 1.0 tackles for loss and an interception. Hayes, a University of Wyoming transfer, has 27 total tackles plus seven pass break-ups.\nThey may be tested early if Mangum starts the game as expected but may have less of an effect from a pass-defense standpoint if Hoge or Detmer are instructed to hand the ball off on most plays in the second half.\nStephen Font-Toomer – This senior linebacker is having a breakout season so far this year. Last season, he accounted for 46 tackles and is currently tied with Brittingham for the team lead in total tackles with 32 after only six games.\nHe has also registered 2.0 tackles for loss, a sack, a forced fumble and a fumble recovery this season.\nLandon Walters studied history and political science at Salt Lake Community College. He is an avid sports fan and loves writing. Email: mavericksoccer_22@hotmail.com", "external_links": ["http://deseretnews.sportsdirectinc.com/football/ncaaf-teams.aspx?page=/data/ncaaf/teams/team33.html", "http://deseretnews.sportsdirectinc.com/football/ncaaf-players.aspx?page=/data/ncaaf/players/player46121.html"], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-22T01:53:25.949+03:00", "highlightTitle": ""}