{"organizations": ["NCAA", "Huskies vs Trojans FILE"], "uuid": "b4854570ed4fa7940965096bbb55ba2a87547949", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.komonews.com", "main_image": "http://media.komonews.com/images/151005_huskies_tb.jpg", "site_section": "http://www.komonews.com/sports/index.rss", "section_title": "KOMO News - Sports", "url": "http://www.komonews.com/sports/5-things-to-watch-Huskies-vs-Trojans-330725341.html", "country": "US", "title": "5 things to watch: Huskies vs Trojans", "performance_score": 0, "site": "komonews.com", "participants_count": 0, "title_full": "5 things to watch: Huskies vs Trojans", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T18:34:00.000+03:00", "replies_count": 0, "uuid": "b4854570ed4fa7940965096bbb55ba2a87547949"}, "author": "", "url": "http://www.komonews.com/sports/5-things-to-watch-Huskies-vs-Trojans-330725341.html", "ord_in_thread": 0, "title": "5 things to watch: Huskies vs Trojans", "locations": ["California", "Washington", "Seattle"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jake Browning", "Thompson"], "text": "FILE - Washington quarterback Jake Browning (3) follows teammates through onto the field before an NCAA college football game against California, Saturday, Sept. 26, 2015, in Seattle. Cal won 30-24. (AP Photo/Elaine Thompson) \nLOS ANGELES -- It's not a typical week for the Huskies. \nInstead of a normal Saturday game, Washington (2-2) meets No. 17 USC (3-1) on Thursday. The Huskies and Trojans get started under the lights at 6 p.m. in Los Angeles. \nYou can watch the game nationally on ESPN, or listen to the call on your 'Home of the Huskies' KOMO NewsRadio. \nHere are five things to watch in the clash between the Huskies and Trojans: \nFACING SARKISIAN There's no bigger story line in this game than the Huskies facing their old head coach Steve Sarkisian. \"Sark\" led Washington from 2009-2013 before leaving for USC. The Huskies and Trojans didn't play each other last season, so this is the first time Washington faces its old coach. Many of the Huskies were recruited by and played for Sarkisian on Montlake. Defensive tackle Elijah Qualls admitted this week, \"It's going to be a little weird at first, but my focus isn't going to be their sidelines.\" Chris Petersen, who went through something similar when he returned to Boise State, agrees. He said there's a lot of pregame hype, but that doesn't have anything to do with how the game is played. PLAYING IN THE COLISEUM Believe it or not, the Huskies are playing USC in Los Angeles for the first time since 2011. That means there isn't a single Washington player who's suited up for a college game in the Coliseum. It might not mean much to you, but playing USC in the Coliseum is a big deal for kids from the Los Angeles area. Jaydon Mickens, who grew up in L.A., said, \"If you're from California, you wanted to go to USC.\" That means most of these guys were overlooked by the Trojans, and that could mean a chip on their shoulder. There are 60 players on the Huskies roster from California. BYE WEEK PROGRESS By the time the Huskies take the field on Thursday, it will be 13 days since their last game. That's because of a bye last week. Chris Petersen admits the bye week was a bit of balancing act this year. That's because he knows his guys need rest, but they're also a young squad that needs to improve. The focus wasn't on preparing for USC, instead Washington worked on themselves. There's no doubt the Huskies need to take better care of the ball. Washington turned the rock over five times in its last game against California. Will the Huskies see immediate results from the bye week? We'll find out soon enough. ONE STEP FORWARD... Chris Petersen has said all along that it's one step forward, two steps back for freshman quarterback Jake Browning. We definitely saw two steps back in the Pac-12 opener against California. After throwing for 695 yards, 5 touchdowns, and 1 interception the previous two games, Browning completed just 17 passes for 152 yards, 2 interceptions, and not a single touchdown against the Golden Bears. Now, Browning has the task of facing USC on the road. The last time Browning played a ranked opponent in their house, he threw for a career-low 150 yards and 2 interceptions against Boise State in the season opener. We'll see if there's a step forward against the Trojans. THE NAME OF THE GAME IS DEFENSE Despite allowing 30 points to California, the Huskies are still one of the best defensive units in the country. Washington ranks 17th in the nation in scoring defense, giving up an average of 15 points per game this season. The Golden Bears' 30 points doesn't sound so bad when you figure the defense was on the field for 92 plays and nearly 40 of the game's 60 minutes. Elijah Qualls said he was so sore after the game he could barely move the next day. It's not going to be much easier this week. USC ranks 9th in the country in total offense, averaging 532 yards per game. Quarterback Cody Kessler is the key to USC's offense. He's thrown for nearly 1,300 yards already this season, and he has 15 touchdowns and just 1 interception to his name.", "external_links": [], "published": "2015-10-08T18:34:00.000+03:00", "crawled": "2015-10-08T19:20:11.278+03:00", "highlightTitle": ""}