{"organizations": [], "uuid": "a6ea5c1a78d798f94c0d8b5681c805a69ca316a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtontimes.com", "main_image": "http://media.washtimes.com.s3.amazonaws.com/media/image/2015/10/04/ace749f3987ee42c830f6a7067001753.jpg", "site_section": "http://www.washingtontimes.com/rss/headlines/sports/", "section_title": "www.washingtontimes.com stories: Sports", "url": "http://www.washingtontimes.com/news/2015/oct/5/playoff-push-kershaw-aims-at-redemption-stars-set-/", "country": "US", "title": "Playoff Push: Kershaw aims at redemption, stars set to debut", "performance_score": 0, "site": "washingtontimes.com", "participants_count": 1, "title_full": "Playoff Push: Kershaw aims at redemption, stars set to debut", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T10:50:00.000+03:00", "replies_count": 0, "uuid": "a6ea5c1a78d798f94c0d8b5681c805a69ca316a4"}, "author": "The Associated Press", "url": "http://www.washingtontimes.com/news/2015/oct/5/playoff-push-kershaw-aims-at-redemption-stars-set-/", "ord_in_thread": 0, "title": "Playoff Push: Kershaw aims at redemption, stars set to debut", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sports Playoff Push: Kershaw aims at redemption, stars set to debut Los Angeles Dodgers starting pitcher Clayton Kershaw throws his 300th seasonal strikeout during the third inning of a baseball game against the San Diego Padres, Sunday, Oct. 4, 2015, in Los Angeles. (AP Photo/Mark J. Terrill) more > By The Associated Press - Associated   \nThe Major League Baseball playoffs begin this week, starting Tuesday night with the American League wild-card game at Yankee Stadium. \nBig stars Andrew McCutchen, Prince Fielder and Zack Greinke, familiar faces David Wright, Johnny Cueto and Adam Wainwright and top rookies such as Kris Bryant fill the rosters of the 10 teams that reached the postseason. \nA look at some of the themes going into October and beyond: \nCURSED KERSHAW?: Clayton Kershaw has been the game’s best pitcher in recent years during the regular season, but has struggled mightily in the postseason. The Dodgers ace is 1-5 with a 5.12 ERA in 11 career playoff appearances (three in relief), including four mostly miserable starts against the Cardinals over the last two Octobers. The three-time Cy Young winner won’t have to worry about St. Louis until the NL Championship Series, if at all, and instead turns his attention this week to an NL Division Series showdown versus the Mets, against whom he posted an 0.56 ERA in two starts this season. \nFIRST-TIMERS: Jose Bautista is a home run champion, Jose Altuve is a hit machine and Jake Arrieta is the top winner in the majors. They’ll put something else on their resumes this week, too - their first postseason appearances. Altuve and Astros rookie teammate Carlos Correa, Arrieta and Cubs sluggers Anthony Rizzo and Bryant, young Mets aces Matt Harvey, Jacob deGrom and Noah Syndergaard, Yankees star Masahiro Tanaka and Dodgers newcomer Corey Seager are set to make their playoff debuts. \nFRIENDLY CONFINES: Could this be the year the century-plus title drought ends on the North Side of Chicago? When the Cubs last won the World Series in 1908, Roosevelt was president - Theodore Roosevelt. They haven’t even reached the World Series since 1945, two years before baseball’s championship was televised for the first time. But with Bryant and Arrieta, hopes are high at Wrigley Field, the quaint ballpark that moved into the 21st century this year with a renovation that included - gasp! - a 3,990-square foot video board above the left-field bleachers and a smaller one in right. With the Series extending into November, the Cubs hope fans everywhere will be watching as the ivy along the outfield walls turns red and brown. \nA-ROD IS BACK: Written off by many last year during his one-season drug suspension, Alex Rodriguez returned this year and carried the Yankees’ lineup early. Shifted from third base to designated hitter, he hit .250 with 33 homers and 86 RBIs. He passed Willie Mays for fourth on the career home run list, reached 3,000 hits and settled a dispute with the team over a multimillion marketing payment. But around the time of his 40th birthday in late July, he went into a slump and tailed off badly. A-Rod hit .216 after the All-Star break and drove in just three runs in his final 18 games. \nDH NEEDED: Runs will be at a premium in the National League, which featured a deep Cy Young Award field of pitchers mostly on contending teams. The Cubs’ Arrieta (22-6, 1.77 ERA) will face the Pirates’ Gerrit Cole (19-8, 2.60) in the wild-card game, one of the most anticipated pitching matchups in recent postseason history. After that, the Mets will take on the Dodgers in a series that features deGrom (14-8, 2.54), Syndergaard (9-7, 3.24) and Harvey (13-8, 2.71) for New York and Kershaw (16-7, 2.13, 301 strikeouts) and Greinke (19-3, 1.66) for L.A. Meanwhile, the Cardinals had four pitchers make at least 20 starts this year with ERA’s of 3.03 or lower, although one of them, Carlos Martinez, will miss the postseason with a strained right shoulder. \nCopyright © 2015 The Washington Times, LLC.", "external_links": [], "published": "2015-10-05T10:50:00.000+03:00", "crawled": "2015-10-05T12:21:11.563+03:00", "highlightTitle": ""}