{"organizations": ["Bethlehem Catholic"], "uuid": "ae652491506e0af0e2c16fd6cd1a4ada4713f9da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "highschoolsports.lehighvalleylive.com", "main_image": "http://hssn-media.advance.net/PennLive.com/news/1bd14da2db3347d9aa203ed7809f4132/MollyEhrigBrennaMagliochetti.jpg", "site_section": "http://blog.lehighvalleylive.com/lehighvalleylive_high_school_sports_homepage_feed/atom.xml", "section_title": "lehighvalleylive.com High School Sports", "url": "http://highschoolsports.lehighvalleylive.com/news/article/2862286174294538174/bethlehem-catholic-girls-tennis/", "country": "IL", "title": "Underdog Bethlehem Catholic girls tennis duo battles to very end of district final", "performance_score": 0, "site": "lehighvalleylive.com", "participants_count": 0, "title_full": "Underdog Bethlehem Catholic girls tennis duo battles to very end of district final", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T19:53:00.000+03:00", "replies_count": 0, "uuid": "ae652491506e0af0e2c16fd6cd1a4ada4713f9da"}, "author": "", "url": "http://highschoolsports.lehighvalleylive.com/news/article/2862286174294538174/bethlehem-catholic-girls-tennis/", "ord_in_thread": 0, "title": "Underdog Bethlehem Catholic girls tennis duo battles to very end of district final", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Josh Folck", "Brenna Magliochetti", "Molly Ehrig"], "text": "Bethlehem Catholic's Molly Ehrig, left, and Brenna Magliochetti earned hard-fought district silver medals on Monday. (Josh Folck | For lehighvalleylive.com) By Josh Folck | For lehighvalleylive.com on October 20, 2015 11:48 AM View/Post Comments \nThe Bethlehem Catholic tennis duo of freshman Brenna Magliochetti and sophomore Molly Ehrig might not have a lot of experience. \nBut they didn't show any jitters on Monday at Lehigh University in the District 11 Class AA doubles final. \nThe Golden Hawk pair battled top-seeded Coco Chen and Logan Lencheski of Notre Dame all the way to the end of a 2-hour, 15-minute three-set classic. \nBut in the end, the Crusaders team picked up a dramatic 6-3, 2-6, 7-5 victory to claim the championship. \n\"We came in with really no expectations on us. So we could just let loose and play. We didn't have to worry about any expectations. We were the underdogs. So that was kind of freeing in a way,\" Magliochetti said. \n\"It was just exciting. I wasn't that nervous. I was just excited,\" Ehrig said. \"I wasn't expecting us to get here or do this well. I'm just so excited to even get here and play.\" \nMagliochetti and Ehrig bounced back from a first-set loss to pick up a 6-2 victory in the second set. \nThe Golden Hawks then jumped out to a 3-0 lead in the final set before the Crusaders came right back. \nEven when the Notre Dame duo took a 4-3 lead, the young Golden Hawks tied it 4-4. Chen and Lencheski needed to battle through 6 deuces to take a 5-4 lead, but that still didn't clinch things for them as the Golden Hawks duo rallied from 0-30 to tie the final set at 5-5. \nThe Crusaders took the next two games to pick up the title but they needed three match points in the final game to shake off the Bethlehem Catholic pair. \n\"It was great that my kids were, quite frankly, in the match,\" Bethlehem Catholic coach George Harmanos said. \"In the beginning, they were a little bit intimidated. I mean Coco and Logan have great pedigrees, they've been highly-touted. They were the first-seeded team. They expected them to win. I told my kids, 'hey, you're the underdog, just stay loose, keep knocking balls back.' Even though we lost the first set, we kind of had a plan and I think the kids bought into it. Even though we lost the first set, I think they felt confident that it was 6-3 and the second set we started playing a little bit better.\" \nBethlehem Catholic finished the regular season 17-0 and the scary thing for opponents is that it's a very young team. \n\"Actually Brenna's been into tennis for a while. But Molly's pretty much new at it. This is pretty much her second full year into tennis. And she's had significant improvement,\" Harmanos said. \"Last year she played three singles for us. She was 17-1, only lost to the Liberty girl. This year, she moved up to No. 2 and actually she jumped over two kids because Brenna came into the team. She's made great strides. In fact, our whole team is young. Of our nine starters, seven are underclassmen. So we're looking forward to more good tennis from them for sure.\" \nThe Golden Hawks are the top seed in the Class AA team tournament and will host Tamaqua at 3 p.m. Tuesday in the quarterfinals. \n\"It feels so good to contribute to that kind of team,\" Ehrig said. \"We have so much team chemistry. Everybody loves being on the team and I do too.\" \nMagliochetti and Ehrig hope Monday's battle against Notre Dame won't be their last trip to the finals stage in their careers. \n\"Because either as a sophomore and junior, we will have been here before. So that can really beneficial for us in the coming years,\" Magliochetti said.", "external_links": [], "published": "2015-10-20T19:53:00.000+03:00", "crawled": "2015-10-21T02:56:48.157+03:00", "highlightTitle": ""}