{"organizations": [], "uuid": "322a0900ccac4cbce2b20b41d76d340d1e3ed62d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.northjersey.com", "main_image": "http://www.northjersey.com:80/polopoly_fs/1.1429493!/fileImage/httpImage/101015devs.JPG", "site_section": "http://www.northjersey.com/cmlink/sports-rss.rss#", "section_title": "Sports News on NorthJersey.com", "url": "http://www.northjersey.com/sports/devils-drop-opener-3-1-to-jets-1.1429492", "country": "US", "title": "Devils drop opener, 3-1, to Jets - Sports", "performance_score": 0, "site": "northjersey.com", "participants_count": 1, "title_full": "Devils drop opener, 3-1, to Jets - Sports - NorthJersey.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T01:06:00.000+03:00", "replies_count": 0, "uuid": "322a0900ccac4cbce2b20b41d76d340d1e3ed62d"}, "author": "TOM GULITTI", "url": "http://www.northjersey.com/sports/devils-drop-opener-3-1-to-jets-1.1429492", "ord_in_thread": 0, "title": "Devils drop opener, 3-1, to Jets - Sports", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Buy this photo ASSOCIATED PRESS Jets’ Andrew Ladd, center, getting congratulated by teammates after scoring a second-period goal against Devils. NEWARK – The new era of Devils hockey opened with a fizzle.\nDespite their hopes to prove their doubters wrong, the Devils only gave those who picked them to miss the playoffs for the fourth consecutive season more fuel with a 3-1 season-opening loss to the Winnipeg Jets on Friday night at Prudential Center.\nThe Jets got second-period goals from Mark Scheifele, Blake Wheeler and Andrew Ladd and goaltender Michael Hutchinson had a relatively easy first two periods before finishing with 20 saves.\nIn fact, the Devils’ only goal – a second-period power-play tally from Jiri Tlusty – was actually accidentally fired into the net by Jets defenseman Jacob Trouba.\nThe reality is this Devils team is going to be a work in progress after a dramatic summer of organizational changes and the disappointing opening-night crowd of 14,579 seemed to indicate the fans recognize that.\nGone is longtime team president and GM Lou Lamoriello, who is now running the Toronto Maple Leafs. Ray Shero is the new GM and he brought in John Hynes, the league’s youngest head coach at age 40.\nHynes’ first NHL game probably wasn’t what he envisioned as his team managed only 11 shots on goal over the first 40 minutes.\nShero’s stated objective is to make this team younger and faster and there were seven new players on the opening-night roster, but it was still thin on scoring forwards.\nThe Devils watched on television as other teams, including the Jets (6-2 winners Thursday night in Boston), already started their regular seasons. It had been a long summer after they missed the playoffs in 2014-15 for the third consecutive season and they were understandably anxious to finally play a game that counted.\n“Hockey’s been on the last two nights and it hasn’t been us,” goaltender Cory Schneider said. “I think we’re all eager to get out there and try to execute what we’ve been working on in camp and practice.”\nThe Devils got off to a decent start, registering the first three shots on goal, but hardly had the puck after that as the Jets outshot them, 12-1, over the final 17:02 of the period. In fact, the Devils did not register a shot on  Hutchinson over the final 10:45 of the period.\nSchneider kept them in the game, though, stopping everything the Jets threw at him in the opening frame.\nThe Jets received the first power play of the night when defenseman Jon Merrill was sent off for tripping Alexander Burmistrov at 9:49. The Devils killed that off with Schneider making a pair of saves. The Jets went on the power play again with 1:12 left in the opening period when Mike Cammalleri tripped Trouba in the offensive zone. Schneider made two more saves before the end of the period to keep the score 0-0.\nThe Devils survived the remainder of Cammalleri’s penalty to open the second period, but still fell behind, 1-0, on Scheifele’s even-strength goal at 1:13.\nScheifele took a drop pass from rookie Nikolaj Ehlers on the rush and ripped a left-circle shot over Schneider’s right shoulder and in off the cross bar.\nWheeler made it 2-0 at 3:56, ripping another left-circle shot that beat Schneider high to the glove side for his second goal of the season.\nThe Devils still had only eight shots on goal midway through the second, but kept plugging away and got their first power play of the game when Tyler Myers was called for interfering with Adam Henrique at 12:08. With the help of a fortunate bounce, the Devils cut the Jets’ lead in half with a power-play goal credited to Tlusty at 12:53.\nAfter taking a pass from Cammalleri below the right circle, the former Jet Tlusty took the puck to the net and threw a backhand in front that Trouba accidentally fired into his own net.\nThe Devils proceeded to give that gift back, though, starting with Reid Boucher’s delay-of-game penalty for clearing the puck over the glass at 15:21.\nLadd put the Jets back up by two on a one-timer from the right circle for the power-play goal with 3:39 left in the second.\nEmail: gulitti@northjersey.com", "external_links": [], "published": "2015-10-10T01:06:00.000+03:00", "crawled": "2015-10-10T05:27:43.982+03:00", "highlightTitle": ""}