{"organizations": ["Falcons"], "uuid": "2331781f26dea524d903fe2ae03f108542fc20ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chillicothegazette.com", "main_image": "http://www.gannett-cdn.com/-mm-/9dbe3204f152dfb290e8def85e6126868bbca56d/c=0-0-679-384&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/14/OHGroup/Chillicothe/635804195299775808-635761290357234865-16-CGO-0826-GSOC-MINFORD-SOUTHEASTERN.JPG", "site_section": "http://rssfeeds.chillicothegazette.com/chillicothe/highschoolsports", "section_title": "Chillicothe - HIgh School Sports", "url": "http://www.chillicothegazette.com/story/sports/high-school/2015/10/14/behind-mittens-panthers-primed-tourney-success/73910808/", "country": "US", "title": "Behind Mittens, Southeastern primed for tourney success", "performance_score": 0, "site": "chillicothegazette.com", "participants_count": 0, "title_full": "Behind Mittens, Southeastern primed for tourney success", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T04:05:00.000+03:00", "replies_count": 0, "uuid": "2331781f26dea524d903fe2ae03f108542fc20ce"}, "author": "", "url": "http://www.chillicothegazette.com/story/sports/high-school/2015/10/14/behind-mittens-panthers-primed-tourney-success/73910808/", "ord_in_thread": 0, "title": "Behind Mittens, Southeastern primed for tourney success", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Elise", "Derrick Webb", "McKinley Mitten", "Minford"], "text": "Behind Mittens, Southeastern primed for tourney success Derrick Webb , Reporter 9:05 p.m. EDT October 14, 2015 Buy Photo Southeastern's McKinley Mitten drives the ball downfield against Minford, earlier this season. The Panthers and Falcons, who tied 2-2 in their first meeting, will meet again in a Division III sectional semifinal, Oct. 20. (Photo: Elise Manahan/Gazette) Buy Photo Story Highlights Kali and McKinley Mitten have been pillars of Southeastern's girls soccer program since its start. The Mitten sisters not only play well together on the field but are close off it as well. While both are in the lineup, Southeastern possesses two of the best scoring threats in the area. 73 CONNECT 3 TWEET LINKEDIN COMMENT EMAIL MORE \nCHILLICOTHE — Since the start of Southeastern's girls soccer program in 2014, the Panthers have seen nothing but progression. \nUnder head coach Allison Nagle, Southeastern has put together an overall record of 15-8-3 — an accomplishment that is especially significant considering the birth of the program was just two years ago. \nTwo of the main reasons for that early success comes in the form of two sisters, Kali and McKinley Mitten. \nKali, a junior, has led the team in goals over the past two years and McKinley, a sophomore, is not far behind. When both are on the field, the Panthers have two of the best scoring threats in the area. \n\"We've played soccer for about 10 years together now,\" Kali said. \"And we played select soccer for a few of those years so that helps us out a lot. We just kind of decided we wanted to go out around the second grade and we've just stuck with it ever since.\" \nThe Panthers are grateful for that decision. \nKali has a knack for finding the back of the net no matter the situation while McKinley wears down the opposing defense with speed and intelligence. The two have combined to lead Southeastern to a 10-3-2 record in 2015 with wins coming over Logan Elm, West Union and Northwest. \n\"We've gotten a lot more experience on the team this year than we did last year,\" McKinley said. \"That matters a lot. But I love the people that we play with. That's what makes soccer my favorite sport.\" \nTheir most recent victory came 7-0 against Portsmouth West. In that contest, Kali scored four times and dished out two assists. \n\"I couldn't do what I do without Kali on my team,\" McKinley said of her older sister. \"I feel like I need her there with me. Her foot skills are a lot better than mine are. There's not really any type of rivalry between us either. If she scores, it's just as good as if I scored. But she's better at scoring than I am so I give her the ball so she can do what she does.\" \nThat type of outlook has also translated into a tight relationship off the field between the two. \n\"We're pretty close,\" Kali said. \"We're basically best friends. We practice a lot together but also just hang out. We're always there for each other. We push each other to be the best we can be but we do it in a positive way.\" \nThat may have something to do with the way they were raised. Kali and McKinley's dad, Chad, swallowed all the knowledge he could on soccer to give his girls a leg up. \n\"My dad has been there since we started playing,\" Kali said. \"He learned the rules of soccer and helped us out by coaching us all the way through junior high. So he's had a big impact on our soccer careers. He keeps us focused and reminds us of what we need to do.\" \nKali and McKinley — paired with the likes of Audrie Wheeler, Mandy Morris, Hunter Adams and Grace Throne — have transformed the Panthers into a force to be reckoned with. Southeastern was awarded a No. 5 seed in the Division III Southeast District tournament bracket and will be traveling to Minford with a chance to come back with the program's first ever sectional title. \nA win against Minford would propel the Panthers into a district semifinal, likely against top-seeded Lynchburg-Clay. \n\"It's definitely a goal of ours,\" Kali said. \"I expect us to pull together as a team. But we've got some things we need to work on first. We need to get better with our passing, because we struggle with that a lot sometimes, and we just need to be real positive towards each other.\" \nMcKinley echoed those statements. \n\"I think we could win the sectional title for sure,\" McKinley said. \"We've came a long way since last year and we have worked hard to get where we are.\" \nSoutheastern's chance will come, at 6 p.m. Oct. 20 against the Falcons. \ndwebb@chillicothegazette.com 73 CONNECT 3 TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http://ohne.ws/1LtY7nS TOP VIDEOS", "external_links": [], "published": "2015-10-15T04:05:00.000+03:00", "crawled": "2015-10-15T13:36:33.163+03:00", "highlightTitle": ""}