{"organizations": ["Steelers"], "uuid": "fc6de6d80d9dd0b163bf138bb97ee50b96b93a34", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kcra.com", "main_image": "http://www.kcra.com/image/view/-/33229344/highRes/2/-/maxh/630/maxw/1200/-/82d0dp/-/Ben-Roethlisberger--Pittsburgh-Steelers-jpg.jpg", "site_section": "http://www.kcra.com/11798354?format=rss_2.0&view=feed", "section_title": "Sports News", "url": "http://www.kcra.com/sports/steelers-qb-roethlisberger-plans-to-play-this-week/35919298", "country": "US", "title": "Steelers QB Roethlisberger plans to play this week", "performance_score": 0, "site": "kcra.com", "participants_count": 0, "title_full": "Steelers QB Roethlisberger plans to play this week", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T00:12:00.000+03:00", "replies_count": 0, "uuid": "fc6de6d80d9dd0b163bf138bb97ee50b96b93a34"}, "author": "", "url": "http://www.kcra.com/sports/steelers-qb-roethlisberger-plans-to-play-this-week/35919298", "ord_in_thread": 0, "title": "Steelers QB Roethlisberger plans to play this week", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Justin K.", "Roethlisberger"], "text": "Steelers QB Roethlisberger plans to play this week Roethlisberger has missed last three games with knee injury UPDATED 2:12 PM PDT Oct 19, 2015 Photos Justin K. Aller/Getty Images \nPittsburgh Steelers quarterback Ben Roethlisberger, after missing the last three games with a knee injury, plans be a full participant at practice this week and play against the Kansas City Chiefs. Cubs' Maddon preaches patience \n\"We're going to tape it and brace it and I'm going to see what I can do,\" Roethlisberger said Sunday after the Steelers beat the Arizona Cardinals 25-13 at Heinz Field. \"My plan is to go out Wednesday and practice. We'll see what happens. I know I've got to be smart about it. I've got to be able to defend myself. We're just going to take it day by day.\" \nMichael Vick started with Roethlisberger out but left Sunday's game with a hamstring injury. On Monday, Vick said he had a \"tiny tear\" in the hamstring. \nRoethlisberger went down against the St. Louis Rams in Week 3 on Sept. 27 with a sprained MCL and bone bruise in his left knee. He was limited in practice last week, which provided a glimmer of hope he might be able to return against the Cardinals. \nWhen Roethlisberger was initially injured, the projection was that he would miss four to six weeks. The game at Kansas City on Sunday will be four weeks after his injury. \nThird-string quarterback Landry Jones entered when Vick exited Sunday's game early in the third quarter with a hamstring injury and delivered four second-half scoring drives to lead the Steelers to a win over the Cardinals. The Steelers, now 4-2, are 2-1 during Big Ben's absence. \nAfter Vick completed only 3 of 8 passes for 6 yards, he was replaced by Jones, who was 8-for-12 for 168 yards and two touchdowns, including an 88-yard pass to Martavis Bryant with 1:58 remaining that put the game out of reach.", "external_links": [], "published": "2015-10-20T00:12:00.000+03:00", "crawled": "2015-10-20T00:51:34.813+03:00", "highlightTitle": ""}