{"organizations": [], "uuid": "77c2ae504b89839f727f7c60554198ea29be1641", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mailtribune.com", "main_image": "http://www.mailtribune.com/storyimage/MM/20150930/SPORTS/150939956/AR/0/AR-150939956.jpg", "site_section": "http://www.mailtribune.com/sports?template=rss&mime=xml", "section_title": "Sports - MailTribune.com", "url": "http://www.mailtribune.com/article/20150930/SPORTS/150939956/101039/SPORTS?rssfeed=true", "country": "US", "title": "Buffs feel they’re gaining on Ducks", "performance_score": 0, "site": "mailtribune.com", "participants_count": 1, "title_full": "Buffs feel they’re gaining on Ducks", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T01:49:00.000+03:00", "replies_count": 0, "uuid": "77c2ae504b89839f727f7c60554198ea29be1641"}, "author": "Steve Mims Eugene Register-Guard", "url": "http://www.mailtribune.com/article/20150930/SPORTS/150939956/101039/SPORTS?rssfeed=true", "ord_in_thread": 0, "title": "Buffs feel they’re gaining on Ducks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Sep. 30, 2015 at 5:49 PM By Steve Mims Posted Sep. 30, 2015 at 5:49 PM » Social News EUGENE — Mike MacIntyre has seen consistent improvement since arriving as coach at Colorado in 2013. “Our second year, that team was 20 points better than our first year,” MacIntyre said. “This year is 20 points better than last year. Now we have to prove it in games.” Those improvements still would not have been enough for the Buffs to beat Oregon in either of the past two seasons. Oregon defeated Colorado 57-16 in Boulder in 2013 and 44-10 last year at Autzen Stadium. In Colorado’s first two years in the Pac-12 under Jon Embree, Oregon defeated Colorado 45-2 and 70-14. Add it up and the Ducks have outscored the Buffaloes 216-42 as conference foes for an average margin of victory of 43.5 points per game heading into their meeting at 7 p.m. Saturday night at Folsom Field. Yet with Colorado at 3-1, its best start since 2010, and the 2-2 Ducks off to their worst start since 2004, the betting line is down to 71/2 points for the favored Ducks with a sense that the Buffaloes may be closing the gap. “I sure hope we are, and I definitely think we are, but we will find out Saturday,” MacIntyre said Tuesday morning. “Most people have not been close to them either the last few years in our conference. Only a few teams have been. I think we need to hopefully do that, and I believe we can.” Saturday marks the Pac-12 opener for the Buffs, who have lost 11 consecutive conference games. CU is 1-17 in two years of Pac-12 games under MacIntyre, with the lone victory coming in 2013 over a California team that did not win a conference game. “I think this team has really grown,” MacIntyre said. “It is a more mature team. We have more depth. We played Nicholls without seven starters and we couldn’t beat anyone with seven starters out during our first year.” Colorado is 4-32 in Pac-12 play since joining the conference in 2011 and has not finished at .500 in conference play since it went 4-4 in the Big 12 in 2007, when current Oregon coach Mark Helfrich was the team’s offensive coordinator. “They’re playing with a ton of confidence,” said Helfrich, who is preparing to visit Colorado for the third time since leaving to join Chip Kelly’s staff in 2009. “The way things have set up for them, they’re absolutely riding high on offense, on defense, on special teams. They played really well last week, created a ton of turnovers, and you can see the confidence is building.” After opening with a 28-20 loss at Hawaii, Colorado beat Massachusetts 48-14, Colorado State 27-24 in overtime, and Nicholls State 48-0, giving the Buffaloes their first three-game winning streak since 2008. The Buffs average 35.8 points per game, their most through four games in 16 years, and are coming off their first shutout since 2009. “We went to Hawaii and shot ourselves in the foot and didn’t play like we knew we could,” MacIntyre said. “Then I saw these guys regroup and start to believe in themselves. We were good against UMass and came from behind for a good win against Colorado State and then did what we should against Nicholls. We finished teams off and won a game in dramatic fashion, which we did not do last year.” The Ducks are coming off a 62-20 loss to Utah, a score that looked like one of Oregon’s against Colorado in recent seasons. “Oregon is really, really fast and athletic, an excellent football team,” MacIntyre said. “I know they had a hard game against Utah, but Utah had some dramatic plays on special teams that turned the tide, and they’re a good, mature football team. I think Oregon is really, really good.” By Steve Mims", "external_links": [], "published": "2015-10-01T01:49:00.000+03:00", "crawled": "2015-10-01T04:20:29.436+03:00", "highlightTitle": ""}