{"organizations": [], "uuid": "7093b9273f841538d97730ee4f1d1a73e5f7a507", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "mndaily.com", "main_image": "http://mndaily.com/sites/default/files/images/photos/2015/10/14/101515stmk1015p-01.jpg", "site_section": "http://www.mndaily.com//rss/sports", "section_title": "Sports", "url": "http://mndaily.com/sports/mens-hockey/2015/10/15/reilly-returns-ice-minnesota", "country": "US", "title": "Reilly returns to the ice for Minnesota", "performance_score": 0, "site": "mndaily.com", "participants_count": 1, "title_full": "Reilly returns to the ice for Minnesota", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T16:45:00.000+03:00", "replies_count": 0, "uuid": "7093b9273f841538d97730ee4f1d1a73e5f7a507"}, "author": "jthomas@mndaily.com", "url": "http://mndaily.com/sports/mens-hockey/2015/10/15/reilly-returns-ice-minnesota", "ord_in_thread": 0, "title": "Reilly returns to the ice for Minnesota", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Reilly returns to the ice for Minnesota Connor Reilly had knee surgery in the spring for the third time in his career. Gophers forward Connor Reilly races the puck down the ice at Mariucci Arena, Jan. 16, 2015. By Alex Tuthill-Preus, Daily File Photo By Redshirt junior forward Connor Reilly’s knees have never been kind to him. Reilly had 11 goals in 24 games in the middle of last year’s season, but he was sidelined for the rest of the season after a knee-to-knee hit in a game against the University of Wisconsin-Madison. Reilly had knee surgery for the third time in his hockey career after the hit, but he was back on the ice for the Gophers season opener. Against the University of Vermont Saturday , Reilly skated in a game with the Gophers for the first time since his injury, and he said he’s never felt better. “[It’s] probably the best I’ve felt since I’ve been here in the past three years,” Reilly said. “Just speed-wise, stamina, I’m feeling really good.” Reilly’s first knee surgery came when he was still playing junior hockey, and another caused him to redshirt his first year on campus. But despite the setbacks, head coach Don Lucia said Reilly’s skating on Saturday looked better than it had before. “I think his skating looks better right now than at any point in time he’s been here,” Lucia said. “I think he came back really nicely from his injury.” In the 3-0 loss to Vermont, Reilly had four shots on goal and one blocked shot. “I had a couple chances, couple shots but missed wide a few,” Reilly said. “Two on one, I put [the puck] a foot over the net. Not going to like that very much.” Besides the missed shots, Reilly said he feels he needs to get his feet moving more. He said it was also an adjustment for him to just be back on the ice. “The first period was kind of weird,” Reilly said. “[It] didn’t feel like it was real. It was definitely exciting. I know for me personally, it was about seven months since I was out there. It was good to be back out there with my teammates.” When Reilly came back for Minnesota against Vermont this Saturday , he was playing with a very different team than last year. The team played six freshmen against Vermont. Last year, the Gophers had six seniors graduate and three players sign professional contracts, including Reilly’s younger brother, Mike. “We’ve had significant lineup changes, so there’s definitely going to be the way guys respond,” Reilly said. “The way who’s playing with who, the chemistry, the cohesiveness.” Lucia said Reilly worked hard over the summer and seems to be back to full strength. “I know he worked really hard on that over the course of the summer, on his skating and on his strength,” Lucia said. “I think he’s done a really nice job with his rehab. Hopefully, he can have an injury-free year because if anybody’s earned it, he has.”", "external_links": [], "published": "2015-10-15T16:45:00.000+03:00", "crawled": "2015-10-15T18:28:31.114+03:00", "highlightTitle": ""}