{"organizations": [], "uuid": "7e17b1c8e000e51a3010c2ef0839906b2f0981a5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.desmoinesregister.com", "main_image": "http://www.gannett-cdn.com/-mm-/725268e2682907ae568088802877ae1dd07acbf1/c=0-0-3198-1807&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/07/IAGroup/DesMoines/635798351222728277-Patrick-Mahomes.jpg", "site_section": "http://www.desmoinesregister.com/sports/", "section_title": "Sports | The Des Moines Register | DesMoinesRegister.com", "url": "http://www.desmoinesregister.com/story/sports/college/iowa-state/randy-peterson/2015/10/08/peterson-cyclones-air-raid-phase-their-schedule/73540928/", "country": "US", "title": "Peterson: Cyclones are in the Air Raid phase of their schedule", "performance_score": 0, "site": "desmoinesregister.com", "participants_count": 1, "title_full": "Peterson: Cyclones are in the Air Raid phase of their schedule", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T23:04:00.000+03:00", "replies_count": 0, "uuid": "7e17b1c8e000e51a3010c2ef0839906b2f0981a5"}, "author": "desmoinesregister.com", "url": "http://www.desmoinesregister.com/story/sports/college/iowa-state/randy-peterson/2015/10/08/peterson-cyclones-air-raid-phase-their-schedule/73540928/", "ord_in_thread": 0, "title": "Peterson: Cyclones are in the Air Raid phase of their schedule", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Texas Tech quarterback Patrick Mahomes (5) throws to wide receiver Cameron Batson on Oct. 2. (Photo: Jerome Miron/USA TODAY Sports)\n24 CONNECT TWEET LINKEDIN COMMENT EMAIL MORE AMES, Ia. — Google it: c ollege football air raid offense .\nMore than 25,000 results show up, which begs the question:\nJust which teams don’t run the type of offense Iowa State will face the next three Saturdays?\nCertainly not Texas Tech, this Saturday’s 2:30 p.m. opponent in Lubbock. TCU a week later in Ames? Nope.\nBaylor? Guess again — you haven’t been following Art Briles’ team for a while.\nFor Iowa State, it’s bombs away — and then some.\n“You have to try to leverage those teams as best as possible with all your defenders against all their weapons,” coach Paul Rhoads said. “Texas Tech is going to take advantage of the entire field — vertically, horizontally, they’re excellent in their screen game, and they’re running the ball effectively.”\nWhen the Cyclones decided to go exclusively to the 3-man defensive front, it was with this in mind:\nTo shoot from the air these pass-happy offenses before they have a chance to strike.\n“This is one of the reasons we went to it,” Rhoads said. “Every coach, every player likes a challenge, and this will be a great one.”\nHere’s the not-so-top-secret manuals of three Air Raid teams in a row the Cyclones face, starting Saturday.\nRandy Peterson and Tommy Birch discuss this week's Texas Tech game.\nTexas Tech\nTop Gun: Patrick Mahomes’ 367.2 passing yards a game is fourth nationally, and first among Power Five quarterbacks. He’s third with an average of 408.0 total yards, and that includes about 40 rushing yards a game.\nIf he’s not shooting down opponents with his arm, he’s doing it with a ground assault, and it’s that shiftiness that makes him a tough bombardier to detect.\nStrategic targets: Jakeem Grant gets 13.7 yards per reception, but that’s nothing compared to Devin Lauderdale’s 20.2 yards per catch. They’re both a bit banged up right now, so how that affects Mahomes’ effectiveness — stay tuned.\nHistory of strikes: The Red Raiders have eight passing plays of 50 yards or more. Of 34 scoring drives, 16 have been less than 2 minutes, and seven were under a minute.\n“Look at their tapes, it’s always the spread, it’s always the quarterback, it’s always the receivers,” defensive coordinator Wally Burnham said. “And they can run the ball, too.”\nTCU\nTop Gun: Seated comfortably adjacent to the Horned Frogs’ launch button is none other than Trevone Boykin, some voters’ pick right now to win the Heisman Trophy.\nHe’ll probably be a receiver next season when he gets to the pros, but currently, Boykin is quarterbacking one of the most strategic offenses in college football, leading TCU to an average of 50.8 points a game, and just who is No. 1?\nMore about that air strike shortly.\nSince performing just average in the season opener against Minnesota, Boykin has thrown for 1,556 yards and 18 touchdowns against just two interceptions. Against Iowa State last season, he passed for 460 yards and four touchdowns, he was on the catching end of a 55-yard passing play, and he rushed for four touchdowns.\nThe problem isn’t only stopping this master of attack, it’s finding him.\n“Everybody said that Trevone may be a little bit overrated, well, you just need to start watching ball games,” TCU coach Gary Patterson said recently,\nOver-rated?\nWhatever.\nStrategic target: Receiver Josh Doctson (yes, the guy with the game-winning catch against Texas Tech) ranks second in the nation with 722 yards receiving, and he has eight touchdown catches.\nHe had 18 catches for 267 yards and three touchdowns against the Red Raiders this season, becoming the first TCU player with at least 10 catches in a game since, ahem, Boykin had 11 against West Virginia in 2013\nHistory of strikes: The Horned Frogs are tied with USC for the nation’s longest active streak of first-quarter touchdowns, at 18 games, but that’s just part of the team’s direct-hit log. Six passing plays have traveled 50 or more yards.\nBaylor\nTop Gun: Just when you’re thinking the Bears had no one to sit in the command seat, along comes Seth Russell. He averages 320.3 passing yards a game, and if that’s not enough to make defensive coaches take notice, how about this:\nHe has thrown 19 touchdown passes and just five interceptions.\n\"He's been really sharp, I mean really sharp,\" Briles said.\nStrategic targets: Corey Coleman and K.D. Cannon each have 1,000 receiving yards for their careers — and they’re part of the reason this is Wide Receiver U.\nHistory of strikes: Baylor leads the nation with an average of .80 points per play, with 11 touchdown drives of less than a minute, and with a 60-point scoring average.\nThe Bears have six passing plays of 50 yards or more, including an 87-yarder.\nNeed more? In the first four minutes against Texas Tech, Baylor had 160 yards and 14 points.\n“It’s an insane game,” Briles told reporters. “It’s just kind of the way it’s been the last four or five years. You can’t breathe for half a second. The pedal is all the way down.\n“If you had any hair it’s blowing backward and you are just screaming the whole time.”\nPlan for strategic excellence\nWhile everyone thinks it’s all about the quarterback and receivers — and that’s a large part of these offenses that are with us to stay — it’s also a product of shabby tackling.\n“You can’t afford to miss even one tackle playing against those offenses,” Cyclones defensive end Dale Pierson said. “Those guys catching the passes are quick.”\nAnd elusive. They block downfield for each other. They create separation.\nAnd then they strike.\nCyclone sports columnist Randy Peterson has been reporting on ISU during the past five decades. Follow @RandyPete.\nIowa State (2-2, 1-0) at Texas Tech (3-2, 0-2)\nWhen, where: 2:30 p.m. Saturday, Jones AT&T Stadium, Lubbock, Texas\nTV: FSN\n24 CONNECT TWEET LINKEDIN //dmreg.co/1LkswVN", "external_links": ["http://bcdownload.gannett.edgesuite.net/desmoines/35546125001/201510/3767/35546125001_4536326608001_4536211373001-vs.jpg?pubId=35546125001", "http://www.gannett-cdn.com/-mm-/b9f3af046d3559042b45273640a0a388e620942e/c=134-0-2966-2129&r=x404&c=534x401/local/-/media/2015/10/07/IAGroup/DesMoines/635798351222728277-Patrick-Mahomes.jpg", "http://dmreg.co/1RslaQS", "https://twitter.com/intent/tweet?url=http%3A//dmreg.co/1LkswVN&text=Peterson%3A%20Cyclones%20are%20in%20the%20Air%20Raid%20phase%20of%20their%20schedule&via=DMRegister", "http://bcdownload.gannett.edgesuite.net/desmoines/35546125001/201510/3767/35546125001_4536326608001_4536211373001-vs.jpg", "http://bcdownload.gannett.edgesuite.net/desmoines/35546125001/201510/3767/35546125001_4536326614001_4536211373001-th.jpg?pubId=35546125001", "http://www.linkedin.com/shareArticle?url=http%3A//dmreg.co/1LkswVN&mini=true", "http://dmreg.co/1LkswVN", "http://www.gannett-cdn.com/-mm-/8bb65a5d1bb033fb967b0c8b034dc8809a877a82/r=540&c=540x304/http/bcdownload.gannett.edgesuite.net/desmoines/35546125001/201510/3767/35546125001_4536326608001_4536211373001-vs.jpg"], "published": "2015-10-08T23:04:00.000+03:00", "crawled": "2015-10-09T04:19:21.435+03:00", "highlightTitle": ""}