{"organizations": [], "uuid": "b7abe8754893a08c19181aa4a1264397d18b7f8b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.philly.com", "main_image": "http://media.philly.com/images/KellyMagnussenFrankTagye.jpg", "site_section": "http://www.philly.com/", "section_title": "Philadelphia local news, sports, jobs, cars, homes - Philly.com", "url": "http://www.philly.com/philly/entertainment/sunday/20151011_Love__LOVE__KELLY_MAGNUSSEN___FRANK_TAGYE.html", "country": "US", "title": "Love: Kelly Magnussen & Frank Tagye", "performance_score": 0, "site": "philly.com", "participants_count": 1, "title_full": "Love: Kelly Magnussen & Frank Tagye", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "b7abe8754893a08c19181aa4a1264397d18b7f8b"}, "author": "Kellie Patrick Gates,", "url": "http://www.philly.com/philly/entertainment/sunday/20151011_Love__LOVE__KELLY_MAGNUSSEN___FRANK_TAGYE.html", "ord_in_thread": 0, "title": "Love: Kelly Magnussen & Frank Tagye", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Living in Connecticut with her boyfriend since college, Kelly thought her life was pretty much set. Then in 2008, she walked in and found undeniable evidence her relationship was over. Kelly moved back home to forge a new plan. Having fallen for Philadelphia while visiting a friend, she began a targeted job search. By summer 2009, she was living in the city, working at Cigna as a sales strategist, and enjoying her new life.\nFrank grew up in Delran but moved to Atlanta in 2002 and got married about five years later. When the marriage ended in 2011, Frank moved back to New Jersey. One Saturday in February 2012, he and the guys headed to Philadelphia. \"With me being newly single and hitting the city for one of the first times after coming back from Atlanta, I wanted to go to a fun neighborhood,\" said Frank, who now works in sales for Renew Digital.\nIt was Kelly's 30th birthday, and friends, her parents, and other family members from New York, Connecticut, and D.C. surprised her with a party at a now-defunct gastropub. Afterward, Kelly and company spilled out of the pub onto the sidewalk, and they commingled with an equally joyous group of guys that included Frank.\nBy the time they'd walked a block, Kelly and her girlfriends decided not only to keep the party going at friend Leslie's house, but also to invite this friendly group of guys. Everyone had fun, and Frank's friend Dan got Kelly's phone number so the two groups could meet up again.\nIn early March 2012, Frank, who is now 36, moved to Logan Square. That's when Dan remembered that Kelly, now 33, lived in the same neighborhood. Frank said he should invite the women they had met the week before to his housewarming.\n\"We were doing our own thing that night but figured we'd stop in,\" Kelly said. They stayed the whole time. Kelly is a little bit introverted, but she enjoys being entertained by an extrovert like Frank. He was the life of his own party, and she was cracking up through much of it.\nAfterward, everyone hit the town together. \"He grabbed my hand as we walked, and I looked up at him, and I had this feeling, 'This guy is going to be in my life,' \" she said.\nSoon after, the couple went on their first real date at Village Whiskey. \"When you meet a woman who wants to eat cheeseburgers and do shots and has a great time doing it with you, how do you not fall in love?\" Frank asks. \"This is the kind of place where I would have an amazing time with the guys, and here I am with someone who is not only fun to look at, but funny, smart, everything.\"\nFrank said he moved into the city thinking he'd have fun and enjoy being single, but \"then I met Kelly, and I didn't want to be single one more minute.\"\nHow does forever sound? In March 2014, Kelly's lease expired, and she moved in with Frank. Shortly after, a mutual friend gave Kelly a tip: Frank was gearing up to propose.\n\"Since then, anytime we went on a vacation, a weekend trip, out to a nice dinner, I always thought, 'This could be the time,' \" Kelly said. She dressed up way more than usual and waited. For nine months.\nThe weekend before Christmas, Frank told Kelly they were meeting his brother and sister for lunch at the Water Works. It was a cold and snowy but beautiful day, and as they walked on the path near the Schuylkill, Frank was feeling very pleased with his plan. Then he noticed Kelly looking off in the distance.\n\"Who's that guy in the corner?\" she asked with concern in her voice. \"I think he's taking our picture.\"\nFrank, panicked, tried to think of some reasonable, calming explanation.\n\"Go get him,\" Kelly said. \"He's a creep!\"\n\"Will you marry me?\" Frank asked.\nEven when he offered her the ring, it took Kelly's brain a second to realize she did not need to worry about the cameraman, Philadelphia photographer Chris Byrne, a friend of Frank's who was there to document her response to this very important question.\n\"Yes!\" she said after a few beats.\nFrank did have a bottle of champagne and reservations at the Water Works, but the couple decided to cancel and instead invite their friends to watch the game with them at McGillin's.\nIt was so them Everyone met at the couple's home for preceremony pictures. Before the first shot was taken, the couple opened that bottle of champagne Frank had been saving since the proposal.\nThe groom walked down the aisle at Tendenza to an instrumental version of Pearl Jam's \"Just Breathe.\" When her turn came, the bride walked to an instrumental \"Somewhere Over the Rainbow,\" trying hard not to ugly-cry.\nFrank's brother-in-law Paul - a.k.a. Jaxon, a DJ for WMMR - used his great pipes to lead the nondenominational ceremony. Frank's sister Michele read lines from the Ben Folds song \"The Luckiest,\" and Kelly's sister-in-law Heather read a piece on destiny, reminding everyone that it works at its own pace.\nThe couple exchanged their vows in front of a seven-foot-high flower wall that Kelly and her mom made by hot-gluing silk peonies over an Elvis-print room divider.\nAwestruck After the ceremony, the couple's guests showered them with hundreds of quarter-size, craft-store pom-poms. In the middle of their cheers and the colorful rain, Kelly thought, \"We did this. It's a done deal. We're together forever.\"\nAs the reception wound down, their photographer asked the couple to follow him outside for one last shot. Down the steps and through the night they walked, reminding Frank so profoundly of another evening walk after that first date at Village Whiskey. \"Back then, I looked up at the moon and thought, 'I cannot believe I have been able to find somebody this incredible,' \" Frank said. \"And there we were on our wedding night, in full-on tuxedo and gown, and I thought, 'I can't believe we're this happy, we're this lucky, to be together.' \"\nDiscretionary spending A bargain: The couple estimate they saved 20 percent of the reception costs by marrying on Sunday instead of Saturday.\nThe splurge: Kelly had two dresses: a fancier mermaid-style with \"an unnecessary amount of layers\" and a simpler, more dance-friendly dress for the reception. She has zero regrets.\nThe getaway: Two weeks in Thailand.", "external_links": [], "published": "2015-10-11T03:00:00.000+03:00", "crawled": "2015-10-10T12:19:37.813+03:00", "highlightTitle": ""}