{"organizations": ["Cubs", "St. Louis Cardinals", "LAS VEGAS", "Dodgers", "Mets", "Chicago Cubs", "Las Vegas Cubs"], "uuid": "1e8db1257321b8b87944f24330b8d0e86f94e3b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news3lv.com", "main_image": "http://www.news3lv.com/media/lib/166/9/6/8/968f0221-e88c-4979-a3dd-d2d8d4617db2/Original.jpg", "site_section": "http://www.mynews3.com/rss/3315.rss", "section_title": "Local Sports", "url": "http://www.news3lv.com/content/sports/story/Las-Vegas-Cubs-fans-rejoice-after-Cardinals-sweep/46tBfBd8Ik6NvOa8cXh7TQ.cspx?rss=3315", "country": "US", "title": "Las Vegas Cubs fans rejoice after victory over Cardinals", "performance_score": 0, "site": "news3lv.com", "participants_count": 0, "title_full": "Las Vegas Cubs fans rejoice after victory over Cardinals", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T02:59:00.000+03:00", "replies_count": 0, "uuid": "1e8db1257321b8b87944f24330b8d0e86f94e3b2"}, "author": "", "url": "http://www.news3lv.com/content/sports/story/Las-Vegas-Cubs-fans-rejoice-after-Cardinals-sweep/46tBfBd8Ik6NvOa8cXh7TQ.cspx?rss=3315", "ord_in_thread": 0, "title": "Las Vegas Cubs fans rejoice after victory over Cardinals", "locations": ["Las Vegas", "Chicago"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tim Korney", "Kusper", "David Kusper", "Kozar", "Baseball Joe", "Marty McFly", "Joe Kozar.Kozar"], "text": "Share Updated: 10/14 5:53 pm LAS VEGAS (KSNV News3LV) – Chicago Cubs fans in Las Vegas are rejoicing after their team beat the St. Louis Cardinals to advance one step closer to the World Series. The Cubs haven't seen a World Series victory since 1908.This year betting on the Cubs is even bigger business especially because of the movie, ‘Back to the Future Part 2’. In the film, Marty McFly finds out the Cubs win the World Series in 2015. Of course, bettors are hitting the books and placing that bet, but for fans it's not really about the money.\"I was crying. Just emotional you know what I mean. It's just the fact you're going to be there,\" said die-hard Cubs fan Joe Kozar.Kozar, 68, has been a fan for the past 64 years. His friends know him as Baseball Joe, the Cubs guy. He says it's already a victory for his Cubs to be in the National League Championship Series.\"It's like a dream come true. I could die tomorrow, and I could care less,\" Kozar said.We met him at Windy City Beefs and Pizza. Tim Korney opened the store five years ago. The Chicago native says this is the year.\"In my heart, I honestly believe the Cubs will win the World Series this year,\" Korney said.It's these die-hard fans who have stuck with their team through the 107-year World Series drought.\"I always joke I was born into a life of misery,\" said David Kusper, a Cubs fan. \"People don't understand, they always say I know what it’s like, you don't know what it's like to be a Cubs fan.\"Kusper works at a sports book and says this year they've seen a ton of money on the Cubs to win it all. He says it's because of the Back to the Future hit.\"The Back to the Future angle did bring some more people in and specifically would tell us that's why they're betting it,\" Kusper said.He bet on the Cubs in March and will win $16 for every dollar he wagered. Sports book directors say a Cubs championship would be great for the fans but terrible for their bottom lines. The question is, will all those bets be cashed if the Cubs win it all? Kusper says no.\"I won't cash the ticket. I'll keep it. Keep it at home and put it in a safe. I wouldn't cash it,\" Kusper said.It’s a memory for these fans that's worth much more than money. That's exactly what sports books are hoping for if the Cubs happen to win it all. They hope people will keep those tickets, frame them and never cash them in. The Cubs will play the winners of the series between the Mets and Dodgers. The Cubs will play game one of the NLCS on Saturday.", "external_links": [], "published": "2015-10-15T02:59:00.000+03:00", "crawled": "2015-10-15T11:11:14.029+03:00", "highlightTitle": ""}