{"organizations": [], "uuid": "78d424f7cf73ae72a1236cbdf73bf56248423beb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtontimes.com", "main_image": "http://media.washtimes.com.s3.amazonaws.com/media/image/2015/10/10/b82d09c28fa4742d840f6a7067007e64.jpg", "site_section": "http://feeds.feedburner.com/Sports-TheWashingtonTimesAmericasNewspaper", "section_title": "www.washingtontimes.com stories: Sports", "url": "http://www.washingtontimes.com/news/2015/oct/10/wake-forest-hangs-on-for-3-0-win-over-bc/", "country": "US", "title": "Wake Forest hangs on for 3-0 win over BC", "performance_score": 0, "site": "washingtontimes.com", "participants_count": 1, "title_full": "Wake Forest hangs on for 3-0 win over BC", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T01:58:00.000+03:00", "replies_count": 0, "uuid": "78d424f7cf73ae72a1236cbdf73bf56248423beb"}, "author": "KEN POWTAK", "url": "http://www.washingtontimes.com/news/2015/oct/10/wake-forest-hangs-on-for-3-0-win-over-bc/", "ord_in_thread": 0, "title": "Wake Forest hangs on for 3-0 win over BC", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sports Wake Forest hangs on for 3-0 win over BC Wake Forest quarterback John Wolford (10) looks to pass during the first quarter of an NCAA college football game against Boston College in Boston, Saturday, Oct. 10, 2015. (AP Photo/Michael Dwyer) more > By KEN POWTAK   \nBOSTON (AP) - Mike Weaver kicked a 25-yard field goal after Wake Forest forced a turnover deep in Boston College’s territory in the third quarter, and the Demon Deacons held on for a 3-0 victory Saturday. \nThe win snapped a two-game losing streak for Wake Forest (3-3, 1-2 ACC). The Eagles (3-3, 0-3) have lost three straight. \nThe Eagles had first-and-goal at the 1 with 29 seconds left shortly after Wake Forest quarterback John Wolford fumbled the ball with 56 seconds to play. Boston College’s Tyler Rouse ran for no gain, and Jeff Smith spiked the ball as the clock hit :00. \nAfter a replay review, the referee confirmed the game was over. \nThe Eagles also had a third-and-1 at the Wake Forest 8 with under two minutes left, but Troy Flutie fumbled on a sneak and the ball squirted out of the pile and defensive back Zach Dancel recovered. \nBoston College’s Colton Lichtenberg missed two field goal attempts - from 26 and 31 yards. \nWeaver missed on a 43-yard attempt in the opening half. \nThe Eagles, which piled up easy wins over a pair of FCS schools in their first two games, came in ranked No. 1 among FBS schools with the fewest yards allowed. The Demon Deacons entered the game ranked 20th. \nThe Demon Deacons collected just 142 total yards. Boston College had 269. \nEarly in the third quarter, Wake Forest’s Brandon Chubb recovered Jordan Gowins’ fumble at the Eagles 5. After losing two yards, the Demon Deacons settled for Weaver’s decisive field goal. \nBoston College drove deep into Wake Forest territory, helped by two unsportsmanlike penalties. But Lichtenberg was wide left on his 26-yard attempt and Eagles coach Steve Addazio looked to the sky in disbelief. \nLichtenberg missed his 31-yarder in the final minute of the opening quarter, nailing the right upright. \nIt was only fitting that Wake Forest’s punter Alex Kinal set a conference record for most career yards during a scoreless opening half. \nThe Eagles had consecutive false start penalties before getting whistled for delay of game after their first two offensive plays. \nThe Demon Deacons had only 89 total yards at the half; BC 123. There were nine total punts, five by Wake Forest.", "external_links": [], "published": "2015-10-11T01:58:00.000+03:00", "crawled": "2015-10-11T03:07:28.362+03:00", "highlightTitle": ""}