{"organizations": [], "uuid": "400efd796d508f6fa8ba6d3d210701a4089a8724", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.vindy.com", "main_image": "http://media.vindy.com/content/image/a/5/logo/v5logo.gif", "site_section": "http://www.vindy.com/rss/headlines/sports", "section_title": "Vindy.com stories: Sports", "url": "http://www.vindy.com/news/2015/oct/08/did-timing-of-lindors-call-up-cost-tribe/", "country": "US", "title": "Ridenour: Did timing of Lindor’s call-up cost Tribe?", "performance_score": 0, "site": "vindy.com", "participants_count": 0, "title_full": "Ridenour: Did timing of Lindor’s call-up cost Tribe?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T07:00:00.000+03:00", "replies_count": 0, "uuid": "400efd796d508f6fa8ba6d3d210701a4089a8724"}, "author": "", "url": "http://www.vindy.com/news/2015/oct/08/did-timing-of-lindors-call-up-cost-tribe/", "ord_in_thread": 0, "title": "Ridenour: Did timing of Lindor’s call-up cost Tribe?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Lindor"], "text": "Tweet Published: Thu, October 8, 2015 @ 12:00 a.m. \nI don’t believe that Indians rookie shortstop Francisco Lindor wasn’t ready for his major-league promotion until June 14. \nI don’t believe that it was injury issues or swing mechanics or some other aspect of his game that kept him at Triple-A while the slow-starting Indians dug themselves a hole from which they couldn’t escape. \nEmotions are still raw for Tribe fans with the postseason starting and the Indians finishing 41/2 games out of the second wild-card spot Sunday evening. But I side with those who think finances kept Lindor down on the farm for more than two months and that the Indians cost themselves a chance at the playoffs because of that decision. \nBut I will agree with the Indians in one regard when it comes to Lindor. Their future, and Lindor’s, looks brighter because they waited. \nDown the road, if they can find more run producers to go with their young talent and solid starting pitching, stalling on Lindor to save what SportsIllustrated.com suggested in April could be $10 million might turn out to be the right move. There was no reason to risk putting too much pressure on a 21-year-old who could be the key to perennial playoff contention if he wasn’t mentally ready to handle the game’s inevitable slumps. Especially since the former first-round pick, already the subject of national hype, would be doing it under a microscope even if his team were going nowhere. \nLindor wasn’t going to be the 40-home run guy — at this point, I’d settle for 30 — the Indians still need. He wasn’t going to cure the Indians’ defensive woes by himself, he needed Giovanny Urshela at third base to help him. Lindor wasn’t going to make Corey Kluber regain his Cy Young form or heal Michael Brantley’s aching back or help the Tribe find a fifth starter or persuade the Atlanta Braves to take Nick Swisher and Michael Bourn in trade before Aug. 7. \nI never thought Lindor should have made the team out of spring training. But after a loss to the Minnesota Twins on May 9, the Indians were 10-19 and 81/2 games out of the division lead. The season was already slipping away. From that point until Lindor’s promotion, they lost seven games by two runs or less. A line-drive switch-hitter like Lindor might have made a difference in those seven. \n“It’s fair to look back and wonder what ifs,” said Chris Antonetti, the Indians general manager who was promoted to president of baseball operations on Tuesday. \n“Francisco was still working on a lot of things at the outset of the season and there was some sentiment that it might be too soon to promote him to the major leagues, for him to come up and be successful and contribute to a winning environment.” \nAntonetti wasn’t talking about a certain time period. He probably could think of several. \nBut calling up Lindor before June 14 would have been costly. That would have given Lindor the chance to accumulate enough service time to qualify for Super Two status. Should he have reached it, Lindor would have been eligible for arbitration a year early and a total of four times instead of the usual three. The Indians weren’t the only team who avoided a possible Super Two with their top young prospects, the Houston Astros and Texas Rangers called up players about the same time as Lindor. \nIt’s not that any penny saved on Lindor might be spent on a big bat. As Indians fans know, that’s likely not the case. When it comes to Lindor, it was more an issue of rushing him and in doing so damaging his confidence. That’s the same scenario that sabotaged many of the Browns’ 23 starting quarterbacks since 1999. \nIn a season wrap-up news conference Tuesday at Progressive Field, manager Terry Francona warned of such a possibility. \n“I just think you run the risk of getting a kid too early; that’s not developing him, that’s getting him beat up,” Francona said. \nLindor played in 99 games and batted .313 with a .482 slugging percentage and .353 on-base percentage to go with his 12 home runs and 51 RBIs. He committed just 10 errors and was rated the fourth-best defensive shortstop in the majors. His energy and willingness to root on his teammates helped invigorate the entire clubhouse. \nFrancona also saw him act his age, like when he hit a ground ball Sunday and didn’t leave the batter’s box. \nBut Lindor is so special that Francona regrets not stumping for him harder in the American League rookie of the year voting. Francona is so worried by what he’s seen of late from baseball analysts that he’s not sure he will watch the announcement. \n“Some of the things I’m reading are starting to aggravate me so much that I don’t know if I really want to watch it because maybe I need to say more,” said Francona, who also pitched Lindor’s case Saturday. “I mean, this kid . if you look at the . I’m missing something somewhere, this kid is rookie of the year.” \nThe prospect of Lindor not getting his due left his manager tongue-tied. Considering the Indians’ other deficiencies in 2015 that Lindor was powerless to fix, their patience with him seems warranted. \nMarla Ridenour is a columnist for the Akron Beacon Journal. Other stories of interest", "external_links": [], "published": "2015-10-08T07:00:00.000+03:00", "crawled": "2015-10-08T10:31:40.077+03:00", "highlightTitle": ""}