{"organizations": ["Steelers"], "uuid": "663cc1c06f96db60aa5eea0521468bfec2dd74a2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribtown.com", "main_image": "http://d1bdhkmqqz901h.cloudfront.net/1200x630/smart/s3.amazonaws.com/hne-smedia/2/f/2fb7bb3b7dd7465dbf3d3e8752484ee6/web_full_649057502220.jpg", "site_section": "http://tribtown.com//feed/sec/6000", "section_title": "TribTown.com - Sports News", "url": "http://www.tribtown.com/view/story/2fb7bb3b7dd7465dbf3d3e8752484ee6/FBN--Steelers-Martavis-Moment", "country": "US", "title": "Martavis' moment: Steelers wide receiver Bryant shines in return from suspension, injury", "performance_score": 0, "site": "tribtown.com", "participants_count": 0, "title_full": "Martavis' moment: Steelers wide receiver Bryant shines in return from suspension, injury", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T02:50:00.000+03:00", "replies_count": 0, "uuid": "663cc1c06f96db60aa5eea0521468bfec2dd74a2"}, "author": "", "url": "http://www.tribtown.com/view/story/2fb7bb3b7dd7465dbf3d3e8752484ee6/FBN--Steelers-Martavis-Moment", "ord_in_thread": 0, "title": "Martavis' moment: Steelers wide receiver Bryant shines in return from suspension, injury", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Bryant", "Martavis"], "text": "Martavis' moment: Steelers wide receiver Bryant shines in return from suspension, injury By WILL GRAVES AP Sports Writer   7:50   7:50   \nPeople: Photo Gallery: \nClick to view (3 Photos) \nPITTSBURGH — Martavis Bryant ran out of running room in the middle of the field, swerved back to his right and took off. \nSomewhere behind him, Pittsburgh Steelers running back Le'Veon Bell watched and waited for his teammate to get caught from behind. Bryant, after all, was being chased by one of the fastest players in the league in Arizona's Patrick Peterson. \nWhile Peterson closed in on Bryant, he never did catch him. \nThen again, neither did any of the other 10 Cardinals on the field. \nBy the time Bryant crossed the goal line — complete with a well-intentioned if somewhat shoddily executed flip — the second-year wide receiver had put Arizona and his own turbulent start to 2015 behind him. \n\"Tay just kind of took off on (Peterson),\" Bell said. \"It's amazing what he can do with the ball in his hands.\" \nSuspended for the first four games for violating the NFL's substance abuse policy and forced to sit out another with a minor knee injury, Bryant wasted little time making amends. He caught six passes for 137 yards and two scores, including his 88-yard zigzag across Heinz Field that finished off the Cardinals and provided a needed reminder of his still somewhat untapped potential. \n\"I don't want to be one-dimensional,\" Bryant said. \nPrimarily a deep threat a year ago, when he averaged 21.4 yards per reception and caught eight touchdowns after being activated in Week 6, Bryant showcased more than just his speed against Arizona. \nHe used every inch of his 6-foot-4 frame to haul in Landry Jones' 8-yard touchdown pass in the third quarter to give the Steelers the lead. He channeled his inner Antonio Bryant, forcing players to miss as he navigated traffic in front of him on his way to Pittsburgh's longest play of the season. \n\"Last year we had called the same play and I dropped it and it would have been a touchdown as well,\" Bryant said. \"I just wanted to finish the catch with my eyes and use my vision to go do what I've got to do.\" \nYet Bryant understands he needs to prove he's more than dynamic. The Steelers have no issues with his playmaking. It's his decision-making they're worried about. Bryant spent a portion of his suspension in Houston at a facility operated by former NBA player and coach John Lucas — a recovering drug addict. He returned to the locker room the morning after a Thursday night loss to Baltimore chastened and eager to move on. \nHe tweaked a knee in his second practice back, but was anxious to get going when he was finally cleared to face Arizona. With Michael Vick at quarterback, offensive coordinator Todd Haley called a couple of short throws and an end-around, none of which really went anywhere. \nIt wasn't until Jones — who'd spent plenty of time throwing to Bryant during the past two preseasons — took over for an injured and ineffective Vick that Pittsburgh took off. \nAll four of Bryant's receptions from Jones either ended with him in the end zone or extended drives that resulted in Chris Boswell field goals that padded Pittsburgh's advantage. \nWhile Brown remains one of the best in the league, Bryant's presence will only make the Steelers (4-2) more dangerous as they try to keep pace with unbeaten Cincinnati (6-0) in the AFC North . \n\"He's only going to get better and continue to grow,\" Bell said. \"It's kind of scary to look at it. He's a guy who is still learning. He doesn't know everything, doesn't know how good he can be.\" \nNOTES: Brown said Monday he's frustrated at his lack of touches while starting quarterback Ben Roethlisberger recovers from a sprained left knee, but added he can't get caught up in individual success. Brown has just 11 receptions for 109 yards and no touchdowns in Roethlisberger's absence. ... The Steelers placed LT Kelvin Beachum on season-ending injured reserve after Beachum tore the ACL in his left knee on Sunday. Pittsburgh signed lineman Byron Stingily to take Beachum's spot on the roster. Stingily started nine games for Tennessee from 2012-14. \nOnline: \nAP NFL website: http://www.pro32.ap.org and http://www.twitter.com/AP_NFL \nAll content copyright ©2015 The Tribune, a division of Home News Enterprises unless otherwise noted.", "external_links": [], "published": "2015-10-20T02:50:00.000+03:00", "crawled": "2015-10-20T04:28:00.305+03:00", "highlightTitle": ""}