{"organizations": [], "uuid": "70588e84a04412944b6c617b07770667c8a8f0a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.shanghaidaily.com", "main_image": "http://www.shanghaidaily.com/newsimage/2015/10/16/020151016204541.jpg", "site_section": "http://rss.shanghaidaily.com/portal/mainsite/Sports", "section_title": "Shanghai Daily: Sports", "url": "http://www.shanghaidaily.com/sports/Experts-tells-teams-to-fight-haka-with-haka/shdaily.shtml", "country": "", "title": "Experts tells teams to fight haka with haka", "performance_score": 0, "site": "shanghaidaily.com", "participants_count": 1, "title_full": "Experts tells teams to fight haka with haka", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T19:00:00.000+03:00", "replies_count": 0, "uuid": "70588e84a04412944b6c617b07770667c8a8f0a0"}, "author": "Neil Sands", "url": "http://www.shanghaidaily.com/sports/Experts-tells-teams-to-fight-haka-with-haka/shdaily.shtml", "ord_in_thread": 0, "title": "Experts tells teams to fight haka with haka", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Experts tells teams to fight haka with haka By Neil Sands | October 18, 2015, Sunday | Print Edition \nIT’S a question that’s vexed the rugby world for generations — how to respond to the foot-stomping, chest-thumping bellow of New Zealand’s pre-match haka? \nThe confrontational ritual, first performed by the All Blacks in 1905, has been a flashpoint for many memorable moments as rival teams attempt to show they will not be intimidated. \nIreland famously advanced toward the All Blacks at Lansdowne Road in 1989 until the teams’ skippers were eyeball to eyeball, while David Campese pointedly ignored the haka before Australia beat New Zealand in the 1991 World Cup semi-final. \nMore recently, France were fined when they formed a human chevron and marched into the All Blacks’ half before the 2011 final — a punishment that critics said showed authorities had become too sensitive about “disrespecting” the haka. \nIt seems there’s no proper way to react to the haka, but Maori cultural experts say the traditional strategy is to perform one of your own. \n“You respond to the haka with your own haka,” Professor Timoti Karetu, author of the book “Haka: Dance of a Noble People,” said. \n“You listen to what they say and you come back with your own similar response. You see all the secondary schools (rugby teams) in New Zealand, they go haka for haka, that’s the way it’s always been, the Maori tradition. \n“They’re challenging you to find a similar response. If you don’t respond then in Maori terms you’re giving away territorial advantage.” \nNew Zealand’s Polynesian neighbors already have their own war dances, such as Samoa’s Siva Tau, the Tongan Sipi Tau and Fiji’s cibi/ibole. \n“It adds color, it adds culture and it adds to the theater of sport as well,” former All Black Dallas Seymour said. \n“You don’t want to see a bland rugby world and our sport’s really been a pioneer in this.” \n‘Dignity and style’ \nPerhaps surprisingly, the All Blacks have not always performed the haka with the fire-breathing intensity displayed by Richie McCaw’s men. \nArchive footage shows teams in the 1920s shuffling along in what appears to be a folk dance, while in the 1970s sideburned behemoths go through the motions and sheepishly grin at one another. \nFormer captain Buck Shelford, fiercely proud of his Maori heritage, is credited with reinventing the haka in the late 1980s. Karetu said the modern All Blacks perform the dance with an understanding of its cultural meaning, rather than simply to entertain the crowd. \n“The current team are probably the best performers of the haka,” he said. “They do it with a rugby man’s dignity and style, and they do it very well.” \nBut the current team have also faced the most criticism of the haka from commentators who say it gives them an unfair motivational advantage over their opponents. \n‘Tap into own culture’ \nNot all international teams have an immediately obvious ritual that could be used to counter the haka. \nAustralia flirted with an aboriginal war cry during the Wallabies’ northern hemisphere tour of 1908 but it was embarrassingly inauthentic and the team captain Herbert Moran detested it, according to the ARU website. \nSeymour said he would like to see Australia revisit the issue and other countries take up the challenge. \n“I guess it’s a way countries can bring their own cultures to the fore — you have to come up with something from your own culture that negates the haka,” he said. \n“Rather than other countries bemoaning our edge, they should tap into their own cultures and show us what they have — I’d love to hear responses in Gaelic, Welsh, Japanese, or Australia’s indigenous culture.” \nKaretu said one of his favorite responses to the haka was the stand-off at Millennium Stadium in 2008, when Wales stood stock-still on their home turf for about three minutes after the haka ended, \n“If they haven’t got a haka of their own, the best thing is to just stand there and watch it respectfully then get on with the game,” he said.", "external_links": [], "published": "2015-10-17T19:00:00.000+03:00", "crawled": "2015-10-16T17:46:58.563+03:00", "highlightTitle": ""}