{"organizations": [], "uuid": "ee59f6a3c1af56a309551c074b41d19f76580a03", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtontimes.com", "main_image": "http://media.washtimes.com.s3.amazonaws.com/media/image/2015/10/11/86350318b491782d840f6a706700f198.jpg", "site_section": "http://www.washingtontimes.com/rss/headlines/sports/", "section_title": "www.washingtontimes.com stories: Sports", "url": "http://www.washingtontimes.com/news/2015/oct/11/presidents-cup-capsules/", "country": "US", "title": "Presidents Cup, Capsules", "performance_score": 0, "site": "washingtontimes.com", "participants_count": 1, "title_full": "Presidents Cup, Capsules", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T10:38:00.000+03:00", "replies_count": 0, "uuid": "ee59f6a3c1af56a309551c074b41d19f76580a03"}, "author": "DOUG FERGUSON", "url": "http://www.washingtontimes.com/news/2015/oct/11/presidents-cup-capsules/", "ord_in_thread": 0, "title": "Presidents Cup, Capsules", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sports Presidents Cup, Capsules International team player Louis Oosthuizen of South Africa gestures after hitting his ball on the first tee during his singles match against United States’ Patrick Reed at the Presidents Cup golf tournament at the Jack Nicklaus Golf Club Korea, in ... more > By DOUG FERGUSON -   \nINCHEON, South Korea (AP) - Capsules of the singles matches Sunday at the President Cup: \nPatrick Reed, United States, halved with Louis Oosthuizen, International. \nOosthuizen delivered a clutch moment, but only after missing two putts that could have changed the outcome. Oosthuizen missed an 8-foot birdie putt on the 15th for a chance to take the lead. The match was all square when both players came up short on the 16th and chipped to about 4 feet. Oosthuizen missed, then Reed made to go 1 up. On the par-5 18th, however, Oosthuizen hit his second shot to 12 feet and made eagle to earn a half-point. \nAdam Scott, International, def. Rickie Fowler, United States, 6 and 5. \nScott struggled with the short putter all week, until Sunday. He went 1 up with a 7-foot birdie putt on the par-5 seventh, and when he poured in a 20-foot birdie putt on the next hole, the former Masters champion was on his way. He won six straight holes, making three birdies on his own (the other was conceded). Fowler didn’t make a birdie and was 4 over when it ended on the 13th. \nDustin Johnson, United States, def. Danny Lee, International, 2 and 1. \nJohnson was 3 up after three holes and it looked as though it might end early. Lee battled back and squared the match with a birdie on the 11th. He took his first lead when Johnson tried to drive the 14th green and found the water, and it was shaping up as the biggest surprise of singles. Lee, however, made bogey on the par-5 15th, chunked a wedge to make another bogey on the 16th and made bogey on the 17th to end it. \nHideki Matsuyama, International, def. J.B. Holmes, United States, 1 up. \nMatsuyama leveled the match on the 14th when Holmes drove into the water. Matsuyama appeared to seize control with a shot into 12 feet for a birdie on the 16th, only for Holmes to answer by stuffing his tee shot on the 17th for a birdie to square the match. Both players came up just short of the green in two on the 18th, and it was chipping contest from there. Matsuyama judged the distance perfect to 3 feet. Holmes came up to 15 feet and missed the birdie putt to lose the match. \nBubba Watson, United States, halved with Thongchai Jaidee, International. \nWatson never trailed and led 3 up after 10 holes, but Thongchai pecked away with birdies at the 11th and 12th holes to stay in range. He caught up to Watson when the two-time Masters champion three-putted from long range on the 17th. Watson had a big advantage with his length on the 18th, even more when Thongchai hit his tee shot into the water. Thongchai took a drop and ripped fairway metal just through the green and nearly holed his birdie putt. Watson chipped beautifully to 4 feet. But for the second straight day, Watson missed a short putt and had to settle for a halve. \nSteven Bowditch, International, def. Jimmy Walker, United States, 2 up. \nIn a sloppy match that featured no birdies by either player on the front nine, Bowditch won three straight holes with two pars and a conceded birdie, and he pulled ahead with a birdie at the 14th. But the Australian conceded the 15th hole and made bogey on the 17th hole to send the match to No. 18. Walker missed a birdie putt from the fringe and conceded. \nPhil Mickelson, United States, def. Charl Schwartzel, International, 5 and 4. \nMickelson completed an unbeaten week at the Presidents Cup for the third time, and the first time as a captain’s pick. He never had an easier match. Mickelson didn’t make his first birdie until he chipped in on the 11th hole, and by then he already was 5 up. Schwartzel gave away six holes by failing to make par. Mickelson closed it out on the 14th hole with a short birdie putt to go 3-0-1. He also was unbeaten in 2005 and 2009.", "external_links": [], "published": "2015-10-11T10:38:00.000+03:00", "crawled": "2015-10-11T11:44:20.431+03:00", "highlightTitle": ""}