{"organizations": [], "uuid": "117b1beb67d9e13d38740a85522acf862401db96", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wcax.com", "main_image": "", "site_section": "http://www.wcax.com/category/13530/national-news", "section_title": "National News - WCAX.COM Local Vermont News, Weather and Sports-", "url": "http://www.wcax.com/story/30145970/texas-officer-who-pinned-black-teen-had-disciplinary-record", "country": "US", "title": "Texas officer who pinned black teen had disciplinary record", "performance_score": 0, "site": "wcax.com", "participants_count": 1, "title_full": "Texas officer who pinned black teen had disciplinary record - WCAX.COM Local Vermont News, Weather and Sports-", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "117b1beb67d9e13d38740a85522acf862401db96"}, "author": "wcax.com", "url": "http://www.wcax.com/story/30145970/texas-officer-who-pinned-black-teen-had-disciplinary-record", "ord_in_thread": 0, "title": "Texas officer who pinned black teen had disciplinary record", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By EMILY SCHMALL\nAssociated Press FORT WORTH, Texas (AP) - A white suburban Dallas police officer who resigned after video showed him forcing a bikini-clad black 15-year-old girl to the ground in June was disciplined three previous times during his 10-year career with the department, police records show.\nThe June 5 incident involving McKinney police Officer Eric Casebolt, who also pulled a gun on other black teens outside a pool party, sparked criticism, protests and eventually Casebolt's resignation.\nCasebolt's attorney, Jane Bishkin, said Tuesday that she had not seen Casebolt's personnel file, which was released to media late Friday, but called his disciplinary record a \"non-issue.\"\n\"If he were that bad, he would have been fired a long time ago,\" she said.\nThe file reviewed by The Associated Press shows Casebolt was suspended without pay for one day in June 2010 after going in his police car and in uniform to bail out his girlfriend from jail.\nHe received a written reprimand in 2014 for boasting on Facebook about his response to a suicidal teenager.\n\"Guess who just checked the box for 'commandeer a golf cart and tased a suicidal knife wielding maniac off-handed and still rolling without spilling the golfer's miller lite'?!\" Casebolt wrote on Facebook.\nHe was also reprimanded for conduct in a May 2011 incident involving an ex-girlfriend and her ex-husband.\nThe woman's former husband had called police to complain that Casebolt was circling the woman's apartment, according to police records. The man also accused Casebolt of leaving a loaded gun unsecured around children at the woman's apartment.\nHe was suspended without pay for three days.\nThe personnel file also shows Casebolt was praised at times - for being orderly, having a good working relationship with others, dependability, making good decisions and for his ability to adapt to stressful situations and control his emotions. He was named officer of the year in 2008.\nThe Collin County district attorney's office has said it will present Casebolt's case to a grand jury.\n ", "external_links": [], "published": "2015-09-29T03:00:00.000+03:00", "crawled": "2015-10-02T22:39:17.662+03:00", "highlightTitle": ""}