{"organizations": [], "uuid": "955e5b5ffa569435b14eb4cbee0443360fe5c3ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "host.madison.com", "main_image": "http://bloximages.chicago2.vip.townnews.com/host.madison.com/content/tncms/assets/v3/editorial/6/af/6afded53-07ba-5ffa-832f-68348a34cde1/5626ff3c01a2b.image.jpg?resize=620%2C409", "site_section": "http://host.madison.com/search/?f=rss&t=article&c=sports/recreation/outdoors*&l=25&s=start_time&sd=desc", "section_title": "host.madison.com - RSS Results in sports/recreation/outdoors* of type article", "url": "http://host.madison.com/sports/recreation/outdoors/gary-engberg-lower-wisconsin-river-is-a-great-place-to/article_86249a8e-cb1d-55c2-95e4-75b25a614e9e.html", "country": "US", "title": "Gary Engberg: Lower Wisconsin River is a great place to hit fall muskies", "performance_score": 0, "site": "madison.com", "participants_count": 1, "title_full": "Gary Engberg: Lower Wisconsin River is a great place to hit fall muskies", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T16:00:00.000+03:00", "replies_count": 0, "uuid": "955e5b5ffa569435b14eb4cbee0443360fe5c3ab"}, "author": "GARY ENGBERG For the State Journal", "url": "http://host.madison.com/sports/recreation/outdoors/gary-engberg-lower-wisconsin-river-is-a-great-place-to/article_86249a8e-cb1d-55c2-95e4-75b25a614e9e.html", "ord_in_thread": 0, "title": "Gary Engberg: Lower Wisconsin River is a great place to hit fall muskies", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Close BOB FILA -- Knight-Ridder archives \nA 34-inch muskie, six inches to short for the minimum size to keep on the Wisconsin River. Gary Engberg: Lower Wisconsin River is a great place to hit fall muskies GARY ENGBERG For the State Journal Oct 21, 2015 BOB FILA -- Knight-Ridder archives \nA 34-inch muskie, six inches to short for the minimum size to keep on the Wisconsin River. \nMAZOMANIE -- The Lower Wisconsin River from the dam at Prairie du Sac to the “Trestles” just past the Highway 12 Bridge is well worth fishing for muskies this time of year. \nThe activity on the river and number of fishermen is down significantly from the summer months. Many anglers are now out hunting and many anglers have even put their boats away for the year. \nBut there still is some great fishing left for the angler who wants to have some room on the water with the chance for a big fish. \nThe Lower Wisconsin River has a very good population of muskies that are found in the dam and tailrace areas close to the dam and downriver as far as the Highway Y boat landing. These river muskies either came through the dam’s turbines from Lake Wisconsin or came upriver from the Mississippi River. My guess is that is that they came from Lake Wisconsin and somehow made their way through the dam system. I’ve seen muskies for years in the Wisconsin River, but the population has been steadily growing and seems to be reproducing naturally. \nThe best place to launch a boat is at the VFW Park in Prairie du Sac or the landing on Highway Y along the Wisconsin River between Sauk City and Mazomanie. The VFW Park is located past the Highway 60 Bridge off Water Street. \nTurn right at the VFW sign and go down the hill to the park. The cost is only $5 and you can see the dam from the launch. There also are campsites available with a fire-pit for only $15 a night. So, for $20, you can camp and launch your boat and be within a half a mile of the dam and all the good fishing locations. \nMotor slowly toward the dam and try and stay in the channel because the water this year can be extremely low in spots. Put your bow mount electric motor down and work the east and west sides of the dam casting bucktails, crankbaits, jerkbaits, spinners, and top-water baits. The muskies are hitting about anything this time of year and top-water baits are still working well. \nSome of the other producing baits include Smity jerkbaits, Bucher Depth Raiders, and Grandma Baits. The best colors for lures seem to be colors consistent with the river’s forage fish. Gizzard shad is the main forage so use black/white and then I’d have perch, orange, blue/white, and chartreuse in my other bait colors. The best blade colors are silver, gold, and copper for your bucktails. \nBurning bucktails fast across the surface has been another productive technique that is still working well. The east shore right below the dam is a hot-spot for muskies with a current that creates a back-eddy along that shore. There are large numbers of shad and rough fish that concentrate in the deep scour hole below the dam, which is over 30 feet deep in some locations. This deeper water gives the muskies a deep water location to escape to and rest. \nThis time of the year the water temperature is still in the upper 50s and a week or two away from fall turnover on most lakes. Rivers and shallow lakes like Lake Winnebago don’t experience turnover because they are too shallow. \nThe Wisconsin River has abundant wood, rocks, islands, and bars which all can provide structure for the big fish and feed for the winter ahead. I suggest that you work both sides of the river from the dam to the Highway 12 Bridge and then work your way casting the other shoreline back to the dam. Drifting works now with the low water flow, but using a bow or transom mount trolling motor is the best and easiest way to go. You should be able to fish the area from the dam to the bridge in half a day if you keep moving and casting your baits. \nFall is when live bait rules. While you’re casting for muskies, put out a sucker near your boat with a big float (bobber) and a rubber core sinker to get your sucker down a few feet in the water column. Quick set rigs should be used because they allow you to set your hook quickly and not gut-hook and kill the fish. \nMuskie pro and resort manager, Steve Herbeck (Andy Myers Lodge), says that muskie anglers should be fishing suckers in the 12 to 15 inch range this time of year and pick the suckers with the darkest and blackest color you can find. Herbeck also suggests hooking a tail-gunner or small spinner blade to the sucker’s tail for added flash and attraction in the river’s stained water. Herbeck grew up in Wisconsin and fished the Wisconsin River since he was in his teens, so Steve knows what he’s talking about with muskies and rivers. \nWading in the Wisconsin River is also a good way to catch muskies in the fall. Be sure to have a good pair of waders, always wear a life jacket, and try to fish with another person. The best time to wade is the hour before dark and anytime through the night. Cast your favorite muskie baits and work them back to you slowly with a few twitches and jerks on your retrieve. Have a good net, some tools for releasing your muskie, and some good lighting to make things a little easier in the dark. \nMake sure to have a valid fishing license and the minimum size for muskies in the Wisconsin River is 40 inches. The muskie season in the southern third of Wisconsin is open until the end of December. So if the water doesn’t freeze you can fish for muskies to the end of the year. \nFor information, call MacFarlanes in Sauk City at 608-643-3321 or contact guides Wally Banfi at 608-644-9823, Ron Barefield at 608-235-7685 or Lee Tauchen at 608-444-2180. Also check out the Wisconsin Department of Resources at http://www.dnr.wi.gov.org . \nContact Gary Engberg, a freelance outdoors writer from Mazomanie, at gengberg@chorus.net, call 608-795-4208 or visit http://www.garyengbergoutdoors.com. You might also like", "external_links": [], "published": "2015-10-21T16:00:00.000+03:00", "crawled": "2015-10-25T10:12:09.571+02:00", "highlightTitle": ""}