{"organizations": [], "uuid": "227b15605a9acb593abc75febc5cf8fe0fd3aaa2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kctv5.com", "main_image": "http://kctv.images.worldnow.com/images/8992670_G.jpg", "site_section": "http://kctv5.com/category/208603/sports?clienttype=rss", "section_title": "KCTV Kansas City - Sports", "url": "http://www.kctv5.com/story/30234653/k-state-watches-big-lead-slip-away-in-loss-to-no-2-tcu", "country": "US", "title": "K-State watches big lead slip away in loss to No. 2 TCU", "performance_score": 0, "site": "kctv5.com", "participants_count": 1, "title_full": "K-State watches big lead slip away in loss to No. 2 TCU - KCTV5", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T15:27:00.000+03:00", "replies_count": 0, "uuid": "227b15605a9acb593abc75febc5cf8fe0fd3aaa2"}, "author": "Posted by Chris Oberholtz, Multimedia Producer", "url": "http://www.kctv5.com/story/30234653/k-state-watches-big-lead-slip-away-in-loss-to-no-2-tcu", "ord_in_thread": 0, "title": "K-State watches big lead slip away in loss to No. 2 TCU", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MANHATTAN, KS (FOOTBALLKC) - Trevone Boykin entered the Kansas State-TCU game being mentioned with the front runners of the nation’s Heisman watch. Kansas State knew they would have to slow down an electrifying Horned Frog’s offense if they were to have any chance to pull off an upset of the nation’s second-ranked team.\nBoykin was nothing less than spectacular, as TCU escaped Manhattan with a 52-45 victory in a Big 12 thriller.\nBoykin finished the game with 301 passing yards and two touchdowns and 124 rushing yards and two more touchdowns, including a 69-yard scramble in the fourth quarter that gave the Horned Frogs their first lead since the second quarter.\nThe Wildcats matched the offensive output of TCU for much of the game, leading 35-17 at halftime behind a dominant running game, but stalled in the second half, getting outscored 35-10.\nQuarterback Joe Hubener put up dismal numbers through the air, going 13-33 in the game, but found the end zone four times on the ground, rushing for 111 yards. The running game helped the Wildcats dominate in time of possession and keep a tired Horned Frog defense on the field in the first half.\nThe Wildcats saw a halftime lead slip away for just the second time in their last 51 games. The first time was last weekend, when they lost to the nationally ranked Oklahoma State Cowboys.\nDefensively, linebacker Elijah Lee had a huge game for the Wildcats, intercepting Boykin two times in defeat, but he and the Wildcat secondary were unable to stop the dominant connection of Boykin and receiver Josh Doctson. Doctson went for more than 100 yards receiving for the fourth consecutive game and was responsible for the 55-yard game-winning touchdown with just 1:04 remaining in the game.\nThe score came just two plays after coach Bill Snyder opted for a field goal to tie the game instead of going for it on fourth and one deep in TCU territory. The Wildcats made the kick, but the choice gave Boykin the ball back with two timeouts and time to work with.\n“Obviously the field goal was the wrong thing to do,” admitted Snyder after the game.\nThe Wildcats got the ball back with a chance to march it down the field, but Hubener lost the ball on a well-timed blitz, giving TCU the ball inside K-State territory and sealing the game.  The sting of defeat was easy to see in the Wildcat quarterback as he broke down in tears on the sideline after the fumble.\nThe Wildcats impressed with their heart and talent on national television, but it was all for not as the Wildcats fell to 3-2 overall and 0-2 in conference after back-to-back difficult losses. The Wildcats will try to build off the inspirational effort as they look to win their first game in the Big 12 against the No. 10 Oklahoma Sooners, their third straight ranked opponent.\nCopyright 2015 KCTV (Meredith Corp.) All rights reserved.", "external_links": [], "published": "2015-10-11T15:27:00.000+03:00", "crawled": "2015-10-11T19:59:38.596+03:00", "highlightTitle": ""}