{"organizations": [], "uuid": "124560454f8113698e703acbe63ae6512b4969e1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fox8live.com", "main_image": "", "site_section": "http://www.fox8live.com/", "section_title": "New Orleans News, Weather, Saints - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "url": "http://www.fox8live.com/story/30159803/arizona-sheriff-faces-2nd-day-of-testimony-in-contempt-case", "country": "US", "title": "Arizona sheriff faces 2nd day of testimony in contempt case", "performance_score": 0, "site": "fox8live.com", "participants_count": 1, "title_full": "Arizona sheriff faces 2nd day of testimony in contempt case - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "124560454f8113698e703acbe63ae6512b4969e1"}, "author": "cbs8", "url": "http://www.fox8live.com/story/30159803/arizona-sheriff-faces-2nd-day-of-testimony-in-contempt-case", "ord_in_thread": 0, "title": "Arizona sheriff faces 2nd day of testimony in contempt case", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By JACQUES BILLEAUD\nAssociated Press PHOENIX (AP) - A lieutenant testified Thursday that Sheriff Joe Arpaio personally spent $10,000 to help pay for an investigation of a government conspiracy that critics say was designed to get the judge in the lawman's racial-profiling case disqualified.\nThe testimony came in a hearing to determine whether the 83-year-old sheriff should be held in contempt for flouting a judge's orders with his signature immigration patrols, which helped elevate Arpaio to the national political stage. One element of the contempt hearing is a bizarre investigation carried out by Arpaio's office into whether someone was spying on Arizona judges and his own lawyers.\nCritics say Arpaio's ultimate goal with the investigation was to get the judge removed from the case by proving that he was conspiring with the U.S. Justice Department in a bid to take down the sheriff. Arpaio denies those allegations.\nU.S. District Judge Murray Snow ruled in 2013 that Arpaio's office systematically racially profiled Latinos in its immigration patrols, and he has ordered a series of reforms that have dramatically undercut the sheriff's powers. As the case played out, he ordered Arpaio to stop doing immigration patrols, but the sheriff defied the order for 18 months.\nSheriff's officials have said the investigation cost $250,000, including $120,000 for a confidential informant whose information was eventually discredited. The money came from various sources, including property seized through the courts as part of criminal cases. Grant money intended for combating drug trafficking also was used to pay for the investigation. Some of the money helped pay for renting a house for sheriff's investigators in Seattle, where the informant was based at the time of the investigation.\nAs the money began to run out, Arpaio spent $10,000 of his own money to cover the travel expenses of a volunteer member of one of his posses who was helping with the investigation, Lt. Kim Seagraves said Thursday in court. She learned of the sheriff's donation from another official who raised questions about the costs of the investigation. Seagraves said the sheriff profanely told the official that he didn't care about his concerns.\n\"The sheriff did not give $10,000 to the Seattle investigation,\" Arpaio attorney John Masterson said outside of court. Still, Masterson said he didn't know whether his client gave any amount of money to help fund the investigation.\nThe sheriff's office has declined a request by The Associated Press for all the billing records connected to the investigation.\nEarlier Thursday, Arpaio repeatedly shifted blame to his subordinates as he was subjected to questioning in federal court over his agency's defiance of Snow's court order. Arpaio spent a half hour on the witness stand late Wednesday during the contempt-of-court hearing and resumed his testimony on Thursday.\nArpaio is scheduled to resume his testimony Friday.\nLawyers played clips from the sheriff's national media interviews in which he described his immigration policies and defiance of the federal government. In one interview with Fox News host Megyn Kelly, Arpaio declared \"That is garbage\" to describe what he thought of the possibility of a federal monitor being appointed to keep an eye on his office in another case.\nHis demeanor during testimony was subdued, a contrast from the video clips played in court in which he loudly expressed his defiance of court supervision of his office.\nThe sheriff was asked to explain Thursday why an internal investigation found no wrongdoing over his office's violation of the order, even though his second-in-command has acknowledged that he violated the judge's orders. Arpaio explained that he delegated those duties to others to handle and he didn't have all the facts.\n\"I said as the leader I take responsibility but not the nuts and bolts,\" Arpaio said, noting that he didn't get into the details of the investigation.\nArpaio was asked Wednesday about whether his immigration efforts were politically driven. \"It wasn't politics for me. I was trying to enforce the laws,\" he said.\nThe attorneys pressing the case against Arpaio hammered Thursday on persistent criticism that the sheriff's office doesn't adequately investigate wrongdoing by officers. The internal investigations are relevant to the contempt case because the judge is expected to order changes to the agency that confront the criticism.\nThe investigation into who was responsible for violating the order to stop the patrols didn't include Arpaio as a target. Asked why his actions weren't examined as part of the investigation, Arpaio said he didn't know how he could make a disciplinary decision on himself.\nThe six-term sheriff also is being called into court for his office's failure to turn over traffic-stop recordings before the profiling trial and bungling a plan to gather the videos once they were publicly revealed.\nHe could face civil fines and possibly a criminal contempt case.\nOther subjects to be heard at the hearing involve allegations that his officers pocketed personal items seized from people during traffic stops and busts.\nCopyright 2015 The Associated Press. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-01T03:00:00.000+03:00", "crawled": "2015-10-02T08:41:28.785+03:00", "highlightTitle": ""}