{"organizations": ["Wolverines", "Taylor Morris", "Herald Durango High School", "Bayfield By Joe Fries Tweet Steve Lewis/Durango Herald Durango High School", "Southwestern League", "Bayfield"], "uuid": "51f1c0f01697b6eea71428509e7ae744ba8c68ba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.durangoherald.com", "main_image": "http://durangoherald.com/storyimage/DU/20151003/SPORTS03/151009849/AR/0/AR-151009849.jpg", "site_section": "http://www.durangoherald.com/section/sports?template=RSS&mime=xml", "section_title": "Sports", "url": "http://www.durangoherald.com/article/20151003/SPORTS03/151009849/-1/sports&source=RSS", "country": "US", "title": "Durango, Bayfield volleyball go five sets again", "performance_score": 0, "site": "durangoherald.com", "participants_count": 0, "title_full": "Durango, Bayfield volleyball go five sets again", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T04:21:00.000+03:00", "replies_count": 0, "uuid": "51f1c0f01697b6eea71428509e7ae744ba8c68ba"}, "author": "", "url": "http://www.durangoherald.com/article/20151003/SPORTS03/151009849/-1/sports&source=RSS", "ord_in_thread": 0, "title": "Durango, Bayfield volleyball go five sets again", "locations": ["Durango"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Susie Robertson", "Robertson", "Colleen Vogt", "Brooke Kudelski", "Terene Foutz", "Maddie Robertson", "Lauran Morrissey", "Maddie Foutz", "Jim", "Durango", "Bayfield", "Steve Lewis/Durango", "Addison Swift"], "text": "Durango, Bayfield volleyball go five sets again Durango, Bayfield volleyball go five sets again Another five sets, another win for Durango against Bayfield By Joe Fries Tweet Steve Lewis/Durango Herald Durango High School senior outside hitter Maddie Robertson spiked the ball through Bayfield’s Brooke Kudelski (left) and Taylor Morris (right) for one of her 15 kills Saturday in Durango. Steve Lewis/Durango Herald Durango High School senior outside hitter Maddie Robertson spiked the ball through Bayfield’s Brooke Kudelski (left) and Taylor Morris (right) for one of her 15 kills Saturday in Durango. A fter watching the two matches that have taken place this season between the Bayfield and Durango volleyball teams, there’s an urge to want more. Saturday afternoon, for the second time this year, the two programs went toe-to-toe in a five-set thriller. For the second time this year, Durango (7-5, 1-2 4A/5A Southwestern League) won the fifth-set tiebreaker 15-10 to win the match and sweep Bayfield (5-8, 1-1 4A Intermountain League) for the first time since 2010. Senior Maddie Robertson led the way for Durango with 15 kills. Addison Swift had 24 assists, and Lauran Morrissey had 14 digs to help the Demons’ cause. “It’s always a good battle,” said Durango head coach Colleen Vogt. “It’s fun because the girls know each other, and it seems like everyone wants to bring their best game.” Durango got off to a fast start and won the first six of seven points en route to a 25-11 first set wake-up call directly to Bayfield. The Wolverines answered back and took the second set 25-16 after jumping out to a 9-1 lead. The back-and-forth that took place in the first two games exemplified both meetings the teams had this season and set the tone for the rest of the match. The teams exchanged leads in the third set five times before Durango ran off six consecutive points and took a 2-1 lead in the match with a 25-18 win. Facing elimination, the young and gritty Wolverines, led by Maddie Foutz and Brooke Kudelski, pulled off an inspiring fourth-set win. The game was tied at 22, 23 and 24 until Bayfield won the final two points to stay alive and force a fifth game. “The effort in the fourth game was outstanding,” said Bayfield head coach Terene Foutz. “We’re so young, and we have to work on making unforced errors when the game is on the line, but I’m so proud of the way we’re playing now. We’re starting to become who we want to be.” The unforced errors did some damage to the Wolverines in the tiebreaker, but the fight was still there. Down 8-3, they pulled to within three at 12-9. The experience of Robertson and the Demons was the difference late. The senior outside hitter was too much to contain, and her ace was an appropriate end to another exciting battle. “There’s something about coming out against Bayfield that’s always special,” said Robertson, daughter of Jim and Susie Robertson. “Both teams get super fired up, and both teams are always playing at their top. We joke around that we always want to take it to five games because we just can’t stop playing. We love playing against each other.”", "external_links": [], "published": "2015-10-04T04:21:00.000+03:00", "crawled": "2015-10-04T09:33:03.548+03:00", "highlightTitle": ""}