{"organizations": [], "uuid": "dffb97a8b27630774aec584e9fdea65de0270248", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailycommercial.com", "main_image": "http://bloximages.newyork1.vip.townnews.com/dailycommercial.com/content/tncms/assets/v3/editorial/3/a1/3a17b58f-e1fa-542b-8124-fc4c47207e2d/5626de418012b.image.jpg?resize=760%2C518", "site_section": "http://www.dailycommercial.com//search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&nsa=eedition&c[]=sports,sports/*&f=rss", "section_title": "Daily Commercial - sports,sports/", "url": "http://www.dailycommercial.com/news/article_eb1ded78-04e3-597e-add7-6936251cf2f8.html", "country": "US", "title": "Local golfers advance to state finals", "performance_score": 0, "site": "dailycommercial.com", "participants_count": 1, "title_full": "Local golfers advance to state finals", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T04:00:00.000+03:00", "replies_count": 0, "uuid": "dffb97a8b27630774aec584e9fdea65de0270248"}, "author": "FRANK JOLLEY frank.jolley@dailycommercial.com", "url": "http://www.dailycommercial.com/news/article_eb1ded78-04e3-597e-add7-6936251cf2f8.html", "ord_in_thread": 0, "title": "Local golfers advance to state finals", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "AMBER RICCINTO / DAILY COMMERCIAL Paige Wilson \nSouth Lake High School freshman Paige Wilson follows through with her swing on Tuesday and the Class 2A-Region 3 boys and girls tournaments Black Bear Golf Club in Eustis. Athough Wilson qualified with her team, she also posted the lowest score of the day with a 3-over par 75. Posted: Tuesday, October 20, 2015 9:00 pm Local golfers advance to state finals FRANK JOLLEY frank.jolley@dailycommercial.com dailycommercial.com | 0 comments \nRegional golf tournaments are supposed to be tough. \nLocal high school golfers were reminded of that lesson over the past two days as regional play pared down the list of qualifiers for the state tournaments for each of three classifications. \nAt Tuesday's Class 2A-Region 3 tournament at Black Bear Golf Club in Eustis, South Lake won the boys and girls team titles. For the girls, Eustis also qualified as a team by finishing second. \nIn addition, Eustis boys golfer Justin Rickerson advanced as an individual by winning the individual competion with a 4-over par 76. The Panthers did not advance as a team in boys competition. \nFor South Lake, consistency was the order of the day for the boys team. The Eagles' top four golfers finished within one shot of each other en route to a 329. \nNick Puerto, Blake Wilson and Tyler Johnston carded 82's, while Tyler Horn added an 83. \nCrystal River earned the second qualifying spot among boys with a team score of 353. \nAmong individuals, Ocala Vanguard's Sammy Hudson shot a 78 to also qualify. \nIn regional play, the top two teams and top two individuals not on a qualifying team advance to the state championships. This year's Florida High School Athletic Association state championships, will be held beginning Oct 27 at Mission Inn Golf and Resort. \nTournaments for each classification will be 36-hole events. \nAmong the girls, South Lake finished with a 373 score, led by Paige Wilson. The freshman also carded the tournament's low score with a 75. \nIn addition to Wilson, South Lake got contributions from Jackie Carter with a 94, Sarah Morningstar added a 102, as did Lauren Karnolt. Maddison Drawdy carded a 111, but only the four lowest scores make up a team's total score. \nEustis finished second among the girls, with sophomore Julia Towne leading the way with a 77 on her home course. Mya Traylor added a 117, followed by Grace Harwick with a 118 and Gabriella Shoaff with a 121. \nAmong individuals, Lecanto's Maddison Polazzo shot a 82 to qualify, as did Ocala Lake Weir's Bridget Rempe, who shot an 85. \nIn the Class 3A-Region 3 tournament, which was held at Cleveland Heights Golf Course in Lakeland, Lake Minneola sophomore Jonathan Yaun qualified for the Class 3A state tournament. Yaun carded a 3-over par 74 to finish second among individuals. \nIn the girls Class 1A-Region 3 tournament, which was held at Pine Oaks in Ocala, The Villages qualified as a team with a second-place finish. The Buffalo had a team score of 368, well off the pace set by Lake Mary Prep, which won the team title with a 273. \nIndividuals making up the Buffalo are: Erin Eatmon, with a 68; Diane Burress with an 81, Adriana Gonzalez with a 93 and Taylor Combs with a 106. Alyson Stegner carded a 124, but her score did not count into the Buffalo's team score. \nThe Class 1A state finals will be held Oct. 27-28, with the Class 2A championship being decided on Oct. 30-31. The Class 3A finals are set for Nov. 3-4. \nThe girls tournaments will played on Mission Inn Golf and Resort's Las Colinas layout, while the boys will play on El Campeon. \nAdmission to Mission Inn Golf and Resort for all tournaments is free, although there will be a $10 charge for parking.", "external_links": [], "published": "2015-10-21T04:00:00.000+03:00", "crawled": "2015-10-21T04:33:35.382+03:00", "highlightTitle": ""}