{"organizations": [], "uuid": "96ee49f8c99710273239f4328b7f7359bd88f5af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wralsportsfan.com", "main_image": "http://wwwcache.wralsportsfan.com/asset/hockey/nhl/hurricanes/2015/10/11/14962253/jct21388-651x485.jpg", "site_section": "http://www.wralsportsfan.com/news/rss/697/", "section_title": "Sports Fan stories from WRAL.com", "url": "http://www.wralsportsfan.com/hanifin-murphy-blue-line-bright-spots-amid-canes-defensive-breakdowns/14968412/", "country": "US", "title": "Hanifin, Murphy blue line bright spots amid Canes defensive breakdowns", "performance_score": 0, "site": "wralsportsfan.com", "participants_count": 0, "title_full": "Hanifin, Murphy blue line bright spots amid Canes defensive breakdowns", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T16:57:00.000+03:00", "replies_count": 0, "uuid": "96ee49f8c99710273239f4328b7f7359bd88f5af"}, "author": "", "url": "http://www.wralsportsfan.com/hanifin-murphy-blue-line-bright-spots-amid-canes-defensive-breakdowns/14968412/", "ord_in_thread": 0, "title": "Hanifin, Murphy blue line bright spots amid Canes defensive breakdowns", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hanifin", "Murphy"], "text": "Hanifin, Murphy blue line bright spots amid Canes defensive breakdowns \nPosted 9:57 a.m. today Your friends e-mail addresses (comma separated): * Subject: * You must enter the characters with black color that stand out from the other characters More on this 37 Images By R.L. Bynum / Raleigh & Co. \nRaleigh, N.C. — In the Carolina Hurricanes’ first full game without injured defenseman James Wisniewski, a few mistakes on their own end led to a loss in a game they dominated for two periods. \nA bright spot on the blue line, though, was rookie Noah Hanifin, whose pairing with Ryan Murphy was productive in Saturday night’s 4–3 loss in Carolina’s home opener . They didn’t have any damaging defensive breakdowns and were on the ice for two of the Canes’ three goals. \nHanifin clearly has a high hockey IQ that you wouldn’t expect from an 18-year-old player, is a strong skater and will only get better. The Arizona Coyotes and the Toronto Maple Leafs will likely regret for years letting him slip to the Canes at No. 5 in last summer’s NHL Entry Draft. \n“Steady,” said Canes coach Bill Peters in describing the former Boston College star. “Just a very smart player. He’s going to make some mistakes at this age because of the lack of pro experience. But he’ll learn from them, and he’ll grow. He’ll just continue to improve.” \nSome mistakes came from 34-year-old veteran defenseman Ron Hainsey, who — along with defensive partner Justin Faulk — was on the ice for three of Detroit’s four goals. When Henrik Zetterberg made a move on Jordan Staal along the goal line for the Red Wings’ first goal, Hainsey was nearby but didn’t make a play. \nPeters called the third-period Justin Abdelkader goal “a blatant d-zone coverage breakdown by us” after Zetterberg skated around behind the goal for several seconds before setting up Abdelkader for the third-period goal that basically put the game away. \n“We kind of gave them their chances, their opportunities to score and they capitalized,” said Faulk, who scored a meaningless power-play goal in the final seconds of the game. “The breaks they got were kind of from ourselves. The good thing is that they are easy to clear up. We can’t let that happen with a lead going into the third period.” \nThat’s how a team loses after outshooting its opponent 34–8 through two periods and owning a 2–1 lead. \nBut you can’t blame Hanifin, who earned his first NHL point when his shot went off the end board in the second period, and Victor Rask swatted it in at close range. \n“It was nice getting that, but if would have been nicer if we got the win,” Hanifin said. “But it was pretty cool.” \nThat was just one of Hanifin’s impressive plays on the night, which included: When playing the puck behind the goal as Detroit’s Teemu Pulkkinen (who scored two goals) pursued him, he casually reversed the puck past Pulkkinen and to Murphy, who cleared it. He nullified what was developing into a terrific second-period scoring chance for Detroit’s Gustav Nyquist. When Nyquist tried a spin move, Hanifin — playing him one-on-one — gave him a good body check, and the puck harmlessly deflected away. Detroit center Luke Glendening got through a gap between Hanifin and a couple of other Canes in the third period. But Hanifan dove to the ice and knocked the puck away with his stick to snuff what looked like a good scoring chance. \nIn 17 minutes, 21 seconds of ice time, Hanifin took four shots, had two hits and blocked a shot. His ice time will likely be even greater than was originally planned before Wisniewski suffered a season-ending torn ACL in his left knee. \n“He’s been playing great,” said Faulk, who again had a gritty game Saturday. “It’s not easy coming into the league at 18 years old. There’s a lot of good players and some of the teams he’s been facing are pretty good teams. He’s been handling it pretty well. It’s nice to see. Obviously he’s just going to get better and better.” \nHanifin doesn’t seem overwhelmed with the sort of opportunity that has caused many older players to stumble. \n“I’m feeling better personally,” Hanifin said. “Obviously, I still have so much I can learn and get better at, and I’ll get that with time. I think for the first two games, I’m starting to feel a little bit better. The speed is really different. \n“Guys are a lot stronger down low below the goal line,” he said. “It’s a lot harder defensively, but I’m just trying to learn as much as I can. These guys are so good with the little things, the details, but I think that’s something I’ll have to adjust to.” \nHe seems to be developing good chemistry with Murphy, who, at 22 years old, is a veteran by comparison. \n“I love playing with him,” Hanifan said. “I think we have a good group of young D. Being able to play with him, he’s a really good skater, obviously. He can jump into the play and contribute offensively so it’s nice to be able to play with him.” \nCopyright 2015 Raleigh & Company. All rights reserved. Triangle Area Special Offers", "external_links": [], "published": "2015-10-14T16:57:00.000+03:00", "crawled": "2015-10-14T23:51:10.817+03:00", "highlightTitle": ""}