{"organizations": [], "uuid": "7e32069be8a4109df6022ff5ea4c0cbe320c749a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.statesman.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/08/18/43/9a/Statesman_OG_image_NEW.jpg", "site_section": "http://www.statesman.com/s/sports/highschool/", "section_title": "Texas High School Football &amp; Sports | Scores &amp; Schedules | www.statesman.com", "url": "http://www.statesman.com/news/news/local/moore-about-bastrop-have-you-voted-yet/nn64X/", "country": "US", "title": "Moore About Bastrop: Have you voted yet?", "performance_score": 0, "site": "statesman.com", "participants_count": 1, "title_full": "Moore About Bastrop: Have you voted yet? | www.statesman.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T05:00:00.000+03:00", "replies_count": 0, "uuid": "7e32069be8a4109df6022ff5ea4c0cbe320c749a"}, "author": "Debbie Moore", "url": "http://www.statesman.com/news/news/local/moore-about-bastrop-have-you-voted-yet/nn64X/", "ord_in_thread": 0, "title": "Moore About Bastrop: Have you voted yet?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Did you know that early voting opened October 19 and runs through October 30? That’s right; we have an election underway. There are seven constitutional amendments on the ballot.\nOur county Elections Administration website has a listing of dates, times, and places to vote along with a listing of each proposed amendment. Should you need additional information, they list an additional link. Go to www.bastropvotes.org, and click on the Current and Upcoming Elections tab.\nGet informed and go vote!\nBastrop throws a tailgate party\nI would dare say that every football fan has attended their fare share of tailgate parties before going in to cheer on their favorite team. In fact, I know some folks that go to the party instead of going to the game – really.\nOn November 7, Bastrop is throwing a Texas-sized tailgate party on Main Street from 11:00 a.m. until 6:00 p.m.\nLocal restaurants from the historic district, Texas 71, and around the county will be selling small, sample-size portions of their specialty menu items. We have an amazing number of dining opportunities in and around town, so this will be a gastronomical treat.\nNo tailgate party is complete without some adult beverages, and some of the available spirits will be made locally. Besides food and drink, attendees can experience some great artwork, jewelry, clothes, and gifts. Don’t forget that Christmas will be here before you know it.\nOf course, there will be plenty of televisions tuned in to all of the college games, so you won’t miss a play. It sure sounds like fun.\nCruisers support our furry friends who need a helping hand\nThe Bastrop Area Cruisers hold an annual car show downtown in conjunction with the Veterans Day program. What you may not know is that last month, club members living in the Colony subdivision held their fifth annual Colony Car Show and Community Get Together.\nLike the November event, the show’s proceeds are donated locally. These profits went to the Bastrop County Animal Shelter in conjunction with the Friends of the Shelter.\nThere were 30 classic and special interest cars and three dogs from the shelter looking for new homes. Exhibitors competed for Participants’ and Peoples’ Choice awards. In addition to the funds raised by the Cruisers, Colony residents made donations of cash, food, blankets, and all sorts of pet supplies.\nBill and Claudia Heslep and Bruce Mungiguerra served up food and drink, and DJ Trey Heslep served up great music and trivia. Mary Szelag handled registrations and ballots. Friends of the Animal shelter were there including, Sara Axton, to answer questions and off course show off the dogs.\nBill Szelag presented awards and prizes, many of which were acquired by resident Peggy Colbert Colony Homeowners Property Manager Beverly Malke.\nAll of this hard work paid off. Event organizers later presented a check for $500 to Friends chair Marsha Poppy and shelter director Erica Thompson, in addition to the $200 donated at the event. Well done everyone!\nHistoric Homes Tour locations\nDecember 12 is the date for this year’s Lighted Christmas Parade sponsored by the Downtown Business Alliance as well as the 2015 Historic Homes Tour sponsored by the Bastrop County Historical Society.\nThis year, we can tour the J. H. Pearcy House at 1602 Pecan Street, the Reynolds House at 1108 Hill Street, the Perkins House at 502 Buttonwood Street, the Bush Home at 106 Bush Cove, the William Kesselus House at 1002 Walnut Street, and First United Methodist Church at the corner of Main and Farm Streets. Each locale will be sparkling with signs of the season, and docents will share the structure’s history.\nAdvance ticket sales begin on November 14 and may be purchased online until November 30 at BastropHolidayHomesTour.com, by mail, or by telephoning the Bastrop Museum and Visitor Center at 904 Main Street. For additional information, call the center at 512- 303-0057 or 512-303-0904. Tour admission is $15 per person. Accompanied children under 12 years of age are admitted free.\nVisitor Center News\nSarah Tompkins has taken over the reigns at the Bastrop Visitor Center as its new manager. Sarah is a Bastrop High School graduate, graphic artist, photographer, computer instructor, and was BHS Campus Activities Coordinator. I guess she gets her creative genes from her mother and Bastrop artist Lea Blue, owner of Blue Donkey Studio.\nWelcome Sarah, the new face of the Visitor Center. Good luck!\nUntil Next Week\nThat’s all for now. Until next week, be good to yourself. Let me hear from you by email at mooreaboutbastrop@yahoo.com so I can share the fun things that are going on in and around Bastrop.\nRemember: “I am not here as a public official, but as a citizen of a troubled world who finds hope in a growing consensus that the generally accepted goals of society are peace, freedom, human rights, environmental quality, the alleviation of suffering, and the rule of law.” President Jimmy Carter", "external_links": [], "published": "2015-10-22T05:00:00.000+03:00", "crawled": "2015-10-22T06:11:03.947+03:00", "highlightTitle": ""}