{"organizations": [], "uuid": "f68076c12c84930927f5e76c5824cf87902207a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ksl.com", "main_image": "http://img.ksl.com/slc/2573/257344/25734497.jpg", "site_section": "http://www.ksl.com//xml/294.rss", "section_title": "KSL / Sports Home / Local", "url": "http://www.ksl.com/?sid=36970641&nid=635&s_cid=rss-extlink", "country": "US", "title": "3 storylines heading into Utah-Arizona State matchup", "performance_score": 0, "site": "ksl.com", "participants_count": 1, "title_full": "3 storylines heading into Utah-Arizona State matchup", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T00:43:00.000+03:00", "replies_count": 0, "uuid": "f68076c12c84930927f5e76c5824cf87902207a0"}, "author": "Holli Joyce, KSL.com Contributor", "url": "http://www.ksl.com/?sid=36970641&nid=635&s_cid=rss-extlink", "ord_in_thread": 0, "title": "3 storylines heading into Utah-Arizona State matchup", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "3 storylines heading into Utah-Arizona State matchup By Holli Joyce, KSL.com Contributor | Posted Oct 16th, 2015 @ 3:43pm 1  \nSALT LAKE CITY — Believe it or not, it's the halfway point of the college football season. \nUtah's matchup against Arizona State Saturday may turn out to be one of the most crucial games of the year. \nHere are a few storylines heading into the game. Conference standings \nAs the season progresses, the Pac-12 South proves to be a windy road. The matchup between Utah (5-0, 2-0 Pac-12) and Arizona State (4-2, 2-1) can alter the standings. The Utes are at the peak of the Conference of Champions, while the Sun Devils stand in the shadows of the South Division leader. \nAfter being under the radar and off the charts during the preseason, Utah currently ranks No. 4 in The AP Poll where it received 16 first-place votes. It's the highest ranking the Utes have had in the regular season in program history. \nSenior receiver Kenneth Scott said despite the national attention, the team still feels like the underdog. \n\"There are a lot of doubters out there,\" he said. \"We'll continue to work hard.\" \nThe Sun Devils aren't in the Top 25, but they rank high in the conference in certain aspects of the game. The passing offense, led by quarterback Mike Bercovici, averages 267.3 yards per game, which is fourth in the Pac-12. Arizona State's defense is also fourth in the conference in rushing defense (138.8 yards per game) and total defense (382.8 yards per game). The Sun Devils held Colorado to 49 rushing yards and UCLA to just 62. \nAnd since the Sun Devils succeed in passing offense and rushing defense, the Utes need running back Devontae Booker — conference leader in rushing yards after contact (69.9) — to have a good game and the defense to win in the turnover margin. \nThe latter half of the season waits. Who will be at the top of the south leaderboard later on may be determined by this matchup. Utah to try to break the streak \nThe last time Utah defeated Arizona State was in 1976. The teams have played 11 times since then with the Sun Devils winning by an average of 21.2 points. \n\"There are two teams that we haven't been able to beat since we joined the conference, and Arizona State is one of them,\" Utah head coach Kyle Whittingham said. \nIt was 1973 when the Utes last beat the Sun Devils in Salt Lake City. Whittingham hopes Ute fans will help the team end the streak. \n\"We have them at our place, which is a plus. The environment last Saturday night was great,\" he said. \"The fans and atmosphere was as good as there is. We're hoping for a repeat of that this week to give us another home-field advantage.\" Game of inches \nLast season, 18th-ranked Utah and 15th-ranked Arizona State entered overtime at Sun Devil Stadium tied at 16. Utah kicker Andy Phillips made three field goal attempts in regulation, including a 50-yarder and a 44-yarder. But when it came time to win the game, Phillips missed. Zane Gonzalez ended up making a 36-yard field goal, giving the Sun Devils the 19-16 victory. \nAfter the game, Phillips said he misjudged the kick and explained the wind was blowing right to left. Utah called a timeout when he was lining up to kick. \n\"I played the next one more to the left. The wind caught ahold of it, and I should have gone with my instinct. It was just a misjudgment on my part,\" said Phillips. \nDespite the last two games with the Sun Devils being decided by a total of four points, the Utes will try to keep a close game out of the picture. All season they've won by an average of 17.2 points. \n\"It should be a great ballgame,\" said Whittingham. \nSaturday's game will air on ESPN at 8 p.m. MT with Mark Jones, Rod Gilmore and Quint Kessenich calling the game. About the Author: Holli Joyce Holli Joyce is a University of Utah communications graduate and enjoys keeping up with the Utah Utes, Utah Jazz and Seattle Seahawks. Follow her on Twitter @Holli_Alexa . 1 Pending", "external_links": [], "published": "2015-10-17T00:43:00.000+03:00", "crawled": "2015-10-17T02:44:24.673+03:00", "highlightTitle": ""}