{"organizations": [], "uuid": "2bf0b810f1ad630d47da1ee63b0ba86579a3c218", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailynews.com", "main_image": "http://www.dailynews.com/apps/pbcsi.dll/storyimage/LA/20151016/SPORTS/151019514/AR/0/AR-151019514.jpg?Maxh=1500&Maxw=1500", "site_section": "http://www.dailynews.com/los-angeles-kings", "section_title": "LA Kings hockey news and team sports coverage", "url": "http://www.dailynews.com/sports/20151016/la-kings-playing-catch-up-in-faster-smaller-nhl", "country": "US", "title": "LA Kings playing catch-up in faster, smaller NHL", "performance_score": 0, "site": "dailynews.com", "participants_count": 1, "title_full": "LA Kings playing catch-up in faster, smaller NHL", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "2bf0b810f1ad630d47da1ee63b0ba86579a3c218"}, "author": "Elliott Teaford", "url": "http://www.dailynews.com/sports/20151016/la-kings-playing-catch-up-in-faster-smaller-nhl", "ord_in_thread": 0, "title": "LA Kings playing catch-up in faster, smaller NHL", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kings defenseman Derek Forbort made his NHL debut Friday, the last of the 2010 first-round draft picks to play his first game in the league. He entered a different game than the one that was played when he was taken with the 15th overall selection.\nIt’s faster and smaller, and the Kings haven’t adapted. Not yet, anyway.\nNot judging by the way the San Jose Sharks, Arizona Coyotes and Vancouver Canucks outskated them in three consecutive losses to start the 2015-16 season. The Kings chased the Sharks, Coyotes and Canucks and never could catch up to their opponents.\nStanding 6-foot-4 and weighing 212 pounds, according to the Kings’ facts and figures, Forbort would seem to fit into the old vision of what an NHL defenseman should look like. He appears to be built to play a big game against big forwards.\nHow well he matched up against the Minnesota Wild, the Kings’ opponent Friday at Staples Center, was one of the game’s talking points. He played in place of the injured Matt Greene , a 6-3, 234 throwback to earlier days and nights in the NHL.\nYou know, say, two seasons ago, when the Kings outmuscled their opponents on their way to a second Stanley Cup championship in a three-season span. Perhaps as a counter to the Kings’ remarkable ability to physically dominate opponents, opponents have gone in a different direction.\nIt’s not just about players skating faster. It’s about passing the puck quicker, shifting it from one end of the rink to the other, from one side to the other in order to exploit defensive lapses. The puck travels a good deal faster than anyone can skate.\nAt least that’s the theory of Kings coach Darryl Sutter .\n“Well, the best way to be a fast team is moving the puck,” Sutter said the other day. “There’s not much difference in anybody’s speed now, if everybody went on the ice and skated. How fast they are, there’s not much difference. The key is how your back end moves the puck. It’s really important.\n“That’s the speed of the game now.”\nForbort, like Greene, is more of a bruiser than a puck-mover or a playmaker. His job is to clear bodies. That’s why the Kings drafted him. That’s why they brought him along slowly, keeping him in the AHL for two full seasons after he departed the University of North Dakota in 2013.\nHe can’t be a one-dimensional player, however. He can’t rely only on his brute strength. Neither can the rest of the Kings.\nTheir inability to generate offense by moving the puck out of their own zone, into neutral ice and then into the attacking end of the rink has been one of the biggest reasons for their 0-3 start to the season.\nAdvertisement\nThe Kings simply haven’t been able to string passes together fast enough to clear their own zone.\n“It hasn’t been good enough,” Kings defenseman Alec Martinez said. “Obviously, we’ve got to improve on our offense, but the only way to generate offensive opportunities is being good and quick and fast in your own zone, so we can get it into the forwards’ hands and let them go to work.”\n ", "external_links": ["http://twitter.com/ElliottTeaford", "http://www.hockey-reference.com/coaches/sutteda01c.html", "http://mn1-laweb.newscyclecloud.com/apps/pbcsi.dll/persbilde?Avis=LA&ID=421", "http://kings.nhl.com/club/player.htm?id=8474166", "http://www.hockey-reference.com/players/g/greenma01.html", "http://www.hockeydb.com/ihdb/stats/pdisplay.php?pid=123316"], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-17T23:04:06.739+03:00", "highlightTitle": ""}