{"organizations": [], "uuid": "4a4b82e9369dc767bad6772298b108e428f62883", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.operationsports.com", "main_image": "", "site_section": "http://www.operationsports.com/rss.xml", "section_title": "Operation Sports", "url": "http://www.operationsports.com/feature.php?id=2353", "country": "US", "title": "OOTP 16: NLDS Simulation", "performance_score": 0, "site": "operationsports.com", "participants_count": 1, "title_full": "OOTP 16: NLDS Simulation", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T21:00:00.000+03:00", "replies_count": 0, "uuid": "4a4b82e9369dc767bad6772298b108e428f62883"}, "author": "MMChrisS", "url": "http://www.operationsports.com/feature.php?id=2353", "ord_in_thread": 0, "title": "OOTP 16: NLDS Simulation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "OOTP 16: NLDS Simulation Submitted on: 10/09/2015 by \nThe Chicago Cubs were seeking the first step toward ending a 100-year-plus championship drought. The Pittsburgh Pirates were hoping to win their first playoff game since 1992, after two Wild Card play-in game losses in 2013 and 2014. Chicago prevailed on the road, shutting down Pittsburgh in a 4-0 win that sent them to the NLDS against the St. Louis Cardinals. \n(Did we mention that the NL Central had the top three records in Major League Baseball this year? Only one of those teams will make it to the NLCS. Wow.) \nMeanwhile, the New York Mets and Los Angeles Dodgers knew they would be matched up once the regular season ended, and they’re ready to get started in their NLDS on Friday. New York hasn’t been to the postseason since 2006, while LA has been there the past two years and six times since 2004 but hasn’t played in a World Series since they won it all in 1988. \nSo, how does Out of the Park Baseball 16 think will end up in the NLCS? As with the two AL Division Series , we simmed each series five times and created a composite of the results to arrive at our prediction. We were helped by a handy option that was added to a special internal build of Out of the Park Baseball 16: a Game Importance dropdown that tells the AI if it should treat the sims as if they’re regular games or do-or-die affairs. It will be available to the public in next year’s OOTP 17. \nThis is what we think will likely happen in both series: Chicago Cubs vs. St. Louis Cardinals \nThis one doesn’t look good, Chicago Cubs fans: St. Louis won three of the five series and did so in convincing fashion, while Chicago had to go the distance to win its two series. The second sim, which lasted five games and had each team scoring just 14 runs, was a tight back-and-forth series that saw two shutouts and a save by the winning team’s closer in each game. \nIt’s hard to believe that Chicago’s offense will be stymied this much, but St. Louis has stellar starting pitching and a lineup with the potential to score a lot of runs. Unfortunately for Chicago, Jake Arrieta can’t start every game. \nHere’s the high level breakdown. Click a sim to see its team and player stats. Series", "external_links": [], "published": "2015-10-09T21:00:00.000+03:00", "crawled": "2015-10-09T23:51:27.168+03:00", "highlightTitle": ""}