{"organizations": [], "uuid": "e25677354554a882069a429038524fb1dd13cb04", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wdtimes.com", "main_image": "http://wdtimes.com/content/tncms/live/global/resources/images/_site/DefaultWDT100.jpg", "site_section": "http://www.wdtimes.com//search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&nsa=eedition&c[]=sports/golf,sports/golf/*&f=rss", "section_title": "Watertown Daily Times Online  - sports/golf,sports/golf/", "url": "http://www.wdtimes.com/sports/golf/article_6cbc34f4-5496-5afa-a05d-92bc517a177f.html", "country": "US", "title": "Golf Capsules", "performance_score": 0, "site": "wdtimes.com", "participants_count": 1, "title_full": "Golf Capsules", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T06:15:00.000+03:00", "replies_count": 0, "uuid": "e25677354554a882069a429038524fb1dd13cb04"}, "author": "The Associated Press", "url": "http://www.wdtimes.com/sports/golf/article_6cbc34f4-5496-5afa-a05d-92bc517a177f.html", "ord_in_thread": 0, "title": "Golf Capsules", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Golf Capsules Associated Press | 0 comments \nNAPA, Calif. (AP) — Emiliano Grillo of Argentina won his PGA Tour rookie debut Sunday at the Frys.com Open by holing a 25-foot birdie putt on the 18th for a 3-under 69, and then making the most out of a second chance in the playoff to beat Kevin Na. \nNearly as impressive as his closing birdie was the way the 23-year-old Argentine bounced back from a shocking miss. Grillo had a 3-foot birdie putt on the first playoff hole to win and was stunned when it caught the left lip and spun away. Then, he drove into the fairway bunker on the 18th on the second extra hole with Na in the fairway. \nThe next mistake belonged to Na. He used driver off the fairway for the second time and hooked it behind a tree, leaving him little chance of getting his third shot on the green. Na wound up with a bogey. Grillo hit a bold approach shot over the edge of a bunker to just inside 10 feet. Needing two putts for the win, he made it for birdie. \nEarlier this year, Grillo missed a short birdie putt to win the Puerto Rico Open, and wound up losing in a playoff. Grillo has won his last two tournaments in thrillers. He made a 25-foot birdie putt on final hole of the Web.com Tour Championship two weeks ago. \nNa got up-and-down with a 6-foot putt on the 18th in regulation for a 70 to force a playoff. \nJason Bohn (70), Justin Thomas (69) and Tyrone Van Aswegen of South Africa (68) all finished one shot out of the playoff. \nLPGA KEB HANA BANK CHAMPIONSHIP \nINCHEON, South Korea (AP) — Lexi Thompson broke out of a crowded pack to win the LPGA KEB Hana Bank Championship for her second victory of the year and sixth overall. \nThe 20-year-old American closed with a 3-under 69 to beat Taiwan's Yani Tseng and South Korea's Sung Hyun Park by a stroke on Sky 72's Ocean Course. \nThompson finished at 15-under 273, earned $300,000 and is projected to jump from fifth to fourth in the world ranking. She also won in July in Michigan. \nLydia Ko missed a chance to take the top spot in the world from South Korean star Inbee Park, finishing with a 72 that dropped the 18-year-old South Korean-born New Zealander into a tie for fourth at 13 under with South Korea's Amy Yang and American Gerina Piller. \nYang birdied the final nine holes for a 62. She became the first player in tour history to close with nine straight birdies, tied the record for consecutive birdies set by Beth Daniel in 1999, broke the nine-hole mark for relation to par at 9 under and matched the record for the lowest total at 27. Yang also tied the course record set by Sung Hyun Park on Thursday. \nSAN ANTONIO CHAMPIONSHIP \nSAN ANTONIO (AP) — Bernhard Langer rallied to win the San Antonio Championship on Sunday for his second victory of the year and 25th overall on the Champions Tour. \nThe 58-year-old German star birdied the final two holes — making a 16-footer on the par-4 18th — for a 7-under 65 and a three-stroke victory over Scott Dunlap. \nLanger won on TPC San Antonio's AT&T Canyons Course after losing playoffs in the event to David Frost in 2012 and Kenny Perry in 2013. In June in Massachusetts, Langer successfully defended his Senior Players Championship title for his fifth senior major victory. \nThree strokes behind defending champion Michael Allen and Scott McCarron entering the round, Langer had eight birdies and one bogey Sunday to finish at 12-under 204. \nDunlap shot a 68. Allen and McCarron each shot 70 to tie for third at 8 under. \nLanger earned 270 Charles Schwab Cup points to pull within 66 points of leader Colin Montgomerie with two events left. Montgomerie tied for 15th at 3 under after a 72. Jeff Maggert, 39 points behind Montgomerie, withdrew during the second round because of a lingering left calf injury. \nFIJI INTERNATIONAL \nSUVA, Fiji (AP) — American Matt Kuchar shot his second straight 3-under 69 for a four-stroke victory in the Fiji International. \nThe seven-time PGA Tour winner finished at 4-under 284 at Natadolo Bay in the event sanctioned by the OneAsia and Australasian tours. His father, Peter, served as his caddie. \nComing off the United States' Presidents Cup victory last week in South Korea, opened with rounds of 74 and 72 in high wind, and took a two-stroke lead into the final round. \nLocal favorite Vijay Singh shot a course-record 65 to tie for third at 1 over with New Zealand's Ryan Fox (67) and Australia's Nick Cullen (68). The 52-year-old Singh, a three-time major champion, designed the course. He opened with a 78 in the windy first round. \nPORTUGAL MASTERS \nVILAMOURA, Portugal (AP) — England's Andy Sullivan won the Portugal Masters by a tournament-record nine strokes, closing with a 5-under 66 to finish at 23-under 261. \nSullivan entered the final round with a five-stroke at rain-soaked Oceanico Victoria course. He has three European Tour victories this season, also wining the South African Open and Joburg Open. \nEngland's Chris Wood was second after a 66. \nMACAO OPEN \nMACAO (AP) — Australia's Scott Hend won the Macao Open for the second time in three years, beating defending champion Anirban Lahiri and Chiragh Kumar by three strokes. \nHend closed with a 5-under 66 for a tournament-record 20-under 264 total at Macau Golf and Country Club in the Asian Tour event. Lahiri, coming off his first Presidents Cup appearance, finished with a 66, Fellow Indian player Kumar had a 65. \nSYMETRA TOUR CHAMPIONSHIP \nDAYTONA BEACH, Fla. (AP) — Thailand's Sherman Santiwiwatthanaphong won the Symetra Tour Championship, and Brianna Do finished second in the season-ending event to earn an LPGA Tour card. \nThe 18-year-old Santiwiwatthanaphong birdied the par-5 18th for a 5-under 67 and a one-stroke victory. \nShe had a 14-under 274 total on LPGA International's Jones Course and earned $22,500 to finish 20th on the money list with $40,614. The top 10 on the money list earned LPGA Tour cards. \nDo closed with a 69. The former UCLA player earned $13,840 to jump from 12th to third on the money list with $64,877. Last week, she also finished second to go from 18th to 12th. \nAnnie Park topped the money list with $68,673 in only 11 starts. The former University of Southern California player won three times and swept the player of the year and rookie of the year awards. \nGiulia Molinaro was second at $68,632, followed by Do, Daniela Iacobelli ($62,692), Dani Holmqvist ($62,160), Lee Lopez ($61,731), Alejandra Llaneza ($61,289), Vicky Hurst ($57,814), Casey Grice ($55,621) and Rachel Rohanna ($53,867). Rohanna edged Haruka Morita-WanyaoLu by $284 for the final LPGA Tour card. \nSENIOR PGA PROFESSIONAL NATIONAL CHAMPIONSHIP \nSEASIDE, Calif. (AP) — John DalCorobbo won the Senior PGA Professional National Championship to top the 35 qualifiers for the Senior PGA Championship. \nDalCorobbo, the 51-year-old PGA assistant professional at Brickyard Crossing in Indianapolis, closed with a 3-under 69 on the Bayonet Course for a one-stroke victory over PGA Tour winner Jim Carter. \nDalCorobbo finished at 11-under 277 and earned $20,000. \nCarter, from Scottsdale, Arizona, finished with a 70. \nThe Senior PGA Championship is in May at Harbor Shores in Benton Harbor, Michigan.", "external_links": [], "published": "2015-10-19T06:15:00.000+03:00", "crawled": "2015-10-20T06:06:49.164+03:00", "highlightTitle": ""}