{"organizations": [], "uuid": "affd5f7a4f8ff73f060ef624470fffdb087fc399", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.baltimoresun.com", "main_image": "http://www.trbimg.com/img-5622c8ea/turbine/ph-ac-cs-rb-green-feature-101815-20151017", "site_section": "http://feeds.baltimoresun.com/baltimoresun/sports/college/rss2.0.xml", "section_title": "College Sports - Baltimore Sun", "url": "http://www.baltimoresun.com/sports/college/ph-ac-cs-rb-green-feature-101815-20151017-story.html", "country": "US", "title": "Officer shifts duties with Mids", "performance_score": 0, "site": "baltimoresun.com", "participants_count": 1, "title_full": "Officer shifts duties with Mids", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T23:51:00.000+03:00", "replies_count": 0, "uuid": "affd5f7a4f8ff73f060ef624470fffdb087fc399"}, "author": "Bill Wagner", "url": "http://www.baltimoresun.com/sports/college/ph-ac-cs-rb-green-feature-101815-20151017-story.html", "ord_in_thread": 0, "title": "Officer shifts duties with Mids", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Because you can't hack a sextant (Tim Prudente) \nWhat Green has never done is coach football at any level. So suddenly being thrust onto a Division I staff is a daunting responsibility. \n“I’m a rookie coach in a room full of professionals, but they’ve been very, very kind to me over the last few months,” Green said. “They accept all my dumb questions and comments. They take the time to sit down with me and help me understand things. All the coaches have taken me under their wing and helped me learn this job step-by-step.” \nOutside linebackers coach Justin Davis is about four years younger than Green, but has 13 years of collegiate coaching experience. Davis has been on the front line of getting Green up to speed since the newcomer is helping him with the outside linebackers. \n“RB jumped in with both feet and has hit the ground running. He’s been very diligent taking notes in meetings and asking questions of all the coaches. It didn’t take long for him to really get going in the job,” Davis said. “Anyone who knows Navy football knows that RB was a darn good player when he was here. You take a good football player and you know he understands the game. Factor in the leadership and character that RB brings as a Marine Corps officer and you have the makings of a good coach.” \nDavis laughed when asked if Green was tentative and unsure of himself at first. \n“He’s a Marine now. He’s not afraid to do anything. RB did a really did a nice job of catching himself up to speed,” Davis said. “Like I said, the man is a Marine. You ask him to take on a role and he’s going to get the job done.” \nGreen has discovered coaching college football is a lot more time-consuming and entails far more effort than he ever imagined. \n“As a player you think you know everything. You think the coaches are working three hour days; that they are hanging out while you are working out; that they yell and scream at you and that’s all they do,” he said. “I have learned in a very short time that coaching is a lot of work. You spend a great number of hours in the office here preparing for games. And it’s a lot tougher than folks know. There are a lot of man hours that go into preparing for a football game.” \nBy far the biggest challenge for Green has been indoctrinating himself in the language of football coaches, who have a lingo all their own. Green admits his head was spinning for a few weeks as he listened to the other assistants in defensive meetings. \n“They’re talking about all these different fronts and spitting out numbers because this stuff is all second nature to them,” he said. “I’m having to learn everything from scratch, starting with the terminology. What fronts go with what coverages, why you don’t want to run certain coverages against specific offensive formations. It’s a lot to process and digest.” \nActually, the knowledge Green gained as a defensive back at Navy has proven quite helpful when working with the outside linebackers, who often must drop into coverage. During the individual drills session of practice, Davis has Green tutoring the strikers since they are required to cover slot receivers and tight ends a bit more than the raiders. \n“I actually really like having Colonel around. He played defensive back when he was here and the strikers are doing a lot more coverage stuff this year than we’ve been doing so it’s good to have him around tell us how to make certain reads, how to react in certain situations. It’s really helpful,” junior outside linebacker Josiah Powell said. \nNiumatalolo praised Green for working hard to learn the defensive package, but isn’t overly concerned about his coaching expertise at this point. The eighth-year head coach didn’t tab Green to join the coaching staff so he could break down spread offenses. \n“More than the Xs and Os, what RB brings to the table right now is our culture. Just understanding The Brotherhood and who we are, nobody is more qualified,” Niumatalolo said. “RB is a great leader of men. He was one of the best cornerbacks we’ve ever had here at Navy. He went on to serve in the Marine Corps and reach the rank of Lieutenant Colonel. I just think the wealth of knowledge and experience that he brings to the military side of it are going to pay great dividends for our players.” \nIn some respects, it’s like having a young, eager and energetic graduate assistant on the staff. However, this graduate assistant brings quite a bit of wisdom, not to mention military pedigree. \n“It’s exciting for me to see RB out here on the field. You can tell he is enjoying the job and having fun,” Niumatalolo said. “Plus, it’s kind of cool for me to be able to boss around a Lieutenant Colonel in the Marine Corps.” \nGreen joked that when he first started most of the players knew more about the X’s and O’s than he did. However, that hasn’t stopped the rookie coach from putting in extra time studying film and reviewing the playbook. \n“I was warned very early when Coach Niumatalolo presented me with this opportunity that I would catch the bug, and I surely have. So much so that my wife is like ‘Enough of the film work. It’s time to get to bed.’ It is addictive and captures you and wants you to do more,” Green said. “I am fully invested into the coaching program and I’m going to work my butt off to do a good job for Coach Niumatalolo and the players.” \nGreen thinks his previous role as director of player development has helped with the transition to assistant coach. \n“Because I had a relationship with the players that went far beyond what the other coaches are able to do,” he said. “I had relationships with players that were personal. They told me stuff they might not have told their position coaches. So even though I am now a coach, they still respect me as a Marine and know that I am always there for them.” \nPowell agreed with that assessment: “I always saw Colonel as a mentor, somebody I could look up to and learn from. Having him as a coach hasn’t really changed much.” \nAbout the only problem so far is that some players have struggled with how to address the new assistant, whether to call him Colonel Green or Coach Green. \nGreen has no intentions of abruptly retiring from the Marine Corps and getting into the coaching profession. Most likely, the father of twin boys will resume his role of director of player development next year. \n“It’s been an awesome experience. This is a once-in-a-lifetime deal and I am taking full advantage of it. I’m having a ball!” Green said. \nTULANE @ NAVY", "external_links": [], "published": "2015-10-17T23:51:00.000+03:00", "crawled": "2015-10-18T20:03:32.417+03:00", "highlightTitle": ""}