{"organizations": [], "uuid": "05f99b801677e256b36e3f2a478c3e2b9e4d0c2f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "http://www.bostonherald.com/sites/default/files/media/2010/04/21/100115goodellfootball.jpg", "site_section": "http://bostonherald.com/sports", "section_title": "Sports | Boston Herald", "url": "http://bostonherald.com/sports/patriots_nfl/nfl_coverage/2015/10/betbox_patriots_off_but_still_on_foes_minds", "country": "US", "title": "Betbox: Patriots off, but still on foes' minds", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "Betbox: Patriots off, but still on foes' minds | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "05f99b801677e256b36e3f2a478c3e2b9e4d0c2f"}, "author": "Herald Staff", "url": "http://bostonherald.com/sports/patriots_nfl/nfl_coverage/2015/10/betbox_patriots_off_but_still_on_foes_minds", "ord_in_thread": 0, "title": "Betbox: Patriots off, but still on foes' minds", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The gathering of antsy and petrified NFL owners was becoming a bit raucous, and the Patriots were once again the subject of their ire.\n“What are ya going to do about them,” was the collective command to commissioner Roger Goodell about the Patriots, who have run roughshod over three opponents with the revenge of Rambo in their eyes.\nGoodell tossed a properly inflated football in the air, grabbed it deftly, and said, “What do you want me to nail them on?”\nA hush consumed the room. There were no direct retorts, just murmurs of “don’t know what you mean,” “leave me out of it” and “I know nuthin’ ” could be heard.\nYes, “paranoia strikes deep, into NFL hearts it will creep,” because the Patriots just keep on winning. The members of the Happy Millionaires Gridiron Club are being threatened with big-time embarrassment on the field, worse any day than a 51-17 beating or a comeuppance in a federal courtroom.\n“Are they doing anything wrong, Roger? What can you do? Please find something on them!”\nGoodell pushed down on his air pump with a flummoxed look, the results of the Patriots’ 3-0 start thumping in his empty head like a Gronk spike. The Patriots have been caught doing nothing wrong or bad or illegal, he thought.\n“Something’s got to be done quickly,” a suddenly perturbed Jerry Jones piped in. “The Pats are coming to Dallas next week off a bye. What fury may they unfurl upon us. And I have to feed Bob Kraft a good ole Texas barbecue, too.”\nYes, panic has engulfed NFL owners. Fear, too. The Pats look unstoppable.\nGoodell then consoled the agitated, reminding them that the Patriots don’t play this weekend.\nOn the field . . . no. In NFL heads . . . yes.\nUndeflatable:\nN.Y. Jets (-1 1 ⁄ 2 ) vs. Miami, at London — Coach Joe Philbin said of his 1-2 Dolphins: “We’re not getting 53 new players.” One new coach will do. Jets, 24-10 .\nJacksonville at Indianapolis (-9) — Coach Chuck Pagano said to his 1-2 Colts: “It was one of the greatest wins (last week) I’ve ever been a part of.” Oh, man, this guy hasn’t lived. Colts, 33-17 .\nHouston at Atlanta (-6 1 ⁄ 2 ) — Soak up all the enjoyment while you can Falcons, this week, too. Falcons, 27-23 .\nCarolina (-3) at Tampa Bay — Grow up, Cam Newton. Your team soon will be 4-0 and you’re crybabying about non-calls. Panthers, 23-13 .\nN.Y. Giants at Buffalo (-5 1 ⁄ 2 ) — The Bills are all pumped up again, talking and walking the good game. Then this. Giants, 22-20 .\nOakland (-3) at Chicago — The “Commitment To Excellence” motto is revived back in the Oakland madhouse. Raiders, 30-16 .\nPhiladelphia (-3) at Washington — The Redskins are like everyone else in DC: They don’t know what they’re doing. Eagles, 31-16 .\nKansas City at Cincinnati (-4) — This Bengals hysteria has got to end. Chiefs, 30-27 .\nCleveland at San Diego (-7 1 ⁄ 2 ) — The poor Chargers are just never gonna get it done. But the Browns arrive at the right time. Chargers, 32-17 .\nGreen Bay (-8) at San Francisco — Whatever happened to Colin Kaepernick? Packers, 30-20 .\nMinnesota at Denver (-6 1 ⁄ 2 ) — Peyton Manning has gone from the shotgun to the pistol. This week, he can’t handle a peashooter. Vikings, 24-20 .\nSt. Louis at Arizona (-7) — Something’s getting real hot in the desert and it’s not just the sun and sand. Cardinals, 29-10 .\nDallas at New Orleans (4 1 ⁄ 2 ) — The Cowboys lost their quarterback to injury; the Saints lost their QB to wear and tear. Cowboys, 28-23 .\nDetroit at Seattle (-10 ) — Nothing like some cowardly Lion to feast upon. Seahawks, 37-13 .\nLast week: 9-7-0.\nSeason: 23-24-1.", "external_links": [], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-02T09:22:28.108+03:00", "highlightTitle": ""}