{"organizations": [], "uuid": "55010858aa6f7c87a1f413a1eb8239b9368ee5b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.baltimoresun.com", "main_image": "http://www.trbimg.com/img-56209a88/turbine/la-sp-ucla-stanford-20151016", "site_section": "http://feeds.baltimoresun.com/baltimoresun/sports/college/rss2.0.xml", "section_title": "College Sports - Baltimore Sun", "url": "http://www.baltimoresun.com/sports/college/la-sp-ucla-stanford-20151016-story.html", "country": "US", "title": "Bruins ignore work-smart rule in 56-35 loss to Cardinal", "performance_score": 0, "site": "baltimoresun.com", "participants_count": 1, "title_full": "Bruins ignore work-smart rule in 56-35 loss to Cardinal", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T09:57:00.000+03:00", "replies_count": 0, "uuid": "55010858aa6f7c87a1f413a1eb8239b9368ee5b2"}, "author": "Chris Foster", "url": "http://www.baltimoresun.com/sports/college/la-sp-ucla-stanford-20151016-story.html", "ord_in_thread": 0, "title": "Bruins ignore work-smart rule in 56-35 loss to Cardinal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "var ssaUrl = ('https:' == document.location.protocol ? 'https://' : 'http://') + 'pixel.sitescout.com/iap/0ea84626951144d2';new Image().src = ssaUrl;\"/> College Football Bruins ignore work-smart rule in 56-35 loss to Cardinal Christian McCaffrey, Ishmael Adams Tony Avelar / AP \nStanford running back Christian McCaffrey runs past UCLA defensive back Ishmael Adams for a touchdown during the first half on Thursday. \nStanford running back Christian McCaffrey runs past UCLA defensive back Ishmael Adams for a touchdown during the first half on Thursday. (Tony Avelar / AP) \nThey came. They saw. They got conquered. \nIn other words, UCLA played Stanford on Thursday night. \nThis has become a fall tradition for the Bruins, with the emphasis on “fall.” The Cardinal’s 56-35 victory at Stanford Stadium was its eighth consecutive over UCLA. No other team has had a longer streak. The 56 points were the most the Bruins have given up since Oregon scored 60 in 2010. \nFor those monitoring the situation -- and a portion of UCLA fans certainly must be -- it was another lost opportunity to ascend to the Pac-12 Conference’s elite. The Bruins have a 33-13 record in three-plus seasons under Coach Jim Mora. That includes three consecutive victories over rival USC. \nYet, the No. 18 Bruins (4-2 overall, 1-2 in Pac-12 play) have been unable to beat Stanford and have lost six consecutive games to Oregon. The Ducks have won four Pac-12 titles in the last six seasons. Stanford has won the other two. \nDown south, they call this Clemson-ing, a slang phrase that refers to Clemson’s inability to meet expectations each season. Out west, the Bruins seem like UCLemson. \nMora pushed aside the question about mounting losses against the conference’s power programs. \n“The only people who harp on the past, really, are fans and media because it is something to talk about, because it is there and you can’t deny it,” Mora said. \nThere was no denying this one. Stanford rolled up 441 yards and had 56 points on the scoreboard before the third quarter had ended. \nAsked whether he saw anything that showed the Bruins were closer to clearing this hurdle, Mora said, “We will continue to work hard. I don’t know that we’re closer. We weren’t closer tonight.” \nNot by a long shot. \nThis was business as usual for the No. 15 Cardinal (5-1, 4-0), at least against the Bruins. \nQuarterback Kevin Hogan threw for 131 yards and three touchdowns. Christian McCaffrey ran over, around and past the Bruins for career-high 243 yards rushing, becoming the first player to top 200 yards against UCLA since Oregon’s Michael James ran for 219 in 2011. The Stanford defense intercepted two passes from freshman quarterback Josh Rosen. \nMora was left in a downcast demeanor afterward. He repeated several times that the Bruins have “worked hard” and will continue to “work hard.” \nBut where the Bruins go from here remains to be seen. They left Palo Alto with serious questions. \n“You go back and look at everything very critically, looking at yourself first,” Mora said. “There is no magical formula. We are going to continue to recruit great players, coach them up best we can and send them out there and hope we break through.” \nThat formula has not worked against Stanford so far. The Bruins are 0-5 against the Cardinal in four seasons under Mora. \nNothing demonstrated the Bruins’ futility, and the Cardinal’s dominance, more than a third-quarter touchdown pass from Hogan to Francis Owusu. On the play, UCLA’s Jaleel Wadood was called for pass interference in the end zone. Owusu was able to reach around Wadood to grab the ball and then maintained possession as he hit the ground by trapping the ball against Wadood's back. \nIt was checkmate, giving the Cardinal a 42-17 lead. \nThe Cardinal had 310 yards rushing. It was a spotlight moment on national television for McCaffrey. He toppled Toby Gerhart’s school single-game rushing record of 219 yards by the end of the third quarter. \nWhat hurt UCLA more was McCaffrey getting to the end zone four times. That last was a 70-yard run in the third quarter for a 49-20 lead. \n“McCaffrey is a great player,” Mora said. “He’s a heck of a player. He may be a little better in person than on film.” \nThis, though, was hardly a new experience in Pac-12 play this season for the Bruins. They have lost two of their best run defenders -- linebacker Myles Jack and defensive tackle Eddie Vanderdoes -- to season-ending injuries. Arizona rushed for 353 yards and Arizona State 192 in the two previous games. \n“We came out of [training] camp with a certain personnel group and guys playing spots and feeling very comfortable,” Mora said. “We’re trying to reorganize.” \nMistakes hurt the Bruins in an exhausting first quarter. \nA one-yard reception by Jordan Payton appeared to give UCLA a first down on its first drive. But Payton was called for pass interference. Rosen lofted a weak throw toward the sideline on the next play. Stanford’s Alijah Holder intercepted the pass, and then zigzagged 31 yards for a touchdown. \nUCLA had a touchdown wiped out by an illegal formation penalty, which came after the Bruins had taken a timeout. They settled for a 36-yard field goal by Ka’imi Fairbairn. \nMcCaffrey returned the kickoff 96 yards to set up a four-yard touchdown pass from Hogan to Austin Hooper for a 14-3 lead. \nRosen answered with a 70-yard touchdown pass to Darren Andrews on UCLA’s next play. \nBut the Bruins were unable to stay in lockstep. UCLA went three and out on three consecutive possessions in the second quarter and trailed by 18 points at halftime, 35-17. \nIt left the Bruins, and their fans, a whole half to ponder when they might be as good as Stanford. \nchris.foster@latimes.com", "external_links": [], "published": "2015-10-16T09:57:00.000+03:00", "crawled": "2015-10-17T19:55:17.624+03:00", "highlightTitle": ""}