{"organizations": [], "uuid": "26da5c6cd049ad960dbc8092a6f432ab5cca94b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "indiatoday.intoday.in", "main_image": "http://media2.intoday.in/indiatoday/images/stories/younis-story_305_101715085517.jpg", "site_section": "http://indiatoday.intoday.in/rss/article.jsp?sid=41\r", "section_title": "India Today| Sports", "url": "http://indiatoday.intoday.in/story/1st-test-bad-light-foils-england-run-chase-against-pakistan/1/501410.html", "country": "IL", "title": "1st Test: Bad light foils England run chase against Pakistan", "performance_score": 0, "site": "intoday.in", "participants_count": 0, "title_full": "1st Test: Bad light foils England run chase against Pakistan", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T18:26:00.000+03:00", "replies_count": 0, "uuid": "26da5c6cd049ad960dbc8092a6f432ab5cca94b6"}, "author": "", "url": "http://indiatoday.intoday.in/story/1st-test-bad-light-foils-england-run-chase-against-pakistan/1/501410.html", "ord_in_thread": 0, "title": "1st Test: Bad light foils England run chase against Pakistan", "locations": ["Pakistan", "England"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Younis Khan", "Abu Dhabi"], "text": "Cricket 1st Test: Bad light foils England run chase against Pakistan Bad light ended England's dramatic run chase on Saturday as the first Test against Pakistan ended in a draw. AP | Abu Dhabi, October 17, 2015 | UPDATED 20:56 IST Mail A+ A- Younis Khan plays a shot during the first Test against England. (AP Photo) \nBad light ended England's dramatic run chase on Saturday as the first Test against Pakistan ended in a draw. England needed 99 in a possible 19 overs to win at Zayed Stadium after a brilliant spell by legspinner Adil Rashid, who picked up 5 for 64 as Pakistan were bowled out for 173 in their second innings. \nWhen umpires called off play, England were 74 for 4 in 11 overs, needing 25 more runs to win. Joe Root was unbeaten on 33 and Ian Bell on five. \nPakistan captain Misbah-ul Haq started with spinners Zulfiqar Babar and Shoaib Malik, who claimed two wickets each, and it was never going to be an easy chase for England. Almost every fielder was placed on the boundary and Pakistan took their time between balls and overs. \nEngland had earlier declared their first innings at 598 for 9 for a 75-run lead. After four days of insipid cricket dominated by the batsmen, the bowlers finally came to the party on the final day as 15 wickets fell, compared to 16 wickets over the first four days. \nAn early double strike by fast bowler James Anderson, followed by a superb piece of fielding by Ben Stokes to run out Mohammad Hafeez, set the tone of England's performance as Pakistan was reduced to 47 for 3. \nMasood played on to Anderson again, but unlike the first day when a slower bouncer hit him on the helmet before rolling onto the stumps, it was off the toe of his bat this time as he tried to defend. \nFour balls later a bouncer from Anderson reared up at Malik and all he could do was fend it off to Jonny Bairstow at short-leg. Hafeez was third to depart, a victim of Stokes' brilliance in the field. The batsman pushed Rashid's delivery to point and there was a bit of hesitation as they set off for a run. Stokes swooped on the ball, picked it up with his left hand, transferred it to his right and hit the wicket at the non-striker's end in one action. \nHowever, veteran players Younis Khan and Misbah put together 66 runs for the fourth wicket, which seemed to put Pakistan on the path to safety. Misbah was lucky to survive on 19, with the score on 87 for 3. Reviewed for a bat-pad catch by Stokes off Anderson at gully, the TV umpire found there was no bat involved. However, if the appeal had been for an lbw, the Pakistan captain would have been given out. \nYounis finally lost patience in the 42nd over, when he tried to hoist an away-spinning delivery from Rashid to Stokes at cover. It was the legspinner's first wicket in Test cricket after recording first innings figures of 0 for 163. \nRashid started bowling with more confidence and soon got his second wicket when first-inning centurion Asad Shafiq edged to wicketkeeper Jos Buttler for six with the score on 139. \nBut the big blow was delivered by Misbah's wicket, the sixth man to go with the score on 159. The captain had a rush of blood, stepped out against Moeen Ali and missed the line completely to be bowled for 51. \nRiaz (1) and Zulfiqar (1) followed Misbah in quick succession. Earlier, Cook called in his last pair after 45 minutes of batting, with Stuart Broad not out on 17 and Anderson on three. Only one England wicket fell in the morning, Rashid clean bowled by Imran Khan's in-cutter for 12 with the score on 590. \nPakistan has now played eight Test matches at the Zayed Stadium in Abu Dhabi, winning four and drawing four. The second Test in the three-match series starts at Dubai International Stadium on Oct. 22.  ", "external_links": [], "published": "2015-10-17T18:26:00.000+03:00", "crawled": "2015-10-17T18:50:16.305+03:00", "highlightTitle": ""}