{"organizations": ["NHL", "New Jersey Devils", "Philadelphia Flyers", "AP", "Know Flyers"], "uuid": "092721f3bc925874608623102659e193f2e9d927", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.westernmassnews.com", "main_image": "http://images.worldnow.com/AP/images/8950211_G.jpg", "site_section": "http://www.cbs3springfield.com/category/13566/national-sports?clienttype=rss", "section_title": "WSHM-TV - National Sports - Headline", "url": "http://www.westernmassnews.com/story/30190929/flyers-hope-gamble-on-college-coach-hakstol-pays-off", "country": "US", "title": "Flyers hope gamble on college coach Hakstol pays off", "performance_score": 0, "site": "westernmassnews.com", "participants_count": 0, "title_full": "Flyers hope gamble on college coach Hakstol pays off", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T00:21:00.000+03:00", "replies_count": 0, "uuid": "092721f3bc925874608623102659e193f2e9d927"}, "author": "", "url": "http://www.westernmassnews.com/story/30190929/flyers-hope-gamble-on-college-coach-hakstol-pays-off", "ord_in_thread": 0, "title": "Flyers hope gamble on college coach Hakstol pays off", "locations": ["Czech Republic", "Newark"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Schultz", "Jakub Voracek", "Sam Gagner", "Dave Hakstol", "Hakstol", "Wayne Simmonds", "Brayden Schenn"], "text": "In the Know Flyers hope gamble on college coach Hakstol pays off (AP Photo/Rich Schultz). Philadelphia Flyers coach Coach Dave Hakstol looks on with players Brayden Schenn (10), Wayne Simmonds (17) and Sam Gagner (89) during the third period against the New Jersey Devils in an NHL preseason hockey game in Newark, N... (AP Photo/Rich Schultz). Philadelphia Flyers right winger Jakub Voracek (93) of the Czech Republic is congratulated by center Brayden Schenn (10) after scoring during the third period against the New Jersey Devils in an NHL preseason hockey game in New... By DAN GELSTONAP Sports Writer \nPHILADELPHIA (AP) - There are few sure things in Philadelphia this season and the biggest unknown is calling the shots from the bench. \nThe Flyers skipped the coaching retread carousel and made an unthinkable hire, plucking Dave Hakstol out of the college ranks to become their coach. Hakstol did boast one of the top collegiate resumes at the University of North Dakota, reaching the Frozen Four seven times over 11 seasons. \nThe college-to-pros move in the NHL is almost unheard of - he's the first to make the jump since Bob Johnson went from the University of Wisconsin to the Calgary Flames in 1982. \nHakstol has as many questions to answer about himself as he does his own team: \nCan he handle the 82-game grind? Can he work with veteran, established players and develop young talent? Can he accept pressure from the fans, media, the strain of a Stanley Cup drought and press on with confidence in his own style? \nFlyers general manager Ron Hextall thinks so. And Flyers chairman and founder Ed Snider said his team should be in the mix for a playoff berth out of the Eastern Conference. \n\"I think that I have a lot of faith in Ron Hextall who has a lot of faith in Hakstol, and quite frankly, I'm looking for big things,\" he said. \"I think we're going to turn this team around and I think we're going to be a playoff team this year.\" \nHakstol inherits some talent. Jake Voracek and team captain Claude Giroux spent most of the season in the hunt for an NHL scoring title and each finished with some stout stats: Voracek had 22 goals and 81 points and Giroux had 25 goals and 73 points. Goalie Steve Mason kept the Flyers in games when the offense couldn't bail them out. \nThey weren't enough to make a serious run at the playoff or help coach Craig Berube keep his job after only two seasons. The Flyers have missed the playoffs two times in a three-season span for the first time since they missed it five straight seasons from 1989-1994. \n\"We have too good of a team to not make the playoffs two years in a row,\" Voracek said. \"Too many good players. We have some of the best goalies in the NHL. There's no reason to not make the playoffs.\" \nHere are some other things to know about this season's Philadelphia Flyers: \nSCORING PUNCH: Voracek and Giroux can score and should be lock to hit at least 25 goals each. Wayne Simmonds led the Flyers with 28 goals. But after that, where's the offense? Sean Couturier and Michael Raffl need to pick up their offense and Brayden Schenn has underachieved. The Flyers relied on their heavy hitters too much for the big goals and Hakstol has given younger players time to shine in the preseason. Sam Gagner should be a nice pickup. \nDEAD WEIGHT: The Flyers simply have too many veteran players not pulling their weight and could he healthy scratched for the opener - or simply dumped. The Flyers waived defenseman Andrew MacDonald on Monday with five years and $26 million left on his contract. Forwards Vinny Lecavalier and R.J. Umberger are expensive busts and defenseman Luke Schenn is a seventh or eighth defenseman at best. That's a lot of money - and roster spots - that could be used elsewhere. Hextall is still dealing with bad contracts from the Paul Holmgren era and is trying to do what he can to create salary cap space. \nD-FENSE: The Flyers could stand to boost their blue line and Hakstol is trying to find the right mix for the second and third lines among Evgeny Medvedev, Radko Gudas and Michael Del Zotto. The Flyers signed Medvedev, a 33-year-old Russian, to a $3 million contract. Hakstol seems to have his top pair set in Nick Schultz and Mark Streit. Schultz played in 80 games and Streit 81 but combined for only 11 goals. \nHAKSTOL'S RESUME: The new coach is not exactly an unknown in NHL circles. North Dakota had been a pipeline to the NHL, including players such as Jonathan Toews (Chicago), Matt Greene (Los Angeles), T.J. Oshie (Washington) and Chris VandeVelde (Philadelphia). In all, Hakstol's program has produced 20 NHL players and 46 have played professionally at some level. \nTHAT DROUGHT: The Stanley Cup drought is one of the longest in the league: The Flyers haven't a championship since back-to-back Cups in 1974 and 1975. Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-06T00:21:00.000+03:00", "crawled": "2015-10-06T00:30:03.512+03:00", "highlightTitle": ""}