{"organizations": [], "uuid": "1ae352a2a3dfcf3dfb5a6bedc95fd1ee9d185321", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/49224699.cms", "site_section": "http://timesofindia.indiatimes.com/Sports/NBA/NBAs-Greatest-Players/articlelist/8019383.cms", "section_title": "NBA's Greatest Players - NBA - Sports - The Times of India", "url": "http://timesofindia.indiatimes.com/world/rest-of-world/Rivals-blast-absent-Scioli-in-Argentinas-first-presidential-vote-debate/articleshow/49224688.cms", "country": "IL", "title": "Rivals blast absent Scioli in Argentina's first presidential vote debate", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "Rivals blast absent Scioli in Argentina's first presidential vote debate - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T20:07:00.000+03:00", "replies_count": 0, "uuid": "1ae352a2a3dfcf3dfb5a6bedc95fd1ee9d185321"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/world/rest-of-world/Rivals-blast-absent-Scioli-in-Argentinas-first-presidential-vote-debate/articleshow/49224688.cms", "ord_in_thread": 0, "title": "Rivals blast absent Scioli in Argentina's first presidential vote debate", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BUENOS AIRES: Argentina's presidential hopefuls sidestepped some of the most pressing economic issues facing the Latin American country in its first-ever presidential debate on Sunday, taking aim instead at the absence of ruling party candidate Daniel Scioli.\nScioli, the frontrunner in opinion polls to replace outgoing President Cristina Fernandez, said earlier on Sunday he would not take part because debates \"often take an aggressive tone that goes against what the people are hoping for.\"\nLeading opposition candidate Mauricio Macri played up the concerns of some voters that Scioli would be a Fernandez puppet and not deliver the gradual change toward more open markets that he promises.\n\"I regret that Scioli is not here but it is clear that the (ruling party) is having trouble defining who will govern in the event it wins,\" said Macri, who trails Scioli in polls by about 10 points.\nDissident Peronist Sergio Massa, placed third in the presidential race, said Scioli's \"silence is mocking society\" and then left the remainder of his allotted time for the answer hanging in silence.\nIt was not immediately clear if Scioli's empty debate stand would hurt his support. Opinion polls ahead of the Oct. 25 election have shown Scioli widening his lead over Macri and edging closer to the backing needed for a first round win.\nThere were few testy exchanges in a rigidly structured debate that saw each of the five candidates talk unchallenged on four subjects - economic development, education, security and strengthening democracy - and face one question from another candidate on each.\nThe candidates steered clear of Argentina's debt default, capital controls imposed by outgoing President Cristina Fernandez and low foreign reserves.\nMassa offered the most detailed economic policy platform, promising economic growth of 5 percent, credit for first time home buyers and the scrapping of export quotas on grains. He said he would also abolish income tax for workers.\nMarket-favorite Macri vowed to create jobs through infrastructure investment and lower inflation to single digits.\nThe other candidates, Margarita Stolbizer, Nicolas del Cano and Adolfo Rodriguez Saa are collectively polling less than 10 percent of voter backing.\nScioli's absence dampened the fizz of the country's first presidential debate, but still marked an important democratic step forward, analysts said.\n\"The debates should be institutionalized. They are one of many reforms like electronic voting that are needed to improve the quality of democracy in Argentina,\" said Mariel Fornoni, director of the polling consultancy Management & Fit. ", "external_links": ["https://play.google.com/store/apps/details?id=com.toi.reader.activities"], "published": "2015-10-05T20:07:00.000+03:00", "crawled": "2015-10-05T10:31:39.412+03:00", "highlightTitle": ""}