{"organizations": ["Lokomotiv"], "uuid": "9a33917ef6c51192a170a69828503aa2eb3cb7db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.greenfieldreporter.com", "main_image": "http://cdn1.greenfieldreporter.com/gr_assets/images/dr_logo.jpg", "site_section": "http://greenfieldreporter.com//feed/sec/6000", "section_title": "GreenfieldReporter.com - Sports News", "url": "http://www.greenfieldreporter.com/view/story/0e2d0cab0ed3411c9b94f52c31000000/SOC--Russian-Roundup", "country": "US", "title": "Lokomotiv wins Moscow derby as Zenit falls further behind", "performance_score": 0, "site": "greenfieldreporter.com", "participants_count": 0, "title_full": "Lokomotiv wins Moscow derby as Zenit falls further behind", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T16:08:00.000+03:00", "replies_count": 0, "uuid": "9a33917ef6c51192a170a69828503aa2eb3cb7db"}, "author": "", "url": "http://www.greenfieldreporter.com/view/story/0e2d0cab0ed3411c9b94f52c31000000/SOC--Russian-Roundup", "ord_in_thread": 0, "title": "Lokomotiv wins Moscow derby as Zenit falls further behind", "locations": ["Moscow"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Lokomotiv wins Moscow derby as Zenit falls further behind in Russian title race THE ASSOCIATED PRESS   9:05   9:08   \nOrganizations: \nEastern Europe (362) \n\nMOSCOW — Lokomotiv Moscow underlined its status as a contender for the Russian Premier League title with a 2-1 win over Spartak Moscow on Sunday, while defending champion Zenit St. Petersburg continued to struggle. \nLokomotiv took an early lead through Alexander Kolomeitsev's diving header in the ninth minute. \nThat advantage was doubled four minutes into the second half when Baye Oumar Niasse fought through a knot of Spartak defenders and unleashed a fierce shot past Spartak goalkeeper Artyom Rebrov. \nSpartak pushed forward and was rewarded in the 77th when Salvatore Bocchetti scored with a stylish backheel off a cross from Aras Ozbiliz. Spartak had several chances to level the score late on but was thwarted by poor accuracy and a strong performance from Lokomotiv keeper Guilherme. \nLokomotiv, which last won a Russian title 11 years ago, is five points behind league leader CSKA Moscow , which beat Ural Yekaterinburg 3-2 on Saturday thanks to midfielder Kirill Panchenko, who scored one goal and set up another. \nCSKA remains unbeaten 12 games into the league season, with 32 out of a possible 36 points. \nAmid speculation over the future of Zenit coach Andre Villas-Boas, the St. Petersburg club is third in the standings, 10 points off CSKA and five off Lokomotiv, which holds the second of the two Champions League qualifying places. \nZenit dropped further off the title pace Saturday with a 2-2 draw against Kuban Krasnodar that was the defending champion's fourth draw in its last five league games. \nAhead of a crucial Champions League game against Lyon on Tuesday, there was a third consecutive start for Mikhail Kerzhakov, normally Zenit's reserve goalkeeper. He has been given the starting job by Villas-Boas after some high-profile errors by usual first choice Yuri Lodygin. \nIn other results, struggling Rubin Kazan rose to 12th with a come-from-behind 3-1 win Saturday over relegation-threatened FC Ufa, which is now without a win in its last seven league games. \nDynamo is ninth following a 1-1 draw with Amkar Perm. \n ", "external_links": [], "published": "2015-10-18T16:08:00.000+03:00", "crawled": "2015-10-18T16:25:07.278+03:00", "highlightTitle": ""}