{"organizations": ["NASCAR", "Talladega Superspeedway", "Talladega"], "uuid": "b496f3a30d6aea3b35af8fd09cf3236fbae84957", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newschannel9.com", "main_image": "http://newschannel9.com/sports/features/headlines/stories//images/Sports-Web-Picture_2535.jpg", "site_section": "http://www.newschannel9.com//xml/rss/sports_feed.xml", "section_title": "WTVC Sports - Headlines", "url": "http://www.newschannel9.com/sports/features/headlines/stories/talladega-adds-track-safety-2535.shtml", "country": "US", "title": "Talladega Adds To Track Safety", "performance_score": 0, "site": "newschannel9.com", "participants_count": 0, "title_full": "Talladega Adds To Track Safety", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T01:56:00.000+03:00", "replies_count": 0, "uuid": "b496f3a30d6aea3b35af8fd09cf3236fbae84957"}, "author": "", "url": "http://www.newschannel9.com/sports/features/headlines/stories/talladega-adds-track-safety-2535.shtml", "ord_in_thread": 0, "title": "Talladega Adds To Track Safety", "locations": ["Daytona"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Grant Lynch", "Kyle Busch"], "text": "Thursday, October 8 2015, 10:58 PM EDT Talladega Adds To Track Safety Talladega Superspeedway said Thursday it will have energy-absorbing barriers around the entire track when NASCAR races there this month. Talladega chairman Grant Lynch said the track has added 8,000 feet of SAFER barrier this year. The inside and outside walls are now completely covered at the 2.66-mile track. The track initially added three sections of SAFER barrier before its May race. The barriers cost between $500-600 per foot. All NASCAR tracks underwent a safety review after Kyle Busch broke his right leg and left foot in a Feb. 21 crash into a concrete wall at Daytona. All have either added SAFER barriers or said the material would be added this year. Talladega Adds To Track Safety Related Stories Check Back Often for NewsChannel9 Sponsored Events! Sports Headlines [an error occurred while processing this directive] Business News \nInvestors await release minutes from Fed's policy meeting \nWASHINGTON (AP) -- While the minutes from the Federal Reserve's regular policy meetings can be a ho-hum affair, the mood is different this time. \nWEST PALM BEACH, FL -- (Marketwired) -- 03/21/14 -- Companies that pride themselves on being eco-friendly may have conflicted ideas between marketing with ad specialties and maintaining their green reputation. ... Entertainment News \nJUDGE DENIES COSBY BID TO TOSS LAWSUIT \nSANTA MONICA, Calif. (AP) -- A lawsuit against Bill Cosby has survived an attempt to have it kicked out of court. Get This \nCOLLEGE RENAMING Science/Tech News \nIN THE NEWS: SELF-DRIVING CARS \nTOKYO (AP) -- Like those objects in your rear-view mirror, self-driving cars may be closer than they appear. Politics, Breaking News, US and World News. more » Tonight on WTVC NewsChannel 9 \n6:00 NewChannel 9 6:30 ABC World News Tonight7:00 Wheel of Fortune10:00 How to Get Away Murder11:00 NewsChannel 9 Stay Connected: \n©2015, Sinclair Broadcast Group, Inc.WTVC News Channel 9 provides local news, weather forecasts, traffic updates, notices of events and items of interest in the community, sports and entertainment programming for Chattanooga and nearby towns and communities in the Tennessee Valley and Northwest Georgia, including in Tennessee East Ridge, Hixson, Red Bank, Signal Mountain, Whitwell, Spring City, Gruetli-Laager, Tracy City. Benton, Ducktown, Copperhill, and Ocoee, Jasper, Monteagle, Ooltewah, Charleston, Middle Valley, Georgetown, Soddy-Daisy, Sewanee, Cleveland, Sale Creek, Dunlap, Dayton, Pikeville, Athens, Etowah, Sweetwater, Kimball, South Pittsburg, and New Hope; in Georgia Rock Springs, Ringgold, Lafayette, Dalton, Chatsworth, Summerville, Calhoun, Chickamauga, Fort Oglethorpe, Trenton, Chattanooga Valley, Tunnel Hill, Rossville, Lakeview, Flintstone, Fairview, and Indian Springs; in North Carolina Murphy and Andrews; and in Alabama Bridgeport, Bryant, Stevenson, Fackler, Scottsboro, Rainsville, Fort Payne, Huntsville, Madison, Hazel Green, Toney, Harvest, Athens, Tanner, and Decatur.", "external_links": [], "published": "2015-10-09T01:56:00.000+03:00", "crawled": "2015-10-09T08:39:11.933+03:00", "highlightTitle": ""}