{"organizations": ["Dodgers"], "uuid": "76addbeccbfd9cc232f2c455d603ec3d95f41268", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ocregister.com", "main_image": "http://images.onset.freedom.com/ocregister/gallery/nw1jpw-b88537365z.120151010223720000g5dch2ru.10.jpg", "site_section": "http://ocregister.com//common/rss/rss.php?catID=18969", "section_title": "The Orange County Register - News Headlines : Sports Columns", "url": "http://www.ocregister.com/articles/play-687020-utley-game.html", "country": "US", "title": "Miller: Utley wakes up Dodgers with old-school slide", "performance_score": 0, "site": "ocregister.com", "participants_count": 0, "title_full": "Miller: Utley wakes up Dodgers with old-school slide - The Orange County Register", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "76addbeccbfd9cc232f2c455d603ec3d95f41268"}, "author": "", "url": "http://www.ocregister.com/articles/play-687020-utley-game.html", "ord_in_thread": 0, "title": "Miller: Utley wakes up Dodgers with old-school slide", "locations": ["LOS ANGELES"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Utley", "Miller"], "text": "LOS ANGELES – I was thinking that maybe this was an incredible sight, some sort unimaginable scene no one could have possibly expected to witness.\nNot in a million years.\nThen I realized I, of all people, had in fact witnessed this before and barely 365 days ago, too.\nThat’s when the Angels opened up a division series at home, against an opponent they were generally forecast to beat, and their hitters performed as if they were standing at the plate armed with loaves of bread.\nNow, here were the Dodgers, 15 innings into their National League Division Series, at home, against the underdog Mets, having scored only twice up to that point while hitting a collective .216.\nThen Chase Utley delivered the big blow – while skidding on his rear-end – significantly changing the course of a game and a series.\nThe old-school Dodger made an old-school move, taking out the Mets’ shortstop on a potential double play, the body block allowing the tying run to score and seemingly awakening a desperate team and an anxious stadium.\nThe resultant four-run rally lifted the Dodgers to a 5-2 victory, evening this series at one game apiece and igniting a debate about whether Utley was playing hard or recklessly.\n“You play this game hard, but it’s never with the intention of hurting anybody,” teammate Howie Kendrick said. “I feel like Chase made a good baseball play there.”\nUtley slid decidedly late, no question, sailing past second so dramatically that he was unable to even touch the base. That was his greatest crime.\nBut, in accordance to baseball’s famously unwritten rules, Utley was in the proximity of second, his slide – as tardy as it was – not something that’s terribly uncommon in this game.\nNow, the fact Ruben Tejada, the shortstop who looked more like a slot receiver being cart-wheeled by a linebacker, suffered a fractured leg didn’t make the play any more pleasant. No one wants to see an athlete ever leave the playing field on a cart.\n“That’s baseball,” Kendrick said. “He probably did slide late. ... It’s just kind of unfortunate the guy ended up getting hurt.”\nAsked for his opinion of Utley’s slide, Mets manager Terry Collins said, “It broke my shortstop’s leg. That’s all I know.”\nThe whole exchange looked even worse because of the awkward positioning of Tejada, who had turned his back on the charging Utley to take the throw before, presumably, spinning to attempt to complete a double play that, by that point, had very little chance of actually happening.\nIn fact, everyone would soon learn, the double play never had any chance of happening. A replay review determined that Tejada had failed to make contact with second base, too, and Utley was ruled safe – on a play that, ironically enough, was anything but safe.\n“There's a way to play the game hard, but only Chase knows going in there what his intent was,\" the Mets' David Wright said. “I have a problem with the play on a number of different levels, one being the slide itself. In my opinion, he wasn't anywhere close to the bag. He never touched the bag. I have a lot of questions.”\nOne batter later, Adrian Gonzalez delivered the two-out, two-run double that broke a 2-2 tie and pushed the Dodgers to a victory they needed as much as their next breathe.\nHaving lost the opener with Clayton Kershaw pitching, a loss in a Game 2 started by Zack Greinke would have left the Dodgers playing for their postseason lives, in New York, with what remains of their rotation.\nYeah, this victory was that big, Utley’s play and everything that followed it that important.\nUntil that point, the Dodgers were in serious trouble. For the second consecutive night, they could go almost nothing against a hard-throwing Mets starter.\nThis time it was Noah Syndergaard, who needed only two first-inning pitches to top 100 mph, a mark he would reach repeatedly early on.\n“That first inning, he just overpowered us,” Mattingly said. “This guy was unbelievable coming out of the gate.”\nLike in Game 1 against Jacob deGrom, the Dodgers struggled to threaten and again were unable to find the big hit when they did piece together something similar to a threat.\nOnly Andre Ethier’s fourth-inning RBI double broke through against Syndergaard, who took a 2-1 lead into the seventh, which he began by striking out Yasmani Grandal.\nKike Hernandez walked, and then Utley, as pinch-hitter, singled. With runners at first and third, Collins pulled Syndergaard in favor of Bartolo Colon.\nIt was Kendrick’s ground ball up the middle that started the play Utley ended by flattening Tejada and stirring up both sides, for better or worse.\n“Basically, everything went our way the second half of the game,” Hernandez said. “We sort of got our mojo back and our confidence back. Let’s hope it continues.”\nAnd if there is any lingering ill will from Utley’s play ...\n“Nobody’s really talking about it in here,” Kendrick said of the possibility of Mets’ retaliation. “If it happens, so be it. But I think those guys are going to play good baseball and try to win the next game. Same with us.”\nEspecially now that the Dodgers, unlike last year’s Angels, have been brought to life in a series now very much alive, as well.\nContact the writer: jmiller@ocregister.com", "external_links": [], "published": "2015-10-10T03:00:00.000+03:00", "crawled": "2015-10-11T09:09:44.331+03:00", "highlightTitle": ""}