{"organizations": [], "uuid": "ad19d37456db9823c2ac2bc88a0a5198cf73c83c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.watertowndailytimes.com", "main_image": "http://watertowndailytimes.com/images/ogimage_wdt.png", "site_section": "http://www.watertowndailytimes.com/section/iatom_wdtsports?omniture=0&mime=application%2Fatom%2Bxml", "section_title": "WDT News Feed: Watertown Daily Times: Local Sports", "url": "http://www.watertowndailytimes.com/sports/south-jefferson-freshman-marlowe-dives-right-in-20151022", "country": "US", "title": "South Jefferson freshman Marlowe dives right in", "performance_score": 0, "site": "watertowndailytimes.com", "participants_count": 0, "title_full": "South Jefferson freshman Marlowe dives right in", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T08:47:00.000+03:00", "replies_count": 0, "uuid": "ad19d37456db9823c2ac2bc88a0a5198cf73c83c"}, "author": "", "url": "http://www.watertowndailytimes.com/sports/south-jefferson-freshman-marlowe-dives-right-in-20151022", "ord_in_thread": 0, "title": "South Jefferson freshman Marlowe dives right in", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Marlowe"], "text": "A A \nADAMS — Clara Marlowe has made a huge splash in a short time this season. \nThe South Jefferson freshman diver broke her foot in August and has competed in only two swimming meets this fall. \nDuring those two competitions she qualified for sectionals and earned a spot on her school’s record board. \nMarlowe scored 320.15 points for a third-place finish in the “A” Division at the Frontier League diving championships last Saturday at Carthage to advance to the Section 3 diving meet. \nShe is the first girl from South Jefferson to learn enough dives to compete in an 11-dive meet since the school began a swimming program eight seasons ago. \n“I’ve never had anyone work as hard as she does (in diving),” South Jefferson coach Tim Corbett said. \nMarlowe fractured her foot falling off a balance beam during gymnastics and had to wear a boot cast on her foot for two months to help it heal. Once the cast was removed, she was required to log 10 swimming practices before she was allowed to compete. \nHer first competition of the season was her team’s last dual meet on Oct. 13 versus visiting Carthage. She claimed first place with a 6-dive score of 159.90. Teammate Kaylee Haynes, an eighth-grader, was second. \nMarlowe, who also competed on varsity last season, does not hold the school record for six dives, but Corbett believes she would have claimed the record this year had she been able to compete. The 6-dive record is held by 2015 graduate Sydney Robert, who was a mentor to Marlowe last year. \nIndian River senior Natalie Wicks and Lowville sophomore Audrey Clements also set records at the league diving championships. \nThe “B” Division diving record has been broken each of the past three seasons. Clements scored 385.65 points Saturday to capture the title, while breaking league and school marks set by 2015 Lowville graduate Megan Denise last year. \nDenise had broken a record set by Cooperstown’s Catherine Borgstrom the previous season. \nClements’ teammate Tess Smith, a freshman, is also excelling in the event. Smith scored 346.55 points to qualify for sectionals. \n“It’s been so much fun to watch them grow together,” Lowville coach Marcia Kenealy said. “They are the very best of friends and each other’s support, encouragement and competition.” \nDefending “A” Division champion Wicks broke her own 11-dive school record from last year by nearly 60 points, with a score of 377.75, which earned her another first-place finish. The previous record had been held by 2011 graduate Kendra Chisamore, who scored 289 points. \nWicks broke her own 6-dive school record this season with a score of 220 points. \nShe helps teach gymnastics at the YMCA, and her background in gymnastics has been helpful to her diving career, according to Indian River coach Alan Baker. \nWicks also swims the 50-yard freestyle and contributes to the Warriors’ relays. \nSouth Lewis senior Jenna Matuszczak broke her own 6-dive school record several times this season. She peaked at 216.15 points during a meet Oct. 8. She initially set the record at her last home meet last year by surpassing the previous record of 188.50. \nGILFILLAN CLOCKING FAST TIMES \nAshlynn Gilfillan recorded the fastest freestyle times in the Frontier League’s North Division this season. \nThe General Brown senior practices and competes alongside the South Jefferson team because her school doesn’t have a swimming program. \nGilfillan’s best time in the 100-yard freestyle this season is 54.74 seconds, which she recorded on Sept. 8. The state-qualifying time for that event is 54.36, so she has the potential to qualify for state competition during the league and sectional championship meets. \nGilfillan’s fastest time in the 50 freestyle this season is 25.33, and her best 200 freestyle time is 2:02.47. \nShe also swam the 100 backstroke in a league-best 1:05.21. \nSWIMMING CHAMPIONSHIP DATES \nThe Frontier League swimming championships are scheduled for Saturday at two locations. \nThe “A” Division championship, which includes both North and South Divisions, is 11 a.m. at Rome Free Academy. \nThe “B” Division meet is set for noon at Thousand Islands in Clayton. \nFactored into the team results will be the finishes from last Saturday’s league diving competition, which was held at Carthage. \nThe Section 3 diving championships are set for Oct. 31, with Class A competing at Liverpool and Classes B and C at Jamesville-DeWitt. Diving finals will be 10 a.m. Nov. 5 at Nottingham, and the state qualifier is at 11 a.m. Nov. 7 at Jamesville-DeWitt. \nSection 3 swimming championships are slated for Nov. 6 at two locations. Classes A and B will compete at Nottingham in Syracuse, with Class A beginning at noon and Class B at 5 p.m. The Class C meet is 3:30 p.m. at Skaneateles. \nThe Section 3 state qualifier for swimming is scheduled for 1 p.m. Nov. 8 at Nottingham. \nState championships are Nov. 20-21 at Ithaca College.  ", "external_links": [], "published": "2015-10-22T08:47:00.000+03:00", "crawled": "2015-10-22T11:42:39.339+03:00", "highlightTitle": ""}