{"organizations": [], "uuid": "93cb37f5b5666d47ce137f52c4c845fa568f4f07", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.timesunion.com", "main_image": "http://ww1.hdnux.com/photos/41/40/72/8785596/3/rawImage.jpg", "site_section": "http://timesunion.com//home/collectionRss/Homepage-HCat-Sports-6377.php", "section_title": "Sports news", "url": "http://www.timesunion.com/sports/college/article/Appreciation-Spurrier-changed-the-game-did-6569139.php", "country": "US", "title": "Appreciation: Spurrier changed the game, did things his way", "performance_score": 0, "site": "timesunion.com", "participants_count": 1, "title_full": "Appreciation: Spurrier changed the game, did things his way - Times Union", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T21:14:00.000+03:00", "replies_count": 0, "uuid": "93cb37f5b5666d47ce137f52c4c845fa568f4f07"}, "author": "timesunion.com", "url": "http://www.timesunion.com/sports/college/article/Appreciation-Spurrier-changed-the-game-did-6569139.php", "ord_in_thread": 0, "title": "Appreciation: Spurrier changed the game, did things his way", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: Rainier Ehrhardt, AP Image 1 of / 4   4 FILE - In this Nov. 24, 2012 file photo, South Carolina head coach Steve Spurrier, right, shakes hands with Clemson head coach Dabo Swinney after an NCAA college football game in Clemson, S.C. South Carolina beats Clemson 27-17, allowing Spurrier to set a record with 65 wins. Spurrier also remains the winningest coach at Florida with 122 victories\nPhoto: Rainier Ehrhardt, AP FILE - In this Nov. 24, 2012 file photo, South Carolina head coach... Image 2 of 4 FILE - In this Oct. 31, 1976 file photo, Tampa Bay Buccaneers quarterback Steve Spurrier goes down against the Kansas City Chiefs during an NFL football game in Tampa Bay, Fla. Spurrier plays his final game of a 10-year NFL season a 31-14 loss to the New England Patriots for his 0-14 Tampa Bay Buccaneers on Dec. 12, 1976. He completed 52 percent of his passes for 6,878 yards, 40 touchdowns and 60 interceptions in his NFL career.\nPhoto: AP FILE - In this Oct. 31, 1976 file photo, Tampa Bay Buccaneers... Image 3 of 4 FILE - In this Jan. 2, 1997 file photo, Florida coach Steve Spurrier poses with his team after defeating Florida State 52-20 in the Sugar Bowl at the Superdome in New Orleans. Florida wins Spurrier’s only national title, avenging a Florida State loss on the final game of the regular season with a 52-20 win over the Seminoles in the Sugar Bowl.\nPhoto: DAVE MARTIN, AP FILE - In this Jan. 2, 1997 file photo, Florida coach Steve... Image 4 of 4 South Carolina head football coach Steve Spurrier speaks at a news conference to announce he is resigning on Tuesday, Oct. 13, 2015, at the University Of South Carolina, in Columbia, S.C. Spurrier said he felt he needed to step down now because he doesn't believe there is accountability with players if they know the coach won't be back next year. He also said he was a recruiting liability. He had never had a losing season in 25 previous seasons coach at Duke (1987-89), Florida (1990-2001) or South Carolina, where he has been since 2005.\nPhoto: Richard Shiro, AP South Carolina head football coach Steve Spurrier speaks at a news... Appreciation: Spurrier changed the game, did things his way 1  /  4 Back to Gallery Steve Spurrier knew how to tweet long before it became something you did on your phone.\nIn 140 characters or less, the coach could cut right to the heart of the matter, make his own fans laugh and get everyone to pay attention.\nAnd as good as he was with a quip, he was even better with a pencil in hand, drawing up plays.\nThe man who liked to call himself the \"Head Ball Coach\" coached 'em up better than anyone for about a decade.\nIn the early 1990s, Spurrier turned college football upside down in the Southeastern Conference and across the nation. He revived his alma mater, Florida, and, more importantly, made other coaches believe that you could throw the ball, have some fun and collect a few wins — and even a few enemies — along the way.\nAnd so, when you turn on the TV this Saturday and watch programs from Oregon to Florida and, yes, even in Texas, spreading out their offenses, throwing on every down and looking to hang 50 — not such a feat anymore — you might take a second to thank the ol' ball coach.\n\"He had fun doing it,\" said Spurrier's buddy, and old boss, Florida athletic director Jeremy Foley .\nHe did it at pretty much everyone's expense.\nOh, yes, they used to hate this sunburned, visor-tossing, invective-spewing genius, who was known around the South, not-so-lovingly, as \"Coach Superior.\"\nHe cared not one bit.\n\"At least they're not calling us losers anymore,\" Spurrier said during the last of his 12 successful seasons at Florida. \"If people like you too much, it's probably because they're beating you.\"\nHe leaves South Carolina looking a bit beaten — at 70, a shadow of that lightning-rod of a man he used to be.\nHis two-year stint as an NFL coach was a failure. That he was lauded by the South Carolina president for helping that program to three 11-win seasons and an SEC East title was a sign of how much things have changed.\nThose would've been mere stepping stones at Florida, where he won 122 games, along with six SEC titles and one national championship over his dozen game-changing years.\nHe became a more conservative, less dramatic and, ultimately, less successful coach as the years clicked along at South Carolina.\nThat should not be his lasting legacy.\nHe was the coach who singlehandedly took Bear Bryant's close-to-the-vest, ground-centric SEC on a high-flying ride it has yet to come down from. Using his Fun 'N' Gun offense, Spurrier turned quarterbacks Danny Wuerffel , Shane Matthews , Doug Johnson and Rex Grossman into college-football stars. None of them did much at the NFL, which was further tribute to the coach's ability to coax the most out of less-than-Grade A talent.\nThings we see every week now used to be news when Spurrier coached the Gators.\nAll that visor tossing and the arms-crossed, spittle-flying lectures he gave to the quarterbacks — the reruns of those moments almost seem quaint today. Only last month, Florida's current coach, Jim McElwain , had to apologize for an over-the-top tirade toward Kelvin Taylor , who happens to be the son of one of Spurrier's best players.\nThe great one-liners — \"Can't spell citrus without U-T,\" ''FSU stands for Free Shoes University \" — that's come-and-go stuff in today's world of Twitter.\nRemember rivalries? They're more quaint than meaningful in today's version of the college game, which has been reset in an era of expanded super-conferences.\nSpurrier was from a different mold.\nHe played up Florida's rivalry with Florida State, and made the Gators' border war against Georgia mean something again, carrying a personal grudge into the matchup because of the beatings he'd suffered during his own college career, which concluded with him hoisting a Heisman Trophy, but not a single SEC title.\nSo, after a dozen years of paying back all the grudges and dishing out all the one-liners, maybe it wasn't such a surprise that the second and third acts felt more like work than fun.\nHe went to the NFL to see if his style of coaching could make it there. Answer: No. He went 12-20 over two years with the Redskins.\nHe returned to the college game at South Carolina — an SEC member, for sure, but a place where he never had to deal with what he had at Florida. After so much success there, he said, it became \"like a disgrace when we lose and a relief when we win.\"\nAt a going-away news conference Tuesday, Spurrier acknowledged it was time to leave because, at age 70, he'd lost any sense of persuasion on the recruiting trail.\nYes, the Fun 'N' Gun has been irreversibly replaced by a text-and-tweet game with which Spurrier is no longer comfortable.\nBut give him this: By resigning suddenly, in mid-season, and with the caveat that he might not be done coaching forever, he did it his way.\nNow, THAT was the ol' ball coach at his finest, and who would've expected any different?", "external_links": [], "published": "2015-10-13T21:14:00.000+03:00", "crawled": "2015-10-14T02:37:27.800+03:00", "highlightTitle": ""}