{"organizations": [], "uuid": "7cf1f3dc16ec811d667d884b743269f8f4b9d207", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sportsnews.com.au", "main_image": "http://sportsnews.com.au/defaultimage.jpg", "site_section": "http://www.sportsnews.com.au/feed", "section_title": "Sports News Australia", "url": "http://www.sportsnews.com.au/rugby-union/mccaw-set-for-brutal-rwc15-semi/160939", "country": "CA", "title": "McCaw set for “brutal” RWC15 semi", "performance_score": 0, "site": "sportsnews.com.au", "participants_count": 1, "title_full": "McCaw set for “brutal” RWC15 semi", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T23:54:00.000+03:00", "replies_count": 0, "uuid": "7cf1f3dc16ec811d667d884b743269f8f4b9d207"}, "author": "AAP", "url": "http://www.sportsnews.com.au/rugby-union/mccaw-set-for-brutal-rwc15-semi/160939", "ord_in_thread": 0, "title": "McCaw set for “brutal” RWC15 semi", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "McCaw set for “brutal” RWC15 semi Posted by AAP + on 24/10/2015 at 7:54 am AFL GRAND FINAL OFFER! If your team leads at any break but loses, CASH BACK up to $100!* PLUS Sign up now for a $501 Bonus Bet! \nNew Zealand captain Richie McCaw has predicted a “brutal” Test match when the All Blacks face South Africa in Saturday’s Rugby World Cup semi-final at Twickenham. \nMcCaw’s men go into battle as favourites in pursuit of a history-making second successive world title, but the 34-year-old has been around long enough to understand how big a challenge lies ahead. \n“It will be a brutal game, but they are the games I love,” said McCaw, who wins his 147th cap. \n“If you get the odd scar from it, that’s just part and parcel. \n“Being in that environment, playing that opposition with that sort of intensity, is why you play the game. If we get the job done, I will take any scar that comes along with it. \n“They are going to be desperate and we’ve got to match that. It will be brutal because of that.” \nNew Zealand arrived in the semi-finals following a 62-13 demolition of France in Cardiff last weekend, but that result is now history as far as McCaw is concerned. \n“The first couple of days this week were about ensuring there was a full stop,” he added. \n“I think we have done that pretty well.” \nNew Zealand were at their all-singing, all-dancing best when they put France to the sword, scoring nine tries and leaving Les Bleus in disarray, yet McCaw knows full well where the semi-final will be decided. \n“It is not so much the flash stuff that is going to count, it’s being able to do the things that mean you can get across the advantage line,” he said. \n“You live or die by tomorrow, and it is about getting the fundamentals right.” \n“We will be going in with a plan – you always do – and it’s the subtle differences that often catch them (opposition) out, rather than a miracle thing. \n“Sure, we’ve got some things up our sleeve, but you don’t go out there just thinking it is going to work.” \nMcCaw rates the match ups with the Springboks as some of the toughest in world rugby and is looking forward to his battle with opposite number Schalk Burger. \n“He is the epitome of the physicality that the Springboks bring,” McCaw said. \n“If I never get to do it (play against Burger) again, I wouldn’t mind making this one to remember. He is a man that I respect hugely, but I want to get one over on him.” \nAs part of their preparations this week, the All Blacks were addressed by soldier Willie Apiata, who was the first New Zealand recipient of the Victoria Cross for carrying a wounded soldier to safety across a battlefield – under fire – in Afghanistan 11 years ago. \n“You talk about pressure environments, and he has been in situations with a damn sight more pressure than us,” McCaw said. \n“The boys enjoyed hearing his stories and his calming words.”  ", "external_links": [], "published": "2015-10-23T23:54:00.000+03:00", "crawled": "2015-10-24T00:11:53.694+03:00", "highlightTitle": ""}