{"organizations": [], "uuid": "06b06dea9c3fdf8024b1586390fc9cbd33b9baa7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.heraldbulletin.com", "main_image": "http://bloximages.chicago2.vip.townnews.com/heraldbulletin.com/content/tncms/assets/v3/editorial/e/d1/ed13a42e-6af3-11e5-adb6-77a18f92b9c8/5611bd7416b12.image.jpg?resize=760%2C507", "site_section": "http://www.heraldbulletin.com/search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&nsa=eedition&c[]=sports,sports/*&f=rss", "section_title": "Herald Bulletin - sports,sports/", "url": "http://www.heraldbulletin.com/sports/colts/mike-lopresti-column-time-to-move-on-from-pagano-s/article_69bbd90e-76ae-11e5-bce3-6b733e02b51a.html", "country": "US", "title": "Mike Lopresti column: Time to move on from 'Pagano's Folly'", "performance_score": 0, "site": "heraldbulletin.com", "participants_count": 0, "title_full": "Mike Lopresti column: Time to move on from 'Pagano's Folly'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T01:10:00.000+03:00", "replies_count": 0, "uuid": "06b06dea9c3fdf8024b1586390fc9cbd33b9baa7"}, "author": "", "url": "http://www.heraldbulletin.com/sports/colts/mike-lopresti-column-time-to-move-on-from-pagano-s/article_69bbd90e-76ae-11e5-bce3-6b733e02b51a.html", "ord_in_thread": 0, "title": "Mike Lopresti column: Time to move on from 'Pagano's Folly'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Pagano", "Mike Lopresti"], "text": "Mike Lopresti column: Time to move on from 'Pagano's Folly' \nINDIANAPOLIS — The fake punt that will live in infamy is now headed for Colts legend, to be prominently displayed in the What-were-they-thinking Wing. \nThe nation has had its fun chortling. The New England Patriots, too, probably, when no one was looking. \n\"Shame on them,’’ was the operative phrase from Julian Edelman, adding you expect such things from the guys with horseshoes on their helmets. \n\"You know, Colts,’’ he said. \nSo now what? \nMonday was spent with one last attempt to explain the unexplainable. Chuck Pagano threw himself on the sword, as coaches must. All his fault, he kept saying, though an enduring image is him looking at Griff Whalen afterward with one plea: \"Why did you snap it?’’ \nNobody yet has any better description than the succinct judgement late Sunday night of punter Pat McAfee. \n\"It turned out to be one of the most failed fakes, probably, of all time,’’ he said to reporters, and the world in general. \nThere was no dissent. It was a ball that should never have been snapped, for a play that was never going to work, born of a call that should never have been made. Besides that, the Colts lined up illegally to do it. \n\"A complete cluster,’’ McAfee called it. \nSince it was an NBC game, you wondered if Al Michaels considered asking his audience, \"Do you believe in lunacy?’’ \nTo have that happen against the Patriots was all very, uh, deflating. McAfee mentioned the disquieting fact that the Colts had been working on that play since last year. Just think what might have happened if they hadn’t practiced it so much. \nBut now it is time to forget — yeah, right — and move on. The one-third pole of the season was just passed, and things are not exactly peachy. Here are several items for the suggestion box. \n1. Borrow a page from — try not to gag — Bill Belichick. \nWhen the Patriots were coming off an unsavory defeat last season, and lots of pointed questions were being asked about the direction of his team, Belichick turned a press conference into a one-answer show on the next opponent. Remember his mantra? \n\"We’re on to Cincinnati ... we’re on to Cincinnati.’’ \nBill, what time do you have? \"We’re on to Cincinnati.’’ \nThe Patriots, you might recall, ended up winning the Super Bowl. \nAny further inquiries on Pagano’s Folly should get one answer. \"We’re on to New Orleans.’’ \nThe Colts need the next one against the Saints badly. Or else, how does a 1-3 record at home grab you? But, then, if there is one thing they have experience in, it’s having to recover from a loss to the Patriots. \n2. Beat a good opponent one of these days. \nThere is one sure cure for whatever ails the Colts, but unfortunately, they don’t get to play a team from the AFC South again for eight weeks. For the immediate future, the Saints are always dangerous with Drew Brees, and the next three opponents after that — Carolina, Denver and Atlanta — are 16-1. \nWe still don’t know what the Colts are. Are they a decent team that can win its own pastry cart of a division, but not much else? Better than that? To be determined. And presumably, they’ll determine it without a wide receiver snapping the ball to a safety anymore. The Patriots scoff at Indianapolis because they don't need trickery. \nLosing narrowly to New England is better than losing by the recent norm of three or four or five touchdowns, but moral victories don’t get you far in the NFL. \n\"We lost, what are you going to say, `We did this well, we did that well?’’’ Mike Adams mentioned. ``At the end of the day, it’s the lefthanded column (where they put the wins) that matters, and we didn’t get it.’’ \n3. Get Andrew Luck to mid-season form, since it’s now mid-season. \nIt was interesting, there was so much to-do about that exploding cigar of a fake punt, barely mentioned was the fact Luck was back. He threw 50 passes, and none of them were intercepted, though a couple were examples of those occasional Luck-isms, where he sends a ball into coverage, as if the defensive backs were wearing invisible paint. \n\"That has nothing to do with my well-being or health,’’ he said. \"That’s stuff I’ve got to clean up.’’ \n4. Fewer offensive holding penalties. \nPlease. \n5. Oh, one last thing. Never, ever, ever even think of trying that fake punt again. \nNo matter how much anyone is tempted by the exotic. \nYou know, Colts. With your existing account from... {* loginWidget *}", "external_links": [], "published": "2015-10-20T01:10:00.000+03:00", "crawled": "2015-10-26T04:11:06.736+02:00", "highlightTitle": ""}