{"organizations": [], "uuid": "0afa8a10c8e7cce116e7eb5530389863ee7563c0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports", "section_title": "Sports News, Scores, Schedules, Standings, Stats, Photos, Videos - MSN Sports", "url": "http://www.msn.com/en-us/sports/nfl/pelissero-tweak-could-clarify-nfl-catch-rule/ar-AAf19LE", "country": "US", "title": "Pelissero: Tweak could clarify NFL catch rule", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "Pelissero: Tweak could clarify NFL catch rule", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "0afa8a10c8e7cce116e7eb5530389863ee7563c0"}, "author": "Tom Pelissero, USA TODAY Sports", "url": "http://www.msn.com/en-us/sports/nfl/pelissero-tweak-could-clarify-nfl-catch-rule/ar-AAf19LE", "ord_in_thread": 0, "title": "Pelissero: Tweak could clarify NFL catch rule", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Pelissero: Tweak could clarify NFL catch rule USA Today Sports 8 hrs ago by Tom Pelissero, USA TODAY Sports © Tommy Gilligan, USA TODAY Sports Pelissero: NFL's catch rule needs one fix The NFL’s rules on completing a catch aren’t as ambiguous as the likes of Cincinnati Bengals tight end Tyler Eifert make it seem when a receiver is punished for not doing what the league has told them to do over and over: Hang on to the ball all the way to the ground.\nAdChoices There continues to be a disconnect between what everyone (including officials) see in real time and how the rules function, though. And the Eifert touchdown officials correctly overturned last weekend is one type of play that seems to have a logical fix.\nIf a player has control of the ball, got two feet in bounds and clearly reaches the ball forward, it should be a catch.\nThe tweak could apply strictly to goal-line plays, which already have a carveout that makes it a touchdown, not a fumble, if a runner loses control after the ball breaks the plane of the opponent’s goal line. Or it could apply everywhere if “goal-line play” is too vague, given the act begins (and may end) outside the end zone. Either way, Eifert’s touchdown would stand.\nDallas Cowboys receiver Dez Bryant’s controversial non-catch in last year’s playoff loss at Green Bay would be a tougher case. That’s surely one reason the NFL’s competition committee didn’t consider such a change when tweaking the rule in March to say: “A player is considered to be going to the ground if he does not remain upright long enough to demonstrate that he is clearly a runner” capable of avoiding or warding off impending contact of an opponent, and thus must maintain control of the ball after initial contact with the ground.\n“The goal line lunge was not discussed,” NFL spokesman Michael Signora told USA TODAY Sports by email. “Either the player had time to become a runner before he went to the ground or he didn't. If he had time to become a runner and lunged it would be a TD.”\nSt. Louis Rams coach Jeff Fisher, a member of the competition committee, said in March that “if you start talking about reaching the ball out or doing something like that on the way to ground, you just invite a lot of gray area back into the interpretation.”\nThe NFL wants officials to have objective criteria such as that applied to Eifert, who was hit by Baltimore Ravens safety Brynden Trawick before his second foot landed and lost the ball after it broke the plane, but before he hit the ground.\nIt makes sense to protect officials from subjective decisions on a (non-) catch like Bryant’s at a critical moment. But consider this example (A.R. 8.12) from the NFL’s 2015 casebook:\n“First-and-10-on B25. A1 throws a pass to A2 who controls the ball and gets one foot down before he is contacted by B1. He goes to the ground as a result of the contact, gets his second foot down, and with the ball in his right arm, he braces himself at the three-yard line with his left hand and simultaneously lunges forward toward the goal line. When he lands in the end zone, the ball comes out.”\nThat sounds a lot like the Eifert play – except the casebook says it’s a touchdown. Why?\n“The intent of this (approved ruling) is that the receiver becomes a runner by putting his arm down and lunging for the goal line,” NFL vice president of officiating Dean Blandino said in a statement through Signora.\nIf officials can be trusted to distinguish between putting an arm down to lunge for the goal line and, say, Bryant’s right arm bracing his fall while he appeared to extend the ball with his left, it’s logical to think they could also be trusted on a case-by-case basis to decide whether a player is stretching for extra yards or just falling down.\nThe definition of a catch figures to be re-examined every year, despite limited incidents of major dispute. And while a global solution that instantly satisfies everyone is unrealistic, a tweak to put more power in officials’ hands over certain plays is at least worth a conversation.\nInside runs\n- Early scouting report on Ohio State QB Cardale Jones: Big, strong-armed pocket passer who doesn’t show anticipation and makes repeat mistakes. The question is whether the redshirt junior’s shortcomings are about aptitude, study habits or just inexperience. “He’s got the best arm I’ve seen in a while,” a high-ranking NFL scout said, speaking on condition of anonymity for competitive reasons. “Quick release. Compact motion. It’s out quick and it’s humming. He can put it anywhere he wants to put it.”\n- Name to remember for the 2017 draft: Texas A&M DE Myles Garrett, who broke Jadeveon Clowney’s SEC freshman record with 11½ sacks in 2014 and already has 6½ through four games this season. One college assistant who faced the 6-foot-5, 262-pound sophomore recently compared Garrett to Clowney, who was the top pick last year. “Amazing explosiveness,” the coach said. And Garrett’s still just 19 years old.\n- At age 33, Jared Allen has lost burst. Teams aren’t threatened by his speed and shiftiness off the edge anymore. But the Panthers figure to get some pass rush from their newly acquired defensive end. The bigger drop-off from Charles Johnson may be in the run game, where Allen has shown an increasing propensity to get out of gaps.\n- The Indianapolis Colts’ early returns on their over-30 investments: G Todd Herremans is benched. OLB Trent Cole is sidelined by a knee injury. WR Andre Johnson has seven catches for 51 yards. Only RB Frank Gore has proven much of an upgrade, which isn’t saying much for a team Trent Richardson led in rushing a year ago. And Gore has only touched the ball 41 times (for 186 yards and two TDs).\n- The Chargers threw off QB Teddy Bridgewater and the Vikings’ passing game early last week with some unscouted edge pressures. Still down two o-line starters, Minnesota will have its hands full Sunday with DeMarcus Ware, Von Miller and that highly productive Broncs defense in Denver.\n- In two starts at Lambeau Field, Green Bay Packers QB Aaron Rodgers has turned eight offside or 12-men calls into free plays and penalties totaling 197 yards and two touchdowns. He also got a 34-yard completion from one of three offsides penalties at Chicago. Opponents are now practicing specifically for those free plays, but nobody has snuffed out the backyard attack yet. Just one more way for Rodgers to wreck a defense.\n- Raiders coach Dennis Allen barely was off the plane back from London last season before he lost his job, and he’s not alone. Since the NFL’s international series hit Wembley Stadium in 2007, there have been 11 games and the losing coach in five of them has been fired during or shortly after the season. (Broncos coach Josh McDaniels didn’t help himself by not reporting that one of his assistants videotaped part of the San Francisco's walkthrough there in 2010.) Joe Philbin’s slumping Miami Dolphins face the New York Jets on Sunday in the first of three Wembley games this season.\n- Pushing salary cap problems into the future can be a damaging cycle, but the New Orleans Saints’ recent restructure of QB Drew Brees’ contract is no big deal. Instead of $7.4 million in bonus proration against the cap (whether Brees is on the roster or not) in 2016, there’s now $10 million. That $2.6M difference is pocket change as the cap continues to rise. Decision time for the Saints will be the third day of the 2016 league year waiver period, when $10.85M of Brees’ $19.75M salary for next season would become fully guaranteed.\nTom’s Top 10\n1. Green Bay Packers (1): Down two top wideouts, Aaron Rodgers keeps playing like an MVP.\n2. New England Patriots (2): Two bye-week trades showed defensive depth needed addressing.\n3. Seattle Seahawks (3): If Marshawn Lynch’s hammy slows him, what’s the offensive identity?\n4. Denver Broncos (4): Aqib Talib as NFL defensive player of the year? It’s not a crazy thought.\n5. Pittsburgh Steelers (5): At age 35, Mike Vick’s job is to limit mistakes, feed his playmakers.\n6. Cincinnati Bengals (6): Best tests yet come at home the next two weeks vs. Chiefs, Seahawks.\n7. Arizona Cardinals (7): Just put Bruce Arians’ name on the coach of the year ballot every year.\n8. Minnesota Vikings (NR): Aggressive D battered Philip Rivers. Can it get to Peyton Manning?\n9. Buffalo Bills (NR): Two dominant wins. Only loss to Patriots. Schedule is favorable to bye.\n10. Atlanta Falcons (NR): They don’t face another 2014 playoff team until Week 11 (Colts).\nDropped out: St. Louis Rams (8), Baltimore Ravens (9), Dallas Cowboys (10).\n* Note: Does not factor in the results of Thursday’s game.\nFollow Tom Pelissero on Twitter @TomPelissero\nGo to MSN Home", "external_links": ["http://www.usatoday.com/sports/", "http://go.microsoft.com/fwlink/?LinkID=286759", "http://twitter.com/TomPelissero"], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-02T11:30:58.002+03:00", "highlightTitle": ""}