{"organizations": [], "uuid": "1087cd467a63daba5b5c2aa000479473b7a7d386", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.woai.com", "main_image": "http://img.ccrd.clearchannel.com/media/mlib/2135/2015/10/default/high_school_football_season_ki_0_1444903174.jpg", "site_section": "http://www.woai.com/rss/feed-104670/", "section_title": "National - Sports Top Stories", "url": "http://www.woai.com/articles/sports-top-stories-104670/coach-defies-school-that-demanded-he-14036763/", "country": "US", "title": "Coach Defies School That Demanded He Stop Praying With Players", "performance_score": 0, "site": "woai.com", "participants_count": 0, "title_full": "Coach Defies School That Demanded He Stop Praying With Players", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T01:23:00.000+03:00", "replies_count": 0, "uuid": "1087cd467a63daba5b5c2aa000479473b7a7d386"}, "author": "", "url": "http://www.woai.com/articles/sports-top-stories-104670/coach-defies-school-that-demanded-he-14036763/", "ord_in_thread": 0, "title": "Coach Defies School That Demanded He Stop Praying With Players", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  6pm \nThe Washington state high school football coach who was forbidden by his school district from praying with his team decided he will defy the school. \nCoach Joe Kennedy, a Desert Storm and Desert Shield combat veteran, has been praying at the 50-yard line since 2008, and it eventually became a tradition where the players joined him. But Bremerton School District told Kennedy last month that he must stop the prayers so as not to “alienate” any students. Initially, he agreed, but now he’s decided to fight it.   \"show\", \"id\" : 27321912, \"name\" : \"The Prayer Altar 2015\", \"description\" : \"Join Prophet Jonathan Dorn for powerful weekly prayer! Discover prayer tools and sharpen your spiritual weapons as the Prophet prays with and for you! Hear recording here or Listen LIVE Tuesdays and Fridays at 6pm Eastern call 218-895-0680 code:3535 \", \"slug\" : \"53-The-Prayer-Altar-2015\" } } \n“I spent 20 years in the military fighting to defend the Constitution and it didn’t seem right that I wasn’t allowed to say a prayer with my guys after a football game was over,” Kennedy told The Daily Caller News Foundation. “I’m standing up for what I believe is right.” \nHiram Sasser, Kennedy’s counsel with the Liberty Institute, said Kennedy will go out to the middle of the field and pray aloud, just like he always has, and if other people decide to gather around him, there’s nothing he can do to stop it. Kennedy’s decision to pray could cost him his job. \n“I really don’t think it will come to that,” Kennedy told TheDCNF. “I really think the school is going to do the right thing.” \nSasser said that while the district says the prayers violate the Constitution, it is actually the district violating Kennedy’s First Amendment rights. \n“It’s really clear that there has never been a complaint,” Sasser told TheDCNF. “For whatever reason the school district decided they wanted to censor Coach Kennedy.” \nIt’s unclear what the school will do, but its previous comments clearly show that Kennedy’s decision directly defies the district.", "external_links": [], "published": "2015-10-16T01:23:00.000+03:00", "crawled": "2015-10-20T08:20:27.551+03:00", "highlightTitle": ""}