{"organizations": [], "uuid": "9fe3337fce2bdf642cee4cc4c6bb8ae966923cf7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theglobeandmail.com", "main_image": "http://static.theglobeandmail.ca/beb/sports/article26772613.ece/ALTERNATES/w620/web-bb-reynolds12sp1.JPG", "site_section": "http://www.theglobeandmail.com/sports/?service=rss", "section_title": "The Globe and Mail - Sports", "url": "http://www.theglobeandmail.com/sports/baseball/reynolds-says-his-comment-was-a-joke-in-the-game-and-not-meant-to-offend/article26772144/?cmpid=rss1", "country": "CA", "title": "Canada baseball comment ‘was a joke' says Fox commentator: 'I never ever want to offend'", "performance_score": 0, "site": "theglobeandmail.com", "participants_count": 1, "title_full": "Canada baseball comment ‘was a joke' says Fox commentator: 'I never ever want to offend'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T23:36:00.000+03:00", "replies_count": 0, "uuid": "9fe3337fce2bdf642cee4cc4c6bb8ae966923cf7"}, "author": "Gregory Strong", "url": "http://www.theglobeandmail.com/sports/baseball/reynolds-says-his-comment-was-a-joke-in-the-game-and-not-meant-to-offend/article26772144/?cmpid=rss1", "ord_in_thread": 0, "title": "Canada baseball comment ‘was a joke' says Fox commentator: 'I never ever want to offend'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A A Television broadcaster Harold Reynolds apologized on Monday and said that he didn’t mean to upset Canadians with a comment he made during Game 3 of the American League Division Series. After a foul ball by Blue Jays outfielder Jose Bautista in the fourth inning of Sunday’s 5-1 win over the Texas Rangers, the FOX commentator took a shot at Canada’s baseball ability. “We were talking about foul balls in the stands up in Toronto, and because there’s not a lot of people that grew up playing baseball in Canada, they’re not used to catching a lot of balls in the stands ... not many people catching that one, anyway,” Reynolds said. The Rangers won the first two games in the best-of-five series at Rogers Centre before the series moved to Globe Life Park for Games 3 and 4. “Sorry Canada, whole country, if I offended you for that,” said Reynolds on Monday in an interview on Sportsnet during the pre-game show in Canada. “I’m well aware of the baseball players that have come out of there. Dalton Pompey and Russell Martin, who will be catching tonight for the Jays, are from there. Joey Votto’s a Canadian. Justin Morneau.” In the interview Reynolds — who does not have Twitter or other social media accounts — said he was unaware of the controversy until former National League MVP Larry Walker of Maple Ridge, B.C., called him Monday morning. “I do the draft every year,” said Reynolds in the televised interview. “I think Canada’s up and coming, particularly in the northwest, Vancouver area. So I’m well versed in that. It was more of a joke and the fact that most people grew up playing hockey in Canada. I didn’t think it was that offensive, so obviously I was taken different.” Reynolds also spoke with media on Monday ahead of the TV interview and Toronto’s pivotal game in Arlington, Texas. “I never ever want to offend people,” he said. “That’s never the nature of my heart, that’s not who I am. So it was never (meant) to be offensive, not at all. That’s it.” His on-air comment drew the ire of many from north of the border and quickly picked up steam on social media. Walker posted his thoughts on Twitter. “I won 7 gold gloves. I think part of winning them was cause I could catch,” he tweeted from his verified account. Reynolds said he was surprised at how the comment became such a hot talking point. “I don’t have much to say about it,” he told reporters. “I don’t want to inflame this thing. It was just a simple comment that was a joke in the game.” Baseball Canada also sent out a tweet during Game 3 that included pictures of Walker, Colorado Rockies slugger Justin Morneau of New Westminster, B.C., and Toronto native Joey Votto of the Cincinnati Reds. “Amazing how we produced three MVPs for a country that doesn’t play a lot of baseball! #TeamC.” Game 4 was scheduled for later Monday afternoon. A deciding Game 5, if necessary, would be played Wednesday in Toronto. The Blue Jays have two Canadians on their playoff roster: Toronto native Russell Martin and Dalton Pompey of Mississauga, Ont. Reynolds said in the televised interview that both had been teasing him about the remarks before Game 4 and that Walker had thanked him over the phone for the 4,000 new Twitter followers the Canadian got thanks to his tweet. Reynolds spent 12 seasons in Major League Baseball. The two-time all-star won three Gold Glove awards.", "external_links": [], "published": "2015-10-12T23:36:00.000+03:00", "crawled": "2015-10-13T00:27:49.198+03:00", "highlightTitle": ""}