{"organizations": ["RWC"], "uuid": "ec5c68ac973b0a1683ef29130e7cb3967a2bcc03", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pendletontimespost.com", "main_image": "", "site_section": "http://pendletontimespost.com//feed/sec/6000/", "section_title": "PendletonTimesPost.com - Sports News", "url": "http://www.pendletontimespost.com/view/story/31055996c96447f8887e7c7f60533ae0/RGU--RWC-Habana-Lomu/", "country": "US", "title": "Inspired by the great Lomu, Habana equals his RWC record", "performance_score": 0, "site": "pendletontimespost.com", "participants_count": 0, "title_full": "Inspired by the great Lomu, Habana equals his RWC record", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T01:26:00.000+03:00", "replies_count": 0, "uuid": "ec5c68ac973b0a1683ef29130e7cb3967a2bcc03"}, "author": "", "url": "http://www.pendletontimespost.com/view/story/31055996c96447f8887e7c7f60533ae0/RGU--RWC-Habana-Lomu/", "ord_in_thread": 0, "title": "Inspired by the great Lomu, Habana equals his RWC record", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Byran Habana", "Habana", "Lomu", "JOHN PYE"], "text": "Byran Habana matches the World Cup record of Lomu, the man who was a rugby inspiration By JOHN PYE AP Sports Writer   6:25   6:26   \nPeople: \nAfrica (700) \n\nLONDON — Bryan Habana had never played rugby before the 1995 World Cup, a tournament he remembers vividly for the way blockbusting All Blacks winger Jonah Lomu carved up England's defense and for the way Nelson Mandela presented the winning trophy to the Springboks. \nHe'd traveled with his father to the opening game, where the Springboks were playing the defending champion Australians, and was one of the 60,000 crammed into Ellis Park when host South Africa held off Lomu's New Zealand team to claim the title. \nIt was all very inspirational stuff for an impressionable lad, including a chance meeting with Lomu when he was chasing an autograph. \nThe 32-year-old Springboks winger recounted it all on Wednesday after equaling Lomu's record for career tries at the Rugby World Cup, crossing for his 13th, 14th and 15th tries within a 20-minute span in the second half of a 64-0 win over the United States at London's Olympic Stadium. \n\"I don't think I could equate myself with Jonah and what he was able to do for the game,\" Habana said. \"For me, he is an inspiration. \n\"In 1995, for me in that World Cup to see a guy like Jonah Lomu demolish England all by himself, how he went on to become a global superstar ... I will never forget. I was there targeting signatures.\" \nHabana said he and his brother were so keen to get Lomu's signature that they chased him into the restrooms. \n\"Me and my brother actually had to run into the bathroom where Jonah was, in a public area, and get his — again an unbelievable amount of respect for the way he changed the game, what he gave to the game, even more so for what he meant to the game.\" \nHabana was meters from having the Rugby World Cup record in his own right, too, but knocked on near the line against the Americans. He'll get another chance when South Africa lines up in the quarterfinals against the loser of Saturday's Australia vs. Wales game in Pool A. The Australians ended South Africa's run in the quarterfinals in 2011 in New Zealand. \nA veteran of 114 tests, Habana said he was humbled and proud to be considered in the same sentence as Lomu, saying the giant winger was \"not only a hero and a role model but an unbelievable professional.\" \nLomu, who scored his 15 tries in the '95 and '99 World Cups and was easily the most identifiable player in the game, was quick to congratulate Habana. \n\"Congrats brother your a great ambassador of our great game blessings 2 you n your family,\" he posted on Twitter. \nHabana also moved up to equal second on the all-time try-scoring list with Australia great David Campese with his 64th test try. \nCoach Heyneke Meyer said the Springboks struggled for cohesion and consistency due to injuries to senior players all season, and the shocking opening loss to Japan at the World Cup could easily have plunged the team into a downward spiral. Since then, they've won three games convincingly to secure top spot in Pool B. \n\"He is always the guy who comes through in the big games,\" Meyer said. \"Bryan, when we really needed him in the last two or three weeks, did his best for us. I am so proud of him — not just as a rugby player but as a human being as well.\" \nScrumhalf Fourie Du Preez, who has been playing test rugby with Habana since 2004 and was captain of the team on Wednesday, said his long-time teammate was a genius at finding his way to the tryline because of his instinct to be in the right place at the right time. \nIt was a Du Preez grubber kick toward the in-goal 62 seconds into the second half against the Americans that led directly to Habana's first try. Later, Habana was backing up when he got an inside ball from Jesse Kriel, who split the defense, and for the third, all he had to do was pounce on a loose ball from an American error to touch down. \nIn the eyes of the big fron-trower Tendai Mtawarira, all the tries count for the same regardless of how Habana scored them. \n\"Bryan is an exceptional human being and he's achieved a lot, he's a role model for all of us — we look up to him,\" Mtawarira said. \"We want to see him go forward and break more records.\" \nAll content copyright ©2015 Pendleton Times-Post, a division of Home News Enterprises unless otherwise noted.", "external_links": [], "published": "2015-10-08T01:26:00.000+03:00", "crawled": "2015-10-08T01:47:56.221+03:00", "highlightTitle": ""}