{"organizations": [], "uuid": "be581ed575aca2d0f02f6b5aacb80eff36f9a079", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "cjonline.com", "main_image": "http://cjonline.com/sites/default/files/14809906.jpg", "site_section": "http://cjonline.com/taxonomy/term/2/feed", "section_title": "Sports", "url": "http://cjonline.com/sports/auto-racing/2015-10-14/steve-letarte-enjoying-new-perch-nascar-race-day", "country": "US", "title": "Steve Letarte enjoying new perch on NASCAR race day", "performance_score": 0, "site": "cjonline.com", "participants_count": 1, "title_full": "Steve Letarte enjoying new perch on NASCAR race day", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T01:00:00.000+03:00", "replies_count": 0, "uuid": "be581ed575aca2d0f02f6b5aacb80eff36f9a079"}, "author": "Rick Peterson", "url": "http://cjonline.com/sports/auto-racing/2015-10-14/steve-letarte-enjoying-new-perch-nascar-race-day", "ord_in_thread": 0, "title": "Steve Letarte enjoying new perch on NASCAR race day", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Steve Letarte enjoying new perch on NASCAR race day Former crew chief goes from pit box to broadcast booth Posted: October 14, 2015 - 5:00pm Photos 2014 FILE PHOTOTGRAPH/THE ASSOCIATED PRESS Steve Letarte, right, admits there are times he missed being a crew chief for star drivers like Dale Earnhardt Jr., right. But Letarte says the transition to color analyst for NBC Sports has been a smooth one. By Rick Peterson rick.peterson@cjonline.com \nFormer NASCAR Sprint Cup Series crew chief Steve Letarte admits there are times he misses being in the garage area or on top of the pit box. \nBut the former crew chief for Jeff Gordon and Dale Earnhardt Jr. also feels like he's been able to make a quick adjustment to his new job, as a color analyst for NBC Sports. \n“Sunday morning is definitely the hardest day for me not to be a crew chief,” said Letarte, who will help broadcast Sunday's NASCAR Sprint Cup Series Hollywood Casino 400 at Kansas Speedway. “For 20 years I woke up either as a mechanic or a tire guy or a crew chief with the opportunity to win a race. \n“Now when I wake up Sunday morning I have a responsibility to cover the race and I take that very seriously, but there's the lack of that underlying pressure to try to win and that's something that I've learned to kind of deal with. Sunday's are definitely the toughest but once the green flag falls and I have the opportunity to stand up in the booth and cover the race that fills (his excitement level) right back up.” \nThe 36-year-old Letarte ended two decades with Hendrick Motorsports after the 2014 season and said he's having fun in his new stint with NBC. \n“I'm really enjoying this new position that gives me an opportunity to cover the races that I love,” Letarte said. “If I wasn't talking about them on TV I'd still be watching them. I'm a huge NASCAR fan, a huge race fan in general so the opportunity to cover these races for the fans is really exciting. \n“Without a doubt I still have a ton to learn. I'm only 13, 14 races in as an analyst so there's definitely a lot for me to learn but there's a great team at NBC kind of held my hand through the start of it and let me just be me and that's still really the case. I'm just me when I'm up there doing the best job I know how to do and I'm definitely learning a lot about the broadcast side every week.” \nLetarte said he tries to be as objective as he can be while also trying to inform the viewers, particularly from a crew chief standpoint. \n“I think I have a responsibility to be fair and honest,” he said. “The most important thing to me is that I explain the situation. I explain to the fan on which side of the call I would have been on, why I would have been on (that side) but then I try to paint the picture of both sides of the fence so the fan at home can then make their own decision. \n“I just want to educate the fan on the decisions the crew chiefs make and how they make them, whether they're right or wrong.” \nLetarte said he has fond memories of Kansas Speedway and feels like Sunday's race could be a key in the Chase for the Sprint Cup. \n“I loved racing at Kansas,” he said. “I thought it was a great mix of speed and grip. It's become more difficult to race at with the re-pave because track position and pit strategy have become a premium, which actually fit my style better because I was always a track position-type of crew chief. \n“I think there's a lot of Chase drivers now that need to look at it as an opportunity, with Talladega (Ala.) looming a week out. They're going to have to try to go out and win this week to try the eliminate the pressure of Talladega.” WEEKEND RACE SCHEDULE \n9:30 a.m. — ARCA Series practice \n12 p.m. — NASCAR Sprint Cup Series practice \n1:30 — NASCAR Xfinity Series practice \n2:30 — ARCA qualifying", "external_links": [], "published": "2015-10-15T01:00:00.000+03:00", "crawled": "2015-10-15T10:41:56.421+03:00", "highlightTitle": ""}