{"organizations": ["Roma By DANIELLA MATAR Associated Press", "Fiorentina", "Juventus", "Atalanta"], "uuid": "d63d5657d5be17252d33fac36b9635fd0a470a08", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pendletontimespost.com", "main_image": "", "site_section": "http://pendletontimespost.com//feed/sec/6000/", "section_title": "PendletonTimesPost.com - Sports News", "url": "http://www.pendletontimespost.com/view/story/3c2c2b587181403e963368aa000c7d54/SOC--Italian-Roundup/", "country": "US", "title": "Juventus beats Atalanta 2-0 ahead of table-topping clash", "performance_score": 0, "site": "pendletontimespost.com", "participants_count": 0, "title_full": "Juventus beats Atalanta 2-0 ahead of table-topping clash", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T18:36:00.000+02:00", "replies_count": 0, "uuid": "d63d5657d5be17252d33fac36b9635fd0a470a08"}, "author": "", "url": "http://www.pendletontimespost.com/view/story/3c2c2b587181403e963368aa000c7d54/SOC--Italian-Roundup/", "ord_in_thread": 0, "title": "Juventus beats Atalanta 2-0 ahead of table-topping clash", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Juventus beats 10-man Atalanta 2-0 ahead of table-topping clash between Fiorentina and Roma By DANIELLA MATAR Associated Press   12:35 pmLast   12:36 pm   \nPeople: Photo Gallery: \nClick to view (4 Photos) \nMILAN — Juventus recorded only its third league win of the season by beating 10-man Atalanta 2-0 on Sunday. \nPaulo Dybala and Mario Mandzukic had given Juventus a comfortable lead before Atalanta defender Rafael Toloi was sent off for a second booking, leaving the visitors with 10 men for the final 16 minutes. \nAtalanta goalkeeper Marco Sportiello saved a penalty by Paul Pogba shortly afterward. \nAC Milan remained a point ahead of Juventus after beating 10-man Sassuolo 2-1, as Gianluigi Donnarumma became the youngest ever goalkeeper to start a Serie A match — aged 16 years and eight months. \nUdinese won 1-0 against Frosinone and Sampdoria beat Hellas Verona 4-1 in the lunchtime kickoff. \nSerie A leader Fiorentina hosts third-place Roma later, while Lazio hosts Torino. Chievo Verona welcomes fourth-place Napoli in the evening match. \nJuventus was desperate for a win as it was 15th in Serie A, surprisingly five points below Atalanta. \nMandzukic had a couple of early chances to give Juventus the lead but had a weak shot blocked by Sportiello before failing to control a Paul Pogba through ball. \nJuventus did take the lead in the 28th as a powerful Dybala effort from outside the area flew under the bar, with Sportiello wrongfooted. It was Dybala's second goal in his past three league matches for Juventus \nJuventus was getting most of its players back from injury but suffered a fresh blow when Roberto Pereyra pulled up clutching his hamstring and was replaced by Kwadwo Asamoah. \nDybala almost doubled his tally and Juve's advantage on the stroke of halftime but Sportiello instinctively stuck out a foot to deny the Argentina forward. \nJuventus did not have to wait long for a second as Dybala latched onto Pogba's backheeled flick and crossed from the left side of the area for Mandzukic to slot home from close range for his first Serie A goal. \nPogba could have got on the scoresheet himself in the 79th after Dybala was brought down by Gabriel Paletta but Sportiello saved the France international's penalty. \nMilan coach Sinisa Mihajlovic was also under pressure and he took a surprise risk, dropping Diego Lopez for Donnarumma. \nThe hosts went in front on the half hour when Carlos Bacca confidently converted a penalty after he was fouled by Andrea Consigli, who was shown a straight red card. \nDomenico Berardi had scored seven goals against Milan and he added to that tally in the 53rd minute with a free kick into the far side of the net. \nHowever, Milan snatched all three points when substitute Luiz Adriano headed in a corner four minutes from time. \n ", "external_links": [], "published": "2015-10-25T18:36:00.000+02:00", "crawled": "2015-10-25T19:59:19.662+02:00", "highlightTitle": ""}