{"organizations": [], "uuid": "4783256f83302f47637838e2d1da771c033b86f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/Category/6/51/Sports/Egyptian-Football.aspx", "section_title": "Egyptian Football - Sports - Ahram Online ", "url": "http://english.ahram.org.eg/NewsContent/6/51/161857/Sports/Egyptian-Football/Ahly-bags-an-easy-win-over-Mahalla-win-in-Egyptian.aspx", "country": "EG", "title": "Ahly bags an easy win over Mahalla win in Egyptian league - Egyptian Football", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Ahly bags an easy win over Mahalla win in Egyptian league - Egyptian Football - Sports - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:00:00.000+02:00", "replies_count": 0, "uuid": "4783256f83302f47637838e2d1da771c033b86f6"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/6/51/161857/Sports/Egyptian-Football/Ahly-bags-an-easy-win-over-Mahalla-win-in-Egyptian.aspx", "ord_in_thread": 0, "title": "Ahly bags an easy win over Mahalla win in Egyptian league - Egyptian Football", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Match facts: Ahly v Ghazl El-Mahalla (Egyptian Premier League) Preview: Zamalek, Ahly eye second league wins over Egypt's league minnows VIDEO: El-Saied long-range looping shot gives Peseiro winning league start Ahly claimed an easy 2-0 win over minnows Ghazl El-Mahalla in the Egyptian league on Sunday, thanks to goals from midfielders Abdallah El-Saied and Hossam Ghaly.\nEl-Saied opened the scoring from the spot in the 38 th minute. Skipper Ghaly doubled the lead eight minutes from time.\nThe win is Ahly's second in as many games, following their narrow 1-0 victory over Talae El-Geish in the opening week, as they start a long bid to win the league after losing the title to arch-rivals Zamalek last season.\nPlay was mainly restricted to midfield in the opening stages until the 12 th minute when Walid Soliman managed to run in behind the Mahalla defence before seeing his cross headed narrowly high by lone striker John Antwi.\nThe 37 th minute saw a Mahalla defender handle the ball inside the area, forcing the referee to point to the spot.\nEl-Saied stepped up to take the penalty. Hmade no mistake from 12 yards – sending the keeper the wrong way.\nFollowing the goal, Ahly played with less intensity against an opponent that did not look quite capable of posing threat on goal.\nBut on the stroke of half time, Mahalla, the away side, spurned a golden opportunity to draw level, when a through-on-goal Ramadan Rabie missed the target after beating Ahly's offside trap.\nAt the other end, ex-Ismaily striker Antwi also wasted a big chance to double Ahly's lead nine minutes after the break, when he saw his header blocked by keeper Mohamed Fawzi.\nBut it was the 88 th minute when Ahly managed to make it two as Ghaly struck home from inside the area after keeper Fawzi parried Antwi's header into the captain's path.\n ", "external_links": ["https://twitter.com/AO_Sports", "https://www.facebook.com/AhramOnlineSports?fref=ts"], "published": "2015-10-26T02:00:00.000+02:00", "crawled": "2015-10-26T15:22:19.396+02:00", "highlightTitle": ""}