{"organizations": [], "uuid": "a46c4aee9f2cdc362bd097f71bf053b807a93fd3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "ncadvertiser.com", "main_image": "http://ncadvertiser.hanewsmedia.com/wp-content/uploads/sites/29/2015/09/milano-football.jpg", "site_section": "http://feeds.feedburner.com/ncadvertiser/hByc", "section_title": "New Canaan Advertiser » Sports", "url": "http://ncadvertiser.com/58467/top-cat-middleburys-milano-earns-nescac-football-honor/", "country": "US", "title": "Top Cat: Middlebury’s Milano earns NESCAC football honor", "performance_score": 0, "site": "ncadvertiser.com", "participants_count": 1, "title_full": "Top Cat: Middlebury’s Milano earns NESCAC football honor", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T15:00:00.000+03:00", "replies_count": 0, "uuid": "a46c4aee9f2cdc362bd097f71bf053b807a93fd3"}, "author": "Dave Stewart", "url": "http://ncadvertiser.com/58467/top-cat-middleburys-milano-earns-nescac-football-honor/", "ord_in_thread": 0, "title": "Top Cat: Middlebury’s Milano earns NESCAC football honor", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Matt Milano had a prolific junior season for the Middlebury Panthers football team last fall, passing for 24 touchdowns and better than 2,000 yards. In his first game this year is any indication, his senior season could be even better. Milano earned NESCAC Offensive Player of the Week honors after throwing for 337 yards and three touchdowns as Middlebury topped the Wesleyan Cardinals, 28-25, Saturday in Middletown, Ct. The Panthers were in danger of losing the game when Wesleyan’s Mark Piccirillo rushed for a 12-yard touchdown to put the Cards ahead 25-21 with just 5:49 remaining. The lead did not last long however, as 39 seconds later, Milano connected with receiver Diego Meritus on a swing pass and Meritus went 43 yards for the touchdown. Kicker Charlie Gordon hit the PAT for a three-point lead, and the defense did the rest, forcing a Wesleyan punt on the next possession, and ending the game with an interception by Wesley Becton. Milano , who scored Middlebury’s first touchdown of the season on a six-yard run early in the first quarter, completed 23-of-34 passes and threw for his three touchdowns during the second half. Wesleyan led 19-7 early in the second half when Milano threw a 20-yard TD pass to Trevor Miletich to cut the deficit to 19-14. Milano and Miletich hooked up again later in the third quarter, this time for a nine-yard touchdown which put the Panthers ahead 21-19. After Piccirillo’s TD run gave the lead back to the Cardinals, Milano ended the game with a win on his final touchdown pass. Milano’s top target in the game was Ryan Rizzo, who caught five passes for 129 yards, while Miletich, Matthew Minno, Ian Riley, and Meritus each caught four passes. The performance continued Milano’s run of success for Middlebury, as he was 179-of-291 passing for 2,004 yards and 24 touchdowns last fall. In his career, Milano has completed 214-of-347 passes for a 61.7%. He’s thrown for 2,456 yards and 27 touchdowns, with just four interceptions. Middlebury will hold its home opener on Saturday when it hosts Colby at 1 p.m. and that game can be viewed live at athletics.middlebury.edu. Middlebury senior Matt Milano of New Canaan threw for 347 yards and three touchdowns as the Panthers defeated Wesleyan in their season opener on Saturday. Milano was named the NESCAC Offensive Player of the Week. — Middlebury Athletics photo", "external_links": [], "published": "2015-09-30T15:00:00.000+03:00", "crawled": "2015-10-01T02:13:05.858+03:00", "highlightTitle": ""}