{"organizations": [], "uuid": "4fe714cb583fa4ae1ea3164c194cc1e42d2d3bd5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.examiner.com", "main_image": "http://cdn2-b.examiner.com/sites/default/files/styles/image_content_width/hash/36/84/3684596c805e79653ddd02647a30514d.jpg?itok=rth8B-58", "site_section": "http://www.examiner.com/sports", "section_title": "Sports | Examiner.com", "url": "http://www.examiner.com/article/don-mattingly-out-as-dodger-manager", "country": "US", "title": "Don Mattingly out as Dodger manager", "performance_score": 0, "site": "examiner.com", "participants_count": 1, "title_full": "Don Mattingly out as Dodger manager | Examiner.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T20:23:00.000+03:00", "replies_count": 0, "uuid": "4fe714cb583fa4ae1ea3164c194cc1e42d2d3bd5"}, "author": "Jim Smiley", "url": "http://www.examiner.com/article/don-mattingly-out-as-dodger-manager", "ord_in_thread": 0, "title": "Don Mattingly out as Dodger manager", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Don Mattingly will not return to the Dodgers in 2016. The team announced it as a mutual decision. Photo by Mike Stobe/Getty Images The Dodgers and Don Mattingly have agreed to part ways, the team announced in a press release Thursday . Dodger President of Baseball Operations Andrew Friedman and his staff met with Mattingly after the team was ousted in the NLDS. The two sides realized a different direction was needed.\n“As our end of season process began, we discussed the past year, our future goals, necessary changes, roster needs and other matters relating to next year’s campaign,” said Friedman. “As the dialogue progressed daily, it evolved to a point where we all agreed that it might be best for both sides to start fresh. We decided to think about it for a couple of days and when we spoke again, we felt comfortable that this was the direction to go.”\nAs skipper of the Dodgers for five years, Mattingly posted a 446-363 record, good for a winning percentage of .551. Each of the last three seasons the Dodgers won at least 90 games and were champions of the NL West. Over the course of his Los Angeles run, the team averaged 89.2 wins per season and finished in the top three of the division each season. He also served three years in LA as bench coach under Joe Torre.\nMattingly took the high road as he left the only team he’s ever piloted.\n“I’m honored and proud to have had the opportunity to manage the Los Angeles Dodgers ,” said Mattingly. “I’ve enjoyed my experiences and relationships with the organization’s staff and players throughout my eight years in L.A.”\nThe knock on Mattingly has been the team’s performance in the post season . In the last three seasons, the Dodgers have won only 8 of the 19 post-season games. The new front office inherited Mattingly from the prior regime and was likely ready to have their own choice as manager of the team. Sporting the highest payroll in the history of North American Sports, the early exit from this post season was a clear disappointment.\nPlayers and management alike praised Mattingly’s handling of the clubhouse. Known for his calm and even nature, Mattingly navigated through rough waters with the likes of Hanley Ramirez, Brian Wilson, Matt Kemp, and Yasiel Puig. In his statement, Mattingly spoke of the thought process as the decision unfolded, making it clear that he wishes to manage another team in 2016.\n“We talked about several scenarios, including my returning in 2016,” he said. “However, I believe this is the right time and right move for both parties. I’m still very passionate about managing and hope to get the opportunity in the near future. In the meantime, I want to thank the Dodger organization, the city and our fans for the opportunity and wish the club well going forward.”\nMattingly will likely draw interest from a number of clubs, including the Florida Marlins who were linked to the former MVP in a mid-season report. Meanwhile, the Dodgers figure to leave no stone unturned in the search for a man to pilot them to their first World Series title since 1988.", "external_links": ["http://m.dodgers.mlb.com/news/article/155279952", "http://www.cbssports.com/mlb/writer/jon-heyman/25332673/marlins-have-keen-interest-in-don-mattingly-if-he-becomes-available", "http://www.usatoday.com/story/sports/mlb/2015/10/16/dodgers-ousted-early-from-postseason-for-3rd-straight-year/74035404/"], "published": "2015-10-22T20:23:00.000+03:00", "crawled": "2015-10-23T03:05:23.423+03:00", "highlightTitle": ""}