{"organizations": [], "uuid": "79660097e4c2ef02caca042c7f649d6e7bc8dccb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/6/51/161299/Sports/Egyptian-Football/Ahlys-ballstanding-man-apologizes-for-Zamaleks-ang.aspx", "country": "EG", "title": "Ahly's ball-standing man apologizes for Zamalek's angered players - Egyptian Football - Sports", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Ahly's ball-standing man apologizes for Zamalek's angered players - Egyptian Football - Sports - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "79660097e4c2ef02caca042c7f649d6e7bc8dccb"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/6/51/161299/Sports/Egyptian-Football/Ahlys-ballstanding-man-apologizes-for-Zamaleks-ang.aspx", "ord_in_thread": 0, "title": "Ahly's ball-standing man apologizes for Zamalek's angered players - Egyptian Football - Sports", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Zamalek to fine skipper Emam for Sobhi reaction Ahly to fine Sobhi for showboating in Cairo derby Ahly's Sobhi apologises to Zamalek for perceived showboating in Cairo derby Ahly's youngster Ramadan Sobhi has apologised to Zamalek players and fans for showboating during the 3-2 win over the Whites in the Egyptian Super Cup last week.\nThe 18-year-old stood on the ball, repeating a scene that he made during his side’s 2-0 win over Zamalek in a league game, in an attempted feint that was deemed provocative by Zamalek players during the Super Cup game.\nThe move prompted Zamalek's players to react and the game was suspended for around 10 minutes due to clashes that occurred on the pitch between the two teams.\n\"I apologise to the Zamalek players as they are all my friends and I didn't intend to insult them,\" Sobhi told Ahly television channel on Saturday.\n\"If I intended to insult Zamalek players by this move (standing on the ball) I wouldn't do it in the 77th minute as we didn't secure the result.\n\"I stood on the ball spontaneously and I didn't mean to insult them.\n\"I promise not to do it again for a third time.\"\nAhly's interim coach Abdel-Aziz Abdel-Shafi ‘Zizo’, who took charge of the Zamalek game, confirmed Sobhi will be reprimanded for his behavior.\n\"Sobhi will be fined for his behavior during the game,\" the Ahly coach said in the post-match news conference.\nIt's the second time for Sobhi to apologize for the same behavior as he excused for the move in a scene that he made during his sides 2-0 win over Zamalek in the Egyptian Premier League.\nThe club has not determined the player's sanction.\n(For more sports news and updates, follow Ahram Online Sports on Twitter at @AO_Sports and on Facebook at AhramOnlineSports .)", "external_links": ["https://twitter.com/AO_Sports", "https://www.facebook.com/AhramOnlineSports?fref=ts"], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-20T04:16:44.048+03:00", "highlightTitle": ""}