{"organizations": [], "uuid": "92c589b097be6d02c444f6730f68b2c67775eccc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reviewjournal.com", "main_image": "http://www.reviewjournal.com/sites/default/files/field/media/1003870255_spt-kantowski-_2.jpg", "site_section": "http://www.reviewjournal.com/sports", "section_title": "Sports | Las Vegas Review-Journal", "url": "http://www.reviewjournal.com/opinion/columns-blogs/ron-kantowski/bull-rides-have-be-eight-seconds-says-who", "country": "US", "title": "Bull rides have to be eight seconds? Says who?", "performance_score": 0, "site": "reviewjournal.com", "participants_count": 1, "title_full": "Bull rides have to be eight seconds? Says who? | Las Vegas Review-Journal", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T23:39:00.000+03:00", "replies_count": 0, "uuid": "92c589b097be6d02c444f6730f68b2c67775eccc"}, "author": "Ron Kantowski", "url": "http://www.reviewjournal.com/opinion/columns-blogs/ron-kantowski/bull-rides-have-be-eight-seconds-says-who", "ord_in_thread": 0, "title": "Bull rides have to be eight seconds? Says who?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I remember watching a documentary about baseball — it was probably that Ken Burns series — that said the distance of 90 feet between home plate and first base seemed to be ordained by God, or by some previous iteration of Tony La Russa. Ninety feet was the perfect distance to keep baseball in balance, it said.\nIf it was 91 feet from home plate to first, the league batting average might be around .200. You'd have to be Usain Bolt to steal second base, or Jon Lester would have to be pitching. Infield singles would mostly disappear. Guys would get thrown out a lot on sharply hit balls to right field.\nOn the plus side, there would be fewer umpire challenges.\nIf it was 89 feet from home to first, almost every nubber hit to the left of second base would be a single. Shift or no shift. Except, perhaps, were it Bartolo Colon who had hit the nubber.\nBaseball would be a completely different game if it was 89 feet between the bases, or 91. And what if the grounds crew that put down the first pitcher's rubber had put it down 60 feet from home plate, as was intended, instead of 60 feet 6 inches, which was a mistake?\nHow many more no-hitters would Nolan Ryan have?\nSo with the Professional Bull Riders in town to decide their championship at the Thomas & Mack Center, I asked J.B. Mauney, one of the best, how his sport would be different if a guy was required to ride for seven seconds, or for nine, or for some other arbitrary length of time, instead of for eight seconds.\n\"I don't know if it would change it a whole lot,\" said Mauney, who once rode Bushwacker for a chuteload of points after the notorious bull had bucked off 56 cowboys in a row, and who tops the standings heading into the finals.\n\"But I always joke around when I get thrown off at 7½ seconds — I always say I wonder who that idiot was who came up with eight seconds.\"\nSo who was the idiot who came up with eight seconds?\n\"I have no clue,\" said Mauney, who is from North Carolina. \"That's just how it's always been.\"\nThe last time I saw Mauney before Wednesday was on Memorial Day weekend at the Mandalay Bay pool during the PBR's Cowboy Spring Break. It was around 10 a.m., and it was raining, and he was sipping on a Miller Lite from a tall boy can.\nOn Tuesday when we talked, it was at the swanky Rouge lounge at the MGM. Lots of polished chrome accents and Ferrari-red furnishings. No Miller Lite. Mauney had on his bull riding uniform — black hat, black shirt festooned with Monster Energy and Tyson Foods patches, blue jeans, boots — and he took another second or two to ponder my eight-second inquiry.\n\"If it was seven,\" he said, \"I wouldn't have to ride near as long. You would make it (to the whistle) more, I guess. If it was nine, you probably wouldn't make as many (successful rides).\"\nMauney chuckled. There you have it, as simple as it sounds.\n\"There's been a lot of 'em where I've been 7.5, 7.7, 7.8,\" said Mauney, who is trying to win his second PBR title in three years, if the Brazilians who trail him on the leaderboard will cooperate by riding for only 7.5 seconds, or for 7.7 or 7.8. \"Close only counts in horseshoes and hand grenades, I guess.\"\nAs for the idiot who came up with eight seconds, I was told by a guy in a black hat at Rouge that the bulls tire of bucking at around eight seconds, and so that's why it's eight instead of seven or nine seconds.\nMauney isn't buying the black-hat logic. He said PBR bulls have staying power and will continue bucking until the whistle blows. Whenever that is.\n\"They exercise them bulls just like they do racehorses. Them bulls are really in shape,\" he said.\nHe said though he likes his position starting these finals — he'd rather be first than second, he said, and there's that common sense thing again — and though he's required to stay on board for eight seconds, Mauney said he'll try to stay on board for 10. You hear a lot of the riders say that, he says, rather than trust their internal clocks.\nShould he get bucked off at 7.5 or 7.7, he'll get up and dust himself off, God and the Dickies bullfighters willing. Maybe he'll ponder horseshoes and hand grenades.\nAnd then it may occur again to J.B. Mauney that whoever decided it should be eight seconds might have been an idiot.\nLas Vegas Review-Journal sports columnist Ron Kantowski can be reached at rkantowski@reviewjournal.com or 702-383-0352. Follow him on Twitter: @ronkantowski\nWhat were the odds?... ", "external_links": ["http://lasvegasreviewjournal.disqus.com/?url=http%3A%2F%2Forigin-www.reviewjournal.com%2Fopinion%2Fcolumns-blogs%2Fron-kantowski%2Fbull-rides-have-be-eight-seconds-says-who", "http://www.twitter.com/@ronkantowski", "https://www.youtube.com/embed/kASKcD-Vz-I?rel=0"], "published": "2015-10-21T23:39:00.000+03:00", "crawled": "2015-10-22T21:16:32.348+03:00", "highlightTitle": ""}