{"organizations": [], "uuid": "452429619d7cdf25cb0e1da7701fe33a7fd8fac4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fltimes.com", "main_image": "", "site_section": "http://www.fltimes.com//search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&nsa=eedition&c[]=sports,sports/*&f=rss", "section_title": "Finger Lakes Times - sports,sports/", "url": "http://www.fltimes.com/sports/article_759f6b12-754d-11e5-b0a4-c7fbb8dc5850.html", "country": "US", "title": "COLLEGE SOCCER: Hobart sweeps weekend set", "performance_score": 0, "site": "fltimes.com", "participants_count": 1, "title_full": "COLLEGE SOCCER: Hobart sweeps weekend set", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T21:00:00.000+03:00", "replies_count": 0, "uuid": "452429619d7cdf25cb0e1da7701fe33a7fd8fac4"}, "author": "Times Sports Staff", "url": "http://www.fltimes.com/sports/article_759f6b12-754d-11e5-b0a4-c7fbb8dc5850.html", "ord_in_thread": 0, "title": "COLLEGE SOCCER: Hobart sweeps weekend set", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Spencer Tulis / Finger Lakes Times Clyde-Savannah at Red Jacket football \nRed Jacket’s Dan Colasurdo (20) and Dan Brown (21) collide with Clyde-Savannah’s Ryan Garrett as the ball comes loose during Saturday’s Finger Lakes West game in Shortsville. Spencer Tulis / Finger Lakes Times Clyde-Savannah at Red Jacket football \nClyde-Savannah’s Raymond Williams (67) and Jarrod Faniel try to tackle Red Jacket runner Dan Colasurdo Saturday. Red Jacket 28, Clyde-Savannah 14 \nKey Stat \nRed Jacket running back Sean Sheets racked up 228 yards on the ground. \nTurning Point \nIndians quarterback Thomas Palmeri hit Dan Brown for 13 yards on fourth down and nine to extend the Indians’ first scoring drive of the fourth quarter. \nAnd We Quote \n“It’s a great feeling. We still have a lot of work to do. We have a new season coming up and we have to keep it going.” — Red Jacket running back Sean Sheets. \nRed Jacket 7 7 0 14 — 28 \nClyde-Savannah 8 6 0 0 — 14 \nRJ—Thomas Palmeri 1 run (Tyler Gardner run). \nCS—Ryan Garrett 30 p.f. Nathan Paddock (Zackary DeAngelis kick). \nRJ—Kris Amos 37 p.f. Thomas Palmeri (run failed). \nCS—Derrick Chance 1 run (Zackary DeAngelis kick). \nRJ—Sean Sheets 6 run (Dan Colasurdo run). \nRJ—Dan Colasurdo 2 run (run failed). Posted: Sunday, October 18, 2015 2:00 pm HS FOOTBALL: Red Jacket tops Clyde-Savannah to win FL West title By JOSHUA DeSAIN jdesain@fltimes.com Finger Lakes Times | 0 comments \nSHORTSVILLE — The undefeated matchup that was six weeks in the making finally arrived Saturday afternoon. \nClyde-Savannah and Red Jacket squared off for the Finger Lakes West title. The two division foes didn’t disappoint the faithful that braved the chilly and windy conditions. \nRed Jacket snapped a 14-all tie with a fourth-quarter touchdown drive that took nearly six minutes off the clock, sparking 14 unanswered points and a 28-14 triumph. \n“I thought we showed our heart, our grit and our determination,” Red Jacket coach Josh Henninger said of the fourth quarter. “It’s stuff that we’ve talked about since day one, and that is something that you can’t replace.” \nThe Indians (7-0) earned their fourth consecutive league crown and locked up the top seed in the upcoming Section V Class D tournament. \n“They made the plays in the fourth quarter and we didn’t,” Clyde-Savannah coach Nick DerCola Jr. remarked. “We missed tackles and we missed a couple of assignments. \n“I just told the guys that we’re going to have to come back and learn from this, and go into sectionals and play better.” \nRed Jacket was able to churn clock in the fourth quarter with the help of an enormous fourth down conversion. Quarterback Thomas Palmeri (4-of-9 for 75 yards) hit Dan Brown for 13 yards on fourth down and nine at Clyde-Savannah’s 19-yard line. \nRunning back Sean Sheets, who finished with 228 rushing yards, powered in from six yards out on the very next play to give the Indians a 22-14 lead with 6:33 left. \n“Clyde-Savannah is a great team and they have a lot of hard workers and great players,” Sheets said. “It wasn’t me that was getting all these yards and touchdowns. It was the front five, the guys that are playing in the trenches.” \nAfter a turnover on downs by the Golden Eagles (6-1), Sheets scampered for 52 yards down to Clyde-Savannah’s two-yard line. Dan Colasurdo followed with a two-yard touchdown plunge for a 14-point edge. \nRed Jacket began the game in great field position following a punt that placed them at Clyde-Savannah’s 33-yard line. \nPalmeri eventually notched a one-yard touchdown for an 8-0 advantage with 6:13 left in the first quarter. \nClyde-Savannah quarterback Nathan Paddock (7-of-12 for 69 yards) answered back when he tossed a 30-yard touchdown pass to Ryan Garrett, who hauled it in over his shoulder and just stayed in bounds as he hit the end zone to make it 8-7 just before the end of the frame. \nPalmeri gave the Indians the lead back when he found a wide open Kris Amos for a 37-yard score and a 14-7 edge in the second quarter. \nClyde-Savannah’s Derrick Chance created the 14-14 tie with a one-yard touchdown with 4:21 left in the half. \nClyde-Savannah’s Joseph Dapolito intercepted a pass in the third quarter, but Sheets swung the momentum right back to the Indians when he recovered a fumble at Red Jacket’s 26-yard line. \nThe two teams went scoreless in the third quarter before Red Jacket’s fourth quarter outburst.", "external_links": [], "published": "2015-10-18T21:00:00.000+03:00", "crawled": "2015-10-19T00:01:22.005+03:00", "highlightTitle": ""}