{"organizations": [], "uuid": "932c81e3c2b1bf162462e3a857693e8b8daf2a72", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nj.com", "main_image": "http://imgick.nj.com/home/njo-media/width620/img/njcom_photos/photo/2015/10/22/19024993-standard.jpg", "site_section": "http://blog.nj.com/realtimesports_impact/rss.xml", "section_title": "New Jersey Real-Time Sports", "url": "http://www.nj.com/giants/index.ssf/2015/10/giants_odell_beckham_jr_says_he_will_practice_satu.html", "country": "IL", "title": "Giants' Odell Beckham Jr. says he will practice Saturday, play Sunday", "performance_score": 0, "site": "nj.com", "participants_count": 1, "title_full": "Giants' Odell Beckham Jr. says he will practice Saturday, play Sunday", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T23:09:00.000+03:00", "replies_count": 0, "uuid": "932c81e3c2b1bf162462e3a857693e8b8daf2a72"}, "author": "James Kratch | NJ Advance Media for NJ.com", "url": "http://www.nj.com/giants/index.ssf/2015/10/giants_odell_beckham_jr_says_he_will_practice_satu.html", "ord_in_thread": 0, "title": "Giants' Odell Beckham Jr. says he will practice Saturday, play Sunday", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Beckham said he will practice Saturday - as he did before the Giants' last game against the Eagles - and then play Sunday. \n\"It feels good, it feels great. I'm just focused on Sunday,\" Beckham said. \"We're going to be all right.\" \nBeckham was briefly with the team walking through plays during the portion of practice open to the media Thursday. He said he is \"easing into\" preparations for Dallas, and devoting more energy to mental reps. \nPLUS : 10 things Giants fans need to know about the Cowboys Odell Beckham teaching Rueben Randle to do Odell Beckham things Giants wide receiver Odell Beckham appears to be teaching fellow Giants WR Rueben Randle how to do Odell Beckham things during practice Thursday. \n\"It's just kind of one of those things you've got to maintain, and get as many reps as you can, whether they're physical or mental,\" Beckham said. \"Get as many mental reps you can, make sure you come out prepared and stick to the game plan.\" \nBeckham admitted it can be challenging at times to miss practice heading into a game. But, he said, his experience last season, when he missed the first four games with a hamstring injury, taught him how to better prepare under such circumstances. \n\"I like to run around and feel it out. You practice hard, and you play hard,\" Beckham said. \"Sometimes it is hard to not be able to practice and just have to go in to it. But that's where the mental reps really kick in.\" TALK IS CHEAP, Ep. 28: Sloppy Giants got what they deserved vs. Eagles \nWe knew it was going to be a tough spot for the Giants, but after the ugly 27-7 loss in Philadelphia, some may be wondering: Is this déjà vu all over again? Subscribe to the podcast on iTunes or Stitcher . \nJames Kratch can be reached at jkratch@njadvancemedia.com or by leaving a note in the comments below. Follow him on Twitter @JamesKratch . Find and like NJ.com Giants on Facebook .", "external_links": [], "published": "2015-10-22T23:09:00.000+03:00", "crawled": "2015-10-22T23:29:06.341+03:00", "highlightTitle": ""}