{"organizations": [], "uuid": "ffaedf26286b0d9e125b4d946648e4d0780b36cf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribtown.com", "main_image": "http://cdn1.tribtown.com/st_assets/images/the_tribune_sq.jpg", "site_section": "http://www.tribtown.com//feed/sec/6000", "section_title": "TribTown.com - Sports News", "url": "http://www.tribtown.com/view/story/3cb09c0e184a4e23b589baa47569faf4/BBA--Rangers-Wrapup", "country": "US", "title": "Rangers don't want another bizarre ending to define season after unexpected AL West title", "performance_score": 0, "site": "tribtown.com", "participants_count": 0, "title_full": "Rangers don't want another bizarre ending to define season after unexpected AL West title", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T00:06:00.000+03:00", "replies_count": 0, "uuid": "ffaedf26286b0d9e125b4d946648e4d0780b36cf"}, "author": "", "url": "http://www.tribtown.com/view/story/3cb09c0e184a4e23b589baa47569faf4/BBA--Rangers-Wrapup", "ord_in_thread": 0, "title": "Rangers don't want another bizarre ending to define season after unexpected AL West title", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["STEPHEN HAWKINS"], "text": "Rangers don't want another bizarre ending to define season after unexpected AL West title By STEPHEN HAWKINS AP Sports Writer   5:05 pmLast   5:06 pm   \nPeople: \nTexas (1310) \nARLINGTON, Texas — It was another bizarre ending to a Texas Rangers season. \nFour years after twice being within one strike of a World Series title, the Rangers were ahead in the decisive Game 5 of the AL Division Series in Toronto. Then came a strange play in the top half of a nearly hour-long seventh inning and three consecutive errors that cost Texas dearly in the season-ending 6-3 loss — their third in a row after taking a 2-0 lead in the series. \n\"That one inning in a set of three games will not define our season,\" first-year manager Jeff Banister declared. \nBoxes filled the Rangers clubhouse Thursday as players cleared out their lockers, though only a few were there when it was open to reporters. \n\"Definitely since the moment I've been here, just really, really pleased and happy with the group of guys I get to play with,\" left-hander Cole Hamels said. \"I really do truly look forward to, not only next season, but the next couple of years. ... There's a lot of really bright spots and some good things that are going to happen.\" \nWhile the gut-punching finish cost them a trip to their third AL Championship Series in six seasons, the Rangers exceeded the expectations of many in a season that began after ace Yu Darvish was lost to Tommy John surgery in spring training. \n\"Where we started in spring training, the entire baseball world has us, I think, picked 27th,\" Banister said. \"We don't get to go where we believe we can go. ... We won the American League West when nobody thought we would do anything in the game of baseball.\" \nStill, it will take shortstop Elvis Andrus and his teammates — and fans — some time to get over how it all ended. \n\"It's going to be a long offseason,\" said Andrus, who had two of the errors and was involved in the third. \nAndrus is one seven Rangers who were also part of that 2011 World Series, when twice in Game 6 at St. Louis they were within a strike a strike of a championship before losing in 11 innings. They led 2-0 only four batters into Game 7 before losing 6-2, their second loss in as many years in the World Series. \nAfter an AL-high 95 losses last year, Texas was 8-16 and already 9 1-2 games out of first place a month into this season. That deficit was still eight games to start August after acquiring Hamels, along with relievers Sam Dyson and Jake Diekman. \nThe Rangers lost Hamels' first two starts, then won 11 consecutive games he started, including his complete game three-hitter to clinch the division on the final day of the regular season, and Game 2 of the ALDS in Toronto for a 2-0 series lead. \nHamels went back to the mound for the bottom of the seventh Wednesday with a 3-2 lead after Rougned Odor scored on catcher Russell Martin's throwback to the pitcher that deflected off Shin-Soo Choo in the batter's box. But those infield errors preceded Jose Bautista's tiebreaking three-run homer off Dyson. \nTexas became only the third team to lose a best-of-five series after winning the first two games on the road. \nThe Rangers have Hamels signed through 2018 with a club option for 2019. Diekman and Dyson are also under contract, as are designated hitter Prince Fielder and every position player who started Game 5 in Toronto. \nTwo starting pitchers, Yovani Gallardo and 17-game winner Colby Lewis, can become free agents. \nThe Rangers could try to re-sign both Gallardo and Lewis, and can look forward to getting Darvish back in the rotation next season with Hamels. Plus, left-handers Derek Holland and Martin Perez both returned this season from injuries and started ALDS games. \n ", "external_links": [], "published": "2015-10-16T00:06:00.000+03:00", "crawled": "2015-10-16T00:26:41.804+03:00", "highlightTitle": ""}