{"organizations": ["Louisiana Tech", "UTSA", "Golden Eagles", "Southern Miss Golden Eagles"], "uuid": "cffadd11efadf21d2ca6f89a67c06bc2684bb63d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.clarionledger.com", "main_image": "http://www.gannett-cdn.com/-mm-/213a3a88654e896e23fe3d739d952af33be1581d/c=0-60-1024-636&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/12/JacksonMS/B9319243294Z.1_20151012233734_000_GMIC7L9FV.1-0.jpg", "site_section": "http://rssfeeds.clarionledger.com/jacksonms/southernmisssports", "section_title": "Jackson MS - Southern Miss Sports", "url": "http://www.clarionledger.com/story/sports/college/southern-miss/2015/10/12/frustrated-monken-good-enough/73852784/", "country": "US", "title": "Frustrated Monken: 'We're good enough'", "performance_score": 0, "site": "clarionledger.com", "participants_count": 0, "title_full": "Frustrated Monken: 'We're good enough'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T06:37:00.000+03:00", "replies_count": 0, "uuid": "cffadd11efadf21d2ca6f89a67c06bc2684bb63d"}, "author": "", "url": "http://www.clarionledger.com/story/sports/college/southern-miss/2015/10/12/frustrated-monken-good-enough/73852784/", "ord_in_thread": 0, "title": "Frustrated Monken: 'We're good enough'", "locations": ["Hattiesburg"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Todd Monken", "Monken", "Norman Price", "Jordan Mitchell", "Marshall", "Nick Mullens", "Jason Munz"], "text": "Frustrated Monken: 'We're good enough' Southern Miss at the midpoint Jason Munz, The Hattiesburg American Sponsored by OFFENSE Save the loss at Marshall, the Golden Eagles have played great on offense. Penalties and their performance at Marshall count against them, though . Grade : B DEFENSE Has given up a ton of yards in most games. Has also improved greatly in recent weeks. Grade: C MOST PLEASANT SURPRISE Jordan Mitchell, wide receiver: The former Oak Grove star was a contingency plan when Southern Miss scooped him up at the last minute prior to National Signing Day in 2014. After taking a year off, he's provided an unlikely shot in the arm early with six catches for 77 yards and a touchdown. MOST IMPROVED PLAYER Norman Price, offensive tackle: The big man struggled last season coming out of junior college. But he's been a rock at right tackle this season. MIDSEASON MVP Midseason MVP: Nick Mullens, quarterback: The junior has guided the team to as many wins as 2014 in half the time. He's also on pace to shatter the school's single-season record for passing yards. WHAT USM NEEDS TO DO TO IMPROVE Correct special teams issues: The Golden Eagles are 5-for-10 on field goal tries this season, with a long of 33 yards. The team has been better in kickoff and punt return coverage, but the former bit the Golden Eagles in a loss last week. BIGGEST GAME LEFT ON THE SCHEDULE Louisiana Tech, Nov. 28, Time TBA: The Golden Eagles will tell you the next game is the biggest left on the schedule. But they should handle their business against UTSA, making the season finale, at preseason C-USA West Division-favorite Louisiana Tech, a critical matchup. EXPECTATIONS FOR THE SECOND HALF Southern Miss has what it takes to make a run at the West. The Golden Eagles must not have any slip-ups in the next five games, though, against what should be considered inferior opponents. Realistically, a 4-2 finish in the back half of the slate gets the team back into a bowl game. Jason Munz, Southern Miss Sports Writer 11:56 p.m. CDT October 12, 2015 Southern Miss Golden Eagles head coach Todd Monken says the team needs to eliminate the turnovers. (Photo: Chuck Cook-USA TODAY Sports) 1 CONNECT TWEET LINKEDIN COMMENT EMAIL MORE \nTodd Monken was frustrated after last week’s loss at Marshall. \nThree days later, there are still elements of the Oct. 9 contest, won by the Thundering Herd, 31-10, that are stuck in the third-year Southern Miss head coach’s craw. \nNot because Monken is dreading having to deal with things like unsportsmanlike conduct penalties following a touchdown that result in the opponent being afforded a short field for the rest of the season. \nQuite the opposite, in fact. \n“The frustrating thing is we’re good enough,” Monken said during Oct. 12's weekly press conference. “Maybe a couple of years ago, you go up there and lose 31-10 and you move the ball and you’re like, ‘Hey man, we’re getting better.’ No, we’re already there. We’re good enough, and that’s the frustrating thing.” \nThe Golden Eagles (3-3, 1-1 in Conference USA) moved the ball against Marshall, gaining a total 439 yards on offense, while the defense was relatively stingy, limiting the Thundering Herd to just 277 yards. \nBut turnovers as well as ill-timed and senseless penalties kept Southern Miss from having more success last week. Monken’s squad lost four fumbles (two by quarterback Nick Mullens, one by receiver Casey Martin and one by running back Jalen Richard) and Mullens was intercepted once. In addition, receiver Mike Thomas was flagged for unsportsmanlike conduct following a post-touchdown celebration the officials deemed excessive. And lineman Darian Yancey jumped offsides before a Marshall field goal attempt, giving the home team another shot at a touchdown — which it took advantage of. \n“Those are frustrating as well,” Monken said. “Those are things that eliminate momentum. And it’s something we hadn’t really done. We had actually done pretty well on special teams the last few weeks, minus the field goal stuff. So we’ve got to get that cleaned up.” \nOffensive coordinator Chip Lindsey said there are no excuses for committing five turnovers in a game, especially after having amassed just five giveaways in the previous five contests. \n“It’s too many,” he said. “We’ve got to do a better job. It’s something we’ve emphasized a lot, so it’s disappointing it showed up in a big game like that. For us to win these big games, we’ve got to make sure we take care of the ball.” \nSouthern Miss plays host Texas-San Antonio at 6 p.m. Saturday in the team’s homecoming game. 1 CONNECT TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http://on.thec-l.com/1RDIwDa TOP VIDEOS", "external_links": [], "published": "2015-10-13T06:37:00.000+03:00", "crawled": "2015-10-13T08:03:59.746+03:00", "highlightTitle": ""}