{"organizations": [], "uuid": "769615a5013be338db62347c08cc7fb653c2e3d4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.siftingsherald.com", "main_image": "http://www.siftingsherald.com/storyimage/AR/20150930/SPORTS/150939963/AR/0/AR-150939963.jpg", "site_section": "http://www.siftingsherald.com/sports?template=rss&mime=xml", "section_title": "Sports - Arkadelphia Siftings Herald - Arkadelphia, AR", "url": "http://www.siftingsherald.com/article/20150930/SPORTS/150939963/2000/SPORTS?rssfeed=true", "country": "US", "title": "Freshman Lady Badgers beat Mena and Fountain Lake", "performance_score": 0, "site": "siftingsherald.com", "participants_count": 1, "title_full": "Freshman Lady Badgers beat Mena and Fountain Lake", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T23:42:00.000+03:00", "replies_count": 0, "uuid": "769615a5013be338db62347c08cc7fb653c2e3d4"}, "author": "Martin Couch", "url": "http://www.siftingsherald.com/article/20150930/SPORTS/150939963/2000/SPORTS?rssfeed=true", "ord_in_thread": 0, "title": "Freshman Lady Badgers beat Mena and Fountain Lake", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Freshman Lady Badgers beat Mena and Fountain Lake volleyball Posted Sep. 30, 2015 at 3:42 PM Lately, the Arkadelphia Lady Badgers freshman volleyball team has been on a winning streak. In the 7-4A conference, the Lady Badgers are 5-1 after Tuesday's two-game win over visiting Fountain Lake. Arkadelphia won 25-17 and 25-15. \"What is hard to believe is that we have played 22 games and it may be harder to believe that we have won 16 of them,\" Arkadelphia freshman volleyball head coach Mark Coon said. The Lady Badgers played in a tournament in Jessieville and beat Jessieville, Mena and Haskell Harmony Grove. The only losses of the tournament came to Paris and Hot Springs Lakeside. \"They are really good teams and they have prepared us to play in this conference,\" Coon said. \"And then tonight we won and we won against Mena Thursday night. When you watch them you don't see one kid standing out. Everybody is doing their job. What you are seeing is a total team effort and the kids are really playing together and it is fun right now.\" In the first game against Fountain Lake, the Lady Badgers fell behind 3-1, but battled back and Hannah Fenocchi served two aces, while Jamari Whitaker had a kill in a 5-0 run that put Arkadelphia ahead 8-3. Whitaker later served an ace, then Darlene Scott had a kill, Ke'arlyn Anderson had a kill, Seana Humphries had a kill and Scott served an ace to lead 14-8. Kamryn Thorne had a kill, then Halie Campbell served an ace and Fenocchi had two kills in a row. Humphries added a kill and Fenocchi served two aces in a row for a 22-15 lead. Another ace from Whitaker and two service errors by Fountain Lake gave the Lady Badgers a Game 1 victory. In Game 2, after falling behind 2-0, Fenocchi had a kill and Campbell served up three aces in a row for a 4-2 lead. Thorne got an ace serve and Fenocchi had two aces for a 10-4 lead. Scott had a kill, Whitaker had an ace and Humphries closed out another run with a kill to make it 13-6. Thorne had a kill, Campbell served another ace, Fenocchi had two kills in a row and Humphries had a kill for a 22-13 lead. Two net plays by Fountain Lake allowed the Lady Badgers the win in Game 2. \"If you look at who we have lost to, the one loss against Malvern is one we probably should have won and the other losses, two of them were to Hot Springs Lakeside, one to Paris and one to Greenwood,\" Coon said. \"Those are some volleyball powerhouse teams.\" The Lady Badgers play at home on Thursday afternoon against Waldron.", "external_links": [], "published": "2015-09-30T23:42:00.000+03:00", "crawled": "2015-10-01T10:37:08.411+03:00", "highlightTitle": ""}