{"organizations": [], "uuid": "6b9dd4925f435db28170d04f4aded97ac3af4506", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dallasnews.com", "main_image": "http://www.dallasnews.com/incoming/20151022-1445556636-ns_22murray10.jpg.ece/BINARY/original/1445556636-NS_22murray10.jpg", "site_section": "http://www.dallasnews.com/sports/", "section_title": "Dallas-Fort Worth Sports News - News for Dallas, Texas ", "url": "http://www.dallasnews.com/sports/high-schools/headlines/20151022-thomas-jefferson-football-experiencing-resurgence-under-new-coach-philip-murray.ece", "country": "US", "title": "Thomas Jefferson football experiencing resurgence under new coach Philip Murray", "performance_score": 0, "site": "dallasnews.com", "participants_count": 3, "title_full": "Thomas Jefferson football experiencing resurgence under new coach Philip Murray | Dallas Morning News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T02:37:00.000+03:00", "replies_count": 2, "uuid": "6b9dd4925f435db28170d04f4aded97ac3af4506"}, "author": "Matt Wixon", "url": "http://www.dallasnews.com/sports/high-schools/headlines/20151022-thomas-jefferson-football-experiencing-resurgence-under-new-coach-philip-murray.ece", "ord_in_thread": 0, "title": "Thomas Jefferson football experiencing resurgence under new coach Philip Murray", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Five minutes after meeting his new team in April, Thomas Jefferson coach Philip Murray started mat drills. Hello everyone, I'm Coach Murray, and bam - right into offseason conditioning work.\nAfter 40 minutes, the players had worked up a good sweat, as well as a curiosity about the coach who left the affluent campus of Lovejoy for the challenge of a program in northwest Dallas that had averaged less than one win per season in the last decade.\n\"I wanted to set a tone early,\" Murray said, \"that it was about action, not discussion.\"\nSo there were few words from Murray, a 1999 Mesquite Poteet graduate who was an All-Ivy League safety at Columbia. But those few words sounded good to the Thomas Jefferson players.\n\"He said what he saw on film didn't match our record,\" said senior quarterback Kendrick Bright, who is now in his third year as starter. \"He said he saw potential in this team, and I believed him.\"\nThere's lots of reason to believe now at Thomas Jefferson (4-3, 2-2 in District 11-5A), a program that lost 36 straight games from 2007 to 2011. The Patriots already have twice as many wins as any team since 2003, and with three regular-season games left, TJ has a chance to get one of the district's four playoff spots. The Patriots play Carrollton Creekview (5-2, 4-0) on Friday, and even if they lose that game, they would probably clinch a playoff spot with wins the following two weeks over Bryan Adams (4-3, 3-1) and North Dallas (3-4, 0-4).\n\"Parents, the alumni, and of course the staff is very excited,\" said Thomas Jefferson principal Sandi Massey.\nWhat about the students?\nThey're excited, too, but you won't see many of them at the games. At a school where 92 percent of the students are economically disadvantaged, according to the Texas Education Association's latest figures, traveling to games at stadiums miles away can be difficult. Many of the students also have jobs to help support their families, and that includes the football players.\n\"When we don't have school, other teams can have practice,\" Murray said. \"It's hard for us, because when there's no school, our kids go to work. Three quarters of my team has a job. Their families require them to.\"\nMurray knew what he was getting into with his first head-coaching position. He spent three seasons as an assistant at Rockwall-Heath, but he also had one-year stints at Samuell and Adamson.\nHe knew there would be some big challenges.\n\"Getting things done in Dallas, can be at times, like push-starting the Titanic,\" he joked.\nBut Murray also said that DISD athletic director Gil Garza has been a strong advocate and encourager of the TJ program. And the Patriots are getting things done, as shown in last week's 28-21 victory over Hillcrest. The win snapped a 12-game losing streak against Hillcrest, and how's this for a turnaround:\nHillcrest had won the five previous games against TJ by a combined score of 261-7.\n\"I think this year, we all bond together,\" said Kendall Jackson, a senior safety and slot receiver. \"We might make mistakes, but we don't point fingers at each other.\"\nMurray wanted his team to be a reflection of the players' blue-collar culture, so the cornerstones of TJ's success are running the ball and stopping the run. Defensive lineman Aldo Ordaz and linebacker Nigel Smith are leaders on the defense, and 6-2, 310-pound Mike Gomez - aptly nicknamed \"Big Mike\" - anchors the offensive line. Bright, who has rushed 111 times for 802 yards and 10 touchdowns this season, is at the center of it all.\n\"We have an identity now,\" Murray said.\nAnd a little bit of tradition, too. On game days this year, each player takes his jersey to a teacher or staff member that he wants to thank for his or her support. The staff member then wears the jersey that day.\n\"The teachers really hope it's them,\" Massey said.\nAnd now the Thomas Jefferson players hope they'll be wearing their jerseys in the playoffs. Murray said it could be easy for the players to settle into the thought of \"look what we've done,\" but he wants them to think of what's still possible.\n\"I'm not coaching kids, I'm coaching future adults, and I want them to learn not to ever settle,\" Murray said. \"Whenever they succeed, that success is not where it stops. Don't be happy with the first step. Find the second. Find the third.\"\nTwitter: @mattwixon\nTJ turnaround\nThe records at Thomas Jefferson since 2003:\nYear; Rec.; Year; rec\n2015; 4-3; 2008; 0-9\n2014; 2-8; 2007; 1-9\n2013; 2-8; 2006; 2-8\n2012; 1-9; 2005; 0-10\n2011; 1-9; 2004; 1-9\n2010; 0-10; 2003; 0-10\n2009; 0-10;\nOn Twitter:\n @mattwixon", "external_links": ["https://twitter.com/mattwixon", "http://www.twitter.com/mattwixon"], "published": "2015-10-23T02:37:00.000+03:00", "crawled": "2015-10-23T13:54:15.808+03:00", "highlightTitle": ""}