{"organizations": [], "uuid": "8af68aee712be169391f633121f2adc2a485b4c7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newsday.com", "main_image": "http://cdn.newsday.com/polopoly_fs/1.10863970.1442701322!/httpImage/image.JPG_gen/derivatives/display_2008/image.JPG", "site_section": "http://www.newsday.com/sports", "section_title": "NY Sports News - Newsday - Scores, Schedules, News &amp; Standings | Newsday", "url": "http://www.newsday.com/sports/hockey/islanders/jaroslav-halak-upper-body-injury-leaves-midway-through-practice-1.10914422", "country": "US", "title": "Jaroslav Halak (upper-body injury) leaves midway through practice", "performance_score": 0, "site": "newsday.com", "participants_count": 5, "title_full": "Jaroslav Halak (upper-body injury) leaves midway through practice | Newsday", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T05:09:00.000+03:00", "replies_count": 4, "uuid": "c545812847b43981a0ab0ca088a34f46e345c304"}, "author": "ARTHUR STAPLE", "url": "http://www.newsday.com/sports/hockey/islanders/jaroslav-halak-upper-body-injury-leaves-midway-through-practice-1.10914422#post-0", "ord_in_thread": 0, "title": "Jaroslav Halak (upper-body injury) leaves midway through practice", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jaroslav Halak practiced Thursday. That should have been good news because Halak hadn't done much except one-on-one work with goaltending consultant Marc Champagne since early last week because of an upper-body injury.\nBut Halak didn't make it all the way through the practice, leaving the ice about midway through. And coach Jack Capuano was noncommittal when asked if Halak will be ready for next Friday's season opener.\nLatest Islanders stories Isles' goal horn coming to Brooklyn Barzal still sticking around at Isles camp Isles' Hickey out a month with upper-body injury Isles unable to goad Capitals' Wilson into fight Poulin leaves Isles, signs with Lightning \"We don't know yet,\" he said of his starting goaltender. \"Until we go through a full practice and I can talk to the trainers to see what they have to say, we don't know what's going to happen.\"\nThe Islanders are off Friday, so that leaves only five full on-ice days for Halak to get in regular-season shape. He's played exactly 40 minutes of preseason hockey -- the first two periods of the Isles' first home game (Sept. 21). He hadn't practiced since then until his half-workout Thursday.\nIt seems unlikely that Halak will get any work in the Islanders' final preseason game Sunday in Washington against the Capitals. Thomas Greiss and Stephon Williams have handled the bulk of the preseason workload in goal, though Greiss was signed in July to be Halak's backup (he's never appeared in more than 25 games in a season) and Williams is in his first full pro season.\nIslanders Islanders training camp 2015 Greiss played the full 60 minutes in the Isles' 3-1 loss to the Capitals on Monday, making 22 saves. It was his first time playing at Barclays Center and, like everyone else, he was paying attention to a lot more than just the shots coming in off opposing sticks.\n\"You want to see how the boards are, how the puck comes off, if there's any funny spots in the glass,\" Greiss said. \"It's just a matter of getting used to it.\"\nThe Islanders don't want to get used to not having Halak available. He appeared in a career-high 59 games last season, setting a franchise record with 38 wins. He had a .914 save percentage. Halak was on injured reserve once, around Christmas, missing two games with a groin injury.\nForward Steve Bernier (lower body) also returned to practice on Thursday after missing nearly a week of work. That left only Thomas Hickey (upper body, out four weeks) and Louis Leblanc (puck to the face) as Isles who didn't skate.\nSubscribe to Newsday’s sports newsletter for stories, photos and videos about your favorite New York teams plus national sports news and events.", "external_links": [], "published": "2015-10-02T05:09:00.000+03:00", "crawled": "2015-10-02T22:00:17.688+03:00", "highlightTitle": ""}