{"organizations": [], "uuid": "6da448469863bbb280a331d82ed1769ecede797f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kctv5.com", "main_image": "http://APMOBILE.images.worldnow.com/images/9039322_G.jpg", "site_section": "http://www.kctv5.com/", "section_title": "Kansas City, Missouri, Kansas News, Weather, Sports - KCTV5", "url": "http://www.kctv5.com/story/30284504/extensive-cleanup-underway-in-wake-of-california-storms", "country": "US", "title": "'Extensive' cleanup underway in wake of California storms", "performance_score": 0, "site": "kctv5.com", "participants_count": 1, "title_full": "'Extensive' cleanup underway in wake of California storms - KCTV5", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T08:51:00.000+03:00", "replies_count": 0, "uuid": "6da448469863bbb280a331d82ed1769ecede797f"}, "author": "cbs8", "url": "http://www.kctv5.com/story/30284504/extensive-cleanup-underway-in-wake-of-california-storms", "ord_in_thread": 0, "title": "'Extensive' cleanup underway in wake of California storms", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By AMANDA LEE MYERS\nAssociated Press LOS ANGELES (AP) - Homeowners in northern Los Angeles County communities were spending their Saturday digging mud out of their houses as crews continued extensive work to clear tons of dirt that clogged roadways and buried hundreds of cars.\nThe cleanup follows thunderstorms that unleashed flash flooding and debris flows on Thursday, damaging dozens of homes and trapping hundreds of cars on area highways and roads. No injuries were reported.\nKerjon Lee, a spokesman for Los Angeles County Public Works, said 50 field personnel and more than 30 pieces of heavy equipment were on the ground in the small mountain communities of Elizabeth Lake and Lake Hughes in Leona Valley, about 40 miles north of Los Angeles.\nHe said in that area alone, crews need to clear out 20,000 dump trucks worth of dirt, which could take months. The dirt eventually will be used to backfill eroded canyons.\nMeanwhile, Lee said at least one of the homes in the area is considered a total loss after flooding ripped it from its foundation. Crews were continuing to assess homes in the area on Saturday, and Lee said the number of those destroyed could rise.\nGary and Gina Hartle, who own a 70-acre horse ranch in Lake Hughes, said they have so much work to restore their property, they have no idea how long it will take.\n\"Our property is 75 percent devastated,\" Gina Hartle, 54, told The Associated Press on Saturday as she surveyed the damage. \"We can't access our homes too well right now because everything is washed out.\"\nShe said the two homes on the land seemed like they were OK, but that one of the homes was without water because of an inpump, and their 20-foot trailer is nowhere in sight.\n\"It either got buried or it's downriver,\" Hartle said.\nStill, Hartle said the couple feels lucky. Their pregnant daughter was at home during the storm and wasn't sure she was going to survive.\n\"She was scared. She knew she had to get moving because she felt she was on an island and the water was getting higher and higher,\" Hartle said. \"The water was up to her hips and she had to escape for her life and her unborn child's life.\"\nHartle said her daughter made it to a neighbor's home on foot.\nTwenty miles to the east in the Mojave Desert city of Lancaster, Jennifer Dunnagan and Rochelle Price wiped away tears as they assessed the damage to their home Friday.\nAbout 4 feet of water and mud got inside during the storm, destroyed a backyard spa and gazebo, and entombed multiple cars in dirt and mud, including a Model T and a replica of Herbie the Love Bug, the Volkswagen Beatle from the Disney movies of the same moniker, the Antelope Valley Press reported.\nDunnagan told the newspaper she has flood insurance, but many of her neighbors weren't as fortunate.\n\"All of these guys have been told they have not been covered,\" she said.\nLos Angeles County Supervisor Michael Antonovich said in a statement that he will ask the Board of Supervisors to approve declaring a local emergency for the communities in the Leona Valley, Quartz Hill and surrounding areas.\nIf approved as expected Tuesday, the emergency will free up state or federal resources to support recovery efforts.\nThe thunderstorms were powered by a low pressure system pulling in moisture from the south. As much as 1.45 inches of rain fell in a quick span of time near where the most intense flooding occurred.\nThe storms unleashed flash flooding and debris flows along State Route 58, Interstate 5 and throughout the area.\nThose who witnessed the worst of the flooding describe it as terrifying.\n\"It was a raging river of mud,\" said 51-year-old Rhonda Flores, who was in her car when the flooding overtook State Route 58. \"I've never experienced anything like it, ever.\"\nShe and hundreds of others on the roadway at the time were rescued about 10 hours later and spent the night at area shelters.\nSgt. Mario Lopez, a spokesman for the California Highway Patrol, said it will take days to reopen State Route 58, a mile of which is choked with mud between 2 and 6 feet deep. About 200 cars and semi-trucks were trapped in the now-hardened mud, frozen in place at odd angles.\nHeavy equipment and workers were in the process of freeing the vehicles and clearing the mud Saturday.\nHundreds of cars also were stuck on Interstate 5, a major artery, but those cars were cleared and the freeway reopened by late Friday.\nAssociated Press reporters Christine Armario, Sue Manning and John Rogers contributed to this report from Los Angeles, and Raquel Dillon contributed from Lake Hughes, Calif.\nCopyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-17T08:51:00.000+03:00", "crawled": "2015-10-18T08:02:52.122+03:00", "highlightTitle": ""}