{"organizations": [], "uuid": "4d3ae6a6ac31cdbc6b62a4db6e41a2f9cd91ea2f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtontimes.com", "main_image": "", "site_section": "http://www.washingtontimes.com/rss/headlines/sports/", "section_title": "www.washingtontimes.com stories: Sports", "url": "http://www.washingtontimes.com/news/2015/oct/1/49ers-defense-faces-formidable-task-in-packers-rod/", "country": "US", "title": "49ers defense faces formidable task in Packers, Rodgers", "performance_score": 0, "site": "washingtontimes.com", "participants_count": 1, "title_full": "49ers defense faces formidable task in Packers, Rodgers", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T02:43:00.000+03:00", "replies_count": 0, "uuid": "4d3ae6a6ac31cdbc6b62a4db6e41a2f9cd91ea2f"}, "author": "CHRIS BIDERMAN", "url": "http://www.washingtontimes.com/news/2015/oct/1/49ers-defense-faces-formidable-task-in-packers-rod/", "ord_in_thread": 0, "title": "49ers defense faces formidable task in Packers, Rodgers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "49ers defense faces formidable task in Packers, Rodgers By CHRIS BIDERMAN -   \nSANTA CLARA, Calif. (AP) - Things aren’t getting any easier for the struggling San Francisco 49ers, who were outscored 90-25 in their last two games. They’re set to take on Aaron Rodgers and the undefeated Packers on Sunday as they look to avoid a 1-3 start. \nThrough three weeks, Rodgers is completing passes at the highest rate of his career and hoping to beat San Francisco for the first time since 2010. That four-game stretch includes consecutive playoff losses to Colin Kaepernick under former 49ers head coach Jim Harbaugh. \nBut with Harbaugh gone, along with former defensive coordinator Vic Fangio, the 49ers are relying on new defensive coordinator Eric Mangini to create a scheme to stop the reigning league MVP. His defense allowed 676 yards passing over the last two weeks. \n“He’s very efficient,” Mangini said. “It’s one of those unique things, because even when you disrupt Aaron Rodgers, the plays he can make outside the pocket are different than some other guys.” \nRodgers is coming off a five-touchdown, 333-yard performance in a 38-28 win over the Kansas City Chiefs on Monday night. His 10 touchdown passes lead the NFL. \nThe 49ers were able to contain Rodgers in those four wins since 2012 thanks to a standout defense that finished in the top-10 in scoring in each season under Harbaugh and Fangio. But after three games this year, San Francisco ranks 31st in points allowed. \n“We’re familiar with the team,” third-year safety Eric Reid said. “Hopefully, we can use that experience to our advantage. But they’ve been playing great this year, so we definitely have to be on our Ps and Qs.” \nThe last time the 49ers faced Rodgers came in frigid Green Bay, when they held him to 177 yards passing and just one touchdown in the wild card round of the playoffs in January 2014. San Francisco won that game 23-20 on a 33-yard field goal from Phil Dawson as time expired. \nReid is one of four defensive starters remaining on the 49ers’ new-look defense that played in that game, along with linebacker NaVorro Bowman, linebacker Ahmad Brooks and cornerback Tramaine Brock. \n“We’re three weeks in, so a lot of teams are still figuring out the stuff they want to run and the stuff that’s working,” Rodgers said. “They’re whittling down their plans and continuing to add new stuff to the mix that they may have worked on in training camp.” \nRodgers, 31, might be playing at the highest level of his 11-year career. He’s been without two of his three best receiving threats for chunks of the season, including star receiver Jordy Nelson, who tore his anterior cruciate ligament in his right knee in a preseason game against the Steelers. One of Nelson’s understudies, Davante Adams, has been in and out of the lineup with a left ankle injury. \nThose injuries led to Green Bay bringing back veteran receiver James Jones, 31, who spent 2014 with the Oakland Raiders. Jones has four touchdown catches and 219 yards receiving in three games. \n“(Jones) is a big body with good speed and very good body control,” Rodgers said. “He does a good job of going through his routes and to the proper spot on time. He can win one-on-one matchups, and that’s what you have to do in this league. You have to be able to get off the press and make plays when the ball is in the air.” \nNOTES: 49ers RB Reggie Bush returned to practice this week for the first time since sustaining a left calf strain in the season-opening win against the Vikings. … TE Vernon Davis missed practice Wednesday, but returned Thursday as a limited participant after suffering a knee injury in Sunday’s 47-7 loss in Arizona. His status for the Packers game is unknown. \nCopyright © 2015 The Washington Times, LLC.", "external_links": [], "published": "2015-10-02T02:43:00.000+03:00", "crawled": "2015-10-02T03:31:54.424+03:00", "highlightTitle": ""}