{"organizations": [], "uuid": "04b202022df9337b44aebcdc1d3048a2680c6659", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.beloitdailynews.com", "main_image": "http://bloximages.chicago2.vip.townnews.com/beloitdailynews.com/content/tncms/assets/v3/editorial/b/03/b03a360e-748e-11e5-99d8-832bd02cb809/5621dab4a461d.image.jpg?resize=760%2C464", "site_section": "http://www.beloitdailynews.com/search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&c[]=sports,sports/*&f=rss", "section_title": "Beloit Daily News - sports,sports/", "url": "http://www.beloitdailynews.com/sports/trojans-momentum-builds/article_94744464-748e-11e5-aa84-3bf5554e3a4c.html", "country": "US", "title": "Trojans’ momentum builds", "performance_score": 0, "site": "beloitdailynews.com", "participants_count": 1, "title_full": "Trojans’ momentum builds", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T18:00:00.000+03:00", "replies_count": 0, "uuid": "04b202022df9337b44aebcdc1d3048a2680c6659"}, "author": "JUSTIN WOODARD Staff correspondent", "url": "http://www.beloitdailynews.com/sports/trojans-momentum-builds/article_94744464-748e-11e5-aa84-3bf5554e3a4c.html", "ord_in_thread": 0, "title": "Trojans’ momentum builds", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Josh Flickinger/Beloit Daily News Derek Diehl Turner coach Derek Diehl confers with Tyler Burt during the Trojans’ overtime win over Jefferson Friday night. Posted: Saturday, October 17, 2015 10:00 am Trojans’ momentum builds By JUSTIN WOODARD Staff correspondent beloitdailynews.com | 0 comments BELOIT — Having already finished in a four-way tie for first place in the Rock Valley South Conference at 4-2 with Brodhead/Juda, Big Foot and Clinton, the Trojans went into Friday night’s game against the Jefferson Eagles with a chance to finish with the best overall record of any of the four-way champs. After trailing 28-14 late in the third quarter, the Trojans forced the game into overtime and they came away with the 36-28 victory, improving their overall record to 7-2. “We are extremely proud of overcoming a 14-point deficit and defeating a Division 3 team,” Turner Head Coach Derek Diehl said. “They have over 100 more kids than we do in our school, and traditionally they’ve been a very good football team. We just beat a Division 3 football team. What more is there to say how proud we are?” The Eagles scored first on a 17-yard touchdown run from Hunter Milbrath, his first of three TDs on the night. After a two-point conversion, they led 8-0 with 8:40 to play in the first quarter. But Turner’s athletic sophomore, Juan Reyes, took the ensuing kickoff back 85 yards for a score and after the PAT the score was 8-7 in favor of the Eagles. With 12 seconds left in the first quarter, Milbrath scored on a 75-yard touchdown run. After a missed two-point conversion, the Eagles led 14-7 going into the second quarter. While senior quarterback Seth Smith started the game for the Trojans, he was unable to get much going so Reyes took over. With 6:49 to go in the second quarter, Reyes scored from four yards out and after the made PAT the score was even at 14-14. With 0:13 seconds to go before halftime, Jacob Arnold scored a six yard touchdown and the two-point conversion was no good. The Eagles took a 20-14 lead into halftime. The Trojans received the second half kickoff, but went three-and-out with Smith back in at quarterback. The Eagles killed a lot of clock in the third quarter on their way to another touchdown run from Milbrath and with 4:32 to go in the third quarter they led 28-14. The Trojans had been driving to end the third quarter and less than a minute into the final period, Justin Hansen scored from a yard out and the score was 28-21 after the PAT was good. The Eagles drove to the Trojans’ 1-yard line before turning the ball over on downs. Hansen ripped off a 65-yard run to get into Eagles’ territory and Reyes finished off the drive with a 16-yard touchdown run. Reyes then made his fourth extra point of the night to tie the game at 28-28. In OT, the Trojans got the ball first, and they wasted no time scoring as Hansen ran it in from 20 yards out. Reyes ran in the two-point conversion for a3 6-28 lead. “We’re up and the pressure is on them now,” Diehl said. “If we get a stop we win, and we keep our undefeated streak at home alive. This was a special game for us, with a special cause dedicated to breast cancer awareness.” The Eagles then got their opportunity to start from the 25, but they weren’t so successful. After getting down to the Trojans 1-yard line, they came up short again. Turner’s Ethan Burns recovered a fumble to seal the victory.", "external_links": [], "published": "2015-10-17T18:00:00.000+03:00", "crawled": "2015-10-19T07:04:58.705+03:00", "highlightTitle": ""}