{"organizations": ["North Queensland Cowboys", "News Corp Australia"], "uuid": "2e65f4fed8116abb4e31024eb120dcd7face0dbc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cairnspost.com.au", "main_image": "http://resources0.news.com.au/images/2015/10/13/1227568/083516-8868bddc-716c-11e5-ae14-397f78372f89.jpg", "site_section": "http://feeds.news.com.au/public/rss/2.0/cpost_news_sport_3328.xml", "section_title": "CairnsPost | Sports", "url": "http://www.cairnspost.com.au/sport/north-queensland-cowboys-to-visit-cairns-on-sunday/story-fnjpuwrj-1227568082709?from=public_rss", "country": "IL", "title": "Cowboys come to town", "performance_score": 0, "site": "cairnspost.com.au", "participants_count": 0, "title_full": "Cowboys come to town", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T23:20:00.000+03:00", "replies_count": 0, "uuid": "2e65f4fed8116abb4e31024eb120dcd7face0dbc"}, "author": "", "url": "http://www.cairnspost.com.au/sport/north-queensland-cowboys-to-visit-cairns-on-sunday/story-fnjpuwrj-1227568082709?from=public_rss", "ord_in_thread": 0, "title": "Cowboys come to town", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Johnathan Thurston", "Matt Scott"], "text": "North Queensland Cowboys to visit Cairns on Sunday by: What are these? Cowboys captains Matt Scott and Johnathan Thurston will visit Cairns on Sunday. PICTURE: SCOTT RADFORD-CHISHOLM. Source: News Corp Australia \nCAIRNS footy fans can meet their heroes when the history-making North Queensland Cowboys are presented with the keys to the city at Barlow Park on Sunday afternoon. \nCairns Regional Council has confirmed 12 members of the premiership-winning squad, including co-captains Johnathan Thurston and Matt Scott, will be at Barlow Park from 4pm to 5.40pm, with gates opening at 3pm. \nIt is understood the council plans to present Cowboys players and support staff with the keys to the city. More details will be known later this week, but the council has urged fans to “get there early”. \nThe special visit from the Cowboys comes as part of a whirlwind regional tour, with the players also flying to Mount Isa and Mackay on Sunday to meet fans and show off the Provan-Summons Trophy. \nCairns councillor Richie Bates said planning was under way to ensure the fans and Cowboys could make the most of their time at Barlow Park. \nAlthough yet to be confirmed, Cr Bates hoped the players would be able to sign autographs. \n“They have got a pretty big day but a time for signing autographs for fans would be fantastic,” he said. \n“We just want to make sure everyone is well enough prepared to maximise this opportunity.” \nCairns and District Rugby League secretary/operations manager Pat Bailey said Sunday afternoon would be a memorable occasion for the Far North’s rugby league community, particularly the juniors. \n“It will be just wonderful for the kids to get up close and personal with their heroes,” she said. “This being their first – but not last – premiership makes it all the more important for people to head along and celebrate with them.” \nCairns butcher and Cowboys fan Ben Vallely was looking forward to taking his kids to meet their heroes. “It will be a big turnout, but my little boy plays footy so he’ll be really keen to meet JT,” he said. \nEven the Australian Senate has been swept up in Cowboys fever after the club defeated the Brisbane Broncos by one point to clinch its maiden NRL premiership on October 4. \nA motion was moved by Queensland representatives Ian Macdonald and Jan McLucas to officially acknowledge the Cowboys’ win and was carried unanimously. \n“The role model provided by this team of genuine sportsmen perhaps does more for the development of young people than all the parliaments in the world put together,” it said.", "external_links": [], "published": "2015-10-13T23:20:00.000+03:00", "crawled": "2015-10-14T04:01:36.517+03:00", "highlightTitle": ""}