{"organizations": ["USC"], "uuid": "4d4ab20684338b0d7f1cd50f7a9af450f9612439", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ocregister.com", "main_image": "http://images.onset.freedom.com/ocregister/gallery/nvxuxv-b88533875z.120151008224907000grocg3st.10.jpg", "site_section": "http://ocregister.com//common/rss/rss.php?catID=18901", "section_title": "The Orange County Register - News Headlines : Sports", "url": "http://www.ocregister.com/articles/sarkisian-686778-usc-trojans.html", "country": "US", "title": "Miller: Steve Sarkisian outcoached, USC outplayed in loss to Washington", "performance_score": 0, "site": "ocregister.com", "participants_count": 0, "title_full": "Miller: Steve Sarkisian outcoached, USC outplayed in loss to Washington - The Orange County Register", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "4d4ab20684338b0d7f1cd50f7a9af450f9612439"}, "author": "", "url": "http://www.ocregister.com/articles/sarkisian-686778-usc-trojans.html", "ord_in_thread": 0, "title": "Miller: Steve Sarkisian outcoached, USC outplayed in loss to Washington", "locations": ["Washington LOS ANGELES"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Steve Sarkisian", "Miller"], "text": "LOS ANGELES – For four quarters, a bad football game kept developing. So, too, did a story significantly more graphic than merely bad.\nLet’s put this as simply as possible: Today is not a good day to be Steve Sarkisian.\nOne-loss college teams still interested in competing nationally pretty much face must-wins every week.\nBut for USC’s Sarkisian, this one Thursday was the double-secret probation of must-wins, a win easily mustier than any game he’d coached yet for the Trojans.\nLeading Washington by the eye-rubbing, temple-massaging score of 6-3 at halftime, USC never did what USC so often does in the second half, the Trojans instead repeatedly stalling in a 17-12 loss that invited the fiercest wrath of Trojans fans and the sharpest mockery of everyone else upon Sarkisian.\nThey were outplayed, out-willed and, most important, outcoached by the program Sarkisian once led, some of the very players he recruited making his life difficult again in a season that wasn’t supposed to be this hard. Not through the first five games, at least.\nA must-win lost, USC’s coach will face another barrage of questions about the direction of his program and, more specifically, the pace of that direction. Sarkisian teams at USC are now 12-6.\nThe questions began shortly after the game ended, and Sarkisian, to his credit, answered by taking the fall for a team that never did get up against the Huskies.\n“This one, at the end of the day, is on me,” he said. “This game starts with me. When we don’t perform as a football team, it’s on the head coach. We just didn’t get it done. It starts with me.”\nWith the talent spread more evenly than ever, college football has become unpredictable enough, each week featuring outcomes no easier to grasp than a greased gecko. Four teams currently ranked among the top 13 weren’t ranked at all entering the season.\nAnd the Pac-12 – like all big-time conferences – is deep and tough. Sarkisian’s Trojans losing at home to the overmatched Huskies, however, defies more than just predictability.\nThis was a game that featured numerous dropped balls by USC receivers, eight penalties, an oddly subpar Cody Kessler, three turnovers and a 1-for-13 third-down conversion rate – the signs of a team not ready to play and after having nearly two weeks to prepare.\n“This is the way college football is now,” Sarkisian said. “This is the way our conference is right now. We’re going to be in tight games and have to realize how important it is to execute.”\nThis was the first time Sarkisian faced the school where he began his head coaching career in 2009. In five seasons with the Huskies, he earned the reputation of being able to win – just not enough.\n“Seven-Win Sark” wasn’t a nickname; it was an expression of derision. In some places around Seattle, Sarkisian remains less popular than even the weather.\nStill, USC hired him away in December 2013, Trojans fans now the ones trying to figure out if this guy can, in fact, win enough.\nSarkisian’s popularity locally has taken some big shots already this season. There was his performance at the school’s annual “Salute to Troy” event. There was Athletic Director Pat Haden’s subsequent public wrist slap. Then there was a home loss to Stanford in which the Trojans were bullied into defeat.\nOver the years, USC football teams have done some notable things in the Coliseum. This particular team has now lost two straight games here – something that hadn’t happened in the same season since 2001, Pete Carroll’s first year.\nThe fans repeatedly booed throughout this game, the Trojans entering as nearly 21/2-touchdown favorites but finding the end zone only once.\nThe night began with Kessler being sacked and then, a play later, Kessler throwing an interception.\nWhen the senior quarterback did complete his first pass – to Adoree’ Jackson, perhaps the most explosive Trojan of them all – the connection went for minus-6 yards.\nAfter two possessions and seven plays, USC, the No. 2 team in the country in yards per play, had netted 3 feet of offense.\n“Cody was a little off and our team was a little off,” Sarkisian said. “That’s what I have to try to dissect and figure out.”\nA tone certainly had been set, Kessler about spend the rest of the night under steady pressure behind an offensive line that, along the way, would lose senior center Max Tuerk to a knee injury.\nStill, USC finished with 190 yards rushing, averaging almost 5 yards per attempt, but seemed to abandon the run at times in the second half.\nThat was only one strange development on a night full of them.\n“Now is a critical moment for our program to be together, to hang together,” Sarkisian said. “We’re going to have games like this. We need to be able to rally together and hang together.”\nUp next is a visit to Notre Dame, where a developing story and the questions clinging to it could collide again.\nContact the writer: jmiller@ocregister.com", "external_links": [], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-09T09:06:10.106+03:00", "highlightTitle": ""}