{"organizations": ["UFC"], "uuid": "27c5a6cbc9126ae866a5a9194f1ccf536a353706", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reviewjournal.com", "main_image": "http://www.reviewjournal.com/sites/default/files/field/media/MMA-UFC187_052315sm_017.jpg", "site_section": "http://www.reviewjournal.com/taxonomy/term/31/feed", "section_title": "Sports", "url": "http://www.reviewjournal.com/sports/mma-ufc/cormier-outlasts-gustafsson-ufc-192", "country": "US", "title": "Cormier outlasts Gustafsson at UFC 192", "performance_score": 0, "site": "reviewjournal.com", "participants_count": 0, "title_full": "Cormier outlasts Gustafsson at UFC 192", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T09:30:00.000+03:00", "replies_count": 0, "uuid": "27c5a6cbc9126ae866a5a9194f1ccf536a353706"}, "author": "", "url": "http://www.reviewjournal.com/sports/mma-ufc/cormier-outlasts-gustafsson-ufc-192", "ord_in_thread": 0, "title": "Cormier outlasts Gustafsson at UFC 192", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Cormier", "Gustafsson"], "text": "Cormier outlasts Gustafsson at UFC 192 Cormier outlasts Gustafsson at UFC 192 \nDaniel Cormier, seen at UFC 187 (Las Vegas Review-Journal) By Adam HillLas Vegas Review-Journal \nFor the second time in his career, Alexander Gustafsson valiantly battled the light heavyweight champion for five brutal rounds. \nHe came up short both times. \nDaniel Cormier won a split decision over Cormier in the main event of UFC 192 on Saturday night in Houston after both fighters absorbed significant damage over five rounds. \n\"Thank you Alexander Gustafsson,\" Cormier said. \"You made me a better man and fighter tonight. I will forever be indebted to you. Thank you.\" \nGustafsson went through a similar slugfest against former champ Jon Jones in 2013 before losing a decision. Gustafsson praised the ability of Cormier, a two-time Olympic wrestler, to beat win a bout largely contested on the feet. \n\"He proved he can strike,\" Gustafsson said. \"He's the real champ. He's a legit champ.\" \nCormier got an early takedown, but did most of his damage in the clinch for the rest of the fight. Several times, he was able to hold Gustafsson's head in place and land short right uppercuts. \n\"That was very effective,\" Cormier said. \"Every time I hit him with those, I felt him stop. \n\"I just wanted to prove I'm not one-dimensional,\" Cormier said. \"I can stand with the best strikers in the world. Alex hit me with some good shots.\" \nThat included a big knee at the end of the third round that nearly finished Cormier. Gustafsson, however, couldn't close the deal and lost another close decision in a title fight. \nHis next challenge could come from Reno native Ryan Bader, who won his fifth straight fight and spoiled the return of former champion Rashad Evans with a unanimous decision. \nBader never allowed Evans to settle into a rhythm and evaded trouble when Evans loaded up for big shots. \n\"People keep doubting me and calling me the 'easiest fight in the division,'\" but I keep running through them,\" Bader said. \"My mentality is different. I decided I wanted to be the champion of this sport and that's what's driving me.\" \nThe win potentially earned Bader a shot against Cormier, but Jones could spoil that plan. Jones was stripped of the belt and suspended indefinitely this year after being charged in a hit-and-run accident. Jones avoided jail time by entering into a plea agreement in an Albuquerque, N.M., courtroom. \nHe could be reinstated at any time, but Bader wants his shot before that. \n\"Rashad was calling me an easy fight, and no disrespect to him, but I got through him,\" Bader said. \"(Cormier) was calling me out, so I'm ready for him.\" \nHeavyweight Ruslam Magomedov improved to 3-0 in the UFC and won his ninth straight fight overall with a unanimous decision over Shawn Jordan. \nMagomedov was controlled the fight largely by staking out a spot near the cage and picking Jordan apart. Jordan, a former Louisiana State football player, appeared to injure a rib early in the fight. \nJulianna Pena earned remained unbeaten in the UFC with a unanimous decision over Jessica Eye in a women's bantamweight bout. \nPena was able to get Eye to the mat in the first and third rounds, nearly finishing a submission attempt in the closing minutes. Eye found success in the standup in the second round, but was docked a point for an illegal knee late in the round. \nPena's success in the final five minutes ensured the deduction didn't come into play. After the victory, she called for a title shot. \n\"I'm 6-0 in the UFC and so is Ronda Rousey,\" Pena said, counting her wins on \"The Ultimate Fighter\" reality show among her UFC victories. \"(UFC president) Dana White calls her the Mike Tyson of MMA. Well, I'm Evander Holyfield. \n\"I'll be your huckleberry.\" \nJoseph Benavidez earned a unanimous decision over Ali Bagautinov in a flyweight bout that kicked off the main card. \nBoth fighters have suffered losses in title fights to champion Demetrious Johnson, and Benavidez may have earned another chance with his fourth straight victory. Benavidez has lost twice to Johnson, once for the vacant title in 2012 and again when Johnson held the belt in 2013. \nRose Namajunas highlighted the preliminary card with a standing rear-naked choke technical submission of Angela Hill in a women's strawweight bout. \n\"Patience was the key in this fight,\" said Namajunas, who bounced back from a loss to Carla Esparza in the inaugural women's 115-pound title fight in December. \"We've been working my jiu-jitsu a lot. I've got great coaches who have helped me get to this point. The rest of division doesn't matter to me, it's only who's standing in front of me that I'm thinking about, so whoever is next, come get it.\" \nDerrick Lewis knocked out Viktor Pesta in the third round of a heavyweight bout and flyweight Sergio Pettis took a unanimous decision victory over Chris Cariaso. \nLightweight prospect Sage Northcutt, making his UFC debut at age 19, knocked out Francisco Trevino in just 57 seconds. \nAlbert Tumenov and Adriano Martins recorded knockout victories. Yair Rodriguez gained a unanimous decision over Dan Hooker in a featherweight bout. \n— Contact reporter Adam Hill at ahill@reviewjournal.com or 702-224-5509. Follow him: @adamhilllvrj Comment section guidelines The below comment section contains thoughts and opinions from users that in no way represent the views of the Las Vegas Review-Journal or GateHouse Media. This public platform is intended to provide a forum for users of reviewjournal.com to share ideas, express thoughtful opinions and carry the conversation beyond the article. Users must follow the guidelines under our Commenting Policy and are encouraged to use the moderation tools to help maintain civility and keep discussions on topic.", "external_links": [], "published": "2015-10-04T09:30:00.000+03:00", "crawled": "2015-10-04T09:32:40.156+03:00", "highlightTitle": ""}