{"organizations": [], "uuid": "20d3af46b54604832a30d22929c2ab77990a1382", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/2/9/161345/World/International/Thousands-rush-across-as-Croatia-opens-border-with.aspx", "country": "EG", "title": "Thousands rush across as Croatia opens border with Serbia - International - World", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Thousands rush across as Croatia opens border with Serbia - International - World - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "20d3af46b54604832a30d22929c2ab77990a1382"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/2/9/161345/World/International/Thousands-rush-across-as-Croatia-opens-border-with.aspx", "ord_in_thread": 0, "title": "Thousands rush across as Croatia opens border with Serbia - International - World", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Migrants stream into Balkans, Germany braces for far-right rally Slovenia blocks over 1,000 migrants at border Migrants told 'Be patient' as entry to Croatia slows Thousands of people trying to reach the heart of Europe surged across Serbia's border into Croatia as police ended a two-day bottleneck Monday that had reduced many to mud-caked misery.\nThe surprise move allowed an estimated 3,000 more migrants to travel into Croatia bound for Slovenia, the next agonizing obstacle looming on the West Balkans route that currently serves as asylum seekers' main eastern entrance to the European Union. Slovenia, which also has been struggling to slow the flow of humanity across its frontiers, faced another evening wave of trekkers seeking to cross the small Alpine country and reach Austria and Germany to the north.\n\"Without any announcement, the borders opened. When the borders opened, everybody rushed,\" said Melita Sunjic, a spokeswoman for the United Nations refugee agency positioned on the Serb-Croat border. \"The last person to go was a young boy without a leg, and we helped him cross in a wheelchair.\"\nAid officials at the border distributed blue rain ponchos and bags of food to bedraggled travelers, many of them slipping in ankle-deep mud and chilled to the bone. Beyond stood about a dozen police, who had removed road barricades to permit people to walk down the rural lane. Officials on the Croat side planned to bus the newcomers either to a Croat refugee camp or — more likely given asylum seekers' reluctance to stop before reaching their desired destinations — to the Slovenian border.\nSlovenia's Interior Ministry said that some 5,000 migrants reached the border Monday at various entry points, and most were allowed to enter, with at least 900 reaching Austria by the evening. Slovenia had vowed to take no more than 2,500 per day.\nEarlier, Slovenian President Borut Pahor said his country would accept only as many travelers as could be funneled directly on to Austria. He said Slovenia was determined not to be left holding the bag should Austria or Germany suddenly stop accepting refugee applicants.\n\"As long as Austria will control the flow of refugees, we will have to do the same on the Slovenian-Croatian border,\" Pahor said.\nAt the main border crossing, Slovenia was bracing for a convoy of about 40 buses containing more than 2,000 people in addition to two trains that arrived Monday with an estimated 3,800 people aboard.\nAn empty Serb field near the border town of Berkasovo littered with belongings illustrated how desperately campers wanted to cross the border. Only hours before, its rows of military-style tents had been packed with people fleeing war and poverty in the Middle East, Asia and Africa. Now only a few hundred remained. Dozens in the near distance could be seen walking into Croatia, some of them walking in sandals or slippers without socks, which had become clogged with mud. Many carried children on their backs to spare them from the mud-bath.\nLeft behind in the scramble were stuffed toys, a milk bottle, a child's rubber boot, crayons scattered in the mud and soaked blankets. Cleaning crews could be seen collecting the scattered belongings with shovels in hopes of clearing the boggy field in time for the next migrant wave coming north from Macedonia.\nOfficials in Serbia, Slovenia and Croatia all accused each other of making a bad situation worse. Slovenia, insisting on the transfer limit of 2,500 from Croatia, accused the Croats of breaking previous agreements to observe those numbers. Croatian officials insisted no such binding deal could be enforced because they lacked legal powers to confine travelers to Croat emergency shelters, which remain less than half full.\nWhen the day's first refugee train containing an estimated 1,800 people stopped near Slovenia shortly after midnight, people found their path blocked in both directions by rival deployments of Croat and Slovene police, each arguing that the trekkers must seek shelter in the opposite direction.\nThis created an effective no-man's land on the border and forced many to spend the night stuck in the open and struggling to sleep amid bitter cold, driving rain and wailing children. Some travelers piled up soggy tree branches for fires.\n\"It's completely unacceptable,\" said Slovene Interior Minister Vesna Gyorkos Znidar, who accused Croatia of ignoring Slovenian appeals and of seeking to dump \"an unlimited number of immigrants\" on Slovenia rather than make proactive efforts to coax thousands into staying at Croatian shelters.\nBut Croatia retorted that it, too, was being unfairly burdened by unrelenting flows from Serbia, where U.N. officials estimate another 10,000 asylum seekers — more than double the summer's typical flow — are currently traveling north to Croatia.\nBefore the Croat police lifted their border blockade, parents desperate to get their children out of the cold and rain could be seen handing small boys and girls over the security barriers to police. Many others fed up with waiting in the rain tried to outflank police positions, walking through orchards and cornfields, stumbling in the mud along the way.\n\"We are in cold weather and the place is not good,\" said Farouk al-Hatib, a Syrian who was waiting for Croat police to allow him to cross from Serbia. \"Our message for the governments is to take into consideration our suffering.\"\nCroatian government leaders argue that it is pointless, if not impossible, to stop people who overwhelmingly express determination to reach wealthier, more liberal nations in Western Europe, chiefly Germany.\n\"The Republic of Croatia has asked these refugees to stay at our reception centers until their status is resolved, but they all refuse it,\" said Matija Posavec, governor of Medjimurje, Croatia's northernmost county bordering Slovenia. \"They could have stayed on board the train. They could have stayed at the reception centers, but none of them really wants that. ... They just want to pass.\"\nSlovenia did gradually admit Monday's new border arrivals, leaving just 500 from the overnight train still waiting in the rain by the afternoon.\nThe humanitarian crisis on Slovenia's southern border has grown since Saturday, when Hungary closed its border with Croatia.\nHungary — for months the most popular route for asylum seekers seeking an eastern entry point to the European Union — in mid-September already had stopped people from crossing on foot from Serbia, forcing the travelers to look further west in the Balkans for a new path north.", "external_links": [], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-20T04:26:04.195+03:00", "highlightTitle": ""}