{"organizations": [], "uuid": "8794899baf012b42aa85c47d0eee308bf1262508", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/47529300.cms", "site_section": "http://timesofindia.indiatimes.com/rssfeeds/4719148.cms", "section_title": "The Times of India Sports: Extensive sports coverage, key statistics and free downloads", "url": "http://timesofindia.indiatimes.com/sports/boxing/Unbeaten-Golovkin-fights-Lemieux-to-unify-titles/articleshow/49404011.cms", "country": "IL", "title": "Unbeaten Golovkin fights Lemieux to unify titles", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "Unbeaten Golovkin fights Lemieux to unify titles - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T14:01:00.000+03:00", "replies_count": 0, "uuid": "8794899baf012b42aa85c47d0eee308bf1262508"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/sports/boxing/Unbeaten-Golovkin-fights-Lemieux-to-unify-titles/articleshow/49404011.cms", "ord_in_thread": 0, "title": "Unbeaten Golovkin fights Lemieux to unify titles", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK: Undefeated knockout powerhouse Gennady Golovkin of Kazakhstan and Canada's David Lemieux meet Saturday at Madison Square Garden to unify two of the three major world middleweight boxing crowns. \n\nGolovkin, who has stopped 20 foes over more than seven years inside the distance, puts the World Boxing Association and interim World Boxing Council crowns on the line against International Boxing Federation champion Lemieux. \n\n\"This is the biggest test for me,\" Golovkin said. \"He's the IBF champ. It's big situation, unification. I think we have three or four fighters and it's very important who is number one.\" \n\nThe winner puts himself in position for a potential unification showdown against the winner of next month's matchup between WBC champion Miguel Cotto of Puerto Rico and Saul \"Canelo\" Alvarez of Mexico. \n\nGolovkin, 33-0 with 30 knockouts, and Lemieux, 34-2 with 31 knockouts, figure to offer plenty of fireworks themselves. \n\nSince first taking the WBA crown in 2010, Golovkin has won 14 times, the second most defenses in the division behind US legend Bernard Hopkins, with the most recent being a sixth-round stoppage of US southpaw Willie Monroe last May. \n\nGolovkin's 91 per cent knockout ratio is the highest in middleweight division history. \n\n\"I'm aware of his record but I am also aware of who I am and what I can bring to the table,\" Lemieux said. \"I am going to be a lion in there. Nothing is going to be in my way.\" \n\nLemieux recalled another David who faced a giant like Golovkin, who stands 1.79m. \n\n\"It is kind of like David and Goliath,\" Lemieux said. \"He is impressive and talented but there is also David who is making a lot of noise. I know what I am going up against and I am going in with a nice package to deliver to Golovkin.\" \n\nLemieux has won nine fights in a row since losing to Canada-based Haitian Joachim Alcine in 2011, seven by early stoppage. \n\nIn his first world title bout, he took a unanimous decision over Cameroon-born French fighter Hassan N'Dam N'Jikam four months ago for the vacant crown. \n\n\"I am sure Golovkin and I are going to be at our best,\" Lemieux said. \n\n\"I have faced victories, defeats, but nothing is more exciting and more gratifying than victory such as I am planning on Saturday. All of I what I have done has lead me here and I am extremely excited and proud. \n\n\"I am here to make history and I promise that I have done everything it takes to make sure that I don't leave empty handed. I will leave with the belts.\" \n\nBoth fighters are coming to New York off spirited training camps. \n\n\"David raised his boxing to a different level,\" trainer Marc Ramsay said of his training camp. \"We have no excuses we only have promises of victory.\" \n\n\"I look forward to an explosive fight where no one will be disappointed,\" Golovkin trainer Abel Sanchez said. \"I think David is going to come at him and expose himself and give Gennady an opportunity to knock him out.\" Stay updated on the go with Times of India News App. Click here to download it for your device.", "external_links": [], "published": "2015-10-16T14:01:00.000+03:00", "crawled": "2015-10-16T09:07:45.982+03:00", "highlightTitle": ""}