{"organizations": [], "uuid": "c9946141f3682563d9821687cebee404ec727f57", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-5616d06c/turbine/ct-jay-cutler-mobility-20151008", "site_section": "http://www.chicagotribune.com/", "section_title": "Chicago Tribune: Chicago breaking news, sports, business, entertainment, weather and traffic - Chicago Tribune", "url": "http://www.chicagotribune.com/sports/football/bears/ct-jay-cutler-mobility-20151008-story.html", "country": "US", "title": "Jay Cutler hopes to be more mobile vs. Chiefs", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Jay Cutler hopes to be more mobile vs. Chiefs - Chicago Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T23:22:00.000+03:00", "replies_count": 0, "uuid": "c9946141f3682563d9821687cebee404ec727f57"}, "author": "Dan Wiederer", "url": "http://www.chicagotribune.com/sports/football/bears/ct-jay-cutler-mobility-20151008-story.html", "ord_in_thread": 0, "title": "Jay Cutler hopes to be more mobile vs. Chiefs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Heading into last Sunday’s game against the Oakland Raiders, Bears quarterback Jay Cutler understood his limitations.\nStill working back through a significant hamstring strain, Cutler knew he wouldn’t want to test his mobility. Instead, he set his mind to operate almost exclusively within the pocket, taking away a dimension of his game that is often quite valuable.\nCutler remained disciplined with that approach throughout a 22-20 win. He never took off running with his only official rushing attempt coming on a botched snap exchange with Matt Slauson. He was also sacked three times.\nCutler’s composure and concentration remained steady through the Bears’ first win.\n“Even when I stepped up a few times and threw it, my mindset was just get rid of the ball and let these (other) guys do it,” he said after Thursday’s practice at Halas Hall. “This week I think I’ll be able to move around a little bit more. We still want to stay in the pocket and deliver the ball from there. But if I’ve got to get out, I think I can get out.”\nIn previous starts this season against the Packers and Cardinals, Cutler turned seven rushes into 55 yards. So the return of his mobility should be a boost for the entire offense, especially with the Bears preparing to face a Chiefs team with an imposing front seven.\nCoordinator Adam Gase said Thursday he was impressed with Cutler’s moxie during the win over the Raiders.\n“The first thing I learned was how tough he was,” Gase said. “For him to go out there and perform the way he did, I don't know if I've been around a performance like that with as efficient as he was and to fight through what he had going on. With him sticking around in the pocket, he did a good job protecting himself and he did a good job with all his reads.”\nPrivacy Policy Jay Cutler Chicago Bears Oakland Raiders Matt Slauson", "external_links": ["http://www.tribpub.com/privacy-policy-and-your-privacy-rights/", "http://www.trbimg.com/img-5616d06c/turbine/ct-jay-cutler-mobility-20151008"], "published": "2015-10-08T23:22:00.000+03:00", "crawled": "2015-10-09T01:00:51.056+03:00", "highlightTitle": ""}