{"organizations": [], "uuid": "4e457ae52e421ce24a952ea4efffae42a7b2a40e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.emporiagazette.com", "main_image": "http://bloximages.newyork1.vip.townnews.com/emporiagazette.com/content/tncms/assets/v3/editorial/6/f8/6f8ec28c-7349-11e5-80f5-7bd03f4bbb14/561fb8db2bb83.image.jpg", "site_section": "http://www.emporiagazette.com//search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&nsa=eedition&c[]=sports,sports/*&f=rss", "section_title": "Emporia Gazette - sports,sports/", "url": "http://www.emporiagazette.com/sports/article_556be39e-7349-11e5-b544-17d52ddd0e46.html", "country": "US", "title": "K-State's Bill Snyder, at 76, still reeling in recruits", "performance_score": 0, "site": "emporiagazette.com", "participants_count": 1, "title_full": "K-State's Bill Snyder, at 76, still reeling in recruits", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T17:30:00.000+03:00", "replies_count": 0, "uuid": "4e457ae52e421ce24a952ea4efffae42a7b2a40e"}, "author": "The Associated Press", "url": "http://www.emporiagazette.com/sports/article_556be39e-7349-11e5-b544-17d52ddd0e46.html", "ord_in_thread": 0, "title": "K-State's Bill Snyder, at 76, still reeling in recruits", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Associated Press Bill Snyder \nKansas State head coach Bill Snyder, center, stands with his team during the first half of an NCAA college football game against TCU in Manhattan, Kan., Saturday, Oct. 10, 2015. Posted: Thursday, October 15, 2015 9:30 am | Updated: 9:33 am, Thu Oct 15, 2015. K-State's Bill Snyder, at 76, still reeling in recruits Associated Press | 0 comments \nMANHATTAN — The recruiting pitch Dominique Heath heard from Bill Snyder was simple: If you play for me at Kansas State, you'll not only have the chance to be the best football player you can be, but every opportunity possible to be the best man you can be. \nIt was a timeless message. Ageless, even. \nWhich is a good thing considering the 76-year-old Snyder is old enough to be his grandfather. \n\"I approached it as coming to play for a great program, a great coach,\" explained Heath, now a freshman wide receiver for the Wildcats. \"I didn't think about his age or anything like that.\" \nKansas State may be off to a modest 3-2 start heading into Saturday's game against Oklahoma, but the two losses came on a last-minute field goal by No. 16 Oklahoma State, and a last-minute touchdown by No. 3 TCU last Saturday — two teams that are a combined 12-0. \nThe fact that the Wildcats put a scare into both is a testament to the fact that Snyder is still able to reel in talent. Already, he has commitments from 11 players for next season. Among them is Skylar Thompson, the nation's No. 6 dual-threat quarterback, according to Rivals.com , and Zach Shackelford, a highly regarded offensive line prospect from Texas. \nBy the time they're seniors, Snyder will have celebrated his 80th birthday. \nHeath acknowledged that other coaches tried to use Snyder's age against him in the recruiting game. Some of them were subtle, others more direct. None of them thought it was a positive. \nExcept, that is exactly how Heath views it. \n\"Yeah, because he's been in the game. He's seen things I haven't seen, a lot of us youngsters haven't seen,\" Heath explained. \"Like I said to future recruits, come up here and visit, meet with the coaches, the people around campus. At any school you go to the coach might not be there. You never know what could happen in a year.\" \nThe reality is there were 16 coaching changes after last season, only one involving a coach who retired. The rest were either up-and-coming coaches moving on to better jobs or, in the case of heavyweight programs such as Michigan and Nebraska, outright firings. \nAlready this season, Illinois has fired Tim Beckman. Maryland has fired Randy Edsall. North Texas has fired Dan McCarney. Southern Cal coach Steve Sarkisian has taken a leave of absence. Steve Spurrier abruptly quit at South Carolina on Tuesday, saying his program had \"slipped\" and it was his fault after 25 years of coaching around the South. \nYet in the Flint Hills of Kansas, the coach whose stadium bears his name — not to mention the highway leading into town — keeps doing what he's been doing almost non-stop since 1988. \n\"It's not going to change our approach at all,\" Snyder said of his looming retirement. \nSnyder refuses to disclose when he will step away. He retired briefly in 2005, then realized it was premature and returned to Kansas State four years later. \nHe made headlines before the start of this season by declaring that he would like his son, Sean Snyder, to take over when he does retire for good. The younger Snyder played for his father at Kansas State, and has been intimately involved with the program nearly as long. \nBut even when Snyder meets with a recruit, the topic of retirement rarely comes up. \n\"A couple of other schools would say, 'After your first year, I don't know if he'll be there anymore,'\" sophomore linebacker Elijah Lee said. \"I never really questioned it just because my recruiting coach, Del Miller, just kept saying, 'Don't listen to them. They don't know anything, and Coach Snyder said he isn't going to be done. Just stick with us.'\" \nBesides, even these days, most of those other coaches aren't nearly as successful. \nKansas State has been two five straight bowl games, including a trip to the Fiesta Bowl after winning a share of the Big 12 title in 2012. The Wildcats haven't had a losing season since Snyder returned to the sideline in 2009, an impressive 54 victories ago. \n\"Nothing changes,\" Lee said. \"It's actually a good thing, because we aren't flashy. We aren't anything. We're treated like young men. That's the biggest thing about coming here.\" \nSure, there might be benefits to being closer in age to his players, like 36-year-old Kliff Kingsbury is at Texas Tech. Maybe Snyder would listen to the same kind of music as them, or watch the same television shows. Maybe they would have more in common. \nIt's hard to believe they could relate any better to each other. \n\"Nobody has even come remotely close to what Bill Snyder has done there,\" said South Dakota coach Joe Glenn, whose team lost to Kansas State earlier this season. \"I grew up watching Kansas State and they just got slaughtered all the time. He did it once, built it up. They lost it and then he came back and built it up again. He's got it, whatever it is. He's got it.\"", "external_links": [], "published": "2015-10-15T17:30:00.000+03:00", "crawled": "2015-10-16T02:40:30.160+03:00", "highlightTitle": ""}