{"organizations": [], "uuid": "5793da11fcf8ac1fa1b71cd2af5cf812c406ca43", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tennessean.com", "main_image": "http://www.gannett-cdn.com/-mm-/55c75c8f837a993de4cb29cb787ff9d1841a0021/c=0-73-3216-1890&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/06/USATODAY/USATODAY/635796906730600316-USATSI-8838571.jpg", "site_section": "http://www.tennessean.com/sports/", "section_title": "The Tennessean|Sports", "url": "http://www.tennessean.com/story/sports/mlb/2015/10/06/al-wild-card-capsule-astros-vs-yankees/73430602/", "country": "US", "title": "AL wild card capsule: Astros vs. Yankees", "performance_score": 0, "site": "tennessean.com", "participants_count": 1, "title_full": "AL wild card capsule: Astros vs. Yankees", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T09:33:00.000+03:00", "replies_count": 0, "uuid": "5793da11fcf8ac1fa1b71cd2af5cf812c406ca43"}, "author": "tennessean", "url": "http://www.tennessean.com/story/sports/mlb/2015/10/06/al-wild-card-capsule-astros-vs-yankees/73430602/", "ord_in_thread": 0, "title": "AL wild card capsule: Astros vs. Yankees", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A capsule look at Tuesday night’s American League wild-card game pitting the Houston Astros against the New York Yankees:\nTime/TV: 8:08 p.m. ET, ESPN\nMatchup: Masahiro Tanaka (12-7, 3.51 ERA) vs. Dallas Keuchel (20-8, 2.48 ERA).\nThis season: The Astros won the season series 4-3, winning two of three in New York.\nTanaka vs. the Astros: The right-hander has made one career start vs. the Astros, in Houston on June 27, and allowed six runs in five innings, receiving no decision.\nKeuchel vs. the Yankees: The lefty ground-ball pitcher is 2-1 in three career starts with a 1.13 ERA, but he will be making this start on three days’ rest for the first time in his career. Both wins came in his two starts this season, as Keuchel threw 16 scoreless innings — including a shutout at home June 12 — while striking out 21 and walking one.\nUSA TODAY\nNo Jeter and little buzz, but Yankees are resolute: 'We can win it all'\nTrending up: Home runs are abundant: The Astros and Yankees ranked second and fourth, respectively, this season. They ranked first and second in the majors in home-run dependence, i.e. scoring the highest percentage of their runs by hitting the ball out of the park; both were just shy of 48%. Yankee Stadium yielded 219 homers this season, second-most in baseball. The Astros’ 11 players with double-digit home run totals tied a major league record. The Yankees hit a club-record 47 homers of at least three runs, the third-most in baseball history. ... Houston is making its first playoff appearance since it lost the 2005 World Series and is just two years removed from a 111-loss season; New York returns to the postseason after a two-year absence and will do so without Derek Jeter as its starting shortstop for the first time since 1995. ... The Astros led the majors with 121 stolen bases, with Jose Altuve besting the AL with 38. ... Houston allowed the fewest runs in the AL (618). ... New York scored a majors-leading 125 runs in the first inning, also the most any AL club scored in any inning. ... Astros rookie shortstop Carlos Correa batted .281 with an .875 on-base-plus-slugging percentage (OPS) and 15 home runs in 67 games after the All-Star break.\nTrending down: The Yankees enter the postseason with a limp — literally and figuratively. They lost six of the last seven and are under .500 at 29-31 since the start of August. Several players are on the disabled list, a group headlined by first baseman Mark Teixeira. Tanaka missed a recent start with a hamstring strain and wasn’t very sharp in his return to the mound last week, allowing four runs in five innings to the Boston Red Sox. ... The Astros suffered through an 11-16 record in September, although they did rebound to win six of their last eight. ... Houston struck out an AL-leading 1,392 times, the third consecutive season it has topped the league in that category. ... Since the start of September, the Yankees’ Alex Rodriguez, Jacoby Ellsbury, Brett Gardner, Chase Headley and Brian McCann all batted between .174 and .224. ... ... Houston’s pitching staff had a 4.74 ERA in its final 30 games.\nFOR THE WIN\n5 things to watch in the Astros-Yankees AL Wild Card game\nClose and late: New York boasts baseball’s best back-of-the-bullpen duo in Andrew Miller and Dellin Betances, who combined for 1452/3 innings with 231 strikeouts and a 1.73 ERA. Justin Wilson typically pitches the seventh inning, and look for Adam Warren to be the long reliever if Tanaka gets in trouble in the middle innings. The Yankees’ bullpen set a major league record with 596 strikeouts, including a pair of 100-K seasons from Miller and Betances. The club went 66-3 when leading after six innings. ... The Astros’ Luke Gregerson hasn’t blown a save since Aug. 9. He typically is set up by Pat Neshek in the eighth with lefty Tony Sipp and righty Will Harris pitching in front of him. The Astros’ bullpen led the AL by allowing only 23.6% of inherited runners to score.\nUSA TODAY\nMLB postseason schedule, matchups, TV times\nIn the end: Two bona fide aces enter with a big question mark. Tanaka was shaky in his return from a hamstring strain; Keuchel, the All-Star starter, is pitching on short rest for the first time in his career. With both clubs so home-run reliant, the difference might be one or two mistake pitches up in the zone.\nLook for Keuchel, who has done so well against the Yankees this season, to neutralize New York’s lefty-heavy lineup a little better and the Astros to scrape by.", "external_links": ["http://www.usatoday.com/story/sports/mlb/2015/10/06/yankees-derek-jeter-didi-gregorious-mlb-playoffs-wild-card-game/73428732/", "http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/daa96f77a1a39477cf3e9982222c542ad5fe1488/c=583-0-3352-2769/local/-/media/2015/10/04/USATODAY/USATODAY/635795690661278661-USATSI-8821601.jpg", "http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/6093f85e3a158a8c32ca6d15ec41f2036067faec/c=269-0-3130-2861/local/-/media/2015/10/05/USATODAY/USATODAY/635796851298329850-c01-didi-b-06.jpg", "http://www.usatoday.com/story/sports/mlb/2015/10/04/postseason-schedule-world-series-matchups-tv-times/73340452/", "http://www.gannett-cdn.com/-mm-/6df8d0a1c3353d8f96bbcc9e3e8d57c1eeda7709/r=300/https/i0.wp.com/usatftw.files.wordpress.com/2015/10/ap_astros_yankees_baseball_75374753.jpg?fit=440%2C330", "http://imgur.com/11mFZcN.jpeg", "http://ftw.usatoday.com/2015/10/5-things-to-watch-in-the-astros-yankees-al-wild-card-game"], "published": "2015-10-06T09:33:00.000+03:00", "crawled": "2015-10-06T11:12:59.908+03:00", "highlightTitle": ""}