{"organizations": [], "uuid": "861fe8be452801c8504e185a52c6bd0e8c939831", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "wtop.com", "main_image": "", "site_section": "http://wtop.com/section/sports/feed/", "section_title": "WTOP » Sections » Sports", "url": "http://wtop.com/sports/2015/10/update-on-the-latest-religion-news-143/", "country": "US", "title": "Update on the latest religion news", "performance_score": 0, "site": "wtop.com", "participants_count": 1, "title_full": "Update on the latest religion news", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T10:30:00.000+03:00", "replies_count": 0, "uuid": "861fe8be452801c8504e185a52c6bd0e8c939831"}, "author": "wtopstaff", "url": "http://wtop.com/sports/2015/10/update-on-the-latest-religion-news-143/", "ord_in_thread": 0, "title": "Update on the latest religion news", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home » News » Sports » Update on the latest… Update on the latest religion news By The Associated Press October 19, 2015 3:30 am \nGOP 2016-TEXAS \n6 Republican 2016 hopefuls woo faithful at Texas megachurch \nPLANO, Texas (AP) — Six Republican presidential candidates have made personal appeals to thousands of Christian conservatives at a megachurch in suburban Dallas, underscoring the importance of the evangelical vote. \nThe candidate forum at Prestonwood Baptist Church featured Texas Sen. Ted Cruz, retired neurosurgeon Ben Carson, former Arkansas Gov. Mike Huckabee, former Pennsylvania Sen. Rick Santorum, former Florida Gov. Jeb Bush and former Hewlett-Packard CEO Carly Fiorina. Front-runner Donald Trump didn’t attend. \nPrestonwood Pastor Jack Graham said all of the major candidates from both parties were invited to attend, but only Republicans accepted. Graham identified the 7,000 people in attendance as evangelical “Christians who believe the Bible.” \nThe candidates answered questions about their personal faith and how they would apply it to public policy. \nSound: \n234-w-33-(Steve Coleman, AP religion editor, with GOP presidential candidates Senator Ted Cruz, Mike Huckabee, Jeb Bush and Carly Fiorina)–Six Republican presidential candidates have told thousands of Christian conservatives at a megachurch in suburban Dallas about their faith and how they would apply it to public policy. AP Religion Editor Steve Coleman reports. (18 Oct 2015) \n<<CUT *234 (10/18/15)££ 00:33 \n222-a-10-(Former Florida Governor Jeb Bush, GOP presidential candidate, at presidential candidates forum)-“happening right now”-GOP presidential candidate Jeb Bush says religious rights are just as important as gay rights. (18 Oct 2015) \n<<CUT *222 (10/18/15)££ 00:10 \"happening right now\" \n219-a-13-(Dr. Ben Carson, Republican presidential candidate, at presidential candidates forum)-“call it schizophrenia (applause fades)”-GOP presidential candidate Dr. Ben Carson says recognition of God is on U.S. currency and is essential to America’s heritage. (18 Oct 2015) \n<<CUT *219 (10/18/15)££ 00:13 \"call it schizophrenia (applause fades)\" \n221-a-13-(Former Florida Governor Jeb Bush, GOP presidential candidate, at presidential candidates forum)-“on your conscience”-GOP presidential candidate Jeb Bush says religious rights are at risk in America today. (18 Oct 2015) \n<<CUT *221 (10/18/15)££ 00:13 \"on your conscience\" \n220-a-09-(Dr. Ben Carson, Republican presidential candidate, at presidential candidates forum)-“me to do”-GOP presidential candidate Dr. Ben Carson says he prayed about people urging him to run for president. (18 Oct 2015) \n<<CUT *220 (10/18/15)££ 00:09 \"me to do\" \n202-a-10-(Rick Santorum, former Pennsylvania Senator and GOP presidential candidate, at presidential candidates forum)-“to do that”-Republican presidential candidate Rick Santorum says the private sector should do more to alleviate poverty. (18 Oct 2015) \n<<CUT *202 (10/18/15)££ 00:10 \"to do that\" \n203-a-08-(Rick Santorum, former Pennsylvania Senator and GOP presidential candidate, at presidential candidates forum)-“to get to”-Republican presidential candidate Rick Santorum says the presidential candidates’ families need prayer. (18 Oct 2015) \n<<CUT *203 (10/18/15)££ 00:08 \"to get to\" \n204-a-11-(Mike Huckabee, former Arkansas governor and GOP presidential candidate, at presidential candidates forum)-“have criminalized Christianity”-Republican presidential candidate Mike Huckabee says Kentucky clerk Kim Davis shouldn’t have been jailed. (18 Oct 2015) \n<<CUT *204 (10/18/15)££ 00:11 \"have criminalized Christianity\" \n205-a-13-(Mike Huckabee, former Arkansas governor and GOP presidential candidate, at presidential candidates forum)-“refuses to compromise”-Republican presidential candidate Mike Huckabee says Kentucky clerk Kim Davis should have been allowed to fulfill her duties without violating her faith. (18 Oct 2015) \n<<CUT *205 (10/18/15)££ 00:13 \"refuses to compromise\" \n187-a-12-(Carly Fiorina, Republican presidential candidate, at presidential candidates forum)-“seen me through”-GOP presidential candidate Carly Fiorina says her faith has been tested. (18 Oct 2015) \n<<CUT *187 (10/18/15)££ 00:12 \"seen me through\" \n188-a-07-(Carly Fiorina, Republican presidential candidate, at presidential candidates forum)-“life, not less (applause fades)”-GOP presidential candidate Carly Fiorina says the best leaders are people of faith. (18 Oct 2015) \n<<CUT *188 (10/18/15)££ 00:07 \"life, not less (applause fades)\" \n189-a-07-(Senator Ted Cruz, R-Texas, GOP presidential candidate, at presidential candidates forum)-“teaching of marriage”-Texas Senator and GOP presidential candidate Ted Cruz says the 2016 election could determine whether Americans lose their religious liberty. (18 Oct 2015) \n<<CUT *189 (10/18/15)££ 00:07 \"teaching of marriage\" \n190-a-12-(Senator Ted Cruz, R-Texas, GOP presidential candidate, at presidential candidates forum)-“and religious liberty (applause fades)”-Texas Senator and GOP presidential candidate Ted Cruz says many Christians don’t bother to vote. (18 Oct 2015) \n<<CUT *190 (10/18/15)££ 00:12 \"and religious liberty (applause fades)\" \nBIDEN \nBiden says religious freedom is key to fighting extremism \nNEW YORK (AP) — Vice President Joe Biden says protecting religious liberty is a moral imperative that protects society against violent extremists. \nBiden received the Athenagoras Human Rights Award at a ceremony Saturday night in New York. It’s the highest award bestowed by the Greek Orthodox Church. \nBiden said terrorist groups like al-Qaida and the Islamic State pervert Islam to justify horrific acts. He said America will be strong as long as it’s a beacon for human rights. The vice president said religious values are entirely consistent with civic values in the U.S., and credited his Catholic faith for giving him “refuge and reassurance.” \nBiden didn’t make any reference to his deliberations about running for president. One of his top advisers says Biden will make a decision in the near future. \nSound: \n035-a-16-(Vice President Joe Biden, receiving the highest award Saturday bestowed by the Greek Orthodox Church, the Athenagoras (a-THEEN’-uh-gohr-uhs) Human Rights Award)-“times of trouble”-Vice President Joe Biden says religion is the foundation for many people. (18 Oct 2015) \n<<CUT *035 (10/18/15)££ 00:16 \"times of trouble\" \n038-a-16-(Vice President Joe Biden, receiving the highest award Saturday bestowed by the Greek Orthodox Church, the Athenagoras (a-THEEN’-uh-gohr-uhs) Human Rights Award)-“tactic of war”-Vice President Joe Biden says divisions and fighting over religion often lead to violent extremism. ((note length of cut)) (18 Oct 2015) \n<<CUT *038 (10/18/15)££ 00:16 \"tactic of war\" \n039-a-20-(Sound of Vice President Joe Biden, being presented Saturday with the highest Human Rights award bestowed by the Greek Orthodox Church)–Sound of Vice President Joe Biden being presented with the highest Human Rights award bestowed by the Greek Orthodox Church. (18 Oct 2015) \n<<CUT *039 (10/18/15)££ 00:20 \n034-a-17-(Vice President Joe Biden, receiving the highest award Saturday bestowed by the Greek Orthodox Church, the Athenagoras (a-THEEN’-uh-gohr-uhs) Human Rights Award)-“States of America”-Vice President Joe Biden says the basis of the United States is religious freedom. (18 Oct 2015) \n<<CUT *034 (10/18/15)££ 00:17 \"States of America\" \n037-a-21-(Vice President Joe Biden, receiving the highest award Saturday bestowed by the Greek Orthodox Church, the Athenagoras (a-THEEN’-uh-gohr-uhs) Human Rights Award)-“acts against humanity”-Vice President Joe Biden says people of faith must respect the rights of other religions. ((note length of cut)) (18 Oct 2015) \n<<CUT *037 (10/18/15)££ 00:21 \"acts against humanity\" \n036-a-22-(Vice President Joe Biden, receiving the highest award Saturday bestowed by the Greek Orthodox Church, the Athenagoras (a-THEEN’-uh-gohr-uhs) Human Rights Award)-“and ethnic grounds”-Vice President Joe Biden says religious liberties must be protected around the world. ((note length of cut)) (18 Oct 2015) \n<<CUT *036 (10/18/15)££ 00:22 \"and ethnic grounds\" \nCOACH-POSTGAME PRAYER \nBremerton coach prays after football game, defying orders \nBREMERTON, Wash. (AP) — A high school coach in Washington state has prayed at the end of Friday night’s football game, despite being told by district officials to stop. \nThe Kitsap Sun reports that Bremerton High assistant coach Joe Kennedy knelt and prayed on the 50-yard line as his players left the field. Players from the other team and others joined him. \nIt’s unclear what the school district will do. Messages left with the district’s attorney as well as district officials were not immediately returned. \nSuperintendent Aaron Leavell has said Kennedy’s long-standing practice runs counter to the constitutional mandate for separation of church and state. He said in a statement before the game that staff must refrain from religious expression while on duty. \nKennedy’s attorneys, from the Texas-based Liberty Institute, say the district has no right to ban the coach from personally praying. They say he neither encouraged nor discouraged students from participating. \nCHURCH NOISE COMPLAINT \nCity warns church after neighbor complains about choir noise \nOAKLAND, Calif. (AP) — The city of Oakland, California, has sent a letter warning a church that it could be fined after a neighbor complained that choir practice was causing unbearable night-time noise. \nThe San Francisco Chronicle reports that the Pleasant Grove Baptist Church has served residents in West Oakland for 65 years. Pastor Thomas A. Harris III says he was surprised to learn he could face an initial fine of $3,529, followed by $500-per-day penalties, for what he considers the “joyful noise” of choir practice. \nHarris says rehearsal ends at 9 p.m., but the complaint sent to the city says the loud music sometimes lasts until 2 a.m. \nCity spokeswoman Karen Boyd says the letter was a courtesy notice and that she hasn’t received any more complaints. She says she doesn’t intend to fine the church. \nPENTECOSTAL HISTORICAL MARKER \nPentecostal church’s founder preached on courthouse steps \nLEXINGTON, Miss. (AP) — Mississippi has set a historic marker at the courthouse where the founder of the nation’s largest predominantly African-American Pentecostal group once preached from the steps. \nCharles Mason founded the Church of God in Christ in 1897 in Lexington, Mississippi, after falling out with the African-American Baptist community in Jackson. \nAfter preaching outside the Holmes County Courthouse and other spots in Lexington, he established St. Paul Church of God in Christ there. It’s considered the mother church of the denomination, which is now based in Memphis, Tennessee. \nMississippi state archives official Jim Woodrick tells The Commercial Appeal the marker is among more than 1,000 approved since 1949. \nRELIGIOUS DOCTRINE-LEGISLATION \nHaslam raises questions about ‘religious doctrine’ bill \nNASHVILLE, Tenn. (AP) — Gov. Bill Haslam is raising questions about a legislative proposal to ban Tennessee schools from teaching about “religious doctrine” before the 10th grade. \nThe governor said the bill could have unexpected consequences, such as preventing younger students from learning why the Pilgrims decided to leave Europe. Haslam told reporters that he didn’t know how you could teach about founding of the United States “without talking about religious doctrine.” \nThe bill sponsored by Republican state Rep. Sheila Butt of Columbia has been criticized by a Muslim civil rights group as specifically targeting instruction about Islam. \nButt insists her bill is “neutral on its face” and that it only aims to establish an appropriate time to teach about religion. \nISRAEL-PALESTINIANS \nNetanyahu: Israel protects disputed Jerusalem holy site \nJERUSALEM (AP) — Prime Minister Benjamin Netanyahu says “Israel alone is the guarantor of the holy sites on the Temple Mount.” \nThe current wave of attacks by Palestinians on Israelis erupted a month ago over the Jewish New Year, fueled by rumors that Israel was plotting to take over Jerusalem’s most sensitive holy site. The hilltop compound is revered by Jews as the site of their biblical temples, but now is home to the Al-Aqsa Mosque, Islam’s third-holiest site. \nIsrael has adamantly denied that it plans to change the status quo at the site, where Jews are allowed to visit but not pray. Israel accuses the Palestinians of inciting violence through the false claims. \nNetanyahu said Sunday that it’s militant Muslims who destroy shrines. He told reporters, “We’ve just seen it in a Jewish holy site, Joseph’s Tomb.” The biblical shrine in the West Bank was firebombed by Palestinians on Friday. \nSound: \n183-a-04-(Israeli Prime Minister Benjamin Netanyahu, with reporters)-“the Temple Mount”-Israeli Prime Minister Benjamin Netanyahu says his government protects the holy sites of all religions. (18 Oct 2015) \n<<CUT *183 (10/18/15)££ 00:04 \"the Temple Mount\" \n184-a-08-(Israeli Prime Minister Benjamin Netanyahu, with reporters)-“last 15 years”-Israeli Prime Minister Benjamin Netanyahu says his nation is not changing the rules governing access to Jerusalem’s most contested holy site. (18 Oct 2015) \n<<CUT *184 (10/18/15)££ 00:08 \"last 15 years\" \n182-a-09-(Israeli Prime Minister Benjamin Netanyahu, with reporters)-“site, Joseph’s Tomb”-Israeli Prime Minister Benjamin Netanyahu says Mideast holy sites outside Israel are often destroyed. (18 Oct 2015) \n<<CUT *182 (10/18/15)££ 00:09 \"site, Joseph's Tomb\" \n130-a-16-(Israeli Prime Minister Benjamin Netanyahu, at cabinet meeting)-“site Joseph’s Tomb”-Israeli Prime Minister Benjamin Netanyahu says he thinks Muslims are unable to look after and respect shrines and holy sites. (18 Oct 2015) \n<<CUT *130 (10/18/15)££ 00:16 \"site Joseph's Tomb\" \n129-a-09-(Israeli Prime Minister Benjamin Netanyahu, at cabinet meeting)-“the Temple Mount”-Israeli Prime Minister Benjamin Netanyahu says Israel rejects the French draft resolution at the United Nations Security council to place independent observers on the Temple Mount. (18 Oct 2015) \n<<CUT *129 (10/18/15)££ 00:09 \"the Temple Mount\" \n131-a-16-(Israeli Prime Minister Benjamin Netanyahu, at cabinet meeting)-“last 15 years”-Israeli Prime Minister Benjamin Netanyahu says Palestinians turned the Temple Mount into a terrorism warehouse and tried to change the status quo. (18 Oct 2015) \n<<CUT *131 (10/18/15)££ 00:16 \"last 15 years\" \nVATICAN-AFRICA \nPope to meet poor, Muslims and evangelicals in Africa \nVATICAN CITY (AP) — The Vatican says Pope Francis will make his first trip to Africa next month, with stops in Kenya, Uganda and the conflict-torn Central African Republic. \nThe papal itinerary will include meetings with Muslims and evangelical Christians and visits to a Kenyan slum and a refugee camp in the Central African Republic. \nFrancis will also pay tribute to Uganda’s martyrs during the trip Nov. 25-30 that will bring him face to face for the first time with the effects of Islamic extremism and Christian-Muslim violence on the continent. \nFrancis is likely to condemn religiously motivated violence and call for greater interfaith harmony. \nThe whirlwind trip will pose security risks that have largely been absent on Francis’ foreign trips to date. \nVATICAN-FRENCH SAINTS \nPope canonizes first married couple in modern times \nVATICAN CITY (AP) — Pope Francis has canonized the Catholic Church’s first married couple in modern times, declaring the parents of the beloved St. Therese (teh-REHZ’) of Lisieux (lihs-YOO’) saints in their own right. \nFrancis told followers gathered in St. Peter’s Square Sunday that the couple “practiced Christian service in the family, creating day by day an environment of faith and love which nurtured the vocations of their daughters.” \nFrancis is particularly devoted to the 19th century French Carmelite nun, fondly known as “The Little Flower,” who died at the age of 24 in 1897 and was later honored with the title “doctor of the church.” \nHer parents were canonized at the start of the final week of his bishops’ meeting on families. The pope’s aim is to provide Catholic families with saintly role models who took care to educate their children in the faith. \nDETROIT CHURCH SHOOTING \nPolice: Detroit pastor fatally shot attacker during service \nDETROIT (AP) — Detroit police say the pastor of a storefront church shot and killed a man who tried to attack him during a service. \nAssistant Detroit Police Chief Steve Dolunt tells the Detroit News and Detroit Free Press the shooting happened Sunday afternoon just after the start of a service at the City of God church. \nDolunt says the man and the pastor had prior “issues.” He says the man was threatening the pastor with a brick when the pastor pulled out a pistol and shot him several times. The man died a short time later at a hospital. \nDolunt says prosecutors will review the case to decide whether the shooting was justified. The pastor was taken into custody for questioning. Topics:", "external_links": [], "published": "2015-10-19T10:30:00.000+03:00", "crawled": "2015-10-19T11:24:09.661+03:00", "highlightTitle": ""}