{"organizations": ["Pacific Sean Walker", "BYU"], "uuid": "601836149fcec9b9de9519bd7702a63203d1e3b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ksl.com", "main_image": "http://img.ksl.com/slc/2573/257350/25735055.jpg", "site_section": "http://www.ksl.com/xml/294.rss", "section_title": "KSL / Sports Home / Local", "url": "http://www.ksl.com/?sid=36998904&nid=272&s_cid=rss-extlink", "country": "US", "title": "BYU women's soccer wins 14th-straight home game with 2-0 win over Pacific", "performance_score": 0, "site": "ksl.com", "participants_count": 0, "title_full": "BYU women's soccer wins 14th-straight home game with 2-0 win over Pacific", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T07:19:00.000+03:00", "replies_count": 0, "uuid": "601836149fcec9b9de9519bd7702a63203d1e3b5"}, "author": "", "url": "http://www.ksl.com/?sid=36998904&nid=272&s_cid=rss-extlink", "ord_in_thread": 0, "title": "BYU women's soccer wins 14th-straight home game with 2-0 win over Pacific", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sean Walker | Posted Oct 17th, 2015 @ 10:19pm \n— For the BYU women's soccer team, good things happen when they score early. \nThe Cougars scored two goals in the first 24 minutes and extended their home shutout streak to 785 minutes with a 2-0 victory over Pacific at South Field on Saturday night. \nBYU (12-1-1, 4-0 West Coast Conference) won its 14th-straight home game dating back to last season and its 15th-straight home result in WCC play. \n\"As a coaching staff, we were a little frustrated with our efficiency, and that is something we've struggled with all year,\" BYU coach Jennifer Rockwood said. \"We spend every minute of practice in front of the goal. … We just have to start rewarding ourselves more. We average a lot of shots per game and we aren't putting enough in. We have got to get better at that.\" \nNadia Gomes opened the scoring in the sixth minute, sending home a worm-burner inside the far post off an assist from Madie Lyons to give the Cougars a 1-0 lead early. BYU continued its trend of scoring early goals, notching a marker in the first 18 minutes of a match for the seventh time in 2015. \n\"That's huge for us. That's been our major goal, to avoid a slow start,\" Michele Murphy Vasconcelos said. \"That really helped us tonight to settle in and to play more composed the rest of the game.\" \nMurphy Vasconcelos doubled the lead in the 24th minute, latching onto a ball at the top of the box to send home a rebound goal midway through the first half, when BYU outshot the Tigers (2-10-1, 1-4 WCC) 20-2, including a 7-2 advantage in shots on frame. \n\"It's proven over and over that the team that scores first gets a result,\" Rockwood said. \"It's also a good reminder for us, because one of the things we take a lot of pride in is our effort and our energy. If we are trying to score as early as we can, then hopefully we are getting off to a great start and putting a lot of pressure on opponents right from the whistle.\" Before her junior season, BYU coaches sat down with midfielder Elena Medeiros and made a significant demand of the Hawaii native: find a shot, and score some goals. It's worked flawlessly. \nBut BYU struggled to efficiently put chances away in the second half, finishing with 34 shots — with a dozen of them on frame. \n\"I thought we did really well being able to keep the energy,\" Murphy Vasconcelos said. \"But we are disappointed with our finishing. We have so many shots that we need to put away, and that's our goal for next game.\" \nThe game was the fifth time in 2015 the Cougars have put up more than 30 shots, though the team has never scored more than two goals per game. BYU is currently averaging nearly 26 shots per game in 2015. \n\"It's a mental toughness and a focus that has to happen,\" Rockwood said. \"We have the skills; we do it in training every day, and it has to carry over (in a game) when it counts the most.\" \nRachel Boaz made two saves and split her eighth shutout of the season with Hannah Clark, who came on in relief for the final 14 minutes of the game. The junior who transferred from San Diego State currently leads the nation with a .933 save percentage. \nThe Cougars have used a defensive crunch to shut out opponents 9-0 at South Field, and Murphy Vasconcelos said the crowd, which reached 3,255 on a rainy weekend in Provo, has played a big role in the home dominance. \n\"That's a huge thing, and we love our fans,\" Murphy Vasconcelos said. \"But also the energy we bring here; it's our environment, our team, and I think that helps us a lot.\"", "external_links": [], "published": "2015-10-18T07:19:00.000+03:00", "crawled": "2015-10-18T09:43:05.215+03:00", "highlightTitle": ""}