{"organizations": [], "uuid": "f5b9aaaa66053dc7a5f73e51df6385de3f8ccb7c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.emirates247.com", "main_image": "http://cdn-wac.emirates247.com/polopoly_fs/1.606751.1444809577!/image/4233752776.jpg", "site_section": "http://www.emirates247.com/cmlink/en/dubai-chamber-http-emirates247-com-sports-1.517973?localLinksEnabled=false", "section_title": "Dubai Chamber - http://Emirates247.com - Sports", "url": "http://www.emirates247.com/sports/cricket/pakistan-vs-england-1st-test-day-2-live-cricket-score-pakistan-389-4-at-lunch-shafiq-hits-fifty-2015-10-14-1.606740", "country": "US", "title": "Pakistan vs England 1st Test Day 2 'live' cricket score: Pakistan 389-4 at lunch... Shafiq hits fifty", "performance_score": 0, "site": "emirates247.com", "participants_count": 1, "title_full": "Pakistan vs England 1st Test Day 2 'live' cricket score: Pakistan 389-4 at lunch... Shafiq hits fifty", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T08:55:00.000+03:00", "replies_count": 0, "uuid": "f5b9aaaa66053dc7a5f73e51df6385de3f8ccb7c"}, "author": "Allaam Ousman", "url": "http://www.emirates247.com/sports/cricket/pakistan-vs-england-1st-test-day-2-live-cricket-score-pakistan-389-4-at-lunch-shafiq-hits-fifty-2015-10-14-1.606740", "ord_in_thread": 0, "title": "Pakistan vs England 1st Test Day 2 'live' cricket score: Pakistan 389-4 at lunch... Shafiq hits fifty", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "2 \nPakistan have reached a commanding 389-4 in 116 overs at lunch on day two of the first Test against England at Zayed Cricket Stadium in Abu Dhabi on Wednesday. England's spinners failed to make an impact with overnight duo of Malik and Shafiq looking solid throughout the morning session during which they added 103 runs in 29 overs. Malik was unbeaten on 168 and Shafiq 68 not out having added 138 runs for the unbroken fifth wicket. Good over by Rashid beating the bat twice. Pak 379-4, 112 overs. Pakistan are untroubled by the spinners with Shafiq skipping out and lofting over mid-on for a boundary. Pak 374-4, 110 overs. Malik has drilled Ali inside out through extra cover for another boundary. Pak 367-4, 109 overs. Shafiq scampers for a single to complete his 12th Test half century which came off 107 balls. Pak 356-4. The 100-run partnership between Malik and Shafiq comes off 180 balls. Pak 351-4. Pakistan have added 52 runs in 14 overs in the first hour of play to pile on the agony for England. Pak 342-4, 101 overs. Shafiq goes into attacking mode slamming Ali down the ground for a boundary. Malik jabs Wood over the slip cordon for a boundary to pass 150 which is his highest score in Test cricket. Pak 334-4, 99 overs. This is now Shoaib Malik's highest score in Test cricket. Previous best was 148 not out against Sri Lanka in March 2006. #Cricket #PakvEng — Saj Sadiq (@Saj_PakPassion) October 14, 2015 \nMalik is turning it on hammering a boundary and six off Rashid. Pak 329-4, 98 overs. Shafiq gets going with two consecutive boundaries off Wood on the leg side. Pak 319-4, 97 overs. Malik cracks another boundary off Rashid slamming him through point. Pak 311-4, 96 overs. Spin introduced after six overs as Rashid comes into the attack with Pakistan 294-4, 93 overs. Malik hits the first boundary of the day driving Anderson through the covers. Pak 291-4, 90 overs. Anderson begins with a maiden to Shafiq who is batting on 11 while Broad also sends down a maiden to Malik. Pakistan resume day two of the first Test against England at Zayed Cricket Stadium on Wednesday on 286-4 with Shoaib Malik unbeaten on 124. Day 1 report Malik hit a brilliant century to cap an impressive return to Test cricket after five years as he led Pakistan's charge in the first Test against England in Abu Dhabi on Tuesday. Malik was unbeaten on 124 for his third Test hundred - his first against England - to guide Pakistan to 286-4 at close on the opening day at Zayed Cricket Stadium. Malik shared in a 168-run stand for the second wicket with opener Mohammad Hafeez who missed his century by two runs after Pakistan won the toss and opted to bat on a flat pitch. Malik has so far hit 14 boundaries in his patient 230-ball knock. It was also memorable day for veteran batsman Younis Khan (38) who became Pakistan's leading run scorer in Test cricket when he passed Javed Miandad's tally of 8,832 runs made in 124 Tests. Younis, playing his 102nd Test, jumped out of his crease to hit spinner Moeen Ali for a big six at deep mid-wicket to reach 21, two more than his illustrious countryman Miandad. \n ", "external_links": [], "published": "2015-10-14T08:55:00.000+03:00", "crawled": "2015-10-14T11:12:20.315+03:00", "highlightTitle": ""}