{"organizations": [], "uuid": "5c44762b0dbdc9d36c708a7e3111df48cc132dfc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.vindy.com", "main_image": "http://media.vindy.com/content/image/a/5/logo/v5logo.gif", "site_section": "http://www.vindy.com/rss/headlines/sports", "section_title": "Vindy.com stories: Sports", "url": "http://www.vindy.com/news/2015/oct/06/locals-eye-state-golf-tournaments/", "country": "US", "title": "Locals eye state golf tournaments", "performance_score": 0, "site": "vindy.com", "participants_count": 0, "title_full": "Locals eye state golf tournaments", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T07:05:00.000+03:00", "replies_count": 0, "uuid": "5c44762b0dbdc9d36c708a7e3111df48cc132dfc"}, "author": "", "url": "http://www.vindy.com/news/2015/oct/06/locals-eye-state-golf-tournaments/", "ord_in_thread": 0, "title": "Locals eye state golf tournaments", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published: Tue, October 6, 2015 @ 12:05 a.m. \nMooney, Girard boys competing \nat Windmill Lakes G.C. today \nBy Steve Wilaj \nsports@vindy.com \nWhile David Leo remembers his team didn’t shoot well during last year’s Division II district tournament, the Girard golf coach can’t exactly recall the particulars — not that he’s anxious to do so. \n“I think we finished, like, 12th out of 13 – or maybe it was 13th out of 12,” Leo joked. \nAfter a second-place finish in the sectional tournament on Wednesday, the Indians get a chance to redeem themselves during this year’s district tournament today at Windmill Lakes Golf Course in Ravenna. They’ll be joined by 2014 state finalists Cardinal Mooney — which placed first in sectionals — as well as third-place finisher Struthers. \n“There’s a lot of good teams out there,” said Leo, whose Girard group shot a 342 at Forest Hills Golf Course in Elyria during sectionals. “We’ll need to play our best golf of the year if we want a chance. We’ll need to pick up a few shots from how we played last week — and we’re capable of it — but it’s gonna take a really good effort to get out.” \nGirard will be led by Mark Standohar — who shot a 79 last week – and Anthony Graziano, who notched an 84. Mooney, meanwhile, is headed by Ken Keller — coming off a 75 — and Nick Braydich, who shot an 80. Both teams will try to knock off the 2014 district winner, Chardon Notre Dame-Cathedral Latin. \n“One thing I want to focus on is putting,” Keller said. “I’ve been working a lot on that to try to lower my score — and my team’s score — because that seems to be my main issue right now. \n“I believe we have a team capable of reaching state for the second year in a row. We just need to play our game, play smart and play the way we’re capable of playing.” \nThe Lakeview girls are seeking their third straight trip to Columbus, as the Bulldogs tee off today at Tam O’Shanter Hills Golf Course in Canton as part of a Division II district tournament. \n“One of our goals was definitely try to make it back to Columbus,” said Lakeview coach Mike Turco, whose team was paced by Kaylee Neumeister (82) and Ashley Frasca (84) in last week’s sectional at Pine Lakes Golf Club in Hubbard. \n“The girls have the mentality right now that they have to go into [today] knowing that they have to focus on one shot and one hole at a time.” \nColumbiana, Warren JFK and Poland also qualified for Tuesday’s girls district at Tam O’Shanter Hills. \nIn the Division III boys bracket, Warren JFK aims for its fourth consecutive state tournament berth in the district tournament on Wednesday at Tannenhauf Golf Club in Alliance. The Eagles recorded a 313 last Wednesday to place first in the sectional tournament at Braceville’s Riverview Golf Course,. \nMathews and Jackson-Milton tied at 320 to also qualify for the district tournament. Other stories of interest", "external_links": [], "published": "2015-10-06T07:05:00.000+03:00", "crawled": "2015-10-06T22:10:12.358+03:00", "highlightTitle": ""}