{"organizations": [], "uuid": "d92d91d4548addc78e34d66b3a520502be815d71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.courier-journal.com", "main_image": "http://www.gannett-cdn.com/-mm-/a5ddc0c34df5c095db6c5a482012cf02bb968f42/c=0-104-3000-1799&amp;r=x633&amp;c=1200x630/local/-/media/2015/09/30/Louisville/Louisville/635792162556882984-Waggener02.jpg", "site_section": "http://www.courier-journal.com/", "section_title": "Louisville News, Sports, Business | The Courier-Journal", "url": "http://www.courier-journal.com/story/news/education/2015/10/01/jcps-gets-good-bad-news-school-scores/73023858/", "country": "US", "title": "JCPS gets good, bad news on school scores", "performance_score": 0, "site": "courier-journal.com", "participants_count": 1, "title_full": "JCPS gets good, bad news on school scores", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T08:04:00.000+03:00", "replies_count": 0, "uuid": "d92d91d4548addc78e34d66b3a520502be815d71"}, "author": "courier-journal.com", "url": "http://www.courier-journal.com/story/news/education/2015/10/01/jcps-gets-good-bad-news-school-scores/73023858/", "ord_in_thread": 0, "title": "JCPS gets good, bad news on school scores", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jefferson County Public Schools saw a mixed bag of results on the state’s Unbridled Learning accountability system in 2014-2015 as graduation rates and reading and math proficiency rates stagnated even while the number of schools deemed proficient or distinguished rose.\nAnd even as one JCPS school celebrated being the first in the county to exit “priority” status, three other Louisville schools slipped into that dreaded category – the only schools in the state to enter priority status this year.\nWaggener High was one of 10 persistently low-performing schools in the state to make enough improvement over the past three years to climb out of priority status in this latest round of accountability results.\n\"We feel affirmed that the things we are doing for our students are helping them learn at higher levels and graduate prepared,\" Waggener principal Katy Zeitz said. She said she knows the school still has work to do to reach all of its diverse population but is \"thrilled to shed the priority label.\"\nBut Byck and Roosevelt-Perry elementaries and Moore Middle School took Waggener’s place at the bottom of the pile, after having failed to meet yearly progress goals for three years in a row and having overall scores that put them in the bottom 5 percent of all schools at their levels.\nTheir addition brings the tally of JCPS priority schools to 20, meaning JCPS schools make up all but nine of the priority schools in the state.\nAmong JCPS’ other priority schools, only five met their annual goals, although Fern Creek High was only 0.1 point away from meeting that criteria and being eligible to leave priority status.\nIn order to leave priority status, schools must meet their goals for three consecutive years, no longer be in the bottom 5 percent and have a graduation rate above 70 percent for three consecutive years.\nFern Creek High principal Nate Meyer said he thinks a data review in the next few weeks should be enough to get his school out of carrying the priority label.\n“We are proud of our gains,” Meyer said.\nBesides priority schools, other JCPS schools also struggled to meet their yearly objectives in 2014-2015, with 73 schools total meeting their goals this year, down from 96 last year.\nWhile most high schools improved their college and career readiness rates – JCPS’ rate rose from 60.6 percent to 63 percent – scores across JCPS on K-PREP and other state-mandated tests were largely disappointing.\nStudent proficiency in math and reading remained largely the same or moved slightly lower than last year at nearly all levels. The one exception was high school math proficiency, which rose slightly from 37.3 percent to 38.8 percent.\n\"Just as students have growth spurts followed by a plateau, so do they have ‘learning spurts’ followed by a plateau,\" JCPS Superintendent Donna Hargens said in a statement explaining why her district didn’t see larger gains.\nShe later added that \"We have come very far up a very tall mountain; however, we still have a long and steep climb ahead of us to reach the peak, so it may be somewhat slower going at this point.\"\nJCPS’ scores reflected flat results seen statewide.\n\"While we would like to see big gains in achievement every year, it is not uncommon to see some ups and downs from year to year,\" Kevin Brown, interim state education commissioner, said in a statement. \"Overall, we are moving in the right direction from where we started.\"\nThis is the fourth year of test results since the Bluegrass State implemented the Common Core State Standards, the first state in the country to do so. The standards are meant to help the state move toward deeper learning and better-prepared students.\nEvery year since the Common Core rollout, the state has tinkered with its accountability system, evolving the way it measures schools and districts as it adds or changes metrics.\nThis year, science scores for elementary and middle schools were stripped from the accountability results and K-3 program reviews were added.\nThe science scores were removed this year because the state is moving to new science standards, called the Next Generation Science Standards. But while teachers are teaching to the new standards, the state has not finished developing tests tied to these new standards.\nSo instead, students in grades 4 and 7 took shorter science tests than usual last school year, and their scores were tied to the points their schools received.\nThe yearly changes can make comparing multiple years of accountability scores difficult, although some individual metrics can be more easily compared.\nThis year, for the first time, the state released a ranking of schools and districts to see how elementary schools’, middle schools’, high schools’ and districts’ overall scores compared with one another.\nJCPS tied for 145th out of 173 school districts in the state, meaning its overall score in the accountability system was better than only 27 other districts’.\nAs usual, individual schools varied widely in their results. The Brown School, JCPS’ only K-12 school, stood out, with its elementary, middle and high schools all ranking in the top 10 statewide. DuPont Manual High had the highest score in the state for high schools, while Greathouse-Shryock took that honor for elementary schools.\nMeanwhile, Roosevelt-Perry ranked at the bottom of the elementary pack and saw the percentage of students scoring proficient or better fall in all five subjects – reading, math, writing, language mechanics and social studies.\nThe Academy @ Shawnee’s middle school, which is in its second year of operation and in 2014-2015 added a seventh grade, dropped significantly in its score and ranking, falling from the second-best-scoring middle school in 2013-2014 to 212th out of 327 middle schools statewide.\nDena Dossett, JCPS’ director of planning, said that because Shawnee’s middle school is so small, “any shifts in students can make a big change” to scores. When asked whether the changes could also be attributed by the school moving from being solely a magnet school to also accepting some resides students, she said JCPS had not done such an analysis yet.\n“Schools are not static organizations that look the same every year,” said Chief Academic Officer Dewey Hensley. “When you see a big drop, you have to get to the root cause of that drop.”\nHe said the numbers reported aren’t as important as what they represent: lost opportunities for children.\n“We know in our process of growth, we have to go through and make some really dramatic changes in order to have better outcomes for kids,” he said.\nReporter Allison Ross can be reached at (502) 582-4241. Follow The Courier-Journal’s education team on Facebook at Facebook.com/SchooledCJ .\nBuy Photo Waggener High was one of 10 persistently low-performing schools in the state to make enough improvement over the past three years to climb out of priority status in this latest round of accountability results. (Photo: By Michael Clevenger/The Courier-Journal)", "external_links": ["http://Facebook.com/SchooledCJ", "http://www.gannett-cdn.com/media/2015/09/30/Louisville/Louisville/635792162557350990-Waggener03.jpg", "http://www.gannett-cdn.com/-mm-/04405df2ddc2a675e19b96c6a00b934116047000/c=244-0-2756-1889&r=x408&c=540x405/local/-/media/2015/09/30/Louisville/Louisville/635792162557350990-Waggener03.jpg", "http://www.gannett-cdn.com/-mm-/c4ca2040e070ebc38a4525ff681d7b703556adee/r=500x314/local/-/media/2015/09/30/Louisville/Louisville/635792162557350990-Waggener03.jpg"], "published": "2015-10-01T08:04:00.000+03:00", "crawled": "2015-10-01T08:33:14.318+03:00", "highlightTitle": ""}