{"organizations": ["Eastern Michigan Eagles", "LSU Tigers", "LSU"], "uuid": "b81726ee37fea14fe683fe96550042cf9808fa36", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.shreveporttimes.com", "main_image": "http://www.gannett-cdn.com/-mm-/90c3506cfbb0cc4a4b803a6dbe5c014f18ba27b0/c=0-120-2478-1520&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/05/USATODAY/USATODAY/635796639389189895-USATSI-8841462.jpg", "site_section": "http://rssfeeds.shreveporttimes.com/shreveport/sports", "section_title": "Shreveport - Sports", "url": "http://www.shreveporttimes.com/story/sports/college/lsu/2015/10/06/lsus-deion-jones-one-stop-fournette/73494112/", "country": "US", "title": "Heisman survey: LSU's Leonard Fournette still No. 1", "performance_score": 0, "site": "shreveporttimes.com", "participants_count": 0, "title_full": "Heisman survey: LSU's Leonard Fournette still No. 1", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T22:16:00.000+03:00", "replies_count": 0, "uuid": "b81726ee37fea14fe683fe96550042cf9808fa36"}, "author": "", "url": "http://www.shreveporttimes.com/story/sports/college/lsu/2015/10/06/lsus-deion-jones-one-stop-fournette/73494112/", "ord_in_thread": 0, "title": "Heisman survey: LSU's Leonard Fournette still No. 1", "locations": ["USA", "Michigan"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Derick E. Hingle", "Leonard Fournette", "Thomas O'Toole", "Nick Chubb"], "text": "Heisman Survey: Leonard Fournette still No. 1, Nick Chubb plummets Fournette leads all rushers with 864 yards despite playing one less game. Post to Facebook Heisman Survey: Leonard Fournette still No. 1, Nick Chubb plummets Fournette leads all rushers with 864 yards despite playing one less game. Check out this story on shreveporttimes.com: http://usat.ly/1RrrYOG Cancel Send A link has been sent to your friend's email address. Posted! A link has been posted to your Facebook feed. Join the Conversation To find out more about Facebook commenting please read the Conversation Guidelines and FAQs Heisman Survey: Leonard Fournette still No. 1, Nick Chubb plummets Thomas O'Toole , USA TODAY Sports 5:16 p.m. CDT October 5, 2015 LSU Tigers running back Leonard Fournette (7) runs against the Eastern Michigan Eagles during the second half of a game at Tiger Stadium. LSU defeated Eastern Michigan 44-22. (Photo: Derick E. Hingle, USA TODAY Sports) \nGeorgia's team ranking isn't all that plummeted this week. Bulldogs running back Nick Chubb dropped from second to a tie for fifth in the USA TODAY Sports Heisman Trophy survey. \nDespite rushing for 146 yards and a touchdown, Chubb fell victim to the team's 38-10 home loss to Alabama on Saturday. That defeat dropped the Bulldogs from sixth to 16th in the Amway Coaches Poll . \nChubb is third in the country in overall rushing yards with 745. But that is more than 100 yards behind LSU's Leonard Fournette, who leads the country with 864 despite playing one less game than most of the top runners because of a weather cancellation. Fournette, again atop the weekly survey of reporters and editors with Heisman votes from properties owned by Gannett, averages 216 yards a game. Follow the road to the 2015 College Football Playoff at The Football Four , our home to rate and debate the nation's best. \nTCU quarterback Trevone Boykin, third last week, moved up to second while Ezekiel Elliott, who rushed for 274 yards and three touchdowns as Ohio State escaped Indiana 34-27, moved into third. He was in fourth last week but with just three points. \nAlabama's Derrick Henry, who received no votes last week, earned one this time after outrushing Chubb by two yards in Athens, Ga. Read or Share this story: http://usat.ly/1RrrYOG TOP VIDEOS", "external_links": [], "published": "2015-10-06T22:16:00.000+03:00", "crawled": "2015-10-08T03:02:41.184+03:00", "highlightTitle": ""}