{"organizations": [], "uuid": "2f0bccbf61a93fb4c7894bc276cdd8b893c26419", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/ncaabk", "section_title": "NCAA BK News, Scores, Schedule, Standings, Stats, Photos, Videos - Basketball - MSN Sports", "url": "http://www.msn.com/en-us/sports/ncaabk/auriemma-fans-sexist-for-not-supporting-women%e2%80%99s-team-sports/ar-AAf0LcJ", "country": "US", "title": "Auriemma: Fans sexist for not supporting women’s team sports", "performance_score": 0, "site": "msn.com", "participants_count": 7, "title_full": "Auriemma: Fans sexist for not supporting women’s team sports", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T03:00:00.000+03:00", "replies_count": 9, "uuid": "dfcb9a07731433716e23216b5e4bea5b59f38e8c"}, "author": "Marissa Payne", "url": "http://www.msn.com/en-us/sports/ncaabk/auriemma-fans-sexist-for-not-supporting-women%e2%80%99s-team-sports/ar-AAf0LcJ#post-0", "ord_in_thread": 0, "title": "Auriemma: Fans sexist for not supporting women’s team sports", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\nAuriemma: Fans sexist for not supporting women’s team sports The Washington Post 4 days ago Marissa Payne © Provided by Washington Post Geno Auriemma isn’t a man who likes to keep his thoughts to himself. Remember when he called men’s college basketball “a joke”? That was swell. Well, on Wednesday, the University of Connecticut women’s coach turned the tables and said it’s time for the American public to stop treating women’s team sports as jokes.\n“Generally speaking, the American public is just so sexist when it comes to women’s sports,” he said on Zach Lowe’s Grantland podcast . “The American public, they’ll watch Serena Williams, they’ll watch women’s tennis. Why? Because it’s individual. It’s fascinating. They’ll watch swimming in the Olympics. They’ll watch gymnastics. They’ll watch figure skating, but they’re not gonna watch team sports in women’s sports.”\nAdChoices [ NBA Commissioner Adam Silver laments state of WNBA ]\nAuriemma went one step forward, picking out women as the worst offenders.\n“And the worst part? Women who bitch and moan all the time about not getting any respect do a horrible job of supporting women’s sports at the gate with their money,” he said. “They’re the first ones to complain that women don’t get treated equally, yet they’re the last ones to buy tickets.”\nThe 10-time national champion’s only evidence when pressed by Lowe whether it was really true that women buy less tickets to women’s team sporting events than men was, “Look at the audience.”\nIn other words, Auriemma might be wrong.\nU-Conn. fans also didn’t escape the Auriemma’s critical eye during the 70-minute podcast.\n“Some of our fans are just so [expletive] stupid it’s unbelievable,” he said after being asked if U-Conn. had become too good.\n[ From the archives: U-Conn. outscores Texas by record 51 points ]\n“They complain a lot of times that we have no competition and that it’s boring. Then if we play a really good team and don’t play our ‘A’ game, they bitch that something’s wrong with U-Conn.: ‘This kid’s not any good, that kid’s not any good, Geno Auriemma got outcoached by this coach.’ It’s unbelievable.”\nGo to MSN Home", "external_links": ["http://espn.go.com/espnradio/grantland/player?id=13762679", "https://www.washingtonpost.com/news/early-lead/wp/2015/09/17/nba-commissioner-adam-silver-on-the-wnba-its-not-where-we-hoped-it-would-be/", "https://www.washingtonpost.com/news/early-lead/wp/2015/03/28/u-conn-womens-basketball-team-outscores-texas-by-record-51-points-to-reach-elite-8/", "https://www.washingtonpost.com/news/early-lead/wp/2015/04/01/u-conn-womens-basketball-coach-geno-auriemma-calls-mens-college-basketball-a-joke/", "http://go.microsoft.com/fwlink/?LinkID=286759"], "published": "2015-10-01T03:00:00.000+03:00", "crawled": "2015-10-05T23:55:50.922+03:00", "highlightTitle": ""}