{"organizations": [], "uuid": "d10eeb7d610aa3b4fd71e5056f83bcec7170df79", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "union-bulletin.com", "main_image": "http://unionbulletin.media.clients.ellingtoncms.com/img/photos/2013/08/29/UB_logo.png", "site_section": "http://union-bulletin.com/rss/headlines/sports/local/", "section_title": "union-bulletin.com stories: Local Sports", "url": "http://union-bulletin.com/news/2015/oct/24/touchet-overwhelms-st-john-endicott-69-0/", "country": "US", "title": "Touchet overwhelms St. John-Endicott, 69-0", "performance_score": 0, "site": "union-bulletin.com", "participants_count": 1, "title_full": "Touchet overwhelms St. John-Endicott, 69-0", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T01:25:00.000+02:00", "replies_count": 0, "uuid": "d10eeb7d610aa3b4fd71e5056f83bcec7170df79"}, "author": "Jim Buchan, The Walla Walla Union-Bulletin", "url": "http://union-bulletin.com/news/2015/oct/24/touchet-overwhelms-st-john-endicott-69-0/", "ord_in_thread": 0, "title": "Touchet overwhelms St. John-Endicott, 69-0", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Touchet overwhelms St. John-Endicott, 69-0 Jim Buchan, The Walla Walla Union-Bulletin Advertisement TOUCHET — It felt a lot more like fall here Friday afternoon. The near-80-degree temperatures of recent Fridays dipped into the low 60s. A high overcast blunted the late October sun. And a steady northwest breeze chilled the air. Other than that, it was more of the same as Touchet overwhelmed visiting St. John-Endicott 69-0 in a Southeast 1B-8 League football mismatch. It was the undefeated Indians’ seventh consecutive victory, none of them recorded by less than a 34-point victory margin. And considering that the Eagles entered the game without a victory and were coming off a 68-6 defeat at the hands of previously winless Dayton, Friday’s outcome was all but predetermined. “I have a lot of empathy for those guys,” Indians coach Gary Dorman said of the Eagles, who saw their season record slide to 0-8. “They’re going through what all small schools go through, but they will get to the point where their kids will put a hurting on other people. I hope.” The Eagles have just four seniors on their 20-player roster. Five freshmen and five sophomores are expected to handle varsity responsibilities along with six juniors. By contrast, the Indians’ roster, 33 players deep, is led by seven seniors and 10 juniors. Not to mention a winning tradition that goes back decades. Nevertheless, it was Touchet sophomores and freshmen who saw the majority of the time on the field Friday as the Indians exploded for 42 first-quarter points and put the running-clock rule into effect in record fashion. Freshman running back Isaac Gutierrez led the way with 134 yards on five rushing attempts. He scored on a 46-yard run and a 49-yard pass from freshman quarterback Justin Big Sorrel Horse in the first quarter and tacked on an 85-yard TD run in the fourth quarter. Sophomore Amin Acevado rushed for 102 yards on four tries, including a 26-yard touchdown run in the first period. And sophomore Jonathon Orozco chipped in with 96 yards on 14 rushing attempts and scored on a 53-yard run in the third quarter. Sophomore Bryan Andrade added a 15-yard touchdown run on his only attempt, also in the third quarter. “I was real proud of our guys from the top to the bottom,” Dorman said. “These younger guys practice hard, too, and it’s good to get to see what these young guys coming up can do. “But sometimes it is hard to manage a game like this and make all the substitutions and make sure everyone gets adequate playing time.” Other than the regulars, that is. For them, it was a day of rest. Senior Leo Garcia, the Indians’ leading rusher on the season, had his number called just once, and he scampered 18 yards for a touchdown and a 14-0 Touchet lead at 8:38 of the first quarter. Less than a minute later, junior fullback James Kates rumbled 11 yards for a score on his only touch of the day following a St. John-Endicott turnover. Senior starting quarterback Andrew Flagstead called just those two plays from scrimmage before turning the keys over to junior Lot Butler, the Indians’ backup quarterback. Butler ran just two series before handing the offense over to Big Sorrel Horse, the third-string QB. And other than kickoffs and a 7-for-8 day on conversion kicks, senior Carlos Rincon, the Indians’ most explosive offensive weapon, never touched the football. Meanwhile, the young Eagles simply couldn’t move the ball. They finished the game with minus-6 yards rushing on 42 attempts and completed 4-of-8 passes for 30 yards. SJ-E ran just one play on Touchet’s side of the 50-yard line in the first half, that coming after the Indians’ only turnover of the game, and SJ-E never advanced the ball beyond the Indians’ 33-yard line. Turnovers were a big part of the Eagles’ offensive woes as they fumbled the ball seven times and lost three of them. They were also intercepted once, a diving pick by Touchet eighth-grader Jacob Big Sorrel Horse on the Eagles’ final possession of the game. St. John-Endicott’s first turnover resulted in the game’s first score. Eagles junior Reagan Harrison completed a 2-yard pass to senior Weston Whinery, who had the ball poked away by Rincon and into the hands of Indians senior Jackson Elsasser, who happily galloped 34 yards for the touchdown. It was that kind of a day. Touchet, which at 5-0 shares first place in the league standings with Liberty Christian, plays its final regular-season home game here next Friday against non-league foe Dayton. The Indians then close out league play the following Friday at Liberty Christian, which humbled Colton 84-30 Friday to extend its season record to 8-0. St. John-Endicott finds itself up against it again next Friday when the Eagles travel to Richland to face Liberty Christian’s undefeated Patriots. Indians 69, Eagles 0 St. John-Endicott 0 0 0 0 — 0 Touchet 42 7 13 7 — 69 Tou — Elsasser 34 fumble recovery return (Rincon kick). Tou — Garcia 18 run (Rincon kick). Tou — Kates 11 run (Rincon kick). Tou — Acevado 26 run (Rincon kick). Tou — Gutierrez 46 run (Rincon kick). Tou — Gutierrez 49 pass from Ju. Big Sorrel Horse (Rincon kick). Tou — Acevado 47 run (Gutierrez kick). Tou — Andrade 15 run (Rincon kick). Tou — Orozco 53 run (kick blocked). Tou — Gutierrez 85 run (Rincon kick). SJ-E Touchet", "external_links": [], "published": "2015-10-25T01:25:00.000+02:00", "crawled": "2015-10-25T01:53:17.332+02:00", "highlightTitle": ""}