{"organizations": [], "uuid": "5379aba03f4f0c779b24eca16c88fe9829341cc5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.odt.co.nz", "main_image": "", "site_section": "http://www.odt.co.nz/sport/other/feed", "section_title": "Otago Daily Times: Other Sports News", "url": "http://www.odt.co.nz/sport/cycling/360706/cycling-kennedys-run-nicely-timed", "country": "NZ", "title": "Cycling: Kennedy's run nicely timed", "performance_score": 0, "site": "odt.co.nz", "participants_count": 0, "title_full": "Cycling: Kennedy's run nicely timed", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T18:25:00.000+02:00", "replies_count": 0, "uuid": "5379aba03f4f0c779b24eca16c88fe9829341cc5"}, "author": "", "url": "http://www.odt.co.nz/sport/cycling/360706/cycling-kennedys-run-nicely-timed", "ord_in_thread": 0, "title": "Cycling: Kennedy's run nicely timed", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kennedy"], "text": "Cycling \nHastie Memorial race winner Simon Kennedy timed his run to perfection to win a tightly contested race on Saturday. \nKennedy, who was coached by Kelvin Hastie as a 15-year-old, made the most of the handicap and did enough to finish ahead of the riders starting from scratch. \nAbout 50 riders competed in Otago's premier one-day race, an undulating and often weather-affected race, covering about 125km from Millers Flat, through the picturesque Manuka George, and finishing just out of Mosgiel. \nThe riders at the back off the scratch mark always pray for inclement conditions to toughen the race up and give them the opportunity to make up the handicap of often an hour or more, but that was not the case on Saturday, with sunny skies and a favourable wind. \nKennedy's mark of the second break (38 minutes) contained a group of strong riders, and working well together the group caught the front of the race with only 4km remaining. \nIt was the exact same spot the front bunch was caught last year. \nIn the final stages, over some small rises that would feel like mountains to the riders, Kennedy had time to lift his arms in celebration ahead of mark companions Neil O'Fee, who finished second, and Nick Beekhuis, in third. \nFastest time went to scratch rider Liam Aitcheson, in 3hr 44min 47sec in a tight finish with Jake Mariott and Sam Horgan. \nThe riders from the scratch mark were not given a chance and were 25 minutes back at the turn to Milton. \nBut with exceptionally strong riding from Horgan this group finished only 10 minutes down on the winners. \nElyse Fraser returned home after strong showings in the Calder Stewart Elite Race Series to clock an impressive 3hr 45min 41sec from the second break to be the fastest woman competitor. »", "external_links": [], "published": "2015-10-25T18:25:00.000+02:00", "crawled": "2015-10-25T20:53:41.502+02:00", "highlightTitle": ""}