{"organizations": [], "uuid": "aa5adc9cc0c2161def38f4eac81809f29caba142", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.oregonlive.com", "main_image": "http://imgick.oregonlive.com/home/olive-media/width620/img/oregonian/photo/2015/10/02/18887159-large.jpg", "site_section": "http://www.oregonlive.com/", "section_title": "Oregon Local News, Breaking News, Sports &amp; Weather - OregonLive.com", "url": "http://www.oregonlive.com/pacific-northwest-news/index.ssf/2015/10/chris_mintz.html", "country": "US", "title": "Oregon shooting: Chris Mintz, student who charged shooter, always one to 'cowboy up'", "performance_score": 1, "site": "oregonlive.com", "participants_count": 21, "title_full": "Oregon shooting: Chris Mintz, student who charged shooter, always one to 'cowboy up' | OregonLive.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T01:11:00.000+03:00", "replies_count": 21, "uuid": "da7e39fc86b44c981f56e1286ed8bd4900fe615e"}, "author": "Andrew Theen | The Oregonian/OregonLive", "url": "http://www.oregonlive.com/pacific-northwest-news/index.ssf/2015/10/chris_mintz.html#post-0", "ord_in_thread": 0, "title": "Oregon shooting: Chris Mintz, student who charged shooter, always one to 'cowboy up'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Updated: This post was updated with the most recent figures of the GoFundMe campaign.\nThe day after the worst mass shooting in Oregon history, family and friends say Chris Mintz, the man credited with charging the shooter, is lucky to be alive and has a long road of recovery ahead of him.\nMintz, an Army veteran and student at Umpqua Community College in Roseburg, was shot seven times Thursday in the massacre. Ten people including the gunman were killed and nine more were injured.\nMintz's family said Friday the 30-year-old ran at the shooter to protect fellow students and took multiple gunshots to the chest.\nWhile lying on the ground wounded, Chris shouted, \"It's my son's birthday, it's my son's birthday,\" according to multiple media reports.\nIn an interview with ABC News on Friday, Mintz said he was mostly concerned about other victims. \"I just hope that everyone else is OK,\" he told the network.\nHannah Miles, a fellow student told ABC News that Mintz ran back into the building where the shooting occurred.\n\"He ran to the library and pulled the alarms and he was telling people to run, grabbing people, telling them, 'You just have to go,'\" she told ABC News.\nThe day after the carnage, family, friends and acquaintances described Mintz as a devoted father to his 6-year-old son, Tyrik, and a fitness nut who never missed a workout. They also said his courageous act wasn't surprising.\n\"He got shot all those times but they missed the vital organs,\" said Wanda Mintz, his aunt.\n\"If you know Chris,\" she said, \"he'll cowboy up.\"\nHe will have to learn to walk again, and Wanda Mintz said she could tell from a brief conversation that he's in considerable pain but in good spirits.\nJaime Skinner, Tyrik's mother, said on her Facebook page that Mintz had a 6 1/2-hour surgery Thursday after suffering gunshot wounds to the upper back, abdomen, left hand and both legs.\n\"He is one tough dude and he will do just fine,\" she wrote. \"Today he became a hero.\"\nDerek Bourgeois, Mintz's cousin, set up a GoFundMe account to help pay for the medical bills. As of 5:09 p.m., the account had more than $377,809 donations, well past the $10,000 goal.\nMintz was taking classes at Umpqua Community College with the long-term goal of becoming a physical therapist. He also worked at the local YMCA doing maintenance work on the night shift, where he was known as \"Mr. Fix-It.\"\nMintz joined the Army after high school and was an infantryman, Wanda Mintz said, stationed out of Joint Base Lewis-McChord in Washington. He left the Army because of a hand injury.\nBourgeois, a fellow Army veteran, told the Daily Beast that Mintz deployed to a combat zone and survived without serious injuries.\nMike Gwaltney, a friend and swim coach at the YMCA, described Mintz as a devoted father who \"loves his son unconditionally.\" He visited Mintz at Roseburg's Mercy Hospital and the first thing his friend said to him was: \"Hi, Coach Mike.\"\n\"The thing that he was worried about was not being able to do his workout today,\" Gwaltney said.\nWanda Mintz said her nephew was a football player and all-around athlete growing up in rural North Carolina.\n\"He is Randleman,\" she said of the small North Carolina community about 18 miles south of Greensboro. \"Born and bred.\" Randleman has about 4,000 residents and was long home to Richard Petty, the NASCAR legend's, museum.\nDan Bethel, who used to live next-door to Mintz, described him as a country boy from the South who is \"physically fit, to the extreme.\"\nHear from students, community leaders after UCC shooting Watch a compilation of videos from dispatch communication to student reaction after Umpqua Community College shooting.\nIf Mintz's gym fees ever got too high, he'd bring out a massive tractor trailer tire and flip it up and down the steep hill in Roseburg, shirtless if the weather allowed, Bethel said.\n\"He was sure shooting at the wrong guy,\" Bethel said of the gunman. \"He would be awfully hard to stop.\"\nGwaltney said he initially bonded with Mintz over University of Florida football, but he also worked closely with his young son.\nWanda Mintz said Tyrik has autism. \"He keeps this schedule,\" she said of the boy. \"This will throw him off. This has affected so many people.\"\nMintz's Instagram account is dominated by workout photos and pictures with Tyrik. He often takes his son down to the Umpqua River or to the beach, his aunt said.\nBobby Mintz, Chris' father, said he was just out in Oregon last week to celebrate Tyrik's birthday. They drove from Roseburg to Seattle and did the tourist things. It was a great trip, he said.\nOn Friday, he scrambled to get back to his son and was flying back to Roseburg from North Carolina. \"He was just trying to save people,\" the elder Mintz said.\n-- Andrew Theen\natheen@oregonian.com\n503-294-4026\n@cityhallwatch", "external_links": ["http://abcnews.go.com/US/hero-umpqua-community-college-student-chris-mintz-speaks/story?id=34201425", "https://www.gofundme.com/s75ge9y4"], "published": "2015-10-03T01:11:00.000+03:00", "crawled": "2015-10-03T07:37:01.085+03:00", "highlightTitle": ""}