{"organizations": [], "uuid": "7e77ed6bb95ad8daf2c77dd468a3623a54011eab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/autos/enthusiasts", "section_title": "Car Enthusiast News – The Latest and Greatest Sports Cars – MSN Autos", "url": "http://www.msn.com/en-us/autos/enthusiasts/2017-bmw-5-series-3-series-hybrid-spied/ar-AAeVgMu", "country": "US", "title": "2017 BMW 5 Series, 3 Series Hybrid Spied", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "2017 BMW 5 Series, 3 Series Hybrid Spied", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "7e77ed6bb95ad8daf2c77dd468a3623a54011eab"}, "author": "Zach Gale", "url": "http://www.msn.com/en-us/autos/enthusiasts/2017-bmw-5-series-3-series-hybrid-spied/ar-AAeVgMu", "ord_in_thread": 0, "title": "2017 BMW 5 Series, 3 Series Hybrid Spied", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "2017 BMW 5 Series, 3 Series Hybrid Spied Motor Trend 20 hrs ago Zach Gale 2017 BMW 5 Series, 3 Series Hybrid Spied A new BMW 5 Series is on the way, and we just got a fresh glimpse at the midsize luxury sedan. We spotted an early prototype of the new BMW 5 Series , which will likely debut as a 2017 model, out in the Mojave Desert along with a refreshed 3 Series wearing hybrid badging. The popular 5 Series and the Mercedes-Benz E-Class are both set for upcoming debuts, so it won't be long before that sales battle is renewed.\nResearch Make (e.g. Mazda) Acura Alfa Romeo AM General Aston Martin Audi Bentley BMW Buick Cadillac Chevrolet Chrysler Daewoo Dodge Eagle Ferrari Fiat Fisker Ford Geo GMC Honda Hummer Hyundai Infiniti Isuzu Jaguar Jeep Kia Lamborghini Land Rover Lexus Lincoln Lotus Maserati Maybach Mazda McLaren Mercedes-Benz Mercury MINI Mitsubishi Nissan Oldsmobile Plymouth Pontiac Porsche Ram Rolls-Royce Saab Saturn Scion smart SRT Subaru Suzuki Tesla Toyota Volkswagen Volvo The 5 Series prototype we saw appeared to be covering up what BMW calls air breathers and air curtains around the front wheels to aid aerodynamics. Already, the outgoing 2016 model is efficient when it comes to EPA-rated mileage, with the rear-drive turbo-four 528i at 23/34 mpg city/highway, the turbo-six 535i at 20/31 mpg, and the turbodiesel-six at 26/38 mpg. On the next-gen 5 Series, expect the turbo-four to continue serving as the base model, with a revised turbo-six making more than the current car's 300 hp and 300 lb-ft of torque. The 2016 BMW 340i produces 320 hp and 330 lb-ft from a revised turbocharged inline-six; combine added power with what we're guessing will be minor weight savings and we may have the makings of an even quicker 535i. In Motor Trend testing, a 2012 535i took 5.5 seconds to reach 60 mph with the eight-speed automatic, in rear-drive form.\n© Provided by MotorTrend 2017 BMW 5 Series Spied Front Three Quarters From the side, where the current 5 Series has a sharp character line cutting through the door handles, the prototype we saw seemed to have a more subtle look, though we'll know for sure once the car debuts. Through the first eight months of 2015, sales of the BMW 5 Series line, which encompasses a sedan and the Gran Turismo four-door hatch (plus, some might add, the 6 Series line) number 29,779 units, down 21.1 percent from the same period in 2014. The E-Class line during the same period is up to 31,152 units, down 34.7 percent from 2014.\nIn the small caravan of prototype BMWs, we also saw a 7 Series car and a refreshed 3 Series with hybrid badging. Most likely, this latter model was a prototype of the upcoming 330e, the plug-in hybrid that's expected to have a combined output of around 250 hp and 310 lb-ft. BMW says the 0-60 mph sprint will take 6.1 seconds, or for hypermiling enthusiasts, an anticipated EV-only range of 22 miles.\nTell us : What would you like to see from the redesigned 2017 BMW 5 Series?\n© Provided by MotorTrend Redesigned BMW 3 Series Spied Follow MSN Autos on Facebook\nGo to MSN Home", "external_links": ["https://www.facebook.com/MSNAutos", "http://www.motortrend.com/new_cars/04/bmw/7_series/", "http://www.motortrend.com/cars/2015/bmw/5_series/", "http://www.motortrend.com/", "http://www.motortrend.com/roadtests/sedans/1505_2016_bmw_3_series_first_look/"], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-10-01T05:02:31.879+03:00", "highlightTitle": ""}