{"organizations": [], "uuid": "726155e22583cb90f4dde2d957e3fd0f6f96522a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/6/56/161665/Sports/Omni-Sports/Tennis-Halep-and-Sharapova-drawn-together-at-WTA-F.aspx", "country": "EG", "title": "Tennis: Halep and Sharapova drawn together at WTA Finals - Omni Sports - Sports", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Tennis: Halep and Sharapova drawn together at WTA Finals - Omni Sports - Sports - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "726155e22583cb90f4dde2d957e3fd0f6f96522a"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/6/56/161665/Sports/Omni-Sports/Tennis-Halep-and-Sharapova-drawn-together-at-WTA-F.aspx", "ord_in_thread": 0, "title": "Tennis: Halep and Sharapova drawn together at WTA Finals - Omni Sports - Sports", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Tennis: Sharapova withdraws from China Open Tennis: Sharapova comeback cut short by new injury Tennis: Sharapova returns to court at Wuhan Open Top seed Simona Halep was pooled with grand slam winners Maria Sharapova and Flavia Pennetta in a formidable looking Red Group for the end-of-season WTA Finals on Friday.\nWith world number one and defending champion Serena Williams opting out after narrowly missing out on a rare calendar Grand Slam, Romanian Halep is the highest seed for the eight woman end-of-season championships which begin on Sunday.\nHalep, who lost to Williams in the final last year after beating the American in the pool stage, was drawn against Italian Pennetta, who lifted a shock U.S. Open title after compatriot Roberta Vinci beat Williams in the last four.\nThe Romanian, winner at Indian Wells earlier this year, will also take on Russian multiple grand slam winner Sharapova, who lost in the Australian Open final to Williams in January.\nPoland's Agnieszka Radwanska, who won her 16th career title in China last week, rounded out the group from which the top two will advance to the semi-finals after round robin play.\nAwaiting them will be the heavy hitters of the White Group, where Wimbledon finalist Garbine Muguruza of Spain and twice champion of the grass court major Petra Kvitova were pooled together.\nThey were joined by Germany's Angelique Kerber, who completed the rare feat of winning WTA titles on green clay, red clay, grass and hardcourts this year.\nCzech Lucie Safarova, who only qualified for the singles field on Thursday, was the other player in the group.\nSafarova, the world number nine and French Open runner-up, will also play in the doubles with American partner Bethanie Mattek-Sands where she has been drawn in the same pool as Muguruza and partner Carla Suarez Navarro.\nSingles\nRed Group\nSimona Halep (Romania)\nMaria Sharapova (Russia)\nAgnieszka Radwanska (Poland)\nFlavia Pennetta (Italy)\nWhite Group\nGarbine Muguruza (Spain)\nPetra Kvitova (Czech Republic)\nAngelique Kerber (Germany)\nLucie Safarova (Czech Republic)\n(For more sports news and updates, follow Ahram Online Sports on Twitter at @AO_Sports and on Facebook at AhramOnlineSports .)", "external_links": ["https://twitter.com/AO_Sports", "https://www.facebook.com/AhramOnlineSports?fref=ts"], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-23T18:08:18.022+03:00", "highlightTitle": ""}