{"organizations": [], "uuid": "21d47121306c7d9a0887c6e63459ab80105302e4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mndaily.com", "main_image": "http://www.mndaily.com/sites/default/files/images/photos/2015/10/04/100515stvb1005-1.jpg", "site_section": "http://www.mndaily.com//rss/sports", "section_title": "Sports", "url": "http://www.mndaily.com/sports/volleyball/2015/10/05/minnesota-earns-upset-illinois", "country": "US", "title": "Minnesota earns upset of Illinois", "performance_score": 0, "site": "mndaily.com", "participants_count": 1, "title_full": "Minnesota earns upset of Illinois", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T16:11:00.000+03:00", "replies_count": 0, "uuid": "21d47121306c7d9a0887c6e63459ab80105302e4"}, "author": "jthomas@mndaily.com", "url": "http://www.mndaily.com/sports/volleyball/2015/10/05/minnesota-earns-upset-illinois", "ord_in_thread": 0, "title": "Minnesota earns upset of Illinois", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Minnesota earns upset of Illinois The Gophers were down after three sets but came back to get the victory. Outside Hitter Sarah Wilhite hits the ball over the net at the Sports Pavilion where the Gophers defeated No. 7 Illinois on Saturday. By Emily Polglaze October 05, 2015 After three sets played, the Minnesota volleyball team looked like they were coming unglued. They were down 2-1 at home against No. 7 University of Illinois, but something made them flip the switch. The No. 16 Gophers came back in full force in the fourth and fifth sets, winning the final two frames by a combined score of 40-16. Minnesota walked away with a 3-2 victory in front of a season-best crowd. “They really fed us energy, and that helped us,” junior Sarah Wilhite said. “It’s a hard gym to play in for the other team, and it’s a great advantage.” Minnesota (11-3, 3-1 Big Ten) came out strong with an early lead in the first set, but Illinois tied the score at 5-5. A consistent back-and-forth exchange of points occurred throughout the set, and Minnesota reclaimed the lead at 21-20. The score was tied again 22-22, but Minnesota added two more points. Illinois shut down Minnesota’s first set point opportunity, tying the score 24-24, but kills from Paige Tapp and Daly Santana gave the Gophers the first set victory. In the second set, Illinois led 8-4, but Minnesota reclaimed the lead 13-10 until the Illini came up for the tie at 18-18. Minnesota attack errors gave Illinois the advantage, and a kill from Santana and block from Paige and Hannah Tapp weren’t enough to get past the Illini, who took the set 25-22 to even the match 1-1. The customary break between the second and third sets for teams to regroup didn’t seem to work for Minnesota. The Gophers trailed the entire third set, and their energy seemed to hit a low point. Minnesota cut a 16-8 deficit to 23-16, but Illinois claimed the set 25-22 and went up 2-1 for the match, which didn’t sit well with the Gophers. “We made the decision that if we were going to be here, we were going to compete,” Santana said. “We wanted to end the game knowing we did everything we could.” Minnesota came out with new energy in the fourth set, getting a quick 8-3 lead with a service ace from Katie Schau. The Gophers stayed strong throughout the set, pushing the lead to 20-7 with a block from Hannah Tapp and junior Maddie Beal, as well as one from Santana and Paige Tapp and a solo block from Hannah Tapp. The Gophers outhit the Illini with a .480 percentage in the 25-10 win, while the visitors had a negative hitting percentage. And in the fifth and final set, Minnesota didn’t let up. The Gophers started with a 6-2 lead and would hold the set from then on. A block from Hannah Tapp and Beal ended the set 15-6 to give Minnesota the match victory. “I was really proud of our team; it was close at the beginning, and then to turn it around was really special for us,” head coach Hugh McCutcheon said. “It’s another validation of the progress we’re making.”", "external_links": [], "published": "2015-10-05T16:11:00.000+03:00", "crawled": "2015-10-05T23:36:03.306+03:00", "highlightTitle": ""}