{"organizations": ["Mississippi State", "MSU"], "uuid": "e657c156867bf61779245314716f8c2a4e692f21", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.clarionledger.com", "main_image": "http://www.gannett-cdn.com/-mm-/c16f49c484bc6c0d5e25b71d0e0eccf3765372f2/c=0-162-3190-1964&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/05/JacksonMS/JacksonMS/635796529728286945-USATSI-8058683.jpg", "site_section": "http://rssfeeds.clarionledger.com/jacksonms/mississippistatesports", "section_title": "Jackson MS - Mississippi State Sports", "url": "http://www.clarionledger.com/videos/sports/college/mississippi-state/2015/10/05/73415226/", "country": "US", "title": "MSU beat up after A&M loss, including torn ACL for Market", "performance_score": 0, "site": "clarionledger.com", "participants_count": 0, "title_full": "MSU beat up after A&M loss, including torn ACL for Market", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T23:11:00.000+03:00", "replies_count": 0, "uuid": "e657c156867bf61779245314716f8c2a4e692f21"}, "author": "", "url": "http://www.clarionledger.com/videos/sports/college/mississippi-state/2015/10/05/73415226/", "ord_in_thread": 0, "title": "MSU beat up after A&M loss, including torn ACL for Market", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Michael Bonner", "Derden", "Kendrick Market"], "text": "MSU beat up after A&M loss, including torn ACL for Market Michael Bonner, The Clarion-Ledger 3:11 p.m. CDT October 5, 2015 Mississippi State safety Kendrick Market will miss the remainder of the season with a torn anterior cruciate ligament. (Photo: Spruce Derden, Spruce Derden-USA TODAY Sports) 11 CONNECT 22 TWEET LINKEDIN 1 COMMENT EMAIL MORE \nSTARKVILLE – Kendrick Market used two trainers under each arm to hobble off the grass at Kyle Field on Saturday. It was the third injury in less than a year for Mississippi State’s starting safety. \nThis one ended his career. \nMSU coach Dan Mullen announced Monday that the fifth-year senior tore his left anterior cruciate ligament and will miss the rest of the season. \n\"All the safeties’ roles are going to have to increase,” Mullen said. “He’s a guy that you wanted to play every snap of the game and everybody else rotate.” \nMarket isn’t eligible for a sixth-year medical redshirt because he already had started four games. \n“Unfortunately that’s probably his last play of his career,” Mullen said. “It’s a shame. You never know what it’s going to end. He's a young man that’s done so much.” \nMarket had 23 tackles this year. In 41 games in his career -- 20 starts -- the Batesville native recorded 92 tackles and an interception. \nMarket left the game against Texas A&M early in the second quarter with a non-contact injury. The injury occurred a week after the safety returned to the field after missing the matchup against Northwestern with a foot injury. \nThe safety tore his Achilles in last year’s Egg Bowl. His availability remained in question until the start of fall camp in August, where he fully participated. \n\"Everybody's role is really going to have to increase,\" Mullen said. \"Guys are going to have to grow up in a hurry at that position.\" \nBrandon Bryant filled in for Market against Texas A&M. The redshirt freshman finished with 2.5 tackles. The Bulldogs have depth at safety with Bryant, Jamal Peters and Mark McLaurin. All three players are in their first year on the field, though. The trio has combined for 30 tackles this season. \n\"There's a lack of experience,\" Mullen said. \"They're going to have to grow in a hurry especially with the challenges with the explosive offensive teams we'll be playing.\" \nTight end Gus Walley missed last week’s game with a hand injury. He is listed as questionable this week for Troy. \n“We didn’t feel great about him playing last week,” Mullen said. “He was on the edge. We just felt (better) not to put him out there.” \nMullen expressed optimism for the four other players that left Saturday night’s game in College Station, Texas. \nOffensive lineman Rufus Warren, corner Will Redmond and wide receivers Gabe Myles and Joe Morrow are all questionable for this weekend’s game against. \nWarren, Redmond and Myles all have ankle or leg injuries. Morrow left the game with an arm injury. \nRedmond and Myles were both seen after the game wearing walking boots. \n“The only one that is significant injury is Kendrick,” Mullen said. “With our trainers, they felt pretty positive about everybody else.” \nRedmond left the game under his own power on Saturday with only a slight limp. If the senior can't play, Cedric Jiles or Tolando Cleveland would receive the start. Cleveland has started two games this season. \nElgton Jenkins already began taking reps away from Warren during the last three games. The injury to Myles, who scored his first career touchdowns this season, allows for opportunities for first-year players Donald Gray and Malik Dear. Morrow isn’t a primary target for the Mississippi State offense. \n“In the short term, the next guy will step up because you know someone’s coming back,” Mullen said. “In the case of Kendrick, I don’t know. He’s such a great leader for us. He’s one of our best football players.” \nSCHEDULE NOTE: On Oct. 17, Mississippi State and Louisiana Tech will kickoff at 11 a.m. at Davis Wade Stadium on SEC Network. \nContact Michael Bonner at mbonner@jackson.gannett.com. Follow @MikeBBonner on Twitter. 11 CONNECT 22 TWEET LINKEDIN 1 COMMENT EMAIL MORE Read or Share this story: http://on.thec-l.com/1LekGwE TOP VIDEOS", "external_links": [], "published": "2015-10-05T23:11:00.000+03:00", "crawled": "2015-10-06T05:50:57.091+03:00", "highlightTitle": ""}