{"organizations": [], "uuid": "09be127f167c7b8800dea29385dfc204e1f69eed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.arcamax.com", "main_image": "http://www.arcamax.com/apple-touch-icon.png", "site_section": "http://www.arcamax.com/sports/", "section_title": "Sports | ArcaMax Publishing", "url": "http://www.arcamax.com/sports/basketball/s-1733643?fs", "country": "US", "title": "Lynx defeat Fever, even WNBA Finals at one game apiece | Basketball", "performance_score": 0, "site": "arcamax.com", "participants_count": 1, "title_full": "Lynx defeat Fever, even WNBA Finals at one game apiece | Basketball | ArcaMax Publishing", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "09be127f167c7b8800dea29385dfc204e1f69eed"}, "author": "arcamax.com", "url": "http://www.arcamax.com/sports/basketball/s-1733643?fs", "ord_in_thread": 0, "title": "Lynx defeat Fever, even WNBA Finals at one game apiece | Basketball", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MINNEAPOLIS -- And now it's a series.\nBeaten on their home court Sunday in Game 1 of the WNBA finals, the Lynx officially joined the fray Tuesday at Target Center, taking the game over with a 20-7 run to end the third quarter en route to a 77-71 victory over Indiana that tied the best-of-five series at a win apiece.\nAnd while there was better balance from the Lynx in Game 2, it was still, mainly, a two-player attack. Center Sylvia Fowles scored 21 points with nine rebounds on her 30th birthday, keeping the Lynx going in the early going when the rest of the Lynx starters struggled. And then Maya Moore joined in, scoring 14 of her 19 points in the second half, as the Lynx turned up the intensity and pressure in front of 12,134 fans. The Lynx improved to 19-2 in home playoff games under coach Cheryl Reeve.\nGame 3 is Friday in Indianapolis.\nThe game was intense -- and physical -- from the beginning with several players in foul trouble.\nFowles sustained a bloodied nose. Shenise Jonson was dazed by an elbow late in the game, and the only call was a technical on Indiana coach Stephanie White for screaming about it.\nSeimone Augustus scored 11 points for the Lynx, Lindsay Whalen had eight points and four assists, and the addition of Renee Montgomery into the rotation improved the Lynx's perimeter defense, leading in large part to the team's second-half surge.\nBriann January had 17 points and x assists. Tamika Catchings, battling foul trouble all night, scored 11with nine rebounds. Marissa Coleman had 10.\nUp 67-61 early in the fourth, the Lynx let the Fever claw back. January scored on a drive. Then Catchings was fouled and made two free throws with 6:03 left and it was a two-point game.\nBut Moore scored. Moments later, after the technical on White, Moore hit the free throw for a five-point lead with 2:49 left.\nSuddenly it was the Fever offense that couldn't get a shot off, with the Lynx forcing several turnovers down the stretch. Anna Cruz hit two free throws with 27.4 seconds left to push the Lynx lead to five, then she got the rebound of Catchings' miss at the other end to seal the win.\nWith the exception of Fowles, the Lynx did not come out ready to play in the first quarter. Down two early, the Fever, with Coleman hitting two 3-pointers, went on a 16-4 run to take an 18-4 lead on January's basket.\nFowles had 10 points and four rebounds in the first quarter. That included two buckets in the post as the Lynx finished the quarter on a 12-6 run to pull within four entering the second quarter.\nThe Lynx grabbed a lead late in the half, but a four-point play by backup guard Maggie Lucas put the Fever up 31-39 at the half.\nThe first half of the third quarter was all Catchings, who had nine points before picking up her fifth foul with 4:13 left. The Fever built a 52-43 lead on Shavonte Zellous' basket.\nBut the Lynx responded with a 13-2 run -- with Fowles scoring five, Moore four -- to go up 56-54 after Moore stole the ball and fed Augustus on the break with 3:51 left in the quarter.\nMoments later, up a point, Augustus made one of two free throws. Moore got the rebound of the miss and fed Fowles for a 61-57 lead.\nWith 1:16 left in the quarter, January made two free throws. But Anna Cruz scored the final basket of the half on a drive, giving the Lynx -- who finished the quarter on a 20-7 run -- a 63-59 lead entering the fourth.\n(c)2015 Star Tribune (Minneapolis)\nVisit the Star Tribune (Minneapolis) at www.startribune.com\nDistributed by Tribune Content Agency, LLC.\nShare Comment", "external_links": ["http://twitter.com/share?url=http://www.arcamax.com/sports/basketball/s-1733643&hashtags=ArcaMax", "http://www.facebook.com/sharer.php?u=http://www.arcamax.com/sports/basketball/s-1733643&h=Lynx+defeat+Fever%2C+even+WNBA+Finals+at+one+game+apiece", "https://plus.google.com/share?url=http://www.arcamax.com/sports/basketball/s-1733643"], "published": "2015-10-06T03:00:00.000+03:00", "crawled": "2015-10-08T01:12:55.076+03:00", "highlightTitle": ""}