{"organizations": [], "uuid": "f47427f94434a60804b8b85bf100317fddef8c32", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-5606117f/turbine/ct-spt-0926-prep-fb-marian-central-joliet-catholic-20150925", "site_section": "http://www.chicagotribune.com/sports/highschool", "section_title": "Illinois High School Sports News - Preps Plus - Chicago Tribune", "url": "http://www.chicagotribune.com/sports/sports/highschool/ct-spt-0926-prep-fb-marian-central-joliet-catholic-20150925-story.html", "country": "US", "title": "Prep No. 6 Joliet Catholic runs over No. 14 Marian Central", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Prep football: No. 6 Joliet Catholic runs over No. 14 Marian Central - Chicago Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-09-26T06:30:00.000+03:00", "replies_count": 0, "uuid": "f47427f94434a60804b8b85bf100317fddef8c32"}, "author": "Bob Narang", "url": "http://www.chicagotribune.com/sports/sports/highschool/ct-spt-0926-prep-fb-marian-central-joliet-catholic-20150925-story.html", "ord_in_thread": 0, "title": "Prep No. 6 Joliet Catholic runs over No. 14 Marian Central", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Simplicity worked well for the Joliet Catholic offense Friday night.\nMichael Johnson handled the majority of the rushing load, carrying the ball 32 times for 216 yards and three touchdowns to fuel No. 6 Joliet Catholic's 41-3 rout of No. 14 Marian Central at Memorial Stadium in Joliet.\nIn a mid-season clash between East Suburban Catholic Conference leaders, the Hilltoppers (5-0, 3-0) reeled off 41 straight points after falling behind 3-0 in the second quarter. Johnson's running and receiving accounted for the bulk of the scoring. He scored on runs of 9, 11 and 3 yards and added a 32-yard touchdown catch.\nIn five games, Johnson has 102 carries for 1,042 yards with 15 total touchdowns.\n\"I worked all summer and (last) winter for this moment,\" Johnson said. \"I didn't play basketball. Football is my dream. We trained for this, working hard to be strong in the fourth quarter.\"\nJohnson has been forced to shoulder the bulk of the running duties after an injury sidelined Harry Davis. Johnson showed no signs of fatigue, particularly on two key fourth-down conversions during a late second-quarter drive that ended with his 9-yard touchdown run.\nThe Hurricanes (4-1, 2-1) didn't capitalize on two early Joliet Catholic turnovers, nor were they able to establish their running game. A week after Emitt Peisert rushed for 306 yards and four touchdowns in an upset of Nazareth, Marian Central had trouble moving the ball against Joliet Catholic's physical defense.\nPrep football: Riley Lees shines as No. 9 Libertyville downs No. 8 Stevenson Mike Helfgot Riley Lees has overshadowed everyone and everything else associated with Libertyville football the past two seasons.\nThe rest of the Wildcats will take it.\nAs far as defending Class 8A champion Stevenson is concerned, he's someone else's problem now.\nThe senior quarterback exceeded his own nearly...\nRiley Lees has overshadowed everyone and everything else associated with Libertyville football the past two seasons.\nThe rest of the Wildcats will take it.\nAs far as defending Class 8A champion Stevenson is concerned, he's someone else's problem now.\nThe senior quarterback exceeded his own nearly...\n(Mike Helfgot) Peisert carried 13 times for 48 yards. The Hurricanes netted 64 rushing yards and 38 passing until the benches were emptied midway through the fourth quarter. Joliet Catholic safety Bill Rotnicki returned and interception 36 yards for a touchdown.\n\"We didn't let their running game work at all and forced them to make plays in the passing game, and that led to big plays for us,\" Rotnicki said.\nBob Narang is a freelance reporter for the Chicago Tribune.\nPlayer of the game: Player of the game: Michael Johnson, Joliet Catholic, 32 carries, 216 yards, 3 TDs; 32-yard TD reception.\nKey performers: Marian Central — Kolton Rominski, INT; Emitt Peisert, 13 carries, 48 yards. Joliet Catholic — Bill Rotnicki, 36-yard INT return TD.\n Sports High School Sports", "external_links": ["http://www.tribpub.com/privacy-policy-and-your-privacy-rights/", "http://www.trbimg.com/img-56061512/turbine/ct-spt-0926-prep-fb-libertyville-stevenson-20150925", "http://www.trbimg.com/img-5606117f/turbine/ct-spt-0926-prep-fb-marian-central-joliet-catholic-20150925"], "published": "2015-09-26T06:30:00.000+03:00", "crawled": "2015-10-01T08:58:15.325+03:00", "highlightTitle": ""}