{"organizations": [], "uuid": "e9c0669459b017c5bb61c5403789c15d2781d0bf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.phoenixnewtimes.com", "main_image": "http://images1.phoenixnewtimes.com/imager/u/original/7755982/baxters.jpg", "site_section": "http://www.phoenixnewtimes.com/news", "section_title": "Phoenix, Arizona News: Politics, Crime, Sports, Marijuana and Education Journalism | Phoenix New Times", "url": "http://www.phoenixnewtimes.com/news/family-of-five-drowns-after-vehicle-crashes-into-tempe-town-lake-7755980", "country": "US", "title": "Family of Five Drowns in Tempe Town Lake", "performance_score": 0, "site": "phoenixnewtimes.com", "participants_count": 6, "title_full": "Family of Five Drowns in Tempe Town Lake | Phoenix New Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T13:58:00.000+03:00", "replies_count": 6, "uuid": "e9c0669459b017c5bb61c5403789c15d2781d0bf"}, "author": "Miriam Wasser", "url": "http://www.phoenixnewtimes.com/news/family-of-five-drowns-after-vehicle-crashes-into-tempe-town-lake-7755980", "ord_in_thread": 0, "title": "Family of Five Drowns in Tempe Town Lake", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Courtesy of Baxter family relatives **Update 10/19/15 5:10 pm: The Tempe Police Department is now investigating the incident as a murder-suicide.\nA mother, father, and their three young children are dead after their vehicle crashed into Tempe Town Lake near the Scottsdale Bridge.\nAccording to Tempe Police, four witnesses say they saw a silver SUV drive into the lake just after midnight on Sunday morning, though it remains unclear why the crash occurred.\nThe Tempe police and fire departments arrived on the scene at 12:15 a.m., and according to police Lieutenant Michael Pooley, three officers immediately jumped into the dark water in an attempt to save the passengers.\nRelated Stories Tempe Town Lake Car Crash Was a Murder-Suicide, Police Say Officers were able to find and pull out two toddlers, the adult male driver, and the adult female passenger, all of whom were unconscious. Unable to revive them with what Pooley calls “lifesaving measures,” the four were transported to the hospital, where they were later pronounced dead.\nInitial reports said four people had died after the early-morning crash, but after authorities identified the female adult as 25-year-old Danica Baxter of Phoenix, they realized her third child was missing.\nThe Baxter children. Facebook Tempe authorities returned to the lake at 10 a.m., and according to Pooley, found the missing 3-year-old in the back seat of the still-submerged car — the other two children had been in the middle row of the vehicle. All three were securely buckled in, police say.\nScreenshot/Twitter The names of the deceased were released late Sunday evening, and at least two Go-Fund-Me accounts have been set up to cover funeral costs:\nFather: Glenn Edward Baxter, 27;\nMother: Danica Baxter, 25;\nSon: Reighn Baxter, 3;\nSon: Nazyiah Baxter, 2;\nDaughter: Zariyah Baxter, 1.\nThree Baxter Children Facebook While the description on one of the accounts says Danica was trying to leave Glenn and that he crashed the family’s vehicle into the lake as a “murder-suicide,” New Times could not verify this information. According to police, the entire situation remains under investigation.\nContact: Miriam Wasser Phoenix New Times Get the This Week's Top Stories Newsletter Every week we collect the latest news, music and arts stories — along with film and food reviews and the best things to do this week — so that you’ll never miss Phoenix New Times' biggest stories.", "external_links": ["https://www.facebook.com/phoenixnewtimes", "https://www.gofundme.com/gf6nw8gw", "https://www.gofundme.com/um6nfdu5", "http://www.twitter.com/phoenixnewtimes"], "published": "2015-10-19T13:58:00.000+03:00", "crawled": "2015-10-20T15:02:37.219+03:00", "highlightTitle": ""}