{"organizations": [], "uuid": "e08b16d52e0489b7b7e067627e5f9b60aed91660", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tucsonnewsnow.com", "main_image": "http://kold.images.worldnow.com/images/9019668_G.jpg", "site_section": "http://www.tucsonnewsnow.com/Global/category.asp?C=242964&clienttype=rss", "section_title": "Tucson News Now - UA Sports", "url": "http://www.TucsonNewsNow.com/story/30264485/gimino-arizonas-pork-chop-finds-juicy-role-as-fullback", "country": "US", "title": "Gimino: Arizona's 'Pork Chop' finds juicy role as fullback", "performance_score": 0, "site": "tucsonnewsnow.com", "participants_count": 1, "title_full": "Gimino: Arizona's 'Pork Chop' finds juicy role as fullback", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T05:15:00.000+03:00", "replies_count": 0, "uuid": "e08b16d52e0489b7b7e067627e5f9b60aed91660"}, "author": "Anthony Gimino", "url": "http://www.TucsonNewsNow.com/story/30264485/gimino-arizonas-pork-chop-finds-juicy-role-as-fullback", "ord_in_thread": 0, "title": "Gimino: Arizona's 'Pork Chop' finds juicy role as fullback", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Gimino: Arizona's 'Pork Chop' finds juicy role as fullback - Tucson News Now Member Center: Gimino: Arizona's 'Pork Chop' finds juicy role as fullback Posted: Jamardre Cobb and the Wildcats celebrate after a 44-7 win over Oregon State. (Photo by Stan Liu/Arizona Athletics) Jamardre Cobb TUCSON, AZ (Tucson News Now) - \nArizona Wildcats co-offensive coordinator Calvin Magee knows them as plays 72, 73 and 74 on the game film. \nThat's when fullback Jamardre Cobb pancaked, steamrolled, flattened, de-cleated -- pick your favorite verb here -- Oregon State defenders on back-to-back-to-back plays early in the fourth quarter of Saturday's 44-7 victory. \n\"There were just normal run plays, but he did exactly a textbook block. Just physical plays. It was special,\" said Magee, who coaches running backs. \"It was good to see, too. He put people on their backs.\" \nThose hits were three of the top four highlights that the coaching staff showed to the team Sunday. Coaches picked Cobb as the team's Hard Edge Player of the Week. \nDidn't see this coming, did you? \nIf coaches hadn't moved Cobb from linebacker to fullback late in fall camp, we'd still be wondering what the heck happened to him. Even with all the injuries at linebacker, the redshirt freshman wasn't sniffing playing time until the staff suggested that a move to offense would be a quick path to playing time. \n\"A bruiser,\" Magee said, asked what he thought he had in Cobb. \n\"We talk all the time about the best place for people. Sometimes, if a guy ain't doing it on one side of the ball, we look around and see if he can help in another area, and that's what happened. \n\"It's nice to see him have success, because he's been working so hard on it. I was fired up because you always want to see the physical play. It's exciting everybody on offense to see that.\" \nCobb is listed at 6-foot, 239 pounds, although coaches talk about him being more in the 250-pound range. He picked up the unfortunate nickname \"Pork Chop\" last fall when he was neither healthy nor in shape. \nFans had high hopes for him and his Los Angeles Salesian High teammate Marquis Ware -- both four-star linebackers -- when they signed in 2014. Ware, who also dealt with initial injury issues upon arrival, is still trying to work his way up the depth chart at linebacker. \nIn the meantime -- and maybe for a good, long while -- Cobb has found a cool niche as a short-yardage fullback, a bulldozer. \n\"In our league, you don't find many traditional fullbacks who can go and hit a guy,\" Arizona coach Rich Rodriguez said, \"and we have one of those in Jamardre Cobb.\" \nMagee brought Cobb to the offense and taught him how to block on a power play. Then he taught him the play-action fake off that play, with Cobb running into the flat. That's how he scored on a 1-yard pass from Anu Solomon at Nevada in the second game of the season. \n\"Catching that pass was fun, but it felt natural to me,\" Cobb said. \"Being on offense, I feel comfortable.\" \nArizona doesn't have anyone else like Cobb, which makes him all the more valuable. The Wildcats had a need to get more physical, so he's the ticket, especially in the red zone, where spread offenses are known to fizzle. \nThe Cats have even shown a diamond formation in the backfield, with two running backs flanking Solomon, and another behind him. Power. \n\"When he brings that full load -- 250-some pounds with good pad level -- it can lead to some pretty good collisions,\" Rodriguez said. \nRodriguez said Cobb is now up to speed with about six plays on offense. \n\"Each week, we've been able to do more and more with him,\" the coach said. \nCobb said his initial reaction to the position switch was a mix of excitement and skepticism about his role. \n\"A lot of guys on Twitter were saying, 'Oh, they don't use a fullback,'\" Cobb said. \"But I didn't feed into that stuff. Whatever Coach told me, I said, 'OK.' I wasn't really worried.\" \nBut the RichRod spread offense is flexible. It can corporate a fullback just fine, as needed. At West Virginia, Rodriguez and Magee put 260-pound-plus Owen Schmitt to good use in the same backfield as quarterback Pat White and speedy tailback Steve Slaton. Schmitt was known as the \"Runaway Beer Truck.\" \nCobb is just getting started. He's a long way from being as advanced and productive as Schmitt. Cobb hasn't even carried the ball yet. \n\"He's very skillful. He can run if we needed him to,\" Magee said. \"I just told him, he has to wait and earn that.\" \nFor now, Cobb is enjoying hitting somebody -- anybody. That it is on offense rather than defense doesn't matter. \n\"They're both equal to me,\" he said of the thrill of contact, \"because I am making somebody fall either way.\" \nThere's always a chance Cobb moves back to defense after this season, but don't bet on it. Magee, for sure, is excited enough about the potential here to make Cobb a full-time offensive player. \n\"Oh, yeah,\" Magee said. \"I hope so. I believe so.\" \n* * * \nAnthony Gimino has covered University of Arizona athletics for more than two decades, including as the football beat writer for the Arizona Daily Star and the columnist for the Tucson Citizen.", "external_links": [], "published": "2015-10-15T05:15:00.000+03:00", "crawled": "2015-10-15T06:47:29.289+03:00", "highlightTitle": ""}