{"organizations": [], "uuid": "836aa9bd2f4da1d03aa7143b41cf2ebd8f57357f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/ncaafb", "section_title": "NCAA FB News, Scores, Schedule, Standings, Stats, Photos, Videos - Football - MSN Sports", "url": "http://www.msn.com/en-us/sports/ncaafb/baylor-offense-destined-to-break-13-game-ncaa-scoring-record/ar-BBmiGXW", "country": "US", "title": "Baylor offense destined to break 13-game NCAA scoring record", "performance_score": 0, "site": "msn.com", "participants_count": 2, "title_full": "Baylor offense destined to break 13-game NCAA scoring record", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 1, "uuid": "836aa9bd2f4da1d03aa7143b41cf2ebd8f57357f"}, "author": "David Kenyon", "url": "http://www.msn.com/en-us/sports/ncaafb/baylor-offense-destined-to-break-13-game-ncaa-scoring-record/ar-BBmiGXW", "ord_in_thread": 0, "title": "Baylor offense destined to break 13-game NCAA scoring record", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Baylor offense destined to break 13-game NCAA scoring record Sportsnaut 19 hrs ago David Kenyon © Jerome Miron-USA TODAY Sports Baylor Bears quarterback Seth Russell has his team averaging nearly 64 points per game. The Baylor offense is the most dangerous unit in the nation, and the Bears should continue on their record-breaking pace for the rest of the season.\nAdChoices Quarterback Seth Russell has guided Baylor to an absurd 63.8 points per game, which while immensely impressive admittedly isn’t a sustainable average.\nBaylor is now averaging 63.8 ppg. TCU is the only other offense in the FBS averaging more than 50.\n— Jake Trotter (@Jake_Trotter) October 19, 2015 However, the team’s 383 points has the offense destined to set an NCAA record for most points in a 13-game season.\nThe 2005 Texas national championship-winning squad that featured Vince Young and Jamaal Charles currently holds the mark with 652 points—or 50.2 per outing.\nThat leaves Baylor 269 points short of the record, needing an average of 38.4 during their seven remaining contests. Since Art Briles’ teams have managed fewer than 38 points just five times in the last 36 games and this is the coach’s most explosive offense yet, failing to reach 38.4 would be a monstrous collapse.\nBaylor is far from a one-trick pony, too. Russell has thrown for an FBS-leading 27 touchdowns and added 338 yards on the ground, Shock Linwood has amassed 803 rushing yards and eight scores while Corey Coleman has racked up an FBS-leading and school-record 16 receiving touchdowns.\nAdditionally, four opponents remaining on the schedule—Iowa State, Kansas State, TCU and Texas—have surrendered more than 29 points per game. Considering the tempo at which Baylor runs its highly efficient offense, it’d take an amazingly strong effort to hold the Bears under 40.\nBuckle up and enjoy the ride, football fans, because Baylor is going to continue smashing scoreboards and records in 2015.\nGo to MSN Home", "external_links": ["http://www.yardbarker.com/", "https://twitter.com/Jake_Trotter/status/655922149165666304", "http://go.microsoft.com/fwlink/?LinkID=286759"], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-22T20:36:42.354+03:00", "highlightTitle": ""}