{"organizations": [], "uuid": "45c4b1cf021d72488b773a512be833af763a0d5c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/nhl", "section_title": "NHL News, Scores, Schedule, Standings, Stats, Photos, Videos - Ice Hockey - MSN Sports", "url": "http://www.msn.com/en-us/sports/nhl/nhls-list-of-best-dressed-its-short-and-swedes/ar-AAfqb8m", "country": "US", "title": "NHL's list of best dressed? It's short and Swedes", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "NHL's list of best dressed? It's short and Swedes", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "45c4b1cf021d72488b773a512be833af763a0d5c"}, "author": "Kevin Allen, USA TODAY Sports", "url": "http://www.msn.com/en-us/sports/nhl/nhls-list-of-best-dressed-its-short-and-swedes/ar-AAfqb8m", "ord_in_thread": 0, "title": "NHL's list of best dressed? It's short and Swedes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NHL's list of best dressed? It's short and Swedes USA Today Sports 21 hrs ago by Kevin Allen, USA TODAY Sports © Robin Marchant, Getty Images Robin Marchant, Getty Images The fact New York Rangers goalie Henrik Lundqvist doesn’t know how many suits he owns proves he’s in a different league than most of us when it comes to fashion.\nAdChoices “Too many,” Lundqvist says. “The good thing about living in both Sweden and New York is I have a place to put suits when I’m running out of space in New York.”\nWhatever the total, it’s the right number for a player who is generally regarded as the NHL’s best-dressed player, someone who has helped the league move off the sports pages and into fashion magazines and photo spreads.\n“He’s been elected not only Sweden’s, but the entire world’s best-dressed man on various occasions,” says Jonas Eriksson, digital editor of Nordic Style Magazine. “… His reputation in Sweden is that he is always well-dressed, wearing impeccable, cool outfits — most often exclusive suits.”\nLundqvist could be viewed as the symbol of how modern NHL players have dressed up their image, leading to more commercial and corporate opportunities for the league and its athletes.\nIt was clearly the European influence that has helped the NHL to step up its game off the ice.\n“So many nations are represented on the league’s ice but the ones that stand out, sartorially, are the Europeans, most notably the Scandinavians, like the Swedes,” says Nic Screws, style director of Bloomberg Media. “They have long been comfortable with developing a personal style and having confidence in showing that off. American — and maybe even Canadian — men are still playing catch up.”\nIf you took a poll, the Swedish players would probably be voted the NHL’s best dressed group.\n“I would like to think we are,” Colorado Avalanche Swedish player Gabriel Landeskog says, chuckling. “But I’m sure if you ask our North American friends, I’m sure they have a different opinion.”\nThe fashion recognition is not limited to the Swedes. Canadians Joffrey Lupul (Toronto Maple Leafs), Patrice Bergeron (Boston Bruins) and Tyler Seguin (Dallas Stars) are among others who have been asked to do fashion spreads.\nStill, none of them have been invited to be a special guest at Milan Fashion Week like Lundqvist has.\n“I don’t think a lot of guys can keep up with Lundqvist,” Landeskog says.\nOttawa Senators defenseman Erik Karlsson, considered the second-best dressed Swede, tries.\n“I think we have pretty fashionable styles because we are a small fashionable country,” Karlsson says.\n“We grow up and we are taught to look proper,” Vancouver Canucks center Henrik Sedin says.\nIt’s not as if the Swedes are over the top with how they dress. “Swedes like Lundqvist favor minimalism — the idea that less is more, or that quiet can still make a statement,” said Screws, who has worked with Carl Hagelin, a Swedish forward on the Anaheim Ducks.\n“They like dark colors and slim silhouettes. Think skinny ties and skinnier pants. They would never consider a 'regular' or 'classic' fit style of tailoring -- always modern, or Euro-cut.”\nLandeskog sums up his fashion sense this way: “I would rather be comfortable and look OK than be uncomfortable and look great.”\nThe Swedes do take some razzing from teammates over their Euro flair.\n“I remember the first year I came over I was wearing some super tight jeans and I got in trouble for that,” Arizona Coyotes defenseman Oliver Ekman-Larsson says.\nThe oddity of the Swedes’ fashion reputation in the NHL is they are not considered their country's best dressed athletes.\n“They may not be 'poorly' dressed but rather dull in comparison to other athletes,” Eriksson says. “It is mostly soccer players that are more fashion forward and seen on magazine covers and at red carpet events.”\nFormer NHL player Tom Laidlaw, who played with the New York Rangers and Los Angeles Kings in 1980s, said NHL players' style has come a long way. He says he only owned one suit and a couple of sports coats when he played. He recalls that former Rangers player Mark Pavelich owned a clip-on tie that he carried around to adhere to the team rule of wearing a tie on the road.\n“Obviously players have more money now,” Laidlaw says. “We used to fly commercial, and if a guy fell asleep we would put shaving cream on him or cut his tie in half. Obviously today you wouldn’t do that because the suit might be $5,000 and the tie might be $500.”\nStill, Laidlaw recalls that Swedish player Anders Hedberg was the best-dressed player on the Rangers. “You could tell it was important to him.” Laidlaw said.\nFashion was not as important to the other players.\n“We would joke around,” Laidlaw says, “about how we picked our suit jackets based on how big their pockets were so we could carry more beers out after the game.”\nGo to MSN Home", "external_links": ["http://www.usatoday.com/sports/", "http://go.microsoft.com/fwlink/?LinkID=286759"], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-14T23:54:53.100+03:00", "highlightTitle": ""}