{"organizations": [], "uuid": "1c7cb567a4f779a5479f186e025debf948fe4999", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "westhawaiitoday.com", "main_image": "http://westhawaiitoday.com/sites/westhawaiitoday.com/files/field/image/2303812_web1_tricost_draft.jpg", "site_section": "http://westhawaiitoday.com/taxonomy/term/15/feed", "section_title": "Local Sports", "url": "http://westhawaiitoday.com/sports/local-sports/running-rani-cost-being-ironman-triathlete", "country": "US", "title": "Running with Rani: The cost of being an IRONMAN triathlete", "performance_score": 0, "site": "westhawaiitoday.com", "participants_count": 1, "title_full": "Running with Rani: The cost of being an IRONMAN triathlete", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T20:39:00.000+03:00", "replies_count": 0, "uuid": "1c7cb567a4f779a5479f186e025debf948fe4999"}, "author": "nefeeder", "url": "http://westhawaiitoday.com/sports/local-sports/running-rani-cost-being-ironman-triathlete", "ord_in_thread": 0, "title": "Running with Rani: The cost of being an IRONMAN triathlete", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Running with Rani: The cost of being an IRONMAN triathlete Published October 9, 2015 - 7:39am Updated: October 9, 2015 - 7:39am Rani Henderson Special to West Hawaii Today \nIt’s finally happened. After years of contemplating, fantasizing and close friends egging you on, a challenge awaits offering you an opportunity to combine the sports of swimming, cycling, and running. \nYou decide, “why not go for it and do a triathlon?” \nAnd not just any triathlon, you’re aiming for the “Big Kahuna” - the grand daddy of all triathlons - the IRONMAN World Championship right here in Kailua-Kona. \nBut what does it really take? Besides requiring a lot of grit, determination, courage, passion, and sacrificing quality time with family and friends just to get to the start line, the obvious, but sometimes overlooked challenge of pursuing such a dream comes down to simple financial. \nAs a two-time Kona IRONMAN finisher myself (2009, 2010), I thought it would be interesting to take a closer look at what the average triathlete may spend just to enter the sport of IRONMAN distance racing. \nAnd let’s be clear. We all know there lies a significant variation when it comes to pricing equipment by brand, material, personal taste, what one is willing to spend - new or used - and whether an athlete has some or all of their equipment sponsored. Also important to note is the travel arrangements required just to get to the start line which can be a huge expense in itself. \nSo for the purpose of this analysis, sponsorships, professional triathletes, travel expenses, and entry fees are left out of the equation. Costs for the necessary equipment are broken down into “price ranges” to provide a general idea of what the average age grouper may initially spend to enter the sport of IRONMAN distance racing. And it should be mentioned; the investment extends well beyond just competing in Kona as a new lifestyle emerges offering years, and possibly decades of enjoyment. \nBike \nNo one will argue that when it comes to triathlon, the 112-mile ride along the famous Queen Kaahumanu Highway to Hawi and back to K-Town requires much more than just a bike, but because it’s the most costly piece of equipment for triathletes, I will begin there. \nChoosing among aluminum, steel, carbon, and titanium varies significantly in price in terms of what type of bike frame one plans to use. While aluminum is a more economical choice, a higher priced carbon or titanium frame will certainly allow for a smoother, and often times, faster ride over the 112-mile course. \nThen there’s “buying speed.” Athletes don’t just want to cover the distance - they want to do it with equipment that will help them go faster. Aerodynamic equipment and lighter components for the bike have become the norm and at the top of everyone’s wish list in recent years. \n“People are more focused on buying speed and usually go for, or want, what they see in triathlon magazines,” said Oliver Kiel, owner of Cycle Station and coach of Triathlon School Hawaii. “In the ten years of owning a bike shop along with all of my years of racing triathlons, one thing that stands out is people want to look good while going faster. It’s a world platform and everyone is watching. So aerodynamic equipment and the fancy gadgets they see in magazines typically becomes the item of demand when they walk into my bike shop.” \nFrom helmets to race wheels, power meters and bike computers, to aero bars and electronic shifting, Kiel added that equipment for cycling has come a long way since the early 80’s. \n“The first year I did a triathlon I had a steel road bike with down tube shifters,” Kiel recalled. “It was not aerodynamic by any means, the frame was a bit heavy, and back then we weren’t even required to wear a helmet. But in those early years, we didn’t have the option to buy speed. We had to train our bodies to perform better with less.” \nKiel’s Bike Estimate Costs: Triathlon Bike with Mechanical Shifters, $2,500-$5,500; Triathlon Bike with Electronic Shifters, $3,500-$8,500; Race Wheels (Carbon), $2,500-$3,500; Power Meter, $500-$3,500; Bike Computer + Heart Rate Monitor, $40-$500; Aero Helmet, $180-$500; Bike Shoes, $120-$400; Bike Pedals, $100-$600; Apparel, $300-$450 (Tri top, bike shorts, sunglasses, socks, gloves); Accessories, $100-$300 (Water bottles, bottle cages, bento box, extra tubes, mini pump); Bike Portion Total (Mechanical Shifters) $6,340-$15,250, (Electronic Shifters) $7,340-$18,250. \nSwim : \nFor many, watching the mass start of nearly 2,000 athletes tear through the pristine waters of Kailua Bay, with iridescent hues of pink and orange cradling the sky behind Hualalai’s sunrise, is possibly the most awe-inspiring spectacle they could ever see in this sport. \nIt’s the 2.4-mile swim - the perennial start to a dream that thousands of IRONMAN hopefuls fantasize about and the first leg of Kona’s IRONMAN World Championship race. Yet over the years, spectators have come to notice that every participant is donning an all black swim suit, making it virtually impossible to pick out a family member, friend, or pro. \nRelatively new to the triathlon world, the speed skin or swim skin, is a thinner, non-buoyant replacement for a wetsuit that is typically worn over an athlete’s triathlon kit (race day outfits). Designed to be very snug and worn only during the swim leg, it enhances speed through water by compressing one’s body and creating minimal friction with passing water. \nVern Sekafetz, general manager of Bike Works Kona for the last 10 years and an experienced triathlete, says that when it comes to speed skins, athletes are most concerned with having gear that properly fits more than fidgeting over price. \n“Fit is the biggest issue and the main concern that athletes have,” Sekafetz said. “It’s not often that they scoff at a higher price. Athletes want gear that will fit them properly and why it’s the biggest variable when it comes to price. That’s why we carry a variety of brands that helps to address the unique fit of each athlete.” \nSekafetz added that personal preference plays a huge role when it comes to selecting swim gear and also what one wears for the remainder of the race. The speed skin provides a solution to maintaining speed and hydrodynamics in water while wearing a bulkier race outfit underneath. \n“I see more of the male elite athletes wearing their race day triathlon kit rolled down to their waist or abdomen, with their speed skin on top of that,” he said. “More and more athletes are selecting tri kits with sleeves (to be worn on the bike and run), but sleeves are not allowed during the swim segment of IRONMAN. And whether one chooses goggles with tinted lens or not is an individual preference. Again, fit is most important.” \nSekafetz’s Swim Estimate Costs: Speed Skin, Swim Skins, $200-$400; Goggles, $12-$80; Swim Cap, Free; Other apparel, $40-$80 (Swim trunks/bathing suit, sports bra top); Total, $252-$560. \nRun \nWitnessing the masses running a 26.2-mile marathon in a sauna-infused, soul-drenching stretch of hot pavement along Alii Drive, up Kona’s version of heartbreak hill on Palani Road, onto Queen Kaahumanu Hwy, before turning into the Natural Energy Lab, is a sight worth a thousand words. \nIt is the last leg of the grueling 140.6-mile distance, and all that stands in the way of earning the distinction of becoming a “finisher” at Kona’s IRONMAN World Championships. Yet, one is going to need proper equipment to get to the finish line. \n“There are specific triathlon shoes which are typically lighter, more porous, designed with a mid-foot to forefoot configuration to lessen the impact on the heel,” Sekafetz said. “Doing a marathon in an IRONMAN changes one’s stride dramatically versus just running a straight out marathon due to the fatigue of doing a swim and bike beforehand.” \nSekafetz added that improvements in gear to decrease transition time from bike to run as well as clothing to protect the athlete from Kona’s searing heat and unbearable sun, are typically at the top of an athlete’s wish list for the run. \n“Triathlon shoes are now designed toward an athlete’s comfort to go sockless in an effort to decrease transition time from bike to run,” he said. “Cool wings has been the number one selling item as it’s a breathable and lightweight fabric used to cover an athletes arms and shoulders to protect them from the heat.” \nSekafetz’s Run Estimate Costs: Running Shoes, $100-$180; GPS Watch/Heart Monitor,$250-$500; Apparel, $60-$80 (Hat/visor, socks, arm coolers/cool wings); Total, $410-$760. \nOther Necessities \nTo get through one’s demanding training program, athletes may wish to spend some extra cash to help them get to the finish line in one piece. From massages ($100-$400/month) to coaching ($150, $400/month), gym memberships ($75-$150/month) and swim fees ($45-$60/month), it truly comes down to the individual on whether or not they utilize the extra help. Search Site", "external_links": [], "published": "2015-10-09T20:39:00.000+03:00", "crawled": "2015-10-10T12:40:34.236+03:00", "highlightTitle": ""}