{"organizations": [], "uuid": "8df53f214e442320f3ae633f2489e968b073303a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "lancasteronline.com", "main_image": "http://bloximages.newyork1.vip.townnews.com/lancasteronline.com/content/tncms/assets/v3/editorial/1/a9/1a95d648-6fa3-11e5-9a67-3bb98a7d9bda/5619993a1d5dc.image.jpg?resize=620%2C453", "site_section": "http://lancasteronline.com/search/?q=&t=article&l=25&d=&d1=&d2=&s=start_time&sd=desc&c[]=sports/bigten*&f=rss", "section_title": "lancasteronline.com - RSS Results in sports/bigten* of type article", "url": "http://lancasteronline.com/sports/big-night-in-columbus-for-penn-state-bigger-one-for/article_62649b84-739b-11e5-bac5-173d207210d8.html", "country": "US", "title": "Big night in Columbus for Penn State. Bigger one for Hackenberg", "performance_score": 0, "site": "lancasteronline.com", "participants_count": 1, "title_full": "Big night in Columbus for Penn State. Bigger one for Hackenberg", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:18:00.000+03:00", "replies_count": 0, "uuid": "8df53f214e442320f3ae633f2489e968b073303a"}, "author": "MIKE GROSS | Sports Writer", "url": "http://lancasteronline.com/sports/big-night-in-columbus-for-penn-state-bigger-one-for/article_62649b84-739b-11e5-bac5-173d207210d8.html", "ord_in_thread": 0, "title": "Big night in Columbus for Penn State. Bigger one for Hackenberg", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Penn State quarterback Christian Hackenberg throws a pass downfield in the second quarter against Indiana. Big night in Columbus for Penn State. Bigger one for Hackenberg \nPenn State quarterback Christian Hackenberg throws a pass downfield in the second quarter against Indiana. \nChristian Hackenberg is about to become Penn State’s career leader in passing yardage. \nThat shows you what stats are worth. \nHe sure looks like a quarterback. \nSo did JaMarcus Russell. And Ryan Leaf. And Burt Reynolds. \nHack stayed in Happy Valley when he could have gone elsewhere, when times were as tough as they’ve ever been, and even after the coach who drew him there left. \nAnd he can’t wait to get out of town to the NFL. \nHe has an NFL-ready arm in the Elway/Luck class. \nIf a QB’s biggest positive is arm strength, and not accuracy or decision-making or leadership or pocket presence, welcome to Jeff George country. \nHe’s the next Troy Aikman, worth a top five pick to any NFL team that needs a QB, according to ESPN’s Trent Dilfer. \nHe’s barely draftable, according to Pro Football Focus. \nHe’s as bad a fit with James Franklin’s offense as he was an ideal fit with Bill O’Brien’s. A swiss-cheese offensive line has endangered his health at least as much as his professional future. \nHackenberg ranks among the least accurate QBs in the country by most advanced metrics, even when he isn’t pressured. Plenty of successful NFL QBs - including Troy Aikman, for much of his college career - played in college systems that weren’t particularly suited to them. Not many led offenses that finished 111th in the country, as Penn State did in 2014, or 103, as it currently stands. \nHe seems utterly respected, as a leader and competitor, by his teammates. \nUnless they’re yelling at him on the sidelines or expressing disgust with him on the field, as has happened more than once. \nYou get the idea. \nHard to believe, but we’re much closer to the end of the Hackenberg Era than the beginning. \nYou keep thinking that a breakout is coming, except that there’s already been one, or what certainly looked like one. In the 2013 season finale at Wisconsin and the ‘14 opener in Ireland, actually back-to-back games, he completed 53 of 77 throws for 903 yards and five touchdowns. \nPost-Ireland, he was seen as a Heisman candidate. For about two weeks. \nThere’s been only sporadic brilliance since. For every beautifully-thrown deep ball that a wideout failed to make a play on, there’s been at least one screen pass thrown at a receiver’s feet, or bubble screen sailed into the crowd. \nHackenberg is a weirdly polarizing figure, especially for someone who never says a polarizing thing. He has never publicly badmouthed a coach or teammate, never gotten in trouble, never failed to be cooperative and polite (and utterly predictable) with the media. \nHe has kept his head down and done the work. But no matter what you think of him, there has been no statement, no big moment on a big stage. \nAnd now his chance to alter the script is here, Saturday night in Columbus, against the nation’s number one team, on prime-time TV. As big an opportunity as this is for Penn State the team and the program, it’s a bigger one for the quarterback. \nIn a press conference Wednesday, he acknowledged some technical things. He has to get through progressions quicker, get the ball out quicker, check down and take what the defense gives, etc. \nBut he barely copped to the stakes. \n“It’s pretty cool,’’ he said. “An awesome opportunity. It’s exciting for the competitor in all of us, but …’’ \nThere was an “at the end of the day,’’ coming. That was one of Bill O’Brien’s go-to-phrases, too. \n“At the end of the day, you prepare like it’s any other game.’’ \nBut you don’t play that way. Tags", "external_links": [], "published": "2015-10-16T03:18:00.000+03:00", "crawled": "2015-10-17T02:27:48.469+03:00", "highlightTitle": ""}