{"organizations": ["Lions", "FAQs Lions", "Facebook Lions"], "uuid": "bb20e2ef94be35b38f1a5c4e403a800d7455c913", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wzzm13.com", "main_image": "http://wzzm-download.edgesuite.net/video/73415942/73415942_Still.jpg", "site_section": "http://rssfeeds.wzzm13.com/_/20/109769594/wzzm13-sports", "section_title": "WZZM - Sports", "url": "http://www.wzzm13.com/story/sports/nfl/lions/2015/10/05/detroit-lions-seattle-seahawks/73426660/", "country": "US", "title": "Lions still looking for first win of season", "performance_score": 0, "site": "wzzm13.com", "participants_count": 0, "title_full": "Lions still looking for first win of season", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T01:49:00.000+03:00", "replies_count": 0, "uuid": "bb20e2ef94be35b38f1a5c4e403a800d7455c913"}, "author": "", "url": "http://www.wzzm13.com/story/sports/nfl/lions/2015/10/05/detroit-lions-seattle-seahawks/73426660/", "ord_in_thread": 0, "title": "Lions still looking for first win of season", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "13 On Your Sidelines: Vote for the Week 6 Mercy Health MVP 13 On Your Sidelines: Vote for the Week 6 Mercy Health MVP Post to Facebook 13 On Your Sidelines: Vote for the Week 6 Mercy Health MVP 13 On Your Sidelines: Vote for the Week 6 Mercy Health MVP Check out this story on WZZM13.com: http://www.wzzm13.com/story/sports/high-school/football/2015/10/05/13-on-your-sidelines-vote-for-the-week-6-mercy-health-mvp/73367746/ Cancel Send A link has been sent to your friend's email address. Posted! A link has been posted to your Facebook feed. Join the Conversation To find out more about Facebook commenting please read the Conversation Guidelines and FAQs 13 On Your Sidelines: Vote for the Week 6 Mercy Health MVP Vote now for the 13 OYSL Week 6 MVP Eric D Lloyd, 7:58 p.m. EDT October 5, 2015 Football 32 CONNECT 4 TWEET LINKEDIN COMMENT EMAIL MORE \n(WZZM) -- We have several teams locked into the playoffs already and a few dozen just knocking on the door over the next few weeks, but we are here to pick the best individual performances in West Michigan. \nOur Week 6 Mercy Health On Your Sidelines MVP nominees are: \nTyler Lamica - R unning Back/Linebacker, Grand Rapids Christian The Eagles fought back from a 26-0 hole against East Grand Rapids in big part because of Lamica. The short yardage back punched in three touchdowns at the goal line, but added twenty tackles on defense from the linebacker spot. Christian won 39-33 in overtime. \nMax Dean - Running Back, Lowell The Arrows ran away from Caledonia 42-7 and Dean did most of the running. He put up 206 yards and two touchdowns on an offense that has yet to score less than 35 points in a game this year. \nJosh Saltzgaber - Running Back, Byron Center The Saltzgaber boys pushed the Bulldogs past Holland Christian 33-28 but it was Josh that put up the big numbers. 161 yards on the ground, three rushing touchdowns and 12 tackles on defense. \nTwo OK White rivals and a superstar from the green, who will be this week's MVP? That's up to you. \nVoting is underway until 10 a.m. Thursday, Oct. 8. The winner will be announced Friday night on 13 On Your Sidelines. \nIf the poll doesn't immediately display below, refresh the page or visit this link . 13 ON YOUR SIDELINES WEEK 6 HIGHLIGHTS Hudsonville rallies past East Kentwood | 02:56 Hudsonville rallies past East Kentwood WZZM 1 of 15 13 ON YOUR SIDELINES WEEK 6 HIGHLIGHTS G.R. Christian beats East Grand Rapids | 01:52 G.R. Christian beats East Grand Rapids WZZM 2 of 15 13 ON YOUR SIDELINES WEEK 6 HIGHLIGHTS Oakridge defeats Whitehall | 01:20 Oakridge defeats Whitehall WZZM 13 ON YOUR SIDELINES WEEK 6 HIGHLIGHTS Mona Shores rolls over Reeths-Puffer | 01:23 Mona Shores rolls over Reeths-Puffer WZZM 4 of 15 13 ON YOUR SIDELINES WEEK 6 HIGHLIGHTS Lowell steamrolls Caledonia | 02:04 Lowell steamrolls Caledonia WZZM 13 ON YOUR SIDELINES WEEK 6 HIGHLIGHTS Jenison falls to Forest Hills Central | 01:14 Jenison falls to Forest Hills Central WZZM 6 of 15 13 ON YOUR SIDELINES WEEK 6 HIGHLIGHTS Byron Center hangs on to beat Holland Christian | 01:15 Byron Center hangs on to beat Holland Christian WZZM 7 of 15 13 ON YOUR SIDELINES WEEK 6 HIGHLIGHTS 13 On Your Sidelines Week 5 Mercy Health MVP Cameron Brayman | 03:29 13 On Your Sidelines Week 5 Mercy Health MVP Cameron Brayman WZZM 8 of 15 13 ON YOUR SIDELINES WEEK 6 HIGHLIGHTS Cedar Springs takes down FHN's perfect record | 01:34 Cedar Springs takes down FHN's perfect record WZZM 9 of 15 13 ON YOUR SIDELINES WEEK 6 HIGHLIGHTS Rockford pounds Grand Haven | 01:24 Rockford pounds Grand Haven WZZM 10 of 15 13 ON YOUR SIDELINES WEEK 6 HIGHLIGHTS Big Rapids falls to Reed City | 01:40 Big Rapids falls to Reed City WZZM 11 of 15 13 ON YOUR SIDELINES WEEK 6 HIGHLIGHTS Godwin Heights takes down Kelloggsville | 01:46 Godwin Heights takes down Kelloggsville WZZM 12 of 15 13 ON YOUR SIDELINES WEEK 6 HIGHLIGHTS Muskegon blows out Zeeland East | 01:28 Muskegon blows out Zeeland East WZZM 13 of 15 13 ON YOUR SIDELINES WEEK 6 HIGHLIGHTS G.R. Catholic Central stomps Wayland Union | 01:15 G.R. Catholic Central stomps Wayland Union WZZM 14 of 15 13 ON YOUR SIDELINES WEEK 6 HIGHLIGHTS Montague pulls out narrow win over North Muskegon | 01:17 Montague pulls out narrow win over North Muskegon WZZM 15 of 15 Hudsonville rallies past East Kentwood G.R. Christian beats East Grand Rapids Oakridge defeats Whitehall Mona Shores rolls over Reeths-Puffer Lowell steamrolls Caledonia Jenison falls to Forest Hills Central Byron Center hangs on to beat Holland Christian 13 On Your Sidelines Week 5 Mercy Health MVP Cameron Brayman Cedar Springs takes down FHN's perfect record Rockford pounds Grand Haven Big Rapids falls to Reed City Godwin Heights takes down Kelloggsville Muskegon blows out Zeeland East G.R. Catholic Central stomps Wayland Union Montague pulls out narrow win over North Muskegon West Catholic beat Sparta, 48-0, at Fifth Third Ballpark on October 2, 2015. WZZM Reed City defeated Big Rapids, 22-7, on October 2, 2015. WZZM West Catholic beat Sparta, 48-0, at Fifth Third Ballpark on October 2, 2015. WZZM Cedar Springs beat Forest Hills Northern, 34-8, on October 2, 2015. WZZM Cedar Springs went on to beat Forest Hills Northern, 34-8, on October 2, 2015. WZZM A beautiful backdrop for the matchup between West Catholic and Sparta at Fifth Third Ballpark on October 2, 2015. WZZM Like this topic? You may also like these photo galleries: Replay", "external_links": [], "published": "2015-10-06T01:49:00.000+03:00", "crawled": "2015-10-06T07:38:26.788+03:00", "highlightTitle": ""}