{"organizations": [], "uuid": "3886fa82149948e6ad18f5a3a7edf5d7824314a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "nypost.com", "main_image": "https://thenypost.files.wordpress.com/2015/10/louisville.jpg", "site_section": "http://nypost.com/sports/feed/", "section_title": "| Sports | New York Post", "url": "http://nypost.com/2015/10/20/louisville-escort-pimped-out-daughters-for-100-to-hoops-stars/", "country": "", "title": "Louisville escort pimped out daughters to hoops stars for $100", "performance_score": 0, "site": "nypost.com", "participants_count": 1, "title_full": "Louisville escort pimped out daughters to hoops stars for $100 | New York Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T13:36:00.000+03:00", "replies_count": 0, "uuid": "3886fa82149948e6ad18f5a3a7edf5d7824314a3"}, "author": "Justin Terranova", "url": "http://nypost.com/2015/10/20/louisville-escort-pimped-out-daughters-for-100-to-hoops-stars/", "ord_in_thread": 0, "title": "Louisville escort pimped out daughters to hoops stars for $100", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The pressure around the Louisville basketball program is reaching its tipping point.\nFormer Louisville recruits and players confirmed in detail the stripper parties and a pay-for-sex system spearheaded by former Cardinals graduate assistant Andre McGee, in interviews with ESPN’s “Outside the Lines.”\n“I knew they weren’t college girls. It was crazy. It was like I was in a strip club,” one player said of the parties that were paid for by McGee, in concert with former escort Katina Powell, and hosted at Billy Minardi Hall, a campus dorm, according to the report.\nThe parties would basically unfold like a scene straight out of “He Got Game.” A handful of strippers would perform, some fully naked, for the players, then some would be paid extra to have sex with the players in a separate room.\nTerry Rozier and Montrezl Harrell allegedly had sex with strippers during their recruiting trips. Photo: Getty Images Two of Powell’s daughters who worked as strippers at the parties, Lindsay and Rod Ni, estimated they received $100 to have sex with former Louisville stars Russ Smith and Montrezl Harrell, respectively.\nIf Powell’s credibility is questionable — she is promoting her book about the sordid details and essentially pimped out her own daughters — the anonymous hoopsters back up the nature of her claims and ESPN “independently confirmed a wire transfer from McGee to Powell on one occasion.”\nMcGee, now an assistant at University of Missouri Kansas City, is at the center of the scandal. He arranged the first meeting with Powell through a mutual friend, and according to the players and recruits, who chose anonymity out of fear for retribution, McGee gave them cash to tip the strippers and pay for sex. Powell alleges McGee paid her $10,000 in sum over a four-year period to procure strippers for the parties.\nLouisville coach Rick Pitino has not been directly tied to the allegations and vigorously denied any knowledge when reports first surfaced last month. The university and its coach are now buttoning up as the investigation ramps up.\n“Coach Pitino has no plans to step down, and he absolutely didn’t know about the allegations,” Louisville athletic director Tom Jurich said in a statement Tuesday, via ESPN .\n“The NCAA has asked me not to comment on this matter and I will abide by it,” Pitino told Yahoo Sports . “But I will say one thing: There’s only one person who can speak on this matter, and that’s Andre McGee. He owes it to his teammates, coaches and the university to tell the truth. The truth has got to come out, and it can’t just be to the NCAA.”\nPowell said she asked McGee directly about Pitino.\nI knew they weren’t college girls. It was crazy. It was like I was in a strip club.  - A player on the parties that were paid for by McGee “I said, ‘Does Pitino know about this?’ And he said, ‘He’s Rick. He knows about everything,'” Powell said.\nTerry Rozier, who was drafted by the Celtics before this season, was another player Powell said had sex during his recruiting visit.\n“I don’t want to talk about it. … I was already committed before I took my visit. … I will say, though, Coach P [Pitino], as far as the dorm situations and visits, he’d go out to eat with the recruits and their parents. As far as after that, he wouldn’t know. … I can say his nose is clean,” Rozier said.\nThe alleged prostitution by Powell’s daughters has outlived the one-year statute of limitations as Smith (Grizzlies) and Harrell (Rockets) have moved on to the NBA.\n“I believe that McGee came to my mom and said something to her about it, and my mom came to me and I was like ‘OK,’ and we went in another room and we had sex,” Lindsay told the investigative reporting show of bedding Smith.\n“Montrezl was there, and I don’t know, I guess he felt left out. He just kind of asked me if I would do it, and I did it. I got paid maybe $100, maybe a little more,” Rod Ni said.\nNeither Harrell and Smith replied to requests for comment from ESPN, though Harrell said he didn’t “know anything about it” in an interview with the Houston Chronicle.\n  Filed under college basketball ,  louisville cardinals ,  rick pitino", "external_links": [], "published": "2015-10-20T13:36:00.000+03:00", "crawled": "2015-10-20T23:31:11.735+03:00", "highlightTitle": ""}