{"organizations": [], "uuid": "a1571b32fef2834c6a64acf5cc152834bcd34d77", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailypress.com", "main_image": "http://www.trbimg.com/img-561d7a03/turbine/dp-spt-teel-column-uva-shayok-20151013", "site_section": "http://www.dailypress.com/sports/rss2.0.xml", "section_title": "Sports - Daily Press", "url": "http://www.dailypress.com/sports/uva/dp-spt-teel-column-uva-shayok-20151013-column.html", "country": "US", "title": "U.Va.'s Shayok ready for expanded role as sophomore", "performance_score": 0, "site": "dailypress.com", "participants_count": 1, "title_full": "U.Va.'s Shayok ready for expanded role as sophomore", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T00:23:00.000+03:00", "replies_count": 0, "uuid": "a1571b32fef2834c6a64acf5cc152834bcd34d77"}, "author": "David Teel", "url": "http://www.dailypress.com/sports/uva/dp-spt-teel-column-uva-shayok-20151013-column.html", "ord_in_thread": 0, "title": "U.Va.'s Shayok ready for expanded role as sophomore", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "U.Va.'s Shayok ready for expanded role as sophomore Marial Shayok \"put in a lot of work\" \nShayok was the only freshman to play in all 34 of Virginia's games last season. \nShayok was the only freshman to play in all 34 of Virginia's games last season. David Teel Contact Reporter David Teel #UVa's @supermarial3 a natural and willing defender \nCHARLOTTESVILLE — Marial Shayok's first collegiate start went exceptionally well. Playing 26 minutes, he contributed seven points, five rebounds, four assists, two steals and a blocked shot to Virginia's road demolition of Wake Forest. \nThree days later, he played one minute in a victory over Virginia Tech. \nMuch of the jarring change was due to London Perrantes' seamless return — he went 4-of-4 from the field, scored 11 points, passed for six assists and recorded two steals — from a broken nose and concussion. But some was just a rookie's natural ebb and flow. \n\"Obviously as a freshman, there are ups and downs,\" Shayok said Monday as the Cavaliers continued preparations for what should be another season of national contention. \nBank on a more significant and consistent role for Shayok as a sophomore. \nAt 6-foot-5, 215 pounds, he's best equipped to succeed Justin Anderson, now with the Dallas Mavericks, as a shut-down perimeter defender. He gained about 10 pounds during the offseason, refined his jump shot and worked out with the ultimate role model: fifth-year senior Malcolm Brogdon. \n\"That to me bodes so well for Marial's future,\" first-year assistant coach Brad Soderberg said, \"because without question, he's got God-given gifts. He's as long as a telephone wire, he's a tenacious worker, he's very conscientious about his game. Like when he errs in practice, he's asking for instruction after practice to correct the error.\" \nBorn in Canada and graduated from Blair Academy in New Jersey, Shayok was the only freshman to play in all 34 games last season. He averaged 3.8 points, 1.8 rebounds and 14.6 minutes on a veteran squad. His shooting percentages of 40.5 from the field, 38.0 from beyond the arc and 63.0 from the foul line were respectable but declined markedly against ACC opponents. Brad Soderberg believes Marial Shayok can be \"special\" \nVirginia assistant coach impressed by sophomore's work ethic and natural skills. \nVirginia assistant coach impressed by sophomore's work ethic and natural skills. See more videos \nYet Shayok never appeared to lose confidence. He rarely shied from an open shot, no matter the moment, and didn't force too many. \n\"You're going to miss shots,\" Shayok said. \"I just kept trying to play hard. That's what my teammates and coaches kept telling me. Keep playing hard, playing with confidence. When things are rough, I'll tell you what, this team is great at picking you up and making sure you're there mentally.\" \nShayok roomed with fellow freshman Jack Salt, but he gravitated to Brogdon, a two-time All-ACC guard and the program's most reliable and mature presence. \n\"On and off the court he just does great things,\" Shayok said. \"The way he carried himself, that's one of the main things I took from last year. … His workouts, every drill, every shot has a purpose. Just try to get better with every shot, every dribble. He doesn't take any plays off, and that pushes me.\" \nTransitioning from high school to college basketball is most difficult defensively, particularly when you're coach is as demanding as Tony Bennett. But as Soderberg noted, Shayok's wingspan makes him a natural defender. \nShayok wasn't as dynamic as Anderson or as sound as Brogdon. But eventually, he could be. \n\"I felt I was a pretty decent defender last year,\" Shayok said. \"Just trying to be more consistent, no letdowns on plays, no mental mistakes. Even though they're going to happen, just try to limit those this year.\" \nShayok's best game was Virginia's ACC opener at Miami, where he had season-highs of nine points and 31 minutes, plus five rebounds and two assists. But good luck getting him to rehash personal highlights. \nKeeping with Bennett's focus on the collective, Shayok is far more comfortable talking about a team that went 30-4 and didn't lose until the final day of January. \n\"I was just so grateful to be in this position because I didn't choose this school initially,\" he said. \"Just being a part of a family. That was probably the biggest high point. Like playing with a bunch of my brothers.\" \nIndeed, Shayok was Marquette-bound until coach Buzz Williams left the Big East program for Virginia Tech. His second choice, Virginia, was the ideal Plan B. \n\"So thankful it happened the way it happened,\" Shayok said. \"He got what he wanted, and so did I deep down. … Just getting a taste of it (last season) was amazing. We just hope we can all trust each other like we did last year, or even more. I'm just ready to step up whenever my name is called and just show all the work I put in this summer. … Really excited for this year. Really big expectations.\" \nBig expectations for Virginia. Big expectations for Shayok. \n\"I think his jump shot has improved, even from what I observed on TV last year,\" Soderberg said. \"Again, because of the reps he put in on his own time. I think what he could become is very exciting. He's not there yet. I don't know that he's ready to be our leading scorer, All-ACC or anything like that. But the future looks very bright for a kid with those kinds of gifts and that kind of work ethic. I think he's going to be special.\" \nDavid Teel can be reached at 757-247-4636 or by email at dteel@dailypress.com . For more from Teel, read his blog at dailypress.com/teeltime and follow him at twitter.com/DavidTeelatDP.", "external_links": [], "published": "2015-10-14T00:23:00.000+03:00", "crawled": "2015-10-14T01:52:33.557+03:00", "highlightTitle": ""}