{"organizations": [], "uuid": "dee24730accee4b28aef391234653d752bcc44d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.brownsvilleherald.com", "main_image": "http://bloximages.newyork1.vip.townnews.com/brownsvilleherald.com/content/tncms/assets/v3/editorial/f/9e/f9efdae4-adb3-52fa-a6c9-e63c799a2a9d/5619280a9cf96.image.jpg", "site_section": "http://www.brownsvilleherald.com/search/?q=&t=article&l=25&d=&d1=&d2=&s=start_time&sd=desc&c[]=sports*&f=rss", "section_title": "Brownsville Herald - sports", "url": "http://www.brownsvilleherald.com/sports/auto-racing/article_7670a010-8d40-59df-95f2-6d921fb3e021.html", "country": "US", "title": "Rosberg takes pole position for Russian GP", "performance_score": 0, "site": "brownsvilleherald.com", "participants_count": 1, "title_full": "Rosberg takes pole position for Russian GP", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T17:49:00.000+03:00", "replies_count": 0, "uuid": "dee24730accee4b28aef391234653d752bcc44d0"}, "author": "JAMES ELLINGWORTH", "url": "http://www.brownsvilleherald.com/sports/auto-racing/article_7670a010-8d40-59df-95f2-6d921fb3e021.html", "ord_in_thread": 0, "title": "Rosberg takes pole position for Russian GP", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Luca Bruno Rosberg takes pole position for Russian GP \nMercedes driver Nico Rosberg of Germany steers his car to set the pole position during the qualifying session at the 'Sochi Autodrom' Formula One track , in Sochi, Russia, Saturday, Oct. 10, 2015. The Russian Formula one Grand Prix will be held on Sunday. (AP Photo/Luca Bruno) Luca Bruno F1: Rosberg logra la pole del GP de Rusia \nEl piloto de Mercedes, Nico Rosberg, festeja, tras lograr la pole del GP de Rusia el sábado, 10 de octubre de 2015, en Sochi, Rusia. (AP Photo/Luca Bruno) Ivan Sekretarev Rosberg takes pole position for Russian GP \nMercedes driver Nico Rosberg of Germany, center, pole position, is flanked by Mercedes driver Lewis Hamilton of Britain, right, second fastest time, and Williams driver Valtteri Bottas of Finland, third fastest time after the qualifying session at the 'Sochi Autodrom' Formula One track , in Sochi, Russia, Saturday, Oct. 10, 2015. The Russian Formula one Grand Prix will be held on Sunday. (AP Photo/Ivan Sekretarev) Pavel Golovkin Rosberg takes pole position for Russian GP \nMercedes driver Lewis Hamilton of Britain arrives for the third free practice at the 'Sochi Autodrom' Formula One circuit in Sochi, Russia, on Saturday, Oct. 10, 2015. A heavy crash for Carlos Sainz Jr. ended the final practice session at the Russian Grand Prix on Saturday with the Toro Rosso driver hospitalized. The Formula one race will be held on Sunday. (AP Photo/Pavel Golovkin) Pavel Golovkin Rosberg takes pole position for Russian GP \nMercedes driver Nico Rosberg of Germany arrives for the third free practice at the 'Sochi Autodrom' Formula One circuit in Sochi, Russia, on Saturday, Oct. 10, 2015. A heavy crash for Carlos Sainz Jr. ended the final practice session at the Russian Grand Prix on Saturday with the Toro Rosso driver hospitalized. The Formula one race will be held on Sunday. (AP Photo/Pavel Golovkin) Ivan Sekretarev Rosberg takes pole position for Russian GP \nCourse marshals remove the crashed car of Toro Rosso driver Carlos Sainz Jr. of Spain during the third free practice at the 'Sochi Autodrom' Formula One circuit in Sochi, Russia, on Saturday, Oct. 10, 2015. A heavy crash for Carlos Sainz Jr. ended the final practice session at the Russian Grand Prix on Saturday with the Toro Rosso driver hospitalized. The Formula one race will be held on Sunday. (AP Photo/Ivan Sekretarev) Ivan Sekretarev Rosberg takes pole position for Russian GP \nToro Rosso driver Carlos Sainz Jr. of Spain misses the track on the second turn as he steers his car during the third free practice at the 'Sochi Autodrom' Formula One circuit in Sochi, Russia, on Saturday, Oct. 10, 2015. A heavy crash for Carlos Sainz Jr. ended the final practice session at the Russian Grand Prix on Saturday with the Toro Rosso driver hospitalized. The Formula one race will be held on Sunday. (AP Photo/Ivan Sekretarev) Luca Bruno Rosberg takes pole position for Russian GP \nToro Rosso driver Carlos Sainz Jr. of Spain, is transported by an air ambulance , after crashing during the third free practice session at the 'Sochi Autodrom' Formula One track , in Sochi, Russia, Saturday, Oct. 10, 2015. A heavy crash for Carlos Sainz Jr. ended the final practice session at the Russian Grand Prix on Saturday with the Toro Rosso driver being taken from the track in an ambulance for medical treatment. The Formula one race will be held on Sunday. (AP Photo/Luca Bruno) Luca Bruno Rosberg takes pole position for Russian GP \nToro Rosso driver Carlos Sainz Jr. of Spain, not seen in the picture, is carried by medical staff on a stretcher to be transfer to a hospital by helicopter, after crashing during the third free practice session at the 'Sochi Autodrom' Formula One track , in Sochi, Russia, Saturday, Oct. 10, 2015. A heavy crash for Carlos Sainz Jr. ended the final practice session at the Russian Grand Prix on Saturday with the Toro Rosso driver hospitalized. The Formula one race will be held on Sunday. (AP Photo/Luca Bruno) Luca Bruno Rosberg takes pole position for Russian GP \nFerrari driver Sebastian Vettel of Germany steers his car during the first free practice at the 'Sochi Autodrom' Formula One track , in Sochi, Russia, Friday, Oct. 9, 2015. The Formula one race will be held on Sunday. (AP Photo/Luca Bruno) Posted: Saturday, October 10, 2015 9:49 am | Updated: 12:00 pm, Sat Oct 10, 2015. Rosberg takes pole position for Russian GP Associated Press | \nSOCHI, Russia (AP) — Mercedes' Nico Rosberg took pole position for the Russian Grand Prix on Saturday ahead of his teammate and title rival Lewis Hamilton. \nRosberg set an unbeatable time of 1 minute, 37.113 seconds midway through the final qualifying session in Sochi, more than three tenths of a second faster than Hamilton. \nThe top drivers had been in an uncertain situation ahead of qualifying after rain and various incidents, including a heavy crash for Toro Rosso's Carlos Sainz, reduced dry practice time to a minimum. \n\"Very happy. It's been a difficult weekend because of the little running we got,\" Rosberg said. \"Qualifying worked out really well. We found a good balance on my car, thanks to my engineers as well. We had to guess a bit.\" \nHamilton challenged for the top spot with an aggressive final lap but ran off track and aborted the attempt. He said he was pleased to see Mercedes defy predictions that the team's car could struggle in Russia as it had on the similar Singapore circuit last month. \n\"Coming into the weekend, people were making assumptions that we'd have a repeat of Singapore,\" Hamilton said. \"Honestly, I had no idea what it was going to be like and to think that now we're the other way, it's very, very strange. I don't have an answer for it.\" \nHamilton has a lead of 48 points over Rosberg with five races remaining. The Mercedes team can secure the constructors' title Sunday. \nRosberg's fast lap denied Hamilton what would have been his 50th career pole position and 12th of this season. \nAt the last race in Japan, Rosberg also started on pole but was overtaken by Hamilton in the first two corners. Rosberg said his approach to the start would not be affected by the way he had lost the lead in Japan, saying his procedure would be simply to \"work on the start, get everything right there, look at last year's start (in Sochi), learn from that.\" \nLast year in Russia, Rosberg started second behind Hamilton and challenged his teammate for the lead but misjudged the move and damaged his tires. Hamilton went on to take the win. \nEven though Rosberg's attempt last year had not worked out, Hamilton said he was confident he could pass his teammate in Sunday's race. \"It's a long, long way down to turn one, probably one of the longest ones of the whole year, so it should create opportunities,\" he said. \nIn cool, cloudy conditions, Williams' Valtteri Bottas took third ahead of the two Ferraris of Sebastian Vettel and Kimi Raikkonen. \n\"I think we got it right. We got the max out of the car and tires,\" Bottas said. \nForce India's Nico Hulkenberg and Sergio Perez were sixth and seventh, with Romain Grosjean eighth for Lotus and Toro Rosso's Max Verstappen ninth. \nAmid concerns the team may not return next season, the two Red Bull cars were off the pace in qualifying, with Daniel Ricciardo 10th, one place ahead of Daniil Kvyat, who disappointed his home crowd in Russia by failing to reach the final qualifying session. \nToro Rosso driver Carlos Sainz did not compete in qualifying after a high-speed crash in the final practice session. His team says he is uninjured but will spend the night in hospital as a precaution. \nSainz's Twitter account posted a picture of him giving a thumbs-up sign from his hospital bed with the caption: \"Already thinking how to convince the doctors to be on the grid for tomorrow.\" \nSainz lost control of his car on a high-speed stretch heading into a steep right-hand corner, before scraping along the wall and crashing head on into the barriers. The car went through impact-absorbing barriers and buckled the metal barrier behind. \nRosberg said he had not seen the accident but suggested it could give rise to new concerns over driver safety. \n\"Apparently it's not good, not ideal, so let's see if we can make progress on that,\" he said. \nIt is just over a year since a heavy crash at the Japanese Grand Prix left French driver Jules Bianchi in a coma. He died in July.", "external_links": [], "published": "2015-10-10T17:49:00.000+03:00", "crawled": "2015-10-10T20:41:51.701+03:00", "highlightTitle": ""}