{"organizations": ["Ohio State Buckeyes", "Iowa Hawkeyes"], "uuid": "d86259e90055f7ab6880c42b91cd5f3318e58e61", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.allmediany.com", "main_image": "", "site_section": "http://www.allmediany.com/rssService/Sports.xml", "section_title": "Sports", "url": "http://www.allmediany.com/news/56105-big-ten-week-7-preview-ranked-ohio-state-buckeyes-amp-iowa-hawkeyes-look-to-remain-undefeated", "country": "US", "title": "Big Ten Week 7 Preview: Ranked Ohio State Buckeyes amp; Iowa Hawkeyes Look to Remain Undefeated", "performance_score": 0, "site": "allmediany.com", "participants_count": 0, "title_full": "Big Ten Week 7 Preview: Ranked Ohio State Buckeyes amp; Iowa Hawkeyes Look to Remain Undefeated", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T08:52:00.000+03:00", "replies_count": 0, "uuid": "d86259e90055f7ab6880c42b91cd5f3318e58e61"}, "author": "", "url": "http://www.allmediany.com/news/56105-big-ten-week-7-preview-ranked-ohio-state-buckeyes-amp-iowa-hawkeyes-look-to-remain-undefeated", "ord_in_thread": 0, "title": "Big Ten Week 7 Preview: Ranked Ohio State Buckeyes amp; Iowa Hawkeyes Look to Remain Undefeated", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Get Sports Alerts \n15 Oct 2015 05:52 PM EST \n-by TJ Inman, Contributing Writers; Image: Iowa Hawkeyes running back Jordan Canzeri runs the ball against Illinois. (Image Source: David Purty/Getty Images) \nHere’s a look at the Big Ten in Week 7 : \n(17) Iowa at (20) Northwestern – Noon on ABC/ESPN2 \nThe Iowa Hawkeyes (6-0, 2-0) are perched alone atop the B1G West after victories over Wisconsin and Illinois. Northwestern (5-1, 1-1) returns to Evanston after a disappointing Saturday in Ann Arbor where the Michigan Wolverines pounded them 38-0. The Wildcats need a win to stay in the race for the division title and the Hawkeyes could cement themselves as the favorite to represent the West in Indianapolis if they come out on top. \nIowa running back Jordan Canzeri was the standout performer for the Hawkeyes against Illinois and he is now averaging more than five yards a carry and has nine touchdowns on the season. Despite last week’s poor showing, Northwestern’s defense is still a top-10 unit nationally and they’ll need to play like it to get a win on Saturday. \nThis game will probably be decided by whether or not Northwestern’s offense is able to get anything going. Justin Jackson is a very good running back but opponents know the Wildcats don’t have much of a passing game as Clayton Thorson tries to survive his freshman season. Drew Ott won’t be playing for Iowa but the Hawkeyes still have a solid defense that won’t make things easy for Northwestern. Expect a fairly low-scoring battle that will go a long way towards determining the B1G West. \nPenn State at (1) Ohio State – 8:00 on ABC \nI think the Ohio State Buckeyes have figured out a nice wrinkle that will have them playing at the level many expected before the season. Putting JT Barrett into the game when they get into scoring range adds a running threat (three rushing touchdowns last week) and surprisingly, it appeared to make Cardale Jones more comfortable. Jones had his best game of the season last week as Ohio State pulled away from the Maryland Terrapins for a convincing victory. \nThat being said, I don’t think the Buckeyes are playing like the number one team in the country quite yet and Penn State has a stout defense that will make this competitive. Penn State has a top-15 defense that is capable of rushing the passer and is very difficult to run on. Carl Nassib , Anthony Zettel and Austin Johnson form one of the best defensive lines in the country, while Jordan Lucas and Marcus Allen are a tremendous duo at safety. \nOhio State is going to eventually be able to put up some points so Penn State’s offense is going to need to have a good performance to keep up. That means Christian Hackenberg must be accurate (something he hasn’t always done this season) to targets like Chris Godwin and DaeSean Hamilton , something that is more likely to happen if the offensive line can limit the OSU pass rush. The O-line is a weakness but they’ve improved a bit as the season has gone on and they are much better now than they were the last time they played on the road (at Temple). Having Saquon Barkley back in the backfield would be a huge boost. \nTo Read More From Sammy Jacobs, TJ Inman & Nick Holmes of HoosierHuddle.com , click here .", "external_links": [], "published": "2015-10-15T08:52:00.000+03:00", "crawled": "2015-10-16T17:05:59.865+03:00", "highlightTitle": ""}