{"organizations": ["Wildcats", "Anna-Jonesboro Wildcats", "Rangers", "Benton Rangers"], "uuid": "dd49285f668b3c730ee6c53bd9b544fed0d7dd4f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bentoneveningnews.com", "main_image": "http://www.bentoneveningnews.com/storyimage/IO/20151024/NEWS/151029647/AR/0/AR-151029647.jpg", "site_section": "http://www.bentoneveningnews.com/sports?template=rss&mime=xml", "section_title": "Sports - Benton Evening News - Benton, IL", "url": "http://www.bentoneveningnews.com/article/20151024/NEWS/151029647/2000/NEWS?rssfeed=true", "country": "US", "title": "Ranger's long season finishes with a loss to A-J", "performance_score": 0, "site": "bentoneveningnews.com", "participants_count": 0, "title_full": "Ranger's long season finishes with a loss to A-J", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T01:07:00.000+02:00", "replies_count": 0, "uuid": "dd49285f668b3c730ee6c53bd9b544fed0d7dd4f"}, "author": "", "url": "http://www.bentoneveningnews.com/article/20151024/NEWS/151029647/2000/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "Ranger's long season finishes with a loss to A-J", "locations": ["IL"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Cole Richardson", "Ian McMahon", "Dylan Fox", "Drake Pyle", "Benton", "Jeremy Clodfelder", "Brendan Ritchason", "Nick Goffinet", "Jake Stark", "Jordan Kulich", "Caleb Clover", "WILLIAM MCPHERSON", "Clay Kelley", "Colin Prather", "Blane Pankey", "Brett Detering", "Alexander Longfellow", "Clodfelder"], "text": "Ranger's long season finishes with a loss to A-J Comment Benton Evening News - Benton, IL Writer Posted Oct. 24, 2015 at 6:07 PM Posted Oct. 24, 2015 at 6:07 PM BY WILLIAM MCPHERSON Contributing Writer ANNA-JONESBORO – It was a painful loss in more ways than one. The Benton Rangers fell 41-13 to the Anna-Jonesboro Wildcats in a season-ending rout that saw two of Benton’s players carried off the field before all was said and done. The Rangers went into this final game of the season at ‘The Pit’ against Anna-Jonesboro with a disappointing 2-6 record, which they were hoping to convert to 3-6. The Wildcats, coached by Brett Detering, improved their 3-5 record to 4-5 with the win. “It’s been a painfully long year,” said Benton coach Jeremy Clodfelder the day before the game, also noting “We’ve been kind of limping through the season.” Clodfelder showed optimism in the last hour leading up to the game though. Speaking about what a win against A-J would mean for the Ranger squad, he said “Anytime you win your last game, it sends your seniors out on a high note and springboards you for the next season.” Things went bad early, as Benton had a bizarre first quarter. Running back Clay Kelley broke out for a long run into the end-zone that would have been scored a TD if it had not been called back for an illegal block. The Wildcats went on to dominate the first half, scoring two touchdowns in each quarter and making good on all PAT attempts. Benton briefly rallied in the second quarter scoring a touchdown on a short 3-yard pass from Quarterback Hamilton Page to receiver Brendan Ritchason, with Ian McMahon kicking the point after. A possible scoring rally came to halt with 22 seconds left in the second quarter. when A-J's Colin Prather intercepted Page. It was the same play that saw Benton’s Alexander Longfellow taken out of the game with an injury from a Wildcat chop-block. The Wildcats narrowly missed having a three-touchdown second quarter as QB Jake Stark’s pass to Dylan Fox fell incomplete in the end zone as the clock ran out. A-J continued the domination into the third quarter scoring two more touchdowns. The first one came 11 seconds into the second half with Stark running for 58 yards and followed with the PAT. The second score came with 3:10 left in the third quarter off an 8-yard run by Caleb Clover. A-J missed the PAT kick, though, for the first and only time. The Rangers, scoreless in the third, picked up their final touchdown in the fourth off a 3-yard pass from Page to wide receiver Cole Richardson. The Rangers 2-point conversion attempt failed. This touchdown came just moments after Benton’s Blane Pankey was taken out of the game after a nasty helmet collision with the Wildcat’s Drake Pyle and several other players. The Wildcats were scoreless in the fourth, but had already done enough damage in the three previous quarters to secure the victory. Page 2 of 2 - A-J bested Benton in several key stats throughout the game. The Wildcats finished with 24 first downs to Benton’s 18. A-J also dominated the in total yards with 409-263; 366 of those A-J yards came on the ground compared to Benton’s 152. After the game, A-J Coach Brett Detering commented that he was proud of the way his Wildcats finished what was a tough season for them as well. \"I have a strong group of seniors. They were high character guys…. We had great weeks of practice even after we were eliminated from the playoffs. That says a lot about the type of kids that our seniors were and the types of leaders that they were for our program.\" Detering concluded. Clodfelder commented after the Rangers' tough season saying his mind was centered on “going forward and finishing things up.” \"You commend the guys that competed and finished in the end” Clodfelder added. “I really thought Clay Kelley, Nick Goffinet and Jordan Kulich were three seniors that really competed hard there at the end, but when you're playing guys out of position and creating different things because of injuries and what-have-you, it's going to be a tough out and a tough finish. There's no question about it.\" Benton Evening News - Benton, IL Writer", "external_links": [], "published": "2015-10-25T01:07:00.000+02:00", "crawled": "2015-10-25T05:51:14.310+02:00", "highlightTitle": ""}