{"organizations": [], "uuid": "9148664ac263bad568fc9eb7f0aa706da5660fd5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.northjersey.com", "main_image": "http://www.northjersey.com/designimages/NorthJerseyFacebook_377x196.jpg", "site_section": "http://www.northjersey.com/cmlink/sports-rss.rss#", "section_title": "Sports News on NorthJersey.com", "url": "http://www.northjersey.com/sports/soccer/red-bulls/red-bulls-add-to-lead-in-east-1.1425118", "country": "US", "title": "Red Bulls: Defeat Columbus Crew, 2-1 - Red Bulls", "performance_score": 0, "site": "northjersey.com", "participants_count": 1, "title_full": "Red Bulls: Defeat Columbus Crew, 2-1 - Red Bulls - NorthJersey.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T04:21:00.000+03:00", "replies_count": 0, "uuid": "9148664ac263bad568fc9eb7f0aa706da5660fd5"}, "author": "THE ASSOCIATED PRESS |", "url": "http://www.northjersey.com/sports/soccer/red-bulls/red-bulls-add-to-lead-in-east-1.1425118", "ord_in_thread": 0, "title": "Red Bulls: Defeat Columbus Crew, 2-1 - Red Bulls", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bradley Wright-Phillips scored the go-ahead goal in the first half and the Red Bulls held on to beat the Columbus Crew, 2-1, on Saturday night at Harrison.\nThe playoff-bound Red Bulls (15-9-6) have a three-point lead over D.C. United in the Eastern Conference with four games to play. Despite consecutive losses, the Crew (13-11-8) clinched a playoff spot with Orlando City beating Montreal, 2-1.\nColumbus goalkeeper Steve Clark tried to kick the ball to Harrison Afful, but it was intercepted by a charging Connor Lade. Lade then crossed the ball to Wright-Phillips, who scored off a header in the 21st minute for his 15th goal of the season.\nThe Crew's Justin Meram split five defenders, and floated his shot just off defender Damien Perrinelle's head and through goalkeeper Luis Robles' hands in the eighth minute.\nLloyd Sam tied it three minutes later. Sacha Kljestan assisted on the goal.\nTORONTO FC 3, UNION 1 (at Toronto) — Sebastian Giovinco and Livingston native Jozy Altidore scored, and Toronto FC beat the Philadelphia to close in on the first playoff berth in franchise history.\nToronto improved to 14-13-4. The Union (9-16-7) were eliminated from playoff contention.\nGiovinco, on his third free kick of the first half, converted in the 28th minute from the edge of the penalty box when his shot deflected off Raymon Gaddis in the wall and looped high into the far corner of the goal.\nAltidore scored in the 63rd, fighting off a defender to tap the ball in for his 12th of the season.\nORLANDO CITY SC 2, IMPACT 1 (at Orlando, Fla.) — Seb Hines scored on a volley in the 80th minute and Orlando City avoided elimination from the playoff race with a win over Montreal.\nOrlando City (11-13-8, 41 points) entered the game in seventh place, needing at least a tie to remain in the Eastern Conference playoff race. It won its fourth straight and has two games remaining in the season.\nThe Impact (12-12-6, 42 points) would have clinched a playoff berth with a win, but retained their hold of sixth place and the final playoff position with four games to go.\nCyle Larin opened the scoring for Orlando in the 33rd minute, extending his rookie scoring record to 15 goals.\nDominic Oduro tied it in the 43rd minute with a loose-ball finish. Orlando City goalkeeper Tally Hall was shown a yellow card for dissent.\nOrlando City teammates Tommy Redding and Rafael Ramos suffered a head-to-head collision in the fourth minute. Both left the game on stretchers after a seven-minute delay.", "external_links": [], "published": "2015-10-04T04:21:00.000+03:00", "crawled": "2015-10-04T10:21:48.197+03:00", "highlightTitle": ""}