{"organizations": [], "uuid": "dc0ad886b3fa2753d64eaf30b79a501b19f97aca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-5607539a/turbine/ct-northwestern-ball-state-football-spt-0927-20150926", "site_section": "http://www.chicagotribune.com/sports/college", "section_title": "College Sports News - Chicago Tribune", "url": "http://www.chicagotribune.com/sports/sports/college/ct-northwestern-ball-state-football-spt-0927-20150926-story.html", "country": "US", "title": "Clayton Thorson survives shaky start, leads Northwestern past Ball State", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Clayton Thorson survives shaky start, leads Northwestern past Ball State - Chicago Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-09-27T07:49:00.000+03:00", "replies_count": 0, "uuid": "dc0ad886b3fa2753d64eaf30b79a501b19f97aca"}, "author": "Fred Mitchell", "url": "http://www.chicagotribune.com/sports/sports/college/ct-northwestern-ball-state-football-spt-0927-20150926-story.html", "ord_in_thread": 0, "title": "Clayton Thorson survives shaky start, leads Northwestern past Ball State", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Coach Pat Fitzgerald cited a lack of trust as a key factor in Northwestern finishing 5-7 the last two seasons.\nDuring Saturday night's hard-fought 24-19 win over Ball State, the unbeaten, 17th-ranked Wildcats' trust in redshirt freshman quarterback Clayton Thorson was tested.\nThorson turned the ball over three times in the first half on a pair of fumbles and an interception. But he managed to connect with senior superback Dan Vitale on a 66-yard touchdown pass in the first half and went on to throw two more in the second half to help the Wildcats improve to 4-0.\n\"We just have to take care of the ball,\" Fitzgerald said. \"We cannot turn the ball over like we did. Very rarely are you going to win football games when you lose the turnover ratio by two and you miss a (26-yard) field goal. We were very fortunate.\"\nThorson finished 18 of 31 yards for 256 yards. . Vitale had five receptions for 108 yards and two touchdowns. Austin Carr caught the other TD pass, a 25-yarder with 8:01 left in the third quarter.\n\"He just trusted himself (in the third quarter) and just took what the defense gave him,\" Fitzgerald said. \"It's a process at quarterback. ... I don't think he has been too high with success, and I don't think he has been too low when we've had adversity. That, to me, is a young man that's growing and growing in the position and understanding the significance of his role.\"\nThe week before, Thorson completed just 9 of 23 passes for 70 yards and two interceptions, but Fitzgerald stuck with the Wheaton North product. And Thorson's teammates continued to advocate for him.\n\"We know he has the ability to do great things,\" Vitale said earlier in the week. \"We're not worried about that. We've just got to keep doing our job and we'll be fine.\"\nSophomore running back Justin Jackson did his job Saturday night, rushing for 184 yards to help the Wildcats improve to 4-0. He racked up 151 in the first three quarters and had a long gain of 62 yards.\nBall State (2-2) led 10-7 at the half as freshman quarterback Riley Neal passed 22 yards to Jordan Williams. The score was set up by a Thorson fumble.\n\"I tried to convey to the guys how difficult this challenge would be,\" Fitzgerald said. \"I obviously didn't get them ready to play the way they are capable of in the first half. But I thought we responded. We had a lot of guys go down, and it was an opportunity for (others) to step up. And I thought for the most part some guys were able to do that.\"\nFitzgerald said trust and focus were a problem for the Wildcats the last two seasons.\n\"I sensed a lack of focus, a lack of maturity in some areas. That combination, along with the chemistry not being right in the locker room, was disastrous,\" Fitzgerald said. \"That starts with me as the leader. I'm the one who sets the tone and when it's not right in those areas, it's my fault. You fix it, you move on.\"\nLast season's distraction, resulting in part from some current and former players advocating for the unionization of college players, has faded with the court's rejection of the proposal. Meanwhile, the missing ingredients for a winning and cohesive program seem to have reappeared in Evanston.\n\"It starts in the locker room,\" Fitzgerald said. \"The seniors, the guys who have been here for a while and been around when we had it right, understood how hard it was to get it there. Since January they've been working hard to build that foundation. Then I think the evidence of our first couple games shows they're getting a return on that investment. It's pretty powerful.\"\nThe Wildcats are no longer a secret nationally after upsetting Stanford 16-6 in the season opener, blanking Eastern Illinois 41-0 and taking care of previously unbeaten Duke 19-10 on the road before Saturday night's win.\n\"The No. 1 reason we are playing as well as we are is senior leadership,\" defensive coordinator Mike Hankwitz said. \"Dean (Lowry) and Deonte (Gibson) and the D-linemen. You have someone in each room (of the defensive positions) who is providing excellent leadership. They are not all captains. You don't have to be a captain to be a leader. You lead by example, by performance and by attitude.\"\nFitzgerald also demands that his players work as hard in the classroom as they do on the field.\n\"It is unacceptable to use football as an excuse for poor performances academically,\" he said. \"And it's unacceptable to use academics as an excuse for poor performances in football.\n\"I stood up our engineers and pre-med guys (Monday). There's a bunch of them, double digits. They're our best students. They always show up with an unbelievable attitude, bust their butt every day in practice and they play well. I challenged the other guys to handle their business. They will. I'm confident of that.\"\nfmitchell@tribpub.com\nTwitter @kicker34\n2-minute drill\nThe big hurt: Coach Pat Fitzgerald said he fears safety Kyle Queiro left with a broken arm Saturday. He was not specific about injuries to offensive tackle Geoff Mogus, who was carted off with an injury. Safety Godwin Igwebuike and superback Garrett Dickerson also suffered injuries that warranted attention on the field.\nThe rundown: Justin Jackson's 184 rushing yards gave the sophomore his ninth career 100-yard rushing game.\nKeeping it close: The Wildcats were fortunate to be down only by 10-7 at the half. Ball State freshman Morgan Hagee missed wide right from 43 and 40 yards. Ball State also botched a handoff at the NU 4-yard line that the Wildcats recovered.\n Northwestern Wildcats", "external_links": ["http://www.trbimg.com/img-5607539a/turbine/ct-northwestern-ball-state-football-spt-0927-20150926"], "published": "2015-09-27T07:49:00.000+03:00", "crawled": "2015-10-01T15:21:00.832+03:00", "highlightTitle": ""}