{"organizations": ["Leicester", "Arsenal"], "uuid": "f63fa677f1a008e948d62c9e10e7fe22c3175b5b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/a680cd1ae0bfc15734163cdf5fd20f6b.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/football/claudio-ranieri-hails-leicesters-response-to-arsenal-defeat/6888789/", "country": "JE", "title": "Claudio Ranieri hails Leicester's response to Arsenal defeat", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "Claudio Ranieri hails Leicester's response to Arsenal defeat", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T15:31:00.000+03:00", "replies_count": 0, "uuid": "f63fa677f1a008e948d62c9e10e7fe22c3175b5b"}, "author": "", "url": "http://www.sport.co.uk/football/claudio-ranieri-hails-leicesters-response-to-arsenal-defeat/6888789/", "ord_in_thread": 0, "title": "Claudio Ranieri hails Leicester's response to Arsenal defeat", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Claudio Ranieri"], "text": "Claudio Ranieri hails Leicester's response to Arsenal defeat 04 Oct 2015 12:31:52 \ncomments \nLeicester City manager Claudio Ranieri has lauded his team for responding to their first defeat of the season with a 2-1 victory at Norwich. \nRanieri's side, who are now fourth in the table after their win at Carrow Road on Saturday, were on the wrong end of a 5-2 scoreline against Arsenal in their last Barclays Premier League outing. \nBut the Foxes bounced back and recorded their fourth win of the campaign as Jamie Vardy converted from the spot for his sixth goal in five league games before Jeff Schlupp netted his first of the season. \nRanieri's men even withstood a Norwich fightback after Congolese striker Dieumerci Mbokani pulled one back for the hosts. \nThe Italian manager said: \"It was a very good answer after the defeat against Arsenal. It was a very good match against a good team that were well organised and play good football, but today we were very determined to win the match. \n\"We created a lot of great chances to score, we scored twice, then they scored and there was a big battle in English spirit and I love this kind of spirit.\" \nRanieri took the surprise decision to name five-goal Riyad Mahrez on the bench against the Canaries. \nHe explained: \"We knew very well how Norwich would play. They push a lot on the flanks and make a lot of deliveries into the box. \n\"We wanted to start with a solid team and then, during the match, I could put Riyad on the field. But the match was different because we were winning. \n\"When you play against Norwich, they play good football and can score goals, so it was important for us to be calm, to play well and to be in a good position late in the game.\" \nLeicester appeared on course to be cruising to victory after Schlupp's strike early in the second half. \nBut the introduction of Nathan Redmond and Mbokani helped breathe new life into the beleaguered hosts, with the latter netting after 68 minutes. \nAnd Redmond, who was denied the chance to add to his tally of three goals this season after a fine save from Leicester goalkeeper Kasper Schmeichel in the closing stages, believes Norwich did enough to warrant a draw. \n\"I thought we were unlucky not to get a point as we were always in the game,\" Redmond told the club's website. \n\"Even looking at it from the bench before I came on we looked likely to pose a threat. We knew what they were capable of on the counter-attack because they're a good side, and they showed that. \n\"The goals set the tone for the game, although we kept creating chances and fought back in the final 30 minutes. We can't be too disheartened as we've not started the season badly. \n\"There are still a lot of games left and we've just got to keep going.\" Related Sport News", "external_links": [], "published": "2015-10-04T15:31:00.000+03:00", "crawled": "2015-10-05T18:50:22.116+03:00", "highlightTitle": ""}