{"organizations": ["Honda Center"], "uuid": "7fe57d3140ef9bdac57978ecc8c4389d367c530c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ocregister.com", "main_image": "http://images.onset.freedom.com/ocregister/gallery/nwjpnx-b88545476z.120151020180231000g6bcmumo.10.jpg", "site_section": "http://ocregister.com//common/rss/rss.php?catID=18901", "section_title": "The Orange County Register - News Headlines : Sports", "url": "http://www.ocregister.com/articles/one-688439-kings-dodgers.html", "country": "US", "title": "Fryer: Honda Center's new scoreboard has technical difficulties", "performance_score": 0, "site": "ocregister.com", "participants_count": 0, "title_full": "Fryer: Honda Center's new scoreboard has technical difficulties - The Orange County Register", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "7fe57d3140ef9bdac57978ecc8c4389d367c530c"}, "author": "", "url": "http://www.ocregister.com/articles/one-688439-kings-dodgers.html", "ord_in_thread": 0, "title": "Fryer: Honda Center's new scoreboard has technical difficulties", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "What in the wide, wide world of sports is going on here: \n• Having made the first visit of this Ducks season to Honda Center on Sunday, this is what I think of the new scoreboard: It’s half as good as the old one.\n• That’s because only two sides of the four-sided apparatus worked Sunday. The two sides that did not work were side-by-side screens, one that traces the length of the ice and a shorter one that faces the stands behind a goal.\n• The ones that did work were fantastic, such stunning clarity. The screen image of the action is as clear as what your own eyes bring you when you look at the ice. Honda Center folks say the technical issue has been repaired and the boards should be good to go for Thursday’s Lakers game.\n• Spectators on the side of the Honda Center facing the blank screens could get the score and time remaining from auxiliary boards behind the goals on the club level. And that was all. It was a lot like being at a Kings game at The Forum in the mid-’70s.\n• Except for the price of food and beverages, which changed a little. And those Kings had a better coach.\n• Nah, nothing against Bruce Boudreau. The Ducks coach is beyond good enough. Bob Pulford, who coached the Kings in the ’70s, is one of the greatest coaches in Southern California sports history.\n• The 1974-75 Kings, coached by Pulford, had 105 points, the franchise’s single-season record. The Kings that season even out-drew the Lakers at The Forum, averaging 12,620 a game against the Lakers’ 11,567.\n• The Ducks had to quit being so intricately detailed at the offensive end. Just loosen up and play. Put the puck on net and good things happen, which happened in the win over Minnesota.\n• The NFL is holding town hall meetings in St. Louis, Oakland and San Diego so fans can vent about the possible departures of their hometown teams. The meeting in San Diego, at 1,463-capacity Spreckels Theatre, will be 70 percent Steelers fans waving Terrible Towels while screaming they don’t want to drive all the way to L.A. to see their team play.\n• The Raiders play at San Diego on Sunday, which means it’s time for Raider Rules at Qualcomm Stadium. Only for a Raiders game are beer sales stopped at Qualcomm before the third quarter (instead of before the first play of the fourth quarter at the Chargers’ other home games) and beer purchases are limited to one per person instead of the usual two.\n• What’s a Chargers-Raiders game going to be like in Los Angeles? Beer sales stopped after the first TV timeout? One 8-ounce light beer per person?\n• Veteran NFL reporter Peter King, now at mmqb.com, said during an interview this week on the Mighty 1090 radio station that Chargers quarterback Philip Rivers has “a heck of a chance” of being elected to the Hall of Fame if Rivers has four or so more years playing like he has played the past few seasons.\n• King looked at Rivers’ generation of quarterbacks, in terms of Hall of Fame candidacy, and put Peyton Manning and Tom Brady in the top tier, and grouped only Rivers and the Steelers’ Ben Roethlisberger one tier down. King was doing live radio, so Drew Brees might have simply slipped his mind.\n• The Chargers did not retain running back Ryan Mathews, now with the Eagles, partially because Mathews fumbled too much. First-round draft pick running back Melvin Gordon fumbled twice against Green Bay on Sunday.\n• Six teams received No. 1 votes in the latest Associated Press college football top 25. The last time that happened was in 1990. The teams that got first-place votes this week are Ohio State (28), Utah (16), Baylor (12), TCU (3), LSU (1) and Clemson (1).\n• Orange County guys helped Notre Dame beat USC. Notre Dame’s Equanimeous St. Brown, a freshman from Servite, blocked a punt, and Mission Viejo product Max Redfield had an interception.\n• Golden West College (6-0) is No. 2 in this week’s Southern California National Division community college football poll. Saddleback (5-2) is No. 6, Fullerton (4-3) is No. 8 and Orange Coast (4-2) is No. 9.\n• Saddleback plays at Orange Coast College on Saturday at 1 p.m. Other big games coming up: Saddleback vs. Fullerton at Yorba Linda High, Oct. 31; Golden West at Orange Coast, Nov. 7; and Golden West at Saddleback, Nov. 14.\n• The Breeders’ Cup is Oct. 30-31 at Keeneland in Lexington, Ky. Triple Crown winner American Pharoah is scheduled to run in the Classic. The Breeders’ Cup was not around when Affirmed won the Triple Crown in 1978.\n• Five days after the World Series, Dodgers second baseman Howie Kendrick becomes a free agent (he will reject what’s called a “qualifying offer” from the Dodgers). He is 31, was paid $9.5 million this season, and is a rock-solid player and person. The Angels missed Kendrick badly and might be able to get him back for less than what other teams would pay him.\n• The most obvious offseason roster change for the Dodgers will be the departure of shortstop Jimmy Rollins. Rollins is a free agent, he’s 37 and the Dodgers saw that Corey Seager is ready.\n• What would Angels and Dodgers fans think if their teams traded managers?\nContact the writer: sfryer@ocregister.com", "external_links": [], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-21T08:55:18.242+03:00", "highlightTitle": ""}