{"organizations": [], "uuid": "aa8e1a7d686cb3d4cc7cf6e560cbf5797cc74db5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.htrnews.com", "main_image": "http://www.gannett-cdn.com/-mm-/56666d03bde644a33d5a4c05fd8e4e9b5d71888f/c=0-0-878-496&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/06/WIGroup/GreenBay/635797563770198250-Crivitz-at-Gillett-interception-on-fake-spike.jpg", "site_section": "http://rssfeeds.htrnews.com/manitowoc/sports", "section_title": "Manitowoc - Sports", "url": "http://www.htrnews.com/story/sports/high-school/2015/10/06/valders-boys-win-brillion-invite/73493470/", "country": "US", "title": "Gillett's Zahn makes rare INT, online splash", "performance_score": 0, "site": "htrnews.com", "participants_count": 0, "title_full": "Gillett's Zahn makes rare INT, online splash", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T02:46:00.000+03:00", "replies_count": 0, "uuid": "aa8e1a7d686cb3d4cc7cf6e560cbf5797cc74db5"}, "author": "", "url": "http://www.htrnews.com/story/sports/high-school/2015/10/06/valders-boys-win-brillion-invite/73493470/", "ord_in_thread": 0, "title": "Gillett's Zahn makes rare INT, online splash", "locations": ["Gillett"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Rick Kamps", "Brian Zahn", "Gillett", "Crivitz", "Sebastian Atwood", "Andrew Pekarek", "Zahn"], "text": "Gillett's Zahn makes rare INT, online splash Andrew Pekarek , Press-Gazette Media 6:46 p.m. CDT October 6, 2015 A screenshot of Gillett senior Brian Zahn's interception of a spike attempt attempt to stop the clock by Crivitz senior quarterback Sebastian Atwood during a M&O Conference football game last Friday. (Photo: Courtesy of Gillett football coach Rick Kamps) \nBrian Zahn made the first interception of his career on Friday. \nThe Gillett senior’s pick was perhaps the first interception of its kind as well. \nTrailing 14-6 at home against Crivitz, Zahn made a diving interception with about 15 seconds remaining in the first half to halt a drive inside the Tigers’ 10-yard line. \nThe 6-foot-1, 200-pound defensive tackle’s pick of an attempt by Wolverines senior quarterback Sebastian Atwood to stop the clock with a forceful spike on third down was nothing short of amazing. \n“I couldn’t believe it at first,” said Zahn. \n“I was at the right place, right time, with the right idea. It just all came together perfectly.” <!--iframe--> \nVideo of the play had reached over 400,000 views by Tuesday afternoon on MaxPreps.com, which voted it the No. 1 high school football play in the nation for the week. \nESPN.com and other national media outlets also posted the clip. \nThe footage of Zahn’s first career interception may have never made an online splash like it did had the Gillett three-sport athlete never posted it Saturday as his first tweet on Twitter. \n“I started it with the purpose of trying to put it on the Hudl Top 5,” said Zahn, referring to the online video scouting tool most high school teams use. \n“It has been a really cool experience to see it explode from what it was. I wasn’t going to put it anywhere at first, but then my teammates kind of told me I should because they thought it was really cool.” \nThe reaction to the interception was a positive note for the Tigers, who ultimately lost 30-6 to Crivitz in the M&O Conference game. \nThe Wolverines’ victory made it easier for Atwood to watch the rare interception again when some of his teachers replayed it on projectors in their classroom this week. \nThe 6-foot-5, 190-pound quarterback feels the ball may have hit the ground. But in hindsight, it created a memory both players and their teams can look back on after receiving national attention. \n“It was weird,” Atwood said. “We went to watch film (Monday) and logged onto our Hudl and it was there. It was weird that people started tagging me in it. All of my social media just blew up. \n“Hopefully, I’ll never have to be on that end of a play like that again.” \nGillett head coach Rick Kamps said he has never seen an interception like that before — at any level. \nBesides coaching high school football for over 20 years, Kamps has done freelance TV work for Fox Sports’ NFL broadcasts for 20 years. \n“I didn’t realize that we had the ball,” Kamps said. “I’m looking at the white hat (official) signal that we had the ball. I was just like, ‘What the hell just happened?’” \nZahn said he noticed earlier in the drive when Atwood did a spike to stop the clock the left-handed quarterback didn’t step back. \n“I thought next time, since he didn’t back up at all, I might as well try to dive for it,” said Zahn, who dove over the Crivitz’s left guard to make the interception. \n“He threw it, and it just stuck in my hands. It just stuck right there.” \nAlthough the play was shocking, Kamps wasn’t surprised that Zahn was the one to make it. \nBesides being a student with a 4.14 GPA, Kamps called Zahn a “jack of all trades.” The senior plays center, defensive tackle, long snaps and even tapes ankles for teammates. \n“He’s an incredible long snapper,” Kamps said. “He can snap it 25 yards on a dime and put it right in a player’s hands. I keep telling him that you have something these teams look for because not everybody can do that. \nIt’s likely nobody will ever be able to duplicate an interception in the same fashion Zahn did on Friday. \n“He just took a chance,” Kamps said. “He was able to take a (series) that looked like it was going to be disastrous for us and make something out of it.” \n— apekarek@pressgazettemedia.com and follow him on Twitter @andrewpekarek. 93 CONNECT 5 TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http://gbpg.net/1RsVZO6 TOP VIDEOS", "external_links": [], "published": "2015-10-07T02:46:00.000+03:00", "crawled": "2015-10-08T05:09:51.096+03:00", "highlightTitle": ""}