{"organizations": [], "uuid": "83765a79e81a78d6fa7d74d35960e296a78dabe3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "wtop.com", "main_image": "http://wtop.com/wp-content/uploads/2015/10/WNBA-Finals-Basketball16.jpeg", "site_section": "http://wtop.com/section/sports/feed/", "section_title": "WTOP » Sections » Sports", "url": "http://wtop.com/sports/2015/10/catchings-helps-fever-force-game-5-beating-lynx-75-69-2/", "country": "US", "title": "Catchings helps Fever force Game 5, beating Lynx 75-69", "performance_score": 0, "site": "wtop.com", "participants_count": 1, "title_full": "Catchings helps Fever force Game 5, beating Lynx 75-69", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T09:45:00.000+03:00", "replies_count": 0, "uuid": "83765a79e81a78d6fa7d74d35960e296a78dabe3"}, "author": "wtopstaff", "url": "http://wtop.com/sports/2015/10/catchings-helps-fever-force-game-5-beating-lynx-75-69-2/", "ord_in_thread": 0, "title": "Catchings helps Fever force Game 5, beating Lynx 75-69", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home » News » Sports » Catchings helps Fever force… Catchings helps Fever force Game 5, beating Lynx 75-69 By DOUG FEINBERG October 12, 2015 2:45 am Indiana Fever's Tamika Catchings smiles as she walks off the court after the Fever’s victory over the Minnesota Lynx in Game 4 of the WNBA Finals basketball series, in Indianapolis, Sunday, Oct. 11, 2015. The Fever won 75-69 to force Game 5 on Wednesday in Minneapolis. (AP Photo/Michael Conroy) \nINDIANAPOLIS (AP) — For the fifth time this postseason, Tamika Catchings and the Indiana Fever staved off elimination, not letting their season end. \nFirst it was rallying against Chicago in the opening round, then New York in the Eastern Conference finals. Now, the Fever have forced a decisive Game 5 in the WNBA Finals, beating Minnesota 75-69 on Sunday night. \n“We’ve had our backs against the wall this entire playoffs, we’ve responded well and have been able to come away with wins,” said Marissa Coleman, who scored 14 points for the Fever. \nIndiana is 9-2 in elimination games starting with its run to the 2012 championship when the Fever beat Minnesota. \n“We have the heart of a champion — and Tamika Catchings,” Fever coach Stephanie White said. “I really love this team.” \nGame 5 is Wednesday night in Minneapolis, where the Fever won Game 1. \n“It gives us confidence knowing that we’ve been able to win on the road all season long,” White said. “We’re happy to be playing another day.” \nCatchings had 10 points, four rebounds, two steals and two blocks. \n“Whatever it takes,” Catchings said. “Sometimes you’re not really looked at to be the scorer, other people are stepping up and doing their things, so for me it’s just a matter of, ‘What are the little things I can do to keep creating opportunities?'” \nTrailing 38-36 early in the third quarter, Indiana took control with a 13-2 run. Johnson scored the final four points of the burst. \nIndiana led 51-44 before Coleman scored five straight, including a 3-pointer with 1:28 left in the third that gave the Fever the biggest lead of the series for either team at 58-44. \n“The game was busted open with that 14-point deficit,” said Maya Moore. “We didn’t have enough to recover from that run. It was a big run and we didn’t have enough to come back.” \nThe Lynx almost did though. That 3 by Coleman was the only basket for Indiana until Shenise Johnson, who led the team with 15 points, hit a jumper with 2:39 left. Johnson’s shot was the Fever’s only field goal in the final quarter. \nIndiana hit 15 of 18 free throws in the final period, but Minnesota was able to creep closer behind Moore. Tricia Liston was fouled shooting a 3-pointer and she hit one of the three free throws. Moore grabbed the rebound on the third one and put it in to bring Minnesota within 73-69 with 16.6 seconds left. \nBriann January, who was 11 of 12 from the free-throw line, made two 3 seconds later to seal the game. \nMoore, who hit the buzzer-beater to win Game 3, led Minnesota with 20 points. Lindsay Whalen added 16. \n“Indiana played great, played like a team that didn’t want their season to end,” Minnesota coach Cheryl Reeve said. \nThis is the first WNBA Finals to go five games since 2009 when the Fever lost to Phoenix. Minnesota is trying to win its third title in five seasons. Only the Houston Comets won more in a similar stretch when they took the first four WNBA championships. \nThe Lynx won their previous two titles on the road in Atlanta in 2011 and 2013. Now they’ll have a chance to win one in front of their home fans. \n“Great opportunity for us and our fans who have been with us all season,” Moore said. “That’s the beauty of it. Be ourselves at homes. We have a really good chance if we do that.” \nIndiana was able to take advantage of foul trouble for Minnesota center Sylvia Fowles. She only played five minutes in the first half because of three fouls. She picked up her fourth early in the third, and that’s when the Fever went on their game-changing run. \nThe series had been tight through the first three games with neither team building more than a 10-point lead since early in the first quarter of Game 2. Only 15 points total separated the teams in the first three games. \nMinnesota got out to a quick 16-11 lead behind a balanced offense. Indiana trailed 24-20 early in the second quarter before Fowles picked up her third foul. The Fever then started to attack the basket, scoring 10 straight points all coming in the paint or on free throws. Johnson capped the run with two foul shots to make it 30-26. The Fever led 36-32 at the half. \nNatasha Howard provided a big spark on offense in the second quarter, scoring seven points. \n___ \nFollow Doug on Twitter at http://www.twitter.com/dougfeinberg Topics:", "external_links": [], "published": "2015-10-12T09:45:00.000+03:00", "crawled": "2015-10-12T10:16:14.490+03:00", "highlightTitle": ""}