{"organizations": [], "uuid": "e3ee76e44787a12d932938fb486c0c431da06ca6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailyherald.com", "main_image": "http://www.dailyherald.com/storyimage/DA/20151013/sports/151019483/AR/0/AR-151019483.jpg&amp;updated=201510132304&amp;imageversion=Facebook&amp;exactH=630&amp;exactW=1200&amp;exactfit=crop&amp;noborder", "site_section": "http://www.dailyherald.com/rss/feed/?feed=sports_all", "section_title": "DailyHerald.com &gt; Sports", "url": "http://www.dailyherald.com/article/20151013/sports/151019483/", "country": "US", "title": "Imrem: Schwarber provides knockout punch to Cards", "performance_score": 0, "site": "dailyherald.com", "participants_count": 2, "title_full": "Imrem: Schwarber provides knockout punch to Cards", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T07:04:00.000+03:00", "replies_count": 1, "uuid": "e3ee76e44787a12d932938fb486c0c431da06ca6"}, "author": "Mike Imrem", "url": "http://www.dailyherald.com/article/20151013/sports/151019483/", "ord_in_thread": 0, "title": "Imrem: Schwarber provides knockout punch to Cards", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A good guess is that Kyle Schwarber will be the answer to the only question remaining after the Cubs blasted the Cardinals from the playoffs.\nWhat memory of the National League division series will keep the Cards up at night over the winter?\nIt could be that the Cardinals wind up rolling around in bed counting Cubs home runs instead of sheep.\nIt could be the knowledge that the Cubs are 1-0 after their only postseason matchup ever against the rival Cardinals.\nIt could be the vision of the Cubs celebrating on the field after winning the clincher 6-4 early Tuesday evening.\nThere were Cubbie hugs and maybe a few kisses on cheeks. There were \"Go Cubs Go\" and \"Sweet Home Chicago\" blaring from the P.A. System. There was the champagne-drenched Cubs team picture in the middle of the infield.\nCubs fans were waving their white towels, and it looked like not a single soul from the crowd of 42,411 left before the party started.\nAny of the Cardinals peering out of their dugout or watching on TV in their clubhouse might be haunted by the scene all the way to spring training.\nAnother nightmare might supersede them all, however.\nThat would be the vision of Kyle Schwarber's home run in the bottom of the seventh inning, which gave the Cubs their final run of the series.\nMajor League Baseball officials still are awaiting a phone call from a Michigan resident complaining that the ball landed on his backyard deck.\nSeriously, we're talking about a shot that Schwarber launched from Wrigley Canaveral. The debate in the press box was whether the ball hit the videoboard in right field, cleared the Budweiser sign above it or is still traveling.\nThis was a home run that a combination of Popeye, Paul Bunyan and Babe Ruth might have crushed.\nThe Cubs didn't announce an estimated distance because they have no way of measuring home runs in light years rather than feet.\nFellow outfielder Dexter Fowler revealed that Schwarber called his shot.\n\"Yeah,\" Schwarber said, \" and I was just joking around. I said 'I'm going to hit a home run off this guy (Cardinals reliever Kevin Siegrist)' and he's like, 'well, do it.' There you go.\"\nAnd there it went. The funny thing is, Schwarber had trouble hitting lefties like Siegrist this season and then he hit this one to a land far, far away.\nSchwarber's homer was the exclamation point on a series in which the Cubs' young sluggers staged a remarkable exhibition of power.\nThen more than an hour after the final out, Schwarber and teammates still were celebrating the franchise's first postseason series clincher in 101-year-old Wrigley Field.\nMany of the Cubs were back out on the field from the clubhouse mugging for cameras, taking laps around the outfield track and sharing the moment with family and friends.\nThey sprayed champagne onto fans that remained behind the home dugout. Anthony Rizzo waved a \"W\" towel. Schwarber was interviewed by a TV sports anchor.\nYes, fans, the Cubs keep demonstrating that they know how to both play and party.\n\"We're going to celebrate this and hope it's a sign of things to come,\" Rizzo said of the rest of the postseason.\nMeanwhile, the Cardinals were about to head home wondering what the worst of their worst nightmares would be.\nThe best guess still is that it'll be Kyle Schwarber's home run.\nmimrem@dailyherald.com\n Columnists Sports MLB Cubs Imrem, Mike Baseball Pro Sports Newsletter Pro Men", "external_links": ["https://twitter.com/share"], "published": "2015-10-14T07:04:00.000+03:00", "crawled": "2015-10-14T20:40:17.819+03:00", "highlightTitle": ""}