{"organizations": [], "uuid": "b9ba40301394eae518b35985bc5311474278eb81", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nwaonline.com", "main_image": "http://media.arkansasonline.com/img/photos/2015/10/23/resized_99261-byant03_25-20203.JPG", "site_section": "http://www.nwaonline.com/rss/headlines/sports/prep/", "section_title": "NWAonline stories: High School Sports - Northwest Arkansas", "url": "http://www.nwaonline.com/news/2015/oct/24/bryant-s-qb-stings-van-buren-20151024/", "country": "US", "title": "Bryant's QB stings Van Buren", "performance_score": 0, "site": "nwaonline.com", "participants_count": 1, "title_full": "Bryant's QB stings Van Buren", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T10:15:00.000+03:00", "replies_count": 0, "uuid": "b9ba40301394eae518b35985bc5311474278eb81"}, "author": "Ben Cowens Special to the Democrat-Gazette", "url": "http://www.nwaonline.com/news/2015/oct/24/bryant-s-qb-stings-van-buren-20151024/", "ord_in_thread": 0, "title": "Bryant's QB stings Van Buren", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bryant's QB stings Van Buren By Ben Cowens Special to the Democrat-Gazette Posted: October 24, 2015 at 2:15 a.m. Melissa Gerrits Bryant quarterback Gunnar Burks (right) rushed for 155 yards and completed 10 of 13 passes for 126 yards and 2 touchdowns Friday night against Van Buren. \nBRYANT -- With two of its top three running backs out for the season because of injuries, Bryant quarterback Gunnar Burks knew he would be more involved in the running game Friday night Van Buren. Enlarge Bryant wide receiver Austin Kelly (left) is pulled down from behind by Van Buren defender Kameron Collins during Friday’s 7A/... (By: Melissa Gerrits) \nOffensive coordinator Lance Parker told his senior signal-caller that he might end up running the ball 25 times in the Hornets' 7A/6A-Central game against the Pointers. \n\"I knew coming into this game that I was going to have make some throws and run the football,\" Burks said. \nString plan. \nBurks rolled up 155 yards rushing on 14 first-half carries and added a touchdown pass in a convincing 30-0 victory at Hornet Stadium. \nBurks befuddled Van Buren's defense time after time. He opened the scoring 46 seconds into the game with a 45-yard run over left tackle and added a 53-yard scoring strike to Aaron Orender with 7.4 seconds left in the half. In between, he led two other scoring drives as the Hornets (7-1, 4-1) jumped out to a 24-0 lead going into halftime. \nEven with limited duty in the second half, Burks finished with 155 yards on 16 carries and was 10 for 13 passing for 126 yards with 2 touchdowns and 1 interception. \n\"He's capable of that every week,\" Bryant Coach Paul Calley said. \"We don't run him that much because we want to keep him healthy, but our backfield depth is depleted and we know we've got to have him. Tonight was a must-win game for us.\" \nBurks led a rushing attack that amassed 367 yards -- and 493 total yards -- but the Hornets defense did its part as well. Led by interior linemen Mario Waits (sack, tackle for loss) and Cameron Murray, Bryant allowed just 137 yards of offense, including 65 rushing. \n\"Defensive front, I thought they were dominating tonight,\" Calley said. \"They played tonight like I expect them to play every week. They rushed the passer. We didn't have to stunt. We didn't have to send extra people to get pressure on the quarterback. We tackled so much better on defense.\" \nBryant scored 17 second-quarter points to take control 24-0 going into halftime. Hayden Ray finished off a 10-play drive with a 21-yard field goal early in the quarter, and on the next drive junior DeAmonte Terry, who finished with 69 yards rushing, scored on a 3-yard run with 2:12 before halftime. \nBurks finished off the half with another big play, stepping up in the face of pressure and deliver a strike to Orender, who caught the ball in stride and went the last 15 yards for a touchdown. The drive covered 69 yards in 48 seconds, and Van Buren (2-6, 0-5) never recovered. \nBryant scored its final touchdown with 5:47 left in the third quarter. Burks capped the 12-play, 98-yard drive with a 12-yard touchdown pass to senior tight end Dagin Carden. \nVan Buren quarterback Jordan Barlow finished with 22 yards rushing on 11 carries and passed for 72 yards, but Van Buren never penetrated Bryant's 30-yard line. \n\"I was nervous coming into it -- I think we all were -- but we just came together and faced adversity,\" Burks said. \"We've had a bunch of injuries, but I'm glad we got it done.\" \n7A/6A-EAST \nNO. 3 CABOT 62, MOUNTAIN HOME 21 \nCABOT — Austin Morse rushed for four touchdowns in the first quarter as Cabot (8-0, 5-0 7A/6A East) ran past Mountain Home (1-7, 0-5). Morse rushed for 145 yards and scored on four of his five carries. His touchdowns came on runs of 16, 31, 51 and 24 yards. Alex Roberts also scored on rushes of 19 and 23 yards for Cabot. Adam Flores scored on a 37-yard run, Jess Reed scored on a 1-yard run and Kale Eddington returned an interception 26 yards for Cabot’s other touchdowns. Cabot led 34-7 in the first quarter and 56-13 at halftime. \nSports on 10/24/2015", "external_links": [], "published": "2015-10-24T10:15:00.000+03:00", "crawled": "2015-10-24T14:19:01.285+03:00", "highlightTitle": ""}