{"organizations": [], "uuid": "17f9c13fcaadde8fce99963a960c29145a96f235", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.aspentimes.com", "main_image": "http://www.aspentimes.com/csp/mediapool/sites/AspenTimes/assets/img/facebook-thumbnail-1200.jpg", "site_section": "http://www.aspentimes.com/csp/mediapool/sites/SwiftShared/assets/csp/rssCategoryFeed.csp?pub=AspenTimes&sectionId=972&sectionLabel=Sports", "section_title": "The Aspen Times Section RSS Feed: Sports", "url": "http://www.aspentimes.com/news/sports/18735491-113/skier-with-avsc-ties-gets-world-cup-start", "country": "US", "title": "Skier with AVSC ties gets World Cup start", "performance_score": 0, "site": "aspentimes.com", "participants_count": 1, "title_full": "Skier with AVSC ties gets World Cup start", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T07:44:00.000+03:00", "replies_count": 0, "uuid": "17f9c13fcaadde8fce99963a960c29145a96f235"}, "author": "DALE STRODE", "url": "http://www.aspentimes.com/news/sports/18735491-113/skier-with-avsc-ties-gets-world-cup-start", "ord_in_thread": 0, "title": "Skier with AVSC ties gets World Cup start", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Smaller Larger Related Media Alpine ski racer Nick Cohee, who trains with the Aspen Valley Ski Club, will make his first World Cup start for the United States this weekend in Soelden, Austria. Cohee, who is affiliated with the independent Team Geronimo, worked out and raced with the AVSC last season and his strong late-season showing earned the former University of Utah collegiate skier a World Cup giant slalom start Sunday. Cohee grew up skiing at Kirkwood, California, before racing for the University of Utah. After graduation with a degree in finance, he opted to extend his racing career. He’s now in the Team Geronimo camp, bidding to climb to the U.S. Ski Team. He’s scheduled to return to the area for training after the opening World Cup weekend. Hig Roberts of Steamboat Springs also will make his World Cup debut this weekend in Austria. He formerly raced at Middlebury College, eventually working his way up to the B team. The other Americans on the start list this weekend include Ted Ligety, Tim Jitloff, Tommy Ford and Kieffer Christianson. Ligety, the 2015 world championships gold medalist in GS, will be back in race mode along with the rest of the world’s top skiers, including Marcel Hirscher of Austria and Norwegians Aksel Lund Svindal and Kjetil Jansrud. Hirscher won the overall World Cup last year; Svindal is back from a season-long injury layoff; Jansrud was the overall runner-up a year ago. They’ll test each other Sunday in the giant slalom. Hirscher will race slalom and GS — no speed events again this season. He won the slalom and GS overall globes a year ago. Race fans are eager to follow the return of Svindal. The 2007 and 2009 overall champion tore his Achilles tendon while playing soccer a week before last season started. He sat out the entire World Cup season. But he did race in the downhill and super-G at the world championships in Beaver Creek in February.", "external_links": [], "published": "2015-10-24T07:44:00.000+03:00", "crawled": "2015-10-24T07:35:38.620+03:00", "highlightTitle": ""}