{"organizations": ["Chicago White Sox", "Texas Rangers", "Oakland", "Detroit Tigers", "Texas", "Rangers", "Astros", "Tigers", "AP", "Tigers Texas", "Los Angeles Angels"], "uuid": "597f6e0af84b68ce8ad6d28da70c24f84cd1213e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailytribune.net", "main_image": "", "site_section": "http://www.dailytribune.net//search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&nsa=eedition&c[]=sports,sports/*&f=rss", "section_title": "The Daily Tribune  - sports,sports/", "url": "http://www.dailytribune.net/sports/texas-snaps--game-losing-streak---over-tigers/article_a502f5b4-6778-11e5-b2c1-735d39e629df.html", "country": "US", "title": "Texas snaps 3-game losing streak, 7-6 over Tigers", "performance_score": 0, "site": "dailytribune.net", "participants_count": 0, "title_full": "Texas snaps 3-game losing streak, 7-6 over Tigers", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T16:39:00.000+03:00", "replies_count": 0, "uuid": "597f6e0af84b68ce8ad6d28da70c24f84cd1213e"}, "author": "", "url": "http://www.dailytribune.net/sports/texas-snaps--game-losing-streak---over-tigers/article_a502f5b4-6778-11e5-b2c1-735d39e629df.html", "ord_in_thread": 0, "title": "Texas snaps 3-game losing streak, 7-6 over Tigers", "locations": ["Seattle", "Houston", "Philadelphia", "Texas", "ARLINGTON"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hamels", "Choo", "Shawn Tolleson", "Banister", "Beltre", "Yovani Gallardo", "J.D. Martinez", "Mike Maddux", "Norris", "Ian Kinsler", "Cole Hamels", "Hamilton", "Nick Castellanos", "Shin-Soo Choo", "Martinez", "Tolleson", "Matt Boyd", "Drew Stubbs", "Victor Martinez", "Daniel Norris", "Adrian Beltre", "Stubbs", "Magglio Ordonez", "Josh Hamilton", "Jeff Banister"], "text": "Texas snaps 3-game losing streak, 7-6 over Tigers 0 comments ARLINGTON, Texas (AP) — Drew Stubbs kept running after his game-ending catch, taking a few more steps before scaling halfway up the center field wall. He was then getting a big hug for Texas Rangers closer Shawn Tolleson and plenty of high-fives. Stubbs, who had entered the game only an inning before, ran down Ian Kinsler’s drive in the right-center gap with two runners on base and the AL West-leading Texas Rangers beat the Detroit Tigers 7-6 to snap a three-game skid Tuesday night. “I was a little unsure off the bat if I was going to be able to track it down,” said Stubbs, who went up the wall in front of the Rangers bullpen. “To end it on a play like that, adrenaline more than momentum.” Manager Jeff Banister, his cap falling off his head, watched anxiously when the ball was hit. He patted pitching coach Mike Maddux on the back after Stubbs made the catch. “You hang on every single pitch,” Banister said. “To see the ball go up in the air, and see Stubbs tracking it down, there’s a little emotion going on inside all of us, and really for him to run that down the way he did, yeah we’re going to release some emotion there. We might have released some emotion if he didn’t catch it, too.” Texas has a two-game division lead over the Los Angeles Angels, who beat Oakland 8-1 later Tuesday night to take over second place from Houston. The Astros are 2 1-2 games back after losing 6-4 at Seattle. Adrian Beltre had three hits and drove in two runs, including Shin-Soo Choo when they had consecutive doubles in the fourth to break a 6-all tie. Choo also had a two-run homer in the first. Despite a shaky start to the game, Cole Hamels won his sixth consecutive decision. The left-hander retired 10 of the last 11 batters he faced and struck out eight in six innings. “I don’t think it’s one of the best starts you want to have, especially in this situation,” Hamels said. “But definitely being able to get bailed out by the team, every one of those guys in the lineup came through ... It definitely made the type of performance that I had, a little better and a little easier to move past.” Hamels is 6-1 in 11 starts since getting traded from Philadelphia at the end of July, and the Rangers have won his last nine starts after losing the first two. The lefty surpassed 200 innings for the seventh time in his career and 200 strikeouts for the fourth time. Tolleson, the closer in only his third appearance in 14 days, got his 34th save in 36 chances after giving up two hits. J.D. Martinez became the first Tigers outfielder since 2008 to reach 100 RBIs with a two-run homer, his 38th of the season, in the first. But he couldn’t reach Beltre’s flyball to right in the fourth and the ball bounced into the seats for ground-rule double. “That’s a ball that needs to caught,” Beltre said. “When he hit it, I was running and running, and I felt like I ran forever, and as I got close to the wall, I felt like the wall was a lot closer than it was.” Buck Farmer (0-4), the second of six Detroit pitchers, retired the first six batters he faced before the doubles by Choo and Beltre. SHORT START Tigers left-hander Daniel Norris was again on a pitch count in his third start back from an oblique injury. He was pulled after five perfect innings a week earlier against the Chicago White Sox at 63 pitches. Norris threw 71 pitches in only 1 1-2 innings against Texas, and only two of the six runs against him were earned. He threw 54 pitches in the first, when the Tigers made two errors and fell behind 5-2. BREAKING 100 Martinez reached 100 RBIs for the first time in his career. He has 101 RBIs, making him the first Tigers outfielder with 100 in a season since Magglio Ordonez had 103 in 2008. TRAINER’S ROOM Tigers: 3B Nick Castellanos left the game after the first inning because of a bruised right index finger. The Tigers said he’s day to day. ... Victor Martinez was out of the lineup because of a sore left quad. Rangers: Josh Hamilton wasn’t in the lineup after starting two of the previous three games. Manager Jeff Banister said Hamilton, who had arthroscopic surgery Sept. 11 for a small meniscus tear in his left knee, is not ready to start consecutive games. Hamilton stuck out as a pinch-hitter in the seventh. UP NEXT In the series finale, rookie left-hander Matt Boyd (1-5) pitches for Detroit against Yovani Gallardo (12-11), who has lost his last two decisions and tries to avoid matching his career high for losses set in 2009. Cole Hamels won his sixth consecutive decision, overcoming a shaky start to strike out eight in six innings, and the AL West-leading Texas Rangers snapped a three-game skid with a 7-6 win over the Detroit Tigers on Tuesday night.", "external_links": [], "published": "2015-09-30T16:39:00.000+03:00", "crawled": "2015-10-05T10:30:11.864+03:00", "highlightTitle": ""}