{"organizations": [], "uuid": "f17c858e2eb58eba606f844ce148a3431cedf947", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sun-sentinel.com", "main_image": "http://www.trbimg.com/img-5617efdf/turbine/sfl-ira-nba-column-101115", "site_section": "http://www.sun-sentinel.com/sports/rss2.0.xml", "section_title": "Sports - Sun Sentinel", "url": "http://www.sun-sentinel.com/sports/miami-heat/sfl-ira-nba-column-101115-column.html", "country": "US", "title": "Ira Winderman: Bosh sizes up state of small ball", "performance_score": 0, "site": "sun-sentinel.com", "participants_count": 1, "title_full": "Ira Winderman: Bosh sizes up state of small ball", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T16:40:00.000+03:00", "replies_count": 0, "uuid": "f17c858e2eb58eba606f844ce148a3431cedf947"}, "author": "Ira Winderman", "url": "http://www.sun-sentinel.com/sports/miami-heat/sfl-ira-nba-column-101115-column.html", "ord_in_thread": 0, "title": "Ira Winderman: Bosh sizes up state of small ball", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Ira Winderman) \n\"As much as he's fighting it, no, I don't have sympathy because I've been in there pretty much my whole career. It started in Toronto and they were like, 'You've got to play the five.' And I'm like, 'No, no, no.' You can fight it all you want, but he looks pretty good to me.\" \nGeorge's first two games with the big boys was a matter of extremes. His first action at power forward was against Anthony Davis, which only further had him questioning being recast. But in his second outing at the position there was a 20-point first quarter against the post-Greg Monroe Detroit Pistons, who countered with the lead-footed likes of Ersan Ilyasova and Anthony Tolliver, among others. \nBosh said being recast requires a big-picture perspective on the variety of possibilities in the upper weight classes. \n\"It's not going to be a bunch of nights where he plays a banging guy,\" Bosh said. \"I mean, there's not too many banging fours any more. I'm sure he was a little over it when it's like, 'All right, you got to guard Anthony Davis.' It's like, 'Come on man.' \n\"But we all talk about sacrificing. Sometimes small is the best lineup. And if they say, 'With this lineup, with you at the four, we're pretty good,' what can you do?\" \nWith the Heat these days, it's the opposite story. With Pat Riley loading up his roster with Whiteside, Bosh, Stoudemire, McRoberts, Chris Andersen and Haslem, what else can Spoelstra do but play big? \nIn many ways, the narratives with the Heat and Pacers are similar, former conference contenders looking to get back into the playoffs after injury-marred absences. \nBut with the Pacers slimming down their lineup and the Heat beefing up theirs, there are competing referendums on approach. Now the question is which franchise has best sized up its challenge. \nIN THE LANE \nTIME AFTER TIME: Part of the NBA's new replay protocol that has referees situated at league headquarters to expedite decisions also has referees positioning players for quick resumption of play. In other words, no bonus timeouts during what had been lengthy, on-site reviews. If it leads to speeding up games, Heat coach Erik Spoelstra said he has no issue with losing out on those extra huddles. \"Look, if we're given the chance to use an opportunity for an extra timeout, we will,\" he said. \"But all of us are in favor of anything that speeds up the game, particularly at the end. So if this ends up proving to speed up the actual time it takes to finish a game, I'm 100 percent for it. If I lose a timeout because of it, I'm for it.\" Spoelstra would take it further, adopting the rule utilized in summer league that allows a team to advance a ball to halfcourt late in games in place of one of their timeouts. \"I'm for it as coach. I'm for it as a fan. I'm for it as a member of the NBA,\" he said of the mechanism that keeps the game at speed during decisive situations. \"I think it would be better for the game.\" \nSTILL GOING: While many from the 2003-04 Heat roster that began the team's playoff revival with Dwyane Wade have moved on and out of the game, such as Eddie Jones, Lamar Odom and Brian Grant, the Butlers drafted by the team in 2002 continue to push forward. In addition to Caron Butler being locked into a new deal with the Sacramento Kings, Rasual Butler is making a bid for a final spot with the San Antonio Spurs. At 36, after playing as a contributor last season for the Washington Wizards, he has a chance. \"He's a seasoned pro in a sense that he knows himself. He knows what role he can play,\" coach Gregg Popovich told San Antonio's Express-News. \"He’s at a stage in his career where he just wants to be a part of something that's just positive and good. He obviously can shoot the basketball. If he couldn't shoot, we wouldn't be talking to him. You got to have a skill to play. For all those reasons, he's somebody that's got a great shot to make our team.\" Based on the composition of the Heat's roster, if Butler is cut by the Spurs, he could make sense for the Heat, who are limited from distance on the wing. \nTOUGH ENOUGH: Wednesday's exhibition in Louisville featured a pair of uber-confident rookies, with the Heat's Justise Winslow going against the Orlando Magic's Mario Hezonja. At one point, Hezonja stood up to Heat center Amar'e Stoudemire when Stoudemire took exception to an illegal Hezonja screen. \"I'm not allowing anybody to be offensive with my teammates and especially not with me,\" said the Croatian swingman, with Stoudemire called for a technical foul for his pushback. Scott Skiles told the Orlando Sentinel after the game that that's who Hezonja is. \"He's never going to go into a shell, I don't think,\" Skiles said. \"It's not the kind of person he is. We've talked about it. He believes he's good. He believes he belongs. Now, it's just a matter of actually proving you belong. It's great that he believes that. It's great we don’t have to pump him up and all that.\" Winslow-Hezonja could grow into something intriguing in coming seasons. \nNUMBER \n6. Jersey number LeBron James has been wearing during Cleveland Cavaliers practices and the team's public scrimmage, the number he wore in the NBA only during his four seasons with the Heat. \niwinderman@tribune.com. Follow him at twitter.com/iraheatbeat or facebook.com/ira.winderman", "external_links": [], "published": "2015-10-10T16:40:00.000+03:00", "crawled": "2015-10-10T17:52:36.513+03:00", "highlightTitle": ""}