{"organizations": [], "uuid": "c9956aef803faebd6c69d51b6676b5bad968f878", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.uniondemocrat.com", "main_image": "", "site_section": "http://feeds.feedburner.com/UnionDemocrat", "section_title": "The Union Democrat, Sonora, CA News, Sports, & Weather", "url": "http://www.uniondemocrat.com/index.php?option=com_content&task=view&id=117999&Itemid=199", "country": "US", "title": "Three men shot to death in Rail Road Flat identified", "performance_score": 0, "site": "uniondemocrat.com", "participants_count": 0, "title_full": "Three men shot to death in Rail Road Flat identified", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T15:02:00.000+03:00", "replies_count": 0, "uuid": "c9956aef803faebd6c69d51b6676b5bad968f878"}, "author": "", "url": "http://www.uniondemocrat.com/index.php?option=com_content&task=view&id=117999&Itemid=199", "ord_in_thread": 0, "title": "Three men shot to death in Rail Road Flat identified", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tori Thomas"], "text": "Three men shot to death in Rail Road Flat identified Three men shot to death in Rail Road Flat identified By Tori Thomas, The Union Democrat October 23, 2015 12:02 pm \nThe identities of three men killed Tuesday in a shooting near Rail Road Flat have been released. \nTerry Glen Looney Jr., 44, of Waterford, Wesley David Smith, 46, of Snelling, and Robert Daniel Haney, 60, of Modesto, all died of gunshot wounds, said Calaveras County Coroner Kevin Raggio. \n\nRaggio said he could not comment on how many times or where on their bodies the men were shot. \nSheriff’s deputies responded to a parcel of land at 9:20 a.m. Tuesday on the 1400 block of South Railroad Flat Road, after receiving reports of a shooting. \nUpon arrival, deputies found three men shot to death — two lying on a dirt road and the other lying off the road. \nTwo men were arrested Tuesday evening in connection with the shooting deaths. \nJeremiah Lee Barrett, 30, of Jackson, was booked on suspicion of murder and conspiracy to commit a crime. His brother, Leon Michael Grammer, 38, was booked on suspicion of being an accessory and conspiracy to commit a crime. \nThe Calaveras County Sheriff’s Office reported Wednesday morning that Grammer, who lives at the address, saw at least three trespassers on his property he believed were stealing from a medical marijuana garden. Grammer called his brother, Barrett, and asked him to come to the property. \nGrammer allegedly armed himself with a firearm and shot several rounds toward the men. After Barrett arrived, he allegedly confronted the men running on a road and shot them with a shotgun, a press statement said. \nGrammer was released Wednesday from Calaveras County Jail on $30,000 bond. \nBarrett remains in Calaveras County Jail on $2.5 million bond. Follow UnionDemocrat.com", "external_links": [], "published": "2015-10-23T15:02:00.000+03:00", "crawled": "2015-10-24T08:37:08.851+03:00", "highlightTitle": ""}