{"organizations": ["Timpanogos"], "uuid": "8c7c25e221a5b2e4447b3a6981335a7347f2f31e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deseretnews.com", "main_image": "http://img.deseretnews.com/images/article/hires/1614577/1614577.jpg", "site_section": "http://deseretnews.com/sports/index.rss", "section_title": "Sports news and headlines for the Utah Jazz, BYU Cougars, Utah Utes and high schools, Salt Lake City sports, Utah sports  - Deseret News", "url": "http://www.deseretnews.com/article/865639605/4A-cross-country-Timpanogos-dominates-by-winning-both-boys-and-girls-titles.html?pg=all", "country": "US", "title": "4A cross country: Timpanogos dominates by winning both boys and girls titles", "performance_score": 0, "site": "deseretnews.com", "participants_count": 0, "title_full": "4A cross country: Timpanogos dominates by winning both boys and girls titles | Deseret News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "8c7c25e221a5b2e4447b3a6981335a7347f2f31e"}, "author": "", "url": "http://www.deseretnews.com/article/865639605/4A-cross-country-Timpanogos-dominates-by-winning-both-boys-and-girls-titles.html?pg=all", "ord_in_thread": 0, "title": "4A cross country: Timpanogos dominates by winning both boys and girls titles", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Alek Parsons", "Ogden", "Kate Hunter", "Timpanogos"], "text": "Timpanogos took home both the boys and the girls team titles at the 4A cross country state championships. Individually, Ogden's Alek Parsons and Provo's Kate Hunter dominated the boys and girls fields, respectively.\nMore Coverage 1A state cross country championship: Streaks end, course records and a four-peat champ Plenty of repeats for Millard, North Summit at 2A cross country state championship 3A cross country race featured first-time champions, repeat titles and controversy Cross country: Davis earns boys title while American Fork wins girls title 4A boys team results \n1. Timpanogos, 42\n2. Ogden, 65\n3. Olympus, 76\n4. Orem, 171\n5. Woods Cross, 196\n4A girls team results \n1. Timpanogos, 69\n2. Mountain View, 88\n3. Skyline, 120\n4. Timpview, 129\n5. Bonneville, 150\nAfter struggling to lead her girls cross country team to a state title for 14 years, Timpanogos coach Jody Benson is happy to finally have a championship.\n“We’ve had plenty of years as the bridesmaids and now we’re finally the bride,\" Benson said. “It was so emotional. It’s been a long time coming.”\nOn Wednesday on a new course at Sugar House Park, Timpanogos took home the 4A girls cross country state title while Provo’s Kate Hunter was the individual winner for the second straight year.\nOverall it was a solid day for Timpanogos as the boys team also took the 4A boys title, winning their second title in a row. Ogden’s Alek Parsons won the competitive 4A individual title, beating out Timpanogos’ William Handley and East’s Garek Bielaczyc.\nTo win its first girls title, the Timberwolves, who never really had a runner who stood out as the team’s best during the season, put together a strong team effort.\nThe Timberwolves were led by Julieta Navarrete-Lamas who took eighth place with a time of 18:55.5.\n“She’s been our leader and our captain as a senior and she ran an incredible race,” Benson said.\nMeanwhile, teammates Taylor Viertel, Erin Anderson and Rebekah Christensen finished in 13th, 15th, and 16th place, respectively. Madison Moffitt was the team’s fifth-best finisher at 25th place rounding out the consistent team performance.\n“They ran as a team. They didn’t really have their set spots on the team they just ran where they felt where they needed to run” Benson explained.\nMountain View came in second place led by freshman Mimi Miyazawa who took third place individually while Skyline took third as a team.\nProvo’s Hunter took home her second straight individual title as she finished with a time of 18:15.9, nearly 16 seconds better than Olympus’ Olivia Hoj.\nHunter was pleased by her performance and said that this year things were a little bit more relaxed for her despite the depth of the field.\n“Last year I had no idea what to expect. I didn’t think I would win so last year was more exciting but this year I am really happy because there were a lot of good runners this year,” Hunter said.\nThe boys portion of the state tournament was highlighted by a close race by Parsons, Handley and Bielaczyc. Each is ranked in the top 20 in the nation for cross country runners. Parsons is ranked the highest at sixth while Bielaczyc is seventh and Handley is 17th. Throughout the year, the three have been battling for supremacy and Wednesday it was Parsons who came out on top.\nWith about 500 meters left, Parsons was being closely followed by his competitors and he decided to turn it up a notch. Parsons established a comfortable lead from there and coasted to a five-second victory. Parsons finished at 14:58.9 while Handley had a time of 15:03.9 and Bielaczyc ran a 15:05.2.\n“I knew that I could compete with anybody here,” Parsons said. “This is my first state title so it’s definitely really exciting.”\nMeanwhile, Timpanogos took the team title by a narrow margin over Ogden and Olympus giving the school and coach Benson their second team title of the day.\n“We knew Ogden was going to be tough and that Olympus was going to be tough and so we had to make sure that our boys did their job,” Benson said. “Our seniors really stepped up.”\nThe Timberwolves were pleased to repeat last year’s success despite losing three runners from 2014.\nNext year should look very different, however, as Parsons, Handley and Bielaczyc each will graduate in 2016 while Timpanogos will, in addition to Handley, lose three runners to graduation. Ogden, on the other hand, is only losing one more senior in addition to Parsons.\n4A boys results \n1. Alek Parsons, Ogden, 14:58.9. 2. William Handley, Timpanogos, 15:03.9. 3. Garek Bielaczyc, East, 15:05.2. 4. Joe Benson, Timpanogos, 15:09.3. 5. Garrett Barton, Ogden, 15:24.4. 6. Max Spence, Olympus, 15:36.6. 7. Grant Gardner, Springville, 15:40.1. 8. Denver Perry, Bonneville, 15:42.2. 9. Gabe Prettypaint, Timpanogos, 15:43.7. 10. Travis Feeny, Ogden, 15:46.4.\n4A girls results \n1. Kate Hunter, Provo, 18:15.9. 2. Olivia Hoj, Olympus, 18:31.2. 3. Mimi Miyazawa, Mountain View, 18:35.1. 4. Julie Sumison, Springville, 18:36.4. 5. Haley Johnston, Salem Hills, 18:48.7. 6. Camille Winterton, Skyline, 18:50.5. 7. Abby West, Wasatch, 18:53.3. 8. Julieta Navarrete-Lamas, Timpanogos, 18:55.5. 9. Pearl Harvey, Wasatch, 18:58.1. 10. Elina Magistro, Mountain View, 18:58.4.", "external_links": [], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-22T17:31:09.989+03:00", "highlightTitle": ""}