{"organizations": ["AP", "Warren Hills Regional High School"], "uuid": "31b136f6eec38ac78def19def427f6924c0682d4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mycentraljersey.com", "main_image": "http://www.gannett-cdn.com/-mm-/b4651addda439258e0c66054fa892aaaee8f3247/c=0-160-2100-1341&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/05/Bridgewater/B9319148186Z.1_20151005194607_000_G7GC5A9DV.1-0.jpg", "site_section": "http://rssfeeds.mycentraljersey.com/bridgewater/sports", "section_title": "Bridgewater - Sports", "url": "http://www.mycentraljersey.com/picture-gallery/sports/high-school/soccer/2015/10/08/east-brunswick-hosts-monroe-soccer/73617942/", "country": "US", "title": "Are abdominal injuries football’s next concussion story?", "performance_score": 0, "site": "mycentraljersey.com", "participants_count": 0, "title_full": "Are abdominal injuries football’s next concussion story?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T02:50:00.000+03:00", "replies_count": 0, "uuid": "31b136f6eec38ac78def19def427f6924c0682d4"}, "author": "", "url": "http://www.mycentraljersey.com/picture-gallery/sports/high-school/soccer/2015/10/08/east-brunswick-hosts-monroe-soccer/73617942/", "ord_in_thread": 0, "title": "Are abdominal injuries football’s next concussion story?", "locations": ["USA", "Washington", "N.J."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Larry Murphy/Lehighvalleylive", "Murray", "Evan Murray", "Kristine Meldrum Denholm"], "text": "Are abdominal injuries football’s next concussion story? Kristine Meldrum Denholm, Special for USA TODAY Sports 7:50 p.m. EDT October 5, 2015 In this Sept. 25, 2015 photo, Warren Hills Regional High School quarterback Evan Murray looks over the Summit defense in Washington, N.J. Murray, a three-sport athlete, died after suffering an injury on the field, school officials said Saturday, Sept. 26. (Larry Murphy/Lehighvalleylive.com via AP) MANDATORY CREDIT (Photo: AP) 1 CONNECT 2 TWEET LINKEDIN COMMENT EMAIL MORE \nAt Taylor Haugen’s first game of the year, in 2008, the Niceville (Fla.) Eagles were playing their rival. The sophomore wide receiver reached up to catch a pass and was pummeled from the front and back. He tried to join the huddle on the next play, but struggling, his coach called him off the field. \nHer child wincing in pain, Kathy Haugen rushed to the fence behind the sideline. “When he came off the field, I knew. I just knew,” she said, describing her son as pale and gray. The team doctor believed it was an internal injury. \n“I was devastated. He lost consciousness in the ambulance, and never regained it,” she said, her voice trailing off. \nBrian Haugen, a lieutenant colonel in the National Guard at the time, was in Mobile, Ala., deployed for Hurricane Gustav. His phone lit up. “I knew they were calling to tell me he caught a TD pass. I was convinced,” he recalled. \nWhen the news hit him that his only son’s injuries were serious, he drove “at a speed beyond legal limits” and reached the hospital, where surgeons were trying to save his son who had suffered a massive liver rupture. Kathy Haugen said Taylor was given 42 units of blood. \n“The surgeons said it was like trying to sew Jello,” Kathy said. \nThe doctors faced the family with the news they had done all they could. They shut off the machines the next morning. Their son had died playing the sport he loved. \nThe Haugens were forced to relive their own family tragedy as they heard about the death of Warren Hills (N.J.) Regional quarterback Evan Murray after a game last Friday. The Morris County Medical Examiner’s office ruled last week that Murray’s death was caused by a massive abdominal hemorrhage and enlarged spleen. Teammates said that he took a helmet to the stomach earlier in the game before he went down and later collapsed on the sideline. \n“Our hearts and prayers go out to their family and team in their loss. It reaffirms our facts that abdominal injuries are more common than people suspect,” said Brian Haugen. “My thoughts went immediately out to the parents because I can’t wrap my head around what they’re going through.” \n“It’s hard not to relive it…it’s heartbreaking it’s taken another tragedy to bring more light to it, to how frequent these [abdominal] injuries are,” said Kathy Haugen. “We’ve been told … it’s not a really big problem, that what happened to Taylor was ‘lightning in a bottle.’ But abdominal injuries have never been tracked.” Mid-State 38 and GMC football players to honor Evan Murray \nThe Haugens do not want their only child’s death to be meaningless. They’re on a mission to warn others. But they don’t want parents to prevent their children from playing sports, just to equip them, and to determine how common football deaths from these types of injuries are. \nThe Haugens believe abdominal injuries are the “third wave” of injuries brought to the public’s consciousness: after heat stroke and concussions have been acknowledged and treated as a serious problem, now abdominal injuries in sports should be considered. \n“I believe the issue is here, looking at the way tackling is going,” said retired NFL kicker Matt Stover, who is an investor in a product the Haugens support called EvoShield shirt, which helps provide protection. “The types of tackles are getting lower, in avoiding hits to the players’ head, players are dropping down. It’s less at the shoulders now. \n“Though not common, there have always been injuries to spleen or bruised kidneys. When I was playing, I remember a hit Ray Lewis took to the back, which was a compartmentalized injury.” Lacerated spleen caused NJ high school quarterback's death \nRunning backs and wide receivers in college and the NFL are wearing rib protectors, back plates and other equipment that used to be reserved for quarterbacks in order to help absorb hits from defenders. Those added pieces of equipment are less common in high school and youth football. \n“(College and NFL players) are loading up on every kind of protection with good reason,” said Terry O’Neill, a former NFL executive who founded Practice Like Pros, a program that brings coaching techniques used in college and the NFL to high schools. “What defensive coaches in the NFL call the ‘strike zone’ or the ‘hit zone’ has been reduced. It’s like a baseball strike zone from the shoulders to the knees. There’s a lot more contact in that area and offensive players are trying to protect themselves more and more.” \nCollecting data \nKathy Haugen says she gets calls “all the time” hearing not of deaths but of athletes’ abdominal injuries, including in lacrosse or rugby, and acknowledges the lack of data in high school athletes’ abdominal injuries. \nThe data is inconsistent in reporting, said Dr. John Todorovich, department chair for health, leisure and exercise science at the University of West Florida. \n“Some doctors may report a liver laceration, and some not,” he said. “The trouble is in getting data, seeking out and figuring out a protocol. When does [the injury] become a reporting issue? For a bruise? For a visit to the ER?” \nThe university received a grant from the foundations that the Haugen family formed, the Taylor Haugen Foundation and Youth Equipment for Sports Safety (YESS) and is now studying the degree athletes understand the risk of injury, and how they pursue protective behaviors. Another concern is the long-term effects. \n“We don’t know the long-term effects of abdominal injuries. Just like we didn’t know the long-term effects of concussions,” said Kathy Haugen. Three weeks, three communities, three high school football player deaths \nDr. Rick Figler, the Center for Cleveland Clinic Sports Health and a team physician for Solon High School and John Carroll University, said most liver injuries will stop bleeding but it depends where the injury is on the liver. More common serious abdominal injuries are to the spleen and kidneys, he said. Other common injuries include abdominal wall injuries, like when hit by a hockey puck or baseball. \n“My heart goes out to them,” Figler said. “You don’t send your kids out to the field to have this happen.” \nHe also noted illness, like mononucleosis, can cause a player’s spleen to enlarge, a higher risk for injury. They advise those patients to wait a month before heading back to practice. The medical examiner’s office in New Jersey ruled Murray had an enlarged spleen but did not release information on why Murray’s spleen was enlarged. The office declined to provide further information. \nBut Figler cautioned overall youth sports league decisions — like on mandatory equipment — be made using scientific evaluations. “We want to look at science in sports,” he said. “Who’s at higher risk? How can we make the risk lower?” \nThe National Center for Catastrophic Sport Injury Research at The University of North Carolina at Chapel Hill reported there were six direct deaths in 2014 in football at all levels, five in high school football. (It doesn’t include indirect deaths, such as heat stroke.) Yet there have been three deaths in high school football just in the past month of 2015. \nLooking for solutions \nTwo years after Taylor’s death, Kathy said her fog started to lift, and she started researching to help others. “I have to make his death mean something,” she said. \nBrian Haugen said that year, two local players suffered severe abdominal injuries. \n“One with a ruptured spleen and another with a liver laceration, where the athlete had to lay still for 3 months while the liver regenerated. That was a knock on the door to us. As a Christian, I think it was the good Lord smacking us across the heads, saying, ‘are you going to do something about this now?” \nAnd so they did. The Haugens formed the foundations to educate and equip young athletes. \nThey discovered not only are the pros and college athletes wearing padded shirts, some of Taylor’s teammates had been wearing padded shirts. They hadn’t known that option existed. \n“I got gypped as a parent,” said Kathy. “I didn’t get to choose whether we put this on him or not.” \nThe Haugens put their backing behind the EvoShield shirt, which the athlete custom molds to his body, outfitting more than 2,500 youth athletes with it. Other padding exists, like those made of plastic or liquid. Nike, Under Armour, EliteTek, Rawlings are just a few other brands in the market. \nSeeing the evolution of tackling in the NFL first-hand, Stover’s instinct as a father kicked in and made him look more closely at safety in youth sports. He wanted his lacrosse-playing son, who now plays for Loyola University in Maryland, to be protected in his early teen years. \n“As my son played lacrosse as a goalie, I would cringe,” he said. “I’d look at these kids now playing division 1, and they were taking 80-90 mph balls at 14, 15 years of age.” \nHe not only outfitted him with padded shirts, he also became a part-owner of EvoShield. \n“It’s kind of a Kevlar, where the ball/helmet hits the pad, and its force disperses instead,” Stover said. “Parents feel better. I went from cringing to ‘he’s good.’” \nStover said the NFL’s role includes watching illegal hits. “We’ve got to make sure the quality of the game is at its highest level, and that begins at the NFL level. And the NFL has done an excellent job to preserve the game, and it trickles down.” \nCommunities need to hold sports programs to high standards to protect players, he added. His 12-year-old son’s team now has three referees. “Your league, refs, coaches have to be excellent. It has to be held to highest standards and highest responsibility.” \nSafety is also at the forefront of the Haugens’ minds. The couple — who Stover thinks “the world of” — say they had paid $150 for Taylor’s cleats. They question why they didn’t know they could’ve also gotten a shirt, too, to help protect Taylor down to his waistline. \n“I’d just like to see every secondary school athlete in contact sports protected,” Taylor’s mom said. “That would be a great thing to happen.” 1 CONNECT 2 TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http://mycj.co/1RryjJW TOP VIDEOS", "external_links": [], "published": "2015-10-06T02:50:00.000+03:00", "crawled": "2015-10-09T03:14:49.957+03:00", "highlightTitle": ""}