{"organizations": [], "uuid": "cb6484e97a7cfd211088d00141153d05dd2a8f37", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.completesportsnigeria.com", "main_image": "http://www.completesportsnigeria.com/wp-content/uploads/2015/10/amuneke131.jpg", "site_section": "http://www.completesportsnigeria.com/?feed=rss2", "section_title": "Complete Sports Nigeria", "url": "http://www.completesportsnigeria.com/amuneke-eaglets-can-win-u-17-world-cup-outside-asia/", "country": "US", "title": "Amuneke: Eaglets Can Win U-17 World Cup Outside Asia", "performance_score": 0, "site": "completesportsnigeria.com", "participants_count": 1, "title_full": "Amuneke: Eaglets Can Win U-17 World Cup Outside Asia", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T18:05:00.000+03:00", "replies_count": 0, "uuid": "cb6484e97a7cfd211088d00141153d05dd2a8f37"}, "author": "Prince Imehiron", "url": "http://www.completesportsnigeria.com/amuneke-eaglets-can-win-u-17-world-cup-outside-asia/", "ord_in_thread": 0, "title": "Amuneke: Eaglets Can Win U-17 World Cup Outside Asia", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "October 14, 2015 ↔ no comments Amuneke: Eaglets Can Win U-17 World Cup Outside Asia Share Tweet + 1 Mail \nFormer Super Eagles star and now Golden Eaglets head coach Emmanuel Amuneke, who was an assistant coach the last time Nigeria won the FIFA U-17 World Cup in the United Arab Emirates in 2013, reveals his visions and dreams to the Nigeria Football Federation website as he leads the champions to the defence of their title in Chile … \nThenff.com: It has taken you a long road to be here, and the moment of truth is here for you…how do you feel that you will be leading Nigeria to the FIFA U-17 World Cup in Chile? \nFirst and foremost, I want to thank God that has been there every step along the journey since we started in 2014. I consider it as a privilege to serve the country in another capacity and we have done so with all sense of responsibility. I was clear in my thoughts about what I needed to do by assembling a team that would be able to secure a ticket through the African qualifiers. It was not easy initially because we had to build the team from one stage to another and eventually we qualified for the African U-17 Nations Cup in Niger and eventually, we also qualified for the World Cup in Chile. But it was not easy along the way; all along, I knew we had to be firm and strong in our decisions because the process at this category is full of many difficulties. So right from the start, we assumed the responsibility of doing things in the right way and to the best of our abilities. We were fair and just in all our decisions leading to this stage and it is our prayer as a team that God will crown all our efforts in Chile. We are set for the World Cup and I would be delighted if the players can put on display all that we have taught them in Chile; and we are optimistic that we are going to have a good tournament. \nMany people were of the view that you struggled to qualify for the World Cup by coming fourth at the U-17 AFCON in Niger Republic. Has this in anyway affected your confidence? \nWith all modesty, I think we have done reasonably well looking at our circumstances. This process has been long; we started with a lot of players and along the line we were unable to use some of them in Niger Republic because of one reason or the other. In fact, some of our key players were affected by the MRI (Magnetic Resonance Imaging) test two weeks to the tournament in Niger Republic and we had to just work with the rest of the group to ensure that we qualified for the World Cup in Chile as the defending champions. I think we did our best in Niger bearing in mind that of all the four teams that represented Africa at the last World Cup in the UAE were in Niger Republic. We are the only one going to Chile and that, to me, is an achievement. Having said that, we have been working hard to correct some of the problems we had in Niger and we are hopeful that the new players we have added to the team would give us what we want; and add more value to what we already have on the ground by the time we get to Chile. \nSo what has changed since Niger 2015 in February and what is the difference between the team you took to Niger Republic and the team you have picked for the World Cup in Chile? \nAs I said earlier on, we actually lost most of our key players, especially due to the MRI test, going to Niger and that affected our overall performance. We missed the quality of several players in the attacking midfield and defence but all that is in the past now because we were still able to qualify for the World Cup in Chile, which was our sole objective going to Niger. People might feel our best was not good enough in Niger but I think the players gave their best though their best was not enough to win the tournament. The World Cup in Chile is here and we are mindful of the fact that we are going to play our first game against the USA on October 17; and we are working very hard. Hopefully, the image we gave at the African championship would be very different from what we are going to see in Chile and I’m positive that we are going to do well in Chile. \nWhat gives you this kind of confidence going forward to Chile? \nI have always believed in myself and in my team; I believe in the players that I have and in what I’m doing. I have constantly transmitted the same confidence into them so that they can have the same self-belief in their abilities in order to represent the country very well. We have told the players that it was a rare privilege for them to be picked to represent the country at this level and I’m confident that those that we have picked will do their best in Chile. We have some good players in this team but what is important to me is how to see them play as a team and function effectively; we want to see them perform effectively when they have and they don’t have the ball and if they can be able to do this, our job is half done. \nWhy the emphasis on team work ? \nMy belief is that a team must play collectively because we have passed the era where you rely only on one player to carry the team. Even those who are sitting on the bench are part of the project and as such, I always want to look at the totality of my team and how each player in different positions would function. Though you must have two or three quality players in a team, essentially, I always want the players to function as a team rather than as individuals. If we can function effectively, it allows the individual players to bring out the best in them. \nDo you agree with the opinion that Kelechi Nwakali and Victor Osimhen are the best players in your team? \nI don’t have to agree or disagree with people’s opinion on such matter but I think this team is not based only on Nwakali and Osimhen; we have other good players in the team, but I don’t always like to talk about individual players; we should not forget that these are players just growing up and we should not put too much pressure on them. I want all the players to work for each other; play as team and that is the only way we can get the best out of them. People easily mention Nwakali and Osimhen because they have been with us for a very long time but in the process of building this team, we have seen other good players. I just want all our players to go out there and do their best and by the time the tournament kicks off on the 17th, Nigerians would see and identify more talents in the team. \nMost Nigerians usually compare your team with the 2013 World Cup-winning team of which you were an assistant coach. What is the difference between that team and the present team you are taking to Chile? \nFrankly, I don’t always want to go into this kind of argument or comparison because it is difficult to change what people believe particularly for those who lack the wisdom to know that no two teams are the same. Though many people would not give us credit, this team has performed creditably well under very peculiar circumstances that I don’t even want to talk about. But this is a team that has been competing right from the beginning of our campaign in 2014; and any decent follower of the team will appreciate what we have done, though we never had the luxury of long time camping like the last team. I really want to thank all the players that went through the process with us until we arrived at this final stage…because without them, we would not even be talking about going to the World Cup in Chile. We were less than three weeks in camp when we went to the WAFU U-17 tournament with players coming from all kinds of academies where they were not properly trained but I must give credit to them for always rising up to the occasion and meeting our own high expectations. Of course, we are always proud of the kind of players we had the last time but are we going to approach the tournament in Chile with the same philosophy with a different set of players? By now, all the other teams must have defined how we play in terms of style and tactics but we must design another way of achieving the same goal with a new set of players. Agreed, African players have natural abilities but our emphasis now is to ensure that we function as a unit because the kind of attention we are going to get in Chile would be different from what we got in 2013 in the UAE. I don’t always want to compare teams because no two teams are the same. Every team has to write its own history. \nWhat kind of history do you want to write with this team? \nWe want to defend the Cup we won in 2013 with the best of our abilities; but in the process, we want to see the team play very well and for the players to really enjoy themselves in Chile. \nA lot of players have passed through the process since you started in 2014, so what factors determined the final 21 players you picked to represent Nigeria in Chile? \nWe picked players basically on what we called Three As: Ability; Attitude and Approach. Apart from that; we also looked at their vision; intelligence and above all; you know a player must also be eligible by passing the MRI (Magnetic Resonance Imaging) Test before he can even be considered. We looked at what players that were available can add to the team and we have selected these boys in all fairness. We asked ourselves (I mean the coaching crew) salient questions before we eventually picked each of the players. Though I’m the Head Coach, it was a collective decision when picking the players and individually, I asked “why do we want to pick this player and what value can he add to the team.” We were objective and open-minded in our approach. The selection of the players had nothing to do with where he is from or from where he is coming from. I’m not going to play as the coach and we just have to pick the players who are going to give us their best on the pitch. \nHow do you react to the allegation that most of the players you selected came from a particular section of the country? \nFrankly, this is another thing I don’t always want to talk about because my conscience is clear that we have done everything humanly possible to pick the best players and not based on where a player comes from. Last time, we had so many players from the Northern part of the country but they were not picked because they were from the North. Rather, they were picked because they were the best players available to us at that time; players like the captain Musa Muhammed, Bello Zaharaddeen, Musa Yahaya and others. But they were the best available at that time. Of course, I know we are divided with tribal sentiments in Nigeria but football is about the only thing that unite all of us. But we all know that merit comes before any other factor when it comes to football and that is exactly what we have done. \nWhat does it mean to you that you are leading a team to the World Cup as a coach after playing at the World Cup as player in the 1990s? \nThis is another privilege and I’m always grateful that I was given the opportunity to represent the country as a footballer. And many years after, I have also been given the responsibility to represent the country as the coach to the FIFA U-17 World Cup Chile 2015. But it is also a huge responsibility. I’m hoping for good results in Chile because we have worked very hard along the way. \nDoes you being a former African Footballer of the Year an inspiration to your players or is it a burden because of your high demands? \nIt is never a burden because I don’t see myself as a former African Footballer of the Year before my players. I’m just their coach; and with the other officials, we are like fathers to these young boys. As such, we have to bring ourselves down to their level and my thought is to help these boys to write their own story. We have to encourage them and when the need arises, we have to also discipline them because in the final analysis, we want them to be good human beings and good footballers too. \nWhat would be a good tournament for you at the FIFA U-17 World Cup Chile 2015? \nWe can’t sit down here and be predicting the outcome of matches we have not played but it's our responsibility as a team to go out there and do our best. All the 24 teams going to the tournament has one objective in mind and that is winning the cup. After all said and done, we pray for good luck too because that is also important. \nNigeria will start against USA on October 17, what are your thoughts few days away? \nHonestly, we want to start the tournament on a winning note though it is not as easy as that. Every first match is crucial and it would be great if we can win our first match. We have to channel our thoughts and plans to that first game because it would help in consolidating our position in the other matches. \nAs part of your preparation towards the Wold Cup, you were in the Suwon Four-Nation Tournament where your team played against Korea, Brazil and your group phase rivals in Chile, Croatia; how important was your participation in that tournament? \nThe Four-Nation Tournament in Suwon was a very good preparation for us because it gave us an insight into the quality of opposition and standard we are likely to see in Chile. We drew 1-1 with Korea; beat Brazil 2-1 and lost 3-2 to Croatia. But we were happy with the response of the players because they were able to show some of the things we had been teaching them in training. We have seen Croatia and they also have seen us and it means we are not going to be new to each other in Chile. We are also here in Argentina and we have also seen their own team and that also give us an idea about the quality of opposition we are likely to see in Chile. \nTalking about preparation, is there anything you would have loved to do differently ahead of the World Cup? \nPerhaps, it would have been great if we had arrived at our pre-World Cup training camp in Argentina earlier, but nevertheless we have been able to make the best use of our time there. It was good we went there because we have been able to adjust to the weather which is similar to what we are going to experience in Chile. \nNigeria have won this tournament four times in the past and incidentally all the four titles were won in Asia which has about similar weather condition with Africa. Would the cold weather in South America and Chile hinder your dream of winning Nigeria’s fifth title? \nWe are positive about our chances in Chile and I think you can win a match or tournament irrespective of where you played. Nigeria hosted this tournament in 2009 but it was a European side, Switzerland, that won and they beat Nigeria in the final; that is a good example that we can deal with. \nWhat are the strengths and weaknesses of your team? \nIf I should be telling you the strengths and weaknesses of my team, I no longer have a job and that means I’m exposing myself… \nWhat is your coaching philosophy? \nI want my players to be responsible and enjoy their game…football is an art. Football talent is a gift from God and I want my players to be able to express their talent and be disciplined while expressing themselves. I love my team to be well organised though it is sometimes difficult because of the level of assimilation of players at this age category. So we must be responsible; defend collectively and organise ourselves so well that opponents cannot easily break us. We must assume responsibility as individuals and as a team. \nStarting out, who were the coaches that inspired you to join the train after you retired as a player? \nI had to think very hard and for a long time, before I eventually decided to become a coach. I wasn’t sure initially and had to ask myself series of question but once I was convinced, there was no going back. I obtained my licence in Spain because it was not enough to say ‘I was a former player’ to be able to impart knowledge … along the line I was invited to Saudi Arabia where I worked as an assistant to Jose Morales who was then at Al-Hazm; he had assisted Jose Mourinho at Benfica and I really enjoyed my time with him. I learned so much under him especially how I can be able to manage up to 50 players in a session. It was a huge privilege to work under him and this has really helped me in my career as a coach. \nYou have faced a barrage of criticisms on this job, which one bothers you most? \nNone. \nWhy? \nThis is who I am…I don’t allow things I can’t control to bother me. People who lack wisdom are free to say anything they like about me but it doesn’t bother me once my conscience is free. Such people can never see what is right in what we are doing, those who criticise are people who do not even have faith in themselves.", "external_links": [], "published": "2015-10-14T18:05:00.000+03:00", "crawled": "2015-10-14T19:31:53.433+03:00", "highlightTitle": ""}