{"organizations": [], "uuid": "b5b9af6c4648d6b0fb771ee066a8f1a87680ccb1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/49348179.cms", "site_section": "http://timesofindia.indiatimes.com/rssfeeds/4719148.cms", "section_title": "The Times of India Sports: Extensive sports coverage, key statistics and free downloads", "url": "http://timesofindia.indiatimes.com/sports/boxing/13-officials-certified-to-conduct-IBC-bouts/articleshow/49347365.cms", "country": "IL", "title": "13 officials certified to conduct IBC bouts", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "13 officials certified to conduct IBC bouts - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T13:37:00.000+03:00", "replies_count": 0, "uuid": "b5b9af6c4648d6b0fb771ee066a8f1a87680ccb1"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/sports/boxing/13-officials-certified-to-conduct-IBC-bouts/articleshow/49347365.cms", "ord_in_thread": 0, "title": "13 officials certified to conduct IBC bouts", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW DELHI: Thirteen officials and doctors were certified to conduct in professional bouts, to be held under the aegis of the Indian Boxing Council from December, in a workshop in Pune.\n\n\"The IBC is committed to training and developing an entire platform which can start producing true Asian champions and world champions in the next few years,\" IBC president Brig (Retd) P K Muralidharan Raja said in a statement.\n\nThese officials were given their \"IBC Technical Official Badges\" during a three-day certification examination, held at Pune.\n\nThey were certified as two star and one star grades based on a stringent criteria which involved testing their practical and theoretical knowledge as well as submission of their credentials from their previous amateur boxing experience.\n\n\"The integrity of the entire boxing industry starts with the excellent, quality, knowledgeable and dedicated ring officials. With this certification clinic, we at IBC have begun our journey towards projecting India as a world leader in the sport of pro boxing,\" Brig Raja said.\n\nChairman of the ring officials commission of IBC, Mr Gaive Nagporewala, who has also officiated as a referee & judge at the Sydney Olympics in 2000 added, \"The Indian Boxing Council (IBC) expects uniformity in actions, responsibilities, duties and performance by its IBC Qualified Ring officials. These workshops and certifications of all ring officials will establish minimum standards and define the criteria to be followed during professional boxing matches organized under the aegis of IBC.\" \n\nChairperson of the IBC medical commission, Dr Sanjogita Soodan another seasoned boxing official who has certified two senior MBBS doctors as ringside doctors said, \"boxing is a an extremely dangerous sport, hence it has to be very ably supported by a strong medical commission which shall also oversee the anti-doping regulations mandated by NADA and WADA. We shall ensure a safe and a clean sport for the boxing enthusiasts in India who can now witness high quality and adrenaline pumping contests similar to pro boxing around the world.\"\n\nList of Officials qualified are as under: \n\n\nOFFICIAL UNIT QUALIFIED AS Manoj Panwar (DEL) Referee - 2 Star Capt. Phad Padmakar (MAH) Referee -2 Star Rajan Sharma (J&K) Referee - 2 Star Capt. B B Thapa (MAH) Referee - 1 Star Arjun Bhuyan (ORI) Referee -1 Star Dr. Pradeep Lenka (ORI) Referee - 1 Star Lokendra Painoli (MAH) Judge - 2 Star Col. Jayakumar (KER) Judge - 2 Star Vinod Saini (DEL) Judge - 2 Star Parveen Kumar (HAR) Judge- 1 Star Sanjay Kumar (HAR) Judge - 1 Star Col Ashwani Kumar Mehta (DEL) Ringside Doctor - 2 Star Lt .Col Vivekanand Upadhyay (BIH) Ringside Doctor - 2 Star \nStay updated on the go with Times of India News App. Click here to download it for your device.", "external_links": [], "published": "2015-10-14T13:37:00.000+03:00", "crawled": "2015-10-14T11:41:52.205+03:00", "highlightTitle": ""}