{"organizations": [], "uuid": "2d24df2883fb6f0658a7ba762960484b8280c174", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mercurynews.com", "main_image": "http://local.mercurynews.com/common/dfm/assets/logos/1200x627/mercurynews.png", "site_section": "http://feeds.mercurynews.com/mngi/rss/CustomRssServlet/568/200904.xml", "section_title": "Other Sports", "url": "http://www.mercurynews.com/sports/ci_28960816/baseball-mets-fans-jeer-dodgers-utley?source=rss", "country": "IL", "title": "Baseball: Mets fans jeer Dodgers' Utley", "performance_score": 0, "site": "mercurynews.com", "participants_count": 1, "title_full": "Baseball: Mets fans jeer Dodgers' Utley", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T07:32:00.000+03:00", "replies_count": 0, "uuid": "2d24df2883fb6f0658a7ba762960484b8280c174"}, "author": "Associated Press", "url": "http://www.mercurynews.com/sports/ci_28960816/baseball-mets-fans-jeer-dodgers-utley?source=rss", "ord_in_thread": 0, "title": "Baseball: Mets fans jeer Dodgers' Utley", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Baseball: Mets fans jeer Dodgers' Utley Associated Press Posted: 10/12/2015 09:32:40 PM PDT Updated: 10/12/2015 09:43:25 PM PDT Chase Utley joined the ranks of John Rocker and Pete Rose as the object of Mets fans ire, with the New York crowd directing boos and profane chants at the Los Angeles Dodgers second baseman before Game 3 of the N.L. Division Series on Monday night. \nTwo days after his slide to break up a double play fractured the right leg of Mets shortstop Ruben Tejada at Dodger Stadium, Utley remained eligible to play while appealing his two-game suspension. \nFans prepared for Citi Field's first game of the series by directing their ire at Utley with chants on the No. 7 subway line to the ballpark. They booed loudly when Utley was introduced sixth among Dodgers reserves before the game, between ace Clayton Kershaw and backup Justin Ruggiano. \nNew York City Mayor Bill de Blasio gave his view earlier Monday, pronouncing Utley \"guilty as sin.\" \nUnder the sport's collective bargaining agreement, the hearing is to start within 14 days of Major League Baseball receiving the appeal, and penalties are held in abeyance pending a decision. Utley did not play in Monday's game, which the Mets won 13-7. \n\"I feel like MLB got, you know, maybe a little bit bullied into suspending him. Never happened before. I've seen slides a lot worse,\" Kershaw said. \"There's a lot of people that have a lot of different opinions about it that probably shouldn't because they're not middle infielders and they have no idea what they're talking about.\" Advertisement \nKershaw's next chance to end his playoff skid will come on short rest. With only three days between outings, Kershaw is scheduled to start for the Dodgers in Tuesday's Game 4 against the Mets. Manager Don Mattingly announced before the game his decision to go with the reigning N.L. MVP and three-time Cy Young Award winner. \n\"Do you have to explain that one? He's pretty good,\" Mattingly said. \"No matter if we're down 2-1 or up 2-1, we feel like he's the right guy.\" \nThe Dodgers trail the best-of-five series 2-1 after Monday's loss at Citi Field. Rookie left-hander Steven Matz is lined up to pitch for the Mets on Tuesday. \nFormer Mets star Rusty Staub threw out the ceremonial first pitch before Game 3 less than two weeks after having a heart attack. Staub, 71, became ill on a flight from Ireland to John F. Kennedy International Airport in New York, and the Mets said the plane was diverted back to Ireland, where Staub was treated. Nationals: Washington found new jobs for former bench coach Randy Knorr and two other members of its coaching staff who were let go when manager Matt Williams was fired. Knorr will be senior assistant to the general manager for player development, the Nationals announced. Former third base coach Bobby Henley was named senior adviser for player development, and former bullpen coach Matt LeCroy will manage at Double-A Harrisburg. \nHome run record: There were 21 home runs hit Monday, a record for one day in postseason play. The previous record was 15 on Oct. 3, 1995, according to STATS. Like Monday, there were four postseason games on that day 20 years ago.", "external_links": [], "published": "2015-10-13T07:32:00.000+03:00", "crawled": "2015-10-13T07:53:56.986+03:00", "highlightTitle": ""}