{"organizations": ["Broncos", "Browns Peyton Manning"], "uuid": "160e26c32cad5a0a4931945134fc569193f71757", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribtown.com", "main_image": "http://d1bdhkmqqz901h.cloudfront.net/1200x630/smart/s3.amazonaws.com/hne-smedia/c/d/cd08c0dc9a1a4ce2a73cdb198708b8c2/web_full_78993557200.jpg", "site_section": "http://tribtown.com//feed/sec/6000", "section_title": "TribTown.com - Sports News", "url": "http://www.tribtown.com/view/story/cd08c0dc9a1a4ce2a73cdb198708b8c2/FBN--Broncos-Browns", "country": "US", "title": "Peyton Manning overcomes 3 interceptions, Broncos stay unbeaten with 26-23 OT win over Browns", "performance_score": 0, "site": "tribtown.com", "participants_count": 0, "title_full": "Peyton Manning overcomes 3 interceptions, Broncos stay unbeaten with 26-23 OT win over Browns", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T05:15:00.000+03:00", "replies_count": 0, "uuid": "160e26c32cad5a0a4931945134fc569193f71757"}, "author": "", "url": "http://www.tribtown.com/view/story/cd08c0dc9a1a4ce2a73cdb198708b8c2/FBN--Broncos-Browns", "ord_in_thread": 0, "title": "Peyton Manning overcomes 3 interceptions, Broncos stay unbeaten with 26-23 OT win over Browns", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Peyton Manning", "TOM WITHERS"], "text": "Peyton Manning overcomes 3 interceptions, Broncos stay unbeaten with 26-23 OT win over Browns By TOM WITHERS AP Sports Writer First Posted: October 18, 2015 - 10:14 pmLast Updated: October 18, 2015 - 10:15 pm We also have more stories about: (click the phrases to see a list) \nPeople: \nClick to view (11 Photos) \nCLEVELAND — Again far from perfect, Peyton Manning still kept Denver's record pristine. \nManning shook off three interceptions, including one early in overtime, and drove Denver's offense in range for Brandon McManus to kick a 34-yard field goal with 4:56 left, giving the unbeaten Broncos a 26-23 win over the Cleveland Browns on Sunday. \nManning took the Broncos from their 12 to the Cleveland 16 before McManus kicked his game-winner to make Denver 6-0 for the seventh time in franchise history. \n\"We're not playing as well as we would like but we're playing well enough to win,\" Manning said. \"We're doing some things right at critical times whether it's the last drive of the game or in overtime.\" \nManning now has led a team to a 6-0 start six times, the most of any starting quarterback in NFL history. \nDenver's win would not have been possible without the Broncos' top-ranked defense, which came up huge in overtime and has carried the team — and the 39-year-old Manning — during the club's unblemished start. \nAfter Manning's third pick, Denver recorded a tackle behind the line of scrimmage and then had two consecutive sacks of Josh McCown to push the Browns (2-4) out of field-goal range. \n\"Obviously that's not a good situation to put the defense in, but they got a couple of sacks and gave us a chance,\" said Manning, who has seven TD passes and 10 interceptions this season. \"I'm not having a ton of breaks. I won't be going to Vegas for my bye week. I'm not feeling really lucky.\" \nBut Denver's defense bailed him out, and given another chance in overtime, Manning took over. He completed 4 of 4 passes for 39 yards on the last drive. Manning finished 26 of 48 for 290 yards and the one TD, a 75-yarder to Emmanuel Sanders. \nThe score came just seconds after the Browns had taken their only lead on Karlos Dansby's 35-yard interception return for a TD. \nIt was yet another heartbreaker for Cleveland, which had one of the NFL's best teams on the ropes late in regulation before McCown threw a critical interception. \nMcCown, who passed for a franchise-record 457 yards last week, went 20 of 39 for 213 yards with two touchdowns to tight end Gary Barnidge. But his second pick with 44 seconds left in regulation cost the Browns as they were driving for a potential game-winning field goal. \nOn second down at the Denver 46, McCown rolled from pressure before forcing a throw across the field that was picked off by Denver's David Bruton Jr. \n\"It was obviously just not good,\" McCown said of his turnover. \"You have to get something going there. That hurt us because the defense played lights-out today. We didn't hold up our end. It is a shame.\" \nDenver cornerback Aqib Talib had a 63-yard interception return for a TD and McManus kicked four field goals as the Broncos won their 11th straight against the Browns. \nThis one didn't have much artistic beauty as the Broncos had some dropped passes, penalties and let the Browns hang around. \nBut Manning, as he has done so many times during his illustrious career, found a way to lead his team to the win. His struggles have prompted talk about his career reaching an end, but Denver, relying on its swarming, turnover-inducing defense, is winning without Manning playing well. \n\"We're a good football team that could be a great football team, if we can correct a lot of our mistakes,\" Broncos coach Gary Kubiak said. \nThe overtime came after a frenetic fourth quarter during which Cleveland took the lead on Dansby's interception — off a pass bobbled by Denver's Ronnie Hillman — only to have Manning take it back 14 seconds later with his strike to Sanders. \nDenver's dominating defense, missing injured linebacker DeMarcus Ware, came up with another big play in the first half as Talib's return gave the Broncos a 10-0 lead. \nOn the second play of the second quarter, McCown threw a pass toward the right sideline, where Talib was waiting. He made the interception, and after briefly holding the ball out in an early celebration, tucked it away and outran Travis Benjamin to the end zone. \nIt was Denver's fourth defensive TD this season and the eighth of Talib's career. \nHillman rushed for 111 yards on 20 carries. Demaryius Thomas had 10 catches for 111 yards, but let two clutch throws by Manning slip through his hands. \nNOTES: Denver is 4-0 in road games. ... Already missing Ware (back), the Broncos also lost LBs Shane Ray (knee) and Corey Nelson (knee). Ray's injury appears to be the most serious. He left the stadium on crutches and his knee immobilized. ... Sanders hurt his left shoulder while making a catch late in regulation. ... Barnidge is the first Browns TE to catch a TD pass in four straight games since Ozzie Newsome in 1981. \nAP NFL website: http://www.pro32.ap.org and http://www.twitter.com/AP_NFL \nAll content copyright ©2015 The Tribune, a division of Home News Enterprises unless otherwise noted.", "external_links": [], "published": "2015-10-19T05:15:00.000+03:00", "crawled": "2015-10-19T05:24:15.778+03:00", "highlightTitle": ""}