{"organizations": ["NFL", "Jaguars London"], "uuid": "fd2778291c683c9b7db49096d807bc3719f5b60b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.torontosun.com", "main_image": "http://storage.torontosun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297764278120_LARGE_BOX.jpg?quality=80&stmp=1445818864139&size=100x", "site_section": "http://www.torontosun.com/sports/rss.xml", "section_title": "Top Sports stories", "url": "http://www.torontosun.com/2015/10/25/manuel-bills-suffer-devastating-loss-to-jaguars", "country": "CA", "title": "Manuel, Bills suffer 'devastating' loss to Jaguars", "performance_score": 0, "site": "torontosun.com", "participants_count": 0, "title_full": "Manuel, Bills suffer 'devastating' loss to Jaguars", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T00:40:00.000+02:00", "replies_count": 0, "uuid": "fd2778291c683c9b7db49096d807bc3719f5b60b"}, "author": "", "url": "http://www.torontosun.com/2015/10/25/manuel-bills-suffer-devastating-loss-to-jaguars", "ord_in_thread": 0, "title": "Manuel, Bills suffer 'devastating' loss to Jaguars", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Manuel"], "text": "London gets foggy notion of NFL football \nAn old football adage says if you lose a game 20 times, you’ve got to figure out a way to win it 21 times. \nWell, the Jacksonville Jaguars lost Sunday’s game at London’s Wembley Stadium about 80 times. They didn’t win it 81 times. Lucky for them, the Buffalo Bills lost it 81 times. \nThe Jaguars blew a 27-3 first-half lead, then rallied themselves in the final minutes to beat the still-hapless-under-Rex-Ryan Bills, 34-31. \n“It’s just crazy. Anything that could go wrong did go wrong,” Ryan said. \nIt was a dreadfully played game. You’re welcome, England. Seriously, the U.K. should appeal to the World Trade Organization if the NFL insists on importing such a rancid product. \nThe game’s result is fitting, as it means both teams flew back across the Atlantic with a losing record: Buffalo 3-4, Jacksonville 2-5. \nBills quarterback EJ Manuel, starting for the second straight week in place of injured Tyrod Taylor, was epically horrible for most of the first half. \nManuel is a fine young man with many impressive, redeeming personal qualities. Playing NFL quarterback at an acceptable level of consistency just hasn’t been one of them as yet. \nOn Sunday, EJ stood for Eventual Journeyman. Or Endangered Job. Take your pick. \nIn a six-play, three-minute stretch of the second quarter, Manuel did this: \n1) held onto the ball for way too long in the pocket, got walloped, fumbled, and Jags pass rusher Chris Clemons scooped and scored from six yards out; \n2) locked onto receiver Robert Woods, unwisely threw it, Jags linebacker Telvin Smith easily jumped it, picked it and returned it 26 yards for a touchdown; \n3) threw a pass up the middle right into the arms of Jags linebacker Paul Posluszny, who set up yet another eye-blink Jacksonville touchdown after returning the interception to the Buffalo 36. \nManuel recovered from all that -- one of the ugliest short stretches of play from an NFL quarterback you’ll ever see -- to throw two touchdowns, as the Bills closed their deficit to within 27-24 with 6:33 left in the game. \nThat was only possible because the Jaguars offence went limp-dead after failing to score on their 17-play, nearly nine-minute drive to open the second half -- as the Bills defensive line stymied four stubborn runs up the gut at the one-yard line. \nThree plays after the Bills made a close game of it, Jaguars quarterback Blake Bortles threw a horrific desperation pass on third down -- backing up under heat and lobbing a deep pop-up pass. \nIt soared far past his double-covered receiver and into the arms of Corey Graham. The Bills safety returned it 44 yards for a touchdown and an inexplicable 31-27 Buffalo lead, with 5:21 remaining. \nNaturally, the disappointing Bills defence then let the Jaguars zip down the field for the winning touchdown -- a sharp 31-yard pass from Bortles as he rolled left to Allen Hurns with 2:16 remaining. \nSure, the Jags were helped on the drive by a phantom pass-interference call on nickelback Nickell Robey on a 3rd-and-15 near midfield. But once again, a Bills defence that bragged all off-season about its greatness meekly succumbed in the clutch. \nManuel’s attempt to rally the Bills to a game-tying field goal, or game-winning touchdown, proved equally futile. \nOn 4th-and-2 at the Buffalo 40 with 57 seconds remaining, Bills offensive coordinator Greg Roman irresponsibly called for Manuel to roll left to throw. \nUnlike Bortles, Manuel is terrible at rolling left and throwing. He predictably threw way too softly to Woods on a sideline curl. Jags cornerback Aaron Colvin was far off Woods but had ample time to jump in front and bat the pass away, to seal Jacksonville’s first win in three attempts. \n“A devastating loss, to say the least,” Ryan said. “We found a way to keep fighting, and found a way to come back -- and not only come back but to come all the way back and take a lead. That’s the thing that just kills you right now.” \nRyan refused to point a finger at Manuel, now 6-9 in games he has started and finished since being drafted in the first round in 2013. \n“It wasn’t just on EJ...,” he said. “It’s on all of us. \n“When his fundamentals are tight, I think EJ’s accurate. And he threw a couple of great deep balls (for touchdowns).” \nReports continue to swirl that Ryan and his coaching staff preferred to keep Matt Cassel as backup, over Manuel, but GM Doug Whaley and his player-personnel staff kept believing in Manuel -- and traded Cassel (to Dallas) when they could get something for him. \nIs Ryan still comfortable with Manuel as his backup quarterback? \n“Yeah, 100 percent absolutely,” Ryan said. “Absolutely I am 100% comfortable with him as the backup, yup. \n“We all stand right by him. It wasn’t the best time for him, certainly, but we just kept encouraging him and believing in him, and believing in the guys. We knew we could come back. And we did. I really thought that game was going to be ours, I really did.” \nSTREAM OF ANXIOUSNESS : The NFL’s first attempt to live-stream a game (Bills-Jaguars) seemed to be hit and miss. I watched it online in my home office north of Toronto, and, like many, experienced no issues whatsoever. Others in North America found it to be a “disaster” of frustrating hiccups, pixilations or blurriness, according to BusinessInsider.com. \nKC ROYALLY SHARP : Kansas City ended the league’s longest losing streak with a 23-13 win against visiting Pittsburgh. The Chiefs had lost five straight. \nThe Steelers again were without quarterback Ben Roethlisberger (sprained knee) as well as his backup Michael Vick (hamstring). In his first NFL start, Landry Jones was picked off twice and fumbled once. \nAlex Smith threw for 251 yards for KC. Charcandrick West, in his second career start at running back, rushed for 110 yards and his first NFL touchdown. \n“You find out who your friends are, and you don’t have very many of them,” Chiefs head coach Andy Reid said of KC’s losing skid. \nMembers of the Kansas City Royals were on hand to show off their American League championship trophy, after dispatching the Toronto Blue Jays in six games on Friday night. \n“It was great to have the Royals out there,” Reid said. “Brought us a little Royal luck, dog-gone it.”", "external_links": [], "published": "2015-10-26T00:40:00.000+02:00", "crawled": "2015-10-26T02:25:33.164+02:00", "highlightTitle": ""}