{"organizations": [], "uuid": "72ffe276555b36e4cbfcd060b4480861fc2938b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "wtop.com", "main_image": "http://wtop.com/wp-content/uploads/2015/10/NLCS-Cubs-Mets-Baseball10.jpeg", "site_section": "http://wtop.com/section/sports/feed/", "section_title": "WTOP » Sections » Sports", "url": "http://wtop.com/mlb/2015/10/leading-off-price-ventura-in-kc-cubs-mets-start-nlcs/", "country": "US", "title": "LEADING OFF: Price-Ventura in KC, Cubs-Mets start NLCS", "performance_score": 0, "site": "wtop.com", "participants_count": 1, "title_full": "LEADING OFF: Price-Ventura in KC, Cubs-Mets start NLCS", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T09:36:00.000+03:00", "replies_count": 0, "uuid": "72ffe276555b36e4cbfcd060b4480861fc2938b3"}, "author": "wtopstaff", "url": "http://wtop.com/mlb/2015/10/leading-off-price-ventura-in-kc-cubs-mets-start-nlcs/", "ord_in_thread": 0, "title": "LEADING OFF: Price-Ventura in KC, Cubs-Mets start NLCS", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home » News » Sports » MLB » LEADING OFF: Price-Ventura in… LEADING OFF: Price-Ventura in KC, Cubs-Mets start NLCS By The Associated Press October 17, 2015 2:36 am New York Mets pitcher Matt Harvey answers questions for the media during a news conference, Friday, Oct. 16, 2015, in New York. The Mets will face the Chicago Cubs in Game 1 of the NLCS on Saturday. (AP Photo/Julie Jacobson) \nA look at what’s happening around the major leagues today: \n___ \nON TAP \nBoth Championship Series are in action, with the AL’s Blue Jays and Royals playing Game 2 in Kansas City at 4:07 p.m. EDT and the NL’s Cubs and Mets beginning their series in New York at 8:07 p.m. EDT. \nROYAL HEAT \nToronto’s potent lineup was silenced Friday night by Edinson Volquez, who ran his fastball up to 97 mph in a 5-0 Game 1 win. The Blue Jays will see even higher velocities in Game 2 when they face Yordano Ventura, who led all qualified major league pitchers with an average fastball velocity of 96.3 mph, according to Fangraphs. That heat didn’t help much in the ALDS, though, when Ventura gave up a pair of home runs and had a 7.71 ERA over seven innings vs. Houston. Ventura had closed out the regular season with four consecutive homerless starts, a span of 25 innings. \nPRICE CHECK \nDavid Price will try to pitch the Blue Jays back to a series tie after making a pair of appearances in the ALDS, including a relief outing in the team’s Game 4 win over Texas. Price has a 7.20 ERA over 10 innings this postseason, a stark downturn from his 2.30 ERA over the season’s final two months following his trade from Detroit to Toronto. \nHOW’S EDWIN? \nThe Blue Jays are hoping for good news on slugger Edwin Encarnacion, who exited Game 1 in the eighth inning to get X-rays on the middle finger of his left hand. The initial report was that Encarnacion had a strain of the ligament, and he was listed as day to day. “He’s been battling this thing,” Blue Jays manager John Gibbons said. “We’ll see how it goes.” \nDANIEL IN DEMAND \nMets fans are calling for New York to bring back pending-free agent Daniel Murphy following his outstanding performance in the NL Division Series. Murphy hit three homers as the Mets knocked out the Dodgers, including a go-ahead shot off Zack Greinke in a 3-2 Game 5 win. The 30-year-old will be a free agent after the postseason following a season in which he hit .281 with 14 homers. According to Fangraphs, his 2.5 Wins Above Replacement tied for 10th among major league second basemen. \nDARK KNIGHT’S NIGHT \nThe Batman masks will be out in force at Citi Field when Matt Harvey makes his second postseason start. Nicknamed “The Dark Knight,” Harvey has fallen into a love-hate relationship with New York that Bruce Wayne would appreciate. Harvey was one of the NL’s better pitchers this season in his first year back following Tommy John surgery, and still he drew the ire of the fan base over a late-season kerfuffle regarding his innings limit and for showing up late to the team’s first postseason workout. Love him or not, Mets fans have taken to sporting Batman masks when Harvey pitches at Citi Field. \nBEEN THERE, DONE THAT \nJon Lester will be making his 14th start and 16th appearance in the postseason, where he owns a 2.66 ERA. He lost his only start so far in these playoffs to old friend John Lackey in Game 1 of the NL Division Series, allowing three runs over 7 1-3 innings. The left-hander signed a six-year, $155 million deal with the Cubs in the offseason, a move that signaled Chicago’s attempted pivot toward contention. \nSEASON SERIES \nChicago has won a team-record nine straight games against New York, including seven wins this season by a combined score of 27-11. The teams haven’t played since July 2, though, and the Mets have overhauled their offense since with the additions of Yoenis Cespedes, Michael Conforto, Kelly Johnson and Juan Uribe, as well as the returns of Travis d’Arnaud and David Wright from injury. \nPHILOSOPHICAL DIFFERENCES \nThe Cubs and Mets rebuilt their rosters over the past half-decade in contrasting styles, with Chicago stockpiling offensive prospects and New York loading up on arms. In the second half of this season, though, it was the Mets who led the NL in home runs (102) and runs (373), with Chicago ranked second in each category. Meanwhile, the Cubs ranked second in second-half ERA (3.42), while the Mets ranked seventh (3.72). Topics:", "external_links": [], "published": "2015-10-17T09:36:00.000+03:00", "crawled": "2015-10-17T10:22:54.291+03:00", "highlightTitle": ""}