{"organizations": [], "uuid": "669217c50704a3db0b81a6b021d3857837cd89de", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fox8live.com", "main_image": "http://APMOBILE.images.worldnow.com/images/8936134_G.jpg", "site_section": "http://www.fox8live.com/", "section_title": "New Orleans News, Weather, Saints - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "url": "http://www.fox8live.com/story/30176760/us-searches-bahamas-for-ship-lost-during-hurricane-joaquin", "country": "US", "title": "US searches Bahamas for ship lost during Hurricane Joaquin", "performance_score": 0, "site": "fox8live.com", "participants_count": 1, "title_full": "US searches Bahamas for ship lost during Hurricane Joaquin - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T09:10:00.000+03:00", "replies_count": 0, "uuid": "669217c50704a3db0b81a6b021d3857837cd89de"}, "author": "cbs8", "url": "http://www.fox8live.com/story/30176760/us-searches-bahamas-for-ship-lost-during-hurricane-joaquin", "ord_in_thread": 0, "title": "US searches Bahamas for ship lost during Hurricane Joaquin", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By BEN FOX and DANICA COTO\nAssociated Press NASSAU, Bahamas (AP) - An intensive, dawn-to-dark search Saturday turned up a life ring but no other sign of a cargo ship with 33 people on board that lost power and communications off the southeastern Bahamas during Hurricane Joaquin.\nU.S. Coast Guard and Navy aircraft covered a large expanse of the Atlantic Ocean near Crooked Island for the El Faro, which was taking on water as it was battered by massive waves at the height of the hurricane. The search was halted at nightfall and was expected to resume Sunday.\nAuthorities don't know yet what happened to the ship or whether the discovery of the life ring means that the crew were forced to abandon the vessel, said Chief Petty Officer Ryan Doss, a Coast Guard spokesman in Miami.\n\"There are plenty of instances where things get torn off a ship in heavy winds,\" Doss said. \"It even happens to Coast Guard cutters.\"\nThe life ring was spotted 120 miles (193 kilometers) northeast of Crooked Island, about 70 miles (113 kilometers) from the last known position of the El Faro before authorities lost contact with it on Thursday as Joaquin raged through that section of the Bahamas as a powerful Category 4 hurricane.\nTOTE Maritime Puerto Rico, the operator of the ship, said in a statement that it told family members of the crew, who gathered at a union hall in Jacksonville, Florida, that they should not be discouraged by the discovery of the life ring and that it will help the Coast Guard with the search.\n\"While this reflects that the ship was caught in rough seas and extreme weather, it is in no way indicative of the ship's fate,\" the company said. \"Small items such as life rings and life jackets are lost at sea frequently, particularly in rough weather.\"\nThe El Faro was heading to San Juan, Puerto Rico from Jacksonville, Florida when it ran into trouble. It was being battered by winds of more than 130 mph and waves of up to 30 feet (9 meters). The crew reported it had taken on water and was listing 15 degrees but said it was \"manageable,\" according to the company. That was the last it was heard from.\nThe El Faro departed Sept. 29, when Joaquin was still a tropical storm, with 28 crew members from the United States and five from Poland. The company described them as experienced and \"more than equipped to handle situations such as changing weather.\"\nThe weather has improved now that Hurricane Joaquin has moved to the northeast, away from the Bahamas on a path toward Bermuda, but high seas and heavy winds were still making it difficult to search.\nThe vessel carried 685 containers and had on board an EPIRB, which transmits distress signals. An initial ping was received Thursday morning, but no new ones have followed as Coast Guard helicopters and C-130 planes and Navy P-8 scan from the skies.\nAs the threat of the storm receded on a path that would take it away from the U.S. mainland, people in the southeastern Bahamas were in cleanup mode. Joaquin destroyed houses, uprooted trees and unleashed heavy flooding as it hurled torrents of rain. Officials said it would take time to come up with a complete assessment of the damage to private property and infrastructure.\nAn elderly man died on Long Island during the hurricane but it has not yet been determined if the storm caused his death, said Capt. Stephen Russell, the director of the Bahamas National Emergency Management Agency.\nLate Saturday night, the storm was centered about 385 miles (620 kilometers) southwest of Bermuda and was moving northeast at 20 mph (31 kph). It had maximum sustained winds of 130 mph (215 kph), according to the U.S. National Hurricane Center. The storm is expected to lose strength in upcoming days, but a tropical storm warning and a hurricane watch were issued for Bermuda.\nThe eye of Joaquin was expected to pass west of Bermuda on Sunday, but the storm still might veer closer to the island, forecasters warned.\nCoto reported from San Juan, Puerto Rico. Associated Press writer Matt Sedensky in Miami contributed to this report.\nCopyright 2015 The Associated Press. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-03T09:10:00.000+03:00", "crawled": "2015-10-04T12:51:25.889+03:00", "highlightTitle": ""}