{"organizations": [], "uuid": "cfbbe0e5b834c466f4e0e5974d68f8ded772445f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266383/sports-outdoor-sports", "section_title": "Sports: Outdoor Sports - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30334023/11-year-old-basketball-phenom-noah-cutler-recently-featured-in-dc-news-media-currently-gaining-international-attention-via-social-media-for-his", "country": "US", "title": "11-Year-Old Basketball Phenom Noah Cutler Recently Featured in DC News Media, Currently Gaining International Attention Via Social Media for His Unparalleled Basketball Skill", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "11-Year-Old Basketball Phenom Noah Cutler Recently Featured in DC News Media, Currently Gaining International Attention Via Social Media for His Unparalleled Basketball Skill - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T17:11:00.000+03:00", "replies_count": 0, "uuid": "cfbbe0e5b834c466f4e0e5974d68f8ded772445f"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30334023/11-year-old-basketball-phenom-noah-cutler-recently-featured-in-dc-news-media-currently-gaining-international-attention-via-social-media-for-his", "ord_in_thread": 0, "title": "11-Year-Old Basketball Phenom Noah Cutler Recently Featured in DC News Media, Currently Gaining International Attention Via Social Media for His Unparalleled Basketball Skill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "11-year-old undersized basketball phenom, making international waves and catching the attention of NBA pro's and college coaches.\nLeesburg, VA (DC metro) (PRWEB) October 23, 2015\nNoah Cutler is an undersized 11 year old basketball prodigy. He's been noticed by several big NBA stars for his talent, and featured in Local DC news media for his skills. Noah is followed by people all over the world – kids constantly telling him that he inspires them to never give up on their dreams. What makes Noah's story stand out from everyone else's is that he lacks generally what's required to excel at this sport. Noah has a growth disorder and has not grown at all since 8 years old. He's now 11. He still wears preschool size shoes.\nHis ball handling has been compared to NBA star Kyrie Irving, his shooting has been recognized by shooting coaches all over the country. At the age of 11 he already had college coaches watching his journey. Noah's dedication to the game is second to none. With only playing the game for 2 and half years, he is one of the top players in the country for his age. Keeping in mind his small stature, he runs the floor with no fear.\nHe regularly plays with high school kids and adults in open gym runs, and he constantly travels the country playing 2-3 years above his age. Social media has taken notice of his talent with almost 40k followers on Instagram @babybirdman3 . Noah is a humble child with pristine grades. He's poured his heart and soul in the game he loves. Here are some clips of Noah's game. All of his clips are on Instagram and can be found here below:\nhttp://www.instagram.com/babybirdman3\nA fan made this phenomenal mixtape for Noah showcasing his skills:\nhttp://youtu.be/MYc_K1h94fQ\nLocal DC media coverage:\nhttp://wjla.com/sports/content/meet-noah-cutler-the-10-year-old-from-leesburg-who-is-better-than-you-at-basketball\n15 second game highlights for previous weeks and showcase events.\nhttps://instagram.com/p/8JzYxGy44q/\nPlease take the time to review his Instagram account and see what the world is saying about this Pint Sized Phenom.\nFor the original version on PRWeb visit: http://www.prweb.com/releases/2015/10/prweb13038005.htm\nInformation contained on this page is provided by an independent third-party content provider. WorldNow and this Station make no warranties or representations in connection therewith. If you have any questions or comments about this page please contact pressreleases@worldnow.com .", "external_links": ["http://www.instagram.com/babybirdman3", "http://youtu.be/MYc_K1h94fQ", "https://instagram.com/p/8JzYxGy44q/", "http://wjla.com/sports/content/meet-noah-cutler-the-10-year-old-from-leesburg-who-is-better-than-you-at-basketball", "http://www.prweb.com/releases/2015/10/prweb13038005.htm"], "published": "2015-10-23T17:11:00.000+03:00", "crawled": "2015-10-23T16:46:15.325+03:00", "highlightTitle": ""}