{"organizations": [], "uuid": "2e5cac8ba0fc1b1e6df4e7e1768319635c126e41", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "wtop.com", "main_image": "http://wtop.com/wp-content/uploads/2015/10/Britain-Bills-Jaguars-Football19.jpeg", "site_section": "http://wtop.com/section/sports/feed/", "section_title": "WTOP » Sections » Sports", "url": "http://wtop.com/nfl/2015/10/bortles-leads-jaguars-to-34-31-win-over-bills-at-wembley/", "country": "US", "title": "Bortles leads Jaguars to 34-31 win over Bills at Wembley", "performance_score": 0, "site": "wtop.com", "participants_count": 1, "title_full": "Bortles leads Jaguars to 34-31 win over Bills at Wembley", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T07:45:00.000+02:00", "replies_count": 0, "uuid": "2e5cac8ba0fc1b1e6df4e7e1768319635c126e41"}, "author": "wtopstaff", "url": "http://wtop.com/nfl/2015/10/bortles-leads-jaguars-to-34-31-win-over-bills-at-wembley/", "ord_in_thread": 0, "title": "Bortles leads Jaguars to 34-31 win over Bills at Wembley", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home » News » Sports » NFL » Bortles leads Jaguars to… Bortles leads Jaguars to 34-31 win over Bills at Wembley By CHRIS LEHOURITES October 26, 2015 1:45 am Jacksonville Jaguars quarterback Blake Bortles (5), left, hands off to running back T.J. Yeldon (24) during the NFL game between Buffalo Bills and Jacksonville Jaguars at Wembley Stadium in London, Sunday, Oct. 25, 2015. (AP Photo/Matt Dunham) \nLONDON (AP) — When the big lead was finally wiped out, Blake Bortles got his offense going for one last drive. \nGot it going right into the end zone. \nIt was the defense that gave the Jacksonville Jaguars a big lead over the Buffalo Bills at Wembley Stadium, but it was Bortles that put the final touch on the 34-31 victory by completing a 31-yard touchdown pass to Allen Hurns with 2:16 remaining. \n“The offensive line, they did a great job as far as just giving Blake a lot of time,” Hurns said of the winning play. “Blake does an awesome job of just keeping plays alive.” \nThe Jaguars (2-5) won their first game in London after losing in each of the past two seasons at Wembley, the home of England’s national soccer team. The Bills (3-4) were playing in the British capital for the first time. \nIt was also the first time the game was streamed live around the world on Yahoo’s website. \nThe Jaguars built up a 27-3 lead, mainly by taking advantage of another inconsistent performance from backup Bills quarterback EJ Manuel. \nOn third-and-9 early in the second quarter, Aaron Colvin forced a fumble from Manuel and Chris Clemons grabbed the loose ball and ran 6 yards into the end zone. After the kickoff and a touchback, Manuel was again in the pocket but his pass was picked off by Telvin Smith, who ran it in from the 26. \nAnd the defense wasn’t done yet. On the fourth play of the next drive, Manuel was again picked off, this time by Paul Posluszny. \n“Just bad football,” said Manuel, who finished with 298 yards on 24 of 42 passing with two touchdowns and two interceptions. \nManuel, however, led the comeback attempt and safety Corey Graham nearly capped it off by returning an interception 44 yards for a touchdown and 31-27 Bills lead. \nThat’s when Bortles came up with the goods. \n“To be able to stay calm and to have a big lead and give it up and be able to come back and score to win the game is huge,” said Bortles, who was 13 of 29 for 182 yards, two touchdowns and one interception. \nHere are some things we learned: \nBILLS NEED A BREAK: The Bills have been struggling with injuries, and next week’s bye is probably just what the doctor would have ordered. \nBesides missing quarterback Tyrod Taylor and defensive tackle Kyle Williams, the Bills have several other key players out, including running back Karlos Williams, tackle Seantrel Henderson and wide receivers Percy Harvin and Sammy Watkins. \n“Quite honestly, I don’t know if I’ve ever been on a team that needed a bye week worse than we do,” Bills coach Rex Ryan said. “We got to get some guys back.” \nJAGUARS CAN RALLY: Jaguars coach Gus Bradley looked up at the scoreboard in the second quarter and didn’t like what he saw: Bills 27, Jaguars 3. \n“I felt like, “Oh, here we go, man,'” Bradley said. “‘We’ve got to really fight now.'” \nDespite the team’s poor record this year, Bradley seems to have them looking on the bright side. And it showed. \nJAGUARS AT HOME: The Jaguars seem to finally be feeling at home in London after two losses over the past two years. \nOn Friday, the team extended its contract to play every season at Wembley through 2020. That will make it eight straight years of playing games at the iconic London venue that hosted the 1966 World Cup final. \nMANUEL STILL INCONSISTENT: EJ Manuel started for the second straight game, and for the second straight loss. \nAnd it was Manuel’s early mistakes that gave the Jaguars a big lead in the second quarter. \nBut Ryan is sticking by him, at least until Taylor is healthy enough to return. \n“Wasn’t just EJ. We give up a 33-yard touchdown down, 28-yard touchdown run,” Ryan said. “It’s just crazy. Anything that could go wrong did go wrong. We were still able to overcome it to grab the lead. It’s unfortunate.” \nNFL AT WEMBLEY: Sunday’s game drew 84,021 fans — the second-highest NFL attendance at Wembley since the the league started playing regular-season games in the British capital. \nIt was only the third time in 13 games dating back to 2007 that the crowd eclipsed the 84,000 mark. \nThe highest attendance came in 2009 when 84,254 watched the New England Patriots beat the Tampa Bay Buccaneers 35-7. The Patriots also drew the third highest number when 84,004 saw them beat the St. Louis Rams 45-7 in 2012. \n___ \nAP NFL website: www.pro32.ap.org and www.twitter.com/AP_NFL Topics:", "external_links": [], "published": "2015-10-26T07:45:00.000+02:00", "crawled": "2015-10-26T08:34:40.699+02:00", "highlightTitle": ""}