{"organizations": [], "uuid": "bf0f6c1f862b08b4b8ab3e9863934e9e0eab346d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/47529300.cms", "site_section": "http://timesofindia.indiatimes.com/sports/football/top-stories/articlelist/4720865.cms", "section_title": "Top Stories - Football - Sports - The Times of India", "url": "http://timesofindia.indiatimes.com/sports/football/top-stories/Injured-De-Jong-among-five-dropped-by-the-Netherlands/articleshow/49195602.cms", "country": "IL", "title": "Injured De Jong among five dropped by the Netherlands", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "Injured De Jong among five dropped by the Netherlands - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T00:59:00.000+03:00", "replies_count": 0, "uuid": "bf0f6c1f862b08b4b8ab3e9863934e9e0eab346d"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/sports/football/top-stories/Injured-De-Jong-among-five-dropped-by-the-Netherlands/articleshow/49195602.cms", "ord_in_thread": 0, "title": "Injured De Jong among five dropped by the Netherlands", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "AMSTERDAM: Injured striker Luuk de Jong was among five players dropped on Friday as a beleaguered Netherlands named a 23-member squad for this month's Euro 2016 qualifiers against Kazakhstan and the Czech Republic.\nDe Jong, joint top scorer in the Dutch league this season, was injured last weekend and missed out on PSV Eindhoven's Champions League defeat at Zenit St Petersburg on Wednesday.\nClub mate Luciano Narsingh was also left out along with Kenneth Vermeer and Rick Karsdorp of Feyenoord and Ajax Amsterdam's Joel Veltman.\nThe Dutch play away in Kazakhstan on Saturday Oct. 10 and then host the already-qualified Czech Republic in Amsterdam three days later.\nThe 20-year-old Ajax striker Anwar El Ghazi, who like de Jong has seven goals from seven league games, is the only uncapped player in the squad.\nCaptain Arjen Robben and Lazio defender Stefan de Vrij miss out through injury.\nThe Netherlands are in dire straits in fourth place in Group A, effectively needing to win both matches and, at the same time, hoping Turkey drop points if they are to stand any chance of finishing third and grabbing a spot in November's play-offs.\nThe Dutch, who were third at the World Cup last year, were beaten at home by Iceland and away by the Turks in their last two qualifiers last month.\nSquad:\nGoalkeepers: Jasper Cillessen (Ajax Amsterdam), Tim Krul (Newcastle United), Jeroen Zoet (PSV Eindhoven)\nDefenders: Daley Blind (Manchester United), Jeffrey Bruma (PSV Eindhoven), Daryl Janmaat (Newcastle United), Terence Kongolo (Feyenoord), Karim Rekik (Olympique Marseille), Jairo Riedewald, Kenny Tete (both Ajax Amsterdam), Virgil van Dijk (Celtic)\nMidfielders: Ibrahim Afellay (Stoke City), Vurnon Anita (Newcastle United), Davy Klaassen (Ajax Amsterdam), Wesley Sneijder (Galatasaray), Georginio Wijnaldum (Newcastle United).\nForwards: Memphis Depay (Manchester United), Bas Dost (VfL Wolfsburg), Anwar El Ghazi (Ajax Amsterdam), Klaas-Jan Huntelaar (Schalke 04), Jeremain Lens (Sunderland), Quincy Promes (Spartak Moscow), Robin van Persie (Fenerbahce). ( ", "external_links": ["https://play.google.com/store/apps/details?id=com.toi.reader.activities"], "published": "2015-10-03T00:59:00.000+03:00", "crawled": "2015-10-03T21:41:43.735+03:00", "highlightTitle": ""}