{"organizations": [], "uuid": "525d11682853242bff42d73d74425205692fcfa8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "nypost.com", "main_image": "https://thenypost.files.wordpress.com/2015/10/sa1.jpg", "site_section": "http://nypost.com/sports/feed/", "section_title": "| Sports | New York Post", "url": "http://nypost.com/2015/10/26/alderson-remembers-his-last-world-series-and-its-earthquake/", "country": "", "title": "Alderson remembers his last World Series — and its earthquake", "performance_score": 0, "site": "nypost.com", "participants_count": 1, "title_full": "Alderson remembers his last World Series — and its earthquake | New York Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T04:30:00.000+02:00", "replies_count": 0, "uuid": "525d11682853242bff42d73d74425205692fcfa8"}, "author": "Dan Martin", "url": "http://nypost.com/2015/10/26/alderson-remembers-his-last-world-series-and-its-earthquake/", "ord_in_thread": 0, "title": "Alderson remembers his last World Series — and its earthquake", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sandy Alderson hasn’t been part of winning a World Series title in nearly as long as the Mets — and although his Series victory didn’t include a ground ball through anyone’s legs like in 1986, it was memorable for much different reasons.\nAfter losing to the Dodgers in the 1988 World Series, the A’s returned to the Fall Classic a year later, facing their Bay Area rivals, the Giants.\nBefore Game 3 at Candlestick Park on Oct. 17, a magnitude 6.9 earthquake struck the Bay Area. It killed 63 people and injured nearly 4,000. MLB commissioner Fay Vincent postponed the series, first for five days and then for five more, before action resumed on Oct. 27.\n“It was definitely a big impact,” said Alderson, who was the general manager of the A’s from 1983-97. “But at the same time, we thought about it: ‘We had an earthquake, we had a terrible loss of life but 25 years from now, 50 years from now people in the East Bay area are going to care whether we won or lost and we still have an obligation to win.’ ’’\nAnd win they did, knocking off San Francisco in four straight for the team’s first title since 1974.\nAlderson — with a team led by Mark McGwire, Jose Canseco, Rickey Henderson, Dave Stewart and Dennis Eckersley — ended up winning three consecutive American League pennants, but captured just one trophy thanks to a Series loss to the Reds in 1990.\nDespite the surrounding tragedy, Alderson said the A’s remained focused on the task at hand.\n“It wasn’t with any disregard about what had happened,” Alderson said. “It was how fans would feel down the road, whether we beat or lost to the Giants.”\nNot surprisingly, there was no huge celebration after the championship.\n“I don’t think we had a parade,” Alderson said. “I’m not sure what that parade would have amounted to.”\nShare this: Facebook Twitter Google Whatsapp Email Filed under mlb playoffs ,  new york mets ,  sandy alderson ,  world series", "external_links": [], "published": "2015-10-26T04:30:00.000+02:00", "crawled": "2015-10-26T12:55:59.974+02:00", "highlightTitle": ""}