{"organizations": [], "uuid": "d4dd062ff96b490dce3c5f549eff4d249052f8de", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.northjersey.com", "main_image": "http://www.northjersey.com:80/polopoly_fs/1.1431141!/fileImage/httpImage/utleyintroductions.jpg", "site_section": "http://www.northjersey.com/cmlink/sports-rss.rss#", "section_title": "Sports News on NorthJersey.com", "url": "http://www.northjersey.com/sports/dodgers-chase-utley-gets-booed-doesn-t-play-1.1430862", "country": "US", "title": "Dodgers' Chase Utley gets booed, doesn't play - Sports", "performance_score": 0, "site": "northjersey.com", "participants_count": 1, "title_full": "Dodgers' Chase Utley gets booed, doesn't play - Sports - NorthJersey.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T15:53:00.000+03:00", "replies_count": 0, "uuid": "d4dd062ff96b490dce3c5f549eff4d249052f8de"}, "author": "CHRIS ISEMAN", "url": "http://www.northjersey.com/sports/dodgers-chase-utley-gets-booed-doesn-t-play-1.1430862", "ord_in_thread": 0, "title": "Dodgers' Chase Utley gets booed, doesn't play - Sports", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Buy this photo AP Los Angeles Dodgers' Chase Utley, center, listens to the reaction from the crowd as his name is called during pre-game player introductions before Game 3 of the National League Division Series against the Mets, Monday, Oct. 12, 2015, in New York. Pitcher Clayton Kershaw (22) and center fielder Justin Ruggiano look on. NEW YORK – The chants of “We want Utley” filled Citi Field throughout Game 3, the sound of 44,276 fans yearning to see retaliation.\nBut Chase Utley never left the dugout.\nAlthough MLB Chief Baseball Officer Joe Torre suspended Utley for two games, Utley was in uniform and eligible to play because a hearing to determine whether to uphold the decision was not held Monday.\nUtley wasn’t in Los Angeles’ starting lineup, despite entering Monday hitting .333 against Matt Harvey.\nUtley got hit on the head when he collided with Tejada, but Dodgers manager Don Mattingly said that wasn’t keeping him out of the lineup.\n“I think he’s doing OK,” Mattingly said before the game. “As far as concussion protocol and all that kind of stuff, and really just a decision, we thought Howie [Kendrick] has been swinging the bat good, and feel like he gives us the best chance to win [Monday.]”\nMattingly then chose to pinch-hit Justin Ruggiano instead of Utley against Jeurys Familia in the ninth, despite a righty-righty matchup. But the left-handed hitting Utley was an option.\n“My only issue is I’ve got to get through [Yasmani] Grandal, who kind of pinched something there in his last at-bat,” Mattingly said. “And I’m still down six, so I really don’t want to hit with one guy on, I want to try to get three or four guys on for him. So yeah, he’s available.”\nAside from the chants of “We want Utley,” the crowd also chanted “Utley [stinks]” at times throughout the game. Utley was booed loudly during pre-game introductions.\nBefore the game, David Wright said Utley sent him a text message, asking him to pass along an apology to Tejada. That said, Wright still supported Utley’s suspension.\n“I think everybody in our clubhouse agreed the slide was late, and obviously major league baseball agreed it was late,” Wright said. “I think it was correct.”\nMets manager Terry Collins said he told his team to move on from what happened Saturday because, “We can’t worry about what happened two days ago; it’s over.”\nCommissioner Rob Manfred said before the game he planned to meet with both Collins and Mattingly before the game to try keep the focus on the game, and not on any potential retaliation.\n“We are going to sit down the managers just to make sure everybody’s on the same page,” Manfred said. “Whether it was necessary or not, I don’t know. We decided to do it out of an abundance of caution. We want the focus to be on a nice, clean game on the field.”\nCollins said after the game that warnings were not issued to the teams, but the meeting with Manfred was positive.\n“We just said one thing we wanted to make sure didn’t happen was that nobody on either side or the umpires got too carried away, because we all know during the course of a game, someone’s going to get knocked down, not intentionally,” Collins said.” There’s going to be someone who slides, makes a funny slide or something, and it’s all part of the game.”\nEmail: iseman@northjersey.com", "external_links": [], "published": "2015-10-12T15:53:00.000+03:00", "crawled": "2015-10-13T18:29:59.247+03:00", "highlightTitle": ""}