{"organizations": [], "uuid": "1e314d37a2d4971f3ce96436337f0ed1bdc5ce9a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dnaindia.com", "main_image": "http://static.dnaindia.com/sites/default/files/2015/10/17/386259-rashtrapati-bhawan-wikimedia-crop.jpg", "site_section": "http://www.dnaindia.com/", "section_title": "DNA India | Latest News, Live Breaking News on India, Politics, World, Business, Sports, Bollywood", "url": "http://www.dnaindia.com/india/report-security-alarm-near-rashtrapati-bhavan-as-foreigner-seen-with-aerial-device-2135944", "country": "SG", "title": "Security alarm near Rashtrapati Bhavan as foreigner seen with aerial device", "performance_score": 0, "site": "dnaindia.com", "participants_count": 1, "title_full": "Security alarm near Rashtrapati Bhavan as foreigner seen with aerial device | Latest News & Updates at Daily News & Analysis", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T18:45:00.000+03:00", "replies_count": 0, "uuid": "1e314d37a2d4971f3ce96436337f0ed1bdc5ce9a"}, "author": "PTI", "url": "http://www.dnaindia.com/india/report-security-alarm-near-rashtrapati-bhavan-as-foreigner-seen-with-aerial-device-2135944", "ord_in_thread": 0, "title": "Security alarm near Rashtrapati Bhavan as foreigner seen with aerial device", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "File Photo In a major security alarm, an unidentified person was spotted flying a suspected helicam near the high-security Vijay Chowk intersection close to Rashtrapati Bhavan and Parliament in New Delhi on Saturday. Helicams are remote-controlled mini aerial devices, fitted with still or motion film cameras, that are used to shoot aerial pictures or videos.\nPolice said that the incident was reported in the evening after a media person spotted a foreigner standing on the pavement near Vijay Chowk with a remote control in his hands.\nThe foreigner was operating a flying object -- suspected to be a helicam -- which was seen hovering around 20-30 feet above the ground, said a police official. The media person told police that when he confronted the foreigner, he stopped the device and fled in a car that was parked near the pavement. The media person further claimed that the vehicle had a diplomatic registration number pertaining to the Russian embassy, said the official.\nThe incident was caught on camera and the footage -- in which the unidentified man can be seen sporting a white T-shirt and shorts -- has been handed over to Parliament Street police station, said the official.\n\"The issue came to our notice through the media. We are inquiring into it,\" said DCP (New Delhi) Jatin Narwal. He said that a special team is studying the video footage and further action will be initiated accordingly.\nPolice said that it is only when the person who was operating the device is questioned can it be known whether the gadget was actually equipped with a camera and if he was taking photographs or videos in the high-security zone.\nMeanwhile, following the incident, security was tightened in and around Parliament Street and several police teams were deployed in the area.", "external_links": [], "published": "2015-10-17T18:45:00.000+03:00", "crawled": "2015-10-17T21:05:32.490+03:00", "highlightTitle": ""}