{"organizations": [], "uuid": "596a6cd4497f3180183d3aa2b02c18594712b285", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.boston.com", "main_image": "http://p.o0bc.com/rw/SysConfig/WebPortal/BDC/Framework/img/bcom_logo_with_name.png", "site_section": "http://www.boston.com/", "section_title": "Boston, MA news, breaking news, sports, video | Boston.com", "url": "http://www.boston.com/news/local/massachusetts/2015/10/12/revere-man-dies-after-violent-struggle-with-police/P91fGICLvcRKo1db4ut7WO/story.html", "country": "", "title": "Revere man dies after break-in, violent struggle with police - Massachusetts news", "performance_score": 0, "site": "boston.com", "participants_count": 1, "title_full": "Revere man dies after break-in, violent struggle with police - Massachusetts news", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "596a6cd4497f3180183d3aa2b02c18594712b285"}, "author": "boston.com", "url": "http://www.boston.com/news/local/massachusetts/2015/10/12/revere-man-dies-after-violent-struggle-with-police/P91fGICLvcRKo1db4ut7WO/story.html", "ord_in_thread": 0, "title": "Revere man dies after break-in, violent struggle with police - Massachusetts news", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Massachusetts State Police detectives are investigating the death of a Revere man who died Sunday night after a violent struggle with police, according to the Suffolk County District Attorney’s Office.\nAuthorities said the man, who was 38, smashed a window of a Winthrop Avenue apartment building and forced his way into someone else’s residence with a young relative. Revere police responded to the scene and found the man bleeding in a stairwell, holding his relative, according to the DA’s office. Police were able to get the man to release the child, but he continued to punch, kick, and bite the officers before breaking free and trying to jump out a window, authorities said.\nThe man had been hospitalized and evaluated for mental health issues following an incident the week before, according to the DA’s office. On Sunday, police used a taser in an attempt to subdue him, but were unsuccessful, authorities said. After a struggle, multiple officers were able to handcuff him and lead him to an ambulance waiting outside the building, where he was restrained on a stretcher.\nAdvertisement - Continue Reading Below He was transported to Whidden Memorial Hospital where he later died, according to the DA’s office.\nClinical staff did not see any physical trauma to the man’s body aside from the injuries they believe he received by breaking the two windows, authorities said. The Chief Medical Examiner is slated to conduct an autopsy to determine the cause of his death.", "external_links": [], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-13T03:56:27.666+03:00", "highlightTitle": ""}