{"organizations": [], "uuid": "480c623bdb4af29355cc8d2efc5725e6f021cd98", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "onlineathens.com", "main_image": "http://onlineathens.com/sites/default/files/14793600.jpg", "site_section": "http://ath-cdn.com/taxonomy/term/2/feed", "section_title": "Sports", "url": "http://onlineathens.com/mobile/2015-10-08/josh-alexander-era-athens-academy-successful-start", "country": "US", "title": "Josh Alexander era at Athens Academy off to successful start", "performance_score": 0, "site": "onlineathens.com", "participants_count": 1, "title_full": "Josh Alexander era at Athens Academy off to successful start", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T05:45:00.000+03:00", "replies_count": 0, "uuid": "480c623bdb4af29355cc8d2efc5725e6f021cd98"}, "author": "Evan Greenberg", "url": "http://onlineathens.com/mobile/2015-10-08/josh-alexander-era-athens-academy-successful-start", "ord_in_thread": 0, "title": "Josh Alexander era at Athens Academy off to successful start", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Josh Alexander era at Athens Academy off to successful start By Evan Greenberg Grady Sports Bureau – published Thursday, October 8, 2015 \nWill Corry represented the bridge from Athens Academy’s successful past to a future full of potential. \nThat’s why Spartans administration asked the senior strong safety and running back to sit in on interviews when Academy looked to fill its coaching vacancy in the offseason. \nCorry was a sophomore during Michael Gunn’s final season in 2013. \nGunn left after 20 playoff appearances and twice as many wins as losses. When assistant coach Don Chuboff stepped in as interim coach last season, the Spartans’ 4-5 record left them out of the postseason. \nWith the team at a crossroads, the Spartans needed new energy. \nAfter lunch with candidate Josh Alexander, Corry felt the jolt of a winner’s presence. \n“I said this to someone when I walked out of the room: ‘I want to play a football game right now,’” Corry said. “I was that excited and that fired up about all the things he wanted to do here. I think we all kind of had that feeling. He was head and shoulders above any candidate we had.” \nSo Athens Academy hired the 38 year-old Alexander. \nNow 5-0, Alexander and the Spartans are headed into a pivotal region game tonight against undefeated 6-0 Prince Avenue Christian. \nAlexander was previously the offensive coordinator at Archer High School in Lawrenceville, where he would make the hour commute from the Athens home he shares with his wife Katherine and two children. \nAlexander arrived at Archer with head coach Andy Dyer and helped build the program, now in its seventh year, to two region titles and a state championship appearance in 2014. As Dyer told it, there were days that tested both of them. \n“There’s a few times I had to talk (Alexander) off a cliff,” Dyer said. “There were a few times when we went to football practice and \njust weren’t sure what was going to happen.” \nA Rex native, Alexander started playing football at age 4 and played on the offensive and defensive lines at Morrow High School in Clayton County before attending the University of Georgia. He graduated in 2001 with a degree in health and physical education. \nHe has been coaching football for 18 years and said with Athens Academy, he has found a perfect fit. \n“This is a big family,” Alexander said. “This place is special. To me, I’ve lived in this town for a long time, and when you become part of this town it’s a very special place. I don’t think anybody can match it around.” \nAlexander’s hiring was the byproduct of a marriage between circumstance and necessity. Athens Academy needed a new leader to bring it back to prominence after a brief bout with uncertainty, and Alexander, looking to head back home and direct his own team for the first time, had the pedigree. \n“If you’re in something for 18 years and you really don’t know what you stand for, then you’re probably in the wrong business,” he said. \nAlexander has coached at Clarke Central, Parkview and Archer — three programs known for their winning traditions — among others. He credits his own philosophy to “being around a lot of good coaches,” and said that “all I’ve done is take what they’ve taught me and add my own principles to it.” \nAlexander’s offense is predicated on a run-pass option or a run-pitch option and relies heavily on quarterback decision-making. Alexander said he was not familiar with the system Gunn ran during his tenure, but those who played under Gunn have had no trouble buying into Alexander’s ideas. \n“There were rumors he was going to be interviewed for the job,” Corry said, “so we kind of looked up Archer and they played in the state championship game last fall, and we watched that game and watched their offense and knew that they had averaged 50 points in the playoffs, and we were all really excited to run that type of offense, kind of like the Oregon type of offense.” \nWhen it came time to hire a new head coach, Athens Academy athletic director Kevin Petroski and his department commissioned a search that attracted more than 170 candidates. Petroski said Alexander’s Athens roots had nothing to do with his hiring but that what he saw from Alexander was enough. \n“His enthusiasm and attention to detail, and his excitement toward building a program was something that stood out among our search committee,” Petroski said. \nChuboff was immediately impressed with Alexander’s vision for the program. \n“I have an appreciation for people who are extremely organized and nothing is left to chance, every ‘i’ is dotted and every ‘t’ is crossed, and (Alexander has) thought things through completely and has a great idea of what we want to do and he’s able to communicate that to the kids,” Chuboff said. \nChuboff has long-standing ties to the program, and due to his first impression of Alexander and his Athens roots, staying on staff was not a difficult decision. \n“I’ve been coaching football for 33 or 34 years and been at Athens Academy with my wife for 21 years, and I’ve had three children graduate from Athens Academy, so it’s a place that I have very strong feelings about,” Chuboff said. “I just felt that it’d be very easy to work with him.” \nUnder Alexander’s guidance, the varsity team practiced five days a week during the summer and decreased the workload to four days a week once the season got underway. Alexander said the concept of early-morning workouts was foreign to the program before he took over. The team now meets daily at 6:30 a.m. for work in the weight room. \nAdditionally, the school established football teams for third through sixth grade — Athens Academy is a K-12 private school — something Alexander said he felt was imperative. Third- and fourth-grade students play flag football, while fifth- and sixth-graders play tackle football in preparation for high school. \n“Where I came from a lot of the success that came from Parkview and Archer was, it came from the youth leagues,” Alexander said. “These athletes playing together all the way up from when they’re little guys all the way up to their varsity years. I just think that the more you can implement a system and the longer off you can be in a system the better off you’re going to be.” \nAlexander has come in and put his stamp on the program. While he may be making waves early on in his tenure, even with all his experience and success, he gravitates toward modesty. \n“I don’t have the answers to everything,” Alexander said. “I’m just a normal old guy.” \nGreenberg is a student in the Sports Media Certificate program at the University of Georgia’s Grady College of Journalism and Mass Communication. \n ", "external_links": [], "published": "2015-10-09T05:45:00.000+03:00", "crawled": "2015-10-09T08:20:51.684+03:00", "highlightTitle": ""}