{"organizations": ["Malone Ashland University", "Unbeaten Eagles", "Malone Unbeaten Eagles", "Ashland University"], "uuid": "da95384fd892a09dbf46d896b3b6453964bc712c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mansfieldnewsjournal.com", "main_image": "http://www.gannett-cdn.com/-mm-/f5a959e19014d502a9677ac22a1895bc8fd8b8e7/c=0-444-2040-1597&amp;r=x633&amp;c=1200x630/local/-/media/2015/09/30/OHGroup/Mansfield/635792493936349995-Football.jpg", "site_section": "http://rssfeeds.mansfieldnewsjournal.com/mansfield/sports", "section_title": "Mansfield - Sports", "url": "http://www.mansfieldnewsjournal.com/story/sports/high-school/2015/10/01/cross-country-runners-friends-not-rivals-austin-hallabrin-jacob-long/73052176/", "country": "US", "title": "Unbeaten Eagles take on Malone", "performance_score": 0, "site": "mansfieldnewsjournal.com", "participants_count": 0, "title_full": "Unbeaten Eagles take on Malone", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T17:48:00.000+03:00", "replies_count": 0, "uuid": "da95384fd892a09dbf46d896b3b6453964bc712c"}, "author": "", "url": "http://www.mansfieldnewsjournal.com/story/sports/high-school/2015/10/01/cross-country-runners-friends-not-rivals-austin-hallabrin-jacob-long/73052176/", "ord_in_thread": 0, "title": "Unbeaten Eagles take on Malone", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Unbeaten Eagles take on Malone Ashland University sports information 10:48 a.m. EDT October 1, 2015 Ashland University football CONNECT TWEET LINKEDIN COMMENT EMAIL MORE \nASHLAND — Tom Benson Hall of Fame Stadium in Canton — formerly Fawcett Stadium — has become unbeaten Ashland University's home away from home. \nThe 13th-ranked Eagles will play their second game this season when they face Malone on at 2 p.m. Saturday in a Great Lakes Intercollegiate Athletic Conference contest. AU went overtime to beat Walsh 31-24 there in the second game of the season. \nAshland is coming off a 40-28 victory over Findlay. Quarterback Travis Tarnowski was 13-for-27 for 240 yards passing, including three touchdown passes to tailback Vance Settlemire (66 yards), sophomore wide receiver Terrrance Burt (75) and senior fullback Aaron Weyer (six). Sophomore tight end Adam Shaheen caught seven passes for 70 yards. \nThe young series between the Eagles and Pioneers has been all Ashland, 3-0, including last year's 42-13 victory at home. All six AU touchdowns came on the ground, including two from tailback and Clear Fork grad Jordan McCune. Ashland ran for 382 yards, part of a 552-yard day. Defensively, AU allowed just 258 yards, forcing three turnovers. \nIt's been a long time since AU fans have seen a tight end receiving threat like Adam Shaheen. He caught seven passes for 70 yards in AU's victory over Findlay. \nLining up as both a traditional tight end and a wide receiver, Shaheen leads the Eagles with 24 catches and 314 receiving yards, and is tied for the team lead with two touchdown catches. That yardage total is the most in a season by an AU tight end in the Lee Owens era, and the catches are two short of the best over the last 12 seasons. \nShaheen also has two of the top three reception games and the top two receiving yardage games for an Ashland tight end in the Owens era. Settlemire leads the GLIAC in rushing yards per game at 135.7 and all-purpose yards per game at 169.7, and is third in the conference at 6.7 yards per carry. \nStill, Owens would prefer to not use Settlemire as much as he has. \n\"I'd like to keep fresh legs on the field,\" Owens said. \"We need to get more productivity out of our backup tailbacks.\" \nThe Eagle defense has six interceptions and eight takeaways this season, already getting close to its 2014 full-season numbers (eight picks, 14 takeaways). Ashland is on a pace for 15 interceptions in the regular season, which would be the program's highest single-season total since 2011 (15). \n\"When you're as skilled in the back end (as we are) and the ball's in the air as it has been, we're going to come down with some balls,\" Owens said. Read or Share this story: http://ohne.ws/1KOJ1HY More Stories", "external_links": [], "published": "2015-10-01T17:48:00.000+03:00", "crawled": "2015-10-02T02:13:49.853+03:00", "highlightTitle": ""}