{"organizations": [], "uuid": "70cd9384599b3eccbf29b7ac92b9d04d8b4c9ee9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "host.madison.com", "main_image": "http://bloximages.chicago2.vip.townnews.com/host.madison.com/content/tncms/assets/v3/editorial/8/cf/8cf63194-001f-5efe-8c7b-88076a9597e1/560b462b7e7c3.image.jpg?resize=620%2C457", "site_section": "http://host.madison.com/search/?f=rss&t=article&c=sports/high-school/soccer&l=25&s=start_time&sd=desc", "section_title": "host.madison.com - RSS Results in sports/high-school/soccer of type article", "url": "http://host.madison.com/sports/high-school/soccer/prep-boys-soccer-robleh-omar-provides-the-punch-as-madison/article_0d1c9050-f856-5192-a5b4-b79c415d961c.html", "country": "US", "title": "Prep boys soccer: Robleh Omar provides the punch as Madison West blanks Memorial", "performance_score": 0, "site": "madison.com", "participants_count": 1, "title_full": "Prep boys soccer: Robleh Omar provides the punch as Madison West blanks Memorial", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T07:30:00.000+03:00", "replies_count": 0, "uuid": "70cd9384599b3eccbf29b7ac92b9d04d8b4c9ee9"}, "author": "JON MASSON jmasson@madison.com, 608-252-6185", "url": "http://host.madison.com/sports/high-school/soccer/prep-boys-soccer-robleh-omar-provides-the-punch-as-madison/article_0d1c9050-f856-5192-a5b4-b79c415d961c.html", "ord_in_thread": 0, "title": "Prep boys soccer: Robleh Omar provides the punch as Madison West blanks Memorial", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Buy Now AMBER ARNOLD — State Journal \nMadison West’s Robleh Omar reacts after scoring a first-half goal against Madison Memorial on Tuesday night at Mansfield Stadium. \nIt wasn’t difficult to find Madison West senior forward Robleh Omar on Tuesday night. \nThe UW-Green Bay recruit was right in the middle of the action. \nOmar scored two goals and assisted on another, leading the West boys soccer team to a 3-0 victory over host Madison Memorial in a Big Eight Conference match at Mansfield Stadium. \n“They are a very strong side,” Omar said of Memorial. “I think we are really turning into the team we are capable of being right now. It’s better to turn into that team now than earlier.” \nOmar delivered the game’s first goal for West (8-1-2 overall, 3-0-1 Big Eight), off an assist from senior midfielder Chris Bajek, at 21 minutes, 42 seconds. \nThen Omar, making a run on the left flank, crossed a pass into the middle of the field, finding an open Frankie Herrera. \nHerrera, a senior forward, promptly converted the Regents’ second goal at the 52:50 mark. \n“They were man-marking me,” Omar said. “What we decided to do was, we tried to isolate myself on the wing with their outside backs. A few plays previously, I got the ball and I tried a shot when I probably should have tried to pass it. The next time, I made sure I slotted it across so he had an easy finish.” \nOmar was back at it again at 65:38, receiving a pass from junior defender Nate Brody and blasting in a shot from the left side for a 3-0 advantage. \n“We came out in the second half and we started to find our balance and just look for our opportunities and put some stuff away,” West coach Peter Dermody said. “Sometimes (this season) we haven’t put away those opportunities. We did a nice job of moving the ball quicker and making that second-to-last pass and we did (finish) today. We made that final pass, to set guys up for easier chances.” \nThe Spartans (8-5-1, 3-2-0) were without senior defender Josh Blumenstein, sidelined by a broken collarbone. Offensively, Memorial — led by senior midfielder Dominick Mesdjian, a University of Wisconsin recruit — didn’t generate many chances. \n“That’s a credit to West — box organization, just swarming around the ball,” Spartans coach Ben Voss said. “We just didn’t have much. It was an hour-and-a-half of a lot of running. We didn’t give the crowd a lot to cheer about.” \nWest remained in second place with Beloit Memorial, chasing league leader Middleton. \n“West is at the top of the conference for a reason,” Voss said. “They are aggressive with their style of play and we are not. We are the opposite of that. We are a little bit passive and don’t challenge for balls … We didn’t combine a lot of passes. It makes it hard. It makes for a lot of defending, a lot of running around .” \nMadison West 1 2 — 3 \nMadison Memorial 0 0 — 0 \nFirst half: MW — Omar (Bajek), 21:42. \nSecond half: MW — Herrera (Omar), 52:50; Omar (Brody), 65:38. \nSaves: MW (Alvarado) 5; MM (Jones) 7.", "external_links": [], "published": "2015-09-30T07:30:00.000+03:00", "crawled": "2015-10-01T11:18:22.878+03:00", "highlightTitle": ""}