{"organizations": [], "uuid": "6eaa93faf68a5d5cb9d1da73b9200382ef333789", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thesportsbank.net", "main_image": "http://www.thesportsbank.net/core/wp-content/uploads/2014/10/Shoe-Parade-300x206.jpg", "site_section": "http://www.thesportsbank.net/feed/", "section_title": "The Sports Bank.Net", "url": "http://www.thesportsbank.net/iowa-2/22-iowa-football-vs-illinois-illini-game-preview/", "country": "US", "title": "#22 Iowa Football vs Illinois game preview", "performance_score": 0, "site": "thesportsbank.net", "participants_count": 1, "title_full": "#22 Iowa Football vs Illinois game preview", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T22:52:00.000+03:00", "replies_count": 0, "uuid": "6eaa93faf68a5d5cb9d1da73b9200382ef333789"}, "author": "paulmbanks", "url": "http://www.thesportsbank.net/iowa-2/22-iowa-football-vs-illinois-illini-game-preview/", "ord_in_thread": 0, "title": "#22 Iowa Football vs Illinois game preview", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tweet The Illinois Fighting Illini (4-1, 1-0) will look for their fourth-straight B1G win this Saturday, when they travel to Iowa City to face a 22nd ranked Iowa football (5-0, 1-0) team that is right there with Northwestern as everyone’s sexy picks to win the Big Ten West. The two preseason favorites, Nebraska and Wisconsin, are very vulnerable right now. So if this Iowa Football team doesn’t get caught looking too far ahead to their trip to Northwestern next week, we could have a quasi-Big Ten West championship game in Ryan Field on October 17th. That is provided, everyone holds serve in their games after the 17th of course too. Now if both Iowa and Northwestern win this weekend, then NU-Iowa becomes a bigger and more meaningful game than Notre Dame-USC the same day. That would have seen like a crazy idea two weeks ago. SPREAD: Iowa football -11 TV: ESPN2 11 AM Central This will mark Illinois’ first trip to Kinnick Stadium since Oct. 13, 2007. If they pull off the upset here, as we said in the open, it would mean four straight Big Ten wins. That’s an #OMGFacts moment when you consider all the long, horrifying Big Ten losing streaks this program has endured over the years. \nWe’re still puzzled by what happened last weekend. It was extremely weird and rather fishy, but we’ll take it!. Why did the spread change 4 points in favor of Illinois hours before kickoff? Why did some sports books suspend betting on it entirely that morning? \nWhy Mike Riley call a passing play that involves not actually throwing a pass with their final offensive play? Why did a stellar, seasoned QB like Tommy Armstrong fail to execute it? Why did Illini football throw the same pass to the same spot to the same receiver over and over at the end? \nWhy did the Nebraska defenders keep getting flagged for pass interference? Why is all this so odd? Why do we have so many questions? \nThen, Monday saw the Big Ten officials even release a statement saying what a cluster#$% the officiating was in this game. Of course, they said so in PRspeak and legalese, but still the head of officials did own up to this and issued a mea culpa. There are red flags all over the place with this game. Something, and I have no idea what that is, was up. Here’s my weekly segment for 1620 The Zone previewing the Northwestern vs Michigan football game and Illinois vs Iowa football game embedded below: \nNevertheless, Illini football is not 4-1, and that means they just need to go 2-5 down the stretch to go bowling again (no six win Big Ten team will ever be home for the holidays in this new era of bowl expansion). Having a game versus Purdue on the schedule certainly helps Illinois’ bowl chances. Prediction: Iowa football 27, Illinois 23. Apologies for the game previews and predictions being so late this week. As it’s mid-season, we had to start our bowl projection aggregation articles for each teams (Here’s the link to the Illini’s) , and of course the Chicago Cubs in the postseason jumped the editorial pecking order. Next week, we’ll have the previews posted by Tuesday morning, Wednesday at the latest. This Iowa football team is locked and loaded right now. They’ll win decisively; with the Illini getting some late garbage time points for window dressing purposes. Paul M. Banks owns, operates and sometimes writes The Sports Bank.net , which is partnered with FOX Sports Engage Network. The website is also featured on News Now. Banks, a former writer for the Washington Times, currently contributes to the Chicago Tribune RedEye. He also appears regularly on numerous talk shows all across the country. Catch him Tuesdays on KOZN 1620 The Zone.", "external_links": [], "published": "2015-10-08T22:52:00.000+03:00", "crawled": "2015-10-08T23:22:16.294+03:00", "highlightTitle": ""}