{"organizations": ["Wizards", "Knicks"], "uuid": "229b785c1a5e3a2fd8319b287d9808f5e59067b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pendletontimespost.com", "main_image": "", "site_section": "http://pendletontimespost.com//feed/sec/6000/", "section_title": "PendletonTimesPost.com - Sports News", "url": "http://www.pendletontimespost.com/view/story/6b68204d569445de851f08f701eead46/BKN--Knicks-Wizards/", "country": "US", "title": "Anthony strong again as Knicks beat Wizards 115-104", "performance_score": 0, "site": "pendletontimespost.com", "participants_count": 0, "title_full": "Anthony strong again as Knicks beat Wizards 115-104", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T04:46:00.000+03:00", "replies_count": 0, "uuid": "229b785c1a5e3a2fd8319b287d9808f5e59067b6"}, "author": "", "url": "http://www.pendletontimespost.com/view/story/6b68204d569445de851f08f701eead46/BKN--Knicks-Wizards/", "ord_in_thread": 0, "title": "Anthony strong again as Knicks beat Wizards 115-104", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Anthony"], "text": "Anthony scores 21, strong again in return from knee surgery as Knicks beat Wizards 115-104 THE ASSOCIATED PRESS   9:54   9:54   \nPeople: Photo Gallery: \nClick to view (5 Photos) \nWASHINGTON — Carmelo Anthony continued his return from a knee operation with his second straight strong performance, scoring 21 points in 25 minutes as the New York Knicks beat the Washington Wizards 115-104 on Friday night. \nAnthony, who underwent left knee surgery in February, shot 10 of 15, including 4 of 5 in the second half. He made a pretty turnaround fade away from 18 feet with 1.9 seconds remaining in the first half. \nIn his first game since surgery, Anthony shot 8 of 10 for 17 points against Paschoalotto Bauru of Brazil. \nWashington's Bradley Beal provided the most memorable shot of the evening with a driving dunk midway in the third quarter. Beal leaped, and the ball hit the Knicks' Kristaps Porzingis in his shoulder on the way down. \nPorzingis, a 7-foot-3 Latvian taken fourth overall in the draft, had nine points and 10 rebounds. \nNew York's Derrick Williams had 23 points — 13 in the fourth quarter. \nMarcin Gortat led the Wizards with 15. \nOUBRE IN: Kelly Oubre Jr., Washington's first pick in the draft, played for the first time and did not score in 24 minutes. He missed all seven shots he attempted. \nTHEY'RE OUT: Knicks C/F Kevin Seraphin was out with a sore right knee. Coach Derek Fisher said he hoped Seraphin would be ready to play Monday night. G Arron Afflalo was out with a sore left hamstring. \nThe Wizards were missing G Garrett Temple (left hamstring), C/F DeJuan Blair (left knee), F Drew Gooden (glute), G/F Alan Anderson (left ankle), F Jared Dudley (back) and G/F Martell Webster (right hip). \nSLOWDOWN?: Washington played at a much slower pace than they did in putting up 129 points against Philadelphia on Wednesday night. \nUP NEXT: New York hosts Philadelphia on Monday. Washington hosts Paschoalotto Bauru on Sunday night. \n ", "external_links": [], "published": "2015-10-10T04:46:00.000+03:00", "crawled": "2015-10-10T04:57:11.746+03:00", "highlightTitle": ""}