{"organizations": [], "uuid": "6cfe97451f1c8f9bf706ffea82cfeb9f88b13a68", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.examiner.com", "main_image": "http://cdn2-b.examiner.com/sites/default/files/styles/image_content_width/hash/92/7a/927a5f50a8504696885a0d3085a97efa.jpg?itok=Sub_nvs_", "site_section": "http://www.examiner.com/sports", "section_title": "Sports | Examiner.com", "url": "http://www.examiner.com/article/jimmer-waived-by-san-antonio-spurs-but-don-t-call-it-a-career-yet", "country": "US", "title": "Jimmer waived by San Antonio Spurs, but don't call it a career yet", "performance_score": 0, "site": "examiner.com", "participants_count": 1, "title_full": "Jimmer waived by San Antonio Spurs, but don't call it a career yet | Examiner.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T06:41:00.000+03:00", "replies_count": 0, "uuid": "6cfe97451f1c8f9bf706ffea82cfeb9f88b13a68"}, "author": "Brian Shaw", "url": "http://www.examiner.com/article/jimmer-waived-by-san-antonio-spurs-but-don-t-call-it-a-career-yet", "ord_in_thread": 0, "title": "Jimmer waived by San Antonio Spurs, but don't call it a career yet", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Play Sacramento Kings star Jimmer Fredette is getting married today. The basketball star tweeted this morning,\"Wedding Day today! Ready for the best day of my life so far with @whitwonnacott!\" Fredette and Whitney Wonnacott met during an NCAA Tournament... on.aol.com Amazing how in the face of adversity, some people rise above it. Take Jimmer , for instance. This guy has seen more heartache in his five-year NBA career than just about anyone in existence. Also, in his five year stint he's played for more teams than most NBA players currently playing.\nThe San Antonio Spurs were the latest NBA franchise to leave the former BYU star hanging, releasing him on Wednesday after training camp and a handful of preseason games.\nSaying Jimmer played a handful of games with San Antonio though is saying a mouthful. He played in two games, scoring a grand total of four points in 26 minutes of action.\nInquiring minds want to know: what happened to this kid that he could literally go from being a consensus college player of the year at BYU to a can't miss NBA Draft darling that the Sacramento Kings traded down to acquire with the No. 10 pick--only to watch his pro career implode after five uneventful seasons?\nWell, according to one person, the writing was on the wall by the time Jimmer finished his pre-draft reality show, grabbed his ESPY Award and strolled down the red carpet after winning so many trophies in college.\n\"Jimmer thinks everybody is stupid,\" said an NBA assistant who worked with Fredette. \"He thinks everybody needs to come and just turn over their offense and let him shoot it anytime he wants. That's not how the league works.\"\nOf course, you'd have never hear Jimmer actually say what he thought; he always said and did the right things on and off the court, which endeared him to just about every red-blooded American. The main problem was he couldn't play defense. The second problem was that he was who he was: a good shooter who over time got exposed by more athletic guys.\nThat's precisely what happened at Spurs training camp, as Jimmer was passed over for guys who could do other things on the basketball court besides shoot the rock well. And so for a reported $500,000 training camp-only deal , the former BYU star got a little bit of run in San Antone--but not nearly as much as he probably wanted. Next up: probably Europe, maybe even the D-League--or maybe he'll find another NBA team. With this kid, you never know.\nIn a way, his legend still lives and his staying power in the league proves the point. Beloved the world over--especially in Utah County--Jimmer was the only Utah-based athlete in recent memory to be known by one name. The last guy with that kind of one-name status locally wasn't even from Utah--he was from the backwoods of Louisiana--and he earned his nickname in college, just like Jimmer.\nUnlike the Mailman though, the former BYU star never caught on in the NBA. But if you think Jimmer is done as a basketball player, you're drinking the Kool-Aid and reading too many stories.\nJimmer is still the ultimate honey badger and so counting him out of the NBA or professional basketball is quite possibly you underestimating what this guy can do. If you know anything about Jimmer and his interesting journey in the world's best league, well, you'd better think twice before writing his eulogy . Because some NBA coach still probably thinks Jimmer can shoot.", "external_links": ["http://espn.go.com/nba/story/_/id/13940318/jimmer-fredette-waived-san-antonio-spurs", "http://www.deseretnews.com/article/865639568/Jimmer7s-greatest-hits-A-look-back-at-the-most-entertaining-moments-from-Fredette7s-career.html", "http://sports.yahoo.com/news/why-jimmer-fredette-has-been-such-a-big-bust-in-the-nba-023311779.html"], "published": "2015-10-22T06:41:00.000+03:00", "crawled": "2015-10-23T03:04:38.907+03:00", "highlightTitle": ""}