{"organizations": [], "uuid": "e83aca7e2682a449d20d19697b128568f4557427", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "http://s4.reutersmedia.net/resources/r/?m=02&d=20151026&t=2&i=1089940083&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB9P16Y", "site_section": "http://www.reuters.com/news/sports", "section_title": "Sports News, Highlights &amp; Coverage | Reuters.com", "url": "http://www.reuters.com/article/2015/10/26/us-motor-racing-usa-idUSKCN0SK2IG20151026", "country": "US", "title": "Ecclestone wants more races in America", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Ecclestone wants more races in America | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T22:47:00.000+02:00", "replies_count": 0, "uuid": "e83aca7e2682a449d20d19697b128568f4557427"}, "author": "Alan Baldwin", "url": "http://www.reuters.com/article/2015/10/26/us-motor-racing-usa-idUSKCN0SK2IG20151026", "ord_in_thread": 0, "title": "Ecclestone wants more races in America", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "AUSTIN, Texas Formula One supremo Bernie Ecclestone says he wants more races in the United States, despite recently expressing a lack of enthusiasm for the country, with Southern California the latest possibility.\nSpeaking at last weekend's title deciding U.S. Grand Prix in Austin, the 84-year-old Briton told reporters he hoped to add more American venues to a series that is already set for a record 21 races next year.\nAsked whether he would like another race, he replied: \"And third. We'd like four races here. We'd like California. Anywhere where it doesn't rain. A few places have come up. Southern California.\n\"We are trying to do another couple of races, if I'm allowed back,\" he said, with a grin.\nEcclestone told Russian television two weeks ago, at that country's grand prix in Sochi, that \"we ought to try and beef up a little bit in America. It's hard for me. I'm not very enthusiastic about America.\"\nHe also caused a stir by expressing his admiration for Russian president Vladimir Putin and disdain for democracy in general.\nAustin, with a purpose-built circuit, is Formula One's only current race in the United States but there have been many others in what has generally been a losing battle to win over the American public.\nWatkins Glen International, in upstate New York, held the U.S. Grand Prix from 1961 to 1980 while F1 races have also been held at Long Beach in California, Las Vegas, Detroit, Dallas, Phoenix and Indianapolis.\nThe financial structure of the sport has not helped, with local promoters failing to reconcile their need to make a profit with having to pay hefty fees to the commercial rights holder.\nIndianapolis came and went as a venue while a proposed race in New Jersey never happened despite being scheduled on the provisional 2014 calendar along with Mexico, which makes its return this week.\n\"We should have done that I suppose,\" said Ecclestone of New Jersey. \"We may still. It's still possible.\"\n(Reporting by Alan Baldwin, editing by Rex Gowar)", "external_links": [], "published": "2015-10-26T22:47:00.000+02:00", "crawled": "2015-10-26T22:32:31.393+02:00", "highlightTitle": ""}