{"organizations": [], "uuid": "bf11be47b98e527bf5c4f7bd0dcd26e1fc1d84ec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mercurynews.com", "main_image": "http://local.mercurynews.com/common/dfm/assets/logos/1200x627/mercurynews.png", "site_section": "http://feeds.mercurynews.com/mngi/rss/CustomRssServlet/568/200795.xml", "section_title": "College Sports", "url": "http://www.mercurynews.com/sports/ci_28976077/stanford-prepare-pac-12-brutal-non-league-lineup?source=rss", "country": "IL", "title": "Stanford to prepare for Pac-12 with brutal non-league lineup", "performance_score": 0, "site": "mercurynews.com", "participants_count": 1, "title_full": "Stanford to prepare for Pac-12 with brutal non-league lineup", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T01:58:00.000+03:00", "replies_count": 0, "uuid": "bf11be47b98e527bf5c4f7bd0dcd26e1fc1d84ec"}, "author": "Jeff Faraudo\n\njfaraudo@bayareanewsgroup.com", "url": "http://www.mercurynews.com/sports/ci_28976077/stanford-prepare-pac-12-brutal-non-league-lineup?source=rss", "ord_in_thread": 0, "title": "Stanford to prepare for Pac-12 with brutal non-league lineup", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Stanford to prepare for Pac-12 with brutal non-league lineup By Jeff Faraudo Posted: 10/15/2015 03:58:11 PM PDT Updated: 10/15/2015 03:58:13 PM PDT SAN FRANCISCO -- The nonconference schedule Stanford's basketball team will play this season speaks to what coach Johnny Dawkins thinks his group can be. \nAnd he is convinced the Cardinal can be better than the Pac-12's ninth-place team, as the league's media envisions. \nThe Cardinal figures to start three sophomores and have as many as three true freshman in its rotation when it takes on the likes of Villanova, Texas, SMU and either Arkansas or Georgia Tech before the start of conference play. \n\"We don't shy away from playing people,\" Dawkins said Thursday at Pac-12 media day. \"For what we want to be as a program, we have to play these teams. I wouldn't be playing these teams if I didn't think they were ready, too young or whatever. I believe in my guys.\" \nSenior forward Rosco Allen also has more faith in his teammates than in a Pac-12 media panel. \n\"Our job right now is just to prove you guys wrong,\" he said. \"Go out and win games.\" \nWinner of the postseason NIT last season, the Cardinal returns without three departed senior starters. The threesome of school career scoring leader Chasson Randle, Anthony Brown and Stefan Nastic combined to score 66 percent of Stanford's points a year ago. \n\"I tell our guys, `It's about your opportunities. It's not about who's missing, but you guys. It's time for you guys to step up in those roles and start establishing yourselves.\" Advertisement \nDawkins will build this team around the sophomore frontcourt tandem of Reid Travis and Michael Humphrey. Travis, a 6-foot-8, 245-pounder, is a powerful and explosive player who was limited last season by foot and knee problems. Humphrey, at 6-9, 220, suffered a high-ankle sprain just as he was hitting his stride at mid-season, then contracted mononucleosis a week before the team left on its summer tour of Italy. \nBoth are now healthy and Dawkins likes the way they will complement each other. \n\"We have a chance to have one of the best frontlines in our conference as they continue to mature,\" Dawkins said. \"I think the future is bright for those guys.\" \nCombo forward Rosco Allen, who battled a back injury last season, is the team's top returning scorer at 7.3 points per game. \nShooting guard Marcus Allen (no relation) stepped up his game during both the NIT and in Italy, then suffered a stress fracture of his right foot on the first day of practice this month. There is no timetable for his return, although the Cardinal hopes he'll be back for the Nov. 13 opener against Wisconsin-Green Bay. \nSophomore Robert Cartwright takes over at the point for Randle, and will function as more of a distributor than scorer. \n\"We recruited Robert to put the ball in his hands, and his time is now,\" Dawkins said. \"He needs to be a leader on the floor. He needs to make the guys around him better. \n\"Watching him grow the last few weeks and in Italy has been exciting.\" \nAmong three highly regarded freshmen, 7-footer Josh Sharma has a head start because of minutes he got in Italy with Humphrey sidelined. Wing Marcus Sheffield is a shooter and Cameron Walker is a versatile 6-7 forward who played every position except center in Italy. Follow Jeff Faraudo on Twitter at twitter.com/Jeff Faraudo.", "external_links": [], "published": "2015-10-16T01:58:00.000+03:00", "crawled": "2015-10-16T02:41:06.292+03:00", "highlightTitle": ""}