{"organizations": [], "uuid": "8e8868cf798c17a3e21878148677d45e98ce920b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtontimes.com", "main_image": "http://media.washtimes.com.s3.amazonaws.com/media/image/2015/10/02/202a21524346a72c830f6a7067000ef5.jpg", "site_section": "http://www.washingtontimes.com/rss/headlines/sports/", "section_title": "www.washingtontimes.com stories: Sports", "url": "http://www.washingtontimes.com/news/2015/oct/2/djokovic-and-nadal-mix-tennis-with-politics-on-tha/", "country": "US", "title": "Djokovic and Nadal mix tennis with politics on Thailand trip", "performance_score": 0, "site": "washingtontimes.com", "participants_count": 1, "title_full": "Djokovic and Nadal mix tennis with politics on Thailand trip", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T13:46:00.000+03:00", "replies_count": 0, "uuid": "8e8868cf798c17a3e21878148677d45e98ce920b"}, "author": "JOCELYN GECKER", "url": "http://www.washingtontimes.com/news/2015/oct/2/djokovic-and-nadal-mix-tennis-with-politics-on-tha/", "ord_in_thread": 0, "title": "Djokovic and Nadal mix tennis with politics on Thailand trip", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sports Djokovic and Nadal mix tennis with politics on Thailand trip Top tennis players, Novak Djokovic of Serbia, left, and Rafael Nadal of Spain, hold garland to offer for Phra Phrom, the Thai interpretation of the Hindu god Brahma, at the Erawan Shrine in Bangkok, Thailand, Friday, Oct. 2, 2015. Thailand ... more > By JOCELYN GECKER -   \nBANGKOK (AP) - Two of the world’s top tennis players, Novak Djokovic and Rafael Nadal, came to Bangkok to earn a few million dollars for an exhibition match. But there were a few strings attached. \nBefore their Friday night match, Djokovic and Nadal swapped tennis clothes for formal Thai silk jackets in baby blue and pastel yellow. The dress code was part of a tightly scripted trip meant to boost military-ruled Thailand’s image, which included a meeting with the junta leader. \nOne of the day’s many photo opportunities was at the Erawan Shrine, the site of a deadly bombing in August, where the players laid wreaths and posed for pictures under tight security and a pelting rain. \nThe No. 1-ranked Djokovic and his longtime rival Nadal were playing a sold-out exhibition match dubbed “Back to Thailand.” The event was organized by local authorities to boost confidence in the country’s safety after the bombing that left 20 people dead and more than 120 injured. \nThe Lawn Tennis Association of Thailand, an organizer of the event, said the players would receive a total of 150 million baht ($4.1 million) for coming to Thailand. \nNot bad for playing a best-of-three-set match scheduled to last two hours. When Djokovic won the U.S. Open after two weeks of intense tennis and a grueling four-set final against Roger Federer, his prize money was $3.3 million. \nOne requirement for the easy money in Thailand, apparently, was the dress code. The players were outfitted in traditional silk jackets in colors of respect for the country’s monarchy. Djokovic wore yellow - the color that represents the king of Thailand - and Nadal wore blue, in respect for the queen. \nIn their formal attire, the players visited the ornate Grand Palace and then met with the junta leader, Prayuth Chan-ocha, who led a May 2014 coup that overthrew an elected government and then installed himself as prime minister. \n“I’m glad that two of the world’s best tennis players are here in Thailand,” Prayuth told the U.S. Open champion and the No. 7-ranked Nadal during a meeting at his office, known as Government House. \n“This will get more people to come to Thailand,” Prayuth added, as he shook hands with each player and they exchanged gifts. Djokovic, winner of 10 Grand Slams, and 14-time Grand Slam champion Nadal each presented the junta leader with a tennis racket, and Prayuth gave them each a golden replica of a traditional Thai mask. \nThailand’s vital tourism industry has grappled with how to overcome the bad publicity of the 2014 coup followed by the August bombing, in the heart of Bangkok, which police say was linked to China’s Muslim Uighur minority. \nLater in the day, the players warmed up for the evening match, which both said was meant to give a good show to the crowd in the 5,700-seat Hua Mark indoor stadium. \nAt a Thursday news conference, Djokovic said he hoped to bring “a smile” to fans faces and Nadal said the purpose of the exhibition was “to create good fun for the people.” \nDjokovic and Nadal have faced each other 43 times in tour-level matches, with Nadal winning 23 but Djokovic winning their last two matches at the French Open and Monte Carlo. \nDjokovic last came to Thailand in 2008 when he lost the final of the Thailand Open to Jo-Wilfried Tsonga, while Nadal visited the capital in 2010 for the same tournament and lost in the semifinals. \nCopyright © 2015 The Washington Times, LLC.", "external_links": [], "published": "2015-10-02T13:46:00.000+03:00", "crawled": "2015-10-02T15:20:36.552+03:00", "highlightTitle": ""}