{"organizations": [], "uuid": "724153930a17d38faaf894ca9915738d779c659e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.si.com", "main_image": "http://cdn-jpg.si.com/sites/default/files/styles/si_gallery_slide/public/2015/10/12/kevin-johnson-doc-espn.jpg?itok=XrVGux_g", "site_section": "http://www.si.com/htmlsitemap/2014/07/page-1", "section_title": "The Sports Illustrated HTML Sitemap Index for July, 2014 - SI.com", "url": "http://www.si.com/nba/2015/10/12/espn-delay-kevin-johnson-sacramento-kings-documentary", "country": "US", "title": "ESPN delays '30 for 30' Kevin Johnson doc in light of sex allegations - NBA", "performance_score": 0, "site": "si.com", "participants_count": 8, "title_full": "ESPN delays '30 for 30' Kevin Johnson doc in light of sex allegations - NBA - SI.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 7, "uuid": "15294fd1c14341ae0b9a9ce65420e9932c8f907f"}, "author": "Richard Deitsch", "url": "http://www.si.com/nba/2015/10/12/espn-delay-kevin-johnson-sacramento-kings-documentary#post-0", "ord_in_thread": 0, "title": "ESPN delays '30 for 30' Kevin Johnson doc in light of sex allegations - NBA", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "by Richard Deitsch Twitter Facebook Email Posted: Mon Oct. 12, 2015 In light of recent articles revisiting allegations of sexual misconduct involving Sacramento Mayor Kevin Johnson, ESPN has decided to delay its on-the-air premiere of Down In The Valley , a 30 for 30 ESPN Film that focuses on the fight to keep the Sacramento Kings from relocating to another city. The 77-minute documentary, which was scheduled to air Oct. 20 at 9 p.m. ET on ESPN, does not have a new release date at the moment. Johnson, who has been Mayor of Sacramento since 2008, is a key figure in the film.\n“We are re-evaluating the content presentation of it and delaying the premiere,” said John Dahl, the vice president and executive producer of ESPN Films and Original Content. “When [director] Jason Hehir and we collectively agree that the film is ready and we are comfortable with it, then we will pick that air date. I think the most important thing here is to make sure it’s clear that we are not tone deaf and we’re aware of a renewed focus on certain issues.\"\n• MEDIA CIRCUS: Grantland's mass exodus, Andy Katz show shelved\nWhat Dahl is referring to is a series of stories on Johnson by Deadspin’s Dave McKenna including one that featured Mandi Koba, a mother of three and an advocate for survivors of sexual abuse. Koba told McKenna that nearly 20 years ago, Johnson paid her a six-figure settlement to remain quiet about a 1996 Phoenix police investigation into allegations that Johnson, who was 29 at the time, touched her inappropriately. Koba detailed that alleged encounter with Johnson in a Deadspin piece that ran on Sept. 25. The allegations are not new. The Sacramento Bee first reported in 2008 that she and Johnson had signed a draft confidential settlement agreement in 1997 worth $230,000. Johnson has repeatedly denied the allegations and no criminal charges were filed. Koba told Deadspin that she stayed quiet and took Johnson’s money in exchange for a pledge to never mention Johnson again except to “a priest, a therapist, or a lawyer.\nNBA Video Hawks' Thabo Sefolosha takes risk, reaps reward with not guilty verdict by Michael McCann", "external_links": ["http://www.latimes.com/local/political/la-me-pc-sacramento-mayor-harassment-claim-20150514-story.html", "http://facebook.com/RichardDeitsch", "http://www.sacbee.com/news/local/news-columns-blogs/city-beat/article36607392.html#storylink=cpy", "http://twitter.com/richarddeitsch", "http://www.sacbee.com/news/local/news-columns-blogs/marcos-breton/article19559448.html", "http://deadspin.com/im-a-grown-up-now-the-teen-who-accused-kevin-johnson-1732538782"], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-13T03:31:06.904+03:00", "highlightTitle": ""}