{"organizations": ["Devils"], "uuid": "8e75b1ba7e8b4cb994119cc8cb292782ffd57a1a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.northjersey.com", "main_image": "http://www.northjersey.com:80/polopoly_fs/1.1428153!/fileImage/httpImage/100815-s-greene40p.jpg", "site_section": "http://www.northjersey.com/cmlink/sports-rss.rss", "section_title": "Sports News on NorthJersey.com", "url": "http://www.northjersey.com/sports/hockey/devils-no-hurry-1.1428152", "country": "US", "title": "Devils in no hurry on naming a captain", "performance_score": 0, "site": "northjersey.com", "participants_count": 0, "title_full": "Devils in no hurry on naming a captain", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T08:21:00.000+03:00", "replies_count": 0, "uuid": "8e75b1ba7e8b4cb994119cc8cb292782ffd57a1a"}, "author": "", "url": "http://www.northjersey.com/sports/hockey/devils-no-hurry-1.1428152", "ord_in_thread": 0, "title": "Devils in no hurry on naming a captain", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Andy Greene", "TOM GULITTI"], "text": "Devils in no hurry on naming a captain October 8, 2015 Last updated: Thursday, October 8, 2015, 1:21 AM By TOM GULITTI ASSOCIATED PRESS file photo Devils defenseman Andy Greene says the players are not concerned about a new captain being named. \nAlthough discussions on whether to name a captain before Friday night's 2015-16 opener against Winnipeg have become more frequent in recent days, a decision has yet to be made. With general manager Ray Shero and coach John Hynes being new to the organization, they want to make sure they get to know everyone first and not rush into anything. \n\"Every day you get closer, but is it imminent? It's tough to say,\" Hynes said Wednesday of naming a captain. \"It's been an ongoing discussion. We've said all along we feel like it's not a necessity to us to have one. \n\"It doesn't mean we won't have one come Friday, but it's just something we want to talk through, and it's a minor discussion where our focus, even with the players, has been trying to get our game in order, getting to know everyone and making sure we're ready to play the game Friday first. And if the captaincy or assistant captains happen before that, that's good. If not, it's no big deal.\" \nShero said something similar. \n\"What we've found over the first month or so is there are some good leaders here both on and off the ice, and if there's not [a captain] by Friday, it's not a red flag,\" Shero said. \"If there's one in a month, great. If there's rotating assistant captains throughout the year, that's what it's meant to be. \n\"If not, it's more of a media thing or a fan thing than it is for the team or myself or John. Having said that, it's not something I take lightly either. This is why this hasn't been something that we just jumped at.\" \nThe Devils' captaincy was vacated when defenseman Bryce Salvador announced his retirement Sept. 2. Beginning the season without a captain would not be new for the Devils. \nThey went the 2005-06 season without a captain after Scott Stevens announced his retirement just a few days before training camp opened. They also began the 2007-08 season without one after Patrik Elias was stripped of the \"C\" on the first day of camp. Jamie Langenbrunner was named captain Dec. 5 of that season. \nThe current Devils say who will wear the \"C\" next is not a topic they're talking about. \n\"I don't think anyone in this room is worried about it,\" said defenseman Andy Greene, likely one of the leading candidates to be the next captain. \"Guys are going to continue to do things like they are. In reality, it's only been like three weeks since [the new coaching staff and management] have been with us on a day-to-day basis. It's not anything we're concerned about in here. It takes time, and that's fine.\" \nBRIEFS: G Cory Schneider sat out practice for what Hynes called a \"maintenance day.\" Hynes said he expects Schneider to be back at practice today, though, and to be ready for the opener. … RW Kyle Palmieri practiced again and said he is \"as close as you can get\" to 100 percent after \"tweaking something\" in his lower body during the Sept. 30 preseason game in Philadelphia.  ", "external_links": [], "published": "2015-10-08T08:21:00.000+03:00", "crawled": "2015-10-08T09:50:27.565+03:00", "highlightTitle": ""}