{"organizations": [], "uuid": "33eeadb9ca1bc484b3e0bcdf05d78feb62a325bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kansan.com", "main_image": "http://kansan.com/content/tncms/live/global/resources/images/_site/kansan-logo4_1024.png", "site_section": "http://www.kansan.com//search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&nsa=eedition&c[]=sports,sports/*&f=rss", "section_title": "The University Daily Kansan - sports,sports/", "url": "http://www.kansan.com/sports/daily-debate-after-chicago-which-midwest-city-has-the-best/article_a388bb4c-75b5-11e5-b463-db7572f2917e.html", "country": "US", "title": "Daily Debate: After Chicago, which Midwest city has the best sports scene?", "performance_score": 0, "site": "kansan.com", "participants_count": 1, "title_full": "Daily Debate: After Chicago, which Midwest city has the best sports scene?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T19:31:00.000+03:00", "replies_count": 0, "uuid": "33eeadb9ca1bc484b3e0bcdf05d78feb62a325bb"}, "author": "Nick Geidner | @nickgeidner Matt Hoffmann | @MattHoffmannUDK", "url": "http://www.kansan.com/sports/daily-debate-after-chicago-which-midwest-city-has-the-best/article_a388bb4c-75b5-11e5-b463-db7572f2917e.html", "ord_in_thread": 0, "title": "Daily Debate: After Chicago, which Midwest city has the best sports scene?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Larger font size Posted: Sunday, October 18, 2015 11:31 am \n\"Kansas City\" \nBy: Nick Geidner| @nickgeidner \nWhile the Minneapolis-St. Paul area may have more teams to cheer for, it's the heart and pride of Kansas City fans that gives Kansas City, Mo. the better sports scene in the Midwest. \nWith the Chiefs' Arrowhead Stadium and the Royals' Kauffman Stadium within walking distance of each other, it's no surprise that these two teams provide most of the excitement for Kansas City residents. \nThe parking lot that surrounds the two stadiums is a perfect example of the pride this city has, p acked with tailgaters on any game day for either of the two teams . \nThe Royals, back in the World Series race for the second year in a row, receive support almost everywhere you look in the Kansas City area. \nWith slogans like \"Take The Crown\" and \"Forever Royal\" plastered throughout social media and the streets of Kansas City, this team's playoff run is on the tops of everyone's heads day after day. \nAfter losing their star running back Jamaal Charles to an ACL injury and starting off their season with a 1-5 record, the Chiefs haven't exactly lived up to the city's expectations of them so far. \nIn other cities, fans might lose interest after a start like this. But in Kansas City, that is not the case. \nGame after game, Arrowhead Stadium is packed with loud fans all the way up to the top rows. In fact, the Kansas City fans broke the world record last season by reaching 142.2 decibels in a Monday night game against the New England Patriots, according to the Guinness Book of World Records . \nKansas City fans spread throughout the Kansas City area and a majority of the state of Missouri. \nWhile Minneapolis-St. Paul may have more overall teams to cheer for, the pride of their fans comes no where near the pride of Kansas City fans. \n\"Minnesota\" \nMatt Hoffmann | @MattHoffmannUDK On Saturday night’s telecast of the ALCS on FOX, broadcaster Joe Buck told his audience that Kansas City has the best sports complex in the nation in Arrowhead Stadium and Kauffman Stadium. Joe Buck said he thinks the complex in Kansas City is the best in sports — with Arrowhead and the K. — Scott Chasen (@SChasenKU) October 17, 2015 \nWhile it’s a unique Kauffman and Arrowhead share a parking lot, Kansas City does not have the second best sports scene in the Midwest, that honor belongs to Minneapolis-St. Paul. Sure Kansas City has four major sports teams - the Chiefs, Sporting Kansas City, the Royals and FC Kansas City. Minneapolis-Saint Paul has six major sports teams - the Timberwolves (NBA), Vikings (NFL), Wild (NHL), Twins (MLB), United (current NASL team, 2018 MLS team) and the Lynx (WNBA). That’s not to forget the Minnesota Gophers and an independent baseball team the Saint Paul Saints. It’s not just the amount of sports franchises that dot the great white north that makes Minneapolis-St. Paul the second best sports city in the Midwest behind Chicago. It’s the facilities. The Xcel Energy Center was built in 2000 and hosts not only the Wild, but has hosted the WCHA tournament and hosts the Minnesota high school state hockey tournament which boasts attendance in the hundreds of thousands. Target Field, home of the Twins, was built five years ago in 2010. In 2014, Target Field was host to the MLB All-Star Game. Target Center, the home of the Timberwolves, underwent a major renovation in 2004 and has hosted multiple WNBA finals and major college ice hockey tournaments. The new Vikings stadium, US Bank Stadium, has won the rights to host Super Bowl LII and the 2019 Final Four. Minnesota United are also in the early stages of building a new stadium which will either be in Minneapolis or Saint Paul. It’s clear, with six major sports teams and four major stadiums, Minneapolis-Saint Paul has the second best sports scene in the Midwest. You can keep your parking lot, Kansas City. — Edited by Jackson Vickery", "external_links": [], "published": "2015-10-18T19:31:00.000+03:00", "crawled": "2015-10-24T22:17:48.447+03:00", "highlightTitle": ""}