{"organizations": [], "uuid": "3ed1593aecfc5ab29bcc8f71c716e6319837916d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mysanantonio.com", "main_image": "http://ww1.hdnux.com/photos/37/76/31/8382032/7/rawImage.jpg", "site_section": "http://www.mysanantonio.com/rss/feed/mySA-Sports-921.php", "section_title": "mySA Sports", "url": "http://www.mysanantonio.com/sports/pro-sports/cowboys/article/Jerry-Jones-defends-stake-in-DraftKings-6590914.php", "country": "US", "title": "Jerry Jones defends stake in DraftKings", "performance_score": 0, "site": "mysanantonio.com", "participants_count": 1, "title_full": "Jerry Jones defends stake in DraftKings - San Antonio Express-News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T18:31:00.000+02:00", "replies_count": 0, "uuid": "3ed1593aecfc5ab29bcc8f71c716e6319837916d"}, "author": "Nick Moyle", "url": "http://www.mysanantonio.com/sports/pro-sports/cowboys/article/Jerry-Jones-defends-stake-in-DraftKings-6590914.php", "ord_in_thread": 0, "title": "Jerry Jones defends stake in DraftKings", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: Gus Ruelas /Associated Press Image 1 of / 16 Caption\nClose\nImage 1 of 16 Dallas Cowboys owner Jerry Jones answers a question during the “state of the team” news conference at the start of Dallas Cowboys’ NFL training camp, Wednesday, July 29, 2015, in Oxnard, Calif. Dallas Cowboys owner Jerry Jones answers a question during the “state of the team” news conference at the start of Dallas Cowboys’ NFL training camp, Wednesday, July 29, 2015, in Oxnard, Calif. Photo: Gus Ruelas /Associated Press Image 2 of 16 Dallas Cowboys owner Jerry Jones answers a question during the “state of the team” news conference at the start of Dallas Cowboys’ NFL training camp, Wednesday, July 29, 2015, in Oxnard, Calif. (AP Photo/Gus Ruelas) Dallas Cowboys owner Jerry Jones answers a question during the “state of the team” news conference at the start of Dallas Cowboys’ NFL training camp, Wednesday, July 29, 2015, in Oxnard, Calif. (AP ... more Image 3 of 16 Dallas Cowboys owner Jerry Jones during the team’s annual “state of the Cowboys” news conference at training camp in Oxnard, Calif., on Wednesday, July 29, 2015. Dallas Cowboys owner Jerry Jones during the team’s annual “state of the Cowboys” news conference at training camp in Oxnard, Calif., on Wednesday, July 29, 2015. Photo: Paul Moseley /Fort Worth Star-Telegram Image 4 of 16 Dallas Cowboys owner Jerry Jones makes a point during the team's annual \"state of the Cowboys\" news conference at training camp in Oxnard, Calif., on Wednesday, July 29, 2015. Dallas Cowboys owner Jerry Jones makes a point during the team's annual \"state of the Cowboys\" news conference at training camp in Oxnard, Calif., on Wednesday, July 29, 2015. Photo: Paul Moseley /Fort Worth Star-Telegram Image 5 of 16 Dallas Cowboys owner Jerry Jones, left, speaks as head coach Jason Garrett listens during the team’s annual “state of the Cowboys” news conference at training camp in Oxnard, Calif., on Wednesday, July 29, 2015. Dallas Cowboys owner Jerry Jones, left, speaks as head coach Jason Garrett listens during the team’s annual “state of the Cowboys” news conference at training camp in Oxnard, Calif., on Wednesday, July ... more Image 6 of 16 Dallas Cowboys owner Jerry Jones fields question from the news media during the “state of the team” press conference at the start of Dallas Cowboys’ NFL training camp, Wednesday, July 29, 2015, in Oxnard, Calif. Dallas Cowboys owner Jerry Jones fields question from the news media during the “state of the team” press conference at the start of Dallas Cowboys’ NFL training camp, Wednesday, July 29, 2015, in Oxnard, ... more Image 7 of 16 Dallas Cowboys wide receiver Dez Bryant, right, listens to team owner Jerry Jones on the sidelines during an NFL football minicamp at the team’s stadium in Arlington, Texas, in Arlington, Texas, Thursday, June 18, 2015. Dallas Cowboys wide receiver Dez Bryant, right, listens to team owner Jerry Jones on the sidelines during an NFL football minicamp at the team’s stadium in Arlington, Texas, in Arlington, Texas, Thursday, ... more Image 8 of 16 Dallas Cowboys wide receiver Dez Bryant, right, shakes hands with team owner Jerry Jones on their sidelines during an NFL football minicamp at the team’s stadium in Arlington, Texas, in Arlington, Texas, Thursday, June 18, 2015. Bryant joined his teammates for the last day of minicamp. Bryant didn’t practice Thursday since he still has not signed his franchise tender that would guarantee him $12.8 million this season. Dallas Cowboys wide receiver Dez Bryant, right, shakes hands with team owner Jerry Jones on their sidelines during an NFL football minicamp at the team’s stadium in Arlington, Texas, in Arlington, Texas, ... more Image 9 of 16 Dallas Cowboys quarterback Tony Romo, right, listens to Cowboys owner Jerry Jones as they chat on the sideline during a minicamp at the team’s stadium in Arlington on June 17, 2015. Dallas Cowboys quarterback Tony Romo, right, listens to Cowboys owner Jerry Jones as they chat on the sideline during a minicamp at the team’s stadium in Arlington on June 17, 2015. Photo: LM Otero /Associated Press Image 10 of 16 Dallas Cowboys head coach Jason Garrett, left, smiles as team owner Jerry Jones responds to questions about Garrett's five year contract extension during a news conference at the teams headquarters, Thursday, Jan. 15, 2015, in Irving, Texas. Scott Linehan is returning to the Cowboys along with coach Garrett and will add the title of offensive coordinator after one season as Tony Romo's play-caller. Dallas Cowboys head coach Jason Garrett, left, smiles as team owner Jerry Jones responds to questions about Garrett's five year contract extension during a news conference at the teams headquarters, Thursday, ... more Image 11 of 16 In this Sept. 9, 2015, file photo, Len Don Diego, marketing manager for content at DraftKings, a daily fantasy sports company, works at his station at the company's offices in Boston. The daily fantasy sports industry is eyeing a breakout season as NFL games begin. And its two dominant companies, DraftKings and FanDuel, are touting lucrative opening week prizes to try to draw more customers as more competitors pop up. (AP Photo/Stephan Savoia, File) In this Sept. 9, 2015, file photo, Len Don Diego, marketing manager for content at DraftKings, a daily fantasy sports company, works at his station at the company's offices in Boston. The daily fantasy sports ... more Image 12 of 16 In this Sept. 29, 2015 file photo, Jason Robins, center, CEO of DraftKings website, speaks on a panel at the Global Gaming Expo in Las Vegas. In this Sept. 29, 2015 file photo, Jason Robins, center, CEO of DraftKings website, speaks on a panel at the Global Gaming Expo in Las Vegas. Photo: John Locher /Associated Press Image 13 of 16 In this Sept. 9, 2015 file photo, Devlin D’Zmura, a tending news manager at DraftKings, a daily fantasy sports company, works on his laptop at the company’s offices in Boston. In this Sept. 9, 2015 file photo, Devlin D’Zmura, a tending news manager at DraftKings, a daily fantasy sports company, works on his laptop at the company’s offices in Boston. Photo: Stephan Savoia /Associated Press Image 14 of 16 In this Sept. 9, 2015 file photo, an employee in the software development department of DraftKings, a daily fantasy sports company, walks past screens displaying the company’s online system stats in Boston. In this Sept. 9, 2015 file photo, an employee in the software development department of DraftKings, a daily fantasy sports company, walks past screens displaying the company’s online system stats in Boston. Photo: Stephan Savoia /Associated Press Image 15 of 16 Len Don Diego, marketing manager for content at DraftKings, a daily fantasy sports company, works at his station at the company’s offices in Boston on Sept. 9, 2015. Len Don Diego, marketing manager for content at DraftKings, a daily fantasy sports company, works at his station at the company’s offices in Boston on Sept. 9, 2015. Photo: Stephan Savoia /Associated Press Image 16 of 16 Jerry Jones defends stake in DraftKings 1 / 16 Back to Gallery His team's horrid play hasn't been the only thing Cowboys owner Jerry Jones has had to brood over lately.\nJones is a stakeholder in DraftKings, an organization that, much like his football team, has waded into treacherous waters.\nLast week, DraftKings received a subpoena from U.S. Attorney Preet Bharara's office asking for information about an employee's activities and potential misuse of inside data.\nThe subpoena seeks information on employee Ethan Haskell, who won $350,000 playing on rival site FanDuel — the initial domino that set off a chain reaction in the daily fantasy sports (DFS) world.\nSubscribe to Spurs Nation\nCurrent\nNevada regulators have already banned DFS in their state until the companies apply for a gaming license, a double-edged sword which would effectively destroy the leverage granted to them by the Unlawful Internet Gambling Enforcement Act of 2006.\nThat statute acts as a ban against all forms of Internet gambling, but carves out an exception for fantasy sports that meet certain requirements.\nBut now, both that law and the companies it has allowed to explode onto the scene find themselves under intense scrutiny.\nRELATED: Explosion of Daily Fantasy Sports draws scrutiny\nNone of this has caused Jones to waver.\n\"From my perspective, anything that follows the rules, that causes and creates more interest and more fan participation, I'm really for,\" Jones said following the Cowboys 27-20 loss to the Giants, per ESPN's Darren Rovell . \"So I'm a supporter and that's the rules that we'll test — is put your money where your mouth is.\"\n\"I don't think DraftKings or FanDuel in any way compromise our players on the football field because it's all fantasy,\" Jones said. \"It has no bearing on the outcome of the game at all.\"\nNFL players are allowed to play fantasy games, but their counterparts in the NBA and MLB are prohibited from doing so.\nIf daily fantasy games are reclassified as gambling the NFL will be forced to bar players not only from playing, but from appearing in any of their advertisements, lest they become the modern Pete Rose.\nAnd Jones isn't the only NFL owner defending his dubious partnership.\nThe Kraft Group — founded by New England Patriots owner Robert Kraft, who should be accustomed to controversy by now — also holds a stake in the fantasy gaming giant.\nKraft's son, Jonathan, defended the legality of DraftKings and DFS on a Patriots pregame show on 98.5 The Sports Hub.\n\"Congress made it legal,\" Jonathan said. \"It's interesting to me, over the last month or so with all the yelling out of Washington about how this is an unregulated industry — well, they have the right to regulate it. They chose to make it legal and not pass regulations.\"\nRegulations appear to be coming, the ripple effect of which could reverberate throughout all four major sports leagues.\nIt might not be long before the Cowboys and Patriots have to bid farewell to their stadium's freshly minted DraftKings-branded sports lounges.\nFor Jones, this would be yet another loss in a season full of them.\nnmoyle@express-news.net\nTwitter: @NRMoyle", "external_links": ["http://ww1.hdnux.com/photos/37/76/31/8382028/7/920x920.jpg", "http://ww1.hdnux.com/photos/37/76/31/8382032/7/920x920.jpg", "http://ww1.hdnux.com/photos/37/76/31/8382032/7/square_gallery_thumb.jpg", "https://twitter.com/NRMoyle", "http://www.wsj.com/articles/u-s-prosecutor-subpoenas-draftkings-1445471672", "http://ww4.hdnux.com/photos/37/13/66/8175035/5/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/37/76/31/8382030/7/920x920.jpg", "http://ww4.hdnux.com/photos/37/76/31/8382031/7/920x920.jpg", "http://ww4.hdnux.com/photos/41/50/24/8815935/7/920x920.jpg", "http://ww1.hdnux.com/photos/37/76/31/8382028/7/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/37/76/31/8382029/7/920x920.jpg", "http://www.expressnews.com/sports/other-sports/article/Explosion-of-Daily-Fantasy-Sports-draws-scrutiny-6577795.php", "http://espn.go.com/nfl/story/_/id/13974122/jerry-jones-dallas-cowboys-defends-investment-draftkings", "http://ww2.hdnux.com/photos/37/12/17/8168413/7/920x920.jpg", "http://ww3.hdnux.com/photos/41/34/42/8767670/7/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/41/50/25/8815940/7/920x920.jpg", "https://myaccount.expressnews.com/dssSubscribe.aspx?pid=495&z=00000", "http://www.boston.com/business/news/2015/10/18/jonathan-kraft-daily-fantasy-sports-think-should-regulated/phkRJ3VPD86TjbVeosQx6J/story.html", "http://ww2.hdnux.com/photos/41/50/24/8815933/7/920x920.jpg", "http://ww2.hdnux.com/photos/37/76/31/8382033/7/920x920.jpg", "http://ww4.hdnux.com/photos/41/50/24/8815935/7/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/37/12/17/8168413/7/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/34/15/32/7394972/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/50/24/8815933/7/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/34/15/32/7394972/3/920x920.jpg", "http://ww2.hdnux.com/photos/37/13/66/8175037/5/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/40/61/8784966/7/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/37/76/31/8382031/7/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/37/13/66/8175035/5/920x920.jpg", "http://ww1.hdnux.com/photos/41/50/25/8815940/7/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/37/76/31/8382033/7/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/37/13/66/8175037/5/920x920.jpg", "http://ww3.hdnux.com/photos/41/40/61/8784966/7/920x920.jpg", "http://ww3.hdnux.com/photos/41/34/42/8767670/7/920x920.jpg", "http://ww3.hdnux.com/photos/37/76/31/8382030/7/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/37/76/31/8382029/7/square_gallery_thumb.jpg"], "published": "2015-10-26T18:31:00.000+02:00", "crawled": "2015-10-26T20:46:38.415+02:00", "highlightTitle": ""}