{"organizations": [], "uuid": "1de13c08262f1ee29a9a9e77cb120b774dd202a9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nj.com", "main_image": "http://imgick.nj.com/home/njo-media/width620/img/rutgers_football/photo/19010373-standard.jpg", "site_section": "http://blog.nj.com/rutgers/rss.xml", "section_title": "NJ.com - Rutgers Sports", "url": "http://www.nj.com/rutgersfootball/index.ssf/2015/10/rutgers_linebacker_steve_longa_takes_out_teammates.html", "country": "IL", "title": "Rutgers linebacker Steve Longa takes out teammates with friendly fire", "performance_score": 0, "site": "nj.com", "participants_count": 1, "title_full": "Rutgers linebacker Steve Longa takes out teammates with friendly fire", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T20:07:00.000+03:00", "replies_count": 0, "uuid": "1de13c08262f1ee29a9a9e77cb120b774dd202a9"}, "author": "Dan Duggan | NJ Advance Media for NJ.com", "url": "http://www.nj.com/rutgersfootball/index.ssf/2015/10/rutgers_linebacker_steve_longa_takes_out_teammates.html", "ord_in_thread": 0, "title": "Rutgers linebacker Steve Longa takes out teammates with friendly fire", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments \nPISCATAWAY — No one was safe from Rutgers linebacker Steve Longa on Saturday, not even his teammates. \nLonga was flying all over the field in Rutgers' 55-52 win over Indiana , resulting in a game-high 16 tackles and two injured teammates. Longa collided with cornerback Blessuan Austin and strong safety Kiy Hester during Saturday's game and both players left with apparent head injuries. \nAustin is officially questionable for Saturday's game against Ohio State with an upper body injury. Hester is not listed on the injury report despite missing the fourth quarter of the Indiana game after his collision with Longa. \nObviously Longa doesn't intend to injure his teammates, but it's a consequence that comes with playing with reckless abandon. \n\"During the spring, I tried to avoid them,\" Longa said. \"Something happened and I wasn't feeling good. I'm not avoiding anybody anymore. Everybody is getting hit.\" \nThis isn't the first time Longa has claimed casualties with friendly fire. In 2013, Longa injured defensive backs Lew Toler and Lorenzo Waters in separate collisions . \nTeammates understand the hazards of playing with Longa, who leads the team with 66 tackles. \n\"You have to keep your head on a swivel out here,\" defensive tackle Julian Pinnix-Odrick said. \"It's a fast game. That's what he does — he just runs left-and-right and makes tackles for us and sticks his face in there when he needs to. You have to keep your head on a little bit more of a swivel. It's man's game. Longa is definitely a guy you want on your side when helmets start flying.\" \nIronically, Longa left the Indiana game briefly after being hit in the right leg by teammate Quentin Gause in the second quarter. Longa appeared hobbled and was wearing a walking boot after the game, but he downplayed any injury. \n\"I don't know if I was injured,\" said Longa, who is listed as probable for the Ohio State game with a lower body injury. \"But I had to lead my defense out there. I couldn't just leave those guys out there playing by themselves. They deserved to have me out there and they deserved to have me giving my all. That's what I was trying to do. I was just trying to do my job and by doing my job, plays came my way and I tried to make them. I made a lot more than I missed. They deserved me being out there fighting with them. I don't want to leave them by themselves. I don't want them to have all the fun. I've got to get a piece of it.\" \nDan Duggan may be reached at dduggan@njadvancemedia.com . Follow him on Twitter @DDuggan21 . Find NJ.com Rutgers Football on Facebook .", "external_links": [], "published": "2015-10-20T20:07:00.000+03:00", "crawled": "2015-10-21T00:08:05.696+03:00", "highlightTitle": ""}