{"organizations": [], "uuid": "d2c512f09b55de4ae3ba4b9b7a4cc036790f39e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wtvm.com", "main_image": "http://RAYCOMGROUP.images.worldnow.com/images/8975122_G.jpg", "site_section": "http://www.wtvm.com/Global/category.asp?C=5482&nav=menu91_4&clienttype=rss", "section_title": "WTVM - Sports", "url": "http://www.wtvm.com/story/30218945/nfl-of-the-week-thats-no-qb-thats-grandpa", "country": "US", "title": "NFL of the Week: That's no QB, that's grandpa", "performance_score": 0, "site": "wtvm.com", "participants_count": 1, "title_full": "NFL of the Week: That's no QB, that's grandpa", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T23:00:00.000+03:00", "replies_count": 0, "uuid": "d2c512f09b55de4ae3ba4b9b7a4cc036790f39e3"}, "author": "Matt Quillen", "url": "http://www.wtvm.com/story/30218945/nfl-of-the-week-thats-no-qb-thats-grandpa", "ord_in_thread": 0, "title": "NFL of the Week: That's no QB, that's grandpa", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NFL of the Week: That's no QB, that's grandpa - WTVM.com-Columbus, GA News Weather & Sports Member Center: NFL of the Week: That's no QB, that's grandpa Posted: mquillen@raycommedia.com Cincinnati Bengals quarterback Andy Dalton celebrates with fans after an NFL football game against the Kansas City Chiefs, Sunday, Oct. 4, 2015, in Cincinnati. The Bengals won 36-21. (Source: AP/Paul Sancya) Indianapolis Colts' Matt Hasselbeck (8) reacts during the first half of an NFL football game against the Jacksonville Jaguars, Sunday, Oct. 4, 2015 in Indianapolis. (Source: AP/R Brent Smith) More on WTVM.com More>> Daily fantasy football draws attention, ire of NCAA By DAVID BRANDT AP Sports Writer Watch any of the weekend's college football games and it's hard to go even 30 minutes without seeing a commercial for upstart sites DraftKings and FanDuel. More >> By DAVID BRANDT AP Sports Writer Watch any of the weekend's college football games and it's hard to go even 30 minutes without seeing a commercial for upstart sites DraftKings and FanDuel. More >> \n(RNN) - It's been bad Luck or no Luck at all for the Indianapolis Colts. Cue the confetti, that's the 1 billionth time someone has made that pun this season! \nAndrew Luck's troubles, stemming from a bum shoulder, showed how bad the team around him is - and, retrospectively, how good he's been the last three years. The team everyone thought was a sure bet for at least the AFC Championship Game now sits at 2-2 with the NFL's version of Abe Vigoda as signal-caller. \nSo, remember last year when the NFC South really stunk? Well, that's the AFC South this season. Despite all their misfortune and terrible play, the Colts sit on top of the division. \nI hope you're ready for another sub-.500 division winner. Thursday Night Football : Indianapolis Colts at Houston Texans, 8:25 p.m. ET \nWith no Luck, Indy relies on Unfrozen Caveman Quarterback, aka Matt Hasselbeck, for another week. The ol' gunslinger's numbers looked spry in the win over the Jags, until one remembers they were amassed over nearly five quarters in the OT contest … and it was the Jags. \nFrank Gore, who also has his share of NFL mileage, needs to get the running game going to keep J.J. Watt and the other pass rushing Texans from getting too many shots on his AARPQB. I kid; Hasselbeck's only 40. But seriously, did anyone know he was still playing? \nPro Bowl cornerback Vontae Davis is questionable for the game. Houston's star wideout, DeAndre Hopkins, may run wild if he's out. \nThe Texans (1-3) are sticking with QB Ryan Mallett, despite his awful play. That may frustrate the fans, but head coach Bill O'Brien probably thinks: His other option, Brian Hoyer, is not the long-term answer - last week's garbage-time numbers don't mean anything, Mallett has to be given a chance with a healthy Arian Foster at RB, Mallett makes a mean breakfast casserole that O'Brien can't get enough of, or All of the above. \nFormer No. 1 overall pick defensive end Jadeveon Clowney's career no-sack-a-thon is at eight games and counting. That could become a thing soon. \nEven with all of these problems, they remain one game back of the division lead. Sunday: Seattle Seahawks at Cincinnati Bengals, 1 p.m. \nAll NFL football is good, even when it's bad, but there's been a lull on really good matchups this season. This one has potential. \nThe Cincy (4-0) offensive line has only allowed Andy Dalton to get sacked twice in 2015, and he's paid them back by slinging it across the field effectively. His main target, A.J. Green, returned to form as one of the most feared deep threats in the NFL. \nGio Bernard has successfully stepped in as the primary ball carrier since Jeremy Hill stumbled (and fumbled - twice) out of the gate. The Bengals defense also stepped up, as they're the only team not to allow a rushing TD this year. \nThis is where the lazy reference to the Bengals \"roaring\" would usually be, but after that whole Katy Perry incident in 2013, let's leave it alone. \nRB Marshawn Lynch sat out the last game, and his status for this one remains questionable. The offense struggled to score points without him in the backfield, but Russell Wilson did just enough to eke out the win with help from the Seahawks (2-2) defense. \nThe offense hasn't looked great all season, and Wilson has been sacked 18 times. But TE Jimmy Graham's role and production should increase as he gets more comfortable in his first year in the Pacific Northwest. \nThe team is 2-0 since safety Kam Chancellor returned from a contract holdout. He, Richard Sherman and Earl Thomas III make up the \"Legion of Boom\" that helped Seattle reach the last two Super Bowls. Fantasy watch: \nBoobie Dixon, Buffalo RB - An excuse to write \"Boobie?\" Perhaps, but that doesn't mean he's a bad pickup. There's a good chance both of the Bills' top backs will be out Sunday at the Titans, and Dixon is a 230-pound bowling ball the team can roll all day at the weak rush defense. Owned in 13.8 percent of ESPN leagues. \nSam Bradford, Philadelphia QB - Owned in 55 percent of leagues. The Eagles O-line has had the consistency of wet tissue paper this season, but he managed to work his way around that for a 297-yard, three-TD day against Washington (Hi, Washington! 2-2 and you still stink !) last week. Now, he gets the perpetually puny Saints D to carve up. \nTavon Austin, St. Louis WR - Well, slather us in barbecue sauce and call us spare ribs, the Rams may have an offense after all. The former first-round pick was targeted seven times last week, and he could continue to produce now that the team has a running game defenses have to respect. \nAnd the weekly Hail Mary is Keith Mumphery, Houston WR - The 6'0 rookie could get a fair share of looks this week. The Texans No. 2 and 3 receivers are out, and if Davis plays, Hopkins may be in lockdown. \nFollow on Twitter @MattQuillenRNN . \nCopyright 2015 Raycom News Network. All rights reserved. News from around the NFL More>> Daily fantasy football draws attention, ire of NCAA By DAVID BRANDT AP Sports Writer Watch any of the weekend's college football games and it's hard to go even 30 minutes without seeing a commercial for upstart sites DraftKings and FanDuel. More >> By DAVID BRANDT AP Sports Writer Watch any of the weekend's college football games and it's hard to go even 30 minutes without seeing a commercial for upstart sites DraftKings and FanDuel. More >>", "external_links": [], "published": "2015-10-08T23:00:00.000+03:00", "crawled": "2015-10-08T23:20:11.011+03:00", "highlightTitle": ""}