{"organizations": [], "uuid": "79bfe26a4ba51a952a2c5f820bf27befe2af65f9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestar.com", "main_image": "http://www.thestar.com/content/dam/thestar/sports/baseball/2015/10/26/world-series-royals-vs-mets-series-preview/ned-yost.jpg", "site_section": "http://www.thestar.com/sports/skating.html", "section_title": "Figure Skating | Sports | Toronto Star", "url": "http://www.thestar.com/sports/baseball/2015/10/26/world-series-royals-vs-mets-series-preview.html", "country": "CA", "title": "World Series: Royals vs. Mets series preview", "performance_score": 0, "site": "thestar.com", "participants_count": 1, "title_full": "World Series: Royals vs. Mets series preview | Toronto Star", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:00:00.000+02:00", "replies_count": 0, "uuid": "79bfe26a4ba51a952a2c5f820bf27befe2af65f9"}, "author": "Richard Griffin", "url": "http://www.thestar.com/sports/baseball/2015/10/26/world-series-royals-vs-mets-series-preview.html", "ord_in_thread": 0, "title": "World Series: Royals vs. Mets series preview", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A look at the World Series between the New York Mets and Kansas City Royals, which begins Tuesday night in Kansas City:\nMets (90-72) vs. Royals (95-67)\nGame 1 @ K.C. Tuesday, 8:07 p.m. — RH Matt Harvey (13-8, 2.71) vs. RH Edinson Volquez (13-9, 3.55)\nGame 2 @ K.C. Wednesday, 8:07 p.m. — RH Jacob deGrom (14-8, 2.54) vs. RH Johnny Cueto (4-7, 4.76)\nGame 3 @ New York, Friday, 8:07 p.m. — RH Yordano Ventura (13-8, 4.08) vs. RH Noah Syndergaard (9-7, 3.24)\nGame 4 @ New York, Saturday, 8:07 p.m. — RH Chris Young (11-6, 3.06) vs. LH Steven Matz (4-0, 2.27)\nGame 5* @ New York, Sunday, 8:15 p.m. — TBA vs. TBA\nGame 6* @ K.C. Tuesday, Nov. 3, 8:07 p.m. — TBA vs. TBA\nGame 7* @ K.C. Wednesday, Nov. 4, 8:07 p.m. — TBA vs. TBA\nROAD TO THE WORLD SERIES: The Royals carried the swagger and knowledge of being defending AL champs into this post-season, as they came back late against the Astros in an elimination game then easily won Game 5 of the ALDS. They also came back in Game 2 from three runs down against the Blue Jays and won the ALCS in six.\nThe Royals have won four of their last five post-season series, plus the 2014 wild-card. The Mets upset the free-spending Dodgers and their glitzy rotation of Zack Greinke and Clayton Kershaw then rolled over the media-darling Cubs and genius manager Joe Maddon.\nNow they face the Royals, returning to the World Series for the first time since 1986 when they Buckner-ized the Red Sox in that iconic Game 6.\nSTARTERS : People speak about the Mets’ rotation like they are the 1963 Dodgers with Koufax, Drysdale, et al, but in truth they more resemble the ’66 Orioles in terms of youth and talent, with Dave McNally, Jim Palmer and Wally Bunker, all under the age of 23. The young, talented Mets foursome only won 40 games combined out of the Mets’ 90 W’s. World Series pressure is a different animal. The Royals don’t have the glamour of the Mets staff, but the AL starters won’t be asked to go as deep into games.\nIf the Mets are pre-series favourite, it’s because of the starters.\nEDGE : Mets.\nBULLPEN : If the Royals’ bullpen has an Achilles heel, it’s RH Ryan Madson, who was asked to move up on the grid after the season-ending injury to closer Greg Holland. But Royals RH Wade Davis has stepped into the closer role easily and RH Kelvin Herrera throws gas. The Mets also have power arms coming out of the ’pen, led by closer Jeurys Familia, with 43 saves and a 1.85 ERA. The Mets acquired RH Tyler Clippard at the deadline and his presence as a former closer helps.\nEDGE : Royals.\nLINEUP : The Royals are led by MVP candidate CF Lorenzo Cain, whose calculated mad dash from first to home on a 1B Eric Hosmer single plated the winning run. They are backed by World Series veterans 3B Mike Moustakas, LF Alex Gordon and C Sal Perez. ALCS MVP SS Alcides Escobar and 2B Ben Zobrist at the top of the order were the offensive difference vs. the Jays. The Mets have had 2B Daniel Murphy step into a leadership role. In nine games, he has seven homers, 16 hits, 11 runs and 11 RBIs plus a 1.462 OPS. CF Yoenis Cespedes should be back healthy and 3B David Wright is feeling good, although his stats are a bit sickly. Can Murphy keep up that pace? Not likely.\nEDGE : Royals\nINTANGIBLES : There is no home field advantage from weather or type of ballpark as both Citi Field and Kauffman Stadium are very similar. Mets manager Terry Collins is known as a fiery tactician but has never managed a World Series before. Ned Yost is overlooked as a strategist, but ratcheted up his reputation in last year’s World Series. The Mets relied on their starting pitching, including the ageless RH Bartolo Colon, now in the ’pen, but that was in an NL East that included the Braves, Marlins and Phillies, that combined to be 84 games under .500. For his part, RH Noah Syndergaard has guaranteed victory.\nEDGE : Royals.\nPICK TO WIN: Royals in six.\nGRIFF’S ‘15 PICKS: 2-4\nMore on thestar.com\nTrouble ahead if Blue Jays ownership promised Mark Shapiro final say in player moves: Griffin\nEvander Kane to miss 4-6 weeks with left knee injury", "external_links": ["http://static.freeskreen.com/publisher/52/freeskreen.min.js"], "published": "2015-10-26T02:00:00.000+02:00", "crawled": "2015-10-26T23:29:35.604+02:00", "highlightTitle": ""}