{"organizations": [], "uuid": "9a6e176b0ba807187ca22872123f8b96aa7f131b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "mdjonline.com", "main_image": "http://matchbin-assets.s3.amazonaws.com/public/sites/624/thumbs/6ASU_rgbroyals4.jpg", "site_section": "http://mdjonline.com/rss/rss/Sports?instance=Sports&content_type=article&tags=sports&tag_inclusion=or&offset=0&limit=10&page_name=rss", "section_title": "Sports", "url": "http://mdjonline.com/bookmark/26918321", "country": "US", "title": "Royal romp has K.C. one victory away from Series", "performance_score": 0, "site": "mdjonline.com", "participants_count": 1, "title_full": "Royal romp has K.C. one victory away from Series", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T08:40:00.000+03:00", "replies_count": 0, "uuid": "9a6e176b0ba807187ca22872123f8b96aa7f131b"}, "author": "Howie Rumberg Associated Press Sports Writer (noreply@mdjonline.com)", "url": "http://mdjonline.com/bookmark/26918321", "ord_in_thread": 0, "title": "Royal romp has K.C. one victory away from Series", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Royal romp has K.C. one victory away from Series by Howie RumbergAssociated Press Sports Writer Associated Press October 21, 2015 12:40 AM | 83 views | 0 | 2 | | Ben Zobrist (18) celebrates with Eric Hosmer after hitting a first-inning homer in Tuesday’s Game 5. Kansas City led from the start and won handily to push the Blue Jays to the brink of elimination, and the Royals to the cusp of a second straight World Series berth. Associated Press photo slideshow TORONTO — Whether it’s a long ball by Ben Zobrist, a slashing single from Lorenzo Cain or another exhilarating trip around the bases for Alcides Escobar, these Kansas City Royals are relentless — and one win from a return trip to the World Series.Zobrist hit a two-run homer on knuckleballer R.A. Dickey’s fourth pitch of the game, Alex Rios connected an inning later against his former team and the Royals romped past the Toronto Blue Jays 14-2 Tuesday for a 3-1 lead in the American League Championship Series.“We’re very confident,” Rios said. “We have a very well-balanced team from top to bottom.”Cain scored on a passed ball and Mike Moustakas had a sacrifice fly in an LCS-record four-run top of the first.Escobar had four RBIs and Cain drove in three runs as the Royals bounced back from an 11-8 loss Monday. Kansas City led 5-2 in the seventh before breaking away.Blue Jays infielder Cliff Pennington relieved in the ninth inning, becoming the first primarily position player to pitch in the postseason, STATS said. Greeted by cheers, he allowed two hits and got one out.“The circumstances aren’t what you want,” Pennington of his first pitching appearance.Kansas City can win the pennant today, when Edinson Volquez starts against Toronto’s Marco Estrada in a Game 1 rematch.“It’s a do-or-die game for us,” Toronto manager John Gibbons said. “But they do it all year. I think these guys will let this one go and they’ll show up to play (today). ... I know these guys will be ready.”After flashing power to build a 5-0 lead on the long ball, the Royals returned to their pesky ways late in the game against the Blue Jays’ struggling bullpen. They scored nine runs with three more sacrifice flies, a barrage of slashing hits and heads-up baserunning.“We’re a good offensive team,” first baseman Eric Hosmer said. “Our park, our style of play is a little different. We like to use our legs and be athletic, but when we come to some of these parks where the fences aren’t as deep we’ve got some guys that can put the ball in the seats.”Blue Jays fans had seen enough after Cain’s two-run single in the eighth, turning their ever-optimistic cheers to jeers when Mark Lowe replaced Ryan Tepera.The 36-year-old Chris Young bested Dickey, 40, in a bookish matchup of veteran starters — only the pairing of the Yankees’ Randy Johnson and Detroit’s Kenny Rogers in the 2006 ALDS tops the duo for combined age.But just like his counterpart’s effort in Game 4 of the Division Series against Texas, the 6-foot-10 Young was lifted one out shy of qualifying for a victory when Ned Yost went to his bullpen with a runner on first with two outs in the fifth. Yost wasn’t willing to take any chances against Josh Donaldson, who already had an RBI double.“It’s not about personal stuff,” Young said. “It’s just feels great to contribute to such a great team win.”Dickey never had a chance to get that first playoff victory in a 13-year big league career.Escobar got a hit leading off for the fourth straight game, starting this one with a bunt down the third-base line. Zobrist connected for his first homer of the ALCS.Rios homered in the second for a 5-0 lead. Booed all series by his old fans, he didn’t get any extra satisfaction out of the hit.“It’s just another team we have to go out and beat,” Rios said.After Dickey hit Escobar with a pitch — a call that needed replay review to get it right — he walked Cain one out later and was done after 1 2/3 innings.Young used that steep arm angle to outwit the powerful Jays, who were 53-28 at home in the regular season but just 11-14 with the roof closed — which it was Tuesday.He held them hitless until Ryan Goins’ one-out single in the third. Donaldson drove him home with a ground-rule double down the left-field line on an 83 mph slider. Jose Bautista added an RBI grounder to close the gap to 5-2 and get those white towels twirling at Rogers Centre.But Luke Hochevar, Ryan Madson, Kelvin Herrera and Franklin Morales shut down the Blue Jays the rest of the way.Kansas City’s four-spot in the seventh to made it 9-2. Escobar and Hosmer had sacrifice flies to deep center, Cain singled to extend his postseason hitting streak to 13 games and Alex Gordon scored on Tepera’s wild pitch.Cain hit a two-run single in the eighth, and Escobar drove in two off Pennington in the ninth.“We feel good. We like the way we’re playing right now,” Royals manager Ned Yost said. “Our offense has been really, really good.”EMERGENCYBlue Jays reliever Aaron Loup got a call after the game began and had to leave the team for personal reasons, Gibbons said. The Blue Jays manager didn’t know if he would be allowed to replace the pitcher on the roster.UP NEXTVolquez pitched two-hit ball for six innings in a 5-0 win in the opener and recalled telling catcher Salvador Perez, “I feel sexy throwing down and away.” Estrada gave up three runs and six hits in 5 1/3 innings. Share This Article | similar stories", "external_links": [], "published": "2015-10-21T08:40:00.000+03:00", "crawled": "2015-10-21T08:10:49.515+03:00", "highlightTitle": ""}