{"organizations": ["Sheffield United Share", "Criminal Cases Review Commission", "United and Wales", "US Edition Ched Evans Conviction"], "uuid": "28f3ab2322d202e6ce15c62a48e851d5c4ad610d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.sky.com", "main_image": "http://media.skynews.com/media/images/generated/2015/1/5/360758/default/v1/129461943-1-1600x900.jpg", "site_section": "http://feeds.skynews.com/feeds/rss/sports.xml", "section_title": "Sports News - Latest Sports and Football News | Sky News", "url": "http://news.sky.com/story/1564189", "country": "IL", "title": "Ched Evans Conviction Referred To Appeal Court", "performance_score": 0, "site": "sky.com", "participants_count": 0, "title_full": "Ched Evans Conviction Referred To Appeal Court", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T17:37:00.000+03:00", "replies_count": 0, "uuid": "28f3ab2322d202e6ce15c62a48e851d5c4ad610d"}, "author": "", "url": "http://news.sky.com/story/1564189", "ord_in_thread": 0, "title": "Ched Evans Conviction Referred To Appeal Court", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ched Evans"], "text": "Switch to US Edition Ched Evans Conviction Referred To Appeal Court The ex-Sheffield United and Wales striker thanks football fans for supporting him as he fights to overturn his rape conviction. 15:37,   Ched Evans played as a striker for Sheffield United Share by email Footballer Ched Evans has had his rape conviction referred to the Court of Appeal by the Criminal Cases Review Commission. \nThe CCRC said it made the decision because of new information that could have helped 26-year-old Evans' defence if it had been raised during his trial. \nThe former Sheffield United striker was convicted of raping a 19-year-old woman and jailed for five years in 2012. \nAfter his release from prison in 2014, a return to Sheffield and possible moves to Hartlepool and Oldham Athletic broke down amid protests from high-profile supporters and sponsors. \nRichard Foster, chair of the Criminal Cases Review Commission, said: \"The decision of the Commission is not a judgment on guilt or innocence in relation to Ched Evans, nor is it a judgment about the honesty or integrity of the victim or any other person involved in the case. Play video \"22 Oct: Evans Wants To Clear Name\" Video: 22 Oct: Evans Wants To Clear Name \n\"Our role is to consider applications to see if, in our judgment, there is any basis on which to ask the court to hear a fresh appeal - that is our statutory responsibility. \n\"In this case we have identified new material which was not considered by the jury at trial and which in our view might have assisted the defence. \n\"In those circumstances, it is right and proper for the matter to be before the court so that they can decide whether or not the new information should affect the verdict in this case.\" Play video \"17 Oct: Evans Petition Backlash\" Video: 17 Oct: Evans Petition Backlash \nA statement on the website backing Evans' bid to overturn his conviction said the forward was thankful for support from football fans, in particular those from Sheffield United. \nThe statement said: \"Ched and those who closely support him, have always maintained that he was wrongly convicted and using new information that was not presented at his trial, we expect that in time his conviction will be quashed.\" Promoted Stories", "external_links": [], "published": "2015-10-05T17:37:00.000+03:00", "crawled": "2015-10-05T18:20:28.940+03:00", "highlightTitle": ""}