{"organizations": [], "uuid": "e63847318824a283253fd77f79345fbfa6a406ef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theguardian.com", "main_image": "https://i.guim.co.uk/img/static/sys-images/Guardian/Pix/pictures/2015/10/13/1444731525316/fdf8b18f-c891-457a-8dc9-f17dc793b6bd-2060x1236.jpeg?w=1200&amp;q=85&amp;auto=format&amp;sharp=10&amp;s=f387870db6d6c79088521fbaa0985ce9", "site_section": "http://www.theguardian.com/us", "section_title": "Latest US news, world news, sports and opinion from the Guardian | theguardian.com | The Guardian", "url": "http://www.theguardian.com/technology/2015/oct/13/hoverboards-legalised-california", "country": "GB", "title": "'Hoverboards' legalised in California | Technology", "performance_score": 0, "site": "theguardian.com", "participants_count": 4, "title_full": "'Hoverboards' legalised in California | Technology | The Guardian", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T21:00:00.000+03:00", "replies_count": 3, "uuid": "cf415b0d61fe66f7fba01e358e02b27d2402be69"}, "author": "Alex Hern", "url": "http://www.theguardian.com/technology/2015/oct/13/hoverboards-legalised-california#post-0", "ord_in_thread": 0, "title": "'Hoverboards' legalised in California | Technology", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "California has passed legislation to allow use of electric skateboards and other motorised, wheeled devices such as “hoverboards” anywhere bicycles are allowed, reversing earlier legislation which banned the vehicles.\nThe bill was signed into law on Sunday, the same day that London’s Metropolitan police service restated earlier guidance that hoverboards are banned from the British capital’s roads and pavements.\nThe Californian law, which takes effect on 1 January 2016 , undoes a previous ban on motorised skateboards dating from the 1970s, enacted when the motors were petrol-powered.\nThe new law, named AB 604 , defines “electrically motorised boards” as a new legal category (characterised by moving no faster than 20mph, carrying only one person, and being no bigger than 60 by 18 inches), and allows people to ride them on public streets. It also requires the rider to wear a helmet, and bans use of while under the influence of drink or drugs.\nThe bill does leave it open for individual localities to decide to ban the use of the devices in their own area.\nThe bill is specifically aimed at legalising electric skateboards, manufactured by a number of Californian companies including Boosted, ZBoard and Intuitive Motion. But it also legalises other devices which match the description, including the popular “hoverboards” (or “self-balancing scooters”).\nAs in Britain, the lack of legal clarity hasn’t stopped the devices taking off. While some manufacturers had complained of lost sales (with the Wall Street Journal reporting that “some [Intuitive Motion] customers cancelled their orders when they learned it wasn’t legal to ride the boards”), the devices are increasingly common on city streets.\nThe legislation does nothing for hoverboard owners who want to ride their gadgets on private land, however. Landowners still have the right to bar use of the devices, meaning that Wiz Khalifa – whose scuffle in LAX airport in August over his hoverboard is widely seen as ground zero of the current craze – would still have had trouble even under the new law.", "external_links": ["http://blogs.wsj.com/digits/2015/10/12/electric-skateboards-legalized-in-california-reversing-ban/", "https://leginfo.legislature.ca.gov/faces/billTextClient.xhtml?bill_id=201520160AB604"], "published": "2015-10-13T21:00:00.000+03:00", "crawled": "2015-10-13T15:43:43.317+03:00", "highlightTitle": ""}