{"organizations": [], "uuid": "422a4c3735ce68d6d65aac7ca4c663abc94d0d1b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theguardian.com", "main_image": "https://i.guim.co.uk/img/static/sys-images/Guardian/Pix/pictures/2015/10/4/1443980133380/Former-Liverpool-manager--009.jpg?w=1200&amp;q=85&amp;auto=format&amp;sharp=10&amp;s=1180af64e4e01b6debb7463e79636c78", "site_section": "http://www.theguardian.com/us", "section_title": "Latest US news, world news, sports and opinion from the Guardian | theguardian.com | The Guardian", "url": "http://www.theguardian.com/football/2015/oct/04/brendan-rodgers-sacked-liverpool-manager", "country": "GB", "title": "Brendan Rodgers sacked as Liverpool manager | Football", "performance_score": 3, "site": "theguardian.com", "participants_count": 87, "title_full": "Brendan Rodgers sacked as Liverpool manager | Football | The Guardian", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T02:37:00.000+03:00", "replies_count": 122, "uuid": "8ce931164c80d1e6aafc0f31889952088f9b3deb"}, "author": "Andy Hunter", "url": "http://www.theguardian.com/football/2015/oct/04/brendan-rodgers-sacked-liverpool-manager#post-0", "ord_in_thread": 0, "title": "Brendan Rodgers sacked as Liverpool manager | Football", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Brendan Rodgers’ reign as Liverpool manager is over. The 42-year-old was sacked by the club’s owner, Fenway Sports Group, an hour after a 1-1 draw against Merseyside rivals Everton extended Liverpool’s poor run to one win in nine matches.\nRelated: Everton’s Lukaku cancels out Ings goal to keep pressure on Liverpool manager\nRodgers indicated the end of his three year tenure was close in his post-match press conference at Goodison Park. When asked whether he was encouraged that Liverpool’s players were still clearly playing for their manager, the Northern Irishman issued an impassioned defence of his reign but also warned the club faced a lengthy rebuilding job: “whether that is with me or someone else in the job.”\nThose words proved prophetic, or showed the manager had prior knowledge of his impending departure, when Liverpool released a statement at 6.30pm GMT announcing that Rodgers had gone. It is understood the manager was informed of the decision in person by chief executive Ian Ayre and Mike Gordon, FSG’s president, explained the action to Rodgers by telephone.\nA joint statement issued by principal owner John W Henry, chairman Tom Werner and Gordon read: “We would like to place on record our sincere thanks to Brendan Rodgers for the significant contribution he has made to the club and express our gratitude for his hard work and commitment. All of us have experienced some wonderful moments with Brendan as manager and we are confident he will enjoy a long career in the game.\n“Although this has been a difficult decision, we believe it provides us with the best opportunity for success on the pitch. Ambition and winning are at the heart of what we want to bring to Liverpool and we believe this change gives us the best opportunity to deliver it. The search for a new manager is underway and we hope to make an appointment in a decisive and timely manner.”\nRodgers has been under constant pressure since the end of last season, when Liverpool suffered their heaviest defeat in over half a century in a 6-1 reverse at Stoke City . That defeat followed a poor season domestically and in Europe but it was Rodgers’ assistant Colin Pascoe and first team coach Mike Marsh who paid the price while the manager was allowed to continue.\nHe remained part of the transfer committee that spent a further £80m on seven new first team players this summer, bringing the total invested in players since Rodgers arrived from Swansea City in 2012 to almost £300m.\nLiverpool’s return on FSG’s investment has been poor, although Rodgers – manager of the year after almost leading the club to the title in 2014 – was given time to repair the team’s fortunes having lost key players such as Luis Suarez, Steven Gerrard and Raheem Sterling in the last 15 months.\nRodgers’ team have struggled since March and their only win in the last nine matches was against a struggling Aston Villa last weekend, excluding a Capital One Cup penalty shoot-out victory over League Two Carlisle United.\nAs FSG have stated, the process of appointing Rodgers’ successor has begun with Jurgen Klopp the popular choice among the club’s supporters. Former Real Madrid coach Carlo Ancelotti has also been linked with a return to the Premier League at Anfield.", "external_links": [], "published": "2015-10-05T02:37:00.000+03:00", "crawled": "2015-10-04T20:57:09.985+03:00", "highlightTitle": ""}