{"organizations": [], "uuid": "cb7b1d0fca05fe0e392424d01eb7285a18e455ac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "http://images.worldnow.com/AP/images/9044119_G.jpg", "site_section": "http://www.cbs8.com/category/13566/national-sports", "section_title": "Sports News: Football, Baseball, Basketball, Hockey &amp; more - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30289317/beckenbauer-denies-claims-bribes-secured-2006-world-cup", "country": "US", "title": "Beckenbauer denies claims bribes secured 2006 World Cup", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Beckenbauer denies claims bribes secured 2006 World Cup - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "cb7b1d0fca05fe0e392424d01eb7285a18e455ac"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30289317/beckenbauer-denies-claims-bribes-secured-2006-world-cup", "ord_in_thread": 0, "title": "Beckenbauer denies claims bribes secured 2006 World Cup", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By CIARAN FAHEY\nAssociated Press BERLIN (AP) - Soccer great Franz Beckenbauer said Sunday he never paid anyone to secure votes for Germany's 2006 World Cup bid following allegations that bribes were involved.\n\"I never had money given to anyone to acquire votes for the awarding of the 2006 football World Cup to Germany,\" said Beckenbauer, who headed the bidding committee, in a statement issued through his management. \"And I am certain that no other member of the bidding committee did it either.\"\nThe 70-year-old Beckenbauer led West Germany to the World Cup title as captain in 1974 and again as coach in 1990. Arguably the most influential figure in German football, Beckenbauer was responding to Friday's report by German newsweekly Der Spiegel which alleged a slush fund of 10.3 million Swiss francs (about $6 million at that time) was set up to buy the votes of four Asian representatives on FIFA's 24-member executive committee.\nGerman football federation (DFB) president Wolfgang Niersbach rejected the allegations Saturday in an interview published on the DFB's own website.\n\"The World Cup was not bought,\" Niersbach said of Germany's 12-11 win over South Africa in the 2000 vote.\nNiersbach was also involved in Germany's bid and Spiegel said that he, Beckenbauer and other high-ranking football officials were aware of the alleged slush fund by 2005 at the latest. That is when former Adidas chief Robert Louis-Dreyfus, who reportedly provided the funding, asked for the money back before the World Cup began. By then it was 6.7 million euros. Louis-Dreyfus died in 2009.\nThe DFB transferred 6.7 million euros to FIFA in 2005 and Spiegel alleges that this money was transferred again to a Zurich account belonging to Louis-Dreyfus. The DFB has acknowledged the payment to FIFA but says it is unaware of where the money ended up.\n\"To clear it up we have the control committee investigating internally and the law firm Freshfields Bruckhaus Deringer externally,\" Niersbach said. \"The outcome of the ongoing investigations is open but I can already definitely rule out that the payment was related to the awarding of the World Cup in 2000, due to the timing of the payment process.\"\nIn its full report published Saturday, Spiegel referred to a \"secret paper\" from Nov. 23, 2004 concerning a planned monetary transfer upon which \"the agreed payment for RLD\" was written in what the magazine said was Niersbach's handwriting. Spiegel suggested \"RLD\" referred to Robert Louis-Dreyfus.\n\"I can't remember it exactly, especially as I only had limited involvement in financial transactions in my marketing and media role as vice-president of the organizing committee,\" Niersbach said. He questioned whether the note was even in his handwriting and asked for Spiegel to hand it over for checks.\nFormer interior minister Otto Schily and World Cup organizing committee vice-president Fedor Radmann also dismissed Spiegel's allegations.\n ", "external_links": [], "published": "2015-10-18T03:00:00.000+03:00", "crawled": "2015-10-18T22:09:41.762+03:00", "highlightTitle": ""}