{"organizations": [], "uuid": "2c383cc44cedb43bba0d3713c27e42e8cc1920fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports", "section_title": "Sports News, Scores, Schedules, Standings, Stats, Photos, Videos - MSN Sports", "url": "http://www.msn.com/en-us/sports/nfl/101-amazing-nfl-facts-that-will-blow-your-mind/ar-AAf0wWN", "country": "US", "title": "101 amazing NFL facts that will blow your mind", "performance_score": 0, "site": "msn.com", "participants_count": 11, "title_full": "101 amazing NFL facts that will blow your mind", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 16, "uuid": "42da36323434ee538edccb605a9017608f89cb66"}, "author": "Chris Chase", "url": "http://www.msn.com/en-us/sports/nfl/101-amazing-nfl-facts-that-will-blow-your-mind/ar-AAf0wWN#post-0", "ord_in_thread": 0, "title": "101 amazing NFL facts that will blow your mind", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "101 amazing NFL facts that will blow your mind USA Today Sports 1 day ago Chris Chase\n© Provided by USA Today Sports (AP) 1. In college, the Notre Dame sports information director convinced future Washington Redskins quarterback and NFL MVP Joe Theismann to change the pronunciation of his name from “THEEZ-min” to “THIGHS-min” so it would rhyme with Heisman. The new Mr. Thighsman would not win his Heisman, finishing second to Jim Plunkett.\nAdChoices 2. The largest point spread in NFL history came when the Denver Broncos were favored by 26.5 over the Jacksonville Jaguars in Week 2 of 2013. The Jags covered, falling 35-19.\n3. Of the 11 games since 1987 that had point spreads of 20+, the favorite has only covered twice , though no underdogs won straight up. The Philadelphia Eagles, 24.5-point dogs to the eventual 16-0 New England Patriots, came closest, leading 28-24 entering the fourth quarter before a Patriots touchdown gave them a 31-28 victory.\n© Provided by USA Today Sports (Joe Camporeale-USA TODAY Sports) 4. Since no once could agree on the realignment of the NFC after the AFL/NFL merger, the five best plans were put into a vase and Pete Rozelle’s secretary selected one at random.\n5. The Baltimore Colts made an 80-cent long-distance call to sign Johnny Unitas as a free agent.\n6. The Arizona Cardinals had the longest postseason victory drought in NFL history (1947 to 1998).\n7. There have been games played on every day of the week in the modern NFL. The one Tuesday game was due to a Pennsylvania blizzard. The single Wednesday game was because the NFL moved the Washington-New York Thursday night season opener so it wouldn’t overlap with John McCain’s speech at the Republican convention. The Friday games were either Christmas or New Year’s related, with at least one of those (a Kansas City-Miami matchup in 2005) occurring after being moved up a few days because of a hurricane forecast.\n8. Walter Payton only won one NFL rushing title in his career.\n9. There have been 14 different rushing champions in the past 17 years. There were 1 4 different champions in the 27 years before that.\n&amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;lt;br _moz_dirty=\"\" /&amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;gt;\n10. Those NFL rushing champions have included a wide array of men : Supreme Court Justice, actor, Rhodes Scholar, the man who scored the most famous touchdown in NFL history, a guy played on film by Billy Dee Williams, a player suspended for nearly an entire NFL season and O.J. Simpson.\n11. It took the New Orleans Saints 32 years to win their first playoff game . The two expansion teams of 1995 (Carolina and Jacksonville) played for their conference championship in their second years of existence.\n12. Since 1988, every team in the NFL has played in a conference championship game (with the exception of the 13-year-old Houston Texans).\n© Provided by USA Today Sports (USA TODAY Sports Images) 13. Since his last interception at Lambeau Field, Aaron Rodgers has thrown 46 touchdowns .\n14. Bill Belichick would need 10 consecutive 12-win seasons to pass Don Shula on the list for most coaching victories. Belichick will be 73 years old in 10 years.\n15. Pete Rozelle was voted NFL commissioner on the 23rd ballot .\n© Provided by USA Today Sports (Getty Images) 16. The commissioner made the controversial decision to play games two days after John F. Kennedy’s assassination , based on advice from JFK’s press secretary, Pierre Salinger. He said Robert F. Kennedy told him his brother would have wanted the games to go on. None of the games were aired, as television was providing wall-to-wall coverage of the assassination and its aftermath. Just after the early games kicked off, Lee Harvey Oswald was shot in the parking garage of the Dallas police headquarters while JFK’s horse-drawn caisson was led through the streets of Washington. Rozelle would call playing those games his biggest regret . His successor, Paul Tagliabue, would not make the same mistake after 9/11.\n17. CBS paid $4.65 million in 1962 for the first exclusive rights to broadcast NFL games. (In its current deal, Fox pays a reported $1.15 billion per year for its NFC package.) But that didn’t cover the NFL championship, which NBC acquired for just under $1 million or about 1/4th the cost of what it’ll take to buy a 30-second ad at Super Bowl 50.\n18. Ed Sabol was the oldest Hall of Fame inductee . At 94 years old, he was 60 years older than the youngest, Gale Sayers.\n19. Julio Jones has three more catches through three weeks of the NFL season (34) than anyone else in history and is on pace for 181 catches this season, which is only 38 ahead of the NFL record, which should tell you something about Marvin Harrison’s remarkable 2002.\n© Provided by USA Today Sports (AP) 20. The NFL and the Chicago Bears were named on the same day . Both changed on June 24, 1922, the NFL from the American Professional Football Association and the Bears from the Chicago Staleys.\n21. There have been more penalties called in the first three weeks of the 2015 NFL season than in the first three weeks of any other season in history.\n22. Sammy Baugh once led the NFL in passing, punting and defensive interceptions in the same season.\n© Provided by USA Today Sports (AP) 23. The 2000 Super Bowl champion Baltimore Ravens had a five-game stretch in which they didn’t score a touchdown and their only points were field goals by Matt Stover (14 in all). The team went 2-3 in that run of offensive ineptitude, but only lost one other game all season, setting an NFL record with 165 points allowed and almost scoring as many points in Super Bowl XXXV (34) as they did in that historic five-game stretch (42).\n24. Despite a recent onslaught , Baugh still holds the record for single-season punting average at 51.4 , set in 1940. After no one else average more than 50 yards per punt in the first 86 years of the league, six players have done so in the past seven years.\n25. Of the 55 players who have played in an NFL game in their 40s, 41 were quarterbacks, kickers or punters . Beyond the 1920s, the oldest position player who wasn’t a QB, K or P was 43-year-old Ray Brown, who played guard for the Washington Redskins in 2005.\n26. The Chicago Bears have the most retired numbers of any NFL team with 13.\n© Provided by USA Today Sports (AP) 27. Five teams don’t have any players’ numbers retired. Three are due to a lack of history: Baltimore, Houston and Jacksonville. The other two are because the teams don’t “believe” in such honor: Dallas and Oakland.\n28. College juniors weren’t eligible for the NFL draft until 1990.\n29. Oakland’s last playoff game was Super Bowl XXXVII. Tampa’s last playoff win was Super Bowl XXXVII .\n30. In his eighth NFL start, Adrian Peterson set the record for most rushing yards in a single game with 296 . Remarkably, Peterson went into halftime with a pedestrian 43 yards on 13 carries (3.3 ypc). But in the second half, he carried 17 times for 253 yards (14.88 ypc), a yardage total that would tie for ninth all time in a single game.\n© Provided by USA Today Sports (AP) 31. Art Monk held the single-season reception record (106) for eight years . Since it was broken in 1992, it has been surpassed 40 more times.\n32. In 1992, the NFL experimented with two bye weeks .\n33. After two years at Memorial Stadium, the Baltimore Ravens moved to its new digs, which was called “NFL Stadium at Camden Y ards” for one season before PSINet bought naming rights.\n34. Jerry Rice and Brett Favre are the only non-kickers to play in more than 300 games .\n© Provided by USA Today Sports (AP) 35. The defensive player with the highest total is Darrell Green , who played in 295 games.\n36. Franchises in Houston have experienced the worst single-season drop-offs in NFL history . The 1993 Oilers followed up a 12-4 season with a 2-14 turn in 1994 that included QB starts by Billy Joe Tolliver, Cody Carlson and Bucky Richardson, names that evoke, well, a 2-14 season. Then, in 2012 and 2013, the Texans pulled the same trick, including the quarterback name thing. Case Keenum went 0-8 in ’13.\n37. The Seattle Seahawks were originally owned by the Nordstrom family — yes, the same family who owned the upscale department store. When the Seahawks won the Super Bowl in 2014, the team classily presented John Nordstrom with a Super Bowl ring.\n© Provided by USA Today Sports (Getty Images) 38. Emmitt Smith still won the rushing title in 1993 , the year he held out the first two games of the season in a contract dispute.\n39. Team names that have existed in the NFL include the All-Americans, Celts, Reds, Panhandles, Triangles, Heralds, Eskimos, Yellowjackets, Colonels, Marines, Tornadoes, Maroons, Jeffersons, Gunners, Stapes and Maroons.\n40. There have been six trades in the NFL with 10 or more players . The biggest? Like you have to ask:\n© Provided by USA Today Sports Screen Shot 2015-09-29 at 1.14.31 PM 41. When the Seahawks were created, a “name the team” contest received 20,365 entries and 1,742 different names . How do that many different names exist? Were people sending in stuff like “Frank” and “Dave?”\n© Provided by USA Today Sports (AP) 42. Steve Young is the only left-handed quarterback in the Pro Football Hall of Fame .\n43. The Super Bowl trophy was renamed for Vince Lombardi exactly one week after he died in September 1970 at the young age of 57. Andy Reid and Marvin Lewis are 57 years old right now, which is bizarre to think about.\n44. Before 1975, offensive holding was a 15-yard penalty .\n45. The coldest Super Bowl was at Tulane Stadium in New Orleans , when the Cowboys and Dolphins kicked off Super Bowl VI with the mercury at 39 degrees.\n© Provided by USA Today Sports (AP) 46. The hottest Super Bowl would take place one year later , when the Dolphins capped their perfect season with a Super Bowl VII victory over the Redskins in 84-degree Los Angeles heat.\n47. Take that, Favre. George Halas retired as coach of the Chicago Bears four times in total.\n48. John Elway was responsible for 90 of the Broncos’ 98 yards during “The Drive.” He was 6-9 for 70 yards through the air and scrambled twice for 20 yards.\n49. Football officially surpassed baseball as “America’s Pastime” in 1965 , when more people named it their favorite sport in the long-running Harris Poll on the subject.\n© Provided by USA Today Sports (Getty Images) 50. Andrew Luck already has more playoff passing yards than two-time Super Bowl champion Bart Starr.\n51. In 1979, the Washington Redskins and Chicago Bears had one of the wildest final-day playoff battles ever. Washington needed a win over Dallas to clinch a playoff berth. If they didn’t get that, all they’d need was to not lose a point differential of 33 points over the Chicago Bears, who were playing the Vikings. Improbably, Chicago took care of its job all by themselves, winning 42-6 in an early game, meaning the point differential tiebreak was over and the Redskins were in and win-and-in situation. Washington got out to a 17-0 lead in its game, then led 34-21 with 6:53 left, seemingly clinching a berth and ending the Bears season in the process. But Roger Staubach single-handedly got Chicago to the playoffs, leading a comeback that ended with a touchdown pass to Calvin Hill (Grant’s dad) with 39 seconds left. The Bears were in, the Redskins were out.\n52. Tom Brady has twice as many playoff passing yards (7,345) than the third-ranked active player on that list — Drew Brees (3,539). Only Peyton Manning comes close to Brady with his 6,800 yards.\n53. Teams only began winning home-field advantage for the playoffs in 1975. Before, the sport switched off sites for the playoffs based on division placement, much like baseball and the World Series before that All-Star game tie.\n© Provided by USA Today Sports (AP) 54. Former Washington Redskins kicker Mark Moseley has any many NFL MVP awards as John Elway , Dan Marino, Marshall Faulk, Walter Payton, O.J. Simpson, Barry Sanders, Lawrence Taylor, Emmitt Smith and Terry Bradshaw. He’s only one behind Tom Brady.\n55. The New England Patriots are the only franchise to have scored three touchdowns in less than one minute , doing it twice, once in 2012 (three in 51 seconds in the second quarter against the Jets) and again last year (three in 57 seconds late in the first half against the Bears).\n56. In 1961, there was a Bert Bell Benefit Bowl, named for the late commissioner, that pitted runners-up in each NFL conference. It was like a loser’s bracket and an NFL Championship Lite for a meaningless “third place” award. Somehow, it lasted 10 years.\n57. The last time the Washington Redskins shut out a team was in 1991, when the team did it three times in the first five weeks of the season. Since that Week 5 shutout of Philly, Washington hasn’t had one since, a streak of 379 games , the longest in NFL history.\n© Provided by USA Today Sports (AP/The Santa Rosa Press Democrat) 58. Football, unlike baseball, doesn’t have a ton unbreakable records from a century ago when the game was completely different. (Team records, such as ties and shutouts are the big exception.) But there are a few modern marks we may never see broken, led by Jerry Rice’s 197 receiving touchdowns . To beat that, Rob Gronkowski would need to score 10 touchdowns every season from now until he’s 40 (it’s basically the same for Dez Bryant).\n59. An older unbreakable mark: Paul Krause’s 81 interceptions. The active leader is Charles Woodson, with 61. The only other active player in the top 100 is DeAngelo Hall.\n60. Brett Favre’s record of 297 consecutive QB starts has been called unbreakable and it makes sense — he’s more than five seasons clear of No. 2 on the list. However, four of the top 10 streaks in history are active. The aforementioned No. 2, Peyton Manning, would be at 275 if not for his missed 2011. With quarterbacks starting earlier and the league doing more and more to protect the game’s marquee players, Favre going down isn’t completely inconceivable.\n61. The top five players in NFL history according to pro-football-reference’s career approximate value : Peyton Manning, Brett Favre, Jerry Rice, Fran Tarkenton and Reggie White.\n© Provided by USA Today Sports (AP) 62. The Indianapolis Colts won 23-straight regular-season games in 2008 and 2009.\n63. Pittsburgh has the most wins (regular season and playoffs) since the AFL/NFL merger.\n64. The Arizona Cardinals have scored 126 in the first three weeks of the 2015 season . In 1992, the Seattle Seahawks scored 140 points for the entire season.\n65. Before the start of the 2000 season, Ryan Leaf appeared on the cover of Sports Illustrated with the headline “Back From The Brink.” He then started 0-4 and lost nine of his 10 starts that year.\n© Provided by USA Today Sports viewsi041502 66. Despite football’s predominance on SI covers (27 last year when combining the NCAA and NFL), no NFLer is in the top five for most covers of all time. Tom Brady has the most with 19 , which is sixth-most ever. Michael Jordan leads with 49, while Muhammad Ali, who gets his 39th this week, is next on the list.\n67. Though it’s remarkably difficult to find information on early SI cover subjects, the magazine’s cover archive shows that Doak Walker of the Detroit Lions was on the mag’s first NFL cover (the Oct. 3, 1955 issue, more than one year after the magazine debuted).\n68. It was a record-setting 1984 , with marks broken for single-season passing yards (Dan Marino), rushing yards (Eric Dickerson) and receptions (Art Monk), as was an all-time mark for rushing yards (Walter Payton)\n69. The New England Patriots set an NFL record by throwing just four interceptions total in 2010 (all by Tom Brady, obviously). In that season, there were 15 occasions when a team threw four interceptions in a single game.\n© Provided by USA Today Sports (AP Photo/Leon Algee) 70. In 2000, the San Diego Chargers had a total of 1,062 rushing yards , a record low for an NFL team. Nineteen runners had more than that by themselves.\n71. Each of the last four seasons has featured at least one comeback of 24+ points , the longest streak in NFL history.\n72. Only one 0-4 team has ever made the playoffs — the 1992 San Diego Chargers.\n73. Bart Starr coached the Green Bay Packers for nine seasons from 1975-83, finishing with a 53-77-3 record. That winning percentage is ninth out of the 14 coaches in Green Bay history.\n74. Of teams that have played after each of the NFL’s 26 bye weeks, P hiladelphia and Denver share the best record coming off those byes (20-6) . The worst team coming off a bye is the Cincinnati Bengals, at 7-18-1, just worse than the Seattle Seahawks, who are 8-18.\n75. Robert Griffin III, currently the Redskins’ scout-team safety, set the record for rookie QB rating (102.4) just three years ago. Some other rookie ratings of distinguished NFL quarterbacks:\n© Provided by USA Today Sports Screen Shot 2015-09-29 at 9.20.51 PM 76. Nick Foles has the third-highest single-season QB rating in NFL history , behind Aaron Rodgers and Peyton Manning.\n77. In 1923, Jim Thorpe fumbled and the ball was picked up by George Halas , who returned it 98 yards for a touchdown. That record would stand until Jack Tatum broke it in 1972 with a 104-yard return, a record that still stands.\n© Provided by USA Today Sports (USA TODAY Sports Images) 78. Only one quarterback in NFL history has an undefeated record in multiple playoff starts : Frank Reich, who went 2-0 in relief of Jim Kelly in 1993.\n79. Andy Dalton is tied for the most playoff starts without a win in NFL history (he’s 0-4, as you surely know). The good news, the man he’s tied with — Y.A. Tittle — is in the Hall of Fame.\n80. The w ebsite for the Tennessee Titans is titansonline.com , the only official site that has a word not associated with its team name. My theory: People can’t spell Tennessee.\n81. About 35% of replay reviews get overturned.\n© Provided by USA Today Sports (USA TODAY) 82. The 12th tiebreaker for a division championship is a coin flip .\n83. A player given the franchise tag hasn’t switched teams since 1998 .\n84. From 1933-68 (35 years), the Pittsburgh Steelers had 16 coaches, or one every 2.2 years. From 1969 to today (46 years), the Steelers have had three coaches , or one every 15 years.\n85. Jimmy Johnson coached the Dallas Cowboys for five years or as long as Jim Schwartz was employed by the Detroit Lions.\n© Provided by USA Today Sports (Getty Images) 86. The Redskins had as many coaches from 2000-2002 (four) as the Carolina Panthers have had in their entire history .\n87. Marty Schottenheimer is name-dropped on the 1999 Eminem song Just Don’t Give A [Expletive] . “I’m buzzing, Dirty Dozen/naughty rotten rhymer/Cursing at you players worse than Marty Schottenheimer.”\n88. Last year, Jonas Gray ran for 201 yards and four touchdowns in a New England Patriots win over the Indianapolis Colts. In the rest of his four seasons in the NFL, the Notre Dame has 260 yards and one touchdown, total.\n© Provided by USA Today Sports (Getty Images) 89. The Minnesota Vikings (?!) have the best NFC home winning percentage since the AFL/NFL merger , winning exactly 2/3rds of home games.\n90. The Detroit Lions have won one playoff game since the merger , the worst of any franchise, including expansion teams.\n91. Only three teams have road records above .500 since the merger : San Francisco (.516), Dallas (.514) and Miami (.509).\n92. The 1983 Washington Redskins had a +43 differential on takeaways/giveaways , one of the most lopsided records in NFL history. No other team in history has had a positive yearly differential greater 30. (The 2010 Patriots and 2011 49ers are tied for second with +28). And consider this: Last year, no team had more than 35 takeaways and the best differential was +14.\n© Provided by USA Today Sports (Jeremy Brevard / USA TODAY Sports) 93. A team has gone from worst-to-first every year since 2002 .\n94. Six teams have scored more than 60 points in a game since the merger. The highest point total since 1970 is 62, a mark shared by five modern teams. The 2011 Saints were the last to do it, defeating Indianapolis 62-7. The 1999 Jaguars famously did it in the playoffs, beating the Miami Dolphins by that same score. It would be Jimmy Johnson’s last game as an NFL coach.\n95. In 2004, 26 of the 32 NFL teams were in playoff contention with two weeks left in the season.\n96. Though announcers like to say the two-point conversion rate hovers around 50%, there have o nly been four seasons since the rule was instituted in 2004 in which the NFL finished with a rate higher than 50%. Eleven other seasons have had a rate of 43% or better, meaning in 15 of 21 seasons, teams have been at 43% or better. The lowest was a 36.9% mark in 1999.\n© Provided by USA Today Sports (USA TODAY Sports Images) 97. Last year featured the lowest percentage of games decided by one possession (43%).\n98. There have been 373 sets of brothers who have played in the NFL. Since the merger, the Browner family, with four boys playing from 1979-1992 holds the record for most NFL bros.\n99. There have been 217 sets of fathers and sons to play in the NFL.\n100. Since the playoffs expanded in 1990, there have been 11 10-win teams to miss the playoffs. There have also been 11 teams who didn’t finish above .500 to make the playoffs.\n101. There are 37 television markets without an NFL team that are bigger than Green Bay , which is the NFL’s smallest market. Of them, Orlando is the biggest, with a population greater than 14 NFL markets. Among the markets with bigger populations than Green Bay: Hartford, West Palm Beach, Grand Rapids/Kalamazoo, Harrisburg/Lancaster/York, Greensboro/High Point/Winston Salem, Albuquerque. Wilkes-Barre/Scranton, Richmond, Tulsa, Dayton, Wichita/Hutchinson and Lynchburg.\n© Provided by USA Today Sports (Press-Gazette)\nGo to MSN Home", "external_links": ["http://www.pro-football-reference.com/leaders/av_career.htm", "http://www.nfl.com/photoessays/0ap3000000415162", "http://www.usatoday.com/sports/", "http://www.sicovers.com/Product.aspx?pid=1942", "http://www.usatoday.com/story/sports/nfl/2013/11/21/john-f-kennedy-assassination-nfl-dallas-cowboys-cleveland-browns/3670181/", "http://ftw.usatoday.com/2015/09/nfl-record-for-most-penalties-game-season-2015-holding-nfl-game-length-average-taking-longer", "http://go.microsoft.com/fwlink/?LinkID=286759", "http://www.seahawks.com/news/2014/07/23/john-nordstrom-finally-puts-ring-it"], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-03T12:54:50.136+03:00", "highlightTitle": ""}