{"organizations": [], "uuid": "b57e3031b88819a3f4df4dfa7c6a0185796a0bd7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.neoshodailynews.com", "main_image": "http://www.neoshodailynews.com/storyimage/MO/20151017/SPORTS/151019113/AR/0/AR-151019113.jpg", "site_section": "http://www.neoshodailynews.com/sports?template=rss&mime=xml", "section_title": "Sports - Neosho Daily News - Neosho, MO", "url": "http://www.neoshodailynews.com/article/20151017/SPORTS/151019113/2000/NEWS?rssfeed=true", "country": "US", "title": "Northwest Missouri thwarts Pittsburg State, 31-14", "performance_score": 0, "site": "neoshodailynews.com", "participants_count": 1, "title_full": "Northwest Missouri thwarts Pittsburg State, 31-14", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T05:25:00.000+03:00", "replies_count": 0, "uuid": "b57e3031b88819a3f4df4dfa7c6a0185796a0bd7"}, "author": "From Staff Reports", "url": "http://www.neoshodailynews.com/article/20151017/SPORTS/151019113/2000/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "Northwest Missouri thwarts Pittsburg State, 31-14", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Northwest Missouri thwarts Pittsburg State, 31-14 Comment   By From Staff Reports Posted Oct. 17, 2015 at 9:25 PM By From Staff Reports Posted Oct. 17, 2015 at 9:25 PM PITTSBURG, Kan. — Pittsburg State sophomore quarterback Thomas LePage made his first collegiate start Saturday at Carnie Smith Stadium. Unfortunately for LePage, he faced No. 3-ranked Northwest Missouri and its stalwart defense. The Bearcats sacked LePage three times and intercepted him four times in the second half on a day when the sophomore passed for 76 yards and one TD on 13 for 27 accuracy. Northwest Missouri scored 21 unanswered points in the first half for a 28-7 halftime lead en route to a 31-14 win in the battle of nationally-ranked teams. LePage made the start at quarterback after the injury to freshman quarterback John Roderique, Pitt State’s leading rusher who apparently sustained a foot injury two weeks ago against Missouri Western at Carnie Smith. Roderique played the next week against Emporia State in a 46-42 road loss. With junior Ramsey Hamilton, a player with experience at quarterback, also out due to injury, the reins were turned over to LePage on Saturday. Players like Jacob Vollstedt wreaked havoc against LePage, with 11 tackles, two quarterback sacks, a forced fumble and an interception. Brock Sherman added 10 tackles, Kevin Berg six tackles and two interceptions, Bryce Enyard six tackles, Brandon Yost a fumble recovery in the end zone for one Bearcat touchdown and Edward Richey three tackles and one interception. The Bearcats showcased their defensive capabilities and coupled with Emporia State’s loss Saturday to Fort Hays, the Bearcats now stand alone as the lone unbeaten team in the Mid-America Intercollegiate Athletics Association. Senior quarterback Brady Bolles threw for 148 yards and two scores, while Randy Schmidt completed a 68-yard pass to George Sehl on a reverse pass. Both teams worked a reverse pass for a scoring play in the first half, with the Gorillas scoring their lone points of the first 30 minutes on a 19-yard pass from receiver Marquise Cushon to tight end Kyle Swartz. The Gorillas were held to 175 yards of total offense by the stout Bearcats. LePage led the way on the ground with 27 yards on 14 carries, while Jeff Seybold managed 23 yards on 10 carries. LePage’s 24-yard run gave the Gorillas their longest play from scrimmage. Colby Hall led the Gorillas defense with 13 tackles, while Deron Washington had 10, Quad Ware eight and Spencer Brown seven. Pitt State, who entered the contest ranked No. 22 in the nation, fell to 4-3 and the Gorillas look to snap a two-game skid next week on the road against Nebraska-Kearney. Good news for the Gorillas: Nebraska-Kearney remained the only winless team in the MIAA on Saturday, losing 28-10 to Lindenwood. Missouri Southern falls on road, 31-21 TAHLEQUAH, Okla. — The Lions dropped their fourth straight game with a 10-point loss Saturday against the Northeastern State RiverHawks at Doc Wadley Stadium. Page 2 of 2 - After two weeks of surrendering nearly 1,400 yards of total offense in blowout losses against Central Missouri and Central Oklahoma, the Lions defense allowed 1,000 fewer yards Saturday as the RiverHawks managed 331 yards (119 rush, 212 pass) of total offense. That was the good news, as well as the fact that Missouri Southern produced 456 yards itself (199 rush, 257 pass). Unfortunately for the Lions, they were hurt by that age-old ailment — turnovers, with two interceptions and two lost fumbles negating all that positive yardage. The biggest play in the game came on Darian Morris’ 97-yard fumble recovery at the 11-minute, 10-second mark of the third quarter, a scoring play that gave Northeastern State a 21-7 lead. Northeastern State quarterback Kevin Pantastico threw for three touchdown passes, hitting Zac King for 37 yards in the first quarter, Matthew Butler for 40 in the second and Garrett Powell for 35 in the third. Kyle Keller and T.J. Fleeton threw for touchdowns for the Lions, Keller 8 yards to Terrell Crawford in the third and Fleeton 25 yards to Chad Nolan to close out the scoring late in the fourth. Eddie Garcia kicked a 20-yard field goal for the RiverHawks. Will Gregory led the Lions with 142 yards and one TD on 27 carries. The senior running back, who led the University of Hawaii in rushing his freshman season with 691 yards on 137 carries, earned the Lions a 7-all tie with a 11-yard run at 8:48 of the second quarter. Gregory established a season-best for both carries and yards. Crawford caught five passes for 98 yards and his TD, while Nolan added three catches for 66 yards and his TD. Kyjuan Tate led the Lions with 10 tackles and one quarterback sack. Missouri Southern, 1-6 overall and MIAA, returns to the friendly confines of Fred G. Hughes Stadium next Saturday for a 2:37 p.m. game against 2-5 Lindenwood. The battle of the Lions will be the MIAA TV game of the week, hence the unusual official starting time. This is Missouri Southern’s homecoming game. By From Staff Reports   By From Staff Reports", "external_links": [], "published": "2015-10-18T05:25:00.000+03:00", "crawled": "2015-10-18T18:46:03.036+03:00", "highlightTitle": ""}