{"organizations": [], "uuid": "0cc6fca0672d0f5c01169b88d56d97dc8cd73e83", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattlepi.com", "main_image": "http://ww1.hdnux.com/photos/41/34/46/8767884/7/rawImage.jpg", "site_section": "http://www.seattlepi.com/", "section_title": "Seattle news, weather, sports, events, entertainment | seattlepi.com - seattlepi.com", "url": "http://www.seattlepi.com/news/world/article/The-Latest-N-Korea-parade-for-party-anniversary-6562728.php", "country": "US", "title": "The Latest: Kim Jong Un appears at N. Korea military parade", "performance_score": 0, "site": "seattlepi.com", "participants_count": 1, "title_full": "The Latest: Kim Jong Un appears at N. Korea military parade - seattlepi.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "0cc6fca0672d0f5c01169b88d56d97dc8cd73e83"}, "author": "seattlepi.com", "url": "http://www.seattlepi.com/news/world/article/The-Latest-N-Korea-parade-for-party-anniversary-6562728.php", "ord_in_thread": 0, "title": "The Latest: Kim Jong Un appears at N. Korea military parade", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PYONGYANG, North Korea (AP) — The latest on the celebrations marking the 70th anniversary of the creation of North Korea's ruling party (all times local).\n___\n3 p.m.\nNorth Korean leader Kim Jong Un has made an appearance at a lavish military parade marking the 70th anniversary of the country's ruling party.\nThe North 's official Korean Central TV showed Kim, clad in black, walking down a red carpet and saluting his honor guard. Kim then walked up to a podium and waved to troops who were taking part in the parade Saturday in Pyongyang.\nVisiting Chinese official Liu Yunshan stood clapping to Kim's left, with senior North Korean officials on Kim's right. Kim smiled as he spoke with Liu through a translator.\nThe parade kicked off a huge anniversary celebration seen by analysts as a sign that Kim is trying to build up his own stature along with that of the party relative to the military.\n___\n2:30 p.m.\nNorth Korea has started a lavish parade in Pyongyang to mark the 70th anniversary of its ruling party's creation and trumpet the leadership of third-generation dictator Kim Jong Un with a display of military might.\nNorth Korea's official Korean Central TV showed goose-stepping soldiers marching at Kim Il Sung Square on Saturday afternoon to kick off a parade that is expected to also feature military vehicles and missiles.\nThe parade could hold some surprises for outside watchers who have been aware of North Korea's growing fleet of drone aircraft, long-range missiles and other weaponry.\nThe huge celebration this year is seen by analysts as a sign that Kim is trying to build up his own stature along with that of the party relative to the military.\n___\n11:30 a.m.\nThe military parade that will kick off celebrations marking the 70th anniversary of the creation of North Korea's ruling party has been delayed.\nThe parade was expected to be held Saturday morning, but was pushed back until the afternoon, apparently due to heavy rain Friday night. Even by late morning, as a light rain fell, officials had not distributed a final schedule — which is unusual even in North Korea.\nSuggesting that the show will indeed go on, crowds of people carrying bouquets of plastic flowers could be seen streaming to Kim Il Sung Square, where the event will be held. Military vehicles or possibly floats shrouded in blue plastic tarps to protect them against the weather were parked in a long row on a bridge leading to the parade route.\nThe parade could hold some surprises for analysts abroad who will be watching its display of weaponry very closely, particularly North Korea's growing fleet of drone aircraft and long-range missiles.", "external_links": ["http://ap.org/schemas/03/2005/apcm", "http://ap.org/schemas/03/2005/apnm"], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-10T10:18:34.195+03:00", "highlightTitle": ""}