{"organizations": [], "uuid": "1b19becc9d9a01b7131fa15803823677ba660d15", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mercurynews.com", "main_image": "http://extras.mnginteractive.com/live/media/site568/2015/0915/20150915__TOMSULA~1.JPG", "site_section": "http://feeds.mercurynews.com/mngi/rss/CustomRssServlet/568/200223.xml", "section_title": "Sports", "url": "http://www.mercurynews.com/tim-kawakami/ci_29015753/kawakami-49ers-sliding-jed-yorks-firing-line-is?source=rss", "country": "IL", "title": "Kawakami: With 49ers sliding, Jed York's firing line is taking shape", "performance_score": 0, "site": "mercurynews.com", "participants_count": 1, "title_full": "Kawakami: With 49ers sliding, Jed York's firing line is taking shape", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T09:30:00.000+03:00", "replies_count": 0, "uuid": "1b19becc9d9a01b7131fa15803823677ba660d15"}, "author": "Tim Kawakami\n\nMercury News Columnist", "url": "http://www.mercurynews.com/tim-kawakami/ci_29015753/kawakami-49ers-sliding-jed-yorks-firing-line-is?source=rss", "ord_in_thread": 0, "title": "Kawakami: With 49ers sliding, Jed York's firing line is taking shape", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted: 10/23/2015 05:43:48 PM PDT Updated: 10/23/2015 11:30:28 PM PDT It's a little too early for Jed York to start making dramatic changes with the 49ers, such as firing Jim Tomsula, because how would that actually help anything now? \nThis is the roster and the coaching staff York and Trent Baalke decided to ride with this season, and they actually started planning for it early last season, so I'm not sure anything big after a 2-5 start would fix much of anything. \nIt's not as if the 49ers have some superstar assistant coach already on staff just waiting to be the next dynamic NFL head coach. While I think Tomsula might get fired at some point this season if things don't turn around -- maybe at the bye week after two more games, maybe later -- I just don't see the purpose to doing it now, other than out of the sheer emotional convenience. \nTomsula seems like the easiest scapegoat and obviously he's not the guy to lead the 49ers back to the top of the NFC West. \nBut he's also York's hand-picked coach. He's the guy York and Baalke plotted to promote ALL of last season. He's the guy they day-dreamed about taking over this team once they could rid themselves of Jim Harbaugh. \nTo dump Tomsula after only five games -- well, that's admitting York and Baalke were wrong for a full year, wrong to fire Harbaugh like they did, wrong pretty much on all counts. \nAnd I don't think they're going to want to admit that quite yet. \nI think the most likely change in the immediate future is at quarterback: Blaine Gabbert for Colin Kaepernick, and the 49ers can use Kaepernick's swollen thumb as the reason when we can all guess that York and Baalke might've been thinking about this, anyway. Advertisement \nYou know that York and his inner circle of friends are not pleased with 2-5, especially with the offensive befuddlement and you know that they will not sit silently. They will have to blame somebody. \nHey, this is so bad that somebody should be blamed. I'm blaming Jed first and foremost, but of course the Jed York Inner Circle won't be doing that. \nNote: There are certainly people to blame who aren't named York and I'm sure the JYIC is busy doing that as we speak.. or has been doing that for weeks, actually, in the buddings of the whisper campaign against Kaepernick. \nWhich leads me to believe that the first major move, if the 49ers make one soon, might be to get Kaepernick out of there—at least temporarily—and see what back-up Gabbert can do. \nThere's a practical reason for this: Kaepernick has been mostly lousy this season and you can't blame anybody for not wanting to see much more of this, especially with a trip to St. Louis—which has played Kaepernick tough over the years—coming next Sunday. \nThere's also a Yorkian reason for this: He and Baalke snookered Kaepernick into taking a very team-friendly, lightly-guaranteed contract last year in which they can release him every March without long-term financial harm (to the 49ers). \nThey're already whispering about Kaepernick; he's not doing anything to allay the whispers. At some relatively quick point, 49ers management will want to see what else they've got as they take Steps 4, 5 and 6 to move on from him. \nThere are reasons to believe the 49ers really should move on from Kaepernick: Bounce passes, 49ers staffers hit on the head by his passes, strange reads... looks like he'll never beat Seattle... that's a big one. \nKaepernick will be blamed and he's playing terribly—though that offensive line isn't helping him or anybody. \nWhen it happens, Gabbert will get into the game. He won't be great, but he'll be different. The 49ers will still need a new starting quarterback in 2016. All this seems pretty well established. San Francisco 49ers head coach Jim Tomsula, right, confers with quarterback Colin Kaepernick during the second quarter of an NFL football game at Levi's Stadium in Santa Clara, Calif, Sept. 14, 2015. (D. Ross Cameron/Bay Area News Group) (D. ROSS CAMERON) \nKaepernick's benching, at some point, was fated to happen from the moment national reporters started saying Kaepernick had to prove himself this season. That's common sense, but when national reporters all say the same thing, it's a big tip-off that 49ers management is funneling that feeling to them. \n--What's the other short-term move the 49ers could make? I could see Baalke and York telling Tomsula to demote offensive coordinator Geep Chryst and move tight ends coach Tony Sparano into that role on an interim basis. \nSparano is nobody's X-and-O genius, but he's close to Bill Parcells, who is one of Baalke's mentors, and it's a way to get Chryst out of there. Theoretically. \n--The bye week seems like the largest opportunity to fire Tomsula, and that has to be a possibility if the 49ers play this poorly against the Rams and Falcons. \nIf that happened, the 49ers would probably make defensive coordinator Eric Mangini or Sparano the interim head coach. \nTo gain what, though? And Tomsula is a York family favorite, or at least he was before the team started losing games. \n* Last on this list is Baalke, because he's so close to everything the Yorks have done and because I just don't know if they can figure out how to hire a replacement GM. \nThe Yorks run an incredibly insular front office. They don't know or involve many people. They almost always hire from within. And who would they consult to replace Baalke? \nPlus, Baalke knows where all the bodies are buried. \nBaalke is mostly responsible for the deterioration of this roster, of course he is. \nBut Tomsula was the Yorks' hire and Baalke went along with it because he likes pleasing the Yorks. \nIf and when Jed decides to move on from Tomsula, I can see Baalke convincing the Yorks that he can nail the next coach-hire. Remember, Baalke was circling Adam Gase until the 49ers screwed that up by demanding that Gase hire Tomsula as his DC (and I'm not sure Baalke was in on that call, but who knows). \nAnd also: Kaepernick was Harbaugh's call. \nBaalke has some fingerprints on both moves, but maybe he convinces York to let 2016 be the Baalke Year. Baalke gets a new QB, Baalke hires a new coach, and then it's all on him. \nThat would be my guess. Read Tim Kawakami's Talking Points blog at blogs.mercurynews.com/kawakami . Contact him at tkawakami@mercurynews.com or 408-920-5442. Follow him on Twitter at twitter.com/timkawakami .", "external_links": [], "published": "2015-10-24T09:30:00.000+03:00", "crawled": "2015-10-24T09:33:51.073+03:00", "highlightTitle": ""}