{"organizations": [], "uuid": "3eead6d8672d979910a775d8620e11cc6a52d1e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "wtop.com", "main_image": "http://wtop.com/wp-content/uploads/2015/10/Wisconsin-Illinois-Football.jpeg", "site_section": "http://wtop.com/section/sports/feed/", "section_title": "WTOP » Sections » Sports", "url": "http://wtop.com/ncaa-football/2015/10/badgers-illini-bring-tough-defenses-to-big-game/", "country": "US", "title": "Badgers, Illini bring tough defenses to big game", "performance_score": 0, "site": "wtop.com", "participants_count": 1, "title_full": "Badgers, Illini bring tough defenses to big game", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T21:32:00.000+03:00", "replies_count": 0, "uuid": "3eead6d8672d979910a775d8620e11cc6a52d1e5"}, "author": "wtopstaff", "url": "http://wtop.com/ncaa-football/2015/10/badgers-illini-bring-tough-defenses-to-big-game/", "ord_in_thread": 0, "title": "Badgers, Illini bring tough defenses to big game", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Badgers, Illini bring tough defenses to big game By DAVID MERCER October 23, 2015 2:32 pm FILE - In this Oct. 18, 2015, file photo, Wisconsin coach Paul Chryst and quarterback Joel Stave (2) watch from the sidelines during an NCAA college football game in Madison, Wis. It's been awhile since Wisconsin and Illinois met when the game meant this much to both teams. The Badgers need the game Saturday, Oct. 24 in Champaign, Ill., to stay within sight of Big Ten West-leading Iowa. Stave will be shooting for his fourth win over an Illini team. (AP Photo/Andy Manis, File) \nCHAMPAIGN, Ill. (AP) — It’s been a while since Wisconsin and Illinois met when the game meant this much to both teams. \nThe Badgers (5-2, 2-1 Big Ten) need a win in Saturday’s game to stay within sight of Big Ten West-leading Iowa. And Illinois (4-2, 1-1), less than two months after seeing its head coach fired, isn’t out of the race, either. \nIn a season of defense in the Big Ten, the Badgers and Illini have two of the conference’s better units. \nWisconsin is ranked seventh nationally in total defense, giving up 272.3 yards a game. And the Badgers are even better in scoring defense, giving up a slim 10.9 points a game. Only Alabama (35 points) and Nebraska (21) have managed more than 10 points on them. \n“The edge guys and their linebackers are so active,” interim Illinois coach Bill Cubit said. “They’ll find out what your protection is and they’ll find a way to get their best player on your worst player.” \nThe Illini spent the previous two seasons giving up big yards and a lot of points. But this season, they are ranked a solid 30th in the country in total defense at 332.5 yards per game. And Illinois is giving up 19.7 points per game to rank 28th. \nIllinois has only beaten Wisconsin once in the last 10 meetings, a 31-26 upset in 2007 that signaled the Illini might be better than most expected. They finished that season in the Rose Bowl. \nThings to keep an eye on when Wisconsin faces Illinois: \nWILL HE PLAY? \nThis might be the week that Wisconsin running back Corey Clement returns from hernia surgery. Clement was expected to be Wisconsin’s next big back this season but hasn’t played since the opener against Alabama. Starting in his place, Dare Ogunbowale has 498 yards and four touchdowns on 95 carries. Coach Paul Chryst wasn’t sure about Clement’s availability against the Illini and added: “He’s not a magic potion, either, ‘Corey’s back, all things are cured.'” \nINJURED ILLINI \nIllinois will be without its top back, too. Josh Ferguson injured his right shoulder early against Nebraska and, after missing the Iowa game, will not play against the Badgers. Without him, the Illini are pencil-thin at running back. Freshman Ke’Shawn Vaughn is getting the bulk of the carries. Vaughn has 407 yards and three touchdowns on 95 carries. Interim coach Bill Cubit says Vaughn is on the way to becoming a good back, but isn’t there. \nBADGER AIR \nWithout Melvin Gordon in the backfield this season, Wisconsin has passed more this season. The Badgers are averaging 251 passing yards a game, fourth in the Big Ten. \n“I knew we would have to throw it a little more,” quarterback Joel Stave said. “We’d have to be more balanced.” \nSTOP THE RUN \nEven with more emphasis on the pass, Illinois linebacker T.J. Neal expects to see plenty of Wisconsin’s ground game. And he says Illinois needs to avoid a repeat of what happened late in the 29-20 loss at Iowa. The Hawkeyes chewed up almost half the fourth quarter on a 13-play drive that included 11 rushes and ground down an Illini defense that still lacks depth. \n“Our bodies were hurting,” Neal said. “Someone on defense has just got to make a play. We’ve got to get a three-and-out, we’ve got to get off the football field.” \nEARNED RESPECT \nBadgers quarterback Joel Stave will be shooting for his fourth win over an Illini team that’s often been outmanned against Wisconsin. But this season Illinois is already two-thirds of the way to bowl eligibility with six games to go, and all that after coach Tim Beckman was fired a week before the opener. \n“That would be tough,” Stave said. “It’s cool how they’ve rallied around their new coach and their team.” \n___ \nAP Sports Writer Genaro Armas contributed to this report. \n___ \nFollow David Mercer on Twitter: @davidmercerAP Topics:", "external_links": [], "published": "2015-10-23T21:32:00.000+03:00", "crawled": "2015-10-23T21:55:21.435+03:00", "highlightTitle": ""}