{"organizations": [], "uuid": "f23890ff5bcf126e42a8ec879ef39d482604256d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freep.com", "main_image": "http://www.gannett-cdn.com/-mm-/8aa7b80797d47a72367603d78afbb838ca031050/c=0-171-2087-1350&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/08/18/DetroitFreePress/DetroitFreePress/635755150255858636-AP-Indiana-Michigan-Football.jpg", "site_section": "http://rssfeeds.freep.com/freep/sports", "section_title": "Detroit Free Press - Sports", "url": "http://www.freep.com/story/sports/college/university-michigan/wolverines/2015/10/21/michigan-football-brady-hoke/74343446/", "country": "US", "title": "Former U-M coach Hoke: I wouldn't have punted", "performance_score": 0, "site": "freep.com", "participants_count": 23, "title_full": "Former U-M coach Hoke: I wouldn't have punted", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T23:23:00.000+03:00", "replies_count": 31, "uuid": "f23890ff5bcf126e42a8ec879ef39d482604256d"}, "author": "freep.com", "url": "http://www.freep.com/story/sports/college/university-michigan/wolverines/2015/10/21/michigan-football-brady-hoke/74343446/", "ord_in_thread": 0, "title": "Former U-M coach Hoke: I wouldn't have punted", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MORE Brady Hoke beat Michigan State once in four tries as Michigan's coach before he was fired last December.\nBut had he been in the hot seat for U-M's fourth down with 10 seconds left against Michigan State last Saturday, he feels he could have sealed the win.\nSpeaking on his SiriusXM radio show Tuesday night, he said he would not have punted, as U-M coach Jim Harbaugh decided (which led to punter Blake O'Neill fumbling the ball to MSU's Jalen Watts-Jackson for the 38-yard touchdown, sealing MSU's 27-23 win with no time remaining).\n\"When you play armchair quarterback, the only thing I would say is you've got to play to the strength of your football team -- and the strength of Michigan's football team all year long has been their defense,\" he said.\nDETROIT FREE PRESS\nBack at practice, U-M tries to move past MSU game\nAsked if the punt was the problem, he broke down the issues.\n\"There's too many mechanical parts to it,\" he said. \"The one gunner to the field should have been in a little bit more. If you are going to be in there's ways to protect it a little bit better. Hold the guys, have the other guys come in a little bit. I, as a coach, you've got to play to your strength. And your strength is your defense. And if it's a Hail Mary and that's all it would have been…\"\nHis co-host, Mark Packer, cut him off and asked about going for it on fourth down.\n\"Your playbook's open now,\" Hoke said. \"If you throw the ball, the clock's going to stop anyway, if you don't make it, because of the fourth down. You have an ability to give (U-M tailback) De'Veon Smith the ball, challenge your offensive line or play-action pass because Michigan State's going to be aggressive. You take some time off the clock, four or five seconds. A 60-yard field goal, (MSU's Michael) Geiger before the game was 5 of 9 and it's a 60 yard field goal.\"\nO'Neill bobbled the snap, another issue Hoke felt would have been avoided if they ran a normal fourth down play.\nA quarterback takes 1000-2000 snaps from center every single year,\" he said. \"In practice there may be 150 of them when (you) count the pre-practice snaps and different things.\"\nDETROIT FREE PRESS\nU-M's O'Neill makes jokes but no excuses for blunder\nHoke pointed out that he can relate to a decision ruining a potentially huge win.\n\"I know it's easy from where we sit right now,\" he said. \"I've been on the sidelines and had to make decisions. We went for two against Ohio (State) two years ago because Devin Gardner had a broken foot, didn't think the defense was playing as well as we needed to play so go for the win (in the 42-41 loss). Jimmy (Harbaugh), I'm sure, they went over what they would do, how they wanted to do it, communication all over the place. Personally, if we had the No. 1 defense in the nation, I'm going to test those guys.\n\"You've got to have that confidence in your players to go make plays. With that defense, pressure on the quarterback, make him get the ball out. I've seen the (1994) Colorado-Michigan Hail Mary a thousand times. But your strength of your team's your defense. Guys up front, go pressure during the whole game, play to your strength and that's your defense.\"\nHoke opened by talking about the pressure of the moment, especially watching so many players he recruited – though not O'Neill – endure such heartbreak.\n\"It was one of those games, you feel for those kids, you really feel for them,\" he said. \"That's a tough way to lose a game, it's heart-wrenching and it's against one of your biggest rivals. Blake O'Neill, my thoughts go out to him, they take to Twitter. These are college kids, 18- to 22-year olds, he didn't go out there not to get the punt off. But at the same time, you comment on game and it's easy to play armchair quarterback and second guess. You've really got to give Michigan State a lot of credit, for forcing the fourth down and then as a coach on the sidelines you're making decisions in the heat of the moment.\"\nContact Mark Snyder at msnyder@freepress.com . at @mark__snyder. Download our new Wolverines Xtra app on iTunes and Android !", "external_links": ["http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/1cc410f07f5d9c22511dddd1523f78538f7cba8e/c=427-0-1973-1546/local/-/media/2015/10/21/DetroitFreePress/DetroitFreePress/635810149916294609-UMFball-102015-JHG09.jpg", "http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/ac5189d31397afcf7c88a045fa3213c7208faaa3/c=281-0-2118-1837/local/-/media/2015/10/20/DetroitFreePress/DetroitFreePress/635809693460016542-UMFball-102015-JHG02.jpg", "https://play.google.com/store/apps/details?id=com.gannett.dolly.Wolverines&hl=en", "https://itunes.apple.com/us/app/wolverine-xtra/id968481321?mt=8"], "published": "2015-10-21T23:23:00.000+03:00", "crawled": "2015-10-22T00:04:27.097+03:00", "highlightTitle": ""}