{"organizations": [], "uuid": "b39d0df1bd2f6633e738c1d3f0fdbc0a1a362ee2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.app.com", "main_image": "http://www.gannett-cdn.com/-mm-/2122727429c3c3ee0464a8286ffddff0ef2cea5e/c=0-885-1736-1866&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/23/NJGroup/AsburyPark/635812056319081608-Sam-Bergen.jpg", "site_section": "http://www.app.com/rss/collegesports", "section_title": "Asbury Park - Sports", "url": "http://www.app.com/story/sports/college/rutgers/2015/10/24/rutgers-bergen-recorded-first-carry-unorthodox-way/74403596/", "country": "US", "title": "Rutgers' Bergen recorded first carry in unorthodox way", "performance_score": 0, "site": "app.com", "participants_count": 1, "title_full": "Rutgers' Bergen recorded first carry in unorthodox way", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T03:00:00.000+03:00", "replies_count": 0, "uuid": "b39d0df1bd2f6633e738c1d3f0fdbc0a1a362ee2"}, "author": "app.com", "url": "http://www.app.com/story/sports/college/rutgers/2015/10/24/rutgers-bergen-recorded-first-carry-unorthodox-way/74403596/", "ord_in_thread": 0, "title": "Rutgers' Bergen recorded first carry in unorthodox way", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MORE PISCATAWAY -- A sixth-year senior fullback that has just this season stepped into a starting role, Rutgers' Sam Bergen finally had his first career carry last week when the Scarlet Knights scored 28 unanswered points to stun Indiana in Bloomington.\nThe thing is, Bergen's first carry didn't come via handoff from Chris Laviano. Instead, Bergen carrying the ball for the first time came as a surprise, at least to the Hoosiers.\nWith Rutgers lined up to punt from it's own 28-yard line early in the second quarter, instead of kicking the ball away, Bergen took a direct snap and ran 15 yards for a first down. After Bergen kept the drive alive, Laviano dropped back on first down and connected with Leonte Carroo for a 58-yard touchdown on the very next play to pull the Scarlet Knights to within four points at 17-13.\n\"Everyone was pretty jacked up,\" Bergen said with a smile after practice last week as Rutgers continued preparations to take on No. 1 Ohio State. \"It's not too often that the ball is in my hands, especially on a fake punt, so the guys were pretty pumped about it. It was awesome.\n\"The situation came up for us to call the play and we've been practicing that for a couple of weeks. Coach felt it was the right time to call it and we executed the play. We were successful with it, so it was a great call and everything turned out good.\"\nThe fact that Bergen recorded his first carry on an unorthodox play like a fake punt not only speaks to him being prepared for any situation, but also to the confidence level Rutgers head coach Kyle Flood had in putting Bergen in a spot like that.\n\"Myself and the rest of my teammates, we go out, practice every day and play every play like it's our last,\" Bergen said. \"We understand how important it is to prepare and that gives you the confidence to go out there and execute on game-day,\" Bergen said. \"That fake punt was just an example of that. We'd been practicing that for a couple weeks and we felt confident in that play-call. When the situation came up and we called it, we were able to execute.\"\nAdditionally, score another one for the Scarlet Knights' special teams. That unit has made its mark over the years by blocking punts and field goals. Since 2009, Rutgers has blocked 43 punts and field goals, which is the most in the nation over that span.\nIn this instance, instead of blocking a kick on special teams, it was Bergen keeping a scoring drive going.\n\"It's one of the building blocks of our program,\" Flood said. \"We've always felt like special teams was a way we can get an advantage in a game, it's a way we could win a game. It's never been a way to pass the ball back and forth, we never approached it like that. We've spent a lot of time in meetings, spend a lot of time in practice on the finer points, all the way down to how to scoop-and-score a fumble.\"\nStaff writer Josh Newman: jnewman4@gannettnj.com", "external_links": [], "published": "2015-10-24T03:00:00.000+03:00", "crawled": "2015-10-25T02:07:22.172+02:00", "highlightTitle": ""}