{"organizations": [], "uuid": "85aada60a73ce76ba09e0374c5996d51c94f6265", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.oregonlive.com", "main_image": "http://imgick.oregonlive.com/home/olive-media/width620/img/opinion_impact/photo/2015/10/08/18931654-standard.jpg", "site_section": "http://www.oregonlive.com/", "section_title": "Oregon Local News, Breaking News, Sports &amp; Weather - OregonLive.com", "url": "http://www.oregonlive.com/opinion/index.ssf/2015/10/house_conservatives_seek_a_fol.html", "country": "US", "title": "House conservatives seek a follower to be their leader: Dana Milbank", "performance_score": 0, "site": "oregonlive.com", "participants_count": 6, "title_full": "House conservatives seek a follower to be their leader: Dana Milbank | OregonLive.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T21:00:00.000+03:00", "replies_count": 5, "uuid": "254e6955123d5a2e5f87e9a92c7da015fbf86c05"}, "author": "Syndicated columns", "url": "http://www.oregonlive.com/opinion/index.ssf/2015/10/house_conservatives_seek_a_fol.html#post-0", "ord_in_thread": 0, "title": "House conservatives seek a follower to be their leader: Dana Milbank", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Dana Milbank\nWASHINGTON -- You think John Boehner had a rocky time as speaker of the House? Just wait until you see how his successor fares this fall -- if House Republicans can even find a successor.\n The same conservatives who badgered Boehner into retirement wasted no time in ousting his hand-picked successor, Kevin McCarthy.\nConservatives had been grumbling about McCarthy as the speaker-apparent almost from the moment Boehner announced his retirement, and by the eve of Thursday's House GOP vote to name a Boehner replacement, the criticism of McCarthy was murderous.\nRep. Tom Massie (Kentucky) declared at a luncheon with reporters Wednesday that \"there is absolutely no way that I think you can vote for McCarthy and go back home and tell your constituents you did the best thing for them.\"\nRep. Raul Labrador (Idaho) had questions about whether McCarthy \"is prepared for such a high office.\"\nAnd Rep. Tim Huelskamp (Kansas) let it be known that \"outside conservative groups are not comfortable at all with picking Boehner's right-hand man to take the speaker's spot.\"\nOn the eve of Thursday's vote, the conservative Freedom Caucus announced that its few dozen members would vote en bloc against McCarthy. He had enough votes to prevail in the caucus election on Thursday, but unless he could win over the conservative holdouts, he wouldn't prevail in speaker elections that had been set for Oct. 29.\nAnd so, at noon on Thursday, the time the leadership election was to occur, McCarthy withdrew from the race.\nMcCarthy's surrender is surprising, but nothing changes. It doesn't really matter who the next speaker is, because that person will be leader in title only. Conservatives, far from being placated by Boehner's ouster, are emboldened: They have plans to bend the entire House to their will.\nDefaulting on the federal debt? Not a problem. Shutting the government to defund Planned Parenthood? So be it.\nThese were a couple of the take-aways from Wednesday's installment of \"Conversations with Conservatives,\" a monthly luncheon sponsored by the Heritage Foundation (parent company of the House GOP caucus) and catered by Chick-Fil-A, the fast-food chain owned by religious conservatives. The 10 men on the dais, members of the Freedom Caucus, the Republican Study Committee, the Tea Party Caucus and other conservative factions, might be considered the politburo of the new conservative order in the House.\n\"The marginalizing of conservatives that's taken place over the last nine months is just not going to be tolerated anymore,\" declared Rep. Andy Harris (Maryland).\n\"We have an opportunity to completely change what's happening,\" announced Labrador.\nTo seize this \"opportunity,\" they presented the three contenders for the speakership -- McCarthy, Jason Chaffetz and Daniel Webster -- with a list of demands that would increase the (already deafening) voice of conservatives in the House.\nThere may only be a few dozen die-hard conservatives in the caucus, but, as Boehner and McCarthy have learned, if they withhold their votes, they deny Republican leaders a majority. Any would-be speaker, therefore, had better do what conservatives want -- and that includes likely showdowns over a debt-ceiling increase, an omnibus spending bill, a transportation bill and Export-Import Bank legislation.\nBeyond that, the conservatives demand that the speaker never punish them for voting against the caucus; let them amend legislation on the floor at will; never let bills come to the floor without the support of a majority of Republicans; and refuse to take up Senate-brokered compromises.\nThat would lead to shutdown and default in short order. But this did not seem to be a major concern over lunch. Labrador, mocking GOP leaders' claims that \"we can't shut down the government,\" said he would prefer a leader who would be willing to fight -- \"even if we fail.\"\nPaul Singer of USA Today observed that the conservatives' description of leadership is more like followership. \"You're asking for a speaker,\" he said, who \"follows your lead.\"\nThey did not dispute this notion. Rep. Justin Amash (Michigan) said that \"we want a process-focused speaker,\" while Rep. Jeff Fleming (Louisiana) said the goal is to give \"power to the individual members\" so that the speaker no longer is \"dictating the agenda.\"\nThen why doesn't one of the conservative hard-liners run for the speakership himself?\nLabrador's answer was revealing. \"When you're leading the revolution, you also upset a lot of people,\" he said. \"It's very difficult to make change as we have been trying to make and also build a coalition.\"\nThat's true. It's harder to build a coalition than to tear things apart. And this is why the next speaker -- whoever it is -- will be no match for emboldened conservatives hell-bent on destruction.\nFollow Dana Milbank on Twitter, Milbank.\n(c) 2015, Washington Post Writers Group", "external_links": [], "published": "2015-10-09T21:00:00.000+03:00", "crawled": "2015-10-11T20:13:45.565+03:00", "highlightTitle": ""}