{"organizations": [], "uuid": "7903f4e3d0caf450291d382cc3af6d838369beaa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.norwichbulletin.com", "main_image": "http://www.norwichbulletin.com/Global/images/head/nameplate/norwich_logo.png", "site_section": "http://www.norwichbulletin.com/sports?template=rss&mime=xml", "section_title": "Sports - The Bulletin", "url": "http://www.norwichbulletin.com/article/20151014/SPORTS/151019762/17199/NEWS?rssfeed=true", "country": "US", "title": "H.S. girls roundup: Fitch volleyball edges East Lyme to stay undefeated", "performance_score": 0, "site": "norwichbulletin.com", "participants_count": 1, "title_full": "H.S. girls roundup: Fitch volleyball edges East Lyme to stay undefeated", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T06:22:00.000+03:00", "replies_count": 0, "uuid": "7903f4e3d0caf450291d382cc3af6d838369beaa"}, "author": "The Bulletin", "url": "http://www.norwichbulletin.com/article/20151014/SPORTS/151019762/17199/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "H.S. girls roundup: Fitch volleyball edges East Lyme to stay undefeated", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "• H.S. boys roundup: Bacon Academy soccer blanks NFA to stay in 1st... EAST LYME — Mae Sefransky distributed 42 assists and Jen Severino had 21 kills to lead the Fitch volleyball team over East Lyme, 3-2 (25-16, 25-18, 23-25, 18-25, 15-13), in a battle of the top two teams in the Eastern Connecticut Conference Large Division on Wednesday evening. Caroline Parker had 10 digs and Ryanna Kelsey added 14 kills for the undefeated Falcons (14-0, 6-0). Alexis Bell had 43 assists, Maggy Powers had 16 kills, and Gabby Murphy made nine blocks for the Vikings (8-3, 3-2), who had their five-match winning streak snapped. Woodstock 3 Bacon 0 COLCHESTER — Jacqueline Low served up 19 points and 18 kills and the Centaurs (12-3, 3-2 ECC Large) defeated the Bobcats (4-12, 0-6), 25-15, 25-9, 25-13, for their eighth consecutive win. Lyman 3 Griswold 0 LEBANON — Katy Konow doled out 26 assists along with seven digs to lead the Bulldogs to their 13th consecutive win, 25-19, 25-14, 25-19. Andee Bender added nine kills and eight digs for Lyman (13-1, 6-0 ECC Small). Skylar Hanley had 11 assists, six digs and four kills for Griswold (6-7, 2-2). Killingly 3 New London 0 KILLINGLY — Ally Conde recorded 16 points, 10 aces and 10 kills to lead the Redgals to their third win in a row, 25-12, 25-12, 25-10. Christina McDermott added 21 assists and five digs for Killingly (8-6, 3-1 ECC Medium). New London dropped to 0-11 overall, 0-4 in the division. Waterford 3 Montville 0 MONTVILLE — Leah Terrell served up 16 points to lead the Lancers to a sweep, 25-15, 15-17, 25-23. Mickayla Shelburn added 14 kills for Waterford (10-4, 5-0 ECC Medium). Olivia Fargo totaled 13 service points and 11 digs for Montville (6-8, 3-2). Wheeler 3 Windham 1 NORTH STONINGTON — The Lions (6-8, 1-4) won their first ECC Small match with a 25-16, 14-25, 25-18, 25-21 victory over the Whippets. Mio Gonzalez had 22 service points and 14 assists for Windham (4-10, 1-4). Norwich Tech 3 Grasso Tech 0 GROTON — Vanessa Gumbs had 18 service points, six aces and five digs to lead the Warriors to victory, 25-11, 25-14, 25-12. Anna Hammar added nine kills and three blocks for Norwich Tech (8-3, 7-0 CSC East). Vanessa Parra had 10 digs for Grasso Tech (3-10, 1-5). Windham Tech 3 Prince Tech 2 WILLIMANTIC — Allisyn Spicer totaled 17 service points and 15 digs and the Mighty Tigers clinched a state tournament berth with a 25-15, 13-25, 25-21, 23-25, 16-14 victory. Marissa Shirshac added 12 service points, 15 digs and seven kills for Windham Tech (8-5). Page 2 of 2 - Putnam 3 Ellis Tech 1 PUTNAM — Elyse Bergeron tallied seven aces and two assists and the Clippers (3-8, 3-3 CSC East) topped the Eagles (2-11, 1-7), 25-14, 25-15, 19-25, 25-16. Pomfret 3 Worcester 2 POMFRET — Ellie Marousis doled out 24 assists and the Griffins came back to win, 25-9, 22-25, 21-25, 25-10, 15-10. Rita Calvert totaled 15 kills and six aces and Deja Ross added eight kills and three blocks for Pomfret (7-3). SOCCER Windham 0 MONTVILLE — Emma Givens had two goals and an assist to boost the Saints. Kara Bassett and Mia Londregan each had a goal and an assist for St. Bernard (6-5-1, 6-0-1 ECC Small). Emily Tartsinis made 14 saves for Windham (2-9, 0-7). Hamden 4 NORWICH — Kayla Tosses made 11 saves, but the Wildcats (2-10) could not keep pace. Marianapolis 4 Berwick 0 THOMPSON — Emily Sheridan scored two goals and the Golden Knights won their fourth straight game. Caroline Soucy opened the scoring for Marianapolis (8-1-1) with her team-leading 11th goal. Anna Bagley also scored. Christian Heritage 3 NEW LONDON — Camryn Webinski scored the only goal for the Blues (3-3-1) in defeat. FIELD HOCKEY", "external_links": [], "published": "2015-10-15T06:22:00.000+03:00", "crawled": "2015-10-15T05:54:00.549+03:00", "highlightTitle": ""}