{"organizations": ["Associated Press"], "uuid": "0591a306e6494991ab764da0171e59b2606d661e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribtown.com", "main_image": "http://d1bdhkmqqz901h.cloudfront.net/1200x630/smart/s3.amazonaws.com/hne-smedia/6/c/6cb9f441c7664c37bf50abea74776cbc/web_full_545923376267.jpg", "site_section": "http://tribtown.com//feed/sec/6000", "section_title": "TribTown.com - Sports News", "url": "http://www.tribtown.com/view/story/6cb9f441c7664c37bf50abea74776cbc/TEN--Shanghai-Masters", "country": "US", "title": "Nadal gets 1st top-5 win in more than a year, routs Wawrinka to reach Shanghai semifinals", "performance_score": 0, "site": "tribtown.com", "participants_count": 0, "title_full": "Nadal gets 1st top-5 win in more than a year, routs Wawrinka to reach Shanghai semifinals", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T16:03:00.000+03:00", "replies_count": 0, "uuid": "0591a306e6494991ab764da0171e59b2606d661e"}, "author": "", "url": "http://www.tribtown.com/view/story/6cb9f441c7664c37bf50abea74776cbc/TEN--Shanghai-Masters", "ord_in_thread": 0, "title": "Nadal gets 1st top-5 win in more than a year, routs Wawrinka to reach Shanghai semifinals", "locations": ["Shanghai"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Nadal", "JUSTIN BERGMAN", "Wawrinka"], "text": "Nadal gets 1st top-5 win in more than a year, routs Wawrinka to reach Shanghai semifinals By JUSTIN BERGMAN Associated Press   9:03   9:03   \nPeople: Photo Gallery: \nClick to view (8 Photos) \nSHANGHAI — Rafael Nadal beat a top-five player for the first time in more than a year with a convincing 6-2, 6-1 win over Stan Wawrinka on Friday to reach the semifinals of the Shanghai Masters. \nTop-seeded Novak Djokovic also advanced with his 15th consecutive victory, holding off Australia's Bernard Tomic in a tight first-set tiebreaker before closing it out 7-6 (6), 6-1. \nNadal hadn't won against a top-five player since last year's French Open final when he defeated Djokovic for his 14th Grand Slam title. \nThe eighth-seeded Spanish player looked sharp throughout the match against Wawrinka and his shots had the pace and depth they lacked at times this year. For the second straight match, he also faced only one break point, which he saved. \nIt was Nadal's most lopsided win over Wawrinka in 15 meetings. He spent more time practicing before the match (80 minutes) than he did on Stadium Court (63 minutes). \n\"Obviously, when you play against the best players, you want to play well and be competitive,\" he said. \"I am happy. I am working so hard every day, with the right energy, I believe.\" \nThe fourth-seeded Wawrinka was clearly not at his best. The French Open champion missed wildly on his groundstrokes, finishing with 34 unforced errors. \nHe was playing his eighth match in the past 10 days after winning the title in Tokyo last week and was coming off a tough three-set victory over Marin Cilic in the Shanghai quarterfinals that finished late Thursday night. \n\"Today I was just struggling a little bit. It's that simple,\" he said. \"Against Nadal you cannot do anything if you're not 100 percent.\" \nDjokovic was tested for the first time in his two-week swing through China. Until Friday, he hadn't lost more than five games in any of his five matches last week on his way to the title at the China Open and in his first two matches in Shanghai. \nTomic pressed him in the first set, rallying from 2-4 down to force a tiebreaker and then saving two set points before Djokovic finally converted on the third. \n\"(It) went down to a couple points decided the first set in the tiebreak,\" Djokovic said. \"Obviously was a huge relief for me to win the first set.\" \nAlthough Tomic didn't have much fight left in the second set, he's projected to rise to a career-high ranking of No. 18 on Monday. \nNadal will play Jo-Wilfried Tsonga in the semifinals on Saturday after the French player topped Kevin Anderson of South Africa 7-6 (6), 5-7, 6-4. Djokovic will play the winner of Friday's final quarterfinal between Andy Murray and Tomas Berdych. \n ", "external_links": [], "published": "2015-10-16T16:03:00.000+03:00", "crawled": "2015-10-16T18:23:55.271+03:00", "highlightTitle": ""}