{"organizations": [], "uuid": "0deeb484adf6b206819a8305013fe9474953a2a5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.torontosun.com", "main_image": "http://storage.torontosun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297763877692_ORIGINAL.jpg?quality=80&size=100x", "site_section": "http://www.torontosun.com/sports/rss.xml", "section_title": "Top Sports stories", "url": "http://www.torontosun.com/2015/10/23/indiana-is-freaky-about-pacer", "country": "CA", "title": "Indiana is Freaky about pacer", "performance_score": 0, "site": "torontosun.com", "participants_count": 0, "title_full": "Indiana is Freaky about pacer", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T05:21:00.000+03:00", "replies_count": 0, "uuid": "0deeb484adf6b206819a8305013fe9474953a2a5"}, "author": "", "url": "http://www.torontosun.com/2015/10/23/indiana-is-freaky-about-pacer", "ord_in_thread": 0, "title": "Indiana is Freaky about pacer", "locations": ["TORONTO", "Indiana"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Report an error TORONTO - \nTwo weeks ago, Freaky Feet Pete ruled the roost at Hoosier Park. Now, he has a chance to be the star of the Breeders' Crown. \nThe Three-year-old Colt Pace is one of the marquee races of the $5.8 million (U.S.) extravaganza that has descended on Woodbine for the first time since 2012. Championship races in all 12 divisions will be contested on Saturday, with a special post time of 6:30 p.m. \nRacing for the first time outside his Indiana home, Freaky Feet Pete took his elimination last Saturday in 1:49 4/5. By contrast, Artspeak won the other heat in 1:51 3/5. \nSupplemented to the Breeders' Crown for $62,500, Freaky Feet Pete captured nine of his 10 starts as a two-year-old. \nThis season he has won 11 of 13 starts at Hoosier. His only losses came to a pair of high-profile shippers, Wakizashi Hanover, who is also in the Crown final, and divisional leader Wiggle It Jiggleit, who was not supplemented to the race. He also has become a local star at his home in LaGrange, Ind. \n\"I go out for a cup of coffee and the first thing everyone asks is how Pete did that weekend,\" trainer Larry Reinheimer said. \"He's a hometown hero.\" \nThe horse is a family affair for Reinheimer, his wife Mary Jo and son Marty, who own and bred the son of Rockin Image. They still have a hard time believing they have a colt who can compete at the sport's highest level. \n\"I keep pinching myself to see if it's real,\" Larry Reinheimer said. \"I never thought about (winning a Breeders' Crown). I'd just watch it on TV and be amazed by those great horses and never thought we'd have one.\" \nTrace Tetrick, the younger brother of Tim, will once again drive Freaky Feet Pete. \nGINGRAS READY \nThe best horses are at the Breeders' Crown and so are the best drivers. Yannick Gingras is definitely among them. \nThe 36-year-old native of Sorel, Que., led the sport in money won for the first time last year and is on his way to repeating that feat. And on Saturday he has a chance at a big night. \nHe likely will get one with Southwind Frank in the Two-Year-Old Colt Pace, the Ron Burke trainee who has been absolutely dominant this season. \n\"He's been good all year,\" Gingras said. \"Now a lot of people are coming up to me and saying he's in the great horse category now. Hopefully he can come out and get the job done on Saturday.\" \nHe's also favored to win the Two-year-old Filly Trot with All The Time, an open-lengths winner of her elimination. And Mission Brief, who was upset last time out in the Kentucky Filly Futurity, is the 2-5 favourite to redeem herself in the Three-year-old Filly Pace. \nHis big horse, however, is Pinkman, who has won the Hambletonian and Canadian Trotting Classic and in his most recent start, captured the Kentucky Futurity at the Red Mile. \nEven though she goes up against the unbeaten and dominant Pure Country in the Two-year-old Filly Pace, Yankee Moonshine could provide Gingras with an upset. \nThen, there is the legendary Foiled Again. The 11-year-old is the sport's richest horse with $7.2 million in earnings. And his win in last week's elimination proved even to Gingras that he still has something left in the tank. \n\"He's unbelievable,\" he said. \"I'm done writing him off. I've done that four or five years in a row and he's always made a liar out of me.\" \n\"This year has been tough. He's had a lot of outside post positions. He's not able to do two or three moves like he used to. But last week, it worked out perfectly\" \nINTERNATIONAL FLAVOUR \nThe one foreign performer on the night will be Creatine. The five-year-old goes into the Open Trot off a third-place finisher in the International Trot at Yonkers. \nHis two wins this year came in Finland and Sweden in July. \nJohnny Takter, brother of trainer Jimmy, will drive. \nTHE OTHER RACE \nAfter the 12 Breeders' Crown champions are determined, there's one little present for the bettors. The conditioned pace at the end of the card will produce a mandatory payout of the Jackpot Hi-5 which currently stands at $557,274. History tells us that pot will likely grow to around $2 million by the time the 12-horse field turns into the stretch to start. Sponsored Links", "external_links": [], "published": "2015-10-24T05:21:00.000+03:00", "crawled": "2015-10-24T06:18:47.199+03:00", "highlightTitle": ""}