{"organizations": [], "uuid": "51541a0e4434a3d08914180fcf10c104c2364790", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "http://www.bostonherald.com/sites/default/files/media/2015/09/26/092615Soxjm28.1.jpg", "site_section": "http://bostonherald.com/sports/red_sox_mlb", "section_title": "Sports: Red Sox &amp; MLB | Boston Herald", "url": "http://bostonherald.com/sports/red_sox_mlb/boston_red_sox/2015/10/red_sox_notebook_bogaerts_a_big_hit_at_age_22", "country": "US", "title": "Red Sox Notebook: Bogaerts a big hit at age 22", "performance_score": 0, "site": "bostonherald.com", "participants_count": 2, "title_full": "Red Sox Notebook: Bogaerts a big hit at age 22 | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T03:00:00.000+03:00", "replies_count": 1, "uuid": "7c7274129fd027e3cad6762a3941439df1b68dc9"}, "author": "Jason Mastrodonato", "url": "http://bostonherald.com/sports/red_sox_mlb/boston_red_sox/2015/10/red_sox_notebook_bogaerts_a_big_hit_at_age_22#post-0", "ord_in_thread": 0, "title": "Red Sox Notebook: Bogaerts a big hit at age 22", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Xander Bogaerts wanted to finish the season with 200 hits, but had to settle for 196 after he collected just four over the Red Sox’ final eight games.\n“I know I fell short,” Bogaerts said.\nStill, the shortstop made it onto a short list of players who registered as many as his 196 hits at age 22 or younger in the last 50 years, joining Starlin Castro (2011), Miguel Cabrera (2005), Alex Rodriguez (1996, ’98), Cal Ripken Jr. (1983) and Garry Templeton (1977). Bogaerts finished second in the American League in batting average behind Cabrera (.338).\n“It definitely would have been a nice accomplishment,” Bogaerts said of the 200-hit threshold. “I’m obviously extremely happy with the way my season has been, and obviously how we played down the stretch and in the second half. So it’s a lot of excitement going into next year.”\nBogaerts cut down his strikeout rate from 23 percent in 2014 to 15 percent this year. He actually swung at more balls this year (36 percent) than he did last year (30 percent), but he made more contact, too, showing a willingness to settle for singles. His pull percentage dropped from 47 percent in ’14 to 34 percent this year, according to fangraphs.com.\nAnd Bogaerts knows he’ll need to make even further adjustments. He’s too strong to hit just seven home runs and too athletic to have just three triples. He did hit 35 doubles, third on the team behind Mookie Betts (42) and David Ortiz (37).\n“Later on in the season, my feet just got tired,” Bogaerts said. “I could feel myself during practice not using them anymore, but you have to grind it out, and just make sure I kept doing what I’d been doing. I think I have a pretty good idea about what I’m doing, especially on defense right now.”\nNo longer are there any questions about his ability to play shortstop.\n“I always knew I had good hands, but just making all those plays, sometimes I’m like, ‘Wow, you really came a long way. Definitely be proud of yourself,’ ” Bogaerts said.\nDynamic duo\nJoining Bogaerts with a breakout season was Betts.\nBogaerts and Betts (.291) were the first teammates in the majors to bat at least .290 at age 22 or younger since 21-year-old Ted Williams (.344) and 22-year-old Bobby Doerr (.291) did so for the 1940 Red Sox. While Bogaerts turned 23 last week, Betts will do so tomorrow.\nBetts finished up with 286 total bases. The Sox consider the outfielder to be the ideal leadoff hitter, though interim manager Torey Lovullo publicly challenged him to increase his on-base percentage with about a month left. Betts responded with a 36-game streak of getting on base, posting a .360 OBP in that time. The streak was snapped in the finale. . . .\nOrtiz was named a finalist for the Hank Aaron Award, which recognizes one outstanding offensive player from each league. The DH won the award in 2005.\nWatchoo talkin’ ’bout?\nCarl Willis began the year as a Triple-A pitching coach for the Cleveland Indians and finished it in the same job for the Red Sox. He’ll be around next year, too.\nSox starters had a 30th-ranked 5.56 ERA until May 9, when Willis was hired, and a 17th-ranked 4.15 ERA the rest of the way. He helped turn around Rick Porcello and Joe Kelly , while also overseeing the development of Eduardo Rodriguez and Henry Owens .\n“It’s a great opportunity and I’m thankful to be part of this tremendous organization,” Willis said. “There is still a lot of work to be done and we’ll do our best to see it happen. . . . I’m sure we’ll sit with the front office and determine needs, see who is available and do our best with the people we have. We like the people we have.”", "external_links": [], "published": "2015-10-06T03:00:00.000+03:00", "crawled": "2015-10-06T21:24:19.427+03:00", "highlightTitle": ""}