{"organizations": [], "uuid": "5e1a7bdc0434623029847b8d7888e672c46ff0b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "http://images.tribuneindia.com/cms/gall_content/2015/10/2015_10$largeimg17_Saturday_2015_223249644.jpg", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/world/speculation-rife-over-biden-joining-2016-us-prez-race/147236.html", "country": "US", "title": "Speculation rife over Biden joining 2016 US prez race", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "Speculation rife over Biden joining 2016 US prez race", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "5e1a7bdc0434623029847b8d7888e672c46ff0b6"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/world/speculation-rife-over-biden-joining-2016-us-prez-race/147236.html", "ord_in_thread": 0, "title": "Speculation rife over Biden joining 2016 US prez race", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Washington, October 17\nSpeculation is rising that Vice-President Joe Biden is close to a decision on entering the 2016 US presidential race even as the White House has been silent and President Barack Obama evaded queries on the issue. The immediate provocation appeared to be an email written by Biden’s close aide Ted Kaufman to his supporters that the Vice-President’s campaign would be “optimistic”, “from the heart” and unscripted. The email was written late on Thursday and yesterday the International Association of Fire Fighters informed Biden that its union would endorse him if he entered the race. “If he runs, he will run because of his burning conviction that we need to fundamentally change the balance in our economy and the political structure to restore the ability of the middle class to get ahead,” Kaufman wrote according to multiple media reports. According to the Wall Street Journal, Biden is expected to announce in the coming days whether he will enter the presidential race. “Biden could still pull back, however, if he concludes he is too shaken by his son’s recent death to mount a campaign. Another consideration for Biden: the fortunes of frontrunner Hillary Clinton,” the daily said referring to the massive hand in cash that Clinton now has. Obama deflected questions on this. “I am not going to comment on what Joe is doing or not doing. I think you can direct those questions at my very able Vice-President,” he said at a White House news conference. “I think that the Vice-President, like every other candidate, makes their own decisions about these issues and they’ll have to figure out what makes sense for them,” Obama said and declined to name his favourite candidate. — PTI", "external_links": [], "published": "2015-10-18T03:00:00.000+03:00", "crawled": "2015-10-18T04:08:42.836+03:00", "highlightTitle": ""}