{"organizations": ["United States of America"], "uuid": "6ba3074d20967c7da1365d1f2e9712921f4273c8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "http://s4.reutersmedia.net/resources/r/?m=02&d=20151025&t=2&i=1089719233&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB9O0LY", "site_section": "http://mf.feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "http://uk.reuters.com/article/2015/10/26/uk-motor-racing-prix-idUKKCN0SJ0X020151026?feedType=RSS&feedName=sportsNews", "country": "US", "title": "Hamilton takes third F1 title after U.S. thriller", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "Hamilton takes third F1 title after U.S. thriller", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T09:20:00.000+02:00", "replies_count": 0, "uuid": "6ba3074d20967c7da1365d1f2e9712921f4273c8"}, "author": "", "url": "http://uk.reuters.com/article/2015/10/26/uk-motor-racing-prix-idUKKCN0SJ0X020151026?feedType=RSS&feedName=sportsNews", "ord_in_thread": 0, "title": "Hamilton takes third F1 title after U.S. thriller", "locations": ["Britain", "United States", "Americas", "U.S.", "The Americas", "Austin", "AUSTIN", "United States of America", "Texas", "Germany"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hamilton", "Alan Baldwin", "Nico Rosberg", "Sebastian Vettel", "Lewis Hamilton", "Hoch ZweiLivepic"], "text": "AUSTIN, Texas | By Alan Baldwin Formula One - F1 - United States Grand Prix 2015 - Circuit of the Americas, Austin, Texas, United States of America - 25/10/15Mercedes' Lewis Hamilton celebrates winning the race and the world championshipMandatory Credit: Action Images / Hoch ZweiLivepic left 1 of 11 right Formula One - F1 - United States Grand Prix 2015 - Circuit of the Americas, Austin, Texas, United States of America - 25/10/15Mercedes' Lewis Hamilton celebrates winning the race and the world championship with the trophyMandatory Credit: Action Images / Hoch ZweiLivepic left 2 of 11 right Mercedes Formula One driver Lewis Hamilton of Britain leaps off of his car after winning the U.S. F1 Grand Prix at the Circuit of The Americas in Austin, Texas October 25, 2015. Reuters/Adrees Latif 3 of 11 right Formula One - F1 - United States Grand Prix 2015 - Circuit of the Americas, Austin, Texas, United States of America - 25/10/15Mercedes' Lewis Hamilton celebrates winning the race and the world championshipMandatory Credit: Action Images / Hoch ZweiLivepic left 4 of 11 right Third placed finisher Ferrari Formula One driver Sebastian Vettel of Germany speays champagne on race winner Mercedes driver Lewis Hamilton of Britain following the U.S. F1 Grand Prix at the Circuit of The Americas in Austin, Texas October 25, 2015. Reuters/Adrees Latif 5 of 11 right Mercedes Formula One driver Lewis Hamilton of Britain celebrates with his team members after winning the U.S. F1 Grand Prix at the Circuit of The Americas in Austin, Texas October 25, 2015. Reuters/Adrees Latif 6 of 11 right Mercedes Formula One driver Lewis Hamilton of Britain celebrates after winning the U.S. F1 Grand Prix as teammate Nico Rosberg of Germany applauds at the Circuit of The Americas in Austin, Texas October 25, 2015. Reuters/Adrees Latif 7 of 11 right Mercedes Formula One driver Lewis Hamilton of Britain celebrates after winning the U.S. F1 Grand Prix at the Circuit of The Americas in Austin, Texas October 25, 2015. Reuters/Adrees Latif 8 of 11 right Mercedes Formula One driver Lewis Hamilton of Britain throws his trophy in the air as he celebrates after winning the U.S. F1 Grand Prix as teammate and second placed finisher Nico Rosberg of Germany (L) and third placed finisher Ferrari driver Sebastian Vettel of Germany... Reuters/Adrees Latif 9 of 11 right Mercedes Formula One driver Lewis Hamilton of Britain sprays champagne as he celebrates after winning the U.S. F1 Grand Prix at the Circuit of The Americas in Austin, Texas October 25, 2015. Reuters/Adrees Latif 10 of 11 right Mercedes Formula One driver Lewis Hamilton of Britain races ahead of team mate Nico Rosberg of Germany during the U.S. F1 Grand Prix at the Circuit of The Americas in Austin, Texas, October 25, 2015. Reuters/Mike Stone 11 of 11 right \nAUSTIN, Texas Lewis Hamilton joined the elite group of triple Formula One world champions on Sunday after winning a thrilling U.S. Grand Prix that kept the crowd on tenterhooks right to the very end. \n\"That's the greatest moment of my life,\" he gasped over the team radio, choking back the tears, after crossing the line 2.8 seconds ahead of German team mate Nico Rosberg who had led before a late mistake. \nThe first British driver to win back-to-back titles, Hamilton realised a lifelong ambition to equal the tally of his boyhood idol Ayrton Senna, the Brazilian triple champion who died in 1994. \nFerrari's four-times champion Sebastian Vettel finished third, after starting 13th and fighting back to chase Rosberg nose-to-tail over the final lap with the crowd on the edge of their seats on a cold and blustery afternoon after morning rain. \nHad Vettel passed Rosberg, the celebrations for the 'double double' -- with Mercedes retaining their constructors' title two weeks ago in Russia -- would have remained on hold. \n\"I'm just overwhelmed,\" said Hamilton, who had needed to beat Vettel by nine points and Rosberg by two to take the crown with three races to spare. \n\"There were so many times when I thought I had lost the race.\" \nInterviewed on the podium by pop's very own 'rocket man', British pop singer Elton John, Hamilton sprayed the champagne with abandon while Rosberg looked shellshocked and barely reacted. \nREALLY TOUGH \nBefore the podium ceremony, Hamilton tossed his team mate a cap to wear. The German threw it back in disgust. No words were necessary. \n\"I don't know what happened,\" he said later when asked about his slip. \"It was my race to win, but with some strange mistake that has never happened to me that was really disappointing. \n\"It's unbelievable. That was really, really tough at the time, to lose the win.\" \nThe victory, on a rollercoaster afternoon of enthralling racing, was Hamilton's third in four grands prix held in Austin and made the 30-year-old the first driver to win 10 or more races in successive seasons. \nHe was also only the second Briton since Jackie Stewart in 1973 to win three titles. \nBut for much of the race, on a drying track after torrential rain forced qualifying to be postponed from Saturday to Sunday morning, it had looked as if Hamilton would be kept waiting to realise his dream. \nHe had seized the lead at the start from second place on the grid, banging wheels with Rosberg at the first corner and forcing his team mate wide and down to fourth place. \nHamilton could not pull away from the chasing Red Bulls however, with Australian Daniel Ricciardo taking the lead with 15 laps gone and before drivers pitted from intermediate to slick tyres. \nThe Briton then dropped down to fourth place, with Rosberg back in the lead after 22 laps following the pitstops, but the first of two safety car deployments brought everything back into play. \nRosberg was heading for victory when, seven laps from the end, he made an unforced error, ran wide at turn 12, and Hamilton -- on fresher tyres after a later pitstop -- seized his opportunity. \nRicciardo had dropped back by then after colliding with the Force India of Nico Hulkenberg on a rare afternoon of mayhem with just 12 finishers. \nOne of them was American Alexander Rossi, the first home driver to compete in a U.S. Grand Prix since 2007, in last place for Manor Marussia. \nThere was also early carnage when the two Saubers collided in the Swiss team's 400th race while the Williams of Felipe Massa spun after a coming together with Fernando Alonso's McLaren. \nRussian Daniil Kvyat, who had also challenged for the lead in the early stages, brought out the crucial second safety car when he lost control and slewed across the track and into the barriers on the 43rd lap. \nThat gave Hamilton the chance to close right up and pounce when Rosberg erred. \nDutch teenage rookie Max Verstappen was fourth for Toro Rosso after a lively battle against both Ferrari drivers and Mexican Sergio Perez, whose country returns to the calendar for the first time in 23 years next weekend, was fifth for Force India. \nBritain's Jenson Button produced some much-needed points for McLaren in sixth. \n(Reporting by Alan Baldwin, editing by Martyn Herman) \nOur top news photography from this week. Slideshow Trending On Reuters", "external_links": [], "published": "2015-10-26T09:20:00.000+02:00", "crawled": "2015-10-26T09:49:06.256+02:00", "highlightTitle": ""}