{"organizations": [], "uuid": "b9efce1b39d64dff85c43ccf9e5c64da4b5952da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reporterherald.com", "main_image": "http://extras.mnginteractive.com/live/media/site47/2015/1014/20151014__15rhseaglesw~1.jpg", "site_section": "http://feeds.reporterherald.com/mngi/rss/CustomRssServlet/47/244119.xml", "section_title": "Sports", "url": "http://www.reporterherald.com/sports/ci_28971155/moment-has-come-colorado-eagles?source=rss", "country": "IL", "title": "The moment has come for the Colorado Eagles", "performance_score": 0, "site": "reporterherald.com", "participants_count": 1, "title_full": "The moment has come for the Colorado Eagles", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T04:30:00.000+03:00", "replies_count": 0, "uuid": "b9efce1b39d64dff85c43ccf9e5c64da4b5952da"}, "author": "Cris Tiller \n\nReporter-Herald Sports Writer", "url": "http://www.reporterherald.com/sports/ci_28971155/moment-has-come-colorado-eagles?source=rss", "ord_in_thread": 0, "title": "The moment has come for the Colorado Eagles", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The moment has come for the Colorado Eagles ECHL team kicks off season Friday at home By Cris Tiller \nReporter-Herald Sports Writer Posted: 10/14/2015 07:29:30 PM MDT Jordan Kwas, middle, fights through the defense of teammate Jake Marto, left, in front of goalie Joacob DeSerrers during practice on Monday ahead of the team's season opener on Friday. ( Jenny Sparks / Loveland Reporter-Herald ) \nThere's no time left. \nMonths of preparation have flown by and the moment's come to see just what fruit all the work might produce. \nThe Colorado Eagles put together a collection of players they feel are the ones to take the organization back to championship-caliber hockey and were given a couple weeks to mesh that talent toward a common goal, but there's only one way to see if it works. \nColorado opens its season Friday against Utah (7 p.m.) in the friendly confines of the Budweiser Events Center hoping two weeks of training camp, and a pair of preseason contests, were enough to come out of the gates quick. \n\"There's nothing more exciting than the start of the season. Everyone put in a lot of work this offseason, a lot of work in camp, so everyone's champing at the bit to get going,\" Eagles captain Trent Daavettila said. \"When you look who we have back, a lot of guys from last year and a lot of guys from two or three years ago, so we have a good blend of people that have been around the Eagles and it should make for a good start to the season.\" \nStarting the season strong is a top priority for the Eagles with five of their first eight games coming at home. Winning these games early in the season is a nice way to build up points and somewhat of a cushion when lulls inevitably happen throughout the course of a seven-month campaign. Advertisement \nTeam chemistry and a familiarity of players who've spent time with one another in some capacity over the past three seasons are areas the players point toward as a leg up on the competition at the start. \nWhile opponents are still finding themselves, the Eagles believe they can take advantage with an already gelling group. Much of the club's cohesions stems from a focus in camp on team building exercises and plenty of time spent with one another. \n\"I think at the start of the season it pays off in huge dividends. A lot of teams might take a couple weeks to gel together, but over the last two weeks we've pretty much spent every waking hour together,\" defenseman Collin Bowman said. \"At the start of the year, everyone knows each other, can keep other accountable and have a lot of fun together. \n\"When you have a group that knows each other as well as we do, and everybody's healthy to start the season, those are points you can pick up and they count just the same as at the end. So if you run into injury trouble later on, these (early) points can give you a cushion when you have struggles in the middle of a season like you're going to. It's important to get the wins and win quickly.\" \nColorado proved in its two preseason games against Rapid City that it is a team primed to fire on all cylinders from the outset, with a pair of wins by a combined score of 8-3, with most of those goals surrendered coming in what Daavettila called a \"little hiccup\" late in the second game. \nThe blue line contributed in the offensive zone, which can make a large impact throughout a season, while three goaltenders (Jacob DeSerres, Tyler Bunz and Kris Lazaruk) all showed a strong presence in the crease. \nThe Eagles picked a key piece up late in camp with the signing of Collin Bowman's brother, Drayson, a veteran of six NHL season (180 games) who can provide a bonafide scoring threat and another element of speed. \n\"I'm happy with the development of our team as it sits right now. I think we've come a long way since Day 1 of camp to where we are today,\" Colorado coach Chris Stewart said. \"I think we're moving the puck well, and the upside really is the fact that if you've got everybody on the same page early, it's gonna help get you some wins. Winning is confidence and winning helps further develop that chemistry all the way throughout.\"", "external_links": [], "published": "2015-10-15T04:30:00.000+03:00", "crawled": "2015-10-15T05:50:40.211+03:00", "highlightTitle": ""}