{"organizations": [], "uuid": "8c681ae2c67acef3eec8d37290dbcf3ddc84b5da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pe.com", "main_image": "http://images.onset.freedom.com/pressenterprise/thumb/nvryom-pesperrisshoot100500320071015.jpg", "site_section": "http://www.pe.com/", "section_title": "Press Enterprise : Riverside County California News, Sports and Entertainment", "url": "http://www.pe.com/articles/made-782513-sheriff-shooting.html", "country": "US", "title": "PERRIS: Investigation continues into fatal shooting by security guard", "performance_score": 0, "site": "pe.com", "participants_count": 4, "title_full": "PERRIS: Investigation continues into fatal shooting by security guard - Press Enterprise", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T03:00:00.000+03:00", "replies_count": 3, "uuid": "240fe23f9f1359f8a74afd4e0df972c036f3ae19"}, "author": "ALEX GROVES", "url": "http://www.pe.com/articles/made-782513-sheriff-shooting.html#post-0", "ord_in_thread": 0, "title": "PERRIS: Investigation continues into fatal shooting by security guard", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BY ALEX GROVES / STAFF WRITER\nPublished: Oct. 4, 2015 Updated: Oct. 5, 2015 7:28 p.m. Two days after a man was fatally shot by a security guard at a Perris apartment complex, the shooting remained under investigation and residents were still trying to understand how and why it happened.\nRiverside County sheriff’s Deputy Armando Munoz said Monday, Oct. 5, that he could release no additional details, including whether anyone had been arrested, in Saturday’s fatal shooting of Isaac Jermaine Kelly , 33.\nMany residents of the Meadowview II apartment complex said both Kelly and the security guard were well-liked and easy-going people.\n“(Kelly) didn’t get an attitude, he didn’t have a temper, he wasn’t an angry person,” resident Jessie Key said. “He was just a friendly, ordinary tenant.”\nAlbert Gallo, who lives across from Key, described Kelly as a quiet, hard-working man. Gallo said Kelly would frequently offer to help carry in his wife’s groceries.\nBut Gallo said the guard was equally amiable.\n“We’ve never had a problem with him,” Gallo said. “We would have festivities and other security guards would shut it down, but this guy was always nice.”\nKelly was fatally shot just after midnight Saturday by a security guard hired by the apartment complex at 150 E. Nuevo Road. Residents said Kelly was walking to get his mail. Sheriff’s officials have not released any details about what led up to the shooting.\nKelly was taken to the hospital, where he was pronounced dead. The sheriff’s homicide unit is investigating the shooting.\nAn employee who answered the phone at the apartment complex’s on-site management office Monday morning said a manager would be present later in the day. Subsequent calls seeking comment were not returned, and a sign was posted saying the office was closed until Tuesday.\nThe apartment complex is owned by Irvine-based Reiner Communities, a company that offers affordable housing in California. Multiple phone messages left Monday were not returned.\nContact the writer: agroves@pe.com or @AlexDGroves on Twitter.", "external_links": ["https://twitter.com/alexdgroves"], "published": "2015-10-04T03:00:00.000+03:00", "crawled": "2015-10-06T18:22:34.275+03:00", "highlightTitle": ""}