{"organizations": [], "uuid": "8f8df2760604d11be83c2434b20acea125a593be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.philly.com", "main_image": "http://media.philly.com/images/sjoey17z-1200.jpg", "site_section": "http://www.philly.com/philly_sports.rss", "section_title": "Philly.com Sports", "url": "http://www.philly.com/r?19=961&43=168426&44=333377621&32=3796&7=195227&40=http%3A%2F%2Fwww.philly.com%2Fphilly%2Fsports%2Fhigh_school%2Fpennsylvania%2F20151017_Gorman_a_powerful_witness_for_Chiari_awareness.html", "country": "US", "title": "Gorman a powerful witness for Chiari awareness", "performance_score": 0, "site": "philly.com", "participants_count": 0, "title_full": "Gorman a powerful witness for Chiari awareness", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T03:07:00.000+03:00", "replies_count": 0, "uuid": "8f8df2760604d11be83c2434b20acea125a593be"}, "author": "", "url": "http://www.philly.com/r?19=961&43=168426&44=333377621&32=3796&7=195227&40=http%3A%2F%2Fwww.philly.com%2Fphilly%2Fsports%2Fhigh_school%2Fpennsylvania%2F20151017_Gorman_a_powerful_witness_for_Chiari_awareness.html", "ord_in_thread": 0, "title": "Gorman a powerful witness for Chiari awareness", "locations": ["Southeastern Pa."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Gorman"], "text": "More coverage: Southeastern Pa. high school sports \n\"A hobby is coin collecting,\" said Gorman, who was diagnosed with Chiari malformation, or CM, at 12. \"Baseball is life. It's a game, not a hobby.\" \nSeated in the visitor's dugout at St. Joseph's this week, the former Neumann-Goretti pitching standout, who has had two brain surgeries in the past three years, struggled to recall the number of procedures he's undergone. \n\"That's a shame when you can't remember how many surgeries you've had,\" Gorman said, smiling. \"I think I'm first-team All-American in surgeries.\" \nThe nearly eight-inch scar that runs from the back of his head down to his neck peeked from under his Hawks hat. \nGorman's love for baseball and passion for spreading Chiari awareness collide Saturday when the Hawks baseball and softball teams host \"Chiari Day.\" \nThe baseball team faces Penn at 11 a.m., and the softball team plays Seton Hall at noon. Gorman will throw out ceremonial first pitches at both games. \nEach team will wear purple jerseys, the color associated with the fight against CM, a structural defect in the cerebellum that can cause severe problems with balance and coordination \nGorman said head coach Fritz Hamburg recently surprised him with news of the \"Chiari Day.\" \n\"I think everybody understands that Joey brings a presence to the team and is every bit a part of the team as anybody who wears the uniform,\" Hamburg said. \nHamburg said softball coach Terri Adams brought the idea to his attention. \nLast season, Gorman returned to the field for the first time since Neumann-Goretti. He played first base and appeared in nine contests and went 4 for 12 at the plate. \nUnbeknownst to his teammates, Gorman played with avascular necrosis - the death of bone tissue in his left, throwing shoulder due to a lack of blood supply. \nFollowing his second brain surgery in May of 2013, Gorman developed aseptic meningitis, which required heavy doses of steroids, and led to the restriction of blood flow to his shoulder. He has had seven surgeries. \nLast June, instead of having a metal plate replace the dead bone and effectively end his baseball career, Gorman opted to have bone and cartilage from his knee grafted to his shoulder. \n\"That was the first time in my life that someone told me baseball could be done,\" he said. \"Two brain surgeries, and I never once thought to myself that I'd never play baseball again.\" \nAbout two weeks ago, Gorman was cleared to toss and take infield practice with the team. \nHe won't play on Saturday, but Chiari families who learned of Gorman after his story aired in May on a local television station, hope to be in attendance. \n\"He's a very modest person,\" said Felicia Hackman, who has four children with Chiari, \"but I don't think he realizes the impact he's having on children with Chiari. I can at least speak for my four.\" \nHackman, a Warminster resident, said her son, Gabriel, 12, quit CYO baseball last spring because of severe headaches, a symptom of Chiari. \n\"After meeting Joey, Gabriel made the comment that he wants to try and go back to it,\" she said. \nTricia DeMeester, 37, is also recovering from Chiari surgery. The Perkasie resident was diagnosed at 16 after years of persistent headaches. Her symptoms were exacerbated four years ago after she gave birth to twins. She saw Gorman's story and reached out to him via Facebook. \nOn Oct. 2, DeMeester had brain surgery at Jefferson after a recommendation from Gorman. \nThe outcome will take time, but for now, DeMeester reports, \"so far, so good.\" \n\"I feel like if I didn't reach out to Joey I would have never found this doctor,\" she said, \"and I still would have been on this endless search because there's not many doctors in our area that know enough about Chiari malformation.\" \nGorman made and distributed shirts and purple wristbands printed with \"Losing is not an option,\" and \"Conquer Chiari.\" He was a guest in the Washington Nationals clubhouse at a September Phillies game. Several members of the Nationals wore his purple wristband. \nThe South Philadelphia resident is still just a college student struggling with his own battle, but he hopes to start a Chiari foundation someday. \nFor now, he's doing what he can. \n\"If other people out there who have it are not being heard, then maybe I should be a voice,\" he said. \"It's got to start somewhere.\"", "external_links": [], "published": "2015-10-17T03:07:00.000+03:00", "crawled": "2015-10-17T05:14:30.015+03:00", "highlightTitle": ""}