{"organizations": [], "uuid": "27d4127add91e838fbe7a7036be49bff1b14c83e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "cherokeetribune.com", "main_image": "http://matchbin-assets.s3.amazonaws.com/public/sites/625/thumbs/8KDO_Niagel_Catch.jpg", "site_section": "http://cherokeetribune.com/rss/rss/Sports?instance=Sports&content_type=article&tags=sports&tag_inclusion=or&offset=0&limit=10&page_name=rss", "section_title": "Sports", "url": "http://cherokeetribune.com/bookmark/26914383", "country": "US", "title": "Eagles roll over Cumberland", "performance_score": 0, "site": "cherokeetribune.com", "participants_count": 1, "title_full": "Eagles roll over Cumberland", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T08:14:00.000+03:00", "replies_count": 0, "uuid": "27d4127add91e838fbe7a7036be49bff1b14c83e"}, "author": "Alex Resnak aresnak@cherokeetribune.com (noreply@cherokeetribune.com)", "url": "http://cherokeetribune.com/bookmark/26914383", "ord_in_thread": 0, "title": "Eagles roll over Cumberland", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "October 18, 2015 12:14 AM | 223 views | 0 | 0 | | Reinhardt’s Niagel Curtis makes a catch and begins to turn upfield in the Eagles’ 52-18 win over Cumberland on Saturday. slideshow No. 8 Reinhardt kept its perfect season alive with a 52-18 win at Cumberland on Saturday.The Eagles (7-0, 2-0 in Mid-South Conference West Division) did not even need to mount a big comeback this week, as they took the lead for good just over 5 minutes into the game.“I think we beat a pretty good football team,” Reinhardt coach Drew Cronic said. “I have a lot of respect for Cumberland. They have good, tough kids, they play hard and they’re very sound. The only time I was disappointed in us was in the third quarter, when we had a little bit of a lull, but we were able to finish strong at the end. I think the kids did a good job.”Reinhardt got out to an early lead when Javier Dyer sacked Cumberland quarterback Justin Snyder and forced a fumble on Cumberland’s opening possession. That fumble was recovered by Devante Wynn and returned 30 yards inside the Cumberland one yard line, resulting in a Deonte Dennis touchdown run on the ensuing play.Big plays would be a theme for the Eagles’ defense all game. Nick Johnson intercepted a pass on a Cumberland two-point conversion and returned it 98 yards for two points when the teams were separated by just 10 points in the fourth quarter, and Juice Arnold returned an interception 24 yards for a score just 10 minutes later to push the score to 52-18. Cumberland (3-4, 0-1) was averaging 32.5 points per game entering this matchup and was coming off a win in which it scored 54 points, but the Reinhardt defense held Cumberland well short of those marks.Led by Marcus Miller and Jacob Gross, who each recorded 12 tackles, the Eagles held the Bulldogs’ dynamic rushing attack to 155 yards on 3.1 yards per carry.“That was a very tough offense to defend,” Cronic said. “They do a good job, they block well and their quarterback can do some good things. I thought we handled all the different things they do real well, so I was pleased. Anytime you hold somebody under 20 points, you’re playing really good defense, and we were able to do that today against a quality opponent.”After turning to quarterback Ryan Thompson to win last week, Reinhardt got back to its identity and had 10 different players carry the ball for a combined 405 yards on 6.9 yards per carry. L.J. Stegall and Sam Jones were the Eagles’ leading rushers with 111 yards and a touchdown and 98 yards and a touchdown respectively. Niagel Curtis also contributed with 74 yards and a score on 13 carries.When the Eagles did have to pass, Thompson played well again, completing 10 of 15 passes for 161 yards and a score. “That’s who we are,” Cronic said. “We just have to get those guys the ball in space. Our playmakers played well, and we blocked well. We were able to move the ball around to different guys, which is usually what we do. We get the ball to as many playmakers as we can, and they all looked pretty good (Saturday).”Reinhardt’s win, combined with No. 1 Lindsey Wilson’s 24-19 win over Faulkner, sets up a game between two undefeated, top-10 teams on Saturday at Ken White Field in Waleska.", "external_links": [], "published": "2015-10-18T08:14:00.000+03:00", "crawled": "2015-10-18T14:13:32.684+03:00", "highlightTitle": ""}