{"organizations": ["Maple Leafs"], "uuid": "49c7e9c5edff252f2c9272108922f6f9faf91c04", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.torontosun.com", "main_image": "http://storage.torontosun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297745095878_LARGE_BOX.jpg?quality=80&stmp=1445488272251&size=100x", "site_section": "http://www.torontosun.com/sports/rss.xml", "section_title": "Top Sports stories", "url": "http://www.torontosun.com/2015/10/21/maple-leafs-coach-mike-babcock-still-trying-to-get-familar-with-new-home", "country": "CA", "title": "Maple Leafs coach Mike Babcock still trying to get familar with new home", "performance_score": 0, "site": "torontosun.com", "participants_count": 0, "title_full": "Maple Leafs coach Mike Babcock still trying to get familar with new home", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T06:52:00.000+03:00", "replies_count": 0, "uuid": "49c7e9c5edff252f2c9272108922f6f9faf91c04"}, "author": "", "url": "http://www.torontosun.com/2015/10/21/maple-leafs-coach-mike-babcock-still-trying-to-get-familar-with-new-home", "ord_in_thread": 0, "title": "Maple Leafs coach Mike Babcock still trying to get familar with new home", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mike Babcock"], "text": "Mike Babcock often starts scrums with reporters with one word: “Hello.” \n\nWhere it goes from there usually depends on the Maple Leafs head coach’s mood. \nOn Wednesday following the morning skate, Babcock stopped on his way to the gathering of reporters and had a quick chat with Buffalo Sabres coach Dan Bylsma. \nThe first question to Babcock was about Bylsma, as the two have known each other since Babcock coached Bylsma with Anaheim more than a decade ago. \nThe second question to Babcock was Bylsma-related, to which Babcock said: “I thought we were here to talk about the Leafs, weren’t we?” \nFine. Where is Jake Gardiner, who was not on the ice for the morning skate? \n“He’s at home because he is injured,” Babcock said. “I don’t know how serious it is. Day to day, that usually means 10. I don’t know the answers for any of that.” \nRight. \nBabcock is intense, but he’s not a robot. Later, a reporter wondered what the biggest challenge is in starting as a coach in a new city. \n“Finding a good restaurant, finding a place to get your hair cut, figuring out how to get back and forth through traffic when you don’t really know the city,” Babcock said. “Getting some furniture. If you buy it on your own, your wife kicks you out of the house. If you don’t buy it on your own, your wife orders special stuff and it takes long and you don’t have no furniture. You know, stuff like that.” \nFRANSON FRETTED \nCody Franson is in a good place, but couldn’t have said as much during the summer. \nThought to be a fairly attractive piece on the free-agent market, Franson didn’t sign until Sept. 10, when he put his signature on a two-year deal with the Sabres. \n“It was a little stressful, there is no way around that,” the former Leaf said. “I had hoped to have something done in the first week and relax for the summer. “We had a lot of interest, but a lot of teams were tight with cap space so they were trying to make things work. It made for a little bit of a lengthy process.” \nLeafs defenceman Morgan Rielly is among Franson’s pals and the two talked several times about Franson’s work search. \n“I’m happy he got it done, and I will be happy if he is a minus player and we beat him, even though he is a good friend of mine,” Rielly said. “He is over there probably licking his chops, hoping he can burn us one way or another.” \nLOOSE LEAFS \nBylsma on what he expected from Babcock: “Other than the scowl? A lot better hair than me ... it’s maybe a process right now he is in with the Leafs, but he is preaching the offensive zone come hell or high water. That’s what he is going to grind into his team and that’s what he is going to get. That scowl is more the way his team is going to play than it is him.” ... Had Babcock taken the head coaching job with the Sabres, Steve Spott would have been one of his assistant coaches. Instead, Babcock goes to the team that had fired Spott, who then mulled an offer from best friend Peter DeBoer to join the coaching staff of the San Jose Sharks for much of the summer before accepting ... Mitch Marner will play for the OHL side on Nov. 16 in Windsor in the Canada-Russia Series, part of the preparation for the world junior championship each winter. Fellow Leafs pick Travis Dermott will suit up for the OHL on Nov. 12 in Owen Sound. Marner should be a catalyst on offence for Canada in the tournament in Helsinki starting on Dec. 26, while Dermott will be involved in a battle for a spot on the blue line. Sponsored Links", "external_links": [], "published": "2015-10-22T06:52:00.000+03:00", "crawled": "2015-10-22T12:43:29.209+03:00", "highlightTitle": ""}