{"organizations": [], "uuid": "7a0460014d28aa72fc16995b83f04f69db0ae4c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.torontosun.com", "main_image": "http://storage.torontosun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297756148762_LARGE_BOX.jpg?quality=80&stmp=1443915681969&size=100x", "site_section": "http://www.torontosun.com/sports/mma", "section_title": "Mixed Martial Arts | Sports | Toronto Sun", "url": "http://www.torontosun.com/2015/10/03/blue-jays-david-price-wants-to-break-cycle-of-playoff-losses", "country": "CA", "title": "Blue Jays' David Price wants to break cycle of playoff losses | SIMMONS | Baseba", "performance_score": 0, "site": "torontosun.com", "participants_count": 1, "title_full": "Blue Jays' David Price wants to break cycle of playoff losses | SIMMONS | Baseba", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T06:32:00.000+03:00", "replies_count": 0, "uuid": "7a0460014d28aa72fc16995b83f04f69db0ae4c4"}, "author": "torontosun.com", "url": "http://www.torontosun.com/2015/10/03/blue-jays-david-price-wants-to-break-cycle-of-playoff-losses", "ord_in_thread": 0, "title": "Blue Jays' David Price wants to break cycle of playoff losses | SIMMONS | Baseba", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "TORONTO - David Price knows the numbers — in his own words — “better than you do.”\nHe has lived them, studied them, tried to understand why it is he has had so much success as a starting pitcher in the big leagues and so little success in the post-season.\nHe has been a straight line for seven seasons. Successful. Dependable. Consistent. An American League version of Clayton Kershaw. With a Kershaw curse of sorts.\nAnd now both have a chance to bury the past. But only one matters here.\nPrice has made five playoff starts in his career, hasn’t won one of them, neither has his team. His starter’s earned run average is 4.98. His career era is 3.09. His ERA with the Blue Jays is 2.30.\nOnly his previous playoff start, eight innings against the Orioles last October, seemed Price-like. Now he starts again Thursday.\nThe 11 days off between starts was part John Gibbons in design, but with a lot of input from Price. He wants to break the cycle. He needs to do that — for himself and for the Blue Jays.\nTHIS AND THAT\nShould this concern the Jays? MVP candidate Josh Donaldson did not hit a home run or knock in a single run in 46 post-season at bats in Oakland. He had just one extra base hit. He batted just .233 with an OPS of .538 ... In Mark Buehrle’s three seasons in Toronto, the Blue Jays finished last, third and first. The team changed. He never did. He made 96 starts for the Jays, pitching more than 600 innings. Of the 96 starts, the Jays won 58 of those games — or played at .604 ball, 98-win pace for an entire season. He was the big victory of the Blue Jays winter that wasn’t two years ago. When Buehrle left the mound Friday night in Tampa, maybe for the last time in his career, the preponderance of hugs and congratulations in the dugout were heartfelt and very much deserved ... Inside the Blue Jays clubhouse, there was surprising sympathy for Jonathan Papelbon after the attack on Bryce Harper. Many thought Harper had it coming. Just not necessarily around the throat ... When Papelbon went for the throat, he was suspended by the Washington Nationals and widely criticized. When Mark Messier would do that inside an NHL locker room, it was called leadership and greatly applauded ... Has Matt Williams been fired yet? ... It can’t be a coincidence that Russell Martin made the playoffs in his first season in Los Angeles, Pittsburgh and Toronto when the teams weren’t contenders the year before. In the case of the Pirates and Blue Jays, it was decades between playoff appearances. Martin has been in the playoffs seven of his 10 major league seasons and this is the sixth time in the past seven seasons he’s going to the playoffs.\nHEAR AND THERE\nThe newest whisper term around the Maple Leafs: Bab-clock. That describes the amount of time Mike Babcock sets out for the media each day and how long he’s willing to hang in for post-practice and post-game interviews. The Bab-clock is a work in progress. Apparently, the time changes day to day and is based on the quality of the questions asked and whether he’s gone for his daily run or not ... Do you get the feeling Randy Carlyle and Ron Wilson are watching the Leafs from afar and thinking: Been there, done that, never got paid like that ... By the way, memo to those who talk about Babcock winning Olympic gold medals. Coaches aren’t awarded Olympic medals in any sport. There is a distinction at the Games. He coached gold medal-winning teams. The gold went to the players ... Before the miracle trade that sent David Clarkson to Columbus in exchange for the injured Nathan Horton, the Leafs thought they had a similar deal with Lou Lamoriello, with Ryan Clowe being the injured subject ... David Booth is wrong: The NHL isn’t wiping out the middle class. It is wiping out the middle class who can’t really play anymore .... Why I rarely pay attention to the result of pre-season games. When I covered the Calgary Flames, a guy like Dan Labraaten would lead the team in scoring in pre-season. In my early years around the Leafs, it was usually Mike Craig. Then the season would begin, Craig would go to the press box, and life would return to normal ... Shouldn’t Joel Quenneville be the first choice to coach Team Canada at next year’s World Cup?\nSCENE AND HEARD\nIf old, smilin’ Henry Burris didn’t bring a wide one to your face Thursday night, you’re either not breathing or you’re a Montreal Alouettes fan. When a 40-year-old throws for 500 yards, a record number of completions and then runs for two touchdowns, just for show, well, that you have to admire ... Aaron Rodgers didn’t like it when his backup quarterback, Scott Tolzien, compared him to Michael Jordan “in his prime.” For his part, Rodgers said he wasn’t worthy. Better question is: How soon before he can be compared with John Elway, Dan Marino and the members of that club? ... The question on Alex Debrincat, twice passed over in the OHL Draft, was: How would he score without Connor McDavid as his centre? The answer so far: Very well. The one-time unknown Debrincat has six goals in his first two OHL games in Erie. This is his draft year ... Why so little noise about Steve Kerr not being physically ready to coach the champion Golden State Warriors? Or is that team so good that Lenny Wilkens could coach it and win? ... Will McDavid make the playoffs in his first season in Edmonton? Wayne Gretzky did. But you know who didn’t? Mario Lemieux and Sidney Crosby in Pittsburgh. Steven Stamkos in Tampa Bay. John Tavares in New York.\nAND ANOTHER THING\nDavid Braley is nobody’s fool. He has sold the Argos, but has maintained a stake in future Grey Cup’s in Toronto. So if you do the math, Braley had the Grey Cup in Vancouver in 2011, in Toronto in 2012, back in Vancouver in 2014 and part of it back in Toronto next November. That’s four Grey Cups in six years. And who says you can’t make money in the CFL? ... On the final home weekend for the Blue Jays, with the crowd at its most electric, Jose Bautista was asked: “Does this feel like a playoff game, to you?” His answer: “I don’t know. I’ve never been in the playoffs.” ... In 57 post-season at bats, Troy Tulowitzki hit .211 with the Colorado Rockies. He did have six extra base hits, though ... Argos have a dilemma: Ricky Ray’s contract is up. He hasn’t played a down this season. Trevor Harris’ contract is up. He has been OK in his first starting season. Which one do you sign? Odds are you can’t sign both in a CFL short of quarterbacks ... Poor Dwane Casey. He lives in Seattle, had to fly to Toronto for the opening of Raptors camp, only to get on a plane and fly to Vancouver for the actual beginning of Raptors camp. Must admit, I didn’t understand why the Leafs went to Halifax to be gin training camp and don’t understand why the Raptors begin their camp in British Columbia ... My Top 5 NHL Players: 1. Carey Price; 2. Drew Doughty; 3. Duncan Keith; 4. Victor Hedman; 5. Jonathan Toews ... An obscure statistic: the Blue Jays were 10-16 in games Aaron Sanchez, Daniel Norris, Felix Doubront, Scott Copeland, Matt Boyd and Todd Redmond started. If anyone else started, they played at 100-win pace ... Happy birthday to Jimy Williams (72), Justin Williams (34), Micky Ward (50), Vic Hadfield (75), Derrick Rose (27), Tony LaRussa (71), Tom Webster (67) and Mike Sharperson (54) ... And hey, whatever became of Gene Tenace?\nWILL TODAY’S PLAYERS RESONATE IN 60 YEARS?\nToday is Oct. 4 and the baseball playoffs have yet to begin. On Oct. 4, 1955, Johnny Podres pitched a nine-inning shutout to lead the Brooklyn Dodgers over the New York Yankees to win Game 7 of the World Series.\nSixty years have passed since that Subway Series, but so many of the names from that time still resonate in one way or another. That’s the magic of baseball. The Yankees had a lineup that included Mickey Mantle, Yogi Berra, Billy Martin and Phil Rizzuto. The Dodgers batting order had Pee Wee Reese, Duke Snider and Roy Campanella hitting 2-3-4 and down the bottom of the lineup, a 24-year-old rookie at second base, Don Zimmer.\nThe Yankees were managed by Casey Stengel, the Dodgers by Walter Alston: Both men are in the Hall of Fame.\nAnd I wonder if 60 years from now, will names like Joe Maddon, Ned Yost or Mike Matheny matter to anyone at all. Or will player names such as Mike Trout, Josh Donaldson or Albert Pujols be considered warmly nostalgic the way reading a lineup from 1955 seems to be today?\nDUCKS LACK TOP DEFENDER\nA lot of people are picking the Anaheim Ducks to win the Stanley Cup. I am not among them.\nIn my mind, to win a Cup in this era you need an uber-No.1 30-minute defenceman. A difference-maker. A stopper. A game-changer. The Ducks have a terrific team, having won more than 50 games in each of the past two seasons, but they don’t have that bust-out No. 1 blueliner.\nThree-time champion Chicago has Duncan Keith. Two-time champion Los Angeles has Drew Doughty. Boston has Zdeno Chara and won it once. When the Ducks won their only Cup, they had Chris Pronger and Scott Niedermayer. The Red Wings championship teams had Nicklas Lidstrom.\nMy list of Stanley Cup contenders includes Tampa (Victor Hedman), the Blackhawks and Kings, Minnesota (Ryan Suter), St. Louis (Alex Pietrangelo), Nashville (Shea Weber and Roman Josi) and the Rangers (Ryan McDonagh).\nHampus Lindholm is a fine young player, but until proven differently is not one of those elite defenceman. The challenge for the Ducks: finding playoff success without that kind of player.\nPILLAR THE NEW DEVON WHITE\nKevin Pillar couldn’t be more different than Devon White.\nAnd yet so similar in other ways.\nWhite played the outfield with elegance, so often looking like he knew where the ball was going and just loping his way with long strides to meet it, like a brilliant wide receiver running a precision pass pattern, turning, and having the quarterback find him. Few have ever played centre field better than White and almost no one in Toronto has.\nEnter scrap-iron Pillar in his first full big league season. He plays centre field with all the grace of a linebacker. He runs hard after every ball, dives more often and more effectively than Alex Despatie, has made one great catch after another after another in this stunning Blue Jays season. His glove may never be as golden as White’s was seven times over, but this season it has been all gold, as different as they may be playing the same position.\nOddly, the offensive numbers of White in 1993 are quite similar to Pillar’s this season. They seem so much like different players, offensively and defensively, yet they may not be.\nWhite hit 15 home runs and knocked in 52 runs in ’93. Pillar has 12 homers with 56 RBI heading into Saturday’s game. White hit .273, Pillar is batting .275. White stole 34 bases, Pillar has 25.\nThe Blue Jays were blessed with five seasons of Devon White. The first full year of Pillar has you wanting more.\nSponsored Links See All Sponsored Links\nSIMMONS\nBlue Jays' David Price wants to break cycle of playoff losses\nBy Steve Simmons , Toronto Sun First posted: Saturday, October 03, 2015 06:32 PM EDT | Updated: Saturday, October 03, 2015 07:10 PM EDT\nDavid Price knows the numbers — in his own words — “better than you do.”\nHe has lived them, studied them, tried to understand why it is he has had so much success as a starting pitcher in the big leagues and so little success in the post-season.\nHe has been a straight line for seven seasons. Successful. Dependable. Consistent. An American League version of Clayton Kershaw. With a Kershaw curse of sorts.\nAnd now both have a chance to bury the past. But only one matters here.\nPrice has made five playoff starts in his career, hasn’t won one of them, neither has his team. His starter’s earned run average is 4.98. His career era is 3.09. His ERA with the Blue Jays is 2.30.\nOnly his previous playoff start, eight innings against the Orioles last October, seemed Price-like. Now he starts again Thursday.\nThe 11 days off between starts was part John Gibbons in design, but with a lot of input from Price. He wants to break the cycle.\nAbout the author Steve Simmons Steve Simmons's Blog Follow Steve Simmons on Twitter Other Stories Jays couldn't have done it without Beeston, Anthopoulos\nIt was about a year ago, before the pennant race, before there were celebrations of any kind, before the World Series was ever a topic of realistic conversation, that Edward Rogers and friends clumsily determined that Paul Beeston had to go, and by extension Alex Anthopoulos was to follow.\n0\nA Blue Jays season to cherish\nWhat a Jays season - cherish it\n0\nSee more from Steve Simmons »\nTop stories Popular Latest Videos 1 child, 2 adults dead in multi-vehicle collision on Hwy. 401 near Salem Rd.\n0\nBlue Jays release video to rally fans for playoffs\n0\nOregon gunman spared student to take package to authorities\n0\nBlue Jays' David Price wants to break cycle of playoff losses\n0\nToronto FC's not perfect, but progress being made\n0\n1 child, 2 adults dead in multi-vehicle collision on Hwy. 401 near Salem Rd.\n0\nSuspected Mob boss deported to Italy\n0\nDavid Cassidy charged with leaving scene of Florida car crash\n0\nPast time to stop barbaric treatement of women and girls\n0\nBlue Jays' David Price wants to break cycle of playoff losses\n0\nZabi Akbari - Witness To Kirby Rd Fatal Crash\nVaughan crash eyewitness\nDemers on possible Quebec NHL team\nLotto Max winners\nPlenty Of Work Left For Leafs\nMore from Baseball Blue Jays' David Price wants to break cycle of playoff losses 0\nBlue Jays release video to rally fans for playoffs 0\nNationals manager Matt Williams' job on shaky ground after tough season 0\nFormer Mets, Expos star Rusty Staub has heart attack on plane 0\nBaseball Saturday -- Top-5 Toronto Blue Jays moments from regular season 0\nInside Toronto sun.com News\n3 dead in multi-vehicle collision 0", "external_links": ["http://pubads.g.doubleclick.net/gampad/clk?id=183052021&iu=/3081/SMCO_ENUR_TSUN_EN_WEB", "http://blogs.canoe.ca/sportszone/", "http://pubads.g.doubleclick.net/gampad/clk?id=228633661&iu=/3081/SMCO_ENUR_TSUN_EN_WEB", "http://pubads.g.doubleclick.net/gampad/clk?id=182027221&iu=/3081/SMCO_ENUR_TSUN_EN_WEB", "http://twitter.com/@simmonssteve", "http://pubads.g.doubleclick.net/gampad/clk?id=182024221&iu=/3081/SMCO_ENUR_TSUN_EN_WEB"], "published": "2015-10-04T06:32:00.000+03:00", "crawled": "2015-10-04T03:38:09.770+03:00", "highlightTitle": ""}