{"organizations": ["Manchester United", "Arsenal"], "uuid": "ae33a06c56f272d349ceffc9b540ceba4622d8f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.cntv.cn", "main_image": "", "site_section": "http://english.cntv.cn/service/rss/13/index.xml", "section_title": "CCTV.com - Sports Video", "url": "http://english.cntv.cn/2015/10/05/VIDE1444021442311668.shtml", "country": "US", "title": "English Premier League: Manchester United loses to Arsenal 0-3", "performance_score": 0, "site": "cntv.cn", "participants_count": 0, "title_full": "English Premier League: Manchester United loses to Arsenal 0-3", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T08:07:00.000+03:00", "replies_count": 0, "uuid": "ae33a06c56f272d349ceffc9b540ceba4622d8f6"}, "author": "", "url": "http://english.cntv.cn/2015/10/05/VIDE1444021442311668.shtml", "ord_in_thread": 0, "title": "English Premier League: Manchester United loses to Arsenal 0-3", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "English Premier League: Manchester United loses to Arsenal 0-3 \n  \nAt the English Premier League, Arsenal staged an amazing bounce-back at the Emirates, just five days after a devastating 3-2 loss to Olympiakos in the UEFA Champions League. Arsene Wenger's men showcased their title credentials by ravaging Manchester United on Sunday. Santi Cazorla of Arsenal (R) vies for the ball with Wayne Rooney of Manchester United during the 8th round match at English Premier League, Oct. 4, 2015. Arsenal won 3-0. (Photo: Xinhua/AFP) \nThe Gunners stunned Louis van Gaal's side by scoring three times in the first 20 minutes. \nFirst in the sixth-minute, Alexis Sanchez scored with a back-heel. Amazing show from the Chilean! \nJust one minute later, Mesut Ozil slotted home from Theo Walcott's cut-back. It's 2-nil Arsenal! \nCheck it out again! Precise pass from Walcott, and David de Gea was totally stunned! \nSanchez's 18-yard thunderbolt would complete the scoring in the 19th minute at a giddy Emirates. Sanchez has now scored six goals in three games! \nDefinitely worth watching again! The four defenders look like wood in front of white-hot Sanchez! \nThe 3-0 victory raised Wenger's side into second place in the Premier League on goal difference. \nReds won 1 of last 9 games inside 90 minutes \nAlso on Sunday, Liverpool sacked manager Brendan Rodgers following a 1-1 draw with Everton. \nDanny Ings put Liverpool ahead in the 41st minute when he was left unmarked inside the six-yard box and nodded home James Milner's corner. \nThe third goal in five games for Ings. But untidy defending deprived Liverpool the win. At the end of first half, Emre Can's attempted clearance cannons against team-mate Martin Skrtel. Romelu Lukaku slamming home to tie the score. \nThe 225th Merseyside derby turned ill-tempered occasionally, but that has nothing to do with Rogers now. \nJust minutes before being sacked, the 42-year-old appears to have little idea about his fate and claims to be under no pressure in the job. \n\"The first point is: I don't feel any pressure whatsoever. I can honestly say that. And you guys have seen me now for a while. I think there is pressure to sell newspapers. I think there is pressure to make stories in the media, and I understand and respect that because that is your lives, and it is your jobs. For me, my job is to worry about the team. And that is the only pressure that I will ever, ever feel,\" said Bredan Rodgers, Liverpool manager. \nIn the standings, Manchester City is in first place with 18 points, Arsenal are up to second on 16, followed by Manchester United, Crystal Palace, and Leiscester. Tottenham is eighth after a 2-2 draw with Swansea on Sunday. Liverpool is tenth with 12 points and defending champions Chelsea are way down in 16th place. Related Videos", "external_links": [], "published": "2015-10-05T08:07:00.000+03:00", "crawled": "2015-10-05T13:21:08.784+03:00", "highlightTitle": ""}