{"organizations": [], "uuid": "1b91295e142eb53655ec45a1a310c3b5d743e6d1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "nmpreps.rivals.com", "main_image": "", "site_section": "http://www.rivals.com/rss2feed.asp?type=HS&state=NM", "section_title": "New Mexico High School Sports Headlines", "url": "https://nmpreps.rivals.com/content.asp?CID=1817386", "country": "US", "title": "Top 50 Volleyball Players", "performance_score": 0, "site": "rivals.com", "participants_count": 0, "title_full": "Top 50 Volleyball Players", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T12:26:00.000+03:00", "replies_count": 0, "uuid": "1b91295e142eb53655ec45a1a310c3b5d743e6d1"}, "author": "", "url": "https://nmpreps.rivals.com/content.asp?CID=1817386", "ord_in_thread": 0, "title": "Top 50 Volleyball Players", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Joshua J. Grine"], "text": "Joshua J. Grine NMPreps.com Editor \nToday, NMPreps.com releases it's Top 50 volleyball players for the 2015 season. The state of New Mexico has a wealth of talent this season and with three players already committed to the next level we will try and highlight the 50 top players this season. NMPreps.com's Top 50 Volleyball Players \nNo. 44 PEYTON LINTHICUM Valencia HS (Los Lunas, NM) | Senior | 5'11\" | OH​ \nNotes: Linthicum has helped the Valencia Lady Jaguars to a 6-10, 2-4 start to the season and currently has her team on the bubble for the 5A post season.... continue reading here \nNo. 45 LEXIE JACKSON Farmington HS (Farmington, NM) | Junior | 5'2\" | L​ \nNotes: Jackson a capitan for the Farmington Lady Scorpions has helped the squad to a (9-7, 3-1) start to the season and looking to make a late... continue reading here \nNo. 46 KAYLA LEDEZMA Artesia HS (Artesia, NM) | Senior | 5'4\" | L​ \nNotes: Ledezma, plays for the 11-5 Artesia Lady Bulldogs who are setting up for a spot in the 2015 post season. Ledezma has been a huge part to the... continue reading here \nNo. 47 CELESTE NARANJO Espanola Valley HS (Espanola Valley, NM) | Senior | 5'2\" | S​ \nNotes: Naranjo, is having an outstanding season for the 5A Espanola Valley Lady Sundevils. As of today she has 141 digs, 53 aces and.. continue reading here \nNo. 48 LEAH WEATHERS Goddard HS (Roswell, NM) | Junior | S​ \nNotes: Weathers, is considered one of the best when it comes to assists in New Mexico. Currently she leads her team with 398 on the year along with 184 digs.... continue reading here \nNo. 49 ELLIE BREEDEN St. Mike's (Santa Fe, NM) | Junior | 6-foot | MB​ \nNotes: Breeden, is quietly helping the Lady Horsemen this season into what should be a state tournament birth with great play down the stretch. Breeden has 66 kills and 133 (leads the state) blocks.. continue reading here \nNo. 50 ROSE MOON Santa Fe Waldorf (Santa Fe, NM) | Freshman | 5-foot-8 | OH \nNotes: Moon, only a freshman that will graduate in 2019 is having a special season for a top team in her classification. With 228 kills (46.5%), 60 aces and 150 digs on the season it was hard to not take notice.. continue reading here", "external_links": [], "published": "2015-10-23T12:26:00.000+03:00", "crawled": "2015-10-23T21:59:35.282+03:00", "highlightTitle": ""}