{"organizations": [], "uuid": "939f313452afcf95828bdc82211191014ef7a512", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thegazette.com", "main_image": "http://www.thegazette.com/storyimage/GA/20151019/ARTICLE/151019601/AR/0/AR-151019601.jpg", "site_section": "http://feeds.feedburner.com/~r/GazetteOnlineSports/~6/1", "section_title": "Eastern Iowa Sports News and Information from Gazette Online", "url": "http://www.thegazette.com/subject/sports/half-season-all-big-ten-how-many-hawkeyes-20151019", "country": "US", "title": "Half-season All-Big Ten: How many Hawkeyes?", "performance_score": 0, "site": "thegazette.com", "participants_count": 0, "title_full": "Half-season All-Big Ten: How many Hawkeyes?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T19:37:00.000+03:00", "replies_count": 0, "uuid": "939f313452afcf95828bdc82211191014ef7a512"}, "author": "", "url": "http://www.thegazette.com/subject/sports/half-season-all-big-ten-how-many-hawkeyes-20151019", "ord_in_thread": 0, "title": "Half-season All-Big Ten: How many Hawkeyes?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "October 19, 2015 | 12:50 pm \nNo one ever got a plaque for being a half-season all-conference player. \nThat said, it strikes me that if the Big Ten had a half-season all-league football team, a certain 7-0 team would have quite a few sure-things on the first unit. \nThat someone is Iowa, and the only lead-pipe cinch, half-season, first-team all-Big Ten players it has are cornerback Desmond King and Jordan Canzeri. That assumes we go with the coaches’ and media all-league teams of last year, which had two running backs. \nOhio State’s Ezekiel Elliott is first-team, the biggest slam-dunk in the conference. Canzeri gets the second spot ahead of Northwestern’s Justin Jackson. Canzeri is averaging 127.3 total yards per game despite missing almost all of last Saturday’s game against Northwestern to injury. Jackson averages 110.4. \nCanzeri has 10 touchdowns, Jackson one. \nHow much more Canzeri can give the team this season after his ankle injury, who knows? But we’re talking about what players have done to this point, and nothing more. \nKing is a sure thing. His six interceptions are twice as many as any other Big Ten player, and he is tied for second in the league in passes defended though teams don’t throw his way all that often. \nAfter that, there are obvious good first-team candidates on the Hawkeyes, but no sure things. However, I think Marshall Koehn and Austin Blythe would likely be first-teamers. \nKoehn gets the nod at kicker for being 10-of-12 in field goals including the 57-yarder that beat Pittsburgh. That remains the longest field goal by an FBS player this season. \nYes, he has missed three PATs. That’s what stops him from joining King and Canzeri on the sure-thing list. \nHowever, while a few Big Ten kickers have similar statistics to Koehn, no one has done more. Indiana’s Griffin Oakes is 10-of-11 in field goals, but has made just two from beyond 40 yards and hasn’t hit one from longer than 34 yards in the Hoosiers’ last five games. \nI think Blythe would have a decent chance to be the half-season Big Ten center. He didn’t enter the season with the accolades given Michigan State’s Jack Allen or Wisconsin’s Dan Voltz, and those are two fine players. But neither played last Saturday because of injuries. \nSomeone from Iowa’s offensive line has to be on the first team, and coaches and media would know that. Wouldn’t they? \nNo Iowa wide receiver or tight end would crack the first team. Only two receivers and one tight end are on the league’s end-of-season first-team. \nIowa quarterback C.J. Beathard has had a terrific half-season. But not good enough to budge Michigan State’s Connor Cook from the top spot. Every time I looked up at the television while writing in Northwestern’s press box Saturday afternoon, it seemed like I was seeing Cook throw a beautiful pass against Michigan. \nThe league doesn’t separate between defensive ends and tackles, or cornerbacks and safeties. It picks four defensive linemen and four defensive backs for its first-team. \nAs well as Iowa’s Drew Ott played before his season-ending knee injury, he probably didn’t get enough playing time and big-network visibility to crack the top four. \nAs good as the Hawkeyes’ Jaleel Johnson and Nate Meier have been, the defensive line has locks in Ohio State’s Joey Bosa, and Michigan State’s Shilique Calhoun. Penn State’s Anthony Zettel is right there, too, and teammate Carl Nassib has a league-best 12 sacks. Ohio State’s Adolphus Washington is also a strong candidate. \nIowa has had good linebacker play, but there are only three spots to fill. Wisconsin’s Joe Schobert may be the league’s half-season Defensive Player of the Year. Ohio State’s Darron Lee, Michigan State’s Riley Bullough and Rutgers’ Steve Longa are all hard to argue against as first-teamers. \nNassib and Schobert are former walk-ons, by the way. \nYou have to like what Lee tweeted a couple weeks ago when Buckeye fans were agitated with OSU slipping past Indiana: \nTo the fans who genuinely love us thank you for the support. For those who continue to bash us harshly, we love you too. #GoBucks \nKing wouldn’t be joined by a fellow Hawkeye defensive back on the Big Ten’s first team. \nFinally, the punter. Iowa’s Dillon Kidd has had a sterling half-season. But Minnesota’s Peter Martell is the incumbent all-leaguer at that position who has done a solid job this year, and Ohio State’s Cameron Johnston’s 46.3-yard average is 1.5 yards better than second-place Kidd. \nSo, Iowa’s first-teamers up to now are Canzeri, King, probably Koehn, possibly Blythe, and maybe, maybe, maybe Meyer or Johnson. \nConsidering we’re talking about just 24 spots in a 14-team league, that’s actually pretty good. Iowa had just one first-team player (offensive tackle Brandon Scherff) on its honor squad last year. \nPlus, the whole of this Iowa team truly is greater than the sum of its parts. \nOK, who I have overlooked or undervalued? Use the comments box here or email me at mike.hlas@thegazette.com Your Next Articles", "external_links": [], "published": "2015-10-19T19:37:00.000+03:00", "crawled": "2015-10-19T21:18:12.649+03:00", "highlightTitle": ""}