{"organizations": [], "uuid": "1faf72f7840e65ce12659cb4084cbcd925eb8680", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "ezinearticles.com", "main_image": "//ezinearticles.com/members/mem_pics/Louis-J-Comeau_2026646.jpg", "site_section": "http://feeds.ezinearticles.com/category/Recreation-and-Sports.xml", "section_title": "Recreation and Sports Articles from EzineArticles.com", "url": "http://EzineArticles.com/?Backpacking:-Knowing-Tent-Specs&id=9193781", "country": "US", "title": "Backpacking: Knowing Tent Specs", "performance_score": 0, "site": "ezinearticles.com", "participants_count": 0, "title_full": "Backpacking: Knowing Tent Specs", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T17:52:00.000+03:00", "replies_count": 0, "uuid": "1faf72f7840e65ce12659cb4084cbcd925eb8680"}, "author": "", "url": "http://EzineArticles.com/?Backpacking:-Knowing-Tent-Specs&id=9193781", "ord_in_thread": 0, "title": "Backpacking: Knowing Tent Specs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Louis J Comeau"], "text": "By Louis J Comeau | Submitted On October 10, 2015 \nDuring the selection process of your tent you will notice a configuration of letters and numbers. This arrangement actually looks like a formula and you wonder, what purpose does it serve? \nAt first you may think to yourself that there is no purpose, just something the manufacturer put on. However, understanding these specs can help you understand some vital information about your tent. The goal of this article is to enlighten you on this codes meaning and give you a clearer picture of its function. \nBeginning with what one of these equations looks like, keep in mind that while the figures may change, what they reference will not. Alright here is a typical specification: 20D X 330T ripstop nylon 1200 mm Durashield Polyurethane and Silicone. Looking at this all at once can be intimidating, when you take one piece at a time, it becomes easier to understand. First piece of this is 20D and the \"D\" stands for denier and what it tells you is the how thick the fibers are in a particular fabric. In regards to fabric the two most commonly used are nylon and polyester. There is one denier to a single strand of silk, so the 20D indicates the diameter of the strands of that particular fabric. Note here that the higher the number, the larger the diameter and it usually means that it is also stronger. Along with the diameter of the thread you have the thread count of the fabric which in this case is 330T. The 330 are the number of horizontal and vertical threads per square inch of material and the \"T\" stands for the thread count of the fabric. \nNow looking at our fabric which in this case is a ripstop nylon. Ripstop is a double thread placed at established distance. This is a very reassuring knowing that a tear in your tent, if one occurs, can only spread so far. Now you know your fabric is nylon and it comes with a ripstop. Another that you may see is a storm shield plus which is an exceptional polyester fabric. Polyester fabrics are thicker than nylon which is great for tear strength and resistant to abrasions. Tafetta material will give you protection with punctures and mildew, very lightweight, and easy to clean and repair. These mentioned fabrics are usually found in the making of the fly and walls of your tent. However, in regards to the floor they are usually made out of oxford or taffeta which are both excellent in regards to abrasions which is great for your floor which will be in constant contact with the ground. \nReturning to our example we now see 1200mm Durashield. The \"mm\" is for millimeters and it provides the waterproof rating for the particular tent. It represents how much water pressure it can stand before a leak begins. The test is done by applying water to the back of the fabric until water begins to seep through. So in this case we have a coating of Durashield which can stand 1200 millimeters of pressure before leaking. \nLastly in our example is polyurethane and silicone coating. The first application was for waterproofing, but this next coating is for the repelling of water. This allows the water to bead up which protects the fabric from becoming saturated. In closing you can see the important information that each formula provides for you. This should give you a better understanding while comparing tents. It will help narrow down your choices and always keep in mind the intended use of your tent. \nMy name is LJ Comeau and I am the owner of http://www.yourbackpackingtents.com/ . Backpacking can be a lot of fun if done correctly. Our site was made for those who enjoy camping, hiking, and backpacking. So come on over to http://www.yourbackpackingtents.com , sit down, and read about the one, two, and three person tents that we have from some of the top tent manufactures; Big Agnes, Coleman, Alps Mountaineering, and others. Also available at our store you will find hammocks, bivvies' and backpacks.", "external_links": [], "published": "2015-10-14T17:52:00.000+03:00", "crawled": "2015-10-14T17:53:36.427+03:00", "highlightTitle": ""}