{"organizations": [], "uuid": "3912b123cbb83a612bf678f968459b65246215ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newstimes.com", "main_image": "http://ww2.hdnux.com/photos/41/52/26/8824213/3/rawImage.jpg", "site_section": "http://newstimes.com//home/collectionRss/Homepage-Hcat-Sports-336.php", "section_title": "Homepage Hcat Sports", "url": "http://www.newstimes.com/sports/article/Murphy-Mets-beat-Cubs-5-2-for-commanding-3-0-6580592.php", "country": "US", "title": "Murphy, Mets beat Cubs 5-2 for commanding 3-0 lead in NLCS", "performance_score": 0, "site": "newstimes.com", "participants_count": 1, "title_full": "Murphy, Mets beat Cubs 5-2 for commanding 3-0 lead in NLCS", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T08:02:00.000+03:00", "replies_count": 0, "uuid": "3912b123cbb83a612bf678f968459b65246215ce"}, "author": "ANDREW SELIGMAN, AP Sports Writer", "url": "http://www.newstimes.com/sports/article/Murphy-Mets-beat-Cubs-5-2-for-commanding-3-0-6580592.php", "ord_in_thread": 0, "title": "Murphy, Mets beat Cubs 5-2 for commanding 3-0 lead in NLCS", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Murphy, Mets beat Cubs 5-2 for commanding 3-0 lead in NLCS Andrew Seligman, Ap Sports Writer Updated 1:06 am, Wednesday, October 21, 2015 Photo: David J. Phillip, AP Image 1 of / 10 Close Image 1 of 10 New York Mets' Daniel Murphy hits a home run during the third inning of Game 3 of the National League baseball championship series against the Chicago Cubs Tuesday, Oct. 20, 2015, in Chicago. New York Mets' Daniel Murphy hits a home run during the third inning of Game 3 of the National League baseball championship series against the Chicago Cubs Tuesday, Oct. 20, 2015, in Chicago. Photo: David J. Phillip, AP Image 2 of 10 New York Mets' Daniel Murphy scores past Chicago Cubs catcher Miguel Montero during the seventh inning of Game 3 of the National League baseball championship series Tuesday, Oct. 20, 2015, in Chicago. Murphy scored from third on a ball hit by Lucas Duda. New York Mets' Daniel Murphy scores past Chicago Cubs catcher Miguel Montero during the seventh inning of Game 3 of the National League baseball championship series Tuesday, Oct. 20, 2015, in Chicago. Murphy ... more Photo: Charles Rex Arbogast, AP Image 3 of 10 New York Mets pitcher Jacob deGrom throws during the first inning of Game 3 of the National League baseball championship series against the Chicago Cubs Tuesday, Oct. 20, 2015, in Chicago. New York Mets pitcher Jacob deGrom throws during the first inning of Game 3 of the National League baseball championship series against the Chicago Cubs Tuesday, Oct. 20, 2015, in Chicago. Photo: David J. Phillip, AP Image 4 of 10 New York Mets' Daniel Murphy celebrates after hitting a home run during the third inning of Game 3 of the National League baseball championship series against the Chicago Cubs Tuesday, Oct. 20, 2015, in Chicago. New York Mets' Daniel Murphy celebrates after hitting a home run during the third inning of Game 3 of the National League baseball championship series against the Chicago Cubs Tuesday, Oct. 20, 2015, in ... more Photo: David J. Phillip, AP Image 5 of 10 New York Mets pitcher Jacob deGrom throws during the first inning of Game 3 of the National League baseball championship series against the Chicago Cubs Tuesday, Oct. 20, 2015, in Chicago. New York Mets pitcher Jacob deGrom throws during the first inning of Game 3 of the National League baseball championship series against the Chicago Cubs Tuesday, Oct. 20, 2015, in Chicago. Photo: Nam Huh, AP Image 6 of 10 Chicago Cubs catcher Miguel Montero can't handle a pitch as New York Mets' Michael Conforto bats during the sixth inning of Game 3 of the National League baseball championship series Tuesday, Oct. 20, 2015, in Chicago. Yoenis Cespedes scored from third on the play. Chicago Cubs catcher Miguel Montero can't handle a pitch as New York Mets' Michael Conforto bats during the sixth inning of Game 3 of the National League baseball championship series Tuesday, Oct. 20, 2015, ... more Photo: David J. Phillip, AP Image 7 of 10 Chicago Cubs pitcher Travis Wood reacts to a double by New York Mets' David Wright during the seventh inning of Game 3 of the National League baseball championship series Tuesday, Oct. 20, 2015, in Chicago. Chicago Cubs pitcher Travis Wood reacts to a double by New York Mets' David Wright during the seventh inning of Game 3 of the National League baseball championship series Tuesday, Oct. 20, 2015, in Chicago. Photo: David Goldman, AP Image 8 of 10 Chicago Cubs' Travis Wood is relieved during the seventh inning of Game 3 of the National League baseball championship series against the New York Mets Tuesday, Oct. 20, 2015, in Chicago. Chicago Cubs' Travis Wood is relieved during the seventh inning of Game 3 of the National League baseball championship series against the New York Mets Tuesday, Oct. 20, 2015, in Chicago. Photo: David Goldman, AP Image 9 of 10 A fan gets ready for some rain during the seventh inning of Game 3 of the National League baseball championship series between the New York Mets and the Chicago Cubs Tuesday, Oct. 20, 2015, in Chicago. A fan gets ready for some rain during the seventh inning of Game 3 of the National League baseball championship series between the New York Mets and the Chicago Cubs Tuesday, Oct. 20, 2015, in Chicago. Photo: Nam Y. Huh, AP Image 10 of 10 Murphy, Mets beat Cubs 5-2 for commanding 3-0 lead in NLCS 1 / 10 Back to Gallery CHICAGO (AP) — Daniel Murphy is a contact hitter known for shaky fielding and occasionally getting lost on the bases. This playoff impersonation of Babe Ruth , Roberto Alomar and Derek Jeter all rolled into one, he can't explain it. Nor can his manager. \"Question is, who is this guy?\" skipper Terry Collins said. Murphy homered in his record-tying fifth straight postseason game, Jacob deGrom pitched seven strong innings and the New York Mets beat the Chicago Cubs 5-2 Tuesday night for a 3-0 lead in the NL Championship Series . \"I've watched a lot of baseball over the years, I don't think I've seen anybody put on this kind of a show on this stage like he has so far,\" Collins said. \"I mean, even the guys in the dugout, they're baseball guys, too, and they're saying the same thing.\" A cluster of New York fans gathered in the rain behind their team's dugout after the final out and chanted \"Let's go, Mets!\" And with a win Wednesday night at Wrigley Field, the Mets will be going to their first World Series in 15 years. Rookie Steven Matz gets the start for New York in Game 4 while Jason Hammel goes for the Cubs. Murphy tied the homer mark set by Houston's Carlos Beltran in 2004 with his drive off Kyle Hendricks in the third. Murphy's home run was his sixth of the postseason in his 30th at-bat —he's hit just 62 in 3,354 at-bats in the regular season. The free agent-to-be second baseman also is making sharp plays in the field and showing heads-up, aggressive instincts running the bases. \"I wish I could explain it,\" said Murphy, who hit a career-high 14 homers in the regular season. \"I would have done it like six years ago. I can't explain it.\" After going 0-7 against the Cubs during the regular season, New York is overpowering them with their arms and bats. Yoenis Cespedes and David Wright each had three hits for the Mets. Cespedes scored the go-ahead run on a two-out wild pitch by Trevor Cahill on a strikeout of Michael Conforto in the sixth inning. DeGrom followed up dominant starts by Matt Harvey and Noah Syndergaard in New York with one of his own. The NL Rookie of the Year held the Cubs' big bats to just two runs and four hits. He struck out seven, walked one and retired his final 11 batters. The righty with the flowing hair improved to 3-0 in his first postseason, with all of the wins coming on the road. Jeurys Familia closed for his fifth save of the postseason. Kyle Schwarber had the towel-waving crowd shaking 101-year old Wrigley Field to its foundation in the first inning with his club-record fifth homer of the postseason. Jorge Soler also had them roaring with his solo drive in the fourth. But manager Joe Maddon 's Cubs have just five runs in this series. Barring an epic comeback, a World Series drought that dates to 1908 will continue. Only one other team has won a playoff series after dropping the first three games. Theo Epstein 's Red Sox came back against the New York Yankees in the 2004 AL Championship Series and ultimately ended one long championship curse. Now, the team he constructed in Chicago, that stirred the imaginations of long-suffering fans, finds itself in a similar spot. \"Of course you think about those things, you think about the parallels, think about the fact that that happened against a New York team,\" said Maddon, whose team posted the majors' third best record and came into this series on a 12-1 tear. \"We think about all that stuff, but it's up to us to go out and play and execute.\" Cespedes broke a 2-all tie after he led off the sixth with a single against Cahill. He stole third and scored with two out as Conforto swung at a 2-2 pitch in the dirt. The ball rolled to the backstop, allowing the runner to reach first and extending the inning. Conforto was forced to stay at third when Wilmer Flores ' drive rolled to the ivy in right field was called a ground-rule double. That drew a heated argument from Collins, who came back out to protest some more after he returned to the dugout. The Mets added two more runs in the seventh to make it 5-2. Hendricks went four innings for Chicago, allowing two runs and five hits. \"This is not the spot where we want to be, but we're here and we've got to face it,\" Schwarber said. Never before had the Cubs played this late on the calendar at Wrigley Field, and the place was rocking when Schwarber tied it at 1 with his solo homer to left-center in the first. It wasn't quite as impressive as the shot he hit to the top of the right-field videoboard that helped knock out St. Louis in Game 4 of the NLDS. That ball got encased by the Cubs where it settled. Still, Schwarber broke the franchise record set by Alex Gonzalez and Aramis Ramirez in 2003. Murphy made it 2-1 in the third with his drive to center off Hendricks. Besides tying Beltran's record, he also set a Mets mark with his sixth postseason homer. UP 3-0 The Mets are the fifth team to win the first three in the NLCS since it went to a seven-game format in 1985, along with Colorado in 2007, Atlanta in 1999, San Diego in 1998 and Atlanta in 1995. New York had never led any postseason series 3-0. TRAINER'S ROOM Mets: Collins said RHP Matt Harvey was feeling \"a lot better\" and thinks his ace will be ready for Game 5, if necessary. Harvey was struck near his pitching shoulder by a comebacker in the series opener, leading to some swelling. UP NEXT Mets: Matz looks to rebound from a loss to the Los Angeles Dodgers in Game 4 of the NL Division Series against the Dodgers. The rookie will also be making his first appearance at Wrigley Field — and his first against the Cubs. Cubs: After tossing three innings in the clinching Game 4 of the NLDS against St. Louis, Hammel will try to extend the season.", "external_links": [], "published": "2015-10-21T08:02:00.000+03:00", "crawled": "2015-10-21T12:10:29.953+03:00", "highlightTitle": ""}