{"organizations": [], "uuid": "6995a894a14c715f48eeb49e65731d55a51c648c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.oregonlive.com", "main_image": "http://imgick.oregonlive.com/home/olive-media/width620/img/oregonian/photo/2015/10/11/18951929-large.jpg", "site_section": "http://www.oregonlive.com/", "section_title": "Oregon Local News, Breaking News, Sports &amp; Weather - OregonLive.com", "url": "http://www.oregonlive.com/pacific-northwest-news/index.ssf/2015/10/oregon_shooting_myrtle_creek_g.html", "country": "US", "title": "Oregon shooting: Myrtle Creek gathers to remember two of their own", "performance_score": 0, "site": "oregonlive.com", "participants_count": 1, "title_full": "Oregon shooting: Myrtle Creek gathers to remember two of their own | OregonLive.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T05:08:00.000+03:00", "replies_count": 0, "uuid": "6995a894a14c715f48eeb49e65731d55a51c648c"}, "author": "Tony Hernandez | The Oregonian/OregonLive", "url": "http://www.oregonlive.com/pacific-northwest-news/index.ssf/2015/10/oregon_shooting_myrtle_creek_g.html", "ord_in_thread": 0, "title": "Oregon shooting: Myrtle Creek gathers to remember two of their own", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "As the sun began to set Sunday night in Myrtle Creek, more than 160 community members gathered at a park during a vigil for two women who died from the Oct. 1 shooting at Umpqua Community College.\n\"Sometimes the worst brings out the best,\" Mayor Ken Brouillard told a community member holding one of hundreds of religious candles donated by a local business owner.\nThey gathered for Rebecka Carnes, 18, and Sarena Moore, 44, both students who were loved and remembered. They spoke words of comfort as many in attendance sat or stood silent. Couples embraced. Children behaved.\nCarnes, a softball and soccer standout, graduated this spring from South Umpqua High School as an honors student. Last month, she started her first job at Walmart. She dreamed of becoming a dental hygienist and loved country music, hunting and fishing.\n\"She wore mud as well as makeup,\" said Brenda Kuntz, a family friend.\nMoore, 44, was a mother of three who loved animals, especially horses and dogs, the mayor said. She was a semester away from earning an associate degree in business.\n\"She moved to an apartment next to a library so that she could be closer to her books and bus stop,\" Brouillard said. \"If you remember seeing a lady out waiting for a bus with a dog and in a wheelchair, that was Sarena.\"\nAt an open mic, some sang songs, while others spoke poems. They shared stories of losses they had endured – \"You never get over it,\" the mayor said. \"You go on because you must\" – and depression they had tried to shake.\nRoseburg resident Jorge Valenzuela urged people to reach out to others. Even in tight-knit communities, some still suffer from loneliness.\n\"You need to reach out to the outcast,\" Valenzuela said. \"You need to reach out to him and listen to him because he needs to be heard. She needs to be heard. They need to be heard, and you need to be one that listens and shows them that there's somebody here for them.\"\nThe vigil lasted a little more than an hour as the sun fell behind a ridge and the candles shined bright like stars on the park's lawn.\n\"I was thrilled that we had so many people and delighted by people that shared from their heart,\" the mayor said. \"I thought that it was good for our community and for them as well.\"\n--\nTony Hernandez\nthernandez@oregonian.com\n503-294-5928\n@tonyhreports\nCasey Parks contributed to the report.", "external_links": ["http://www.twitter.com/tonyhreports"], "published": "2015-10-12T05:08:00.000+03:00", "crawled": "2015-10-12T18:11:36.684+03:00", "highlightTitle": ""}