{"organizations": [], "uuid": "dfc78962c147d20da2402f2067519f754da8d604", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nola.com", "main_image": "http://imgick.nola.com/home/nola-media/width620/img/tpphotos/photo/2015/10/05/18907563-standard.jpg", "site_section": "http://www.nola.com/sportsflash/", "section_title": "New Orleans &amp; Louisiana Sports | High School, College &amp; Pro Sports News NOLA.com", "url": "http://www.nola.com/saints/index.ssf/2015/10/new_orleans_saints_kicker_zach_2.html", "country": "US", "title": "New Orleans Saints kicker Zach Hocker staying positive after 'tough' week", "performance_score": 0, "site": "nola.com", "participants_count": 2, "title_full": "New Orleans Saints kicker Zach Hocker staying positive after 'tough' week | NOLA.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:49:00.000+03:00", "replies_count": 1, "uuid": "b8e006993fc52f71bde84dc2cdde121f735522db"}, "author": "Katherine Terrell, NOLA.com | The Times-Picayune", "url": "http://www.nola.com/saints/index.ssf/2015/10/new_orleans_saints_kicker_zach_2.html#post-0", "ord_in_thread": 0, "title": "New Orleans Saints kicker Zach Hocker staying positive after 'tough' week", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "If Zach Hocker's final kick in regulation against the Cowboys had drifted just a few inches in on Sunday night, he would have gone home feeling like a hero.\nInstead, the 30-yard kick, which would have won the game in regulation, bounced off the uprights and the Saints went to overtime. They won with a Drew Brees touchdown pass a few plays later, but Hocker didn't really feel like celebrating.\n\"After the game, in the locker room, I was down in the dumps, but we got the win and the energy was still high,\" Hocker said. \"Multiple guys came up to me and gave me a hug, slapped me on the shoulder and said 'you're going to get the next one...'\n\"That confidence from the locker room gives me a boost going into the next game.\"\nSuch is the life of an NFL kicker. The 51-yarder and 29-yarder he made earlier in the game, or his perfect game in Week 1 against the Cardinals, were all but forgotten as soon as he missed his last kick.\n\"Last week was tough,\" he said. \"I thought I had a great game all the way through until the last kick. ... I fed off the energy from the guys on the sideline and felt good about it when it came off the foot, but it wasn't meant to go in.\"\nStay in the league long enough, and there will be bad misses.\n\"If you play long enough, and do this long enough ... sooner or later you're going to come across one that you're going to miss. I had one in college and bounced back and hit multiple after that, and same thing this week,\" Hocker said.\nHocker, in his fourth game, has already experienced the rough parts early. He's missed two PATs, one blocked and one a bad hold, and has had to wait out kicker tryouts two different times to see if he would keep his job.\n\"I understand the business,\" Hocker said. \"I was one of those guys last year, that when guys struggled, I was bouncing around the country doing the exact same thing. And before this whole thing started it was my job to keep and my job to lose and I understand that.\"\nHocker said he won't spend the next few days walking on eggshells. He can't afford to do that, he said.\n\"The second you start thinking that way, you're going to be in trouble,\" he said.", "external_links": [], "published": "2015-10-09T03:49:00.000+03:00", "crawled": "2015-10-09T10:55:28.313+03:00", "highlightTitle": ""}