{"organizations": [], "uuid": "05d93c7a9780bfa2e37b386624247b018c8cbfdf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sportsnews.com.au", "main_image": "http://sportsnews.com.au/defaultimage.jpg", "site_section": "http://www.sportsnews.com.au/category/rugby-union/feed", "section_title": "Sports News Australia » Rugby Union News", "url": "http://www.sportsnews.com.au/rugby-union/wallaby-wall-was-built-in-the-usa/159613", "country": "CA", "title": "Wallaby wall was built in the USA", "performance_score": 0, "site": "sportsnews.com.au", "participants_count": 1, "title_full": "Wallaby wall was built in the USA", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T09:04:00.000+03:00", "replies_count": 0, "uuid": "05d93c7a9780bfa2e37b386624247b018c8cbfdf"}, "author": "AAP", "url": "http://www.sportsnews.com.au/rugby-union/wallaby-wall-was-built-in-the-usa/159613", "ord_in_thread": 0, "title": "Wallaby wall was built in the USA", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Wallaby wall was built in the USA   5:04 pm   \nThe foundations of the Wallabies’ mighty defensive wall were laid far from prying eyes in a foreign land where rugby union barely exists. \nAt Notre Dame University in Indiana, coach Michael Cheika and defence assistant Nathan Grey produced the training drills which are giving the Wallabies an edge – helping them top the World Cup’s Pool of Death and attain second favouritism to the lift the Webb Ellis Cup. \nWith the mercury tipping 40 degrees Celsius, Cheika ordered his players to don their tracksuits and run through defensive drills at their pre-World Cup camp. \nThe aim was to test and improve players’ decision-making when suffering extreme fatigue – much as they were when they defended their own line for seven minutes with two men in the sin bin in the weekend’s epic 15-6 win over Wales at Twickenham. \n“There were days when we were in America that we still laugh about: 38 degrees and we had to throw on the suits, tops and bottoms,” hard-working prop Sekope Kepu said. \n“It feels like 50 degrees in the suits, and we were just smashing each other for 30-40 minutes, and solving those problems. \n“All the training has been about getting us fatigued and testing us under those moments when we are really buggered.” \nThe rewards were there for all to see when the Wallabies emerged from the pool unbeaten and with only two tries scored against them in the 320 minutes played over four matches. \n“The hard work has been done,” said Kepu. \n“(Against Wales) when I was going through a bit of pain, you know you’re hurting but you know the opposition is hurting as well if not worse. \n“I just have full confidence in the work we have done but we have to keep building and not let it slip.” \nThe same happened with scrum training, where the Wallabies pack would push and push for minutes at a time but get nowhere – only to look up and find that Cheika had added an extra flanker or two to their opposition, and it was a battle of eight on ten. \nAgain the results are there for World Cup rivals to see: a bruising victory over England in which the offence flourished was followed up by a magnificent defensive effort which has been hailed as one of their best in living memory against Wales. \nCheika and his players have repeatedly spoken about the defensive display being a product of the team’s culture. \nKepu gave an insight into that when he revealed the words of encouragement veteran winger Drew Mitchell tossed his way when he was out on his feet early in the second half. \n“I know you’re rooted, but I am just going to keep coming at you,” Mitchell told Kepu, who found the energy to redouble his efforts and throw himself into another scrum. \nThe words hit the spot. \n“For me, you never take things like that personally,” said Kepu, who also believes the Wallabies will not be beaten on fitness in any game at this World Cup. \n“He only wants the best out of you and I appreciate it. \n“If I am not doing my job, that’s what team honesty is all about. \n“We have learned to have a go at each other in training and have a few scuffles here and there but it’s all done with good intent and it’s all about doing the best for the team.”  ", "external_links": [], "published": "2015-10-12T09:04:00.000+03:00", "crawled": "2015-10-12T13:38:09.987+03:00", "highlightTitle": ""}