{"organizations": [], "uuid": "5cb6dfb5003db9b6878f4066c2fd996c1114f72a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tennessean.com", "main_image": "http://www.gannett-cdn.com/-mm-/070af21c1be75404747e97e672627d28eb94785f/c=0-60-1826-1091&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/26/USATODAY/USATODAY/635814621662964431-USP-NFL-DALLAS-COWBOYS-AT-NEW-YORK-GIANTS-77025654.JPG", "site_section": "http://www.tennessean.com/sports/", "section_title": "The Tennessean|Sports", "url": "http://www.tennessean.com/story/sports/nfl/2015/10/26/nfl-week-7-overreactions-cowboys-finished/74624378/", "country": "US", "title": "NFL Week 7 overreactions: Are Cowboys finished?", "performance_score": 0, "site": "tennessean.com", "participants_count": 4, "title_full": "NFL Week 7 overreactions: Are Cowboys finished?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T20:21:00.000+02:00", "replies_count": 3, "uuid": "5cb6dfb5003db9b6878f4066c2fd996c1114f72a"}, "author": "tennessean", "url": "http://www.tennessean.com/story/sports/nfl/2015/10/26/nfl-week-7-overreactions-cowboys-finished/74624378/", "ord_in_thread": 0, "title": "NFL Week 7 overreactions: Are Cowboys finished?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tackling five overreactions from Week 7:\nThe Dallas Cowboys are done\nSure, the outlook appears grim for the Cowboys after a 27-20 loss Sunday against the Giants dropped them to last place in their division, but this year’s NFC East is different. There’s no clear-cut favorite, and even though the Cowboys have lost four in a row, they’re just 1.5 games off the lead.\nOnly 8.3% of teams that started the season 2-4 since 1990 went on to make the playoffs, so the Cowboys aren’t exactly playing with odds on their side.\nBut Dallas has an elite offensive line and a resurgent running game, tools the team can use to scrap out a couple of victories as long as it takes care of the ball.\nUSA TODAY\nArmour: Jerry Jones' enabling and excuses just as bad as Hardy's behavior\nConsider this: The Cowboys suffered three back-breaking interceptions from quarterback Matt Cassel (one returned for a TD) and gave up a 100-yard kickoff return for a score in the second half Sunday, but they still had a chance to win on the road against the now first-place Giants (4-3).\nAs long as the Cowboys can hang in these next few games, their playoff hopes remain alive – albeit on life support.\nAnd if Romo returns Week 11 against the Miami Dolphins – the first game he is eligible to play after being placed on injured reserve/designated to return list – to his previous form, Dallas could make a late postseason charge.\nBut to get there, it needs to limit turnovers, run the ball like it did Sunday and somehow find a way to win.\nUSA TODAY\n50 things we learned in Week 7 of the NFL season\nThe Pittsburgh Steelers gave their season away with a loss against the Kansas City Chiefs\nIt looked like a trap game, smelled like a trap game and sure felt like one, too.\nBut as disappointing as Sunday’s 23-13 loss against Kansas City was, Pittsburgh is still alive in the AFC North.\nAnd when you consider that the Steelers (4-3) have won three of their last five games since quarterback Ben Roethlisberger went down with a knee injury, it’s clear to see that Pittsburgh did what it had to do while he was gone.\nGet all the latest news on the Pittsburgh Steelers! Check out USA TODAY Sports' SteelersWire ! That changes in Week 8.\nThe Steelers have a huge showdown against the first-place Cincinnati Bengals (6-0) at home on Sunday, and a victory would be a massive momentum boost. Roethlisberger, who was questionable against the Chiefs but didn’t play, is expected back and that obviously makes them much better.\nPittsburgh still has a hold on the sixth and final projected playoff spot in the AFC, but if it wants to be a legit AFC contender, a win over the Bengals is one the Steelers need to have.\nThe San Francisco 49ers should bench Colin Kaepernick\nIt has been a nightmare season for San Francisco’s quarterback.\nBut even after Kaepernick completed just 13 of his 24 passes Thursday night for a meager 124 yards and no touchdowns, while getting sacked six times, the Niners should stay put.\nKaepernick is still just 27 years old and has all the physical traits you would want in a quarterback. It’s the environment around him that has been an issue.\nUSA TODAY FANTASY SPORTS\nFantasy football waiver wire: Who can fill Arian Foster's void?\nFOX Sports had a report Sunday that Kaepernick’s confidence is “completely shot” and that in the San Francisco locker room he’s “on an island.” When you factor in that this Kaepernick’s first season under new head coach Jim Tomsula and offensive coordinator Geep Chryst, it’s easy to see why there have been some struggles.\nBackup Blaine Gabbert isn’t the answer for San Francisco.\nThe 49ers need to do everything they can to put Kaepernick in a system that makes him feel comfortable and highlights his skill set. That he worked out this offseason with former St. Louis Rams quarterback Kurt Warner, with whom Kaepernick shares practically no traits, shows that the Niners want him to be something that he’s not: a traditional pocket passer.\nKaepernick has had some brutal performances this season. In three games against the Arizona Cardinals, Green Bay Packers and Seattle Seahawks, he has completed 35 of his 68 passes for 351 yards, zero touchdowns and five picks.\nThere’s no doubt this is a rebuilding year for the 49ers, but it’s time to help boost their quarterback’s confidence. Not bench him.\nRex Ryan is under fire in Buffalo for the Bills' struggles. (Photo: Kirby Lee, USA TODAY Sports)\nThe Buffalo Bills made the wrong choice in hiring Rex Ryan\nThis has not been the season the Bills envisioned.\nThey were a 9-7 team that just missed the playoffs, brought in an energetic and aggressive head coach in Rex Ryan and added a bunch of pieces this offseason.\nAfter Sunday’s loss in London against the Jacksonville Jaguars, there’s no doubt this year has been a disappointment, but it’s too early to call the season a bust.\nUSA TODAY\nChargers fans feel like they are falling into Black Hole with possible move\nBuffalo now sits at 3-4 and in last place in the AFC East, this after starting 2-1 with impressive victories over the Indianapolis Colts and Miami Dolphins.\nAs with any transition, it takes time. And while the Bills have a defense loaded with talent and an offense with speed and play-making ability, quarterback play has been spotty, at best. With starter Tyrod Taylor missing the last two games, EJ Manuel has bombed.\nBuffalo has also been an undisciplined team that has made senseless mistakes and has been penalized far too much. Some of those mistakes can be corrected, but they have also been trademarks of Ryan’s teams. There’s a lot of football left, so it’s only fair to give Rex a pass – for now – but this team does need to show improvement in the second half of the season.\nThe St. Louis Rams are a playoff team\nIt was an impressive victory on a lot of fronts, especially with rookie running back Todd Gurley III looking more and more like the real deal.\nBut the Rams still have a long way to go.\nPart of the reason why St. Louis should be only be considered a mild contender is because of the conference it plays in.\nThe Carolina Panthers (6-0) and Atlanta Falcons (6-1) both play in the NFC South, and if current trends continue, it’s looking more and more like the runner-up of the division crown will claim one of the NFC’s two wild-card spots.\nUSA TODAY\nBell: Mike Zimmer's Vikings look ready to set sail for playoffs\nThen there’s the NFC North, where the Packers (6-0) should roll to the division crown, but the upstart Vikings (4-2) appear to be improving each week.\nBut then there’s the NFC West, where the Rams play. The Cardinals, whom the Rams beat 24-22 in Week 4, look like the favorite to win the division. But the Seahawks, whom the Rams defeated 34-31 in Week 1, have a championship pedigree and have been in this position before.\nThere’s a lot of competition for the postseason.\nSt. Louis may eventually make the playoffs. It has a dominant defense and dynamic skill position weapons.\nBut until the Rams show that they can consistently stack performances like Sunday’s win against the Cleveland Browns and not lose the head-scratching contest against the Redskins like they did in Week 2, it’s just too early to put them in the contender category.\nFollow Lorenzo Reyes on Twitter @LorenzoGReyes\nVIDEO PLAYLIST: LATEST FROM THE NFL NFL Stock Watch: Who's rising, falling entering Week 8? | 02:04 USA Today Sports' Lindsay H. Jones offers perspective on the biggest story lines from Week 7 and whether it's time to panic moving forward. USA TODAY Sports\n1 of 14 VIDEO PLAYLIST: LATEST FROM THE NFL NFL Inside Slant: Hardy becoming a problem for Cowboys | 01:03 USA Today Sports' Tom Pelissero breaks down how Greg Hardy's most recent antics are an issue in Dallas. USA TODAY Sports\n2 of 14 VIDEO PLAYLIST: LATEST FROM THE NFL NFL Monday Hot Reads: What we learned in Week 7 | 02:25 USA Today Sports' Tom Pelissero looks at Week 7 of the NFL season, and what it means moving forward. USA TODAY Sports\n3 of 14 VIDEO PLAYLIST: LATEST FROM THE NFL NFL Inside Slant: Time for Colin Kaepernick to step up | 01:09 USA Today Sports' Tom Pelissero discusses why tonight's game between the 49ers and Seahawks is a huge test for San Francisco quarterback Colin Kaepernick. USA TODAY Sports\n4 of 14 VIDEO PLAYLIST: LATEST FROM THE NFL Chuck Pagano, Andrew Luck discuss Colts loss to Saints | 01:52 Colts coach Chuck Pagano and quarterback Andrew Luck talk about the team's 27-21 loss to the New Orleans Saints. Matt Kryger / The Star\n5 of 14 VIDEO PLAYLIST: LATEST FROM THE NFL Tough to explain why Lions looked so inept vs. Vikings | 04:52 Detroit Free Press sports writers Dave Birkett and Carlos Monarrez agree there's little point in the Lions making a big change at this time. Video by Carlos Monarrez/DFP\n6 of 14 VIDEO PLAYLIST: LATEST FROM THE NFL NFL Power Rankings: 49ers soar going into Week 7 | 02:09 USA Today Sports' Lorenzo Reyes breaks down the NFL Power Rankings, including who's rising and which team is falling entering Week 7.\n7 of 14 VIDEO PLAYLIST: LATEST FROM THE NFL NFL Daily Blitz: Eagles sticking with Bradford | 01:26 The biggest topics of the day in the NFL. USA TODAY Sports\n8 of 14 VIDEO PLAYLIST: LATEST FROM THE NFL NFL Week 7 Sunday Statement: What you need to know | 02:05 USA Today Sports' NFL reporters offer need-to-know analysis leading up to kickoff of Week 7 in the NFL, plus fantasy advice you can't miss. USA TODAY Sports\n9 of 14 VIDEO PLAYLIST: LATEST FROM THE NFL Cover Three: NFL Week 7 games to watch | 01:28 USA Today Sports' Lindsay Jones offers up the five games you can't miss in Week 7 of the NFL season.\n10 of 14 VIDEO PLAYLIST: LATEST FROM THE NFL NFL Inside Slant: Eagles the NFC East's best? | 01:03 USA TODAY Sports' Tom Pelissero explains why the Philadelphia Eagles are the favorite to win the NFC East. USA TODAY Sports\n11 of 14 VIDEO PLAYLIST: LATEST FROM THE NFL NFL Stock Watch: Rising and falling after Week 6 | 01:53 USA TODAY Sports' Lindsay H. Jones discusses who's up and who's down after Week 6. USA TODAY Sports\n12 of 14 VIDEO PLAYLIST: LATEST FROM THE NFL NFL Monday Hot Reads: What we learned in Week 6 | 02:16 USA TODAY Sports' Tom Pelissero looks at what we learned in Week 6 of the NFL season. USA TODAY Sports\n13 of 14 VIDEO PLAYLIST: LATEST FROM THE NFL NFL Inside Slant: Coaching keeps Patriots dominant | 01:30 USA TODAY Sports' Tom Pelissero explains the key to the Patriots' success. USA TODAY Sports\n14 of 14 Last Video Next Video NFL Stock Watch: Who's rising, falling entering Week 8? NFL Inside Slant: Hardy becoming a problem for Cowboys NFL Monday Hot Reads: What we learned in Week 7 NFL Inside Slant: Time for Colin Kaepernick to step up Chuck Pagano, Andrew Luck discuss Colts loss to Saints Tough to explain why Lions looked so inept vs. Vikings NFL Power Rankings: 49ers soar going into Week 7 NFL Daily Blitz: Eagles sticking with Bradford NFL Week 7 Sunday Statement: What you need to know Cover Three: NFL Week 7 games to watch NFL Inside Slant: Eagles the NFC East's best? NFL Stock Watch: Rising and falling after Week 6 NFL Monday Hot Reads: What we learned in Week 6 NFL Inside Slant: Coaching keeps Patriots dominant Dallas Cowboys head coach Jason Garrett and quarterback Tony Romo (9) look on in the 3rd quarter against the New York Giants at MetLife Stadium. (Photo: William Hauser, USA TODAY Sports)", "external_links": ["http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/6455b3e6ab2e4e67ead57300dd81d263ebac08ad/c=0-50-814-864/local/-/media/2015/10/26/USATODAY/USATODAY/635814569151589908-jerry.JPG", "http://www.gannett-cdn.com/-mm-/20c3ae3abe4fbdfc18c566902d6f5d8051698ead/c=0-0-1441-1921&r=183&c=0-0-180-240/local/-/media/2015/10/26/USATODAY/USATODAY/635814659782257641-USATSI-8885166.jpg", "http://bcdownload.gannett.edgesuite.net/detroitfreep/35547428001/201510/152/35547428001_4577950618001_4577922636001-vs.jpg", "http://videos.usatoday.net/Brightcove2/29906170001/2015/10/29906170001_4578664316001_4578650353001-vs.jpg", "http://videos.usatoday.net/Brightcove2/29906170001/2015/10/29906170001_4577499772001_4577467819001-vs.jpg", "http://www.usatoday.com/videos/sports/nfl/cowboys/2015/10/26/74613562/", "http://videos.usatoday.net/Brightcove2/29906170001/2015/10/29906170001_4577499771001_4577467819001-th.jpg?pubId=29906170001", "http://videos.usatoday.net/Brightcove2/29906170001/2015/10/29906170001_4572513797001_4572488131001-vs.jpg", "http://www.usatoday.com/videos/sports/nfl/2015/10/19/74206038/", "http://bcdownload.gannett.edgesuite.net/detroitfreep/35547428001/201510/152/35547428001_4577950619001_4577922636001-th.jpg?pubId=35547428001", "http://videos.usatoday.net/Brightcove2/29906170001/2015/10/29906170001_4578870496001_video-still-for-video-4578829512001.jpg", "http://www.usatoday.com/videos/sports/nfl/2015/10/21/74319620/", "http://www.gannett-cdn.com/-mm-/f8c1cb6c53e763b069a7e248a194b49b6b35d9d9/r=522&c=522x300/http/videos.usatoday.net/Brightcove2/29906170001/2015/10/29906170001_4568439708001_Colin-480.jpg", "http://videos.usatoday.net/Brightcove2/29906170001/2015/10/29906170001_4568441834001_colin-120.jpg?pubId=29906170001", "http://www.gannett-cdn.com/-mm-/f8c1cb6c53e763b069a7e248a194b49b6b35d9d9/r=522&c=522x300/http/videos.usatoday.net/Brightcove2/29906170001/2015/10/29906170001_4570193096001_video-still-for-video-4570183263001.jpg", "http://www.gannett-cdn.com/-mm-/f2518c9838d5665f1fa5af5cf6bb11a0e7923dc1/c=2-0-1498-1125&r=115x86/local/-/media/2015/10/19/USATODAY/USATODAY/635808393370119228-USATSI-8871027.jpg", "http://www.usatoday.com/videos/sports/nfl/2015/10/20/74208188/", "http://videos.usatoday.net/Brightcove2/29906170001/2015/10/29906170001_4570193095001_thumbnail-for-video-4570183263001.jpg?pubId=29906170001", "http://www.usatoday.com/videos/sports/nfl/2015/10/26/74621876/", "http://i.usatoday.net/sports/nfl/Steelers-wire-promo.jpg", "http://www.gannett-cdn.com/-mm-/ebc9519ac086054fa5092ba711393606fbfe81d3/r=300/https/i1.wp.com/usatfantasy.files.wordpress.com/2015/10/arian-foster-houston-texans_20151025.jpg?fit=440%2C330", "http://www.usatoday.com/videos/sports/nfl/2015/10/26/74617172/", "http://videos.usatoday.net/Brightcove2/29906170001/2015/10/29906170001_4578763242001_video-still-for-video-4578753948001.jpg", "http://videos.usatoday.net/Brightcove2/29906170001/2015/10/29906170001_4578664315001_4578650353001-th.jpg?pubId=29906170001", "http://bcdownload.gannett.edgesuite.net/indianapolis/35547429001/201510/3840/35547429001_4577893606001_4577884413001-vs.jpg", "http://www.usatoday.com/story/sports/nfl/2015/10/25/50-things-we-learned-week-7/74602852/", "http://www.usatoday.com/story/sports/2015/10/26/armour-jerry-jones-hardy/74624376/", "http://archive.azcentral.com/ic/news/projects/css/linkset.css", "http://videos.usatoday.net/Brightcove2/29906170001/2015/10/29906170001_4572979950001_4572956540001-vs.jpg", "http://twitter.com/LorenzoGReyes", "http://bcdownload.gannett.edgesuite.net/indianapolis/35547429001/201510/3840/35547429001_4577893607001_4577884413001-th.jpg?pubId=35547429001", "http://www.usatoday.com/videos/sports/nfl/2015/10/19/74206638/", "http://www.gannett-cdn.com/media/2015/10/26/USATODAY/USATODAY/635814627609722551-USP-NFL-INTERNATIONAL-SERIES-BUFFALO-BILLS-AT-JAC-77019112.JPG", "http://www.gannett-cdn.com/-mm-/1e576a88511798c6ec5e836023073554e8fc0fdb/r=522&c=522x300/http/bcdownload.gannett.edgesuite.net/detroitfreep/35547428001/201510/152/35547428001_4577950618001_4577922636001-vs.jpg", "http://fantasy.usatoday.com/2015/10/fantasy-football-waiver-wire-alfred-blue-darren-mcfadden", "http://www.usatoday.com/story/sports/nfl/2015/10/26/chargers-raiders-fans/74616996/", "http://www.gannett-cdn.com/-mm-/f8c1cb6c53e763b069a7e248a194b49b6b35d9d9/r=522&c=522x300/http/videos.usatoday.net/Brightcove2/29906170001/2015/10/29906170001_4577499772001_4577467819001-vs.jpg", "http://www.usatoday.com/videos/sports/nfl/2015/10/22/74378070/", "http://www.gannett-cdn.com/-mm-/b2e9b23cd767d8a10443c055f0220c24d0200e88/r=266x400/local/-/media/2015/10/26/USATODAY/USATODAY/635814659782257641-USATSI-8885166.jpg", "http://videos.usatoday.net/Brightcove2/29906170001/2015/10/29906170001_4565759069001_thumbnail-for-video-4565732428001.jpg?pubId=29906170001", "http://www.gannett-cdn.com/-mm-/f8c1cb6c53e763b069a7e248a194b49b6b35d9d9/r=522&c=522x300/http/videos.usatoday.net/Brightcove2/29906170001/2015/10/29906170001_4572979950001_4572956540001-vs.jpg", "http://www.gannett-cdn.com/-mm-/f8c1cb6c53e763b069a7e248a194b49b6b35d9d9/r=522&c=522x300/http/videos.usatoday.net/Brightcove2/29906170001/2015/10/29906170001_4565658509001_4565642650001-vs.jpg", "http://www.usatoday.com/videos/sports/nfl/2015/10/22/74389612/", "http://videos.usatoday.net/Brightcove2/29906170001/2015/10/29906170001_4572979951001_4572956540001-th.jpg?pubId=29906170001", "http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/b9ab4dbed6df9a9d2e933ce30034f040859692c3/c=1301-62-2526-1287/local/-/media/2015/10/25/USATODAY/USATODAY/635814004573973392-GTY-494229678.jpg", "http://www.gannett-cdn.com/-mm-/f8c1cb6c53e763b069a7e248a194b49b6b35d9d9/r=522&c=522x300/http/videos.usatoday.net/Brightcove2/29906170001/2015/10/29906170001_4565759071001_video-still-for-video-4565732428001.jpg", "http://www.freep.com/videos/sports/nfl/lions/2015/10/25/74602236/", "http://videos.usatoday.net/Brightcove2/29906170001/2015/10/29906170001_4567828106001_4567827416001-th.jpg?pubId=29906170001", "http://www.usatoday.com/videos/sports/nfl/2015/10/20/74259616/", "http://steelerswire.usatoday.com/?cid=USAT-story-promo", "http://videos.usatoday.net/Brightcove2/29906170001/2015/10/29906170001_4565658509001_4565642650001-vs.jpg", "http://videos.usatoday.net/Brightcove2/29906170001/2015/10/29906170001_4567828105001_4567827416001-vs.jpg", "http://videos.usatoday.net/Brightcove2/29906170001/2015/10/29906170001_4578763241001_thumbnail-for-video-4578753948001.jpg?pubId=29906170001", "http://www.gannett-cdn.com/-mm-/f8c1cb6c53e763b069a7e248a194b49b6b35d9d9/r=522&c=522x300/http/videos.usatoday.net/Brightcove2/29906170001/2015/10/29906170001_4578664316001_4578650353001-vs.jpg", "http://www.gannett-cdn.com/media/2015/10/26/USATODAY/USATODAY/635814659782257641-USATSI-8885166.jpg", "http://videos.usatoday.net/Brightcove2/29906170001/2015/10/29906170001_4565759071001_video-still-for-video-4565732428001.jpg", "http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/7e50ef91225600d4a822f826d466e2ef39a39a00/c=53-0-735-682/local/-/media/2015/10/26/USATODAY/USATODAY/635814493552011311-fans.JPG", "http://videos.usatoday.net/Brightcove2/29906170001/2015/10/29906170001_4578870495001_thumbnail-for-video-4578829512001.jpg?pubId=29906170001", "http://videos.usatoday.net/Brightcove2/29906170001/2015/10/29906170001_4572513798001_4572488131001-th.jpg?pubId=29906170001", "http://www.indystar.com/videos/sports/nfl/colts/2015/10/25/74599514/", "http://videos.usatoday.net/Brightcove2/29906170001/2015/10/29906170001_4565658510001_4565642650001-th.jpg?pubId=29906170001", "http://www.gannett-cdn.com/-mm-/f8c1cb6c53e763b069a7e248a194b49b6b35d9d9/r=522&c=522x300/http/videos.usatoday.net/Brightcove2/29906170001/2015/10/29906170001_4572513797001_4572488131001-vs.jpg", "http://www.gannett-cdn.com/-mm-/e8061d6cb1daea82cfe4107e7ac038cd7014cc99/c=0-62-1653-2266&r=183&c=0-0-180-240/local/-/media/2015/10/26/USATODAY/USATODAY/635814627609722551-USP-NFL-INTERNATIONAL-SERIES-BUFFALO-BILLS-AT-JAC-77019112.JPG", "http://videos.usatoday.net/Brightcove2/29906170001/2015/10/29906170001_4568439708001_Colin-480.jpg", "http://www.gannett-cdn.com/-mm-/f8c1cb6c53e763b069a7e248a194b49b6b35d9d9/r=522&c=522x300/http/videos.usatoday.net/Brightcove2/29906170001/2015/10/29906170001_4567828105001_4567827416001-vs.jpg", "http://www.gannett-cdn.com/-mm-/fa61df53765e947e32b6db7ce0e6f72964df8af0/r=284x400/local/-/media/2015/10/26/USATODAY/USATODAY/635814627609722551-USP-NFL-INTERNATIONAL-SERIES-BUFFALO-BILLS-AT-JAC-77019112.JPG", "http://www.gannett-cdn.com/-mm-/f8c1cb6c53e763b069a7e248a194b49b6b35d9d9/r=522&c=522x300/http/videos.usatoday.net/Brightcove2/29906170001/2015/10/29906170001_4578870496001_video-still-for-video-4578829512001.jpg", "http://www.usatoday.com/story/sports/nfl/columnist/bell/2015/10/25/mike-zimmer-minnesota-vikings-teddy-adrian-peterson-lions/74603448/", "http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/c7bbd60cd353197719a6201e687c31359335359f/c=320-433-2438-2551/local/-/media/2015/10/25/USATODAY/USATODAY/635814043408082327-50-things-wk-7-DIGITAL.jpg", "http://www.gannett-cdn.com/-mm-/f8c1cb6c53e763b069a7e248a194b49b6b35d9d9/r=522&c=522x300/http/videos.usatoday.net/Brightcove2/29906170001/2015/10/29906170001_4578763242001_video-still-for-video-4578753948001.jpg", "http://www.gannett-cdn.com/-mm-/1e576a88511798c6ec5e836023073554e8fc0fdb/r=522&c=522x300/http/bcdownload.gannett.edgesuite.net/indianapolis/35547429001/201510/3840/35547429001_4577893606001_4577884413001-vs.jpg", "http://www.usatoday.com/videos/sports/nfl/2015/10/25/74581890/", "http://www.usatoday.com/videos/sports/nfl/2015/10/20/74269662/", "http://www.gannett-cdn.com/-mm-/c9f8a286a72dc1d72d9e67de3c0370d36df16c45/c=2-0-1498-1125&r=115x86&r=522&c=522x300/local/-/media/2015/10/19/USATODAY/USATODAY/635808393370119228-USATSI-8871027.jpg", "http://videos.usatoday.net/Brightcove2/29906170001/2015/10/29906170001_4570193096001_video-still-for-video-4570183263001.jpg"], "published": "2015-10-26T20:21:00.000+02:00", "crawled": "2015-10-26T21:10:56.692+02:00", "highlightTitle": ""}