{"organizations": [], "uuid": "f90917f74577af978213e390d0310b97d8f4266a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tnonline.com", "main_image": "", "site_section": "http://tnonline.com//sports/rss", "section_title": "Times News Sports", "url": "http://www.tnonline.com/2015/oct/16/tigers-clinch-d-11-berth", "country": "US", "title": "Tigers clinch D-11 berth", "performance_score": 0, "site": "tnonline.com", "participants_count": 1, "title_full": "Tigers clinch D-11 berth", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T23:00:00.000+03:00", "replies_count": 0, "uuid": "f90917f74577af978213e390d0310b97d8f4266a"}, "author": "psiwebtn", "url": "http://www.tnonline.com/2015/oct/16/tigers-clinch-d-11-berth", "ord_in_thread": 0, "title": "Tigers clinch D-11 berth", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Copyright 2015 By chuck hixsontnsports@tnonline.com \nYou might think that a team facing the possible end of their season would be a little tight coming into a must-win game. Instead, Northwestern’s field hockey team was singing its way through warm-ups prior to their game against rival Northern Lehigh. \nThe Tigers’ singing wasn’t bad, but their play was even better as they downed the Lady Bulldogs 3-1, putting themselves into the District 11 playoffs for the first time since 2011. \nThe game almost seemed like two separate games, with the Tigers controlling much of the first half and the Bulldogs (8-6-1 Colonial League, 8-8-1 overall) controlling much of the final 30 minutes. Ironically though, Northwestern (8-7-1, 8-9-1) did most of its damage in the second half. \nSenior Devon Nothstein gave Northwestern a 1-0 lead when she slipped a shot past goalkeeper Annie McIntyre with 10:24 to play in the first half. In the second half, Northern Lehigh came out firing and kept almost constant pressure on Northwestern goalkeeper Taylor Page, but Page and the Lady Tigers defense didn’t break and turned Northern Lehigh away time-after-time. \n“All year, we’ve really struggled to score. We haven’t had that standout scorer and it really comes down to finishing in the circle and I’ve stressed it over and over again, but it just didn’t happen for us today,” said Northern Lehigh coach Jess Frew. \nNorthwestern took advantage of a corner with 13:04 left to play when Courtney Page took the centering pass and snuck it past McIntyre to give Northwestern a little breathing room at 2-0. The insurance goal was just what Northwestern needed to give them a lift. \n“I played goalkeeper when I was in high school and college, so I know how that feels for Taylor being back there. It gives you a little more confidence, maybe not relief, but confidence that you’re moving forward, so it was good,” said Northwestern coach Lissa Opolsky said about the insurance goal. \nFrom there, the two teams traded goals, with Northwestern’s Haley Dietrich scoring on a penalty stroke and Northern Lehigh’s Cheyenne Mazzocca scoring with 6:14 to play. \nThe win cemented a turnaround for the Tigers against their rivals, who they tied 1-1 earlier in the season and also put Northwestern into districts. \n“Since I’ve been a freshman, we’ve never beaten Northern Lehigh and they really wanted this game because we’ve never beaten them before, so it was just a really big game for us,” said Courtney Page. “I’ve never been in postseason – none of us have ever been – so it’s just exciting to get there.” \nHOMEFIELD ADVANTAGE ... Northern Lehigh coach Jess Frew noted that playing on the grass at Northwestern is very different than the turf field that Northern Lehigh plays on at home. She also credited the excitement of Senior Day and Northwestern needing a win to get into districts as reasons for Northwestern’s play. \nCOLONIAL PLAYOFFS ... Both teams fell short of making the Colonial League playoffs, but like Northwestern, the Lady Bulldogs also qualified for districts.", "external_links": [], "published": "2015-10-16T23:00:00.000+03:00", "crawled": "2015-10-17T09:26:44.433+03:00", "highlightTitle": ""}