{"organizations": [], "uuid": "b91ae5b8e2cb1f18c627f7c3f198df34f7fb59a2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.idsnews.com", "main_image": "http://duvq7ua50whdw.cloudfront.net/20151014QyeoL4yWsx/dist/img/IDS-fb-icon.png", "site_section": "http://www.idsnews.com/section/sports", "section_title": "Sports | Indiana Daily Student", "url": "http://www.idsnews.com/article/2015/10/an-age-old-tradition-meets-a-new-opponent", "country": "US", "title": "An age-old tradition meets a new opponent", "performance_score": 0, "site": "idsnews.com", "participants_count": 1, "title_full": "An age-old tradition meets a new opponent | Indiana Daily Student", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T19:55:00.000+03:00", "replies_count": 0, "uuid": "b91ae5b8e2cb1f18c627f7c3f198df34f7fb59a2"}, "author": "Taylor Lehman", "url": "http://www.idsnews.com/article/2015/10/an-age-old-tradition-meets-a-new-opponent", "ord_in_thread": 0, "title": "An age-old tradition meets a new opponent", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "With Homecoming weekend quickly approaching, IU football is preparing for a new opponent.\nIn the wake of an age-old tradition in which the Hoosiers have played 102 games going on their 103rd, the team won’t be playing rivals Purdue, Michigan or even Michigan State.\nThey will be playing the Rutgers Scarlet Knights.\n“I think it’s a big opportunity,” IU associate athletics director Jeremy Gray said about IU’s match-up with Rutgers. “Both programs are looking to build, and it should be a good game.”\nSince joining the Big Ten in July of 2014, IU and Rutgers have played head-to-head one time, the first meeting in both programs’ histories.\nThe result?\nA 45-23 Scarlet Knights victory.\nOn Saturday, IU (4-1) and Rutgers (2-3) will ignite a new series within the Big Ten East, despite the newest member of the conference being from Piscataway, New Jersey.\n“They are a great addition to the conference,” Gray said. “They’ll be a divisional rival, and, with New York City being the fourth-largest IU alumni community, it works in reversal too when we go to play there.”\nWith a Homecoming football record of 44-52-6, IU has not had the success many teams find during the tradition, despite the larger crowds that arrive at Memorial Stadium.\n“It’s always one of our bigger games, no matter who the opponent is,” Gray said. “There’s usually always a bigger crowd there, and the atmosphere is always great. The crowd really helps in creating what Homecoming is.”\nLast season against Rutgers, former Hoosier running back Tevin Coleman ran for 307 yards and a touchdown, as the Hoosiers were without quarterback Nate Sudfeld.\nRutgers finished last season 8-5 under third-year coach Kyle Flood, and they were 11-2 in 2006 while under Greg Schiano for 11 years .\nThe program reached a height of seventh in the nation under Schiano before he left for the Tampa Bay Buccaneers of the NFL.\nSince Kyle Flood took over in 2012, the program has changed conferences from its original Big East to the American Conference and then to the Big Ten.\nIt also has gone 27-18 under its new coach, won just one of its three bowl games and kicked five players off the team due to home invasions and assaults cases.\nIU is a program with similarities to the Rutgers program in terms of suspensions and building, as it dismissed safety Antonio Allen from the program due to drug charges and suspended nine players in week one of the season due to undisclosed reasons.\nNow both schools are trying to work back to winning ways, as IU has a record of 4-2 and Rutgers a 2-3 record.\nGray said a tradition IU attempts every season on Homecoming weekend is to reunite teams or other groups with significance to the football program and have a ceremony during a break in the game.\nThis season, IU will reunite the 1945 team that went 9-0-1 under head coach Bo McMillin, and they will shade the 45 yard line a different color in honor of the year the team went undefeated.\n“It’s a really great tradition to have every year,” Gray said about Homecoming. “We always try to make it special, and, regardless of the opponent, it’s going to be a great game and a great time.”", "external_links": [], "published": "2015-10-16T19:55:00.000+03:00", "crawled": "2015-10-17T21:32:38.640+03:00", "highlightTitle": ""}