{"organizations": ["Blue Jays top Rangers"], "uuid": "f7be3bf0aea0bd2fa056ded899dc6c81726905b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.torontosun.com", "main_image": "http://storage.torontosun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297759445129_LARGE_BOX.jpg?quality=80&stmp=1444693718360&size=100x", "site_section": "http://www.torontosun.com/sports/rss.xml", "section_title": "Top Sports stories", "url": "http://www.torontosun.com/2015/10/12/blue-jays-top-rangers-to-force-decisive-game-5", "country": "CA", "title": "Blue Jays top Rangers to force decisive Game 5", "performance_score": 0, "site": "torontosun.com", "participants_count": 0, "title_full": "Blue Jays top Rangers to force decisive Game 5", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T02:43:00.000+03:00", "replies_count": 0, "uuid": "f7be3bf0aea0bd2fa056ded899dc6c81726905b3"}, "author": "", "url": "http://www.torontosun.com/2015/10/12/blue-jays-top-rangers-to-force-decisive-game-5", "ord_in_thread": 0, "title": "Blue Jays top Rangers to force decisive Game 5", "locations": ["TEX."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Report an error ARLINGTON, TEX. - \nGiven up for dead after losing their first two playoff games at home, the Blue Jays have pushed this American League Division Series to the limit with a two-game sweep of the Rangers in Texas, capped by an 8-4 pounding on Monday afternoon. \nThe Blue Jay offence erupted for 11 hits, including three home runs and four doubles, scoring early and often to drain any drama from this potentially season-ending game. \nLeading 7-1 in the fifth inning behind the knuckleballer R.A. Dickey, manager John Gibbons was taking no chances, bringing ace David Price out of the bullpen to keep the peace over three innings but that tactic almost backfired. \nPrice gave up six hits and three runs, all of them in the seventh inning when the Rangers got to within four runs of Toronto before Aaron Sanchez came out of the bullpen to strike out pinch-hitter Drew Stubbs to restore order. \nPrice threw 50 pitches and that leaves Marcus Stroman ready to face the Rangers in the deciding game Wednesday afternoon at the Rogers Centre. \nThe Blue Jays can become only the third team in history in 28 circumstances to lose the first two games of a five-game playoff series and still advance. \nJosh Donaldson, Chris Colabello and Kevin Pillar each hit a home run. That trio combined to go 6-for-11 with seven RBI. The Jays, as a team, came into this fourth game hitting .202 with three homers and 10 RBI in the series. \nThe Blue Jays came off the team bus swinging Monday. Five pitches into the game, Texas starter Derek Holland found himself down 2-0 after Ben Revere laid down a perfect bunt single and Donaldson followed with his second home run of the series. Before the inning was over, Colabello had made it 3-0 with his first-ever postseason homer and Holland had laboured through an 18-pitch gauntlet. Pillar’s home run, into the glove of David Price standing in the Toronto bullpen, made it 4-0 in the top of the second. \nWhen Donaldson walked and Bautista doubled to start the third, Rangers manager Jeff Bannister had seen enough of Holland and summoned Colby Lewis from the bullpen. Edwin Encarnacion’s fielder’s choice ground ball to shortstop brought home Donaldson but Bautista was out when he strayed too far off second base. Encarnacion then scored all the way from first on Colabello’s double. Colabello later scored on a Pillar single to make it 7-0. Six of those runs were charged to Holland’s account. \nMeanwhile, Dickey was on cruise control. Aside from a pair of singles each from No. 2 hitter Sin-Soo Choo and No. 3 man Adrian Beltre, Texas didn’t have any base runners through the first four innings. Choo came in from third on a Dickey wild pitch in the third inning to account for the Rangers first run. \nIn the fifth inning, after Robinson Chirinos’ one-out single and a couple of line drive outs, Gibbons went to the bullpen to get David Price for the last out of the inning. He threw one pitch and got the final out on a fly ball to centre.", "external_links": [], "published": "2015-10-13T02:43:00.000+03:00", "crawled": "2015-10-13T02:58:44.617+03:00", "highlightTitle": ""}