{"organizations": ["Detroit Lions", "Lions", "Minnesota Vikings", "Ford Field"], "uuid": "26fb4f276a4f99434af43ed1454272e225e9fee7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wxyz.com", "main_image": "http://media2.wxyz.com/photo/2015/10/25/GettyImages-494229426_1445800710487_25717993_ver1.0_640_480.jpg", "site_section": "http://www.wxyz.com/feeds/rssFeed?obfType=RSS_FEED&siteId=10017&categoryId=10004", "section_title": "Sports | WXYZ", "url": "http://www.wxyz.com/sports/vikings-at-lions", "country": "US", "title": "Vikings give Lions sixth loss of the season", "performance_score": 0, "site": "wxyz.com", "participants_count": 0, "title_full": "Vikings give Lions sixth loss of the season", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T01:13:00.000+02:00", "replies_count": 0, "uuid": "26fb4f276a4f99434af43ed1454272e225e9fee7"}, "author": "", "url": "http://www.wxyz.com/sports/vikings-at-lions", "ord_in_thread": 0, "title": "Vikings give Lions sixth loss of the season", "locations": ["Detroit", "Michigan"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Gregory Shamus", "Gregory"], "text": "Minnesota Vikings give Detroit Lions sixth loss of the season 4:04 PM, Oct 25, 2015 5 hours ago DETROIT, MI - OCTOBER 25: Joique Bell #35 of the Detroit Lions runs a second quarter pass reception while playing the Minnesota Vikings at Ford Field on October 25, 2015 in Detroit, Michigan. (Photo by Gregory Shamus/Getty Images) Gregory Shamus Image copyright 2015 Getty Images. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. Show Caption Previous Next \nDETROIT (AP) - Calvin Johnson came down with a catch in traffic near the goal line, and with the Detroit Lions trailing by 11, officials marked the star receiver down just short of the end zone. \nRather than challenge the spot — which would have at least stopped the clock at a point when every second was crucial — the Lions rushed to the line of scrimmage and snapped the ball. Matthew Stafford threw incomplete. \nTwo failed runs and an incomplete pass later, Detroit had turned the ball over on downs. \n\"We should've been able to get that thing in,\" coach Jim Caldwell said. \nThat frustrating sequence ended Detroit's last real hope in a game the Lions went on to lose 28-19 to the Minnesota Vikings on Sunday. After a promising first quarter in which Detroit scored touchdowns on its first two possessions, the Lions fell apart offensively, unable to block Minnesota's swarming pass rush. \nThe Lions (1-6) finished the first quarter with 160 yards of offense. They had 8 yards in the second period and minus-1 in the third. \n\"We just didn't block well enough. We didn't take care of some of our assignments that we had to take care of,\" Caldwell said. \"We were just inept for a stretch.\" \nStafford threw for 256 yards and two touchdowns but was sacked seven times. He also got X-rays on his left hand. \n\"I think it's fine,\" he said. \nThe Lions led 14-3 after Stafford threw a 1-yard touchdown pass to Johnson and a 7-yarder to Eric Ebron. After that, Detroit's protection problems made it difficult for the offense to do much of anything. \n\"It's tough when you're running a deeper route, and you look before you get out of your break, you see the DB kind of stop playing. That's tough,\" wide receiver Golden Tate said. \"We've just got to find a way to fix it. We can't point fingers by any means. It's going to take a collective effort.\" \nAdrian Peterson rushed for 98 yards on 19 carries as the Vikings (4-2) won an NFC North road game for the first time in three years. \nVikings rookie Stefon Diggs had six receptions for 108 yards, including a go-ahead, 36-yard score in the third quarter in which he leaped from just inside the 5 and landed in the end zone while securing the ball. \nPeterson had a season-long 75-yard run on the Vikings' next drive, but they stalled and settled for one of Blair Walsh's five field goals. \nWith 3:21 remaining, the Lions had the ball at their own 11, down 28-17. At that point, they had gained 4 yards since the end of the first quarter, but Stafford directed a quick drive all the way to the Minnesota 1. \nWhen Johnson caught the ball at the 1, the clock kept running and the Lions didn't challenge. \n\"It looked like they had a good spot,\" Caldwell said. \"We were obviously trying to get a score there as quickly as we possibly could, because of the time.\" \nDetroit seemed poised to score a touchdown before the 2-minute warning, and the Lions still had two timeouts left, but George Winn and Michael Burton were stopped on consecutive runs. It was the only carry of the game for each of them. \n\"Two of our power backs, two of our brutes that we usually work with in short yardage,\" Caldwell said. \"(Injured running back) Zach Zenner has usually been one of those guys. George is equally as capable and certainly Burton is, too. But we weren't able to get it in.\" \nAfter Stafford's incompletion on fourth down, the Vikings took an intentional safety to avoid having to punt out of their own end zone. \nMinnesota had not won a road game within the division since winning in Detroit on Sept. 30, 2012. \n\"We had to make adjustments after what they did to us on those first two drives,\" Vikings coach Mike Zimmer said. \"We found some things that worked well for us.\" Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-26T01:13:00.000+02:00", "crawled": "2015-10-26T06:01:21.494+02:00", "highlightTitle": ""}