{"organizations": [], "uuid": "45aa42b0c60ff2d1d5c62cd8de0efaace6680112", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/bf0d81004626e86d684959116eb6b666", "site_section": "http://www.news.com.au/sport/more-sports", "section_title": "More Sports | More Sports | Sports News and Results | News.com.au", "url": "http://www.news.com.au/sport/more-sports/gennady-golovkin-favourite-to-take-down-david-lemieux-at-madison-square-garden/story-fndukor0-1227572799511", "country": "AU", "title": "Ring KO king Golovkin rules supreme", "performance_score": 0, "site": "news.com.au", "participants_count": 1, "title_full": "Ring KO king Golovkin rules supreme", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T03:04:00.000+03:00", "replies_count": 0, "uuid": "45aa42b0c60ff2d1d5c62cd8de0efaace6680112"}, "author": "GRANTLEE KIEZA", "url": "http://www.news.com.au/sport/more-sports/gennady-golovkin-favourite-to-take-down-david-lemieux-at-madison-square-garden/story-fndukor0-1227572799511", "ord_in_thread": 0, "title": "Ring KO king Golovkin rules supreme", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Video Image Paul Upham: 'Golovkin an is unbelievable rising star' 3:00 Boxing: Paul Upham discusses Gennady Golovkin's upcoming bout with David Lemieux, which will take place at a sold out Madison Square Garden. Upham says that Golovkin is an unbelievable rising star.\nOctober 17th 2015 4 days ago /video/video.news.com.au/Sport/More Sports/ Gennady Golovkin weighs in before his bout against David Lemieux at Madison Square Garden.\nGRANTLEE KIEZA The Sunday Mail (Qld) IT’S Madison Square Garden, New York, the spiritual home of boxing and the normally affable Australian middleweight Daniel Geale has turned feral.\nHe’s fighting for his life against pound for pound the heaviest puncher in the world and with a primal snarl Geale unleashes his best punch of the bout — a booming straight right that crashes into the impassive face of Kazakhstan’s world champ Gennady Golovkin.\nIt is the kind of punch that helped Geale win a world championship and it would have dropped an ordinary fighter. But Golovkin is anything but ordinary and as he takes the full force of the blow right on his kisser he launches his own retaliatory strike that puts Geale flat on the canvas. Game over in Round 3.\nGolovkin, who has knocked out three more of the world’s best since then, has the best KO record in world boxing with 30 quick wins in 33 fights and though he has flown under the radar in the shadows of Floyd Mayweather and Manny Pacquiao he is now emerging as the ultimate big gun in the fight game.\nIn 375 fights as an amateur and professional and thousands more in sparring, he has never been stopped or knocked off his feet.\nThe smiling assassin will be launching the heavy artillery again at Madison Square Garden when he is favoured to overpower David Lemieux of Canada, in a fight that will unify the WBA and IBF world middleweight titles.\nLemieux has won 34 fights, 31 by KO, but it’s his two losses four years ago that make Golovkin a huge favourite against the Montreal mauler.\nReflecting on his brutal loss against Golovkin in July last year, Geale could only lament: “That was a tough day at the office.\n“Everybody can see he has immense power. Golovkin will be a guy who is going to be tough to beat. I’m not sure that there’s too many guys out there that are going to give him too much of a run.”\nGolovkin squares off against David Lemieux. Source: AFP\nGolovkin has won his past 20 fights by KO. He looks, talks and fights a bit like Australia’s great world champ Kostya Tszyu, though his punches are even weightier.\nHis pleasant manner outside the ring and his ferocious attack inside it have made him fans around the world and he recently featured in an Apple Watch television advertisement, one of the few top boxers to appear in a major advertising campaign in America.\nGolovkin’s last defeat was in the 75kg final at the Athens Olympics 11 years ago when he represented his native Kazakhstan. He was born to a Russian coalminer and a Korean mother and turned professional in 2006 in Germany. He is managed by the heavyweight Klitschko brothers.\nNow based in Los Angeles, Golovkin is creating as much drama before the cameras as a Hollywood action hero.\nTV: Main Event, from noon\n Ring KO king Golovkin rules supreme", "external_links": ["http://cdn.newsapi.com.au/image/v1/external?url=http%3A%2F%2Fcontent4.video.news.com.au%2Ffoxsports%2Fprod%2Farchive%2F2015%2F10%2F17%2FFSD_171015_PAUL_UPHAM_DESK.jpg&width=650&api_key=kq7wnrk4eun47vz9c5xuj3mc", "http://cdn.newsapi.com.au/image/v1/bf0d81004626e86d684959116eb6b666", "http://cdn.newsapi.com.au/image/v1/286ce8e85994b8dddfa4eacab2727dfc", "http://cdn.newsapi.com.au/image/v1/origin:fatwire.", "http://www.couriermail.com.au/sport/more-sports/gennady-golovkin-favourite-to-take-down-david-lemieux-at-madison-square-garden/story-fnii0hmo-1227572799511", "http://widgets.outbrain.com/outbrain.js"], "published": "2015-10-18T03:04:00.000+03:00", "crawled": "2015-10-20T18:29:36.124+03:00", "highlightTitle": ""}