{"organizations": [], "uuid": "ba1216541b8c2fa5b99bd743920fafbdead0dcc8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sportsnews.com.au", "main_image": "http://sportsnews.com.au/defaultimage.jpg", "site_section": "http://www.sportsnews.com.au/feed", "section_title": "Sports News Australia", "url": "http://www.sportsnews.com.au/nrl/sowards-faces-uncertain-future-at-penrith/159512", "country": "CA", "title": "Sowards’ faces uncertain future at Penrith", "performance_score": 0, "site": "sportsnews.com.au", "participants_count": 1, "title_full": "Sowards’ faces uncertain future at Penrith", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T05:28:00.000+03:00", "replies_count": 0, "uuid": "ba1216541b8c2fa5b99bd743920fafbdead0dcc8"}, "author": "AAP", "url": "http://www.sportsnews.com.au/nrl/sowards-faces-uncertain-future-at-penrith/159512", "ord_in_thread": 0, "title": "Sowards’ faces uncertain future at Penrith", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sowards’ faces uncertain future at Penrith   1:28 pm   \nJamie Soward’s future with Penrith looks uncertain, but the Panthers deny the ageing playmaker is being shopped around to rival NRL clubs. \nAfter an underwhelming 2015 campaign with the Panthers, in which they were in wooden spoon contention going into their final game, Soward was asked to consider retirement. \nAccording to a Fairfax report on Sunday, the 30-year-old was told he was free to leave and offered to several clubs including the Warriors, who instead chose to sign Cronulla veteran Jeff Robson. \nHowever Penrith general manager Phil Gould denied the former NSW State of Origin half was being pushed out the door. \nHe took to Twitter to hose down the rumours and while he confirmed he urged Soward to reassess his future, he said he was not being offered to other clubs. \nGould said Soward may have considered a fresh start at another club but he was not being made to feel unwelcome at the foot of the mountains. \n“6 weeks ago I had honest discussion with Jamie,” the Panthers supremo said. \n“He agreed he struggled in 2015 after several setbacks. \n“I advised that if he wasn’t 100% motivated to play, I prefer he retire to start a coaching career with Panthers. \n“Never at anytime did Panthers offer Jamie to other clubs.” \nGould said Soward was now “100% committed” to the Panthers for next season and emphasised he was a vital link in their side. \nSoward was beset by injury during 2015 as the Panthers fell from fourth in 2014 to 11th. \nWith both Jamie Soward and Peter Wallace struggling with injury over the last two seasons and coming to the end of their careers, the Panthers have moved to shore up their future in the halves. \nIvan Cleary’s team have recruited highly-rated New Zealand under-20s playmakers Te Maire Martin, from Wests Tigers, and Zach Dockar-Clay, from Parramatta. \nFullback Matt Moylan, touted as a future Origin representative, is also being sized up from a Darren Lockyer-like move from fullback into the halves.  ", "external_links": [], "published": "2015-10-11T05:28:00.000+03:00", "crawled": "2015-10-11T05:40:23.059+03:00", "highlightTitle": ""}