{"organizations": [], "uuid": "c6b52e32e7c08c50eda930fd0df402b23e37d6b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "http://images.tribuneindia.com/cms/gall_content/2015/10/2015_10$largeimg18_Sunday_2015_220336758.jpg", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/comment/two-plus-two-not-always-four/147553.html", "country": "US", "title": "Two plus two not always four", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "Two plus two not always four", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "c6b52e32e7c08c50eda930fd0df402b23e37d6b5"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/comment/two-plus-two-not-always-four/147553.html", "ord_in_thread": 0, "title": "Two plus two not always four", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "THE perceptions are more real than reality in influencing voting behaviour.’ BJP stakes are high in the Bihar elections. To stabilise its hold nationally, the BJP must win as it will impact the UP Assembly elections in 2017, and also the national elections in 2019. As such, the Prime Minister is leading the NDA’s charge from the front. On the other hand, Bihar Chief Minister Nitish Kumar is leading the Mahagathbandhan forces, the grand alliance of the JDU, RJD and Congress to defeat the BJP and its allies, making it a fight between Modi and Nitish Kumar. It is difficult to crystal-gaze the outcome in a caste-ridden state and politically well-informed electorate. Modi and other NDA leaders have invoked fear of “jungle raj” of Lalu Yadav’s era, and promised “vikas raj”. The announcement of huge investments in infrastructure in Bihar by Modi was decried by Nitish as an attempt to hurt the state’s pride and honour. Who carries conviction with the common voters the results alone will show. A close look at the results of earlier poll battles reveals that the socio-political developments 18-24 months prior to elections are crucial in shaping the public perception and influencing the outcomes (incumbency factors). The campaign period of short duration witnesses intense heat that consolidates and builds momentum (hawa) based on common perceptions built over a period prior to the polls. Though parties select candidates keeping in view the caste calculus and winnability, voters choose between two parties that are front-runners. And their choice is influenced heavily by their perceptions about these two parties. Take the case of the parliamentary elections in 2014. Riding on the anti-Congress wave, the BJP won a clear majority in the Lok Sabha and Modi emerged as the most popular and powerful PM of India. Media coverage of many scams, price rise, anti-corruption movement of Anna Hazare and indecisions of Manmohan Singh during UPA rule built mass anger against the Congress. Regional satraps like Mulayam Singh Yadav and others were, by themselves, not in the race for 7 Race Course and together they did not present a viable alternative to the Congress, thus paving the way for the BJP majority. This clearly demonstrated how perceptions influenced voting behaviour. The victory rath of the BJP moved on and the state Assembly elections that followed in Haryana, Maharashtra and Jharkhand also gave victory to the BJP. However, within 10 months, in February 2015, the Delhi Assembly polls resulted in not only unexpected, but also a magical victory to a two-year-old party, AAP, decimating both the Congress and the BJP, taking some shine off Modi. In Bihar elections, both the NDA and the grand alliance, the two main contenders, are promising “development agenda” and using the caste card to woo the voters. Nitish’s record on development and governance is well recognised and the BJP is not able to question as it was part of the Bihar success story. Over the years, many development initiatives were taken by the Central and state governments for poverty reduction and improving nutrition, health, education, water and sanitation, gender equity, to achieve development and growth with equity and social justice. A number of international development agencies like the World Bank, UNICEF, Asian Development Bank, and DFID also contributed in these development initiatives. Bihar turned around for the better under Nitish’s leadership. Literacy has improved by 16 per cent over the last decade (Census 2011), with an economic growth rate of 11.3 per cent in 2004-05 to 2008-09. A large number of women self-help groups (SHGs) have improved their economic wellbeing and empowered them. On the other hand, political developments over the last 16 months or so have, to some extent, dented Modi’s credibility and ability to deliver on promises he made during the 2014 elections. Caste is a reality in Indian politics, more so in Bihar. The caste arithmetic favours the grand alliance. In Bihar, the BJP, like the Congress earlier, has the support of the higher caste and Dalits, making it a winning combination. But the statement by the RSS chief to review the reservation policy has given a handle to pro-reservation leaders to whip up fears about the BJP, thereby strengthening the grand alliance. Pronouncements by senior BJP leaders, including Modi, that reservations will continue do not seem to carry conviction in light of RSS supremacy over the BJP, as was demonstrated by the recent presentation of the government ‘report card’ to RSS bosses at Madhyanchal Bhawan in Delhi. The apprehensions of the Muslim minority in Bihar about the BJP have strengthened following the Dadri lynching incident. In politics, two plus two need not always be four. The parties play the game of splitting vote banks by sponsoring/supporting, directly or indirectly, candidates who are popularly known as “vote katwa”. All attention is on Samajwadi Party supremo Mulayam Singh Yadav and his third front, generally interpreted as a good message for the BJP and its allies. But the breakup of the SP from the Janata Parivar and its decision to contest as part of the third front has provided a window for those unhappy with Lalu and Nitish to vote for the SP or any constituent of the front; splitting and damaging the Mahagathbandhan, but actually hurting the NDA as these votes could have gone to it. Is this master stroke of the ageing Pehlwan by design or accident? Asaduddin Owaisi’s party is not likely to make much headway in Bihar. Muslims will come to hear him, but would not vote for his candidates. The BJP has not announced its chief ministerial candidate, while Nitish is the face of the grand alliance. As the public discourse hovers around him, to have him as CM or not, the prevailing perceptions and available options before voters are indicative of the balance tilting in favour of the grand alliance. — The writer is chairman, International Media Institute, Gurgaon", "external_links": [], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-19T02:07:18.580+03:00", "highlightTitle": ""}