{"organizations": ["FOSJ", "Colorado Avalanche Information Center", "American Avalanche Association"], "uuid": "5718de86a751c428487743ec549d669e22fb9c21", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.durangoherald.com", "main_image": "http://durangoherald.com/storyimage/DU/20151022/SPORTS05/151029865/AR/0/AR-151029865.jpg", "site_section": "http://www.durangoherald.com/section/sports?template=RSS&mime=xml", "section_title": "Sports", "url": "http://www.durangoherald.com/article/20151022/SPORTS05/151029865/-1/sports&source=RSS", "country": "US", "title": "Series of avalanche-awareness classes offered", "performance_score": 0, "site": "durangoherald.com", "participants_count": 0, "title_full": "Series of avalanche-awareness classes offered", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T06:19:00.000+03:00", "replies_count": 0, "uuid": "5718de86a751c428487743ec549d669e22fb9c21"}, "author": "", "url": "http://www.durangoherald.com/article/20151022/SPORTS05/151029865/-1/sports&source=RSS", "ord_in_thread": 0, "title": "Series of avalanche-awareness classes offered", "locations": ["Logan Austin Brittany Cupp", "U.S.", "Logan Austin", "Silverton", "Denver", "Durango", "San Juan Mountains", "San Juans", "Colorado", "San Juan Mountain Tribe", "Berthoud Pass"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sethna", "Strand", "Brandon Mathis Herald", "John Strand", "Brittany Cupp", "Shan Sethna"], "text": "Series of avalanche-awareness classes offered Series of avalanche-awareness classes offered Local avalanche education has snowball effect By Brandon Mathis Herald staff writer Article Last Updated: Thursday, October 22, 2015 10:19pm Tweet Courtesy of FOSJ Students make observations of the snowpack in the San Juan Mountains during an on-snow field course provided by Friends of the San Juans. The nonprofit teaches avalanche awareness free of charge and has had an overwhelming reception since it began last year. Courtesy of FOSJ Students make observations of the snowpack in the San Juan Mountains during an on-snow field course provided by Friends of the San Juans. The nonprofit teaches avalanche awareness free of charge and has had an overwhelming reception since it began last year. W inter is on its way, and according to weather forecasters, it’s supposed to be a big one. That means big fun for skiers and snowmobilers in the backcountry, and it also means more of something Colorado is known for: avalanches. When John Strand of Durango founded Friends of the San Juans last year, a nonprofit organization that teaches public avalanche awareness courses free of charge, he didn’t know it would take Durango by storm. Formal avalanche training can be costly, and all too often, zealous winter lovers find themselves in deep snow without the knowledge and skills to stay safe. With the help of volunteers and professional avalanche educators, Strand aimed to change that. With several classroom style lectures, workshop forums and even on-snow training sessions, FOSJ has been deemed a success. “We feel our first season made a big impact,” Strand said. “We had over 250 people attend classroom sessions and over 40 people attend on-snow clinics.” In fact, the organization made such an impact the American Avalanche Association now recognizes it as an official U.S. Avalanche Course Provider. This isn’t Strand’s first romp in the snow. About 12 years ago, he co-founded a similar project near Denver called Friends of Berthoud Pass. To this day FOBP celebrates a flourishing membership, and current Executive Director Shan Sethna said demand grows every year. “We attract an average of 100 people per session, and we do an average of 12 sessions per year,” Sethna said. “Even with 12-plus classes, inevitably we’re asked to do more.” As the snow has already started to fly in the San Juans, FOSJ has already expanded its workshop courses for this year, and is also offering a snowmobile specific class. “We found many new backcountry users, as well as more experienced users benefit from not just gaining the knowledge, but being able to use and practice skills among peers,” he said. The group provides a medium for the backcountry community. Strand said the organization comes around full circle. “In turn, these newcomers get involved in avalanche education through FOSJ, and end up becoming a volunteer for us to mentor a new group of folks. This peer-based education model loops back around and keeps people involved in avalanche education.” This year FOSJ will be facilitating two youth outreach programs. Know Before You Go, in conjunction with the Colorado Avalanche Information Center, provides free avalanche education for middle and high school students, and The San Juan Mountain Tribe, founded by two recipients of the Joe Philpott/Peter Carver Avalanche Education scholarship, targets individual youths. As FOSJ continues to grow, you might say it’s had a snowball effect. “Being a volunteer-based organization, we are able to hone our skills and learn by teaching – mentoring newcomers into the basics of smart backcountry travel,” Strand said. All FOSJ courses are free to the public. Tweet Courtesy of Logan Austin Brittany Cupp in deep snow during a backcountry snowboard tour of Velocity Basin near Silverton. Organizations like Friends of the San Juans help students better understand avalanche terrain and mechanics through its ongoing winter courses. Courtesy of Logan Austin Brittany Cupp in deep snow during a backcountry snowboard tour of Velocity Basin near Silverton. Organizations like Friends of the San Juans help students better understand avalanche terrain and mechanics through its ongoing winter courses.", "external_links": [], "published": "2015-10-23T06:19:00.000+03:00", "crawled": "2015-10-23T09:04:50.293+03:00", "highlightTitle": ""}