{"organizations": [], "uuid": "e72acbe1050b3b0ff44d91976e950c96a8dfc3b9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-5626bda6/turbine/sns-201510200000--tms--travelpkctnxf-b20151020-20151020", "site_section": "http://www.chicagotribune.com/", "section_title": "Chicago Tribune: Chicago breaking news, sports, business, entertainment, weather and traffic - Chicago Tribune", "url": "http://www.chicagotribune.com/lifestyles/travel/sns-201510200000--tms--travelpkctnxf-b20151020-20151020-column.html", "country": "US", "title": "$69 to Europe? Don&apos;t plan your trip just yet", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "$69 to Europe? Don&apos;t plan your trip just yet - Chicago Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T01:18:00.000+03:00", "replies_count": 0, "uuid": "e72acbe1050b3b0ff44d91976e950c96a8dfc3b9"}, "author": "Ed Perkins", "url": "http://www.chicagotribune.com/lifestyles/travel/sns-201510200000--tms--travelpkctnxf-b20151020-20151020-column.html", "ord_in_thread": 0, "title": "$69 to Europe? Don&apos;t plan your trip just yet", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Unless you've been sleeping the last few weeks, you probably saw those headlines about Norwegian Air's proposal to offer $69 flights to Europe next year. But if you think that means you can fly round-trip to Europe for $138, fuhgeddaboudit. Norwegian's boss, Bjorn Kjos, rivals Ryanair's Michael O'Leary in the ability to grab headlines, but, as with Ryanair, somehow the final bill is always a lot higher than the figure in the headline.\nWhat's the matter with $69 fares? Let's take a look.\nNorwegian says it can undercut the giant lines by flying to and from smaller airports with low costs — from Westchester County or Bradley field in Connecticut, for example, to smaller European destinations such as Edinburgh and Bergen. But the facts are that airport costs don't have enough impact to allow such drastic fare reductions. The costs to an airline to operate from a big U.S. airport, expressed as cost per enplaned passenger, range from a low of $1.33 at Charlotte to a high of $30 at Newark. Even compared with Newark, it's hard to see how a remote U.S. airport could offer an operating cost advantage more than $25 per flight or so.\nAlthough most midsize and even small European airports typically have permanently staffed customs and immigration facilities, small U.S. airports typically do not. And if an airport does not have a permanently staffed facility to accommodate an international flight, the airport has to pay the Customs and Border Protection Agency to bring in personnel from some other airport or office — a charge that the airport passes on to any airline that requires the service.\nFor airports serving long-haul airline operations, big-to-big is a winner, and new planes such as the 787 and extended-range 737s and 320s make small-to-big or big-to-small increasingly attractive to airlines, but at least so-far, small-to-small hasn't worked out for any line. In the United States, Norwegian's best bets are midsized airports that don't currently have transatlantic flights, such as Bradley, and small airports within big metro markets, such as Westchester. But for access to New York City, Long Island-MacArthur (Islip) or Stewart Field would probably be better bets than Westchester.\nNorwegian says it will have lower personnel costs — probably true — which is a primary reason for opposition by U.S. airlines. The U.S. giants are already being squeezed at the top end by the opulent and labor-intensive business- and first-class services on the Gulf carriers, and the last thing they want is to be squeezed at the bottom end, too.\nEven if Norwegian offers $69 fares, chances are they will apply to only about 10 percent or so of the seats -- the minimum the Dept. of Transportation requires to avoid charges of bait and switch. Norwegian admits that the average fare would be somewhere near $300 round-trip, and it's currently charging around $500 for similar flights. Add in the fees for practically everything, and Norwegian's price advantage is a lot less than you'd initially think. The same factors applied when Wow airlines promoted $99 fares to Europe: The true round-trip costs were a lot more than $198.\nAll in all, Norwegian has the airplanes and the savvy to expand its transatlantic business substantially. And that expansion may well be on routes with insufficient traffic to interest the giant lines. But, as Allegiant has shown, airlines quickly run out of feasible \"small\" markets. You can expect to see Norwegian easing its way into more service to London, Paris and Frankfurt, too. Don't expect to pay less than $200 for a round-trip to Europe.\nBut if Norwegian goes ahead with its plans, you can expect to pay less than the giant lines charge. Peak-season fares in the $500 to $600 range would be attractive, especially because Norwegian's economy service is competitive with the giants: It's not a transatlantic version of Spirit. So if you're considering a trip to Europe next summer, keep your eye on Norwegian for what may be some great deals, just don't expect any miracles.\n(Send e-mail to Ed Perkins at eperkins(at)mind.net. Perkins' new book for small business and independent professionals, \"Business Travel When It's Your Money,\" is now available through www.mybusinesstravel.com or www.amazon.com )\n(c) 2015 TRIBUNE CONTENT AGENCY, LLC.\n Europe Travel", "external_links": ["http://www.trbimg.com/img-5626bda6/turbine/sns-201510200000--tms--travelpkctnxf-b20151020-20151020"], "published": "2015-10-21T01:18:00.000+03:00", "crawled": "2015-10-21T02:11:36.412+03:00", "highlightTitle": ""}