{"organizations": ["Durango Herald", "Wolverines", "Joe Fries Share T", "Monte Vista Bayfield", "Pirates", "Monte Vista"], "uuid": "95a790d4ed93b01c4afed78efe500470fcc9ad73", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.durangoherald.com", "main_image": "http://www.durangoherald.com/img/dh_200.png", "site_section": "http://www.durangoherald.com/section/sports?template=RSS&mime=xml", "section_title": "Sports", "url": "http://www.durangoherald.com/article/20151017/SPORTS03/151019662/-1/sports&source=RSS", "country": "US", "title": "Bayfield volleyball better every day, beats Monte Vista", "performance_score": 0, "site": "durangoherald.com", "participants_count": 0, "title_full": "Bayfield volleyball better every day, beats Monte Vista", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T06:44:00.000+03:00", "replies_count": 0, "uuid": "95a790d4ed93b01c4afed78efe500470fcc9ad73"}, "author": "", "url": "http://www.durangoherald.com/article/20151017/SPORTS03/151019662/-1/sports&source=RSS", "ord_in_thread": 0, "title": "Bayfield volleyball better every day, beats Monte Vista", "locations": ["Pagosa Springs", "Alamosa", "Bayfield"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Foutz", "Sydney Gabbard", "Brooke", "Maddi Foutz", "Brooke Kudelski", "Courtney Bayles", "Terene Foutz", "Kudelski", "Gabbard", "Pagosa", "Maddi", "Bayfield", "Bayles"], "text": "Bayfield volleyball better every day, beats Monte Vista Bayfield volleyball better every day, beats Monte Vista Bayfield wins third match in a row By Joe Fries Share T he young Bayfield volleyball team keeps improving as the season goes on. The Wolverines (8-6, 4-1 Intermountain League) notched their third consecutive victory Saturday with a 3-0 sweep of Monte Vista, 25-23, 25-19, 25-14. Maddi Foutz led the way for the Wolverines. She had a double-double with 13 kills, 10 digs and added four aces. It is her fourth double-double this season. Brooke Kudelski also had 12 kills, five digs and four aces. “Brooke and Maddi were attacking with precision; they were courageous with their hits,” Bayfield head coach Terene Foutz said in a phone interview with The Durango Herald. “They just aren’t hesitating, and a big part of that is the work of our setters. They’ve become so reliable.” The setters coach Foutz praised are Courtney Bayles and Sydney Gabbard. The two set up Kudelski, Maddi Foutz and the rest of the team for success all day against Monte Vista. Gabbard finished the day with 15 assists and Bayles had 14. Bayfield has struggled out of the gate this year but has gotten better with every point that goes on. This match was no different as the first set was a close one and the last was a dominant 25-14 rout for the Wolverines. “We had some lulls early but the girls are starting to recognize when things aren’t right,” the coach said. “They’re seeing things they weren’t seeing before and they’re getting right back to playing Bayfield volleyball.” The Wolverines are in second place in their league, behind a 16-2 Alamosa team. Bayfield will try to keep the momentum going at 6 p.m. Tuesday in Pagosa Springs. Bayfield beat the Pirates earlier this season. “It took a really good match from us last time to beat Pagosa,” coach Foutz said. “They’re senior loaded, and it’ll take another solid performance to do it again.”", "external_links": [], "published": "2015-10-18T06:44:00.000+03:00", "crawled": "2015-10-18T13:07:51.865+03:00", "highlightTitle": ""}