{"organizations": [], "uuid": "675337e98b88fa4464b6cc950630bdd82cb48125", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kentucky.com", "main_image": "http://media.kentucky.com/smedia/2015/10/13/17/04/13XMdv.AuSt.79.jpeg", "site_section": "http://www.kentucky.com/281/index.rss", "section_title": "Kentucky.com -- Sports Columnists", "url": "http://www.kentucky.com/2015/10/13/4085471/spurriers-greatest-hits-head-ball.html", "country": "US", "title": "Spurrier's greatest hits: Head Ball Coach at his snarkiest when it came to Kentucky", "performance_score": 0, "site": "kentucky.com", "participants_count": 1, "title_full": "Spurrier's greatest hits: Head Ball Coach at his snarkiest when it came to Kentucky", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T23:57:00.000+03:00", "replies_count": 0, "uuid": "675337e98b88fa4464b6cc950630bdd82cb48125"}, "author": "mstory@herald-leader.com (Mark Story)", "url": "http://www.kentucky.com/2015/10/13/4085471/spurriers-greatest-hits-head-ball.html", "ord_in_thread": 0, "title": "Spurrier's greatest hits: Head Ball Coach at his snarkiest when it came to Kentucky", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Order a reprint of this story \nJared Lorenzen shakes hands with Florida Head Coach Steve Spurrier after the game as the University of Kentucky played football at the University of Florida in Gainesville Fl, September 23, 2000. This is second half action CHARLES BERTRAM — LEXINGTON HERALD LEADER Related Stories: John Clay's notes: Spurrier a good quote, a bad quitter \nIn Steve Spurrier's farewell news conference as South Carolina head football coach Tuesday, the last topic he discussed was Kentucky. \n\"The Kentucky game was as good an atmosphere as almost any we've had, I think,\" the Head Ball Coach said of the Gamecocks' 26-22 home loss to UK on Sept. 12. Making a noise that conveyed disgust, Spurrier then added \"We messed that one up and didn't win it.\" \nSpurrier then left the podium. \nAcross the years, no coach was better at trolling opponents than \"Steve Superior.\" Here is some of the vintage snark he directed at Kentucky: \n2011 \nUK experienced an all-systems meltdown in Columbia while being drubbed 54-3 by South Carolina. Kentucky's final offensive stat line was brutal: nine punts, six turnovers, six first downs. \nSaid Spurrier: \n\"Kentucky has a heck of a punter, I know that.\" \n2009 \nRushing from the Wildcat formation, Randall Cobb repeatedly gashed the South Carolina defense. Yet with the Cats down 28-26 and going for a tying two-point conversion, UK inexplicably did not have Cobb run the ball. \nSaid Spurrier: \n\"We're all happy they didn't put that running quarterback in there, Randall Cobb. I'm glad they didn't use him on that (two-point try). We couldn't tackle him.\" \n2007 \nAfter South Carolina beat Georgia, Gamecocks fans were in full celebratory mode. Spurrier put things in perspective. \nSaid Spurrier: \n\"It wasn't like (Georgia) was some big, powerful team ... Kentucky and Vandy beat 'em last year.\" \n2007 \nAt SEC Media Days, Spurrier reflected back on the 2006 season: \nSaid Spurrier: \n\"We thought we did something big when we beat Clemson — then Kentucky beat them, too.\" \n2000 \nWith Kentucky hopelessly behind Florida in the fourth quarter, Spurrier watched as Hal Mumme's UK offense continually threw statistics-padding passes. The Head Ball Coach finally snapped, and ordered a last-second bomb — which went for the final touchdown in a 59-31 Gators win. \nSaid Spurrier: \n\"I guess they were upset about that pass. Well, I called it. They were padding their stats and I decided we were going to pad ours. Because ours were sufferin.' If Kentucky wants to be mad about it, we'll be up in Lexington next year and they can do something about it then.\" \n(2001 in Lexington: Florida 44, Kentucky 10) \n1997 \nWith Kentucky hopelessly behind Florida in the second half, Spurrier watched as Hal Mumme continually called for onside kicks after UK touchdowns that were meaningless to the game's outcome — a 55-28 Gators win. \nSaid Spurrier: \n\"If Hal's defense doesn't get any better, he'll have to start kicking those every time.\" \n1995 \nFor his own reasons, Spurrier seemed to take special glee in cluster-bombing Bill Curry-coached UK teams. In 1993, Florida obliterated UK 73-7 in Gainesville. The next season, UK \"only\" lost to the Gators 42-7. Afterward, a reporter asked Spurrier if he thought Kentucky had improved. \nThe Head Ball Coach contorted his face in a sideways manner that suggested a man sucking on a lemon while a skunk walked by \nSaid Spurrier: \n\"Well, they couldn't run the ball. And you could see, they can't pass it. Better? I don't know that I saw that.\" Mark Story: (859) 231-3230. Email: mstory@herald-leader.com. Twitter: @markcstory. Blog: markstory.bloginky.com.", "external_links": [], "published": "2015-10-13T23:57:00.000+03:00", "crawled": "2015-10-14T04:51:05.404+03:00", "highlightTitle": ""}