{"organizations": [], "uuid": "2d3aaa770672b2c4ff9694f6b6b4f8049455e06f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.capecodtimes.com", "main_image": "http://www.capecodtimes.com/Global/images/head/nameplate/fb/capecodtimes_200x200.png", "site_section": "http://www.capecodtimes.com/sports/high-school?template=rss&mime=xml", "section_title": "Local Sports - capecodtimes.com", "url": "http://www.capecodtimes.com/article/20150930/SPORTS/150939951/101036?rssfeed=true", "country": "US", "title": "School roundup: Lions roar back to defeat Bishop Connolly in five", "performance_score": 0, "site": "capecodtimes.com", "participants_count": 1, "title_full": "School roundup: Lions roar back to defeat Bishop Connolly in five", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T06:30:00.000+03:00", "replies_count": 0, "uuid": "2d3aaa770672b2c4ff9694f6b6b4f8049455e06f"}, "author": "Cape Cod Times sports@capecodonline.com", "url": "http://www.capecodtimes.com/article/20150930/SPORTS/150939951/101036?rssfeed=true", "ord_in_thread": 0, "title": "School roundup: Lions roar back to defeat Bishop Connolly in five", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Sep. 30, 2015 at 10:30 PM By Cape Cod Times Posted Sep. 30, 2015 at 10:30 PM » Social News HYANNIS - Junior Kaia Whiteley knocked down 12 kills and added three blocks to help the St. John Paul II Lions volleyball team recover from a two game deficit and beat Bishop Connolly 21-25, 9-25, 27-25, 25-21, 15-12 on Wednesday evening. After dropping the first two games St. John Paul II (6-4) came together as a team, determined to give their home fans a victory. The Lions used scrappy play, communication and some strong service runs to battle back to take the next three games en route to the win. Senior Sam Montalto added five kills to the St. John Paul II offense while sophomore Kali Tanguay sparked the defense with eight digs. Junior Casey Sullivan added five digs defensively while Grace Kelliher added four digs and freshman Delaney Halliday and junior Allison Santos added a pair of digs each. Fairhaven 3, Bourne 2: Aly Hickey spread the offense with 36 assists while Miranda Partosan sparked the offense with 13 kills in a loss for the Canalmen against the Blue Devils, 25-18, 22-25, 16-25, 28-26, 14-16 in Bourne. Hickey also led a strong defensive charge for Bourne (6-2, 5-2 South Coast Conference) with 23 digs while Leah Hidenfelter also had 23 digs for the Canalmen. Tina Ruggeri and Nicole Gresh added 17 digs each as Bourne used its strong defense and consistent offence to take the first and third sets. The Canalmen found themselves out of their normal flow in games 2, 4 and 5 however and Fairhaven (7-1, 6-1 SCC) used strong serving to earn the win. Kacey McKenna led the Blue Devils with 18 kills. Rain wipes out rest of local slate: Besides the three volleyball matches that took place on Wednesday evening, the entire schedule of local outdoor events was postponed due to the heavy rains. With either scheduling conflicts the rest of the week or the fact that the weather isn’t likely to improve much over the next few days, most of the games have not been rescheduled as of yet. There are over 30 events scheduled today with weather possibly impacting those as well. As far as Friday’s football slate, there were no changes as of Wednesday night. “We’re trying to put a plan in place,” said Falmouth football coach Derek Almeida, who’s Clippers host Nauset at Guv Fuller Field. “We practiced indoors today. I was over at the field and it was in pretty good shape. It does drain well.” Almeida said the school has reached out to Nauset to discuss contingency plans, which included having an earlier start Friday. “We want to play Friday night,” said Almeida. “The weather may not be any better on Saturday or Sunday.” Both Mashpee, Monomoy and Sandwich are playing on turf fields, so in all likelihood their games will go on as scheduled. The Sharks and Blue Knights are at home while the Falcons travel to Cohasset in a key South Shore League Small contest. By Cape Cod Times", "external_links": [], "published": "2015-10-01T06:30:00.000+03:00", "crawled": "2015-10-02T09:32:28.485+03:00", "highlightTitle": ""}