{"organizations": [], "uuid": "a9fef38ea4e841bedcc6b46dd68312748ac69557", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.oregonlive.com", "main_image": "http://imgick.oregonlive.com/home/olive-media/width620/img/oregonian/photo/2015/10/09/18936244-large.jpg", "site_section": "http://www.oregonlive.com/", "section_title": "Oregon Local News, Breaking News, Sports &amp; Weather - OregonLive.com", "url": "http://www.oregonlive.com/opinion/index.ssf/2015/10/umpqua_shooting_obamas_visit.html", "country": "US", "title": "Umpqua shooting, Obama's visit to Roseburg and the NRA: Letters to the Editor", "performance_score": 0, "site": "oregonlive.com", "participants_count": 8, "title_full": "Umpqua shooting, Obama's visit to Roseburg and the NRA: Letters to the Editor | OregonLive.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T15:00:00.000+03:00", "replies_count": 8, "uuid": "7aed903efff0dc8a37e8deda5bafd7e4553fcdc8"}, "author": "Letters to the editor", "url": "http://www.oregonlive.com/opinion/index.ssf/2015/10/umpqua_shooting_obamas_visit.html#post-0", "ord_in_thread": 0, "title": "Umpqua shooting, Obama's visit to Roseburg and the NRA: Letters to the Editor", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Roseburg shooting: Regarding \"With concealed-carry law, gun-free zones really aren't,\" (Oct. 3): This article states that gun-free zones are not necessarily gun free because people may come onto the property with a gun if they have a concealed-firearms license, suggesting that if there were no concealed carry permits, gun-free zones would work. But how many people who have concealed carry permits commit gun violence? I would suggest it would be difficult or impossible to find few, or any. Perhaps if there were more people with concealed carry permits, these shooters could be stopped before they could carry out their rampage. At Umpqua Community College, if Chris Mintz (the man who was shot seven times trying to stop the gunman) had a gun, maybe, just maybe he could have prevented most of the killings.\nGerald Montgomery\nSouthwest Portland\n•\nRoseburg shooting: No offense to the people of Roseburg, but the elaborate security precautions taken to put the president into a meeting with families of the Umpqua Community College casualties — closing streets and highways, scores of armed guards, helicopters and armored cars, back door entries — seemed warranted after watching men and women here and there with pistols at their hips. It might be their right to be \"armed\" in front of the president, but who can we trust? Not an eloquent protest.\nKeith Tillstrom\nSoutheast Portland\n•\nRoseburg shooting: The National Rifle Association does not represent gun owners; it represents gun manufacturers and has done a brilliant job of turning gun owners into radical, single-issue voters in order to pressure legislators to do the manufacturers' bidding. Gun manufacturers do not care about safety, or how many people are killed or wounded by guns, or the good of society; they only care about profits. They want to sell more guns to more people no matter the consequences.\nLeslie Waygren\nNortheast Portland", "external_links": [], "published": "2015-10-12T15:00:00.000+03:00", "crawled": "2015-10-12T18:15:33.606+03:00", "highlightTitle": ""}