{"organizations": [], "uuid": "6839fcb1362f856b10523fc781617a64f87c6d8c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.torontosun.com", "main_image": "http://storage.torontosun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297591572580_LARGE_BOX.jpg?quality=80&stmp=1445715346382&size=100x", "site_section": "http://www.torontosun.com/sports/horse-racing", "section_title": "Horse Racing | Sports | Toronto Sun", "url": "http://www.torontosun.com/2015/10/24/blue-jays-manager-john-gibbons-certainly-no-dumb-ass", "country": "CA", "title": "Blue Jays manager John Gibbons certainly no 'dumb-ass' | The Beezer | Blue Jays", "performance_score": 0, "site": "torontosun.com", "participants_count": 1, "title_full": "Blue Jays manager John Gibbons certainly no 'dumb-ass' | The Beezer | Blue Jays", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T01:20:00.000+02:00", "replies_count": 0, "uuid": "6839fcb1362f856b10523fc781617a64f87c6d8c"}, "author": "torontosun.com", "url": "http://www.torontosun.com/2015/10/24/blue-jays-manager-john-gibbons-certainly-no-dumb-ass", "ord_in_thread": 0, "title": "Blue Jays manager John Gibbons certainly no 'dumb-ass' | The Beezer | Blue Jays", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "KANSAS CITY - The visiting manager's office at Kauffman Stadium is decorated with posters of some of the great bench bosses of Major League Baseball.\nThere's Whitey Herzog, Sparky Anderson, Tommy Lasorda, Frank Robinson, Cito Gaston, Tony La Russa ... the list goes on.\nAnd while nobody is going to put John Gibbons on that list, at least not yet, the Blue Jays manager was asked Friday prior to Game 6 of the ALCS if guiding his team into the post-season will give his reputation as a manager a boost. That is, now that he had made it into the post-season, and ascended to another level in terms of where he stands as a manager?\nIs he now one of the \"elite\" managers of Major League Baseball?\n\"You mean I won't be the dumb-ass anymore?\" Gibbons answered in typical self-deprecating fashion, cracking up reporters inside the office.\n\"I don't know what the perception will be,\" he continued. \"But you know (making the playoffs) carries a lot of weight, I'm sure, in some circles. But can you really control that? You know, truthfully, I'm not looking for that. It's been a great year for me with these guys and we still think we're good enough to win it all.\"\nGibbons is a manager that, even in his own city, never seems to get a lot of credit when his team wins, but takes a ton of heat when they lose.\nEven now that the Jays have made it deep into the ALCS, he seems to have more detractors than supporters. Perhaps it's his Texas 'good old boy' demeanor and his laid-back style of managing.\nWhatever the case, he never seems to get the benefit of a doubt. And to baseball people, that's wrong.\nA number of big league managers -- Buck Showalter, Joe Torre, Ned Yost here in Kansas City -- have commented about how good a manager they believe Gibbons is and how he doesn't get his due. Sort of like Gaston all over again. Now that the Jays have finally made the playoffs for the first time since 1993, that might finally change. But don't count on it.\nRogers broadcaster Buck Martinez, who both played for and managed the Blue Jays, believes it's time that Gibbons' detractors got with the program.\n\"I think John has made some of the best moves of his managerial career during this post-season,\" said Martinez. \"Like that decisive decision on (R. A.) Dickey in Texas, to get him out of the game and kind of stop of the momentum.\"\nIn Game 4 of the ALDS, Gibbons pulled Dickey after 4.2 innings -- thereby taking away any chance the veteran right-hander had of picking up the win. With Rangers outfielder Shin-Soo Choo -- who was 2-for-2 against Dickey that day -- coming up, Gibbons pulled his knuckleballer for left-handed starter David Price, who promptly got Choo to line out on the first pitch. The Jays managed to hold on for the win, but Gibbons was roundly criticized anyway -- for taking away Dickey's chance for a win and for pitching Price too much.\nMartinez said it's wrong for people to think that Gibbons is just some bumpkin sitting in the dugout waiting for his big guys to hit home runs.\n\"I think people don't understand how fast and furious the action is in the dugout during the course of a game,\" said Martinez. \"When people criticize him for some of the moves in the bullpen during the post-season, they didn't realize that (Aaron) Loup wasn't available, he was gone, and some of the pitchers were down because of their work load.\n\"I think John has done a terrific job in this postseason and, for the course of the season, he's done a great job, as well.\n\"He had a team that wasn't real good until the trade deadline and then they got pretty good and he let them play. He made some subtle moves -- I thought the move with Chris Colabello, putting him in the fifth spot ahead of Tulowitzki when Troy was coming back from that injury -- was a stroke of genius and Chris has had nothing but good at-bats during the entire series. And now Edwin (Encarnacion) is getting a few more opportunities than he did because Colabello is there and Tulowitzki's bat is coming on since he's dropped down in the sixth spot.\"\nMartinez said it's unfortunate that so many people -- especially on social media -- have the impression that Gibbons is a subpar manager, who doesn't deserve to be mentioned in the same breath with some of the best in baseball.\n\"So much stock is put into the social media when, in fact, if those same people ever had a chance to meet John Gibbons one-on-one, they would have a totally different opinion of what kind of man he is,\" said Martinez.\nSitting back in his chair in the visiting manager's office, Gibbons said what people think of him doesn't really matter, as long as his players are on board.\nAnd so far, they have been.\nSponsored Links See All Sponsored Links\nThe Beezer\nBlue Jays manager John Gibbons certainly no 'dumb-ass'\nBy Steve Buffery , Toronto Sun First posted: Saturday, October 24, 2015 02:20 PM EDT | Updated: Saturday, October 24, 2015 03:20 PM EDT\nThe visiting manager's office at Kauffman Stadium is decorated with posters of some of the great bench bosses of Major League Baseball.\nThere's Whitey Herzog, Sparky Anderson, Tommy Lasorda, Frank Robinson, Cito Gaston, Tony La Russa ... the list goes on.\nAnd while nobody is going to put John Gibbons on that list, at least not yet, the Blue Jays manager was asked Friday prior to Game 6 of the ALCS if guiding his team into the post-season will give his reputation as a manager a boost. That is, now that he had made it into the post-season, and ascended to another level in terms of where he stands as a manager?\nIs he now one of the \"elite\" managers of Major League Baseball?\n\"You mean I won't be the dumb-ass anymore?\" Gibbons answered in typical self-deprecating fashion, cracking up reporters inside the office.\n\"I don't know what the perception will be,\" he continued. \"But you know (making the playoffs) carries a lot of weight, I'm sure, in som\nAbout the author Steve Buffery Steve Buffery's Blog Follow Steve Buffery on Twitter Other Stories David Price open to returning to Blue Jays\nKANSAS CITY - David Price was asked point blank if he will be back with the Blue Jays next year.\n0\nBlue Jays fans get their noise on\nThese certainly are not Dave Winfield’s fans.\n0\nSee more from Steve Buffery »\nTop stories Popular Latest Videos Anthopoulos expected to return to Jays next season: Sources\n0\nMarkham widow's life ruined by con artist neighbour\n0\nNo winning ticket for Friday night's $50-million Lotto Max jackpot\n0\nBlue Jays' magical 2015 run comes to end\n0\nCity's long-term disability benefits hit $46 million this year\n0\nPolice: 3 dead, 22 injured after vehicle crashes into Oklahoma State homecoming parade\n0\nMaureen O'Hara, spirited star of 'Miracle on 34th Street,' 'The Quiet Man,' dies at 95\n0\nPatricia hits Mexico's Pacific coast, downgraded to depression as it travels inland\n0\nArgos have two more games to turn it around\n0\nLandmarks go blue for United Nations' 70th anniversary\n0\nTTC Surveillance Footage of Sammy Yatim Shooting\nJays fan gets bat flip tattoo\nGanter, Buffery discuss Marcus Stroman\nBallot with both PC Party and Conservative causes voter confusion and concerns\nFirefighters up to the Challenge\nMore from Blue Jays Blue Jays manager John Gibbons certainly no 'dumb-ass' 0\nBlue Jays' magical 2015 run comes to end 0\nAnthopoulos expected to return to Jays next season: Sources 0\nDavid Price open to returning to Blue Jays 0\nBlue Jays' Jose Bautista comes through yet again in clutch situation 0\nInside Toronto sun.com News\n3 dead in homecoming parade crash 0", "external_links": ["http://pubads.g.doubleclick.net/gampad/clk?id=228633661&iu=/3081/SMCO_ENUR_TSUN_EN_WEB", "http://blogs.canoe.ca/beezer/", "http://pubads.g.doubleclick.net/gampad/clk?id=182027221&iu=/3081/SMCO_ENUR_TSUN_EN_WEB", "http://pubads.g.doubleclick.net/gampad/clk?id=183052021&iu=/3081/SMCO_ENUR_TSUN_EN_WEB", "http://twitter.com/@beezersun", "http://pubads.g.doubleclick.net/gampad/clk?id=182024221&iu=/3081/SMCO_ENUR_TSUN_EN_WEB"], "published": "2015-10-25T01:20:00.000+02:00", "crawled": "2015-10-24T23:07:19.016+03:00", "highlightTitle": ""}