{"organizations": ["Alabama News Network"], "uuid": "a4d50de554d7e19e8da496cb5c494ddb2988b5c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.alabamanews.net", "main_image": "http://media.alabamanews.net/images/tuskegee2.png", "site_section": "http://www.waka.com/sports/index.rss2", "section_title": "WAKA - CBS 8 Sports", "url": "http://www.alabamanews.net/sports/18th-ranked-Tuskegee-wins-on-the-road-336666951.html", "country": "US", "title": "18th-ranked Tuskegee wins on the road", "performance_score": 0, "site": "alabamanews.net", "participants_count": 0, "title_full": "18th-ranked Tuskegee wins on the road", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T23:42:00.000+03:00", "replies_count": 0, "uuid": "a4d50de554d7e19e8da496cb5c494ddb2988b5c2"}, "author": "", "url": "http://www.alabamanews.net/sports/18th-ranked-Tuskegee-wins-on-the-road-336666951.html", "ord_in_thread": 0, "title": "18th-ranked Tuskegee wins on the road", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Alabama News Network \nStory Created: Oct 24, 2015 at 3:42 PM CDT \nFRANKFORT, Kent. | Playing for the fourth time in five weeks on the road, the 18th-ranked Tuskegee University Golden Tigers were able to come out with a 38-28 victory over Kentucky State at Alumni Stadium on a rainy Saturday afternoon. Kenno Loyal became the first Golden Tiger to rush for over 100 yards, finishing with 113 yards on nine carries, while Dennis Norfleet rushed for 83 yards on five carrries. The team finished with 280 yards rushing in the game – the highest total of the season for the Golden Tigers. Defensively, Osband Thompson and Jewell Ratliff combined to lead the Golden Tigers with eight tackles each, while Jonah McCutcheon recorded his fifth interception of the season. After Kentucky State was able to cut into the deficit, the special teams of Tuskegee made their presence felt. After a defensive stand by the defense resulting a 19-yard field goal attempt, the Golden Tigers’ Osband Thompson got through the line and blocked the attempt. The kick was picked up by Michael Robinson, who raced 88 yards for the touchdown, and extended the lead to 38-21 midway through the fourth quarter. The kick was the second blocked this season by the Golden Tigers, both of which were returned for touchdowns. The 88-yard touchdown is the second longest touchdown of the season for Tuskegee, and was the third of 70 or more yards on Saturday . The Golden Tigers were able to overcome two blocked kicks – one of which resulted in a touchdown – and trimmed the lead to 38-28 with 4:02 to play in the game. The Thorobreds were able to recover the ensuing onside kick, resulting in a defensive stand by the Golden Tigers with just over three minutes to play. Tuskegee (7-1, 6-0 SIAC, 3-0 West) used a rushing attack that gained 217 yards in the first half alone – their third-highest rushing total of the entire season – in just 30 minutes. The Golden Tigers finished just 23 yards short of their season-high 240 against Lane and just eight yards short of their total last week against Stillman. Tuskegee used their rushing attack to get on the board early in the opening quarter. After their opening drive looked to be stalled, fullback Josh Matthews matched his career-long run of 16 yards to pick up a first down at the Kentucky State 15-yard line. That eventually led to a five-yard touchdown by Tyree Brooks – his fifth in the last three games. The Golden Tigers would strike again, but not until near the end of the first quarter when another drive looked to stall deep in their own territory. Running back Kenno Loyal took the handoff and ran up the middle, nearly untouched, for a 79-yard touchdown run that put the Golden Tigers up 14-0 with just 25.6 seconds left in the opening quarter. The run by Loyal is the fourth-longest play for a touchdown this season for the Golden Tigers, matching the 79-yard pass from Kevin Lacey to Van Powell against Albany State. It is also the longest run from scrimmage this season for the Golden Tigers – besting the mark set by Dennis Norfleet set last week against Stillman of 59 yards. Kentucky State was able to answer and get on the board with 10:08 remaining in the first half, taking the ball down the field in nine plays and covering 82 yards – the second longest drive this season against the Tuskegee defense. The drive culminated in an Ora Johnson 21-yard pass to Charles Johnson that trimmed the lead to 14-7. The Thorobreds took advantage of a fumble by Tuskegee, driving down the field using a 34-yard run by Reginald Johnson that set up another touchdown. Kentucky State tied the game up with 7:02 to play in the half, when Johnson connected with Lavelle Cloyd on a screen that covered six yards that tied the game at 14-all. Following a delay due to a significant lower leg injury to a Kentucky State player, Tuskegee wasted no time regaining the lead. The Golden Tigers took two plays, and used the speed of Dennis Norfleet for a 74-yard scamper with just over six minutes to play in the half. The run put the Golden Tigers up 21-14, and was the second longest run of the day (and the season) for a touchdown by the Golden Tigers. They wasted little time in building their advantage back to two touchdowns as Norfleet set the offense with a first down at the 26-yard line. Using just two plays and 52 seconds, the Golden Tigers’ Loyal scored his second touchdown of the day from nine-yards out and put Tuskegee ahead 28-14 with just over four minutes to play in the contest. The second half scoring started on eight play drive that covered only 18 yards for the Golden Tigers, but it took 3:31 off the clock. It resulted in a 30-yard field goal from Kemuel Lawrence that extended the Tuskegee lead to 31-14 with 7:12 to play in the third quarter. Kentucky State was able to answer the opening drive by Tuskegee as they took their second possession 64 yards on 10 plays. The Thorobreds used a William Johnson two-yard run with 1:20 to play in the third quarter to trim the Tuskegee lead to 31-21. Tuskegee returns next week against Central State University at Cleve L. Abbott Memorial Alumni Stadium. Kickoff is set for 1 pm , and the Golden Tigers will honor their seniors during a pregame ceremony. They are also asking all fans to wear pink in honor of Breast Cancer Awareness Month.", "external_links": [], "published": "2015-10-24T23:42:00.000+03:00", "crawled": "2015-10-25T05:05:41.568+02:00", "highlightTitle": ""}