{"organizations": [], "uuid": "79ca2897b7d8e41c7599ffcc682d0dbbf59b5825", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "accesswdun.com", "main_image": "http://bf19d0142b960c98204c-6849f9022b05f72b83236695aa4e9a0a.r50.cf2.rackcdn.com/uploads/articles/2015/339949/jef-elb-wood3-be_p3.jpg", "site_section": "http://accesswdun.com/rss/3/rss.xml", "section_title": "AccessWDUN.com Sports", "url": "http://accesswdun.com/article/2015/10/339949/week-6-playoff-region-races-shaping-up-after-big-night", "country": "US", "title": "WEEK 6: Playoff, region races shaping up after big night", "performance_score": 0, "site": "accesswdun.com", "participants_count": 1, "title_full": "WEEK 6: Playoff, region races shaping up after big night", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T17:05:00.000+03:00", "replies_count": 0, "uuid": "79ca2897b7d8e41c7599ffcc682d0dbbf59b5825"}, "author": "Morgan Lee", "url": "http://accesswdun.com/article/2015/10/339949/week-6-playoff-region-races-shaping-up-after-big-night", "ord_in_thread": 0, "title": "WEEK 6: Playoff, region races shaping up after big night", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Morgan Lee Sports Editor Jefferson's Colby Wood keeps his footing while running for a gain against Elbert County on Friday night in Elberton. The Dragons won the showdown 27-8. photo: Bobby Escoe Related Articles 2015 High school football rankings 2015 High School Football region standings VIDEO: Gainesville makes most of six Salem turnovers to set up Lanier showdown (VIDEO) Dawson County battles past East Hall to stay tied for first in 7-AAA \nRegion title and playoff races are fast taking shape around northeast Georgia, and Friday night provided some impressive performances for area programs, as Week 6 of the high school football season played on through the rain. \nJefferson is not yet in full control of Region 8-AAA -- Oconee County is still undefeated in 8-AAA play too -- but the Dragons showed that the road to the region crown looks very much like it will run through Memorial Stadium after they pushed past Elbert County 27-8 in a showdown of undefeated top five-ranked squads in Elberton. Jefferson did it in usual fashion -- grinding with their offensive line and Colby Wood, who rushed for 284 yards on 47 carries and scored four touchdowns. Meanwhile, the Dragons kept the explosive Mecole Hardman under wraps for the most part, allowing 107 yards and a touchdown to the quarterback. \nIn Region 8- , Gainesville set itself up for a mammoth showdown with Lanier next week, taking advantage of six turnovers to roll past Salem 34-6 in Conyers. The Red Elephants are now 4-0 in region play and will face a Longhorns squad that is also 4-0 next week in Gainesville. Also in 8- , Winder-Barrow outlasted Flowery Branch 24-17 to keep its place in the postseason race -- the win, combined with the Salem loss to Gainesville moved the Bulldoggs into fourth place (Loganville is third) in the standings. \nIn Region 8-AAAA, North Hall put together the most impressive scoreline of the night, hammering North Oconee 31-0 to get its first region win. The Trojans, which lobbed two 58-yard touchdown passes, will face Buford next week in Gainesville. The Wolves blanked Chestatee 56-0 on Friday. Stephens County, meanwhile, stayed tied for first in region play with a 29-6 win at Monroe Area. White County also bounced back from a slow start to clinh a 26-11 win over Madison County -- the Warriors' first victory of the season. \nIn 7-AAA, Dawson County out-fought East Hall 35-28 to move to 2-0 in region play and set up a huge showdown with Franklin County next week -- which defeated Lumpkin County 29-8. Both teams are tied for first in 7-AAA. Meanwhile, Banks County powered past Fannin County 52-28 to move to 1-1 in region play; West Hall (on a bye), Lumpkin and Fannin are yet to record a region win. \nRabun County and Union County continued their march toward their rivalry showdown in a couple of weeks with dominating wins -- the Wildcats shutting out Social Circle 44-0 and the Panthers taking out Oglethorpe 41-6. Meanwhile, Riverside Military picked up its first win of the season, 21-6 over Strong Rock Christian. \nMill Creek also maintained its unblemished record with ease, crushing Meadowcreek 52-0 in Region 7- . \nCheck out our Friday Game Night page for in-depth game stories and video highlights from around northeast Georgia. \nWEEK 6 AREA HIGH SCHOOL FOOTBALL SCORES, OCT. 2 \nAthens Academy 36, Towns County 7 \nBanks County 52, Fannin County 28 \nBuford 56, Chestatee 0 \nDawson County 35, East Hall 28 \nFranklin County 29, Lumpkin County 8 \nGainesville 34, Salem 6 \nHebron Christian 21, Lakeview Academy 0 \nJefferson 27, Elbert County 8 \nLoganville 38, Apalachee 0 \nMill Creek 52, Meadowcreek 0 \nMorgan County 37, East Jackson 7 \nNorcross 38, North Gwinnett 10 \nNorth Hall 31, North Oconee 0 \nOconee County 29, Jackson County 0 \nPrince Avenue 35, Commerce 14 \nRabun County 44, Social Circle 0 \nRiverside Military 21, Strong Rock Christian 7 \nStephens County 29, Monroe Area 6 \nUnion County 41, Oglethorpe County 6 \nWhite County 26, Madison County 11 \nWinder-Barrow 24, Flowery Branch 17", "external_links": [], "published": "2015-10-03T17:05:00.000+03:00", "crawled": "2015-10-03T16:10:54.888+03:00", "highlightTitle": ""}