{"organizations": [], "uuid": "cfe4f62b61ae227324101a6a34162e088d469cd1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.beaumontenterprise.com", "main_image": "http://ww4.hdnux.com/photos/41/35/60/8772611/7/rawImage.jpg", "site_section": "http://www.beaumontenterprise.com/sports/baseball/collectionRss/Sports-Baseball-Heds-7391.php", "section_title": "Sports Baseball Heds", "url": "http://www.beaumontenterprise.com/sports/article/AP-source-Chase-Utley-appeal-hearing-unlikely-6566409.php", "country": "US", "title": "Utley not in Dodgers' lineup for Game 3 vs Mets", "performance_score": 0, "site": "beaumontenterprise.com", "participants_count": 1, "title_full": "Utley not in Dodgers' lineup for Game 3 vs Mets", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T01:16:00.000+03:00", "replies_count": 0, "uuid": "cfe4f62b61ae227324101a6a34162e088d469cd1"}, "author": "RONALD BLUM, AP Baseball Writer", "url": "http://www.beaumontenterprise.com/sports/article/AP-source-Chase-Utley-appeal-hearing-unlikely-6566409.php", "ord_in_thread": 0, "title": "Utley not in Dodgers' lineup for Game 3 vs Mets", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Close Image 1 of 11 \nNew York Mets shortstop Ruben Tejada, goes over the top of Los Angeles Dodgers' Chase Utley who broke up a double play during the seventh inning in Game 2 of baseball's National League Division Series, Saturday, Oct. 10, 2015 in Los Angeles. Photo: Gregory Bull, AP New York Mets shortstop Ruben Tejada, goes over the top of Los... Image 2 of 11 \nNew York Mets shortstop Ruben Tejada falls after a slide by Los Angeles Dodgers' Chase Utley during the seventh inning of an NL Division Series baseball game Saturday, Oct. 10, 2015, in Los Angeles. Photo: John McCoy, AP New York Mets shortstop Ruben Tejada falls after a slide by Los... Image 3 of 11 \nRuben Tejada of the New York Mets is hit by a slide by Chase Utley #26 of the Los Angeles Dodgers in the seventh inning in an attempt to turn a double play in Game 2 of the National League Division Series at Dodger Stadium. Photo: Sean M. Haffey Ruben Tejada of the New York Mets is hit by a slide by Chase... Image 4 of 11 \nThe slide by the Dodgers' Chase Utley is being questioned because it started so late that it was difficult for Mets shortstop Ruben Tejada to avoid Utley even though Tejada, who suffered a broken leg, was behind second base. Photo: Gregory Bull, STF The slide by the Dodgers' Chase Utley is being questioned because... Image 5 of 11 \nNew York Mets shortstop Ruben Tejada is taken off the field after being hurt in a double play against the Los Angeles Dodgers during the seventh inning in Game 2 of baseball's National League Division Series, Saturday, Oct. 10, 2015 in Los Angeles. (AP Photo/Gregory Bull) Photo: Gregory Bull, Associated Press New York Mets shortstop Ruben Tejada is taken off the field after... Image 6 of 11 \nRuben Tejada #11 of the New York Mets is carted off the field after sustaining an injury in the seventh inning on slide by Chase Utley #26 of the Los Angeles Dodgers in game two of the National League Division Series at Dodger Stadium on October 10, 2015 in Los Angeles, California. Photo: Sean M. Haffey, Getty Images Ruben Tejada #11 of the New York Mets is carted off the field after... Image 7 of 11 \nNew York Mets manager Terry Collins gestures as he discusses the controversial play in Game 2 in which Mets shortstop Ruben Tejada was upended by a sliding Los Angeles Dodgers' Chase Utley during a National League Division Series baseball workout day Sunday, Oct. 11, 2015, in preparation for Monday's Game 3 at CitiField in New York. Photo: Kathy Willens, AP New York Mets manager Terry Collins gestures as he discusses the... Image 8 of 11 \nLos Angeles Dodgers manager Don Mattingly gestures as he answers questions about Chase Utley's hard slide into New York Mets shortstop Ruben Tejada, who suffered a broken leg in Game 2 of the NLDS, during a press conference, Sunday, Oct. 11, 2015, at CitiField in New York. Photo: Kathy Willens, AP Los Angeles Dodgers manager Don Mattingly gestures as he answers... Image 9 of 11 \nNew York Mets shortstop Ruben Tejada is taken off the field after being hurt in a double play against the Los Angeles Dodgers during the seventh inning in Game 2 of baseball's National League Division Series, Saturday, Oct. 10, 2015 in Los Angeles. Photo: Gregory Bull, AP New York Mets shortstop Ruben Tejada is taken off the field after... Image 10 of 11 \nNew York Mets shortstop Ruben Tejada is taken off the field after being hurt in a double play against the Los Angeles Dodgers during the seventh inning in Game 2 of baseball's National League Division Series, Saturday, Oct. 10, 2015 in Los Angeles. Photo: Gregory Bull, AP New York Mets shortstop Ruben Tejada is taken off the field after... Image 11 of 11 Utley not in Dodgers' lineup for Game 3 vs Mets 1 / 11 NEW YORK (AP) — Chase Utley was not in the Los Angeles Dodgers' starting lineup for Game 3 of their NL Division Series against the New York Mets on Monday night. Instead of Utley, Los Angeles manager Don Mattingly started Howie Kendrick at second. \"Howie's been swinging the bat good, and we feel like he gives us the best chance to win today,\" Mattingly said. Video: Chase Utley May Be Punished After Breaking Ruben Tejada's Leg Media: San Francisco Chronicle Chase Utley could face punishment over the slide that left New York Mets shortstop Ruben Tejada with a fractured fibula. The incident came during the seventh inning of the Los Angeles Dodgers? win over the Mets, when Utley slid into Tejada at second base Utley appealed his two-game suspension assessed by Major League Baseball on Sunday night for an illegal slide in Game 2, which broke the right leg of Mets shortstop Ruben Tejada. The appeal meant the penalty could not start until after a hearing and a decision. Utley's hearing didn't take place Monday. The sides were still trying to agree to a schedule. Kendrick was 3 for 8 in the first two games of the series, while Utley went 1 for 2 in a pair of appearances as a pinch hitter. Kendrick is 1 for 6 against Mets Game 3 starter Matt Harvey, while Utley is 6 for 18. \"I'm a little surprised,\" Mets manager Terry Collins said. \"Don knows his team better than me, but I got the same stats he's got, and I know he swings the bat pretty good against Matt Harvey.\" Collins also did not expect any attempts by his players to retaliate. He said Harvey had \"been told.\" \"This is too big a game. We need to not worry about retaliating,\" he said. \"We need to worry about winning. ... The one thing we can't do is cost ourselves a game, and this particular game, because we're angry. We can play angry, but we've got to play under control.\" MLB and the players' union were working to set up the appeal hearing before special assistant to the commissioner John McHale Jr., a person familiar with the process told The Associated Press. The person spoke on condition of anonymity because no statements were authorized. The sides spoke with McHale late Monday, giving their positions on when the hearing should be held. Utley was penalized Sunday by Joe Torre, MLB's chief baseball officer, who said Utley's takeout of Mets shortstop Ruben Tejada in Game 2 on Saturday was an \"illegal slide.\" The tying run scored on the play, the first of four runs in the inning, and the Dodgers went on to win 5-2 and tie the series at one game apiece. If umpires had ruled the slide an illegal takeout, they could have called an inning-ending double play, which would have left the Mets ahead 2-1. Utley asked the union to appeal the discipline. His agent, Joel Wolfe, said \"a two-game suspension for a legal baseball play is outrageous and completely unacceptable.\" \"The players association and my agent are handling the appeals process,\" Utley said in a statement Monday. \"I have nothing more to say other than to reiterate that I feel terrible about Ruben's injury. Now my teammates and I are focused on Game 3 and doing everything we can to win this series.\" Under the sport's collective bargaining agreement, the hearing is to start within 14 days of MLB receiving the appeal. Penalties are held in abeyance pending a decision on the appeal. Then with Philadelphia, Utley also angered the Mets in 2010 when he slid hard into Tejada. Harvey hit Utley on the back with a 95 mph fastball at Citi Field on April 14 after Philadelphia's David Buchanan plunked Wilmer Flores and Michael Cuddyer, both on the left hand. McHale had been MLB's executive vice president of administration from 2002 until April, when he received his new title. He has continued his role of hearing appeals of on-field discipline. Before joining the commissioner's office, McHale had been Colorado's executive vice president of baseball operations, Detroit's chief executive officer and Tampa Bay's chief operating officer. Mattingly spoke to Utley about his personal situation on the trip. \"I just wanted to make sure he's comfortable, you know, his family is comfortable, really all our families are comfortable in that situation,\" Mattingly said. Southeast Texas sports news", "external_links": [], "published": "2015-10-13T01:16:00.000+03:00", "crawled": "2015-10-13T01:47:18.153+03:00", "highlightTitle": ""}