{"organizations": [], "uuid": "36a78136b008fd92e8f11cea2e08debdc3e09a4a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.oregonlive.com", "main_image": "http://imgick.oregonlive.com/home/olive-media/width620/img/oregonian/photo/2015/10/01/18881298-large.jpg", "site_section": "http://www.oregonlive.com/", "section_title": "Oregon Local News, Breaking News, Sports &amp; Weather - OregonLive.com", "url": "http://www.oregonlive.com/pacific-northwest-news/index.ssf/2015/10/who_is_chris_harper-mercer_rec.html", "country": "US", "title": "Who is Chris Harper-Mercer? Records, internet paint a hazy picture", "performance_score": 0, "site": "oregonlive.com", "participants_count": 12, "title_full": "Who is Chris Harper-Mercer? Records, internet paint a hazy picture | OregonLive.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T05:13:00.000+03:00", "replies_count": 14, "uuid": "375c5c614250c6aa0ae10be73e741ed9cd57b872"}, "author": "Jeff Manning | The Oregonian/OregonLive", "url": "http://www.oregonlive.com/pacific-northwest-news/index.ssf/2015/10/who_is_chris_harper-mercer_rec.html#post-0", "ord_in_thread": 0, "title": "Who is Chris Harper-Mercer? Records, internet paint a hazy picture", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Details about Chris Harper-Mercer, the 26-year-old responsible for the Umpqua Community College mass shooting, remain hazy. On Thursday evening, Douglas County Sheriff John Hanlin refused to even name the shooter, saying he didn't want the man glorified.\nThe Oregonian/OregonLive confirmed the gunman's name. By evening, tabloids around the country and overseas painted him as a Nazi paraphernalia devotee and gun fanatic.\nA Myspace page that appears to be linked to the gunman shows a man with a crewcut wearing spectacles and carrying a rifle. The page includes posts of Irish Republican Army propaganda.\nPhoto from the Myspace page believed to be that of Chris Harper-Mercer, the slain gunman responsible for the Umpqua Community College shooting. Myspace Other apparent social media pages linked to him suggest an outdoors enthusiast and lover of horror movies and goth music .\nMultiple media outlets reported that he appears to have uploaded a video about the Newtown shooting earlier this week . They also linked him to a blog post on Aug 31, 2015 about a man, Vester Flanagan, who killed two TV news employees in Virginia. The post reads, in part , \"On an interesting note, I have noticed that so many people like him are all alone and unknown, yet when they spill a little blood, the whole world knows who they are. A man who was known by no one, is now known by everyone. His face splashed across every screen, his name across the lips of every person on the planet, all in the course of one day. Seems the more people you kill, the more you're in the limelight.\"\nOregon School Shooting: Neighbor Interview Neighbor said he saw the shooter hang out every night at the apartment complex swingset with the same two little kids.\nHe had relocated from busy Los Angeles to tiny Winchester in rural Oregon in 2013, according to public records database.\nTwo sheriff's deputies on Thursday evening were at the apartment complex in Winchester that public records link to the gunman. Crime scene tape cordoned off the parking lot. Winchester is a few miles north of Roseburg.\nHarper-Mercer was the son of Ian Bernard Mercer and Laurel Margaret Harper. They lived in the South Bay area of Los Angeles County, and have relatives in the San Fernando Valley. Neither could be reached Thursday.\nMercer and Harper filed for divorce June 6, 2005.\nIan Mercer currently lives in Tarzana, Calif. He works as a restaurant manager, according to his father, Ian Mercer Sr., reached Thursday evening.\n-- Nick Budnick and Jeff Manning\nnbudnick@oregonian.com jmanning@oregonian.com\n503-294-5083 503-294-7606\n@nickbudnick @JeffmanningOre", "external_links": ["http://morguepenpals.yolasite.com/north-america.php", "http://spiritualpassions.com/seeme/ironcross45.html", "http://www.theguardian.com/us-news/2015/oct/02/chris-harper-mercer-first-details-emerge-of-oregon-college-killer", "https://twitter.com/NickBudnick", "http://heavy.com/news/2015/10/chris-harper-mercer-umpqua-community-college-ucc-roseburg-oregon-shooting-shooter-gunman-dead-eggman-4chan-name-id-identity-photos-twitter-social-media-facebook-youtube/", "https://kat.cr/blog/lithium_love/"], "published": "2015-10-02T05:13:00.000+03:00", "crawled": "2015-10-02T10:17:29.940+03:00", "highlightTitle": ""}