{"organizations": [], "uuid": "5f5bf47833cdf14e1b1349927099d0d93697bf49", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sun-sentinel.com", "main_image": "http://www.trbimg.com/img-561ac741/turbine/sfl-miami-heat-left-handers-s101115", "site_section": "http://www.sun-sentinel.com/sports/rss2.0.xml", "section_title": "Sports - Sun Sentinel", "url": "http://www.sun-sentinel.com/sports/miami-heat/sfl-miami-heat-left-handers-s101115-story.html", "country": "US", "title": "Heat locked and loaded with 'mutant' lefties", "performance_score": 0, "site": "sun-sentinel.com", "participants_count": 1, "title_full": "Heat locked and loaded with 'mutant' lefties", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T23:29:00.000+03:00", "replies_count": 0, "uuid": "5f5bf47833cdf14e1b1349927099d0d93697bf49"}, "author": "Ira Winderman", "url": "http://www.sun-sentinel.com/sports/miami-heat/sfl-miami-heat-left-handers-s101115-story.html", "ord_in_thread": 0, "title": "Heat locked and loaded with 'mutant' lefties", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Ira Winderman) \n\"We actually have one at every position, so it works out perfectly,\" Johnson says. \nAnd he's right. There's Bosh at center, McRoberts at power forward, Winslow at small forward, Johnson at shooting guard and Dragic at point guard. \n\"I'd like to see it,\" Bosh says. \"Why not? Just to do it, at least in preseason, just to say we did it.\" \nExcept the five lefties aren't all lefties. The only thing McRoberts does left-handed is shoot a basketball. That's it. \n\"In almost virtually everything he does, except for he shoots the ball left-handed,\" Spoelstra says. \"But he will bat right-handed, he will throw a football right-handed, golf right-handed. It's one of those interesting contradictions.\" \nAs with many lefty-righty decisions, it just sort of happened, mutated, if you will. \n\"I think I shot with two hands when I was a real little kid, so they just made me left-handed shooting,\" McRoberts says. \"I shot probably with more of my left hand on the ball. I don't know. It was before I even remember. But I've always shot a basketball left-handed. But I pitch right-handed. I do everything right-handed.\" \nSimilarly, while Dragic might break you down left-handed off the dribble, he breaks bread right-handed. \n\"Eat, that is the only thing,\" he says of going right-handed. \"That was the culture back home. \n\"When I was a kid, they were always saying, 'If you eat with your left hand, it's ugly.' Then I started eating right-handed. My mom, when she was young, she's left-handed, too, and she had to learn to write right-handed in school.\" \nThen there is Bosh and his unique crossover. \n\"I throw a Frisbee right-handed,\" he says. \"I don't know why. Yeah, it's weird.\" \nWeird. The lefties say they get that a lot. They say it's also quite possibly true. \n\"I feel like lefties just kind of move different,\" Johnson says. \"The way they move is all kind of unorthodox.\" \nAnd they don't shoot straight, either, according to Dragic. \n\"If you look at left-handers,\" he says, \"we don't shoot like right-handers. Our body is always rotated a little bit. And when you see a right-hander, they're always straight, squared in their shooting. So that's interesting for me, because I tried to shoot like that, squared up. I couldn't.\" \nThere have, of course, long been generalizations about lefties. \"More skilled,\" according to one study. \"High achievers,\" according to another. Accident prone. Awkward. \nAs for the science? Per one piece in Scientific American: \"Left-handers' brains are structured differently from right-handers' in ways that can allow them to process language, spatial relations and emotions in more diverse and potentially creative ways.\" \n( Editor's note : The author of this story is left-handed, and insisted on quoting that specific study.) \nOf course, Slate quotes another report that notes: \"Lefties have higher rates of high blood pressure, irritable bowel syndrome, and schizophrenia.\" \n( Editor's note, too : The author of this story suggested excising the above paragraph if the story was deemed too long.) \nFrom a basketball perspective, as Spoelstra notes, \"You're used to playing guys with the right hand.\" \nAnd lefties go left. A lot. \n\"When I was younger,\" Johnson says, \"I would do a whole circle around the court going left before I started to go right.\" \nDragic almost always finishes left. \nBosh? He prefers going right. \n\"I'm the exception,\" he says. \nFor his part, Winslow says scouting reports even in the levels below the NBA are too advanced for a lefty to go undetected. \n\"I feel like I've played at levels where everybody knows I'm left-handed,\" the rookie says,\"so I don't think it's new to anybody.\" \nTo Dragic, it's always new, every time. \n\"As soon as you see a left-hander,\" he says of his fellow mutants, \"it's always something different.\" \nIt's sort of what Spoelstra is thinking, as well, now locked and loaded with lefties. \n\"I think it's unique,\" he says, \"and it's something we really want to leverage.\" \nwinderman@tribpub.com. Follow him at twitter.com/iraheatbeat or facebook.com/ira.winderman", "external_links": [], "published": "2015-10-11T23:29:00.000+03:00", "crawled": "2015-10-12T02:14:08.404+03:00", "highlightTitle": ""}