{"organizations": [], "uuid": "dce62913358353b6ad80877a6e32a81fef85f79b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nytimes.com", "main_image": "http://static01.nyt.com/images/2015/10/16/sports/16IHTSRACSKIPPERS16/16IHTSRACSKIPPERS16-facebookJumbo.jpg", "site_section": "http://www.nytimes.com/services/xml/rss/nyt/InternationalSports.xml", "section_title": "NYT &gt; International Sports", "url": "http://www.nytimes.com/2015/10/16/sports/the-sharing-of-a-rivalry.html", "country": "US", "title": "The Sharing of a Rivalry", "performance_score": 0, "site": "nytimes.com", "participants_count": 1, "title_full": "The Sharing of a Rivalry - The New York Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T15:02:00.000+03:00", "replies_count": 0, "uuid": "dce62913358353b6ad80877a6e32a81fef85f79b"}, "author": "Christopher Clarey", "url": "http://www.nytimes.com/2015/10/16/sports/the-sharing-of-a-rivalry.html", "ord_in_thread": 0, "title": "The Sharing of a Rivalry", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " HAMILTON, Bermuda — As Oracle Team USA polished off one of the greatest comebacks in any sport in the last America’s Cup, even eye contact became difficult for Jimmy Spithill, Oracle’s skipper, and Dean Barker, his counterpart at Emirates Team New Zealand.\n“Both of us I think wanted to rip each other’s throat out,” Spithill said.\nLittle more than two years later, Spithill and Barker share office space in a recently renovated 19th-century warehouse in the Royal Naval Dockyard in Bermuda as they prepare for this week’s regatta on the Great Sound.\nThey chat amicably over lunch, exchange ideas at the weekend barbecue pit and chide each other — like many an Australian and New Zealander on friendly terms — over the results of the Rugby World Cup. Spithill even has sneaked a few Australian wallaby stickers into Barker’s workspace.\n Legacy and Remembrance How Bermuda Landed the America's Cup OCT. 15, 2015 “I think Jimmy needs to sort of concentrate a bit more on the sailing and a little bit less on the rugby,” said Barker, now the skipper and chief executive for the new challenger SoftBank Team Japan.\nPhoto Jimmy Spithill with Oracle Team USA, celebrating in San Francisco in 2013 with the America’s Cup. Credit Monica M. Davey/European Pressphoto Agency All this adds up to quite a mood swing for the star helmsmen with contrasting personalities who were rivals long before Oracle’s 2013 fight-back for the annals from a 1-8 deficit in San Francisco.\nAll Barker and Team New Zealand needed was one more victory to secure the Cup, fly it back to Auckland and lounge in the afterglow of an upset victory over the lavishly funded defender owned by the American billionaire Larry Ellison.\nInstead, with Spithill setting the never-say-sink tone, Oracle proceeded to win eight straight races, finding a way to foil consistently upwind and retain the oldest major trophy in sports.\n“Despite what many New Zealanders think, there was no silver bullet; I wish there was so we could use it this time,” Spithill said. “The answer was it was a lot of little things.”\nThe outcome was one part exhilarating victory, one part crushing defeat. And the two men who symbolized each team’s improbable journey were the cocksure Spithill and the understated Barker, who looked every bit as stricken in defeat that sunny September afternoon in 2013 as one would expect.\n “I think it will always haunt me, just that sort of unfinished business,” Barker said in an interview last week at the Royal Bermuda Yacht Club. “But you have to be able to take the lessons from it and move on because you end up being a grumpy man if you dwell on it too much.\n“Obviously it hurt. It hurt a hell of a lot, because when you put everything into it, you never think of the consequences of not winning. If you are not successful, it leaves a big black hole there, and you obviously need to work hard to figure out how you are going to fill that void.”\nBarker planned to fill it by plunging back into another America’s Cup at the helm of Team New Zealand, which he first joined for its successful defense of the trophy in 2000. He had substantial offers to leave Team New Zealand through the years. He remained loyal to the national cause, but this time Grant Dalton and other team leaders were the ones who wanted a change.\n Instead of taking another chance on Barker at the helm, they decided to take a chance for 2017 on the much younger Peter Burling, an Olympic silver medalist and two-time world champion in the 49er class with Blair Tuke.\nThe move in itself was not difficult to understand: Barker had failed to defend the Cup once, in 2003, and twice failed to challenge for it successfully, in 2007 and 2013. He is also 43 in a regatta that has become increasingly physical with the shift to extreme foiling catamarans instead of the more stately and stable monohulls in which Barker learned his craft.\nTo further bolster Team New Zealand’s point of view, Burling also became world champion this year in the International Moth Class: the single-handed foiling boat in which many America’s Cup sailors now compete and train (they are a fixture on the team bases in Bermuda, where the next Cup will be contested in 2017).\nBut what was quite difficult to comprehend was the way Dalton and Team New Zealand handled Barker’s demotion: The impending change first appeared in the New Zealand news media in February before Barker had been informed personally.\n“We just seem to have been incapable or unable to manage it, as much as we’ve tried,” Dalton told the New Zealand Herald of the process. “We had to make changes. It’s just been very public.”\nEven after it did become public, Barker said there was little top-down communication.\n“I still don’t understand it at all,” he said. “It was incredibly poorly handled to be honest, but you know in the end, it wasn’t my decision.”\nHe said he has had virtually no contact with Dalton. “I got an e-mail from him two or three weeks after the so-called leak, and that’s the only communication I’ve ever had from him,” Barker said.\nSpithill remains unimpressed. “I was really disappointed and frustrated, because this is a guy who has been incredibly loyal,” he said of Barker. “The guy doesn’t have an ego. He’s doing everything he can, and O.K., if a team wants to go a certain way, that’s fine. But I would have expected his team to send him out the right way.\n“If he wants to join another team, no problem, but all the best, thanks for your commitment and what you ultimately did for your country. So that was really sad in my view.”\nThe twist here of course is that Spithill and Oracle were the ones largely responsible for making Barker vulnerable in the first place. “I think afterward you both reflect a little bit on what the other guy went through,” Spithill said of Barker. “Because you are the only two who really know.”\nUnbeknownst to outsiders, Spithill raced (and steered) in the 2013 Cup with torn ligaments in his right elbow, which required multiple cortisone shots during the regatta because doctors struggled to hit the trouble spot with the injection. It eventually required surgery in February. As he spoke last week after a workout, he iced the elbow.\nBarker, who eventually declined a reduced role as a coach with Team New Zealand, said Spithill’s public support of late has been particularly meaningful.\n “Honestly he could have sat there and just enjoyed the moment,” Barker said. “But he obviously felt very strongly about it, and it meant a huge amount to me personally when he did it because he didn’t need to do it.”\nNor did Ellison, Spithill’s employer, need to take a personal interest in Barker’s future. But Ellison and Russell Coutts, the former skipper who is now head of the America’s Cup event authority and selected Bermuda for 2017, ended up becoming Barker’s link to Team Japan and its billionaire owner, Masayoshi Son.\nWhen Barker was ousted, Son had yet to announce Team Japan’s formation, but he and Ellison, who are friendly, already had been in discussions.\n“I tell you who brokered Dean’s situation: It was Larry, not me,” said Coutts, who once gave Barker his big break by handing him the helm for the final race of New Zealand’s 2000 Cup sweep.\nTeam Japan was not a tough sell. “It certainly didn’t take a lot of convincing,” Barker said. “My heart is very much in the America’s Cup.”\nThe outreach was not purely magnanimous. The Cup suffered for a lack of credible challengers in 2013, and this year’s cost-saving move to a smaller catamaran for 2017 deprived the event of a high-profile challenger when the Italian team Luna Rossa withdrew.\nA team from the commercially important Asian market, particularly a team with a star skipper, was thus most welcome, and to help the process along, Oracle offered to provide Team Japan a design package for their new boat. That cooperative relationship explains why Barker and Spithill are sharing office space and will soon be testing new catamarans against each other in training.\n“When I first came to Bermuda to get this thing underway, it felt quite unusual walking into the Oracle base and seeing all the people we were head to head with two years ago,” Barker said. “To actually get to know some of those guys, it’s been incredibly refreshing for me.\n“I think if we came in and were trying to start fresh with our own design team we just couldn’t make it. You’d never catch up or close that gap.”\nBarker said Team Japan plans to set up its own base by the end of the year. He already has moved to Bermuda with his wife and four children — ages 10, 8, 7 and 5 — who are enrolled in local schools.\nThose who know Barker well describe him as more relaxed and open. Sitting in his chair at the Royal Bermuda Yacht Club with a Japanese flag on his new uniform, Barker did not disagree. “You’re not carrying over any of the baggage of the past,” he said.\nEven Spithill, once the personification of Barker’s frustrations, has become a positive, but it does bear remembering — even after the barbecues and the deep design discussions — that they will no longer be allies if they meet in the Cup match again in 2017.\n“They are friendly,” Coutts confirmed. “For the moment.”", "external_links": ["http://static01.nyt.com/images/2015/10/16/sports/16iht-sracpercy16a/16iht-sracpercy16a-thumbStandard-v2.jpg", "http://static01.nyt.com/images/2015/10/15/sports/16IHTSRACABERMUDA16/16IHTSRACABERMUDA16-thumbStandard.jpg", "http://static01.nyt.com/images/2015/10/16/sports/16IHTSRACSKIPPERS16a/16IHTSRACSKIPPERS16a-superJumbo.jpg", "http://static01.nyt.com/images/2015/10/16/sports/16IHTSRACSKIPPERS16a/16IHTSRACSKIPPERS16a-blog427.jpg"], "published": "2015-10-15T15:02:00.000+03:00", "crawled": "2015-10-15T14:44:09.015+03:00", "highlightTitle": ""}