{"organizations": [], "uuid": "6338e561d82891e1f71187cdafcb519f68ec8e0e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mercurynews.com", "main_image": "http://extras.mnginteractive.com/live/media/site568/2015/1016/20151016__stanford~1.JPG", "site_section": "http://feeds.mercurynews.com/mngi/rss/CustomRssServlet/568/200795.xml", "section_title": "College Sports", "url": "http://www.mercurynews.com/sports/ci_28979622/mccaffrey-owusu-star-stanfords-big-win-over-ucla?source=rss", "country": "IL", "title": "McCaffrey, Owusu star in Stanford's big win over UCLA", "performance_score": 0, "site": "mercurynews.com", "participants_count": 1, "title_full": "McCaffrey, Owusu star in Stanford's big win over UCLA", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T04:35:00.000+03:00", "replies_count": 0, "uuid": "6338e561d82891e1f71187cdafcb519f68ec8e0e"}, "author": "Jon Wilner\n\njwilner@mercurynews.com", "url": "http://www.mercurynews.com/sports/ci_28979622/mccaffrey-owusu-star-stanfords-big-win-over-ucla?source=rss", "ord_in_thread": 0, "title": "McCaffrey, Owusu star in Stanford's big win over UCLA", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted: 10/16/2015 10:01:49 AM PDT Updated: 10/16/2015 06:35:02 PM PDT STANFORD -- Days before witnessing a tour de force, Stanford quarterback Kevin Hogan sensed something special might be in the air and on the ground. \nExamining film of UCLA's defense, Hogan realized the Bruins' aggressive pursuit angles could be exploited by a tailback with the ability to make quick cuts past the initial wave of tacklers -- a tailback, he concluded, like Christian McCaffrey. \nThursday night, Hogan watched \"in awe\" as McCaffrey delivered one of the greatest performances in Stanford history in a 56-35 victory over UCLA that vaulted the Cardinal into the playoff discussion. \nThe sophomore accumulated 369 all-purpose yards, 19 shy of the school record and the highest total by a Football Bowl Subdivision player this season. \nMcCaffrey had four touchdowns and 243 rushing yards, which broke Toby Gerhart's school record (223, set in 2009 against Oregon). \n\"I had a couple like that in high school,\" said McCaffrey, who wears uniform No. 5 because of his idol, former USC all-purpose dynamo Reggie Bush. \"Those are the games people dream of. But there's still no trophy.\" \nThe Cardinal (5-1, 4-0 Pac-12), however, is steaming closer to having the chance to play for one -- and maybe two. \nStanford's eighth consecutive victory over UCLA featured another efficient performance by Hogan, more dominance from the offensive line, a dazzling catch by receiver Francis Owusu and an opportunistic defense: Cornerback Alijah Holder's pick-six in the first quarter gave Stanford a lead it would not relinquish. Advertisement \nOh, and there was plenty of McCaffrey, too. The sophomore returned a kickoff 96 yards, uncorked a 70-yard touchdown run and averaged 13.1 yards every time he touched the ball. \nWith a home-heavy schedule down the stretch, the sizzling Cardinal is seemingly well-positioned to not only win the Pac-12 North but also contend for a berth in the four-team playoff. \n\"We put up 56 points against a good defense and that's something -- definitely we'll celebrate our victories,\" McCaffrey said. \"But at the same time, I still think we haven't played our best football.\" \nMasterful as he was, McCaffrey didn't produce the play of the game. \nThat came courtesy of Owusu on a 41-yard flea-flicker from Hogan. The underthrown pass was about to hit UCLA safety Jaleel Wadood in the back as they collided chest-to-chest. But Owusu reached around Wadood's back with both hands, as if giving him a hug, and snared the ball as the tumbled to the grass. \n\"I was squeezing for my life,\" Owusu said. \nIt was the best catch by a Stanford receiver since Kodi Whitfield's one-handed touchdown snare against UCLA two years ago. \nStanford has scored more than 50 points in back-to-back games for the first time since 2011. \nHogan in his last four games: Nine touchdowns, two interceptions and a 73.2 completion percentage. \nFor most of that span, he has played with a sprained left ankle. \n\"I feel like I have a good thing going with the training staff, and they're getting me out there and getting me healthy,\" he said. \"So, hopefully, one of these days I'll be back at 100 percent.\" \nThe Cardinal has averaged 34.6 points during its eight-game winning streak against UCLA. \nKickoff time for the Oct. 31 game at Washington State is expected to be announced Monday. For more on college sports, see Jon Wilner's College Hotline at blogs.mercurynews.com/collegesports . Contact him at jwilner@mercurynews.com or 408-920-5716. ---", "external_links": [], "published": "2015-10-17T04:35:00.000+03:00", "crawled": "2015-10-17T05:12:05.604+03:00", "highlightTitle": ""}