{"organizations": [], "uuid": "68b59e71a9d8d759481644f5c41523a05f2ce32d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.abqjournal.com", "main_image": "http://main.abqjournal.netdna-cdn.com/wp-content/plugins/journal-open-graph/img/albuquerque-journal.jpg", "site_section": "http://www.abqjournal.com/", "section_title": "Albuquerque and New Mexico News, Sports, Business and more | Albuquerque Journal News", "url": "http://www.abqjournal.com/659013/opinion/speak-up-184.html", "country": "US", "title": "Speak Up!", "performance_score": 0, "site": "abqjournal.com", "participants_count": 1, "title_full": "Speak Up! | Albuquerque Journal News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T08:02:00.000+03:00", "replies_count": 0, "uuid": "68b59e71a9d8d759481644f5c41523a05f2ce32d"}, "author": "ABQnews Staff", "url": "http://www.abqjournal.com/659013/opinion/speak-up-184.html", "ord_in_thread": 0, "title": "Speak Up!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "TAKING AWAY\nguns will definitely solve something. It solves how bad guys with guns won’t be stopped by the good guys with guns. – M.P.B.\nAFTER BEING IN a driving class, it’s so easy to point out everything drivers are doing wrong on Albuquerque roads. You can’t keep a safe following distance behind a vehicle without someone cutting right into the lane. It’s not only putting me at harm but everyone else as well! – K.H.\nTHE BELIEF THAT all police officers are brutal and violent is entirely incorrect. People need to realize that there are police officers still out there trying to help the citizens of this city and are willing to give their lives daily to do so. – P.Z.G\nPARCC TESTING is useless. Students have so much going on, they don’t need to work even harder for a test that evaluates their whole high school career in one hard test made by people across the country who don’t know what kids need to know in order to lead successful lives. – K.C.\nPEOPLE ACROSS the country and in Albuquerque need to accept the LGBT community and stop judging/discriminating (against) people based on religion. The homophobia in this country is ridiculous and needs to be stopped. It’s time for people to practice what they preach and accept everyone equally. – M.Z.\nSANCTUARY IS not diplomatic immunity from prosecution for common criminality. – M.H.\nWHY CAN’T THERE be more wolves and fewer ranchers pumping out methane along with meat. The world doesn’t need more burgers. – J.B.\nFEDERAL “FUNDING” of Planned Parenthood sounds misleading. Call it what it is: Medicaid reimbursement for services provided. Just like any hospital. – J.H.\nPERHAPS THE CITY should hire someone from N.M. Game & Fish or the State Game Commission as director of animal welfare. They have no problem killing animals. – S.H.\nWE NEED TO split the school district into two equitable districts as soon as possible. – M.G.\nHURRAH FOR the City Council for trying to cut penalties on pot, helping ensure those ticky-tack fines don’t cut into profits by our 11-year-old schoolyard entrepreneurs. After all, those up-and-coming business kids are Albuquerque’s future. Great work, councilors! – B.D.\nSO, IN 2014, Albuquerque had 35,371 crimes reported. That averages out to one crime per 15.8 persons for the year. Very scary. – D.J.\nANOTHER DAY, another mass shooting. Clearly, not enough people are carrying enough guns! And next week’s mass shooting – still not enough guns in enough hands! It’s all one big ka-ching for the arms and ammo businesses and Americans have given up hope that anything else can ever be done. – C.K.\nNEW MEXICO! Land of some not-so-enchanting, busy, busy crooks! – B.R.\nUNIONS ARE hurting employees.. Things have changed in the workplace. It’s time for them to go. – M.R.\nHOW IS IT good news that “APD sees no uptick in robberies” when our citizens are not safe on our streets? Crooks are getting bolder and courts and the Department of Corrections are getting more lenient. – C.T.\nNO WONDER OUR politics are so screwed up. Politics is considered to be separate from and immune from morality. – F.C.\nA GUN-FREE zone is a target-rich environment for any psycho. A good guy with a gun is the only effective response. Why are the lives of the students and faculty jeopardized for a liberal political agenda? I recommend all states require armed security at all learning institutions and all other “gun-free zones.” – M.R.\nTHE FACT THAT people blame video games for shootings is outrageous! There have been interviews and every one of them have proven that it wasn’t anything that influenced them to do it except their own feelings. They will get rid of anything before they get rid of guns. – C.N.\nSpeak Up Rules\nIf you want to gripe, grouse, whine or bellyache about a generic topic, submit your message at ABQ journal.com/letters/speakup . The same goes if you want to dish out praise or thanks. Either way, you have to do it in 50 words or less. You can’t identify anyone you criticize. Keep it clean. No cursing, please. We don’t need your name, just initials. And it’s cheaper than therapy.", "external_links": [], "published": "2015-10-13T08:02:00.000+03:00", "crawled": "2015-10-14T07:26:46.433+03:00", "highlightTitle": ""}