{"organizations": ["Michigan State", "Michigan St", "NCAA", "AP"], "uuid": "49e5cd290d7779907fd8b1652d83f17eba893c44", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.whio.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/17/39/06/e28784077a4a4abda79c3398aa3c570b-432f8775cd454c5c89859ed9d7990799-0.jpg", "site_section": "http://www.whio.com/feeds/categories/sports/", "section_title": "News | Sports", "url": "http://www.whio.com/ap/ap/top-news/no-7-michigan-st-stuns-no-12-michigan-27-23-on-fin/nn5GD/", "country": "US", "title": "No. 7 Michigan St stuns No. 12 Michigan 27-23 on final play", "performance_score": 0, "site": "whio.com", "participants_count": 0, "title_full": "No. 7 Michigan St stuns No. 12 Michigan 27-23 on final play", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T02:59:00.000+03:00", "replies_count": 0, "uuid": "49e5cd290d7779907fd8b1652d83f17eba893c44"}, "author": "", "url": "http://www.whio.com/ap/ap/top-news/no-7-michigan-st-stuns-no-12-michigan-27-23-on-fin/nn5GD/", "ord_in_thread": 0, "title": "No. 7 Michigan St stuns No. 12 Michigan 27-23 on final play", "locations": ["Mich.", "Mich", "Michigan"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Osorio", "R.J. Shelton", "Ann Arbor", "Watts-Jackson"], "text": "Updated: 7:59 p.m. Saturday, Oct. 17, 2015 | Posted: 7:59 p.m. Saturday, Oct. 17, 2015 No. 7 Michigan St stuns No. 12 Michigan 27-23 on final play Related View Larger Michigan State wide receiver R.J. Shelton (12) is hit by Michigan safety Jabrill Peppers (5) during the first half of an NCAA college football game, Saturday, Oct. 17, 2015, in Ann Arbor, Mich. Peppers was called for pass interference on the play. (AP Photo/Carlos Osorio) View Larger Michigan State defensive back Jalen Watts-Jackson (20) runs towards the end zone after recovering a fumbled snap on a punt in the closing seconds of the second half of an NCAA college football game, Saturday, Oct. 17, 2015, in Ann Arbor, Mich. Watts-Jackson lumbered 38 yards for a touchdown on the final play of the game, giving No. 7 Michigan State a shocking 27-23 win over No. 12 Michigan(AP Photo/Carlos Osorio) Sponsored Links The Associated Press ANN ARBOR, Mich. — \nJalen Watts-Jackson grabbed the football on a flubbed punt attempt and lumbered 38 yards into the end zone for a touchdown on the final play of the game, giving No. 7 Michigan State a shocking 27-23 win over No. 12 Michigan in one of college football's most unlikely endings. \nWith the Wolverines ahead 23-21 and 10 seconds left, Michigan punter Blake O'Neill bobbled a low snap, and spun around to try and make the kick. But he was hit, the ball popped free and Watts-Jackson caught it, broke a few tackles in the final yards and made it into the end zone. \nMichigan State (7-0, 3-0 Big Ten) has won seven of eight in the series, its best stretch in more than a half-century. Michigan (5-2, 2-1) lost for the first time since opening the season with a setback at Utah. \nThe Wolverines were seconds away from sealing the win after Sione Houma ran for two TDs, Kenny Allen kicked three field goals and forcing the Spartans to turn the ball over on downs with 1:47 left at its 45. \nThe Spartans had only one timeout left and used it after the next snap. Michigan had two and coach Jim Harbaugh used both, including one with 10 seconds left to set up the final punt. \nMichigan State moved the ball up and down the field against a team that had shut out three straight opponents, picking up 386 yards — mostly through the air — and 20 first downs. \nConnor Cook was 18 of 39 for 328 yards and a TD and Aaron Burbridge had nine receptions for 132 yards for the Spartans. \nJake Rudock was 15 of 25 and 168 yards and avoided turning the ball over. \nIn fact, both teams took good care of the football until the final snap. \nIt looked like a trick play was going to lead to a setback for the Spartans. \nMichigan State coach Mark Dantonio, known for having the guts to call trick plays, called for a fake punt when no one was expecting it. Punter and backup quarterback Tyler O'Connor ran 7 yards on a fourth-and-8 from the Michigan State 31, turning the ball over on downs. \nMichigan took advantage, moving to a 17-7 lead early in the third quarter on Houma's 1-yard run. \n___ \nAP college football website: collegefootball@ap.org Copyright The Associated Press Sign up for our WHIO-TV Daily Headlines Newsletter Sign Up", "external_links": [], "published": "2015-10-18T02:59:00.000+03:00", "crawled": "2015-10-18T03:30:05.392+03:00", "highlightTitle": ""}