{"organizations": [], "uuid": "138a57518fdaa378eeebe91c887aa0e07b390d64", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.oregonlive.com", "main_image": "http://imgick.oregonlive.com/home/olive-media/width620/img/oregonian/photo/2015/10/22/19029411-large.jpg", "site_section": "http://www.oregonlive.com/", "section_title": "Oregon Local News, Breaking News, Sports &amp; Weather - OregonLive.com", "url": "http://www.oregonlive.com/gresham/index.ssf/2015/10/bail_reduced_for_driver_who_fa.html", "country": "US", "title": "Bail reduced for driver who fatally struck pedestrian after smoking marijuana", "performance_score": 0, "site": "oregonlive.com", "participants_count": 9, "title_full": "Bail reduced for driver who fatally struck pedestrian after smoking marijuana | OregonLive.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T02:08:00.000+03:00", "replies_count": 9, "uuid": "138a57518fdaa378eeebe91c887aa0e07b390d64"}, "author": "Everton Bailey Jr. | The Oregonian/OregonLive", "url": "http://www.oregonlive.com/gresham/index.ssf/2015/10/bail_reduced_for_driver_who_fa.html", "ord_in_thread": 0, "title": "Bail reduced for driver who fatally struck pedestrian after smoking marijuana", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A Multnomah County judge lowered the bail Thursday for a Portland man who police say was high on marijuana when he crashed into a woman in Gresham earlier this month .\nJacob M. Walters, 27, has been held in the Multnomah County jail on $275,000 bail since his arraignment Oct. 6 on counts of second-degree manslaughter, criminally negligent homicide, driving under the influence of intoxicants and reckless driving.\nCircuit Judge Marilyn Litzenberger reduced his bail to $55,000. He was still in jail early Thursday evening, but expected to be out by Friday morning. Court records show he has no prior criminal history.\nWalters struck 46-year-old Elizabeth Kemble on Oct. 5 while she was in the crosswalk at the intersection of Northeast 181st Avenue and East Burnside Street, Gresham police said. She was taken to OHSU Hospital and died 11 hours after the morning crash.\nWalters told police he was smoking marijuana from a pipe in his car just before he struck Kemble and felt buzzed, according to a probable cause affidavit. A Gresham police officer noted that it appeared the driver was talking very slowly and had bloodshot eyes.\nWalters' lawyer said in court papers that her client admitted taking two or three hits of marijuana in the car a few minutes before the crash, but didn't think it affected his driving.\nWalters hit his brakes when he saw the woman in the intersection, but couldn't come to a full stop in time, according to his lawyer Stephanie Pollen, in court documents.\nWitnesses told investigators that it appeared the woman was crossing the street with the do-not-walk sign on, possibly to catch a nearby MAX train that had just arrived, according to court papers.\nAnother witness claimed Walters was driving through a red light, the documents said.\nWalters is expected back in court for a preliminary hearing on Oct. 28.\n-- Everton Bailey Jr.\nebailey@oregonian.com\n503-221-8343; @EvertonBailey", "external_links": ["https://twitter.com/evertonbailey"], "published": "2015-10-23T02:08:00.000+03:00", "crawled": "2015-10-23T06:01:32.189+03:00", "highlightTitle": ""}