{"organizations": [], "uuid": "be1a3354811c42afea7d6904199b458afdd6f0bf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/soccer", "section_title": "Soccer News, Scores, Schedule, Standings, Stats, Photos, Videos - MSN Sports", "url": "http://www.msn.com/en-us/sports/premier-league/herrera-rooney-is-englands-greatest-ever-player/ar-AAfCifz", "country": "US", "title": "Herrera: Rooney is England's greatest ever player", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "Herrera: Rooney is England's greatest ever player", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "be1a3354811c42afea7d6904199b458afdd6f0bf"}, "author": "Here's What Westboro Thinks of Kim Davis", "url": "http://www.msn.com/en-us/sports/premier-league/herrera-rooney-is-englands-greatest-ever-player/ar-AAfCifz", "ord_in_thread": 0, "title": "Herrera: Rooney is England's greatest ever player", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\nHerrera: Rooney is England's greatest ever player FOXSports 16 hrs ago © Provided by Fox Sports 86767880 Manchester United midfielder Ander Herrera believes Wayne Rooney is the finest player England has ever produced.\nAdChoices The 29-year-old Rooney played his part in United's comprehensive 3-0 victory over his former club Everton on Saturday, scoring his side's third goal at Goodison Park.\nHerrera, who also got on the scoresheet on Merseyside, has no doubt he is playing alongside one of the all-time greats.\n\"Wayne is our leader. He is the best English player in English history and we are lucky to have him,\" the Spaniard said about his team-mate who turns 30 next week.\n\"When he fights like he did on Saturday we can be very proud of him. He has always helped me a lot.\"\nSir Alex Ferguson was loathe to field Rooney at Goodison Park due to the abuse he used to receive at the home of his boyhood club.\nThe former United manager said he believed Rooney would always be regarded as a \"traitor\" for leaving for Old Trafford in 2004.\nBut relations between Rooney and the Everton supporters have thawed recently.\nRooney received a warm reception when he turned out in an Everton shirt for Duncan Ferguson's testimonial in August.\nAnd on Saturday, Rooney tempered his celebration after clipping the ball over Tim Howard to end a run of three straight defeats for United at Goodison Park.\n\"Maybe (it was) because it was the third goal and it would have been very different if it was a last-minute winner after we were winning,\" Everton manager Roberto Martinez said.\n\"From my time here, there's always been a mutual respect. He's been a phenomenal footballer, he started at Everton and that deep down is always there.\n\"I think the Duncan Ferguson testimonial opened a real good option to show emotions and Wayne has always been clear in his affection towards the football club.\n\"Every Evertonian will tell you that we are always extremely proud of him developing at our football club.\"\nWhen quizzed on whether he thought Rooney could play for Everton again, Martinez said: \"That's a question you shouldn't ask. He is a Manchester United player and captain.\"\nLouis van Gaal handed Rooney the United captaincy on his arrival at the club in summer of 2014 ahead of Robin van Persie, who captained the Netherlands during his time in charge of the Dutch national team.\nBut the 64-year-old believes he made the right choice.\n\"I think Wayne is an example for everybody, not only for his fellow players, but also for other players from other clubs and also for the manager because he is a very social human being and he has a professional attitude,\" Van Gaal said.\n\"I could not imagine that when I was the coach of the Dutch national before I came to United. I had heard other things, but he has shown a fantastic attitude and I am very happy that he scored.\"\nGo to MSN Home", "external_links": ["http://www.foxsports.com/", "http://go.microsoft.com/fwlink/?LinkID=286759"], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-20T04:52:02.083+03:00", "highlightTitle": ""}