{"organizations": [], "uuid": "42ff0a017a4fe6ab569a7b90b53ed82eb06ed820", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tnonline.com", "main_image": "", "site_section": "http://tnonline.com//sports/rss", "section_title": "Times News Sports", "url": "http://www.tnonline.com/2015/oct/23/trojans-beat-bears-epc-girls-soccer-title", "country": "US", "title": "Trojans beat Bears for EPC Girls Soccer title", "performance_score": 0, "site": "tnonline.com", "participants_count": 1, "title_full": "Trojans beat Bears for EPC Girls Soccer title", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T23:00:00.000+03:00", "replies_count": 0, "uuid": "42ff0a017a4fe6ab569a7b90b53ed82eb06ed820"}, "author": "psiwebtn", "url": "http://www.tnonline.com/2015/oct/23/trojans-beat-bears-epc-girls-soccer-title", "ord_in_thread": 0, "title": "Trojans beat Bears for EPC Girls Soccer title", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Trojans beat Bears for EPC Girls Soccer title Friday, October 23, 2015 Pleasant Valley’s Abby Leach goes toward the ball as Parkland’s Jenna Kshatri comes in from behind. The Trojans defeated the Bears 5-1 to win the EPC championship. DON HERB/SPECIAL TO THE TIMES NEWS Copyright - DonHerb By CHUCK HIXSONTNSPORTS@tnonline.com \nWith the alignment of the EPC, Pleasant Valley hadn’t faced Parkland during the regular season. \nThat unfamiliarity led to the two teams having to feel one another out early on, causing a slow start to the championship contest between the two teams. \nParkland, the top seed in the EPC Playoffs, rode a 1-0 lead into halftime, but came away with a four-goal barrage in the second half to take a 5-1 win and their second straight EPC Championship. \n“We hadn’t played Pleasant Valley this season and we didn’t know anything about them,” admitted Parkland coach Al Haddad. “We gave them three things to focus on at the half and in the second half, they just exploded.” \nFive different players scored for Parkland, with Michaela Cohick getting things started when she scored at 27:28 of the first-half to put the Lady Trojans up 1-0. Brooke Schutter, Emily Piston, Becca Ventura and Rachel Medlar all scored for Parkland in the second-half. \n“We played well in the first half,” said Lady Bears coach Derek Strohl. “They changed some things at halftime and we weren’t able to find the right adjustments to correct that.” \nPleasant Valley, who came in seeded seventh and beat higher seeded Easton and Whitehall to reach the finals, had trouble pushing the ball onto the Parkland side of the field throughout the game, thanks to a staunch Parkland defense. The Lady Bears weren’t able to get a solid or clear shot at the goal all night. \n“The score doesn’t indicate how much effort they gave tonight, but Parkland is just a better team,” admitted Pleasant Valley coach Derek Strohl. “We’ve got to find better ways to clear the ball, but overall, it was a good team defensive effort. \nWith just eight-seconds left in the game, Maliyah Jones broke down the center of the field and fired a shot past goalkeeper Olivia Schantz to make it a 5-1 game. \n“I’m glad we were able to score one, no matter how much time was left on the clock, to give us something positive to take out of it. We’ve just got to keep working,” said Strohl. \nThe Lady Bears will now prepare for districts, which begin next week. Strohl believes that his girls won’t spend time agonizing over the loss and will refocus their sights on going back to work in districts. \n“We’ve had it rough,” said Strohl of his team’s run through the EPC Playoffs. “We’ve played three of the best teams in the area and played well, we just have to take that into districts and realize that we can play with these teams.” \nNO STREAKING ALLOWED ... Jones’ goal with eight seconds left to play ruined Parkland’s attempt to extend their shutout streak to 17 straight games. It was the first goal they allowed since a 4-1 win over Nazareth on September 12. \nTHE STAR TREATMENT ... Pleasant Valley seniors Abigail Leach and Erica Neff were named to the EPC All-Conference Third Team following the championship game against Parkland. \nSENIOR TIME ... Strohl had a senior-laden lineup on the field when one of their own, senior Maliyah Jones, scored their lone goal. “The seniors showed their leadership by not giving up and working to get that goal.”", "external_links": [], "published": "2015-10-23T23:00:00.000+03:00", "crawled": "2015-10-24T08:25:43.216+03:00", "highlightTitle": ""}