{"organizations": [], "uuid": "849f688ee0e8959c98bb23beaba6bba27cc17909", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "savannahnow.com", "main_image": "http://savannahnow.com/sites/default/files/images/sms-default-facebook-share.jpg", "site_section": "http://savannahnow.com/", "section_title": "savannahnow.com | Savannah Georgia's source for News, Entertainment, Sports, Weather, Classifieds, Jobs, Autos, Real Estate and St. Patricks Day", "url": "http://savannahnow.com/sports/2015-10-16/alcs-royals-open-series-5-0-win", "country": "US", "title": "ALCS: Royals open series with 5-0 win |", "performance_score": 0, "site": "savannahnow.com", "participants_count": 1, "title_full": "ALCS: Royals open series with 5-0 win | savannahnow.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T19:39:00.000+03:00", "replies_count": 0, "uuid": "849f688ee0e8959c98bb23beaba6bba27cc17909"}, "author": "Dave Skretta", "url": "http://savannahnow.com/sports/2015-10-16/alcs-royals-open-series-5-0-win", "ord_in_thread": 0, "title": "ALCS: Royals open series with 5-0 win |", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Dave Skretta KANSAS CITY, Mo. — Edinson Volquez gave the Blue Jays another reason to rue him Friday night.\nThe Royals right-hander combined with three relievers on a three-hitter, Salvador Perez hit a soaring home run off Toronto starter Marco Estrada, and Kansas City rolled to a 5-0 victory in Game 1 of their American League Championship Series.\nVolquez (1-1) ramped up his fastball to 97 mph to slice through a potent Blue Jays offense, never allowing a runner past second base over six innings. His only trouble occurred when he walked the first two batters in the sixth, but he wiggled out of it without any damage.\nThe Royals’ bullpen finished off the club’s eighth consecutive ALCS victory.\nAlcides Escobar and Lorenzo Cain drove in runs off Estrada (1-1), while Eric Hosmer and Kendrys Morales tacked on two more\noff LaTroy Hawkins to put the game away.\nThe Blue Jays’ three hits were their fewest ever in a postseason game.\nAs if the outcome wasn’t bad enough for them, designated hitter Edwin Encarnacion left in the eighth inning to get X-rays on the middle finger of his left hand. The initial report was a strain of the ligament and Encarnacion was listed as day-to-day.\nThe Royals will try to take a 2-0 series lead when they send Yordano Ventura to the mound today. Toronto will counter with former Cy Young Award winner David Price.\nThe teams entered the best-of-seven series with plenty of history.\nTo start with, the defending AL champs beat Toronto in the 1985 league championship series. But far more recently were the tense, benches-clearing game that the teams played at Rogers Centre in August. Volquez was right in the thick of things.\nThe veteran starter kept pitching the Blue Jays inside, finally hitting Josh Donaldson with a fastball in the first inning. Tensions escalated as the game went on, with Toronto reliever Aaron Sanchez returning the favor by hitting Escobar to trigger a benches-clearing scuffle.\nToronto ab r h bi Kan City ab r h bi\nRevere lf 4 0 0 0 AEscor ss 3 2 2 1\nDnldsn 3b 3 0 1 0 Zobrist 2b 4 1 1 0\nBautist rf 1 0 0 0 L.Cain cf 4 0 1 1\nEncrnc dh 3 0 0 0 Hosmer 1b 4 0 1 1\nSmoak ph-dh 1 0 0 0 KMorls dh 3 0 1 1\nColaell 1b 4 0 1 0 Mostks 3b 4 0 0 0\nTlwtzk ss 4 0 0 0 S.Perez c 3 1 1 1\nDNavrr c 4 0 0 0 AGordn lf 3 1 1 0\nPillar cf 3 0 0 0 Rios rf 3 0 0 0\nGoins 2b 3 0 1 0 Orland rf 0 0 0 0\nTotals 30 0 3 0 Totals 31 5 8 5\nToronto 000 000 000 — 0\nKansas City 002 100 02x — 5\nE_Donaldson (1), Moustakas (1). DP_Toronto 1. LOB_Toronto 9, Kansas City 4. 2B_A.Escobar 2 (2), Hosmer (1), A.Gordon (1). HR_S.Perez (1). SB_L.Cain (1). S_Goins. SF_K.Morales.\nToronto IP H R ER BB SO\nEstrada L,0-1 5 1/3 6 3 3 0 6\nLoup 2-3 0 0 0 0 0\nLowe 1 0 0 0 0 1\nHawkins 1 2 2 2 0 0\nKansas City IP H R ER BB SO\nVolquez W,1-0 6 2 0 0 4 5\nK.Herrera H,1 1 0 0 0 0 2\nMadson H,1 1 1 0 0 1 0\nHochevar 1 0 0 0 0 0\nHBP_by Hawkins (A.Escobar).\nUmpires_Home, Tony Randazzo; First, Laz Diaz; Second, John Hirschbeck; Third, Hunter Wendelstedt; Left, Dan Iassogna; Right, Jeff Nelson.\nT_3:15. A_39,753 (37,903).\nAfterward, Volquez said Donaldson was “crying like a baby” over his inside approach. And to nobody’s surprise, Donaldson was booed lustily by the Kansas City crowd on Friday night.\nThat was the only reason for the packed house to boo, though.\nAfter squandering a scoring chance in the first inning, the Royals jumped ahead in the third. Alex Gordon led off with a double, Escobar sent an RBI double down the right-field line, and Cain’s two-out single helped Kansas City — so accustomed to playing from behind — to a 2-0 lead.\nPerez added his third homer of the postseason on the first pitch he saw in the fourth, the cheering of the throaty, flag-waving crowd reaching a crescendo as it passed over the wall.\nAs shaky was Estrada was, Volquez was downright stoic as he circled the mound.\nHe did not allow a hit until his 56th pitch, when Chris Colabello chopped a single up the middle with two outs in the fourth. It snapped a postseason hitless streak of 10 2/3 innings for the Royals, one out shy of matching the record set by the New York Yankees in 1939.\nThe biggest of the Blue Jays’ big bats made the quietest outs, too.\nJose Bautista went down looking in the fourth inning, while Encarnacion struck out looking in the sixth. Donaldson managed a walk off Volquez but little else, while Tulowitzki — one of the Blue Jays’ big deadline acquisitions — went 0 for 4 with two strikeouts.", "external_links": ["http://sav-cdn.com/sites/all/themes/savannahnow/images/blank.gif"], "published": "2015-10-16T19:39:00.000+03:00", "crawled": "2015-10-17T12:21:31.876+03:00", "highlightTitle": ""}