{"organizations": [], "uuid": "a398617215dcf0df639afd90134644b5493d0cb7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.themalaysianinsider.com", "main_image": "http://www.themalaysianinsider.com/assets/uploads/articles/lydia-ko-reuters-010415.JPG", "site_section": "http://www.themalaysianinsider.com/rss/sports", "section_title": "The Malaysian Insider : Sports", "url": "http://www.themalaysianinsider.com/sports/article/koreas-ji-keeps-halfway-lead-in-taiwan-lydia-ko-1-shot-behind", "country": "MY", "title": "Korea’s Ji keeps halfway lead in Taiwan, Lydia Ko one shot behind", "performance_score": 0, "site": "themalaysianinsider.com", "participants_count": 0, "title_full": "Korea’s Ji keeps halfway lead in Taiwan, Lydia Ko one shot behind", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T14:37:00.000+03:00", "replies_count": 0, "uuid": "a398617215dcf0df639afd90134644b5493d0cb7"}, "author": "", "url": "http://www.themalaysianinsider.com/sports/article/koreas-ji-keeps-halfway-lead-in-taiwan-lydia-ko-1-shot-behind", "ord_in_thread": 0, "title": "Korea’s Ji keeps halfway lead in Taiwan, Lydia Ko one shot behind", "locations": ["Taiwan", "Korea"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Lydia Ko"], "text": "Korea’s Ji keeps halfway lead in Taiwan, Lydia Ko one shot behind Published: 23 October 2015 7:37 PM \nLydia Ko, who was three shots behind South Korea's Ji Eun-Hee Ji for a tie of seventh place after the opening round of the US$2 million (RM8.4 million) Fubon LPGA Taiwan Championship,, fires a five-under 67 today for a total of 136 that makes her only one shot away from Ji. – Reuters filepic, October 23, 2015. South Korea's Ji Eun-Hee, overnight leader in the US$2 million (RM8.4 million) Fubon LPGA Taiwan Championship, carded a three-under-par 69 Friday for a two-day total of 135 and a halfway lead into the weekend. \nKiwi golfer Lydia Ko, who was three shots behind Ji for a tie of seventh place after the opening round, fired a five-under 67 for a total of 136 that made her only one shot away from Ji. \nAnother shot behind for a tie of third place were British Charley Hull and China's Lin Xi Yu, followed by Korean duo Ryu So Yeon and Yoo Sun Young who both had a two-day total of 139. \nJi, who tied ninth in the 2014 Fubon LPGA Taiwan Championship, struck a double bogey on hole 6 that offset her two birdies in the first two holes. She then regained momentum by netting three consecutive birdies from hole nine. \nThe 29-year-old said she had not been on good form and was suffering from a back injury. \n\"I hurt my middle back today, this morning actually... bothering me on my swing, especially with my driver. So I missed a lot of fairways today.\" \nWhen asked if she was annoyed by intermittent rain and high winds, she said: \"Weather is going to be like this tomorrow and the day after, so trying to be patient every day and just focus on my play.\" \nKo, currently world number two and aiming for her 10th title, collected seven birdies against two bogeys. \n\"It was a slow start. I gave myself a few opportunities the first couple holes, and I didn't make any,\" she said. \nSuzann Pettersen of Norway fired a six-under-par of 66, the lowest of the day, which made her two-round total 140 and put her in joint seventh place. – Reuters, October 23, 2015. \nShare with others", "external_links": [], "published": "2015-10-23T14:37:00.000+03:00", "crawled": "2015-10-23T15:48:25.196+03:00", "highlightTitle": ""}