{"organizations": [], "uuid": "7b43a5ce11a6a7d1141996f35956134b002790bc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "http://images.tribuneindia.com/cms/gall_content/2015/10/2015_10$largeimg11_Sunday_2015_225658603.jpg", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/jammu-kashmir/gdc-paloura-awaits-permanent-building/144661.html", "country": "US", "title": "GDC Paloura awaits permanent building", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "GDC Paloura awaits permanent building", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "7b43a5ce11a6a7d1141996f35956134b002790bc"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/jammu-kashmir/gdc-paloura-awaits-permanent-building/144661.html", "ord_in_thread": 0, "title": "GDC Paloura awaits permanent building", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tribune News Service\nJammu, October 11\nStudents of Government Degree College (GDC), Paloura, are awaiting a permanent building and infrastructure. The college has been shifted to the old university campus or old Government College of Engineering and Technology (GCET) temporarily since October 2009. The college was established at Government Higher Secondary School (GHSS) in September 2008. Initially, it began functioning from two rooms of the school. On October 6, 2009, the Higher Education Department decided to shift it to the old university campus after it gained popularity among students. The college is offering courses in English, Hindi, Urdu, Dogri, education, history, political science, sociology and environmental sciences and has enrolled more than 1,000 students this academic session. Sources said sharing the university campus with other institutions had restricted the college authorities from taking decisions on renovation or expansion of its building. Students are also not happy with infrastructure available at the college. The sources said the college authorities were in a fix over whether to stay or leave the building due to the alleged delay in finalisation of the IIT campus by the state government. “One block of the campus is being utilised by the Government SPMR College of Commerce to run its programmes such as BBA, BCA while other is possessed by GCET though the institution is functioning from its new building,” said Arunima, a student. “The building needs the immediate renovation but to no avail,” she said. College principal Rita Bhagat said, “Despite having limited infrastructure, we are trying to fulfil necessities of aspirants— be it related to academic or extra-curricular activities.” When asked about any proposal to shift the college to other building, she said the concerned higher authorities would decide it.", "external_links": [], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-12T00:06:13.799+03:00", "highlightTitle": ""}