{"organizations": [], "uuid": "308038018956b212d4724a2066cb997cb1531c06", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48531/c", "section_title": "Sports - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30292066/vogo-chooses-wall-street-communications-as-content-marketing-agency-of-record", "country": "US", "title": "VOGO Chooses Wall Street Communications as Content Marketing Agency of Record", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "VOGO Chooses Wall Street Communications as Content Marketing Agency of Record - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "308038018956b212d4724a2066cb997cb1531c06"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30292066/vogo-chooses-wall-street-communications-as-content-marketing-agency-of-record", "ord_in_thread": 0, "title": "VOGO Chooses Wall Street Communications as Content Marketing Agency of Record", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Wall Street Communications\nSALT LAKE CITY , Oct. 19, 2015 /PRNewswire/ -- VOGO, a leader in mobile video technology products that offer a compelling live-media experience for in-venue spectators, has selected Wall Street Communications to provide comprehensive content marketing to support the company's global business operations. Wall Street Communications will work with VOGO to expand its presence worldwide through a multidisciplinary public relations, marketing, and communications program.\n\"As a previous client of Wall Street Communications for many years, I have the utmost confidence in their ability to get the job done,\" said Christophe Carniel , VOGO CEO and co-founder. \"Sports teams and venues are looking for ever more exciting and compelling ways to engage fans, and they're turning to nontraditional means of video delivery to do it. The Wall Street team understands the complexities of multiscreen video in today's rapidly evolving media industry. I know we'll be in good hands as we develop a strategy for expanding our presence and driving new business globally.\"\nVOGO's flagship application for mobile devices, VOGO SPORT, enables immersive and enhanced in-venue viewing of live stadium sports and other arena events. Spectators can use their smartphones or tablets to watch the action live and in real time from several different camera views -- all from the comfort of their seats.\nVOGO SPORT also offers sponsors a powerful new outlet for in-venue advertising and promotions, and venue owners can deploy VOGO SPORT in any stadium or sports venue without a significant outlay for IT infrastructure.\n\"In only two years, VOGO has grown to become one of the most dynamic and innovative young companies in the world of mobile sports video delivery. Across Europe , VOGO's technology has been used to cover many high-profile and international championships in partnership with broadcasters, event management companies, and sports associations and teams,\" said Chris Lesieutre , president at Wall Street Communications. \"We're looking forward to applying our broad content marketing expertise to help VOGO roll out this powerful new technology to sports teams around the world.\"\nWall Street Communications offers business-to-business marketing communications services to technology companies and industry associations in the television, motion picture, and radio industries. With fundamental operating principles of accuracy, creativity, and integrity, the agency has a unique range of experience in promoting products, technologies, and services worldwide. Learn more at www.wallstcom.com .\n releases/vogo-chooses-wall-street-communications-as-content-marketing-agency-of-record-300160348.html\n ", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=LA28342&Transmission_Id=201510190530PR_NEWS_USPR_____LA28342&DateId=20151019", "http://www.prnewswire.com/news-releases/vogo-chooses-wall-street-communications-as-content-marketing-agency-of-record-300160348.html", "http://www.wallstcom.com/", "http://www.xmlnews.org/ns/"], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-19T14:08:08.706+03:00", "highlightTitle": ""}