{"organizations": [], "uuid": "8b0379bff65ba03f614eabb46f77ae5679e8a3cf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailyherald.com", "main_image": "http://www.dailyherald.com/gfx/site/logos/dailyherald_marble_300.jpg", "site_section": "http://www.dailyherald.com/rss/feed/?feed=sports_all", "section_title": "DailyHerald.com &gt; Sports", "url": "http://www.dailyherald.com/article/20151016/sports/151019006/", "country": "US", "title": "In battle of sabermetrics, Cubs clobber Mets", "performance_score": 0, "site": "dailyherald.com", "participants_count": 1, "title_full": "In battle of sabermetrics, Cubs clobber Mets", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T03:47:00.000+03:00", "replies_count": 0, "uuid": "8b0379bff65ba03f614eabb46f77ae5679e8a3cf"}, "author": "Bruce Miles", "url": "http://www.dailyherald.com/article/20151016/sports/151019006/", "ord_in_thread": 0, "title": "In battle of sabermetrics, Cubs clobber Mets", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK -- Back in the 1980s, the sabermetrics revolution really took off, thanks to Bill James publishing his annual Baseball Abstract.\nIn one of his editions, he came up with a formula for predicting the winner of postseason series. Given the advancements in sabermetrics today, this formula seems quaint. Let's put it to work for the National League championship series between the Cubs and Mets:\n• Give 1 point per half-game difference in record. The Cubs finished the regular season 97-65 while the Mets were 90-72. That's 14 points to the Cubs.\n• Give 3 points to the team with more runs scored. Award 3 to the Cubs.\n• Give 14 points to the team with fewer doubles. (Back in the day, James warned \"not to bet a dime on a team that hits a lot of doubles.\") Award 14 to the Cubs.\n• Give 12 points to the team with more triples. That's 12 for the Cubs.\n• Give 10 points to the team with more home runs. The Mets get on the board with 10 points.\n• Give 8 points to the team with the lower batting average. Each team hit .244, so that's a wash.\n• Give 8 points to the team with fewer errors. The Mets get 8.\n• Give 7 points to the team that turned more double plays. That's 7 for the Mets.\n• Give 7 points to the team whose pitchers walked more batters. The Cubs get the 7.\n• Give 19 points to the team with more shutouts. Award 19 to the Cubs.\n• Give 15 points to the team with the lower ERA. The Cubs edged the Mets, 3.36 to 3.43 to give the Cubs 15 points.\n• Give 12 points to the team in postseason play more recently. That would be 2008 for the Cubs to 2006 for the Mets, although both teams have changed completely. But by the formula, the Cubs get 12 points.\n• Give 12 points to the team that led in head-to-head competition. The Cubs swept the season series from the Mets, but four of those games were in May, and three were in July. The Mets look quite a bit different now, but the Cubs get the 12 points.\nAdding it all up, the Cubs win by a landslide, 101 points to 25.\nDoes it mean anything for the NLCS? Maybe. Maybe not, but let's see how it all adds up when the games are played.\nRelated Article\nLester: I always had 2015 World Series in mind Get great articles like this sent to your inbox! Click here to sign up for the Cubs Newsletter No Thanks Sports MLB Cubs Baseball Pro Sports Newsletter", "external_links": ["https://twitter.com/share"], "published": "2015-10-17T03:47:00.000+03:00", "crawled": "2015-10-17T06:38:02.798+03:00", "highlightTitle": ""}