{"organizations": [], "uuid": "2fb9d5d6e794dcdb2aab2713599b458f1db52f4f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.timesunion.com", "main_image": "http://ww1.hdnux.com/photos/41/45/44/8804624/3/rawImage.jpg", "site_section": "http://www.timesunion.com/default/feed/default/feed/Sports-News-64.php", "section_title": "Sports News", "url": "http://www.timesunion.com/sports/article/Harvey-ready-to-go-twice-in-NLCS-6575172.php", "country": "US", "title": "Harvey ready to go twice in NLCS", "performance_score": 0, "site": "timesunion.com", "participants_count": 1, "title_full": "Harvey ready to go twice in NLCS - Times Union", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T06:22:00.000+03:00", "replies_count": 0, "uuid": "2fb9d5d6e794dcdb2aab2713599b458f1db52f4f"}, "author": "Combined wire services", "url": "http://www.timesunion.com/sports/article/Harvey-ready-to-go-twice-in-NLCS-6575172.php", "ord_in_thread": 0, "title": "Harvey ready to go twice in NLCS", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: Julie Jacobson Image 1 of / 1 Caption\nClose\nImage 1 of 1 New York Mets pitcher Matt Harvey answers questions for the media during a news conference, Friday, Oct. 16, 2015, in New York. The Mets will face the Chicago Cubs in Game 1 of the NLCS on Saturday. (AP Photo/Julie Jacobson) ORG XMIT: NYJJ122 New York Mets pitcher Matt Harvey answers questions for the media during a news conference, Friday, Oct. 16, 2015, in New York. The Mets will face the Chicago Cubs in Game 1 of the NLCS on Saturday. (AP ... more Photo: Julie Jacobson Harvey ready to go twice in NLCS 1 / 1 Back to Gallery Matt Harvey said the last thing he wants to talk about at this stage is limitations on his pitching, but there the questions were again Friday as the Mets returned to Citi Field in advance of Game 1 of the NLCS.\nAsked whether he plans on pitching Harvey, who will start Game 1 Saturday, more than once in the series, manager Terry Collins quickly answered, \"Absolutely.\"\nShortly thereafter, Harvey was asked whether he would like to get more than one crack at the Cubs if needed.\n\"Absolutely,\" he said. \"Going into a seven-game series and having the opportunity to line up for two games, I couldn't be happier and more ready for it.\"\nIf either team sweeps, that will not be necessary. But Game 5 in Chicago on Thursday night would give Harvey a normal four days' rest.\nTickets: As expected, prices on the resale market for tickets to the Cubs-Mets NLCS are shattering previous records. The average asking price for the four games at Citi Field was $838.40. That is a bargain compared to the three games at Wrigley Field, where the average was $1,228.16. The $941.69 overall average for the series is the highest for any LCS. The average asking price for Game 1 at Citi Field: $662.64, with a low of $237. Pepsi Porch tickets with a face value of $55 for Game 1 were going for an average asking price of $399 Friday morning.\nDodgers: The Los Angeles Times reported that Zack Greinke is expected to opt out of his contract, walking away from three years and $71 million with the likelihood he could get a guarantee for double, maybe triple, that money. The Dodgers are not expected to be interested in a contract that would guarantee Greinke that kind of money into his late 30s.\nRed Sox : The Red Sox are mourning the death of former prospect and scout Chuck Koney , who died Monday at the age of 90. He had been a scout in the organization for 42 years from 1951 through 1992.\nPirates: A video appears to show a Pittsburgh police officer egging on the crowd while ejecting a Cubs fan from last week's National League wild-card game at PNC Park. The officer slammed the fan to the ground before ejecting him.", "external_links": ["http://ww1.hdnux.com/photos/41/45/44/8804624/3/920x920.jpg", "http://ww1.hdnux.com/photos/41/45/44/8804624/3/square_gallery_thumb.jpg"], "published": "2015-10-17T06:22:00.000+03:00", "crawled": "2015-10-17T08:24:15.909+03:00", "highlightTitle": ""}