{"organizations": [], "uuid": "54016d0a432839b5477571f64b2ea775f6a1d52f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/2/8/161351/World/Region/Saudi-activist-jailed-under-terrorism-law-Amnesty.aspx", "country": "EG", "title": "Saudi activist jailed under 'terrorism' law: Amnesty - Region - World", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Saudi activist jailed under 'terrorism' law: Amnesty - Region - World - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "54016d0a432839b5477571f64b2ea775f6a1d52f"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/2/8/161351/World/Region/Saudi-activist-jailed-under-terrorism-law-Amnesty.aspx", "ord_in_thread": 0, "title": "Saudi activist jailed under 'terrorism' law: Amnesty - Region - World", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Saudi urges Iran to stop 'meddling' in neighbourhood Five killed in Saudi Shia shooting claimed by ISIS UPDATED; Gunman opens fire on Saudi Shia gathering: TV Saudi Arabia on Monday jailed a civil rights activist for 10 years using a counter-terrorism law designed to stifle free speech, Amnesty International said.\nAbdulkareem al-Khoder is one of 11 founding members of the Saudi Civil and Political Rights Association (ACPRA) who are already behind bars or on trial for calling for political and human rights reforms, the London-based watchdog said.\n\"The Saudi Arabian authorities today continued their cynical use of a repressive and overly vague counter-terrorism law to purge the kingdom's small and embattled civil society,\" Amnesty said.\nKhoder was jailed by a criminal court for eight years in June 2013 before his sentence was overturned.\nHe remained arbitrarily detained and his case was re-heard by a Specialised Criminal Court, which handed down the higher sentence, Amnesty said.\nKhoder is the latest activist convicted by the special court whose jurisdiction is terrorism, activists say.\n\"By using abusive counter-terrorism legislation and a deeply deficient specialised court to intimidate and lock up human rights defenders, Saudi Arabia is sending a chilling message that anyone who speaks out will be purged,\" said James Lynch, of Amnesty's Middle East and North Africa programme.\nKhoder was accused of offences including disobeying the ruler, inciting disorder by calling for demonstrations, and taking part in founding an unlicensed organisation, Amnesty said, describing him as a former professor in the Faculty of Islamic Jurisprudence at Al-Qassim University.\nAnother ACPRA member, Abdulrahman al-Hamid, was sentenced by the specialised court last Wednesday to nine years in prison, Amnesty said.\nIn a separate case, also on Wednesday, the specialised court sentenced human rights defender Abdulaziz al-Senaidi to eight years in prison, said another watchdog, the Gulf Center for Human Rights.\nSenaidi, arrested in March, was charged over a petition calling for public demonstrations, and was accused of inciting public opinion via his Twitter account, the Gulf Center said.\nKhoder's conviction came during a visit to Riyadh by Germany's Foreign Minister Frank-Walter Steinmeier, who met with King Salman.\nSteinmeier said he had discussed \"individual cases\" of human rights, including that of detained Saudi blogger Raif Badawi who was sentenced to 1,000 lashes and 10 years in jail for insulting Islam.\nGermany's top diplomat said he had underlined, very explicitly, \"that we are waiting for progress\".", "external_links": [], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-20T04:11:33.960+03:00", "highlightTitle": ""}