{"organizations": [], "uuid": "11afb3e3b89450dfe844a3a5b02a266464dfcc2b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reviewjournal.com", "main_image": "http://www.reviewjournal.com/sites/default/files/defaultimage.jpg", "site_section": "http://www.reviewjournal.com/sports", "section_title": "Sports | Las Vegas Review-Journal", "url": "http://www.reviewjournal.com/sports/betting/horse-racing-today-santa-anita-october-18-0", "country": "US", "title": "Horse Racing: Today at Santa Anita, October 18", "performance_score": 0, "site": "reviewjournal.com", "participants_count": 1, "title_full": "Horse Racing: Today at Santa Anita, October 18 | Las Vegas Review-Journal", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T04:31:00.000+03:00", "replies_count": 0, "uuid": "11afb3e3b89450dfe844a3a5b02a266464dfcc2b"}, "author": "Richard Eng", "url": "http://www.reviewjournal.com/sports/betting/horse-racing-today-santa-anita-october-18-0", "ord_in_thread": 0, "title": "Horse Racing: Today at Santa Anita, October 18", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Post Time 1 p.m.\nRace 1 – 6 furlongs, Purse $28,000, Starter allowance $40,000, 3-year-olds and up\n2 Blue Anchor – Woke up nicely in last wearing blinkers on for the first time; big rider switch to Rafael Bejarano when facing winners for the first time.\n1 Kenjisstorm – Chance to be lone early speed and Santiago Gonzalez is not afraid to grab command early; should try and play catch me if you can.\nLong Shot – 6 Hot Lightning\nRace 2 – 6 furlongs, $70,000 Speakeasy, 2-year-olds\n1 Blameitonthelaw – Has chased the best in the division his last two starts; suspect he can sit a trip on the cutback and kick in with a nice late rally.\n5 Toews On Ice – Logical chalk off a very impressive win in last; did it in a stakes at Los Alamitos which lead to a generous 9/1 odds on a Bob Baffert colt.\nLong Shot – 2 Street Vision\nRace 3 – 1 1/16th miles, Purse $17,000, Claiming $10,000, 3-year-olds and up\n3 Broadway Nika – Was overmatched in last while facing $18K charges; is dropped back down in class by trainer Peter Miller where he faces his good friends tonight.\n5 The Mad Hungarian – Beat this kind in last, but the thing you learn about cheaper horses is they don't, or can't, often repeat their last race; is a hard trier.\nLong Shot – 4 Carlot Cowboy\nRace 4 – 6 ½ furlongs (turf), Purse $55,000, Optional claiming $62,500, 3-year-olds and up\n7 Bluegrass Bronco – When a horse wins down the hill, they usually keep running well down the hill; has shown a lot of early talent as a strong turf sprinter.\n9 Aotearoa – Has only tried the hill once and was no good; I suspect he'll do better this time on the big cut back in distance, will sit a trip and come flying late.\nLong Shot – 6 Forever Juanito\nRace 5 – 5 ½ furlongs, Purse $17,000, Maiden claiming $20,000, 3-year-olds and up\n5 Captain Carchy – Been nibbling with 6-of-8 in the money finishes; this field is full of slowpokes and most have had multiple chances without improving.\n4 Run the Show – Been away two full years, but faces weaklings dropping down from MSW to maiden claiming; is also a first time gelding, need not be much to compete.\nLong Shot – 6 Desert Express\nRace 6 – 5 ½ furlongs, Purse $52,000, Maiden special weights, Fillies, 2-year-olds\n2 C. C. Zipp – Of the ones with experience, she is by far the most accomplished; HOF trainer Jerry Hollendorfer adding blinkers on for more focus and even more speed.\n8 Sudden Fame – Was bet down to 6/5 favorite in her career debut and finished a non-threatening third; HOF trainer Richard Mandella babies will improve with experience.\nLong Shot – 3 Adios Princess\nRace 7 – 1 mile (turf), Purse $22,000, Claiming $25,000, 3-year-olds and up\n10 Royal Banker – Was claimed three races back for trainer Doug O'Neill for $32K, now is dropped down for $25K; big rider switch to main man Rafael Bejarano.\n3 Silver Torch – Gets class relief tonight so that should improve his chances; trainer Bob Hess is putting the blinkers on for extra focus and energy.\nLong Shot – 7 Dynamite Ride\nRace 8 – 5 furlongs, Purse $59,000, Optional claiming $100,000, 3-year-olds and up\n3 Five Palms – Has not been out since May for HOF trainer Bob Baffert; he returns in a turn back spot so don't expect the same kind of early speed, but could finish well.\n5 Oil – Eked out a hard fought win in a turf sprint last time; has done well on real dirt but has nibbler tendency with five seconds among eight main track starts.\nLong Shot – 4 Rocket Heat\nRace 9 – 1 mile (turf), Purse $52,000, Maiden special weights, Fillies and mares, 3-year-olds and up\n9 Perdona – Mario Gutierrez won 5 races on Thursday in just 5 mounts; obviously he is riding in fine form and will give this filly a chance if she is ready to fire.\n6 Margaret Reay – The Zayat Stables is better know for American Pharoah, but they have others that run; trainer Tom Proctor adding blinkers on to find the answer.\nLong Shot – 5 Boat Drinks\nBest Bet - 2 Blue Anchor (race 1)\nSanta Anita Saturday - Picks/Winners/Mutuels, 18/4/$23.40; Long Shots, 9/1/$10.00; Best Bet, 1/1/$3.40\nSanta Anita Totals - 237/51/$299.80; Long Shots, 119/26/$324.00; Best Bets, 12/4/$14.40\nSIMULCAST PLAY OF THE DAY - #2 Moonlit Meteor (9/2) in race 9 at Keeneland. For scoring purposes, we'll make a hypothetical $2 win, place and show bet, $6 total. On Saturday, S'Marvelous won at Belmont Park paying $5.30 to win, $3.40 to place and $3.00 to show. Stats - 155/103/$775.10;\nFollow him on Twitter: @richeng4propick\nCutler, Bears a bargain as... Michigan State miracle puts... Comment section guidelines The below comment section contains thoughts and opinions from users that in no way represent the views of the Las Vegas Review-Journal or GateHouse Media. This public platform is intended to provide a forum for users of reviewjournal.com to share ideas, express thoughtful opinions and carry the conversation beyond the article. Users must follow the guidelines under our Commenting Policy and are encouraged to use the moderation tools to help maintain civility and keep discussions on topic.\n ", "external_links": ["http://lasvegasreviewjournal.disqus.com/?url=http%3A%2F%2Fwww.reviewjournal.com%2Fsports%2Fbetting%2Fhorse-racing-today-santa-anita-october-18-0", "http://twitter.com/richeng4propick"], "published": "2015-10-18T04:31:00.000+03:00", "crawled": "2015-10-19T17:23:38.412+03:00", "highlightTitle": ""}