{"organizations": [], "uuid": "9077c1666eb929d02fed7ffb9ceef83b11c75a9f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxsports.com", "main_image": "http://a.fssta.com/content/dam/fsdigital/RSN/Kansas%20City/2015/10/05/PI-CFB-KU-Ryan-Willis-100515.vresize.1200.675.high.21.jpg", "site_section": "http://api.foxsports.com/v1/rss?partnerKey=zBaFxRyGKCfxBagJG9b8pqLyndmvo7UU&tag=kansas-city", "section_title": "FOX Sports Digital", "url": "http://www.foxsports.com/kansas-city/story/ku-loses-top-two-qbs-to-injuries-freshman-willis-next-man-up-vs-no-3-baylor-100515", "country": "", "title": "KU loses top two QBs to injuries; freshman Willis next man up vs. No. 3 Baylor", "performance_score": 0, "site": "foxsports.com", "participants_count": 0, "title_full": "KU loses top two QBs to injuries; freshman Willis next man up vs. No. 3 Baylor", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T23:16:00.000+03:00", "replies_count": 0, "uuid": "9077c1666eb929d02fed7ffb9ceef83b11c75a9f"}, "author": "", "url": "http://www.foxsports.com/kansas-city/story/ku-loses-top-two-qbs-to-injuries-freshman-willis-next-man-up-vs-no-3-baylor-100515", "ord_in_thread": 0, "title": "KU loses top two QBs to injuries; freshman Willis next man up vs. No. 3 Baylor", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Willis", "KU"], "text": "Updated Oct 5, 2015 at 4:30p ET \nLAWRENCE, Kan. -- Kansas quarterback Montell Cozart is out with a shoulder sprain and backup Deondre Ford is done for the season with a thumb injury, forcing freshman Ryan Willis to start Saturday's against No. 3 Baylor. \nThe Jayhawks (0-4) lost top quarterback Michael Cummings to a season-ending knee injury during the spring game. Cozart was hurt in last Saturday's loss at Iowa State, while Ford sustained torn ligaments in a game at Rutgers -- when Cozart was already sidelined by an illness. \nKansas coach David Beaty announced the injuries and quarterback shakeup in a brief statement Monday, but was not available to comment. Beaty said on the Big 12's weekly teleconference earlier in the day that Cozart was still being evaluated to determine the extent of his injury. \nWillis filled in for Cozart on the final few series against the Cyclones, going 8 of 16 for 100 yards. Before that game, his only experience was two plays in the opener against South Dakota State. \n\"He extended some drives, some pretty nice throws on that last drive. He's the next man up,\" Beaty said after the game, \"and his turn came, so we'll see where we go from there.\" \nWillis was at least recruited to Kansas to play the position, even if he only has about two dozen snaps under his belt. T.J. Millweard, a transfer from UCLA, is listed as the backup with walk-on Keaton Perry the No. 3 quarterback. Another freshman, Carter Stanley, is not listed on the most recent depth chart, indicating he is likely to redshirt this season. \nOf course, the way quarterbacks are dropping, nothing is out of question. \nLookin' good! Check out our gallery of Big 12 football cheerleaders . Denny Medley / USA TODAY Sports \nCozart was completing 63 percent of his passes, but had thrown just two touchdown passes and struggled to run Beaty's fast-paced, \"air raid\" offense. Ford was completing fewer than 50 percent of his throws, though his athleticism made him an interesting option under center. \nWillis is more of a pro-style, drop-back passer, which means the Kansas offense could look a bit different against Baylor (4-0) than it did through the first four games. \nThe Bears were already 42-point favorites before the injury news. \n\"Obviously a great challenge, one of the best teams in the country coming in here,\" Beaty said Monday. \"But I think it's a great opportunity, I really do. Our guys are going to be excited to play, ready to go. ... They're a good football team, a team that is where we aspire to go.\" \nThe situation at Kansas is oddly familiar to the situation at Kansas State, where wide receiver Kody Cook -- the emergency fifth-string quarterback -- had to play last Saturday against Oklahoma State due to injuries. Cook nearly helped the Wildcats to an upset of the Cowboys.", "external_links": [], "published": "2015-10-05T23:16:00.000+03:00", "crawled": "2015-10-05T23:53:43.623+03:00", "highlightTitle": ""}