{"organizations": [], "uuid": "1ed06baa1a27222d838e6ae8d949f7f222f1bd04", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "http://www.bostonherald.com/sites/default/files/media/ap/416ecfc516eb428f96045f0d7970e492.jpg", "site_section": "http://bostonherald.com/sports/revolution_soccer", "section_title": "Sports: Revolution &amp; Soccer | Boston Herald", "url": "http://bostonherald.com/sports/revolution_soccer/soccer/2015/10/russia_beats_montenegro_2_0_to_qualify_for_euro_2016", "country": "US", "title": "Russia beats Montenegro 2-0 to qualify for Euro 2016", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "Russia beats Montenegro 2-0 to qualify for Euro 2016 | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "1ed06baa1a27222d838e6ae8d949f7f222f1bd04"}, "author": "Associated Press", "url": "http://bostonherald.com/sports/revolution_soccer/soccer/2015/10/russia_beats_montenegro_2_0_to_qualify_for_euro_2016", "ord_in_thread": 0, "title": "Russia beats Montenegro 2-0 to qualify for Euro 2016", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MOSCOW — Russia qualified for next year's European championships with a 2-0 win over Montenegro on Monday, while Sweden goes into the playoffs.\nVeteran defender Oleg Kuzmin and striker Alexander Kokorin scored both Russian goals in the space of five first-half minutes to ensure Russia takes the second automatic qualifying place in Group G behind Austria, which had already qualified.\nQualification caps a dramatic turnaround under new coach Leonid Slutsky, who took charge of the team in August with the 2018 World Cup host struggling to qualify. The team has since won all four of its games following Slutsky's appointment.\n\"We coped with the task in front of us. Today's game was fairly difficult because the last match is tricky,\" Slutsky said. \"You can't let yourself relax for a second.\"\nAustria completed its unbeaten qualifying campaign with a straightforward 3-0 win over Liechtenstein, while Sweden beat Moldova 2-0 to finish third in the group and enter next month's playoffs.\nVeteran right-back Oleg Kuzmin, playing in only his third Russia game at the age of 34, scored the first goal in style in the 33rd minute, running onto a ball over the top from Igor Denisov and lunging to poke it in from a narrow angle.\nRussia doubled its lead four minutes later courtesy of Alexander Kokorin's penalty, after Montenegro's Vladimir Rodic brought down Dmitry Kombarov.\nRussia's top scorer of the qualifying campaign, Artyom Dzyuba, struggled all night, missing a string of good chances. Shortly after Kokorin's goal, Dzyuba was free in the box in front of an empty net but hit the ball over the bar. Twice more he missed the target when in a good position to score.\nMontenegro started well but faded after Russia's goals, although Fatos Beciraj narrowly missed the target in the 58th minute.\nSlutsky celebrated with his players on a lap of honor, embracing goalscorer Kuzmin and others. Slutsky now faces a tough decision, since Russian Football Union president Vitaly Mutko, who is also Russia's Sports Minister, says he will not be allowed to continue splitting his time with CSKA Moscow if he stays on with Russia.\nHowever, Slutsky's future in uncertain, since his contract only covered the qualifying phase. He is also currently dividing his time with CSKA, a situation that the Russian Football Union says it will not accept in the future.\nSlutsky was tight-lipped about his future, saying only: \"I've spoken with Vitaly Leontyevich (Mutko), we'll be speaking about it a little later.\"\nThe win carries a measure of revenge for Russia, whose players were attacked with missiles by the crowd during the first meeting between the team in Montenegro, with goalkeeper Igor Akinfeev hospitalized when he was struck on the head by a flare. The match was abandoned at 0-0 and Russia awarded a 3-0 win by default.\nNext year will mark Russia's fourth consecutive appearance at the European championships, with a best result of reaching the semifinals in 2008.\nSweden went into its final game against Moldova knowing that a win could send the team to the European championship if Russia lost.\nSwedish captain Zlatan Ibrahimovic scored his eighth goal of the qualifying campaign in the 24th minute, before Erkan Zengin doubled the lead three minutes after half time.\nAustria had qualified a month ago and finished off the campaign with a routine win over Liechtenstein's part-timers.\nThe Austrians only led 1-0 at half-time thanks to Marko Arnautovic's 12th-minute goal, but Marc Janko killed off any chance for Liechtenstein to get a point when he scored twice early in the second half.\nAustria finishes with nine wins and one draw, plus a group-leading 22 goals from 10 games. It is the first time Austria has qualified for the European championships - it participated as a co-host in 2008 - and the country's first successful qualifying campaign for any major tournament since the 1998 World Cup.", "external_links": [], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-13T02:50:09.189+03:00", "highlightTitle": ""}