{"organizations": [], "uuid": "7f08bfae6974a4b6f65738ec30c781f38b7bcfdd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reporterherald.com", "main_image": "http://extras.mnginteractive.com/live/media/site47/2015/1023/20151023__24rhsMVfballw~1.jpg", "site_section": "http://feeds.reporterherald.com/mngi/rss/CustomRssServlet/47/244119.xml", "section_title": "Sports", "url": "http://www.reporterherald.com/sports/ci_29017001/mountain-view-football-starts-rally-too-late-loss?source=rss", "country": "IL", "title": "Mountain View football starts rally too late in loss to Broomfield", "performance_score": 0, "site": "reporterherald.com", "participants_count": 1, "title_full": "Mountain View football starts rally too late in loss to Broomfield", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T07:20:00.000+03:00", "replies_count": 0, "uuid": "7f08bfae6974a4b6f65738ec30c781f38b7bcfdd"}, "author": "Sam Lounsberry \n\nFor the Reporter-Herald", "url": "http://www.reporterherald.com/sports/ci_29017001/mountain-view-football-starts-rally-too-late-loss?source=rss", "ord_in_thread": 0, "title": "Mountain View football starts rally too late in loss to Broomfield", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mountain View football starts rally too late in loss to Broomfield Eagles holds off Mountain Lions' furious rally By Sam Lounsberry \nFor the Reporter-Herald Posted: 10/23/2015 10:19:47 PM MDT \nBROOMFIELD — There seemed to be plenty of time for Mountain View to come back against Broomfield. \nThe Mountain Lions were facing just a 7-3 deficit in the third quarter, and their defense was hardly allowing the Eagles anything on offense. \nBut the Eagles were able to take advantage of extra opportunities Friday night to take down the Mountain Lions 21-17, as Mountain View started its comeback too late. \nOn back-to-to-back possessions in the third quarter, starting with their second of the half, Mountain View quarterback Dennis Landry threw interceptions to BHS defensive back Mason Keeler. Dennis Landry \nOnly the first turnover turned into a touchdown for the Eagles, courtesy of quarterback Jack Burgesser's 20-yard TD pass to Nate Lehnerz. But Landry's next pick, his third of the night, sent the Lions' offense into a panic when they regained possession faced with a 14-3 deficit to start the fourth quarter and it lost its precision until late in the game. \n\"Our goal was obviously one play at a time and getting first downs, and we weren't able to get first downs going and get our offense going, and I'll take that on myself,\" Mountain View coach Bart Mayes said. \"Obviously, I have to prepare our offense a lot better than we have in the last few weeks.\" \nIt didn't help that Burgesser was able to find Lehnerz for another touchdown strike to start the fourth quarter, this one for 21 yards to put the Eagles up 21-3 with only 9:53 to go. \nBroomfield's scores were mostly set up by its persistent running game that put the Eagles into scoring position. Running back Jalon Torres finished with a game-high 113 yards on 33 carries. \nOn its following possession, though, Mountain View looked like it had regained its footing when it went for it on fourth and very long and converted with a 40-yard gain on a pass from Landry to senior Jordan Kress. \nKress would catch another for 18 yards on the same drive, plus the Lions converted again on a fourth down to come within 3 yards of the end zone. \nBut an impressive Broomfield goal-line stand ensued, ending with Landry being sacked on fourth-and-goal with less than five minutes to play. \nThe Lions forced Broomfield to punt, and finally executed inside Eagle territory for the first time in the second half as Landry connected with Reid Nichols for a 32-yard touchdown, making the score 21-9 with 1:53 to go after a failed two-point conversion. \nNichols finished with a game-high 78 receiving yards on six catches. \nAll the Lions needed was an onside kick recovery to keep their hopes alive, and they got one from Logan Stewart. \nWithout any timeouts to stop the clock, though, it took the Lions nearly the remainder of the game to score and come within reach. The drive ended with a 3-yard Landry touchdown pass to senior Dakota Sedillo, but only 11 seconds remained in the game, enough time for a Hail Mary prayer if the Lions could recover another onside kick. \nThey would not be so lucky this time, though, as the Eagles recovered, effectively ending MVHS' longshot comeback attempt. \nMayes was still happy to see his team score those touchdowns late and put themselves in a position for final chance to win, though. \n\"It's a testament to this team,\" Mayes said. \"There's no quit in this team. They keep battling and that's a great quality.\" \nMountain View hits the road again next Friday for a contest against Skyline at 7 p.m. in Longmont.", "external_links": [], "published": "2015-10-24T07:20:00.000+03:00", "crawled": "2015-10-24T08:41:56.047+03:00", "highlightTitle": ""}