{"organizations": [], "uuid": "11354f9e0ff0d99062bccb6d12ec54da658b59b8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbssports.com", "main_image": "http://sports.cbsimg.net/images/nhl/blog/Raffi_Torres_Suspended.jpg", "site_section": "http://www.cbssports.com/partners/feeds/rss/home_news", "section_title": "Sports News : CBSSports.com", "url": "http://www.cbssports.com/nhl/eye-on-hockey/25328606/sharks-f-raffi-torres-suspended-41-games-for-illegal-check-to-head", "country": "US", "title": "Sharks F Raffi Torres suspended 41 games for illegal check to head", "performance_score": 1, "site": "cbssports.com", "participants_count": 41, "title_full": "Sharks F Raffi Torres suspended 41 games for illegal check to head - CBSSports.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T23:32:00.000+03:00", "replies_count": 46, "uuid": "16c7e7c9c231e780c5d34b387c81d7729da24fb5"}, "author": "Adam Gretz", "url": "http://www.cbssports.com/nhl/eye-on-hockey/25328606/sharks-f-raffi-torres-suspended-41-games-for-illegal-check-to-head#post-0", "ord_in_thread": 0, "title": "Sharks F Raffi Torres suspended 41 games for illegal check to head", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "It would seem that the NHL has had enough of Raffi Torres and his actions on the ice.\nThe league announced on Monday afternoon that it has suspended the Sharks forward for 41 games -- half of the 2015-16 NHL season -- for an illegal check to the head and interference on Anaheim Ducks forward Jakob Silfverberg on Saturday night night during their exhibition game.\nThis is the third-longest suspension in NHL history for an on-ice incident. Boston's Billy Coutu was banned for life in April 1927 for attacking a referee after a Stanley Cup Final game and Bruins enforcer Marty McSorley was suspended a full year for hitting Vancouver's Donald Brashear in the head with his stick.\nTorres was assessed a match penalty during the game while Silfverberg was injured and did not return. As of Monday, he still has not returned to practice.\nIn its review of the play, the NHL explains that not only was it an illegal and \"forceful\" check to the head, but that it would have been interference even if Torres didn't make contact with Silfverberg's head because the Ducks forward was no longer in a position where he could legally be checked. Along with the the illegal and violent nature of the hit, the NHL also explained that even though Torres is not considered a repeat offender under the current terms of CBA, his track record of illegal hits in the NHL has continued to be a problem. \nHe has appeared in only 15 games since his most recent suspension, a six-game ban for an illegal check to the head of then-Los Angeles Kings forward Jarret Stoll during the 2013 playoffs. This is also the fifth time Torres has been suspended in his NHL career, while he has also been fined three times and warned two others for illegal hits, the majority of which have involved hits to an opponents head.\nThat's a total of 10 discipline-worthy hits in only 703 regular-season games. The NHL finally reached a breaking point with him and threw the book at him. \nTorres will forfeit $440,860.29 in salary as a result of the suspension, all of which goes to the Players' Emergency Assistance Fund.\nHere is the NHL's full explanation of the play and suspension. \n\n\nSan Jose Sharks forward Raffi Torres has been suspended or fined eight times for illegal hits. (USATSI) \n\nTopics: Jakob Silfverberg , Raffi Torres , Anaheim Ducks , San Jose Sharks , NHL", "external_links": [], "published": "2015-10-05T23:32:00.000+03:00", "crawled": "2015-10-06T05:10:41.448+03:00", "highlightTitle": ""}