{"organizations": ["Bengals"], "uuid": "60c8fd4178f50051258afabe11472cc2d4205043", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.local12.com", "main_image": "http://www.local12.com//template/ugc/wkrc/1601/BDuOG8h6.jpg", "site_section": "http://www.local12.com/sports/features/local-sports/rss.xml", "section_title": "wkrc LOCAL Sports", "url": "http://www.local12.com/sports/features/local-sports/stories/Bengals-continue-flex-muscle-in-multiple-ways-214539.shtml", "country": "US", "title": "Bengals continue to flex muscle in multiple ways", "performance_score": 0, "site": "local12.com", "participants_count": 0, "title_full": "Bengals continue to flex muscle in multiple ways", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T13:25:00.000+03:00", "replies_count": 0, "uuid": "60c8fd4178f50051258afabe11472cc2d4205043"}, "author": "", "url": "http://www.local12.com/sports/features/local-sports/stories/Bengals-continue-flex-muscle-in-multiple-ways-214539.shtml", "ord_in_thread": 0, "title": "Bengals continue to flex muscle in multiple ways", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bengals continue to flex muscle in multiple ways \nUpdated: Mon, Oct 05 2015, 10:34 AM \nCINCINNATI (AP/WKRC) -- Andy Dalton completes his first 10 passes and makes another big play. The defense allows nothing other than field goals. Through four games, the Bengals are still perfect. \nAnd awfully impressive, too. \nLOCAL12.COM DIGITAL SPORTS COLUMNIST/EDITOR HAS HIS ANALYSIS HERE WITH GAME BALLS, STATS OF NOTE, QUOTES AND MUCH MORE \nDalton threw a 55-yard touchdown pass on the run — the type of throw he's rarely made in the past — and Cincinnati remained unbeaten with a 36-21 victory over the Kansas City Chiefs on Sunday. \nThe Bengals (4-0) matched the third-best start in franchise history, two wins shy of the club record. They've got the look of a team finally capable of not only reaching the playoffs, but winning once they get there. \n\"We started the season with a special intent, and that's to be great,\" left tackle Andrew Whitworth said. \"We're not satisfied with being good anymore.\" \nDalton has been the thread throughout the wins, ascending to the top of the AFC passer list. He had another spot-on day, completing 17 of 24 for 321 yards with the long touchdown pass to Brandon Tate during a scramble. \n\"It's what we expect from this offense,\" Dalton said. \"We've got everybody back, we're healthy. We've done a great job so far getting to 4-0.\" \nJeremy Hill ran for three touchdowns as the Bengals got off to a fast start and stayed ahead. \nIt was another rough day all around for Kansas City (1-3). Alex Smith was sacked five times, the Chiefs settled for Cairo Santos' club-record seven field goals, and the defense couldn't keep up with another one of the NFL's top passers. \nThe Chiefs have been beaten by Peyton Manning, Aaron Rodgers and Dalton in the past three weeks. In the past two, Rodgers and Dalton went a combined 41 of 59 for 654 yards with six TD passes. \nDalton came into the game trailing only Rodgers on the league's passer rating list. He's been significantly better at throwing on the run this season, and had another out-of-pocket big play at the start of the second half that put the Bengals in control. \nHe eluded the rush and threw a 55-yard touchdown pass to Tate, who made a diving catch at the 10-yard line, got up and dived into the end zone for a 21-12 lead. \nDalton got the Bengals off to another fast start. He completed all eight of his passes for 122 yards during a pair of 80-yard touchdown drives. \nSmith was 31 of 45 for 386 yards, but was under pressure much of the time. The Chiefs came into the game with an NFL-high 14 sacks allowed and gave up five more. \n\"We knew with Alex Smith, he kind of panics like any quarterback when he gets pressure in his face,\" said tackle Domata Peko, who had a pair of sacks and rubbed his belly in celebration each time. \"Alex Smith was on his back a lot today, and that was a key thing.\" \nThe clincher was tight end Travis Kelce's fumble after a catch, with the ball returned to the Kansas City 5-yard line. Hill scored his second touchdown for a 29-15 lead. \n\"We move the ball when we want to,\" Kelce said. \"As soon as we get over the 50, we start moving backward. We've got to keep moving forward.\" \nSantos connected from 22, 40, 51, 34, 40, 29 and 51 yards, tying the record for the second-most field goals in a game in NFL history. The Chiefs had more total yards (461-445), ran more plays (73-50) and held the ball for nearly 37 minutes, but had to settle for field goals. \nNOTES: Chiefs cornerback Sean Smith returned from a three-game suspension for violating the league's substance abuse policy and had a tough time covering A.J. Green, who had six catches for 78 yards in the first half. ... It was Dalton's second straight 300-yard passing game and the 16th of his career, including one in the playoffs. ... Tennessee's Rob Bironas holds the NFL record with eight field goals in 2007. \nPhoto: Tony Tribble \nFollow us on Twitter @Local12 and LIKE us on Facebook for updates! \nTo get \"The Skinny\" on local sports be sure to follow Local12 Digital Sports Columnist/Editor Richard Skinner on Twitter @Local12Skinny and LIKE him on Facebook for updates or email him raskinner@sbgtv.com. Related Stories", "external_links": [], "published": "2015-10-05T13:25:00.000+03:00", "crawled": "2015-10-06T03:41:11.572+03:00", "highlightTitle": ""}