{"organizations": [], "uuid": "790d6fdbebc30e801710f5024baee93473cf3430", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.spokesman.com", "main_image": "http://media.spokesman.com/img/logos/sr200.png", "site_section": "http://www.spokesman.com/feeds/stories/sports/", "section_title": "Spokesman.com: Sports stories", "url": "http://www.spokesman.com/stories/2015/oct/24/idaho-wins-second-straight-game-for-first-time-in-/", "country": "US", "title": "Idaho wins second straight game for first time in six years - Sat, 24 Oct 2015 PST", "performance_score": 0, "site": "spokesman.com", "participants_count": 0, "title_full": "Idaho wins second straight game for first time in six years - Sat, 24 Oct 2015 PST", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T06:40:00.000+02:00", "replies_count": 0, "uuid": "790d6fdbebc30e801710f5024baee93473cf3430"}, "author": "", "url": "http://www.spokesman.com/stories/2015/oct/24/idaho-wins-second-straight-game-for-first-time-in-/", "ord_in_thread": 0, "title": "Idaho wins second straight game for first time in six years - Sat, 24 Oct 2015 PST", "locations": ["Idaho"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tags: college football Idaho football Sun Belt Vandals \nMOSCOW – They sang in the locker room so raucously it might’ve been heard by fans exiting the stadium. Heck, the fans were probably singing along. \nSmiles were flashed, the fight song was sang and, thanks to a thoughtful gesture by Idaho coach Paul Petrino, tears were shed. \nIdaho walked … \nMOSCOW – They sang in the locker room so raucously it might’ve been heard by fans exiting the stadium. Heck, the fans were probably singing along. \nSmiles were flashed, the fight song was sang and, thanks to a thoughtful gesture by Idaho coach Paul Petrino, tears were shed. \nIdaho walked off the Kibbie Dome field on Saturday afternoon having accomplished something it hadn’t done since 2009 – it won a football game for a second consecutive week. And with its 27-13 homecoming victory over the University of Louisiana at Monroe, Idaho did something it hadn’t done since 2010 –it’s eclipsed the two-win mark. \nAnd there are five more games left to play. \nThe overwhelming sentiment among Vandals players is this isn’t just any win for Idaho (3-4, 2-2 Sun Belt Confernece), this could be empirical evidence of one of the nation’s most woeful football programs finally turning things around. \n“For the people who haven’t been here since 2011, to win two games in a row is unheard of since I’ve been here, it’s more exciting, everybody is happy,” said senior Quinton Bradley, who’s been with the program since its transition from Robb Akey to Petrino. “It makes it worth it, staying through all the hurt and the bad seasons, it makes it finally worth it when you work so hard and you get to experience wins and success.” \nPetrino awarded Spokane native Jace Malek the game ball after the win, prompting tears from the third-year Idaho coach when asked about it after the game. \n“That’s what it’s really all about. There’s not a whole lot of more special kids than him. You know what I mean?” Petrino told the gathered press. “And everyone in this room, I’d appreciate sooner than later, to get to know him.” \nMalek was diagnosed with cancer while he was orally committed to Idaho and now serves as an offensive student-assistant for the Vandals. For redshirt quarterback Matt Linehan, Malek’s presence is invaluable. \n“He’s the positivity guy on the sideline, I’ll tell you that much. He’s always got a smile on his face, he’s always picking me back up,” Linehan said. \nLinehan was in need of such positively after throwing an end-zone interception late in the second half, his third turnover of the half after fumbling twice inside the Idaho 20. ULM was able to stick with the Vandals on points off turnovers, scoring 10 points off of those two fumbles. \nLinehan’s response was to finish the game 13 of 22 for 206 yards and three touchdowns of 36, 34 and 24 yards. The sophomore finished with 315 yards through the air. \nOnce Linehan went on his tear in the air, Idaho was able to put ULM away behind the legs of senior running back Elijhaa Penny. Penny ran for a career-high 184 yards. Penny slimmed down nearly 30 pounds in the offseason to become more elusive, which showed on Saturday. \n“I’m not tired at all, I feel like I can play another game, really,” Penny said. “I guess all the offseason work, it paid off, all the eating right, all the working out and the extra work I put in.” \nIdaho has a realistic opportunity at its fourth win next week when it travels to Las Cruces to face winless New Mexico State.", "external_links": [], "published": "2015-10-25T06:40:00.000+02:00", "crawled": "2015-10-25T16:38:02.077+02:00", "highlightTitle": ""}