{"organizations": [], "uuid": "794efb4a678c8bf0373991cfd5e0b77f30afcfb9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "cherokeetribune.com", "main_image": "http://cherokeetribune.com/images/article.jpg", "site_section": "http://cherokeetribune.com/rss/rss/Sports?instance=Sports&content_type=article&tags=sports&tag_inclusion=or&offset=0&limit=10&page_name=rss", "section_title": "Sports", "url": "http://cherokeetribune.com/bookmark/26918359", "country": "US", "title": "Michigan punter takes ‘the good and the bad’", "performance_score": 0, "site": "cherokeetribune.com", "participants_count": 1, "title_full": "Michigan punter takes ‘the good and the bad’", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T08:55:00.000+03:00", "replies_count": 0, "uuid": "794efb4a678c8bf0373991cfd5e0b77f30afcfb9"}, "author": "Noah Trister Associated Press Sports Writer (noreply@cherokeetribune.com)", "url": "http://cherokeetribune.com/bookmark/26918359", "ord_in_thread": 0, "title": "Michigan punter takes ‘the good and the bad’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Michigan punter takes ‘the good and the bad’ by Noah TristerAssociated Press Sports Writer Associated Press October 21, 2015 12:55 AM | 324 views | 0 | 3 | | Michigan punter Blake O’Neill is facing an unwelcome sort of fame after his botched punt gave Michigan State a last-second victory Saturday. Associated Press photo slideshow ANN ARBOR, Mich. — Blake O’Neill is shrugging off the fact that perhaps millions of people probably didn’t know who he was last week. “I’m happy to play for Michigan football,” the punter said Tuesday night. “You choose to play at the college level, you take the good and the bad.” O’Neill bobbled a low snap, fumbled the ball away and Jalen Watts-Jackson was in the perfect position to return the football 38 yards to give Michigan State a stunning 27-23 win over the Wolverines at the Big House on Saturday. What were the 72 hours like after the botched punt, a play that has been replayed, reviewed and scrutinized? “It’s been very interesting, that’s for sure,” O’Neill said. “There’s been a lot of support from the Michigan fan base, from teammates and even people back home. It’s funny that a game here can get all the way to Australia, but it did.” He said his instincts from playing Australian rules football kicked in, leading to him trying to punt the ball over his head after losing control of it. “We’re taught to pick it up and move it on,” O’Neill said. “That’s completely on me.” Michigan coach Jim Harbaugh said after the game that he wished O’Neill would have fallen on the football, leaving Michigan State with an attempted Hail Mary to win the game. O’Neill, though, said no one has ever told him to do that if he bobbled the snap because you plan and practice to make plays the right way. “That’s the best way to play you can play football is be optimistic,” he said. When mistakes are made, O’Neill said football is like life. “You learn from it so you can do better,” he said. “You pick yourself up, dust yourself off and move on.” Sure, Harbaugh plays the what-if game. The Michigan coach acknowledged Tuesday that running the ball on sweeps toward the sideline to take more time off the clock was something he considered on first, second and third down in the final minutes against Michigan State. “You’d love to have that opportunity to do it again to see how the other way worked,” Harbaugh said. The Wolverines handed the ball off to De’Veon Smith three times and he gained 8 yards. On the pivotal drive that ended with a botched punt, Smith slightly surpassed his average per carry on 19 rushing attempts Saturday. That left Michigan with a fourth-and-2 at the Michigan State 47 with 10 seconds left, which was just enough time for the Spartans to win. The Spartans rushed O’Neill with 10 players and sent no one back to field the potential kick. In the end, it didn’t matter. “I would consider it more of a miracle than a fluke,” Wolverines offensive lineman Graham Glasgow said. Michigan State coach Mark Dantonio and his assistants have been analyzing the pivotal play, too, since their big win in the rivalry. “You try to practice every situation,” Dantonio said. “We always do and we all practice these different situations, but I don’t think we practiced one quite like that where that’s been the scenario. So I think it just created a pause in all of our minds as a staff, ‘OK, what would we do in that situation? How would we handle it?’ And I’m sure that there’s a lot of that going on right now across the country relating to what happened in the game just because of the nature of it.” At least the Spartans get to play again this week. No. 7 Michigan State (7-0, 3-0 Big Ten) hosts Indiana (4-3, 0-3) trying to avoid an upset that would spoil its Big Ten and national championship hopes and a potential showdown at No. 1 Ohio State on Nov. 21. The 15th-ranked Wolverines (5-2, 2-1) don’t play again until Oct. 31. More time to think about the loss — and more time to move on. “We’ll look at it as an opportunity week to improve,” Harbaugh said. “We’ll look at this last game, for example. There’s never one football play in a game that decides the game. We’ll look at the things that we things that we improved on, did well, and put us in a position to win the game. And we’ll also look at the ways that we could improve so we can make the outcome a winning outcome.”", "external_links": [], "published": "2015-10-21T08:55:00.000+03:00", "crawled": "2015-10-22T00:48:00.705+03:00", "highlightTitle": ""}