{"organizations": ["Upstate Eight Conference River Division", "Vikings"], "uuid": "e84fb529bc7b07dd632d03ada956744e38427599", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kcchronicle.com", "main_image": "http://www.kcchronicle.com/_internal/cimg!0/tp6nngtcpi7cxls26hmu6qlzbo8k91x", "site_section": "http://www.kcchronicle.com/?rss=sports/preps", "section_title": "Prep Sports", "url": "http://www.kcchronicle.com/2015/10/15/vikings-have-shown-ability-to-come-through-in-late-game-situations/aufa6j0/", "country": "US", "title": "Vikings have shown ability to come through in late-game situations", "performance_score": 0, "site": "kcchronicle.com", "participants_count": 0, "title_full": "Vikings have shown ability to come through in late-game situations", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T06:45:00.000+03:00", "replies_count": 0, "uuid": "e84fb529bc7b07dd632d03ada956744e38427599"}, "author": "", "url": "http://www.kcchronicle.com/2015/10/15/vikings-have-shown-ability-to-come-through-in-late-game-situations/aufa6j0/", "ord_in_thread": 0, "title": "Vikings have shown ability to come through in late-game situations", "locations": ["Geneva", "Batavia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["CHRIS CASEY"], "text": "Vikings have shown ability to come through in late-game situations Published: Thursday, Oct. 15, 2015 10:45 p.m. CDT • Updated: Thursday, Oct. 15, 2015 11:09 p.m. CDT Caption (Sean King) Geneva's ability to stay calm in pressure situations has been a key to remaining unbeaten heading into tonight's Upstate Eight Conference River Division title game against Batavia. By CHRIS CASEY ccasey @shawmedia.com \nGENEVA – While the Geneva football team comes into tonight’s Upstate Eight Conference River Division championship game with Batavia unbeaten, it certainly hasn’t been all smooth sailing for the Vikings. \nTwice this season, quarterback Sean Chambers has put together touchdown drives late in the fourth quarter to preserve the zero in the loss column. With another close game expected, with the pressure of a conference title, in a contest that is one of the most hyped games ever in this rivalry, the Vikings don’t seem fazed. \n“We’ve taken the preparation and this week’s matchup just as we have with any game this year,” running back Justin Taormina said. “We haven’t treated it any different. We’ve done the same things on the same days, just as we have throughout this season. I know once it’s here we will be a little more hyped up, but we just want to stay calm and not let our emotions get the best of us.” \nIt seems as though the Vikings have done that time and time again this season when games are on the line. When St. Charles North running back Eric Lins broke off an 80-yard touchdown run, putting the Vikings a little over three minutes from a potential first loss in Week 4, Chambers smiled. \nHe looked at wide receiver Jack Wassel and said, “Let’s go win this football game.” So they did. \nChambers found Ryan Skibinski for a touchdown inside the final minute to stay unbeaten. Skibinski was also the beneficiary of the game-winning score against St. Charles East in Week 6, when the Vikings fought past a gritty Saints bunch. \n“I don’t know what it is, but we have never really panicked, or looked at it as being, you know, ‘If we don’t do it here, we lose,’ type of thing,” Chambers said. “Everyone here has so much confidence in one another to execute a great game plan we have every week. There’s never a doubt, no matter who we are playing, that we can win any game. It’s not going to change whether it’s Batavia, or anyone.” \nCoach Rob Wicinski said he has never beaten Batavia in his 16-plus seasons at Geneva. Well, that’s not true, but he meant it in an Xs and Os way. He doesn’t believe that Batavia has ever beaten him, nor does he feel that his team has ever beaten the Bulldogs. \nThe losing team always beats itself, in Wicinski’s mind, and although Geneva hasn’t been on the winning end of the rivalry since 2010, he senses something different about the 2015 Vikings. \n“There’s something special about this group,” Wicinski said. “I’m not sure exactly what it is, and I don’t like to compare them to my other teams, but I’ll tell you what, heading into this season with some new faces, we weren’t sure how they would react once the lights went on. But the guys have handled their business and shown a lot of grit.” \nA balanced offensive attack, with timely defensive and special teams plays along the way, have kept the Vikings perfect heading into tonight’s showdown. \nTaormina and Chambers were just a couple of the players that were on last year’s Geneva team that fell to the Bulldogs, 26-20, as part of the 29 straight games that Batavia has won in the River Division. \nIt has been an all too familiar sight for Geneva to see a zero in Batavia’s conference record over the years, and the Vikings feel this is the group that’s going to put the Bulldogs’ run to bed. \n“Everyone says, ‘Nobody can beat this team,’” Taormina said. “I think we have the guys that are capable of doing it, and as long as we stick to our game plan and play Geneva football, I think we’re going to come away with the victory.”", "external_links": [], "published": "2015-10-16T06:45:00.000+03:00", "crawled": "2015-10-16T11:23:34.774+03:00", "highlightTitle": ""}