{"organizations": [], "uuid": "7f15252397084faa414d013ff9269d2272af8d54", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.courier-journal.com", "main_image": "http://www.gannett-cdn.com/-mm-/9f18f13127bc0b7b9acc9c6216e581f76ac6c1df/c=0-102-2000-1232&amp;r=x633&amp;c=1200x630/local/-/media/2015/08/08/Louisville/Louisville/635746507085525881-UKFanDay16.JPG", "site_section": "http://www.courier-journal.com/", "section_title": "Louisville News, Sports, Business | The Courier-Journal", "url": "http://www.courier-journal.com/story/sports/college/kentucky/2015/10/12/q-uk-coordinators-see-challenge-auburn/73822940/", "country": "US", "title": "Q&A: UK coordinators see challenge in Auburn", "performance_score": 0, "site": "courier-journal.com", "participants_count": 1, "title_full": "Q&A: UK coordinators see challenge in Auburn", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T21:42:00.000+03:00", "replies_count": 0, "uuid": "7f15252397084faa414d013ff9269d2272af8d54"}, "author": "courier-journal.com", "url": "http://www.courier-journal.com/story/sports/college/kentucky/2015/10/12/q-uk-coordinators-see-challenge-auburn/73822940/", "ord_in_thread": 0, "title": "Q&A: UK coordinators see challenge in Auburn", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kentucky offensive coordinator Shannon Dawson and defensive coordinator D.J. Eliot held their weekly news conference Monday in advance of the Auburn game on Thursday. You can read a full transcript of their comments below:\nShannon Dawson\nOn what they most got out of the bye week: “Developed some younger guys, gave them some reps and worked on specific things that we need to work on offensively. Just got some extra work. It's good to go – in those situations, you can go a little more good-on-good, which is helpful.”\nOn how different it is preparing for a Thursday night game: “I mean, it just changes your days up. Got to enjoy a Saturday for one time like regular people. Sat around and watched some games later in the evening. But other than that you just bump everything up accordingly and it really doesn't change. We don't know the days of the week anyway, so we just backtrack from the game and go as according.”\nOn if the actual game day will feel different: “It's different in the sense that there's not games. I mean, there's a lot of void. That day, when it's a middle of the week game, there's a big void because there's nothing going on. Typically you can feel that void on Saturday if it's a late game because there's games. You can watch stuff on TV or whatever, but it's just more of a hurry up and wait mentality. It's just a lot of sitting around.”\nOn what being the feature game on national TV does for the team: “I think you look forward to those games, no doubt. You sell it to your guys as, everybody's watching. It's a chance for you to go out and make a statement. I'm sure Auburn is saying the same thing.”\nOn if the bye week helped with recruiting: “You pinpoint those dates on the calendar as time to go out and see some high school games, so everybody was on the road. It definitely helps. Not to say we don't get anybody out the week of games because we do, because there's some local things we can go see, but as far as the whole staff going out, those games allow you to get more people on the road. Definitely got out and saw some high school games.”\nOn what he sees from Auburn's defense: “Well-coached defense. Obviously Will's done a great job for a long time everywhere he's been, so we're going to have our challenges to protect and get the ball down the field. Ultimately, when you play defenses like his, you've got to win some one-on-one battles. That's really the case. He's going to squeeze out a lot of things, so you've got to pick your chances to take some opportunities down the field and hopefully you can win some one on one battles. Got to make plays with people on you, because they're going to be close.”\nOn balancing praising Dorian Baker vs. keeping him even keel: “I think he does a good job of that on his own, really. He never really strays from being even keel. I think the kid really just honestly loves competing. I don't think that there's anything that we have to sit there and make sure he's grounded. He's typically the same person every day, which is good to see.”\nOn if Baker has the green light to ask for the ball whenever he wants now: “I don't mind it if you make plays. Anybody can say it if they're making plays. It's not that I'm going to listen to everybody. You've got to go to the people that are making plays.”\nOn having Boom Williams back this game: “He's doing great. He's got great energy, great attitude right now. Obviously, we're a better team with him on the field. I think he understands that and I think we understands that. We want him to be on the field as much as possible. We're a lot better with him out there.”\nOn if redshirting two freshman WRs is an encouraging sign of depth: “It is. You go back and forth with those guys that are really talented enough to play, but you don't know how many reps they would get. The thing that you don't want to do is play them a limited number of snaps through the season and lose a year. We made decisions on those guys, and it's a tough decision to make at times because you look at them and you're like, 'Dadgum.' And then as the season goes, you get thinner, so it makes the decision a little tougher. But guys are better, and I think everybody in here knows this, when they've had a year with coach Ed in the weight room, a year of just being in college. Typically, older guys just play better. Tougher mentally, tougher physically. So that's where we want to go with the program, and obviously we're in a good place where we can redshirt guys and we can develop them. Developing is a key component.”\nOn how close they are to getting the consistency he wants from the run game: “I don't know. That's a good question. Hopefully close. Hopefully Thursday, you know? And consistency overall. It's not just in the run game. We're inconsistent overall. And we can play a quarter, and you're like, 'Dadgum, we're pretty good.' And then the next quarter we might not gain – we might go three-and-out four times. I don't know. It's pretty baffling to me at times, too. But I think you can get frustrated with it or you could just keep working. My mindset is just to keep pushing along, because the kids are young, and it would be different if it were an effort issue. It really isn't an effort issue. It's more of an execution issue, and just knowledge of the game. I think that there's certain things that kill drives. I was listening to Coach Stoops earlier and it’s really one guy doing something that, the more he plays football a lot of times irons that stuff out; he doesn’t make those mistakes. It’s simple stuff. The most frustrating thing to me is that – I mean, there’s times the defense just stops you and you gotta just, ‘Hey, good job, guys, you beat us; good scheme, good blitz, whatever,’ but when you stop yourself, I think that’s a whole different deal. And it’s been a lot more of stopping ourself than the other way around lately. That’s the most frustrating. You want to be able to take advantage of things in real time and then when it doesn’t happen, you get a little bit frustrated.”\nOn how valuable open dates are for self-scouting from the season so far, seeing what worked and didn’t, etc.: “You know, to be honest with you, I’m constantly doing that regardless of the week, because I think defenses today – especially in this league; this league is a little different, like the Big 12 offenses are inbred, this league defenses are a lot alike. So I think you can learn a lot from previous opponents. I think the other teams definitely watch it whenever their scheme is close, so you can definitely go back and watch games and see what you could’ve done different or what the specific players you’re coaching could’ve done differently. So I try to do that week to week, just because I think it’s smart to learn from what you did the previous week.”\nOn if the end of the EKU game was close to what he envisions for the pace and execution of this offense: “The problem with tempo and playing fast is you have to get some first downs, you know? You can’t play fast if you’re not getting first downs. So through the majority of that game, when you’re not getting first downs, you don’t have the ability to play fast, because you’re not executing. That’s what people don’t understand about offenses. We don’t want to be just a straight-fastball offense – that’s not what we’re doing – but when we get on a roll, we want to have the ability to do that. So we gotta temper it based on how we’re playing. If you watch every game, the times that we play fast and have good tempo, we get a first down or two first downs (and) then we can get rolling. It’s hard to go three-and-out and play with tempo. It’s just impossible – and you put the defense in a really bad situation. So if you’re struggling at times, naturally you’re going to slow down a little bit, because you’re trying to execute better, you’re trying to get people … and probably as a fault, as a coach, you’re trying to call ‘perfect plays,’ which there is no perfect play. You kind of just make it work. So ultimately, you gotta understand the flow of the game, too. If the defense just had a long drive, then the worst thing to do is go out there and go three plays as fast as you can go and punt, you know? So we’ve gotta have some level of execution to be able to play with tempo. At times, we achieved that. At times we don’t achieve that, obviously. I think everybody understands that.”\nOn how important getting back LT Jordan Swindle is to the offensive line: “I think it’s important, but ultimately – I watched a lot of football Saturday, and everybody did; this game more than any other sport, it’s next-man-up mentality. You gotta trust those guys that are backup guys, that are key backups, to go in and play, and we have. I think Jordan’s obviously a starter for a reason. That’s why we list him as a starter: he’s been proven to be the best one at that edge, and pass protection is something that we’ve stressed. And obviously every week sets forward another set of problems in pass protection, because we’re typically going to always face someone that’s disruptive, especially in this league. It’s no different Thursday. It’s going to be the same. So we just have to keep stressing protection, getting better at it. Obviously the quarterback has to do his job – we gotta get rid of the ball in a timely fashion – and we can’t sit back there and do that every play like we used to do it; it’s got to be calculated. But having him on the edge should bring a level of confidence to the group, no doubt.”\nOn if they’re to the point with the OL, though, that even when all are healthy they’re confident in the backups to play a bit of a rotation for fresh legs: “Yeah, we’re always going to have a rotation, no doubt. We did that even in the beginning of the year if you watched. It’s hard – you’re sitting there in a situation, especially up front, where if you’re not playing eight or so guys, seven or eight guys or however many you have, then whenever those situations come up, you’re really in a bind. So you have to be able to sub those guys through the course of the game. And we have a rotation, and Coach Schlarman does a great job with those guys, and we’re going to rotate those guys in as we see fit. They’ll play regardless if someone’s injured or not, because we need fresh people in the game.”\nOn what Ryan Timmons needs to do to get going: “Relax. There’s times where I think that kid just presses too much, like everybody. The kid’s talented, you know? And he’s in position to make some plays, and he just needs to relax and let the game come to him. You can’t force it. A lot of times, in situations where we have things designed to get him the ball, then when he gets it he just needs to make a play. It’s pretty simple.”\nOn if, when he sees what Florida did to Ole Miss and Missouri, it makes him look differently at how UK competed with the Gators: “I mean, they’re pretty good (laughing). I knew that after the game. I could’ve told you that. But ultimately – I’m glad you brought that up; appreciate that (grinning); made me vomit. They’re a good defense, no doubt. They’re a good football team. And look, we had our chances. The biggest thing in that game – I watched that game again this week; I made sure I didn’t eat before it – we did a lot of good things in that game, to be honest with you. I know that might sound weird because we only scored three field goals, but we did a lot of things good and we just didn’t score when we got down there. We’ve been good in the red zone this year. That game particularly, we settled for field goals, which we hadn’t been doing. We’ve been pretty decent in the red zone, so that game we settled for field goals, but I will say this: They’re red-zone defense is pretty good. We learned a lot from playing them, to be honest with you. We learned a lot from playing them that allowed us to win the next couple games. I will say that, because I think there were situations that came up in that game that Patrick learned a lot from. For instance, we’ve been throwing and catching fade balls pretty good, and there was a couple instances in that game when we should’ve threw and caught fade balls. But you’ve gotta be in those situations and see ‘em and learn from them. But there was definitely situations in that game that we learned a lot from.”\nOn what he’s seen lately from WR Alex Montgomery: “Last few weeks have been awesome. Kid’s been playing well. He’s going to play more and more. Love his attitude, love his energy. We’ve got a good group of inside receivers there and we’ve gotta go with who’s hot and who’s playing the best at practice, and he’s definitely a kid that’s been playing well.”\nD.J. Eliot\nOpening statement: “We’ve had a good couple of weeks of practice now and excited to get this game on the way. We’re having another practice today where we can emphasize on details and fundamentals. An opportunity to play physical and go against the offense some. Looking forward to getting out there this afternoon and having a good practice.”\nOn if how different the week was without having a game on Saturday: “Much different. You got to watch and feel other people’s stress. When you watch those games, sometimes I’m ‘oh he shouldn’t have done that.’ You don’t get to do that very often. It also was good to get away for a while and spend some time with the family and concentrate on some other things.”\nOn if he was allowed to watch football on Saturday: “Part of it was the channel was flipped to Sesame Street a couple of times (laughs). I have pretty low priority in that house as you guys probably know. Four kids and three of them are girls. Pretty little priority.”\nOn how Auburn’s offense is different depending on which quarterback it uses: “I don’t anticipate that there’ll be much of a difference. I know that each quarterback has different talents, but the attack I don’t think is much different. They have the scheme that they run and you have to be able to defend a lot of things. Which quarterback is in there isn’t really going to determine how their scheme is run. I think it’s just different quarterbacks have different talents.”\nOn what the defense has to do to defend Auburn’s tempo: “You have to able to think fast and you have to be able to line up fast. You have to be able to communicate fast. Those are offenses that make a lot of pain on you just not getting lined up. Just not being in the right spots because of their tempo. We’re emphasizing that and our players are doing a good job in practice of handing the tempo and that’s something we expect to do in the game.”\nOn what he expects out of Auburn quarterback Jeremy Johnson: “I don’t know. I don’t know what they’re going to do. I know he can throw. He has a good arm and I know they run the ball well too. I’m just preparing for both attacks and we’ll see what happens on Thursday.”\nOn the importance of having Reggie Meant back from injury: “I think it’s very important. We need to have good play inside. They’re a very good run team. They’re physical blockers. They have a lot of power on runs. Their offensive tackles are very good and I think it’s important that we have good, solid defensive line play. Getting Reggie back will give us that.”\nOn how concerned he is at inside linebacker depth: “You lose guys and you valued a lot of reps in those guys. It makes it more of a challenge. We’re constantly trying to develop depth and we may have to rely on some different guys in some different spots. Maybe double up at positions. For the most part, we’ve had a good rotation at inside linebacker play this week in practice. I think we’ll be OK.”\nOn if Eli Brown will have to get more reps just in case: “Yes.”\nOn if he’s eager to see the improvement the defense has made against a power-run team: “I think we’ve made some improvements and I’m excited to get after it on Thursday. We know our challenges with that type of offense and those type of players. We’re ready and we’re excited to get after it.”", "external_links": [], "published": "2015-10-12T21:42:00.000+03:00", "crawled": "2015-10-12T23:33:12.311+03:00", "highlightTitle": ""}