{"organizations": ["NASCAR"], "uuid": "d1f39d4570c4a3159b1f2282d327e51bd36394d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxsports.com", "main_image": "http://www.foxsports.com/content/fsdigital/fscom.img.png", "site_section": "http://api.foxsports.com/v1/rss?partnerKey=zBaFxRyGKCfxBagJG9b8pqLyndmvo7UU&tag=nascar", "section_title": "FOX Sports Digital", "url": "http://www.foxsports.com/motor/story/nascar-champion-stewart-will-retire-after-2016-season-093015", "country": "", "title": "NASCAR's Tony Stewart will retire from Cup racing after '16", "performance_score": 0, "site": "foxsports.com", "participants_count": 0, "title_full": "NASCAR's Tony Stewart will retire from Cup racing after '16", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T20:06:00.000+03:00", "replies_count": 0, "uuid": "d1f39d4570c4a3159b1f2282d327e51bd36394d3"}, "author": "", "url": "http://www.foxsports.com/motor/story/nascar-champion-stewart-will-retire-after-2016-season-093015", "ord_in_thread": 0, "title": "NASCAR's Tony Stewart will retire from Cup racing after '16", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tony Stewart"], "text": "NASCAR's Tony Stewart will retire from Cup racing after '16 AP Sep 30, 2015 at 1:06p ET 0Shares \nKANNAPOLIS, N.C. (AP) Saying it was time for a change, three-time NASCAR champion Tony Stewart announced Wednesday that he will retire from Sprint Cup racing following the 2016 season. \nSmiling and appearing at ease at the Stewart-Haas Racing shop in North Carolina, Stewart said the decision was ''100 percent'' his choice. \n''There wasn't any pressure from anybody,'' Stewart said. ''If anything, it was the opposite. I know people were trying to talk me out of it. It's a scenario where everybody in their career makes the decision that it's time for a change.'' \nStewart, who deeply loves dirt track racing, isn't getting out of the car for good, though. \n''I am still going to race,'' he said. ''I am not retiring from racing, just the Sprint Cup Series.'' \nStewart, who said a year ago he wasn't sure if he'd ever run a sprint car race again, indicated Wednesday a return to his roots is in his future. \n''Maybe. Probably,'' he said when asked if he'll get back in a sprint car. \nHis planned departure is not a surprise. Stewart will be 45 next season, hasn't won a race in over two years and has been privately working on finding a successor for the No. 14 Chevrolet all year. \nClint Bowyer , released from his contract with Michael Waltrip Racing because the team is folding at the end of the season, will replace Stewart in the No. 14 in 2017. Bowyer has been looking for a one-year deal for next season as a stopgap while Stewart runs his 18th and final Cup season. SHR also fields cars for reigning series champion Kevin Harvick , Kurt Busch and Danica Patrick . \nThe last three years have been trying for Stewart. He struck and killed sprint car driver Kevin Ward Jr. during a 2014 race in New York and he missed the final third of the 2013 season with a broken leg suffered in a sprint car crash. His passion for NASCAR racing has also waned in the last several seasons, in part because of an evolving rules package that he has struggled with. He is currently 25th in the points standings and failed to qualify for the Chase for the Sprint Cup championship for the third consecutive year. \nStewart told AP in June that his confidence was shot and he was struggling to find any enjoyment in being in the race car. \n''I think deep down, you know when it's time to do something different,'' Stewart said Wednesday. \nStewart said the fatal incident with Ward and his comeback from injuries played no role in his decision. \nEddie Gossage, president of Texas Motor Speedway and a close friend of Stewart's, said the driver had discussed retirement with him ''over the last six or eight years.'' \n''I think he always viewed Cup racing as a job that helped him fulfill his passion for racing on dirt tracks, running world-famous Eldora Speedway or owning the All Star Circuit of Champions Sprint Car Series,'' Gossage said. ''I don't know anybody that loves racing more. He's a sure-fire, first ballot shoo-in for the NASCAR Hall of Fame.'' \nKevin Harvick, who was lured to Stewart-Haas Racing by Stewart and won his first Cup title last season, admitted he's still coming to terms with Stewart's decision. \n''As the world learns about Tony retiring today I have to admit I've known about this for a while and really struggled to put my arms around what I think about it,'' Harvick posted on social media. ''I've seen Tony as my driver, my boss and my friend. But in the end I want to see him smile and be happy in his life. Tony has done a great deal for not only my family, but the sport that we all love.'' \nStewart, who moved from IndyCar to NASCAR and got his break in 1999 with Joe Gibbs Racing, is the second star in two years to call it quits. Four-time champion Jeff Gordon will retire at the end of this season. \nStewart has 48 Cup victories and is a lock for NASCAR's Hall of Fame. He's one of the most proficient drivers in racing, winning in every kind of series, from sprint cars to a dominant stretch in NASCAR where he reeled off at least one win in 15 straight seasons. \nBut the last two seasons have been filled with heartache and hardship on and off the track for Stewart. While no one would ever count out Stewart from winning one more race, he's no longer a regular threat to find victory lane. He last won a Cup race on June 2, 2013, at Dover International Speedway. \nStewart said he considered retiring at the end of this season, but stuck around for the fans and to try and win his first Daytona 500. \n''The great thing is, I'm not going anywhere,'' Stewart said. ''NASCAR's probably going to be the most disappointed of everybody today because they aren't getting rid of me. They have to deal with me as an owner. There's still an opportunity to get fined. There's still an opportunity to get on probation, just like always.'' \nBowyer is an eight-time race winner in the Sprint Cup Series and finished second in the 2012 championship standings. Bowyer said he would likely announce his team for 2016 later this week. \n''Whether it's racing him on Sunday or watching my dirt late model teams race at his famed Eldora Speedway, Tony and I share the same passion for racing,'' Bowyer said. ''That makes this opportunity a perfect fit for me. I appreciate everything he's done for me and the sport of auto racing. These are big shoes to fill, but, boy, am I ever looking forward to getting behind the wheel of a champion's ride, and have Tony there with me along the way.'' \n--- \nAP Sports Writer Dan Gelston contributed to this report. 0", "external_links": [], "published": "2015-09-30T20:06:00.000+03:00", "crawled": "2015-10-01T00:46:16.664+03:00", "highlightTitle": ""}