{"organizations": [], "uuid": "7d4064d0a072213b1d3c0161a544df74e579b266", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.courier-journal.com", "main_image": "http://www.gannett-cdn.com/-mm-/a850aef4fcef27b654f1f6066cd6a85bf1ba6cbd/c=0-255-4896-3009&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/05/26/Louisville/B9317485821Z.1_20150526163449_000_G4VAT6CGN.1-0.jpg", "site_section": "http://www.courier-journal.com/", "section_title": "Louisville News, Sports, Business | The Courier-Journal", "url": "http://www.courier-journal.com/story/money/companies/2015/10/07/yum-brands-stock-tumbles-weak-earnings/73504604/", "country": "US", "title": "Should Taco Bell split from Yum! Brands to help profits?", "performance_score": 0, "site": "courier-journal.com", "participants_count": 1, "title_full": "Should Taco Bell split from Yum! Brands to help profits?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T20:35:00.000+03:00", "replies_count": 0, "uuid": "7d4064d0a072213b1d3c0161a544df74e579b266"}, "author": "courier-journal.com", "url": "http://www.courier-journal.com/story/money/companies/2015/10/07/yum-brands-stock-tumbles-weak-earnings/73504604/", "ord_in_thread": 0, "title": "Should Taco Bell split from Yum! Brands to help profits?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "As YUM! Brands stock price tumbled 18 percent overnight on the news of poor sale in the China market — the core of the Louisville-based fast food giant's profitability — CEO Greg Creed promised investors a turnaround while fending off calls for restructuring.\n\"Everybody at Yum knows we have disappointed you and our shareholders this quarter and this year,\" Creed said on a conference call Wednesday following a third quarter earnings release that fell far short of company and investor projections. \"I don't want you to count us out. We will come back.\"\nAs of 11 a.m., Yum stock was trading at $67.68, down from Tuesday's close of $83.42.\nUntil yesterday, Yum's stock price has been stagnant for the last three years. That flat growth has long produced steady calls by analysts for restructuring, with one option proposed being a spin-off of the more dynamic Taco Bell into a separate company. Those voices became more insistent Wednesday that Yum re-examine its faith in a return to explosive growth in China as the centerpiece of its business model.\nTHE COURIER-JOURNAL\nShould Taco Bell split from Yum to help profits?\n\"I wonder when the board and the management will believe that the China turnaround story doesn't completely dominate the Yum story,\" said Brian Bittner, an Oppenheimer & Co. analyst. \"It has been hurting the model and the valuation of your stock for three years now.\"\nChina sales overall rose just 2 percent at established stores, missing company guidance and investor expectations of 10 percent or more sales growth for combined KFC and Pizza Hut operations.\nInstead, KFC sales rose just 3 percent in the third quarter in China while Pizza Hut sales sagged by 1 percent. For all of 2016, Yum now projects China sales will be in the red.\nYum has been struggling to attract new Chinese consumers at historically booming rates after negative publicity stemming from two food supply controversies, one in 2012 and a second in 2014 .\nYum's fight back from negative publicity in China has been a steep climb: consumer concerns about food safety and quality at KFC drove China sales down 14 percent overall in the third quarter last year.\nThird quarter China weakness surprised Yum management, CFO Pat Grismer said, adding that a sales uptick in early August led the company to affirm \"double digit positive same-store sales growth\" for the third quarter. Subsequent stock market volatility in China caused consumers to tighten spending in late August throughout September, Yum executives said, while hyper aggressive competitors offered steeply discounted bargains. For detail, they noted that Pizza Hut catering orders to Chinese businesses fell markedly, and unexpectedly, away.\nTHE COURIER-JOURNAL\nKFC Col. Sanders' revival 'tarnishes' the icon\nChina remains a solid investment strategy for future expansion, Creed said, adding that Chinese workers expected to grow their income to join \"the consuming class\" are expected to double from 300 million today to an estimated 600 million people by 2020.\n\"We are always going to believe in China,\" Creed said, adding Yum's new China CEO Micky Pant has begun aggressively implementing discounted meals and box specials just six weeks into his tenure, with emphasis on drinks, which are especially profitable in the fast food business. \"We will take massive action to turn around marketing missteps we have had.\"\nBesides calls to break off Taco Bell, some analysts openly questioned Yum management.\n\"At what point is it time to reconsider the view that you are absolutely the right people to run the day to day operations of Yum China?\" said Sara Senatore, an analyst with Sanford C. Bernstein. \"Clearly the stock market is saying Yum is not creating a lot of value right now.\"\nIn the U.S., Yum spokesman Jonathan Blum noted Taco Bell and KFC saw positive sales gains, while Pizza Hut remained relatively flat.\nKFC profits were negatively impacted by costs related to the ad campaign that reintroduced Col. Harland Sanders as the brand's centerpiece. Begun with comedian Darrell Hammond in early summer, KFC's campaign switched actors in mid-stream. In mid-August, Norm MacDonald took over as the new face of Col. Sanders .\nFor the quarter ended Sept. 5, the company said it earned $421 million, or 95 cents per share. Not including one-time items, it earned $1 per share. Analysts on average expected $1.07 per share, according to analysts surveyed by Zacks Investment Research. Total revenue was $3.43 billion in the period, also missing Street forecasts for $3.68 billion.\nTHE COURIER-JOURNAL\nGallery | KFC revives iconic Col. Sanders\n\"Will the Q3 disaster serve as a call to action?\" Nomura restaurant analyst Mark Kalinowski said in a note released Tuesday.\nTo position Yum for growth, Kalinowski suggested that Taco Bell should be spun off. Yum should also divest all other brands besides KFC and Pizza Hut, including China-based \"hot pot\" Little Sheep chain, the Banh Shop in Texas and Atto Primo in Shanghai. Third, Yum should start slashing costs, he said.\n\"From the late 1990s through 2012, Yum was one of the very best success stories in the restaurant industry, with stock easily outperforming the S&P 500. ... Those successes must have masked some cost/bureaucracy bloat over time that to date has not been adequately addressed.\"\nJere Downs can be reached at (502) 582-4669, JDowns@Courier-Journal.com or Jere Downs on Facebook.\nOct. 6 -- Yum! Brands tumbled as much as 19 percent in late trading after a lingering slump in China caused the fast-food giant to miss third-quarter profit estimates. Bloomberg's Scarlet Fu and Tracy", "external_links": ["http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/326f7eb2019422a6859dd15bf42c2b8faee9997b/c=816-0-4080-3264/local/-/media/2015/05/26/Louisville/B9317485821Z.1_20150526163449_000_G4VAT6CGN.1-0.jpg", "http://www.gannett-cdn.com/-mm-/12ab58a71d3915ae8d8d36c748a7b7e4976a105a/r=540&c=540x304/http/pthumbnails.5min.com/10382707/519135334_c_embedStandard.jpg", "http://www.colonelsanders.com/", "http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/143e2436949dc1d37205c70a2d8b1424d9a24abe/c=0-191-385-409&r=x1683&c=3200x1680/local/-/media/2015/05/19/Louisville/Louisville/635676542929318957-Sanders01.JPG.jpg", "http://pthumbnails.5min.com/10382707/519135334_c_embedStandard.jpg", "http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/3bcb3a41d7cfbc41b04e18aad2375a1e4e56535b/c=182-0-1771-1589/local/-/media/2015/05/27/Louisville/B9317434663Z.1_20150527132640_000_GG2AR9JHV.1-0.jpg", "http://cjky.it/1Li3vua"], "published": "2015-10-07T20:35:00.000+03:00", "crawled": "2015-10-08T12:30:19.038+03:00", "highlightTitle": ""}