{"organizations": [], "uuid": "d1fc0eeb49cd058f7a1b30a71a53d54f514f1849", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.northjersey.com", "main_image": "http://www.northjersey.com:80/polopoly_fs/1.1438336!/fileImage/httpImage/102215-mt-cougars.jpg", "site_section": "http://www.northjersey.com/cmlink/high-school-sports-rss.rss", "section_title": "High School Sports on NorthJersey.com", "url": "http://www.northjersey.com/sports/high-school-sports/football/perfect-year-still-intact-1.1438335", "country": "US", "title": "Football: MKA captures conference crown, stays unbeaten", "performance_score": 0, "site": "northjersey.com", "participants_count": 0, "title_full": "Football: MKA captures conference crown, stays unbeaten", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T07:32:00.000+03:00", "replies_count": 0, "uuid": "d1fc0eeb49cd058f7a1b30a71a53d54f514f1849"}, "author": "", "url": "http://www.northjersey.com/sports/high-school-sports/football/perfect-year-still-intact-1.1438335", "ord_in_thread": 0, "title": "Football: MKA captures conference crown, stays unbeaten", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Erik Zeug", "Derek Kleinman", "Bill Allen-NJsportaction", "Ethan Fusco", "Rob Strain"], "text": "Buy this photo Photo Courtesy of Bill Allen-NJsportaction.net From left, seniors captains Ethan Fusco, Rob Strain, Derek Kleinman and Erik Zeug celebrate with the Metropolitan Independent trophy. \nFor the 7-0 Montclair Kimberley Academy football team, as the season goes on, the light at the end of the tunnel, not only gets closer but gets brighter and brighter as they look to achieve what may be the greatest season in MKA football history. \nOn Saturday, Oct. 17, the Cougars hosted the Hackley Hornets for what was expected, and turned out, to be their most highly-contested match of the regular season. In what will go down as an MKA classic, the Cougars won 36-33 hoisted the 2015 Metropolitan Independent Football League Championship trophy after a brutal 48 minutes of ground-and-pound action. \n\"It took me back to eighth-grade football with the Cobras, running the ball 90 percent of the game, getting beat up and wearing more red than blue,\" said senior quarterback and captain Erik Zeug. \"It was just a beautiful throw-back football game.\" \nThings started out a little shaky for the Cougars on their first offensive drive as multiple penalties resulted in them punting from just outside of their own endzone. \n\"A lot of strange stuff happened on that first drive,\" said head coach Anthony Rea. \"We started a little bit clunky but you could tell there were some nerves even if the guys wont admit it.\" \nThrough both the rocky start and the game as a whole, thank an incredible MKA defensive line for constantly putting the pressure on the Hackley backfield, notably senior Joe Strain and junior Brian Bond who were a nightmare for the Hornets, recording the Cougars only two sacks on the day. \n\"Brian Bond and Joe strain along with the entire defense did an amazing job,\" Zeug said. \"Joe is a spectacular player and doesn’t get enough credit for what he does.\" \nTowards the end of the first quarter, after junior Quinn Meistrich nearly intercepted a pass in the endzone, a confident Hornet offense failed to convert on a fourth and short on the Cougars’ 18-yard line. Zeug and senior captain Ethan Fusco marched the Cougars down the field before Zeug hit senior captain Rob Strain in the back of the endzone as time expired to give the Cougars the 7-0 lead. \nAs the game progressed both sides continued to get more intense as they fell into their respective grooves. Unfortunately for Hackley, nobody ever gameplans for failed extra and two-point conversions. After a failed extra point kept the Cougars on top 7-6 and a four-yard touchdown run by Zeug extended the lead to 14-6, the Hornets failed their subsequent two-point conversion towards the end of the half making it 14-12. \nWith just under two minutes left in the half, Zeug connected with senior Max Hall for a monster 40-yard pass, setting up a six-yard touchdown run for Zeug that put the Cougars up 21-12 at the end of the first half. \n\"We knew Hackley was going to give us a great game,\" Rea said. \"Both teams played really.\" \nRea went on to say how, in a game with two evenly-matched teams, its sometimes the smallest play that can make the biggest difference and that was exactly what happened to start the second half. The third quarter saw very little action from the Cougars while the Hornets capitalized on what almost turned into a very crucial snap early on in the half. \nAfter a false start put the Cougars back at their own 15-yard line, the followed snap flew over Zeug’s head and into the endzone where, with not enough time to pick up the ball and throw it away, his only option was to fall on the ball as the Hornets took the two-points from the safety and the ball. Not only did the safety make up for the failed conversions early on, but they also went on to score on the following drive an tie the game at 21-21. \nAfter three quarter of action, the fourth quarter laid things on thick, starting with Zeug’s third touchdown run of the day, a five-yard run in the opening minutes. As tensions began to rise, MKA cashed in on their good fortune as, not only did the Hornets miss the extra point that would’ve tied the game at 28-28, they also missed the two-point conversion on the 63-yard touchdown pass that gave them a 33-28 lead with 5:15 left in the game. \nAfter a day of steadily punching the ball at least four yards per carry, Fusco finally broke through for what may be the most important touchdown of his career. Only a few plays after Hackley took the lead, Fusco found the empty sideline for a 61-yard run that put the Cougars on top 34-33. After a successful two-point conversion put them on top 36-33 it all came down to the Hornets final offensive drive. \nThe Hornets took over the ball on the MKA 49-yard line after the Cougars failed to convert on fourth-and-one and that sent the crowd into thunderous applause and cheers as they tried to help the Cougars bring home the win. After both Hall and senior Danny Amirata nearly intercepted the ball, Bond and Strain combined for a huge third-down sack that pushed the Hornets back five yards. The Hornets failed to convert, the Cougars got the ball with 13 seconds left, knelt on first down and the stands erupted as the final buzzer sound. \nThe Cougars now prepare for their road game against Newark East Side on Friday, Oct. 23. \nEmail: verhagen@northjersey.com  ", "external_links": [], "published": "2015-10-22T07:32:00.000+03:00", "crawled": "2015-10-22T20:12:11.210+03:00", "highlightTitle": ""}