{"organizations": [], "uuid": "a24d2ca55e5f35f665c3d7ac6a168b9c33d37b0f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thedailyjournal.com", "main_image": "http://www.gannett-cdn.com/-mm-/47da1730a57cc5deeabea7d0a00d6f76d012ecbf/c=0-88-1195-763&amp;r=x633&amp;c=1600x630/local/-/media/2015/10/09/SNJGroup/CherryHill/635800027249706524-Pyett-Logan.jpg", "site_section": "http://rssfeeds.thedailyjournal.com/vineland/sports", "section_title": "Vineland Sports", "url": "http://www.thedailyjournal.com/picture-gallery/sports/2015/10/09/millville-football-vs-absegami-high-school/73694838/", "country": "US", "title": "Flyers prospect Logan Pyett diagnosed with sarcoma", "performance_score": 0, "site": "thedailyjournal.com", "participants_count": 0, "title_full": "Flyers prospect Logan Pyett diagnosed with sarcoma", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T22:55:00.000+03:00", "replies_count": 0, "uuid": "a24d2ca55e5f35f665c3d7ac6a168b9c33d37b0f"}, "author": "", "url": "http://www.thedailyjournal.com/picture-gallery/sports/2015/10/09/millville-football-vs-absegami-high-school/73694838/", "ord_in_thread": 0, "title": "Flyers prospect Logan Pyett diagnosed with sarcoma", "locations": ["Logan Pyett"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Flyers prospect Logan Pyett diagnosed with sarcoma \nLogan Pyett signed an AHL contract with the Flyers over the summer. (Photo: JustSports Photography) Flyer Files Dave Isaac , @davegisaac 3:55 p.m. EDT October 9, 2015 \nSUNRISE, Fla. Logan Pyett was working out last week and had no pain, but noticed that his left calf was swollen. \nThe 27-year-old defenseman, who signed an American Hockey League contract over the summer as a free agent, felt just fine. The Lehigh Valley Phantoms went through tests anyway. \nOver the last two weeks he's been through \"a battery\" of them, according to Flyers general manager Ron Hextall, and the findings show that Pyett has sarcoma, a rare form of cancer that affects soft tissue. \n\"He’s a great kid,\" Hextall said. \"I’ve actually talked to him a few times and he’s obviously had his life turned upside down, but he’s got a great attitude. Hopefully things go in the right direction.\" \nPyett is being treated at the University of Pennsylvania in Philadelphia and is out indefinitely from hockey. He played in the Phantoms' preseason game last Wednesday in Wilkes-Barre, Pa. against the Penguins but won't be part of the Phantoms' plans as they move toward the regular-season opener Saturday night. \nStarting Monday, Pyett will undergo chemotherapy four days a week for three weeks and then doctors will remove the tumor. The American Cancer Society estimates that in 2015 there will be only 11,930 new soft tissue sarcoma diagnosis. It is a rare form of cancer. \nPyett, a native of Saskatchewan, Canada and a former seventh-round pick of the Detroit Red Wings in 2006, played the last two seasons in Russia's Kontinental Hockey League. This is his first season back in North American since spending the 2012-13 season with the AHL's Connecticut Whale. \nWhile he wasn't going to be part of the Flyers' NHL plans, Pyett now finds himself getting all of the organization's support as he embarks on recovery. \n\"He’s in our family,\" Hextall said. \"He’s under our umbrella and he knows that. We’re going to do everything we can to get him the best care. I’ve already told him if he needs hotel rooms down our way while he’s getting the treatment, he’s welcome to it. We’re going to look after him like he’s ours. He’s under our umbrella and we care about our players.\" \nHextall says the team is under the impression that there won't be the need for amputation and recent tests have \"come back in a good way,\" but isn't sure just how life threatening the cancer is. \n\"We haven’t got into that. I don’t know that,\" the GM said. \"I do know there’s a lot of positive signs. That’s the best I know. They don’t know that, at this point, how much risk there is. Everything’s been positive so far. The kid’s got a great attitude. I guess so far, so good. \nDave Isaac; (856) 486-2479; disaac@gannettnj.com Read or Share this story: http://on.cpsj.com/1Rywo6o Most Popular", "external_links": [], "published": "2015-10-09T22:55:00.000+03:00", "crawled": "2015-10-10T06:01:50.336+03:00", "highlightTitle": ""}