{"organizations": ["WKU MTSU", "MTSU", "WKU Aldo Giovanni Amato", "Blue Raiders"], "uuid": "8e5b71020f683262d5d26615b287335f2cc946b0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dnj.com", "main_image": "http://www.gannett-cdn.com/-mm-/a30ed7034c50b1d4a743bf8587d5dced9c67e7cd/c=0-272-2000-1402&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/05/TNGroup/Murfreesboro/635796688712026065-MURBrd-09-08-2015-DNJ-1-B001--2015-09-07-IMG-Bryson-1-1-F7BRRMSK-L671644244-IMG-Bryson-1-1-F7BRRMSK.jpg", "site_section": "http://rssfeeds.dnj.com/murfreesboro/sports", "section_title": "Murfreesboro - Sports", "url": "http://www.dnj.com/story/sports/college/mtsu/2015/10/05/mtsu-looks-revive-run-game-wku/73397342/", "country": "US", "title": "MTSU looks to revive run game at WKU", "performance_score": 0, "site": "dnj.com", "participants_count": 0, "title_full": "MTSU looks to revive run game at WKU", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T03:23:00.000+03:00", "replies_count": 0, "uuid": "8e5b71020f683262d5d26615b287335f2cc946b0"}, "author": "", "url": "http://www.dnj.com/story/sports/college/mtsu/2015/10/05/mtsu-looks-revive-run-game-wku/73397342/", "ord_in_thread": 0, "title": "MTSU looks to revive run game at WKU", "locations": ["Western Kentucky"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jeremiah Bryson"], "text": "MTSU looks to revive run game at WKU Aldo Giovanni Amato, agamato@dnj.com 7:23 p.m. CDT October 5, 2015 Buy Photo Jeremiah Bryson (5) said he believes the running game can get going again against rival Western Kentucky. The Blue Raiders have not topped the 100-yard mark in the past two games. (Photo: HELEN COMER/DNJ) Buy Photo CONNECT 1 TWEET LINKEDIN COMMENT EMAIL MORE \nMURFREESBORO — One of the key strengths of MTSU’s offense has looked anything but dangerous the past two games. \nThe Blue Raiders are trying to find a way to get the run game going after rushing for a dismal 72 yards combined over their last two games. \nRunning back Jeremiah Bryson said injuries on the offensive line could be the reason why MTSU has averaged no more than 1.5 yards per carry over the past two games. \n\"I'd say it's probably been a little reason,” he said. “We haven't had (guard) Darius (Johnson) but he's back and finally got his feet wet. \n“He'll just keep improving as the season goes on. I feel like this week the run game should be back.\" \nJohnson returned to the lineup for the first time this season after being out with an ankle injury sustained during the preseason. \n“The successful runs we did have were behind him,” Bryson said. “This was just his first game of the season, too, so he's just going to keep getting better and improving.\" \nBryson ended up leading all MTSU rushers Saturday with 17 yards in the loss to Vanderbilt. As a group, MTSU's longest rush of the night was for eight yards. \nFollowing the loss to Vanderbilt, coach Rick Stockstill said the Blue Raiders had a game plan to throw on the Commodore defense early. MTSU finished with 28 more passing attempts than rushing attempts. \nIt should be noted that four of those attempts came in the final minute when MTSU trailed by four points. \n\"Sometimes you have got to give the other teams credit,” Stockstill said. “We didn't run the ball very well against Alabama, Illinois or Vanderbilt. We have played a heck of a schedule so far with the teams we have had to play. \n“To me, you have to give the other teams credit that we have played. We ran the ball pretty good against Jackson State and Charlotte. These other three teams have really good defenses.” \nSaturday’s game may provide an opportunity for MTSU to revive its running game. \nWestern Kentucky has allowed three of its five opponents to rush for more than 100 yards. \nBryson said the only way the running backs will get going again is to execute when they have the opportunity. \n\"I wouldn't say it's that we are missing holes or anything,” he said. “We just have to put a scheme together, have a good game plan and come out on Saturdays and execute the best we can.\" \nNEXT GAME \nWhen : Oct. 10 (11 a.m.) \nWhere : Houchens Stadium (Bowling Green, Ky.) \nSeries : MTSU leads 34-29-1 \nTV : Fox \nRadio: 89.5 FM, 102.5 FM, 97.5 FM, 100.5 FM, 101.9 FM, 1450 AM \nNotable : MTSU hasn't lost to WKU in Bowling Green since 1989. A win and MTSU could improve to 2-0 in Conference USA play and put themselves in good shape. \nReach Aldo Amato at 615-278-5109 and on Twitter @Aldo_ Amato. Read or Share this story: http://on.dnj.com/1LeRt4E TOP VIDEOS", "external_links": [], "published": "2015-10-06T03:23:00.000+03:00", "crawled": "2015-10-06T03:49:06.826+03:00", "highlightTitle": ""}