{"organizations": [], "uuid": "11e1f2b7a2c2f7ae30401fabef278cbe929a66a8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "kentuckysportsradio.com", "main_image": "http://kentuckysportsradio.com/wp-content/uploads/2015/10/IMG_8347-600x352.jpg", "site_section": "http://kentuckysportsradio.com/comments/feed/", "section_title": "Comments for Kentucky Sports Radio", "url": "http://kentuckysportsradio.com/basketball-2/i-watched-katina-and-her-girls-on-the-view-so-you-didnt-have-to/", "country": "US", "title": "Comment on I watched Katina and her girls on “The View” so you didn’t have to by Sir Richard", "performance_score": 0, "site": "kentuckysportsradio.com", "participants_count": 1, "title_full": "Comment on I watched Katina and her girls on “The View” so you didn’t have to by Sir Richard", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T08:51:00.000+03:00", "replies_count": 0, "uuid": "11e1f2b7a2c2f7ae30401fabef278cbe929a66a8"}, "author": "Sir Richard", "url": "http://kentuckysportsradio.com/basketball-2/i-watched-katina-and-her-girls-on-the-view-so-you-didnt-have-to/", "ord_in_thread": 0, "title": "Comment on I watched Katina and her girls on “The View” so you didn’t have to by Sir Richard", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted in Basketball , Main | 43 Responses \nKatina Powell and her daughters Rod-Ni and Lindsay appeared on ABC’s “The View” this morning to discuss the Louisville sex scandal. “The View” is a train wreck, so I fell on the sword and watched it so you wouldn’t have to. \n11:00: Here we go! This will be fun, right? Listen to that peppy music! Oh look, those women are going to walk around New York for breast cancer awareness. Awesome! \n11:02 : Raven Symone?! What the hell is she doing on this show? I know Whoopie and Joy Behar, but who are the rest of these people? \n11:03 : Why are they randomly switching chairs? WAIT, is that DJ Tanner?! \n11:04: The one in the middle — rewinds to intro– Michelle Collins, just said “I love being a bitch. It’s a powerful, powerful word. It’s a wonderful thing.” Huh? \n11:05: Benghazi blah blah \n11:06: It is clear most of these women are idiots. The worst part is that people are applauding their idiotic points. DJ Tanner and That’s So Raven talking about Benghazi is like the drunk sorority girl at the end of the bar talking about football. Just stop. \n11:09: Commercial break, thank God. \n11:14: In the segment called “Where did you learn about sex?”, the “I love being a bitch” girl just said: “My public school in Miami did teach abstinence along with other things and I also had Cinemax.” That’s So Raven one ups her with “ME TOO! I had the Spice Channel!” \nThis is absurd, but what a perfect intro for Katina and her girls. \n11:18: Commercial break, but look what’s coming up! \n11:23 : Katina is sporting a fresh new ‘do and once again says she called the NCAA first but they didn’t offer any assistance. \n11:25 : That’s So Raven asks Katina’s motive in writing the book and mentions confidentiality agreements. Like Andre McGee would have been that smart! Katina keeps it real and says her motive was to “sell a book.” \n11:27 : Paula’s husband coached basketball once and said this stuff happens all the time so it’s not a big deal, right? Loud music, alcohol strippers, no biggie! NO, PAULA, IT DOESN’T HAPPEN EVERYWHERE. Coaches don’t pay women to have sex with players and recruits everywhere. If you’re husband is really telling you that, I suggest you have a talk with him. \n11:27 : Katina says although she started working for McGee in 2010, her daughters didn’t come in the picture until late 2013. When asked who would bring her own daughters into this, she said “My daughters brought their selves into the situation. …It was fun. The girls I had doing it were basically their ages. The basketball players were their ages.” That’s So Raven thought the stripper parties sounded fun! \n11:28 : Despite the sex and the prostitution, the ladies of The View seem fixated on the LOUD MUSIC at these parties. That’s So Raven, aka Urban Dictionary, chimes in and says it was a “Turn-up.” Rod-Ni says that the parties were actually fun, “Going to the parties and being around the basketball players and all that…” \nThat’s So Raven interrupts to agree. \n“It sounds fun! It sounds like a turn-up. I’m sorry! It sounds like a normal party.” \nRod-Ni silences her with side-eye. \n“People make it seem worse,” Rod-Ni says. “It is a big deal. Everbody wasn’t right. At the end of the day, it’s not as bad as people make it seem.” \nAs That’s So Raven said, it was just a turn-up! \n11:29 : When asked if Pitino knew about it, Katina repeats her claim that Andre told her “Pitino knows about everything.” \nWhen asked again, Katina keeps it real and says her main motivation in writing the book was to make money. \n“It’s about the book and the money, I’d be lying if I said it wasn’t,” Katina said. “I think people get the wrong perception. It’s like, ‘bash me because of what I’ve done,’ but the big picture is, do you want your child to come to college as a young boy and the leave as a grown man with 2 girls…you know. It was what it was.” \n11:32 : The same can be said for the last 32 minutes of my life. Pass the Advil. \nUPDATE : If you really want to torture yourself, here’s the clip of their appearance. Article written by Mrs. Tyler Thompson No, I will not make you a sandwich, but you can follow me on Twitter @MrsTylerKSR or email me . 43 responses to “I watched Katina and her girls on “The View” so you didn’t have to” Catlogic15 October 23, 2015 at 12:06   \nI don’t think those girls did themselves any favors being on that show. Their lawyer should have had them better prepared. buy_me_a_boat October 23, 2015 at 1:41 pm | Permalink \nIt’s a “Fascinator”. Breeders Cup will be full of them. meeksfor3 October 23, 2015 at 12:10   \nWhat the crap is the hair do on her head? Is she trying to bring back the 80’s group Flock of Seagulls? I cannot think of The View and not be reminded of the moderator on Billy Madison…..”What you’ve just said is one of the most insanely idiotic things I have ever heard. At no point in your rambling, incoherent response were you even close to anything that could be considered a rational thought. Everyone in this room is now dumber for having listened to it. I award you no points and may God have mercy on your soul”. buy_me_a_boat October 23, 2015 at 1:42 pm | Permalink \nIt’s a “Fascinator”. Breeders Cup will be full of them. J-Dub421 October 23, 2015 at 3:30 pm | Permalink \nA fascinator is a hat. That is her hair, or maybe a weave. J-Dub421 October 23, 2015 at 12:13   \nWhat on earth iks Raven Simone wearing?? It looks like a gold lame` haz-mat suit. Mathlete October 23, 2015 at 1:17 pm | Permalink \nIt says a lot when you’re the trashiest looking person on a TV show featuring 3 self-confessed prostitutes pimping a book about their exploits. UKErin October 23, 2015 at 12:14   \nI honestly thought Raven was one of the daughters at first glance with that hair and outfit Matt Jones October 23, 2015 at 12:25   \nOf course Pitino knew. Do you think I don’t know who took a dump in the bathtub of my hotel in Cleveland? Drew Franklin October 23, 2015 at 12:30 pm | Permalink \nI’m a psychic. Postseason bans are in your future. Fred October 23, 2015 at 12:26   \nI can’t tell. Which one is the whore? yarg October 23, 2015 at 12:27   \nI don’t get why this woman isn’t being raked over the coals everywhere she goes. Flux October 23, 2015 at 12:28   \nFlux October 23, 2015 at 12:27   I hate da tards. But her interview only helped uofl. Her story keeps changing. Scott Cox just came out and said McGee wasn’t even in town on the day she claims he told her Rick Knew. She said he told her in a hallway. Plus, she said Harell nailed her daughter on a recruiting visit. That was 2012. Yet, she claims her daughters didn’t get involved until 2013. I bet the uofl lawyers hope she does a couple more interviews. Wish she would stop while she is behind. The old lady said she has relations with Williams. He left in 09 and she said it didn’t start until 2010. ukjaybrat October 23, 2015 at 12:37 pm | Permalink \nI believe she said harrel banged her as a player, not on the recruiting visit… #FactsAreOptional \nAlthough I do agree her story changed a little. I thought the original reason she came forward was because Andre wanted white girls and that made her mad. Not one mention of that today. Maybe she didn’t want to play the race card, who knows… Helps U of L? October 23, 2015 at 12:51 pm | Permalink \nObviously, U of L needs all the help it can get. But if you think continued exposure (pardon my pun) of the issue in any form will help them, you are living in a dream world. J-Dub421 October 23, 2015 at 1:16 pm | Permalink \nShe also clearly stated that T-Will was already in the NBA and came back to visit. Your argument is moot. a backseat baby October 23, 2015 at 1:22 pm | Permalink \nIt doesn’t matter what she says in these interviews. All it will take to sink UL’s ship is one player or recruit telling the NCAA that he got lap dances or sex paid for by somebody else \n. THE VIEW October 23, 2015 at 12:36   \nWow…after seeing the interviews on Good Morning America – ESPN – Outside The Line, makes you wonder if the interview on the VIEW..they were told not to give any BETTER answers then the questions. Yes, its a sad situation all the way around, but for this one reporter, host or what ever the title maybe to say…my husband says this happens everywhere…1. – Coaches pay for the team to have sex? think she needs a new source. 2. shows how little prepared they were to even ask questions. sister mary francis October 23, 2015 at 12:37   \nWhere was DJ Tanner during the interview? Probably backstage burning a candle for the salvation of these 3 magnificent whores BigBlueSkyDog October 23, 2015 at 12:42   \nThanks for taking one for the team, Tyler. \nI’ll say this. These babes are still more sublime than Pitino and half the UL fanbase. Chris Reeder October 23, 2015 at 12:55   \nIs that Raven or Mugatu for Zoolander? poppie1156 October 23, 2015 at 12:55   \nAndre McGee, the former U of L basketball player and director of basketball operations who finds himself at the center of the Cardinal basketball sex scandal, has resigned from his position as assistant coach at UMKC. This according to KCTV5 in Kansas City. \n“The university deserves a full-time assistant coach and I am not able to provide that to the basketball team while the false allegations against me are being investigated,” McGee said in a statement. \nMcGee has been placed on paid administrative leave since the story first broke three weeks ago. \nAfter playing one year professionally overseas, McGee joined the Louisville staff in 2010 as a graduate assistant. He was promoted to director of basketball operations two years later in 2012. In 2014, McGee left U of L to take an assistant coaching position under former Cardinal assistant Kareem Richardson at UMKC. He had been set to begin his second season with the Kangaroos next month. ukjaybrat October 23, 2015 at 12:59 pm | Permalink \n“false allegations” \nThis is the first person associated with louisville athletics that said this didn’t happen. meeksfor3 October 23, 2015 at 1:08 pm | Permalink \nDeny, deny, deny…..looks like the Carolina Way has hit Loserville. catfan4life October 23, 2015 at 1:02   \nSome will try to crucify Powell as only out to get UL and Pitino because of money which may be true, but when she admitted it was about a book told me she had planned the book for a long time. The details in her journal nails it because the allegations are in print with dated timelines, photos, messages, etc. which every ‘court’ would use to prosecute an individual. \nAs far as the money source for Magee it will matter to some extent if the ATM was a booster and it probably was; however, if that booster has close ties to the program they are still toast. That is what nailed Alabama. I guess we could say the outcome will be dark toast or burned toast!? It is clear most of these women are idiots. October 23, 2015 at 1:06   \nUnfortunately not for everyone. October 23, 2015 at 2:16 pm | Permalink \nWe all know that. That doesn’t make anything less true. UKMom October 23, 2015 at 1:12   \nUm, no I do not want the boy I sent to college to come home as a man with two whores. But, thanks for offering, Katina! Mathlete October 23, 2015 at 1:15   \nAre you sure Raven didn’t mean that party sounded like a turnip? I’m not up on what the kids are saying these days. October 23, 2015 at 1:19   \nRaven could be my daughter, I did have sex with a peacock,when I was drunk,along time ago. leon singleton October 23, 2015 at 1:19   \nNCAA should quit wasting time on Louisville and go after North Carolina. Booby Petrino October 23, 2015 at 1:26 pm | Permalink \nActually they should go after both. a backseat baby October 23, 2015 at 1:27 pm | Permalink \nOr make it a threesome and screw UL* and UNC* at the same time Brian October 23, 2015 at 2:17 pm | Permalink \nLOL, keep praying leon. Goldfinger October 23, 2015 at 1:30   \nWho is that woman on the right and why is she wearing one of my garbage bags? Chris A Stone October 23, 2015 at 1:33   \nWasn’t it an academic scandal UK was being punished for when Pitino chose to come to UK and pulled our great program back up from the gutter? Did our beloved Coach Calipari not have 2 prior occasions at 2 different jobs where he was accused of cheating? Weren’t wins vacated? While I agree what’s happening at Louisville is horrific, they’ll get though it, and, we ARE talking about underage children being prostituded out for help to further the UofL basketball program. Or, maybe they were 18, who REALLY knows? They still prostituded themselves out. My point is this, while I’ll openly admit upon hearing of this I shared a laugh w you guys, (behind closed doors), at this point, let’s show a little class and go back to being proud our great state has 2 premier basketball programs, as we sure don’t have much else to be overly proud of in the sports world besides horse racing tracks. (Go Murray State, I don’t want to take away from their accomplishments) Lets focus on getting Skal cleared to play, and taking another shot at winning our 9th National Title. I came to Devin Booker’s defense just last night, (read his Twitter Feed), and I’ll come to Rick Pitino & Louisville’s now. I will always “bleed blue”, and be a PROUD member of Big Blue Nation, but, let’s knock it off guys. None of us are above scandal, or, in my opinion, in very good light with the NCAA Gods, (I don’t much care for them either). I’m not naming names, or, pointing fingers. I’m just saying that we’ve had our laughs, let’s get serious, show some class as “The Gold Standard for College Basketball”, and possibly even give them a little support. To hell with what we think the UofL fans would do for us. Show them why we are THE BEST fan base in college basketball. Anyway, currently, as a fan, Wisconsin trumps even Duke, especially Louisville, as the team I’m most disgusted with! (Just my personal opinion, I’m sure some would still disagree). Go Cats! Go Kentucky! Let’s get it KSR! catfan4life October 23, 2015 at 5:42 pm | Permalink \nNice try Chris, but not happening! I want a new revelation every day. I am also wondering when the football team is going down as well! Pike the Dyke October 23, 2015 at 1:39   \nAll level headed UL fans I know have accepted the fact that the hammer will drop hard on them once this is all finished. The online tards who still want more proof and think WWW is behind this are the only reason I am getting satisfaction out of this. \nThe NCAA does not care and will not take into consideration these interviews with Hurricane Katina. The interviews with recruits and players that confirm her story have already put the nail in the coffin. \nThe longer they publicly support Rick the more I cringe. Jurich and Rick run the university and its not a debate. Ramsey is only a puppet and by letting the University of Rick Pitino embarrass them each day he stays there, I cannot help but scratch my head that athletics and the deep desire to not be little brother have led them all to this. John Ellis October 23, 2015 at 4:09   \nLullville should have sent Katina and her daughters to the ACC press conference. They rep the program now. Bluetothebone October 23, 2015 at 6:17   \nLet’s be honest here…way North of 50% of these kids love this stuff…between their “so called” music and the videos related to it glorify this type of stuff in their lives…what would you expect..hell ALLOF Hollywood does… LEE October 23, 2015 at 6:52   \nCosby touching Raven while she was on The Cosby Show really affected her didn’t it. Whats up with her hair be ready October 23, 2015 at 7:23   \nIs Raven’s outfit one of those blankets that keep you warm if you get caught in an avalanche? Sir Richard October 24, 2015 at 1:51 am | Permalink | Reply \nSo….I was once a whore…and now I am less then that…. \nSo said Rick…", "external_links": [], "published": "2015-10-24T08:51:00.000+03:00", "crawled": "2015-10-24T09:29:39.486+03:00", "highlightTitle": ""}