{"organizations": [], "uuid": "e8e1bb9655218cbddeca7b888389a0eb6d33b0e0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.abqjournal.com", "main_image": "http://main.abqjournal.netdna-cdn.com/wp-content/uploads/2015/10/life04_jd_11oct_1harwood-283x400.jpg", "site_section": "http://www.abqjournal.com/", "section_title": "Albuquerque and New Mexico News, Sports, Business and more | Albuquerque Journal News", "url": "http://www.abqjournal.com/657955/entertainment/taos.html", "country": "US", "title": "Taos printmaking exhibit covers 150 years of Fritz Scholder, E. Irving Couse, E. Martin Hennings", "performance_score": 0, "site": "abqjournal.com", "participants_count": 1, "title_full": "Taos printmaking exhibit covers 150 years of Fritz Scholder, E. Irving Couse, E. Martin Hennings | Albuquerque Journal News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T08:02:00.000+03:00", "replies_count": 0, "uuid": "e8e1bb9655218cbddeca7b888389a0eb6d33b0e0"}, "author": "Kathaleen Roberts / Journal Staff Writer", "url": "http://www.abqjournal.com/657955/entertainment/taos.html", "ord_in_thread": 0, "title": "Taos printmaking exhibit covers 150 years of Fritz Scholder, E. Irving Couse, E. Martin Hennings", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "“Leila with Child” is a 1978 lithograph by R.C. Gorman.\nWhen Gene Kloss first visited Taos on her 1925 honeymoon, she brought her 60-pound printing press, sat it on a stump in Taos Canyon and anchored it with a bag of concrete.\nIf you go\nWHAT: “Pressing Through Time”\nWHEN: Through Jan. 24. 10 a.m.-5 p.m. Tuesdays-Saturdays; noon-5 p.m. Sundays\nWHERE: Harwood Museum of Art, 238 Ledoux St., Taos\nHOW MUCH: $10/adult; $8/seniors (65+); $8/students. Free 18 and under. Visit harwoodmuseum.org or call 575-758-9826 With contrast as stark as a lightning bolt against a black night sky, Kloss created immediately recognizable images of both the Taos landscape and its people.\nThe artist became a regular visitor, moving to the town permanently from Berkeley, Calif., in 1945.\nNow considered one of the major printmakers of the 20th century, Kloss’ work graces the collections of the Metropolitan Museum of Art, The Smithsonian Institution, The Carnegie Institute, The San Francisco Museum of Art, The Library of Congress and the National Academy of Design.\nNow at the Harwood Museum of Art, “Pressing Through Time – 150 Years of Printmaking in Taos” showcases Kloss’ work as well as those of Taos Society of Artists members E. Irving Couse and E. Martin Hennings.\nThe exhibit spans these historic works and dives into the bold prints of Fritz Scholder and R.C. Gorman before landing on the contemporary Taos artists of today as selected by a nationally recognized jury. The exhibition is being co-curated by David Farmer and Bob Parker.\nAn untitled etching by E. Irving Couse is in the “Pressing Through Time” exhibition at the Harwood Museum of Art. (Courtesy of the Couse Family Archive)\n“In Taos, there’s a great and well-documented recognition as an art center where significant painters lived and worked,” Farmer said. “But we hadn’t seen much attention to the world of printmaking.”\nThe curators are amending that gap with 83 prints at the Harwood, spilling into venues across Taos, including the Taos Art Museum at Fechin House, the Millicent Rogers Museum, the E.L. Blumenschein Home/Taos Historic Museums, the Taos Center for the Arts, the Doel Reed Center for the Arts and the Couse-Sharp Historic Site. All told, more than 400 prints are being displayed throughout Taos in this celebration of ink on paper.\nAt the Harwood, the prints stem from both the museum’s collection as well as private collections and other institutions, Farmer said.\nAs remote as New Mexico was, printmaking didn’t exist here until the 1850s. It began to flourish when Philadelphia artist Peter Moran (the brother of Thomas) visited in 1880 and 1881.\nLater, other artists trained in the complex techniques of wood engraving, etching and lithography flocked to the valley, drawn by its rugged mountains and turquoise skies. Over time, the representational nature of Taos printmaking swelled into abstract expressionism with the bold prints of Fritz Scholder.\nThe controversial artist’s “Mystery Horse at Taos” (1978) shows a white horse set against the bold parabolas of the mountains as a curving river or road bisects the valley.\n“He was one of the first artists Tamarind (Institute) approached,” Farmer said. “He did a whole series of work. It’s his choice of color and form and also the beauty of the lithography. It resonates.”\n“Gray Wind” is a lithograph by Veloy Vigil, most likely dating from the late 1980s or early 1990s.\nTamarind is the Albuquerque-based lithography center credited with reviving the art of lithography. It became affiliated with the University of New Mexico in 1970. Many of the prints on display were executed there.\nVeloy Vigil’s undated “Gray Wind” depicts a windswept rider swaddled in a purple, green and blue cloak atop a dappled horse.\nIt’s “the sense of motion in that piece,” Farmer said. “It’s almost floating and moving through the air.”\nBorn in Denver during the Depression, Vigil moved to Taos from Santa Barbara, Calif. His parents had worked in the sugarbeet fields around Greeley, Colo. He lived in Taos during the last part of his life. Critics credit him with exerting a profound impact on public consciousness about Native American art through his abstract imagery. He was descended from the pueblos on his mother’s side.\nThe New York-born Ted Egri was primarily a sculptor before he moved to Taos in the 1950s. His “Church,” c. 1950, is a stylized etching of a nameless house of worship set against the chiseled Taos peaks.\n“Night Mass at Our Lady of Dolores” is an aquatint and etching by Gene Kloss dating from 1937.\n“He lived out the rest of his life here,” Farmer said. “He taught painting and sculpture at the Kansas City Art Institute and at the Universities of Illinois and Iowa.”\nKloss was best known for her aquatints. Her 1937 “Night Mass at Our Lady of Dolores” reveals her interest in indigenous and local ceremonies, which she visited regularly.\nLight floods a gnarled cottonwood and the church facade as dark-cloaked worshippers migrate toward them in a triangular mass.\n“There’s a lot of contrast, but it’s handled with such grace,” Farmer said. “This is a processional of a little church on Canyon Road.”\nGorman’s 1978 lithograph “Laila with Child” shows a Navajo woman breast-feeding her infant.\n“He connected with the Mexican social realists like Diego Rivera,” Farmer said. “The early prints are very exquisite.”", "external_links": ["http://main.abqjournal.netdna-cdn.com/wp-content/uploads/2015/10/life04_jd_11oct_3harwood-450x600.jpg", "http://main.abqjournal.netdna-cdn.com/wp-content/uploads/2015/10/life04_jd_11oct_2harwood-640x478.jpg", "http://main.abqjournal.netdna-cdn.com/wp-content/uploads/2015/10/life04_jd_11oct_4harwood-445x600.jpg", "http://main.abqjournal.netdna-cdn.com/wp-content/uploads/2015/10/life04_jd_11oct_1harwood-424x600.jpg"], "published": "2015-10-11T08:02:00.000+03:00", "crawled": "2015-10-11T10:11:32.750+03:00", "highlightTitle": ""}