{"organizations": [], "uuid": "ee18b1d0cc2d0feefbe9a6cc18a13abe967991f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.detroitnews.com", "main_image": "http://www.gannett-cdn.com/-mm-/b34daf97b910073146f1e7959c209bfd0dd889a2/c=0-0-2135-1206&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/01/DetroitNews/B99310328Z.1_20151001200932_000_GG8JO2H7.1-0.jpg", "site_section": "https://feeds.feedblitz.com/detroit/sports#", "section_title": "Detroit News - Sports", "url": "http://www.detroitnews.com/story/sports/nba/pistons/2015/10/01/defense-early-camp-emphasis-pistons/73177636/", "country": "US", "title": "Defense is early camp emphasis for Pistons", "performance_score": 0, "site": "detroitnews.com", "participants_count": 2, "title_full": "Defense is early camp emphasis for Pistons", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T23:24:00.000+03:00", "replies_count": 1, "uuid": "b4a7e9effddb2e316df2fc7c2d308cf2e6beb846"}, "author": "detroitnews.com", "url": "http://www.detroitnews.com/story/sports/nba/pistons/2015/10/01/defense-early-camp-emphasis-pistons/73177636/#post-0", "ord_in_thread": 0, "title": "Defense is early camp emphasis for Pistons", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Stan Van Gundy said most of the Pistons’ improvement during training camp will take place during 5-on-5 drills and full-team workouts. (Photo: Clarence Tabb Jr. / Detroit News) \nAuburn Hills — Last season, the Pistons ranked in the middle of the pack defensively, allowing 99.5 points.\nAs they gear up for this season, one of coach Stan Van Gundy’s objectives is lowering that number and taking pressure off his big men having to stop shots at the rim.\nThere are some positive signs the teaching is sticking.\n“We made some really good steps forward,” Van Gundy said Thursday. “We really worked on our defense and we made some progress in terms of our intensity and ball pressure.\n“We’re still a long way from having the details we want and we’re not as sharp as we can be, but our intensity was way up. We played a lot harder, and that’s good.”\nVan Gundy said most of the improvement will take place during 5-on-5 drills and full-team workouts during camp.\n“We made some pretty substantial adjustments in terms of our pick-and-roll defense to try and protect the basket a little better and not get overextended as much,” Van Gundy said.\n“We really worked with our guards on getting over picks and getting back in front of the ball.\n“We’ve made substantial adjustments there and minor adjustments in guarding shooters coming off screens.”\nIn most cases, though, center Andre Drummond will be the last line of defense, so he’ll have added responsibilities of calling out defensive sets and letting guards know when picks are coming.\n“Defense just comes down to making the right calls — early, loud and often,” Drummond said. “I’ve done a great job of that throughout training camp and having the right positioning on the post and playing good pick-and-roll defense. If you don’t want your guards to get killed on the screens, you have to speak up.”\nWith the addition of Marcus Morris from the Suns, the Pistons have a tough defender who can guard either forward position.\nThat gives them some freedom to play small or big and not be overmatched on switches in the pick-and-roll.\nRookie Stanley Johnson adds physicality at forward, making the position an upgrade over last season. But as Johnson learns the game, there are options with Ersan Ilyasova and Anthony Tolliver to guard power forwards.\nMorris, however, could be the key, paired with Drummond to form a tough front line.\n“We actually have the personnel; our changes defensively were more based on trying to keep our bigs — Andre, in particular — around the basket more and to try to prevent layups and not rotate as much,” Van Gundy said.\nrod.beard@detroitnews.com \ntwitter.com/detnewsRodBeard", "external_links": [], "published": "2015-10-01T23:24:00.000+03:00", "crawled": "2015-10-02T05:51:36.114+03:00", "highlightTitle": ""}