{"organizations": ["NBA", "Knicks"], "uuid": "c6afc9f94dc72fb5439510080462ae1196b29c97", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.beaumontenterprise.com", "main_image": "http://ww1.hdnux.com/photos/41/31/45/8755536/3/rawImage.jpg", "site_section": "http://www.beaumontenterprise.com/sports/basketball/collectionRss/Sports-Basketball-Heds-7404.php", "section_title": "Sports Basketball Heds", "url": "http://www.beaumontenterprise.com/sports/article/Matt-Barnes-NBA-looking-into-incident-with-6559017.php", "country": "US", "title": "Matt Barnes: NBA looking into incident with Knicks' coach", "performance_score": 0, "site": "beaumontenterprise.com", "participants_count": 0, "title_full": "Matt Barnes: NBA looking into incident with Knicks' coach", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T23:54:00.000+03:00", "replies_count": 0, "uuid": "c6afc9f94dc72fb5439510080462ae1196b29c97"}, "author": "", "url": "http://www.beaumontenterprise.com/sports/article/Matt-Barnes-NBA-looking-into-incident-with-6559017.php", "ord_in_thread": 0, "title": "Matt Barnes: NBA looking into incident with Knicks' coach", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Matt Barnes"], "text": "Close Image 1 of 1 \nNew York Knicks head coach Derek Fisher motions to a referee during the second quarter of a preseason exhibition basketball game against Paschoalotto Bauru, Wednesday, Oct. 7, 2015, in New York. Photo: Julie Jacobson, AP New York Knicks head coach Derek Fisher motions to a referee during... Matt Barnes: NBA looking into incident with Knicks' coach 1 / 1 Back to Gallery MEMPHIS, Tenn. (AP) — The NBA is investigating the incident between Grizzlies forward Matt Barnes and Knicks coach and former teammate Derek Fisher , a situation Barnes said is \"personal matter\" involving someone who was a good friend at one point. \"Life happens, and being a professional athlete, you have to be able to maneuver and separate your personal life from your professional life,\" Barnes said Thursday after the Grizzlies' morning shootaround, noting the league's investigation of the incident in California. \"And I'm here to play basketball, so there won't be any distractions.\" The veteran said in video posted by The Commercial Appeal that he has not spoken with the NBA yet. \"All the real details will come out at some time,\" Barnes said. A person with knowledge of the situation told The Associated Press on Wednesday that the incident occurred last Saturday while Fisher was attending a gathering at the home of Barnes' estranged wife, Gloria Govan . The person spoke on condition of anonymity because no details were publicly released about the incident. Fisher and Barnes were teammates with the Los Angeles Lakers from 2010-12. The Grizzlies wrapped training camp in Santa Barbara earlier last Saturday. At Knicks' practice Thursday in Greenburgh, New York, Fisher wouldn't comment when asked if he might press charges. He said he has talked directly with both management and his players. \"It's still something I can't comment on until the situation or the process plays completely out,\" Fisher said. \"If I decide to or have the opportunity to address it later, I guess I will. At this point, that's probably not the right thing to do.\" Memphis acquired Barnes in a draft-day trade in June. Coach Dave Joerger told reporters Thursday that the Grizzlies support Barnes, and the veteran said the support of his new team feels good. \"I explained to them what happened, and they completely understand and had my back,\" Barnes said. Fisher is in his second season with the Knicks after spending most of his playing career in Los Angeles, where his children remain. Fisher missed practice Monday — the team announced at the time it was for personal reasons — and the coach said Thursday plane issues delayed his return. Fisher led the Knicks in their exhibition opener Wednesday night against a Brazilian club team. ___ AP Basketball Writer Brian Mahoney contributed to this report from New York.  ", "external_links": [], "published": "2015-10-08T23:54:00.000+03:00", "crawled": "2015-10-09T00:49:09.722+03:00", "highlightTitle": ""}