{"organizations": [], "uuid": "15d9ed051a78957af3e1104df7e479380fcc218a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "http://www.bostonherald.com/sites/default/files/media/2015/09/07/090715bradley1.jpg", "site_section": "http://bostonherald.com/sports", "section_title": "Sports | Boston Herald", "url": "http://bostonherald.com/sports/patriots_nfl/new_england_patriots/2015/10/red_sox_outfield_needs_reinforcements", "country": "US", "title": "Red Sox outfield needs reinforcements", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "Red Sox outfield needs reinforcements | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "15d9ed051a78957af3e1104df7e479380fcc218a"}, "author": "Jason Mastroddonato", "url": "http://bostonherald.com/sports/patriots_nfl/new_england_patriots/2015/10/red_sox_outfield_needs_reinforcements", "ord_in_thread": 0, "title": "Red Sox outfield needs reinforcements", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Even if the Red Sox had won seven more games this season, enough to force their way into a one-game playoff and have a chance at meaningful baseball games in October, who would’ve been on the field?\nIt looked like some of those young guys like Mookie Betts and Xander Bogaerts could’ve played straight through Thanksgiving, but much of the roster was worn down, sick, injured or over their innings limits.\nDespite what was written here in February, when the Red Sox had too many outfielders and could have fielded a second squad with their Triple-A roster, this team proved that it wasn’t built to win.\nNor was it built to last.\nThe position-less Hanley Ramirez saw his season end early with a shoulder injury/defensive inadequacy, so it’s no wonder he’ll soon begin a two-week vacation he apparently had been “planning for a long time,” president of baseball operations Dave Dombrowski said on Tuesday. Pablo Sandoval might still be recovering from his bout with pneumonia he picked up in mid-September. Pneumonia might be one of the few ailments that could keep Brock Holt from playing in the postseason, though he was barely walking by Oct. 1 and could’ve circled six parts of his body on an injury list. At catcher, Ryan Hanigan had a hurt finger and Blake Swihart suffered the same during the Sox’ final game.\nDombrowski said 28-year-old Rusney Castillo, finishing up his first full professional season in America, looked “tired at the end,” while the same case could be made for Jackie Bradley Jr., who had just 11 hits in his final 94 plate appearances (though in fairness, it’s possible he could make diving catches on two hours sleep).\nSo even if the Red Sox were still alive in this thing, and if they were miraculously getting ready for the American League Championship Series that begins tonight, they might’ve fielded a lineup that had Sandy Leon catching, Deven Marrero playing third and Allen Craig in left.\nEither that, or many of the injured/ill players would’ve been forced to gut it out like the 2013 Red Sox did. Within days after they finished winning the World Series, general manager Ben Cherington spent nearly 10 minutes giving reporters the rundown on offseason surgery schedules.\nIt’s what makes these championship teams so special. Not only were they talented, they could withstand the test of time and injury.\nAnd that’s where the Red Sox need to improve for next year. Asked recently to speculate on the club’s ability to contend next year, Dombrowski wouldn’t go further than to say, “we have a chance to be competitive.” Being competitive in Boston is rarely good enough. They need a team that can play in October, November even.\nAnd currently, they’re at a disadvantage as they look to create a roster for next season, because reinforcements aren’t coming.\nThey won’t have Castillo and Bradley lingering in the minors to begin the year, ready to help when needed. They’re officially out of fly chasers now. Pawtucket’s final game sent out this outfield alignment, from left to right: Chris Marrero, Jonathan Roof, Aneury Tavares.\nThe Red Sox outfield, for all its late-summer glory and defensive highlights, needs help.\nAt least they have three good starters.\nCastillo finished the year with eight hits in his final 65 plate appearances. He hit .289 with a .735 OPS in more than 200 plate appearances prior, enough to convince Dombrowski he deserves a chance at winning the left field job next year, but nothing is guaranteed.\nAsked if Castillo, Bradley and Betts would be starting in 2016, the new boss said, “Mookie is easy,” but then warned, “I’m not ready to make that declaration. I do I think it’s important to have the flexibility for (manager John Farrell) where he can still pick and choose when he wants to give those guys a break against certain pitchers.”\nAnd that means adding more outfielders.\nThe Red Sox are likely to need much of their $30 million or so in freed-up payroll to spend on upgrading the pitching staff. As little money as possible must be carefully used to bring in additional outfield options.\nLeft-handed-pitching mashers Chris Young, Steve Pearce and even the bearded Jonny Gomes could be strong free agent options on the cheap. And the Sox may need more than one.\nThey have to find backup plans if Castillo gets hurt (again) or Bradley can’t hit as everybody hopes.\nThe Red Sox can’t afford to look tired at this time next year.", "external_links": [], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-16T11:25:24.419+03:00", "highlightTitle": ""}