{"organizations": [], "uuid": "5eb5c423cd46a6a4ce9d915f0dcc88384616da32", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.boston.com", "main_image": "http://p.o0bc.com/rf/image_1920x1190/Boston/2011-2020/2013/05/25/Boston.com/Metro/Images/hubway31222.jpg", "site_section": "http://www.boston.com/", "section_title": "Boston, MA news, breaking news, sports, video | Boston.com", "url": "http://www.boston.com/news/local/massachusetts/2015/10/05/hubway-launching-new-boston-stations-this-week/yChhrf2YtP6jRDtZfUsH2N/story.html", "country": "", "title": "Hubway launching new Boston stations this week - Massachusetts news", "performance_score": 0, "site": "boston.com", "participants_count": 1, "title_full": "Hubway launching new Boston stations this week - Massachusetts news", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "5eb5c423cd46a6a4ce9d915f0dcc88384616da32"}, "author": "Adam Vaccaro", "url": "http://www.boston.com/news/local/massachusetts/2015/10/05/hubway-launching-new-boston-stations-this-week/yChhrf2YtP6jRDtZfUsH2N/story.html", "ord_in_thread": 0, "title": "Hubway launching new Boston stations this week - Massachusetts news", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Boston’s public cycling system is getting a little more robust this week, with the city adding 11 new Hubway stations inside city limits.\nThe new stations began rolling out late last week, and so far three are up and running. Their locations:\n• At West Broadway and D Street in Southie;\n • At Seaver Street and Humboldt Avenue, at Franklin Park in Roxbury;\n• On Huntington Avenue, between Ruggles and Vancouver Streets, near Wentworth Institute of Technology.\nEight more are coming by the end of this week, according to the website of the city’s cycling program, Boston Bikes. They are spread across the city, with locations:\n• At Blue Hill Avenue and Franklin Park Road, at the Franklin Park Zoo;\n• At Dorchester Avenue and Harbor View Street in Dorchester;\n• At Main Street and Eden Street in Charlestown;\n• At Bunker Hill Community College in Charlestown, near Austin Street;\n• At Nashua Street and Martha Road, near North Station;\n• At Cambridge and Washington streets, near Brighton Center;\n• At Brock and Washington streets in Brighton;\n• At The Lawn on D in the Seaport District.\nThe city is also planning on four more stations, but those stations are waiting on permitting or construction issues to be resolved. When they’re ready, they will be located at:\n• The Troy Boston development in the South End;\n• Liberty Wharf in the Seaport;\n• Savin Hill in Dorchester;\n• Heath Street and South Huntington Avenue in Jamaica Plain.\nOnce all 15 new stations are installed, the city will have 106 in its boundaries, and there will be 155 system-wide (Hubway is also in Cambridge, Somerville, and Brookline). Hubway spokesman Benjy Kantor said Cambridge is also planning to add new stations, but there is not a definite timeline for that yet.\nThrough August of this year, Hubway riders across the region had taken 720,000 trips, Kantor said. In 2014, for the full calendar year, riders took nearly 1.2 million trips.\nGorgeous morning runs around Boston:\nPrevious -- of -- Next The Chestnut Hill Reservoir is home to a 1.5-mile loop for Newton residents—and Boston College students—to take advantage of. Essdras M. Suarez / The Boston Globe Previous -- of -- Next Looping through the Boston Common and Public Garden gives runners about 2 miles’ worth of views of historic downtown and intricate gardens. Keith Bedford / The Boston Globe Previous -- of -- Next Alewife Linear Park begins at the T stop in Alewife and stretches for about 2 miles through Cambridge and Somerville. Tim Sackton / Flickr Creative Commons Previous -- of -- Next For a run along the ocean, head to Quincy Shore Drive. Starting at Billings Street and running to the end of the boardwalk, it’s just under 4 miles round trip. Jonathan Wiggs / The Boston Globe Previous -- of -- Next A run around Castle Island is a little over 2 miles, which passes by the sand and the inlet at the tip of South Boston. Pat Greenhouse / The Boston Globe Previous -- of -- Next Advertisement Previous -- of -- Next The Back Bay Fens is a fairly secluded area still close the to city’s center, with a running loop of about 2.5 miles. With a track, gardens, and paths along the Muddy River, the scenery is diverse, and crowds aren’t common. Don Eunson / The Boston Globe Previous -- of -- Next Franklin Park is the largest park in the city, nestled between Dorchester and Jamaica Plain. Aram Boghosian / The Boston Globe Previous -- of -- Next Circling the Charles River Esplanade between Riverbend Park in Cambridge and The Longfellow Bridge is one of the city’s longer runs at just over 7 miles. John Tlumacki / The Boston Globe Previous -- of -- Next A lap around Jamaica Pond is 1.5 miles, with stunning sunrise views reflecting off the water and through the trees. Matthew J. Lee / The Boston Globe Previous -- of -- Next Fresh Pond in Cambridge is a 3-mile loop, which is located about a 10 minute walk from the Alewife T station. Matthew J. Lee / The Boston Globe Previous -- of -- Next Advertisement Previous -- of -- Next Stretching more than 7,000 acres through Quincy, Dedham, Milton, and Randolph, the Blue Hills Reservation has running trails that go through the woods and along ponds, with views of the city. Pat Greenhouse / The Boston Globe Previous -- of -- Next At the Brookline Reservoir, runners can take advantage of the shorter lap distance of about one mile. Lane Turner / The Boston Globe Previous -- of -- Next A run along the Commonwealth Avenue Mall is full of historic statues and sprawling trees in the heart of the city. From Hynes Convention Center to Boston Common, the run is about 1.75 miles. Lane Turner / The Boston Globe Previous -- of -- Next The Harborwalk stretches from Chelsea Creek to the Neponset River, giving runners in East Boston, Charlestown, the North End, Downtown, South Boston, and Dorchester a jog around Boston Harbor. Craig F. Walker / The Boston Globe Previous -- of -- Next The Arnold Arboretum is nearly 300 acres with walking, biking, and jogging paths. Its collection of trees and plants is one of the most comprehensive in the world. Dina Rudick / The Boston Globe Previous -- of -- Next Advertisement", "external_links": ["http://blog.bostonbikes.org/post/130346796114/introducing-bostons-newest-hubway-locations"], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-05T17:35:04.657+03:00", "highlightTitle": ""}