{"organizations": [], "uuid": "48c28e14e6717932f9df5333008baee7bdfc0bea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailyherald.com", "main_image": "http://www.dailyherald.com/storyimage/DA/20151009/sports/151008697/AR/0/AR-151008697.jpg&amp;updated=201510092217&amp;imageversion=Facebook&amp;exactH=630&amp;exactW=1200&amp;exactfit=crop&amp;noborder", "site_section": "http://www.dailyherald.com/rss/feed/?feed=sports_all", "section_title": "DailyHerald.com &gt; Sports", "url": "http://www.dailyherald.com/article/20151009/sports/151008697/", "country": "US", "title": "Imrem: Cubs turn to Hendricks for biggest game of season", "performance_score": 0, "site": "dailyherald.com", "participants_count": 2, "title_full": "Imrem: Cubs turn to Hendricks for biggest game of season - DailyHerald.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T06:17:00.000+03:00", "replies_count": 1, "uuid": "710d99f33e9f59f6312025fe3ebb66a489cbe4d3"}, "author": "Mike Imrem", "url": "http://www.dailyherald.com/article/20151009/sports/151008697/#post-0", "ord_in_thread": 0, "title": "Imrem: Cubs turn to Hendricks for biggest game of season", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "This wasn't what the Cubs had in mind when they qualified for the National League Division Series.\nThe Cubs didn't figure that they'd compile only three hits in a 4-0 loss Friday night at St. Louis.\nThey didn't figure if Jon Lester pitched up to his $155-million contract that he would lose even to the Cards' prime-time John Lackey.\nFinally, the Cubs didn't figure that now No. 3 or No. 4 starter Kyle Hendricks would have to win their latest biggest game of the season.\nThe Cardinals prevailed in the series opener and a second straight victory on Saturday would force the Cubs to win three straight games in the best-of-five series.\nGood luck with that assignment, fellas.\nLackey's 7⅓ shutout innings shoveled the Cubs into a hole and prompted Cardinals' manager Mike Matheny to say, \"We talk about him being a big-game pitcher. He thrives in these situations.\"\nSo it's up to Hendricks to be for the Cubs what Lackey was for the Cardinals, and why shouldn't it come down to this?\nYoung players have had to power the Cubs all season and it's up to Hendricks, who is 25 years old, looks more like 15 years old, and will have to pitch Game 2 like a 35-year-old veteran.\nThe Cubs' predicament demonstrates the advantage of winning a division as opposed to making the playoffs as a wild-card team.\nAfter winning the NL Central, the Cardinals could line up their starting pitching any way they wanted … starting with Lackey in Game 1.\n\"He's fearless,\" Cubs' manager Joe Maddon said of Lackey. \"He comes from Texas. He kind of has that John Wayne strut out there.\"\nThe Cubs? They countered with Lester, not too shabby considering his successful postseason experience and $155 million contract.\nBut on the bench was Jake Arrieta, who passed Lester as the Cubs' ace but is unavailable until Game 3 after having to pitch the wild-card victory.\nSo now it's Hendricks with his 8-7 record and 3.95 earned run average against Jaime Garcia's 10-6 record and 2.43 ERA.\nHendricks has to figure out how to win a game the way the Cardinals find ways to win games.\nOn this night the Cards' first two batters created a run, which as it turned out could have stood up for a 1-0 victory.\nThe Cubs did that to the Pirates in the wild-card game -- two batters, one run -- giving Arrieta all he needed.\nAs usual, though, the Cardinals left nothing to chance.\nA couple of St. Louis rookies, Tommy Pham and Stephen Piscotty, hit home runs in the eighth inning to reduce any anxiety.\nHow ironic that was, considering that Cubs' rookies Kris Bryant, Addison Russell and Kyle Schwarber are supposed to be the young players who make a difference in this NLDS.\nThe Cardinals just keep doing this. They just keep bringing up young players who look like seasoned veterans when the playoffs begin.\nThe Cardinals also won this one with left fielder Matt Holliday on a bum leg, catcher Yadier Molina nursing a bum thumb and a couple other players gutting it out with bum body parts.\nThe Cardinals just proceeded to do what the Cardinals do: Find a way to win and it was obvious how they did it.\n\"They pitched well all season,\" Maddon said of the Cards. \"The reason they won 100 games was they pitched so well.\"\nNow it's fresh-faced Kyle Hendricks' job tonight to do to Jaime Garcia what grizzle-faced John Lackey did to Jon Lester.\nmimrem@dailyherald.com\nRelated Article\n'Back to the Future' writer says 2015 Cubs prediction no longer a joke Related Article\nImrem: Cubs magical mystery tour ready for St. Louis Related Article\nImrem: Cubs have a true wild card in Castro Share this page Tweet This article filed under: Columnists Sports MLB Cubs Imrem, Mike Baseball Pro Sports Pro Men", "external_links": ["https://twitter.com/share"], "published": "2015-10-10T06:17:00.000+03:00", "crawled": "2015-10-10T23:32:42.883+03:00", "highlightTitle": ""}