{"organizations": [], "uuid": "d54a3bf144b9e025c4d00e0063c40602b8aca225", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.philstar.com", "main_image": "http://www.philstar.com/sites/all/themes/freeman_default/logo.png", "site_section": "http://www.philstar.com/rss/cebu-sports", "section_title": "philstar.com - Cebu Sports", "url": "http://www.philstar.com/cebu-sports/2015/10/21/1513186/carolinians-rejoice", "country": "US", "title": "Carolinians rejoice", "performance_score": 0, "site": "philstar.com", "participants_count": 0, "title_full": "Carolinians rejoice", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T19:00:00.000+03:00", "replies_count": 0, "uuid": "d54a3bf144b9e025c4d00e0063c40602b8aca225"}, "author": "", "url": "http://www.philstar.com/cebu-sports/2015/10/21/1513186/carolinians-rejoice", "ord_in_thread": 0, "title": "Carolinians rejoice", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Emmanuel B. Villaruel"], "text": "  Carolinians rejoice By Emmanuel B. Villaruel   21, 2015 - 12:00am \nCEBU, Philippines – Drawing a monstrous performance from Shooster Olago, the University of San Carlos Warriors outclassed the University of the Visayas Green Lancers, 64-53, in the deciding match of their best-of-five finals to win their first collegiate cage crown in 57 years at the jampacked Cebu Coliseum last night \nEnding their nearly six-decade title drought was obviously more precious for the Warriors than wrapping up the championship of the 15th Cebu Schools Athletic Foundation, Inc. cage season, thanks to Olago who literally carried the Warriors on his broad shoulders when it mattered most. \nUnloading 26 points on top of 20 rebounds, the 6-foot-7 Olago took matters into his own hands in a blistering 24-6 attack in between the third and fourth quarters that brought the stunned Lancers down on their knees. \n\"I can't express my feelings right now. Being the only link from the last champion team of USC to this present set of champions, it's truly a sentimental, meaningful win for me,\" said a teary-eyed Julian Macoy, the only active among the remnants of the previous USC champion squad. \nThen coached by the late Juan 'Dodong' Aquino Jr., Macoy was part of USC's Green and Gold Warriors that reigned supreme in the Cebu Collegiate Athletic Association (the precursor of the CESAFI)during its 1958-59 season. \nSkippered by Danilo 'Danny' Deen with Reynaldo de la Cruz as co-captain, the other members of the team were Manuel Bas, Agapito Rogado, Esmeraldo Abejo, Roberto Reynes, Gerald del Rosario, Cesar Manalili, Edgardo Galdo, Boy Canda, Nilo Verano, Ernesto Michael, and Dionisio Jakosalem.   \n\"Coach Macoy is really a symbol of inspiration for this team,\" said Reroma, who had no time to celebrate their glorious moment as he heads to the airport right away to catch a flight to the United States to attend the wedding of his sister. \n\"It's a sweet victory for us, but we have to give credit to those who laid out the foundation of what is now a very strong USC basketball program. I'm just blessed that I came here at the right time and at the right place. We offer this championship to the whole Carolinian community,\" added Reroma. \nThe Warriors actually had a tentative start, allowing the Lancers to take a 12-point edge, 22-10, with still 8:32 left to play in the seconfd quarter. They pulled within just two points, 28-30, but UV countered with a 10-0 blitz to match their biggest lead at 40-28 at the 7:19 mark of the third period. \nThe Lancers were on top for the last time at 46-40 as they wilted under the spirited fightback and renewed challenge by the Warriors. \nLiterally mowing down UV's defenders, Olago dropped 18 points in the final half, including 15 in a lightning 24-6 attack that handed the Warriors a 52-46 lead midway in the final canto. \nAfter Steve Cerdick Akomo ended the Lancers' scoring spell, Charles Pepito scored on a four-point swing, then Ian Tagapan dropped a 3-point bomb to give USC its first double-digit advantage, 59-49. \nAdding further blow to the already down Lancers was the ejection of their star playmaker June Kent Manzo for a punching foul that sent Olago flat on the floor with only 1:26 left to play. Ian Ortega calmly sank two free throws as the Warriors enjoyed their biggest lead at 61-49. \nOlago hit the insurance free throws in the closing seconds of the contest as the Warriors and their legion of fans burst into frenzied celebration, savoring every moment of their historic triumph and epic conquest of the 10-time champion Lancers. \nFor his consistent showing all throughout the season, Olago was honored as the MVP. He was joined into the Mythical Five by his teammate Charles Pepito, Leonard Santillan of UV, Ralph Dinolan of the University of San Jose-Recoletos and Mark Jayven Tallo of Southwestern University. \n\"It's the great team spirit and family-like bonding we have that lead us to where we are at right now. We love each other, we care for other other. We work as oene. We never quit in times of troubles and we proved that we are the indeed the true Warriors,\" said Reroma. (FREEMAN)  ", "external_links": [], "published": "2015-10-20T19:00:00.000+03:00", "crawled": "2015-10-20T20:55:45.037+03:00", "highlightTitle": ""}