{"organizations": [], "uuid": "f8c1795ec7a7f475e0f42d908bdf01822c955911", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leesvilledailyleader.com", "main_image": "http://www.leesvilledailyleader.com/storyimage/LA/20151018/NEWS/151019790/AR/0/AR-151019790.jpg", "site_section": "http://www.leesvilledailyleader.com/sports?template=rss&mime=xml", "section_title": "Sports - Leesville Daily Leader - Leesville, LA", "url": "http://www.leesvilledailyleader.com/article/20151018/NEWS/151019790/2000/NEWS?rssfeed=true", "country": "US", "title": "Lady Eagles, Indians victorious at Hornet Hustle", "performance_score": 0, "site": "leesvilledailyleader.com", "participants_count": 1, "title_full": "Lady Eagles, Indians victorious at Hornet Hustle", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "f8c1795ec7a7f475e0f42d908bdf01822c955911"}, "author": "Daniel Green", "url": "http://www.leesvilledailyleader.com/article/20151018/NEWS/151019790/2000/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "Lady Eagles, Indians victorious at Hornet Hustle", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Lady Eagles, Indians victorious at Hornet Hustle HODGES GARDENS — The annual Hornbeck Hornet Hustle cross country meet took place on Wednesday, Oct. 14, with the Rosepine Lady Eagles and Anacoco Indians claiming top honors in the team division. Comment Follow @@LDLDanielGreen Posted Oct. 18, 2015 at 7:00 PM HODGES GARDENS — The annual Hornbeck Hornet Hustle cross country meet took place on Wednesday, Oct. 14, with the Rosepine Lady Eagles and Anacoco Indians claiming top honors in the team division. The Lady Eagles, sparked by the 1-2 finish of Cheyenne Vander and Trinity Walker, finished the meet with a total of 44 points, edging out Simpson and Anacoco, who were second and third with 56 and 64 points, respectively. Hornbeck was fourth overall in the girls’ division with 113 points, while Converse and Negreet rounded out the team scoring with 124 and 126 points. Vander was the easy winner of the girls’ 5K as she finished with an impressive time of 21:48, while Walker came in with a time of 22:56. Anacoco’s Sydney Staples, the recent winner of the Simpson Stampede, edged out Simpson senior Haleigh Lachney for third place. Staples came in with a time of 23:11, while Lachney crossed the finish line in 23:13. Maycee Lachney claimed fifth place with a time of 23:49, while Hornbeck’s Madison Smith was sixth at 24:03. Anacoco’s Gabriella Rangel was seventh at 24:10, while sixth-grader Hannah Dahlhoff of Hornbeck was eighth at 24:16. Negreet’s Nyke Wolfe took ninth place in the event with a mark of 24:17, while Simpson’s Lakin Ogilvie rounded out the top 10 with a time of 24:24. The Indians dominated the boys’ division, placing all five of its scoring runners in the top eight, scoring a total of 25 points. Negreet was second overall in the meet with 85 points, while Simpson, Hornbeck and Rosepine rounded out the team standings with 90, 105 and 119 points, respectively. Anacoco’s Austin Millisor continued his success with another stellar performance, traversing the course in a time of 17:40, while Simpson sophomore Tanner Yates was second in the meet with a time of 18:20. Anacoco junior Brent Cosio took third with a time of 19:19, just edging out Converse’s Trent Malmay, who was a second behind in fourth. Rosepine’s Brian Buono was fifth with a time of 19:54, while the Anacoco trio of Race Johnson, Landon Lee and Mason Roberts finished sixth, seventh and eighth. Johnson recorded a time of 20:15, while Lee and Roberts weren’t far behind with marks of 20:21 and 20:23, respectively. Simpson junior Austin Williams and Negreet’s Dillion Masters rounded out the top 10 finishers with times of 20:38 and 20:43, respectively. Rosepine will host a cross country meet on Wednesday, Oct. 21.", "external_links": [], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-19T11:08:29.737+03:00", "highlightTitle": ""}