{"organizations": ["Cheung Hornets"], "uuid": "cd059972cc343e027ded3fa4d4577a28295ff61d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.brownsvilleherald.com", "main_image": "http://bloximages.newyork1.vip.townnews.com/brownsvilleherald.com/content/tncms/assets/v3/editorial/9/9f/99f12c6d-0ea4-537f-a9af-ad2dde4222ec/561a251811cd3.image.jpg", "site_section": "http://www.brownsvilleherald.com/search/?q=&t=article&l=25&d=&d1=&d2=&s=start_time&sd=desc&c[]=sports*&f=rss", "section_title": "Brownsville Herald - sports", "url": "http://www.brownsvilleherald.com/sports/basketball/article_01a2d099-687f-5073-b99d-5d6e54851248.html", "country": "US", "title": "Hornets top Paul-less Clippers 106-94 in China game", "performance_score": 0, "site": "brownsvilleherald.com", "participants_count": 0, "title_full": "Hornets top Paul-less Clippers 106-94 in China game", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T17:26:00.000+03:00", "replies_count": 0, "uuid": "cd059972cc343e027ded3fa4d4577a28295ff61d"}, "author": "", "url": "http://www.brownsvilleherald.com/sports/basketball/article_01a2d099-687f-5073-b99d-5d6e54851248.html", "ord_in_thread": 0, "title": "Hornets top Paul-less Clippers 106-94 in China game", "locations": ["China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kin Cheung Hornets top Paul-less Clippers 106-94 in China game \nThe Charlotte Hornets guard Jeremy Lin drives past Los Angeles Clippers guard CJ Wilcox during the fourth quarter of the 2015 NBA Global Games in Shenzhen, south China's Guangdong province, Sunday, Oct. 11, 2015. (AP Photo/Kin Cheung) Kin Cheung Hornets top Paul-less Clippers 106-94 in China game \nThe Charlotte Hornets coach Steve Clifford watches plays during a game against the Los Angeles Clippers in the 2015 NBA Global Games in Shenzhen, south China's Guangdong province, Sunday, Oct. 11, 2015. (AP Photo/Kin Cheung) Kin Cheung Hornets top Paul-less Clippers 106-94 in China game \nThe Charlotte Hornets guard Jeremy Lin manages a bloodied nose against the Los Angeles Clippers during the fourth quarter of the 2015 NBA Global Games in Shenzhen, south China's Guangdong province, Sunday, Oct. 11, 2015. (AP Photo/Kin Cheung) Kin Cheung Hornets top Paul-less Clippers 106-94 in China game \nLos Angeles Clippers forward Blake Griffin shoots past the Charlotte Hornets center Frank Kaminsky during the second half of the 2015 NBA Global Games in Shenzhen, south China's Guangdong province, Sunday, Oct. 11, 2015. (AP Photo/Kin Cheung) Posted: Sunday, October 11, 2015 9:26 am | Updated: 12:00 pm, Sun Oct 11, 2015. Hornets top Paul-less Clippers 106-94 in China game Associated Press | \nSHENZHEN, China (AP) — Cody Zeller and Jeremy Lin each scored 16 points to lead seven Charlotte players in double digits as the Hornets topped the Los Angeles Clippers 106-94 on Sunday in the first of two preseason NBA games between the teams in China. \nThe Clippers were without point guard Chris Paul, who fractured his left index finger in practice on Saturday. \nKemba Walker added 13 points and Brian Roberts and Jeremy Lamb each had 12 for Charlotte, which improved its preseason record to 3-0 with owner Michael Jordan courtside in Shenzhen. The southern Chinese city was hosting its first NBA game. \nHORNETS: Zeller was 6 for 6 from the floor and added 10 rebounds ... Former Clipper Spencer Hawes also had a double-double with 10 points and 13 rebounds ... Al Jefferson struggled, missing seven of 11 shots and finishing with eight points. \nCLIPPERS: J.J. Redick had a team-high 23 points, shooting 4-for-9 from 3-point range ... Starting in place of injured Paul, Pablo Prigioni had five points and seven assists in 30 minutes. \nSTAR WATCH: The Clippers' Blake Griffin had 13 points and 10 assists, while teammate DeAndre Jordan was limited to four points and eight rebounds in 30 minutes. \nDID NOT PLAY: Paul's injury was not considered serious and he was to be re-evaluated before Wednesday's rematch in Shanghai. The Clippers also lost Austin Rivers to a mouth injury that he suffered in practice Friday. \nUP NEXT: Los Angeles and Charlotte play a second game in China at Shanghai's Mercedes-Benz Arena on Wednesday.", "external_links": [], "published": "2015-10-11T17:26:00.000+03:00", "crawled": "2015-10-12T01:59:48.330+03:00", "highlightTitle": ""}