{"organizations": [], "uuid": "0b3ae8736a64566fef350dc56bb286492ecbdf38", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jsonline.com", "main_image": "http://media.jrn.com/images/56e74da7-1bd8-424a-be3a-68dc0df0c4fd.jpg", "site_section": "http://www.jsonline.com/rss?c=y&path=%2Fsports%2Fnational&atom=y", "section_title": "JSOnline.com Sports - National Top Stpries", "url": "http://www.jsonline.com/business/national/coca-cola-calls-on-blatter-to-resign-now-mjsurnpublicidaporgfec7fda5e3d04b6d9ad263fc0bccd06d.html", "country": "US", "title": "Coca-Cola calls on Blatter to resign now", "performance_score": 0, "site": "jsonline.com", "participants_count": 1, "title_full": "Coca-Cola calls on Blatter to resign now", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T15:52:00.000+03:00", "replies_count": 0, "uuid": "0b3ae8736a64566fef350dc56bb286492ecbdf38"}, "author": "Rob Harris,", "url": "http://www.jsonline.com/business/national/coca-cola-calls-on-blatter-to-resign-now-mjsurnpublicidaporgfec7fda5e3d04b6d9ad263fc0bccd06d.html", "ord_in_thread": 0, "title": "Coca-Cola calls on Blatter to resign now", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ZURICH (AP) - Coca-Cola became the first FIFA sponsor on Friday to call on Sepp Blatter to immediately stand down as president of world soccer's governing body.\nThe intervention from the soft drinks giant comes a week after Blatter was placed under criminal investigation by Swiss authorities for alleged financial wrongdoing at FIFA, which he has led since 1998.\nThe 79-year-old Swiss told FIFA staff earlier this week he's determined to remain in power until February's emergency presidential election, but pressure from sponsors who fund the organization could force him out before then.\n\"For the benefit of the game, The Coca-Cola Company is calling for FIFA President Joseph Blatter to step down immediately so that a credible and sustainable reform process can begin in earnest,\" Coca-Cola said in a statement. \"Every day that passes, the image and reputation of FIFA continues to tarnish. FIFA needs comprehensive and urgent reform, and that can only be accomplished through a truly independent approach.\"\nBlatter's own position has been weakened as lawyers oversee key decisions at scandal-battered FIFA and he waits to hear whether he will be suspended by the ethics committee.\nBlatter did address a leadership issue earlier Friday in FIFA's in-house magazine - but not his own.\nBlatter complained that quotas must be implemented to stop men dominating positions of power in football.\n\"Football continues to be dominated by men,\" Blatter wrote in FIFA Weekly. \"It is our duty to change this. Women must feel that they have an equal chance of succeeding in football as their male counterparts.\n\"FIFA, the confederations and our member associations have to break the cycle that makes it so much easier for men to ascend to positions of responsibility. This is not just a moral duty.\"\nBlatter said there is \"compelling evidence that gender-balanced organizations make better decisions and produce better results.\"\nThere are currently no female contenders in the race to succeed Blatter in the Feb. 26 election.\n ", "external_links": ["http://analytics.apnewsregistry.com/analytics/v2/image.svc/AP/RWS/jsonline.com/MAI/330442891/E/prod/PC/Basic/AT/A"], "published": "2015-10-02T15:52:00.000+03:00", "crawled": "2015-10-03T12:30:05.827+03:00", "highlightTitle": ""}