{"organizations": [], "uuid": "2fee362dc25821f02a4c8030428277c2948c12f3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "accesswdun.com", "main_image": "http://images.accesswdun.com/uploads/articles/2015/343564/emily-house_p3.jpg", "site_section": "http://accesswdun.com/rss/3/rss.xml", "section_title": "AccessWDUN.com Sports", "url": "http://accesswdun.com/article/2015/10/343564/area-competitor-house-finishes-in-top-10-at-usa-powerlifting-championships", "country": "US", "title": "Area competitor House finishes in top 10 at USA Powerlifting Championships", "performance_score": 0, "site": "accesswdun.com", "participants_count": 1, "title_full": "Area competitor House finishes in top 10 at USA Powerlifting Championships", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T00:57:00.000+03:00", "replies_count": 0, "uuid": "2fee362dc25821f02a4c8030428277c2948c12f3"}, "author": "AccessWDUN Staff", "url": "http://accesswdun.com/article/2015/10/343564/area-competitor-house-finishes-in-top-10-at-usa-powerlifting-championships", "ord_in_thread": 0, "title": "Area competitor House finishes in top 10 at USA Powerlifting Championships", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By AccessWDUN Staff Related Articles Moon shines again at meet in Tennessee Team USA dominates GPA World Championships in Athens Moon rides roller-coaster weekend at Vegas meets Area lifters shine at Georgia Games meet in Gainesville \nEmily Vinson House may only be a rookie in the sport of powerlifting but she is a veteran when it comes to high level competition. House spent several years competing for Team USA in the sport of Sprint Canoe/Kayak where she competed in numerous world cups, world championships, Pan American Championships, Pan American Games, Olympic Team Trials, and National Championships. She amassed hundreds of medals including countless national championship titles during her time as a kayaker. \nFor now, Emily has put her paddle down and has picked up some barbells. Two months ago, House qualified for the USA Powerlifting National Championships to be held in Scranton, Pa., in the 72-kilogram (roughly 158 pounds) weight class, bench pressing 210 pounds, squatting 275 pounds and deadlifting 291 pounds for a total of 876 pounds. \nFast forward to the main event this weekend in Scranton where House tested herself against the rest of the country at the USA Powerlifting National Championships with a goal in mind of placing in the top 10 in the United States. \nThis National Championships was not only the largest nationals ever held, but it was possibly the largest powerlifting meet ever held with over 1,100 athletes vying for the national championship title. There were over 50 competitors in House’s weight class of 72kg, including the current world champion Kimberly Walford. House was not distracted, however, and stuck to her plan formulated by her coach, Chris Aydien. House’s overall stats were as follows: Bench press 220 pounds, squat 291 pounds, deadlift, 414 pounds for a total of 925 pounds -- which is 49 pounds heavier than her lifts of eight weeks ago. House placed sixth overall in her weight class, which more than surpassed her goal of being top 10 in the nation. \nHouse is still deciding when her next competition will be but for now it is back to training and getting stronger. Associated Tags : Weightlifting, Emily House © Copyright 2015 AccessWDUN.com", "external_links": [], "published": "2015-10-20T00:57:00.000+03:00", "crawled": "2015-10-21T00:56:37.858+03:00", "highlightTitle": ""}