{"organizations": [], "uuid": "2762494efbdded677dccb16f9f130eda2b1c4966", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtontimes.com", "main_image": "http://media.washtimes.com.s3.amazonaws.com/media/image/2015/10/23/4da66c0ed58b232e850f6a706700072d.jpg", "site_section": "http://www.washingtontimes.com/rss/headlines/sports/", "section_title": "www.washingtontimes.com stories: Sports", "url": "http://www.washingtontimes.com/news/2015/oct/23/no-5-lsu-welcomes-test-from-prolific-wku/", "country": "US", "title": "No. 5 LSU welcomes test from prolific WKU", "performance_score": 0, "site": "washingtontimes.com", "participants_count": 1, "title_full": "No. 5 LSU welcomes test from prolific WKU", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T20:02:00.000+03:00", "replies_count": 0, "uuid": "2762494efbdded677dccb16f9f130eda2b1c4966"}, "author": "BRETT MARTEL", "url": "http://www.washingtontimes.com/news/2015/oct/23/no-5-lsu-welcomes-test-from-prolific-wku/", "ord_in_thread": 0, "title": "No. 5 LSU welcomes test from prolific WKU", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sports No. 5 LSU welcomes test from prolific WKU LSU head coach Les Miles sings the school alma mater with the team after their NCAA college football game victory over Florida in Baton Rouge, La., Saturday, Oct. 17, 2015. LSU won 35-28. (AP Photo/Gerald Herbert) more > By BRETT MARTEL   \nBATON ROUGE, La. (AP) - Even if No.5 LSU isn’t technically hosting a nationally ranked opponent this weekend, coach Les Miles asserts that the Tigers might as well approach it that way. \nMiles said this week that he counts Western Kentucky (6-1), which has piled up 535.4 yards of offense and 44 points per game this season, among the best 25 teams in the nation. \nFor now, the Hilltoppers are receiving votes in the AP Top 25 poll, but haven’t quite cracked the rankings yet. That would change, more than likely, with a victory over unbeaten LSU (6-0) at Tiger Stadium on Saturday night. \n“I just want you to know that this team coming in fits every bit as well in Tiger Stadium as other teams that we’ve hosted this year,” Miles said, essentially placing the Hilltoppers in the same class as Auburn, South Carolina and No. 13 Florida. “This will be a very good opponent. We’ll have to play well to do the things that we want to do. And nationally ranked this team will be.” \nMiles only hopes the Hilltoppers enter the rankings a few weeks after playing in Death Valley. Odds makers don’t seem all that moved by Miles’ praise of his upcoming opponent. They’ve listed the Tigers as slightly more than two-touchdown favorites. Perhaps they’re simply using history as their guide; LSU hasn’t lost a non-conference home game since 2000. The Tigers’ streak of victories over non-SEC foes in Tiger Stadium has reached 44 games. \nOr maybe they simply can’t see a mid-major program stopping LSU running back Leonard Fournette, whose 200 yards rushing per game and 14 touchdowns has made him a favorite to win the Heisman Trophy. \nSo far, WKU’s only loss came on the road, by a field goal, against Indiana of the Big Ten. The Hilltoppers have already defeated a Southeastern Conference team, albeit struggling Vanderbilt. \nUpsetting LSU in Death Valley would be a program-defining triumph for WKU, now in only its seventh season at the NCAA’s top-tier Football Bowl Subdivision, but coach Jeff Brohm is just trying to keep his players loose. \n“It’s just a great opportunity for our guys to go out and have fun this week, cut it loose come game day and just really see how we measure up,” said Brohm, a former quarterback at Louisville and in the NFL. “I know our guys are excited. Any time you get a chance to play a team this good, on their home turf, for us, it’s just a great opportunity to go out there and compete and have fun.” \n___ \nSome key story lines surrounding the Western Kentucky-LSU matchup: \nPOWER RUNNING: Fournette didn’t manage a scoring run of at least 40n yards last week for the first time in five games, but still finished with 180 yards and two TDs against a Florida defense that had been allowing fewer than 100 yards rushing per game. He leads an LSU ground game averaging 325.5 yards. “We have been decent against running teams. Now, this is a different breed,” Brohm said, referring to Fournette. “This guy is going to be hard to tackle. So, we’re going to have to find different ways to tackle him.” \nCONTRASTING STYLES: While LSU has won with a run-based offense that averages only 135.3 yards passing, WKU QB Brad Doughty airs it out. This season, Doughty is 197 for 266 passing for 2,709 yards and 24 TDs against four interceptions. Doughty, who has completed nearly twice as many passes as LSU’s Brandon Harris has attempted, averages 387 yards passing. As a team, WKU averages 407 yards passing. \nPASS RUSH: Just one season ago, LSU recorded 19 sacks in 13 games. Through six games this season, the Tigers have 17 sacks. Defensive end Lewis Neal, who has a team-leading seven sacks, puts LSU’s team goal at “30-plus” this season. “We got plenty more of the season left. That’s all I’ve got to say,” Neal said. \nTOP TARGETS: Doughty’s favorite receiver so far has been Taywan Taylor. He has 45 catches for 825 yards and 10 TDs. Second in receptions for is Jared Dangerfield with 42 catches for 460 yards and five TDs.", "external_links": [], "published": "2015-10-23T20:02:00.000+03:00", "crawled": "2015-10-23T21:15:49.011+03:00", "highlightTitle": ""}