{"organizations": ["NHL", "JChicago Blackhawks"], "uuid": "7857648ce5c4e16b503f2ee927e4a892f9b8c5e6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "http://s2.reutersmedia.net/resources/r/?m=02&d=20151005&t=2&i=1084709829&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB940WI", "site_section": "http://feeds.reuters.com/reuters/sportsNews", "section_title": "Reuters: Sports News", "url": "http://www.reuters.com/article/2015/10/05/us-nhl-preview-idUSKCN0RZ1ZF20151005?feedType=RSS&feedName=sportsNews", "country": "US", "title": "Busy offseason sets up intriguing new NHL campaign", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "Busy offseason sets up intriguing new NHL campaign", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T20:13:00.000+03:00", "replies_count": 0, "uuid": "7857648ce5c4e16b503f2ee927e4a892f9b8c5e6"}, "author": "", "url": "http://www.reuters.com/article/2015/10/05/us-nhl-preview-idUSKCN0RZ1ZF20151005?feedType=RSS&feedName=sportsNews", "ord_in_thread": 0, "title": "Busy offseason sets up intriguing new NHL campaign", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tim Wharnsby", "Kimmo Timonen", "Matt Marton-USA"], "text": "Busy offseason sets up intriguing new NHL campaign By Tim Wharnsby JChicago Blackhawks defenseman Kimmo Timonen (44) holds the Stanley Cup up during the 2015 Stanley Cup championship rally at Soldier Field. Mandatory Credit: Matt Marton-USA TODAY Sports - RTX1H5DV \nFrom rookie phenom Connor McDavid to old coaches in new places to a fresh overtime format and another Chicago Blackhawks title defense, the upcoming 2015-16 NHL season is full to the brim with intrigue. \nMcDavid is considered the best prospect to reach the NHL since Sidney Crosby a decade ago and the 18-year-old Canadian carries the burden of gargantuan expectations while playing on an Edmonton Oilers team that, at nine seasons, owns the league's longest playoff drought. \nEdmonton, with former San Jose Sharks coach Todd McLellan now behind the bench, are one of seven teams who changed coaches in the offseason. The most high profile move saw Mike Babcock join the rebuilding Toronto Maple Leafs after 10 seasons with the Detroit Red Wings. \nBabcock, who signed a mammoth eight-year contract worth $50 million, was replaced by Jeff Blashill, who will try to steer Detroit into the playoffs for the 25th consecutive season, the longest current streak in the NHL. \nIt will be up to all 30 head coaches to figure out tactics for a new overtime wrinkle that will see three-on-three play replace four-on-four action as part of the NHL's bid to create more scoring and reduce the number of games decided by shootout. \nChicago certainly have the skill to succeed in overtime, but with their third bid in six years to win back-to-back Stanley Cups the defending champs once again will have to overcome the loss of key players as well as the Patrick Kane situation. \nThe Chicago standout showed up for training camp the target of a sexual assault investigation in connection with an incident that allegedly occurred in his home in early August. \nKane, 26, has not been charged and denies any wrongdoing. The NHL has not taken any action against the Blackhawks forward and the case took a bizarre turn last month when the accuser's lawyer abruptly quit. \n\"We're going to have to watch the process play out and at the appropriate time we'll make whatever decisions have to be made at the time,\" said NHL Commissioner Gary Bettman. \nThere hasn't been a repeat champion in the 10-year salary cap era of the NHL and you have to go back to the 1997-98 Red Wings to find the last successful title defense. \nIn order to keep the core of captain Jonathan Toews, Kane, Marian Hossa, Duncan Keith and Brent Seabrook under contract, Chicago traded a pair of key forwards and lost three veterans to free agency. \n\"This year we definitely lost three or four key pieces to our team that were part of it and had meaningful contributions,\" said Chicago coach Joel Quenneville. \"That key group is in place. These guys have an amazing appetite for winning and that's what we look forward to.\" \nChicago and the Los Angeles Kings have won five of the last six Stanley Cup championships, starting with the Blackhawks in 2010. Since the Boston Bruins won in 2011, the Kings (2012, 2014) and Blackhawks (2013, 2015) have alternated as champions. \nLast season, the Kings became the first defending champion to miss the playoffs since the 2006-07 Carolina Hurricanes. But a long offseason after playing 64 postseason games in the prior three campaigns (the most in the NHL in that span) has the Kings refreshed and excited about taking another title run with newcomers Milan Lucic and Christian Ehrhoff. \n(Reporting by Tim Wharnsby in Toronto; Editing by Frank Pingue) Trending On Reuters", "external_links": [], "published": "2015-10-05T20:13:00.000+03:00", "crawled": "2015-10-05T20:39:33.952+03:00", "highlightTitle": ""}