{"organizations": [], "uuid": "72748ccfc88e30dda00e3ffe98d60a0f601e8e85", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kctv5.com", "main_image": "http://kctv.images.worldnow.com/images/469883_G.JPG", "site_section": "http://kctv5.com/category/208603/sports?clienttype=rss", "section_title": "KCTV Kansas City - Sports", "url": "http://www.kctv5.com/story/30217769/lock-mizzou-looking-to-keep-it-going-against-gators", "country": "US", "title": "Lock, Mizzou looking to keep it going against Gators", "performance_score": 0, "site": "kctv5.com", "participants_count": 1, "title_full": "Lock, Mizzou looking to keep it going against Gators - KCTV5", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T16:02:00.000+03:00", "replies_count": 0, "uuid": "72748ccfc88e30dda00e3ffe98d60a0f601e8e85"}, "author": "Posted by Chris Oberholtz, Multimedia Producer", "url": "http://www.kctv5.com/story/30217769/lock-mizzou-looking-to-keep-it-going-against-gators", "ord_in_thread": 0, "title": "Lock, Mizzou looking to keep it going against Gators", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "COLUMBIA, MO (FOOTBALLKC) - Mizzou’s 104th homecoming will see the Tigers face the No. 11 Florida Gators Saturday.\nWith redshirt junior Maty Mauk suspended indefinitely, true freshman Drew Lock will get his second straight start at quarterback and perhaps an opportunity to take the reins for the rest of the 2015 season.\nLock performed well in his first start of the season a week ago, as Mizzou defeated the South Carolina Gamecocks 24-10, managing a team led on defense. Lock became the first true freshman quarterback to start for Pinkel and took some positive steps in his first career start.\n“Drew really did some good things for a young player. We were a little conservative (with play calling) in the second half,” Pinkel said. “With some of the field position we had and trying to get our running game going – but I thought he really carried himself well.”\nPinkel wasn’t the only one with positive things to say about Lock’s performance against a typically stout South Carolina team.\n“He handles the pressure amazingly well. He wasn’t rattled or anything like that,” said sophomore Nate Brown. “Having to start, he took it and ran with it. Hats off to him and hats off to his play today, and just the type of person he is.”\nBrown caught both of Lock’s touchdown passes in the game and looks to have an early rapport with the quarterback.\nFor the first time all season the Tigers’ offense seemed to click, which it will need to do again if Missouri has any hopes of upsetting the Gators.\nDefensively, the Tigers will have their hands full with freshman quarterback Will Grier, who, like Lock, competed in Trent Dilfer’s Elite 11 Competition.\nGrier threw for four first-half touchdown passes against the then third-ranked Ole Miss Rebels, vaulting the Gators to a 38-10 upset victory and setting the table for Florida to compete atop the SEC East. Grier has lead the high flying attack for the Gators that averages just over 34 points per game.\nIf there’s a defense in the SEC to stop the early success of Grier and the Gators it’s the one in Columbia. Redshirt freshman Walter Brady had a coming out party last week against the Gamecocks, recording two sacks and an interception opposite defensive star Charles Harris. The Missouri defensive line has arguably won the battle in the trenches in every game this year and linebacker Kentrell Brothers is one of the nation’s leaders in tackles through five weeks.\nIf there’s been a weak spot defensively, it’s been the play of the defensive backs, who, despite solid numbers, have dropped a few early interception opportunities and have allowed a couple of long pass plays.\nIf Mizzou is to triumph against Florida they will need all three defensive groups to play well and stop a Gators team that has begun SEC play strong, defeating Kentucky and Tennessee along with their victory over the Rebels.  \nMissouri, meanwhile, is looking to push above .500 in conference play after losing a close game to Kentucky before defeating South Carolina.\nIf Mizzou is successful in defending their turf on homecoming, the program could still have a shot at their third consecutive SEC East title. If not, the Gators and Georgia Bulldogs will most likely play for the crown that Mizzou has become comfortable with since its second season in the SEC.\nCopyright 2015 KCTV (Meredith Corp.) All rights reserved.", "external_links": [], "published": "2015-10-08T16:02:00.000+03:00", "crawled": "2015-10-09T01:40:49.818+03:00", "highlightTitle": ""}