{"organizations": [], "uuid": "65457ebea74ba27b11f5cddc8ba4cdc627897538", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reporterherald.com", "main_image": "http://extras.mnginteractive.com/live/media/site36/2015/1009/20151009__broncos-vikings~p1.jpg", "site_section": "http://feeds.reporterherald.com/mngi/rss/CustomRssServlet/47/244125.xml", "section_title": "Pro Sports", "url": "http://www.reporterherald.com/sports/ci_29015198/kiz-troy-debate?source=rss", "country": "IL", "title": "How do the Broncos stack up against other unbeaten teams in the NFL?", "performance_score": 0, "site": "reporterherald.com", "participants_count": 1, "title_full": "How do the Broncos stack up against other unbeaten teams in the NFL?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T03:55:00.000+03:00", "replies_count": 0, "uuid": "65457ebea74ba27b11f5cddc8ba4cdc627897538"}, "author": "Troy E. Renck and Mark Kiszla", "url": "http://www.reporterherald.com/sports/ci_29015198/kiz-troy-debate?source=rss", "ord_in_thread": 0, "title": "How do the Broncos stack up against other unbeaten teams in the NFL?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Renck: Broncos need to give Peyton Manning more weapons For Peyton Manning to rebound, he needs more help around him The Denver Post Posted: 10/23/2015 03:55:48 PM MDT Mario Edwards Jr. (97) of the Oakland Raiders gets to Denver Broncos quarterback Peyton Manning (18) for a sack in the fourth quarter at O.Co Coliseum in Oakland, Calif., on Oct. 11, 2015. ( Joe Amon, The Denver Post ) \nSpring optimism gives way to winter chill. The Broncos began their offensive experiment in April, believing in play-action passes, bootlegs, passing efficiency and a strong running game. \nNone of this has transpired, creating the jarring juxtaposition. The Broncos own a 6-0 record with the NFL's most opportunistic, relentless defense — leading in sacks, takeways and touchdowns — and a clumsy offense. \nPeyton Manning leads the NFL in interceptions with 10. He has thrown a pick in every game and will set a personal worst if he throws an interception in the season's first seven games. He has been part of the problem why the offense ranks 29th in yards per game and 27th in yards passing. \nOpponents continue to defend Manning differently than in past years. He is getting blitzed more, and linebackers are dropping into coverage more frequently on underneath routes. Combine tighter windows with Manning admittedly trying to do too much and the results have been shocking, yet understandable. \nThe Broncos leave their bye week a bit nostalgic, believing their offense can rebound. British author George Eliot once said, \"It is never too late to be what you might have been.\" \nAt 39, Manning can't be \"the man\" anymore. He needs a better supporting cast — and if not — his current cast to play better around him. In his first three years in Denver Manning carried the freight, camouflaging team weaknesses with his greatness. He can still be great in moments, but not for entire games, at least not without assistance. Advertisement \nThe Broncos' inability to run the ball has sabotaged the offensive's evolution. That's why the 152 yards on the ground in Cleveland last week represent hope. For starters, the Broncos need their starters on the practice field together. When they return from the bye, it's imperative that guards Louis Vasquez (knee) and Evan Mathis (hamstring) and left tackle Ty Sambrailo (shoulder) find a rhythm. If the Broncos don't establish a consistent ground attack — they rank 30th in yards rushing — they will be hard-pressed to beat the Packers, Patriots, Steelers and Bengals. \nManning's slump also raises the question: Does he have the best group at his disposal? One thing has dramatically changed over the last two seasons: Manning no longer possesses one of the league's best red-zone targets. In 2013, Wes Welker ranked second in the NFL with 18 red-zone receptions and third with nine touchdowns. Last season, Julius Thomas sat second with nine red- zone scores. \nThe Broncos have received minimal production from their tight ends. Owen Daniels and Virgil Green boast 17 catches in 34 targets for 113 yards and two touchdowns. At this juncture last season, Thomas was targeted 36 times for 28 receptions, 304 yards and nine touchdowns. \nOf course, it's a different offense. But Daniels has always excelled in this offense — until now. He is averaging only 6.1 yards per catch, 4 yards fewer than his career low. The bye week allowed time for his right shoulder to heal. He needs to create separation in one-on-one routes against linebackers. If Daniels and Green don't get it going, the Broncos will be hard-pressed not to inquire about San Francisco's Vernon Davis, St. Louis' Jared Cook and Chicago's Martellus Bennett. \nLast season, when Welker evaporated, Thomas filled the void until his ankle injury. Jordan Norwood now owns the slot job. Manning trusts him, but it hasn't translated. Norwood has just 80 yards on 11 catches and hasn't been targeted more than three times since the Week 2 win at Kansas City. \nManning remains under the microscope. But any revival of the offense must go beyond him. The Broncos need a healthy offensive line, more production from their tight ends, fewer drops from Demaryius Thomas and a run game capable of keeping defenses off balance. \nTroy E. Renck: trenck@denverpost.com or @troyrenck \nSpotlight on ... \nChuck Pagano , coach, Indianapolis Colts \nWhen: Last Sunday the Colts attempted one of the dumbest plays in NFL history, given the place on the field and the opponent (New England). \nWhat's up: The Colts tried a fake punt at their 37-yard line. It featured nine players lined up right. It was an illegal formation. So not a great start. Safety Colt Anderson stood over receiver Griff Whalen, playing the role of center in this tragedy. With three defenders in his face, Anderson snapped the ball to Whalen, who ducked his head as an avalanche of defenders pounced on him. \nBackground: Pagano's relationship with GM Ryan Grigson is strained. For Colts owner Jim Irsay, this game offered a referendum on Pagano, if not Grigson. Pagano coached aggressively. But when this play went horribly wrong, he let media carnivores devour Whalen. \nRenck's take: The play represented an unnecessary risk, screaming the Colts needed gadgets to win. Worse, the usual snapper on the play, rookie Clayton Geathers, was injured earlier in the game. That alone was reason to scrap the plan. Instead, Whalen goes in and doesn't know the nuance of the play — such as taking a delay of game penalty if necessary. Veteran punter Pat McAfee provided the back story on Whalen, protecting his teammate. Pagano blamed himself but left out the part about Wha- len's backup role. Pagano is a good man. He made an awful decision then compounded it by saying he had no regrets. Trying to outsmart the NFL's smartest coach was just dumb. It's OK to admit it. \nTHREE UP \n1. Patriots: The top scoring offense meets the top scoring defense. The Jets usually play the Patriots tough. But Tom Brady has beaten the Jets seven consecutive times in New England. \n2. Bengals: Booed at the MLB All-Star Game, quarterback Andy Dalton boasts new fans with his remarkable rebound. He has thrown 14 touchdown passes and grown into the team leader. \n3. Broncos: Nasty Orange Rush defense camouflages offensive shortcomings. Defense leads NFL in sacks, takeaways and touchdowns. \nTHREE DOWN \n1. 49ers: Run Jim Harbaugh out of town. Lose your best players to retirement. Hire position coach to take over. Yeah, that will work. \n2. Jaquars: Promise to play one game per season in London through 2020. The British gave us the Beatles. We give them the Jaguars? \n3. Titans: Their season-opening rout of the Buccaneers seems like a long time ago. The Titans own four-game losing streak, including three straight at home, and rookie quarterback Marcus Mariota will miss the game because of a knee injury. \n\nGet sports news and updates right in your inbox \nSign up to receive news alerts and a daily roundup of all things Colorado sports delivered to your inbox.", "external_links": [], "published": "2015-10-24T03:55:00.000+03:00", "crawled": "2015-10-24T09:36:42.984+03:00", "highlightTitle": ""}