{"organizations": [], "uuid": "bd48b7d4d74ef0584550ec5503e9a829b42f118b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "highschoolsports.lehighvalleylive.com", "main_image": "http://hssn-media.advance.net/PennLive.com/news/8cf1cb04ae8b6f567e58bb1556ed5ccf/woody8.jpg", "site_section": "http://blog.lehighvalleylive.com/lehighvalleylive_high_school_sports_homepage_feed/atom.xml", "section_title": "lehighvalleylive.com High School Sports", "url": "http://highschoolsports.lehighvalleylive.com/news/article/-1461767855651414061/5-takeaways-from-notre-dames-football-win-at-palisades/", "country": "IL", "title": "5 takeaways from Notre Dame's football win at Palisades", "performance_score": 0, "site": "lehighvalleylive.com", "participants_count": 0, "title_full": "5 takeaways from Notre Dame's football win at Palisades", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T08:43:00.000+03:00", "replies_count": 0, "uuid": "bd48b7d4d74ef0584550ec5503e9a829b42f118b"}, "author": "", "url": "http://highschoolsports.lehighvalleylive.com/news/article/-1461767855651414061/5-takeaways-from-notre-dames-football-win-at-palisades/", "ord_in_thread": 0, "title": "5 takeaways from Notre Dame's football win at Palisades", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Complete Box Score » \nNotre Dame 47, Palisades 34 \nPirates show their pride. Palisades fans left Walter Rohrer Stadium disappointed with the loss but they should take enormous pride in their team’s passionate, intense effort. If, in the end, Notre Dame’s sheer athleticism carried the day (just), the Pirates made the 8-0 Crusaders earn every inch of that unbeaten status. \nWhat impressed the most from Palisades was the rich vein of emotion the team mined to take on Notre Dame. Even when behind in the fourth quarter, Palisades continued to \"bring it\" at very high levels. It’s almost unfair to single out individual players as every Pirate did close to their best, but senior wide receiver Blake Cassalia , sophomore running back Pat Lodwig, senior two-way lineman Matt Barnhart and, most passionate of them all, sophomore running back/defensive back Jared Colletti, played like, as Lafayette coach Frank Tavani likes to say, “warriors out there.” \nA shame only one team could win, because Palisades sure played like winners Friday night. \nDid Notre Dame miss Destyn Woody ? You bet. Woody, a senior linebacker, had to sit out the Palisades game because he was ejected in last week’s defeat of Pen Argyl. And his absence was noticed. “Every time they ran outside and got yards, Destyn would have been there,” Notre Dame coach Chuck Muller said. “And he’s a real emotional leader for us.” \nJulian Wismer standing tall. Notre Dame’s defense didn’t have a great night, but senior defensive end Julian Wismer sure did. The 6-foot, 225-pounder had two tackles for loss and in general caused havoc on his side. “Julian is a bear,” Muller said. “He’s one tough sucker. He’s really physical with people.” \nMuller credited another sport in which Wismer was a PIAA Class AA state qualifier as a junior with some of his football improvement. “I am sure some of that comes from wrestling,” Muller said. \nWhy Tre Jordan is Tre Jordan. Speaking of Lafayette, Notre Dame’s senior Leopards commit showed why he will impact the Patriot League at any position he plays on one huge play early in second half Friday night. Palisades had just crept within 27-21 with 6:45 to go in the third quarter and the Crusaders needed an answer. Jordan provided it. \nOn first down from his own 45, Jordan dropped back to pass, and the play was nothing. The receivers were covered, there didn’t seem to be any running lanes and the Pirates were gathering to shiver Jordan’s timbers. So he rolled right and took off, and 37 yards later Jordan was pushed out of bounds at the Palisades 18, having made a big play from absolutely nothing. Notre Dame scored on the next play and Palisades never got that close again. \nThat play is why Tre is Tre. \nDid the score flatter Notre Dame? It sure did. Consider that Palisades was at the Crusaders 5-yard line before Mitch Daniel’s 100-yard pick-six, and Notre Dame scored two other touchdowns on offensive fumble recoveries inside the Palisades 1. Give those recoveries to the Pirates, and give Palisades a touchdown instead of Daniel’s enormous play -- none of which is much of a stretch -- and Notre Dame would have been in serious trouble.", "external_links": [], "published": "2015-10-24T08:43:00.000+03:00", "crawled": "2015-10-25T03:21:00.066+02:00", "highlightTitle": ""}