{"organizations": ["NCAA", "AP", "UAB"], "uuid": "a1e6fa824f9200ac940212beb8abec85a5482d3a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.montgomeryadvertiser.com", "main_image": "http://www.gannett-cdn.com/-mm-/9233115f8bbb3a6166d9baa09d7423bea49a1110/c=0-0-1997-1128&amp;r=x633&amp;c=1200x630/local/-/media/2015/09/30/Montgomery/B9319068347Z.1_20150930180433_000_GPBC3C308.1-0.jpg", "site_section": "http://rssfeeds.montgomeryadvertiser.com/montgomery/troysports", "section_title": "Montgomery - Troy Sports", "url": "http://www.montgomeryadvertiser.com/story/sports/high-school/football/2015/09/29/prodigal-sons-alabamians-football/73050142/", "country": "US", "title": "Close ties bind Troy-South Alabama rivalry", "performance_score": 0, "site": "montgomeryadvertiser.com", "participants_count": 0, "title_full": "Close ties bind Troy-South Alabama rivalry", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T15:03:00.000+03:00", "replies_count": 0, "uuid": "a1e6fa824f9200ac940212beb8abec85a5482d3a"}, "author": "", "url": "http://www.montgomeryadvertiser.com/story/sports/high-school/football/2015/09/29/prodigal-sons-alabamians-football/73050142/", "ord_in_thread": 0, "title": "Close ties bind Troy-South Alabama rivalry", "locations": ["Ala", "Alabama"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mark Almond", "Brandon Burks"], "text": "Close ties bind Troy-South Alabama rivalry A. Stacy Long slong1@gannett.com @AStacyLong on Twitter 7:03 a.m. CDT October 1, 2015 Troy running back Brandon Burks celebrates his first-quarter touchdown against UAB on Saturday. AP Troy running back Brandon Burks celebrates his first-quarter touchdown against UAB during a NCAA college football game at Veterans Memorial Stadium in Troy, Ala. Saturday, Aug. 31, 2013. (AP Photo/ AL.com, Mark Almond) (Photo: AP) CONNECT 1 TWEET LINKEDIN COMMENT EMAIL MORE \nTROY — Troy running back Brandon Burks pictures a perfect ending to Saturday’s home game with South Alabama. \nHe sees Jaguars safety Roman Buchanan kneeling before him, like a knight before his king, with the new Troy-USA rivalry trophy in hand, humbly beseeching Burks for mercy. \n“I’m going to put the belt on personally and I’m going to make Roman look at me,” Burks said. “It’s my last year, and I have to go out like that. \n“I’m not going to whip him with it. I just want him to hand it to me.” \nThe two are close friends and former high school teammates, ties that bind several Trojans and Jags. Heck, some are even former college teammates. \nUAB’s diaspora includes six South Alabama starters and Troy backup cornerback LaMarcus Farmer. Troy receivers coach Cornelius Williams and USA offensive coordinator Bryant Vincent were with the Blazers, too. \n“Every game week, I normally talk to most of my teammates, especially them,” Farmer said Monday. “I haven’t talked to them yet this week. I don’t know if I will. \n“I’ll let them initiate it and see what happens.” \nSuch familiarity is how good rivalries are born. \nTroy and South Alabama share the same state and the same conference affiliation. Sometimes, they yearn for the same players, too. \n“This game definitely has recruiting implications,” Troy coach Neal Brown said. “Our job is to keep the best players at home. That’s obviously our goal. \n“Winning games like this will be a positive step toward that.” \nThe Trojans could mine Farmer for a scouting report on USA quarterback Cody Clements, tight end Gerald Everett and receiver Josh Magee. \nHe’s already intimately familiar with the offense. \n“Seeing as how I kind of practiced against that every day, I have a pretty good idea of what’s going on,” Farmer said. \nWilliams said Troy’s defensive coaches have asked him “a few things, but it hasn’t been too much.” \n“It’s different because you coaches those guys and you worked with them,” Williams said. “It’s competitive, so it will be fun.” \nMore so for Burks, who joked that he has fantasized about running over Buchanan, his former Daleville High teammate whom he says “has never hit me hard.” \nThey’ve split their first two meetings as Trojans and Jaguars. Saturday will be their last. \n“It’s 1-1 between us right now, but I’m going to take it from him,” Burks said. “That’s what I have been telling him.” Troy running back Brandon Burks says that South Alabama safety Roman Buchanan, a high school teammate, has never hit him hard and describes what he wants to happen after Saturday's game with the Jags. Stacy Long Troy defensive back LaMarcus Farmer, a UAB transfer, goes over South Alabama's offense, which picked up several UAB transfers and UAB offensive coordinator Bryant Vincent. Stacy Long Troy coach Neal Brown says Saturday's game with South Alabama is important for the Trojans, who often recruit against the Jaguars. Stacy Long Troy receivers coach Cornelius Williams is familiar with several South Alabama starters. They were together at UAB last year. Stacy Long Read or Share this story: http://on.mgmadv.com/1KOh1nQ TOP VIDEOS", "external_links": [], "published": "2015-10-01T15:03:00.000+03:00", "crawled": "2015-10-02T06:16:42.117+03:00", "highlightTitle": ""}