{"organizations": [], "uuid": "f6b8ee9dc87c7cd12039b86b3ab0d12fbe5a4ce9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/1/64/161501/Egypt/Politics-/-Egyptian-child-migrants-reach-Italian-shore-Minis.aspx", "country": "EG", "title": "560 Egyptian child migrants reach Italian shore: Minister of immigration - Politics - Egypt", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "560 Egyptian child migrants reach Italian shore: Minister of immigration - Politics - Egypt - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "f6b8ee9dc87c7cd12039b86b3ab0d12fbe5a4ce9"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/1/64/161501/Egypt/Politics-/-Egyptian-child-migrants-reach-Italian-shore-Minis.aspx", "ord_in_thread": 0, "title": "560 Egyptian child migrants reach Italian shore: Minister of immigration - Politics - Egypt", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Number of Egyptian minor migrants is alarmingly high: IOM Egypt's Navy arrests 78 migrants in Mediterranean near Alexandria A boat carrying no less than 560 Egyptian child migrants reached Italian shores on Tuesday, Minister of Immigration and Affairs of Egyptians Abroad Nabila Makram announced.\n\"The children's ages did not exceed 11-years-old,\" the minister said during her speech at the Central Agency for Public Mobilisation ad Statistics (CAPMAS) celebration of the International Day of Statistics in Cairo.\nMakram also revealed that Italy was providing residence for the children as well as shelters where they are learning crafts.\nThe minister said she would use her connections as a former diplomat who served in Italy to reach Egyptian volunteers at the Italian shelters to determine the number of undocumented Egyptian migrants currently in Italy.\nThe issue of Egyptian migrant children in Italy was recently brought up by NGOs and media outlets such as Reuters who spoke about abuse faced by African child migrants, including Egyptians. The abuse reportedly involves forced labour, drug trafficking, sexual abuse and prostitution rings in Rome.\nIn an interview with Reuters' Aswat Masriya in September, the head of the International Organisation for Migration’s Egyptian office said that there was an alarmingly high percentage of undocumented child migrants moving to Europe. He also added that Italy received 4,000 Egyptian migrants in 2014, 2,000 of whom were minors unaccompanied by parents or relatives.\nMakram also said that looking after Egyptian immigrants abroad was not only the responsibility of the Ministry of Immigration, but rather a common responsibility with the ministries of defence, interior and education.\nShe also stressed on the necessity of using religious discourse in order to capitalise on the religiosity of Egyptians to encourage families to care for their children so as to lessen this type of emigration.\nIn recent years, thousands of Egyptians have attempted to cross the Mediterranean in search of better work opportunities, with hundreds facing arrest when attempting to cross the Italian border.", "external_links": [], "published": "2015-10-21T03:00:00.000+03:00", "crawled": "2015-10-22T04:32:30.980+03:00", "highlightTitle": ""}