{"organizations": [], "uuid": "61cee6ecc3aff45c9df7099809d18996978a024f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/soccer", "section_title": "Soccer News, Scores, Schedule, Standings, Stats, Photos, Videos - MSN Sports", "url": "http://www.msn.com/en-us/sports/soccer/hunger-and-humility-it%e2%80%99s-time-usa-klinsmann-go-back-to-the-basics/ar-AAfqszr", "country": "US", "title": "Hunger and humility: It’s time USA, Klinsmann go back to the basics", "performance_score": 0, "site": "msn.com", "participants_count": 2, "title_full": "Hunger and humility: It’s time USA, Klinsmann go back to the basics", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 1, "uuid": "61cee6ecc3aff45c9df7099809d18996978a024f"}, "author": "Grant Wahl", "url": "http://www.msn.com/en-us/sports/soccer/hunger-and-humility-it%e2%80%99s-time-usa-klinsmann-go-back-to-the-basics/ar-AAfqszr", "ord_in_thread": 0, "title": "Hunger and humility: It’s time USA, Klinsmann go back to the basics", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Hunger and humility: It’s time USA, Klinsmann go back to the basics Sports Illustrated 1 day ago Grant Wahl © Sports Illustrated Jurgen Klinsmann, U.S. Soccer struggling.\nHARRISON, N.J. — Humility. It’s something that U.S. Soccer could use more of when it comes to the state of the men’s national team. Last Saturday, at the pregame fan fest before USA–Mexico outside the Rose Bowl, the U.S. Soccer Federation posted a giant banner over the stage for everyone to see:\nAdChoices DOS A CERO, ONCE AGAIN.\nIt was the soccer version of MISSION ACCOMPLISHED, to say nothing of a near-guarantee of bad karma. And sure enough, the U.S. did not win 2–0 against Mexico this time, but rather lost 3–2 to its archrival in a game that mattered.\nIn fact, if we were keeping score over the past week, the best way to do it would be by asking how many tournaments Mexico qualified for in terms of the 2017 Confederations Cup and the 2016 Olympics — that would be two — and how many the U.S. qualified for.\nYep, zero.\nTalk about Dos a Cero.\n• WAHL: It’s time to look at Jurgen Klinsmann’s suitability as USA’s coach\nLet’s be honest: the U.S. men are a mess right now. The senior team has lost four of its last six matches on home soil, including competitive elimination games against Jamaica and Mexico and dismal friendly defeats against Brazil and (on Tuesday) Costa Rica , to go along with a penalty-kick shootout defeat to Panama (which technically counts as a tie).\nThe U.S. Under-23 team laid a giant egg at home against Honduras on Saturday, deservedly losing 2–0 with an Olympic berth up for grabs. Now the Americans will have to upset Colombia in a two-game playoff in Rio de Janeiro in March to avoid being the second U.S. team in a row to miss out on the Olympics.\nFor his part, U.S. coach and technical director Jurgen Klinsmann is being asked openly if he’s considering resigning (more on that in a second).\nMeanwhile, Klinsmann’s boss, U.S. Soccer president Sunil Gulati, was non-committal on Tuesday night when asked if Klinsmann still had his support. “We’ll sit down and talk in the next few days,” Gulati told SI.com. “But we always do that after games.” Gulati had no additional comment.\nIt’s important to set goals for your program. But for now, let’s forget about Klinsmann’s stated objective of reaching the semifinals in World Cup 2018. Let’s forget about this Dos a Cero nonsense. Let’s forget about assuming anything when the U.S. faces St. Vincent and the Grenadines and Trinidad and Tobago next month in the first two games of World Cup qualifying.\nNothing is guaranteed right now. Not with the U.S. playing like a team that would struggle just to qualify for the next World Cup. Not with players sniping at each other on the field. Not with the beleaguered coach sending home key players who might or might not be injured. And not with the Klinsmann Revolution looking more and more like a bunch of empty promises these days.\nNow, more than ever, a truck-sized dose of humility is in order. Maybe the U.S. players are getting that. “We have to stand up and be counted,” said Jozy Altidore after Tuesday’s game. “Everyone has to do their role going into the next cycle.”\n• BIRD: Breaking down USA’s failure against opportunistic Mexico\nAnd maybe Klinsmann gets that too. When asked if he has considered resigning, Klinsmann said: “It’s definitely not part of my character to give up.” At another point he said: “I understand if some people are really critical because of the disappointment of the Gold Cup and because of the big disappointment on Saturday. I respect that. But at the same time with everything that goes not my way, I get even hungrier to turn it around the other way. That’s just in me. And that’s why I’m going to take this team and go through that.”\nKlinsmann has some things to figure out with his veterans, too. After he started Tim Howard at goalkeeper for the first time since World Cup 2014 on Tuesday, he announced his plan for Howard and Brad Guzan. “Going forward they will probably rotate,” he said. “There will then come a decision if you play Copa América or Gold Cup where one starts over the other. It’s for us coaches extremely important to have both of them.”\nThen there’s the Fabian Johnson situation. Klinsmann sent Johnson home on Monday, saying Johnson had asked out of the Mexico game even though he didn’t have an injury but was just concerned about getting one. Then Johnson’s club, Borussia Mönchengladbach, announced on Tuesday that Johnson did have a thigh injury.\n“If you want to test it out, then see if he’s playing on the weekend,” said Klinsmann when asked after the game. “And you have the answer.”\nThere’s a lot to fix moving forward. And ultimately you can’t help but come back to the two H words: hunger and humility. For the coach, for the players, for everyone. At the end of a dark, dark week, nothing could be clearer.\nGo to MSN Home", "external_links": ["http://www.si.com/planet-futbol/2015/07/23/usa-jamaica-upset-gold-cup-jurgen-klinsmann-confederations-cup", "http://www.si.com/planet-futbol/2015/09/08/usa-brazil-friendly-usmnt-klinsmann-bedoya-neymar", "http://www.si.com/planet-futbol/2015/10/13/fabian-johnson-jurgen-klinsmann-monchengladbach-usmnt", "http://www.si.com/planet-futbol/2015/10/12/usa-mexico-tactics-concacaf-cup-jurgen-klinsmann-ferretti", "http://www.si.com/", "http://www.si.com/planet-futbol/2015/10/11/jurgen-klinsmann-usa-mexico-concacaf-cup", "http://www.si.com/planet-futbol/2015/07/25/usa-panama-concacaf-gold-cup-third-place-usmnt-clint-dempsey-jurgen-klinsmann", "http://www.si.com/planet-futbol/2015/10/10/usa-honduras-olympic-qualifying-concacaf", "http://www.si.com/planet-futbol/2015/10/11/mexico-united-states-concacaf-cup-three-thoughts", "http://go.microsoft.com/fwlink/?LinkID=286759", "http://www.si.com/planet-futbol/2015/10/13/usa-costa-rica-friendly-jurgen-klinsmann"], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-15T16:59:19.603+03:00", "highlightTitle": ""}