{"organizations": ["Warriors City High", "Little Hawks", "City High"], "uuid": "b2798f968a55a8d6e845ecbba02a3e396fd4a9bf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thegazette.com", "main_image": "http://www.thegazette.com/storyimage/GA/20151016/ARTICLE/151019739/AR/0/AR-151019739.jpg", "site_section": "http://feeds.feedburner.com/~r/GazetteOnlineSports/~6/1", "section_title": "Eastern Iowa Sports News and Information from Gazette Online", "url": "http://www.thegazette.com/subject/sports/city-high-looking-forward-to-clash-with-warriors-20151016", "country": "US", "title": "City High looking forward to clash with Warriors", "performance_score": 0, "site": "thegazette.com", "participants_count": 0, "title_full": "City High looking forward to clash with Warriors", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T20:26:00.000+03:00", "replies_count": 0, "uuid": "b2798f968a55a8d6e845ecbba02a3e396fd4a9bf"}, "author": "", "url": "http://www.thegazette.com/subject/sports/city-high-looking-forward-to-clash-with-warriors-20151016", "ord_in_thread": 0, "title": "City High looking forward to clash with Warriors", "locations": ["Iowa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jared Taylor"], "text": "City High looking forward to clash with Warriors City High looking forward to clash with Warriors HS journalism: Little Hawk have won 5 in a row heading into tonight's showdown City High quarterback Jared Taylor carries the ball for the Little Hawks. (Mary Olesberg/City High) Iowa Football Data Center \nI've covered Iowa football at The Gazette since 1999 Saturday October 17, 2015 \nThis is going to be a QB CJ Beathard health watch thing. \nTu \nColumnist giving commentary and information about sports in Iowa. Friday October 16, 2015 \nYour source for Iowa sports and more. Friday October 16, 2015 \nCovering Iowa State and central Iowa for Eastern Iowa Friday October 16, 2015 \nKernels baseball, RoughRiders hockey and a lot of things in between. Friday October 16, 2015 \nI cover high school sports and Iowa women's basketball. Friday October 16, 2015 \nYour source for all things auto racing in Eastern Iowa. Wednesday September 23, 2015 \nSharing community and high school contributed stories Friday October 16, 2015 By Jonathan House, City High junior October 16, 2015 | 1:26 pm \nIOWA CITY — The City High football team got off to a fast start last Friday, taking a 31-0 lead into the locker room before cruising to a 38-0 win over Burlington. \nCity High (5-2) has won its last five games and is unbeaten (3-0) in Class 4A District 6. \nThe Little Hawks started out the game with a touchdown by junior Bryce Frantz. Later in the first half, junior Chuck Johnson caught a quick pass from Jared Taylor and overpowered multiple potential tacklers for the Greyhounds. \nFrantz later added another touchdown. For the final touchdown of the half, Taylor found senior Jason Jones down the sideline for a 34 yard touchdown. \nCity High added another touchdown in the third quarter, which started the continuous clock. City High was able to play a majority of its backups in the second half, and run out the clock. \n“I think overall we played pretty darn well,” Coach Dan Saber said. “We were disappointed with (ourselves) last week, that we didn’t execute our game-plan very well. But I think we did a much better job tonight.” \nTonight, the Little Hawks play their final home game of the season when Cedar Rapids Washington (6-1, 3-0 in the district) comes to Iowa City in a big district matchup. \n“That’s where we really got to be at the top of our game,” Sabers said. “They’re a very good ballclub, a lot of talent on the field. They do a lot of things very well, a tough running back. \n“We’ve got our hands full, but that’s how it’s supposed to be when you’re battling for a district championship. We’re looking forward to it.” \nClick here for more City High news. Your Next Articles", "external_links": [], "published": "2015-10-16T20:26:00.000+03:00", "crawled": "2015-10-17T21:08:07.644+03:00", "highlightTitle": ""}