{"organizations": ["Lions", "Sonora Wildcats", "Rogers", "Wildcats", "Linden Sonora", "Golden Regiment"], "uuid": "395e352a231907588b9b673c5eb90bda16e92ba7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.uniondemocrat.com", "main_image": "", "site_section": "http://feeds.feedburner.com/UnionDemocrat", "section_title": "The Union Democrat, Sonora, CA News, Sports, & Weather", "url": "http://www.uniondemocrat.com/index.php?option=com_content&task=view&id=117904&Itemid=73", "country": "US", "title": "Sonora crushes Linden", "performance_score": 0, "site": "uniondemocrat.com", "participants_count": 0, "title_full": "Sonora crushes Linden", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T12:42:00.000+03:00", "replies_count": 0, "uuid": "395e352a231907588b9b673c5eb90bda16e92ba7"}, "author": "", "url": "http://www.uniondemocrat.com/index.php?option=com_content&task=view&id=117904&Itemid=73", "ord_in_thread": 0, "title": "Sonora crushes Linden", "locations": ["Dunlavy Field", "Sonora"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Brett McCutchen", "Faughnan", "Craig", "Canepa", "Bryan Craig", "Bradley Canepa", "Rogers", "Gabby Stewart", "Kane Rogers", "Linden", "Shane Petrey", "Sammy Page", "Gino Bergamaschi", "Wyatt Faughnan", "Bill Rozak"], "text": "Sonora crushes Linden By Bill Rozak October 17, 2015 09:42 am The Sonora Wildcats walked from their locker room and entered Dunlavy Field in two rows holding hands, side by side through the bleachers and got the motor of 2,000 fans revved up. Sonora’s Golden Regiment kept the energy high during pregame warmups, blasting tunes and dancing in the north end zone. “It’s awesome. There’s nothing I can compare it to,” said Wildcat quarterback Sammy Page about the special entrance. “You can just feel the energy of the crowd as you’re walking in. It revs you up and gets you going. We’re really lucky to have something like that.” Then the game started, and “splat!” That was the sound of Linden hitting Sonora’s windshield as the Wildcats drove through the Lions, capping off homecoming week Friday with a 57-7 victory. The Wildcats led 28-0 after the first quarter and 50-0 at halftime and was never challenged on their way to their seventh straight victory. “I think we finally put a game together,” said Wildcat head coach Bryan Craig. “It’s been brewing. We could see that the last couple of weeks, but I think tonight we came out and put everything together on both sides of the ball.” By halftime, Page had rushed for 99 yards and added 105 yards and two touchdowns through the air. He finished with 139 rushing, didn’t throw a pass in the second half and was substituted early in the third quarter. The Wildcats gained 336 yards in the first half compared to just 25 for Linden. “We came out prepared, and it was probably the funnest game we’ve had all year,” said Wildcat fullback/linebacker Bradley Canepa. “We did what we are coached to do and it showed on the scoreboard.” After Canepa scored on Sonora’s second play on a 5-yard run, two plays later, sophomore safety/slotback Kane Rogers made his Sac-Joaquin Section leading ninth interception of the season. But Friday was the first he returned, 40 yards, for a touchdown. “The wideout came in on a slant and the ball just went over his head and I caught it, I was right there,” Rogers said. “And there was no way anybody was gonna catch me this time. I wanted that one.” Just over 3 minutes into the game, Sonora lead 12-0. Ninety seconds later, Page hit Wyatt Faughnan on a quick pass over the middle and the slotback zig-zagged his way through the Lion defense for a 58-yard touchdown to make it 20-0. With 28 seconds left in the first quarter, Faughnan added a 13-yard scoring run. A soft rain fell during the second quarter and the Wildcats kept raining points on the Lions. It became 36-0 when Page hit junior wideout Gino Bergamaschi, playing his first game of the season after recovering from an injury, for a 13-yard touchdown. Canepa added two more scoring runs to give the Wildcats an insurmountable halftime lead. “Much better performance. I loved to see us come out and put up so many points,” Rogers said. “It was a good feeling. It was different because our first few games have been so close.” Linden got its first first down, without the help from a penalty, in the third quarter while Sonora substituted generously. Shortly after the third quarter started, and the homecoming queen, Gabby Stewart, was crowned, fans started hugging and saying their goodbyes. The second half started with a running clock and it made just two stops, to enter the fourth quarter and during a timeout with a few minutes left. Sonora (7-1, 4-0 Mother Lode League) finished with 308 yards rushing on just 33 carries, a whopping 9.3 yards per carry. Rogers had 56, Faughnan 44, Canepa 29, Brett McCutchen had 20, and Sonora’s final touchdown, a bruising 12-yard run up the middle, and Shane Petrey added 20 yards. “We practiced well this week, but we’ve practiced well before and still had tight games,” Craig said. “I knew we had the potential to do this, but I hadn’t seen it yet until now.” “Our execution was there,” Canepa said. “Last game we had a bunch of mistakes, but this game we were solid. Maybe one or two and that’s how you win ball games.” Follow UnionDemocrat.com", "external_links": [], "published": "2015-10-17T12:42:00.000+03:00", "crawled": "2015-10-18T08:23:05.385+03:00", "highlightTitle": ""}