{"organizations": ["Bon Homme Top Viborg-Hurley"], "uuid": "62a711510e033aff71ff702f9e5591e6ac05469e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.yankton.net", "main_image": "http://yankton.net/content/tncms/live/global/resources/images/_site/facebook_share_img.jpg", "site_section": "http://www.yankton.net/search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&nsa=eedition&c%5B%5D=sports,sports/*&f=rss", "section_title": "Yankton Press & Dakotan - sports,sports/", "url": "http://www.yankton.net/sports/article_b910b44e-79ff-11e5-bc22-83a85d3f1380.html", "country": "US", "title": "Volleyball: Bon Homme Top Viborg-Hurley", "performance_score": 0, "site": "yankton.net", "participants_count": 0, "title_full": "Volleyball: Bon Homme Top Viborg-Hurley", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T06:31:00.000+03:00", "replies_count": 0, "uuid": "62a711510e033aff71ff702f9e5591e6ac05469e"}, "author": "", "url": "http://www.yankton.net/sports/article_b910b44e-79ff-11e5-bc22-83a85d3f1380.html", "ord_in_thread": 0, "title": "Volleyball: Bon Homme Top Viborg-Hurley", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Volleyball: Bon Homme Top Viborg-Hurley 0 comments \nHURLEY – The Bon Homme Cavaliers had three players with double-digit kills in their 25-14, 25-10, 23-25, 25-14 victory over Viborg-Hurley on Friday in Hurley. \nSierra Mesman had 16 kills to lead the way, while Morgan Rothschadl added 13 kills and 16 digs. Breanna Dockendorf totaled 10 kills and 13 digs, and Alie Adams had 30 set assists. \nAbby Hora led the way for Viborg-Hurley, as she finished with eight kills and 22 digs. Duana Lee added three kills and nine digs, and Shelby Simonsen had seven assists for Viborg-Hurley. \nBon Homme will take part in the SESD tournament today (Saturday) in Platte, while Viborg-Hurley will take on the Alcester-Hudson Cubs on Monday in Alcester. \nBON HOMME (22-4) 25 25 23 25 \nVIBORG-HURLEY (8-17) 14 10 25 14 \nMenno 3, Avon 2 \nMENNO – Menno picked up a win in a 26-24, 26-28, 21-25, 25-19, 15-10 thrilling victory over the Avon Pirates on Friday night in Menno. \nTara Spencer led Menno, recording 13 kills and 10 blocks. Paige Heckenlaible added 11 kills and two ace serves, while Ashton Vaith had 28 digs. \nFor Avon, Cheylee Nagel totaled a game-high 12 kills and 15 digs, while Lexi Olson had eight kills. Hanna Powers finished with 30 assists for Avon, while Karisa Markel had 28 digs. Lea Wormshecher had a game-high six ace serves for Avon. \nMenno will travel to Scotland on Monday, while Avon will ghost Gayville-Volin on Monday. \nAVON (7-13) 24 28 25 19 10 \nMENNO (10-11) 26 26 21 25 15 \nAlcester-Hudson 3, Canton 0 \nCANTON – The Alcester-Hudson Cubs picked up a 25-13, 25-18, 25-12 road victory over the Canton C-Hawks on Friday in Canton. \nKassidy Walth and Amelia Stene each had 10 kills in the Cubs win, while Cassie Schiefef had 19 assists. Briana Walth finished the match with 11 digs, while Madison Trieber had two ace serves. \nFor Canton, Mary Kat Beachler had four kills to lead the C-Hawks attack. Rachel Ball had six digs, while Shayla White totaled two ace serves. \nAlcester-Hudson will host Viborg-Hurley on Monday, while Canton will have a home game Thursday against Lennox. \nALCESTER-HUDSON (13-12) 25 25 25 \nCANTON (1-21) 13 18 12 \nSioux Falls Christian 3, Beresford 1 \nBERESFORD – Shelby Zomermaand totaled 24 kills and four blocks for Sioux Falls Christian in a 25-20, 21-25, 25-6, 25-12 victory over the Beresford Watchdogs. \nEllie Voss added nine kills for Sioux Falls Christian, while Kylee VanEgdom had seven kills and seven ace serves. Amy Hurley had a game-high 43 set assists, and Emily Stasser had 16 digs. \nFor the Watchdogs, Katlyn Wilson finished the match with seven kills, and Kare Kirkbak had four kills and two blocks. Katie Drefendorf had 14 set assists and tow ace serves for Beresford. \nSioux Falls Christian will travel to Lennox on Monday, while Beresford will have a road game in Dell Rapids on Monday. \nSIOUX FALLS CHRISTIAN (23-4) 25 21 25 25 \nBERESFORD (14-13) 20 25 6 12 \nCenterville 3, Freeman 0 \nCENTERVILLE – Shannon O’Malley recorded 12 kills to help lead the Centerville Tornadoes to a 25-16, 25-19, 25-19 victory over Freeman on Friday night in Centerville. \nLogan O’Toole added six kills and 10 digs for Centerville, while Madeline Olson finished with 23 set assists and five ace serves. Cheyenne Brown also totaled five ace serves in the win. \nAshley Glanzer led Freeman with nine kills and four ace serves, while Dayna Roth and Journey Mehlhaf had six kills apiece. Josie Fuhrman added four kills and 12 set assists for Freeman. \nCenterville will host Flandreau on Monday, while Freeman will host Canistota on Monday. \nFREEMAN (0-17) 16 19 19 \nCENTERVILLE (7-18) 25 25 25 \nBaltic 3, Marion 0 \nBALTIC –Maddie Polzin recorded 18 kills in Baltic’s 25-13, 25-13, 25-8 victory over Marion on Friday night in Baltic. \nPolzin also added three ace serves, while Rachel Aberson had six kills and three ace serves. Molly Sittig added 21 set assists, and Makay Paszek had three kills and two blocks. \nFor the visting Marion, Michele Schoenwald had five kills and 13 digs, and Renae Kayser added three kills, seven assists and two ace serves in the loss. \nBaltic will travel to Flandreau on Monday, while Marion will play host to Irene-Wakonda on Monday. \nMARION (5-12) 13 13 8 \nBALTIC (16-7) 25 25 25", "external_links": [], "published": "2015-10-24T06:31:00.000+03:00", "crawled": "2015-10-24T18:48:04.473+03:00", "highlightTitle": ""}