{"organizations": [], "uuid": "3b3075d4d84175d865afc7ab1b67e28086259f07", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/nfl", "section_title": "NFL News, Scores, Schedule, Standings, Stats, Photos, Videos - Football - MSN Sports", "url": "http://www.msn.com/en-us/sports/nfl/raiders-build-big-lead-beat-chargers-37-29/ar-BBmqycX", "country": "US", "title": "Raiders build big lead, beat Chargers 37-29", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "Raiders build big lead, beat Chargers 37-29", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:00:00.000+02:00", "replies_count": 0, "uuid": "3b3075d4d84175d865afc7ab1b67e28086259f07"}, "author": "Vic Tafur", "url": "http://www.msn.com/en-us/sports/nfl/raiders-build-big-lead-beat-chargers-37-29/ar-BBmqycX", "ord_in_thread": 0, "title": "Raiders build big lead, beat Chargers 37-29", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\nRaiders build big lead, beat Chargers 37-29 San Francisco Chronicle 1 hr ago By Vic Tafur < PREVIOUS SLIDE SLIDE 1 of 16 NEXT SLIDE > SAN DIEGO - OCTOBER 25: Quarterback Philip Rivers #17 of the San Diego Chargers is pressured by the Oakland Raiders defense during their NFL game at Qualcomm Stadium on October 25, 2015 in San Diego, California. (Photo by Donald Miralle/Getty Images) © Donald Miralle, Getty Images SAN DIEGO — With 10½ minutes to go in the third quarter, members of the Raiders’ defense were smiling and motioning with their hands for the crowd to get louder. Teammates on the sideline were waving their towels.\nAdChoices And the San Diego fans obliged.\nRaiders fans always take over the Qualcomm Stadium stands on the annual game in San Diego, but not in 32 years has their team dominated the Chargers as they did Sunday. It was 37-6 when the Raiders celebrated and after the garbage time was dumped (three fourth-quarter touchdown passes for Philip Rivers), they walked off with a 37-29 win and a 3-3 record.\nThe Raiders, coming off a bye week, jumped all over the Chargers from the first play. Well, the third play to be exact. Safety TJ Carrie broke up Rivers’ second pass and linebacker Malcolm Smith ran under the high deflection and trucked with the interception 27 yards to Chargers’ 2-yard line.\nLatavius Murray bulled in for the touchdown two plays later, and the floodgates opened. Oakland scored in its first six possessions and led 30-6 at halftime. It could have been a lot worse as penalties turned a couple of likely touchdowns into field goals.\nDerek Carr was on point and threw three touchdowns, to Clive Walford, Amari Cooper and Michael Crabtree.\nCooper’s was a thing of beauty, as he took a five-yard bubble screen and wiggled for 52 yards behind big down-the-field blocks from tackle Donald Penn and center Rodney Hudson. Cooper then had one man to beat, and his cutback made Chargers safety Jimmy Wilson melt like the Wicked Witch of the East.\nThat score, which made it 30-3, may not have even been the receiver’s best play of the day. Earlier in the second quarter, Cooper showed off his leaping ability when he snagged a 44-yard pass. The crowd was stunned and then broke into a “Coooop” chant, Chargers fans probably was well.\nThe 30-6 halftime margin was only the second time the Raiders have led by 20 points or more at halftime on the road in the past 20 years.\nWhile the Raiders defense more than held its own, the offense stole the show with its impressive drives and seemingly countless weapons. Murray and Jones ran for 110 yards on 14 carries in the first three quarters. Walford, the rookie tight end, had the 23-yard touchdown catch on a beautiful pass that Carr dropped in over his shoulder.\nFinally, Crabtree put the nail in the coffin with a 25-yard touchdown catch four minutes into the second half. Crabtree showed off his moves and broke a couple of tackles to get into the endzone, and his first-quarter drop of a Carr deep pass was long forgotten.\nDefensively, Smith was everywhere and while Rivers wasn’t sacked in the first three quarters he definitely felt the presence of Khalil Mack, Aldon Smith and rookie Mario Edwards Jr. The much-maligned secondary did a nice job, and cornerback DJ Hayden - who defensive coordinator Ken Norton said Thursday was becoming one of the best cornerbacks in the NFL - lowered the eyebrows a tiny bit with his second career interception of Rivers.\nVic Tafur is a San Francisco Chronicle staff writer. E-mail: vtafur@sfchronicle.com Twitter: @VicTafur\nGo to MSN Home", "external_links": ["http://go.microsoft.com/fwlink/?LinkID=286759"], "published": "2015-10-26T02:00:00.000+02:00", "crawled": "2015-10-26T03:11:57.163+02:00", "highlightTitle": ""}