{"organizations": [], "uuid": "9db1d936c0961bd4d40210dd5d463c673400a958", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wcax.com", "main_image": "", "site_section": "http://www.wcax.com/category/13530/national-news", "section_title": "National News - WCAX.COM Local Vermont News, Weather and Sports-", "url": "http://www.wcax.com/story/30147860/sheriff-starts-testimony-at-his-contempt-of-court-hearing", "country": "US", "title": "Sheriff starts testimony at his contempt-of-court hearing", "performance_score": 0, "site": "wcax.com", "participants_count": 1, "title_full": "Sheriff starts testimony at his contempt-of-court hearing - WCAX.COM Local Vermont News, Weather and Sports-", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "9db1d936c0961bd4d40210dd5d463c673400a958"}, "author": "wcax.com", "url": "http://www.wcax.com/story/30147860/sheriff-starts-testimony-at-his-contempt-of-court-hearing", "ord_in_thread": 0, "title": "Sheriff starts testimony at his contempt-of-court hearing", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By JACQUES BILLEAUD\nAssociated Press PHOENIX (AP) - The sheriff for metro Phoenix briefly took to the witness stand late Wednesday afternoon at contempt-of-court hearings over his acknowledged disobedience of a judge's orders in a racial profiling case.\nSheriff Joe Arpaio was questioned for 30 minutes about violations that could expose him to civil fines and possibly a criminal contempt case. The hearings are examining how Arpaio's office let its officers conduct immigration patrols for 18 months after the judge ordered them stopped.\nThe six-term sheriff was shown news videos made after the patrols were banned in which Arpaio proclaimed he would continue enforcing immigration laws. He explained in court that he was referring to other state immigration laws that his office was allowed to enforce at the time.\nArpaio also was asked about whether his immigration efforts were politically driven. \"It wasn't politics for me. I was trying to enforce the laws,\" said Arpaio, whose testimony is set to resume Thursday.\nThe lawman also is being called into court for his office's failure to turn over traffic-stop recordings before the profiling trial and bungling a plan to gather the videos once they were publicly revealed.\nOther subjects examined at the hearings include allegations that Arpaio launched a secret investigation of the profiling case's judge in a failed bid to get him disqualified and that his officers pocketed personal items seized from people during traffic stops and busts.\nHe is expected to face tough questions on his investigation involving U.S. District Judge Murray Snow, who delivered a setback to Arpaio in 2013 when he concluded that sheriff's deputies had profiled Latinos during regular traffic and immigration patrols.\nThe judge has said the investigation was intended to show an alleged conspiracy between him and the U.S. Justice Department, which was pressing a separate civil rights lawsuit against Arpaio.\nArpaio, who in the past has been accused of retaliating against his critics, had insisted that he hadn't investigated Snow. Instead, he has previously said his office was examining allegations that wiretaps had been put on emails and phones of local judges and lawyers defending him in the Justice Department case.\nTwo former and one current member of Arpaio's inner circle also testified Wednesday.\nTim Casey, an attorney who defended Arpaio's office in the case for nearly six years before bowing out in November, also testified that he privately confronted the sheriff over his mistaken understanding of his powers as sheriff.\nUnder questioning from the judge, Casey said he confronted Arpaio during the 2012 profiling trial about a key flaw in the sheriff's thinking about his immigration powers.\nThe sheriff mistakenly believed that his officers could detain immigrants who hadn't been suspected of a state crime until federal immigration authorities picked them up, Casey said.\nCasey said Arpaio responded by saying he didn't get into the details of the matter and had delegated it to subordinates.\n ", "external_links": [], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-10-02T23:23:43.289+03:00", "highlightTitle": ""}