{"organizations": [], "uuid": "3208cf4bbe67294b00d08288e5e8f86d50837195", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/soccer", "section_title": "Soccer News, Scores, Schedule, Standings, Stats, Photos, Videos - MSN Sports", "url": "http://www.msn.com/en-us/sports/soccer/frustrated-by-honduras-usa-misses-olympic-qualifying-chance/ar-AAfjHYb", "country": "US", "title": "Frustrated by Honduras, USA misses Olympic qualifying chance", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "Frustrated by Honduras, USA misses Olympic qualifying chance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "3208cf4bbe67294b00d08288e5e8f86d50837195"}, "author": "Liviu Bird", "url": "http://www.msn.com/en-us/sports/soccer/frustrated-by-honduras-usa-misses-olympic-qualifying-chance/ar-AAfjHYb", "ord_in_thread": 0, "title": "Frustrated by Honduras, USA misses Olympic qualifying chance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\nFrustrated by Honduras, USA misses Olympic qualifying chance Sports Illustrated 20 hrs ago Liviu Bird © Sports Illustrated SANDY, Utah—It’s not impossible for the United States to still qualify for the 2016 Summer Olympics, despite a frustrating 2-0 loss to Honduras on Saturday, but the task is suddenly much tougher than before. The team has to quickly put the semifinal loss out of its head in time for the third-place game on Tuesday, which would be followed by a playoff against Colombia if the U.S. wins.\nAdChoices “We have to swallow this,” U.S. coach Andi Herzog said after the game. “That’s tough, but at the end now, we have to win the next game. … We had the chance to do it the short way, but now, we’ll do it [with] the longer trip.”\nOf course, the U.S. has to get to the playoff first. Herzog suggested that a similar showing against either Mexico or Canada as the team gave against Honduras simply wouldn’t get the job done.\n“To qualify for the Olympics,” he said, “our performance today was not good enough.”\nOn Saturday afternoon, Herzog lined his team up in a 4-4-2 with a diamond midfield, with Luis Gil as the primary playmaker just underneath forwards Jordan Morris and Jerome Kiesewetter. However, even with a man advantage over Honduras's three-man midfield, the U.S. never got a handle on the center of the park. The U.S.'s numerical advantage disappeared in the face of the Catrachos’ work rate, as the Hondurans cut off passing lanes to the U.S. forwards and scrapped for every loose ball.\nThe Americans also couldn’t get through an organized Honduran defense that matched the U.S.'s athleticism and conceded nothing over the top.\n“We were not good offensively—we have to be honest,” Herzog said. “I don’t care about Honduras; it’s more about my team. We had our plan, but we were not able to do it in the right way, so that’s the most disappointing thing.”\nJust as disappointing, though, was the U.S.’s inability to keep its discipline in the face of repeated Honduran gamesmanship. From the start, the Catrachos took every chance they had to bleed time off the clock, taking their time on restarts and ensuring the game would be played within their parameters.\nAfter Alberth Elias scored in the 24th minute, blowing past U.S. center back Cameron Carter-Vickers to slot his shot home, that gamesmanship intensified. It was the first time the U.S. trailed in qualifying, its tournament-best attack held at bay without being able to resort to long balls over the top to its forward runners.\nThe closest the U.S. came to scoring was on a corner kick in the 64th minute, when Honduras goalkeeper Luis López stretched to keep Carter-Vickers’ close-range header out. Meanwhile, after every foul the Hondurans spent a little more time on the ground, delayed free kicks by standing in front of the ball, and casually walked to take throw-ins.\nElias scored again in the 77th minute, and the U.S.’s composure unraveled, with most of the vitriol directed at the officials. Two minutes after the goal, Kiesewetter picked up a yellow card for arguing with Panamanian referee Jafeth Perea, and Herzog charged across the halfway line in the technical area to dispute the call.\nLater, Herzog and Honduran coach Jorge Luis Pinto were both sent to the stands after some verbal sparring with Perea and fourth official Juan Carlos Guerra. Before he left, Herzog removed the orange substitutes’ bib he was wearing to avoid a shirt-color clash with the players and flipped it at Guerra.\nMorris then had a goal called back for offside on a call that looked marginal at best. In response, U.S. substitute forward Alonso Hernández charged toward the near touchline, getting into assistant referee Ronald Bruña’s face.\nAnother mass altercation in the U.S.’s half a minute later ended with captain Wil Trapp being issued a yellow card.\n“I don’t think we were frustrated by [Honduras’] tactics; we were frustrated by the referee,” Kiesewetter said. “I don’t want to blame it on him, but he just kind of played on the same level.”\nHowever, the notion that the referees were to blame didn’t hold much weight with Herzog or Trapp. The idea that they were “CONCACAF-ed,” or done in by the confederation’s notoriously shaky officiating, never crossed their lips.\n“Honduras’ best strength is to waste time,” Herzog said. “At the end, they deserved to win.”\nTrapp added: “It’s an emotional game with a lot on the line, and you never want to see a team rolling on the ground, but that’s their right. I mean, they managed the game pretty well. Can’t fault them for that.”\nHonduras implemented the plan against Mexico in a 2-1 loss in its final group game, but it was a much more effective tactic against an American team unprepared for it. Faced with the typical CONCACAF psychological games and a referee unprepared to curb them, coupled with the Catrachos’ individual and collective defensive ability, the U.S. crumbled.\nEgged on by the more vocal support among a sparse crowd, the Catrachos qualified for their second successive Olympics. It was a deserved victory in all aspects, as they outperformed their American counterparts in every position.\n“The difference between them and the other teams we’ve played is just their willingness to work and fight and battle for 90 minutes,” Trapp said. “I think we knew that going in, and we handled it decently well, but it’s just something we weren’t accustomed to from the previous three games.”\nThe U.S. now has three days to turn it around or lose its final chance to qualify for the Olympics. It would be the Americans’ second failure in a row and third in the past four attempts. One positive takeaway: none of the U.S. players were sent off, and their opponent should be in a similarly disappointed mental state after a semifinal loss.\nStill, that doesn’t detract from the disastrous result on Saturday. After breezing through the group stage and dominating every opponent, the U.S. fell flat when it counted most and cost itself an automatic berth in Rio.\n“It was the most important game in the tournament, and it’s a different mental thing,” Herzog said. “We were not able to deal with this situation today. That’s sad, but it’s the truth.”\nGo to MSN Home", "external_links": ["http://www.si.com/", "http://go.microsoft.com/fwlink/?LinkID=286759"], "published": "2015-10-11T03:00:00.000+03:00", "crawled": "2015-10-11T23:58:13.302+03:00", "highlightTitle": ""}