{"organizations": [], "uuid": "37255123a4bd9f3517c6788ea881c74c81f547ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "swtimes.com", "main_image": "http://swtimes.com/sites/swtimes.com/files/field/media/web1_Spt-NHS-Rogers-Fleming-3-bds_0.jpg", "site_section": "http://swtimes.com/taxonomy/term/3/feed", "section_title": "Sports", "url": "http://swtimes.com/sports/football/football-frazier-s-three-score-night-lifts-northside-30-9", "country": "US", "title": "Football: Frazier’s Three Score Night Lifts Northside, 30-9", "performance_score": 0, "site": "swtimes.com", "participants_count": 0, "title_full": "Football: Frazier’s Three Score Night Lifts Northside, 30-9", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T07:21:00.000+03:00", "replies_count": 0, "uuid": "37255123a4bd9f3517c6788ea881c74c81f547ee"}, "author": "", "url": "http://swtimes.com/sports/football/football-frazier-s-three-score-night-lifts-northside-30-9", "ord_in_thread": 0, "title": "Football: Frazier’s Three Score Night Lifts Northside, 30-9", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Frazier"], "text": "Football: Frazier’s Three Score Night Lifts Northside, 30-9 Football: Frazier’s Three Score Night Lifts Northside, 30-9 \nBRIAN D. SANDERFORD • TIMES RECORD Northside’s Colby Fleming, right, goes over the block attempt by Rogers’ Christian Brummett to tackle Milacio Freeland during the first quarter on Friday, Oct. 16, 2015 at Mayo-Thompson Stadium. Football: Frazier’s Three Score Night Lifts Northside, 30-9 \nBRIAN D. SANDERFORD • TIMES RECORD Northside’s Tydarren Jones, left, gains ground after a reception before being stopped by Rogers’ Jeb Brain during the second quarter on Friday, Oct. 16, 2015 at Mayo-Thompson Stadium. Football: Frazier’s Three Score Night Lifts Northside, 30-9 \nBRIAN D. SANDERFORD • TIMES RECORD Northside’s Garrett Butler, right, sacks Rogers quarterback Max Horton during the first quarter on Friday, Oct. 16, 2015 at Mayo-Thompson Stadium. Football: Frazier’s Three Score Night Lifts Northside, 30-9 \nBRIAN D. SANDERFORD • TIMES RECORD Northside quarterback Max Frazier carries to inside the one during the second quarter against Rogers on Friday, Oct. 16, 2015 at Mayo-Thompson Stadium. Football: Frazier’s Three Score Night Lifts Northside, 30-9 \nBRIAN D. SANDERFORD • TIMES RECORD Northside quarterback Max Frazier looks downfield during the second quarter against Rogers on Friday, Oct. 16, 2015 at Mayo-Thompson Stadium. Football: Frazier’s Three Score Night Lifts Northside, 30-9 Buy Photo \nBRIAN D. SANDERFORD • TIMES RECORD Northside’s Brennon Lewis, left, looks upfield after a reception as Rogers’ Landon Harper moves in during the second quarter on Friday, Oct. 16, 2015 at Mayo-Thompson Stadium. Rogers 9 Northside 30 SUMMARY &#8212; Northside's defense shutout Rogers in the second half, paving the way for Max Frazier's two touchdown runs in the fourth quarter to seal the game. TURNING POINT &#8212; Luke Bolton scored from one yard out on the opening possession of the second half, taking 4:05 off the clock to extend the lead to 16-9. STAT &#8212; Max Frazier rushed for two touchdowns and threw for another in the win. By Scottie BordelonTimes Record • sbordelon@swtimes.com \nJunior quarterback Max Frazier was making only his third varsity start Friday against Rogers. \nWhat he delivered was the performance of a veteran as he led Northside (3-4, 2-2 7A-West) to a 30-9 win on Homecoming. \nFrazier sparked the Grizzlies’ offense and totaled 263 yards (140 rushing, 123 passing) of offense and three touchdowns to bring Northside back to even in conference play. \n“Max did a great job. He’s getting better every week,” Mike Falleur said. “He’s getting more and more confident and he’s not turning the ball over, (he’s) doing the right things and making good decisions.” \nRogers got on the board first with a three-yard touchdown run by Christian Brummett. The point after missed, but the Mounties led 6-0 less than four minutes into the game. \nNorthside’s offense answered back, however, and quick. Frazier sold a pair of playfakes, sucking the Mounties’ defensive backs in enough to find a wide open and streaking Brennon Lewis for a 69-yard pitch and catch. \n“We schemed that,” Frazier said. “We knew that would be the first play of the game. We called it in pregame and it just worked.” \n“An explosive play right off the bat is what we needed to get the momentum going,” Lewis added. \nMidway through the second quarter, Rogers was driving into the redzone, but a big third down stop by the Grizzlies held the Mounties. Rogers regained the lead on Chris Lopez’s 34-yard field goal with 5:52 to go before half. \nAnd it appeared the visitors would take a 9-6 lead into the break as Northside was forced the punt with 2:14 to play in the half, but the Grizzlies’ defense forced a quick three-and-out, giving the offense 1:20 to drive 57 yards to either tie or take the lead. \nThat’s when Frazier and Lewis took center stage and drove the ball to the Rogers 1. Lewis had catches of 12 and 14 yards and Frazier reeled off quarterback runs of six, 15 and 10 on the drive. Lewis caught three passes, all in the first half, for 95 yards. \nA throwback pass in the endzone with less than 10 seconds in the half fell incomplete, but Chuy Parga’s 18-yard field goal knotted the game, 9-9, at halftime. \n“We didn’t play extremely well in the first half,” Falleur said. “But we were able to stay with them and get that score late. We challenged our kids (at halftime) and said this is not the way we play and they came out and really did a good job.” \nThe Grizzlies responded to the message and opened the second half as well as Falleur could have asked for. \nFrazier led a four minute, five second scoring drive capped off by Luke Bolton’s 1-yard touchdown run to give Northside a 16-9 lead, and the Grizzlies never looked back. \nNorthside’s defense pitched a shutout in the second half and paved the way for a pair of Frazier touchdown runs, the first a two-yard score with 8:08 to play and the second a 34-yard scamper less than two minutes later to set the final score. \n“Our offensive line worked really hard tonight. They did great,” Frazier said. “My receivers played for me, and that’s really all there is to it. We’re playing for each other.” \nWith the win, Falleur’s club is one step closer to getting back to .500 on the season as a trip to Springdale lies ahead next week. \n“Now to get back to even overall, and 3-2 (in league play),” Falleur said. High School Football Northside 30, Rogers 9 Rogers – 6 3 0 0 Northside – 6 3 7 14 First Quarter Rog- Brummett 3 rush (kick no good), 8:23 Nor- Frazier 69 pass to Lewis (kick no good), 8:08 Second Quarter Rog- Lopez 34-yard field goal, 5:52 Nor- Parga 18-yard field goa, 3.0 Third Quarter Nor- Bolton 1 rush (Parga kick), 7:55 Fourth Quarter Nor- Frazier 2 rush (Parga kick), 8:06 Nor- Frazier 34 rush (Parga kick), 6:41", "external_links": [], "published": "2015-10-17T07:21:00.000+03:00", "crawled": "2015-10-17T09:14:54.544+03:00", "highlightTitle": ""}