{"organizations": [], "uuid": "60c24f8a727c2ffe06fb960d9fcfbc80d68387b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.vvdailypress.com", "main_image": "http://www.vvdailypress.com/Global/images/head/nameplate/vvdailypress_logo.png", "site_section": "http://www.vvdailypress.com/sports?template=rss&mime=xml", "section_title": "Sports - VVdailypress.com", "url": "http://www.vvdailypress.com/article/20151018/NEWS/151019757/12965/SPORTS?rssfeed=true", "country": "US", "title": "Fantasy Football: Follow the box scores to find the right backups", "performance_score": 0, "site": "vvdailypress.com", "participants_count": 1, "title_full": "Fantasy Football: Follow the box scores to find the right backups", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T08:07:00.000+03:00", "replies_count": 0, "uuid": "60c24f8a727c2ffe06fb960d9fcfbc80d68387b5"}, "author": "Jeremy James For the Daily Press", "url": "http://www.vvdailypress.com/article/20151018/NEWS/151019757/12965/SPORTS?rssfeed=true", "ord_in_thread": 0, "title": "Fantasy Football: Follow the box scores to find the right backups", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Oct. 18, 2015 at 12:01 AM Updated at 12:07 AM » Social News Recently we covered free agents and making trades to strengthen your fantasy team throughout the season. On the flip side, making the wrong move in free agency or making a bad trade can set your team back even worse than before. One of the biggest mistakes that many owners will make when picking up a free agent is getting stuck on names they recognize and avoiding the ones they don’t. A player does not need to be a household name in order to help your fantasy team. When big names struggle or get injured, you need to know the no-name backup ready to take the spot. Last week, many fantasy football owners across the country were crushed by the loss of Jamal Charles for the season to a torn ACL, but that injury means an opportunity for a backup player to step up and help his team and your fantasy team. The question is, did owners pick up the right backup RB in Kansas City? Unfortunately many have to answer that they did not. Knowing Charles' injury history, owners probably kept their eye on Knile Davis, who backed up Charles the last two seasons. As it turns out, Davis was probably not the RB you wanted to pick up. One check of the box score of Kansas City's game would have shown you that once Charles went down, it was second-year player Charcandrick West who got most of the touches the rest of the way. West ended up touching the ball 10 times, compared to Davis’ two. Coach Andy Reid has said that both players will see touches this season, but he also said he felt that West had the more similar skill set to Charles. That’s coach-speak for “this guy gives us a better chance to win” and therefore, West is in line to see most of the touches out of the KC backfield going forward. The point is this: Fantasy football players need to start making a habit of checking the box scores of all games to find out who is getting the ball and scoring points. You don’t want to be the owner who hears about the hot player after the rest of the fantasy football world already knows his name. You want to be the owner who saw it coming. After I saw the box score and saw that West got the touches, I put in waiver pickups and bids on him in all my leagues before going to bed that Sunday. The last-place team in my fantasy league, which had the first priority on the waiver wire this week, did not do their homework and ended up with Davis. He won’t be helping them get that zero out of the win column anytime soon. By Jeremy James", "external_links": [], "published": "2015-10-18T08:07:00.000+03:00", "crawled": "2015-10-18T13:43:07.592+03:00", "highlightTitle": ""}