{"organizations": [], "uuid": "eb03a7c00d42c54b20208bd0c640268efd5445a5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pal-item.com", "main_image": "http://www.gannett-cdn.com/-mm-/4eadabc0bcf034533e8e1b55107cd5846748989f/c=0-85-2134-1291&amp;r=x633&amp;c=1200x630/local/-/media/2015/09/30/INGroup/Richmond/635792414895128659-DSC-8057.jpg", "site_section": "http://rssfeeds.pal-item.com/richmond/sports", "section_title": "Richmond IN - Sports", "url": "http://www.pal-item.com/story/sports/high-school/2015/09/30/devil-defense-starts-4-1-win/73109198/", "country": "US", "title": "Devil defense starts with 4-1 win", "performance_score": 0, "site": "pal-item.com", "participants_count": 0, "title_full": "Devil defense starts with 4-1 win", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T07:28:00.000+03:00", "replies_count": 0, "uuid": "eb03a7c00d42c54b20208bd0c640268efd5445a5"}, "author": "", "url": "http://www.pal-item.com/story/sports/high-school/2015/09/30/devil-defense-starts-4-1-win/73109198/", "ord_in_thread": 0, "title": "Devil defense starts with 4-1 win", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ross Doughty", "Josh Chapin", "Joshua Smith"], "text": "Devil defense starts with 4-1 win Josh Chapin , jchapin@richmond.gannett.com 12:28 a.m. EDT October 1, 2015 Buy Photo Richmond's Ross Doughty returns the ball during the tennis sectional Wednesday, Sept. 30, 2015, at RHS. (Photo: Palladium-Item Joshua Smith) Buy Photo 1 CONNECT TWEET LINKEDIN COMMENT EMAIL MORE \nRichmond passed the first test in defense of its sectional title in boys tennis. \nThe Red Devils advanced to the semifinal round with Wednesday's 4-1 win over Lincoln. They'll face Centerville Thursday on the Tiernan Center tennis courts, while Northeastern takes on Hagerstown in the other semifinal. \nRichmond took four straight flights before the Golden Eagles won at No. 1 doubles to prevent the sweep. \n\"I think overall we played pretty well,\" said RHS coach Randy Hollingsworth. \nRichmond went up 3-0 and clinched the team victory by sweeping singles play. \nEric Hollingsworth was first off the courts at No. 1 with his 6-0, 6-0 victory, followed by younger brother Ryan's win at No. 3 by the same score. Buy Photo \nRichmond's Logan Mayer returns during the tennis sectional Wednesday, Sept. 30, 2015, at RHS. (Photo: Joshua Smith/Palladium-Item) \nLogan Mayer won 6-0, 6-2 at No. 2 to secure the Devils' spot in the semifinals. The final is scheduled for Friday. \nRichmond's No. 2 doubles duo of Daniel Jones and Justin Gibbel won 6-2, 6-2, reversing the outcome at that flight from the Red Devils' 4-1 win in the regular season. \n\"We played much better this time around at two doubles,\" Randy Hollingsworth said. \nAustin Lanich and Jacob Kissick continued their successful week at No. 1 doubles for the Golden Eagles. They won the Tri-Eastern Conference Tournament at that spot on Monday, then guaranteed play next week with Wednesday's 6-0, 7-5 victory. \n\"I think that gave them a boost,\" Lincoln coach Elizabeth Wonsetler said of her doubles team's TEC championship. \"They're good players. \n\"They communicate well. They cover the court really well. I'm happy. I expected Richmond to work their way back in, and they did, and what I'm really happy about is the guys closed out in that second set.\" Buy Photo \nLincoln's Jacob Kissick watches as Austin Lanich returns the ball during the tennis sectional Wednesday, Sept. 30, 2015, at RHS. (Photo: Joshua Smith/Palladium-Item) \nCenterville drew a bye to the semifinal round. The Red Devils defeated the Bulldogs 4-1 last week. \nCenterville won the TEC's regular season, while Hagerstown was the conference's overall tournament champion. \nRHS had a strong showing in the Delta Invitational last weekend, and is now 17-2 overall. Randy Hollingsworth wants to see that type of play continue for his squad. \n\"Our schedule the last half of the season has been pretty strong and we've won some close matches,\" he said. \"I think we'll be ready to go. \n\"We've got to do what we've done all season, and that's not beat ourselves. Get a lot of balls in play, put the pressure on them to beat us.\" \nRichmond won its first sectional since 2008 a year ago, and went on to win a regional championship. Six of the seven Red Devils on this year's squad played on that team. \n\"That's huge, because we've been here before. These guys know what it takes to get the job done,\" Randy Hollingsworth said. \"Going to semistate, that experience is huge. Any time you can do that, I think it comes up big.\" \nJosh Chapin: (765) 973-4463 jchapin@pal-item.com or twitter.com/JoshChapinPI \nRED DEVILS 4, GOLDEN EAGLES 1 \nSINGLES — No. 1 - E.Hollingsworth (RHS) def. Martin 6-0, 6-0; No. 2 - Mayer (RHS) def. Morris 6-0, 6-2; No. 3 - R.Hollingsworth (RHS) def. Berry 6-0, 6-0. \nDOUBLES — No. 1 - Lanich and Kissick (LIN) def. Weiss and Doughty 6-0, 7-5; No. 2 - Jones and Gibbel (RHS) def. Gulde and Reece 6-2, 6-2. Buy Photo Richmond's Eric Hollingsworth returns the ball during the tennis sectional Wednesday, Sept. 30, 2015, at RHS. Palladium-Item Joshua Smith", "external_links": [], "published": "2015-10-01T07:28:00.000+03:00", "crawled": "2015-10-01T07:40:31.408+03:00", "highlightTitle": ""}