{"organizations": [], "uuid": "0efe3a66ebf1d28a7e17c37fd12aacb603250c11", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.staradvertiser.com", "main_image": "http://media.bclocalnews.com/images/20140808_brk_oba01.jpg", "site_section": "http://www.staradvertiser.com/sports/breaking/index.rss", "section_title": "Breaking-Sports", "url": "http://www.staradvertiser.com/sports/breaking/20150930_court_strikes_down_possible_payments_to_college_athletes.html", "country": "US", "title": "Court strikes down possible payments to college athletes", "performance_score": 0, "site": "staradvertiser.com", "participants_count": 5, "title_full": "Court strikes down possible payments to college athletes - Hawaii News - Honolulu Star-Advertiser", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T15:51:00.000+03:00", "replies_count": 4, "uuid": "d9452470053f4925b86ddd5bb8393a066dca1edb"}, "author": "Sudhin Thanawala", "url": "http://www.staradvertiser.com/sports/breaking/20150930_court_strikes_down_possible_payments_to_college_athletes.html#post-0", "ord_in_thread": 0, "title": "Court strikes down possible payments to college athletes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SAN FRANCISCO » A federal appeals court agreed Wednesday that the NCAA's use of college athletes' names, images and likenesses in video games and TV broadcasts violated antitrust laws but struck down a plan to allow schools to pay football and basketball players up to $5,000 per year. The 9th U.S. Circuit Court of Appeals said the NCAA could not stop schools from providing full scholarships to student athletes but vacated a proposal for deferred cash payments.\n\"The difference between offering student-athletes education-related compensation and offering them cash sums untethered to educational expenses is not minor; it is a quantum leap,\" Judge Jay Bybee wrote. \"Once that line is crossed, we see no basis for returning to a rule of amateurism and no defined stopping point.\"\nNCAA officials said they agreed that allowing students to receive cash compensation was erroneous and called the ruling a victory for the principle of amateurism.\n\"That was a very, very welcome decision from our point,\" NCAA President Mark Emmert said.\nThe NCAA in August began allowing its member schools to provide an athletic scholarship that covers the full cost of attending college, though officials say it should not be mandated by the courts.\nBig 12 Commissioner Bob Bowlsby said the ruling supports the idea that college athletes are not employees.\n\"There are elements of this ruling that are either unknown at this point or are things that we would tend to disagree with the court,\" Bowlsby said. \"But in the main I believe this has affirmed the amateur status of collegiate athletes and affirmed these are students, not employees.\"\nThe NCAA had appealed U.S. District Judge Claudia Wilken's 2014 decision to allow players in the top division of college football and in Division I men's basketball to be paid. The money would have been put in a trust fund and given to them when they left school.\nThis does not end the legal challenges facing the NCAA. One case in particular challenges schools' rights to cap compensation to college athletes at the cost of a scholarship.\n\"I think in a general sense we made progress,\" Bowlsby said. \"I think we now are well-positioned to move ahead with the rest of the challenges that we face.\"\nWednesday's decision came in a lawsuit filed by former UCLA basketball star Ed O'Bannon and 19 others.\nThe NCAA was accused of violating antitrust laws by conspiring to block the athletes from getting a share of revenue generated by the use of their images.\nThe NCAA said paying college athletes would destroy its system of amateurism, and the rules designed to protect that system had never previously been found by courts to violate antitrust law.\nNCAA attorney Seth Waxman cited a 1984 U.S. Supreme Court ruling during oral arguments before the 9th Circuit in March. The ruling said athletes must not be paid in order to preserve the character and quality of college athletics.\nPlaintiffs' attorney Michael Hausfeld countered that the Supreme Court's comment was made in passing and was not integral to the outcome of that case.\n ", "external_links": [], "published": "2015-09-30T15:51:00.000+03:00", "crawled": "2015-10-02T02:00:20.616+03:00", "highlightTitle": ""}