{"organizations": [], "uuid": "c5630c23fc6bd5bd43f5bbb2d9cd8649b0541ab5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "savannahnow.com", "main_image": "http://savannahnow.com/sites/default/files/14830052.jpg", "site_section": "http://savannahnow.com/", "section_title": "savannahnow.com | Savannah Georgia's source for News, Entertainment, Sports, Weather, Classifieds, Jobs, Autos, Real Estate and St. Patricks Day", "url": "http://savannahnow.com/exchange/2015-10-22/moving-boxes-breaking-records", "country": "US", "title": "Moving boxes, breaking records", "performance_score": 0, "site": "savannahnow.com", "participants_count": 1, "title_full": "Moving boxes, breaking records | savannahnow.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T19:05:00.000+03:00", "replies_count": 0, "uuid": "c5630c23fc6bd5bd43f5bbb2d9cd8649b0541ab5"}, "author": "DispatchDaemon", "url": "http://savannahnow.com/exchange/2015-10-22/moving-boxes-breaking-records", "ord_in_thread": 0, "title": "Moving boxes, breaking records", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photos Photo by Stephen B. Morton for GPA Georgia Ports' set a new record for container traffic lin September. This demonstrated ability to handle high container volumes made Savannah the only U.S. port to rank in the Top 10 of the Journal of Commerce's annual listing of the Top 50 fastest-growing ports in the world, released last week. For months, Georgia Ports’ executive director Curtis Foltz has been noting the rise in container volumes with a modicum of caution.\nWhen July numbers came in stronger than anticipated, Foltz tempered the announcement with a prediction that the growth would slow down.\n“The crystal ball isn’t clear,” he said at the time. “But at some point soon, I expect this growth surge to slow as the last of the West Coast volumes that had been diverted shift back.”\nHe’s still waiting.\nSeptember numbers are out today and — ho hum — it’s another record-breaking month.\nLast month the Port of Savannah handled 317,411 20-foot equivalent container units, a 7.3-percent increase over the same month last year, which was — in itself — a record shattering month.\n“We are pleasantly surprised to see volumes remaining above last year’s double digit growth,” Foltz said, noting that September 2014 container numbers were nearly 13 percent higher than the same month in 2013, due in part to diverted cargo from the West Coast, where labor and management were struggling to forge a new agreement.\nStill, he was quick to offer another caveat.\n“Last month was the busiest September for container traffic in GPA’s history. We anticipate, at some point this year, to begin seeing throughput leveling off to more normal patterns,” he said.\nThat may well happen, but it’s no longer a secret that Savannah’s ability to handle the extra load has put it in a category of its own.\nAcross the logistics industry, focus has centered on Savannah as it continued to handle a massive influx of cargo throughout the spring and summer without becoming mired in congestion. This demonstrated ability to handle high container volumes made Savannah the only U.S. port to rank in the Top 10 of the Journal of Commerce’s annual listing of the Top 50 fastest-growing ports in the world, released last week.\nApparently, a lot of that diverted cargo came and decided to stay, something that doesn’t surprise GPA board chairman Jim Walters.\n“New customers exposed to services through the Port of Savannah have found that they can reach the fast-growing southeastern U.S. market more efficiently through Georgia’s deepwater ports,” Walters said.\n“Being the only American port to rank in the top 10 is testimony to GPA’s long-term commitment to customer service.”\nOther September numbers were also positive, Foltz said, with roll-on/roll-off cargo topping 50,000 units, up 4.6 percent from the same month last year. Total tonnage was up 5 percent to 2.52 million tons in September.\nWhale petition denied\nThe National Oceanic and Atmospheric Administration has issued a notice stating that it has denied a petition to exclude federally maintained dredged channels and pilot boarding areas for ports from New York to Jacksonville from the vessel speed restrictions that were established to reduce the threat of vessel collisions with North Atlantic right whales.\nAt Wednesday’s meeting of the Savannah Maritime Association, SMA board member Tom Wright expressed disappointment in the decision and concern that the extensive real-time reporting requirements placed on ships’ pilots provides an unnecessary distraction.\n“It’s a real challenge to get on a ship, try to explain all these rules to the crew and do all the reporting required when your primary concern should be navigating the ship safely through the channel,” he said.\nWright said he has asked pilots to give him a breakdown of everything they have to deal with when boarding a ship.\n“We’d like to put together some data that we can take to our congressional representatives,” he said.\nSenior business reporter Mary Carr Mayle covers the ports for the Savannah Morning News and savannahnow. She can be reached at 912-652-0324 or at mary.mayle@savannahnow.com.\nFollowing are the ships expected to call on Georgia Ports Authority’s Garden City and Ocean terminals this week. Schedules are supplied by GPA and are subject to change.\nTERMINAL VESSEL ETA\nGCT BENEDICT SCHULTE Today\nGCT MAERSK WEYMOUTH Today\nGCT MAERSK KENSINGTON Today\nGCT MSC LUDOVICA Today\nGCT MAERSK WAKAYAMA Today\nGCT HOUSTON EXPRESS Today\nGCT CONTI CANBERRA Today\nGCT NYK DEMETER Today\nOT GAO QIANG Today\nOT GRANDE BENIN Today\nGCT ROSSINI Saturday\nGCT PHILADELPHIA EXPRESS Saturday\nGCT MAERSK KINGSTON Saturday\nGCT UASC ZAMZAM Saturday\nGCT MAERSK SOFIA Sunday\nGCT WIDE BRAVO Sunday\nGCT OOCL HALIFAX Sunday\nGCT EVER LINKING Sunday\nGCT TASMAN Sunday\nOT AAL BANGKOK Sunday\nGCT HYUNDAI GOODWILL Monday\nGCT MAERSK CHICAGO Monday\nGCT HANJIN MALTA Monday\nGCT BUDAPEST EXPRESS Monday\nGCT FSL NEW YORK Monday\nGCT SEA LAND MERCURY Monday\nGCT MSC KOREA Monday\nOT ATLANTIC VENUS Monday\nGCT ZIM LUANDA Tuesday\nGCT HONGKONG BRIDGE Tuesday\nGCT HANJIN ATLANTA Tuesday\nGCT CAP HATTERAS Tuesday\nGCT CUCKOO HUNTER Tuesday\nGCT MUKADDES KALKAVAN Tuesday\nGCT CMA CGM AZURE Tuesday\nGCT HELSINKI BRIDGE Tuesday\nOT CSCC ASIA Tuesday\nOT ISSARA NAREE Tuesday\nOT TYSLA Tuesday\nGCT HYUNDAI UNITY Wednesday\nGCT MOEN ISLAND Wednesday\nGCT CMA CGM RACINE Wednesday\nGCT ARIAN Wednesday\nOT UNION DEDE Wednesday\nGCT HAMMONIA ANTO[filtered word]ASTA Thursday\nGCT MOL MODERN Thursday\nGCT MSC PAMELA Thursday\nGCT WEHR SINGAPORE Thursday\nGCT ZIM HAIFA Thursday", "external_links": ["http://sav-cdn.com/sites/default/files/imagecache/superphoto/14830052.jpg", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/14830052.jpg", "http://sav-cdn.com/sites/all/themes/savannahnow/images/blank.gif"], "published": "2015-10-22T19:05:00.000+03:00", "crawled": "2015-10-23T08:18:13.124+03:00", "highlightTitle": ""}