{"organizations": [], "uuid": "e4cbd06bd81231b29b2ede98e0e4e3c7318e62e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dallasnews.com", "main_image": "http://www.dallasnews.com/incoming/20150930-1443664372-ns_29smularrybrown3_46370331.jpg.ece/BINARY/original/1443664372-NS_29SMULARRYBROWN3_46370331.JPG", "site_section": "http://www.dallasnews.com/sports/college-sports/", "section_title": "Dallas-Fort Worth College Sports News - Sports News for Dallas, Texas ", "url": "http://www.dallasnews.com/sports/college-sports/columnists/bill-nichols/20150930-nichols-to-appeal-or-not-to-appeal-dominos-beginning-to-fall-following-sanctions-against-smu.ece", "country": "US", "title": "Nichols: To appeal or not to appeal? Dominos beginning to fall following sanctions against SMU", "performance_score": 0, "site": "dallasnews.com", "participants_count": 4, "title_full": "Nichols: To appeal or not to appeal? Dominos beginning to fall following sanctions against SMU | Dallas Morning News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T05:09:00.000+03:00", "replies_count": 3, "uuid": "047b821c8a8c442ed6b0289e99863543e070059b"}, "author": "Nichols", "url": "http://www.dallasnews.com/sports/college-sports/columnists/bill-nichols/20150930-nichols-to-appeal-or-not-to-appeal-dominos-beginning-to-fall-following-sanctions-against-smu.ece#post-0", "ord_in_thread": 0, "title": "Nichols: To appeal or not to appeal? Dominos beginning to fall following sanctions against SMU", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "UNIVERSITY PARK -- Less than 24 hours after the NCAA levied sanctions against SMU, the dominos started to fall. Syracuse basketball coach Jim Boeheim reportedly decided to appeal his suspension in a case that spanned eight years.\nBoeheim will use the penalties handed his peer, SMU's Larry Brown, as part of his case when he appears before the NCAA's infractions appeal committee, according to ESPN: Boeheim will try to prove that his program operated in an atmosphere of compliance.\nMaybe SMU can use Boeheim's case as leverage if it decides to appeal. Or maybe the NCAA will use its decision on Boeheim against SMU.\nThe point is, appealing NCAA decisions is a difficult endeavor. The process for SMU is complicated by the fact that it stands alone in this new era of NCAA legislation -- a universe of one, as school president R. Gerald Turner said.\nTurner and athletic director Rick Hart presented strong evidence that SMU could use to appeal the postseason bans on its basketball and golf programs. They have convincing arguments that might overturn Brown's nine -game suspension and the vacating of certain wins from 2013-14.\nBut as the first school penalized in the NCAA's new system, SMU has no standard to use in negotiations.\nWhat might seem a slam dunk to SMU fans is, in reality, a shot in the dark. What Turner and Hart must decide in the next few days is, will the reward outweigh the risk?\nSMU learned Tuesday that the new moon over the NCAA does not glow black and white. Turner and Hart seemed shocked by the postseason bans.\nWith the new emphasis on protecting innocent athletes from the unethical actions of individuals, they hoped that SMU's penalty would reflect that. Instead, players who had nothing to do with any of the misdeeds will pay for the crimes.\nAn appeal by SMU could do more damage. Having a veil of uncertainty hanging over the basketball and golf programs for several more months could seriously impede the school's recovery efforts.\nSince there is no timetable on NCAA appeals, there is no way to know if a decision will be rendered by November, when high school prospects start signing letters of intent. Not only will rival schools use the NCAA cloud against the Mustangs, but SMU coaches cannot answer the question that weighs on every prized prospects mind -- will we be playing in the NCAA Tournament?\nThe only university to receive the \"death penalty\" also stands to suffer from negative exposure during a lengthy appeal. There are other questions that SMU officials do not have an answer for, such as a lost appeal carrying over to the following year.\n\"Once a decision's made, if you don't win the appeal, does it still apply to that year? We don't want it carrying on to another year,\" Turner said. \"We have to submit something and they have to respond to it, then we have to respond to what they submit. I think the whole process can take anywhere from two to four months just to get to your hearing. So then, what will it take for a hearing? That's the unknown.\"\nAccording to the NCAA, the appeal process \"spells out a 110-day timeline, but it may take longer depending on the complexity of the case.\"\nA school has four grounds on which to sway the Infractions Appeals Committee to reverse or modify a ruling:\n-- The ruling by the committee on infractions was clearly contrary to the evidence.\n-- The individual or school did not actually break NCAA rules.\n-- There was a procedural error that caused the committee on infractions to find a violation of NCAA rules.\n-- The penalty was excessive.\nOf 73 appeals of NCAA rulings since 2002, 24 have resulted in reduced penalties (34%) but only three of last 21.\n\"We are university one under this new penalty guideline, so we don't have the context in which to evaluate our penalties versus some others,\" Hart said. \"I believe the structure provides an opportunity to hold individuals accountable. What I have trouble with is how that correlates to having student athletes who were not involved in any of the violations be held accountable for that.\"\nFollow Bill Nichols on Twitter at @BillNicholsDMN .\nMore on the Mustangs\nÂ\nNichols: NCAA's severe sanctions make SMU model of holding coaches accountable for entire program\nTownsend: SMU's Larry Brown reminded of how unflattering reputations can be revived\nNichols: Mustangs positioned to repeat as AAC champs, but - with postseason ban - what's their rallying cry?\nTimeline of SMU, NCAA major infraction cases dating back to 1958\nBryson DeChambeau one reason why SMU is considering appealing NCAA sanctions\nSMU students pan NCAA penalties for basketball team\nSherrington: SMU's Larry Brown is a winner who gets penalties, so no outrage, please\nSMU's note to basketball season ticket holders: 'The future is bright'\nPhotos: SMU talks with media about NCAA penalties to golf, basketball teams\nNCAA issues SMU basketball findings, penalties: Coach Larry Brown 'saddened and disappointed'\nNational reaction: SMU should fire Larry Brown; sanctions will cause dent in recruiting\nOn Twitter:\n @BillNicholsDMN", "external_links": ["http://beta.sportsdaydfw.com/college-sports/collegesheadlines/2015/09/29/national-reaction-larry-brown-still-right-hire-smu-sanctions-laughable", "http://beta.sportsdaydfw.com/college-sports/collegesheadlines/2015/09/29/townsend-smus-larry-brown-reminded-unflattering-reputations-can-revived", "https://twitter.com/BillNicholsDMN", "http://beta.sportsdaydfw.com/college-sports/collegesheadlines/2015/09/29/smus-note-basketball-season-ticket-holders-future-bright", "http://beta.sportsdaydfw.com/college-sports/billnichols/2015/09/29/nichols-ncaas-severe-sanctions-make-smu-model-holding-coaches-accountable-entire-program", "http://beta.sportsdaydfw.com/college-sports/collegesheadlines/2015/09/29/sherrington-larry-brown-winner-gets-penalties-smu-act-surprised", "http://beta.sportsdaydfw.com/college-sports/collegesheadlines/2015/09/29/timeline-smu-ncaa-major-infraction-cases-dating-back-1958", "http://beta.sportsdaydfw.com/college-sports/collegesheadlines/2015/09/29/nichols-mustangs-positioned-repeat-aac-champs-postseason-ban-rallying-cry", "http://beta.sportsdaydfw.com/college-sports/smumustangs/2015/09/29/report-ncaa-bans-smu-basketball-team-postseason-larry-brown-three-games", "http://twitter.com/BillNicholsDMN", "http://beta.sportsdaydfw.com/other-sports/golfheadlines/2015/09/29/bryson-dechambeau-one-reason-smu-considering-appealing-ncaa-sanctions", "http://beta.sportsdaydfw.com/college-sports/collegesportsgallery/2015/09/29/photos-smu-talks-media-ncaa-penalties-golf-basketball-teams"], "published": "2015-10-01T05:09:00.000+03:00", "crawled": "2015-10-09T21:06:44.549+03:00", "highlightTitle": ""}