{"organizations": [], "uuid": "b12deb99f03956d4da0c310348592e467cdac5c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theguardian.com", "main_image": "https://i.guim.co.uk/img/media/5c1519494e52f13de410a893f29ba237afaeeed9/0_133_4691_2817/master/4691.jpg?w=1200&amp;q=85&amp;auto=format&amp;sharp=10&amp;s=3981f78954f295dd0a5bc8ec22dc83f5", "site_section": "http://www.theguardian.com/us", "section_title": "Latest US news, world news, sports and opinion from the Guardian | theguardian.com | The Guardian", "url": "http://www.theguardian.com/us-news/2015/oct/02/wisconsin-native-americans-legal-marijuana-menominee-ho-chunk", "country": "GB", "title": "A 'deal with the devil'? Native American tribes push for marijuana legalization | US news", "performance_score": 1, "site": "theguardian.com", "participants_count": 2, "title_full": "A 'deal with the devil'? Native American tribes push for marijuana legalization | US news | The Guardian", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T20:02:00.000+03:00", "replies_count": 1, "uuid": "20dda7d7683019e7a12b87e0e44c9da1bfe2c69a"}, "author": "Zoe Sullivan", "url": "http://www.theguardian.com/us-news/2015/oct/02/wisconsin-native-americans-legal-marijuana-menominee-ho-chunk#post-0", "ord_in_thread": 0, "title": "A 'deal with the devil'? Native American tribes push for marijuana legalization | US news", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "W ith 23 US states having legalized marijuana in some form – Oregon became the latest to permit the sale of marijuana for recreational on Thursday – some Native American nations are now also considering the possibility of legalizing the plant, in some cases because it could represent a revenue stream.\nWithin the past few weeks, two Wisconsin nations, the Menominee and the Ho-Chunk , have registered popular support for such a move, one through a referendum and the other when tribal members voted to adopt a resolution supporting legalization.\nMarijuana is not legal in Wisconsin for any use. The relationship of Native American tribes to state and federal governments in the US is complex. Some tribes, such as the Ho-Chunk, are bound by state, federal and tribal law. Others, such as the Menominee, are bound only by federal and tribal law.\nA 2014 memorandum from the US Justice Department suggested that US attorneys – the chief federal law enforcement officers for each jurisdiction – have the discretion to decide whether to enforce federal drug laws in Indian country.\nThat document, however, leaves a great deal of room for interpretation, challenging Native governments to tread carefully as they move forward with any legalization processes.\nIn order to create functional marijuana projects, tribal governments would have to negotiate agreements with state and local authorities, since marijuana is still illegal under federal law.\n“Tribes have to make some kind of deal with the devil,” said Gabe Galanda, a Seattle-based attorney focusing on Native American issues.\n“Tribal sovereignty means that state and local government have no say in the regulation of on-reservation affairs. Tribes that seek local and, in turn, federal support must either in letter or in spirit cede sovereignty to state and local government,” Galanda said.\nWhile the Wisconsin tribes are still in the early stages of determining whether to legalize marijuana, other nations, such as the Flandreau Santee Sioux of South Dakota, have already passed the legislation.\nThe South Dakota nation approved legalization in June although marijuana is not legal for any purpose in South Dakota.\nSeth Pearman, the Santee Sioux’s attorney, said that the tribe plans to open a distribution facility by the end of the year that will be open to tribal members and non-tribal members. “The tribe will get direct and immediate economic benefits from the sale of marijuana.”\nWhile Pearman declined to comment on the potential magnitude of these benefits, an article in the Cannabist Quote: d the tribe’s president estimating the income at $2m a month . The story describes the facility as a “marijuana resort” that will have a nightclub, bar and food service, and arcade games.\nPearman said that the Santee Sioux didn’t consult with local authorities about their initiative, although they did communicate with the US attorney for the district of South Dakota. Asked about enforcement actions, Pearman said he did not expect any.\nThe tribe is not governed by public law 280 , which means that its territory is subject only to tribal law and federal law, not state jurisdiction.\nPublic law 280 grants states the ability to play a greater criminal justice role on Native American lands. It initially covered six states (Alaska, California, Minnesota, Nebraska, Oregon, and Wisconsin) but other states were allowed to opt in. As a result, while tribal nations may be considered separate legal entities from the state in which their lands are located, public law 280 blurs these lines. Tribes such as the Menominee, which are not governed by this law, in theory relate directly to the federal government without the state as an interlocutor. In Wisconsin, the Menominee are the only tribe not subject to public law 280. The Ho-Chunk are, and as a result must consider their concurrent jurisdiction with state authorities in matters such as legalizing marijuana.\nAsked about the possible reaction the Ho-Chunk nation might expect from Wisconsin authorities in the event that it did decide to move forward with legalization, the tribe’s attorney general, Amanda White Eagle, was circumspect. “I don’t want to speculate and pre-judge anybody’s reaction to this.”\nWisconsin’s attorney general, Brad Schimel, was equally cautious in his email response to inquiries from the Guardian on the issue of legalizing marijuana in Indian country.\n“We continue to monitor the situation and we will continue our ongoing discussions with the tribes,” he said.\nIn an August interview with the Milwaukee Journal-Sentinel, Schimel was more blunt . “ We would work to shut it down,” he said of marijuana activity on tribal lands, like the Ho-Chunk’s, subject to Wisconsin law. “We’re not going to sit back and let it happen.”\nYet even with the ambiguous memorandum suggesting that federal authorities need not investigate or prosecute marijuana-related activity on Native lands as long as it does not contribute to larger criminal issues, the Menominee are cautious.\nGary Besaw, tribal chairman of the Menominee nation, spoke with the Guardian in a phone interview shortly after a referendum on legalization.\nThe tribe voted in August on two questions related to legalizing marijuana for medicinal purposes and recreational use for individuals over the age of 21. Both passed, with the former winning 76.5% of the yes votes, and the latter 57.8%.\n“I think the idea with any draft legislation, the proof is in the pudding,” Besaw said. “How we develop, control and monitor what goes forward really determines how the tribal membership views this and what happens with this. So we have to make sure that as we move forward that we examine all angles and really do our due diligence.”\nCasinos and cannabis At the start of the year, Governor Scott Walker denied permission to the Menominee to open a casino, which would have served the nation as an economic engine.\nWalker cited the high cost of the project to taxpayers as his motivation for nixing the project, but other tribes with existing casinos, including the Ho-Chunk, also opposed the deal.\nBoth the Potawatomi and the Ho-Chunk are the beneficiaries of a pre-Walker era agreement that pledges to reimburse them if a competing casino results in a loss of revenue. The Menominee project, operated by another Native-owned business, Hard Rock International, would have been located on the former site of the Dairyland greyhound park.\nAccording to a Milwaukee Journal-Sentinel report, following Walker’s decision, one of the opposing tribes, the Potawatomi, paid the state government $25m in owed casino fees, which they had been withholding since mid-2014 as a result of their objections to the Menominee project.\nThe move prompted tribal members to march to Madison during the cold month of February in an ultimately unsuccessful effort to convince the governor to change his mind.\nAsked whether this decision had prompted the tribe to consider legalizing marijuana, tribal chairman Besaw said: “You know, some people tried to build a case that there is some type of nexus there that is implicating Walker somehow, but the reality is that the governor denied the Kenosha Hard Rock casino, which would have brought much-needed revenue to the reservation and, quite frankly, to the whole north-east Wisconsin region.\n“So the fact that he denied that and those revenue are not there, well, that doesn’t mean that we roll over and play dead. We still need revenue.”\nWill marijuana ‘poison’ reservations? Legalizing marijuana may offer tribes a way of diversifying their income streams, but given the historic challenges Native American communities have faced with alcohol, not everyone is convinced that legalizing marijuana is the best option.\nJerome Brooks Big John lives in northern Wisconsin on the Lac de Flambeau land of the Chippewa nation. He declined to express an opinion about the possibility that nearby nations might legalize cannabis, but he described the “war on drugs” that his community has declared as drug-related deaths have risen into the double digits in recent years.\n“Right now we’ve banished over 80 people from our reservation,” he said. “They’re not coming back here. They were poisoning our reservation with drugs and preying on our youth and our young adults. They’re not welcome back here. We’ve had enough of it.”\nFor the Santee Sioux, on the other hand, Pearman said the income expected from marijuana sales would help fund treatment programs. “Some of the proceeds from the actual venture itself the tribe wants to use to fund and establish a tribally owned treatment center for some of the epidemics that we see in our area like alcoholism, addiction to prescription drugs, methamphetamines, and some of those current issues we’re dealing with.”\nCalifornia’s Alturas and Pit River tribes, which were reportedly growing marijuana for medicinal purposes, were raided by authorities in July, but tribal members didn’t return calls from the Guardian on the matter.\nFor Galanda such raids represent one of the very real risks facing tribes that move forward with legalization. “Keep in mind some local law enforcement will not pause to ask whether they have any authority on tribal lands,” he said.\nThis, he said, could have far-reaching consequences. “That raises significant Indian sovereignty implications, potential civil rights violations for those individuals who will find themselves in the cross-hairs of non-tribal cops, and other profound legal consequences.”", "external_links": ["http://www.redding.com/news/local-news/pit-river-tribe-responds-to-allegations-that-led-to-raid_35699612", "http://www.menominee-nsn.gov/", "http://www.justice.gov/sites/default/files/tribal/pages/attachments/2014/12/11/policystatementregardingmarijuanaissuesinindiancountry2.pdf", "http://www.pbs.org/indiancountry/challenges/abuse.html", "http://www.jsonline.com/news/statepolitics/scott-walker-rejects-menominee-bid-for-kenosha-casino-b99431696z1-289587411.html", "http://www.ho-chunknation.com/", "http://www.kenoshanews.com/news/walker_stands_by_casino_denial_481072330.html", "http://www.thecannabist.co/2015/09/29/marijuana-resort-south-dakota-indian-tribe-santee-sioux/41591/", "http://www.tribal-institute.org/lists/pl280.htm", "http://www.jsonline.com/news/wisconsin/menominee-tribe-prepares-vote-on-legalizing-marijuana-b99557285z1-321993501.html"], "published": "2015-10-02T20:02:00.000+03:00", "crawled": "2015-10-02T14:36:49.202+03:00", "highlightTitle": ""}