{"organizations": [], "uuid": "ee1f61565cbeede23dba330b19f4eb3a3e9dd82b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.coloradodaily.com", "main_image": "http://extras.mnginteractive.com/live/media/site36/2015/1004/20151004_032838_demarcus-ware.jpg", "site_section": "http://feeds.coloradodaily.com/mngi/rss/CustomRssServlet/25/219106.xml", "section_title": "Sports", "url": "http://www.coloradodaily.com/sports/ci_28920619/broncos-defense-holds-off-vikings-late-push-denver?source=rss", "country": "IL", "title": "Broncos defense holds off Vikings' late push, Denver wins 23-20", "performance_score": 0, "site": "coloradodaily.com", "participants_count": 1, "title_full": "Broncos defense holds off Vikings' late push, Denver wins 23-20", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T02:45:00.000+03:00", "replies_count": 0, "uuid": "ee1f61565cbeede23dba330b19f4eb3a3e9dd82b"}, "author": "Troy E. Renck \nThe Denver Post", "url": "http://www.coloradodaily.com/sports/ci_28920619/broncos-defense-holds-off-vikings-late-push-denver?source=rss", "ord_in_thread": 0, "title": "Broncos defense holds off Vikings' late push, Denver wins 23-20", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Broncos schedule \nThunder stood lonely in the south end zone. The Arabian gelding waited patiently for a reason to run. The days of long sprints and heavy pants after touchdowns . \nNew coach, old school. The Broncos leave with dirt under their fingernails, heart in their esophagus. When Broncos general manager John Elway hired Gary Kubiak he wanted to bring back a tougher team. They have succeeded in winning and making life difficult on their fans. \nThe Broncos squandered a 10-point fourth quarter lead, but as they have done for a month, played their best when it mattered most, slipping away with a 23-20 victory over the Minnesota Vikings on Sunday. \nBrandon McManus secured the win with a 39-yard field goal. \nPHOTOS: Broncos defeat the Vikings at Sports Authority Field \nThe Broncos remain perfect, 4-0. But far from perfect. Yet for their flaws — and this week the defense showed vulnerability — they possesses intriguing resolve. \nWith the scored tied at 20 after an Adrian Peterson's 48-yard fourth-down touchdown run and a 33-yard field goal by Blair Walsh, the Broncos took over on with 5:05 remaining. Advertisement \nIf not concern, trepidation permeated the soldout crowd at Sports Authority Field. The break out of Ronnie Hillman, and the defense's sack attack felt inexplicably hollow with Manning taking over at the 24-yard line. He had thrown his second interception on the previous possession, lofting a ball to safety Harrison Smith. A foolish facemask penalty by receiver Mike Wallace pushed the Vikings back, turning a potential go-ahead touchdown into a tying field goal. \nWATCH: Ronnie Hillman's 72-yard touchdown run \nManning didn't flinch. He began the drive with a 17-yard connection with Emmanuel Sanders, evoking images of the pitch-and-catch game in the two-minute drill with Demaryius Thomas in Kansas City. Hillman and C.J. Anderson rushed for 22 yards, clearing the way for McManus. For all the palpitations he caused last season, McManus remains a soothing force. He hasn't missed a kick yet. \nThe Broncos, as they did in the season opener, asked the defense to vanquish the opponent. They spent the afternoon suffocating Peterson until his touchdown jaunt. They forced Minnesota quarterback Teddy Bridgewater to try to beat them. He fought bouts of wildness, and threw more times in the first half (26) than he averaged in the previous three games. In the end, he couldn't elude a maniacal defense that finished with seven sacks. \nBOXSCORE: Broncos 23, Vikings 20 \nWith the clock ticking dangerously toward expiration, T.J. Ward raced off the left end and hooked his claws into Bridgewater. He netted the Broncos' seventh sack and stripped the ball, a tactic practiced repeatedly during the week. Von Miller pounced on the loose ball, leaving the Broncos' unblemished. \nThey led by 10 points twice because of a blend of aggression and creativity on offense. Hillman burst for a 72-yard touchdown run, more yards than the Broncos had rushing in any previous game. He reached the corner and put his foot on the ground, inflating Denver's advantage to 10-0. It tied the fourth longest run in Broncos history. With that rush, Hillman resuscitated the running game and made a claim for the starting job. Hillman's previous long was 37 yards. \nLeading 13-10, the Broncos reached an important juncture of the game. If running backs have to make tacklers miss it follows that coaches have to make defenders guess. The Broncos began their fourth-and-1 formation with center James Ferentz at fullback. He jogged to forward, flanking left tackle Ryan Harris. Max Garcia flanked right tackle Michael Schofield. The formation howled run, physical identity, punch in the face. Instead, they tickled with a feather. Tight end Owen Daniels, lined up on the right side behind the tackles, and took off across the line at the snap. Manning faked the run and lobbed to an uncovered Daniels in the end zone, pushing the Broncos ahead 20-10. \n\"I don't know about the rest of you, but these victories are taking it out of me,\" Elway wrote on Facebook last week. \" Don't get me wrong, I'm not complaining. I'll take them.\" \nIt took Ward's final sack to seal the game, and provide yet another reminder that nothing comes easily for this team. \nTroy E. Renck: trenck@denverpost.com or @troyrenck Denver Broncos linebacker DeMarcus Ware (94) flushes Teddy Bridgewater (5) of the Minnesota Vikings out of the pocket in the first quarter. The Denver Broncos played the Minnesota Vikings at Sports Authority Field at Mile High in Denver on Oct. 4, 2015. ( AAron Ontiveroz, The Denver Post )", "external_links": [], "published": "2015-10-05T02:45:00.000+03:00", "crawled": "2015-10-05T04:46:19.060+03:00", "highlightTitle": ""}