{"organizations": [], "uuid": "c5e78e834f7b38e15446fbd2a33b32aff50c0abe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48531/sports", "section_title": "Sports - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30205998/leading-football-media-platform-90min-increases-total-funding-to-39m-with-latest-series-d-round", "country": "US", "title": "Leading Football Media Platform 90min Increases Total Funding to $39m With Latest Series D Round", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Leading Football Media Platform 90min Increases Total Funding to $39m With Latest Series D Round - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T03:00:00.000+03:00", "replies_count": 0, "uuid": "c5e78e834f7b38e15446fbd2a33b32aff50c0abe"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30205998/leading-football-media-platform-90min-increases-total-funding-to-39m-with-latest-series-d-round", "ord_in_thread": 0, "title": "Leading Football Media Platform 90min Increases Total Funding to $39m With Latest Series D Round", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Information contained on this page is provided by an independent third-party content provider. WorldNow and this Station make no warranties or representations in connection therewith. If you have any questions or comments about this page please contact pressreleases@worldnow.com .\nSOURCE 90min.com\nLONDON , October 7, 2015 /PRNewswire/ --\n90min, the leading contributor-driven football media platform, has announced the closing of a $15m investment round, bringing its total funding since inception to $39m. The proceeds will serve to further boost 90min's global expansion, introduce new sports brands, and enrich its technology-enabled platform with focus on mobile and multimedia content.\n(Logo: http://photos.prnewswire.com/prnh/20151005/273769LOGO )\nThe round was led by German media group ProSiebenSat.1 Media SE, joined by 90min's existing backers Battery Ventures, Dawn Capital and Gemini Ventures. Following the round, 90min and ProSiebenSat.1 will launch a strategic co-branded joint venture targeting the German football market with a combined digital offering.\nFounded in late 2011, 90min is headquartered in London with offices in Tel Aviv and Manila . Through its worldwide contributor network and authentic fan-generated content, 90min delivers 400-500 daily pieces of original, socially-driven content to over 30 million unique users a month in 10 languages across Europe , Latin America and South East Asia . The company will also launch a new American Sports brand, targeting the US consumer arena with an additional office based in New York .\n90min's content includes a wide variety of multimedia formats such as video, text, listicles, slideshows, social round-ups and interactive polls. The company's open technology platform allows other publishers to feature or embed its rich content. Outlets utilising 90min content include the Mail Online, The Independent, Huffington Post, USA Today and German sports site Ran.de, as well as a number of official Premier League club sites such as Chelsea , Liverpool and West Ham.\n90min monetizes through a combination of native, video and social advertising and produces customized content marketing campaigns for global advertising partners such as Paramount, Nike, Kia and Heineken.\nAsaf Peled , 90min Founder and CEO: \"We are very proud to have a top tier media group like ProSiebenSat.1 join us as a strategic investor and partner, in line with our expansion into video, sports rights and eventually digital TV. While 90min has been growing as a consumer brand, teaming up with ProSiebenSat.1 reflects the company's enhanced focus on strategic media partnerships driven by our open technology platform.\"\nZeljko Karajica, Chief Officer Sports Business ProSiebenSat.1 Media SE: \"We are excited to lead this investment round and partner with one of the world's largest football content platforms. It is a great strategic fit for our digital sports portfolio and we look forward to establishing 90min as a leading brand in Germany .\"\n©2015 PR Newswire. All Rights Reserved.", "external_links": ["http://photos.prnewswire.com/prnh/20151005/273769LOGO", "http://rt.prnewswire.com/rt.gif?NewsItemId=enUK201510021651&Transmission_Id=201510070900PR_NEWS_USPR_____enUK201510021651&DateId=20151007", "http://www.xmlnews.org/ns/"], "published": "2015-10-07T03:00:00.000+03:00", "crawled": "2015-10-08T03:55:07.528+03:00", "highlightTitle": ""}