{"organizations": [], "uuid": "e4ce9d06c2551db23bf9f23a4b286caa43260b5a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.southcoasttoday.com", "main_image": "http://www.southcoasttoday.com/storyimage/NB/20151021/SPORTS/151029769/AR/0/AR-151029769.jpg", "site_section": "http://www.southcoasttoday.com/sports/professional?template=rss&mime=xml", "section_title": "Pro sports - southcoasttoday.com", "url": "http://www.southcoasttoday.com/article/20151021/SPORTS/151029769/101091?rssfeed=true", "country": "US", "title": "Celtics: Terry Rozier, Jordan Mickey mum on Louisville stripper scandal", "performance_score": 0, "site": "southcoasttoday.com", "participants_count": 1, "title_full": "Celtics: Terry Rozier, Jordan Mickey mum on Louisville stripper scandal", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T01:00:00.000+03:00", "replies_count": 0, "uuid": "e4ce9d06c2551db23bf9f23a4b286caa43260b5a"}, "author": "Scott Souza @scott_souza", "url": "http://www.southcoasttoday.com/article/20151021/SPORTS/151029769/101091?rssfeed=true", "ord_in_thread": 0, "title": "Celtics: Terry Rozier, Jordan Mickey mum on Louisville stripper scandal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Oct. 21, 2015 at 5:00 PM By Scott Souza Posted Oct. 21, 2015 at 5:00 PM » Social News WALTHAM — A week before the first opening night of their respective NBA careers, Celtics rookies Jordan Mickey and Terry Rozier have found themselves linked to a national scandal involving their past. On Tuesday, an ESPN “Outside the Lines” report named both Rozier, who attended the University of Louisville, and Mickey, whom Louisville courted before he chose to play at Louisiana State University, as players who were allegedly involved in a recruiting process at Louisville that included offers of sex at on-campus housing. The allegations appear in the forthcoming book “Breaking Cardinal Rules: Basketball and the Escort Queen,\" in which 42-year-old Katina Powell alleges then-assistant Louisville coach Andre McGee offered to pay for recruits to have sex with escorts present at the parties, including two of Powell’s daughters. While the Louisville men’s basketball program, as well as Cardinals and former Celtics head coach Rick Pitino, have come under fire for what was charged to have taken place on their watch, Mickey and Rozier tried to distance themselves from the scandal following Wednesday’s practice. “My recruiting trip was four years ago,” Mickey said. “I, honestly, don’t remember it. I am here right now focused on Boston.” Rozier was the lone former player quoted in the ESPN story, saying: “I don't want to talk about it. ... I will say, though, Coach [Pitino], as far as the dorm situations and visits … he wouldn't know. ... I can say his nose is clean.\" On Wednesday, Rozier made clear that’s all he was prepared to say publicly about what was reported to have taken place in Kentucky. “I had a great time in my two years at Louisville,” he said. “I’m a Celtic now. That’s all I’m really worried about.” While Mickey and Rozier were not exactly revealing about any experiences they had at Louisville that may have corroborated or conflicted with the report, both rookies appeared confident and professional when facing the media for the first time since the ESPN story broke. “I really didn’t even watch the special (on Tuesday),” Mickey said. “I was getting ready to get a shooting session in before everyone else. I am just focused on my game right now, trying to prepare my body for the season and everything I need to do to get ready to play.” “I don’t allow it to be a distraction because I have a great support system,” Rozier offered. “I pay attention to what’s important to my life right now. That’s not really important to me. I am a Celtic. I am not a Cardinal. I am just moving on.” Celtics coach Brad Stevens expressed his “sadness” over the allegations. He said on Wednesday he has addressed the report with both players. “What I talked with them is that, I’m not here to figure out the allegations,” the coach said. “The allegations, to be honest, sadden me for a lot of reasons. What I’ve talked to them a lot about is the expectations of being a Celtic. What it means to represent yourself. What it means to represent this city, this team, and how important it is to do that well.” He added that anything that may have happened when Mickey and Rozier were teenage college recruits will not cloud his view on them as current Celtics. “I don’t want to get into judging based on those allegations,” Stevens said. “Those guys, since they’ve been here, have done everything we’ve asked them to do. Hopefully, they’ll continue to do that.” Thomas still sidelined Isaiah Thomas remained out of action on Wednesday with a leg contusion that forced him to miss Monday’s exhibition game against the Brooklyn Nets. Stevens said he has “no reason to believe” that Thomas will not be ready for the season opener. … David Lee (strep throat) and Jae Crowder (sprained thumb) returned to practice after also missing Monday’s game. Lee said he was winded at the end of the workout, but intends to return to action in Thursday’s exhibition game against the New York Knicks at TD Garden. By Scott Souza", "external_links": [], "published": "2015-10-22T01:00:00.000+03:00", "crawled": "2015-10-22T01:19:29.007+03:00", "highlightTitle": ""}