{"organizations": ["Blue Wahoos", "Saturdays Blue Wahoos", "UWF"], "uuid": "74f20bb038eeeae426c8352ccb6ecc6495371c22", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pnj.com", "main_image": "http://www.gannett-cdn.com/-mm-/fbc43be7a81b658ea45082dda655ac975f046339/c=0-380-4800-3080&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/07/Pensacola/B9319139602Z.1_20151007225742_000_GJLC5RKRR.1-0.jpg", "site_section": "http://rssfeeds.pnj.com/pensacola/sports", "section_title": "Pensacola - Sports", "url": "http://www.pnj.com/story/sports/2015/10/07/bubba-watson-presidents-cup/73561520/", "country": "US", "title": "Blue Wahoos’ Sayre has field set for football Saturdays", "performance_score": 0, "site": "pnj.com", "participants_count": 0, "title_full": "Blue Wahoos’ Sayre has field set for football Saturdays", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T06:40:00.000+03:00", "replies_count": 0, "uuid": "74f20bb038eeeae426c8352ccb6ecc6495371c22"}, "author": "", "url": "http://www.pnj.com/story/sports/2015/10/07/bubba-watson-presidents-cup/73561520/", "ord_in_thread": 0, "title": "Blue Wahoos’ Sayre has field set for football Saturdays", "locations": ["Fetterman Field"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sayre", "Bill Vilona", "Ray Sayre"], "text": "Blue Wahoos’ Sayre has field set for football Saturdays Bill Vilona, pnj.com 9:57 p.m. CDT October 7, 2015 Ray Sayre, director of sports turf management for the Blue Wahoos, stripes Fetterman Field at Blue Wahoos Stadium into a football field for Saturday’s Soul Bowl and UWF Football on Oct. 17. (Photo: Tony Giberson/tgiberson@pnj.com) \nRay Sayre doesn’t have to preach his quest, he lives it. \nThe field is his canvas. \nPart of the reward is praise and thanks he receives for making the playing surface at Blue Wahoos Stadium the best it can be. For the next two weeks, it will be a new challenge for Sayre, the Blue Wahoos’ director of sports turf management. \nSaturday’s 26th annual Soul Bowl youth football event, featuring five different age divisions in a full day of games, will be followed Oct. 17 by the University of West Florida intrasquad scrimmage. That will serve as a rehearsal of sorts for the Argos’ 2016 season debut at the stadium. \nBack-to-back football on the newly-named Fetterman Field. \n“The conversion has actually gotten easier,” said Sayre, as he completed a recent morning with his staff of mowing the outfield grass and getting the field primed for the football sidelines. “That first year (2012) we didn’t know what to expect as far as the event itself. \n“We kinda know the time frame a little bit better so it doesn’t take that long to do this step or that step. We’re not as big of a rush.” \nThe process takes about a week. Sayre has it down to a set timetable. Goalposts were installed Monday. Painting the sidelines, end zone areas and crossmarks were done Tuesday and Wednesday. The hashmarks and numbers will be painted Thursday. \nThe final phase is painting the infield area, which for now, is still dirt. \n“For us, the dress rehearsal was three years ago when we hosted the first Soul Bowl (in 2012),” said Sayre, who has earned the Southern League groundskeeper of year award the past three years. “I don’t think opening day for baseball is any more important than a game, say, on Aug. 17. \n“It is all the same to me. I want the field to be as good as it possibly can be every day. I don’t put in any less effort in the last game or the first game. \n“Now with UWF, I see it more on their end. It will be for them....realizing what it will take to get their equipment here, how long it will take, and where to set it all up. It will be more understanding what they need and how we can facilitate it.” \nSayre and his staff never stop caring for the field. It has been a year-round process, even with limited events in the off-season from baseball. The Blue Wahoos are hailed throughout minor league baseball for having one of the finest playing surfaces. \nThe field was constructed in 2012 by the Jerry Pate Company in Pensacola with its fast-draining irrigation system. Sayre and his staff have tried to ensure it maintains the same look as when it opened. \n“During home baseball games, I’ll get here early in the morning and I won’t leave until after 11 at night,” said Sayre, who earned a degree in turf management at Eastern Kentucky. “When we’re on the road, we’re working until it gets dark. But that’s all part of being in this business.” \nThe biggest task for football conversion at Fetterman Field is removing the pitcher’s mound. Sayre said the first year that process took several days. He’s got it whittled to five hours. \n“Now it is two guys, a shovel and a cart,” he said. “The only thing I have done to help is now before I build it back for baseball, I lay a tarp down. So that essentially if I get down to that tarp we are basically good to go. \n“I don’t have to get the mound down and work the dirt. Once I get to that tarp. we pull that tarp off and we are ready to go with football.” \nSayre doesn’t have control over the left fences, which were approved by the Community Maritime Park Associations last week to move back 17 feet and permanently anchored, along with moving back the foul pole. \nUWF is mulling for next year whether to pay for sodding the entire infield and covering all the warning track areas. If so, the most renown place to go for fast-placement sod is nearby Bent Oak Farm in Foley — the place where the NFL gets its playing surface each year for the Super Bowl when held in an outdoor stadium. \nSayre said college teams, including Alabama, Auburn and Florida State have purchased sod from Bent Oak. Varying price ranges exist. Sayre has been to the company’s farm several times. \nWhen the Blue Wahoos re-sodded their infield, Sayre said that’s where it came from. \n“There are different prices and it depends on what (UWF) have in their mind and what they think they can afford,” Sayre said. “But you could literally lay sod one day, and play on it the next day. It depends on how much you want to spend. But it’s already set to go. \n“If you’re just talking about the infield and warning track, it wouldn’t be hard at all and less expensive than the entire field. Their sod has different price ranges, depending on how quickly you need it ready.” \nThe more tedious process, Sayre said, is painting the field. The end zones will not be painted for the Soul Bowl or UWF’s scrimmage. But if the Argos desire next season to have end zone design and logos at midfield, it will take some planning. \n“That is more of a process,” he said. “When you say, paint end zones, what is going to look like? And there is a cost involved in all of it. But we have the people to do it.” \nFor this weekend, Sayre hopes for no rain, which will ease the preparation for back-to-back football weekends. He tries to make the infield area as smooth as possible. \n“The infield is a big challenge,” he said. “You get tackled on that and it can’t feel good. When that infield starts to dry out it gets harder. But the kids who have played in the Soul Bowl have been troopers. They get right back up. \n”It’s neat to see. We knew when the stadium was built, the idea was to play football here. We knew UWF might be playing here. It’s a multi-use stadium, so you need to have plan and we’ve been pretty good to having it all flow smoothly.” \nWANT TO GO? \nWHAT: Soul Bowl and UWF Football Scrimmage. \nWHEN: Soul Bowl is Saturday, beginning at 8 a.m. UWF football scrimmage is Oct. 17 at 11 a.m. \nWHERE: Blue Wahoos Stadium. \nADMISSION: General admission for Soul Bowl is $8 and includes the entire day of games. Early purchase tickets are $6 until Friday afternoon at stadium box office. Children under 5 will be admitted free. \nFree admission to UWF scrimmage on Oct. 17. \nFORMAT: The Soul Bowl will be a consecutive set of games beginning with the youngest age group (5-6 year-olds) through the oldest age groups (13-14). The UWF scrimmage on Oct. 17 is an instrasquad scrimmage between the Argos team. \nABOUT RAY SAYRE \nHOMETOWN : Lexington, Ky. \nCOLLEGE : Eastern Kentucky University graduate. \nBACKGROUND : Hired by the Blue Wahoos prior to the inaugural season. Worked as part of grounds crew for Louisville Bats, the Cincinnati Reds Triple-A affiliate. Also worked for Greenville Drive, the Class A affiliate for Boston Red Sox and Bowling Green Hotrods, Class A affiliate of Tampa Bay Rays. \nFAMILY : Wife, Amber. Daughter, Kharma, who has joined with her father in a couple guest appearances helping lead the grounds crew dance. \nHONORS: Sayre has been named the Southern League Groundskeeper of Year for past three years (2013-15). Read or Share this story: http://on.pnj.com/1Lj47Qi TOP VIDEOS", "external_links": [], "published": "2015-10-08T06:40:00.000+03:00", "crawled": "2015-10-08T07:16:22.786+03:00", "highlightTitle": ""}