{"organizations": ["Northwestern State", "NCAA", "Northwestern State Demons"], "uuid": "ed7650c779452c93afb0c64c1b63d4255dbd771f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theadvertiser.com", "main_image": "http://www.gannett-cdn.com/-mm-/19d37a05e660081cb25763b19df65e6d986f3564/c=0-240-2044-1395&amp;r=x633&amp;c=1200x630/local/-/media/2015/09/12/LAGroup/LafayetteLA/635776966205227210-TDA20150912ULNSU-021.JPG", "site_section": "http://rssfeeds.theadvertiser.com/lafeyettela/sports", "section_title": "Lafeyette LA - Sports", "url": "http://www.theadvertiser.com/story/sports/college/ul/2015/10/02/mcguire-tech-loss-like-all-our-dogs-had-died/73217632/", "country": "US", "title": "McGuire on '14 loss: 'It was like all our dogs had died'", "performance_score": 0, "site": "theadvertiser.com", "participants_count": 0, "title_full": "McGuire on '14 loss: 'It was like all our dogs had died'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T03:11:00.000+03:00", "replies_count": 0, "uuid": "ed7650c779452c93afb0c64c1b63d4255dbd771f"}, "author": "", "url": "http://www.theadvertiser.com/story/sports/college/ul/2015/10/02/mcguire-tech-loss-like-all-our-dogs-had-died/73217632/", "ord_in_thread": 0, "title": "McGuire on '14 loss: 'It was like all our dogs had died'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["McGuire", "Tim Buckley", "Paul Kieu", "Elijah McGuire"], "text": "McGuire on '14 loss: 'It was like all our dogs had died' Tim Buckley , tbuckley2@theadvertiser.com 7:11 p.m. CDT October 2, 2015 Buy Photo UL Ragin' Cajuns running back Elijah McGuire (15) runs through a Northwestern State Demons defender to score his first touchdown during the first half of an NCAA football game against Northwestern State at Cajun Field Saturday, Sept. 12, 2015. (Photo: Paul Kieu, The Advertiser) Buy Photo \nRUSTON — The scene, as described by those who were there, sounds downright funereal. \nUL had just lost 48-20 to in-state rival Louisiana Tech — on its own turf, Cajun Field, mind you — and no one with the Ragin’ Cajuns had a reason to be happy. \n“We hate losing at home,” offensive lineman Mykhael Quave said. \nLosing there to the Bulldogs, especially in the fashion they did, made it even worse. \n“A lot of guys took it hard,” UL linebacker Tyren Alexander said. “Really and truly, we let the game get out of hand.” \n“There was a black cloud over the locker room that night,” Quave added, “and it didn’t feel good. … We don’t want to have that same feeling again.” Cajuns finally back to a routine \nSo when UL visits Louisiana Tech on Saturday for another chapter in what really is a storied rivalry — one dating to 1910, when the Bulldogs won 75-0 — memory of that dark night still hangs overhead for the 1-2 Cajuns. \nReceiver Jamal Robinson, adding injury to insult, tore knee cartilage in the game and had to have surgery as a result. \nThe loss, however, hurt, Robinson much more. \n“I was upset,” he said. I really (was). I was really mad. Furious. \n“We didn’t play how we’re supposed to play. I just never saw us play like that as a unit. I just felt like that was the most-terrible game we ever played. \n“I was just hurt,” Robinson added. “I didn’t want to talk to my mom, my dad, my girlfriend. I was telling my dog, ‘Get away from me.’ I was just really mad that night. I didn’t want to talk to nobody.” UL's McGuire, Robinson respond to Hudspeth's challenge \nConsidering the way Cajuns running back Elijah McGuire was feeling, conversation with a canine would not have even been possible. \n“Everybody just looked depressed. … It was a bad feeling in the locker room,” McGuire said. “Nobody was talking, no music was playing. It was like all our dogs had died.” \nThe pain really was piercing, in part because of UL’s expectations, in part because of how things unfolded and in part as well because of the history of the series between the two institutions. \n“Honestly,” McGuire said, “I think we underestimated them just because we were favored by 14 points last year at home.\"", "external_links": [], "published": "2015-10-03T03:11:00.000+03:00", "crawled": "2015-10-03T04:08:27.339+03:00", "highlightTitle": ""}