{"organizations": [], "uuid": "eeb8dd76b2eaff2eb127ab0129b9473ca87f06bf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.qatarday.com", "main_image": "http://www.qatarday.com/timthumb.php?src=siteadmin/image/news/1445178525.jpg&h=315&w=600&zc=0", "site_section": "http://www.qatarday.com/news-category.php?name=sports", "section_title": "Sports | News | Qatar Day", "url": "http://www.qatarday.com/news/sports/qatars-attiyah-clinches-11th-fia-middle-east-rally/26474", "country": "CA", "title": "Qatar's Attiyah clinches 11th FIA Middle East Rally title with ninth win in Jordan meet; Kuwari and Salem grab podium finish | Sports", "performance_score": 0, "site": "qatarday.com", "participants_count": 1, "title_full": "Qatar's Attiyah clinches 11th FIA Middle East Rally title with ninth win in Jordan meet; Kuwari and Salem grab podium finish | Sports | News | Qatar Day", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "eeb8dd76b2eaff2eb127ab0129b9473ca87f06bf"}, "author": "Gulf Today", "url": "http://www.qatarday.com/news/sports/qatars-attiyah-clinches-11th-fia-middle-east-rally/26474", "ord_in_thread": 0, "title": "Qatar's Attiyah clinches 11th FIA Middle East Rally title with ninth win in Jordan meet; Kuwari and Salem grab podium finish | Sports", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Qatar’s Nasser Saleh Al Attiyah confirmed his 11th FIA Middle East Rally Championship (MERC) title in 13 years with an emphatic start-to-finish victory in the Jordan Rally, round six of the series, which finished with the stunning backdrop of the Dead Sea on Saturday.\nThe Qatari and his French co-driver Matthieu Baumel won 18 of the 21 gravel special stages that are some of the most beautiful and demanding in the world. His ninth victory in Jordan also marked a 59th career MERC win to put him just one success away from equalling the 60 victories achieved by Dubai’s Mohammed Bin Sulayem between 1984 and 2002. The winning margin for his fourth successive victory in the Hashemite Kingdom was a massive 29min 31sec.\nIt was also MERC win number eight for Matthieu Baumel, who duly overtook Jordan’s Khaled Zakaria to become the fifth most successful regional co-driver in history.\n“I was happy because Yazeed (Al-Rajhi), Abdulaziz (Al-Kuwari) and Khalid (Al-Suwaidi) were back and pushing today,” said Attiyah.\n“I did what I had to do. Today, in the morning, I won all five stages. I was driving on the same pace as yesterday. No slowing and no risks.\n “Yesterday I chose soft tyres for the first five stages and today I used harder tyres on the front and soft on the rear. The problem with the soft is a lot of movement and it does not suit the stages especially on the later stages. But this is another fantastic win for me and another Middle East Championship title. I am very happy,” he added.\nThe Qatari, who clinched the FIA World Cup in Morocco last week and could add the WRC 2 title to his trophy cabinet in Spain next Sunday, was in a class of his own. But a fierce battle waged over the closing stages for the runner-up spot.\n“It was important to me to finish in at least the top three for the sponsors,” said Kuwari. “I was not happy with my performance here, especially with the older tyres I have been using. But it’s a good finish after the problems I faced.”\nIt was fitting that an all-Jordanian team was on the podium and a delighted Husam Salem and co-driver Nancy Al-Majali held on to confirm a second successive victory in Group N and take third overall in their Mitsubishi Lancer Evolution IX. It was the first podium finish for an all-Jordanian crew since Ameer Al-Najjar and Nicola Fanous finished third in 2008.\n“The first stage I did not have the confidence and nor the second either,” admitted Sulem. “We change a little the set-up for the third one and it was better. The Baptism stage was excellent for us. I hit the water splash too hard in Baptism and it loosened the sump guard and hit the radiator. But the goal at the start was a podium and we achieved that, so I am happy.”\nKhaled Juma has already confirmed the Jordanian national rally title in his Mitsubishi Lancer Evolution VII and he and Faris Al-Tal finished the international in fourth and second in Group N. Ihab Al-Shorafa and Rakan Khair were fifth.\n ", "external_links": [], "published": "2015-10-18T03:00:00.000+03:00", "crawled": "2015-10-20T20:12:38.613+03:00", "highlightTitle": ""}