{"organizations": [], "uuid": "2ab0f5a4ad159781f869da6e767ae830cb1279f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nashuatelegraph.com", "main_image": "http://nashuatelegraph.com/csp/cms/sites/Telegraph/assets/images/icons/TeleT-icon200x200.gif", "site_section": "http://feeds.nashuatelegraph.com/news/full\r", "section_title": "Nashuatelegraph.com: Local News, State News, Business News, Sports News | Web Feeds", "url": "http://www.nashuatelegraph.com/news/1072028-469/program-targets-bear-human-conflict.html", "country": "US", "title": "Program targets bear-human conflict", "performance_score": 0, "site": "nashuatelegraph.com", "participants_count": 1, "title_full": "Program targets bear-human conflict", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T14:19:00.000+03:00", "replies_count": 0, "uuid": "2ab0f5a4ad159781f869da6e767ae830cb1279f1"}, "author": "onlineeditor@nashuatelegraph.com (The Nashua Telegraph)", "url": "http://www.nashuatelegraph.com/news/1072028-469/program-targets-bear-human-conflict.html", "ord_in_thread": 0, "title": "Program targets bear-human conflict", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Please sign up for as low as 36 cents per day to continue viewing our website. \nDigital subscribers receive Unlimited access to all stories from nashuatelegraph.com on your computer, tablet or smart phone. Access nashuatelegraph.com, view our digital edition or use our Full Access apps. Get more information at nashuatelegraph.com/fullaccess Sign up or Login LYNDEBOROUGH - The photo of a mama bear and five cubs would have seemed charming if you didn't know what all that fertility meant. Someone had fed the mother bear, causing her to have more babies than natural - more cubs than is healthy for her or for them. That photo and another one of a dead bear inside a house - shot by the homeowner, its blood mixing with the bird food that attracted it - were part of a state Fish and Game Department slide presentation on black bears shown at Lyndeborough's J.A. Tarbell Library. Both pictures show what can happen when humans behave in ways that are bound to increase bear-human conflicts - conflicts that seldom result in good outcomes for the bear. The mother bear had given birth to too many cubs because a man in Wentworth had been dumping hundreds of pounds of birdseed for bears to eat, said Dennis Walsh, a state Fish and Game Department volunteer wildlife steward. Other people are inadvertently feeding bears when they leave their birdfeeders out after April 1 or when they leave unsecured garbage cans in their yards. \"Once bears smell black oil sunflower seeds, they never forget it\" and keep going back for more, Walsh said. With New Hampshire's population rising fast and 17,000 acres of fields and forest lost to development each year, people and bears are in conflict, much of it avoidable. Fish and Game tries to deal with those conflicts, Walsh said, but with more bears and less room for them, they are inevitable, and are the fault of humans, Native black bears are a perpetually hungry, omnivorous creature, and they will go where the food is and teach their cubs to haunt garbage cans - \"Bears' five-star restaurants,\" Walsh said - and birdfeeders. Fish and Game would like to reduce the bear population, he said. Now there are about 5,700 animals, which is about 700 more than desirable in terms of human-bear conflicts. And he dispelled some of the misconceptions about the state's biggest mammal. First, they aren't as big as most people think - typical males are 250 pounds and females 150, though they can go up to 500 and 300 pounds, respectively. They aren't real hibernators, like chipmunks, and don't necessarily sleep the winter in caves. They will often hole up casually in rock overhangs or under blown-down trees, or just lie down and let the snow cover them. They also have reproductive systems that prevent females from having more cubs than they can nourish. \"Nature doesn't let her have babies if there is not enough food,\" and if she isn't heavy enough - around 150 pounds, Walsh said - the fetus will be absorbed into her system. Walsh and Doug Whitfield give the free presentations as part of Fish and Game's Wildlife Restoration program. This was their second program at the Lyndeborough public library - last spring, they presented one on bobcats in New Hampshire. Kathy Cleveland can be reached at 673-3100 or kcleveland@nashuatelegraph.com. Top Jobs", "external_links": [], "published": "2015-10-11T14:19:00.000+03:00", "crawled": "2015-10-11T14:15:49.483+03:00", "highlightTitle": ""}