{"organizations": [], "uuid": "adf7522d0c9de4363b191da55c98012f0314d17c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/1/164/161266/Egypt/Egypt-Elections-/Egypts-parliamentary-elections-Smooth-first-day,-t.aspx", "country": "EG", "title": "Egypt's parliamentary elections: Smooth first day, 'too early to judge turnout' - Egypt Elections 2015 - Egypt", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Egypt's parliamentary elections: Smooth first day, 'too early to judge turnout' - Egypt Elections 2015 - Egypt - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "adf7522d0c9de4363b191da55c98012f0314d17c"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/1/164/161266/Egypt/Egypt-Elections-/Egypts-parliamentary-elections-Smooth-first-day,-t.aspx", "ord_in_thread": 0, "title": "Egypt's parliamentary elections: Smooth first day, 'too early to judge turnout' - Egypt Elections 2015 - Egypt", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Independent candidates steal the show in Alexandria's parliamentary vote Egypt cabinet orders half-day off Monday for state employees on 2nd voting day Day 1 of parliament voting smooth; PM declares Monday a half-day for state workers Polling stations have closed their doors at 9pm Sunday on the first day of Egypt’s long-awaited 2015 parliamentary elections after a slow but smooth start to polling.\nAbdullah Fathi, head of the Judges' Club - an unofficial but powerful body that represents the majority of Egypt's judges - told Al Hayat TV that the club's reports of polling station monitoring labelled the vote turnout \"clearly and unjustifiably weak.\"\nFathi said there were \"no violations, breaches or quarrels,\" before adding jokingly \"nor even voters.\" He said the turnout was low compared to previous polls but did not supply figures.\nYosry El-Azabawy, a researcher at Al-Ahram Center for Political and Strategic Studies, told Ahram Online that although today's turnout might be disappointing, it is too early to judge the wider turnout of these elections.\n\"We must not generalise, not before the run-offs and the second stage of elections. A larger segment of Egyptians will vote in the second stage.\"\nJudge Omar Marawan, official spokesperson of the High Elections Committee (HEC), criticised media reports on the turnout on Sunday, Al-Ahram Arabic news website reported.\n“Those percentages are false and some media outlets reported our samples as the [actual] turnout,” said Marawan in a press conference at the HEC headquarters.\nEarlier on Sunday the HEC announced that the number of voters casting their ballots electronically had reached 624,000, or 2.27% of all registered voters.\nAccording to an earlier statement by the HEC, 1,500 polling stations are currently equipped with electronic card readers, up from 200 in the 2012 presidential elections.\nThe parliamentary elections, which got underway on Saturday as voting opened for foreign-based Egyptians and whose first stage runs across Sunday and Monday, is the last step in the political roadmap set out two years ago following the popular ouster of Islamist president Mohamed Morsi.\nEgypt's cabinet announced late on Sunday that state employees will have half of Monday off work as the first stage of voting continues. Judge Marawan announced late Sunday evening that the HEC said that the Committeee would allow eligible voters who hold an expired national ID card to cast ballots.\nOn Saturday, Egyptian president Abdel-Fattah El-Sisi called \"all Egyptians to actively participate\" in the elections, adding that he wants to see Egyptian youth at polling stations as they are \"the main driving engine,\" as well as Egyptian women, \"the national icon for sacrifice\".\nOmar Maarwan of the HEC said at a press conference early on Sunday afternoon that the number of women voters so far has been “four times greater” than that of men.\nMarawan, who is in charge of the polling process, added that the 60-plus age group was the most represented group while 18 to 21-year-olds were the least .\nWafaa Hassan Refaat, a 69-year-old retiree in the Sheikh Zayed district in the outskirts of Cairo, told Ahram Online that she came to vote because it is a \"national duty.\" She is upset at the lack of young people at the polling stations, describing them as “lazy”.\n“Young people must wake up before they regret it,” Refaat said.\nIt is too early to gauge vote turnout, but for those who do cast ballots, their tendencies are clear, says El-Azabawy.\n\"The [Salafist] Nour Party obviously dominates the West Delta governorates like Alexandria and Beheira while the For the Love of Egypt lists are expected to dominate in Upper Egypt,\" he said.\nIn Alexandria, where observers have said turnout was also low, the electoral scene is dominated by the many independent candidates running there, in addition to a noticeable Salafist presence in the form of the Nour Party, with no major left-wing or revolutionary presence.\nThe country’s left-wing political forces appear skeptical about this final stage in the post-Morsi political roadmap and remain divided by a range of issues.\nA lack of unity has undermined their efforts to contest the elections, with many from their ranks cynical about the impending parliament's ability to effect change, and consequently choosing not to run.\nMinimal security issues\nThe first day of elections day had a smooth start amid tight security.\nIn the only reported act of violence unidentified assailants opened fire from a four-wheel drive vehicle, shooting at security forces deployed at a polling station in Al-Ayat, Giza.\nThe forces responded by firing back at the vehicle, which then flipped over. The gunmen escaped and no injuries were reported, according to Al-Ahram.\nDefence minister Sedki Sobhi and interior minister Magdy Abdel-Gaffar visited a number of polling stations in Giza to check on the security situation. The ministers praised measures taken by security forces deployed to secure the polling process.\n\"Upper Egypt is more stable and calmer than expected,\" El-Azabawy said. He attributes this to Upper Egypt's family system.\nNevertheless a small bomb was defused near a primary school being used as a polling station in Fayoum in Upper Egypt, according to state-owned news agency MENA. No casualties were reported.\nThe interior ministry announced on Friday that some 120,000 policemen and central security forces will safeguard Egypt's 18,945 polling stations. They will supplement the 185,000 army personnel deployed around polling stations during the voting on Sunday and Monday.\nThe army announced on Saturday that 76,000 military personnel from the army's central command area in Cairo will help provide security for voters, judges and monitors in the Upper Egypt governorates.\nThe 14 governorates included in this first stage of voting are: Giza, Fayoum, Beni Suef, Minya, Assiut, New Valley, Sohag, Qena, Luxor, Aswan, Red Sea, Beheira, Alexandria and Marsa Matrouh.\nVoters in the remaining 13 governorates will head to the polls on 22-23 November.\nAfter appeals and presidential appointments, the parliament is expected to be formed in early December.\nThe total number of polling stations for this year's elections is 11,000.\nThe country has been without a parliament since the previous house, elected in late 2011, was dissolved in June 2012 after a court ruled key electoral laws to be unconstitutional. President El-Sisi currently holds legislative powers.", "external_links": [], "published": "2015-10-18T03:00:00.000+03:00", "crawled": "2015-10-19T08:19:44.546+03:00", "highlightTitle": ""}