{"organizations": ["NHL"], "uuid": "cc42d13c512ba399fb10a542e07b38d3c210c90b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.torontosun.com", "main_image": "http://storage.torontosun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297758165326_LARGE_BOX.jpg?quality=80&stmp=1444337186550&size=100x", "site_section": "http://www.torontosun.com/sports/rss.xml", "section_title": "Top Sports stories", "url": "http://www.torontosun.com/2015/10/08/predicting-the-nhls-next-norris-trophy-winner", "country": "CA", "title": "Predicting the NHL's next Norris Trophy winner [Video]", "performance_score": 0, "site": "torontosun.com", "participants_count": 0, "title_full": "Predicting the NHL's next Norris Trophy winner [Video]", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T23:23:00.000+03:00", "replies_count": 0, "uuid": "cc42d13c512ba399fb10a542e07b38d3c210c90b"}, "author": "", "url": "http://www.torontosun.com/2015/10/08/predicting-the-nhls-next-norris-trophy-winner", "ord_in_thread": 0, "title": "Predicting the NHL's next Norris Trophy winner [Video]", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NHL stars discuss the league's toughest goalie to beat \nDoughty. Hedman. Karlsson. Keith. Weber. \nWhen it comes to predicting who will win the Norris Trophy, the list of candidates is small and exclusive. But when the NHL’s top forwards were asked which defenceman they would least like to face in a one-on-one situation, a different name kept coming up. \n“Chara,” said Detroit’s Tomas Tatar. “Too big, too strong.” \n“Chara is tough, just because of his seven-foot reach,” agreed Tampa Bay’s Steven Stamkos. “He’s a guy that always makes it difficult.” \nZdeno Chara won a Norris Trophy in 2009 and was the runner up in two years ago, but he is no longer considered amongst the favourites for the award. Some of that is because his point totals (eight goals and 20 points in 63 games last season) are not what they once were. But the bigger factor has to do with age. \nThe Big Z is two years away from turning the Big Four-Oh. \n“I’m really sick of people talking about my age and how many years is he going to play,” said the 38-year-old Chara, who could miss the start of the season with an upper-body injury he suffered in the pre-season. “To me, honestly, it’s a number. I know it’s easy to say, ‘It’s just a number,’ but I’m really motivated to play in this league. I always felt that people should be counting different things, other than just years. \n“They should come in the summer and count how many days I work out, how hard I work to be in the shape I want to be in.” \nWith Dougie Hamilton traded to Calgary and Dennis Seidenberg on the shelf for maybe another month, more pressure will be put on Chara to carry the defensive load. But the Bruins say they are not worried. After all, Chara logged more than 23 minutes per game last season. \nAnd while Father Time is going to be catching up to him sooner rather than later, remember that Nicklas Lidstrom won his last two Norris Trophies when he was 38 and 41. \n“They say he’s lost a step? I wouldn’t say that,” said Bruins goaltender Tuukka Rask. “He works so hard to keep up. I’m sure he’s going to be stronger this year and prove people wrong.” \nWhile Chara is looking for his second Norris Trophy, Los Angeles’ Drew Doughty, Tampa Bay’s Victor Hedman and Nashville’s Shea Weber are trying to win their first — a surprise considering just how dominant they have been during their careers. \n“I think Doughty’s finally going to win one,” said New Jersey Devils goaltender Cory Schneider. \n“Victor is a beast,” said Daniel Sedin. “I think he’ll be really good this year.” \nMeanwhile, Ottawa’s Erik Karlsson and Chicago’s Duncan Keith are both eyeing their third awards. In other words, Chara has his hands full. \n“Obviously Erik Karlsson is going to have a good season points-wise,” Chara said of last year’s Norris Trophy winner, who led defencemen with 66 points. “So is Duncan Keith. That’s a tough one. That’s really tough to pick.” Poll Who's your Norris Trophy pick? Chara", "external_links": [], "published": "2015-10-08T23:23:00.000+03:00", "crawled": "2015-10-08T23:58:30.439+03:00", "highlightTitle": ""}