{"organizations": [], "uuid": "a541820ff745aaa216545c7374f17aebf139966e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "highschoolsports.lehighvalleylive.com", "main_image": "http://hssn-media.advance.net/PennLive.com/news/82d53d561f1a4548baa9cba6c0d12372/thornton4.jpg", "site_section": "http://blog.lehighvalleylive.com/lehighvalleylive_high_school_sports_homepage_feed/atom.xml", "section_title": "lehighvalleylive.com High School Sports", "url": "http://highschoolsports.lehighvalleylive.com/news/article/-9129566988472015190/jake-thornton-turning-into-master-of-the-veer-for-belvidere-football/", "country": "IL", "title": "Jake Thornton turning into master of the veer for Belvidere football", "performance_score": 0, "site": "lehighvalleylive.com", "participants_count": 0, "title_full": "Jake Thornton turning into master of the veer for Belvidere football", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T08:44:00.000+03:00", "replies_count": 0, "uuid": "a541820ff745aaa216545c7374f17aebf139966e"}, "author": "", "url": "http://highschoolsports.lehighvalleylive.com/news/article/-9129566988472015190/jake-thornton-turning-into-master-of-the-veer-for-belvidere-football/", "ord_in_thread": 0, "title": "Jake Thornton turning into master of the veer for Belvidere football", "locations": ["Belvidere"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jake Thornton"], "text": "Jake Thornton makes running Belvidere’s veer offense look so, so easy. \nBut it doesn’t come easy. \n“It takes lots and lots of practice,” said fullback Zack DeLuca with the kind of weariness that comes from mass repetitions of simple elements all week before the fun starts Friday. \nThen DeLuca added, “But I love it.” \nAfter Friday it was easy to see why. Junior quarterback Thornton and the veer had fun this Friday – lots of fun. \nThe County Seaters’ offense zipped over, under and through visiting Roselle Park for a 33-14 Mid-State 38 Valley Division triumph in what everybody at Belvidere called a “must-win” game beforehand. \nSometimes the quarterback can get too much credit for offensive success, but Friday wasn’t one of those times. \nThornton controlled the Belvidere veer – an old-fashioned option-ish/power-ish tight-formation offense that had its heyday in the 1960s and 1970s at the University of Houston with coach Bill Yeomans, and has somehow hung on ever since in pockets of northern New Jersey – like a master engineer flicking switches on a well-oiled machine. \nBelvidere coach Josh Costantino knows the importance of Thornton. \n“As he goes, we go,” Costantino said. “And he goes.” \nThornton went for three touchdowns Friday night – running for one on a 45-yard romp that was pure veer, and completing TD passes of 65 yards to senior tight end Jordan Allen and 5 yards to senior halfback Tommy Madeo . Thornton ran for a game-high 108 yards and went 3-for-6 passing for 76 yards. \n“If that’s not the best game I’ve ever had, it’s up there,” Thornton said. \nThornton’s improvement as chief engineer of the veer has come both mentally and physically as he gains experience. He played a bit of quarterback as a sophomore, but as he has found his legs as junior so have the Seaters (3-2), who have won three in a row after a 0-2 start. \nPhysically, the veer’s system of complicated fakes and misdirection can, if poorly executed, baffle those who run it as much as those who defend it. But Thornton’s Friday fakes often left Panthers defenders in a miasma of confusion wondering where the ball was and finding out too late. \n“(Belvidere offensive coach Bob) Merle Sr. favors a long ride on the handoff; he wants me to go into the line with the ball and the halfback before I pull the ball out,” Thornton said. “The defenders bite on the halfback and that leaves the perimeter open, and that’s what happened on my touchdown run.” \nThornton’s fake froze Roselle Park as he romped around the right side and found another gear to blaze through the Panthers secondary for the score. \n“Jake runs a sub 4.5 40,” senior right tackle Nate Baylor said. “When he gets the corner, he’s gone.” \nIf that play showed off Thornton’s physical skills and talent, his mental acuity for the offense showed all night. \n“As I get more and more comfortable with the offense I can tell Coach Merle what I am seeing and what plays I think will work against the defense,” Thornton said. “I can see what the defense is giving us and have a couple of different options.” \nThornton makes running the veer look easy – but it’s only because of his physical and mental maturity and hard work that it happens at all. It’s hard. \nBut Thornton doesn’t make it look that way -- except on opponents.", "external_links": [], "published": "2015-10-10T08:44:00.000+03:00", "crawled": "2015-10-11T02:21:54.535+03:00", "highlightTitle": ""}