{"organizations": ["Loyola Academy", "Hickory Point Golf Club", "Wheaton Warrenville South", "Redwings", "Wildcats", "Red Devils", "Tigers"], "uuid": "d87f0326c0d8a88ea9cac425f6e9d5ed8c5519f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailyherald.com", "main_image": "http://www.dailyherald.com/gfx/site/logos/dailyherald_marble_300.jpg", "site_section": "http://www.dailyherald.com/rss/rss.asp?section=sports_pro_football", "section_title": "DailyHerald.com  > sports_pro_football", "url": "http://www.dailyherald.com/article/20151017/sports/151018843/", "country": "US", "title": "Yuen falls 1 stroke short of 3-peat", "performance_score": 0, "site": "dailyherald.com", "participants_count": 0, "title_full": "Yuen falls 1 stroke short of 3-peat", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T06:00:00.000+03:00", "replies_count": 0, "uuid": "d87f0326c0d8a88ea9cac425f6e9d5ed8c5519f6"}, "author": "", "url": "http://www.dailyherald.com/article/20151017/sports/151018843/", "ord_in_thread": 0, "title": "Yuen falls 1 stroke short of 3-peat", "locations": ["Rochester", "Metea Valley", "Hinsdale Central", "St. Charles North", "Decatur", "Rockford Guilford", "Neuqua Valley"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Lauren Beaudreau", "Kevin McGavinDaily", "Mike Bremner", "Sarah Hauenstein", "Jessica Lee", "Maddie Hunt", "Annalee Dannegger", "Art Tang", "Pettersen", "John Keller", "Yuen", "Benet", "Morgan Savage", "Desai", "Emma Field", "Katelyn Kline", "Jessica Yuen", "Madasyn Pettersen"], "text": "By Kevin McGavinDaily Herald Correspondent Just like her freshman year three years ago, Jessica Yuen came tantalizingly close to winning the Class AA girls golf championship Saturday north of Decatur. But after consecutive state triumphs during her middle two campaigns, the Neuqua Valley senior had her senior season end a shot shy of a potential third title. \"I told many people that win or lose, I would be happy with all my accomplishments during high school career,\" Yuen said after a bogey on the final hole enabled Rockford Guilford sophomore Madasyn Pettersen to win with twin level-par 72 rounds. \"There was nothing more I could have done to play better. (Pettersen) is a great player. I knew that was it (when Pettersen, her playing companion, parred No. 18).\" The Missouri-bound Yuen tied for runner-up for the second time at Hickory Point Golf Club when Hinsdale Central junior Jessica Lee, who led the Red Devils' completion to their perfect season, also came home with a two-day 145 total. \"I thought it was a perfect shot,\" Neuqua Valley coach John Keller said of the approach Yuen hit on the par-4 last hole. \"(The third shot) was impossibly fast. Obviously, she didn't make the comebacker.\" Benet freshman Lauren Beaudreau, who defeated Yuen at the Wildcats' sectional on Monday in a sudden-death playoff for medalist honors, was also right there. But the Redwings' sensation had to settle for fourth after back-to-back bogeys to conclude her day. \"I thought she played great,\" Benet coach Mike Bremner said. \"Unfortunately, she couldn't get that one big birdie putt to drop.\" As Hinsdale Central had few issues in denying Loyola Academy by 18 shots to win its second straight title, the final day of the season proved historic for Wheaton Warrenville South. In their ninth state appearance since 1999, the Tigers captured state hardware for the first time with their 7-shot triumph over St. Charles North for third. Sarah Hauenstein, Annalee Dannegger, Emma Field and Priya Desai were between 78 and 84 for the Tigers, who finished with a 640 total to the North Stars' 647. \"They really deserved that trophy,\" WW South coach Art Tang said of his squad bettering its finish by one spot from a year ago. \"The girls played really hard. They played smart the whole weekend.\" Metea Valley senior Katelyn Kline finished in a third-way tie for sixth place to conclude her fourth straight state appearance. At the Class A tournament in Decatur, IC Catholic Prep junior Maddie Hunt birdied both playoff holes to defeat Rochester senior Morgan Savage for individual gold. Share this page", "external_links": [], "published": "2015-10-18T06:00:00.000+03:00", "crawled": "2015-10-18T07:22:19.453+03:00", "highlightTitle": ""}