{"organizations": [], "uuid": "2a6da8b0c7618c9d4067517d2b4c03a4c4f7d1b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.morningsun.net", "main_image": "http://www.morningsun.net/Global/images/head/nameplate/ks-pittsburg_logo.png", "site_section": "http://www.morningsun.net/sports?template=rss&mime=xml", "section_title": "Sports - Morning Sun", "url": "http://www.morningsun.net/article/20151024/SPORTS/151029917/2000/NEWS?rssfeed=true", "country": "US", "title": "Know Deer Laws.. and Your Rights", "performance_score": 0, "site": "morningsun.net", "participants_count": 1, "title_full": "Know Deer Laws.. and Your Rights", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T05:49:00.000+02:00", "replies_count": 0, "uuid": "2a6da8b0c7618c9d4067517d2b4c03a4c4f7d1b4"}, "author": "Larry Dablemont", "url": "http://www.morningsun.net/article/20151024/SPORTS/151029917/2000/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "Know Deer Laws.. and Your Rights", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Know Deer Laws.. and Your Rights Comment Posted Oct. 24, 2015 at 10:49 PM By Larry Dablemont Posted Oct. 24, 2015 at 10:49 PM Pittsburg, Kan. The lady seemed amused by it all. “He came to my door several days after I killed a deer with a bow. I called it in the way I am suppose to,” she told me. “He said he wanted me to show him my bow, and prove I could really shoot it. Can you imagine that, at the beginning of the deer season and all he’s got to do is come and see if I can shoot my bow?” She took her bow and drilled the target behind her home. She said he walked away disappointed, while not uttering a single word! No one has to show an agent where they hunt or if they can shoot, no one is required by law to go out after they report a legal kill and show an agent where they killed and cleaned their deer, no one is required to open a freezer for an agent or show him antlers unless he has a search warrant. If any agent threatens to arrest you if you do not consent to letting him search your property or enter your home, he is violating your constitutional rights. They have done so in many instances and they get away with such a tactic. The two who came into a ladies home a couple of years ago, took her pet raccoon out and killed it, gained entry to her home by threatening to take her to jail if she refused them entry. If it happens to you, close and lock your door and call the highway patrol or the sheriff’s office and tell them what is happening. Last year I had two sets of conservation agents come to my place and spend about 3 hours each time, trying to figure out how to arrest me for things I had written. I had written about shooting a buck in their “four point” region, where a buck must have four points of one inch or longer in order to be legal. I truthfully said that when I shot him, I had no idea how many points he had and I didn’t care. I have no interest in “trophies”. One antler was very deformed and the other had a broken tine, which would have been three or four inches long. You couldn’t possibly see and measure that tine at the 90 or 100 yards distance at which I shot him. I wrote as much. That broken tine measured about 15-16ths of an inch measured one way, 17/16ths of an inch measured another way. The two MDC agents called me out on my porch and demanded that I show them the antlers of that deer I had killed ten days before. Page 2 of 2 - At that point I could have told them that I had discarded the antlers or I could have told them they were in the shed and they could see them with a search warrant. That would have been the end of it. But I told them the truth. The antlers, an odd set because of the deformed side, had been given to a taxidermist friend in Joplin Missouri. So at their insistence, two of the agents from the Joplin area went to the taxidermist to photograph the antlers, and spent a couple of more wasted hours. Those agents told the supervisor that the whole thing was a waste of time. There’s not enough space here to say all I would like to say about this subject. Please see more about this by going to my site on the internet…. larrydablemontoutdoors.blogspot.com By Larry Dablemont", "external_links": [], "published": "2015-10-25T05:49:00.000+02:00", "crawled": "2015-10-25T10:21:18.787+02:00", "highlightTitle": ""}