{"organizations": [], "uuid": "6a4f5e46435e52c0414de349304464900ce464ac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.local8now.com", "main_image": "http://gray-uploads.s3.amazonaws.com/captures/E83/908/E83908D614954DCCAEA925113E21ECD8", "site_section": "http://www.local8now.com/sports/headlines/index.rss2", "section_title": "WVLT Sports Overtime", "url": "http://www.local8now.com/sports/headlines/Jones-Vols-talk-Bama-Derrick-Henry-and-momentum-334368071.html", "country": "US", "title": "Jones, Vols talk Bama, Derrick Henry and momentum", "performance_score": 0, "site": "local8now.com", "participants_count": 0, "title_full": "Jones, Vols talk Bama, Derrick Henry and momentum", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T02:13:00.000+03:00", "replies_count": 0, "uuid": "6a4f5e46435e52c0414de349304464900ce464ac"}, "author": "", "url": "http://www.local8now.com/sports/headlines/Jones-Vols-talk-Bama-Derrick-Henry-and-momentum-334368071.html", "ord_in_thread": 0, "title": "Jones, Vols talk Bama, Derrick Henry and momentum", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jones, Vols talk Bama, Derrick Henry and momentum Updated: Mon 7:13 PM, Oct 19, 2015 / Article More Video... \nKNOXVILLE, Tenn. (release) -- Tennessee Football looked ahead to Saturday's showdown with Alabama in its Monday press conference. \n(Opening statement)\"The term that comes to my mind after watching Alabama on video is impressive. They are an impressive football team. I think the statistics and their body of work speaks for themselves. When you talk about them, first of all defensively, they are first in total defense in our conference and I believe sixth overall in the country. They are first in rush defense, giving up only 70 yards per game. They're only giving up 16.7 points per game. The thing that is impressive is their 16 takeaways and four of those have resulted in touchdowns. They lead the conference with 12 interceptions, and they are No. 1 in our conference in pass defense efficiency. When you look at a defense, a lot of times, they may be No. 1 at one end of the categories, in terms of running the football, but then on pass, it's another element. With them, they are a very balanced defense. They are very disruptive. Offensively, they average about 200 yards rushing per game. They have only given up eight sacks. We all know about Derrick Henry. He is a great back, but they have play makers. They have individuals on their football team from the tight end position to the wide receiver position that probably don't get as much credit as they deserve. They're a top-10 opponent and a great football team. It's also a great opportunity for our football team going on the road in a great environment.\" \n(On difference in Alabama's play between the beginning of the season to now)\"First of all, they turned the football over a lot, which is very uncharacteristic of them, in the Ole Miss game, so that created many opportunities for Ole Miss, and they did a good job of taking advantage of those opportunities. There has been a high, high level of consistency in their play. They are playing the same way they had been. They are just taking care of the football better, and they are playing with a lot of confidence now. I believe they are on a four-game winning streak, with two of those being against [top-10 opponents on the road]. They have a ton of confidence right now and deservedly so.\" \n(On the overall health of the football team)\"The bye week occurred at the appropriate time. We fully anticipate everyone back. I'll know a little bit more today when we practice. Jason Croom is still out, so he will not be available for the Alabama game, but everyone else, we fully anticipate being ready to go, but I'll know a little bit more health-wise Wednesday.\" \n(On Jacob Coker)\"I think he's playing winning football. He's managing their offense. They are playing to his skill set. I thought the past couple of weeks he's been able to make plays with his legs when the pocket collapses. He's doing a good job of managing it. I think they do a great job of creating one-on-one match-ups out on the perimeter with their wide receivers. Again, benefitted by a very very talented offensive line, big, physical. Two very very solid, two very good running backs. So he has a lot of individuals around him. He's managing their offense and performing very well. He's preforming at a high level. I see a confidence in him, and it shows.\" \n(On resetting any areas during the bye week)\"Not something different, just continuing to improve on our fundamentals and our details. Really no secret, we have to be a much better tackling football team. It's all about wining your space, winning your area. That's what spread offenses do to you is they force one-on-one matchups, not only just in the pass game, but in the tackling game. So being a much better efficient, tackling defense. More turnovers, more takeaways. It's all about impacting the quarterback, and you can impact the quarterback more than just sacks. It's hits on the quarterback. It's batted footballs. The other element or area we talk about it is generated penalties, forced penalties. Great defensive line man in their strain and their effort to get to the quarterback generate holding penalties. With movement, you generate chop-blocks, all those things. We've really focused on the fundamentals and the fine-details. Offensively, I believe we're up with 18 explosive runs of 20 yards or more as compared to 11 this time last year. So we've done some very good things offensively. I think if you look where we were a year ago at game six, I think John wrote an article about that, is the monumental difference in terms of big plays, our scoring output, protecting the passer, all those things. But it's still generating more big plays. We have to find a way to generate more big plays in the pass game. And even though our run game is up, generate more as well. I just think overall, a high level of consistency.\" \n(On Dobbs making is debut at Alabama in 2013)\"That was the year that position was plagued with injuries. We knew going in that Justin [Worley] was banged up a little bit in his hand, so Josh [Dobbs] was one snap away. I though for the most part, a true freshman, on the road, first extensive action, performed admirably. I though he did a good job. I believe he hit a sprint-out pass to Johnathon Johnson up the sideline that really gave us a spark there. It was a very difficult situation he went into the game. I thought with the circumstances, he did some good things. He was very very poised, very calm and collected.\" \n(On how talented Alabama is)\"They are very, very talented. They are as talented of a football team that we have faced so far, when you look at the number of NFL draft choices that are in their program. When NFL scouts come through, I always ask them about our opponents. How many prospects does each program have? [Alabama] has been at the pinnacle of that. There's a number of individuals on both sides of the ball that will have long and productive years in the National Football League. That's a byproduct of recruiting and development and standing the test of time over a long period of time. They have done a great job with that.\" \n(On how the culture and his understanding of the Alabama game has changed since his first season)\"I understand the importance of the rivalry. This game means a lot to both institutions, both universities, our fan bases and our players. It means a lot. I have spoken about getting the rivalry back to making it relevant again and being in these football games for us. We are going to have to play great, mistake-free football to get the game into the fourth quarter. Once you get a game into the fourth quarter, as we all know, anything can happen. In terms of a couple of years ago, I think it's just a complete building of our football program, and there is a belief in winning. There is also deserving to win, and it's more than just wanting or hoping to win. It's investing to win. It's the belief that you're going to win. We have a lot of competitive young players in our football program. A lot of our players now understand the investment that it takes to win football games. Having great practices just gives you an opportunity to perform on Saturday. Now, it's taking the practice and applying it to the game field. Our seniors have been through a lot. They understand what it means to win. It's a whole football mindset in terms of thinking we are going down there to win a football game. That is what it's all about. Is it going to be a great challenge? Yes, but it's all about being elite. We are working to be an elite football program and an elite football player. Everything goes into that term elite. Obviously, Alabama is elite, but I know our players are excited and looking forward to a great challenge and opportunity.\" \n(On Dobbs' maturity since his first visit to Tuscaloosa)\"First of all, you just have to look at the before and after pictures of his body and how much he has matured from a physicality standpoint, putting the extra weight that he needs on. Obviously, there is no [substitute] for live game repetitions. He has those now. A high level of confidence that he plays with and the players around him and the confidence he has in the players around him. It is completely different. Josh has earned that right and because he has worked very hard with that.\" \n(On SEC's strength after losses to Toledo and Memphis)\"I think the conference is as competitive as it has ever been. It is the weekly grind--week in and week out. When I talk about, 'Every game is a new season,' that is exactly what it is. I had a lot of people tell me this when we came here--you start off in August and by October or November, you aren't the same team you were because of injuries. Depth becomes an issue with everything. The mental grind and the physical grind of playing in this conference--unless you have coached in this conference or played in this conference, you never really get a true sense of how challenging it is in terms of the physicality of this conference, the mental mindset, the fanbases, the passion of the fanbases, all that that goes into it. Every move you make is scrutinized. Every move you make is should've, could've, would've. I had a coach call me Saturday night and said, 'It's great to hear everyone's advice on Monday, but give me your advice when you have 25 seconds to decide what you want to do on Saturday.' He kind of joked about it, but that is the passion that everyone has. This is the best football conference in the country. I think it speaks for itself.\" \n(On working Chance Hall and Jack Jones into rotation)\"I will know a little bit more today and probably Tuesday and into Wednesday. We'll know Jashon's health. We'll know Brett's health. Those individuals--Jack and Chance--will get valuable repetitions all week, and they will be ready to play. We'll make that determination of what individuals give us the best opportunity to win with our health and everything that goes into it. You are playing one of the most dominating defensive fronts in all of college football.\" \n(On examining team during bye week)\"I thought the big test was Sunday with an 8 p.m. team meeting would show me a lot of the maturity of our football team. We have everyone sitting in their seats at 7:45 p.m. To me, that showed maturity. We had one individual who got in an accident. He had a fender bender, so he was late. But, other than that, it showed me the maturity of our football team, of getting back and being able to handle some time off. That was great to see. That is a big part of it. I thought our health came at the right time. Now, it is what do we do with it, what do we do with our health, how do we approach practice today. But, the fundamentals and fine details--even in the special teams game--and work some drill work. Working to be everything in terms of the fundamental details, the tackling, winning your space, winning your one-on-one matchups, all those things. We were able to do that and get a jump start on Alabama as well.\" \n(On the player's fender-bender)\"Ahh, it's not really important, all I know is he's safe, and he backed up into a pole.\" \n(On the running game's motivation, particularly Alvin Kamara)\"Well, you know Alvin is a competitive of a young man that we have in our football program. I know when he talks about his time at Alabama, he talks about the respect that he has for that football program. He still has a number of friends on that football team, but really we don't talk about it a lot. Alvin, is a very determined very confident young man, but he's very focused and very determined, and he doesn't talk much about the past. Everything is about the present and moving forward, and that's what I like about him. So, I don't see his approach changing at all from this game to any other game. As far as the run game, that's something that we take great pride in. Obviously we've made mark progress with that this year, and we're going to be challenged on Saturday.\" \n(What makes Alabama so good at being able to take the ball away)\"Complete defense, it starts up front. They've been very fortunate to win the line of scrimmage battle. They've been able to put pressure on the quarterback with all of their line twists and line stunts, they do a great job with that. They use their hands very well on defense, particularly upfront. The've been able to impact the quarterback by applying pressure. I think it starts upfront. They've been more athletic than they've been in the past at line-backer. They do a great job, I think of being able to break and drive on the ball. I think moving Jackson to safety has really helped them from an athletic standpoint. They play with a lot of confidence, and they break and drive on the ball, and they impact the quarterback, and they're very well coached and you can see that.\" \n>(On the outcome of the Michigan-Michigan State game)\"Well, that's football. That's why the ball's not round, it's shaped that way and it can take crazy bounces. That's why games are never over with until they're over with, and that's not coach-speak. You sit there as an outsider and a fan and you can see the anguish and the hurt and the frustration in the eyes of the coach. You feel for him, but then I said, `Heck, we've had three [losses] this year. I don't feel sorry because we've been through a lot.' We have a book, I have a journal, and you try to practice every situation. \n\"That's what makes football such a great game, is every week there's something new. There's something that you can improve on. There's something we as coaches can do a better job of really putting our players in those end-of-the-game situations. If you think about end-of-the-game situations, you practice it all the time with your placekicker. You're trying to apply pressure. You're trying to play things like that. In terms of the punter, how much do you do it? Prior to watching that game, we had an 11-man down situation to win the Big East championship when we were at Cincinnati against UConn. \n\"We've been in that situation before, so we make that a point. Every Monday, we practice that. When you watch these games, there's little instances that occur that you chart and make sure that you practice those. That's what makes this game so special, because each week there is something different. We have found that out the hard way here, but I think you can also get better from it, and learn from it, and continue to progress and move on.\" \n(On the Florida game preparing young players for Alabama)\"Any time you play in a venue that's very, very challenging, I think it helps. We do have that. I anticipate our players going in to Tuscaloosa and having great confidence with road focus in playing in that type of environment, because they've done it before. The confidence standpoint will be there because we've been through that. We've done that. \n\"We practice with crowd noise all the time but as you know, you can simulate it, but until you get into that type of venue, a lot of these individuals will be walking into the stadium for the first time. In terms of the environment and playing in the hostile environment, we've been able to do that now. That's life on the road in the SEC every time you're on the road.\" \n(On Joshua Dobbs' calm demeanor benefitting this team)\"He's a straight-lined individual. He's never too high, he's never too down, and I think that provides stability for your offense and for your players. They know what to expect. Josh is very consistent in his approach. \n\"I also thought he grew up a lot last week against Georgia. He was really holding players accountable in a very, very positive fashion, a very constructive fashion, which was great to see. That's what we need from him. I thought he was in control, but that's Josh Dobbs. From a leadership standpoint and a mentality standpoint, he's done a good job with that but I thought he took it to another level in the Georgia game. We're going to continue to need that as the season progresses.\" \n(On Kahlil McKenzie gaining more repetitions)\"With our limited depth at the defensive tackle spot, we're going to need that from him. We thought he played his best game of his short Tennessee career so far in the Georgia game, particularly in the second half. He has done a very good job of creating great football stamina. We're going to need him to be able to give us a number of plays in a row. \n\"The confidence that was gained in that [Georgia] game is great for him moving forward, and he's worked very hard in practice. Here's a youngster who did not play his senior year. He's going through missing his senior year and he missed half of training camp with an injury as well. Now, he's kind of getting into that structure, that routine, and you can see him progressing and getting better and better with his fundamentals [and] his details, the use of his hands, and his football stamina. \n\"We anticipate his role in this football team continuing to grow, and we need that because we have a lack of depth there.\"", "external_links": [], "published": "2015-10-20T02:13:00.000+03:00", "crawled": "2015-10-20T05:33:45.465+03:00", "highlightTitle": ""}