{"organizations": [], "uuid": "9249fbf56408165cae4406fae190180729a2810a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.themalaymailonline.com", "main_image": "http://www.themalaymailonline.com/uploads/articles/2015-10/Chris_Froome2410.JPG", "site_section": "http://www.themalaymailonline.com/feed/rss/sports\r", "section_title": "The Malay Mail Online | Sports", "url": "http://www.themalaymailonline.com/sports/article/froome-doping-suspicions-are-a-compliment", "country": "MY", "title": "Froome: Doping suspicions are a ‘compliment’", "performance_score": 0, "site": "themalaymailonline.com", "participants_count": 0, "title_full": "Froome: Doping suspicions are a ‘compliment’", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T07:08:00.000+03:00", "replies_count": 0, "uuid": "9249fbf56408165cae4406fae190180729a2810a"}, "author": "", "url": "http://www.themalaymailonline.com/sports/article/froome-doping-suspicions-are-a-compliment", "ord_in_thread": 0, "title": "Froome: Doping suspicions are a ‘compliment’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Print Article \nTeam Sky rider Chris Froome of Britain arrives for a media event at the Umiya Budokan arts centre in Saitama, outside Tokyo October 23, 2015. — Reuters pic \nSAITAMA (Japan), Oct 24 — The constant cloud of doping suspicion hanging over Chris Froome is the “ultimate compliment,” according to the Tour de France champion. \nSpeaking from Japan where he is taking part in the Criterium de Saitama, the Briton looked back on a “frustrating” Tour de France in which he was bombarded by questions about his performance. \nAnd Froome said accusations of cheating — whether by doping or riding a motorised bicycle — could be seen as lofty praise, even though sometimes it doesn’t feel like it. \nAlthough the 30-year-old did admit the persistent scrutiny makes it tougher for him to perform. \n“I definitely felt this year that it was an element that made this year’s Tour de France harder. Anyone who is human would have felt more under pressure with what was going on this year,” said the Kenya-born Team Sky leader. \n“In a way, getting those accusations is the ultimate compliment, but at the same time I’m certainly not taking it as a compliment. \n“It’s unfortunate that’s what the yellow jersey wearer of the Tour de France has to put up with.” \nFroome insisted that it would be harder to deal with if he was guilty. \n“If I had something to hide or I had some elaborate scheme going on then it would really bother me, it would be my whole world crashing down,” he said. \n“But I don’t have any skeletons in the closet, I don’t have anything to genuinely be afraid of. Yes, it’s frustrating but you just have to get on with the racing and get through it.” \nDuring July’s Grand Boucle, which Froome won for the second time in three years, he had urine thrown on him, was spat at and subjected to a torrent of abuse along the route. \nMany people made a great deal out of Froome’s victory on the 10 th stage — the only one he won during the Tour — although those within the peloton insisted there was nothing remarkable about it. \nJust fantastic \nFroome believes it was nothing personal but more related to his British Sky team breaking into a milieu traditionally dominated by continental western European countries and upsetting the apple cart. \nThat, and the goldfish bowl of the Tour which can bring out the worst, as well as the best, in some people. \n“Maybe it is that the team is challenging potentially the traditional way things were done in the past and maybe certain people don’t like that,” he said. \n“Just after the Tour we went and did some post-Tour criteriums — a few of those were in France — and I’ve got to say it was just fantastic. \n“The sentiment in France was great after the Tour, even passing through some of the places from the Tour, there wasn’t a single negative thing said,” he added. \n“So it does feel very much like it was a Tour de France thing.” \nThe atmosphere has been very different in Japan, where Froome spent yesterday learning traditional archery — kyudo — and listening to schoolchildren playing the koto, a type of harp. \nWhile the Tour is the most prestigious race in the world, criteriums such as the one in Saitama, north of Tokyo, are more like exhibition races, in which star names charge around short street circuits mostly to raise the profile of cycling in that area. \n“Something like this at the end of the season, it’s a lot more low-key, laid-back,” said Froome. \n“It’s actually a bit of fun to come out here with a few team-mates at the end of the season and do a race like this.” — AFP", "external_links": [], "published": "2015-10-24T07:08:00.000+03:00", "crawled": "2015-10-24T07:28:36.541+03:00", "highlightTitle": ""}