{"organizations": [], "uuid": "f3d564710387a2482e3cc7dc643a4339ed78121b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "savannahnow.com", "main_image": "http://savannahnow.com/sites/default/files/images/sms-default-facebook-share.jpg", "site_section": "http://savannahnow.com/", "section_title": "savannahnow.com | Savannah Georgia's source for News, Entertainment, Sports, Weather, Classifieds, Jobs, Autos, Real Estate and St. Patricks Day", "url": "http://savannahnow.com/opinion/2015-10-19/letters-editor-tuesday", "country": "US", "title": "Letters to the editor Tuesday", "performance_score": 0, "site": "savannahnow.com", "participants_count": 2, "title_full": "Letters to the editor Tuesday | savannahnow.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T17:28:00.000+03:00", "replies_count": 1, "uuid": "f3d564710387a2482e3cc7dc643a4339ed78121b"}, "author": "DispatchDaemon", "url": "http://savannahnow.com/opinion/2015-10-19/letters-editor-tuesday", "ord_in_thread": 0, "title": "Letters to the editor Tuesday", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Savannah, again, can be a model of peace\nSavannah has become an International City of Peace, just like Geneva, Switzerland, or The Hague. Yes, you can check it out at the website internationalcitiesofpeace.org.\nIt’s true, not just because our Mayor Edna Jackson proclaimed it so on Sept. 17. It’s true because a number of people know it’s possible to begin with individual peace within ourselves and to move it out into the surrounding community.\nSavannah has a history of peace.\nOur city was founded by a man of peace — James Edward Oglethorpe — who knew that peace and justice were intertwined. As a Member of Parliament, he knew that many people were unfairly incarcerated in British prisons. He made friends with Tomochichi so that our relations with the Native Americans avoided the bloody battles that occurred in so many other places.\nDuring the Civil War, Georgia’s homes and plantations were burned to the ground in Sherman’s March to the Sea. Savannah’s city fathers, however, walked through the woods at night to greet the Yankee general peacefully, and the city was spared.\nIn 1960, when the struggle for civil rights began, Savannah chose not to go the way of other southern cities where people had resisted with violence. A progressive mayor, Malcolm Maclean, initiated a committee of community leaders, both black and white, to discuss how racial integration could be peacefully brought about.\nThrough his courageous leadership Savannah’s libraries, restaurants and theaters were quietly and peacefully integrated, and the city of Savannah was able to stand as a model for other cities as a city of peace.\nIt can be true again.\nLAURA LAWTON\nSavannah\nTybee pool would provide alternative to hazardous beach\nMr. Jack Boylston’s anti-pool letter (“Do the math — Is this how Tybee wants to spend its money?” Oct. 14) focused on two major arguments: It would cost too much and the children and adults have never had a pool and did fine without it because there’s a beach. Just because we didn’t have something before does not prove that it wouldn’t be of value now. That is a poor argument.\nThe biggest concern seems to be cost. It should be noted that the referendum does not commit money to the pool nor does it increase taxes. This is totally different from the 2001 pool/gym referendum, which did include a tax increase.\nThis referendum passes the matter to council for further review. The preliminary proposal by the pool committee on costs and revenue projections reached the conclusion that a community pool is economically feasible.\nIt would be the duty of the council to do its own research on costs, design, location, etc. It is highly doubtful that council would proceed with a plan that is not economically feasible. We simply ask the residents of Tybee to allow council to proceed with the discussion.\nThe argument we don’t need a pool because we got along fine without one and have a beach is inaccurate in many ways. The Desoto pool and the amusement park used to offer alternatives to the beach and many Tybee residents learned to swim in those locations. They got along without a pool when these venues closed, not because they wanted to, but because there was no alternative.\nWe can change that.\nThe pool would provide a safe environment for swimming lessons, swim teams, aerobics and fun for children and adults. As we have found too often, the beach can be hazardous. The pool would be a wonderful alternative.\nAnother concern is the pool will be swamped by nonresidents fondly referred to as “day trippers.” This is actually an issue that can be easily resolved by the management of the pool by instituting resident-only swim hours, limiting the amount of passes for day trippers and/or limiting the amount of time for which a pass is valid.\nThe Pool Committee remains committed to the mission to create a resident-friendly community pool and will work closely with management to ensure that goal.\nPlease allow the discussion to proceed by voting “Yes.” Go to our website at tybeeislandcommunitypool.org for the real facts on the proposed pool.\nCHRIS GARBETT\nTybee Island\nWe won’t tuck our tails and say, ‘no way’\nThis is in response to the letter by Jack Boylston expressing his concerns — the proposed construction of a community pool on Tybee Island.\nIn his letter he expressed very legitimate concerns regarding the financial wisdom of such an endeavor. That is why the members of the Tybee Community Pool committee produced a comprehensive feasibility study prior to petitioning the Tybee City Council for approval.\nUsing relatively liberal cost estimates combined with rather conservative revenue projections, it was determined that the Community Pool is a very viable economic project. It can be constructed and maintained without raising any local taxes.\nUnlike the gymnasium, the pool can generate through memberships, day fees, swimming lessons, etc., sufficient funds to maintain its operation. Of course we understand that if the referendum is approved by Tybee’s voters, it will still be the responsibility of Tybee’s City Council to do its due diligence. It will crunch the numbers and confirm the pool’s economic soundness before proceeding with any construction.\nAs stated by Mr. Boylston, we are also aware that there are other substantial issues that Tybee has to be concerned with, such as infrastructure, parking, etc. But the bulk of the money used for construction of the pool will come from SPLOST funds that have already been targeted for recreational use and cannot by law be used for other purposes.\nIt will not be taking from Peter to pay Paul.\nAnd contrary to what some may say, the city of Tybee can walk and chew gum at the same time. It can construct a Community Pool and still address the other pressing needs of our city.\nFinally, Mr. Boylston talks about back in the day, so let me talk about my memory of that time. It was a time when America and its people had a Can Do spirit. If there were obstacles in their way, they went over, around or through. They did not tuck their tail between legs and say “no way.”\nHERB GREENBLUM\nTybee Island", "external_links": ["http://sav-cdn.com/sites/all/themes/savannahnow/images/blank.gif"], "published": "2015-10-19T17:28:00.000+03:00", "crawled": "2015-10-20T16:11:21.840+03:00", "highlightTitle": ""}