{"organizations": [], "uuid": "6138f7d79fc2faa640bd35362231ba769e51e843", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/1ba3314a26ff5c03c294ecbada686d2e.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/golf/greg-owen-one-shot-off-the-pace-after-first-round-in-las-veg/6975814/", "country": "JE", "title": "Greg Owen one shot off the pace after first round in Las Vegas", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "Greg Owen one shot off the pace after first round in Las Vegas", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T05:01:00.000+03:00", "replies_count": 0, "uuid": "6138f7d79fc2faa640bd35362231ba769e51e843"}, "author": "", "url": "http://www.sport.co.uk/golf/greg-owen-one-shot-off-the-pace-after-first-round-in-las-veg/6975814/", "ord_in_thread": 0, "title": "Greg Owen one shot off the pace after first round in Las Vegas", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Greg Owen"], "text": "Greg Owen one shot off the pace after first round in Las Vegas 23 Oct 2015 02:01:52 \ncomments \nEngland's Greg Owen is a shot off the lead after the first round of the Shriners Hospitals for Children Open in Las Vegas. \nThe 43-year-old, who has never won a PGA Tour title, shot 65 to leave him within touching distance of leading quartet David Hearn, Michael Thompson, Mark Hubbard and Tyler Aldridge. \nStarting on the back nine, Owen birdied five of the first eight holes to reach the turn on 31. He bogeyed the second but bounced back by birdying two of the next three. \nOwen dropped a shot on the second but bounced back with further birdies on three and five to leave him in contention in the second tournament of the season. \nCanada's Hearn birdied the last three holes with his only bogey coming on 17, while American duo Thompson and Hubbard each eagled the 16th but the former double bogeyed the 11th and the latter dropped a shot on 17. \nThe trio were joined on seven under by American Aldridge, who was on the 8th hole - his 17th - when play was suspended for bad light at 6.08pm. \nHearn told pgatour.com: \"It feels great to get off a good start to the week and I'm looking forward to continuing to stay aggressive and try to make some more birdies. \n\"We had a lot of wind in practice this week so today it was good to see the wind lie down a little bit. The course was playing pretty much as perfect as it's going to get. I think the reason there's so many good scores on that board is because the course is in such good shape.\" \nOne man who did not take advantage of the conditions was Rickie Fowler, who double bogeyed the par-three 17th on his way to a one-over 72. \nFowler said: \"It's been frustrating. I felt like I've been swinging pretty good leading up to today, I putted well, felt like I drove it halfway decent and then really couldn't put many shots on the centre face of the irons and wedges so that made it tough to pick my way round the course.\" \nEmiliano Grillo's bid to become the first player to win the opening two events of the PGA Tour season since 2003 took an early blow, as a three-over 74 left the Argentinian 10 shots off the pace. Related Sport News", "external_links": [], "published": "2015-10-23T05:01:00.000+03:00", "crawled": "2015-10-23T20:14:28.840+03:00", "highlightTitle": ""}