{"organizations": [], "uuid": "0bd6c9faade8c05f3a4c691d3ad51c9a61198ee4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "thecourier.com", "main_image": "http://thecourier.com/wp-content/uploads/2015/10/FOSTORIA-HEADER-150x150.jpg", "site_section": "http://thecourier.com/category/local-sports/feed", "section_title": "The Courier » Local Sports", "url": "http://thecourier.com/local-sports/2015/10/08/prep-football-fostorias-new-challenge-will-be-rossford/", "country": "US", "title": "Prep Football: Fostoria’s new challenge will be Rossford", "performance_score": 0, "site": "thecourier.com", "participants_count": 1, "title_full": "Prep Football: Fostoria’s new challenge will be Rossford", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T07:40:00.000+03:00", "replies_count": 0, "uuid": "0bd6c9faade8c05f3a4c691d3ad51c9a61198ee4"}, "author": "The Courier", "url": "http://thecourier.com/local-sports/2015/10/08/prep-football-fostorias-new-challenge-will-be-rossford/", "ord_in_thread": 0, "title": "Prep Football: Fostoria’s new challenge will be Rossford", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By SCOTT COTTOS STAFF WRITER Fostoria High School stopped a four-game losing streak with last week’s 46-21 Northern Buckeye Conference victory over Elmwood, but the Redmen didn’t treat it as anything more than what they should have done.“These kids have been the same each and every week,” coach Derek Kidwell said of his club, which will take a record of 2-4 overall and 1-2 in the NBC into Friday’s 7 p.m. homecoming game against Rossford at Memorial Stadium. “They come ready to work. There hasn’t been a big change in the weight room or the locker room. I think spirits were better on Saturday (than after losses), but come Monday it’s a new week, a new challenge. It’s no different this week.“It’s a win we expected. We were expecting it, so there was nothing to really celebrate. It was a business trip — go over there, get the victory and come back, look at our mistakes and correct them.” Two situations were unusual in last week’s game. Most prominently, Kidwell noticed a relative quietness in the stadium during the time before the game — understandably so, considering that only a day before, the Elmwood community was stunned and saddened by the death of senior Derek Sheldon in an auto crash.“You can never plan for a situation like that,” Kidwell said. “It was still our responsibility to go over there and play a football game. It was still scheduled. Luckily for us, we went over there and played well.” The Redmen also had to do an about-face with its offensive game plan. With a shortage of running backs, Kidwell planned on going to the passing game quite a bit. As it turned out, FHS relied on not junior quarterback Jayden Stanton’s arm, but his legs. Strong winds prompted Kidwell to revert to a run-dominated attack. And with the help of his offensive line, the junior churned out 289 yards and five touchdowns on 29 carries.“Looking at the forecast and being over there for pregame and seeing how the wind was swirling, I knew the passing game wouldn’t have much of an impact that night,” Kidwell said. “Fortunately, we were playing an opponent that we could overmatch offensive line-wise, and luckily for us we had the best athlete on the field in our quarterback. Those were two situations that we haven’t been able to be in much this year, that our offensive line could overpower somebody and having the best athlete on the field.” Kidwell knows a tougher test is in store against Rossford (4-2, 2-1 NBC), which is in the thick of the hunt for the conference title with Eastwood and Lake. The Bulldogs thrashed Genoa 35-7 last week.“We’ve got our hands full,” Kidwell said. “It’s not going to be an easy homecoming game for us.” Here are some things to know about Friday night’s clash: THE MAIN MAN: Regardless of the opponent and circumstances, Stanton’s going to be a main cog in Fostoria’s game plan.“He’s just an athlete,” Kidwell said. “He has good vision and he has a way of making people miss, and if he gets outside, he has good speed and he’s awful tough to catch. What’s making him better is he’s getting more comfortable in our offense. He’s making a lot of checks at the line of scrimmage and getting us into good plays. And he’s a kid who wants the ball and he’s a kid who wants to win. His will to win is probably bigger than most kids on our team.” FIERCE DOGS: Kidwell classifies Rossford running back Erik Davis as one of the best players in the league. The Bulldogs look to get the ball in his hands in a variety of ways in their spread offense. A Rossford player to watch on defense is Travis Szczublewski, who Kidwell said “is probably the best middle linebacker I’ve seen this year.” HANG AROUND: Kidwell said the biggest key for the Redmen is avoid falling behind by a big margin early in the contest.“If we can be tied or up or down seven after the first quarter, I’ll feel OK,” he said. “We can’t let this game get away from us early, like it did against Lake or like it did against Wauseon and Eastwood. In our three blowouts, the games have gotten away from us early and for some reason our kids don’t fight back when they get down early. They kind of pout or press and it snowballs into more of a downward spiral, rather than us fighting back.“We’ve got to play extremely hard and extremely disciplined in the first portion to keep the game close. If we can keep it close, the pressure’s on them.” WINNING TRADITION: Kidwell was Fostoria’s starting quarterback from 1989-1991, and the Redmen won the Division II state title in 1991. His predecessor at the position for the Redmen was Jamie Clay, who is an assistant coach at Rossford. Clay’s FHS teams made two playoff appearances.", "external_links": [], "published": "2015-10-08T07:40:00.000+03:00", "crawled": "2015-10-08T08:12:32.118+03:00", "highlightTitle": ""}