{"organizations": [], "uuid": "3d5847511a7cbacfe3d805da361fe285755d40bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "accesswdun.com", "main_image": "http://bf19d0142b960c98204c-6849f9022b05f72b83236695aa4e9a0a.r50.cf2.rackcdn.com/uploads/articles/2015/340082/piedmont-logo_p3.jpg", "site_section": "http://accesswdun.com/rss/3/rss.xml", "section_title": "AccessWDUN.com Sports", "url": "http://accesswdun.com/article/2015/10/340082/lady-lion-volleyball-rolls-in-straight-sets-over-emory-henry-wesleyan", "country": "US", "title": "Lady Lion volleyball rolls in straight sets over Emory & Henry, Wesleyan", "performance_score": 0, "site": "accesswdun.com", "participants_count": 1, "title_full": "Lady Lion volleyball rolls in straight sets over Emory & Henry, Wesleyan", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T02:16:00.000+03:00", "replies_count": 0, "uuid": "3d5847511a7cbacfe3d805da361fe285755d40bb"}, "author": "AccessWDUN staff", "url": "http://accesswdun.com/article/2015/10/340082/lady-lion-volleyball-rolls-in-straight-sets-over-emory-henry-wesleyan", "ord_in_thread": 0, "title": "Lady Lion volleyball rolls in straight sets over Emory & Henry, Wesleyan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By AccessWDUN staff Related Articles Lions take top 4 spots at Piedmont College Invitational, Parker takes individual title Piedmont's Mellichamp, Taylor featured at Indiana U. conference Piedmont women beat Covenant in OT Piedmont completes perfect road trip with shutout of Averett \nDEMOREST — In a pair of non-conference contests, the Lady Lions continued to show improvement as they have now won four straight following two 3-0 victories over Emory & Henry College and Wesleyan College. Piedmont won a close call with the Wasps while leaving no doubt against the Wesleyan Wolves in the final match of the day. \nPiedmont won the first match 25-19, 25-19, and 25-21 against Emory & Henry in a very evenly matched contest. The Lions had a total of 38 kills while the Wasps had 35 but the Lions had a better attack percentage as they hit .276 in the match while Emory & Henry only managed .186. \nTaylor Cramsey was dominant with 13 kills in the first match while hitting .458 but Amanda Trotter had an impressive match as well hitting .400 with seven kills. Emily Peters accounted for all but one assist as she totaled 37 while Haley Hixon had 15 digs. \nIn the second match of the day for Piedmont, the Lady Lions had a bevy of new faces on the court defeating Wesleyan 25-9, 25-13, and 25-10. Piedmont held the Wolves to a negative attack percentage at -.133 and just seven kills while hitting .241 and recording 26 kills. \nJennifer Sabolsky led the Lady Lions with nine kills against Wesleyan recording a .533 attack percentage while Katelyn Durmire also hit above .500 with five kills and a .556 attack percentage. Maddison Scruggs earned 25 of Piedmont's 26 assists while Heather Laprade served as the team's libero recording 8 digs. \nTurning Point --Piedmont dominated on serves as they had 25 aces while only surrendering 7 all day. \nStandout Performances --Cramsey had a dominant hitting performance with a .458 attack percentage against Emory & Henry --Sabolsky and Durmire had even better numbers against Wesleyan with .533 and .556 attack percentages, respectively. \nInside the Box Score --Peters had all but one assist against the Wasps as she had 37 assists of Piedmont's 38. \nNews & Notes --Piedmont has now won four straight and has not dropped a match in a tri-match this season. \nUp Next The Lady Lions are right back on the court in Cave Arena tomorrow as they take on Maryville College Sunday at 1:00 p.m. Sunday's match will mark Senior Recognition for both Mallory Leary and Cramsey. Piedmont is currently 4-1 in the USA South while the Scots are 3-0 but 4-6 overall prior to a tri-match with Huntingdon and LaGrange Saturday.", "external_links": [], "published": "2015-10-04T02:16:00.000+03:00", "crawled": "2015-10-04T13:15:40.654+03:00", "highlightTitle": ""}