{"organizations": [], "uuid": "63effad4a38636ec0bc0e72e125b822bd34039a1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news1130.com", "main_image": "http://www.news1130.com/wp-content/blogs.dir/sites/9/2015/04/17/Vancouver-Canucks.jpg", "site_section": "http://www.news1130.com/category/sports/", "section_title": "Sports - NEWS 1130", "url": "http://www.news1130.com/2015/10/18/oilers-knock-off-the-canucks-in-ot/", "country": "CA", "title": "Oilers knock off the Canucks in OT", "performance_score": 0, "site": "news1130.com", "participants_count": 1, "title_full": "Oilers knock off the Canucks in OT - NEWS 1130", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T05:06:00.000+03:00", "replies_count": 0, "uuid": "63effad4a38636ec0bc0e72e125b822bd34039a1"}, "author": "Marcus Fitzgerald", "url": "http://www.news1130.com/2015/10/18/oilers-knock-off-the-canucks-in-ot/", "ord_in_thread": 0, "title": "Oilers knock off the Canucks in OT", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Summary Matt Bartkowski was the lone goal scorer for Vancouver\nOilers goaltender Anders Nillson out dueled Ryan Miller, making 33 saves\nNext action for the Canucks is October 22nd against Alex Ovechkin and the Washington Capitals\nVANCOUVER (NEWS 1130) – The Vancouver Canucks may have deserved a better fate on Sunday night, but could only come away with a single point in a 2-1 overtime loss to the Edmonton Oilers at Rogers Arena. Lauri Korpikoski scored on a breakaway in extra time to cap a game that saw a ton of scoring chances at both ends.\nAnders Nillson was solid in goal for the visiting Oil, making 33 saves in the win. The Canucks will certianly lament some of the missed opportunities in this one, including Daniel Sedin airmailing a puck over the crossbar on a 2 on 0 break with his brother early in the third period while the game was still tied.\nMatt Bartkowski was the lone goal scorer for the Canucks, his first career regular season NHL goal. It came on a point shot with bodies in front of the net after Nail Yakupov had opened the scoring for the Oilers on a powerplay setup from rookie phenom Connor McDavid.\nBartkowski said after the game it felt good to get that first goal, and suggested a few days between games could be a good thing for the Canucks.\n“We get a few days at practice here. We haven’t been together that long. Just camp, and six games now. I think as far as getting to learn each other, as a new guy it’s good to get a few more practices under your belt.”\nMuch was made of Bo Horvat playing with Jake Virtanen and Sven Baertschi in this game. Baertschi had the best chance, as he was stopped by Nillson on a second period breakaway, but did pick up an assist on Bartkowski’s goal.\nRyan Miller made 22 saves in a losing effort for the Canucks. The team will now get back to practice this week before a visit from Alexander Ovechkin and the Washington Capitals at Rogers arena on October 22nd.\nRelated Stories The Canucks ready to face Connor McDavid Steen leads Blues to edge Canucks Canucks | nhl | oilers", "external_links": [], "published": "2015-10-19T05:06:00.000+03:00", "crawled": "2015-10-20T16:30:36.262+03:00", "highlightTitle": ""}