{"organizations": [], "uuid": "92f7f8e7ca9c8805a7f987f9c0b4da5d9d696249", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.winnipegfreepress.com", "main_image": "http://media.winnipegfreepress.com/designimages/fb-og-image.png", "site_section": "http://www.winnipegfreepress.com/rss/?path=/sports", "section_title": "Winnipeg Free Press: Sports", "url": "http://www.winnipegfreepress.com/sports/blue-jays-season-rests-on-estradas-arm-with-no-room-for-error-in-alds-331876411.html", "country": "US", "title": "Blue Jays season rests on Estrada's arm with no room for error in ALDS", "performance_score": 0, "site": "winnipegfreepress.com", "participants_count": 1, "title_full": "Blue Jays season rests on Estrada's arm with no room for error in ALDS - Winnipeg Free Press", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T12:57:00.000+03:00", "replies_count": 0, "uuid": "92f7f8e7ca9c8805a7f987f9c0b4da5d9d696249"}, "author": "Neil Davidson, The Canadian Press", "url": "http://www.winnipegfreepress.com/sports/blue-jays-season-rests-on-estradas-arm-with-no-room-for-error-in-alds-331876411.html", "ord_in_thread": 0, "title": "Blue Jays season rests on Estrada's arm with no room for error in ALDS", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Blue Jays' season hangs on Marco Estrada's right arm.\nOf course the 32-year-old will have help when he faces Martin Perez and the Texas Rangers on Sunday in Game 3 of the best-of-five American League Division Series at Globe Life Park.\nBut Estrada will be the one on the mound in a must-win game for Toronto, beaten 6-4 and 5-3 at home by a resilient Rangers team whose signature hashtag is NeverEverQuit.\n\"I'm taking it the same way as I would any other game,\" he said after Friday's loss at the Rogers Centre. \"We've got to win regardless. Even if we would have won today, I would have had the same mentality going into the game on Sunday.\n\"So nothing's really changed for me. I'm going to give it my all no matter what.\"\nThen again Estrada has delivered all season for Toronto since coming over from Milwaukee in a November trade for Adam Lind.\n\"I'd hate to think where we'd be without him,\" manager John Gibbons said.\nAfter going 7-6 with a 4.36 earned-run average in Milwaukee last season, Estrada was 13-8 with a 3.13 ERA — which ranked fifth in the AL — in a career-high 28 starts with Toronto this year.\n\"I really can't say truthfully what we expected out of him going into the season. I don't know. Didn't expect this, I know that,\" Gibbons added. \"I didn't anyway. He might have but I didn't.\"\nEstrada went from bullpen help to a member of the starting rotation, going 12-5 with a 2.92 ERA — third-best in the AL — in 23 starts since June 1. The 12 wins ranked third in the AL over that period.\nHe carried no-hitters into the eighth inning in consecutive starts June 19 and 24.\nOpponents batted .203 against him, which led the AL and was fourth in the majors, behind Jake Arrieta of the Cubs, and Zack Greinke and Clayton Kershaw of the Dodgers. He limited the opposition to .183 since the all-star break to lead the majors.\n\"It's been a lot of fun,\" said Estrada.\nHe posted a 2.62 ERA in his last 20 starts, although five of the last seven were no decisions.\n\"I keep hearing how last year was a bad year but the years before that were pretty good,\" said Estrada, who is not short on confidence. \"So I don't understand what the huge surprise is. Maybe this is a little better than expected, what I've done this year but like I said I've had really good seasons in past years.\n\"This is my best season. And I think it's been a mixture of a scenery change and the guys calling the games, the defence behind me and having an extra pitch.\"\nThat would be the cutter, which has only helped further set up Estrada's signature 79-m.p.h. changeup.\nGibbons calls his changeup as good as any in baseball.\n\"It's a tough pitch to hit,\" said reliever Brett Cecil, now sidelined with a calf injury. \"You can never tell if it's coming or if it's not coming. There's nothing you can do but hope and pray it's a fastball or if you're sitting on the change-up, hopefully it is a change-up.\"\nThe changeup, in turn, helps the rest of Estrada's arsenal: a four-seam fastball (around 89-90 m.p.h.) and curveball.\n\"It makes every other pitch so much better,\" said Dioner Navarro, who regularly catches Estrada.\nHe used the changeup 28.1 per cent of the time this season, often befuddling batters.\nEstrada isn't sure why his changeup is so good, other than it could be his small hands.\n\"I don't understand why mine does what it does but I'm glad it does,\" he said with a laugh.\nHe has great command, can elevate the ball and hit corners, according to Gibbons.\n\"He's really mastered everything he's got,\" the manager added.\nEstrada says he welcomed the chance to come to Toronto, seeing the possibility for a new beginning. The only negative was the Brewers held spring training in Arizona where he makes his home while the Jays are based out of Florida.\nHe was told in the pre-season that he would get a shot at a starting role but a rolled ankle slowed his start. The coaches told him to be patient.\n\"I told them 'I'm not worried about it. I know it's going to happen and once it does, I'm going to run with it.' And that's basically what happened.\"\nEstrada means business on the mound. His entrance music at the Rogers Centre is Drowning Pool's \"Bodies,\" a hard-driving head-banger with the refrain \"Let the bodies hit the floor.\"\nSunday will mark's Estrada's first start in the post-season. He appeared in four games out of the bullpen with Milwaukee in 2011.\n———\nFollow @NeilMDavidson on Twitter\n ", "external_links": [], "published": "2015-10-10T12:57:00.000+03:00", "crawled": "2015-10-10T19:19:09.367+03:00", "highlightTitle": ""}