{"organizations": ["WMU", "Facebook Bronco Hockey Downs", "Facebook Email Twitter Google"], "uuid": "7e9ddc70815e0bca962fcccf0b5edc8048960df0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wzzm13.com", "main_image": "http://www.gannett-cdn.com/-mm-/489efad1142179deef9ce5ef3cf126cd99e1a3f1/r=x633&amp;c=1200x630/http/cdn.tegna-tv.com/-mm-/d94f7bd9f3e18fd8cb13eb53a50e9a8ba8bd9823/c=14-0-1920-1077/local/-/media/2015/10/13/WZZM/WZZM/635803728365893322-Still1013-00001.jpg", "site_section": "http://rssfeeds.wzzm13.com/_/20/109449182/wzzm13-sports", "section_title": "WZZM - Sports", "url": "http://www.wzzm13.com/story/sports/2015/10/13/bronco-hockey-downs-no-10-bowling-green-4-1/73906030/", "country": "US", "title": "Bronco Hockey Downs No. 10 Bowling Green 4-1", "performance_score": 0, "site": "wzzm13.com", "participants_count": 0, "title_full": "Bronco Hockey Downs No. 10 Bowling Green 4-1", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T05:41:00.000+03:00", "replies_count": 0, "uuid": "7e9ddc70815e0bca962fcccf0b5edc8048960df0"}, "author": "", "url": "http://www.wzzm13.com/story/sports/2015/10/13/bronco-hockey-downs-no-10-bowling-green-4-1/73906030/", "ord_in_thread": 0, "title": "Bronco Hockey Downs No. 10 Bowling Green 4-1", "locations": ["Western Michigan", "KALAMAZOO"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Lukas Hafner"], "text": "Facebook Email Twitter Google+ LinkedIn Pinterest Bronco Hockey Downs No. 10 Bowling Green 4-1 KALAMAZOO -- Five freshmen registered points and Lukas Hafner made 25 saves as the Western Michigan hockey team upset No. 10 Bowling Green, 4-1, in front of 2,843 fans at Lawson Ice Arena on Tuesday night. Post to Facebook Bronco Hockey Downs No. 10 Bowling Green 4-1 KALAMAZOO -- Five freshmen registered points and Lukas Hafner made 25 saves as the Western Michigan hockey team upset No. 10 Bowling Green, 4-1, in front of 2,843 fans at Lawson Ice Arena on Tuesday night.   WZZM13.com: http://www.wzzm13.com/story/sports/2015/10/13/bronco-hockey-downs-no-10-bowling-green-4-1/73906030/   Join the Conversation To   Bronco Hockey Downs No. 10 Bowling Green 4-1 Western Michigan 10:41 p.m. EDT October 13, 2015 WMU wins 4-1 over Bowling Green (Photo: WZZM) CONNECT TWEET LINKEDIN COMMENT EMAIL MORE \nKALAMAZOO -- \nFive freshmen registered points and Lukas Hafner made 25 saves as the Western Michigan hockey team upset No. 10 Bowling Green, 4-1, in front of 2,843 fans at Lawson Ice Arena on Tuesday night. \nKyle Novak, Oliwer Kaski, Matheson Iacopelli and Griffen Molino all scored for the Broncos. Kaski and Molino also tallied assists for their first collegiate two-point games. Fellow freshman Colt Conrad also had a career night with two assists. \nNovak gave the Broncos an early 1-0 lead on his second goal of the season just 1:15 into the first period. Griffen Molino found him at the right side of the blue line and the junior forward skated in and put a back-hander into the net. Kaski also tallied an assist on the goal for his fist career point. \nKaski doubled-up his career point total with his first collegiate goal at 10:41 in the first period. Conrad found him at the top of the right circle and the Finnish defenseman threw the puck at the net and it trickled by BGSU goalie Chris Nell to give the Broncos a 2-0 lead. \nFreshman Matheson Iacopelli pushed the lead to 3-0 on the forwards first career goal at 10:42 in the second period. Sheldon Dries won a faceoff in the BGSU zone during a power play to Corey Schueneman. SChueneman passed it to Iacopelli on the right point and the Chicago Blackhawks draft pick fired a rocked that Nell got a piece of but still ended up burried in the net. \nBowling Green countered at 12:56 with its only goal of the game. Co \nnnor McDonald found Pierre-Luc Mercier at the Bronco blue line and Mercier passed it over to Kevin Dufour on a two-on-one and Dufour put it into the net to cut the lead to 3-1. \nMolino put the game out of reach at 18:09 in the third period. The Broncos were on a power play and the Falcons pulled Nell from the net to even out play on the ice but Conrad won a race to the puck and then tapped to to Molino for the easy goal. \nThe Bronco penalty kill continued its strong play, going 7-for-7 on the night and now at 18-for-19 on the season. WMU's power play also sayed hot converting two of its five chances. \nWestern Michigan is off until its trip to Potsdam, N.Y., to take on Clarkson University on Oct. 23 and 24. Read or Share this story: http://www.wzzm13.com/story/sports/2015/10/13/bronco-hockey-downs-no-10-bowling-green-4-1/73906030/ TOP VIDEOS", "external_links": [], "published": "2015-10-14T05:41:00.000+03:00", "crawled": "2015-10-14T05:49:00.122+03:00", "highlightTitle": ""}