{"organizations": [], "uuid": "99384f9625aa679fdc4a79ed4853ab9e1b904c86", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sportsnews.com.au", "main_image": "http://www.sportsnews.com.au/wp-content/uploads/2015/10/20151020_152416.jpg", "site_section": "http://www.sportsnews.com.au/feed", "section_title": "Sports News Australia", "url": "http://www.sportsnews.com.au/motor-sport/i-am-portrayed-as-a-villain-whincup-2/160446", "country": "CA", "title": "I am portrayed as a ‘villain’: Whincup", "performance_score": 0, "site": "sportsnews.com.au", "participants_count": 1, "title_full": "I am portrayed as a ‘villain’: Whincup", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T07:26:00.000+03:00", "replies_count": 0, "uuid": "99384f9625aa679fdc4a79ed4853ab9e1b904c86"}, "author": "AAP", "url": "http://www.sportsnews.com.au/motor-sport/i-am-portrayed-as-a-villain-whincup-2/160446", "ord_in_thread": 0, "title": "I am portrayed as a ‘villain’: Whincup", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I am portrayed as a ‘villain’: Whincup Posted by AAP + on 20/10/2015 at 3:26 pm AFL GRAND FINAL OFFER! If your team leads at any break but loses, CASH BACK up to $100!* PLUS Sign up now for a $501 Bonus Bet! I am portrayed as a ‘villain’: Whincup \nJamie Whincup may be forgiven by his Holden team but the V8 Supercars star reckons he has been portrayed as the “villain” ahead of this weekend’s Gold Coast 600. \nWhincup said he had cleared the air with furious Red Bull team boss Roland Dane in the wake of his Bathurst 1000 gaffe that left his V8 title defence in tatters. \nHowever, Whincup was frustrated he had not been given the same chance to “tell his side of the story” in the media during the fallout over his Mount Panorama bungle. \n“At the end of the day I have been labelled a villain in the whole situation but I was just trying to do the right thing,” Whincup told AAP. \nDane was livid after Whincup ignored team orders to pit at Bathurst and passed a safety car, relegating him from second to the back of the field with 20 laps left in the Great Race. \nHe finished 18th. \nLast year Whincup also ignored team orders at Bathurst and ran out of fuel on the 161st and final lap while leading. \nWhincup said Dane was satisfied with his explanation ahead of this weekend’s Gold Coast 600, but felt he had been portrayed in a bad light by the media. \nWhincup became the butt of social media jibes after back to back Bathurst bungles that have relegated him to eighth in the standings with just four rounds left. \n“The team briefing was fine. Roland was (seen) in the heat of the moment at the race weekend,” Whincup said. \n“The best thing to happen was someone letting me give my side of the story. \n“I thought the team made a mistake by bringing us both in on the same lap (to pit) – I was just trying to avoid an (pitlane) issue. \n“Five seconds later I realised I made the wrong call. \n“But I was prepared to get behind the safety car and couldn’t believe my eyes when I got the green light from the car sitting on the right indicating for me to go through. \n“It was like a ‘get out of jail free’ card. Of course I was going to take it but the stewards deemed I shouldn’t have done that.” \nSix-time V8 series champion Whincup is 803 points behind championship leader Mark Winterbottom of Ford. \nWhincup conceded he was still in title contention to defend his V8 crown but would assess his hopes after the final enduro round at the Gold Coast. \n“I won’t think about that until after this weekend,” Whincup said. \n“We are still in contention but there is no point in commenting on it. \n“I think any comment would be (portrayed) as a negative comment. \n“We will assess it after this weekend and work out our run home.” \nPractice for the Gold Coast 600 begins on Friday.  ", "external_links": [], "published": "2015-10-20T07:26:00.000+03:00", "crawled": "2015-10-20T07:27:54.181+03:00", "highlightTitle": ""}