{"organizations": [], "uuid": "bc6e6091e35a76037a6c2a9b24ef4926d4724df2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wopular.com", "main_image": "", "site_section": "http://www.wopular.com/rss/sections/11332", "section_title": "RSS: sports", "url": "http://www.wopular.com/smu-will-not-appeal-larry-brown-suspension-or-postseason-ban-3", "country": "US", "title": "SMU will not appeal Larry Brown suspension or postseason ban", "performance_score": 0, "site": "wopular.com", "participants_count": 1, "title_full": "SMU will not appeal Larry Brown suspension or postseason ban", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T04:56:00.000+03:00", "replies_count": 0, "uuid": "bc6e6091e35a76037a6c2a9b24ef4926d4724df2"}, "author": "senh", "url": "http://www.wopular.com/smu-will-not-appeal-larry-brown-suspension-or-postseason-ban-3", "ord_in_thread": 0, "title": "SMU will not appeal Larry Brown suspension or postseason ban", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BING NEWS: SMU won't appeal postseason ban or Larry Brown's suspension For all its tough talk when the NCAA handed down its penalties two weeks ago, SMU won't be fighting the most serious of them. The Mustangs announced Friday afternoon that they will not appeal the postseason ban that will prevent them from participating in ... 10/9/2015 - 1:01 pm | View Link SMU won't appeal postseason ban, Brown's suspension SMU won't appeal the NCAA postseason ban or suspension for basketball coach Larry Brown, the school announced on Friday. The Mustangs were banned from postseason play for one year and Brown was suspended for nine games during the 2015-16 season. 10/9/2015 - 12:27 pm | View Link SMU won't appeal postseason ban, suspension for Larry Brown Southern Methodist announced on Friday that it would accept a postseason ban and a nine-game suspension for head coach Larry Brown, two of the heaviest penalties applied to the school following an NCAA investigation. The issues at SMU, and the penalties ... 10/9/2015 - 11:34 am | View Link SMU Will Not Appeal Postseason Ban, Larry Brown Suspension Less than two weeks after the NCAA hit the SMU Mustangs men's basketball program with a postseason ban and suspended head coach Larry Brown for 30 percent of the team's games in 2015-16, the program has decided to accept some of the punishment. Per ESPN ... 10/9/2015 - 11:02 am | View Link SMU won't appeal Larry Brown suspension, postseason ban Southern Methodist University has decided not to appeal the partial suspension for coach Larry Brown and the NCAA postseason ban, but it will appeal other sanctions, the school announced in a statement Friday. The NCAA on Sept. 29 banned the men's ...", "external_links": [], "published": "2015-10-10T04:56:00.000+03:00", "crawled": "2015-10-10T09:11:17.391+03:00", "highlightTitle": ""}