{"organizations": [], "uuid": "97847d9706d4a6819140b890761106a7b73fc4de", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tnonline.com", "main_image": "", "site_section": "http://tnonline.com//sports/rss", "section_title": "Times News Sports", "url": "http://www.tnonline.com/2015/sep/30/christoff-shines-indians-blank-eagles", "country": "US", "title": "Christoff shines as Indians blank Eagles", "performance_score": 0, "site": "tnonline.com", "participants_count": 1, "title_full": "Christoff shines as Indians blank Eagles", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T23:00:00.000+03:00", "replies_count": 0, "uuid": "97847d9706d4a6819140b890761106a7b73fc4de"}, "author": "psiwebtn", "url": "http://www.tnonline.com/2015/sep/30/christoff-shines-indians-blank-eagles", "ord_in_thread": 0, "title": "Christoff shines as Indians blank Eagles", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Christoff shines as Indians blank Eagles Wednesday, September 30, 2015 Lehighton's Zach Christoff steps in to take the ball away from Blue Mountain's Angus Fortune during soccer action Tuesday. Lehighton won, 4-0. BOB FORD/TIMES NEWS By Emmett McCallemccall@tnonline.com \nIt didn’t take long for the Lehighton-Blue Mountain soccer rivalry to form. \nIn just their second year in the Schuylkill League, the Indians have found out quickly that the road to a championship goes through Blue Mountain. \nLehighton has also shown that it knows how to navigate a potentially treacherous road. \nAfter beating the Eagles for the league title a year ago, the Indians proved that they are a serious contender again this season with a dominating 4-0 victory over Blue Mountain on Tuesday afternoon. \n“I definitely think we’ve developed a good rivalry with Blue Mountain in the short time we’ve been in the league,” said Lehighton’s Zach Christoff, who had a sensational performance to propel his team to the victory. “They are a great team and we know if we want to beat them we have to be at our best. \n“They beat us earlier this year and really controlled play against us. Today, I thought we did a nice job of turning that around. I thought it was a great all-around team effort.” \nChristoff ignited the Indians with two goals and an assist. He broke a scoreless deadlock with 8:54 left in the first half, taking a pass from Joe Marks and finding the net. Just two minutes later he scored off a free kick from 22 yards out to make it 2-0. \n“Blue Mountain did a nice job of marking Zach the first time we played them, but he’s strong and talented and today they had a much harder time slowing him down,” said Lehighton coach Dave Yob. “He can hurt you in the run of play, but he might be even more dangerous on restarts. I think his goal today was the sixth or seventh in the last couple years he’s gotten on free kicks. \n“He’s a tremendous weapon to have in those situations.” \nLeading 2-0 after completely controlling ball possession and getting the far better opportunities in the first half, Lehighton never slowed after intermission. \nMarks made it 3-0 with just over nine minutes remaining when he took a perfect feed from Christoff and rolled the ball into the corner of the net. Frank Bokan capped the Indians’ big day when he poked home a rebound with 4:12 left. \n“I’m really pleased with our performance,” said Yob. “It probably was our best game of the season.” \nEAGLE INJURY ... Both coaches said that Blue Mountain having to play without the injured Cameron Greenawalt changed the game’s dynamics. Greenawalt, who missed his second straight game after injuring his knee, could be back in the lineup next week according to coach Robert Burcik. Greenawalt scored four goals in the Eagles’ 5-3 victory over Lehighton earlier this season. \nVIRTUAL TIE ... Lehighton improved its record 9-2 overall and 6-1 in the league. Blue Mountain dropped to 9-3 overall and 5-1 in league play. \nUNDER PRESSURE ... An unofficial tally of dangerous scoring opportunities that were either converted, saved or just off target had the Indians with a decisive 14-6 advantage. \nCLEAN SHEET ... Lehighton goalie Tyler Dietz wasn’t called on too often but when he was he met the challenge. Dietz had five saves in the game, including a diving stop of a low, hard shot off the foot of Johnathon Benner with 27 minutes remaining that would have made it a one-goal game at the time.", "external_links": [], "published": "2015-09-30T23:00:00.000+03:00", "crawled": "2015-10-01T04:29:06.976+03:00", "highlightTitle": ""}