{"organizations": [], "uuid": "e0d88b87a4612af358388b2bf03260889c0ee326", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sctimes.com", "main_image": "http://www.gannett-cdn.com/-mm-/a094a77fb591851ba91e2e2f87e2b068870387f9/c=0-217-2000-1347&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/24/StCloud/StCloud/635813143022542381-Pierz-vs-Annandale-1.jpg", "site_section": "http://rssfeeds.sctimes.com/stcloud/highschoolsports", "section_title": "St. Cloud - High School Sports", "url": "http://www.sctimes.com/story/sports/high-school/2015/10/24/prep-football-no-1-pierz-prevails/74347228/", "country": "US", "title": "Prep football: No. 1 Pierz prevails", "performance_score": 0, "site": "sctimes.com", "participants_count": 0, "title_full": "Prep football: No. 1 Pierz prevails", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T05:07:00.000+02:00", "replies_count": 0, "uuid": "e0d88b87a4612af358388b2bf03260889c0ee326"}, "author": "", "url": "http://www.sctimes.com/story/sports/high-school/2015/10/24/prep-football-no-1-pierz-prevails/74347228/", "ord_in_thread": 0, "title": "Prep football: No. 1 Pierz prevails", "locations": ["Annandale"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tom Elliott", "Jason Wachter", "Pierz", "Derick Hall"], "text": "Prep football: No. 1 Pierz prevails Tom Elliott , telliott@stcloudtimes.com 10:07 p.m. CDT October 24, 2015 Buy Photo Pierz's Derick Hall breaks an Annandale tackler and looks for an open lane to run in the first half Saturday, Oct. 4 at Husky Stadium. (Photo: Jason Wachter, jwachter@stcloudt) Buy Photo \nThe top-ranked and undefeated Pierz Pioneers got a tough game for the first time this year. \nNoah Boser welcomed it. Kolton Eischens was a bit ticked about it. \nPierz beat Annandale 18-12 Saturday evening at St. Cloud State's Husky Stadium. \nIt gave the Pioneers (10-0) their third straight Section 5-3A title. \n\"Gosh, we haven't had one like that all year,\" said Boser, who scored two touchdowns at running back and also had a big game defensively. \"I think this is helping us out a lot, actually. \n\"This is going to help us be ready at state.\" Buy Photo Annandale's Brett Wadman bobbles the ball for a few yards before getting control for a completion. Jason Wachter, jwachter@stcloudt Buy Photo Pierz's Noah Boser pushes away Annandale's Brett Wadman and continues on his run in the second half. Jason Wachter, jwachter@stcloudt Annandale's Brett Wadman intercepts a pass intended for Pierz's Michael Meyer in the first half. Jason Wachter, jwachter@stcloudtimes.com Fullscreen Buy Photo Pierz fans cheer the players during introductions before the start of their game against Annandale in the Section 5-3A title game Saturday, Oct. 4 at Husky Stadium. Jason Wachter, jwachter@stcloudt Fullscreen Buy Photo Pierz's Noah Boser 24 ties unsuccessfully to pick off a pass to Annandale's Cory Schmidt in the second half. Jason Wachter, jwachter@stcloudtimes.com Annandale's Reed Rasset tries unsuccessfully to get his hands on a pass in the second half. Jason Wachter, jwachter@stcloudtimes.com Pierz fans cheer as their team scores their second touchdown in the first half against Annandale. Jason Wachter, jwachter@stcloudt Fullscreen Buy Photo Pierz's Kolton Eischens (20) drops Annandale's Reed Rasset in the end zone for a safety in the second half. Jason Wachter, jwachter@stcloudtimes.com Fullscreen Buy Photo Pierz's Derick Hall breaks an Annandale tackler and looks for an open lane to run in the first half. Jason Wachter, jwachter@stcloudtimes.com Pierz's Jonny Kasper breaks into open field against Annandale for a gain in the first half. Jason Wachter, jwachter@stcloudtimes.com Annandale players come onto the field during introductions. Jason Wachter, jwachter@stcloudtimes.com Pierz's Jonny Kasper finds a hole in the Annandale line to run in the first half. Jason Wachter, jwachter@stcloudtimes.com Buy Photo Annandale's Reed Rasset is brought down by Pierz's Brett Kapsner on a run in the first half. Jason Wachter, jwachter@stcloudt Pierz's mascot celebrates a big first down. Jason Wachter, jwachter@stcloudtimes.com Pierz's Derick Hall breaks through the Annandale line on a run in the first half. Jason Wachter, jwachter@stcloudtimes.com Pierz's Jonny Kasper finds a hole in the Annandale line to run in the first half. Jason Wachter, jwachter@stcloudtimes.com Annandale quarterback Brock Fobbe sets up to throw against Pierz. Jason Wachter, jwachter@stcloudtimes.com Pierz's Derick Hall gains a few more yards before being brought down. Jason Wachter, jwachter@stcloudtimes.com Like this topic? You may also like these photo galleries: Replay Last Slide Next Slide \nThird-seeded Annandale (7-4) kept this one close throughout. Pierz led 14-6 at halftime, but the Cardinals cut it to 14-12 when Dondrae Burns scored on a one-yard TD run with 3:31 to go in the third quarter. \nAnnandale missed the two-point conversion twice. The first one had a pass interference penalty called. The second was broken up. \nThen, the Pioneers picked up a pair of fourth-quarter safeties. Eischens had the first one. He tackled Annandale running back Reed Rasset in the end zone with 5:58. It came right after the Cardinals recovered a fumble at their own 3-yard line. \n\"This was a wake-up call definitely for this team,\" said Eischens, a senior defensive back. \"I think a lot of the kids thought we'd roll them like the last time.\" \nPierz opened the season with a 38-12 over Annandale. But this one was a lot different. \n\"We knew coming in that Annandale was a lot better,\" Pierz head coach Leo Pohlkamp said. \"The first game doesn't mean (anything).\" \nPierz picked up another safety when Annandale voluntarily took one on fourth down on its own 1-yard line. That made it 18-12 and that held up. \n\"Hats off to Annandale,\" Boser said. \"They played a great game and they really are improved.\" \nPierz plays Albany in the state Class 3A quarterfinals at 5 p.m. Saturday at St. Cloud State. Buy Photo \nPierz's Noah Boser 24 ties unsuccessfully to pick off a pass to Annandale's Cory Schmidt in the second half Saturday, Oct. 4 at Husky Stadium. (Photo: Jason Wachter, jwachter@stcloudt) \nP — Noah Boser 1 run (Preston Rocheleau kick) \nSecond quarter \nP — Boser 1 run (Rocheleau kick) \nThird quarter \nA — Dondrae Burns 1 run (pass failed) \nFourth quarter \nP — Safety, Kolton Eischens tackles Reed Rasset in the end zone \nP — Safety, Annandale punter Derek Tomberlin runs of back of end zone \nIndividual statistics \nRushing: A — Reed Rasset 15-32, Brock Fobbe 7-6, Cory Schmidt 1-5, Burns 1-1, Tomberlin 1-(-1). Total: 25-43. P — Jonny Kasper 24-125, Noah Boser 11-61, Derick Hall 9-41, Lane Girtz 12-28, Aaron Weber 2-(-6), team 2-(-13). Total: 60-236. \nPassing: A — Fobbe 7-16-1 151, Brett Wadman 0-1-0. P — Weber 4-10-1 75. \nReceiving: A — Wadman 3-99, Burns 3-52, Rasset 1-0. P — Michael Meyer 3-64, Kolton Eischens 1-11. \nFollow Tom Elliott on Twitter @sctimestom or call 259-3661. 2 CONNECT 6 TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http://www.sctimes.com/story/sports/high-school/2015/10/24/prep-football-no-1-pierz-prevails/74347228/ TOP VIDEOS", "external_links": [], "published": "2015-10-25T05:07:00.000+02:00", "crawled": "2015-10-25T16:06:28.612+02:00", "highlightTitle": ""}