{"organizations": ["AA Burlington Central Regional", "Sycamore Golf Club"], "uuid": "b79c43d633118ea6e94ad910ad54b88b9b388f69", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kcchronicle.com", "main_image": "", "site_section": "http://www.kcchronicle.com/?rss=sports/preps", "section_title": "Prep Sports", "url": "http://www.kcchronicle.com/2015/10/07/north-rolls-to-regional-repeat/amamtpw/", "country": "US", "title": "North rolls to regional repeat", "performance_score": 0, "site": "kcchronicle.com", "participants_count": 0, "title_full": "North rolls to regional repeat", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T06:36:00.000+03:00", "replies_count": 0, "uuid": "b79c43d633118ea6e94ad910ad54b88b9b388f69"}, "author": "", "url": "http://www.kcchronicle.com/2015/10/07/north-rolls-to-regional-repeat/amamtpw/", "ord_in_thread": 0, "title": "North rolls to regional repeat", "locations": ["St. Charles North"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["KEVIN DRULEY", "Kate Lillie", "Sandy Bressner", "North"], "text": "North rolls to regional repeat Published: Wednesday, Oct. 7, 2015 10:36 p.m. CDT • Updated: Wednesday, Oct. 7, 2015 10:48 p.m. CDT Caption (Sandy Bressner - sbressner@shawmedia.com) St. Charles North girls golfer Kate Lillie, watching her putt on the seventh green, was medalist at Wednesday's Class AA Burlington Central Regional at Sycamore Golf Club, shooting 71. By KEVIN DRULEY kdruley @shawmedia.com \nSYCAMORE – A neither funny nor fuzzy thing happened on the way to Kate Lillie’s medalist round at Wednesday’s Class AA Burlington Central girls golf regional. \nSteering St. Charles North to a team title with a 1-over- par 71 necessitated navigating the same Sycamore Golf Club course at which North won a regional 364 days ago. The junior hardly tsk-tsked at the task, but she did have an opinion about it. \n“I find it kind of boring, really, just because having so many par 4s in a row, you start to kind of lose your focus, and you have to be able to keep your focus,” Lillie said. “It’s how you’re able to play through those holes, though.” \nWith a team score of 303 – 35 strokes better than this time last fall – the North Stars excelled in that regard and many more. Ostensibly, their only rough patch came during the awards ceremony, when junior Gianna Furrie and freshman Emma Hayes tied for the fourth-best individual score with a 79. \nOnly four individual medals were on hand in the clubhouse. Lillie and freshman teammate Megan Furtney, who shot an individual runner-up 74, claimed two others. \n“It’s awesome. I couldn’t ask for a better team, honestly,” Furtney said. “We all have each other’s backs, so if anybody ever goes down, we’re always there to pick them up. So, it’s great.” \nSt. Charles East junior Rose Bundy (78) finished third overall for the team runner-up Saints (337), who will join the North Stars and third-place Geneva (354) at Monday’s Oak Park-River Forest Sectional at Cog Hill No. 1 in Lemont. \nBatavia qualified individuals Madi McCoy (84), Becca Hasemann (89) and Samantha Baumann (94). The Central duo of Josie Kurosky (82) and Melanie Croke (97) also advanced. \n“Last year, I was a little nervous about everything, and this year I’m a lot more comfortable,” said McCoy, a sophomore who rolled behind booming drives. “Last year was pretty much getting ready for this year.” \nDoesn’t Geneva know? In 2014, the Vikings saw four individuals move on to sectionals after finishing fourth as a team by one stroke. That made this repeat trip west not boring, but another “b” word – blissful. \n“It was just a big relief knowing that we didn’t want the same thing to happen, obviously,” Vikings coach Doug Roberts said. \n“As the season’s been progressing, I think they knew that they had some good scores from the group, and they just feed off of one another.” \nDarby Lillibridge (82) and Reilly Krohe (88) paced the Vikings, while Gabby Devlin (91) and Kendal Fioresi (93) followed. \nKacie Gaffney (82) was the Saints’ second scorer. East also counted rounds from Nicole Jordan (86) and Karina Shah (91). \n“We all kind of struggled on the front, but we all turned it around on the back, you know,” Bundy said. “The weather was good. I’ve been so lucky with conference and regionals. It’s been really nice.” \nEarly October sun and highs in the mid-70s only ameliorated the monotony, then, for anyone who found it. For the record, Bundy described the experience with “boring,” too. \nGaffney agreed. Partially. \n“It’s pretty straightforward,” she said. “But you definitely have to play here once or twice so you get to know the feel.” \nLillie improved her 2014 regional score by five strokes. She said last season’s 76 didn’t “look that bad on paper, but it didn’t really feel well.” \nLunching with teammates as Wednesday’s final scores came in, her temperament was a positive one. Sure, Lillie would like to see more than just two par 5s on a course, but with three birdies and an even keel in hand, her approach translated well. \n“I just take what I have to do at hand and try to do the best I can,” Lillie said. \nFirst-year Central coach Kyle Nelson marveled at North and the rest of the participants. BC finished seventh among eight teams. \n“It was great to be in a field like that. It’s an incredible field,” Nelson said. “Some of the numbers they put up, and to get two golfers out was awesome. Obviously, you want to get more, but I’m excited our two seniors get to go on and play.” \nA former Hinsdale South golfer, Nelson has playing experience at Cog Hill No. 1. A minority of Wednesday’s field could attest, and many of which who have toured the course did so during junior competitions growing up. \nMuch of the post-regional chatter swirled around scheduling practice rounds. Once scores and awards were finalized and announced, it was time to bid adieu to Sycamore for the moment. \nSurely, there won’t be a regional site three-peat, right? \n“I kind of hope it’s not here again,” Bundy grinned. “I’m not going to lie.”", "external_links": [], "published": "2015-10-08T06:36:00.000+03:00", "crawled": "2015-10-08T08:03:40.583+03:00", "highlightTitle": ""}