{"organizations": [], "uuid": "be20084db9739e0fe277007c78f275722366461c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.idahostatesman.com", "main_image": "http://media.idahostatesman.com/smedia/2015/10/19/15/55/1biaLR.AuSt.36.jpeg", "site_section": "http://www.idahostatesman.com/bsu-sports/index.rss", "section_title": "Idahostatesman.com -- Boise State Sports", "url": "http://www.idahostatesman.com/welcome_page/?shf=/2015/10/19/4042778_boise-state-cb-donte-deayon-out.html", "country": "US", "title": "Boise State basketball coach Leon Rice up for another pay bump", "performance_score": 0, "site": "idahostatesman.com", "participants_count": 1, "title_full": "Boise State basketball coach Leon Rice up for another pay bump", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T00:54:00.000+03:00", "replies_count": 0, "uuid": "be20084db9739e0fe277007c78f275722366461c"}, "author": "dsouthorn@idahostatesman.com (Dave Southorn)", "url": "http://www.idahostatesman.com/welcome_page/?shf=/2015/10/19/4042778_boise-state-cb-donte-deayon-out.html", "ord_in_thread": 0, "title": "Boise State basketball coach Leon Rice up for another pay bump", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Boise State basketball coach Leon Rice up for another pay bump By Dave Southorn \nBoise State men's basketball coach Leon Rice is up for a slight pay raise. The Broncos open the season Nov. 13 at Montana. IDAHO STATESMAN FILE PHOTO \nBoise State men’s basketball coach Leon Rice has accomplished plenty of things no other Bronco coach has done, and his contract is trying to catch up. \nAccording to the agenda for this week’s Idaho State Board of Education meeting, Rice is up for approval on a one-time bonus payment of $45,000 and a $10,530 increase for this season . He also will receive an annual raise of $25,000 instead of the 3 percent in his previous contract, which was amended last year . \nAlso, the documents for the latest amendment state, “If the coach schedules a home game against an opponent in the Resource Five conferences, he will be paid a $10,000 bonus. If he schedules a home game against an opponent who has an RPI in the top 125 (based on three year average), he will be paid a $7,500 bonus. However, if an opponent is in a Resource Five conference and also has an RPI in the top 125, Coach will only be paid the $10,000 bonus, not the additional $7,500 bonus.” In addition, if Rice schedules a road game against a “Resource” or “Power” Five, the school will retain only the first $40,000, plus expenses, instead of the $50,000 in previous deals. \nHis maximum salary for this season will be $758,000, factoring in base salary and supplemental compensation. His base salary this season will be approximately $625,000. In 2016-17 it is set to be $650,000, with the $25,000 increase each year thereafter. Rice, who led the Broncos to their second NCAA Tournament in the past three seasons in 2014-15, also led them to their first-ever Top 25 ranking. He is under contract through the 2019-20 season. \n... \nAlso of note from the State board agenda: \n— New Boise State swimming and diving coach Jeremy Kipp has his first contract up for approval. It will pay him a base salary of $80,000 over the next three seasons, with a maximum of $103,000 with incentives. \n— Gymnastics co-head coaches Neil Resnik and Tina Bird are up for new three-year deals. Resnick would get $78,802 in the first year, $81,800 the second and $84,800 the third. For Bird, it would be $64,356 the first year, then $70,000 and $75,000. \n— Boise State is seeking approval to allow alcohol sales to invited guests (boosters, etc.) before home basketball games. It would not be open to sales to all ticket holders, as “The Huddle” has done this season for games at Albertsons Stadium.", "external_links": [], "published": "2015-10-20T00:54:00.000+03:00", "crawled": "2015-10-20T23:26:48.784+03:00", "highlightTitle": ""}