{"organizations": ["Bristol Rovers"], "uuid": "cceede13a191ddbb359c6d6d3ef5bdad799eb263", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/div3.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/football/mansfield-12-bristol-rovers-match-report/6951844/", "country": "JE", "title": "Mansfield 1-2 Bristol Rovers: Match Report", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "Mansfield 1-2 Bristol Rovers: Match Report", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T20:01:00.000+03:00", "replies_count": 0, "uuid": "cceede13a191ddbb359c6d6d3ef5bdad799eb263"}, "author": "", "url": "http://www.sport.co.uk/football/mansfield-12-bristol-rovers-match-report/6951844/", "ord_in_thread": 0, "title": "Mansfield 1-2 Bristol Rovers: Match Report", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mansfield 1-2 Bristol Rovers: Match Report 17 Oct 2015 17:01:00 \ncomments Matt Taylor's late goal gives 10-man Bristol Rovers win over nine-man MansfieldMatt Taylor goal's in the eighth minute of stoppage time gave Bristol Rovers a 2-1 win as Mansfield's unbeaten home record ended in an ill-tempered affair that featured three red cards.Rovers led through Jermaine Easter's 15th-minute strike and although he was dismissed, the Stags were reduced to nine men before battling on and getting their rewards through Ryan Tafazolli nine minutes from time.However, in the last of eight added minutes, Taylor headed past Brian Jensen from close range from a James Clarke cross.Easter was sent off for Rovers in first-half stoppage time but was followed off the pitch by Krystian Pearce for an off-the-ball kick on the hour and then Nicky Hunt for a second bookable offence with 13 minutes to go.The home side had the best of the first half yet found themselves a goal down against the run of play 16 minutes in.Lee Brown put over a fine cross from the right which Daniel Leadbitter helped on and Easter crashed a rising shot home from seven yards.Easter was then red-carded in first-half stoppage time. About to be booked for a blatant dive in the box, he then clashed with the incoming Jamie McGuire and referee Mark Haywood quickly changed the colour of the card.Tempers boiled over again on the hour as Pearce was sent off for lashing out at Tom Lockyer, sparking a melee that saw two other players booked. One of those players was home skipper Hunt, who picked up a second caution for a trip on Sinclair.Rovers had a second goal disallowed soon after as an offside flag went up when Taylor tucked away Ellis Harrison's cross. Then, with just nine minutes to go, centre-half Tafazolli was there to drill home from 18 yards just inside the post as Rovers cleared a cross from their box. Two minutes later Harrison rattled the home crossbar with a shot from the right before Taylor popped up with a late winner. Related Sport News", "external_links": [], "published": "2015-10-17T20:01:00.000+03:00", "crawled": "2015-10-18T20:11:01.471+03:00", "highlightTitle": ""}