{"organizations": [], "uuid": "7296ecea203d422b2aae1d798b30bc438e643c69", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fredericknewspost.com", "main_image": "http://bloximages.newyork1.vip.townnews.com/fredericknewspost.com/content/tncms/custom/image/0fa3e2d0-fff4-11e4-89a9-77b204e19fad.jpg?_dc=1432238442", "site_section": "http://www.fredericknewspost.com//search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&c[]=sports,sports/*&f=rss", "section_title": "www.fredericknewspost.com - RSS Results in sports,sports/* of type article", "url": "http://www.fredericknewspost.com/sports/level/high_school/bears-firing-on-all-cylinders-blank-cadets/article_653d9216-e1fd-5c6c-952f-f73dd2cefba6.html", "country": "US", "title": "Bears firing on all cylinders, blank Cadets", "performance_score": 0, "site": "fredericknewspost.com", "participants_count": 1, "title_full": "Bears firing on all cylinders, blank Cadets", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T08:00:00.000+03:00", "replies_count": 0, "uuid": "7296ecea203d422b2aae1d798b30bc438e643c69"}, "author": "Joe Ferraro jferraro@newspost.com", "url": "http://www.fredericknewspost.com/sports/level/high_school/bears-firing-on-all-cylinders-blank-cadets/article_653d9216-e1fd-5c6c-952f-f73dd2cefba6.html", "ord_in_thread": 0, "title": "Bears firing on all cylinders, blank Cadets", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "0 \nSeveral of Oakdale’s boys soccer players had competed alongside each other for years, but that didn’t mean they were exempt from enduring periods of much-needed growth — or what Bears coach Dan Mulcahy called “the natural journey of any team.” \nFor Oakdale, that journey including the cohesion of what Mulcahy calls his Midfield 3: Brian Flatter, Shawn Martin and Joe Gula. \nFlanked by two of the three Thursday at Oakdale, Mulcahy talked at length about their chemistry while also sneaking in a playful jab at the players. \n“They’re just playing brilliantly,” Mulcahy said after the trio helped the Bears thoroughly dominate possession during a 3-0 victory over Frederick. “They’ve jelled perfectly defensively and offensively — about freakin’ time. \n“It took us a little bit of time to get used to it but again it’s really come together nice, and we’re firing on all cylinders.” \nIf the ball didn’t find their feet, Flatter, Gula and Martin found a way to take the ball, whether it was through an aggressive slide tackle, winning balls in the air or simply taking the ball away from a Frederick player. It was a big reason why Frederick didn’t attempt a shot until the 34th minute, when the Cadets’ Pedro Rincan took a pass from Carlos Granados and rifled a shot just over the crossbar. \n“We’re just finding ourselves,” Martin said. \nFlatter, who tapped in a rebound off a Brendan Ziegler shot that hit the left goalpost to start the scoring in the 27th minute, said the Bears’ respect for the skills of a top-notch Frederick midfield headed by the likes by Abel Ameyaw, Granados and Hein Aung, prompted the effort Oakdale’s midfield put forth on Thursday. \n“We knew Frederick would be an aggressive team, so we wanted to match them, come out stronger than them — make sure they couldn’t set the tone, set the pace,” said Flatter, who also delivered a corner kick that Gula headed in for the team’s final goal in the 74th minute. \nRincan’s shot early in the second half was the only dangerous scoring chance Bears goalkeeper Dakota Harich faced all day. While the back line of Brian Lilley, Bryce Currie and Alex Roos was steady in front of him, the Bears’ ability to apply constant pressure on the Cadets’ back line may have factored more into Oakdale (8-2-1, 2-1 Spires Division) becoming the first team to shut out Frederick (5-2-1, 0-2) all season. \nThat pressure, applied by Ryan Tan, Tommy Nguyen — he scored the Bears’ second goal off a pass from Ziegler — and Jake Merrick made it difficult for Frederick defenders to get the ball past the center line. Mulcahy, noticing that the Cadets hadn’t completed one match during which it did not give up a goal, was intent on testing the Frederick back line. \nOakdale outshot Frederick 12-3. \n“I thought the guys executed [the plan] perfectly,” Mulcahy said. \nFrederick coach JP Smith said the Bears’ style of play surprised him, saying Oakdale was “more physical than I expected.” The Cadets had devoted much of their time trying to neutralize a Bears strength: scoring off set pieces. However, because of the sheer amount of opportunities on set pieces, including several throw-ins by Currie — one of them led to Flatter’s first goal — Oakdale still scored two goals on set pieces. \n“When they continue to have those opportunities, the percentages [of scoring] go up,” Smith said. Tags", "external_links": [], "published": "2015-10-09T08:00:00.000+03:00", "crawled": "2015-10-09T11:51:56.555+03:00", "highlightTitle": ""}