{"organizations": ["Vikings", "Parkview", "Tigers", "Parkview Vikings"], "uuid": "0f90aaa5ed3d38caa7a49883e5964b8ca9f904b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ozarkssportszone.com", "main_image": "http://imgsrv.ozarkssportszone.com/image/DbGraphic/201510/3184178.jpg", "site_section": "http://www.ky3.com/sports/21049292_21049298?format=rss_2.0&view=feed", "section_title": "Sports Top Stories", "url": "http://www.ozarkssportszone.com/Parkview-rolls-Ozark-to-advance-in-districts/22104737", "country": "US", "title": "Parkview rolls Ozark to advance in districts", "performance_score": 0, "site": "ozarkssportszone.com", "participants_count": 0, "title_full": "Parkview rolls Ozark to advance in districts", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T09:55:00.000+03:00", "replies_count": 0, "uuid": "0f90aaa5ed3d38caa7a49883e5964b8ca9f904b1"}, "author": "", "url": "http://www.ozarkssportszone.com/Parkview-rolls-Ozark-to-advance-in-districts/22104737", "ord_in_thread": 0, "title": "Parkview rolls Ozark to advance in districts", "locations": ["JFK Stadium Ozark", "Mo.", "Springfield", "Nixa", "JFK Stadium"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hays", "Warren Atkins", "Chandler Doss", "Riley", "Josh McCann", "Chavis Nguyen", "Nathaniel Burlage", "Alex Boyer", "Josh Buchanan", "Doss", "Kameron Cook", "Anthony Hays", "Atkins", "Anthony Riley", "Burlage", "Josh Buchannan", "Cook", "Watkins"], "text": "Posted : Friday, 23 October 2015 11:43PM Parkview rolls Ozark to advance in districts By Alex Boyer stories@ky3.com Springfield, Mo. (For OzarksSportsZone.com) -- It didn’t take long for the Class 5 District 5 Parkview Vikings to get on the scoreboard Friday at JFK Stadium. Sophomore Warren Atkins took the opening kickoff 75-yards for a touchdown to give the Vikings an early 7-0 lead. Parkview head coach Anthony Hays gave high praise to Atkins and the Ozark football team for staying in the game. CLICK HERE FOR PHOTOS “It was absolutely huge to start off with that kickoff return for a touchdown,” Hays said. “It gave us a lot momentum, but hats off to Ozark for battling back and hanging in there and taking a lead on us.” Ozark answered back with a 26-yard touchdown pass from Kameron Cook to Josh Buchanan to tie things back up at 7. The Tigers were able to get good field position off a blocked punt, and then settled for a 33-yard field goal by Chandler Doss to take a 10-7 lead heading into the second quarter. Midway through the second quarter Ozark was looking to score to extend their lead before Warren Atkins made another huge play as he intercepted Cook and returned it 78-yard yards for a touchdown. The Vikings would go into halftime leading 20-10. The second half belonged to Parkview senior running back Anthony Riley. With 5:45 left in the third quarter Riley was able to score from 8-yards out to extend Parkview’s lead 26-10. The Tigers were down, but not out as they responded with a 9 play, 71-yard drive that was capped off by a 31-yard rushing touchdown by Nathaniel Burlage, and then successfully converted the two-point conversion. Burlage finished the game with 19 rushes for 117 yards. Three plays later, Riley was able to break loose on a 65-yard touchdown to regain the lead, and the Vikings wouldn’t look back.“He (Riley) is a great football player, but an even better person,” Hays said. “He is a class act who will always credit his offensive line like they deserved to be credited.” Riley finished the game with 25 carries for 209 yards and three touchdowns.“We had a lot of motivation going into this game,” Riley said. “We knew people were picking against us so we were ready to go from the beginning to prove them wrong.” Parkview will advance to play Nixa next Friday at JFK Stadium at 7:00 P.M. Ozark 18, Parkview 46 on Friday, at JFK Stadium Ozark 10 0 0 8 — 18 Parkview 10 13 6 20 — 46 First quarter PHS —Warren Atkins 75-yard kickoff return (Joy kick), 11:48 OHS — Josh Buchannan 26 yard pass from Kameron Cook (Doss kick), 7:58 OHS — Doss 33 yard field goal Second quarter PHS — Watkins 78 yard interception return (Joy kick), 9:35 PHS — Anthony Riley 3 yard run (Joy kick no good), 3:46 Third quarter PHS — Anthony Riley 8 yard run (Joy kick no good), 5:45 Fourth quarter OHS — Nathaniel Burlage 31 yard run (2 point conversion good), (7:41) PHS — Anthony Riley 65 yard run (Joy kick), 6:16 PHS —Chavis Nguyen 24 yard run (Joy kick no good), 4:04 PHS — Josh McCann 25 yard run (Joy kick), 1:37", "external_links": [], "published": "2015-10-24T09:55:00.000+03:00", "crawled": "2015-10-24T11:33:09.133+03:00", "highlightTitle": ""}