{"organizations": [], "uuid": "b049578cd25141d513062765f4fb55f638b3cb38", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nytimes.com", "main_image": "http://static01.nyt.com/images/2015/10/14/sports/Y-ULTIMATE-1/Y-ULTIMATE-1-facebookJumbo.jpg", "site_section": "http://www.nytimes.com/services/xml/rss/nyt/Sports.xml", "section_title": "NYT &gt; Sports", "url": "http://www.nytimes.com/2015/10/14/sports/where-disc-meets-globe-an-international-exhibitionof-ultimate-frisbee.html", "country": "US", "title": "Where Disc Meets Globe: An International Exhibition of Ultimate Frisbee", "performance_score": 1, "site": "nytimes.com", "participants_count": 1, "title_full": "Where Disc Meets Globe: An International Exhibition of Ultimate Frisbee - The New York Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T04:58:00.000+03:00", "replies_count": 0, "uuid": "b049578cd25141d513062765f4fb55f638b3cb38"}, "author": "Text and Photographs by Lauren Justice", "url": "http://www.nytimes.com/2015/10/14/sports/where-disc-meets-globe-an-international-exhibitionof-ultimate-frisbee.html", "ord_in_thread": 0, "title": "Where Disc Meets Globe: An International Exhibition of Ultimate Frisbee", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Photo Kevin Brown looked back toward the field while huddling with Radicals teammates before the exhibition, won by Madison, 28-21. Credit Lauren Justice for The New York Times Photo Seth Meyer of the Radicals scoring against the Buzz Bullets. The Radicals started in 2013 in the American Ultimate Disc League. Credit Lauren Justice for The New York Times Photo Players from both teams high-fiving fans after the game, which drew 1,155 to Breese Stadium in Madison, Wis. Credit Lauren Justice for The New York Times Photo A Radicals fan held a Frisbee while watching the game. Credit Lauren Justice for The New York Times Hosting an international ultimate Frisbee game in a small city like Madison, Wis., was an unexpected event embraced by the Madison Radicals, a pro team that started in 2013 as part of the American Ultimate Disc League. The Buzz Bullets, a world-class ultimate Frisbee team from Japan, competed against the Radicals, who had recently placed second in this year’s A.U.D.L. championship.\n“I think it’s great for building the community and for showing the rest of the world where ultimate is going,” Tim DeByl, a Radicals co-owner, said of the Aug. 20 game at Breese Stadium.\nUltimate is played on a football field, but there are significant differences between ultimate and football. “Ultimate is more of a beautiful game and you can play it super hard and people rarely get injured,” DeByl said, because of the no-contact rules. With seven people on the field from each team at a time, points are gained when a player catches a pass in the opposing team’s end zone.\nA crowd of 1,155 fans, the Radicals’ second-highest attendance of the year, came to support the first international A.U.D.L. exhibition game, won by the Radicals, 28-21, and were encouraged to bring their own food and drink. “We didn’t have all the bells and whistles, but they still came to support,” a Radicals captain, Pat Shriwise, said. “They took the time to come out on a Thursday night when people have work the next day, and that was really cool and unexpected.”\nFor Andrew Brown, a captain, the most memorable moment of the game came from the fans in the second half when Masahiro Matsuno of the Buzz Bullets scored after jumping over two Radicals defenders.\n“Even though it’s the opponent scoring on us, they were sort of enamored with their style and cheered just as loudly for his play as they do for us,” he said. “It was cool to see our fans not only enjoying our success, the Radicals, but seeing them do well also.”", "external_links": ["http://static01.nyt.com/images/2015/10/14/sports/Y-ULTIMATE-5/Y-ULTIMATE-5-superJumbo.jpg", "http://static01.nyt.com/images/2015/10/14/sports/14ultimate-1/14ultimate-1-blog225.jpg", "http://static01.nyt.com/images/2015/10/14/sports/Y-ULTIMATE-4/Y-ULTIMATE-4-superJumbo.jpg", "http://static01.nyt.com/images/2015/10/14/sports/Y-ULTIMATE-4/Y-ULTIMATE-4-blog225.jpg", "http://static01.nyt.com/images/2015/10/14/sports/Y-ULTIMATE-5/Y-ULTIMATE-5-blog225.jpg", "http://static01.nyt.com/images/2015/10/14/sports/14ultimate-1/14ultimate-1-superJumbo.jpg", "http://static01.nyt.com/images/2015/10/14/sports/Y-ULTIMATE-3/Y-ULTIMATE-3-blog225.jpg", "http://static01.nyt.com/images/2015/10/14/sports/Y-ULTIMATE-3/Y-ULTIMATE-3-superJumbo.jpg"], "published": "2015-10-14T04:58:00.000+03:00", "crawled": "2015-10-14T10:25:28.572+03:00", "highlightTitle": ""}