{"organizations": [], "uuid": "6885bfa0f5ed9e5498ab6e48cd990a4bfc9af0ea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.miamiherald.com", "main_image": "http://www.miamiherald.com/news/local/community/miami-dade/k1inhf/picture39232701/ALTERNATES/LANDSCAPE_1140/climate4", "site_section": "http://www.miamiherald.com/?widgetName=rssfeed&widgetContentId=712015&getXmlFeed=true", "section_title": "Breaking News, Sports, Weather & More | MiamiHerald.com &", "url": "http://www.miamiherald.com/news/local/community/miami-dade/article39232704.html", "country": "US", "title": "Hundreds march in Miami amid national climate change rally", "performance_score": 0, "site": "miamiherald.com", "participants_count": 1, "title_full": "Hundreds march in Miami amid national climate change rally", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:42:00.000+03:00", "replies_count": 0, "uuid": "6885bfa0f5ed9e5498ab6e48cd990a4bfc9af0ea"}, "author": "David Smiley \ndsmiley@miamiherald.com", "url": "http://www.miamiherald.com/news/local/community/miami-dade/article39232704.html", "ord_in_thread": 0, "title": "Hundreds march in Miami amid national climate change rally", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Hundreds march in Miami amid national climate change rally \nWednesday’s march was one of dozens around the country \n50 local organizations participated in a call to action on climate change \nLocal officials say they’re working to find solutions The participants of Wednesday’s climate change march in Miami created a number of installations. One group mimed parts of Miami sinking into the sea. David Smiley Miami Herald A crowd participating in a climate change march gathers outside the Stephen P. Clark Center before walking to the Torch of Friendship. Members of FANM stand in front. David Smiley Miami Herald Members of the National Water Dance attended Wednesday’s march. They performed interpretive dance during the march. http://se.nationalwaterdance.org/ David Smiley Miami Herald David McDougal, of the People’s Climate Movement, helped organize Wednesday’s march. He wore an outfit he found at a Portland thrift store, because, why not? David Smiley Miami Herald One of the many banners waved at Wednesday’s climate change march David Smiley Miami Herald 1 of 5 Order Reprint of this Story \nOn the heels of an international climate conference and a confluence of natural events that flooded parts of Miami Beach for days, hundreds marched through downtown Miami Wednesday evening in an eclectic call to action on climate change. \nHippies and hipsters, toddlers and teenagers, and environmentalists and politicians gathered at the Stephen P. Clarke Center and then walked several blocks down to the Torch of Friendship on Biscayne Boulevard. Along the way, a crowd of maybe 200 chanted with megaphones, stenciled warnings of sea level rise on the asphalt, and mimed South Beach sinking into the sea. \nAngelica Ramirez, a flower in her hair, walked with her 14-month-old son, Julio Gabriel Morales, swaddled in a baby sling. \n“It’s not just my world I’m saving,” said Ramirez, 28. “It’s also his.” \nThe march, organized by many of the same activists who pressured Miami-Dade Mayor Carlos Gimenez into placing money in the county’s budget to address sea level rise, didn’t draw the 800 predicted by organizers. But it nevertheless attracted a notable crowd by Miami standards, and was just one among dozens of People’s Climate Movement marches in cities around the country. \nThe march held significance, given that Miami, and in particular flood-prone Miami Beach, have become international symbols for sea level rise. In 2013, the World Bank penned a study that found that no city in the U.S. was more at risk from climate change than Miami, a reality that drew organizations from wide-ranging backgrounds to Wednesday’s march. \n“Whenever there’s a natural disaster, whether in Haiti, Chili or around the world, the low income families are the first impacted,” said Marleine Bastien, a prominent activist in Miami’s Haitian community and the executive director of Fanm Ayisyen nan Miyami. “The time for local officials to invest in climate justice, and invest in research to have a strategic plan to address climate change issues and rising sea level is now.” \nThe participants demanded action on climate change and sea level rise. At the very least, they attracted the attention of local politicians, including several county commissioners. One of them, Daniella Levine Cava, said Miami-Dade County is actively seeking solutions, working with various public entities, like the South Florida Water Management District, and pushing the state to be more proactive. \nJames Murley , Miami-Dade’s soon-to-be chief of resiliency, said Mayor Gimenez and the county commission are committed to making a difference. He said South Florida already has a significant network of organizations, resources and local government agencies working on the issue, so the county isn’t starting from scratch. He said they’re seeking as much cooperation as possible, and from the look of Wednesday’s march, they’ll have willing partners. \n“We’re one county. We can’t work alone. It’s a large system,” he said. “I’m going to do a lot of listening.” Related content", "external_links": [], "published": "2015-10-15T03:42:00.000+03:00", "crawled": "2015-10-15T04:09:17.574+03:00", "highlightTitle": ""}