{"organizations": [], "uuid": "d4d32a4748f545782ff165ceeea35849c101ab50", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.baltimoresun.com", "main_image": "http://www.trbimg.com/img-5616e768/turbine/ph-ac-cs-bayhawks-roster-1009-20151008", "site_section": "http://feeds.baltimoresun.com/baltimoresun/sports/college/rss2.0.xml", "section_title": "College Sports - Baltimore Sun", "url": "http://www.baltimoresun.com/sports/college/ph-ac-cs-bayhawks-roster-1009-20151008-story.html", "country": "US", "title": "Bayhawks announce protected list for expansion draft", "performance_score": 0, "site": "baltimoresun.com", "participants_count": 1, "title_full": "Bayhawks announce protected list for expansion draft", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T00:55:00.000+03:00", "replies_count": 0, "uuid": "d4d32a4748f545782ff165ceeea35849c101ab50"}, "author": "Staff Report", "url": "http://www.baltimoresun.com/sports/college/ph-ac-cs-bayhawks-roster-1009-20151008-story.html", "ord_in_thread": 0, "title": "Bayhawks announce protected list for expansion draft", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bayhawks announce protected list for expansion draft Cannons at Bayhawks LAXM By Matthew Cole / Capital Gazette Bayhawk's Matt Danowski cuts as Cannon's Chad Wiedmaier defends the crease during Thursday nights game held at the Navy Marine Corps Memorial Stadium. Bayhawk's Matt Danowski cuts as Cannon's Chad Wiedmaier defends the crease during Thursday nights game held at the Navy Marine Corps Memorial Stadium. (By Matthew Cole / Capital Gazette) Staff Report Atlanta Blaze recently announced as newest member of league \nThe Chesapeake Bayhawks announced their 12-man protected list, which had to be submitted to the Major League Lacrosse office by 5 p.m. on Wednesday. \nChesapeake protected four attackmen, four midfielders, two defensemen, one goalie and one faceoff specialist. Owner Brendan Kelly, president Dave Cottle and newly-named head coach Brian Reese spent considerable time deliberating over which players to protect. \n\"We had to make some very difficult decisions. When you have a bunch of talented players that you want to be part of your team it is really tough,\" Reese said. \"We tried to strike a good balance between offense and defense. We selected the players we feel are most valuable at their respective positions.\" \nMajor League Lacrosse required the eight existing franchises to submit protected lists in advance of the Expansion Draft, which will be held Nov. 18 via conference call. Commissioner Dave Gross recently announced creation of the Atlanta Blaze as the newest member of the league. \nChesapeake previously announced a 23-man protected list. The Bayhawks trimmed that by one this week by trading midfielder Kevin Crowley to the Charlotte Hounds for the 11th pick in the 2016 Collegiate Draft and a second round selection in the 2016 Supplemental Draft.", "external_links": [], "published": "2015-10-09T00:55:00.000+03:00", "crawled": "2015-10-09T19:26:22.669+03:00", "highlightTitle": ""}