{"organizations": [], "uuid": "a7c93900a64b92694a05017dbd4666fb3bb7cb7b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.denverpost.com", "main_image": "http://extras.mnginteractive.com/live/media/site333/2015/1021/20151021__USGreatPumpkins~p2.jpg", "site_section": "http://www.denverpost.com/", "section_title": "Colorado Breaking News, Sports, Weather, Traffic, Jobs - The Denver Post", "url": "http://www.denverpost.com/lifestyles/ci_29006261/how-do-you-grow-2-000-pound-pumpkin", "country": "US", "title": "How do you grow a 2,000-pound pumpkin? It's complicated", "performance_score": 0, "site": "denverpost.com", "participants_count": 1, "title_full": "How do you grow a 2,000-pound pumpkin? It's complicated - The Denver Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T19:11:00.000+03:00", "replies_count": 0, "uuid": "a7c93900a64b92694a05017dbd4666fb3bb7cb7b"}, "author": "Michelle R. Smith  Associated Press", "url": "http://www.denverpost.com/lifestyles/ci_29006261/how-do-you-grow-2-000-pound-pumpkin", "ord_in_thread": 0, "title": "How do you grow a 2,000-pound pumpkin? It's complicated", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "COVENTRY, R.I. (AP) — Ron Wallace grows pumpkins nearly the size of a Fiat.\nFrom the pumpkin patch in his rural Rhode Island backyard, Wallace has become the rock star of giant pumpkin-growing. He was the first person in the world to break the 2,000-pound, or 1-ton, barrier when he grew a 2,009-pound pumpkin in 2012, and he previously broke the world record in 2006. A friend calls him a \"mainstreamer,\" someone whose passion for the hobby has spread word to the broader public.\nWallace, a country club manager, has spent 27 years at the hobby, swapping ideas with growers worldwide. About 30,000 people grow giant fruits and vegetables competitively, and pumpkins are most popular, said Andy Wolf, president of the Great Pumpkin Commonwealth, which he calls \"the NFL of pumpkin-growing.\"\nRon Wallace, right, drops the rear gate of a trailer holding one of the giant pumpkins he grew this season prior to the weigh-off at the Rochester Fair in Rochester, N.H., Saturday, Sept. 19, 2015. (AP Photo/Charles Krupa) (Charles Krupa/AP) \"All walks of life. Doctors, lawyers, farmers,\" Wallace says. \"The bond is giant pumpkins.\"\nIt all starts with the seed. Top growers know their pumpkins' lineage back generations, and the Great Pumpkin Commonwealth keeps records.\nSeeds from Wallace's 2,009-pound pumpkin have sold for more than $1,000 in a charity auction. Wallace has seen counterfeits sold on eBay. Still, many growers freely swap seeds with each other or lobby top growers to use a seed they think is promising.\nLike most serious growers, Wallace ties plants' blossoms closed and hand-pollinates them so he can be sure of the mother (the seed) and the father (the pollinator) and protect them from bees carrying pollen from a neighbor's squash.\nAdvertisement The vines can grow 1 foot or more per day, and pumpkins can put on 45 pounds per day, mostly from water. The best pumpkins every year follow the weather. If conditions were right in the Ohio Valley, growers there might see a string of huge pumpkins. When there's a drought, as in California, don't expect a bumper crop.\nJudges measure as volunteers examine the entries prior to the giant pumpkin contest weigh-off at the Rochester Fair in Rochester, N.H., Saturday, Sept. 19, 2015. (AP Photo/Charles Krupa) (Charles Krupa/AP) Standing in Wallace's fields, a person feels smaller. Around the edges where he grows flowers and vegetables, his sunflowers have reached 18 feet. A tomato plant produced a 5-pound tomato. Wallace has spent more than two decades painstakingly researching soil science and experimenting. This year, he launched a product based on his growing program, Wallace Organic Wonder. It includes among its ingredients mycorrhizal fungi. He calls it a superfungus that helps deliver water and nutrients.\n\"For growers who are competitive, it's year-round. They're studying, they're researching, they're building greenhouses, they're looking at genetics,\" Wallace said. \"Most competitive giant pumpkin growers aren't taking summer vacations.\"\nA judge takes a look under the pumpkin entry, grown by Ron Wallace, during the giant pumpkin contest weigh-off at the Rochester Fair in Rochester, N.H., Saturday, Sept. 19, 2015. (AP Photo/Charles Krupa) (Charles Krupa/AP) Wallace, who's single, works up to 40 hours a week on his hobby, checking for mice and disease and burying vines, keeping pumpkins covered in sheets to protect the skin.\nMost growers end up spending hundreds or thousands of dollars per year. If they're lucky, they can sell what they grow for a holiday display for $1 a pound, maybe more for a state record, but they say they rarely make money or break even.\nOne place these pumpkins won't end up: pumpkin pie. They're too big to be tasty.\nMany growers branch out. Wallace's friend Joe Jutras, of Scituate, is a 2007 pumpkin world record holder. Now, he's going for the trifecta: world records for heaviest pumpkin (check), longest long gourd (check) and heaviest squash (still working on it after a squash that was on track to break the record split).\nOther competitors watch as the entry grown by Ron Wallace is loaded onto a scale during the giant pumpkin contest weigh-off at the Rochester Fair in Rochester, N.H., Saturday, Sept. 19, 2015. (AP Photo/Charles Krupa) (Charles Krupa/AP) The weigh-off is the moment of truth. Crews check for holes, cracks and rot, which would disqualify the entry, before putting it on the scale.\n\"You can do anything. You can tinker with professional plant hormones or whatever fertilizer you think's going to give you an advantage,\" Wolf said. \"The only thing you can't do is somehow doctor the actual fruit.\"\nWallace took the biggest pumpkin he grew this season to a weigh-off in Warren on Oct. 10. He won top prize weeks earlier at the Rochester Fair in New Hampshire, with a 1,975-pound gourd. A greenhouse grower in Switzerland holds the world record: 2,323 pounds, grown from a Wallace seed.\nWallace estimates disease cost his Warren pumpkin as much as 150 pounds, and he was wary before the weigh-in.\nRon Wallace raises his arms as the weight of 1,975 pounds is announced for his pumpkin entry, which won the competition, during the great pumpkin contest weigh-off at the Rochester Fair in Rochester, N.H., Saturday, Sept. 19, 2015. (AP Photo/Charles Krupa) (Charles Krupa/AP) \"I really ratcheted up with water this year,\" he said.\nThe result was a victory: 2,230 pounds, a new North American record. It's the second-biggest pumpkin ever grown and the largest grown worldwide this year.\nIt's closer than Wallace has ever been to 2,500 pounds, the next pumpkin-growing milestone.\n\"I do feel I'm on the edge. I know my program is capable,\" he says, as he sketches out plans for next year. \"We're gonna give it a shot.\"\n———\nAssociated Press writer Rodrique Ngowi in Warren and photographer Charles Krupa in Rochester, New Hampshire, contributed to this report.", "external_links": ["http://extras.mnginteractive.com/live/media/site333/2015/1021/20151021__USGreatPumpkins~p6_200.jpg", "http://extras.mnginteractive.com/live/media/site333/2015/1021/20151021__USGreatPumpkins~p3_200.jpg", "http://extras.mnginteractive.com/live/media/site333/2015/1021/20151021__USGreatPumpkins~p5_200.jpg", "http://extras.mnginteractive.com/live/media/site333/2015/1021/20151021__USGreatPumpkins~p2_200.jpg", "http://extras.mnginteractive.com/live/media/site333/2015/1021/20151021__USGreatPumpkins~p4_200.jpg"], "published": "2015-10-21T19:11:00.000+03:00", "crawled": "2015-10-22T10:02:49.825+03:00", "highlightTitle": ""}