{"organizations": [], "uuid": "2b5cc19167a4c4b04d5d1cde299ea498f5c863cf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.arcamax.com", "main_image": "http://www.arcamax.com/newspics/130/13084/1308443.jpg", "site_section": "http://www.arcamax.com/sports/", "section_title": "Sports | ArcaMax Publishing", "url": "http://www.arcamax.com/sports/football/s-1731346?fs", "country": "US", "title": "Tucker's 52-yard field goal gives Ravens 23-20 overtime win over Steelers | Football", "performance_score": 0, "site": "arcamax.com", "participants_count": 1, "title_full": "Tucker's 52-yard field goal gives Ravens 23-20 overtime win over Steelers | Football | ArcaMax Publishing", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "2b5cc19167a4c4b04d5d1cde299ea498f5c863cf"}, "author": "arcamax.com", "url": "http://www.arcamax.com/sports/football/s-1731346?fs", "ord_in_thread": 0, "title": "Tucker's 52-yard field goal gives Ravens 23-20 overtime win over Steelers | Football", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PITTSBURGH -- It might not be known for weeks, if not months. But if the Ravens go on to save their season, they'll probably look back on this October night at the home of their biggest rivals and remember how their playoff run started.\nAnd they'll have their much-maligned defense and the Pittsburgh Steelers' struggling kicker to thank.\nTwice late in the fourth quarter, the Steelers had the ball in Ravens territory but Josh Scobee missed field goals that would have made it a two-possession game. Twice in overtime, the Steelers had the ball in Ravens territory but were stopped on fourth-and-short.\nAnd Justin Tucker finally ended the marathon game with a 52-yard field goal with just five minutes remaining in overtime, sending the Ravens to a pulsating, 23-20 victory before a stunned crowd of 63,929 at Heinz Field.\nWith the victory, in a game where the Ravens trailed 20-7 in the third quarter and needed a last-seconds Tucker field goal to tie the game and force overtime, the Ravens improved to 1-3.\nHolding a 7-3 lead about midway through the second quarter, the Ravens allowed the Steelers to reel off 17 unanswered points. Flacco, who threw a momentum-stalling interception in Pittsburgh territory about midway through, made another key mistake. Following a false start penalty to start the second half, Flacco got outside the pocket but Cameron Heyward slapped the ball out of his hands.\nThe ball ricocheted off Flacco's knee and Steelers safety Ross Cockrell recovered it before falling out of bounds. That gave the Steelers the ball at the Ravens' 26 and the home team needed just six plays to convert.\nMichael Vick hit Darrius Heyward-Bey for a 9-yard touchdown catch. Heyward-Bey got behind Lardarius Webb in the back of the end zone and gained possession before falling out of bounds.\nThe touchdown gave the Steelers a 20-7 lead. The Ravens, who had done very little on offense except for the one first-quarter drive, finally found some momentum.\nA 33-yard run by Justin Forsett set up Flacco's 15-yard touchdown pass to Kamar Aiken. Trailing by six, the Ravens again had the ball in Steelers territory. However, John Harbaugh eschewed a 37-yard field goal by Tucker and ran a fake on fourth-and-20. Holder Sam Koch pitched the ball to tight end Nick Boyle, who was tackled by Sean Spence for a 3-yard loss.\nNot coming away with any points loomed large when on their next drive, the Ravens settled for a 40-yard field goal by Tucker. But instead of tying the game, the three points cut the Ravens' deficit to 20-17.\nThe Ravens had two more chances to tie the game. On the first one, they crossed midfield but Flacco was stopped on a quarterback sneak on fourth-and-1. However, they got another chance when Scobee missed a 49-yard field goal attempt.\nBut after the Ravens again turned the ball over on downs, the Steelers got the ball back with just over two minutes to play and a chance to ice the game. However, Scobee missed another field goal, this one from 41 yards.\nThe Ravens got the ball back at their own 31-yard line with one timeout and just over a minute to play. With Steve Smith Sr. (back) and Michael Campanaro (leg) out of the game with injuries, Flacco hit Kamar Aiken for 25 yards to set up Tucker's game-tying 42-yard field goal in the final seconds.\nIn the first half, he Ravens continued a disturbing trend of falling behind early. After both teams traded three-and-outs, the Steelers turned to their run game to advance into Ravens territory. Three consecutive runs netted them a total of 26 yards and then Vick hit Markus Wheaton for 19 yards to cross midfield.\nBut the Ravens defense stiffened and stopped Vick for a 3-yard gain on third-and-5. Pittsburgh settled for a 45-yard field goal by Scobee and a 3-0 lead about midfield through the first quarter.\nOn their first drive, the Ravens didn't run the ball at all. However, they made a concerted effort on their second drive to get the ground game going. After back-to-back first-down gaining completions to Smith and rookie tight end Maxx Williams, Forsett picked up 11 yards on back-to-back carries.\nBackup Lorenzo Taliaferro then took his turn and got a first down on the ground, moving inside Pittsburgh's 20. On third-and-2 from the Steelers' 9, Flacco handed the ball off to wide receiver Michael Campanaro, who seemed to be stopped for a loss. However, Campanaro broke a tackle attempt by linebacker Arthur Moats, faked out safety Will Allen and hurtled into the end zone for a touchdown.\nThe second touchdown of Campanaro's career culminated arguably the Ravens' best drive of the season. They used 12 plays to go 75 yards and eat up more than seven minutes, and they did it with a running game that was mostly absent over the first three games. The drive included eight rushing attempts for 47 yards.\nThe defense gave the offense the ball right back and the Ravens started to mount another drive. Flacco hit Williams for seven yards and Kamar Aiken for 18 to put the Ravens at the Steelers 34. That's when the mistakes started. Flacco fumbled Jeremy Zuttah's snap on first down. Then, on third-and-6 from the 30, Flacco tried to get the ball to Smith, but didn't notice cornerback Ross Cockrell come off his man and break on the ball.\nCockrell intercepted Flacco's throw and returned it 37 yards to the Ravens' 36. Only a tackle by offensive lineman Rick Wagner saved a touchdown. The defense didn't allow any points on the ensuing Steelers drive, but the Ravens missed out on a valuable scoring opportunity and did not regain momentum in the half.\nMeanwhile, the Steelers offense started to find its rhythm. Relying mostly on running back Le'Veon Bell, Pittsburgh moved deep into Ravens territory. On first down from the 11-yard line, Vick handed the ball to Bell, who ran toward the left end. But with little room there, he cut back toward the right side and followed a lead block by Vick on Webb for the touchdown. The referee seemed to miss a holding call by fullback Will Johnson on the play, but that was little consolation to the Ravens, who trailed 10-7.\nAnother three-and-out by the Ravens and an unnecessary roughness call on fullback Kyle Juszczyk in punt coverage put the Steelers at the Ravens' 45 with 39 seconds to play. From there, Pittsburgh settled for Scobee's 36-yard field goal and a 13-7 halftime lead.\n(c)2015 The Baltimore Sun\nVisit The Baltimore Sun at www.baltimoresun.com\n ", "external_links": ["http://www.facebook.com/sharer.php?u=http://www.arcamax.com/sports/football/s-1731346&h=Tucker%27s+52%2Dyard+field+goal+gives+Ravens+23%2D20+overtime+win+over+Steelers", "http://twitter.com/share?url=http://www.arcamax.com/sports/football/s-1731346&hashtags=ArcaMax", "https://plus.google.com/share?url=http://www.arcamax.com/sports/football/s-1731346"], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-03T03:06:01.115+03:00", "highlightTitle": ""}