{"organizations": [], "uuid": "ed783d63915cdb4e992098ca146933862b6dc314", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mid-day.com", "main_image": "http://images.mid-day.com/images/2015/oct/8Sourav-Ganguly-l.jpg", "site_section": "http://www.mid-day.com/Resources/midday/rss/sports.xml#", "section_title": "sports", "url": "http://www.mid-day.com/articles/eden-diary-thank-you-didi-for-dada/16593151", "country": "IN", "title": "Eden diary: Thank you, Didi for Dada", "performance_score": 0, "site": "mid-day.com", "participants_count": 1, "title_full": "Eden diary: Thank you, Didi for Dada - Sports", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "ed783d63915cdb4e992098ca146933862b6dc314"}, "author": "Arup Chatterjee", "url": "http://www.mid-day.com/articles/eden-diary-thank-you-didi-for-dada/16593151", "ord_in_thread": 0, "title": "Eden diary: Thank you, Didi for Dada", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kolkata: Harbhajan Singh, at his 'happy hunting ground', spelt out what will be 'different' this time. \"He won't be watching the game but I'm sure he will be blessing us from somewhere,\" he said of Jagmohan Dalmiya.\n\n\nA hoarding thanking West Bengal CM Mamata Banerjee for selecting Sourav Ganguly as CAB president outside Eden Gardens \nThe third T20 against South Africa is the first big match at the Eden since the passing away of the cricket administrator last month. His photo on every ticket, a two-minute silence before the match, a three-minute documentary that will be shown during the break, large portraits at the 20 entrances to the stadium, huge collages lining the road in front of Eden... the CAB is using the occasion to pay tribute to the man credited with bringing big money into the game and making India a powerful player in it. But it's hard to miss a hoarding opposite the Club House.\n\"Thank You Didi...', it begins and goes on to \"convey our heartfelt congratulation\" to Chief Minister Mamata Banerjee for \"selecting Sourav Ganguly as the president and Abhisek Dalmiya, son of late Jagmohan Dalmiya, as the joint-secretary\" of the CAB.\nPolitical interference may be frowned upon by the world governing bodies of various sport, but not here. Here, 'Didi' rules and so will 'Dada'. Ganguly is expected to take over Dalmiya's mantle at CAB at a Special General Meeting on October 15. Unopposed.\nIn dew course \nDiscussions on dew, and how it is making life difficult for bowlers in the second half of the games, is trending but there is little fear from that here at this time of the year. But, then, the Met office here has issued a more serious threat — that of thundershowers.", "external_links": [], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T09:42:17.598+03:00", "highlightTitle": ""}