{"organizations": [], "uuid": "3a7588798be6fbd0b24b8880f43c4229e1ce1b28", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mb.com.ph", "main_image": "http://www.mb.com.ph/wp-content/themes/city-desk/images/fb-image_200x200.jpg", "site_section": "http://www.mb.com.ph/category/sports/sports-news/", "section_title": "mb.com.ph | Philippine News | Archive | Sports News", "url": "http://www.mb.com.ph/up-nips-navy-tossers-in-shakeys-opening/", "country": "CA", "title": "UP nips Navy tossers in Shakey’s opening", "performance_score": 0, "site": "mb.com.ph", "participants_count": 1, "title_full": "UP nips Navy tossers in Shakey’s opening | mb.com.ph | Philippine News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "3a7588798be6fbd0b24b8880f43c4229e1ce1b28"}, "author": "Kristel Satumbaga", "url": "http://www.mb.com.ph/up-nips-navy-tossers-in-shakeys-opening/", "ord_in_thread": 0, "title": "UP nips Navy tossers in Shakey’s opening", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "by Kristel Satumbaga\nOctober 11, 2015 Games Today\n(The Arena, San Juan)\n12:45 p.m. – Coast Guard vs PLDT (V-League)\n3 p.m. – Kia Forte vs Army (V-League)\n5 p.m. – PLDT vs Cignal (Spikers’ Turf)\nUniversity of the Philippines (UP) shrugged off an opening set defeat and outplayed Navy, 19-25, 25-23, 25-23, 25-23, to start its campaign on a high note in the Shakey’s V-League Season 12 Reinforced Conference yesterday at The Arena in San Juan.\nThe Lady Maroons played tentatively in the opening set which the Lady Sailors took advantage to take the initiative.\nBut with Maria Lina Isabel Molde and Nicole Tiamzon leading the charge in the second set, the Lady Maroons engaged their rivals in a torrid exchange of heavy shots to the delight of the crowd.\nThe solid spiking of Molde and Tiamzon inspired their teammates and UP managed to eke out a thrilling second set win that set the tone for the team’s huge opening day victory.\nUP is using the tournament to gain more confidence in time for the UAAP volleyball season starting in February next year.\nMolde led UP with 17 points while Tiamzon chipped in 14 while combining for 28 of the team’s 49 kills.\nThe game was so intense that UP needed one hour and 47 minutes to seal the win.\nSkipper Kathy Bersola, who is playing for the first time after recovering from an anterior cruciate ligament (ACL) injury she sustained early this year, finished with eight points highlighted by four blocks.\nJewel Lai also contributed to UP’s win by accounting for 31 of the team’s 35 excellent sets, even as Princess Gaiser and Molde conspired for 22 excellent digs.\nThe combined efforts of Molde, Tiamzon and Bersola overshadowed the performances of Navy’s Hezzymie Acuna, Lilet Mabbayad and Pau Soriano, who finished with 15, 13 and 13 points, respectively.\nIn all, UP tallied 13 blocks.\nMeanwhile, powerhouse teams PLDT Home Ultera and Army start their own bids today when they clash with separate foes.\nThe Ultrafast Lady Spikers collide with the Coast Guard tossers at 12:45 p.m., while the Lady Troopers tangle with the Kia Forte crew at 3 p.m.\nPLDT is slated to parade a star-studded lineup bannered by Collegiate Conference Most Valuable Player (MVP) Alyssa Valdez, last year’s Conference and Finals MVP Aiza Maizo-Pontillas, NCAA MVP Gretchel Soltones, veteran setter Rubie De Leon and Sue Roces.\nIn the Spikers’ Turf Reinforced Conference, Alnakran Abdilla produced 15 kills, one block and a service ace as Air Force bested a tough Instituto Estetico Manila (IEM), 25-19, 25-27, 25-21, 25-20.", "external_links": ["http://i.po.st/static/v3/post-widget.js#publisherKey=4qcr4d26tnrf260rqrda&retina=true"], "published": "2015-10-11T03:00:00.000+03:00", "crawled": "2015-10-11T20:58:13.899+03:00", "highlightTitle": ""}