{"organizations": [], "uuid": "c1e877c3e80b2712f31a412541c721d34f113ddb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.masslive.com", "main_image": "http://imgick.masslive.com/home/mass-media/width620/img/republican/photo/2015/10/13/18962181-large.jpg", "site_section": "http://impact.masslive.com/sports/atom.xml", "section_title": "Sports - MassLive.com", "url": "http://www.masslive.com/news/index.ssf/2015/10/springfield_mayor_domenic_sarno_talks_underway_with_pawsox_ownership.html", "country": "US", "title": "Mayor Domenic Sarno: Talks underway with PawSox ownership on interest in Springfield", "performance_score": 0, "site": "masslive.com", "participants_count": 1, "title_full": "Mayor Domenic Sarno: Talks underway with PawSox ownership on interest in Springfield", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T23:55:00.000+03:00", "replies_count": 0, "uuid": "c1e877c3e80b2712f31a412541c721d34f113ddb"}, "author": "Peter Goonan | pgoonan@repub.com", "url": "http://www.masslive.com/news/index.ssf/2015/10/springfield_mayor_domenic_sarno_talks_underway_with_pawsox_ownership.html", "ord_in_thread": 0, "title": "Mayor Domenic Sarno: Talks underway with PawSox ownership on interest in Springfield", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments \n( The story was updated at 4:40 p.m.) \nSPRINGFIELD — Mayor Domenic J. Sarno said Tuesday that conversations have begun with the ownership of the Pawtucket Red Sox regarding if there might be an interest in moving the Triple-A baseball team to Springfield, possibly in the North End. John Suchocki, The Republican \nThe initial discussions were revealed by Sarno during a meeting between the mayor and the Editorial Board of The Republican. \n\"I think people are hungry for it,\" Sarno said, of the opportunity for the PawSox team. \"Right now, they really don't have a home, and we would love to be that home. It's got to be a good financial deal, logistics have to make sense (and) the private investment.\" \nThe Pawtucket Red Sox, the Triple-A affiliate of the Boston Red Sox, is searching for a new home and recently ended their effort to pursue a waterfront location for a new stadium proposed in downtown Providence, Rhode Island, according to published reports. \nSarno, during Tuesday's meeting with The Republican and MassLive editors and reporters, said he could see a Triple-A Red Sox stadium becoming an anchor in the North End, and the MGM Springfield casino project being the anchor in the South End, with a redeveloped Union Station in between the two projects. \n\"We are having conversations and we are looking to formalize it a bit more,\" Sarno said. But they know as we did with the entertainment gaming thing, we rolled out the red carpet and we went after the competition and said we are open for business.\" \nSuch a baseball stadium would have to make sense financially and logistically, Sarno said. Asked if it might involve local tax dollars, Sarno said he would have to evaluate the private investment proposed, and potential state and federal assistance. \nSarno said he has spoken to PawSox co-owner Larry Lucchino and Boston Red Sox Chief Operating Officer Sam Kennedy. \nA Triple-A stadium would have to be able to accommodate 11,000 spectators, he said. \nSpringfield had tried to bring professional baseball back to Springfield in the 1990s, but a proposed stadium at the Northgate Plaza failed in 2000 when Superior Court Judge Constance M. Sweeney ruled the land taking was not valid under former Mayor Michael J. Albano. \nSarno turned up the love for the PawSox at a recent appearance at a Boston Globe awards event. \nSarno took the stage on Oct. 6, at the House of Blues in Boston to accept a Globie award on behalf of Springfield being named \"best comeback city.\" He used the opportunity to send a message to Lucchino, who also was in attendance. \nAccording to Springfield City Hall communications director James Leydon, who attended the event, Sarno told Lucchino from the stage that Springfield could \"show a lot of love\" to the Pawtucket Red Sox. \nMGM Springfield plays a big role, Sarno said Tuesday, of the baseball effort. \n\"Done the right way, who would not want to have Triple-A home state, home town Red Sox franchise, 90 miles down the road, the stars of the future going there ?\" Sarno said Tuesday. \"So I had face to face conversations with Mr. Lucchino and very, very good conversations with Sam Kennedy.\" \nSpringfield had a history of professional baseball here for many decades, with the Springfield Giants becoming the last to play here in 1965 at Pynchon Park.", "external_links": [], "published": "2015-10-13T23:55:00.000+03:00", "crawled": "2015-10-14T01:24:44.295+03:00", "highlightTitle": ""}