{"organizations": [], "uuid": "d17dcc3b60dcaa534d1625fb9dd1db9c7b74e427", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dallasnews.com", "main_image": "http://www.dallasnews.com/incoming/20151022-1445569321-20151022_gma_al8_220_46813981_962235.jpg.ece/BINARY/original/1445569321-20151022_gma_al8_220_46813981_962235.JPG", "site_section": "http://www.dallasnews.com/sports/", "section_title": "Dallas-Fort Worth Sports News - News for Dallas, Texas ", "url": "http://www.dallasnews.com/sports/dallas-stars/headlines/20151022-heika-stars-4-1-win-over-penguins-was-epitome-of-balanced-team-effort.ece", "country": "US", "title": "Heika: Stars' 4-1 win over Penguins was epitome of balanced team effort", "performance_score": 0, "site": "dallasnews.com", "participants_count": 1, "title_full": "Heika: Stars' 4-1 win over Penguins was epitome of balanced team effort | Dallas Morning News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T06:10:00.000+03:00", "replies_count": 0, "uuid": "d17dcc3b60dcaa534d1625fb9dd1db9c7b74e427"}, "author": "Mike Heika", "url": "http://www.dallasnews.com/sports/dallas-stars/headlines/20151022-heika-stars-4-1-win-over-penguins-was-epitome-of-balanced-team-effort.ece", "ord_in_thread": 0, "title": "Heika: Stars' 4-1 win over Penguins was epitome of balanced team effort", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PITTSBURGH -- Stars forward Vernon Fiddler was asked Thursday morning what specific area was to credit for the team's fast start, and he couldn't really nail any one thing down.\"Well, we've done a really good job playing as a team,\" Fiddler said. \"You can go up and down the game plan, and we're executing on everything we're working on.\"\nHis words then played out Thursday night as the Stars put together the epitome of a balanced team game and took a 4-1 win over the Pittsburgh Penguins to complete a sweep of a four-game road trip and push their record to 6-1-0.\nDallas received goals from three different lines, went 1 for 3 on the power play, killed five penalties, and saw Antti Niemi stop 33 shots. Just as important, this came against a Pittsburgh team that had high energy early and was looking to avenge a 3-0 loss to the Stars in the season opener in Dallas.\n\"We are going to be challenged a lot more. Teams are going to realize we're a dangerous team, and it's just going to get tougher,\" defenseman Johnny Oduya said. \"Any challenge for us is a good thing, that's how we get better.\"\nThe Stars had no choice against the Penguins, who were humming early. Niemi had to make several big saves, including stopping Evgeni Malkin on a short-handed breakaway. Then, as Dallas started to stem the tide, Oduya sent a floating shot on net from the left point, and it slipped past Pittsburgh goalie Marc-Andre Fleury. The Stars had momentum and a lead they would never relinquish.\n\"I just threw it to the net and got lucky,\" Oduya said. \"I'll take anything, especially in the first period when we were on our heels. It gave us a little bit of air in our lungs.\"\nJohn Klingberg scored on the power play a few minutes later, Jason Spezza stole a pass and scored unassisted early in the second period, and rookie Mattias Janmark popped in a second-period rebound for his third goal of the season. It was a harsh turnaround for the deflated Penguins, who were slowed by some smart adjustments by the Stars.\nWhile Pittsburgh tried to counterattack early and had success, the Stars started getting sticks on the ice and cutting off passes in the neutral zone. Quickly, an 8-2 Pittsburgh lead in shots on goal turned into an almost-even slate after 40 minutes\n\"We came back and clogged up the neutral zone and forced them to chip,\" defenseman Jason Demers said. \"They're a rush team, and when they can't get those chances off the rush, it kind of stymies their game.\"\nAnd while Pittsburgh had a 14-2 advantage in shots on goal in the third period, that also was a part of the Stars' adjustments. Instead of taking chances and trying to stretch the lead, Dallas played it safe.\n\"We're working on things that I really think are important,\" Stars coach Lindy Ruff said. \"When we're leading, we're making better decisions. And when we're making those decisions, you can keep the other team from high-quality opportunities.\"\nThe only black mark for the Stars was a five-minute major and a game misconduct for elbowing called on Demers in the final four minutes. Demers was trying make a reverse hit along the boards when he elbowed Pittsburgh's Nick Bonino.\n\"I just mistimed it. I hope he's all right,\" Demers said. \"I just tried to counter-hit, and it was a little bit too early. It wasn't malicious.\"\nRuff said he does not believe the league will issue supplementary discipline.\n\"The Demers play was just reaction to getting hit,\" Ruff said. \"I didn't find anything bad about it.\"\nTwitter: @MikeHeika\nOn Twitter:\n @MikeHeika", "external_links": ["http://twitter.com/MikeHeika", "https://twitter.com/MikeHeika"], "published": "2015-10-23T06:10:00.000+03:00", "crawled": "2015-10-23T13:53:46.258+03:00", "highlightTitle": ""}