{"organizations": [], "uuid": "725b330c82701cf6cb7e34319f6c38a3b3461c63", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "", "site_section": "http://bostonherald.com/sports/golf", "section_title": "Sports: Golf | Boston Herald", "url": "http://bostonherald.com/sports/golf/2015/10/michael_allen_scott_mccarron_share_lead_in_san_antonio", "country": "US", "title": "Michael Allen, Scott McCarron share lead in San Antonio", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "Michael Allen, Scott McCarron share lead in San Antonio | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "725b330c82701cf6cb7e34319f6c38a3b3461c63"}, "author": "Associated Press", "url": "http://bostonherald.com/sports/golf/2015/10/michael_allen_scott_mccarron_share_lead_in_san_antonio", "ord_in_thread": 0, "title": "Michael Allen, Scott McCarron share lead in San Antonio", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SAN ANTONIO — Defending champion Michael Allen shot a 3-under 69 on Saturday for a share of the lead with Scott McCarron in the Champions Tour's San Antonio Championship.\n\"For the first time, instead of trying to defend my championship, I'm trying to just\nwin the golf tournament,\" Allen said. \"Luckily, I've had the chance to defend a few times over the last few years, but trying to defend has never worked out too well for me, so I'm taking a new approach.\"\nMcCarron also had a 69 to reach 6-under 138 on TPC San Antonio's AT&T Canyons Course. The three-time PGA Tour winner is making his seventh start on the tour after turning 50 in July.\n\"This golf course is tough. It's tricky,\" McCarron said. \"You have to hit the fairways. If you don't hit the fairways, it's very difficult.\"\nThe 56-year-old Allen has seven senior victories after failing to win on the PGA Tour.\n\"The course was set up great. It was set up hard,\" Allen said. \"Every pin seemed to be in the back of the green. Breezy, but not too bad today. It was a challenging, but fun day. The greens were extremely fast, extremely tricky.\"\nFred Couples was a stroke back along with Bernhard Langer, Scott Dunlap and first-round leader Wes Short Jr. Couples shot 69, Langer 68, Dunlap 71 and Short 72. Couples won the 2011 event, shooting 62-62-66 for a seven-stroke victory.\n\"I thought today's pins were really, really, hard,\" Couples said. \"It was hard to get the ball close and it was hard to make a putt.\"\nCharles Schwab Cup leader Colin Montgomerie was tied for 11th at 3 under after a 70. He has a 39-point lead over Jeff Maggert with three events left in the season-long competition.\nMaggert withdrew after nine holes because of a lingering left calf injury.\n\"I felt I could play this week but the calf tightened up on me yesterday and with the Toshiba Classic and Charles Schwab Cup Championship coming up, I didn't want to risk it any further this week,\" Maggert said.\nBrandt Jobe was tied for 27th at 1 over in his Champions Tour debut. He shot 72.", "external_links": [], "published": "2015-10-18T03:00:00.000+03:00", "crawled": "2015-10-18T21:09:24.545+03:00", "highlightTitle": ""}