{"organizations": [], "uuid": "ee05e7d16949020e835efaf447169ac2fb749ac2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "mdjonline.com", "main_image": "http://mdjonline.com/images/article.jpg", "site_section": "http://mdjonline.com/rss/rss/Sports?instance=Sports&content_type=article&tags=sports&tag_inclusion=or&offset=0&limit=10&page_name=rss", "section_title": "Sports", "url": "http://mdjonline.com/bookmark/26888087", "country": "US", "title": "Walker looks for third straight win; Whitefield, NCC ready for payback", "performance_score": 0, "site": "mdjonline.com", "participants_count": 1, "title_full": "Walker looks for third straight win; Whitefield, NCC ready for payback", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T08:07:00.000+03:00", "replies_count": 0, "uuid": "ee05e7d16949020e835efaf447169ac2fb749ac2"}, "author": "MDJ staff reports (noreply@mdjonline.com)", "url": "http://mdjonline.com/bookmark/26888087", "ord_in_thread": 0, "title": "Walker looks for third straight win; Whitefield, NCC ready for payback", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Game: Walker (3-2) at Mount Zion-Carroll (4-1), 7:30 p.m. Last year: Mount Zion 34, Walker 7All-time series: Walker leads 7-3Prediction: Walker 28, Mount Zion 21Walker is out to win its third straight game when it visits Mount Zion-Carroll.Having already eclipsed its win total from a season ago and winning two games in a row for the first time since 2013, the Wolverines have another victory on their minds that would give the team their first three-game win streak since the 2012 campaign.Even more importantly, a win would put the Wolverines 1-0 in Region 6A (A) as both teams begin subregion slates tonight.“There are some tough players and some great coaches in this region,” Walker coach Matt Casper said. “But, our focus is on Mount Zion and starting our region schedule 1-0.”Last week, the Wolverines’ defense caused three turnovers against St. Francis, including Avery Eikost’s 25-yard interception for a touchdown and Matt Davis’ takeaway near the end of regulation.“There’s no question (beating St. Francis) was a big win,” Casper said. “The kids worked hard all offseason. Our seniors have added toughness and our young players are competing, too. It’s great to see these guys get rewarded.” The Wolverines are on the road to face an Eagles team that outscored Whitefield Academy and St. Francis by a combined 20 points. Meanwhile, Walker beat the same teams by a combined 10 points.“Mount Zion hammered us at our place from start to finish last year,” Casper said. “I’m hoping to see our guys compete at a higher level. I expect to have our kids better prepared than last year.”Game: Pinecrest Academy (3-1) at Whitefield Academy (1-3), 7:30 p.m.Last year: Pinecrest 28, Whitefield 7Series: Pinecrest leads 1-0Prediction: Pinecrest 31, Whitefield 20Whitefield Academy’s offense has struggled for much of the season. It was held to just 85 yards rushing in its 16-12 loss to Walker two weeks ago, and has averaged only eight points per game in its three losses.The Wolfpack will have to perform better in order to have success in its Region 6A (B) opener at home against Pinecrest Academy.“We’ve basically been working on our ball security and piping down on ball security,” Whitefield coach Quinn Gray said. “We’ve got to be able to stop the run, and we’ve got to bring our A-plus game to be able to win.”Gray said his team is still in search for an identity, but one of Whitefield’s strengths this season has been its offensive and defensive lines, which should help the Wolfpack improve in establishing and stopping the run. Quarterback Carson Brown and tailback Jordan Edge has led the running attack and have combined for 206 yards and three touchdowns.Game: North Cobb Christian (2-2) at Hephzibah (1-3), 7:30 p.m.Last year: Hephzibah 48, North Cobb Christian 10All-time series: Hephzibah leads 1-0Prediction: Hephzibah 35, North Cobb Christian 28North Cobb Christian will be challenged in its matchup at Hephzibah tonight.The game, however, may not be nearly as tough as the emotional strain the Eagles recently went through following the death of English teacher John-Michael Ritchey from a hiking accident nearly two weeks ago.“It was good for them to get back on the field again,” North Cobb Christian coach Scott Ryle said. “Being able to prepare and focus on the game has been helpful to them.”The coaching staff began putting the game plan against Hephzibah over the weekend, but Ryle may not be on the sideline implementing the game plan tonight. Out of town taking care of family matters, Ryle may not return in time for the game. Defensive coordinator Bill Parker would take the reins in Ryle’s place.“I’m confident in our offensive, defensive and special teams coordinators,” Ryle said. “They’ll execute the game plan we talked about and have the kids ready. I’m blessed to have some great coaches and administrators, and the kids have been phenomenal through everything.” Share This Article | similar stories", "external_links": [], "published": "2015-10-02T08:07:00.000+03:00", "crawled": "2015-10-02T07:41:09.130+03:00", "highlightTitle": ""}