{"organizations": [], "uuid": "4e7e4cbb470cece22aad627900b7e4e3baacae68", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.baltimoresun.com", "main_image": "http://www.trbimg.com/img-561efbe0/turbine/bs-va-sp-mount-st-joseph-curley-boys-soccer-1015-20151014", "site_section": "http://feeds.feedburner.com/baltimoresun/sports/highschool/rss2", "section_title": "High School Sports - Baltimore Sun", "url": "http://www.baltimoresun.com/sports/high-school/bs-va-sp-mount-st-joseph-curley-boys-soccer-1015-20151014-story.html", "country": "US", "title": "No. 10 Mount Saint Joseph soccer motivated by injury, beats No. 5 Curley in OT", "performance_score": 0, "site": "baltimoresun.com", "participants_count": 1, "title_full": "No. 10 Mount Saint Joseph soccer motivated by injury, beats No. 5 Curley in OT", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:55:00.000+03:00", "replies_count": 0, "uuid": "4e7e4cbb470cece22aad627900b7e4e3baacae68"}, "author": "Glenn Graham", "url": "http://www.baltimoresun.com/sports/high-school/bs-va-sp-mount-st-joseph-curley-boys-soccer-1015-20151014-story.html", "ord_in_thread": 0, "title": "No. 10 Mount Saint Joseph soccer motivated by injury, beats No. 5 Curley in OT", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "No. 10 Mount Saint Joseph soccer motivated by injury, beats No. 5 Curley in OT Boys soccer Glenn Graham Contact Reporter The Baltimore Sun Jake Mazzei scored the overtime winner to lead No. 10 Mount Saint Joseph soccer past No. 5 Archbishop Curley. \nThe confidence is building and the wins continue for the No. 10 Mount Saint Joseph soccer team, which dug in for overtime against No. 5 Archbishop Curley and came out with a 2-1 home win in a key Maryland Interscholastic Athletic Association A Conference game in Irvington. \nSophomore Jake Mazzei scored the game-winner with under two minutes to play in the first 10-minute overtime period. His finish in front — a well-timed header — seemed like the easy part of the deciding play. Before that, junior midfielder Joe Clark made a strong run with the ball to win the right side and laid it back for Stephen White. After tight marking originally kept him from serving the ball into the middle, his persistence paid off with the cross that found Mazzei for his 10th goal of the season. \nThe Gaels (8-5) win for the sixth time in seven games and improve to 5-4 in the MIAA. Curley (9-8) is now 4-6 in league play. Just before the overtime, Mount Saint Joseph sophomore defender Logan Stevens left the field by ambulance after a collision late in the second half caused shortness of breath. The Gaels played with added motivation in the extra time and it produced another win. \n\"It took a great team effort,\" said Mazzei, who also recorded his fifth assist on Josh DeBoy's first-half goal. \"We really rallied together when Logan got hurt. It brought us together and we saw who we really are as a team. Scoring a game-winning goal and knowing I did it for Logan and knowing the team was over their waiting was the best feeling in the world.\" \nAfter DeBoy scored with 4:22 to play in the first half to give the Gaels momentum and a 1-0 advantage at the break, the Friars responded with a better second half. \nThey evened the score with 23:02 left in regulation when senior forward Tre Pulliam headed home a perfectly placed cross sent in from the left side by sophomore Ben Stitz.", "external_links": [], "published": "2015-10-15T03:55:00.000+03:00", "crawled": "2015-10-15T05:04:09.468+03:00", "highlightTitle": ""}