{"organizations": [], "uuid": "42b3a3c07bb289d0518d8b0872ba2f0e50c4e9fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-56279405/turbine/ct-george-w-bush-kept-us-safe-september-11-20151020", "site_section": "http://www.chicagotribune.com/", "section_title": "Chicago Tribune: Chicago breaking news, sports, business, entertainment, weather and traffic - Chicago Tribune", "url": "http://www.chicagotribune.com/news/opinion/commentary/ct-george-w-bush-kept-us-safe-september-11-20151020-story.html", "country": "US", "title": "Yes, George W. Bush kept us safe - Chicago", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Yes, George W. Bush kept us safe - Chicago Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T05:00:00.000+03:00", "replies_count": 0, "uuid": "42b3a3c07bb289d0518d8b0872ba2f0e50c4e9fe"}, "author": "Marc A. Thiessen", "url": "http://www.chicagotribune.com/news/opinion/commentary/ct-george-w-bush-kept-us-safe-september-11-20151020-story.html", "ord_in_thread": 0, "title": "Yes, George W. Bush kept us safe - Chicago", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Donald Trump says it is ridiculous for Jeb Bush to claim that his brother, President George W. Bush, “kept us safe.” “The World Trade Center came down during his reign,” Trump says. “He was the president at the time, and you know, you could say the buck stops here.”\nBlaming Bush for the Sept. 11, 2001, attacks is an absurd, left-wing talking point. The fact is, when Bush took office on Jan. 20, 2001, planning for 9/11 was well under way. Bush inherited a world where terrorists had been permitted safe haven in terrorist states and were engaged in a virtually unimpeded offensive. Under his predecessor, they had launched a string of attacks against the United States: the first effort to bring down the World Trade Center in 1993; the murder of 19 American airmen at the Khobar Towers in Saudi Arabia three years later; the 1998 bombing of U.S. embassies in Kenya and Tanzania; and the attack on the USS Cole in 2000, which caused the deaths of 17 American sailors.\nIn none of these cases was there a forceful U.S. response. As a result, al-Qaida was convinced that the United States was soft and that if they hit us hard enough, we could be forced to retreat and withdraw as we had in Beirut and Somalia.\nThey miscalculated. Unlike his predecessor, Bush did not respond by firing cruise missiles into empty tents and abandoned obstacle courses. Within weeks, U.S. special operations forces were on the ground in Afghanistan, and in less than a month they had destroyed the Taliban regime and driven al-Qaida from its sanctuary there. After Afghanistan’s liberation, the United States and its coalition partners captured or killed hundreds of al-Qaida leaders, managers and top operational commanders responsible for day-to-day planning of the terror group's activities across the globe, including 9/11 mastermind Khalid Sheikh Mohammed.\nTo uncover and disrupt follow-on attacks, Bush established a program at the National Security Agency to monitor terrorist communications. He built new programs at the Treasury Department to deny extremists state-of-the-art banking and financial tools, thus making it more difficult for them to raise funds, move money, pay operatives, bribe officials and finance new attacks. He established the CIA program to detain and question top terror leaders — an effort that doubled our intelligence on al-Qaida. He created the Department of Homeland Security and a new director of national intelligence and transformed the FBI and the Justice Department to fight terror.\nDonald Trump has no serious chance of winning Jonathan Bernstein It's no surprise that more and more Republicans who initially dismissed Donald Trump are starting to believe he has a good chance of winning after all. National Review had an item Monday on how people like Ed Rollins (Ronald Reagan's 1984 campaign manager) and Steve Schmidt (John McCain's campaign...\nIt's no surprise that more and more Republicans who initially dismissed Donald Trump are starting to believe he has a good chance of winning after all. National Review had an item Monday on how people like Ed Rollins (Ronald Reagan's 1984 campaign manager) and Steve Schmidt (John McCain's campaign...\n(Jonathan Bernstein) Using these new tools and doctrines, the Bush administration disrupted a series of planned al-Qaida attacks on our homeland, including a 2002 plot to fly a plane into the tallest building in Los Angeles, a 2003 plot to crash airplanes into targets on the East Coast and a 2006 plot to blow up multiple passenger jets flying across the Atlantic from Britain to North America. The administration also thwarted a series of planned al-Qaida attacks on U.S. interests and allies abroad, including a plot to blow up the U.S. Consulate in Karachi, Pakistan; a plot to hijack passenger planes and fly them in to Big Ben and the Canary Wharf district in London; and a plot to blow up U.S. Marines at Camp Lemonnier in Djibouti using explosive-laden water tankers — an attack that, if carried out, would have rivaled the 1983 terrorist attack on the U.S. Marine Barracks in Beirut that killed nearly 300 U.S. and French service members.\nAsked whether Bush should even get credit for keeping the country safe after 9/11, Trump says, “I’m not sure that anybody can answer that question. Because you don’t know.”\nJeb Bush's battle with Marco Rubio has a familiar plot Margaret Carlson Let's tear our attention away from Donald Trump, if only for a moment, to check in on a psychodrama unfolding way downfield in the Republican presidential race.\nI'm talking about the sniping campaign motivated by love gone sour between the two candidates from Florida, Sen. Marco Rubio and former...\nLet's tear our attention away from Donald Trump, if only for a moment, to check in on a psychodrama unfolding way downfield in the Republican presidential race.\nI'm talking about the sniping campaign motivated by love gone sour between the two candidates from Florida, Sen. Marco Rubio and former...\n(Margaret Carlson) Yes, we do. What does Trump think — that after 9/11 al-Qaida simply gave up trying to attack the United States? Of course it didn’t. It was stopped.\nBush made a lot of mistakes, especially in his prosecution of the war in Iraq. But this much is indisputable: Thanks to the actions he took, the institutions he built, the doctrines he established, the United States went 2,688 days on his watch without another attack on our soil. That is an achievement few thought possible when the rubble of the World Trade Center was still burning.\nEven more ridiculous is Trump’s claim that, unlike Bush, he would have stopped 9/11 because under his immigration policies “these terrorists wouldn’t have been in the country” and because “a good leader would’ve made sure that (the CIA and FBI) would get along and talk.” Trump seems wholly unaware that several of the 9/11 hijackers were already in the country when Bush took office and that most were here legally on tourist visas. He also seems oblivious to the fact that there was a legal wall between the intelligence and law enforcement communities that prevented them from sharing information — a wall Bush broke down when he signed the Patriot Act.\nAccording to a recent poll, more than 80 percent of Republican voters agree that Bush kept us safe. Blaming Bush for 9/11 and denying him credit for the actions he took to stop al-Qaida from striking us again are things one would expect from the Democratic presidential nominee — not someone vying for the Republican presidential nomination.\nWashington Post\nMark A. Thiessen was a speechwriter for President George W. Bush from 2004 to 2009.\nCopyright © 2015, Chicago Tribune George W. Bush September 11 Attacks Al-Qaeda Donald Trump Jeb Bush U.S. Department of Justice", "external_links": ["http://www.trbimg.com/img-56265b49/turbine/ct-jeb-bush-marco-rubio-feud-20151020", "http://www.trbimg.com/img-56279405/turbine/ct-george-w-bush-kept-us-safe-september-11-20151020", "http://www.trbimg.com/img-56267d5b/turbine/ct-donald-trump-will-not-become-president-20151020"], "published": "2015-10-21T05:00:00.000+03:00", "crawled": "2015-10-21T17:32:07.572+03:00", "highlightTitle": ""}