{"organizations": [], "uuid": "74ec1e7ec749db2108419a54e422c79888bba379", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wbal.com", "main_image": "http://cdn.s3-media.wbal.com/Media/2015/10/05/d53147db-a418-4ebc-b248-754947fbb88d/thumb-400.jpg", "site_section": "http://wbal.com//rss/news?z=6", "section_title": "Sports - Orioles", "url": "http://www.wbal.com/article/124103/6/orioles-finish-season-at-500-sweep-yankees", "country": "US", "title": "Orioles Finish Season At .500; Sweep Yankees", "performance_score": 0, "site": "wbal.com", "participants_count": 1, "title_full": "Orioles Finish Season At .500; Sweep Yankees", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T22:14:00.000+03:00", "replies_count": 0, "uuid": "74ec1e7ec749db2108419a54e422c79888bba379"}, "author": "WBAL NewsRadio 1090 and Associated Press", "url": "http://www.wbal.com/article/124103/6/orioles-finish-season-at-500-sweep-yankees", "ord_in_thread": 0, "title": "Orioles Finish Season At .500; Sweep Yankees", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WBAL NewsRadio 1090 and Associated Press Credit: Associated Press Baltimore Orioles' Chris Davis follows through on a double against the New York Yankees \nThe New York Yankees stumbled into home-field advantage in the AL wild-card game, falling to the Baltimore Orioles 9-4 Sunday after a loss by Houston made the outcome meaningless. \nNew York will enter Tuesday's winner-take-all game against the Astros with little positive momentum after being swept in three games by Baltimore and losing six of their final seven regular-season games. the Yankees fell behind 7-1 in the fifth inning and stranded 11 runners. \nNew York was 4 for 31 with runners in scoring position in closing series, including 1 for 12 Sunday. \nAfter clinching a playoff berth on Thursday, New York needed just one win at Camden Yards to assure itself a game at Yankee Stadium on Tuesday. That victory never came, but that's partly because manager Joe Girardi tried to balance the importance of winning against resting his starters and relievers. \n\"It's tricky,\" Girardi said before the game. \"I need to think about certain people.\" \nFortunately for the Yankees, Arizona's 5-3 victory over Houston ended the Astros' bid to host on Tuesday. Had New York (87-75) and the Astros (86-76) finished tied, Houston would have won the tiebreaker for home field based on head-to-head record. \nYankees starter Michael Pineda (12-10) lasted only 3 2-3 innings, allowing four runs and six hits. The right-hander has yielded a total of 11 runs in his last two outings. \nEight relievers followed, none of whom pitched more than an inning. \nMajor league home run leader Chris Davis connected twice for Baltimore, giving him 47 for the season. He also struck out for the 208th time, fifth-most in one season in big league history. \nPlaying perhaps his final game with the Orioles, Davis hit a two-run shot off Bryan Mitchell in the fifth and a two-run drive against Caleb Cotham in the eighth. The slugger will enter free agency coming off a season in which he drove in 117 runs. \nChris Tillman (11-11) gave up two runs and seven hits over 5 1-3 innings to level his lifetime record against New York at 6-6. \nThe sweep gave Baltimore a 10-9 record against New York this year. After going 13-6 last year, the Orioles have won successive season series against the Yankees for the first time since 1981-82. \nBaltimore finished 81-81 after winning the AL East last year with a 96-66 record. Although they missed the playoffs, the Orioles were in contention for a wild-card berth until the final week and closed with a five-game winning streak to avoid what would have been their first losing season since 2011. \nOrioles third baseman Manny Machado failed to homer in a fifth consecutive game but completed the season as the only player in the majors to participate in all 162 games. \nBaltimore went up 2-0 in the first inning when pending free agent Matt Wieters hit a two-run, two-out single. \nDoubles by Greg Bird and Didi Gregorius got New York a run in the second before the Orioles chased Pineda with a three-run fourth. \nAfter Wieters doubled and scored on a two-out single by J.J. Hardy, Ryan Flaherty greeted Chris Capuano with a line drive that bounced off the mound and went into left field for a double. Two batters later, Gerardo Parra delivered a two-run single.  ", "external_links": [], "published": "2015-10-04T22:14:00.000+03:00", "crawled": "2015-10-05T16:27:02.415+03:00", "highlightTitle": ""}