{"organizations": [], "uuid": "4d4c09b2ad0517d015c02d47292ad73b59235160", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.al.com", "main_image": "http://imgick.al.com/home/bama-media/width620/img/alphotos/photo/2015/10/12/18955675-large.jpg", "site_section": "http://impact.al.com/sports/atom.xml", "section_title": "Sports", "url": "http://www.al.com/alabamafootball/index.ssf/2015/10/kenyan_drake_best_practice_wee.html", "country": "US", "title": "Kenyan Drake: Best practice week of season led to top performance against Arkansas", "performance_score": 0, "site": "al.com", "participants_count": 1, "title_full": "Kenyan Drake: Best practice week of season led to top performance against Arkansas", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T23:44:00.000+03:00", "replies_count": 0, "uuid": "4d4c09b2ad0517d015c02d47292ad73b59235160"}, "author": "Michael Casagrande | mcasagrande@al.com", "url": "http://www.al.com/alabamafootball/index.ssf/2015/10/kenyan_drake_best_practice_wee.html", "ord_in_thread": 0, "title": "Kenyan Drake: Best practice week of season led to top performance against Arkansas", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments \nThe previous few weeks saw considerably less Kenyan Drake involvement in Alabama's offense. Before the Arkansas game, he had a single catch in the three preceding games. \nThe senior running back returned to form with five catches for 37 yards while running seven times for 29 yards. \nBefore the game, coach Nick Saban said Drake needed to focus more on the preparation and not worry as much about hitting the home run on every play. \n\"I always felt that I want to take advantage of any opportunity I get, so I might try to do it too much in the sense of every time I get the ball I want to score a touchdown,\" Drake said Monday. \"Well, anyone would want to, but everyone will have the will to win, but has to have the will to prepare to win. I think I had my best week of practice last week, and I felt I played my best game last week, too.\" \nIt started early the Arkansas game. The second offensive play of Alabama's 27-14 win was a crossing route to Drake who lined up wide to the left. He also got the first carry of the game, a run to the left on the next snap that went for no gain. \nDrake added a few six-yard gains later in the half. His longest play was an 18-yard catch in the third quarter. Kenyan Drake on Texas A&M trip Kenyan Drake on Texas A&M trip \n\"I wanted the game to come to me,\" he said. \"I didn't want to force the game upon myself. That was something I worked on all week, and I felt it worked out in the end.\" \nDrake's season started fast after last year was cut short by a broken leg. He ran for 77 yards on 10 carries in the opener with Wisconsin. Two passes went for an additional 48 yards. He was also the kickoff returner until the Ole Miss game when he fumbled in the first half. \nAfter catching five passes in Week 2 against MTSU, he had just one for two yards at Georgia in the three following weeks. Double figure rushing attempts against Ole Miss and Louisiana Monroe also dipped to six against Georgia. \n\"I'm just willing to help the team any way possible,\" Drake said.", "external_links": [], "published": "2015-10-12T23:44:00.000+03:00", "crawled": "2015-10-13T00:21:51.349+03:00", "highlightTitle": ""}