{"organizations": ["Delaware State", "Hornets David Watford", "LinkedIn Pinterest Pirates", "Hornets Facebook Email Twitter Google", "Pirates", "Hornets Hampton University Athletics", "Facebook Pirates"], "uuid": "2dd46552228595d2c94fdcf491e5ca4f45044f41", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.13newsnow.com", "main_image": "http://www.gannett-cdn.com/-mm-/489efad1142179deef9ce5ef3cf126cd99e1a3f1/r=x633&amp;c=1200x630/http/cdn.tegna-tv.com/-mm-/8d90af622a95f60da6aca49a5842ac8d179715f4/c=4-0-1910-1077/local/-/media/2015/10/10/WVEC/WVEC/635801012205714127-HU-FB.jpg", "site_section": "http://rssfeeds.13newsnow.com/_/20/93174895/wvec/localcollegesports", "section_title": "WVEC - Local College Sports", "url": "http://www.13newsnow.com/story/sports/2015/10/10/pirates-win-over-hornets/73747292/", "country": "US", "title": "Pirates win over Hornets", "performance_score": 0, "site": "13newsnow.com", "participants_count": 0, "title_full": "Pirates win over Hornets", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T02:17:00.000+03:00", "replies_count": 0, "uuid": "2dd46552228595d2c94fdcf491e5ca4f45044f41"}, "author": "", "url": "http://www.13newsnow.com/story/sports/2015/10/10/pirates-win-over-hornets/73747292/", "ord_in_thread": 0, "title": "Pirates win over Hornets", "locations": ["Delaware"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hampton"], "text": "Facebook Email Twitter Google+ LinkedIn Pinterest Pirates win over Hornets David Watford passed for a td and rushed for another as Hampton won over Delaware State at Homecoming. Post to Facebook Pirates win over Hornets David Watford passed for a td and rushed for another as Hampton won over Delaware State at Homecoming.  //on.wvec.com/1RAmZLC   Pirates win over Hornets Hampton University Athletics 7:17 p.m. EDT October 10, 2015 Hampton beat Delaware State 21-7. (Photo: 13News Now) CONNECT TWEET   \nHAMPTON, VA - The Hampton University football team's defense came to the forefront in Saturday's Homecoming game against Delaware State at Armstrong Stadium, as the Pirates came away with a 21-7 win. It was Hampton's fourth Homecoming win in the last five seasons. The Pirates improved to 3-3 overall and 2-2 in MEAC play. \nHampton's defense had another strong game, holding the Hornets to just 256 yards of total offense – 61 of which were on the ground. The Pirates also took advantage of Delaware State's lone turnover of the day, turning it into points. Miles Grooms led the way with eight tackles – 3.5 for loss – and two sacks. He also had a pair of quarterback hurries. Devan Johnson, Tyrone Ward, Joshua Thorne, and Charles Owens each had six tackles. Keith McAfee also had a sack. \nOn the offensive end, David Watford went 19-for-29 through the air – a 65.5 completion percentage – and a touchdown, while also rushing for a touchdown. He ran nine times for 39 yards. Christopher Dukes was Hampton's top rusher, carrying the ball 15 times for 85 yards. Twarn Mixson was Hampton's top receiver on Saturday, catching seven passes for 72 yards. Rayshad Riddick (40 yards), Rashawn Proctor (34 yards), and Leon Shorter (28 yards) each had three catches – with Proctor recording a touchdown catch. The Pirates had 355 yards of total offense. \nHampton struck first with 6:21 left in the first quarter, when Watford found the left edge and scored from 27 yards out. The first score of the game gave Watford his third rushing touchdown of the season and capped a 4-play, 62-yard drive. Three of those four plays were runs. After Delaware State (0-5, 0-2 MEAC) went three-and-out, the Pirates went 82 yards in seven plays, taking a 14-0 lead with 1:47 left in the quarter after Watford hit Proctor from nine yards. It was Proctor's third touchdown reception of the season. That 14-0 score held through the half and the third quarter, partly because of Delaware State's inability to move the ball on offense. \nTwo times, the Hornets had chances inside the redzone, and both times, they came away empty. Wisdom Nzidee missed a 27-yard field goal in the second quarter, before having a 26-yard attempt blocked by Chaka Diarrassouba in the third quarter. Early in the fourth quarter, the Hornets found themselves with another prime scoring opportunity after Logan Westcott intercepted Watford at the Delaware State 20-yard line and returned it 72 yards all the way to the Pirates' 8-yard line. But on the next play, Gil Rivera flung a pitch over Kobie Lain's head. Oral Varcciann scooped up the loose ball and returned it 83 yards for Hampton's third touchdown of the day. That score put Hampton up 21-0 with 10:04 remaining. Delaware State scored on its final possession of the game, when Rivera ran into the endzone from 10 yards out with 2:00 left in the contest. That score prevented the Pirates from shutting out the Hornets for the second straight season.  //on.wvec.com/1RAmZLC TOP VIDEOS", "external_links": [], "published": "2015-10-11T02:17:00.000+03:00", "crawled": "2015-10-11T02:29:25.417+03:00", "highlightTitle": ""}