{"organizations": [], "uuid": "4101ca6d475c1a7ff0e19f6d1547ba866cc824de", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nola.com", "main_image": "http://imgick.nola.com/home/nola-media/width620/img/living_impact/photo/18875792-standard.png", "site_section": "http://www.nola.com/sports/", "section_title": "New Orleans &amp; Louisiana Sports | High School, College &amp; Pro Sports News NOLA.com", "url": "http://www.nola.com/living/index.ssf/2015/10/drew_brees_ellen_degeneres_fri.html", "country": "US", "title": "Drew Brees, Ellen DeGeneres give heartwarming surprise to 2 Saints fans", "performance_score": 0, "site": "nola.com", "participants_count": 1, "title_full": "Drew Brees, Ellen DeGeneres give heartwarming surprise to 2 Saints fans | NOLA.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T17:50:00.000+03:00", "replies_count": 0, "uuid": "4101ca6d475c1a7ff0e19f6d1547ba866cc824de"}, "author": "Chelsea Brasted, NOLA.com | The Times-Picayune", "url": "http://www.nola.com/living/index.ssf/2015/10/drew_brees_ellen_degeneres_fri.html", "ord_in_thread": 0, "title": "Drew Brees, Ellen DeGeneres give heartwarming surprise to 2 Saints fans", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "With a little help from New Orleans Saints quarterback Drew Brees , Ellen DeGeneres gave two friends a heartwarming surprise on her show Wednesday.\nIt all started (as many things do around here) during the Saints' 2009 Super Bowl run. Jackson Smith was serving with the United States Marine Corps in Afghanistan, but that didn't mean his best friend, Brian McKenna, would let him miss out on the wild ride to victory for the Saints.\nMcKenna created a giant cardboard cutout photo of his friend, which McKenna carried throughout the Saints' win and Mardi Gras a few weeks later. The photos landed on Facebook, where Smith was able to see himself \"enjoy\" all the fun in New Orleans, including in one photo where Brees -- as the grand marshal in Bacchus -- embraced the Marine.\nLittle did Smith know that he'd be returning the favor a few years later.\nA mountain biking accident led to McKenna becoming paralyzed, so Smith created a similar cardboard cutout, which he brought to Saints training camp. There, Brees took another photo.\nDeGeneres brought all three men together during a video call, which gave the friends the chance to talk to their favorite Saint.\n\"You did something -- just like what you do every day for the people of New Orleans -- and that's to inspire people, and you inspired me to just show me that somebody out there was thinking about me when they really didn't have to, and I can never thank you enough for that,\" Smith told Brees.\nWatch the full story in the videos below. (For the record, Brees also told DeGeneres, who's a New Orleans native and a fan of the team, that \"there's not anything that's going to keep me off the field\" against the Dallas Cowboys on Sunday).", "external_links": [], "published": "2015-10-01T17:50:00.000+03:00", "crawled": "2015-10-01T19:08:18.262+03:00", "highlightTitle": ""}