{"organizations": [], "uuid": "6cf23c32c5d3b07ad58ad49803fe505fad7e5c31", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ksl.com", "main_image": "http://img.ksl.com/slc/2573/257343/25734342.jpg", "site_section": "http://ksl.com//xml/294.rss", "section_title": "KSL / Sports Home / Local", "url": "http://www.ksl.com/?sid=36983922&nid=858&s_cid=rss-extlink", "country": "US", "title": "Aggie defense feasts on sloppy Bronco offense in rout", "performance_score": 0, "site": "ksl.com", "participants_count": 1, "title_full": "Aggie defense feasts on sloppy Bronco offense in rout", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T09:33:00.000+03:00", "replies_count": 0, "uuid": "6cf23c32c5d3b07ad58ad49803fe505fad7e5c31"}, "author": "Parker Robertson, KSL.com Contributor", "url": "http://www.ksl.com/?sid=36983922&nid=858&s_cid=rss-extlink", "ord_in_thread": 0, "title": "Aggie defense feasts on sloppy Bronco offense in rout", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Aggie defense feasts on sloppy Bronco offense in rout By Parker Robertson, KSL.com Contributor | Posted Oct 17th, 2015 @ 12:33am 0  \nLOGAN — It might go down as the biggest victory in Utah State football history. The Aggies came ready to play Friday night as they rode eight turnovers to a 52-26 rout of the 20th-ranked Boise State Broncos. \nUtah State linebacker Kyler Fackrell was one of many defensive players to come up huge. He finished the night with 11 tackles, two and a half tackles for loss, two quarterback hurries, one forced fumble and multiple fumble recoveries. \nMarwin Evans came up huge for the Aggie secondary as he had both a forced fumble and an interception. Both of those came late in the first half, helping the Aggies to pull away. Nick Vigil led the team in tackles with 14, including two sacks and two and a half tackles for loss. \nThe Aggies opened their scoring with a nine-play 71-yard drive capped by a 2-yard touchdown pass to Wyatt Houston on fourth down to set the tone for the game. Jake Thompson added a 51-yard field goal after a Bronco three and out made it 10-3 with three minutes left in the first quarter. \nThe Aggies took advantage of Bronco turnovers to stretch the lead to 24-10 with just over three minutes left in the half. With 2:20 left in the first half, Boise State was only down 14 with the ball before disaster struck. After Evans forced a fumble, it took just a play before Kent Myers scampered for a 39-yard touchdown. \nThe Broncos had the ball for not even a full play when Chaz Anderson fumbled while fighting for extra yards. The play after the turnover, Myers hit Hunter Sharp on a pass to the back corner of the end zone for a 21-yard touchdown. \nJust as things didn't look like they could get worse for the Broncos, Evans took an interception back 90 yards for a touchdown as time expired in the half. It capped off a 21-point run by Utah State in the last 86 seconds of the half. \nThe second half opened similar to the first half with a Bronco turnover as Thomas Sperbeck fumbled a log catch and run. Both teams stagnated for much of the third quarter before Boise State had a 10-play 82-yard drive finished by a 3-yard run by Devan Demas to make it 45-17. \nThe Utah State offense answered with a five-play, 75-yard drive, highlighted by a 48-yard run by Devante Mays, which finished the Broncos for good. \nOffensively the Aggies did what they needed to pull away from the Broncos early. They scored 35 points off turnovers and were perfect in red zone opportunities, if you don't count the turnover on downs at the very end of the game. Myers tied his career high in passing touchdowns with three with 157 yards through the air. He added another 63 yards and a touchdown running. \nReceiver Hunter Sharp came up with some huge touchdown catches for Utah State as he finished the night with seven catches for 42 yards and two touchdowns. \nThe Aggies are now in the driver's seat for their division in the Mountain West. The Aggies have an extra day now as they prepare to face a very good San Diego State squad. For now, the Aggies will enjoy their first win over the Broncos since 1997. Parker Robertson is a graduate of Utah State University, a freelance contributor and an avid fan of sports. Follow him on Twitter @ParkerRob78 Email: ParkerRobertson18@gmail.com 0 Pending", "external_links": [], "published": "2015-10-17T09:33:00.000+03:00", "crawled": "2015-10-18T15:23:17.766+03:00", "highlightTitle": ""}