{"organizations": [], "uuid": "831e1bc49ad1e1a883cc8e13694484d283cddeb5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.azcentral.com", "main_image": "http://www.gannett-cdn.com/-mm-/5cf2ccc795259a10230c32e1db2f0e01c572bb2a/c=0-127-2365-1463&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/22/USATODAY/USATODAY/635811101506487097-B02-PUPPIES-A-14-61936788.JPG", "site_section": "http://www.azcentral.com/sports/", "section_title": "azcentral sports - Phoenix Arizona Sports news, scores, schedules, photos, videos", "url": "http://www.azcentral.com/story/sports/olympics/2015/10/22/olympic-silver-medalist-comes-out/74387824/", "country": "US", "title": "Olympic silver medalist Gus Kenworthy comes out", "performance_score": 0, "site": "azcentral.com", "participants_count": 22, "title_full": "Olympic silver medalist Gus Kenworthy comes out", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T18:19:00.000+03:00", "replies_count": 25, "uuid": "831e1bc49ad1e1a883cc8e13694484d283cddeb5"}, "author": "azcentral.com", "url": "http://www.azcentral.com/story/sports/olympics/2015/10/22/olympic-silver-medalist-comes-out/74387824/", "ord_in_thread": 0, "title": "Olympic silver medalist Gus Kenworthy comes out", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Talk to a freeskier, and within five minutes he’ll mention progress. It’s the lifeblood of the sport, moving it forward and pushing new boundaries.\nGus Kenworthy has certainly done that on the slopes.\nOn Thursday, he did it again — and in a more meaningful way than adding another spin or rotation. Kenworthy became the first action sports athlete to openly come out as gay, first telling his story to ESPN The Magazine .\n\"I never got to be proud of what I did in Sochi, because I felt so horrible about what I didn't do,\" Kenworthy told ESPN. \"I didn't want to come out as the silver medalist from Sochi. I wanted to come out as the best freeskier in the world.\"\nAfter Kenworthy revealed the news, he was met with support.\nSnowboarder Sage Kotsenburg, the snowboarding slopestyle Olympic champion in Sochi, tweeted, “Gus you are the man! So proud of you for this I know it couldn't have been easy but we're all supporting you #GoGus”\nOther freeskiers applauded Kenworthy.\n“This is huge and I’m so happy for Gus,” said Joss Christensen, the Olympic gold medalist who along with Kenworthy and Nick Goepper led the USA to a sweep in the event’s debut.\n“It’s almost kind of putting it in everybody else’s face and saying, ‘Hey, I don’t care what you think. This is me, and I love who I am.’”\nAction sports athletes are part of a culture that frequently uses gay and other derogatory terms as a synonym for stupid or uncool. Michael Spencer, Kenworthy’s agent, doesn’t believe that’s out of maliciousness but acknowledges that hearing that has had an impact on Kenworthy.\nSaid freeskier Tom Wallisch, “I’m really happy mainly just for him but also the sport and our culture. It’s really hard in action sports. Your image is so linked to being crazy and cool and traveling the world hooking up with girls.\nUSA TODAY\nSochi pups are doing great as skier's season kicks off\n“It’s really awesome to see him coming out like that and setting a good example. It’s really admirable.”\nBefore he won Olympic silver in slopestyle freeskiing’s debut at the Games in Sochi, he had been the first to land a triple cork in a slopestyle run. Last season, Kenworthy put down a Grand Prix halfpipe run in Park City that was the first to include four double corks.\nAlthough he has not won an X Games medal, Kenworthy, 24, was the Association of Freeskiing Professionals’ top athlete for a fifth consecutive year. He is the only athlete who is consistently a threat in the sport’s three disciplines — halfpipe, slopestyle and big air.\nSpencer said he’ll look forward to see how the action sports community responds, especially with Kenworthy as a threat in each of the X Games’ Freeskiing events. But he also expects to see a lighter Kenworthy, unburdened with the stress of feeling like he had to keep who he is a secret.\nGus you are the man! So proud of you for this I know it couldn't have been easy but we're all supporting you #GoGus https://t.co/jclEbTrhzX\n— sage kotsenburg (@sagekotsenburg) October 22, 2015 “I don’t want to say come out of his shell because he’s never been shy,” said Spencer. “He’s going to become even that much more engaging and charismatic because now he doesn’t have to worry about if he messes up and says something about a boyfriend.\n“Now I think you’re just gonna get the last 10 percent that everyone’s been missing knowing who the real Gus is.”\nAs they heard the news Thursday, Kenworthy’s peers thought he might have helped prompt a progress far more elusive than can be found on a slope.\n“I think this will just help bring our whole community to terms with how the whole world is changing and how America is changing and how we should see these words,” said Christensen. “I think it’s going to help us all become better people.”\nI am gay. pic.twitter.com/086ayvChq2\n— Gus Kenworthy (@guskenworthy) October 22, 2015", "external_links": ["https://twitter.com/guskenworthy/status/657213362137272320", "https://t.co/086ayvChq2", "https://twitter.com/sagekotsenburg/status/657225213193555968", "http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/2d3f851771f01174caad4c98290ac00328eb4fe3/c=1182-0-5022-3840/local/-/media/USATODAY/USATODAY/2014/11/24/635524410043327328-Gus-Mishka-Jake3-RobinDMacdonald.jpg", "https://twitter.com/hashtag/GoGus?src=hash", "https://t.co/jclEbTrhzX", "http://www.usatoday.com/story/sports/olympics/2014/11/24/sochi-pups-gus-kenworthy-humane-society/19481805/"], "published": "2015-10-22T18:19:00.000+03:00", "crawled": "2015-10-22T20:55:04.756+03:00", "highlightTitle": ""}