{"organizations": ["Louisville Sitting", "NC State"], "uuid": "eb491df7a091978814dfa7e1eecb2fdc37f0f7f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribtown.com", "main_image": "http://cdn1.tribtown.com/st_assets/images/the_tribune_sq.jpg", "site_section": "http://tribtown.com//feed/sec/6000", "section_title": "TribTown.com - Sports News", "url": "http://www.tribtown.com/view/story/e52a4b6afcfc4e6c836149f72add2bb5/FBC--Louisville-NC-State", "country": "US", "title": "Sitting at 4-0 again, NC State aims to keep momentum in rainy ACC opener against Louisville", "performance_score": 0, "site": "tribtown.com", "participants_count": 0, "title_full": "Sitting at 4-0 again, NC State aims to keep momentum in rainy ACC opener against Louisville", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T20:11:00.000+03:00", "replies_count": 0, "uuid": "eb491df7a091978814dfa7e1eecb2fdc37f0f7f0"}, "author": "", "url": "http://www.tribtown.com/view/story/e52a4b6afcfc4e6c836149f72add2bb5/FBC--Louisville-NC-State", "ord_in_thread": 0, "title": "Sitting at 4-0 again, NC State aims to keep momentum in rainy ACC opener against Louisville", "locations": ["Louisville"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["AARON"], "text": "Sitting at 4-0 again, NC State aims to keep momentum in rainy ACC opener against Louisville By AARON BEARD AP Sports Writer   1:10   1:11   \nPeople: \nNorth Carolina (541) \nRALEIGH, North Carolina — North Carolina State is getting another shot at building on a 4-0 start. \nA year ago, the Wolfpack won the first four games entering Atlantic Coast Conference play only to hit a four-game skid that nearly derailed the season. Now North Carolina State is back in the same position, hosting Louisville in Saturday's ACC opener and aiming to keep building momentum. \nNorth Carolina State hasn't won a league opener since 2010, with the last two losses — to Atlantic Division heavyweights Clemson and Florida State — both coming in tight contests. \n\"Last year's team learned how to finish as the season went on,\" Wolfpack coach Dave Doeren said. \"I think our team understands that and that's why it's so nice to have experience back from those seasons. We played freshmen in both of those years who are now third- and second-year players that can be leaders for our team facing these guys.\" \nThe Wolfpack dominated an easy opening stretch of games, beating Troy, Eastern Kentucky, Old Dominion and South Alabama by a combined score of 185-48. Doeren has dismissed criticism of the schedule by saying he wouldn't apologize for winning games and that it allowed the team to give reps to young players, while quarterback Jacoby Brissett noted that his team \"had passed every test so far.\" \nNorth Carolina State will host a Cardinals (1-3, 0-1) team that handed the Wolfpack one of those losses during last year's four-game skid. \nLouisville started 0-3, but regrouped with a 45-3 win against Samford last week behind quarterback Lamar Jackson and his school freshman record of 396 yards of offense. Still, with one of the early losses coming to division opponent Clemson, the Cardinals arrive here trying to avoid an 0-2 ACC start. \n\"We must win this game if we want to keep our hopes alive in the ACC,\" Cardinals linebacker James Burgess said. \nHere are some things to watch in Saturday's Louisville-N.C. State game: \nRAINY CONDITIONS: The region is expected to get steady rain for several days, so conditions will likely be soggy and sloppy. And that could force adjustments to play-calling or make it tougher to avoid turnovers. North Carolina State tried to work outside instead of going indoors during damp conditions this week to prepare, while Louisville has been watching weather reports, too. \"We're going to prepare the same way,\" Louisville coach Bobby Petrino said, \"but you do have to understand what the elements are going to be.\" \nGROUND GAME: North Carolina State's Matt Dayes has run for 100 yards in all four games and is tied for the national lead with nine rushing touchdowns. But last year's leading rusher, Shadrach Thornton, was dismissed from the team Wednesday following an arrest that came on the heels of his return from a two-game suspension. \"We're going to do everything we can to help him continue toward his degree and support him,\" Doeren said, \"but it's time to move on.\" \nCARDINALS' PROTECTION: The Samford game allowed Petrino to start three new offensive linemen in an effort to improve blocking and boost depth for a unit that has struggled running the ball and allowed 13 sacks so far. Louisville responded by allowing just two sacks and opening holes for Jackson to run for 184 of the Cardinals' season-high 288 yards rushing. \nWOLFPACK'S LINE CONCERNS: The Wolfpack will again be thin at left guard due to injuries. Doeren said graduate Alex Barr will miss his third straight game since suffering a leg injury in Week 2, while redshirt junior Bryce Kennedy will miss a second straight game with an unspecified injury. Redshirt freshman Tyler Jones is expected to start. \nPICKOFF MASTERS: Louisville has the nation's longest active streak of 17 games with at least one pick. The Cardinals will line up against a quarterback in Brissett who has thrown 189 straight passes without an interception. \nAP Sports Writer Gary B. Graves in Louisville, Kentucky contributed to this report. \nFollow Aaron Beard on Twitter at http://www.twitter.com/aaronbeardap and the AP's college football site at http://collegefootball.ap.org . \n ", "external_links": [], "published": "2015-10-02T20:11:00.000+03:00", "crawled": "2015-10-02T21:44:52.050+03:00", "highlightTitle": ""}