{"organizations": [], "uuid": "170b1538a4a56d0b79b7f3bc7b03760e8cc6b675", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sun-sentinel.com", "main_image": "http://www.trbimg.com/img-55f309a9/turbine/fl-cnsp-centerbr-0830-20150911", "site_section": "http://www.sun-sentinel.com/sports/youth-sports", "section_title": "South Florida Youth Sports News - Sun Sentinel", "url": "http://www.sun-sentinel.com/sports/youth-sports/more-youth-sports/fl-cnsp-centerbr-0830-20150911-story.html", "country": "US", "title": "Special times for underprivilaged youths at summer camp", "performance_score": 0, "site": "sun-sentinel.com", "participants_count": 1, "title_full": "Special times for underprivilaged youths at summer camp - Sun Sentinel", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T18:02:00.000+03:00", "replies_count": 0, "uuid": "170b1538a4a56d0b79b7f3bc7b03760e8cc6b675"}, "author": "Gary Curreri", "url": "http://www.sun-sentinel.com/sports/youth-sports/more-youth-sports/fl-cnsp-centerbr-0830-20150911-story.html", "ord_in_thread": 0, "title": "Special times for underprivilaged youths at summer camp", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "It was easy to notice the smiles of a special group of campers on the rubberized gym floor at the West Broward Gymnastics Academy in Davie.\nFor the past nine summers, Camp Katina has provided fun times for underprivileged girls who normally wouldn't be able to afford gymnastics or cheerleading classes. The free two-day event was for ages 6-14.\nKatina Taylor, the wife of former Miami Dolphins defensive end Jason Taylor and sister of former Dolphins linebacker Zach Thomas, taught them different gymnastics skills and created a cheer routine for them to perform.\n\"I am trying to plant a seed to help them grow as a person, to help them grow from a beautiful young lady to a beautiful woman,\" said Taylor, 39, of Weston. \"I hope to inspire and motivate them to be great people and great citizens.\"\nTaylor said there is more to the camp than learning to jump and flip.\n\"It all starts with loving ourselves and finding our inner beauty,\" she said. \"… This [gymnastics camp] is all a blast, but [it's all about] slowly planting the little seeds in these kids and trying to give them good role models to look up to.\"\nCamp Katina started nine years ago when Taylor's three children were enrolled in classes at the West Broward academy and gym owner Silvana Hude wanted to help with her foundation work.\n\"It is pure joy for these girls,\" Taylor said.\nAcademy staff and member gymnasts volunteer their time and facility to provide a memorable experience for between 55 and 60 youths each year.\nJon-Erik Perez, assistant head coach, said campers rotate between basic gymnastics skill sets and then learn a cheer routine that they perform in front of family and friends.\n\"Sometimes we deal with kids who come from very tough households,\" Perez said. \"We have kids who will tell us stories and things that you watch on TV or see in a movie that we've never had to deal with. Some of these kids … get their first kind words said to them here. … This is awesome.\"\nAt the end of the two-day session, a camper is awarded a one-year gymnastics scholarship, and this year's recipient was 6-year-old Alexys Collenberger.\nThere also were guest speakers who talked to the girls about health, hygiene and self-esteem.\n\"It is very unique,\" Perez said. \"We try and impart a little bit of life skills in addition to gymnastics. It is like a fun escape.\"\nPembroke Pines' Sierra Alexander, 17 and a Level 10 gymnast, was one of the volunteer coaches. The West Broward High School senior and academy member hopes to continue her gymnastics career at Yale University next year.\n\"This is a lot of fun because you get to see girls who usually don't get to do this. They have a lot of fun doing gymnastics and expressing themselves [that way],\" Alexander said. \"Any time I see someone trying to do something, I always want to help out. I always want to see them try something out and then get it. It is fun to watch.\"\nHude opened the academy in 2005.\n\"Camp Katina is a way for us to give back to the community,\" Hude said. \"Many children do not have the opportunity to be involved in gymnastics. We hope that the girls who participate leave our facility feeling inspired, confident and motivated.\"\nTaylor said she gets as much out of the two-day event as the gymnasts.\n\"It is super cool,\" she said. \"The smiles and the hugs are unbelievable. It brings so much joy to me.\"\nGary Curreri can be reached at SportsCom5@aol.com .\n Gymnastics Zach Thomas Yale University West Broward High School Jason Taylor", "external_links": ["http://www.trbimg.com/img-55f309a9/turbine/fl-cnsp-centerbr-0830-20150911"], "published": "2015-09-11T18:02:00.000+03:00", "crawled": "2015-10-08T17:54:52.445+03:00", "highlightTitle": ""}