{"organizations": ["Hoosiers"], "uuid": "1f38308cfcfd5e06e63486f4e921fee45d0fce9a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.local12.com", "main_image": "http://www.local12.com//template/ugc/wkrc/1601/JoL2ZJLp.jpg", "site_section": "http://www.local12.com/sports/features/local-sports/rss.xml", "section_title": "wkrc LOCAL Sports", "url": "http://www.local12.com/sports/features/local-sports/stories/New-improved-Blackmon-could-hold-key-to-Hoosiers-season--223335.shtml", "country": "US", "title": "New, improved Blackmon could hold key to Hoosiers season", "performance_score": 0, "site": "local12.com", "participants_count": 0, "title_full": "New, improved Blackmon could hold key to Hoosiers season", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T11:06:00.000+03:00", "replies_count": 0, "uuid": "1f38308cfcfd5e06e63486f4e921fee45d0fce9a"}, "author": "", "url": "http://www.local12.com/sports/features/local-sports/stories/New-improved-Blackmon-could-hold-key-to-Hoosiers-season--223335.shtml", "ord_in_thread": 0, "title": "New, improved Blackmon could hold key to Hoosiers season", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Blackmon"], "text": "New, improved Blackmon could hold key to Hoosiers season \nUpdated: Sat, Oct 24 2015, 08:11 AM \nBLOOMINGTON, Ind. (AP) -- James Blackmon Jr. already looks like a different player.The Indiana guard has added a few pounds, gotten noticeably stronger and been working on his handling.After contemplating leaving early for the NBA last spring, the sophomore is ready to prove that he and the Hoosiers aren't just new and improved. They're better.\"I feel like we can be great,\" Blackmon said when asked about Indiana's backcourt. \"You know last year, we were as well, so just picking up on some of the things we lacked on last year, I feel like we can be one of the best (in the nation).\"Indiana is every bit as talented as it was a year ago and this season will benefit from a more experienced supporting cast.Point guard Kevin \"Yogi\" Ferrell returns for his final season and is on pace to break the school record for assists. Sophomore guard Robert Johnson averaged 8.9 points and finished second to Ferrell in assists in 2014-15. Fifth-year senior Nick Zeisloft, a 3-point shooting specialist, provides leadership and scoring punch off the bench.But it's the development of Blackmon that could be the key to the Hoosiers' success.As a freshman, the 6-foot-4 guard was Indiana's second-leading scorer (15.7 points), shot 42 percent from the field and 38.7 percent on 3s. He also endured a midseason shooting slump, missed one game because of an ankle injury and had this summer progression's stalled after having July surgery to repair a torn meniscus in his left knee.Three months later, Blackmon insists there are no lingering effects from the injury and that he's back to full strength.\"I'm feeling great,\" he said. \"You know the injury was more of a frustration thing, I don't think that it hurt my game in any way. It was just more of a mindset thing.\"He and the rest of the Hoosiers were looking forward to Saturday night's annual Hoosier Hysteria, the renamed version of Midnight Madness, at the new-look Assembly Hall. Renovations on the Hoosiers home court began after the end of last season and won't be finished until next fall.Inside the program, there have been notable changes, too.Coach Tom Crean has kicked three players off the team since May after they got into trouble off the court. Three other players transferred.The replacements include Michigan's top bench player, 6-8 forward Max Bielfeldt, and two prized recruits — 6-10 center Thomas Bryant and 6-7 forward Juwan Morgan. Bielfeldt, a grad student, is eligible to play immediately.Putting those three around Troy Williams, a returning starter, gives Indiana the biggest and deepest front line since Cody Zeller left for the NBA in 2013.\"They've added a lot of length, rebounding, a lot of speed,\" Johnson said when asked about the freshmen. \"They've done a good job adjusting and rolling with all the punches and just getting acclimated to all the things we do.\"Williams also said the Hoosiers have shed defined positions and are instead learning how to run the offense from different spots on the floor.Crean is hoping that's enough to reinvigorate Indiana's signature program, which has won just four NCAA tournament games since 2008.\"We don't really worry about that (the expectations) we know what we've got to do,\" Blackmon said. \"Coach Crean tells us every day tell us what we've got to do.\"And in Blackmon's case, that means becoming a stronger, more versatile player.\"When I was out, I watched a lot of film, worked on my shot, worked on my ball-handling. I did a lot of stuff,\" Blackmon said. \"We've just got to go out there and do our thing.\" Related Stories", "external_links": [], "published": "2015-10-24T11:06:00.000+03:00", "crawled": "2015-10-24T16:23:58.252+03:00", "highlightTitle": ""}