{"organizations": [], "uuid": "6d16408f6467b6ae22e1b7c840f85b42c0e55a7d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.si.com", "main_image": "http://cdn-jpg.si.com/sites/default/files/styles/si_gallery_slide/public/2015/10/15/lamar-odom-gifts.jpg?itok=0v731Ms9", "site_section": "http://www.si.com/htmlsitemap/2014/07/page-1", "section_title": "The Sports Illustrated HTML Sitemap Index for July, 2014 - SI.com", "url": "http://www.si.com/nba/2015/10/15/lamar-odom-lakers-clippers-rhode-island-new-york", "country": "US", "title": "Lamar Odom: The gifts and ghosts of the ex-Lakers star - NBA -", "performance_score": 0, "site": "si.com", "participants_count": 8, "title_full": "Lamar Odom: The gifts and ghosts of the ex-Lakers star - NBA - SI.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 8, "uuid": "6d16408f6467b6ae22e1b7c840f85b42c0e55a7d"}, "author": "Lee Jenkins", "url": "http://www.si.com/nba/2015/10/15/lamar-odom-lakers-clippers-rhode-island-new-york", "ord_in_thread": 0, "title": "Lamar Odom: The gifts and ghosts of the ex-Lakers star - NBA -", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "by Lee Jenkins Twitter Email Posted: Thu Oct. 15, 2015 They called him The Package, because he contained so many gifts, and because people always seemed to be waiting for him. Lamar Odom would bolt unannounced from the University of Rhode Island's campus, turn off his cell phone, and check into a hotel so he could be alone. Three days later, he’d call head coach Jim Harrick . “This is The Package,” he’d say. “The Package has arrived.” One of those many gifts is his charm. Everybody laughed, as if the disappearances were a quirk, and not a signal.\nLast Saturday, Odom vanished again, to a brothel 70 miles northwest of Las Vegas called the Love Ranch. But in truth he’d been gone much longer. For more than a year, NBA sources who were once close to Odom shared concerns about him. Among the laments: “Nobody knows where he is…He won’t return anybody’s calls...He keeps changing his number…He says we’ll get together and he doesn’t follow through…I’m worried.” Sightings on TMZ, and at 24 Hour Fitness in L.A.’s San Fernando Valley, did little to quell the anxiety.\nThe world waits again for The Package, feverishly refreshing gossip websites as he lays in a coma at Sunrise Hospital in Las Vegas, tubes in his nose and cocaine reportedly in his system. Trauma has followed Odom since he was 12 and his mother died of colon cancer, sending him sprinting into the streets of Queens, until he reached Lincoln Park and shot jumpers all night. His father was a heroin addict, so he was raised by his Grandma Mildred, who died in 2003. Three years later, to the day, his 6-month-old son died of SIDS. Some athletes are able to push past their personal catastrophes. Odom clung to his ghosts, staring at photographs of dead relatives every morning, then scrawling their names on his sneakers in the locker room before games.\nPhoto: Nathaniel S. Butler/NBAE via Getty Images ​\nBeyond his 6’10” frame, his sublime handle and his joyful countenance, his misfortune became his identity. He fashioned himself a tragic figure, buying a white Mercedes because that was the car Lloyd Daniels drove the day they met. Daniels, one of the most celebrated players ever to come out of New York, went to rehab three times, was arrested in a drug deal, and survived a shooting in another. “People used to call me Little Lloyd,” Odom once said, from behind the wheel of his own pearly Benz.\nNBA SI Vault: The odyssey of Lamar Odom by Lee Jenkins", "external_links": ["http://twitter.com/SI_LeeJenkins"], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-16T13:31:42.079+03:00", "highlightTitle": ""}