{"organizations": [], "uuid": "782fa5e61f24b14ddd78044ca4c97c4c7b866804", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "http://www.bostonherald.com/sites/default/files/media/2015/10/04/100515soxnotes1.jpg", "site_section": "http://bostonherald.com/sports/red_sox_mlb", "section_title": "Sports: Red Sox &amp; MLB | Boston Herald", "url": "http://bostonherald.com/sports/red_sox_mlb/boston_red_sox/2015/10/red_sox_notebook_favorable_reactions_to_farrell_lovullo", "country": "US", "title": "Red Sox Notebook: Favorable reactions to Farrell, Lovullo returns", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "Red Sox Notebook: Favorable reactions to Farrell, Lovullo returns | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "782fa5e61f24b14ddd78044ca4c97c4c7b866804"}, "author": "Jason Mastrodonato", "url": "http://bostonherald.com/sports/red_sox_mlb/boston_red_sox/2015/10/red_sox_notebook_favorable_reactions_to_farrell_lovullo", "ord_in_thread": 0, "title": "Red Sox Notebook: Favorable reactions to Farrell, Lovullo returns", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CLEVELAND — If the Red Sox’ energy and talent over the final seven weeks of the season has been visible through the television screen, imagine how it’s felt at field level.\nThe players know they’ve performed better since interim manager Torey Lovullo took over for their ailing manager John Farrell , who recently completed chemotherapy to treat Stage 1 lymphoma. They enjoy playing for Lovullo, who talks to every player on a daily basis, gives young players freedom and has given roles to relief pitchers. And they didn’t want to see Lovullo go.\nYesterday it became official: Lovullo isn’t going anywhere. Extended to a two-year contract that doesn’t permit him to interview for managerial openings with other clubs, he’ll return next year, as bench coach.\nFarrell will be back as well, to manage the team, president of baseball operations Dave Dombrowski announced.\nAnd while it might seem counterintuitive on paper to bring back the manager who led the Sox to a losing record in back-to-back seasons, the players felt otherwise.\n“I think first we’re worried about his health,” said second baseman Dustin Pedroia . “We’ll worry about that stuff when next year comes. He has to take care of himself and get him healthy. We can’t wait to have him back.”\nFarrell has been seen in his office at most home games this year, even while he was going through chemo. Lovullo said Farrell had been kept in the loop about many important team decisions.\n“When we see him we just all let him know we care about him and want him to get back healthy,” Pedroia said. “That’s all you can do. What he’s going through, you don’t worry about the other stuff. Health is the most important thing. That’s all I’ve been asking, that’s all anyone else has been asking.”\nDespite the team’s success under Lovullo, most players assumed Farrell would be back.\n“I think everyone in here expected this to go the way it did,” said starting pitcher Clay Buchholz . “Knowing the battle John had to go through to sort’ve nip what he had in the (bud), it was my expectation, knowing if he was healthy this is his club. I feel like everybody in this place felt the same way about it.\n“Torey has done an awesome job. I’ve told him that multiple times now. The way he’s handled one of his good friends going through what he’s going through. Torey respects everybody and that’s the thing I’ve noticed. He didn’t change from going from bench coach to taking over as manager. He has an easy personality to get along with. He talks to the guys and he’s always been a loose person. So the way he did what he did was, I think everybody in here respects him a lot more than they did when he was made bench coach.”\nBowing out with a loss\nRick Porcello gave the Red Sox seven solid innings, allowing three runs (two earned) while striking out seven in a 3-1 season-ending loss to the Cleveland Indians.\nPorcello ended his first season with the Sox with a 4.92 ERA. He had a 3.14 ERA with 57 strikeouts in 571⁄3 innings over his final eight starts since returning from the 15-day disabled list.\n“That’s me,” Porcello said. “I’m not going to go out there and strike out 17 and throw no-hitters, but I’ll give us a chance to win. I’m just looking to learn from some of the things that went on this year that I struggled with and some of the things I did well and take those and leave no stone unturned in the offseason and come back into spring training ready to go.”\nThe Red Sox’ lone run came on a David Ortiz first-inning double. Xander Bogaerts scored on Ortiz’ 108th RBI.\nBeyeler on the outs\nWhile the Sox retained most of their coaching staff for 2016, including hitting coach Chili Davis , pitching coach Carl Willis , third base coach/infield instructor Brian Butterfield and bullpen coach Dana LeVangie .\nFirst base coach/outfielder instructor Arnie Beyeler was fired. The firing came as a surprise considering how well the outfielders have been playing over the last six weeks. In his three years on the staff, Beyeler helped Betts and Brock Holt convert from infielders to above-average outfielders, helped Shane Victorino win a Gold Glove in right field and Rusney Castillo learn all three outfield positions.\nDombrowski said the Sox simply wanted to make a change on the staff and Beyeler was the one to go.\n“They were going to make a change, is I guess what (Dombrowski) said,” Beyeler said. “And my spot was the one that they decided to change. What am I going to say? That was it.”\nBeyeler spent 12 seasons in the Red Sox’ organization, with nine years in the minors.\nUnder Beyeler’s tutelage, Castillo, Betts and Jackie Bradley Jr. have been making the hard plays look routine ever since Hanley Ramirez played his last game in left field on Aug. 25. The only blemish on Beyeler’s record this year was the poor transition of Ramirez to left field, where he looked out of place from the very beginning. But the organization insists the firing of Beyler had nothing to do with Ramirez.\n“I think, I would hope I would have been told that if that was the case,” Beyeler said. “I don’t think so. I just kind of got the sense that they want a change.”", "external_links": [], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-05T11:30:07.944+03:00", "highlightTitle": ""}