{"organizations": ["Penn State"], "uuid": "28b240659aed2b28f69734db95d72369256a417e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.philly.com", "main_image": "http://media.philly.com/images/101415_psu-defense_1200.jpg", "site_section": "http://www.philly.com/philly_sports.rss", "section_title": "Philly.com Sports", "url": "http://www.philly.com/philly/sports/colleges/penn_state/20151015_Penn_State_s_fearsome_defensive_line_readies_for_Buckeyes.html", "country": "US", "title": "Penn State's fearsome defensive line readies for Buckeyes", "performance_score": 0, "site": "philly.com", "participants_count": 0, "title_full": "Penn State's fearsome defensive line readies for Buckeyes", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T07:30:00.000+03:00", "replies_count": 0, "uuid": "28b240659aed2b28f69734db95d72369256a417e"}, "author": "", "url": "http://www.philly.com/philly/sports/colleges/penn_state/20151015_Penn_State_s_fearsome_defensive_line_readies_for_Buckeyes.html", "ord_in_thread": 0, "title": "Penn State's fearsome defensive line readies for Buckeyes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Joe Juliano"], "text": "Joe Juliano, Inquirer Staff Writer Posted: Thursday, October 15, 2015, 3:01 AM \nThe question faces every Penn State opponent sooner or later. \nOf the four men who guard the trenches for the Nittany Lions on the defensive side of the ball every Saturday, whom do you double-team? \nIt's got to be a puzzle. The Lions possess probably the best pair of defensive tackles in the Big Ten in Anthony Zettel and Austin Johnson. Their best pass rusher, sack-happy fifth-year senior Carl Nassib, who walked on as a freshman out of Malvern Prep, merits a lot of attention. \n\"It's kind of balanced up front with us,\" said defensive end Garrett Sickels, the fourth member of Penn State's D-line. \"I think the inside guys are double-teamed the most. I've gotten some double teams - they might put a back on me or Carl or something like that. But the inside guys get it a lot.\" More coverage SHOP: Collegiate Sportswear & Merchandise \nThe quartet has accounted this season for 16 of Penn State's 25 sacks, which is tied for second in the nation, and 281/2 of its 53 tackles for loss, good for sixth. The 6-foot-7, 272-pound Nassib has picked up 10 sacks (first in the FBS) and 12 tackles for loss (tied for third). \nThe group will get a strong test Saturday night at top-ranked Ohio State, which has allowed just seven sacks in six games. But the Buckeyes' offensive line knows its task will be a difficult one. \n\"They're probably one of the best, if not the best, defensive lines we're going to see this year,\" offensive tackle Taylor Decker said. \"They lost a few guys [from last season], but they've had guys step up and play big-time roles, namely Carl Nassib.\" \nNassib, a West Chester native, received a scholarship from then-coach Bill O'Brien before the 2013 season. He started coming into his own last season and impressed coach James Franklin with his strength, his agility and his motor in spring practice and the preseason of this year. \n\"His intensity is unmatched on every single play,\" Sickels said. \nJohnson, the former St. Augustine Prep star, is the line's 6-foot-4, 323-pound run-stopper, a player who might be better rooted out of his spot in the middle with a forklift. Johnson is second on the team to Nassib with 31/2 sacks and 71/2 tackles for loss, and his season's highlight was a 71-yard fumble return for a touchdown on Sept. 26 against San Diego State. \nFor Johnson, being in the center of the action with his pals is pure and complete fun. \n\"It's just a matter of having fun and dominating,\" Johnson said. \"When you get out there, it's just fun. You don't get to be out there that often, only 12 times playing another team. It's great to have an opportunity to go out there and be with those guys. I love it.\" \nZettel, a 6-4, 284-pound fifth-year senior who made all-Big Ten last season, has not approached his 2014 numbers when he compiled eight sacks and 17 tackles for loss. But the fact that he has had just a half-sack this season, along with six tackles for losses, is evidence that the double teams have been going hard at him. \nOne of Penn State's highlights last season in a 31-24 double-overtime loss to the Buckeyes was Zettel's 40-yard interception return for a touchdown. \nWhen the Nittany Lions and the Buckeyes gather again in the Horseshoe, it again will be a pick-your-poison occasion for the Ohio State offensive line. Coach Urban Meyer certainly remembers how physical the two teams played a year ago. \n\"We went back and watched the tape,\" he said, \"and that was a violent, tough game . . . a lot of credit to Penn State and our guys.\"", "external_links": [], "published": "2015-10-15T07:30:00.000+03:00", "crawled": "2015-10-15T07:47:23.982+03:00", "highlightTitle": ""}