{"organizations": [], "uuid": "b26af0d139f73e693f99609f1b2c043e504e6d47", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thedenverchannel.com", "main_image": "http://media.thedenverchannel.com/photo/2015/10/02/CoachJimDaley_1443823002255_24701359_ver1.0_640_480.png", "site_section": "http://www.thedenverchannel.com/feeds/rssFeed?obfType=RSS_FEED&siteId=100003&categoryId=10004", "section_title": "Sports | 7NEWS", "url": "http://www.thedenverchannel.com/news/local-news/legendary-eaton-high-school-baseball-coach-ousted-failed-to-meet-contract-deadline", "country": "US", "title": "Hall of Fame HS baseball coach ousted at Eaton", "performance_score": 0, "site": "thedenverchannel.com", "participants_count": 1, "title_full": "Hall of Fame HS baseball coach ousted at Eaton", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T01:12:00.000+03:00", "replies_count": 0, "uuid": "b26af0d139f73e693f99609f1b2c043e504e6d47"}, "author": "Russell Haythorn", "url": "http://www.thedenverchannel.com/news/local-news/legendary-eaton-high-school-baseball-coach-ousted-failed-to-meet-contract-deadline", "ord_in_thread": 0, "title": "Hall of Fame HS baseball coach ousted at Eaton", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "4:05 PM, Oct 2, 2015 3 hours ago Previous Next 7NEWS reporter Kristen Skovira tells us he still wants to be a part of the program. KMGH Jim Danley, the winningest coach in Colorado high school baseball history, was ousted Friday at Eaton. (Photo/7NEWS reporter Russell Haythorn) Copyright 2015 Scripps Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. Show Caption Previous Next \nEATON, Colo. - The winningest coach in Colorado high school baseball history has been ousted from Eaton's baseball program, 7NEWS has learned. #BREAKING : Winningest coach in #Colorado h.s. #baseball history ousted at #Eaton . District: agreement couldn't be met pic.twitter.com/VbLniLCyDM — Russell Haythorn (@RussellHaythorn) October 2, 2015 \"I heard it from a fellow coach who said, ‘Hey they posted internally that there’s an opening for the head baseball coach',\" said coach Danley. Danley has been head baseball coach at Eaton High School since 1972. “I love baseball, I love working with players and seeing them improve,” he said. But now the coach with the winning record is without a job after some parents and students brought up concerns about his program. \nIn a statement obtained by 7NEWS, Eaton School District Superintendent Dr. Randy L. Miller said Danley's dismissal was due to his failure to meet a contractual deadline that would have sought to change what parents called a \"tough\" sports culture. \nBased on concerns brought forth by the Eaton comunity, a Performance Improvement Plan was presented to Mr. Jim Danley that outlined specific items that were necessary to change the culture of the Eaton High School Baseball program. \nRead the full statement from the school district here . \nOne of those specific items outline in the plan included removing his son and baseball team volunteer, Kirk Danley. \nParents said during a heated board meeting on Sept. 14 that Kirk ran aspects of the program and even micro-managed players to a level of deciding what sports they could compete in and what summer programs they could be a part of. \n“He sent out a contract,” said Sara Mondragon, whose son is a senior. “He wanted to make sure he got to them before the Greeley team did.” \nThe embattled coach defended his son saying, \"What these parents don't realize is everything coming from Kirk is actually coming from me.\" \nOther parents said the coach was pushing their sons too hard in order to win. \n\"Our kids are in tears,\" said a parent Monday night. \"The things he says to these boys, you can't even (hear) because you would just start crying.\" \nBut Danley said sometimes things can be misunderstood. “Coaching is a tough position to be in. It’s a profession that is just rife with opportunity for misunderstandings,” he said. Former players like Don Donahoo and supporters said the accusations are ridiculous. “I mean, shame on the people that are doing this,” said Donahoo. “They just want the kids to improve and be better and to love the game because they love the game,” said parent Kathleen McMahan. \nBut besides his methods, there was also a secondary issue -- an exchange of emails between school board members that suggests they conspired to remove Danley from his post. \nThe e-mails were sent privately and were only released to the press after an open-records request filed by the Greeley Tribune under the Freedom of Information Act. \nIn one e-mail uncovered by the Greeley Tribune, Eaton School Board President Tim Croissant says, 'One of (the) goals I would like to achieve in this matter is to try to protect the Eaton community from being on the front page of the Tribune with a ‘big negative story.'\" \nAfter learning he was fired on Friday evening, Danley released the following statement: \nI’m disappointed to hear of the decision to post the opening for the head baseball coaching job at Eaton High School. I have believed over the last few weeks that a process was in place through which an agreement could be reached in which I would be able to remain as head coach. In particular, alternative language for a performance plan had been discussed in which I was in agreement. \nI remain committed and open to discussing a mutually satisfactory arrangement in the event the School determines that it wants me as its coach. \nAs presented, I would be surprised if any current head coach of any sport at Eaton High School would have agreed to the original 13-point performance improvement plan as written. \nCoaching at Eaton, and working with young men and people throughout this great community, has always been a great privilege for me, and something that I would like to continue to be a part of for many more years. \nI look forward to answering any questions or inquiries anyone might have of me regarding this situation. \nJim Danley, \nEaton Baseball \nDanley said he's been busy fielding phone calls from community members sorry to see him go. “I’m in no way a victim. I’ve had the best job on the planet the last 44 years. It’s been wonderful,” he said. \nDanley's long-lasting 44-year career saw him win 11 state titles, including a national title this year. \nGet breaking news on your phone, download the free 7NEWS app for iPhone/iPads , Android and Kindle . And follow us on Facebook , Twitter and Instagram . Copyright 2015 Scripps Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.", "external_links": [], "published": "2015-10-04T01:12:00.000+03:00", "crawled": "2015-10-04T06:36:55.038+03:00", "highlightTitle": ""}