{"organizations": [], "uuid": "caa7b49ee99231ff6454a9311daafd7ef73b8587", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.abqjournal.com", "main_image": "http://main.abqjournal.netdna-cdn.com/wp-content/plugins/journal-open-graph/img/albuquerque-journal.jpg", "site_section": "http://www.abqjournal.com/", "section_title": "Albuquerque and New Mexico News, Sports, Business and more | Albuquerque Journal News", "url": "http://www.abqjournal.com/653338/opinion/trinity-site-downwinders-should-be-recognized.html", "country": "US", "title": "Editorial: Trinity Site downwinders should be recognized", "performance_score": 0, "site": "abqjournal.com", "participants_count": 1, "title_full": "Editorial: Trinity Site downwinders should be recognized | Albuquerque Journal News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T08:02:00.000+03:00", "replies_count": 0, "uuid": "caa7b49ee99231ff6454a9311daafd7ef73b8587"}, "author": "Albuquerque Journal Editorial Board", "url": "http://www.abqjournal.com/653338/opinion/trinity-site-downwinders-should-be-recognized.html", "ord_in_thread": 0, "title": "Editorial: Trinity Site downwinders should be recognized", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "On July 16, 1945, the first atomic bomb was detonated above ground in the desert about 50 miles west of Capitan at a place named Trinity Site. Nearby residents were unaware the early morning explosion would even take place, let alone that it would rain ash and debris upon them and spew waves of radiation as a result of a secret test of a weapon scientists in Los Alamos were preparing for use in the closing weeks of World War II.\nSome thought, with good reason, the end of the world was at hand – with the giant cloud and the sun rising in the west.\nTina Cordova, an Albuquerque businesswoman from Tularosa, about 40 miles southeast of Trinity Site, co-founded the Tularosa Basin Downwinders Consortium in 2005 with Tularosa resident Fred Tyler.\nCordova says “whole families were decimated” as a result of the test. “We were the unknowing, unwilling, uncompensated victims of the bomb.”\nThe consortium has been trying to obtain compensation for the victims through protests, lobbying and the gathering of hundreds of victim’s accounts. They’ll be protesting today in Tularosa and at the Trinity Site gate – the site is open to the public today.\nAlthough progress has been slow, Sen. Tom Udall on the 70th anniversary of the Trinity Site blast urged his colleagues from the Senate floor to approve Senate Bill 331, which would amend the Radiation Exposure Compensation Act, or RECA, to include the New Mexico downwinders. Udall and Sen. Martin Heinrich, D-NM, are among the co-sponsors of SB 331.\nSince 1990, RECA has paid out more than $2 billion in claims to residents of Nevada, Utah, Idaho and Colorado who were sickened by radiation from the Nevada Nuclear Test Site, but New Mexico has never been included.\n“The rest of the world didn’t know about the tragedies that happened in the Tularosa Basin. For a long time, the government denied that anything happened at all,” Udall said. “Attention was not paid then. It must be paid now.”\nVictims have waited too long. Many have died. However, there is no good reason those who remain should not be given restitution. Kudos to Senators Udall and Heinrich for taking up this cause that the full Congress should embrace.\nThis editorial first appeared in the Albuquerque Journal. It was written by members of the editorial board and is unsigned as it represents the opinion of the newspaper rather than the writers.", "external_links": [], "published": "2015-10-03T08:02:00.000+03:00", "crawled": "2015-10-03T20:20:58.289+03:00", "highlightTitle": ""}