{"organizations": ["Liverpool"], "uuid": "ba0b548933c01da7851767af17f90869e26ce9d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.themalaymailonline.com", "main_image": "http://www.themalaymailonline.com/uploads/articles/2015-10/jurgs1510s.JPG", "site_section": "http://www.themalaymailonline.com/feed/rss/sports\r", "section_title": "The Malay Mail Online | Sports", "url": "http://www.themalaymailonline.com/sports/article/epl-preview-klopp-set-for-liverpool-bow-mourinho-battles-doubts", "country": "MY", "title": "EPL preview: Klopp set for Liverpool bow, Mourinho battles doubts", "performance_score": 0, "site": "themalaymailonline.com", "participants_count": 0, "title_full": "EPL preview: Klopp set for Liverpool bow, Mourinho battles doubts", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T04:52:00.000+03:00", "replies_count": 0, "uuid": "ba0b548933c01da7851767af17f90869e26ce9d7"}, "author": "", "url": "http://www.themalaymailonline.com/sports/article/epl-preview-klopp-set-for-liverpool-bow-mourinho-battles-doubts", "ord_in_thread": 0, "title": "EPL preview: Klopp set for Liverpool bow, Mourinho battles doubts", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mourinho", "Klopp"], "text": "Print Article \nNew Liverpool manager Jurgen Klopp poses after the press conference at Anfield. — Reuters pic LONDON, Oct 16 — Jurgen Klopp has challenged Liverpool’s under-performing stars to rediscover their swagger when the new Reds boss gets his first taste of the Premier League against Tottenham tomorrow. \nAll eyes will be on Klopp’s eagerly anticipated debut at White Hart Lane following the highly-regarded German’s recent appointment as successor to the sacked Brendan Rodgers. \nThe charismatic 48-year-old’s impressive track record at Borussia Dortmund has established him as one of Europe’s top coaches and his arrival has rekindled enthusiasm among Liverpool fans who had grown disillusioned with Rodgers’ trophyless reign. \nBut, with Liverpool slumping to 10 th place after just one win in their last nine matches in all competitions, Klopp is well aware he faces a major rebuilding job before he can dream of emulating legendary Anfield managers like Bill Shankly, Bob Paisley and Kenny Dalglish. \n“I have met two kinds of people in the last week: most of them say ‘We’ll win the league’ and the other guys look at me like ‘What have you done? Why are you here?’,” Klopp said. \n“Both are not right in this moment. It is not interesting what people think about this.” \nWhile Klopp is cautious about revealing his own ambitions, he has already identified one key problem that needs to be solved if Liverpool are to get back on track quickly. \nHe believes the players were hamstrung by a fear of failure as the pressure mounted on Rodgers and he wants them to forget about past mistakes. \n“Some things you can change instantly: mentality, readiness,” Klopp said. \n“To get really tuned as a team takes time but I am really not interested in the problems we could have tomorrow. \n“I want to see more bravery, more fun in their eyes. I want to see that they like what they do.” \nWhile Klopp will steal most of the headlines this weekend, new Sunderland manager Sam Allardyce returns to the Premier League facing arguably the toughest challenge of his career. \nThe second bottom Black Cats turned to Allardyce after Dick Advocaat quit, making him the first man to take charge of bitter north-east rivals Newcastle and Sunderland. \nHammer blow \nAllardyce, who left West Ham at the end of last season, has a well-earned reputation for helping clubs punch above their weight. \nBut Sunderland have failed to win any of their first eight matches and defeat in Allardyce’s debut at struggling West Bromwich Albion would be a hammer blow. \n“It’s a big challenge. Even at this early stage of the season, it’s clear that we are in trouble,” Allardyce said. \n“It could take the vast majority of our 30 matches to get safe.” \nOnly Newcastle are keeping Sunderland off the foot of the table and the winless Magpies suffered another setback when Netherlands goalkeeper Tim Krul was ruled out for the rest of the season. \n“It’s a massive blow for us, you’re talking about one of the best players in our team,” Newcastle manager Steve McClaren said ahead of Sunday’s match against Norwich. \n“Here, it just seems to be one disaster after another.” \nRemarkably, Jose Mourinho ranks among the managers most under pressure following Chelsea’s woeful start to their Premier League title defence. \nFeted as champions in May, the Blues are now languishing in 16 th place following a 3-1 home defeat against Southampton. \nThat loss came amid reports of dressing room rifts and prompted Mourinho to make an impassioned defence of his credentials. \nBut young Chelsea midfielder Ruben Loftus-Cheek has no doubts Mourinho is the man to get the champions back in the groove, starting against Aston Villa tomorrow. \n“We think he is the manager for Chelsea,” Loftus-Cheek said of the squad. “When he criticises you that’s only so you get better, so we are all backing Jose.” \nLeaders Manchester City host Bournemouth bolstered by captain Vincent Kompany’s return after a five-game injury absence, but Manuel Pellegrini’s side will be without star striker Sergio Aguero and key midfielder David Silva after both suffered knocks on international duty. \nSecond placed Arsenal will face Watford for the first time in nine years when they travel to Vicarage Road, while third placed Manchester United are at Everton. \nFixtures (1400GMT unless stated) \nTomorrow \nChelsea v Aston Villa, Crystal Palace v West Ham, Everton v Manchester United, Manchester City v Bournemouth, Southampton v Leicester, Tottenham v Liverpool (1145GMT), Watford v Arsenal (1630GMT), West Brom v Sunderland \nSunday", "external_links": [], "published": "2015-10-16T04:52:00.000+03:00", "crawled": "2015-10-16T05:14:47.910+03:00", "highlightTitle": ""}