{"organizations": [], "uuid": "66aa01cd12cfe9a2315cadf5925119db1fccb4fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.10tv.com", "main_image": "http://www.10tv.com/content/graphics/2014/10/14/10_Things_Rutgers_at_Ohio_State_Large.jpg", "site_section": "http://www.10tv.com/content/syndication/sports.xml", "section_title": "Sports News Headlines | WBNS 10TV", "url": "http://www.10tv.com/content/stories/2015/10/22/10-things-to-know-ohio-state-vs.-rutgers.html", "country": "US", "title": "10 Things To Know: Ohio State Vs. Rutgers", "performance_score": 0, "site": "10tv.com", "participants_count": 0, "title_full": "10 Things To Know: Ohio State Vs. Rutgers", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T19:28:00.000+03:00", "replies_count": 0, "uuid": "66aa01cd12cfe9a2315cadf5925119db1fccb4fd"}, "author": "", "url": "http://www.10tv.com/content/stories/2015/10/22/10-things-to-know-ohio-state-vs.-rutgers.html", "ord_in_thread": 0, "title": "10 Things To Know: Ohio State Vs. Rutgers", "locations": ["Ohio"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By 10TV Web Staff Thursday October 22, 2015 12:28 PM UPDATED: Thursday October 22, 2015 2:02 PM \nThe Ohio State Buckeyes will travel to Piscataway, New Jersey to face off against the Rutgers Scarlet Knights, in their second consecutive night game. \nOhio State (7-0) is looking to remain undefeated while Rutgers currently has a record of 3-3. Kickoff will be at 8:00 p.m. inside High Point Solutions Stadium. \nHere are 10 things to know before the game: Round 2 \nThis will only be the second meeting all-time between these two football programs; Ohio State won the inaugural matchup last year 56-17. \nNight Terrors \nOhio State all-time in night games has a record of 48-23, while they went for a school record of 8-0 last season in night games and they look to win their third of this year against Rutgers. \nUrban Is Scary Good During The Scary Months \nIf it seems like Urban Meyer just can’t lose during the months of October and November, it’s because he doesn’t. Meyer is a combined record of 25-0 in games played during those two months for his career at Ohio State. \nThe Best Of The Best \nOhio State is currently sitting in first place, for being in first place! The Buckeyes have been number one in the AP polls more times than any other team in college football (103). Their all-time record while holding this position in the polls is 73-12-1. \n'Zeke Is Unstoppable \nEzekiel Elliot has a streak going of twelve straight games with over 100-yards rushing. He is averaging 7.5 yards per carry and 159.3 rushing yards per game during this stretch. Elliot leads the Big Ten this season with 141.1 ypg on the ground. \nMy Time To Shine \nUrban Meyer recently announced that J.T. Barrett will be getting the nod to start his first game of the year against Rutgers this weekend. Barrett had been coming in as the “Red Zone” quarterback, but after his four touchdown performance against Penn State he’ll now start. Winning The Battle In The Trenches \nJoey Bosa and Tyquan Lewis have been giving teams problems in the back field this year as they are both top 10 within the Big Ten in TFL with 9.0 apiece. This has helped the “Silver Bullet” defense of Ohio State to lead the Big Ten in total pass defense (143.6) and second in the Big Ten with 8 interceptions because they force teams to be one-dimensional. \n“Running” The Table \nOhio State is currently riding a 20-game win streak which is Urban Meyer’s fourth career streak of at least that many games, one of the main reasons for the streak is the rushing offense. Ohio State’s current active roster has 9,175 rushing yards and 93 rushing touchdowns. Braxton Miller and Ezekiel Elliot lead the team as Miller has 3,245 rushing yards and 33 TDs while Elliott has 3,128 yards and 31 TDs. J.T. Barrett is third on the team with 1,166 rushing yards for his career. \nA Big Play Waiting To Happen \nAs people watch Ohio State play they are just waiting for Ezekiel Elliot to bust out a big play as he is averaging 28.3 yards from scrimmage for every play that he has scored a touchdown this season. Over the last two seasons Zeke is first in the NCAA in yards from scrimmage (3,217), rushing yards (2,866), second in rushing touchdowns (29) and third in offensive touches (469). \nThe King Of College Football \nHead football coach, Urban Meyer, has the highest winning percentage amongst all active FBS coaches at 85.1 percent. With a win this weekend against Rutgers he will have 150 career wins as a head coach, and would bring his overall record to 150-26. \nJust A Little Bonus \nThe Ohio State Marching Band will be putting on a special pregame performance during the NFL’s Jaguars – Bills game Sunday morning at Wembley Stadium in London, England. ©2015 by 10TV.com. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Currently in Columbus", "external_links": [], "published": "2015-10-22T19:28:00.000+03:00", "crawled": "2015-10-22T23:52:07.411+03:00", "highlightTitle": ""}