{"organizations": [], "uuid": "0b8ad28e05b565c33ae373f5095dab5cd52acfb3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "http://s2.reutersmedia.net/resources/r/?m=02&d=20151023&t=2&i=1089219343&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB9M0QF", "site_section": "http://www.reuters.com/news/sports", "section_title": "Sports News, Highlights &amp; Coverage | Reuters.com", "url": "http://www.reuters.com/article/2015/10/23/us-nba-lakers-bryant-idUSKCN0SH1PR20151023", "country": "US", "title": "Bryant eyes new role in his likely final season", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Bryant eyes new role in his likely final season | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T18:07:00.000+03:00", "replies_count": 0, "uuid": "0b8ad28e05b565c33ae373f5095dab5cd52acfb3"}, "author": "Mark Lamport-Stokes", "url": "http://www.reuters.com/article/2015/10/23/us-nba-lakers-bryant-idUSKCN0SH1PR20151023", "ord_in_thread": 0, "title": "Bryant eyes new role in his likely final season", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES Throughout his illustrious All-Star career, Kobe Bryant has made a living by making the seemingly impossible possible for the Los Angeles Lakers.\nThe 'Black Mamba' has made a habit of draining game-winning shots despite being double or triple-teamed, establishing a reputation for being one of the best ever closers in the National Basketball Association as a shooting guard.\nAt times, Bryant has been accused of being a ball-hog, though he has frequently excelled as a facilitator and is unrivalled in the modern game when it comes to basketball IQ.\nAs he approaches his 20th, and perhaps final, season in the league, Bryant is preparing for a very different role for the Lakers in a bid to curb a growing list of injuries in recent years after succumbing to the influence of Father Time.\nHe spent almost eight months on the sidelines in 2013 with a torn Achilles' tendon, then played just six games during the 2013-14 season because of a severe knee injury.\nLast season, Bryant played 35 games for the Lakers but increasingly suffered soreness in his knees, feet and back, prompting coach Byron Scott to cut back significantly on his playing time going forward while altering his on-court role.\n\"If this is his last year, I want him to go out standing,\" Scott told reporters about the 37-year-old Bryant while preparing his team for the 2015-16 season. \"I don't want him to go out hurt.\n\"I want to make sure I do everything in my power to make sure we stick to the game plan ... trying to make that (his playing time) as limited as possible and also back-to-back games.\n\"I want to win and I know having him on the court gives me the best opportunity to win, but I also know that I've got to think about him more than anything.\"\nNamed Kobe by his parents after they spotted the popular Japanese cut of beef on a restaurant menu shortly before his birth, Bryant has already established himself as one of the NBA's greatest players ever.\nMULTIPLE HONORS\nHe has appeared in 17 All-Star games, was named Most Valuable Player for the 2007-08 season and landed MVP honors in 2009 and 2010 as he led the Lakers to consecutive NBA Championship titles.\nAll too often, Bryant has won games almost single-handedly but, as he heads into his 20th season, he looks forward to playing second fiddle behind the youthful backcourt of Jordan Clarkson and D'Angelo Russell when it comes to ball-handling.\n\"All minutes aren't created equal,\" said Bryant. \"We've got some guys here this year that can really take a lot off me -- D'Angelo and Clarkson and their ability to handle and create and make plays, and Julius (Randle) making plays.\n\"I think the minutes that I do play won't be as heavy of minutes as they have been.\"\nBryant intends to fully embrace playing off the ball and 'spotting up', a role he relished early in his career before former Lakers head coach Phil Jackson persuaded him to become the go-to ball handler for the Los Angeles team.\n\"I do not like setting up the offense,\" said Bryant. \"I hate it. Phil made me do it years ago, and I had to learn how to do it years ago to set up the triangle.\n\"I haven't played with point guards that are playmakers at heart and D'Angelo is a ridiculous playmaker. I'd much rather catch and shoot or catch then one, two dribble pull-up. You guys know I like scoring the ball.\"\nBryant has won five NBA championship rings, and averaged 25.4 points and 4.8 assists per game during his glittering career in the league.\nDespite the adverse effects of ageing on a body which has clocked up more playing time in NBA history than all but four other players, expect Bryant to once again deliver the extraordinary for the Lakers during his 2015-16 campaign.\n(Editing by Frank Pingue)", "external_links": [], "published": "2015-10-23T18:07:00.000+03:00", "crawled": "2015-10-23T18:12:59.241+03:00", "highlightTitle": ""}