{"organizations": [], "uuid": "a6dbbeec2900ce9ab80eeccfee0564f400209dab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbssports.com", "main_image": "https://41.media.tumblr.com/114f1bd9bfc47d8c9e94528ffeb063de/tumblr_nvzyyimISg1qem99po1_1280.png", "site_section": "http://www.cbssports.com/partners/feeds/rss/home_news", "section_title": "Sports News : CBSSports.com", "url": "http://www.cbssports.com/golf/eye-on-golf/25333843/2015-presidents-cup-us-takes-one-point-lead-into-sunday-singles", "country": "US", "title": "2015 Presidents Cup: US takes one-point lead into Sunday singles", "performance_score": 0, "site": "cbssports.com", "participants_count": 5, "title_full": "2015 Presidents Cup: US takes one-point lead into Sunday singles - CBSSports.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T12:22:00.000+03:00", "replies_count": 4, "uuid": "7a5b016967ee6f8293431dfb76faffe798ce1be3"}, "author": "Kyle Porter", "url": "http://www.cbssports.com/golf/eye-on-golf/25333843/2015-presidents-cup-us-takes-one-point-lead-into-sunday-singles#post-0", "ord_in_thread": 0, "title": "2015 Presidents Cup: US takes one-point lead into Sunday singles", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sangmoon Bae heard plenty of roars on Saturday. (YouTube/PGATour) \n\nThe United States takes a narrow one-point lead (9.5 to 8.5) into the Sunday singles matches after splitting the four four-ball matches on Saturday evening ( and the alternate shot matches on Saturday morning ). There wasn't as much drama as there was on Friday as this week's stars on both sides asserted themselves.\nLet's take a look at how each match went down.\nSangmoon Bae and Hideki Matsuyama defeat Chris Kirk and Jimmy Walker 6 and 5 \nKirk and Walker got lit on fire by Matsuyama and Bae. The International squad went out in a combined 65 on the front nine and made birdie on nine of their first 11 holes. After the 12th hole, with the match dormie, Walker and Kirk thought it was over and tried to concede. That's how bad it was for the American side. It's tough to blame them, either. They played fine. It's just that 2000 Tiger Woods and 2005 Tiger Woods couldn't have taken down Bae and Matsuyama with the way they played. \n\"I'm really glad to be here,\" Bae told Golf Channel. \"We had a really, really good run today. There's a lot of guys yelling. It helps me.\"\nJohnny Miller said it well on the Golf Channel broadcast. \"Let's put it this way,\" he said. \"No one would have beat the International team today.\" That would be correct.\n\nJordan Spieth and Patrick Reed defeat Jason Day and Charl Schwartzel 3 and 2 \nJordan Spieth did all kinds of Jordan Spieth things on Saturday evening in South Korea. Long 35-foot putts? Check. Bunker hole-outs for birdie? Yes. Perfect par 3 irons? Indeed.\n\nSpieth threw Patrick Reed on his back and shot a 31 on the front nine to put some distance between them and the International duo of Day and Schwartzel. It was the first real time we've seen Spieth go full \"I'm the best player on the planet\" mode this week. I sort of don't think it will be the last.\nHe made eight birdies in 16 holes and the International squad never had a chance. They somehow took it all the way to the 16th hole in complete darkness, but this thing was wrapped up pretty early on down the back nine. When Spieth is doing Spieth things, you have no chance.\nBranden Grace and Louis Oosthuizen defeat J.B. Holmes and Bubba Watson 1 up \nI sort of felt bad for Holmes and Watson. They played lights out (and have been doing so all week) and ran into the South African buzzsaw duo of Oosthuizen and Grace. Those two birdied seven (!) of the first 10 holes and somehow the US team extended the match all the way to the 18th hole. \nThis shot from Branden Grace pretty much summed up how the day went for the Internationals.\n\nAlso, how good is this?\nLouis Oosthuizen & Branden Grace: 4-0-0; 2nd tandem to do that in #PresidentsCup history (Woods/Stricker in 2009).\n— Justin Ray (@JustinRayGC) October 10, 2015 Phil Mickelson and Zach Johnson defeat Adam Scott and Anirban Lahiri 3 and 2 \nMickelson and Johnson remained undefeated by taking down Scott and Lahiri. This match was tough to watch at times. Scott putted about like how I imagine I would have if I was playing in a Presidents Cup and Lahiri looked overwhelmed. \nMickelson and Johnson led after every single hole of this match and used an early lead to buoy their match late. They only made three total birdies on the back nine, but it was more than enough to dispose of Lahiri and Scott.\nSo now the US takes a 9.5 to 8.5 lead heading into the singles matches. It's the closest this thing has been going into the final session since it was tied in 2005. The US went on to win that year.\nSaturday was important, though, because no team has ever won the Presidents Cup when trailing going into the final session. With the narrow lead and loads more talent, the US should run away with this thing on Sunday. But the matches aren't played on paper, and even if they were, it wouldn't exactly benefit the Americans.\n1 point separates USA & INT entering singles, closest since it was tied in 2005. Since '05, the 2 teams are even in singles (30 Pts each).\n— Justin Ray (@JustinRayGC) October 10, 2015 Spieth rolling, Grace and Oosthuizen destroying all competitors and Mickelson throwing shade all over every country imaginable. Sunday should be all kinds of fun.\nTopics: Adam Scott , Anirban Lahiri , Anirban Lahiri , Branden Grace , Bubba Watson , Charl Schwartzel , Charl Schwartzel , Chris Kirk , Chris Kirk , Hideki Matsuyama , J.B. Holmes , Jason Day , Jimmy Walker , Jordan Spieth , Louis Oosthuizen , Phil Mickelson , Tiger Woods , Zach Johnson , 2015 Presidents Cup , GOLF", "external_links": [], "published": "2015-10-10T12:22:00.000+03:00", "crawled": "2015-10-10T18:41:47.635+03:00", "highlightTitle": ""}