{"organizations": [], "uuid": "1209904c545e7fac7e25c7c7c88eafe815c41361", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.winnipegfreepress.com", "main_image": "http://media.winnipegfreepress.com/images/326*432/NYGW102-108_2015_200147_high.jpg", "site_section": "http://www.winnipegfreepress.com/rss/?path=/sports", "section_title": "Winnipeg Free Press: Sports", "url": "http://www.winnipegfreepress.com/sports/turris-scores-2-and-coaching-challenge-disallows-sabres-goal-in-senators-3-1-win-331493311.html", "country": "US", "title": "Turris scores 2 and coaching challenge disallows Sabres goal in Senators 3-1 win", "performance_score": 0, "site": "winnipegfreepress.com", "participants_count": 1, "title_full": "Turris scores 2 and coaching challenge disallows Sabres goal in Senators 3-1 win - Winnipeg Free Press", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T00:03:00.000+03:00", "replies_count": 0, "uuid": "1209904c545e7fac7e25c7c7c88eafe815c41361"}, "author": "John Wawrow, The Associated Press", "url": "http://www.winnipegfreepress.com/sports/turris-scores-2-and-coaching-challenge-disallows-sabres-goal-in-senators-3-1-win-331493311.html", "ord_in_thread": 0, "title": "Turris scores 2 and coaching challenge disallows Sabres goal in Senators 3-1 win", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BUFFALO, N.Y. - Credit coach Dave Cameron with a big assist in the Ottawa Senators' season-opening 3-1 win over the Buffalo Sabres on Thursday night.\nJust when it seemed as if rookie centre Jack Eichel and the new-look Sabres had grabbed the momentum by scoring twice in a span of 1:23 midway through the third period, Cameron successfully used his coach's challenge to negate what would have been Buffalo's tying goal.\n\nBuffalo Sabres center Tyler Ennis (63) is checked by Ottawa Senators defenseman Erik Karlsson (65) during the first period of an NHL hockey game, Thursday, Oct. 8, 2015, in Buffalo, N.Y. (AP Photo/Gary Wiepert) \n\"Well it's huge. It's a goal they scored and it doesn't count,\" Cameron said, who passed the credit to assistant coach Jason Smith for suggesting the challenge. \"We really had nothing to lose in calling it.\"\nA video review showed that forward Zemgus Girgensons was offside by just a hair when the Sabres gained the zone and eventually scored on Evander Kane's wraparound goal with 9:26 remaining.\nThe Senators then hung on and sealed the win on Curtis Lazar's goal into an empty net with 1:04 remaining.\n\"At first I didn't expect the challenge,\" said Senators forward Kyle Turris, who scored twice. \"I didn't see the offside, but yeah, it was a great heads-up play, and I'm liking the challenges now.\"\nThe new rule was introduced by the NHL this season, allowing a coach one challenge per game so long as his team still has its timeout.\nThe Sabres accepted the decision, even though it cost them.\n\"We got the second goal and the building was buzzing. It's just disappointing to have it turn around that way,\" Girgensons said. \"That was a close call, but it was the right call.\"\nThe Sabres could only blame themselves in a game in which they were outplayed through the first two periods before finally generating momentum in the third period.\nEichel got the sold-out crowd on its feet by scoring a power-play goal in his debut. At 18, the second player selected in the draft, is regarded as the future face of a franchise that has spent the past two seasons rebuilding through youth.\nSet up by a pass from Marcus Foligno to the left of the net, Eichel snapped a shot into the open side before goalie Craig Anderson could get across.\n\"It was a special moment, something I'll never forget,\" Eichel said. \"But it's tough to really enjoy it when you don't win the game.\"\nThe Sabres finished the game minus starting goalie Robin Lehner, who did not return after appearing to hurt his left leg 7:30 into the second period.\nWithout revealing the nature of the injury, coach Dan Bylsma said the initial prognosis is that the injury is not a short-term one.\nLehner was untouched when he went down in his crease. Though he left the ice favouring his left leg, the goalie was spotted wearing a protective boot on his right ankle.\nLehner allowed one goal on 12 shots, and was replaced by Chad Johnson, who gave up a goal on nine shots.\nTurris scored 30 seconds in on Ottawa's first shot on net to cap a 3-on-2 break. He made it 2-0 midway through the second period after linemate Mark Stone stripped defenceman Rasmus Ristolainen of the puck behind Buffalo's net.\nThe Senators carried over their run of dominance after closing last season with a 23-4-4 surge to finish seventh in the Eastern Conference standings. They also improved to 12-0-3 in their past 15 road games dating to last season. That matched a franchise record consecutive road games with a point set from March 4 to Nov. 4, 2007, when Ottawa went 11-0-4 according to STATS.\nNOTES: Sabres captain Brian Gionta was held out after he sustained a minor lower body injury in practice this week. Bylsma said there's a chance he can play Saturday when Buffalo hosts Tampa Bay. ... Cameron's challenge was the second this season after Toronto coach Mike Babcock was successful in overturning a goal because of goalie interference in Montreal's 3-1 win on Wednesday night. ... Turris' goal was by far the fastest to open a season in Senators franchise history, according to STATS. The previous fastest goal was scored by Wade Redden 2:29 into 5-4 season-opening win at Toronto on Oct. 3, 2001.\n ", "external_links": [], "published": "2015-10-09T00:03:00.000+03:00", "crawled": "2015-10-09T07:47:03.042+03:00", "highlightTitle": ""}