{"organizations": [], "uuid": "29ad0176253a981639d38d98ad8f70b7fe133712", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reviewjournal.com", "main_image": "http://www.reviewjournal.com/sites/default/files/field/media/1003835856_glf-shriners_1_3_1_2.jpg", "site_section": "http://www.reviewjournal.com/taxonomy/term/31/feed", "section_title": "Sports", "url": "http://www.reviewjournal.com/shriners-open/shriners-open-director-sees-record-crowd-makes-plans-next-pga-event", "country": "US", "title": "Shriners Open director sees record crowd, makes plans for next PGA event", "performance_score": 0, "site": "reviewjournal.com", "participants_count": 0, "title_full": "Shriners Open director sees record crowd, makes plans for next PGA event", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T22:38:00.000+02:00", "replies_count": 0, "uuid": "29ad0176253a981639d38d98ad8f70b7fe133712"}, "author": "", "url": "http://www.reviewjournal.com/shriners-open/shriners-open-director-sees-record-crowd-makes-plans-next-pga-event", "ord_in_thread": 0, "title": "Shriners Open director sees record crowd, makes plans for next PGA event", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Shriners Open director sees record crowd, makes plans for next PGA event Shriners Open director sees record crowd, makes plans for next PGA event \nBrett Stegmaier hits off the 7th tee during round three of the Shriners Hospitals for Children Open golf tournament at TPC Summerlin in Las Vegas Sunday, Oct. 25, 2015. Erik Verduzco/Las   Follow @Erik_Verduzco Shriners Open director sees record crowd, makes plans for next PGA event \nSmylie Kaufman holds up his trophy after his win in the Shriners Hospitals for Children Open golf tournament at TPC Summerlin in Las Vegas Sunday, Oct. 25, 2015. Erik Verduzco/Las   Follow @Erik_Verduzco Shriners Open director sees record crowd, makes plans for next PGA event \nOct 25, 2015; Las Vegas, NV, USA; Smylie Kaufman hugs his girlfriend after walking off the 18th hole during the final round of the Shriners Hospitals for Children Open at TPC Summerlin at TPC Summerlin. Mandatory Credit: Joshua Dahl-USA TODAY Sports Shriners Open director sees record crowd, makes plans for next PGA event \nKevin Na hits the ball on the 7th fairway during round three of the Shriners Hospitals for Children Open golf tournament at TPC Summerlin in Las Vegas Sunday, Oct. 25, 2015. Erik Verduzco/Las   Follow @Erik_Verduzco Shriners Open director sees record crowd, makes plans for next PGA event \nOct 25, 2015; Las Vegas, NV, USA; Smylie Kaufman reacts after making a putt on the 18th hole during the final round of the Shriners Hospitals for Children Open at TPC Summerlin at TPC Summerlin. Mandatory Credit: Joshua Dahl-USA TODAY Sports Shriners Open director sees record crowd, makes plans for next PGA event \nBrett Stegmaier reacts after hitting a birdie on the 9th hole during round three of the Shriners Hospitals for Children Open golf tournament at TPC Summerlin in Las Vegas Sunday, Oct. 25, 2015. Erik Verduzco/Las   Follow @Erik_Verduzco Shriners Open director sees record crowd, makes plans for next PGA event \nOct 25, 2015; Las Vegas, NV, USA; Smylie Kaufman fist bumps Fabian Gomez on the 18th hole during the final round of the Shriners Hospitals for Children Open at TPC Summerlin at TPC Summerlin. Mandatory Credit: Joshua Dahl-USA TODAY Sports Shriners Open director sees record crowd, makes plans for next PGA event \nPatton Kizzire reacts after completing round three of the Shriners Hospitals for Children Open golf tournament at TPC Summerlin in Las Vegas Sunday, Oct. 25, 2015. Erik Verduzco/Las   Follow @Erik_Verduzco Shriners Open director sees record crowd, makes plans for next PGA event \nPatton Kizzire hits the ball on the 18th fairway during round three of the Shriners Hospitals for Children Open golf tournament at TPC Summerlin in Las Vegas Sunday, Oct. 25, 2015. Erik Verduzco/Las   Follow @Erik_Verduzco Shriners Open director sees record crowd, makes plans for next PGA event \nBrett Stegmaier hits the ball on the 9th fairway during round three of the Shriners Hospitals for Children Open golf tournament at TPC Summerlin in Las Vegas Sunday, Oct. 25, 2015. Erik Verduzco/Las   Follow @Erik_Verduzco Shriners Open director sees record crowd, makes plans for next PGA event \nKevin Na hits the ball on the 6th fairway during round three of the Shriners Hospitals for Children Open golf tournament at TPC Summerlin in Las Vegas Sunday, Oct. 25, 2015. Erik Verduzco/Las   Follow @Erik_Verduzco Shriners Open director sees record crowd, makes plans for next PGA event \nKevin Na hits the ball on the 7th fairway during round three of the Shriners Hospitals for Children Open golf tournament at TPC Summerlin in Las Vegas Sunday, Oct. 25, 2015. Erik Verduzco/Las   Follow @Erik_Verduzco Shriners Open director sees record crowd, makes plans for next PGA event \nKevin Na hits reacts after hitting a birdie on the 7th hole during round three of the Shriners Hospitals for Children Open golf tournament at TPC Summerlin in Las Vegas Sunday, Oct. 25, 2015. Erik Verduzco/Las   Follow @Erik_Verduzco Shriners Open director sees record crowd, makes plans for next PGA event \nPatton Kizzire looks on after hitting the ball on the 18th fairway during round three of the Shriners Hospitals for Children Open golf tournament at TPC Summerlin in Las Vegas Sunday, Oct. 25, 2015. Erik Verduzco/Las   Follow @Erik_Verduzco Related links Las   \nThat was some party Patrick Lindsey threw at TPC Summerlin over the weekend. \nThe first-year tournament director of the Shriners Hospitals for Children Open was a bit bleary-eyed Monday morning but he was still smiling. He had witnessed an amazing final round Sunday that saw PGA Tour rookie Smylie Kaufman play the best 18 holes of his life in posting a 10-under-par 61. Then Kaufman saw that 16-under overall score of 268 his stand up as Kaufman won the tournament and collected $1,150,000 along with 500 FedEx Cup points plus two years' exemption on the Tour and a spot in the Masters next April. \nThe off-the-course news as good. Lindsey said the tournament drew a record four-day attendance of 37,500. \n\"There was a lot of planning in a short time period,\" he said. \"I had only been on the job for six months. But our staff and our volunteers were amazing. I was thrilled that we produced a great product for the fans and for the Shriners.\" \nWhat does Lindsey do for an encore? He said his challenge going forward is two-fold: First, keep the momentum from the week going throughout the year. Two, get more people to watch from the front nine of the course. \n\"I want to see us get involved with more events in the community throughout the year and keep getting the word out,\" he said. \"We need to maintain the drumbeat. \n\"When we get the fans to come out, I'd like to get more of them out on the course, especially on the front nine. We've got to create some more fun destinations for the fans.\" \nYet there's only so much he can control. The weather was out of his hands and the play inside the ropes is left to those competing. But Lindsey got a great finish where a half-dozen golfers took aim at Kaufman but could never overtake him. Kevin Na caught Kaufman at 16-under with two holes to play. But he bogeyed the par-3 17th and saw his long birdie putt just miss at the par-4 18th which would have forced a playoff. \n\"When I look back on the final round, I thought how fitting it was for Las Vegas to have all this drama over four days come down to one or two shots and see hearts broken and dreams fulfilled,\" Lindsey said. \"I felt terrible for Kevin but it was great for Smylie. This tournament changed his life.\" \nLindsey said the Shriners were also thrilled to have their message get out across North America in such a positive way. One such avenue was having 18 Shriners Hospitals patients serve as standard bearers over the weekend and the goodwill that it generated among the players and for fans watching on The Golf Channel. \n\"I don't know how you put a dollar value on something like that,\" Lindsey said of the standard bearers program. \"The Shriners were thrilled and overjoyed and they had a fantastic time. And the players seemed touched by having the kids walk the course with them. You could tell by the way they interacted with them after their round. it wasn't just 'Here's an autgraphed ball' and walk away. They posed for pictures and talked to the kids. Smylie spent an hour with all the kids after he won and he got a real thrill out of it.\" \nLindsey said plans are already underway for next years' event. He said the plan is to hold ticket prices where they are. An adult daily badge was $35 and kids 18 and under were admitted free. Lindsey said that policy is important to allow families to attend. \n\"We have to keep it affordable if we hope to keep growing our attendance,\" he said. \"The Shriners are all about family and to see so many kids at the course enjoying themselves was great.\" \nLindsey said while it would be great to be the Waste Management Phoenix Open and draw 40,000 a day for a rowdy atmosphere, it wouldn't be the right fit for the Shriners. \n\"I'd love to see the university (UNLV) get more involved and have lots of students come out,\" he said. \"We certainly would welcome that. But there's only one Phoenix. We want to concentrate on being the best Shriners Hospitals for Children Open that we can.\" \nContact reporter Steve Carp at scarp@reviewjournal.com or 702-387-2913. Follow him on Twitter: @stevecarprj Comment section guidelines The below comment section contains thoughts and opinions from users that in no way represent the views of the Las   or GateHouse Media. This public platform is intended to provide a forum for users of reviewjournal.com to share ideas, express thoughtful opinions and carry the conversation beyond the article. Users must follow the guidelines under our Commenting Policy and are encouraged to use the moderation tools to help maintain civility and keep discussions on topic.", "external_links": [], "published": "2015-10-26T22:38:00.000+02:00", "crawled": "2015-10-26T22:59:20.627+02:00", "highlightTitle": ""}