{"organizations": [], "uuid": "361ebc1f698b286a86c91d5ba401977250dc3f79", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fox8live.com", "main_image": "http://APMOBILE.images.worldnow.com/images/9063873_G.jpg", "site_section": "http://www.fox8live.com/", "section_title": "New Orleans News, Weather, Saints - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "url": "http://www.fox8live.com/story/30312592/san-francisco-school-election-delay-sparks-criticism", "country": "US", "title": "San Francisco school election delay sparks criticism", "performance_score": 0, "site": "fox8live.com", "participants_count": 1, "title_full": "San Francisco school election delay sparks criticism - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "361ebc1f698b286a86c91d5ba401977250dc3f79"}, "author": "cbs8", "url": "http://www.fox8live.com/story/30312592/san-francisco-school-election-delay-sparks-criticism", "ord_in_thread": 0, "title": "San Francisco school election delay sparks criticism", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By SUDHIN THANAWALA\nAssociated Press SAN FRANCISCO (AP) - A student election at a mostly Hispanic San Francisco middle school turned into a debate about the democratic process when the principal delayed the results because the winners did not reflect the school's diverse student body.\nEverett Middle School Principal Lena Van Haren announced the winners on Monday, more than a week after the results were known.\nVan Haren said in a phone interview that she had no intention of annulling the votes, but wanted to first engage all the candidates in a discussion about how to ensure underrepresented groups were heard. One idea was to add representatives to the student council, she said.\n\"I apologized to parents for causing any anxiety,\" she said. \"I was never planning on changing the elections.\"\nThe school of about 500 6th, 7th and 8th graders is 56 percent Hispanic or Latino and 9 percent African American, according to data on the California Department of Education website. Most of the Hispanic or Latino students are native Spanish speakers, according to Van Haren. The school is located in the city's Mission District, which has seen rents soar as technology workers move in and gentrify the neighborhood.\nVan Haren said African Americans and Latinos were underrepresented among the students who became president, vice-president, treasurer, secretary and representatives for the three grades. None of the elected students was a native Spanish speaker, she said.\n\"I feel really strongly that it's not just about having a diverse student council so it looks nice,\" she said. \"I as principal want to elevate student voices and see how they are experiencing school. If I'm missing certain groups, I'm not going to get a clear picture.\"\nTodd David, whose son, Noah, is an 8th grader at the school, said the principal undermined the democratic process in the name of social justice.\n\"I think it sends an unfortunate message to students when you say that the people you elected, they're not representative of you even though you're the ones who chose them,\" he said.\nThe flap started with an email Van Haren sent to parents last Wednesday telling them the results had come in, but they did not reflect \"the diversity that exists at Everett.\" She invited all the candidates to meet with school leadership before deciding the next step.\n\"This is complex, but as a parent and a principal, I truly believe it behooves us to be thoughtful about our next steps here so that we can have a diverse student council that is truly representative of all voices at Everett,\" she wrote.\nMelissa Daar Carvajal, whose twin sons are 6th graders at Everett, said Van Haren may have been wrong to delay announcing the election results, but her goal of turning it into a lesson about making sure all people are represented was right. The student election reflects the fact that some people don't have adequate resources and support to run and win elections, she said.\n\"I think it's gotten people talking,\" she said. \"I'd like to see them act. I'd like to see them go into the school and support the kind of democracy we all want.\"\nCopyright 2015 The Associated Press. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-21T03:00:00.000+03:00", "crawled": "2015-10-21T16:24:29.259+03:00", "highlightTitle": ""}