{"organizations": [], "uuid": "27811a7e8d40ae49694c9909f8d5f83a456f054e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sheboyganpress.com", "main_image": "http://www.gannett-cdn.com/-mm-/92699f81f0ebd8e4487428de1cd5925d752c1138/c=0-77-2497-1488&amp;r=x633&amp;c=1200x630/local/-/media/2015/09/25/WIGroup/GreenBay/635787873956621036-GPGBrd-09-26-2013-Gazette-1-A004--2013-09-25-IMG--GPG-FrigoPresser-1.-1-1-T7588BK2-L292820957-IMG--GPG-FrigoPresser-1.-1-1-T7588BK2.jpg", "site_section": "http://rssfeeds.sheboyganpress.com/sheboygan/sports", "section_title": "Sheboygan - Sports", "url": "http://www.sheboyganpress.com/story/news/2015/09/30/new-charges-milwaukee-man-prison-fight/73081946/", "country": "US", "title": "Walker gets back to state business", "performance_score": 0, "site": "sheboyganpress.com", "participants_count": 0, "title_full": "Walker gets back to state business", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T17:56:00.000+03:00", "replies_count": 0, "uuid": "27811a7e8d40ae49694c9909f8d5f83a456f054e"}, "author": "", "url": "http://www.sheboyganpress.com/story/news/2015/09/30/new-charges-milwaukee-man-prison-fight/73081946/", "ord_in_thread": 0, "title": "Walker gets back to state business", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Madeleine Behr", "Walker"], "text": "Walker gets back to state business Madeleine Behr , Post-Crescent Media 9:56 a.m. CDT September 30, 2015 Buy Photo 24 CONNECT 2 TWEET LINKEDIN 24 COMMENT EMAIL MORE \nAfter an unsuccessful bid for president, Gov. Scott Walker returned to the Dairy State on Sept. 21 to get back to state business. \nHere's where he's been and what he's done in Wisconsin since his announcement to end his campaign last week: \nSept. 22 \nWalker started off the day with staff meetings. On the campaign trail, when he was out-of-state campaigning, Walker met weekly with fellow Republican lawmakers and held daily phone calls with his staff, a Gannett Wisconsin Media review of Walker's official calendars showed. Great to meet with staff this morning in my Capitol office! pic.twitter.com/FVDbEX9mG4 — Governor Walker (@GovWalker) September 22, 2015 \nWalker also issued an executive order on Sept. 22 ordering flags to half-mast in memory of Wisconsin Supreme Court Justice N. Patrick Crooks, who died Sept. 21. \nSept. 23 \nWalker met with state legislators \"to discuss their legislative agendas,\" said Laurel Patrick, Walker's spokeswoman. She did not specify which legislators were involved or the topics that were discussed. Had a full day of meetings with individual lawmakers in the State Capitol. — Governor Walker (@GovWalker) September 23, 2015 \nSept. 24 \nFox Valley area lawmakers Rep. Jim Steineke, R-Kaukauna, and Sen. Roger Roth, R-Appleton, released a new bill to reform civil service, which Walker announced he would support: \n\"Wisconsin needs to be able to compete for the best and brightest employees in today's modern workforce,\" Walker said in a statement . \"This legislation will implement common-sense reforms to our recruiting process to get the best in the door and will give state agencies the tools to retain their great employees, as well as address the bad actors who abuse the system.\" \nWalker tweeted in support of the bill throughout last Thursday and Friday: In the past, state worker fled to Canada & later under criminal investigation. State couldn't fire him right away bc of rules. #NeedReform — Governor Walker (@GovWalker) September 24, 2015 Weird hiring rules allowed fry cook w/o training, course work or finance experience to score highest on Financial Examiner exam. #NeedReform — Governor Walker (@GovWalker) September 24, 2015 Merit hiring stays; just cause for firing defined; gone r silly rules standing in way of recruiting & retaining best & brightest #NeedReform — Governor Walker (@GovWalker) September 24, 2015 Reforms will make it easier to recruit & keep great employees which means better workforce & better services for taxpayers! — Governor Walker (@GovWalker) September 25, 2015 \nSept. 25 \nWalker toured a Beaver Dam manufacturing company that was celebrating its 40th anniversary. It was his first public appearance since dropping out of the race on Sept. 21. \nHe told reporters at the event that he was not interested in a Cabinet position or running for Senate in 2018 against incumbent Sen. Tammy Baldwin, and that he planned to continue his second term as governor. In Beaver Dam for the 40th anniversary of Apache Stainless Equipment Corp. Great tour of the plant. pic.twitter.com/mcxpp4BTot — Governor Walker (@GovWalker) September 25, 2015 \nSept. 26 \nWalker traveled to Allouez for the funeral of Wisconsin Supreme Court Justice N. Patrick Crooks. He also attended the Wisconsin Badgers football game Saturday night in Madison, where one of his two sons attends college. Congrats. It was fun to be at the game tonight! https://t.co/wFItWJiNjO — Governor Walker (@GovWalker) September 27, 2015 \nSept. 28 \nWalker presented two posthumous awards for state trooper Trevor Casper, who was killed in a shootout March 24 near Fond du Lac. \n\"He was doing what was required to protect the public even if it meant ultimately risking his life,\" Walker said at the event . \"There is no greater service one can offer for their fellow mankind than to just that.\" \nThe Badger game wasn't the only football game Walker attended last weekend — he made it to the Monday night Green Bay Packers game against the Kansas City Chiefs at Lambeau Field. The Packers won, 38-28. — Governor Walker (@GovWalker) September 28, 2015 \nTuesday, Sept.r 29 \nWalker read Chicka Chicka Boom Boom to children at La Casa de Esperanza, a charter school in Waukesha. He also promoted his education reforms. \n\"Every child should have access to a quality education regardless of their zip code, which is why we have worked to expand education options for parents and students,\" he said in a statement. La Casa de Esperanza's new charter school in Waukesha. pic.twitter.com/U1kW65lCoP — Governor Walker (@GovWalker) September 29, 2015 \nThe school was recently opened as an independent charter school by the University of Wisconsin-Milwaukee, and teaches four- and five-year-olds in kindergarten. \n— Madeleine Behr: 920-993-1000 ext. 7226, or madeleine.behr@gannettwisconsin.com; on Twitter @madeleinebehr 24 CONNECT 2 TWEET LINKEDIN 24 COMMENT EMAIL MORE Read or Share this story: http://post.cr/1FEhtpP TOP VIDEOS", "external_links": [], "published": "2015-09-30T17:56:00.000+03:00", "crawled": "2015-10-01T08:07:38.229+03:00", "highlightTitle": ""}