{"organizations": [], "uuid": "e3b89e1dfbf4646338c3996839cdc0bf8ba669ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.gainesvilleregister.com", "main_image": "http://bloximages.chicago2.vip.townnews.com/gainesvilleregister.com/content/tncms/assets/v3/editorial/d/c2/dc25cde4-67c5-11e5-8466-97b472712766/560c67b47b274.image.jpg?resize=756%2C760", "site_section": "http://www.gainesvilleregister.com//search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&nsa=eedition&c[]=sports,sports/*&f=rss", "section_title": "Daily Register.com - sports,sports/", "url": "http://www.gainesvilleregister.com/news/wildcat-football-not-resting-on---start-to-season/article_c5b426be-67c5-11e5-8e2f-53bf4121a2f4.html", "country": "US", "title": "Wildcat football not resting on 5-0 start to season", "performance_score": 0, "site": "gainesvilleregister.com", "participants_count": 1, "title_full": "Wildcat football not resting on 5-0 start to season", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T01:51:00.000+03:00", "replies_count": 0, "uuid": "e3b89e1dfbf4646338c3996839cdc0bf8ba669ad"}, "author": "EVAN GRICE Sports Editor", "url": "http://www.gainesvilleregister.com/news/wildcat-football-not-resting-on---start-to-season/article_c5b426be-67c5-11e5-8e2f-53bf4121a2f4.html", "ord_in_thread": 0, "title": "Wildcat football not resting on 5-0 start to season", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Staff photo by Evan Grice Keeping pace \nCallisburg’s Eli Parker, right, and Garrett Rigsby work on coverage during a drill Tuesday afternoon at Wildcat football practice. CHS is off this week and will return to action Oct. 9 on the road against Pilot Point. Posted: Wednesday, September 30, 2015 5:51 pm \nCALLISBURG - There’s an old saying when it comes to any sport, especially the game of football. \n“It’s not how you start, but how you finish.” \nFor the Callisburg Wildcats, while they might have completed a 5-0 non-district portion of the schedule, the real work is set to begin in two weeks. \nWhile the Wildcats might have a bye week this week, head coach Ritchie Pinckard is making sure his players are treating this week just like any other of the regular season. \n“I like how resilient we have been so far this season,” Pinckard said. “We’ve got to get better at understanding what’s coming. There’s six outstanding football teams in our district, and there’s going to be a winner and a loser every Friday night.” \n“I’m happy where we are, but we need to fix those busts we’ve been having up front, but we also need to throw the ball better as well. I’m hoping we can work on those things this week.” \nWhat’s coming is a journey through what some have called the “District of Death” in district 5-3A. \nCHS will return to action with a showdown against 5-0 Pilot Point on the road on Oct. 9, before returning to Wildcat Stadium for another important showdown against the No. 8 Pottsboro Cardinals (Oct. 16), who were forced to forfeit the first three games of the season due to fielding an ineligible player. \n“Pilot Point is a physical team, and is extremely versatile on both sides of the ball. We’re trying to get to that point where people look at us and think we’re a good football team. We’ll find out where we are when that game starts.” \nRoad games against Farmersville and Whitesboro will then follow, before the Wildcats will finish against Van Alstyne at home. \nIncluding Callisburg, four out of the six teams in the district currently sport a record of 4-1 or better through five games of the season. \nA big part of the Wildcats success this season has come down to the play of several players, including a stacked rushing attack along with two successful quarterbacks. \nJunior running back Chase Caldwell has been at the front of the talk when it comes to the Wildcats offense, as he has totaled 579 yards on the ground this season on 73 carries with 10 touchdowns. \nLast week against Anna, Caldwell ran 26 times for 169 yards and two touchdowns, leading him to be named as the Texoma High School Player of the Week by the Herald Democrat earlier this week. \nCHS also boasts multiple other backs who have racked up yardage this season, inlcuding Blake Berryman with 379 yards and three touchdowns, Casey McCleaster with 195 yards and four touchdowns, quarterback Parker Huddleston with 128 yards and four touchdowns, and Tanner Thurman with 110 yards. \nThere’s also the small matter of senior quarterback Morgan Rigsby, who has totaled 295 yards passing for three touchdowns on 19-of-28 passing, despite suffering a third ACL injury earlier this season. \nHuddleston has also put up solid numbers at the QB position, going for 174 yards through the air on 14-of-26 passing. \n“This is the most unselfish football team I’ve ever had the pleasure of being apart of,” Pinckard said. “Chase and Blake are always pushing each other to be better on the field and are great friends as well. Parker and Morgan have had to split time this season a lot, but have worked so well together. Sometimes they will even do rock, paper, scissors to see who will start. These guys know it’s about the team and not about themselves, and I’m just very proud to be apart of this group and be able to coach these kids.”  ", "external_links": [], "published": "2015-10-01T01:51:00.000+03:00", "crawled": "2015-10-05T07:42:00.555+03:00", "highlightTitle": ""}