{"organizations": [], "uuid": "3780c42c9c3af9ffa0aff7cac70a5dce30404fc7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "chicago.suntimes.com", "main_image": "http://bullseye-prod.aggrego.org//wp-ag/wp-content/uploads/sites/71/2015/10/Screen-Shot-2015-10-14-at-7.45.11-AM.png?o=eyJ3aWR0aCI6MCwiaGVpZ2h0IjowLCJ4IjowLjUsInkiOjAuNX0%3D&amp;s=jWEyK1tnqB0bjrybpwpMPsHGWS4%3D", "site_section": "http://chicago.suntimes.com/", "section_title": "Chicago Sun-Times | Chicago : News : Politics : Things To Do : Sports", "url": "http://chicago.suntimes.com/business/7/71/1023918/bunky-cushing-squire-ladies-lunch-dies", "country": "US", "title": "Bunky Cushing, Chicago's squire to the ladies who lunch, dead at 65", "performance_score": 0, "site": "suntimes.com", "participants_count": 1, "title_full": "Bunky Cushing, Chicago's squire to the ladies who lunch, dead at 65 | Chicago Sun-Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T10:40:00.000+03:00", "replies_count": 0, "uuid": "3780c42c9c3af9ffa0aff7cac70a5dce30404fc7"}, "author": "| emailAddress.indexOf('@') == -1) {errorString = 'Please enter your email address';} var isError = false; if (errorString.length > 0) isError = true; if (isError) alert(errorString); return !isError;}", "url": "http://chicago.suntimes.com/business/7/71/1023918/bunky-cushing-squire-ladies-lunch-dies", "ord_in_thread": 0, "title": "Bunky Cushing, Chicago's squire to the ladies who lunch, dead at 65", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bunky Cushing received a fitting sartorial tribute Wednesday at Northwestern Memorial Hospital, where, the day after his death, the well-known escort to society women had been decked out in debonair preppy style, with his trademark bow tie.\nA sassy, joyful companion, Mr. Cushing was a confidant, wardrobe consultant, cheerleader and escort to the ladies who lunch, in the mode of Truman Capote in New York City but without the vitriol.\nHe hosted fabulous parties and attended to the rich and well-dressed as a salesperson at Polo Ralph Lauren, the world’s largest Polo store, on North Michigan Avenue.\n“Everything was a party with Bunky,” said publicist Dori Wilson.\nMr. Cushing, who knew only one person in Chicago when he arrived in 1990 but soon became the city’s “social tugboat,” died Tuesday after undergoing heart bypass surgery. He was 65.\nHe fell ill Oct. 2 at Ralph Lauren and went to Northwestern Memorial, where he was told he’d had a heart attack — and, possibly, some prior heart attacks, Wilson said. As he prepared for Monday’s triple-bypass surgery, he invited close friends to come visit the hospital.\n“It’s going to be a party,” he told them.\nBut complications arose, Wilson said, and he died Tuesday.\nOne of his best-known events was his annual Valentine’s Tea at the Ritz-Carlton, where all the women dressed in red, and some of them, despite their age, appeared remarkably unlined. He was said to save his money all year long to host the bash at the Peninsula Hotel that he called “Bunky’s Valentine’s Day Ball.”\nAnother event he hosted — his “Handbags and Halos” luncheon — raised more than $250,000 for the Howard Brown Health Center on Chicago’s North Side.\nMr. Cushing squired actresses Tippi Hedren and Dina Merrill, society figures Charlotte and Anne Ford and the swan-like model Carmen Dell’Orefice. He was so well-known that the menu at RL Restaurant features “Bunky’s Cookies.”\n“He was famous for his bow tie and his very colorful pants, all kinds of little animals on them,” said Mamie Walton, a philanthropist and widow of carpet czar Julius Walton. “He believed he was the only one who knew how to tie a bow tie.”\nBunky Cushing, wearing the kind of pants he was known for, at the Service Club of Chicago’s annual fashion show at the Peninsula Hotel in 2006. Rich Hein/Sun-Times file photo\nIn 2012, he was featured in a W Magazine story about “walkers” — the men who escort socialites.\n“Bunky Cushing is a bald and bow-tied Michigan native, a distant and, he says, poor relation of Babe Paley’s who spends his days working as a sales associate for a luxury retailer and his nights presiding over the frozen-haired, diamond-trimmed Chicago set known as Bunky’s Bunch,” W said. “Cushing embodies the best attributes of the old-school walkers — good humor, great pocket squares — and to them adds a large social conscience.”\n“Bunky’s Bunch” dipped into their checkbooks and worked social connections to raise money for charity.\n“ ‘I’ve done my years as a walker,” W Quote: d Mr. Cushing as saying. ” ‘And you can only sit so long listening to how someone’s facelift made her look like ­Quasimodo.’\n“His fancy friends’ husbands tend to bring to his mind the old image of Ricky Ricardo chuckling at Lucy’s Wednesday Afternoon Fine Arts League meetings. ‘These husbands are relieved to have some guy take over an aspect of their wives’ lives that they have no interest in. . . .They’ll come into the store and say, ‘My wife thinks the world of you, so I just had to come in, meet you, and say thanks.’ ”\nHe was born Payson McDonnell Cushing into a family with a preppy streak, he said on the blog he recently unveiled at http://www.bunkycushing.com/ .\n“Mother found pet names much more endearing than a mortuary name,” he wrote, “which makes me assume my sisters and I were conceived above a pet shop, as our given nicknames evoke clusters of chestnut-haired bunnies watching the race between the Tortoise and the Hare: Kitzie, Cricket, Bunky, Peanut and Sister.”\n“Being a Cushing, he was always very, very aware of society ladies, but he was very congenial,” said Walton, referring to the family that included Babe Cushing Paley, wife of CBS founder William S. Paley. “He could mix with many, many people.”\nMr. Cushing’s parties were effervescent, not necessarily because of the food or the opulent settings but because of his ability to mix lively, interesting people, according to orchestra leader Stanley Paul, who said, “He was such a kick.”\nDuring Chicago winters, Mr. Cushing enjoyed visiting well-to-do acquaintances in warmer climes. Walton, who lives in Chicago’s Ritz-Carlton hotel, hosted him at her winter home in Palm Desert, California.\nHe was direct but never unkind, Walton said. If a woman modeled a prospective wardrobe purchase that really didn’t suit her, she said, “He’d say, ‘That belongs to someone else.’ ”\nWilson said friends are talking about carrying on his Valentine’s Tea in his honor.\nBunky Cushing", "external_links": ["https://s3.amazonaws.com/wp-ag/wp-content/uploads/sites/71/2015/10/8-7-06_Hein_Soc_8-355x600.jpg", "https://s3.amazonaws.com/wp-ag/wp-content/uploads/sites/71/2015/10/8-7-06_Hein_Soc_8.jpg", "https://s3.amazonaws.com/wp-ag/wp-content/uploads/sites/71/2015/10/Screen-Shot-2015-10-14-at-7.36.11-AM.png", "http://www.bunkycushing.com/"], "published": "2015-10-14T10:40:00.000+03:00", "crawled": "2015-10-15T00:16:33.837+03:00", "highlightTitle": ""}