{"organizations": ["Brittle Barcelona", "Leverkusen", "Roma Brittle Barcelona"], "uuid": "390a1ac5f42c8f8a6869f099bf54bc8cdd0aa04e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribtown.com", "main_image": "http://d1bdhkmqqz901h.cloudfront.net/1200x630/smart/s3.amazonaws.com/hne-smedia/9/8/98eee8f6c5e2432cbdc251148bb47954/web_full_692711572364.jpg", "site_section": "http://www.tribtown.com//feed/sec/6000", "section_title": "TribTown.com - Sports News", "url": "http://www.tribtown.com/view/story/98eee8f6c5e2432cbdc251148bb47954/SOC--Champions-League-Group-E", "country": "US", "title": "Brittle Barcelona visits BATE in Belarus in the Champions League, Leverkusen hosts Roma", "performance_score": 0, "site": "tribtown.com", "participants_count": 0, "title_full": "Brittle Barcelona visits BATE in Belarus in the Champions League, Leverkusen hosts Roma", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T14:24:00.000+03:00", "replies_count": 0, "uuid": "390a1ac5f42c8f8a6869f099bf54bc8cdd0aa04e"}, "author": "", "url": "http://www.tribtown.com/view/story/98eee8f6c5e2432cbdc251148bb47954/SOC--Champions-League-Group-E", "ord_in_thread": 0, "title": "Brittle Barcelona visits BATE in Belarus in the Champions League, Leverkusen hosts Roma", "locations": ["Belarus"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["BATE", "JOSEPH WILSON"], "text": "Brittle Barcelona visits BATE in Belarus in the Champions League, Leverkusen hosts Roma By JOSEPH WILSON Associated Press   7:24   7:24   \nPeople: \nEastern Europe (362) \nBARCELONA, Spain — On paper, Barcelona's star-studded side should ease to another win when it crosses the continent to play at BATE Borisov in the Champions League on Tuesday. \nBut if the Belarus minnow ever wanted a chance to avenge a pair of lopsided losses from the last time the two teams met, now is the moment. \nNot only will Barcelona be without injured stars Lionel Messi and Andres Iniesta, but its defense has quickly lost its championship-caliber discipline from last season and is leaking goals at an astonishing rate. \nIn Group E's other match, Roma visits Bayer Leverkusen looking for a much-needed win to escape last place where it sits with one point after two matches. \nBarcelona leads the group with four points, followed by Leverkusen and BATE each with three. \nHere are some more things to know about Tuesday's Group E matches: \nGAPING HOLES \nGoalkeeper Marc-Andre ter Stegen helped Barcelona win both the Champions League and Copa del Rey last season, while Chile shotstopper Claudio Bravo helped win the Spanish league title to complete the rare treble of titles. \nBut just a few months later Ter Stegen has lost his mastery of Barcelona's area and has let 17 goals past him in eight matches, one more goal than the total he conceded in 21 matches last campaign. \nBarcelona's defensive line has proven porous to effective attacks, thereby encouraging rivals to go looking for goals instead of sitting back. Opponents have scored four goals in a single game three times this season, with Barcelona losing two of those matches. \nThat means that BATE could dream of an upset if it can muster another early scoring blitz from its surprising 3-2 win over Roma in their last group match when Filip Mladenovic scored twice to help build an insurmountable three-goal lead. \nGOAD THE BEAST \nBarcelona beat BATE 4-0 and 5-0 the last time they were drawn together in the group stage four seasons ago. \nInstead of focusing on past humiliations, BATE's ex-coach Viktor Goncharenko, a club legend who won eight titles there, has goaded Barcelona, telling Belarusian media the Catalan giant \"is really not what it should be\" with Messi and Iniesta unavailable. \nGoncharenko urged the team to channel the spirit of 2012, when BATE won 3-1 at home against Bayern Munich , that season's Champions League winner. \"To put up decent resistance\" against Barcelona, \"you have to start by going into this game in the same peak of form that we had against Bayern.\" \nLITTLE GUYS GET CHANCE \nNeymar and Luis Suarez have taken to leading Barcelona with Messi and Iniesta out. \nNeymar scored four goals and set up Suarez for another to fuel Barcelona's 5-2 win over Rayo Vallecano on Saturday. \nBut the two strikers are not the only ones taking advantage of Messi's hiatus to increase their role on the team. \nLittle-used forwards Sandro Ramirez and Munir El Haddadi are getting their opportunity to convince coach Luis Enrique they are first-team material. \nSergi Roberto already made strides playing out of position for injured right back Dani Alves. He now is back in the midfield playing for Iniesta. Roberto scored his first Champions League goal against BATE, and he recently got his second goal in the competition to help rally past Leverkusen 2-1 in the last group match. \nWORRIED ABOUT CAPTAIN \nLeverkusen can consolidate its hold on second place with a win at home over Roma. \nThe German side can also take heart from its strong performance at Camp Nou last time out, when it led Barcelona until conceding two goals in the final 10 minutes. \nLeverkusen, however, is worried about the fitness of its captain, Lars Bender, who is nursing an ankle injury. He could only jog lightly in Sunday's training and is getting treatment nearly round the clock. \nAll content copyright ©2015 The Tribune, a division of Home News Enterprises unless otherwise noted.", "external_links": [], "published": "2015-10-19T14:24:00.000+03:00", "crawled": "2015-10-19T16:35:04.561+03:00", "highlightTitle": ""}