{"organizations": [], "uuid": "e4a4b95086b37fae0ecd649cf48fff80e83d41f2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "http://s1.reutersmedia.net/resources/r/?m=02&d=20151006&t=2&i=1084839302&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB95052", "site_section": "http://www.reuters.com/news/sports", "section_title": "Sports News, Highlights &amp; Coverage | Reuters.com", "url": "http://www.reuters.com/article/2015/10/06/us-nfl-lions-idUSKCN0S00B920151006", "country": "US", "title": "Controversial non-call denies Lions chance of first win", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Controversial non-call denies Lions chance of first win | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T09:11:00.000+03:00", "replies_count": 0, "uuid": "e4a4b95086b37fae0ecd649cf48fff80e83d41f2"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/10/06/us-nfl-lions-idUSKCN0S00B920151006", "ord_in_thread": 0, "title": "Controversial non-call denies Lions chance of first win", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A controversial non-call may have cost the Detroit Lions their first win of the season following a wild finish to their 13-10 loss to the Seattle Seahawks on Monday.\nWith the Lions trailing by three in the final two minutes, Detroit wide receiver Calvin Johnson fumbled the ball one yard from a touchdown and Seattle linebacker K.J. Wright appeared to intentionally bat the ball out of the back of the end zone for a touchback.\nBy rule, it is illegal for a player to intentionally bat the ball while in the end zone.\nBut the Seahawks were not penalized, and instead were awarded the possession and the chance to run the clock out on their victory.\n\"It is a questionable play because it was a batted ball, but that goes upstairs (for review) so there's nothing you can do about it,\" Lions coach Jim Caldwell told reporters.\n\"What can you do? You're not going to cry about it, that's for sure.\"\nIn the aftermath of questions and head-scratching, NFL vice president of officiating Dean Blandino issued a statement, saying: \"Judgment call on the field. Back judge felt it wasn't overt. That's why he didn't call it on the field.\"\nBut most watching the play felt it was overt, including Seahawks coach Pete Carroll who admitted as much.\n\"He was trying to knock it out,\" Carroll said. \"It's a very rare situation. It's unfortunate the official didn't know how to (call it) for their sake. You're going to hear about that one.\"\nIt was particularly devastating for the Lions who fell to 0-4.\nDetroit were also on the wrong end of a controversial play in the playoffs last season when a late pass interference call was reversed and led to them losing to the Dallas Cowboys.\n\"I've been a part of a couple (questionable calls) at the end of ball games,\" said Detroit quarterback Matthew Stafford.\n\"Doesn't make me feel much better. Doesn't put a win in the win column for us.\"\n(Writing by Jahmal Corner in Los Angeles, editing by Sudipto Ganguly)", "external_links": [], "published": "2015-10-06T09:11:00.000+03:00", "crawled": "2015-10-06T08:40:54.359+03:00", "highlightTitle": ""}