{"organizations": [], "uuid": "8a69c5ba4a7762f96b1a535a04fb1971f0902079", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.penfieldpost.com", "main_image": "http://www.penfieldpost.com/storyimage/NU/20151007/SPORTS/151009710/AR/0/AR-151009710.jpg", "site_section": "http://www.penfieldpost.com/sports?template=rss&mime=xml", "section_title": "Sports - Penfield Post", "url": "http://www.penfieldpost.com/article/20151007/SPORTS/151009710/2000/NEWS?rssfeed=true", "country": "US", "title": "On The Run: Don't ignore your limits, push them", "performance_score": 0, "site": "penfieldpost.com", "participants_count": 1, "title_full": "On The Run: Don't ignore your limits, push them", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T23:33:00.000+03:00", "replies_count": 0, "uuid": "8a69c5ba4a7762f96b1a535a04fb1971f0902079"}, "author": "Christine DeHond", "url": "http://www.penfieldpost.com/article/20151007/SPORTS/151009710/2000/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "On The Run: Don't ignore your limits, push them", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Oct. 7, 2015 at 3:33 PM Updated at 3:33 PM Posted Oct. 7, 2015 at 3:33 PM Canandaigua, N.Y. In my few years of running, I’ve learned that I am capable of far more than I might have imagined. In 2012, when I watched people finishing the Flower City Challenge Half Marathon, I was sure that running 13.1 miles was something I would never, could never, do. Even when I learned to run and completed my first few 5ks, the half-marathon distance seemed beyond my reach. The voice of “I can’t” rang loudly in my head, shouting down the “yes you can!” It was only a little peer pressure and the desire to keep working out with my friends that led me to my first half-marathon training program and completing my first half in 2013. During the last two years, I’ve grown as a runner and become more confident in my abilities. I’ve completed seven half marathons, and while I am still a nervous wreck in the hours leading up to race day, I know I will finish, and I know I can handle the physical and mental demands that running that distance places on my body. I’ve learned to trust in my training, and that the feeling of accomplishment at the finish line far outweighs the hard moments during the race. I have learned to beat my insecurities and doubts one footfall at a time. I have never been a huge risk taker, but running has inspired me to have confidence in myself and what I can achieve. In 2015, I saw some close friends who I’ve run alongside push themselves by training for and completing difficult races. My running BFF Frank completed the Sehgahunda trail marathon this past May, and my friend Laura trained for months for her “never say never” road marathon, completing the Rochester Full Marathon this September. Though she just ran her first half last year, my friend and fellow coach Pina bravely signed up for the 2016 Pittsburgh Marathon on the day registration opened. Filled with admiration, I was still convinced this was something I would never attempt. 26.2 miles? Every time I finish a half-marathon, I imagine being only half-finished and cringe. People would ask me “when are you running a marathon?” and I would laugh. But at the same time I would ponder the idea. When might I do that? Could I even contemplate trying? I came to my love of running decades after most people take up the sport. Four years ago I could never have imagined running a half-marathon, let alone seven of them. Dare I attempt a full? What do I have to lose? (Besides toenails, weight and free time?) Emboldened, yet terrified, I broached the subject with the people I needed, trusted and valued the opinions of most. My boyfriend, John, promised to support me; my son was impressed and told me to “go for it,” that he knew I could do it. My friend, Glori, said she’d run any short recovery runs I needed with me. Pina and her group welcomed me, giving me reliable runners to train alongside. My parents are supportive (and confused about my choice of Pittsburgh. I don’t know anyone in Pittsburgh, do I?). I decided to run for charity, The American Heart Association, to make this race about more than just myself. I wrote this column, committing my thoughts and my intentions down in a permanent record. And then I got on the race website and pulled the trigger. God willing, May 1, 2016 I will be queueing up at the start line of the 2016 Pittsburgh Marathon. I have seven long months ahead to train, to prepare myself mentally and emotionally, to find my limits and push beyond them. Wish me luck! By Christine DeHond", "external_links": [], "published": "2015-10-07T23:33:00.000+03:00", "crawled": "2015-10-08T01:32:05.323+03:00", "highlightTitle": ""}