{"organizations": ["Ducks"], "uuid": "d0f018a687fcc225cca95ad4de3c6e0ea6d798a5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribtown.com", "main_image": "http://d1bdhkmqqz901h.cloudfront.net/1200x630/smart/s3.amazonaws.com/hne-smedia/c/3/c336477e7fd0440f885e131f73154779/web_full_625175279544.jpg", "site_section": "http://www.tribtown.com//feed/sec/6000", "section_title": "TribTown.com - Sports News", "url": "http://www.tribtown.com/view/story/c336477e7fd0440f885e131f73154779/HKN--Ducks-Predators", "country": "US", "title": "Colin, Ellis each have goal and 2 assists, Predators beat Ducks 5-1 to improve to 6-1", "performance_score": 0, "site": "tribtown.com", "participants_count": 0, "title_full": "Colin, Ellis each have goal and 2 assists, Predators beat Ducks 5-1 to improve to 6-1", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T07:15:00.000+03:00", "replies_count": 0, "uuid": "d0f018a687fcc225cca95ad4de3c6e0ea6d798a5"}, "author": "", "url": "http://www.tribtown.com/view/story/c336477e7fd0440f885e131f73154779/HKN--Ducks-Predators", "ord_in_thread": 0, "title": "Colin, Ellis each have goal and 2 assists, Predators beat Ducks 5-1 to improve to 6-1", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ellis", "JIM"], "text": "Colin, Ellis each have goal and 2 assists, Predators beat Ducks 5-1 to improve to 6-1 By JIM DIAMOND Associated Press   12:15   12:15   \nPeople: \nNASHVILLE, Tennessee — The Nashville Predators feasted on the struggling Anaheim Ducks . \nColin Wilson and Ryan Ellis each had a goal and two assists and the Predators beat the Ducks 5-1 on Thursday night to improve to 6-1-0. \n\"I thought we were good from start to finish tonight,\" Nashville coach Peter Laviolette said. \"It was a really good effort.\" \nMattias Ekholm and Mike Ribeiro each added a goal and an assist, Eric Nystrom also scored, and Pekka Rinne made 27 saves. \nJiri Sekac scored for Anaheim, and Anton Khudobin made 24 saves. The Ducks are 1-4-1 and have scored only six goals. \n\"We're trying to work hard and do all the right things,\" Anaheim forward Corey Perry said. \"Eventually it's going to break.\" \nNystrom opened the scoring at 3:40 of the second period. \nAustin Watson chipped the puck over a diving Cam Fowler just outside the Anaheim blue line and chased the puck on the right boards. Watson found Nystrom in front, where he had a tap-in for his second goal of the season. \n\"He made a great play just having the patience to out wait the defenseman and sent a rocket across,\" Nystrom said. \"I just made sure that I was hard on the puck. The goalie was sliding across and it just squeaked through his legs. Watty played so well tonight.\" \nThe assist was the first of Watson's career. \n\"When you are having trouble scoring and the other team gets that first goal, you've got to dig deeper,\" Ducks coach Bruce Boudreau said. \"We sort of felt a little sorry for ourselves for the next little bit, and the next thing you know it was 3-0.\" \nEllis made it 2-0 at 12:47 of the second. \nJust after a Nashville power play, Ribeiro slid a cross-ice pass to Ellis at the left faceoff dot, where his one-timer beat Khudobin on the short side through traffic. \n\"We moved the puck well and I got a bunch of looks,\" Ellis said. \"Finally the one I scored on was a great pass by (Ribeiro) and a great job in front of the net by the guys.\" \nEllis returned to Nashville's lineup after sitting out Tuesday night with a lower-body injury. \nRibeiro added a goal at 17:00 of the second on a shot from the lower part of the right circle after collecting the rebound of his initial attempt, which was blocked by Fowler. \nEkholm made it 4-0 when he scored his first goal of the season at 3:03 of the third on a slap shot from the left faceoff dot. \nSekac spoiled Rinne's shutout bid with a power-play goal at 12:15 of the third. The Ducks entered Thursday as the only team not to score a power-play goal this season. \nWilson finished the scoring with a power-play goal with 1:42 left. \nNotes: Nashville has not allowed a first-period goal this season. ... LW Andrew Cogliano played his 300th game with the Ducks. ... Anaheim won all three matchups against the Predators last season. \nAll content copyright ©2015 The Tribune, a division of Home News Enterprises unless otherwise noted.", "external_links": [], "published": "2015-10-23T07:15:00.000+03:00", "crawled": "2015-10-23T09:07:22.656+03:00", "highlightTitle": ""}