{"organizations": [], "uuid": "405b4ee0cf31e4ade38670acb5069e37ec6b99f2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.orlandosentinel.com", "main_image": "http://www.trbimg.com/img-561150d2/turbine/sfl-dolphins-jets-london-recap-20151004", "site_section": "http://www.orlandosentinel.com/sports/rss2.0.xml", "section_title": "Sports - Orlando Sentinel", "url": "http://www.orlandosentinel.com/sports/sfl-dolphins-jets-london-recap-20151004-story.html", "country": "US", "title": "Jets mash Dolphins in London, 27-14", "performance_score": 0, "site": "orlandosentinel.com", "participants_count": 1, "title_full": "Jets mash Dolphins in London, 27-14", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T01:15:00.000+03:00", "replies_count": 0, "uuid": "405b4ee0cf31e4ade38670acb5069e37ec6b99f2"}, "author": "Chris Perkins", "url": "http://www.orlandosentinel.com/sports/sfl-dolphins-jets-london-recap-20151004-story.html", "ord_in_thread": 0, "title": "Jets mash Dolphins in London, 27-14", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Dave Hyde) \n“There’s plenty of guys in our huddle with energy,” he said, “so I don’t think that’s an issue.” \nOffensive coordinator Bill Lazor didn’t escape unscathed, either. His struggling unit amassed just 226 yards and was 0-for-12 on third-down conversions. \nQuarterback Ryan Tannehill (19-for-44, 198 yards, two touchdowns, two interceptions) had a miserable 53.0 passer rating to go along with two interceptions in the end zone as the Dolphins tried to pull within a score in the final five minutes. \n“We’ve got to make the plays,” Tannehill said. “It’s kind of ridiculous that we keep talking about it, we keep saying it. In the lockerroom we’re talking about it, we’re talking it to each other on the field. It’s not for a lack of understanding of what we need to do. \n“We’re just not getting it done, and we have to get it done. It’s plain and simple.” \nEven the Dolphins’ special teams struggled as they battled penalty problems. \nAttendance at Wembley Stadium was announced at 83,986 for the Dolphins’ second game in London in as many years, and surely there were some there who wished they’d have found something else to do on what began as a beautifully sunny day with temperatures in the mid-60s. \nThe Jets pounded the Dolphins is almost every statistical category, and they won comfortably despite being flagged 14 times for 163 yards. \nAs they have all season, the Dolphins fell into an early hole. \nThe Jets scored a touchdown on their first offensive possession, had a 10-0 lead by the end of the first quarter and a 20-7 halftime lead as they worked the Dolphins on the ground and in the air. \nThe Dolphins have now been outscored 77-27 in the first halves of their games this season. \nTheir lone points of the first half Sunday came after the Jets were called for pass interference on two consecutive plays, moving the ball a combined 58 yards. From there, Tannehill hit tight end Jake Stoneburner with an 8-yard touchdown pass. \nTannehill added a 10-yard touchdown pass to Kenny Stills with 10:01 remaining in the game to pull the Dolphins within 13, but he was picked off the next two times Miami threatened. \nPhilbin is still trying to keep things together, even though it appears the season is quickly coming apart. \n“We still can’t panic,” he said. “It all seems like the walls are closing in you. We’ve got to look at things, we’ve got to be honest about what we’re doing well, what we’re not doing well, correct those things, emphasize them and ... there’s some things that need to be fixed, no question about it. And that’s what the next 14 days are going to be all about.”", "external_links": [], "published": "2015-10-05T01:15:00.000+03:00", "crawled": "2015-10-05T02:07:05.335+03:00", "highlightTitle": ""}