{"organizations": [], "uuid": "478c9e4ec7f2852429bdd436d788b61186a77466", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtontimes.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Sports-TheWashingtonTimesAmericasNewspaper", "section_title": "www.washingtontimes.com stories: Sports", "url": "http://www.washingtontimes.com/news/2015/oct/16/nebraska-minnesota-trying-to-recover-from-rough-st/", "country": "US", "title": "Nebraska, Minnesota trying to recover from rough starts", "performance_score": 0, "site": "washingtontimes.com", "participants_count": 1, "title_full": "Nebraska, Minnesota trying to recover from rough starts", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T02:30:00.000+03:00", "replies_count": 0, "uuid": "478c9e4ec7f2852429bdd436d788b61186a77466"}, "author": "DAVE CAMPBELL", "url": "http://www.washingtontimes.com/news/2015/oct/16/nebraska-minnesota-trying-to-recover-from-rough-st/", "ord_in_thread": 0, "title": "Nebraska, Minnesota trying to recover from rough starts", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Nebraska, Minnesota trying to recover from rough starts By DAVE CAMPBELL - Associated Press   \nMINNEAPOLIS (AP) - The Big Ten’s West Division is the most winnable of the two these days. The current class of the conference, Ohio State, Michigan State and Michigan, is in the other group. \nNebraska and Minnesota were two of the early favorites, but they’ve already fallen behind. Their matchup on Saturday will be critical for remaining in the race, with undefeated Iowa off to the strongest start. \n“You try not to focus on that stuff too much, but yeah, you do want to know. Is there still a way? Is it still possible to make it to the conference championship?” Nebraska defensive end Jack Gangwish said. “Yeah, there is some of that stuff. You look and you wonder, but at the end of the day you have to take comfort in the fact that all you can do is win the next one.” \nMinnesota (4-2, 1-1) did just that last week, rebounding from a humbling shutout loss at Northwestern by blowing out Purdue. Nebraska (2-4, 0-2) had the chance at home against Wisconsin but was beaten for a fourth time this season on the other team’s final offensive play. \nAnother loss, and the Huskers will be off to the program’s worst start in 57 years. \nHere are some key angles to know about the game on Saturday: \nPASSING LANE \nThe Gophers have three nonconference victories, by three points apiece against non-power conference opponents. The offense has been largely stagnant, ranked last in the league with an average of 19.7 points per game. They’re 12th of 14 with an average of 348.5 yards per game. \nThey returned to their roots against Purdue, with a dominant performance by freshman running back Shannon Brooks and the linemen and receivers blocking for him. But quarterback Mitch Leidner will be counted on for more production against a Huskers team that’s worst among all 127 FBS teams against the pass. \nThat’s right: The Huskers have given up an average of 348.5 yards per game through the air. \n“If we need to throw it, we’ll throw it. I ain’t real fired up. We throw it 50 times, then I might have a heart attack,” coach Jerry Kill said. “So I’m not going to throw it 50 times. Maybe 49, but not 50.” \nAdded offensive coordinator Matt Limegrover: “If you want to run the football, you have to keep them off-balance a little bit. You can’t just dive it between the tackles and hope for the best.” \nUNUSUAL START \nNebraska has not opened 0-3 in conference play since the 1945 team coached by George “Potsy” Clark lost consecutive Big Six games against Oklahoma, Iowa State and Missouri. The Huskers, who haven’t started 2-5 overall since 1958 under coach Bill Jennings, have lost seven of their last 10 games to match the program’s worst 10-game stretch since the 1959-60 seasons. \nBANGED UP ON BOTH SIDES", "external_links": [], "published": "2015-10-17T02:30:00.000+03:00", "crawled": "2015-10-17T04:22:04.065+03:00", "highlightTitle": ""}