{"organizations": ["Giants"], "uuid": "bb4776af5afa6e626fceb39a78838da1e5425b3d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.northjersey.com", "main_image": "http://www.northjersey.com/designimages/NorthJerseyFacebook_377x196.jpg", "site_section": "http://www.northjersey.com/cmlink/sports-rss.rss", "section_title": "Sports News on NorthJersey.com", "url": "http://www.northjersey.com/sports/football/giants-notes-victor-cruz-still-not-cleared-1.1439492", "country": "US", "title": "Giants notes: Victor Cruz still not cleared", "performance_score": 0, "site": "northjersey.com", "participants_count": 0, "title_full": "Giants notes: Victor Cruz still not cleared", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T08:21:00.000+03:00", "replies_count": 0, "uuid": "bb4776af5afa6e626fceb39a78838da1e5425b3d"}, "author": "", "url": "http://www.northjersey.com/sports/football/giants-notes-victor-cruz-still-not-cleared-1.1439492", "ord_in_thread": 0, "title": "Giants notes: Victor Cruz still not cleared", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Victor Cruz"], "text": "Giants notes: Victor Cruz still not cleared October 23, 2015 Last updated: Friday, October 23, 2015, 1:21 AM The Record Print \nNot Cruz-ing yet \nVictor Cruz worked with trainers during Thursday’s practice, but still was not cleared to be a full participant. Coach Tom Coughlin said the player’s weekly MRI showed Cruz \"still has a little bit of an injury\" in the calf, which he strained during training camp. There was some hope that the receiver could be cleared to practice this week, but that’s now unlikely to happen. \nRunning with it \nRashad Jennings ran for 63 yards on 13 carries Monday against the Eagles, while Andre Williams picked up only six yards on five attempts. \nThrough the Giants’ first six games, Jennings is averaging 3.7 yards per carry while Williams is averaging 2.8. \nCoughlin said the disparity isn’t anything Williams is doing wrong. \n\"He doesn’t have a lot of carries,\" Coughlin said. \"He hits the holes, he does whatever we ask him to do there. … I don’t think it really has anything to do with what he’s not been able to do.\" \nShane Vereen has run for 101 yards on 29 carries, and has 214 receiving yards on 21 catches out of the backfield. Vereen is typically on the field when the Giants go into a three-receiver set. \nWhile the Giants have used a running back rotation, Coughlin said snaps tend to work themselves out on a game-by-game basis. \n\"I do think that Williams probably needs more carries under the present system,\" Coughlin said. \"It’s something that we have to deal with.\" \nBriefs \nLinebackers Jon Beason (knee) and Uani Unga (neck) did not practice. … Defensive end Robert Ayers (hamstring), linebackers Jonathan Casillas (neck), Devon Kennard (hamstring), receiver Rueben Randle (hamstring), and cornerbacks Trumaine McBride (groin) and Trevin Wade (concussion) were limited participants ... Coughlin had no update on Jason Pierre-Paul, who was expected to meet with the team this week. \n— Chris Iseman © 2015 North Jersey Media Group Tags:", "external_links": [], "published": "2015-10-23T08:21:00.000+03:00", "crawled": "2015-10-23T19:59:19.757+03:00", "highlightTitle": ""}