{"organizations": [], "uuid": "6a3990b3b97df048ee86b7fcb7dd8fcf6344bcb6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.saudigazette.com.sa", "main_image": "", "site_section": "http://www.saudigazette.com.sa/index.cfm?method=home.cat&categoryid=2015100965415", "section_title": "Sports | Saudi Gazette", "url": "http://www.saudigazette.com.sa/index.cfm?method=home.con&contentid=20151009259141", "country": "US", "title": "Rangers spoil champs Blackhawks’ celebration", "performance_score": 0, "site": "saudigazette.com.sa", "participants_count": 1, "title_full": "Rangers spoil champs Blackhawks’ celebration | Sports | Saudi Gazette", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "6a3990b3b97df048ee86b7fcb7dd8fcf6344bcb6"}, "author": "saudigazette.com.sa", "url": "http://www.saudigazette.com.sa/index.cfm?method=home.con&contentid=20151009259141", "ord_in_thread": 0, "title": "Rangers spoil champs Blackhawks’ celebration", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New York Rangers' center Oscar Lindberg (C) celebrates with teammates Kevin Klein (L) and Marc Staal after scoring a goal against the Chicago Blackhawks at United Center in Chicago Wednesday. — Reuters\nLOS ANGELES — Mike Babcock got his first taste of coaching in Toronto, and Chicago’s Stanley Cup celebration with their fans was spoiled as the NHL season got off to a blazing start Wednesday.\nThe Stanley Cup champion Chicago Blackhawks raised their third banner in six years in a glittering home ceremony before the drop of the puck against the New York Rangers in one of four games on opening night Wednesday.\nBut the festive atmosphere at the United Center arena in Chicago didn’t last long as the Rangers scored three first period goals, and then held on for a 3-2 win.\nArtemi Panarin and Teuvo Teravainen scored goals for Chicago which failed to rally from the deep hole it dug itself early in the contest.\nOscar Lindberg, Kevin Klein and Derek Stepan each scored for New York. J.T. Miller added two assists for the Rangers.\nRangers goaltender Henrik Lundqvist stopped 32 of 34 shots, while Chicago’s Corey Crawford turned aside 24 of 27 shots.\nLundqvist, of Sweden, said the Blackhawks festivities seemed to go on forever and the Rangers didn’t like having to sit in the visitor’s dressing room waiting for it to end.\n“It’s a great moment for them, obviously,” Lundqvist said with a smile. “But we were sitting in here, and they delayed it a little bit, and it made you a bit upset. So you wanted to go out there and pay it back.”\nAt the Air Canada Centre in Toronto, Alex Galchenyuk scored with about eight minutes left in the third period as Montreal defeated Toronto 3-1 to spoil Babcock’s debut with the Maple Leafs.\nBabcock, who guided Canada to Olympic gold medals in Vancouver and Sochi, took over as coach in the off-season after a decade as coach of the Detroit Red Wings.\n“They showed tonight that they’re going to be a tough team,” said Canadiens defenseman P.K. Subban, who had three assists, of the Leafs.\nMontreal goaltender Carey Price made 36 saves while Toronto goalie Jonathan Bernier made 27 saves.\nBabcock, who successfully overturned a Montreal goal by using the new challenge rule, said Price was the difference in the game.\n“I thought their goaltender was solid,” Babcock said. “They don’t even (notice) over there that he made huge saves. It’s just another day’s work for him.”\nIn Calgary, left winger Daniel Sedin scored once and set up two goals, leading the Vancouver Canucks to a 5-1 win over the Calgary Flames in a physical contest as the Saddledome arena. Right winger Brandon Sutter had a goal and an assist, while center Henrik Sedin also scored to give Vancouver’s top line six points. The Canucks were eliminated in six games by the Flames in the opening round of the 2015 NHL playoffs.\nElsewhere, Milan Lucic fizzled in his debut with Los Angeles as the Kings were hammered 5-1 by the San Jose Sharks.\nLucic logged 16:35 minutes of ice time but finished with no points and just one shot. He capped his night with a match penalty on his final shift for going after Sharks forward Logan Couture who had nailed him with an open ice hit just moments before.\n“I didn’t think there were players that you’re not allowed to hit in the league,” said Couture sarcastically.\nLucic was a high profile offseason addition to the Kings, but committed several bad turnovers Wednesday while playing on the top line with Marian Gaborik and Anze Kopitar.\nCenter Joe Pavelski scored a goal and recorded two assists to lead the Sharks in scoring. — AFP", "external_links": [], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-09T07:27:12.932+03:00", "highlightTitle": ""}