{"organizations": [], "uuid": "d8014ed483053e1a612bfd18db0648a84adddb5a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fox8live.com", "main_image": "http://WVUE.images.worldnow.com/images/9062205_G.jpg", "site_section": "http://www.fox8live.com/", "section_title": "New Orleans News, Weather, Saints - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "url": "http://www.fox8live.com/story/30311257/pair-arrested-for-assaulting-firing-gun-at-man", "country": "US", "title": "Pair arrested for assaulting, firing gun at man", "performance_score": 0, "site": "fox8live.com", "participants_count": 1, "title_full": "Pair arrested for assaulting, firing gun at man - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T05:21:00.000+03:00", "replies_count": 0, "uuid": "d8014ed483053e1a612bfd18db0648a84adddb5a"}, "author": "Written by: FOX8Live.com Staff", "url": "http://www.fox8live.com/story/30311257/pair-arrested-for-assaulting-firing-gun-at-man", "ord_in_thread": 0, "title": "Pair arrested for assaulting, firing gun at man", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW ORLEANS, LA (WVUE) - New Orleans police have arrested a man and woman after they assaulted and fired a gun at a man in New Orleans East. The incident occurred Tuesday around 10 a.m. in the 4700 block of Crowder Boulevard.\nAccording to police, the victim told authorities that he was walking home from a nearby gas station when he was approached by 24-year-old Ahkeem Peters and 21-year-old India Young. The victim said that he and Peters have been in an on-going argument stemming from a previous car accident. The victim and Peters were about to start a physical fight when Peters pulled out a gun and handed it to Young.\nThe argument intensified and once it turned physical, Young began to hit the victim with the gun. Young and Peters then fled the scene on foot while the victim chased. While running away, Peters grabbed the gun from Young and began firing at the victim. None of the bullets fired, struck the victim. The victim said that he saw the pair run into a home in the 4900 block of Dodt Avenue, before he called police.\nOfficers arrived on scene and found the weapon in the back yard. They also made contact with Young and Peters who were taken into custody. Peters was charged with aggravated battery, aggravated assault with a firearm and illegal use of a weapon. Young was charged with aggravated battery and aggravated assault.\nThe victim was brought to a local hospital to receive treatment for non-life threatening injuries.\nCopyright 2015 WVUE . ", "external_links": [], "published": "2015-10-21T05:21:00.000+03:00", "crawled": "2015-10-21T08:29:12.220+03:00", "highlightTitle": ""}