{"organizations": [], "uuid": "a69c038e293562139b666595bd7e7d1e0e464e56", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.northjersey.com", "main_image": "http://www.northjersey.com:80/polopoly_fs/1.1441257!/fileImage/httpImage/102315-st-btfb4-11644751.jpg", "site_section": "http://www.northjersey.com/cmlink/high-school-sports-rss.rss", "section_title": "High School Sports on NorthJersey.com", "url": "http://www.northjersey.com/sports/high-school-sports/football/hanover-park-races-past-bulldogs-in-second-half-1.1441256", "country": "US", "title": "Football: Hanover Park races past Butler", "performance_score": 0, "site": "northjersey.com", "participants_count": 0, "title_full": "Football: Hanover Park races past Butler", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T06:15:00.000+02:00", "replies_count": 0, "uuid": "a69c038e293562139b666595bd7e7d1e0e464e56"}, "author": "", "url": "http://www.northjersey.com/sports/high-school-sports/football/hanover-park-races-past-bulldogs-in-second-half-1.1441256", "ord_in_thread": 0, "title": "Football: Hanover Park races past Butler", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Joe Sarno"], "text": "Staff photo by Joe Sarno The Hanover Park offense was able to escape the Butler pressure on Friday night. \nBUTLER - On the very first play of scrimmage, Hanover Park senior Junaid Olanipekun ripped off a 70-yard run for a touchdown and an almost immediate 7-0 Hornets lead over the Butler Bulldogs in Butler on Friday night. \nEven though the Bulldogs (4-3) responded by tying the game up at 7-7 at the outset of the second quarter and went into the locker room at half only down by a touchdown (14-7), the Bulldogs offense couldn’t sustain any kind of consistency, while being outscored 29-6 in the third on their way to a 50-20 defeat. \n\"I thought we played a fairly decent first half but they have some explosive kids on the field and we were unable to contain them,\" Bulldogs head coach Jason Luciani. \nFollowing Olanipekun’s run to open the game, neither team was able to find the back of the end zone until the 11:57 mark of the second quarter, when the Bulldogs finished off a drive that started at their own 30-yard line. \nHaving driven all the way to the Hornets’ one-yard line, Bulldogs junior quarterback Dominic Gentile finished it off when he stuffed his way home on a quarterback sneak for the one-yard score, tying the game at 7-7. \nHowever, the Hornets would retake the lead before halftime when junior quarterback Donato Casolaro completed a pass to Olanipekun, who took care of the rest, making a Butler defender miss and dashing 24-yards for the score and a 14-7 Hornets lead. \nThe Bulldogs got the ball first coming out of the halftime break, but struggled to find consistency on offense the rest of the game. \n\"We’re getting the ball back in the second half and we strung a couple plays together but we weren’t able to really sustain anything for most of the game,\" Luciani said. \"It’s obviously disappointing.\" \nThis was especially true in the third quarter, a quarter in which the Hornets offense was the complete antithesis of their counterpart. \nFirst, it was Casolaro finding senior Tomasz Radomski, who dashed down the left sideline for a 55-yard score, putting their team up 21-7 following the extra point conversion. \nThen, Olanipekun found the endzone for the third time in the game when he bounced around the outside and ran down the right sideline for a 13-yard score, putting his team up 29-7 following a successful two-point conversion. \nThe Hornets final points of the quarter came on another big play, this time on a 54-yard touchdown pass from Casolaro to junior Eric Magnifico with 4:22 on the clock to increase their lead to 36-7. \nAt this point the Bulldogs got their first points of the third quarter on a 10-yard touchdown run by junior Davon Smith to decrease the deficit to 36-13 following the missed extra point, but the damage was already done. \nThe Hornets continued to stick to that game plan through the end of the third as well as the fourth, continually finding the hot hand of Olanipekun. \n\"He was shifty,\" Luciani said. \"We were staying blocked and their offensive line opened some nice holes. When that happens, it’s hard to tackle any running back quite frankly.\" \nThe Hornets added one more touchdown in the third as sophomore Rory DeLuca ran one in from 4-yards out to extend their lead to 43-13. \nBoth teams found the endzone one more time in the fourth, with Olanipekun running it in from 10-yards out with 6:54 on the clock. \nThen, it was the Bulldogs turn, as Gentile found the endzone for the second time of the game, this time through the air, connecting with senior Andrew Zemaitis for the 30-yard score. \nAfter the defeat, Luciani said he told his team it is all about focusing on their next opponent, who just so happens to be the Kinnelon Colts. \n\"It’s a big game and we know Kinnelon is not gonna lay down for us,\" he said. \"Their gonna come to fight and I expect it to be a really great game.\"  ", "external_links": [], "published": "2015-10-26T06:15:00.000+02:00", "crawled": "2015-10-26T09:47:16.349+02:00", "highlightTitle": ""}