{"organizations": ["Center Point-Urbana", "Video Photos Mount Vernon", "Mount Vernon", "CPU Mustangs", "Mustangs"], "uuid": "c0b654dd83ab0238f6d0d61987605a63b7d80450", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thegazette.com", "main_image": "http://www.thegazette.com/storyimage/GA/20151002/ARTICLE/151009898/AR/0/AR-151009898.jpg", "site_section": "http://feeds.feedburner.com/~r/GazetteOnlineSports/~6/1", "section_title": "Eastern Iowa Sports News and Information from Gazette Online", "url": "http://www.thegazette.com/subject/sports/second-half-surge-guides-no-8-mount-vernon-past-cp-u-20151002", "country": "US", "title": "Second half surge guides No. 8 Mount Vernon past CPU", "performance_score": 0, "site": "thegazette.com", "participants_count": 0, "title_full": "Second half surge guides No. 8 Mount Vernon past CPU", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T05:49:00.000+03:00", "replies_count": 0, "uuid": "c0b654dd83ab0238f6d0d61987605a63b7d80450"}, "author": "", "url": "http://www.thegazette.com/subject/sports/second-half-surge-guides-no-8-mount-vernon-past-cp-u-20151002", "ord_in_thread": 0, "title": "Second half surge guides No. 8 Mount Vernon past CPU", "locations": ["Iowa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Drew Adams", "Jeremiah"], "text": "Second half surge guides No. 8 Mount Vernon past CPU Second half surge guides No. 8 Mount Vernon past CPU Mustangs get comeback win by way of 93- and 79-yard drives in the second half Video Photos Mount Vernon quarterback Drew Adams (9) lines the Mustangs’ offense up in the fourth quarter against Center Point-Urbana on Friday, Oct. 2, 2015. (Jeremiah Davis/The Gazette) Iowa Football Data Center \nI've covered Iowa football at The Gazette since 1999 Saturday October 03, 2015 \nColumnist giving commentary and information about sports in Iowa. Friday October 02, 2015 \nYour source for Iowa sports and more. Thursday October 01, 2015 \nCovering Iowa State and central Iowa for Eastern Iowa Thursday October 01, 2015 \nISU RUSH OFFENSE VS. KANSAS RUSH DEFENSE \nIowa S \nKernels baseball, RoughRiders hockey and a lot of things in between. Friday October 02, 2015 \nI cover high school sports and Iowa women's basketball. Saturday October 03, 2015 \nYour source for all things auto racing in Eastern Iowa. Wednesday September 23, 2015 \nSharing community and high school contributed stories Friday October 02, 2015 Jeremiah Davis , The Gazette October 2, 2015 | 11:31 pm \nCENTER POINT — Midway through the third quarter, Class 2A Center Point-Urbana looked like it was in great shape to pull off an upset of No. 8 Mount Vernon. \nThe Stormin’ Pointers had 1st and 10 from the MV 16 and led, 12-6. But a 4th and 2 stop by the Mustangs’ defense at the seven yard line turned into a 93-yard scoring drive. \nIt was capped off by a Drew Adams one-yard plunge into the end zone ate a ton of clock and, in Mount Vernon’s minds, broke the will of CPU. The Mustangs (5-1) used a 79-yard touchdown drive the next series and a game-sealing interception in the end zone by Carter Rodman to put the comeback win to bed, 20-12. \n“(The 93-yard drive) was just a huge drive. That’s our offensive line and our backs saying, ‘OK, let’s get this done,’” said Mount Vernon Coach Lance Pedersen. “That’s something that’s great about the game of football, is it takes 11 guys to make it happen, and that’s what happened on that 93-yard drive. Those 11 guys believed in each other and believed in what we’re doing and drove right now the field and made it happen.” \nMount Vernon was shut down both through the air and on the ground in the first half. CPU held the Mustangs to 129 total yards — 88 through the air and just 41 on the ground. \nA Mount Vernon offense that had run and passed all over Northeast Goose Lake, Camanche and Monticello didn’t look like itself. The Mustang coaching staff was quick to change course at halftime, with the eager agreement coming from the players. \nThey ran right at the Stormin’ Pointers, handing off to running back Jack Cochrane 20 times in the second half alone. He finished with 24 carries for 135 yards and the game’s final touchdown. As a team, the Mustangs finished with 332 total yards. \n“In the second half, our defensive effort was outstanding,” Pedersen said. “We came out and did some really nice things, were able to contain better than we did in the first half. Our offense didn’t click as well as we wanted to in the first half either, and one of the things we said at half time was, ‘Let’s get after it and run the ball.’ We ran it right at them, were able establish the line of scrimmage and do some nice things.” \nIt was a night to remember for Cochrane, to be sure. He had just the four carries in the first half, but was more than willing to shoulder the load in the second half. \nPedersen noted after the game the lead running back role wasn’t even supposed to be his, but a leg injury to featured back Mickey Hines against Northeast Goose Lake thrust the responsibility onto the senior and he’s lived up to it. \nHe stayed humble afterward, though, even if he did end up with 190 total yards (135 on the ground, 55 receiving). \n“Honestly, it’s all up front,” Cochrane said. “Our line came in at halftime and said they wanted to run the ball in the second half, and we did that. Props to them. \n“Obviously there’s no replacing a great player like Mickey Hines, but as a committee we wanted to come in and do the best we can. We’ve been practicing hard and I felt like we were ready as a team for this.” \nMount Vernon can now quickly shift focus to rival Anamosa, which sits No. 4 in the Class 2A Gazette/KCRG/KGYM rankings. \nPedersen, his staff and the players have felt a little overlooked through the first six weeks of the season, but after four straight wins — three of which in convincing fashion — they hope everyone will take them seriously now. \n“I think we have a pretty good football team and that’s something we’ve believed all year,” Pedersen said. “Now it’s starting to permeate a little bit to the outside. We’re very proud of these guys. That’s a big football game for us (coming up), obviously.” \nMount Vernon is home for Anamosa next week. Center Point stays at home to face Oelwein. \nl Comments: (319) 368-8884; jeremiah.davis@thegazette.com Your Next Articles", "external_links": [], "published": "2015-10-03T05:49:00.000+03:00", "crawled": "2015-10-03T18:48:13.266+03:00", "highlightTitle": ""}