{"organizations": [], "uuid": "a8219e42814e6c4c14b7eb6b4e17dbc974058a8c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.qatarday.com", "main_image": "http://www.qatarday.com/timthumb.php?src=siteadmin/image/news/1444556276.jpg&h=315&w=600&zc=0", "site_section": "http://www.qatarday.com/news-category.php?name=sports", "section_title": "Sports | News | Qatar Day", "url": "http://www.qatarday.com/news/lifestyle/students-raise-money-so-elderly-coffee-shop-employee/26181", "country": "CA", "title": "Students Raise Money So Elderly Coffee Shop Employee Can Visit Disney World | Lifestyle", "performance_score": 0, "site": "qatarday.com", "participants_count": 1, "title_full": "Students Raise Money So Elderly Coffee Shop Employee Can Visit Disney World | Lifestyle | News | Qatar Day", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "a8219e42814e6c4c14b7eb6b4e17dbc974058a8c"}, "author": "Unilad", "url": "http://www.qatarday.com/news/lifestyle/students-raise-money-so-elderly-coffee-shop-employee/26181", "ord_in_thread": 0, "title": "Students Raise Money So Elderly Coffee Shop Employee Can Visit Disney World | Lifestyle", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Two thoughtful students made an elderly woman’s dreams come true, raising enough cash so that the long time coffee shop employee could take her family to Disney World.\nKathryn Thomas has worked at the Acorn coffee shop on the Elon University campus for the past decade and, when Elon students Taylor Zisholtz and Lucy Smith-Williams heard about Kathryn’s wish to take her kids and grandkids to ‘The happiest place on Earth’ during a late night conversation with her, they decided to make it a reality.\nSpeaking to the Pendulum, Taylor said:\nI moved my stuff to Lucy’s table, and we were just brainstorming ideas because I looked at her and was like, ‘We’re doing this, we can do this, we have to do something’.\nTo get the ball rolling, the two started a GoFundMe campaign to raise enough money for Kathryn to take her son, daughter-in-law, and two grandsons to Disney World – which the girls estimated would cost around $6,000 (£3,900).\n In an incredible display of how much those on campus loved Kathryn and the coffee shop, it took only three days for the page to raise $6,500.\nTaylor added:\nEveryone knows Acorn, everyone eats their cookies, everyone’s been there a million times. It’s Elon, it’s their school, it’s their stomping ground, it’s something they can link to and it’s doing good for someone, and who doesn’t like doing good?\nAnd the video above shows the awesome moment when the girls presented the gift to an emotional Kathryn, along with some bags of Disney goodies and a poster from the GoFundMe page with all the kind comments she’d received.\nTaylor has since written an extensive thank you update to everyone on the GoFundMe page update:\nI have said it before but we just truly had one of the most shocking days today as we witnessed the love and generosity pour in from across the country. Kathryn is an exceptional person and deserves every ounce of love she is receiving. We just wanted to make it totally clear that every cent of donation is headed to make Kathryn’s trip as incredible as we can possibly make it for the whole family. The messages, shares, likes, texts, and all the other forms of sweet words and encouraging thoughts are so, so appreciated by both Lucy and myself. Not one message has gone unnoticed, every kind word has made us smile from ear to ear.\nWhat a lovely gesture this is!\n ", "external_links": ["https://www.youtube.com/embed/bvE0iZ_WWfw"], "published": "2015-10-11T03:00:00.000+03:00", "crawled": "2015-10-11T14:16:28.598+03:00", "highlightTitle": ""}