{"organizations": [], "uuid": "c8a72d5d747b36d889703a961210ce013214474d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/golf", "section_title": "Golf News, Leaderboard, Schedule, Photos, Videos - MSN Sports", "url": "http://www.msn.com/en-us/sports/golf/russell-knox-recalls-drama-on-way-to-pga-tour/ar-AAeXpll", "country": "US", "title": "Russell Knox recalls drama on way to PGA Tour", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "Russell Knox recalls drama on way to PGA Tour", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "c8a72d5d747b36d889703a961210ce013214474d"}, "author": "Steve DiMeglio, USA TODAY Sports", "url": "http://www.msn.com/en-us/sports/golf/russell-knox-recalls-drama-on-way-to-pga-tour/ar-AAeXpll", "ord_in_thread": 0, "title": "Russell Knox recalls drama on way to PGA Tour", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Russell Knox recalls drama on way to PGA Tour USA Today Sports 1 day ago by Steve DiMeglio, USA TODAY Sports © Brian Spurlock-USA TODAY Sports Brian Spurlock-USA TODAY Sports PONTE VEDRA BEACH, Fla. — Par remains one’s friend in the U.S. Open.\nAdChoices They come in handy in the Web.com Tour Championship, too.\nIn fact, pars on the final two holes in the final round of the 2013 Tour Championship were Russell Knox’s best friends.\n“I think about those holes almost every day of my life,” Knox said of the pars he needed for a top 10 he had to have to secure his PGA Tour card for the following year. “I’ve had two incredible years since then on the PGA Tour, so I think making par of those last two holes changed my life forever.”\nSimilar stories could unfold at this year’s Tour Championship, the culmination of the four-event Web.com Tour Finals. Beginning Thursday on the Dye’s Valley Course at TPC Sawgrass, four rounds will decide who gets the 50 golden tickets — PGA Tour cards — for the 2015-16 season.\nPlayers who finished in the top 25 on the Web.com Tour money list through the regular season have secured their card. Another 25 will earn a card based on earnings in the finals. The finale also will finalize the priority-ranking order for the 50 players earning their card.\nIn the field this week are former U.S. Open champion Lucas Glover and other PGA Tour winners including Jhonattan Vegas, Derek Ernst and Michael Thompson.\nPatton Kizzire has a healthy lead in being the overall No. 1 graduate, which would earn him an exemption into next year’s Players Championship. He is $167,131 ahead of No. 2 Dawie van der Walt, the only player who can catch Kizzire. First place is worth $180,000.\nKnox, who was born in Scotland and played collegiate golf at nearby Jacksonville State, spent parts of five years on the Web.com Tour, which is akin to Triple A in baseball. He earned his PGA Tour card with a solid 2011 season on the Web.com Tour. When he failed to retain his full PGA Tour card in 2012, he had limited status in 2013 on the PGA Tour and spent much of that year on the Web.com Tour.\n“I just had to get back to the PGA Tour,” Knox said.\nHe’s been on the PGA Tour the past two years, winning more than $3.4 million. He finished 47th on the money list this year to comfortably keep his card. He is ranked No. 73 in the world.\nHe was ranked 267th heading into the Web.com Tour Championship in 2013. Knowing he needed a top 10 to secure his PGA Tour card, he was in third place heading to the back nine in the final round.\nThat’s when tension mounts, hearts race and heads pound.\n“It was the most nervous I’ve ever been in my life,” Knox said.\nBogeys on 14 and 15 ratcheted up the anxiety. He missed the green on the 16th with a lob wedge in his hand for his approach and “I wasn’t feeling too optimistic.”\nEspecially with the 490-yard 17th and 440-yard 18th waiting. On the 17th he said he hit the best drive of his life, knocked his ball to 25 feet with a 6-iron and two-putted for par. He chose to hit 3-wood off the tee on the 18th and then, with the pin back right, “I pulled-hooked an 8-iron” and was left with 50 feet from the fringe.\nHe hit his first putt much too hard — it might have run off the green — but the ball hit the pin and stopped right on the edge of the cup.\n“I walked up there with the biggest smile on my face,” Knox said of the moment before he tapped in to secure his PGA Tour card. “It was the most important tournament of my life.”\nSomeone else may be saying that after this week’s championship.\nGo to MSN Home", "external_links": ["http://www.usatoday.com/sports/", "http://go.microsoft.com/fwlink/?LinkID=286759"], "published": "2015-10-01T03:00:00.000+03:00", "crawled": "2015-10-02T11:53:38.294+03:00", "highlightTitle": ""}