{"organizations": [], "uuid": "fa365672b969fb45148e22576ee699394292c3ef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bellinghamherald.com", "main_image": "http://www.bellinghamherald.com/news/local/vppksa/picture38280636/ALTERNATES/LANDSCAPE_1140/1009StoneyRidge%20(2)", "site_section": "http://www.bellinghamherald.com/?widgetName=rssfeed&widgetContentId=21615405&getXmlFeed=true", "section_title": "Breaking News, Sports, Weather | BellinghamHerald.com &", "url": "http://www.bellinghamherald.com/news/local/article38280642.html", "country": "US", "title": "Final fall season for Stoney Ridge Farm in Everson", "performance_score": 0, "site": "bellinghamherald.com", "participants_count": 1, "title_full": "Final fall season for Stoney Ridge Farm in Everson", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:46:00.000+03:00", "replies_count": 0, "uuid": "fa365672b969fb45148e22576ee699394292c3ef"}, "author": "Dave Gallagher \nThe Bellingham Herald", "url": "http://www.bellinghamherald.com/news/local/article38280642.html", "ord_in_thread": 0, "title": "Final fall season for Stoney Ridge Farm in Everson", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Final fall season for Stoney Ridge Farm in Everson \nFamily-run farm known for pumpkin patch, hay rides \nChristmas events will continue this year and expand in 2016 \nOwners plan more family camping, fishing for summer, fall Stoney Ridge Farm co-owner Debi Gavette shows a group of school kids how apples are harvested during the farm’s final annual fall festival in Everson on Thursday, Oct. 8, 2015. The farm is open Thursdays through Saturdays through Halloween for u-pick pumpkins and apples, hayrides and farm tours. The farm still will be open in winter for Christmas trees. Philip A. Dwyer The Bellingham Herald Katie Schafer of Bellingham photographs her daughter Grace Schafer, 1, in the pumpkin patch at Stoney Ridge Farm in Everson, Thursday, Oct. 8, 2015. Philip A. Dwyer The Bellingham Herald 1 of 2 Order Reprint of this Story EVERSON \nFor those who enjoy visiting the pumpkin patch and seeing the fall colors at Stoney Ridge Farm, this month is your last chance. \nThe farm announced on its website that this year will be the final season for fall events, but it will continue the traditional Christmas events. Through Halloween, the farm at 2092 VanDyk Road is open 10 a.m. to 5 p.m. Thursdays through Saturdays. \nStoney Ridge has provided family-friendly farm activities for adults and children for 25 years. The fall events offer plenty of things to see and eat, including a large pumpkin patch, corn maze, fresh apple cider, u-pick apples, pastries, farm animals as well as hay and train rides. An estimated 25,000 people visit the farm during the October events. \nDebi and Derek Gavette bought the farm 28 years agofrom Debi’s parents, Lewis and Carol Stremler. \nDebi Gavette said that with four of their five children now out of the house and working in their own jobs, it became more difficult to operate both the fall and winter events as a family. Together the family decided they wanted to focus on the winter season events, which include some of the fall events, the Christmas U-cut trees and Moses the Camel. They plan on adding several new features to the winter season in 2016. \n“It’s bittersweet, but also a little more sweet. I’m excited that we’ll be doing something different with the Christmas season,” Gavette said. \nThe fall events are particularly popular with children, making it a school field trip destination. During the school activities Stoney Ridge has educational puppet shows about agriculture as well as learning stations. That’s what Gavette will miss the most. \n“My biggest memory is the kids. Many don’t get to meet farm animals and farmers up close unless they go to the fair,” Gavette said. “Having that experience at my place, that’s what I love.” \nAs word has spread about the fall plans, Gavette has received a lot of feedback, mostly in the form of hugs. \n“I have a huge appreciation for the support I’ve received over the years,” Gavette said, adding that the experience has resulted in many lifelong friends. \nAfter the fall season, some of the tentative plans include putting in more Christmas trees and hay to replace the pumpkin patch and part of the apple orchard. They plan to keep some of the apple trees in order to continue making their popular pies and other pastries. \nPreparing for the fall season took quite a bit of work, and in the coming years the family plans to use some of that extra time in the summer and fall for camping and fishing. \nEven as she looks forward to doing those things, Gavette said she already realizes how much she’ll miss the fun of being with the families on the farm in the fall. The winter events are scheduled to start the day after Thanksgiving. \n“I think the last weekend (in October) will be extremely tough,” Gavette said. \nReach Dave Gallagher at 360-715-2269 or dave.gallagher@bellinghamherald.com . Follow him on Twitter at @BhamHeraldBiz and on Facebook at BellinghamHeraldBusiness . Related content", "external_links": [], "published": "2015-10-09T03:46:00.000+03:00", "crawled": "2015-10-09T06:24:48.044+03:00", "highlightTitle": ""}