{"organizations": [], "uuid": "a9e018517b63b8197bbad7937994703f66e67b85", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.capecodtimes.com", "main_image": "http://www.capecodtimes.com/storyimage/CC/20151011/SPORTS/151019862/AR/0/AR-151019862.jpg", "site_section": "http://www.capecodtimes.com/sports/professional?template=rss&mime=xml", "section_title": "Pro Sports - capecodtimes.com", "url": "http://www.capecodtimes.com/article/20151011/SPORTS/151019862/101040?rssfeed=true", "country": "US", "title": "Keuchel wins at home again for Astros", "performance_score": 0, "site": "capecodtimes.com", "participants_count": 1, "title_full": "Keuchel wins at home again for Astros", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T04:28:00.000+03:00", "replies_count": 0, "uuid": "a9e018517b63b8197bbad7937994703f66e67b85"}, "author": "The Associated Press", "url": "http://www.capecodtimes.com/article/20151011/SPORTS/151019862/101040?rssfeed=true", "ord_in_thread": 0, "title": "Keuchel wins at home again for Astros", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Keuchel wins at home again for Astros Comment Posted Oct. 11, 2015 at 8:28 PM By The Associated Press Posted Oct. 11, 2015 at 8:28 PM » Social News HOUSTON — Dallas Keuchel remained perfect at home with seven gutsy innings and Chris Carter homered Sunday, leading the Houston Astros to a 4-2 win over the Kansas City Royals to take a 2-1 lead in the American League Division Series. The Astros could wrap up the best-of-five series with a win over the defending AL champions in Game 4 on Monday. Keuchel, who shut down the Yankees in the AL wild-card game, worked out of jam after jam, allowing five hits and one run with seven strikeouts after going 15-0 at home this season, a modern major league record. \"The ball in Dallas Keuchel's hand brings an awful lot of confidence to a lot of people. Including me,\" Astros manager A.J. Hinch said. \"And he came up with some excellent pitches.\" Luke Gregerson gave up a leadoff homer in the ninth to Alex Gordon before finishing off the Astros first playoff game in Houston in 10 years with a four-out save. It was his first save of more than three outs in three years. Jason Castro drove in two runs with a single in the fifth that made it 2-1. Carlos Gomez, who has a rib muscle strain, started for the first time in the series and had an RBI single in the sixth. Carter's soaring solo homer, which landed on the train tracks atop the wall in left-center, and came on Danny Duffy's first pitch of the seventh pushed the lead to 4-1. Carter, batting .199 in the regular season but .455 in the postseason, was a triple shy of the cycle for the Astros, who were hosting a playoff game for the first time since the 2005 World Series. Lorenzo Cain hit a solo homer in the fourth for the Royals, who are on the brink of elimination after reaching the World Series last season. Kansas City starter Edinson Volquez fell to 0-3 in his postseason career by allowing five hits and three runs in 5 2-3 innings. The Astros are one win away from reaching the AL championship series just two years after losing a franchise-worst 111 games. They took the series lead in front of a rowdy, playoff-starved sellout crowd of 42,674. The group was mostly clad in orange and dotted with fans sporting fake beards in support of the star lefty who has become all but untouchable at home. They were given inflatable orange sticks at the door and spent the afternoon beating them as they cheered, making the roar in the closed-roof stadium deafening at times. ''Electric crowd, and it was 10 years coming,\" Keuchel said. By The Associated Press", "external_links": [], "published": "2015-10-12T04:28:00.000+03:00", "crawled": "2015-10-12T05:45:01.260+03:00", "highlightTitle": ""}