{"organizations": [], "uuid": "3dc23b0eb36a112bf3637d1c0a24e5eab24a8d99", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.baltimoresun.com", "main_image": "http://www.trbimg.com/img-561426cd/turbine/bs-sp-schmuck-column-1007-20151006", "site_section": "http://www.baltimoresun.com/sports/rss2.0.xml", "section_title": "Sports - Baltimore Sun", "url": "http://www.baltimoresun.com/sports/bs-sp-schmuck-column-1007-20151006-column.html", "country": "US", "title": "For a preview of the Orioles offseason, just read between the lines", "performance_score": 0, "site": "baltimoresun.com", "participants_count": 1, "title_full": "For a preview of the Orioles offseason, just read between the lines", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T00:00:00.000+03:00", "replies_count": 0, "uuid": "3dc23b0eb36a112bf3637d1c0a24e5eab24a8d99"}, "author": "Peter Schmuck", "url": "http://www.baltimoresun.com/sports/bs-sp-schmuck-column-1007-20151006-column.html", "ord_in_thread": 0, "title": "For a preview of the Orioles offseason, just read between the lines", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Dan Connolly) \nFor too long, that has been the code phrase that tells fans not to expect the club to spend any real money in the free-agent market, and it's very possible that the Orioles will come up empty in their attempt to re-sign Davis or anyone else and push the payroll past whatever financial line Peter Angelos draws in the infield dirt this winter. \nDon't misunderstand. Angelos wants to win as much as anybody, but the Orioles have long worked under a set of economic parameters that are based on their status as a middle-market club. Last year's payroll was pretty much in the middle of the pack and it's fairly likely that it will rise only modestly next year. \nBrowse pictures of the Orioles in September and October 2015. \nThat doesn't mean the Orioles can't sign a big-money pitcher, because a lot of money is about to fall off the payroll as most of those free agents move on and the club makes some other roster adjustments. There will be some arbitration-fueled salary increases, but nothing that is going to seriously inflate the payroll. \nIn fairness to Duquette, who said recently that re-signing Davis was his top priority and then said Monday that upgrading the pitching staff is Job One, there is a lot that goes on during the offseason that is out of his control. \nHe might badly want to bring Davis back and please the fans who were hollering for that at the end of Sunday's season finale. Angelos might want that, too, but Davis' future is really in the hands of agent Scott Boras, and nothing but a blank check is going to assure that Davis will be back in an Orioles uniform in 2016. \nIt should be obvious to veteran Orioles front-office observers that Duquette spent a lot of time reminding everyone that the Orioles payroll isn't open-ended and that the club has a lot of needs to address. They need real pitching help. They need at least one more productive corner outfielder, depending on whether they re-sign pending free agent Gerardo Parra. They need to boost the club's on-base percentage. \nDuquette didn't come right out and say it, but if the Orioles spend $25 million per year for Davis, then some of those needs probably are not going to be addressed outside the minor league system. And, let's not forget, bringing back Davis doesn't make this year's 81-81 squad one run better, though we just saw what can happen when you let your top offensive player go and don't adequately replace him. \nThe case could be made that the Orioles could spend the $150 million or so Boras might get for Davis on two or three players that might make the Orioles offense and pitching staff better across the board. The case could also be made that the Orioles could afford to do both if they really wanted to dip into the treasure chest and make 2016 a special priority. \nMaybe this is the year Angelos decides to do that, because the alternative is not pretty. \nClubhouse leader Adam Jones has chimed in on a couple of occasions over the past year, recently urging the front office and ownership to re-sign Davis and use whatever money is saved on the other free-agent departees to upgrade the club for a big run next season. \nDuquette and Showalter have complimented him for his desire to play on the best team possible, but on Monday included the caveat that Jones might have a broader perspective if he were privy to the club's financial restraints. \nThat was another one of those read-between-the-lines moments. \nTalk amongst yourselves.", "external_links": [], "published": "2015-10-07T00:00:00.000+03:00", "crawled": "2015-10-07T00:18:55.144+03:00", "highlightTitle": ""}