{"organizations": [], "uuid": "43037e13001ececb48034051a75422a1c4436e5f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "http://www.bostonherald.com/sites/default/files/media/2015/10/11/101115patriotsmw18.jpg", "site_section": "http://bostonherald.com/sports", "section_title": "Sports | Boston Herald", "url": "http://bostonherald.com/sports/patriots_nfl/new_england_patriots/2015/10/tom_brady_patriots_pull_away_from_cowboys", "country": "US", "title": "Tom Brady, Patriots pull away from Cowboys", "performance_score": 0, "site": "bostonherald.com", "participants_count": 2, "title_full": "Tom Brady, Patriots pull away from Cowboys | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 1, "uuid": "e1a15cfd3d94b711fc409a0189cf3f433b1f036a"}, "author": "Jeff Howe", "url": "http://bostonherald.com/sports/patriots_nfl/new_england_patriots/2015/10/tom_brady_patriots_pull_away_from_cowboys#post-0", "ord_in_thread": 0, "title": "Tom Brady, Patriots pull away from Cowboys", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ARLINGTON, Texas — Even while taking his worst beating of the season, Tom Brady remained the cowboy in charge of this Texas town yesterday, as the Patriots lassoed the hosts by a 30-6 count at AT&T Stadium.\nIt was a methodical blowout, and one that took more patience and toughness than their three September victories. Brady withstood the Dallas Cowboys’ five first-half sacks, including a pair from Greg Hardy, to keep the Pats (4-0) undefeated as they gallop toward Sunday’s long-awaited rematch with the Colts at Indianapolis.\nBrady completed 20-of-27 passes for 275 yards and two touchdowns. The 38-year-old added a rushing score and he still hasn’t thrown an interception this season. He completed his first nine passes of the second half for 155 yards and two touchdowns, and he delivered the knockout blow, harmoniously, while absorbing Hardy’s wicked shot to unload a 59-yard lob to Julian Edelman, who scooted past four tacklers to make it 27-6 in the fourth quarter.\n“Have you seen him play for the last 15 years? He’s pretty tough,” said Edelman, who caught four passes for 120 yards. “I don’t think anyone underrates his toughness. Tom Brady is tough. He’s very tough.”\nWhen the line broke down around Brady, as Nate Solder, Sebastian Vollmer, Marcus Cannon and David Andrews were all beaten for sacks, the quarterback improved his pocket agility to keep plays alive and offset the rushes. And, as was the case for the Edelman score, Brady sometimes had to sacrifice himself to make the play.\n“I don’t think anyone questions Tom’s toughness,” coach Bill Belichick said of his quarterback. “I think Tom is one of the toughest players in the league.”\nThe Patriots broke a 3-3 tie late in the second quarter when they hastened the tempo to find a rhythm. Brady completed 5-of-6 passes for 37 yards to get the Pats into the red zone before Dion Lewis evaded a tackle in the backfield to gain 13 yards on third-and-1. Brady snuck into the end zone for a 1-yard score and 10-3 advantage on the ensuing play.\nThe Pats spun a competitive game into a one-sided affair shortly thereafter. Brady bounced back from his fifth sack, ducked another rusher on second-and-18 and found Edelman for 24 yards to set up Stephen Gostkowski’s 57-yard field goal before halftime to push the lead to 13-3.\nLewis, who had 93 yards from scrimmage, was the star of the first series of the third quarter. He made a one-handed catch, broke four tackles and dived into the end zone for a wild 10-yard touchdown to increased the margin to 20-3.\n“I was just trying to make a play, trying not to get hit really,” Lewis said.\nMeanwhile, Brady’s counterpart did nothing against the Patriots defense. Brandon Weeden’s losing streak extended to 11 games since 2012 — Brady is 36-11 over the same stretch — and he rarely found a target beyond his check-downs, completing 26-of-39 passes for 188 yards, no touchdowns and one interception.\nThe Patriots essentially neutralized tight end Jason Witten, who had five receptions for 33 yards and a fumble. The Pats did it without Dont’a Hightower, who left in the first quarter with a rib injury, so Jamie Collins and Devin McCourty took on the brunt of the Witten responsibility.\n“I think everyone knows from watching us through the years, we’re always going to try to take away teams’ best players,” McCourty said. “Obviously, he is one of the best tight ends to play the game. It was just having awareness and doing different things within the scheme to try to stop him. At times, we did a good job of not letting him be that go-to guy, make big catches and move the chains.”\nWhen the Cowboys had one last chance to make some noise, McCourty read Witten’s third-and-4 route to the left flat and tackled him 2 yards shy of the sticks to force a field goal that made it 20-6 late in the third quarter.\nThree plays later, Brady noticed Hardy barreling around Vollmer but hung on just long enough for Edelman to break free down the left sideline, where he hit him for a 59-yard catch, run and dive for a touchdown, which yielded another string of “Brady” chants from the Patriots’ traveling fans.\nIt took a while for the Patriots to pull away from the undermanned Cowboys, but the final score was indicative of a tempo that largely favored the visitors. That’s why Brady simplified the difference between the first and second halves in just a few words before heading home to New England.\n“I think,” Brady said, “we just made a couple more plays.”", "external_links": [], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-12T18:38:12.269+03:00", "highlightTitle": ""}