{"organizations": [], "uuid": "7eee7c320f6cd8d9a7b2e8b6c7f5ee17c7244d6a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sportsnews.com.au", "main_image": "http://sportsnews.com.au/defaultimage.jpg", "site_section": "http://www.sportsnews.com.au/category/tennis/feed", "section_title": "Sports News Australia » Tennis News", "url": "http://www.sportsnews.com.au/tennis/paire-stuns-nishikori-in-japan-tennis-semi/159444", "country": "CA", "title": "Paire stuns Nishikori in Japan tennis semi", "performance_score": 0, "site": "sportsnews.com.au", "participants_count": 1, "title_full": "Paire stuns Nishikori in Japan tennis semi", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T11:44:00.000+03:00", "replies_count": 0, "uuid": "7eee7c320f6cd8d9a7b2e8b6c7f5ee17c7244d6a"}, "author": "AAP", "url": "http://www.sportsnews.com.au/tennis/paire-stuns-nishikori-in-japan-tennis-semi/159444", "ord_in_thread": 0, "title": "Paire stuns Nishikori in Japan tennis semi", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Paire stuns Nishikori in Japan tennis semi Posted by AAP + on 10/10/2015 at 7:44 pm   \nLightning struck twice for Kei Nishikori as the defending Japan Open champion was ambushed on Saturday by “shoeless” Frenchman Benoit Paire in an explosive semi-final. \nThe unseeded Paire, playing in a pair of badly torn sneakers following a forlorn dash to buy some new ones, won a nail-biter 1-6 6-4 6-2 to prove his first-round win over Nishikori at the US Open six weeks ago was no fluke. \nTop seed Stan Wawrinka awaits his close friend in Sunday’s Tokyo final, the French Open champion producing a clinical 6-4 7-6 (7-5) win over Luxembourg’s Gilles Muller. \nNishikori’s bid for a third Japan Open crown in four years came to a shuddering halt as Paire roared back from dropping a whirlwind first set in just 20 minutes. \n“One minute he was missing – the next he wasn’t,” shrugged Nishikori, at a loss to explain his collapse. “I started well but, when he lifted his game, I didn’t seem to be able to cope.” \nHis tattered shoes held together with medical tape and with only one spare racquet in his kit bag, Paire levelled the match by ripping a backhand down the line, celebrating with a gunslinger’s pose as the crowd fell silent. \nThe bearded Frenchman broke early in the decider and the world No.32 fought off a late salvo from Nishikori to complete the coup de grace after one hour and 48 minutes with a massive forehand into the corner. \n“He suddenly started hitting some great shots,” conceded Nishikori. “You have to give him credit for the quality of his play. He’s a very difficult opponent.” \nIn contrast, Wawrinka never looked troubled in his semi-final, taking the opening set with little fuss in chilly conditions, a booming serve giving the muscular Swiss the advantage. \nTwice, Muller double-faulted to gift Wawrinka a break in the second, only for the world No.4 to immediately surrender his own serve. \nBut Wawrinka, chasing a fourth title of the year and the 11th of his career, knuckled down in the tiebreaker and closed out proceedings with a crunching forehand return which Muller could only volley wide. \n“Benoit is a great player and a fun player to watch,” said Wawrinka, looking ahead to the final. \n“He is crazy in his game and can play shots nobody else can play. The important thing is that I’m in the final. The one who is more aggressive and puts all his game on court will win.”  ", "external_links": [], "published": "2015-10-10T11:44:00.000+03:00", "crawled": "2015-10-10T12:53:57.344+03:00", "highlightTitle": ""}