{"organizations": [], "uuid": "f3239643dd3d128d390eba36a85169aedf1f5410", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.abqjournal.com", "main_image": "http://main.abqjournal.netdna-cdn.com/wp-content/plugins/journal-open-graph/img/albuquerque-journal.jpg", "site_section": "http://www.abqjournal.com/", "section_title": "Albuquerque and New Mexico News, Sports, Business and more | Albuquerque Journal News", "url": "http://www.abqjournal.com/658043/news/reaching-obamacares-goals-will-take-time.html", "country": "US", "title": "Reaching Obamacare’s goals will take time", "performance_score": 0, "site": "abqjournal.com", "participants_count": 1, "title_full": "Reaching Obamacare’s goals will take time | Albuquerque Journal News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T07:40:00.000+03:00", "replies_count": 0, "uuid": "f3239643dd3d128d390eba36a85169aedf1f5410"}, "author": "Winthrop Quigley / Journal Staff Writer", "url": "http://www.abqjournal.com/658043/news/reaching-obamacares-goals-will-take-time.html", "ord_in_thread": 0, "title": "Reaching Obamacare’s goals will take time", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "When the Affordable Care Act was enacted, policy experts saw two possible futures.\nIn one future, millions of low-income people with medical conditions that had long gone untreated would swamp the nation’s health care system and drive costs higher.\nIn the other, the pent-up demand would be met, and then patients would gradually establish relationships with medical providers, get routine care, and costs would eventually stabilize at a more-or-less normal level.\nUniversity of New Mexico Hospital CEO Steve McKernan says it isn’t clear which future is correct. Demand for care has definitely increased, he said. Long-deferred needs and undiagnosed conditions are being treated.\nThe long-term cost of this deferred treatment won’t be known for a while, McKernan said. Patients suffering from high blood pressure for years may have just been diagnosed, but the damage to the cardiovascular system remains even if the blood pressure is controlled, and it might require years of expensive treatment.\nOther health care providers report that emergency rooms are still full of patients seeking expensive but routine care, even though they now have insurance cards. Some newly insured patients are finding they can’t afford the deductibles and copayments that came with low-cost insurance. So far, demand for care seems to be outstripping the supply of providers of care.\nWith the arrival of the ACA, the major problem that afflicted New Mexico for years – the enormous number of people with no way to pay for care – is gradually being solved.\nThere were years when nearly a quarter of our population had no health insurance, Medicare or Medicaid. The uninsured rate consistently hovered at or above 20 percent. The state in 2014 had 16 percent of its residents without health insurance or other coverage, thanks to subsidized commercial insurance and expanded Medicaid eligibility offered by the act.\nNow that more people can pay for coverage, other concerns are arising.\nDifficulty accessing care is a big trend, partly because there aren’t enough medical providers for the demand for care the ACA has unleashed, and partly because for many people insurance is still unaffordable.\nBob DeFelice, who runs First Choice Community Healthcare, says low-income people who make more than the 138 percent of the federal poverty level ($34,265 a year for a family of four) that would allow them to get Medicaid are eligible for subsidies that help them buy low-cost insurance on the state exchange.\nThat coverage is great for a catastrophe, but if it’s used regularly, copayments and other out-of-pocket expenses can cost patients $6,000 a year – far more than they can pay. First Choice is now able to bill an insurer more often for care, but still sees too many people who can’t pay their portion of the bill.\nFor immigrants in the country illegally, there is no coverage at all, DeFelice said.\nPeople with unaffordable out-of-pocket expenses often don’t seek the care they need, said Alfredo Vigil, former state health secretary and a physician with El Centro Family Health in Taos. Healthier patients seem to be dropping the low-cost insurance they bought because it seems like an unnecessary expense, he said.\nThe biggest problem, Vigil said, “is access, access and access.”\n“There is a massive backlog of people who are not getting the health care they need, even though they are running around with an insurance card in their hand,” he said. There are simply not enough medical providers.\nThere is a real shortage of specialists, and some specialists who are practicing don’t seem to want to see some of the newly insured patients El Centro sends them. Vigil speculates, with some bitterness, there are practices that “don’t want to ruin the ambiance of their waiting rooms” with low-income patients who carry Medicaid cards.\nMeanwhile, newly insured patients continue to use the Lovelace Health System emergency room for nonemergency and routine care, said Chief Medical Officer John Cruickshank. Emergency rooms continue to be the most expensive, least efficient place to receive anything other than emergency care.\nLovelace has started what it calls a concierge program in hope of guiding patients to urgent care centers and primary care physicians. Accessing health care is complicated, so it isn’t surprising newly insured patients fall back into old habits, said Lovelace Chief Financial Officer Stephen Forney.\nLovelace’s new patients tend to be younger and working at low-wage jobs, especially service industry jobs, Forney said. Much of the care they need is “low-acuity,” meaning it does not require intensive nursing to deliver.\nPatients with new insurance cards still need a strategy for their health care, said Deborah Helitzer, founding dean of the UNM College of Population Health, which will open next year.\nThey have to have a way to exercise and access to proper nutrition. High out-of-pocket expenses that come with low-premium insurance are forcing patients to choose between filling prescriptions and feeding the children, Helitzer said. Without a strategy, patients get treatment but don’t achieve the health status that keeps them from needing treatment, she said.\nMcKernan said patients need treatment plans for chronic conditions and help from care coordinators to navigate the health care system. Getting those services in place and getting patients to use them properly will take time.\nUpFront is a daily front-page news and opinion column. Comment directly to Winthrop Quigley at 823-3896 or wquigley@abqjournal.com . Go to ABQjournal.com/letters/new to submit a letter to the editor.", "external_links": [], "published": "2015-10-11T07:40:00.000+03:00", "crawled": "2015-10-11T10:08:49.277+03:00", "highlightTitle": ""}