{"organizations": [], "uuid": "844cdcf439de43c4464a139b615165f7ad379503", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/18/107/161236/Books/Arab/INTERVIEW-Egypts-late-novelist-Gamal-ElGhitani-on-.aspx", "country": "EG", "title": "INTERVIEW: Egypt's late novelist Gamal El-Ghitani on his passion for One Thousand and One Nights - Arab - Books", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "INTERVIEW: Egypt's late novelist Gamal El-Ghitani on his passion for One Thousand and One Nights - Arab - Books - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "844cdcf439de43c4464a139b615165f7ad379503"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/18/107/161236/Books/Arab/INTERVIEW-Egypts-late-novelist-Gamal-ElGhitani-on-.aspx", "ord_in_thread": 0, "title": "INTERVIEW: Egypt's late novelist Gamal El-Ghitani on his passion for One Thousand and One Nights - Arab - Books", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "When I phoned Gamal El-Ghitani last Ramadan to conduct a short interview about the book Alf Leila wa Leila (One Thousand and One Nights), he spoke admiringly of it. However, it was fated for this hour-long phone interview to not be brought to light until now. I had kept every word uttered by the novelist in my notes. Ghitani’s life, as well as his literary creations, encountered Alf Leila wa Leila, the last of which being his latest novel entitled Hekayat Haeema, which was inspired by the text of Al-Omda from folk literature.\nI was first introduced to Ghitani in the 1980s, in the house of late journalist and writer Mostafa Teeba, which was located in El-Agouza neighborhood, adjacent to the Nile and close to the house of renowned novelist Naguib Mahfouz. Ghitani was a frequent visitor to Teeba’s home and there was a real chemistry between the two of them.\nI recall how Ghitani was appreciative of Teeba and what he had endured as a longtime political prisoner, as well as his novel entitled Sayara Safraa Bedoon Arqam (A Yellow Car Without a License Plate), and book Rasaeyal Sageen Seyasi Ela Habibato (A Political Prisoner’s Letters to His Beloved), which displayed an unforgettable surge of humanism.\nGhitani himself had suffered a similar prison experience in 1966. At the time, he had reached fame as an acclaimed novelist, especially with works like Awraq Shab Aasha Mundhu Alf Aam (Papers of a Young Man Who Lived a Thousand Years Ago, 1969), El-Zini Barakat (1974), and Al-Zowail (2006).\nDuring his last interview with Al-Ahram, Ghitani recalled the years of his childhood and youth spent in El-Gamaliyya district saying, “I used to listen to Alf Leila wa Leila on the neighbors’ radio. This was in 1958 and I’d sit on the stairs and listen. At the time my family did not own a radio, and I was a student in preparatory school. In fact, owning a radio at the time was proof of a high social status. The series sparked my imagination. While I had read part of the text before, listening to it on the radio put me through a completely different experience.”\n“Certainly, the music by Russian composer Rimsky Korsakov introduced me to classical music, and allowed me into its world. I believe that National Radio played an important role in elevating musical taste more than television did. Generally, the National Radio’s programs at the time were of high-quality, and reflected the hard work of those behind their production, as well as the high-quality of the technology used.”\n“Since that year, adaptations of Alf Leila wa Leila presented on TV were never of interest to me. I watched some series and TV productions, but none of them grabbed my attention. In fact, I looked at such productions and TV series inspired from Alf Leila wa Leila without much surprise, as if they weren’t of much importance. I also believe that current TV adaptations of the text are influenced by Turkish drama, including the Turkish TV series Hareem El-Sultan.”\n“In my opinion, the stories of Alf Leila Wa Leila are amongst the greatest collectively-written literary works ever written by mankind. However, we undervalue these stories because they have no known author. If it weren’t for the French Antoine Galland and how he brought the text to life after discovering it in the 17th century, no one would have known it. That said, these stories were originally in circulation across Cairo’s coffee shops in the form of oral recitations, and also centuries earlier through El-Rababa’s poets. The origins might go all the way back to the year 4 A.H. (625 AD) during the Fatimid rule, or even earlier. Al-Maqrizi had mentioned the text when documenting the ninth century. Ibn al-Nadim’s Fihrist -one of the oldest books in Arabic Bibliography-also made mention of it.”\nWhen I asked Ghitani whether or not it is true that the text originated in Asia and Persia, he responded saying:\n“This isn’t true. The book is Egyptian and Shami (from the Levant). And for it to evoke the listener’s imagination, it took on a Baghdad setting for the stories’ events. But I believe that its real setting is Cairo and that Baghdad has nothing to do with it. I had written about this before, and experts and researchers confirmed that later on. My opinion was based on the nature of the language employed in the story-telling.”\nGhitani pointed to a text, which he described as a sub-text, and not an original one, saying that it was “Shami, from Aleppo.”\nGhitani adds that Alf Leila wa Leila was printed twice in two different locations. The first being in Kolkata, India in 1832, after a British orientalist who was a former military officer collected it. The second was printed in El-Amiriya Press in Cairo’s Bulaq district in 1840, and the copy was verified by Sheikh Mohamed Qota El-Adawy, an Azhar sheikh who earned Al-Alamiyya certificate.\nEl-Ghitani explains that copies printed in Cairo and later in Beirut originated from these two copies. He also added that these copies confirm what he had said earlier about the written text being in Egyptian Arabic, despite the fact that the stories’ settings were in Baghdad.\n“The Arabic copies of Alf Leila wa Leila are written in Egyptian Arabic. The same applies to the copies widespread in the Maghreb region, they originally came from Cairo and Beirut, and were written in the same Egyptian Arabic.”\nDuring his time as founder and head of the Ministry of Culture's series Al-Zakhaar (treasures), Ghitani supervised the re-publishing of the first two copies printed in Kolkata and Bulaq, in the years 1996 and 2000 respectively.\nThe first re-published copy (Kolkata) came out in eight parts, but radical lawyers objected that a text comprising obscene statements was published by one of the Ministry of Culture’s bodies. In 1986, a primary court ordered the confiscation of the book and prevented its circulation.\nCommenting on that, El-Ghitani said that “Alf Leila wa Leila is an oppressed text. In the early 20th century, parents used to read it in secret and hide it from their children, even though it is one of the heritage books that celebrates sex the least, if you compare it to songs by Abou El-Farag El-Asfahani, for example.\nEven when poets and folk storytellers used to recount these stories, many belittled both themselves and the text, just because it was a creative text written collectively and passed down with no known author. I think that one result of the oppression exercised on this book was this ensuing belittlement of its folk storytellers. In this way, the text also continued to depict human feelings more than conventional and official literature does.”\n“The first printed edition (Kolkata) from Al-Zakhaar series was subjected to assaults by radicals. As for the other printed edition, which came out at a time when the Internet was widespread, it was subjected to an even more intense assault. Lawyers reported it to the general prosecutor.”\n“The clamor quickly died down and the first printed edition of the book by Al-Zakhaar series was sold out in just three days. Even though this series normally published 3000 copies only, 5000 copies were printed. As for the second printed copy (Bulaq), it came out in 5000 copies. I remember how it also sold out in just two weeks.”\nAs for his latest work Hekayat Haaema, Ghitani said, “I am experimenting with Alf Leila wa Leila. Honestly, I will not be able to create a similar work of art, but I have aspirations. And if you ask me about a book that I’d like to write something similar to, I’d definitely say Alf Leila wa Leila.”\nIn the end, Ghitani stressed that Alf Leila wa Leila did not receive the attention it deserved, and hoped it could attract further examination.", "external_links": [], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-20T04:29:19.879+03:00", "highlightTitle": ""}