{"organizations": [], "uuid": "afe8ab405af0a201065dbbf58d18786956e8fa58", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-5615bcb7/turbine/ct-sta-rauner-oak-lawn-st-1008-20151007", "site_section": "http://www.chicagotribune.com/", "section_title": "Chicago Tribune: Chicago breaking news, sports, business, entertainment, weather and traffic - Chicago Tribune", "url": "http://www.chicagotribune.com/suburbs/daily-southtown/news/ct-sta-rauner-oak-lawn-st-1008-20151007-story.html", "country": "US", "title": "Rauner says &apos;big things&apos; possible with compromise - Daily Southtown", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Rauner says &apos;big things&apos; possible with compromise - Daily Southtown", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T02:37:00.000+03:00", "replies_count": 0, "uuid": "afe8ab405af0a201065dbbf58d18786956e8fa58"}, "author": "Mike Nolan", "url": "http://www.chicagotribune.com/suburbs/daily-southtown/news/ct-sta-rauner-oak-lawn-st-1008-20151007-story.html", "ord_in_thread": 0, "title": "Rauner says &apos;big things&apos; possible with compromise - Daily Southtown", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Playing the role of appeaser in one breath and admonisher with the next, Gov. Bruce Rauner, speaking in Oak Lawn on Wednesday, said Republicans and Democrats have the opportunity of \"transforming the state,\" yet Democratic leaders are content to \"just double down on the status quo.\"\nBut even as the Republican governor said it was \"simply inexcusable and unacceptable\" for Illinois to be more than three months into the fiscal year and still lacking a budget, there were signs that a quick resolution to the gridlock won't be coming any time soon.\nAddressing the annual meeting of the Chicago Southland Convention & Visitors Bureau, Rauner said \"we're at a turning point in Illinois' history.\"\n\"Will we stay on the failed path of the status quo\" or chart a course toward \"fiscal responsibility and stronger economic growth?\" he asked.\nHe said that legislators and his office are \"capable of doing big things together, we're capable of transforming the state.\"\n\"We owe it to the people of Illinois to do that,\" Rauner said.\nThe governor said that \"legislators who like the status quo are holding up the budget,\" and that failure to come to a quick consensus on a spending plan will only \"cause more people in our state to be harmed.\" House Speaker Michael Madigan, however, laid the blame for that harm at the governor's feet, accusing him of pushing an agenda that will \"devastate Illinois' middle class.\"\nFinancial aid for state college students may soon disappear Illinois has now gone 100 days without a budget and today, another shoe drops. Oct. 7, 2015. (CBS Chicago)\nIllinois has now gone 100 days without a budget and today, another shoe drops. Oct. 7, 2015. (CBS Chicago)\nSee more videos In a statement issued after the governor's remarks, Madigan said he is willing to \"work with the governor cooperatively and professionally,\" but that Rauner has so far \"refused to focus on solving our budget deficit,\" which the speaker called Illinois' most pressing issue.\nMadigan said that spending cuts alone won't cure the deficit, and that he has \"repeatedly urged the governor to focus on the budget deficit through a balanced approach of reductions in state spending and new revenue.\"\nRauner, during his speech, reiterated a prior call that Democrats need to work with him on reforms or, without his backing, \"use your supermajority to pass your own tax increase.\"\n\"Choose now,\" he said. \"Time's up.\"\nThe governor tried to rouse the crowd of roughly 250 people, which included local business and municipal leaders, into doing their own lobbying if they support his agenda.\n\"Don't just sit back,\" he told them. \"Get engaged and push for results.\"\nRauner, chased by media after his talk, was hustled out a back door. Both House Republican Leader Jim Durkin, R-Western Springs, and Senate Republican Leader Christine Radogno, R-Lemont, were present for the speech.\nAfterward, Durkin said that \"nothing's changed\" in the budget stalemate, and that \"we can get this done if the Democrats are willing to sit down and negotiate\" on matters such as pension reform.\nRadogno said Rauner's speech was a \"reiteration of the governor's willingness to compromise,\" but that Democrats are \"not used to compromising.\"\n\"He is not going to sign a budget that continues the path we've (Illinois) been on,\" she told reporters.\nThe budget stalemate is already pinching the Southland tourism bureau.\nTo promote the south and southwest suburbs as a tourist or convention destination, the bureau relies on a portion of local hotel and motel sales taxes, but the largest portion of the budget comes from the bureau's share of revenue generated by the 6 percent state sales tax on hotel stays. It's been $1 million a year for the last two years, and disbursed monthly to the Southland bureau and other tourism bureaus around the state. No monthly payments have been received for the current fiscal year because of the budget impasse.\nRevenue the bureau gets from the share of local hotel tax revenue is about $800,000 a year, but without a guarantee of seeing state money any time soon, the bureau is \"very cautiously moving forward\" as far as undertaking promotional efforts, Sally Schlesinger, executive vice president, said.\nBefore Rauner's remarks, Jim Garrett, the bureau's president and chief executive, talked about the bureau's achievements in promoting tourism locally, calling on the governor to find a way to release the funds, saying they drive \"the engine that creates economic growth.\"\n\"I don't want the tourism industry to be the collateral damage\" in the budget morass, Garrett said.\nHe also called on the governor for help in convincing transportation officials to erect blue hospitality logo signs on area highways to identify and generate business for Southland hotels, restaurants and area attractions.\n\"Too many businesses have closed, too many people have lost their jobs, too many opportunities have been lost,\" Garrett said.\nmnolan@tribpub.com\nCopyright © 2015, Daily Southtown Bruce Rauner Travel Republican Party Democratic Party Oak Lawn James B. Durkin Christine Radogno", "external_links": ["http://www.trbimg.com/img-5615a9dc/turbine/cbs_chicag-financial-aid-for-state-c-20151007", "http://www.trbimg.com/img-5615bcb7/turbine/ct-sta-rauner-oak-lawn-st-1008-20151007"], "published": "2015-10-08T02:37:00.000+03:00", "crawled": "2015-10-08T06:05:07.922+03:00", "highlightTitle": ""}