{"organizations": [], "uuid": "c06238acc8664aed955e35d46e50b9bf11ebf057", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestar.com", "main_image": "http://www.thestar.com/content/dam/thestar/sports/basketball/2015/10/22/nba-rolls-out-youth-program-rookie-division-as-basketball-takes-off-in-canada/youth-basketballjpg.jpg", "site_section": "http://www.thestar.com/sports/basketball.html", "section_title": "Basketball and NBA News | Sports | Toronto Star", "url": "http://www.thestar.com/sports/basketball/2015/10/22/nba-rolls-out-youth-program-rookie-division-as-basketball-takes-off-in-canada.html", "country": "CA", "title": "NBA rolls out youth program, ‘rookie division,’ as basketball takes off in Canada", "performance_score": 0, "site": "thestar.com", "participants_count": 1, "title_full": "NBA rolls out youth program, ‘rookie division,’ as basketball takes off in Canada | Toronto Star", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "c06238acc8664aed955e35d46e50b9bf11ebf057"}, "author": "Lori Ewing", "url": "http://www.thestar.com/sports/basketball/2015/10/22/nba-rolls-out-youth-program-rookie-division-as-basketball-takes-off-in-canada.html", "ord_in_thread": 0, "title": "NBA rolls out youth program, ‘rookie division,’ as basketball takes off in Canada", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "As the popularity of basketball continues to skyrocket in Canada, the NBA is bringing the game to younger children in this country.\nThe Jr. NBA launched its youth basketball program in Canada this week for children ages 14 and under, and the Jr. NBA “Rookie Division” for kids aged five to seven.\n“The average age that children start playing basketball in Canada is 8.6 years old, and that’s too old,” said Chris Piazza, the Jr. NBA co-ordinator with the West Island Lakers club in Montreal.\nThe program, which Piazza compared to TimBits Hockey, is expected to reach five million children within two years. The “Rookie Division” is being launched in 125 clubs, reaching about 5,000 children, across Canada, 125 chosen because it coincides with the 125th anniversary of the invention of the game by James Naismith.\nThe Jr. NBA in Canada, with BMO Financial Group as its founding partner, was developed with a team of experts in child development, “physical literacy,” and basketball fundamentals.\nThe Rookie Division features smaller balls, lowered hoops and modified games.\nCoaches are provided with a free starter kit that includes everything from cones and whistles to weekly practice plans with videos.\nPlayers are outfitted in NBA team jerseys.\n“One of the challenges of playing organized basketball at this age level is it’s kind of hard to play when you’re small, you’re talking about a game that has a 10-foot hoop and a big ball and lots of rules,” said Dan MacKenzie, NBA Canada’s vice-president and managing director.\n“So we really wanted to make the game simple, much more simplified for kids at that age level, and our thinking is if we can get young kids to pick up the game at a younger age level, there’s a better chance they’ll remain with us as they grow.”\nRaptors GM Masai Ujiri, along with reigning NBA MVP Stephen Curry and Academy Award-nominated director Spike Lee are among the members of the Jr. NBA Leadership Council.\nMacKenzie said it’s the perfect time to launch a program for very young kids, with the explosion of the game here, pointing to the 12 Canadians on NBA rosters last season — that record is expected to be broken this coming season — and the arrival of the NBA all-star game in Toronto in February.\nIt will be the first time the NBA all-star game will be played outside the U.S.\nDon Mattingly out as L.A. Dodgers manager after early bounce from playoffs", "external_links": ["http://static.freeskreen.com/publisher/52/freeskreen.min.js"], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-22T22:49:02.155+03:00", "highlightTitle": ""}