{"organizations": [], "uuid": "b6280407d8940855759b18faaf9e41c91b4b48c8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freep.com", "main_image": "http://www.gannett-cdn.com/-mm-/c6d3e4dded0fce2baaa0d92d362157c6a85195ed/c=0-90-960-630&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/24/DetroitFreePress/B9319408796Z.1_20151024223047_000_G97CBGPA2.1-0.jpg", "site_section": "http://rssfeeds.freep.com/freep/sports", "section_title": "Detroit Free Press - Sports", "url": "http://www.freep.com/story/sports/outdoors/2015/10/24/lydia-lohrer-duck-hunting/74570708/", "country": "US", "title": "Outdoors: Becky Campbell Brown gets women, family out into wild", "performance_score": 0, "site": "freep.com", "participants_count": 1, "title_full": "Outdoors: Becky Campbell Brown gets women, family out into wild", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T05:46:00.000+02:00", "replies_count": 0, "uuid": "b6280407d8940855759b18faaf9e41c91b4b48c8"}, "author": "freep.com", "url": "http://www.freep.com/story/sports/outdoors/2015/10/24/lydia-lohrer-duck-hunting/74570708/", "ord_in_thread": 0, "title": "Outdoors: Becky Campbell Brown gets women, family out into wild", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MORE \"I'm just a quack addict,\" laughed Becky Campbell Brown of Charlotte, one of the state's approximately 65,000 devoted duck hunters.\nWaterfowling requires dedication. Lugging decoys to lull wary wildlife to watery landings for safe haven, fighting mosquitoes and breaking ice are par for the course — not to mention learning to use calls to quack like a duck.\n\"You can tell if a duck is a male or female by its quack,\" explained Brown. \"Male mallards don't really quack, they make a different, raspy sound.\"\nThe number of duck hunters has steadily declined, but Brown is bucking the trend and adding to their numbers in any way she can.\nShe roped her husband and sons into waterfowl hunting years ago after becoming a hunter herself.\nHer own journey toward hunting was circuitous. She first attended a now-defunct Becoming an Outdoorswoman program (BOW).\nBOW was brought to this state by Nancy Thurston of the Ruffed Grouse Society in 1996. I co-piloted her efforts and the two of us ran a program teaching women everything from wild edibles to camping skills. The state eventually took it over as a DNR platform and thousands of women gained a nurturing environment to discover that hunting, fishing, camping and shooting was fun and good for the environment.\nSeveral years ago the DNR shut BOW down in the lower peninsula, where 97% of women in the state live. Also largely defunded was the National Wild Turkey Federation's Women in the Outdoors program, which Brown also attended.\nFortunately, Brown got the chance to explore her interests before bureaucrats began chipping away at the funding. Given that women are the fastest growing demographic in outdoor participation, they may have been shortsighted.\nBrown began with turkey hunting.\n\"I chose turkey hunting because my husband didn't do it and he couldn't tell me what to do,\" Brown laughed.\n\"I went on from there and met Jenny Olson, the host of Michigan-Out-of-Doors television. She invited me on a ladies-only goose hunt. I got totally hooked on waterfowl hunting. The sound of the feathers as they come over the top of you gets me every time.\n\"I became heavily involved in putting on ladies-only duck and goose hunts and took over as president of Delta Divas.\"\nOlson went along and filmed some of those hunts. The Divas, the only all-women's chapter of Delta Waterfowl, met once a year.\n\"We'd stay at a nicer hotel; after all, we are Divas,\" said Brown. \"We'd get together on a Friday and go over the rules of hunters' safety. On Saturday, we'd break up into groups and guides took us hunting.\"\nThey lunched together and then went out hunting again and . After the evening hunt, they shared stories. Then, the die-hard ladies would hunt again Sunday morning.\nThe goal was to get new women involved. At its peak, over 40 women were attending.\n\"I made friends I never would have. One lady in the group is in her 70s, and she lives in Detroit. She brings three coolers of food. She's not such a great shot, but no one cared. It's the camradarie, the social aspect of it that makes it even more appealing,\" said Brown.\nBut Brown understands the larger implications of her efforts. \"For every shotgun shell I buy — and I use tungsten and bismuth — a portion of that goes into restoring wetlands. So does the purchase of my federal duck stamp.\"\nA duck stamp is required for all waterfowl hunters, but they can also be purchased by non-hunters interested in contributing to conservation. 98% of the funds go directly toward protecting wetlands and creating bird habitat. The federal duck stamp funds the Federal Wildlife Refuge System (FWRS), which was created in response to a drought that created the dust bowl in the the 1930s.\nIt was duck hunters who helped restored the wetlands, via the FWRS as well as citizen-run duck hunting organizations such as Ducks Unlimited, whose earnings go towards wetlands, which are not only refuge for waterfowl but to endless other species. Local organizations such as the Michigan Duck Hunters' Association (among others) also contribute to the effort.\nFive years ago, hunting with the ladies just wasn't enough for Brown.\n\"I knew I had to pass this on as a family tradition,\" said Brown. \"I asked my husband, Steve, if he wanted to come with me. He had to borrow one of my shotguns.\"\nBrown shoots a Browning BPS, 20-gauge 24\" barrel. She lent her husband a 12-gauge. \"It was the way we celebrated our anniversary.\"\nThe following year, their boys — Campbell and Ben — were old enough to go. It's now an annual family vacation. \"I told them that from now on until the end of time they would have to tell their employers, girlfriends, spouses, that this is their weekend off for eternity,\" Brown said.\n\"I'm hoping they pay it forward and teach their own kids.\"\n\"For the sake of conservation, I wish they would think about bringing back women's programs,\" added Brown.\nIn the meantime, she isn't holding her breath, she's just enjoying the season: \"I am a total quack addict. I still do turkey hunt, but only because you can't hunt ducks in the spring.\"\nContact the author at lydiaoutdoors@gmail.com.\nLohrer wins Dodge sportsman award\nMeadow Brook Hall has named Free Press special writer Lydia Lohrer as the 2015 Dodge Sportsman Award recipient.\nThe esteemed award honors a man, woman or organization who, in the spirit of entrepreneurial American sportsmen John, Horace and Danny Dodge, has demonstrated outstanding contributions to Michigan's outdoor heritage, wildlife and habitat conservation and the promotion of hunting and fishing activities, ethics and education.\nLohrer's accomplishments span two decades and include writing columns for the Free Press and Michigan-Out-of-Doors magazine, hosting and producing a wildlife radio show for WJR-AM (760), and being the first female co-host of an internationally televised hunting show. Lohrer is is currently working on a book titled \"Rebooting America, Taking your kids from the Screen to the Green.\"\nOutpost\nFishery update!\nA special catch and delayed-release season for tournament anglers was declined last month during a Natural Resource Commission meeting.\nThe proposed season provoked tremendous controversy and commentary from anglers all over the country who voiced opposition to risking the world-class bass fishery by making nesting bass vulnerable to tournament fishing pressure.\n\"We unanimously determined it wasn't in the best interest of the fishery,\" said commission member Rex Schlaybaugh. \"There's a 22-year study out of Illinois from a U-M grad that says removing bass from their nests is detrimental in our climate. We acted in accordance with scientific guidelines, and stand by our decision.\n\"Our job is to protect the resource as well as provide fishing opportunity. We've pretty well done that by authorizing a Catch and Immediate Release (CIR) season on bass for everyone.\"\nThe Commision also adopted a system of mandatory bass tournament registration, allowing the DNR to improve its understanding of tournament efforts and provide additional biological information about fish caught and kept during tournaments.\nOther changes include one in the daily possession limit for pike on Lake St. Clair, St. Clair River and Detroit River — anglers can now take five.\nFor more infomation on these changes and other new regulations, go to michigan.gov/fishingguide .\nRecord bass\nGreg Gasiciel of Rhodes caught a new state-record smallmouth bass on Hubbard Lake.\nGasiciel, for his part, didn't have any idea it was a bass. \"I didn't even see the fish until I had been fighting it for at least 10 minutes. My buddy was thinking I might have foul-hooked a carp,\" said Gasiciel. \"I had no idea what it could be.\"\nIt turned out to be a state-record 9.33-pound smallmouth.\n\"We didn't win the tournament, but we got $110 for big fish,\" said Gasiciel. \"Once the taxidermist skins the fish, I will be giving it back to the DNR so that they can learn from it. We still don't know how old it is and what sex it is. ... I'm sure the DNR will let us know as soon as they find out.\"\nBased on growth charts, the fish would likely be at least 13 years old.", "external_links": ["http://links.govdelivery.com/track?type=click&enid=ZWFzPTEmbWFpbGluZ2lkPTIwMTUxMDA5LjUwMDg1NDAxJm1lc3NhZ2VpZD1NREItUFJELUJVTC0yMDE1MTAwOS41MDA4NTQwMSZkYXRhYmFzZWlkPTEwMDEmc2VyaWFsPTE2OTA3NjA0JmVtYWlsaWQ9bHlkaWFvdXRkb29yc0BnbWFpbC5jb20mdXNlcmlkPWx5ZGlhb3V0ZG9vcnNAZ21haWwuY29tJmZsPSZleHRyYT1NdWx0aXZhcmlhdGVJZD0mJiY=&&&106&&&http://www.michigan.gov/dnr/0,4570,7-153-10364_63235-274824--,00.html?source=govdelivery&utm_medium=email&utm_source=govdelivery"], "published": "2015-10-25T05:46:00.000+02:00", "crawled": "2015-10-26T00:19:09.125+02:00", "highlightTitle": ""}