{"organizations": ["City", "United", "Manchester"], "uuid": "dbf93161692345de78eeb0024bb7d2da38b2032b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pendletontimespost.com", "main_image": "", "site_section": "http://pendletontimespost.com//feed/sec/6000/", "section_title": "PendletonTimesPost.com - Sports News", "url": "http://www.pendletontimespost.com/view/story/265e085cf27a47b986c030081f24e3b2/SOC--English-Preview/", "country": "US", "title": "City still Manchester's dominant force ahead of 161st derby", "performance_score": 0, "site": "pendletontimespost.com", "participants_count": 0, "title_full": "City still Manchester's dominant force ahead of 161st derby", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T13:47:00.000+03:00", "replies_count": 0, "uuid": "dbf93161692345de78eeb0024bb7d2da38b2032b"}, "author": "", "url": "http://www.pendletontimespost.com/view/story/265e085cf27a47b986c030081f24e3b2/SOC--English-Preview/", "ord_in_thread": 0, "title": "City still Manchester's dominant force ahead of 161st derby", "locations": ["Manchester"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["STEVE DOUGLAS"], "text": "United, City meet for 161st Manchester derby, with blue half still the dominant force By STEVE DOUGLAS AP Sports Writer   6:46   6:47   \nPeople: \nUnited Kingdom (463) \n\nMANCHESTER, England — Louis van Gaal was careful to downplay talk of a permanent power shift in Manchester after United's 4-2 victory over City in the most recent derby game. \nOld Trafford was rocking that evening in April. After four straight losses to its neighbor, United finally owned local bragging rights. City was on a downward spiral — behind its neighbor in the standings, its title defense in tatters and with manager Manuel Pellegrini's job under serious pressure. \nBut Van Gaal wasn't getting carried away, and he was right. \nSince that painful loss six months ago, the blue half of Manchester has recovered to remain the dominant force in the city — as they have been since the end of Alex Ferguson's 26-year tenure at United in 2013. \nCity won six straight games after that derby to finish the Premier League nine points above United and in second place. \nAfter two months of this season, City is in first place, the top scorer in the division and the favorite to capture the title for the third time in five years. \nThe derby mauling in April seems a distant memory now as City heads back to Old Trafford on Sunday for the 161st Manchester derby, the headline game in the 10th round of Premier League fixtures. \nThe momentum seems to be with Pellegrini's men, who have won their last two league games 6-1 and 5-1. City also had the advantage of playing at home in the Champions League on Wednesday — beating Sevilla 2-1 — while United had to travel back from a game in Moscow on the same night. \nHowever, United is at home — where it is unbeaten this season and has won seven of eight games — and has the incentive of potentially going top of the league with a win. United is third, tied for points with second-place Arsenal but behind on goal difference. \nArsenal is at home to Everton on Saturday. \nHere are some things to know ahead of this weekend's games: \n'PERFECT' DE BRUYNE \nThe absence of striker Sergio Aguero and playmaker David Silva, who were injured during the recent international break, has robbed City of its two most influential attacking players for the derby. But in Kevin Bruyne, City has one of the most in-form players in the league, proving so far that he's worth the 55 million pounds ($85 million) the club spent to make him its record signing. \nPellegrini even called him the \"perfect\" signing after De Bruyne scored an injury-time winner against Sevilla on Wednesday. \nDe Bruyne has been rotating, with great effect, with Raheem Sterling for central or left-wing roles in City's attack in recent games. He is hard to pick up and his eye for a pass is arguably as good as Silva's. \nPellegrini's biggest call this weekend is whether to recall captain Vincent Kompany, or retain the center-back partnership of Nicolas Otamendi and Eliaquim Mangala. \nTRAVEL TIME \nUnited must make a 1,600-mile journey back from Moscow on Thursday after the 1-1 draw with CSKA in the Champions League, putting the team at a disadvantage ahead of the derby, according to Van Gaal. \n\"Manchester City don't have the travel we have so they have more rest,\" Van Gaal said. \"There is nothing you can do. They have the benefit.\" \nUnited is in mixed form heading into the weekend, having lost 3-0 to Arsenal and won 3-0 at Everton in its last two Premier League games. \nHAZARD WARNING \nIn the space of a few months, Eden Hazard has gone from being English football's players of the year and one of the most sought-after players in world football, to occupying the substitutes' bench at Chelsea. \nThe Belgium winger was left out of the starting team in Chelsea's last Premier League game, a 2-0 win over Aston Villa. He was back in the team for the Champions League draw at Dynamo Kiev on Tuesday after an injury to Pedro Rodriguez, but manager Jose Mourinho gave Hazard no guarantees that he'll stay a starter. \nMourinho was critical of Hazard's work rate during his first season back in charge at Chelsea. The forward appeared to work harder last season, leading Mourinho to compare Hazard favorably with Cristiano Ronaldo and Lionel Messi. \nAll content copyright ©2015 Pendleton Times-Post, a division of Home News Enterprises unless otherwise noted.", "external_links": [], "published": "2015-10-22T13:47:00.000+03:00", "crawled": "2015-10-22T15:06:09.309+03:00", "highlightTitle": ""}