{"organizations": ["PSG", "Parc des Princes", "Real Madrid"], "uuid": "6243ab6c668f67ffb89883701bea7bfa43a79eca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.sky.com", "main_image": "http://media.skynews.com/media/images/generated/2015/10/22/425494/default/v1/gettyimages-493617258-1-1600x900.jpg", "site_section": "http://feeds.skynews.com/feeds/rss/sports.xml", "section_title": "Sports News - Latest Sports and Football News | Sky News", "url": "http://news.sky.com/story/1574083", "country": "IL", "title": "PSG And Real Madrid Forced To Share Spoils", "performance_score": 0, "site": "sky.com", "participants_count": 0, "title_full": "PSG And Real Madrid Forced To Share Spoils", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T09:01:00.000+03:00", "replies_count": 0, "uuid": "6243ab6c668f67ffb89883701bea7bfa43a79eca"}, "author": "", "url": "http://news.sky.com/story/1574083", "ord_in_thread": 0, "title": "PSG And Real Madrid Forced To Share Spoils", "locations": ["Paris", "UK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PSG And Real Madrid Forced To Share Spoils 07:01, UK, Thursday 22 October 2015 Share by email Paris Saint-Germain and Real Madrid played out a disappointing goalless draw at the Parc des Princes as both sides remain unbeaten in Champions League Group A. \nNeither team deserved to take all three points on a night of few chances in the French capital, with young Real forward Jese having the best opening of the first half, only for the Spaniard's close-range shot to be well saved by Kevin Trapp in the PSG goal. \nMadrid frontman Cristiano Ronaldo had a brace of first-half headers that tested Trapp, as well as an effort that hit the outside of the post after the interval, while the closest the Ligue 1 champions came to scoring was when Uruguay international Edinson Cavani toe-poked Thiago Motta's left-wing cross inches past the post early in the second half. \nThereafter PSG boss Laurent Blanc and his Real counterpart Rafa Benitez both appeared to settle for a point apiece that keeps their sides at the top of the standings ahead of the return meeting at the Santiago Bernabeu in a fortnight's time. \nElsewhere in Group A, Swedish champions Malmo recorded their first win in this season's competition thanks to striker Markus Rosenberg's 17th-minute goal against Shakhtar Donetsk, a 1-0 victory that leaves the home side in third place in the standings, with Shakhtar pointless. \nHowever, Malmo could have won by an even bigger margin had Nikola Djurdjic's second-half penalty not been saved by Shakhtar goalkeeper Andriy Pyatov. \nWolfsburg remain in control of Group B after overcoming PSV Eindhoven 2-0 at the VfL Wolfsburg Arena, although the Bundesliga side needed second-half strikes from Bas Dost and Max Kruse, as well as a late penalty save by Diego Benaglio, to claim the spoils and move two points clear of Manchester United, who drew 1-1 with CSKA Moscow. \nElsewhere, Atletico Madrid moved level on points with Benfica at the top of Group C thanks to a comprehensive 4-0 win against Astana at the Vicente Calderon. \nThe La Liga side, who were runners up in the 2014 Champions League, led 2-0 at the break after goals from youngster Saul Niguez and Jackson Martinez, before Oliver Torres and a late Denys Dedechko own goal wrapped up the points for the hosts. \nHowever, group leaders Benfica went down 2-1 to Galatasaray in Istanbul, despite the Portuguese team taking a third-minute lead through Nicolas Gaitan's strike. \nThe home side responded in style through first captain Selcuk Inan's 19th-minute penalty and then Lukas Podolski's winner 12 minutes before half-time. \nJuventus have kept hold of top spot in Group D - a point ahead of second-placed Manchester City - despite only managing a goalless draw with Borussia Monchengladbach in Turin, with the visitors earning their first Champions League point in the process. Promoted Stories", "external_links": [], "published": "2015-10-22T09:01:00.000+03:00", "crawled": "2015-10-22T10:55:52.581+03:00", "highlightTitle": ""}