{"organizations": [], "uuid": "7961561a615580b141ffaf5cd0d086932d754759", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.indianapolisrecorder.com", "main_image": "http://bloximages.chicago2.vip.townnews.com/indianapolisrecorder.com/content/tncms/assets/v3/editorial/7/62/762204de-6885-11e5-b852-832f1739799b/560da91c60ae6.image.jpg", "site_section": "http://www.indianapolisrecorder.com//search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&nsa=eedition&c[]=sports,sports/*&f=rss", "section_title": "Indianapolis Recorder Newspaper - sports,sports/", "url": "http://www.indianapolisrecorder.com/sports/article_40de33ec-6885-11e5-8472-93ea62eb16c0.html", "country": "US", "title": "NFL makes rule changes", "performance_score": 0, "site": "indianapolisrecorder.com", "participants_count": 1, "title_full": "NFL makes rule changes", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T00:42:00.000+03:00", "replies_count": 0, "uuid": "7961561a615580b141ffaf5cd0d086932d754759"}, "author": "JESSICA R. KEY @QueenCuriosity3", "url": "http://www.indianapolisrecorder.com/sports/article_40de33ec-6885-11e5-8472-93ea62eb16c0.html", "ord_in_thread": 0, "title": "NFL makes rule changes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New NFL changes impact game Posted: Thursday, October 1, 2015 5:42 pm NFL makes rule changes By JESSICA R. KEY @QueenCuriosity3 Indianapolis Recorder | 0 comments Football is in full swing and fans are loving all of the nail-biting, action-packed games that have taken place thus far. While you are rooting for your favorite teams, take note that some of the rules of the game have changed. The National Football League (NFL) states their No. 1 priority is protecting players from risk while keeping the game fair, competitive and exciting. The NFL’s Competition Committee says it receives and considers input from teams before changing any rule, and the new changes are the result of hours of discussion and study. Following are new rules for the 2015-16 NFL season. The league has also emphasized points on several existing rules this season, although the rules themselves have not changed. Rule changes Defenseless player protections are expanded to the intended receiver of a pass following an interception or potential interception. A receiver who is clearly tracking the football and is in a defenseless posture will receive defenseless player protections. It will be a foul to hit this player forcibly in the head or neck area, or use the crown or hairline parts of the helmet. Violations result in a 15-yard penalty that will be enforced after the change of possession. Rules prohibiting illegal “peel back” blocks now extend to all offensive players. Before, the rule only applied to players who were in the tackle box at the snap. When approaching an opponent from the side, a blocker must get his near shoulder across the front of his body to legally block his opponent below the waist. It’s still legal to cut a defender, provided the blocker is moving toward his opponent’s end line. All chop blocks involving a back are eliminated to give defenders additional protection from low blocks. Any time a back is involved in a high/low block on a defender during a run, it is a foul for an illegal chop block. Before, on a running play, a player in the backfield could chop a defender who was engaged above the waist by another offensive player, if the contact occurred outside the normal position of the tight end. Any high/low block during a passing or kicking play has been and will continue to be illegal. Special teams changes The prohibition against pushing teammates into the offensive formation is extended to punt plays. Before, this rule only applied to field goals and extra point kick attempts. Violations result in a 15-yard penalty. The ball will now be snapped from the 15-yard line on extra point kick attempts. Two point-conversions will still be snapped from the 2-yard line. Also new in 2015, the defense will be able to return a blocked kick, interception or fumble for two points. Points of emphasis The league will continue to strictly enforce all rules that encourage player safety. The league’s emphasis on sportsmanship last season led to a decrease of fouls in this area. In 2015, the same emphasis will be placed on eliminating abusive, threatening or insulting language directed at opponents, teammates, coaches, officials or representatives of the league. Fighting is unacceptable and the league policy on fighting is clear. Any active participant in a fight will be penalized. Last season, there were several situations where players pulling opponents off a pile following a loose ball led to altercations. Pulling a player off a pile in an aggressive, forcible manner will result in a 15-yard penalty. For more information, visit NFL.com .", "external_links": [], "published": "2015-10-02T00:42:00.000+03:00", "crawled": "2015-10-03T01:52:22.470+03:00", "highlightTitle": ""}