{"organizations": [], "uuid": "537c63f7376f4b414eb5b324f23371bec33cb58d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestar.com", "main_image": "http://www.thestar.com/content/dam/thestar/news/federal-election/2015/10/13/conservative-candidates-say-liberal-party-would-mandate-brothels/prostitution.jpg", "site_section": "http://www.thestar.com/sports/baseball.html", "section_title": "Baseball and MLB News | Sports | Toronto Star", "url": "http://www.thestar.com/news/federal-election/2015/10/13/conservative-candidates-say-liberal-party-would-mandate-brothels.html", "country": "CA", "title": "Conservative candidates say Liberal Party would mandate brothels", "performance_score": 1, "site": "thestar.com", "participants_count": 1, "title_full": "Conservative candidates say Liberal Party would mandate brothels | Toronto Star", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "537c63f7376f4b414eb5b324f23371bec33cb58d"}, "author": "Robin Levinson King", "url": "http://www.thestar.com/news/federal-election/2015/10/13/conservative-candidates-say-liberal-party-would-mandate-brothels.html", "ord_in_thread": 0, "title": "Conservative candidates say Liberal Party would mandate brothels", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Conservative party’s latest attack line: A vote for the Liberal party is a vote to “legalize the selling of women in Canada.”\nOakville Conservative candidate Terence Young attacked the Liberal party’s stance on prostitution during a candidates debate at the Oakville Chamber of Commerce last week.\nYoung, who has served as an MP in the riding since 2008, was a member of the Standing Committee on the Status of Women for the past two years.\n“Do you want communities in Oakville that are quiet and safe?” he asked. “Or communities where a federal Liberal government mandates legally protected brothels with madams and all that goes with that because the Liberals have promised to legalize the selling of women in Canada?”\nYoung is not the only Conservative who has followed this line of reasoning. In late September, News 1130 reported that Conservative candidate Jason Kenney said something very similar during a press conference in Vancouver.\n“He wants to force communities to accept brothels,” News 1130 reported Kenney said. “We don’t think the values of most Canadians include having to put up with heroin injection sites imposed on their communities against their will, or to have brothels operating in their neighbourhoods against their will.”\nLiberal Leader Justin Trudeau voted against the Conservatives’ Bill C-36 in the fall of 2014, which outlawed buying sex.\nAna Curic, a spokesperson for Kenney’s campaign, wrote in an email that “the Liberal Party of Canada opposed this legislation, and has consistently opposed legislation that would ban such exploitative business practices.\n“In practical terms, the Liberal position is to legalize the operation of brothels in Canada,” she said.\nA spokesperson from Young’s campaign could not be immediately reached.\nNowhere in the Liberal party’s platform does it call for legalizing brothels. Trudeau has been critical of the current laws but cautious about coming out in favour of legalizing prostitution, telling CTV that he would support “evidence-based policy.”\n“The Supreme Court has said the framework that existed was not protecting vulnerable people and women from violence and that is the lens we need to look through as we move forward on this difficult issue,” he told CTV.\nMore on thestar.com\nLiberals widen gap over Tories, EKOS poll shows\nProsecutor says hospital clerk should go to jail", "external_links": ["http://static.freeskreen.com/publisher/52/freeskreen.min.js", "http://www.ctvnews.ca/video?clipId=523766&playlistId=1.2171793&binId=1.810401&playlistPageNum=1&binPageNum=1"], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-14T05:49:40.955+03:00", "highlightTitle": ""}