{"organizations": ["Emi Bowers"], "uuid": "17f7b8adb1bc54ab288ce4a6e5c1f94607f03f42", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thenews-messenger.com", "main_image": "http://www.gannett-cdn.com/-mm-/23adf6f6964415e58a11f8d272a6b1b9dbee8e6a/c=0-67-668-443&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/15/Fremont/B9319273769Z.1_20151015234317_000_GTHC8HHL3.1-0.jpg", "site_section": "http://rssfeeds.thenews-messenger.com/fremont/sports", "section_title": "Fremont - Sports", "url": "http://www.thenews-messenger.com/story/sports/high-school/2015/10/15/clyde-seniors-ready-state-tennis/74032226/", "country": "US", "title": "Clyde seniors ready for state tennis", "performance_score": 0, "site": "thenews-messenger.com", "participants_count": 0, "title_full": "Clyde seniors ready for state tennis", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T06:43:00.000+03:00", "replies_count": 0, "uuid": "17f7b8adb1bc54ab288ce4a6e5c1f94607f03f42"}, "author": "", "url": "http://www.thenews-messenger.com/story/sports/high-school/2015/10/15/clyde-seniors-ready-state-tennis/74032226/", "ord_in_thread": 0, "title": "Clyde seniors ready for state tennis", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Andrea Nearhood", "Josh Morgret", "Rich McGowan", "Joshua Morgret"], "text": "Clyde seniors ready for state tennis Joshua Morgret 11:43 p.m. EDT October 15, 2015 The Clyde doubles team of Emi Bowers, left, and Andrea Nearhood, right, will represent the Fliers in the Division II state tennis tournament, starting Friday. (Photo: Photos by Josh Morgret, Illustration by Rich McGowan) CONNECT TWEET LINKEDIN COMMENT EMAIL MORE \nWhile the storybook ending is not completely finished, the story and season for Clyde seniors Emi Bowers and Andrea Nearhood is being written in fine order. \nThe pair have qualified for the Division II state tournament that begins Friday at the Lindner Family Tennis Center near Cincinnati. The first and second rounds will be played on Friday while the semifinals and finals are set for Saturday. \n“We are very excited for the girls to have made the state tournament,” 26th-year Clyde coach Jeff MacFarland said. “It’s a culmination of their four years in the program. They’ve been a mainstay for Clyde tennis. This is the pinacle for their high school careers.” \nThe duo will face juniors Catherine Areklett and Annika Aebker of Hathaway Brown. The two are the defending state runners-up last season in Division II. \n“They’re tough,” MacFarland said. “This is their third year in a row at state.” \nWhile MacFarland was coaching Amanda Cahill and Lexi Weber at the 2013 state championship most recently for Clyde, Areklett and Aebker qualified as freshmen but lost their first match. \nFor the duo of Bowers and Nearhood, who will take a 20-4 record into the tournament, it’s about four years of hard working paying off. \n“It’s pretty exciting,” Bowers said. “This was a goal of ours at the beginning of the season.” \nBoth girls mentioned a loss to Port Clinton early in the season was a motivation. It was the team’s only loss in Sandusky Bay Conference action and only loss until a team district tournament loss to Lexington on Tuesday. \n“The second time we played Port Clinton, we weren’t going to let a second loss happen,” Bowers said. \nBowers and Nearhood acknowledged Bowers almost always serves first for the team at the beginning of the match. Bowers has the stronger forehand, thus playing the forehand side while Nearhood has the stronger backhand, thus taking the backhand side during a match. \nMacFarland says both girls have led by example, playing singles when being forced to, while also teaming to form the best doubles team in the area. \n“They work hard during practice, whether Andrea was playing first singles or Emi was at second or even third singles,” he said. “Their willingness to go back and forth helped with the whole team and made the season easier.” \nAfter a pep rally on Thursday at 11:30, the girls will make the two-plus hour trek down to Cincinnati in preperation for Friday’s matches. \n“This week is going by so slow,” Bowers said. “But we’re excited.” \nBowers and Nearhood fell one match short of qualifying for the state tournament last year, something they did their best to avoid this season. \n“We were so close last year and we didn’t want to have that happen again,” Nearhood said. “We hope to play our best matches of the year.” \nThe Lindner Family Tennis Center is located at 5460 Courseview Drive in Mason. Should weather affect play, fans should visit www.ohsaa.org for locations of the indoor facilities in Cincinnati where play will resume. Read or Share this story: http://ohne.ws/1LwJf8a TOP VIDEOS", "external_links": [], "published": "2015-10-16T06:43:00.000+03:00", "crawled": "2015-10-16T17:19:15.004+03:00", "highlightTitle": ""}