{"organizations": ["Gresham Facebook Email Twitter Google", "Gresham Nate Hanson", "West Coast League"], "uuid": "ec3a4eb77e8f42eb46a33f5ed6899a9495cb1e13", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kgw.com", "main_image": "http://cdn.tegna-tv.com/-mm-/9177043cd029836e1dad2b74552c6484bcfcdae0/r=x633&amp;c=1200x630/http/www.gannett-cdn.com/-mm-/eeb4abac180da0cd4ac611400c549f1f3adc57ab/c=147-0-705-315/local/-/media/2015/03/10/KGW/KGW/635616036547201006-great-west-league-baseball-generic.jpg", "site_section": "http://rssfeeds.kgw.com/_/20/110550102/kgw/sports", "section_title": "KGW - Sports", "url": "http://www.kgw.com/story/sports/2015/10/22/new-baseball-team-coming-gresham/74431986/", "country": "US", "title": "New baseball team coming to Gresham", "performance_score": 0, "site": "kgw.com", "participants_count": 0, "title_full": "New baseball team coming to Gresham", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T04:35:00.000+03:00", "replies_count": 0, "uuid": "ec3a4eb77e8f42eb46a33f5ed6899a9495cb1e13"}, "author": "", "url": "http://www.kgw.com/story/sports/2015/10/22/new-baseball-team-coming-gresham/74431986/", "ord_in_thread": 0, "title": "New baseball team coming to Gresham", "locations": ["Gresham"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Facebook Email Twitter Google+ LinkedIn Pinterest New baseball team coming to Gresham The team will be affiliated with the West Coast League, a Northwest summer wood bat league for college-eligible players. Post to Facebook New baseball team coming to Gresham The team will be affiliated with the West Coast League, a Northwest summer wood bat league for college-eligible players. Check out this story on KGW.com: http://on.kgw.com/1LQkO5Q Cancel Send A link has been sent to your friend's email address. Posted! A link has been posted to your Facebook feed. Join the Conversation To find out more about Facebook commenting please read the Conversation Guidelines and FAQs New baseball team coming to Gresham Nate Hanson, KGW.com Staff 6:35 p.m. PDT October 22, 2015 A baseball diamond. CONNECT 2 TWEET LINKEDIN COMMENT EMAIL MORE \nGRESHAM, Ore. – A new baseball team is coming to Gresham next summer. \nThe team will be affiliated with the West Coast League, a Northwest summer wood bat league for college-eligible players. \nGresham Mayor Shane Bemis and West Coast League President Dennis Koho made the announcement at Mt. Hood Community College, where the team will play its first season. \n“We are proud to welcome the West Coast League to Gresham,” Bemis said. “This league will bring a fun and affordable family-friendly activity to our community and I am excited to see kids and families at the games cheering on Gresham’s team.” \nGresham joins Corvallis, Bend and Klamath Falls as the four Oregon teams in the 12-team league. The other teams are in Washington and British Columbia. \nThe team will be owned by Jerry and Lisa Walker, who were the driving force behind the building of Volcanoes Stadium, home of the Salem-Keizer Volcanoes, the single-A affiliate of the San Francisco Giants. \n“Lisa and I join the entire WCL, City of Gresham, Mt. Hood Community College and area fans in celebrating this next chapter in community-based, family-friendly, championship caliber baseball,” Jerry Walker said. \nThe team’s nickname and mascot will be determined through a community-wide contest. Fans can submit suggestions by email to greshamwclbaseball@gmail.com . \nTop local headlines:", "external_links": [], "published": "2015-10-23T04:35:00.000+03:00", "crawled": "2015-10-23T06:54:15.006+03:00", "highlightTitle": ""}