{"organizations": ["Milwaukee King", "WIAA"], "uuid": "299e03139e7340ec31f169e6b422bef5341882df", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jsonline.com", "main_image": "http://media.jrn.com/images/js-for-social-200-final.jpg", "site_section": "http://www.jsonline.com/rss?c=y&path=%2Fsports%2Ftopstories", "section_title": "JSOnline.com HL - Sports Top Stories", "url": "http://www.jsonline.com/sports/preps/milwaukee-king-earns-no-2-seed-in-bracket-b99597668z1-333727651.html", "country": "US", "title": "Milwaukee King earns No. 2 seed in bracket", "performance_score": 0, "site": "jsonline.com", "participants_count": 0, "title_full": "Milwaukee King earns No. 2 seed in bracket", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T06:16:00.000+03:00", "replies_count": 0, "uuid": "299e03139e7340ec31f169e6b422bef5341882df"}, "author": "", "url": "http://www.jsonline.com/sports/preps/milwaukee-king-earns-no-2-seed-in-bracket-b99597668z1-333727651.html", "ord_in_thread": 0, "title": "Milwaukee King earns No. 2 seed in bracket", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mark Stewart"], "text": "Milwaukee King earns No. 2 seed in bracket By Mark Stewart of the Journal Sentinel Oct. 17, 2015 10:14 p.m. WIAA football playoff pairings | Oct. 17, 2015 10:13 p.m. \nThere was a breakthrough in the short history of coaches seeding the WIAA football playoffs. \nMilwaukee King became the first City Conference champion to earn a seed better than five when it received the No. 2 seed in Group B of the Division 1 bracket on Saturday. The Generals (9-0, 6-0 Blackbourn Division) will face Milwaukee Washington at Custer Stadium at 7 p.m. Friday. \nKing beat Washington, 36-0, Sept. 17. \nLast year, King also went undefeated in the regular season, but was seeded fifth. It went on to beat Menomonee Falls on the road for the school's first playoff victory since 1996. This year, the Generals have received more respect than past seasons, earning the No. 10 ranking in the wissports.net Division 1 state poll for the final two weeks of the season. \nWhile past success may have helped King's seeding this year, its grouping surely played a part as well. In 2014, King was placed in a portion of the bracket that included Arrowhead and Muskego, two of the Classic 8's four co-champions, Mukwonago, which finished one game out of first in that league, and Falls, the runner-up in the Greater Metro. \nThis year, King's quarter of the bracket included four other City Conference teams plus Fond du Lac, which received the No. 1 seed, and Marquette and Neenah, which are seeded third and fourth, respectively. \nCoaches have seeded the playoffs since 2012. \n\"We feel pretty good,\" King coach Tom Wozniak said Thursday after his team closed the regular season with a 38-15 victory over Milwaukee Riverside. \"The game is going to speed up a little bit in the playoffs, so we've got to make adjustments for that. But obviously there is a lot of confidence on our sideline. We're looking forward to it.\" \nOther impressions of the bracket. \n■ When the City Conference added three teams this season, there was some question of how that would affect the playoff field. Two more City teams qualified for the playoff this season compared to last, 8-6. \nDid the league's growth help boost its postseason presence? Not if you look at the past few seasons. The City's postseason presence has fluctuated from six to eight teams the past four years with eight teams making the field in 2013 and seven making it in 2011. The conference had 11 teams in those seasons compared to 14 this year. \n■ The coaches appeared to value conference standing above head-to-head results or results against common opponents when it came to seeding this year. \nIn Group B of Division 2, Greater Metro outright champion Brookfield Central received the No. 1 seed ahead of Homestead. Central's only loss came in Week 1 to Whitefish Bay, a team Homestead, a two-loss team with setbacks to Arrowhead and Germantown, beat, 35-13, in Week 8. \nIn Group C of Division 1, undefeated Oconomowoc received the No. 1 seed. The No. 2 seed came down to Middleton and Arrowhead, two 8-1 teams. Middleton received the nod in a decision that could be viewed as voters in the grouping rewarding an outright conference champion, or voters in that bracket giving a conference rival the benefit of the doubt. Six of the eight teams in the grouping were from the Big 8. \n■ Best portion of a bracket? The vote here goes to Group B of Division 2. \nIf you base your picks on who beat who, you'll find yourself in a tangled mess. In a rematch of a Week 4 showdown, Homestead gets a another crack at Germantown, the last team to defeat it. A Level 2 matchup could pair North Shore co-champion Whitefish Bay with Brookfield Central, which would give Central a chance to avenge a 35-14 loss it suffered to Bay in Week 1. \n■ Most anticipated game? Franklin and Muskego are on a collision course to meet in a Division 1 Level 3 showdown that would pit the two teams that will finish the regular season ranked 1-2 in the Journal Sentinel area rankings. \n■ Six teams qualified with sub .500 conference records: Division 1 — Janesville Parker, Madison East; Division 3 — Delavan-Darien, Onalaska; Division 4 — Somerset; Division 5 — Ladysmith. © 2015 , Journal Sentinel Inc. All rights reserved. About Mark Stewart", "external_links": [], "published": "2015-10-18T06:16:00.000+03:00", "crawled": "2015-10-18T06:43:03.842+03:00", "highlightTitle": ""}