{"organizations": [], "uuid": "78a6863fdea29ec10abfa8f6233b4cf59b55cd4d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "accesswdun.com", "main_image": "http://images.accesswdun.com/uploads/articles/2015/344249/kurt-busch-10-21_p3.jpg", "site_section": "http://accesswdun.com/rss/3/rss.xml", "section_title": "AccessWDUN.com Sports", "url": "http://accesswdun.com/article/2015/10/344249/kurt-busch-stays-at-shr-adds-monster-as-sponsor", "country": "US", "title": "Kurt Busch stays at SHR, adds Monster as sponsor", "performance_score": 0, "site": "accesswdun.com", "participants_count": 1, "title_full": "Kurt Busch stays at SHR, adds Monster as sponsor", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T04:19:00.000+03:00", "replies_count": 0, "uuid": "78a6863fdea29ec10abfa8f6233b4cf59b55cd4d"}, "author": "Pete McCole", "url": "http://accesswdun.com/article/2015/10/344249/kurt-busch-stays-at-shr-adds-monster-as-sponsor", "ord_in_thread": 0, "title": "Kurt Busch stays at SHR, adds Monster as sponsor", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Thursday October 22nd, 2015 1:44PM 5:22AM ( 8 hours ago ) News Alert Posted 8:19PM on Wednesday 21st October 2015 ( 17 hours ago ) Kurt Busch stays at SHR, adds Monster as sponsor +1 By Pete McCole Stewart-Haas Racing announced that Kurt Busch has be resigned to a multi-year contract, with Monster Energy comign onboard as a co-sponsor of his No. 41 Chevrolet. Photo: Mike Mercurio Related Articles VIDEO: Joey Logano, Kyle Busch leave Kansas victorious Coby sweeps Thompson to win third Whelen Mod title Earnhardt must win Talladega after rough Kansas race Post Race Notes: Cut tire spoils run for Austin Dillon \nStewart-Haas Racing announced Wednesday they have signed driver Kurt Busch to a multi-year contract extension and will bring on Monster Energy as co-primary sponsor on Busch’s No. 41 Chevrolet SS. \nMonster Energy will join Haas Automation as co-primary sponsor on the hood of the car for 17 races, on the quarter panel for 18 races, and one race as sole primary sponsor in 2016. Monster will also serve as primary sponsor of the car for the Sprint Cup race at Martinsville Speedway on November 1. \n“It’s a tremendous day,” said Busch. “Very excited to partner up again with Stewart-Haas Racing and to announce a contract extension and to be able to have Monster Energy come onboard. \n“It creates this element of championship form right from the get-go with two brands such as that. For me to have the opportunity to drive, I feel very blessed and privileged to have this opportunity.” \nBusch, the 2004 Sprint Cup Champion, will be entering his third year with SHR in 2016, joining Kevin Harvick, Danica Patrick and team co-owner Tony Stewart, who will running his final year of Sprint Cup competition. \n“Since Kurt has been onboard, he’s probably the one guy I’ve leaned on the most,” said Stewart. “When it comes to the race weekends, our setups are closest alike. I really lean on Kurt for information. \n“We’ve been able to communicate so well as far as the feel of the car. Somebody I really like and believe in as a driver. He’s a guy you can take anywhere, any track, at any time and he can win races.” \nMonster Energy has been a long-time sponsor of both Kurt and his brother Kyle Busch in the Xfinity Series with Kyle’s own team as well as Joe Gibbs Racing. Kurt Busch gave Monster Energy their first win in the Xfinity Series back in 2012. \n“Kurt has made himself part of the family and one way to put it is Kurt Busch has earned our business,” said Mitch Covington, vice president of sports marketing for Monster Energy. “He’s a super driver and off the track Kurt’s been a super professional guy for Monster Energy. I can’t say enough good things about Kurt and Kyle. Both of the Busch brothers have been great for business for Monster.” \nWhere today’s announcement will leave Monster’s current relationship with Joe Gibbs Racing and Kyle Busch is unclear, as Covington was non-committal about their future involvement with the team. \n“Our relationship with Joe (Gibbs) will continue,” said Covington. “NASCAR has treated Monster well, and we hope to continue running up front.” \n“Winning is in Monster’s DNA. To go to podiums and to be on top and hoisting up the trophies, and that’s what they got over the years (in the Xfinity Series),” said Busch. “Now there’s this opportunity to share a co-primary NASCAR Sprint Cup car and to be able to do it on Sundays and help Monster’s brand continue to grow. They received what they wanted from Xfinity and now they want to come to Sprint Cup and I’m happy to have this opportunity and this platform to do that.” \nBusch is currently third in the Chase for the Sprint Cup standings having won two races during the season, despite missing the first three races after NASCAR suspended him amid allegations of domestic abuse. \nBusch was eventually cleared of those charges, but many wondered if the stigma from his legal affairs would prevent him from ever landing a major sponsor. \nBusch, however, had such no doubts, and now has a legitimate shot at winning his second Sprint Cup title. \n“I never wavered,” said Busch. “I felt like the truth would be told. If I stayed focused in the car that every time I put the visor down that’s my safe haven, that’s my comfort zone and that’s where I able to do my best to be able enjoy it out there and that’s what Stewart-Haas enabled me to do. They limited certain things that helped me focus on the cars and it was great to have the family-type support and have everyone rally around the 41 car. \n“The championship is right there in front of us. The way that 2015 came together, I would call it an absolute success. We’re in this Chase and we’re championship-eligible right now, it’s the best feeling ever.” Associated Categories : Sports , NASCAR News, Sprint Cup Associated Tags : nascar, motorsports, Auto Racing, Stock Car, Asphalt, Sprint Cup Series, Motorsports Live On WDUN, Chase for the Sprint Cup © Copyright 2015 AccessWDUN.com", "external_links": [], "published": "2015-10-22T04:19:00.000+03:00", "crawled": "2015-10-22T20:47:05.380+03:00", "highlightTitle": ""}