{"organizations": ["Yosemite Hospitality", "Park Service", "U.S. Court of Federal Claims", "The National Park Service", "Yosemite Inc.", "Tuolumne Meadows Lodge", "Aramark", "Yosemite Lodge", "LLC", "High Sierra Camps", "NPS", "Wawona Hotel", "National Park Service", "Delaware North Companies", "DNC Parks"], "uuid": "2f9bc5726edfc4d3a453a3c10ad9c601459b5fc6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.uniondemocrat.com", "main_image": "", "site_section": "http://feeds.feedburner.com/UnionDemocrat", "section_title": "The Union Democrat, Sonora, CA News, Sports, & Weather", "url": "http://www.uniondemocrat.com/index.php?option=com_content&task=view&id=117795&Itemid=199", "country": "US", "title": "Park Service inks 15-year deal with new concessionaire", "performance_score": 0, "site": "uniondemocrat.com", "participants_count": 0, "title_full": "Park Service inks 15-year deal with new concessionaire", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T04:00:00.000+03:00", "replies_count": 0, "uuid": "2f9bc5726edfc4d3a453a3c10ad9c601459b5fc6"}, "author": "", "url": "http://www.uniondemocrat.com/index.php?option=com_content&task=view&id=117795&Itemid=199", "ord_in_thread": 0, "title": "Park Service inks 15-year deal with new concessionaire", "locations": ["United States", "Lake Mead", "Glen Canyon", "Mesa Verde", "Delaware North", "Curry Village"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Don Neubacher", "Bruce W. Fears", "Glacier Bay", "Denali", "Delaware North", "Alex MacLean"], "text": "Park Service inks 15-year deal with new concessionaire Park Service inks 15-year deal with new concessionaire By Alex MacLean, The Union Democrat October 09, 2015 01:00 am The National Park Service has officially signed a 15-year contract valued at $2 billion for operating lodging and food operations in Yosemite National Park to the Philadelphia-based hospitality giant Aramark. Yosemite Hospitality, LLC, a subsidiary of Aramark, will take over as the main concession operator in the world-famous park beginning March 1, 2016, according to a press release Wednesday. The park service announced it had formally offered the contract to Aramark in June. “The National Park Service looks forward to a successful relationship with Yosemite Hospitality,” Yosemite National Park Superintendent Don Neubacher said in the written announcement. Current concessionaire DNC Parks and Resorts at Yosemite Inc., a subsidiary of the New York-based Delaware North Companies, which has held the concession contract in Yosemite since 1993, is suing the United States government over the rights to iconic names such as the Ahwahnee Hotel, Curry Village and Badger Pass. The lawsuit, filed last month in the U.S. Court of Federal Claims, alleges the park service should have required Aramark to purchase the rights to the names valued at $51 million from Delaware North as part of the terms of the new concessions contract. Delaware North claims it purchased the names from the previous concessionaire under its original contract with the park service under the promise that it would be compensated if the contract changed hands. “We are now confused and disheartened the NPS seems unwilling to honor its contractual obligation by failing to require the new (concessionaire) to buy and pay fair value for the assets that we use to operate Yosemite,” Delaware North said in a written statement last month. The deadline for the government to file a response to the lawsuit is Nov. 16. Despite the lawsuit, Delaware North has vowed to ensure a smooth transition next year when the Aramark subsidiary takes over. The contract includes the operation of 17 retail stores, 12 lodging properties and 14 food and beverage service locations. Yosemite Hospitality will pay a franchise fee of 11.75 percent of gross receipts under the new contract, 80 percent of which will directly support improvements to visitor facilities and park operations. Popular visitor services will continue at the Ahwahnee Hotel, Glacier Point, Yosemite Lodge, Wawona Hotel, Tuolumne Meadows Lodge, High Sierra Camps and Curry Village. Activities such as ice skating, skiing, bicycle rentals, shuttle service and raft rentals will also continue under the new contract. Major conservation measures will be implemented by the new concessionaire, including installing water- and energy-saving fixtures throughout lodging and employee housing areas. Yosemite Hospitality has also agreed to upgrade room furniture and amenities at the Ahwahnee Hotel, Curry Village and Wawona Hotel. The new concessionaire will also make improvements to food and beverage services, including “enhanced menus embracing healthy food options,” according to the park service. “We are excited to be working with the National Park Service, Bruce W. Fears, president of Aramark’s leisure division, said in a written statement. “We are also looking forward to working with the community and developing partnerships with local businesses.” Aramark earned gross revenues of $14.8 billion in the 2014 fiscal year and has 270,000 employees in 21 countries. The company holds park service contracts in Lake Mead, Mesa Verde, Glen Canyon, Olympic, Denali and Glacier Bay.  ", "external_links": [], "published": "2015-10-09T04:00:00.000+03:00", "crawled": "2015-10-10T08:03:31.930+03:00", "highlightTitle": ""}