{"organizations": [], "uuid": "47811bcb0275c31057877304a9c8b4adeb81b012", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thenewstribune.com", "main_image": "http://www.thenewstribune.com/static/images/thenewstribune/facebook.jpg", "site_section": "http://www.thenewstribune.com/sports/college/pac-12/university-of-washington/?widgetName=rssfeed&widgetContentId=712015&getXmlFeed=true", "section_title": "University of Washington sports news | TheNewsTribune.com &", "url": "http://www.thenewstribune.com/sports/college/pac-12/university-of-washington/article38923785.html", "country": "US", "title": "Huskies coach Chris Petersen says Ducks still plenty dangerous", "performance_score": 0, "site": "thenewstribune.com", "participants_count": 1, "title_full": "Huskies coach Chris Petersen says Ducks still plenty dangerous", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T19:18:00.000+03:00", "replies_count": 0, "uuid": "47811bcb0275c31057877304a9c8b4adeb81b012"}, "author": "Christian Caple \nStaff writer", "url": "http://www.thenewstribune.com/sports/college/pac-12/university-of-washington/article38923785.html", "ord_in_thread": 0, "title": "Huskies coach Chris Petersen says Ducks still plenty dangerous", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Huskies coach Chris Petersen says Ducks still plenty dangerous \nBy Christian Caple SEATTLE \nWatching the Oregon Ducks limp to a 3-3 record begets an obvious conclusion for most observers: \nThese are not the same high-powered, dominant Ducks who racked up lopsided scores while winning 11 or more games in each of the past five seasons. Their three losses already equal their most in a season since 2009 — and they’ve already lost twice at Autzen Stadium, including a 45-38 double-overtime defeat to Washington State on Saturday — and a tangible belief exists that Oregon’s headiest days are behind it. \nUnless you ask Washington Huskies coach Chris Petersen, whose team hosts Oregon at 7:30 p.m. Saturday. \n“You put them on (film) and you watch them and you say, ‘Oh, this is the Oregon team that we’ve seen for a long time,’ ” Petersen said at his press conference Monday. “They do some very, very good things. And if our team for one second thinks this is like a different Oregon program, yeah, I know what’ll happen, and it won’t be good.” \nWashington, fresh off a 17-12 upset victory over then-No. 17 USC, is currently favored over the Ducks by 1 1/2 points. But the Huskies have little reason for cockiness — they have, after all, lost their past 11 games against Oregon, a losing streak that dates to 2003 and is a particularly sore subject among UW fans who remember when beating their rival was an expectation. \nAnd the Ducks haven’t lost all of their offensive luster. Sophomore tailback Royce Freeman is one of the Pac-12’s best players, rushing for 859 yards and nine touchdowns in six games. \nIt’s not clear who Oregon will start at quarterback. The Ducks have rotated between Jeff Lockie and Taylor Alie — neither of whom has been particularly effective — since a broken finger sidelined Eastern Washington transfer Vernon Adams. \nAdams is seemingly closer to returning — he warmed up prior to Oregon’s game last week — but the Ducks remain tight-lipped about his status. \nPetersen said if he had to guess, he thinks Adams will play. It would be Adams’ second game at Husky Stadium in as many seasons — he threw for 475 yards and seven touchdowns in a 59-52 UW victory over EWU last season. \nMight Petersen peek at that game film? \n“Nah, I don’t need to peek at that. I remember it very clearly,” Petersen said. “There’s no need to peek at it.” Petersen on Sark \nJust hours before USC announced the firing of coach Steve Sarkisian, who coached at UW from 2009-13, Petersen was asked his reaction to Sarkisian being placed on a leave of absence Sunday following reports that he showed up intoxicated to a team meeting. \nPetersen responded: “I don’t know everything that’s gone on down there. I’ve heard a few things. And I think half the time everybody piles on and doesn’t really know the full story. I think this is a tough job and you just feel bad for the whole situation, for everybody. … It’s a hard enough job when you’re doing well. And then (when) something doesn’t go right in your situation and then everybody piles on, I think it’s very tough. Everybody’s got their opinion now and I don’t think everybody knows exactly everything that goes on to have an opinion like that.” \nUW athletic director Scott Woodward declined interview requests, but issued a statement that read: “It is evident that Steve is dealing with a serious personal matter and we wish him the best in facing whatever challenges lay ahead.” Feeney honored \nHuskies linebacker Travis Feeney was voted Pac-12 defensive player of the week after recording seven tackles, 3.5 tackles for loss and 2.5 sacks in UW’s victory at USC. \nPetersen said UW’s own defensive player of the week honor, however, went to sophomore cornerback Darren Gardenhire, who recorded his second interception of the season on USC’s first possession. Stanford kickoff time \nWashington’s Oct. 24 game at Stanford has been scheduled for a 7:30 p.m. kickoff. The game will be televised on ESPN.", "external_links": [], "published": "2015-10-13T19:18:00.000+03:00", "crawled": "2015-10-14T15:28:25.067+03:00", "highlightTitle": ""}