{"organizations": [], "uuid": "07e13bdbb7e829bef3d0007399773f050b9cc1ac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kctv5.com", "main_image": "http://images.worldnow.com/AP/images/8999162_G.jpg", "site_section": "http://kctv5.com//category/208603/sports?clienttype=rss", "section_title": "KCTV Kansas City - Sports", "url": "http://www.kctv5.com/story/30242524/usc-fires-steve-sarkisian-1-day-after-putting-coach-on-leave", "country": "US", "title": "USC fires Steve Sarkisian 1 day after putting coach on leave", "performance_score": 0, "site": "kctv5.com", "participants_count": 1, "title_full": "USC fires Steve Sarkisian 1 day after putting coach on leave - KCTV5", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "07e13bdbb7e829bef3d0007399773f050b9cc1ac"}, "author": "cbs8", "url": "http://www.kctv5.com/story/30242524/usc-fires-steve-sarkisian-1-day-after-putting-coach-on-leave", "ord_in_thread": 0, "title": "USC fires Steve Sarkisian 1 day after putting coach on leave", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By GREG BEACHAM\nAP Sports Writer LOS ANGELES (AP) - Southern California fired Steve Sarkisian on Monday, one day after the troubled football coach was put on leave.\nAthletic director Pat Haden made the move one day after determining Sarkisian showed up at school in no condition to lead practice, although Haden refused to reveal specifics about the coach's condition. Offensive coordinator Clay Helton was appointed interim coach Sunday.\nUSC hasn't elaborated on Sarkisian's problems, but the second-year coach had an embarrassing public display in August at a pep rally where he appeared to be intoxicated while giving a speech. Sarkisian later apologized and said he had combined alcohol and medication, but promised not to drink again during the season.\n\"After careful consideration of what is in the best interest of the university and our student-athletes, I have made the decision to terminate Steve Sarkisian, effective immediately,\" Haden said in a statement.\n\"I want to add how proud I am of our coaching staff and players and the way they are responding to this difficult situation. Through all of this we remain concerned for Steve and hope that it will give him the opportunity to focus on his personal well-being.\"\nHelton, Sarkisian's offensive coordinator, will officially lead his first practice Tuesday as the Trojans (3-2, 1-2 Pac-12) prepare for their annual rivalry game at No. 14 Notre Dame.\nSarkisian went 12-6 at USC, where he was an assistant coach under Pete Carroll with the program's dominant teams of the past decade. He spent five years as Washington's head coach until 2013.\nThe 41-year-old Sarkisian also is in the midst of a divorce from his wife, Stephanie, and he recently sold a palatial house south of Los Angeles. They have three children.\nThe hallowed USC football program has endured turmoil for most of the past six years since Carroll left the school for the NFL's Seattle Seahawks in 2009.\nThe well-liked Haden, a former USC quarterback, is facing increasing public condemnation for his oversight of the entire athletic program, but particularly a venerable football program in upheaval for yet another season.\nAfter the tumultuous 3½-year tenure of fired coach Lane Kiffin, Sarkisian and his players have made several public missteps during his short tenure. Sarkisian's coaching also faced widespread scrutiny after a 17-12 loss to Washington last week dropped the preseason No. 8 team out of the AP Top 25.\nSarkisian's former colleagues and opponents offered words of compassion and encouragement Monday after he began his leave. The school hasn't said whether Sarkisian is seeking treatment.\n\"It breaks my heart to see how this has gone,\" Carroll said on 710 ESPN radio in Seattle. \"But he recognizes it, and he's going to do something about it, so this is the day the turn occurs. I'm grateful for everybody around him that he's finally figured it out. We'll see nothing but good stuff to happen. It's going to take a long time, it's a big battle, and we'll pull for him all the way.\"\nSarkisian never faced significant public scrutiny for alcohol use in Seattle, although his enthusiasm for nights out became part of his identity among fans and media.\nWashington athletic director Scott Woodward issued a brief statement: \"It is evident that Steve is dealing with a serious personal matter and we wish him the best in facing whatever challenges lay ahead.\"\nChris Petersen was a candidate for the USC job won by Sarkisian, and the former Boise State coach replaced Sarkisian at Washington shortly afterward. Petersen's unranked Huskies then beat USC in the coaches' first meeting last Thursday.\n\"This is a tough job,\" Petersen said Monday. \"You just feel bad for the whole situation for everybody. We could talk a long time about that. It's hard enough to lose. It's a hard enough job when you're doing well, and when something doesn't go right in your situation and everybody piles on, I think it's very tough. Everybody has got their opinion now, and I don't think everybody knows exactly everything that goes on to have an opinion like that.\"\nThe talent-rich, well-funded USC football program has been roiling in trouble ever since a lengthy NCAA investigation of extra benefits given to Heisman Trophy-winning tailback Reggie Bush neared a conclusion six years ago.\nAfter Carroll jumped to the NFL, former athletic director Mike Garrett hired Kiffin away from Tennessee shortly before the NCAA hit USC with heavy sanctions that included three years of scholarship reductions.\nThe imperious Kiffin created or endured numerous controversies before getting fired by Haden at the airport after a game in 2013. Most of Kiffin's woes were confined to embarrassing gamesmanship, such as players switching jersey numbers during a game and a student manager underinflating footballs.\nThe Trojans then had four head coaches in 2013, with interim coach Ed Orgeron quitting in protest after Sarkisian was hired over him. Helton coached the Las Vegas Bowl and then joined Sarkisian's staff.\nEver since Sarkisian's arrival, the Trojans seemingly can't get through a month without some sort of drama - some of it having nothing to do with the coach.\nSenior cornerback Josh Shaw bizarrely concocted a heroic story about getting injured while saving a child from drowning, only to be suspended for most of last season after confessing the lie. Haden made headlines early last season by going down to the sideline to yell at officials during a game at Stanford at Sarkisian's request.\nSarkisian's behavior at the Salute to Troy pep rally in August was an embarrassment, but the coach appeared to move past it in September after a contrite public statement.\nBut then the losing started: Stanford racked up 41 points while beating then-No. 6 USC at the Coliseum last month, and Sarkisian's offense was terrible against the Huskies.\n___\nAP Sports Writer Tim Booth in Seattle contributed to this report.\nCopyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-13T01:28:06.241+03:00", "highlightTitle": ""}