{"organizations": [], "uuid": "f426155f652c2602cc1d23fedced155c845e15a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattlepi.com", "main_image": "http://ww1.hdnux.com/photos/41/41/75/8789852/13/rawImage.jpg", "site_section": "http://www.seattlepi.com/photos/", "section_title": "Photos of Seattle, U.S. and World News, Sports, Life and More - seattlepi.com", "url": "http://www.seattlepi.com/cars/article/The-self-driving-Tesla-has-arrived-6571098.php", "country": "US", "title": "The self-driving Tesla has arrived", "performance_score": 0, "site": "seattlepi.com", "participants_count": 1, "title_full": "The self-driving Tesla has arrived - seattlepi.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "f426155f652c2602cc1d23fedced155c845e15a7"}, "author": "David R. Baker", "url": "http://www.seattlepi.com/cars/article/The-self-driving-Tesla-has-arrived-6571098.php", "ord_in_thread": 0, "title": "The self-driving Tesla has arrived", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Video: Video: Tesla autopilot Come Thursday morning, thousands of Tesla electric cars already sitting in garages and driveways will abruptly gain the ability to drive themselves. Within limits, anyway.\nTesla Motors on Thursday will finally roll out its long-awaited Autopilot system, capable of steering cars at freeway speed, changing lanes and slamming the brakes to avoid collision.\nAll Tesla Model S sedans made since September of 2014, as well as the company’s new Model X SUVs, come equipped with the camera, radar and ultrasonic sensors needed to make the system work. But Tesla has continued testing and refining the software until now. The Autopilot software will be installed via a wireless update between Wednesday evening and Thursday morning. Drivers must pay a one-time fee of $2,500 to use it.\n“This is going to be quite a profound experience for people when they do it,” Tesla CEO Elon Musk said Wednesday. “It’s going to change people’s perception of the future, quite rapidly.”\nThe system marks Tesla’s first major foray into the race to develop self-driving cars.\nRelated Stories Tesla: News crew tried to run over Gigafactory guards Toyota teases the Mirai with 'Back to the Future' video While Google has developed an autonomous prototype car that needs no input from its passengers, Tesla’s Autopilot functions more like a highly evolved version of cruise control. It can take over for a driver on the highway, steering through curves on its own, monitoring surrounding cars and adjusting speed as needed.\nAnd while drivers don’t need to keep their hands on the wheel non-stop, Autopilot won’t let them completely tune out. Take your hands off for more than 10 seconds, and a soft chime will remind you to put them back on. While Google may be aiming for cars that do all of the driving themselves, Tesla wants its drivers to pay attention.\n“Over time, there will not be a need to have your hands on the wheel in the long term,” Musk said. “But in the short term, we want people to exercise caution, because this is new.”\nPhoto: James Tensuan Reporter David Baker takes his hands off the steering wheel as the Tesla drives in autopilot in Palo Alto, Calif. on Wednesday, Oct. 14, 2015. An update to Tesla's Autopilot system will aide drivers in changing lanes, parking and steering. Reporter David Baker takes his hands off the steering wheel as the... The system can work on major city arteries, at least those with clearly marked lanes, but it isn’t designed for neighborhood streets. And the technology is still evolving. Rain, fog or snow can hamper the car’s ability to see the road and follow lanes.\nBut the cars using Autopilot will all share information with each other about the roads and streets they travel, adding details about the positioning and width of lanes. The system, Musk said, will work better and better over time.\n“The whole Tesla fleet operates as a network,” he said. “When one car learns something, they all learn it..”\nDavid R. Baker is a San Francisco Chronicle staff writer. E-mail: dbaker@sfchronicle.com Twitter:@DavidBakerSF", "external_links": ["http://ww1.hdnux.com/photos/41/42/00/8790072/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/41/41/75/8789852/13/920x1240.jpg", "http://ww1.hdnux.com/photos/16/02/73/3682028/5/square_gallery_thumb.jpg"], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-16T16:54:40.661+03:00", "highlightTitle": ""}