{"organizations": [], "uuid": "9fcc341fb68b2ac1a55baf28a44c540173b485f4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.philly.com", "main_image": "http://media.philly.com/images/3+x+2+Hillary+Clinton+Getty.jpg", "site_section": "http://www.philly.com/", "section_title": "Philadelphia local news, sports, jobs, cars, homes - Philly.com", "url": "http://www.philly.com/philly/opinion/20151023_Hillary__Public_enemy_No__1.html", "country": "US", "title": "Hillary: Public enemy No. 1", "performance_score": 0, "site": "philly.com", "participants_count": 1, "title_full": "Hillary: Public enemy No. 1", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "9fcc341fb68b2ac1a55baf28a44c540173b485f4"}, "author": "Christine M. Flowers,", "url": "http://www.philly.com/philly/opinion/20151023_Hillary__Public_enemy_No__1.html", "ord_in_thread": 0, "title": "Hillary: Public enemy No. 1", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I CAN PINPOINT the precise moment when I realized that Hillary Clinton was as toxic as one of those old Superfund waste sites and needed to be eliminated from the political landscape so she'd stop leaching poison into the groundwater: about three-quarters of the way through the Democratic debate. Anderson Cooper (or one of the other indistinguishable CNN moderators) asked her which enemy she was proudest of making. I envisioned Monica Lewinsky, Kathleen Willey, Paula Jones and Gennifer Flowers jumping up and down in their own private living rooms saying, \"Pick me, pick me!\" But Hillary knows better than to acknowledge that the only woman her husband didn't have sex with was her (Chelsea being the Arkansas version of the virgin birth).\nNo, the current Democratic front-runner with the newly ironed-out forehead threw in a couple of expected and innocuous things like Islamic terrorists, but then lobbed fire at her real target: Republicans.\nThat's right, folks, the woman who wants to be president of all Americans made sure to let us know that she considers members of the other main political party in this two party system \"enemies.\" And it's fairly clear from her past pronouncements that it's not just registered Republicans who make her stomach turn and her trigger finger itchy. Hillary hates all conservatives, charter members of the vast right-wing conspiracy that forced her husband to be serviced in the Oval Office and then lie about it.\nHillary's supporters dismiss the whole \"Bill Had Sex and Hillary Looked the Other Way\" argument as ancient history, and it kind of is. In fact, Bill has rebranded himself as a lovable elder statesman who can reach across the aisle (which he does quite well since he has a lot of experience reaching for things).\nMore coverage Democrats to stay on Benghazi panel — for now AP Fact Check: 11 hours is lots of time for dubious claims Clinton revels in signs that Dems are coalescing around her But Hillary is an angry woman, scarred by past criticism and with a taste for vengeance that makes Michael Corleone look like Pope Francis. She does not forget even the slightest offense, and stores it away in that ENIAC mind of hers until it can be downloaded and used to take out the enemy. And believe me, the opposition carries the same passport that she does.\nBasically, it amounts to anyone who stands in her way to the White House. Hillary and her minions, wandering in the electoral desert these last eight years (after having snatched defeat from the jaws of Hope and Change) have had a lot of time to figure out a comeback strategy. Becoming secretary of state, one who presided over the murder of an ambassador and four Americans who tried to save him, was an unfortunate yet insignificant detour in the master plan. As I watched her respond to questioning from members of the congressional committee investigating Benghazi, she seemed almost annoyed that people were still interested in the death of Ambassador Stevens. You could see the thought bubble appear above her head: \"Really, don't you people have some Planned Parenthood clinics you need to bomb?\"\nAnd speaking of bombs, she had no clear answer for Rep. Susan Brooks, who wanted to know why there wasn't a single email to Clinton telling her about an explosive device that had gone off at the embassy in Libya in 2012. She said \"I didn't have a computer in my office.\" Um, OK. Doesn't sound like a leader to me. But wait, there's always the lady card to play.\nHere's how it goes:\n\"You got your first black president. You'll get your first gay president. But now it's time for your first woman president. Not just any woman, mind you. Carly Fiorina isn't a real lady. She opposes abortion rights. And we already got rid of that raving maniac from the tundra, so you can't fall for just any pretty face. It's all about me!\"\nThe narrative starts with how Hillary was a crusading first lady in the mold of Eleanor Roosevelt, except the only thing they have in common is a philandering husband. Then, we're reminded of her years as a senator from New York, a place she lived in long enough to buy a gym membership and qualify for residence. She had a few uneventful years there, managing to look moderate in a state where Lenin would be considered right of center. And then, when she lost out on the presidency to that flashy young whippersnapper, she accepted the consolation prize at State.\nBut now, it's show time. We're supposed to accept the fact that it's a good thing to have a female president. One who says all the right things about reproductive freedom and the war on women. One who conflates the defunding of Planned Parenthood and other fiscally and socially conservative moves as an act of terror. One who looks at Republicans and sees ISIS.\nThis, for me, is why Hillary must be stopped. Anyone who thinks she can lead a country where she's essentially declared war against half of its population is one butterfly ballot short of a scandal. She shouldn't be allowed to speak universally for women, that incredibly diverse and complex demographic that has at one end Mother Theresa and at the other the Kardashians (and lately, a Caitlyn).\nI'm all for a female president, one who represents my beliefs or at least respects them. I was raised by nuns, and think that any one of them could do a better job running the country than our last three leaders. But Hillary Clinton has proven that she is incapable of embracing differences of opinion. Like the Amazons, those first wave feminists, she demands total allegiance.\nWell, here's another Flowers who ain't on board with the plan.\nChristine Flowers is a lawyer.\nEmail: cflowers@gmail.com", "external_links": [], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-24T15:19:28.628+03:00", "highlightTitle": ""}