{"organizations": [], "uuid": "e6603101a8544aaa3cd0087269759e90b91b2c18", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/himachal/kullu-dasehra-to-be-a-starry-affair/148938.html", "country": "US", "title": "Kullu Dasehra to be a starry affair", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "Kullu Dasehra to be a starry affair", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "e6603101a8544aaa3cd0087269759e90b91b2c18"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/himachal/kullu-dasehra-to-be-a-starry-affair/148938.html", "ord_in_thread": 0, "title": "Kullu Dasehra to be a starry affair", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Abhinav Vashisht\nKullu, October 21\nNational and international folk dancers and Bollywood singers are all set to enthral the audience during the week-long International Kullu Dussehra festival which begins tomorrow. Governor Acharya Devvrat will inaugurate the festival, while Chief Minister Virbhadra Singh will be the chief guest on the closing ceremony on October 28. Deputy Commissioner Rakesh Kanwar said the celebrations would start after a traditional and colourful rath yatra of Lord Raghunath, chief deity of the district. He said invitations had been sent to about 290 local deities. Chief Minister Virbhadra Singh would flag off the “Pride of Kullu”, a Natti dance to be performed by over 12,000 participants at Rath Ground on October 26, the DC added. The DC said the Chief Minister would unfurl the 100-ft-high National Flag, inaugurate Dev Sangrahalaya, launch a website on Dasehra, release documentary on litterateur Moulu Ram Thakur, lay foundation stones of a parking at Kala Kendra, indoor sports complex, parking complex of the MC, school and hostel for visually challenged children and a police station building. He would inaugurate polytechnic building at Seobag and new block of Government Senior Secondary School at Haripur and release three books on Kullu during his three-day visit during the festival. He said Cabinet Ministers Vidya Stokes, Kaul Singh Thakur, Anil Sharma, GS Bali and Thakur Singh Bharmouri would be chief guests during cultural events to be held daily at the Kala Kendra. The DC said folk dancers from West Bengal, Assam, Madhya Pradesh, Gujarat, Bihar, Rajasthan, Chhattisgarh, Jharkhand, Goa, Uttrakhand, Maharashtra, Andhra Pradesh and Orissa would perform. Special performances by the Prasidha Foundation, the Sutradhar Group, local artists and school students would be held. Lamas of Kee Monastery, Spiti, would perform mask dance, he said. International cultural groups from Russia, Kirgizstan, Portugal, Sri Lanka, Indonesia, Bali Islands, Taiwan and Nepal would perform, he added. Star artistes, including Dr Mamta Joshi, would perform on October 22, Miss Pooja on October 23, Kshitij Tare on October 24, Dev Negi on October 25, Master Saleem on October 26 and Kumar Sanu on October 27. Thakur Dass Rathi, Narender Thakur, Pinki Bhandari, Ramesh Thakur and others would perform during Himachali Nite. Also performances by Himachali Bands— Laman Band and Rio Nissi Band – would be held.Superintendent of Police (SP) Padam Chand said the security had been beefed up and the entire arrangements were being monitored by Ajay Yadav, IGP, Central Range, Mandi. The SP said about 1,600 police personnel, including nearly 550 home guards, would be deployed during the festival. A strict vigil would be maintained by over 50 CCTV cameras placed between Bajaura, gateway of the district, and Ramshila, he said. The town had been segregated into 11 sectors to be looked after by a DSP-rank official, he said. The Dasehra festival was started during the regime of Raja Jagat Singh who ruled Kullu from 1637 to 1672.", "external_links": [], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-22T04:07:38.285+03:00", "highlightTitle": ""}