{"organizations": [], "uuid": "950820e768dd51b3affaacb6db5b86c113e729f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattletimes.com", "main_image": "http://www.seattletimes.com/wp-content/themes/st_refresh/img/st-meta-facebook.png", "site_section": "http://www.seattletimes.com/sports/feed/", "section_title": "The Seattle Times » Sections » Sports", "url": "http://www.seattletimes.com/sports/seahawks/rookie-thomas-rawls-physical-running-style-a-good-fit-in-seahawks-offense/", "country": "US", "title": "Rookie Thomas Rawls’ physical running style a good fit in Seahawks’ offense", "performance_score": 0, "site": "seattletimes.com", "participants_count": 1, "title_full": "Rookie Thomas Rawls’ physical running style a good fit in Seahawks’ offense", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T03:04:00.000+03:00", "replies_count": 0, "uuid": "950820e768dd51b3affaacb6db5b86c113e729f0"}, "author": "Bob Condotta", "url": "http://www.seattletimes.com/sports/seahawks/rookie-thomas-rawls-physical-running-style-a-good-fit-in-seahawks-offense/", "ord_in_thread": 0, "title": "Rookie Thomas Rawls’ physical running style a good fit in Seahawks’ offense", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Seahawks rookie Thomas Rawls overcame obstacles on way to NFL Originally published October 2, 2015 at 5:04 pm Updated October 2, 2015 at 5:06 pm Rawls could replace Marshawn Lynch in the Seahawks’ starting lineup, should Lynch’s troublesome hamstring prevent him from playing Monday night against the Detroit Lions at CenturyLink Field. \nRENTON — The instant he heard Thomas Rawls had signed with the Seahawks, two words came to the mind of Gino Guidugli, his position coach at Central Michigan: perfect match. \nRawls revived his career at Central Michigan after three years at Michigan. He also acquired a nickname from teammates based on his resemblance to a certain NFL running back — ‘’Beast Mode.’’ \nIt sounds almost too convenient of a story now that Rawls is in position to replace the real Beast Mode, Marshawn Lynch, should Lynch’s troublesome hamstring prevent him from playing Monday night against the Detroit Lions at CenturyLink Field. \nBut Guidugli swears it’s true — after his Central Michigan teammates got a look at the 5-foot-9, 215-pound Rawls they began calling him “Beast Mode.’’ Most Read Stories Unlimited Digital Access. $1 for 4 weeks. \n“He’s the most physical runner I have ever seen,’’ Guidugli said. “I think the thing that separates him from a lot of other backs is his balance. When he gets contact his ability to keep his feet and keep going forward is unparalleled.’’ \nSeahawks fans got their first glimpse of that Sunday when Rawls filled for an injured Lynch and gained 104 yards, becoming the first Seahawks running back other than Lynch to top 100 yards since Robert Turbin in 2012. \nAnd like Guidugli, Seattle coach Pete Carroll was similarly impressed with Rawls’ ability to keep moving forward. \n“Just look at the first run he broke out, right in front of our bench,’’ Carroll said, referring to a 21-yarder in the third quarter. “He took a couple of guys on and went after it. That’s built into him.’’ \nIndeed, Rawls had a lot of experience busting through obstacles — some self-imposed — on his way to the NFL. \nRawls grew up in the hardscrabble town of Flint, Mich., where he emerged as one of the state’s top running backs as a senior at Flint Northern High in 2010. He had 396 yards in one game to break the city single-game record held by 2009 Heisman Trophy winner Mark Ingram. \nCentral Michigan was one of three schools to offer him a scholarship — the others were Toledo and Cincinnati — until shortly before signing day when Michigan and new coach Brady Hoke swooped in. Also on the Michigan staff was running-backs coach Fred Jackson, the father of Fred Jackson Jr., the coach at Rawls’ high school. \nThat made it seem like, well, a perfect match. \nBut Rawls’ time in Ann Arbor was as rocky as it was for Hoke, who was fired last season. Rawls was gone by then. \nAs a junior in 2013, Rawls had just three carries for 12 yards, all against Central Michigan. He spent the rest of the year buried on the bench, and after the season he decided to transfer, having rushed for just 333 yards in his Michigan career, placing one of his first calls to Central and Guidugli. \nAsked why things didn’t work at Michigan, Rawls said, “Things happen. I don’t regret it. I grew up a Michigan fan and loved my time there, but I moved on from it.’’ \nRawls wanted to play immediately after leaving Ann Arbor, which required him to get his degree from Michigan, which in turn required him to take, he said, 32 credits in the spring and summer of 2014. Michigan, though, wouldn’t let Rawls use its facilities to work out. So in between classes, Rawls had to find open fields and work out on his own to stay in shape. \n“It was a difficult time,’’ he said. “But my faith in God and my family kept me strong and just knowing that I’ve got a lot of pride in myself and just everything that I’ve been through my whole life. I always fought through adversity.’’ \nMore came after he appeared to be settling in nicely at Central, rushing for 283 yards in the first two games. He was then held out of two games after it was learned that he was facing three felony-larceny charges for an incident the previous April when he and two others were accused of stealing a woman’s purse from a casino. He later pleaded guilty to a misdemeanor charge of attempted larceny from a building and was sentenced to 104 hours of community service. \nGuidugli said of that incident that Rawls “got caught in a circumstance he didn’t belong in and really had to take the fall for a lot of people. He grew from that experience and handled it the best he could, and that’s not a reflection on who Thomas Rawls is as a person, that’s for sure.’’ \nRawls came back to rush for 1,103 yards at Central. Still, the larceny charge lingered over Rawls as the NFL draft approached. \n“I knew the legal deal was going to put some red flags on him,’’ Guidugli said. But he also says that whichever team took a chance on Rawls “I knew was going to get an extreme steal.’’ \nCarroll said this week of Rawls that after watching his film that his style was one that “I liked it more than anybody I saw in the draft.’’ \nThe Seahawks, though, gambled that he would fall out of the draft and that they could then sign him as a free agent. \nThat’s what happened, with Rawls saying he picked the Seahawks out “a lot’’ of other offers, in part because they didn’t draft a running back and he thought the style of play fit him well. \nHe did enough in the preseason to convince the team to trade Christine Michael to Dallas at the roster cutdown to 53. \nOn Sunday, Rawls validated the decision, also reaffirming what he always knew about himself. \n“I’ve always had confidence,’’ he said. “I never lacked it. But it (his game against the Bears) did kind of help me gain a little bit more. I’m a rookie on paper. At the end of the day, I put on pads just like the veteran guys.’’ Bob Condotta: 206-515-5699 or bcondotta@seattletimes.com . On Twitter @bcondotta .", "external_links": [], "published": "2015-10-03T03:04:00.000+03:00", "crawled": "2015-10-03T03:09:32.855+03:00", "highlightTitle": ""}