{"organizations": ["Athletics", "Associated Press", "San Jose", "Supreme Court"], "uuid": "406bebe353a2544ca726d5b5bacbd70762228a91", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.whio.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2014/08/21/cc/0a/WHIO_Facebook_Icon.png", "site_section": "http://www.whio.com/feeds/categories/sports/", "section_title": "News | Sports", "url": "http://www.whio.com/ap/ap/top-news/supreme-court-rejects-san-jose-appeal-over-athleti/nntyj/", "country": "US", "title": "Supreme Court rejects San Jose appeal over Athletics' move", "performance_score": 0, "site": "whio.com", "participants_count": 0, "title_full": "Supreme Court rejects San Jose appeal over Athletics' move", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T00:33:00.000+03:00", "replies_count": 0, "uuid": "406bebe353a2544ca726d5b5bacbd70762228a91"}, "author": "", "url": "http://www.whio.com/ap/ap/top-news/supreme-court-rejects-san-jose-appeal-over-athleti/nntyj/", "ord_in_thread": 0, "title": "Supreme Court rejects San Jose appeal over Athletics' move", "locations": ["OAKLAND", "Calif."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["San Jose"], "text": "Updated: 5:33 p.m. Monday, Oct. 5, 2015 | Posted: 5:33 p.m. Monday, Oct. 5, 2015 Supreme Court rejects San Jose appeal over Athletics' move Sponsored Links The Associated Press OAKLAND, Calif. — \nThe Supreme Court rejected an appeal from San Jose in the northern California city's bid to lure baseball's Athletics from Oakland. \nThe justices on Monday left in place lower court rulings that dismissed the city's antitrust claims against Major League Baseball, which blocked the Athletics' contemplated move to San Jose. \nSan Jose sued MLB in June 2013 for conspiring to block the relocation. San Jose is in Santa Clara County, part of the San Francisco Giants' territory under MLB's constitution. The city said the territory rules violated federal antitrust laws. Baseball has been exempt from antitrust laws since a 1922 Supreme Court decision. \n\"The court's decision, while significant, has no impact on our intense and unwavering focus on solving our ballpark issue and providing A's fans the first-class experience they deserve,\" A's owner Lew Wolff said in a statement. \nWolff has been committed to building a new ballpark and leaving the rundown Oakland Coliseum. The A's averaged 21,829 fans a game this year, 27th among the 30 big league teams. \n\"Listen, it'd be great to have a new facility,\" said Billy Beane, the A's executive vice president of baseball operations. \"The facts are the facts. We do our best with what we have.\" \nMajor League Baseball declined to comment on the court's decision. \nSan Jose Mayor Sam Liccardo suggested the city was moving on without the A's and a new stadium close to downtown and would turn its attention to developing the areas. \n\"We knew going into this litigation that getting a hearing before the U.S. Supreme Court would be a long shot — the Court hears only a couple dozen out of the more than 2,000 petitions it receives each year,\" Liccardo said. \nLiccardo noted that the city didn't spend any money on legal fees fighting the issue in court. Private lawyers who represented the city were to get paid only if they won in court. \nOakland shortstop Marcus Semien, for one, didn't mind. He grew up in the East Bay in nearby El Cerrito. \n\"That's great. This is where I grew up,\" he said Monday while cleaning out his locker at the Oakland Coliseum. \"I grew up here in the East Bay and feel this is home. This is home for the A's.\" \nThe case is San Jose v. Major League Baseball, 14-1252. \n___ \nAssociated Press writers Paul J. Elias and Mark Sherman contributed to this report. Copyright The Associated Press Sign up for our WHIO-TV Daily Headlines Newsletter Sign Up", "external_links": [], "published": "2015-10-06T00:33:00.000+03:00", "crawled": "2015-10-06T01:05:54.912+03:00", "highlightTitle": ""}