{"organizations": [], "uuid": "3c79dc9c1716999a562d7617d6d24b5b1d09eaa0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.hometownlife.com", "main_image": "http://www.gannett-cdn.com/-mm-/920f7c0c6be9b77e0ad16b69312ed6d5de84eb92/c=0-0-3136-1772&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/07/MIGroup/Livonia/635797795635753813-Nehasil.jpg", "site_section": "http://rssfeeds.hometownlife.com/livonia/sports", "section_title": "Livonia - Sports", "url": "http://www.hometownlife.com/story/sports/high-school/livonia/2015/10/07/franklin-and-churchill-football-preview/73500058/", "country": "US", "title": "FOOTBALL PREVIEW: Stakes are high in Franklin-Churchill showdown", "performance_score": 0, "site": "hometownlife.com", "participants_count": 0, "title_full": "FOOTBALL PREVIEW: Stakes are high in Franklin-Churchill showdown", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T13:09:00.000+03:00", "replies_count": 0, "uuid": "3c79dc9c1716999a562d7617d6d24b5b1d09eaa0"}, "author": "", "url": "http://www.hometownlife.com/story/sports/high-school/livonia/2015/10/07/franklin-and-churchill-football-preview/73500058/", "ord_in_thread": 0, "title": "FOOTBALL PREVIEW: Stakes are high in Franklin-Churchill showdown", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Rob Erwin", "Franklin", "Chris Nehasil"], "text": "FOOTBALL PREVIEW: Stakes are high in Franklin-Churchill showdown FOOTBALL PREVIEW: Stakes are high in Franklin-Churchill showdown Post to Facebook FOOTBALL PREVIEW: Stakes are high in Franklin-Churchill showdown FOOTBALL PREVIEW: Stakes are high in Franklin-Churchill showdown  //www.hometownlife.com/story/sports/high-school/livonia/2015/10/07/franklin-and-churchill-football-preview/73500058/   Join the Conversation To   FOOTBALL PREVIEW: Stakes are high in Franklin-Churchill showdown Ed Wright 6:09 a.m. EDT October 8, 2015 Franklin's Chris Nehasil follows Rob Erwin through a hole during a game earlier this season. (Photo: ED WRIGHT) 10 CONNECT 1 TWEET LINKEDIN COMMENT EMAIL MORE \nGiven their history, proximity and tradition, the Churchill and Franklin football teams could both be 0-6 and the air would still be thick with intensity once Friday's game kicks off at 7 p.m. at Franklin. \nSince both teams are in the midst of promising seasons – the Chargers are 4-2 and 3-1 in the KLAA South Division and just one game out of first place, while the Patriots are 3-3 overall and 2-2, respectively – and battling fiercely for the six wins that will earn them post-season berths, the atmosphere will be nothing short of electric for this week's rivalry showdown. \nBoth rivals enter Friday's game with tons of momentum following convincing homecoming-night victories. Churchill upended previously-unbeaten Canton, 33-14, while the Patriots buried Wayne Memorial, 30-6. \n\"It's been a couple years since we've beaten Churchill, so the boys are very focused and working extremely hard,\" said Franklin head coach Chris Kelbert. \"I love the way this team competes. The kids are giving it everything they have on every play, which is something we haven't had the past couple years.\" \nA victory over Franklin combined with a Canton triumph over Plymouth would put the Chargers in the hunt for a division title. \n\"We have quite a few goals that should motivate us,\" said Churchill head coach Bill DeFillippo. \"Obviously, we're always fired up when we play Franklin, but we can also earn a share of the division title if we win and Canton beats Plymouth, and we still need two wins to qualify for the playoffs.\" \nBoth head coaches admitted they have their work cut out for them Friday night when their teams square off against a quality opponent. \nChurchill junior quarterback Evan Cummins has emerged as a running and passing threat for the Chargers. (Photo: JON VESPAZIANI) \n\"Churchill has a very athletic team,\" said Kelbert. \"Their linemen are athletic, their skill-position players are athletic. Our biggest challenge will be to contain them.\" \n\"They're a much-improved team,\" DeFillippo said of the Patriots. \"They're a lot like us in that they're a blue-collar, hard-nosed team that likes to play physical.\" \nBoth teams are strong at the all-important quarterback position. Franklin senior Denzel Adams and Churchill junior Evan Cummins can beat opposing defenses with their arm or their feet. \n\"Their quarterback might be the best athlete in our division,\" DeFillippo said of Adams. \"He scares you because you can do everything right defensively, but with his escapability, he can still make a big play out of nothing. \n\"Evan has gotten better each week for us. He has all the tools you want in a quarterback. He had quite a few turnovers early in the season, some of them due to his lack of varsity experience. But his decision-making has been excellent the past couple of games and we haven't been turning the ball over, which is huge.\" \n\"Denzel's biggest improvement has been with his passing, which means defense have to play us honestly,\" Kelbert said. \"If they stack the box to stop the run, he can beat you throwing the ball. \n\"Churchill's quarterback is the one who makes their offense go. Like Denzel, he's a good runner, but he'll make you pay with his arm if you pay too much attention to stopping the run.\" \nThe Chargers have owned the series in recent years, having won four straight games against the Patriots dating back to a 12-7 win in 2011. \nPrior to that stretch, Franklin had won six straight games from 2005-10 against their rivals. \nHeading into Friday's match-up, Churchill has outscored its six foes, 184-106, while the Patriots have tallied 223 points and given up 165. \newright@hometownlife.com 10 CONNECT 1 TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http://www.hometownlife.com/story/sports/high-school/livonia/2015/10/07/franklin-and-churchill-football-preview/73500058/ TOP VIDEOS", "external_links": [], "published": "2015-10-08T13:09:00.000+03:00", "crawled": "2015-10-09T08:38:38.825+03:00", "highlightTitle": ""}