{"organizations": ["YHOO", "Carmen Lehman"], "uuid": "4f6fa853b901ed2810da49864dec7550d1e10f88", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneyflowindex.org", "main_image": "", "site_section": "http://news.google.com/news?hl=en&gs_rn=0&gs_ri=serp&tok=8AfznjItXar1mg6jgdkyIw&ds=n&pq=facebook&cp=13&gs_id=5j&xhr=t&q=yahoo+-sports&newwindow=1&gl=us&bav=on.2,or.r_gc.r_pw.r_cp.r_qf.&bpcl=39468505&biw=1366&bih=643&um=1&ie=UTF-8&output=rss", "section_title": "yahoo -sports - Google News", "url": "http://www.moneyflowindex.org/yahoo-yhoo-is-reiterated-by-axiom-capital-to-buy-raises-price-target-to-41/3142375/", "country": "IL", "title": "Yahoo! (YHOO) is Reiterated by Axiom Capital to Buy, Raises Price Target to $41 - Money Flow Index", "performance_score": 0, "site": "moneyflowindex.org", "participants_count": 0, "title_full": "Yahoo! (YHOO) is Reiterated by Axiom Capital to Buy, Raises Price Target to $41 - Money Flow Index", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T13:38:00.000+03:00", "replies_count": 0, "uuid": "4f6fa853b901ed2810da49864dec7550d1e10f88"}, "author": "", "url": "http://www.moneyflowindex.org/yahoo-yhoo-is-reiterated-by-axiom-capital-to-buy-raises-price-target-to-41/3142375/", "ord_in_thread": 0, "title": "Yahoo! (YHOO) is Reiterated by Axiom Capital to Buy, Raises Price Target to $41 - Money Flow Index", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Yahoo! (YHOO) is Reiterated by Axiom Capital to Buy, Raises Price Target to $41 October 5, 2015 by Carmen Lehman in Market Indices · 0 Comment \nYahoo! (YHOO) is Reiterated by Axiom Capital to Buy according to the research report released to the investors. The brokerage firm has raised the Price Target to $41 from a previous price target of $39 . The shares recommendation by the Brokerage Firm was released on Oct-5-2015. \nYahoo! Inc. (NASDAQ:YHOO) : On Friday heightened volatility was witnessed in Yahoo! Inc. (NASDAQ:YHOO) which led to swings in the share price. The shares opened for trading at $28.62 and hit $30.71 on the upside , eventually ending the session at $30.71, with a gain of 6.23% or 1.8 points. The heightened volatility saw the trading volume jump to 29,250,543 shares. The 52-week high of the share price is $52.62 and the company has a market cap of $28,910 million. The 52-week low of the share price is at $27.2 . \nShares of Yahoo! Inc. (NASDAQ:YHOO) appreciated by 5.42% during the past week but lost 2.75% on a 4-week basis. The shares have outperformed the S&P 500 by 4.34% in the past week but underperformed the index by 4.26% in the last 4 weeks. \nThe company shares have dropped 25.15% in the past 52 Weeks. On November 18, 2014 The shares registered one year high of $52.62 and one year low was seen on September 28, 2015 at $27.2. The 50-day moving average is $31.72 and the 200 day moving average is recorded at $39.15. S&P 500 has rallied 0.84% during the last 52-weeks. \nOn a different note, The Company has disclosed insider buying and selling activities to the Securities Exchange, The Securities and Exchange Commission has divulged that Mayer Marissa A, director officer (Chief Executive Officer) of Yahoo Inc, had unloaded 100,000 shares at an average price of $46 in a transaction dated on April 16, 2015. The total value of the transaction was worth $4,600,000. Currently the company Insiders own 0.4% of Yahoo! Inc. Company shares. In the past six months, there is a change of -7.38% in the total insider ownership. Institutional Investors own 69.7% of Company shares. During last 3 month period, 0% of total institutional ownership has changed in the company shares. Yahoo! Inc. has dropped 20.46% during the last 3-month period . Year-to-Date the stock performance stands at -39.2%. \nYahoo! Inc. (Yahoo!) is a global technology company. Through the Company’s technology and insights, Yahoo! delivers digital content and experiences, across devices and globally. The Company provides online properties and services (Yahoo! Properties) to users, as well as a range of marketing services designed to reach and connect with those users on Yahoo! and through a distribution network of third-party entities (Affiliates). These Affiliates integrate its advertising offerings into their Websites or other offerings (those Websites and other offerings, Affiliate sites). The Company generates revenue from the display of graphical advertisements (display advertising), the display of text-based links to advertisers’ Websites (search advertising), and other sources. Effective January 7, 2014, Yahoo Inc acquired Aviate. In August 15, 2014, IOOF Yahoo! Inc. acquired Clarity Ray. In August 2014, the Company acquired Flurry. Effective September 05, 2014, Yahoo Inc acquired Luminate Inc.", "external_links": [], "published": "2015-10-05T13:38:00.000+03:00", "crawled": "2015-10-05T14:07:29.512+03:00", "highlightTitle": ""}