{"organizations": [], "uuid": "cb11854278a39939e82e66b808228a4aafd474fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mercurynews.com", "main_image": "http://local.mercurynews.com/common/dfm/assets/logos/1200x627/mercurynews.png", "site_section": "http://feeds.mercurynews.com/mngi/rss/CustomRssServlet/568/200795.xml", "section_title": "College Sports", "url": "http://www.mercurynews.com/sports/ci_28970800/stanford-women-not-their-customary-position-start-basketball?source=rss", "country": "IL", "title": "Stanford women not in their customary position to start basketball season", "performance_score": 0, "site": "mercurynews.com", "participants_count": 1, "title_full": "Stanford women not in their customary position to start basketball season", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:24:00.000+03:00", "replies_count": 0, "uuid": "cb11854278a39939e82e66b808228a4aafd474fc"}, "author": "Elliott Almond\n\nealmond@mercurynews.com", "url": "http://www.mercurynews.com/sports/ci_28970800/stanford-women-not-their-customary-position-start-basketball?source=rss", "ord_in_thread": 0, "title": "Stanford women not in their customary position to start basketball season", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Stanford women not in their customary position to start basketball season By Elliott Almond Posted: 10/14/2015 05:24:26 PM PDT Updated: 10/14/2015 05:24:27 PM PDT SAN FRANCISCO -- Stanford forward Erica McCall is ready for a new role this season. \nSo are the rest of the post players, who know they have much to prove after Pac-12 women's coaches picked Stanford to finish second behind Oregon State in the preseason basketball poll released Wednesday. \nThe Cardinal, which won the league tournament after finishing third in the regular season, ended a streak of 15 consecutive years as the top-ranked team. \nThe preseason poll didn't surprise coach Tara VanDerveer. \n\"In some ways, it is a mystery team because in some ways I don't know where it will go,\" she said at the Pac-12 media day in San Francisco. \nStanford (26-10 last season) plans to blend a triangle offense with an up-tempo style to get the post players more involved than the previous campaign. \n\"It feels like we've got a completely different team,\" McCall said. \nThe Bakersfield player was second on the team in rebounding (5.4 per game) and blocks (50) as a sophomore. But she was not much of an offensive threat at 5.6 points per game. \nThat's expected to change after McCall helped the United States win a gold medal in the summer at the World University Games. \n\"She needs to be a go-to player,\" VanDerveer said. \"We're going inside to her by design.\" \nThe 6-foot-3 junior promised the coaching staff after last season that she would show big improvement come fall. Now McCall is buoyed by the team's trust in her before the season opener Nov. 13 at UC Davis. Advertisement \n\"Knowing my team really needs me\" makes McCall want it even more, she said. \nMcCall will have help as the Cardinal expects to count on up to nine players in the rotation. Sophomore Kaylee Johnson was the rebound leader averaging 9.4 per game. Coaches expect the 6-3 forward to be more of an offensive force. \nVanDerveer also called 6-3 Kailee Johnson \"a sleeper\" who could help the post play after having little impact last season when the team reached the Sweet 16. \nVanDerveer said the forwards won't just run down the court to set screens. \n\"They are going to get the ball,\" she said. \"Not having to call out a lot of things. Just get the ball and shoot.\" \nVanDerveer has flexibility in her 30th season at Stanford, where last month she signed a two-year contract extension. \nStanford returns six players who saw considerable minutes in the 2014-15 season, including junior guards Karlie Samuelson, Briana Roberson and leading scorer Lili Thompson. \nVanDerveer also added four freshmen to the mix. Two of them could play right away -- 6-3 Australian forward Alana Smith and 5-8 Marta Sniezek. \nVanDerveer sounds as she is ready to anoint Sniezek as her starting point guard to replace graduated senior Amber Orrange. \n\"Our freshmen are going to contribute -- they're going to have to,\" VanDerveer said. \nWhoever plays, expect the pace to be fast. \nVanDerveer has given her players an edict to go, go and go some more. She might even employ a press against opponents. \nThese aren't the plodding Cardinal from years past. \nStanford opened fall practice with mostly healthy bodies. But redshirt senior guard Alex Green is recovering from her second knee surgery and 6-5 freshman Shannon Coffee is being checked for a stress fracture.", "external_links": [], "published": "2015-10-15T03:24:00.000+03:00", "crawled": "2015-10-15T03:56:39.748+03:00", "highlightTitle": ""}