{"organizations": [], "uuid": "abe7f5633101ae8eef3fe59a816dae113ec0485c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "sports.tempo.com.ph", "main_image": "http://sports.tempo.com.ph/wp-content/uploads/sites/6/2015/07/Jason-Webb.jpg", "site_section": "http://sports.tempo.com.ph/feed/", "section_title": "Tempo Sports » Tempo Sports", "url": "http://sports.tempo.com.ph/2015/10/19/pba-webb-gets-extra-days-to-prepare-vs-ros/", "country": "US", "title": "PBA: Webb gets extra days to prepare vs ROS", "performance_score": 0, "site": "tempo.com.ph", "participants_count": 1, "title_full": "PBA: Webb gets extra days to prepare vs ROS", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:42:00.000+03:00", "replies_count": 0, "uuid": "abe7f5633101ae8eef3fe59a816dae113ec0485c"}, "author": "Tito S. Talao", "url": "http://sports.tempo.com.ph/2015/10/19/pba-webb-gets-extra-days-to-prepare-vs-ros/", "ord_in_thread": 0, "title": "PBA: Webb gets extra days to prepare vs ROS", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Oct. 19 Featured , PBA no comments \nThe news that Rain or Shine starting ace point guard Paul Lee could be out weeks due to a minor knee ligament tear may force rookie Star Hotshots coach Jason Webb to brave heavy rains and strong winds to hunt for more conclusive video footage of Elasto Painters rookie Maverick Ahanmisi. \nAnd precisely because of the prevailing weather, Webb got extra three more days to find one. \nExpressing concern for the safety of inaugural day fans as Typhoon Lando lashed at huge parts of Luzon, including Metro Manila, PBA commissioner Chito Narvasa yesterday cancelled the opening ceremony for the 41st season at the Smart Araneta Coliseum – an unprecedented move – and with it Webb’s baptism of fire: the Star Hotshots debuting against Yeng Guiao’s Rain or Shine Elasto Painters. \nThe opening game, along with the traditional parade of teams and muses, has been reset to Wednesday at the Mall of Asia Arena, leaving Webb the whole of Sunday up to Tuesday to decide whether to tweak their original game plan against ROS or keep as it is less they mess it up. \n“We’ve got two more days to prepare for the same team,” said Webb over the phone, laughing. “Na-false alarm tayo kahapon, but I don’t think we’ve any major changes.” \nInformed by Hotshots governor Rene Pardo before noon yesterday that the opening has been called off, Webb got in touch with his coaches and had it put out for the players to engage in some minor physical activity for the rest of the day. \n“Pagpag lang ng konti kasi late na rin to meet up with them,” Webb said. “Ilang araw na kasi kaming nagla-light practice in anticipation of this game, tapos hindi nga natuloy. So individually, konting activity na lang siguro muna. But we’ll be back noon at Ronac gym Monday and Tuesday, the weather hopefully cooperating.” \nReports of Lee’s possible absence against Star did little to brighten up the day, Webb said. \nWith Lee out of the equation, Webb said he will be zeroing in defensively on the E-Painters’ backup guards, especiallyJericho Cruz and rookie Maverick Ahanmisi, a 6-foot Fil-Nigerian guard drafted 3rd overall by ROS out of University of Minnesota. \nAnd there lies Webb’s dilemma. \n“First of all, you have to feel bad for Paul kasi I’m sure he’s really excited to play; kasama pa siya don sa 17 players sa Gilas, di ba? You can never wish injury to any athlete, or to any person, for that matter, but things like this are what makes Rain or Shine a really difficult team to play against,” Webb said. \nGuiao’s ability to draw the best from his players in times of adversity, Webb believed, is what makes them a “great team.” \nSaid Webb: “This is good opportunity for Jericho and Ahanmisi to fast-forward their maturity process, and it’s going to be tough on us since we have no real game video of their rookie and we don’t exactly know that to expect.” \nWithout the benefit of such footage, except for a couple of practice clips, Webb will be relying on impromptu scouting on game day to decipher Ahanmisi’s strengths and weaknesses. \n“For rookies kasi, sa first two games sila nakakagulat ng opposing coaches dahil di pa sila kakilala e,” Webb said. “Eventually as teams recognize their style, napapag-aralan na sila, plus yung advantage ng excitement on the part of the newcomers, unti-unti rin nagwe-wane. But until then, yung first game will always be an advantage to them on the offensive end. Marami pa silang nakatago e. That’s what we’ll have to deal with.” \nFor their part, the additional days given them allow the Hotshots to integrate to their system rookie Ronald Pascual, who sat out more than a week of practice because of a minor calf strain and rejoined the team only last Thursday. \n“Overall, I think we’re fine with what we have,” Webb said. “Pressure? Of course although Wednesday’s game will be just the first of many. And the opening game is no bigger than the last.”", "external_links": [], "published": "2015-10-19T03:42:00.000+03:00", "crawled": "2015-10-19T03:56:09.945+03:00", "highlightTitle": ""}