{"organizations": [], "uuid": "99946aabe2ef7e72d4cba4426219b34c83100631", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "wtop.com", "main_image": "http://wtop.com/wp-content/uploads/2015/10/APTOPIX-Blue-Jays-Rangers-Baseball1.jpeg", "site_section": "http://wtop.com/section/sports/feed/", "section_title": "WTOP » Sections » Sports", "url": "http://wtop.com/mlb/2015/10/rangers-lose-another-alds-game-at-home-5-1-to-blue-jays/", "country": "US", "title": "Rangers lose another ALDS game at home, 5-1 to Blue Jays", "performance_score": 0, "site": "wtop.com", "participants_count": 1, "title_full": "Rangers lose another ALDS game at home, 5-1 to Blue Jays", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T07:47:00.000+03:00", "replies_count": 0, "uuid": "99946aabe2ef7e72d4cba4426219b34c83100631"}, "author": "wtopstaff", "url": "http://wtop.com/mlb/2015/10/rangers-lose-another-alds-game-at-home-5-1-to-blue-jays/", "ord_in_thread": 0, "title": "Rangers lose another ALDS game at home, 5-1 to Blue Jays", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home » News » Sports » MLB » Rangers lose another ALDS… Rangers lose another ALDS game at home, 5-1 to Blue Jays By STEPHEN HAWKINS October 12, 2015 12:47 am Texas Rangers starting pitcher Martin Perez (33) pauses between pitches against the Toronto Blue Jays during the fourth inning in Game 3 of baseball's American League Division Series Sunday, Oct. 11, 2015, in Arlington, Texas. (AP Photo/Tony Gutierrez) \nARLINGTON, Texas (AP) — Rougned Odor kept starting double plays for the Texas Rangers, then first baseman Mitch Moreland turned a nifty one that only delayed the big blow. \nAfter Odor had big defensive plays in three consecutive innings, Troy Tulowitzki hit a three-run homer right after Moreland’s 3-2-3 double play in the sixth, and the Toronto Blue Jays went on to a 5-1 victory Sunday night that prevented the Rangers from sweeping the best-of-five AL Division Series. \n“These guys did a really good job at limiting the damage, got the double-play balls when we needed them,” manager Jeff Banister said. “Really the big blow was, I think it was a changeup to Tulowitzki. … But the margin of error in these type of games is so slim that one pitch typically can get you, and that’s really was the story tonight.” \nLeading the series 2-1, Texas has another chance Monday to clinch it at home. If not, a deciding Game 5 will be played Wednesday in Toronto, where the Rangers won the first two games. \n“Every game in the playoffs you want to have that feeling of a must win, just for the simple fact that you want to really get after it and don’t get flat,” said Josh Hamilton, who snapped an 0-for-31 postseason slump with a fifth-inning single. \nOn way to its first World Series in 2010, Texas opened the ALDS by winning the first two games at Tampa Bay, before losing both home games and then having to beat the Rays on the road in the decisive fifth game. \nThe Rangers are 1-8 in ALCS games at home, and 8-5 on the road. \nMarco Estrada limited the Rangers to one run and five hits over 6 1-3 innings, with four strikeouts and no walks. \nTulowitzki’s homer came in the sixth off reliever Chi Chi Gonzalez, two innings after Tulowitzki drew a bases-loaded walk. The shortstop missed most of the final three weeks of the regular season because of a cracked shoulder blade and bruised muscles in his upper back. \n“Tulo needed that, he really did,” manager John Gibbons said. “Maybe that sets him off. … If he catches fire, we’re real dangerous.” \nTexas left-hander Martin Perez, somewhat a surprise pick as the Game 3 starter over veterans Derek Holland and Colby Lewis, gave up four runs and six hits while pitching into the sixth. \nHolland (4-3) starts Game 4 against knuckleballer R.A. Dickey (11-11). \nThe Blue Jays had their leadoff hitter at second base to start each the third through fifth innings, a span that included the double plays started by Odor, whose grounder in the seventh produced the only Texas run. \nToronto started the sixth with consecutive singles to chase Perez, and Edwin Encarnacion then drew a 10-pitch walk from Gonzalez to load the bases. \nMoreland then fielded Chris Colabello’s hard hopper, threw home for the first out and got back to the bag to take the return throw. Tulowitzki followed with his drive. \nToronto’s first run scored in the third when Odor initially bobbled a grounder by Ryan Goins before reaching back with his right foot to touch the base and throwing the first to complete the first double play. \nJosh Donaldson led off the fourth with a double and scored when Tulowitzki was the third consecutive batter walked by Perez. Donaldson was greeted with a chorus of boos from Rangers fans, who apparently read lips during his dustup with reliever Keone Kela in the 13th inning of Game 2 that Texas won 6-4 in the 14th. \nThe bases were still loaded in the fourth when Navarro had an inning-ending 4-6-3 double play a pitch after a hard foul down the third-base line. \nOdor made a backhanded catch with his glove just off the ground on Ben Revere’s broken-bat soft liner, then doubled off Kevin Pillar, who had broken home to end the fifth. \n“We were in real good position all night long. They made a couple of great double plays,” Gibbons said. “You wonder what’s going on here, you go maybe this isn’t meant to be.” \nBELTRE’S BACK: Rangers third baseman Adrian Beltre was out of the lineup for the second game in a row with a strained lower back that forced him to exit early from the series opener. “With each passing hour, he has gotten better,” Banister said. “We feel like if Adrian comes in and says he’s ready to go, then he’s ready to go.” \nDICKEY’S POSTSEASON DEBUT: The first career postseason start for 40-year-old right-hander Dickey comes at Texas. He got his first big league win with the Rangers in 2003 and became a knuckleball pitcher two years later. “It’s funny how it’s come full circle me personally,” Dickey said. “It’s poetic, is what it is for me. It’s a neat narrative.” \nSLUMP BUSTER: Hamilton’s last postseason hit had been a single in the first inning of Game 7 of the 2011 World Series for Texas. He was hitless in the 2012 AL wild card game for the Rangers, then 0 for 13 in the AL Division Series for the Los Angeles Angels last season before starting this series 0 for 11. Topics:", "external_links": [], "published": "2015-10-12T07:47:00.000+03:00", "crawled": "2015-10-12T09:09:44.365+03:00", "highlightTitle": ""}