{"organizations": [], "uuid": "6018015d99ab581eb8546f4ea9047dac9622a183", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.buffalonews.com", "main_image": "http://www.buffalonews.com/images/BNSocialShareLG.jpg", "site_section": "http://www.buffalonews.com/section/rssGen?profileID=1004&profileName=Sports", "section_title": "The Buffalo News - Sports", "url": "http://www.buffalonews.com/sports/for-new-womens-hockey-league-an-olympian-comes-to-buffalo-20151009", "country": "US", "title": "For new women’s hockey league, an Olympian comes to Buffalo", "performance_score": 0, "site": "buffalonews.com", "participants_count": 1, "title_full": "For new women’s hockey league, an Olympian comes to Buffalo - Sports - The Buffalo News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T05:16:00.000+03:00", "replies_count": 0, "uuid": "6018015d99ab581eb8546f4ea9047dac9622a183"}, "author": "Amy Moritz", "url": "http://www.buffalonews.com/sports/for-new-womens-hockey-league-an-olympian-comes-to-buffalo-20151009", "ord_in_thread": 0, "title": "For new women’s hockey league, an Olympian comes to Buffalo", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "She played for a college scholarship then for an NCAA national championship.\nShe played for the glory of Old Glory, training for her country and serving as captain of Team USA, winning World Championship gold and Olympic silver.\nShe’s won at every level available to her.\nAnd now, Meghan Duggan gets to play for something else.\nA paycheck.\nDuggan will be part of the Buffalo Beauts in the inaugural season of the National Women’s Hockey League. The Beauts open their 18-game season at 3:30 p.m. Sunday at HarborCenter, hosting the Boston Pride.\n“It’s been an on-going conversation my entire career,” the 28-year-old said. “For us, it was the norm that we don’t play for money. We play because we love the sport. It’s what we always did. We trained and showed up at the rink and worked our butt off for no paycheck. For some players back in the day, they never thought women’s hockey players would get paid. It’s a huge step. It’s exciting. It’s a reward for a lot of hard work and the hours female athletes have put it.”\nThe NHWL, founded by former player Dani Rylan (who serves as the league’s commissioner), consists of four teams – Buffalo, Boston, New York and Connecticut. Each team has a $270,000 salary cap.\nThere are 16 players making the league minimum of $10,000 with two-time Olympian Kelli Stack making a league-best $25,000 according to information released in late September.\nDuggan and Buffalo teammate Megan Bozek are the next highest players in the league, making $22,500.\nThose aren’t salaries that set the world on fire but it’s more than just symbolic pay.\nFor Duggan, the paycheck is part of a broader package that elevates the level of women’s hockey in the United States.\nShe played for the Canadian Women’s Hockey League and won the league championship with the Boston Blades team in 2013. The CWHL was founded in 2007 and has five teams – Boston, Toronto, Brampton, Montreal and Calgary. Players don’t receive a salary in the CWHL and the league’s growth in terms of sponsorship, fan support and exposure has been slow. Too slow for some.\nWhat attracted Duggan to move from the CWHL to the NWHL was the “professionalism from Day One,” she said. “Dani was very clear with outlining her vision for the league and how important this league is for her and to the sport. She laid out how she wanted to run the league and the support and backing they had. We really hadn’t had anything like that before. Nothing against the CWHL. It was a great place to play but this seemed like a great opportunity. I wanted to explore it and the professionalism drew us all in.”\nAs women’s hockey has grown at the amateur and collegiate level, so too has the depth of talent. Of the 72 players on NWHL rosters, 14 are current members of the United States National Team program.\nFour national team members will be part of the Beauts – Duggan, Bozek, Brianne McLaughlin-Bittle and Nichols grad and Getzville native Emily Pfalzer.\nWhen they face Boston on Sunday, they will play one of the biggest names in women’s hockey – Hilary Knight. Other national team members on the Pride are Kacey Bellamy, Brianna Decker, Zoe Hickel, Gigi Marvin, Amanda Pelky and Jordan Smelker.\nManon Rhéaume, the goaltender who is the only woman to play in an NHL game, will be at HarborCenter to drop the ceremonial first puck.\nFans can skate with Rheaume and the Beauts after the game – part of marketing the team and the league but also a way to connect girls to the sport and nurture their athletic aspirations.\nThat’s an aspect all the players in the league understand and embrace – their ability to impact opportunity for future generations of female hockey players. That can create some hefty emotions and expectations that players need to keep in check when the puck drops.\n“I’m looking for a high-tempo, fast-paced game,” Duggan said. “It will be trying to keep emotions in check and realize we still have a hockey game to play. One team will come out on top. It should be a great weekend of hockey.”\nIndividual game tickets are $15 for the Beauts with all home games at 3:30 p.m. at HarborCenter.", "external_links": [], "published": "2015-10-10T05:16:00.000+03:00", "crawled": "2015-10-10T16:38:34.318+03:00", "highlightTitle": ""}