{"organizations": [], "uuid": "a7e627029f6234be6c49869a4c8a0399550fdb17", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.northjersey.com", "main_image": "http://www.northjersey.com:80/polopoly_fs/1.1434143!/fileImage/httpImage/101615-s-knick-70p.jpg", "site_section": "http://www.northjersey.com/cmlink/sports-rss.rss#", "section_title": "Sports News on NorthJersey.com", "url": "http://www.northjersey.com/sports/basketball/knicks-afflalo-back-to-practice-1.1434142", "country": "US", "title": "Knicks: Arron Afflalo returns to practice - Basketball", "performance_score": 0, "site": "northjersey.com", "participants_count": 1, "title_full": "Knicks: Arron Afflalo returns to practice - Basketball - NorthJersey.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T04:21:00.000+03:00", "replies_count": 0, "uuid": "a7e627029f6234be6c49869a4c8a0399550fdb17"}, "author": "STEVE POPPER", "url": "http://www.northjersey.com/sports/basketball/knicks-afflalo-back-to-practice-1.1434142", "ord_in_thread": 0, "title": "Knicks: Arron Afflalo returns to practice - Basketball", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Buy this photo ASSOCIATED PRESS Knicks rookie Kristaps Porzingis, right, says his strained left quad is healed and he’s ready to join his teammates. GREENBURGH, N.Y. — It was just a non-contract drill, running through the offensive sets without a defender on the floor. But there, slipping in with the second unit Thursday, was Arron Afflalo.\nA small victory for the Knicks.\nWith just 17 victories a season ago, New York will take a win of any kind, and getting Afflalo, whom Knicks coach Derek Fisher has projected to be the starting shooting guard after signing as a free agent over the summer, back on the court was a minor victory.\nAfflalo suffered a left hamstring strain in the team’s training camp at West Point and had been sidelined since Oct. 2. After insisting he would be back the next day, his first full workout was Thursday.\n\"It felt good,\" Afflalo said. \"I’ve had extended vacation. The training staff has been great with me in terms of rehab. I felt comfortable. Now it’s just a matter of getting back acclimated with my teammates.\"\nIt’s a problem not just for Afflalo, but for 7-foot-3 rookie Kristaps Porzingis, who has missed time in training camp and again this week — and likely will sit out tonight’s game against the Boston Celtics. The Knicks revamped their roster again this summer and have yet to put what Fisher hoped would be the starting five on the floor together.\n\"Obviously, I was one of the first signees, so understanding the situation I was coming into I started to try to get familiar with the triangle,\" Afflalo said. \"It’s a lot different watching it on film and trying to get out there and perform it. I’ll try to do my best with it.\"\n\"Most of the time it’s your offense that takes a little additional time to pick up,\" Fisher said. \"There isn’t anything like playing in the game. I’m sure there will be a little bit of a delay there. But Kris is smart, Arron’s smart. They watch. They pay attention, even when they’re not in there. … Arron probably will have the tougher job this year.\"\nPorzingis was sidelined for the fourth straight day after suffering a strained left quad Sunday. He is confident that this latest injury — the third to his left leg since July — is healed and he’s ready to start working toward the opener.\n\"They know what they’re doing,\" said Porzingis, who expects to practice this morning. \"I trust them 100 percent, all the doctors. They understand me, too, that I’m telling them I want to get back as soon as possible. I’ve got to understand. I’ve got to be professional. I can’t try to force it too much, either. Step by step I’ll be back healthy.\"\nEmail: popper@northjersey.com", "external_links": [], "published": "2015-10-16T04:21:00.000+03:00", "crawled": "2015-10-16T08:48:38.356+03:00", "highlightTitle": ""}