{"organizations": [], "uuid": "ca05145798c7266d5a871c396a8018cd3f81ed8a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www2.ljworld.com", "main_image": "http://worldonline.media.clients.ellingtoncms.com/static/ljworld.com/images/ljw-logo-1200.jpg", "site_section": "http://www2.ljworld.com/rss/headlines/sports/", "section_title": "LJWorld.com stories: Sports", "url": "http://www2.ljworld.com/news/2015/oct/09/league-title-not-priority-lhs/", "country": "US", "title": "League title not a priority for LHS", "performance_score": 0, "site": "ljworld.com", "participants_count": 1, "title_full": "League title not a priority for LHS", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T08:47:00.000+03:00", "replies_count": 0, "uuid": "ca05145798c7266d5a871c396a8018cd3f81ed8a"}, "author": "Bobby Nightengale", "url": "http://www2.ljworld.com/news/2015/oct/09/league-title-not-priority-lhs/", "ord_in_thread": 0, "title": "League title not a priority for LHS", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Bobby Nightengale — Lawrence Journal-World October 9, 2015 \nAdvertisement \nLawrence High’s football players have spent less time talking about winning a Sunflower League title than the time it takes to read this sentence. \nWith a victory against Olathe South (7 tonight) at LHS, the Lions will clinch a share of the league title for the first time since 1993. \nThe league standings only account for the first six games because the final three games are a part of districts. Olathe North finished its league schedule with a 5-0 record this year. \n“I don’t think it’s ever been brought up,” LHS coach Dirk Wedd said. “The only thing they worry about is hanging a (state championship) banner. I think they want to do something special. They’ve been real good about concentrating one game at a time. Hopefully it’ll continue.” \nWhen LHS senior cornerback Ivan Hollins was asked if he talked with any of his teammates about winning a league title, he just shook his head. \n“It’s another game for us,” Hollins said. \nAfter a couple of losses by top-ranked teams in the state last week, the Lions (5-0) were moved up to the No. 1-ranked team in most media polls and No. 2 in the coaches’ poll. \nBut again, it’s not a subject the Lions care to spend much time talking about with each other. \n“It doesn’t matter. It’s just a number,” senior quarterback Alan Clothier said. “That’s what we believe. It doesn’t mean anything. I, honestly, in my opinion, don’t like to be No. 1 just because it puts that target on your back. I never like to be No. 1, but hey, we’re No. 1 so we’re just going to focus on our next game and play hard like we’ve been playing all season.” \nThe Lions are one of six teams left in Class 6A with an undefeated record. \n“It’s cool that people think we’re No. 1 but it really doesn’t matter right now,” senior linebacker/tight end Price Morgan said. “Coach Wedd was telling us, ‘We don’t care who is No. 1 until the day after the state championship.’” \nOne of the turning points for the veteran LHS squad was last year’s game against Olathe South. The Lions trailed by 29 points at halftime, but started a furious comeback and had the ball at the six-yard line with 18 seconds left with a chance to tie the game. \nThe Lions fell short in that game after an interception in the end zone, but gained plenty of confidence, which carried over to this summer and into this season. \n“They got scolded at halftime and challenged a little bit and they came out like I thought they would,” Wedd said. “There’s a lot of games over the past two years that they’ve grown.” \nLHS probable starters \nOffense \nLT — Trey Georgie, sr. LG — Jacob Unruh, jr. C — Mark Greene, jr. RG — Ethan Taylor, so. RT — Amani Bledsoe, sr. \nQB — Alan Clothier, sr. RB — JD Woods, sr. H — Peter Afful, sr. WR — Ivan Hollins, sr. WR — J’Mony Bryant, sr. TE — Price Morgan, sr. \nK — Cole Brungardt, jr. P — Alan Clothier, sr. \nDefense \nDE — Trey Georgie, sr. DT — Nathan Koehn, sr. DT — Jacob Unruh, jr. DE — Amani Bledsoe, sr. LB — Konner Kelley, sr. LB — Price Morgan, sr. LB — Tanner Green, sr. \nCB — Dante’ Jackson, so. CB — Ivan Hollins, sr. SS — Santino Gee, jr.FS — Cade Burghart, jr.", "external_links": [], "published": "2015-10-09T08:47:00.000+03:00", "crawled": "2015-10-09T09:53:33.145+03:00", "highlightTitle": ""}