{"organizations": [], "uuid": "2d8f9bbd9c41aeec9b86cb7cbf6176e715e33754", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nj.com", "main_image": "http://imgick.nj.com/home/njo-media/width620/img/eagles_main/photo/18949557-standard.jpg", "site_section": "http://blog.nj.com/realtimesports_impact/rss.xml", "section_title": "New Jersey Real-Time Sports", "url": "http://www.nj.com/eagles/index.ssf/2015/10/sam_bradford_report_card_2.html", "country": "US", "title": "Sam Bradford struggles early, but leads Eagles to win over New Orleans Saints | Report Card", "performance_score": 0, "site": "nj.com", "participants_count": 2, "title_full": "Sam Bradford struggles early, but leads Eagles to win over New Orleans Saints | Report Card | NJ.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T00:12:00.000+03:00", "replies_count": 1, "uuid": "63ecb166e20dcecfe876bcc507a2986d65114cc8"}, "author": "Eliot Shorr-Parks | NJ Advance Media for NJ.com", "url": "http://www.nj.com/eagles/index.ssf/2015/10/sam_bradford_report_card_2.html#post-0", "ord_in_thread": 0, "title": "Sam Bradford struggles early, but leads Eagles to win over New Orleans Saints | Report Card", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PHILADELPHIA -- It wasn't pretty, but sometimes, it doesn't have to be.\nEagles quarterback Sam Bradford had plenty of throws he likely wants back, including two ugly interceptions in the end zone, but he threw two touchdown passes in his team's 39-17 win over the New Orleans Saints at Lincoln Financial Field on Sunday.\nThe victory was a must-have, and it saved the Eagles from a huge hole while improving their record to 2-3.\nBradford played well after the early struggles, and deserves credit for simply doing enough to get his team the win, especially when it looked at times as if he might not rebound from the poor start.\nHere is a look at Bradford's day:\nStats: 32/45, 333 yards, 2 TDs, 2 INTs\nBest throw: With the Eagles up 17-10 in the third quarter, the defense forced a fumble, giving Bradford the ball on the 13-yard line. Bradford got the team in the end zone on the next play, hitting tight end Brent Celek with a nice throw that put the game away.\nWorst throw: With the game scoreless in the first quarter, the Eagles were driving and Bradford was on a roll, but his final pass of the drive was his worst of the game -- an ugly pass to Riley Cooper in the end zone that was picked off by Saints cornerback Brandon Browner.\nAnalysis: Bradford, who was 19-for-30 with two interceptions in the first half had another rough start. On third-and-seven on the Eagles' first drive, Bradford made a nice play while scrambling to his left, but his pass was bobbled and dropped by Jordan Matthews. On fourth-and-seven from the Saints' 39, the Eagles went for it, but Bradford's pass was thrown to the sideline as Cooper cut to the inside.\nRELATED : Chip Kelly, Eagles silence critics — for now — in win over New Orleans Saints\nOn 3rd-and-nine later in the quarter, Bradford hit Cooper for 14 yards on a strike over the middle. He followed that with a 12-yard pass to tight end Zach Ertz.\nBradford looked comfortable , but ruined the Eagles' momentum by throwing an interception in the end zone from the 12-yard line. Cornerback Brandon Browner made a nice play, but the pass was thrown short, giving Browner the chance. Had Bradford thrown the ball to the back of the end zone, only Cooper would have had a shot to catch it.\nBradford continued to go downhill from there: He threw another ugly interception in the end zone early in the second quarter. This pass was behind Miles Austin and low.\nOn the next series, Bradford got a little bit of luck, as two Saints defenders ran into each other, leaving receiver Josh Huff free to run down the sideline for the touchdown on a 41-yard play.\nBradford followed up the touchdown with a poor throw right before the end of the half, sailing one over the middle to tight end Zach Ertz, a pass that was nearly picked off.\nOn the first play after the Eagles recovered a fumble by Saints quarterback Drew Brees, Bradford hit a wide-open Brent Celek in the corner of the end zone for a 13-yard TD and a 23-10 lead in the third quarter.\nBradford wasn't a factor much in the second half. The Eagles had a comfortable lead, and ran the ball the majority of the snaps.\nOverall, it was hard to leave the Eagles' win feeling great about Bradford -- his accuracy was still an issue, and he missed some throws he should have had.\nStill, for the first time since coming to Philadelphia, Bradford -- the costly interceptions aside -- put together an overall strong game in a must-win for his team, an encouraging sign even if it wasn't perfect.\nGrade: B", "external_links": [], "published": "2015-10-12T00:12:00.000+03:00", "crawled": "2015-10-12T13:05:21.026+03:00", "highlightTitle": ""}