{"organizations": [], "uuid": "8db9551c360b3d8f82a68a614c238d95654c5b78", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.14news.com", "main_image": "http://kctv.images.worldnow.com/images/8983194_G.jpg", "site_section": "http://www.14news.com/Global/category.asp?C=3493&clienttype=rss", "section_title": "14 News WFIE Evansville - Sports", "url": "http://www.14news.com/story/30227276/kauffmangroundskeepers-mishap-makes-him-a-viral-sensation", "country": "US", "title": "Kauffman Stadium groundskeeper's mishap makes him a viral sensation", "performance_score": 0, "site": "14news.com", "participants_count": 1, "title_full": "Kauffman Stadium groundskeeper's mishap makes him a viral sensation", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T02:30:00.000+03:00", "replies_count": 0, "uuid": "8db9551c360b3d8f82a68a614c238d95654c5b78"}, "author": "Donovan Pimentel", "url": "http://www.14news.com/story/30227276/kauffmangroundskeepers-mishap-makes-him-a-viral-sensation", "ord_in_thread": 0, "title": "Kauffman Stadium groundskeeper's mishap makes him a viral sensation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kauffman Stadium groundskeeper's mishap makes him a viral sensat - Tri-State News, Weather & Sports Member Center: Kauffman Stadium groundskeeper's mishap makes him a viral sensation Posted: jonathan.carter@kctv5.com KANSAS CITY, MO (KCTV) - \nThursday night’s rain delay during Game 1 of the American League Division Series between the Kansas City Royals and the Houston Astros caused a bit of a mishap on the field for one grounds crew member. \nHe fell while they were rolling the tarp out, then was nearly swept underneath it. \nThe groundskeeper, Adam Wallace, is a Ray-Pec High School senior. \nHe wasn't seriously hurt. \nThis isn't the first time a member of the grounds crew has gotten hung up on the tarp. \nThis happened once in 2011. \nSince the incident, #TarpKid has been trending on Twitter and the moment has been shared on USA Today, New York Daily News and CBS This Morning. \nSome of Adam’s friends and classmates said they first checked to make sure he was Okay, but then it was open season with the jokes. And everyone got involved. \n“We’re standing by if #TarpKid needs backup,” tweeted Clay County Sheriff. \n“Hey @Royals #TarpGuy, if u can survive that monster tarp attack, we are looking for some good officer candidates joinlenexapd.com ,” Lenexa Police chimed in. \nAnd 120 Sports simply said, “Sometimes in life, you're the tarp. And other times, you're the kid getting trapped under the tarp.” \nAt Ray-Pec High School, his classmates had watched the game. \n“I actually couldn’t believe it. We’re in a group message together and I asked him in the group message, ‘Adam, who just got run over by the tarp?’ He responded about an hour later. He’s like, ‘That was me,’” student Peter Fager said. “Everybody saw him today. Everybody just gave him so much stuff about it, so it was pretty funny.” \nThe main thing is that their friend is fine, but some say they weren’t entirely surprised Adam became the tarp victim. \n“I was kind of waiting for him, something to happen to him because we knew he was going to be on the grounds crew. So we’re like, out of all the things that happened to him, THAT happened to him. It’s hilarious,” said student Nathan Butcher. \nCopyright 2015 KCTV (Meredith Corp.) All rights reserved.", "external_links": [], "published": "2015-10-10T02:30:00.000+03:00", "crawled": "2015-10-11T04:26:58.563+03:00", "highlightTitle": ""}