{"organizations": [], "uuid": "0c4ac28d6d16c4bcc03801ab9a24f712384026c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.timesunion.com", "main_image": "http://ww2.hdnux.com/photos/41/41/22/8787081/3/rawImage.jpg", "site_section": "http://www.timesunion.com/default/feed/default/feed/Sports-News-64.php", "section_title": "Sports News", "url": "http://www.timesunion.com/sports/article/Academy-stingy-in-nets-6569524.php", "country": "US", "title": "Academy stingy in nets", "performance_score": 0, "site": "timesunion.com", "participants_count": 1, "title_full": "Academy stingy in nets - Times Union", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T06:23:00.000+03:00", "replies_count": 0, "uuid": "0c4ac28d6d16c4bcc03801ab9a24f712384026c2"}, "author": "Jess Koehler", "url": "http://www.timesunion.com/sports/article/Academy-stingy-in-nets-6569524.php", "ord_in_thread": 0, "title": "Academy stingy in nets", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: Michael P. Farrell Image 1 of / 6 Caption\nClose\nImage 1 of 6 LaSalles David Hamlin and Academy's Michael DeVito battle for the ball during their boy's high school soccer game on Tuesday Oct. 13, 2015 in Albany, N.Y. (Michael P. Farrell/Times Union)\nBuy this photo Photo: Michael P. Farrell LaSalles David Hamlin and Academy's Michael DeVito battle for the... Image 2 of 6 LaSalles Emmett Baynes heads a ball defended by Academy's Tucker Oberting during their boy's high school soccer game on Tuesday Oct. 13, 2015 in Albany, N.Y. (Michael P. Farrell/Times Union)\nBuy this photo Photo: Michael P. Farrell LaSalles Emmett Baynes heads a ball defended by Academy's Tucker... Image 3 of 6 LaSalles Academy's Kyle MacDougall gets control of the ball during their boy's high school soccer game against LaSalle on Tuesday Oct. 13, 2015 in Albany, N.Y. (Michael P. Farrell/Times Union)\nBuy this photo Photo: Michael P. Farrell LaSalles Academy's Kyle MacDougall gets control of the ball during... Image 4 of 6 LaSalles David Hamlin and Academy's Emanuel Gomez battle for the ball during their boy's high school soccer game on Tuesday Oct. 13, 2015 in Albany, N.Y. (Michael P. Farrell/Times Union)\nBuy this photo Photo: Michael P. Farrell LaSalles David Hamlin and Academy's Emanuel Gomez battle for the... Image 5 of 6 LaSalles Rich Kalinowski and Academy's Emanuel Gomez battle for the ball during their boy's high school soccer game on Tuesday Oct. 13, 2015 in Albany, N.Y. (Michael P. Farrell/Times Union)\nBuy this photo Photo: Michael P. Farrell LaSalles Rich Kalinowski and Academy's Emanuel Gomez battle for the... Image 6 of 6 LaSalles Rich Kalinowski and Academy's Owen Connally get postion on the ball during their boy's high school soccer game on Tuesday Oct. 13, 2015 in Albany, N.Y. (Michael P. Farrell/Times Union)\nBuy this photo Photo: Michael P. Farrell LaSalles Rich Kalinowski and Academy's Owen Connally get postion on... Academy stingy in nets 1 / 6 Back to Gallery Albany\nAlbany Academy soccer coach Adam Collett has been working with junior goalie Ian Donlon for four years, and in that time, Donlon has emerged as one of the top keepers in the Colonial Council .\n\"We've had some games that literally have been won because of him,\" Collett said.\nThat was the case again on Tuesday as Donlon stopped 12 shots in Albany Academy's 1-0 Colonial win over La Salle at Albany Academy.\nAlbany Academy avenged a 1-0 defeat suffered back on Sept. 22 at La Salle.\n\"The first game I was back on my line more and their only goal was a header in the six-yard box and I should've gotten to it,\" Donlon said. \"This game I played off my line a little bit more and adjusted.\"\nAlbany Academy improved to 10-4 on the season. La Salle dropped to 9-5.\n\"I think it's a very big win because this motivates us,\" Albany Academy senior midfielder Manny Gomez said. \"We think this win was really good for us.\"\nGomez provided all the offense his team would need when he scored his 10th goal of the season on a penalty kick nine minutes into the game.\n\"I always get a little stressed when it comes to (penalty kicks),\" Gomez said. \"I always pick a corner and usually I try to switch it up. I tried to stay calm.\"\nDonlon said he never watches his teammates when they attempt penalty kicks, but had confidence Gomez would convert.\n\"I always have faith in Manny,\" he said. \"I know he's going to put it in.\"\nLa Salle had a chance to pull even about a minute later, but Donlon punched the shot away.\nHe finished with eight stops in the first half.\nWith just under 15 minutes remaining in the game, La Salle had a pair of scoring opportunities within a minute of one another, but Donlon was there waiting and turned both shots away.\nAlbany Academy seniors Greg Clifford (center back) and Mike DeVito (midfield) also turned in solid performances and drew great praise from Collett.\nSenior goalie Brian Fiset replaced Donlon with about nine minutes remaining in the game and finished with three stops. Collett made the switch because the team was celebrating Senior Day.\nLa Salle goalie Tyler Rapp stopped six shots.\n\"When we played La Salle (on Sept. 22) it was a different kind of a game,\" Collett said. \"We walked away frustrated from that game. I think (Tuesday) was a springboard to show that moving into sectionals, we can be contenders. I was happy with the guts and grit shown (Tuesday).\"\nAlbany Academy has two regular season games remaining. The Cadets will visit Watervliet on Thursday before wrapping up play before sectionals at home against Ichabod Crane .\n\"This was the best game we've played all year,\" Donlon said. \"We've been building really small steps all year. This was our big springboard.\"\njkoehler@timesunion.com • 518-454-5411 • @JKoehlerTU", "external_links": ["http://ww3.hdnux.com/photos/41/41/22/8787082/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/41/22/8787085/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/41/22/8787081/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/41/41/22/8787084/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/41/41/22/8787084/3/920x920.jpg", "http://timesunion.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20Times%20Union&image=http://ww3.hdnux.com/photos/41/41/22/8787082/3/628x471.jpg", "http://ww3.hdnux.com/photos/41/41/22/8787086/3/920x920.jpg", "http://ww4.hdnux.com/photos/41/41/22/8787083/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/41/22/8787085/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/41/22/8787086/3/square_gallery_thumb.jpg", "http://timesunion.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20Times%20Union&image=http://ww1.hdnux.com/photos/41/41/22/8787084/3/628x471.jpg", "http://timesunion.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20Times%20Union&image=http://ww3.hdnux.com/photos/41/41/22/8787086/3/628x471.jpg", "http://timesunion.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20Times%20Union&image=http://ww2.hdnux.com/photos/41/41/22/8787085/3/628x471.jpg", "http://timesunion.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20Times%20Union&image=http://ww2.hdnux.com/photos/41/41/22/8787081/3/628x471.jpg", "http://ww2.hdnux.com/photos/41/41/22/8787081/3/920x920.jpg", "http://timesunion.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20Times%20Union&image=http://ww4.hdnux.com/photos/41/41/22/8787083/3/628x471.jpg", "http://ww4.hdnux.com/photos/41/41/22/8787083/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/41/22/8787082/3/square_gallery_thumb.jpg"], "published": "2015-10-14T06:23:00.000+03:00", "crawled": "2015-10-14T08:21:32.853+03:00", "highlightTitle": ""}