{"organizations": [], "uuid": "2c6f60504a9e359ed854bf8d9633b138d4867e39", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nydailynews.com", "main_image": "http://assets.nydailynews.com/polopoly_fs/1.272687!/img/httpImage/image.jpg_gen/derivatives/landscape_1200/alg-top-coaches-jpg.jpg", "site_section": "http://www.nydailynews.com/sports/high-school/index.html", "section_title": "New York High School Sports Coverage, Photos, HS Hoops, Recaps - NY Daily News", "url": "http://www.nydailynews.com/sports/high-school/coach-year-nominees-article-1.272686", "country": "US", "title": "Coach of the Year nominees", "performance_score": 0, "site": "nydailynews.com", "participants_count": 1, "title_full": "Coach of the Year nominees - NY Daily News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "2c6f60504a9e359ed854bf8d9633b138d4867e39"}, "author": "NEW YORK DAILY NEWS", "url": "http://www.nydailynews.com/sports/high-school/coach-year-nominees-article-1.272686", "ord_in_thread": 0, "title": "Coach of the Year nominees", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Alan Balkan\nNew Utrecht\nIn his seventh year at New Utrecht, Alan Balkan led the Utes to a breakthrough season. The fiery coach guided unheralded senior signal-caller Francesco Sinagra to a career year and helped steer the Utes to their first-ever PSAL semifinal. New Utrecht was 1-2 after three games, but Balkan helped engineer a six-game winning streak. The Utes ended the regular season 7-2, two victories better than last year, and drew the fourth seed in the playoffs - the first time they opened the postseason with two home games guaranteed.\nMike Camardese\nCanarsie\nCanarsie is playing in today's PSAL Championship title game, largely thanks to veteran coach Mike Camardese.\nCamardese led the Chiefs, a youthful squad with 22 juniors and one sophomore, to an 8-1 record and the third seed in the playoffs. That success came after an early shake-up. After Week 3, the Chiefs were 2-1 and had surrendered 103 points. Camardese responded by sitting three defensive starters.\nDuring its current nine-game winning streak, Canarsie has limited opponents to 8.4 points per game.\nFred Olivieri\nCurtis\nWeek after week, Fred Olivieri laid out the necessary offensive and defensive blueprints to roll past the opposition. and his players executed the plans to perfection.\nUnder Olivieri's guidance, the Warriors (12-0) scored 43 points per game, while the defense surrendered only 12.3 points per contest.\nFor the second straight season, the Warriors will play in the PSAL Championship title game. And for the second straight season, they'll take the field with an unblemished record.\nRich Reichert\nSt. Anthony's\nThis wasn't St. Anthony's finest season, but it may have been Rich Reichert's best coaching job. Entering Week 3, his Friars owned a 64-game winning streak, but they were downed by Mount Saint Michael, losing 22-12. It would be their lone loss of the season. Reichert helped his squad regroup, guiding them to eight straight victories. The Friars rewarded their coach by reaching the playoff final and defeating Mount Saint Michael to give Reichert his seventh straight ‘AAA' crown.\nMichael Scaduto\nAugust Martin\nThe rookie coach inherited a 30-man roster that boasted 24 seniors, each accustomed to losing. The Falcons had gone 5-21 over the past three years under two head coaches. According to assistants and players, team rules were set, but not regularly enforced.\nEnter Michael Scaduto and his no-nonsense approach: he held players accountable, tracking their attendance, behavior and performance in class.\nThe result? The Falcons finished 6-3 and were one of five mid-tier teams seeded in the PSAL's top postseason bracket.", "external_links": [], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-16T07:11:08.105+03:00", "highlightTitle": ""}