{"organizations": [], "uuid": "40b6bebbf2bd37af7cbc6af5dc596cc5ee6b00c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattlepi.com", "main_image": "http://ww3.hdnux.com/photos/41/55/14/8835842/7/rawImage.jpg", "site_section": "http://www.seattlepi.com/sports/more/", "section_title": "More Seattle Sports News / NBA, NHL, Golf, Tennis - seattlepi.com", "url": "http://www.seattlepi.com/news/crime/article/Albuquerque-officials-Road-rage-killing-shows-6587830.php", "country": "US", "title": "Albuquerque officials: Road rage killing shows broken system", "performance_score": 0, "site": "seattlepi.com", "participants_count": 1, "title_full": "Albuquerque officials: Road rage killing shows broken system - seattlepi.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "40b6bebbf2bd37af7cbc6af5dc596cc5ee6b00c2"}, "author": "seattlepi.com", "url": "http://www.seattlepi.com/news/crime/article/Albuquerque-officials-Road-rage-killing-shows-6587830.php", "ord_in_thread": 0, "title": "Albuquerque officials: Road rage killing shows broken system", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ALBUQUERQUE, N.M. (AP) — The man charged in the freeway killing of a 4-year-old girl in New Mexico had been previously arrested on aggravated battery, domestic violence and a violent incident involving a gun.\nIn each case, Tony Torrez — arrested in Tuesday's shooting that police say was brought on by road rage — evaded prosecution.\nNow, authorities are citing his history and that of a convicted felon charged with shooting and critically wounding an Albuquerque police officer this week as examples of a criminal justice system they say is broken, underfunded and can leave law enforcement and the public more vulnerable to violence.\nBoth the shootings of 4-year-old Lilly Garcia and Officer Daniel Webster , each just a day a part, have unnerved many in the state's largest city and prompted local officials to press lawmakers to enact sentencing reform they say would keep criminals off the streets. At a news conference, Police Chief Gorden Eden called for stronger sentencing laws that would include enhancements for repeat offenders and gang members.\n\"If we had a criminal justice system that was not turnstile justice, we would not have a dead 4-year-old and we would not have an officer struggling to take every single breath,\" Eden said. \"I think it speaks to the systematic failure of the Legislature, and it speaks to the systematic failure of the court system.\"\nAlbuquerque Mayor Richard Berry and Eden both have signaled they will push for tougher crime measures in the next Legislative session. Their criticism of lax sentencing laws come after recent FBI statistics showed the city's violent crime rate has steadily increased in recent years, which Berry has blamed squarely on repeat offenders.\n\"Our officers too many times have had to go out and re-arrest offenders,\" Berry said. \"We have got to make things better for a little 4-year-old on her way home from school.\"\nLilly Garcia and her brother were in their father's Dodge truck after being picked up from school when police say another car forced the vehicle out of its lane on Interstate 40. Garcia gestured toward the other driver and swore at him, and the man in the other car, who police say was Torrez, opened fire, hitting Lilly in the head. She was pronounced dead that evening at the University of New Mexico Hospital .\nA day later, Officer Webster was shot by Davon Lymon , a repeat offender, outside a pharmacy during a traffic stop, authorities said. Webster, an eight-year veteran, remains in critical but stable condition at the University of New Mexico Hospital.\nNot everyone agrees with Eden and Berry that stricter sentencing will resolve the gradual but steady uptick in Albuquerque's crime rate, or keep the same offenders from committing violent crimes. State Sen. Jerry Ortiz y Pino, a Democrat from Albuquerque, said resources would be better spent rehabilitating criminals, helping them obtain GEDs and build job skills.\n\"All of that is stuff that has been tried and failed,\" he said. \"We'll spend $40,000 locking up a man, guarding him, and keeping him behind bars, but we won't pay $10,000 for him to be rehabilitated. You cannot solve this problem by locking up the population.\"\nMeanwhile, critics of some of the state's crime laws— including Gov. Susana Martinez — say the state's \"three strikes\" law especially is ineffective, contending it is so narrow that no inmate is currently serving a life sentence under it.\nThere's also a lack of targeted funding efforts for district attorneys' offices and law enforcement agencies, especially in high-crime areas of the state, Attorney General Hector Balderas said.\nThe shootings this week occurred as Balderas has launched a task force to examine how repeat offenders leave the state's criminal justice system quickly and commit more crimes — a move prompted after another repeat offender in May was charged with killing a police officer in Rio Rancho , an Albuquerque suburb.\nLymon is being prosecuted in federal court as \"a worst of the worst\" offender under a program meant to keep repeat criminals off the streets. A federal criminal complaint against him said he fired six times at Webster outside a pharmacy during a traffic stop.\nIn 2002, court records show, Lymon pleaded guilty to voluntary manslaughter and aggravated battery and to fraud and forgery the year before. He also faced aggravated battery and kidnapping charges last year that records show were dismissed.\nTorrez, who police say confessed to shooting Lilly Garcia after a lane dispute with her father, has been tied to violent crimes in New Mexico dating back a decade, but all the cases were dropped, including a 2006 fight in which he was charged with aggravated battery and assault. A grand jury indictment said Torrez assaulted another man with a handgun and applied force to a woman with the weapon or touched her with it, intending to injure her.\nThe only crime for which he has been prosecuted was a misdemeanor speeding violation in 2013.\nAround that time, charges including abandonment or abuse of a child and aggravated battery of a household member were dismissed for lack of evidence. Prosecutors also were not able to proceed with 2006 domestic violence charges.\nIn Tuesday's shooting, he has been charged with murder, assault, child abuse and other crimes.\nBalderas, the attorney general, said state lawmakers have to become smarter about how they appropriate public safety funds, saying prosecutors and law enforcement are not always getting the resources needed to vigorously go after criminals and argue cases.\n\"I do believe the justice system is being overrun right now by very violent situations,\" he said. \"There are simply not enough law enforcement and prosecutors to match the challenges being faced in our communities.\"", "external_links": ["http://ap.org/schemas/03/2005/apcm", "http://ap.org/schemas/03/2005/apnm"], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-24T16:26:15.746+03:00", "highlightTitle": ""}