{"organizations": [], "uuid": "725f0a98cbd3c263c65775bc66609f70a1c370e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kentucky.com", "main_image": "http://media.kentucky.com/smedia/2015/10/15/21/29/lL7Go.AuSt.79.jpeg", "site_section": "http://www.kentucky.com/232/index.rss", "section_title": "Kentucky.com -- Sports Update", "url": "http://www.kentucky.com/welcome_page/?shf=/2015/10/15/4089480_mark-story-loss-proves-uk-football.html", "country": "US", "title": "42nd District soccer: Henry Clay boys and girls sweep district titles", "performance_score": 0, "site": "kentucky.com", "participants_count": 1, "title_full": "42nd District soccer: Henry Clay boys and girls sweep district titles", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T05:58:00.000+03:00", "replies_count": 0, "uuid": "725f0a98cbd3c263c65775bc66609f70a1c370e8"}, "author": "jmoore@herald-leader.com (Josh Moore)", "url": "http://www.kentucky.com/welcome_page/?shf=/2015/10/15/4089480_mark-story-loss-proves-uk-football.html", "ord_in_thread": 0, "title": "42nd District soccer: Henry Clay boys and girls sweep district titles", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Order a reprint of this story \nHenry Clay's Collin Rose shoots on goal against Sayre during the boys' 42nd district finals at R. L. Grider Stadium at Bryan Station in Lexington, Ky., Thursday, October 15, 2015. Photo by Matt Goins HERALD-LEADER | Buy Photo \nThe Henry Clay girls won their third straight 42nd District championship with a 5-0 win over host Bryan Station on Thursday night. \nThe Blue Devils' win came behind goals from four different players and a backline that allowed few shots on goal — none in the second half. \nIt was Bryan Station's first appearance in a district championship. Blue Devils defender Brett Edwards, the tournament MVP, said her team knew it needed to communicate effectively to stave off an upset-minded Station team playing on its home field. \nHigh school notebook: Boyle County and Danville have 'Titletown' rocking once more \nHenry Clay was noticeably vocal, especially in the first half as it took a 3-0 advantage before the break. Developing that discussion has been a process, though, Edwards said. \nGrace Whalen, who scored the Blue Devils' second goal three minutes into the contest, shared a game-within -a-game Henry Clay plays to better its on-field vocals. \n\"We do a battle of the benches, where our bench is louder than the other bench,\" Whalen said. \"Everyone on the field is fighting for each other. That's what wins these games more than skill, honestly.\" \nFellow defender Caroline Totty said communication was an even greater point of emphasis entering the district tournament. \n\"If we don't talk we just get sort of get jumbled up and forget whose mark is what,\" Totty said. \"So we've really stressed communication because it keeps us organized.\" \nHenry Clay played with a lead for all but 53 seconds of the game. That's how long it took Emily Cashman to put the Blue Devils on the board with a strike inside the box. \nWhalen lost her mark and put a header in two minutes later. Ashley Chindo floated a third goal in from just outside the box on the keeper's left side to give the Blue Devils their halftime lead. \nSara Ueland added the daggers with back-to-back goals in the 59th and 60th minute. \nAlthough his team scored five times, Coach Mebit Aragaw was more impressed with his back line's performance Thursday. \n\"It's hard to get noticed if you're a defender,\" Aragaw said. \"I think that's the one thing we've done consistently all year.\" \nBoth teams earned a berth to the 11th Region tournament by virtue of reaching the district finals — a feat expected of Henry Clay each year. \nHenry Clay bests Sayre \nHenry Clay earned its sixth straight district title with a 2-0 win over Sayre in the 43rd District boys' championship at Bryan Station. \nThe Blue Devils maintained heavy pressure in the first half, but Spartans kept getting in the way. Sayre keeper Robbie Goodman prevented several good balls from finding the net. \nJosh Strange finally capitalized for the Blue Devils off a cross from the left side that he laid in with a minute to go in the first half. \nBraxton Burton added another score to give Henry Clay more breathing room with 31 minutes to play. \nThe backline held strong all night for the Blue Devils, allowing Sayre few solid opportunities. \n\"Our back four is really, really cohesive,\" said Aime Mabika, a University of Kentucky commit. \"We feel like if we give up a goal, it's almost the end of the world.\" \nHe said the Blue Devils pride themselves on their 13 goals allowed this season, best in the region and tied for second with Belfry in the state entering Thursday. (Mercer County has allowed just 11 goals this year.) \nBoth teams will participate in the 11th Region tournament in Frankfort next week. \nIt will be only the second region tournament for Sayre, which played in the first round of the 13th Region tournament in 2009. \nPKs decide 43rd boys' title \nPaul Laurence Dunbar claimed the 43rd District boys' championship after defeating Lexington Catholic 4-3 in penalty kicks Thursday at Lafayette. \nRicky Clemente scored the game-deciding PK after Lexington Catholic missed its shot in the fifth round. The Bulldogs (15-6-1) won their sixth straight district title. \nHarrison Grabmeyer, Jack Sheroan and Javier Delgado also hit PKs for Dunbar. \nIt was the second straight game that ended in PKs for LexCath (10-10-2). The Knights advanced past Tates Creek in the district semifinals after winning 4-2 on PKs. HENRY CLAY 5, BRYAN STATION 0 \n42nd District girls' championship at Bryan Station \nG — HC: S. Ueland 2 (59', 60'), Cashman (1'), Chindo (28'), Whalen (3'). \nGK — HC: Patton. BS: Gentry. \nRecords: Henry Clay 9-7-2, Bryan Station 10-5-3. \n42nd District girls' all-tournament team \nMVP —Brett Edwards, Henry Clay \nTeam —Amber McIntosh, Bryan Station; Katelyn Gentry, Bryan Station; Brittany Graham, Bryan Station; Ashley Chindo, Henry Clay; Sara Ueland, Henry Clay; Kate Johnson, Sayre; Grace Whalen, Henry Clay; Hannah Brady, Sayre; Keyli Borman, Scott Co.; Hayley Combs, Scott Co. HENRY CLAY 2, SAYRE 0 \n42nd District boys' championship at Bryan Station \nG — HC: Strange (39'), Burton (49'). \nGK — HC: Gregory. S: Goodman. \nRecords: Henry Clay 17-2-1, Sayre 11-3-4. \n42nd boys' all-tournament team \nTeam —Thomas Little, Bryan Station; Jaime Trujillo, Bryan Station; Braxton Burton, Henry Clay; Aime Mabika, Henry Clay; Collin Rose, Henry Clay; Josh Strange, Henry Clay; Alex Mitchell, Sayre; Will Newton, Sayre; Nick Duncan, Scott Co.; Jarred Menke, Scott Co. \nHenry Clay chose not to name an MVP. \n43rd boys' all-tournament team \nMVP —Justin Kelly, Paul Laurence Dunbar \nTeam —Cameron Feldman, Lafayette; Jimmy Kaindu, Lafayette; Trent Marshall, Lexington Catholic; Colton Tate, Lexington Catholic; David Yackzan, Lexington Catholic; Neil Lumm, Lexington Christian; Ricky Clemente, Paul Dunbar; Harrison Grabmeyer, Paul Dunbar; Justin Kelly, Paul Dunbar; Caleb Norris, Paul Dunbar; Nolan Adams, Tates Creek; Amadi Mubelela, Tates Creek Josh Moore: (859) 231-1307.Blog: Kentucky.com/josh-moore.Twitter: @HLpreps.", "external_links": [], "published": "2015-10-16T05:58:00.000+03:00", "crawled": "2015-10-16T10:17:15.649+03:00", "highlightTitle": ""}