{"organizations": [], "uuid": "91b556dae5477f52f4b250e5dd5534d52d540a89", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.keloland.com", "main_image": "http://www.keloland.com/_images/data/800x600/67924.jpg", "site_section": "http://www.keloland.com/_xml/_rss.cfm", "section_title": "KELOLAND.COM: News, Weather and Sports", "url": "http://www.keloland.com/newsdetail.cfm/vandals-video-themselves-at-car-lot/?id=186218", "country": "US", "title": "Vandals Video Themselves At Car Lot", "performance_score": 0, "site": "keloland.com", "participants_count": 0, "title_full": "Vandals Video Themselves At Car Lot", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T03:04:00.000+03:00", "replies_count": 0, "uuid": "91b556dae5477f52f4b250e5dd5534d52d540a89"}, "author": "", "url": "http://www.keloland.com/newsdetail.cfm/vandals-video-themselves-at-car-lot/?id=186218", "ord_in_thread": 0, "title": "Vandals Video Themselves At Car Lot", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Angela Kennecke"], "text": "Vandals Video Themselves At Car Lot October 16, 2015, 6:04 PM by Angela Kennecke SIOUX FALLS, SD - \n\"The one thing that never surprises me is that in any type of crime there always is a level of stupidity and it comes right with it--right on camera, looking into the camera,\" Mike Schulte of Schulte Subaru said. \nCaught on camera--a couple of young people spent the night car hopping from car to car in a Sioux Falls dealer's lot. But a few moments of what appears to be doing stunts for their own videos, resulted in thousands of dollars in damages and police looking to make arrests. \nRather than deals being made on the car lot, it's a crime scene. Police investigators are going over 19 damaged cars covered in foot and hand prints, collecting evidence of the vandalism that happened after dark. But the best evidence of all is on video. \n\"This is one of the cars that was caught directly on camera, by the camera right there--where he took a running jump and turned around backwards with his rear end and planted himself on the hood. Obviously the whole hood has to be replaced on this car,\" Schulte said. \nAngela Kennecke: So you got a good shot of his face right up there? Schulte: Absolutely, both of them. \nThe fact that a half dozen video cameras are mounted on the buildings and the lot is well lit didn't deter these two at all. \n\"Do they not realize they're standing right in front of the camera? You'll see that they were taking pictures of themselves; recording it. So our hope is that somebody is going to see it on social media someplace,\" Schulte said. \nThe two culprits not only jumped on the hoods, they leaped from car to car lined up in the lot. \n\"That's a pretty good distance he's jumping,\" Schulte said. \nWhat's also surprising is the time this happened, just after 8 o'clock at night. Someone driving along busy Minnesota Avenue spotted them jumping on top of the cars and called police. \nYou see the two running off when that happened, but not before more than an estimated $28,000 of damage was done to the vehicles. \nKennecke: Instead of a hail sale, are you going to have a car jumping sale? Schulte: Luckily the damage to the cars can be repaired perfectly, so that is the good part. It will just take a little time to get it done. \nSchulte Subaru is offering a $1,000 reward to anyone who can positively identify the two behind this unwelcome stunt work. \n\"It looked like they enjoyed doing it, which is the saddest part,\" Schulte said. \nSchulte says he'll submit a claim to his insurance company for the damage, but doesn't know yet how much will be covered. © 2015 KELOLAND TV. All Rights Reserved.", "external_links": [], "published": "2015-10-17T03:04:00.000+03:00", "crawled": "2015-10-17T03:07:04.124+03:00", "highlightTitle": ""}