{"organizations": [], "uuid": "77f52178377f30155c5158967f9436546c340cac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.beaumontenterprise.com", "main_image": "http://ww1.hdnux.com/photos/41/22/23/8725716/3/rawImage.jpg", "site_section": "http://www.beaumontenterprise.com/sports/other/collectionRss/Sports-Other-Sports-Heds-7427.php", "section_title": "Sports Other Sports Heds", "url": "http://www.beaumontenterprise.com/sports/article/Anderson-makes-40-saves-Senators-beat-Canadiens-6544530.php", "country": "US", "title": "Anderson makes 40 saves, Senators beat Canadiens 5-2", "performance_score": 0, "site": "beaumontenterprise.com", "participants_count": 1, "title_full": "Anderson makes 40 saves, Senators beat Canadiens 5-2", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T05:26:00.000+03:00", "replies_count": 0, "uuid": "77f52178377f30155c5158967f9436546c340cac"}, "author": "The Associated Press", "url": "http://www.beaumontenterprise.com/sports/article/Anderson-makes-40-saves-Senators-beat-Canadiens-6544530.php", "ord_in_thread": 0, "title": "Anderson makes 40 saves, Senators beat Canadiens 5-2", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Close Image 1 of 5 \nMontreal Canadiens captain Max Pacioretty (67) slides in on Ottawa Senators goaltender Craig Anderson as Senators' Zack Smith (15) defends during second period NHL pre-season hockey action in Montreal, Thursday, Oct. 1, 2015. (Graham Hughes/The Canadian Press via AP) Photo: Graham Hughes, AP Montreal Canadiens captain Max Pacioretty (67) slides in on Ottawa... Image 2 of 5 \nOttawa Senators goaltender Craig Anderson makes a save against the Montreal Canadiens during third period NHL pre-season hockey action in Montreal, Thursday, Oct. 1, 2015. (Graham Hughes/The Canadian Press via AP) Photo: Graham Hughes, AP Ottawa Senators goaltender Craig Anderson makes a save against the... Image 3 of 5 \nOttawa Senators' Mike Hoffman, right, celebrates with teammate Mark Stone after scoring against the Montreal Canadiens during second period NHL pre-season hockey action in Montreal, Thursday, Oct. 1, 2015. (Graham Hughes/The Canadian Press via AP) Photo: Graham Hughes, AP Ottawa Senators' Mike Hoffman, right, celebrates with teammate Mark... Image 4 of 5 \nDallas Stars goalie Kari Lehtonen (32) makes a save on a shot by Tampa Bay Lightning defenseman Luke Witkowski during the second period of an NHL preseason hockey game Thursday, Oct. 1, 2015, in Tampa, Fla. Trailing the play is Stars' Jordie Benn (24). Photo: Chris O'Meara, AP Dallas Stars goalie Kari Lehtonen (32) makes a save on a shot by... Image 5 of 5 \nTampa Bay Lightning goalie Ben Bishop (30) makes a save on a shot by Dallas Stars left wing Travis Moen (27) during the first period of an NHL preseason hockey game Thursday, Oct. 1, 2015, in Tampa, Fla. Photo: Chris O'Meara, AP Tampa Bay Lightning goalie Ben Bishop (30) makes a save on a shot... Anderson makes 40 saves, Senators beat Canadiens 5-2 1 / 5 Back to Gallery Craig Anderson made 40 saves, Mark Stone and Cody Ceci each had a goal and two assists and the visiting Ottawa Senators beat the Montreal Canadiens 5 -2 in an exhibition game Thursday night. Andrei Markov and Nathan Beaulieu scored for Montreal, and Carey Price made 16 saves. Montreal's Max Pacioretty, returning earlier than expected from a knee injury, wore the 'C' for the first time at the Bell Centre since being named captain at the start of training camp. The teams will meet again Saturday night in Ottawa. ___ BROWN LIFTS LIGHTNING PAST STARS In Tampa, Florida, J.T. Brown broke a tie with 4:32 left, and Ben Bishop made 23 saves in the Lightning's 3-2 victory over the Dallas Stars . Nikita Kucherov and Valtteri Filppula also scored for Tampa Bay. Curtis McKenzie and Valeri Nichushkin scored for Dallas, and Karin Lehtonen made 21 saves. Southeast Texas sports news", "external_links": [], "published": "2015-10-02T05:26:00.000+03:00", "crawled": "2015-10-02T06:11:14.755+03:00", "highlightTitle": ""}