{"organizations": ["Clemson", "ESPN"], "uuid": "d0da8074d4ca38ea724b04eba3418de09ec74842", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tigernet.com", "main_image": "http://i3.tigernet.com/stories/15/football/davis_rece_gameday_700.jpg", "site_section": "http://feeds.feedburner.com/tigernet", "section_title": "TigerNet.com - Clemson Tigers Sports News", "url": "http://www.tigernet.com/story/football/ESPNs-Rece-Davis-talks-rain-Clemson-Notre-Dame-14117", "country": "US", "title": "ESPN's Rece Davis talks rain, Clemson and Notre Dame", "performance_score": 0, "site": "tigernet.com", "participants_count": 0, "title_full": "ESPN's Rece Davis talks rain, Clemson and Notre Dame", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T21:33:00.000+03:00", "replies_count": 0, "uuid": "d0da8074d4ca38ea724b04eba3418de09ec74842"}, "author": "", "url": "http://www.tigernet.com/story/football/ESPNs-Rece-Davis-talks-rain-Clemson-Notre-Dame-14117", "ord_in_thread": 0, "title": "ESPN's Rece Davis talks rain, Clemson and Notre Dame", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Rece Davis"], "text": "View Full Profile back into the Heisman conversation. \n“Potentially, for sure. Anytime you're on a stage like this, there are a lot of individual accolades that could follow if you play well, but I think the significance of this game for Deshaun and Clemson is much more than the Heisman, even though I have great respect for the Heisman Trophy, but I imagine that's not first on his agenda right now. It's playing well against a really good, really experienced defense and putting Clemson squarely in the playoff picture,” Davis said. “Candidate for sure. I think it would be presumptuous to say if they do this sitting here in early October that they would definitely be in or definitely won't be in.” \nWould a win for the Tigers vault them into College Football Playoff talk and how would a loss affect the chances of both teams? \n“It's been a chaotic first month of the season, and I think you see our Football Power Index projections show that there is a great chance of having two-loss conference champions,” Davis said. “In fact, last year the scenario we had with the five major conferences and all of the champions either being undefeated or with one loss, that never happened in the BCS era. That was the outlier. It is more probable that you will have a one or two loss conference champion. I think the best thing you can say is that if Clemson wins - or Notre Dame wins - it will be very beneficial and a great bullet point on their resume as the selection committee evaluates them and put them in good position to be a strong candidate.” . @ClemsonTigers read my lips. How much orange will we see @CollegeGameDay tomorrow?A challenge: make it a great scene.Don't wilt in the rain — Rece Davis (@ESPN_ReceDavis) October 2, 2015 \nOTHER NOTES \nHis thoughts on Clemson playing the “no respect card” \n“I think everybody likes to play the disrespect card. It's a tried and true motivation. 'Nobody believes us. Everybody hates us. Let's go show them.' That's a lot easier to get guys riled up than to say, 'Everybody's telling you you're really good and everybody loves you.' That doesn't enrage quite the way the disrespect card does. I don't think anybody has but the highest respect for Clemson. If people think Notre Dame is better, that doesn't mean they think Clemson isn't good. I think a lot of times people tend to think that you didn't pick this team or that team, you hate the other one. There are degrees on the scale. With Clemson joining Alabama and Oregon as the only other Power Five teams to have 10 win seasons the last four years, it's impressive. I think they've established their place.” \nHow does the weather affect GameDay? \n“I don't remember which year it was exactly, but they were at West Point one year, and lightning struck the set or struck close to the set. Mark May, Trev Alberts and I were in studio and they basically said 'You guys are on for an hour-and-a-half or two hours' or whatever was left in the show. I didn't experience that, but I did experience the flip side when they got chased off the set and we ended up doing a show on the fly. I think over the course these guys have been through a lot of stuff, whether it is cold weather or Biblical-proportion rains, which we are getting now. We have the best crew in television, and they are setting up outside and they will make it seem like it is a balmy, sunshiny day by the end. \n“Obviously we've called games over the years where the weather conditions have been less than ideal, but I don't know if I've seen anyone forecasting a foot or more of rain as what we're seeing right now. It's a little bit different for sure.” \nWhy he likes Clemson \n“We are always treated beautifully, and this is a great place. We love coming here, and we will love it even more if a lot of people turn out in the rain for the show tomorrow. We have a lot of confidence and faith in the excitement level of not just Clemson football but this game against Notre Dame. There is just something still about that name of Notre Dame, and the fact that they haven't been here since 1977 makes it something the fans will get behind. They will be eager to get out there in the mosh pit and maybe take a mud bath by the end of the morning.” Rate this Story: Send Feedback to David Hood: Email | Comment", "external_links": [], "published": "2015-10-02T21:33:00.000+03:00", "crawled": "2015-10-03T08:23:46.572+03:00", "highlightTitle": ""}