{"organizations": [], "uuid": "71ef83360d1d39845a0e0b834e5543a244a1e573", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/2/8/155977/World/Region/Yemen-Houthis-say-fire-missile-in-retaliation-for-.aspx", "country": "EG", "title": "Yemen Houthis say fire missile in retaliation for Saudi 'war crimes' - Region - World", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Yemen Houthis say fire missile in retaliation for Saudi 'war crimes' - Region - World - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "71ef83360d1d39845a0e0b834e5543a244a1e573"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/2/8/155977/World/Region/Yemen-Houthis-say-fire-missile-in-retaliation-for-.aspx", "ord_in_thread": 0, "title": "Yemen Houthis say fire missile in retaliation for Saudi 'war crimes' - Region - World", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Suspected Saudi-led air strike kills 28 at Yemen wedding Saudi-led coalition denies striking Yemen wedding Yemen rebel-allied party says ready for UN-brokered peace Yemen's Houthi forces fired a ballistic missile on Thursday in retaliation for attacks by a Saudi-led coalition, a source in the Iranian-allied group said, and a Houthi-linked television station said a Scud missile had been fired at a Saudi air base.\nAl-Masirah television reported that a Scud, a powerful Cold War-era weapon, had been fired at a military base near the city of Khamees Mushait in the kingdom's southwest.\nThe area is home to the King Khaled air base, the largest air force base in southern Saudi Arabia, the world's top oil exporter, but there are no oil facilities in the vicinity.\nThe television station said the target was hit. It was not immediately possible to independently verify that report.\nResidents in Yemen's capital reported hearing a roar as what they said was a Scud was launched from near the city.\n\"The army and people's committees at dawn today fired a ballistic missile in response to the continuation of the Saudi aggression in the commission of war crimes against the Yemeni people,\" the source said.\nSaudi Arabia led an Arab military intervention against the Houthis beginning on March 26 to restore the Yemeni government ousted by the group and fend off what it sees as the creeping influence of the Shia Muslim group's main ally, Iran.\nThe Houthis say their rise to power is a revolution against corrupt officials beholden to Saudi Arabia and the West.\nThe Scud had been launched at Saudi Arabia by Yemeni forces several times during the nearly seven-month-old war, but has been shot down by American-provided Patriot missiles at least twice.", "external_links": [], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-15T15:10:03.169+03:00", "highlightTitle": ""}