{"organizations": ["Oakland Raiders"], "uuid": "77cf0490f58bb60002b4b004ced4b4c6f3bd1115", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.spokesman.com", "main_image": "http://media.spokesman.com/img/logos/sr200.png", "site_section": "http://www.spokesman.com/feeds/stories/sports/", "section_title": "Spokesman.com: Sports stories", "url": "http://www.spokesman.com/stories/2015/oct/23/oakland-raiders-get-top-returner-and-backup-rb-tai/", "country": "US", "title": "Oakland Raiders get top returner and backup RB Taiwan Jones on field - Fri, 23 Oct 2015 PST", "performance_score": 0, "site": "spokesman.com", "participants_count": 0, "title_full": "Oakland Raiders get top returner and backup RB Taiwan Jones on field - Fri, 23 Oct 2015 PST", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T06:42:00.000+03:00", "replies_count": 0, "uuid": "77cf0490f58bb60002b4b004ced4b4c6f3bd1115"}, "author": "", "url": "http://www.spokesman.com/stories/2015/oct/23/oakland-raiders-get-top-returner-and-backup-rb-tai/", "ord_in_thread": 0, "title": "Oakland Raiders get top returner and backup RB Taiwan Jones on field - Fri, 23 Oct 2015 PST", "locations": ["Calif.", "ALAMEDA"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Latavius Murray", "Taiwan Jones"], "text": "ALAMEDA, Calif. – The Oakland Raiders hope their sporadic running game can finally find some consistency now that Latavius Murray has fully recovered from a shoulder injury that slowed him the past few games. \nGetting Taiwan Jones back on the field this week is equally important. \nJones is Murray’s primary … \nALAMEDA, Calif. – The Oakland Raiders hope their sporadic running game can finally find some consistency now that Latavius Murray has fully recovered from a shoulder injury that slowed him the past few games. \nGetting Taiwan Jones back on the field this week is equally important. \nJones is Murray’s primary backup and the team’s top kickoff returner. He also maintains unofficial hold of the title as the fastest player on Oakland’s roster despite missing 17 of the past 21 games with a foot injury. \nThe Raiders need the help both offensively and on special teams. \nOakland is 27th in rushing and has not been nearly as effective on kickoff returns as it was earlier in the season when Jones was healthy. \n“Getting Latavius back to 100% and with Taiwan being available helps us,” Raiders offensive coordinator Bill Musgrave said. “The fact that (Jones) is available again should be a positive.” \nThat’s definitely how Jones views it, especially after initially thinking his season might end prematurely for a second straight year. \nA fourth-round pick from Eastern Washington in 2011, and one of the final players drafted by late owner Al Davis, Jones injured his foot while returning a kickoff against Cleveland in Week 3. It’s the same foot he broke in the season opener last year and sidelined him for the final 15 games. \n“I was real nervous which was part of the reason I didn’t play before the bye week,” Jones said Friday. “Mentally I was like, ‘not this again.’ But it wasn’t as bad as we thought it was. Obviously it helped by not playing and then getting the bye week.” \nMurray has been dealing with his own injury issues, but has been a full participant in practice this week and, like Jones, is listed as probable to play Sunday in San Diego. \nThe Raiders will likely lean heavily on both against the Chargers, who rank 29th against the run this season. \n“They’re a division team and it’s our first game coming off a bye week,” Jones said. “We just have to take each game at a time, but this is the task in front of us. We have to focus on finishing this game.” \nJones is averaging 4.3 yards a carry, but he’s run the ball just seven times while playing sparingly on offense behind Murray in the first three games. \nWhere Jones’ absence has really been felt is on special teams. He is averaging 30.3 yards on kickoff returns, the second-highest mark in the NFL, though Jones doesn’t yet have enough returns to qualify. \nOakland signed return specialist Walt Powell during the bye week and could use him both on punts and kickoffs. That might be why Raiders coach Jack Del Rio was noncommittal when asked if Jones would return kickoffs against the Chargers. \n“He’s a good football player, we’re glad to have him back,” Del Rio said. “We’ll see how it goes.” \nJones doesn’t seem worried either way. After believing his season might be over when he got hurt, simply being back on the field is a solid enough first step. \nPlus Jones still reigns as the fastest man inside the Raiders locker room, at least by his count. \n“Oh yeah,” Jones said. “(First-round pick) Amari Cooper is probably second, but he just doesn’t want to admit it.” \nNOTES: DT Denico Autry continues to have concussion symptoms and will not play against San Diego. Autry passed the NFL protocol for concussions and practiced on Wednesday before suffering a setback. . DT Justin Ellis (ankle) has also been ruled out. . S Charles Woodson (shoulder) is probable. \n© Copyright 2015 Associated Press. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.", "external_links": [], "published": "2015-10-24T06:42:00.000+03:00", "crawled": "2015-10-25T01:16:29.366+03:00", "highlightTitle": ""}