{"organizations": [], "uuid": "df0389d4a35c46c8fcdeebac675bf163b5f6dd67", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deseretnews.com", "main_image": "http://img.deseretnews.com/images/article/hires/1607850/1607850.jpg", "site_section": "http://www.deseretnews.com/sports/index.rss", "section_title": "Sports news and headlines for the Utah Jazz, BYU Cougars, Utah Utes and high schools, Salt Lake City sports, Utah sports - Deseret News", "url": "http://www.deseretnews.com/article/865638382/Home-hasnt-been-so-sweet-in-Pac-12-play.html", "country": "US", "title": "Home hasn't been so sweet in Pac-12 play", "performance_score": 0, "site": "deseretnews.com", "participants_count": 11, "title_full": "Home hasn't been so sweet in Pac-12 play | Deseret News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T03:00:00.000+03:00", "replies_count": 12, "uuid": "1baf4366ce7cfb86abbb65edc357c751a1c8d623"}, "author": "Dirk Facer", "url": "http://www.deseretnews.com/article/865638382/Home-hasnt-been-so-sweet-in-Pac-12-play.html#post-0", "ord_in_thread": 0, "title": "Home hasn't been so sweet in Pac-12 play", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Utah is just 7-11 in conference games played since 2011. The Utes are 8-11 on the road.\n Utah notebook: Utes break in new turf Utah No. 23 California (5-0, 2-0) at No. 5 Utah (4-0, 1-0)\nSaturday, 8 p.m.\nTV: ESPN\nRadio: 700AM\n“ I can’t say enough good things about our crowd and the support they give us. The atmosphere Saturday night should be electric. It should be one of the best crowds that we’ve had. I seem to say that every week.”\nKyle Whittingham It promises to be a big weekend up on the hill. Besides pitting two nationally ranked and undefeated teams, Saturday’s game between No. 5 Utah and No. 23 California is accompanied by the debut of new FieldTurf ; throwback uniforms for the Utes ; homecoming festivities; the Crimson Club Hall of Fame inductees; ESPN’s “College GameDay”program; and a national television audience on the four-letter network.\nWhat isn’t guaranteed, though, is a victory by the home team. Since joining the conference in 2011, Utah is just 7-11 in Pac-12 play at home. The Utes have an 8-11 record on the road.\nUtah coach Kyle Whittingham doesn’t have a theory as to why.\n“No, I don’t, but I can’t say enough good things about our crowd and the support they give us,” Whittingham said. “The atmosphere Saturday night should be electric. It should be one of the best crowds that we’ve had. I seem to say that every week.”\nThe Utes have already announced the program’s 34th consecutive sellout. That includes a school-record crowd of 47,825 for the season opener against Michigan.\nWhittingham acknowledged that the streak has meant a lot to the team.\n“Our players feed off of that and so the atmosphere at Rice-Eccles is great,” he said. “Now, why we haven’t fared much better there than on the road, I think you just attribute that to the level of competition you’re playing in the Pac-12.”\nLast season, Utah went 1-3 in conference games at home. The Utes defeated USC (24-21), but lost to Washington State (28-27), Oregon (51-27) and Arizona (42-10)\nUtah’s other home records in Pac-12 competition include a 2-3 mark in 2013, a 2-2 finish in 2012, and a 2-3 finish in 2011.\nAs of late, home victories are difficult to get in the Pac-12. Visitors are 8-2, thus far, in conference games this season.\n“I don’t have an answer for it, “ said Whittingham, who compared the statistical deviation to the Utah-BYU rivalry. From 1995-2000, the visiting team prevailed each time.\nWhatever the reason, Whittingham acknowledged that things have been pretty heavy in favor of the visitors in Pac-12 games this fall. Among those already suffering losses at home include projected contenders Arizona, Arizona State, Oregon, UCLA and USC.\n“I don’t know what the answer is,” Whittingham said. “I don’t know if it’s just the luck of the draw or what.”\nAs members of the Pac-12, Utah is 1-0 at home against California and Stanford. The Utes are 1-1 versus Colorado, Oregon State, UCLA, USC and Washington State. They’re 0-1 in games with Oregon and Washington, and 0-2 in contests with Arizona and Arizona State.\n ", "external_links": ["http://deseretnews.sportsdirectinc.com/football/ncaaf-teams.aspx?page=/data/ncaaf/teams/team93.html"], "published": "2015-10-06T03:00:00.000+03:00", "crawled": "2015-10-06T22:07:29.289+03:00", "highlightTitle": ""}