{"organizations": [], "uuid": "a47d823697b11579c719d86fd6f5e0175f74f019", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.indystar.com", "main_image": "http://www.gannett-cdn.com/-mm-/54e44715a900afb68cf3a1e1f61e5be59cacba2a/c=0-0-2064-1166&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/07/Indianapolis/Indianapolis/635798087668845339-41-ColtsJags-mk.jpg", "site_section": "http://rssfeeds.indystar.com/indystar/allsports", "section_title": "Indystar - All Sports", "url": "http://www.indystar.com/picture-gallery/sports/nfl/colts/2015/10/08/gallery--colts-vs-texans-pregame/73619868/", "country": "US", "title": "Doyel: Luck & the magical mystery Colts offense", "performance_score": 0, "site": "indystar.com", "participants_count": 0, "title_full": "Doyel: Luck & the magical mystery Colts offense", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T19:39:00.000+03:00", "replies_count": 0, "uuid": "a47d823697b11579c719d86fd6f5e0175f74f019"}, "author": "", "url": "http://www.indystar.com/picture-gallery/sports/nfl/colts/2015/10/08/gallery--colts-vs-texans-pregame/73619868/", "ord_in_thread": 0, "title": "Doyel: Luck & the magical mystery Colts offense", "locations": ["Houston"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Doyel", "Gregg Doyel", "Andrew Luck"], "text": "Doyel: Andrew Luck and the magical mystery Colts offense Gregg Doyel , gregg.doyel@indystar.com 12:39 p.m. EDT October 8, 2015 Buy Photo Will he or won't he? Andrew Luck says he plans on playing Thursday night in Houston. (Photo: Matt_Kryger/The Star) Buy Photo \nLet's assume the Indianapolis Colts know who their quarterback will be on Thursday night in Houston. Let's also assume the team's medical staff isn't guessing but has an actual handle on the severity of Andrew Luck's shoulder injury. And that Colts coach Chuck Pagano isn't confused about Luck's availability, but merely trying to keep the Texans confused . \nLet's be nice to the Colts and assume all of that – in the absence of facts, call those assumptions a leap of faith – and then get down to what we know: \nEven if the Colts are certain who their quarterback is, they still have no idea – four games into the season – what their offense is. \nIs this a big-play passing team that will live and die with T.Y. Hilton and Donte Moncrief down the field? Is it a quick-strike, ball-control bunch built around the backs and tight end? Can the Colts run? With their only legitimate two running backs dealing with a contagious case of fumble-itis, do the Colts even want to run? Do they even have two legitimate running backs? \nIt is what it is, as Pagano likes to say, so let's come out and say what the Colts offense is: \nLost. Luck, Hasselbeck listed as questionable, Colts re-sign Josh Johnson \nThink about that. For years the Colts have devoted most of their free agent money and most of their top draft picks to the offense – well, to the skill players on offense – and one-fourth of the way through Year 4 of the Andrew Luck era they are 21st in the league in yards, 26th in points and 32nd in turnovers. \nWorse, they have looked aimless – no idea what they can do, or what they want to do, or who to put on the field to do what they think they'd maybe like to consider doing. \nCase in point: Andre Johnson. He's the No. 2 receiver on the team. Starts every game, spends most of the first half opposite Hilton when the Colts are in two-receiver sets. But Luck doesn't throw him the ball. Neither did Matt Hasselbeck on Sunday in relief of Luck. \nAnd when the game gets late, Johnson is typically on the sideline while Moncrief is the No. 2 receiver. Phillip Dorsett was the No. 3 receiver at times on Sunday. On several plays, Griff Whalen was the team's fourth receiver while big-money offseason acquisition Andre Johnson watched from the sideline. What has happened to Andre Johnson? \nAnother case in point: Frank Gore. Best tailback on the team, but he has fumbled twice inside the 5-yard line and he dropped the first two passes – not particularly well thrown by Hasselbeck, but catchable nonetheless – he saw on Sunday. And he's on a pitch count, as the Colts call it, which means more carries for rookie Josh Robinson. Robinson averages 2.4 yards per attempt and has been an adventure in fumbling since the preseason. \nThe Colts have gone from ignoring their tight ends – zero targets to that position in Week 2 – to throwing 12 times to one of them, Coby Fleener, on Sunday. The fastest player on the team, Dorsett, caught two balls on Sunday for 7 whole yards. The likely slowest receiver on the team, Whalen, caught one pass for 16 yards. In other words, the Colts are sending their speed guy out for short routes, and their slow guy out for longer routes. \nAnd don't get me started on the offensive line . Sum it up like so: The Colts did two things this offseason to better protect Luck – signed free agent guard Todd Herremans, moved guard Jack Mewhort to tackle – and four games into the season Herremans was inactive and Mewhort is back at guard. \nMaybe the Colts are dumb like a fox. Maybe they're just stupid. Maybe we'll find out more on Thursday, though I'd settle for some clarity at quarterback. Buy Photo \nWhat happened to that high-powered Colts offense we were supposed to see in 2015? (Photo: Matt Kryger / The Star) \nNone was offered this week. The nadir of this two-week opus of obfuscation came Tuesday when Pagano was asked if he'd talked to Luck \"about being out there Thursday night.\" \nPagano said this, and presumably expected you to believe him: \n\"We haven't talked about it, to be honest with you,\" Pagano said. \"We're just preparing for the Texans.\" \nAh. Franchise quarterback. Didn't play last week. Backed up by a 40-year-old who was too sick to practice on Tuesday. And on that same day, Pagano says he and Luck \"haven't talked about\" whether Luck would play Thursday. Perhaps they discussed their favorite flavor of fish taco. \nYou wanna be cynical? On Monday the Colts released the team's No. 3 quarterback, Josh Johnson. On Tuesday they allowed Hasselbeck to miss practice with an undisclosed illness. What option does Luck have but to play on Thursday? \nYour team needs you, Mr. Franchise Quarterback. \nIs that manner of manipulation happening here? And is that why – 24 hours before playing Houston – the Colts hurriedly re-signed Josh Johnson on Wednesday? Because Luck and his people put their foot down and said no? \nNo idea. In an absence of information, we're allowed to wonder. We went to Luck for information, and got this: \n\"Beyond what coach Pagano said,\" Luck answered, \"I won't go into it.\" \nNFL teams try to confuse the opponent. Keep them guessing right up to kickoff. Let's be charitable and assume that's what the Colts are doing – they know exactly what they're doing behind center on Thursday in Houston – even if they have no idea what to do with the other 10 positions. \nTight end Dwayne Allen, expected to play after missing two games with a high ankle sprain, spat truth on the topic this week. Colts tight end Dwayne Allen: Give playmakers (like me) the football \n\"We have all these pieces,\" Allen said. \"It's like, what are we? Are we a running team? Are we a passing team? Who are the (primary) options?\" \nOne of our beat writers, Zak Keefer, asked Pagano \"if there's anything you can put your finger on … why the offense hasn't hit its stride?\" \nPagano said it's not the Colts. It's the Bills. And Jets. And Titans and Jaguars. \n\"I mean, we played some darn good defenses,\" he said. \nAnd then he said the Colts will get better on offense because they will get better on offense. \n\"I think you've just got to keep working and you've just got to keep grinding and you've just got to keep practicing and sooner or later if you keep swinging the ax, the tree will fall,\" he said. \"We're not going to put the ax down. We'll just keep swinging it and keep chopping wood as we like to say. Eventually that tree is going to fall.\" \nTrying hard is one solution. \nTrying something different would be another. \nFind Star columnist Gregg Doyel on Twitter at @GreggDoyelStar or at www.facebook.com/gregg.doyel . 142 CONNECT 28 TWEET 1 LINKEDIN 27 COMMENT EMAIL MORE Read or Share this story: http://indy.st/1Li3tm0 TOP VIDEOS", "external_links": [], "published": "2015-10-08T19:39:00.000+03:00", "crawled": "2015-10-09T03:23:14.423+03:00", "highlightTitle": ""}