{"organizations": [], "uuid": "d45c77df2597326d07310df59b58404868b99676", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.operationsports.com", "main_image": "", "site_section": "http://www.operationsports.com/rss.xml", "section_title": "Operation Sports", "url": "http://www.operationsports.com/newspost.php?id=857984", "country": "US", "title": "9th Circuit Upholds NCAA Can't Restrict Athletes", "performance_score": 0, "site": "operationsports.com", "participants_count": 1, "title_full": "9th Circuit Upholds NCAA Can't Restrict Athletes", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T17:48:00.000+03:00", "replies_count": 0, "uuid": "d45c77df2597326d07310df59b58404868b99676"}, "author": "MMChrisS", "url": "http://www.operationsports.com/newspost.php?id=857984", "ord_in_thread": 0, "title": "9th Circuit Upholds NCAA Can't Restrict Athletes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "9th Circuit Upholds NCAA Can't Restrict Athletes 09:48 AM - September 30, 2015 by MMChrisS In case you've been living under a rock (or you just don't care), the NCAA and Ed O'Bannon have been in a legal war for a few years now. This has effectively ended the NCAA Football and NCAA Basketball franchises for the time being as the case works its way up the courts. Today, we're one step closer to the case going to the Supreme Court, as the 9th Court Circuit of Appeals ruled on the case. Quote: \"We conclude that the plaintiffs have shown that they are injured in fact as a result of the NCAAs rules having foreclosed the market for their NILs in video games. We therefore do not reach the thornier questions of whether participants in live TV broadcasts of college sporting events have enforceable rights of publicity or whether the plaintiffs are injured by the NCAAs current licensing arrangement for archival footage\" Indeed, the 'number one factor holding back NCAA video game growth' as described by EA was the inability to use college athlete's actual likenesses in their games. In the ruling, the court upheld the original ruling by Judge Claudia Wilken in saying: Quote: \"The district court found that it is entirely possible that the NCAA will resume its support for college sports video games at some point in the future, given that the NCAA found such games to be profitable in the past, and that finding of fact was not clearly erroneous. Given the NCAAs previous, lengthy relationship with EA and the other evidence presented, it was reasonable for the district court to conclude that the NCAA may well begin working with EA or another video game company in the future.\" It would seem the crux of the matter at this point for the return of NCAA video games is the NCAA allowing a few things. First, allowing video games to be made again -- as the NCAA currently has a policy in place which doesn't allow for that. Second, the rules on athletes NILs being used would have to be changed. Third, compensation rules would have to be finalized. What is more likely is that the NCAA will take this matter all the way to the Supreme Court as they have alluded to. A Supreme Court ruling could jeopardize the entire system of amateurism the NCAA has built, although there is no real beat on how the Supreme Court might rule since the case hasn't been argued. As far as a return of NCAA Football goes, this case continues to hold up any possibility of that because it is preventing any of the three questions above from being definitively answered. Not only does this case need a final resolution, but systems will need to be put in place for the games to have a chance at returning. At this point, you are easily 24-36 months away from that becoming a reality on any fast-tracked solution sans a miracle, which puts the arrival date of any future game years into the future. # 1 scraw28 @ 09/30/15 10:49 AM or they will have to wait until the outcome of the 2016 elections # 2 HenryClay1844 @ 09/30/15 11:00 AM So, does this mean that the NCAA and the various colleges cannot restrict athletes or anyone from selling their imaging rights? # 3 AyeBruhChill @ 09/30/15 12:00 PM The whole notion of \"amaueturism\" that the NCAA tries to project is nonsense. Are these kids student-athletes? Yes. But this idea that a full ride is adquate compensation and other rules resctrictions under the guise that it is unfair to the student population as a whole is garbage. The NCAA makes a near billion dollar profit of the labor of \"amateurs\". ESPN doesn't have a 8 billion dollar tv deal for the student body, they have it for \"amateurs\". These universities make millions of dollar on \"amateurs\". Urban Meyer, Nick Saban, Kevin Ollie make 5+ mill to coach \"amateurs\". The money they make their schools well covers their free rides. These kids should have a right to their individual brand on things outside of university revenue. They should be able to sell rings and sign autographs. Those things are valuable because of the work THEY did. They should get a cut of their jersey sales and they should be compentsated for things like video games. They need to resolve this, because no one is winning, both in video games and real life. I mean college hoops 2k17?! Nuts # 4 GLO @ 09/30/15 12:26 PM Aye, I respectfully disagree. Being someone who has tens of thousands of dollars in college loan debt, it would appear that education does have a very real monetary value, especially if you go to a large school where tuition can range anywhere from $20k-70k a year. You can't have it both ways. Either education isn't worth anything and nobody should EVER have to pay for it. OR Education is worth the tens of thousands of dollars that they charge for it and be receiving a \"full ride\"the athletes are getting more than fair compensation for the GAMES they play as student athletes. So which is it for you? Education = no value? # 5 mike24forever @ 09/30/15 01:42 PM GLO, No one paid to watch you study or write an exam, or made a video game of you doing it. I'm an educator and I believe student athletes deserve at least a guaranteed 4 years of education and an ability to make money off of their image, above and beyond their scholarship. Of course education has value, but so does their image. # 6 canes21 @ 09/30/15 01:53 PM The education does hold value, but the athletes should be able to do what they want with their image at the same time. If an athlete wants to sing autographs or even sign a minor contract with Nike for a commercial or advertising, they should be allowed. Those are not mutually exclusive events. As for the players getting paid for being in a video game, I can't go into detail about how I feel on that subject because I honestly do not know how I feel. # 7 goillini03 @ 09/30/15 01:57 PM Quote: Originally Posted by canes21 The education does hold value, but the athletes should be able to do what they want with their image at the same time. If an athlete wants to sing autographs or even sign a minor contract with Nike for a commercial or advertising, they should be allowed. Those are not mutually exclusive events. As for the players getting paid for being in a video game, I can't go into detail about how I feel on that subject because I honestly do not know how I feel. I agree mostly with this. I think that brands could not align with a college athlete if the university has ties to a brand. Part of the brand money that the schools get go towards funding of the program. There is a fine line that would need to be discussed. # 8 Deezo @ 09/30/15 02:11 PM Fact is the NCAA is never going to give up the idea that student athletes shouldn't be paid. Universities like Alabama, LSU, Texas, USC, Ohio State, etc make over $100M a year off the football program. Most of which is funneled into the football team or to help fund other non-headline sports. Should the kids get some sort of stipend from the university, most would say yes. Should they be able to make money off their likeness? Maybe, depends on what brands they are endorsing. A Nike school wouldn't like their star RB to sign a shoe deal with UA or ADIDAS. I'd be okay with a kid like Cardale Jones endorsing Nike and getting some addition money for the use of his likeness. BUT...with him being on OS...and OS being sponsored by Nike...they don't have to paid him at the moment. And additionally, schools that make more would potentially be able to \"offer\" players more of a stipend to play with them. It's like the biggest FA pool every year. Unless schools were capped with how much they can pay Student athletes. /rant # 9 CM Hooe @ 09/30/15 02:16 PM An athletic scholarship is basically a full-time job for FBS athletes - based on not only the experiences described by former Northwestern QB Kain Colter, but my personal experience (in my first year of college I lived on the same hall as two football players who made it to the NFL). It is a full-time job which precludes players not only from enrolling in certain classes but also from taking advantage of other opportunities to earn income away from the athletic department. As such, it's my opinion that the players should be compensated as if they were employees while associated with the athletic program. Given also that the TV deals for the television broadcast of college football and basketball games value in the Billions of dollars, it's also my opinion that the NCAA can afford to pay these players what they deserve. Without the players (regardless who they are; ESPN pays to broadcast all the games, not just the ones the stars suit up for) there is no product produced to create that television contract. The current arrangement doesn't have any moral ground to stand and the legal grounds get more uncertain by the day. A better organization than the NCAA would try to stay ahead of the curve here, but my guess is that the NCAA will kill the entire thing before relenting to basic human decency. # 10 GlennN @ 09/30/15 02:33 PM There is an easy alternative - the NCAA could simply license the schools/universities and a publisher (whether EA or another) could make a game featuring those schools. If the rosters were fictional (and did not bear any likenesses to actual players), and there was no create/edit players, or roster sharing (and yeah, I love create/edit players in any sports game, but this is a compromise), then I believe the game would be perfectly consistent with this case. Personally, I couldn't care less whether real players are in the game anyway - I play franchise, so current players are gone soon anyway (I just root for the laundry!). # 11 jmaj315 @ 09/30/15 02:34 PM NCAA football 2020 coming to stores near you # 12 turbineseaplane @ 09/30/15 02:53 PM Wish they'd just release new games with generic everybody and allow unofficial roster importing. Solved # 13 GLO @ 09/30/15 03:07 PM Quote: Originally Posted by mike24forever GLO, No one paid to watch you study or write an exam, or made a video game of you doing it. I'm an educator and I believe student athletes deserve at least a guaranteed 4 years of education and an ability to make money off of their image, above and beyond their scholarship. Of course education has value, but so does their image. Fair point. To counter, then let them take the money they get paid from their image and use that to pay for their education. (just like the rest of us that had to work full or part time jobs to get through college). I understand it's a fine line argument either way, the thing that bothers me is how often this discussion is framed in the (false) context of these student-athletes not having any money for food or other things. I am also an educator and have known plenty of student athletes that are doing more than fine with all the \"extras\" that come along with being a high profile college athlete. As it stands right now the education is \"payment\" in the form of a scholarship. If they want to make the millions that a coach or college executive make then let them work hard and earn it over time just like those adults did. There is nowhere in the work force where 18, 19 or 20 year old kids can come into an organization and demand to be paid as much as the CEO or top execs, no matter how \"famous\" they are. (other than Hollywood and I doubt anyone would argue that Hollywood is the structure we should follow for work-force compensation?) I'm fine with the change to pay the players, but if that happens then remove the scholarships and give them to kids who can't make millions from endorsement deals. If an 18 year old kid gets a 2 million dollar contract from Nike, the $25k tuition shouldn't be a problem. By arguing that they need to get paid and also keep the scholarships you are de-value-ing the education that the scholarship is paying for. There's no way around it. Truth is there probably isn't a neat and clean answer for this.... # 14 ODogg @ 09/30/15 03:10 PM Quote: Wish they'd just release new games with generic everybody and allow unofficial roster importing. Solved This is what they should do!! Sent from my iPhone using Tapatalk # 15 ODogg @ 09/30/15 03:11 PM Just completely randomize rosters Sent from my iPhone using Tapatalk", "external_links": [], "published": "2015-09-30T17:48:00.000+03:00", "crawled": "2015-10-01T00:23:56.892+03:00", "highlightTitle": ""}