{"organizations": [], "uuid": "8a4d20298f1262cafdcebd76f8a257e09ff7bc1e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcconnecticut.com", "main_image": "http://media.nbcconnecticut.com/images/1200*675/Tom+Brady+101815.jpg", "site_section": "http://www.nbcconnecticut.com/news/sports/?rss=y&embedThumb=y&summary=y", "section_title": "NBC Connecticut - Sports", "url": "http://www.nbcconnecticut.com/news/sports/Jets-Dont-Look-Ready-To-Beat-PatsYet-336260381.html", "country": "US", "title": "Jets Don't Look Ready to Beat Pats -- Yet", "performance_score": 0, "site": "nbcconnecticut.com", "participants_count": 1, "title_full": "Jets Don't Look Ready to Beat Pats -- Yet", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T18:04:00.000+03:00", "replies_count": 0, "uuid": "8a4d20298f1262cafdcebd76f8a257e09ff7bc1e"}, "author": "PETE ZWIEBACH", "url": "http://www.nbcconnecticut.com/news/sports/Jets-Dont-Look-Ready-To-Beat-PatsYet-336260381.html", "ord_in_thread": 0, "title": "Jets Don't Look Ready to Beat Pats -- Yet", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Complete coverage of Gang Green Jets Don't Look Ready to Beat Pats -- Yet Getty Images Point your finger all you want, Tom Brady. The NFL's best defense is still coming after you. Two of the NFL’s best are lining up against each other at Foxboro’s Gillette Stadium on Sunday. Amazingly enough, one of them is the Jets. Any guess on the other? Jets Can Be Great if They Play Their Best The Pats are one of the top teams in the league yet again, as they essentially have been since former Jet Mo Lewis knocked Drew Bledsoe out of action nearly 15 years ago, opening the door for that guy Gisele is married to. New England has basically destroyed the competition through its first five games of the season, racking up nearly 37 points a game -- matching the record-setting pace of their perfect 2007 (regular season, that is) campaign. Celebs in the Stands: Royals at Rugby World Cup So, on the surface, it’s: Can the best defense in football stop the best offense? Or at least slow it down? Hard to say. Tom Brady may find tough-going against CBs like old teammate Darrelle Revis and Antonio Cromartie, but that duo won’t spend much time covering the Pats’ two biggest weapons: Gronk and Julian Edelman, both of whom appear poised to have a field day on Sunday. Meanwhile, on the other side of the ball, Brandon Marshall and Chris Ivory aren’t exactly a walk in the park for any opposing D and the Pats’ unit has shown vulnerability vs. both the pass and run so far. Hey Cousins, Revis Is Waiting for You In short, the Jets have the talent to compete with -- and beat -- the defending Super Bowl champs. But it’s about much more than matchups when you’re playing the Pats. They expect to win. All the time. Hard to blame them. Top Sports Photos 2015 On the flip side, Gang Green’s metamorphosis from a not-quite also-ran (what do you even call that?) to a contender has been nothing short of stunning. The way the team played in its last few games, it’s as if they’re more surprised than anyone else. Over the past three contests, the Jets gave away a game to the overmatched Eagles, then put forth inconsistent efforts vs. Miami and Washington, two teams that couldn’t contend in a tough high school league. These are the kind of things that will likely catch up against them when playing a really good team like New England. Either the visitors step up in a big way against the Pats to show they’re truly prepared to be an elite club or they get knocked down a few pegs in what might end up being a blessing in disguise. I think it’s the latter. It should be a close game. But I just don’t think the Jets are ready to be great yet. However, the teams meet again just after Christmas, at MetLife Stadium, and I’ll bet that both will be playoff teams battling for home-field advantage. By then, the Jets should be used to just how good they are. Published at 11:04 AM EDT on Oct 23, 2015", "external_links": [], "published": "2015-10-23T18:04:00.000+03:00", "crawled": "2015-10-24T00:26:12.725+03:00", "highlightTitle": ""}