{"organizations": [], "uuid": "53bf6a3a9f7178ead8ecbc0ee2eca3aa655694ef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.morganton.com", "main_image": "http://bloximages.newyork1.vip.townnews.com/morganton.com/content/tncms/assets/v3/editorial/a/96/a96b334d-59f2-52bd-8407-e5884de9e167/56156146c1283.image.jpg", "site_section": "http://www.morganton.com/search/?q=&t=article&l=25&d=&d1=&d2=&s=start_time&sd=desc&c[]=sports*&f=rss", "section_title": "Morganton.com | The News Herald - sports", "url": "http://www.morganton.com/sports/ap/cal-utah-gets-top-billing-in-weekend-to-beware-of/article_ebc709be-9977-5237-b0f2-aa780ea55937.html", "country": "US", "title": "Cal-Utah gets top billing in weekend to beware of underdogs", "performance_score": 0, "site": "morganton.com", "participants_count": 1, "title_full": "Cal-Utah gets top billing in weekend to beware of underdogs", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T21:06:00.000+03:00", "replies_count": 0, "uuid": "53bf6a3a9f7178ead8ecbc0ee2eca3aa655694ef"}, "author": "RALPH D. RUSSO", "url": "http://www.morganton.com/sports/ap/cal-utah-gets-top-billing-in-weekend-to-beware-of/article_ebc709be-9977-5237-b0f2-aa780ea55937.html", "ord_in_thread": 0, "title": "Cal-Utah gets top billing in weekend to beware of underdogs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ben Margot Cal-Utah gets top billing in weekend to beware of underdogs \nFILE - In this Oct. 3, 2015, file photo, California quarterback Jared Goff passes against Washington State during the first half of an NCAA college football game in Berkeley, Calif. ESPN is bringing \"College GameDay\" to Salt Lake City on Saturday for a showdown of the only remaining undefeated teams in the Pac-12 that few people would have predicted. No. 23 Cal and quarterback Jared Goff are 5-0 for the first time since 2007. The No. 5 Utes (5-0) are getting touted as the top team in the country. Neither team was ranked in preseason. (AP Photo/Ben Margot, File) Lynne Sladky Cal-Utah gets top billing in weekend to beware of underdogs \nFILE - In this Oct. 20, 2012, file photo, Miami fans hold up letters spelling Miami before an NCAA college football game against Florida State in Miami. Florida State and Miami play Saturday in Tallahassee. (AP Photo/Lynne Sladky) Phil Sears Cal-Utah gets top billing in weekend to beware of underdogs \nFILE - In this Nov. 2, 2013, file photo, Florida State fans get fired up before the start of an NCAA college football game against Miami in Tallahassee, Fla. Florida State and Miami play Saturday in Tallahassee. (AP Photo/Phil Sears, File) Steve Cannon Cal-Utah gets top billing in weekend to beware of underdogs \nFILE - In this Nov. 2, 2013, file photo, Miami head coach Al Golden, right, talks to Florida State head coach Jimbo Fisher before the start of an NCAA college football game in Tallahassee, Fla. Florida State and Miami play Saturday, Oct. 10, 2015, in Tallahassee, (AP Photo/Steve Cannon, File) LM Otero Cal-Utah gets top billing in weekend to beware of underdogs \nFILE - In this Oct. 11, 2014, file photo, Oklahoma cornerback Zack Sanchez (15) celebrates scoring a touchdown after intercepting a pass against Texas wide receiver Jacorey Warrick (11) and quarterback Tyrone Swoopes (18) during the first half of an NCAA college football game at the Cotton Bowl in Dallas. Texas and Oklahoma meet Saturday, Oct. 10, 2015. (AP Photo/LM Otero, FIle) Posted: Wednesday, October 7, 2015 2:06 pm | Updated: 2:30 pm, Wed Oct 7, 2015. \nCalifornia at Utah   the College Football Playoff race than Miami at Florida State. \nThis is where we are in college football this season. \nESPN is bringing \"College GameDay\" to Salt Lake City on Saturday for a showdown of the only remaining undefeated teams in the Pac-12 that few people would have predicted. \nNo. 23 Cal and quarterback Jared Goff are 5-0 for the first time since 2007. The No. 5 Utes (5-0) are getting touted as the top team in the country. Neither team was ranked in preseason. \n\"We're viewing this as a good opportunity to go in the national spotlight and make a statement,\" Cal receiver Bryce Treggs said. \nThe other marquee matchup of ranked teams this weekend will be played in Ann Arbor, Michigan, where the 18th-ranked Wolverines (4-1) play surprising No. 13 Northwestern (5-0). Who knew? \nMeanwhile, the Hurricanes and Seminoles are playing with far less fanfare in Tallahassee. It's still a big game, of course. Florida State has not been particularly impressive, but still has to be considered one of the favorites in the Atlantic Coast Conference. The story in Miami has been more focused on coach Al Golden's future than whether the 'Canes can contend in the ACC Coastal. \nThe other juicy rivalry that doesn't have quite the same pop this season is Texas-Oklahoma. The Red River rivals get together for their annual Cotton Bowl date during the Texas State Fair. It's been a tough go for Charlie Strong's Longhorns (1-4) so far, but there is historical precedent for struggling Texas teams beating good Oklahoma teams. Texas is 5-2 in the Red River Rivalry since 1989 when it is unranked and the Sooners are ranked. Though this could be a historically bad Texas team. The Longhorns haven't started this poorly since 1956, when they finished 1-9. \nOn a weekend when upsets could be the big story, Texas will try to pull one of the biggest. \nThe picks: \nTHURSDAY NIGHT LIGHTS \nWashington (plus 16 1-2) at No. 17 Southern California \nTrojans QB Cody Kessler has thrown 54 TD passes and six interceptions since last season; the Huskies have allowed two TD passes this season ... USC 28-14. \nMARQUEE MATCHUPS \nNo. 23 California (plus 6 1-2) at No. 5 Utah \nBears much-improved defense has 18 sacks this season, tops in the Pac-12, after having 16 all of last season ... UTAH 35-28. \nNo. 13 Northwestern (plus 8) at No. 18 Michigan \nLots of defense: Wolverines are second in nation in yards allowed per play (3.10), Wildcats sixth (3.88) ... MICHIGAN 24-10. \nPLUCKY UNDERDOGS \nNo. 2 TCU (minus 10) at Kansas State \nQB injuries have Wildcats linemen volunteering to fill in behind center ... TCU 31-23. \nNo. 10 Oklahoma (minus 16 1-2) vs. Texas at Dallas \nBeating the Sooners would provide some relief in Austin ... OKLAHOMA 35-24. \nMiami (plus 10) at No. 12 Florida State \nRB Dalvin Cook has carried the Seminoles offense and he is iffy with a hamstring injury ... FLORIDA STATE 28-21. \nNavy (plus 14) at No. 15 Notre Dame \nTough turnaround for the Irish after losing at Clemson — and with USC next week ... NOTRE DAME 35-28. \nNo. 11 Florida (minus 6) at Missouri \nNo. 19 Georgia (minus 3) at Tennessee \nThe home underdog is going to win one of these two SEC East games. Maybe both ... UPSET SPECIALS, MISSOURI 23-17 and TENNESSEE 27-21. \nKent State (plus 15) at No. 24 Toledo \nGolden Flashes will try to knock off the Rockets with the No. 1 defense in the MAC — and the worst offense ... TOLEDO 21-13. \nNo. 25 Boise State (minus 15 1-2) at Colorado State \nBroncos back in the rankings and working on a New Year's Six bowl bid ... BOISE STATE 31-21. \nCONFERENCE CALLS \nGeorgia Tech (plus 6 1-2) at No. 6 Clemson \nOld Clemson would pull a Clemson here and get knocked off by the struggling Yellow Jackets ... CLEMSON 28-17. \nArkansas (plus 16) at No. 8 Alabama \nNick Saban does not care what you think about the Crimson Tide ... ALABAMA 35-14. \nNo. 4 Michigan State (minus 14) at Rutgers \nSpartans have struggled to put teams away in the second half ... MICHIGAN STATE 38-13. \nNo. 7 LSU (minus 13) at South Carolina \nGame moved to Baton Rouge, but still looking like a really long season for coach Steve Spurrier and the Gamecocks ... LSU 35-17. \nIllinois (plus 11) at No. 22 Iowa \nHawkeyes have won six of seven against the Illini, average score 27-12 ... IOWA 27-12. \nNo. 21 Oklahoma State (plus 7) at West Virginia \nMountaineers have won last two meetings ... WEST VIRGINIA 35-27. \nMISMATCHES \nMaryland (plus 33) at Ohio State \nIs this the week the Buckeyes break out? ... OHIO STATE 55-14. \nNo. 3 Baylor (minus 44) at Kansas \nThis could get really ugly ... BAYLOR 66-14. \nTWITTER REQUESTS \nEast Carolina (plus 8) at BYU — @adamwride \nSecond of three straight home games for the Cougars against American Athletic Conference opponents ... BYU 35-23. \nWisconsin (plus 1 1-2) at Nebraska — @saunders45 \nLoser drops to 0-2 in the Big Ten West ... WISCONSIN 24-23. \nUConn (pick'em) at UCF — @stholeary \nConFLiCT. Get it? FL vs. CT ... UCF 15-13. \nIndiana (plus 8) at Penn State — @DCAbloob \nStatus of Hoosiers QB Nate Sudfeld (foot) and RB Jordan Howard (ankle) is uncertain; status of the Nittany Lions offense also uncertain ... PENN STATE 24-23. \n___ \nLast week's record: 13-8 straight; 11-9 vs. spread. \nOverall: 71-27; 52-41-3.", "external_links": [], "published": "2015-10-07T21:06:00.000+03:00", "crawled": "2015-10-08T01:36:38.908+03:00", "highlightTitle": ""}