{"organizations": [], "uuid": "5db5318ba09ae504106f7a4d062d0d2fbb74e264", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/47529300.cms", "site_section": "http://timesofindia.indiatimes.com/sports/racing/top-stories/articlelist/10514745.cms", "section_title": "Top Stories - Racing - Sports - The Times of India", "url": "http://timesofindia.indiatimes.com/sports/racing/top-stories/Marquez-shades-Lorenzo-in-Aussie-MotoGP-practice/articleshow/49405557.cms", "country": "IL", "title": "Marquez shades Lorenzo in Aussie MotoGP practice", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "Marquez shades Lorenzo in Aussie MotoGP practice - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "5db5318ba09ae504106f7a4d062d0d2fbb74e264"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/sports/racing/top-stories/Marquez-shades-Lorenzo-in-Aussie-MotoGP-practice/articleshow/49405557.cms", "ord_in_thread": 0, "title": "Marquez shades Lorenzo in Aussie MotoGP practice", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PHILLIP ISLAND: Stricken world champion Marc Marquez edged Jorge Lorenzo to finish fastest rider in Friday's free practice for this weekend's Australian MotoGP at Phillip Island.\nMarquez, who broke his left hand in training last month and cannot successfully defend his world title, clocked a fastest lap of one minute 29.383 seconds to shade fellow Spaniard Lorenzo by 0.050sec.\nOnly Lorenzo and his Italian Movistar Yamaha team-mate Valentino Rossi can win this year's MotoGP crown heading into the final three races of the season.\nWorld championship leader Rossi, who was third quickest behind Lorenzo in morning practice, slipped down the time charts to finish ninth quickest overall, 0.658sec down on Marquez.\nRepsol Honda's Marquez, who is 86 points adrift of Rossi on the championship standings with a maximum of 75 points available, trailed Lorenzo in the morning session.\nBut as the sun came out and the track dried the reigning MotoGP world champion ended the day on top, still some way short of Lorenzo's track pole record of 1:27.899 set in 2014.\nLorenzo improved by over half a second throughout in FP2, where just under nine-tenths of a second separated the top 13 riders.\nTeam Suzuki Ecstar's Maverick Vinales bounced back from his failure to finish at Motegi in Japan last weekend to complete the provisional front row, just 0.135sec off the pace of Marquez.\nItalian Andrea Iannone (+0.161sec) was fourth fastest on his Ducati ahead of LCR Honda's Cal Crutchlow (+0.196sec).\nLast weekend's Japanese GP winner Dani Pedrosa (+0.493sec) was in sixth.\nChampionship leader Rossi trailed in ninth, but the \"Doctor\" did not switch to a fresh set of tyres at the end of FP2 as did the majority of the riders.\nThe Italian, who will equal the all-time record of 328 Grand Prix starts on Sunday, preferred to work on his pace on used tyres.\nEighteen points separate Rossi and Lorenzo in the championship standings.\nRossi, 36, the seven-time world champion in the premier class, is chasing his first world title since 2009.", "external_links": [], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-19T23:43:25.750+03:00", "highlightTitle": ""}