{"organizations": [], "uuid": "8fd79102ad64c4c2dab407a16ac7106669a0ab98", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "http://www.bostonherald.com/sites/default/files/media/ap/896849998609447ea4ac86fb4e00a3fc.jpg", "site_section": "http://bostonherald.com/sports", "section_title": "Sports | Boston Herald", "url": "http://bostonherald.com/sports/other/auto_racing/2015/10/earnhardt_ok_with_ruling_that_denied_him_final_shot_at_dega", "country": "US", "title": "Earnhardt OK with ruling that denied him final shot at 'Dega", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "Earnhardt OK with ruling that denied him final shot at 'Dega | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T18:54:00.000+02:00", "replies_count": 0, "uuid": "8fd79102ad64c4c2dab407a16ac7106669a0ab98"}, "author": "Associated Press", "url": "http://bostonherald.com/sports/other/auto_racing/2015/10/earnhardt_ok_with_ruling_that_denied_him_final_shot_at_dega", "ord_in_thread": 0, "title": "Earnhardt OK with ruling that denied him final shot at 'Dega", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Earnhardt OK with ruling that denied him final shot at 'Dega Crew members work to change tires on Sprint Cup Series driver Dale Earnhardt Jr.'s car during the NASCAR Sprint Cup Series auto race at Talladega Superspeedway Sunday, Oct. 25, 2015, in Talladega, Ala. (AP Photo/ John Bazemore) comments Tweet TALLADEGA, Ala. — Dale Earnhardt Jr. worked himself into position to race to the finish for another victory at Talladega Superspeedway and a spot in the third round of the playoffs.\nDenied the chance, he refused to gripe about the anti-climactic finish Sunday that left him behind winner Joey Logano after the race ended under caution because of an accident on the one attempt at a green-white-checkered flag finish.\n\"I feel like no matter the rules, when the race is over, I can live with the result as long as everyone else is going by the same rules,\" Earnhardt said. \"So I felt like, per the rule book, it sorted out and I finished second. I'm OK with that. We could argue they could have waited another 100 feet to throw the caution, but they didn't have to. They threw it when they needed to. I'm fine with that.\"\nHe appeared poised to get a shot at overtaking Logano at a track where he's won six times. NASCAR made it clear leading up to the race that it would only make one attempt to finish the race under green-flag conditions. Logano was leading when a spin in traffic behind him extended the caution before he took the green.\nKevin Harvick's car struggled to pick up speed on the restart, triggering a multi-car accident. Earnhardt wasn't among the drivers who seemed miffed at Harvick, who preserved his spot in the third round of the playoffs.\nAfter leading a race-high 61 laps and finishing second, he wasn't questioning NASCAR rules officials either.\n\"I know those guys up in the booth, and I really believe in the choices they make and decisions they make for the sport, whether it's in the middle of a race or a new rule in the middle of the week, whatever it is,\" Earnhardt said.\nEarnhardt came into the race 11th out of 12 drivers in the Chase standings but liked his chances. He'd driven his No. 88 Chevrolet to victory in a qualifying race at Daytona in February, won there again in July and in between picked up another victory at Talladega. Logano called Earnhardt \"the best speedway racer that we know\" and said holding him off would have been a challenge.\nEarnhardt would have been assured of spot in the third round of the Chase with a repeat win in Alabama.\n\"I'm more proud of the drive I had today than the two wins this year,\" Earnhardt said. \"The two wins came a lot easier than this second place did.\n\"We got shuffled out. I didn't know if we could get back up there. They formed a line around the top. That was my job. Somebody else did it. I was sitting there about 10th. I was thinking, 'I've never been in this situation. How do I pass these guys?' But I started working on it and we got one at a time until we finally got up there in the top three.\"\nHe had to overcome some issues along the way, including a case of the jitters and nervous stomach that left him feeling \"like crap all weekend.\"\nEarnhardt mistakenly thought vibrations were caused by a loose wheel, and he got a pass-through penalty when a crew member came over the wall too soon on a pit stop.\n\"I also came into that box real careful because I didn't want to slide,\" Earnhardt said.\" I think they were anticipating me rolling in the box sooner. That was probably a little bit my fault, my responsibility.\n\"My crew guys, over the wall guys, are getting a little rough treatment here lately. The guys I got, if we stick together, we're going to be great next year. I believe in them.\"", "external_links": ["http://embed.sendtonews.com/player/embed.php?SK=GYTCyjHtSl&MK=131094&PK=4407&autoplay=off&sound=off", "https://twitter.com/share?text=Earnhardt+OK+with+ruling+that+denied+him+final+shot+at+%27Dega"], "published": "2015-10-26T18:54:00.000+02:00", "crawled": "2015-10-26T15:14:57.363+02:00", "highlightTitle": ""}