{"organizations": [], "uuid": "c032f6187a820fbe1f5310635ee197990245c159", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nydailynews.com", "main_image": "http://assets.nydailynews.com/polopoly_fs/1.2401095!/img/httpImage/image.jpg_gen/derivatives/landscape_1200/devilsweb17s-2-web.jpg", "site_section": "http://www.nydailynews.com/sports/index.html", "section_title": "Sports News &amp; Articles: Today’s Latest Sports News - NY Daily News", "url": "http://www.nydailynews.com/sports/hockey/devils-fall-shootout-2-1-unbeaten-sharks-article-1.2401097", "country": "US", "title": "Devils fall in shootout 2-1 to unbeaten Sharks", "performance_score": 0, "site": "nydailynews.com", "participants_count": 1, "title_full": "Devils fall in shootout 2-1 to unbeaten Sharks - NY Daily News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T03:00:00.000+03:00", "replies_count": 0, "uuid": "c032f6187a820fbe1f5310635ee197990245c159"}, "author": "NEW YORK DAILY NEWS", "url": "http://www.nydailynews.com/sports/hockey/devils-fall-shootout-2-1-unbeaten-sharks-article-1.2401097", "ord_in_thread": 0, "title": "Devils fall in shootout 2-1 to unbeaten Sharks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEWARK, N.J. (AP) — Martin Jones didn’t seem disappointed.\nAfter the San Jose goalie came within 3:38 of his third consecutive shutout, Jones was happy with winning his fourth straight game and helping the unbeaten Sharks get a 2-1 shootout win over the winless New Jersey Devils.\n“I don’t think there are any secrets,” Jones said after making 31 saves. “My focus is to take the game as it comes and just focus on the process, whether it’s a 1-1 game or a 5-0 game. The process needs to stay the same.”\nThe low-key 25-year-old has been the Sharks’ best player under new coach Pete DeBoer, who was fired by the Devils last season. He has given up two goals in four games, going a franchise-record 234 minutes, 33 seconds without allowing a goal.\n“The D have done a good job in front of the net, and I am seeing pucks, but you don’t go four games like that with one guy,” said Jones, who was acquired in a trade with Boston. “We’ve played really, really solid both ends of the ice, and we haven’t spent a lot of time in our zone in the four games. It has been a good start.”\nJoe Pavelski and Brent Burns scored in a shootout as the Sharks improved to 4-0.\nNew Jersey is 0-3-1 under new coach John Hynes. The only time the team had a worse start was in 2001-02 when they opened with four straight losses.\n“That was one of the better games for us,” Hynes said after earning his first point as a coach. “Is it good enough yet? No. It is a step in the right direction.”\nJulio Cortez/AP Sharks defenseman Brent Burns scores a shootout goal. Patrick Marleau scored for the Sharks about two minutes in and the goal stood until Adam Henrique ended Jones’ shutout bid with a tying power-play goal.\nHenrique scored for New Jersey on its first shootout attempt, but Jacob Josefson was stopped on the second and Mike Cammalleri missed the net on the third.\n“We easily could have had two points,” said Devils goaltender Cory Schneider, who had 33 saves.\nOn his goal, Henrique tipped a shot from the point by Damon Severson past Jones. It was the first goal Jones had allowed since giving up one on the first shot he faced in the season opener against the Kings.\nBoth goaltenders were tested in the overtime, with Schneider making the best stop, a pad save on Burns after he deked two Devils in front for a one-on-one chance in close.\nHenrique hit a goalpost earlier in the extra five minutes, and Kyle Palmieri missed the net on a breakaway for New Jersey.\nThe Devils thought they tied the game late in the second period while killing off a penalty. Stephen Gionta got a step on Paul Martin and made a power move toward Jones from the left circle. Martin pushed him from behind, and Gionta crashed into Jones as he shoved a shot on goal. Josefson fired the rebound into an open net, but referee Dan O’Halloran immediately waved off the goal.\nJulio Cortez/AP Devils center Adam Henrique scores a goal against Martin Jones. The Devils complained, the crowd booed and Jones’ shutout streak continued.\nSchneider, who was returning to the lineup after missing two games for the birth of his son, kept New Jersey in the game earlier in the period when he stopped a penalty shot by Marleau.\nMarleau skated to his right and then cut across the crease on his penalty shot, but it went into the goaltender’s chest.\nMarleau had opened the scoring in close at 2:01 of the first period after taking a pass from behind the net by Joel Ward.\nThe last NHL goaltender to post three straight shutouts was Ondrej Pavelec of Winnipeg late last season from Apr. 6-9.\nThe Sharks had to kill off two two-man advantages for New Jersey early in the third period. However, a late bench minor for too many skaters on the ice set up the power play that resulted in Henrique’s goal.", "external_links": ["http://www.adobe.com/go/getflashplayer", "http://static.eplayer.performgroup.com/flash/js/performgroup.js", "http://images.performgroup.com/namedImage/12637/install_flash.gif", "http://static.eplayer.performgroup.com/flash/js/swfobject.js"], "published": "2015-10-17T03:00:00.000+03:00", "crawled": "2015-10-17T08:18:29.836+03:00", "highlightTitle": ""}