{"organizations": [], "uuid": "a1c7e223af99e89a10fe9b1d54fbb99623ca8ac5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "wtop.com", "main_image": "", "site_section": "http://wtop.com/section/sports/feed/", "section_title": "WTOP » Sections » Sports", "url": "http://wtop.com/ncaa-basketball/2015/10/duke-enters-another-season-as-reigning-ncaa-champion/", "country": "US", "title": "Duke enters another season as reigning NCAA champion", "performance_score": 0, "site": "wtop.com", "participants_count": 1, "title_full": "Duke enters another season as reigning NCAA champion", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T20:32:00.000+02:00", "replies_count": 0, "uuid": "a1c7e223af99e89a10fe9b1d54fbb99623ca8ac5"}, "author": "wtopstaff", "url": "http://wtop.com/ncaa-basketball/2015/10/duke-enters-another-season-as-reigning-ncaa-champion/", "ord_in_thread": 0, "title": "Duke enters another season as reigning NCAA champion", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Duke enters another season as reigning NCAA champion By JOEDY McCREARY October 26, 2015 2:32 pm \nDURHAM, N.C. (AP) — Don’t call Duke a defending national champion. \nFor many of these current Blue Devils, there’s nothing to defend — because they had nothing to do with the program’s most recent title. \nTheir goal — as it always is at Mike Krzyzewski’s perennial powerhouse program — is to hang a banner of their own. \nKrzyzewski expects “there will be a little bit more of a learning curve with regard to this group” than last year, when freshmen Jahlil Okafor, Justise Winslow and Tyus Jones played with the poise of veterans from the moment the season began. \nExpectations are never low at Duke, which six months ago won the NCAA Tournament for the fifth time since 1991. \nSince then, half the scholarship players on that team and its only four double-figure scorers — those three one-and-done freshmen plus senior Quinn Cook — have moved on. \nThe Blue Devils will have a new look but the same mission — to mesh a talented crew of freshmen with a few experienced returnees quickly and effectively enough to remain near the top of the Atlantic Coast Conference. \nLast year’s freshmen arrived with ready-made relationships after playing together at various levels. \nThese newcomers — led by swingman Brandon Ingram, big man Chase Jeter and guards Derryck Thornton and Luke Kennard — don’t quite have that familiarity yet. \n“Our freshmen are talented … and for the guys coming back, they have to adjust to a different level of expectation,” Krzyzewski said. “They have to play more good minutes in a game, and then they have to play game after game well. … You’ve got to do it all the time.” \n___ \nSome things to know about Duke’s pursuit of a sixth national championship: \nCHANGING STYLES: Krzyzewski expects these Blue Devils to generate most of their scoring from the perimeter — a pretty stark contrast to last year’s team, which revolved around the 6-foot-11 Okafor in the paint. Krzyzewski says this team will be more “opportunistic” in the low post, sticking back offensive rebounds. “This team’s strength is its perimeter scoring,” he said. \nSHADES OF GRAYSON: Duke is counting on Grayson Allen to pick up where he left off in April. After barely playing at times, Allen blossomed into the hero of the Final Four, scoring 16 points and coming up with the biggest hustle play of the title-clinching win over Wisconsin. He says there’s “definitely a change in mentality” that comes with his added confidence. \nIMPACT FRESHMAN: Krzyzewski expects Ingram to be “all over — he’s that good of a player,” and could see time on the wing and inside. The 6-9 Kinston product is the first Associated Press men’s high school player of the year to choose Duke since Shavlik Randolph in 2002, and is one of two players in the history of the state high school association to win four state titles. With a wingspan that’s 7-foot-3, Ingram has “that versatility, that flexibility (that) puts him in a position to be in almost any lineup.” \nTHE RETURNERS: The four scholarship players who played last season combined to average 18.7 points and the leading returning scorer is senior forward Amile Jefferson, who averaged 6.1 points. \nTHE LAST PLUMLEE: The end of an era in Duke basketball is coming — the end of the line for the Plumlee family. Big man Marshall Plumlee is a graduate student entering his final season of eligibility. While older brothers Miles and Mason have played their way into the NBA, Marshall is headed on a different track — he’s joining the Army, and spent a month this summer at a leadership course at Fort Knox. Krzyzewski said,“The growth that he has a leader is showing up here.” \n___ \nFollow Joedy McCreary on Twitter at http://twitter.com/joedyap Topics:", "external_links": [], "published": "2015-10-26T20:32:00.000+02:00", "crawled": "2015-10-26T20:53:46.002+02:00", "highlightTitle": ""}