{"organizations": ["Aston Villa"], "uuid": "372ba66ce483de8a111ebb7e51917a9527597af5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.themalaymailonline.com", "main_image": "http://www.themalaymailonline.com/uploads/articles/2015-10/football_20151025_aston_villa_Tim_Sherwood.jpg", "site_section": "http://www.themalaymailonline.com/feed/rss/sports", "section_title": "The Malay Mail Online | Sports", "url": "http://www.themalaymailonline.com/sports/article/villa-sacks-manager-sherwood", "country": "MY", "title": "Villa sack manager Sherwood", "performance_score": 0, "site": "themalaymailonline.com", "participants_count": 0, "title_full": "Villa sack manager Sherwood", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T14:38:00.000+02:00", "replies_count": 0, "uuid": "372ba66ce483de8a111ebb7e51917a9527597af5"}, "author": "", "url": "http://www.themalaymailonline.com/sports/article/villa-sacks-manager-sherwood", "ord_in_thread": 0, "title": "Villa sack manager Sherwood", "locations": ["Swansea City"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sherwood Tim Sherwood"], "text": "Tim Sherwood in his last game managing Aston Villa, going down at home to Swansea City 2-1. — Reuters pic \nLONDON, Oct 25 — Aston Villa have sacked manager Tim Sherwood, the Premier League club announced today. \n“The Board has monitored the performances closely all season and believes the results were simply not good enough and that a change was imperative,” said a statement on the official website . \n“However, the club would like to place on record its sincere thanks to Tim for all his efforts during a difficult period last season and for the many positive contributions he has made to the entire football set-up during his time with the club. We wish him well in the future. \n“Assistant manager Ray Wilkins, first-team coach Mark Robson and performance analyst Seamus Brady have also left with immediate effect and do so with our best wishes. \n“A search for a new manager has commenced and the squad will be managed in the interim by Kevin MacDonald.” \nA 2-1 home defeat by Swansea City yesterday was their sixth league defeat in a row and Villa could be bottom of the table if other results go against them today. \nSince winning the opening league game of the season at promoted Bournemouth, their only successes have been in the League Cup against lower division opposition. \nSherwood was appointed in February and kept the side safe from relegation by three points, as well as reaching the FA Cup final, where they lost 4-0 to Arsenal. \nIn the summer he signed more than a dozen new players but lost key men in Christian Benteke to Liverpool, Fabian Delph to Manchester City and loanee Tom Cleverley to Everton. \n“We cannot do more as coaches and managers,” he told reporters after yesterday’s defeat. “We are working as hard as we can.” \nSherwood, 46, played three times for England and managed former club Tottenham for part of the 2013-14 season before joining Villa. — Reuters", "external_links": [], "published": "2015-10-25T14:38:00.000+02:00", "crawled": "2015-10-25T15:10:41.680+02:00", "highlightTitle": ""}