{"organizations": [], "uuid": "5d30f2cc656301def135f85f5a5bbbe6733b8403", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattletimes.com", "main_image": "http://static.seattletimes.com/wp-content/uploads/2015/10/1253ef26-7933-11e5-9c63-b6a65f6b2727-1200x630.jpg", "site_section": "http://seattletimes.com/rss/pac12confidential.xml", "section_title": "The Seattle Times » Sections » Sports", "url": "http://www.seattletimes.com/sports/seahawks/pro-football-focus-with-high-grades-for-marshawn-lynch-russell-okung-and-defense-in-seahawks-win-over-49ers/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_sports", "country": "US", "title": "Pro Football Focus with high grades for Marshawn Lynch, Russell Okung and defense in Seahawks’ win over 49ers", "performance_score": 0, "site": "seattletimes.com", "participants_count": 1, "title_full": "Pro Football Focus with high grades for Marshawn Lynch, Russell Okung and defense in Seahawks’ win over 49ers | The Seattle Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T11:48:00.000+03:00", "replies_count": 0, "uuid": "e3e25223841ca075b7d8370dc17fd54d7c21eb8d"}, "author": "Bob Condotta", "url": "http://www.seattletimes.com/sports/seahawks/pro-football-focus-with-high-grades-for-marshawn-lynch-russell-okung-and-defense-in-seahawks-win-over-49ers/", "ord_in_thread": 0, "title": "Pro Football Focus with high grades for Marshawn Lynch, Russell Okung and defense in Seahawks’ win over 49ers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Here are some thoughts and grades from Pro Football Focus for the Seattle Seahawks in their 20-3 win over the 49ers Thursday night. For an explanation of how PFF grades and what the numbers mean, check here. \nOffense \nRussell Wilson comes in with a +2.1 and that’s with two really bad interceptions. SF blitzed him on 10 of his 32 dropbacks, higher than their average 24.0% blitz rate this year. Beastmode (Marshawn Lynch) registers his highest grade yet this year at +2.9. He had five missed tackles forced, bringing his total to 18 on the year. With no Derrick Coleman, Will Tukuafu finished with a +1.8 overall (+1.8 run blocking). It’s his best two game stretch of his career. Russell Okung turned back the clock into the dominant Okung that we saw in 2012. His +5.5 ties the best of his career and was the only starting OL not to allow a QB hurry. Staying on the OL, the other four were a different story. Justin Britt, J.R. Sweezy, and Garry Gilliam each allowed four QB hurries and while Britt salvaged his grade with some good run blocking, Sweezy did not. This was Sweezy’s second-worst overall graded game (-5.8), his worst coming in his very first start back in 2012 in Week 1 (-7.1). Targets for receivers: Jimmy Graham/Tyler Lockett 5, Fred Jackson/Jermaine Kearse 4, Doug Baldwin 3, Thomas Rawls 2 Defense \nAs predicted, Michael Bennett (+4.0) and Cliff Avril (+3.5) had solid games. Cliff Avril is having a ridiculous year—not only has he graded in the green in each game, but only one has been under +3.0. K. J. Wright, playing again at weakside linebacker, also bounced back from a poorly graded game last week and led all LBs with a +2.3. Only he and Richard Sherman had a green pass coverage grade. In the RW/Kaepernick era, the most targeted corner by Kaep has interestingly been Sherman. However last night…Sherman was not targeted a single time. Even though SF only ran 48 plays, all three starting LBs (Bruce Irvin, Bobby Wagner, and Wright), Kam Chancellor, Earl Thomas, and Sherman played every single snap. Cary Williams only missed one when he got dinged. Avril played 85.4% of the snaps which is really high for a DL. He hit the 80.0% snaps played mark only three times last year—he’s at five already this season. Defensive stops: Bennett 4, Avril 3, Irvin/Wagner/Williams/Sherman 2 QB hurries: Bennett 5, Avril 4, David King/Frank Clark 1 Coverage targets: Wright/Wagner 7, Shead 3 Special Teams \nThere are currently 11 kickers who have a perfect FG percentage. Hausch-money (Steven Hauschka) has made the most of any of them at 16-16 for the season SEAHAWKS AT 49ERS » Photo gallery Full coverage Larry Stone: Russell Wilson needs to play better for Seahawks to click What the national media is saying Seahawks get back on right track with win over 49ers Larry Stone: Marshawn Lynch sets tone with beastly performance Seahawks' Legion booms back with complete game Grading the Seahawks: High marks all around in win over 49ers 3 things we learned in Seahawks' win Best from the Web: Seahawks return to form Richard Sherman shuts down Torrey Smith; Marshawn Lynch gets ill Full game highlights Signature Stats \nNot a good sign that Wilson was under pressure on 56.3% of his dropbacks, higher than his average this year. And against what’s been a non-existent pass rush, this is very concerning. Lockett outperformed his 0.91 yards/route run coming into this game, finishing with 2.93. On passes without play action, Kaepernick had a 1.8 YPA average. Elusive rating and yards after contact/attempt: Rawls 83.3 and 3.33, Lynch 44.6 and 2.41  \nBob Condotta : 206-515-5699 or bcondotta@seattletimes.com ; on Twitter: @bcondotta . Bob Condotta covers the Seahawks for the Seattle Times. He provides daily coverage of the team throughout the year.", "external_links": [], "published": "2015-10-23T11:48:00.000+03:00", "crawled": "2015-10-23T21:05:27.054+03:00", "highlightTitle": ""}