{"organizations": [], "uuid": "598f4ab1f8097a9ab99737fce7d53cdb759ae9e4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mndaily.com", "main_image": "http://www.mndaily.com/sites/default/files/images/photos/2015/10/04/100515stfb1005g-1.jpg", "site_section": "http://www.mndaily.com//rss/sports", "section_title": "Sports", "url": "http://www.mndaily.com/sports/football/2015/10/05/croft-takes-field-first-time-blowout", "country": "US", "title": "Croft takes the field for the first time in blowout", "performance_score": 0, "site": "mndaily.com", "participants_count": 1, "title_full": "Croft takes the field for the first time in blowout", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T16:08:00.000+03:00", "replies_count": 0, "uuid": "598f4ab1f8097a9ab99737fce7d53cdb759ae9e4"}, "author": "jthomas@mndaily.com", "url": "http://www.mndaily.com/sports/football/2015/10/05/croft-takes-field-first-time-blowout", "ord_in_thread": 0, "title": "Croft takes the field for the first time in blowout", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Croft takes the field for the first time in blowout Quarterback Demry Croft, a freshman, played in the fourth quarter of the game. Quarterback Mitch Leidner prepares to throw the ball at Ryan Field on Saturday afternoon where Minnesota fell to Northwestern 0-27. By Ryan Falk October 05, 2015 The Gophers have often struggled on offense under head coach Jerry Kill, and at no position is this more apparent than at quarterback. Redshirt junior Mitch Leidner struggled again in the team’s Big Ten opener against Northwestern, completing only 10 of 21 passes for 72 yards and recording two total turnovers. Leidner’s performance and the score led to Kill making a change at quarterback, with touted freshman Demry Croft seeing his first snaps Saturday for the Gophers in the team’s 27-0 loss to Northwestern. Kill said he considered playing Croft last weekend against Ohio, too. “That’s something we feel like we should have done last week just to get in some repetition, see what he can do,” Kill said. Croft came in during the fourth quarter, when the game was far out of reach for the Gophers, but still failed to put the team on the score board. Croft finished the game with five completions on 11 attempts for 27 yards and was almost intercepted three times, twice on his third drive. However, Croft did show the skill he has running. His first play of the game was an 11-yard run for a first down. First downs were hard to come by for the Gophers with both Leidner and Croft in the game against Northwestern, as the team only converted four of 16 third downs. Kill declined to comment after the game on who would start at quarterback next weekend against Purdue, but he was quick to take the blame for the Gophers’ poor offensive performance. “Everybody wants to blame the quarterback, and they need to blame me,” Kill said. Kill said on Sunday the team wanted to get Croft experience because with redshirt sophomore Chris Streveler moving to wide receiver, the team lacked a strong option at backup quarterback. Senior wide receiver KJ Maye, who caught passes from both quarterbacks in the game, said Croft made mistakes against the Wildcats, but he needs more experience. “[Croft] had to get game experience to know how things go,” Maye said. “Going into next week, we’ll see what happens.” Maye also said he’s doing all he can to help Leidner stay motivated and in good spirits. “Mitch and me are like brothers,” Maye said. “[I] just [have to] stand near him, keep him lifted up, keep him motivated.” Quarterback issues were not the only problem for Minnesota, however, as the entire offense fell short against Northwestern. The Gophers only gained 173 yards against the Wildcats’ stout defense. The game was still close at halftime, with the Wildcats on top 10-0, but Northwestern scored on their first drive of the second half. “I think it took some air out of our kids,” Kill said. The offense was never able to inject any air back into the team, with the Gophers getting shut out for the first time since a 58-0 loss to Michigan in 2011.", "external_links": [], "published": "2015-10-05T16:08:00.000+03:00", "crawled": "2015-10-05T23:34:52.919+03:00", "highlightTitle": ""}