{"organizations": [], "uuid": "6918e43e7f619077ed21cb3f4ecda5bb867c88a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailyherald.com", "main_image": "http://www.dailyherald.com/gfx/site/logos/dailyherald_marble_300.jpg", "site_section": "http://www.dailyherald.com/rss/feed/?feed=sports_all", "section_title": "DailyHerald.com &gt; Sports", "url": "http://www.dailyherald.com/article/20151010/sports/151019832/", "country": "US", "title": "Quenneville again tinkering with Chicago Blackhawks' lines", "performance_score": 0, "site": "dailyherald.com", "participants_count": 1, "title_full": "Quenneville again tinkering with Chicago Blackhawks' lines - DailyHerald.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T08:24:00.000+03:00", "replies_count": 0, "uuid": "6918e43e7f619077ed21cb3f4ecda5bb867c88a3"}, "author": "John Dietz", "url": "http://www.dailyherald.com/article/20151010/sports/151019832/", "ord_in_thread": 0, "title": "Quenneville again tinkering with Chicago Blackhawks' lines", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Blackhawks are just three games into the regular season and already Joel Quenneville is tinkering with his line combinations.\nQuenneville, who obviously is happiest with the electric Artemi Panarin-Artem Anisimov-Patrick Kane grouping, wants more consistency out of the other three lines.\nIn the first two games, Teuvo Teravainen was at times solid but at times erratic playing with Jonathan Toews and Marian Hossa. During Saturday's 4-1 victory over the New York Islanders, it was Ryan Garbutt who had a chance to skate with Toews and Hossa.\n\"He was all right. He was OK,\" Quenneville said of Garbutt. \"We've been trying different things there and … we'll settle on something soon.\"\nBefore the game, Quenneville said that whoever is on that top line, they should remember to be themselves.\n\"(You can) say, 'Are you going to be Brandon Saad? Are you going to be this?' I mean, you've got to be who you are,\" the coach said. \"I think that you've got to play to your own strengths.\n\"But you've got a lot of responsibility with the other two guys. Simple sometimes could be effective.\"\nAgainst the Islanders, Teravainen centered the third line with Bryan Bickell and Viktor Tikhonov as his wingers.\nEast not least: The Blackhawks have a strange start to the season as they will play eight straight games against Eastern Conference teams. The first Western Conference foe is Anaheim on Oct. 26 at the United Center.\nCoach Joel Quenneville says the schedule quirk shouldn't affect his team at all.\n\"We've got some real good tests in front of us,\" Quenneville said. \"But I still think most teams play the same kind of way, and I'm sure they're excited about playing us as well. Doesn't matter who it is -- I think we should have an appetite that, 'Hey, this is a big game. Let's get excited about it.' \"\nThe next two games are at Philadelphia on Wednesday and at Washington on Thursday.\nExpect better: Viktor Svedberg had a couple of rough moments in his NHL debut Friday against the Islanders.\nThat didn't deter Joel Quenneville from sending the 6-foot-8 defenseman back out Saturday, however, as the Hawks completed the home-and-home series.\n\"He's improved so (much) from where he was just a few years ago when he came to the organization,\" Quenneville said. \"He's made big improvements through his movements. I think his thought process is getting better as well. …\n\"Getting that first game under your belt is probably a big step as well. I think he'll be a little bit more comfortable going forward.\"\nBlacking out: Artemi Panarin's reaction to his first NHL goal -- which came in the season opener Wednesday at the United Center -- was classic.\nAs soon as he rifled the puck past New York Rangers goalie Henrik Lundqvist, Panarin raced to the fans, jumped up on the glass and celebrated with a primal scream.\n\"Emotions were kind of over the top,\" Panarin said through translator Viktor Tikhonov. \"I was trying to remember the reactions of the crowd and got overwhelmed. I couldn't hear anything.\"\nPanarin continued his hot start Saturday as he registered another goal and a pair of assists.\nGet great articles like this sent to your inbox! Click here to sign up for the Blackhawks Newsletter No Thanks Sports NHL Blackhawks Hockey Pro Sports", "external_links": ["https://twitter.com/share"], "published": "2015-10-11T08:24:00.000+03:00", "crawled": "2015-10-11T21:00:23.134+03:00", "highlightTitle": ""}