{"organizations": ["Palermo", "Inter Milan", "Palermo Tweet"], "uuid": "fc022d878f5528a797f62ce40e96466f09d92697", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chinapost.com.tw", "main_image": "http://www.chinapost.com.tw/news_images/20151026/p08b.jpg", "site_section": "http://www.chinapost.com.tw/rss/sports.xml", "section_title": "China Post Online - Sports News", "url": "http://www.chinapost.com.tw/sports/soccer/2015/10/26/449243/Inter-Milan.htm", "country": "", "title": "Inter Milan fail to move top after 1-1 draw with Palermo", "performance_score": 0, "site": "chinapost.com.tw", "participants_count": 0, "title_full": "Inter Milan fail to move top after 1-1 draw with Palermo", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T18:12:00.000+02:00", "replies_count": 0, "uuid": "fc022d878f5528a797f62ce40e96466f09d92697"}, "author": "", "url": "http://www.chinapost.com.tw/sports/soccer/2015/10/26/449243/Inter-Milan.htm", "ord_in_thread": 0, "title": "Inter Milan fail to move top after 1-1 draw with Palermo", "locations": ["MILAN"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tweet MILAN -- Inter Milan was held to a 1-1 draw at Palermo in a match that saw the visitors reduced to 10 men as they failed to move provisionally two points clear atop Serie A on Saturday. \nIvan Perisic broke the deadlock on the hour mark but Inter's lead lasted just six minutes before Alberto Gilardino leveled. \nInter defender Jeison Murillo was sent off 10 minutes from time following a second yellow card but the visitors still managed to force Palermo goalkeeper Stefano Sorrentino into more crucial saves. Inter moved level on points with leader Fiorentina, which hosts third-placed Roma Sunday. Inter is below Fiorentina on goal difference, with both teams a point ahead of Roma. \n\"In the first half Palermo put us in difficulty because there was too much space between our attack and midfield,\" Inter coach Roberto Mancini said. \"We were unlucky at times, like when we had a player sent off. At the moment we are at the top but we are not happy with this match because we wanted to win.\" \nEarlier Empoli beat Genoa 2-0, while Bologna fought back to win 2-1 at fellow promoted side Carpi and move off the bottom of the table. \nInter was looking to return to the top of Serie A following two successive draws and a defeat, while Palermo had bounced back with victory at Bologna after four defeats in a row. \nPalermo had the best of the early chances and Inter goalkeeper Samir Handanovic was decisive in denying Franco Vazquez twice. \nIt was not until the 50th minute that Sorrentino was properly tested as he dove smartly to turn a Stevan Jovetic free kick around his post. \nInter took the lead shortly after when substitute Jonathan Biabiany, who had only been on the pitch five minutes, latched on to a ball from Jovetic over the top and put in a low cross from the right flank for Perisic to tap in at the far post. It was the Croatia midfielder's fourth goal in his past five matches — including international games. \nHowever, following a corner, Vasquez put the ball in the box and it went in off Gilardino's shin from close range. \nInter could have won the game but Sorrentino pulled off a sensational fingertip save to prevent Fredy Guarin's shot from going under the bar and — after Murillo was sent off — stopped Biabiany's effort from point-blank range. \nCarpi fell to last place, two points from safety ahead of the rest of the weekend's matches, and a point behind Bologna. \nIt was the first edition of the local derby in Serie A and Gaetano Letizia gave Carpi the lead in the 24th minute after Marco Borriello's effort was blocked. \nBut Carpi was reduced to 10 men in the 38th when Lorenzo Lollo was dismissed for a second booking and Bologna captain Daniele Gastaldello leveled two minutes into the second half, turning in the rebound after Luca Rizzo's effort crashed off the post. \nBologna snatched all three points deep into stoppage time when Carpi goalkeeper Vid Belec flapped at Franco Brienza's cross and Adam Masina tapped in at the far post. \nIn the first match of the day, Empoli broke the deadlock a minute from halftime. Manuel Pucciarelli couldn't get on the end of a cross from Piotr Zielinski on the left flank but Rade Krunic was there to slot in at the back post for his first Serie A goal. \nZielinski also notched his first goal in the Italian league shortly before the hour, heading in the rebound after Massimo Maccarone hit the bar. SHARE", "external_links": [], "published": "2015-10-25T18:12:00.000+02:00", "crawled": "2015-10-26T04:44:58.653+02:00", "highlightTitle": ""}