{"organizations": ["Winnipeg Sun First"], "uuid": "b7160acbda64c5e4bcd2592bbca5e4786d8b30de", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.winnipegsun.com", "main_image": "http://storage.winnipegsun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297759144987_ORIGINAL.jpg?quality=80&size=100x", "site_section": "http://www.winnipegsun.com/sports/rss.xml", "section_title": "Top Sports stories", "url": "http://www.winnipegsun.com/2015/10/11/scheifele-growing-into-expanded-role", "country": "CA", "title": "Scheifele growing into expanded role", "performance_score": 0, "site": "winnipegsun.com", "participants_count": 0, "title_full": "Scheifele growing into expanded role", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T01:48:00.000+03:00", "replies_count": 0, "uuid": "b7160acbda64c5e4bcd2592bbca5e4786d8b30de"}, "author": "", "url": "http://www.winnipegsun.com/2015/10/11/scheifele-growing-into-expanded-role", "ord_in_thread": 0, "title": "Scheifele growing into expanded role", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mark Scheifele", "Ken Wiebe", "Scheifele"], "text": "Scheifele growing into expanded role Third-year centre takes the “shark” out of his game By Ken Wiebe , Winnipeg Sun First posted: Sunday, October 11, 2015 05:48 PM CDT Mark Scheifele isn't worried about trying to keep up his current pace. (WINNIPEG SUN FILES) Article Report an error \nNEW YORK – Mark Scheifele isn't worried about trying to keep up his current pace. \nThe Winnipeg Jets centre has caught the attention of many in the hockey world with his laser-beam wristers in the first two games of the season. \nBut he's not the least bit concerned about how many goals he might score this season. \n“I don’t want to focus on goals, assists or anything like that. I just want to continue to build,” said Scheifele. “It’s early in the season. I just want to continue to get better and better every day and help the team win in whatever way I can. It's all about staying confident.” \nThe Jets are back in action on Monday against the New York Islanders. \nWhen asked about the growth of the third-year centre, Jets head coach Paul Maurice says that about midway through last season, he noticed that Scheifele had taken most of the “shark” out of his game. \n“All of these highly-skilled guys coming out of junior...they just have a tendency to kind of just slide around the water out there and then go real fast at times when they see some offensive (opportunities). There's more coast,” Maurice explained. “They played so many big minutes (in junior) that they play at a certain pace and they have to. They're smart enough that they can and they're opportunistic. But you don't get to play at that pace here. Their shift length is completely different. Those guys will be out there for a minute, minute-and-a-half all the time and they get away with it. But here, you just can't. \n“He's stronger, he's faster and each year he's gotten rid of – and this isn't the right word – the amateur in his game. Call it turning pro.” \nYou can also call it growing into the role of a front-line centre.", "external_links": [], "published": "2015-10-12T01:48:00.000+03:00", "crawled": "2015-10-12T02:28:10.598+03:00", "highlightTitle": ""}