{"organizations": [], "uuid": "44d9b47821266dcfe20a5f586989560a540f83b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/eja4dpo00w_2116311598569_2197211964366.jpg", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=2&gender=1", "section_title": "Sports News", "url": "http://www.modernghana.com/sports/648506/2/italy-belgium-and-wales-all-qualify-for-euro-2016-.html", "country": "US", "title": "Italy, Belgium and Wales all qualify for Euro 2016, as Netherlands stay alive", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "Italy, Belgium and Wales all qualify for Euro 2016, as Netherlands stay alive", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T02:06:00.000+03:00", "replies_count": 0, "uuid": "44d9b47821266dcfe20a5f586989560a540f83b3"}, "author": "", "url": "http://www.modernghana.com/sports/648506/2/italy-belgium-and-wales-all-qualify-for-euro-2016-.html", "ord_in_thread": 0, "title": "Italy, Belgium and Wales all qualify for Euro 2016, as Netherlands stay alive", "locations": ["Belgium", "Wales", "Italy"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sports News | 11 October 2015 00:06 CET Italy, Belgium and Wales all qualify for Euro 2016, as Netherlands stay alive By Wires \nItaly secured their qualification for Euro 2016 with a 3-1 victory in Azerbaijan. \nEder edged the away side ahead in the 11th minute, slotting home after being played through on goal by Marco Verratti, only for the hosts to soon equalise through Dimitrij Nazarov. \nHowever, Stephan El Shaarawy was on hand to convert Antonio Candreva's delivery shortly before half-time, with Matteo Darmian firing home a third -- his first goal at international level -- in the second half. \nBadavi Huseynov was shown a red card for Azerbaijan shortly before the final whistle sounded as Italy's place in France next summer was guaranteed. \nWales and Belgium both qualified from Group B despite very different results. \nBelgium cruised to a 4-1 win at minnows Andorra as Radja Nainggolan, Kevin de Bruyne, Eden Hazard and Laurent Depoitre scored goals. \nWales, however, backed into next summer's finals -- their first major tournament since 1958 -- as they lost 2-0 at Bosnia-Herzegovina. \nMilan Djuric sent a looping header over Wales goalkeeper Wayne Hennessey in the 71st minute and the hosts doubled their lead with one minute to play through Vedad Ibisevic. \nBut the result didn't matter for Wales after Cyprus surprised with a 2-1 at Israel as Jason Demetriou scored an 80th-minute winner. \nThat left Wales four points clear in second place, securing their spot, while Bosnia-Herzegovina are in playoff position on 14 points, one ahead of Israel and two above Cyprus, who host Bosnia in the key fixture on Tuesday. \nIn Group A, Turkey won 2-0 at Czech Republic to increase the pressure on Netherlands' hope of making the playoffs. \nSelcuk Inan scored a 62nd-minute penalty and Hakan Calhanoglu also scored as Turkey moved onto 15 points, two clear of the Dutch with one game each to play. \nShould Turkey earn a point at home against Iceland on Tuesday they will reach the playoffs no matter what Netherlands do against Czech Republic. \nNetherlands are still in with a shout of reaching Euro 2016 because they saw off Kazakhstan 2-1. \nGeorginio Wijnaldum opened the scoring with a well-taken finish from the edge of the box on 33 minutes, with Wesley Sneijder then doubling Danny Blind's side's lead shortly after the restart. \nIslambek Kuat pulled one back for Kazakhstan deep into second-half stoppage time, but it only proved to be a consolation goal for the home team. \n[PHOTO]http://img.modernghana.com/images/content/Kolbeinn Sigthorsson fired the hosts into an early lead, with Gylfi Sigurdsson then adding a second midway through the first half. \nHowever, Latvia launched a second-half comeback with Aleksandrs Cauna pulling one back shortly after the break, before Valerijs Sabala netted the equaliser in the 68th minute. \nIn the other games in Italy's Group H, Norway edged closer to qualification thanks to a 2-0 win against Malta. \nAlexander Tettey struck for the home side in the 20th minute and Alexander Soderlund made sure of things with his effort in the second half. \nCroatia defeated Bulgaria 3-0 in an empty stadium in Zagreb to stay in the hunt to qualify automatically. \nIvan Perisic opened the scoing just two minutes into the game to put Croatia on their way, and Ivan Rakitic made it 2-0 just before the break. \nNikola Kalinic capped the scoring with nine minutes to play, but a late red card to Duje Cop means he will miss Croatia's final qualifier at Malta. \nNorway are two points clear of Croatia in second place, but a win at Malta would see Croatia qualify should Norway fail to win at Italy. \nFollow Joy Sports on Twitter: @Joy997FM. Our hashtag is #JoySports", "external_links": [], "published": "2015-10-11T02:06:00.000+03:00", "crawled": "2015-10-11T02:06:08.765+03:00", "highlightTitle": ""}