{"organizations": ["Baylor"], "uuid": "3fc18d3ecc55516e6c897702b9e350d072261788", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "amestrib.com", "main_image": "http://amestrib.com/sites/amestrib.com/files/field/media/web1_04-12-ISU-FBC-QB-Lanning--1-.jpg", "site_section": "http://amestrib.com/taxonomy/term/3/feed", "section_title": "Sports", "url": "http://amestrib.com/sports/football-more-lanning-tap-no-2-baylor", "country": "US", "title": "Football: More Lanning on tap for No. 2 Baylor", "performance_score": 0, "site": "amestrib.com", "participants_count": 0, "title_full": "Football: More Lanning on tap for No. 2 Baylor", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T00:01:00.000+03:00", "replies_count": 0, "uuid": "3fc18d3ecc55516e6c897702b9e350d072261788"}, "author": "", "url": "http://amestrib.com/sports/football-more-lanning-tap-no-2-baylor", "ord_in_thread": 0, "title": "Football: More Lanning on tap for No. 2 Baylor", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Lanning"], "text": "Football: More Lanning on tap for No. 2 Baylor Football: More Lanning on tap for No. 2 Baylor \nIowa State quarterback Joel Lanning is expected to see additional playing time against No. 2 Baylor on Saturday. (7). File Photo by Nirmalendu Majumdar/Ames Tribune By Bobby La Gesse rlagesse@amestrib.com \nIowa State made a mistake with No. 4 TCU. Coach Paul Rhoads is out to fix it for No. 2 Baylor. \nThe Cyclones only played backup quarterback Joel Lanning for two snaps this past Saturday. Rhoads vowed his team will utilize Lanning more against the Bears on Saturday (11 a.m., ESPN). \n“He will,” Rhoads said when asked Monday if Lanning will see more playing time. \nMore of Lanning, it doesn’t necessarily mean less of starter Sam Richardson going forward. Rhoads said ISU will utilize Lanning in the run-based formation he appeared in last week. Rhoads is still sticking with Richardson, a fifth-year senior, to begin the game. \n“If there was a breakdown at any position that wasn’t giving us the opportunity to win we would make a change,” Rhoads said. \nLanning, a redshirt sophomore, found a niche leading the running formation that ISU use for a few plays each week. He saw his first extended playing time against Texas Tech on Oct. 17. He impressed the coaching staff with his accuracy as he went 5 of 9 for 41 yards. He also rushed for a 1-yard touchdown in the game. \nLanning wasn’t given the opportunity to substantially build off his Red Raider performance. He did throw a 74-yard touchdown pass, but didn’t play after the second series as the Cyclones went the final 46 minutes, 49 seconds without a point. \n“It’s not my call how many snaps I get or anything,” said Lanning after the TCU game. “It is what it is. I was just in there for what I was supposed to do and I executed the play so hopefully it was good for them.” \nIt was. Rhoads said ISU didn’t use the Lanning formation more because the coaches didn’t like how TCU matched up with it. Still, in hindsight, Rhoads thought the Cyclones needed to give Lanning more reps last week. \n“Joel is competitive as heck,” Rhoads said. “There are some things he does really well. There are some things he is still learning in the process. The only way he is going to learn them fully is when he starts getting the game snaps.” \nPart of that learning curve is when and where to throw passes. Rhoads thought Lanning made an ill-advised toss to wide out Allen Lazard on the 74-yard touchdown. Lazard made the catch on a back shoulder throw about 25 yards downfield with a defender in tight coverage. Lazard broke a tackle before finding a clear path to the end zone. \n“A phenomenal play by Allen,” Rhoads said. “Probably not a ball that should have been thrown, but when you throw it to Allen you are safe sometimes every time you throw it in that direction.” \nWhen evaluating if a backup deserves additional playing time Rhoads will first look at the performance of the starter. Rhoads said he likes what he’s seen from Richardson, who was 22 of 36 for 251 yards last week. \nAt quarterback, more must go into any playing time decision than just game day grades. \n“(This) is a position that you got to give the most serious thought because you are really going to affect the rhythm of your football team and your personnel,” Rhoads said. “Joel’s done great with the snaps he’s got this year and he’s done really well with the package that we’ve put in. Sam had a fantastic first quarter and overall his game performance was spot on as well.” \nSo the Cyclones will keep using plenty of Richardson. They’ll just try to find more spots to give Lanning a chance to make a play. \n“He’s got a lot of confidence in there and with that different package,” offensive tackle Jake Campos said, “just change up the looks, and have a guy back there to change the tempo a little bit.” \nInjury update \nRhoads said offensive guard Daniel Burton and running backs Mike Warren and Joshua Thomas were better than expected health-wise. Each player required medical staff attention against TCU. \nTexas kick set", "external_links": [], "published": "2015-10-20T00:01:00.000+03:00", "crawled": "2015-10-20T03:06:14.102+03:00", "highlightTitle": ""}