{"organizations": [], "uuid": "c9a25c29f6cba3c824ead9e76405f1d4741e7165", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sacbee.com", "main_image": "http://www.sacbee.com/news/local/health-and-medicine/ox6f08/picture41343798/ALTERNATES/LANDSCAPE_1140/RB_LGBT_Vets_1", "site_section": "http://www.sacbee.com/?widgetName=rssfeed&widgetContentId=713546&getXmlFeed=true", "section_title": "Breaking News, Sports, Weather & More | Sacbee.com &", "url": "http://www.sacbee.com/news/local/health-and-medicine/article41343828.html", "country": "US", "title": "LGBT vets access health resources after decades of silence", "performance_score": 0, "site": "sacbee.com", "participants_count": 1, "title_full": "LGBT vets access health resources after decades of silence", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T01:42:00.000+02:00", "replies_count": 0, "uuid": "c9a25c29f6cba3c824ead9e76405f1d4741e7165"}, "author": "Sammy Caiola \nscaiola@sacbee.com", "url": "http://www.sacbee.com/news/local/health-and-medicine/article41343828.html", "ord_in_thread": 0, "title": "LGBT vets access health resources after decades of silence", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "October 24, 2015 LGBT vets access health resources after decades of silence \nVA facilities have opened doors to LGBT vets since ‘don’t ask, don’t tell’ repealed \nMather facility has increased education for staff, access for patients \nFirst resource fair Saturday drew attention to previously silenced group Andrew Vierra, left, speaks with Army veteran Sage Fox at the Sacramento VA medical Center in Rancho Cordova on Saturday, October 24, 2015. Sacramento's first LGBT Veterans fair took place at the center, providing vets with employment resources, mental health services and more. The event marks a major shift in VA care embracing LGBT vets, with more tailored care for LGBT vets following the repeal of Don't Ask Don't Tell. Randall Benton rbenton@sacbee.com Army veteran Sage Fox at the Sacramento VA medical Center in Rancho Cordova on Saturday, October 24, 2015. Sacramento's first LGBT Veterans fair took place at the center, providing vets with employment resources, mental health services and more. The event marks a major shift in VA care embracing LGBT vets, with more tailored care for LGBT vets following the repeal of Don't Ask Don't Tell. Randall Benton rbenton@sacbee.com Army veteran and Licensed Clinical Social Worker Karen Choate, left, speaks with Veterans Choice representative Jaye Mand at the Sacramento VA medical Center in Rancho Cordova on Saturday, October 24, 2015. Sacramento's first LGBT Veterans fair took place at the center, providing vets with employment resources, mental health services and more. The event marks a major shift in VA care embracing LGBT vets, with more tailored care for LGBT vets following the repeal of Don't Ask Don't Tell. Randall Benton rbenton@sacbee.com Roland Haley, left, helps his brother Air Force veteran Ernest Haley get housing assistance from Volunteers of America Veterans Services Director Becca Bettis at the Sacramento VA medical Center in Rancho Cordova on Saturday, October 24, 2015. Sacramento's first LGBT Veterans fair took place at the center , providing vets with employment resources, mental health services and more. The event marks a major shift in VA care embracing LGBT vets, with more tailored care for LGBT vets following the repeal of Don't Ask Don't Tell. Randall Benton rbenton@sacbee.com Veterans gather information about services available to them at the Sacramento VA Medical Center in Rancho Cordova on Saturday, October 24, 2015. Sacramento's first LGBT Veterans fair took place at the center, providing vets with employment resources, mental health services and more. The event marks a major shift in VA care embracing LGBT vets, with more tailored care for LGBT vets following the repeal of Don't Ask Don't Tell. Randall Benton rbenton@sacbee.com 1 of 5 \nscaiola@sacbee.com \nSage Fox walked confidently through the Sacramento VA Medical Center on Saturday morning, red curls falling over her black Audrey Hepburn T-shirt as she visited one resource table after another, scooping up pamphlets for mental health services and veteran support groups. \nFox, 42, was enlisted as a U.S. Army service member from 1993 to 1998, forced by the federal “don’t ask, don’t tell” policy to serve as male – her birth gender – and hide her identity as a trans woman. After a 10-year break and a gender transition, she returned as a female signal officer in 2013, refusing to cut her hair and change her clothes to serve as a man. \nWe’re a rainbow community, not just a red, white and blue community. \nRobert Elston, Roseville \nNow out of active service and working as an IT manager in Sacramento, Fox receives much of her transition-related health care at the Mather VA facility. She’s part of a vocal group of vets fighting for resources that meet the needs of lesbian, gay, bisexual and transgender individuals post-service. \n“The problem we’ve had is ignorance,” said Fox. “There’s a lack of knowledge, because people didn’t talk about this for so many years. They’re just now learning that (trans vets) are not sexual deviants and we’re not perverts. We’re just individuals.” \nYears of forced closeting in the military, be it for gender identity or sexual orientation, has had a major impact on the mental health of LGBT vets, said Art Ackerman, supervisory health systems specialist for VA Northern California. Lesbian and bisexual female veterans experience higher rates of military sexual trauma than heterosexual veterans, and go on to struggle with substance abuse and obesity to a greater degree than their peers, according to data from the Veterans Health Administration. Transgender veterans are 20 times more likely than the general veteran population to exhibit suicidal behavior. \nThose risk factors make it integral that LGBT vets receive health care, but many don’t due to stigma, Ackerman said. \n“The older veterans, who have experienced the Department of Defense as a very prejudiced place or a place where they had to hide who they were, they might translate that experience to the VA,” he said. “It’s very important for them to have positive experiences with us, so we can really show them we’re moving beyond that.” \nSince the repeal of “don’t ask, don’t tell” in 2011, the VHA has created health equity work groups, hired LGBT program coordinators, issued a directive on transgender and intersex health care and more in a large-scale effort to better accommodate this newly recognized population. The policy on service by gays and lesbians in the military was instituted by the Clinton administration in 1993. \nThe Honoring LGBT Veterans Resource Fair, held for the first time Saturday at the Mather medical facility, was an example of how initiatives are trickling down to local care settings, Ackerman said. Several dozen veterans and their families popped into the free event to collect information about disability claims, emotional support services, healthy lifestyle assistance and even military-themed library books. \nShanique Davidson and Karinne Providence, a veteran couple in their 30s who both receive health care at Mather, said they were shocked to see so many others attending the event, and so much support coming from the providers. \nThe pair married in Maryland in 2010 after leaving the military. \n“Life in the military as LGBT has been hard, and the fact that they’ve been so welcoming is wonderful,” Providence said. “It makes us feel like they’re starting to pay attention.” \nOne of the biggest hurdles for providers is that they lack the right language to ask patients about their sexual orientation or figure out their preferred gender pronouns, said Gene P. Silvestri, secretary of Sacramento Valley Veterans, a chapter of national nonprofit American Veterans for Equal Rights. \nThose conversations, though they can be awkward, play a big part in the type of care a doctor might provide. Homosexual men, for example, may need HIV services that heterosexual men might not. A transgender female may require prostate examinations, depending on where she is in her transition. \n“Not a lot of primary care physicians ask anything about gender identity and sexual orientation,” he said. “A lot of times it’s left up to the veteran to come out.” \nThough there’s still progress to be made, the banners and balloons posted throughout the Sacramento medical center make it clear that VA culture has shifted. Robert Elston, a 59-year-old Roseville vet who was closeted for all of his U.S. Coast Guard service in the 1970s, said he’s felt extremely comfortable receiving care in recent years. \n“This is groundbreaking,” Elston said of the Saturday event. “This is a very overdue commitment from the VA to the vets who sacrificed. We’re a rainbow community, not just a red, white and blue community.” \nSammy Caiola: 916-321-1636 , @SammyCaiola \nVeterans group \nSacramento Valley Veterans meets on the third Monday of every month at the Lavender Library, 1414 21st St., Sacramento Related content", "external_links": [], "published": "2015-10-25T01:42:00.000+02:00", "crawled": "2015-10-25T12:16:28.889+02:00", "highlightTitle": ""}