{"organizations": [], "uuid": "27498357037074944e8a3b29a50e27d22f13a6ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.winnipegfreepress.com", "main_image": "http://media.winnipegfreepress.com/images/NSD528304892_high.jpg", "site_section": "http://www.winnipegfreepress.com/rss/?path=/sports", "section_title": "Winnipeg Free Press: Sports", "url": "http://www.winnipegfreepress.com/sports/canadian-press-newsalert-royals-take-2-0-lead-over-blue-jays-in-alcs-333681181.html", "country": "US", "title": "Price near perfect for six innings before Royals mount six-run rally to beat Jays", "performance_score": 0, "site": "winnipegfreepress.com", "participants_count": 1, "title_full": "Price near perfect for six innings before Royals mount six-run rally to beat Jays - Winnipeg Free Press", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T21:32:00.000+03:00", "replies_count": 0, "uuid": "27498357037074944e8a3b29a50e27d22f13a6ee"}, "author": "Neil Davidson, The Canadian Press", "url": "http://www.winnipegfreepress.com/sports/canadian-press-newsalert-royals-take-2-0-lead-over-blue-jays-in-alcs-333681181.html", "ord_in_thread": 0, "title": "Price near perfect for six innings before Royals mount six-run rally to beat Jays", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "KANSAS CITY, Mo. - Once again the Blue Jays find themselves in an 0-2 playoff hole. But this time they will need a bigger shovel to dig themselves out from under a relentless, opportunistic Kansas City Royals team.\nToronto's roller-coaster return to the post-season hit a couple more mighty highs and lows Saturday when the Royals, denied by David Price for six innings, rallied for five runs in the seventh to stun the Jays 6-3 and take a commanding lead in their American League Championship series.\n\nKansas City Royals' Alex Gordon follows through after hitting a RBI double in front of Toronto Blue Jays catcher Russell Martin during seventh inning game two ALCS playoff baseball action in Kansas City, Mo., on Saturday, October 17, 2015. THE CANADIAN PRESS/Nathan Denette \nIt was a remarkable turnaround to a game that the Jays seemed to have well in command with Price retiring a franchise post-season record 18 in a row after seeing his first pitch slammed into right for a single by Alcides Escobar.\nThen the worm turned.\nStaked to a 3-0 lead by one run in the third and two in the sixth, Price was cruising until a seventh-inning fielding miscue ended his streak of outs and opened the door for the Royals, who took advantage by sending nine to the plate and scoring five runs.\n\"Our guys, they never quit. They keep going,\" said Kansas City manager Ned Yost.\nThe best-of-seven series switches back to Toronto on Monday when Marcus Stroman and Rangers ace Johnny Cueto face off in Game 3 of the best-of-seven series at Rogers Centre.\n\"Our backs are up against the wall but it will be good to go back home where we normally play well,\" said a subdued Toronto manager John Gibbons, whose team rallied from an 0-2 start to beat Texas in the best-of-five ALDS. \"We'll have Stroman going Monday, we'll feel good. But yeah, it's a lot tougher from here but we've got a pretty good team too.\"\nThe Royals opened the series with a comprehensive 5-0 win Friday night, marking just the third time in 47 career post-season games that Toronto had been shut out.\nThe Jays' free-swinging offence, which averaged 5.5 runs a game in the regular season, has managed a total of three in the first two games of this series — leaving little margin of error in pitching or defence.\nSince the best-of-seven series was adopted in 1985, the team that has won Game 2 of the ALC has advanced to the World Series 23 times in 29 series (79 per cent) including 14 of the last 16 (88 per cent).\nThe Royals are the 26th team in LCS history (AL and NL) to take a 2-0 lead in the best-of-seven series. All but three of the previous 25 advanced to the World Series.\nAgainst Texas in the ALDS decider, it was Toronto who administered a one-inning smackdown. This time it was the Jays' turn to take it.\n\"David was so good night, it's a shame it had to end that way,\" said Gibbons.\n\"It was unfortunate. You really can't pitch a better game, to that point anyway,\" he added. \"He did a hell of a job. Sometimes there's that one little crack, like I said, when you're on the road, can open up the floodgates. We saw that at home that last game against Texas.\n\"They're pesky, they battle you. But you know he held them at check, I don't even think he broke a sweat before that seventh inning. He did a hell of a job. Deserved better, that's for sure.\"\nHow good was Price?\nHe set two franchise records — his eight strikeouts were also a Jays' playoff mark — and joined some select company.\nCueto set down 19 in a row earlier this week in Game 5 of the Royals' ALDS, the longest streak in an AL post-season game since the Yankees' Don Larsen retired 27 straight Dodgers in Game 5 of the 1956 World Series, the only perfect game in post-season history.\nThe crack Saturday was a seventh-inning miscommunication between Jose Bautista and Ryan Goins on a leadoff popup that allowed Ben Zobrist to reach first as the ball dropped to the right-field turf between the two Jays, who looked at each other as if to say 'What just happened?\"\n\"I just thought I heard an 'I got it,' but it was nothing,\" Goins said. \"I should have gone in more aggressively.\"\n\"It turned out to be a huge play and they did a good job of rallying,\" he added. \"That was kind of the turning point in the game.\"\nLorenzo Cain singled to put men on first and second, extending his post-season hitting streak to 11 games to tie the Royals' record. Eric Hosmer then singled in Zobrist and Cain scored on a Kendrys Morales' groundout. Mike Moustakas' single made it 3-3 bringing the sellout crowd of 40,357 to its feet.\nOne out later, Alex Gordon doubled home Moustakas to take the lead. That chased Price but the scoreboard kept turning with Alex Rios' RBI single off reliever Aaron Sanchez.\nPrice threw 66 pitches over the first six innings, then 30 in 2/3 of the seventh. He gave up five runs on six hits with eight strikeouts and no walks in a 96-pitch outing that included 69 strikes.\n\"I just gave up hits at the wrong time,\" he said. \"I felt good. That's a very scrappy team. They put the ball in play, they continue to battle. That's a tough loss.\"\nThe Royals added another run in the eighth on three walks and a single off Sanchez and Aaron Loup.\n\"We just needed to catch a break,\" said Moustakas. \"Price was throwing the ball unbelievable. We got that early hit. And he was kind of cruising throughout the rest of the game.\n\"And I think we just needed to find a way to get a runner on base so we can do what we can, which is to keep the line moving. ... And it turned into a big inning for us.\"\nWade Davis made life interesting in the ninth, giving up a single to Kevin Pillar and walking pinch-hitter Cliff Pennington before closing the door by striking out Ben Revere and Josh Donaldson and inducing Bautista to fly out.\nThe Royals are authoring their own comeback story in the playoffs.\nThey trailed Houston in all five ALDS games, recovering in three of them to win. And they are the first team to trail by multiple runs in four of their first five victories in one post-season since the 1996 Yankees, according to ESPN Stats.\nPrice, a Cy Young candidate again after an 18-5 mark this season, came into the game with a 2-6 post-season record but 0-6 as an a starter with a 5.23 ERA and .265 opponents' average. He lost Game 1 of the ALDS as a starter and won Game 4 as a reliever.\n\"Good things are coming,\" he said Friday. \"I know they are.\"\nAnd for six innings, he was right.\nHis seven straight losses in post-season starts are an MLB record, tying Randy Johnson, according to Baseball Reference.\nPrice's earned-run average is 7.02 this post-season, compared to 2.30 in the regular season with Toronto.\nYost suggested the fading late-afternoon sunlight didn't help the batters early on.\n\"Seriously, the first six innings was really tough to see,\" he said. \"The glare off the backdrop made it tough. And as soon as the seventh inning came we started to get the shadow back there, I don't know if it's coincidence or not, but that's when we started to get a nice run going.\"\nTwo Jays playing in pain helped Toronto to an early lead with Edwin Encarnacion (finger) and Troy Tulowitzki (shoulder) recording timely hits to drive in runs.\nTulowitzki came into the game in a 2-for-25 slump.\nHard-throwing Royals right-hander Yordano Ventura gave up three runs on eight hits over 5 1/3 innings with six strikeouts and two walks. He threw 97 pitches, 60 for strikes.\nReliever Danny Duffy, with one scoreless inning, got the win and Davis the save.\nThe third-inning Jays run snapped a post-season scoreless streak by Kansas City pitchers at a franchise-record 18 innings. It also ended a 12-innings Toronto post-season drought.\nFollow @NeilMDavidson on Twitter\n ", "external_links": [], "published": "2015-10-17T21:32:00.000+03:00", "crawled": "2015-10-18T08:13:42.480+03:00", "highlightTitle": ""}