{"organizations": ["Livingston Daily", "Novi Howell"], "uuid": "152461a7089b97a4d2fefbe21316870dc5681370", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.livingstondaily.com", "main_image": "http://www.gannett-cdn.com/-mm-/838dc4ab9c498b9a15a323b1cad8aa74ce62dcdf/c=0-265-1931-1356&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/23/MIGroup/Livingston/635812406249972872-HHS-Novi-football-07.jpg", "site_section": "http://rssfeeds.livingstondaily.com/livingston/sports", "section_title": "Livingston - Sports", "url": "http://www.livingstondaily.com/story/sports/high-school/football/2015/10/24/howell-playoff-hopes-dim-43-21-loss-novi/74510768/", "country": "US", "title": "Howell playoff hopes dim with 43-21 loss to Novi", "performance_score": 0, "site": "livingstondaily.com", "participants_count": 0, "title_full": "Howell playoff hopes dim with 43-21 loss to Novi", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T07:49:00.000+03:00", "replies_count": 0, "uuid": "152461a7089b97a4d2fefbe21316870dc5681370"}, "author": "", "url": "http://www.livingstondaily.com/story/sports/high-school/football/2015/10/24/howell-playoff-hopes-dim-43-21-loss-novi/74510768/", "ord_in_thread": 0, "title": "Howell playoff hopes dim with 43-21 loss to Novi", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Gillis", "Howell", "Tim Robinson", "Logan Russo"], "text": "Howell playoff hopes dim with 43-21 loss to Novi Tim Robinson, Livingston Daily 12:49 a.m. EDT October 24, 2015 Logan Russo keeps his eye on the ball in the second quarter while completing a 29-yard reception for the Highlanders' second touchdown. (Photo: Gillis Benedict/Livingston Daily) 25 CONNECT 1 TWEET LINKEDIN COMMENT EMAIL MORE \nHOWELL -- For three quarters, Howell had kept Novi's offense, specifically Emanuel Jackson, mostly in check. \nAs a result, Howell was well within range of the Wildcats at the end of three quarters, 23-21. \nBut Jackson showed why he's a University of Louisville commit in the fourth quarter, scoring five times, including a 77-yard touchdown pass, as the Wildcats knocked off Howell 43-21 in the regular-season finale. \nThe result left both teams at 5-4 and waiting to see what happens when the MHSAA announces playoff pairings on Sunday. \n\"I don't know what I'm going to do,\" said Howell's Alfred Moll, who scored the first touchdown of the night on a 62-yard bomb from Brett Chaperon. \"I'm going to be praying an hoping I get to play this great game one more time.\" \nIt wasn't for lack of effort on the Highlanders' part. Their defense was as stout as ever, but Jackson was too much. He had nine catches for 172 yards and 128 yards on 18 carries, 70 of those on two touchdowns in the fourth quarter. \n\"Our defense came in with a good plan,\" Howell coach Aaron Metz said. \"We were counting on (Jackson( hitting a couple of big plays, but not the number he did. Our kids played hard, and I'm proud of our kids and our seniors. Now we wait and see.\" \nAfter both teams tested each other's defenses early in the first quarter, there were three touchdowns scored in the final four minutes. \nThe first was Moll's score, where he streaked through the middle of the Novi defense and caught the ball in stride while passing Wildcats defenders. \nNovi tied the game on a 61-yard bomb from Alec Bageris to Anthony D'Annibale, then turned an interception by Traveon Maddox deep in Howell territory into the first of Jackson's scores, a 6-yard run that gave the Wildcats the lead, 14-7 \nThe Highlanders tied the game when Chaperon (14-of-22 for 237 yards, three touchdowns and two interceptions) found Logan Russo for a 29-yard score midway through the second. \nJackson scored just before halftime on a 38-yard strike from Bageris, a touchdown that gave Novi the lead for good. \nAfter a Novi field goal in the third quarter, the Highlanders got within two, 23-21, on Chaperon's 11-yard scoring pass to Mitch Susalla. \nThen Jackson went to work. \n\"He was just finding holes,\" Moll said. \"We weren't doing our jobs, and he executed.\" \nAt 5-4, the Highlanders' hopes of making the playoffs are still alive, but it all depends on how many teams with that record make it into the playoff field. \nThomas Lassiter carried the ball five times for 55 yards on Howell's final drive, a senior getting his last touches, but it was Chaperon, who ran Howell's spread brilliantly all season, who got to make the last play, a 4-yard pass to Susalla as time ran out. \n\"Everybody, every single kid on that roster was doing their job,\" he said. \"That's what makes the team successful, and I believe we were successful. We put our heart and soul into everything we did, and that's something to hang your hat on, not just in football, but in life.\" \nSoon after, Lassiter sat down with junior Joey Gossett and they talked as the lights dimmed and the stands were cleared, two young men spending as much time on their home field as they could before having to face whatever is next. 25 CONNECT 1 TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http://ldpaa.com/1LTwi8P TOP VIDEOS", "external_links": [], "published": "2015-10-24T07:49:00.000+03:00", "crawled": "2015-10-24T23:47:50.418+03:00", "highlightTitle": ""}