{"organizations": [], "uuid": "7115b703a82b21e88af02240c25215969d028c5d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxsports.com", "main_image": "http://www.foxsports.com/content/fsdigital/fscom.img.png", "site_section": "http://api.foxsports.com/v1/rss?partnerKey=zBaFxRyGKCfxBagJG9b8pqLyndmvo7UU&tag=cfb", "section_title": "FOX Sports Digital", "url": "http://www.foxsports.com/college-football/story/ranked-matchups-highlight-missouri-valley-slate-100815", "country": "", "title": "Ranked matchups highlight Missouri Valley slate", "performance_score": 0, "site": "foxsports.com", "participants_count": 0, "title_full": "Ranked matchups highlight Missouri Valley slate", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T02:36:00.000+03:00", "replies_count": 0, "uuid": "7115b703a82b21e88af02240c25215969d028c5d"}, "author": "", "url": "http://www.foxsports.com/college-football/story/ranked-matchups-highlight-missouri-valley-slate-100815", "ord_in_thread": 0, "title": "Ranked matchups highlight Missouri Valley slate", "locations": ["Missouri Valley"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ranked matchups highlight Missouri Valley slate AP Oct 8, 2015 at 7:36p ET 0Shares \n(STATS) - Consider it a matter of bad timing. \nWith a number of key injuries on offense, Illinois State isn't catching any breaks this weekend when it goes up against the nation's No. 1 defense. \nQuarterback Tre Roberson and two starting receivers are uncertain to play, but the fourth-ranked Redbirds will still have workhorse Marshaun Coprich on Saturday night when they go after their first victory at No. 9 Youngstown State in eight years. \nJake Kolbe completed 11 of 16 for 80 yards with one interception while filling in for Roberson in last Saturday's 21-13 home win over then-No. 7 Northern Iowa. Wideouts Christian Gibbs (ribs) and Jon-Marc Anderson (bone bruise) were also sidelined. \nRoberson, day-to-day with a hand injury, has thrown for 512 yards with five touchdowns and one interception and also rushed for 76 yards and a score. \n\"You can't feel sorry for yourself because that's part of the game,\" Illinois State coach Brock Spack said. \"We found a way to win.\" \nSpack's club is also dealing with injuries on defense as all-conference end Teddy Corwin will likely be a game-time decision because of a foot injury. \nIf Roberson is unable to go, the Redbirds (3-1, 1-0 Missouri Valley Conference) will likely increase Coprich's workload. The senior became the school's all-time leading rusher with 3,738 yards after running for 169 and two scores last Saturday. \n\"He's going to have to play that way every week for us to have a chance for us to be successful because that's what we need,\" Spack added. \"Great players have to play great in big games and every game is big in the Missouri Valley.\" \nCoprich has rushed for 254 yards on 6.5 per carry with three touchdowns in two meetings with Youngstown State. The Penguins lead the nation with 243.8 yards allowed per game, though they're giving up 174.3 on the ground. \nYoungstown State (3-1, 1-0) seeks its fourth straight win after beating Saint Francis and South Dakota by a combined 79-6. With 21 career sacks, junior defensive end Derek Rivers is one away from the school's all-time record. \n\"We are nowhere near where we need to be, but I think there are some positives,\" coach Bo Pelini insisted. \"I think they're starting to learn and understand what we're trying to do. We've just got to keep working at it.\" \nThe Penguins could be without starting left tackle Trevor Strickland for a second consecutive contest for personal reasons. Sophomore Cameron Fraser started in Strickland's absence against the Coyotes. \nHunter Wells will try to bounce back after throwing his first two interceptions last weekend, while Martin Ruiz hopes to be a force in the running game after piling up 284 yards and three touchdowns over the past three games. \nRuiz had 106 yards on 18 carries and Andrew Williams added six catches for 158 yards and a touchdown in a 35-21 road loss to the Redbirds last November. Wells and Roberson both threw for two scores and one pick in that contest. \nThe home team has won each of the past seven meetings since Illinois State's 27-22 win at Stambaugh Stadium on Oct. 20, 2007. \nIndiana State failed to defend its home field against South Dakota State in last season's matchup, falling 32-17 while dropping the third consecutive meeting overall. \nThe 19th-ranked Sycamores (3-1, 1-0) look to snap that skid Saturday night when they visit the No. 8 Jackrabbits (3-1, 0-1), but they might have to figure out a way to slow standout sophomore receiver Jake Wieneke to do so. \nWieneke caught six passes for 172 yards and two touchdowns in last year's win, including a 91-yard scoring catch that tied the longest in program history and gave the Jackrabbits the lead for good. He leads the MVC and ranks fifth in the nation with 567 yards, and his six TD grabs also pace the conference and are tied for fourth in the FCS. \nNorth Dakota State shut Wieneke down last week, though, as he finished with three catches for 39 yards in a 28-7 home loss. Still, Indiana State coach Mike Sanford doesn't believe the Bison necessarily laid out a blueprint for how to stop Wieneke. \nThe Sycamores rank eighth in the 10-team conference with 412.0 yards allowed per game and have given up the second-most receiving touchdowns. \n\"Every team is different,\" Sanford said. \"We run a different scheme and have different talents (than NDSU).\" \nSDSU will have its own challenges on defense. Indiana State's Matt Adam threw for career highs of 265 yards and four touchdowns in last week's 38-27 win at Missouri State and was named the MVC offensive player of the week. \nThe sophomore's passer rating of 141.0 ranks fourth in the conference, one spot below the Jackrabbits' Zach Lujan's 149.1. \n\"He's really impressive,\" SDSU coach John Stiegelmeier said of Adam. \"He makes really good decisions, quick decisions. He can hurt you with his legs, too, like many of the quarterbacks in our league. I'm amazed at some of the plays he makes.\" 0", "external_links": [], "published": "2015-10-09T02:36:00.000+03:00", "crawled": "2015-10-09T02:50:55.932+03:00", "highlightTitle": ""}