{"organizations": [], "uuid": "f4e8bfe73a0e0a3aeba271dff9aede4aed4ca5d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.torontosun.com", "main_image": "http://storage.torontosun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297760705888_ORIGINAL.jpg?quality=80&size=100x", "site_section": "http://www.torontosun.com/sports/hockey", "section_title": "Hockey | Sports | Toronto Sun", "url": "http://www.torontosun.com/2015/10/16/day-as-fans-gives-maple-leafs-players-some-perspective", "country": "CA", "title": "Day as fans gives Maple Leafs players some perspective | Toronto Maple Leafs | S", "performance_score": 0, "site": "torontosun.com", "participants_count": 1, "title_full": "Day as fans gives Maple Leafs players some perspective | Toronto Maple Leafs | S", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T12:18:00.000+03:00", "replies_count": 0, "uuid": "f4e8bfe73a0e0a3aeba271dff9aede4aed4ca5d0"}, "author": "torontosun.com", "url": "http://www.torontosun.com/2015/10/16/day-as-fans-gives-maple-leafs-players-some-perspective", "ord_in_thread": 0, "title": "Day as fans gives Maple Leafs players some perspective | Toronto Maple Leafs | S", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "TORONTO - A few Maple Leafs wear Blue Jays caps when not on duty, but a visit to the Rogers Centre on Wednesday was a chance for them to really embrace what the local sports fan goes through.\nMost of the team watched Game 5 of the Blue Jays' American League division series against the Texas Rangers, about half the club from various spots around the Rogers Centre after they joined the scramble for tickets. When Jose Bautista hit his three-run homer (a ball almost caught by centre Nick Spaling ) and the nearly 50,000 spectators celebrated the win, the Leafs were in the thick of it, making no attempt to be incognito.\n\"That's the only time I've ever jumped around and hugged other fans,\" defenceman Morgan Rielly said. \"It was a crazy atmosphere.\"\nWinger Brad Boyes was with a group of friends and cousins and like many GTA-born Leafs, had been pulling for the ball team to return to its early-1990s glory.\n\"In the hockey life, I'm just going to follow teams that I played on. But to have one team that you paid attention to and were a fan of, to see them go through this ... it's awesome to sit in a fan's shoes and enjoy it from their perspective.\"\nThat experience also meant many of the Leafs were as mixed up and mortified in the top of the seventh inning when Russell Martin 's errant throw looked like it would lead to one of the cheesiest winning runs in MLB playoff history.\n\"No one at the stadium knew it was a legal run, that's why you saw all the anger and confusion,\" winger Joffrey Lupul said. \"But you never like to see people throwing stuff on the field. Hopefully we don't do that again at any sporting events here.\n\"But it was awesome to see the people that happy, leaving the stadium and then in the streets. it was a fun afternoon.\"\nWHEN THE WHEELS FALL OFF\nMike Babcock viewed the strange events in the seventh inning from the perspective of a motivational coach.\nHe was asked to compare it to some of the tense moments his teams have faced late in Stanley Cup games or Olympic medal matches with Team Canada.\n\"Any way you look at it, it's emotionally draining (for the players),\" Babcock said. \"You can't become unnerved. It was interesting for me to watch and see how pro athletes' nerves and emotion can get in the way (as the Rangers began booting the ball away and losing composure).\n\"That's just reality. I see that with our team, when things go wrong, too. We have to learn to control those things. We look at it from our (Jays') side; we won and everything's rosy. It's probably a tough pill to swallow on the other side.\"\nREIM TIME FRIDAY\nThe anticipated move to split goaltenders James Reimer and Jonathan Bernier for weekend games in Columbus and Pittsburgh still makes for an interesting sub-plot. Hoping that one of his goalies eventually establishes himself, Babcock gave the first start to Reimer, who played well enough against Ottawa in Toronto's last game, a 5-4 shootout loss that included too many Sens' power plays.\nReimer also has a record of 3-0-0-1 against Columbus, compared to almost identical negative numbers for Bernier versus a better Pens' team.\n\"I did lots of that (comparing head-to-head info) and we have that all added up,\" Babcock said. \"But it didn't come into account this week, I just thought that they were both playing this weekend.\n\"(Ultimately) they'll decide it and I'll just watch them.\n\"They've obviously worked hard at this all summer. Goaltending is the hardest position, we see a lot of them (around the league) struggle out of the gate. But we're expecting them to be real good. We need it on a nightly basis here. We think they're both capable of being better than they have been so far.\"\nAnother change could see defenceman Scott Harrington replace Martin Marincin .\nDay as fans gives Maple Leafs players some perspective\nBy Lance Hornby , Toronto Sun First posted: Friday, October 16, 2015 12:18 AM EDT | Updated: Friday, October 16, 2015 12:26 AM EDT\nA few Maple Leafs wear Blue Jays caps when not on duty, but a visit to the Rogers Centre on Wednesday was a chance for them to really embrace what the local sports fan goes through.\nMost of the team watched Game 5 of the Blue Jays' American League division series against the Texas Rangers, about half the club from various spots around the Rogers Centre after they joined the scramble for tickets. When Jose Bautista hit his three-run homer (a ball almost caught by centre Nick Spaling ) and the nearly 50,000 spectators celebrated the win, the Leafs were in the thick of it, making no attempt to be incognito.\n\"That's the only time I've ever jumped around and hugged other fans,\" defenceman Morgan Rielly said. \"It was a crazy atmosphere.\"\n Toronto Maple Leafs Game\nMaple Leafs felt\nMaple Leafs cheer on Blue Jays 0\nBabcock on Leafs getting overshadowed by Jays: 'Nobody knows you're alive' 0\nInside ", "external_links": ["http://pubads.g.doubleclick.net/gampad/clk?id=182027221&iu=/3081/SMCO_ENUR_TSUN_EN_WEB", "http://pubads.g.doubleclick.net/gampad/clk?id=228633661&iu=/3081/SMCO_ENUR_TSUN_EN_WEB", "http://pubads.g.doubleclick.net/gampad/clk?id=182024221&iu=/3081/SMCO_ENUR_TSUN_EN_WEB", "http://pubads.g.doubleclick.net/gampad/clk?id=183052021&iu=/3081/SMCO_ENUR_TSUN_EN_WEB"], "published": "2015-10-16T12:18:00.000+03:00", "crawled": "2015-10-16T10:27:02.998+03:00", "highlightTitle": ""}