{"organizations": [], "uuid": "8126044e93836d8f3cb34c9b24c77eeb2e2b0c17", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kmph-kfre.com", "main_image": "", "site_section": "http://www.kmph-kfre.com/Global/category.asp?C=102651&clienttype=rss", "section_title": "KMPH Fox 26 - Sports", "url": "http://www.kmph-kfre.com/story/30265131/fresnan-wins-ironman", "country": "US", "title": "Fresnan Wins IRONMAN", "performance_score": 0, "site": "kmph-kfre.com", "participants_count": 1, "title_full": "Fresnan Wins IRONMAN", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T08:19:00.000+03:00", "replies_count": 0, "uuid": "8126044e93836d8f3cb34c9b24c77eeb2e2b0c17"}, "author": "Ralph Wood", "url": "http://www.kmph-kfre.com/story/30265131/fresnan-wins-ironman", "ord_in_thread": 0, "title": "Fresnan Wins IRONMAN", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Fresnan Wins IRONMAN - KMPH FOX 26 | Central San Joaquin Valley News Source Member Center: rwood@kmph.com Fresno - \nFresno's Chris Montross has won the world championship at Hawaii's IRONMAN Triathlon. The 55-year-old took the title for his age group at the prestigious endurance event. \nThe IRONMAN Triathlon is a 2.4 mile swim, a 112 mile bike ride, and a full marathon of 26.2 miles. Montross covered the 140.6 miles in Kailua-Kona in ten hours, six minutes and 35 seconds. Local News Local News More>> Cal State Faculty To Vote On Possible Strike Over Salaries Professors, librarians, counselors and other California State University employees are preparing to vote on whether to permit their labor union to call a strike over stalled salary negotiations. More >> Professors, librarians, counselors and other California State University employees are preparing to vote on whether to permit their labor union to call a strike over stalled salary negotiations. More >> Mom Won't Let Her Son Return To Visalia Elementary School A Mom of a kindergarten student says a Visalia elementary school let her son leave school with a stranger. The mix-up happened Tuesday at Linwood Elementary School.Close to noon on Tuesday, Brittany Anderson says she got a call from the school telling her that they couldn't locate her son Zaydan. \"I was so scared out of my mind. My heart like stopped and I felt like my body went so cold. They had no clue where my son was or who he was wi... More >> A Mom of a kindergarten student says a Visalia elementary school let her son leave school with a stranger. The mix-up happened Tuesday at Linwood Elementary School.Close to noon on Tuesday, Brittany Anderson says she got a call from the school telling her that they couldn't locate her son Zaydan. \"I was so scared out of my mind. My heart like stopped and I felt like my body went so cold. They had no clue where my son was or who he was wi... More >> Golden Gate Bridge to Have Suicide Nets by 2019 San Francisco is now taking measures to discourage suicide jumpers at the Golden Gate Bridge.It is now getting a $76 million safety net of steel wires. More >> San Francisco is now taking measures to discourage suicide jumpers at the Golden Gate Bridge.It is now getting a $76 million safety net of steel wires. More >> MLK Tribute Planned at Confederate Site A plan is in place right now to put a tribute to Martin Luther King, Jr. on Stone Mountain in Georgia. This is the same place as a monument honoring confederate leaders. A civil rights group is now getting together to oppose adding the MLK tribute. More >> A plan is in place right now to put a tribute to Martin Luther King, Jr. on Stone Mountain in Georgia. This is the same place as a monument honoring confederate leaders. A civil rights group is now getting together to oppose adding the MLK tribute. More >> Dos Palos Plant Fire Forces People to Stay Indoors A big fire now has people in Dos Palos wondering if it's okay to go outside Wednesday.People there were warned to stay inside Tuesday night with the windows closed because of possible toxic fumes in the air. More >> A big fire now has people in Dos Palos wondering if it's okay to go outside Wednesday.People there were warned to stay inside Tuesday night with the windows closed because of possible toxic fumes in the air. More >>", "external_links": [], "published": "2015-10-15T08:19:00.000+03:00", "crawled": "2015-10-15T15:42:56.774+03:00", "highlightTitle": ""}