{"organizations": [], "uuid": "6d9c21d8ce5b5356423d4855bc17aabd9badbb3d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.siskiyoudaily.com", "main_image": "http://www.siskiyoudaily.com/storyimage/CA/20151013/SPORTS/151019940/AR/0/AR-151019940.jpg", "site_section": "http://www.siskiyoudaily.com/sports?template=rss&mime=xml", "section_title": "Sports - Siskiyou Daily News, Yreka, CA", "url": "http://www.siskiyoudaily.com/article/20151013/SPORTS/151019940/2000/NEWS?rssfeed=true", "country": "US", "title": "Siskiyou County Football Players of the Week", "performance_score": 0, "site": "siskiyoudaily.com", "participants_count": 1, "title_full": "Siskiyou County Football Players of the Week", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T22:18:00.000+03:00", "replies_count": 0, "uuid": "6d9c21d8ce5b5356423d4855bc17aabd9badbb3d"}, "author": "Daily News Sports Editor Bill Choy @SDNBillChoy", "url": "http://www.siskiyoudaily.com/article/20151013/SPORTS/151019940/2000/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "Siskiyou County Football Players of the Week", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Siskiyou County Football Players of the Week Comment By Daily News Sports Editor Bill Choy@SDNBillChoy   By Daily News Sports Editor Bill Choy@SDNBillChoy Posted Oct. 13, 2015 at 2:18 PM By Daily News Sports Editor Bill Choy@SDNBillChoy Posted Oct. 13, 2015 at 2:18 PM SISKIYOU COUNTY Below are the Siskiyou Daily News selections for the top Siskiyou County football players for week six of the season. * Drew Kannely-Robles of Yreka High had his fifth straight 100 plus yard rushing day against Lassen at home on Friday night. The Miner senior ran for 198 rushing yards and two touchdowns, including a 63-yard score in the 34-25 loss to Lassen. He also had a fumble return on defense and threw a 10-yard touchdown pass to David Ruiz to give Yreka a 25-21 lead early in the fourth quarter. * Junior Kobe Lonnon of the Weed Cougars ran for 140 yards and three touchdown in a 41-20 win in the Shasta Cascade League opener at Burney on Friday. He also had 58 receiving yards and a touchdown. On defense, Lonnon finished with two interceptions. * Etna High Lions junior quarterback Payton Dickinson had a strong game in the Shasta Cascade League opener against Modoc on the road on Friday. Dickinson threw for two touchdowns and had a 25-yard touchdown run in a 27-13 victory. * Weed Cougar junior quarterback Thairen Sivongsa threw for 158 yards and three touchdowns for Weed against Burney. He also had an interception on defense. * Yreka High junior David Ruiz caught a 10-yard touchdown pass vs. Lassen on Friday that gave Yreka the lead early in the 4th quarter vs. Lassen. On a 4th down and 13 situation at the Lassen 23 near the end of the 3rd quarter, Ruiz caught a pass from Juan Cota and was able to stretch out and just get the first down for the Miners. * Yreka High senior Brandon Hanna of Yreka had an interception and ran the ball to the 20 of Lassen on Friday night. The INT late in the third quarter help set up a Miner score early in the fourth quarter that gave Yreka the lead. * Etna High sophomore Devonn Layton caught two touchdown passes in the victory against Modoc. *Weed Cougar senior Ss’ven Walker had two touchdowns and 83 receiving yards against Burney. * Senior Aaron Dickson of Weed had three sacks, 10 solo tackles and 13 total tackles against Burney. * Alex Urbano of Mount Shasta rushed for 68 yards and scored the Bears’ lone touchdown in a loss to Fall River. By Daily News Sports Editor Bill Choy@SDNBillChoy   By Daily News Sports Editor Bill Choy@SDNBillChoy", "external_links": [], "published": "2015-10-13T22:18:00.000+03:00", "crawled": "2015-10-14T06:42:35.222+03:00", "highlightTitle": ""}