{"organizations": ["Wickenburg Like", "Wickenburg"], "uuid": "e1cf9df35f4d1fc69edf8cbcf15b6713024715f3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "kdminer.com", "main_image": "http://kdminer.com/SiteImages/Article/67740a.jpg", "site_section": "http://kdminer.com/2_rss.xml", "section_title": "Kingman Daily Miner RSS Feeds: Sports", "url": "http://kdminer.com/Main.asp?SectionID=2&SubSectionID=2&ArticleID=67740", "country": "US", "title": "For Volunteers, running game will be key against Wickenburg", "performance_score": 0, "site": "kdminer.com", "participants_count": 0, "title_full": "For Volunteers, running game will be key against Wickenburg", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T16:02:00.000+03:00", "replies_count": 0, "uuid": "e1cf9df35f4d1fc69edf8cbcf15b6713024715f3"}, "author": "", "url": "http://kdminer.com/Main.asp?SectionID=2&SubSectionID=2&ArticleID=67740", "ord_in_thread": 0, "title": "For Volunteers, running game will be key against Wickenburg", "locations": ["Kingman", "Wickenburg"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Justin Sturgill", "Smith", "Riley Schuck", "Daniel Mazon", "Lee Williams", "Jason Ruiz", "Mohave", "Ryan Abella", "Paul Giglio", "Nate Cottrell", "Ray Smith"], "text": "10/23/2015 6:02:00 AM For Volunteers, running game will be key against Wickenburg Like this play last week against Mohave, the Lee Williams defense will have to stop the run tonight at Wickenburg. (RYAN ABELLA/Miner) Ryan Abella   It's their last road game of the season, and the Lee Williams High Volunteers are still looking for ways to clean up their game at Wickenburg tonight.After a two-game win streak against the other Kingman schools, the Volunteers dropped their Homecoming football game against Mohave by straying away from the run and racking up some critical penalties.\"We just gotta cut out the mental mistakes. We weren't able to run the ball. We gotta run the ball,\" said coach Ray Smith. \"I think the kids will pull together.\"They'll have their work cut out for them against the Wranglers. Wickenburg is averaging 334 rushing yards per game, led by their 6'1\" junior running back Riley Schuck.\"They're an old-fashioned wing team. They get into the pistol, but it's just a wing and they'll run it straight at you,\" said Smith. \"He's a tough kid that runs hard.\"The Volunteers offense has benefited from an emerging passing game. Quarterback Daniel Mazon has been passing more and is \"now becoming a threat,\" according to Smith. They'll look to utilize running backs Nate Cottrell and Paul Giglio to create some space, then air it out deep when they can.The team may have some new targets tonight, however. Wide receiver Justin Sturgill and fullback Jason Ruiz have been battling illnesses all week, and Smith is looking at getting more players involved to compensate.\"We're going to have kids who haven't had a lot of playing time this week. I'm excited to see them perform,\" he said.The game will kickoff at 7 p.m. and will be streamed online at www.MohaveTVNews.com/livesports.", "external_links": [], "published": "2015-10-23T16:02:00.000+03:00", "crawled": "2015-10-24T06:25:00.455+03:00", "highlightTitle": ""}