{"organizations": ["Big Red Express", "La Salle", "Wilmington College"], "uuid": "1db6b25bf9e0ac8fc37f676421aa37af8b807e33", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cincinnati.com", "main_image": "http://www.gannett-cdn.com/-mm-/d1b68e371664568d5a8e233a0eb5ca70a9e8ddfb/c=0-507-1316-1247&amp;r=x633&amp;c=1200x630/local/-/media/2015/09/30/Cincinnati/B9319078203Z.1_20150930171503_000_GRIC3JDAQ.1-0.jpg", "site_section": "http://rssfeeds.cincinnati.com/cincinnati-highschoolsports", "section_title": "Cincinnati - High School Sports", "url": "http://www.cincinnati.com/story/sports/high-school/ohio-high-school/2015/09/30/lasalle-runs-new-legacy/73111580/", "country": "US", "title": "La Salle’s Big Red Express in running for new legacy", "performance_score": 0, "site": "cincinnati.com", "participants_count": 0, "title_full": "La Salle’s Big Red Express in running for new legacy", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T00:15:00.000+03:00", "replies_count": 0, "uuid": "1db6b25bf9e0ac8fc37f676421aa37af8b807e33"}, "author": "", "url": "http://www.cincinnati.com/story/sports/high-school/ohio-high-school/2015/09/30/lasalle-runs-new-legacy/73111580/", "ord_in_thread": 0, "title": "La Salle’s Big Red Express in running for new legacy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Frank Russo", "Brad Anneken", "Tom Ramstetter"], "text": "La Salle’s Big Red Express in running for new legacy Tom Ramstetter 5:15 p.m. EDT September 30, 2015 La Salle senior Brad Anneken finishes second at the Finish Timing Invitational at Wilmington College Aug. 29. (Photo: Thanks to Frank Russo) \nThe Big Red Express is back. \nThe La Salle High School boys cross country team has won each of the five meets it has entered this season and the Lancers runners are starting to look like the storied program that was winning titles and was a regional and state tournament mainstay from 1986 through 2011. \n“We had some pretty high expectations this season,” said senior Brad Anneken, the Lancers’ No. 1 runner. “We made a lot of improvements in the past few years and Coach Russo has some pretty high expectations for us this year.” \nLa Salle began the year by winning the Finishtiming XC Classic Aug. 29 in Wilmington and moved on to a first-place finish at the Greenville Treaty Invitational Sept. 5 in Greenville, Ohio, where the Lancers dominated the field with five of the top nine runners. The third win was at the Troy Invitational Sept. 12 where senior Frank Pierce finished first and senior Nick Wuestefeld was second, and the Lancers had five of the top 11 runners. \nThe Lancers traveled to East Lansing, Michigan, for win No. 4 at the Spartan Invitational Sept. 19, and the fifth win was at the Midwest Catholic Championships Sept. 26 in Kettering, Ohio. \n“We’re just writing our own little legacy,” senior Jason Handley said. “We’re writing our own four-year legacy and our own tradition and hoping to spread this mentality to the underclassmen.” \nIt has been a four-year coming of age for the La Salle senior runners, specifically, Anneken, Pierce, Wuestefeld and Handley. The Lancers, dubbed the Big Red Express while reaching the regional tournament each year from 1986 through 2011, won the state title in cross country in 2005 and 2006 and have five state runner-up finishes. \nBut La Salle missed the region in 2012 and 2013. Thus, their own legacy. \n“This group had never experienced past success,” La Salle coach Frank Russo said. “They only read about it. They only saw it in our record books. This group really had to go through a lot of growing pains and develop an identity that the program in the past had established.” \nFor the first time in more than a quarter-century, La Salle was in a rebuilding phase as this current senior class reached high school. The Lancers finished fourth out of four in the Greater Catholic League South in 2012, third in 2013 and second last season when the Lancers returned to the regional meet. \n“It was a totally different mindset and this senior class had to compete when they weren’t really ready as freshmen and sophomores,” Russo said. “They learned a lot from it. They became tougher and more competitive.” \nNow the goal is to reach the state meet for the 20th time overall and the first time sine 2010. \n“Pretty much every day we’re thinking about the state meet,” Anneken said. “That’s what it’s all going toward. Definitely our goal is to get to the state meet and hopefully get on the podium.” \nLa Salle is ranked third in the latest Enquirer Division I area coaches’ poll behind No. 1 Mason and No. 2 St. Xavier. More importantly, the Big Red Express has had the look of a winner since workouts began over the summer. \n“Up to this point, they’ve mirrored the work ethic and the attitude and competitive spirit of the championship teams we’ve had in the past,” Russo said. “They’ve just had great attitudes when they’ve come to practice and we walk away each and every day knowing each of those guys have given their best effort. That’s really all you can ask. \n“On race day, the competitive spirit and the collective intensity and toughness that this team displays when they’re competing is as good as we’ve ever had in the program. I’ve been very proud of what these guys have done.” \nAnneken has three second-place finishes in four starts so far this season. Pierce has the win in Troy with a third-place finish in Greenville and a fourth-place finish last weekend. Both Anneken and Pierce have been in the top 10 in each of their races. Wuestefeld has three fifth-place finishes to go with his runner-up spot in Troy and Handley has been in the top six twice. \n“We knew we were preparing well,” Handley said. “Coach Russo was telling us every day during the summer that these are workouts his state championship teams had done. He was telling us that we’re training at an unbelievable level. We knew coming in that this could be a special season, whether or not we were thinking we’d start out 5-0. I don’t know that any of us were expecting that.” \nLa Salle will go for No. 6 Saturday at the Fairmont Charske XC Invitational. 2 CONNECT 1 TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http://cin.ci/1FFF2ie TOP VIDEOS", "external_links": [], "published": "2015-10-01T00:15:00.000+03:00", "crawled": "2015-10-01T00:51:31.998+03:00", "highlightTitle": ""}