{"organizations": ["Daimion Stafford", "Atlanta Falcons", "Falcons", "Associated Press", "NFL", "Tennessee Titans", "AP"], "uuid": "b9caddee96f6047e880abaa5fe1f211b8d2d98dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.knoxnews.com", "main_image": "http%3A%2F%2Fmediaassets.knoxnews.com%2Fphoto%2F2015%2F10%2F26%2FFalcons%20Titans%20Footba_Wood_1445857880528_25745967_ver1.0_640_480.jpg", "site_section": "http://www.knoxnews.com/feeds/rssFeed?obfType=RSS_FEED&siteId=100106&categoryId=10004", "section_title": "Sports | KNS", "url": "http://www.knoxnews.com/sports/freeman-runs-for-116-yards-as-falcons-edge-titans-10-7", "country": "US", "title": "Falcons edge Titans, 10-7", "performance_score": 0, "site": "knoxnews.com", "participants_count": 0, "title_full": "Falcons edge Titans, 10-7", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T13:11:00.000+02:00", "replies_count": 0, "uuid": "b9caddee96f6047e880abaa5fe1f211b8d2d98dd"}, "author": "", "url": "http://www.knoxnews.com/sports/freeman-runs-for-116-yards-as-falcons-edge-titans-10-7", "ord_in_thread": 0, "title": "Falcons edge Titans, 10-7", "locations": ["Tenn.", "Nashville", "Devonta Freeman"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Freeman", "TERESA M. WALKER", "Kenney", "James Kenney"], "text": "Freeman runs for 116 yards as Falcons edge Titans, 10-7 TERESA M. WALKER, AP Pro Football Writer 7:11 AM, Oct 26, 2015 Atlanta Falcons running back Devonta Freeman (24) runs the ball against Tennessee Titans safety Daimion Stafford (39) in the first half of an NFL football game Sunday, Oct. 25, 2015, in Nashville, Tenn. (AP Photo/James Kenney) James Kenney Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Show Caption Previous Next \nNASHVILLE (AP) — Atlanta wide receiver Julio Jones wants the Falcons to snap out of their offensive funk, even if they found a way to squeeze out an ugly win. \nMatt Ryan threw for 251 yards and a touchdown pass, and Devonta Freeman ran for 116 yards as the Falcons held off the Tennessee Titans 10-7 Sunday. \nThe Falcons (6-1) bounced back from their first loss this season by grinding out a road win and overcoming two interceptions. Freeman notched his third consecutive game with at least 100 yards, and Atlanta outgained Tennessee 378-256 in squeaking out the win. \n\"At the end of the day, a win's a win,\" Ryan said. \"When you go on the road in this league and get it done ... that's rewarding.\" \nStill, Jones knows the Falcons can play better. \n\"We've got to fix what we've got going on,\" Jones said. \"We came out here to get a 'W' and we got the 'W' and it's on to the Tampa Bay Buccaneers. ... It wasn't pretty, but it just shows that we're going to fight to the end.\" \nThe banged-up Titans (1-5) lost their fifth straight overall and ninth consecutive on their home field dating back to last season. They played without rookie quarterback Marcus Mariota and two starters in their secondary before losing two more starters. \nTheir defense kept them close, giving Tennessee plenty of chances needing only a field goal to force overtime. But Zach Mettenberger was intercepted by undrafted rookie Falcons safety Robenson Therezie with 1:31 left to seal Atlanta's victory. \n\"We can't make mistakes there,\" Titans coach Ken Whisenhunt said. \nThe Falcons had plenty of chances to keep this from being close late. \nAtlanta coach Dan Quinn thought the Falcons scored when Ryan hit Julio Jones with a 3-yard pass, but officials ruled the receiver short of the goal line. Not even Quinn's challenge helped as officials ruled Jones down 6 inches outside the end zone after he tried sticking the ball past the pylon. Quinn said he got no explanation. \nThe Titans stopped Atlanta fullback Patrick DiMarco on third down, then Titans linebacker Avery Williamson intercepted Ryan's pass intended for Jacob Tamme in the end zone with 6:30 left. \nTennessee turned it over on downs with 3:30 left. \nAtlanta kicker Matt Bryant then pushed a 47-yard field goal wide right with 2:28, giving Tennessee one final chance. Instead, the Titans have lost three games in this skid by a combined six points. \nRyan became the fifth-fastest quarterback to throw for 30,000 yards in his career. He came in needing 83 yards passing to reach that mark in his 117th game, which he got with a 2-yard pass to Jones midway through the second quarter. Only Dan Marino (114), Kurt Warner (114), Peyton Manning (115) and Aaron Rodgers (116) were faster. \nThe Titans intercepted Ryan in the second quarter when linebacker David Bass tipped the ball into the air and grabbed it. Mettenberger found Kendall Wright for a 19-yard touchdown on the next play and a 7-0 lead in the second quarter for the Titans' only points of the game. \nThe Titans played without cornerback Perrish Cox (hamstring) and safety Michael Griffin (left knee), and cornerback Jason McCourty left early in the third quarter with a sore hamstring. They lost their second center in as many games at halftime when rookie Andy Gallik was sidelined by a concussion. That forced Joe Looney, signed Tuesday, onto the field. \nAtlanta took control in the third quarter, outgaining the Titans 134-35. Ryan finished off an 88-play drive by tossing an 8-yard TD pass to Jones, giving the Falcons their first lead of the game at 10-7 late in the quarter. \nNotes: Freeman is the first Falcons running back to rush for 100 yards or more in three straight games since 2009. Atlanta now has rushed for 100 yards or better in five straight games for the first time since 2011. ... Neither Falcons WR Leonard Hankerson (hamstring) nor Falcons S William Moore played in the second half with an injured groin. Copyright 2015 Journal Media Group. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.", "external_links": [], "published": "2015-10-26T13:11:00.000+02:00", "crawled": "2015-10-26T15:41:53.353+02:00", "highlightTitle": ""}