{"organizations": [], "uuid": "3c6c060ccc4c123018858c17b73d9d042aa2c004", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.greenfieldreporter.com", "main_image": "http://d1bdhkmqqz901h.cloudfront.net/1200x630/smart/cdn1.therepublic.com/smedia/4/f/4f61280a72084b049883557464f17361/web_full_186497123735.jpg", "site_section": "http://greenfieldreporter.com//feed/sec/6000", "section_title": "GreenfieldReporter.com - Sports News", "url": "http://www.greenfieldreporter.com/view/story/4f61280a72084b049883557464f17361/CAR--F1-Russian-GP", "country": "US", "title": "Hamilton hopeful of closing in on 3rd F1 title at Sochi GP", "performance_score": 0, "site": "greenfieldreporter.com", "participants_count": 0, "title_full": "Hamilton hopeful of closing in on 3rd F1 title at Sochi GP", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T17:21:00.000+03:00", "replies_count": 0, "uuid": "3c6c060ccc4c123018858c17b73d9d042aa2c004"}, "author": "", "url": "http://www.greenfieldreporter.com/view/story/4f61280a72084b049883557464f17361/CAR--F1-Russian-GP", "ord_in_thread": 0, "title": "Hamilton hopeful of closing in on 3rd F1 title at Sochi GP", "locations": ["Sochi"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hamilton", "Lewis Hamilton"], "text": "With a third F1 title in sight, Lewis Hamilton hoping to avoid slip-up at Sochi GP JAMES ELLINGWORTH Associated Press   10:20   10:21   \nPeople: \nEastern Europe (362) \n\nSOCHI, Russia — As he closes in on his third Formula One drivers' title, Lewis Hamilton is hopeful the conditions in Russia won't work against his Mercedes team. \nHamilton has a big lead in the standings and was dominant last year in Russia, beating teammate Nico Rosberg to first place in qualifying and the race. However, the Sochi circuit, which winds around venues from last year's Winter Olympics, may not favor Mercedes this time. \nIts design has similarities to Singapore, where neither Mercedes car made the podium last month, and the tires selected for the smooth, rarely-used asphalt are unlikely to help. \nBut that is \"all an assumption\" before the race weekend begins, Hamilton argues. \n\"I won't really know until tomorrow,\" the British driver said. \"I hope that's not the case. The engineers don't think it's going to be the case.\" \nMercedes' dominance has been such this season that the team can secure the constructors' title Sunday with four races still to go if Rosberg and Hamilton score three points more than Ferrari's Sebastian Vettel, the Singapore winner, and Kimi Raikkonen. \n\"It's very easy for a team to have success like last year and then drop the ball next year and get complacent,\" Hamilton said. \"This team has just continued to power through and keep pushing.\" \nUnlike last year's race in Russia, tire supplier Pirelli has brought two softer compounds this week, which Rosberg acknowledged may not suit Mercedes. \n\"The asphalt is very special here, it's quite different,\" Rosberg said. \"We did show weaknesses on the soft and super-soft (tires) in Singapore, big weaknesses. We have learned from that.\" \nHamilton's 48-point lead over Rosberg means the British driver could still secure a third championship title even if Rosberg wins all five of the remaining races this season. In that case, a mix of second- and third-place finishes would be enough for Hamilton. \nTwo-time champion Fernando Alonso marks his 250th career race in Sochi but it may not be a happy anniversary for the Spanish driver. The McLaren team's struggles with its Honda engine have meant just two top-10 finishes this season for Alonso, who publicly criticized the Honda engine over team radio during the last race in Japan. \n\"It's just the frustration of battling hard and being as competitive as possible when driving in a car in a race,\" he said Thursday. \"You try to give it all and you're fighting lap after lap and you keep losing positions easily on the straight before the braking point and you get some frustration out there in the radio.\" \nThere is one driver change as Spanish driver Roberto Merhi returns to the Manor team instead of American Alexander Rossi, who competed in the last two races but has commitments in the GP2 series this weekend. \nAll content copyright ©2015 Daily Reporter, a division of Home News Enterprises unless otherwise noted.", "external_links": [], "published": "2015-10-08T17:21:00.000+03:00", "crawled": "2015-10-08T17:25:56.125+03:00", "highlightTitle": ""}