{"organizations": [], "uuid": "a267d4f078d15c6e8bc699f21ed1b9bbc8f5be11", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thenewstribune.com", "main_image": "http://www.thenewstribune.com/static/images/thenewstribune/facebook.jpg", "site_section": "http://www.thenewstribune.com/sports/?widgetName=rssfeed&widgetContentId=712015&getXmlFeed=true", "section_title": "College & professional Sports news | TheNewsTribune.com &", "url": "http://www.thenewstribune.com/sports/soccer/mls/sounders-fc/article41421798.html", "country": "US", "title": "Sounders clinch playoff spot with 3-1 win against Real Salt Lake", "performance_score": 0, "site": "thenewstribune.com", "participants_count": 1, "title_full": "Sounders clinch playoff spot with 3-1 win against Real Salt Lake", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T06:01:00.000+02:00", "replies_count": 0, "uuid": "a267d4f078d15c6e8bc699f21ed1b9bbc8f5be11"}, "author": "Don Ruiz \nStaff writer", "url": "http://www.thenewstribune.com/sports/soccer/mls/sounders-fc/article41421798.html", "ord_in_thread": 0, "title": "Sounders clinch playoff spot with 3-1 win against Real Salt Lake", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sounders clinch playoff spot with 3-1 win against Real Salt Lake \nBy Don Ruiz Order Reprint of this Story SEATTLE \nOn another day, the suspense might have ended early. The Seattle Sounders bolted to a 2-0 lead in the first 10 minutes and a 3-0 advantage in the first 20, setting them on their way to a 3-1 win over Real Salt Lake. \nHowever, this was “Decision Day” in Major League Soccer, when all five Western Conference games played out simultaneously. Almost every goal from the other games changed the Sounders’ projected playoff seeding, their possible opponent, or whether they would host or travel. When the final whistle on the final pitch finally blew, Seattle landed in fourth place and paired with fifth-place Los Angeles in a single knockout match 7 p.m. Wednesday at CenturyLink Field. \n“We’re excited to be in the playoffs,” coach Sigi Schmid said. “As we talked about before the game, our moment has to be now. It didn’t matter to us if it was L.A. or if it was Portland or if it was Vancouver, we wanted to be at home. Now it’s L.A., so we want to take care of business on Wednesday and move forward. The only way we can win MLS Cup is to beat L.A.” \nNeeding a win to be sure of playing into the postseason, the Sounders (15-13-6) jumped ahead in the 5th minute with a Clint Dempsey goal assisted by Obafemi Martins, a Marco Pappa strike in the 10th minute assisted by Dempsey and another Dempsey score in the 20th minute on the rebound of a saved shot from Martins. \nIt was the first time the Sounders had scored two goals in the opening 10 minutes or three in the opening 20. Meanwhile, Dempsey became the third player in club history to score two goals in the first 20 minutes. \n“It was a game we needed to win,” Dempsey said. “We needed to go out and try to attack the game and try to take the game to them, and create chances and not wonder what’s going to happen in the 78th minute, 80th minute, trying to get a goal. We went off with the right mentality.” \nLuis Gil got the visitors’ lone goal in the 77th minute. RSL (11-15-8) arrived in Seattle already out of postseason contention, and played without injured No. 1 goalkeeper Nick Rimando and midfielder Kyle Beckerman due to yellow-card suspension. \nThe result clinched a seventh playoff appearance for the Sounders over their seven seasons in MLS. \n“It’s huge,” owner Adrian Hanauer said. “I think back to 2002, which was my first year, and I think we’ve missed one playoff since then. I did not want to miss for a second time. It’s great, given the (injuries and losing streak of) summer. It feels good, especially getting a home game.” \nSeattle’s regular season statistical leaders were Martins, 15 goals; Dempsey, 10 assists; and goalkeeper Stefan Frei with a club-record 111 saves. \nThe club’s supporters also set a record, as the match was played before a crowd of 55,435 at CenturyLink Field, pushing Seattle to an unprecedented MLS season attendance average of 44,245. \n“That’s our fans,” Hanauer said. “It just speaks to the relevance in this market of soccer of the Sounders. I still think there’s a lot of opportunity and growth ahead of us. … I really feel like we’re getting our feet under us and we’re going to be able to do great things next year as well.” \nTickets for the knockout match are on sale at SoundersFC.com. The game will be shown locally on JOEtv and heard on 97.3 FM. \n“We have L.A. here. That’s what everybody wants to see,” forward Chad Barrett said. “…We have won the Open Cup and the Supporters’ Shield last year. … Now we have to win this MLS Cup. That has to be part of this amazing story of the Seattle Sounders.” \nDon Ruiz: 253-597-8808", "external_links": [], "published": "2015-10-26T06:01:00.000+02:00", "crawled": "2015-10-26T06:21:14.973+02:00", "highlightTitle": ""}