{"organizations": [], "uuid": "bbb43310b41ea12161d50bb2aa78afee781ae02a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtontimes.com", "main_image": "http://media.washtimes.com.s3.amazonaws.com/media/image/2015/10/24/9cb40215cce3b42f850f6a706700e7b0.jpg", "site_section": "http://www.washingtontimes.com/rss/headlines/sports/", "section_title": "www.washingtontimes.com stories: Sports", "url": "http://www.washingtontimes.com/news/2015/oct/24/bbq-or-bagels-a-tasty-world-series-set-royals-meet/", "country": "US", "title": "BBQ or bagels? A tasty World Series set, Royals meet Mets", "performance_score": 0, "site": "washingtontimes.com", "participants_count": 1, "title_full": "BBQ or bagels? A tasty World Series set, Royals meet Mets", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T07:19:00.000+03:00", "replies_count": 0, "uuid": "bbb43310b41ea12161d50bb2aa78afee781ae02a"}, "author": "BEN WALKER", "url": "http://www.washingtontimes.com/news/2015/oct/24/bbq-or-bagels-a-tasty-world-series-set-royals-meet/", "ord_in_thread": 0, "title": "BBQ or bagels? A tasty World Series set, Royals meet Mets", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sports BBQ or bagels? A tasty World Series set, Royals meet Mets during the XX inning in Game 6 of baseball’s American League Championship Series on Friday, Oct. 23, 2015, in Kansas City, Mo. (AP Photo/Charlie Riedel) more > By BEN WALKER   12:19 a.m., Saturday, October 24, 2015 \nYoenis Cespedes launching long drives, Lorenzo Cain dashing to catch them. Noah Syndergaard zinging 100 mph heat, Alcides Escobar trying to catch up. \nThe pitching-rich New York Mets, boosted by Daniel Murphy’s power surge. The plucky Kansas City Royals, aiming to atone for last year’s near-miss. \nServed up with some BBQ and bagels, too. A tasty World Series, indeed. \nThe Royals set the matchup Friday night, beating Toronto 4-3 in Game 6 of AL Championship Series. The Mets were waiting, having swept the Cubs on Wednesday night in the NLCS. \nThey start Tuesday night in Kansas City. Already, they’ve made history - this is the first World Series between franchises born in the expansion-era 1960s. \nMaybe more on deck. \nCan Murphy, never a major home run threat with the Mets, extend his record by connecting in a seventh straight postseason game? How will Kendrys Morales, Escobar and KC’s contact hitters fare against Matt Harvey, Jacob deGrom and the fresh New York aces? When will closers Jeurys Familia and Wade Davis ever give up a run? \nPlus, the first World Series action at Citi Field when the scene shifts for Game 3. Then Game 4 on Halloween night, followed by Game 5 in November on the day of the New York City Marathon. \nPlenty of stars on both sides - David Wright and Curtis Granderson for New York; Alex Gordon, Eric Hosmer and Salvador Perez for Kansas City - who fans can follow into the future. \nIn fact, consider this a preview for the 2016 season. Yep, opening day in the majors next April 4 is Mets at Royals. \nThis much is certain: One team is about to end a long drought. \nThe Royals, who lost to San Francisco in Game 7 at Kauffman Stadium last October, haven’t won the crown since George Brett and Bret Saberhagen starred in 1985. The Mets’ most recent title came in 1986, led by Darryl Strawberry and Dwight Gooden. \nOver the years, the Royals and Mets did share some things. David Cone, Carlos Beltran and Saberhagen are among the guys who played for both teams. \nThe teams have met only nine times since interleague play began in 1997, with the Royals holding a 5-4 edge. The Mets haven’t even visited Kansas City since 2004. \nBut not much to link this current crop of Mets and Royals to each other. Other than a pair of clubs playing real sharp ball these days.", "external_links": [], "published": "2015-10-24T07:19:00.000+03:00", "crawled": "2015-10-24T07:56:11.979+03:00", "highlightTitle": ""}