{"organizations": [], "uuid": "247bbfce814c7ab88ea4cbe253b1c38567698215", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "cjonline.com", "main_image": "http://cjonline.com/sites/default/files/images/sms-default-facebook-share.png", "site_section": "http://cjonline.com/taxonomy/term/2/2/feed", "section_title": "Sports", "url": "http://cjonline.com/sports/2015-10-07/rested-royals-look-stop-astros-momentum", "country": "US", "title": "Rested Royals look to stop Astros' momentum", "performance_score": 0, "site": "cjonline.com", "participants_count": 1, "title_full": "Rested Royals look to stop Astros' momentum", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:03:00.000+03:00", "replies_count": 0, "uuid": "247bbfce814c7ab88ea4cbe253b1c38567698215"}, "author": "Jeff Deters", "url": "http://cjonline.com/sports/2015-10-07/rested-royals-look-stop-astros-momentum", "ord_in_thread": 0, "title": "Rested Royals look to stop Astros' momentum", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Rested Royals look to stop Astros' momentum KC fully aware of what wild-card winner can do Posted: October 7, 2015 - 7:03pm By Jeff Deters jeff.deters@cjonline.com \nKANSAS CITY, Mo. — It’s no secret that last year’s wild-card game against the Oakland A’s changed the Kansas City Royals franchise as a whole. \nThe Royals took that momentum and ran all the way to the World Series. They are now hoping to prevent the Houston Astros from doing the same thing. \nThe Royals will face the wild-card Astros in Game 1 of the American League Division Series at 6:37 p.m. Thursday at Kauffman Stadium. Kansas City’s Yordano Ventura (13-8, 4.08 ERA) will face Houston right-hander Collin McHugh (19-7, 3.89 ERA). \nThe Astros advanced to the ALDS by beating the New York Yankees on the road Tuesday. Last year, after the Royals beat the A’s, they swept the top-seeded Angels, then swept the Baltimore Orioles in the ALCS. \nLike the Royals a year ago, the Astros seem to be an ambitious bunch. Losers of 100 games two years ago, they led the AL West for a large chunk of the season until they were ultimately caught by the Texas Rangers after a September swoon. \n“That’s a good ballclub over there,” Royals third baseman Mike Moustakas said of the Astros after a workout Wednesday. “They do the little things well. It kind of reminds us of us last year, young, hungry and trying to get after it and trying to prove to everyone.” \nAfter having the AL Central title wrapped up seemingly for months, the only questions the Royals had for a while was whether or not they would capture home-field advantage. They lost that advantage briefly to the Blue Jays before winning five straight to close out the regular season to get it back. \n“I think it was good the last week to have some pressure to win home-field advantage,” Royals second baseman Ben Zobrist said, “because before that, the previous two or three weeks, it was really tough to be highly-motivated like a lot of these other teams were going down the stretch. So now that we’re in that situation, I’m glad that we had that pressure last week. We’re more prepared now.” \nThe Royals haven’t played since this past Sunday, which could give the Astros a slight edge, Zobrist said, noting that they should be in a rhythm when they take the field. But he believes the Royals still have plenty of advantages. \n“I think it was good for our team to get the rest that we’ve had the past few days,” Zobrist said. “They know that, and we know that.” \nThe Royals went 2-4 against the Astros in the regular season, getting swept in Houston and winning two of three in Kansas City. Those records, though, don’t really matter in October as they Royals proved last year that anything can happen. \n“This is fun,” Moustakas said. “That’s why you play 162 games is to get to this point and to get in this little tournament. We’re excited, but we’ve got to take care of some unfinished business. \n“You go out there with the anticipation that you’re going to make it to the postseason, and that’s why you show up to spring training, and that’s why you play 162 games. We had a great season, but now everything that happened is over with. We have to find a way to beat a good Astros team and advance to the next round.” \nJeff Deters can be reached at jeff.deters@cjonline.com .", "external_links": [], "published": "2015-10-08T03:03:00.000+03:00", "crawled": "2015-10-08T03:26:58.975+03:00", "highlightTitle": ""}