{"organizations": [], "uuid": "51592ffb382cb47678f741c442967f741060f274", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newsday.com", "main_image": "http://cdn.newsday.com/polopoly_fs/1.10939533.1444356956!/httpImage/image.JPG_gen/derivatives/display_2008/image.JPG", "site_section": "http://www.newsday.com/sports", "section_title": "NY Sports News - Newsday - Scores, Schedules, News &amp; Standings | Newsday", "url": "http://www.newsday.com/sports/high-school/volleyball/eastport-south-manor-makes-itself-at-home-in-class-a-with-win-over-northport-1.10939664", "country": "US", "title": "Eastport-South Manor makes itself at home in Class A with win over Northport", "performance_score": 0, "site": "newsday.com", "participants_count": 1, "title_full": "Eastport-South Manor makes itself at home in Class A with win over Northport | Newsday", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T05:51:00.000+03:00", "replies_count": 0, "uuid": "51592ffb382cb47678f741c442967f741060f274"}, "author": "SAL CACCIATORE", "url": "http://www.newsday.com/sports/high-school/volleyball/eastport-south-manor-makes-itself-at-home-in-class-a-with-win-over-northport-1.10939664", "ord_in_thread": 0, "title": "Eastport-South Manor makes itself at home in Class A with win over Northport", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Eastport-South Manor boys volleyball has made itself right at home in Class A.\nAfter winning the Class B Long Island championship last season, the Sharks moved up a division, and have established themselves as one of the teams to beat among the large schools.\nLatest HS sports stories Longwood hopes to remain unbeaten vs. Lindenhurst 'Grapple at the Garden' to take place Nov. 29 Gilligan, Peragine lead Northport over Sachem East Hirdt leads Miller Place in shutout win over East Hampton Lofgren's save preserves tie for Carle Place This success continued Thursday night, as Josh Undari had 19 assists, 10 digs and seven kills and Parker Bachisin had nine digs and nine assists to lead the Sharks over visiting Northport in straight sets in Suffolk I. Brennan Brandow had 16 digs and Kyle Allen-Morabito and Ryan Byrne added nine kills apiece, Tom Ogeka had eight kills and Quinn Foglia had seven kills for Eastport-South Manor, which won, 25-23, 25-15, 25-18, to improve to 8-1 in league play.\n\"We came in as underdogs. No one thought we were going to be as good as we are,\" Undari said. \"Now that we've come out and have only one loss, we've made a name for ourselves.\"\nThursday night's win was another match that showcased the Sharks' depth and versatility; coach Bruce Stiriz said a strength of his team is that opponents cannot key on one player to shut down his team.\nVolleyball Northport vs. Eastport-South Manor Another strength, the players said, was belief in each other. \"We all trust in each other a lot,\" Bachisin said. \"I'm going to trust that the passers are going to pass it to me and the hitters trust that I'm going to set it to them.\"\nThe hosts took control of the first set, jumping out to a 23-16 lead. Northport (6-4) did not go quietly, though, winning seven of the next eight points to cut the ESM lead to one.\nEastport-South Manor hung on to win the first set, and started the second on a 16-3 run and took it by 10 points.\n\"We just kept pushing and never held back,\" Allen-Morabito said.\nThe script was unchanged in the third set, as ESM again got separation early, taking a 13-5 lead to win the set by seven.\nDom DellaMarco had 22 assists and Nick Bitetto and Chris Parker both added seven kills for Northport.\nHigh School Sports on Facebook \"We just have to keep improving and show that we're here to stay,\" Allen-Morabito said of the Sharks' move to Class A. \"It's definitely a lot more fun now that we have a lot more to prove, and we're ready to show we can play with the big dogs.\"\nSubscribe to Newsday’s high school sports weekly newsletter for the latest stories, scores and photos about Long Island high school sports events.", "external_links": ["http://facebook.com/NewsdayHSSports"], "published": "2015-10-09T05:51:00.000+03:00", "crawled": "2015-10-09T08:26:52.202+03:00", "highlightTitle": ""}