{"organizations": [], "uuid": "b4ca4a66bd6628a4e54d63dcebab026d1383252b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deseretnews.com", "main_image": "http://img.deseretnews.com/images/article/hires/1608375/1608375.jpg", "site_section": "http://www.deseretnews.com/sports/index.rss", "section_title": "Sports news and headlines for the Utah Jazz, BYU Cougars, Utah Utes and high schools, Salt Lake City sports, Utah sports - Deseret News", "url": "http://www.deseretnews.com/article/865638509/Utah-football-notebook-Fake-punt-return-catching-on-elsewhere.html", "country": "US", "title": "Utah football notebook: Fake punt return catching on elsewhere", "performance_score": 0, "site": "deseretnews.com", "participants_count": 1, "title_full": "Utah football notebook: Fake punt return catching on elsewhere | Deseret News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "b4ca4a66bd6628a4e54d63dcebab026d1383252b"}, "author": "Dirk Facer", "url": "http://www.deseretnews.com/article/865638509/Utah-football-notebook-Fake-punt-return-catching-on-elsewhere.html", "ord_in_thread": 0, "title": "Utah football notebook: Fake punt return catching on elsewhere", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Utes' success at Oregon was used by others the following week.\nUpcoming Games Utah Football Utah football stats & schedule Cal @ Utah Rice-Eccles Stadium, Salt Lake City Oct. 10, 8:00 p.m. 2 Days 21 Hrs 46 Mins 49 Secs More Coverage Want drama? Storylines galore? Look at college QBs in state of Utah Utes back in the college football spotlight Utah Utes football: The California Golden Bears in 6 numbers Utes pleased with quality of Tuesday's practice Utes' special teams earn praise from Pac-12 coaches “ It may just be something that showed up for a couple of weeks and then disappears for another couple of years, I don’t know.”\nUtah coach Kyle Whittingham\nSALT LAKE CITY — Utah’s fake punt return at Oregon did more than produce a 69-yard touchdown by Boobie Hobbs. Teams like the Seattle Seahawks and Southern Utah Thunderbirds have since incorporated it.\n“It may just be something that showed up for a couple of weeks and then disappears for another couple of years, I don’t know,” said Whittingham, who explained that the Utes used it because it's difficult to defend when everything lines up and the kick is where you anticipate it.\nAs such, Whittingham is hopeful the Utes won’t be on the other side of it.\n“I hope no one does it to us because we have no answer for it,” he joked.\nWhittingham noted that players are taught to key the returner — as Oregon did with Britain Covey — and not the ball.\n“ People may have to change that mindset and find the football regardless of where they are on the field of play,” he said.\nWhittingham added that time will tell if it becomes more prevalent.\nUtah coaches first saw the fake punt return in an NFL game when the St. Louis Rams scored on one against the Seahawks.\n“I’d like to take credit for inventing it, but it was the St. Louis Rams,” Whittingham said. “Where they got it is a good question. I imagine you could trace it back several years.”\nBEAR-LY THERE: Utah senior safety Tevin Carter began his college football career as a redshirt at California in 2010. He then headed to junior college before signing with the Utes. Saturday’s game at Rice-Eccles Stadium will be his first against his old team. No grand reunion is in the works. The Bears’ roster has been revamped over the years.\n“I know of them but I don’t know them personally,” Carter said. “If I see somebody and I do know them, then I’ll say something to them. But other than that it’s business.”\nCarter added that he’s more happy at Utah than he was at Cal.\n“I’m just moving on from here pretty much,” he said.\nCATCHING ON: Whittingham praised the wide receivers for taking steps forward as the season has gone on. He said the position group played as well as they have in a long time in Utah’s 62-20 win at Oregon on Sept. 26.\nThe Utes caught 20 passes for 257 yards in the rout.\n“We’re being more consistent. So that’s a good thing,” said receivers coach Taylor Stubblefield . “With that consistency we’ll get the deeper throws. I’m not too concerned about it as long as we’re catching the ball. If we’re catching the ball we’re giving ourselves a chance for big plays.”\nBesides the catches, Stubblefield is pleased with the lack of mental errors by the receivers. He also likes their pre-snap and post-snap reads.\nEXTRA POINTS: Utah is 0-3 in homecoming games against Pac-12 foes since joining the conference in 2011, falling to Washington, Oregon State and Washington State ... Travis Wilson is tied with San Diego Chargers head coach Mike McCoy (1992-94) for the third-most career victories by a starting quarterback at Utah with 18 ... ESPN will broadcast shows from Presidents Circle on Friday from 10 a.m.-3 p.m.\nEmail: dirk@desnews.com\nTwitter: @DirkFacer", "external_links": ["http://deseretnews.sportsdirectinc.com/football/ncaaf-teams.aspx?page=/data/ncaaf/teams/team93.html"], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T07:13:07.063+03:00", "highlightTitle": ""}