{"organizations": [], "uuid": "b348ef7ccc54b731868ddac9273289fc4955fb03", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kctv5.com", "main_image": "", "site_section": "http://kctv5.com//category/208603/sports?clienttype=rss", "section_title": "KCTV Kansas City - Sports", "url": "http://www.kctv5.com/story/30342915/missouri-drops-slugfest-to-vanderbilt-10-3", "country": "US", "title": "Missouri drops slugfest to Vanderbilt, 10-3", "performance_score": 0, "site": "kctv5.com", "participants_count": 1, "title_full": "Missouri drops slugfest to Vanderbilt, 10-3 - KCTV5", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T01:55:00.000+03:00", "replies_count": 0, "uuid": "b348ef7ccc54b731868ddac9273289fc4955fb03"}, "author": "cbs8", "url": "http://www.kctv5.com/story/30342915/missouri-drops-slugfest-to-vanderbilt-10-3", "ord_in_thread": 0, "title": "Missouri drops slugfest to Vanderbilt, 10-3", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By CHIP CIRILLO\nAssociated Press NASHVILLE, Tenn. (AP) - Missouri's offensive woes continued in a loss to Vanderbilt on Saturday.\nVanderbilt held Missouri to 188 total yards and 10 first downs in route to a 10-3 win, handing the Tigers their third straight loss.\nIt was the fewest yards allowed by Vanderbilt against an SEC opponent since a 2006 loss to Mississippi.\n\"Disappointment, frustration, high anxiety - certainly we had a shot at the end,\" Missouri coach Gary Pinkel said. \"We get one throw in the end zone, a catch, and we would have gone into overtime. It's a lot of frustration. We've lost some close games, really the last three have been reasonably close except for the Florida game with an interception and the touchdown. But the bottom line is you gotta do it and we're not getting it done.\"\nVanderbilt coach Derek Mason earned his first Southeastern Conference win in 12 tries.\n\"Love it - I'll sleep well tonight,\" said Mason, who doubles as the Commodores' defensive coordinator. \"Some people may want to see higher scores and what it looks like, but let me tell you, two weeks from now it'll still be 10-3 and it'll still be in the win column. So let's go.\"\nOne stat in particular stood out for Mason - Missouri's 0 for 14 mark on third down conversions.\n\"0 for 14 on third downs - who would have thunk it? Really,\" said Mason, who was given the game ball by Vanderbilt athletics director David Williams. \"Just an unbelievable effort by those guys (on defense).\"\nThe Tigers' struggling offense fell to 3 for 41 on third down conversions during the last three games.\nDrew Lock's 18-yard pass to Russell Hansbrough gave Missouri a first down on the game's first play from scrimmage, but the Tigers didn't get their next one until late in the third quarter - a span of nearly 41 minutes.\n\"I think we've been playing pretty well this year, but that might be our best,\" linebacker Darreon Herring said of Vanderbilt's defensive showing. \"That's not the best we can be. We've still got five more games and everybody is going to see our defense roll back with this.\"\nVanderbilt's Ralph Webb rushed for 99 yards and scored the game's only touchdown.\nVanderbilt improved to 3-4 overall and 1-3 in the SEC. Missouri (4-4, 1-4) suffered its third straight loss.\nMissouri drove to the Vanderbilt 13-yard line late in the game before turning the ball over on downs with five seconds left.\nVanderbilt (38:24) nearly doubled Missouri's (21:36) time of possession.\nVanderbilt freshman Kyle Shurmur made his first career start in place of redshirt-sophomore Johnny McCrary, who has thrown 10 interceptions, the most in the SEC. He completed 10 of 20 for 89 yards before being relieved by McCrary.\nDrew Lock threw for 108 yards and Andrew Baggett kicked a 35-yard field goal for Missouri.\n\"I mean, we had a lot of open guys tonight and I just didn't hit them,\" Lock said. \"There were more disappointing plays on my part as far as my production on the field. The hits didn't affect me as much, I can't even remember when I got hit. I just couldn't produce tonight.\"\nWebb's 1-yard run on third-and-goal gave the Commodores a 7-0 lead with 4:44 left in the first half. His touchdown capped a 72-yard, 11-play drive.\nCharles Harris' backside sack of Shurmur and Sam Bailey's fumble recovery at the Vanderbilt 21-yard line with 2:06 left in the first half set up Missouri's first score.\nFour plays later, Baggett's 35-yard field goal cut the Commodores' lead to 7-3 with 49 seconds remaining in the half.\nMissouri missed a chance to narrow the gap to one when Baggett's 47-yard field goal attempt bounced off the left upright with 26 seconds left in the third quarter.\nMcCrary returned at quarterback late in the third quarter and Vanderbilt extended its lead to 10-3 on Tommy Openshaw's 40-yard field goal with 9:12 left.\nVanderbilt missed a chance to increase its lead to 13 when Openshaw's 32-yard field goal attempt bounced off the top of the right upright with 1:58 left.\nThe game started with a controversial play on the opening kickoff when Missouri's John Gibson fumbled after a hard hit by Vanderbilt's Khari Blasingame and the ball was recovered by the Commodores' Josh Smith at the Tigers 9-yard line.\nA replay appeared to show Gibson's knee wasn't down, but the officials ruled there was no fumble after a review, drawing boos from the crowd. Mason declined to comment on the call, but Vanderbilt linebacker Stephen Weatherly said the players were told Gibson's forward progress was stopped before the ball came loose.\nCopyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-25T01:55:00.000+03:00", "crawled": "2015-10-25T06:50:05.006+02:00", "highlightTitle": ""}