{"organizations": [], "uuid": "3b89a69e0043c31b41976242e73cd6861405fdc4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wcax.com", "main_image": "", "site_section": "http://www.wcax.com/category/13530/national-news", "section_title": "National News - WCAX.COM Local Vermont News, Weather and Sports-", "url": "http://www.wcax.com/story/30154129/artist-shot-killed-while-painting-anti-violence-mural", "country": "US", "title": "Artist shot, killed while painting anti-violence mural", "performance_score": 0, "site": "wcax.com", "participants_count": 1, "title_full": "Artist shot, killed while painting anti-violence mural - WCAX.COM Local Vermont News, Weather and Sports-", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "3b89a69e0043c31b41976242e73cd6861405fdc4"}, "author": "wcax.com", "url": "http://www.wcax.com/story/30154129/artist-shot-killed-while-painting-anti-violence-mural", "ord_in_thread": 0, "title": "Artist shot, killed while painting anti-violence mural", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "OAKLAND, Calif. (AP) - An artist was shot and killed in Oakland while he was helping to paint a street-side mural for a group that works to spread peace and stop violence, authorities said.\nPolice spokeswoman Johnna Watson said Wednesday officers were searching for the shooter as friends mourned Antonio Ramos, 27, during a vigil at the mural site.\nWatson said an argument led to the shooting Tuesday at the site under an Interstate 580 overpass in West Oakland.\nRamos was among about 10 artists who were working on project. He reportedly quarreled with a man who wasn't part of the group. It escalated, and the man shot Ramos and ran away, police said. No one else was injured.\nWatson declined to release further details about the crime while the investigation is ongoing.\nThe idyllic painting of trees, a creek and brightly colored Victorian houses contrasts sharply with the parts of West Oakland that are struggling to cope with drugs, poverty and violence.\nOakland has had 73 homicides this year, and many have happened on the western end of the city.\nOfficials say there is nothing to indicate the subject matter in the mural, called the Oakland Super Heroes Mural Project, sparked the violence.\n\"I think this is an isolated incident,\" said Aeeshah Clottey, one of the founders of Attitudinal Healing Connection of Oakland, a group that seeks to stop violence by inspiring people with art and education. The 25-year-old organization was sponsoring the mural project.\nClottey said Ramos started volunteering with the group in 2012 after being inspired by its work on a student-designed mural.\n\"He kept walking past it every day, and he finally asked if he could help out,\" Clottey said.\nRamos worked on that painting on San Pablo Avenue and was just starting to paint the current project.\n\"He was a very nice person,\" Clottey said. She referred further questions to his mother, who was not immediately available for comment Wednesday.\nClottey said the shooting is emblematic of a larger issue of violence around the world.\n\"This is indicative of a global problem,\" she said. \"And we want to look at ways to inspire peace.\"\n ", "external_links": [], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-10-02T23:16:03.249+03:00", "highlightTitle": ""}