{"organizations": [], "uuid": "1db0d148fd52f19e74fabdd42309b3fcb2d0b59e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.expressandstar.com", "main_image": "", "site_section": "http://www.expressandstar.com/sport/feed", "section_title": "Midlands Sport News - West Midlands Sport - Sports News Scores « Express & Star", "url": "http://www.expressandstar.com/sport/non-league/2015/10/24/khalsa-boss-sees-reality-on-cup-exit/", "country": "GB", "title": "Khalsa boss sees reality of cup exit", "performance_score": 0, "site": "expressandstar.com", "participants_count": 0, "title_full": "Khalsa boss sees reality of cup exit", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T18:45:00.000+03:00", "replies_count": 0, "uuid": "1db0d148fd52f19e74fabdd42309b3fcb2d0b59e"}, "author": "", "url": "http://www.expressandstar.com/sport/non-league/2015/10/24/khalsa-boss-sees-reality-on-cup-exit/", "ord_in_thread": 0, "title": "Khalsa boss sees reality of cup exit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Khalsa"], "text": "Tweet \nKhalsa were beaten 3-1 by National League North side FC United of Manchester, in front of a record crowd of 2,252 at the Aspray Arena. \nIt was a momentous occasion for Khalsa, who started off as a Sunday team nearly 25 years ago. \nDespite being three divisions below their opponents, they were competitive from the first minute to the last. \nCentre-back Tes Robinson filled the home crowd with hope in the second period, bringing the score back to 2-1. \nBut United were clinical in front of goal with Luke Ashworth and Greg Daniels scoring, before Chris Lindfield's strike in the dying minutes sealed their place in the first round proper. \nAlthough Khalsa's great run in the FA Cup came to an end, Rowe commended his players for giving their all in the game. \nHe said: \"They were great, they've took us on a journey and obviously we just come up a little bit short. \n\"FC United are all virtually full-time footballers and, from our point of view, we are step five. \n\"Fair play to them, they try to play the right way and have got a good set of lads, so I've got no complaints really. \n\"It's been great, in terms of putting the club on the map, but we've got beat so, from my point of view, I'm a little bit disappointed. \n\"Whether it is against FC United, or Manchester United, or whoever it is we've lost the game but the lads certainly didn't cave in. \n\"At 2-1, we had that 10 minute spell where it could have been a little bit different but I'll watch the replays - it ain't every week I say that - and see where we are with that \n\"We had to change the shape with about 10 minutes to go and we have just been caught on the break but, again, that's the level we are up against.\" \nFollowing their exit from the cup, Khalsa now turn their attentions back to the Midland Premier ahead of the home clash with Bolehall Swifts on Tuesday night. \nAfter a fantastic show of support against FC United, Rowe hopes people will continue follow his team throughout their league campaign. More on this story:", "external_links": [], "published": "2015-10-24T18:45:00.000+03:00", "crawled": "2015-10-25T02:51:56.587+02:00", "highlightTitle": ""}