{"organizations": [], "uuid": "b1cd18a31f46c7aa9869bfe0da93d9e80cbd93f2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.al.com", "main_image": "http://imgick.al.com/home/bama-media/width620/img/sports_impact/photo/19006360-standard.jpg", "site_section": "http://impact.al.com/sports/atom.xml", "section_title": "Sports", "url": "http://www.al.com/sports/index.ssf/2015/10/south_alabama_focused_on_finis.html", "country": "US", "title": "South Alabama focused on finishing headed into road game at Texas State", "performance_score": 0, "site": "al.com", "participants_count": 1, "title_full": "South Alabama focused on finishing headed into road game at Texas State | AL.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T07:03:00.000+03:00", "replies_count": 0, "uuid": "b1cd18a31f46c7aa9869bfe0da93d9e80cbd93f2"}, "author": "Creg Stephenson | cstephenson@al.com", "url": "http://www.al.com/sports/index.ssf/2015/10/south_alabama_focused_on_finis.html", "ord_in_thread": 0, "title": "South Alabama focused on finishing headed into road game at Texas State", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "South Alabama had two extra practices to prepare for Saturday's road game at Texas State, but that also meant two more days to dwell on a devastating loss in the Jaguars' last game.\nSouth Alabama lost 49-31 at home to Arkansas State, a game the Jaguars led 31-20 with less than 14 minutes to play. The Jags returned to practice on Saturday, with the focus on completing what they started this time around.\n\"It was definitely frustrating the day after, but we realized that we've got to play South Alabama football for four quarters, coming off that game we lost late,\" center Joseph Scelfo said. \"As an offense, we've got to produce more for a whole game, and not just for a quarter or two. We have to play all four quarters.\n\"We've got to put that behind us. We played hard, but we've just got to come out with a win — put that much more work into it during the week.\"\nSaid linebacker Kalen Jackson, \"From a defensive standpoint, we're going to have to focus in. Just focus, that's the main part of the job. Just know we're never out of a game, and a game is never won too early. Just finish every game.\"\nAt 3-3 overall and 1-1 in Sun Belt Conference play, South Alabama is still in the mix for the conference titles and a bowl berth. That quest continues Saturday in San Marcos, Texas, with a 6 p.m. kickoff against Texas State (1-4, 0-1).\nThe Bobcats are of course coached by former Alabama coach Dennis Franchione. Texas State has faced unbeaten Florida State and Houston this season, and thus their record is deceiving, Jaguars coach Joey Jones said.\n\"The thought that Texas State being 1-4, that we're just going to go out there and somehow show up and win, is ridiculous,\" Jones said. \"They've had a tough schedule and a tough road, and they've played some good teams. .... I know Dennis Franchione very well. He's a great competitor. He's going to have his team. So we're looking forward to a great ball game.\"\nPrior to the Arkansas State loss, South Alabama was able to close out road victories over San Diego State and Troy. Thus, Jones said he didn't have to do any extra motivating when the Jaguars returned to the practice field.\n\"It hurts. Any competitor is going to hurt when you lose,\" Jones said. \"We're not re-inventing the wheel on how to win a ball game. We've done it all year long. Did we make some mistakes the other night? Yes. So I try to put it in perspective for them. When you go through a season, there's going to be times you make mistakes and lose a ball game. We saw that this weekend with all the games around the country. Do I like it? Heck no. But our guys know how to win. Good teams do that.\"\nFrom an injury standpoint, Jones said the Jaguars will get back one of the two key players who were hurt against Arkansas State. Running back Xavier Johnson returned to practice Sunday after suffering a bruised heel last Tuesday.\nOffensive guard Cameron Blankenship is out at least one more week after undergoing arthroscopic knee surgery. Blankenship could return for the Oct. 31 home game against Idaho, Jones said.", "external_links": [], "published": "2015-10-20T07:03:00.000+03:00", "crawled": "2015-10-20T07:34:41.771+03:00", "highlightTitle": ""}