{"organizations": [], "uuid": "7f05432a6194c72163c19ec96646e0076370f880", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www2.ljworld.com", "main_image": "http://worldonline.media.clients.ellingtoncms.com/img/croppedphotos/2015/10/17/TTWisecrop_t800.jpg?90232451fbcadccc64a17de7521d859a8f88077d", "site_section": "http://www2.ljworld.com/rss/headlines/sports/", "section_title": "LJWorld.com stories: Sports", "url": "http://www2.ljworld.com/news/2015/oct/17/different-feel-jayhawks-competitive-loss-texas-tec/", "country": "US", "title": "Different feel: Jayhawks competitive in loss to Texas Tech", "performance_score": 0, "site": "ljworld.com", "participants_count": 1, "title_full": "Different feel: Jayhawks competitive in loss to Texas Tech", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T01:35:00.000+03:00", "replies_count": 0, "uuid": "7f05432a6194c72163c19ec96646e0076370f880"}, "author": "Matt Tait", "url": "http://www2.ljworld.com/news/2015/oct/17/different-feel-jayhawks-competitive-loss-texas-tec/", "ord_in_thread": 0, "title": "Different feel: Jayhawks competitive in loss to Texas Tech", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Matt Tait — Lawrence Journal-World October 17, 2015 \nAdvertisement \nSaturday, on a gorgeous and sunny fall afternoon, Kansas University football coach David Beaty peered through his adidas sunglasses and saw something that was much easier on the eyes than what he had seen throughout most of his first season in charge of the Jayhawks. \n“Hey, man, six weeks ago, sometimes it didn't even look like football,” said Beaty following his team's 30-20 loss to Texas Tech in front of a crowd of 25,186 at Memorial Stadium. “But we just stayed the course and continued to believe in what we were doing. It doesn't look exactly like we want it, but we're getting better every day.” \nFor the first time this season, that message of 24-hour improvement actually seemed to carry some weight. Sure, the Jayhawks (0-6 overall, 0-3 Big 12) lost for the 45th time in their past 48 Big 12 Conference match-ups, but this one did not look like most of the others. It featured an offense that moved the football at will and played with confidence. It featured a defense that played with life and fire. And it featured a group of players who seemed to truly believe they belonged. \n“This one felt different,” said sophomore linebacker Joe Dineen Jr., who led Kansas with 10 tackles and added a sack. “And I think it showed.” Photo Gallery KU football v. Texas Tech Images from Saturday's game between the Jayhawks and Red Raiders in Lawrence \nThumbnails · Gallery \nUnfortunately for KU, however, Saturday's loss also featured many of the things that have made losing the norm for this program during the past six seasons. \nA winnable game became a nearly impossible feat thanks to the Jayhawks' inability to stay away from mistakes. \nBeaty's squad missed four kicks — three field goals and an extra point — turned it over three times and struggled to a 20-0 first-half deficit before turning things around and operating as the better team on both offense and defense throughout significant portions of the second half. Press Conferences & Post-Game Interviews Postgame: David Beaty proud of Jayhawks after home loss to Texas Tech \nFirst-year Kansas football coach David Beaty explains why he was proud of how the Jayhawks played in a 30-20 home loss to Texas Tech. \nSo dramatic was Saturday's reversal of fortune that the Jayhawks actually took possession at their own 7 yard line with 4:47 to play with a chance to drive the length of the field for a potential game-winning touchdown. \nThe way things had gone on the two previous drives, with freshman QB Ryan Willis leading back-to-back touchdown drives to pull Kansas within 23-20, such a finish improbably seemed possible. \nBut after an incomplete pass on first down and a sack and fumble in the end zone on second down, Willis was intercepted by Tech's Jah'Shawn Johnson, who stepped in front of a pass intended for freshman Jeremiah Booker (65 yards on 7 receptions) and returned it 27 yards for a touchdown that put the game out of reach. Related document \nBox score: Texas Tech 30, Kansas 20 ( .PDF ) \nThe TD ended a Texas Tech scoreless stretch of more than 12 minutes, and left the Jayhawks lamenting their poor special teams play. \n“It sucks when you lose by 10 and you leave 10 points on the field,” said junior kicker Matthew Wyman, who missed a 52-yard field goal in the first quarter and a 34-yarder just before halftime. “Obviously, that's not a good feeling, but we'll bounce back. We work hard.” \nDespite KU's shortcomings in the point-scoring department on Saturday, the defense delivered by far its best game of the season. The Jayhawks' front six created pressure on a regular basis, which forced TTU quarterback Patrick Mahomes into several bad throws and led to five sacks — Tech had given up just two sacks in six games coming into Saturday — and held the Texas Tech offense to just three points in the game's final 31 minutes. \nThis, from a team that entered Saturday averaging nearly 60 points per game and boasting the nation's top-ranked passing offense. \n“Let me tell you something,” Beaty said. “I know how hard that stuff is to stop. I really do. And, man, I am so proud of those boys.... Our guys played their tails off. They just kept playing.” \nDineen said the major difference between Saturday's effort and the five that came before it actually showed up during film study of last week's 66-7 loss to high-powered Baylor. A breakdown in several small areas, Dineen said, allowed the Bears to run wild and the Jayhawks vowed to not make life as easy for Texas Tech (5-2, 2-2) on Saturday. \nThe Red Raiders gained 584 yards of offense on 94 plays — 359 passing, 225 rushing — and recorded big chunks of yardage during both halves. But very little of it looked easy and the Kansas “D” stiffened the more precarious the situations became. \n“I thought our defense played great,” Dineen said. “We feel like we can compete with anybody.” \nThat, Beaty said, was the biggest takeaway from Saturday's setback. Yeah, looking back at the mistakes will sting and, sure, it was nice to see freshman quarterback Ryan Willis (35-of-50 passing for 330 yards and 2 TDs) finish two completions shy of a single-game school record, but neither the good nor the bad of the individual moment meant as much as what Saturday meant for the big picture. \n“They knew they could win,” Beaty said. “They played like it. They believed in it. The morning meeting this morning was different. And I liked it. There was some intensity from coaches and players today, and they weren't afraid of anything.” \nAdded Dineen: “When you get beat 66-7 the week before, that one hurts. There's no moral victories. You want to win every game. But the way we played today was promising for the future.... I think it's gonna be good. I think we're gonna turn it around and we'll give the fans and people of Lawrence something to be proud of.” \n— See what people were saying about the game during KUsports.com's live blog . More news and notes from Kansas vs. Texas Tech", "external_links": [], "published": "2015-10-18T01:35:00.000+03:00", "crawled": "2015-10-18T06:19:29.316+03:00", "highlightTitle": ""}