{"organizations": [], "uuid": "78eb733f5540516711d7c24c1f90aa841c02a404", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kirotv.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/11/fc/0b/leann1.jpg", "site_section": "http://www.kirotv.com/", "section_title": "Seattle News, Weather, Traffic, Video and Sports | KIRO 7... | www.kirotv.com", "url": "http://www.kirotv.com/news/news/local-man-searches-half-brother-over-social-media-/nnzdx/", "country": "US", "title": "Local man searches for half-brother over social media, as...", "performance_score": 0, "site": "kirotv.com", "participants_count": 1, "title_full": "Local man searches for half-brother over social media, as... | www.kirotv.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T21:47:00.000+03:00", "replies_count": 0, "uuid": "78eb733f5540516711d7c24c1f90aa841c02a404"}, "author": "kirotv.com", "url": "http://www.kirotv.com/news/news/local-man-searches-half-brother-over-social-media-/nnzdx/", "ord_in_thread": 0, "title": "Local man searches for half-brother over social media, as...", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "An area man desperately searching for his long-lost half-brother has turned to social media as their mother’s health deteriorates.\nMore than 1,600 people shared or liked the post on KIRO 7’s Facebook page related to this story.\nPlease Share>> Leann asked us to help her father find his brother by sharing this photo. Their mother had to give him up...\nPosted by KIRO 7 News on Thursday, October 8, 2015 William McCombs was 18 years old when a family secret was finally revealed.\n\"That was on my grandfather's dresser,\" said McCombs, looking at an old picture of his mother on his Facebook page. “[My grandfather] said, ‘That was the proudest day of my life, the day your mother graduated.’ I never had a clue what he meant til mom told me,\" McCombs said.\nMcCombs’ mother told him when she was 16 years old she gave birth to a boy, his half-brother, at Doctor's Hospital in Seattle: now, Swedish Hospital.\n\"It floored me. I had no idea,\" said McCombs.\nWhen the baby was born on Aug. 1, 1958, McCombs’ grandparents forced his mom to sign papers for a closed adoption.\n“Mom's been looking for him since he was taken from her,\" he said.\nAnd for 35 years, McCombs has been searching for his brother as well.\nHe knows his brother was adopted, but no one will provide information on his brother’s whereabouts, saying it is his brother who has to seek them out.\n\"It's like losing one of your limbs, you got to try and find it. I mean, he's family,” said McCombs.\nWith his 74-year-old mother's health failing, McCombs’ daughter, Leann Strong, turned to social media with the little details they have on the man, who is now 57 years old.\n\"Maybe he's out there. Maybe he's on Facebook. Maybe his daughter is on Facebook doing the same thing I'm doing,\" said Strong.\n“What's he like? What's he do? What interests does he have? Does he look like me? … My brother Marty told me one time, [he] was in this restaurant, he said, ‘This guy sitting two tables over he looked so much like you,’ he said. ‘It was scary.’\"\nFor now McCombs and his daughter wait, hoping their online plea is heard and their family is made whole.", "external_links": ["https://www.facebook.com/KIRO7Seattle/posts/1083081391711613", "http://w.sharethis.com/button/buttons.js", "https://www.facebook.com/KIRO7Seattle"], "published": "2015-10-11T21:47:00.000+03:00", "crawled": "2015-10-12T01:18:00.684+03:00", "highlightTitle": ""}