{"organizations": [], "uuid": "a077c7b989c790e95afc71716c9e6e40803887fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.emporiagazette.com", "main_image": "http://bloximages.newyork1.vip.townnews.com/emporiagazette.com/content/tncms/assets/v3/editorial/1/47/1474e271-816f-5fef-b78d-b2af0627f383/560f85ab00b12.image.jpg?resize=760%2C593", "site_section": "http://www.emporiagazette.com//search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&nsa=eedition&c[]=sports,sports/*&f=rss", "section_title": "Emporia Gazette - sports,sports/", "url": "http://www.emporiagazette.com/sports/article_16830609-94c5-5f0b-8590-defe0c3207a5.html", "country": "US", "title": "ESU soccer blanks Northeastern State", "performance_score": 0, "site": "emporiagazette.com", "participants_count": 1, "title_full": "ESU soccer blanks Northeastern State", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T10:30:00.000+03:00", "replies_count": 0, "uuid": "a077c7b989c790e95afc71716c9e6e40803887fe"}, "author": "Corbin McGuire corbin@emporia.com", "url": "http://www.emporiagazette.com/sports/article_16830609-94c5-5f0b-8590-defe0c3207a5.html", "ord_in_thread": 0, "title": "ESU soccer blanks Northeastern State", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ESU soccer blanks Northeastern State Hornet volleyball sweeps Missouri Southern \nEmporia State's Jaide Allenbrand battles for the ball against Northeastern State University on Friday. Kendra Johnson \nShelby Keyes gets ready to kick the ball downfield on Friday. Kendra Johnson \nEmporia State's Sandrine Beaud battles for the ball on Friday. Kendra Johnson \nMaria Walden heads the ball against Northeastern State University on Friday. Kendra Johnson \nAmelie Heun kicks the ball downfield against Northeastern State University on Friday. Posted: Saturday, October 3, 2015 2:30 am | Updated: 2:41 am, Sat Oct 3, 2015. ESU soccer blanks Northeastern State By Corbin McGuire corbin@emporia.com emporiagazette.com | 0 comments \nThe Emporia State women’s soccer team secured a victory in its MIAA home opener Friday night, beating Northeastern State 2-0 at the Emporia High field. \n“When we’re on we can play with anybody. Our defense was great today. Our onside backs stepped up huge,” ESU head coach Bryan Sailer said. “Our first half was great, one of the best halves we’ve played all year.” \nAlly Taylor scored her first goal of the season, belting a shot from the right side into the left corner to break up a tie in the 38th minute. \nLate in the game, Amelie Heun continued her breakout season with a goal off a rebound to extend the Hornets’ lead to the game’s final score. Heun’s goal was unlike any other she’s had this season, as she kicked it in over her head with her back facing the goal. \n“I don’t know what it was. I didn’t see the goal,” said Heun, now with nine goals on the year. “I just tried it and it worked and I’m happy about that.” \nEmporia recorded 18 shots while putting eight on goal en route to improving to 6-3 on the year and 2-1 in MIAA play. \n“We were energetic and we had fun when we were playing,” Heun said. “It was awesome.” \nThe Hornets return to their home field on the north side of campus Sunday for a match against Central Oklahoma at 2 p.m. \nESU VB sweeps at Missouri Southern \nThe Emporia State volleyball team cruised to a three-set sweep at Missouri Southern Friday night, winning 25-19, 25-20 and 25-13. \nThe Hornets were led by a barrage of efficient hitters. Shayla Cotman notched a team-high 12 kills on a .500 hitting percentage, while Josie Williams recorded 10 kills on a .714 percentage. Danika Burton wasn’t far behind with eight kills on a .615 hitting rate. \nSydney Hartman led ESU with 22 assists, with Kimberly Bell adding 21. Kelly Holden’s 10 digs led the Hornets in the back row.", "external_links": [], "published": "2015-10-03T10:30:00.000+03:00", "crawled": "2015-10-03T12:57:53.331+03:00", "highlightTitle": ""}