{"organizations": ["Wake Forest", "Wake Forest as Wake Forest", "AP Photo/Nell Redmond", "NCAA", "Florida State"], "uuid": "62722d7c38e2027bf5ee1d4c582e82f07d788fe5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wpxi.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/03/57/d7/22ec9d67d2c646c99ec56d99235a6d27-96fb3785bc11449092480bc535b2e787-0.jpg", "site_section": "http://www.wpxi.com/feeds/categories/sports/", "section_title": "News | Sports", "url": "http://www.wpxi.com/ap/ap/top-news/no-11-florida-state-hangs-on-to-beat-wake-24-16/nntP7/", "country": "US", "title": "No. 11 Florida State hangs on to beat Wake 24-16", "performance_score": 0, "site": "wpxi.com", "participants_count": 0, "title_full": "No. 11 Florida State hangs on to beat Wake 24-16", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T02:14:00.000+03:00", "replies_count": 0, "uuid": "62722d7c38e2027bf5ee1d4c582e82f07d788fe5"}, "author": "", "url": "http://www.wpxi.com/ap/ap/top-news/no-11-florida-state-hangs-on-to-beat-wake-24-16/nntP7/", "ord_in_thread": 0, "title": "No. 11 Florida State hangs on to beat Wake 24-16", "locations": ["Winston-Salem", "N.C.", "Florida State", "Florida"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Devin Gaudin", "Johnathan Vickers", "Kendall Hinton", "Travis Rudolph", "Deonte Davis", "Cameron Glenn"], "text": "Updated: 7:14 p.m. Saturday, Oct. 3, 2015 | Posted: 7:14 p.m. Saturday, Oct. 3, 2015 No. 11 Florida State hangs on to beat Wake 24-16 Related View Larger Florida State running back Johnathan Vickers dives into the end zone to score a touchdown against Wake Forest as Wake Forest defensive back Deonte Davis, right, defends in the first half of an NCAA college football game in Winston-Salem, N.C., Saturday, Oct. 3, 2015. (AP Photo/Nell Redmond) View Larger Florida State wide receiver Travis Rudolph (15) breaks free from Wake Forest defenders Cameron Glenn (2) and Devin Gaudin after a catch in the first half of an NCAA college football game in Winston-Salem, N.C., Saturday, Oct. 3, 2015. (AP Photo/Nell Redmond) Wake Forest quarterback Kendall Hinton tries to break a tackle as he carries the ball against Florida State in the first half of an NCAA college football game in Winston-Salem, N.C., Saturday, Oct. 3, 2015. (AP Photo/Nell Redmond) Sponsored Links The Associated Press WINSTON-SALEM, N.C. — \nDalvin Cook had a 94-yard touchdown run before leaving with a left leg injury, and No. 11 Florida State held on to beat Wake Forest 24-16 on Saturday. \nJohnathan Vickers added a 9-yard touchdown run and Everett Golson was 20 of 31 for 202 yards with a 5-yard TD to Kermit Whitfield. \nRoberto Aguayo added a 25-yard field goal for the Seminoles (4-0, 2-0 Atlantic Coast Conference). \nFreshman Kendall Hinton was 27 of 42 for 215 yards against the nation's No. 4 pass defense with a 7-yard touchdown pass to Cam Serigne. \nMike Weaver kicked three field goals for the Demon Deacons (2-3, 0-2), including a 29-yarder with 3:34 left that pulled them within eight. \nWake Forest got the ball back with 1:42 left and reached the Florida State 20 before Hinton overthrew Serigne in the end zone and a diving Tyler Hunter intercepted it with 21 seconds left. \nThat finally sealed it for Florida State, a 20-point favorite that had won the last three meetings in the series by an average of 49 points, allowing the Demon Deacons two field goals during the past three years. \nIt seemed like Florida State was about to pull away when Golson found Whitfield for a short scoring pass on the Seminoles' first series of the second half, and Aguayo followed with his kick that put Florida State up 24-10 midway through the third. \nBut the sloppy Seminoles struggled to put away pesky Wake Forest, finishing with 10 penalties for 100 yards and gaining just 213 total yards in the three-plus quarters after Cook was hurt. \nHe appeared to tweak his hamstring while pulling in a seemingly innocuous 8-yard pass from Golson late in the first quarter. \nHe clutched the back of his leg on his way off the field and had it stretched on a trainer's table, but didn't return and spent the second half on the sideline in sweats. \nStill, Cook — who leads the ACC and ranks fourth nationally with an average of 158.7 yards — finished as Florida State's leading rusher with 94 yards. The Seminoles gained just 33 yards rushing after he was hurt. \nThe entirety of his rushing total came on that long run — the third-longest in Florida State history. \nHe took a handoff up the middle, shed hits by two defenders and didn't come close to being touched again on his way to the end zone. \n___ \nFollow Joedy McCreary on Twitter at http://twitter.com/joedyap \n___ \nAP college football website: collegefootball.ap.org Copyright The Associated Press Sign up for our WPXI-TV Daily Headlines Newsletter Sign Up", "external_links": [], "published": "2015-10-04T02:14:00.000+03:00", "crawled": "2015-10-04T02:47:39.570+03:00", "highlightTitle": ""}