{"organizations": [], "uuid": "f1a88567cff7c672c6b829b1a0fd391996035928", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/4d458d179d7b8d2b319c2b7478a2c1ba", "site_section": "http://www.news.com.au/sport/more-sports", "section_title": "More Sports | More Sports | Sports News and Results | News.com.au", "url": "http://www.news.com.au/sport/more-sports/curse-of-the-billy-goat-to-blame-for-chicago-cubs-107-year-losing-streak/story-fndukor0-1227572555437", "country": "AU", "title": "MLB: Chicago Cubs curse almost broken writes Richard Hinds", "performance_score": 0, "site": "news.com.au", "participants_count": 1, "title_full": "MLB: Chicago Cubs curse almost broken writes Richard Hinds", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T06:45:00.000+03:00", "replies_count": 0, "uuid": "f1a88567cff7c672c6b829b1a0fd391996035928"}, "author": "RICHARD HINDS", "url": "http://www.news.com.au/sport/more-sports/curse-of-the-billy-goat-to-blame-for-chicago-cubs-107-year-losing-streak/story-fndukor0-1227572555437", "ord_in_thread": 0, "title": "MLB: Chicago Cubs curse almost broken writes Richard Hinds", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "RICHARD HINDS The Daily Telegraph Even if you believe baseball is what Americans do in summer because they lack the patience and intelligence to appreciate (Test) cricket, you have to admire their deep emotional investment in the game.\nAn attachment bordering on obsession is required to agonise over the accumulated minutia of a 162 game season. But things nudge toward the outskirts of insanity when baseball fans attempt to justify the statistically likely, yet still miserable failure of their team to win the World Series in a fiercely competitive 30 team league.\nFor example, upon adopting the Boston Red Sox many years ago I immediately took for granted the club’s excruciating misfortune leading back to their last World Series win in 1918 was the result of the decision to trade an overweight pitcher named George Herman ‘’Babe’’ Ruth to the despised New York Yankees.\nThe Chicago Cubs are on the verge of breaking a 107 year losing streak Source: Getty Images\nThe Curse of the Bambino was finally lifted in 2004. But not before it had destroyed promising coaching and playing careers, tortured generations of fans and, in the case of Red Sox first baseman Bill Buckner, made an admirable athlete a byword for failure because he made a crucial error at a vital moment in game six of the 1986 World Series.\nDespite all that misery following the Red Sox brought a certain masochistic pleasure. Remaining faithful to a team that teases, tantalises, yet seems doomed – even cursed - provides a sense of spiritual purity. Catholicism without the early alarm on Sunday.\nEnter the Chicago Cubs whose last World Series victory in 1908 has been followed by more than a century of the type of gut-wrenching futility that makes the Cronulla Sharks seem like Real Madrid.\nPoor administration? Disastrous coaching? Awful recruiting? No, the Cubs failure comes down to a goat. Specifically the goat of Billy Sianis, owner of the Billy Goat Tavern, who was kicked out of the Cubs’ Wrigley Field in 1945 because his mascot’s smell offended other fans.\nThere are various versions of the ‘’Curse of the Billy Goat’’. But the agreed storyline is that, infuriated by his goat’s eviction, Sianis declared the Cubs would never win another World Series and this is the single most important reason why the historic franchise has been an abject failure ever since.\nWhich leads us, naturally, to another bar in Chicago last week where a group of Cubs fans ate a goat - entrails and all. Just the latest of many attempt to reverse the curse including trying to take goats into rival team’s ball parks and the placement of severed goats heads on local memorials.\nThis October, however, the billy goat doesn’t seem so gruff. The Cubs won a sudden death wild-card play-off game against the Pittsburgh Pirates, then the divisional series against the Cardinals. Should they beat the New York Mets in the National League championship series, the Cubs will reach the World Series for the first time since 1945 when the curse was imposed.\nSo suddenly everyone from Pearl Jam front-man and Cubs fan Eddie Vedder to The Late Show host Stephen Colbert, who lived in Chicago for 11 years, are talking goats and, naturally, Back To The Future Part 2. Because a scene in that movie showed the Cubs winning the 2015 World Series. Never mind that in 1989 when the movie was made Marty McFly’s time travel seemed less farfetched than the Cubs catching a fly ball in October.\nWill 2015 be the year the ‘Curse of the Billy Goat’ is broken for the Cubs? Source: AFP\nBut add the fact the Cubs’ 107 year losing streak is the longest by a professional team to the mixture of superstition/coincidence and Chicago’s quest is intoxicating for baseball fans who betray a level of collective obsession that even famously devoted Australian sports fans struggle to match.\nWe have known sporting curses or at least failures that seemed to be explained by more than coincidence and poor fortune. AFL giant Collingwood buried the Colliwobbles – quite literally in a coffin at their former home Victoria Park – in 1990 after winning their first premiership in 32 years marked by seven grand final defeats.\nFor 68 years Queensland seemed destined never to win the Sheffield Shield until breaking through in 1994/95. The Sydney Kings were the Violet Crumbles before winning three consecutive titles from 2003. Destiny seemed against the North Queensland Cowboys – even when Johnathan Thurston’s hit the upright in regular time of this year’s grand final.\nMostly, however, we reason the repeated failure of teams to win titles is due to the compounding expectation and heightened pressure that each defeat creates. We laugh about the porch light being left on for Harold Holt. But we don’t really believe the Sharks’ empty trophy case is due to Jack Gibson’s dark mutterings.\nBut the Cubs? Try telling their fans the fortunes of an ultra-professional, multi-million franchise with one of the game’s most astute managers is not at the whim of a disgruntled goat.\nSBS TREATMENT OF A-LEAGUE WELL BELOW PAR\nPopular Fox Sport’s show Sam, Santo and Ed hasn’t been renewed for the current A-League season Source: Supplied\nSBS did so much for Australian football. ‘’Soccer Bloody Soccer’’ helped make the ‘’world game’’ our game too.\nBut you could also suggest football did much for SBS by giving it what became a mainstream focus at a time when it was compelled to find a wider audience to justify funding.\nSo SBS’s mistreatment of the A-League’s Friday night fixtures this year is sad, even contemptible. Having been banished to the SBS 2 and without HD coverage, the A-League seems like the spouse in a loveless marriage sleeping on the couch.\nThis is no reflection on SBS’s football staff. But the fact management can’t get the A-League off the network fast enough has not gone unnoticed by fans and is an obvious impediment for the league’s promotion, growth and attempts to boost the price of future rights negotiations.\nThere remains some chance Saturday night games, likely to be sold to a commercial network in the next round of rights negotiation, could be transferred to another more enthusiastic station this season. Ten is a likely suitor.\nMeanwhile Fox Sport’s coverage of the A-League this season has been strong with one exception. Unfortunately the inability to renew the panel show ‘Santo, Sam and Ed’ has brought an end, at least for now, to the funniest sports show of any kind on Australian television.\nThat’s a real pity. Until the industrial problems are solved and TV rights negotiations provide a much needed cash injection, Australian football could use a laugh.\nSTUBBORN SYDNEY CLUBS WANT ALLIANZ MAINTAINED\nSydney clubs want Allianz Stadium maintained until the new stadium is completed Source: News Corp Australia\nTHE misgivings of Allianz Stadium tenants including Sydney FC and Sydney Roosters about potential relocation when the stadium is rebuilt is understandable given they inhabit a voracious sports market.\nBut to suggest that the rebuild should be dependent on maintaining the old stadium until the new one is built nearby is yet another indication of the myopic attitude that has left Sydney lagging behind every mainland capital in sports infrastructure.\nThis is a once-in-a-generation chance to give NRL, A-League and Super Rugby fans the stadium they deserve. Surely the clubs can tolerate a couple of inconvenient seasons to ensure the best possible outcome.\n Billy Goat the cause of Cubs’ curse", "external_links": ["http://cdn.newsapi.com.au/image/v1/20b2884995979ca3f8511b4a6a339462", "http://cdn.newsapi.com.au/image/v1/4d458d179d7b8d2b319c2b7478a2c1ba", "http://cdn.newsapi.com.au/image/v1/ac73481418039a82dc13a91a90fd79f4", "http://cdn.newsapi.com.au/image/v1/origin:fatwire.", "http://cdn.newsapi.com.au/image/v1/3dacd7a122038588dc0de860f3592adb", "http://www.couriermail.com.au/sport/more-sports/curse-of-the-billy-goat-to-blame-for-chicago-cubs-107-year-losing-streak/story-fnii0hmo-1227572555437", "http://widgets.outbrain.com/outbrain.js", "http://www.dailytelegraph.com.au/"], "published": "2015-10-18T06:45:00.000+03:00", "crawled": "2015-10-20T18:28:52.259+03:00", "highlightTitle": ""}