{"organizations": [], "uuid": "679e210210d6ef184bbb695d36d9a6073231a418", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.keloland.com", "main_image": "http://www.keloland.com/_images/data/800x600/67621.jpg", "site_section": "http://www.keloland.com/_xml/_rss.cfm", "section_title": "KELOLAND.COM: News, Weather and Sports", "url": "http://www.keloland.com/newsdetail.cfm/the-relationship-between-law-enforcement-and-schools/?id=185686", "country": "US", "title": "The Relationship Between Law Enforcement And Schools", "performance_score": 0, "site": "keloland.com", "participants_count": 0, "title_full": "The Relationship Between Law Enforcement And Schools", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T16:10:00.000+03:00", "replies_count": 0, "uuid": "679e210210d6ef184bbb695d36d9a6073231a418"}, "author": "", "url": "http://www.keloland.com/newsdetail.cfm/the-relationship-between-law-enforcement-and-schools/?id=185686", "ord_in_thread": 0, "title": "The Relationship Between Law Enforcement And Schools", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Brittany Larson BRANDON"], "text": "The Relationship Between Law Enforcement And Schools October 2, 2015, 7:10 AM by Brittany Larson BRANDON, SD - \nStudents fill the hallways at Brandon Valley High School sporting their class color with pride. It's homecoming week and pink, yellow, green, and orange represent each graduating class. \nAmong the students you'll also find resource officer Sergeant Wade Else. \nHe's one of many who was shocked to hear what happened in Harrisburg. \n\"It's news that shakes the community.\" Else said \nBut his role in the school goes far beyond prevention of a crime.\"The reason why law enforcement is in the school is to build a relationship between parents and students and faculty and law enforcement,\" Else said. \"It's not always about we're up here to stop shootings or violent crime.\"\"Even with all of the best precautions you can't guarantee that nothing will ever happen. Now you go forward after the fact, but it just reinforces to me how important relationships are and continuing to cultivate those relationships,\" Principal Gregg Talcott said. \nBrandon Valley is building a new secure entrance to the school, and is expected to be open in 2016. Talcott says what happened in Harrisburg won't likely change the setup they have now. \n\"You review your procedures and have conversations at the administrative level about how you would do things we are going to practice lock downs anyway we'll have fire drills and do those things that we do every year,\" Talcott said. \n\"The students feel safe in the aspect that we do our training and our lock down drill and we comply with what we need to do and we take it very seriously,\" Else said. \nTo ensure a safe learning environment for all students year round. \n\"This is the act of someone who is having a difficult time for whatever reason,\" Talcott said. \"You wish them health and you don't wish this on any family. It's really not something that we'll address with our kids and it's not because we want to ignore it we also don't want to glorify it and draw attention to it.\" © 2015 KELOLAND TV. All Rights Reserved.", "external_links": [], "published": "2015-10-02T16:10:00.000+03:00", "crawled": "2015-10-02T17:33:30.301+03:00", "highlightTitle": ""}