{"organizations": [], "uuid": "9147cfeca3fb6245e3b5897d531144586ca57189", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dallasnews.com", "main_image": "http://www.dallasnews.com/incoming/20151006-1444147734-ns_cowboyseagles_al45.jpg.ece/BINARY/original/1444147734-NS_CowboysEagles_AL45.JPG", "site_section": "http://www.dallasnews.com/sports/college-sports/", "section_title": "Dallas-Fort Worth College Sports News - Sports News for Dallas, Texas ", "url": "http://www.dallasnews.com/sports/dallas-cowboys/headlines/20151006-gosselin-s-nfl-rankings-why-giants-redskins-raiders-are-better-than-cowboys.ece", "country": "US", "title": "Gosselin's NFL rankings: Why Giants, Redskins, Raiders are better than Cowboys", "performance_score": 0, "site": "dallasnews.com", "participants_count": 16, "title_full": "Gosselin's NFL rankings: Why Giants, Redskins, Raiders are better than Cowboys | Dallas Morning News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T19:11:00.000+03:00", "replies_count": 20, "uuid": "edc26b534a1f31a866e455d856fd4ed2ddfb0d94"}, "author": "Rick Gosselin", "url": "http://www.dallasnews.com/sports/dallas-cowboys/headlines/20151006-gosselin-s-nfl-rankings-why-giants-redskins-raiders-are-better-than-cowboys.ece#post-0", "ord_in_thread": 0, "title": "Gosselin's NFL rankings: Why Giants, Redskins, Raiders are better than Cowboys", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "1. Green Bay. There's more to the Packers than just Aaron Rodgers. Green Bay's defense has 13 sacks over the last two weeks.\n2. New England. The Patriots and the Packers have the only two quarterbacks who have not thrown an interception in any of his team's games this season. Not surprisingly, they sit 1-2 in this poll.\n3. Cincinnati. The Bengals are the o nly team in the NFL that has not allowed a rushing touchdown. It helps to have a dynamic DT tandem of Geno Atkins and Domata Peko.\n4. Atlanta. The Falcons are unbeaten with the leakiest pass defense going. Atlanta has allowed a league-high four 100-yard receivers in four games.\n5. Denver. How's this for a reversal of fortune _ Peyton Manning has thrown four more interceptions (5) this season than his younger brother Eli has.\n6. Carolina. The Panthers are one of four NFL teams that have scheduled byes this week along with the Dolphins, Jets and Vikings.\n7. Arizona. The Cardinals are the highest-scoring team in the NFL and on pace to score 592 points this season. The NFL record is 606 by Denver in 2013.\n8. NY Jets. The Jets have as many defensive takeaways in one month (13) playing the Todd Bowles scheme as they did all of last season playing the Rex Ryan scheme.\n9. NY Giants. The Giants lead the NFL in run defense. The last time New York fielded the best run defense was 1986, the year the Giants won their first Super Bowl.\n10. St. Louis. With victories over Seattle and Arizona already this season, the future is now for the young Rams.\n11. Seattle. On paper, the Seahawks have one of the best secondaries in the NFL with Richard Sherman, Kam Chancellor and Earl Thomas. Yet Seattle is one of only three NFL teams without an interception this season.\n12. San Diego. Keenan Allen isn't in the same league with wide receivers Julio Jones or Antonio Brown financially but he is statistically. He ranks third in the NFL in receiving behind those two.\n13. Indianapolis. The Colts gave T.Y. Hilton a $65 million contract last offseason. A month into the season, he's still looking for is first touchdown.\n14. Pittsburgh. The Steelers are 2-2 with both of their wins coming against NFC teams. They are one of three teams with 2-0 record in non-conference games along with Carolina and Denver.\n15. Minnesota. His year away from football hasn't slowed Adrian Peterson. He leads the NFL in rushing after a month with 372 yards and is averaging five yards per carry.\n16. Oakland. Quarterback has been the key in Oakland's revival under new coach Jack Del Rio. Derek Carr has committed only three turnovers and been sacked just three times in a 2-2 start by the Raiders.\n17. Washington. The Redskins are one of three teams that rank in the NFL's top 10 in both offense and defense this week along with Arizona and Tennessee.\n18. Buffalo. The Bills are far and away the most penalized team in the NFL with 47 for 428 yards. That's four football field plus of free yardage. That's a lot for any team, no matter how talented, to overcome.\n19. Dallas. The Cowboys have lost their last two games without Tony Romo and will be the underdog each of the next three games without him against the Patriots (home), Giants (road) and Seahawks (home).\n20. Baltimore. With a time of possession of less than 29 minutes, the Ravens need to do a better job of ball control on offense to help a defense playing without Pro Bowl pass rusher Terrell Suggs.\n21. New Orleans. The Saints are starting to get healthy with the return of defensive starters CB Keenan Allen, S Jairus Byrd and LB Dannel Ellerbe last week.\n22. Kansas City. The Chiefs have allowed a league-high 11 TD passes this season. That's half as many as all of 2014 when KC ranked second in the NFL in pass defense.\n23. Chicago. Matt Forte continues to shine for the Bears in yet another forgettable season. Chicago is 1-3 but Forte ranks second in the NFL in rushing with 367 yards.\n24. Philadelphia. The Cowboys finished second in the NFL in rushing last season with DeMarco Murray. The Eagles rank only 30th in the league in rushing with him this season.\n25. Cleveland. The Browns have fumbled the ball away an NFL-high six times, including four by quarterbacks Josh McCown and Johnny Manziel.\n26. Tennessee. The Titans were off last week and that gave rookie QB Marcus Mariota a well-deserved break. He threw 8 TDs against only two interceptions in his first three NFL starts for the 1-2 Titans.\n27. Jacksonville. The Jaguars are one of only three teams that have not scored a rushing touchdown this season. Miami and, surprisingly, Seattle are the others.\n28. Miami. Don Shula coached the Dolphins for 26 years. Miami has had six head coaches in the 20 years since Shula's retirement in 1996. The sixth, Joe Philbin, was fired this week.\n29. Houston. J.J. Watt had four sacks in the opening month of the season. His teammates on defense have combined for two more. J.J. is going to need some help if the Texans are to resurrect from their 1-3 start.\n30. Tampa Bay. Interceptions were a problem for Jameis Winston at Florida State. They remain a problem for him in the NFL. He's thrown seven in his first four games.\n31. San Francisco. Since upsetting Minnesota in the opener, the 49ers have lost three and a row and been outscored, 107-28.\n32. Detroit. The Lions are the last of the NFL's winless team at 0-4. They have a chance to repair some of the damage with a three-game homestand against Arizona, Chicago and Minnesota.\nOn Twitter:\n @RickGosselinDMN", "external_links": ["https://twitter.com/RickGosselinDMN"], "published": "2015-10-06T19:11:00.000+03:00", "crawled": "2015-10-09T21:16:33.619+03:00", "highlightTitle": ""}