{"organizations": [], "uuid": "695794e6e4d1d4892d9b1cd37bc0d8dffcd66f28", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sacbee.com", "main_image": "http://www.sacbee.com/news/local/jvlhzn/picture40380591/ALTERNATES/LANDSCAPE_1140/IMG_IMG_J_20150913.AS.Bu_4_1_IR5RSPU0_L157780508", "site_section": "http://www.sacbee.com/?widgetName=rssfeed&widgetContentId=713546&getXmlFeed=true", "section_title": "Breaking News, Sports, Weather & More | Sacbee.com &", "url": "http://www.sacbee.com/news/local/article40380594.html", "country": "US", "title": "Lawsuit claims PG&E caused Butte fire", "performance_score": 0, "site": "sacbee.com", "participants_count": 1, "title_full": "Lawsuit claims PG&E caused Butte fire", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T04:36:00.000+03:00", "replies_count": 0, "uuid": "695794e6e4d1d4892d9b1cd37bc0d8dffcd66f28"}, "author": "Hudson Sangree \nhsangree@sacbee.com", "url": "http://www.sacbee.com/news/local/article40380594.html", "ord_in_thread": 0, "title": "Lawsuit claims PG&E caused Butte fire", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Lawsuit claims PG&E caused Butte fire \nFire that killed two and burned 475 homes was sparked by power line, lawyers say A lawsuit, filed in Calaveras Superior Court on behalf of more than a dozen fire victims, alleges that a PG&E power line touching brush sparked the Butte fire that killed two people, burned 475 homes and charred nearly 71,000 acres, mainly in Calaveras County. Andrew Seng aseng@sacbee.com i \nhsangree@sacbee.com \nA lawsuit filed Monday by a Sacramento law firm claims Pacific Gas and Electric and a company it hired to clear brush from power lines were responsible for the highly destructive Butte fire. \nThe lawsuit, filed in Calaveras Superior Court on behalf of more than a dozen fire victims, alleges that a PG&E power line touching brush sparked the fire that killed two people, burned 475 homes and charred nearly 71,000 acres, mainly in Calaveras County. \n“Defendants ... were negligent in that they failed to properly maintain, repair and inspect their lines and negligently failed to properly trim, prune, remove and/or otherwise maintain vegetation near their lines so as to secure safety to the public,” the complaint alleges. \nAbout a week after the fire started Sept. 9 in southern Amador County, PG&E officials acknowledged that one of the company’s power lines may have contacted a tree near the ignition point. On its website Monday, the California Department of Forestry and Fire Protection listed the cause as under investigation. \nThe lead plaintiffs’ attorney on the case filed Monday is Steven Campora with the Sacramento firm Dreyer Babich Buccola Wood Campora. Campora also was a lead attorney in litigation against PG&E for the San Bruno gas explosion that killed eight people in September 2010. \nMonday’s lawsuit is one of several filed in recent weeks, with others expected to follow. \nPG&E spokesman J.D. Guidi issued a statement late Monday: “Our thoughts and prayers are with the victims and the individuals who lost their homes in this fire. ... We will respond to this lawsuit in the normal legal process. As we’ve said since Sept. 16, we are cooperating fully with Cal Fire in its investigation on the source of the ignition for the Butte fire. \n“We want to reassure our customers that we at PG&E take the risk of wildfires very seriously and are focused on doing everything possible to mitigate the risk of fire during this drought.”", "external_links": [], "published": "2015-10-20T04:36:00.000+03:00", "crawled": "2015-10-20T20:10:21.804+03:00", "highlightTitle": ""}