{"organizations": [], "uuid": "5853e6b0557ff7d609a23e4089db30773c734a5c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thedaonline.com", "main_image": "http://thedaonline.com/content/tncms/live/global/resources/images/_site/og_image.jpg", "site_section": "http://www.thedaonline.com//search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&nsa=eedition&c[]=sports,sports/*&f=rss", "section_title": "The Daily Athenaeum - sports,sports/", "url": "http://www.thedaonline.com/sports/article_b3527048-7143-11e5-aef0-8fd14de06eb7.html", "country": "US", "title": "West Virginia continues reign over Marshall in State Games", "performance_score": 0, "site": "thedaonline.com", "participants_count": 1, "title_full": "West Virginia continues reign over Marshall in State Games", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T00:45:00.000+03:00", "replies_count": 0, "uuid": "5853e6b0557ff7d609a23e4089db30773c734a5c"}, "author": "Roger Turner", "url": "http://www.thedaonline.com/sports/article_b3527048-7143-11e5-aef0-8fd14de06eb7.html", "ord_in_thread": 0, "title": "West Virginia continues reign over Marshall in State Games", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "West Virginia continues reign over Marshall in State Games By Roger Turner TheDAOnline.com | 0 comments The West Virginia University men's and women's swimming and diving teams finished the final day in this year's West Virginia State Games on Friday at the WVU Natatorium, winning the meet for the fifth straight year over the Marshall Thundering Herd. The Mountaineers continued with strong efforts in the pool and on the diving board, finishing on top in every event Friday. Depth for WVU factored into the overwhelming victory more than anything, as freshmen and sophomores for the men's and women's teams performed at a high level the duration of the state meet. \"We had some very strong swims from both our upperclassmen and freshmen,\" said head coach Vic Riggs. \"I was impressed with the focus and adjustments from last week.\" In the first event, the women's team finished first and second in an energetic 200-medley relay. The winning team featured swimmers Courtney Miller, Emma Harris, Natalie Johnsen and Jamiee Gillmore, who recorded an official time of 1:48.47. Coming in second, swimmers Marah Bieger, Maggie Miller, Amelie Currat and Rachel Ward finished with a time of 1:49.87. Bieger followed up for the women's team, winning two events on day two of this year's WV State Games. In her Mountaineer debut, Bieger took first place in the 100-yard breaststroke, as well as first in the 400-yard individual medley event with a final time of 4:33.16. Emma Harris finished behind Bieger in the 100-yard breaststroke, recording a time of 1:08.58, which was not too far behind Bieger's first-place time of 1:07.80. On the diving board for West Virginia, both teams kept up the promising results from a week ago. Diving coach Michael Grapner anticipates the quality young talent on the springboard to flourish as the season progresses, with freshman Averly Hobbs qualifying for zones in the one-meter event on Friday, as well as sophomore Alex Obendorf for the men's three-meter diving event. \"I'm excited to see what this young diving squad will bring this year,\" Grapner said. Sophomores Alex Obendorf, Logan McHenry and Michael Proietti finished 1-2-3 for the men's diving team in the one-meter event, dominating the competition on Friday. Upperclassmen swimmers Andrew Marsh, Max Spencer, Chase Williams and Ross Glegg showed up once again in the men's 200 relay, winning the event with a time of 1:32.24. The West Virginia men's team swept the top three spots in the 100-yard butterfly and 200 free events. Marsh finished first in the men's butterfly, recording a time of 49.59. Williams came in second with a time of 52.31, followed by Fernando Duenas (52.55) in third. Glegg won the 200 free event for the men's, touching the wall in 1:41.99. Senior Nate Carr provided an exciting race, finishing on the heels of Glegg with a time of 1:42.03. Chris McMahon placed third in the men's 200 free behind Carr with a time of 1:45.08. The two-day state meet concluded with both WVU teams coming out victorious overall. The fifth consecutive win in this year's meet for the Mountaineers came as a result of focus by both teams, who will host the Big 12 vs. ACC Weekend quad meet on Oct. 16-17 in the WVU Natatorium. \"We've had trouble in past years maintaining focus, and we didn't this year,\" Riggs said. \"Overall it's a great way to start our season, but now we'll turn our attention to next week's challenge and try to improve from this week.” Both the West Virginia men's and women's swimming and diving teams will take a week break before hosting Georgia Tech and Virginia Tech in Big 12 vs ACC Weekend events. The Mountaineers will face Georgia Tech on Friday at 5 p.m. and Virginia Tech on Saturday at 2 p.m.", "external_links": [], "published": "2015-10-13T00:45:00.000+03:00", "crawled": "2015-10-15T11:16:31.262+03:00", "highlightTitle": ""}