{"organizations": [], "uuid": "0eba356eb3f9124fa68a846de8eb505489943a14", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "savannahnow.com", "main_image": "http://savannahnow.com/sites/default/files/images/sms-default-facebook-share.jpg", "site_section": "http://savannahnow.com/", "section_title": "savannahnow.com | Savannah Georgia's source for News, Entertainment, Sports, Weather, Classifieds, Jobs, Autos, Real Estate and St. Patricks Day", "url": "http://savannahnow.com/column/2015-10-24/marianne-heimes-dont-squander-your-rght-vote", "country": "US", "title": "Marianne Heimes: Don't squander your rght to vote", "performance_score": 0, "site": "savannahnow.com", "participants_count": 1, "title_full": "Marianne Heimes: Don't squander your rght to vote | savannahnow.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T17:33:00.000+03:00", "replies_count": 0, "uuid": "0eba356eb3f9124fa68a846de8eb505489943a14"}, "author": "Marianne Heimes", "url": "http://savannahnow.com/column/2015-10-24/marianne-heimes-dont-squander-your-rght-vote", "ord_in_thread": 0, "title": "Marianne Heimes: Don't squander your rght to vote", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Marianne Heimes\nEarly voting continues for the municipal elections on Tuesday, November 3rd. Every opportunity is given to the voter to cast his or her ballot either by absentee, early voting, or on election day but here’s a short rundown on the process that goes into this and why you, the voter, need to participate in your end of the deal.\nAll year, elections and registrars offices are busy with the day-to-day operations of keeping track of old and anticipating new elections. Lots of paperwork to be dealt with, machine inventory to be considered, polls, poll workers and poll watchers to be contacted, and concentrated training and background checks.\nWhen election day nears, there are candidates to be qualified and verified and then ballots to be proofed. Not just one ballot, of course, but one for each precinct where an election will be held and each one is different. Absentee ballots must be printed. Then comes the final check to ensure all machines are in working order, making sure all precincts will be open to pollworkers on time, and answering a huge volume of telephone inquiries.\nThat is a small snapshot of the work that goes on prior to elections. There is another very important group that comes into play here and that is the candidates. After being qualified and vetted to make sure there are none who are not qualified to run, their names become part of the anticipated ballots and the campaigns begin in earnest. This year, the only elections are in municipalities and the number of residents in each municipality tends to set the tone for the number of debates and forums.\nCandidates for races in the city of Savannah this year have had a steady chance to attend forums and meet their constituents and most seem to have met their obligations. The questions have not been easy nor were they meant to be. By contrast, at small Tybee Island, the one planned forum was boycotted by three of the six candidates.\nAfter intensive campaigning, it’s show time, the first day of early voting, and a new group comes into play and that is you, the voter. If you don’t play your part by voting either early, absentee, or on election day, you are really saying that you can’t be bothered to do your civic duty and for the life of me, I can’t imagine why anyone would want to squander this opportunity.\nMany years ago, I voted for the first time and was so excited. I honestly don’t remember if my candidate won or lost, but I do remember the thrill of going into that voting booth and pulling the lever with no one looking over my shoulder.\nWhen we moved to Savannah, my husband and I became poll workers, he the manager and me an assistant, and we learned more about how all these precincts operate. At first it was with those heavy old machines with the long paper output, which we spent some time recording after the polls closed. I applaud today’s poll workers who go through substantial training, get to their polling precinct by at least 6:30 a.m. and stay after the polls close until everything has been properly recorded to go back to the Elections office. They are our real election day heroes.\nLast year, I was elected to the Board of Elections, which really completed the third part of my voting knowledge (and I still have much to learn).\nI can tell you that every possible effort is made every step of the way to ensure honest, non-fraudulent elections. Should you spot something which you feel might be wrong during an election, do not hesitate to call and report the alleged violation. Early and absentee voting is handled by the Board of Registrars and election day voting by the Board of Elections. You can check both out on their Chatham County websites.\nBut please, good people, please take the time to cast your ballot. This is a privilege not enjoyed in every part of the world. And as the saying goes, “If you don’t use it, you lose it.” If you are already a voter, take some time to contact others who do not vote. Blast it on your Facebook page if you have one.\nThe elections board will be up late on Tuesday, Nov. 3, making sure all votes are properly counted. We are hoping to be overwhelmed by your, the voters, turnout.\nMarianne Heimes lives and writes in Savannah.", "external_links": ["http://sav-cdn.com/sites/all/themes/savannahnow/images/blank.gif"], "published": "2015-10-24T17:33:00.000+03:00", "crawled": "2015-10-25T12:04:41.772+02:00", "highlightTitle": ""}