{"organizations": [], "uuid": "29374481fba52d408808d8e223aea1edbe24d34b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.oregonlive.com", "main_image": "http://imgick.oregonlive.com/home/olive-media/width620/img/oregonian/photo/2015/09/21/18804158-large.jpg", "site_section": "http://www.oregonlive.com/", "section_title": "Oregon Local News, Breaking News, Sports &amp; Weather - OregonLive.com", "url": "http://www.oregonlive.com/politics/index.ssf/2015/09/house_republicans_submit_writt.html", "country": "US", "title": "House Republicans submit written questions to Planned Parenthood", "performance_score": 0, "site": "oregonlive.com", "participants_count": 14, "title_full": "House Republicans submit written questions to Planned Parenthood | OregonLive.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T20:57:00.000+03:00", "replies_count": 15, "uuid": "98655773d1aa98e997dad0aeab28eb6ffdb69b9b"}, "author": "Ian K. Kullgren | The Oregonian/OregonLive", "url": "http://www.oregonlive.com/politics/index.ssf/2015/09/house_republicans_submit_writt.html#post-0", "ord_in_thread": 0, "title": "House Republicans submit written questions to Planned Parenthood", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SALEM — House Republicans continued to stoke the controversy over Planned Parenthood, submitting written questions to the group on its practices for transferring fetal tissue.\nThe letter — sent Tuesday to two Oregon Planned Parenthood leaders and two top officials at Oregon Health & Science University — asks for detailed information on who's responsible for processing fetal tissue, how it's done and how much Planned Parenthood is paid for each specimen.\nThe letter was signed by eight Republicans regarded to be among the most conservative in the House.\n\"Taxpayer-funded organizations, like Planned Parenthood, should feel an obligation and a responsibility to provide public testimony about their operations to the Legislature,\" Rep. Andy Olson , R-Albany, said in a statement Wednesday. \"While an open and public dialogue on this topic would have allowed for the best opportunity to bring clarity to this issue, our only immediate option is to move forward with our questions in written form.\"\nThe letter came in lieu of a committee meeting canceled by House Speaker Tina Kotek , D-Portland, and as some Republicans in Congress call for defunding Planned Parenthood over edited videos that purport to show the group profiting from the sale of aborted fetuses.\nPlanned Parenthood in Oregon says gives donated placental tissue to the university for two scientific studies related to still births and pregnancy complications.\nThe group's political arm, Planned Advocates of Oregon, said it's planning to respond.\n\"We are aware of the letter and are preparing a response,\" Planned Parenthood Advocates of Oregon Executive Director Mary Nolan said in a statement. \"Most Oregonians and most Americans already know that Planned Parenthood medical providers and health center staff are among the best in the country, and we adhere to the highest professional standards.\"\n— Ian K. Kullgren\nikullgren@oregonian.com\n503-294-4006; @IanKullgren", "external_links": ["https://twitter.com/iankullgren"], "published": "2015-09-30T20:57:00.000+03:00", "crawled": "2015-10-01T00:40:06.457+03:00", "highlightTitle": ""}