{"organizations": ["Columbus Lady Indians", "GHSA"], "uuid": "3cafb5d560f66f6374dfa58aa18f9a491c331d11", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.times-herald.com", "main_image": "http://assets.mediaspanonline.com/prod/12306383/ec.jpg", "site_section": "http://feeds.times-herald.com/rss/sports", "section_title": "The Times-Herald > Sports", "url": "http://www.times-herald.com/Sports/20151022-SPORTS-ECSoftball", "country": "US", "title": "Lady Indians sweep Collins Hill, clinch return trip to GHSA Elite 8 in Columbus", "performance_score": 0, "site": "times-herald.com", "participants_count": 0, "title_full": "Lady Indians sweep Collins Hill, clinch return trip to GHSA Elite 8 in Columbus", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T09:40:00.000+03:00", "replies_count": 0, "uuid": "3cafb5d560f66f6374dfa58aa18f9a491c331d11"}, "author": "", "url": "http://www.times-herald.com/Sports/20151022-SPORTS-ECSoftball", "ord_in_thread": 0, "title": "Lady Indians sweep Collins Hill, clinch return trip to GHSA Elite 8 in Columbus", "locations": ["Columbus", "Collins Hill"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Collins Hill"], "text": "Lady Indians sweep Collins Hill, clinch return trip to GHSA Elite 8 in Columbus by Comments \nEast Coweta catcher Olivia Davis comes up with a tag on a throw to home plate during Game 1 of Thursday’s doubleheader. \nWhen a high school softball team gets to the GHSA Elite 8 Tournament in Columbus, they have to be prepared for not only any opponent, but any possible game scenario - whether it be a shootout or a 1-run nailbiter. \nThe Lady Indians played on Wednesday at home in its Sweet 16 best-of-three series against Collins Hill like they could succeed playing either 'small ball' or 'long ball' next week at Sout h Common s Complex. \nPounding out 12 hits in the opener and then handing the ball to senior right-hander Morgan Goree in the nightcap for an 11-strikeout performance, East Coweta clinched a return trip to next week's double-elimination quarterfinal tournament with consecutive 12-4 and 5-1 victories over a tough Lady Eagles' lineup that had its 2015 season end short of Columbus in Sharpsburg with 21 wins. \nCollins Hill, was denied win No. 22 by East Coweta (33-2), which never trailed in either of its second-round games, yet were still pushed at times, especially in Game 2. \nThe Lady Eagles closed to within a 2-1 deficit in the bottom of the third, but were denied the tying run when catcher Olivia Davis came up with a tag at the plate on a close play off a wild pitch. \nThat allowed East Coweta to hold onto its lead and eventually put the series away with a clutch two-run double by Ashlynn Gunter in the fifth and another RBI double by senior Dani Morgan in the sixth. \nOn Wednesday, though, the contributions seemed to come up and down the lineup. \n'It really was, between the two games, a complete team effort,' East Coweta head coach Franklin DeLoach said. 'Different girls at different times at different parts of the game all day.' \nPitchers Goree, Kelley Lynch and Rachel Vaughan - not unlike the Braves' Maddux, Smoltz and Glavine during title years of the 1990s - were lights out on Wednesday, while the Lady Indians made just one error in the field over the doubleheader. \nLynch struck out seven, including four of her first six batters, but had to battle through much of five-plus innings after gett i ng beh i nd i n counts. Two of her eight hits allowed in Game 1 came to Collins Hill third baseman and future Florida signee Jaimie Hoover. \nAfter the Lady Eagles closed to within a 9-3 deficit, Vaughan, a crafty left-hander, closed out the sixth by retiring both batters she faced, one on an RBI groundout, before the ball went to Goree in Game 2. \n'I was very proud of Kelley. She battled for us and gave us a chance and Rachel comes in and finishes well,' said DeLoach. \n'And Morgan … wow.' \nGoree, who changed speeds to keep hitters off guard, yielded just one walk while keeping Collins Hill at bay while scattering four singles over seven innings in game two. \nMeanwhile, a year after counting heavily on its four talented seniors, especially LSU freshman Shemiah Sanchez, for offense, East Coweta finished the doubleheader with 26 hits, 11 of which went for extra bases. Over the two games, five Lady Indians had multi-hit efforts in Game 1 and three more had two or more hits in Game 2 led by leadoff hitter Mekhia Freeman's 3-for-4 performance with three doubles. \nFreeman gave East Coweta an immediate 1-0 lead in the finale, doubling to lead off the top of the first before the speedy senior came all the way home on a sacrifice bunt back to the pitcher. \nThe opener saw the Lady Indians' No. 4 through 8 hitters - Lynch, Vaughan, Gunter, Lindsey Warren and Jamie Vitale - go 10-for-15 combined at the plate with 7 RBIs. \nWarren went 3-for-4 with 2 RBIs in an effort that included a triple and double in her first-two at bats. \n'I can't sit here and brag on just one girl,' DeLoach said. 'It was an entire team effort. Right now we're going to enjoy this and tomorrow we'll get right back to work for bigger challenges ahead.' \nVitale had two hits and 3 RBIs in her first two trips to the plate, including a two-run single that blooped into short left-field after facing an early 0-2 count against Collins Hill game one starting pitcher Aaliyah Barber. The clutch at bat pushed a 7-0 lead with the Lady Eagles about to start nipping at the lead with lone runs in the fourth, fifth and sixth innings before East Coweta ended it by mercy rule with a three-run rally in the sixth. \nIf DeLoach had any uncertainties about how his team might handle Collins Hill, led by future Florida signee Jaimie Hoover, who had two hits in Game 1, he received an immediate answer in a first-inning that firmly put momentum in the Lady Indians favor. \nAfter Lynch retired the side in order, East Coweta put on a clinic during a five-run rally in its first at bat of the doubleheader. \nExtra-base hits from Morgan, Lynch, Gunter and Warren came after Freeman walked and went to second on a sacrifice bunt by Madison Carter. Vitale closed the rally with East Coweta's fifth hit of the inning on a sharp single to the outfield. East Coweta will open next week's tournament against Archer on Thursday, but DeLoach and his staff hope to keep the Lady Indians' focus on themselves rather than opponents right now. \n'We'll worry about our opponents. They didn't hear anything about our scouting report [on Collins Hill] before today,' DeLoach said. 'And they're going to hear about is East Coweta.' \nGame 1 \nLADY INDIANS 12, LADY EAGLES 4 \nCollins Hill 000 112 - 4 8 1 \nEast Coweta 502 023 - 12 14 0 \nWP - Kelley Lynch", "external_links": [], "published": "2015-10-22T09:40:00.000+03:00", "crawled": "2015-10-22T13:54:58.543+03:00", "highlightTitle": ""}