{"organizations": ["SAS Championship Bernhard Langer"], "uuid": "0b88a4266ec051c1d76c8f57464e3890b232bc2a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wralsportsfan.com", "main_image": "http://wwwcache.wralsportsfan.com/asset/golf/2012/10/04/11627652/11627652-1408328144-646x485.jpg", "site_section": "http://www.wralsportsfan.com/news/rss/697/", "section_title": "Sports Fan stories from WRAL.com", "url": "http://www.wralsportsfan.com/bernhard-langer-takes-2-shot-lead-in-sas-championship/14958901/", "country": "US", "title": "Bernhard Langer takes 2-shot lead in SAS Championship", "performance_score": 0, "site": "wralsportsfan.com", "participants_count": 0, "title_full": "Bernhard Langer takes 2-shot lead in SAS Championship", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T01:48:00.000+03:00", "replies_count": 0, "uuid": "0b88a4266ec051c1d76c8f57464e3890b232bc2a"}, "author": "", "url": "http://www.wralsportsfan.com/bernhard-langer-takes-2-shot-lead-in-sas-championship/14958901/", "ord_in_thread": 0, "title": "Bernhard Langer takes 2-shot lead in SAS Championship", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Bernhard Langer"], "text": "Bernhard Langer takes 2-shot lead in SAS Championship \nPosted 5:52 p.m. yesterday Your friends e-mail addresses (comma separated): * Subject: * You must enter the characters with black color that stand out from the other characters More on this More Golf Stories By ERIC ECKARD, Associated Press \nCARY, N.C. — Bernhard Langer shot a 7-under 65 in windy conditions Friday to take a two-stroke lead in the Champions Tour's SAS Championship. \nThe 58-year-old German star had seven birdies in a bogey-free round at Prestonwood Country Club. He won the Senior Players Championship in June for his 24th victory on the 50-and-over tour. \n\"It was great not to make any bogeys because there's lots of opportunities to make bogeys,\" said Langer, the 2012 winner at Prestonwood. \"I got off to a nice start with two birdies right away. I played some solid golf, hit a lot of fairways, hit a lot of greens and gave myself some opportunities. \n\"I never really struggled for par. It was stressless golf in a sense where I just kept the ball in play and took my chances and made the odd putt here and there.\" \nGene Sauers, John Riegger and Scott Dunlap shot 67, and Kenny Perry was another stroke back along with Tom Lehman, Duffy Waldorf, Kevin Sutherland, Rod Spittle, Greg Kraft and Olin Browne. \n\"It's one of the windier days I've played out here, so it was a challenge right out of the box,\" Waldorf said. \nLanger is third in the Charles Schwab Cup points race, 388 points behind leader Colin Montgomerie and Jeff Maggert with four events left. Montgomerie was tied for 17th after a 70, and Maggert was tied for 36th after a 72. The tournament winner will get 315 points. Langer is trying to become the first three-time Cup winner after taking the season titles in 2010 and 2014. \nLanger skipped the last Champions Tour event in September at Pebble Beach to play in the European's European Open at a course he designed in Germany. \n\"The goal is to draw closer to the two guys or maybe even pass them, but that's a big challenge,\" Langer said about Montgomerie and Maggert. \"They're both very good golfers. They've had fantastic years. So, it's not going to be easy, but today was a good start.\" \nMaggert has a tour-high four victories this year, winning major titles in the Regions Tradition and U.S. Senior Open. Montgomerie successfully defended his title in the Senior PGA Championship. \nCopyright 2015 by The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Triangle Area Special Offers", "external_links": [], "published": "2015-10-10T01:48:00.000+03:00", "crawled": "2015-10-10T08:09:59.176+03:00", "highlightTitle": ""}