{"organizations": [], "uuid": "b67976403efaa39bd243fb93aaa686d3c61433e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattletimes.com", "main_image": "http://www.seattletimes.com/wp-content/themes/st_refresh/img/st-meta-facebook.png", "site_section": "http://www.seattletimes.com/sports/feed/", "section_title": "The Seattle Times » Sections » Sports", "url": "http://www.seattletimes.com/sports/seahawks/seahawks-opponent-outlook-san-francisco-49ers/", "country": "US", "title": "Seahawks opponent outlook: San Francisco 49ers", "performance_score": 0, "site": "seattletimes.com", "participants_count": 1, "title_full": "Seahawks opponent outlook: San Francisco 49ers", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T04:45:00.000+03:00", "replies_count": 0, "uuid": "b67976403efaa39bd243fb93aaa686d3c61433e2"}, "author": "Seattle Times staff", "url": "http://www.seattletimes.com/sports/seahawks/seahawks-opponent-outlook-san-francisco-49ers/", "ord_in_thread": 0, "title": "Seahawks opponent outlook: San Francisco 49ers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The series: Seahawks lead it 17-15 and have won four of the past five, including both games last season — a 19-3 victory on Thanksgiving night in the Bay Area and 17-7 at CenturyLink Field on Dec. 14. \nEarly line: Seahawks by 6. \nKey players: \nQB Colin Kaepernick: Kaepernick has rarely played well against the Seahawks, holding a 53.7 passer rating in six regular-season games against them with seven interceptions and two touchdowns. But the Seahawks catch him as he’s coming off one of the better two-game stretches of his career. In a tight loss to the Giants and a win Sunday over the Ravens, Kaepernick completed 39 of 62 passes for 602 yards, four touchdowns and no interceptions. And he remains a viable running threat with 228 yards on 39 carries. \nWR Anquan Boldin: He is 35, but Boldin has looked as good as ever the past two weeks, catching 13 passes for 209 yards. He’s on pace for 75 receptions and almost 900 yards. Boldin has not done much against the Seahawks in recent years, though, being held to five catches for 41 yards last season. \nLB NaVorro Bowman: This will be the first game for Bowman against the Seahawks since he suffered torn anterior-cruciate and medial-collateral ligaments in his left knee during the 2014 NFC Championship Game, an injury that caused him to miss the 2014 season. But the 27-year-old appears back to form, having made 31 tackles the past two weeks, including 13 solo stops against Baltimore on Sunday. He is tied for second in the NFL with 59 tackles. \nOLB Aaron Lynch: The second-year player out of South Florida has emerged as one of the 49ers’ top pass rushers and playmakers on defense. He leads the team with three sacks and had a season-high five tackles Sunday. \nSan Francisco’s keys to success: These aren’t your father’s 49ers — or previous coach Jim Harbaugh’s, for that matter. But after looking dead in the water after four games, the 49ers have played better, including Sunday’s 25-20 victory over Baltimore. The 49ers do not have a lot of impressive stats, though. San Francisco ranks 30th in the NFL in total offense, averaging 321.2 yards per game, and is 31st in total defense, allowing 409.0 yards per game. The 49ers allow 6.2 yards per play, 30th in the NFL. Their strength remains running and run defense, even if neither is as imposing as during the Harbaugh days. The 49ers are 12th in rushing at 118.3 per game and average 4.2 yards per carry, led by Carlos Hyde’s 430 yards. They are 15th defending the run (102.8 yards per game). But it’s an improved passing game that has led to the offensive resurgence, as Kaepernick has established good connections with Boldin and Torrey Smith, and undoubtedly will try to keep that going against a suddenly vulnerable Legion of Boom secondary. That could make this a different-looking game than we’ve seen from this series, as the 49ers’ secondary also looks leaky of late, having allowed four teams to pass for 300 or more yards this season. The San Francisco defense has just nine sacks, none the past two weeks. Bob Condotta", "external_links": [], "published": "2015-10-20T04:45:00.000+03:00", "crawled": "2015-10-20T05:23:50.150+03:00", "highlightTitle": ""}