{"organizations": [], "uuid": "b35247338755733c8580dc3287cea788a6e06ed9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.watertowndailytimes.com", "main_image": "http://watertowndailytimes.com/apps/pbcsi.dll/bilde?Site=WD&Date=20151002&Category=SPORTS&ArtNo=151009705&Ref=AR", "site_section": "http://www.watertowndailytimes.com/section/iatom_wdtsports?omniture=0&mime=application%2Fatom%2Bxml", "section_title": "WDT News Feed: Watertown Daily Times: Local Sports", "url": "http://www.watertowndailytimes.com/sports/qb-lefflbines-arrival-a-key-turning-point-for-saints-program-20151002", "country": "US", "title": "QB Lefflbine’s arrival a key turning point for Saints program", "performance_score": 0, "site": "watertowndailytimes.com", "participants_count": 0, "title_full": "QB Lefflbine’s arrival a key turning point for Saints program", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T09:00:00.000+03:00", "replies_count": 0, "uuid": "b35247338755733c8580dc3287cea788a6e06ed9"}, "author": "", "url": "http://www.watertowndailytimes.com/sports/qb-lefflbines-arrival-a-key-turning-point-for-saints-program-20151002", "ord_in_thread": 0, "title": "QB Lefflbine’s arrival a key turning point for Saints program", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Lefflbine"], "text": "A A \nCANTON — Ask St. Lawrence University quarterback Mike Lefflbine about the latest school record he broke and he won’t have much to say. \nBut if you ask the senior from Greenwich, Conn., to talk about his team, he will crack a smile and speak with pride. \nLefflbine’s arrival on the SLU campus three years ago, after transferring from NCAA Division I school Sacred Heart, has marked a turning point for the SLU program. \nIn the three seasons before Lefflbine arrived, SLU produced an 8-22 record. Since he became the team’s starting quarterback, SLU is 18-6, including a 3-1 record so far this season. The Saints host the University of Rochester at 1 p.m. Saturday in their second Liberty League game of the season. \n“Every league game is a big challenge,” Lefflbine said. “No one is easy in the Liberty League these days. We expect Rochester’s best and we have to execute.” \nThe Saints are coming off a 42-23 win at Union in the Liberty League opener. It showed an improvement from SLU’s first road game of the season when the Saints got off to a bad start and wound up losing a nonconference game 28-20 to SUNY Morrisville. \nLast Saturday the Dutchmen scored a touchdown on their first drive and then intercepted a Lefflbine pass. But SLU’s defense held, the offense began to move the ball and SLU wound up with a convincing win. \n“We were expecting one thing (from Union) and got a different thing,” Lefflbine said. “We made adjustments and made it happen. Me as a person, I’m level-headed. Football is up and down, so you can’t get too high and you can’t get too low.” \nLefflbine’s first touchdown Saturday, a 24-yard pass to Leondre Simmon, gave him the SLU career record for touchdowns with 40, breaking the mark set by former St. Lawrence Central player Kirk Dempsey from 1975-77. It was the second record of Dempsey’s that Lefflbine has broken. Last year his 21 touchdowns broke Dempsey’s record of 19 set in 1976. \n“It’s great,” Saints coach Mark Raymond said of the record. “It’s a heck of an honor to coach a guy like that. He’s a special kid. We really don’t concentrate too much on numbers, other than (wins). Everybody shares in that kind of success. It’s fun to watch. It makes (coaches) look a lot smarter.” \nSaid offensive coordinator Dan Puckhaber, “Good players make good football teams and he’s a great one, so our offense is exponentially better with him as our quarterback, just because he makes everybody else better than they actually are. That’s what he does. He has great arm strength. He is extremely accurate. His presence in the pocket makes the offensive line better. He doesn’t overreact to pressure. He slides at the right time. He is able to get that pass off. Some guys go running out of the pocket. He’ll just slide left to right and it doesn’t take him much time to get the pass off.” \nSometimes SLU’s offense will get off to slow starts in games, but at some point Lefflbine will begin to connect with his receivers and get on a spurt where he completes 8-of-10 passes. \n“Just like any quarterback, when he knows what the defense is going to look like than he knows what to do with the football,” Puckhaber said. “Once he knows what the other team is going to try to do to him he’s good to go.” \nLefflbine has completed 69.9 percent of his passes this season for 970 yards with nine touchdowns and three interceptions. Last year her threw for 2,075 yards with 21 touchdowns and four interceptions and was the Liberty League Co-Offensive Player of the Year. \nAfter sitting out one year following his transfer, Lefflbine was not 100-percent sure during last season if he was going to be able to return this year. He found out in the spring he would have one final year of eligibility. \n“It’s been an unreal experience,” Lefflbine said of his career. “I couldn’t thank the coaches more, the staff, the faculty that helped me. It’s truly a blessing.” Commenting rules: Stick to the topic of the article/letter/editorial. When responding to issues raised by other commenters, do not engage in personal attacks or name-calling.", "external_links": [], "published": "2015-10-02T09:00:00.000+03:00", "crawled": "2015-10-02T13:17:38.504+03:00", "highlightTitle": ""}