{"organizations": [], "uuid": "0ec243ee1e63bf1f9ad61133800797da042cf10a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/47529300.cms", "site_section": "http://timesofindia.indiatimes.com/Sports/More-sports/Cycling/articlelist/3413195.cms", "section_title": "Cycling - More sports - Sports - The Times of India", "url": "http://timesofindia.indiatimes.com/sports/more-sports/cycling/World-champion-Kwiatkowski-joins-Sky-for-2016/articleshow/49127086.cms", "country": "IL", "title": "World champion Kwiatkowski joins Sky for 2016", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "World champion Kwiatkowski joins Sky for 2016 - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T02:10:00.000+03:00", "replies_count": 0, "uuid": "0ec243ee1e63bf1f9ad61133800797da042cf10a"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/sports/more-sports/cycling/World-champion-Kwiatkowski-joins-Sky-for-2016/articleshow/49127086.cms", "ord_in_thread": 0, "title": "World champion Kwiatkowski joins Sky for 2016", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "RICHMOND (United States): Poland's Michal Kwiatkowski, last year's world road race champion, will move from Etixx-Quick Step to Team Sky for the 2016 season, the British outfit announced on Sunday.\nConfirmation of the signing -- which has long been a badly-kept secret in the peloton -- came just hours before Kwiatkowski began the defense of his crown in the concluding race of the World Road Cycling Championships.\nThe 25-year-old rider, who spent the past four seasons with Etixx, won the prestigious Amstel Gold Race earlier this year whilst he also took stage victories at Paris-Nice, the Tour de Romandie and Tirreno-Adriatico over the last couple of season.\nBut his biggest victory came at last year's worlds, when he captured the rainbow jersey in impressive fashion with a late solo break on a downhill section.\n\"Team Sky aim for the highest goals in cycling so I'm very happy that this move has become a reality,\" Kwiatkowski said. \"I am excited and motivated to race for Team Sky next year.\"\nIt wasn't the time Sky had tried to recruit the Polish standout.\n\"Michal has performed fantastically well over the past couple of years,\" Sky principal Dave Brailsford said. \"We have been following his career for a long time. We have attempted to sign him on two occasions previously and weren't going to miss out this time around.\"\nThe move comes a day after Sky announced the signing of Spain's Mikel Landa, who was third in this year's Giro d'Italia.\nSky have also signed 2016 deals with Alex Peters, Gianni Moscon, Michal Golas, Danny van Poppel and Benat Intxausti.\nKwiatkowski said he expects to be a greater threat on Sky than when he rode for Quick Step.\n\"I know that this team can help me raise my performance levels and win big races,\" said Kwiatkowski. ", "external_links": ["https://play.google.com/store/apps/details?id=com.toi.reader.activities"], "published": "2015-09-28T02:10:00.000+03:00", "crawled": "2015-10-01T00:27:41.256+03:00", "highlightTitle": ""}