{"organizations": [], "uuid": "4ad090c64cad2e9e8dcc98e5b7499fdd1995b82e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "wtop.com", "main_image": "", "site_section": "http://wtop.com/section/sports/feed/", "section_title": "WTOP » Sections » Sports", "url": "http://wtop.com/ncaa-football/2015/10/undefeated-no-14-texas-am-hosts-prescott-mississippi-st/", "country": "US", "title": "Undefeated No. 14 Texas A&M hosts Prescott, Mississippi St", "performance_score": 0, "site": "wtop.com", "participants_count": 1, "title_full": "Undefeated No. 14 Texas A&M hosts Prescott, Mississippi St", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T17:35:00.000+03:00", "replies_count": 0, "uuid": "4ad090c64cad2e9e8dcc98e5b7499fdd1995b82e"}, "author": "wtopstaff", "url": "http://wtop.com/ncaa-football/2015/10/undefeated-no-14-texas-am-hosts-prescott-mississippi-st/", "ord_in_thread": 0, "title": "Undefeated No. 14 Texas A&M hosts Prescott, Mississippi St", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Undefeated No. 14 Texas A&M hosts Prescott, Mississippi St By KRISTIE RIEKEN October 2, 2015 10:35 am Mississippi State quarterback Dak Prescott scrambles for a first down during the second half of an NCAA college football game against Auburn, Saturday, Sept. 26, 2015, in Auburn, Ala. (AP Photo/Butch Dill) \nCOLLEGE STATION, Texas (AP) — As Mississippi State quarterback Dak Prescott prepares for Saturday’s game at No. 14 Texas A&M, he’s in a much better place than he was the last time he visited Kyle Field. \nWhen Prescott played the Aggies on Nov. 9, 2013, it was just days after his mother died of cancer. Prescott missed practice that week and didn’t start. He came in early and threw for 149 yards and two scores and ran for 154 yards. He and the Bulldogs were unable to overcome a five-touchdown performance by Johnny Manziel in the 51-41 win by the Aggies. \n“I’m completely different, night and day,” Prescott said. “That was a stressful time in my life. It was a big game coming off of (my mother passing away) … I’m excited to go back again. It’s another road trip but I’m planning for different results.” \nNo. 21 Mississippi St. (3-1, 1-1 SEC) are coming off a win over Auburn. No. 14 Texas A&M (4-0, 1-0) is looking for a 2-0 start in conference play for the first time since doing so in the Big 12 in 1997-98. \nPrescott is off to a solid start this season and has completed almost 67 percent of his passes for 1,069 yards and seven touchdowns. He’s thrown 191 straight passes without an interception, a streak that is the longest in the nation and the sixth longest in SEC history and that dates back to the Orange Bowl. \nTexas A&M coach Kevin Sumlin knows the key to success against the Bulldogs is to contain the dual-threat quarterback. \n“When he’s on the field he just exudes confidence,” Sumlin said. “Team feeds off that. Won’t be intimidated. Been on big stages. And he’s a good player. Everything will run through him offensively.” \nThe Aggies’ defense, led by defensive end Myles Garrett, is tied for second in the country with 17 sacks. Garrett is tied for second in the country with 6 ½ sacks and teammate Daeshon Hall has four. Mississippi State coach Dan Mullen knows all about the two pass rushers and has a plan to deal with them. \n“If your quarterback is making good decisions and they have the opportunity to get rid of the ball quickly, it helps your pass protection as much as anything,” Mullen said. “We don’t want our quarterback holding the ball too long. A guy like Dak, who can get through his progression reads pretty quickly, helps keep those sack numbers down.” \nSome things to know about Mississippi State’s game against Texas A&M: \nFABULOUS FRESHMAN: Texas A&M WR/PR/KR Christian Kirk had a career-high 173 yards receiving last week for his third 100-yard receiving game, which tied a school record. He leads SEC freshmen in touchdowns (5), yards receiving a game (110.5), punt return yards (149), kickoff return yards (209) and all-purpose yards (201.2). “He will start seeing different coverages and things,” Sumlin said. “After about game four or five, people figure out it’s not a fluke. He’s got some real talent. Defenses will change.” \nJEFFERSON THRIVING: Mississippi State junior defensive lineman A.J. Jefferson is playing very well in his first season as a starter. The 6-foot-3, 277-pounder leads the team and is third in the SEC with 7½ tackles for a loss and also has 3½ sacks. The Bulldogs rank third in the SEC with 12 sacks as a team. \nFAST START: Texas A&M quarterback Kyle Allen needs just 48 yards to reach 1,000 this season. Allen is 7-2 as a starter dating back to last season and has won five in a row. Allen completed 21 of 28 passes for a career-high 358 yards with two touchdowns and no interceptions against Arkansas last week. “He should get better, it’s just the progression of things,” Sumlin said. “Think he understands personnel a lot more. Saw that in the fourth quarter and making the right decisions. All that comes with the growth of quarterback.” \nWHERE IS MSU’S RUNNING GAME?: Mississippi State’s teams have earned a reputation for a run-based offense during coach Dan Mullen’s seven-year tenure. But the Bulldogs have just 112 rushing attempts through four games, which is the lowest amount in the league. Part of that is because Prescott has had a good start throwing the ball, but it’s also partly because of an inexperienced offensive line and mediocre production from starting running back Ashton Shumpert, who is averaging just eight carries and 32 yards per game. \n___ \nAP Sports Writer David Brandt contributed to this report. Topics:", "external_links": [], "published": "2015-10-02T17:35:00.000+03:00", "crawled": "2015-10-02T18:28:26.484+03:00", "highlightTitle": ""}