{"organizations": [], "uuid": "cc4ebf4a8947211db1d354635004c8d52f9c70c8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/motorsports", "section_title": "NASCAR / Motors News, Race Results, Schedule, Standings, Photos, Videos - MSN Sports", "url": "http://www.msn.com/en-us/sports/motorsports/dale-jr-i-won%e2%80%99t-retaliate-against-edwards/ar-AAfp0GK", "country": "US", "title": "Dale Jr.: I won’t retaliate against Edwards", "performance_score": 0, "site": "msn.com", "participants_count": 3, "title_full": "Dale Jr.: I won’t retaliate against Edwards", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 4, "uuid": "cc4ebf4a8947211db1d354635004c8d52f9c70c8"}, "author": "Jeff Gluck, USA TODAY Sports", "url": "http://www.msn.com/en-us/sports/motorsports/dale-jr-i-won%e2%80%99t-retaliate-against-edwards/ar-AAfp0GK", "ord_in_thread": 0, "title": "Dale Jr.: I won’t retaliate against Edwards", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Dale Jr.: I won’t retaliate against Edwards USA Today Sports 1 day ago by Jeff Gluck, USA TODAY Sports © Provided by USA Today Sports If you thought Dale Earnhardt Jr. was considering any sort of payback on Carl Edwards for a racing incident Sunday at Charlotte Motor Speedway, you thought wrong.\nAdChoices Earnhardt used his forum on the “Dale Jr. Download” — a weekly podcast on the driver’s Dirty Mo Radio network – to explain to fans why he won’t be retaliating against Edwards.\n“A lot of people want me to go wreck Carl,” he said. “I’m not going to do that, because if I’m trying to wreck Carl, I’m not winning Kansas, I’m not winning Talladega. You can’t go chase after a guy and put him out of the race and accomplish what your goals are. Our goals are to go to those races and win, that’s what we’re going to do.”\nTwo laps prior to the incident, Earnhardt had thrown a big block on Edwards while racing for position. Earnhardt said he didn’t want to give up a spot in the Chase, and was racing hard at that point in the race.\nBut when he tried it again two laps later, Edwards held his ground. The cars made contact and Earnhardt hit the wall, but Earnhardt said it was “both of our responsibility.”\n“We’re not going to worry about Carl or start some (bull) show between me and him,” he said. “It’s over and done.”\nPlus, the driver said, that wasn’t what ruined his day. Earnhardt still had a top-10 car after the Edwards incident and had a chance for a comeback. But when he later slid through oil on the track in the high groove — undetected by NASCAR — he hit the wall harder than at any other point in the race.\nEarnhardt theorized NASCAR missed the oil on the track because Justin Allgaier broke a hose in the front end of the No. 51 car, which sprayed fluid all over the place instead of only dropping a trail of it from underneath the car. NASCAR cleaned the lane where Allgaier was running, but not above it.\nSo when Earnhardt went into the corner to try and avoid the speedy dry material placed where the oil had been, he was in for a surprise.\n“I got into the corner and hit oil — it was like ice — and the car flew into the wall,” he said.\nBut Earnhardt put a positive spin on the unfortunate turn of events, telling his fans his situation would now allow he and his team to be more aggressive — in everything from the setup to how he races. Particularly when it comes to Talladega, he said, the “nothing to lose” attitude could pay off in a big way.\n“These other guys are going to just try to take care of themselves, try to survive,” he said. “A few of us will be out there for blood, trying to claw our way back in. I like being able to race like that. I hate being nervous and worried.”\nHe closed by giving a pep talk to his legion of fans.\n“You can sit there and put it in a negative light and think about how crappy the position you’re in (is), but you’re not going to advance with that attitude,” he said. “You’ve got to go in there thinking about the positives and how you’re in a good place.\n“Shake it off, man. One minute spent worrying about what just happened and being negative is one minute wasted. Let’s get after it.”\nThe full episode can be accessed at http://www.dalejr.com/radio/tdjd/\nFollow Gluck on Twitter @jeff_gluck\nGo to MSN Home", "external_links": ["http://twitter.com/jeff_gluck", "http://www.dalejr.com/radio/tdjd/", "http://www.usatoday.com/sports/", "http://go.microsoft.com/fwlink/?LinkID=286759"], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-15T17:02:21.345+03:00", "highlightTitle": ""}