{"organizations": ["Kings", "Tanner Pearson", "ASSOCIATED PRESS", "Oilers"], "uuid": "2df049de53516a2e755df17dc68b77006377e2c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.greenfieldreporter.com", "main_image": "http://d1bdhkmqqz901h.cloudfront.net/1200x630/smart/cdn1.therepublic.com/smedia/7/d/7dfefd5f712347e4862e548babccc163/web_full_565306607375.jpg", "site_section": "http://greenfieldreporter.com//feed/sec/6000", "section_title": "GreenfieldReporter.com - Sports News", "url": "http://www.greenfieldreporter.com/view/story/7dfefd5f712347e4862e548babccc163/HKN--Kings-Oilers", "country": "US", "title": "Pearson scores late, Kings beat Oilers 3-2", "performance_score": 0, "site": "greenfieldreporter.com", "participants_count": 0, "title_full": "Pearson scores late, Kings beat Oilers 3-2", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T07:34:00.000+02:00", "replies_count": 0, "uuid": "2df049de53516a2e755df17dc68b77006377e2c1"}, "author": "", "url": "http://www.greenfieldreporter.com/view/story/7dfefd5f712347e4862e548babccc163/HKN--Kings-Oilers", "ord_in_thread": 0, "title": "Pearson scores late, Kings beat Oilers 3-2", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Pearson", "Connor McDavid"], "text": "Tanner Pearson scores late, Kings hold off Connor McDavid and Oilers 3-2 THE ASSOCIATED PRESS   26, 2015 - 1:34 amLast Updated: October 26, 2015 - 1:34 am   \nPeople: Photo Gallery: \nClick to view (6 Photos) \nEDMONTON, Alberta — The Los Angeles Kings have officially put a tough start to the season behind them. \nTanner Pearson broke a tie late in the third period with his first goal since breaking his leg last season and the Los Angeles Kings beat the Edmonton Oilers 3-2 on Saturday night for their fifth straight win. \nConnor McDavid nearly tied it for Edmonton with 5.2 seconds left, but Jonathan Quick sprawled to catch his backhander right at the goal line. A replay review upheld the no-goal call. \n\"It happened so fast,\" McDavid said. \"Obviously I'm going to think I scored there in a situation like that... I thought it could have gone in.\" \nPearson's power-play goal put the Kings ahead with 3:26 left. He found the rebound from Jake Muzzin's shot and slapped it past goalie Cam Talbot, helping Los Angeles ease concerns over an 0-3-0 start. \nPearson's score came fewer than 3 minutes after Taylor Hall tied it for Edmonton on the power play following Brayden McNabb's tripping minor. Hall redirected a pass from Ryan Nugent-Hopkins for his third of the season. \n\"When you take a penalty late like that, they give their final push,\" Kings captain Anze Kopitar said. \"They got one, but the character of this team came up again and we got one right back on them. That was huge.\" \nEdmonton has lost two straight and fell to 3-6-0. \n\"It's disappointing, but it was great to see that we didn't give up,\" Oilers forward Ryan Nugent-Hopkins said. \"We just fought back and we came within inches at the end.\" \nKopitar and Jeff Carter also scored for the Kings. Drew Doughty had two assists. \nPearson broke his leg at Winnipeg on Jan. 10 and missed the rest of last season. \nMcDavid set up Benoit Pouliot's first-period goal with an impressive sprint toward the net around a defender. McDavid and Nail Yakupov assisted on the goal, extending each of their point streaks to five games. \nJust over a minute later, Carter banked in a shot off Talbot from behind the goal line. \nKopitar picked the top corner on Talbot during an odd-man rush with 6:24 left in the second. \nEdmonton defenseman Justin Schultz left the game in the second with an undisclosed injury and did not return. \nNotes: It was the first meeting between the two teams this season. Edmonton won both games at home against the Kings last season, but lost the five-game series 3-2 overall. . Matt Hendricks (foot), Jordan Eberle (shoulder) and Griffin Reinhart (undisclosed) were out for Edmonton. . Dwight King (foot) and Matt Greene (upper body) were out for Los Angeles. ... The Kings are in Winnipeg to face the Jets on Tuesday. The Oilers also return to action that night in Minnesota against the Wild. \n ", "external_links": [], "published": "2015-10-26T07:34:00.000+02:00", "crawled": "2015-10-26T07:40:59.021+02:00", "highlightTitle": ""}