{"organizations": ["Giants"], "uuid": "2c136e376473c1f3c395be99430de355ade01fdf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.therepublic.com", "main_image": "http://d1bdhkmqqz901h.cloudfront.net/1200x630/smart/s3.amazonaws.com/hne-smedia/3/3/332278351b174a0bac28b642243e34f5/web_full_636796763220.jpg", "site_section": "http://therepublic.com//feed/sec/6000", "section_title": "Sports News from TheRepublic.com", "url": "http://www.therepublic.com/view/story/332278351b174a0bac28b642243e34f5/FBN--49ers", "country": "US", "title": "Improvement on offense doesn't help 49ers end losing streak", "performance_score": 0, "site": "therepublic.com", "participants_count": 0, "title_full": "Improvement on offense doesn't help 49ers end losing streak", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T08:12:00.000+03:00", "replies_count": 0, "uuid": "2c136e376473c1f3c395be99430de355ade01fdf"}, "author": "", "url": "http://www.therepublic.com/view/story/332278351b174a0bac28b642243e34f5/FBN--49ers", "ord_in_thread": 0, "title": "Improvement on offense doesn't help 49ers end losing streak", "locations": ["San Francisco"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "San Francisco drops fourth straight after defense can't hold off Giants in final minute \nBy TOM CANAVAN - AP Sports Writer Published: 10/12/15 1:12 am EDT - Updated: 10/12/15 1:12 am EDT \nEAST RUTHERFORD, New Jersey — The San Francisco 49ers found their missing offense. They just missed finding the win column again. \nTight end Larry Donnell 's spectacular catch over two 49ers with 21 seconds remaining lifted the Giants past San Francisco 30-27 on Sunday night, sending the Niners to their fourth straight loss. \n\"We've been through some ups and downs and some crazy stuff. We will stay together,\" San Francisco coach Jim Tomsula said. \"There's a very good resolve in the locker room and a group of guys that are made of the right stuff. Let's grab that, hold it tight, and keep going through it.\" \nThe 49ers (1-4) took a 27-23 lead on Carlos Hyde 's 2-yard run by with 1:45 to play, capping a seven-play 80-yard march that quarterback Colin Kaepernick ignited with passes of 25 yards to Torrey Smith and 26 yards to Anquan Boldin . \nAll the 49ers had to do was prevent Eli Manning from driving the Giants (3-2) down the field. It didn't happen. \nManning had a career-best 41 completions in 54 attempts and his perfect throw to Donnell finished off an 82-yard drive with a 12-yard touchdown. He passed for 441 yards and became the winningest quarterback in team history with 102. \n\"This win is special,\" Manning said. \nDonnell was between Antoine Bethea and NaVorro Bowman, two of the 49ers' best defenders, when he leaped to snag the pass in the back of the end zone before falling on his back, the winning catch secured. \n\"That's a tough way to lose,\" Hyde said. \"Battling back and being able to take the lead and then they come up with the late score to win is tough, but there were a lot of good things we did out there.\" \nNew York (3-2) has won three straight and leads the NFC East. \nThere were 20 plays of at least 15 yards in the game, and San Francisco had three on its late drive. Giants running back Shane Vereen had the last long play, a 24-yarder. And Manning, without his best weapon, Odell Beckham Jr. , for much of the final series, engineered his 27th comeback victory in the fourth quarter or overtime. \nKaepernick was 23 of 35 for 262 yards and two touchdowns. \n\"It's good offensively to get in a rhythm like that,\" he said. \"It's something that we can build off moving forward, but we have to win games. That's why we play.\" \nBeckham's speed and moves were too much for the 49ers. He set up New York's first touchdown by using his elusiveness for a 31-yard reception down the middle. His 15-yard catch led to a 17-yard score on which he spun neatly and sped down the left sideline. \nThe touchdown was his last reception; he left with a hamstring injury, something that has plagued his short pro career, and returned only briefly on the winning series. Beckham finished with seven catches for 121 yards a week after he was fined for punching a Bills player in a win at Buffalo. \nAnquan Boldin had eight receptions for 107 yards and a TD for the 49ers. \nBoth teams staged long drives all night. In an opening half filled with field goals, New York had possessions of 76, 81, and 66 yards, San Francisco had a 76-yard series. Aside from Vereen's 2-yard TD reception in the second quarter, though, it was all field goals. Josh Brown made 22- and 41-yarders for the Giants, and Phil Dawson countered from 43 and 22. \nThe 49ers put together another long march, covering 88 yards in the third quarter, with Boldin sparking the drive on a 37-yard catch and run. He finished it with a 3-yard reception from Kaepernick for a 13-13 tie. \nBeckham gave the Giants the lead with his final heroics of the night, only to have San Francisco answer with an 80-yard drive helped by a 28-yard pass-interference call against safety Landon Collins . Garrett Celek capped it with a 5-yard reception. \nThose lengthy series had become more fruitful in the second half, but the Giants had to settle for Brown's 24-yarder with 4:29 remaining for a 23-20 lead. He tied his team record with a 17th consecutive successful field goal, but it left room for the 49ers to rally. \nAnd, ultimately, for the Giants to do the same. \nNew York also lost starting middle linebacker Jon Beason (concussion) and wideout Rueben Randle (hamstring). 49ers RB Reggie Bush was sidelined by a calf problem. \nAP NFL website: http://www.pro32.ap.org and http://www.twitter.com/AP_NFL New York Giants tight end Larry Donnell (84) comes down with a catch for the game-winning touchdown as San Francisco 49ers strong safety Antoine Bethea (41) and inside linebacker NaVorro Bowman (53) defend during the fourth quarter of an NFL football game, Sunday, Oct. 11, 2015, in East Rutherford, N.J. The Giants won 30-27. (AP Photo/Seth Wenig) \nThink your friends should see this? Share it with them! \nStory copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. \nFeedback, Corrections and Other Requests: AP welcomes feedback and comments from readers. Send an email to info@ap.org and it will be forwarded to the appropriate editor or reporter. Photo Gallery: Click to view (6 Photos) We also have more stories about: (click the phrases to see a list) \nCategory:", "external_links": [], "published": "2015-10-12T08:12:00.000+03:00", "crawled": "2015-10-12T09:17:32.403+03:00", "highlightTitle": ""}