{"organizations": [], "uuid": "eb1c44db98933c35de380574c51c48363e5b6d9b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/2/8/161330/World/Region/Syrian-rebels-say-receive-more-weapons-for-Aleppo-.aspx", "country": "EG", "title": "Syrian rebels say receive more weapons for Aleppo battle - Region - World", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Syrian rebels say receive more weapons for Aleppo battle - Region - World - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "eb1c44db98933c35de380574c51c48363e5b6d9b"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/2/8/161330/World/Region/Syrian-rebels-say-receive-more-weapons-for-Aleppo-.aspx", "ord_in_thread": 0, "title": "Syrian rebels say receive more weapons for Aleppo battle - Region - World", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related US wants to avoid 'total destruction' of Syria: Kerry Rocket fire kills eight on Lebanon-Syria border: Security Sources US, allies conduct 18 air strikes in Syria and Iraq: Military Rebels battling the Syrian army and its allies near Aleppo said on Monday they had received new supplies of U.S.-made anti-tank missiles from states opposed to President Bashar al-Assad since the start of a major government offensive last week.\nThe rebels from three groups contacted by Reuters said new supplies had arrived in response to the attack by the army, which is backed up by Russian air strikes and on the ground by Iranian fighters and Lebanon's Hezbollah.\nThe delivery of the U.S.-made TOW missiles to rebels in Aleppo and elsewhere in Syria appears to be an initial response to the new Russian-Iranian intervention. Foreign states supporting the rebels include Saudi Arabia, Turkey and Qatar.\nBut officials from one of the Aleppo-based rebel groups said the supplies were inadequate for the scale of the assault, one of several ground offensives underway with Russian air support.\n\"A few (TOW missiles) will not do the trick. They need dozens,\" said one official, declining to be named due to the political sensitivity of the military support programme.\nA number of rebel groups vetted by states opposed to Assad have been supplied with weapons via Turkey, part of a programme supported by the United States and which has in some cases included military training by the Central Intelligence Agency.\nThese groups fight under the banner of the \"Free Syrian Army\" - a loose affiliation of rebels that do not operate with a centralised command structure and have been widely eclipsed by jihadist groups such as the Nusra Front and Islamic State.\n\"We received more supplies of ammunition in greater quantities than before, including mortar bombs, rocket launchers and anti-tank (missiles),\" said Issa al-Turkmani, a commander in the FSA-affiliated Sultan Murad group fighting in the Aleppo area. \"We have received more new TOWs in the last few days ... We are well-stocked after these deliveries.\"\nTOW missiles are the most potent weapon in the rebels' arsenal. FSA-affiliated groups have also been using TOWs against government forces to fend off another offensive in Hama province, southwest of Aleppo.\nRebels there said last week they had plentiful supplies of the missiles.\nSince the start of the Russian air strikes, ground offensives by the Syrian army and its allies have mostly hit areas controlled by insurgent groups other than Islamic State in parts of western Syria that are crucial to Assad's survival.\n\"LAST THREE DAYS WERE BAD\"\nThe Aleppo offensive is targeting areas a few kilometres (miles) to the south of the city near the highway to Damascus. The army and its allies have captured several villages.\nSyrian state TV said the army had captured the town of al-Sabeqiya south of Aleppo on Monday and said the rebels had suffered heavy casualties.\nSome 3,000 families have fled to other parts of Aleppo province, said Rami Abdulrahman, head of the UK-based Syrian Observatory for Human Rights, which reports on the war using sources on the ground.\nAbdulrahman said at least 41 rebel fighters had been killed. One Aleppo-based rebel group, the Nour al Din al Zinki Brigades, said its military commander was among the dead. His group is one of the recipients of military aid channeled via an operations room in Turkey and is also supplied with TOW missiles.\n\"The battles are underway in a big way on a number of fronts. The last three days were bad. Yesterday (the rebel) forces were able to form an operations room and to distribute zones of operation,\" Hassan al-Haj Ali, head of the rebel Suqour al-Jabal group, told Reuters via the internet.\nGovernment troops and their allies are also trying to advance to the east of Aleppo towards Kweires military airport to break a siege of the base by Islamic State, which controls some parts of Aleppo province, notably to the north of the city.\nAbdulrahman said rebels had hit at least 11 army vehicles with TOW missiles near Aleppo since Friday.\nOne FSA brigade, the Sham Revolutionary Brigades, posted six videos on Saturday showing its fighters targeting army vehicles with wire-guided missiles near Azzan. Videos posted by Sultan Murad showed its men targeting a tank and a bulldozer with TOW missiles near Abtin, captured by the army on Friday.\n\"There are TOWs in the southern Aleppo front but not enough,\" said a second rebel official who declined to be named. \"Yesterday the regime's armoured vehicles were moving freely. We had a shortfall in TOW and the regime APCs were able to move.\"\nThe Observatory reported fresh Russian air strikes on Monday in the southern Aleppo area. Abdulrahman described the fighting as heavy but added that the government side had not made further strategic gains on Monday.\nThe Syrian state news agency said on Monday the rural Aleppo area was one of 49 sites targeted by Russian warplanes, along with rural Damascus, Latakia and Hama.", "external_links": [], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-20T04:20:08.192+03:00", "highlightTitle": ""}