{"organizations": [], "uuid": "da400558748b44e6bd49a2edd781b3b7d8b30562", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.erienewsnow.com", "main_image": "", "site_section": "http://www.erietvnews.com/category/205183/sports?clienttype=rss", "section_title": "ErieTVNews - Sports", "url": "http://www.erienewsnow.com/story/30273981/halfway-point", "country": "US", "title": "Halfway Point", "performance_score": 0, "site": "erienewsnow.com", "participants_count": 1, "title_full": "Halfway Point", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T06:06:00.000+03:00", "replies_count": 0, "uuid": "da400558748b44e6bd49a2edd781b3b7d8b30562"}, "author": "Gary Drapcho", "url": "http://www.erienewsnow.com/story/30273981/halfway-point", "ord_in_thread": 0, "title": "Halfway Point", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Halfway Point - Erie News Now: News, Weather & Sports | WICU 12 & WSEE Member Center: gary.drapcho@wsee.tv \nWe are approaching the halfway point of the college football season so some observations to pass along. \nOhio State has some ugly wins but if last year is any indication, they will be strong by the end of the season and their showdown with Michigan. \nThe Wolverines have really bought into the Jim Harbaugh mentality and may be playing the best overall football in the Big 10 right now. \nGeorgia has averaged about 3 and a half losses a season over the last several years yet for some reason the Bulldogs are always ranked in the top 10 early and then fall like a lead balloon. No different this year. \nA big question mark for me is ...how good is Utah. I though they might be a bit overrated until they picked off Cal's Goff five times in their win. \nLeonard Fournette of LSU has emerged as the Heisman Trophy front runner and right now, I don't think anyone else is close...maybe Boykins of TCU. \nI think Pat Narduzzi is doing some great things at Pitt, most of all, changing the culture there and I expect Pitt to be among the elite again of college football in a few years. \nToo bad Delton Williams of Prep had some off-the-field problems at Michigan State. They don't have a feature back yet and Williams could have been that player had he kept his nose clean. \nGot a kick out of Nick Saban of Alabama being offended that the media questioned how good his team is he went off on them....c'mon Nick....go prove it on the field and not take your frustrations out on the media. We don't block or tackle or pass or run. \nLet the second half of the season begin !!!", "external_links": [], "published": "2015-10-16T06:06:00.000+03:00", "crawled": "2015-10-20T07:49:59.088+03:00", "highlightTitle": ""}