{"organizations": ["Washington State Cougars", "Cougs", "Arizona Wildcats"], "uuid": "f2dd96558ff6a9a39f7577bb51d89303f0d03794", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.krem.com", "main_image": "http://cdn.tegna-tv.com/-mm-/5c2d10bcc8058480e2db791d4aa6e8c9c037fc88/c=0-12-593-347&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/25/KREM/KREM/635814039345873019-Cougs-Team.jpg", "site_section": "http://rssfeeds.krem.com/_/20/109702282/krem/sports", "section_title": "KREM - Sports", "url": "http://www.krem.com/story/sports/ncaa/wsu/2015/10/25/cougs-pac-12/74604784/", "country": "US", "title": "Five reasons why the Cougs are so dangerous", "performance_score": 0, "site": "krem.com", "participants_count": 0, "title_full": "Five reasons why the Cougs are so dangerous", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T03:14:00.000+02:00", "replies_count": 0, "uuid": "f2dd96558ff6a9a39f7577bb51d89303f0d03794"}, "author": "", "url": "http://www.krem.com/story/sports/ncaa/wsu/2015/10/25/cougs-pac-12/74604784/", "ord_in_thread": 0, "title": "Five reasons why the Cougs are so dangerous", "locations": ["Arizona", "Arizona Stadium", "TUCSON", "AZ", "Tucson"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Petersen", "Evan Closky", "Luke Falk", "Kyle Sweet", "Kyrin Priester", "Priester"], "text": "Five reasons why the Cougs are so dangerous Evan Closky provides five reasons why the Cougs are so dangerous right now. Post to Facebook Five reasons why the Cougs are so dangerous Evan Closky provides five reasons why the Cougs are so dangerous right now. Check out this story on KREM.com: http://on.krem.com/1S55Zxm Cancel Send A link has been sent to your friend's email address. Posted! A link has been posted to your Facebook feed. Join the Conversation To find out more about Facebook commenting please read the Conversation Guidelines and FAQs Five reasons why the Cougs are so dangerous KREM2 sports reporter Evan Closky explains five reasons why the Cougs are a dangerous team right now. Evan Closky, KREM2 Sports Reporter 6:14 p.m. PDT October 25, 2015 TUCSON, AZ - OCTOBER 24: Quarterback Luke Falk #4 (L) and wide receiver Kyle Sweet #83 of the Washington State Cougars congratulate Kyrin Priester #1 after Priester scored a second quarter touchdown reception against the Arizona Wildcats during the college football game at Arizona Stadium on October 24, 2015 in Tucson, Arizona. (Photo: Christian Petersen) CONNECT TWEET LINKEDIN COMMENT EMAIL MORE \nThe Washington State football team is on a roll right now. The Cougs have won three straight conference games, the team is averaging a total of 47 points during that stretch and are receiving votes in both the Associated Press and Coaches' Poll. The team is firing on all cylinders, but what's working? Why are the Cougs looking this good? \nI have five answers for you as the team enters its biggest game in the Mike Leach era against No. 8 Stanford at Martin Stadium Saturday night. \n1. Falk in the First Half \nFirst and foremost, we have to give props to the signal caller Luke Falk. He's not only been dominant, but he's been lethal in the first half. Since the Oregon game, the man has only thrown 23 incomplete passes on 112 attempts. He's chucked the ball for 938 yards with 12 touchdowns and no interceptions. You cannot do much better than that. By the way, just to put that in perspective, only 36 other quarterbacks in the country have more passing touchdowns than Falk in those six quarters. \n2. On the Marks \nPart of Falk's overall success can be attributed to the play of junior wide receiver Gabe Marks. Man, it has to be nice having this guy back on the field. He's averaging more than 14 yards a catch in these past three games with 303 receiving yards and seven touchdowns. Marks is on pace for more than 1,200 receiving yards this season. I can&#39;t lie, I&#39;m jealous I didn&#39;t get to play with Gabe my senior year. As a qb you love playing with guys that care THAT much about fball — Connor Halliday (@c_halliday12) October 24, 2015 \n3. Ground-and-Pound...sort of. \nPULLMAN, WA - SEPTEMBER 19: Keith Harrington #24 of the Washington State Cougars carries the ball against the Wyoming Cowboys in the second half at Martin Stadium on September 19, 2015 in Pullman, Washington. Washington State defeated Wyoming 31-14. (Photo: William Mancebo) \nRounding out the offense, how can I not talk about the ground game. WSU's ability to run the ball gives Falk and the passing offense a much easier time through the air. The combination of Keith Harrington, Jamal Morrow and Gerard Wicks have rushed for more than 100 yards the past three games. This group has already logged 638 yards on the ground this season. With 57 more yards, the group will be the most successful rushing attack during the Mike Leach era. The three-headed monster has also accounted for more than 1,000 yards of total offense when you factor in their ability to get involved through the air. \n4. Fourth-and-No \nOn the other side of the ball, defensive coordinator Alex Grinch has done a great job managing this group in his first year at Washington State. The ability to stop teams on fourth down has been tremendous all season long, but has really flourished in the past few games limiting Oregon, Oregon State and Arizona to just three first downs on nine attempts. Last week, Leach called fourth down stops turnovers, so those are huge numbers to say the least. \n5. Shalom on the Scene \nFinally, to get more specific, safety Shalom Luani has become a household name for Coug fans. He has led the team in tackles for the past three weeks racking up 27 tackles along with three interceptions. He is a hawk out there. Leach says he plays so quick and now that he's understanding the defensive schemes a little bit more, he's not only playing quickly, but now certainly dangerously. \nBelow is sports director Darnay Tripp's story on Luani's impact: Luani is the Cougs' hardest hitter, and has made big plays each of the last two weeks. \nLet's see if all these pieces can come together for that 7:30 kickoff against Stanford on Halloween night. Read or Share this story: http://on.krem.com/1S55Zxm TOP VIDEOS", "external_links": [], "published": "2015-10-26T03:14:00.000+02:00", "crawled": "2015-10-26T03:28:48.736+02:00", "highlightTitle": ""}