{"organizations": [], "uuid": "92438df3896ebf718621fc1b5e70b74fae61453f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-56251519/turbine/bs-sp-terps-football-coach-search-1020-20151019", "site_section": "http://www.chicagotribune.com/services/chi-ct-college-rss,0,2899820.hyperlink", "section_title": "College Sports - Chicago Tribune", "url": "http://www.chicagotribune.com/sports/college/bs-sp-terps-football-coach-search-1020-20151019-story.html", "country": "US", "title": "Terps have high-level competition in search for football coach", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Terps have high-level competition in search for football coach", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T14:00:00.000+03:00", "replies_count": 0, "uuid": "92438df3896ebf718621fc1b5e70b74fae61453f"}, "author": "Don Markus", "url": "http://www.chicagotribune.com/sports/college/bs-sp-terps-football-coach-search-1020-20151019-story.html", "ord_in_thread": 0, "title": "Terps have high-level competition in search for football coach", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Don Markus and Daniel Gallen) \n\"All of those guys are guys that people think will be good coaches at major programs,\" Mandel said. \"It's not like when Illinois hired Tim Beckman [who was fired before the 2015 season after three years]. I thought that was very underwhelming at the time. There's a group of candidates this year that's particularly strong.\" \nSports Illustrated senior writer Pete Thamel, who was highly critical of the way Anderson handled the firing of Edsall, doesn't believe that Maryland has much allure to someone like Philadelphia Eagles' coach Chip Kelly or another proven big-name coach. \n\"I have a hard time buying Maryland as a destination job,\" Thamel said. \"It's the fifth-best job in the Big Ten East and there's limited history [of success] and it's kind of stuck in a weird netherworld of what it is and what it wants to be. \n\"There's a lot of 'When the [indoor] facility gets built and when the Big Ten money comes.' It is still a tough sell as an elite job immediately. It could be a good job in five years, but for an established coach to go there now, there's some risk involved.\" \nThamel doesn't buy the notion that Maryland can be sold as the next Oregon based on its connection to Under Armour CEO and founder Kevin Plank, who played football in College Park. The Ducks became a national power under Kelly, with the financial support of Nike founder and Oregon alum Phil Knight. \n\"Let's not forget they just didn't sprinkle some money on Oregon and it became a national contender overnight,\" Thamel said. \"It took years of steady, slow building by Mike Bellotti and one great hire in Chip Kelly to kind of push them over the top. That was a 10-year process. It's not a build that the people of the Snapchat and Twitter generation would like to endure.\" \nThamel said that Maryland trying to rebuild in the Big Ten East is similar to what Mississippi State has done in the Southeastern Conference West Division and what Arkansas is trying to do. \n\"Mississippi State did it, but it took Dan Mullen six years,\" Thamel said. \"It's going to take time. Kevin Anderson already has one bad hire, one hire that clearly didn't work out. It's going to take someone a long time to turn that corner there.\" \nMandel doesn't believe that Maryland will go after a high-profile coordinator such as Oregon's Scott Frost given the fact that the school will likely have approval to double Edsall's package of $2.1 million a year. \n\"It's become harder for Power 5 schools to justify hiring a coordinator; that used to be a pretty common path,\" Mandel said. \"Given how much money these guys make, it's a lot riskier now. The new path seems to be to become a head coach at a Group of 5 school and that becomes the springboard [for a Power 5 school].\" \ntwitter.com/sportsprof56 \nCollege football jobs \nHere is a look at the openings and how the Terps stack up in the pecking order. \nSOUTHERN CAL: The Trojans have been a revolving door ever since Pete Carroll left for the NFL five years ago. Things started well for former assistant Lane Kiffin, who went 18-7 his first two seasons. After USC finished fifth in the final regular season poll in 2011 and was ranked No. 1 in the preseason poll in 2012, Kiffin was fired five games into the 2013 season. \nAssistant Ed Orgeron was named interim coach and led USC to a 6-2 record, but his chances of being hired permanently were damaged by a blowout defeat to crosstown rival UCLA. Enter Steve Sarkisian, another former Carroll assistant, who had done reasonably well at Washington (34-29 in five seasons) and went 9-4 his first year at USC. He was fired five games into the season amid erratic behavior and appearing intoxicated at an athletic department fundraising event. \nNow, with Sarkisian out, athletic director Pat Haden (if he doesn't get fired for not properly vetting Sarkisian) could make a push for former Oregon coach Chip Kelly if things blow up in Philadelphia. But one unnamed coach told Travis Haney of ESPN that Maryland has a better chance of landing Kelly than USC. \nCollege football analyst Phil Steele agrees, saying that USC has traditionally run a pro-style offense and \"I don't know if Kelly would be interested in the switch to an offense like that.\" \nAny coach who wants a chance to win a national championship will pick the Trojans over just about any school currently looking to make a move. The Trojans have won 11 national titles, but none since 2004. Given the fact that Haden, the former star quarterback, could be on his way out after the Sarkisian fiasco, there is some risk in taking up office space in Heritage Hall. \nSOUTH CAROLINA: It took two coaches with outsized personalities to make the Gamecocks relevant. While the success was short-lived with Lou Holtz, who had two good years in the six seasons he spent in Columbia before retiring to the TV booth, Steve Spurrier never had a losing season, including three straight years with 11 wins, until starting off 2-4 this year and calling it quits. \nThe Gamecocks have a great stadium and a dedicated fan base, but they are now clearly the No. 2 team in the state behind Clemson, in the bottom half of the SEC and losing ground. Though Maryland doesn't come close in terms of comparing Byrd Stadium to Williams-Bryce Stadium and a pro-leaning fan base to any in the SEC, the Terps could be more attractive to some coaches. \nSteele isn't so sure. \n\"Coming off of three double-digit win seasons if Spurrier were to step down at that point, I think it would have been more attractive,\" Steele said. \"But I think it's less of a climb in the SEC East than it will be for Maryland in the Big Ten.\" \nVIRGINIA: Mike London looks like he is finally on his last legs in Charlottesville. It's been four years since he had his only winning season with the Cavaliers and his record (25-42) is even worse than Edsall's. \nThe Virginia job is similar to Maryland in the fact that it's always been a basketball school and Tony Bennett has it going in the same direction as Mark Turgeon seems to be heading. Scott Stadium is marginally bigger than Byrd and the school's fan base is just about as fickle. \nAs for competing for its next coach, Maryland could be better positioned financially because of its league affiliation and connection to Under Armour. Also a plus for the Terps is the fact that whoever gets the job will be inheriting a better recruiting class, including four-star quarterback Dwayne Haskins Jr. \n\"The key to that Maryland job being good is controlling that D.C.-Baltimore corridor in recruiting,\" said Sports Illustrated senior writer Pete Thamel. \"The thing that makes that job tempting is that there's enough natural talent there, and if you can harness all that, you can really win there. But it's easy to say that; nobody's really done it.\"", "external_links": [], "published": "2015-10-20T14:00:00.000+03:00", "crawled": "2015-10-22T06:22:07.532+03:00", "highlightTitle": ""}