{"organizations": [], "uuid": "ba794b4530462f92ff79d84b31c9221573bdb44a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.postsouth.com", "main_image": "http://www.postsouth.com/storyimage/LA/20151009/NEWS/151009841/AR/0/AR-151009841.jpg", "site_section": "http://www.postsouth.com/sports?template=rss&mime=xml", "section_title": "Sports - Plaquemine Post South - Plaquemine, LA", "url": "http://www.postsouth.com/article/20151009/NEWS/151009841/2000/NEWS?rssfeed=true", "country": "US", "title": "Monday-morning agents", "performance_score": 0, "site": "postsouth.com", "participants_count": 1, "title_full": "Monday-morning agents", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T17:00:00.000+03:00", "replies_count": 0, "uuid": "ba794b4530462f92ff79d84b31c9221573bdb44a"}, "author": "Kyle Riviere", "url": "http://www.postsouth.com/article/20151009/NEWS/151009841/2000/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "Monday-morning agents", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Follow @@kyleR_sports Posted Oct. 9, 2015 at 9:00 AM The media is at it again. They've put down their pens and microphones and decided to moonlight as sports agents. They clearly know what's best for the well-being and future of a 20-year-old college athlete. You'd swear they're fighting for money that's going to somehow end up in their pockets. For much of last week, many analysts in the sports world jumped on the \"Leonard Fournette should skip his junior year\" bandwagon. It's so crowded now that it has created a safety hazard. Fournette's sensational start to 2015 has captivated the college football world far beyond Baton Rouge. He has fans, coaches and all-time greats singing his praises and comparing him to legends like Herschel Walker, Bo Jackson, Eric Dickerson, Jim Brown and Adrian Peterson. Walker--who I and many others consider the greatest college football player of all time--even came out and said that Fournette is better than he ever was at Georgia. NFL Draft guru Mel Kiper Jr. has said that if Fournette was eligible for the 2016 draft, he would be the No. 1 overall pick. However, Fournette is not eligible. He is just a true sophomore that isn't even two years removed from his high-school graduation. You have to be at least three years removed to play in the NFL. Any logical person would just assume that Fournette would play out this monster sophomore season, and hopefully, have an even bigger year in 2016-17, before choosing to forgo his senior year for the draft. Unfortunately, there wasn't much logical thought going on last week. Many came out and said that this needs to be Fournette's final season at LSU. Instead of playing one more year in 2016-17, he should just give up playing football for an entire season. He should dessert his teammates and shut it down; he should lay back and rest his legs while his colleagues fight for wins in Tiger Stadium. They think Fournette would be better served taking the entire year off from football, rest up his body and avoid injuries so he can be a guaranteed No. 1 pick in the 2017 NFL Draft. I think the idea is entirely ridiculous. Football players play football. They don't take year-long vacations to avoid injuries that might not have even happened if they had played. Other than possibly making a few extra bucks, what are the benefits to sitting out? It will not make Fournette a better player. In fact, it will do just the opposite. Being out of the game for an entire year, it will take him a while to re-adjust to the speed of the game once he gets to the NFL. Not being tackled for an entire year, that will only make him more susceptible to injuries once he gets to the league. Page 2 of 2 - How will NFL GMs and even future teammates look at a guy that valued himself over his fellow Tigers and quit the sport he supposedly loves for an entire season? These are the factors that the Monday-morning agents conveniently glossed over. I'm not surprised. The same ones that are saying this now, they were saying the same thing about Jadeveon Clowney after his sophomore season at South Carolina. All people care about is money these days. Love of the game, love of teammates, logic--it all takes a back seat to that magical money train. What they don't understand is that, to some people, money isn't everything. I don't know him personally, but from what I've seen over the past two seasons, Fournette seems like one of those people. He's humble, he's grounded, he doesn't thirst for fame and attention, he loves his teammates and he loves being a student athlete at LSU. Upon this firestorm of analysts looking out for his future, Fournette sent out this cryptic tweet during the week: \"I will never jump ship...I'm drowning with my brothers.\" Why should Fournette worry that an injury in his junior season will drop him like a brick in the draft and lose him millions of dollars? Did you see what happened to Todd Gurley this year? In his junior season at Georgia, Gurley missed multiple games with a suspension, and then tore his ACL. Did this deter NFL GMs from having interest? Nope. Despite the injury and despite missing most of the season, he was still drafted at No. 10 overall. Talent doesn't go unnoticed. Everyone knows the tools Fournette brings to the table. They know he is a phenomenal player. They know he's a high-quality young man with zero off-the-field issues. Even if--God forbid--he did suffer a season-ending injury next season, I have no doubt that a team would still take a chance on him in the top 10. For now, why don't we stop trying to play Drew Rosenhaus and allow Fournette to enjoy football? Why don't we back off and let him enjoy life as a college kid?", "external_links": [], "published": "2015-10-09T17:00:00.000+03:00", "crawled": "2015-10-15T12:07:45.888+03:00", "highlightTitle": ""}