{"organizations": [], "uuid": "68212b5e23761638cbb66044829388456ba1f422", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/f011c6f49a6e5fdc9ae5e08cf1ffa6fe.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/rugby/penalty-try-proves-decisive-as-wasps-sink-bath/6983964/", "country": "JE", "title": "Penalty try proves decisive as Wasps sink Bath", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "Penalty try proves decisive as Wasps sink Bath", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T18:17:00.000+03:00", "replies_count": 0, "uuid": "68212b5e23761638cbb66044829388456ba1f422"}, "author": "", "url": "http://www.sport.co.uk/rugby/penalty-try-proves-decisive-as-wasps-sink-bath/6983964/", "ord_in_thread": 0, "title": "Penalty try proves decisive as Wasps sink Bath", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Penalty try proves decisive as Wasps sink Bath 24 Oct 2015 15:17:00 \ncomments \nA second-half penalty try proved decisive as Wasps secured their first win of the Aviva Premiership season with a hard-fought 16-9 victory over Bath. \nAfter a tryless first half which saw Wasps go into the break 6-3 to the good, the game hinged on a key moment before the hour mark. \nBath scrum-half Nikola Matawalu pulled back Nathan Hughes as the number eight chased a charge-down over the try line and, after lengthy consultation with his television match official, referee Craig Maxwell-Keys awarded a penalty try and sent the Fijian to the sin bin. \nWith their scrum-half in the sin bin, Bath could only watch on as Jimmy Gopperth added the conversion and a third penalty to effectively seal the victory. \nLate on George Ford slotted two penalties to claim a losing bonus point for last year's runners-up but they could not get close enough to grab what would have been their fourth win in a row on their travels. \nAfter defeat to Harlequins in their first game of the season, Wasps returned to the Ricoh Arena keen to kick-start their season. \nTom Homer missed an early long-range penalty for the visitors but in a first half low on quality it was Wasps who came the closest to the game's first try. \nChristian Wade hared clear down the right wing early on, chipped ahead and was only denied the game's first try by an unlucky bounce. \nA few minutes later Joe Simpson went clear under the posts but was called back for an accidental offside. \nGopperth kicked two penalties to Ford's one heading into the interval, with Elliot Daly also coming close to the first try when he broke the line but opted to chip when it probably would have been better to keep the ball in hand. \nAfter the break Gopperth missed two penalties as Wasps appeared unable to make their dominance count. \nDefences were on top and it was ironic that when the game's only try did arrive, it was after a superb passage of Bath defence. \nStuck on their own try line, Mike Ford's troops had shown real bravery and organisation to rebuff the Wasps advances but, having finally secured the turnover, Matawalu's clearing kick was charged down and the scrum-half pulled back Hughes while he chased after the loose ball. \nThe penalty try was awarded and Bath found themselves 13-3 and a man down. \nIn their reshuffled back line, Ford moved to scrum-half with replacement Rhys Priestland - on for Kyle Eastmond - at fly-half but it was their forwards who struggled. \nOn the hour mark Gopperth then added a third penalty after the Wasps scrum turned the screw. \nIn the final quarter Ford slotted two penalties to bring them back within a score, but Wasps held firm to claim a deserved victory. Related Sport News", "external_links": [], "published": "2015-10-24T18:17:00.000+03:00", "crawled": "2015-10-25T20:24:52.179+02:00", "highlightTitle": ""}