{"organizations": [], "uuid": "0ee5a11e90cdf3c78bfabf30a6f4c2b2e6f305c0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.denverpost.com", "main_image": "http://extras.mnginteractive.com/live/media/site36/2015/1013/20151013__frontier_dp~p1.jpg", "site_section": "http://www.denverpost.com/", "section_title": "Colorado Breaking News, Sports, Weather, Traffic, Jobs - The Denver Post", "url": "http://www.denverpost.com/business/ci_28962549/frontier-lease-cut-okd-by-city-committee-airline", "country": "US", "title": "Frontier Airlines' plan to return 6 gates at DIA OK'd by Denver committee", "performance_score": 0, "site": "denverpost.com", "participants_count": 7, "title_full": "Frontier Airlines' plan to return 6 gates at DIA OK'd by Denver committee - The Denver Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T19:18:00.000+03:00", "replies_count": 6, "uuid": "0ee5a11e90cdf3c78bfabf30a6f4c2b2e6f305c0"}, "author": "Laura Keeney", "url": "http://www.denverpost.com/business/ci_28962549/frontier-lease-cut-okd-by-city-committee-airline", "ord_in_thread": 0, "title": "Frontier Airlines' plan to return 6 gates at DIA OK'd by Denver committee", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Denver City Council's Business Development Committee on Tuesday unanimously approved an amendment to Frontier Airlines' Denver International Airport lease, allowing it to reduce its gates to eight from 14.\n\"More importantly, this project allows (Frontier) to consolidate future operations and (allows us to) move other carriers around the facility,\" DIA's senior vice president Mukesh Patel told the committee.\nThe deal now must be OK'd by the full city council.\nFreeing up the gates, all in concourse A, will allow the airport to move Delta Air Lines — which has increased its capacity at DIA by 19.3 percent — from concourse C by late spring, Patel said.\nPatel said Frontier will reimburse the city for the Delta move to the A concourse, but did not say how much the shift would cost.\nIt will also allow the airport to make improvements to the concourses — including upgrades to passenger areas and bridgeways — airlines are shifted around, Patel says.\nThe six-gate reduction, which will be completed in January, returns 10,950 square feet of space to DIA, and lops $3 million off the annual gate-rental fees Denver-based Frontier pays the airport, cutting its bill to $27.4 million, according to documents filed with the city.\nThe gate reduction is the latest in a series of changes the Denver-based airline has made to \"right-size\" its operations at DIA, decentralizing from a Denver hub and offering more point-to-point flights.", "external_links": [], "published": "2015-10-13T19:18:00.000+03:00", "crawled": "2015-10-14T02:05:02.862+03:00", "highlightTitle": ""}