{"organizations": [], "uuid": "f3bd0103e30844ce8c8087f70524669db9645164", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtontimes.com", "main_image": "", "site_section": "http://www.washingtontimes.com/rss/headlines/sports/", "section_title": "www.washingtontimes.com stories: Sports", "url": "http://www.washingtontimes.com/news/2015/oct/16/nothing-to-choose-between-ireland-pumas-in-rwc-qua/", "country": "US", "title": "Nothing to choose between Ireland, Pumas in RWC quarterfinal", "performance_score": 0, "site": "washingtontimes.com", "participants_count": 1, "title_full": "Nothing to choose between Ireland, Pumas in RWC quarterfinal", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T00:03:00.000+03:00", "replies_count": 0, "uuid": "f3bd0103e30844ce8c8087f70524669db9645164"}, "author": "STEVE DOUGLAS", "url": "http://www.washingtontimes.com/news/2015/oct/16/nothing-to-choose-between-ireland-pumas-in-rwc-qua/", "ord_in_thread": 0, "title": "Nothing to choose between Ireland, Pumas in RWC quarterfinal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Nothing to choose between Ireland, Pumas in RWC quarterfinal By STEVE DOUGLAS -   \nCARDIFF, Wales (AP) - It remains one of the perplexing anomalies of the Rugby World Cup. \nHow, in seven editions, has a nation as rich in rugby history as Ireland never advanced beyond the quarterfinals? \nThere’s myriad reasons - bad luck, bad planning, and some bad performances - but 2015 has been viewed for some time as the year that record should come to an end. \nIf the two-time reigning Six Nations champions thought winning all their pool games and avoiding the All Blacks in the quarterfinals meant an easy route to the last four, though, they’d better think again. \nIn Argentina, Ireland has a quarterfinal opponent which can now be legitimately be bracketed among the powers of world rugby. Playing annually against the southern hemisphere heavyweights in the Rugby Championship since 2012 has given the Pumas more experience of top-level rugby and forced them to develop a more balanced, all-round game than simply relying on traditional forward power. \nIreland would still have been regarded as the slight favorite at Millennium Stadium - it has beaten Argentina in the last five meetings - but events over the past week mean the outcome is a lottery. \nWhile Argentina’s top players rested on the last weekend of the pool stage, Ireland was involved in a brutal Pool D decider against the French. Time will tell if it was a pyrrhic victory. \nCaptain Paul O’Connell and flanker Peter O’Mahony sustained tournament-ending injuries and powerhouse flanker Sean O’Brien received a suspension for a forearm swing into Pascal Pape’s midriff. That’s three key forwards out of contention in a matter of days. \nRelief arrived Friday when star flyhalf Jonny Sexton was declared available after a groin problem, but doubts remain whether he is 100 percent fit. First-choice center Jared Payne was also ruled out of the tournament last weekend. \nThen there’s the teams’ history in the World Cup. \nThe Argentines have already beaten Ireland twice in virtual elimination matches - a quarterfinal playoff in 1999 and then a pool-stage decider in 2007. In their only other World Cup meeting, Ireland squeezed to a 16-15 win in 2003. \n“I know Ireland has European teams (for a rivalry), but for us it has become a nice challenge, a great derby,” Argentina center Juan Martin Hernandez said. “These games, they are derbies.” \nAdvancing further than Irish greats like Keith Wood and Brian O’Driscoll ever did brings its own pressures for Ireland’s class of 2015. New Zealand and France are also playing in Cardiff this weekend, but green was the dominant color in the Welsh capital on Friday. \nIreland’s players said they’d never experienced an atmosphere like the game against France last week, also played under the Millennium Stadium roof, and it’s sure to be a similar sea of green on Sunday. \nIn Joe Schmidt, Ireland has a canny coach whose calculated approach will calm the nerves. Schmidt plans for all eventualities and the loss of his captain and best two flankers likely won’t knock him off course. Replacement flankers Jordi Murphy and Chris Henry will slip into a system the whole squad knows well, and Schmidt even said they will bring added vitality to the group.", "external_links": [], "published": "2015-10-17T00:03:00.000+03:00", "crawled": "2015-10-17T01:34:03.196+03:00", "highlightTitle": ""}