{"organizations": [], "uuid": "ff90ce02deb23898cce6ed3eac447b1ea82bcbe4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cincinnati.com", "main_image": "http://www.gannett-cdn.com/-mm-/04ac46cc1c6c0a6a2773eab9b52483362504aee2/c=0-0-2541-1436&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/07/Cincinnati/Cincinnati/635798515680794441-100715-CAVS-HAWKS-0250.jpg", "site_section": "http://rssfeeds.cincinnati.com/cincinnati-sports", "section_title": "Cincinnati - Sports", "url": "http://www.cincinnati.com/story/sports/2015/10/07/hawks-defeat-cavalier-preseason-opener/73556568/", "country": "US", "title": "Hawks defeat Cavaliers in preseason opener", "performance_score": 0, "site": "cincinnati.com", "participants_count": 0, "title_full": "Hawks defeat Cavaliers in preseason opener", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T08:18:00.000+03:00", "replies_count": 0, "uuid": "ff90ce02deb23898cce6ed3eac447b1ea82bcbe4"}, "author": "", "url": "http://www.cincinnati.com/story/sports/2015/10/07/hawks-defeat-cavalier-preseason-opener/73556568/", "ord_in_thread": 0, "title": "Hawks defeat Cavaliers in preseason opener", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Hawks defeat Cavaliers in preseason opener Mike Dyer , mdyer@enquirer.com 1:18 a.m. EDT October 8, 2015 Buy Photo Cleveland Cavaliers forward LeBron James is introduced prior to the prereason NBA basketball game between the Atlanta Hawks and the Cleveland Cavaliers at Cintas Center. The Enquirer/Kareem Elgazzar The Cavaliers' cheerleaders entertain the crowd prior to the game. The Enquirer/Kareem Elgazzar The Cavaliers' cheerleaders entertain the crowd prior to the game. The Enquirer/Kareem Elgazzar Cleveland's LeBron James rises for a jump shot in the first quarter. The Enquirer/Kareem Elgazzar Cleveland's Timofey Mozgov dunks in the first quarter. The Enquirer/Kareem Elgazzar Cleveland's LeBron James drives to the basket in the first quarter. The Enquirer/Kareem Elgazzar Cleveland's Anderson Varejao shoots a hook shot in the first quarter.. The Enquirer/Kareem Elgazzar Cleveland's Sasha Kaun drives to the basket in the first quarter. The Enquirer/Kareem Elgazzar Atlanta's Mike Scott and Cleveland's Sasha Kaun battle for a loose ball. The Enquirer/Kareem Elgazzar Cleveland's Richard Jefferson rises for a shot in the first quarter. The Enquirer/Kareem Elgazzar Cleveland's LeBron James drives and passes in the first quarter. The Enquirer/Kareem Elgazzar Cleveland's LeBron James drives to the basket in the second quarter. The Enquirer/Kareem Elgazzar Cleveland's LeBron James is unable to finish an alley-oop in the second quarter. The Enquirer/Kareem Elgazzar Cleveland's LeBron James jumps for an offensive rebound in the second quarter. The Enquirer/Kareem Elgazzar The Cavaliers break-dancing group performs during halftime. The Enquirer/Kareem Elgazzar Cleveland's Quinn Cook drives to the basket on Atlanta's Tim Hardaway Jr. in the first quarter. The Enquirer/Kareem Elgazzar Buy Photo Atlanta's Paul Millsap tips the ball out of Cleveland guard Matthew Dellavedova's hands in the second quarter. The Enquirer/Kareem Elgazzar Fullscreen Buy Photo From left: Boxer Floyd Mayweather, Bengals defensive lineman Wallace Gilberry, wide receiver Greg Little, linebacker Vontaze Burfict and cornerback Adam Jones socialize during halftime. The Enquirer/Kareem Elgazzar Bengals linebacker Vontaze Burfict watches the game. The Enquirer/Kareem Elgazzar Bengals defensive lineman Wallace Gilberry points toward the sideline during the game. The Enquirer/Kareem Elgazzar Boxer Floyd Mayweather watches the game/ The Enquirer/Kareem Elgazzar Fullscreen Buy Photo Cleveland Cavaliers guard J.R. Smith, left, and forward LeBron James congratulate forward Richard Jefferson after he dunked in the fourth quarter. The Enquirer/Kareem Elgazzar J.R. Smith, left, and forward LeBron James (23), congratulate teammate Richard Jefferson. The Enquirer/Kareem Elgazzar Atlanta center Walter Tavares dunks in the fourth quarter. The Enquirer/Kareem Elgazzar Fullscreen Buy Photo Hawks guard Shelvin Mack, left, shakes hands with a teammate after exiting the game in the fourth quarter. The Enquirer/Kareem Elgazzar Fullscreen Buy Photo LeBron James points toward the bench where Boxer Floyd Mayweather, Bengals wide receiver Greg Little and linebacker Vontaze Burfict were sitting. The Enquirer/Kareem Elgazzar Boxer Floyd Mayweather smiles toward the Atlanta Hawks coming off the court after the game. The Enquirer/Kareem Elgazzar Fullscreen Buy Photo Kyle Korver, seen hugging Floyd Mayweather at the end of the game, also made his return to Cintas Center. The Enquirer/Kareem Elgazzar LeBron James talks with a young fan in the third quarter. The Enquirer/Kareem Elgazzar Bengals defensive end Carlos Dunlap, left, and Reds center fielder Billy Hamilton watch the game. The Enquirer/Kareem Elgazzar Boxer Floyd Mayweather shows his friends a photo on his phone. The Enquirer/Kareem Elgazzar Like this topic? You may also like these photo galleries: Replay Cleveland forward LeBron James drives to the basket in the second quarter. (Photo: The Enquirer/Kareem Elgazzar) Buy Photo 46 CONNECT 5 TWEET 1 LINKEDIN COMMENT EMAIL MORE \nCintas Center transformed into celebrity central Wednesday night. \nNot only did LeBron James start for the second straight year in the Cleveland Cavaliers' preseason game at Xavier, but he added some pizzazz with the fans in the second half. \nJames sat on the scorer's table during a break in the action in the third quarter and took a selfie with some young fans - drawing loud cheers from the crowd. The photo was quickly tweeted by Fox Sports Ohio. \n\"The refs were looking at a play and we had time in between,\" James said. \"Just being cordial with the fans. Like I said (Wednesday morning) these guys (in Cincinnati) don't get an opportunity to see us all the time. It just popped into my head.\" \nBut, that was just part of the fun for the Cavs' first preseason game in this 2015-16 campaign. \nFloyd Mayweather arrived at approximately 8 p.m. and sat near the Cavs bench. A few Cavs players said hello during a timeout in the second quarter. \nMayweather was surrounded by photographers at halftime. He was shown smiling on the video board with 2:56 left in the third quarter on the Cavaliers' \"Flex Cam.\" \nA minute later, it was Bengals cornerback Adam Jones on the video board drawing loud cheers from the sold-out crowd of 10,250. Jones obliged fan requests for photos and autographs throughout the game as he sat courtside. \nOther Bengals at the game included defensive end Wallace Gilberry, linebacker Vontaze Burfict and wide receiver Greg Little. Reds center fielder Billy Hamilton was also in attendance. \nOh, there was a game too. \nThe Hawks defeated the Cavs 98-96 in the first preseason game of the year for both teams. Cavs coach David Blatt and the Cavs players put the game in perspective afterward and warned not to read too much into it. Cleveland coach David Blatt talks about Wednesday's loss. \n\"We had 28 assists so obviously the ball was moving,\" Blatt said. \"The guys played hard. I thought they played right. And for us, that was a pretty good game as we plan minutes-wise. We did what we wanted to do.\" \nAtlanta guard Jeff Teague had a game-high 17 points for the Hawks. Al Horford added 15 and Kent Bazemore had 12. \nGuard J.R. Smith had a team-high 15 points for the Cavs. He also had four rebounds, four assists and two blocks. Timofey Mozgov added 13 points and five rebounds. \nReserve Austin Daye added 12 points for the Cavs. \nJames had eight points, seven rebounds and five assists. \nThe talk of the Cavs' locker room immediately after the game was 35-year-old Richard Jefferson's dunk near the end of the third quarter. That electrified the crowd and brought the Cavs within one point entering the fourth. \n\"Yeah, that and LeBron's selfie were the highlights of the game,\" Blatt said. \"Without a doubt.\" \nWednesday was a rematch of the Eastern Conference Finals last spring in which the Cavs swept the Hawk 4-0 in the series. Blatt said the team wasn't placing any more emphasis on the game because of that fact. LeBron James talks after Wednesday's loss to the Hawks. The Enquirer/Mike Dyer \nJames said after the game he was just pleased the team finished healthy. \nBlatt said Wednesday night's lineups would not be indicative of what the Cavs will have to start the season Oct. 27 in Chicago. \nCleveland forward Kevin Love (shoulder) and point guard Kyrie Irving (knee) did not make the trip to Cincinnati. Love will join the team for a full practice on Saturday. \nCavs guard Iman Shumpert (wrist) is still several weeks away from returning, Blatt said. \nThe Cavs were also without forward Tristan Thompson, who remains a restricted free agent and has been in a contract dispute, according to published reports. \nAlthough the preseason game is not as intense and the minutes aren't the same, James said Wednesday morning he prepares the same way. And just like in 2014, James enjoyed his interaction with the fans at Cintas Center. \nJames said he wanted fans in Cincinnati to have the opportunity to see the full team in-person. \n\"A place like here - it's a treat for fans here at Xavier to be able to watch us live,\" James said. \nJames is expected to sit Thursday's game at Philadelphia. \nThe Cavs return to Ohio on Oct. 12 for a game against Memphis at Ohio State University.", "external_links": [], "published": "2015-10-08T08:18:00.000+03:00", "crawled": "2015-10-08T12:08:42.886+03:00", "highlightTitle": ""}