{"organizations": [], "uuid": "7a87188b22bc50248aa46fb19e57ca1bff24849e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pendletontimespost.com", "main_image": "", "site_section": "http://pendletontimespost.com//feed/sec/6000/", "section_title": "PendletonTimesPost.com - Sports News", "url": "http://www.pendletontimespost.com/view/story/4a8c2355e1444b3ca6c13d4914f92ac4/BKL--WNBA-Finals/", "country": "US", "title": "Moore hits winner to lift Lynx over Fever 80-77", "performance_score": 0, "site": "pendletontimespost.com", "participants_count": 0, "title_full": "Moore hits winner to lift Lynx over Fever 80-77", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T05:20:00.000+03:00", "replies_count": 0, "uuid": "7a87188b22bc50248aa46fb19e57ca1bff24849e"}, "author": "", "url": "http://www.pendletontimespost.com/view/story/4a8c2355e1444b3ca6c13d4914f92ac4/BKL--WNBA-Finals/", "ord_in_thread": 0, "title": "Moore hits winner to lift Lynx over Fever 80-77", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["DOUG FEINBERG", "Moore"], "text": "Moore hits winner at buzzer to lift Lynx to 80-77 win over Fever in Game 3 of WNBA Finals By DOUG FEINBERG AP Basketball Writer   10:20   10:20   \nPeople: Photo Gallery: \nClick to view (4 Photos) \nINDIANAPOLIS — Maya Moore made a 3-pointer at the buzzer from the top of the key to give the Minnesota Lynx an 80-77 victory over the Indiana Fever on Friday night in Game 3 of the WNBA Finals. \nMoore, who finished with 24 points, took the inbounds pass with 1.7 seconds left, moved to her right to elude a defender and swished the winner. The referees reviewed the play for a few minutes before declaring the basket good and leaving the Fever crowd stunned. \nMinnesota leads the best-of-five series 2-1. \nGame 4 is Sunday night with Minnesota trying to win its third title in five years. The team that has won Game 3 has won 70 percent of the titles since the WNBA went to a best-of-five format in 2005. Indiana is trying to become the first No. 3 seed to win a title. The first 18 championships were won by either one or two seeds. \nThese two teams played in the finals in 2012, which Indiana won for its lone title. After splitting the first two games that season, Indiana routed Minnesota in Game 3. This one was a much tighter contest. \nAs had been the case in the first two of the games in the series where each team won by six points, this one came down to the end. Neither team led by more than five points in the fourth quarter. Minnesota trailed 77-74 with 2:08 left before Renee Montgomery hit a 3-pointer to tie it at 77 with 1:11 left. \nBoth teams missed shots over the next 40 seconds before Indiana had the ball with 25 seconds left. Shenise Johnson's jumper from the corner was partially tipped with a few seconds left and the ball went out of bounds giving Minnesota one last chance to win in regulation, which Moore took. \nShe had been saddled in foul trouble all night, playing just 12 minutes through the first three quarters. Moore scored 12 points in the final period to lift the Lynx. Seimone Augustus added 13 points, and Montgomery had 12. \nJohnson finished with 17 points to lead Indiana. Tamika Catchings added 10 points and 10 rebounds. \nMoore helped Minnesota build a 28-21 early in the second quarter and was playing well before she picked up her third foul and sat the rest of the half. \nWith Minnesota's star on the bench, Indiana got going on offense. Catchings started a 14-6 run with her first basket of the game. Johnson had nine points during that spurt, including a 3-pointer which made it 37-34 and gave the Fever their first lead since early in the first quarter. \nThat shot capped a 9-0 burst in the run and brought the crowd of 16,332 fans, which included Paul George and many members of the Indiana Pacers , to their feet. George, C.J. Miles and Pacers coach Frank Vogel bought 1,500 tickets for this game for fans. \nIndiana led 42-38 at the half. \nDuring the second quarter Indiana honored former stars Katie Douglas and Tammy Sutton-Brown, who helped the Fever win their lone title in 2012. They were given framed pictures during a timeout in the second quarter. \nFollow Doug on Twitter at http://www.twitter.com/dougfeinberg \n ", "external_links": [], "published": "2015-10-10T05:20:00.000+03:00", "crawled": "2015-10-10T06:01:59.463+03:00", "highlightTitle": ""}