{"organizations": [], "uuid": "b8536ad026e877c5a51bd15966f696eb3af82290", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/nfl", "section_title": "NFL News, Scores, Schedule, Standings, Stats, Photos, Videos - Football - MSN Sports", "url": "http://www.msn.com/en-us/sports/nfl/ravens-agree-to-4-year-contract-extension-with-marshal-yanda/ar-AAfzslq", "country": "US", "title": "Ravens agree to 4-year contract extension with Marshal Yanda", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "Ravens agree to 4-year contract extension with Marshal Yanda", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "b8536ad026e877c5a51bd15966f696eb3af82290"}, "author": "Jeff Zrebiec", "url": "http://www.msn.com/en-us/sports/nfl/ravens-agree-to-4-year-contract-extension-with-marshal-yanda/ar-AAfzslq", "ord_in_thread": 0, "title": "Ravens agree to 4-year contract extension with Marshal Yanda", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ravens agree to 4-year contract extension with Marshal Yanda Baltimore Sun 5 hrs ago Jeff Zrebiec © Kevin Hoffman-USA TODAY Sports Sep 29, 2013; Orchard Park, NY, USA; Baltimore Ravens guard Marshal Yanda (73) during the game against the Buffalo Bills at Ralph Wilson Stadium. Bills beat the Ravens 23-20. Mandatory Credit: Kevin Hoffman-USA TODAY Sports The Ravens have long considered guard Marshal Yanda one of their foundation players, a guy who would spend his entire career in their organization.\nAdChoices By agreeing to a four-year, $32 million contract extension Friday with the perennial Pro Bowl selection, the Ravens took a significant step toward making that happen, while making Yanda one of the league's highest paid guards.\nYanda, who will get nearly $18 million in guaranteed money, is now under team control through the 2019 season. The 31-year-old was entering the final year of a five-year, $32.5 million contract that he signed in 2011.\nThis is the third contract that Yanda has signed with the team.\n\"My family and I are very excited to stay with such an incredible organization,\" Yanda said in a statement released by the team. \"We feel fortunate to have reached an extension, and I look forward to carrying on the Baltimore Ravens' great tradition. Hopefully, I will finish my career as a Raven.\"\nThe Ravens' deal with Yanda follows contract extensions that the team executed with would-be free agent defensive backs Jimmy Smith and Will Hill. It leaves starting left guard Kelechi Osemele, outside linebacker Courtney Upshaw and kicker Justin Tucker as the team's top remaining free agents.\nIt seems unlikely that the Ravens will be able to re-sign Osemele, not only because it would be tough for the perennially salary cap-challenged team to pay big money to two guards, but also because they have a potential replacement on the roster in John Urschel. Tucker, one of the game's best kickers, would likely get franchise tagged before hitting the open market, where he'd surely cash in.\nBut for the Ravens, those are conversations for another day. All along, Yanda, a third-round pick of the team in 2007, was one of their top priorities. He's emerged as the anchor of the offensive line and one of the offseason leaders, and he's considered by many to be the top guard in the NFL.\n\"This is another example in [owner Steve Bisciotti's] investment in winning,\" general manager Ozzie Newsome said in a statement released by the team. \"Marshal is not only a staple of our offensive line, but also a staple of our entire team. He is the best of what a Raven should be and Steve recognizes that.\"\nYanda has been selected to the Pro Bowl team for four consecutive seasons and he was named a first-team All-Pro for the first time last year. Through five games this year, Yanda is the top-graded guard in the NFL, according to Pro Football Focus. He has also proven that he has the versatility to play anywhere on the offensive line, moving to right tackle last year during the Ravens' playoff run and not having a drop-off.\nPrior to this season, Ravens' season-ticket holders voted Yanda as one of the top-10 players in the franchise's 20-season history.\nYanda, however, is dismissive when he's asked about his accolades. An Iowa native, he constantly talks about just coming to work and doing his job. Yanda has played in 120 games, starting 109 of them, since entering the NFL in 2007. After injury-plagued 2008 and 2009 campaigns, Yanda has started 83 of the Ravens' 85 games over the past six seasons.\nHis 109 starts are third all-time among Ravens' offensive linemen, trailing only Hall of Famer Jonathan Ogden (177) and Mike Flynn (133). Yanda missed two practices earlier this week because of an ankle injury, but he returned to the field Friday and is expected to play against the San Francisco 49ers.\nAll along, Yanda said he wasn't concerned about his contract status. At the Ravens' mandatory minicamp in mid-June, Yanda said, \"We'll worry about that when the time comes. But right now, I'm focused on getting better as a football player and stuff like that. I'm not too worried about it. We'll get it done when we get it done.\"\nYanda never said publicly that he wanted to be paid as the top guard in the NFL, but his production and durability warranted such discussion. In March, the Arizona Cardinals signed guard Mike Iupati, the former 49er and three-time Pro Bowl selection, to a five-year, $40 million deal that includes $13.75 million in fully guaranteed money. The San Diego Chargers gave guard Orlando Franklin a five-year, $36.5 million pact that included $16.5 million fully guaranteed.\nFormer New England Patriot and current Tampa Bay Buccaneer Logan Mankins is the league's highest paid guard, signing a six-year, $51 million deal ($30 million guaranteed) while with the Patriots in 2011.\nGo to MSN Home", "external_links": ["http://go.microsoft.com/fwlink/?LinkID=286759"], "published": "2015-10-18T03:00:00.000+03:00", "crawled": "2015-10-18T09:14:57.193+03:00", "highlightTitle": ""}