{"organizations": [], "uuid": "8d16e53f437d98d9c32db3404764aef001cdb902", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ottawasun.com", "main_image": "http://storage.ottawasun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297759182266_LARGE_BOX.jpg?quality=80&stmp=1444612539104&size=100x", "site_section": "http://www.ottawasun.com/sports/rss.xml", "section_title": "Top Sports stories", "url": "http://www.ottawasun.com/2015/10/11/live-blue-jays-rangers-alds-game-3", "country": "CA", "title": "Live: Blue Jays-Rangers ALDS Game 3", "performance_score": 0, "site": "ottawasun.com", "participants_count": 0, "title_full": "Live: Blue Jays-Rangers ALDS Game 3", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T04:19:00.000+03:00", "replies_count": 0, "uuid": "8d16e53f437d98d9c32db3404764aef001cdb902"}, "author": "", "url": "http://www.ottawasun.com/2015/10/11/live-blue-jays-rangers-alds-game-3", "ord_in_thread": 0, "title": "Live: Blue Jays-Rangers ALDS Game 3", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Post-season play is often the platform where an unheralded player rises to the top. \nIt’s happening this series for the Texas Rangers. \nAlthough the Rangers lineup boasts big-time names such as Shin-Soo Choo, Prince Fielder and Josh Hamilton, it is second baseman Rougned Odor that has slayed the mighty dragon otherwise known as the Toronto Blue Jays. \nSimply put, Odor has been a complete pain in the ass for the Jays. \nIn the opening game, Odor was twice hit by David Price and both times came around to score, the second time scoring from second as he beat the throw home from centre fielder Kevin Pillar. Then in the seventh inning he drilled a solo home run to put his team up 5-3. \nIn Game Two, Odor walked in his first at bat in the second inning and on a high chopper to the mound, one that drew in both Josh Donaldson and Troy Tulowitzki, he rounded second and with no Jay at third raced to the open bag. Hanser Alberto followed with a shallow fly to centre but Odor beat his accurate throw to the plate with a terrific slide to avoid the tag from Russell Martin. \nIn the fateful 14th inning, Odor got the Rangers rally started with his two-out single and eventually scored the go-ahead run. \nOverall, he’s scored five of the Rangers 11 runs chiefly on his speed and base-running smarts. \n“We’ve got enough respect for Odor to know that he can burn you,” Gibbons said of the pop in Odor’s bat. “We saw what he did to Price the other night with the homer. He’s hit, what, 17 or 18 this year (16). \nKeeping him off the bases is a priority given the damage he’s done. \n“We’re trying not to hit him I know that,” Gibbons said which drew a laugh. “Try not to walk him. Going into the series we’ve seen him on the highlights, he’s got a lot of sock in his bat. But he’s dangerous down there (in the lineup). I don’t know what we’re going to do any differently but we’ve got to get him out.” \nHis play may be a surprise to Blue Jays fans but certainly not the Rangers and manager Jeff Banister. \n“I’ll start with this and give our baserunning coach, Jayce Tingler as much credit as anybody,” Banister said. “What he’s meant to our team and you look up and look at our base running and what we’ve asked our guys to do and his message, also our development staff of what they’ve been able to do with our guys in preparing these guys to be able to play at this level and the things that you need to do to run the bases properly. I believe that base running can be dynamic, it can win you ball games. And when you make mistakes on the base paths and you don’t run the base correctly, it can also hurt you. It can keep you from scoring. \n“I also believe there are certain players that you just completely will yourself to score. And that’s where I think Rougned Odor is. He’s similar to Delino DeShields, they will themselves to score, that’s their sole purpose it to cross home plate and they’re going to do whatever they can do. And great heads-up base running make the slides that he made, they’re incredible.” \nAs for handling all the praise that has come his way and the spotlight, Banister has no worries that it will have an effect on Odor. \n“We’ve already talked to our guys about what the expectations and what may happen going forward,” Banister said. “So I believe that our development staff has already laid that groundwork with a lot of our guys.” \nOdor was also the player who may have been tagged out by Troy Tulowitzki at second in the 14th, a play that went under review but the umpires ruled the call on the field - safe - would stand. One replay showed that perhaps Odor’s foot came off the bag on the pop-up slide but it was not enough evidence for the officials in New York. \nOn that play, Odor’s intention was to go to third but he put on the brakes and retreated when he got the stop sign from Rangers third base coach Tony Beasley. \n“First of all, he tells me not to put the stop sign on him all the time,” Beasley recalled. “And I always say ‘You’ll stop if I tell you to stop.’ But every chance we’ve had to score this series has been bang-bang. We were going to make (Pillar) make a play. His slide was outstanding.” \nThe slide where he reached out with his left hand, pulled it back and touched the bag with his right hand to avoid the tag by Martin was a thing of beauty. \n“There are times when players just will themselves to score,” Banister repeated. “Guys like that, they play hard and they will themselves to do special things.” \nThose special things simply killed the Jays in the opening two games. Sponsored Links", "external_links": [], "published": "2015-10-12T04:19:00.000+03:00", "crawled": "2015-10-12T04:29:49.194+03:00", "highlightTitle": ""}