{"organizations": [], "uuid": "dbf60fe80614423605cab304b96678b8d81a4e0f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/Portal/6/Sports.aspx", "section_title": "Sports - Ahram Online ", "url": "http://english.ahram.org.eg/NewsContent/6/51/161029/Sports/Egyptian-Football/Zamalek-president-slams-coach-Ferreira-after-Ahly-.aspx", "country": "EG", "title": "Zamalek president slams coach Ferreira after Ahly defeat - Egyptian Football", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Zamalek president slams coach Ferreira after Ahly defeat - Egyptian Football - Sports - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "dbf60fe80614423605cab304b96678b8d81a4e0f"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/6/51/161029/Sports/Egyptian-Football/Zamalek-president-slams-coach-Ferreira-after-Ahly-.aspx", "ord_in_thread": 0, "title": "Zamalek president slams coach Ferreira after Ahly defeat - Egyptian Football", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Winning the Super Cup is just a start for the new season, says Ahly's coach VIDEO: Crisis-hit Ahly ease woes with 3-2 derby win over Zamalek RELIVE: Zamalek v Ahly (Egypt Super Cup) Zamalek president Mortada Mansour labeled coach Jesualdo Ferreira 'a loser' following the team's 3-2 defeat to Ahly in the Super Cup on Thursday.\n\"I am very proud of the players who exerted a great effort during the match but I have to say I am totally disappointed with the coach who failed to manage the game,\" Mansour said after the game.\n\"He is wasting all our efforts. I told him several times to adjust the lineup but he doesn't. I will appoint an assistant coach will full responsibilities and if he doesn't like it he can leave,\" he added.\nAfter helping Zamalek to win their first domestic double since 1988, the Portuguese tactician signed a new contract for one more season. However, he was always under heavy criticism from Mansour for adopting a defensive approach while having a star-studded squad.\nThe Zamalek chief also fumed at the referee saying he is the worst he has ever seen.\nThe Spaniard official Carlos Velasco Carballo whistled three penalty kicks including two for Ahly and turned down many calls from Zamalek.\nFerreira remains calm\nThe 69-year old tactician refused to comment on Mansour's blast saying he is 'free to do whatever he wants'.\nDuring the presser he praised his players and rues the team's missed chances.\n\"We were better for 60 minutes but Ahly played with a higher spirit especially in the second half. However, we had several scoring chances and in football when you don't kill the game you get killed,\" Ferreira said.\nHe also blamed Mahmoud Kahraba after losing a penalty kick in the first half.\n\"He wasn't supposed to shoot it but he was very confident. That waste was a turning point in the game. He will be sanctioned but I won't talk about it here,\" he concluded.\nKeeper Sherif Ekrami blocked Kahraba's spot kick to keep the score at 1-0 for the Whites paving the way for Ahly to score three goals and win the Super Cup.", "external_links": [], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-16T00:54:12.437+03:00", "highlightTitle": ""}