{"organizations": [], "uuid": "921649d1c0a020e7cf6162bd3e0e195f8e20f0c0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dnaindia.com", "main_image": "http://static.dnaindia.com/sites/default/files/2015/10/08/383161-shaad-mohit.jpg", "site_section": "http://www.dnaindia.com/", "section_title": "DNA India | Latest News, Live Breaking News on India, Politics, World, Business, Sports, Bollywood", "url": "http://www.dnaindia.com/entertainment/report-shaad-randhawa-is-my-emotional-anchor-says-mohit-suri-2132507", "country": "SG", "title": "Shaad Randhawa is my emotional anchor, says Mohit Suri", "performance_score": 0, "site": "dnaindia.com", "participants_count": 1, "title_full": "Shaad Randhawa is my emotional anchor, says Mohit Suri | Latest News & Updates at Daily News & Analysis", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T14:30:00.000+03:00", "replies_count": 0, "uuid": "921649d1c0a020e7cf6162bd3e0e195f8e20f0c0"}, "author": "dna | From the print edition", "url": "http://www.dnaindia.com/entertainment/report-shaad-randhawa-is-my-emotional-anchor-says-mohit-suri-2132507", "ord_in_thread": 0, "title": "Shaad Randhawa is my emotional anchor, says Mohit Suri", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Directors have their muses and lucky charms. Mohit Suri has always considered Shaad Randhawa his lucky charm. The duo have worked in four films together — Woh Lamhe, Awarapan, Aashiqui 2 and Ek Villain (all hits) but not in Mohit’s last release, Hamari Adhuri Kahani ( a certified flop). Is that why the film didn’t do well?\nMohit says, “I really don’t know why HAK didn’t do well. I guess I can only blame myself for what went wrong.” Does he consider Shaad his lucky mascot? The director laughs, “It’s an inside joke amongst us. I love love working with Shaad because not only does he contribute while acting but he’s also my emotional anchor when I am shooting a film.”\nHe explains the bond, “A director gets isolated and lonely while shooting for his film. Shaad is someone who always watches your back. He’s a rich guy whose got a bungalow on Carter Road. He’s not in films for the money, so you know he’s not connected to anyone for any motive. My son calls him chacha so Shaad is that close to me and my family. Our relationship is an honest and caring one which is without any ulterior motives. We have known each other for more than a decade. In fact, while prepping for Aashiqui 2 (Shaad plays Aditya Roy Kapur’s best friend) we would discuss everything in Shaad’s home. He is a great guy. We met on the sets of Tumsa Nahi Dekha where he told me that he wanted to become an actor and then he made his debut in Woh Lamhe .”\nDid he miss him in HAK? “I miss him all the time when I’m not shooting. As they say one gets lonelier with success... I remember while shooting for HAK in South Africa, I was messaging him continuously as I was missing him when it struck me. He comes from a film family — Mumtaz is his aunt and Dara Singh his uncle (Shaad’s father actor Randhawa’s brother). A strange coincidence is that my grandfather Nanabhai Bhatt and Shaad’s father Randhawa have worked together.”", "external_links": [], "published": "2015-10-08T14:30:00.000+03:00", "crawled": "2015-10-08T04:53:30.761+03:00", "highlightTitle": ""}