{"organizations": [], "uuid": "d86e54d6b9aa3d4736399e825ffd7d6881d22cd5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.npr.org", "main_image": "http://media.npr.org/assets/img/2015/10/17/fullsizerender1_wide-ca1deceb670d0fa4258c1cd926cccb9d702e1ba7.jpg?s=1400", "site_section": "http://www.npr.org/rss/rss.php?id=1055", "section_title": "Sports : NPR", "url": "http://www.npr.org/2015/10/17/449388076/top-regatta-now-includes-more-but-not-all-disabled-rowers", "country": "US", "title": "Head of the Charles Regatta To Include Some Rowers With Disabilities, But Not All", "performance_score": 1, "site": "npr.org", "participants_count": 1, "title_full": "Head of the Charles Regatta To Include Some Rowers With Disabilities, But Not All : NPR", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T17:27:00.000+03:00", "replies_count": 0, "uuid": "d86e54d6b9aa3d4736399e825ffd7d6881d22cd5"}, "author": "Craig LeMoult", "url": "http://www.npr.org/2015/10/17/449388076/top-regatta-now-includes-more-but-not-all-disabled-rowers", "ord_in_thread": 0, "title": "Head of the Charles Regatta To Include Some Rowers With Disabilities, But Not All", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "i Kristina Gillis practices in the rear of a rowing shell along the Charles River, where she will compete at The Head of the Charles this weekend as an ID (Intellectual Disabilities) rower. The regatta has yet to formally include an event category specifically for athletes with intellectual disabilites. Craig LeMoult/WGBH hide caption\ni toggle caption Craig LeMoult/WGBH Kristina Gillis practices in the rear of a rowing shell along the Charles River, where she will compete at The Head of the Charles this weekend as an ID (Intellectual Disabilities) rower. The regatta has yet to formally include an event category specifically for athletes with intellectual disabilites.\nCraig LeMoult/WGBH The 51st Head of the Charles regatta is underway this weekend in Boston, where about 10,000 rowers from around the world will compete.\nThis year's event includes a new category of race that will include some kinds of rowers with disabilities, but not others.\nMore than anything, Kristina Gillis would like to race in the world-renowned Head of the Charles. The 26-year-old is part of a program for rowers who have intellectual disabilities, and there's no category specifically for rowers with disabilities like hers.\n\"I have ADD and I'm on the autism spectrum,\" says Gillis, who's been rowing for nearly seven years.\nShe sits in the rear of a two-person rowing shell, pulling her oars as her boat speeds along the Charles River. A coach calls out to her from a motorboat that's keeping pace.\n\"Out on the water, you really get a feel of the freeness of being outdoors,\" she says.\ni Kristina Gillis, seen in a two-person shell on the Charles River, hopes to show that rowers with intellectual disabilities like her can race in the challenging event. Graig LeMoult/WGBH hide caption\ni toggle caption Graig LeMoult/WGBH Kristina Gillis, seen in a two-person shell on the Charles River, hopes to show that rowers with intellectual disabilities like her can race in the challenging event.\nGraig LeMoult/WGBH Deb Arenberg of U.S. Rowing says there were about seven races that included intellectually disabled rowers last year, and she expects that number to grow.\n\"It's a process where you have to educate people on what the disabilities are like,\" she says, \"what people can do.\"\nBut when organizers of the Head of the Charles announced they're including a race this year that pairs an able-bodied rower with a partner who has a physical disability, they decided not to create a similar race for rowers with intellectual disabilities, who are called ID rowers.\n\"For all of us, the reaction was disappointment,\" says Beth Noll, who coaches disabled athletes at Community Rowing in Boston. \"It was something that particularly the ID rowers were very enthusiastic about, and really thought this was going to be their year.\"\nWith its twists and turns and seven bridges to dodge, the Head of the Charles is considered one of the most technically difficult regattas in the world.\nAnd Brendan Mulvey, director of operations for Head of the Charles, says safety is a concern.\nRelated NPR Stories Sports A Blind Football Player Joins His Trojan Heroes On The Field Health People With 'Invisible Disabilities' Fight For Understanding Women Join Men On Oxford-Cambridge Boat Race Day \"That is something that we are exploring and trying to learn more about so that when we are ready to expand to the ID athletes specifically, then we're fully prepared,\" he says.\nFor this year's Head of the Charles, at least, it looked like rowers with intellectual disabilities like Kristina Gillis were shut out. But then Coach Beth Noll says they got an idea.\nThey'd been trying to figure out which able-bodied rower would be a good match for an experienced Paralympian who's competing in the new combined event this year.\n\"The idea popped into our heads that Kristina would be a perfect fit,\" Noll says.\nShe's abled-bodied, and there's no rule actually saying a rower can't race in the Head of the Charles just because they have an intellectual disability.\nSo Kristina Gillis is competing this weekend, and she's hoping to show that rowers with intellectual disabilities really can race in one of the world's most challenging regattas.\n\"And maybe that they'll be more willing to try to change the rules of the Head of the Charles and let us row ... so it could be fair for us,\" Gillis says.\nIn addition to her family, friends and coaches cheering her on this weekend, organizers of the Head of the Charles say they'll be watching for her boat, too.\nhead of the charles rowing Boston", "external_links": [], "published": "2015-10-17T17:27:00.000+03:00", "crawled": "2015-10-17T16:33:06.526+03:00", "highlightTitle": ""}