{"organizations": [], "uuid": "d9ab2b3f06101ccdc8dad2d36f8b1a0332e3e4d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/6/55/161628/Sports/World/Next-FIFA-boss-should-be-outsider-with-good-human-.aspx", "country": "EG", "title": "Next FIFA boss should be outsider with good human rights record - World - Sports", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Next FIFA boss should be outsider with good human rights record - World - Sports - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "d9ab2b3f06101ccdc8dad2d36f8b1a0332e3e4d8"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/6/55/161628/Sports/World/Next-FIFA-boss-should-be-outsider-with-good-human-.aspx", "ord_in_thread": 0, "title": "Next FIFA boss should be outsider with good human rights record - World - Sports", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related FIFA refutes German claim over 2006 World Cup payment FIFA investigates Beckenbauer, Spanish football chief FIFA give Palestine go-ahead to face Saudi Arabia at home The next FIFA president should be an external candidate with a good record on human rights and governance and provide a strong track record of driving democratic reform, world players' union FIFPro said on Friday.\nFootball's world governing body, engulfed in the worst scandal in its history, is set to elect a new president on Feb. 26 to replace the suspended outgoing head Sepp Blatter, who has been in charge since 1998.\n\"A clean break from the past is essential for FIFA to climb out of the toxic pit which continues to produce serious accusations of corrupt behaviour on almost a daily basis,\" FIFPro said in a statement.\n\"Clearly, the presumption of innocence is a principle that needs to be upheld while various investigations are ongoing. At the same time, there is no doubt the present mayhem has left FIFA morally bankrupt.\"\nAsian Football Confederation (AFC) President Shaikh Salman bin Ebrahim Al Khalifa of Bahrain said this week he had been urged to stand in the election, but FIFPro's four-point criteria released on Friday was a clear question mark on his suitability.\nSalman's AFC election in 2013 was blighted by accusations from human rights groups that he, as head of the Bahrain Football Association and member of Bahrain's royal family, had local football players arrested, detained, abused, tortured and publicly humiliated during democracy protests in February 2011.\nSalman vehemently denied the claims, which have resurfaced amid anticipation he will file his nomination papers before Monday's deadline to stand for FIFA's top job.\n\"A new FIFA president would need to show a body of work based on social wellbeing, fairness, democratic values and human rights,\" FIFPro said.\n\"FIFPro, on behalf of the professional footballers it represents worldwide, accepts its responsibility to protect football. This is our game too. The time for politicking is over. FIFPro has no interest in remaining silent when football needs key stakeholders to act and lead by example.\"\nINCREASED SCRUTINY\nThe union's criteria also requested an understanding of the game as a sport and business.\nReuters reported on Tuesday how the AFC was set to agree a new marketing deal with French media group Lagardere without going to a formal tender.\nThe renewal comes at a time of increased scrutiny of the multi-million dollar marketing deals soccer bodies reach with FIFA and its confederations.\nIn May, the United States indicted 14 sports marketing executives and soccer officials, including several from FIFA on bribery, money laundering and wire fraud charges. Subsequent investigations have led to the suspension of FIFA officials across the world.\nMichel Platini, the president of European soccer's ruling body UEFA, had been favourite to replace Blatter, but his hopes were thrown into doubt after he was placed under an ethics investigation along with the Swiss.\nFrenchman Platini, who denies any wrongdoing, is still hopeful of running in the election for which Jordanian Prince Ali Bin Al Hussein, a former FIFA executive committee member, and ex-Trinidad and Tobago midfielder David Nakhid have submitted nominations and announced their candidacy.\nAnother Frenchman, former FIFA deputy secretary general Jerome Champagne, said on Friday he would also stand in the election.\n(For more sports news and updates, follow Ahram Online Sports on Twitter at @AO_Sports and on Facebook at AhramOnlineSports .)", "external_links": ["https://twitter.com/AO_Sports", "https://www.facebook.com/AhramOnlineSports?fref=ts"], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-23T18:07:50.615+03:00", "highlightTitle": ""}