{"organizations": [], "uuid": "868b122bfa6ddb5ebed6473f69e72af0aed45d7c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.winnipegfreepress.com", "main_image": "http://media.winnipegfreepress.com/designimages/fb-og-image.png", "site_section": "http://www.winnipegfreepress.com/rss/?path=/sports", "section_title": "Winnipeg Free Press: Sports", "url": "http://www.winnipegfreepress.com/sports/rookie-roberto-osuna-impressing-blue-jays-veterans-with-solid-post-season-332981041.html", "country": "US", "title": "Rookie Roberto Osuna impressing Blue Jays veterans with solid post-season", "performance_score": 0, "site": "winnipegfreepress.com", "participants_count": 1, "title_full": "Rookie Roberto Osuna impressing Blue Jays veterans with solid post-season - Winnipeg Free Press", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T23:53:00.000+03:00", "replies_count": 0, "uuid": "868b122bfa6ddb5ebed6473f69e72af0aed45d7c"}, "author": "Melissa Couto, The Canadian Press", "url": "http://www.winnipegfreepress.com/sports/rookie-roberto-osuna-impressing-blue-jays-veterans-with-solid-post-season-332981041.html", "ord_in_thread": 0, "title": "Rookie Roberto Osuna impressing Blue Jays veterans with solid post-season", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "TORONTO - Roberto Osuna may be the youngest member of the Toronto Blue Jays, but his teammates insist he doesn't act like it.\nHe doesn't pitch like it, either.\nThe 20-year-old right-hander, who came into Wednesday's ALDS Game 5 against Texas with five outs to go in Toronto's series-clinching 6-3 win, struck out four Rangers batters en route to his first save of the post-season.\nIt was the kind of performance that impressed some of Toronto's most veteran arms.\n\"He's an old soul,\" said 40-year-old knuckleballer R.A. Dickey. \"He's not just a 20-year-old kid. He's got some real miles under his engine and he's been clutch for us all year.\n\"We keep putting him out there and I'm sure people expect him to fail and he doesn't. He's got a built in excuse with his age, but he never takes it. I couldn't be more proud of him.\"\nOsuna has four appearances (5 2/3 innings) through five games of the Division Series, giving up zero runs on zero hits.\nIn 69 2/3 innings of relief throughout the regular season, he posted a 2.58 earned-run average and 20 saves while striking out 75.\n\"For a 20-year-old kid to be able to do what he's done, to get the last three outs of the game, those are the toughest three outs to get in Major League Baseball, and that's incredible,\" said left-hander David Price. \"For him to be able to step up the way he has, that's special.\"\nWith Toronto trailing the best-of-five series 2-0, Osuna came up big in Game 3, getting the final three outs — Prince Fielder, Mitch Moreland and Elvis Andrus — in the Blue Jays' 5-1 win. The next day he again worked a perfect ninth to help Toronto even the series.\n\"I watch him throw. We talk all the time,\" said Price, who's considered a role model among the Blue Jays' younger pitchers. \"He knows he's a special talent but he doesn't act that way. He goes out there with a good aura about himself.\n\"Every closer in this game has something a little bit off about them and Osuna definitely has that — I think you need to have that to throw the ninth inning and get those key three outs.\"\nManager John Gibbons, who's been dealing with holes in his bullpen after an injury sidelined Brett Cecil for the rest of the post-season and a family matter pulled Aaron Loup away from the team, says having guys like Osuna and 23-year-old Aaron Sanchez has helped make managing his relievers easier.\n\"Yeah, you do feel naked but we have some guys that have been pitching pretty good, the youngsters with Sanchez and Osuna,\" Gibbons said. \"They both went above and beyond what they normally do.\"\nSanchez came into Wednesday's game in the seventh inning and was charged with one unearned run through 1 1/3.\nHe followed a strong start from 24-year-old Marcus Stroman, who gave up two runs on six hits and a walk and struck out four over six innings.\nAll three Game 5 pitchers, each under 25 years old, were drafted (Stroman in 2012 and Sanchez in 2010) or signed (Osuna as an international free agent in 2011) by Toronto over the last five years.\n\"Really, it was the three young guns, homegrown, big arm, original Blue Jays,\" said Gibbons. \"So I know the organization is proud of those guys.\"\n___\nFollow @throwinsmoke on Twitter\n ", "external_links": [], "published": "2015-10-14T23:53:00.000+03:00", "crawled": "2015-10-15T10:07:33.131+03:00", "highlightTitle": ""}