{"organizations": [], "uuid": "77dea34dc4041698cd47ebae0c7a25fdedec3b6a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ocregister.com", "main_image": "http://images.onset.freedom.com/ocregister/gallery/nwg5x9-b88543925z.120151018200309000grqclgc0.10.jpg", "site_section": "http://ocregister.com//common/rss/rss.php?catID=18901", "section_title": "The Orange County Register - News Headlines : Sports", "url": "http://www.ocregister.com/articles/down-688129-chargers-rivers.html", "country": "US", "title": "Alexander: The irregulars almost pull off the improbable for the Chargers in Green Bay", "performance_score": 0, "site": "ocregister.com", "participants_count": 0, "title_full": "Alexander: The irregulars almost pull off the improbable for the Chargers in Green Bay - The Orange County Register", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "77dea34dc4041698cd47ebae0c7a25fdedec3b6a"}, "author": "", "url": "http://www.ocregister.com/articles/down-688129-chargers-rivers.html", "ord_in_thread": 0, "title": "Alexander: The irregulars almost pull off the improbable for the Chargers in Green Bay", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "GREEN BAY, Wis. – Call them the Mission Valley Irregulars. They are backups and castoffs, and they’re most noticeable on — but are not limited to — the Chargers offensive line.\nAnd as San Diego players continue to get hurt and sidelined, the Irregulars almost helped pull off what would have been an amazing upset Sunday, maybe their most improbable in years.\nA 10-point underdog coming in on the road against the undefeated Green Bay Packers, the Chargers were within 3 yards of taking NFL royalty to overtime.\nBut Packers cornerback Damarious Randall swatted away a pass for Danny Woodhead in the end zone with 15 seconds to play, and the home team escaped with a 27-20 victory.\nIn the standings it simply goes down as a “L,” and the Chargers are 2-4 heading into next Sunday’s home game against the Raiders. And in the NFL, that’s the ultimate currency.\nBut its fair to say the Chargers learned a lot and gained a lot Sunday.\nThe patchwork offensive line kept Philip Rivers upright, backups Darrell Stuckey and Jimmy Wilson played larger roles when safeties Eric Weddle (presumably a groin injury) and Jahleel Addae (back) were out, and wideout Dontrelle Inman saw his responsibilities increase when Keenan Allen suffered a hip injury in the second half.\nAnd with all of that, the team that was the 10-point underdog and was down 17-3 early was still slugging it out at the end.\n“This was a tough loss against a good team, a team that’ll be playing well into January,” quarterback Philip Rivers said. “There’s no consolation in that.\n“But it’s gonna turn if we keep fighting like we’re fighting. We’re gonna get on a roll at some point. We have to believe that first, and I think our guys do. But our resiliency is definitely going to be tested when we lose two like we lost.”\nRivers set franchise records for passes completed (43) and attempted (65) and yards (503) in a single game, tossing two touchdown passes and being sacked just twice against a ferocious pass rush that had 20 sacks in five games.\nAnd after San Diego’s defense had held at its own 10-yard line and held Green Bay to a field goal with 2:37 left, Rivers took his team down the field as if overtime was preordained. He completed seven straight passes to get the Chargers to first and goal at the 3 with 33 seconds left.\nHere, we pause for a second-guess. What in the world were they doing running Danny Woodhead into the line twice in that sequence? He lost a yard on first down, and was stuffed on third down after a second-down pass to Antonio Gates misfired.\n“When it works, it’s a great call,” Coach Mike McCoy said. “When it doesn’t work, there’s certain things you look at as a coach and beat yourself up about.”\nSo it came down to one fourth-down pass, a play call designed to force Randall to choose between covering Woodhead and Gates. But linebacker Clay Matthews jammed Gates at the line of scrimmage, leaving Woodhead one-on-one against Randall, and he sniffed out the play.\nBut if we are going to second guess, we must also give credit where credit is due. McCoy, whose innate conservatism and frequent difficulty managing the clock and his timeouts have been criticized here and elsewhere, put on his big boy headset at the end of the first half with a call that put the Chargers back in the game.\nDown 17-3, they faced third-and-goal at the Packers 10 with time running out when Rivers whipped a pass to Keenan Allen, who got to the 1 and tried but couldn’t quite stretch the ball into the end zone.\nAt first, acting on reflex, McCoy sent Josh Lambo and the field goal unit out. When the officials stopped the clock with two seconds left to review the play and make sure Allen didn’t get over the line, McCoy had second thoughts. If they didn’t rule touchdown, he decided to go for it.\n“Thank God they did look at it upstairs,” he said. “Because of the score of the game and understanding who we were playing, that changed my mind in a hurry.”\nThat was a good sign, validated when Rivers hit Inman in the end zone to make it 17-10 going into halftime.\nBetter yet, McCoy didn’t burn timeouts too soon, and he used them when he needed to.\nMaybe there’s progress on the sideline, too. Maybe this season actually is about to take a positive turn.\nContact the writer: jalexander@pe.com", "external_links": [], "published": "2015-10-18T03:00:00.000+03:00", "crawled": "2015-10-19T16:12:34.560+03:00", "highlightTitle": ""}