{"organizations": [], "uuid": "4fca5ee5d1695973666638795a7ce2d167b50567", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.si.com", "main_image": "http://cdn-jpg.si.com/sites/default/files/styles/si_gallery_slide/public/images/matt-williams-nationals-fired.jpg?itok=BubR9Ctd", "site_section": "http://www.si.com/htmlsitemap/2014/12/page-1", "section_title": "The Sports Illustrated HTML Sitemap Index for December, 2014 - SI.com", "url": "http://www.si.com/mlb/2015/10/05/washington-nationals-fire-matt-williams-manager", "country": "US", "title": "Nationals fire Matt Williams in needed move after disastrous year - MLB", "performance_score": 0, "site": "si.com", "participants_count": 4, "title_full": "Nationals fire Matt Williams in needed move after disastrous year - MLB - SI.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 4, "uuid": "c4e3e27bfa33f5212425dadae7cfc4161fcde3de"}, "author": "Jay Jaffe", "url": "http://www.si.com/mlb/2015/10/05/washington-nationals-fire-matt-williams-manager#post-0", "ord_in_thread": 0, "title": "Nationals fire Matt Williams in needed move after disastrous year - MLB", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "by Cliff Corcoran Twitter Email Posted: Mon Oct. 5, 2015 In a development as shocking as the sun rising in the east, the Nationals have fired manager Matt Williams just one day after the end of a season in which the Nationals went from World Series favorites to dysfunctional laughing stock in part due to his mismanagement. Williams's entire coaching staff was also let go.\nHired to replace the retiring Davey Johnson after the Nationals’ similarly disappointing but far less embarrassing 2013 season, Williams, a former five-time All-Star, joined Washington after several seasons as a coach with the Diamondbacks . However, his managerial experience was limited to a single season in the Arizona Fall League and five weeks as a replacement skipper in Double A in 2007. In his first year on the job, the Nationals, once again favored in their division, won a league-high 96 games despite injuries to several key players, making Williams a surprising winner of the Manager of the Year award .\n• MORE MLB: Full postseason schedule, start times, TV listings\nWilliams’s win wasn’t just surprising because of his lack of experience coming into the job, but also because there was a widespread sense that he was not a very good tactical manager, and there were questions about his interpersonal skills, as well. On the latter front, Williams made the controversial decision in his very first month on the job to pull then-21-year-old slugger Bryce Harper from a game because he failed to run out a ground ball, despite the fact that Harper had been nursing a tight quadriceps muscle in the days leading up to that game.\nMLB Video Not just any no-hitter: Scherzer turns in a performance for the ages vs. Mets by Cliff Corcoran", "external_links": ["http://twitter.com/cliffcorcoran"], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-06T04:20:34.435+03:00", "highlightTitle": ""}