{"organizations": [], "uuid": "b930dc402cbacb1d9b0964bd005f4d94e87ab274", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thegazette.com", "main_image": "http://www.thegazette.com/storyimage/GA/20151004/ARTICLE/151009857/AR/0/AR-151009857.jpg", "site_section": "http://feeds.feedburner.com/~r/GazetteOnlineSports/~6/1", "section_title": "Eastern Iowa Sports News and Information from Gazette Online", "url": "http://www.thegazette.com/subject/sports/b1g-rewind-underrated-or-overrated-20151005", "country": "US", "title": "B1G Rewind: Underrated or overrated?", "performance_score": 0, "site": "thegazette.com", "participants_count": 0, "title_full": "B1G Rewind: Underrated or overrated?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T20:23:00.000+03:00", "replies_count": 0, "uuid": "b930dc402cbacb1d9b0964bd005f4d94e87ab274"}, "author": "", "url": "http://www.thegazette.com/subject/sports/b1g-rewind-underrated-or-overrated-20151005", "ord_in_thread": 0, "title": "B1G Rewind: Underrated or overrated?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Scott Dochterman"], "text": "Scott Dochterman , The Gazette October 4, 2015 | 9:14 pm \nDefending national champion Ohio State and Michigan State opened Saturday’s play ranked No. 1 and 2 in both national polls. Both were favored to beat traditional Big Ten bottomfeeders Indiana and Purdue by at least 21 points. Instead, both barely staved off monumental upset attempts. \nIndiana (4-1, 0-1) led Ohio State (5-0, 1-0) at halftime, lost its quarterback and top running back and still had a chance to tie on the game’s final play. The Hoosiers moved inside the Buckeyes’ 5 with 23 seconds left, but a penalty, a 1-yard rush and two incompletions allowed Ohio State to pull out a 34-27 win. \nThe Buckeyes have beaten Indiana 20 consecutive times and enjoyed at worst a neutral atmosphere in nearby Bloomington, Ind. Yet, the Hoosiers kept attacking the Buckeyes until QB Zander Diamont’s fourth-down pass was tipped away in the end zone. \n“I quit trying to draw up how to win games a long time ago,” Ohio State Coach Urban Meyer said. “It doesn’t always work exactly how you planned.” \nHad Indiana scored inside of two minutes, the Hoosiers considered going for a 2-point conversion instead of overtime. \n“We hadn’t made up our mind, but we had talked that direction,” Indiana Coach Kevin Wilson said. \nMichigan State (5-0, 1-0) faced a different but equally difficult challenge from Purdue. The Spartans scored two touchdowns off Boilermakers’ turnovers en route to a 21-0 halftime lead. Purdue (1-4, 0-1) capitalized on a fumbled Michigan State punt to score their first touchdown and added a second on a 68-yard touchdown run. After a Michigan State field goal pushed the lead to 24-14, Purdue drove again. Aided by couple of big completions and a penalty, Purdue inched closer at 24-21. On its final drive, the Boilermakers moved the ball past midfield but turned over the ball on downs. \n“I think the true character of a football team is when you can take something where the tide is starting to swing one way in the fourth quarter and you’re able to stop it and come out with a win,” Michigan State Coach Mark Dantonio said. “The attitude on the sideline was very positive. It was just a ‘we’re going to get it done’ type thing.” \nThere are multiple ways of looking at the results. One, the Big Ten’s top-ranked teams are overrated. Championship-caliber teams are supposed to shake off such threats. Ohio State and its offensive array should have pulled away from Indiana and won by three touchdowns. Michigan State’s defensive reputation should dictate that a 21-0 advantage at home should turn into an easy victory. \nBut the contrary view is these teams will receive every opponent’s best shot, especially in conference play. Indiana has several skilled playmakers and was unbeaten entering the game. While Purdue has struggled so far, it appears improved on defense and has a new quarterback. Upsets happen every week in college football and these teams did what it takes to win. \nDantonio was a defensive assistant on Ohio State’s 2002 national title team. The gritty Buckeyes won seven games by seven points or less to tie for the Big Ten title and upset Miami to win the BCS championship. Dantonio sees some of those characteristics on this year’s squad. \n“The bottom line is just win,” he said. “You’re the No. 2 team in the nation, you’re going to get everyone’s best shot. They’re going to come in, they’re going to play as hard as they can possibly play. Things happen. I can’t predict that we’re going to drop the ball on a punt. What I can say, is afterwards I can tell them it’s ‘OK, line up, you got to go again, handle adversity.’ That’s what I can do, but I can’t predict that that is what is going to happen. It’s 21-0 at that point, we’re at midfield, there’s six minutes to go in the third quarter. We’re on track. We’re on track to do what we need to do. Things change. It’s like the weather around here.” \nHEADS SHAKING AT NEBRASKA \nLike Ohio State and Michigan State, one can interpret Nebraska’s start with ambiguity. However the results are completely the opposite. The Cornhuskers (2-3, 0-1) dropped their third game this season when their opponent scored on its final offensive play. The first loss was a Hail Mary pass in the opener against BYU. Nebraska rallied from a 33-10 fourth-quarter deficit at Miami to force overtime only to lose by a field goal. Saturday, Illinois scored two touchdowns in the fourth quarter to beat Nebraska 14-13. \n“Well this one was definitely interesting. I’m going to say what I have said before,” Nebraska Coach Mike Riley said. “This loss was similar to other losses that we have had this year, and I’ve given them the same speech. Each time the reaction is the same and then we go out and have a good week of practice. We just have to finish the job.” \nCoaching and defense defines Nebraska’s underwhelming start. The team’s pass defense is atrocious. The Cornhuskers rank last in the Big Ten, giving up 353.8 yards per game. That’s also the worst in the nation by 16.4 yards. Nebraska led 13-0 in the fourth quarter but allowed Illinois quarterback Wes Lunt to complete 8 of 18 passes for 122 yards and two TDs the rest of the game. Lunt’s last pass was a 1-yard score to wide receiver Geronimo Allison. \nThere appears to be a disconnect between Riley and his team. Nebraska quarterback Tommy Armstrong Jr. leads the Big Ten in passing offense and ranks second in total offense. But on a blustery day in Champaign, Riley asked Armstrong to pass eight times in the fourth quarter, and Armstrong completed one pass. Nebraska led 13-7 with 55 seconds left and faced third-and-7 at the Illinois 27. The Illini had no timeouts, and a simple running play would take 40 seconds off the clock. Armstrong rolled to the right and instead of falling down, threw an incompletion to stop the clock. Rather than attempt a field goal, Nebraska went for it and Armstrong passed incomplete. \nThe third-down play was crucial. Riley said it was a designed run with no pass option. Armstrong declined to talk afterward so we don’t know the other view. Still, Illinois went 72 yards in six plays over 41 seconds. As much as the play call was puzzling, Nebraska’s pass defense was equally baffling. \n“I don’t ever remember losing a game like this,” Riley said. “I hope we don’t have to weather any more games like this. It’s very tough for them (the players). To lose three close games on the last couple plays is rough for anyone.” \nThe weather will be an issue in Big Ten country, unlike Riley’s former stops on the West Coast. It’s not been an easy ride thus far for Riley, and he’s coaching in a place where perception and reality rarely intersect. Former coach Bo Pelini was dismissed after never losing more than four games in a season. If Nebraska loses this week to Wisconsin, Riley will equal Pelini’s annual loss total at the season’s midpoint. He and his players will have to weather one heck of a storm if that happens. \nFEELING MINNESOTA \nMany Big Ten observers touted Minnesota as a strong West Division contender, if not the favorite. But after a 27-0 loss at Northwestern on Saturday, the Gophers might struggle to even make a bowl. \nMinnesota averages the Big Ten’s fewest yards per play (4.6) and has scored only eight touchdowns in five games. All three of the Gophers’ wins were by three points and none of them were against a Power-5 opponent. \nNorthwestern held Minnesota to 74 rushing yards on 33 attempts. The Gophers completed 15 of 32 passes for 99 yards. Quarterback Mitch Leidner was replaced, the offense never reached the red zone and Minnesota possessed the ball for less than 26 minutes. \n“I wish I could just click my fingers and have that answer,” Minnesota Coach Jerry Kill said about his offensive woes. “I’ve had a lot of sleepless nights the last two or three weeks trying to figure all that out. So, we just keep working; that’s the only way I know how to solve problems.” \nMinnesota faces an unforgiving schedule. While Saturday’s game at Purdue appears winnable, the Boilermakers nearly upset Michigan State on the road. The Gophers’ ensuing stretch includes home games with Nebraska and Michigan, then road games at Ohio State and Iowa. \nInjuries have hit Minnesota hard this year, but opponents won’t take pity on the Gophers. If the offense doesn’t improve quickly, it could be a long year in Minneapolis. \nTOP CHARTS \nIn the USA Today/Coaches poll, Ohio State remained on top, Michigan State dropped from No. 2 to No. 3. Also ranked were Northwestern (14th), Michigan (21st) and Iowa (23rd). Wisconsin dropped out but received votes, along with Illinois and Indiana. In the AP poll, Ohio State stayed No. 1, but Michigan State fell to No. 4. Northwestern is 13th, Michigan 18th and Iowa No. 22. \nTHUMBS UPS \nMichigan’s defense forced 12 three-and-outs and held Maryland to 1-of-18 on third down. ... Illinois passed for 122 yards and 2 TDs in a fourth-quarter comeback while allowing just 1 of 8 passing for 16 yards in the same period. ... Ohio State has won 25 consecutive Big Ten regular-season games. ... Iowa is the only team nationally to not allow a rushing touchdown. ... Indiana’s defense held Ohio State to 2 of 14 on third down. ... Purdue outscored No. 2 Michigan State 21-3 in the second half in a comeback attempt. ... Northwestern held Minnesota to 173 total yards and notched its second shutout this season. \nTHUMBS DOWNS \nMaryland managed just 105 total yards, completed 10 of 36 passes (3 interceptions) and rushed for only 29 yards. ... Nebraska completed 10 of 31 passes for 105 yards and was 4 of 17 on third down. ... Wisconsin failed to score on both red-zone chances against Iowa. ... Minnesota did not pass or rush for at least 100 yards against Northwestern. ... After a 21-0 lead, Michigan State struggled to put away a team with one league win since 2012. ... Army outrushed Penn State 261-108. \nWEEKEND STARS \nWisconsin OLB Joe Schobert recorded 8 tackles (3.5 for loss), 5 QB hurries, 2 forced fumbles and 1 fumble recovery. ... Iowa CB Desmond King picked off 2 passes, broke up 2 passes and had 9 tackles. ... Illinois QB Wes Lunt passed for 251 yards and 2 fourth-quarter TDs. ... Ohio State RB Ezekiel Elliott rushed for 274 yards (ties second-most in Ohio State history) and scored on runs of 55, 65 and 75 yards. ... Penn State LB Jason Cabinda had 14 tackles, including 2 sacks, and a forced fumble. \nNOTEWORTHY \nMichigan LB Desmond Morgan had 9 tackles, 1 interception and 2 pass breakups. ... Maryland CB Will Likely had 6 tackles (1 for loss), 2 pass breakups and 114 all-purpose yards. ... Nebraska punter Sam Foltz punted 9 times for a 46.9-yard average. ... Indiana QB Zander Diamont rushed for 76 yards and passed for 98 yards in relief of injured starter Nate Sudfeld. ... Purdue RB Markell Jones rushed for 157 yards and 2 TDs. ... Michigan State RB L.J. Scott ran for 146 yards and 2 scores. \nPOWER RANKINGS \n1. Ohio State (1) 5-0 1-0 \nKeep waiting for Buckeyes to turn it on and show it off \n2. Michigan State (2) 5-0 1-0 \nThe numbers belie this team’s high ranking \n3A. Northwestern (3A) 5-0 1-0 \nNo B1G team has looked more impressive this season \n3B. Iowa (3B) 5-0 1-0 \nWon a slugfest against its border blood brother \n3C. Michigan (3D) 4-1 1-0 \nHas allowed only two TDs over last four games \n6. Wisconsin (3C) 3-2 0-1 \nA loss that will gnaw at the Badgers’ souls \n7. Indiana (10) 4-1 0-1 \nPlayed better in a loss than it had in any wins \n8. Illinois (11) 4-1 1-0 \nVictory turns Illini into West Division contender \n9. Penn State (9) 4-1 1-0 \nLet’s see if coach’s rhetoric translates into performance this week \n10. Nebraska (8) 2-3 0-1 \nYou are what your record says you are \n11. Minnesota (7) 3-2 0-1 \nForget winning the division, can Gophers get to a bowl? \n12. Purdue (14) 1-4 0-1 \nShowed plenty of heart to rally at MSU \n13. Rutgers (12) 2-2 0-1 \nStayed out the news last week, that’s a positive \n14. Maryland (13) 2-3 0-1 \nBeen outscored 63-6 in last two games \nSTANDINGS", "external_links": [], "published": "2015-10-04T20:23:00.000+03:00", "crawled": "2015-10-05T18:51:00.531+03:00", "highlightTitle": ""}