{"organizations": [], "uuid": "64727b042dfad7d76fcbe26f78d15ca4d10b1261", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/ncaafb", "section_title": "NCAA FB News, Scores, Schedule, Standings, Stats, Photos, Videos - Football - MSN Sports", "url": "http://www.msn.com/en-us/sports/ncaafb/did-pitt-coach-pat-narduzzi-insult-penn-states-offensive-coaches/ar-AAfDt6O", "country": "US", "title": "Did Pitt coach Pat Narduzzi insult Penn State's offensive coaches?", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "Did Pitt coach Pat Narduzzi insult Penn State's offensive coaches?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "64727b042dfad7d76fcbe26f78d15ca4d10b1261"}, "author": "Here's What Westboro Thinks of Kim Davis", "url": "http://www.msn.com/en-us/sports/ncaafb/did-pitt-coach-pat-narduzzi-insult-penn-states-offensive-coaches/ar-AAfDt6O", "ord_in_thread": 0, "title": "Did Pitt coach Pat Narduzzi insult Penn State's offensive coaches?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\nDid Pitt coach Pat Narduzzi insult Penn State's offensive coaches? FOXSports 4 hrs ago © AP Pat Narduzzi, the longtime Michigan State defensive coordinator, gestures as he speaks at an NCAA college news conference in Pittsburgh where he was introduced as the new head football coach for Pittsburgh, Friday, Dec. 26, 2014. Narduzzi replaces Paul Chryst who left Pitt last week after three seasons to become the coach at Wisconsin. (AP Photo/Keith Srakocic) Pittsburgh and Penn State are not scheduled to meet on the football field until next season, but Panthers coach Pat Narduzzi may have delivered a warning shot Monday during his regularly press conference in the Steel City.\nWhen (per a transcript on the school's official web site) Narduzzi was asked about the completion percentage of Panthers quarterback Nate Peterman being the product of his skill or the Pitt scheme, Narduzzi first joked it was all play calling before conceding successful quarterback play is inevitably a result of talented players and good plans.\n\"Is it the play-calling? Yeah, of course,\" Narduzzi said. \"You can have a talented quarterback with a bad play-caller and make him look bad. We've seen that around the country, some closer than others.\"\nGiven the well-documented struggles of Penn State quarterback Christian Hackenberg, many across the Internet perceived that comment as a shot at the Nittany Lions' coaching staff.\nAlthough Narduzzi did not clarify what he meant before the press conference was over, ESPN.com apparently inquired with a Pitt athletics department staffer and was told, \"People can draw their own conclusions as to whom the shoe best fits.\"\n. @PittBorghetti on Pat Narduzzi’s QB Quote: : “People can draw their own conclusions as to whom the shoe best fits\" https://t.co/OnPq3h218R\n— Brett McMurphy (@McMurphyESPN) October 19, 2015 AdChoices Go to MSN Home", "external_links": ["https://t.co/OnPq3h218R", "http://www.foxsports.com/", "https://twitter.com/McMurphyESPN/status/656178341876097025", "https://twitter.com/PittBorghetti", "http://go.microsoft.com/fwlink/?LinkID=286759"], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-20T05:43:30.554+03:00", "highlightTitle": ""}