{"organizations": [], "uuid": "283f722366e7c18ee5cce657ceb7be3b13309cdb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www2.ljworld.com", "main_image": "http://worldonline.media.clients.ellingtoncms.com/static/ljworld.com/images/ljw-logo-1200.jpg", "site_section": "http://www2.ljworld.com/rss/headlines/sports/", "section_title": "LJWorld.com stories: Sports", "url": "http://www2.ljworld.com/news/2015/oct/11/chiefs-hope-get-well-against-bears/", "country": "US", "title": "Chiefs hope to get well against Bears", "performance_score": 0, "site": "ljworld.com", "participants_count": 1, "title_full": "Chiefs hope to get well against Bears", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T08:07:00.000+03:00", "replies_count": 0, "uuid": "283f722366e7c18ee5cce657ceb7be3b13309cdb"}, "author": "Associated Press", "url": "http://www2.ljworld.com/news/2015/oct/11/chiefs-hope-get-well-against-bears/", "ord_in_thread": 0, "title": "Chiefs hope to get well against Bears", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Associated Press — Associated Press October 11, 2015 \nAdvertisement \nKansas City, Mo.  The Chicago Bears came away from last week feeling as if they’d turned a corner, an eight-game losing streak finally behind them after a heart-pounding victory over Oakland. \nThe Kansas City Chiefs felt the opposite, as if their season is slipping away. \nThe Bears will try to build on their modest momentum when they visit Arrowhead Stadium today for the first time since 2003. They’ll be facing a Chiefs team in desperate need of a win after three straight defeats have relegated them to the AFC West cellar. \n“Listen, there’s a sense of urgency every weekend. That’s the way it needs to be,” Chiefs coach Andy Reid said. “Whether it was the first week or this week, there’s no time to stall, if that’s even in your vocabulary. We’ve got to take care of our business.” \nThe Bears (1-3) finally did that last week against the Raiders. \nThey rallied behind Jay Cutler in the closing minutes for a 22-20 victory, made possible by Robbie Gould’s 49-yard field goal. It was their first victory since November, and the first since John Fox took over the beleaguered franchise prior to this season. \nThe biggest turnabout came on defense, where a team that had been gouged in losses to Green Bay, Seattle and Arizona was able to keep the Chicago offense within striking distance. The Bears are still allowing 31.2 points per game — tied with, ahem, the Chiefs for last in the league — but surrendered a season-low 243 yards last week against the Raiders. \n“Winning has cured more ills than penicillin,” Bears defensive coordinator Vic Fangio said. \nThe Chiefs (1-3) could certainly use a dose of it. \nAfter a season-opening win in Houston, the Chiefs fumbled away a victory over Denver, then forgot to show up in Green Bay. Last week, they moved the ball well in Cincinnati but settled for a franchise record-tying seven field goals from Cairo Santos in a 36-21 defeat. \n“We’ve just got to be better,” said Alex Smith, who has been sacked 19 times, more than any other quarterback in the league. “Bears defenses are a different challenge. So a little bit, you’re taking the things you learned last week but you’re moving forward. This is a new challenge this week and we’ve got to figure out how to beat these guys.” \nWhile the Chiefs and Bears have played only sporadically over the years, there is a sense of familiarity. Fox has spent the past few years with Kansas City’s bitter rival, Denver. \n“They always play hard and good, physical football,” Reid said of Fox’s teams. “From the time he was in New York, Carolina, all the different places, if you picked one ingredient that would be it.” \nCAPSULE: \nCHICAGO (1-3) at KANSAS CITY (1-3) \nNoon today, Fox (WOW channels 4, 204 \nOPENING LINE — Chiefs by 9 \nRECORD VS. SPREAD — Bears 1-3, Chiefs 1-3 \nSERIES RECORD — Bears lead 6-5 \nLAST MEETING — Chiefs beat Bears 10-3, Dec. 4, 2011 \nLAST WEEK — Bears beat Raiders 22-20; Chiefs lost to Bengals 36-21 \nAP PRO32 RANKING — Bears No. 26, Chiefs No. 20 \nBEARS OFFENSE — OVERALL (26), RUSH (11), PASS (29) \nBEARS DEFENSE — OVERALL (7), RUSH (24), PASS (4) \nCHIEFS OFFENSE — OVERALL (14), RUSH (15), PASS (13) \nCHIEFS DEFENSE — OVERALL (29), RUSH (14), PASS (28) \nSTREAKS, STATS AND NOTES — First trip for Bears to Arrowhead Stadium since Dec. 28, 2003, 31-3 loss. ... K Robbie Gould hit winning 49-yard FG last week vs. Oakland with 2 seconds left. ... Bears lost C Will Montgomery to broken leg last week. Matt Slauson or rookie Hroniss Grasu expected to start against Chiefs. ... Bears QB Jay Cutler expected to start second straight game after hamstring injury sidelined him for one week. Cutler needs five TD passes to pass Sid Luckman (137) for most in Bears history. ... RB Matt Forte needs two TDs to pass Rick Casares (59) for third most in Bears history. Walter Payton (125) and Neal Anderson (71) have most. ... Bears are fourth in NFL in pass defense (189.8 yards per game). ... Chiefs QB Alex Smith has thrown for 1,110 yards, fourth most in AFC through four games. ... Kansas City RB Jamaal Charles is fourth in NFL with 306 yards rushing. ... K Cairo Santos set franchise record with seven FGs in last Sunday’s loss to Bengals. ... Chiefs coach Andy Reid is 5-4 against Bears, 1-0 in postseason play, all with Philadelphia. \n... Kansas City is only team in NFL with three players with 20 or more receptions (Charles, Jeremy Maclin, Travis Kelce). ... Kansas City has had 21 scoring drives of four plays or fewer, third most in NFL behind Cincinnati and Buffalo. ... Fantasy Tip: Charles has had just 11 carries each of past two weeks, but he will face defense allowing nearly 120 yards rushing and more than 31 points per game.", "external_links": [], "published": "2015-10-11T08:07:00.000+03:00", "crawled": "2015-10-11T15:15:52.676+03:00", "highlightTitle": ""}