{"organizations": [], "uuid": "e492d3d89e6056fa87fbd22a5f913f94598b56c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tnonline.com", "main_image": "", "site_section": "http://tnonline.com//sports/rss", "section_title": "Times News Sports", "url": "http://www.tnonline.com/2015/oct/01/jim-thorpe-%E2%80%98swarming%E2%80%99-under-radar", "country": "US", "title": "Jim Thorpe ‘swarming’ under the radar", "performance_score": 0, "site": "tnonline.com", "participants_count": 1, "title_full": "Jim Thorpe ‘swarming’ under the radar", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T23:00:00.000+03:00", "replies_count": 0, "uuid": "e492d3d89e6056fa87fbd22a5f913f94598b56c9"}, "author": "psiwebtn", "url": "http://www.tnonline.com/2015/oct/01/jim-thorpe-%E2%80%98swarming%E2%80%99-under-radar", "ord_in_thread": 0, "title": "Jim Thorpe ‘swarming’ under the radar", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jim Thorpe ‘swarming’ under the radar Thursday, October 1, 2015 By Justin Carlucci / rod heckmantnsports@tnonline.com \nThe Anthracite Football League is dubbed one of the most competitive leagues in the state. The dust has far from settled, but there are just two unbeaten teams remaining across the AFL. \nMany pegged Lehighton to be toward the top of the league at this point of the season, so it’s not surprising that the Indians are a perfect 4-0 so far. Surprisingly, Lehighton hasn’t started off a season with five consecutive wins in 10 years. \nThe team that’s tied atop the AFL with Lehighton is its Carbon County rival Jim Thorpe — which could be labeled as a surprise to many. The Olympians have put themselves in a good position after one month of football, and it shouldn’t be such a shock. \nIn 2011 and 2012, the Olympians were a combined 2-18 overall in the regular season. However, since the beginning of 2013, Mark Rosenberger’s squad is a combined 19-6 with one AFL title under its belt. \n“Every year is different and each has a different type of chemistry,” said Rosenberger. “We’ve been through some tough times a few years ago when they (the seniors) were freshman. They want to build for more, they’re a special group of young men and they’re very close to me.” \nThe “Red Swarm” is truly living up to its nickname this year, as Rosenberger’s defense ranks best in the Times News area-- giving up just 154.8 yards per game through four weeks. \nRosenberger said, “We have some outstanding leadership. Kevin Vitti has been an outstanding leader for years. Colton Hurley has been too-- I could go on and name a ton of players. Each and every year they’ve gotten better and their leadership has gotten stronger.” \nThe Olympians haven’t been ranked higher than fifth in the AFL preseason coaches poll over the previous three seasons. When Jim Thorpe won the league in 2013, it was ranked seventh. \n“Anytime you’re part of a program when you’re winning, and you’ve had to fight to get to that point-- you build upon that. A few years ago we got used to it (the success), which I think is part of the reason why we stopped winning. We weren’t willing to put the extra time and effort in and we started taking things for granted. When you take things for granted in high school football, and life in general, things don’t normally work out for you. We established our core values of work ethic, dedication, and a team-first atmosphere again which got us back on the track that we were always on before. Two years ago we had something to prove after a couple of losing seasons. We had some outstanding seniors that year (in 2013) who helped get our program back to a perennial-playoff type of team. Our goals are to get better each and every day. We’re hoping that we are doing that at practice, which will lead to success on the field.” \nJim Thorpe has certainly regained its winning tradition, and nobody involved with the Olympians’ football program is surprised by another great start. \n\nRARE OT FOR BOMBERS ... Palmerton suffered its first loss of the season last Friday, falling to Palisades in overtime. \nThe Blue Bombers had gone longer than any other Times News area team since playing an OT game. The last time Palmerton needed extra time to decide the outcome was Sept. 22, 2000 (157 games ago) when it dropped a 19-16 decision to Southern Lehigh. This was also just the third overtime in Palmerton’s history. The Bombers are 1-2 all-time with its win coming Oct. 15, 1999 against, ironically enough, Palisades. \n\nTAMAQUA ALSO NEEDS OT ... Palmerton wasn’t the only area team to play an overtime game last week. \nTamaqua also was deadlocked after regulation and needed OT to decide its game against Schuylkill Haven. \nWhile overtimes are rare for the Bombers, they aren’t for the Blue Raiders. This was the 10th all-time OT game for Tamaqua. That’s the most among TN area schools, with the next closest being seven by Panther Valley and Northwestern. \nLast Friday also marked just the second time in area history that there were two overtime games on the same night. The only other time two games involving TN schools went to OT was Sept. 23, 2005 (Lehighton defeated Pleasant Valley, 28-27 and Tamaqua topped Mahanoy Area, 12-6). \n\nHELLER RUNS WILD ... Jim Thorpe’s Robbie Heller was well-deserving of this week’s Player of the Week honor, finishing last week’s game with 246 yards rushing on 21 carries. \nThe last time an Olympian rushed for that many yards in a game was Sept. 24, 1999 when Gabe Robinson finished with 260 against Columbia-Montour Vo-Tech during a 39-6 win. \nHeller also joins Shane Edwards as the only two Jim Thorpe players (since 1988) to gain at least 175 yards rushing in back-to-back games. Heller had 188 the week before his 246-yard outburst. Edwards had 189 on Sept. 24, 2010 and followed that up the next week with 225 yards. \n\nBORRE’S BIG GAME ... Pleasant Valley’s Austyn Borre had a big game last Friday to help his team earn its first victory of the season. \nThe senior rushed for 107 yards and two touchdowns and had 111 yards receiving on two catches, one of them for a TD. \nBorre became just the sixth area player (since 1988) to have both 100 yards rushing and receiving in the same contest. \nThe others to accomplish the feat include Tamaqua’s Tyler Hope (10/25/13), Northern Lehigh’s Caleb Johnson (9/14/12), Pleasant Valley’s Rob Getz (9/9/11), Palmerton’s Ryan McGrath (9/28/01) and Lehighton’s Scott Vrablic (8/30/96).", "external_links": [], "published": "2015-10-01T23:00:00.000+03:00", "crawled": "2015-10-02T08:47:46.994+03:00", "highlightTitle": ""}