{"organizations": [], "uuid": "377024512cba372a7dba8e8cc4df70945bd806c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wcax.com", "main_image": "", "site_section": "http://www.wcax.com/category/13537/business-news", "section_title": "Business &amp; economy news - WCAX.COM Local Vermont News, Weather and Sports-", "url": "http://www.wcax.com/story/30188025/fda-orders-safety-studies-from-scope-manufacturers", "country": "US", "title": "FDA orders safety studies from scope manufacturers", "performance_score": 0, "site": "wcax.com", "participants_count": 1, "title_full": "FDA orders safety studies from scope manufacturers - WCAX.COM Local Vermont News, Weather and Sports-", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "377024512cba372a7dba8e8cc4df70945bd806c3"}, "author": "wcax.com", "url": "http://www.wcax.com/story/30188025/fda-orders-safety-studies-from-scope-manufacturers", "ord_in_thread": 0, "title": "FDA orders safety studies from scope manufacturers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By MATTHEW PERRONE\nAP Health Writer WASHINGTON (AP) - Federal health authorities are ordering manufacturers of specialized medical scopes to study how the reusable devices are cleaned following a series of life-threatening bacterial outbreaks at U.S. hospitals.\nThe Food and Drug Administration said Monday that the three companies must submit plans to study how well hospital staffers actually follow instructions for disinfecting the scopes between uses. The agency hopes this information will shed light on a recent spate of infections involving antibiotic-resistant \"superbugs\" linked to the scopes.\nThe FDA issued the instructions to Olympus American, Fuji Medical Systems and Hoya Corp. All three companies are based in Japan but do business through U.S. affiliates. Olympus American accounts for 85 percent of the specialized scopes sold in the U.S., according to figures from the FDA.\nThe FDA came under fire earlier this year after two separate outbreaks at Los Angeles hospitals were linked to so-called duodenoscopes. The specialized fiber-optic scopes are threaded through the digestive tract to diagnose and treat gallstones, tumors and blockages of the pancreas and bile ducts. Officials at both hospitals said they had followed the manufacturers' instructions for cleaning the devices.\nSince 2013, there have been at least eight outbreaks of antibiotic-resistant bacteria linked to the devices at U.S. hospitals, according to government figures. Such problems have been linked to scopes from all three manufacturers that sell the devices in the U.S.\nDespite the links to infections, the FDA previously ruled it would keep the devices on the market because they fill an important need in a half-million procedures performed each year.\nDuodenoscopes feature a mechanized tip with moveable instruments used to drain blockages and perform other procedures. The complex design makes the scopes extremely difficult to clean. Bodily fluids and other debris can stay in the device's joints and crevices even after cleaning and disinfection.\n ", "external_links": [], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-06T02:37:57.573+03:00", "highlightTitle": ""}