{"organizations": [], "uuid": "be01c241b84be5b4c18d238eb776472c81d22b08", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "http://www.bostonherald.com/sites/default/files/media/ap/8a16148a9fc0462ea8d515de488cc4f0.jpg", "site_section": "http://bostonherald.com/sports", "section_title": "Sports | Boston Herald", "url": "http://bostonherald.com/sports/bruins_nhl/nhl_coverage/2015/10/rinne_makes_saves_22_predators_beat_devils_3_1", "country": "US", "title": "Rinne makes saves 22, Predators beat Devils 3-1", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "Rinne makes saves 22, Predators beat Devils 3-1 | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "be01c241b84be5b4c18d238eb776472c81d22b08"}, "author": "Associated Press", "url": "http://bostonherald.com/sports/bruins_nhl/nhl_coverage/2015/10/rinne_makes_saves_22_predators_beat_devils_3_1", "ord_in_thread": 0, "title": "Rinne makes saves 22, Predators beat Devils 3-1", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEWARK, N.J. — Pekka Rinne and the Nashville Predators ran their season-opening winning streak to three for one outstanding reason. They surrender very few goals\nRinne made 22 saves in a 3-1 victory over the struggling New Jersey Devils on Tuesday night. He has allowed only two goals so far, and gave much of the credit to his defensemen.\n\"We are so fortunate to have so many good defensemen,\" Rinne said. \"They also create a lot of offense as well, but they block shots, they control the game, they have good sticks. They know how to come back and help out. We are comfortable together and have a lot of confidence together. Overall, it's great to have that much talent.\"\nRoman Josi scored two goals, a first-period power play tally before joining Eric Nystrom with empty-netters in the closing minutes to help the Predators get off to their best start since 2010-11.\nThe backbone of the early run has been Rinne.\n\"He's been great so far this year, like he was great last year,\" Josi said. \"It gives us extra confidence as a defensive unit, knowing he's back there and stopping everything. He's always there to make the save.\"\nRinne set another club milestone. He has played 384 games, most by a Nashville goalie. Tomas Vokoun held the old mark.\n\"It's a big honor,\" Rinne said. \"Tomas Vokoun was a great goaltender and had a long career here. When I first came here, he was someone I looked up to, so it's fitting that I could pass him. I just hope there's a lot more games left in me to have here.\"\nRinne also owns the club records for wins (207) and shutouts (37).\nRinne lost his shutout when Kyle Palmieri scored on a power play with 1:40 left.\nNew Jersey has lost all three if its games, leaving the tandem of general manager Ray Shero and coach John Hynes looking for their first wins since taking over in the off season. Keith Kinkaid stopped 17 shots in his second straight start for the Devils. Cory Schneider missed the game for birth of his son early Tuesday morning.\nThe Predators had the only power play of the opening period, and Josi cashed in for his first of the season.\nShea Weber was the catalyst from the left point. After unloading a slapper that Kinkaid blocked, Weber spotted Josi in the right circle and faked another shot before feeding the puck to the wide-open winger for a one-timer at 10:34.\nKinkaid blamed himself.\n\"I should have had that one,\" Kinkaid said. \"I am always hard on myself, but I let that one go. I just had to make sure to keep us there. We just couldn't get the bounce on Rinne. He's tough to beat.\"\nThe Devils pressed for the equalizer early in the second and came close when Jordin Tootoo hit the crossbar.\nNew Jersey had the first five shots of the period but could not dent Rinne before the Predators reverted to their usual stifling defensive style and allowed the Devils only one more before the second intermission.\n\"Tonight, we came out in the second period and were aggressive, but we have a lot of areas to improve on,\" Devils center Adam Henrique said. \"We have to work hard to get the first one. We're not frustrated. We have to keep pushing forward to get the first win.\"\nThings opened up at the end when Nashville's Cody Hodgson was whistled for holding with 2:58 remaining.\nKinkaid left for an extra attacker and Josi hit the empty net for a 2-0 lead with Rinne assisting at 17:21.\nKinkaid was still on the bench when Nystrom closed out the scoring with 51.5 seconds left.\nNOTES: The Predators play the Islanders on Thursday and the Senators on Saturday to conclude their first trip ... Devils D John Moore was scratched with a bruised right arm The Devils also sat out C Sergey Kalinin. ... The Nashville scratches were defensemen Anthony Biletto, Victor Bartley and LW Viktor Arvidsson. ... Predators C Mike Ribeiro played in his 950th game. ... The Devils called up Yann Danis to back up Kinkaid. New Jersey cleared roster space by assigning F Reid Boucher to Albany of the AHL.", "external_links": [], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-14T11:22:30.438+03:00", "highlightTitle": ""}