{"organizations": [], "uuid": "8f7e189c0dbae9e888018b45b18ee12d86b62f86", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "http://s4.reutersmedia.net/resources/r/?m=02&d=20151026&t=2&i=1089892801&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB9P0YR", "site_section": "http://feeds.reuters.com/reuters/sportsNews", "section_title": "Reuters: Sports News", "url": "http://www.reuters.com/article/2015/10/26/us-soccer-fifa-idUSKCN0SK1ZX20151026", "country": "US", "title": "UEFA's Infantino to bid for FIFA presidency", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "UEFA's Infantino to bid for FIFA presidency | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T19:03:00.000+02:00", "replies_count": 0, "uuid": "8f7e189c0dbae9e888018b45b18ee12d86b62f86"}, "author": "Joshua Franklin", "url": "http://www.reuters.com/article/2015/10/26/us-soccer-fifa-idUSKCN0SK1ZX20151026", "ord_in_thread": 0, "title": "UEFA's Infantino to bid for FIFA presidency", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ZURICH UEFA general secretary Gianni Infantino entered the race for FIFA president on Monday as Asian soccer chief Sheikh Salman Bin Ebrahim Al Khalifa of Bahrain declared he had also put himself forward.\nThe surprise announcement from the executive committee of the European soccer authority that it was backing Infantino came ahead of the midnight CET deadline for candidates to register nominations for the presidency of world soccer's crisis-torn governing body. The FIFA election is scheduled to take place in Zurich on Feb. 26.\nFIFA is embroiled in the worst scandal of its 111-year history, the United States having indicted several FIFA officials for bribery, money laundering and wire fraud in May.\nSwiss authorities are also investigating the decision to award the 2018 and 2022 World Cups to Russia and Qatar respectively.\nEarlier this month, FIFA president Sepp Blatter and UEFA president Michel Platini, who had been favorite to succeed him, were suspended for 90 days pending a full investigation by FIFA's Ethics Committee.\nPlatini would not be able to be officially named a candidate while under suspension but FIFA has left the door ajar for him to run should he later win an appeal against his ban.\nIn the meantime, UEFA has opted to make sure they have a candidate in the race.\n\"We are delighted that Gianni has agreed to stand and he knows that he has our full support in his campaign to become FIFA President,\" said UEFA in a statement.\n\"We believe that Gianni Infantino has all of the qualities required to tackle the major challenges ahead and to lead the organization on a path of reform to restore FIFA's integrity and credibility.\"\nA multilingual lawyer, shaven-headed Infantino joined UEFA in 2000 and has been general secretary since 2009.\nHe has overseen the implementation of the complicated and controversial Financial Fair Play policy, a break-even rule which clubs are required to meet before they can take part in European competition.\nSCRAMBLE FOR NOMINATIONS\nThe Asian Football Confederation (AFC) said in a statement it had offered overwhelming support to Sheikh Salman who had assured it \"that his campaign will be entirely self-financed\".\nThe Bahraini, closely allied to Kuwaiti Sheikh Ahmad Al-Fahad Al-Sabah, one of the most powerful men in the Olympic movement, canvassed opinion from Asian associations last week.\nOn Saturday, South Africa's Tokyo Sexwale, a former Apartheid-era political prisoner turned businessman, announced he would stand. A spokesman confirmed Sexwale had the necessary five nominations.\nFormer Trinidad and Tobago midfielder David Nakhid says he has submitted his papers to FIFA, along with former FIFA deputy general secretary Jerome Champagne and Jordanian Prince Ali Bin Al Hussein.\nLiberia's Musa Bility has said he wants to run. His chances suffered a setback when the Confederation of African Football (CAF) refused to back him, but on Monday the BBC reported that he had the five nominations necessary to stand.\nFormer Brazil international Zico has been campaigning but has admitted he is struggling to get the backing of five FAs.\nAnother candidate, South Korea's Chung Mong-Joon, pulled out of the race on Monday. A scion of South Korea's Hyundai industrial conglomerate, Chung was banned from the sport for six years by FIFA, after an investigation into the decision to award the 2018 World Cup to Russia and the 2022 tournament to Qatar.\n\"Even though I can no longer stand for FIFA President, there is much left for me to do,\" Chung said. \"I will continue to work with all those who love football to bring about legitimate changes from within FIFA.\"\n(Reporting by Simon Evans in Miami, Joshua Franklin in Zurich, Sudipto Ganguly in Mumbai; writing by Brian Homewood in Aarhus, Denmark; editing by Ralph Boulton )", "external_links": [], "published": "2015-10-26T19:03:00.000+02:00", "crawled": "2015-10-26T18:46:15.200+02:00", "highlightTitle": ""}