{"organizations": [], "uuid": "a74925d586869bad4456ba2f96b3b9ed209a8f01", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pjstar.com", "main_image": "http://www.pjstar.com/Global/images/head/nameplate/fb/il-peoria_logo.png", "site_section": "http://www.pjstar.com/sports?template=rss&mime=xml", "section_title": "Sports - Journal Star", "url": "http://www.pjstar.com/article/20151010/SPORTS/151019996/11130/SPORTS?rssfeed=true", "country": "US", "title": "Dunlap beats Metamora 31-30 in overtime", "performance_score": 0, "site": "pjstar.com", "participants_count": 1, "title_full": "Dunlap beats Metamora 31-30 in overtime", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T08:12:00.000+03:00", "replies_count": 0, "uuid": "a74925d586869bad4456ba2f96b3b9ed209a8f01"}, "author": "Johnny Campos", "url": "http://www.pjstar.com/article/20151010/SPORTS/151019996/11130/SPORTS?rssfeed=true", "ord_in_thread": 0, "title": "Dunlap beats Metamora 31-30 in overtime", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Oct. 10, 2015 at 12:12 AM » RELATED CONTENT • Area football roundup: Peoria Heights/Quest clips North Fulton 41-20... DUNLAP — The Eagles from Dunlap put together some of their greatest hits on Friday night, and the result was some heartache tonight for Metamora. An extra point by junior kicker Hunter Reed in overtime proved to be the difference in a 31-30 win by the host Eagles — the first Mid-Illini Conference victory ever over the Redbirds. “That’s not a reflection of Dunlap, that’s a reflection of Metamora and the program and what coach (Pat) Ryan has done over there,” Eagles coach Brett Cazalet said after watching his team end a 15-game losing streak to the Redbirds. “There are a lot of programs around the state that are winless against Metamora.” The Eagles (5-2, 4-1) had to overcome a 14-point halftime deficit and then produce in overtime. The teams ended regulation tied at 24. Metamora (5-2, 3-2) got the ball first in the OT, and got a three-yard scoring run by workhorse Brock Modglin (22 rushes for 140 yards) to give the Redbirds a 30-24 advantage. But on the extra point try, Adam Schuck, lined up on the right side of the defensive line, broke through unimpeded and blocked the kick by Brad Herzog. “We didn’t call anything special on that play,” Cazalet said. “Go hard. We had a couple of guys come off the edge pretty hard there and they made the play.” On Dunlap’s ensuing possession, quarterback Harlan Mitchell hit Charlie Mangieri with a scoring pass over the middle to tie the game, and set up Reed’s winning kick. Reed split the uprights, sending the senior night crowd into a frenzy. But Reed said he was not nervous about making the kick. “I wasn’t feeling any pressure,” he said. “It was just another PAT. I’m used to my snapper (Charlie Mangieri) and my holder (Wes Jockisch). I’ve known them for awhile, and the line is great, so I knew it would be good.” The Eagles took an early 10-0 lead on a 5-yard run by Harlan Mitchell and a 41-yard Reed field goal. Then Metamora scored 24 unanswered points, mostly behind the home-run plays by quarterback Jacob Mitchell and Modglin. Mitchell (15 carries for 134 yards) escaped for a 70-yard scoring run, and Modglin broke free on a 61-yard TD. But in the second half, Evan Chronis returned the opening kickoff from the Dunlap 7 to the Metamora 10 to spark the comeback. “On kickoff returns, we have a diamond formation,” Cazalet said. “Chronis told me if I put him in there, he could pop one. Page 2 of 2 - “He was right, so that’s a credit to him for having the confidence and seeing that, and credit the other 10 guys for blocking like crazy.” Dunlap tied it on another five-yard run by Harlan Mitchell (11-for-22 passing for 123 yards, 13 rushes for 88 yards) with 5:56 left in the third. That was the final scoring in regulation. “We played good defense in the first half and contained their run,” Metamora coach Pat Ryan said. “We over-ran some things in the second half, starting with the kickoff. “Jacob (Mitchell) was hurting a little bit, but we tried to do too much. Give them credit, because they continued to play hard.” In the long run, that turned out to be enough for the Eagles. Johnny Campos can be reached at 686-3214 or jcampos@pjstar.com. Follow him on Twitter at @johnnycampos59. Johnny Campos", "external_links": [], "published": "2015-10-10T08:12:00.000+03:00", "crawled": "2015-10-10T23:53:12.347+03:00", "highlightTitle": ""}