{"organizations": [], "uuid": "a9be3eecbada960f751e83082b8c554ab5eccc05", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.arcamax.com", "main_image": "http://www.arcamax.com/apple-touch-icon.png", "site_section": "http://www.arcamax.com/sports/", "section_title": "Sports | ArcaMax Publishing", "url": "http://www.arcamax.com/sports/baseball/s-1731359?fs", "country": "US", "title": "Jungmann lasts only 3 innings in Brewers' 3-1 loss to Padres | Baseball", "performance_score": 0, "site": "arcamax.com", "participants_count": 1, "title_full": "Jungmann lasts only 3 innings in Brewers' 3-1 loss to Padres | Baseball | ArcaMax Publishing", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "a9be3eecbada960f751e83082b8c554ab5eccc05"}, "author": "arcamax.com", "url": "http://www.arcamax.com/sports/baseball/s-1731359?fs", "ord_in_thread": 0, "title": "Jungmann lasts only 3 innings in Brewers' 3-1 loss to Padres | Baseball", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SAN DIEGO -- The season just got too long for Taylor Jungmann, plain and simple.\nJungmann's late-season slide continued Thursday with a short and ineffective outing as the Milwaukee Brewers closed their road season with a 3-1 loss to the San Diego Padres at Petco Park.\nUnable to command his pitches, the rookie right-hander lasted only three innings, allowing four hits, four walks and three runs, with yet another home run hurting him. The continued slippage put a damper on what had been a brilliant debut season for Jungmann.\nAfter his first start in September, Jungmann was 9-5 with a 2.42 earned run average and on track for a brilliant debut. The wheels came off after that, however, and he allowed 28 hits, including eight homers, with 13 walks and 24 earned runs in 222/3 innings (9.52 ERA) over his last five outings.\nThat slide left Jungmann with a 9-8 record and 3.77 ERA and searching for answers. The most noticeable difference down the stretch was the inability to keep the ball in the park after Jungmann allowed only three homers in his first 16 starts.\nJungmann played in traffic from the outset, with Corey Spangenberg and Yangervis Solarte collecting back-to-back singles with one down in the bottom of the first. Shortstop Yadiel Rivera helped him out by going deep in the hole to throw out Jedd Gyorko on a marvelous play, with the runners advancing.\nA walk to Brett Wallace loaded the bases before Jungmann put a stop to it by striking out Melvin Upton Jr.\nThe Padres were back at it in the second inning when Derek Norris opened with a single and moved up on a wild pitch. Travis Jankowski drew a walk but Jungmann caught a break when Wil Myers hit a liner right to Rivera, who doubled Norris off second.\nThe Brewers had their chance to score first when a single by Michael Reed off Ian Kenneyand fielder's choice put two on with one out. Hernan Perez singled sharply to right but Jankowski made a perfect throw to the plate to get Reed trying to score from second and the game remained 0-0.\nBut not for long. Spangenberg led off the bottom of the inning with a walk and Solarte blasted his 14th homer out to right for a 2-0 lead. It was the eighth homer allowed in five games by Jungmann, who surrendered only three in his first 16 outings.\nWhen Jungmann walked Norris to begin the bottom of the fourth, Brewers manager Craig Counsell had seen enough. He summoned former starter Kyle Lohse to take over and before the inning was done Spangenberg had an RBI single to put the Padres on top 3-0.\nKennedy struck out the side in the fifth before the Brewers finally got to him for a run. Leading off the sixth, pinch-hitter Shane Peterson blasted a 2-0 fastball over the center-field fence to make it a 3-1 game.\nScooter Gennett followed with a single and moved up on a wild pitch but Kennedy whiffed three hitters for the second consecutive inning.\n(c)2015 Milwaukee Journal Sentinel\nVisit the Milwaukee Journal Sentinel at www.jsonline.com\n ", "external_links": ["http://www.facebook.com/sharer.php?u=http://www.arcamax.com/sports/baseball/s-1731359&h=Jungmann+lasts+only+3+innings+in+Brewers%27+3%2D1+loss+to+Padres", "https://plus.google.com/share?url=http://www.arcamax.com/sports/baseball/s-1731359", "http://twitter.com/share?url=http://www.arcamax.com/sports/baseball/s-1731359&hashtags=ArcaMax"], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-03T02:57:19.516+03:00", "highlightTitle": ""}