{"organizations": [], "uuid": "73a005bf52964fc2c7dc3ea7dadbc797839e30df", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailyherald.com", "main_image": "http://www.dailyherald.com/storyimage/DA/20151010/sports/151019829/AR/0/AR-151019829.jpg&amp;updated=201510102325&amp;imageversion=Facebook&amp;exactH=630&amp;exactW=1200&amp;exactfit=crop&amp;noborder", "site_section": "http://www.dailyherald.com/rss/feed/?feed=sports_all", "section_title": "DailyHerald.com &gt; Sports", "url": "http://www.dailyherald.com/article/20151010/sports/151019829/", "country": "US", "title": "Imrem: Now Chicago Cubs have to take advantage of their advantage", "performance_score": 0, "site": "dailyherald.com", "participants_count": 2, "title_full": "Imrem: Now Chicago Cubs have to take advantage of their advantage - DailyHerald.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T07:25:00.000+03:00", "replies_count": 1, "uuid": "bee91ceab005137f7e27b09bcdf9645c86b54a2f"}, "author": "Mike Imrem", "url": "http://www.dailyherald.com/article/20151010/sports/151019829/#post-0", "ord_in_thread": 0, "title": "Imrem: Now Chicago Cubs have to take advantage of their advantage", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Advantage Cubs.\nAt least that's how it feels even though the best-of-five National League division series against the Cardinals is tied.\nAfter splitting the first two games in St. Louis, the Cubs can come home and send their leading man to the mound in Game 3.\nJake Arrieta -- the Martian-American right-hander -- has been baseball's best pitcher for more than three months.\nNo wonder Cubs manager Joe Maddon said after Saturday night's 6-3 victory, \"Having Jake pitch the next game is a good thought for us.\"\nThe sense has to be that it would be an upset if the Cardinals beat Arrieta even though playoff upsets are common.\nArrieta has been as much a certainty as autumn following summer. Maddon has compared him to Cardinals' great Bob Gibson in the 1960s.\nThe Cubs' Game 2 victory immediately turned apprehension into anticipation with Arrieta primed to do what has been expected of him every time out recently.\nAs likely as another Arrieta gem is -- if anything in baseball can be likely -- that's how unlikely some developments were in Game 2.\nRemember, the opponents are the Cardinals, baseball's model franchise, the team with 2015's best record, the team that doesn't beat itself … that team beat itself.\n\"Fielding is what did this,\" St. Louis manager Mike Matheny said of the loss.\nThis new Cubs team made the Cardinals look like so many of those old Cubs teams looked for so many years.\nThe Cardinals, with so outstanding pitching, sabotaged themselves with a couple of errors that led to 5 unearned runs in the second inning.\nThe Cubs deserve considerable credit, however. Not all the Cardinals' mistakes were unforced.\n\"The situation was there and we took advantage of it,\" Maddon said of some unconventional strategy.\nThe situation was a runner on third base twice, which prompted the Cubs to execute two straight safety squeezes to get them home.\n\"We've done a real good job all season limiting extra bases and extra outs,\" Matheny said. \"Games like this are going to get you.\"\nMaddon, who leaves little to chance, had the Cubs work on bunting before the playoffs began. He knew runs would be hard to come by against the great Pirates and Cardinals pitching.\nSt. Louis' gift gaffes enabled the Cubs to do what they have done to lesser teams: Take an early lead and make it hold up.\nSpeaking of unlikely, Cubs relievers looked like the heralded Cardinals' bullpen when they followed starter Kyle Hendricks.\nMaddon's touch remains golden in so many ways, thanks to having so many golden chess pieces to move around.\nFor a while it was Hendricks, not exactly Jake Arrieta, who kept the Cubs in the game. The suspect bullpen shut out the Cards from the fifth inning on. Jorge Soler, forgotten among all the other Cubs rookies, received his chance and proceeded to spark the offense.\nThe result is that today's off-day will be what Maddon called \"breakfast at Wrigley,\" with optional batting practice and football viewing on the big screen beyond left field.\nThe mini-party is the reward for the young Cubs not being overwhelmed by the postseason.\nIt'll also be a prelude to a bigger party Monday night in Wrigleyville if Jake Arrieta does what he's expected to do in Game 3.\nAdvantage Cubs, indeed, and now all they have to do is take advantage of it.\nmimrem@dailyherald.com\n Columnists Sports MLB Cubs Imrem, Mike Baseball Pro Sports Pro Men", "external_links": ["https://twitter.com/share"], "published": "2015-10-11T07:25:00.000+03:00", "crawled": "2015-10-11T20:56:54.923+03:00", "highlightTitle": ""}