{"organizations": [], "uuid": "300d2a36adbc8e7ef348ad1ab195913692888a46", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theadvertiser.com", "main_image": "http://www.gannett-cdn.com/-mm-/0bafc3c5ea39aafbf3a7ccfe209d4efb14d48ac3/c=0-274-4288-2693&amp;r=x1683&amp;c=3200x1680/local/-/media/LafayetteLA/2014/09/12/-0901lsunorthtex002.jpg20120901.jpg", "site_section": "http://rssfeeds.dailyworld.com/opelousas/sports", "section_title": "Opelousas - Sports", "url": "http://www.theadvertiser.com/story/sports/2015/10/22/kragthorpe-enjoys-moment-limelight/74394146/", "country": "US", "title": "Kragthorpe enjoys moment in limelight", "performance_score": 0, "site": "theadvertiser.com", "participants_count": 0, "title_full": "Kragthorpe enjoys moment in limelight", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T04:19:00.000+03:00", "replies_count": 0, "uuid": "300d2a36adbc8e7ef348ad1ab195913692888a46"}, "author": "", "url": "http://www.theadvertiser.com/story/sports/2015/10/22/kragthorpe-enjoys-moment-limelight/74394146/", "ord_in_thread": 0, "title": "Kragthorpe enjoys moment in limelight", "locations": ["Gannett Louisiana"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kragthorpe", "Paul Kieu", "Jared Foster", "Brad Kragthorpe", "GLENN GUILBEAU"], "text": "Kragthorpe enjoys moment in limelight GLENN GUILBEAU, Gannett Louisiana 8:19 p.m. CDT October 22, 2015 Buy Photo LSU quarterback Brad Kragthorpe (16) is a contender for the third-string position after Jared Foster was lost for the season after surgery. (Photo: Paul Kieu, The Advertiser) Buy Photo \nBATON ROUGE — LSU holder Brad Kragthorpe was ruled short of a touchdown on a fake field goal at the end of the first half of the Tigers’ loss to Notre Dame in the Music City Bowl last season. Replays and pictures showed he may have been in before his knee hit the ground. \nLast Saturday, Kragthorpe threw the football to kicker Trent Domingue, who dashed 16 yards for a touchdown on a fake field goal for the winning touchdown early in the fourth quarter of LSU’s 35-28 win over Florida at Tiger Stadium. Kragthorpe’s toss was not a pass, though. It was a lateral as he threw backwards by about a yard, so officially he had nothing to do with the score. \n“I had a lot of texts when I got back to the locker room,” Kragthorpe said this week. “A lot of friends were like, ‘You’ve come this close to accounting for a touchdown now twice.’ But it was awesome. It was a cool experience. Glad we got this one in. Obviously, I thought I scored in the bowl game. They didn’t see it that way.” \nKragthorpe’s father is Steve Kragthorpe, who was LSU’s quarterbacks coach in 2011 and ’12 before he switched to the desk job of special assistant to Coach Les Miles in 2013 because he has Parkinson’s disease. The elder Kragthorpe met his son after that Notre Dame game. \n“Dude, you got screwed,” he told his son. \nKragthorpe, who is in the pressbox during games, hustled down to the field after the Florida win to meet his son again with a different message. \n“We shared a great moment after the game,” Brad Kragthorpe said. “He was excited for me. He told me how proud he was and that I earned the opportunity. It was a lot of fun for him to watch. I saw him after we sang the alma mater.” \nKragthorpe, a senior, originally signed with Idaho State and red-shirted there in his freshman season in 2011 out of Holland High in Tulsa, Oklahoma. His father was Tulsa’s head coach from 2003-06 before moving on to be Louisville’s head coach from 2007-09. He was Texas A&M’s wide receivers coach in 2010 before becoming LSU’s offensive coordinator in 2011. That summer, Kragthorpe was diagnosed with Parkinson’s and remained on staff for two seasons as quarterbacks coach. Brad Kragthorpe transferred to LSU for the 2012 season and has been a reserve quarterback and holder. He became the Tigers’ first team holder last season. \n“When I left high school I wanted to do my own thing. Obviously, my family’s situation had a huge impact on me coming down here,” the younger Kragthorpe said. “It was something. I wouldn’t trade the last four years for anything. It was a great decision.” \nKragthorpe’s dad did not have to tell him that LSU coach Les Miles liked to fake kicks before he became the Tigers’ holder. \n“I already knew,” he said. “You see the flip over the head on TV — the one against Florida (in 2010) and the one against South Carolina (in 2007). It’s something that Coach Miles is known for, and it’s part of what makes him a great coach.” \nSo when Miles approached Kragthorpe about holding — and faking — Kragthorpe knew what was coming. \n“It was two springs ago when Coach Miles came up to me and was like, ‘Hey, we want to use you as a holder this year, and be ready because we have a history of running some fakes — fakes with the holder, too,’” Kragthorpe said. \nTwo down, and maybe more to come with a touchdown for Kragthorpe? No. 5 LSU (6-0, 4-0 Southeastern Conference) has five regular season games remaining this season beginning with Saturday’s 6 p.m. meeting with Western Kentucky (6-1, 4-0 Conference USA) in Tiger Stadium on ESPNU. \n“I could care less, really,” he said. “We were able to score and have an impact on the outcome of the game. We have a bunch of fake field goals. We don’t necessarily plan on running them. We have them. We practice them. If the opportunity comes, we execute them. I guess teams may have to be more careful now when they choose to rush our field goal team.” Read or Share this story: http://www.theadvertiser.com/story/sports/2015/10/22/kragthorpe-enjoys-moment-limelight/74394146/ TOP VIDEOS", "external_links": [], "published": "2015-10-23T04:19:00.000+03:00", "crawled": "2015-10-23T08:39:38.409+03:00", "highlightTitle": ""}