{"organizations": [], "uuid": "db86e1870dcd2d602891a1d391183ec84a8088dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-5611a50c/turbine/ct-ptb-football-notre-dame-st-1005-20151004", "site_section": "http://www.chicagotribune.com/sports/highschool", "section_title": "Illinois High School Sports News - Preps Plus - Chicago Tribune", "url": "http://www.chicagotribune.com/sports/suburbs/post-tribune/sports/ct-ptb-football-notre-dame-st-1005-20151004-story.html", "country": "US", "title": "Notre Dame&apos;s margin for error erased after loss at Clemson - Post-Tribune", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Notre Dame&apos;s margin for error erased after loss at Clemson - Post-Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T01:12:00.000+03:00", "replies_count": 0, "uuid": "db86e1870dcd2d602891a1d391183ec84a8088dd"}, "author": "LaMond Pope", "url": "http://www.chicagotribune.com/sports/suburbs/post-tribune/sports/ct-ptb-football-notre-dame-st-1005-20151004-story.html", "ord_in_thread": 0, "title": "Notre Dame&apos;s margin for error erased after loss at Clemson - Post-Tribune", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Notre Dame coach Brian Kelly met with the captains after Saturday's loss at Clemson.\nEven with the setback, he wanted to make clear the team's goals were still in play.\n\"They can't let an opportunity like this ever slip through their hands again,\" Kelly said on Sunday. \"They're going to have other opportunities like this and they're going to happen every Saturday now because you can't lose another game.\n\"You're on the clock now. Every single weekend, you're playing elimination football.\"\nNotre Dame tumbled in the rankings following the 24-22 loss, dropping nine spots to No. 15 in The Associated Press poll. But the Irish (4-1) have not fallen out of the conversation for the College Football Playoff. The margin for error, though, no longer exists.\n\"We've got to get right to work on Navy, but you don't want to forget about losing an opportunity that we lost here and that should be with them because you can't give away the opportunity,\" Kelly said. \"I'm not disappointed in our guys, I'm disappointed that they didn't take advantage of the opportunity that they had, and that was to beat a team on the road in a tough place to play and overcome the elements.\n\"You don't want to repeat that and I hope that they never forget that.\"\nNotre Dame squandered a chance to make a statement on Saturday. Instead, the Irish made mistake after mistake. The team turned the ball four times. There were missed tackles and dropped passes.\n\"We had over 125 (receiving) yards that we left out there,\" Kelly said.\nAnd yet, Notre Dame had an opportunity to send the game to overtime. Quarterback DeShone Kizer completed a 1-yard touchdown pass to wide receiver Torii Hunter Jr. with seven seconds remaining to bring Notre Dame within two points. The Irish went for two, but Clemson stuffed Kizer on a run attempt. It was Notre Dame's second failed two-point conversion of the game.\nBoth remained topics of conversation on Sunday. The first two-point attempt came after C.J. Prosise caught a 56-yard pass for a TD to get the Irish within 21-9 with 14:13 remaining in the fourth quarter.\n\"I don't chase the points until the fourth quarter,\" Kelly said. \"And our mathematical chart, which I have on the sideline with me — and we have a senior adviser who concurred with me, and we said go for two,\" Kelly said of going for two the first time. \"It says on our chart to go for two.\n\"…The way they were running the clock and probably getting three possessions maximum and we're going to have to score in two out of the three. So it was the smart decision to make, it was the right one to make. Obviously, if we catch the two-point conversion, which was wide open, then we just kick the extra point and we've got a different outcome.\"\nInstead, Notre Dame is faced with trying to bounce back from its first defeat.\n\"That's the reality of where they are right now,\" Kelly said, \"and they clearly understand what they need to do each and every week.\"\nlpope@post-trib.com\nTwitter: @lamondpope\nCopyright © 2015, Post-Tribune Notre Dame Fighting Irish Sports Brian Kelly", "external_links": ["http://www.trbimg.com/img-5611a50c/turbine/ct-ptb-football-notre-dame-st-1005-20151004"], "published": "2015-10-05T01:12:00.000+03:00", "crawled": "2015-10-05T18:21:49.868+03:00", "highlightTitle": ""}