{"organizations": ["Red Wings", "Toronto Maple Leafs", "DFP Detroit Red Wings", "Facebook Email Twitter Google", "Detroit Red Wings", "Facebook Red Wings", "LinkedIn Pinterest Red Wings", "Detroit Free Press"], "uuid": "34b845fe8ef92590246dbfa33af69be8426e5871", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freep.com", "main_image": "http://www.gannett-cdn.com/-mm-/09a7d5626fb889673e5340e4090879efc4ca8a9c/c=1057-37-1898-512&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/23/DetroitFreePress/DetroitFreePress/635812079566274444-SMG-20151002-ggw-aa1-11.jpg", "site_section": "http://rssfeeds.freep.com/freep/sports", "section_title": "Detroit Free Press - Sports", "url": "http://www.freep.com/story/sports/nhl/red-wings/2015/10/23/detroit-red-wings-brad-richards/74469290/", "country": "US", "title": "Wings make some changes; Richards (back) out", "performance_score": 0, "site": "freep.com", "participants_count": 0, "title_full": "Wings make some changes; Richards (back) out", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T22:35:00.000+03:00", "replies_count": 0, "uuid": "34b845fe8ef92590246dbfa33af69be8426e5871"}, "author": "", "url": "http://www.freep.com/story/sports/nhl/red-wings/2015/10/23/detroit-red-wings-brad-richards/74469290/", "ord_in_thread": 0, "title": "Wings make some changes; Richards (back) out", "locations": ["USA", "Calgary"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ken Holland", "Richards", "Joe Louis Arena", "Rick Osentoski", "Helene St. James", "Brad Richards", "Jeff Blashill"], "text": "Facebook Email Twitter Google+ LinkedIn Pinterest Red Wings make some changes; Richards (back) out Detroit Red Wings general manager Ken Holland told the Free Press that Brad Richards' injury 'is longer than day-to-day.' Post to Facebook Red Wings make some changes; Richards (back) out Detroit Red Wings general manager Ken Holland told the Free Press that Brad Richards' injury 'is longer than day-to-day.' Check out this story on Freep.com: http://on.freep.com/1S13XOw Cancel Send A link has been sent to your friend's email address. Posted! A link has been posted to your Facebook feed. 7 To find out more about Facebook commenting please read the Conversation Guidelines and FAQs Red Wings make some changes; Richards (back) out Helene St. James, Detroit Free Press 3:35 p.m. EDT October 23, 2015 Detroit Red Wings coach Jeff Blashill talks changes Friday, Oct. 23, 2015, in Calgary. Video by Helene St. James / DFP Detroit Red Wings center Brad Richards, right, receives congratulations after scoring in the third period against the Toronto Maple Leafs at Joe Louis Arena. (Photo: Rick Osentoski USA TODAY Sports) 12 CONNECT 15 TWEET LINKEDIN 7 COMMENT EMAIL MORE \nCALGARY, Alberta -- The Detroit Red Wings will look considerably different for tonight's game, with changes up front and on defense. \nThe Wings, who have lost three straight games, take on the Flames (1-5) at the Saddledome (9 p.m., FSD). Brad Richards is out of the lineup because of a back injury. General manager Ken Holland told the Free Press that the injury \"is longer than day-to-day. Get him back to Detroit for tests.\" \nThe absence of Richards (who had two assists in six games) pushes Dylan Larkin to center, between Teemu Pulkkinen and Tomas Tatar. Gustav Nyquist slides up to Larkin's spot, playing with Henrik Zetterberg and Justin Abdelkader. \nRiley Sheahan centers Darren Helm and Luke Glendening -- a lot of speed in that group -- and Joakim Andersson is with Drew Miller and Landon Ferraro. \nThere are big changes on defense, too, where Mike Green has been moved to play opposite Niklas Kronwall. Danny DeKeyser and Kyle Quincey are back playing together, reuniting a pairing that was Detroit's steadiest last season. Brendan Smith is back in, after being scratched for two games. He's opposite Jonathan Ericsson. \n\"You are looking for the best chemistry,\" coach Jeff Blashill said. \"When you add new players, as we added with Greener, DK was out for a majority of the preseason and just came back, you are looking for the best chemistry, the guys that work the best together, and sometimes until you try it, you don't know. \"I think to a man, each guy can still be better, regardless of pairings, but hopefully with the pairings, we are putting them in a spot to be successful.\" \nJimmy Howard is starting in goal.", "external_links": [], "published": "2015-10-23T22:35:00.000+03:00", "crawled": "2015-10-24T01:21:48.842+03:00", "highlightTitle": ""}