{"organizations": [], "uuid": "32bcffe5730158f840603d90b720a4e4e27cc273", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mysuburbanlife.com", "main_image": "http://www.mysuburbanlife.com/2015/10/07/outdoors-wisconsin-fishing-facilities-open-doors-for-tours/ajap62b/759a51e6-26fc-4ee9-af46-0ce0365242e6/image-pv_web.jpg", "site_section": "http://mysuburbanlife.com//?rss=sports", "section_title": "Sports", "url": "http://www.mysuburbanlife.com/2015/10/07/outdoors-wisconsin-fishing-facilities-open-doors-for-tours/ajap62b/", "country": "US", "title": "Outdoors: Wisconsin fishing facilities open doors for tours", "performance_score": 0, "site": "mysuburbanlife.com", "participants_count": 0, "title_full": "Outdoors: Wisconsin fishing facilities open doors for tours", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T17:53:00.000+03:00", "replies_count": 0, "uuid": "32bcffe5730158f840603d90b720a4e4e27cc273"}, "author": "", "url": "http://www.mysuburbanlife.com/2015/10/07/outdoors-wisconsin-fishing-facilities-open-doors-for-tours/ajap62b/", "ord_in_thread": 0, "title": "Outdoors: Wisconsin fishing facilities open doors for tours", "locations": ["Wisconsin"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["STEVE SARLEY", "Steve Sarley"], "text": "Outdoors: Wisconsin fishing facilities open doors for tours Published: Thursday, Oct. 8, 2015 9:53 a.m. CDT Caption Steve Sarley By STEVE SARLEY - editorial@lakecountyjournal.com \nThere is so much to do at this time of the year that managing to fit things into a schedule can be a formidable task. Most fish are feeding voraciously for the soon-to-come winter weather, and deer hunting and fall turkey hunting are upon us. \nIf you aren’t into those activities or just have a spare day open on your calendar, there is an educational event forthcoming I believe you may find extremely interesting. \nThe mighty king salmon have started their annual spawning runs into the rivers and tributaries that come off Lake Michigan. Unfortunately, Illinois is not home to many waterways that are suitable for salmon spawning. Fortunately, southern Wisconsin is rife with rivers, streams and brooks these salmon find acceptable for their spawning purposes. \nWhen the kings make their runs, the folks at Wisconsin’s Department of Natural Resources arm themselves with the tools necessary to catch these salmon and to collect their milt and eggs so they can produce new fish for future years. \nThe Wisconsin DNR makes three of its facilities available to the public for viewing and educational tours at this time of year. The C.D. “Buzz” Besadny Anadromous Fish Facility is in Kewaunee near Door County, and the Strawberry Creek facility is located all the way up near Sturgeon Bay. \nConveniently, for those in our area of northern Illinois, the Root River Steelhead Facility in nearby Racine will be open for your enjoyment and education on Saturday. \nWisconsin DNR Fisheries Bureau Director Justine Hasz said, “What started in the 1960s as an effort to control alewife populations by stocking Pacific salmon has turned into a sport fishery that generates some $4 billion per year for the economy of the Great Lakes region. Each year the fall spawning runs are a reminder of how our stocking efforts contribute to this economic impact by creating recreational opportunities for anglers of all ages. We look forward to welcoming visitors to our open houses where they can learn more about our fisheries management and propagation efforts.” \nThe Root River open house will feature egg collection demonstrations, as well as fly casting and fly tying lessons, youth instruction and opportunities to learn Lake Michigan fishing tips from expert anglers. \nThese open house events are free and open to the public with food and beverages available from local groups as well as guided facility tours and activities geared to youth. The Root River event takes place from 9 a.m. to 3 p.m. and is located at 2200 Domanik Drive in Racine. \nTo learn more about the open house events and to get directions, visit dnr.wi.gov and search “fisheries open house.” \n•• • \nI have a file that is full of emails and letters from people telling me they would love to take advantage of Illinois’ wonderful whitetail deer hunting opportunities but they do not have a place to hunt for them. \nI realize access seems to be getting more difficult every year, but there are clever and persistent hunters who are able to score new opportunities each year through effort and persistence. Also, the state always is trying to institute programs that make hunting lands available to the public. \nI just received a notice about a new opportunity that almost blew my mind. Beginning on Nov. 1, the IDNR is offering an archery deer hunting program at Adeline Jay Geo-Karis Illinois Beach State Park in Lake County. How much more convenient could that be? \nThe purpose of this opening of the property to the hunting community is to assist the IDNR in managing the deer population at the site and help to protect vegetation and habitat in the park and nature preserves. \nIllinois Beach State Park, which is one of the most popular tourist attractions in the state, stretches more than 6.5 miles along Lake Michigan and contains unique dune and swale topography with emergent marshes, sedge meadows, wet-mesic prairies and black oak savannas. IBSP is comprised of more than 3,000 acres and contains two dedicated Illinois Nature Preserves. \nThe archery deer program will be initiated in the North Unit’s approximately 900 acres between Nov. 1 and Jan. 17 to reduce the negative impacts of the deer population on vegetation and habitats. \nFor details about the hunt, visit dnr.illinois.gov/hunting/FactSheets/. \nFISHING/HUNTING REPORT \nNorthern Illinois: Dave Kranz from Dave’s Bait, Tackle and Taxidermy in Crystal Lake reports: “The water has started its fall cool down and the fish are starting to put on the feed bag. Walleye and white bass on the Fox River and Fox Chain can be caught on a jig and minnow or jig and one-half of a nightcrawler. Archery hunters are doing well. We are seeing many deer coming in to our trailer for processing by Smokehouse.” \nCall 815-455-2040 for an updated report. \nFox Chain: Chris Taurisano of T-Bone Guide Service ( www.tboneguideservice.com – 630-330-9090) sends word, “Crappies and white bass are schooled up and taking jig-and-minnow combos, jigging spoons, zip lures and small crankbaits. Walleyes are spotty with some fish being caught on deep points. Muskies are being caught on crankbaits and by trolling. Catfish are active with some big fish showing up.” \nArchery deer hunting: Through Sunday, Illinois archery deer hunters harvested a total of 5,140 deer compared to 3,106 for the same period in 2014. Conditions were generally favorable, although somewhat windy. The harvest consisted of 71 percent does and 29 percent males (3,630/ 1,510). The top five counties were Pike (163), Fulton (142), Jefferson (128), Randolph (116) and Adams (110). Totals for some selected northern Illinois counties are McHenry (51), Lake (23), Winnebago (27), Kane (31), DuPage (4), DeKalb (21), Boone (14) and Cook (9). \n•• • \nIDNR Director Wayne Rosenthal sends these reminders, “There is a new law on the books in Illinois that allows young hunters who possess a Youth Hunting License and an archery deer permit to use a crossbow during the archery deer hunting season. The new law took effect in August, and to implement it in time for the 2015-16 archery deer season, the Illinois Department of Natural Resources filed an emergency amendment to the state’s archery deer rule (17 Illinois Administrative Code 670). We will now allow eligible youth who want to take advantage of the new crossbow regulation to do so if the youth is under the direct supervision of a parent, grandparent, or guardian who is 21 years of age or older. The adult supervisor accompanying the youth, while hunting with a crossbow, must have both a valid Illinois hunting license and valid archery deer permit. \n“While archery deer hunting is underway, October also features the annual Youth Firearm Deer Season on the Saturday, Sunday and Monday of Columbus Day weekend (October 10-12). Here’s an important safety reminder: During the Youth Firearm Deer Season weekend, all hunters (including archery hunters) and those accompanying youth hunters must wear the blaze orange required of firearm hunters … a blaze orange cap and upper garment with a minimum of 400 square inches of solid blaze orange material. \n“A few other reminders for deer hunters as we move through autumn: The regular Firearm Deer Season is Nov. 20 through 22 and Dec. 3 through 6; the Muzzleloader-only Deer Season is Dec. 11, 12 and 13; the Late-Winter Antlerless-only Deer Season and Special CWD Deer Season are Dec. 31 through Jan. 3 and Jan. 15, 16 and 17.” \nFor more complete details on Illinois deer seasons and regulations, check the Illinois Digest and Hunting and Trapping Regulations 2015-2016 and the IDNR website at dnr.illinois.gov. \n•• • \nThe Lake Geneva Fishing Club meets Oct. 14 at Cabela’s in Hoffman Estates near the intersection of Routes 72 and 59. The meeting begins at 6:30 p.m. in the upstairs meeting room next to the Café. This will be the group’s last meeting of the 2015 season and a club member expert panel will be recapping the 2015 season and their plans for 2016. The panel will be comprised of Frank Miller, Jim Bloede, Ben Garvens, and Paul Beran. The meeting is open to guests for a charge of $5. The fee is deductible from your dues if you decide to join the club. The club’s dues are $35 per year with $5 charge for processing new members. For more information, call Bob Clark at 815-527-5109 or send an email to robtmclark@aol.com. \n• Steve Sarley writes about the outdoors for Shaw Media. Write to him at sarfishing@yahoo.com.", "external_links": [], "published": "2015-10-08T17:53:00.000+03:00", "crawled": "2015-10-09T09:02:34.232+03:00", "highlightTitle": ""}