{"organizations": [], "uuid": "664f8d089a9e5c52a57359b37ac676e430da2773", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pe.com", "main_image": "http://images.onset.freedom.com/pressenterprise/thumb/nwgbcc-b88543838z.120151018220054000gl5clgf6.50.jpg", "site_section": "http://www.pe.com/sections/sports/", "section_title": "Sports : Press Enterprise", "url": "http://www.pe.com/articles/shot-783830-going-ducks.html", "country": "US", "title": "Ducks find net, win column in 4-1 triumph over Wild", "performance_score": 0, "site": "pe.com", "participants_count": 1, "title_full": "Ducks find net, win column in 4-1 triumph over Wild - Press Enterprise", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "664f8d089a9e5c52a57359b37ac676e430da2773"}, "author": "ERIC STEPHENS", "url": "http://www.pe.com/articles/shot-783830-going-ducks.html", "ord_in_thread": 0, "title": "Ducks find net, win column in 4-1 triumph over Wild", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By ERIC STEPHENS / STAFF WRITER\nPublished: Oct. 18, 2015 Updated: 10:06 p.m. ANAHEIM – Exhale.\nCam Fowler did so and his Ducks teammates followed suit. And an entire fan base within and beyond Honda Center joined right in Sunday night.\nA night that is supposed to occur with regularity for the Ducks finally took place five games in. Fowler’s goal woke up an offensive attack that had been in hibernation, backing Anton Khudobin’s 34-save effort in a 4-1 victory over the Minnesota Wild.\nThe Ducks (1-3-1) were one of three winless teams left in the NHL entering Sunday. And they had just one lone goal in their 245 minutes of unfulfilled activity and staring at a difficult five-game trip through the minefield that is the Central Division.\nEverything changed at 10:08 of the first period. Fowler got a pass from Ryan Getzlaf and fired a seeing-eye shot that cut through a traffic jam in front of Wild goalie Devan Dubnyk and got by him. And with that, the Ducks defenseman had a sigh of relief.\n“When things aren’t going great for your team, sometimes you just need little bit of a confidence boost to get going in the right direction,” Fowler said. “It did kind of feel like a monkey off my back there.\n“Credit for our guys for sticking with it. We were able to sneak some by him today so that was good.”\nThe goal in front of a satisfied 16,784 in attendance stopped a scoreless streak of 173 minutes, 12 seconds going back to Sami Vatanen’s goal in the home opener Monday against Vancouver. And then the forwards finally got going.\nRickard Rakell became the first. After Minnesota’s Nino Niederreiter tied the score off the rush in the first, Rakell got his stick on a point shot from Hampus Lindholm for a 2-1 lead at 16:01 of the first.\nIt was a reward for the young center, who was the Ducks’ most dangerous forward all game.\n“I think everybody just wants to score really bad,” Rakell said. “It’s all about the team right now. It’s a good feeling.”\nMike Santorelli added a key insurance goal in the third and Lindholm added an empty-net score on a backhand shot across the rink. It was more than enough for their man in goal Sunday.\nDucks coach Bruce Boudreau gave Khudobin the start over Frederik Andersen even with his team in need of its first win. It had long been planned, Boudreau said, with the idea of not letting the veteran continue to sit on a forgettable debut Wednesday against Arizona.\nKhudobin didn’t make it to the 13-minute mark against the Coyotes, with Boudreau pulling him after three goals on eight shots. He went the distance against the Wild in overcoming some early hairy moments and improving as the game went on.\n“I said to myself, ‘Don’t focus on anything but just shot after shot,’” Khudobin said. “One shot, next shot, third shot and just keep going. Whatever the score’s going to be, whatever the game’s going to turn out, you just have to do this.”\nThe strong effort – aided by shots from the Wild’s Jonas Brodin and Mikko Koivu that hit the crossbar – helped restore the confidence level in the goalie. Khudobin was brought in over the summer as the new backup to Andersen so the Ducks could have John Gibson play every night in the AHL.\n“I really believed he was going to play very good today,” Boudreau said. “He’s been a good goalie all along. Sometimes you have a bad game, you throw the guy right back in and he proved what he was. He’s a really good goaltender.”\nContact the writer: estephens@ocregister.com", "external_links": [], "published": "2015-10-18T03:00:00.000+03:00", "crawled": "2015-10-19T09:22:14.473+03:00", "highlightTitle": ""}