{"organizations": [], "uuid": "6482505c9ee688113d93bb3cc785dbd68dd24ad0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/soccer", "section_title": "Soccer News, Scores, Schedule, Standings, Stats, Photos, Videos - MSN Sports", "url": "http://www.msn.com/en-us/sports/uefa-champions-league/bayern-thrash-dinamo-zagreb-thanks-to-ruthless-lewandowski/ar-AAeVB8n", "country": "US", "title": "Bayern thrash Dinamo Zagreb thanks to ruthless Lewandowski", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "Bayern thrash Dinamo Zagreb thanks to ruthless Lewandowski", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "6482505c9ee688113d93bb3cc785dbd68dd24ad0"}, "author": "Ross Dunbar", "url": "http://www.msn.com/en-us/sports/uefa-champions-league/bayern-thrash-dinamo-zagreb-thanks-to-ruthless-lewandowski/ar-AAeVB8n", "ord_in_thread": 0, "title": "Bayern thrash Dinamo Zagreb thanks to ruthless Lewandowski", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bayern thrash Dinamo Zagreb thanks to ruthless Lewandowski FOXSports 1 day ago Ross Dunbar © AFP/Getty Images Bayern Munich's Polnish striker Robert Lewandowski (L) celebartes after scoring the fifth goal during the Group F, first-leg UEFA Champions League football match FC Bayern Munich vs GNK Dinamo Zagreb in Munich, on September 29, 2015. AFP PHOTO / GUENTER SCHIFFMANN (Photo credit should read GUENTER SCHIFFMANN/AFP/Getty Images) Robert Lewandowski continued his sensational scoring form to fire Bayern Munich to a 5-0 Champions League thrashing of Dinamo Zagreb.\nThe 27-year-old netted a hat-trick to make it 10 goals in his last three appearances for the German champions, and keep up Bayern's 100% record in all competitions this season - their only defeat was the Super Cup loss against Wolfsburg.\nAdChoices After Douglas Costa had opened the scoring, Lewandowski scored two goals in eight minutes with Mario Gotze netting in between to send Bayern into the break with a four-goal lead.\nThe Polish hit man secured the match ball on 55 minutes with his third of the night and 14 in all competitions this season. Bayern Munich already looks in the driving seat in their group phase following Arsenal's 3-2 defeat at home to Olympiacos.\nThe German champions and present league-leaders head for North London next month in their third appearance at the Emirates in as many years. With Borussia Dortmund to come on Sunday, Pep Guardiola was economical in his selection: Thomas Muller and Xabi Alonso were rested, while Javi Martinez sat out the first 45 minutes before making an appearance at the break. Young midfielder Joshua Kimmich made his first Champions League start for the Bavarians.\nDinamo Zagreb keeper Eduardo was probably prepared for one of his busier evenings between the sticks and the barrelage began on 10 minutes. Center-back Jerome Boateng stepped out of the back and unleashed a great strike, which the Dinamo keeper managed to keep out.\nBut three minutes later, the ball was over the line. Speedy Brazilian winger Douglas Costa rampaged down the left and rather than drilling the ball across the face of goal, he managed to squeeze it into the near post gap and past Eduardo.\nHaving scored seven goals in his last two league games, Bayern couldn't realistically score a few without Lewandowski getting involved. On 21 minutes, Thiago did all the work, driving powerfully from his central-midfield position and setting up the Pole who struck home.\nThree minutes later, Gotze racked up a goal after a barren spell in the starting eleven. The World Cup winner confidently came inside with the ball, linked with Kingsley Coman, before slotting the ball past Eduardo. The veteran Portuguese keeper barely attempted to moan at his defenders, who looked dead on their feet midway through the first half.\nOn 27 minutes, Costa's delivery was met by Lewandowski yards from goal and he managed to clip the ball high into the net. The striker - who is top scorer in Euro 2016 qualification for his country - is now level with Mario Gomez on Champions League goals - the overall club record is held by Bayern teammate Muller.\nWhen Zagreb had possession and looked to break, the players appeared to run out of ideas. The attack was led by 20-year-old Marko Pjaca who scored three goals in qualification and has reportedly attracted interest from Europe's biggest clubs, including Bayern. Goalkeeper Manuel Neuer anticipated a long ball around 40 yards from his goal and cleared without any problems.\nLeft-back Josip Privaric has scored two goals in the Champions League this season and has assisted three goals in seven league games for the Croatian champions. But he was unable to contribute in attack, with Gotze tracking the full-back well and threatening to exploit any gaps in behind. Zagreb's two leading scorers this season - Angelo Henriquez and Armin Hodzic - were both left on the bench.\nMartinez, who is slowly stepping back into contention, was introduced at the break and given 45 minutes to get up to speed ahead of Sunday's clash with Dortmund.\nLewandowski bagged his hat trick 10 minutes after the interval, just a week after scoring five goals in nine minutes against Wolfsburg in the Bundesliga. Thiago and Costa combined to superb effect and Lewandowski's finish lobbed over the head of Eduardo. Zagreb, who qualified through three rounds and lead their domestic league, see their impressive unbeaten run of 45 games come to a disappointing end.\nZagreb naturally had one or two forays forward, but the introduction of Martinez brought more stability to the side. The Spaniard looks in neat shape and could be a surprise inclusion in the coming weeks. Meanwhile, Kimmich lasted the full 90 minutes in midfield, turning in another excellent performance. Pep Guardiola was able to utilize his options with Muller coming off the bench for a late cameo appearance.\nWith no defeats in the Champions League or Bundesliga, Bayern's biggest tests of the season are about to come with Borussia Dortmund the next visitors to the Allianz Arena.\nGo to MSN Home", "external_links": ["http://www.foxsports.com/", "http://go.microsoft.com/fwlink/?LinkID=286759"], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-10-01T02:37:13.440+03:00", "highlightTitle": ""}