{"organizations": [], "uuid": "afd6cfe6c057e5004f5cbe1e1d2a7a39b83de522", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/Category/6/55/Sports/World.aspx", "section_title": "World - Sports - Ahram Online ", "url": "http://english.ahram.org.eg/NewsContent/6/55/161457/Sports/World/Giroud-thanks-helping-hand-of-destiny-for-Arsenal-.aspx", "country": "EG", "title": "Giroud thanks helping hand of destiny for Arsenal opener", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Giroud thanks helping hand of destiny for Arsenal opener - World - Sports - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "afd6cfe6c057e5004f5cbe1e1d2a7a39b83de522"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/6/55/161457/Sports/World/Giroud-thanks-helping-hand-of-destiny-for-Arsenal-.aspx", "ord_in_thread": 0, "title": "Giroud thanks helping hand of destiny for Arsenal opener", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Giroud and Ozil lead Arsenal to victory over Bayern Match facts: Arsenal v Bayern Munich (UEFA Champions League) Arsenal forward Olivier Giroud thanked the helping hand of destiny after inspiring Arsenal to a 2-0 victory over German champions Bayern Munich in the Champions League on Tuesday.\nThe France international came off the bench to bundle home Santi Cazorla's free kick in the 77th minute, an effort that appeared to bounce off his hand before finding its way into an unguarded net.\nThe goal was also aided by Bayern goalkeeper Manuel Neuer failing to deal with Cazorla's delivery.\nGiroud, who has started mainly on the bench this term after some inconsistent displays, was grateful for a little bit of fortune as he made it three goals in his last four appearances.\n\"I've had a bit more luck than in recent weeks, so I'm making the most of it. For a striker, it always works in cycles and I know that. You can't start doubting yourself,\" Giroud told reporters after the game\n\"All the qualities are there -- I just needed a helping hand from destiny, and tonight it worked out in my favour. It's certainly not my most beautiful goal but it's one of the most important.\"\nArsenal kept Bayern's in-form Polish striker Robert Lewandowski, who has already scored 22 goals this season, at bay and vice-captain Per Mertesacker praised his side for a united effort as well as goalkeeper Petr Cech for some key saves.\n\"I think that was a team effort. It was difficult for him. He always tried to come a bit deeper to get the ball and get into the holes. I think he had a great chance in the second half but we have a great goalkeeper for him,\" Mertesacker said.\nCech, who was making his Champions League debut for Arsenal, said he hoped the morale-boosting win would kick-starts some winning momentum after Arsenal started with two defeats in Group F against Dinamo Zagreb and Olympiakos Piraeus.\n\"We obviously needed to win three points and we are back in the game,\" the former Chelsea stopper said.\n\"The position has not changed but now with these three points it was crucial to win and we can carry on at the moment in the league then in two weeks we will try to do the same.\"\n ", "external_links": ["https://twitter.com/AO_Sports", "https://www.facebook.com/AhramOnlineSports?fref=ts"], "published": "2015-10-21T03:00:00.000+03:00", "crawled": "2015-10-21T19:02:20.970+03:00", "highlightTitle": ""}