{"organizations": [], "uuid": "4d8f874d0d3e8539ea46b8598e32f70b4f0aac6c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pr.com", "main_image": "", "site_section": "http://www.pr.com/news-by-category/160", "section_title": "Sports: Golf Press Releases and News - PR.com", "url": "http://www.pr.com/press-release/640472", "country": "US", "title": "Kenny Giannini Putters Partners with Desert Classic Charities for CareerBuilder Challenge 2016", "performance_score": 0, "site": "pr.com", "participants_count": 1, "title_full": "Kenny Giannini Putters Partners with Desert Classic Charities for CareerBuilder Challenge 2016 - PR.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "4d8f874d0d3e8539ea46b8598e32f70b4f0aac6c"}, "author": "PR.com", "url": "http://www.pr.com/press-release/640472", "ord_in_thread": 0, "title": "Kenny Giannini Putters Partners with Desert Classic Charities for CareerBuilder Challenge 2016", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kenny Giannini Putters Partners with Desert Classic Charities for CareerBuilder Challenge 2016\nFormerly the Humana Challenge, CareerBuilder is the new title sponsor of the annual event and will continue to celebrate the legacy of Bob Hope while also continuing a health-themed focus in conjunction with the Clinton Foundation. Kenny Giannini Putters  with 35 years of precision in every putt  has partnered with Desert Classic Charities, the non-profit organizer of the CareerBuilder Challenge, to provide 165 putters for the 2016 tournament.\nIndian Wells, CA, October 15, 2015 --( PR.com )-- Kenny Giannini Putters Partners with Desert Classic Charities to Provide Premium Putters for CareerBuilder Challenge 2016.\nKenny Giannini Putters – with 35 years of precision in every putt – has partnered with Desert Classic Charities, the non-profit organizer of the CareerBuilder Challenge, to provide 165 putters for the 2016 tournament. With a selection of four different models, the putters will be provided to all amateurs for play on Wednesday and Thursday’s rounds during the seven day event taking place January 18 - 24.\nKenny Giannini putters continues to attract attention from event organizers and major players recognizing the outstanding performance of the putters, coupled with great looks, an unmatched quality, and a unique feel. The state-of-the-art putters are billet-milled, solid, one-piece putters that incorporate a milled Soft Slotted Face Technology (SSFT) ® slotted sole. They are carefully designed by Kenny Giannini himself, who has mentored the top industry names in putter design and has more than 35 years of experience in the industry with the Ben Hogan Company, Cleveland Golf, Mizuno Golf and others.\n“We are thrilled to be involved with this legendary event,” said Managing Partner Tim Mooney of Kenny Giannini Putters. “Our continued partnership outreach with event organizers and our global expansion continues to draw a heightened level of interest in our premium putters, and we hope to see more of them in the hands of everyday golfers and more tour winners.”\nTour winners openly embracing the Giannini putters include Roger Chapman, Russ Cochran, Mark O’Meara, Fred Funk, Gene Sauers, John Riegger, Jose Conceros, Charlie Beljan, Chris Stroud, J. Song, Jennie Lee, Steve Flesh, Bob Tway, Zack Fischer, Tim O’Neal, Josh Broadway, Sam Saunders, Horatio Leon, John Kendall, Chris Evans, and others.\nManufactured in the USA, Kenny Giannini Putters are available direct through the company, in select PGA Tour Superstores and other retail outlets on the East and West Coast, as well as internationally in Asia and Europe. For more information on Kenny Giannini Putters visit www.kennygianniniputters.com or call 855-278-9473. For more information on CareerBuilder Challenge 2016 in partnership with the Clinton Foundation visit www.careerbuilderchallenge.com.\nFormerly the Humana Challenge, CareerBuilder is the new title sponsor of the annual event and will continue to celebrate the legacy of Bob Hope while also continuing a health-themed focus in conjunction with the Clinton Foundation. Tickets have gone on sale this month for the three-day Pro-Am format which provides the only opportunity in the world to tee it up with six PGA Tour professionals during their competitive tournament rounds. Participants compete on world-class courses alongside PGA TOUR pros in two-person teams each day. Winners receive coveted daily and overall trophies and have a chance to make the cut and play on Sunday for the championship.\nAbout Kenny Giannini Putters:\nCalled “superb” by Golf WRX, Kenny Giannini Putters have helped secure more than 100 Tour wins, have made the cover of Sports Illustrated, and have been nominated for Golf Digest Magazine’s Hot 100 equipment list -- the ultimate golf equipment guide. Giannini state-of-the-art putters are billet-milled, solid, one-piece putters that incorporate a milled Soft Slotted Face Technology (SSFT) ® slotted sole. These putters are carefully designed by Kenny Giannini himself, who has more than 35 years experience in the industry, with the Ben Hogan Company, Cleveland Golf, Mizuno Golf and more. Kenny Giannini Putters are available at www.kennygianniniputters.com, by calling 855-278-9473, or at select PGA Tour Superstores and other retail locations around the country.\nMedia Contact:\nChris Clemens\nChris@Clemens-PR.com\nPhone (760) 578-8700", "external_links": [], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-24T03:00:04.652+03:00", "highlightTitle": ""}