{"organizations": [], "uuid": "75cff1e2e7a8222afb6c3ca4bc6f61976aa1fbb0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.northjersey.com", "main_image": "http://www.northjersey.com/designimages/NorthJerseyFacebook_377x196.jpg", "site_section": "http://www.northjersey.com/cmlink/sports-rss.rss", "section_title": "Sports News on NorthJersey.com", "url": "http://www.northjersey.com/sports/football/giants/giants-take-precautions-to-halt-mrsa-spread-1.1428137", "country": "US", "title": "Giants notes: Team takes precautions to halt MRSA spread", "performance_score": 0, "site": "northjersey.com", "participants_count": 0, "title_full": "Giants notes: Team takes precautions to halt MRSA spread", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T08:20:00.000+03:00", "replies_count": 0, "uuid": "75cff1e2e7a8222afb6c3ca4bc6f61976aa1fbb0"}, "author": "", "url": "http://www.northjersey.com/sports/football/giants/giants-take-precautions-to-halt-mrsa-spread-1.1428137", "ord_in_thread": 0, "title": "Giants notes: Team takes precautions to halt MRSA spread", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Print \nEAST RUTHERFORD — The Giants addressed the issue of MRSA with their players Wednesday at the request of both the NFL and NFLPA, and precautions have been taken to prevent the spread of infection. \nTight end Daniel Fells is out for the season after he developed MRSA, a serious staph infection involving powerful bacteria resistant to penicillin-type treatment. \nFells was being examined for a lingering ankle condition when doctors discovered a staph infection. He has been hospitalized and is receiving treatment since the weekend. Giants coach Tom Coughlin said he spoke to Fells and that \"they're thinking Thursday he'll be able to get out.\" \nThe team facility was scrubbed clean Tuesday during the players' day off. \nThe league has adjusted its protocols to prevent infection outbreaks like the one at the Tampa Bay Buccaneers' facility in 2013. Three players – former Giants kicker Lawrence Tynes, guard Carl Nicks and cornerback Johnathan Banks — were diagnosed with MRSA that season. \nGiants cornerback Prince Amukamara said he developed MRSA during his first year at Nebraska, but was unaware of the dangers of the virus at the time. \n\"It is like a very extreme case of the flu,\" Amukamara said. \"My body, I almost felt like paralyzed. Didn't want to move, didn't want to get up and shower, always felt cold. It was like an extreme case of the flu.\" \n\"I feel for Danny Fells and what he's going through [with MRSA],\" Giants quarterback Eli Manning said. \"Unfortunate, but I'm not worried about being here.\" \nBRIEFS: WR Victor Cruz (calf), DE Robert Ayers (hamstring) and LB Devon Kennard (hamstring) did not practice. LT Ereck Flowers and DT Markus Kuhn were full participants. … The Giants signed WR Myles White to the active roster from their practice squad.  ", "external_links": [], "published": "2015-10-08T08:20:00.000+03:00", "crawled": "2015-10-08T09:50:25.368+03:00", "highlightTitle": ""}