{"organizations": [], "uuid": "42b213f0a06e2b4d2acf72714b3ab0c0b9e1a8a5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.shanghaidaily.com", "main_image": "http://www.shanghaidaily.com/newsimage/2015/10/25/020151025005036.jpg", "site_section": "http://rss.shanghaidaily.com/portal/mainsite/Sports", "section_title": "Shanghai Daily: Sports", "url": "http://www.shanghaidaily.com/sports/soccer/Mourinho-banished-as-Carroll-deepens-Chelsea-gloom/shdaily.shtml", "country": "", "title": "Mourinho banished as Carroll deepens Chelsea gloom", "performance_score": 0, "site": "shanghaidaily.com", "participants_count": 0, "title_full": "Mourinho banished as Carroll deepens Chelsea gloom", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T19:44:00.000+03:00", "replies_count": 0, "uuid": "42b213f0a06e2b4d2acf72714b3ab0c0b9e1a8a5"}, "author": "", "url": "http://www.shanghaidaily.com/sports/soccer/Mourinho-banished-as-Carroll-deepens-Chelsea-gloom/shdaily.shtml", "ord_in_thread": 0, "title": "Mourinho banished as Carroll deepens Chelsea gloom", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mourinho", "Carroll"], "text": "Mourinho banished as Carroll deepens Chelsea gloom Source: AFP | October 25, 2015, Sunday | Online Edition \nChelsea manager Jose Mourinho was banished to the stands amid more furore over refereeing decisions as his side slumped to a 2-1 defeat at West Ham United on Saturday. \nNemanja Matic was sent off in the first half for two bookable offences with Mourinho's men already trailing to Mauro Zarate's goal. \nThe second yellow came directly after a disallowed Chelsea goal that had seemed legitimate and following an earlier incident when goal-line technology ruled out another effort that did not quite cross the line. \nMourinho has already earned himself a fine and a suspended stadium ban for repeatedly claiming officials have a vendetta against him and his team. \nAnd he was sent to the stands for the whole of the second half by referee Jon Moss, who had earlier expelled first-team coach Silvino Louro from the technical areas. \nGary Cahill equalised early in the second half, but substitute Andy Carroll won it for West Ham, who moved up to second place on the final whistle. \nLast season's champions can now be found down in 15th place after a fifth defeat in 10 matches. \nWest Ham opened the scoring in the 17th minute. \nAsmir Begovic did well to tip over Dimitri Payet's free-kick, but Diego Costa could only divert the resulting corner to where Zarate was lurking on the right of the box and the Argentinian drove home. \nUpton Park erupted, the home fans serenading Mourinho with the inevitable chants of \"You're getting sacked in the morning!\" and \"You're not special any more!\" \nCesar Azpilicueta was booked for fouling Zarate before Ramires failed to atone for his error by blasting another long-ranger well over. \nThe champions penned in their hosts for a spell that saw home goalkeeper Adrian make a diving save to keep out Willian's free-kick and Manuel Lanzini hook away a header from Kurt Zouma. \nThe goal-line technology replay showing that only a tiny portion of the ball had not crossed the white paint of the line. \n\n- Fabregas denied - \n\nMatic was shown his first yellow card for tugging Cheikhou Kouyate down to end a storming counter-attack. \nLanzini should have made it 2-0 when he chipped over with only Begovic to beat and a raised flag denied Cesc Fabregas when he accepted Willian's pass and beat Adrian. \nIt was assistant referee Andrew Halliday's call and television replays suggested the goal should have stood. \nSuddenly Harry Lennard, the other linesman, was the focal point, signalling to Moss that Matic's foul on Diafra Sakho right in front of him was enough to warrant a second yellow card. \nThe Serb departed a minute before the break, with Mourinho merely smiling ruefully. \nBut Louro's temper was already at boiling point and he was sent to the stands for a furious verbal volley at the officials, while Fabregas and Costa were also booked for complaining. \nJohn Mikel Obi replaced Fabregas for the second half as Mourinho himself failed to reappear on the touchline, instead popping up high in the main stand. It soon emerged that Moss had expelled him during the interval. \nThe 10 men equalised in the 56th minute when Cahill lashed a high shot past Adrian after the ball fell kindly for him at a corner. Mourinho remained stony-faced for that one. \nBegovic saved from Zarate and John Terry did well to thwart the forward from the next attack, but Chelsea were looking as comfortable as they had ever been, with Costa heading a Willian free-kick over at the other end. \nWest Ham were looking short of ideas and Zarate was replaced by Carroll as manager Slaven Bilic decided to switch to Plan B. \nIt worked as the huge striker rose to nod the Hammers back in front, out-jumping the static Azpilicueta to meet Aaron Cresswell's cross from the left in the 79th minute. \nThat deflated Chelsea, who sent on Radamel Falcao in the forlorn hope of a second equaliser that did not come.", "external_links": [], "published": "2015-10-24T19:44:00.000+03:00", "crawled": "2015-10-25T07:18:53.458+02:00", "highlightTitle": ""}