{"organizations": [], "uuid": "a5aeaa71e110aed9d80aff2fff09f99d4cd2d226", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kptv.com", "main_image": "http://KHNL.images.worldnow.com/images/9055290_G.gif", "site_section": "http://www.kptv.com/", "section_title": "Portland, OR News, Weather, Traffic, Sports | Oregon - KPTV - FOX 12", "url": "http://www.kptv.com/story/30270694/tropical-storm-olaf-forms-in-east-pacific", "country": "US", "title": "Major hurricane Olaf strengthens, enters Central Pacific", "performance_score": 0, "site": "kptv.com", "participants_count": 1, "title_full": "Major hurricane Olaf strengthens, enters Central Pacific - KPTV - FOX 12", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T22:15:00.000+03:00", "replies_count": 0, "uuid": "a5aeaa71e110aed9d80aff2fff09f99d4cd2d226"}, "author": "Ben Gutierrez", "url": "http://www.kptv.com/story/30270694/tropical-storm-olaf-forms-in-east-pacific", "ord_in_thread": 0, "title": "Major hurricane Olaf strengthens, enters Central Pacific", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "HONOLULU (HawaiiNewsNow) - Hurricane Olaf has gained more strength as it entered the Central Pacific basin.\nThe Central Pacific Hurricane Center said at A 11 p.m. Monday, Olaf's winds had increased to 150 miles per hour, making it a Category 4 hurricane. It was located approximately 1,175 miles east-southeast of the Big Island, or 1,385 miles east-southeast of Honolulu, and was moving toward the west-northwest at 10 miles per hour.\nHurricane force winds extend up to 35 miles outward from the center, and tropical storm force winds extend outward up to 140 miles. Satellite imagery shows a well-defined eye.\nForecasters said some additional strengthening is forecast Tuesday, with fluctuations in intensity Tuesday night and Wednesday. Olaf should turn toward the northwest on Wednesday.\n The current forecast track keeps it well east of Hawaii.\nThe National Weather Service in Honolulu said if Olaf follows the current forecast track, it will not have any direct impact on the Hawaiian islands; at most, it could turn our trade winds more northerly as it passes to the east. However, weather models indicate that swells from Olaf will begin to reach the east-facing shores of the Big Island by Wednesday. Surf heights will most likely exceed advisory levels and possibly reach warning levels Thursday and Friday. The swell will then slowly diminish over the weekend.\nFor the other islands the swell will likely arrive by Thursday and linger through the weekend. Surf heights will likely reach advisory levels and possibly low end warning levels during the peak of the swell. Much will depend on the Olaf's size, track and intensity .\nOlaf is the 15th tropical cyclone in the basin this year. The previous record was 11.\nCheck out our special Hawaii News Now Hurricane Center by downloading our news app.\nAlso get real-time access to severe weather alerts. Download the HNN Weather App .\nOr text - APP to hnn808 (466808) (message & data rates may apply)\nCopyright 2015 Hawaii News Now . All rights reserved.", "external_links": ["http://www.ssd.noaa.gov/PS/TROP/floaters/19E/imagery/rb-animated.gif", "http://bit.ly/1b5IAeM", "http://bit.ly/UrsPUf"], "published": "2015-10-15T22:15:00.000+03:00", "crawled": "2015-10-20T12:04:40.669+03:00", "highlightTitle": ""}