{"organizations": [], "uuid": "1e72933071b151a628a4ddac29784f45547ecfc3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nydailynews.com", "main_image": "http://assets.nydailynews.com/polopoly_fs/1.316738!/img/httpImage/image.jpg_gen/derivatives/landscape_1200/alg-400meter-jpg.jpg", "site_section": "http://www.nydailynews.com/sports/index.html", "section_title": "Sports News &amp; Articles: Today’s Latest Sports News - NY Daily News", "url": "http://www.nydailynews.com/sports/angelo-taylor-leads-400-meter-hurdle-sweep-u-s-track-team-battles-back-article-1.316737", "country": "US", "title": "Taylor leads American sweep in 400-meter hurdles", "performance_score": 0, "site": "nydailynews.com", "participants_count": 1, "title_full": "Taylor leads American sweep in 400-meter hurdles - NY Daily News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "1e72933071b151a628a4ddac29784f45547ecfc3"}, "author": "NEW YORK DAILY NEWS", "url": "http://www.nydailynews.com/sports/angelo-taylor-leads-400-meter-hurdle-sweep-u-s-track-team-battles-back-article-1.316737", "ord_in_thread": 0, "title": "Taylor leads American sweep in 400-meter hurdles", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Terrill/AP Angelo Taylor (r.) leads American sweep of the 400-meter hurdles along with teammates Kerron Clement (l.) and Bershawn Jackson. BEIJING - Between the time he won his first two Olympic gold medals in Sydney and his third one here Monday night, Angelo Taylor had two cracked shins, a four-month stint as an electrician and one guilty plea stemming from his involvement with two underage girls.\nHe was dumped by his shoe sponsor, and was a sprinter non-grata on the European track circuit.\n\"Here he was, an Olympic gold medalist, and nobody wanted him,\" said his friend and coach, Innocent Egbunike.\nSo you can imagine how it felt to be 29-year-old Angelo Taylor in the Bird's Nest, leading a 400-meter hurdle sweep for a suddenly resurgent U.S. track team, being bathed in cheers by 91,000 people, authoring a comeback story worthy of a miniseries.\n\"This is the best thing that has ever happened to me,\" Taylor said. \"To go through what I went through and be back on top means the world to me.\"\nSomeone asked how it compared to winning the hurdles and 4x400 relay gold in 2000.\n\"There's no comparison,\" he said.\nPHOTO GALLERY: BEST OF BEIJING (VOL. 2) After a perfectly terrible start to the Olympic track meet - including the early exits of world champions Tyson Gay in the 100 meters and Bernard Lagat in the 1,500, and the absence of American long jumpers and high jumpers in the Olympic finals for the first time in a non-boycotted Games - the Americans needed a jolt. They needed it even more after Terrence Trammell , two-time silver medalist in the 110 hurdles - strained a hamstring in his heat and didn't make it over the second hurdle Monday morning.\nEnter the 400 hurdlers, wiith Taylor running a personal-best 47.25, ahead of silver medalist Kerron Clement (47.98) and bronze medalist Bershawn Jackson (48.06).\n\"The U.S. hasn't really had a great showing so far,\" Taylor said. \"We wanted to uplift the team.\"\nDay 4 of the meet began with the chilling spectacle of Chinese star Liu Xiang , the 110-hurdle gold medalist in Athens , withdrawing from the competition with a heel injury. It ended with Russian pole-vaulting diva Yelena Isinbaeva setting a world record by clearing 16 feet, 63/4 inches, outdueling American record-holder and silver medalist Jenn Stucyzinski , who went over at 15-9, but missed all three attempts at 16-03/4.\nTerrill/AP Angelo Taylor (r.) leads American sweep of the 400-meter hurdles along with teammates Kerron Clement (l.) and Bershawn Jackson. In between, there was Panama 's first Olympic track and field gold medal, courtesy of world high-jump champion, Irving Saladino (27 feet, 41/2 inches), and a stunning run by Kenyan prodigy Pamela Jelimo , an 18-year-old who set a world junior record in winning the 800 meters in a personal-best one minute, 54.87.\nJelimo was followed by countrywoman Janeth Jepkosgei Busienei (1:56.07) and Morocco 's Hasna Benhassi (1:56.73).\nFor the Americans, the night got off to an auspicious start with Stephanie Brown Trafton , who captured the first Olympic gold medal in the women's discus since 1932, when the heroine was named Lillian Copeland .\nBrown Trafton's first athletic hero was Mary Lou Retton , whom she watched in the 1984 Olympics. Trafton had a Mary Lou leotard, and wanted to do her own flips, until she grew beyond six feet in seventh grade. She now stands 6-4 and 225 pounds.\n\"I got too big to be a gymnast,\" said Brown Trafton, who threw 212-5 with her first throw of the competition and watched it hold up. It didn't hurt her cause that 2008 leader Darya Pishchalnikova was banned for a doping offense just before the Games began.\nTaylor, of course, has had his own ordeal. It began with his arrest in 2005 for having sex with a minor, and culminated with a a 2006 gulty plea for contributing to the delinquency of two girls. He wound up getting probation, but his world-class running window seemed to have closed, especially with debilitating shin problems. By January, 2007, Taylor was working 6 a.m. to 2 p.m. as an electrician, then training after he got off.\n\"To see my son's life exploited in a negative way across the world, that was the hardest part,\" said his mother, Subrena Glenn-Everett.\nTaylor told a reporter before the Games, \"Any mistakes I made, I put the blame on me. It was up to me to do something, to change things.\"\nHe went to work, kept training, kept getting faster, winning two bronzes in last year's world championships. There was no exploitation Monday night, just the dazzling spectacle of Taylor flying over the hurdles, not just getting back to the top of the podium, but running .25 seconds faster than he eight years earlier. The comeback culminated with Angelo Taylor becoming the first man since Edwin Moses to win hurdling golds eight years apart.\n\"It's an honor to be mentioned in the same breath as Edwin Moses,\" Taylor said. \"I just feel very blessed.\"", "external_links": [], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-09T12:10:09.516+03:00", "highlightTitle": ""}