{"organizations": [], "uuid": "d4cf0035381c4f772baee25049d8866a436e41f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.northjersey.com", "main_image": "http://www.northjersey.com/designimages/NorthJerseyFacebook_377x196.jpg", "site_section": "http://www.northjersey.com/cmlink/sports-rss.rss#", "section_title": "Sports News on NorthJersey.com", "url": "http://www.northjersey.com/sports/boxing/underdog-lemieux-has-his-hands-full-1.1434192", "country": "US", "title": "Boxing: Underdog David Lemieux has his hands full - Boxing", "performance_score": 0, "site": "northjersey.com", "participants_count": 1, "title_full": "Boxing: Underdog David Lemieux has his hands full - Boxing - NorthJersey.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T04:21:00.000+03:00", "replies_count": 0, "uuid": "d4cf0035381c4f772baee25049d8866a436e41f1"}, "author": "KEITH IDEC", "url": "http://www.northjersey.com/sports/boxing/underdog-lemieux-has-his-hands-full-1.1434192", "ord_in_thread": 0, "title": "Boxing: Underdog David Lemieux has his hands full - Boxing", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK – David Lemieux sat beside Bernard Hopkins on a couch Wednesday inside Madison Square Garden.\nAccording to Lemieux, he’ll share more than a seat with one of his promoters come Saturday night.\nThe legendary Hopkins was a double-digit underdog against an immensely popular, undefeated star in a middleweight championship unification fight at the Garden 14 years ago, yet dominated Felix Trinidad on his way to a 12th-round technical knockout that completely changed Hopkins’ career. Lemieux is a 16-1 underdog, but the powerful puncher from Montreal promises that he’ll become the boxer who finally ends emerging star Gennady Golovkin’s reign of terror in their middleweight title unification fight.\n\"He’s a very good fighter, very smart,\" Lemieux said. \"But I think I’ve got a lot of surprises to show the world.\"\nLemieux, 26, has knocked out 86 percent of his opponents and has won nine straight fights since suffering back-to-back defeats in 2011 to Mexico’s Marco Antonio Rubio (59-8-1, 51 KOs), a seventh-round technical knockout, and Quebec’s Joachim Alcine (35-7-2, 21 KOs), a 12-round majority decision. He floored France’s Hassan N’Dam (31-2, 18 KOs) four times en route to winning a 12-round unanimous decision and the IBF middleweight title June 20 in Montreal. Golovkin, however, has become a phenomenon by knocking out 20 straight opponents and creating the public perception that most middleweights simply don’t want to fight him.\nThe affable Kazakhstan native needed less than two rounds to annihilate Rubio a year ago, but he won’t allow himself to overlook Lemieux because there’s entirely too much at stake. This fight marks Golovkin’s debut as a pay-per-view headliner for HBO Sports (9 p.m.; $49.99 to $59.99) and has helped sell out Madison Square Garden. A huge payday against the winner of another middleweight title bout between Puerto Rico’s Miguel Cotto (40-4, 33 KOs) and Mexico’s Canelo Alvarez (45-1-1, 32 KOs) on Nov. 21 in Las Vegas could await Golovkin if he overcomes Lemieux. \"He has a lot of power,\" Golovkin, 33, said. \"He’s a very dangerous opponent.\"\nWhile Lemieux isn’t as accomplished as Alvarez or Cotto, his power makes this fight intriguing. Golovkin (33-0, 30 KOs) has never been down as an amateur or pro, not during a fight or a sparring session, and even Golovkin’s trainer, Abel Sanchez, has expressed interest in learning how his dominant destroyer will react to getting hurt in a fight.\n\"He has a good chin, but let’s see,\" Lemieux said. \"Let’s see. I’m ready to put that to the test. I think I will put him off of his feet. … Yes, he has good chin and he’s a tough guy, but he’s only human.\"\nLemieux made changes to his team following his two losses and has improved while working with trainer Marc Ramsey. Sanchez says Golovkin’s \"boxing IQ\" will be the difference Saturday night, though Ramsey, Camille Estephan (Lemieux’s manager) and Hopkins think Lemieux hasn’t gotten enough credit for being more than a fighter who comes forward and knocks out people. \n\"I think he has more than a puncher’s chance,\" said Hopkins, a partner in Oscar De La Hoya’s Golden Boy Promotions, which represents Lemieux. \"This fight will be a little bit more technical than people think. But I still think it’s going to end violently. It’s going to end where somebody’s rescued by the referee or knocked out.\"\nTwitter: @Idecboxing", "external_links": [], "published": "2015-10-16T04:21:00.000+03:00", "crawled": "2015-10-16T08:48:07.328+03:00", "highlightTitle": ""}