{"organizations": ["Western Carolina"], "uuid": "59e24eafeaf5b394bc139a25480be3dcecfeb0c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.citizen-times.com", "main_image": "http://www.gannett-cdn.com/-mm-/8a234cb7e526c0191768deaefc087b1407ec5aa5/c=0-90-2200-1328&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/10/Asheville/B9319219307Z.1_20151010201558_000_G9JC6RKGG.1-0.jpg", "site_section": "http://rssfeeds.citizen-times.com/asheville/sports", "section_title": "Asheville - Sports", "url": "http://www.citizen-times.com/story/sports/2015/10/10/western-carolina-rallies-beat-mercer-24-21/73740562/", "country": "US", "title": "Western Carolina rallies to beat Mercer, 24-21", "performance_score": 0, "site": "citizen-times.com", "participants_count": 0, "title_full": "Western Carolina rallies to beat Mercer, 24-21", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T03:19:00.000+03:00", "replies_count": 0, "uuid": "59e24eafeaf5b394bc139a25480be3dcecfeb0c6"}, "author": "", "url": "http://www.citizen-times.com/story/sports/2015/10/10/western-carolina-rallies-beat-mercer-24-21/73740562/", "ord_in_thread": 0, "title": "Western Carolina rallies to beat Mercer, 24-21", "locations": ["Western Carolina"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Wes Holcombe", "Keion Crossen", "Keith Jarrett", "Mercer"], "text": "Western Carolina rallies to beat Mercer, 24-21 Keith Jarrett , kjarrett@citizen-times.com 8:19 p.m. EDT October 10, 2015 Reserve quarterback Wes Holcombe led Western Carolina to a 14-point 4th-quarter rally to beat Mercer, with the game-winning TD scored in final minute Keion Crossen leads the Western Carolina celebration after defeating Mercer on Saturday. (Photo: Bradley Sell photo) \nCULLOWHEE -- Playing for its Southern Conference season, the Western Carolina football team sleepwalked through three quarters of its home game Saturday against Mercer. \nBut in the kind of dramatic comeback that can save a season, the Catamounts rallied behind reserve quarterback Wes Holcombe for a thrilling 24-21 win at Whitmire Stadium. \nIn front of just a couple thousand fans on a rainy, gray day, the Catamounts (3-2, 1-1) scored two touchdowns in the final nine minutes to erase an 11-point deficit, the game-winner coming with 42 seconds left. \nTailback Detrez Newsome rushed up the middle from 22 yards out on a 4th-and-1, and WCU survived a last-minute Mercer charge when placekicker Jagger Lieb was wide left on a potential game-tying 42-yard field goal attempt on the game's final play. \nAfter senior quarterback Troy Mitchell left the game in the third quarter with a shoulder stinger, Holcombe, a sophomore from Rabun Gap, Georgia, led WCU on fourth-quarter touchdown drives of 68 and 91 yards. \n\"I stepped into the huddle and said, 'believe,' '' said Holcombe, who finished 10-of-16 for 77 yards. \"We believed we could win, and some guys made some plays.\" \n\"This is a game these guys will remember for the rest of their lives,\" WCU coach Mark Speir said. \"A game like this is just another step in changing the culture around here.\" \nBoth sides of the ball made remarkable in-game turnarounds to pull out a win. The Catamounts looked comatose on defense in the first half as Mercer (2-3, 0-2) reeled off three touchdowns on long scoring drives in the first 20 minutes of play. \n\"They used some unbalanced formations that we hadn't seen, and our guys were confused on the field,\" Speir said. \"Give our coaches credit for making adjustments at halftime.\" \nAnd after allowing 225 yards in those three scoring series, WCU shut out the Bears the rest of the way and allowed just 179 yards in the final 40 minutes. \nThe Cats' offense managed just 179 yards through three quarters (13 yards on 11 plays in the third quarter), but totaled 159 yards in the final period, including the two scores. \nAfter C.J. Goodman scored on a double reverse from 14 yards out with 8:15 remaining to cut the deficit to 21-17, the WCU defense held and forced a punt. \nThe Catamounts' game-winning drive was 91 yards and took three minutes, 16 seconds, with Holcombe calmly connecting on 4-of-8 passes for 31 yards and Newsome picking up 35 yards rushing. \n\"Wes was just awesome, and our offense went 91 yards when they had to,\" Speir said. \n\"This is something you dream about, to come into a game and play like that,\" said Holcombe, who had completed just 7-of-14 passes in seven games before Saturday. \nThe Bears scored touchdowns on their first three possessions and averaged more than six yards per play in the first half to take a 21-10 lead at intermission. \nMercer had 259 yards in the first half and moved the ball with ease on scoring drives of 70, 74 and 81 yards. \nMitchell's carer-long 62-yard scramble set up the Cats' only first-half touchdown, a 14-yard pass from Mitchell to Tyler Sexton after Mercer had opened up a 21-3 lead. \nSpeir took Mitchell out after the offense went three-and-out in the first two series of the third quarter. \"His arm was numb, and he just really couldn't feel anything. \n\"When he (short-hopped) a little short throw, we just felt like it was time to try Wes,\" Speir said. \n\"This was beautiful,\" WCU defensive back Trey Morgan said. \"We couldn't afford to lose another conference game, and to win like this was just amazing.\" \nWCU plays at SoCon foe Wofford on Saturday. 16 CONNECT 2 TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http://avlne.ws/1LowD30 TOP VIDEOS", "external_links": [], "published": "2015-10-11T03:19:00.000+03:00", "crawled": "2015-10-11T04:57:32.213+03:00", "highlightTitle": ""}