{"organizations": ["Millburn High School", "Essex County Field Hockey Tournament", "Columbia High School"], "uuid": "4a8aee60fd76f96957ac91432e55790619cd408b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.northjersey.com", "main_image": "http://www.northjersey.com:80/polopoly_fs/1.1427203!/fileImage/httpImage/100815-it-gulaclear.jpg", "site_section": "http://www.northjersey.com/cmlink/high-school-sports-rss.rss", "section_title": "High School Sports on NorthJersey.com", "url": "http://www.northjersey.com/sports/high-school-sports/field-hockey/millers-eliminate-columbia-3-1-1.1427202", "country": "US", "title": "Millburn High School vasity field team wins county tourney match", "performance_score": 0, "site": "northjersey.com", "participants_count": 0, "title_full": "Millburn High School vasity field team wins county tourney match", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T07:32:00.000+03:00", "replies_count": 0, "uuid": "4a8aee60fd76f96957ac91432e55790619cd408b"}, "author": "", "url": "http://www.northjersey.com/sports/high-school-sports/field-hockey/millers-eliminate-columbia-3-1-1.1427202", "ord_in_thread": 0, "title": "Millburn High School vasity field team wins county tourney match", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Melissa Gula", "Emily Blumstein", "Jim Connelly", "Holly Graziano"], "text": "Millburn High School vasity field team wins county tourney match October 8, 2015 Last updated: Thursday, October 8, 2015, 12:32 AM By Jim Connelly Buy this photo \\staff photos by jim connelly Millburn High School’s Melissa Gula (white jersey at right) attempts to clear the ball away from the Miller cage Oct. 5 during Essex County Field Hockey Tournament action against Columbia High School. At rear are Millburn goalie Emily Blumstein and teammate Holly Graziano (13). \nSarah Pallino, head coach of Millburn High School’s varsity field hockey team, had a simple reason for her squad’s improved offensive showing in a second meeting in 11 days with Columbia High School. \n\"We simply passed the ball much better,\" Pallino said Oct. 5 following the sixth-seeded Millers’ 3-1 defeat of the seventh-seeded Cougars in the first round of the Essex County Tournament at Millburn High School’s Miller Field. Buy this photo Holly Graziano (13) celebrates with Hazel Solender (left) and Eleanor Davis (right) Oct. 5 following a first half goal by Millburn’s Lauren Dresner in the opening round of the Essex County Tournament. \nThe Millers and Cougars had played to a scoreless overtime tie in an Essex-Union Field Hockey Conference match Sept. 25 in Maplewood. \nForward Lauren Dresner staked Millburn to a 1-0 lead when she scored with 1:45 remaining in the first half. Fellow forward Lily Mynott was credited with the assist. \nMynott scored two minutes into the second half, extending the Millers’ advantage to 2-0. \nA goal from midfielder Melissa Gula gave the home team a 3-0 lead with 19:36 remaining. \nColumbia’s Emily Grew scored with 11:32 left, spoiling Miller goalie Emily Blumstein’s shutout bid. \nBlumstein was credited with three saves. \nMillburn (7-3-1) carried a 4-0-1 streak into its scheduled Oct. 7 county quarterfinal against third-seeded Glen Ridge High School at George Washington Park in Glen Ridge. \nThe Miller-Glen Ridge winner will face second-seeded Montclair High School in the semifinals. \nTop-seeded West Essex High School will host the winner of the quarterfinal match between fourth-seeded Montclair Kimberley Academy and fifth-seeded Mount St. Dominic Academy in the other semifinal. \nMontclair Kimberley defeated ninth-seeded Livingston High School 3-0 and Mount St. Dominic downed eighth-seeded Newark Academy 4-0 in the first round. \nThe semifinals are scheduled for Saturday, Oct. 10, at the higher seeds. \nThe county final is set for Saturday, Oct. 17, at 2:30 p.m. at West Essex in North Caldwell. \nMILLER NOTES \nForward Victoria Jordan scored two goals and Mynott, Gula and Dresner each scored one Oct. 1 in a 5-1 defeat of visiting Essex-Union rival Livingston High School. The victory improved the squad’s conference record to 6-3-1. \nA hat trick from Mynott, two goals from Gula and one from Dresner Sept. 29 keyed a 6-1 rout of visiting Newark Academy in Essex-Union action. \nEmail: connellyj@northjersey.com © 2015 North Jersey Media Group Tags:", "external_links": [], "published": "2015-10-08T07:32:00.000+03:00", "crawled": "2015-10-08T18:16:10.037+03:00", "highlightTitle": ""}