{"organizations": [], "uuid": "87e5a161d426144f52ae0ba11ddaa8d8a4b3051b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.commercial-news.com", "main_image": "http://bloximages.chicago2.vip.townnews.com/commercial-news.com/content/tncms/assets/v3/editorial/5/97/597302ab-92fe-5f55-8d89-71dd9430dd9d/562c655ba1d06.image.jpg", "site_section": "http://www.commercial-news.com/search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&nsa=eedition&c[]=sports/local_sports,sports/local_sports/*&f=rss", "section_title": "Commercial News - sports/local sports,sports/local sports/", "url": "http://www.commercial-news.com/sports/local_sports/team-effort-from-davis/article_7ff9bba8-f265-5190-b755-070197766fb2.html", "country": "US", "title": "Team-effort from Davis", "performance_score": 0, "site": "commercial-news.com", "participants_count": 1, "title_full": "Team-effort from Davis", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T13:00:00.000+02:00", "replies_count": 0, "uuid": "87e5a161d426144f52ae0ba11ddaa8d8a4b3051b"}, "author": "CHAD DARE cdare@dancomnews.com", "url": "http://www.commercial-news.com/sports/local_sports/team-effort-from-davis/article_7ff9bba8-f265-5190-b755-070197766fb2.html", "ord_in_thread": 0, "title": "Team-effort from Davis", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Previous Next Team-effort from Davis \nChad Dare | Commercial-NewsOakwood/Armstrong-Potomac senior Jon Davis paces the field at Saturday’s IHSA Class 1A regional meet at Paxton-Buckley-Loda High School. Davis, the two-time defending state champion, beat Unity’s Andrew Warnes by one second to claim the regional title. Posted: Sunday, October 25, 2015 6:00 am Team-effort from Davis BY CHAD DARE cdare@dancomnews.com Commercial-News.com \nPAXTON — After back-to-back state titles, there isn’t much that Oakwood/Armstrong-Potomac senior Jon Davis hasn’t accomplished in the the IHSA cross country postseason. \nBut on Saturday afternoon, Davis was a part of something brand new in the IHSA Class 1A Paxton-Buckley-Loda Regional. \nWith his regional championship victory in a time of 15 minutes, 9 seconds, Davis helped propel the Comets to a sixth-place finish and a spot in the sectional meet next Saturday at Hickory Point Golf Course in Forsyth. \n“Getting the team to the sectional meet was more important that I ever thought it was,’’ Davis said. “Having a team is a complete difference element for me. I think will really help me as I prepare to run in college next season.’’ \nBefore this season, Davis didn’t have to worry about running for a team because Oakwood/Armstrong-Potomac didn’t even have enough runners to field a squad. \n“It would have been hard for us to put together five boys and girls together last year, as a team,’’ Oakwood/Armstrong-Potomac coach Damon Ehrett said. “To have these freshman come out and contribute is great. \n“I’m thrilled. It was a goal of ours from the beginning of the season. I’m happy for the team and Jon now gets to the opportunity to experience sectionals with a team.’ \nEhrett said the foundation is being established with four freshmen but obviously, Davis has set the tone. \nAnd he did that on Saturday, basically leading wire-to-wire. \n“It was a different race than I planned for,’’ Davis said. “Everyone wanted to hang back with the wind coming at us half of the time. I think we slowed down considerably through the second mile and we had already gone pretty slow through the first mile.’’ \nDavis, who has set a goal for himself of breaking the all-time IHSA state record of Craig Virgin of 13 minutes, 50.6 seconds, admitted that he wasn’t running against the clock this week. \n“Time really didn’t matter today,’’ he said, still setting a new course record at Paxton. “I just wanted to survive and advance. \n“Next week is going to be my first week of going out really hard and just basically running by myself, preparing my body for what it will be like at the state meet.’’ \nBut, he knew that being the first one across the finish line was important for his team’s success. \n“That’s why I decided to pick it up in the final mile,’’ he said as Unity’s Andrew Warnes and Nick Porter of Paxton-Buckley-Loda went with him. “It was a really good race. I was saving a little back for the end, because I knew at our slow pace that things were going to start rolling pretty fast at the end.’’ \nIn the final 100 yards, Davis was able to outkick Warnes, to beat Warnes, a senior from Unity by one second. \n“This was a really fun race and having Andrew with me at the end was a challenge,’’ Davis said. “It pushed me a little bit and that is going to help me the next two weeks.’’ \nOakwood/Armstrong-Potomac was the only Vermilion Valley Conference team to advance to next week’s sectional meet, but Hoopeston Area sophomore Trey Houmes and Chrisman/Georgetown-Ridge Farm senior Kile McKee qualified as individuals while Dominique Chavira of the Cardinals just missed by five-tenths of a second. \nIn the girls regional meet, Hoopeston Area overcame illness and injuries to claim the final advancing spot out of the regional. \n“This is one of our goals every year,’’ Hoopeston Area coach Richard Stipp said. “Quite honestly, we are so hurt, sore and sick — I really didn’t think we were going to make it through. I was quite shocked and extremely excited.’’ \nFreshman Gracie Eighner led the way for the Cornjerkers with a 29th-place finish (21:03), while senior Shania Goble was 36th (21:59). \nIndividually, Chrisman/Georgetown-Ridge Farm senior Cassidy Baugh (33rd) and Oakwood/Armstrong-Potomac senior Shaina Andrews (35th) were able to advance to the sectional meet. Bismarck-Henning’s Allison Duncan just missed by 3 seconds. Sign Up / Sign In With your existing account from... {* loginWidget *}", "external_links": [], "published": "2015-10-25T13:00:00.000+02:00", "crawled": "2015-10-25T16:58:27.419+02:00", "highlightTitle": ""}