{"organizations": [], "uuid": "f6b5bb1cd05a2459719b9dc2b62af71acf834ef6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.hollandsentinel.com", "main_image": "http://www.hollandsentinel.com/storyimage/MI/20151009/SPORTS/151009110/AR/0/AR-151009110.jpg", "site_section": "http://www.hollandsentinel.com/sports?template=rss&mime=xml", "section_title": "Sports - Holland Sentinel", "url": "http://www.hollandsentinel.com/article/20151009/SPORTS/151009110/2000/NEWS?rssfeed=true", "country": "US", "title": "Week 7 Prep Football Scouting Reports", "performance_score": 0, "site": "hollandsentinel.com", "participants_count": 1, "title_full": "Week 7 Prep Football Scouting Reports", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T17:15:00.000+03:00", "replies_count": 0, "uuid": "f6b5bb1cd05a2459719b9dc2b62af71acf834ef6"}, "author": "Staff report", "url": "http://www.hollandsentinel.com/article/20151009/SPORTS/151009110/2000/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "Week 7 Prep Football Scouting Reports", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Week 7 Prep Football Scouting Reports See what's coming up for Friday's high school football games. Comment Posted Oct. 9, 2015 at 9:14 AM Updated at 9:15 AM Posted Oct. 9, 2015 at 9:14 AM Updated at 9:15 AM Byron Center at Zeeland West Kickoff >> 7 p.m. tonight at Zeeland Stadium Records >> Zeeland West 6-0, Byron Center 5-1 Scouting report >> The Dux backed up their No. 1 ranking in Division 3 in the Michigan Associated Press state rankings last week with a 56-16 win over Holland to improve to 2-0 in OK Green play and clinch a sixth-straight playoff berth at 6-0 overall. But Zeeland West will get a tough test at home against a Byron Center team that comes into tonight at 5-1 overall and 2-0 in the OK Green. This could very well be the game that decides who wins the OK Green title, so expect both teams to be ready to go for this one. Holland Christian at Unity Christian Kickoff >> 7 p.m. tonight at Unity Christian Records >> Holland Christian 3-3, Unity Christian 4-2 Scouting report >> This game features two teams that know tonight’s outcome will either greatly improve or hurt their playoff chances. For the Maroons, they come into this one after suffering a heartbreaking 33-28 loss to Byron Center last week. A loss wouldn’t mathematically eliminate Holland Christian from the playoff race yet, but a loss tonight with Zeeland West on deck next week before playing Hamilton in the regular season finale would make it a very tough hill to climb if Holland Christian is to make it into the playoffs. Zeeland East at Grand Rapids Kenowa Hills Kickoff >> 7 p.m. tonight at Kenowa Hills Records >> Zeeland East 3-3, Kenowa Hills 3-3 Scouting report >> This game is another one that is almost a “must-win” for both teams as far as the playoff race is concerned. The Chix finished what arguably could be called the most brutal three-game stretch of any team’s schedule this season after having to play Grand Rapids Christian, Muskegon Mona Shores and Muskegon in the last three weeks, losing to all three after starting the season at 3-0. The Chix haven’t had the best of luck against Kenowa Hills the last two seasons, losing 35-6 in 2014 and 21-0 in 2013, but the Knights have shown to be wildly inconsistent this season, alternating wins and losses throughout the season. Saugatuck at Marcellus Kickoff >> 7 p.m. tonight at Marcellus Records >> Saugatuck 6-0, Marcellus 3-3 Scouting report >> After moving to 6-0 overall to clinch a playoff berth with a 56-6 drubbing of Eau Claire last week, the Indians look to keep the train rolling against a Marcellus team they’ve beat by a combined score of 99-25 in their last two matchups. With the explosive Saugatuck offense, led by dual-threat quarterback Blake Dunn, averaging 47 points a game this season, look for the Indians to keep that production going against a Marcellus defense that is giving up 35.5 points per game. Page 2 of 3 - West Ottawa at Hudsonville Kickoff >> 7 p.m. tonight at Hudsonville Records >> West Ottawa 2-4, Hudsonville 5-1 Scouting report >> The Panthers have shown progress in the last four games, going 2-2, but are coming off a 30-7 setback to Grandville last week. Now they get to face a 5-1 overall Hudsonville team that was named an honorable mention in Division 1 in the Michigan AP football rankings this week. The Panthers are only averaging 12.8 points per game this season and Hudsonville is scoring 29.8 points a game, so the Panther offense will need to find a way to find the end zone early and often if West Ottawa has any hope of pulling off the upset. Fennville at Constantine Kickoff >> 7 p.m. tonight at Constantine Records >>Fennville 2-4, Constantine 3-3 Scouting report >> It has been a rough stretch for the Blackhawks during this current four-game losing streak, but they showed plenty of fight in a 55-32 loss to Coloma last week. The key matchup tonight will be between the Falcons’ explosive offense, which is averaging 35.8 points per game, and a leaky Fennville defense that is allowing 44.1 points per game. The Blackhawks keep fighting, but expect Constantine to show plenty of urgency with its playoff hopes on the line. Holland at Hamilton Kickoff >> 7 p.m. tonight at Hamilton Records Holland 1-5, Hamilton 1-5 Scouting report >> With the playoffs out of the picture, both Holland and Hamilton will look to get some positive momentum going in these final weeks of the season. Both teams showed some promise in early in their games last week. The Hawkeyes lost 41-14 to Unity Christian, but they were tied 7-7 with the Crusaders at halftime. The Dutch last week were inside the Zeeland West 10-yard line with a shot at a touchdown to trim the lead to 32-16 if they scored and converted a two-point conversion before the half, but a 92-yard fumble return for touchdown by the Dux killed the drive and put the game out of reach. Whichever team can limit the mistakes that have cost them both dearly this season will be the one that notches its second win. Dan D'Addona Hudsonville 31, West Ottawa 24. The Panthers are making strides but aren't quite to Hudsonville's level. Holland 34, Hamilton 18. The Dutch have struggled this season but will put it together this week. Holland Christian 38, Unity Christian 28. The Maroons need a win for a chance at the playoffs and will get it. Zeeland East 42, Kenowa Hills 10. The Chix will bounce back from a tough loss and get back on track. Page 3 of 3 - Zeeland West 44, Byron Center 20. The Dux will cruise to the victory and move closer to the OK Green title. Saugatuck 52, Marcellus 18. The Indians continue to roll toward a special finish to the season. Constantine 39, Fennville 17. The Blackhawks face a tough opponent and will struggle, despite the strides they have made. Last week 7-0. Overall 34-11 Greg Buckner Hudsonville 33, West Ottawa 21. Hudsonville proves to be too much for an improving, but young Panther team. Holland 28, Hamilton 14. Both teams have struggled but had their moments, but Holland has more offensive playmakers. Holland Christian 21, Unity Christian 20. I think this one comes down to the wire, but the Maroons pull it out with the Dux on deck next week. Zeeland East 28, Kenowa Hills 21. The Chix have navigated the brutal portion of their schedule and will get back on track. Zeeland West 38, Byron Center 21. Byron will hang around, but the Dux aren’t content just to coast into the playoffs. Saugatuck 48, Marcellus 10. There’s no stopping the Saugatuck offense. Constantine 33, Fennville 17. The Blackhawks keep fighting, but Constantine has its playoff hopes on the line. Last week 6-1. Overall 33-12 Jason Barczy Hudsonville 52, West Ottawa 7. Not making the mistake of picking West Ottawa again after they let me down last week. Holland 14, Hamilton 13. OK, so I know I said I wouldn't pick the Dutch again this season, but it's Hamilton they're up against. Unity Christian 42, Holland Christian 38. This is a must win game for both teams. Unfortunately for the Maroons, it's more important for the Crusaders if they're to clinch a playoff spot before facing Zeeland West in the season finale. Zeeland East 28, Kenowa Hills 21. Finally, the Chix (3-3) have escaped the meat of their schedule and face some competition they can perhaps beat. The Knights (3-3) have been too inconsistent week-to-week. Zeeland West 56, Byron Center 8. The Dux are rolling and picking up more confidence each week. This will be Zeeland West's toughest competition in the regular season, but it won't prove to be much. Saugatuck 47, Marcellus 0. The Indians have given up just 26 points in the last four games. Nuff said. Constantine 34, Fennville 3. The Falcons (3-3) need this if they're to make a playoff push. Last week 5-2. Overall 32-13 By Staff report", "external_links": [], "published": "2015-10-09T17:15:00.000+03:00", "crawled": "2015-10-09T19:15:08.395+03:00", "highlightTitle": ""}