{"organizations": [], "uuid": "f5695040e4d52ea90371370372d7153201c4b780", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.norwichbulletin.com", "main_image": "http://www.norwichbulletin.com/storyimage/CT/20151006/SPORTS/151009662/AR/0/AR-151009662.jpg", "site_section": "http://www.norwichbulletin.com/sports?template=rss&mime=xml", "section_title": "Sports - The Bulletin", "url": "http://www.norwichbulletin.com/article/20151006/SPORTS/151009662/2000/NEWS?rssfeed=true", "country": "US", "title": "Red Sox 1st order of offseason business is rotation", "performance_score": 0, "site": "norwichbulletin.com", "participants_count": 1, "title_full": "Red Sox 1st order of offseason business is rotation", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T01:16:00.000+03:00", "replies_count": 0, "uuid": "f5695040e4d52ea90371370372d7153201c4b780"}, "author": "Brian MacPherson Providence Journal", "url": "http://www.norwichbulletin.com/article/20151006/SPORTS/151009662/2000/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "Red Sox 1st order of offseason business is rotation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Red Sox 1st order of offseason business is rotation Comment By Brian MacPherson Providence Journal The Bulletin By Brian MacPherson Providence Journal Posted Oct. 6, 2015 at 5:16 PM Updated at 5:16 PM By Brian MacPherson Providence Journal Posted Oct. 6, 2015 at 5:16 PM Of all the decisions Ben Cherington made a year ago, the decision to forgo an ace starting pitcher — or, at least, not to meet the asking prices for such a pitcher — met with the most backlash. The criticism seemed justified when the Red Sox rotation entered the All-Star break with the highest ERA in the American League (4.75). In eschewing an ace like Jon Lester or Max Scherzer, Boston had doomed itself to second-rate performance from its starting pitchers. A funny thing happened in the second half, however: Without significant turnover in personnel, the Red Sox posted the fourth-best ERA among starting rotations in the American League (3.97). Only David Price’s Blue Jays, Dallas Kuechel’s Astros and Corey Kluber’s Indians were better. The mocking of the “He’s the ace” T-shirts that appeared to derision in spring training almost disappeared. One of the first decisions Dave Dombrowski must make as the offseason begins to unfold is how far he’s willing to extend himself to land an ace. The clamor figures to be as loud as it was a winter ago. The true nature of the need is just as uncertain. “Not every team has the luxury of having a true No. 1 starter,” interim manager Torey Lovullo said shortly before the season ended. “In a perfect world, you’d have that to start, with a perfect rotation. But when you don’t have it, you have guys that step up and assume roles. I think on their given day these guys feel like they are the No. 1 starter, and that’s how I want them to feel.” Boston brings back at least a half-dozen legitimate contenders for its starting rotation next season. The list starts with Clay Buchholz, the 2015 Opening Day starter who missed half the season with elbow tightness, and includes veterans Rick Porcello, Wade Miley and Joe Kelly as well as youngsters Eduardo Rodriguez and Henry Owens. If the surprising Rich Hill returns after testing free agency, he’d be in the mix as well. Nobody in that group qualifies as a traditional ace — but it was that group, minus Buchholz, that ranked among the best starting rotations in the American League from mid-July onward. “After the rough start we got off to, everybody has followed suit with some good outings,” said Buchholz, who arranged for the “He’s the ace” T-shirts back in spring training. “You’re going to have your bad outings. You’re going to have to take them on the chin. But we pitched good enough to win a lot of baseball games, with some bad luck mixed in there. Some things didn’t happen the way we wanted to, but it played out pretty good for the most part.” Page 2 of 2 - “Without them pitching deep into games, we’re not going to win games,” Lovullo said. “They’ve come together as a group to understand that role. They’re getting familiar with the league. They're getting comfortable.” It still stands to reason that Dombrowski at least will inquire about free agents like Price or Jordan Zimmermann as well as potential trade targets like Sonny Gray and Matt Harvey. Long an elite pitcher in the American League East, Price showed again upon his arrival in Toronto just how much an elite starting pitcher can set the tone for a team. In some ways, personality as much as performance is what makes a true ace, at least over 162 games. What Boston lost when Lester walked away was the leader of its staff, a void that has not yet been filled. Whether Porcello grows into that role in his second season in Boston or whether Dombrowski brings in a so-called proven ace remains to be seen. Perhaps, in time, Rodriguez will grow into that role — though, if Lester is any example, it could take three or four seasons for that to happen. For now, what the Red Sox need most is for the starters to pitch with the consistent effectiveness they showed in the second half this season from the get-go next season. “When I see guys who are aces over the years, they’re just consistent — consistent about going about their business, consistent in the way they handle themselves,” Hill said. “That’s something you can rely on throughout the year.” “We’ve got some young guys that have shown they can pitch at this level consistently — not just going out for one start and doing good and then doing bad the next three starts,” Buchholz said. “They’ve been able to string multiple starts in a row together. As long as I’ve been here, that’s what people look for in the starting staff — consistency, guys you can lean on when you need them.” By Brian MacPherson Providence Journal The Bulletin By Brian MacPherson Providence Journal Posted Oct. 6, 2015 at 5:16 PM", "external_links": [], "published": "2015-10-07T01:16:00.000+03:00", "crawled": "2015-10-07T00:36:09.090+03:00", "highlightTitle": ""}