{"organizations": [], "uuid": "ae87999998d5f0c2d509df4ad82733c46ddaacca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.norwichbulletin.com", "main_image": "http://www.norwichbulletin.com/Global/images/head/nameplate/norwich_logo.png", "site_section": "http://www.norwichbulletin.com/sports/pro-sports?template=rss&mime=xml", "section_title": "Pro Sports - The Bulletin", "url": "http://www.norwichbulletin.com/article/20151016/SPORTS/151019655/10417/SPORTS?rssfeed=true", "country": "US", "title": "FIFA investigates new bribery allegations", "performance_score": 0, "site": "norwichbulletin.com", "participants_count": 1, "title_full": "FIFA investigates new bribery allegations", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T01:09:00.000+03:00", "replies_count": 0, "uuid": "ae87999998d5f0c2d509df4ad82733c46ddaacca"}, "author": "Rob Harris The Associated Press", "url": "http://www.norwichbulletin.com/article/20151016/SPORTS/151019655/10417/SPORTS?rssfeed=true", "ord_in_thread": 0, "title": "FIFA investigates new bribery allegations", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "FIFA investigates new bribery allegations Comment By Rob Harris The Associated Press The Bulletin By Rob Harris The Associated Press Posted Oct. 16, 2015 at 5:09 PM By Rob Harris The Associated Press Posted Oct. 16, 2015 at 5:09 PM BERNE, Switzerland — The corruption scandal sweeping world soccer engulfed Germany as FIFA said Friday that it would investigate \"very serious allegations\" that voters were bribed to win the 2006 World Cup bid. The latest claims of wrongdoing linked to soccer's governing body broke as suspended president Sepp Blatter went public with his fight to get his FIFA ethics case thrown out. Blatter may have deepened the prospect of a long ban by admitting there was only a \"gentleman's agreement\" for the 2011 payment he authorized to UEFA President Michel Platini and which led to them both being suspended by FIFA last week after it emerged through a criminal investigation. FIFA is attempting to contain the damage to the image of the world's most popular sport by ramping up the scale of inquiries into alleged illegality. After 14 soccer officials were indicted in May by U.S. authorities in a soccer bribery case, FIFA launched an internal investigation in an attempt to show it is committed to eradicating corruption. The investigation will now include looking into a report in news magazine Der Spiegel that Germany's 2006 World Cup bid committee established a slush fund of 10.3 million Swiss francs (then about $6 million) to bribe four of the 24 voters. Franz Beckenbauer, the former Germany great who headed the bidding committee, and Wolfgang Niersbach, the current president of the German football federation (DFB), as well as other high-ranking football officials were aware of the slush fund by 2005 at the latest, the report claimed. Former Adidas chief Robert Louis-Dreyfus, who died in 2009, provided the funding, according to Spiegel, and asked for the money — by then worth 6.7 million euros — back before the tournament began. Spiegel reported that a cover was created with the help of FIFA and that 6.7 million euros were transferred to FIFA as a contribution to an opening ceremony gala that was later canceled. \"These are very serious allegations,\" FIFA said in a statement. \"They will be reviewed as part of the independent internal investigation currently being conducted by FIFA under the direction of its legal director with the assistance of outside counsel.\" No criminal authority has said it is investigating the latest allegations but FIFA's statement stressed that it \"continues to cooperate with the investigations of the U.S. Department of Justice and the Office of the Swiss Attorney General.\" The German football federation insisted the report was \"completely baseless\" and said neither Niersbach nor the other members of the organizing committee \"were involved or could have known about such operations.\" The money was reportedly used to secure the backing of four Asian representatives in a vote already notorious due to a New Zealander abstaining. Germany defeated South Africa 12-11. Charlie Dempsey, then the Oceania president, abstained despite being mandated to support the Nelson Mandela-backed South Africa bid in the final round. Dempsey said he received telephone threats from \"influential European interests\" the night before voting. He resigned from FIFA one week later and died in 2008. Page 2 of 2 - It is far from the first FIFA vote to be suspected of foul play. Former FIFA executive committee member Chuck Blazer admitted to U.S. authorities he was involved in the facilitation of bribes in connection with the selection of the 1998 and 2010 hosts. And FIFA is still imposing sanctions as part of its investigation into the dual votes for the 2018 and 2022 World Cups in 2010. Russia, the 2018 host, and 2022 winner Qatar both deny wrongdoing. Blatter has previously hinted at wrongdoing in the 2006 World Cup vote, but FIFA's leader of 17 years has ethics problems of his own now. The 79-year-old Swiss is a week into a 90-day suspension as the FIFA ethics committee investigates a payment to Platini of 2 million Swiss francs (about $2 million) he authorized in 2011. The lack of a written contract is at the heart of the case and Blatter confirmed that it did not exist. Despite accused officials risking further sanctions if they discuss ethics cases in public, Blatter spoke out to deny illegality in his first television interview since being placed under criminal investigation last month. Platini has said the money was unpaid additional salary from his job as Blatter's adviser between 1998 and 2002 which FIFA could not afford to pay at the time. \"That was a contract I had with Platini, a gentleman's agreement and that went through,\" Blatter told Swiss broadcaster RROTV. Blatter hopes to be cleared in time to preside over the emergency FIFA Congress on Feb. 26 when his successor will be chosen. The case might have fatally damaged Platini's bid to succeed Blatter, who announced he was quitting just four days after being voted in for a fifth term in May as the investigations into soccer officials escalated. By Rob Harris The Associated Press The Bulletin By Rob Harris The Associated Press Posted Oct. 16, 2015 at 5:09 PM", "external_links": [], "published": "2015-10-17T01:09:00.000+03:00", "crawled": "2015-10-17T01:19:00.150+03:00", "highlightTitle": ""}