{"organizations": [], "uuid": "039aae6d4405a4c8304a4bed528ced058d8835c0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sj-r.com", "main_image": "http://www.sj-r.com/storyimage/LS/20151004/SPORTS/151009817/AR/0/AR-151009817.jpg", "site_section": "http://www.sj-r.com/sports?template=rss&mime=xml", "section_title": "Sports - The State Journal-Register", "url": "http://www.sj-r.com/article/20151004/SPORTS/151009817/2000/NEWS?rssfeed=true", "country": "US", "title": "Cubs beat Brewers 3-1; will travel to Pittsburgh for Wild Card game", "performance_score": 0, "site": "sj-r.com", "participants_count": 1, "title_full": "Cubs beat Brewers 3-1; will travel to Pittsburgh for Wild Card game", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T01:37:00.000+03:00", "replies_count": 0, "uuid": "039aae6d4405a4c8304a4bed528ced058d8835c0"}, "author": "Genaro C. Armas, The Associated Press", "url": "http://www.sj-r.com/article/20151004/SPORTS/151009817/2000/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "Cubs beat Brewers 3-1; will travel to Pittsburgh for Wild Card game", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Cubs beat Brewers 3-1; will travel to Pittsburgh for Wild Card game Comment By Genaro C. Armas, The Associated Press The State Journal-Register By Genaro C. Armas, The Associated Press Posted Oct. 4, 2015 at 5:37 PM Updated at 5:37 PM By Genaro C. Armas, The Associated Press Posted Oct. 4, 2015 at 5:37 PM MILWAUKEE — The Chicago Cubs beat the Milwaukee Brewers 3-1 on Sunday for their eighth straight win, but still needed Pittsburgh to lose in order to host the Pirates in the NL wild-card game. Pittsburgh, which defeated Cincinnati 4-0 Sunday, finished with a one-game lead over the Cubs in the wild-card standings. The Cubs would have held the tie-breaker if they'd finished with the same record as the Pirates. Chicago heads into its first postseason appearance since 2008 brimming with confidence. The Cubs ended the regular season with a three-game sweep in Milwaukee. Anthony Rizzo had a two-run single with the bases loaded in the first to reach a career-high 101 RBIs on the season. Starter Dan Haren (11-9) allowed three hits and a walk in six innings. The rebuilding Brewers finished with 94 losses, 14 more than 2014. The franchise is headed into an offseason of change under new general manager David Stearns. Double-A call-up Jorge Lopez (1-1) went five innings and gave up three runs, all in the first. The Brewers used an all-rookie rotation for the final 12 games of the season after injuries to Jimmy Nelson and Wily Peralta, and Matt Garza was pulled because of ineffectiveness. Shane Peterson drove in the Brewers' only run with an RBI ground-rule double in the third. But the bevy of Chicago fans at Miller Park went home happy again. At one point in the eighth, competing full-throated chants of \"Let's go Cubbies\" and \"Let's go Brewers\" ringed the stadium. Travis Wood pitched a hitless ninth for his fourth save. Trainer's room Cubs: Chicago ends the regular season with two players on the disabled list, both right-handed pitchers: Jason Motte (right shoulder strain) and Jacob Turner (right shoulder inflammation). Turner spent the whole year on the DL. Brewers: Manager Craig Counsell said he didn't think that the lower back injury that bothered OF Ryan Braun in September and sidelined him the last week of the season was too serious. \"I don't see it being a factor at all next season,\" Counsell said. Up next Cubs: After making his last regular season start on Friday, ace Jake Arrieta (22-6) would work on normal rest to start the NL wild card game against Pittsburgh. Brewers: The team is already looking forward to next year, with pitchers and catchers scheduled to report on Feb. 19 at the spring training complex in Phoenix. By Genaro C. Armas, The Associated Press The State Journal-Register By Genaro C. Armas, The Associated Press Posted Oct. 4, 2015 at 5:37 PM", "external_links": [], "published": "2015-10-05T01:37:00.000+03:00", "crawled": "2015-10-05T02:30:56.821+03:00", "highlightTitle": ""}