{"organizations": [], "uuid": "bb39aa787e4c7dbe5a62d1b69e616a1ebca230b9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.oregonlive.com", "main_image": "http://imgick.oregonlive.com/home/olive-media/width620/img/oregonian/photo/2015/10/04/18900675-large.jpg", "site_section": "http://www.oregonlive.com/", "section_title": "Oregon Local News, Breaking News, Sports &amp; Weather - OregonLive.com", "url": "http://www.oregonlive.com/pacific-northwest-news/index.ssf/2015/10/oregon_shooting_there_is_one_c.html", "country": "US", "title": "Oregon shooting: Roseburg churches become one in aftermath of shooting", "performance_score": 0, "site": "oregonlive.com", "participants_count": 3, "title_full": "Oregon shooting: Roseburg churches become one in aftermath of shooting | OregonLive.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T02:20:00.000+03:00", "replies_count": 2, "uuid": "9ad331e9594c164cde6fd68e7f72e1e0f10edad3"}, "author": "Jim Ryan | The Oregonian/OregonLive", "url": "http://www.oregonlive.com/pacific-northwest-news/index.ssf/2015/10/oregon_shooting_there_is_one_c.html#post-0", "ord_in_thread": 0, "title": "Oregon shooting: Roseburg churches become one in aftermath of shooting", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ROSEBURG — Pastor Dave Ewert stood before his congregation Sunday in a church across town from Umpqua Community College.\nA tall, backlit cross adorned the wall behind him, and nine candles commemorating those fatally shot at the Roseburg community college Thursday burned on a polished oak communion table.\nEtched into the front of the table was a reference to a Bible verse: \"This do in remembrance of me.\"\nParts of Sunday's service at New Hope Church in Roseburg service functioned as a remembrance of the victims of Oregon's deadliest mass shooting . The gathering was among many across the region, including a vigil Saturday night in nearby Winston, as people from across Douglas County and beyond came together to grieve and find solace in faith and one another.\nEwert addressed his congregation, like other religious leaders across the rural southern Oregon county, devastated from the school shooting that left 10 dead, including the gunman, and nine injured.\n\"We are wanting to begin today in remembering the people who were hurt (or) killed this past week at UCC. ... There are nine candles up here for the nine people that were murdered,\" Ewert told those gathered before him, continuing by reading each of the victims' names aloud.\nEwert, the church's senior pastor, later instructed his colleagues in the back of the room to cue up a slideshow detailing the aftermath of the rampage. The congregation, Sunday about 60, watched intently as photos and psalms flashed across the wall next to the cross.\nThe victims' names appeared, one after another, until they were listed as one.\nSomeone in the back sniffled. Then another did the same, elsewhere. Then, twice again from the back.\nEwert later led the congregation in prayer.\n\"We pray, Lord, that this specter of fear might be put away from us and that we would once again walk strong and confident onto that college campus.\"\n\"Thank you, God, for all those who have put their lives on the line for us.\"\n\"We give you praise, Lord, for those in the medical profession for caring so well for our people.\"\n\"Thank you for our sheriff and all those who are committed to public safety.\"\nFaith has a significant role in the aftermath of a traumatic event, said Bruce Russell, a former Roseburg pastor and Douglas County Fire District No. 2 chaplain and crisis intervention coordinator.\n\"Regardless of faith, everybody asks the question 'why?' And that is a spiritual question. There's no other way to answer it,\" he said.\nJeff Naber, a chaplain from Charlotte, North Carolina, travels to crisis situations across the country to help grieving people try to start recovering.\nAfter this year helping in crisis situations in Baltimore; California; Ferguson, Missouri; and Lafayette, Louisiana; Naber said he found himself boarding a plane to Oregon at about 6 p.m. Thursday.\nThe manager of chaplain development and ministry relations for the Billy Graham Rapid Response Team said 11 other Billy Graham chaplains had joined him by Sunday.\n\"It's very important for us to be here on the ground because we know by intervening, providing crisis intervention to people early on, (we) can prevent some of the longer-lasting negative effects from going through an event like this,\" he said.\nBilly Graham chaplains and people wearing Red Cross colors canvassed the crowd at a vigil Saturday night in Winston.\nThe chaplains wrapped grieving people in long hugs, provided counsel to those seeking it and offered warm smiles and greetings to others.\nWinston, about eight miles south of Roseburg, was home to one of the victims . Several hundred gathered at an amphitheater there to grieve.\nJerry Smart, senior pastor of Winston's Foursquare Gospel Center, organizer and emcee of the event, spoke to the power of an outlet for communal grieving.\n\"We don't want people to feel like they're alone in their grief and their uncertainty,\" he said in an interview with The Oregonian/OregonLive.\nAddressing the crowd, he offered a message of unity that applies to his church and congregations across the area.\n\"There are not 45 churches in the Roseburg area,\" he said, offering an estimate.\n\"There is one church in Roseburg.\"\n— Jim Ryan\njryan@oregonian.com ; 503-221-8005\n@Jimryan015", "external_links": ["http://twitter.com/jimryan015"], "published": "2015-10-05T02:20:00.000+03:00", "crawled": "2015-10-05T12:34:01.743+03:00", "highlightTitle": ""}