{"organizations": [], "uuid": "ff30434079e2b191704d3112b2b74b228bc2b345", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3337804/images/o-DEFAULT-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/sports/index.xml", "section_title": "Sports - The Huffington Post", "url": "http://www.huffingtonpost.com/jonathan-chase/i-am-kansas-city_b_8379972.html", "country": "US", "title": "I am Kansas City", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "I am Kansas City", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T17:00:00.000+02:00", "replies_count": 0, "uuid": "ff30434079e2b191704d3112b2b74b228bc2b345"}, "author": "Jonathan Chase", "url": "http://www.huffingtonpost.com/jonathan-chase/i-am-kansas-city_b_8379972.html", "ord_in_thread": 0, "title": "I am Kansas City", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nI'm not a sports guy. I don't play sports; I never have. Growing up I was more creatively inclined, and all of my free time was spent either writing jokes or writing music. Even today, the most athletic you'll ever see me is when I'm wearing gym shorts watching re-runs of Seinfeld. \nKansas City is my home, and has been for nearly 16 years, but I don't think I've ever seen this city look more like a community than October 15th, 2014. \nFor the first time since 1985, The Kansas City Royals took the American League pennant. I was in Westport that night, watching the game with a few friends. The nail-biting silence that had come over the room had been replaced by roars of cheers and applause. \n\"Dude, we're going to The World Series!\" my friend yelled as he slapped me on the back, causing my drink to spill. I congratulated him politely as I tried to get the bartender to send some paper towels my way. She wasn't paying attention to me; her and the hostess were jumping up and down and chanting, \"Let's Go Royals!\" \n\"Let's Go Royals!\" became the mantra of the room. Everyone got up and went outside. The whole restaurant poured into the streets. Literally all of Westport was outside. They had shut the streets down. People were yelling, crying, hugging, kissing. \n\"WH !\" A man dressed head to toe in Royals gear got in my face, and greeted me with a bear hug that lifted me off the ground. \n\"Do I know you?\" I asked. \"Yeah, you know me!\" he said, \"I'm Kansas City!\" \nThe man put me down, and I looked around me. It felt surreal. The atmosphere was electric. Shouts filled the air; someone was singing the national anthem. I watched strangers greet each other as if they were long lost friends. \nIn that moment, seeing all these people united in celebrating their city, something shifted in me. For the first time in a long time, we weren't just individuals who happened to live in the same place; we were Kansas City. \nThis was Kansas City; my city. \n\"I'm Kansas City,\" I thought to myself. It didn't matter that I preferred sitcoms to sports. It didn't matter that I wasn't a sports guy. In that moment, on October 15th, 2014: we were all Kansas City, and this was our glory moment. \nWe went on to The World Series, and we kicked ass for seven games straight. \"Revive 85!\" was the hopeful cry written on our shirts, our hats and our hearts. \nWe didn't leave with a trophy, but mein gott our city was revived. We came together as a city, united by something we all loved. Whether it was the die hard faithful fan, or the band-wagoner that spent over $200 just so he could dress in Royals gear (Me. That was me), we were all accepted into the fight as we played our hearts out in the 2014 World Series. \nFast-forward to October 23rd, 2015: I'm in Chicago, about to board a plane back to Kansas City. The Royals are leading 2-1 against the Toronto Blue Jays. We're one win away from taking the American League pennant, and once again heading to The World Series. \n\"What a terrible time to be boarding a plane,\" the woman in front of me says. I nod my agreement. As we move through the boarding queue, everyone's eyes are glued to the screen. Reluctantly we board the plane, some craning their necks to catch a last look at the game before we're told to shut our phones off. \nThe flight is over in an hour. I'm home. Kansas City. As I walk off the plane I get a notification on my phone: FINAL SCORE: KC 4, TOR 3. \nI look around; the airport is for the most part empty. \"Woo!\" I yell to no one in particular. It feels a bit foolish. \"Let's Go Royals!\" I shout for good measure. The janitor down the corridor waves at me. \nI still don't consider myself a sports guy, but since October 15th, 2014, I've learned that it doesn't matter; because I am Kansas City. \nWhether I'm in a crowd of hundreds or alone in an airport, I am Kansas City, and once again, this is our glory moment. \nFollow Jonathan Chase on Twitter: www.twitter.com/jonathanchase_ More: Click here to view Conversations Conversations", "external_links": [], "published": "2015-10-26T17:00:00.000+02:00", "crawled": "2015-10-26T17:49:38.070+02:00", "highlightTitle": ""}