{"organizations": ["Young Guns Excite Hodgson Three Lions"], "uuid": "3ab2aae84b3c24bb53ecc3a65396d3a4e7324125", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.sky.com", "main_image": "http://media.skynews.com/media/images/generated/2015/10/13/423750/default/v1/gettyimages-492352570-1-1600x900.jpg", "site_section": "http://feeds.skynews.com/feeds/rss/sports.xml", "section_title": "Sports News - Latest Sports and Football News | Sky News", "url": "http://news.sky.com/story/1568546", "country": "IL", "title": "Three Lions' Young Guns Excite Hodgson", "performance_score": 0, "site": "sky.com", "participants_count": 0, "title_full": "Three Lions' Young Guns Excite Hodgson", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T08:47:00.000+03:00", "replies_count": 0, "uuid": "3ab2aae84b3c24bb53ecc3a65396d3a4e7324125"}, "author": "", "url": "http://news.sky.com/story/1568546", "ord_in_thread": 0, "title": "Three Lions' Young Guns Excite Hodgson", "locations": ["France", "UK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Roy Hodgson", "Hodgson"], "text": "Three Lions' Young Guns Excite Hodgson 06:47, UK, Tuesday 13 October 2015 Share by email Roy Hodgson has said the future of English football is bright after his side completed a clean sweep in qualifying for next summer's European Championship in France. \nEngland beat Lithuania 3-0 in Vilnius on Monday night to make it 10 wins out of 10 in Group E - the first time they had achieved such a feat in qualifying for the Euros - and Hodgson said he was delighted with his side's display at the LFF Stadium. \n\"We are very pleased with that, of course,\" the England manager told Sky Sports after the game. \"I think the way we approached the game and stamped our authority from the first minute meant we were not often in danger of not winning the game. \n\"I thought the team approached the game in exactly the right way. I said to them before the game 'This is a great opportunity, I believe in you and am excited to see you play' and I was not let down at all. \n\"I thought the quality of our football was very, very good and even towards the end we were working very hard to win the ball back when we lost it, despite the fact we were 3-0 up and we could have been even more goals ahead.\" \nEngland have now joined France (twice), Czech Republic, Spain and Germany in having won every qualifying fixture ahead of a European Championship, although Hodgson played down that fact. \n\"Omens are always nice,\" he said. \"But the fact is you only win matches or get good records like this one when you are doing it on the field, so we have some interesting matches coming up now that we are looking forward to against some quality opposition. \n\"And I think that will be a test for us and highlight elements of our play that we have to work even harder on.\" \nThe biggest positive on the road to Euro 2016, though, as far as Hodgson was concerned was the emergence of so many young and exciting players, all of who will now be challenging for a place at next summer's tournament. \n\"But it is quite incredible that I think so many players tonight are playing, if not their first game for England, then one of their first few games for England,\" Hodgson said. \n\"Phil Jagielka captains the team and for them to go out and give that type of performance, it does give me great heart that we do have players coming through in this country, we do have quality footballers. \n\"And if and when we get the players back who helped us, certainly at the start of the campaign, then we will have a strong squad to choose from. These players tonight will certainly feel they have done enough to keep their names at the front of my thinking and the thinking of the coaches and that is all I can ask from them. \n\"That is how it should be [a selection headache]. A lot of the time we have been wise with players and rested them. \n\"For example, on this occasion at least four or five players who would have made the starting line-up were rested, because I am always complaining about the amount of games players have to play in the Premier League and how often the games come up. \n\"So when I have a chance to give them a little rest, I have tried to do so, so that will account to some extent for the amount of players we have used.\" Promoted Stories", "external_links": [], "published": "2015-10-13T08:47:00.000+03:00", "crawled": "2015-10-13T10:38:35.647+03:00", "highlightTitle": ""}