{"organizations": [], "uuid": "be1c12a1e67e25da64e4edd20e1b6233cdc3e3be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.detroitnews.com", "main_image": "http://www.gannett-cdn.com/-mm-/91bf471292cd466dc7f377019f2df8c3f8ebd91d/c=0-617-2012-1753&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/26/DetroitNews/DetroitNews/635814688988438088-WH.jpg", "site_section": "https://feeds.feedblitz.com/detroit/sports", "section_title": "Detroit News - Sports", "url": "http://www.detroitnews.com/story/sports/college/university-michigan/2015/10/26/no-more-ifs-wolverines-finally-dispatch-bad-vibes/74640120/", "country": "US", "title": "No more 'ifs': Wolverines finally dispatch bad vibes", "performance_score": 0, "site": "detroitnews.com", "participants_count": 2, "title_full": "No more 'ifs': Wolverines finally dispatch bad vibes", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T17:51:00.000+02:00", "replies_count": 1, "uuid": "be1c12a1e67e25da64e4edd20e1b6233cdc3e3be"}, "author": "detroitnews.com", "url": "http://www.detroitnews.com/story/sports/college/university-michigan/2015/10/26/no-more-ifs-wolverines-finally-dispatch-bad-vibes/74640120/", "ord_in_thread": 0, "title": "No more 'ifs': Wolverines finally dispatch bad vibes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Willie Henry (Photo: John T. Greilick, Detroit News) \nAnn Arbor – Michigan defensive end Willie Henry did his best to avoid watching replays of the finish of the Wolverines' stunning loss to Michigan State.\nHenry would either avert his eyes or grab the television remote and change channels.\n\"I shied away from it,\" Henry said Monday at Michigan's weekly news conference.\nThe 15th-ranked Wolverines (5-2, 2-1 Big Ten) have had plenty of time to think about the loss since they were off last weekend. They are now preparing in earnest for their game at Minnesota (4-3, 1-2) on Saturday.\nMichigan led the entire game at home against Michigan State and was 10 seconds from a 23-21 victory. But Michigan punter Blake O'Neill took a low snap from Scott Sypniewski, dropped it, picked it up and spun around and attempted to kick but fumbled into the hands of Michigan State's Jalen Watts-Jackson. Watts-Jackson scored on a 38-yard return, giving the Spartans a 27-23 victory with no time remaining, their seventh win in the last eight meetings with Michigan.\nHenry admitted that even on Monday, he was feeling the loss.\nDETROIT NEWS\nPeppers likely to play more offense; Johnson good to go\n\"About a week and some change. Still going on just a little bit today,\" Henry said, referring to how long it has taken him to get over it. \"Losing a game like that that means so much to the players here. You work so hard in the offseason for games like that and to lose that ... I'm still feeling it a little bit but it's not going to help me against Minnesota.\"\nMichigan coach Jim Harbaugh referred to last week as \"improvement week\" and said half the time was spent preparing for Minnesota and the other on individual technique and fundamentals.\nHarbaugh took a question Monday regarding linebacker Joe Bolden and the targeting call that ejected him from the MSU game -- he said again that he has spoken to the Big Ten but would not share their conversation -- and his answer evolved into how the team would move forward from the loss to Michigan State.\n\"Just as a point of reference, not into the 'if-this, if-that' type of scenarios,\" Harbaugh said. \"If worms had machine guns, then birds (would) be scared of them. We're looking to (define) our season over the next number of games that we play.\"\nHarbaugh was referencing a book titled \"If Worms Had Machine Guns\" published in 2008. It is about a father and three sons, and according to the book synopsis is \"a story of life's lessons passed down from one generation to the next. You take the cards you are dealt and you play your best hand ... wise words from a father to a son.\"\nThe synopsis sounds like a message Harbaugh likely delivered to his team.\nSafety Dymonte Thomas said returning to practice last Tuesday helped.\nDymonte Thomas   (Photo: David Guralnick, Detroit News) \n\"It took me a while, it took me longer than I ever thought it would,\" Thomas said of recovering from the MSU loss. \"Once we came back to practice Tuesday, like Coach Harbaugh said: 'Our football field, our turf and our grass, that's our medicine.' After that practice, I felt good. I said, 'You know what? Nothing we can do about it now. All we can do is improve our game and make sure something like that never happens again to us.'\"\nIt also took time for Royce Jenkins-Stone to feel ready to move on.\n\"I actually didn't believe that we lost the whole night until the next morning,\" Jenkins-Stone said. \"I saw it on the television. Then it took me until the next time we had practice to get over it.\n\"Definitely the way we lost was, like, unbelievable. Nobody would have thought we would have lost that way. Just losing to State, didn't want to do that.\"\nNow they look at the final five-game stretch as a fresh start. Michigan has three road games in that stretch, including back-to-back against Indiana and Penn State before returning home for the regular-season finale against Ohio State.\n\"The bye allowed us to focus on that and get us to understand what happened last week and happened at the beginning of the season (losing at Utah),\" Thomas said. \"We can change that with the second half of the season.\"\nHarbaugh said he has seen the team improve and likened the season to a book.\n\"The prologue has been written and now if it's going to be a great book, then it's got to have one heck of a conclusion,\" Harbaugh said. \"That's what we look for from our team and each unit.\"\nThe players said they're confident the team will rebound because of all the work they put into the season from the spring and summer to preseason camp and current practice.\n\"We have a great coaching staff that's been teaching us to get over it and get onto the next game,\" Jenkins-Stone said. \"(We) come out ready to compete each and every day in practice. That's what we did (Sunday); it was a great practice. We had fun and it seemed like nobody cared about that loss, but I'm pretty sure people were still thinking about it.\n\"I just feel bad for Minnesota because we're coming out with a lot of energy.\"\nMichigan at Minnesota \nWhen: Saturday, 7 p.m.\nWhere: TCF Bank Stadium, Minneapolis\nTV / radio: ESPN / WWJ 950, WTKA 1050\nRecords: Michigan 5-2 overall (2-1 Big Ten), Minnesota 4-3 (1-2)\nSeries: Michigan leads 73-25-3", "external_links": [], "published": "2015-10-26T17:51:00.000+02:00", "crawled": "2015-10-26T21:55:48.010+02:00", "highlightTitle": ""}