{"organizations": ["Des Bieler"], "uuid": "97e7c523658bba770b03f846d3fa9859797e20d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonpost.com", "main_image": "http://www.washingtonpost.com/blogs/early-lead/files/2015/10/00rondae1025.jpg", "site_section": "http://www.washingtonpost.com/rss/sports", "section_title": "Sports", "url": "https://www.washingtonpost.com/news/early-lead/wp/2015/10/25/nets-rookie-rondae-hollis-jefferson-made-his-mom-cry-with-this-surprise-gift/", "country": "US", "title": "Nets rookie Rondae Hollis-Jefferson made his mom cry with this surprise gift", "performance_score": 0, "site": "washingtonpost.com", "participants_count": 0, "title_full": "Nets rookie Rondae Hollis-Jefferson made his mom cry with this surprise gift", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T05:23:00.000+02:00", "replies_count": 0, "uuid": "97e7c523658bba770b03f846d3fa9859797e20d5"}, "author": "", "url": "https://www.washingtonpost.com/news/early-lead/wp/2015/10/25/nets-rookie-rondae-hollis-jefferson-made-his-mom-cry-with-this-surprise-gift/", "ord_in_thread": 0, "title": "Nets rookie Rondae Hollis-Jefferson made his mom cry with this surprise gift", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Rondae Hollis-Jefferson"], "text": "By Des Bieler October 25 at 11:16 PM Follow @DesBieler Rondae Hollis-Jefferson went to the Nets from the Trail Blazers in a draft-day trade. (Nick Laham/Getty Images)) \nRylanda Hollis made plenty of sacrifices while raising her two sons, Rahlir and Rondae, in Chester, Pa., one of the most crime-ridden towns in the state. She worked two jobs, getting about four hours of sleep each night, to provide for her boys and keep them away from the temptations of the streets. \nBoth kids grew up to be standout basketball players, and Rondae Hollis-Jefferson proved good enough to become a star at Arizona and, in June, a first-round draft pick with the Brooklyn Nets. Professional contract in hand, the rookie recently performed something of a rite of passage for many athletes who have risen out of challenging circumstances: He bought his mom a new home. \nHollis-Jefferson decided to make the house both a present and the location for a surprise birthday party he and Rahlir, a Temple product, threw for their mother. A well-produced video of the event shows a paucity of dry eyes in the house. \nIn an article for the New York Post , part of a recurring diary of his rookie season with the Nets, Hollis-Jefferson provided these details: \nWe were searching for the house for a while. My brother, the realtor, my uncle and a couple others were looking at houses and telling me about it, and I thought this one was the perfect fit. \nWhen I told the woman who owned the house why we were buying it, she cried. Being a mom, she understood what it meant more than us guys do. It was an emotional moment, and then she said, “We can make this happen.” They even bought my mom a cake! \nWe had a lot of our close family and friends and relatives at the house to surprise her. My sister was driving my mom to the house, and we told her to just knock on the door and ask for one of your friends. … \nShe said it was her best birthday ever. That’s huge for me and my brother, and my uncle, who is like a brother to us. … That’s big in our eyes, to be able to do that. Being able to change your mom’s life, to be able to put her in a comfortable situation. … It makes that feeling in your heart go to ease. \nInstead of worrying about where your mom is going, what she’s doing, it puts you at ease knowing she has a place of her own, and that she has somewhere to lay her head at night. It’s pretty special. \n(H/T Slam ) Des writes for the Early Lead and the D.C. Sports Bog, scouring the Web to bring readers items of interest, both serious and amusing. He also covers fantasy football, as well as fitness topics for the MisFits. sports Success! Check your inbox for details. You might also like: Please enter a valid email address Sign Up", "external_links": [], "published": "2015-10-26T05:23:00.000+02:00", "crawled": "2015-10-26T05:25:24.625+02:00", "highlightTitle": ""}