{"organizations": ["Reno Gazette-Journal", "Wolf Pack", "Mountain West"], "uuid": "8d4ca23170d948f3a33d540daf8cdc57b28ab40b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.rgj.com", "main_image": "http://www.gannett-cdn.com/-mm-/65db841a4fc9318c27e2157cd0ecf5d9b2a0d02f/c=0-33-2458-1422&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/12/RenoGroup/RGJ/635802506594415202-REN-MUSSELMAN-08.jpg", "site_section": "http://rssfeeds.rgj.com/reno/sports", "section_title": "RGJ - Sports", "url": "http://www.rgj.com/story/sports/college/nevada/2015/10/12/pack-notes-polian-has-ton-respect-0-6-wyoming/73841758/", "country": "US", "title": "Where will Wolf Pack basketball finish in MW?", "performance_score": 0, "site": "rgj.com", "participants_count": 0, "title_full": "Where will Wolf Pack basketball finish in MW?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T19:46:00.000+03:00", "replies_count": 0, "uuid": "8d4ca23170d948f3a33d540daf8cdc57b28ab40b"}, "author": "", "url": "http://www.rgj.com/story/sports/college/nevada/2015/10/12/pack-notes-polian-has-ton-respect-0-6-wyoming/73841758/", "ord_in_thread": 0, "title": "Where will Wolf Pack basketball finish in MW?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Murray", "Chris Murray"], "text": "Where will Wolf Pack basketball finish in MW? Murray's preseason Mountain West basketball poll The Mountain West preseason basketball poll will be released Tuesday. Here's a look at the ballot of Reno Gazette-Journal writer Chris Murray. Sponsored by MW basketball ballot 1. San Diego State \nI always put SDSU atop my ballot and just assume that's where the Aztecs will end up. It usually works out well. The formula for the Aztecs is the same this year as every year: play great defense and squeeze out just enough points to win 25-plus games. Malik Pope, a 6-10 wing player and projected lottery pick, has to step forward and buoy the offense, which lost two of its top three scorers. The length and athleticism on this team is ridiculous. Another 20-win season seems like a lock. MW basketball ballot 2. Boise State \nThe Broncos lost player of the year Derrick Marks but returns Anthony Drmic, who might be an even better player. Joining him is MW player of the year candidate James Webb III. From top to bottom, I'd take San Diego State's roster but the Broncos have the best 1-2 punch in the conference, plus Boise State can do something SDSU can't: shoot. Boise State has recruited well in recent seasons, so I'd expect a couple of players to emerge out of nowhere, plus BC transfer Lonnie Jackson adds a punch. MW basketball ballot 3. Utah State \nTim Duryea takes over from Aggies legend Stew Morrill, but you can expect much of what you've seen in the past considering Duryea spent the last 14 seasons under Morrill in Logan. Unlike most new coaches, Duryea doesn't have a rebuild. He takes over a roster that returns all five starters from last year's fourth-place team, including second-team all-conference honor Jalen Moore and David Collette, one of the league's top centers. Life after Morrill shouldn't see an immediate drop-off. MW basketball ballot 4. Fresno State \nLike Utah State, the Bulldogs return all of their key pieces, although this team's strength is in the backcourt rather than the frontcourt. Marvelle Harris, Cezar Guerrero, Julien Lewis form the MW's best backcourt and Paul Watson and Karachi Edo are good frontcourt pieces. Fresno State has finished sixth, fifth and sixth in its three seasons in the MW but has the potential to move into the top three this season. It's a smaller team, but that's the way coach Rodney Terry, in his fifth season, likes it. MW basketball ballot 5. UNLV \nSeem low? I'm done believing UNLV's talent will turn into wins until it actually happens. The Rebels are a top-25 team in the nation in talent but the struggles have come when the ball hits the floor. The frontcourt is obscene with Stephen Zimmerman, Ben Carter, Goodluck Okonoboh and Dwayne Morgan. The backcourt isn't shabby either with Patrick McCaw, one of the more underrated players in the nation, Mercer transfer Ike Nwamu and Jordan Cornish. We'll see if that talent translates this year. MW basketball ballot 6. New Mexico \nThe Lobos were a massive disappointment last season, finishing eighth in the MW while putting up a below-.500 mark overall. If a rebound is to happen, it will be because of Cullen Neal, who missed most of last year with an ankle injury, and Elijah Brown, a transfer from Butler and the son of ex-NBA head coach Mike Brown. New Mexico also has a solid center in Obij Aget. The talent level has fallen from the Steve Alford years. A top-half finish is expected but I don't see a top-three finish. MW basketball ballot 7. Nevada \nYou have to be impressed with where first-year coach Eric Musselman and his staff have the Wolf Pack headed, but the 2015-16 roster is almost exactly the same as the 2014-15 roster that won nine games. The Wolf Pack will do better than nine wins this season, but it's an uphill struggled to finish in the top half of the MW given the lack of shooting on the roster. A 15-win season would be a step in the right direction. A winning season would be huge as Musselman tries to set the foundation. MW basketball ballot 8. Colorado State \nThe Rams won 27 games and finished with a top-30 RPI but didn't make the NCAA Tournament. Then it lost its top three scorers in the offseason, which leaves coach Larry Eustachy with a bit of a rebuild. Eustachy is a good enough coach the Rams won't bottom out, but he'll miss JJ Avila, Stanton Kidd and Daniel Bejarano, who combined for nearly 40 points and 20 rebounds per game. The backcourt returns three good players (Gian Clavell, Jon De Ciman, John Gillon) and All-American JC transfer, Emmanuel Omogbo, joins the fold. Omogbo needs to have a big season in his Rams' debut. MW basketball ballot 9. Wyoming \nNo MW team lost more than Wyoming, which reached the NCAA Tournament last season behind Larry Nance Jr., Derek Cooke Jr., Riley Grabau, Charles Hankerson Jr. and Josh Adams. All but Adams were seniors last year and thus are gone, leaving one all-conference-caliber player and a bunch of new faces. Larry Shyatt is one of the best coaches in the MW and he'll keep the Cowboys competitive. This team will play defense, which leads to wins, but who's going to score the ball outside of Adams? MW basketball ballot 10. Air Force \nNot only was Air Force not very good last season, finishing ninth in the conference with a 6-12 league mark, it also lost its top three scorers as well as Matt Mooney (6.9 ppg as a freshman), who transferred while citing bullying at the school. There are some proven players in Zach Kocur and Trevor Lyons, but certainly the Falcons will be at a talent disadvantage in most of its games. Air Force's offense is always efficient under coach Dave Pilipovich but defense has always been a struggle. MW basketball ballot 11. San Jose State \nSJSU might be the worst basketball program at the Division I level as coach Dave Wojcik inherited a mess and has gone 9-52 overall and 1-35 in the MW in his two seasons as the Spartans' head coach (yes, that one league win came over Nevada in Reno). To throw gasoline on the fire, the team's best player, Rashad Muhammad (13.9 ppg last year), transferred to Miami in the summer. This program has been a mess for a long time. Anything better than 11th is a good season. Chris Murray Chris Murray , cmurray@rgj.com 9:46 a.m. PDT October 12, 2015 First-year Nevada basketball coach Eric Musselman directs his team through a recent practice. (Photo: Jason Bean/RGJ) 2 CONNECT 11 TWEET LINKEDIN COMMENT EMAIL MORE \nWe’re in the middle of the football season, but the start of the basketball season isn’t too far away. \nThe Mountain West will release its preseason basketball poll Tuesday and Reno Gazette-Journal writer Chris Murray was one of the voters in this year’s poll. Here’s a look at his projection of where the Wolf Pack will finish in 2015-16 under first-year coach Eric Musselman as well as the rest of the MW teams. \n(Editor's note: If you're using mobile and don't see the interactive with the projected team finishes at the top of this page, scroll to the bottom and luck \"Full Site.\") \nAll-Conference Team \n* Anthony Drmic, Boise State: Drmic missed most of last year with an ankle injury and used a redshirt. In his last full season, Drmic averaged 15.9 points and 4.5 rebounds per game. He’s a smooth, efficient player and plus shooter who takes over the lead-dog role from last year’s MW MVP Derrick Marks. \n* Marvelle Harris, Fresno State: One of the most underrated scorers in the nation, Harris averaged 16.4 ppg last season and can score in a variety of ways. He’s a good playmaker (3.8 assists per game) and plus-defender (2.0 steals per game). Harris leads a talented Fresno State roster. \n* Josh Adams, Wyoming: The only returning start in Wyoming, Adams will have to take on a larger role. The fire-plug point guard is an excellent athlete who averaged 12.8 ppg, 3.6 apg, 3.3 rpg and 1.4 spg. He can be a little wild and inefficient at times, but is a play-maker who will have to lead the Cowboys. \n* James Webb III, Boise State: Webb came out of nowhere last season to make a huge impact once Drmic went down. Webb averaged 11.2 points and eight rebounds per game, numbers that went up in MW play. He hit 55.2 percent of his shots, including 40.9 percent from three as a versatile forward. \n* AJ West, Nevada: The Wolf Pack big man led the nation in offensive rebounds (yes, Nevada missed a lot of shots, but he’s a good rebounder) and logged a double-double for the season (12.1 ppg, 11 rpg) while adding 2.6 blocks per game. Still raw offensively, he’s the backbone of Nevada’s defense. \nPlayer of the Year \n* James Webb II, Boise State: Plenty of options here as you could pick any one of the five players on my all-conference team as well as Utah State’s Jalen Moore and San Diego State’s Malik Pope, the top NBA prospect in the league. But Webb should follow his breakout season with another breakout campaign as he moves into the upper-echelon of players in the nation. He’s a great athlete with true scoring ability. \nNewcomer of the Year \n* Ike Nwamu, UNLV: The Mercer transfer, who visited Nevada’s campus but opted for the Rebels, averaged 15.1 ppg last season and is eligible immediately. UNLV is loaded with talent but most of it is young. Nwamu, an excellent and strong athlete, should provide an immediate boost in scoring. \nFreshman of the Year \n* Stephen Zimmerman, UNLV: The homegrown 7-footer was a McDonald’s All-American and a consensus top-25 recruit in his class. He’s a difficult matchup for a big man because of his ability to shoot and pass. He, along with Goodluck Okonoboh, form a huge frontcourt for the Rebels. 2 CONNECT 11 TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http://on.rgj.com/1RCG7sj TOP VIDEOS", "external_links": [], "published": "2015-10-12T19:46:00.000+03:00", "crawled": "2015-10-13T04:04:18.154+03:00", "highlightTitle": ""}