{"organizations": [], "uuid": "8b7f473cfb79cdb70df6969d3c88c8a40c98b02c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fox8live.com", "main_image": "http://APMOBILE.images.worldnow.com/images/9003153_G.jpg", "site_section": "http://www.fox8live.com/", "section_title": "New Orleans News, Weather, Saints - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "url": "http://www.fox8live.com/story/30245503/bells-1-yard-td-run-at-buzzer-lifts-steelers-over-chargers", "country": "US", "title": "Bell's 1-yard TD run at buzzer lifts Steelers over Chargers", "performance_score": 0, "site": "fox8live.com", "participants_count": 1, "title_full": "Bell's 1-yard TD run at buzzer lifts Steelers over Chargers - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "8b7f473cfb79cdb70df6969d3c88c8a40c98b02c"}, "author": "cbs8", "url": "http://www.fox8live.com/story/30245503/bells-1-yard-td-run-at-buzzer-lifts-steelers-over-chargers", "ord_in_thread": 0, "title": "Bell's 1-yard TD run at buzzer lifts Steelers over Chargers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By BERNIE WILSON\nAP Sports Writer SAN DIEGO (AP) - Mike Tomlin and Le'Veon Bell knew exactly what had to happen.\nWith five seconds left, the Pittsburgh Steelers down by three points and the ball inside the 1, Bell had to get into the end zone.\nIt was a wildcat way to win, which the Steelers did 24-20, stunning the San Diego Chargers and sending tens of thousands of Terrible Towel-waving Pittsburgh fans into delirium at Qualcomm Stadium.\nBell took the direct snap, ran left and was slowed in traffic before diving for the end zone and getting the ball across the line as Donald Butler dragged him down.\n\"It was time to go to the mattresses, if you will,\" said Tomlin, the Steelers' coach. \"We had to do what was required to win. Le'Veon gave us an opportunity to win, and we were trying to do everything we could to move the football.\"\nBell said it was the most meaningful touchdown of his three-year career. \"The game-winner on the last play of the game, that's what you dream about,\" he said.\n\"I got to get it in,\" Bell said. \"We still had a timeout left. I was thinking we still have a timeout left, so I'm thinking, 'OK, maybe if I get stopped, maybe run like 4 seconds off and get a timeout and we could kick a field goal.' I wanted to end the game right there.\"\nBell ran 21 times for 111 yards.\nSan Diego rookie Josh Lambo kicked a go-ahead, 54-yard field goal with 2:56 left.\nHere are some things that stood out as the Steelers moved to 3-2 and the Chargers fell to 2-3:\nHEINZ FIELD WEST: It's never been hard for fans of visiting teams to get tickets at Qualcomm Stadium, and Steelers fans practically overran the aging concrete bowl, which could be hosting its final year of the NFL because Chargers owner Dean Spanos wants to move to the Los Angeles area.\n\"First I'd like to thank Steeler Nation,\" Tomlin said. \"How about the support that we had in the building tonight? We get that type of support just about all of the time we're on the road, but it doesn't get old. We appreciate it.\"\nOPPOSING VIEW: Chargers quarterback Philip Rivers didn't appreciate the many fans clad in black and gold.\n\"It was a tough environment tonight. It was like being on the road,\" Rivers said.\n\"Odd is one word we could use,\" Rivers said. \"We were in silent count and we had no chance. We were checking in and out of plays and it was about as tough as it gets. I'm usually hoarse after road games and I'm going to be today as well.\"\nBE LIKE MIKE: Mike Vick, having an awful game until the fourth quarter, kept the winning drive alive with a 24-yard scramble up the middle on third-and-6 from the 41 and then a 16-yard pass to Heath Miller to the 1 a play before Bell's big run. An unnecessary roughness call against San Diego's Jahleel Addae moved the ball a half-yard closer to the end zone and stopped the clock.\n\"It's not how you start. It's how you finish,\" Vick said.\nVick, making his second straight start in place of injured Ben Roethlisberger, couldn't get much going until he and Markus Wheaton hooked up on a 72-yard touchdown on a stop-and-go route to tie it at 17 with 7:42 left.\nGATESY: Antonio Gates returned from a four-game PED suspension and caught a 12-yard scoring pass from Philip Rivers in the first quarter and then had an 11-yard grab with 8:02 left to give the Chargers a 17-10 lead. Gates has 101 career TDs, joining Tony Gonzalez (111) as the only tight ends to reach that milestone.\nRivers has thrown 74 touchdown passes to Gates, the most from a QB to a tight end in NFL history.\nGates was suspended without pay for testing positive for a performance-enhancing drug in the offseason.\nPICK-SIX: Antwon Blake intercepted Rivers' pass and returned it 70 yards for a touchdown to give the Steelers a 10-7 lead late in the third quarter. Receiver Malcom Floyd broke off a crossing route that led to the pickoff.\nIt was Rivers' third pick-six of the season. He has turnovers in 10 of his last 11 games.\nOnline: http://pro32.ap.org/poll and http://twitter.com/AP_NFL\nCopyright 2015 The Associated Press. This material may not be published, broadcast, rewritten or redistributed.", "external_links": ["http://twitter.com/AP_NFL", "http://pro32.ap.org/poll"], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T17:20:13.362+03:00", "highlightTitle": ""}