{"organizations": ["Norwich"], "uuid": "279dc2d68ec4b03c9a02af2bc6d27abc904b2399", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/57d91972be0cc96f765144fe5e173c32.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/football/west-broms-record-signing-salomon-rondon-pours-on-the-agony/6984239/", "country": "JE", "title": "West Brom's record signing Salomon Rondon pours on the agony for Norwich", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "West Brom's record signing Salomon Rondon pours on the agony for Norwich", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T19:17:00.000+03:00", "replies_count": 0, "uuid": "279dc2d68ec4b03c9a02af2bc6d27abc904b2399"}, "author": "", "url": "http://www.sport.co.uk/football/west-broms-record-signing-salomon-rondon-pours-on-the-agony/6984239/", "ord_in_thread": 0, "title": "West Brom's record signing Salomon Rondon pours on the agony for Norwich", "locations": ["Norwich West Brom", "West Brom"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Salomon Rondon"], "text": "West Brom's record signing Salomon Rondon pours on the agony for Norwich 24 Oct 2015 16:17:10 \ncomments \nSalomon Rondon's early second-half goal was enough for West Brom to leave Carrow Road with all three points. \nNorwich were looking to bounce back from a galling defeat at Newcastle last Sunday but could not make their early dominance pay as West Brom secured a narrow 1-0 victory. \nCanaries boss Alex Neil dropped both of his full-backs following the 6-2 hammering on Tyneside but Norwich could not breach a solid backline from the visitors. \nWith games against Manchester City, Chelsea, Arsenal and Manchester United to come in their next six Premier League fixtures, Norwich needed a result here but were toothless when it mattered - with West Brom's record signing Rondon heading home less than a minute into the second half. \nWes Hoolahan had the first chance for a quick-starting Norwich, firing over after good work from Matt Jarvis and Nathan Redmond had teed up the Republic of Ireland international. \nThe visitors were slower out of the blocks but Chris Brunt's drive still forced a smart save out of John Ruddy before Jonny Howson was next to miss the target for Norwich. \nNeil's side were really pushing the issue as Alex Tettey saw a rasping shot bravely blocked by Jonny Evans with Redmond finally drawing a save out of Boaz Myhill with a low drive. \nHowson was shown a yellow card for tripping Saido Berahino and was lucky not to pick up a second booking moments later for a foul on Darren Fletcher - with referee Kevin Friend giving him the benefit of the doubt. \nA well-worked free-kick routine from the Baggies almost saw Rondon put them in front but he could not connect as he slid in to meet Craig Dawson's cross. \nJarvis was enjoying his battle with Dawson and again managed to cross from the left with Redmond only able to send a shot over the bar on the slide. \nWest Brom's attacks may have been few and far between but Brunt again tested Ruddy from distance with the England goalkeeper shovelling the ball behind for a corner. \nBoth sides came close before the break, firstly Dawson somehow missed a header from inside the six-yard box before Dieumerci Mbokani's close-range chance was smothered by Myhill. \nRondon also headed over the top as the game opened up in the final five minutes of the first half - but the sides went in level at the interval. \nBut West Brom needed no second invitation after the restart as Berahino was freed down the right, playing in James McLean whose cross was nodded home by Rondon. \nPulis' side were now in control of the game as, for a third time, Ruddy was on hand to prevent Brunt scoring from outside the box. \nNorwich had no response as Russell Martin flashed high and wide from the edge of the box and they could not create a clear chance as they slipped to a fifth league defeat of the campaign. \nTWEET OF THE MATCH \n\"I don't care we're still staying up. Bournemouth, Villa and Sun'lun going down innit.\" - Norwich blogger @Holtamania is confident of staying up. \nhttps://twitter.com/Holtamania/status/657945652161347584 \nPLAYER RATINGS (Out of 10) \nNorwich", "external_links": [], "published": "2015-10-24T19:17:00.000+03:00", "crawled": "2015-10-24T20:22:03.239+03:00", "highlightTitle": ""}