{"organizations": ["LJ Scott", "NCAA", "AP", "CBS"], "uuid": "c8f8178c926c4db4cca085ca6bdf0ab4c33ec9cc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kpho.com", "main_image": "http://images.worldnow.com/AP/images/9041770_G.jpg", "site_section": "http://kpho.com/category/13566/national-sports?clienttype=rss", "section_title": "KPHO Phoenix - National Sports - Headline", "url": "http://www.kpho.com/story/30287269/no-7-spartans-use-blunder-to-shock-no-12-michigan-27-23", "country": "US", "title": "No. 7 Spartans use blunder to shock No. 12 Michigan, 27-23", "performance_score": 0, "site": "kpho.com", "participants_count": 0, "title_full": "No. 7 Spartans use blunder to shock No. 12 Michigan, 27-23", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T23:25:00.000+03:00", "replies_count": 0, "uuid": "c8f8178c926c4db4cca085ca6bdf0ab4c33ec9cc"}, "author": "", "url": "http://www.kpho.com/story/30287269/no-7-spartans-use-blunder-to-shock-no-12-michigan-27-23", "ord_in_thread": 0, "title": "No. 7 Spartans use blunder to shock No. 12 Michigan, 27-23", "locations": ["Mich.", "Mich", "Ann Arbor", "Michigan"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Connor Cook", "Chris Wormley", "Osorio", "R.J. Shelton", "Ann Arbor", "Aaron Burbridge"], "text": "No. 7 Spartans use blunder to shock No. 12 Michigan, 27-23 - CBS 5 - KPHO Member Center: CBS Shows Online No. 7 Spartans use blunder to shock No. 12 Michigan, 27-23 (AP Photo/Carlos Osorio). Michigan State running back LJ Scott (3) is stopped during the first half of an NCAA college football game against Michigan, Saturday, Oct. 17, 2015, in Ann Arbor, Mich. (AP Photo/Carlos Osorio). Michigan State wide receiver R.J. Shelton (12) is hit by Michigan safety Jabrill Peppers (5) during the first half of an NCAA college football game, Saturday, Oct. 17, 2015, in Ann Arbor, Mich. Peppers was called for pass inte... (AP Photo/Carlos Osorio). Michigan State wide receiver Aaron Burbridge (16) is tackled by Michigan defensive end Chris Wormley (43) during the first half of an NCAA college football game, Saturday, Oct. 17, 2015, in Ann Arbor, Mich. (AP Photo/Carlos Osorio). Michigan State quarterback Connor Cook (18) throws a pass during the first half of an NCAA college football game against Michigan, Saturday, Oct. 17, 2015, in Ann Arbor, Mich. By LARRY LAGEAP Sports Writer \nANN ARBOR, Mich. (AP) - The snap was flubbed by the punter, and the football went flying. Jalen Watts-Jackson grabbed it with his right hand, cradled it to his body and ran a ball into the end zone that was supposed to be booted the other way. \nIn the 10 seconds it took for the clock to tick down, Watts-Jackson went from total obscurity to pulling off one of the most unlikely endings in college football as No. 7 Michigan State beat No. 12 Michigan 27-23. \n\"That's why football is loved so much in America,\" Michigan State coach Mark Dantonio said. \"It's because things like this happen. Every now and then, they happen.\" \nHe could only take it in for a moment. As Watts-Jackson lay on a maize \"M'' in the end zone, his teammates piled above him, his hip was dislocated in the ruckus. Watts-Jackson was later carted off the field and taken to a hospital, barely getting a glimpse of the scene he set off. \nNo one will soon forget it. \nThe game was seemingly over when Watts-Jackson found himself in perfect position to make the unbelievable play. \nWith the Wolverines up 23-21 and 10 seconds left, Michigan punter Blake O'Neill bobbled a low snap. As the Australian spun around to try and make the kick, he was swarmed by Spartans and the ball popped free. \nWatts-Jackson caught it and raced 38 yards toward the end zone, taking advantage of Jermaine Edmondson's blocking and powering through Jake Butt's hit just before the goal line. \nNow it was over. \nThe last time a FBS game ended with a defense or special teams game-winning score with no time left was Nov. 30, 2013, when Auburn beat Alabama after returning a missed field goal, according to STATS. \n\"You go from 10 seconds, a guy punting the ball, you're thinking OK this is done,\" Dantonio said. \"And then all of a sudden, life gets flipped upside down.\" \nMichigan coach Jim Harbaugh lamented that O'Neill didn't simply handle the ball after bobbling it and fall to the ground, likely leaving the Spartans with a heave into the end zone. \n\"A mistake was made,\" Harbaugh said somberly. \"Mistakes were made. It's very unfortunate circumstances.\" \nMichigan State (7-0, 3-0 Big Ten) has won seven of eight in the series, its best stretch in more than a half-century. \n\"We're not the weak sisters,\" Dantonio said. \nMichigan (5-2, 2-1) lost for the first time since opening the season with a setback at Utah. \n\"We could hang our heads, but I think we'll respond great because that's the kind of team we are,\" kicker Kenny Allen said. \nThe Wolverines were seconds or a first down away from sealing the momentum-building win after Sione Houma ran for two TDs, Allen kicked three field goals and forcing the Spartans to turn the ball over on downs with 1:47 left at its 45. \nThe Spartans had only one timeout left and used it after the next snap. Michigan had two and Harbaugh used both, including one with 10 seconds left to set up the final punt and discuss all options. \n\"If you go for it, you leave them with a Hail Mary opportunity,\" Harbaugh said. \"We could protect and throw a long pass. We ran through the scenarios and felt like the best decision was to punt. They didn't have any returners. It was a matter of punting it. We messed up.\" \nMichigan State moved the ball up and down the field against a team that had shut out three straight opponents, picking up 386 yards - mostly through the air - and 20 first downs. \nConnor Cook was 18 of 39 for 328 yards and a TD against the nation's top-rated defense, improving his record to 30-3 as a starter and perhaps helping him get mentioned more in the Heisman Trophy race. Aaron Burbridge had nine receptions for 132 yards for the Spartans. \nMichigan's Jake Rudock was 15 of 25 and 168 yards and avoided turning the ball over. \nIn fact, both teams took good care of the football until the final snap. \nBefore the dramatic finish, it looked like a trick play was going to lead to a setback for the Spartans. \nDantonio, known for having the guts to call trick plays, called for a fake punt when no one was expecting it. Punter and backup quarterback Tyler O'Connor ran 7 yards on a fourth-and-8 from the Michigan State 31, turning the ball over on downs. Michigan took advantage, moving to a 17-7 lead early in the third quarter on Houma's 1-yard run. \nThe Spartans, though, made the most of an improbable opportunity to win in the end. \n\"Football is a crazy, crazy game,\" Dantonio said. \"You can't really hardly explain it.\" \n___ \n___ \nFollow Larry Lage at http://www.twitter.com/larrylage . Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-18T23:25:00.000+03:00", "crawled": "2015-10-18T23:33:07.300+03:00", "highlightTitle": ""}