{"organizations": [], "uuid": "78cd98d0f260d932dc8d120ca9331a5b34d9ce8e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbssports.com", "main_image": "http://cbssports.com/images/blogs/Miami_Dolphins_Coaching_Candidates_Kyle_Shanahan_Jim_Harbaugh.jpg", "site_section": "http://www.cbssports.com/partners/feeds/rss/home_news", "section_title": "Sports News : CBSSports.com", "url": "http://www.cbssports.com/nfl/eye-on-football/25328494/who-will-be-the-dolphins-next-head-coach-10-candidates-to-replace-joe-philbin", "country": "US", "title": "Who will be Dolphins' next coach? 10 candidates to replace Joe Philbin", "performance_score": 0, "site": "cbssports.com", "participants_count": 35, "title_full": "Who will be Dolphins' next coach? 10 candidates to replace Joe Philbin - CBSSports.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T21:55:00.000+03:00", "replies_count": 41, "uuid": "cc756834b29767d76960d425e46e5745abc17774"}, "author": "Will Brinson", "url": "http://www.cbssports.com/nfl/eye-on-football/25328494/who-will-be-the-dolphins-next-head-coach-10-candidates-to-replace-joe-philbin#post-0", "ord_in_thread": 0, "title": "Who will be Dolphins' next coach? 10 candidates to replace Joe Philbin", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Dolphins finally took the plunge and fired Joe Philbin . The timing is perfectly Miami: 196 days after giving Philbin an extension, Stephen Ross and Mike Tannenbaum cut him loose. It's understandable because Philbin -- despite being a REALLY NICE GUY -- is 24-28 in his career, the Dolphins are 1-3 and just got embarrassed on national brunch-time television by the Jets in London. \nWhat's not understandable? Why the Dolphins would bring a .500 coach back if they weren't prepared to give him the full season. $100 million was spent on Ndamukong Suh this offseason in the latest free-agency revamping of the roster and for what? A lost year. \nAnyway, there should be a fun, prolonged and likely bungled coaching search to enjoy at some point this offseason. Let's look at 10 potential candidates to replace Philbin. \nSome are realistic, some are not. Some are from college, some are not. The key for a Stephen Ross hire? Being a big name and making a splash. Most of these apply.\nKyle Shanahan ( Falcons OC) : Even if Kyle is the less famous member of his family (dad Mike owns that title), he's got the cache of a headline-grabbing coach. And he's worked wonders offensively at multiple spots, including the Texans , Browns (!) and now with the Falcons. If Atlanta keeps up its hot start he will be a hot name this offseason. Have to think Ross could see him as someone who could fix Ryan Tannehill . \nJosh McDaniels ( Patriots OC) : The one-time Broncos head coach returned to the Patriots as offensive coordinator to salvage his reputation and boy is it salvaged. New England won the Super Bowl with McDaniels prominently featured on offense last year and is shredding people this year. It's only a matter of when, not if, McDaniels gets another gig. Going in division against Bill Belichick would be super aggressive however. \nAdam Gase ( Bears OC) : Not as big a name but a high-end offensive coach. Gase was one of the hot young coordinators while running the Broncos offense (he came up under McDaniels, actually) and turned down a gig with the Browns previously. After John Fox left Denver, Gase reunited with his old boss in Chicago. If the Bears are even remotely dangerous on offense this year he'll get some action.\nTeryl Austin ( Lions DC) : Step-back year for the Lions defense thus far, but they lost lots of personnel this offseason, including one Ndamukong Suh, who had the best year of his career playing under Austin. If Detroit finishes anywhere near the top half of the league in total defense after trying to revamp on the fly, Austin should get some run when it comes to head-coaching opportunities. \n\nCould Kyle Shanahan work in Miami? (USATSI) \n\nSean McDermott ( Panthers DC) : Are people keeping up with what's happening in Carolina? The Panthers rank in the top 10 in defensive yards allowed four out of the last five years and have been a top-five scoring defense twice in the last five seasons. There are good pieces of personnel there ( Luke Kuechly ) but McDermott is doing a heck of a job with Carolina's defense. \nEric Mangini ( 49ers DC) : No one in San Francisco is getting major love for their performance these past few weeks, but Mangini does have a connection with the Dolphins. EVP Mike Tannenbaum has a history with Mangini, having worked with him when the two were with the Jets prior to the Rex Ryan years. If you think an NFL team wouldn't give a two-time former NFL head coach with a losing record another chance you haven't been paying attention.\nJim Harbaugh (Michigan HC) : Only putting Harbs' name here to troll Michigan fans. Literally the only reason I'm including him. \nDavid Shaw (Stanford HC) : If you can't have Harbs about how the guy who replaced him? Shaw's long been a name NFL teams are interested in, even if the interest isn't reciprocal. It would be a splash hire if Ross could pull it off.\nKevin Sumlin (Texas A&M HC) : But not as big a splash as Sumlin, flying in over South Beach in a helicopter and yelling \"YESSIR!\" at his opening press conference. (All of which may be why he decides to stay at College Station.) If Ross is serious about making a run at someone with a big name, Sumlin will be among the guys mentioned. \nDan Campbell (Interim Dolphins HC) : Oh right! The guy who is stood up in front of cameras on Monday, flexed his pythons and talked about challenging players. Campbell wasn't ripping Philbin or anything, but he made it clear the Dolphins weren't being challenged. Expect to see a short-term impact from the motivation Campbell provides. If it carries over he could steal the coaching gig. \nTopics: Luke Kuechly , Ndamukong Suh , Ryan Tannehill , Coaching Changes , Coaching Rumors , Will Brinson , Atlanta Falcons , Carolina Panthers , Chicago Bears , Cleveland Browns , Denver Broncos , Detroit Lions , Houston Texans , Miami Dolphins , New England Patriots , New York Jets , San Francisco 49ers , NFL", "external_links": [], "published": "2015-10-05T21:55:00.000+03:00", "crawled": "2015-10-06T05:10:04.780+03:00", "highlightTitle": ""}