{"organizations": [], "uuid": "f91c38c913f08202ffd6c1404d2f1d218a324765", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "neighbornewspapers.com", "main_image": "http://matchbin-assets.s3.amazonaws.com/public/sites/2518/thumbs/B3JB_aow.jpg", "site_section": "http://neighbornewspapers.com/rss/rss/Sports?instance=Sports&content_type=article&tags=sports&tag_inclusion=or&offset=0&limit=10&page_name=rss", "section_title": "Sports", "url": "http://neighbornewspapers.com/bookmark/26897483", "country": "US", "title": "Athlete of the Week Brantley Mauldin--PAULDING COUNTY", "performance_score": 0, "site": "neighbornewspapers.com", "participants_count": 1, "title_full": "Athlete of the Week Brantley Mauldin--PAULDING COUNTY", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T01:19:00.000+03:00", "replies_count": 0, "uuid": "f91c38c913f08202ffd6c1404d2f1d218a324765"}, "author": "Neighbor Newspapers (noreply@neighbornewspapers.com)", "url": "http://neighbornewspapers.com/bookmark/26897483", "ord_in_thread": 0, "title": "Athlete of the Week Brantley Mauldin--PAULDING COUNTY", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "slideshow A handful of quarterbacks have thrown for more than 500 yards in a game in Georgia but Paulding County’s Brantley Mauldin is the first sophomore to accomplish this feat according to the Georgia High School Football Historians Association.On Sept. 25 against Villa Rica, Mauldin passed for 505 yards, including three touchdowns, in a 38-35 victory.“I was shocked because I really didn’t think I had thrown for that much,” said Mauldin, who completed 24-of-39 pass attempts. “The line did great that game and the receivers made all the catches that they had to.”“Brantley is a very intelligent player,” Paulding County coach Scott Hamilton said. “He can tell us what is going on after every series, which allows us to make adjustments on the fly during the game. Brantley also is very calm and doesn’t get rattled at all.”Mauldin zipped passes to five different receivers, including Antonio Gandy-Golden (seven catches, 146 yards), Malik Rush (six receptions, 143 yards and a touchdown), Tre Lewis (four catches, 110 yards), Dondre Ledford (five receptions, 51 yards) and Caleb Sailors (two catches for 55 yards and two scores).“The best touchdown pass was a rollout play to Sailors who made a pretty good grab,” said Mauldin, who also rushed for a TD and threw only one interception.Mauldin said his biggest improvement this season has been having more patience in the pocket. He also likes the entire decision-making process which comes with playing quarterback.“I like being able to have the ball in my hands and make good decisions when I can which helps benefit the team a lot,” Mauldin said.A fan of Aaron Rodgers and Peyton Manning, Mauldin is also a member of the baseball team. He is a pitcher, who enjoys throwing the slider, and one of the short stops.“I throw the ball about 85 miles per hour right now and my slider is about 81-82 right now and has a pretty slick break,” Mauldin said.Mauldin has a 4.0 grade-point average and his favorite subject is social studies.Last Friday, the Patriots had their two-game winning streak ended with a 35-21 loss to East Paulding. Paulding County will try to bounce back this week at South Paulding.“My main goal is not really about stats or anything,” Mauldin said. “I just want to be able to help lead the team especially help the seniors get to the playoffs this year.” Share This Article | similar stories", "external_links": [], "published": "2015-10-08T01:19:00.000+03:00", "crawled": "2015-10-11T17:56:44.686+03:00", "highlightTitle": ""}