{"organizations": [], "uuid": "91f23345c062de34a894ef95c4525ef473c3ca83", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.rrstar.com", "main_image": "http://www.rrstar.com/Global/images/head/nameplate/rrstar_logo.png", "site_section": "http://www.rrstar.com/sports?template=rss&mime=xml", "section_title": "Sports - Rockford Register Star", "url": "http://www.rrstar.com/article/20151017/SPORTS/151019546/2000/NEWS?rssfeed=true", "country": "US", "title": "Auburn clinches share of conference title with 28-0 win over Guilford", "performance_score": 0, "site": "rrstar.com", "participants_count": 1, "title_full": "Auburn clinches share of conference title with 28-0 win over Guilford", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T08:09:00.000+03:00", "replies_count": 0, "uuid": "91f23345c062de34a894ef95c4525ef473c3ca83"}, "author": "Karen Patterson Staff writer", "url": "http://www.rrstar.com/article/20151017/SPORTS/151019546/2000/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "Auburn clinches share of conference title with 28-0 win over Guilford", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Oct. 17, 2015 at 12:01 AM Updated at 12:09 AM ROCKFORD — Auburn High School's football team has been chasing history all season. Friday night, the team clinched at least a share of the NIC-10 conference title, its first in more than 50 years. The Knights (7-1) defeated Guilford 28-0 in their final home game of the 2015 regular season. Wins by Belvidere North (6-2) and Harlem (6-2) mean that Auburn will have to win its Week 9 matchup against Freeport to win the title outright. \"We have to go out there and play our same game,\" said junior lineman Earnest Austin. \"If we get another shutout, that'd be great, but we have to play our game.\" Austin and his fellow defensive linemen caused fits all night for the Vikings' offense, sacking quarterback Austin Pena five times. Pena found no quarter throwing the ball; he was intercepted three times, including a pick-six by Juwuane Parchman with less than a minute left in the game. Pena finished 10 of 16 for 122 yards. Damonte Reed led the ground game with 59 yards on 13 carries. Guilford struggled to find an offensive rhythm, however, particularly on the opening drive of the second half, when it moved to the Auburn 22-yard-line before turning the ball over on downs. \"We punch it in and it's a 14-7 score and probably a different game,\" Guilford coach Mel Gilfillan said. \"We've got to get after it this week. We have to limit our penalties, which we didn't do, and limit our turnovers, which we didn't do.\" While Auburn had its share of errors — quarterback Nathan Jarrett was sacked twice, and the team fumbled twice in the second-half — the Knights had 320 yards on offense with two touchdown runs by Daqwuan Bell and a 51-yard touchdown pass from Jarrett to Elvis Miller with 3:30 left in the first half. \"We've got to touch it up on the turnovers and clean it up,\" Bell said. \"But it was good that we were able to get those scores, especially in the fourth quarter.\" Bell finished with 87 yards on six carries with two touchdowns. Teammate Vontez Fricks picked up 76 yards on 13 carries. Barrett completed 4 of 8 passes for 74 yards, including the 51-yard pass to Miller, who had two catches for 57 yards. According to Auburn coach Dan Appino, the focus for next week's match-up in Freeport is to continue building momentum. \"We've been playing some really good teams and we've been getting better each week,\" Appino said. \"Freeport brings a lot of speed, and Aaron (Wichman) has done a real nice job of putting together a solid defense.\" Karen Patterson: 815-232-0133; Karen.patterson@Journalstandard.com ; @KarenP_FJS By Karen Patterson", "external_links": [], "published": "2015-10-17T08:09:00.000+03:00", "crawled": "2015-10-17T17:00:46.406+03:00", "highlightTitle": ""}