{"organizations": [], "uuid": "76d413e392bf5f03208ac605573e83c9275db6cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.recordonline.com", "main_image": "http://www.recordonline.com/storyimage/TH/20151008/SPORTS/151009388/AR/0/AR-151009388.jpg", "site_section": "http://www.recordonline.com/sports?template=rss&mime=xml", "section_title": "Sports - recordonline.com", "url": "http://www.recordonline.com/article/20151008/SPORTS/151009388/101009/NEWS?rssfeed=true", "country": "US", "title": "Former first-rounder Groppuso likes Mets' chances", "performance_score": 0, "site": "recordonline.com", "participants_count": 1, "title_full": "Former first-rounder Groppuso likes Mets' chances", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T07:04:00.000+03:00", "replies_count": 0, "uuid": "76d413e392bf5f03208ac605573e83c9275db6cd"}, "author": "Josh Bakan", "url": "http://www.recordonline.com/article/20151008/SPORTS/151009388/101009/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "Former first-rounder Groppuso likes Mets' chances", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Oct. 8, 2015 at 8:12 PM Updated at 11:04 PM Posted Oct. 8, 2015 at 8:12 PM Updated at 11:04 PM Ausanio: Mets' rotation deeper \nPitching is the key to the Mets-Dodgers series, says former Yankee big-leaguer and Mets farmhand Joe Ausanio. Jeurys Familia is the best closer in baseball, Ausanio said, and that’s why he... » Read more X Ausanio: Mets' rotation deeper \nPitching is the key to the Mets-Dodgers series, says former Yankee big-leaguer and Mets farmhand Joe Ausanio. Jeurys Familia is the best closer in baseball, Ausanio said, and that’s why he gives the Mets a slight edge to win the N.L. division series. \n\"You have two teams with incredible pitching,’’ Ausanio said. \"I think the Mets pitching is a little bit deeper. I think the Mets could potentially have a better starting rotation from top to bottom.’’ \nAusanio, who works with the Hudson Valley Renegades and is the Marist softball head coach, said he would not be surprised if 10 total runs are scored in those opening three games when Jacob deGrom battles Clayton Kershaw, Noah Syndergaard faces Zack Greinke and Matt Harvey duels with Brett Anderson. \n\"With Greinke and Kershaw, (the Mets) are going to have to score and find a way to do it,’’ he said. \"Terry Collins might have to play more small-ball than he usually does to get guys in scoring position and get the big hit when they need it. Timely hitting will be key for the Mets.’’ \nDeGrom would be Ausanio’s first choice if he were drafting a team. \"To me, he is absolutely nasty and has great command with multiple pitches,’’ he said. \"I won’t buy into Syndergaard folding under pressure; he has pitched in big games down the stretch.’’ \nAs for Kershaw having a poor playoff record, Ausanio said, \"His stuff is still unbelievable. You still have to hit a round ball with a round bat. He’s got great stuff.’’ \nKen McMillan \nTelgheder: Mets will take series \nDave Telgheder grew up a Mets fan and lived his dream of pitching for them as well. So Telgheder is pretty excited about seeing his team in the playoffs for the first time since 2006. \n\"It will be good,’’ said Telgheder, an assistant principal at Minisink Valley High School. \"The Mets' pitching will carry them through.’’ \nTelgheder believes the Mets' offense has come around despite the final-week woes, and should be enough to get them past the Dodgers. \n\"They are getting it all together,’’ he said. \"Basically in the playoffs, it’s pitching and defense first, and then you scrape some runs together.’’ \nHome-field advantage is not what it once was, Telgheder said, so he’s not too concerned that the Dodgers have the extra home game. \nTelgheder was drafted in 1989 and pitched with the Mets from 1993-95 before being traded to Oakland. This summer he coached his son’s Little League team and 13-under travel team. \nKen McMillan \n» Social News Kingston native Mike Groppuso, a former first-round draft pick of the Houston Astros, favors the St. Louis Cardinals to win the World Series and wants the Chicago Cubs to take it, but thinks the Mets should feel confident. The Kingston High baseball coach especially likes the Mets’ chances against the Los Angeles Dodgers in the NLDS, a best-of-five series starting on Friday. “If (starting pitchers Noah) Syndergaard, (Matt) Harvey and (Jacob) deGrom pitch their games, they’re going to be in the game,” said Groppuso, who played in Houston’s and Milwaukee’s farm systems from 1991-99. “They’re going to allow their team to win a game in the last two, three innings.” DeGrom pitches Game 1 on Friday against Clayton Kershaw, who recorded a 2.13 ERA and 301 strikeouts this season. The Mets face Zach Greinke, a Cy Young candidate with a 1.66 ERA, in Game 2 on Saturday. The Mets will have an easier time getting through that one-two punch on the road if Kershaw’s postseason struggles continue. Kershaw’s postseason ERA exceeded six in his last two playoff runs. New York’s top-three starters lack playoff experience. When it comes to struggling postseason pitchers and starters with no postseason innings, Groppuso sees no advantage for either side. “I wouldn’t want to face any of them,” he said. “Any manager will tell you that. They’re phenomenal pitchers. They have tremendous talent. Matt Harvey can pitch with the best of them. He has Kershaw stuff.” Groppuso repeatedly mentioned the playoffs’ unpredictability. The Astros’ wild-card win over the Yankees is further evidence. Astros starting pitcher Dallas Keuchel had never pitched on three days’ rest, but blanked the Yanks in six three-hit innings in his playoff starting debut. Groppuso considers the Cardinals the only obvious World Series favorite. He also thinks the Cubs have a great shot. He doesn’t doubt the Mets’ chances, however. “I don’t think they have any concerns,” Groppuso said. “You’re one of the best teams in baseball. You have your weaknesses. You just hope you can overcome any mistake and, with a little luck on your side, finish on the right side.” jbakan@th-record.com", "external_links": [], "published": "2015-10-09T07:04:00.000+03:00", "crawled": "2015-10-09T10:49:52.638+03:00", "highlightTitle": ""}