{"organizations": [], "uuid": "55d1d3f6c7e51072f1762f9cc1045b64d42b3020", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kctv5.com", "main_image": "http://images.worldnow.com/AP/images/8973926_G.jpg", "site_section": "http://kctv5.com/category/208603/sports?clienttype=rss", "section_title": "KCTV Kansas City - Sports", "url": "http://www.kctv5.com/story/30217860/former-nfl-coach-lindy-infante-dies-at-75", "country": "US", "title": "Former NFL coach Lindy Infante dies at 75", "performance_score": 0, "site": "kctv5.com", "participants_count": 1, "title_full": "Former NFL coach Lindy Infante dies at 75 - KCTV5", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "55d1d3f6c7e51072f1762f9cc1045b64d42b3020"}, "author": "cbs8", "url": "http://www.kctv5.com/story/30217860/former-nfl-coach-lindy-infante-dies-at-75", "ord_in_thread": 0, "title": "Former NFL coach Lindy Infante dies at 75", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By TERRY SPENCER and GENARO C. ARMAS\nAssociated Press MIAMI (AP) - Lindy Infante, the hard-luck former coach of the Green Bay Packers and the Indianapolis Colts, died Thursday. He was 75.\nInfante's wife, Stephanie, told The Associated Press that he died in St. Augustine after a lengthy illness.\nInfante was a head coach for six years in the NFL, compiling a 36-60 record. He was the NFL Coach of the Year in 1989 with Green Bay, but his only postseason appearance came in 1996 when his Colts lost a wild card game to Pittsburgh, 42-14.\n\"He was the consummate father, husband & coach,\" Michigan coach Jim Harbaugh said on Twitter.\nHarbaugh was the Colts' starting quarterback in 1996. The next year, the Colts finished 3-13 and Infante was out of a job after two seasons with a 12-20 record. Indianapolis drafted quarterback Peyton Manning the following offseason.\nThere was bad timing at Infante's first head-coaching stop in Green Bay, too. He went 24-40 from 1988-91. After the Packers finished 4-12 in his final season, the team overhauled its front office, and the following year general manager Ron Wolf acquired Brett Favre from the Atlanta Falcons. The Packers reasserted themselves as one of the league's top teams.\nThe organization hailed the Infantes for their presence in the community. Packers President Mark Murphy also credited the Infante-led team in 1989 with rekindling enthusiasm in the fan base following a 10-6 season.\n\"For a franchise that had been struggling for so long to find a winning way, the emergence of that team under Lindy as new coach and (Don) Majkowski as its quarterback gave us great promise for the future,\" said Murphy's predecessor, Bob Harlan. \"It brought back a great deal of excitement in the community we hadn't felt for a long time.\"\nSafety LeRoy Butler, a mainstay of the Packers defenses in the 1990s, expressed his condolences on Twitter.\n\"He is the one that convinced the Packers to draft me in 1990 - 'we must have this guy,'\" Butler wrote.\nInfante got the job in Green Bay after Michigan State coach George Perles initially accepted, then backed out. Infante also had stints as offensive coordinator for the Cincinnati Bengals (1982) and Cleveland Browns (1986-87). He was known as a shrewd play-caller while with the Browns, with Bernie Kosar at quarterback.\nInfante coached the Jacksonville Bulls of the USFL in 1984 and 1985. He played college football at Florida from 1960 to 1962.\n___\nArmas reported from Milwaukee.\n___\nOnline:\nAP NFL website: www.pro32.ap.org and http://twitter.com/AP_NFL \nCopyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-09T01:43:15.116+03:00", "highlightTitle": ""}