{"organizations": [], "uuid": "f06dfb1e3a6a62ab36c319ec7f41267059e0172d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www2.ljworld.com", "main_image": "http://worldonline.media.clients.ellingtoncms.com/static/ljworld.com/images/ljw-logo-1200.jpg", "site_section": "http://www2.ljworld.com/rss/headlines/sports/", "section_title": "LJWorld.com stories: Sports", "url": "http://www2.ljworld.com/news/2015/oct/03/kansas-soccer-falls-texas-sees-streak-end/", "country": "US", "title": "Kansas soccer falls to Texas, sees streak end", "performance_score": 0, "site": "ljworld.com", "participants_count": 1, "title_full": "Kansas soccer falls to Texas, sees streak end", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T08:00:00.000+03:00", "replies_count": 0, "uuid": "f06dfb1e3a6a62ab36c319ec7f41267059e0172d"}, "author": "Gary Bedore", "url": "http://www2.ljworld.com/news/2015/oct/03/kansas-soccer-falls-texas-sees-streak-end/", "ord_in_thread": 0, "title": "Kansas soccer falls to Texas, sees streak end", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Gary Bedore — Lawrence Journal-World October 3, 2015 \nAdvertisement \nKansas University’s soccer team, which had scored seven goals in winning three straight games to close the nonconference season, opened Big 12 play with a 2-1 loss to Texas on Friday night at Rock Chalk Park. \n“I think we thought we were kind of on the rise there and, honestly, it showed in our play. I think we did really well. We are kind of at the top of our game,” said KU freshman midfielder Grace Hagan, who scored the Jayhawks’ lone goal with 10:13 to play. \n“We just need to work on finishing and staying strong during set pieces. It’s a little bit of a setback,” she added after KU fell to 5-5-1 to UT’s 4-3-3 mark. “I think we are still ready to go through and push forward in the Big 12.” \nCoach Mark Francis — he lamented the fact 80 percent of the goals scored against KU this season have been on set pieces — was equally positive after the league opener contested before 1,074 fans. \n“We keep playing like that, we’re going to win more games than we lose in the Big 12, that’s for sure,” Francis said after his Jayhawks out-shot Texas, 13-11. UT had four saves and KU three. “We’ve got to bounce back and be ready to go Sunday (at Iowa State).” \nTexas scored its two goals in a five-minute span in the second half. \n“Really disappointed. I thought we were by far the better team, created the better chances,” Francis said. “I thought defensively we did a great job all over the field. We battled really hard. In the run of play, we’re doing some tremendous stuff. We’re a very good soccer team. We’re creating a lot of good chances. It comes down to our game (stinks) sometimes because you can make two mistakes on a set piece and lose a game, 2-1, which is what happened tonight.” \nNoted Wichita Kapaun grad Hagan, whose three goals tie her for the team lead with Liana Salazar: “We just let up a little on the first goal (by Olivia Brook) and it happened to go in the back of the net. We tried to come back at ’em and they get a second one (by Lindsey Meyer). That’s tough to come back from, but having the team we have, we were able to get another goal in and come at ’em for the last 10 minutes at least.”", "external_links": [], "published": "2015-10-03T08:00:00.000+03:00", "crawled": "2015-10-03T11:58:18.639+03:00", "highlightTitle": ""}