{"organizations": [], "uuid": "19f443dcf8c1227f0a13d1f2ff75d2597f42fe85", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ocregister.com", "main_image": "http://images.onset.freedom.com/ocregister/gallery/nvtyg0-b88532822z.120151006201401000g35cehu2.10.jpg", "site_section": "http://ocregister.com//common/rss/rss.php?catID=18969", "section_title": "The Orange County Register - News Headlines : Sports Columns", "url": "http://www.ocregister.com/articles/season-686414-angels-home.html", "country": "US", "title": "Fryer: Angels' Mike Scioscia should be praised for a job well done in 2015", "performance_score": 0, "site": "ocregister.com", "participants_count": 0, "title_full": "Fryer: Angels' Mike Scioscia should be praised for a job well done in 2015 - The Orange County Register", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "19f443dcf8c1227f0a13d1f2ff75d2597f42fe85"}, "author": "", "url": "http://www.ocregister.com/articles/season-686414-angels-home.html", "ord_in_thread": 0, "title": "Fryer: Angels' Mike Scioscia should be praised for a job well done in 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mike Scioscia"], "text": "What in the wide, wide world of sports is going on here … \n• The 2015 season was Mike Scioscia’s best as Angels manager.\n• Calm down. Examine the evidence. This team was not eliminated until the final day of the season despite a mountain of challenges.\n• Starting pitching is the most important part of baseball. The Angels began the ’15 season without 2014’s best starter, Garrett Richards , still rehabbing from knee surgery; opening-day starter Jered Weaver missed more than a month with a hip issue; Tyler Skaggs missed the entire season; C.J. Wilson missed all of August and September; Matt Shoemaker was sent to the minors to fix himself; and Hector Santiago had a poor second half.\n• Second baseman Johnny Giavotella missed a month. So did third baseman David Freese . Left fielder Matt Joyce was close to useless, and catcher Chris Iannetta batted .188.\n• And how is it that a reserve infielder like Taylor Featherston , batting .162, is a poor bunter?\n• There also was the whole Josh Hamilton junk. The departure of General Manager Jerry Dipoto, well, that sort of thing doesn’t happen often during the season to teams headed for the World Series.\n• When you’re dealing with all of these issues and subpar performances, the manager has to out-chess match the other manager to help keep the team in contention. Scioscia did that.\n• Anticipating the “we could have had Joe Maddon” talk – sure, he’s a terrific manager. But Maddon’s Chicago Cubs roster is far superior to Scioscia’s Angels roster.\n• Cubs third baseman Kris Bryant, age 23, hit 26 home runs with 99 RBI. First baseman Anthony Rizzo drove in 101 runs, and catcher Miguel Montero hit 15 home runs. Jake Arrieta was 22-6 with a 1.77 ERA, pitcher Jon Lester gave them 205 innings and 207 strikeouts, and their pitchers outside of their five-man rotation were 18-11.\n• If Scioscia has those guys, he’s still managing in a game this weekend.\n• By the way, talking about out-chess matching … seven of the Angels’ final eight wins were by one run. That’s clutch stuff, and not just from the manager but from a bunch of resolute players.\n• Angels first baseman/designated hitter Albert Pujols drove in 95 runs, making this the 14th time in his 15-year career he had has 90 or more RBI. The only others with at least 14 seasons with 90 or more RBI: Hank Aaron (16 seasons), Babe Ruth (14) and Alex Rodriguez (14).\n• Mike Trout made zero errors in 156 games in the outfield. Only two other outfielders in Angels history played 120 or more errorless games in a season: Torii Hunter (2008) and Brian Downing (1982 and ’84).\n• Trout was named team MVP for the fourth time. Two others have won it four times: Bobby Knoop and Garret Anderson.\n• Trout, who just completed his fifth season, already is No. 7 in Angels history in games played as an outfielder with 627. A healthy 2016 would move him to third, ahead of Downing (722), Darin Erstad (708), Hunter (666) and Jim Edmonds (654). Anderson is first at 1,755, followed by Tim Salmon at 1,267.\n• The Angels had 52 stolen bases this season, led by Erick Aybar ’s 15. Trout had 11, since you’re wondering. Generally, Scioscia’s Angels teams have more than 100 steals, but this was not a swift roster.\n• Next season is the 50th anniversary of Angel Stadium. Expect promotions offering gold caps, gold coffee mugs, gold rally monkeys etc.\n• For the 50th anniversary, bring back the “CA” caps with the halos for the home opener and maybe for select dates like Sundays. But make the halos gold instead of the silver they used to be.\n• The Dodgers are tough at home. They went 55-26 at Dodger Stadium for a winning percentage of .679, their highest at Chavez Ravine and their best home winning percentage since the Brooklyn Dodgers were 56-22 (.718) at Ebbets Field in 1946.\n• Clayton Kershaw is tough at home. In 127 regular-season career starts at Dodger Stadium, Kershaw is 63-28 with a 2.07 ERA and opposing teams are batting .200 against him there. He gets the start in Friday’s NLDS opener against the New York Mets at Dodger Stadium.\n• Ticketmaster still had plenty of seats available Tuesday afternoon for the Ducks’ home opener Monday against Vancouver.\n• NFL quarterbacks sacked the most times so far this season: Alex Smith, Kansas City, 18; Russell Wilson, Seattle, 16.\n• The Miami Dolphins had one coach from 1970-95, Don Shula. They have had nine coaches since then.\n• UCLA linebacker Myles Jack should have stayed in school. His current résumé is too light on achievements if he wants to be taken seriously by NFL teams.\n• Ohio State’s football team is undefeated, although the Buckeyes’ team quarterback rating is a dismal 40.7.\n• Golden West College’s 24-17 win over Fullerton on Saturday pushed the Rustlers up from No. 4 to No. 3 in the community college state football rankings. The Rustlers are 5-0. Also in the state top 25 are Saddleback (3-2) at No. 17 and Fullerton (2-3) at No. 24.\n• Golden West’s Quest Truxton was named Southern California Football Association all-purpose player of the week. He had 132 yards receiving, 54 yards rushing and 19 return yards in the Rustlers’ win over Fullerton.\n• For the first time since July of 2009, the NFL in September went a full month without a player getting arrested. Finally, something that we can … hold on … just a minute …\n• Nope. Tennessee Titans receiver Dorial Green-Beckham was arrested on the final day of September for not paying a speeding ticket. Dang. So close.\nContact the writer: sfryer@ocregister.com", "external_links": [], "published": "2015-10-06T03:00:00.000+03:00", "crawled": "2015-10-07T07:12:24.217+03:00", "highlightTitle": ""}