{"organizations": [], "uuid": "ac490da0bfca5778941f7a4a2dea9e3810bf2f4e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbssports.com", "main_image": "http://sports.cbsimg.net/images/visual/whatshot/640Bradford102315.jpg", "site_section": "http://www.cbssports.com/partners/feeds/rss/home_news", "section_title": "Sports News : CBSSports.com", "url": "http://www.cbssports.com/nfl/writer/jason-la-canfora/25351280/eagles-unlikely-to-recoup-pick-from-rams-as-final-terms-of-bradford-deal-near-completion", "country": "US", "title": "Eagles unlikely to recoup pick from Rams from Sam Bradford trade", "performance_score": 0, "site": "cbssports.com", "participants_count": 1, "title_full": "Eagles unlikely to recoup pick from Rams from Sam Bradford trade - CBSSports.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T14:00:00.000+02:00", "replies_count": 0, "uuid": "ac490da0bfca5778941f7a4a2dea9e3810bf2f4e"}, "author": "Jason La Canfora", "url": "http://www.cbssports.com/nfl/writer/jason-la-canfora/25351280/eagles-unlikely-to-recoup-pick-from-rams-as-final-terms-of-bradford-deal-near-completion", "ord_in_thread": 0, "title": "Eagles unlikely to recoup pick from Rams from Sam Bradford trade", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The final compensation terms of the Eagles' acquisition of Sam Bradford from the Rams are closing in, and Philadelphia's window to recoup an additional draft pick is nearly closed. As part of the trade, culminated in March, the Eagles had the ability to garner a 2016 selection under certain conditions, which the teams did not release.\n\nThe latest from SportsLine Week 7 NFL Picks \n\nSources said the conditions of that deal involved only Bradford's playing time, and nothing related to his performance, and once he reaches 50 percent of the Eagles' snaps, Philadelphia will receive no pick. If Bradford plays less than 50 percent of the team's snaps, the Eagles would get a fourth-round pick; if he would have played no snaps the Eagles would have received a third-round pick. Bradford was still recovering from another ACL surgery at the time of the trade.\nWith the Eagles nearing the midpoint of their season Bradford is clearly approaching the amount of playing time necessary to close out those trade terms and coach Chip Kelly, who also controls all of Philadelphia's personnel moves, has remained staunchly behind him and will not entertain sitting the veteran despite his considerable struggles. The Eagles already have to surrender their second-round pick in 2016 as part of the deal, which cost them quarterback Nick Foles and last year's fourth-round pick (Philadelphia also received a fifth-round pick last year in the deal).\nSources on both sides of the trade said the component of a 2016 pick potentially going to the Eagles was done solely as a precautionary mechanism should Bradford's knee impact his ability to play, or play regularly, in 2015 and was intended as a measure of his production. In fact, it is a concept discussed briefly between the Rams and other interested teams last winter -- like the Browns -- sources said, and was something they expected to include in any deal given Bradford's health history. Talks with other teams never advanced nearly as far as the did with the Eagles however, with Kelly displaying the strongest desire to land the former first-overall pick.\nWith Bradford ranked among the worst quarterbacks in the NFL this season, and looking hesitant and overwhelmed at times, the Eagles could protect a future pick by going to Mark Sanchez , but barring an injury Bradford will achieve the thresholds to negate that prospect. At one point Kelly was open to a contract extension with Bradford as well -- Philadelphia gave up this much in trade despite only having Bradford's rights for one season -- but sources said those talks did not advance into a deep negotiating stage and were largely philosophical with Bradford's agent, Tom Condon, open to a short-term extension but the sides never getting deep into finances.\nGiven how this season has gone, that may end up being a blessing for the Eagles (and St. Louis might regret the nominal extension it reached with Foles, who has been poor as well), though the Rams still stand to reap a potential impact player from their final pick to come for Bradford while getting to keep all their picks as well. Sam Bradford is expected to clear playing-time conditions involved in his offseason trade. (USATSI) Topics: Mark Sanchez , Nick Foles , Sam Bradford , Cleveland Browns , Philadelphia Eagles , St. Louis Rams , NFL About Jason La Canfora Follow on Twitter", "external_links": [], "published": "2015-10-25T14:00:00.000+02:00", "crawled": "2015-10-25T14:55:25.673+02:00", "highlightTitle": ""}