{"organizations": [], "uuid": "abb213727d6e35e3cb9e56cfa6983a2eb7c31286", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "amestrib.com", "main_image": "http://amestrib.com/sites/amestrib.com/files/field/media/web1_10-23-BAL-XCG-Kohut-Jackson-2.jpg", "site_section": "http://amestrib.com/taxonomy/term/3/feed", "section_title": "Sports", "url": "http://amestrib.com/sports/cross-country-ballard-s-kohut-jackson-wins-3a-state-qualifying-meet", "country": "US", "title": "Cross-Country: Ballard’s Kohut-Jackson wins 3A state-qualifying meet", "performance_score": 0, "site": "amestrib.com", "participants_count": 0, "title_full": "Cross-Country: Ballard’s Kohut-Jackson wins 3A state-qualifying meet", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T06:47:00.000+03:00", "replies_count": 0, "uuid": "abb213727d6e35e3cb9e56cfa6983a2eb7c31286"}, "author": "", "url": "http://amestrib.com/sports/cross-country-ballard-s-kohut-jackson-wins-3a-state-qualifying-meet", "ord_in_thread": 0, "title": "Cross-Country: Ballard’s Kohut-Jackson wins 3A state-qualifying meet", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kohut-Jackson", "Ballard"], "text": "Cross-Country: Ballard’s Kohut-Jackson wins 3A state-qualifying meet Cross-Country: Ballard’s Kohut-Jackson wins 3A state-qualifying meet \nBallard's Abby Kohut-Jackson won the 3A girls' state-qualifying meet at the Iowa State cross country course on Thursday. Photo by Nirmalendu Majumdar/Ames Tribune Cross-Country: Ballard’s Kohut-Jackson wins 3A state-qualifying meet \nGilbert's Jason Taylor placed 10th at the Class 3A boys' state-qualifying meet at the Iowa State cross country course on Thursday. Photo by Nirmalendu Majumdar/Ames Tribune Cross-Country: Ballard’s Kohut-Jackson wins 3A state-qualifying meet \nGilbert's Carly Rahn took 14th at the Class 3A girls' state-qualifying meet at the Iowa State cross country course on Thursday. Photo by Nirmalendu Majumdar/Ames Tribune Cross-Country: Ballard’s Kohut-Jackson wins 3A state-qualifying meet \nNevada's Conner MacVey finished 15th at the Class 3A boys' state cross country meet at the Iowa State cross counry course on Thursday. Photo by Nirmalendu Majumdar/Ames Tribune Cross-Country: Ballard’s Kohut-Jackson wins 3A state-qualifying meet \nBallard's Abby Kohut-Jackson won the 3A girls' state-qualifying meet at the Iowa State cross country course on Thursday. Photo by Nirmalendu Majumdar/Ames Tribune By Travis Hines thines@amestrib.com \nThere wasn’t much thought put in for exactly how Abby Kohut-Jackson was going to attack the Iowa State cross-country course at Thursday’s girls’ Class 3A state-qualifying meet. The result was really the only thing on her mind, and she met that goal. \nThe Ballard senior ran a time of 19 minutes, 27.40 seconds to take first place and help the Bombers advance by placing third with 109 points. \n“The whole team is excited to run at state,” Kohut-Jackson said. \nIt won’t be a new experience for either Kohut-Jackson, or her team. She took second and the team placed seventh at state a year ago. \nTo get back, Ballard defeated Newton on a sixth-racer tiebreaker, courtesy of Nicole Watters’ 34th-place finish in 22:38.60. Ballard’s Abby Catus finished 23rd in 21:44.42, Summer McVicker 24th in 21:44.97, Ashley Meldrum 28th in 22:00.85 and Anna Zielke 36th in 22:41:50. \nKohut-Jackson’s plan that eventually bested the field by nearly 30 seconds wasn’t an overly complicated one. \n“I really just wanted to run a solid race, qualify and bring the team along,” she said. \n“There really wasn’t too much strategy.” \nKohut-Jackson, Class 3A’s top-ranked runner, is going through an atypical senior season as a summer foot injury kept her out of a number of meets. \n“It’s been a little weird missing some races,” Kohut-Jackson said. \nNow, though, Kohut-Jackson is right where she wants to be, in position to win a state championship. \n“I’m going to work on the mental things,” she said. “Sometimes I can get down on myself, but if I stay strong, I’ll be fine.” \nPella was the team champion with 58 points while Gilbert also qualified with a second-place score of 80. \n“From every race you run,” Gilbert coach Laura Kautman said, “you learn a lesson. We’ll take some things from this race that will make us successful next Saturday.” \nThe Tigers were led by a second-place finish from Emily Branson, who clocked in at 20:04.17. \n“She ran the race of her short cross-country career,” Kautman said of her first-year runner. “She ran really, really well today.” \nMaggie Pollard finished in 13th for Gilbert with a time of 20:43.05 while teammate Carly Rahn right behind in 14th and a time of 20:43.48. Justine Rosburg was 25th in 21:51.85 and Kenzie Miller 26th in 21:55.95 for the Tigers, who placed second at the state meet a year ago. \n“We’re going to set goals for Saturday,” Kautman said, “and we’ve got to go execute. I know the girls want to find themselves on the (award presentation) deck again this year,” \nThe Gilbert boys also will be making the trip to Fort Dodge for the state meet as the Tigers finished third with 95 points, five fewer than fourth-place Carlisle. \nJason Taylor led the Tigers with a time of 17:31.93, good for 10th place. \n“I ran well,” he said. “I wish, though, I could have caught up to the lead pack. \n“My plan was to really kick the last two miles. I felt like I was really moving in the last two miles.” \nGilbert’s Owen Whitham was 14th with a time of 17:38.54 while John Ockey was 22nd in 17:53.77, Ethan Mesenbrink 23rd in 17:54.52 and Zane Miller 26th in 18:01.58. \nTaylor already has his sights set on what he wants to accomplish next weekend. \n“I think top-25 would be a good goal,” he said, “but I really just want to run my best.” \nNevada finished seventh in the team standings with a score of 201, but the Cubs will be represented at state by Conner MacVey, who placed 15th with a time of 17:39.43 to qualify. \nThe Class 3A portion of the state meet at Ford Dodge’s Lakeside Municipal Golf Course begins at noon. \nGirls Division \nTeam standings \n1. Pella 58, 2. Gilbert 80, 3. Ballard 109, 4. Newton 109, 5. Grinnell 139, 6. Iowa Falls-Aden/AGSWR 192, 7. Madrid 215, 8. South Tama 229, 9. Boone 232, 10. Carlisle 248, 11. Knoxville 278, 12. Nevada 286, 13. Bondurant-Farrar 311 \nBoys Division \nTeam standings \n1. Pella 53, 2. Grinnell 57, 3. Gilbert 95, 4. Carlisle 100, 5. Madrid 156, 6. Bondurant-Farrar 166, 7. Nevada 201, 8. Ballard 229, 9. South Tama 248, 10. Iowa Falls-Aden/AGWSR 280, 11. Newton 289, 12. Knoxville 291, 13. Boone 325 Rules for posting comments \nComments posted below are from readers. In no way do they represent the view of Stephens Media LLC or this newspaper. This is a public forum. \nComments may be monitored for inappropriate content but the newspaper is under no obligation to do so. Comment posters are solely responsible under the Communications Decency Act for comments posted on this Web site. Stephens Media LLC is not liable for messages from third parties. \nIP and email addresses of persons who post are not treated as confidential records and will be disclosed in response to valid legal process. \nDo not post: Potentially libelous statements or damaging innuendo. Obscene, explicit, or racist language. Copyrighted materials of any sort without the express permission of the copyright holder. Personal attacks, insults or threats. The use of another person's real name to disguise your identity.", "external_links": [], "published": "2015-10-23T06:47:00.000+03:00", "crawled": "2015-10-23T07:45:40.137+03:00", "highlightTitle": ""}