{"organizations": [], "uuid": "aaac6120700c7bd1c31bad822e5e6c6b51e6e710", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.winnipegfreepress.com", "main_image": "http://media.winnipegfreepress.com/images/304*432/NY166-611_2015_213036_high.jpg", "site_section": "http://www.winnipegfreepress.com/rss/?path=/sports", "section_title": "Winnipeg Free Press: Sports", "url": "http://www.winnipegfreepress.com/sports/lebron-james-says-teammate-tristan-thompsons-contract-situation-with-cavs-is-distraction-330577681.html", "country": "US", "title": "LeBron James says teammate Tristan Thompson's contract situation with Cavs is 'distraction'", "performance_score": 0, "site": "winnipegfreepress.com", "participants_count": 1, "title_full": "LeBron James says teammate Tristan Thompson's contract situation with Cavs is 'distraction' - Winnipeg Free Press", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T17:17:00.000+03:00", "replies_count": 0, "uuid": "aaac6120700c7bd1c31bad822e5e6c6b51e6e710"}, "author": "Tom Withers, The Associated Press", "url": "http://www.winnipegfreepress.com/sports/lebron-james-says-teammate-tristan-thompsons-contract-situation-with-cavs-is-distraction-330577681.html", "ord_in_thread": 0, "title": "LeBron James says teammate Tristan Thompson's contract situation with Cavs is 'distraction'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CLEVELAND - LeBron James was done talking about Tristan Thompson's contract situation. Then he saw his teammate at a wedding Saturday and changed his mind.\nIn his most candid comments yet, James called Thompson's stalemate with the Cavaliers \"a distraction\" on Sunday and urged both sides to get a deal done.\n\nFILE - In this June 11, 2015, file photo, Cleveland Cavaliers center Tristan Thompson (13) grabs a rebound over Golden State Warriors forward Harrison Barnes (40) during the first half of Game 4 of basketball's NBA Finals in Cleveland. Thompson has taken his contract standoff with the Cavaliers to another level. The backup power forward declined to sign a one-year, $6.8 million qualifying offer for this season and remains a restricted free agent. If he doesn't show at practice Friday, Oct. 3, 2015, he'll be considered a holdout. (AP Photo/Tony Dejak, File) \n\"The last thing you need is a distraction when you try to make a championship run. And we have that right now,\" James said after practice at the team's facility in Independence, Ohio. \"It's unfortunate for both sides that we're going through it right now as a team.\"\nThompson, who played a major role in Cleveland's run to the NBA Finals last season, has not reported to training camp as he remains in a holdout for a long-term deal. His agent, Rich Paul, and the Cavs have not been able to reach an agreement over the past few months.\nWhile at a wedding in Miami, James posed for a photo with Thompson that he posted on social media with the caption, \"Get it done!!!! Straight up. #MissMyBrother.\"\nThe four-time MVP denied the message was aimed at the negotiations between the Cavs and Paul, who also represents James.\n\"I'm not going to go to them and tell them what they should do,\" James said. \"That's their job. They know how to do it very well, and they've done that to this point. They've brought in and did what they had to do for us to be a contending team. Tristan is a big part of that run we want to make. I believe that something will happen.\"\nThompson, from Brampton, Ont., remains a restricted free agent and can receive offers from other teams.\nThe Cavs went through a similar situation in 2007 with centre Anderson Varejao, who sat out Cleveland's first 21 games before Charlotte signed him to an offer sheet that was matched by Cleveland.\nThompson made 15 starts in the playoffs last season after Kevin Love dislocated his shoulder in the first round against Boston.\n ", "external_links": [], "published": "2015-10-04T17:17:00.000+03:00", "crawled": "2015-10-05T02:23:49.400+03:00", "highlightTitle": ""}