{"organizations": [], "uuid": "8c0aaddac68df0d2a02aad9d8b44614fafbe024a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fox8live.com", "main_image": "http://WVUE.images.worldnow.com/images/8926488_G.jpg", "site_section": "http://www.fox8live.com/", "section_title": "New Orleans News, Weather, Saints - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "url": "http://www.fox8live.com/story/30168597/public-safety-issues-to-be-discussed-at-french-quarter-meeting", "country": "US", "title": "Public safety issues to be discussed at French Quarter meeting", "performance_score": 0, "site": "fox8live.com", "participants_count": 1, "title_full": "Public safety issues to be discussed at French Quarter meeting - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T07:25:00.000+03:00", "replies_count": 0, "uuid": "8c0aaddac68df0d2a02aad9d8b44614fafbe024a"}, "author": "Written by: FOX8Live.com Staff", "url": "http://www.fox8live.com/story/30168597/public-safety-issues-to-be-discussed-at-french-quarter-meeting", "ord_in_thread": 0, "title": "Public safety issues to be discussed at French Quarter meeting", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW ORLEANS, LA (WVUE) - The City of New Orleans will host a public information meeting on Oct. 6 to inform French Quarter residents about a measure on the Oct. 24 ballot that aims to provide long-term funding for State Police and other public safety services in the French Quarter.\nRepresentatives of the Mayor's office, New Orleans Police Department and Louisiana State Police will be on hand to answer questions.\nOn Oct. 24, French Quarter area residents will have the opportunity to vote on a proposed Economic Development District (EDD) to enhance public safety for the area.\nShould voters approve the measure, the sales tax on goods and services (excluding hotel stays) sold in the proposed district will increase 0.2495%, which equates to an additional quarter for every $100.\nThe sales tax is expected to generate approximately $2 million annually and would help fund Louisiana State Police troopers and other public safety measures throughout the French Quarter.\nThese funds would be generated overwhelmingly by tourists.\nThere would be a five-year sunset provision on the tax, with the option for renewal pending voter approval at expiration.\nThe boundaries of the EDD would match those of the French Quarter Management District, which are the Mississippi River; the center line of Canal Street; the rear property line of properties fronting on the lake side of North Rampart Street; and both sides of Esplanade Avenue.\nThe $2 million in proceeds of the Economic Development District, if passed by the voters in the district, would be matched by long-term commitments in funding from hospitality organizations to create a pool of at least $4.5 million to fund enhanced public safety efforts by the Louisiana State Police.\nThe Oct. 6 meeting will be held at 6 p.m. at the Omni Royal Orleans in the Grand Salon.\nThe hotel is located at 621 St. Louis Street.\nCopyright 2015 WVUE. ", "external_links": [], "published": "2015-10-02T07:25:00.000+03:00", "crawled": "2015-10-02T08:41:08.917+03:00", "highlightTitle": ""}