{"organizations": [], "uuid": "8aa7f650114a5541848ed4177d88bba4ab497dd7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.beaumontenterprise.com", "main_image": "http://ww3.hdnux.com/photos/41/23/61/8731770/7/rawImage.jpg", "site_section": "http://www.beaumontenterprise.com/sports/hs/collectionRss/Sports-HS-Heds-8127.php", "section_title": "Sports HS Heds", "url": "http://www.beaumontenterprise.com/sports/hs/article/Mustangs-maul-Newton-48-6-6547671.php", "country": "US", "title": "Mustangs maul Newton 48-6", "performance_score": 0, "site": "beaumontenterprise.com", "participants_count": 1, "title_full": "Mustangs maul Newton 48-6", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T16:10:00.000+03:00", "replies_count": 0, "uuid": "8aa7f650114a5541848ed4177d88bba4ab497dd7"}, "author": "David Thompson", "url": "http://www.beaumontenterprise.com/sports/hs/article/Mustangs-maul-Newton-48-6-6547671.php", "ord_in_thread": 0, "title": "Mustangs maul Newton 48-6", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published 8:11 am, Saturday, October 3, 2015 Image 1 of / 18 Close Image 1 of 18 \nRufus Joseph, 81, makes the touchdown catch just before halftime during the game between the WO-S Mustangs and the Newton Eagles at Dan R. Hooks Stadium in Orange, Friday night October 2nd, 2015 - Photo provided by Kyle Ezell. Rufus Joseph, 81, makes the touchdown catch just before halftime... Image 2 of 18 \nMelech Edwards, 20, runs for a first half touchdown during the game between the WO-S Mustangs and the Newton Eagles at Dan R. Hooks Stadium in Orange, Friday night October 2nd, 2015 - Photo provided by Kyle Ezell Melech Edwards, 20, runs for a first half touchdown during the game... Image 3 of 18 \nBrock Barbay, 3, passes the ball during the game between the WO-S Mustangs and the Newton Eagles at Dan R. Hooks Stadium in Orange, Friday night October 2nd, 2015 - Photo provided by Kyle Ezell Brock Barbay, 3, passes the ball during the game between the WO-S... Image 4 of 18 \nJack Dallas, 3, studies the defense reaction during the game between the WO-S Mustangs and the Newton Eagles at Dan R. Hooks Stadium in Orange, Friday night October 2nd, 2015 - Photo provided by Kyle Ezell Jack Dallas, 3, studies the defense reaction during the game... Image 5 of 18 \nJack Dallas, 3, passes the ball during the game between the WO-S Mustangs and the Newton Eagles at Dan R. Hooks Stadium in Orange, Friday night October 2nd, 2015 - Photo provided by Kyle Ezell Jack Dallas, 3, passes the ball during the game between the WO-S... Image 6 of 18 \nJack Dallas, 3, runs the ball during the game between the WO-S Mustangs and the Newton Eagles at Dan R. Hooks Stadium in Orange, Friday night October 2nd, 2015 - Photo provided by Kyle Ezell Jack Dallas, 3, runs the ball during the game between the WO-S... Image 7 of 18 \nNewton enters the field before the game between the WO-S Mustangs and the Newton Eagles at Dan R. Hooks Stadium in Orange, Friday night October 2nd, 2015 - Photo provided by Kyle Ezell Newton enters the field before the game between the WO-S Mustangs... Image 8 of 18 \nWO-S team prayer before the game between the WO-S Mustangs and the Newton Eagles at Dan R. Hooks Stadium in Orange, Friday night October 2nd, 2015 - Photo provided by Kyle Ezell WO-S team prayer before the game between the WO-S Mustangs and the... Image 9 of 18 \nTeam Captains meet for the coin toss before the game between the WO-S Mustangs and the Newton Eagles at Dan R. Hooks Stadium in Orange, Friday night October 2nd, 2015 - Photo provided by Kyle Ezell Team Captains meet for the coin toss before the game between the... Image 10 of 18 \nMandel Turner-King, 9, along with his teammates await the Eagle offense during the game between the WO-S Mustangs and the Newton Eagles at Dan R. Hooks Stadium in Orange, Friday night October 2nd, 2015 - Photo provided by Kyle Ezell Mandel Turner-King, 9, along with his teammates await the Eagle... Image 11 of 18 \nCoach Barbay gives his quarterback, Brock Barbay, instructions during the game between the WO-S Mustangs and the Newton Eagles at Dan R. Hooks Stadium in Orange, Friday night October 2nd, 2015 - Photo provided by Kyle Ezell Coach Barbay gives his quarterback, Brock Barbay, instructions... Image 12 of 18 \nTanner Holmes, 7, looks to make another tackle during the game between the WO-S Mustangs and the Newton Eagles at Dan R. Hooks Stadium in Orange, Friday night October 2nd, 2015 - Photo provided by Kyle Ezell. Tanner Holmes, 7, looks to make another tackle during the game... Image 13 of 18 \nNewton coach W.T. Johnston encourages the team from his familiar golf cart on the sidelines during the game between the WO-S Mustangs and the Newton Eagles at Dan R. Hooks Stadium in Orange, Friday night October 2nd, 2015 - Photo provided by Kyle Ezell Newton coach W.T. Johnston encourages the team from his familiar... Image 14 of 18 \nWO-S head coach Cornell Thompson walks the sidelines during the game between the WO-S Mustangs and the Newton Eagles at Dan R. Hooks Stadium in Orange, Friday night October 2nd, 2015 - Photo provided by Kyle Ezell WO-S head coach Cornell Thompson walks the sidelines during the... Image 15 of 18 \nMelech Edwards, 20, looks for an opening to run through during the game between the WO-S Mustangs and the Newton Eagles at Dan R. Hooks Stadium in Orange, Friday night October 2nd, 2015 - Photo provided by Kyle Ezell Melech Edwards, 20, looks for an opening to run through during the... Image 16 of 18 \nWO-S head coach Cornell Thompson gives the team instructions during a timeout in the game between the WO-S Mustangs and the Newton Eagles at Dan R. Hooks Stadium in Orange, Friday night October 2nd, 2015 - Photo provided by Kyle Ezell WO-S head coach Cornell Thompson gives the team instructions during... Image 17 of 18 \nTanner Holmes, 7, looks to the sidelines for instructions during the game between the WO-S Mustangs and the Newton Eagles at Dan R. Hooks Stadium in Orange, Friday night October 2nd, 2015 - Photo provided by Kyle Ezell. Tanner Holmes, 7, looks to the sidelines for instructions during... Image 18 of 18 1 / 18 Back to Gallery \nWest Orange-Stark (5-1) turned a highly-anticipated non-district matchup into a rout, cruising to a 48-6 victory over Newton (1-4) Friday at Dan R. Hooks Stadium. \nThe first half turned into the Jack Dallas show, who threw for 204 yards and three touchdowns to lead his team into the locker room with a 34-0 advantage. \nThe junior quarterback finished the night 10-of-14 for 291 yards and four touchdowns, completing scores of 72, 36 and 32 to receivers Kentavious Miller , Thomas \nWallace and Rufus Joseph . Melech Edwards and Malick Phillips added touchdown runs from 31 and 5 yards out. \nEdwards would finish the night with a game-high 163 rushing yards, including his score in the second quarter. \nDallas and Miller connected for their second 72-yard touchdown of the game with 57 seconds left in the third quarter to give the Mustangs a 41-0 lead. Newton's Jaron Hanks gave the Eagles their lone score of the game on a three-yard run in the early moments of the fourth quarter. Hanks led Newton with a team-high 114 rushing yards on 18 carries that included a 58-yard run to set up his score. \n\"You never want to go into district play with a loss,\" said Mustang coach Cornel Thompson , whose team will face Liberty next week. \"I'd put our non-district schedule among anyone else's in the state. Everything we did so far is going to prepare us for our district over the next few weeks.\" \nThe Mustangs' first offensive play from scrimmage set the tone for the rest of the night. A well-protected Dallas found Miller wide open in the middle of the field and the junior wide receiver cut to the right side and outraced a Newton defender 72 yards for an early score. \nLeading 21-0 with five minutes left in the first half, Dallas was rushed out of the pocket and threw up a jump ball to Jackson. The senior wide receiver was able to secure the ball over an off-balanced Ty Seastrunk and stroll into the end zone untouched from 36 yards out. \nThe score gave the Mustangs a 27-point lead, and after Cormier's interception three plays later, Dallas completed his third touchdown of the half - a 32-yard throw and catch to tight end Rufus Joseph. \nThe number zero was the biggest indicator of Newton's struggles in the first half. Quarterback Brock Barbay went 0-for-7 in the first half and had a pass picked off in the second quarter by the Mustangs' Aric Cormier . The Eagles went 0-of-5 on third downs and 0-of-2 on fourth down conversions. West Orange-Stark held Newton to one first down in the first half and 38 total yards. \n\"We are a pretty dang good football team if we get ready to play,\" Thompson said. \"We haven't shown the maturity a lot this season, we did (Friday), and we have do it again next week.\"", "external_links": [], "published": "2015-10-03T16:10:00.000+03:00", "crawled": "2015-10-03T17:38:28.031+03:00", "highlightTitle": ""}