{"organizations": [], "uuid": "03a509d4bafe12aa9349a67043de7a7b0cca101c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.themalaymailonline.com", "main_image": "http://www.themalaymailonline.com/uploads/articles/2015-10/rugby_20151006_england_Ian_Ritchie-Stuart_Lancaster.jpg", "site_section": "http://www.themalaymailonline.com/feed/rss/sports\r", "section_title": "The Malay Mail Online | Sports", "url": "http://www.themalaymailonline.com/sports/article/world-cup-inquiry-adds-to-england-rugby-turmoil", "country": "MY", "title": "World Cup inquiry adds to England rugby turmoil", "performance_score": 0, "site": "themalaymailonline.com", "participants_count": 0, "title_full": "World Cup inquiry adds to England rugby turmoil", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T05:50:00.000+03:00", "replies_count": 0, "uuid": "03a509d4bafe12aa9349a67043de7a7b0cca101c"}, "author": "", "url": "http://www.themalaymailonline.com/sports/article/world-cup-inquiry-adds-to-england-rugby-turmoil", "ord_in_thread": 0, "title": "World Cup inquiry adds to England rugby turmoil", "locations": ["England"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "World Cup inquiry adds to England rugby turmoil Tuesday October 6, 2015 11:23 AM GMT+8 ICYMI Print Article \nRFU chief Ian Ritchie (right) and head coach Lancaster being put through the media scrum.— Reuters/Action Images pics LONDON, Oct 6 — England’s World Cup campaign hit a new low as rugby chiefs investigated an alleged illegal approach to match-day officials the day were defeated by Australia. \nTalk of rifts in the England camp and speculation over who could replace coach Stuart Lancaster added to the sense of crisis after they were dumped out of the tournament in the first round. \nJapan’s Australian coach Eddie Jones said he could be “open” to an approach as England slumped to an all-time low of eighth in the world rankings. British newspapers said that Lancaster had to go. \nAccording to media reports, two members of England’s coaching staff approached match officials as England and Australia players went off the field at half-time in their 33-13 loss. \n“World Rugby is investigating an alleged breach by the England coaching team of the match-day communications protocol between match officials and team members or union officials,” said a World Rugby statement released yesterday. \nThe protocol prohibits “coaches approaching match officials during a match or at half-time”. \nAssistant coach Farrell does not know what the process of the inquiry will be. Media reports said there is CCTV footage from the tunnel where the alleged incident took place. There was a “robust” discussion in the tunnel after referee Romain Poite penalised the English scrum three times in the first half, The Times newspaper reported. \n“They have been in contact with us wanting to speak to us, but I don’t know what the process will be,” said England’s assistant coach Andy Farrell, who refused to comment further. \nAustralia coach Michael Cheika received a formal warning this year after he approached referee Jaco Peyper at half-time during his New South Wales Waratahs’ win over the Blues in Sydney. \nFarrell, whose son Owen Farrell was one of the few good performers for England, had to fight off questions about his role in England’s downfall at a press conference. \nMedia reports have spoken of players feeling that Farrell had too much influence in Lancaster’s team selection and were uneasy about Rugby League convert Sam Burgess getting a place so soon. \nStill devastation \n“Four of us as coaches get together and have a selection meeting. You put your two pennies worth in and Stuart makes the call and we all buy into that. It’s unanimous,” Farrell said of selection decisions. \nFarrell said Burgess had “worked unbelievably hard and continued to work very hard to make his stamp and give his all for the team”. \nHe added that there is “devastation in the camp” over defeats by Wales and Australia that led to the historic exit. But he defended Lancaster. \n“I think what Stuart has built here is more than those two defeats,” said Farrell. \n“Three and a half years under Stuart has been built on solid foundations. He has done marvellous things for this country and this rugby team. He is the hardest-working Englishman that I have ever met.” \nWhen asked about the future of the coaching team, he said: “The process will take its place and will be taken out of our hands. This team is a young team and it will go places and win trophies. We all want to be part of that but it is out of our hands.” \nHead coach Lancaster: Tough failure to get over. Lancaster himself has said he feels he will never get over the failed campaign. Newspapers are clamouring for his departure, though the Rugby Football Union said a review will go on after England’s final World Cup pool game against Uruguay on Saturday. \nJapan coach Jones, who is meant to join South African side the Stormers after the World Cup, said in a Daily Mail column he would “chat” to English bosses if approached. \n“There will be a lot of contenders queuing up for his (Lancaster’s) job,” commented Jones. \nClive Woodward, who managed England to their 2003 World Cup triumph, has said he is not keen to return. \nOther names mentioned include Mike Ford, the rugby league convert now in charge at Bath, Jake White, the South African who guided the Springboks to their 2007 World Cup success, and Jim Mallinder of Northampton Saints. — AFP", "external_links": [], "published": "2015-10-06T05:50:00.000+03:00", "crawled": "2015-10-06T06:42:01.254+03:00", "highlightTitle": ""}