{"organizations": ["View Full Caption Facebook/New York City FC"], "uuid": "4cf18a78ab66f0709c754e0da8a232259f984b00", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dnainfo.com", "main_image": "http://assets.dnainfo.com/generated/photo/2015/01/new-york-city-football-club-1422652363.jpg/extralarge.jpg", "site_section": "http://www.dnainfo.com/new-york/topics/sports.rss", "section_title": "Sports Top Stories on DNAINFO.com - Friday, October 23, 2015 | 7:23pm", "url": "http://www.dnainfo.com/new-york/20151023/concourse/pro-soccer-teams-kickoff-season-at-yankee-stadium-coming-close", "country": "US", "title": "Pro Soccer Team's Kickoff Season at Yankee Stadium Coming to a Close", "performance_score": 0, "site": "dnainfo.com", "participants_count": 0, "title_full": "Pro Soccer Team's Kickoff Season at Yankee Stadium Coming to a Close", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T00:24:00.000+03:00", "replies_count": 0, "uuid": "4cf18a78ab66f0709c754e0da8a232259f984b00"}, "author": "", "url": "http://www.dnainfo.com/new-york/20151023/concourse/pro-soccer-teams-kickoff-season-at-yankee-stadium-coming-close", "ord_in_thread": 0, "title": "Pro Soccer Team's Kickoff Season at Yankee Stadium Coming to a Close", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Eddie Small"], "text": "Pro Soccer Team's Kickoff Season at Yankee Stadium Coming to a Close By Eddie Small | October 23, 2015 5:24pm View Full Caption Facebook/New York City FC \nCONCOURSE — The New York City Football Club's kickoff season at Yankee Stadium ends on Oct. 25, and although the pro soccer team has already been eliminated from going to the playoffs, community members are still happy with how the first year went. \n\"It was really quite a remarkable integration into the neighborhood where soccer—well, that banner doesn’t fly as high as baseball or football,\" said Cary Goodman , executive director of the 161st Street Business Improvement District . \nNYCFC started its season at the ballpark on March 15, and locals welcomed the team with a mixture of enthusiasm and apathy . \nWith the season now coming to a close, community leaders agreed that, while the team did not have an enormous impact on the neighborhood, the extra events at Yankee Stadium were still a boon for nearby stores. \n\"It’s great for the local businesses [with] additional revenue coming in,\" said Jose Rodriguez , district manager of Bronx Community Board 4 . \nThe team is currently in eighth place in the MLS Eastern Conference with a 10-16-7 record, and attendance at this season's home games averaged about 29,000 people, much lower than this year's average Yankee game attendance of about 40,000 people, according to ESPN . \nTwo of the biggest games for NYCFC were the season opener, when about 44,000 fans came to the stadium, and the game against the New York Red Bulls, when about 48,000 fans showed up. \n\"The Red Bull game, that was pretty big. That got a little rowdy outside, just with the whole rivalry between the two,\" said Harold Terry, co-owner of the local sports bar The Dugout. \"That probably was the only game equivalent to a big baseball game.\" \nNYCFC did not respond to a request for comment. \nThe team will face off against the New England Revolution at 5 p.m. on Oct. 25 in Yankee Stadium to close out the season and hold a \"Soccerfest\" celebration that day starting at noon, which will give fans a chance to get player autographs, receive souvenirs and play soccer video games. \nThere will also be a \"huge inflatable goal,\" said Goodman, whose group is organizing the event, \"which will allow younger kids and maybe people who aren’t that familiar with soccer a chance to kick a goal.\" \nHe credited the soccer team for bringing some much needed vitality to the neighborhood that it usually lacks when the Yankees are not in town. \n\"Boardwalks suffer when it rains,\" he said, \"and here, this whole soccer thing has been sort of the antidote to times of the year when we don’t have anything going on with the Yankees.\" \nHe was also pleased that the brawls soccer fans have become notorious for did not make their way into The Bronx. \n\"I can’t think of a way it would have been more successful,\" he said of the season, \"except if the team was scoring more goals.\"", "external_links": [], "published": "2015-10-24T00:24:00.000+03:00", "crawled": "2015-10-24T02:25:53.090+03:00", "highlightTitle": ""}