{"organizations": [], "uuid": "45c7aa7ac4cb2c536fd3bf65d2e700f905ae0ae1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wcax.com", "main_image": "", "site_section": "http://www.wcax.com/category/13544/strange-news", "section_title": "Strange and weird news, features &amp; oddities - WCAX.COM Local Vermont News, Weather and Sports-", "url": "http://www.wcax.com/story/30178312/the-latest-shooters-dad-says-he-had-no-idea-son-had-guns", "country": "US", "title": "The Latest: Shooter's dad says he had no idea son had guns", "performance_score": 0, "site": "wcax.com", "participants_count": 1, "title_full": "The Latest: Shooter's dad says he had no idea son had guns - WCAX.COM Local Vermont News, Weather and Sports-", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T03:00:00.000+03:00", "replies_count": 0, "uuid": "45c7aa7ac4cb2c536fd3bf65d2e700f905ae0ae1"}, "author": "wcax.com", "url": "http://www.wcax.com/story/30178312/the-latest-shooters-dad-says-he-had-no-idea-son-had-guns", "ord_in_thread": 0, "title": "The Latest: Shooter's dad says he had no idea son had guns", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ROSEBURG, Ore. (AP) - The latest on the deadly shooting at a community college in Oregon (all times local):\n3 p.m.\nThe father of the gunman who killed nine people at an Oregon community college says he had no idea his son had guns. He also believes gun laws should change.\nIan Mercer, the father of gunman Christopher Sean Harper-Mercer, lives in California. His 26-year-old son had been living in Oregon.\nIan Mercer told CNN on Saturday that he is struggling to understand how and why the shooting happened and that he was stunned to learn his son had accumulated so many guns.\nAuthorities say Christopher Sean Harper-Mercer had 14 guns and took six to the campus.\nIan Mercer also told CNN his heart goes out to the grieving families.\nThe father says there is talk about gun control after shootings such as the one in Oregon but nothing is done.\nHe says the Oregon attack would not have happened if his son had not been able to get guns.\n___\n1:15 p.m.\nThe family of the gunman who killed nine people at an Oregon community college says they are \"shocked and deeply saddened\" by the slayings.\nAuthorities released the statement Saturday from the relatives of Christopher Sean Harper-Mercer saying \"our thoughts, our hearts and our prayers go out to all of the families of those who died and were injured.\"\nThe 26-year-old Harper-Mercer opened fire Thursday at Umpqua Community College in Roseburg, Oregon.\nOfficials have not released a motive. They said Saturday that Harper-Mercer killed himself after officers arrived at the scene.\n___\n12:55 p.m.\nA timeline of the college campus shooting released by the sheriff shows police arrived at the scene six minutes after the first 911 call and exchanged gunfire with the shooter two minutes later.\nThe timeline released Saturday also shows the suspect was down two minutes after the shootout.\nA Roseburg police officer and an Oregon state trooper were the first to arrive at the scene.\n___\n12:25 p.m.\nAuthorities say the gunman who killed nine people at an Oregon community college killed himself as officers arrived.\nSheriff John Hanlin made the disclosure Saturday at a news conference. He says the determination was made by the medical examiner's office.\n___\n11:45 a.m.\nAn official says the gunman who killed nine people at an Oregon community college left a \"manifesto\" that was a couple pages long.\nThe official did not reveal the contents of the document but described it as an effort to leave a message for law enforcement.\nThe official is familiar with the investigation but was not authorized to disclose information and spoke on the condition of anonymity.\nThe official said the document was left at the scene of Thursday's shooting but wouldn't specify how authorities obtained it.\nAuthorities are trying to determine a motive for the mass killing.\n-By Associated Press writer Tami Abdollah\n__\n11 a.m.\nConflicting reports are emerging about whether the gunman who killed nine people at an Oregon community college singled out Christians as his victims.\nJanet Willis, grandmother of wounded student Anastasia Boylan, said victims who identified themselves as Christian were shot in the head.\nHowever, the mother of another wounded student said the gunman asked his victims if they were religious but did not specifically target them if they were Christians.\nStephanie Salas, mother of 18-year-old survivor Rand McGowan, said the shooter asked about religion to let his victims know they were about to \"'meet their maker.'\"\nPolice have not disclosed any details about a possible motive. Gunman Christopher Harper-Mercer died following a shootout with police.\n ", "external_links": [], "published": "2015-10-03T03:00:00.000+03:00", "crawled": "2015-10-04T03:03:48.183+03:00", "highlightTitle": ""}