{"organizations": [], "uuid": "69dcaa7eb2cc075e17bd6d333998f8e606ebeb66", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.baltimoresun.com", "main_image": "http://www.trbimg.com/img-56204fc8/turbine/ct-notre-dame-usc-matthias-farley-cody-kessler", "site_section": "http://feeds.baltimoresun.com/baltimoresun/sports/college/rss2.0.xml", "section_title": "College Sports - Baltimore Sun", "url": "http://www.baltimoresun.com/sports/college/ct-notre-dame-usc-matthias-farley-cody-kessler-story.html", "country": "US", "title": "Notre Dame's Matthias Farley: 'We don't like USC; USC doesn't like us'", "performance_score": 0, "site": "baltimoresun.com", "participants_count": 1, "title_full": "Notre Dame's Matthias Farley: 'We don't like USC; USC doesn't like us'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T04:15:00.000+03:00", "replies_count": 0, "uuid": "69dcaa7eb2cc075e17bd6d333998f8e606ebeb66"}, "author": "Paul Skrbina", "url": "http://www.baltimoresun.com/sports/college/ct-notre-dame-usc-matthias-farley-cody-kessler-story.html", "ord_in_thread": 0, "title": "Notre Dame's Matthias Farley: 'We don't like USC; USC doesn't like us'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "var ssaUrl = ('https:' == document.location.protocol ? 'https://' : 'http://') + 'pixel.sitescout.com/iap/0ea84626951144d2';new Image().src = ssaUrl;\"/> College Football Notre Dame's Matthias Farley: 'We don't like USC; USC doesn't like us' Matthias Farley Joe Robbins / Getty Images \nNotre Dame's Matthias Farley says there's respect, but not much love, between the Irish and USC. \nNotre Dame's Matthias Farley says there's respect, but not much love, between the Irish and USC. (Joe Robbins / Getty Images) Paul Skrbina Contact Reporter Chicago Tribune How much do Notre Dame, USC like each other? Not much, but there's respect \nMatthias Farley wasn’t ready to label Saturday’s game against USC a revenge game for the Irish’s embarrassing 49-14 loss last season. \nBut he left little doubt about how the teams feel about each other. \n“This is an entirely different team, an entirely different season and just – we don’t like USC; USC doesn’t like us,” Farley said. \n“There’s no secret about that whatsoever. It’s just being prepared for a 15-round fight.” \nThe fight last year didn’t even last two rounds – or quarters – by the time it was all but over with USC up 35-0 in the second quarter. \nTrojans quarterback Cody Kessler was responsible for most of the damage. \nSix of Kessler’s 32 completions in last year against the Irish counted for six points each. He also torched a wounded Notre Dame team for 372 yards on those 40 attempts while connecting with nine receivers. \nAnd while the Irish and Trojans might not like each other, Farley was careful to point out a respect exists, especially when it comes to Kessler and his crew. \n“He has a lot of weapons around him,” Farley said. “He has an incredible arm. He's smart. He protects the ball. He fits the ball in tight windows and he really commands and understands that offense. It's that and just him having a lot of comfortability and experience.” \n“He’s a dang good player,” linebacker Joe Schmidt said. \nCenter Nick Martin said the Irish’s focus won’t be on what happened last year, though. \n“You touch on it a little bit,” he said. “You don't want to dwell on the past, but obviously people have a chip on their shoulder after that game.” \nMum’s the word: Notre Dame coach Brian Kelly said Thursday he talks to himself – at least about which players he’d like to redshirt. \nPreserving that year of eligibility is crucial, but unpredictable because of injuries. Kelly said he keeps it to himself because he wants those players to remain competitive. \n“You can never say, ‘I’m not going to play him regardless of the circumstances.’ Because if injuries show themselves, we’ve got to be ready. What I’d like to do is prepare them without having a conversation that, 'Hey, look, you're on the two-deep. We're going to take you to all the games. We're going to give you significant reps, but I don't think we're going to play you.' I don't have those kinds of conversations. I have them to myself.” \nInjury update: Left guard Quenton Nelson practiced this week and had some first-team reps after missing the last two games with a left ankle injury. Kelly said he will be a game-time decision. \nHe said it: “When you meet a middle linebacker in the hole against Navy last week and get knocked back 7 yards after scoring a touchdown, they let me know quite a bit that I'm 230 pounds and that should never happen.”– Notre Dame quarterback DeShone Kizer who is 6-foot-4 ½, on taking hits.", "external_links": [], "published": "2015-10-16T04:15:00.000+03:00", "crawled": "2015-10-16T19:56:40.899+03:00", "highlightTitle": ""}