{"organizations": [], "uuid": "b81d9809a464e90f98255632f013b648a33b53b9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "savannahnow.com", "main_image": "http://savannahnow.com/sites/default/files/47e3f8391c42992c830f6a70670094ee.jpg", "site_section": "http://savannahnow.com/", "section_title": "savannahnow.com | Savannah Georgia's source for News, Entertainment, Sports, Weather, Classifieds, Jobs, Autos, Real Estate and St. Patricks Day", "url": "http://savannahnow.com/sports/2015-10-07/georgia-bulldogs-see-struggles-running-game", "country": "US", "title": "Georgia Bulldogs see struggles in running game | savannahnow.com", "performance_score": 0, "site": "savannahnow.com", "participants_count": 1, "title_full": "Georgia Bulldogs see struggles in running game | savannahnow.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T16:06:00.000+03:00", "replies_count": 0, "uuid": "b81d9809a464e90f98255632f013b648a33b53b9"}, "author": "CONNOR RILEY", "url": "http://savannahnow.com/sports/2015-10-07/georgia-bulldogs-see-struggles-running-game", "ord_in_thread": 0, "title": "Georgia Bulldogs see struggles in running game | savannahnow.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photos FILE - In this Sept. 19, 2015, file photo, Georgia running back Nick Chubb (27) tries to break free from South Carolina linebacker Skai Moore (10) during the first half of an NCAA college football game in Athens, Ga. No. 13 Alabama takes on No. 8 Georgia on Saturday in Tuscaloosa. (AP Photo/John Bazemore, File) SPECIAL OFFER FOR NEW READERS 99 cent digital subscription to savannahnow.com\nSubscriber-members get access to ALL our digital products AND become eligible for free event tickets, discount coupons and other benefits. SIGN UP FOR SUBSCRIBER BENEFITS As a Savannah Morning News / savannahnow.com subscriber, you're eligible for members-only discounts. Download your coupons now. By CONNOR RILEY ATHENS — If you look at the numbers, you won’t notice a huge difference in Georgia’s running game.\nAfter playing Alabama, the top rush defense in the SEC statistically, the Bulldogs are still second in the conference in rushing.\nBut the Georgia players and coaches will tell you those numbers don’t paint an accurate picture. The team hasn’t run the ball as well as it has wanted to the last two weeks.\nAn 83-yard touchdown by Nick Chubb late in the game against Alabama inflated the team’s total. Sans the touchdown, Georgia ran for 110 yards, a huge drop-off from the 257 yards per game the team averaged on the ground before the Crimson Tide came to Athens.\nAgainst Southern, Georgia finished with 261 yards on the ground, but 215 of those came in the second half.\nA variety of reasons were given for the struggles: the wet field, the lack of consistent play calling and a lack of execution.\nThe coaches, Mark Richt and Brian Schottenheimer, both put the blame on play calling.\n“Yeah, I think strategically we’d have been better off trying to go downhill more than try to go outside, and with the wet turf and just some matchups we had out there on the edge, we had — I think our best shot would have been to go downhill against them,” head coach Richt said.\nSchottenheimer credited Alabama for preventing Georgia from getting its backs to the outside.\n“We wanted to test the edges but we probably did it a few times too often, to tell you the truth,” said offensive coordinator Schottenheimer. “We wanted to see if we could get the ball to the outside a little bit and they did a good job defending it.”\nOffensive lineman Isaiah Wynn prefers the team to run the ball downhill, or between the tackles, as he says it plays to what he does well. The Chubb touchdown ran came running between the guard and the center.\nBut Wynn also brought up the weather and the sloppy field conditions as factors in Georgia’s ground game struggles. Against both Alabama and Southern, the field has been in less than ideal conditions given the rain that fell before and during each game the last two Saturdays.\n“It kind of played an important part in it,” Wynn said. “It’s hard to get your second step in the ground and move a D-lineman when the ground is wet and you’re slipping and sliding.”\nThe weather forecast for Knoxville, Tennessee on Saturday calls for a 60 percent chance of showers.\nSony Michel and Chubb both acknowledge that the other team, whether it be Southern, Alabama or Tennessee, has to deal with the same issues.\nFor the Georgia running backs, they chalk the dropoff in the rushing game due to a lack of consistency. And Michel and Chubb both put the blame on themselves.\n“We just need to be consistent. It’s kind of hard,” Michel said. “We just need to know what we do well and focus in on what we do well. We need to make sure we don’t get away from it.”\nThe challenge to reestablish the ground game doesn’t get any easier this week, as the Bulldogs prepare for a talented Tennessee front. The Tennessee defensive line features four 300-pound defensive linemen as well as Derek Barnett, who finished tied for fourth in the conference in sacks last season with 10.0.\n“They’re young but they’re very talented. We’re just going to take the same approach that we always do,” center Hunter Long said.\nSchottenheimer acknowledges how good his offense can be at running the ball. It’s going to remain a focal point in the gameplan.\n“We know how good those backs are and we are at running the football,” Schottenheimer said. “I think that is going to be a huge part of our success this week.”", "external_links": ["http://sav-cdn.com/sites/default/files/imagecache/superphoto/47e3f8391c42992c830f6a70670094ee.jpg", "http://sav-cdn.com/sites/all/themes/savannahnow/images/blank.gif", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/47e3f8391c42992c830f6a70670094ee.jpg"], "published": "2015-10-07T16:06:00.000+03:00", "crawled": "2015-10-08T20:14:40.207+03:00", "highlightTitle": ""}