{"organizations": [], "uuid": "0462b989f8015586dbb7835385244f0956eeffc7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266381/sports-general", "section_title": "Sports: General - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30303423/mr-met-is-number-1-in-social-video-reports-dynamite-labs", "country": "US", "title": "Mr. Met is Number 1 in Social Video, Reports Dynamite Labs", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Mr. Met is Number 1 in Social Video, Reports Dynamite Labs - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T15:11:00.000+03:00", "replies_count": 0, "uuid": "0462b989f8015586dbb7835385244f0956eeffc7"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30303423/mr-met-is-number-1-in-social-video-reports-dynamite-labs", "ord_in_thread": 0, "title": "Mr. Met is Number 1 in Social Video, Reports Dynamite Labs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NY Mets mascot \"Mr. Met\" is surging in popularity to become the most shared mask in social video messaging – knocking Donald Trump out of the first place (a slot he’s held since the first Republican debate in September).\nNew York, NY (PRWEB) October 20, 2015\nMove over pumpkin spice lattes, there is a new October mania in town and it lives in Queens, NY. iPhone video app Dynamite reports today that New York Mets mascot \"Mr. Met\" has surged in popularity to become the top most used mask in the messaging app – knocking Donald Trump out of the first place (a slot he’s held since the first Republican debate in September).\n“October trends are unpredictable” said Larry Lieberman co-founder of the Dynamite app. “Everyone expects Freddy Kruger to be popular this time of year – and he is – but the New York Mets have more fans than anyone this week – way more than the Chicago Cubs.”\nSeveral thousand Dynamite app video messages with Mr. Met were recorded and sent this weekend vs. only a few hundred for the poor ol’ Clark, MLB's Chicago Cub’s Bear mascot (ranked 22 in popularity among Dynamite's 150 masks). Other popular masks in the Dynamite app include Kim Kardashian, John Cena, Jesus, and Sloths.\nLINKS TO VIDEOS MADE BY FANS:\nMets Fan Video October 19 Mr Met Video Oct 18 Mr Met Video Oct 19 About Dynamite Labs, Inc.\nDynamite is a free iPhone app, download in the App Store http://apple.co/1W34ky0\nDynamite Labs is on an important mission — to make it easy for everyone to share their personal, provocative, and funny stories on mobile video. The company is backed by $1.6 M in seed funding led by Observatory Capital. The founders are four experienced tech entrepreneurs responsible for apps already used by more than 100 million people.\n //www.prweb.com/releases/METS/iPhone/prweb13032238.htm\n ", "external_links": ["http://bit.ly/1jRd34V", "http://www.prweb.com/releases/METS/iPhone/prweb13032238.htm", "http://bit.ly/1GPIAJx", "http://apple.co/1W34ky0", "http://bit.ly/1LAz27t"], "published": "2015-10-20T15:11:00.000+03:00", "crawled": "2015-10-20T18:53:53.239+03:00", "highlightTitle": ""}