{"organizations": [], "uuid": "4454e384edd7215bdc9865c7b598b9c6c767de27", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/b39bdd8c02005318692d36e009c67283.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/cricket/kevin-pietersen-england-players-are-worried-about-asking-me/6934484/", "country": "JE", "title": "Kevin Pietersen: England players are worried about asking me for advice", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "Kevin Pietersen: England players are worried about asking me for advice", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T12:16:00.000+03:00", "replies_count": 0, "uuid": "4454e384edd7215bdc9865c7b598b9c6c767de27"}, "author": "", "url": "http://www.sport.co.uk/cricket/kevin-pietersen-england-players-are-worried-about-asking-me/6934484/", "ord_in_thread": 0, "title": "Kevin Pietersen: England players are worried about asking me for advice", "locations": ["England"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kevin Pietersen"], "text": "Kevin Pietersen: England players are worried about asking me for advice 14 Oct 2015 09:16:57 \ncomments \nKevin Pietersen claims some of England's current players are worried to ask him for advice for fear of getting into trouble. \nThe 35-year-old batsman is pleased with the direction in which English cricket is heading under the stewardship of Trevor Bayliss and assistant coach Paul Farbrace, but has expressed his disappointment that some of the players are worried about contacting him. \nSpeaking to BBC Radio 4 ahead of the release of his new book, 'Kevin Pietersen On Cricket', he said: \"I think it's just a sad, sad state that the messages that I receive from some of the current players are that it's difficult for them to ask me questions and advice because they fear that they might get into trouble for getting in touch with me. \n\"I know for a fact that there was a little bit of a worry that getting advice from me would be frowned upon. \n\"I just think that it's quite a sad position, with what I've achieved in the game for England, that it's seen to be sort of a no-go. \n\"I love English cricket. I want these guys to do well and I'm glad that they're doing so well. I love seeing what Paul Farbrace and Bayliss are doing with that side at the moment.\" \nPietersen said he would welcome the opportunity for England's players to play in the Indian Premier League amid reports that director of cricket Andrew Strauss is considering allowing players to miss Test matches in order to take part in the league. \n\"That's what I was saying for years,\" he added. \"I said why can't these players go and play in the IPL where you learn so much and you meet different players? \n\"You actually look forward to going to these places because you've got a home ground and you've got your favourite restaurants so touring becomes easier, which means when you go away with your country you actually think, 'perfect, this is like a home for me - it doesn't feel alien to me'. \n\"It's what got me into all my trouble at the ECB, disagreeing with players not being allowed to go and play. \n\"The captain of the one-day side played in the IPL. It's brilliant for Eoin Morgan, for his development, and for English cricket. \n\"I'm not cross. I'm happy for everybody to go out there and achieve what they want to achieve and for people to become better people and better players. \n\"I feel happy for the players. I really think it's amazing.\" Related Sport News", "external_links": [], "published": "2015-10-14T12:16:00.000+03:00", "crawled": "2015-10-14T20:06:57.906+03:00", "highlightTitle": ""}