{"organizations": [], "uuid": "559d2598d4f78de4e9453a0cfe0cc6ff3f4763cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mcall.com", "main_image": "http://www.trbimg.com/img-5625417e/turbine/mc-phantoms-mounting-injuries-10192015-20151019", "site_section": "http://www.mcall.com/sports/rss2.0.xml", "section_title": "Sports - The Morning Call", "url": "http://www.mcall.com/sports/mc-phantoms-mounting-injuries-10192015-20151019-story.html", "country": "US", "title": "Lehigh Valley Phantoms hit hard by injury bug", "performance_score": 0, "site": "mcall.com", "participants_count": 1, "title_full": "Lehigh Valley Phantoms hit hard by injury bug", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T22:14:00.000+03:00", "replies_count": 0, "uuid": "559d2598d4f78de4e9453a0cfe0cc6ff3f4763cb"}, "author": "Gary R. Blockus", "url": "http://www.mcall.com/sports/mc-phantoms-mounting-injuries-10192015-20151019-story.html", "ord_in_thread": 0, "title": "Lehigh Valley Phantoms hit hard by injury bug", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Lehigh Valley Phantoms hit hard by injury bug CHRIS KNIGHT / SPECIAL TO THE MORNING CALL Phantoms captain Colin McDonald (13) was injured in the season-opening game Oct. 10 at the PPL Center and will miss 3-4 weeks. Five more Phantoms joined the injured list over two games last weekend. SPORTS - CHRIS KNIGHT / SPECIAL TO THE MORNING CALL - Shot on 10/10/15 Phantoms captain Colin McDonald (13) was injured in the season-opening game Oct. 10 at the PPL Center and will miss 3-4 weeks. Five more Phantoms joined the injured list over two games last weekend. SPORTS - CHRIS KNIGHT / SPECIAL TO THE MORNING CALL - Shot on 10/10/15 (CHRIS KNIGHT / SPECIAL TO THE MORNING CALL) Gary R. Blockus Contact Reporter Of The Morning Call See how many Lehigh Valley Phantoms are on the injured list just 3 games into the season. \nFor the most part, the Lehigh Valley Phantoms practice on Monday looked more like open ice time with the number of players available for practice. The Phantoms sent out just nine forwards, six defensemen and two goalies for the skate, just about the entire lineup that ended Saturday's loss in Wilkes-Barre \nAfter a weekend road trip saw the Phantoms (1-2) go 1-1, picking up their first win of the season with a 4-1 victory in Springfield, Mass., followed by a 5-4 loss at the Wilkes-Barre/Scranton Penguins on Saturday, the Phantoms arrived back in Allentown with five less players available for duty. \nDefensemen Andrew MacDonald and Robert Hagg, along with forward Danick Martel, were injured in the Springfield win and did not play in Wilkes-Barre last Saturday . Hagg did suit up and sit on the bench against the Penguins, but did not play and only would have been used in an emergency situation, according to Phantoms head coach Scott Gordon. \nFirst-year pros Cole Bardreau and Michael Parks, both forwards, did not finish the game against on Saturday against the Penguins, with Parks appearing to leave the game with a shoulder injury, ending the game with just nine forwards for the third period. \nAfter practice, Gordon said that he expects to call up three players from the affiliate Reading Royals of the ECHL to step in for the injured Phantoms. \nNone of the injured players suited up at practice on Monday morning, along with forward Colin McDonald, who as injured in the season-opening loss two weeks ago and won't be available for at least 3-4 weeks according to Gordon. \nGordon said that Parks is also \"at least a couple of weeks\" away, preferring the ubiquitous \"injured\" as opposed to hockey's usual \"upper\" or \"lower\" body injury. \nGordon said he wasn't sure about MacDonald, but that he's being listed as day-to-day, Bardreau is \"day-to-day-ish.\" \nGordon sounded a bit more upbeat about Martel's chances of playing at least some of this weekend's three games in three days marathon, which begins Friday in Providence, R.I. and then returns home 7:05 p.m. against Providence, and ends with a 5:05 p.m. Sunday game with the Toronto Marlies.. \n\"If everything goes right, he could be back for the weekend, at least part of it,\" Gordon said. \nGordon sounded doubtful on Hagg's availability for this weekend's three-in-three. \n\"[He] didn't have a serious injury, but enough to keep him out for the weekend, and we'll re-evaluate then,\" Gordon said.", "external_links": [], "published": "2015-10-19T22:14:00.000+03:00", "crawled": "2015-10-19T22:43:16.371+03:00", "highlightTitle": ""}