{"organizations": [], "uuid": "526c4c4488281618393036eb462f842a5f77026b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.commercialappeal.com", "main_image": "http://media.jrn.com/images/0925_MASP_umfb2.jpg", "site_section": "http://www.commercialappeal.com/sports/index.rss", "section_title": "Sports", "url": "http://www.commercialappeal.com/sports/Temple-Memphis-are-1-and-1a-in-our-new-conference-rankings-330161671.html", "country": "US", "title": "Temple, Memphis are 1 and 1a in our new conference rankings", "performance_score": 0, "site": "commercialappeal.com", "participants_count": 1, "title_full": "Temple, Memphis are 1 and 1a in our new conference rankings", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T00:26:00.000+03:00", "replies_count": 0, "uuid": "526c4c4488281618393036eb462f842a5f77026b"}, "author": "Tom Schad", "url": "http://www.commercialappeal.com/sports/Temple-Memphis-are-1-and-1a-in-our-new-conference-rankings-330161671.html", "ord_in_thread": 0, "title": "Temple, Memphis are 1 and 1a in our new conference rankings", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The first month of the college football season is already over, and the top four teams in the American Athletic Conference are continuing to separate themselves. Houston, Memphis, Navy and Temple are all unbeaten, setting the stage for a pair of exciting division races, especially in the West. Here’s how the AAC shakes out entering Week 5.\n1. Temple (3-0, 1-0 AAC): There are various opinions on how to do rankings, and here’s mine: It’s tough to knock a team out of the top spot when it didn’t play last week. Despite its scare against Massachusetts, Temple still has one of the conference’s signature wins against Penn State and had a more convincing win over Cincinnati, on the road, than Memphis had against the Bearcats at home. The Owls will travel to Charlotte on Friday.\n1a. Memphis (4-0, 1-0 AAC): “1 and 1a? What a copout!” Yup. Fair. Completely agree. But this isn’t the AP poll -- flexibility is allowed. The truth is it’s hard to separate Temple and Memphis after the Tigers’ 53-46 win over Cincinnati. The Owls have the signature win, but the Tigers have a Power Five win of their own, and consecutive victories over two really tough Group of Five teams. Maybe Friday’s game at South Florida will help clear this up.\n3. Houston (3-0): The Cougars continue to impress, most recently with a 59-14 shellacking of Texas State, but their schedule to this point has been lackluster. Their biggest win came at Louisville, but Louisville has lost two of its other three games. We’ll learn more about Houston as the season goes on, beginning with a tricky road game Saturday at Tulsa.\n4. Navy (3-0, 2-0 AAC): The Midshipmen are no joke. They’re averaging 363 rushing yards per game, and their quarterback is closing in on the career NCAA record for touchdowns. Their 28-18 win at Connecticut was their seventh in a row. And the conference team that is best-equipped to stop them -- Temple -- is not on the schedule this year. Navy will host Air Force on Saturday, then play at Notre Dame in a game with huge implications for both the program and the conference at large.\n5. East Carolina (2-2, 0-1 AAC): Some folks (including me) left the Pirates for dead when they lost their starting quarterback to a season-ending injury. Then, they went out and beat Virginia Tech, 35-28. Suddenly, East Carolina has a signature win over a Power Five team, and its two losses -- at Florida and at Navy -- look solid. The Pirates will play at SMU on Saturday.\n6. Cincinnati (2-2, 0-2 AAC): The preseason conference favorites will have a tough time climbing back up the standings after an 0-2 start, even though those losses came against two of the AAC’s best teams. A Thursday night meeting with Miami is next. Gunner Kiel, who took a brutal hit last Thursday at the Liberty Bowl, has not been cleared to practice, so Hayden Moore will get his first career start.\n7. Tulsa (2-1): The Golden Hurricane was idle last week and will open conference play Saturday at home against Houston. It’ll be a meeting of the No. 2 and 3 offenses in the conference. The difference is that the Cougars actually play capable defense. We’ll see how Philip Montgomery’s offense fares.\n8. Connecticut (2-2, 0-1 AAC): The Huskies slide in the rankings this week, but their two losses this season have been respectable. After a three-point loss at Missouri, they dropped a relatively close game to Navy last week, 28-18. Up next: A Friday night game against BYU, which was blanked by Michigan last week.\n9. South Florida (1-2): The Bulls haven’t lost an AAC opener since the conference was founded three years ago, but they also haven’t beaten Memphis since 2008. They’ll get their next chance Friday. USF is scoring only 27.3 points per game, and it’ll probably have to put up a few more than that to have a shot.\n10. SMU (1-3): Tough week for the Mustangs. Before its basketball program was sanctioned by the NCAA for academic fraud, among other things, its football team lost at home to James Madison, 48-45. Not a good look for Chad Morris’ group. And next in line is a Saturday meeting with a team trending in the opposite direction: East Carolina, which just downed Virginia Tech.\n11. Tulane (1-2): The Green Wave didn’t play in Week 4, though there was a bit of news from New Orleans as longtime athletic director Rick Dickson announced that he will retire in May. Tulane has a golden opportunity to even its record Saturday against lowly Central Florida before enduring a brutal stretch against Temple, Houston, Navy and Memphis. Three of those four games are on the road.\n12. Central Florida (0-4): The Knights lost again last week, this time to South Carolina, 31-14. An Orlando bar has announced it will serve free beer during UCF games until the team wins. It might need to order a few more kegs -- if the Knights don’t beat Tulane on Saturday, they could very well be winless through October.", "external_links": [], "published": "2015-10-01T00:26:00.000+03:00", "crawled": "2015-10-01T00:49:19.310+03:00", "highlightTitle": ""}