{"organizations": [], "uuid": "a09b9dca14957964385e1127cde4b2e0b78a1c43", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-5616b207/turbine/ct-chicago-bishop-sues-american-orthodox-church-met-20151008", "site_section": "http://www.chicagotribune.com/", "section_title": "Chicago Tribune: Chicago breaking news, sports, business, entertainment, weather and traffic - Chicago Tribune", "url": "http://www.chicagotribune.com/news/local/breaking/ct-chicago-bishop-sues-american-orthodox-church-met-20151008-story.html", "country": "US", "title": "Ousted Orthodox bishop sues church leaders", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Ousted Orthodox bishop sues church leaders - Chicago Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T23:58:00.000+03:00", "replies_count": 0, "uuid": "a09b9dca14957964385e1127cde4b2e0b78a1c43"}, "author": "Manya Brachear Pashman", "url": "http://www.chicagotribune.com/news/local/breaking/ct-chicago-bishop-sues-american-orthodox-church-met-20151008-story.html", "ord_in_thread": 0, "title": "Ousted Orthodox bishop sues church leaders", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The former Chicago bishop of the Orthodox Church in America who was asked to retire amid allegations of sexual misconduct two years ago has sued church leaders, claiming they breached that retirement contract.\nThe lawsuit against Metropolitan Tikhon, primate of the Orthodox Church in America, and Detroit Archbishop Nathaniel, leader of the Romanian Orthodox Episcopate, was filed in Cook County Circuit Court last month. Both defendants were served during the national Assembly of Canonical Orthodox Bishops in Chicago.\nBishop Matthias alleges that church leaders violated the terms of his retirement and a recent employment agreement when they terminated a parish assignment in response to complaints from the Survivors Network of those Abused by Priests, or SNAP.\n\"This is a case about broken promises and the repeated failure to honor one's legal obligations,\" the suit says. \"The legal questions involved are not complex. Indeed, they require only a straightforward application of civil law.\"\nOfficials with the Orthodox Church in America declined to comment, citing a church policy \"to not comment on any active or potential legal activities.\"\nBishop Matthias' assignment to a parish in Pennsylvania angered victims' advocates who said allowing the ousted bishop to return to any form of active ministry violated the church's zero-tolerance policy.\nBishop Matthias, born David Lawrence Moriak, stepped down from his post as head of the Midwest diocese in April 2013 after the church determined that remarks to a female parishioner in Ohio qualified as sexual misconduct.\n\"I do repent of using poor judgment, of using inappropriate words that I thought were being received as humorous,\" Matthias said at the time of his ouster. \"It was never my intention to cause a complaint of any harm or discomfort.\"\nTerms of the retirement package included permission for Bishop Matthias to serve in any parish, as long as he had the blessing of the local bishop. That agreement included the parish in Columbus, Ohio, where his son serves as a priest. Though the Orthodox Church allows its priests to marry and have children, only monastic priests can become bishops.\nBishop Matthias never remarried after the death of his wife in 1997 and entered monastic life in 2003. He became a bishop when he came to Chicago in 2010.\nAfter agreeing to retire in 2013, Bishop Matthias moved to West Virginia, where he purchased a home and secured a retail job to make ends meet. According to the suit, Archbishop Nathaniel, the most senior bishop in the denomination and leader of the Romanian Episcopate, contacted him in November 2014 to fill a parish post temporarily in Hermitage, Pa.\nBecause of the temporary nature of the job and the required move, Bishop Matthias initially declined the request, the suit said. Archbishop Nathaniel returned six months later to offer a guaranteed one-year appointment approved by Metropolitan Tikhon and other bishops, according to the suit, leading Bishop Matthias to quit his retail job, lease his house and move to Hermitage.\nAccording to the suit, after victims' advocates aired their concerns in July, Metropolitan Tikhon told Bishop Matthias he could continue to serve with his blessing, but any references to his position had to be removed from the parish website. Bishop Matthias declined, the suit said.\nMelanie Sakoda, a member of SNAP, said she's not surprised by the allegations in the complaint that the church tried to keep the reassignment under the radar.\n\"The OCA has been dragged kicking and screaming into making changes,\" she said. \"Bishop Matthias is a hard case for them because there was no touching involved.\"\nIn August, according to the suit, Metropolitan Tikhon proposed removing Bishop Matthias from the Pennsylvania parish to participate in a three-month clergy supervisory plan in residence at a monastery with a $7,000 stipend.\nHe also acknowledged in that email that Bishop Matthias had \"acted in good faith in all of this\" and admitted that he and the bishops \"failed in fulfilling\" their \"responsibility,\" the suit said.\nBishop Matthias seeks damages, including lost wages and expenses incurred during the move from West Virginia to Pennsylvania. The suit also claims Bishop Matthias has suffered emotional distress.\n\"After losing his beloved wife, the church was his entire life,\" the suit said. \"And now that, too, was being taken away from him.\"\nThe Orthodox Church in America, one of several branches of Orthodox Christianity in the U.S., claims about 100,000 adult members nationwide and 5,000 in the Midwest.\nmbrachear@tribpub.com\nTwitter @TribSeeker\n Sexual Misconduct Supplemental Nutrition Assistance Program Religion and Belief", "external_links": ["http://www.trbimg.com/img-5616b207/turbine/ct-chicago-bishop-sues-american-orthodox-church-met-20151008"], "published": "2015-10-08T23:58:00.000+03:00", "crawled": "2015-10-09T01:03:19.574+03:00", "highlightTitle": ""}