{"organizations": [], "uuid": "8592648c567f94dd57b7ada4e2d858706e767ef9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sj-r.com", "main_image": "http://www.sj-r.com/storyimage/LS/20151017/SPORTS/151019598/AR/0/AR-151019598.jpg", "site_section": "http://www.sj-r.com/sports?template=rss&mime=xml", "section_title": "Sports - The State Journal-Register", "url": "http://www.sj-r.com/article/20151017/SPORTS/151019598/2000/NEWS?rssfeed=true", "country": "US", "title": "SHG routs Southeast, sets up showdown with Rochester", "performance_score": 0, "site": "sj-r.com", "participants_count": 1, "title_full": "SHG routs Southeast, sets up showdown with Rochester", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T08:23:00.000+03:00", "replies_count": 0, "uuid": "8592648c567f94dd57b7ada4e2d858706e767ef9"}, "author": "Brian Webster, Staff Writer", "url": "http://www.sj-r.com/article/20151017/SPORTS/151019598/2000/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "SHG routs Southeast, sets up showdown with Rochester", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SHG routs Southeast, sets up showdown with Rochester Comment By Brian Webster, Staff Writer The State Journal-Register By Brian Webster, Staff Writer Posted Oct. 17, 2015 at 12:01 AM Updated at 12:23 AM By Brian Webster, Staff Writer Posted Oct. 17, 2015 at 12:01 AM Updated at 12:23 AM • Southeast at SHG football A 13-play drive to start the game? For Sacred Heart-Griffin? Against a two-win Southeast team? It happened. A week of practice that one player called “sluggish” begat an uncharacteristically clumsy opening drive for the Cyclones on Senior Night. But then one of those seniors, Sam Sergent, put his foot down. Sergent finished that opening drive with an 11-yard touchdown run, then broke off a zig-zagging, 44-yard scoring scamper on the Cyclones’ next series to spark a 54-24 SHG romp over the visiting Spartans. ** More photos from this game on The Visual Journal ** Class 6A’s No. 1-ranked Cyclones will take an 8-0 record to 8-0 Rochester (No. 1 in 4A) for Leonard Bowl VI next week. Turns out, that was the game SHG couldn’t stop thinking about as it prepared for Southeast (2-6). “The week of practice was a little sluggish, but we started picking it up yesterday,” said Sergent, who finished with 125 yards on just eight carries and didn’t play after the first quarter. “We had a very good game plan, we executed it very well and we played to our potential.” Running clock After the Cyclones’ opening drive, which included three penalties by each team, the hosts found their gear and roared like they can, scoring on all seven of their first-half possessions to take a 48-6 lead to intermission and start the running clock. Sergent, who was a little under the weather, watched from the sidelines as his backups, junior Tristan Blair and sophomore TreMayne Lee, rolled up a combined 120 yards on just six combined carries. Lee scored on runs of 7, 50 and 13 yards as SHG put a quick end to the suspense. “Credit to (SHG),” said Southeast coach Matt Lauber. “They get you out of sorts and out of whack. Our guys played hard, and that’s what we’ll keep going with.” Cyclones coach Ken Leonard said it was just like Sergent to give his team that early spark. He figures the Cyclones will need more mileage from the grizzled veteran next week at Rochester. “Sam’s a great player,” said Leonard. “He’s got great skills, and I think we haven’t even yet seen the best of him. I’m looking forward to next week and getting (Sergent) some more playing time.” Passing game SHG junior quarterback Tim Brenneisen completed 11 of 16 passes for 146 yards with touchdown strikes to seniors Albert Okwuegbunam (12 yards) and Sam Bonansinga (31), who finished with eight catches for 128 yards. Page 2 of 2 - The Spartans struggled offensively until they found a spark halfway through the second quarter. Lauber had wide receiver Gavin Webb and quarterback Isaiah Timms switch places and the results were electric. Webb completed five of 11 passes for 51 yards and rushed for 57 more yards, including a 4-yarder for Southeast’s only touchdown of the first half. Lauber said that’s a preview of attractions to come for the Spartans. “I’d say you’ll see more of that,” Lauber said. “That was something we looked at in practice and worked on, and he (Webb) did a great job. Timms did a great job at wide receiver too, which is something I’m proud of.” The Spartans got three unconventional touchdowns in the second half during running clock time. Senior Eddie Gailes returned a recovered fumble 33 yards for a score. Simeon Helem returned a kickoff 85 yards for another touchdown. And Andre Booker, in the final minutes, stripped a Cyclones fifth-string ballcarrier and rumbeld 55 yards for another defensive touchdown to pull Southeast within 54-24. Leonard said he caught his team looking ahead a bit this week but said that means they’ll be that much more focused on Rochester this week. “We had a little bit of an incident Thursday night (at practice),” Leonard said. “I had to pull back the reigns a little bit, but you know what? They responded. And I’m proud of the kids for that. “This is a whole new week. This is a week they’ll be focused. We know we’ll be challenged and that it’ll be a fun week.” — Contact Brian Webster, 788-1545, brian.Webster @sj-r.com, twitter.com/briweb69 . By Brian Webster, Staff Writer The State Journal-Register By Brian Webster, Staff Writer Posted Oct. 17, 2015 at 12:01 AM Updated at 12:23 AM", "external_links": [], "published": "2015-10-17T08:23:00.000+03:00", "crawled": "2015-10-17T13:30:06.749+03:00", "highlightTitle": ""}