{"organizations": [], "uuid": "b433128137ae6c455834d43eec22c547feea7ae3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-5626898c/turbine/ct-lns-torrez-hobbs-zion-murder-case-st-1021-20151020", "site_section": "http://www.chicagotribune.com/", "section_title": "Chicago Tribune: Chicago breaking news, sports, business, entertainment, weather and traffic - Chicago Tribune", "url": "http://www.chicagotribune.com/suburbs/lake-county-news-sun/crime/ct-lns-torrez-hobbs-zion-murder-case-st-1021-20151020-story.html", "country": "US", "title": "Defendant in Zion double murder accuses young victim&apos;s dad - Lake County News-Sun", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Defendant in Zion double murder accuses young victim&apos;s dad - Lake County News-Sun", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T21:22:00.000+03:00", "replies_count": 0, "uuid": "b433128137ae6c455834d43eec22c547feea7ae3"}, "author": "Jim Newton", "url": "http://www.chicagotribune.com/suburbs/lake-county-news-sun/crime/ct-lns-torrez-hobbs-zion-murder-case-st-1021-20151020-story.html", "ord_in_thread": 0, "title": "Defendant in Zion double murder accuses young victim&apos;s dad - Lake County News-Sun", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The defense attorney for Jorge Torrez, accused of the 2005 murder of two young girls in Zion, said in court Tuesday that the state's DNA evidence is \"junk,\" and he will argue at trial that Jerry Hobbs, who initially confessed to the murders but was later exonerated, is the likely killer.\n\"Our defense in this case is that Hobbs did it,\" attorney Jed Stone told Judge Daniel Shanes. \"He confessed to really good detectives that the state has always respected in the past. And the DNA is junk.\"\nTorrez, a former Zion resident, is charged with the Mother's Day 2005 slaying of 8-year-old Laura Hobbs, the daughter of Jerry Hobbs, and 9-year-old Krystal Tobias in Beulah Park in Zion.\nThe girls were stabbed numerous times in what authorities described as a savage attack.\nHobbs had confessed during an interrogation shortly after the bodies were found and was held in jail on murder charges for five years before authorities said DNA evidence pointed to another man, whom they later alleged was Torrez.\nThe case against Hobbs was among several that fell apart in Lake County after forensic evidence pointed away from those who had been charged and, in some cases, convicted and sentenced to lengthy prison terms.\nHobbs was freed after five years in jail and won a multimillion-dollar settlement after being cleared in Lake County. He since has been convicted and imprisoned on drug charges in Oklahoma. Hobbs, 45, pleaded guilty to methamphetamine possession, among other charges, and was sentenced earlier this year to 15 years in prison, according to court records.\nMan charged in murder of two Zion girls not expected to face trial this year Jim Newton The anticipated trial of Jorge Torrez for the alleged 2005 murder of two young girls in Zion will likely not occur until next year, officials said Tuesday.\nAt a hearing Tuesday, Judge Daniel Shanes noted that defense attorney Jed Stone had been granted court-approved funding for investigations...\nThe anticipated trial of Jorge Torrez for the alleged 2005 murder of two young girls in Zion will likely not occur until next year, officials said Tuesday.\nAt a hearing Tuesday, Judge Daniel Shanes noted that defense attorney Jed Stone had been granted court-approved funding for investigations...\n(Jim Newton) On Tuesday, Stone said he has requested reports on specific DNA evidence in the case and will turn the information over to his DNA expert for further examination.\nShanes set a Nov. 6 hearing to review the status of pretrial motions. A trial date has not yet been scheduled.\nAlthough Torrez is being held in Lake County Jail, his presence at Tuesday's hearing was waived after attorneys were told it could take up to an hour to bring him to the courtroom. Stone said he would fill his client in on the hearing later in the day.\nWith the trial of Torrez expected to take place next year, Assistant State's Attorney Ari Fisz said he had no comment yet as to whether the state would seek to bar testimony at trial regarding Hobbs' confession.\nStone previously said there is no reason to rush the trial.\n\"He already has five life sentences and a federal death penalty hanging over his head,\" Stone said of Torrez. The life sentence was for Torrez's conviction in the 2009 strangulation murder of Navy Petty Officer 2nd Class Amanda Snell, 20, who lived in the same barracks as Torrez at the Joint Base Myer-Henderson Hall in Arlington, Va.\nThe five life sentences were for a series of attacks on women that also occurred after the Zion girls were killed.\nTorrez, a former Marine, has also been convicted of abducting three young women in Arlington, Va., in February 2010, one of whom he raped, sodomized, strangled and left for dead. He was sentenced to five life sentences in the series and is sentenced to death at the federal level for Snell's murder.\nProsecutors, including State's Attorney Michael Nerheim, have said the decision to try Torrez for the Lake County murders was necessary because there is always a chance previous convictions could be overturned and because it will help provide closure for the families of the girls.\nAccording to investigators, DNA found at the girls' murder scene matches Torrez, a friend of Krystal Tobias' brother who lived in the same Zion neighborhood as the victim in 2005. He later left the area to enter the Marines, which took him to Virginia.\njrnewton@tribpub.com\nTwitter @jimnewton5\nCopyright © 2015, Lake County News-Sun", "external_links": ["http://www.trbimg.com/img-5626898c/turbine/ct-lns-torrez-hobbs-zion-murder-case-st-1021-20151020", "http://www.trbimg.com/img-5564ba4d/turbine/ct-lns-torrez-trial-delay-st-0527-20150526"], "published": "2015-10-20T21:22:00.000+03:00", "crawled": "2015-10-20T23:36:36.116+03:00", "highlightTitle": ""}