{"organizations": [], "uuid": "6be178a81a66caa61676b0e6a44acc0cf22999b0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/d04467c2bdc4f03247306cc12a50899f", "site_section": "http://www.news.com.au/sport/more-sports", "section_title": "More Sports | More Sports | Sports News and Results | News.com.au", "url": "http://www.news.com.au/sport/more-sports/mick-fannings-word-championship-lead-cut-as-fellow-aussie-tyler-wright-wins-womens-event-in-france/story-fndukor0-1227571622948", "country": "AU", "title": "World Surf League: Australian Tyler Wright wins in France", "performance_score": 0, "site": "news.com.au", "participants_count": 1, "title_full": "World Surf League: Australian Tyler Wright wins in France", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T20:50:00.000+03:00", "replies_count": 0, "uuid": "6be178a81a66caa61676b0e6a44acc0cf22999b0"}, "author": "news.com.au", "url": "http://www.news.com.au/sport/more-sports/mick-fannings-word-championship-lead-cut-as-fellow-aussie-tyler-wright-wins-womens-event-in-france/story-fndukor0-1227571622948", "ord_in_thread": 0, "title": "World Surf League: Australian Tyler Wright wins in France", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Video Image Tyler Wright wins Roxy Pro France 0:30 Surfing: Australia's Tyler Wright has moved up to fifth in the world rankings, after winning her second straight Roxy Pro France.\nOctober 16th 2015 5 days ago /video/video.news.com.au/Sport/More Sports/ Australia's Tyler Wright competes during the Roxy Pro France in Hossegor, France.\nAAP AUSTRALIAN Tyler Wright has dominated the final of the World Surf League event in France to claim back-to-back titles, while compatriot Bede Durbidge finished second in the men’s event behind Brazilian Gabriel Medina.\nBut Mick Fanning’s loss in the quarter-final means the Australian world No.1 is now just 450 points clear of second-placed Adriano de Souza on the championship leaderboard with two tour stops remaining.\nBrazil’s de Souza finished equal third in France.\nAustralia's Tyler Wright, USA's Tatiana Weston-Webb, Australia's Bede Durbidge and Brazil's Gabriel Medina. Source: AFP\nDurbidge on Thursday defeated Fanning in the quarter-final and fellow Aussie Julian Wilson in the semi-final en route to finishing second at the Quicksilver Pro.\nWright, 21, meanwhile dominated the Roxy Pro final, unleashing her powerful surfing in clean conditions to score two excellent rides including a strong forehand barrel and combinations of turns. Her impeccable wave selection left her opponent, Hawaiian tour rookie Tatiana Weston-Webb, scouring the lineup for leftovers.\n“I was just feeling it, I was looking at the waves before and I knew it was going to be good,” Wright said after claiming her first victory of 2015.\n“It was kind of tricky, I was very selective.\n“This whole season has been super interesting, and I just found out the difference between someone who cares and someone who doesn’t, and I care.” Wright has moved up to fifth in the world rankings with one event in Hawaii remaining on the women’s calendar.\nMedina, who climbs to No.5 in the world, was also dominant in the men’s final against Durbidge.\nAustralia's Mick Fanning has had his world championship lead cut considerably. Source: AFP\nThe Australian had some impressive heats but admitted the final “was just one-sided”.\n“Gaby was on every good wave,” Durbidge said afterwards.\n“It was just one of those heats that you don’t want to have again.\n“But I have to just look at the positives, it’s another podium finish and I’m right there for a win, I’ll try to bring it home next time.\n“I love (next up) Portugal and have done well there in the past so I look forward to that.” Despite an exciting opening heat on Thursday morning, in which he posted massive scores, 26-year-old Wilson was stopped in the semis by Durbidge.\nBut equal third in France is another excellent result for the Queenslander who moves up to fourth in the rankings.\nAustralian Owen Wright, who like Fanning was knocked out in the quarter-finals finishing equal fifth, moves up to No.3 in the world in the chase for the 2015 championship.\nGabriel Medina masters French break 0:35 Surfing: Reigning World Champion Gabriel Medina has kept alive his hopes of retaining the crown after taking out the Quiksilver Pro France.\nOctober 16th 2015 5 days ago /video/video.news.com.au/Sport/More Sports/ Surfer Wright repeats title win in France", "external_links": ["http://cdn.newsapi.com.au/image/v1/external?url=http%3A%2F%2Fcontent4.video.news.com.au%2Ffoxsports%2Fprod%2Farchive%2F2015%2F10%2F16%2FFSD_161015_SUR_FRANCE_MENS_FINAL_WIPE.jpg&width=650&api_key=kq7wnrk4eun47vz9c5xuj3mc", "http://cdn.newsapi.com.au/image/v1/origin:fatwire.", "http://cdn.newsapi.com.au/image/v1/d04467c2bdc4f03247306cc12a50899f", "http://www.foxsports.com.au/more-sports/mick-fannings-word-championship-lead-cut-as-fellow-aussie-tyler-wright-wins-womens-event-in-france/story-e6frf56c-1227571622948", "http://cdn.newsapi.com.au/image/v1/5f65533a555335b2a4479c56003e19e3", "http://cdn.newsapi.com.au/image/v1/301b1289eb14dc2fc175b35711e77338", "http://cdn.newsapi.com.au/image/v1/external?url=http%3A%2F%2Fcontent4.video.news.com.au%2Ffoxsports%2Fprod%2Farchive%2F2015%2F10%2F16%2FFSD_161015_SUR_FRANCE_WOMENS_FINAL_WIPE.jpg&width=650&api_key=kq7wnrk4eun47vz9c5xuj3mc", "http://widgets.outbrain.com/outbrain.js"], "published": "2015-10-16T20:50:00.000+03:00", "crawled": "2015-10-20T18:28:34.156+03:00", "highlightTitle": ""}