{"organizations": [], "uuid": "2396c81ecbc61b2626e587bb0ed289f52992ddd0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "highschoolsports.nj.com", "main_image": "http://media.nj.com/njcom_photos/photo/2015/10/05/18905058-large.jpg", "site_section": "http://blog.nj.com/realtimesports_impact/rss.xml", "section_title": "New Jersey Real-Time Sports", "url": "http://highschoolsports.nj.com/news/article/-6042869465702021114/sen-codeys-bill-to-penalize-redshirting-athletes-introduced-in-senate/", "country": "IL", "title": "Sen. Codey introduces bill to penalize 'redshirting' athletes", "performance_score": 0, "site": "nj.com", "participants_count": 1, "title_full": "Sen. Codey introduces bill to penalize 'redshirting' athletes", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T21:46:00.000+03:00", "replies_count": 0, "uuid": "2396c81ecbc61b2626e587bb0ed289f52992ddd0"}, "author": "Matthew Stanmyre | NJ Advance Media for NJ.com", "url": "http://highschoolsports.nj.com/news/article/-6042869465702021114/sen-codeys-bill-to-penalize-redshirting-athletes-introduced-in-senate/", "ord_in_thread": 0, "title": "Sen. Codey introduces bill to penalize 'redshirting' athletes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Matthew Stanmyre | NJ Advance Media for NJ.com on October 20, 2015 2:16 PM View/Post Comments \nMoving quickly to address what he calls “cheating” and “trying to game the system,” State Sen. Richard Codey (D-Essex) introduced his controversial bill Monday that aims to penalize athletes who repeat a grade in middle school to gain athletic advantage in high school. \nThe bill would limit student athletes who repeat grades six, seven or eight — despite being academically on track — to three years or six consecutive semesters of athletic eligibility once they begin high school. The three years of eligibility would include all levels of play: freshman, junior varsity and varsity. \nThe bill was co-sponsored by State. Sen. Peter Barnes (D-Middlesex), another critic of the popular trend known as “redshirting.” \nCodey and Barnes say athletes everywhere are repeating in middle school in record numbers and doing so to grow bigger, stronger and faster, and become more polished athletes in high school. The lawmakers say athletes who redshirt are taking away opportunities from other athletes who matriculate through school at the proper pace. \n“Somebody gets hurt,” Codey said. “Somebody’s own development gets injured with these kids. They don’t look at it that way sometimes.” \nThe bill has generated widespread debate across New Jersey, where several high-profile athletes have redshirted, including two-time NCAA Division 1 wrestling champion Damion Hahn , McDonald’s All-American men’s basketball player Isaiah Briscoe and former Big East Conference football rookie of the year Brian Toal. \nThe New Jersey State Interscholastic Athletic Association — tasked with oversight for the bill — has expressed concern over enforcement of the legislation . The NJSIAA also maintains it has rules in place to deter redshirting at the high school level, including the requirement that athletes are not eligible if they turn 19 before Sept. 1 of their senior year. \nRELATED : N.J. wrestling legend Damion Hahn questions bill to penalize repeating athletes \n“I feel like it’s a parent’s right to do whatever they want with their kid’s education and I don’t think it’s my right to tell them what they should do,” said Bergen Catholic football coach Nunzio Campanile, who has players on his team who have redshirted. “If it gives a kid the opportunity to be more mature and a parent thinks that’s what they need for their kid to develop in the right way, I don’t see the downside to that. All of a sudden people are getting up in arms, but it’s been going on for 15 years at least.” \nCodey maintains redshirting hurts other athletes and limits opportunities for others. \n“This practice goes against the spirit of sportsmanship and is plain cheating,” Codey said in a press release issued Tuesday. “Through this legislation, we will ensure that unfair advantages are prevented so that athletes compete fairly and by the rules.”", "external_links": [], "published": "2015-10-20T21:46:00.000+03:00", "crawled": "2015-10-20T22:58:54.870+03:00", "highlightTitle": ""}