{"organizations": [], "uuid": "de6406573a0c47323b04768c9e95b37958296051", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.contracostatimes.com", "main_image": "http://extras.mnginteractive.com/live/media/site568/2015/1008/20151008_113108_SJM-CALFBC-0918-13.jpg", "site_section": "http://feeds.contracostatimes.com/mngi/rss/CustomRssServlet/571/200897.xml", "section_title": "Cal Sports", "url": "http://www.contracostatimes.com/sports/ci_28940301/cals-stefan-mcclure-helps-kids-at-juvenile-hall?source=rss", "country": "IL", "title": "Cal's Stefan McClure helps kids at juvenile hall", "performance_score": 0, "site": "contracostatimes.com", "participants_count": 1, "title_full": "Cal's Stefan McClure helps kids at juvenile hall", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T20:35:00.000+03:00", "replies_count": 0, "uuid": "de6406573a0c47323b04768c9e95b37958296051"}, "author": "Jeff Faraudo\n\njfaraudo@bayareanewsgroup.com", "url": "http://www.contracostatimes.com/sports/ci_28940301/cals-stefan-mcclure-helps-kids-at-juvenile-hall?source=rss", "ord_in_thread": 0, "title": "Cal's Stefan McClure helps kids at juvenile hall", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Cal's Stefan McClure helps kids at juvenile hall By Jeff Faraudo Posted: 10/08/2015 10:13:55 AM PDT Updated: 10/08/2015 10:35:39 AM PDT BearTalk blog BERKELEY -- Cal safety Stefan McClure knows the message he's trying to deliver doesn't always get through to kids he visits at the Alameda Juvenile Hall. But he keeps returning anyway, four times now, motivated by hope. \n\"It's one of those things where you try to just help out,\" said McClure, among a handful of Cal players who have made the trek to visit with teenagers who have strayed off path. \"Sometimes we don't know if we made a difference or not. They've got a lot of stuff going on in their lives. We're not going to fix everything. \n\"We just try to be a positive influence in their lives.\" \nMcClure is enough of a positive figure that he has been nominated for the Allstate American Football Coaches Association Good Works Team, which recognizes players from across the country who do community service. Cal Bears safety Stefan McClure (21) watches from the sideline during their practice at California Memorial Stadium in Berkeley, Calif., on Tuesday, Sept. 16, 2014. Cal is 2-0 in the Pac-12 conference so far this year. (Jane Tyska/Bay Area News Group) (JANE TYSKA) \nAmong the long list of organizations to which McClure gives his time is the juvenile hall, where he visits with kids ages 13 through 17. Most of them have run into trouble for stealing or fighting or truancy. \nMcClure comes in during lunch and sits down with four or five young men. He doesn't view himself as a hero, just another voice these kids might hear. \nSome of them will find out he plays football and respond with a story about how they once planned to do that. McClure tries to encourage them that it's not too late to pursue whatever their goals are. \n\"They stopped believing,\" said McClure, this week's Pac-12 defensive player of the week. \"You just try to speak some life into them and help them out. You tell those guys, 'You're 17 years old. You can go to a JC. You can still turn things around.' \" Advertisement \nNow and then, he's convinced he has gotten through to someone. \n\"You can just see it in their eyes that they're listening,\" he said. \"They know they messed up and are trying to get it back right. They're asking you questions. Those are the ones you feel like are getting the most out of it.\" For more on Cal sports, see the Bear Talk blog at ibabuzz.com/beartalk . Follow Jeff Faraudo on Twitter at twitter.com/Jeff Faraudo.", "external_links": [], "published": "2015-10-08T20:35:00.000+03:00", "crawled": "2015-10-09T06:06:55.449+03:00", "highlightTitle": ""}