{"organizations": [], "uuid": "53a69e8cbb410a4fbbb47fa46d8e9cf11cd322cc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deseretnews.com", "main_image": "http://img.deseretnews.com/images/article/hires/200/200.jpg", "site_section": "http://www.deseretnews.com/sports/index.rss", "section_title": "Sports news and headlines for the Utah Jazz, BYU Cougars, Utah Utes and high schools, Salt Lake City sports, Utah sports - Deseret News", "url": "http://www.deseretnews.com/article/865638075/High-school-football-Provo-defense-steps-up-big-to-take-down-Orem-24-21.html", "country": "US", "title": "High school football: Provo defense steps up big to take down Orem 24-21", "performance_score": 0, "site": "deseretnews.com", "participants_count": 1, "title_full": "High school football: Provo defense steps up big to take down Orem 24-21 | Deseret News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "53a69e8cbb410a4fbbb47fa46d8e9cf11cd322cc"}, "author": "Brandon Gurney", "url": "http://www.deseretnews.com/article/865638075/High-school-football-Provo-defense-steps-up-big-to-take-down-Orem-24-21.html", "ord_in_thread": 0, "title": "High school football: Provo defense steps up big to take down Orem 24-21", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Bulldogs continued their impressive season with a big 24-21 win over Region 7 rival Orem on Thursday.\nScoreboard » Orem Provo 21 24 See more stats » More Coverage Felt's Facts: How Canyon View turned its football program around “ It feels amazing. Our work is paying off like our coaches told us in the offseasonIt’s great to see it.”\nProvo quarterback Viliami Iongi\nPROVO — It's been a long time coming, but Provo football is again competing in October.\nThe Bulldogs took down Orem on Thursday 24-21 to push their record to 5-2 overall, and more importantly, 2-1 in Region 7 play.\n“It feels amazing,” said Provo senior quarterback Viliami Iongi after leaving a raucous postgame huddle. “Our work is paying off like our coaches told us in the offseasonIt’s great to see it.”\nWhile Iongi did plenty of good work leading the Provo offense, watching the work of the defense from the sidelines in the game's final minutes was enjoyable as anything for the senior.\nClinging to a 3-point lead, Orem set up at its own 39-yard line with 4:01 remaining. Sacks, knocked down passes and solid tackling forced the Tigers to punt with just over two minutes remaining.\nThe Provo offense sputtered during the ensuing possession, which ended in a punt, and another prime opportunity for Orem, this time from its own 34-yard line with 1:34 remaining.\nBut just as it did just minutes prior, the Bulldog defense bore down and stepped up.\nThe Tigers' chipped away with small gains and had a last gasp in a fourth and short situation at midfield with just over 20 seconds remaining, but again were unable to convert.\n“That was awesome,” Iongi said of the last two stands by Provo's defense. “They were just making plays left and right with sacks, forcing the (quarterback) to move out of the pocket — it was awesome.”\nProvo jumped out to a 21-7 lead right before the end of the first half with Iongi connecting with Ty Jones for a 19-yard touchdown pass and then to Paden Jorgensen for 77 yards. Daniel Kelly added six more with a 6-yard run with just over three minutes remaining in the first half.\nBut before Provo could cruise into the half with the momentum and a comfortable lead, Orem worked to upend the momentum and close the lead to 21-14. Quarterback Gunnar Legas hit freshman receiver Puka Nacua for a 28-yard touchdown pass to end the half on a high note.\nComing out of the half, the Bulldogs were determined to put the last second score behind it and start anew.\n“Our attitude at the half is that it’s zero to zero,” Iongi said. “We don’t care what the score is. We just go out and play like that.”\nIongi engineered a six minute, 80-yard drive to start the second half that culminated into a 25-yard field goal off the foot of Braiden Lovell and a 24-14 lead.\n“It was big,” said Provo coach Tony McGeary of his team's long drive to start the second half. “We knew we had to score some more points. Three (points) is all we got, but, fortunately, it was enough for the win.”\nOrem was paced by quarterback Gunnar Legas who threw for three touchdowns on the night, including two to receiver Kody Codner .\nWith the win, Provo now looks forward to taking on Alta in hopes of continuing its new role as a legitimate region contender.\n“We’re trying so hard to get it done and these guys believe in themselves,” McGeary said of getting his team to its current stage. “The coaching staff has been great, we had two of our best practices this past week and it was enough to get the win.”\nEmail: bgurney@desnews.com\nTwitter: @BrandonCGurney", "external_links": [], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-02T11:22:44.361+03:00", "highlightTitle": ""}