{"organizations": [], "uuid": "73be8aa8a574c2a898ca0f9d96fcecf9cc20bef2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bellinghamherald.com", "main_image": "http://www.bellinghamherald.com/static/images/bellinghamherald/facebook.jpg", "site_section": "http://www.bellinghamherald.com/sports/high-school/?widgetName=rssfeed&widgetContentId=712015&getXmlFeed=true", "section_title": "High School & Prep Sports News | BellinghamHerald.com &", "url": "http://www.bellinghamherald.com/sports/high-school/prep-football/article41299326.html", "country": "US", "title": "Ferndale’s King makes big contribution in win over Sehome", "performance_score": 0, "site": "bellinghamherald.com", "participants_count": 1, "title_full": "Ferndale’s King makes big contribution in win over Sehome", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T09:20:00.000+03:00", "replies_count": 0, "uuid": "73be8aa8a574c2a898ca0f9d96fcecf9cc20bef2"}, "author": "MICHELLE NOLAN \nFor The Bellingham Herald", "url": "http://www.bellinghamherald.com/sports/high-school/prep-football/article41299326.html", "ord_in_thread": 0, "title": "Ferndale’s King makes big contribution in win over Sehome", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ferndale’s King makes big contribution in win over Sehome \nGolden Eagles pick off four passes to stay alive for 3A district playoffs \nJackson King catches four passes for a 125 yards and two TDs and grabs an interception \nAustin Honeycutt finishes with 137 yards on 12 carries and three touchdowns \nBY MICHELLE NOLAN Order Reprint of this Story FERNDALE \nFor a senior who spent several weeks wondering if he would get the chance to contribute a second touchdown for Ferndale’s football team, Jackson King has cleaned up handsomely over the past two weeks. \nKing was one of four players with big numbers as Ferndale remained in the scramble for a Class 3A Northwest District playoff berth with a 49-7 win over Sehome on Friday, Oct. 23. \nKing caught four passes for a career-high 125 yards and two touchdowns, including a career-long 78-yarder for Ferndale’s third score, and also made one of the Golden Eagle’ four interceptions. \nKing — who scored his first career touchdown in the season’s second game — last week was honored as Ferndale’s top football-playing scholar, with recognition for his 3.98 grade-point average. But he said he couldn’t really enjoy it in the wake of Lynden’s 34-7 win. \n“I was hoping that (the academic honor) would not be the highlight in that Great American Rivalry game,” he said of the bittersweet honor. “Tonight, this is an awesome feeling.” \nKing set the tone with a 24-yard reception from sophomore quarterback James Hinson on the game’s first play. Austin Honeycutt capped a 69-yard, eight-play drive with an 18-yard touchdown run, Ferndale’s only score of the first quarter against a temporarily stubborn Sehome defense. \nHoneycutt, who finished with 137 yards on 12 carries and three touchdowns, scored Ferndale’s second touchdown on a 34-yard run following King’s outstanding 19-yard catch in traffic on a slant pattern. \nMoments later, Hinson unloaded a pretty pass to King, who made a nifty move to elude a defender on the way to his memorable 78-yard score. Hinson finished 8 for 16 for 162 yards, three touchdowns and no interceptions. \n“Jackson King just had a phenomenal effort,” Ferndale coach Jamie Plenkovich said. \nHinson’s 8-yard scoring pass to Winterhawk Leighton 12 seconds before halftime gave the Golden Eagles (5-3, 4-2 NWC 2A/3A) a 35-0 lead and a first-half total yardage advantage of 319 yards to 48 for Sehome (2-6, 1-5). \nThe fourth offensive standout for Ferndale was sophomore running back Cole Semu, who gained 116 yards on 14 rushes, including a 48-yard touchdown in the second quarter. \nSehome quarterback Jace Rinker scored on a 36-yard scramble on the first series of the second half. He netted 60 yards rushing, although Ferndale defensive Christian Rodriguez sacked him three times, and Rinker finished with 86 passing yards. Rinker accounted for 146 of Sehome’s 189 total yards. \nPlenkovich said a win over Sedro-Woolley on Friday, Oct. 30, would assure the Golden Eagles of the district playoffs. \n“There are still so many variables (otherwise),” he said. \nFerndale’s four interceptions were by Taylor Bellefeuille (who caught a deflection by fellow defender Kyler Schemstad) King, Honeycutt and Semu. \n“I figured I would make some good blocks and a few first downs this season,” said King, who missed his sophomore season with an injury. “This is beyond my expectations.” \nSehome", "external_links": [], "published": "2015-10-24T09:20:00.000+03:00", "crawled": "2015-10-24T12:42:07.497+03:00", "highlightTitle": ""}