{"organizations": [], "uuid": "f8b041b0289744184dd3900371ec5234d51d9b9b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/47529300.cms", "site_section": "http://timesofindia.indiatimes.com/sports/football/champions-league/articlelist/40924344.cms", "section_title": "Top Stories - Champions League - Football - Sports - The Times of India", "url": "http://timesofindia.indiatimes.com/sports/football/champions-league/top-stories/Sanchez-key-to-Arsenal-Euro-hopes-Walcott/articleshow/49133267.cms", "country": "IL", "title": "Sanchez key to Arsenal Euro hopes: Walcott", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "Sanchez key to Arsenal Euro hopes: Walcott - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "f8b041b0289744184dd3900371ec5234d51d9b9b"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/sports/football/champions-league/top-stories/Sanchez-key-to-Arsenal-Euro-hopes-Walcott/articleshow/49133267.cms", "ord_in_thread": 0, "title": "Sanchez key to Arsenal Euro hopes: Walcott", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON: Theo Walcott says Alexis Sanchez's ability to reproduce the form that terrorised Leicester holds the key to Arsenal's success in the Champions League.\nSanchez netted a brilliant hat-trick to inspire Arsenal's 5-2 thrashing of Leicester on Saturday.\nThe Chile winger hadn't scored for the Gunners since their FA Cup final win over Aston Villa in May and his early season form had been patchy as he struggled to recover from the draining experience of leading his country to the Copa America title in the close-season.\nBut Walcott believes the former Barcelona star's scintillating display at Leicester proved he is back in the groove just in time for a crucial Champions League clash with Greek side Olympiakos on Tuesday.\n\"I am sure he is going to flourish now with many, many more important goals. It has been a long time coming, he knows that himself. But he is very pleased,\" Walcott said.\n\"He is a top-quality player and even when he is not scoring goals he works so hard for us. He tracks back and does a lot for the team.\"\nGunners boss Arsene Wenger agrees Sanchez is back to his world-class best.\n\"He is back to his level. He won a big competition with Chile -- the Copa America -- and to adjust again to a competitive level when you come back takes some time,\" Wenger said.\n\"We could see in training already a different player in the last week or two.\"\nWalcott was also on the scoresheet with the Gunners' first goal as they came from behind at the King Power Stadium to end Leicester's unbeaten run in emphatic fashion.\nWenger's side are now just three points behind Premier League leaders Manchester United, who they host next Sunday.\nBut before that summit meeting, the north Londoners must focus on Europe as they look to revive their Champions League campaign when Olympiakos visit the Emirates Stadium.\nThe Gunners slumped to a 2-1 defeat in their opening Group F fixture at Dinamo Zagreb, where Olivier Giroud was sent off in the first half.\nThat loss leaves little margin for error against the Greeks, so the pressure will be on Walcott if Wenger once again deploys him as Arsenal's lone central striker.\nWalcott impressed in that position at Leicester and, with 12 goals in his last 13 Arsenal starts, he believes it was one of his best displays since a serious knee injury last year.\n\"It will be up there since the knee injury and, before that, the Tottenham game,\" he said.\n\"I have always said I want to play up front. The manager has had faith in me and I just want to repay him.\"\nWenger's side certainly won't be able to use unfamiliarity as an excuse if they slip up against Olympiakos as they have faced the Greeks in the group stages in three of the past six Champions League campaigns.\nArsenal are unbeaten in eight home games against Olympiakos, winning six and drawing two.\nMarco Silva's men started their European campaign with a lacklustre 3-0 home defeat against Bayern Munich.\nAnd Wenger remains confident of progress to the knockout stages as long as they win all three of their matches at the Emirates.\n\"Mathematically we can qualify without any problem if we can produce our performances that we want at home,\" he said.", "external_links": [], "published": "2015-09-28T03:00:00.000+03:00", "crawled": "2015-10-10T17:14:19.084+03:00", "highlightTitle": ""}