{"organizations": ["Seneca Indians", "Groton Watkins Glen/Odessa-Montour", "Groton"], "uuid": "6315305684c74a6349247102c0ae3a281158705b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stargazette.com", "main_image": "http://www.gannett-cdn.com/-mm-/bfaec063da2294fe0003311673e987611037925b/c=0-98-1998-1227&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/16/CNYGroup/Elmira/635806263768638284-ELM-Seneca-Groton-Football-01.JPG", "site_section": "http://rssfeeds.stargazette.com/elmira/sports", "section_title": "Elmira - Sports", "url": "http://www.stargazette.com/story/sports/high-school/2015/10/16/high-school-roundup-wgo-m-wins-sixth-straight/74019412/", "country": "US", "title": "High school roundup: WG/O-M wins sixth straight", "performance_score": 0, "site": "stargazette.com", "participants_count": 0, "title_full": "High school roundup: WG/O-M wins sixth straight", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T05:18:00.000+03:00", "replies_count": 0, "uuid": "6315305684c74a6349247102c0ae3a281158705b"}, "author": "", "url": "http://www.stargazette.com/story/sports/high-school/2015/10/16/high-school-roundup-wgo-m-wins-sixth-straight/74019412/", "ord_in_thread": 0, "title": "High school roundup: WG/O-M wins sixth straight", "locations": ["Groton"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ian Chedzoy", "Dione Martin", "Andrew Legare"], "text": "High school roundup: WG/O-M wins sixth straight Andrew Legare, alegare@stargazette.com | @SGAndrewLegare 10:18 p.m. EDT October 16, 2015 Ian Chedzoy ran for five touchdowns in Seneca Indians' 42-12 victory over Groton Watkins Glen/Odessa-Montour's Ian Chedzoy carries the ball for a first down as Groton's Dione Martin can't bring him down during the first half of their game Friday evening in Groton. (Photo: SIMON WHEELER / Staff Photo) CONNECT 4 TWEET LINKEDIN COMMENT EMAIL MORE \nIan Chedzoy ran for five touchdowns Friday night as the Watkins Glen/Odessa-Montour football team rolled to its sixth consecutive victory, 42-12, in a non-division game at Groton. \nChris Foote capped the scoring for WG/O-M (6-1) with a 55-yard interception return. Chedzoy scored three touchdowns in the first half as the Seneca Indians, ranked 25th in the state in Class C, built a 20-6 halftime advantage. \nWatkins Glen/O-M is scheduled to host Lansing on Oct. 24 at Watkins Glen High School in a game that will decide the Division V champion in the Section 4 Football Conference. Lansing was forced to forfeit this week's game against Chenango Forks because of a lack of healthy players and will make a determination Monday if it can play next week. \nGroton fell to 4-3. \nBinghamton 41, Corning 34 : A 6-yard touchdown pass from John Petrucci to Deante Witherspoon with 33 seconds remaining helped Binghamton pull out a Section 4, Division 1 win over visiting Corning. \nThe victory clinched the No. 2 seed for the Section 4 Class AA semifinals for Binghamton (5-2, 3-1 Division 1), which earned the right to host Corning (4-3, 2-2) in that game in two weeks. \nCorning took a 34-33 lead with 3:08 left on a 27-yard touchdown pass from John Dobson to Danny Madden. A 61-yard touchdown pass from Dobson to Madden brought the Hawks within 33-28. \nCorning's Devon Sullivan caught a 36-yard touchdown pass from Dobson and ran 1 yard for a touchdown, but he was knocked out of the game in the second quarter with an apparent ankle injury. Ali Muhammad added a 12-yard touchdown run for Corning in the third quarter to cut the Patriots' lead to 27-21. \nWaverly 42, Windsor 6 : Waverly improved to 6-1 and clinched a berth in the Section 4 Class B semifinals with a Division IV victory over visiting Windsor. \nCross country \nExpress girls win at Newark Valley : Abbey Wheeler finished first by well over a minute with a time of 18 minutes, 1.7 seconds to lead Elmira to the varsity A team title at the Bob Greene Invitational at Newark Valley. Elmira had 36 points to beat out the 55 of of Horseheads, which got a third-place finish from Taeli Quanz and a fourth-place effort from Alexi Deiseroth. \nMaine-Endwell won the varsity A boys with 24 points, followed by Corning with 68. Elmira's Ben Cardamone III took fourth in 16:47.1, with M-E's Dan Schaffer winning in 16:02.3. \nGirls swimming \nHorseheads 55, Union-Endicott 44: Rachel Wallisky won the 200-yard free freestyle (2:06.02) and 500 freestyle (5:37.51) for Horseheads in a Southern Tier Athletic Conference victory at Union-Endicott. Other individual winners for Horseheads were Mia Hanson in the 200 individual medley, Cameron Murray in diving, Maddy Rogan in the 100 freestyle and Marissa Telech in the 100 backstroke. \nMaine-Endwell 97, Corning 83 : Corning's Stephanie Li broke her own pool record in the 100-yard breaststroke with a time of 1 minute, 8.78 seconds in the Hawks' home loss to STAC foe Maine-Endwell. Li's old mark of 1:08.95 was set earlier this season. \nSoccer \nSection 4 pairings announced . The Elmira High girls and both Elmira Notre Dame teams have earned top seeds for the Section 4 soccer tournaments. \nTwo-time defending champion Elmira (11-2-1) has a bye into the finals, which will be played at 7 p.m. Oct. 30 at Waverly High School. Elmira plays the winner of the semifinal between second-seeded Corning (9-5) and third-seeded Horseheads (8-4-2), which is set for 7 p.m. Oct. 22 at Corning. \nThe Notre Dame boys (14-0) are seeded first in Class C and will host either No. 8 Unatego or No. 9 Spencer-Van Etten in a quarterfinal at 3:30 p.m. Oct. 24. Also in Class C, 10th-seeded Odessa-Montour (7-8) plays at No. 7 Marathon (11-3) in a first-round game at 3:30 p.m. Oct. 21. \nNotre Dame's girls (13-0) are also the top seed in Class C. The Crusaders host either No. 8 Candor or No. 9 Sidney in a quarterfinal at 3:30 p.m. Oct. 23. Fifth-seeded Odessa-Montour hosts No. 12 Bainbridge-Guilford in the opening round at 3:30 p.m. Oct. 20. \nCorning (5-7-2) is seeded second among Class AA boys and will face top-seeded Ithaca (14-0) in the title game at a to-be-determined time Oct. 31 at the Wright Soccer Fields in Oneonta. No other teams qualified in Class AA. \nIn Class B quarterfinals, the fourth-seeded Waverly boys (11-4) host No. 5 Chenango Forks at 6:30 p.m. Oct. 21; and the sixth-seeded Waverly girls (9-4) play at No. 3 Susquehanna Valley at 3:30 p.m. Oct. 20. \nGirls volleyball \nWatkins Glen 3, Candor 2 : At Candor on Thursday, Watkins Glen clinched the Interscholastic Athletic Conference South Large School title with a 22-25, 25-16, 25-22, 21-25, 25-20 victory over Candor. Amanda Pike had 16 kills, 11 digs and six blocks for Watkins Glen (11-3). \nOn Twitter: @SGAndrewLegare Read or Share this story: http://stargaz.tt/1RNxn2I TOP VIDEOS", "external_links": [], "published": "2015-10-17T05:18:00.000+03:00", "crawled": "2015-10-17T05:42:09.584+03:00", "highlightTitle": ""}