{"organizations": [], "uuid": "f9bd6be3e0459a4da4507d9ffcf6cfe3468d3092", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.yourhoustonnews.com", "main_image": "http://bloximages.chicago2.vip.townnews.com/yourhoustonnews.com/content/tncms/assets/v3/editorial/f/dd/fdda4a11-5ffc-59f9-8aee-76215d841719/562705c33e81a.image.jpg?resize=760%2C507", "site_section": "http://www.yourhoustonnews.com/search/?q=&t=article&l=25&d=&d1=&d2=&s=start_time&sd=desc&c[]=bay_area/sports*&f=rss", "section_title": "Your Houston News - bay area/sports", "url": "http://www.yourhoustonnews.com/bay_area/sports/volleyball-clear-creek-tops-clear-springs-in-five-sets/article_ea414a4f-8a4c-5919-bd70-bca2a68a09c8.html", "country": "US", "title": "Volleyball: Clear Creek tops Clear Springs in five sets", "performance_score": 0, "site": "yourhoustonnews.com", "participants_count": 1, "title_full": "Volleyball: Clear Creek tops Clear Springs in five sets", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T06:18:00.000+03:00", "replies_count": 0, "uuid": "f9bd6be3e0459a4da4507d9ffcf6cfe3468d3092"}, "author": "Ted Dunnam", "url": "http://www.yourhoustonnews.com/bay_area/sports/volleyball-clear-creek-tops-clear-springs-in-five-sets/article_ea414a4f-8a4c-5919-bd70-bca2a68a09c8.html", "ord_in_thread": 0, "title": "Volleyball: Clear Creek tops Clear Springs in five sets", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "KIRK SIDES Volleyball: Clear Creek tops Clear Springs in five sets \nClear Creek head coach Scott Simonds and the Lady Wildcats celebrate a point against Clear Springs Tuesday night. KIRK SIDES Volleyball: Clear Creek tops Clear Springs in five sets \nClear Springs volleyball players celebrate a point in the team's match Tuesday night at Clear Creek. KIRK SIDES Volleyball: Clear Creek tops Clear Springs in five sets \nClear Creek celebrates its five-set victory over Clear Springs to wrap up the No. 1 playoff seed from District 24-6A. KIRK SIDES Volleyball: Clear Creek tops Clear Springs in five sets \nClear Springs players react to a point that didn't go their way Tuesday night in a key District 24-6A volleyball match against Clear Creek. KIRK SIDES Volleyball: Clear Creek tops Clear Springs in five sets \nClear Springs' Devyn Murphy (4) digs deep to make the set against Clear Creek Tuesday. KIRK SIDES Volleyball: Clear Creek tops Clear Springs in five sets \nClear Springs' Elizabeth Armstrong (16) and Lauren Burt (1) go high to block a shot from Clear Creek's Caitlyn Burroway (13) Tuesday. KIRK SIDES Volleyball: Clear Creek tops Clear Springs in five sets \nClear Creek's Maddie Flora (23) digs the ball against Clear Springs Tuesday. KIRK SIDES Volleyball: Clear Creek tops Clear Springs in five sets \nClear Springs' Cameron Edwards (13) goes high to serve against Clear Creek Tuesday. KIRK SIDES Volleyball: Clear Creek tops Clear Springs in five sets \nClear Creek's Mariah Pardo (25) and Hannah Froeschl (12) try to block a shot from Clear Springs' Lauren Burt (1) Tuesday. Advertisement Volleyball: Clear Creek tops Clear Springs in five sets By Ted Dunnam Houston Community Newspapers \nIf there are many better teams in the Class 6A volleyball playoffs than the Clear Springs Lady Chargers, then Clear Creek head coach Scott Simonds probably isn’t too eager to encounter them. \nFor the second time this season, Clear Creek found itself teetering on the precipice, pushed to the brink of defeat once again by Springs. \nAgain, though, the Lady Wildcats resurrected themselves to claim a 22-25, 22-25, 25-21, 25-23, 15-8 win in a District 24-6A thriller Tuesday night in Carlisle Fieldhouse. \nThe win wrapped up at least a co-championship for the Lady Wildcats and assured them of the No. 1 seed entering the post-season. \nThe triumph of Springs came, for the second time, after the Lady Chargers built a two-sets-to-none lead. \nCreek (37-5, 12-0) never trailed in the decisive fifth set and was powered by junior outside hitter Caitlin Burroway, who hammered three consecutive kills to take the Lady Wildcats from a 10-7 lead to a 13-7 cushion. \nAfter an error made the score 13-8, Burroway delivered another winner before Creek won the match on a Caroline Reed putaway. \nSprings, which will enter the Class 6A playoffs as the District 24-6A runner-up, was ever-so-close to pulling off the big win, which would have thrown the district race into a tie. \nAfter claiming the first two sets, Springs built an 18-13 lead in the fourth set on consecutive winners from middle blocker Lauren Burt. \nCreek, though, wouldn’t go away. \nThe Lady Wildcats fought back to 18-17 before a Cameron Edwards kill put Springs up 19-17. \nAfter Creek tied the game, the Lady Wildcats celebrated prematurely on a point they thought was over. \nThe ball, however, was still alive and Springs won the point for a 20-19 lead. \nThe lead see-sawed back and forth and was tied for the last time when Springs’ Kylie Jedlicka delivered a winner to tie Game 4 at 23. \nJust two points away from a four-set win, the Lady Chargers instead saw Creek’s Melissa McNeil deliver a winner before Springs unwisely let a McNeil serve fall in for an ace on set point. \nThat door-opener provided the necessary momentum for Creek to run away with game five. \n“We knew we could play better ,” said Burroway of her team facing a two-set deficit. “Down 18-13 in the fourth, we knew we had to turn it on right then and there. \n“I think our hitters decided we all needed to pull it together. Mariah (Pardo) started spreading it out a little more, and we were more effective. \n“Springs is definitely very good, and it would be crazy if we saw them again. I think we were just the more mentally tough team tonight.” \nAn emotionally-drained Shannon McLellan, head coach of Clear Springs, found another five-set loss to Creek tough to swallow. \n“It’s real hard to beat Creek, especially on their home court,” McLellan said. “We knew that we needed to play well. \n“Devyn (Murphy) had a great game, defensively. Lauren (Burt) did a fantastic job blocking, and Cameron (Edwards) also did a great job closing the block and getting good touches on defense. \n“It’s just a few points we need to clean up. I plan on seeing them again in the playoffs.” \nElizabeth Armstrong, Jedlicka and Burt helped close out the Game 1 win for Springs, while in Game 2, the Lady Chargers had to rally from a 6-0 deficit. \nA Jedlicka kill put Springs up 23-20 before Hannah Froeschl delivered consecutive winners for Creek to make it 23-22. \nSprings, though, won the game to take a two-set lead on a winner from Camryn Cadenhead, and a tandem block from Burt and Cadenhead. \nIn game three, Creek led just 17-16 when Pardo hit two straight winners and Froeschl had a put-away for a 20-16 Lady Wildcat lead. \nFrom there, Springs could get no closer than three points, and Creek won the game on winners from Allie Garland and McNeil. \n“This was very, very similar to the last match we played,” Creek head coach Scott Simonds said. “When you get in those situations where it seems like nothing’s going right, you have to find that calm place. \n“You can’t play volleyball when you’re tense. This sport doesn’t work that way. It’s also such a sport of momentum. \n“When we took it into that fifth game, I think we felt pretty confident.” \nSimonds said he knew he had to make changes or the match would have been over in straight sets. \n“I switched Burroway from the right side to outside and she stepped up,” Simonds said. “Allie Garland played, really, really well for us. \n“Our (defensive specialists) also came alive, and they had to because Mariah was running all over the place. When we’re passing well, we’re tough to beat, and we finally got that going. \n“Springs is unbelievably tough. Shannon’s doing a great job over there and this is the best team they’ve ever had.” \nBurroway, McNeil and Froeschl combined for 50 kills while the ever-present Pardo had 56 assists. \n“This is 10 district championships in 15 years,” Simonds said. “We’ve been split twice with Springs and Falls opening and to keep that going from an enrollment of 4,300 to 2,100...it’s tough to accomplish.”", "external_links": [], "published": "2015-10-21T06:18:00.000+03:00", "crawled": "2015-10-21T11:18:15.585+03:00", "highlightTitle": ""}