{"organizations": [], "uuid": "7d339873de2e36e71c72b6bf11787d268f4f8f8e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sentinel-standard.com", "main_image": "http://www.sentinel-standard.com/storyimage/MI/20151008/SPORTS/151009164/AR/0/AR-151009164.jpg", "site_section": "http://www.sentinel-standard.com/sports?template=rss&mime=xml", "section_title": "Sports - Ionia Sentinel - Standard-Ionia, MI", "url": "http://www.sentinel-standard.com/article/20151008/SPORTS/151009164/2000/NEWS?rssfeed=true", "country": "US", "title": "Raiders capture Division 4 Regional tennis title", "performance_score": 0, "site": "sentinel-standard.com", "participants_count": 1, "title_full": "Raiders capture Division 4 Regional tennis title", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T06:44:00.000+03:00", "replies_count": 0, "uuid": "7d339873de2e36e71c72b6bf11787d268f4f8f8e"}, "author": "Chris Zadorozny chris.zadorozny@sentinel-standard.com", "url": "http://www.sentinel-standard.com/article/20151008/SPORTS/151009164/2000/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "Raiders capture Division 4 Regional tennis title", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Raiders capture Division 4 Regional tennis title On a semi-cool and fall-like morning, the Portland Raiders hosted the Division 4, Region 29 MHSAA Boy’s Tennis Regional on Thursday. They also came out with a two-point victory and regional championship, en route to another state finals appearance. Comment Posted Oct. 8, 2015 at 9:01 PM Updated at 10:44 PM Posted Oct. 8, 2015 at 9:01 PM Updated at 10:44 PM PORTLAND - On a semi-cool and fall-like morning, the Portland Raiders hosted the Division 4, Region 29 MHSAA Boy’s Tennis Regional on Thursday. They also came out with a two-point victory and regional championship, en route to another state finals appearance. Portland captured four different flight champions while having runner-ups in three others. Only one flight finished below runner-up. They defeated the Williamston Hornets by just two points. Portland won with 27 points while Williamston had 25 points. Coming in third place, Lansing Catholic with 16 points followed by Lansing Christian-Leslie with 15 points in fourth place. Leading the way for Portland, the number one doubles team of Cole Schneider and Trevor Trierweiler. They were ranked first in their flight. They took down Alma in two sets, 6-0, 6-1 and then Lansing Catholic in the semifinals in two sets, 6-2, 6-0. In the championship, they defeated Williamston in two sets, 6-1, 6-1. Number three singles, Connor Davis defeated Lansing Catholic in two sets, 6-3, 6-1 and took down Williamston in three sets in the semifinals, 7-5, 4-6 and 6-3. In the championship, he defeated Ovid-Elsie in two sets, 6-3, 6-1. The number four doubles team also took home a flight championship, the team of Jarrett Hoppes and Ryan Lefke. In the second round they took down Corunna in two sets, 6-0, 6-0 and Williamston in two sets in the semifinals, 6-1, 6-1. In the flight championship, they defeated Lansing Catholic 6-3, 7-5 in two sets. In the number two singles, Jared Schrauben was the runner-up, due to injury unfortunately. In the first matchup, he defeated Alma in two sets, 6-0, 6-3. In the semifinals, he won over Lansing Catholic in two sets, 6-7(2), 6-3 by injury defeat. He lost in the championship due to injury, 6-3, 2-1 to Williamston. The number two doubles team of Ryan Elliott and Blake Guy were runner-up. In the first match of the day, they defeated Ithaca, 6-2, 6-1. In the semifinals, they won in two sets, 6-0, 6-4 and in the championship match, they lost a hard fought match, 6-2, 7-6(5). In the number three doubles match, Sam Linebaugh and Jack Lufkin were also runner-ups. Ranked first in the flight, they won their first match in two sets, 6-0, 6-0 over Ovid-Elsie. In the semifinal, they took down Lansing Catholic, 6-3, 6-4. In the championship match, they lost to Williamston in a hard fought three-set match, 6-4, 4-6 and 6-4. Finally, in the number one singles match, Bailey VanHouten lost in the semifinal to Lansing Catholic, 7-5, 6-0. He won his first match over Durand, 6-2, 6-0. Page 2 of 2 - Now Portland will head to Kalamazoo College on October 16 and 17 for the Division 4 MHSAA Boy’s State Finals. Follow Sports Editor Chris Zadorozny on Twitter @ZadsISS. By Chris Zadorozny", "external_links": [], "published": "2015-10-09T06:44:00.000+03:00", "crawled": "2015-10-09T08:11:06.594+03:00", "highlightTitle": ""}