{"organizations": [], "uuid": "aa7191143ac5fe0f24fea4770a15352d2fc5744c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.middletowntranscript.com", "main_image": "http://www.middletowntranscript.com/storyimage/DE/20151009/SPORTS/151009706/AR/0/AR-151009706.jpg", "site_section": "http://www.middletowntranscript.com/sports?template=rss&mime=xml", "section_title": "Sports - Middletown Transcript", "url": "http://www.middletowntranscript.com/article/20151009/SPORTS/151009706/2000/NEWS?rssfeed=true", "country": "US", "title": "SHELTON ON FITNESS: Four excuses for not getting fit and why they're not true", "performance_score": 0, "site": "middletowntranscript.com", "participants_count": 1, "title_full": "SHELTON ON FITNESS: Four excuses for not getting fit and why they're not true", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T22:31:00.000+03:00", "replies_count": 0, "uuid": "aa7191143ac5fe0f24fea4770a15352d2fc5744c"}, "author": "Frank Shelton", "url": "http://www.middletowntranscript.com/article/20151009/SPORTS/151009706/2000/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "SHELTON ON FITNESS: Four excuses for not getting fit and why they're not true", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SHELTON ON FITNESS: Four excuses for not getting fit and why they're not true Every time someone chooses the status quo over a healthier life, one of several excuses is trotted out to justify the decision. Here are four common excuses that need to be put to rest once and for all. Comment By Frank Shelton Posted Oct. 9, 2015 @ 2:31 pm Every time someone chooses the status quo over a healthier life, one of several excuses is trotted out to justify the decision. Here are four common excuses that need to be put to rest once and for all: 1. “I don’t have time to exercise.” There are 168 hours in a week. If you’re too busy to dedicate three or four of those to fitness, you need to examine your life and make some changes. Anybody who is that busy has a schedule that is unsustainable. But those who say they’re too busy for fitness are probably wasting those three or four (or more) hours on less meaningful pursuits like TV and social media. They could find the time to better themselves, but they choose not to. The trick is to schedule time for exercise just like you would anything else that’s really important in your life. 2. “I don’t have enough money for exercise.” Do you have a smart phone? How much does that cost you a month? Cable TV? What’s the monthly cost for that? How often do you stop at a donut shop for coffee or a convenience store for junk food? Movies? Drinks on Friday night? You could get through life without any of those things. But if you don’t have good health, it will catch up with you eventually. Set your priorities. If good health is one of them, give up something else and put that money toward a gym membership and a personal trainer. 3. “I don’t like to exercise.” Some people enjoy lifting weights and running on a treadmill more than others. But everybody enjoys the benefits of those activities: more energy, a healthier weight, fewer illnesses, a better body, and a longer and more productive life. Exercise was not created for you to enjoy. The goal is not to have fun. The goal is to improve your health. The funny thing is, once you start exercising and seeing and feeling the improvements, you’ll find that you do enjoy it. 4. “Exercise doesn’t work for me.” Trainers hear many variations of that excuse on a daily basis: “Every time I try to exercise, I end up feeling worse.” That’s because you’re not doing it right. “I just can’t seem to lose this weight” That’s because you’re not trying hard enough. Fitness training, like anything else in life, provides benefits directly proportional to the amount of effort you put in. If you go to the gym a few times, and put in minimal effort, then, no, it’s not going to “work for you.” But if you commit yourself to the goal, set aside the time it requires and work hard on it, success is guaranteed. Excuses are easy to find. Results require more work. But the rewards are worth the effort. Frank Shelton is a certified fitness trainer and owner of Shelton Fitness. He can be reached at (302) 463-4000 or frank@franksheltonfitness.com.", "external_links": [], "published": "2015-10-09T22:31:00.000+03:00", "crawled": "2015-10-09T23:25:29.004+03:00", "highlightTitle": ""}