{"organizations": [], "uuid": "896ea0526c523d1ab6fb2efb23e619c3ba75c2ec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "http://www.bostonherald.com/sites/default/files/blog_posts/101415patsjw04.jpg", "site_section": "http://bostonherald.com/sports/patriots_nfl", "section_title": "Sports: Patriots &amp; NFL | Boston Herald", "url": "http://bostonherald.com/sports/patriots_nfl/the_blitz/2015/10/tom_brady_wont_admit_to_extra_motivation_to_beat_colts", "country": "US", "title": "Tom Brady won't admit to extra motivation to beat Colts | The Blitz | with Jeff Howe & Karen Guregian", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "Tom Brady won't admit to extra motivation to beat Colts | The Blitz | with Jeff Howe & Karen Guregian | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "896ea0526c523d1ab6fb2efb23e619c3ba75c2ec"}, "author": "Adam Kurkjian", "url": "http://bostonherald.com/sports/patriots_nfl/the_blitz/2015/10/tom_brady_wont_admit_to_extra_motivation_to_beat_colts", "ord_in_thread": 0, "title": "Tom Brady won't admit to extra motivation to beat Colts | The Blitz | with Jeff Howe & Karen Guregian", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "FOXBORO — It's Colts week. Finally.\nPats quarterback Tom Brady gets his chance to exact revenge on the organization that nearly kept him off the field for four games over a deflated ball scandal in last year's AFC title game.\nAlthough the league suspension was wiped out on appeal by district court Judge Richard Berman before the season, it's safe to assume that Brady would have a little extra motivation Sunday night in Indianapoilis.\nBut if he did, Brady wasn't revealing it during his weekly press conference at Gillette Stadium.\n\"I'm always pretty motivated,\" he said. \"It'll be an exciting game. I know they've got a good team. They've won three straight. They made some changes this offseason, so they're a very confident team. So it's going to take a great effort to beat them, so we'll work hard at practice today, over the next few days, hopefully get us prepared, and then go out and try to beat a good team on the road on Sunday night.\"\nStill, with a game of this magnitude, one has to think that maybe, just maybe, even the unflappable Brady could be thrown off his game. This is the team that caused his offseason to be embroiled in a courtroom drama and his integrity to be questioned, after all.\nSo, wouldn't it be a little tougher to remain focused?\n\"Well, I try certainly, to be a professional with how I approach every week,\" he said. \"I said yesterday, you know, you really put a lot into it every week no matter who you're playing because all these games are important. All of them are hard to win. All of them have good players. They're all pros. They've got pro coaches, and they've got good schemes. So you really put a lot into every week, and if you don't, then you don't have much opportunity to win. So I think you just try to approach each week as a professional. You give it your all. You do the best you can do, and hopefully it leads to positive outcomes when it matters, which is on game day.\"\nPressed further on the issue, Brady remained steadfast.\n\"Well, like I said, I'm always pretty motivated regardless of the opponent, regardless of the team or the week, whether it's a preseason game, whether it's a regular season game,\" he said. \"They're all important because there are so few of those where you get an opportunity in your life, so I don't take it for granted. I think it's exciting to go out there and do something that I love to do, to go out there and do it with teammates who I love to play with. We all put a lot of effort in, the coaches, players, so it's another opportunity for us to go out there and see if we can be a good football team.\"\nIn another attempt, a reporter asked, \" Isn't there any human part of you that wants it a little extra this week?\"\n\"I'm a human,\" Brady said. \"There's no doubt. I'm definitely human.\"\nThen that's established. Brady is a human. He's just not one who wants to give an inch on this topic.\n\"I'm not sure (if it means more to the fans),\" Brady said. \"As a player, I think you're just ... Like I said, they're a very good team, and it's a challenge to play them on the road. We've been there a few times. They've got a good team. They've won three straight, so it will be a tough game. And hopefully, we're at our best.\"", "external_links": [], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-14T20:57:27.542+03:00", "highlightTitle": ""}