{"organizations": ["AP", "RM Sotheby"], "uuid": "326aa83017adf37978077a03e90b98aa853963a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fox23.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/19/e9/e7/3fb5e69952c64ef4aaeae8977bb91984-0e5f4e2c6c80466288061dfd16c4029c-0.jpg", "site_section": "http://www.fox23.com/list/rss/ap/sports-update/ak5/", "section_title": "Sports Update", "url": "http://www.fox23.com/ap/ap/sports/historic-1956-ferrari-race-car-could-bring-28m-at-/nn5qC/", "country": "US", "title": "Historic 1956 Ferrari race car could bring $28M at auction", "performance_score": 0, "site": "fox23.com", "participants_count": 0, "title_full": "Historic 1956 Ferrari race car could bring $28M at auction", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T20:09:00.000+03:00", "replies_count": 0, "uuid": "326aa83017adf37978077a03e90b98aa853963a7"}, "author": "", "url": "http://www.fox23.com/ap/ap/sports/historic-1956-ferrari-race-car-could-bring-28m-at-/nn5qC/", "ord_in_thread": 0, "title": "Historic 1956 Ferrari race car could bring $28M at auction", "locations": ["New York City", "New York", "NEW YORK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tim Scott Fluid Images/Sotheby", "Juan Manuel Fangio"], "text": "Updated: 12:09 p.m. Monday, Oct. 19, 2015 | Posted: 12:09 p.m. Monday, Oct. 19, 2015 Historic 1956 Ferrari race car could bring $28M at auction ﻿ View Larger This undated photo provided by RM Sotheby's in New York shows a 1956 Ferrari 290 MM by Scaglietti, built for Formula One legend Juan Manuel Fangio, that is going on the auction block in New York City where it could sell for more than $28 million. RM Sotheby’s says the Ferrari, chassis 0626, will be offered on Dec. 10, 2015, as part of its “Driven by Disruption” sale. (Tim Scott Fluid Images/Sotheby's via AP) Sponsored Links   NEW YORK — \nA 1956 Ferrari built for Formula One racing legend Juan Manuel Fangio is going on the auction block in New York City, where it could sell for more than $28 million. \nRM Sotheby's says the Ferrari 290 MM, chassis 0626, will be offered on Dec. 10 as part of its \"Driven by Disruption\" sale. \nThe historic car never crashed despite a racing career that that lasted until 1964. \nThe $28 million pre-sale estimate makes it one of the most valuable cars to come to auction. A Ferrari 250 GTO Berlinetta that sold for $38.1 million at Bonhams in 2014 holds the record for any car at auction. \nFangio, an Argentinian considered one of the greatest Formula One drivers of all time, raced the 3.5-liter, V-12 engine car in the 1,000-mile Mille Miglia event, finishing fourth overall in a race that wound all through Italy. \nThe car was specially designed for the five-time F1 world champion and was one of only four 290 MMs to be built. \nThe red car with a blue nose competed in many other classic races. \nIn 1957, legendary drivers Eugenio Castellotti, Luigi Musso and Masten Gregory drove it to victory in the Buenos Aires 1000 KM. \nRM Sotheby's says the 0627 was purchased in 1957 by enthusiast Temple Buell who continued to enter it into races around the world with Jo Bonnier and Gregory behind the wheel. \nIt eventually as acquired by collector Pierre Bardinon and remained in his renowned Mas du Clos Collection in France for nearly 34 years before being acquired by the current owner, identified only as a private European collector. \nThe auctioneer says the car has its original chassis, matching-numbers engine, gearbox and body. Copyright   Sign up for our FOX23 News This Morning Newsletter Sign Up", "external_links": [], "published": "2015-10-19T20:09:00.000+03:00", "crawled": "2015-10-20T06:03:24.632+03:00", "highlightTitle": ""}