{"organizations": [], "uuid": "b769cef6b9a0637391948e4aa1ed750d41bc2abd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.idsnews.com", "main_image": "http://duvq7ua50whdw.cloudfront.net/20151014QyeoL4yWsx/dist/img/IDS-fb-icon.png", "site_section": "http://www.idsnews.com/section/sports", "section_title": "Sports | Indiana Daily Student", "url": "http://www.idsnews.com/article/2015/10/iu-still-searching-for-first-big-ten-win", "country": "US", "title": "IU still searching for first Big Ten win", "performance_score": 0, "site": "idsnews.com", "participants_count": 1, "title_full": "IU still searching for first Big Ten win | Indiana Daily Student", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T07:00:00.000+03:00", "replies_count": 0, "uuid": "b769cef6b9a0637391948e4aa1ed750d41bc2abd"}, "author": "Danny White", "url": "http://www.idsnews.com/article/2015/10/iu-still-searching-for-first-big-ten-win", "ord_in_thread": 0, "title": "IU still searching for first Big Ten win", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "With two games remaining in the season, IU is still searching for its first Big Ten victory.\nIU plays at Michigan State on Sunday. IU (3-8-6, 0-5-4) fell to Ohio State last Sunday, 2-1, at home after a late goal led to a Buckeye victory.\nIU’s defense held strong against Ohio State, but, after making a few switches in the midfield, it lost track of players and was punished for its mistakes, IU Coach Amy Berbary said. She said the hard lesson is an experience her team can carry into this weekend.\nMichigan State (7-4-4, 3-3-2) is coming off a 1-0 loss at Wisconsin on Sunday. The Spartans, 4-2-3 at home, feature not only a stout defense but also dangerous — and experienced — attacking players.\n“We’re not focusing too much on them,” Berbary said. “I think our focus is on ourselves and doing the right things.”\nIU has struggled mightily on the road, as it has posted an 0-6 record this season. However, the Hoosiers’ inauspicious record does not deter them.\n“Nothing changes,” Berbary said. “In our minds, we try to finish as high as we can in the Big Ten and continue to get better every game, and we have two more for it.”\nIU has had trouble finishing games this year. In practice, the Hoosiers did not mince words about where they needed to improve.\n“Finishing,” senior midfielder Jessie Bujouves said. “It’s something that I’ve been working on. It’s something the team has been working on is finishing in the final third.”\nIt is not all lost for the Hoosiers because they are succeeding in the hard aspect of breaking down defenses inside the box to score goals. Technically IU is struggling by reaching for balls and shooting off-balance shots, Berbary said.\nBujouves had a strong game against the Buckeyes, as she scored the Hoosiers’ only goal, and will look to have another standout performance against the Spartans. The senior said she will keep the same mindset she had against the Buckeyes.\n“Attack, attack, attack,” Bujouves said. “And shoot and have the mentality of being dangerous and dominant from my position.”\nAs her senior season winds down, Bujouves said she is excited to play her last few games with her best friends. Regardless of the result, Bujouves said she has had fun and her love of soccer and her teammates transcends the outcome. She has even more to look forward to Sunday than the game.\n“Playing in front of my family that hasn’t seen me play in a couple of years,” Bujouves said. “So that will be fun and a good way for me to end off the season.”\nDespite fatigue and adversity, the Hoosiers are not making any excuses.\n“At this point in the season, everybody’s bodies are tired,” Berbary said. “I think it is a little bit between the ears and we just have concentrate a little more when we get in the penalty area.”", "external_links": [], "published": "2015-10-23T07:00:00.000+03:00", "crawled": "2015-10-24T08:33:53.567+03:00", "highlightTitle": ""}