{"organizations": [], "uuid": "cc840156c62fd2f12e0f00d3782d693ae0593a1e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/2/8/153823/World/Region/Iran-parliament-approves-nuclear-deal-with-world-p.aspx", "country": "EG", "title": "Iran parliament approves nuclear deal with world powers - Region - World", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Iran parliament approves nuclear deal with world powers - Region - World - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "cc840156c62fd2f12e0f00d3782d693ae0593a1e"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/2/8/153823/World/Region/Iran-parliament-approves-nuclear-deal-with-world-p.aspx", "ord_in_thread": 0, "title": "Iran parliament approves nuclear deal with world powers - Region - World", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Japan FM says nuclear deal will speed Iran cooperation Iran's parliament approves outline of bill on nuclear deal Bolivia signs nuclear agreement with Russia's Rosatom U.N. nuclear watchdog says its chief visited military site in Iran Iran's parliament approved a historic nuclear deal with world powers on Tuesday, effectively ending debate among lawmakers over the agreement and paving the way for its formal implementation.\nThe motion to approve the Joint Comprehensive Plan of Action (JCPOA) was passed with 161 votes in favour, 59 against and with 13 abstentions, the official IRNA news agency and other media said.\nAn early tally of the vote said 250 of Iran's 290 MPs were present, with the numbers suggesting 17 members who attended did not vote at all.\nThe nuclear agreement between Iran and six world powers was struck on July 14 after almost two years of diplomacy but lawmakers in the United States and Tehran insisted on voting on it.\nThe deal, which will lift nuclear-related sanctions on Iran in return for curbs on its atomic activities -- the Islamic republic denies seeking a bomb -- has received a rocky ride in the US and Iran.\nMembers of the US Congress failed in September to torpedo the deal.\nAnd in Tehran ultraconservative lawmakers repeatedly warned of holes in the text of the agreement and criticised President Hassan Rouhani for suggesting MPs were deliberately delaying the deal.\nIn selling the agreement to sceptics, Rouhani's government said its negotiators protected the future of Iran's nuclear programme while ensuring sanctions, that have ravaged its economy, would end.\nHowever, as late as Sunday parliament was the scene of fiery clashes over the deal.\nAli Akbar Salehi, head of Iran's Atomic Energy Agency, went on the attack for the government after he and other officials were accused by lawmakers of having capitulated to the West.\nSo-called red lines for the talks were laid down by Iran's supreme leader, Ayatollah Ali Khamenei, and the Supreme National Security Council that he oversees.\nTuesday's motion, titled \"Iran's Plan for Reciprocal and Proper Action in Implementing JCPOA\" allows the government to proceed, IRNA reported.\nIranian officials have said sanctions should be lifted by the end of the year or January 2016 at the latest.\nHowever Iran also has to satisfy the International Atomic Energy Agency, the UN nuclear watchdog, of the exclusively peaceful nature of its atomic programme.\nThe IAEA faces a December 15 reporting deadline to resolve what it had termed \"ambiguities\" over Iran's past nuclear activities.", "external_links": [], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T16:07:26.580+03:00", "highlightTitle": ""}