{"organizations": [], "uuid": "12ec9779fe18d51975c11ffd895e764c5212e1b0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mailtribune.com", "main_image": "http://www.mailtribune.com/storyimage/MM/20151015/VARSITY/151019765/AR/0/AR-151019765.jpg", "site_section": "http://www.mailtribune.com/sports?template=rss&mime=xml", "section_title": "Sports - MailTribune.com", "url": "http://www.mailtribune.com/article/20151015/VARSITY/151019765/101039/SPORTS?rssfeed=true", "country": "US", "title": "Record run", "performance_score": 0, "site": "mailtribune.com", "participants_count": 1, "title_full": "Record run", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T10:00:00.000+03:00", "replies_count": 0, "uuid": "12ec9779fe18d51975c11ffd895e764c5212e1b0"}, "author": "Kris Henry Mail Tribune", "url": "http://www.mailtribune.com/article/20151015/VARSITY/151019765/101039/SPORTS?rssfeed=true", "ord_in_thread": 0, "title": "Record run", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Oct. 15, 2015 at 2:00 AM » Social News For the Crater boys, it was a chance to truly stretch their legs. For North Medford’s girls, it was a chance to race to their potential. Either way, both cross country programs got exactly what they hoped for Wednesday at the second annual Max King Invitational. Along the way, South Medford and North Medford each saw their freshman boys records fall in prime conditions for the 5,000-meter course at the Jackson County Expo in Central Point. “It was a nice meet for the (Rogue Valley) to put on because there’s not a lot of them here anymore,” said Crater head coach Justin Loftus, “and I think everyone got something out of it.” Paced by a blistering effort by senior Walter Vail, the Comets secured yet another impressive victory in the boys competition by posting the top three times overall and six of the top nine to finish with 20 points overall. “They’re putting in the work and it’s paying off,” said Loftus. “They did what I was hoping they would do and definitely came through.” “Today was all about hit it and see what you can do,” he added. For Vail, that meant scorching the course in a time of 14 minutes, 57.2 seconds to become the first Comet to cover a cross country setup in under 15 minutes. Isaac Stoutenburgh, who went on to run at the University of Oregon, set the previous standard in 2005 at 15:03.02. “That was on another level,” Loftus said of Vail’s outing. “I’ve had some pretty good individual athletes over the years but these guys just feed off each other, it’s impressive. Every day I show up to work and it’s the old cliche where you’d say I’m just lucky. They do what I want them to do and they all just want to get better.” Sophomore Andy Monroe also came in under Stoutenburgh’s time at 15:00.1 to finish second for the Comets, while teammate Derek Tripp held on as long as he could after his teammates broke free from the pack about 1½ miles into the race to finish third in 15:33.1. “There’s a lot left but for night now in the moment, it’s overwhelming,” Loftus said. “This was going to be our breakout race because all we’ve done hasn’t really been on fast courses or we haven’t rolled through them fast, but today they went after it.” The Comets added to their dominance with senior Tanner Shipley finishing sixth (15:56.3) and sophomore Erik Olsen (16:03.7) edging freshman teammate Jantz Tostenson (16:03.9) for eighth overall. Eagle Point senior Kevin Van Dyke was 10th in 16:07, while Ashland senior Raymond Impara (16:16.5) and South Medford freshman Alex Villa (16:17.9) were the next to cross the finish line. Villa’s effort was the seventh-best in Panthers history and broke the freshman record set by John Serna in 2011 of 16:57.9. Also chiming in with a breakthrough effort among the freshmen was North Medford’s Jacob Allamaras, who finished 17th in 16:31.1 and broke the freshman school mark set by Drew Jordan in 2006 of 16:46.2. Allamaras’ outing was the 12th best overall in Tornado history. Crater senior Jordan Monroe easily outdistanced the field for her victory in the girls race at 18:41.7, with runner-up Emma Amundsen of Phoenix crossing in 19:26.6. Monroe had hoped to stack up against St. Mary’s senior Marissa Dobry, who ran 17:48.2 in last Saturday’s George Fox Classic, but the Crusader standout did not compete Wednesday. “She would’ve liked to have gone faster with Dobry out there,” said Loftus, “but she went out and ran her race and went tough. It’s exactly what you want.” North Medford sophomore Clare Ebert continued her steady campaign by pacing her squad with a third-place effort of 19:37.1, and her Black Tornado teammates responded with their best outing of the season to claim the girls team title. North Medford finished with 77 points to edge Grants Pass and Crater, who each finished with 82 points. “I think we’re starting to show some racing maturity, I think that’s been the difference-maker for us lately,” said Tornado head coach Piet Voskes. “We have younger girls who have not run cross country before and it just took some time for them to develop some racing confidence. We’ve seen it in practice and I thought this was the first meet we’ve seen it blossom.” North Medford sophomore Victoria Messer was a prime example of that Wednesday, stepping up to run stride for stride with Ebert before ultimately finishing fifth with a personal best time of 19:41.9. Tornado senior Jaci Brumble finished 17th in 20:24.1, junior Jessica Diaz 21st in 20:36.3 and freshman Sarah Krick 35th in 21:19.9 to post the victory. “It was a big win for us,” added Voskes. “That’s a very good Crater girls team and I thought we needed every point to do it. It’s a nice springboard into districts for us.” Much of it made possible, according to Voskes, by the top-tier running shown all season by Ebert, who is consistently among the leaders at each meet. “Her consistency has rubbed off on the others,” said the coach. “She delivers every time and they’re understanding that cross country is different than track and her delivering in that spot is crucial.” Phoenix junior Danielle Jantzer placed fourth in 19:41.2, while Eagle Point sophomore Ariana Marks was eighth in 20:06.9 and Ashland sophomore Claire Pryor ninth in 20:11.3. St. Mary’s top finisher was freshman Emma Bennion, who was 12th in 20:16.2, while South Medford senior Amy Watson was 19th in 20:33.3. Max King Invitational Boys TEAM SCORES: Crater 20, Marist 53, Phoenix 112, Ashland 125, South Medford 134, Grants Pass 143, North Medford 170, Eagle Point 248, Henley 314, Klamath Union 317, Hidden Valley 341, St. Mary’s 346, Cascade Christian 366, Mazama 395, Lakeview 417, Rogue Valley Adventist 458. INDIVIDUAL RESULTS (Top 30): 1, Walter Vail, Cra, 14:57.2; 2, Andy Monroe, Cra, 15:00.1; 3, Derek Tripp, Cra, 15:33.1; 4, Jerik Embleton, Mar, 15:42.3; 5, Clark Embleton, Mar, 15:53.7; 6, Tanner Shipley, Cra, 15:56.3; 7, Maxel Belnap, GP, 16:01.4; 8, Erik Olsen, Cra, 16:03.7; 9, Jantz Tostenson, Cra, 16:03.9; 10, Kevin VanDyke, EP, 16:07.0. 11, Raymond Impara, Ash, 16:16.5; 12, Alex Villa, SM, 16:17.9; 13, Sam Scherer, Mar, 16:19.0; 14, Robert Vos, Pho, 16:23.0; 15, Ryan Helbling, Mar, 16:23.5; 16, Luke Littleton, Mar, 16:24.1; 17, Jacob Allamaras, NM, 16:31.1; 18, Griff Hokanson, Cra, 16:31.3; 19, Sean Fagan, NM, 16:34.8; 20, Leif Amundsen, Pho, 16:37.3. 21, Nathan Burton, GP, 16:38.9; 22, Sam Nelson, Mar, 16:39.8; 23, Gabe Southmayd, Cra, 16:43.1; 24, Joel Centeno, SM, 16:47.5; 25, Drake Knowles, Pho, 16:51.0; 26, Jacob Bergren, Pho, 16:52.0; 27, Jordan Mortensen, Ash, 16:52.3; 28, Lars Weston, Ash, 16:52.7; 29, Kaleb Lacey, Cra, 16:53.0; 30, Enoch Cunningham, SM, 16:54.0. Girls TEAM SCORES: North Medford 77, Grants Pass 82, Crater 82, Ashland 112, South Medford 125, Phoenix 138, Marist 164, St. Mary’s 172, Klamath Union 219, Hidden Valley 284, Henley 287. INDIVIDUAL RESULTS (Top 30): 1, Jordan Monroe, Cra, 18:41.7; 2, Emma Amundsen, Pho, 19:26.6; 3, Clare Ebert, NM, 19:37.1; 4, Danielle Jantzer, Pho, 19:41.2; 5, Victoria Messer, NM, 19:41.9; 6, Zaruba Anderson, HV, 19:42.5; 7, Ahdra Klingler, GP, 19:50.4; 8, Ariana Marks, EP, 20:06.9; 9, Claire Pryor, Ash, 20:11.3; 10, Ayla Klingler, GP, 20:12.8. 11, Hazel Richards, Ash, 20:13.6; 12, Emma Bennion, StM, 20:16.2; 13, Shayla Potratz, Pho, 20:19.3; 14, Mina Buchanan, Mar, 20:19.8; 15, Booy Rogers, Mar, 20:21.4; 16, Maggie Lacey, Cra, 20:23.8; 17, Jaci Brumble, NM, 20:24.1; 18, Elezebeth Allen, Cra, 20:31.5; 19, Amy Watson, SM, 20:33.3; 20, Willow Smith, SM, 20:34.5. 21, Jessica Diaz, NM, 20:36.3; 22, Abi Johnson, GP, 20:38.5; 23, Madison Rounsaville, GP, 20:39.4; 24, Brooke Johnson, GP, 20:47.5; 25, Kylie Caldwell, Cra, 20:48.0; 26, Margaret Faliano, Cra, 20:57.2; 27, McKenzie Moore, Ash, 20:58.6; 28, Alexa Hague, Ash, 21:00.0; 29, Deanndria Shields, SM, 21:02.9; 30, Lily Taylor-Sabin, Lak, 21:12.0. Reach reporter Kris Henry at 541-776-4488, khenry@mailtribune.com, www.facebook.com/krishenryMT or www.twitter.com/Kris_Henry", "external_links": [], "published": "2015-10-15T10:00:00.000+03:00", "crawled": "2015-10-15T18:49:57.814+03:00", "highlightTitle": ""}