{"organizations": [], "uuid": "5155ad5b6a687a2d7c675c5192e5f612d64dd026", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ksl.com", "main_image": "http://img.ksl.com/slc/2572/257234/25723439.jpg", "site_section": "http://www.ksl.com/xml/294.rss", "section_title": "KSL / Sports Home / Local", "url": "http://www.ksl.com/?sid=36783111&nid=304&s_cid=rss-extlink", "country": "US", "title": "Jazz want playoffs, sure, but long-term success more important", "performance_score": 0, "site": "ksl.com", "participants_count": 0, "title_full": "Jazz want playoffs, sure, but long-term success more important", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T21:15:00.000+03:00", "replies_count": 0, "uuid": "5155ad5b6a687a2d7c675c5192e5f612d64dd026"}, "author": "", "url": "http://www.ksl.com/?sid=36783111&nid=304&s_cid=rss-extlink", "ord_in_thread": 0, "title": "Jazz want playoffs, sure, but long-term success more important", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Andy Larsen"], "text": "Jazz want playoffs, sure, but long-term success more important By Andy Larsen | Posted Oct 2nd, 2015 @ 12:15pm 2  \nSALT LAKE CITY  It seems as if every person you talk to about the Utah Jazz has a different definition of success. \nMaking the postseason in 2015-16 is a natural goal. It's one that players mentioned repeatedly when the season ended last year, and they've brought the mantra back this year. Rudy Gobert, perhaps the most boisterous of the bunch, said Monday that it's \"definitely our goal to be in the playoffs.\" Gordon Hayward confirmed that sentiment in his interviews. \nFor what it's worth, Las Vegas sportsbooks have the Jazz's over/under set at 40.5 wins. In other words, just finishing over .500 would be a good outcome for the team. \nThat also may be near the line that qualifies a team for the playoffs in this year's Western Conference. That 40.5 win over/under line is the eight best in the West, just above the Dallas Mavericks' 38.5 projected total. \nThe team's front office, though, doesn't look at being above the red line this season as the main goal. That's evidenced by their approach to free agency this past summer: they deliberately decided not to use the cap space they had to spend. The team's biggest acquisitions were two young European non-stars and a 19-year-old, not the sort of players who are certain to make a positive impact in their first years. \nInstead, it's about building a long-term \"championship-caliber team,\" to use the words of Randy Rigby, Jazz president. Business is good for the Jazz, but there are those in the business side of the team that remember the intense interest and associated revenue that came with the Jazz's run to the NBA Finals in 1997 and 1998. \nThe basketball operations side knows that the ability to build a consistent contender is how their success or failure will be judged. Making the playoffs this year, leading to a likely first-round exit, wouldn't be good enough. Acquiring a player to help with the short term goal of making the playoffs this year might get in the way of the development of the young players the Jazz already have. \nThat's why, sources say, the front office chose not to fill the hole at point guard, where the Jazz had the league's worst production in 2014-15. They wanted to see how Trey Burke, Bryce Cotton, and Raul Neto would develop in their age 23 seasons. Ditto with acquiring a knockdown wing shooter, which looked to be a need for much of last season. Instead, they want to give massive minutes to developing Rodney Hood and Alec Burks. Repeatedly, the front office chose to eschew signing immediate fixes for developing long-term solutions. \nThat approach extends to Jazz head coach Quin Snyder, who believes success comes with sticking with a process. To his credit, that's the same process that brought them to wild defensive improvement over the season and a spectacular finish to last year. \n\"The irony is that a lot of people say it [that it's all about the process],\" Snyder said. \"It's very, very difficult to actually adhere to it through the adversity and ups and downs of the NBA season. \n\"Hopefully the success that we had doing it gives you more encouragement: you taste that, you want more of it.\" \nIt's safe to say that the players do. Andy Larsen", "external_links": [], "published": "2015-10-02T21:15:00.000+03:00", "crawled": "2015-10-02T21:42:27.107+03:00", "highlightTitle": ""}