{"organizations": [], "uuid": "67d0b2bf5744a5651e86d48a16a098363e7e2254", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbssports.com", "main_image": "http://sports.cbsimg.net/images/visual/whatshot/405mousepricehomerstakas.jpg", "site_section": "http://news.google.com/news?pz=1&cf=all&ned=us&hl=en&topic=s&output=rss", "section_title": "Sports - Google News", "url": "http://www.cbssports.com/mlb/eye-on-baseball/25351670/david-price-good-but-not-great-in-postseason-what-effect-will-that-have-on-his-free-agency", "country": "IL", "title": "David Price: 'I didn't pitch good enough to win' Game 6 - CBSSports.com", "performance_score": 0, "site": "cbssports.com", "participants_count": 0, "title_full": "David Price: 'I didn't pitch good enough to win' Game 6 - CBSSports.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T16:03:00.000+03:00", "replies_count": 0, "uuid": "67d0b2bf5744a5651e86d48a16a098363e7e2254"}, "author": "", "url": "http://www.cbssports.com/mlb/eye-on-baseball/25351670/david-price-good-but-not-great-in-postseason-what-effect-will-that-have-on-his-free-agency", "ord_in_thread": 0, "title": "David Price: 'I didn't pitch good enough to win' Game 6 - CBSSports.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["David", "David Brown"], "text": "David Price: 'I didn't pitch good enough to win' Game 6 By David Brown | Baseball Writer October 24, 2015 5:56 AM ET \nKANSAS CITY, Mo. -- David Price pitched better, with one exception better than he ever had in eight postseason starts. But his results were not good enough to help the Toronto Blue Jays win Game 6 of the ALCS on Friday night. Their season is over after a 4-3 loss to the Royals . \nAfter coming in with a 5.24 ERA over 56 2/3 playoff innings, Price allowed three runs, five hits and a walk over 6 2/3 innings. He also struck out eight and cruised from the end of the second until the seventh, retiring 16 of his final 20 batters. But he also allowed a pair of solo homers that put the Jays behind early, and he was responsible for the go-ahead run that reliever Aaron Sanchez allowed to score in the seventh. A mixed review at best. \n\"I didn't pitch good enough to win,\" Price said. \"I've thrown the ball well at times in the playoffs. I threw it OK tonight. I know I didn't get a win, or whatever -- we didn't get a win. But what happens in October doesn't define who I am.\" \nPrice is right, though not completely. When he hits free agency in the offseason, he's going to get a huge contract from somebody, and offers from many teams, and it's unlikely that what happened in October with the Jays -- and what's happened in past Octobers -- will cost him a dime. Suitors are going to overlook the sample size of eight postseason starts, four of which count technically as quality starts, but none of which were particularly dominating throughout. \nInstead, teams are going to focus on Price's consistently great overall results. The Cy Young in 2012 (and possibly 2015), the two ERA titles, the strikeout title, the five All-Star appearances and the great health record. Price's leadership qualities in the clubhouse. They'll see all that, and the Dodgers or Cubs or somebody will give him $200 million and be happy to do so, figuring they'll take their chances on Price simply being due to have better results in the playoffs. \nPrice was not ready in the least to address his next move. \nYour browser does not support iframes. \n\"I don't know when free agency starts, it's not something I've thought about,\" Price said. \"I haven't thought about it all year long and, if I had, I probably wouldn't have thrown the baseball the way that I have all year long. Right now, I'm just going to relax with my family and enjoy Nashville.\" \nNashville, Tenn., happens to be where the winter meetings will be held in December. \nBut even after he signs, there will be questions. \"Why can't you win in the postseason? Does it bother you? Is the pressure building? Are you more sick of losing or the line of questioning about it?\" Price might even have some questions himself, even if he's usually irrepressibly optimistic about what's to come. \nThe only thing that will answer those questions about what goes wrong in October is success. Jays manager John Gibbons, who seems like a straight shooter, was appreciative of Price's effort. \n\"I hope that quiets some things down for David, what he's been through this postseason,\" Gibbons said. \"He stepped up tonight, he really did. A couple solo home runs early, and he was really as good as we've seen him. He kept us right there, gave us a shot.\" \nThat's what teams hope to get from most pitchers. Price is a cut above most pitchers, though. He just hasn't shown it often in October. And until he has better results, there will be questions. \nMike Moustakas takes David Price deep in the second inning of Game 6. (USATSI)", "external_links": [], "published": "2015-10-24T16:03:00.000+03:00", "crawled": "2015-10-24T16:25:00.227+03:00", "highlightTitle": ""}