{"organizations": [], "uuid": "30d655b21f6919bf31977601f2fb4845e62e81e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deccanchronicle.com", "main_image": "http://www.deccanchronicle.com/sites/default/files/Rahane_AFP_4.jpg", "site_section": "http://www.deccanchronicle.com/sports", "section_title": "Sports | Deccan Chronicle", "url": "http://www.deccanchronicle.com/151011/sports-cricket/article/ajinkya-rahane-far-better-player-ambati-rayudu-azharuddin", "country": "US", "title": "Ajinkya Rahane is a far better player than Ambati Rayudu: Azharuddin", "performance_score": 0, "site": "deccanchronicle.com", "participants_count": 1, "title_full": "Ajinkya Rahane is a far better player than Ambati Rayudu: Azharuddin", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T01:58:00.000+03:00", "replies_count": 0, "uuid": "30d655b21f6919bf31977601f2fb4845e62e81e5"}, "author": "PTI", "url": "http://www.deccanchronicle.com/151011/sports-cricket/article/ajinkya-rahane-far-better-player-ambati-rayudu-azharuddin", "ord_in_thread": 0, "title": "Ajinkya Rahane is a far better player than Ambati Rayudu: Azharuddin", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PTI | October 11, 2015, 14.25 pm Asked about India having lack of finishers, Mohammed Azharuddin said that this term finisher was \"overrated\". (Photo: AFP) New Delhi : Former India captain Mohammed Azharuddin was critical of Indian team management's decision to bench Ajinkya Rahane during the 0-2 Twenty20 series defeat against South Africa, terming him as a far better player than Ambati Rayudu.\n\"There is absolutely nothing wrong with Ajinkya Rahane's technique or temperament. It was the most unfortunate thing that he had to sit out during the T20 series. When he was finally picked, it was too late as series was lost. With due respect to Ambati Rayudu, Ajinkya is a far better player. How can you bench your best batsman after Virat Kohli,\" Azharuddin told PTI during an interaction on sidelines of Delhi's Ranji Trophy match at Feroz Shah Kotla.\n\"Rahane is an attacking player and has all the shots. He has to bat up the order,\" he added.\nThe veteran of 99 Tests and 334 ODIs also made it clear that skipper Mahendra Singh Dhoni is \"not the player he used to be\" and has to bat up the order.\n\"He (Dhoni) is the captain and there will be tremendous pressure on him. If he doesn't perform, selectors will have to think about him. He is not the player he used to be. Obviously, to make an impact he has to come up the order. Once the dressing room finds captain doing what he is required to do, others will follow him,\" said Azharuddin.\nRead: You don't want MS Dhoni to become a liability for the team: Ajit Agarkar\nAsked about India having lack of finishers, Azharuddin said that this term finisher was \"overrated\". \"I don't understand what exactly does this word finisher means. Everyone needs to have match finishing skills. Do you mean you require 50 runs to win and someone batting on 70 plus should leave it on someone else? If you are at the crease then it's your duty to finish the game for India,\" he said.\nThe former captain also didn't read too much into split captaincy issue. \"Look once Dhoni leaves, Virat, who is your best player, would lead the side. Other countries have three captains because a lot of their players are not automatic choice in all formats. Virat is slated to lead in all formats. As far as pressure is concerned, there won't be any as this is his age to take pressure. Ab nahin karega toh kab karega (if he doesn't do it now, when will he do it?).\"\nFor Azharuddin aggression means \"scoring runs and taking wickets\". \"What is that aggression which leads to Ishant not being able to play a Test match?\" he asked.\nWatch: Tough to play Rahane in current scenario, says MS Dhoni\nAzharuddin feels that it will be very difficult to take 20 wickets against South Africa as lot will depend on conditions. \"It will be extremely difficult to get 20 wickets against South Africa with players like AB (de Villiers) and Hashim Amla. Lot will depend on nature of tracks whether it offers turn or is low and slow,\" he concluded.\n Cricket Team India South Africa MS Dhoni Ajinkya Rahane Ambati Rayudu Mohammed Azharuddin Also Read Always looking to improve his game, Ajinkya Rahane takes MS Dhoni's comment in stride Ajinkya Rahane, from the by-lanes of Dombivli to Team India's skipper Video: It would be challenging to maintain momentum, says AB de Villiers You don't want MS Dhoni to become a liability for the team: Ajit Agarkar", "external_links": ["http://platform.twitter.com/widgets.js", "http://static.ak.fbcdn.net/connect.php/js/FB.Share", "http://campaign.bharatmatrimony.com/track/clicktrack.php?trackid=00100326114361", "https://apis.google.com/js/plusone.js", "http://dd508hmafkqws.cloudfront.net/sites/default/files/Rahane_AFP_4.jpg", "http://twitter.com/share?url=http://www.deccanchronicle.com/151011/sports-cricket/article/ajinkya-rahane-far-better-player-ambati-rayudu-azharuddin", "http://dd508hmafkqws.cloudfront.net/sites/default/files/styles/article_node_view/public/Rahane_AFP_4.jpg", "http://www.facebook.com/sharer.php", "http://vuukle.com/js/vuukle.js", "http://dd508hmafkqws.cloudfront.net/sites/default/files/BharatMatrimony_texlink_banner_620x40px.gif"], "published": "2015-10-12T01:58:00.000+03:00", "crawled": "2015-10-11T15:30:31.113+03:00", "highlightTitle": ""}