{"organizations": [], "uuid": "c15a97c58acecda30075fe3ed328a2137fe87773", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pendletontimespost.com", "main_image": "", "site_section": "http://pendletontimespost.com//feed/sec/6000/", "section_title": "PendletonTimesPost.com - Sports News", "url": "http://www.pendletontimespost.com/view/story/563149acf94c43459eb51b1a0e658420/FBN--49ers-Downward-Spiral/", "country": "US", "title": "49ers' Thanksgiving loss to Seattle last year started spiral", "performance_score": 0, "site": "pendletontimespost.com", "participants_count": 0, "title_full": "49ers' Thanksgiving loss to Seattle last year started spiral", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T09:53:00.000+03:00", "replies_count": 0, "uuid": "c15a97c58acecda30075fe3ed328a2137fe87773"}, "author": "", "url": "http://www.pendletontimespost.com/view/story/563149acf94c43459eb51b1a0e658420/FBN--49ers-Downward-Spiral/", "ord_in_thread": 0, "title": "49ers' Thanksgiving loss to Seattle last year started spiral", "locations": ["San Francisco", "Seattle"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["JANIE McCAULEY"], "text": "San Francisco's spiral began last season with loss to rival Seahawks on Thanksgiving night By JANIE McCAULEY AP Sports Writer   2:53   2:53   \nPeople: \nCalifornia (1459) \n\nSANTA CLARA, California — The downward spiral for San Francisco began in earnest when the 49ers hosted the rival Seahawks on Thanksgiving night 11 months ago, starting a free fall for the proud franchise that resulted in months of major changes and turmoil. \nCEO Jed York posted an apology on Twitter saying the fans deserved more, the daughter of general manager Trent Baalke called for then-offensive coordinator Greg Roman's job in her own tweet that caused a major stir, and Seattle won the game 19-3 with Seahawks star cornerback Richard Sherman chomping turkey at midfield to celebrate. \n\"I got a short-term memory, I don't remember that,\" 49ers receiver Quinton Patton said with a grin. \nIf he needs a refresher, the 49ers were held to 164 total yards that night and then got eliminated from playoff contention in a 17-7 loss at Seattle less than three weeks later. Coach Jim Harbaugh departed at season's end, then the mass exodus followed — the departures in free agency of franchise rushing leader Frank Gore and former first-round picks offensive lineman Mike Iupati and wideout Michael Crabtree, then the surprise retirements of Patrick Willis and Chris Borland then later Justin Smith. \nThe teams were set to play again Thursday night at Levi's Stadium, this time each trying to save its season. \n\"I don't think I think about either of those guys very much,\" Sherman said of his college coach at Stanford, Harbaugh, and Crabtree. \nPerhaps the 49ers (2-4) will avoid some of the embarrassment that ensued the last time Seattle visited. Just when they were trying to build some momentum for the season's final month, it all vanished in a matter of hours — and with a couple of ill-timed social media decisions. \nIn the waning moments with thousands of red seats already empty, York posted on Twitter: \"Thank you (hashtag)49ersfaithful for coming out strong tonight. This performance wasn't acceptable. I apologize for that.\" \nAs if there weren't already enough humiliating elements to San Francisco's lopsided loss, Cassie Baalke called for Roman's ouster before quickly deleting her Twitter post and later closing the account altogether. \n\"Greg Roman can take a hike..the 49ers don't want you no more,\" the tweet said. \nBaalke was left apologizing to Roman in person and publicly the next day for the \"unfortunate matter,\" Baalke said. \n\"While disappointed, as a father I will use this as a teachable moment to help my daughter grow,\" he said in a statement. \nSeahawks defensive end Michael Bennett had a little fun with the talk of that Thanksgiving feast, but preferred to focus on the current football situation. \n\"Turkey's good when you put some hot sauce on it,\" he said. \"You forget about that game, I think they forgot about it too. We just try to be motivated for this game. They beat us away two years ago and we won at their house last year. Hopefully, they are motivated because we're motivated, too. I hope they got mad that we ate the turkey. I don't like turkey because I don't like what happened to the Indians.\" \nSherman had two interceptions that night, saying afterward, \"I told their sideline if they threw it my way I'd end the game.\" \nThat's what he did in the NFC championship game in January 2014 at Seattle when he made a touchdown-saving deflection in the end zone against Crabtree to send his team to the Super Bowl with a 23-17 win against the Niners. Sherman called Crabtree a \"mediocre receiver\" afterward. \nAfter the Thanksgiving night win, Sherman said 49ers fans threw a bottle as the Seahawks exited. Sherman had looked at those fans — in a half-empty stadium by late in the game — and waved following his second interception. \nWhen 49ers Australian return man Jarryd Hayne visited the Seahawks last year and attended Seattle's overtime win against Denver, he got a quick taste of this rivalry when fans at CenturyLink Field cheered as San Francisco's losing score to Arizona came across the board. \n\"That was something that really caught my attention,\" Hayne said. \"It was like, 'Wow, it's big.'\" \nLingering rifts and trash-talking aside, everybody seemed eager to get on to the next game. \n\"I don't give a (expletive) they ate turkey on our field,\" 49ers left guard Alex Boone said. \"Whatever makes 'em happy.\"", "external_links": [], "published": "2015-10-22T09:53:00.000+03:00", "crawled": "2015-10-22T11:12:31.412+03:00", "highlightTitle": ""}