{"organizations": ["Indians", "SCA", "Marionville", "Houston", "Cardinals", "COC", "Bulldogs", "Parkview", "Carl Junction", "Tigers", "Webb City", "West Plains"], "uuid": "63cb19e952e3a92a913528e10a162590f5ff68d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ozarkssportszone.com", "main_image": "http://imgsrv.ozarkssportszone.com/image/DbGraphic/201510/3175517.jpg", "site_section": "http://www.kspr.com/sports/21051914_21051920?format=rss_2.0&view=feed", "section_title": "Sports Top Stories", "url": "http://www.ozarkssportszone.com/Week-8-Football-Roundup/22053944", "country": "US", "title": "Week 8 Football Roundup", "performance_score": 0, "site": "ozarkssportszone.com", "participants_count": 0, "title_full": "Week 8 Football Roundup", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T10:16:00.000+03:00", "replies_count": 0, "uuid": "63cb19e952e3a92a913528e10a162590f5ff68d5"}, "author": "", "url": "http://www.ozarkssportszone.com/Week-8-Football-Roundup/22053944", "ord_in_thread": 0, "title": "Week 8 Football Roundup", "locations": ["Waynesville", "Marionville", "Lebanon", "Salem", "West Plains"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Stuart McKarus", "Lamar", "Josh Pruett", "Short", "Otwell", "Danny Embry", "Carl Junction", "Dylan Mountain", "Jasper", "Hoopes", "Lockwood", "Nick Haddock", "Martin", "Chipper Berry", "Ethan Bates", "Malachi Stout", "Justin Nentrup", "Marcos Rodriguez", "Miller", "Carter Otwell"], "text": "PHOTOS: BEST FANS OF WEEK 8 8 and a donut… Class 4 No. 1 Webb City topped Ozark in typical Cardinal fashion , holding the Tigers scoreless until late in the game with a 35-7 win. The Cardinals clinched at least a share of the COC Large title for the eight consecutive season, extending their overall winning streak to 36 games and their streak in regular-season games against in-state competition to 115. Class 2 No. 1 Lamar put the clamps on an Aurora offense that had been explosive entering Week 8, topping the Dawgs 41-0. The Tigers rushed for more than 400 yards on the night with all-state running back Danny Embry’s 177 yards and four touchdowns leading the way. Sophomore quarterback Stuart McKarus added 121 yards and a score. Next week Lamar will look for that elusive Big 8 title when it hosts Carl Junction. Speaking of the Bulldogs, Class 4 No. 2 Carl Junction held up its end of the bargain, running away from Seneca 63-28. The Bulldogs, who are looking for their third consecutive Big 8 crown, led the Indians 49-6 at the half. It is the fifth time this season that CJ has scored at least 49 points. In the state's biggest game, Class 1 No. 3 Skyline hammered Class 1 No. 2 Marionville 58-37 to clinch at least a share of the Mid-Lakes crown . Senior quarterback Dylan Mountain rushed for 157 yards and four touchdowns, while classmate Chipper Berry added 155 yards and three touchdowns. Skyline maintains the top seed in its district, while Marionville could drop to No. 3 with the loss. Kickapoo continues to be the most dominant large-class team in the Ozarks. The Class 5 No. 7 Chiefs blasted Lebanon 49-21 , receiving a huge game from senior standout Malachi Stout. Stout rushed for 155 yards and three touchdowns, caught two passes for 49 yards for two more scores and even returned a punt 75 yards for a total of six touchdowns. Kickapoo will look to cap its second undefeated Ozark Conference championship in three years with a win over Waynesville next week. Class 3 No. 6 Reeds Spring continued to silence the doubters , topping Central 35-24 in nonconference action. The Wolves received a huge game from Nick Haddock, who rushed for 223 yards and three touchdowns. Reeds Spring will take on Bolivar for the COC Small title next week. Have a day Josh Pruett. The junior quarterback racked up six total touchdowns in MV-BT/Liberty’s 47-13 win over Salem , clinching at least a share of the SCA title. Ranked No. 6 in Class 2, the Eagles also received 102 yards and a touchdown from Marcos Rodriguez. CLICK HERE FOR PHOTOTS Lose one all-state running back and another steps up in his place. Senior Ethan Bates rushed for a career-high 198 yards and four touchdowns, while Justin Nentrup had 119 total yards and a pair of touchdowns to lead No. 7 Lockwood to a 57-8 win over Miller, the Tigers first road win against the Cardinals since 2005 … Class 1 No. 10 Lockwood also remained perfect , topping Windsor 52-20. It is the third time in the last five games that Jasper scored 50 or more points. Jasper and Lockwood will meet next Friday to decide the SRVC championship. WEEK 8 TOP PLAYS Backs doing big things… Class 4 No. 8 West Plains 43, Parkview 21 Hoopes and Martin may sound like a 70s soft rock band, but the Zizzer duo was unstoppable on Friday night, with Martin (173 yards, 3 TDs) and Hoopes (159 yards, 3 TDs) leading West Plains to another Ozark Conference win. Class 3 No. 5 Mountain Grove 34, Houston 7 Trystan Short and Carter Otwell continue to harass the SCA. Otwell, just a sophomore, is Short’s uncle by marriage, and his partner in crime on the field as the dup combined for 263 yards and a pair of touchdowns on the ground. Otwell also tossed a pair of touchdown passes.", "external_links": [], "published": "2015-10-10T10:16:00.000+03:00", "crawled": "2015-10-10T11:32:32.809+03:00", "highlightTitle": ""}