{"organizations": ["MLB"], "uuid": "51b33b11963531ef9dd480cc3b79ca7ef3a80cbd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxsports.com", "main_image": "http://a.fssta.com/content/dam/fsdigital/fscom/mlb/images/2015/10/10/101015-SOCCER-Mets-Ruben-Tejada-Dodgers-Chase-Utley-slide-MM-PI.vresize.1200.675.high.42.jpg", "site_section": "http://api.foxsports.com/v1/rss?partnerKey=zBaFxRyGKCfxBagJG9b8pqLyndmvo7UU&tag=jabo", "section_title": "FOX Sports Digital", "url": "http://www.foxsports.com/mlb/just-a-bit-outside/story/ruben-tejada-slide-chase-utley-new-york-mets-los-angeles-dodgers-rule-nlds-101115", "country": "", "title": "The slide that broke the infielder's leg: MLB must change rule", "performance_score": 4, "site": "foxsports.com", "participants_count": 0, "title_full": "The slide that broke the infielder's leg: MLB must change rule", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T08:13:00.000+03:00", "replies_count": 0, "uuid": "51b33b11963531ef9dd480cc3b79ca7ef3a80cbd"}, "author": "", "url": "http://www.foxsports.com/mlb/just-a-bit-outside/story/ruben-tejada-slide-chase-utley-new-york-mets-los-angeles-dodgers-rule-nlds-101115", "ord_in_thread": 0, "title": "The slide that broke the infielder's leg: MLB must change rule", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Dave Cameron"], "text": "The slide that broke the infielder's leg: MLB must change rule Dave Cameron @DCameronFG \nWhen Bartolo Colon jogged in from the bullpen to replace Noah Syndergaard, we thought we were going to be talking about the wisdom of using a pitch-to-contact starter in relief when a strikeout was the preferred outcome. But then Howie Kendrick hit a line drive up the middle, which Daniel Murphy fielded and flipped to shortstop Ruben Tejada in an effort to turn an inning-ending double play. And then this happened. Your browser does not support iframes. \nThere's no real way to describe this play in any other way than this: Chase Utley, realizing his role shifted from baserunner to defender, barreled into Tejada with the intention of preventing him from throwing the ball to first base. To do this, Utley waited until the last possible moment to slide, not even attempting to touch the base as his body upended Tejada, whose legs were taken out from under him causing him to land violently on the ground. The impact forced Tejada to be removed from the game. \nThen, even more inexplicably, while medical staff was tending to Tejada on the field, the play was challenged and reviewed by MLB, which decided that Tejada's foot did not touch second base. Utley was awarded second base, overturning the original force out call. Which, okay, Tejada's foot did not touch second base, but no part of Utley ever touched the base either. He ran down the base line, deliberately threw his body into an opponent, was called out, jogged off the field and took a position on the bench. The first time he touched second base in that entire inning was when MLB told him to go back out there as a baserunner, a position he had already abdicated of his own volition. \nI don't want to lay too much blame on the umpiring crew in tonight's game, or even the replay officials who then put Utley back on second base because Tejada barely missed touching second base on accident after he himself didn't touch second base intentionally. This play happened because MLB has, for a very long time, allowed plays like this to happen. There's a rule in the rulebook -- 6.01(6), if you're wondering -- that explicitly gives the power to the umpires to call both the runner and the batter out on plays like this. It says the following. \n\"If, in the judgment of the umpire, a base runner willfully and deliberately interferes with a batted ball or a fielder in the act of fielding a batted ball with the obvious intent to break up a double play, the ball is dead. The umpire shall call the runner out for interference and also call out the batter-runner because of the action of his teammate. In no event may bases be run or runs scored because of such action by a runner.\" \nThere can be no question that the intent of Utley's slide was to break up the double play, but this rule is never enforced, and effectively doesn't exist. In the culture of Major League Baseball, this play is acceptable, because people have been sliding into middle infielders for years, and it's part of the game. \nWell, running over catchers at home plate was part of the game, too, until MLB eventually realized it didn't want it to be part of the game. MLB explicitly told players to stop running over catchers. And you know what? I haven't heard one single person complain that they missed catchers getting run over this year. The game has gone on and been as entertaining as ever without that part, and MLB will be just fine without continuing to endanger middle infielders in the future. \nTejada suffered a fractured fibula on the play, by the way, ending his season. Even if that weren't true, this type of play should still be outlawed post-haste by MLB. But it often takes an ugly example of the harm a bad rule can do before it gets changed, and in this case, Tejada's leg was sacrificed in the process. So let's not let it be in vein. Either enforce the rule on the books or make a new one explicitly stating that baserunners have to try and advance safely from one base to the next, and at no point are they allowed to switch into linebacker mode in order to prohibit defenders from doing their jobs. \nIt's time for a change. Ruben Tejada might not be as prominent a player as Buster Posey, but hopefully his injury paves the way to a rule protecting middle infielders just as Posey's injury did for catchers.", "external_links": [], "published": "2015-10-11T08:13:00.000+03:00", "crawled": "2015-10-11T08:45:37.492+03:00", "highlightTitle": ""}