{"organizations": [], "uuid": "be8736fa268c8b52d59bcc9215ac5d1602101b3c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sltrib.com", "main_image": "http://www.sltrib.com/csp/mediapool/sites/dt.common.streams.StreamServer.cls?STREAMOID=3KiLGN9HgarhzznlwTeQic$daE2N3K4ZzOUsqbU5sYvtvhzL89SVLQbT8ARMroavWCsjLu883Ygn4B49Lvm9bPe2QeMKQdVeZmXF$9l$4uCZ8QDXhaHEp3rvzXRJFdy0KqPHLoMevcTLo3h8xh70Y6N_U_CryOsw6FTOdKL_jpQ-&CONTENTTYPE=image/jpeg", "site_section": "http://sltrib.com//csp/cms/sites/sltrib/RSS/rss.csp?cat=Sports", "section_title": "Sports - The Salt Lake Tribune", "url": "http://www.sltrib.com/sports/3098266-155/prep-football-diamond-ranch-prohibitive-favorites", "country": "US", "title": "Prep football: Diamond Ranch prohibitive favorites in 1A playoffs", "performance_score": 0, "site": "sltrib.com", "participants_count": 1, "title_full": "Prep football: Diamond Ranch prohibitive favorites in 1A playoffs | The Salt Lake Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T02:00:00.000+02:00", "replies_count": 0, "uuid": "be8736fa268c8b52d59bcc9215ac5d1602101b3c"}, "author": "TREVOR PHIBBS", "url": "http://www.sltrib.com/sports/3098266-155/prep-football-diamond-ranch-prohibitive-favorites", "ord_in_thread": 0, "title": "Prep football: Diamond Ranch prohibitive favorites in 1A playoffs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Diamond Ranch advertised nine returning starters in the offseason, which was an unusual characteristic for the boarding school where the student body population is in constant fluctuation.\nHopes were high entering the season after the Diamondbacks advanced to the championship game in 2014, eventually falling 20-0 against Rich. The talent residing in the program was evident, and now, like never before, the program was experienced at the varsity level, leading to the preseason No. 1-ranking in the 1A classification.\n\"They know what we run. They played in that state championship game, and, I think, are hungry for that,\" said Diamond Ranch coach Robbie Dias. \"Obviously we've got some great athletes — guys that work hard. … There' s a difference to this team. I've seen guys battle, I've been pretty impressed.\"\n  Those lofty preseason expectations have been met resoundingly. Diamond Ranch embarrassed opponents by an average margin of victory exceeding 30 points per game. It allowed 67 points the entire year en route to an undefeated regular-season campaign. The Diamondbacks are now looking to fulfill further expectations by capturing the first state championship in school history.\n\"It's good to go in knowing we can beat every team we are going to face,\" Dias said. \"That's the positive part, but the tough part is heads get big and anybody can beat you. It makes me nervous. We need to stay humble and hungry.\"\nThe Diamondbacks path to the state title game appears much less challenging considering Duchesne, Kanab and Milford are all on the opposite side of the bracket. Rich presumably presents the stiffest obstacle in the road on the bottom half of the bracket, but Diamond Ranch easily dispatched the defending champs, 35-2, in late September.\nIt has been a long time since Diamond Ranch experienced actual competition in the fourth quarter, with the varsity defense having yet to surrender a single point since the Duchesne game. Complacency is a legitimate concern. \n\"I think that definitely gets in your mind,\" Dias said. \"Guys are going, 'We've yet to be scored on.' It's a tough one to fight. That's one thing, as coaches, we are preaching over and over. The minute you think that — you'll get knocked off.\"\nDuchesne is back in contention for another state title after 2014's anomaly, a season which saw the Eagles' 48-game winning streak — the longest in UHSAA history — come to an end along with the four-year stretch of state titles. Six consecutive wins have followed a 1-2 start, which included a 34-30 loss against Diamond Ranch.\nDefense has been known to deliver championships, but if Kanab has any chance of reeling in hardware this postseason, it needs production on the offensive side. The Cowboys' three setbacks were against Class 2A's Beaver (lost 14-13) and by a collective score of 42-0 against Duchesne and Diamond Ranch.\n\"I think our defense is probably our strength. I've been pleased with them all year long,\" said Kanab coach Bucky Orton. \"It's going to take a total effort in offense, defense and special teams to advance in the playoffs this year. There's too many good teams.\"\n\ntphibbs@sltrib.com \nTwitter: @trevorphibbs", "external_links": [], "published": "2015-10-25T02:00:00.000+02:00", "crawled": "2015-10-26T09:32:59.575+02:00", "highlightTitle": ""}