{"organizations": ["USC"], "uuid": "83912c2bbc5eede10099eaebb8501b9727f1df55", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxsports.com", "main_image": "http://a.fssta.com/content/dam/fsdigital/fscom/ncaa-fb/images/2014/09/12/091214-CFB-Southern-California-Trojans-interim-coach-Clay-Helton-PI.vresize.1200.675.high.56.jpg", "site_section": "http://api.foxsports.com/v1/rss?partnerKey=zBaFxRyGKCfxBagJG9b8pqLyndmvo7UU&tag=cfb", "section_title": "FOX Sports Digital", "url": "http://www.foxsports.com/college-football/story/pac-12-south-usc-trojans-steve-sarkisian-clay-helton-notre-dame-fighting-irish-ucla-bruins-stanford-cardinal-arizona-wildcats-utah-utes-101315", "country": "", "title": "Pac-12 South Notebook: Can USC respond to turmoil and beat Notre Dame?", "performance_score": 0, "site": "foxsports.com", "participants_count": 0, "title_full": "Pac-12 South Notebook: Can USC respond to turmoil and beat Notre Dame?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T19:58:00.000+03:00", "replies_count": 0, "uuid": "83912c2bbc5eede10099eaebb8501b9727f1df55"}, "author": "", "url": "http://www.foxsports.com/college-football/story/pac-12-south-usc-trojans-steve-sarkisian-clay-helton-notre-dame-fighting-irish-ucla-bruins-stanford-cardinal-arizona-wildcats-utah-utes-101315", "ord_in_thread": 0, "title": "Pac-12 South Notebook: Can USC respond to turmoil and beat Notre Dame?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  1:00p ET \nWith Monday’s news that Steve Sarkisian was terminated at USC, interim Trojans head coach Clay Helton is tasked with defeating Notre Dame Saturday in South Bend. \nNotre Dame beat the Trojans in 2012 and 2013; USC won the matchup last season while the Fighting Irish were depleted by injury. Helton, who was previously USC’s offensive coordinator, will become the fourth coach (Lane Kiffin, Ed Orgeron, Sarkisian and Helton) in four seasons to lead USC vs. Notre Dame. Meanwhile, Brian Kelly has been Notre Dame’s head coach for each game. \nIn the past 25 months, USC has made numerous coaching changes: Kiffin (2010-13), Orgeron (2013), Helton (for the first time in 2013), Sarkisian (2014-15) and now Helton (once more) have all served as USC head coach. \nSarkisian was 3-2 to start the season; USC lost back-to-back home games for the first time since 2001. \n“It was … clear to me the support that Clay has from the team, and the staff,” said athletic director Pat Haden, in a Sunday press conference . “We’ve got a big task this week with the Notre Dame game … and Clay will do a great job getting our team ready.” \nUSC will play without senior center Max Tuerk , who was sidelined with a knee injury vs. Washington on Thursday. Notre Dame, however, is without quarterback Malik Zaire as well as running back Tarean Folston and defensive tackle Jarron Jones . After the Trojans’ play No. 14 Notre Dame, the next two weeks bring No. 4 Utah and No. 23 California. USC’s schedule alone would likely cause concern for a team playing under a coach who is taking over midseason. \n“They still have a lot of things out there that we can obtain with a big game against Notre Dame this week,” Helton said. “The opportunity to still compete for the South championship in the Pac-12.” Helton, who according to the LA Times calls himself a “third-string head coach” for USC, boasts a 1-0 record as Trojans’ head coach. \nHelton also took over in 2013 to coach the Las Vegas Bowl after USC’s most recent interim head coach, Orgeron, quit. Under three different coaches in 2013, USC won 10 games. \n\"We've been in this exact position before with Coach Helton,\" one USC player, who asked to remain anonymous, told the LA Times . \"Like the older guys were saying, this season could be a complete disaster or turn into an epic run like we had in 2013.\" \nWill UCLA be able to contain the run vs. Stanford? \nUCLA head coach Jim Mora has never beaten Stanford. With seven consecutive victories, Stanford enjoys its longest win streak in the history of the schools’ head-to-head matchup -- which dates to 1925. \nDuring its last few games again Stanford, UCLA has suffered an inability to stop a potent rush attack. The Bruins have allowed more than 192 yards in each of Mora’s losses to Stanford. Can the Bruins turn around their losing ways on Thursday? \nThis is the first game UCLA has been considered an underdog in 2015. Considering his NFL coaching experience, Mora has ironically struggled vs. Stanford’s pro-style offense. Last season in Los Angeles, Stanford defeated UCLA 31-10. During Stanford’s last seven games vs. UCLA, the Bruins have been outscored 221-96. \nBoth teams enter this game off a bye week, with 10 days to prepare. But UCLA’s injury-riddled defense is playing without key run-stoppers, including star linebacker Myles Jack and defensive lineman Eddie Vanderdoes . Since the Bruins began playing without both Jack and Vanderdoes, Arizona and Arizona State averaged 272.5 yards per game vs. UCLA on the ground. \nStanford averages 209.8 rushing yards per game; UCLA allows rushing 197.0 yards per game. Stanford sophomore running back Christian McCaffrey averages 229.8 total yards per game and 8.1 yards per play, through five games. \n\"A lot of times, people think they have him down and he's still wiggling around back there,\" said UCLA linebacker Deon Hollins , according to LA Times . \"Their offensive line does a good opening holes, and he breaks a lot of tackles. \nQuick Hits \nTwo USC football alum (Hayes Pullard tweeted “remember what Coach O taught us” and Emon Saee tweeted “dude was a father figure to us” ) showed overwhelming support for Ed Orgeron on Twitter … Arizona QB Anu Solomon is the only Pac-12 quarterback yet to throw an interception … Utah has had seven players named Pac-12 Player of the Week; no other team has more than two … Stay tuned with @BryanKalbrosky MORE NEWS: Want stories delivered to you? Sign up for our College Football newsletters.", "external_links": [], "published": "2015-10-13T19:58:00.000+03:00", "crawled": "2015-10-13T20:08:02.229+03:00", "highlightTitle": ""}