{"organizations": [], "uuid": "e1ccd5af48aded419abce7e7842d1955788d72cc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.knoxnews.com", "main_image": "http://sharing.knoxnews.com/sharescnn/photo/2015/10/11/1444583611_25081125_ver1.0_640_480.jpg", "site_section": "http://www.knoxnews.com/feeds/rssFeed?obfType=RSS_FEED&siteId=100106&categoryId=10004", "section_title": "Sports | KNS", "url": "http://www.knoxnews.com/newsy/an-illegal-play-or-part-of-the-game", "country": "US", "title": "An Illegal Play Or Part Of The Game? - Newsy", "performance_score": 0, "site": "knoxnews.com", "participants_count": 1, "title_full": "An Illegal Play Or Part Of The Game? - Newsy Story", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T21:49:00.000+03:00", "replies_count": 0, "uuid": "e1ccd5af48aded419abce7e7842d1955788d72cc"}, "author": "Carter Woodiel", "url": "http://www.knoxnews.com/newsy/an-illegal-play-or-part-of-the-game", "ord_in_thread": 0, "title": "An Illegal Play Or Part Of The Game? - Newsy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The New York Mets have lost their shortstop. The Dodgers' Chase Utley slid hard into Ruben Tejada, breaking the infielder's leg during Saturday's National League Division Series game. And the two teams seem to disagree on whether or not the play was dirty.\n\"He wasn't anywhere close to the bag,\" Mets third baseman David Wright said .\n\"I think every player in the world would have done the same thing that Chase did there,\" Dodgers first baseman Adrian Gonzalez said .\n\"My experience is that's not a slide; that's a tackle,\" Mets outfielder Michael Cuddyer said .\n\"That's baseball. That's part of the game. He probably did slide late, but that's part of the game. Just kind of unfortunate the guy ended up hurt,\" Dodgers infielder Howie Kendrick said .\nSliding hard into second to break up a double play happens all the time in baseball; the question here is whether Utley, who said he never tried to hurt Tejada, went too far. (Video via PETA )\nThose who say he did point to rule 7.09 of MLB's rulebook , which states, in part, a runner \"willfully and deliberately\" trying to break up a double play should be called out — along with the runner headed for first.\nUtley admits he was trying to break up a twin killing, so he might have been in violation of the rule, but his left hand was near the bag. And just because an MLB rule is on the books doesn't mean it's enforced to the letter.\nFor example, Rule 8.04 mandates the pitcher take no more than 12 seconds to pitch when the bases are empty — but when was the last time you saw an ump call a pitcher out for taking too long?\nThat's why some players and fans are pushing for a new rule, and they're backed by a bit of precedent. Before the 2014 season, MLB created a rule aiming to prevent hard collisions at home plate.\nThe rule came three years after star Giants catcher Buster Posey was severely injured following one of those collisions, leading some writers to dub it \"The Buster Posey Rule.\" (Video via Under Armour )\nPadres All-Star outfielder Justin Upton said on Twitter Saturday night Tejada deserves the same treatment, asserting a ‘Tulo Rule' would soon be in place if star shortstop Troy Tulowitzki had been in Tejada's cleats. (Video via Beats by Dre )\nMLB is reviewing Utley's action. Joe Torre, who serves as the league's chief baseball officer, says he's in charge of looking into the slide, which he acknowledges was \"a little late.\"\nUtley was called safe on the play, and went on to score the second of four runs for LA in the seventh. The Dodgers won the game 5-2, tying up the NLDS at a game apiece.\nThis video includes images from Getty Images and music from Bensound / CC BY ND 3.0 .", "external_links": ["http://www.youtube.com/watch?v=XQH4vp42xyw", "https://twitter.com/JUST_JUP/status/653073179942895617?ref_src=twsrc%5Etfw", "http://mlb.mlb.com/mlb/downloads/y2015/official_baseball_rules.pdf", "http://www.youtube.com/watch?v=18To8nBUygE", "http://espn.go.com/video/clip?id=13858183", "http://web.sny.tv/media/video.jsp?topic_id=6479520", "http://www.youtube.com/watch?v=HzB5_8R2dvQ", "http://espn.go.com/video/clip?id=13858208", "http://www.bensound.com/royalty-free-music/track/moose"], "published": "2015-10-11T21:49:00.000+03:00", "crawled": "2015-10-11T21:54:26.329+03:00", "highlightTitle": ""}