{"organizations": ["Devils", "NHL", "New Jersey Devils", "Philadelphia Flyers", "AP Photo/Rich Schultz", "View Larger New Jersey Devils", "AP"], "uuid": "f54ce612b0fab107686457c29d7dded7ae0ae2a6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fox23.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/05/3b/5f/1b2f3b57298a4444a52bf6d788b008ab-f15395e48ffc46ee85989f2beb47c2f6-0.jpg", "site_section": "http://www.fox23.com/list/rss/ap/sports-update/ak5/", "section_title": "Sports Update", "url": "http://www.fox23.com/ap/ap/sports/shero-hynes-era-starts-with-devils-lamoriello-gone/nnwGx/", "country": "US", "title": "Shero, Hynes era starts with Devils, Lamoriello gone", "performance_score": 0, "site": "fox23.com", "participants_count": 0, "title_full": "Shero, Hynes era starts with Devils, Lamoriello gone", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T05:44:00.000+03:00", "replies_count": 0, "uuid": "f54ce612b0fab107686457c29d7dded7ae0ae2a6"}, "author": "", "url": "http://www.fox23.com/ap/ap/sports/shero-hynes-era-starts-with-devils-lamoriello-gone/nnwGx/", "ord_in_thread": 0, "title": "Shero, Hynes era starts with Devils, Lamoriello gone", "locations": ["Newark", "Philadelphia", "NEWARK", "N.J."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tuomo Ruutu", "Hynes", "John Hynes", "Lamoriello", "Shero", "Jacob Josefson"], "text": "Updated: 9:45 p.m. Monday, Oct. 5, 2015 | Posted: 9:44 p.m. Monday, Oct. 5, 2015 Shero, Hynes era starts with Devils, Lamoriello gone ﻿ View Larger New Jersey Devils head coach John Hynes diagrams a play for his team during a timeout during the third period against the Philadelphia Flyers in an NHL preseason hockey game in Newark, N.J., Friday, Oct 2, 2015. The Devils defeated the Flyers 3-2. (AP Photo/Rich Schultz) View Larger New Jersey Devils' Jacob Josefson smiles after getting an assist on a goal by Tuomo Ruutu in the first period of a preseason NHL hockey game against the Philadelphia Flyers, Wednesday, Sept. 30, 2015, in Philadelphia. The Devils won 4-2. (AP Photo/Tom Mihalek) Sponsored Links The Associated Press NEWARK, N.J. — \nAfter missing the playoff the past three years and cleaning house, the New Jersey Devils have a new general manager, a new coach — and basically the same roster as a year ago. \nRay Shero is the new GM with long-time patriarch Lou Lamoriello gone to Toronto. John Hynes will be behind his first NHL bench. \nOther than adding New Jersey-born and raised Kyle Palmieri in a trade and signing Lee Stempniak as a free agent, the Devils have not made any significant changes to their personnel from a team that won just 32 games a year ago. \nHynes, who at 40 is the youngest coach in the NHL, doesn't seem to mind that he is inheriting a team that floundered mightily last season, struggling to score. \n\"We have talked every day about getting better every day and I've seen that so far,\" Hynes said. \"I've seen a lot of progress, both in individual and team development. We're committed to going in the right direction.\" \nThe Devils scored 176 goals last season. Only Buffalo and Arizona had fewer. \n\"It's certainly an area of concern for us,\" said center Adam Henrique, who led the Devils with 43 points (16 goals, 27 assists). \"We weren't scoring goals, but we were fortunate to have Cory (Schneider) in the back keeping us in games. We have to find a way to score more. It's a big focus. With all the changes we've made, we're geared up to play more offensively. Everyone has gotten better.\" \nMike Cammalleri led the team with 27 goals and he's back and healthy for another go. The same cannot be said for veteran Patrik Elias, the franchise's all-time leading scorer, who is sidelined with a knee injury. The 39-year-old Elias, who had 13 goals and 21 assists last year, did not skate throughout training camp. \nThe Devils do have Schneider, who established himself as one of the top goaltenders in the NHL last year. He played in a league-high 69 games, winning 26 and posting a 2.26 goals-against average. \n\"We know that goal scorers don't grow on trees,\" Schneider said. \"You just don't find a 40-goal guy. We have guys here who will score more goals. I'm encouraged by what I see. Our defensemen are able to score.\" \nThe Devils have a solid young defensive unit, led by Adam Larsson, Andy Greene, Eric Gelinas and Damon Severson. Greene, the established veteran, was the only Devil to play in all 82 games last season. \nHere are some other things to watch about the Devils this season: \nCORY IN THE PIPES: Schneider went from being a second-tier goalie to the busiest goalie in the league last year. He's only 29, but it's not known whether handling such a tough workload (69 games) is in the cards in the Hynes regime. Schneider was as steady as they came last year and was the main reason why the team didn't falter more. Keith Kinkaid is a reliable backup. \nIS ELIAS THROUGH?: There were hints during training camp that veteran Elias may not return from his injury. Although Elias' production has been down in recent years, he did provide leadership and stability with a resume that includes 406 goals and 1,017 points. When pushed about Elias' availability, Hynes said that Elias was \"out indefinitely.\" Retirement may be beckoning \nUP TEMPO: Hynes has promised that the Devils will not utilize the neutral zone trap and will look to \"push the puck\" as much as possible. \"We're spending more time on offense to increase our opportunities to score,\" Hynes said. \nROOKIE COACH: Hynes has never coached in the NHL, with his prior head coaching experience coming in the AHL with Wilkes-Barre/Scranton. Most franchises would love to have someone with some NHL experience, but Shero has all the faith in the world in Hynes. \"The whole team has been awesome with him,\" Henrique said. \"There are a lot of new things to learn, but we have high tempo practices every day and that's been great.\" \nNEW IDENTITY: In the last two years, the Devils lost longtime goaltender Martin Brodeur, and then their Hall-of-Fame architect in Lamoriello. Those two people were the faces of the Devils for two decades and three Stanley Cup championships. It's going to take some time to get used to them not being involved.  ", "external_links": [], "published": "2015-10-06T05:44:00.000+03:00", "crawled": "2015-10-06T06:54:47.637+03:00", "highlightTitle": ""}