{"organizations": ["UCLA", "NCAA"], "uuid": "4b51dbe3578048362edd624114241aebec830fdf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsoctv.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/23/de/b7/157851c804724867baff1044e9e06c54-bd49c35edd70470481acf1dbd49ddee0-0.jpg", "site_section": "http://www.wsoctv.com/feeds/categories/sports/", "section_title": "News | Sports", "url": "http://www.wsoctv.com/ap/ap/sports/rosen-leads-ucla-past-no-20-california-40-24/nn8Cb/", "country": "US", "title": "Rosen leads UCLA past No. 20 California, 40-24", "performance_score": 0, "site": "wsoctv.com", "participants_count": 0, "title_full": "Rosen leads UCLA past No. 20 California, 40-24", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T08:43:00.000+03:00", "replies_count": 0, "uuid": "4b51dbe3578048362edd624114241aebec830fdf"}, "author": "", "url": "http://www.wsoctv.com/ap/ap/sports/rosen-leads-ucla-past-no-20-california-40-24/nn8Cb/", "ord_in_thread": 0, "title": "Rosen leads UCLA past No. 20 California, 40-24", "locations": ["California", "Calif.", "PASADENA", "Jordan Payton", "Bolu Olorunfunmi", "Pasadena"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Luke Rubenzer", "Darius Allensworth", "Josh Rosen", "J. Terrill", "Rosen", "Thomas Duarte"], "text": "Updated: 1:43 a.m. Friday, Oct. 23, 2015 | Posted: 1:43 a.m. Friday, Oct. 23, 2015 Rosen leads UCLA past No. 20 California, 40-24 Related View Larger UCLA wide receiver Jordan Payton, right, can't hold on to a pass in the end zone under pressure from California cornerback Darius Allensworth during the first half of an NCAA college football game, Thursday, Oct. 22, 2015, in Pasadena, Calif. (AP Photo/Mark J. Terrill) View Larger UCLA running back Bolu Olorunfunmi, right, has his helmet knocked off as he tries to score past California safety Luke Rubenzer during the first half of an NCAA college football game, Thursday, Oct. 22, 2015, in Pasadena, Calif. (AP Photo/Mark J. Terrill) UCLA wide receiver Thomas Duarte, left, is congratulated by quarterback Josh Rosen after making a touchdown catch during the first half of an NCAA college football game against California, Thursday, Oct. 22, 2015, in Pasadena, Calif. (AP Photo/Mark J. Terrill) Sponsored Links The Associated Press PASADENA, Calif. — \nWith UCLA's season seemingly teetering on the brink of collapse, Josh Rosen calmly propped it back up with a passing performance that put the freshman's name in the Bruins' record book. \nRosen completed a school-record 34 passes and threw two of his three touchdown passes to Devin Fuller, and UCLA got back on track with a 40-24 victory over No. 20 California on Thursday night. \nRosen passed for 399 yards in another splendid game for the standout rookie, and Thomas Duarte had career highs of 10 catches for 141 yards for the Bruins (5-2, 2-2 Pac-12). UCLA rebounded from consecutive losses to Arizona State and Stanford, along with a drop from the national rankings, with a 573-yard offensive performance and a stellar effort by its patchwork defense, which sacked Cal star Jared Goff five times. \n\"Every time you win, it's a step forward,\" said Rosen, who broke the completions record set by Richard Brehaut and Brett Hundley. \"Especially with our bye week, that was three weeks without a win, so it felt great to come out here and put it to them.\" \nRosen was smooth and confident in another big Pac-12 game, going 34 for 47 without a turnover. The frosh got plenty of help, too: Soso Jamabo rushed for a score after star UCLA tailback Paul Perkins left with an injury, and the Bruins' injury-plagued defense limited Jared Goff and Cal's potent offense to 170 yards in the first half. \nDebuting their black-and-shiny-gold \"City\" uniforms, UCLA appeared revitalized. Ka'imi Fairbairn made four field goals, including a school-record 60-yarder at the halftime gun, and the UCLA defense caused trouble for Goff throughout. \n\"The key was getting that quarterback on the ground,\" UCLA coach Jim Mora said. \"We struggle with that, and we got it done against a really good player.\" \nBut even in victory, UCLA added two more significant injuries to its alarming season total. Perkins, last season's Pac-12 rushing champion, ran for 73 yards before limping off in the second quarter. Linebacker Isaako Savaiinaea, the Bruins' leading tackler, then left on a cart in the second half. \nMora didn't disclose specifics about the injuries, only saying: \"They're not good.\" \nGoff passed for 295 yards in a second straight disappointing game for the Bears (5-2, 2-2), who have lost two straight after a sizzling start. \n\"We got punched in the mouth two weeks in a row now, and are going to have to respond one way or the other,\" Goff said. \"I think we're going to respond the correct way, though. It's the type of group we have in there.\" \nKenny Lawler, Darius Powe and Khalfani Muhammad caught TD passes for Cal, which entered the Rose Bowl with its highest ranking in six years and a chance to clinch to clinch bowl eligibility for the first time since 2011. Instead, the Bears still have just one win in Pasadena since 1999. \n\"Things that we haven't done all year, we did tonight,\" Cal coach Sonny Dykes said. \"That's not indicative of this football team, and we didn't play well tonight.\" \nUCLA stumbled back to the Rose Bowl with consecutive losses in conference play for the third straight season, including a 56-35 thrashing at Stanford last Thursday that dropped the Bruins out of the Top 25. Mora's teams have always bounced back from those skids, and the Bruins still haven't lost three straight regular-season games in the coach's tenure. \n\"We got on the road back,\" Duarte said. \"The morale of the team is how it used to be again, so I'm happy. It was definitely a turning point for this team, but we're fighters for sure.\" \nThe Bruins took their first lead in three weeks when Duarte caught a 7-yard TD pass in the first quarter. Fuller capped a 90-yard drive early in the second with a 19-yard scoring grab, and UCLA scored on its first seven possessions. \nCal finally reached the end zone on Lawler's acrobatic grab 51 seconds before halftime, but Rosen moved the Bruins into position for that 60-yard kick by Fairbairn, who was mobbed by teammates when he broke Chris Sailer's UCLA record of 56 yards, set in 1997. \nCal offensive lineman Jordan Rigsbee hit UCLA defensive lineman well after the whistle on the final play, setting off a minor skirmish when both teams ran onto the field for the postgame handshakes. \n___ \nAP College Football site: www.collegefootball.ap.org Copyright The Associated Press Sign up for our WSOC-TV Daily Headlines Newsletter Sign Up", "external_links": [], "published": "2015-10-23T08:43:00.000+03:00", "crawled": "2015-10-23T10:28:08.910+03:00", "highlightTitle": ""}