{"organizations": [], "uuid": "ecd61ef1c0d44f42d5a8e4114fd5ea41c8b116bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cleveland.com", "main_image": "http://imgick.cleveland.com/home/cleve-media/width620/img/cavs_impact/photo/18869845-standard.jpg", "site_section": "http://www.cleveland.com/pdsportsinsider/", "section_title": "Sports Insider | Sports Analysis from Northeast Ohio Media Group - cleveland.com ", "url": "http://www.cleveland.com/cavs/index.ssf/2015/09/lebron_james_and_mo_williams_h.html", "country": "US", "title": "LeBron James and Mo Williams: How they repaired their relationship", "performance_score": 0, "site": "cleveland.com", "participants_count": 10, "title_full": "LeBron James and Mo Williams: How they repaired their relationship | cleveland.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T22:43:00.000+03:00", "replies_count": 9, "uuid": "64fc23e5128818740d3a0438bd512a5f6aa34386"}, "author": "Chris Haynes, Northeast Ohio Media Group", "url": "http://www.cleveland.com/cavs/index.ssf/2015/09/lebron_james_and_mo_williams_h.html#post-0", "ord_in_thread": 0, "title": "LeBron James and Mo Williams: How they repaired their relationship", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CLEVELAND, Ohio – If a player has any desire of suiting up for the Cleveland Cavaliers, they have to check in with LeBron James.\nIt's protocol.\nA blessing from James goes a long way in getting management to increase their intensity level in signing that particular free agent.\n\"Yeah, you have to call. This is his team,\" Mo Williams, who played two seasons with James in Cleveland from 2008-10, told Northeast Ohio Media Group. \"That's no secret. The conversation was made and the feeling was mutual. It was a good conversation.\"\nWilliams and James granted NEOMG separate interviews regarding how their relationship was repaired.\nFor Williams, had he been interested in joining a James-led team a few years ago, the call might have been awkward. More likely, it would have never occurred.\nWilliams notably shared his disapproval on social media on the way James left Cleveland in 2010 to form the Big 3 in Miami. On the day of \"The Decision,\" a frustrated and disappointed Williams tweeted, \"The only thing, and I mean the only thing I disagree with is. ... If he knew somewhere else was the destination, he should have spared Cle.\"\nWilliams took it hard. He had become an All-Star as James' teammate. But devastated by the departure, he contemplated retirement at 27. Their friendship took a hit. They went their separate ways.\nDuring James' first stint in Cleveland, the Cavaliers were arguably the most popular, trend-setting team in the league. They were a flamboyant, flashy, dominant group who had fun in the process. Those pregame choreographed handshakes and pretending to take team photos on the court took pregame rituals to another level.\nNo. 23 instilled that competitive, fun-loving environment and then all of a sudden, he was gone.\n\"That time was hard,\" Williams recalled. \"It just took a little time.\"\nSo how did these two end up sharing the same locker room once again? Williams said James is a forgiving human being. A few years back, Williams reached out to settle their differences. It didn't take long for the conversation to transition to their old time playful banter.\nLast season when the Cavaliers played the Timberwolves in Minneapolis, Williams was sidelined with an injury, but those two playfully chatted it up all game long.\nWhenever play was stopped near the Timberwolves' bench, they were seen laughing and enjoying each other's company. So when Williams called James last summer to gauge how he felt about a return, it was an endorsement James didn't mind supplying to management.\n\"It wasn't any animosity during the talk,\" Williams said. \"I thought when we conversed about the opportunity of me coming back, he was excited, I was excited and we got it done. It was basically simple as that.\"\nThis isn't the first time we've heard about James' forgiving nature. Cavaliers owner Dan Gilbert can also attest to this. But James acknowledges that it doesn't always go so well.\n\"With Mo, it's all about progress over pride,\" James told NEOMG. \"It's something that I learned over the years. But still, I'll hold grudges for a long time. But if it's something that can be a betterment not only for myself but for a group that's trying to do something special, as in this case study with myself and Dan and myself with Mo, I'm for it.\n\"This is something bigger than just two individuals and I recognize that. But if it's just something between me and some other individual and it doesn't affect nobody else besides me and that individual, then it's on.\"\nNow these two will get another opportunity to accomplish what they fell short of five years earlier. They're older, wiser and in some aspects of their games, better than ever. They're excited for the quest, excited they get to do it together again.\n\"We're good,\" Williams said. \"Obviously we're both grown men and that other stuff is in the past. We're together to win a title. That's all that matters.\"", "external_links": [], "published": "2015-09-30T22:43:00.000+03:00", "crawled": "2015-10-01T04:35:12.316+03:00", "highlightTitle": ""}