{"organizations": [], "uuid": "c523c6499ba014a0b9c8b5f7c7059c36411ac8b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "http://images.tribuneindia.com/cms/gall_content/2015/10/2015_10$largeimg08_Thursday_2015_121024517.jpg", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/nation/aap-govt-invites-ghulam-ali-to-perform-in-delhi/143290.html", "country": "US", "title": "AAP govt invites Ghulam Ali to perform in Delhi", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "AAP govt invites Ghulam Ali to perform in Delhi", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "c523c6499ba014a0b9c8b5f7c7059c36411ac8b3"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/nation/aap-govt-invites-ghulam-ali-to-perform-in-delhi/143290.html", "ord_in_thread": 0, "title": "AAP govt invites Ghulam Ali to perform in Delhi", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New Delhi, October 8\nThe Arvind Kejriwal government today invited Pakistani singer Ghulam Ali to perform in the National Capital after his concert in Mumbai was cancelled due to Shiv Sena protests, saying \"music has no boundaries\".\nDelhi Culture Minister Kapil Mishra said the Pakistani Singer is welcome to Delhi for holding a performance.\n\"Sad that #GhulamAli is not being allowed in Mumbai, I invite him to come to Delhi and do the concert. Music has no boundaries. #BanTheBan (sic),\" he wrote on Twitter.\nAli's concert in Mumbai was cancelled yesterday after the Shiv Sena threatened to disrupt it, warning that no artiste from that country will be allowed to perform in the city till terror emanating from across the border is stopped.\nOrganisers of the event had announced the cancellation after a meeting with Shiv Sena president Uddhav Thackeray.\nThe decision was taken despite a snub to Sena by Maharashtra Chief Minister Devendra Fadnavis who said adequate protection would be provided to Ali and that the concert, organised in memory of late ghazal singer Jagjit Singh, would be held according to schedule.\n\"Ghulam Ali's programme has been cancelled. Neither Ghulam Ali nor any Pakistani artiste will be performing at the October 9 event,\" organiser Randhir Roy had said.\nA source close to Uddhav Thackeray had told PTI that the Sena president asked the organisers to refrain from having any Pakistani artiste perform at such programmes.\nReacting to the development, Ali had said the concert was not cancelled from his end. \"Atmosphere is not conducive for me to perform,\" he had said, adding, he wants Indo-Pak ties to improve.\nHe further said that whenever his fans call him with love, he goes and performs.\n\"Such controversies spoil people's 'sur' (note). I am not angry, I am hurt. In love, such things don't happen,\" he had said.\nDescribing Jagjit Singh as his \"good brother\", Ali said wherever they met and performed, \"we were one\".\nJustifying the cancellation, Roy had said, \"Since the situation on the border is not conducive, it is not correct to call and promote any Pakistani singer\".\nThe Shiv Sena had said, \"Ceasefire violations are taking place unabated and yesterday also four jawans were killed in firing by Pakistan which is continuing to sponsor terrorism in this country.\" — PTI", "external_links": [], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T10:10:23.460+03:00", "highlightTitle": ""}