{"organizations": [], "uuid": "951ac027fba03e0a817963e6559d73cf46f19fc6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.keloland.com", "main_image": "http://www.keloland.com/_images/data/800x600/66522.jpg", "site_section": "http://www.keloland.com/_xml/_rss.cfm?cat=sports&tag=professional", "section_title": "KELOLAND.COM: News, Weather and Sports", "url": "http://www.keloland.com/newsdetail.cfm/minnesota-timberwolves-coach-flip-saunders-dies-of-cancer/?id=186537", "country": "US", "title": "Minnesota Timberwolves Coach Flip Saunders Dies Of Cancer", "performance_score": 0, "site": "keloland.com", "participants_count": 0, "title_full": "Minnesota Timberwolves Coach Flip Saunders Dies Of Cancer", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T21:31:00.000+02:00", "replies_count": 0, "uuid": "951ac027fba03e0a817963e6559d73cf46f19fc6"}, "author": "", "url": "http://www.keloland.com/newsdetail.cfm/minnesota-timberwolves-coach-flip-saunders-dies-of-cancer/?id=186537", "ord_in_thread": 0, "title": "Minnesota Timberwolves Coach Flip Saunders Dies Of Cancer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Minnesota Timberwolves Coach Flip Saunders Dies Of Cancer October 25, 2015, 1:31 PM MINNEAPOLIS, MN - \nFlip Saunders, the longtime NBA coach who won more than 650 games in nearly two decades and was trying to rebuild the Minnesota Timberwolves as team president, coach and part owner, died Sunday, the team said. He was 60. Saunders was diagnosed with Hodgkins lymphoma in June and doctors called it \"treatable and curable\" when the Minnesota Timberwolves made the diagnosis public in August. He took a leave of absence from the team in September after complications arose during his recovery. Saunders went 654-592 in 17 seasons with the Timberwolves, Detroit Pistons and Washington Wizards. Sam Mitchell has been named interim head coach of the Timberwolves and GM Milt Newton is heading the team's personnel department. \nBefore spending nearly two decades to rebuild the Minnesota Timberwolves, Saunders had a stint in Rapid City and in Sioux Falls. Mike Heineman, the president of the Sioux Falls Skyforce knew Saunders and said he made an impact on the basketball community. \n\"I was really bummed out, we knew he was sick. It seemed like was gonna be OK, then it just turned. It was a tough deal because he's so young. To me a guy who shouldn't be passing away yet. It's tough for a lot of people. Obviousy for his family number one, but for the world of basketball to loose a guy like Flip Saunders - it's not going to be easy,\" Heineman said. \nSaunders chalked up more than 1,000 victories over a 35-year year coaching career. The Timberwolves open the season Wednesday. The Associated Press contributed to this report. © 2015 KELOLAND TV. All Rights Reserved.", "external_links": [], "published": "2015-10-25T21:31:00.000+02:00", "crawled": "2015-10-26T09:09:25.501+02:00", "highlightTitle": ""}