{"organizations": [], "uuid": "b6e01c54b3b0e9de428445e9dfabf6e803574d32", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pekintimes.com", "main_image": "http://www.pekintimes.com/storyimage/IP/20151024/NEWS/151029611/AR/0/AR-151029611.jpg", "site_section": "http://www.pekintimes.com/sports?template=rss&mime=xml", "section_title": "Sports - Pekin Daily Times", "url": "http://www.pekintimes.com/article/20151024/NEWS/151029611/2000/NEWS?rssfeed=true", "country": "US", "title": "PCHS Roundup: Lady Dragons can't stop champion Limestone", "performance_score": 0, "site": "pekintimes.com", "participants_count": 1, "title_full": "PCHS Roundup: Lady Dragons can't stop champion Limestone", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T08:37:00.000+03:00", "replies_count": 0, "uuid": "b6e01c54b3b0e9de428445e9dfabf6e803574d32"}, "author": "Steve Stein Times Correspondent", "url": "http://www.pekintimes.com/article/20151024/NEWS/151029611/2000/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "PCHS Roundup: Lady Dragons can't stop champion Limestone", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Oct. 24, 2015 at 12:37 AM Pekin played a role in determining the Mid-Illini Conference volleyball champion. Unfortunately, it wasn’t the role the Lady Dragons wanted to play. Limestone beat visiting Pekin 25-17, 25-21 Thursday and won the conference title outright thanks to Washington’s 18-25, 25-21, 27-25 victory over Morton. The Rockets (29-5, 12-2) ended up all alone in first place in front of runner-up Morton (20-10, 11-3) and third-place Washington (24-11, 10-4). Pekin (21-13, 8-6) finished in a fourth-place tie with Metamora while setting a team record for Mid-Illini wins in a season. The Lady Dragons had never won more than seven conference matches in a year since Pekin joined the Mid-Illini in 2006. “Limestone played a very good match and we had too many service errors,” said Pekin coach Yvonne Thompson. “Now that the regular season is over, we have focus on the post-season. If we stay focused and earn our points, this team can go far.” Alexus Mercer had seven kills and Maddy Cash had six kills for Pekin in the loss to Limestone. Hannah Thompson had nine digs and Haley Peterson dished out 15 assists. The Lady Dragons didn’t have any ace serves. Brittany Robinson had 14 kills and two aces for Limestone. Fresh faces Pekin’s talented freshmen swimmers continued to impress Wednesday. Led by record-setting Kelen McDaniels, the Lady Dragons finished fifth among 10 teams in the Peoria Richwoods Freshman Invitational girls swimming and diving meet. McDaniels won the 50 freestyle (:25.15) and 50 butterfly (:27.52). Her time in the 50 freestyle broke the meet record of :25.35 set last year by Metamora’s Noelle Peplowski. Her clocking in the 50 butterfly was just off the meet record (:27.44.) “Kelen had some great swims and she scored the most points of any swimmer. No question she was the standout of the meet,” said Pekin coach Mitch Richards. The Lady Dragons’ 200 freestyle relay team was second (1:51.32) and 200 medley relay team was third (2:06.98). Claire Whiting, Shae Campbell, McDaniels and Lauren Spanos were on the 200 freestyle team. Whiting, Campbell, McDaniels and Grace Nieukirk were on the 200 medley team. “I was really impressed with our relay splits. Most were personal-best times,” Richards said. Whiting was third in the 50 backstroke (:31.87) and sixth in the 100 individual medley (1:14.15). Spanos was fourth in the 100 freestyle (1:06.98) and 10th in the 150 freestyle (1:46.44). Campbell was sixth in the 150 freestyle (1:38.99) and 400 freestyle (4:49.25). Dunlap (192), Metamora (184), Normal Community (166) and Peoria Notre Dame (162) finished in front of Pekin (149) in the team standings. “This is always a fun meet for swimmers to attend. Even coaches,” Richards said. “The short events are a nice change of pace and the freshmen get to show their stuff. Page 2 of 2 - “The meet (Wednesday) showed the potential of our young swimmers. I’m excited to see what they’ll do the rest of the season and over the next three years.”", "external_links": [], "published": "2015-10-24T08:37:00.000+03:00", "crawled": "2015-10-24T18:03:35.719+03:00", "highlightTitle": ""}