{"organizations": [], "uuid": "665e03590f8753c3cb091e7b433e540629cff79f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "nmpreps.rivals.com", "main_image": "", "site_section": "http://oregonstate.rivals.com/rss2feed.asp?type=HS&state=NM", "section_title": "New Mexico High School Sports Headlines", "url": "https://nmpreps.rivals.com/content.asp?CID=1814706", "country": "GB", "title": "New Mexico High School Football Week Preview", "performance_score": 0, "site": "rivals.com", "participants_count": 0, "title_full": "New Mexico High School Football Week Preview", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T16:25:00.000+03:00", "replies_count": 0, "uuid": "665e03590f8753c3cb091e7b433e540629cff79f"}, "author": "", "url": "https://nmpreps.rivals.com/content.asp?CID=1814706", "ord_in_thread": 0, "title": "New Mexico High School Football Week Preview", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New Mexico High School Football Week Preview Kyle Henderson NMPreps.com Publisher \nIt's finally Friday on NMPreps.com and today we preview the entire state of New Mexico like no one else. Here is a look at our week 8 high school football preview. Head back to NMPreps.com starting at 4:00PM MST for Live Coverage. \nPictured: Rio Rancho will host Volcano Vista in a marquee Metro Area Match Up tonight. Week 8 Schedule The New Mexico High School Football Season enters week 8 and there is no better place to catch all the live coverage than at NMPreps.com each Friday Night. Live scores tonight at 4:00PM MST New Mexico High School Football Schedule \nAtrisco Heritage 42, Valley 33 F Las Cruces 56, Gadsden 6 F \nFriday, October 16th Rio Grande vs. West Mesa (Community) Santa Fe @ Cleveland \nJemez Valley @ Ts'e Yi Gai Midseason All-State Selections \nNo. 1 Cleveland vs. Santa Fe Cleveland 6-0 \nNo. 2 Eldorado vs. Sandia Eldorado 6-1, 1-0 \nNo. 4 Las Cruces beat Gadsden 56-6 Las Cruces now 6-2, 2-0 Gadsden now 1-6, 0-1 \nNo. 7 Volcano Vista @ Rio Rancho Volcano Vista 5-2, 1-0 \nNo. 8 Rio Rancho vs. Volcano Vista Volcano Vista 5-2, 1-0 \nNo. 11 Manzano vs. Highland Manzano 4-3, 1-0 \nNo. 14 Sandia vs. Eldorado Eldorado 6-1, 1-0 No. 15 St. Pius X @ Lovington St. Pius X 7-0, 0-0 Lovington 1-5, 0-0 \nNo. 16 Piedra Vista vs. Miyamura Piedra Vista 5-2, 1-0 \nNo. 18 Moriarty vs. Grants Moriarty 5-2, 0-0 \nNo. 20 Farmington vs. Aztec Farmington 5-2, 0-1 \nNo. 21 Onate vs. Deming Onate 2-5, 0-1 \nNo. 22 Hatch Valley vs. Silver Hatch Valley 7-0, 1-0 \nNo. 23 Espanola vs. Del Norte Espanola 6-0, 0-0 \nNo. 25 Chaparral vs. Centennial Centennial 6-0, 1-0 \nList of prospects that hold scholarship offers - E-mail me updates to [email protected] or text me to 505.577.5953. \nHenry Hattis - Cleveland - Offensive Linemen Class of 2016 \nGrant Hermanns - Rio Rancho - Offensive Linemen Class of 2016 \nTeton Saltes - Valley - Defensive Linemen Class of 2016 Uncommitted Offers from: CAL, Iowa State, New Mexico, Oregon, San Diego State, Texas Tech, Washington, and Washington state \nKameron Miller - Las Cruces - Quarterback Class of 2016 Hendo's Pick Del Norte @ Espanola Valley When else am I going to get to pick Espanola Valley? Sundevils have a shot to get to 7-0. Volcano Vista @ Rio Rancho Coach David Howes and Co. know how to win big games. This one should be a thriller. Hope Christian @ Ruidoso Long trip from ABQ. but Hope survives Ruidoso. Expecting Caleb Meyer Hagen to have big night. Valencia @ Belen Battle for the Farm Plow - I think Coach John Lerma finds a way to win late in the game. Valley vs. Atrisco Heritage Who wants it more? Big rivalry game going down tonight. Thinking Aaron Bean busts a few long runs as the Jags move to 2-0 in district. Centennial @ Chaparral Lobos have come a long way, but Centennial is a team that is simply on another level. Deming @ Onate Knights win a must win game Friday Night against Deming. Onate could still shake things up in district. Miyamura @ Piedra Vista Piedra Vista continues to be the alpha in district. Wins by 10. Silver @ Hatch Valley Thought about taking Silver for a second... Hatch Valley however I think wins in a very tight contest. Sandia vs. Eldorado Eldorado does what they have been doing all year. Rollin'. Eagles win big. St. Pius X @ Lovington Sartans win big in Lovington, Drew Ortiz and Miles Hilton go off... NMMI @ St. Mike's Horsemen are able to tame a good Colt's team. What's On Tap In Week 8 \nRio Rancho hosts Volcano Vista in one of the biggest district games so far of the season. Not only is district placement on the line, but so is playoff seeding. What are differences between these two teams this season? \nCentennial aka the No. 1 in Class 5A makes the short travel trip to take on Chaparral who is quite the surprise at 5-1 and 1-0 in district after a 38-20 win over Valencia. Anyone think Chaparral keeps it close? Mark Aguilar's name should be mentioned in Coach of the Year. When was the last time that Chaparral beat Gadsden??? \nClayton heads to Estancia this weekend. The Yellowjackets nearly upset Robertson last week, can they keep up with Estancia? It's a rematch of the 2014 state title game. Is there anyone in 3A that can handle Estancia this year? \nDel Norte @ Espanola is a game I am actually thinking of attending. I can't believe I am even saying that. In my heart I feel Del Norte wins this game, but Espanola has had two weeks to prepare for the Knights and the Sundevils have a ton of momentum. If Espanola goes 10-0 where does the NMAA seed them? If Espanola loses to Del Norte and to Capital, finishing 8-2 will they miss the playoffs? \nDeming and Onate play in a key district 3-6A game. Are both of these teams already out of playoff contention? \nGateway @ Melrose is pound for pound the best game on tap this weekend. The Warriors have scored 307 points and allowed just 46. Melrose is 7-0, riding a 15-game winning streak, the Buffs have scored 386 and allowed just 34 points. Who you got this weekend? \nManzano will try to make it three in a row this weekend against Highland. Currently the Monarchs are 4-3 and 1-0 in district with back to back wins over Mayfield and Sandia. Is Manzano already a playoff lock, can the Monarchs get in with a .500 record? \nSilver and Hatch is a game that is really on the radar for me this weekend. Silver has played a very tough schedule and has won 4 in a row. Hatch is a perfect 7-0 and one of the best Hatch teams at least on paper since the early 2000's outscoring the comp 352-68. Who has seen both Hatch and Portales, how do they compare? Any chance Silver can pull off the upset? \nSt. Pius will try to get to 8-0 this weekend against a struggling Lovington team. I've seen St. Pius X in action and while I think their schedule has been as soft as quality TP, their skill position players and experience make them dangerous. Is St. Pius X a final four team, best St. Pius X team since 1999? \nSt. Mike's hosts NMMI on Saturday at one of my favorite venues in New Mexico. Bet you did not know that NMMI is 6-0 after beating Ruidoso 28-20. The Horsemen are 4-2 coming off a 53-18 win over Pojoaque. Thoughts on St. Michael's this year, who has seen NMMI play? Week 7 All-NMPreps.com Team \nBased off stats and top performances from week 7. Please continue to update us weekly regarding your top players, always need more defensive nominations. \nOffense \nQB - Orlando Perez - Manzano - Threw for 100-yards, ran for 134-yards returned kickoff 74-yards for a touchdown against Sandia. \nQB - Marcos Gonzales West Mesa; 186 passing with 3TD's, 176 Rushing yards with 3 TD's, and 1 interception on Defense. Total of 6 TD's against Valley \nRB - Ethan Duff - Artesia - Ran for 152-yards, 50-yards receiving against Alamogordo \nRB - Isaac Vance - Mayfield - Ran for 192-yards and 2 touchdowns against Onate \nTE - Josh Barton - Volcano Vista - Caught touchdown against Cibola \nWR - David Inman - Eldorado - Caught 80-yard touchdown against La Cueva \nWR - Devin Beard - Hobbs - Caught for 200-yards and 4 touchdowns against Lovington \nWR - JR Pena - Centennial - Caught for 118-yards and 3 touchdowns against Los Lunas \nWR - Ethan Alvarado - Mayfield - Caught touchdown pass against Onate \nWR - Miguel Sena - West LV - 6 catches for 173-yards and 4 touchdowns \nOL - Las Cruces - The Las Cruces Bulldawgs racked up a total of 530-yards last Friday Night against Deming, 401 which came on the ground, 129-threw the air. \nDefense \nDL - Joren Dickey - Volcano Vista - 3 sacks against Gallup \nDL - Brendan Whalen - Aztec - 2 sacks against Gallup \nDL - Codey Scott - Artesia - 2 sacks against Alamogordo \nLB - Dalton Mendoza - Loving - 11 tackles \nLB - Brian Parks - Volcano Vista - 6 tackles against Cibola \nLB - Jake Boykin - Centennial - 8 total tackles against Los Lunas \nLB - Cedric Reynaud - Centennial - 2 tackles, 1 int against Los Lunas \nDB - Carlos Carrasco - Artesia - Two interceptions against Alamogordo \nDB - Allan Rodriguez - Volcano Vista - Interception against Cibola \nSpecial Teams \nKurt Kelly - Clovis - Returned punt 50-yards against Grants \nChristian Chavez - Piedra Vista - Kicked 35-yard FG against Farmington \nNick Mourning - Volcano Vista - Recovered fumble, kicked field goal against Cibola \nTalk about it in NEW MEXICO PREP FOOTBALL INSIDER FEATURED PRODUCT", "external_links": [], "published": "2015-10-16T16:25:00.000+03:00", "crawled": "2015-10-17T00:40:53.655+03:00", "highlightTitle": ""}