{"organizations": [], "uuid": "f6d723a5fa73924f876e8d4e2701631c3e164d68", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.myjoyonline.com", "main_image": "http://photos.myjoyonline.com/photos/news/201510/1480793421622_1580924118144.jpg", "site_section": "http://www.myjoyonline.com/pages/rss/site_sports.xml", "section_title": "Ghana Sports Homepage", "url": "http://www.myjoyonline.com/sports/2015/October-18th/dear-floyd-mayweather-boxing-is-in-good-hands-with-golovkin-around.php", "country": "US", "title": "Dear Floyd Mayweather, boxing is in good hands with Golovkin around", "performance_score": 0, "site": "myjoyonline.com", "participants_count": 0, "title_full": "Dear Floyd Mayweather, boxing is in good hands with Golovkin around", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T07:10:00.000+03:00", "replies_count": 0, "uuid": "f6d723a5fa73924f876e8d4e2701631c3e164d68"}, "author": "", "url": "http://www.myjoyonline.com/sports/2015/October-18th/dear-floyd-mayweather-boxing-is-in-good-hands-with-golovkin-around.php", "ord_in_thread": 0, "title": "Dear Floyd Mayweather, boxing is in good hands with Golovkin around", "locations": ["New York City"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["David Lemieux", "Golovkin", "Floyd Mayweather", "Gennady Golovkin"], "text": "Date: 18-10-2015 Time: 04:10:06:pm Gennady Golovkin made easy work of David Lemieux in New York City. \nEven if it wasn’t officially the beginning of boxing’s post-Mayweather era – even if the sport’s longtime standard-bearer comes out of retirement to fight once or twice more next year – it sure felt like the sport had moved on Saturday night in New York City. \nThat a page has turned. \nGennady Golovkin, so feared and avoided and marginalized throughout his ascent from YouTube curiosity to world middleweight champion that it was thought he might never get a big fight, had finally enticed a top-flight opponent into the ring – an occasion HBO saw fit for his pay-per-view debut. \nAnd boy did he deliver. \nAfter Golovkin’s eight-round destruction of the Canadian puncher David Lemieux in a middleweight title unification fight before 20,548 fans at Madison Square Garden, as the doubts over his caliber of opposition continue to fade, it seems not even boxing’s biggest names can avoid the heavy-handed Kazakh much longer. \nThe knockout artist known as Triple G won every minute of every round before a crowd that feted him as a superstar, flooring Lemieux in the fourth and bloodying his opponent until referee Steve Willis intervened at 1:32 of the eighth. \n“I think today for David, he went to school: boxing school,” said Golovkin, who’s become as adored for his broken-English bon mots as his crowd-pleasing style. “Different class. Respect his strong. He’s champion. \n“Different class.” \nGolovkin (34-0, 31 KOs) has now stopped 21 consecutive opponents inside the distance, a streak that extends back to when he was fighting eight-rounders during George W Bush’s administration. His knockout percentage (91.1%) is the highest in middleweight championship history and a better clip than Mike Tyson after 34 fights. He’s the surest bet for entertainment in sports today. \nAnd he just may have succeeded Mayweather, who announced his retirement after a September win over Andre Berto, atop boxing’s pound-for-pound summit. \nGiven the fighters’ stylistic proclivities and career knockout rates in the 90% range, Saturday’s main event had been marketed around the inevitability of fireworks. More optimistic observers foresaw a sort of Hagler-Hearns redux. That wasn’t quite how it played out. \nInstead, Golovkin was patient and methodical from the opening bell, controlling the action with his ramrod jab. It seemed everything he threw regardless of caliber wobbled Lemieux, auguring the devastation to come. \nLemieux (34-3, 31 KOs) came out strong in the third, connecting flush with a pair of straight rights upstairs. But Golovkin immediately fired back with a massive right that gave Lemieux pause, then followed up with educated combinations that picked the Canadian apart. “He showed he could box a little bit, he’s not just a puncher,” Golovkin’s trainer Abel Sanchez said afterward. \nGolovkin landed a left-right combination early in the fifth but Lemieux responded in kind, offering a glimmer of the two-way action that had been anticipated and whipping the crowd into a white-hot frenzy. Yet Lemieux was unmistakably getting the worst of the exchanges and was finally dropped by a three-punch sequence punctuated by a left to the body late in the round. He beat the count, barely it seemed, and was saved by the bell as Golovkin closed in for the finish. It would have to wait. \nBy the seventh Lemieux was bleeding from the nose and mouth, the referee at one point stopping the action so the ringside doctor could determine if he was fit to continue. Golovkin, without so much as a blemish on his cherubic visage, continued to mete out punishment. Finally in the eighth when yet another TNT-packed right hand found its target, Willis stepped in to stop it. \n“He’s a good fighter, a great champion,” said Lemieux, who was upset with the timing of the stoppage even though it spared him the sort of undue punishment that shortens careers. “I wanted to extend the fight a little bit longer but the referee didn’t see it the same way and that was it.” \nThe Kazakh connected with 280 of 549 punches (51%), compared to 89 of 335 (27%) for Lemieux. He landed more than 21 jabs per round, more than quadruple the middleweight division average according to CompuBox. “Today is big day for me, I am very proud,” he said. “Is big step for next. My goal is to unify all the belts.” \nGolovkin, who entered with the WBC’s and WBA’s pieces of the fractured middleweight championship, added Lemieux’s IBF strap before a crowd that included GOP presidential candidate Donald Trump (who was lustily booed upon entrance). Though few doubt GGG is the most dangerous 160lb fighter in the world, the lineal champion of the division is Miguel Cotto, the former 140, 147 and 154lb champion who captured the WBC title from a shopworn Sergio Martinez in 2014. \nCotto will put that title on the line on 21 November against Canelo Alvarez. Ideally, the winner will fight Golovkin in 2016’s biggest fight: for the title of undisputed middleweight champion. \n- \nFollow Joy Sports on Twitter: @Joy997FM. Our hashtag is #JoySports", "external_links": [], "published": "2015-10-18T07:10:00.000+03:00", "crawled": "2015-10-19T02:52:42.327+03:00", "highlightTitle": ""}