{"organizations": [], "uuid": "dcfb41ac0a79f869f38f8638e971e0d8ad148319", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/nfl", "section_title": "NFL News, Scores, Schedule, Standings, Stats, Photos, Videos - Football - MSN Sports", "url": "http://www.msn.com/en-us/sports/nfl/can-the-arizona-cardinals-continue-their-hot-start/ar-AAfwLNC", "country": "US", "title": "Can the Arizona Cardinals Continue Their Hot Start?", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "Can the Arizona Cardinals Continue Their Hot Start?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "dcfb41ac0a79f869f38f8638e971e0d8ad148319"}, "author": "Sal Cacciatore", "url": "http://www.msn.com/en-us/sports/nfl/can-the-arizona-cardinals-continue-their-hot-start/ar-AAfwLNC", "ord_in_thread": 0, "title": "Can the Arizona Cardinals Continue Their Hot Start?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Can the Arizona Cardinals Continue Their Hot Start? numberFire 3 hrs ago Sal Cacciatore © APImages Can the Arizona Cardinals Continue Their Hot Start? We're five weeks into the NFL season, and Arizona has played like the best team in football, just like we all thought before the year.\nAdChoices Or not.\nThe Cardinals are 4-1 with four blowout wins, and their only blemish was a 24-22 loss to the Rams in Week 4. They lead the league in average margin of victory (20.0), and came into Week 6 ranked first in our nERD power ratings . Based on their nERD rating, we would expect the Cardinals to beat an average opponent by 12.5 on a neutral field.\nThey have our top offense and our third ranked defense in terms of our opponent-adjusted Net Expected Points (NEP) metric.\nIt might be tempting to view these Cardinals as an extension of the 2014 Arizona squad that went 8-1 to start the season before losing Carson Palmer for the season.\nPalmer is back and playing well, but a closer look at the numbers cuts against this narrative.\nThe 2014 Cardinals were not nearly as dominant as this year’s birds, as they ranked ninth in the league in point differential before Palmer’s ACL tear, outscoring opponents by an average of 5.9 points per game.\nThey finished the regular season ranked 16th in average margin of victory (0.7), despite an 11-5 record that tied for sixth best in the league. They outperformed their pythagorean record by three wins, suggesting the Cardinals were a mediocre team that got lucky, rather than one of the best squads in the league.\nThings are different this season, as the Cardinals point differential is one of a truly dominant unit.\nStill, they almost certainly will not go 15-1 or continue to outscore their opponents by 20 points per game (though if they did, their +320 point differential would be second to the 2007 Patriots for best ever ).\nSome kind of regression is coming, so how much of what has made Arizona successful can we expect to continue?\nWhat Is Sustainable\nContrary to what Ray Lewis might tell you on the Monday Night Football post-game show, the most important aspects to success in the NFL are passing and stopping the pass.\nBrian Burke (then of Advanced Football Analytics, now of ESPN) wrote that net yards per pass on offense and defense are two of the most important stats in football, repeatedly finding that they correlate with victory at significantly higher rates than rushing efficiency on either side of the ball .\nFortunately for the Cardinals, they have stood out in both areas.\nArizona is second only to the Bengals in yards per drop back with 8.1, and is tied for fifth in yards allowed per pass play (5.1).\nThis efficiency was not evident last year, as the Cardinals were 18th in net yards per pass on offense (6.4), and tied for 23rd on defense (6.8).\nThis is not even all about Carson Palmer being better than backups Drew Stanton and Ryan Lindley either, as Palmer was 12th in the NFL in NY/A last season with 6.7.\nFew quarterbacks have thrown deeper than Palmer this year, as he is third in the league in yards per completion (13.7), and only seven quarterbacks have gained a smaller percentage of their passing yardage after the catch, per SportingCharts.com .\nUnlike last year, though, the Cardinals passing attack has not been of the “boom or bust” variety, but has been one of the league’s more consistent attacks. Palmer ranks seventh among the 32 quarterbacks in the league with at least 100 pass plays in success rate (52.9%), the percentage of plays that gain positive expected points.\nLast season, Palmer (46.8%) ranked 22nd (out of 43 players), while Stanton (40.2%) ranked 40th.\nPassing success rate also correlates highly with victory, and since it is less sensitive to big plays, Burke actually found it to correlate with itself at an even higher rate than net yards per pass.\nSpeaking of success rate, the rushing equivalent is more consistent and correlates with victory at a greater rate than raw yards per carry.\nThis is more good news for the Cardinals, as after ranking 30th in offensive rushing success rate last season, they have two backs ranked in the top 16 in the league (among the 60 backs with at least 18 carries).\nRookie David Johnson has gained positive expected points on 61.1% of his runs to lead the league, while veteran Chris Johnson ’s 45.6% success rate is 16th.\nAlso, while yards per carry is less important than success rate, it doesn’t hurt that the Cardinals also lead the league in this stat, having gained 5.0 yards per rush.\nWhat Is Not Sustainable\nLast season, the Cardinals consistently won the turnover battle, finishing the season eighth in the league in turnover differential (+8) to help an otherwise average team look like a very good one.\nThe Cardinals are again posting a high-turnover margin (+6), raising what has been a great team to even greater heights.\nThat's the good news.\nThe bad news is turnovers are incredibly random and past turnover margin has a very low correlation with future turnover margin .\nFrom 2009 to 2014, a team’s turnover differential in its first eight games correlates with its differential in its next eight at about 0.20 (a correlation coefficient of 0 implies no relationship, while 1 implies a perfect relationship). Based on this, past turnovers do not actually seem like a very good way of predicting future ones.\nThe 2014 Cardinals were a case study in how flukey turnovers can be, as they recovered a league-high 62.9% of all fumbles (teams should only be expected to recover half), and outperformed their expected interception (league average interception-per-incompletion rate times total incompletions) percentages on both offense and defense.\nHas this good fortune continued in 2015 for the Cardinals?\nIn some areas, yes.\nTheir actual interception rate (1.97%) is again better than their expected interception rate (2.47%), and the 0.5% gap between the two numbers is 10th-highest in the league.\nPalmer certainly deserves credit for avoiding turnovers, something he had not done consistently until last season. Palmer has a below-average interception rate for his career, and had only posted an above-average rate in four of his 10 seasons leading up to 2014.\nSince only six players with at least 100 pass attempts have a better interception rate than Palmer since the start of last season , he has either acquired a new skill as he has aged or has been the beneficiary of random variation.\nThere has probably been a little of both factors, but it would be safe to bet on the latter being the dominant one. Danny Tuccitto found that interception rate for a quarterback takes over 1,600 pass attempts to stabilize (1,600 is the number of attempts it takes before a quarterback’s interception rate correlates with itself at a rate that implies 50% performance and 50% randomness).\nPalmer has thrown 372 passes since the start of 2014, so some degree of regression is probably to be expected.\nThe same is true on defense, as no defense in the NFL has outperformed its expected interception rate more than Arizona this year. Based on the incomplete passes they have forced, we would expect the Cardinals defense to have an interception rate around 2.7%. In reality, the Cardinals have picked off a league-high 5.7% of opponents passes.\nThe Arizona secondary is full of playmakers like Tyrann Mathieu and Patrick Peterson , so it’s reasonable to expect them to continue to post an above-average interception rate.\nKnowing what we know about turnover variation, though, it's probably unreasonable to expect this rate to continue to be over two standard deviations above the mean.\nThe Cardinals have not been nearly as lucky with fumbles this year, recovering only 33.3% of them , so while their interception numbers should regress, it could be at least partially offset by a higher fumble recovery rate.\nOne other area where we should expect regression is the insane number of interceptions and kicks the Cardinals have returned. Arizona has four return touchdowns (three on interceptions, one on a David Johnson kickoff return), twice as many as any other team in the league .\nOnly 16 teams since the merger have returned more interceptions and/or kicks for scores in their first five games : the 2014 Eagles (7), 2003 Chiefs (6), 1970 Vikings (6), 1973 Redskins (6), and the 12 teams tied with five apiece.\nThese 16 teams averaged 2.9 return touchdowns in their remaining 11 games.\nSince 2012, there is a correlation coefficient of 0.02 between a team’s interception return touchdowns in the first half of the season and the second half, and the same goes for kick returns.\nThese returns are things that have helped the Cardinals, but it would not be a good bet to expect this to continue.\nLooking Ahead\nAs long as the Cardinals can keep moving the ball through the air and stopping opponents from doing the same, the expected regression in terms of interceptions and the return game should not have too big of an impact, as this will stay one of the better teams in the league.\nAs of Wednesday, our numbers predicted the Cardinals to go 7.6-3.4 the rest of the way, finishing with 11.6 wins, and narrowly falling to the Falcons for top seed in the NFC (Atlanta has a ridiculously easy schedule, for the record).\nWe give the Cardinals a 92.9% chance to make the playoffs, an 81.6% chance to win the NFC West, and a 19.4% chance to win the Super Bowl, the highest championship odds in the NFL.\nSo don’t look at these Cardinals as a team continuing what they started last season. This team is much different and much better.\nGo to MSN Home", "external_links": ["http://archive.advancedfootballanalytics.com/2007/07/what-makes-teams-win-3.html", "https://www.numberfire.com/nfl/players/patrick-peterson", "http://www.pro-football-reference.com/pi/share/62i7j", "http://archive.advancedfootballanalytics.com/2010/11/predictivity.html", "http://www.advancedfootballanalytics.com/index.php/home/research/general/79-examining-luck-in-nfl-turnovers", "http://www.pro-football-reference.com/play-index/tgl_finder.cgi?request=1&match=single&year_min=2014&year_max=2014&game_type=R&playoff_round=&game_num_min=0&game_num_max=99&week_num_min=0&week_num_max=99&game_day_of_week=&game_time=&time_zone=&game_location=&surface=&roof=&stadium_id=&temperature_gtlt=lt&temperature=&game_result=&overtime=&league_id=&team_id=&team_conf_id=&team_div_id=&opp_id=&opp_conf_id=&opp_div_id=&team", "https://www.numberfire.com/nfl/players/david-johnson-1", "https://www.numberfire.com/nfl/players/carson-palmer", "https://www.teamrankings.com/nfl/stat/fumble-recovery-pct?date=2015-02-01", "https://www.numberfire.com/nfl/players/chris-johnson", "https://www.numberfire.com/nfl/players/tyrann-mathieu-1", "https://www.numberfire.com/nfl/players/drew-stanton", "https://www.teamrankings.com/nfl/stat/fumble-recovery-pct", "http://intentionalrounding.com/when-does-interception-rate-stabilize/", "http://go.microsoft.com/fwlink/?LinkID=286759", "http://www.pro-football-reference.com/pi/share/whGAO", "http://www.sportingcharts.com/nfl/stats/quarterback-air-yards/2015/", "http://www.footballperspective.com/interceptions-per-incompletion-or-popip/", "http://www.pro-football-reference.com/pi/share/UTrrx", "https://www.numberfire.com/nfl/players/ryan-lindley", "http://www.pro-football-reference.com/pi/share/5Vbhy", "http://archive.advancedfootballanalytics.com/2008/03/singal-vs-noise-in-football-stats.html", "https://www.numberfire.com/nfl/teams/power-rankings/"], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-17T01:07:09.445+03:00", "highlightTitle": ""}