{"organizations": [], "uuid": "77369684c75bfb49d0339a863ee1578cfb78bf5a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailyherald.com", "main_image": "http://www.dailyherald.com/storyimage/DA/20151007/NEWS/151008969/AR/0/AR-151008969.jpg&amp;updated=201510081245&amp;imageversion=Facebook&amp;exactH=630&amp;exactW=1200&amp;exactfit=crop&amp;noborder", "site_section": "http://www.dailyherald.com/rss/feed/?feed=sports_all", "section_title": "DailyHerald.com &gt; Sports", "url": "http://www.dailyherald.com/article/20151007/news/151008969/", "country": "US", "title": "Cubs fans unite: 'We got this. This is our year'", "performance_score": 0, "site": "dailyherald.com", "participants_count": 2, "title_full": "Cubs fans unite: 'We got this. This is our year' - DailyHerald.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T20:45:00.000+03:00", "replies_count": 1, "uuid": "aa4522511b35067568fef65940a7e811708c394f"}, "author": "Erin Hegarty", "url": "http://www.dailyherald.com/article/20151007/news/151008969/#post-0", "ord_in_thread": 0, "title": "Cubs fans unite: 'We got this. This is our year'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Editor's note: It was a long day. Erin and Lauren prowled around Wrigleyville and the 'burbs Wednesday night, soaking in the anticipation and then joy of Cubs fans.\n5:40 a.m.: Wild Card Wednesday starts early, as Ryne Sandberg arrives at Harry Caray's in River North to lead a pre-dawn Cubs rally with Dutchie Caray, Ronnie Woo Woo, Ivy Man, a Harry impersonator and the L.A. band, Jelly of the Month Club. The band tries out their new song, \"Cubs Cubs Cubs\" on the hundreds of people who are there, some of them who have been in line since 3 a.m. (Hear the song at www.youtube.com/watch?v=AnYbvx8xxEU ).\nSandberg produces the glove Moises Alou was using on the night of the Steve Bartman incident, Oct. 14, 2003, and reunited it with what remains of the Bartman ball in a display case near the restaurant entrance. The ball, as you'll recall, was detonated in 2004 in an attempt to rid the Cubs of yet another curse.\n2 p.m.: A replica \"Back To The Future\" DeLorean is parked outside Harry Caray's on Kinzie, where owner Tom Sedor from Orland Park is getting the car ready for its close-up. Sedor is a Cubs season ticket holder who's had the car for 23 years and retrofitted it to be a replica of the time machine from the movie.\n5:40 p.m.: It's still more than 90 minutes before the first pitch, and fans decked out in Cubbie Blue are already making their way to Wrigleyville bars. A few have on blue wigs with faces painted white and red. A Chihuahua named Erwin and his owner saunter down Sheffield. The dog is dressed head to tail in Cubs gear. \"He has Blackhawks gear for the hockey season,\" we're told.\n7:15 p.m.: Kevin Henry, 24, of Villa Park, is at Coach's Corner in Elk Grove Village and predicts the Cubs will beat the Pirates 2-0. He is watching the game with friends Matt Snobl of Villa Park and Dan Diaz of Addison. \"The Cubs are winning the World Series this year,\" Henry said. \"It's going to happen.\"\n7:20 p.m.: Elk Grove Village resident Valerie Nuti texts the Cubs' one-run lead to her daughter, in Aruba.\n7:30 p.m. Plans at the Grand Victoria Casino in Elgin to burn a pirate ship in effigy just got the kibosh from the Elgin Fire Department, which said burning a fiberglass board would release too many harmful toxins into the air. So they settled for burning a cardboard boat instead. Take that, Pirates!\n7:40 p.m. With the start of the second inning, some Cubs fans at Murphy's Bleachers finally take their seats -- most everybody stood for the entire first inning.\n7:45 p.m. Coach's Corner is a sea of blue and red. Arrieta strikes out his third batter.\n\"He gone!\"\n\"That's how we do it.\"\n\"Arrieta is just perfect.\"\n7:51 p.m. GONE! Coach's Corner erupts for Kyle Schwarber's home run. In Wrigleyville, the police presence is becoming more noticeable, but so far, it's just all about the game.\n8:20 p.m. It's the bottom of the 4th, and fans at Murphy's are settling into a feeling of ... certainty. \"I've been following the Theo experiment for a couple years, and I could feel it when Rizzo said this was the year,\" Jay Mitchell says. \"I think a lot of people like that this team is built for the long term.\"\nKiley Pawlak says, \"The energy is different this year. Everyone believes. Just the energy here, you can taste it.\"\n8:45 p.m. Joe Carcerano might be the owner of Coach's Corner, but his mother, Connie Carcerano, rarely misses a day of work. \"Everyone's so respectful. It's like a little family here,\" she said. \"They keep me young.\" The place is always packed for the Blackhawks, but the Cubs also have been drawing a crowd.\n\"The excitement, the anticipation -- that's the best part about game days,\" she said. \"The big crowds and everyone cheering. It makes this place fun.\"\n9:05 p.m. Fans pounding the tables at Coach's Corner, shouting \"Fight!\" \"Fight!\"\n\"This isn't hockey!\" somebody yells from across the room.\n9:15 p.m. Elk Grove Village resident Jerry Davis said the Cubs are doing so well largely because of Joe Maddon and Jake Arrieta. \"The team is so young and carefree. Maddon is a great manager,\" he said. \"Then you get a guy like Arrieta. That changes a team.\"\n9:40 p.m. Eric Wenner has developed his own system for helping the Cubs win. \"As an older Cubs fan we have the tendency to clutch up and get nervous, and they say the team can feel that,\" he says between innings at Murphy's Bleachers. So he hangs out with a younger crowd. \"Younger people are much more calm about it.\"\n10 p.m. Police have shut down Clark Street. In Pittsburgh, fans leaving the ballpark are streaming across the Roberto Clemente Bridge.\n10:05 p.m. Fans streaming toward Addison and Clark, chanting \"Arrieta\" and singing, \"Go, Cubs, Go.\"\n10:30 p.m. \"We can win anywhere, anytime,\" says Rob Mandik of Elk Grove Village. \"We're peaking at the right time.\"\n\"We got this. This is our year,\" says Keith Mays of Hoffman Estates.\n News Elk Grove Village MLB Cubs Baseball Pro Sports Pro Men", "external_links": ["https://twitter.com/share", "http://www.youtube.com/watch?v=AnYbvx8xxEU"], "published": "2015-10-08T20:45:00.000+03:00", "crawled": "2015-10-09T05:05:18.162+03:00", "highlightTitle": ""}