{"organizations": [], "uuid": "afb6e215a34f6a529bed6f9a37344b1cd10aafaf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mid-day.com", "main_image": "http://images.mid-day.com/images/2015/feb/Jeev-Milkha-Singh-l.jpg", "site_section": "http://www.mid-day.com/Resources/midday/rss/sports-other-sports.xml#", "section_title": "other sports", "url": "http://www.mid-day.com/articles/jeev-milkha-singh-third-chawrasia-6th-lahiri-12th-at-hong-kong/16628181", "country": "IN", "title": "Jeev Milkha Singh third, Chawrasia 6th, Lahiri 12th at Hong Kong", "performance_score": 0, "site": "mid-day.com", "participants_count": 1, "title_full": "Jeev Milkha Singh third, Chawrasia 6th, Lahiri 12th at Hong Kong - Sports", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "afb6e215a34f6a529bed6f9a37344b1cd10aafaf"}, "author": "PTI", "url": "http://www.mid-day.com/articles/jeev-milkha-singh-third-chawrasia-6th-lahiri-12th-at-hong-kong/16628181", "ord_in_thread": 0, "title": "Jeev Milkha Singh third, Chawrasia 6th, Lahiri 12th at Hong Kong", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Hong Kong: Eyeing a European Tour card for 2016, ace Indian golfers Jeev Milkha Singh and SSP Chawrasia made a solid start to their Hong Kong Open campaign at the joint-sanctioned event, here yesterday.\n\n\nJeev Milkha Singh. Pic/AFP \nJeev, named as the Captain for the Asian Team for next year's EurAsia Cup, carded a five-under 65 and was lying tied for third, while Chawrasia, who needs a Top-20 finish, carded five birdies in a row enroute to a four-under 66 at the Hong Kong Club. Jeev needs a top-3 finish for the Tour card.\nAlso at tied sixth with a 66 was Rahil Gangjee, while Anirban Lahiri, who is in the race for the Rookie of the Year award on European Tour, was tied 12th at three-under after dropping a bogey on 18th. Among other Indians, Gaganjeet Bhullar (69) was tied 37th, while Rashid Khan, Jyoti Randhawa and Shiv Kapur carded 70 each to be tied 54th. Arjun Atwal was way behind with a round of 73.\nJeev, alongwith CT Pan of Taipei and Justin Rose of England, was one shot behind the leaders, Andrea Pavan and Lu Wei-chih, who carded 64 each. Six players including Chawrasia and Gangjee were sixth at 66. Jeev, going through a lean spell in Asia and Europe, was delighted with his form.\n\"I think I needed a start like this and I'm going to give it my 100% like what I do every week and hopefully this is my week. I'm glad I'm putting myself in the right position and hopefully I can keep going like that from here, and move on to better things.\n\"In this game, I think when the trust and the confidence comes back, you'll start putting the numbers on the board. I'm in that process right now and I'm feeling good,\" said the six-time Asian Tour winner. \"I've got a new driver now in the bag, and I'm hitting the ball much better. I think it's much easier when you get the ball in play off the tee, and then move on from there.\nSo it's happening more often and I think that's why the numbers are coming up,\" added Jeev. Chawrasia said, \"I have been playing well but things need to come together so hopefully it is going to be this week.\" Jeev is currently 140th, while Chawrasia is 111th and Kapur, who is 126th, also needs a strong finish. Lahiri, who is assured of the Finals series but is looking for a strong finish to keep himself in the race for the Sir Henry Cotton Rookie of the Year award.\nHis main rival Matthew Fitzpatrick is also at three-under 67. \"Anytime you finish with a bogey, it leaves you disappointed, especially after having worked hard to keep bogeys off your card for first 17 holes,\" said Lahiri, who played with Ian Poulter, who dashed in from New York to register 13 appearances to keep his European Tour membership.\nChinese Taipei's Lu Wei-chih broke down all physical and mental barriers by carding a first round six-under-par 64 to share the opening honours with Italy's Andrea Pavan. Lu, who underwent a brain tumour surgery three years ago, is slowly getting back to his competitive best at the US$2 million event, which is sanctioned by the Asian Tour and European Tour.\n\"For the first six months after my surgery, I pretty much gave up all my confidence and trust because I felt so weak and I didn't think I could play golf anymore. I could hardly walk through all 18 holes. \"But about a year later, I started talking to the Asian Tour and they gave me the opportunity to get back on the Tour and play some events. And finally, I started coming back mentally and physically,\" said Lu. Pavan also had a round to remember especially in his homeward run where he carded four birdies in his last six holes.", "external_links": [], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-23T08:50:05.773+03:00", "highlightTitle": ""}