{"organizations": [], "uuid": "e9977710ba4ee5a25e4d1f7673b92ba5fbc55e76", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/nation/shashi-deshpande-resigns-from-sahitya-akademi-panel-in-protest/143785.html", "country": "US", "title": "Shashi Deshpande resigns from Sahitya Akademi panel in protest", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "Shashi Deshpande resigns from Sahitya Akademi panel in protest", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "e9977710ba4ee5a25e4d1f7673b92ba5fbc55e76"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/nation/shashi-deshpande-resigns-from-sahitya-akademi-panel-in-protest/143785.html", "ord_in_thread": 0, "title": "Shashi Deshpande resigns from Sahitya Akademi panel in protest", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bengaluru, October 9\nAward-winning author Shashi Deshpande today resigned from the Sahitya Akademi General Council expressing “a sense of strong disappointment” over the literary body's silence on the killing of Kannada writer MM Kalburgi. In her letter to Akademi chairperson Vishwanath Prasad Tiwari, the 77-year-old author said, “I do this with regret, and with the hope that the Akademi will go beyond organising programmes, and giving prizes, to being involved with crucial issues that affect Indian writers' freedom to speak and write.\" Deshpande, author of several novels, short stories and essay collections and books for children, won the Sahitya Akademi award for her novel “That Long Silence” in 1990. She was awarded the Padma Shri in 2009. Her action comes in the wake of a parade of litterateurs renouncing their coveted prizes. Earlier this week, celebrated writer Nayantara Sahgal and Hindi poet Ashok Vajpeyi had returned their Sahitya Akademi awards in protest against the \"assault on right to freedom of both life and expression\". Hindi writer Uday Prakash was the first to return his Sahitya Akademi award to protest the murder of Kalburgi. “Kalburgi lived in Dharwad. I was born there and grew up in the area, it is a very quiet and civilised place. I did not know enough of him but was deeply disturbed by the silence of the Akademi on his killing,\" Deshpande told PTI. She called Kalburi, a fellow Sahitya Akademi member and also a member of its General Council till recently, \"a good and honest human being\". \"If the Akademi, the premier literary organisation in the country, cannot stand up against such an act of violence against a writer, if the Akademi remains silent about this attack on one of its own, what hope do we have of fighting the growing intolerance in our country? A few tame condolence meetings here and there for a member of our community cannot serve the purpose,\" Deshpande said in her letter. Akademi chairperson Tiwari had earlier said that authors should \"adopt a different way to protest\" and not politicise the autonomous body and make it deviate from its primary task of engaging in translation of books into different languages, giving awards, holding seminars and workshops to further literary causes. Alleging that silence was a form of abetment, Deshpande said the Sahitya Akademi “should speak for the large community of Indian writers, must stand up and protest the murder of Professor Kalburgi and all such acts of violent intolerance”. — PTI", "external_links": [], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-09T15:42:03.857+03:00", "highlightTitle": ""}