{"organizations": ["Southern Illinois River-to-River Conference Mississippi Division", "Anna-Jonesboro Community High School", "Lady Wildcats", "Johnston City", "Sparta"], "uuid": "d76931945cc4260a6d385f6060106e28a289169c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.annanews.com", "main_image": "", "site_section": "http://www.annanews.com//search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&nsa=eedition&c[]=sports,sports/*&f=rss", "section_title": "The Gazette-Democrat  - sports,sports/", "url": "http://www.annanews.com/sports/article_0da42896-7984-11e5-8d5b-0fb94cd3a5a3.html", "country": "US", "title": "A-J volleyball squad defeats Sparta to win division championship", "performance_score": 0, "site": "annanews.com", "participants_count": 0, "title_full": "A-J volleyball squad defeats Sparta to win division championship", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T15:46:00.000+03:00", "replies_count": 0, "uuid": "d76931945cc4260a6d385f6060106e28a289169c"}, "author": "", "url": "http://www.annanews.com/sports/article_0da42896-7984-11e5-8d5b-0fb94cd3a5a3.html", "ord_in_thread": 0, "title": "A-J volleyball squad defeats Sparta to win division championship", "locations": ["Carmi-White County", "Carbondale", "Pinckneyville", "Carterville", "Massac County", "Vienna", "Vienna-Johnston City"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jasmine Foster", "Boget", "Bigler", "Madison Calhoun", "Jamie Hammond", "Brooke Miller", "Hannah Reach", "Mackenzie Boget", "Basler", "Calhoun", "Du Quoin", "Elle Basler", "Madeline Mayo", "Madi Bigler", "Miller", "Hammond", "Waterloo Gibault"], "text": "The Anna-Jonesboro Community High School volleyball team won the Southern Illinois River-to-River Conference Mississippi Division championship with a victory over host Sparta Thursday, Oct. 15. The Lady Wildcats improved to 17-11 overall and captured the conference crown with a 9-1 league mark. A-J 25-25, Sparta 15-19: Elle Basler led the way for the Lady Wildcats with 12 digs, 3 kills, 2 aces, 2 blocks and a block assist. Hannah Reach had 7 kills, 4 digs, 2 aces, 2 block assists and a block. Madeline Mayo had 6 digs. Mackenzie Boget had 4 digs, 4 blocks, 3 block assists, an ace and a kill. Madi Bigler had 4 digs, 2 aces, 2 block assists and a block. Jamie Hammond had 4 kills, 4 blocks, 4 block assists and a dig. Madison Calhoun had 2 digs, a kill and a block assist. Jasmine Foster had an ace. A-J 25-25, Du Quoin 22-16: Basler led with 12 digs, a kill, an ace, a block assist and a block at Du Quoin Tuesday, Oct. 13. Hammond had 8 kills, 4 block assists and 3 blocks. Boget had 3 blocks, 3 block assists and a dig. Calhoun had 2 kills, a block and a block assist.Reach had 3 kills, a block and a block assist. Foster had 3 digs. A-J 22-25-26, Pinckneyville 25-12-24: Basler had 10 kills, 11 digs, 4 block assists and 2 blocks in the win at home Thursday, Oct. 8. Mayo had 9 digs. Hammond had 15 kills, 8 blocks and 10 block assists. Bigler had 4 kills, 4 digs, 2 blocks and a block assist.Reach had 4 kills, 3 block assists and 2 blocks. Brooke Miller had 3 block assists, 2 kills, 2 aces and 2 digs. Calhoun had 3 digs and a kill. A-J 26-25, Carterville 24-16: Hammond had 5 kills, 4 blocks and 3 block assists for visiting A-J Tuesday, Oct. 6. Basler had 6 digs, 4 kills and an ace. Bigler had 6 digs and a kill. Boget had 3 digs, 2 block assists and a kill. Miller had 3 blocks, 3 block assists and an ace. Reach had a kill. Carbondale 25-25, A-J 20-22: Basler had 10 digs, 2 kills and a block assist in the loss at Carbondale Monday, Oct. 5. Bigler had 9 digs and 2 kills. Mayo had 10 digs. Hammond had 5 kills, 2 digs, 2 block assists and a block. Miller had 4 digs, a kill and a block assist. Boget had 4 digs, 2 kills, a block and a block assist. Reach had 2 kills and a block assist. The Lady Wildcats were scheduled to close out their regular season earlier this week at Massac County. A-J is the No. 3 seed at the Johnston City Class 2A regional next week. Waterloo Gibault is the No. 1 seeded team and Carmi-White County is No. 3. Vienna opens play against host Johnston City at 7 p.m. Monday, Oct. 26. The Lady Wildcats are scheduled to play the Vienna-Johnston City winner at 7 p.m. Tuesday, Oct. 27.", "external_links": [], "published": "2015-10-23T15:46:00.000+03:00", "crawled": "2015-10-25T05:21:47.311+02:00", "highlightTitle": ""}