{"organizations": [], "uuid": "207067c9888f78b876e75d01fc5e4d0697905e49", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48531/sports", "section_title": "Sports - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30248021/bikes-reinforced-by-textreme-vital-in-kona-ironman-triumphs", "country": "US", "title": "Bikes Reinforced by TeXtreme® Vital in Kona Ironman Triumphs", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Bikes Reinforced by TeXtreme® Vital in Kona Ironman Triumphs - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "207067c9888f78b876e75d01fc5e4d0697905e49"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30248021/bikes-reinforced-by-textreme-vital-in-kona-ironman-triumphs", "ord_in_thread": 0, "title": "Bikes Reinforced by TeXtreme® Vital in Kona Ironman Triumphs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Information contained on this page is provided by an independent third-party content provider. WorldNow and this Station make no warranties or representations in connection therewith. If you have any questions or comments about this page please contact pressreleases@worldnow.com .\nSOURCE TeXtreme(R)\nBORAS, Sweden , October 13, 2015 /PRNewswire/ --\nDaniela Ryf won the Kona Ironman World Championship this weekend on Hawaii , USA. Daniela was riding a custom made IA FRD reinforced by TeXtreme ® from Felt Bicycles and laid the ground for the victory through an extremely strong bike ride.\n(Photo: http://photos.prnewswire.com/prnh/20151013/276313 )\nOn the men's side, Andreas Raelert, riding the new C:68 TT bike reinforced by TeXtreme ® from Cube Bikes, finished on a strong second place.\nBikes with composite parts reinforced by TeXtreme ® carbon fiber materials have over the recent years been successfully used to win stages and races in competitions such as: Tour de France, Kona Ironman, Giro d'Italia, La Vuelta and several World Championships.\nThe TeXtreme ® Technology is based on spreading tows (yarns) into very thin tapes which enables reinforcements in woven structure as well as unidirectional tapes with mechanical performance and possibility for weight savings that are unique compared to conventional reinforcements.\n\"The unique material characteristics together with our knowledge in FEA analysis, lay-up optimization as well as the manufacturing- and marketing support, position TeXtreme ® as the No.1 collaboration partner for achieving ultra light products. The continuous success in the races further strengthens this position,\" says Andreas Martsman, VP - Marketing & Sales of Oxeon AB.\nJeff Soucek , Director of R&D of Felt Bicycles, on their usage of TeXtreme ® : \"We were looking for reduced weight on our frames, but still needed the same high properties of stiffness and strength. By using TeXtreme ® we succeeded in making frames that were lighter, as stiff, while actually increasing the impact durability. Because TeXtreme ® is so thin we could work with several plies to get the same thickness or less, resulting in significant improvements and a better riding experience.\"\nTeXtreme ® carbon fiber fabrics have been used in frames, wheels, saddles, shoes for some time and can be found in various brands and models for road, TT/TRI, cyclo-cross, track and MTB.\nAlongside the use of TeXtreme ® in bicycles, other users can be found in Formula 1, Americas Cup, NASCAR, Le Mans, Indy Car , ice hockey, golf, tennis, surf boards, table tennis, rowing shells, canoes, skis, snowboards, and various industrial and advanced aerospace applications.\nAbout TeXtreme ®\nTeXtreme ® Spread Tow reinforcements is the ultimate choice for making ultra-light composites. TeXtreme ® Technology is flexible and tow-size independent which enables development of optimized reinforcement solutions tailor-made for specific application needs. Utilization of TeXtreme ® Spread Tow carbon fabrics and carbon UD tapes by manufacturers of advanced aerospace, industrial and sports products confirms that 20-30% lighter composite parts can be produced with improved mechanical properties and superior surface smoothness.\nTeXtreme ® is a registered trademark owned by Oxeon AB. Founded in 2003, Oxeon has quickly established itself as the market leader in Spread Tow reinforcements with its products marketed under the brand name TeXtreme ® . For more information please visit http://www.textreme.com .\nhttp://www.textreme.com/b2b/news-room/bikes-reinforced-by-textreme-vital-in-kona-ironman-triumphs\n©2015 PR Newswire. All Rights Reserved.", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=enUK201510132600&Transmission_Id=201510130900PR_NEWS_USPR_____enUK201510132600&DateId=20151013", "http://photos.prnewswire.com/prnh/20151013/276313", "http://www.xmlnews.org/ns/", "http://www.textreme.com/b2b/news-room/bikes-reinforced-by-textreme-vital-in-kona-ironman-triumphs"], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-14T03:33:10.561+03:00", "highlightTitle": ""}