{"organizations": ["Southern California", "Arizona State", "NCAA"], "uuid": "1ca3e1f925ce3357db1b15595bca611ce85334cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deseretnews.com", "main_image": "http://img.deseretnews.com/images/article/hires/1610514/1610514.jpg", "site_section": "http://www.deseretnews.com/sports/index.rss", "section_title": "Sports news and headlines for the Utah Jazz, BYU Cougars, Utah Utes and high schools, Salt Lake City sports, Utah sports  - Deseret News", "url": "http://www.deseretnews.com/article/765680919/Chris-Dufresne-Best-USC-replacement-Break-from-Pete-Carroll-era.html?pg=all", "country": "US", "title": "Chris Dufresne: Best USC replacement? Break from Pete Carroll era", "performance_score": 0, "site": "deseretnews.com", "participants_count": 0, "title_full": "Chris Dufresne: Best USC replacement? Break from Pete Carroll era", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T07:22:00.000+03:00", "replies_count": 0, "uuid": "1ca3e1f925ce3357db1b15595bca611ce85334cb"}, "author": "", "url": "http://www.deseretnews.com/article/765680919/Chris-Dufresne-Best-USC-replacement-Break-from-Pete-Carroll-era.html?pg=all", "ord_in_thread": 0, "title": "Chris Dufresne: Best USC replacement? Break from Pete Carroll era", "locations": ["Ariz.", "Southern California", "Tempe"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Steve Sarkisian", "Chris Dufresne", "Pat Haden", "Pete Carroll", "D. Franklin", "Ross D. Franklin"], "text": "Published: Monday, Oct. 12 2015 12:00 a.m. MDT Updated: 12 hours ago Southern California coach Steve Sarkisian, front, hugs Southern California athletic director Pat Haden prior to the team's NCAA college football game against Arizona State on Saturday, Sept. 26, 2015, in Tempe, Ariz. (AP Photo/Ross D. Franklin) Ross D. Franklin, AP Enlarge photo» Summary \nPat Haden hasn’t had much luck hiring coaches at USC. Ask any Trojans football or basketball fan about that. \nLOS ANGELES — Pat Haden hasn’t had much luck hiring coaches at USC. Ask any Trojans football or basketball fan about that. \nHowever, he has become an expert at firing. Too bad Donald Trump no longer has a reality show. \nSome people still erroneously think Haden is to blame for hiring Lane Kiffin and then setting him loose with his plastic play sheet. Kiffin was the last hiring act of former athletic director Mike Garrett. \nHaden wasn’t afraid to finish Kiffin off, though, jettisoning him not far from where the jets land at LAX after a lopsided loss. \nIf that seems like only yesterday, well, it almost was. It was 2013. \nMonday, under entirely different circumstances, Haden terminated Kiffin’s successor, Steve Sarkisian, another Pete Carroll protege. \nIt was not Haden’s fault that Sarkisian turned out to have a very serious personal issue. Yes, Haden could have more vigorously vetted the coach’s behavior while Sarkisian was the coach at Washington, but nothing in any court document precluded the hire. \nJim Harbaugh and Gary Pinkel survived very public drunken-driving charges to become very successful major college coaches. \nDrinking doesn’t have to interfere with good coaching. Bear Bryant was a drinker and won six national titles at Alabama. \nUSC’s greatest coach, John McKay, held daily court at Julie’s, an establishment near the campus. He was joined between 5 p.m. and 8 p.m. on most weeknights by members of the coaching staff and local sportswriters. \n“McKay was a moderate drinker,” said John Hall, a former Los Angeles Times columnist who attended many pub sessions with McKay. \nSarkisian’s problem was different because it could not be controlled or contained. And that necessitated Monday’s move. \nSo, two years after the Kiffin fiasco, USC finds itself looking for a new coach before Halloween. \nMany of the questions then are the questions now: Where does USC turn? \nStarting a search this early is problematic, as many potential candidates are locked in with teams, some with multiple-year contracts. \nThe same old names continue to be the same old names: Mack Brown, Mike Bellotti, Jon Gruden — you know the drill. \nOne thing seems clear: USC needs to break, once and forever, from the Carroll era. \nA major problem with the Sarkisian hire was that he was seen as a knockoff of Kiffin. The two served as co-offensive coordinators during the Carroll heydays. \nUSC needs a clean start. \nChip Kelly raises Twitter noise and might sound like a good idea if the Philadelphia Eagles collapse in the coming weeks. But Kelly is also said to love the NFL, and one reason he left Oregon was he didn’t like dealing with boosters. \nSome people good at reading the Pac-12 Conference standings from top to bottom have suggested Utah’s Kyle Whittingham. \nEveryone loves a winner, right? It’s also no secret Whittingham has had issues with Utah Athletic Director Chris Hill. \nLet’s set this bar: If Utah goes undefeated and wins the national title, USC should definitely give him a call. \nTopping my list this very second would be Texas A&M coach Kevin Sumlin, a guy many Trojans fans wanted instead of Sarkisian. \nSumlin is a tremendous recruiter and has Texas A&M off to another 5-0 start. The problem is, Texas A&M started 5-0 last year and finished 8-5. \nSumlin could become more attractive should Texas A&M defeat Alabama this weekend in College Station. \nAlabama won last year’s game, in Tuscaloosa, 59-0. \nIf USC wants to go an NFL retread, as it did with Carroll, it should look at Greg Schiano. He’s tanned and rested after his firing from the NFL’s Tampa Bay Buccaneers. \nTo those who want to knock Schiano, consider this: The guy won at Rutgers. \nAnother NFL possibility could by New England offensive coordinator Josh McDaniels. He could follow in the career path of Bill O’Brien, a former New England Patriots assistant who did a terrific job at scandal-infested Penn State before returning to the NFL to coach in Houston. \nYou want a real wild card? \nPick up the phone and call UCLA coach Jim Mora. \nHe’s 3-0 against USC. You know what they say: If you can’t beat them, hire him. \nMora is a longshot but might be more interested than you think. UCLA is a great school, but it’s also a public institution where everything is a fiscal fight. \nMora has had to leverage job offers to get pay raises for his assistants and to get the school moving on long-needed facilities improvements. \nUSC, a private school, can write big checks for those sorts of things. Mora is also a proven winner in town. \nHe’ll probably say no, but what does USC have to lose other than more credibility, and more games? \n——— \nVisit the Los Angeles Times at www.latimes.com \nDistributed by Tribune Content Agency, LLC.", "external_links": [], "published": "2015-10-13T07:22:00.000+03:00", "crawled": "2015-10-13T20:00:57.510+03:00", "highlightTitle": ""}