{"organizations": [], "uuid": "3d4e51743087baaf8b08b17eb78125c40521fc31", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxsports.com", "main_image": "http://www.foxsports.com/content/fsdigital/fscom.img.png", "site_section": "http://api.foxsports.com/v1/rss?partnerKey=zBaFxRyGKCfxBagJG9b8pqLyndmvo7UU&tag=golf", "section_title": "FOX Sports Digital", "url": "http://www.foxsports.com/golf/story/presidents-cup-capsules-101015", "country": "", "title": "Presidents Cup Capsules", "performance_score": 0, "site": "foxsports.com", "participants_count": 0, "title_full": "Presidents Cup Capsules", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T09:05:00.000+03:00", "replies_count": 0, "uuid": "3d4e51743087baaf8b08b17eb78125c40521fc31"}, "author": "", "url": "http://www.foxsports.com/golf/story/presidents-cup-capsules-101015", "ord_in_thread": 0, "title": "Presidents Cup Capsules", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Updated Oct 10, 2015 at 2:05a ET \nINCHEON, South Korea (AP) Capsules of Saturday's matches at the Presidents Cup: \nFOURSOMES \nLouis Oosthuizen and Branden Grace , International, def. Patrick Reed and Rickie Fowler , United States, 3 and 2. \nThe South African duo not only won their third straight match, they still haven't had to play the 17th and 18th holes in competition. They were 2 up through three holes, but the Americans hung in there and the match was all square through 10 holes. The International team seized control when Oosthuizen spun a wedge back to 3 feet on No. 14 for birdie and Fowler missed a 10-foot putt. International won the par-5 15th, and closed out the match when Oosthuizen made a 6-foot par on the 16th. It was the only match of the morning in which the Americans never led at any point. \nBubba Watson and J.B. Holmes , United States, halved with Adam Scott and Marc Leishman , International. \nThe Americans had a 2-up lead with six holes to play until Scott stuffed his tee shot on the 13th for a tap-in birdie and the Americans three-putted the 16th, with Watson missing an 8-foot putt. Even so, the Americans appeared to have this won on the par-5 18th when Watson hit the green in two and Leishman's third shot was 30 feet short. Scott's birdie attempt went 8 feet by, and Leishman had to make that for a par. The American's three-putted again when Watson missed a 5-foot birdie putt for the win. \nBill Haas and Matt Kuchar , United States, halved with Bae Sang-moon and Hideki Matsuyama , International. \nNeither team led by more than 1 up, and it was all square for much of the back nine until the Americans seemingly took control on the par-3 17th with a solid tee shot from Haas. Matsuyama missed the green, leaving Bae a difficult pitch. Bae's shot hung up in the collar, and Matsuyama muffed the chip as the Americans went 1 up. Matsuyama hit the green in two on the 18th, about 25 feet right of the cup. Haas went over the green, and Kuchar's chip didn't make it to the putting surface. The International won the hole with a two-putt birdie for a halve. \nDustin Johnson and Jordan Spieth , United States, def. Jason Day and Charl Schwartzel , International, 1 up. \nSpieth struggled off the tee and making putts on the front nine, and the International team built a 3-up lead at the turn for what seemed to be a certain point. The turning point came at the 14th, when Schwartzel hit a wedge short and into the creek to drop his team's advantage to 1 up. The International led 1 up with two holes to play when Johnson hit a tee shot to 7 feet and Spieth made the birdie to square the match. And on the 18th from a bunker, Schwartzel barely got his shot off the ground and it stayed in the fairway trap. The International team made bogey. Still, Spieth came up well short with a wedge and Johnson ran his putt 7 feet by the hole. Spieth had to make the par putt for the win, and it was never a doubt.", "external_links": [], "published": "2015-10-10T09:05:00.000+03:00", "crawled": "2015-10-10T09:39:01.131+03:00", "highlightTitle": ""}