{"organizations": [], "uuid": "20148f3c686c42a49c9da241742aea2d1074f18c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.buffalonews.com", "main_image": "http://www.buffalonews.com/images/BNSocialShareLG.jpg", "site_section": "http://www.buffalonews.com/section/rssGen?profileID=1004&profileName=Sports", "section_title": "The Buffalo News - Sports", "url": "http://www.buffalonews.com/city-region/charlie-garfinkels-racket-sports-know-the-rules-with-no-strings-attached-20151018", "country": "US", "title": "Charlie Garfinkel’s Racket Sports: Know the rules with no strings attached", "performance_score": 0, "site": "buffalonews.com", "participants_count": 1, "title_full": "Charlie Garfinkel’s Racket Sports: Know the rules with no strings attached - Sports - The Buffalo News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T08:11:00.000+03:00", "replies_count": 0, "uuid": "20148f3c686c42a49c9da241742aea2d1074f18c"}, "author": "buffalonews", "url": "http://www.buffalonews.com/city-region/charlie-garfinkels-racket-sports-know-the-rules-with-no-strings-attached-20151018", "ord_in_thread": 0, "title": "Charlie Garfinkel’s Racket Sports: Know the rules with no strings attached", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Most tennis players are cognizant about the rules of tennis. Even though I have played tennis for many years, circumstances have arisen during a match that I wasn’t sure what the right solution should be. I have included some of those situations in the quiz that follows. The following will test your knowledge of the rules of the game.\nSituation Number 1: In a close doubles match a player on Team A hits a return that seemed like it was a double hit. The opposing player on Team B wanted the point outright because he saw what he thought was indeed a double hit. The Team A player stated that if a player did have a double hit he had to call it on his or her self, that an opposing player cannot do this. Which is correct?\nA.) An opposing player (singles) or doubles team can call a doubles hit on their opponents if they feel they saw this happen.\nB.) Only the player who committed this infraction can say if he had a double hit or not.\nC.) Change the rules to a triple hit to clear up any discrepancies.\nSituation Number 2: In a doubles match that I was involved in, I served an ace to the receiving player on the other team. He said, “Play the point over because my partner was tying his shoelace and wasn’t ready to play.” I replied, “I don’t have to look to see if your partner is ready because I am serving to you. Therefore, the ace stands.” Who is correct?\nA.) The rules state that I should check to see if both players are ready before I serve. Therefore, the serve should be played over.\nB.) The serve counts. Why? Even though the rules state that a server should not serve until the receiver is ready, they don’t say anything about the receiver’s partner. The receiving player should have checked to see if his partner was ready. The fact that the receiving player was in position and ready to return the serve means that the point stands.\nC.) The player’s partner should get a pair of tennis sneakers that you don’t have to tie the laces.\nSituation Number 3: In a singles match a player hits a serve that got stuck in the net. He went up to the net and pulled the ball out. As he was walking back to hit his second serve, a ball rolled across the court. Immediately, the player asked for a let because the errant ball distracted him and he wanted to hit his first serve over. The receiver refused. Who was correct?\nA.) The first serve should be played over.\nB.) No. The time that it takes to pick up an errant ball that comes on the court is not deemed sufficient to warrant taking the first serve over.\nC.) Due to the controversy flip a coin to see if the serving player gets to serve over again.\nSituation Number 4: In a close doubles match a player on Team A is very close to the net. A player on Team B returns a shot that hits the top of the net and goes onto Team A’s side of the court, glancing off Player A’s racket for a point. However, as the ball is struck, Player B’s racquet grazes the net. Player B still claims the point, stating that the return was not returnable. Was he correct?\nA.) Player B was correct.\nB.) The rules clearly state that a player loses the point if his racquet touches the net while he is hitting the ball over the net.\nC.) Use a shorter racquet so it won’t extend over the net as far.\nSituation Number 5: During a singles match in a local tournament one player starts his first serving game 3-4 feet behind the baseline. This is distracting to his opponent, who quickly loses the first game. He complains to the tournament director that it is unfair for his opponent to serve in this manner and it was throwing his timing off. He wanted the director to tell the server to stop serving in that manner. What was the correct protocol?\nA.) The server could keep serving in this manner as long as he didn’t run or walk forward before his serve. This would have been considered a foot fault.\nB.) The server had to move up to just behind the service line to serve properly.\nC.) The server should alternate on odd games serving near the service line and then from 3-4 feet behind the service line\nSituation 6: In a doubles match, one player puts away an overhead. However, his racket flies out of his hand as he hits the shot. The racquet bounces on the court and hits the top of the net. The opponents claim that since the racquet flew out of their opponent’s hand as he hit the overhead that they should be awarded the point. What is the correct ruling?\nA.) If contact with the net took place after the point was out of play the player who hit the shot and his teammate would be awarded the point.\nB.) The receiving team should definitely be awarded the point because of the distraction that it caused\nC.) Next time that this situation occurs the player should hit a drop shot as it might be easier to return. Answers\n1-B; 2-B; 3-B; 4-B; 5-A; 6-A.\nemail: thegreatgar@verizon.net", "external_links": [], "published": "2015-10-18T08:11:00.000+03:00", "crawled": "2015-10-20T17:07:07.377+03:00", "highlightTitle": ""}