{"organizations": [], "uuid": "5c16fb631346e93734fba66e496a9460d6c82434", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "http://www.bostonherald.com/sites/default/files/media/2015/08/19/081915redsoxjw24.jpg", "site_section": "http://bostonherald.com/sports/red_sox_mlb", "section_title": "Sports: Red Sox &amp; MLB | Boston Herald", "url": "http://bostonherald.com/sports/red_sox_mlb/boston_red_sox/2015/09/lauber_regime_change_turning_point_for_sox", "country": "US", "title": "Lauber: Regime change turning point for Sox", "performance_score": 0, "site": "bostonherald.com", "participants_count": 2, "title_full": "Lauber: Regime change turning point for Sox | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 1, "uuid": "ad2e6ad24f3a99636bcdc3bfd716eb7becb40177"}, "author": "Scott Lauber", "url": "http://bostonherald.com/sports/red_sox_mlb/boston_red_sox/2015/09/lauber_regime_change_turning_point_for_sox#post-0", "ord_in_thread": 0, "title": "Lauber: Regime change turning point for Sox", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK — It was the top of the eighth inning Aug. 18 at Fenway Park. Eduardo Rodriguez was on the mound, nearing the end of the longest outing of his rookie season, and the Red Sox were cruising toward a 9-1 thumping of the Cleveland Indians.\nAnd that’s when it happened.\n“(Second baseman Dustin) Pedroia came out (of the clubhouse) and said something,” pitcher Clay Buchholz recalled yesterday. “That’s how we all found out.”\nPedroia brought word that the Red Sox hired longtime executive Dave Dombrowski as president of baseball operations and Ben Cherington stepped down after four seasons as general manager. There would be a team meeting immediately after the game, but news of a front-office shakeup on the day lymphoma-stricken manager John Farrell began his first round of chemotherapy left players and staff members stunned as they were completing a game.\nThe next night, the Sox capped their new boss’ first full day on the job by beating the Indians again, 6-4. They won the next two games, too, against postseason-bound Kansas City. Entering last night’s rainy series finale at Yankee Stadium, they had the majors’ second-best record since Aug. 18, their 25-14 mark trailing only the AL East champion Blue Jays’ 26-12.\nCoincidence?\n“It’s a great story if I were to say yes. Unfortunately, I don’t think that’s the answer,” veteran reliever Craig Breslow said. “There may be other guys who feel differently. I just kind of feel like our objective was the same. It’s as big a story as (outsiders) care to make it, but I think guys had a lot to prove because the first four months of the season were so sour. What we had to prove was that we were better than the product we were putting out there.”\nIt’s undeniable, though, that the Red Sox haven’t simply played out the proverbial string, even if you haven’t noticed.\nIndividually, the Sox witnessed resurgent performances from underachieving starters Rick Porcello and Joe Kelly and faded prospect Jackie Bradley Jr. The brigade of young players, led by shortstop Xander Bogaerts, leadoff-hitting outfielder Mookie Betts, catcher Blake Swihart and underestimated first baseman Travis Shaw, matured faster than the most bullish backers of the farm system could’ve imagined.\nAnd the Sox played themselves out of the AL East cellar.\nIt’s hardly consolation for a team that expected to return to the postseason, but the Sox even have a chance to finish with a .500 record, which seemed inconceivable when they were a season-worst 14 games under on Aug. 17, the final day of the pre-Dombrowski era.\nAlmost to a man, the Sox insist the past seven weeks are neither a mirage nor simply attributable to a so-called “Dombrowski Effect.”\n“It’s given us a lot of hope for next year,” interim manager Torey Lovullo said. “It’s given us a lot of confidence internally. It’s given each player confidence individually to say, ‘We’re ready to turn the page and contend for a championship next year.’ ”\nLooking back, Lovullo wasn’t certain how the players would react to Dombrowski’s arrival, and there wasn’t much he could say to reassure them. After all, he was only five days into his role as Farrell’s stand-in when Dombrowski was hired, his future every bit as uncertain as any player.\nAfter the Sox closed out the Indians, they returned to the clubhouse where newly promoted team president Sam Kennedy and then assistant GM Mike Hazen were waiting to speak with them. Lovullo then said a few words.\n“I tried to figure out what I could say. I wasn’t even sure if I was given a chance to say anything,” Lovullo said. “I just reacted in a way where I said, ‘We’re here to win baseball games, we’re here to be evaluated, and things aren’t going to change. We’re going to stick to our principles, stick to our beliefs and we’re not coming off that. Let’s band together because we have nobody else but each other.’ That’s the message that I delivered.”\nIt resonated.\n“That was the first time I experienced anything like that,” Swihart said. “As a team, you’ve got to just kind of come together and be there for each other. That’s what I got out of what Torey said.”\nIt has helped, too, that the Red Sox have gone young. Cherington traded veteran right fielder Shane Victorino and first baseman Mike Napoli, creating playing time for Rusney Castillo and Shaw, respectively. Swihart, Bradley, Betts, Shaw, lefty Henry Owens and relievers Matt Barnes and Noe Ramirez came through the minor leagues in virtual lockstep and are reunited now in the big leagues. Not all will be in the plans for 2016, but they have certainly given Dombrowski something to think about.\n“I think most of us recognized the scope of what had occurred,” Breslow said of the regime change. “I’m sure there are guys that may have had concerns or questions about loyalties or what this shakeup could potentially mean for them down the road. But in the near term, as indicative by how we’ve been playing, the focus was on doing a job out there.”\nDombrowski Effect or not, since Aug. 18 the Sox have done it better. Figuring out how to carry it into next year is the hard part.", "external_links": [], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-02T13:56:26.280+03:00", "highlightTitle": ""}