{"organizations": [], "uuid": "01dad6029d35b984dda0171ab9c0ca08940e78c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestar.com", "main_image": "http://www.thestar.com/content/dam/thestar/sports/bluejays/2015/10/11/five-key-moments-of-blue-jays-alds-game-3-win/tulowitzki-homer.jpg", "site_section": "http://www.thestar.com/sports/leafs.html", "section_title": "Toronto Maple Leafs | Sports | Toronto Star", "url": "http://www.thestar.com/sports/bluejays/2015/10/11/five-key-moments-of-blue-jays-alds-game-3-win.html", "country": "CA", "title": "Five key moments of Blue Jays’ ALDS Game 3 win", "performance_score": 0, "site": "thestar.com", "participants_count": 1, "title_full": "Five key moments of Blue Jays’ ALDS Game 3 win | Toronto Star", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "01dad6029d35b984dda0171ab9c0ca08940e78c1"}, "author": "Brendan Kennedy", "url": "http://www.thestar.com/sports/bluejays/2015/10/11/five-key-moments-of-blue-jays-alds-game-3-win.html", "ord_in_thread": 0, "title": "Five key moments of Blue Jays’ ALDS Game 3 win", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ARLINGTON, TEXAS — The Blue Jays survived their first do-or-die game Sunday night thanks largely to the stellar work of Marco Estrada and a game-breaking home run by Troy Tulowitzki. Their reward? Another win-or-go-home contest Monday. Here’s a look at the five moments that mattered most in Game 3.\nNavarro opens scoring\nIn his series debut, Jays’ catcher Dioner Navarro — Marco Estrada’s exclusive battery mate — wasted no time making his presence felt, swinging at the first pitch of the third inning and driving a long fly ball over the head of Rangers’ centre-fielder Delino DeShields for a lead-off double. Navarro came around to score two batters later as Ryan Goins grounded into a double play. The early lead, while modest, at least put the Jays in the driver’s seat and the Rangers on their heels.\nEncarnacion gets a free pass\nAfter Josh Donaldson led off the fourth inning with a well-hit double beyond the reach of a diving DeShields and tagged up to third on Jose Bautista’s deep flyout, Rangers’ manager Jeff Banister opted to intentionally walk Edwin Encarnacion. The gambit failed, however, as starting pitcher Martin Perez then seemed to unintentionally lose the strike zone. He walked the next two batters on just nine pitches, including Tulowitzki with the bases loaded to hand the Jays their second run.\nEstrada dispels Odor\nMarco Estrada was dominant throughout his outing Sunday, holding the Rangers off the board through the first six innings while limiting them to just three baserunners. But he shone particularly bright in his two at-bats against Rangers’ second baseman Rougned Odor, who has been a pesky thorn in the Jays’ side this series. On Saturday, Jays’ manager John Gibbons spoke of the need to keep Odor, who scored five times in the first two games, off the bases. On Sunday, Estrada didn’t even allow Odor out of the batter’s box, twice striking him out: the first time swinging at a high fastball and the second on a knee-buckling curve.\nRally-killing DPs\nThe Jays put their lead-off runner aboard and moved him into scoring position in four straight innings Sunday, from the third to the sixth. But on all four occasions their rallies were halted by double plays — eclipsing the franchise’s previous post-season record — and they had but a pair of runs to show for their 10 baserunners. When it happened again after Toronto loaded the bases with none out in the sixth, Jays’ fans were ready to throw up their hands. And then . . .\nA breakthrough\nTroy Tulowitzki’s two-out, full-count, three-run home run in the sixth inning busted the game open for the Jays, affording some much-needed breathing room. Not only was it a breakthrough for the team, who had stranded — or watched the Rangers’ infield extinguish — six baserunners in the last handful of innings, but it was also a breakthrough for Tulowitzki, who snapped an 0-for-11 post-season hitless streak with the long drive into left field.\nMore on thestar.com\nToronto finds playoff hero in Tulowitzki: Griffin\nALDS Game 3: Blue Jays vs. Rangers", "external_links": ["http://static.freeskreen.com/publisher/52/freeskreen.min.js"], "published": "2015-10-11T03:00:00.000+03:00", "crawled": "2015-10-12T06:47:10.916+03:00", "highlightTitle": ""}