{"organizations": [], "uuid": "7c4d623f09ed47c6dedb85bf96deb333fb646954", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "sports.dailymirror.lk", "main_image": "", "site_section": "http://sports.dailymirror.lk/feed/rss/", "section_title": "Mirror Sports", "url": "http://sports.dailymirror.lk/2015/10/17/english-fa-blow-to-platini-fifa-presidential-bid/", "country": "US", "title": "English FA blow to Platini FIFA presidential bid", "performance_score": 0, "site": "dailymirror.lk", "participants_count": 1, "title_full": "English FA blow to Platini FIFA presidential bid", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T22:24:00.000+03:00", "replies_count": 0, "uuid": "7c4d623f09ed47c6dedb85bf96deb333fb646954"}, "author": "Shehan", "url": "http://sports.dailymirror.lk/2015/10/17/english-fa-blow-to-platini-fifa-presidential-bid/", "ord_in_thread": 0, "title": "English FA blow to Platini FIFA presidential bid", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "English FA blow to Platini FIFA presidential bid AFP Published : 12:54 am October 17,   130 reads | \nMichel Platini’s wounded bid for the FIFA presidency suffered a new blow Friday when the English FA suspended support for the French football legend because of new information on his legal battle. \nSuspended FIFA leader Sepp Blatter added to the turmoil surrounding football’s governing body when he said a two million dollar payment made to the UEFA president in 2011 was “a gentleman’s agreement.” \nPressure mounted on Platini, who was suspended by FIFA alongside Blatter, only a day after UEFA’s 54 members gave support. \nThe FA said it had been told of more information “relating to the issues at the centre of this case from Mr Platini’s lawyers” at the UEFA meeting on Thursday. \nBecause of the information the FA board has “concluded that it must suspend its support for Mr Platini’s candidature for the FIFA presidency until the legal process has been concluded and the position is clear,” said a statement. \nIt said the new information had to be “kept confidential”. \nThe French leader of UEFA and former football golden boy had been favourite to take over from Blatter in an election in February until he was named in a Swiss criminal investigation into Blatter’s management of FIFA. \nSwiss prosecutors are looking into a $2 million (1.8 million euro) payment that the 60-year-old Platini received from FIFA in 2011 for work carried out a decade earlier. \nPlatini has strongly denied any wrongdoing. But he and Blatter were suspended by FIFA’s ethics watchdog for 90 days because of the case. \n“It was a contract I had with Platini, a gentleman’s agreement,” the 79-year-old Blatter told Swiss broadcaster RROTV in an interview. \nHe would not give more details because of the investigations. \nBlatter and Platini are appealing their suspensions. But Platini’s presidential bid now faces major doubts, with talk mounting of alternative candidates coming forward. \nThe head of the Asian Football Confederation Shaikh Salman bin Ebrahim al Khalifa is on the verge of announcing a bid, a source told AFP. \nOthers could follow as the February 26 election goes ahead amid mounting turmoil. \nFIFA’s executive committee will meet on Tuesday and is likely to discuss whether the date can be maintained. \nUEFA’s 54 member nations on Thursday released a statement backing Platini’s “right to a due process and a fair trial and to the opportunity to clear his name.” \nThe European body called on FIFA’s investigators and appeal committees “to work very rapidly to ensure that there is a final decision on the merits of the case by, at the latest, mid-November 2015.” \nThe English FA and other leading federations in Europe have expressed increasingly cautious support for the Frenchman however in recent weeks. \nThe German, Dutch and Danish associations have all said Platini must clear his name. \nUEFA secretary general Gianni Infantino said after Thursday’s meeting that discussions would take place about the possibility of supporting another candidate. \n“It’s something that will be discussed by UEFA representatives with members of other confederations, as we’ve done in the past, and we’ll see if another candidate from another confederation or another European comes up.” \nBlatter won his fifth election in May, two days after US authorities charged 14 football officials and business executives over more than $150 million in bribes. \nAmid intense pressure over scandals engulfing the world body he announced four days later he would stand down. \nDespite suspending its support, the English FA said it “wishes Mr Platini every success in fighting these charges and clearing his name, and has no interest in taking any action that jeopardises this process.”", "external_links": [], "published": "2015-10-16T22:24:00.000+03:00", "crawled": "2015-10-17T02:19:47.436+03:00", "highlightTitle": ""}