{"organizations": [], "uuid": "68313b6f91c1c83f21417c4d9f8c71f134eaacc8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/47529300.cms", "site_section": "http://timesofindia.indiatimes.com/sports/football/champions-league/articlelist/40924344.cms", "section_title": "Top Stories - Champions League - Football - Sports - The Times of India", "url": "http://timesofindia.indiatimes.com/sports/football/champions-league/top-stories/Constant-domestic-battle-hurts-English-teams-in-Europe-Van-Gaal/articleshow/49134733.cms", "country": "IL", "title": "Constant domestic 'battle' hurts English teams in Europe: Van Gaal", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "Constant domestic 'battle' hurts English teams in Europe: Van Gaal - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "68313b6f91c1c83f21417c4d9f8c71f134eaacc8"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/sports/football/champions-league/top-stories/Constant-domestic-battle-hurts-English-teams-in-Europe-Van-Gaal/articleshow/49134733.cms", "ord_in_thread": 0, "title": "Constant domestic 'battle' hurts English teams in Europe: Van Gaal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The physical and competitive \"rat race\" that is the Premier League will hurt English clubs' chances of progressing in the Champions League, Manchester United manager Louis van Gaal has said.\nUnited welcome German side Wolfsburg in Europe's top competition on Wednesday having lost their opening encounter 2-1 to PSV Eindhoven, with Arsenal and Manchester City also losing their opening games to Dinamo Zagreb and Juventus, respectively.\nVan Gaal, who saw his team knock cross town rivals City off the top of the Premier League table at the weekend, said English clubs have the quality to progress in Europe, but face a serious disadvantage compared with clubs from other countries.\n\"The Premier League is a very difficult league. To beat your opponent every week is not easy, it is always a struggle and a battle,\" the Dutchman was Quote: d as saying by the club website (www.manutd.com).\n\"Then you have to play again mid-week in the Champions League and that is the difference between all the clubs in Europe.\n\"It is not predictable to say four teams in the Premier League shall overcome this group stage round, no, it is not like that.\n\"But I have to say that we have the teams to do it and we have the quality to do it.\"\nSquad rotation is the key to European success, but even ringing the changes will not guarantee that English sides are fresher than their European counterparts, the Dutchman added.\n\"The difficulty is that all these (Premier League) players are in a rat race and that takes a lot out of the players, which is why you have to rotate and that is what I am doing now because I have to protect my players,\" the manager said.\n\"I say we have to play Sunday-Tuesday, Sunday-Wednesday, so between the matches we cannot recover all of the tiredness.\n\"Then we have to play against a European squad who is willing to give everything against us.\n\"They don't have a rat race in their competition and that is the difference.\"", "external_links": [], "published": "2015-09-28T03:00:00.000+03:00", "crawled": "2015-10-10T17:13:48.444+03:00", "highlightTitle": ""}