{"organizations": [], "uuid": "e565be8c87ae688b3314d14590179b9f36105135", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "savannahnow.com", "main_image": "http://savannahnow.com/sites/default/files/14826434.jpg", "site_section": "http://savannahnow.com/", "section_title": "savannahnow.com | Savannah Georgia's source for News, Entertainment, Sports, Weather, Classifieds, Jobs, Autos, Real Estate and St. Patricks Day", "url": "http://savannahnow.com/do/2015-10-22/film-scene-dont-miss-these-film-fest-gems-plus-gory-tribute-peter-jackson", "country": "US", "title": "Film Scene: Don't miss these film fest gems, plus a gory tribute to Peter Jackson", "performance_score": 0, "site": "savannahnow.com", "participants_count": 1, "title_full": "Film Scene: Don't miss these film fest gems, plus a gory tribute to Peter Jackson | savannahnow.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T20:25:00.000+03:00", "replies_count": 0, "uuid": "e565be8c87ae688b3314d14590179b9f36105135"}, "author": "Jim Reed", "url": "http://savannahnow.com/do/2015-10-22/film-scene-dont-miss-these-film-fest-gems-plus-gory-tribute-peter-jackson", "ord_in_thread": 0, "title": "Film Scene: Don't miss these film fest gems, plus a gory tribute to Peter Jackson", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photos kinopoisk.ru\nBy Jim Reed Can you feel it?\nIt’s film fest season in Savannah.\nSure, I know, we have plenty of smallish, niche-oriented film fests and marathons scattered throughout the year, from locally produced events to stops by national or international touring outfits. But for close to two decades now, the end of October finds SCAD financing the Savannah Film Festival — the biggest cinema-related shindig for hundreds of miles in any direction.\nTruth be told, over the course of this increasingly well-known week-long showcase and competition of noteworthy short subjects, feature films and student work from around the world, the SFF has steadily made a name for itself as one of the more smoothly run and convivial events of its type. This year’s installment kicks off Oct. 24 and runs through Oct. 31, and in between, voracious film enthusiasts will find plenty of challenging cinema to bask in and a few handfuls of well-known and respected actors, filmmakers, journalists and critics to gawk at (if that’s your bag).\nThere’s plenty of advance coverage for your perusal in this issue of Do (and the next, for that matter), including my own interviews with director Catherine Hardwicke, producer Alison Owen and famed blogger and awards prediction machine Scott Feinberg. But with so many selections to choose from, I thought some folks might appreciate my own personal recommendations for a few of the featured titles in this year’s fest that have me the most excited.\nTickets for most if not all of the daytime screenings can still be had (as of the time I am writing these words) for as little as $5, so consider calling in sick from work. A lot of movie lovers do every year around this time, don’tcha know ...\nAnd don’t forget that while most if not all of the big-deal evening screenings are already sold out, it is actually rare for a few fistfuls of unclaimed tickets to not be made available every night to the folks who are willing to queue up in the “standby” line just to the right of the Trustees Theater’s Broughton Street box office. So, if there’s a nighttime film you simply must see, get there early and stake a spot near the front of the line. You just might wind up on the front row, for $10 and a few hours’ wait.\nThat said, hats off to the indefatigable (but largely unknown) team of programming director Sheila Lynne Bolda, artistic director Christina Routhier, director of operations Josh Lotz, box office manager Matt Terry and programming coordinator Hannah Weaver (plus the entire festival staff and volunteers) for crafting and overseeing another knockout.\nI humbly suggest anyone interested in memorable or provocative filmmaking to make a point to check out the following selections between now and my next Film Scene column:\nOn Oct. 24, you can catch two documentaries I’ve been dying to bring to town myself via the Psychotronic Film Society. First up is “Best of Enemies,” a look back at the explosive, network televised 1968 political debates between conservative intellectual William F. Buckley and liberal novelist Gore Vidal that forever changed the nature of how such things are discussed in the U.S. media. Co-directed and co-produced by Morgan Neville (“Keith Richards: Under the Influence”) and the great Memphibian popular music academic Robert Gordon (“Twenty Feet from Stardom”), it’s got “unforgettable” written all over it. Both Gordon and Neville will be on hand to discuss the film afterward. Showtime is 11 a.m. at the Lucas.\nYou can stick around to see “The Wolfpack” at 2 p.m. It’s the gripping, true-life tale of six brothers who spent their young lives locked in a Manhattan apartment. Home-schooled and kept apart from other children, they grew up knowing only their own family members, with their view of the outside world formed completely by their incessant viewing of movies. First-time director Crystal Moselle will be on hand as well for a Q&A following this controversial look at what some would call child abuse.\nThe next day finds “Meet The Patels” showing at 3:45 p.m. at the Lucas. Described as an uproarious, stranger-than-fiction romantic comedy, it’s the story of an Indian-American who’s pushing 30 and winds up caught between the woman of his dreams and the oppressive influence of his parents. The movie began as a family vacation video and ended up as a critically acclaimed, theatrically released motion picture. Directors Geeta and Ravi Patel will be on hand after the film.\nAt 7:30 p.m. that night, the period 1950s romantic drama “Brooklyn” screens at Trustees. Co-written by the great Nick Hornby (“About a Boy,” “High Fidelity”), it concerns a young Irish immigrant coming to grips with a new life in New York City. Awards correspondent Scott Feinberg of The Hollywood Reporter tells me “Brooklyn” is the best narrative feature he’s seen this year — no small praise. Star Saoirse Ronan (“The Grand Budapest Hotel”) discusses the film afterward.\nMonday morning at 10 a.m. may seem too early to watch a lesbian/Glee Club/mutant monster film called “Return To Nuke ‘Em High: Volume 2,” especially when it’s not even a finished version of the film, but rather an unfinished “rough cut.” However, die-hard fans of schlock-meisters Troma Studios should be falling all over themselves to give direct feedback to Troma chief (and legendary exploitation impresario) Lloyd Kaufman, who’s traveling here just for this event. PFS fans represent!\nAt 5:30 p.m. that afternoon at the Lucas, old-school Hollywood hunk Tab Hunter will grace us with his presence as he discusses “Tab Hunter Confidential,” the new doc chronicling his time as a closeted gay man who just happened to be a national heartthrob in the conservative, intolerant 1950s. This is a must-see.\nAnd how could I forget the new film from writer-director Charlie Kaufman (“Eternal Sunshine of the Spotless Mind,” “Adaptation.,” “Being John Malkovich”)? “Anomalisa” is a typically off-kilter drama based on one of Kaufman’s own plays, and stars Tom Noonan, David Thewlis and Jennifer Jason Leigh. Oh, did I mention it’s a stop-motion animated flick? Oh yes. That film screens at 9 p.m. Oct. 28 at the Lucas.\nNow, if you’re not interested in or able to attend “Anomalisa,” you can always head to The Sentient Bean for the PFS’ 54th Birthday Tribute to visionary New Zealand filmmaker extraordinaire Peter Jackson (“The Lord of The Rings Saga,” “The Frighteners”).\nIn honor of his life and career, they’ll screen his little-known, darkly comic and extremely gruesome 1987 cult gem “Bad Taste,” about man-eating space aliens who’ve taken over a small village for the expressed purpose of turning its inhabitants into hamburgers. Folks who appreciate the gory absurdity of “The Evil Dead” franchise and “Shaun of the Dead” or “The World’s End” will likely get a big kick out of this forgotten triumph of low-budget splatter. The fully uncut, widescreen international version, rarely seen in the U.S., will be shown. 8 p.m. showtime, with $7 admission for mature viewers.\nUntil the next issue, see you at the movies, and don’t forget to turn off that cell phone.\nJim Reed directs Psychotronic Film Society of Savannah. Email psychotronicfilms@hotmail.com.\nIF YOU GO\nWhat: ”Bad Taste” Birthday Tribute to Peter Jackson\nWhen: 8 p.m. Oct. 28\nWhere: The Sentient Bean, 13 E. Park Ave.\nCost: $7, mature viewers\nInfo: www.sentientbean.com", "external_links": ["http://sav-cdn.com/sites/default/files/imagecache/superphoto/14826434.jpg", "https://bit.ly/ZyZ8mc)", "https://bit.ly/ZyZaur", "https://itunes.apple.com/us/app/dosavannah/id626862925?ls=1&mt=8", "https://play.google.com/store/apps/details?id=hr.apps.n53744379", "http://sav-cdn.com/sites/all/themes/savannahnow/images/blank.gif", "http://i.imgur.com/2Ix6dHF.png", "https://bit.ly/Ke006c", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/14826434.jpg"], "published": "2015-10-22T20:25:00.000+03:00", "crawled": "2015-10-22T20:05:03.518+03:00", "highlightTitle": ""}