{"organizations": [], "uuid": "5eb597c218cb5afe38200f081ff297e3047c9861", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-56197bdf/turbine/ct-dbr-willowbrook-attack-tl-1015-20151010", "site_section": "http://www.chicagotribune.com/", "section_title": "Chicago Tribune: Chicago breaking news, sports, business, entertainment, weather and traffic - Chicago Tribune", "url": "http://www.chicagotribune.com/suburbs/burr-ridge/news/ct-dbr-willowbrook-attack-tl-1015-20151010-story.html", "country": "US", "title": "Willowbrook woman says she has God and youth to help her heal The Doings Weekly", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Willowbrook woman says she has God and youth to help her heal - The Doings Weekly", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T23:56:00.000+03:00", "replies_count": 0, "uuid": "5eb597c218cb5afe38200f081ff297e3047c9861"}, "author": "Kimberly Fornek", "url": "http://www.chicagotribune.com/suburbs/burr-ridge/news/ct-dbr-willowbrook-attack-tl-1015-20151010-story.html", "ord_in_thread": 0, "title": "Willowbrook woman says she has God and youth to help her heal The Doings Weekly", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "If Melissa Schuster thought about her 27th birthday several months ago, she would not have imagined that police officers, paramedics and doctors she had not yet met would be invited to the celebration.\nBut they were invited to the barbecue held Saturday in Borse Memorial Park in Willowbrook, because the gathering was not just a birthday party. It was a thank you to all the people who have helped Schuster survive and heal from the attack on her Aug. 29.\n\"It was my father's and my idea,\" said Mary Callison, Schuster's oldest sister. \"At first, it was a birthday party for her, then we decided to thank all the doctors and nurses and police and first responders.\"\nIn addition to relatives and friends, they wanted to include all the people who had sent cards or prayers for Schuster, \"so basically everybody,\" Callison said. \"We thought we would thank them by feeding them.\"\nMore than 50 people gathered around the pavilion, but an hour into the event it wasn't clear that any doctors or first responders were among the family, friends and supporters. Hamburgers and hot dogs sizzled on the grill, while Schuster greeted well-wishers with smiles and hugs.\n\"I have definitely healed a lot,\" said Schuster, who was beaten, stabbed and sexually assaulted in her Willowbrook home six weeks ago. \"I have God on my side and I have youth on my side. I take one day at a time, and if I can't do that, I take one step at a time.\"\nSchuster was loading her car in the driveway of her home about 12:45 p.m. Aug. 29 when a stranger drove up and asked for money, Willowbrook police officials have said.\nSchuster did not give him anything and went back in the house, locking the door, according to the DuPage County State's Attorney's Office. The man returned to a side door and asked to use her phone. When Schuster would not open the door, he forced his way inside and began punching her in the face to make her tell him where there was money in the house, prosecutors said.\nHe dragged her upstairs by her hair where he assaulted her, the prosecutors said. Still wanting money, he then stabbed her repeatedly in the stomach, back and neck, leaving her lying in a pool of her blood, police said.\nSchuster forced herself to get up and run to a neighbor's house for help. She told her family she had decided she was not going to die that day.\nHer will to live is what saved her, her family said.\nDetails that Schuster provided about the stranger's car and license plate number led the police to arrest Londale Madison, 31, in South Bend, Indiana.\nMadison, who has served time in prison for burglary and felony battery, was charged with attempted murder, aggravated criminal sexual assault, home invasion and armed robbery. His bail was set at $5 million.\nSchuster said Saturday that her doctors and nurses told her she had touched their lives.\n\"But they have touched my life, too,\" Schuster said. \"Between my neighbors and the paramedics and the first responders, they saved my life.\"\nShe remembers hearing their words of encouragement in her ear. As news of Schuster's attack spread, cards, letters and good wishes on social media poured in.\n\"I was receiving cards from people I didn't know,\" Schuster said. \"They were signed, 'a family in Darien,' or 'a family in Burr Ridge.'\"\n\"I want everyone to know how thankful I am for their support, love and prayers, \" Schuster said.\nThat support is helping her recover, she said.\nSchuster talked to the media when she was released from the hospital Sept. 4, a decision that was hard for her, she said, because she was self-conscious about the cuts and bruises on her face. She had broken bones in her face, an injury to her eye and had undergone surgery on her face.\n\"I didn't want to hide,\" Schuster said. \"I didn't want to walk back in my house and feel sorry for myself.\"\n\"People go through horrible, horrible things. I want to show it's OK to talk about it,\" Schuster said.\nShe said the progress she has made since that day has been huge, although, she has up and down days.\nHer mother said Schuster still has double vision and pain in her face.\nSchuster's first outing since her release from the hospital was to a Cubs game with her parents and younger sister. The Cubs lost to the Milwaukee Brewers, but Schuster was allowed to walk on the field and in the dugout.\n\"Oh my goodness,\" Schuster said. \"I am a huge, huge Cubs fan.\"\nSchuster said her ordeal has changed her and those around her, too.\n\"It has brought my family closer together. The way I hug my mom and my dad and my friends and family, it was always good before, but now I make sure I tell them I love them every time we're together.\"\nLeslie Viscioni of Naperville, who has been friends with the Schuster family a long time, said if Melissa's goal was to help or inspire other people, \"she has met her goal.\" Viscioni has Ehlers-Danlos syndrome, a genetic, degenerative disease.\nSeeing how Schuster has coped with her trauma has changed how Viscioni thinks about her own illness, she said.\n\"I needed to stop my whining and have a better way of looking at things. I am better mentally just watching her.\"\nkfornek@pioneerlocal.com\nTwitter: @kfdoings\n Theft Sexual Assault Crime Milwaukee Brewers", "external_links": ["http://www.trbimg.com/img-56197bdf/turbine/ct-dbr-willowbrook-attack-tl-1015-20151010"], "published": "2015-10-10T23:56:00.000+03:00", "crawled": "2015-10-11T02:18:56.003+03:00", "highlightTitle": ""}