{"organizations": [], "uuid": "03c74fe5b5a3728d383a3e89ed5ddb178a451502", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sltrib.com", "main_image": "http://www.sltrib.com/csp/mediapool/sites/dt.common.streams.StreamServer.cls?STREAMOID=1TSLwha$C4kBTCv721jD$c$daE2N3K4ZzOUsqbU5sYu79ReA8Pi8$x6q9aOckIvMWCsjLu883Ygn4B49Lvm9bPe2QeMKQdVeZmXF$9l$4uCZ8QDXhaHEp3rvzXRJFdy0KqPHLoMevcTLo3h8xh70Y6N_U_CryOsw6FTOdKL_jpQ-&CONTENTTYPE=image/jpeg", "site_section": "http://sltrib.com//csp/cms/sites/sltrib/RSS/rss.csp?cat=Sports", "section_title": "Sports - The Salt Lake Tribune", "url": "http://www.sltrib.com/sports/3062315-155/utah-jazz-a-different-feeling-surrounds", "country": "US", "title": "Utah Jazz: A different feeling surrounds Rudy Gobert's third year in the NBA", "performance_score": 0, "site": "sltrib.com", "participants_count": 6, "title_full": "Utah Jazz: A different feeling surrounds Rudy Gobert's third year in the NBA | The Salt Lake Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 11, "uuid": "03c74fe5b5a3728d383a3e89ed5ddb178a451502"}, "author": "TONY JONES", "url": "http://www.sltrib.com/sports/3062315-155/utah-jazz-a-different-feeling-surrounds", "ord_in_thread": 0, "title": "Utah Jazz: A different feeling surrounds Rudy Gobert's third year in the NBA", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Some guys have a lot to prove during the NBA preseason. Their minutes are meaningful. Their contributions can be the difference between a roster spot and the unemployment line. For those guys, October is everything.\nThen there are the guys who are known commodities. They are the players who have proven their worth over an extended period, so their coaches don't push them in games. They are the star players, the ones who the front office simply wants to keep healthy.\nRudy Gobert tantalized the Jazz from the moment they got the Nuggets' first-round draft pick (27th overall) in a 2013 trade. Yet, he was no sure thing. He came to the NBA from France as a gangly rookie, an unknown with potential trying to make it.\n  Now, Gobert has arrived as a NBA star. And the Jazz treat him as such.\n\"It just feels different right now, I'm in a different place,\" Gobert said. \"Last year and the year before, I was just trying to prove that I can play. Now I have to be responsible, and try to make everyone better and make sure everyone is on the same page defensively. I think that's pretty much my role now.\"\nLast year doesn't seem long ago: Gobert has a standout 2014 preseason, and continued that play into the regular season. By December, it became clear that he was a better fit for the Jazz at center than Enes Kanter. Kanter was traded to Oklahoma City, and Utah took off in March and April with Gobert in the starting lineup.\nGobert has played fewer minutes during this preseason than any other Jazz starter, after playing for the French national team in Eurobasket, a high-profile tournament that ended before the start of training camp.\nThe Jazz front office and coaching staff have been careful to straddle the line of allowing Gobert rest, but keeping him sharp. When he's been off the floor in the preseason, the defensive dropoff has been noticeable.\n\"Rudy's played a lot of basketball, so we don't want him to wear him down,\" Jazz coach Quin Snyder said. \"His situation is very different. He's had a lot of growth over the course of last year and the summer. One of the good things about Rudy is that he likes to play basketball.\"\nGobert, in other words, is a known commodity. At his best, the 7-foot-1 big man is one of the elite paint protectors in basketball. But he's more than that. Over the course of last year, Gobert proved to be a great rebounder, athletic when running the floor, a supreme finisher at the rim, a better passer than given credit for and a capable free-throw shooter.\nHe is still the Jazz's security blanket. Utah's perimeter defenders played aggressively last season, knowing Gobert was around to erase mistakes, a big part of them closing last year in a strong manner.\nBut has Gobert added to his game? There are rumors of a consistent 10-12 foot jumper being developed over the summer, but it hasn't yet debuted in a game. Gobert clearly hit the weight room in the offseason. He looks bigger, more muscular around the shoulders.\nOne thing Gobert has to adjust to is teams adjusting to him. Once the NBA starts to prepare for you, your greatness relies on that ability to counter. Already, you see players pulling up for floaters, instead of going all the way to the basket. And you can bet teams will go small in an attempt to pull Gobert from the basket.\nStill, the Jazz can rely on Gobert to be what he has been, which is one of the best defenders in the league. And that can possibly take Utah a long way.\n\"It's great knowing you have him behind you defensively,\" Utah guard Rodney Hood said. \"You just do your job and try to keep it out of the middle of the floor and if you get beat, he blocks or alters the shots or gets the rebound. It's great having him back there.\"\n\ntjones@sltrib.com \ntwitter: @tjonessltrib", "external_links": [], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-15T07:36:32.062+03:00", "highlightTitle": ""}