{"organizations": [], "uuid": "56ecc2613ec9dd7100106ee5450d7b84f6d65d46", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nydailynews.com", "main_image": "http://assets.nydailynews.com/polopoly_fs/1.2385264!/img/httpImage/image.jpg_gen/derivatives/landscape_1200/taxi.jpg", "site_section": "http://www.nydailynews.com/news/index.html", "section_title": "Breaking, Local and National News, Sports &amp; Entertainment - NY Daily News", "url": "http://www.nydailynews.com/new-york/city-council-transportation-chair-east-river-tolls-article-1.2385265", "country": "US", "title": "City Council's transportation chair for East River tolls", "performance_score": 0, "site": "nydailynews.com", "participants_count": 1, "title_full": "City Council's transportation chair for East River tolls - NY Daily News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "56ecc2613ec9dd7100106ee5450d7b84f6d65d46"}, "author": "NEW YORK DAILY NEWS", "url": "http://www.nydailynews.com/new-york/city-council-transportation-chair-east-river-tolls-article-1.2385265", "ord_in_thread": 0, "title": "City Council's transportation chair for East River tolls", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Alec Tabak/for New York Daily News TLC Chair Ydanis Rodriguez speaks at a TLC awards ceremony at BMCC theater. The head of the City Council’s transportation committee, Ydanis Rodriguez, voiced support for tolling East River bridges as part of the MoveNY plan from traffic guru Sam Schwartz.\nIn a policy report released Monday at a NYU Rudin Center for Transportation talk, Rodriguez wrote that the plan has potential to “revolutionize the way our city moves and make our roads that much cleaner, safer and more equitably used.”\nThe report — Next Stop: Making Transportation Safe and More Efficient — calls on Albany to let the city toll the bridges it controls to fund transit projects, especially in places without subway stations.\nThe MoveNY congestion pricing plan calls for raising $1.5 billion in revenue a year mostly through a $5.54 toll to use the East River bridges and tunnels and cross 60th Street, while cutting tolls on outerborough bridges like the Verrazano and the Triborough.\nSam Schwartz Engineering Cover page of the Move NY report on Fair Tolling and Transportation Re-Investment Plan, Samuel Schwartz P.E. of Sam Schwartz Engineering Sam Schwartz Engineering Cover page of the Move NY report on Fair Tolling and Transportation Re-Investment Plan, Samuel Schwartz P.E. of Sam Schwartz Engineering Previous Next Enlarge The plan envisions spending $1 billion on mass transit and $375 million in roads and bridges. About $100 million would go toward keeping fares low and the subways and buses running.\nRodriguez told the Daily News said some of the money needs to be set aside for neighborhoods to decide what projects to fund.\n“There should be clear definition of community reinvestment, more than the amount that is place in the plan to renovate tunnels and bridges,” Rodriguez said.\nXanthos, Julia, New York Daily N Sam Schwartz, known as \"Gridlock Sam\" posing for a photo in his office on Broadway. Photo taken on April 1, 2010. The councilman’s report proposes ways to spend money on transit, such as using tax dollars to expand Citi Bike to more neighborhoods, cut prices on MTA commuter rail trips within the city, and add more fast bus routes.\nMoveNY’s campaign director Alex Mattiessen said the tolling plan could generate enough money for such projects.\n“We have to go further in addressing the transit deserts in the more far flung parts of the city, particularly in the non-Manhattan boroughs,” he said. “We think that the city should certainly have a say in how some of these transit-gap busting strategies are identified and half of the money could be spent to address local community needs.”", "external_links": [], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-05T08:07:15.954+03:00", "highlightTitle": ""}