{"organizations": [], "uuid": "f2d7b7cc81dad5fd156b2350a0e3dd71167971e9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.saudigazette.com.sa", "main_image": "", "site_section": "http://www.saudigazette.com.sa/index.cfm?method=home.cat&categoryid=2015100565339", "section_title": "Sports | Saudi Gazette", "url": "http://www.saudigazette.com.sa/index.cfm?method=home.con&contentid=20151005258742", "country": "US", "title": "Mick Jr. keeps Schumacher flag flying", "performance_score": 0, "site": "saudigazette.com.sa", "participants_count": 1, "title_full": "Mick Jr. keeps Schumacher flag flying | Sports | Saudi Gazette", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T06:30:00.000+03:00", "replies_count": 0, "uuid": "f2d7b7cc81dad5fd156b2350a0e3dd71167971e9"}, "author": "saudigazette.com.sa", "url": "http://www.saudigazette.com.sa/index.cfm?method=home.con&contentid=20151005258742", "ord_in_thread": 0, "title": "Mick Jr. keeps Schumacher flag flying", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "This photo taken on on April 25, 2015 shows Mick Schumacher, the son of former Formula 1 driver Michael Schumacher, smiling after winning winning the trophy for the best rookie after the first race of the ADAC Formula Four championship in Oschersleben, Germany. — AFP\nBERLIN — The Schumacher name looks set to continue in motorsport after Mick Jr., son of Germany's seven-time Formula One world champion, finished his debut Formula Four season tenth overall Sunday.\n\"The season was fun,\" the 16-year-old told German broadcaster Sport1, \"we'll have to see about next year.\"\nHis famous father enjoyed 91 wins and 155 podium finishes in his Formula One career and Mick Jnr's introduction to motorsport was more modest.\nOver the season's 24 races, at eight venues, Schumacher Jr. made the podium twice for the Dutch team Van Amersfoort Racing, but many of his rivals have a few years' experience at this level as 18-year-old Marvin Dienst won the series.\nAfter the high of winning at Germany's Oschersleben track in the third race on the opening weekend in April — when he won the best rookie trophy — Schumacher Jr. experienced a few setbacks.\nHe managed to finish third when the Formula Four series returned to Oschersleben in September and his highest finish in the three races at Hockenheim this weekend was fifth.\n\"He's made huge strides forwards,\" said Frits van Amersfoort, Schumacher's team boss.\n\"Mick was lucky with his first win. Then things went a bit downhill, but then he found his feet and things improved.\n\"Now we see that Mick is a strong player in the field.\"\nHaving graduated to Formula Four after a successful career as a Kart racer, Schumacher has got to grips with the faster car.\nAs his father continues to recover from the serious head injury he suffered during a skiing accident in December 2013, Mick Jr. has largely been shielded from the media's glare, thanks to Schumacher Sr's manager. — AFP", "external_links": [], "published": "2015-10-05T06:30:00.000+03:00", "crawled": "2015-10-05T02:59:00.680+03:00", "highlightTitle": ""}