{"organizations": ["Rogers Tweet Nathan", "Yankees", "Toronto Blue Jays", "Rogers Centre", "Royals", "Blue Jays", "Kansas City Royals"], "uuid": "2e3b2264f6b62cb014c586e2cb2c9d17ffb6bd6d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "m.durangoherald.com", "main_image": "http://durangoherald.com/storyimage/DU/20151020/SPORTS01/151029933/AR/0/AR-151029933.jpg", "site_section": "http://www.durangoherald.com/section/sports?template=RSS&mime=xml", "section_title": "Sports", "url": "http://m.durangoherald.com/article/20151020/SPORTS01/151029933/-1/sports&source=RSS", "country": "US", "title": "A Royal romp at Rogers", "performance_score": 0, "site": "durangoherald.com", "participants_count": 0, "title_full": "A Royal romp at Rogers", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T05:38:00.000+03:00", "replies_count": 0, "uuid": "2e3b2264f6b62cb014c586e2cb2c9d17ffb6bd6d"}, "author": "", "url": "http://m.durangoherald.com/article/20151020/SPORTS01/151029933/-1/sports&source=RSS", "ord_in_thread": 0, "title": "A Royal romp at Rogers", "locations": ["Kansas City", "Detroit", "Texas", "Toronto"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mike Moustakas", "Marco Estrada", "Kenny Rogers", "Ben Zobrist", "Ned Yost", "John Gibbons", "Chris Young", "Mark Lowe", "Cliff Pennington", "Hunter Wendelstedt", "Yost", "Luke Hochevar", "Jose Bautista", "Dickey", "Ryan Madson", "Edinson Volquez", "Ryan Tepera", "Pennington", "Franklin Morales", "Alex Rios", "Tepera", "Hosmer", "Josh Donaldson", "Kelvin Herrera", "Ryan Goins", "Escobar", "Alex Gordon", "Lorenzo Cain", "Young", "Zobrist", "Rios", "Eric Hosmer", "Donaldson", "Alcides Escobar", "Nathan", "Randy Johnson", "R.A. Dickey", "Cain"], "text": "Tweet Nathan Denette/The Canadian Press Lorenzo Cain scored a run for the Kansas City Royals past Toronto Blue Jays starting pitcher R.A. Dickey, who had to cover home plate after a passed ball. Cain was signaled safe by umpire Hunter Wendelstedt. The Royals went on to score 14 times to take a 3-1 series lead in the ALCS. Nathan Denette/The Canadian Press Lorenzo Cain scored a run for the Kansas City Royals past Toronto Blue Jays starting pitcher R.A. Dickey, who had to cover home plate after a passed ball. Cain was signaled safe by umpire Hunter Wendelstedt. The Royals went on to score 14 times to take a 3-1 series lead in the ALCS. T ORONTO – Ben Zobrist and the relentless Kansas City Royals showed they can play home run derby, too. And with one more win, they’ll have a chance to show off their power in a return trip to the World Series. Zobrist hit a two-run homer on knuckleballer R.A. Dickey’s fourth pitch of the game, Alex Rios connected an inning later, and the Royals romped past the Toronto Blue Jays 14-2 on Tuesday for a 3-1 lead in the American League Championship Series. Lorenzo Cain scored on a passed ball, and Mike Moustakas had a sacrifice fly in an LCS-record four-run top of the first. “We’re a good offensive team,” Royals’ first baseman Eric Hosmer said. “Our park, our style of play is a little different. We like to use our legs and be athletic, but when we come to some of these parks where the fences aren’t as deep we’ve got some guys that can put the ball in the seats.” Alcides Escobar had four runs batted in, and Cain drove in three runs, as the Royals bounced back from an 11-8 loss Monday. Kansas City led 5-2 in the seventh before breaking away. Blue Jays infielder Cliff Pennington relieved in the ninth inning, becoming the first primarily position player to pitch in the postseason, STATS said. Greeted by cheers, he allowed two hits and got one out. Kansas City can win the pennant Wednesday, when Edinson Volquez will start against Toronto’s Marco Estrada in a Game 1 rematch. “It’s a do-or-die game for us,” Toronto manager John Gibbons said. “But they do it all year. I think these guys will let this one go and they’ll show up to play (Wednesday). ... I know these guys will be ready.” After flashing power to build a 5-0 lead on the long ball, the Royals returned to their pesky ways late in the game against the Blue Jays’ struggling bullpen. They scored nine runs with three more sacrifice flies, a barrage of slashing hits and heads-up baserunning. “We were really focused on being productive collectively,” Rios said. “And I guess we’re doing a pretty good job of doing that.” Blue Jays fans had seen enough after Cain’s two-run single in the eighth, turning their ever-optimistic cheers to jeers when Mark Lowe replaced Ryan Tepera. The 36-year-old Chris Young bested Dickey, 40, in a bookish matchup of veteran starters – only the pairing of the Yankees’ Randy Johnson and Detroit’s Kenny Rogers in the 2006 ALDS tops the duo for combined age. But just like his counterpart’s effort in Game 4 of the Division Series against Texas, the 6-foot-10 Young was lifted one out shy of qualifying for a victory when Ned Yost went to his bullpen with a runner on first with two outs in the fifth. Yost wasn’t willing to take any chances against Josh Donaldson, who already had an RBI-double. Dickey never had a chance to get that first playoff victory in a 13-year big league career. Escobar got a hit leading off for the fourth consecutive game, starting this one with a bunt down the third-base line. Zobrist connected for his first homer of the ALCS. Rios homered against his former team in the second for a 5-0 lead. After Dickey hit Escobar with a pitch – a call that needed replay review to get it right – he walked Cain one out later and was done after 1 2/3 innings. Young used that steep arm angle to outwit the powerful Jays, who were 53-28 at home in the regular season but just 11-14 with the roof closed – which it was Tuesday. He held them hitless until Ryan Goins’ one-out single in the third. Donaldson drove him home with a ground-rule double down the left-field line on an 83 mph slider. Jose Bautista added an RBI grounder to close the gap to 5-2 and get those white towels twirling at Rogers Centre. But Luke Hochevar, Ryan Madson, Kelvin Herrera and Franklin Morales shut down the Blue Jays the rest of the way. Kansas City’s four-spot in the seventh to made it 9-2. Escobar and Hosmer had sacrifice flies to deep center, Cain singled to extend his postseason hitting streak to 13 games and Alex Gordon scored on Tepera’s wild pitch. Cain hit a two-run single in the eighth, and Escobar drove in two off Pennington in the ninth. “We feel good. We like the way we’re playing right now,” Royals manager Ned Yost said. “Our offense has been really, really good.” Related stories", "external_links": [], "published": "2015-10-21T05:38:00.000+03:00", "crawled": "2015-10-21T13:43:43.269+03:00", "highlightTitle": ""}