{"organizations": ["University of Toronto Varsity Blues", "The University of Ottawa Gee-Gees"], "uuid": "035ba729c882beea5afa27be19096256522b1124", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ottawasun.com", "main_image": "http://storage.ottawasun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297764048391_LARGE_BOX.jpg?quality=80&stmp=1445726389478&size=100x", "site_section": "http://www.ottawasun.com/sports/rss.xml", "section_title": "Top Sports stories", "url": "http://www.ottawasun.com/2015/10/24/gee-gees-qb--derek-wendel-sets-national-record", "country": "CA", "title": "Gee-Gees QB Derek Wendel sets national record", "performance_score": 0, "site": "ottawasun.com", "participants_count": 0, "title_full": "Gee-Gees QB Derek Wendel sets national record", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T01:33:00.000+03:00", "replies_count": 0, "uuid": "035ba729c882beea5afa27be19096256522b1124"}, "author": "", "url": "http://www.ottawasun.com/2015/10/24/gee-gees-qb--derek-wendel-sets-national-record", "ord_in_thread": 0, "title": "Gee-Gees QB Derek Wendel sets national record", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Derek Wendel"], "text": "The University of Ottawa Gee-Gees hammered the University of Toronto Varsity Blues 45-9 on Saturday, but were eliminated from playoff contention by the out-of-town scoreboard. \nBut that wasn't the story this weekend. \nThe Gee-Gees needed Queen's to upset Laurier to keep their playoff hopes alive. Though that didn't happen as the Golden Gaels lost 49-26, Ottawa quarterback Derek Wendel put on a show, setting national records for passing yards in a season with 3,136 and completions with 210. In the process, the fourth-year quarterback set new school marks for completions (216), attempts (346), total yards and touchdown passes (24), which were all previously held by former Gee-Gees quarterback-turned-RedBlacks receiver Brad Sinopoli. \nWhile the school records were expected to fall Saturday, Wendel needed a massive game to break the CIS mark and did just that, completing 34 of 46 passes for 564 yards and four touchdowns, while also rushing for another score. Wendel was about 50 yards short of the record late in the fourth quarter and centre Cody Moynes asked head coach Jamie Barresi to put Wendel, who was sitting to give Victor Twynstra a few reps, back in the game. Well ahead and not wanting to rub it into Toronto's face but well-aware of the significance of the record, Barresi gave Wendel another shot and he quickly set a new CIS best. \n\"I said 'yeah, we'll try one (more) play and we'll take a shot down field' and it worked out for us,\" Wendel said after the game. \"It's a great feeling. It would have been better if we would have made (the playoffs) if Queen's would have upset Laurier there but I'm still happy to be a part of this team. We had a great season and I feel great right now that coach gave me a chance to get that couple yards there at the end.\" \nReceiver Ian Stewart, one of Wendel's favourite targets, also had a record afternoon, catching nine passes for 175 yards and two touchdowns to become the first Gee-Gees player ever to exceed 1,000 receiving yards in a season. \n\"It's an honour,\" said Stewart, who graduates this year and will be looking at options at the CFL level. \"I put in five years of hard work and to finally (get the record) and have a career like I did is just an awesome feeling. I'm happy for the team, we got to go out on a win.\" \nWhile the season didn't go the way the Gee-Gees wanted -- a 3-5 record that included an overtime loss to the rival Carleton Ravens in the annual Panda Game -- Barresi had nothing but good things to say about Wendel and Stewart, with the veteran coach getting choked up a couple times talking about what the two veterans have meant to the team. \n\"I've been a quarterback coach most of my (career) and had some really good ones -- Buck Pierce, Darian Durant, I worked with Dave Dickenson, and Danny McManus,\" Barresi said. \"I kind of relayed their work ethic to (Wendel) and he embraced that very much and I can't say enough about what he did. \n\"The biggest thing is to try and develop a very intricate line of communication and he understood that and to be able to talk to him at a certain level, he was way beyond what I expected.\" \nThe coach had similar praise for Stewart. \n\"The thing about Ian was I could come into the meeting room at 2:30 and have 20 new concepts and present them to the players and Ian absorbed them, Barresi said. \"He would actually get everybody right on the field, he was more like a coach on the field, not only a great performer.\" \nRAVENS HITTING ROAD FOR PLAYOFFS \n\nThe Carleton Ravens missed their opportunity to lock up a home playoff game in their regular season finale, dropping a 44-12 home decision to the Guelph Gryphons on Saturday. \nA win over the 6-1 Gryphons would have brought the school its first home playoff game since 1986. The Ravens, playing in their third OUA campaign since the school brought the program back, clinched a playoff spot earlier this month with a 52-0 demolition of York. \nSaturday’s game was never close. Gabriel Ferraro opened the scoring for Guelph with a field goal with eight minutes left in the opening quarter and the edge ballooned to a 27-2 lead by halftime. \nGuelph quarterback James Roberts threw for 327 yards and four touchdowns, while receiver Jacob Scarfone led the way with touchdowns and 125 receiving yards. \nRavens quarterback Jesse Mills was picked off twice while Jahvari Bennett failed to find the end zone despite picking up 142 rushing yards. \nThe Ravens will travel to Kingston to face the Queen’s Golden Gaels in an OUA quarterfinal next Saturday.", "external_links": [], "published": "2015-10-25T01:33:00.000+03:00", "crawled": "2015-10-25T01:38:12.565+02:00", "highlightTitle": ""}