{"organizations": [], "uuid": "84ce5499e5f1be21456d407eedf05793502a50a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.winnipegfreepress.com", "main_image": "http://media.winnipegfreepress.com/images/576*432/CPT120304032_high.jpg", "site_section": "http://www.winnipegfreepress.com/rss/?path=/sports", "section_title": "Winnipeg Free Press: Sports", "url": "http://www.winnipegfreepress.com/sports/while-fans-would-love-wiggins-in-toronto-hes-learning-from-legend-in-minnesota-332165682.html", "country": "US", "title": "While fans would love Wiggins in Toronto, he's learning from legend in Minnesota", "performance_score": 0, "site": "winnipegfreepress.com", "participants_count": 1, "title_full": "While fans would love Wiggins in Toronto, he's learning from legend in Minnesota - Winnipeg Free Press", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T17:02:00.000+03:00", "replies_count": 0, "uuid": "84ce5499e5f1be21456d407eedf05793502a50a4"}, "author": "Lori Ewing, The Canadian Press", "url": "http://www.winnipegfreepress.com/sports/while-fans-would-love-wiggins-in-toronto-hes-learning-from-legend-in-minnesota-332165682.html", "ord_in_thread": 0, "title": "While fans would love Wiggins in Toronto, he's learning from legend in Minnesota", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "TORONTO - The Minnesota Timberwolves were practising in Toronto, and off to one side, Andrew Wiggins was leaning, head bent to one side, listening to Kevin Garnett.\nIt's become a common sight since Garnett returned to the T'Wolves in February of last season, a mentoring partnership between one of the league's oldest and greatest players and Wiggins, the game's future.\n\nMinnesota Timberwolves' Andrew Wiggins, right, talks with Timberwolves' veteran Kevin Garnett, left, on the bench while playing against the Toronto Raptors during first half NBA basketball action in Toronto on Wednesday, March 18, 2015. While fans would love Wiggins in Toronto, he's learning from legend Garnett in Minnesota. THE CANADIAN PRESS/Nathan Denette \n\"Just in those couple of minutes, he teaches me and tells me stuff that can help me for the rest of my career,\" Wiggins said.\nThe 20-year-old from Vaughan, Ont., was back home for Minnesota's pre-season game against the Toronto Raptors on Monday. As of Monday morning, he was attempting to purchase 16 courtside seats for family and friends at the Air Canada Centre.\nBoth the Raptors and their fans would undoubtedly rather see the reigning NBA rookie of the year in a Toronto jersey, but the young star is in a good place in Minnesota, according to T'Wolves interim head coach Sam Mitchell.\n\"Our veteran guys have pitched in trying to mentor our young guys and trying to make them understand just how difficult this league is and how hard you have to work, and most important how to prepare for games,\" said the former Raptors coach. \"We have a nice mix of guys.\"\nThe T'Wolves also signed veterans Andre Miller (39) and Tayshaun Prince (35) in the off-season, and the blend of young and old has made for an \"exciting\" camp, said Wiggins.\n\"The vets on our team love to teach, whenever we do something wrong or right, or a good play, they're always telling us why you should do this, why you should do that. . .,\" Wiggins said. \"So it's been a lot of learning and also been very exciting for young players,'\nRaptors coach Dwane Casey, who's watched Wiggins from afar, said the young star delivered as advertised in his rookie season.\n\"He's done exactly what everyone had thought, he's a talented young man, the game is easy for him, he's learning to take what the game is giving him offensively, defensively he's gotten better, using his length, speed and quickness defensively. . .,\" Casey said. \"He's right on path to being a great player.\"\nCasey agreed Wiggins' relationship with the 39-year-old Garnett, a 20-year NBA veteran, will be invaluable.\n\"If he watches KG in practice and listens to what he says, how hard KG practises even at his age is unbelievable,\" Casey said. \"The way KG talks on defence, all the players can watch and learn from that.\"\nWiggins, who's fresh off playing for Canada at the FIBA Americas Olympic qualifying tournament in Mexico last month, said he's a lot more comfortable in his second NBA training camp than he was last season.\n\"I know what to expect, I know what I was good at before, and what I wasn't good at. Just learned a lot,\" he said. \"I worked hard this summer, so everything I was good at last year, everything I was bad at, I'm trying to get better at this year.\"\nMonday's game was to feature four Canadians in Wiggins and his brother Nick, signed by the T'Wolves last month, and Toronto's Cory Joseph and Anthony Bennett.\nBennett, the No. 1 draft pick in 2013, played with Wiggins in Minnesota last season, but was waived in September and subsequently signed by Toronto.\nCasey said Bennett's defence has impressed both the coaching staff and Bennett's teammates.\n'I didn't know he was as good of a defender as he's shown since we've had him, which is very impressive,\" Casey said. \"The main thing for him is to relax and play, enjoy the game and get that No. 1 pick necklace off his neck and just play basketball. Have fun.\n\"Just forget everything else, clean slate, start from scratch and go from there.\"\nThe Raptors and T'Wolves meet again in Ottawa on Wednesday as part of the NBA's Canada Series, with games in Vancouver, Winnipeg, Ottawa and Montreal. The Raptors play the Washington Wizards in Montreal on Oct. 23.\n ", "external_links": [], "published": "2015-10-12T17:02:00.000+03:00", "crawled": "2015-10-13T01:45:13.496+03:00", "highlightTitle": ""}