{"organizations": [], "uuid": "9b2d37391bce213e2be4d4c7e72aef91c8ed99a9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "knox.villagesoup.com", "main_image": "http://knox.villagesoup.com/media/Common/CourierPublications/2015/10/23/1699727/t600-IMG_0543.jpg", "site_section": "http://knox.villagesoup.com//rss/story/sports", "section_title": "Knox VillageSoup Sports Headlines", "url": "http://knox.villagesoup.com/p/foggy-clash-rams-prove-tough-against-windjammers-in-league-final/1432298?source=rss", "country": "US", "title": "Foggy clash: Rams prove tough against Windjammers in league final", "performance_score": 0, "site": "villagesoup.com", "participants_count": 1, "title_full": "Foggy clash: Rams prove tough against Windjammers in league final", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T19:00:00.000+03:00", "replies_count": 0, "uuid": "9b2d37391bce213e2be4d4c7e72aef91c8ed99a9"}, "author": "news@courierpublicationsllc.com (Staff)", "url": "http://knox.villagesoup.com/p/foggy-clash-rams-prove-tough-against-windjammers-in-league-final/1432298?source=rss", "ord_in_thread": 0, "title": "Foggy clash: Rams prove tough against Windjammers in league final", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "View More... \nFairfield — In miserable, foggy conditions, the Camden Hills girls soccer team suffered its first loss of the season on Thursday night, Oct. 22 as Bangor secured a 2-0 Kennebec Valley Athletic Conference Class A championship victory at wet Lawrence High School. \nIn a warm-up game for the regional tournament set to begin in the coming days, the Rams received two goals from Libby Spekhardt and two assists from Maddi Cormier to earn the win. \nBangor scored goals in each half, with the first coming at the 13:59-mark of the opening half and the second at 25:45 of the second half. \nCamden Hills finished with a 12-9 edge in shots, while both teams took three corner kicks. \nEmily Gilmore made 10 saves in goal for the Rams and Jana Speiker seven saves in net for the Windjammers. \nVeteran coach Meredith Messer took the loss in stride — particularly given that the Windjammers' season is not yet over. \n“I just think every opportunity is a learning opportunity,” she said. “There are things we can still get better at and hopefully we have eight or nine practices left to continue working.” \nFog played a role in the game. Veteran Windjammer coach Meredith Messer said it was the thickest fog in a game she had seen. \n“I said to the girls, 'Well, if you can't see it the keeper can't see it,' ” she said. “So shoot. But that was one thing we could have done more, we could have shot sooner and taken advantage of some space that we had. But that's all for us to learn from.” \nBangor's first goal came when a Camden Hills' defender slipped and Spekhardt got the jump on her, which brought Speiker out of the goal and Spekhardt chipped the ball over Speiker's head. \nCamden Hills dominated possession in the second half, but the Rams added an insurance goal as the fog grew thicker. \n“I thought in the second half [we] did a much better job stepping to the ball,” she said. “I really haven't had to get on them very much [this season] about being aggressive and checking hard to balls and things like that, but Bangor is an aggressive team and if you're not working hard to receive the ball, it's hard to possess it.” \nCamden Hills earned a 4-1 regular-season road victory over the Rams Sept. 22 — Bangor's lone loss. \nCamden Hills finished the regular season 13-0-1, while Bangor was 11-1-2. \nThe teams are ranked first and second, respectively, for the Class A North tournament and could meet a third time this fall in the regional final at Don Palmer Field in Rockport. \nIt is the Windjammers first season playing in Class A after earning considerable success in Class B over the years. \nThe Windjammers, who averaged 5.8 goals this season, outscored opponents 81-11 through 14 regular-season games. \nCamden Hills will host either No. 8 Brewer or No. 9 Mount Blue of Farmington in the quarterfinal round on Tuesday, Oct. 27 at 3 p.m. in Rockport. Courier Publications' sports staff can be reached by email at sports@villagesoup.com or by phone at 594-4401.", "external_links": [], "published": "2015-10-23T19:00:00.000+03:00", "crawled": "2015-10-23T21:36:49.046+03:00", "highlightTitle": ""}