{"organizations": [], "uuid": "6b79168b864d59fc84e9fc4d5a8b6226c8de3cf0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "cherokeetribune.com", "main_image": "http://matchbin-assets.s3.amazonaws.com/public/sites/625/thumbs/G1Z9_rgbWoodstock_at_Cherokee_Softball_2_cmyk.jpg", "site_section": "http://cherokeetribune.com/rss/rss/Sports?instance=Sports&content_type=article&tags=sports&tag_inclusion=or&offset=0&limit=10&page_name=rss", "section_title": "Sports", "url": "http://cherokeetribune.com/bookmark/26906919", "country": "US", "title": "Woodstock has momentum entering state playoffs", "performance_score": 0, "site": "cherokeetribune.com", "participants_count": 1, "title_full": "Woodstock has momentum entering state playoffs", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T09:03:00.000+03:00", "replies_count": 0, "uuid": "6b79168b864d59fc84e9fc4d5a8b6226c8de3cf0"}, "author": "Alex Resnak aresnak@cherokeetribune.com (noreply@cherokeetribune.com)", "url": "http://cherokeetribune.com/bookmark/26906919", "ord_in_thread": 0, "title": "Woodstock has momentum entering state playoffs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Woodstock has momentum entering state playoffs by Alex Resnak October 14, 2015 01:03 AM | 166 views | 0 | 2 | | Cherokee entered the Region 5 tournament as the top seed, but it was Laura Bishop and Woodstock that ended it as champion. Staff photo by Kathryn Ingall When the softball state playoffs start today, Cherokee County will be represented by four of its six teams competing.Woodstock and Cherokee will contend in Class , while River Ridge and Creekview qualified in Class .After rolling through the Region 5 tournament last week, Woodstock will have the easiest road to the finals in Columbus.“We played some great teams in our region, and just to make it in the top four was an accomplishment,” coach Kortney Dempsey said. “To be No. 1 in our region is an even higher honor. It definitely gave us a confidence boost that I hope we can carry over to our state playoff games. I think the girls are excited and focused, and we’re definitely playing as one unit. It was a good region tournament for us.”The Lady Wolverines swept through the region tournament without dropping a game, due in large part to freshman pitcher Laura Bishop, who led a pitching staff that only allowed two runs per game in the tournament.Bishop was also a major contributor at the plate, along with leadoff hitter Breanna Roper, Lexi Solorzano and Danielle Rubin.In addition to the momentum it gained in the region tournament, Woodstock will also have the edge of playing at home when it opens its best-of-three series against Dacula. Dempsey said it may be the boost her team needs to get past its previous first-round woes.“Playing at home is going to be something special, just having that playoff atmosphere at our own place and having our fans so close,” she said. “I think that the region is going to give us that momentum to take it to the next level. We always make it to the first round, but it’s time to go to the second round and even further.”One of the teams Woodstock beat on its way to the region title was Cherokee.The Lady Warriors entered the tournament as the top-seeded team, but their loss to Woodstock meant they had to bounce back with a win against Roswell to earn the region’s third seed and a trip to Grayson. Despite that, coach Tonya Carlisle said she know who her team is, and their confidence is not shaken.“I always say that, if we do the things we need to do as a team, we’ll come out on top,” she said. “I think there are some things we wish we could’ve done better or differently during the tournament, but, at the same time, we’re the same team that had a 17-game winning streak. We played well throughout the season. We just have to get back to the basics with the little things that we do.”The Lady Warriors are at their most dangerous when they have runners on the basepaths, with Macy Martinez, Autumn Bible and Alise Hooks at the top of the lineup.Creekview took the third seed in Region 7 and will open its playoffs with a visit to Stephenson.“I feel good about our chances,” coach Chance Cain said. “We’re playing pretty good team ball right now, and we’re looking forward to getting started next week. We played six games in our region tournament, so we’re ready to go. You always shoot for a region championship, but we just needed to make the playoffs. Third seed is fine with me.”Creekview will likely continue to ride the arm of star pitcher Bethany Hyde and the bats of Madison Dionne, Ariel Rogers and Amy Vetula.Finishing just behind the Lady Grizzlies as the region’s No. 4 seed was River Ridge, which will travel to Dunwoody in its first-round matchup.The Lady Knights may cause problems for teams with the pitching tandem of Jessica Mirocha and Savannah Flaherty, and coach Andrew Marinelli said he plans to use the matchups to his advantage.“I still feel really good about our chances,” he said. “I know we have the talent and the drive to match up with anyone. We just need to go out there and execute like we’ve shown we can.”Even if the pitching is not performing, River Ridge has shown it can win with an offense led by Beth McCulley, Brianna Collender and Paige Taylor. Share This Article | similar stories", "external_links": [], "published": "2015-10-14T09:03:00.000+03:00", "crawled": "2015-10-14T10:24:13.486+03:00", "highlightTitle": ""}