{"organizations": ["BST Arsenal", "Bayern Munich", "Bayern Munich Getty Images"], "uuid": "2cb6d21c15cccff6adc1abba6a33f675a18b121e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ibtimes.co.uk", "main_image": "http://d.ibtimes.co.uk/en/full/1461953/arsene-wenger.jpg", "site_section": "http://www.ibtimes.co.uk/rss/sports", "section_title": "IBTimes.co.uk : Sports", "url": "http://www.ibtimes.co.uk/arsenal-vs-bayern-munich-champions-league-2015-16-where-watch-live-preview-betting-odds-1524802", "country": "US", "title": "Arsenal vs Bayern Munich, Champions League 2015/16: Where to watch live, preview, betting odds and possible XI", "performance_score": 0, "site": "ibtimes.co.uk", "participants_count": 0, "title_full": "Arsenal vs Bayern Munich, Champions League 2015/16: Where to watch live, preview, betting odds and possible XI", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T10:35:00.000+03:00", "replies_count": 0, "uuid": "2cb6d21c15cccff6adc1abba6a33f675a18b121e"}, "author": "", "url": "http://www.ibtimes.co.uk/arsenal-vs-bayern-munich-champions-league-2015-16-where-watch-live-preview-betting-odds-1524802", "ord_in_thread": 0, "title": "Arsenal vs Bayern Munich, Champions League 2015/16: Where to watch live, preview, betting odds and possible XI", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "October 20, 2015 08:35 BST Arsenal need to put their best foot forward against Bayern Munich Getty Images \nArsenal host Bayern Munich in their third group game of the Champions League on 20 October, having made a disastrous start to their European campaign. The Gunners have lost two on the bounce against ostensibly lesser opponents and need a positive result against the Bundesliga leaders to get themselves back in contention for a place in the knockout stages. \nWhere to Watch Live \nKick-off is set for 7.45pm BST . Live coverage of the game will be on BT Sport Europe and BT Sport Europe HD. \nOverview \nArsenal come into the game on the back of three brilliant league wins over Leicester City, Manchester United and Watford, scoring 11 goals and conceding only two in the process. The Gunners have the best defensive record in the league, conceding only seven goals thus far and keeping five clean sheets. However, they have been a completely different team in Europe, having conceded five goals in the two games they have played, scoring only thrice. \nTheir loss to Dinamo Zagreb in the first game saw Olivier Giroud sent off for a double yellow in the first half which made it a tall order for the Gunners to make anything out of the fixture. Meanwhile, against Olympiacos, shoddy defending from set pieces, an own goal from David Ospina and failure to open up the Greek defence saw the Gunners succumb to their second loss. \nArsene Wenger's men now have a double header to contend with against Bayern, who are undefeated in all competitions, having scored eight goals against Zagreb and Olympiacos in the last two games. The Frenchman can find some consolation in the fact that the Gunners have won one and drawn one against the Bundesliga club in their last four games, but need to put in a better performance at home, where they have lost their last two. \nMeanwhile, Pep Guardiola has said Bayern are the underdogs coming into the fixture. Nothing can be farther from the truth, given the form Bayern are at the moment, having dispatched Zagreb and Olympiacos in their last two games with consummate ease. Robert Lewandowski's form for both club and country has been nothing short of exemplary and the Arsenal defence will face their biggest test thus far to keep the German Champions at bay in what could turn out to be a long night for the Gunners. \nWhat Managers Say \nArsene Wenger: \"We could be suspected of not taking the first two Champions League games seriously enough, but that won't be a problem against Bayern. We know we are playing against a top side. Tomorrow everyone will be highly focused. We are [confident]. We've played great Bayern teams before, at least as good as the one we play tomorrow, and beaten them. The team that won the treble, with [Franck] Ribery at full power, [Arjen] Robben at full power, [Toni] Kroos and [Bastian] Schweinsteiger, [Thomas] Muller. There is no team without weaknesses. If you asked me to come out with them now, I wouldn't do it. But there are no teams without weaknesses.\" \nPep Guardiola: \"In this situation they have an advantage because, for them, they have to win. And when that happens with these kinds of players, and the history of this club, they are going to make the best performance possible. I don't expect to face a team that won't fight for 90 minutes and in this situation they have an advantage.\" \nBetting Odds", "external_links": [], "published": "2015-10-20T10:35:00.000+03:00", "crawled": "2015-10-20T10:41:03.517+03:00", "highlightTitle": ""}