{"organizations": [], "uuid": "e5c9e8542df6758350f6ab25e07a3c647a5c3f17", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.startribune.com", "main_image": "http://stmedia.stimg.co/ows_14441939848556.jpg?h=630&amp;w=1200&amp;fit=crop&amp;bg=999&amp;crop=top", "site_section": "http://www.startribune.com/sports/index.rss2", "section_title": "Sports", "url": "http://www.startribune.com/twin-cities-sports-has-leaders-and-it-s-time-to-embrace-them/332273652/", "country": "US", "title": "Souhan: Twin Cities sports teams have leaders; time to embrace them", "performance_score": 0, "site": "startribune.com", "participants_count": 1, "title_full": "Souhan: Twin Cities sports teams have leaders; time to embrace them - StarTribune.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T08:37:00.000+03:00", "replies_count": 0, "uuid": "e5c9e8542df6758350f6ab25e07a3c647a5c3f17"}, "author": "KYNDELL HARKNESS/STAR TRIBUNE kyndell.harkness@startribune.com", "url": "http://www.startribune.com/twin-cities-sports-has-leaders-and-it-s-time-to-embrace-them/332273652/", "ord_in_thread": 0, "title": "Souhan: Twin Cities sports teams have leaders; time to embrace them", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Like art or its antithesis — hipster fashion — you know leadership when you see it.\nWe’ve seen it a few times around here lately.\nLeadership is Zach Parise getting knocked onto his breezers in Colorado, and instead of skating to the bench or raising his fists, driving to the net and scoring the prettiest goal of the Wild’s season-opening comeback victory.\nLeadership is Lynx star Maya Moore wanting and taking the game-winning shot in Game 3 of the WNBA Finals, then, after making it, embracing her teammates instead of running toward the nearest television camera.\nLeadership can be Torii Hunter changing a team’s personality by walking through the door in spring training, or Paul Molitor treating journeymen the same way he treats stars.\nIt is easiest recognized when attached to victory but not necessarily correlated. Lindsay Whalen diving into an opponent’s legs for a loose ball Sunday night, at the end of a season that has beaten her legs like a meat tenderizer, qualifies despite her team’s loss.\nWhen Teddy Bridgewater stands at a podium and bores everyone in the room, that is his current version of leadership — submerging his witty personality to say only that which he believes a young quarterback should publicly say.\nWhen Chad Greenway takes pay cuts and a loss of playing time without public complaint because of his regard for the Vikings’ organization and the comfort of his Minneapolis-ensconsed family, that is a mature form of leadership.\nLeadership is Gophers coach Jerry Kill reminding himself and his team what and who they are — a power-running team that should not be dependent on its quarterback — and then producing 326 rushing yards in a road victory that at least momentarily cast a difficult season in different light.\nLeadership is baseball discipline czar Joe Torre forsaking his traditionalist roots to make the correct call on Chase Utley’s slide, and suspending him for two games. Too many baseball people think the old days were the good days, when in fact the old days featured institutional racism, crumbling ballparks, bad food, beanballs, spitballs, sharpened spikes and, well, I should have had you at institutional racism.\nLeadership isn’t what it always appears to be. Kirby Puckett became famous for walking into the Twins’ clubhouse before Game 6 of the 1991 World Series, telling teammates to “jump on my back,’’ and then making a game-saving catch and hitting a game-winning home run.\nThe truth is, Puckett told teammates to jump on his back many times, and some of those times he went 0-for-5 with two strikeouts. Puckett’s real baseball leadership came in the everyday needling that keeps a clubhouse loose, and in running hard on even the most hopeless of ground balls and pop-ups. It’s hard to shirk when the superstar sitting next to you on the bench is hustling on one-hoppers to the mound.\nMolitor was a leader as a player, as well. He arrived in 1996, and even without Puckett in the lineup, he helped everyone around him — Chuck Knoblauch, Rich Becker, Scott Stahoviak and Marty Cordova — produce career years.\nLeadership might be Cheryl Reeve ripping off her jacket. It might be Amir Coffey choosing to play basketball at Minnesota and personally recruiting Eric Curry to join him. It might be Karl-Anthony Towns becoming the most engaging star on the Timberwolves, allowing Andrew Wiggins to remain his quiet self.\nWhat leadership is, how to measure it and how much it affects winning percentage always will be a mystery. That’s why so many number crunchers hate the concept.\nLike bad advertising or a spoiled child, you don’t have to prove that leadership exists to know it when you see it.\nIn what has been a depressed sports market, there are leaders present and emerging. Maybe one of them will have a Puckett moment soon, and maybe it will be the great Maya Moore on Wednesday night.\nJim Souhan’s podcast can be heard at MalePatternPodcasts.com . On", "external_links": ["http://www.twitter.com/SouhanStrib"], "published": "2015-10-13T08:37:00.000+03:00", "crawled": "2015-10-13T09:52:17.556+03:00", "highlightTitle": ""}