{"organizations": ["Clemson", "AP"], "uuid": "f42509c9202912faa60f590b594f5ef98183e0ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.live5news.com", "main_image": "http://wcsc.images.worldnow.com/images/6369506_G.jpg", "site_section": "http://www.live5news.com/Global/category.asp?C=128853&clienttype=rss", "section_title": "Live 5 News - SPORTS", "url": "http://www.live5news.com/story/30180535/no-12-clemson-holds-off-late-push-from-no-6-notre-dame-for-24-22-win", "country": "US", "title": "No. 12 Clemson holds off late push from No. 6 Notre Dame for 24-22 win", "performance_score": 0, "site": "live5news.com", "participants_count": 0, "title_full": "No. 12 Clemson holds off late push from No. 6 Notre Dame for 24-22 win", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T08:16:00.000+03:00", "replies_count": 0, "uuid": "f42509c9202912faa60f590b594f5ef98183e0ae"}, "author": "", "url": "http://www.live5news.com/story/30180535/no-12-clemson-holds-off-late-push-from-no-6-notre-dame-for-24-22-win", "ord_in_thread": 0, "title": "No. 12 Clemson holds off late push from No. 6 Notre Dame for 24-22 win", "locations": ["CLEMSON", "Charleston"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "No. 12 Clemson holds off late push from No. 6 Notre Dame for 24- - Live5News.com | Charleston, SC | News, Weather, Sports Member Center: No. 12 Clemson holds off late push from No. 6 Notre Dame for 24-22 win Posted: Updated: CLEMSON, SC (AP) - \nDeshaun Watson threw for two touchdowns, ran for a third and Clemson's defense stopped DeShone Kizer on a tying two-point conversion as the 12th-ranked Tigers held on to beat No. 6 Notre Dame 24-22 on Saturday night. \nTigers linebacker B.J. Goodson had an interception and a fumble recovery to halt two fourth-quarter drives by the Fighting Irish (4-1). But the biggest stop was by defensive tackle Carlos Watkins, who brought down Kizer short of the goal line with seven seconds left. \nKizer rallied Notre Dame from 21-3 down in the second half with two touchdown passes, the last a 1-yard toss to Torii Hunter Jr. \nClemson secured the Notre Dame's onside kick and closed out the victory, moving to 4-0 for fourth time in five years. \nWaterlogged Clemson fans rushed the field when time ran out, celebrating the win over the highest-ranked Tiger opponent since they defeated No. 5 Georgia to start the 2013 season. Those title dreams died a few weeks later when undefeated Clemson was stomped by eventual national champion Florida State, which put up the most points ever scored by an opponent in Death Valley in a 51-14 loss. \nAnother loss was surely on many minds as Clemson saw its 18-point lead sliced to two after Hunter's TD catch. \nThis time, though, the Tigers defense held strong. \nClemson forced four turnovers, all in the second half, to stay in front. \nWatson accounted for 190 yards, 93 of those coming on the ground. He had a 21-yard TD run early in third quarter to put the Tigers up 21-3. That's when Notre Dame's defense rose up to give its offense a chance to come back. \nKizer had a 56-yard scoring pass to C.J. Prosise, Notre Dame's eighth play this season of at least 50 yards. The Irish closed to 24-16 on Kizer's 3-yard scoring run to set up the wild final moments. \nClemson struck quickly in Notre Dame's first visit to Death Valley since 1977, with Watson running for 38 yards on the game's first play. Watson found Leggett moments later for a 6-yard touchdown pass and a 7-0 lead. \nClemson kept the pressure on its next series. Watson connected with Hunter Renfrow for a 24-yard pass inside Notre Dame's 20, before finding Scott for a 13-yard TD and a 14-0 lead as the stunned Irish looked at each other as they headed to the sidelines. \nThe Irish's only points of the half came on a 46-yard field goal by Justin Yoon. \nThe rainstorm that saturated much of the East Coast was a focus of the week. South Carolina Gov. Nikki Haley — a Clemson graduate whose picture is on one of the Tigers' offensive play-call signs — told fans to stay home unless they had to attend. The stands, though, were filled with orange ponchos and raincoats as the rain fell. \nCopyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Can't Find Something?", "external_links": [], "published": "2015-10-04T08:16:00.000+03:00", "crawled": "2015-10-04T08:34:31.681+03:00", "highlightTitle": ""}