{"organizations": [], "uuid": "f2c24a51304a0b4989f1daec30aede50bb442044", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.emporiagazette.com", "main_image": "http://bloximages.newyork1.vip.townnews.com/emporiagazette.com/content/tncms/assets/v3/editorial/b/49/b49371c2-7734-11e5-981f-53e760739da2/56264bfb9c6ed.image.jpg?resize=760%2C563", "site_section": "http://www.emporiagazette.com//search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&nsa=eedition&c[]=sports,sports/*&f=rss", "section_title": "Emporia Gazette - sports,sports/", "url": "http://www.emporiagazette.com/sports/article_2d6733a2-d427-58be-b5d4-4d1b5ab4a2e2.html", "country": "US", "title": "Bruch leads Spartans in home dual", "performance_score": 0, "site": "emporiagazette.com", "participants_count": 1, "title_full": "Bruch leads Spartans in home dual", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T17:15:00.000+03:00", "replies_count": 0, "uuid": "f2c24a51304a0b4989f1daec30aede50bb442044"}, "author": "Stephen Coleman stephen@emporia.com", "url": "http://www.emporiagazette.com/sports/article_2d6733a2-d427-58be-b5d4-4d1b5ab4a2e2.html", "ord_in_thread": 0, "title": "Bruch leads Spartans in home dual", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Stephen Coleman Darian Bruch \nDarian Bruch leaps as part of her floor routine at the Spartans home gymnastics meet on Monday. Stephen Coleman \nOdalis Hernandez works the bars during the Spartans' home gymnastics meet Monday. Posted: Tuesday, October 20, 2015 9:15 am | Updated: 9:19 am, Tue Oct 20, 2015. Bruch leads Spartans in home dual By Stephen Coleman stephen@emporia.com emporiagazette.com | 0 comments \nSenior Darian Bruch enjoys Christmas music, so much so that her gymnastics floor routine is set to a montage of Christmas tunes, opening with a strain from the Nutcracker Suite. \nSo she easily felt festive after placing first Monday night at the Spartans’ sole home gymnastics meet of the year. \n“I like the song,” she said. “I think it’s different, I think it’s eye-catching, and I think it’s very dynamic. The floor routine isn’t that bad, it’s probably my easiest routine I’ve had throughout the years. Now I’m just working on getting the technique perfect and (making it) as best as it can be.” \nHer score of 9.425 was tops among competitors, with Newton’s Kaylee Anderson finishing second with a 9.275. \nBruch also placed fifth on the beam with an even 8 for a score, helping her to sixth place overall, the Spartans’ all around scoring leader. \n“She has spent four years fine-tuning that floor routine and making it the best so she can win state this year,” said coach Angela Podrebarac. “So we’re really crossing our fingers on that.” \nHaylee Weiss had the next best outing for the Spartans. She placed fourth in the vault and seventh on the beam for an overall total of 30.125. Alyssa Cox also added a top-six finish, scoring an 8.45 in the vault and finishing with a 27.275 total score. \nOdalis Hernandez recorded a 5.80 on the bars and an 8.150 on her floor routine. Reagan Nelson also took place in two events, receiving a 6.675 on the beam and an 8.275 on the floor. Devan Crow totalled 20.400 in three events, with the vault, bar and beam, while Hannah Tovar recorded an 8.30 in the vault. \n“Devan Crow has done phenomenal this year,” Podrebarac said. “She came in as a sophomore, not having the experience as a freshman and has just really grown a lot in the last two months.” \nNewton finished with 106 points while Emporia High recorded a team score of 91.85. \nThe 2015 State meet will begin Saturday morning in Newton.", "external_links": [], "published": "2015-10-20T17:15:00.000+03:00", "crawled": "2015-10-21T07:50:27.558+03:00", "highlightTitle": ""}