{"organizations": [], "uuid": "6e54cef56c521dbc485c7205d8c17bc8fc875d86", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/2/9/161234/World/International/Afghan-government,-rights-groups-accuse-Taliban-of.aspx", "country": "EG", "title": "Afghan government, rights groups accuse Taliban of abuses in Kunduz battle - International - World", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Afghan government, rights groups accuse Taliban of abuses in Kunduz battle - International - World - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "6e54cef56c521dbc485c7205d8c17bc8fc875d86"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/2/9/161234/World/International/Afghan-government,-rights-groups-accuse-Taliban-of.aspx", "ord_in_thread": 0, "title": "Afghan government, rights groups accuse Taliban of abuses in Kunduz battle - International - World", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Taliban targeted activists, media in northern Afghan city Taliban withdraw from northern Afghan city Taliban fighters launch hit-and-run attacks in Afghanistan's Kunduz US conducts Kunduz air strike after Taliban assault: NATO The Afghan government on Sunday accused the Taliban of carrying out human rights abuses during two weeks of fighting for control of the northern city of Kunduz this month, even though insurgents say they sought to protect civilians.\nThough the Taliban only controlled the city for three days, fighting between the militants and Afghan security forces continued for two weeks, driving tens of thousands of residents to seek safety in neighbouring provinces.\nAt least 50 civilians were killed and more than 350 wounded, according to hospital records compiled by the Afghanistan Independent Human Rights Commission (AIHRC), though it says the death toll is likely to be much higher.\nSome 100,000 residents fled the clashes, according to UN estimates.\n\"Our people recounted examples of the atrocities committed by (the Taliban),\" said Afghanistan's Chief Executive Abdullah Abdullah at a press conference in the capital Kabul on Sunday. \"It shows no change in the behaviour and politics of this criminal group.\"\nAIHRC is calling for the government to investigate what it called \"widespread and grave human rights violations\" by militants during the battle for Kunduz.\nCivilians were dragged out of their homes and killed in the street, used as human shields, and taken hostage by the insurgents, said a report released by the commission on Thursday.\nThe report also said evidence suggested women had been sexually assaulted by anti-government armed fighters during the offensive, echoing earlier reports by rights group Amnesty International that female health workers and prisoners had been raped during the siege.\nA Taliban spokesman rejected the commission's allegations.\n\"Eliminating enemy personnel and structures is part of war, however utmost care was taken in dealing with civilians and unwarranted trouble given to no one,\" Taliban spokesman Zabihullah Mujahid said in a statement on Friday.\nIn addition, at least 22 patients and staff were killed in a US air strike of a hospital run by Medecins Sans Frontieres on October 3.\nTaliban fighters said they went into Kunduz under orders from their leader Mullah Akhtar Mohammad Mansour to win \"hearts and minds.\"\nBut many Kunduz residents who fled the fighting offered a very different version of events.\nAt a hotel in Kabul last week, where dozens of women and their children were staying after escaping Kunduz city without their husbands, several women said they had heard rumors that armed fighters were sexually assaulting women in the city.\n\"This was one of the main reasons I wanted to get my daughters out,\" said Nadra Nahrinwal, who fled to Kabul in a car with her five daughters and son.\n\"The north is gone,\" she said. \"It will never be safe again.\"", "external_links": [], "published": "2015-10-18T03:00:00.000+03:00", "crawled": "2015-10-19T08:03:57.297+03:00", "highlightTitle": ""}