{"organizations": [], "uuid": "6e282a23021543e876d91f87556d399f350779ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kcchronicle.com", "main_image": "", "site_section": "http://www.kcchronicle.com/?rss=sports/preps", "section_title": "Prep Sports", "url": "http://www.kcchronicle.com/2015/10/08/comfort-zones-change-hands-at-sectionals/a8bl1eu/", "country": "US", "title": "Comfort zones change hands at sectionals", "performance_score": 0, "site": "kcchronicle.com", "participants_count": 0, "title_full": "Comfort zones change hands at sectionals", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T06:39:00.000+03:00", "replies_count": 0, "uuid": "6e282a23021543e876d91f87556d399f350779ae"}, "author": "", "url": "http://www.kcchronicle.com/2015/10/08/comfort-zones-change-hands-at-sectionals/a8bl1eu/", "ord_in_thread": 0, "title": "Comfort zones change hands at sectionals", "locations": ["Lemont", "Cog Hill", "St. Charles East"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["KEVIN DRULEY", "Paige", "Nicole Jordan", "Sandy Bressner"], "text": "Comfort zones change hands at sectionals Published: Thursday, Oct. 8, 2015 10:39 p.m. CDT • Updated: Thursday, Oct. 8, 2015 10:49 p.m. CDT Caption (Sandy Bressner - sbressner@shawmedia.com) St. Charles East sophomore girls golfer Nicole Jordan is hoping to advance from Monday's Class AA sectional at Cog Hill No. 1 in Lemont to next weekend's state tournament. Her older sister, Paige, punched a state ticket from the same course in 2011. By KEVIN DRULEY kdruley @shawmedia.com \nChivalry still reigns in IHSA boys and girls golf circles, as the transition from this week’s regionals to Monday’s sectionals proves. \nAs if taking a step back and uttering, “Ladies first,” boys golfers from Geneva, St. Charles East and St. Charles North played a relatively unfamiliar regional course, The Highlands of Elgin, in a bid to advance to the well-known layout of St. Andrews in West Chicago for 3A sectionals. \nConversely, girls from each of the Tri-Cities schools and Burlington Central traveled to regionals at Sycamore Golf Club for the second successive fall. Those who advanced are headed for a course many have not seen since their youth, if at all – Cog Hill No. 1 in Lemont, site of the AA Oak Park-River Forest Sectional. \n“A lot of people are saying that it’s really hard,” Batavia sophomore Madi McCoy said. “I think I’ll go out this weekend and play it a couple times.” \nNorth junior Kate Lillie, the regional medalist with a 71, offers reassurance based on her experiences from summer tournaments of a few years ago. \n“It’s not the most difficult course in the world,” she said, “so it should be pretty good.” \nThen there’s East junior Kacie Gaffney, whose Cog Hill reconnaissance lies somewhere in between. She experienced some of the course, but not all, while competing in a Drive, Chip & Putt subregional in August 2014. \n“Just revisiting old memories,” Gaffney grinned. \nThe boys field has plenty of those when it comes to St. Andrews. East officially will host the sectional, but it was Geneva’s turn to entertain when the Upstate Eight Conference River Division tournament descended on the course on Sept. 30. \nRecently promoted from the junior varsity then, Saints sophomore Mason Meadows contributed East’s third-best score at conference, a 79. \n“It proves that I’m able to play at that level, that I should be up here on varsity,” Meadows said. \nEast scored a 310 to Geneva’s 313 that day to clip the Vikings, who won the teams’ dual meet, and vaulted atop the conference standings. \nAt regionals, however, the Vikings returned the favor, turning in a season-low 292 that topped the runner-up Saints by 17 strokes. \n“We’re starting to peak at the right time just getting down the stretch, and our scores are getting better and better,” said Geneva freshman Jack McDonald, who shot an even-par 72 at The Highlands and defeated East’s Daniel Haugen in a medalist playoff. “Hopefully, on Monday we can go just as low.” \nTees and teeth: North senior Trevor Kurtzhals balances birdies and blades around this time each year. \nOne of five North boys individuals to advance to sectionals, Kurtzhals scored for the Fox Valley Hawks boys hockey team – comprising players from each of the Tri-Cities schools and Kaneland – in Sunday’s season-opening romp against Kankakee. \nAlso a boys tennis athlete in the spring, Kurtzhals finds a common bond between golf and hockey, just as many professional pucksters do. \n“They kind of overlap as far as swing-wise,” Kurtzhals said. “I still have enough time to do both. I’m focused on golf right now, and I’ll focus on hockey when hockey season comes.” \nChip-ins: Jack-of-all-coaching-trades Doug Ross, guiding the Geneva girls for the second season in his fifth sport at the school, has made strides in tandem with his sectional-bound team. \n“With Ross, he really likes to win,” senior Reilly Krohe said. \nRoss beamed when Geneva exorcised some regional demons by taking third and advancing to sectionals as a team. In 2014, the Vikings missed that cutoff by one stroke, and this season has featured more of an aggressive atmosphere at practices. \n“I know that everybody wants their scorecard to count, and I never once ever feel with this group that there’s just a couple of them out there,” Ross said. “They’re not thinking about, ‘Oh, well, if I don’t do well, so what?’ They all want their scorecard to count. They all are competitive, and they all want to do the best they can. \n“That’s the greatest part of it, just knowing how competitive they are.” \n• McDonald attended Geneva Middle School North. Teammate and classmate Tyler Isenhart, the UEC River Player of the Year, went to Geneva Middle School South. \n“We sort of knew each other,” McDonald said. “We didn’t play (together) too much until this year, and now we’re good friends and play a lot. It’s been fun.”", "external_links": [], "published": "2015-10-09T06:39:00.000+03:00", "crawled": "2015-10-09T17:51:13.689+03:00", "highlightTitle": ""}