{"organizations": ["Rosberg Hamilton"], "uuid": "49d848947c77c683b61c44a604b3950a204f423f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.sky.com", "main_image": "http://media.skynews.com/media/images/generated/2015/10/13/423762/default/v1/gettyimages-490067620-1-1600x900.jpg", "site_section": "http://feeds.skynews.com/feeds/rss/sports.xml", "section_title": "Sports News - Latest Sports and Football News | Sky News", "url": "http://news.sky.com/story/1568601", "country": "IL", "title": "Hamilton Buries The Hatchet With Rosberg", "performance_score": 0, "site": "sky.com", "participants_count": 0, "title_full": "Hamilton Buries The Hatchet With Rosberg", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T10:32:00.000+03:00", "replies_count": 0, "uuid": "49d848947c77c683b61c44a604b3950a204f423f"}, "author": "", "url": "http://news.sky.com/story/1568601", "ord_in_thread": 0, "title": "Hamilton Buries The Hatchet With Rosberg", "locations": ["UK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hamilton", "Nico Rosberg", "Lewis Hamilton", "Rosberg"], "text": "Hamilton Buries The Hatchet With Rosberg 08:32, UK, Tuesday 13 October 2015 Share by email Lewis Hamilton has reconciled with teammate Nico Rosberg, with the Mercedes drivers paying tribute to each other at the team's world championship party. \nFriends turned foes last year when their relationship nearly crumbled under the weight of their exclusive battle for the world championship. \nBut the tension between the Silver Arrows stablemates has been removed by Hamilton's runaway pursuit of this year's title, with the champion-elect even being moved to sympathise with Rosberg's plight after two race retirements in the last four races. \nAddressing the Mercedes staff at a get-together party to celebrate the team retaining their Constructors' Championship crown, Hamilton hailed Rosberg as the \"perfect teammate\" and voiced his admiration for the German's dignified conduct in adversity. \n\"I have known Nico since l was four years old and we have been through ups and downs, but overall he has been a great teammate,\" Hamilton told Sky Sports News. \n\"The way he handles himself and behaves as a team member is great. [Sunday] was a tough day, and he has had some difficult days and l know what that is like, so l just wanted to make sure that he knew that as a team we still appreciate him.\" \nEasier said as the victor, of course, but it was Rosberg himself who made the first move towards reconciliation last year, seeking out Hamilton with a congratulatory handshake immediately after his rival's title success in Abu Dhabi. \nRosberg looked bleary-eyed after an overnight flight from Sochi as he joined in the celebrations - the adrenaline-filled euphoria of victory, in contrast, saw Hamilton take an early-morning run - but it was another measure of the German's dignified sportsmanship that he was able to muster the strength of character to applaud his teammate as the Englishman closes in on a third title. \n\"He has done a great season and been even more consistent than last year, so it has been a very tough battle,\" Rosberg conceded to Sky Sports. \"But it is not over yet and l will try to beat him in some of the remaining races.\" \nVictory was nearly in Rosberg's grasp at Sochi on Sunday before a throttle failure saw him surrender the lead of the race to Hamilton. After returning to the Mercedes garage, Rosberg then had to watch his teammate move 66 points clear of the summit with Ferrari's Sebastian Vettel now second in the standings. \nLittle wonder that with so little time for the scars of defeat to heal, Rosberg admitted he attended Monday's party with mixed emotions - at least until it begun. \n\"It was tough for me yesterday and it was tough for me coming here because l wasn't really in a celebration mood but then seeing how happy all my colleagues are makes me happy too,\" he said. \"It is great to see and makes me aware of what we have achieved together.\" \nRosberg retired from Sunday's grand prix having secured pole position by three tenths of a second from Hamilton before rebuffing his teammate's keen advances off the line, making the failure of his W06 car after just 10 laps all the more difficult to swallow. Promoted Stories", "external_links": [], "published": "2015-10-13T10:32:00.000+03:00", "crawled": "2015-10-14T02:21:44.737+03:00", "highlightTitle": ""}