{"organizations": [], "uuid": "5cf132b062ca83e37c32a7080310a7b9bf27b5a1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.13abc.com", "main_image": "http://media.graytvinc.com/images/Chelsea+Bruck+16x9.jpg", "site_section": "http://www.13abc.com/", "section_title": "Toledo, Ohio | News, Weather, &amp; Sports | 13abc", "url": "http://www.13abc.com/home/headlines/335752571.html", "country": "US", "title": "Cheslea Bruck: murder mystery", "performance_score": 0, "site": "13abc.com", "participants_count": 1, "title_full": "Cheslea Bruck: murder mystery", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "5cf132b062ca83e37c32a7080310a7b9bf27b5a1"}, "author": "13abc", "url": "http://www.13abc.com/home/headlines/335752571.html", "ord_in_thread": 0, "title": "Cheslea Bruck: murder mystery", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MAYBEE, MI (13abc Action News) - It has been one year since Chelsea Bruck was last seen alive. After an agonizing search that lasted for months, her body was discovered.\nChelsea was 22 years old when she vanished. What happened to Matt and Leannda Burck’s youngest daughter is a mystery that haunts them to this day.\n“This has been the most difficult year of our lives,” said Leannda Bruck, in her first sit-down interview since her daughter's body was found in April.\nOn October 25, 2014, Bruck was headed to a Halloween party on Post Road in Frenchtown Township. The party was heavily advertised on social media, with more than 700 people attending.\nBruck was dressed as the villain “Poison Ivy” from Batman. Once there, witnesses say her ride to the party left, with Bruck's cell phone and purse in the car.\nBruck never returned home.\n“We thought she was going with friends and co-workers. We had no idea this party even existed,” said Leannda. “If we did, we would have done everything to discourage her from going.”\nThe events that followed turned into a nightmare for the Bruck family. Days turned into weeks and still no sign of their daughter.\nThe family set up a search party headquarters at an old Monroe Bank and Trust building in Newport. Hundreds of community members joined in the search.\nNearly one million missing person posters were mailed across the country, and hundreds of purple ribbons, Bruck's favorite color, hung throughout her hometown.\nSix months after she was last seen there was a break in the case. On April 5th, someone found pieces of her costume in an abandoned industrial site in Flat Rock.\nWeeks later, the next discovery was the one the Bruck's feared: human remains. They were found at a construction site in a wooded area near railroad tracks about 10 miles from where she was last seen alive.\nWhile the missing person posters have since been taken down, the search for her killer continues.\nThe Monroe County Sheriff's Office released a sketch of the man they say was last seen with Bruck. Investigators have yet to identify him.\n\"He may have some information for us. It doesn't mean he was the killer, but we would like to speak with him,\" said Brian Sroka, the lead detective in the case.\nDetectives say they have interviewed nearly 200 people and received more than 900 tips, but most people at the Halloween party were in costumes, making identification and investigating difficult.\nFind out where the investigation is one year later, and hear from Leannda and Matt Bruck, as they share their emotional story with 13abc's McKenzie Kuehnlein on Action News at 6:00 p.m. Monday.", "external_links": ["http://media.graytvinc.com/images/Chelsea+Bruck+16x9.jpg", "http://media.graytvinc.com/images/353*198/Chelsea+Bruck+16x9.jpg"], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-23T18:04:08.129+03:00", "highlightTitle": ""}