{"organizations": [], "uuid": "15e6567abfc5f40515dc2c96059fd625748ab94e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cincinnati.com", "main_image": "http://www.gannett-cdn.com/-mm-/a6cb4f7d87fb949032d6156fb03192c3faf706ac/c=0-43-3291-1903&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/14/USATODAY/USATODAY/635804386254785220-SWS20-MOORE-BROWN-1005-62626374.JPG", "site_section": "http://www.cincinnati.com/sports/", "section_title": "Cincinnati Sports", "url": "http://www.cincinnati.com/story/sports/ncaab/2015/10/14/smu-basketball-players-ncaa-sanctions-larry-brown-nic-moore/73946238/", "country": "US", "title": "SMU players issue statement criticizing NCAA for 'unfair' penalties", "performance_score": 0, "site": "cincinnati.com", "participants_count": 1, "title_full": "SMU players issue statement criticizing NCAA for 'unfair' penalties", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T01:09:00.000+03:00", "replies_count": 0, "uuid": "15e6567abfc5f40515dc2c96059fd625748ab94e"}, "author": "USA TODAY Sports", "url": "http://www.cincinnati.com/story/sports/ncaab/2015/10/14/smu-basketball-players-ncaa-sanctions-larry-brown-nic-moore/73946238/", "ord_in_thread": 0, "title": "SMU players issue statement criticizing NCAA for 'unfair' penalties", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Southern Methodist Mustangs head coach Larry Brown and guard Nic Moore (11) look on from the sidelines during the second half against the against the Louisville Cardinals at Moody Coliseum. (Photo: Jim Cowsert, USA TODAY Sports)\nCONNECT 1 TWEET LINKEDIN COMMENT EMAIL MORE The NCAA punished the Southern Methodist men's basketball program last month for rules violations uncovered from an investigation, most notably banning the 2015-16 roster from competing in the 2016 NCAA tournament.\nIt was a severe emotional blow for a team that had preseason top 25 consideration.\nOn Wednesday, the players took to CBS Sports for a joint statement to express their sincere disagreement and disenchantment with the NCAA for the severity of the punishment.\nIn the statement, the players also showed support for coach Larry Brown, now dealing with a third NCAA punishment for actions under his watch , and called him a \"father figure.\"\nUSA TODAY\nSMU won't appeal Larry Brown suspension, postseason ban\nThe statement, in full:\nWe, the student-athlete members of the SMU Basketball family, wish to express our profound disappointment and vehement disagreement with the sanctions levied upon us as student-athletes, and with the conclusions drawn by the NCAA Committee on Infractions about our men's basketball program and our coach, Larry Brown. We believe the NCAA exercised questionable judgment in punishing innocent people, and we strongly disagree that a dedicated group of blameless, amateur athletes should bear the overwhelming weight of the consequences in this case. We also wish to make known that the NCAA's conclusion that the SMU Men's Basketball program is not compliant with NCAA rules is simply incorrect.\nWe are dedicated students and athletes, and we believe in rules, honor and fair play. Each and every one of us understands the seriousness of the underlying violation of NCAA rules, and we understand the role of the NCAA in fairly enforcing the rules and adjudicating infractions cases. We also believe in proportionality and due process. As student-athletes directly impacted by these sanctions, we believe the sanctions are disproportionate to the infraction and unfairly punish us for things we had nothing to do with and over which we had no control.\nThe NCAA has imposed an immediate postseason ban that unfairly punishes our entire team. This punishment is especially unfair to our seniors, who will lose an opportunity of a lifetime despite doing nothing wrong. None of our players, especially our seniors, had any role in this case nor could possibly have known about any rules infraction. And not one member of our team was born when SMU Football was before the NCAA in the 1980s.\nThe suggestion or conclusion that SMU Basketball does not recognize the importance of NCAA rules and compliance with those rules cannot be farther from the truth. Every single day Coach Brown and our compliance staff remind and educate us about specific rules and the general principles of fair competition, honesty, and decency.\nCoach Brown is not only a great basketball coach, he is a life-skills teacher, a constantly available adviser, and a father figure to all of his players. We are a family, and we support Coach Brown completely, and appreciate his unyielding support of us.\nWe, the student-athletes, had no voice in this case, and believe we were denied our due process. We ask that the NCAA reconsider the sanctions that unfairly target and disproportionately affect the innocent, and allow SMU Men's Basketball to compete for a berth in postseason play. That sanctions disproportionately affecting the student-athlete have been levied in the past is no reason to continue such an unfair practice in this case, or in future cases.\nIn the meantime, we will assess our options while continuing to work harder each day to make SMU students, faculty and fans proud of us and our basketball program. We are proud to play for them as they make Moody Coliseum the best arena in college basketball.\nCONNECT 1 TWEET LINKEDIN COMMENT EMAIL MORE //usat.ly/1Luo9HA", "external_links": ["http://www.gannett-cdn.com/media/2015/10/14/USATODAY/USATODAY/635804386254785220-SWS20-MOORE-BROWN-1005-62626374.JPG", "http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/2c9237c4188c2fc9c3c50850f21d34692278111a/c=0-290-2654-1789&r=x633&c=1200x630/local/-/media/2015/09/29/USATODAY/USATODAY/635791216863776224-USP-NCAA-Basketball-NCAA-Tournament-Southern-Meth.jpg", "http://www.linkedin.com/shareArticle?url=http%3A//usat.ly/1Luo9HA&mini=true", "http://www.gannett-cdn.com/-mm-/1f602284233b97c28e15b66bbefaf727473a16eb/r=500x349/local/-/media/2015/10/14/USATODAY/USATODAY/635804386254785220-SWS20-MOORE-BROWN-1005-62626374.JPG", "http://usat.ly/1Luo9HA", "https://twitter.com/intent/tweet?url=http%3A//usat.ly/1Luo9HA&text=SMU%20players%20issue%20statement%20criticizing%20NCAA%20for%20%27unfair%27%20penalties&via=enquirer", "http://www.cbssports.com/collegebasketball/eye-on-college-basketball/25339242/smu-players-issue-statement-claim-ncaa-has-punished-them-unfairly", "http://www.usatoday.com/story/sports/ncaab/2015/10/09/smu-wont-appeal-larry-brown-suspension-postseason-ban/73675860/", "http://www.gannett-cdn.com/-mm-/f1f2a0a55a5a40c8bb55901c9daeab2380fe74de/c=865-0-2593-2304&r=537&c=0-0-534-712/local/-/media/2015/10/14/USATODAY/USATODAY/635804386254785220-SWS20-MOORE-BROWN-1005-62626374.JPG"], "published": "2015-10-15T01:09:00.000+03:00", "crawled": "2015-10-15T00:48:13.806+03:00", "highlightTitle": ""}