{"organizations": [], "uuid": "290b7befc527a3bbe9209891597c34af426b0e5b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fox8live.com", "main_image": "http://APMOBILE.images.worldnow.com/images/9072477_G.jpg", "site_section": "http://www.fox8live.com/", "section_title": "New Orleans News, Weather, Saints - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "url": "http://www.fox8live.com/story/30322479/suspect-in-nyc-officers-fatal-shooting-a-longtime-criminal", "country": "US", "title": "Suspect in NYC officer's fatal shooting a longtime criminal", "performance_score": 0, "site": "fox8live.com", "participants_count": 1, "title_full": "Suspect in NYC officer's fatal shooting a longtime criminal - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T11:04:00.000+03:00", "replies_count": 0, "uuid": "290b7befc527a3bbe9209891597c34af426b0e5b"}, "author": "cbs8", "url": "http://www.fox8live.com/story/30322479/suspect-in-nyc-officers-fatal-shooting-a-longtime-criminal", "ord_in_thread": 0, "title": "Suspect in NYC officer's fatal shooting a longtime criminal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By JAKE PEARSON and TOM HAYS\nAssociated Press NEW YORK (AP) - A man suspected of gunning down a police officer had been let out of jail and allowed to enter a drug treatment program despite an extensive arrest record that included felony convictions, leading to questions about why he was chosen for the program in the first place.\nTyrone Howard, who is accused of stealing a bike and fatally shooting Officer Randolph Holder in the head after a chase Tuesday night, was arraigned late Wednesday in Manhattan Criminal Court. He did not enter a plea on first-degree murder and robbery charges and was ordered held without bail. A grand jury will hear the case this week. His attorney, Brian Kennedy, did not ask for bail and said he wasn't sure yet if his client would testify before the grand jury.\nPolice Commissioner William Bratton described Howard, 30, as a dangerous career criminal who never should have been on the streets, calling him a \"poster boy for not being diverted\" to a treatment-oriented drug court instead of to prison.\nMayor Bill de Blasio said Howard was among the thousands of people responsible for a disproportionate amount of violence citywide. He echoed the police commissioner's insistence that Howard should have been locked away, saying \"someone like this shouldn't have been on the streets.\"\nBut the judge who referred Howard to the diversion program said he had no reason to believe Howard was violent.\n\"Why is this guy at least a candidate (for diversion)? Because nothing else has worked,\" state Supreme Court Justice Edward McLaughlin said.\nHoward, who has four felony drug convictions and did stints in state prison, was arrested in October 2014 along with 18 other people and charged with selling crack cocaine to an undercover officer at a public housing complex. Manhattan District Attorney Cyrus R. Vance Jr.'s office recommended Howard serve seven years.\nBut McLaughlin was persuaded to refer the case to a team dedicated to screening candidates for drug treatment, a decision another judge approved, since Howard had no convictions for violent offenses and after reading a social worker's report detailing Howard's troubled home life and longtime addiction to PCP.\nHoward then was bailed out of jail in February, pleaded guilty to the drug charge and was making regular court appearances until late August, when he skipped a court date, court system spokesman David Bookstaver said.\nDays later, Howard shot and wounded a gang member, police said. Investigators had made 10 unsuccessful attempts to arrest him at various addresses before Tuesday's shooting.\nPolice said Howard has been arrested 28 times since age 13 and had a history of violence. They said he was arrested in connection with a 2009 shooting that injured an 11-year-old and a 78-year-old.\n\"It's unfortunate that there are people in our city, in our society, that, despite our best efforts ... they're criminals,\" Bratton said. \"And this individual, I think, is one of those.\"\nBut McLaughlin said that he never saw a record indicating a shooting arrest and that a conviction for such a violent offense would have barred Howard from qualifying for the diversion program. A spokesman for prosecutors didn't respond to questions about that arrest.\nA lawyer who represented Howard in the recent drug case, Robert Levy, said his client was trying to get into a residential treatment program before he skipped his court dates.\nAt his arraignment on the murder charge, Howard wore a white jumpsuit and appeared to slouch down during the proceeding. Kennedy, his attorney, said Howard had been suffering from chest pain.\n\"There's a lot of details we don't yet know in this tragic event,\" Kennedy said. \"We don't know Mr. Howard's involvement. We don't know if there was a gun recovered. There's a lot of missing details.\"\nSeveral of the officer's family members also were in the courtroom, sobbing. Some shouted at Howard during the proceeding.\nHolder, a five-year veteran, made 125 arrests in his career and was awarded six departmental citations for his work. The Guyana native, 33, was the son and grandson of police officers and worked in a division that polices public housing developments.\nHolder and his partner had responded to a report of shots fired near a public housing development in East Harlem. When they arrived, a man said his bike had been stolen at gunpoint and the thief fled with a group of people along a footpath near the East River.\nThe officers caught up to a man with a bike on a pedestrian overpass that spans a highway and traded gunfire, police said. After Holder was shot, the gunman ditched the bike and fled, police said. He was caught several blocks away with a gunshot wound to his leg, Bratton said.\nAssociated Press writers Jonathan Lemire, Colleen Long, Jennifer Peltz, Michael Balsamo and Alex Lynch contributed to this report.\nCopyright 2015 The Associated Press. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-22T11:04:00.000+03:00", "crawled": "2015-10-22T18:17:26.101+03:00", "highlightTitle": ""}