{"organizations": [], "uuid": "f7c3c62688e1129cf96eb2901b0ea958fd47154f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.arcamax.com", "main_image": "http://www.arcamax.com/newspics/131/13163/1316313.jpg", "site_section": "http://www.arcamax.com/sports/", "section_title": "Sports | ArcaMax Publishing", "url": "http://www.arcamax.com/sports/hockey/s-1735866?fs", "country": "US", "title": "Sharks blank Ducks, 2-0 | Hockey", "performance_score": 0, "site": "arcamax.com", "participants_count": 1, "title_full": "Sharks blank Ducks, 2-0 | Hockey | ArcaMax Publishing", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "f7c3c62688e1129cf96eb2901b0ea958fd47154f"}, "author": "arcamax.com", "url": "http://www.arcamax.com/sports/hockey/s-1735866?fs", "ord_in_thread": 0, "title": "Sharks blank Ducks, 2-0 | Hockey", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SAN JOSE, Calif. -- Last but not least -- or so they hoped -- the Anaheim Ducks became the final NHL team to make its 2015-16 debut. By the time they faced the Sharks on Saturday at the SAP Center, several teams were playing their third game of the new season and a few others were playing for the second time.\n\"It seems like it's been a long time,\" Coach Bruce Boudreau said of the wait since Wednesday, when the league launched its season.\nIt might have seemed especially lengthy for a team that's beginning to regard time as an enemy.\nThe Ducks finished at or near the top of the Western Conference each of the last three seasons but ended with a Game 7 home playoff loss each time. It doesn't matter that they fell in the first round in 2013, the second round in 2014 and in the third round last spring. The result was the same and so were the feelings of regret over opportunities lost.\n\"I think everybody felt last season -- and we've talked about this for the last couple of years -- it didn't end the way we wanted it to, and the window's starting to close,\" right wing Corey Perry said after Saturday's morning skate. \"We're not getting any younger, and it's one of those things where you've got to go out and you've got to prove yourself all over again. And do all the right things again.\"\nThey did a lot of things right Saturday but lost, 2-0. Both goals were scored by Patrick Marleau, the first on a rebound late in the second period and the second on a wraparound at 15:10 of the third period. San Jose goaltender Martin Jones -- the former Kings backup -- stopped 27 shots for his first shutout for the Sharks (2-0). Ducks goalie Frederik Andersen stopped 42 shots in the loss, including a Joe Thornton breakaway in the third period.\nThe Ducks are not an old team, and their youthful defense is likely to be one of their strongest assets.\nBut time is marching on, and the Ducks must make the most of their current mix of established stars and talented kids before the window closes on this group.\nPerry and center Ryan Getzlaf -- the last holdovers from the Ducks' 2007 Stanley Cup championship team -- turned 30 in May. Ryan Kesler, who made the Ducks deeper and grittier in his first season with them even though he alone couldn't make them triumphant, turned 31 in August. All three have played more than 700 regular-season games plus playoffs and Olympics, so they've got some mileage on them.\n\"They're all still young 30s,\" Boudreau contended. \"I'm sure the window doesn't last forever, but at the same we're not thinking ahead. We have weekly goals. Just win the week and do the right things in the process, and in the end everything just takes care of itself.\"\nMaybe so, but the only reason it has a chance to happen is that General Manager Bob Murray recognized the team's holes and smartly plugged them over the summer.\nTo boost the overall speed he acquired winger Carl Hagelin -- who skated alongside Getzlaf on Saturday -- and went to the free-agent market for Mike Santorelli, who was on the fourth line with Patrick Maroon and another free agent find, veteran center Shawn Horcoff.\nTo add snarl and toughness, Murray got 34-year-old defenseman Kevin Bieksa from Vancouver for a second-round draft pick. That move, particularly, went over big with players.\n\"We've had many battles over the years, and it's going to be exciting having him on our team and not having to play against him,\" Perry said, smiling.\n\"It's like when Kes came here. The same thing. You play against guys and you create battles, and all of a sudden they're on your team and they're battling for you,\" he said.\nThe Ducks on Saturday also had 22-year-old Richard Rakell centering their fourth line and a defense corps with only Bieksa and Clayton Stoner over 30. Starting goaltender Frederik Andersen, 26, was backed up by Anton Khudobin, 29, allowing goalie-of-the-future John Gibson, 22, to play regularly for San Diego of the American Hockey League.\n\"When you're talking about the off-season that we had and the season last year, the way it finished, how far we were able to get, those kinds of things, you definitely get a sense that you have to take advantage of the situation when it's here,\" Getzlaf said.\n\"We're deeper. Look up and down our lineup and at what our third and fourth lines have. We're deeper down the middle again. Our defensemen have gotten better. It was another year of experience for our younger guys. I think overall our team has progressed, and hopefully we learned a lot last year.\"\nOne of those lessons was that the window to win with this group won't stay open indefinitely.\n(c)2015 Los Angeles Times\nVisit the Los Angeles Times at www.latimes.com\nDistributed by Tribune Content Agency, LLC.\nShare Comment", "external_links": ["https://plus.google.com/share?url=http://www.arcamax.com/sports/hockey/s-1735866", "http://www.facebook.com/sharer.php?u=http://www.arcamax.com/sports/hockey/s-1735866&h=Sharks+blank+Ducks%2C+2%2D0", "http://twitter.com/share?url=http://www.arcamax.com/sports/hockey/s-1735866&hashtags=ArcaMax"], "published": "2015-10-11T03:00:00.000+03:00", "crawled": "2015-10-11T14:25:00.546+03:00", "highlightTitle": ""}