{"organizations": [], "uuid": "2a3dc168562571a06020708c37c4facc0aecdd87", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nydailynews.com", "main_image": "http://assets.nydailynews.com/polopoly_fs/1.269882!/img/httpImage/image.jpg_gen/derivatives/landscape_1200/amd-lee-jpg.jpg", "site_section": "http://www.nydailynews.com/news/index.html", "section_title": "Breaking, Local and National News, Sports &amp; Entertainment - NY Daily News", "url": "http://www.nydailynews.com/news/crime/thug-fingered-rapper-slay-article-1.269881", "country": "US", "title": "Thug fingered in rapper slay", "performance_score": 0, "site": "nydailynews.com", "participants_count": 1, "title_full": "Thug fingered in rapper slay - NY Daily News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "2a3dc168562571a06020708c37c4facc0aecdd87"}, "author": "NEW YORK DAILY NEWS", "url": "http://www.nydailynews.com/news/crime/thug-fingered-rapper-slay-article-1.269881", "ord_in_thread": 0, "title": "Thug fingered in rapper slay", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Suspect Lee Woods at Brooklyn Criminal Court. Photo Gallery: See the evidence\nVideo: See surveillance video of suspects\nThe accused getaway driver in the Brooklyn cop shooting has been fingered as the man who killed rising rap star Stack Bundles last month, sources said yesterday.\nInformants told their NYPD contacts that Lee Woods, who was arrested Tuesday in ambush of two officers, shot the 24-year-old rapper in Queens on June 11. The artist's real name was Rayquon Elliott.\n\"Woods is bad, just bad,\" a source said. \"He killed Rayquon for a dumb-a-s robbery.\"\nWoods claimed yesterday he wasn't in the stolen BMW when someone inside shot the two cops early Monday, although his lawyer told a judge otherwise.\n\"I'm telling you, I didn't do anything,\" Woods, 29, told reporters in a phone call from jail. \"I sat in the car and I chilled with them for a while.\n\"Then I said, 'I'm going home.' I got in my car and I left. They got in their car. I don't know what happened after that.\"\nA few hours later, though, his attorney Patrick Megaro said Woods was in the SUV with two ex-con pals when the gunfire erupted. But he said Woods didn't fire any shots.\nBrooklyn Criminal Court Judge Richard Allman ordered Woods held without bail after he was arraigned in a courtroom jammed with cops and a dozen members of the suspect's family.\nAssistant District Attorney Anna-Sigga Nicolazzi said Woods was driving buddies Dexter Bostick and Robert Ellis in the stolen BMW when two cops pulled it over in Crown Heights at 2:30 a.m. Monday.\n\"They were met within seconds by a hail of bullets,\" Nicolazzi said. \"The defendant acted in concert with two individuals responsible for nothing less than the attempted execution of two uniformed police officers.\"\nWoods was charged with two counts of attempted first-degree murder, two counts of aggravated assault on a police officer, weapons possession and other crimes. He could face life in prison if convicted.\nIn his call from jail yesterday, Woods claimed cops wrote out a false confession and beat him. \"They said if I don't sign, they're going to kill me,\" he said. \"They stuck a gun in my mouth.\"\nMegaro said Woods was injured, but didn't allege abuse.\nalisberg@nydailynews.com", "external_links": [], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-16T07:09:16.996+03:00", "highlightTitle": ""}