{"organizations": ["Toronto Blue Jays", "Royals", "Rogers Center"], "uuid": "6ee4c5a91b29522ed54c9fb54e3ae0f475a5acea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "jakartaglobe.beritasatu.com", "main_image": "http://img.thejakartaglobe.com/2015/10/SPO-BBO-BBA-BBN-LEAGUE-CHAMPIONS-272426-01-03-1024x681.jpg", "site_section": "http://jakartaglobe.beritasatu.com/rss/sports/", "section_title": "Sports | Jakarta Globe", "url": "http://jakartaglobe.beritasatu.com/baseballsoftball/blue-jays-stay-alive-dominant-win-royals/", "country": "ID", "title": "Blue Jays Stay Alive With Dominant Win Over Royals", "performance_score": 0, "site": "beritasatu.com", "participants_count": 0, "title_full": "Blue Jays Stay Alive With Dominant Win Over Royals", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T22:40:00.000+03:00", "replies_count": 0, "uuid": "6ee4c5a91b29522ed54c9fb54e3ae0f475a5acea"}, "author": "", "url": "http://jakartaglobe.beritasatu.com/baseballsoftball/blue-jays-stay-alive-dominant-win-royals/", "ord_in_thread": 0, "title": "Blue Jays Stay Alive With Dominant Win Over Royals", "locations": ["Canada", "Toronto"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tulowitzki", "Steve Keating", "Dioner Navarro", "Jose Bautista", "Edwin Encarnacion"], "text": "INDEX Blue Jays Stay Alive With Dominant Win Over Royals i Dioner Navarro #30 of the Toronto Blue Jays celebrates a Troy Tulowitzki #2 double to score three runs with Edwin Encarnacion #10 and Jose Bautista #19 in the sixth inning during game five of the American League Championship Series at Rogers Center on October 21, 2015 in Toronto, Canada. By : Steve Keating | on 9:40 AM October 22, 2015 Category : Sports , Baseball/Softball \nToronto. The Toronto Blue Jays got a pitching masterpiece from Marco Estrada in a one-sided 7-1 win on Wednesday to keep their season alive and put the Kansas City Royals' hopes of securing a World Series berth on hold. \nEstrada allowed three hits and one run in 7-2/3 innings and faced the minimum 18 batters through six innings as Toronto pulled to within 3-2 in the best-of-seven American League Championship Series. \n\"Today he was absolutely dynamite,\" Royals managers Ned Yost said of Estrada. \"He didn't miss spots. His change-up was fantastic, he just didn't give us anything to hit.\" \nChris Colabello gave Toronto the early lead with a second inning solo home run and Troy Tulowitzki broke the game open in the sixth when he lined a three-run double to center to give the Blue Jays a 5-0 lead. \nThe Royals will get another chance to clinch their second consecutive trip to the World Series when the series resumes in Kansas City on Friday. \n\"We knew it was going to be a tough series,\" Yost told reporters. \"After winning the first two games, in reality your goal is to come to Toronto, kind of a foreign environment, and at least win one. \n\"Then you get to go home and win one there and the series is over. Now we're going back to a place where we are completely comfortable. That's why home field advantage was so important to us.\" \nDespite a momentum-building win the Blue Jays still face a daunting challenge. Only 12 of 79 MLB teams to trail a League Championship Series or World Series have rallied back to win the best-of-seven battle. \nThe Royals, however, are aware as any team that anything can happen having twice erased similar deficits themselves. \nIn the 1985 ALCS the roles were reversed with the Royals rallying from 3-1 down to beat Toronto and again versus the St. Louis Cardinals to win that year's World Series. \nIt is not unfamiliar territory for Toronto, who dropped the opening two games of the best-of-five AL Division Series to the Texas Rangers before winning the next three games to advance. \n\"We didn't panic and that's what we do,\" said Toronto manager John Gibbons. \"That's what makes our offense so good. Guys take their walks and it sets up things for other guys.\" \nAfter two slugfests that produced 35 total runs, Game Five was a classic pitchers' duel between Estrada and Royals starter Edinson Volquez. \nFacing a do-or-die situation and their bullpen in tatters, Estrada delivered a performance the Blue Jays desperately needed while Volquez was nearly as effective limiting Toronto's big bats to one run until the sixth. \nVolquez began the inning with a lead off walk to Ben Revere then hit Josh Donaldson with a pitch and walked Jose Bautista to load the bases. \nHe then walked Edwin Encarnacion to bring across a run before Tulowitzki brought the capacity crowd to its feet with a thundering shot to the wall. \nToronto would add another run in the seventh to surge ahead 6-0 before Salvador Perez's two-out solo shot in the eighth would ruin the shutout. \nReuters", "external_links": [], "published": "2015-10-21T22:40:00.000+03:00", "crawled": "2015-10-22T08:49:05.538+03:00", "highlightTitle": ""}