{"organizations": [], "uuid": "6223dcb7bdf124eb565d91834708d2c071166a8b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "", "site_section": "http://bostonherald.com/sports/revolution_soccer", "section_title": "Sports: Revolution &amp; Soccer | Boston Herald", "url": "http://bostonherald.com/sports/revolution_soccer/soccer/2015/10/germany_calls_up_leverkusen_keeper_for_euro_2016_qualifiers", "country": "US", "title": "Germany calls up Leverkusen keeper for Euro 2016 qualifiers", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "Germany calls up Leverkusen keeper for Euro 2016 qualifiers | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "6223dcb7bdf124eb565d91834708d2c071166a8b"}, "author": "Associated Press", "url": "http://bostonherald.com/sports/revolution_soccer/soccer/2015/10/germany_calls_up_leverkusen_keeper_for_euro_2016_qualifiers", "ord_in_thread": 0, "title": "Germany calls up Leverkusen keeper for Euro 2016 qualifiers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BERLIN — Germany coach Joachim Loew gave Bayer Leverkusen goalkeeper Bernd Leno his first call-up Friday for the side's final two European Championship qualifying games.\nLeno was given the nod as Germany's third-choice keeper behind Manuel Neuer and Marc-Andre ter Stegen for the games against Ireland in Dublin on Oct. 8 and Georgia in Leipzig three days later.\nHannover goalkeeper Ron-Robert Zieler missed out. Hannover is bottom of the Bundesliga with 16 goals conceded after seven winless games.\n\"We are keeping an eye on many candidates behind Manuel Neuer. We're in a comfortable position,\" Germany goalkeeping coach Andreas Koepke said.\nGermany, with 19 points in Group D, is assured of at least a playoff place and needs just one more point from the two games to assure automatic qualification for Euro 2016 in France.\n\"We want to bring qualification to an end with seriousness and concentration,\" Loew said. \"Our aim is to win both games against Ireland and Georgia and qualify as group winners.\"\nPoland is second with 17 points, Ireland has 15 and Scotland 11. Georgia and Gibraltar cannot qualify. The top two in each group qualify, as does the best third-placed team from all the groups, while the other eight third-placed finishers enter a playoff.\n\"For us now the only relevant thing is to defend top place in the table and qualify directly for the European Championships,\" Loew said. \"After qualification we'll have a new situation. Then there's a new phase in which we'll definitely experiment again.\"\nDortmund attacking midfielder Marco Reus is back in the squad after recovering from the left ankle injury sustained in the 2-1 win over Scotland in September.\nGermany has nine wins and five draws from 19 games against Ireland, and four wins from four games against Georgia.\n\"Playing Ireland in Dublin is no easy matter,\" Loew said. \"We can expect a brilliant atmosphere; the fans will stand behind the team to the last minute. We need cool heads and patience to get through it. But if we play to our potential and concentrate on our qualities, we'll also create our chances.\"\nLoew said the side wants then to \"celebrate a successful qualification\" against Georgia.\n\"We won't underestimate the Georgians. We're taking them seriously and preparing quite seriously. They've nothing to lose, they'll give it their all against the world champions,\" Loew said.\n___\nGermany squad:\nGoalkeepers: Bernd Leno (Bayer Leverkusen), Manuel Neuer (Bayern Munich), Marc-Andre ter Stegen (Barcelona).\nDefenders: Jerome Boateng (Bayern Munich), Emre Can (Liverpool), Matthias Ginter (Borussia Dortmund), Jonas Hector (Cologne), Mats Hummels (Borussia Dortmund), Shkodran Mustafi (Valencia), Sebastian Rudy (Hoffenheim).\nMidfielders: Karim Bellarabi (Bayer Leverkusen), Ilkay Gundogan (Borussia Dortmund), Christoph Kramer (Bayer Leverkusen), Toni Kroos (Real Madrid), Thomas Mueller (Bayern Munich), Mesut Ozil (Arsenal), Lukas Podolski (Galatasaray), Marco Reus (Borussia Dortmund), Andre Schuerrle (Wolfsburg), Bastian Schweinsteiger (Manchester United).\nForwards: Mario Goetze (Bayern Munich), Max Kruse (Wolfsburg), Kevin Volland (Hoffenheim).", "external_links": [], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-02T16:28:11.601+03:00", "highlightTitle": ""}