{"organizations": [], "uuid": "b9c6af9fdc9e9ff96da4bbd0d4928160db553f34", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/47529300.cms", "site_section": "http://timesofindia.indiatimes.com/sports/articlelist/4720866.cms", "section_title": "Top Stories - Tennis - Sports - The Times of India", "url": "http://timesofindia.indiatimes.com/sports/tennis/top-stories/Spectre-of-Cilic-looms-for-Nishikori-in-Tokyo/articleshow/49271312.cms", "country": "IL", "title": "Spectre of Cilic looms for Nishikori in Tokyo", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "Spectre of Cilic looms for Nishikori in Tokyo - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T22:34:00.000+03:00", "replies_count": 0, "uuid": "b9c6af9fdc9e9ff96da4bbd0d4928160db553f34"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/sports/tennis/top-stories/Spectre-of-Cilic-looms-for-Nishikori-in-Tokyo/articleshow/49271312.cms", "ord_in_thread": 0, "title": "Spectre of Cilic looms for Nishikori in Tokyo", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "TOKYO: Marin Cilic produced a masterclass on Thursday as he overpowered American Steve Johnson 6-3, 6-3 to set up a Japan Open quarter-final against defending champion Kei Nishikori.\nMeanwhile, tennis bad boy Nick Kyrgios brutalised Spain's Roberto Bautista Agut, the muscular Australian taking less than an hour to complete a 6-4, 6-2 second-round victory in Tokyo with some equally strong-arm tactics.\nSixth seed Cilic beat the Japanese superstar in last year's US Open final and the Croatian -- who also reached the semi-finals in New York last month -- showed enough against Johnson to suggest Nishikori will face a severe test on Friday.\nJohnson had no answer to the power and guile of the street-wise Cilic, who clinched the first set with a cleverly disguised chip-and-charge that forced his tormented opponent into a panicked forehand he got horribly wrong.\nAn exquisite lob earned Cilic a break at the start of the second and such was Johnson's frustration he slammed a ball out of the waterside arena to pick up a code violation.\nHis mood darkened as Cilic caught fire, ending with a flurry of passings shots, capped by a thunderous forehand on match point to wrap up victory in just 73 minutes.\n\"It will be very special to play Kei in Tokyo for the first time,\" said Cilic, who is chasing a first title of the year and the 14th of his career.\n\"We played a close match in Washington earlier this year and Kei won that one, so I'm looking forward to tomorrow. I just hope I can play as well as I did today.\"\nKyrgios has been introduced by the local Japanese cable broadcaster showing the Japan Open this week as: \"Genius? Or problem child?\"\nBut despite the controversy that follows the temperamental Aussie around the men's ATP Tour, he behaved impeccably against Bautista Agut, the highlight a between-the-legs half volley to secure a break at the start of the second set.\nKyrgios, fined recently for sexual insult aimed at Stan Wawrinka's girlfriend during a match against the Swiss, closed out the match with a pummelling serve down the middle after just 56 minutes on court.\n\"I guess I've been doing it all of my short career,\" said the Australian of his show-boating style. \"I love entertaining the crowd and I hope to put on a show again tomorrow.\"\nTop seed Wawrinka is not scheduled to face Kyrgios until the final in Tokyo in what would make for a spicy encounter.\nHe and Nishikori both had the day off after booking their places in the quarter-finals on Wednesday. Stay updated on the go with Times of India News App. Click here to download it for your device.", "external_links": ["https://play.google.com/store/apps/details?id=com.toi.reader.activities"], "published": "2015-10-08T22:34:00.000+03:00", "crawled": "2015-10-08T16:51:05.287+03:00", "highlightTitle": ""}