{"organizations": ["Dallas Cowboys", "Giants", "Facebook", "AT&T"], "uuid": "367f951378285e6ac8c8ebdd787c2fa6f8e777d4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.montgomeryadvertiser.com", "main_image": "http://www.gannett-cdn.com/-mm-/616bc3bd043551a8d15661be7a09df5d4ca80ca7/c=0-43-3563-2056&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/21/USATODAY/USATODAY/635810387736851710-SW36-HARDY-1014-2015-76677098.JPG", "site_section": "http://rssfeeds.montgomeryadvertiser.com/montgomery/auburnsports", "section_title": "Montgomery - Auburn Sports", "url": "http://www.montgomeryadvertiser.com/videos/sports/college/auburn/2015/10/16/74039420/", "country": "US", "title": "Greg Hardy on plan for Eli Manning: 'Hit him in the mouth'", "performance_score": 0, "site": "montgomeryadvertiser.com", "participants_count": 0, "title_full": "Greg Hardy on plan for Eli Manning: 'Hit him in the mouth'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T22:46:00.000+03:00", "replies_count": 0, "uuid": "367f951378285e6ac8c8ebdd787c2fa6f8e777d4"}, "author": "", "url": "http://www.montgomeryadvertiser.com/videos/sports/college/auburn/2015/10/16/74039420/", "ord_in_thread": 0, "title": "Greg Hardy on plan for Eli Manning: 'Hit him in the mouth'", "locations": ["USA"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Eli Manning", "Matthew Emmons", "Greg Hardy", "Eric Prisbell"], "text": "Greg Hardy on plan for Eli Manning: 'Hit him in the mouth' Cowboys DE not mincing words on how he wants to stop Giants QB. Post to Facebook Greg Hardy on plan for Eli Manning: 'Hit him in the mouth' Cowboys DE not mincing words on how he wants to stop Giants QB. Check out this story on USATODAY.com: http://usat.ly/1LMauM9 Cancel Send A link has been sent to your friend's email address. Posted! A link has been posted to your Facebook feed. 11 To find out more about Facebook commenting please read the Conversation Guidelines and FAQs Greg Hardy on plan for Eli Manning: 'Hit him in the mouth' Eric Prisbell , USA TODAY Sports 3:46 p.m. EDT October 21, 2015 Dallas Cowboys defensive end Greg Hardy (76) on the bench during the game against the New England Patriots at AT&T Stadium. (Photo: Matthew Emmons, USA TODAY Sports) 160 CONNECT 50 TWEET LINKEDIN 11 COMMENT EMAIL MORE \nIRVING, Texas – Greg Hardy has a simple way to disrupt New York Giants quarterback Eli Manning this Sunday. \n“Hit him in the mouth,” the Dallas Cowboys defensive end said Wednesday. “The best thing for any team is to make the quarterback feel pain. You’ve got to be respectful of the rules of the game, and obviously you don’t want to hurt anybody. But to make him feel you is to bring his eyes down. You don’t want a good quarterback like Eli Manning looking down the field. Ever. Ever, ever, ever.” \nHardy, who served a four-game suspension for a violation of the league’s personal conduct policy, sacked Tom Brady twice and forced the New England Patriots quarterback to fumble in his Week 5 debut with the Cowboys. \nHe expects to continue his individual on-field success Sunday when the Cowboys visit the Giants in a critical NFC East matchup. \n“Sacks are always coming,” Hardy said. \nFollow Eric Prisbell on Twitter @EricPrisbell . VIDEO PLAYLIST: LATEST FROM THE NFL NFL Daily Blitz: Eagles sticking with Bradford | 01:26 The biggest topics of the day in the NFL. USA TODAY Sports 1 of 17 VIDEO PLAYLIST: LATEST FROM THE NFL NFL Power Rankings: 49ers soar going into Week 7 | 02:09 USA Today Sports' Lorenzo Reyes breaks down the NFL Power Rankings, including who's rising and which team is falling entering Week 7. 2 of 17 VIDEO PLAYLIST: LATEST FROM THE NFL NFL Inside Slant: Eagles the NFC East's best? | 01:03 USA TODAY Sports' Tom Pelissero explains why the Philadelphia Eagles are the favorite to win the NFC East. USA TODAY Sports 3 of 17 VIDEO PLAYLIST: LATEST FROM THE NFL NFL Stock Watch: Rising and falling after Week 6 | 01:53 USA TODAY Sports' Lindsay H. Jones discusses who's up and who's down after Week 6. USA TODAY Sports 4 of 17 VIDEO PLAYLIST: LATEST FROM THE NFL NFL Monday Hot Reads: What we learned in Week 6 | 02:16 USA TODAY Sports' Tom Pelissero looks at what we learned in Week 6 of the NFL season. USA TODAY Sports 5 of 17 VIDEO PLAYLIST: LATEST FROM THE NFL NFL Inside Slant: Coaching keeps Patriots dominant | 01:30 USA TODAY Sports' Tom Pelissero explains the key to the Patriots' success. USA TODAY Sports 6 of 17 VIDEO PLAYLIST: LATEST FROM THE NFL NFL Week 6 Bold Predictions: Lions will finally get a win | 01:22 USA TODAY Sports' Tom Pelissero gives some predictions you might not be expecting. 7 of 17 VIDEO PLAYLIST: LATEST FROM THE NFL NFL Week 6 Sunday Statement: What you need to know | 01:52 USA TODAY Sports' NFL reporters offer need-to-know analysis leading up to kickoff of Week 6 in the NFL, plus fantasy advice you can't miss. 8 of 17 VIDEO PLAYLIST: LATEST FROM THE NFL NFL Inside Slant: Saints still alive | 00:59 USA TODAY Sports' Tom Pelissero breaks down New Orleans' big win against Atlanta on Thursday night. USA TODAY Sports 9 of 17 VIDEO PLAYLIST: LATEST FROM THE NFL Previewing the Deflategate rematch | 01:43 A look back at the game that started the Deflategate saga, and why Tom Brady and the Patriots appear to be in control when New England faces Indianapolis on Sunday night. 10 of 17 VIDEO PLAYLIST: LATEST FROM THE NFL NFL Inside Slant: What Solder injury means for Patriots | 00:51 USA TODAY Sports' Tom Pelissero examines how the Patriots will deal with the loss of left tackle Nate Solder. 11 of 17 VIDEO PLAYLIST: LATEST FROM THE NFL Cover Four: NFL games to watch in Week 6 | 01:37 USA TODAY Sports' Lindsay Jones offers up the five games you can't miss in Week 6 of the NFL season. 12 of 17 VIDEO PLAYLIST: LATEST FROM THE NFL NFL Monday Hot Reads: What we learned in Week 5 | 02:27 USA TODAY Sports' Tom Pelissero takes a look at the lessons learned from NFL Week 5. USA TODAY Sports 13 of 17 VIDEO PLAYLIST: LATEST FROM THE NFL NFL Stock Watch: Who's rising, falling entering Week 6? | 02:20 USA TODAY Sports' Lindsay Jones offers perspective on the biggest story lines from Week 5. 14 of 17 VIDEO PLAYLIST: LATEST FROM THE NFL NFL Inside Slant: Bengals among NFL's elite | 01:08 USA TODAY Sports' Tom Pelissero explains why the Cincinnati Bengals are one of the best teams in the NFL. USA TODAY Sports 15 of 17 VIDEO PLAYLIST: LATEST FROM THE NFL NFL Daily Blitz: Rodgers' streak comes to an end | 00:59 USA TODAY Sports brings you the biggest topics of the day in the NFL. USA TODAY Sports 16 of 17 VIDEO PLAYLIST: LATEST FROM THE NFL Week 5 Sunday Statement: Rodgers will test Rams defense | 02:18 USA TODAY Sports' NFL reporters offer need-to-know analysis leading up to kickoff of Week 5 in the NFL, plus fantasy advice you can't miss. 17 of 17 NFL Daily Blitz: Eagles sticking with Bradford NFL Power Rankings: 49ers soar going into Week 7 NFL Inside Slant: Eagles the NFC East's best? NFL Stock Watch: Rising and falling after Week 6 NFL Monday Hot Reads: What we learned in Week 6 NFL Inside Slant: Coaching keeps Patriots dominant NFL Week 6 Bold Predictions: Lions will finally get a win NFL Week 6 Sunday Statement: What you need to know NFL Inside Slant: Saints still alive Previewing the Deflategate rematch NFL Inside Slant: What Solder injury means for Patriots Cover Four: NFL games to watch in Week 6 NFL Monday Hot Reads: What we learned in Week 5 NFL Stock Watch: Who's rising, falling entering Week 6? NFL Inside Slant: Bengals among NFL's elite NFL Daily Blitz: Rodgers' streak comes to an end Week 5 Sunday Statement: Rodgers will test Rams defense 160 CONNECT 50 TWEET LINKEDIN 11 COMMENT EMAIL MORE TOP VIDEOS", "external_links": [], "published": "2015-10-21T22:46:00.000+03:00", "crawled": "2015-10-22T02:43:27.762+03:00", "highlightTitle": ""}