{"organizations": [], "uuid": "1b03410386b3225b86011c42d451172c1f307084", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.abqjournal.com", "main_image": "http://main.abqjournal.netdna-cdn.com/wp-content/uploads/2015/10/life08_jd_18oct_corrales-268x400.jpg", "site_section": "http://www.abqjournal.com/", "section_title": "Albuquerque and New Mexico News, Sports, Business and more | Albuquerque Journal News", "url": "http://www.abqjournal.com/661551/entertainment/corrales-concert-carries-a-split-yin-and-yang-balance.html", "country": "US", "title": "Pianist describes concert as having a ‘yin and yang’ balance", "performance_score": 0, "site": "abqjournal.com", "participants_count": 1, "title_full": "Pianist describes concert as having a ‘yin and yang’ balance | Albuquerque Journal News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T08:02:00.000+03:00", "replies_count": 0, "uuid": "1b03410386b3225b86011c42d451172c1f307084"}, "author": "David Steinberg / For The Journal", "url": "http://www.abqjournal.com/661551/entertainment/corrales-concert-carries-a-split-yin-and-yang-balance.html", "ord_in_thread": 0, "title": "Pianist describes concert as having a ‘yin and yang’ balance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Pianist James D’León will mix dark and light at his upcoming Corrales concert.\nJames D’León’s Music in Corrales concert program is, as he put it, intentionally “yin and yang, half and half.” You can’t have a whole evening that is all light or all dark music, D’León, a pianist, said.\nThe first half of his Saturday, Oct. 24, concert has with some pretty dark stuff. It opens with Cesar Franck’s Prelude, Fugue and Variation.\n“This one was written for organ but transcribed for piano,” D’León said in a phone interview from his home in Prescott, Ariz. “It’s a typical Franck mood – serious, contemplative. He writes with angst in his music.”\nThat is followed by Franz Liszt’s Ballade. In it, the composer is reminiscing on his life, looking back on his youth and looking to the future.\n“He was at a crossroads. From his rock-star life as a pianist he toned it down, became more religious in his outlook. … By the end of his life he was ordained as a priest. He wanted to punch his ticket into heaven,” D’León said. “Some people say (the piece) was a death-bed confession. It’s really powerful.”\nAfter the Liszt comes Stephen Montague’s “Southern Lament,” which is based on the story of folkloric strongman John Henry battling a steam engine for supremacy. The Montague is part of what D’León calls a triptych.\nIf you go\nWHAT: Pianist James D’León\nWHEN: 7:30 p.m. Saturday, Oct. 24\nWHERE: Historic Old San Ysidro Church, Old Church Road, Corrales\nHOW MUCH: $22 in advance at Frame-n-Art, Corrales and at brownpapertickets.com ; $25 at the door if available “After Henry walks into heaven, it goes into Arvo Pärt’s ‘Für Alina.’ … It bridges the gap between Montague and Frederic Rzewski’s ‘The Winnsboro Cotton Mill Blues.’ I use my palms to hit the keys to give the clamor of working in a mill. But it gives the impression of a ghost of a mill past.”\nAfter intermission comes jazz – Bill Evans’ arrangement of Duke Ellinigton’s Reflections in D. The arrangement sounds almost like Claude Debussy, and it’s very relaxing, D’León said. That goes straight into Keith Jarrett’s transcription of the famous Irish folk song “Danny Boy.”\nThe concert closes with Astor Piazzolla’s “Adiós Nonino,” written in memory of the composer’s father.\nWhen the Steinway artist is not at the piano, D’León is conducting. He is the associate conductor of the Prescott Chamber Orchestra and recently, with the Prescott Symphony, he conducted from the piano Beethoven’s Piano Concerto No. 4.", "external_links": ["http://main.abqjournal.netdna-cdn.com/wp-content/uploads/2015/10/life08_jd_18oct_corrales-268x400.jpg"], "published": "2015-10-18T08:02:00.000+03:00", "crawled": "2015-10-18T13:26:23.423+03:00", "highlightTitle": ""}