{"organizations": [], "uuid": "0376ad18fa9ea9c47fd131f5bc9648cab75ea5f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.saudigazette.com.sa", "main_image": "", "site_section": "http://www.saudigazette.com.sa/index.cfm?method=home.cat&categoryid=2015100265281", "section_title": "Sports | Saudi Gazette", "url": "http://www.saudigazette.com.sa/index.cfm?method=home.con&contentid=20151002258383", "country": "US", "title": "Blue Jays clinch division", "performance_score": 0, "site": "saudigazette.com.sa", "participants_count": 1, "title_full": "Blue Jays clinch division | Sports | Saudi Gazette", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "0376ad18fa9ea9c47fd131f5bc9648cab75ea5f0"}, "author": "saudigazette.com.sa", "url": "http://www.saudigazette.com.sa/index.cfm?method=home.con&contentid=20151002258383", "ord_in_thread": 0, "title": "Blue Jays clinch division", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Baltimore Orioles shortstop J.J. Hardy (Top) jumps to avoid Toronto Blue Jays’ Dalton Pompey after forcing him out on a ground ball double play hit by Cliff Pennington in the sixth inning in the second baseball game of their doubleheader in Baltimore Wednesday. — AP\nBALTIMORE — The Baltimore Orioles easily won the second game of their doubleheader with Toronto, but the Blue Jays had already clinched the American League East title with victory in the first Wednesday.\nChris Davis led a four-home run attack with two solo shots, and starter Kevin Gausman shut down Toronto for eight innings as the Orioles scored an 8-1 victory in the late game.\nBut that had come after Toronto locked up its first American League East title in 22 years with a 15-2 victory in the first game.\nStarter Marcus Stroman (4-0) threw eight strong innings in the 15-2 rout of Baltimore in the first game.\nThe second game was scoreless until the Orioles broke it open with a five-run seventh keyed by back-to-back solo homers from designated hitter Davis and third baseman Manny Machado.\nDavis’ first homer was the 200th of his career. He then got his second homer in the eighth, while catcher Matt Wieters added a two-run shot in that inning.\nTwins 7, Indians 1 (1st game)\nJoe Mauer and Byron Buxton homered while Torii Hunter drove in three runs as the Minnesota Twins beat the Cleveland Indians in the first game of a double header. The Twins broke the game open with a four-run fourth inning.\nIndians 10, Twins 2 (2nd game)\nCody Anderson pitched seven scoreless innings on two hits as the Cleveland Indians beat the Minnesota Twins in the second game of a double header. Losing the second game prevented the Twins from taking a big step in the race for the second wild card spot. They began the day one game behind Houston and 1-1/2 games behind the Angels in the race for the second wild card.\nRed Sox 9, Yankees 5 (11 innings)\nThird baseman Deven Marrero drove in the go-ahead run in the 11th inning as the Boston Red Sox prevented the New York Yankees from clinching a post-season spot.\nIn other games it was: A’s 8, Angels 7; Royals 5, White Sox 3 (10 innings); Rangers 6, Tigers 2; Astros 7, Mariners 6\nNational League\nPirates 8, Cardinals 2 (1st game)\nFrancisco Cervelli hit a grand slam while Gerrit Cole pitched seven innings for his 19th win as the Pittsburgh Pirates beat the St. Louis Cardinals in the first game of a double header.\nCardinals 11, Pirates 1 (2nd game)\nThe St. Louis Cardinals clinched their third successive National League Central title with an 11-1 rout of the Pittsburgh Pirates.\nJason Heyward had a grand slam among his three hits and starter Tyler Lyons pitched seven scoreless innings in the second game of the doubleheader.\nBraves 2, Nationals 0\nJordan Zimmermann had a quality start in what was likely his last game for the Washington Nationals, but it was not good enough to get a victory.\nThe Braves defeated the Nationals on a pair of early runs off Zimmerman, who allowed six hits over six innings. The right-hander, who becomes a free agent after the season, walked one and struck out one.\nElsewhere it was: Cubs 10, Reds 3; Phillies 7, Mets 5; Giants 5, Dodgers 0; Diamondbacks 3, Rockies 1; Brewers 5, Padres 0.\nInter-League\nRays 6, Marlins 4\nDesignated hitter Grady Sizemore hit a three-run double in a four-run fifth inning as the Tampa Bay Rays earned a 6-4 win over the Miami Marlins.\nRays starter Drew Smyly struck out eight while holding the Marlins to one run on three hits and three walks. — Agencies", "external_links": [], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-02T12:27:36.474+03:00", "highlightTitle": ""}