{"organizations": [], "uuid": "98cb589cf0556e847ece71bb86ee2691e5b5f02e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.abqjournal.com", "main_image": "http://main.abqjournal.netdna-cdn.com/wp-content/uploads/2015/10/maj-phyllis-pelky-400x296.jpg", "site_section": "http://www.abqjournal.com/", "section_title": "Albuquerque and New Mexico News, Sports, Business and more | Albuquerque Journal News", "url": "http://www.abqjournal.com/659328/news/headline-411.html", "country": "US", "title": "Maj. Pelky of Rio Rancho killed in chopper crash in Afghanistan", "performance_score": 0, "site": "abqjournal.com", "participants_count": 3, "title_full": "Maj. Pelky of Rio Rancho killed in chopper crash in Afghanistan | Albuquerque Journal News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T00:18:00.000+03:00", "replies_count": 2, "uuid": "98cb589cf0556e847ece71bb86ee2691e5b5f02e"}, "author": "Charles D. Brunt / Journal Staff Writer", "url": "http://www.abqjournal.com/659328/news/headline-411.html", "ord_in_thread": 0, "title": "Maj. Pelky of Rio Rancho killed in chopper crash in Afghanistan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Major Phyllis Pelky, 45, of Rio Rancho was one of two U.S. military personnel killed in a helicopter crash in Kabul, Afghanistan, on Sunday. (Courtesy of the U.S. Air Force)\nAir Force Maj. Phyllis Pelky, 45, of Rio Rancho was one of two U.S. military personnel killed Sunday in a helicopter crash in Kabul, Afghanistan, that claimed five lives, the Defense Department confirmed Tuesday.\nPelky, a former humanities teacher at Rio Rancho High School, had been serving as an aide-de-camp to the superintendent of the Air Force Academy in Colorado Springs, Colo., and was assigned to the Academy’s headquarters staff.\nOne former student in Rio Rancho said her “quirky” personality and teaching kept her in school, that “she made going to school enjoyable” and “the message I always got was her love for her country and kids — you could just see it.”\nAlso killed in the crash was Air Force Master Sgt. Gregory Kuhse, 38, of Kalamazoo, Mich. He was assigned to the 3rd Manpower Requirements Squadron at Scott Air Force Base in southern Illinois.\nThree others, including two members of Britain’s Royal Air Force, also died when the British Puma Mk2 helicopter crashed as it attempted to land at Camp Resolute Support near Kabul. Five others aboard the helicopter were injured, according to the Associated Press.\n“We are grieving a deeply felt loss today,” Lt. Gen. Michelle Johnson, Academy superintendent, said in a statement. “Our heartfelt condolences and prayers go out to the family and loved ones of Major Pelky and all those affected by this tragedy.”\nAn Air Force Academy spokesman said the crash, which occurred about 4:15 p.m. local time, was not related to any hostile activity.\nThe Puma is a four-bladed, twin-engine, medium transport/utility helicopter. It typically has a crew of three and can carry up to 16 passengers.\nThe aircraft appeared to strike a tethered monitoring balloon as it attempted to land at the NATO base, according to Najibullah, an Afghan security guard who witnessed the incident. Like many in Afghanistan, he goes by one name.\nThe helicopter “hit the cable of the security balloon over the base, it seemed like the cable was turned around the helicopter rotor,” he said. Najibullah said the helicopter went down and then black smoke rose from the area.\nA second helicopter circled the crash site three or four times and then landed at a nearby airport, he said.\nA statement from the U.S. Department of Defense confirmed the identities of the two American victims.\nIn Tuesday’s statement, the Pentagon said the cause of the crash is under investigation.\nJena Rue, one of Pelky’s former students at Rio Rancho High School, said she was saddened by the news.\nRue said Pelky, once known at the high school as Miss Berlin before she married, was one of the reasons she stayed in school.\n“(Pelky’s) class was the first class they took me to — humanities class,” Rue said, recalling her first day in Rio Rancho Public Schools after arriving as a transfer in the fall of 2002.\n“… I’m a prankster — we pranked each other equally that year and my next two years of high school.\n“In 2005, when I graduated, I gave her my yearbook to sign — she proceeded to sign her last name on every page of my yearbook,” Rue recalled. “She was quirky and crazy. She made going to school enjoyable because I hated it. She made it fun; instead of just using the book, she would engage with us. I didn’t really like humanities, but I liked her class.”\nRue said the two stayed in contact via social media.\n“The message I always got was her love for her country and kids — you could just see it,” Rue said.\nRio Rancho Observer reporter Gary Herron and the AP contributed to this report", "external_links": ["http://main.abqjournal.netdna-cdn.com/wp-content/uploads/2015/10/maj-phyllis-pelky-640x474.jpg"], "published": "2015-10-14T00:18:00.000+03:00", "crawled": "2015-10-14T07:33:52.893+03:00", "highlightTitle": ""}