{"organizations": ["Nats", "WUSA"], "uuid": "a7bdc7c0fb3e330c6fa0a41973175ecb317a1793", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wusa9.com", "main_image": "http://www.gannett-cdn.com/-mm-/489efad1142179deef9ce5ef3cf126cd99e1a3f1/r=x633&amp;c=1200x630/http/cdn.tegna-tv.com/-mm-/e428d8cb69025fd5583ddac691acd868d485f8a1/c=2-0-597-336/local/-/media/2015/09/28/WUSA/WUSA/635790457954152072-CQAi5cfUYAA-vkg.jpg", "site_section": "http://rssfeeds.wusa9.com/_/20/87745956/WUSA-sports", "section_title": "WUSA - Sports", "url": "http://www.wusa9.com/story/sports/mlb/2015/10/05/matt-williams-out-who-next-nats-manager/73379632/", "country": "US", "title": "With Matt Williams out, who will be next Nats manager?", "performance_score": 0, "site": "wusa9.com", "participants_count": 0, "title_full": "With Matt Williams out, who will be next Nats manager?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T19:10:00.000+03:00", "replies_count": 0, "uuid": "a7bdc7c0fb3e330c6fa0a41973175ecb317a1793"}, "author": "", "url": "http://www.wusa9.com/story/sports/mlb/2015/10/05/matt-williams-out-who-next-nats-manager/73379632/", "ord_in_thread": 0, "title": "With Matt Williams out, who will be next Nats manager?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Matt Williams", "Harper", "Papelbon", "Holden Kushner"], "text": "With Matt Williams out, who will be next Nats manager? Now that the Nationals have fired Matt Williams, here is a list of candidates to replace him. Post to Facebook With Matt Williams out, who will be next Nats manager? Now that the Nationals have fired Matt Williams, here is a list of candidates to replace him.  //on.wusa9.com/1RqUboC   Join the Conversation To   With Matt Williams out, who will be next Nats manager? Holden Kushner 12:10 p.m. EDT October 5, 2015 Nationals Manager Matt Williams held a press conference and talked about dugout fight between Papelbon and Harper. (Photo: WUSA) 9 CONNECT 2 TWEET LINKEDIN COMMENT EMAIL MORE \nWASHINGTON (WUSA9) -- Now that the Nationals have fired Matt Williams, General Manager Mike Rizzo must find a manager with experience that can control the locker room as well as command in-game. This hire will determine Rizzo's future as Nationals GM. I'll preface this list by mentioning Rizzo hired Williams to be an extension of him, taking cues on how to manage the club directly from his boss. Minnesota Twins manager Ron Gardenhire (35) in the dugout during the first inning against the Detroit Tigers at Comerica Park. Mandatory Credit: Rick Osentoski-USA TODAY Sports Rick Osentoski-USA TODAY Sports Houston Astros manager Bo Porter (16) watches from the dugout during the fifth inning against the Oakland Athletics at Minute Maid Park. Troy Taormina, Troy Taormina-USA TODAY Sports Washington Nationals bench coach Randy Knorr (53) poses for a picture during photo day at Space Coast Stadium . Mandatory Credit: Tommy Gilligan-USA TODAY Sports Tommy Gilligan-USA TODAY Sports Fullscreen Lou Piniella, former manager of the Seattle Mariners, acknowledges the crowd during ceremonies inducting him into the Seattle Mariners' Hall of Fame prior to the game against the Chicago White Sox at Safeco Field on August 9, 2014 in Seattle, Washington. (Photo by Otto Greule Jr/Getty Images) Otto Greule Jr, Getty Images Like this topic? You may also like these photo galleries: Replay", "external_links": [], "published": "2015-10-05T19:10:00.000+03:00", "crawled": "2015-10-05T19:30:03.721+03:00", "highlightTitle": ""}