{"organizations": ["NCAA", "LSU"], "uuid": "d09f237f86235e0b50ea6f9d97ff58806c2c4524", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.whio.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/10/a9/d1/9f8702d02e5e480083880b72bbb6e4a3-771f411d385643b398f27eab98e96b36-0.jpg", "site_section": "http://www.whio.com/feeds/categories/sports/", "section_title": "News | Sports", "url": "http://www.whio.com/ap/ap/south-carolina/no-7-lsu-too-much-for-displaced-south-carolina-45-/nnzNN/", "country": "US", "title": "No. 7 LSU too much for displaced South Carolina, 45-24", "performance_score": 0, "site": "whio.com", "participants_count": 0, "title_full": "No. 7 LSU too much for displaced South Carolina, 45-24", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T05:12:00.000+03:00", "replies_count": 0, "uuid": "d09f237f86235e0b50ea6f9d97ff58806c2c4524"}, "author": "", "url": "http://www.whio.com/ap/ap/south-carolina/no-7-lsu-too-much-for-displaced-south-carolina-45-/nnzNN/", "ord_in_thread": 0, "title": "No. 7 LSU too much for displaced South Carolina, 45-24", "locations": ["S.C.", "South Carolina", "Columbia", "La.", "Baton Rouge"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Malachi Dupre", "Gerald Dixon Jr.", "Isaiah Johnson", "Bachman", "Brandon Harris"], "text": "Updated: 10:13 p.m. Saturday, Oct. 10, 2015 | Posted: 10:12 p.m. Saturday, Oct. 10, 2015 No. 7 LSU too much for displaced South Carolina, 45-24 Related View Larger South Carolina acknowledge fans as the LSU marching band plays their alma mater after an NCAA college football game in Baton Rouge, La., Saturday, Oct. 10, 2015. LSU won 45-24. The game was moved from Columbia, S.C. to Baton Rouge because of flooding. (AP Photo/Jonathan Bachman) More News Headlines View Larger LSU quarterback Brandon Harris (6) throws the ball past South Carolina defensive tackle Gerald Dixon Jr. (92) during the first half of an NCAA college football game in Baton Rouge, La., Saturday, Oct. 10, 2015. LSU won 45-24. (AP Photo/Jonathan Bachman) View Larger LSU wide receiver Malachi Dupre (15) runs past South Carolina safety Isaiah Johnson (21) after a catch during the second half of an NCAA college football game in Baton Rouge, La., Saturday, Oct. 10, 2015. LSU won 45-24. (AP Photo/Jonathan Bachman) View Larger Fans watch from the stands during the second half of an NCAA college football game between LSU and South Carolina in Baton Rouge, La., Saturday, Oct. 10, 2015. LSU won 45-24. The game was moved from Columbia, S.C. to Baton Rouge because of flooding. (AP Photo/Jonathan Bachman) Sponsored Links The Associated Press BATON ROUGE, La. — \nLeonard Fournette's least productive game this season was still good enough to make LSU history. It was also too much for South Carolina, particularly with the seventh-ranked Tigers improving through the air. \nFournette ran 87 yards for a touchdown, Brandon Harris passed for a career-best 228 yards, and LSU defeated South Carolina 45-24 on Saturday in a game moved to Tiger Stadium because of catastrophic flooding in the Gamecocks' home state. \nFournette finished with a season-low 158 yards on 20 carries in three quarters. The Heisman Trophy candidate is now the fastest to 1,000 yards in a season at LSU, which has played football since 1893. \n\"It doesn't really excite me. I'm just doing my job,\" Fournette said of his latest milestone. \"You expect so much out of yourself, just to make plays for the team. It's never about me. As you've seen with that (touchdown) run, they block for me. My job is to make one or two guys miss and get up the field.\" \nThe purple No. 7 jersey Fournette wore will be used to help at least some Gamecocks fans. He said he'd give up the jersey for auction with all proceeds donated to flood victims if permitted. The NCAA said on its verified Twitter account that Fournette could offer the jersey for charity. \n\"I just wanted to help out the families or people out there, that's all,\" said Fournette, a New Orleans native whose home was destroyed by Hurricane Katrina a decade ago. \nFournette surpassed the 1,000-yard mark with his long touchdown up the middle, during which he burst through the line untouched, cut slightly to his right to make one tackler whiff, then veered back to his left as he outsprinted a pair of defenders. \nIt was his 116th carry this season, early in the third quarter of LSU's fifth game. Previously, LSU's fastest to 1,000 yards rushing was Charles Alexander, who hit the mark on his 175th carry, in the seventh game of 1977. \nIn this game, LSU had two 100-yard rushers. Freshman Derrius Guice had 161 yards and a TD. Fellow running back Darrel Williams scored twice as the Tigers (5-0, 3-0 Southeastern Conference ) piled up 396 yards rushing. \nFor South Carolina coach Steve Spurrier, the punishing styles of LSU's rushers exemplified the differences between the two teams. \n\"I just get frustrated watching our guys,\" Spurrier said. \"Their guys must have broken eight tackles on their big runs. Our guys go in there and just fall on the ground. Nobody tackles them.\" \nTravin Dural had 109 yards receiving for LSU, highlighted by his 62-yard TD on a deflected pass. Malachi Dupre had a 10-yard touchdown catch. \nYet Harris bristled when asked how important it was for LSU, which came in averaging an SEC-worst 95.5 yards passing per game, to improve through the air. \n\"This is the winning formula. We're 5-0 and people are complaining,\" said Harris, who had a career-high 18 completions on 28 attempts. \"We've got four great backs and six great receivers and I'm just trying to do my part.\" \nPerry Orth, starting for injured Lorenzo Nunez (shoulder), passed for 200 yards and two TDs for South Carolina (2-4, 0-4). He was intercepted once. \nSouth Carolina freshman Rashad Fenton returned a kickoff 96 yards for a touchdown. \nPharoh Cooper caught seven passes for 105 yards, highlighted by his 43-yard touchdown. Jerell Adams had a 36-yard touchdown catch for South Carolina, but the Gamecocks managed only 74 yards rushing. \nThe relocated game was like none seen before at LSU; the Gamecocks were technically the home team in Death Valley. \nWith the decision to move the game coming on Wednesday, there were barely three days to sell tickets, and attendance at 102,000-seat Tiger Stadium was 42,058. \nThe LSU band played South Carolina's alma mater before and after the game. And Tigers fans, who normally boo visiting teams as they enter the stadium, applauded the Gamecocks as they took and left the field. \n\"Everyone in this area kind of understands what we're going through,\" Orth said, referring to Katrina's devastation a decade ago. \"It was nice to see the fans cheering us on. At the same time though, it felt like an away game.\" \nSouth Carolina athletic director Ray Tanner said the hospitality offered by LSU and its fans was \"truly moving.\" \nThat ended inside the lines, where LSU dominated time of possession (39:53 to 20:07) and net yards (624-283). \nWith the loss, Spurrier fell to 0-4 in the SEC for the first time in his career, which includes 23 seasons at Florida and South Carolina. \n___ \nAP college football website: collegefootball.ap.org Copyright The Associated Press Sign up for our WHIO-TV Daily Headlines Newsletter Sign Up", "external_links": [], "published": "2015-10-11T05:12:00.000+03:00", "crawled": "2015-10-11T08:11:27.022+03:00", "highlightTitle": ""}