{"organizations": [], "uuid": "63bd3bccfffb7c4f77d9521bb43bc45229b3e658", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.charlotteobserver.com", "main_image": "http://www.newsobserver.com/sports/college/acc/unc/unc-now/2n6f6r/picture41340393/ALTERNATES/LANDSCAPE_1140/UNC-01", "site_section": "http://www.charlotteobserver.com/sports/?widgetName=rssfeed&widgetContentId=8167599&getXmlFeed=true", "section_title": "Sports News, Scores & Photos | CharlotteObserver.com &", "url": "http://www.charlotteobserver.com/sports/article41340402.html", "country": "US", "title": "UNC pulls away for 26-13 victory against Virginia", "performance_score": 0, "site": "charlotteobserver.com", "participants_count": 1, "title_full": "UNC pulls away for 26-13 victory against Virginia", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T01:55:00.000+03:00", "replies_count": 0, "uuid": "63bd3bccfffb7c4f77d9521bb43bc45229b3e658"}, "author": "Andrew Carter \nacarter@newsobserver.com", "url": "http://www.charlotteobserver.com/sports/article41340402.html", "ord_in_thread": 0, "title": "UNC pulls away for 26-13 victory against Virginia", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "October 24, 2015 UNC pulls away for 26-13 victory against Virginia \nUNC has won six consecutive games for first time since 1997, and is off to best overall start since then \nTar Heels force five second-half turnovers and don’t allow a point after halftime for second consecutive game \nGame changed on long, methodical scoring drive that ended with a UNC touchdown early in the fourth quarter North Carolina’s Bug Hpward pulls in a 36-yard pass from quarterback Marquise Williams ahead of Virginia’s Demetrious Nicholson in the second quarter at Kenan Stadium in Chapel Hill. Robert Willett rwillett@newsobserver.com Robert Willett rwillett@newsobserver.com Order Reprint of this Story CHAPEL HILL \nNorth Carolina will enter the most significant portion of its schedule amid its longest winning streak in 18 years after a 26-13 victory against Virginia here on Saturday at Kenan Stadium. \nThe Tar Heels' six-game winning streak is their longest since 1997. Their 6-1 overall start is also their best since 1997, when UNC finished arguably the best season in school history with an 11-1 record. \nUNC, which now has won six consecutive games against Virginia, didn't make it easy on itself on Saturday. The Tar Heels committed 13 penalties, a couple of which wiped away big plays and ended scoring chances in the first half. \nThey pulled away, though, after a long touchdown drive that ended with Elijah Hood’s 3-yard touchdown run early in the fourth quarter. UNC’s defense, meanwhile, forced five turnovers in the second half and didn’t allow a point after halftime for the second consecutive game. \nNow comes the most challenging part of UNC’s schedule. The Tar Heels have a short week to prepare for a Thursday night game at Pittsburgh and then return home to play against Duke on Nov. 7. Those teams are tie with UNC atop the ACC's Coastal Division standings. Turning point \nIt wasn't exactly confined to one play, or one moment, but UNC's methodical 93-yard touchdown drive permanently turned the game in the Tar Heels' favor. Before the drive, the Tar Heels held a tenuous 16-13 lead. \nBut after it ended with Elijah Hood's 3-yard touchdown run early in the fourth quarter, UNC led 23-13 – a significant advantage against a Virginia offense not known for its explosiveness. The drive lasted 13 plays and nearly six minutes, and it was UNC's longest of the season in all aspects. Three who mattered \nMarquise Williams: The UNC quarterback passed for 226 yards, ran for 71 more and completed 21 of his 26 pass attempts. \nElijah Hood: Virginia limited Hood to two runs of more than 10 yards but he still averaged nearly 5 yards per carry, ran for two touchdowns and finished with 101 yards rushing. \nTaquan Mizell: The Cavaliers' 5-10 running back proved elusive as a runner and receiver. He accounted for 174 yards combined, rushing and receiving. Three key numbers \n13 Penalties hadn't been much of an issue for UNC but they were on Saturday. The Tar Heels' 13 penalties were a season-high, and they erased some big plays and negated scoring chances. \n127 Total yards for Virginia in the second half, after generating 226 in the first half. UNC held Virginia to an average of 3.7 yards per play in the second half. \n4 Virginia turnovers in the second half -- two of them on fumbles, two on interceptions, including one in the end zone. Highlight reel \n-Marquise Williams provided the game's longest running play, a 31-yard gain that preceded Logan's 16-yard touchdown run in the first quarter. \n-One of Williams' finest passes of the season came in the second quarter, when he placed perfectly a long pass down the right sideline to Bug Howard, who caught it for a 36-yard gain that set up a first-and-goal. \n-Malik Simmons, the senior UNC cornerback, intercepted two passes in the second half. Those were the first two interceptions of his collegiate career.", "external_links": [], "published": "2015-10-25T01:55:00.000+03:00", "crawled": "2015-10-25T01:27:27.847+02:00", "highlightTitle": ""}