{"organizations": ["Liverpool Klopp", "Liverpool"], "uuid": "9d55ceb5acdc87cbed12c7f3aaa076727312e8d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.sky.com", "main_image": "http://media.skynews.com/media/images/generated/2015/10/8/422894/default/v1/gettyimages-456629144-1-1600x900.jpg", "site_section": "http://feeds.skynews.com/feeds/rss/sports.xml", "section_title": "Sports News - Latest Sports and Football News | Sky News", "url": "http://news.sky.com/story/1565877", "country": "IL", "title": "Klopp Expected To Arrive At Liverpool", "performance_score": 0, "site": "sky.com", "participants_count": 0, "title_full": "Klopp Expected To Arrive At Liverpool", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T11:40:00.000+03:00", "replies_count": 0, "uuid": "9d55ceb5acdc87cbed12c7f3aaa076727312e8d7"}, "author": "", "url": "http://news.sky.com/story/1565877", "ord_in_thread": 0, "title": "Klopp Expected To Arrive At Liverpool", "locations": ["UK", "Merseyside"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jurgen Klopp"], "text": "Klopp Expected To Arrive At Liverpool 09:40, UK, Thursday 08 October 2015 Share by email Jurgen Klopp is expected to travel to Merseyside - and could be named the new Liverpool manager shortly after his arrival. \nKlopp, who led Borussia Dortmand to two German league titles in his seven years at the club, has spoken personally to the club's American owner, Fenway Sports Group, and those talks have now reached an advanced stage. \nLiverpool have acted quickly to replace Brendan Rodgers, who was sacked on Sunday following the 1-1 draw at Everton. \nContact was first made with Klopp on Monday - along with former Real Madrid and Chelsea manager Carlo Ancelotti - and the strategy has been to make a swift appointment. \nAncelotti has since ruled himself out for the job, accelerating the pursuit of Klopp, who Liverpool are confident will be in charge for the Premier League game at Tottenham Hotspur on 17 October. \nIf Klopp does take over at Anfield, he is expected to bring in his former Dortmund assistant, Bosnian Zeljko Buvac. Buvac is known as \"The Brain\" due to his tactical knowledge, and Klopp has described him as a \"master of every form of training\". \nThe pair have known each other since 1992 when they were teammates at Mainz. After their playing career, Klopp appointed Buvac as his assistant when he took over at Mainz in 2001. \nKlopp could also bring another of his former Dortmund coaches with him. Peter Krawietz, who never played professional football, specialises as a video analyst. \nFormer Liverpool midfielder Dietmar Hamann believes Klopp would represent \"a very good appointment\", while another ex-Germany international who played for the Reds, Karl-Heinz Riedle, praised the 48-year-old for his coaching acumen. Promoted Stories", "external_links": [], "published": "2015-10-08T11:40:00.000+03:00", "crawled": "2015-10-08T14:49:56.165+03:00", "highlightTitle": ""}