{"organizations": [], "uuid": "7543f9386d28a4d21c59d649202099d16f3f90ea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "wtop.com", "main_image": "http://wtop.com/wp-content/uploads/2015/10/Serbia-Portugal-Euro-Soccer.jpeg", "site_section": "http://wtop.com/section/sports/feed/", "section_title": "WTOP » Sections » Sports", "url": "http://wtop.com/sports/2015/10/albania-qualifies-for-european-championship-for-1st-time/", "country": "US", "title": "Albania qualifies for European Championship for 1st time", "performance_score": 0, "site": "wtop.com", "participants_count": 1, "title_full": "Albania qualifies for European Championship for 1st time", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T20:55:00.000+03:00", "replies_count": 0, "uuid": "7543f9386d28a4d21c59d649202099d16f3f90ea"}, "author": "wtopstaff", "url": "http://wtop.com/sports/2015/10/albania-qualifies-for-european-championship-for-1st-time/", "ord_in_thread": 0, "title": "Albania qualifies for European Championship for 1st time", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home » News » Sports » Albania qualifies for European… Albania qualifies for European Championship for 1st time By The Associated Press October 11, 2015 2:15 pm Portugal's Nani, right celebrates with teammate Miguel Veloso after scoring the first goal of his team during the Euro 2016 Group I qualifying match between Serbia and Portugal, at the Partizan stadium in Belgrade, Serbia, Sunday, Oct. 11, 2015. (AP Photo/Darko Vojinovic) \nYEREVAN, Armenia (AP) — Albania will play in the European Championship for the first time next year after beating Armenia 3-0 in a qualifier on Sunday. \nThe victory secured Albania second place in Group I, behind Portugal and ahead of Denmark. \nAlbania opened the scoring with an own goal by Armenia defender Kamo Hovhannisyan in the ninth minute. It then added to the lead with a deflection by defender Berat Xhimshiti in the 23rd and a close-range goal by substitute Armando Sadiku in the 76th. \nAlbania players jumped up and down and hugged each other after the final whistle. Captain Lorik Cana was crying as he celebrated with teammates. \nAlbania reached 14 points with the victory, two points more than third-place Denmark, the 1992 European champion which will have to go through the playoffs to try to earn a berth at Euro 2016. \nPortugal, which had already clinched first place in advance, finished with a 2-1 win over nine-man Serbia, reaching 21 points from eight matches. \nThe top two teams in each of the nine qualifying groups advance automatically, along with the best third-placed team. The eight remaining third-placed teams go to a playoff. \nDenmark had a bye this weekend and needed Albania to lose or draw its match against last-place Armenia in Yerevan. \nHovhannisyan found his own net while trying to clear the ball from in front of the goal, and Xhimshiti scored by redirecting the ball into the net after a free kick cross from the left side of the penalty area. Sadiku’s left-footed shot sealed the victory. \nAlbania did not concede a goal in its last four away matches. Armenia closed the qualifiers without a win at home. \nWithout Cristiano Ronaldo, Portugal won its seventh consecutive qualifier thanks to the victory over already eliminated Serbia in Belgrade. Portugal didn’t need to play at full strength after qualifying with the 1-0 win over Denmark last week. \nNani scored in the fifth minute after Serbia goalkeeper Vladimir Sotjkovi failed to hold a shot from Danny, and Zoran Tosic equalized in the 65th before substitute Joao Moutinho netted the winner from the top of the area in the 78th. \nSerbia played the final minutes with nine men as captain Aleksandar Kolarov was sent off with a second yellow card in the 80th and Nemanja Matic received a straight red in the 81st. Topics:", "external_links": [], "published": "2015-10-11T20:55:00.000+03:00", "crawled": "2015-10-11T21:20:37.561+03:00", "highlightTitle": ""}