{"organizations": ["Barcelona"], "uuid": "1f520c3fbc4f19bd10cc059e5c43b7f67361be19", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/bc6ac7cc57c7ca5dcef1d53b799cf10c.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/football/could-a-premier-league-switch-be-on-the-cards-for-barcelona/6994370/", "country": "JE", "title": "Could a Premier League switch be on the cards for Barcelona star Lionel Messi?", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "Could a Premier League switch be on the cards for Barcelona star Lionel Messi?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T11:32:00.000+02:00", "replies_count": 0, "uuid": "1f520c3fbc4f19bd10cc059e5c43b7f67361be19"}, "author": "", "url": "http://www.sport.co.uk/football/could-a-premier-league-switch-be-on-the-cards-for-barcelona/6994370/", "ord_in_thread": 0, "title": "Could a Premier League switch be on the cards for Barcelona star Lionel Messi?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Lionel Messi", "Jason King"], "text": "Could a Premier League switch be on the cards for Barcelona star Lionel Messi? By Jason King (columnist) 26 Oct 2015 09:32:36 \nreads \ncomments \nArgentinian superstar Lionel Messi’s move away from Camp Nou may be on the cards as he is becoming increasingly frustrated in Spain with ongoing disputes over tax avoidance. \nThe 28-year-old has spent his entire senior career at the Spanish giants of Barcelona, a club he joined aged 13 , and steadily crafted his skills alongside superstar Ronaldinho. Brazilian Ronaldinho told his teammates that he believed Messi would become an even better player than himself. \nRonaldinho soon befriended Messi, whom he called \"little brother,\" and helped Messi’s transition into the first team as a 16 year old against José Mourinho's Porto on 16 November 2003. Within a few years Messi had become the team’s star player and he inspired the Blaugrana to numerous trophies. \nHe was voted the World's best player in 2009, 2010, 2011 and 2012 and has been runner up to Cristiano Ronaldo in 2013 and 2014. He looks the favourite to win the Ballon d’Or this year after guiding Barca to yet another treble, including Champions League victory over Juventus. \nDespite all his success on the pitch, the magician Messi's patience has a limit and it has been reported that the Argentine star may leave the Catalan club in the summer of 2018 when his current contract is up. \nMessi and his father feel persecuted by the Spanish Treasury due to an alleged fraud of 4.1 million euros. The incident took place during three consecutive years, from 2007 to 2009. \"Messi is absolutely disappointed and feels that there is a campaign against him, against his family and against what they represent”. \nIf Messi is to leave Spain then surely he would love the challenge of the Premier League. The 28-year-old has been linked with Premier League clubs in the past, and he has refused to rule out a move to England with Manchester United, Manchester City and Chelsea all believed to be keen on a move. \nThe Atomic Flea has added fuel to fire by not ruling out a move “I don’t want to look too far ahead” Messi said “I live for the moment and at this moment I am with Barcelona in La Liga where I’ve made my living and I live very well.’ \nMessi would be very, very expensive to buy and would surely breach FFP rulings no matter which Premier League side sign him, so the most likely scenario will be at the end of his current contract in 3 years time. \nHere is a list of Messi’s trophy haul with Barca: \nLa Liga: 2004–05, 2005–06, 2008–09, 2009–10, 2010–11, 2012–13, 2014–15 \nCopa del Rey: 2008–09, 2011–12, 2014–15 \nSupercopa de España: 2005, 2006, 2009, 2010, 2011, 2013 \nUEFA Champions League: 2005–06, 2008–09, 2010–11, 2014–15 \nUEFA Super Cup: 2009, 2011, 2015 \nFIFA Club World Cup: 2009, 2011 \nAnd individually: \nFIFA World Player of the Year: 2009 \nFIFA Ballon d'Or: 2010, 2011, 2012 Related Sport News", "external_links": [], "published": "2015-10-26T11:32:00.000+02:00", "crawled": "2015-10-26T20:24:31.958+02:00", "highlightTitle": ""}