{"organizations": [], "uuid": "f24d09f48eb1fbd95df4f5dbc66e2086b58291b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.gametimepa.com", "main_image": "http://extras.mnginteractive.com/live/media/site139/2015/1022/20151022__880830~s500~ph.jpg", "site_section": "http://feeds.feedburner.com/AllPrepSports-Leb", "section_title": "All Prep Sports - LEB", "url": "http://www.gametimepa.com/lebanon/ci_29010798/field-hockey-mid-penn-title-belongs-palmyra?source=rss", "country": "IL", "title": "FIELD HOCKEY: Mid-Penn title belongs to Palmyra", "performance_score": 0, "site": "gametimepa.com", "participants_count": 1, "title_full": "FIELD HOCKEY: Mid-Penn title belongs to Palmyra", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T17:25:00.000+03:00", "replies_count": 0, "uuid": "f24d09f48eb1fbd95df4f5dbc66e2086b58291b1"}, "author": "Pat Huggins\nphuggins@GameTimePA.com \nFollow @phuggsports", "url": "http://www.gametimepa.com/lebanon/ci_29010798/field-hockey-mid-penn-title-belongs-palmyra?source=rss", "ord_in_thread": 0, "title": "FIELD HOCKEY: Mid-Penn title belongs to Palmyra", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Font Resize FIELD HOCKEY: Mid-Penn title belongs to Palmyra The Cougars captured their second conference crown, and first since 2009, on Thursday night with a 2-1 win over a tough Boiling Springs squad \nBy Pat Huggins \nFollow @phuggsports Posted: 10/22/2015 11:50:31 PM EDT Palmyra's Erin Huffman gets a hug from head coach Kristi Costello after the Cougars defeated Boiling Springs, 2-1, to win the Mid-Penn championship on Thursday night. (Jeremy Long — GameTimePA.com) Palmyra's Kiley Gallagher leaps over the stick of Boiling Springs' Emma Spisak during Thursday night's Mid-Penn championship game at Landis Field. (Jeremy Long — GameTimePA.com) \nHARRISBURG &GT;&GT; Make no mistake about it, the Palmyra field hockey team has bigger, loftier goals than the Mid-Penn championship. \nBut don't think for a second that the Cougars still don't cherish the opportunity to call themselves champions of their very deep and talented conference. It may not mean everything, but it still means a great deal. \nOn Thursday night at Central Dauphin Middle School's Landis Field, Palmyra captured its first — but, it hopes, not its last — postseason title with a hard-earned 2-1 victory over Boiling Springs in a hotly contested Mid-Penn final. \nAfter being held scoreless by the Bubblers' airtight defensive unit — it had allowed just four goals all season heading in — for the first 42:13 of game action, the Cougars finally broke through on an Erin Huffman tally with 17:47 left, then added a Kylie Bomgardner insurance goal with 7:32 to play en route to capturing their second Mid-Penn crown and first since 2009. Now 18-2 Palmyra, the reigning PIAA Class AAA co-champ, would dearly love to add District Three and state gold to their championship collection, but this will certainly do for now. Advertisement \n\"This is huge for us,\" said Palmyra coach Kristi Costello. \"Just to represent our division was a huge honor for us. We play in one of the best divisions in the state, in my opinion, so just to be able to play in the Mid-Penn tournament is huge for our team. Coming into the season, we had three championships as our goal. This is one championship and now we can focus on the next one, which is districts.\" \nThe Cougars will particularly enjoy this one because of the work required to attain it. Palmyra's Alexis Smith pushes downfield to create a scoring chance for the Cougars. (Jeremy Long — GameTimePA.com) \nThough it dominated possession throughout and had a couple near-misses — including a Kiley Gallagher blast from just outside the circle early in the first — Palmyra couldn't puncture the Bubblers' defensive armor until the opportunistic Huffman knocked in a Jess Dembrowski pass a little over 12 minutes into the second half off an extended corner play. \n\"She passed it to me and I just hit up,\" Huffman said of the score that came amid a scramble of bodies in the circle. \"I don't know, it just got jumbled around in there and I hit it in.\" \nAnd in doing so, ended an extended period of frustration that was heightened with each passing missed opportunity. \n\"We definitely had chances, with balls running across the cage and stuff,\" Huffman said of a night that saw Palmyra struggle to convert many of its 18 penalty corner chances. \"We just wanted to finish it.\" \n\"They're a great team,\" Costello said of the Bubblers, now 15-2. \"They're very fast. It was hard to get consistently into the circle because they would break up passes. And they were quick, too, to outlet the ball and attack. They're very well-coached.\" \nBut Boiling Springs couldn't break through until Emma Spisak scored off a Taylor Pentz corner insert with 2:36 left. \nAnd by then, Palmyra had a cushion thanks to penalty corner unit newcomer Bomgardner, who finished off a Gallagher feed with 7:32 to go for a 2-0 lead. \n\"The ball was just kinda jumping around and I ended up getting it on my stick and putting it in,\" Bomgardner, a defender, said. \"This was my first night (on corners). I thought I'd have (a chance to score), I was just hoping I could help out and get a goal.\" \nIn doing so, Bomgardner, and Huffman earlier, not only helped Palmyra reach its first championship goal of the postseason, but also ended a frustrating stretch with the Mid-Penn tourney. \nLast season, Palmyra missed out on the event after losing a Keystone Division tiebreaker to Lower Dauphin. Two years ago, the Cougars were Mid-Penn bound only to see the event cancelled by inclement weather. \nNo disappointment this time. \n\"To have an opportunity to win a championship, these kids, this is great for them,\" Costello said. \nPalmyra 2, Boiling Springs 1 Boiling Springs", "external_links": [], "published": "2015-10-23T17:25:00.000+03:00", "crawled": "2015-10-23T18:45:06.057+03:00", "highlightTitle": ""}