{"organizations": [], "uuid": "0ad624b1fd0e37e0bd2c686e5a10ac8252b3a664", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtontimes.com", "main_image": "", "site_section": "http://www.washingtontimes.com/rss/headlines/sports/", "section_title": "www.washingtontimes.com stories: Sports", "url": "http://www.washingtontimes.com/news/2015/oct/22/bayern-shooting-for-1000-bundesliga-win-vs-cologne/", "country": "US", "title": "Bayern shooting for 1,000 Bundesliga win vs. Cologne", "performance_score": 0, "site": "washingtontimes.com", "participants_count": 1, "title_full": "Bayern shooting for 1,000 Bundesliga win vs. Cologne", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T14:57:00.000+03:00", "replies_count": 0, "uuid": "0ad624b1fd0e37e0bd2c686e5a10ac8252b3a664"}, "author": "CIARAN FAHEY", "url": "http://www.washingtontimes.com/news/2015/oct/22/bayern-shooting-for-1000-bundesliga-win-vs-cologne/", "ord_in_thread": 0, "title": "Bayern shooting for 1,000 Bundesliga win vs. Cologne", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bayern shooting for 1,000 Bundesliga win vs. Cologne By CIARAN FAHEY - Associated Press - Thursday, October 22, 2015 \nBERLIN (AP) - Bayern Munich can become the first club to celebrate its 1,000th Bundesliga victory when it hosts Cologne on Saturday. \nBayern had its 12-match winning streak in all competitions ended by Arsenal in the Champions League on Tuesday but at home it holds a comfortable seven-point lead ahead of Borussia Dortmund. \nDortmund hosts Augsburg on Sunday, when Borussia Moenchengladbach welcomes Schalke for the one of the highlights of the 10th round. \nHere are a few things to know ahead of the games: \nRECORD BUILDERS \nBayern claimed yet another record last weekend as it became the first side to start the Bundesliga with nine wins. Such is the side’s dominance in recent seasons that history books are providing the yardstick by which its achievements are measured. \n“You take such a record with great pleasure,” captain Philipp Lahm said. “It’s not no easy to be right there from the start of a season.” \nCologne will be no pushover. Peter Stoeger’s side is well organized, hard-working and capable of capitalizing on any lapses, such as goalkeeper Manuel Neuer’s that presented Arsenal with the opening goal in Tuesday’s 2-0 defeat. \n“When you see that Wolfsburg and Dortmund were sent home with thrashings it doesn’t instill much confidence,” said midfielder Yannick Gerhardt, referring to the 5-1 defeats for each side. “But the game at Arsenal showed you can cause a surprise.” \nROBBEN’S RETURN? \nArjen Robben could make his eagerly anticipated return from injury against Cologne. The Dutch forward hasn’t played since suffering a groin injury while playing for the Netherlands in a European Championship qualifier against Iceland on Sept. 3. \n“I’m well,” Robben told Kicker magazine on Thursday. “I trained with the amateur team. If the week keeps going like this I’ll be fit and ready to play again. It looks good for Saturday.” \nBayern says Javi Martinez and Kingsley Coman were likely to have recovered from their muscular problems, while Franck Ribery was back training with a ball again as he works on his return from a long-term ankle injury. \nSECOND VS. BOTTOM \nDortmund bounced back from its Bundesliga wobble - two draws and the heavy defeat at Bayern - with a hard-worked but deserved 2-0 win at Mainz last week, prompting coach Thomas Tuchel to say the side had made a “first step in the right direction.”", "external_links": [], "published": "2015-10-22T14:57:00.000+03:00", "crawled": "2015-10-22T16:16:25.874+03:00", "highlightTitle": ""}