{"organizations": [], "uuid": "ea7550b7fc5809f572a43b57e857a077185f06be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.boston.com", "main_image": "http://p.o0bc.com/rf/image_1920x1190/Boston/2011-2020/2015/10/25/Boston.com/Sports/Images/3a5b19512dcf4e72becfcb5943eb97cc-3a5b19512dcf4e72becfcb5943eb97cc-0.jpg", "site_section": "http://www.boston.com/", "section_title": "Boston, MA news, breaking news, sports, video | Boston.com", "url": "http://www.boston.com/sports/football/patriots/2015/10/26/tom-brady-says-getting-more-mobile-ages/ilNWpPHVvWreHic2QjQBwJ/story.html", "country": "", "title": "Tom Brady says he’s getting more mobile as he ages - Patriots", "performance_score": 0, "site": "boston.com", "participants_count": 1, "title_full": "Tom Brady says he’s getting more mobile as he ages - Patriots", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:00:00.000+02:00", "replies_count": 0, "uuid": "ea7550b7fc5809f572a43b57e857a077185f06be"}, "author": "boston.com", "url": "http://www.boston.com/sports/football/patriots/2015/10/26/tom-brady-says-getting-more-mobile-ages/ilNWpPHVvWreHic2QjQBwJ/story.html", "ord_in_thread": 0, "title": "Tom Brady says he’s getting more mobile as he ages - Patriots", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tom Brady is a master of the quarterback sneak.\nDuring his 16-year career, the Patriots’ signal-caller has scored 16 rushing touchdowns, and 10 of them were from the 1-yard line . He often surprises defenses on quick counts to pick up first downs in short-yardage situations.\nBut this season, Brady moves around—and out of—the pocket with perhaps the quickest footwork of his career, and appears almost eager to scramble. He even led the Patriots in rushing yards and attempts against the New York Jets Sunday with 15 yards.\n Does Brady feel like he’s more mobile than he was a few years ago?\n“I do,” Brady said in an interview on WEEI’s Dennis and Callahan show . “There was another play late in the game where I only got 2 or 3 yards. It was in the red area, it was probably like a 3-yard run. I think before it may have been a 3-yard loss. In the end it’s a 6-yard difference.\n“If I can make one or two of those a game, it’s really going to help our team. Especially on third down. Because [the defense is] not counting on that. They’re, ‘How do we cover [Rob Gronkowski]? How do we cover Julian [Edelman]? How do we get [Danny] Amendola? And it’s like, man, they ain’t preparing for a Brady scramble. So I think those things end up being critical when it comes down to it.”\nOperating in space hadn’t been Brady’s speciality. He broke the internet when he “ juked ” former Bears linebacker Brian Urlacher in 2006.\nYet among quarterbacks in 2015, Brady has the ninth-most rushing first downs in the league, according to SportingCharts.com . Tyrod Taylor ranks at No. 12 and Marcus Mariota is 17th ranked. Sixteen years ago, Brady ran a 5.28 40-yard dash —Taylor ran a 4.53 in 2011 and Mariota ran a 4.52 in 2015.\nThese abnormal improvements are somehow typical for Brady. And it’s why his hope to play 10 more years of football is almost believable.\n“I hope so. I hope so,” he said of playing another decade. “What else am I going to do? ... Just because someone says, well, you should stop playing at this age or this age ’cause that’s what people did before you, I don’t really buy that.\n“If the game’s not fun anymore — which I highly doubt it, because it’s fun for my parents, and they’re in their 70s, it’s fun for me, it’s fun for my kids. And it’s just something I love to do.”\nBoston MVPs through the years\nPrevious -- of -- Next Patriots quarterback Tom Brady was named the MVP of the 2015, 2003, and 2001 Super Bowls. He received the NFL MVP for the 2010 and 2007 regular seasons. In 2007, he led the New England Patriots to an undefeated regular season, in which he threw 50 touchdown passes. Barry Chin / The Boston Globe Previous -- of -- Next Boston Bruins goaltender Tim Thomas was awarded the Conn Smythe Trophy as MVP of the 2011 Stanley Cup Finals, when the Bruins downed the Vancouver Canucks in seven games. Barry Chin / The Boston Globe Previous -- of -- Next David Ortiz won the 2013 World Series MVP during Boston’s title win over the St. Louis Cardinals. Ortiz went 11-for-16 (.688) with a 1.948 OPS, two home runs and six RBIs against the Cardinals. By comparison, the rest of the Red Sox hit .169 with a .484 OPS and two home runs in the series. Stan Grossfeld / The Boston Globe Previous -- of -- Next Red Sox second baseman Dustin Pedroia, one year after winning the Rookie of the Year Award, won the American League MVP in 2008 after hitting .326 and compiling an OPS of .869. He led the league in hits and runs scored, and topped it off with a Gold Glove. Bob DeChiara / USA Today Sports Previous -- of -- Next In a series that featured the infamous \"Wheelchair Game\", Paul Pierce emerged as the 2008 NBA Finals MVP. He played a solid all-around game against the Lakers, averaging 19.7 points, 5 rebounds, and 4.6 assists as the Celtics won in six games. Elsa Garrison / Getty Previous -- of -- Next Advertisement Previous -- of -- Next Mike Lowell was the 2007 World Series MVP after the Red Sox breezed to a sweep of the Colorado Rockies for Boston's second title in four years. Lowell batted .400 and had an OPS of 1.300, along with a home run and four RBI. Stan Grossfeld / The Boston Globe Previous -- of -- Next Taylor Twellman, of the New England Revolution, won the Major League Soccer MVP in 2005. He was second in the league with six game-winning goals. Overall, he had 17 goals and seven assists. Twellman's prime was cut short due to concussions, and he retired in 2009. Robert E. Klein / the Boston Globe Previous -- of -- Next Manny Ramirez was just, well, Manny in the 2004 World Series, as he helped the Red Sox eliminate the \"1918\" chants and bring home Boston's first championship in 86 years. He won the MVP of the series as the Red Sox swept the Cardinals. Ramirez batted .412 and had a 1.088 OPS. Stan Grossfeld / The Boston Globe Previous -- of -- Next Branch was MVP of Super Bowl XXXIX, in the Patriots' 24-21 win over the Philadelphia Eagles. He had 11 catches for 133 yards. Many believe he was a strong contender for Super Bowl MVP the year before (Tom Brady won), when he had 10 catches and 143 yards vs. the Panthers. Matthew J. Lee / The Boston Globe Previous -- of -- Next In 1995, Red Sox slugger Mo Vaughn won the American League MVP by batting .300 and slugging .575. He hit 39 home runs and led the league with 126 RBI. Vaughn actually had a better year in 1996, as he had 44 home runs, 143 RBI, and an OPS of 1.003, but only finished fifth in the MVP voting. Joanne Rathe / The Boston Globe Previous -- of -- Next Advertisement Previous -- of -- Next In 1986 -- his first full season as a starter for the Red Sox -- Roger Clemens put together one of the greatest seasons in baseball history and earned the American League MVP. He went 24-4, posted an ERA of 2.48, and struck out 238 batters in 254 innings. Barry Chin / The Boston Globe Previous -- of -- Next \"Larry Legend\" won three straight MVP awards, from 1984 to 1986, along with two NBA Finals MVP awards in 1984 and 1986. Bird was one of the most dominant players in the league during the stretch - averaging nearly a triple-double for all three years. In 1984, he averaged 28.7 points, 10.5 rebounds, and 6.6 assists. Frank O'Brien / The Boston Globe Previous -- of -- Next Cedric Maxwell won the NBA Finals MVP in 1981 as the Celtics beat the Rockets in six games. He averaged 17.7 points, 9.5 rebounds, and 2.8 assists in the series while shooting 58 percent from the field. Frank O'Brien / The Boston Globe Previous -- of -- Next Jim Rice won his lone MVP award in a remarkable 1978 season. He led the league in hits (213), triples (15), home runs (46), RBIs (139), slugging (.600), OPS (.970) and total bases. Rice, for a time, was considered one of the best hitters in the game and as a result was finally elected into the Hall of Fame in 2009. Boston Globe Archives Previous -- of -- Next Jo Jo White won the NBA Finals MVP in 1976 after averaging 21.7 points, 4.3 rebounds, 5.8 assists, and 1.5 steals. The Celtics defeated the Suns in six games, in a series that included one of the most epic playoff games in NBA history: a triple-overtime thriller that the Celtics won 128-126. The Boston Globe Archives Previous -- of -- Next Advertisement Previous -- of -- Next Talk about starting your career off with a bang. In 1975, center fielder Fred Lynn won an MVP in his rookie year. He led the AL in slugging percentage, OPS, doubles and runs. He hit 21 home runs and drove in 105 runs. He also had an OPS+ of 161. Obviously, he also was Rookie of the Year, with a Gold Glove to boot. Boston Globe Archives Previous -- of -- Next The Bruins' most recent MVP actually goes all the way back to 1974 with Phil Esposito, although the Bruins have had goalies win the Vezina Trophy as the NHL's best goalie. He scored 68 goals and had 77 assists for 145 points with a +/- of 51. Esposito tied his career high in assists in 1969, when he won his first MVP. Boston Globe Archives Previous -- of -- Next John \"Hondo\" Havlicek was a prolific scorer who led the Celtics to a title in 1974 and was the Finals MVP, averaging 26.4 points, 7.7 rebounds, and 4.7 assists in a series win over the Milwaukee Bucks in seven games. Frank O'Brien / The Boston Globe Previous -- of -- Next Dave Cowens' hard-nosed style earned him the MVP award in 1973, averaging 20.5 points and 16.5 rebounds in a year when Boston lost the Eastern Conference Finals in seven games to the New York Knicks. It was Cowens' third year in the league. Photo courtesy of The Color Daily Previous -- of -- Next Bobby Orr won three straight MVPs from 1970 to 1972. In 1971, the famed Bruins defenseman led the league in assists and plus/minus all three years. Orr is also the only Bruin to win a Stanley Cup MVP, winning in both 1970 and 1972. Ray Lussier / AP Previous -- of -- Next Advertisement Previous -- of -- Next Carl \"Yaz\" Yastrzemski won his lone MVP Award in 1967, posting a 1.040 OPS and leading the league with 44 home runs and 121 RBI. He topped it off with one of his seven Gold Gloves. Frank O'Brien / The Boston Globe Previous -- of -- Next Bill Russell's career is so impressive that the fact he won five regular season MVPs is almost secondary to his postseason success (11 titles). The NBA Finals MVP did not exist before 1969, but it's likely Russell would have won a bunch. Boston Globe Archives Previous -- of -- Next Right fielder Jackie Jensen won an MVP exactly one year before his career ended. In 1958, he won the award after hitting 35 home runs and driving 122 runs, which led the league. He had a career high .931 OPS. Photo courtesy of US Airlines News Bureau Boston Globe Archives Previous -- of -- Next Milt Schmidt, a former Bruins captain, won an MVP in 1951. In 62 games, he had 22 goals and 39 assists for 61 points. Photo courtesy of Black & White Daily Previous -- of -- Next Advertisement Previous -- of -- Next Center Bill Cowley won MVPs for the Bruins in 1941 and 1943. In both years, he had 45 assists. In 1941, he netted 17 goals and two years later, he had 27. Boston Globe Archives Previous -- of -- Next Ted Williams won two MVPs, in 1946 and 1949. From 1941 to 1949, Williams led the league in OBP, slugging, and OPS. He hit 43 home runs and drove in 159 in 1949, both career highs. In 1946 and 1949, Williams scored 142 and 150 runs respectively and led the league in both years. Boston Globe Archives Previous -- of -- Next Jimmie Foxx won three MVPs in his career, two with the A’s and one with the Red Sox in 1938. He had a career high OPS of 1.166 and reached the 50-homer plateau for the second time in his career. He slugged .704 during the regular season which was not even a career high (.749 in 1932, his first MVP season). Boston Globe Archives Previous -- of -- Next Defenseman Eddie Shore won four MVPs in six years for the Bruins. He won his first at age 30 in 1933 and then won back-to-back awards in 1935 and 1936. He then tacked on one more in 1938 at age 35. Boston Globe Archives Previous -- of -- Next There was a time when a player could lead the league in home runs with 10. That time would be right around 1912, when Tris Speaker (center) won the MVP. Speaker led the league with 10 home runs and a .464 OBP in 153 games. He belted out 222 hits, drove in 90 runs, and also hit 53 doubles, which led the league. Handout Photo Previous -- of -- Next Advertisement", "external_links": ["http://www.youtube.com/watch?v=dAt6S1RHBYs", "http://www.sportingcharts.com/nfl/stats/quarterback-rushing-first-downs-leaders/2015/", "http://media.weei.com/a/110366254/tom-brady-on-patriots-jets-playing-10-more-years-10-26-15.htm", "http://www.pro-football-reference.com/players/B/BradTo00/touchdowns/", "http://www.youtube.com/watch?v=kxx_u67eUSA"], "published": "2015-10-26T02:00:00.000+02:00", "crawled": "2015-10-26T22:06:34.965+02:00", "highlightTitle": ""}