{"organizations": ["Nissan Stadium", "AP Tennessee Titans", "Tennessee TItans", "AP Bills", "AP Buffalo Bills", "Tennessee Titans", "Buffalo Bills", "AP Mason Bollinger", "AP Titans", "Jurrell Casey"], "uuid": "65d35a65e661a06faa6116ee53d7f272b1c83f07", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.democratandchronicle.com", "main_image": "http://www.gannett-cdn.com/-mm-/49348176cde6d66dd2560ef94221bdde0e504564/c=0-110-2372-1450&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/11/Rochester/Rochester/635801749422767663-USATSI-8854771.jpg", "site_section": "http://rssfeeds.wgrz.com/_/20/107902982/WGRZ/sports", "section_title": "WGRZ - Sports", "url": "http://www.democratandchronicle.com/story/sports/football/nfl/bills/2015/10/11/buffalo-bills-tennessee-titans-recap-nfl/73608510/", "country": "US", "title": "Bills overcome ugly start, stun Titans, 14-13", "performance_score": 0, "site": "democratandchronicle.com", "participants_count": 0, "title_full": "Bills overcome ugly start, stun Titans, 14-13", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T23:16:00.000+03:00", "replies_count": 0, "uuid": "65d35a65e661a06faa6116ee53d7f272b1c83f07"}, "author": "", "url": "http://www.democratandchronicle.com/story/sports/football/nfl/bills/2015/10/11/buffalo-bills-tennessee-titans-recap-nfl/73608510/", "ord_in_thread": 0, "title": "Bills overcome ugly start, stun Titans, 14-13", "locations": ["Nashville", "Tenn"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Michael Lafferty", "Rex Ryan", "Greg Meyer", "Sal Maiorana", "Sankey", "Aaron Williams", "Walt Anderson", "Mark Zaleski", "James Kenney", "Marcus Mariota", "Stephon Gilmore", "Dexter McCluster", "Kyle Williams", "Christopher Hanewinckel-USA", "Dan Carpenter", "Tyrod Taylor", "Brett Kern", "Herron", "Richie Incognito", "Weston Kenney", "Anthony Dixon", "Jim Brown-USA", "Christopher", "Antonio Andrews", "Colton Schmidt", "Craig Stevens", "Jason McCourty", "Kendall Wright", "Garrison Sanborn", "Jim Brown", "Ryan Succop"], "text": "Bills overcome ugly start, stun Titans, 14-13 Sal Maiorana , @salmaiorana 4:16 p.m. EDT October 11, 2015 Titans running back Antonio Andrews (26) scores during the second half against the Buffalo Bills at Nissan Stadium. Christopher Hanewinckel-USA TODAY Sports Bills quarterback Tyrod Taylor (5) scores on a 22-yard touchdown run during the second half against the Tennessee Titans at Nissan Stadium. Christopher Hanewinckel-USA TODAY Sports Bills quarterback Tyrod Taylor (5) runs for a first down during the second half against the Tennessee TItans. Christopher Hanewinckel-USA TODAY Sports Bills quarterback Tyrod Taylor (5) reacts after being hit during the first half. Christopher Hanewinckel-USA TODAY Sports Titans defensive end Jurrell Casey (99) reacts after a defensive stop against Buffalo Bills quarterback Tyrod Taylor (5) during the first half at Nissan Stadium. Christopher Hanewinckel-USA TODAY Sports Bills running back Anthony Dixon (26) leaps to avoid the tackle by Tennessee Titans cornerback Jason McCourty (30) during the first half. Jim Brown-USA TODAY Sports Bills quarterback Tyrod Taylor (5) is hit hard after throwing the ball during the first half against the Tennessee Titans. Christopher Hanewinckel-USA TODAY Sports Titans kicker Ryan Succop (4) reacts after making a field goal during the first half. Christopher Hanewinckel-USA TODAY Sports Bills quarterback Tyrod Taylor (5) is sacked by Tennessee Titans defensive end Jurrell Casey (99) in the first half. Mark Zaleski, AP Bills cornerback Stephon Gilmore (24) upends Tennessee Titans running back Antonio Andrews. Weston Kenney, AP Titans receiver Kendall Wright (13) has a pass broken up by Buffalo Bills cornerback Stephon Gilmore (24) during the first half at Nissan Stadium. Christopher Hanewinckel-USA TODAY Sports Titans tight end Craig Stevens (88) is tackled after a reception during the first half. Christopher Hanewinckel-USA TODAY Sports Titans kicker Ryan Succop (4) reacts after kicking a field goal in the second quarter. Mark Zaleski, AP Titans quarterback Marcus Mariota (8) attempts to dive for the first down against Buffalo Bills defensive tackle Kyle Williams. Jim Brown-USA TODAY Sports Bills running back Boom Herron (38) rushes against the Tennessee Titans during the first half. Jim Brown-USA TODAY Sports Buffalo Bills running back Boom Herron (38) carries in the first half against the Tennessee Titans. Mark Zaleski, AP Bills quarterback Tyrod Taylor (5) prepares to pass in the first half against the Titans. Mark Zaleski, AP Titans quarterback Marcus Mariota hands off to running back Dexter McCluster (22) in the first half against the Bills. James Kenney, AP Tennessee Titans quarterback Marcus Mariota (8) passes in the first half. James Kenney, AP Titans running back Bishop Sankey (20) is tackled by Buffalo Bills strong safety Aaron Williams (23) in the first half. Mark Zaleski, AP Bills head coach Rex Ryan shakes hands with offensive guard Richie Incognito (64) before the game. Mark Zaleski, AP Bills quarterback Tyrod Taylor (5) warms up. Mark Zaleski, AP Buffalo Bills quarterback Tyrod Taylor warms up before the game. Mark Zaleski, AP Buffalo Bills head coach Rex Ryan arrives before the game against the Tennessee Titans Sunday, Oct. 11, 2015, in Nashville, Tenn. James Kenney, AP Buffalo Bills punter Colton Schmidt (6), long snapper Garrison Sanborn (65), kicker Dan Carpenter (2) and Tennessee Titans punter Brett Kern (6) talk before the game. Mark Zaleski, AP Mason Bollinger, 7, wears a Bills helmet as he watches players warm up. Mark Zaleski, AP Bills fans show their support and recall the \"Music City Miracle\" prior to the game against the Tennessee Titans. Jim Brown, Jim Brown-USA TODAY Sports Tennessee Titans quarterback Marcus Mariota (8) arrives at the stadium on Sunday. James Kenney, AP Bills fan Michael Lafferty prior to the game against the Tennessee Titans at Nissan Stadium on Oct. 11, 2015. Christopher Hanewinckel-USA TODAY Sports Bills head coach Rex Ryan talks with referee Walt Anderson (66) and side judge Greg Meyer before the game. Jim Brown-USA TODAY Sports Bills head coach Rex Ryan is all smiles prior to the game. Christopher Hanewinckel-USA TODAY Sports A young Buffalo Bills fan looks on prior to the game against the Tennessee TItans at Nissan Stadium. Christopher Hanewinckel-USA TODAY Sports Like this topic? You may also like these photo galleries: Replay", "external_links": [], "published": "2015-10-11T23:16:00.000+03:00", "crawled": "2015-10-11T23:22:49.165+03:00", "highlightTitle": ""}