{"organizations": [], "uuid": "6909180ca17c2931aaaae89fb36ea7c6010edb7a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eagletribune.com", "main_image": "http://bloximages.chicago2.vip.townnews.com/eagletribune.com/content/tncms/assets/v3/editorial/8/e1/8e16e765-4b15-5b3d-a061-7e66b0baab12/562b099ca9f99.image.jpg", "site_section": "http://www.eagletribune.com//search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&nsa=eedition&c[]=sports,sports/*&f=rss", "section_title": "Eagle-Tribune - sports,sports/", "url": "http://www.eagletribune.com/sports/soccer-sophomore-standouts-leading-pack/article_3b24d299-3d5e-5a3f-9af3-7985b58ecc2c.html", "country": "US", "title": "Soccer: Sophomore standouts leading pack", "performance_score": 0, "site": "eagletribune.com", "participants_count": 1, "title_full": "Soccer: Sophomore standouts leading pack", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T07:00:00.000+02:00", "replies_count": 0, "uuid": "6909180ca17c2931aaaae89fb36ea7c6010edb7a"}, "author": "High School Soccer Mac Cerullo", "url": "http://www.eagletribune.com/sports/soccer-sophomore-standouts-leading-pack/article_3b24d299-3d5e-5a3f-9af3-7985b58ecc2c.html", "ord_in_thread": 0, "title": "Soccer: Sophomore standouts leading pack", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Soccer: Sophomore standouts leading pack \nNicole Langlois. Soccer: Sophomore standouts leading pack \nCARL RUSSO/Staff Photo Central Catholic's Elayna Grillakis watches as a ball comes in during her team's 3-0 win over Methuen back on Sept. 22. Soccer: Sophomore standouts leading pack \nAndrew Fichera Soccer: Sophomore standouts leading pack \nSamantha Neyman. Soccer: Sophomore standouts leading pack High School Soccer Mac Cerullo Eagle-Tribune \nThe Merrimack Valley has been a hotbed of girls soccer talent this fall, but its interesting to note how two of the best players in the area are also two of the youngest. \nCentral Catholic’s Elayna Grillakis, arguably the best player on one of the best teams in New England, is only a sophomore. So is North Andover High’s Samantha Neyman, who transferred in from Brooks this summer and immediately emerged as one of the top playmakers in the MVC. \nBoth Grillakis and Neyman have already committed to play Division 1 college soccer, with Grillakis committed to Providence College and Neyman to the University of Miami. The two are also close friends from their time as club soccer teammates, and earlier this season the pair faced off for the first time as opponents. \n“It was really nice to play against her and see a familiar face,” Neyman said of the encounter, which Central won 2-0 back on Oct. 8, to Neyman’s dismay. \nSince transferring in from Brooks, Neyman has adjusted nicely to her new competition, ranking second on the team in scoring with 7 goals and 5 assists coming into the weekend. She added that the reason she decided to leave Brooks was because the school’s Saturday classes were difficult to manage with her extensive travel schedule for soccer, but the level of competition in the MVC has proven to be comparable to the prep competition she faced as a freshman, despite what most would assume. \nAs for Grillakis, she’s more than lived up to her lofty expectations. Grillakis is currently the area’s overall scoring leader with 11 goals and 14 assists for 25 total points. She had two assists in Central’s 5-0 win over her native Lowell this past Thursday, and generally speaking she’s been a key factor in Central’s 13-0-1 start. \nCentral and North Andover will face off one more time in this Thursday’s regular season finale, and assuming both stick around for the remainder of their high school careers, Grillakis and Neyman should both treat the area with some fine matchups for years to come. \n\nAndrew Fichera \nSalem, Senior \nAndrew Fichera and the Salem boys wrapped up the regular season with a 5-0 win over a good Merrimack team on Thursday. Fichera had two goals and two assists in the game, and he finishes the regular season fourth in the area with 14 goals. \n\nNicole Langlois \nMethuen, Senior \nLanglois scored six goals for Methuen this past week, starting off with a two-goal performance against Malden last Saturday before erupting for four goals in her team’s 11-0 win over Lawrence. Langlois is now up to 18 goals on the season and could have a chance to catch area-leader Sydney Goodwin, especially if the Rangers make a run in the state tournament. Sign Up / Sign In With your existing account from... {* loginWidget *}", "external_links": [], "published": "2015-10-25T07:00:00.000+02:00", "crawled": "2015-10-25T08:24:23.252+02:00", "highlightTitle": ""}