{"organizations": ["Revell Williams Jr.", "Cedar Creek"], "uuid": "d50349dd4890e3b5f86baf799452e037f61ff058", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thedailyjournal.com", "main_image": "http://www.gannett-cdn.com/-mm-/effa87fdfe5531bda652d6c79adf3030f6749970/c=0-144-3400-2056&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/02/Vineland/B9319117260Z.1_20151002234241_000_G3GC4EH8I.1-0.jpg", "site_section": "http://rssfeeds.thedailyjournal.com/vineland/sports", "section_title": "Vineland Sports", "url": "http://www.thedailyjournal.com/story/sports/2015/10/04/prep-schedule/73356854/", "country": "US", "title": "Bridgeton football: Bulldogs win in OT", "performance_score": 0, "site": "thedailyjournal.com", "participants_count": 0, "title_full": "Bridgeton football: Bulldogs win in OT", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T06:45:00.000+03:00", "replies_count": 0, "uuid": "d50349dd4890e3b5f86baf799452e037f61ff058"}, "author": "", "url": "http://www.thedailyjournal.com/story/sports/2015/10/04/prep-schedule/73356854/", "ord_in_thread": 0, "title": "Bridgeton football: Bulldogs win in OT", "locations": ["Bridgeton"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["ANTOINE SHELTON", "Kristian Gonyea/Photographer"], "text": "Bridgeton football: Bulldogs win in OT ANTOINE SHELTON, SPECIAL TO THE DAILY JOURNAL 11:45 p.m. EDT October 2, 2015 Bridgeton’s Revell Williams Jr. (3) runs for a first down against Cedar Creek on Friday night. (Photo: Kristian Gonyea/Photographer) 4 CONNECT 8 TWEET LINKEDIN COMMENT EMAIL MORE \nBRIDGETON The Bridgeton High School football team won its first game of the season on Friday night but it wasn’t easy. \nThe Bulldogs needed an overtime period but eventually pulled off a gutty and resilient 12-6 win over Cedar Creek on a dreary, rainy and windy night. \nWith the score between Bridgeton (1-3) and Cedar Creek (3-1) tied 6-6 after four quarters, the game went into overtime. \nBridgeton quarterback David Mosley actually wanted his team to start out on defense and he got his wish. \n“I believed in my team and I knew we would shut them down on defense,” he said. \nThat’s exactly what the Bulldogs did. After Bridgeton held up on defense, the Pirates tried a 34-yard field goal attempt but missed. \nOn Bridgeton’s first overtime possession, it needed only one play to end the game. It was Mosely who hooked up with Markquese Bell on a 25-yard touchdown pass. \n“I dropped back and the only thing I saw was Bell,” Mosley said. “I threw the ball and hit him right in stride and won the football game.” \nIt was Bell’s only catch of the game and it couldn’t have come at a bigger moment. He said the only thing on his mind was to get behind the defensive backs and catch the ball. \nAfter a scoreless first half, both teams found the end zone in the second half. The Bulldogs struck first on a 1-yard touchdown run by Daquan Soloman. Soloman took the ball over the right side of the goal line and celebrated what was the biggest offensive play of the night up until that point. \nBridgeton failed on the extra point and headed into the fourth quarter with the lead. \nCedar Creek would match the Bulldog score late in the fourth off a 1-yard run of its own from Bo Melton. The Pirates had a chance to take the lead but had a bad snap on the extra point try. \nOn the final Pirates’ possession of the game the Bridgeton defense held them to a crucial turnover on downs to force overtime. \nA lot of players feel like they could easily be 4-0 instead of 1-3 but are looking at Friday’s win as a chance to restart the season. \n“This means a lot,” Bell said. “Teams stop doubting us, people stop doubting us. We on a roll now. We got our first win, and start the season over 1-0.” \nBridgeton 12, Cedar Creek 6 (OT) \nCedar Creek (3-1) 0 0 0 6 0 — 6 \nBridgeton (1-3) 0 0 6 0 6 — 12 \nScoring \nB: Solomon 1 run (kick failed) \nC: Melton 1 run (kick failed) \nB: Bell 25 pass from Mosley (no attempt) \nTeam stats Cedar Creek Bridgeton \nFirst downs 8 10", "external_links": [], "published": "2015-10-03T06:45:00.000+03:00", "crawled": "2015-10-05T04:28:31.959+03:00", "highlightTitle": ""}