{"organizations": ["Springboks", "All Blacks Tue Oct", "All Blacks History"], "uuid": "d72a49a00ab441d2adb3664556b705757c75acaa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "af.reuters.com", "main_image": "", "site_section": "http://feeds.reuters.com/reuters/AFRICASportNews", "section_title": "Reuters: Sports News", "url": "http://af.reuters.com/article/sportsNews/idAFKCN0SE16Z20151020", "country": "US", "title": "History means nothing against Springboks, say All Blacks", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "History means nothing against Springboks, say All Blacks", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T13:56:00.000+03:00", "replies_count": 0, "uuid": "d72a49a00ab441d2adb3664556b705757c75acaa"}, "author": "", "url": "http://af.reuters.com/article/sportsNews/idAFKCN0SE16Z20151020", "ord_in_thread": 0, "title": "History means nothing against Springboks, say All Blacks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "History means nothing against Springboks, say All Blacks Tue Oct 20, 2015 10:56am   \nBy Justin Palmer \nWEYBRIDGE, England (Reuters) - When it comes to crunch test rugby, there is little that New Zealand and South Africa do not know about each other's game. But familiar foes or not, the All Blacks expect Sunday's World Cup semi-final to go up a notch in skill and intensity. \nSettling into their base in leafy Surrey after their clinical nine-try quarter-final rout of France in Cardiff, the world champions began to turn their attention to a Springboks side who they have beaten in 10 of their last 12 meetings. \nThe last match up came three months ago in Johannesburg when the All Blacks, 20-17 adrift with six minutes left, needed a late Richie McCaw try to get them home. \nSouth Africa had triumphed by two points in the same Ellis Park stadium a year ago and New Zealand forward Kieran Read said the All Blacks needed to be wary. \n\"Two teams who have got a lot of history over the last few years, played some pretty outstanding test matches so looking forward to a big challenge,\" Read said. \n\"History has shown that prior form means nothing when it comes to a finals game. We've got to turn up and certainly take lessons from the games we've played against them in the past. \n\"We know their style. They know us. So it's all part of turning up and playing well. They'll be as confident as we are.\" \nThe mantra coming out of the All Blacks camp was needing to raise their intensity again, analysing the physical challenge that the Springboks will pose but focus on honing their own game. Continued...  ", "external_links": [], "published": "2015-10-20T13:56:00.000+03:00", "crawled": "2015-10-20T23:02:48.289+03:00", "highlightTitle": ""}