{"organizations": [], "uuid": "df954690e0fa11195b0aef40d8bc3ccbd5fbf8b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fox8live.com", "main_image": "http://WVUE.images.worldnow.com/images/9001438_G.jpg", "site_section": "http://www.fox8live.com/", "section_title": "New Orleans News, Weather, Saints - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "url": "http://www.fox8live.com/story/30244258/fox-8-receives-three-national-edward-r-murrow-awards", "country": "US", "title": "FOX 8 receives three National Edward R. Murrow awards", "performance_score": 0, "site": "fox8live.com", "participants_count": 1, "title_full": "FOX 8 receives three National Edward R. Murrow awards - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T05:29:00.000+03:00", "replies_count": 0, "uuid": "df954690e0fa11195b0aef40d8bc3ccbd5fbf8b5"}, "author": "Written by: FOX8Live.com Staff", "url": "http://www.fox8live.com/story/30244258/fox-8-receives-three-national-edward-r-murrow-awards", "ord_in_thread": 0, "title": "FOX 8 receives three National Edward R. Murrow awards", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (WVUE) - Members of our FOX 8 team were on hand at Gotham Hall in New York City on Monday night to accept three National Edward R. Murrow awards. It was the fifth consecutive year that WVUE FOX 8 News received a Murrow Award, which is recognized as one of the most notable honors in journalism.\nIn the \"Newscast\" category, FOX 8 News at 10 p.m. was honored with a National Murrow. Producer Kristen Soroe Palestina accepted the award for her newscast, which aired the day that former New Orleans Mayor Ray Nagin was indicted on federal corruption charges. Her newscast included an exclusive interview that reporter Rob Masson conducted with a juror that evening. Other elements included in that newscast were:\n· Former St. Tammany Parish Coroner Dr. Peter Galvan was sentenced to two year in prison for conspiracy charges. These charges came after our award winning series of reports “Body of Evidence”, which outlined the coroner's questionable practices in public and private office.\n· A Lee Zurik investigation into St. Bernard Parish President David Peralta. Zurik's story focused on text messages Peralta sent to his estranged wife following her allegations that the parish president raped her in their home.\nThe multi-year joint investigation with NOLA.com | The Times-Picayune entitled \"Louisiana Purchased\" received a Murrow award in the \"Investigative Reporting\" category. It is the investigation's second National Murrow award.\n The investigation, which centered on Louisiana's complex finance system, launched federal and state investigations. It led politicians to pay back improperly and possibly illegally spent money and spawned a state law change.\nThe winning entry focused on the 2014 investigation's results and findings which included:\n· State legislators passed five separate bills related to campaign finance reform. The bills were based on our stories.\n· The FBI launched a federal grand jury investigation into findings about double dipping in connection with State Rep. Joe Harrison.\n· Lawmakers reimbursed taxpayers thousands of dollars after we showed they were double dipping: paying for something out of their campaign account while also seeking reimbursement for those same expenses from taxpayers.\nThe investigative team consists of: Chief Investigative Reporter Lee Zurik, NOLA.com | The Time Picayune Enterprise Editor Manuel Torres, Investigative Producer Tom Wright, Photographer/Editor Jon Turnipseed, News Director Mikel Schaefer, and Assistant News Director Greg Phillips.\nThe FOX 8 investigative team also received a National Murrow award in the \"News Series\" category for \"Holding Officials Accountable\", which focused on four Lee Zurik Investigations. The news series uncovered questionable - and in two instances illegal - spending of hundreds of thousands in taxpayer dollars. The series held officials accountable by asking tough questions and pushing for answers that launched federal and state investigations and led to two separate corruption charges.\nThe 2015 awards mark four-consecutive years that WVUE has won multiple National Murrow awards and marks the 10th National Murrow award won since 2011.\nCopyright 2015 WVUE . ", "external_links": [], "published": "2015-10-13T05:29:00.000+03:00", "crawled": "2015-10-13T07:52:29.892+03:00", "highlightTitle": ""}