{"organizations": [], "uuid": "ed87b2085b5347b192de3b40c3c69e8b22559005", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "manilastandardtoday.com", "main_image": "http://manilastandardtoday.com/panel/_files/images/default/default-thumb.jpg", "site_section": "http://manilastandardtoday.com/feed/sports/", "section_title": "The Standard Sports", "url": "http://manilastandardtoday.com/2015/10/09/pacquiao-flies-to-qatar-to-cheer-ladon/", "country": "CA", "title": "Pacquiao flies to Qatar to cheer Ladon", "performance_score": 0, "site": "manilastandardtoday.com", "participants_count": 1, "title_full": "Pacquiao flies to Qatar to cheer Ladon", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T19:01:00.000+03:00", "replies_count": 0, "uuid": "ed87b2085b5347b192de3b40c3c69e8b22559005"}, "author": "Ronnie Nathanielsz", "url": "http://manilastandardtoday.com/2015/10/09/pacquiao-flies-to-qatar-to-cheer-ladon/", "ord_in_thread": 0, "title": "Pacquiao flies to Qatar to cheer Ladon", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Pacquiao flies to Qatar to cheer Ladon Pacquiao flies to Qatar to cheer Ladon By Ronnie Nathanielsz | Oct. 09, 2015 at 12:01am \nAFTER a long and tiring flight, eight-division world champion Manny Pacquiao arrived in Doha, Qatar to see Filipino light flyweight Rogen Ladon, who battles Mexican champion and two-time Pan American Games champion Joselito Velazquez in a second round bout scheduled for 7 p.m. Thursday (Manila time).Ladon, a silver medalist at the Asian Boxing Championships in Bangkok, Thailand last month scored an impressive 3-0 win in his opening bout against fancied Argentine boxer Leonard Blanc, winning on the scorecards of all three judges for a final 30-27 count. \nLadon himself told Philippine delegation head and ABAP executive director Ed Picson that Pacquiao was his idol and he would draw inspiration from seeing him at ringside in his clash with the heavily favored No.1 seed. \nPacquiao was welcomed by the President of the Qatar Boxing Federation Yousuf Ali Al Kazin and AIBA President Dr. Ching-Kuo Wu, with AIBA referring to Pacquiao as “a true legend of modern boxing.” \nAIBA, which earlier reported that the huge Filipino community in Doha, as well as the international media, were looking forward to Pacquiao’s arrival, even though it was only for one day said: “The People’s Champion will join the crowds for the start of Day 3 of the competition to cheer on his fellow countryman Rogen Ladon.” \nAt the opening press conference on Day 1 of the championships, Dr. Wu made the surprise announcement about Pacquiao’s visit following an invitation hand-carried by Picson to General Santos City last month. \nDespite his extremely tight schedule, Pacquiao kept his word and flew to Doha if only for one day. \nHighlighting the importance of such a high-profile name attending the competition, the AIBA president said “this is the benchmark for future world championships and I am pleased that Manny Pacquiao accepted by invitation to come and share his thoughts and ideas first hand.”  ", "external_links": [], "published": "2015-10-08T19:01:00.000+03:00", "crawled": "2015-10-09T16:08:03.605+03:00", "highlightTitle": ""}