{"organizations": [], "uuid": "7cec226e5324d013c396e8ecce24668d9c682715", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/49132849.cms", "site_section": "http://timesofindia.indiatimes.com/sports/more-sports/shooting/articlelist/3413165.cms", "section_title": "Shooting - More sports - Sports - The Times of India", "url": "http://timesofindia.indiatimes.com/sports/more-sports/shooting/Abhinav-Bindra-shoots-gold-as-India-finish-on-top/articleshow/49132822.cms", "country": "IL", "title": "Abhinav Bindra shoots gold as India finish on top", "performance_score": 0, "site": "indiatimes.com", "participants_count": 5, "title_full": "Abhinav Bindra shoots gold as India finish on top - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T03:00:00.000+03:00", "replies_count": 4, "uuid": "7cec226e5324d013c396e8ecce24668d9c682715"}, "author": "Tushar Dutt", "url": "http://timesofindia.indiatimes.com/sports/more-sports/shooting/Abhinav-Bindra-shoots-gold-as-India-finish-on-top/articleshow/49132822.cms", "ord_in_thread": 0, "title": "Abhinav Bindra shoots gold as India finish on top", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW DELHI: It is rare to see Abhinav Bindra pumping his fist in air after winning a medal. The Beijing Olympics gold medallist did just that after shooting his last shot in the final of men's 10m air rifle on Sunday. The shot, a 10.4, confirmed his gold in the 8th Asian Air Gun Championship at Dr Karni Singh range.\nBindra shot a superb 208.3 in the final after an equally good score of 627.9 in the qualifying round. The air rifle specialist never looked under pressure throughout the 20-shot final and hit less than 10 only once.\nHis 18th shot was a 9.6, but it didn't matter much as by then he already had a strong lead of 2.3 points over his Kazakhstan rival Yuriy Yuvkov, who won silver after shooting 206.6. Korea's Yu Jaechul claimed the bronze with 185.3.\nIndia's Gagan Narang, on the other hand, missed out on a medal after finishing fourth with 164.5. Narang had started off well and was placed first after the first three shots. But three 9s in his 16 shots cost him the medal. He had shot 622.6 in the qualification.\nThe other Indian in the fray, Chain Singh, finished sixth. Chain was tied at 122.7 with Korea's Kim Dajin after the 12th shot.\nTo break the tie, they shot a shoot-off which the Korean won. Kim shot 10.8 in the shoot-off, while Chain hit his lowest of the day, an 8.9. Chain had by this time already qualified eighth after shooting 618.1.\nIndia also won the team gold with a total score of 1868.6, ahead of Korea with 1859.1 and Saudi Arabia 1824.8.\nIn the youth men's 10m air rifle event, India's Satyajeet Kandhol (204.8 in final) won gold beating Lu ShaoChuan (203.7) of Chinese Taipei and Iran's Abbasali Daavoud (183.8).\nIn the junior men category of the same event, Iran's Mohammad Hossein Karimi pipped India's Pratik Borse to win gold. Karimi shot 205.4 in the final, while Borse hit 203.9. Bronze went to Korea's Han Changhee with 183.2.", "external_links": [], "published": "2015-09-28T03:00:00.000+03:00", "crawled": "2015-10-14T03:01:31.104+03:00", "highlightTitle": ""}