{"organizations": [], "uuid": "26a438813310439672b6ad7af263ebd7f8dd5d0c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cleveland.com", "main_image": "http://imgick.cleveland.com/home/cleve-media/width620/img/sports/college_impact/photo/19004333-standard.jpg", "site_section": "http://impact.cleveland.com/sports/college/atom.xml", "section_title": "Northeast Ohio College Sports", "url": "http://www.cleveland.com/sports/college/index.ssf/2015/10/hiram_college_ends_losing_stre.html", "country": "US", "title": "Hiram College ends losing streak: Five things of note from D2, D3 College Football 2015", "performance_score": 0, "site": "cleveland.com", "participants_count": 1, "title_full": "Hiram College ends losing streak: Five things of note from D2, D3 College Football 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T22:13:00.000+03:00", "replies_count": 0, "uuid": "26a438813310439672b6ad7af263ebd7f8dd5d0c"}, "author": "Branson Wright, The Plain Dealer", "url": "http://www.cleveland.com/sports/college/index.ssf/2015/10/hiram_college_ends_losing_stre.html", "ord_in_thread": 0, "title": "Hiram College ends losing streak: Five things of note from D2, D3 College Football 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CLEVELAND, Ohio - Hiram was so far behind last Saturday that the continuation of its losing streak was inevitable. \nOr was it? \nThe winless Terriers trailed by 11 points in the fourth quarter to Ohio Wesleyan, but rallied behind two field goals, a touchdown and a two-point conversation for the 32-31 victory, snapping its five-game losing streak. \nSam Conway's field goal with six seconds left was the game-winner for Hiram (1-5) . \nAnd Baldwin Wallace won for the third straight time, a 21-14 victory over Wilmington. Quarterback Tyler Moeglin led the way with 308 total yards and two touchdowns. \nHere are five things of note from the area Division II and III games over the past weekend: \n1. Purple Reign \nMount Union (6-0) has been so dominant this season that the 17 points it allowed against Heidelberg on Saturday were three more than it had allowed in the first five games combined. \nMount Union's No. 1 ranked defense allows an average of 152.7 yards per game of total offense. \n2. Welcome to the club \nJohn Carroll running back Ro Golphin did not get more than seven carries until his 107 yards for two touchdowns on 10 carries against Wilmington on Oct. 10. \nHis attempts were nearly tripled in last week's game against Marietta College and Golphin responded in resounding fashion. He finished with 203 yards and two touchdowns on 33 carries. Golphin will certainly see continued time in the backfield. \n3. Defense steps up \nThe Case Western Reserve offense has dominated the conversation when it comes to the early success this season behind 40 points per game. \nBut it was the defense that stood up last week at Geneva. The Spartans allowed a late touchdown but held Geneva to 100 yards passing and only 24 yards on the ground. \n4. Streak ends \nToo bad Notre Dame College can't play every game at home. The Falcons (2-5) snapped their four-game losing streak last Saturday against Concord with their second home victory of the season. \n5. Super Soph leads No. 8 Ashland \nCredit quarterback Travis Tarnowski with plenty of Ashland's success. Tarnowski, out of North Royalton High School, was spectacular in Ashland's 52-21 victory over Hillsdale. Tarnowski passed for a season-high 360 yards and four touchdowns. He completed 72.4 percent of his passes. \nFor the season, Tarnowski has a 61.6 percent completion rate, 17 touchdowns and 1,902 yards.", "external_links": [], "published": "2015-10-19T22:13:00.000+03:00", "crawled": "2015-10-19T23:14:12.550+03:00", "highlightTitle": ""}