{"organizations": [], "uuid": "fe5b908f4554b4ad6c886d39ae43b8623f6b2ff3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "cherokeetribune.com", "main_image": "http://cherokeetribune.com/images/article.jpg", "site_section": "http://cherokeetribune.com/rss/rss/Sports?instance=Sports&content_type=article&tags=sports&tag_inclusion=or&offset=0&limit=10&page_name=rss", "section_title": "Sports", "url": "http://cherokeetribune.com/bookmark/26890825", "country": "US", "title": "St. Louis treading lightly in season-ending twinbill", "performance_score": 0, "site": "cherokeetribune.com", "participants_count": 1, "title_full": "St. Louis treading lightly in season-ending twinbill", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T08:11:00.000+03:00", "replies_count": 0, "uuid": "fe5b908f4554b4ad6c886d39ae43b8623f6b2ff3"}, "author": "The Associated Press (noreply@cherokeetribune.com)", "url": "http://cherokeetribune.com/bookmark/26890825", "ord_in_thread": 0, "title": "St. Louis treading lightly in season-ending twinbill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "St. Louis treading lightly in season-ending twinbill by The Associated Press Associated Press October 04, 2015 12:11 AM | 396 views | 0 | 3 | | Fans wait in vain for Saturday’s Cardinals-Braves game to start at Turner Field. The game never did begin, leaving the teams to play a traditional doubleheader today, the final day of the season. Associated Press photo ATLANTA — St. Louis manager Mike Matheny has a primary goal for the Cardinals’ season-ending doubleheader against the Atlanta Braves.Keep everyone healthy for the postseason.“We can get some good out of it,” Matheny said. “We’ll get some guys some playing time. We’ll take a run at winning two games.”The Cardinals’ game Saturday night was postponed by rain. They’ll play the Braves in a doubleheader today starting at 1 p.m.The Cardinals, winners of the three straight NL Central titles, will open the Division Series at home Friday against the winner of the wild card game between Pittsburgh and the Chicago Cubs.Matheny originally wanted to get his regulars back in the lineup after giving several of them the previous night off and had Matt Carpenter, Matt Holliday, Jason Heyward and Kolten Wong penciled in.But when the start of Saturday’s game was delayed, Matheny reissued his lineup, keeping only center fielder John Jay, shortstop Greg Garcia, first baseman Brandon Moss and catcher Tony Cruz in place.Jhonny Peralta, St. Louis’ regular starting shortstop, is resting this weekend, and Matheny does not want to use him in the doubleheader.Adam Wainwright, who pitched a scoreless inning Friday, will work out the bullpen again today. The Cardinals’ ace returned Wednesday from an Achilles tendon injury that sidelined him 141 games.Wainwright is 2-1 with a 3.42 ERA and three saves in 65 career relief appearances. Matheny has indicated it’s unlikely he will return to the rotation until next year.The doubleheader will be St. Louis’ second in five days. They won Wednesday’s nightcap at Pittsburgh to earn the division title.TRAINER’S ROOMCardinals: OF Stephen Piscotty, sidelined since Monday with a head contusion and concussion symptoms, has been cleared to play by doctors. Matheny said he’s likely to put Piscotty in the lineup for one game.Braves: C A.J. Pierzynski is unlikely to play in the doubleheader after getting hit by a pitch in the knee and fouling a ball off his ankle Friday.UP NEXTCardinals: RHP John Lackey (13-9) will start the first game and is 1-0 with a 1.46 ERA in two career starts against the Braves. RHP Lance Lynn (12-10) will start the second game and is 2-2 with a 3.67 ERA in four career starts against Atlanta.Braves: RHP Shelby Miller (5-17) will pitch the first game and face his former team for the second time. He lost 1-0 at Busch Stadium on July 25. RHP Matt Wisler (7-8) will start the second. He beat the Cardinals 3-2 on July 26, his only career start against St. Louis. Share This Article | similar stories", "external_links": [], "published": "2015-10-04T08:11:00.000+03:00", "crawled": "2015-10-05T03:27:52.195+03:00", "highlightTitle": ""}