{"organizations": [], "uuid": "96437b2f5c5e18da11b76e49d1311e9e199d3c25", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.complex.com", "main_image": "http://images.complex.com/complex/image/upload/t_article_image/Untitled-1_yo549s.jpg", "site_section": "http://assets.complex.com/feeds/channels/sports.xml", "section_title": "sports", "url": "http://uk.complex.com/sports/2015/10/cc-sabathia-yankees-p-alcohol-rehab", "country": "US", "title": "CC Sabathia (Yankees P) to Check Himself Into Alcohol Rehab", "performance_score": 0, "site": "complex.com", "participants_count": 1, "title_full": "CC Sabathia (Yankees P) to Check Himself Into Alcohol Rehab | Complex UK", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T21:40:00.000+03:00", "replies_count": 0, "uuid": "96437b2f5c5e18da11b76e49d1311e9e199d3c25"}, "author": "Angel Diaz", "url": "http://uk.complex.com/sports/2015/10/cc-sabathia-yankees-p-alcohol-rehab", "ord_in_thread": 0, "title": "CC Sabathia (Yankees P) to Check Himself Into Alcohol Rehab", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "As the Yankees try their best not to crash and burn during their Wild Card Game tomorrow night against the Astros , they now must deal with a much more serious issue involving the ace of their pitching staff.\nCC Sabathia is coming off one of the worst seasons of his 15-year career. The struggling No. 1 starter went just 6-10 with a 4.73 ERA in 2015. His best stuff has clearly left him these last couple seasons, and he has struggled with that fact while on the mound. Now, it looks like those struggles have entered his off-the-field life as well as the Yankees just released a statement from Sabathia revealing that he is checking himself into alcohol rehab . You can read his full statement below:\n\"Today I am checking myself into an alcohol rehabilitation center to receive the professional care and assistance needed to treat my disease.\n\"I love baseball and I love my teammates like brothers, and I am also fully aware that I am leaving at a time when we should all be coming together for one last push toward the World Series. It hurts me deeply to do this now, but I owe it to myself and to my family to get myself right. I want to take control of my disease, and I want to be a better man, father and player.\n\"I want to thank the New York Yankees organization for their encouragement and understanding. Their support gives me great strength and has allowed me to move forward with this decision with a clear mind.\n\"As difficult as this decision is to share publicly, I don't want to run and hide. But for now please respect my family's need for privacy as we work through this challenge together. Being an adult means being accountable. Being a baseball player means that others look up to you. I want my kids—and others who may have become fans of mine over the years—to know that I am not too big of a man to ask for help. I want to hold my head up high, have a full hear and be the type of person again that I can be proud of. And that's exactly what I am going to do.\n\"I am look forward to being out of the field with my team next season playing the that brings me so much happiness.\"\nGet well, CC.\nSend all complaints, compliments, and tips to sportstips@complex.com .", "external_links": [], "published": "2015-10-05T21:40:00.000+03:00", "crawled": "2015-10-06T00:30:33.230+03:00", "highlightTitle": ""}