{"organizations": ["Sports Dodgers", "Los Angeles Dodgers", "New York Mets"], "uuid": "f3e7c34fc2c86c3da04ae29544726de282995703", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "http://s1.reutersmedia.net/resources/r/?m=02&d=20151019&t=2&i=1088160449&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB9I131", "site_section": "http://feeds.reuters.com/reuters/sportsNews", "section_title": "Reuters: Sports News", "url": "http://www.reuters.com/article/2015/10/19/us-baseball-dodgers-idUSKCN0SD23P20151019?feedType=RSS&feedName=sportsNews", "country": "US", "title": "Dodgers, and manager Mattingly, again under scrutiny", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "Dodgers, and manager Mattingly, again under scrutiny", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T21:08:00.000+03:00", "replies_count": 0, "uuid": "f3e7c34fc2c86c3da04ae29544726de282995703"}, "author": "", "url": "http://www.reuters.com/article/2015/10/19/us-baseball-dodgers-idUSKCN0SD23P20151019?feedType=RSS&feedName=sportsNews", "ord_in_thread": 0, "title": "Dodgers, and manager Mattingly, again under scrutiny", "locations": ["USA", "CA", "Los Angeles"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Don Mattingly", "Mattingly"], "text": "Related: Sports Dodgers, and manager Mattingly, again under scrutiny October 15, 2015; Los Angeles, CA, USA; Los Angeles Dodgers manager Don Mattingly (8) reacts following the 3-2 loss against New York Mets in game five of NLDS at Dodger Stadium. Mandatory Credit: Jayne-Kamin Oncea-USA TODAY Sports \n(This version of the October 16th story makes clear in 19th paragraph the Dodgers are owned by Guggenheim Baseball Management, not Guggenheim Partners) \nBy Mark Lamport-Stokes \nLOS ANGELES (Reuters) - Having again failed to reach the World Series with Major League Baseball's biggest payroll, the Los Angeles Dodgers face intense scrutiny over the coming days with manager Don Mattingly's position looking tenuous. \nThe Dodgers' 3-2 loss to the New York Mets in the decisive fifth game of the National League Division Series on Thursday marked the second season in a row they have exited the playoffs at the first hurdle. \nWhile they have reached the postseason three times during Mattingly's five years in charge and have won three straight NL West titles, they have clinched just one playoff series in that span. \nFor diehard Dodgers fans, that is barely worth celebrating given that their team's record payroll increased to more than $300 million for this season, consequently driving their lofty expectations for the 'The Boys in Blue' even higher. \nMattingly has achieved a .551 winning percentage, better than any Dodgers manager since Walter Alston, but of the four managers in Los Angeles with at least 10 postseason games in the last 60 years, he is the only one with a losing record (8-11). \nFor Mattingly, there was no way \"to soften that blow\" after the Dodgers were ultimately outplayed by the Mets in their best-of five NL Division Series. \n\"It's just disappointing,\" Mattingly said after a Game Five that was decided by Daniel Murphy's go-ahead home run in the sixth inning. \n\"There are really no words to describe how you feel. You come to Spring Training, you work all winter, you scratch, you fight all year long to get into this situation and you have a chance. \n\"It comes to a crash. It doesn't matter if you expect it or whatever ... it's disappointing no matter what the situation is. I don't think there is anyway to soften that blow.\" \nMANAGERIAL FUTURE \nIn the aftermath of that defeat, Mattingly was not prepared to talk about his managerial future. \nAsked during the post-game news conference where Thursday's loss had left him in terms of coming back to the Dodgers next year, he replied: \"Seriously, you're asking me that now?\" \nThe Dodgers won the most recent of their six MLB championship titles a distant 27 years ago and Mattingly's plight is not helped by the fact that he was not hired by the club's new president of baseball operations, Andrew Friedman. \nHowever, Mattingly was given plenty of support in the Dodgers locker room as the players were striving to come to terms with the shuddering halt to another season. \n\"We didn't lose because of Donnie,\" said utility player Enrique Hernandez,. \"We lost because we couldn't score runs. Donnie has nothing to do with this. There's no reason Donnie has to be fired.\" \nReliever J.P. Howell said: \"The expectations are World Series or fail, and that's throughout the whole season ... he's done a great job of when it's not going so well. He's always cool to be around.\" \nThird baseman Justin Turner told reporters he would play for Mattingly \"any day of the week\", adding: \"Anything he wanted me to do, anything he asked of me, I'm right there, I'm behind him 100 percent. \n\"I think he's an unbelievable manager, and did an unbelievable job handling everything that goes on both on and off the field with this club.\" \nAs for a final decision on Mattingly's future with the Dodgers, that will be made by Friedman. \n\"You can't hire guys like that (Friedman) and then make the decisions for them,\" said Mark Walter, the controlling partner in Guggenheim Baseball Management, which owns the Dodgers franchise. \n(Editing by Frank Pingue)", "external_links": [], "published": "2015-10-19T21:08:00.000+03:00", "crawled": "2015-10-19T21:31:51.922+03:00", "highlightTitle": ""}