{"organizations": [], "uuid": "77e17c98ec5ec0a157f78b99ac4a961eff595fd1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "sports.dailymirror.lk", "main_image": "", "site_section": "http://sports.dailymirror.lk/feed/rss/", "section_title": "Mirror Sports", "url": "http://sports.dailymirror.lk/2015/10/18/james-could-miss-rest-of-pre-season-with-sore-back/", "country": "US", "title": "James could miss rest of pre-season with sore back", "performance_score": 0, "site": "dailymirror.lk", "participants_count": 1, "title_full": "James could miss rest of pre-season with sore back", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T08:23:00.000+03:00", "replies_count": 0, "uuid": "77e17c98ec5ec0a157f78b99ac4a961eff595fd1"}, "author": "fazlan", "url": "http://sports.dailymirror.lk/2015/10/18/james-could-miss-rest-of-pre-season-with-sore-back/", "ord_in_thread": 0, "title": "James could miss rest of pre-season with sore back", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "James could miss rest of pre-season with sore back AFP Published : 10:53 am October 18,   27 reads | \nCleveland Cavaliers star LeBron James might not play the remainder of the NBA pre-season, coach David Blatt said, due to back pain that reportedly prompted James to have an anti-inflammatory injection. \nJames missed his second game in a row Thursday when the Cavaliers lost to Indiana 107-85 and ESPN reported Friday that the star player, who missed several games last season with back issues, received an injection as a precaution ahead of a planned rest period before the team opens the season October 27 against Chicago. \n“We’re really happy with how LeBron came into camp. Came in great shape,” Blatt said. \n“We want to take good care of him for the start of the season. As you know in his great and storied career, he has amassed a lot of miles. We’re trying to keep those pre-season miles to a minimum.” \nCleveland has two more pre-season games and a week between the last one and the opener. \n“I certainly don’t expect him to play both games and I don’t know if he’ll even play one,” Blatt said. “We’ll see.” \nJames, 30, enters his 13th NBA season averaging 11.0 points, 3.5 rebounds and 4.0 assists in two pre-season games with a Cavaliers team that has few healthy starters. \nThe Cleveland injury list includes Kyrie Irving (knee surgery), Iman Shumpert (wrist surgery), Kevin Love (shoulder surgery), J.R. Smith (hamstring), Australian Matthew Dellavedova (sore ankle) and Russian Timofey Mozgov (knee surgery). \nIn addition, Anderson Varejao is still recovering from surgery last year and Tristan Thompson is still out in a contract dispute. \n“The most important thing for us now is to get healthy, to do the work that we can do in the games but not at the risk of players being ready to go when the curtain comes up,” Blatt said.", "external_links": [], "published": "2015-10-18T08:23:00.000+03:00", "crawled": "2015-10-18T08:20:53.893+03:00", "highlightTitle": ""}