{"organizations": [], "uuid": "97667fb591bc9ee8bafcc625adcf689f4d05adae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/47529300.cms", "site_section": "http://timesofindia.indiatimes.com/rssfeeds/4719148.cms", "section_title": "The Times of India Sports: Extensive sports coverage, key statistics and free downloads", "url": "http://timesofindia.indiatimes.com/sports/off-the-field/Meeting-Pele-was-a-dream-come-true-A-R-Rahman/articleshow/49352621.cms", "country": "IL", "title": "Meeting Pele was a dream come true: A R Rahman", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "Meeting Pele was a dream come true: A R Rahman - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T19:42:00.000+03:00", "replies_count": 0, "uuid": "97667fb591bc9ee8bafcc625adcf689f4d05adae"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/sports/off-the-field/Meeting-Pele-was-a-dream-come-true-A-R-Rahman/articleshow/49352621.cms", "ord_in_thread": 0, "title": "Meeting Pele was a dream come true: A R Rahman", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MUMBAI: Oscar-winning composer AR Rahman says meeting Brazilian football legend Pele for his biopic was like a surreal moment for him. \n\nRahman, who is composing music for the upcoming movie \"Pele\", met the \"King of Football\" at an event in Kolkata and said it was an honour to do his film. \n\n\"Pele is a big legend in sports, and doing his movie is such a big honour. Meeting him was a bigger honour... It was fantastic and a dream come true. I also met the chief minister of West Bengal (Mamata Banerjee). Meeting 'Prince of Kolkata' Sourav Ganguly was an icing on the cake,\" he told reporters here. \n\nRahman says the music of the biographical film will be edgy and it will still retain the Brazilian touch. \n\n\"It's very edgy I would say, from the making, it's from the school of Danny Boyle ('Slumdog Millionaire' fame), but it's very Pele. It has a Brazilian influence and I loved it,\" the 48-year-old musician said. \n\nThe composer, who has been dabbling both into Indian and western music post his double-win at the Oscars for \"Slumdog Millionaire\", said the song \"Jai Ho\" happened at his lowest phase of his life and took him to great heights. \n\n\"'Jai Ho' was a period of ups and downs. 2008 was the Mumbai shooting, there was flood in my studio, there were a lot of negative things which were happening. I lost my engineer, so it was the lowest point in my life, probably after my father's death,\" he said. \n\n\"Later I went to Los Angeles for promotion of 'Slumdog Millionaire' where all the highs happened... Winning the Golden Globe, getting the nomination... I think it's an interesting thing to examine life and where its graph takes you,\" he said. \n\nWritten and directed by Jeff Zimbalist, \"Pele\" stars Kevin de Paula, Vincent D'Onofrio, Rodrigo Santoro, Diego Boneta and Colm Meaney. Stay updated on the go with Times of India News App. Click here to download it for your device.", "external_links": [], "published": "2015-10-14T19:42:00.000+03:00", "crawled": "2015-10-15T00:39:32.824+03:00", "highlightTitle": ""}