{"organizations": [], "uuid": "144b977d12b5f181c110805d47514e74d3a31c51", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wpxi.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/08/6d/45/cfbdaba5a84b46c789e9acb4565fa835-74b8cfa9def145029c901d50d6b70020-0_1.jpg", "site_section": "http://www.wpxi.com/feeds/categories/sports/", "section_title": "News | Sports", "url": "http://www.wpxi.com/ap/ap/sports/johnson-has-2-td-receptions-leads-colts-over-texan/nnySw/", "country": "US", "title": "Johnson has 2 TD receptions, leads Colts over Texans 27-20", "performance_score": 0, "site": "wpxi.com", "participants_count": 0, "title_full": "Johnson has 2 TD receptions, leads Colts over Texans 27-20", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T10:00:00.000+03:00", "replies_count": 0, "uuid": "144b977d12b5f181c110805d47514e74d3a31c51"}, "author": "", "url": "http://www.wpxi.com/ap/ap/sports/johnson-has-2-td-receptions-leads-colts-over-texan/nnySw/", "ord_in_thread": 0, "title": "Johnson has 2 TD receptions, leads Colts over Texans 27-20", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Updated: 3:00 a.m. Friday, Oct. 9, 2015 | Posted: 3:00 a.m. Friday, Oct. 9, 2015 Johnson has 2 TD receptions, leads Colts over Texans 27-20 Related View Larger Indianapolis Colts' Andre Johnson (81) celebrates with teammate Matt Hasselbeck (8) after they connected for on a touchdown pass during the second half of an NFL football game against the Houston Texans, Thursday, Oct. 8, 2015, in Houston. (AP Photo/Patric Schneider) View Larger Houston Texans' Ryan Mallett (15) reacts after a late hit from Indianapolis Colts' Sio Moore (51) during the first half of an NFL football game Thursday, Oct. 8, 2015, in Houston. Mallett left the game after the play. (AP Photo/Patric Schneider) Indianapolis Colts' Andrew Luck, left, who is out injured, talks to teammates on the sideline during the first half of an NFL football game against the Houston Texans, Thursday, Oct. 8, 2015, in Houston. (AP Photo/Patric Schneider) Sponsored Links \nIndianapolis coach Chuck Pagano isn't sure when Andrew Luck can play again. \nNot to worry though. He's got the ageless Matt Hasselbeck to fill in. \nAndre Johnson caught two touchdown passes from the 40-year-old Hasselbeck, the second for 2 yards in the fourth quarter, to help the Colts beat the Houston Texans 27-20 on Thursday night. \n\"Got the best backup in the league right now,\" Pagano said. \"We could argue that.\" \nReleased by Houston in March after 12 seasons with the team, Johnson had six catches for 77 yards. \nHasselbeck won his second straight game filling in for Luck, who was out with a shoulder injury. \nHasselbeck's performance was even more impressive given the fact that he was battling a bacterial infection that hospitalized him this week. He started feeling ill just before halftime Sunday in a victory over Jacksonville and didn't start feeling better until Thursday night. \n\"I honestly feel like this isn't even real right now,\" Hasselbeck said. \nPagano raved about Hasselbeck. \n\"He was literally on his deathbed Monday/Tuesday and mustered up enough to come in Wednesday and practice,\" Pagano said. \"He was getting IVs and fighting a virus and the grittiest performance I've seen in a long, long time.\" \nBrian Hoyer, who replaced Ryan Mallett for Houston (1-4) in the second quarter, threw a pass up for grabs that was intercepted by Mike Adams with less than 2 minutes left to help the Colts (3-2) seal the victory. \nSome things to know about the Colts' win over the Texans. \nQUARTERBACK CAROUSEL: Mallett got the wind knocked out of him on an illegal hit midway through the second quarter and was replaced by Hoyer. Mallett was OK soon after that, but coach Bill O'Brien stuck with Hoyer, who finished with 312 yards passing with two touchdowns. Hoyer won the starting job out of camp but was benched after Week 1. He came in late in last week's loss Atlanta, but O'Brien started Mallett again on Thursday. After the game he wouldn't say who will direct the offense going forward. \n\"We'll review (the film) tomorrow and see where we are at that position,\" O'Brien said. \nMIXED RECEPTION: Johnson, who is Houston's career receiving leader, drew boos from the home crowd when he grabbed a 23-yard reception late in the first quarter. Two plays later, he scored his first touchdown of the season when he was wide open in the back of the end zone for 4-yard reception that made it 10-0. Johnson laughed about the early boos and said the crowd warmed up to him later. \"When I would be on the sidelines a lot of the fans were screaming, 'Andre we still love you! Come back to Houston! Welcome home!'\" Johnson said. \"So that was probably the most special thing.\" \nA STRONG GAME: Houston rookie Jaelen Strong had his first two NFL receptions and they were both for touchdowns. Hoyer's desperation throw on the last play of the first half that Strong pulled down in a sea of Indianapolis defenders for a 42-yard touchdown strike cut the lead to 13-10. Strong boxed out two defenders and outjumped the others to reel in his first NFL catch. Strong's second catch and touchdown came on an 11-yard pass by Hoyer to get Houston to 20-17 in the third quarter. \nSTREAKING: The Colts extended their AFC South winning streak to an NFL-record 16 games. It's the longest such streak since the 1972-73 Dolphins won 15 in a row. It began with a win over Houston to end the 2012 season, a game that marked the return of Pagano to the sideline after he missed 12 games while he battled leukemia. \"We gave everybody a game ball from this one,\" Pagano said. \"We could have given out some individual ones but to surpass the only team in the NFL that had a perfect season ... and hold that record now that is something that every man on this football team and everybody in our organization can share.\" \n___ \nAP NFL website: www.pro32.ap.org and www.twitter.com/AP_NFL Copyright The Associated Press Sign up for our WPXI-TV Daily Headlines Newsletter Sign Up", "external_links": [], "published": "2015-10-09T10:00:00.000+03:00", "crawled": "2015-10-09T10:14:41.132+03:00", "highlightTitle": ""}