{"organizations": [], "uuid": "3a845ec0372e825f7c329eeb0c9f83f4e9bbb178", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "http://images.tribuneindia.com/cms/gall_content/2015/10/2015_10$largeimg12_Monday_2015_021416756.jpg", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/sport/sochi-high-for-hamilton/144975.html", "country": "US", "title": "Sochi high for Hamilton", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "Sochi high for Hamilton", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "3a845ec0372e825f7c329eeb0c9f83f4e9bbb178"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/sport/sochi-high-for-hamilton/144975.html", "ord_in_thread": 0, "title": "Sochi high for Hamilton", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sochi, October 11\nLewis Hamilton won a dramatic Russian Formula One Grand Prix on Sunday to take a huge step towards his third world championship after Mercedes teammate Nico Rosberg retired early on with throttle failure. The win was Hamilton’s ninth of the season, and the 42nd of his career, and the Briton’s untroubled afternoon was a stark contrast to his German team mate’s woes. Ferrari’s Sebastian Vettel finished runners-up at the Olympic Park circuit to overtake Rosberg as Hamilton’s closest rival, 66 points adrift of the Briton with four races and a maximum 100 points remaining. If results go Hamilton’s way, he can secure his second successive title in Austin, Texas, in two weeks’ time. Hamilton, who also won the inaugural Russian Grand Prix last year and has now surpassed late triple champion Ayrton Senna, now has 302 points to Vettel’s 236 and Rosberg on 229. Perez claims rare podium for Force India Sergio Perez secured Sahara Force India’s only third podium place in Formula One history by finishing third. Force India have enjoyed only two podium places before and incidentally the last time also it was Perez who stepped onto the podium for the team at Bahrian Grand Prix in 2014. The first-ever podium for the team was secured by Giancarlo Fisichella, who had finished second in the 2009 Belgian Grand Prix from pole position. Mercedes win second constructors’ title Mercedes won their second successive Formula One constructors’ title on Sunday after Ferrari’s Kimi Raikkonen was penalised for causing a collision. The Finn had finished fifth in the Russian Grand Prix won by Mercedes’ Lewis Hamilton but picked up a 30-second penalty that dropped him to eighth place and meant Mercedes had mathematically clinched the title with four races to spare. — Reuters", "external_links": [], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-12T00:14:57.141+03:00", "highlightTitle": ""}