{"organizations": ["U.S. Department of Energy", "Lawrence Berkeley National Laboratory"], "uuid": "bd9208fe0c407be9a8f3ed1de25f98bbc0581c8d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.onenewspage.com", "main_image": "http://cdn.newsserve.net/ONPglobe256.jpg", "site_section": "http://www.onenewspage.com/rss/latest/Sports.rss", "section_title": "Latest Sports News on One News Page", "url": "http://www.onenewspage.com/n/Sports/7559y4k6y/New-laser-find-offers-next-generation.htm", "country": "US", "title": "New 2-D laser find offers next-generation photonic devices", "performance_score": 0, "site": "onenewspage.com", "participants_count": 0, "title_full": "New 2-D laser find offers next-generation photonic devices", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T10:23:00.000+02:00", "replies_count": 0, "uuid": "bd9208fe0c407be9a8f3ed1de25f98bbc0581c8d"}, "author": "", "url": "http://www.onenewspage.com/n/Sports/7559y4k6y/New-laser-find-offers-next-generation.htm", "ord_in_thread": 0, "title": "New 2-D laser find offers next-generation photonic devices", "locations": ["Berkeley Lab", "Washington D.C"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Zhang", "Xiang Zhang"], "text": "New 2-D laser find offers next-generation photonic devices Sunday, 25 October 2015 (15 minutes ago) *Washington D.C, Oct 25 (ANI): An important step towards next-generation ultra-compact photonic and optoelectronic devices has been taken with the realization of a two-dimensional excitonic laser.* Washington D.C, Oct 25 (ANI): An important step towards next-generation ultra-compact photonic and optoelectronic devices has been taken with the realization of a two-dimensional excitonic laser. Scientists with the U.S. Department of Energy (DOE)'s Lawrence Berkeley National Laboratory (Berkeley Lab) embedded a monolayer of tungsten disulfide into a special microdisk resonator to achieve bright excitonic lasing at visible light wavelengths. The observation of high-quality excitonic lasing from a single molecular layer of tungsten disulfide marks a major step towards two-dimensional on-chip optoelectronics for high-performance optical communication and computing applications, says leader Xiang Zhang. Among the most talked about class of materials in the world of nanotechnology today are two-dimensional (2D) transition metal dichalcogenides (TMDCs). These 2D semiconductors offer superior energy efficiency and conduct electrons much faster than silicon. Furthermore, unlike graphene, the other highly touted 2D semiconductor, TMDCs have natural bandgaps that allow their electrical conductance to be switched \"on and off,\" making them more device-ready than graphene. Tungsten disulfide in a single molecular layer is widely regarded as one of the most promising TMDCs for photonic and optoelectronic applications. However, until now, coherent light emission, or lasing, considered essential for \"on-chip\" applications, had not been realized in this material. \"TMDCs have shown exceptionally strong light-matter interactions that result in extraordinary excitonic properties,\" Zhang says. The study appears in Nature Photonics. (ANI)", "external_links": [], "published": "2015-10-25T10:23:00.000+02:00", "crawled": "2015-10-25T10:35:47.795+02:00", "highlightTitle": ""}