{"organizations": [], "uuid": "ce9101a96aab17b55693436f2931a9fc51d30539", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.startribune.com", "main_image": "http://stmedia.stimg.co/010flip.gal.jpg?h=630&amp;w=1200&amp;fit=crop&amp;bg=999&amp;crop=faces", "site_section": "http://www.startribune.com/sports/index.rss2", "section_title": "Sports", "url": "http://www.startribune.com/souhan-farewell-to-a-garage-shooter-who-embraced-his-years-in-minnesota/336910091/", "country": "US", "title": "Souhan: Farewell to a garage shooter who embraced his years in Minnesota", "performance_score": 0, "site": "startribune.com", "participants_count": 1, "title_full": "Souhan: Farewell to a garage shooter who embraced his years in Minnesota - StarTribune.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T21:39:00.000+02:00", "replies_count": 0, "uuid": "ce9101a96aab17b55693436f2931a9fc51d30539"}, "author": "Jerry Holt, Star Tribune", "url": "http://www.startribune.com/souhan-farewell-to-a-garage-shooter-who-embraced-his-years-in-minnesota/336910091/", "ord_in_thread": 0, "title": "Souhan: Farewell to a garage shooter who embraced his years in Minnesota", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I won’t pretend I knew Flip Saunders well. We were just getting to like each other when he was stricken.\nIn my limited gallery of personal snapshots of Flip, I’ll remember two, the agony and the ecstasy of being a basketball boss and a basketball lifer.\nWhen the Timberwolves landed the top pick in the 2015 NBA draft, Flip cried, partly because he had just lost his father, partly because he knew what such a stroke of fortune for the luckless Wolves would mean for his father’s son.\nA few weeks later, I ran into Flip in the Skyway outside the Timberwolves’ offices. He was heading to work. I was heading to Target Field. He offered his hand and stopped to offer a scouting breakdown on his options with the first pick. The conversation was brief and off the record. His joy — yes, joy — at presiding over perhaps the most promising era in franchise history was obvious. He was in his element.\nFlip’s life is a reminder that there is a story behind every coach, and general manager, we observe. Flip’s was remarkable.\nA friend of mine calls suburban basketball players “Garage shooters,” because that’s what we did when we were young — shoot at baskets attached to garages. Flip grew up a garage shooter in Ohio, but he wasn’t the stereotypical suburban jump-shooter.\nHe developed a handle that made him an excellent college point guard with the Gophers, and a basketball intellect that led naturally to coaching.\nHe earned his old-school Converse stripes in the Continental Basketball Association, handling menial tasks and riding buses when he wasn’t drawing up plays, and his hunger for the big time only grew.\nHe wowed ’em in Williams Arena as a player and he helped bring unprecedented success to Target Center after he took over as coach of an awful Wolves franchise.\nAs a coach, he presided over the franchise’s only successes, and may have had a chance at an NBA championship if Sam Cassell hadn’t pantomime-juggled his way into an injury. As a prodigal boss, Flip presided over the most promising year in franchise history, trading Kevin Love for Andrew Wiggins and taking Karl-Anthony Towns with the first pick in this year’s draft.\nFlip was endearing this time around because everything seemed to mean so much to him — the direction of the franchise, the development of young players, the perception of his staff, the Wolves’ place in the local sports scene.\nHe never stopped caring about the Gophers, either, hanging around Williams Arena while in semi-retirement, offering whatever support he could to Tubby Smith.\nThe Timberwolves have spent decades giving nepotism a bad name. This time around, under Flip, putting the band back together didn’t seem like such a bad idea. Anyone Flip valued was going to be better than the people the Wolves had hired in his absence.\nFlip had become “one of us” in the best of ways. He loved the University of Minnesota. He loved the underrated and larger-than-you think basketball community. He loved living here and raising his family here. He wanted to bring an NBA championship here.\nThe garage shooter had big dreams and it is sad he didn’t get a chance to see if he could pull off the grandest of them.\nJim Souhan’s podcast can be heard at MalePatternPodcasts.com . On", "external_links": ["http://www.twitter.com/SouhanStrib"], "published": "2015-10-25T21:39:00.000+02:00", "crawled": "2015-10-25T22:43:41.099+02:00", "highlightTitle": ""}