{"organizations": ["Little Giants"], "uuid": "48ea29ab2d05a811850de6cdac018a3664add543", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thenews-messenger.com", "main_image": "http://www.gannett-cdn.com/-mm-/4d98fed7fad0670dc03586a7083cfabee2446770/c=0-35-679-419&amp;r=x633&amp;c=1200x630/local/-/media/2015/09/30/OHGroup/Fremont/635792148215619124-QB-change.jpg", "site_section": "http://rssfeeds.thenews-messenger.com/fremont/highschoolsports", "section_title": "Fremont - HIgh School Sports", "url": "http://www.thenews-messenger.com/story/sports/high-school/2015/09/30/oak-harbor-makes-statement-clyde/73129790/", "country": "US", "title": "QB change alone can't cure Ross' ills", "performance_score": 0, "site": "thenews-messenger.com", "participants_count": 0, "title_full": "QB change alone can't cure Ross' ills", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T03:39:00.000+03:00", "replies_count": 0, "uuid": "48ea29ab2d05a811850de6cdac018a3664add543"}, "author": "", "url": "http://www.thenews-messenger.com/story/sports/high-school/2015/09/30/oak-harbor-makes-statement-clyde/73129790/", "ord_in_thread": 0, "title": "QB change alone can't cure Ross' ills", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Russ Yeast", "John", "Rich McGowan", "Ross"], "text": "QB change alone can't cure Ross' ills Rich McGowan , Reporter 8:39 p.m. EDT September 30, 2015 Buy Photo Fremont Ross quarterback Russ Yeast runs away from pressure from a St. John's defender during the Little Giants' Week 4 loss to the Titans. (Photo: Molly Corfman/News-Messenger) Buy Photo CONNECT 2 TWEET LINKEDIN COMMENT EMAIL MORE \nFREMONT — Friday night, Fremont Ross will have a different starting quarterback than that of its first five games, but the Little Giants are not embarking on a quarterback controversy. \nYes, either Jarren Hampton or Boston Swaisgood will line up under center Friday as Ross hosts Toledo Central Catholic, but don’t think of it as a benching of quarterback Russ Yeast. \nIt’s more like pulling the goalie after a four-goal first period in hockey. The goals may not just the goaltenders’ fault, but a change-up in the pipes might snap the rest of the team in front of him into focus. \nThat is what coach Craig Yeast is hoping happens Friday night. \n“It’s more to see if we can get a spark by trying to do something different,” Craig Yeast said. “Maybe we’ll block better. Maybe we’ll throw it better. Maybe we’ll run it better. I don’t know, but we need to try to do something.” Buy Photo \nFremont Ross quarterback Russ Yeast throws a pass against St. John's defense during the Little Giants' Week 4 loss to the Titans. (Photo: Molly Corfman/News-Messenger) \nThrough the first five games of the season, whoever was playing quarterback wasn’t going to make a lot of difference. Whether it has been Yeast, Hampton or Swaisgood in the backfield, there hasn’t been enough protection for any of them to be effective. \nThe offensive line has allowed more people through it than the turnstiles on a busy day at Cedar Point. Receivers have run the wrong routes and dropped passes at crucial times. Running backs have not always picked up their blocking assignments. \nIt’s an issue that goes far beyond the simple matter of who plays quarterback. \n“A lot of people blame the line or the quarterback play, but at this point, it’s everybody,” Hampton said. \nRuss Yeast, and certainly his father and coach, will be the first ones to tell you the junior receiver-turned-quarterback has not been perfect under center. But he was never going to be. Changing positions is never easy and becoming a quarterback is the hardest adjustment to make. \nBut he has had little chance to survive, let alone have any degree of success. \nSo now Yeast will line up on the outside and give the Little Giants a dynamic receiver who’ll run clean routes. Ross will continue to give its nice collection of running backs opportunities to make plays on the ground. \nBut whether or not the switch works will have less to do with who is taking the snap and more to do with how the entire offense functions as a whole. Read or Share this story: http://ohne.ws/1KMWLD5 TOP VIDEOS", "external_links": [], "published": "2015-10-01T03:39:00.000+03:00", "crawled": "2015-10-01T06:33:04.243+03:00", "highlightTitle": ""}