{"organizations": [], "uuid": "5bc0dc5e35de0a7cb591dde0282d1e4b72f7cf12", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "universe.byu.edu", "main_image": "http://universe.byu.edu/wp-content/uploads/2015/10/DSC_1587.jpg", "site_section": "http://universe.byu.edu/index.php/category/sports/feed", "section_title": "U N I V E R S E » Sports", "url": "http://universe.byu.edu/2015/10/24/byu-blasts-wagner-college-70-6/", "country": "US", "title": "BYU blasts Wagner College 70-6", "performance_score": 0, "site": "byu.edu", "participants_count": 1, "title_full": "BYU blasts Wagner College 70-6", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T02:09:00.000+02:00", "replies_count": 0, "uuid": "5bc0dc5e35de0a7cb591dde0282d1e4b72f7cf12"}, "author": "Brennan Edwards", "url": "http://universe.byu.edu/2015/10/24/byu-blasts-wagner-college-70-6/", "ord_in_thread": 0, "title": "BYU blasts Wagner College 70-6", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BYU blasts Wagner College 70-6 By Brennan Edwards on October 24, 2015. BYU freshman running back Francis Bernard runs the ball in the game against Wagner College on Saturday. Bernard had one touchdown and 54 yards during the game. (Natalie Bothwell) \nThe BYU football team defeated the Wagner College Seahawks 70-6 in an expected win Saturday afternoon. \nIt only took the Cougars 1:13 to earn their first touchdown of the day when quarterback Tanner Mangum threw a 16-yard pass to Colby Pearson. The Cougars marched down the field 75 yards in only four plays, almost effortlessly, on their first possession. \n“The team responded and, I think, improved,” BYU head coach Bronco Mendenhall said. \nThe Cougars seemed to move the ball and score touchdowns at will. BYU was on top of Wagner 28-0 in just the first quarter. BYU scored a touchdown on all 10 of its possessions of the game. This was the first time that BYU has scored at least 70 points in a game since 2001. \nRunning back Algernon Brown broke open the running game by amassing 109 yards on just six carries and two touchdowns in the first quarter. The BYU running game eclipsed its season high in the first half as well. The Cougars finished the first half with 220 yards and four touchdowns on the ground. \nFreshman quarterback Beau Hoge relieved Mangum with just over eight minutes left in the second quarter. Mangum completed 12 passes on 13 attempts for 237 yards, three touchdowns and no interceptions. Hoge is considered to be a dual-threat quarterback and he showed his ability to run the ball throughout the game. \n“I felt prepared for the game,” Hoge said after the victory. “Coach Anae did a good job preparing me for the week.” \nThe Cougars were rolling as the first half came to a close and BYU was up 49-0. \nThe offensive and defensive backups for BYU began to enter the game heading into the third quarter. Hoge continued to play into the fourth quarter when he was replaced by freshman quarterback Koy Detmer Jr. \nHoge finished the game 8-11 passing for 117 yards and one touchdown. He also added 49 yards on the ground for two touchdowns. \n“(We) worked really hard during the week and we got a chance to play a lot of younger players,” Mendenhall said. \nThe backups stepped up and scored 28 points in the second half. Junior David Kessler and sophomore Trey Dye led all receivers with 78 yards and 55 yards respectively. Senior running back Nate Carter came through on the ground for the Cougars in the second half with 105 yards rushing and a touchdown. The backup quarterbacks combined for 11-14 passing for 164 yards and one touchdown. \n“To me, it doesn’t matter who we play, what time of day we play or where we play,” Dye said. “Once we step on the field it’s time to go and focus on our own responsibilities. Today was a great opportunity for a guy like myself to focus on my technique and get some good experience.” \nIt was a day of many firsts since the Cougar backups played the majority of the game. Hoge recorded his first rushing and passing touchdown as a BYU quarterback, Detmer completed his first pass as a BYU player and Kessler had his first receiving touchdown. \nThe defense was led by senior linebacker Manoa Pikula with six total tackles. He was followed by sophomore defensive back Jordan Preator who had five total tackles. The defense held the Seahawks to only six points for the game and recorded a blocked PAT and an interception. \n“We always want to try to start out strong, whether it’s the beginning of the game or as we come out after halftime,” Pikula said. “We kept our energy up all game and kept executing.” \nBYU recorded 741 total yards on the game. The Cougars tallied a season high of 330 yards rushing and six touchdowns on the ground. The Cougars proved to be highly efficient through the air by completing 23 passes on 27 attempts for 411 yards and four touchdowns. \nThe Cougars will have a two week break before they travel to play San Jose State on Nov. 6. The two weeks will give the Cougars a chance to heal and regroup before they finish off the season. Author's latest posts Brennan Edwards Brennan Edwards is a junior at BYU majoring in Public Relations covering football and swimming. He is pursuing a career in corporate communication. Latest posts by Brennan Edwards ( Posts )", "external_links": [], "published": "2015-10-25T02:09:00.000+02:00", "crawled": "2015-10-25T02:25:43.744+02:00", "highlightTitle": ""}