{"organizations": [], "uuid": "6e53f6551616febfc2f7872709b13a5ec9795bd9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cantonrep.com", "main_image": "http://www.cantonrep.com/storyimage/OH/20151014/SPORTS/151019688/AR/0/AR-151019688.jpg", "site_section": "http://www.cantonrep.com/sports?template=rss&mime=xml", "section_title": "Sports - The Repository", "url": "http://www.cantonrep.com/article/20151014/SPORTS/151019688/2000/NEWS?rssfeed=true", "country": "US", "title": "Joe Scalzo: Central golfers satisfied with nothing but the best", "performance_score": 0, "site": "cantonrep.com", "participants_count": 1, "title_full": "Joe Scalzo: Central golfers satisfied with nothing but the best", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T21:00:00.000+03:00", "replies_count": 0, "uuid": "6e53f6551616febfc2f7872709b13a5ec9795bd9"}, "author": "Joe Scalzo", "url": "http://www.cantonrep.com/article/20151014/SPORTS/151019688/2000/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "Joe Scalzo: Central golfers satisfied with nothing but the best", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Oct. 14, 2015 at 1:00 PM » RELATED CONTENT • PHOTO GALLERY: Central Catholic @ Division II District Golf Central Catholic senior Jarrod Kasunick may only be a teenager — right down to the wispy mustache — but his game, and his brain, can seem much older. He dropped an Oscar Wilde quote into a conversation about his high school career like it was a 4-foot putt, waxing philosophical about the Crusaders’ disappointing finishes (by their standards) at the 2012 and 2013 state tournaments. “I think it was Oscar Wilde who said that experience is the name you give to your mistakes,” Kasunick said. “My freshman and sophomore year, we went to Columbus and played terrible. Then we went to Columbus last year and we tore it up. I think that experience helps us.” Lest you think he’s spending his free time reading 19th century Irish playwrights, Kasunick admitted he saw the quote on Facebook. Also, he has no idea who Oscar Wilde is. But as Wilde once said, “Experience is one thing you can’t get for nothing.” And Central coach Dave Oates thinks last year’s Division II state championship, as well as this year’s occasional struggles, will mean everything this weekend. “We shot a couple terrible rounds this year,” said Oates, whose team won last week’s district title to advance to the state tournament for the sixth straight year. “I think that’s kind of important. Guys were going through the motions and not focused on what they were doing, and that was a wake-up call for us. We learned that we can’t just show up and think we’re going to go out and be successful.” Oates, who doubles as the school’s principal, has sent 12 teams to the state tournament in his 19 seasons, so he knows how to handle teenagers’ games — and brains. But just as the best time to plant a tree is 20 years ago, the best time to develop a golfer is long before he reaches high school. Oates could see state championship potential when this year’s seniors arrived as freshmen. Kasunick and senior Ryan Mallette were in the top four on Central’s fourth-place team in 2013 — and while seniors Mark Mokros and Evan Jenkins took slightly longer to bloom, they’re good enough to be the No. 1 golfers on a lot of area teams. Both shot in the 70s at last week’s district tournament, where Central cruised to its third straight team title. If the Crusaders can play that way this weekend, they’ll capture their fourth state title in a county where only one other school (McKinley in 1943) has won one. What’s Central’s secret? Well, as Wilde once said, “Success is a science. If you have the conditions, you get the result.” Page 2 of 2 - “I think the biggest thing is, sometimes when you get down there for the first time, you see guys that haven’t been through it and they get overwhelmed at times,” Oates said. “You even see it at the district level. Teams get nervous and have a couple bad holes. Our guys know what they need to do, they know what to expect, they’re very familiar with the golf course and they know what it takes to be successful. “That’s a huge plus, not to be overwhelmed by the situation.” Still, golf is a fickle game. Rounds can be ruined by bad weather, not to mention bad thoughts. Oates can’t bail out his golfers by calling a blitz or switch to a 2-3 zone when things aren’t going their way. Most of the work is already done. He just tries to help his golfers make adjustments — physical and mental — and trust the process. “You can’t do a lot to change a swing, especially in the middle of a round, so you just try to calm them down and make them think about the next shot,” he said. “The most important thing you can do is boost their confidence and just keep encouraging them.” The Crusaders won last year’s state title by 24 shots and return four of their top five golfers — Drew Savage graduated — but Kasunick doesn’t see them as the favorites, even if everyone else does. “In a sense, you might actually think we’re the underdog because of how hard it is to repeat,” he said. “I don’t want to say we’re underdogs or frontrunners or anything. I don’t think about that. I just think about one shot at a time and whatever happens, happens.” Still, after a sometimes shaky regular season, they know they have a chance to do something special. Again. “This year’s team, we have four seniors and we want to go out with a win,” Mallette said. “We’re going to do whatever it takes.” Or, as Wilde once said, “I have the simplest tastes. I am always satisfied with the best.” Reach Joe at 330-580-8573 or joe.scalzo @cantonrep.com On Twitter: @jscalzoREP", "external_links": [], "published": "2015-10-14T21:00:00.000+03:00", "crawled": "2015-10-14T22:08:42.459+03:00", "highlightTitle": ""}