{"organizations": [], "uuid": "077581888e51516a0b8883a23ab0b47b451796de", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonpost.com", "main_image": "http://www.washingtonpost.com/blogs/football-insider/files/2015/10/HB-choice-1a.png", "site_section": "http://www.washingtonpost.com/rss/sports", "section_title": "Sports", "url": "https://www.washingtonpost.com/news/football-insider/wp/2015/10/08/a-closer-look-jamison-crowder-already-proving-valuable-on-third-downs/", "country": "US", "title": "A closer look: Jamison Crowder already proving valuable on third downs", "performance_score": 0, "site": "washingtonpost.com", "participants_count": 1, "title_full": "A closer look: Jamison Crowder already proving valuable on third downs", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T18:48:00.000+03:00", "replies_count": 0, "uuid": "077581888e51516a0b8883a23ab0b47b451796de"}, "author": "Mark Bullock", "url": "https://www.washingtonpost.com/news/football-insider/wp/2015/10/08/a-closer-look-jamison-crowder-already-proving-valuable-on-third-downs/", "ord_in_thread": 0, "title": "A closer look: Jamison Crowder already proving valuable on third downs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A closer look: Jamison Crowder already proving valuable on third downs Resize Text Comments 0 By Mark Bullock October 8 at 11:20 AM \nRedskins Coach Jay Gruden has made good on his promise; the best players will play. In the past, Washington has perhaps played certain players because of the size of their contract or their draft status. But Gruden and general manager Scot McCloughan have made good on their word that the best players will play, regardless of how much they are paid or how highly they were drafted. \nAgainst the Eagles, Washington benched Andre Roberts , who signed a four-year, $16 million contract in free agency of March 2014, and replaced him with fourth-round rookie Jamison Crowder. Roberts has struggled to make much of an impact since signing with the Redskins, dropping too many passes (two in three games this year, seven last season). Crowder stepped in and made an immediate impact, leading the team with seven catches for 65 yards against Philadelphia. \nCrowder was trusted early and often, especially on third downs. \nThis play comes on third and five. Crowder lines up in the slot stacked next to tight end Jordan Reed. The Eagles place a cornerback over him, but actually play zone coverage. Crowder runs a crossing route. \nWithout a corner trailing him, Crowder quickly recognizes the defense in zone coverage. He finds a gap between zones and stops his route, making him an easy target for quarterback Kirk Cousins. \nCrowder makes the simple catch for the first down and then turns up the field to pick up as many additional yards as possible. \nBeing able to identify the differences between zone and man coverage is key, particularly for a slot receiver. \nLater in the game, Crowder is asked to run the same crossing route. But this time, the Eagles play man coverage instead of zone. \nCrowder breaks sharply inside and feels the trailing corner, indicating man coverage. So instead of sitting down in a gap between zones, Crowder keeps running his crossing route towards the opposite sideline. Cousins makes a simple throw over the middle, which Crowder catches well short of the first down marker. But thanks to the route, Crowder is up to full speed. Eagles cornerback Eric Rowe attempted to peel off his receiver to come up and make the tackle, but Crowder’s speed was too much. \nCrowder manages to turn the corner and get up the sideline, picking up the first down before Rowe forces him out of bounds. \nBy proving he can read coverages and adapt his routes to them, Crowder quickly built trust with his quarterback. That trust was clearly visible on another third down catch by Crowder. \nHere, the Redskins face third and 13, a situation no offense wants to be in. Crowder lines up in the slot and runs a corner route, while the outside receiver runs a clearing route to vacate space for him. \nThe Eagles were in cover-three on this play. Crowder attempts to work underneath the clearing route, but the deep outside corner does a good job recognizing the threat. As Cousins releases the ball, the deep corner peels off the deep receiver and worked back to Crowder. \nThe 5-foot-8, 185 pound Crowder then pulls off an outstanding catch, leaping above two defenders and holding on through contact to convert the third down. \nMaking plays like that to bail out what wasn’t necessarily the best decision from Cousins will only help build trust between the two and keep him on the field. \nAfter the game, Gruden was asked if it was overstepping to say Crowder had won the slot receiver job. “No, that’s not overstepping. It was clear in the game, I think. Yeah, he’s definitely our slot receiver right now.” \nIt certainly was clear. What was also clear is that Crowder was getting open, even when he wasn’t being thrown to. \nThis play was another third-and-long situation. Washington uses Crowder, Reed and Ryan Grant on vertical routes in effort to clear space underneath for Pierre Garcon’s crossing route. \nThe play was designed purely to go to Garcon, which is where Cousins threw the ball. However, it’s also worth noting that Crowder’s speed allowed him to streak past the slot corner into open field. \nI don’t think it will be long before the Redskins are designing plays to get the ball to Crowder. He’s too quick and explosive not to get touches. Washington did try a few different plays to get the ball to Crowder on Sunday. \nHere, the Redskins ran, in essence, a play-action bootleg. Crowder lines up almost as a tight end and runs out into the flat. \nThis is a well-designed play, as Crowder was somewhat hidden from the Eagles’ secondary. He sifted back across the offensive line and burst out into the flat on the other side. Cousins didn’t need to look elsewhere on third and one, instead just dumping it off quickly to Crowder in the flat. The ball was a little softly thrown, forcing Crowder to stop and turn around to catch the ball. But he made the catch and still had plenty of space to pick up yards after the catch. \nThe Eagles did well to rally to the ball and knock Crowder out of bounds, but the damage was done. He converted yet another third down and kept the chains moving. \nPerhaps the most interesting play the Redskins ran with Crowder involved him lining up in the backfield. \nOn this play, we saw Crowder in the backfield with running back Alfred Morris lined up as a wide receiver. The Eagles’ defense clearly wasn’t expecting this, as they left a linebacker in coverage on Crowder, who ran a halfback choice route. \nCrowder is far too quick for most linebackers and it showed here. He got the linebacker to commit to the outside route before cutting inside. Unfortunately, Cousins was reading the route combination on the front side of the play and had already thrown the ball to Morris in the flat. \nCousins completed the pass to Morris in the flat, but had he been forced to work back to Crowder, he would have found Crowder wide open with room to work with in the middle of the field. \nCrowder showed against the Eagles that he is capable of winning one-on-one matchups with slot corners because of his quickness and explosiveness. Jordan Reed offers a similar threat against linebackers, which has made him one of the Redskins’ best targets on key third downs. With Reed going through the concussion protocol, there’s a chance he won’t be available against the Falcons. Crowder caught four of the nine successful third-down conversions against the Eagles. That could mean the Redskins might ask Crowder to step up again and be one of their ‘go-to’ receivers on third downs this Sunday. \nMark Bullock is The Insider’s Outsider , sharing his Redskins impressions without the benefit of access to the team. For more, click here . \nMore from The Post :", "external_links": [], "published": "2015-10-08T18:48:00.000+03:00", "crawled": "2015-10-08T18:56:08.882+03:00", "highlightTitle": ""}