{"organizations": [], "uuid": "c0227edbecda05e7977a3977626c6e7fb33deff8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wcax.com", "main_image": "http://wncontent.images.worldnow.com/images/4005312_G.jpg", "site_section": "http://www.wcax.com/category/38882/latest-health-news", "section_title": "Latest Health News - WCAX.COM Local Vermont News, Weather and Sports-", "url": "http://www.wcax.com/story/30196569/doctors-use-3d-printing-to-safeguard-baby-before-birth", "country": "US", "title": "Doctors use 3D printing to safeguard baby before birth", "performance_score": 0, "site": "wcax.com", "participants_count": 1, "title_full": "Doctors use 3D printing to safeguard baby before birth - WCAX.COM Local Vermont News, Weather and Sports-", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "c0227edbecda05e7977a3977626c6e7fb33deff8"}, "author": "wcax.com", "url": "http://www.wcax.com/story/30196569/doctors-use-3d-printing-to-safeguard-baby-before-birth", "ord_in_thread": 0, "title": "Doctors use 3D printing to safeguard baby before birth", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Tara Haelle\nHealthDay Reporter\n(HealthDay News) -- When Michigan doctors saw a large mass on the face of a fetus late in pregnancy, they feared it might block the baby's airway at birth.\nThe doctors didn't know what the abnormality was, or if the infant would need lifesaving care in order to breathe.\nUse of 3D printing technology removed the guesswork, the team reported in the Oct. 5 online edition of the journal Pediatrics .\nIt's the first time 3D printing technology has been used in utero \"to diagnose facial deformity and severity of airway risk with a newborn,\" said Dr. Albert Woo, a pediatric plastic surgeon at St. Louis Children's Hospital.\nThe problem surfaced when the mother-to-be, age 22, was 30 weeks into pregnancy.\nThe mother underwent an ultrasound, but the imaging did not provide enough information because of the way the fetus was positioned. She then underwent an MRI, but again the doctors couldn't be sure if the airways would be clear after birth.\nIf the airways were blocked, the newborn would need an intubation -- placement of a plastic tube into the windpipe -- at birth to help with breathing, doctors feared.\nA subsequent, specialized MRI captured more data that the University of Michigan doctors could use to build a 3D model. Then they printed a model of the fetal face with a 3D printer.\nThe model predicted a cleft lip and palate deformity -- without airway obstruction. The baby's delivery and discharge proceeded uneventfully, the report said.\nIn 3D printing, a special \"printing\" machine heats up plastic and follows a computer program's instructions to layer the plastic into a three-dimensional shape. Medical applications so far have included printing prosthetic limbs, medical supplies, models of jaws to use in reconstruction and other feats.\n\"In this specific instance where airway distress is a major possible issue, I think it potentially can help to revolutionize that field,\" said Woo, director of the 3D printing lab at Washington University School of Medicine in St. Louis.\n\"It really provides a new tool so that doctors are much better prepared to deal with airway problems or other congenital anomalies that they need to diagnose critically right when babies are born,\" he said.\nWoo, who was not involved with the study, said it's possible that looking at the 3D image on the screen might have been sufficient, but it is more difficult to grasp aspects of the physiology, such as scale.\n\"I would suggest that there's no replacement for being able to hold an object in your hand and have this tactile three-dimensional ability to assess something,\" Woo said. \"When you're actually holding a model of a skull, for example, in your hand, it's a whole different experience.\"\nThe use of 3D printing itself should not present any risks to patients, Woo said, but two potential downsides of the technology are its high cost and the potential for overuse.\nWoo estimated that the software used to create the model costs $10,000 to $20,000 annually.\nMedical-grade printers can range from several thousand dollars on the low end to hundreds of thousands of dollars for extremely precise high-end printers, said Dr. Oren Tepper, director of craniofacial surgery at Montefiore Health System in New York City.\nAs for the case involving the Michigan doctors, the serious nature of the possible emergency justified the use of a 3D-printed model, Tepper said.\n\"What really made it appropriate was the severity of the disease and the danger of not having an open airway after birth,\" said Tepper, who also played no role in this study.\nAs researchers and doctors discover more uses for 3D technology and costs drop, Tepper expects to see its acceptance spread.\n\"For myself, I learn a new thing each week and I learn a new application outside my specialty each week,\" said Tepper, who has used 3D-printed models to guide him in facial reconstruction.\n\"It's still finding its way into other industries and hasn't really figured out which way it will go, but one area I'm confident it's going to be routine in is medicine,\" he added.\nWoo agreed that people are only just beginning to realize the potential of 3D printing technology.\n\"It's surprising how quickly this technology has evolved and it's going to continue to evolve very rapidly,\" Woo said. \"There's a lot more that 3D printing can provide, not just for the medical industry but for our daily lives.\"\nMore information\nFor more on 3D printing in medicine, visit the U.S. National Institutes of Health ", "external_links": ["http://images.worldnow.com/Revenue/images/275529_G.jpg", "http://www.healthday.com/", "http://3dprint.nih.gov/"], "published": "2015-10-06T03:00:00.000+03:00", "crawled": "2015-10-26T01:54:13.566+02:00", "highlightTitle": ""}