{"organizations": ["Seattle City Council", "Marshawn Lynch Urbanists"], "uuid": "e156cfd83226202d276f079046ea093cea5b9647", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.komonews.com", "main_image": "http://media.komonews.com/images/151001_marshawn_lynch_tb.jpg", "site_section": "http://www.komonews.com/sports/index.rss", "section_title": "KOMO News - Sports", "url": "http://www.komonews.com/sports/Seahawks-injury-update-Wait-and-see-with-Marshawn-Lynch-330320501.html", "country": "US", "title": "Seahawks injury update: 'Wait and see' with Marshawn Lynch", "performance_score": 0, "site": "komonews.com", "participants_count": 0, "title_full": "Seahawks injury update: 'Wait and see' with Marshawn Lynch", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T00:33:00.000+03:00", "replies_count": 0, "uuid": "e156cfd83226202d276f079046ea093cea5b9647"}, "author": "", "url": "http://www.komonews.com/sports/Seahawks-injury-update-Wait-and-see-with-Marshawn-Lynch-330320501.html", "ord_in_thread": 0, "title": "Seahawks injury update: 'Wait and see' with Marshawn Lynch", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Urbanists, ‘Deaniacs’ split on tight Seattle City Council race \nSEATTLE - Seahawks running back Marshawn Lynch will likely be a gametime decision for Seattle's Week 4 contest versus the Detroit Lions. The 29-year-old played less than half of last week's victory over the Chicago Bears on Sunday. Lynch couldn't get loose pregame and came into the contest about halfway through the first quarter. He then sat out the second half after suffering a hamstring injury that required an MRI on Monday. On Thursday, head coach Pete Carroll said he didn't know if the five-time Pro Bowler would be ready for the Monday Night Football matchup with the Lions.\"It's going to take us all week to figure it out and see how he is,\" Carroll told reporters at the Virginia Mason Athletic Center in Renton. Carroll said the Seahawks weren't looking to hold Lynch back in an effort to preserve him for the rest of the season.\"We don't need to make any big declarations right now,\" Carroll said. \"We just wait and gather information and see how he does. I know he wants to play and he's determined to try to do that. So we'll just see how it goes. It may go all the way to game time.\" Undrafted rookie running back Thomas Rawls ran for 104 yards on 16 carries against the Bears, picking up all but 6 of those yards in the second half. If Lynch can't go on Monday, the team will lean on him and veteran free-agent signing Fred Jackson, Carroll said, not that he expected either of them to replace \"Beast Mode.\"\"We'll see,\" Carroll said. \"I mean, how do you replace him? He's a ridiculously good football player and been a great player for us, a great factor for us forever, it seems. So we'll just do the best we can. Guys have to step up, and if that's the case and we need that to happen, then Thomas and Freddy, they're going to jump up and do some stuff for us.\" Defensive tackle Brandon Mebane will also likely be a gametime decision with a groin injury, Carroll said, while defensive end Demarcus Dobbs \"might be slow to make it back as well,\" with a shoulder injury. Both players were hurt in the home opener versus Chicago. Carroll wasn't optimistic that cornerback Tharold Simon (toe) and free safety Steven Terrell (hip flexor) would be able to return versus Detroit.\"I was hoping that they could make the turn,\" Carroll said of the pair. \"Give us a couple more days to see if they can even challenge for it. Right now, it's very questionable whether they can make it back.\"", "external_links": [], "published": "2015-10-02T00:33:00.000+03:00", "crawled": "2015-10-02T00:50:13.285+03:00", "highlightTitle": ""}