{"organizations": [], "uuid": "1c32c0d77621b52c04b161c91d9c1be80d3685be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.arizonasportsfans.com", "main_image": "", "site_section": "http://feeds.feedburner.com/ASFNForum", "section_title": "Arizona Sports Fans Network", "url": "http://www.arizonasportsfans.com/vb/showthread.php?t=226840", "country": "US", "title": "Dear NFL, It's it's time you admit you have it wrong", "performance_score": 0, "site": "arizonasportsfans.com", "participants_count": 1, "title_full": "Dear NFL, It's it's time you admit you have it wrong", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T07:27:00.000+03:00", "replies_count": 0, "uuid": "1c32c0d77621b52c04b161c91d9c1be80d3685be"}, "author": "Buckybird", "url": "http://www.arizonasportsfans.com/vb/showthread.php?t=226840", "ord_in_thread": 0, "title": "Dear NFL, It's it's time you admit you have it wrong", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posts: 18,287 Dear NFL, It's it's time you admit you have it wrong The college game has it right, the NFL doesn't!!! All plays should be reviewable in NY at command headquarters. Is the college games longer on TV than the NFL games because of this? I haven't seen it. I'm tired of seeing too many rules, different interpretations of those rules & repeated blatant errors with no consequences to the Refs involved. Get it right & stop sending out 4-5 apology letters each week Quote: Originally Posted by Buckybird The college game has it right, the NFL doesn't!!! All plays should be reviewable in NY at command headquarters. Is the college games longer on TV than the NFL games because of this? I haven't seen it. I'm tired of seeing too many rules, different interpretations of those rules & repeated blatant errors with no consequences to the Refs involved. Get it right & stop sending out 4-5 apology letters each week Dear Texas boy We are very sorry you feel this way, but such control would make it difficult for us to manipulate games when given the opportunity and you can bet we will still give your Cowboys every edge we can Sincerely the NFL Wait, you are a fan of the Cardinals... wait, nice try Arians disguising yourself and we already sent you three apologies this week and we need to save money on postage stamps because we are hurting for money so bad Originally Posted by Jetstream Green Dear Texas boy We are very sorry you feel this way, but such control would make it difficult for us to manipulate games when given the opportunity and you can bet we will still give your Cowboys every edge we can Sincerely the NFL Wait, you are a fan of the Cardinals... wait, nice try Arians disguising yourself and we already sent you three apologies this week and we need to save money on postage stamps because we are hurting for money so bad so true Location: Albuquerque,NM Posts: 3,161 If they overturned calls at command they would be required to actually hold refs accountable for bad calls. I doubt that would be something the union would be interested in. Location: The Giant Toaster Posts: 3,690 The core problem is one of the biggest and wealthiest companies in the world having part time officials. There is no fix just incompetence. Quote: Originally Posted by NMCard If they overturned calls at command they would be required to actually hold refs accountable for bad calls. I doubt that would be something the union would be interested in. Exactly. People forget that the fans gave the replacement refs all the power in the world when they held out a few years ago. A couple calls got missed and in no time the NFL was FLOODED with angry messages from the fans to get the refs back. So it's not just the NFL that gets to change the replay procedures, they have to CBA that crap with the refs. There is so much ridiculous red tape in the NFL and bureaucracy it's ridiculous. That's what happens in a multi BILLION dollar monster. And if people think for one second there aren't manipulations that occur they are seriously diluting themselves. In a way a new york central command center would probably leave us even more perplexed than we are now. But the OP is 100% right. There is absolutely no reason with HD video, and infinite camera angles that we should not be able to get every call right. Replay was one of those pandoras box where you either have to have it, like all the way, or not at all. This; this is reviewable and that is not crap is just nonsense. We have the technology to get the calls right, so lets get them right and not have tarnished outcomes of games! The other alternative is just to get rid of replay all together and have full time refs. Say hey we trust the officials out there we're going to respect the purity of the game and whatever they call is the call. Just saying, I dont think you cant have your cake and eat it too. Every play that impacts the game and is questioned should be review able. And you dont have to make a big spectacle of walking the ref over to the secret booth.", "external_links": [], "published": "2015-10-06T07:27:00.000+03:00", "crawled": "2015-10-06T17:31:50.950+03:00", "highlightTitle": ""}