{"organizations": ["Mingus Union", "Les Stukenberg/The Daily Courier Doug Cook The Daily Courier PRESCOTT VALLEY", "Flagstaff High", "Eagles", "Flagstaff", "Coconino", "Bradshaw Mountain High"], "uuid": "a22d5a33d84352614900cd6c99f8b3995c627d39", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "dcourier.com", "main_image": "http://dcourier.com/SiteImages/Article/150688a.jpg", "site_section": "http://www.dcourier.com/2_rss.xml", "section_title": "The Daily Courier RSS Feeds: Sports", "url": "http://dcourier.com/Main.asp?SectionID=2&SubSectionID=2&ArticleID=150688", "country": "US", "title": "Bradshaw crushes depleted Flagstaff in section play", "performance_score": 0, "site": "dcourier.com", "participants_count": 0, "title_full": "Bradshaw crushes depleted Flagstaff in section play", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T09:19:00.000+03:00", "replies_count": 0, "uuid": "a22d5a33d84352614900cd6c99f8b3995c627d39"}, "author": "", "url": "http://dcourier.com/Main.asp?SectionID=2&SubSectionID=2&ArticleID=150688", "ord_in_thread": 0, "title": "Bradshaw crushes depleted Flagstaff in section play", "locations": ["Flagstaff"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["David", "Scully", "Ryan Shaver", "Bob Pavlich Field", "Dave Dirksen", "Otero", "Justin Castro", "Drue Scully", "Angel Gonzalez", "Prescott", "Matthew Tomayo", "Bradshaw", "Moran", "David Otero", "Gunner Bundrick"], "text": "Bradshaw crushes depleted Flagstaff in section play Les Stukenberg/The Daily Courier Doug Cook The Daily Courier PRESCOTT VALLEY - On fall break all this week, the Bradshaw Mountain High football team had plenty of time to digest a tough 20-15 loss in its section opener at Mingus Union Oct. 2 in Cottonwood.But the two-time defending section champion Bears didn't let the hangover from that setback linger long.Bradshaw blistered injury-depleted Flagstaff High on Friday night, Oct. 9, scoring a combined 37 points in the second and third quarters on its way to a convincing 44-14 victory in Division III, Section VIII play at Bob Pavlich Field.\"We had time to rest, but that's not what coach (David) Moran had in mind,\" Bears wideout David Otero said afterward. \"He wanted us out here every day, and we were out here more than two hours a day practicing hard. It was good for us. We got really focused from that.\"The Bears, who improved to 5-2 overall and 1-1 in section, knew they had to remain within striking distance of Mingus (2-0 in section) and rival Prescott (1-0 in section). The Marauders blanked Coconino 38-0 Friday night in Flagstaff.D-III No. 17-ranked Bradshaw's loss at Mingus snapped the Bears' four-game winning streak, and yet they insist they're still in the hunt for at least a share of the section crown.\"I'm excited about what we can do,\" Bears quarterback Gunner Bundrick said. \"What happened at Mingus lit a fire up in us.\"Added Moran, \"We talked about Mingus waking the sleeping giant - we feel like we're the sleeping giant in the section. Physically and mentally, we're trying to make a statement.\"Meanwhile, D-III No. 27 Flagstaff dropped to 3-4 overall and 0-1 in section, and has lost three straight.\"They're a very physical football team - their program is way ahead of our program,\" said Eagles coach Dave Dirksen, who represents Flagstaff's eighth lead mentor on the varsity gridiron in nine years, about Bradshaw. \"We're trying to piece it back together.\"On Friday here, Bradshaw led only 7-0 at the end of the first quarter. But once the Bears' offense started clicking, the Eagles' defense didn't have many answers.Bundrick threw two TD passes, both in a 23-point second quarter, and added a 6-yard TD run on the Bears' opening possession of the second half for a commanding 37-0 lead with 7 minutes and 10 seconds left in the third quarter.\"Offensively, it just comes down to execution,\" Moran said. \"You look at Mingus last week, we had 11 dropped passes. We wanted to turn that back around this week.\"Bundrick was also part of the prettiest play of the evening early in the second quarter. He lateraled to halfback Ryan Shaver, who threw a 72-yard TD pass across the field to wide-open receiver Angel Gonzalez, who streaked down the left sideline to pay dirt. That handed the Bears a 14-0 lead with 10 minutes left until halftime and paved the way for the rout.Other offensive standouts for Bradshaw included David Otero, who caught a 19-yard TD pass from Bundrick and scored a 3-yard rushing TD in the first quarter. Kicker Matthew Tomayo tallied 8 points, booting five extra points and a 32-yard field goal, which came with 4 seconds to go until halftime.\"Even though their (Eagles') program is trying to be rebuilt and all this, coach Moran just put in our heads all week that we're still going to come out and play football,\" Otero said. \"We don't play on no one else's level but ours.\"Up 30-0 at intermission, the Bears picked up where they left off early in the second half. After Bundrick's TD run, tailback Justin Castro handed BMHS a 44-0 lead with 28 seconds left in the third on a 12-yard TD run before garbage time ensued.Not to be overlooked, Bradshaw's first-string defense dominated Flagstaff in the first half. The Eagles punted five times, lost a fumble and turned the ball over on downs.After Friday's game, Moran confirmed that starting offensive lineman/linebacker Drue Scully will miss the rest of the season with a broken leg that he suffered on a cut block at Mingus. Scully was seen in a wheelchair on the home sideline in the second half, supporting his teammates.\"He's a big part of our team - he's our left tackle and our starting middle linebacker,\" Bundrick said of Scully. \"But he's still going to be with us. He's there for the team.\"Next Friday, Oct. 16, the Bears will host Flagstaff Coconino. Kickoff is at 7 p.m.FLAGSTAFF 0 0 0 14--14BRADSHAW 7 23 14 0 -- 44", "external_links": [], "published": "2015-10-10T09:19:00.000+03:00", "crawled": "2015-10-10T12:48:43.653+03:00", "highlightTitle": ""}