{"organizations": [], "uuid": "ba9c26ba105452a3bb7878fe56639af1ab10cdce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/2/8/155896/World/Region/Houthi-leader-urges-all-followers-to-join-fight-ag.aspx", "country": "EG", "title": "Houthi leader urges all followers to join fight against Arab coalition - Region - World", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Houthi leader urges all followers to join fight against Arab coalition - Region - World - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "ba9c26ba105452a3bb7878fe56639af1ab10cdce"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/2/8/155896/World/Region/Houthi-leader-urges-all-followers-to-join-fight-ag.aspx", "ord_in_thread": 0, "title": "Houthi leader urges all followers to join fight against Arab coalition - Region - World", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Suspected Saudi-led air strike kills 28 at Yemen wedding Saudi-led coalition denies striking Yemen wedding Yemen rebel-allied party says ready for UN-brokered peace The leader of Yemen's Houthis urged all followers on Tuesday to head to war fronts to repel what he called invaders, a reference to an Arab coalition that intervened to overturn the rule of his Iranian-allied group over large parts of the country.\nThe televised remarks by Abdel-Malek al-Houthi were his first in public since Yemen's government last week dismissed as a \"manoeuvre\" the Houthis' acceptance of a U.N.-sponsored plan to end Yemen's more than six-month-old civil war.\n\"Everyone must move to the front lines,\" Houthi said. \"We cannot sacrifice our dignity and freedom and independence. We will defend our land and our honour.\"\nOver 5,000 people have been killed in fighting pitting the Houthis and local forces loyal to ex-president Ali Abdullah Saleh against a Saudi-led alliance that, since entering the Arabian Peninsula conflict in March, has retaken some territory as it seeks to reinstate President Abd-Rabbo Mansour Hadi.\nHouthi forces continue to control the capital Sanaa and much of north Yemen close to the Saudi border, but face an offensive by Yemeni government and Gulf coalition forces thrusting northwards, with Sanaa their ultimate goal, after ousting the Houthis from the major southern port of Aden in July.\nThe Houthis have sent letters to U.N. chief Ban Ki-moon declaring their acceptance of the peace plan, which includes a Security Council resolution adopted in April calling on the Houthis to quit cities captured since September last year.\nAbdel-Malek al-Houthi made no mention of peace efforts in his remarks. \"Today there is an invasion and attempts to occupy this country, and it is of importance that the Yemeni people are aware of this truth that there are those who wish to control this country,\" he said.\nHe made a string of derogatory comments about Saudi Arabia. In one many Arabs would understood as insulting, he said Israel and Saudi Arabia were \"a shared entity in a single project.\"\nSpeaking in Riyadh at a joint news conference with visiting French Foreign Minister Laurent Fabius, Saudi Foreign Minister Adel al-Jubeir said on Tuesday that it was up to the Houthis and Saleh to bring an end to the war in Yemen.\n\"They are the ones who started this and they are the ones who continue this. We believe that the political process is the better option and that the Houthis and Saleh forces should avail themselves of this opportunity and reach a settlement.\"", "external_links": [], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-14T00:31:01.560+03:00", "highlightTitle": ""}