{"organizations": [], "uuid": "f439c1619bda63a3d73945637dd5d1a9501fe276", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usatoday.com", "main_image": "http://www.gannett-cdn.com/-mm-/9f8c40d01f6d978ddb64aa0e4abd58529eb0e6b2/c=0-388-4194-2747&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/13/USATODAY/usatsports/2a8ca5b50bb1be2e840f6a7067008db7.jpg", "site_section": "http://www.usatoday.com/sports/", "section_title": "USA Today | Sports", "url": "http://www.usatoday.com/story/sports/mlb/2015/10/13/leading-off-jays-rangers-astros-royals-in-alds-game-5s/73910050/", "country": "US", "title": "LEADING OFF: Jays-Rangers, Astros-Royals in ALDS Game 5s", "performance_score": 0, "site": "usatoday.com", "participants_count": 0, "title_full": "LEADING OFF: Jays-Rangers, Astros-Royals in ALDS Game 5s", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T07:52:00.000+03:00", "replies_count": 0, "uuid": "f439c1619bda63a3d73945637dd5d1a9501fe276"}, "author": "", "url": "http://www.usatoday.com/story/sports/mlb/2015/10/13/leading-off-jays-rangers-astros-royals-in-alds-game-5s/73910050/", "ord_in_thread": 0, "title": "LEADING OFF: Jays-Rangers, Astros-Royals in ALDS Game 5s", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Photo: The Associated Press)\n1 CONNECT TWEET LINKEDIN COMMENT EMAIL MORE A look at what's happening around the major leagues Wednesday:\n___\nWIN OR GO HOME\nThe AL Championship Series participants will be decided in a pair of deciding Game 5s. In Toronto, the Blue Jays host the Rangers at 4:07 p.m. EDT to complete a series in which the visiting team has won every game. Then at 8:07 p.m. EDT, the top-seeded Royals will try to carry over momentum from a late-inning comeback in Game 4 in their series finale against the Astros.\nBACK FOR A BIG ONE\nThe Blue Jays got a late-season boost when Marcus Stroman returned with impressive swiftness from a torn knee ligament, and now it's on the 24-year-old right-hander to prolong Toronto's season. Stroman tore the ACL in his left knee in spring training, but returned late in the regular season and made his playoff debut while taking a no-decision in Game 2 of this series. \"He's defied all the odds, that's for sure,\" manager John Gibbons said. \"If anybody can rise to the occasion, it would be him.\"\nGOOD DEAL\nThe Rangers are looking for their 12th straight win in starts made by Cole Hamels, who was acquired from Philadelphia in a deal before the non-waiver trade deadline. Texas parted with a deep package of prospects to land Hamels, who is under contract through at least 2018 and will be making his 15th career postseason start. \"It's why you go out and get top performers, elite competitors ... situations exactly like this,\" Rangers manager Jeff Banister said. \"That's a comforting feeling that we've got a guy on the mound that's going to go for us that has been here, has done it, and is quite capable of continuing to do it.\"\nBACK IN?\nAdrian Beltre is hoping to get back in the lineup for Game 5 after missing time this series with lower back stiffness. The Rangers' four-time All-Star and Gold Glove winner was pulled from Game 1 and didn't return until Game 4, when he singled twice despite clearly still being bothered by the injury. Rangers manager Jeff Banister said Tuesday that he hadn't heard news either way from the training staff regarding Beltre's condition after the third baseman played Monday. \"I take that as we're all good,\" Banister said.\nCUETO'S CALLING?\nThe Royals will ask Johnny Cueto to fulfill the role they envisioned when they traded away three top prospects for him before this year's non-waiver trade deadline — be the shutdown ace in a deciding postseason game. The former Reds pitcher is 0-2 with a 5.52 ERA in four career playoff starts, though, and didn't exactly carry Kansas City into the postseason after the deal with Cincinnati was made. Cueto can become a free agent after this season, so this could be his final outing as a Royal.\nBIG BOY SPORT\nThe Astros will try to rebound from a late collapse in Game 4 fueled by a pivotal error from bourgeoning shortstop Carlos Correa. The rookie homered twice, doubled, singled and drove in two runs in the game, but also mishandled a deflected grounder that could have led to a double play in the eighth. Instead of getting two outs, Houston gave up five runs to blow a four-run lead. \"It's big boy sport,\" Astros manager A.J. Hinch said after the 9-6 loss. \"We'll adjust, and we will be ready to play.\"\nWRIGLEYVILLE SHINDIG\nThe Cubs get to recover after a raucous night that included the franchise's first postseason series clinch at historic Wrigley Field. The Cubs hit 10 homers in the final three games of their series against the Cardinals after being shut out in Game 1 of the best-of-five set. They get a few off days to recover from the festivities, which included partying with Pearl Jam frontman Eddie Vedder, and will prep to open the NL Championship Series on the road Saturday.\nTAKE IT BACK OUT WEST\nThe right to host Saturday's NL Championship Series opener will be decided Thursday when the Mets and Dodgers play Game 5 of their NL Division Series. For LA, starter Zack Greinke led all qualifying starters with a 1.66 ERA this season, while Mets pitcher Jacob deGrom was sixth with a 2.54 mark. In Game 1, deGrom outpitched Dodgers ace Clayton Kershaw, striking out 13 batters in his postseason debut. Greinke then got the win in Game 2, allowing two solo home runs and not much else over seven strong innings.\nSECURITY CONCERNS\nPolice are planning to have a strong presence at Game 5 at Dodger Stadium after a fan was critically injured in a fight outside the ballpark following Game 1. The two people suspected of injuring the man are a mother and son, who are being sought by the police, according to Los Angeles Police Chief Charlie Beck. Security at Dodger Stadium came under national scrutiny after a 2011 attack in the parking lot on opening day left Giants fan Bryan Stow with brain damage. Beck said that stadium security has been significantly enhanced since that beating, which led to a jury awarding Stow nearly $18 million from the team in a six-week trial in 2014.\n1 CONNECT TWEET LINKEDIN COMMENT EMAIL MORE Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.\nTOP VIDEOS", "external_links": ["https://twitter.com/intent/tweet?url=http%3A//usat.ly/1Ltiamg&text=LEADING%20OFF%3A%20Jays-Rangers%2C%20Astros-Royals%20in%20ALDS%20Game%205s&via=usatoday", "http://www.linkedin.com/shareArticle?url=http%3A//usat.ly/1Ltiamg&mini=true", "http://www.gannett-cdn.com/-mm-/dd1a162467bba97cbb4225a804f1ca194defb6b8/c=6-0-4187-3136&r=x404&c=534x401/local/-/media/2015/10/13/USATODAY/usatsports/2a8ca5b50bb1be2e840f6a7067008db7.jpg"], "published": "2015-10-14T07:52:00.000+03:00", "crawled": "2015-10-14T07:39:14.945+03:00", "highlightTitle": ""}