{"organizations": [], "uuid": "2763352ecf06cd1c15beb480e191e78118bbbc42", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freep.com", "main_image": "http://www.gannett-cdn.com/-mm-/ca15cb544aea3afd405da8dcc76a2f4cdbf227b9/c=41-314-1500-1138&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/10/DetroitFreePress/DetroitFreePress/635800385896596816-rebecca-blank.jpg", "site_section": "http://rssfeeds.freep.com/freep/sports", "section_title": "Detroit Free Press - Sports", "url": "http://www.freep.com/story/sports/columnists/drew-sharp/2015/10/10/college-football-salaries/73719568/", "country": "US", "title": "Big college football programs reek of hypocrisy with coach salaries", "performance_score": 0, "site": "freep.com", "participants_count": 1, "title_full": "Big college football programs reek of hypocrisy with coach salaries", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T09:52:00.000+03:00", "replies_count": 0, "uuid": "2763352ecf06cd1c15beb480e191e78118bbbc42"}, "author": "freep.com", "url": "http://www.freep.com/story/sports/columnists/drew-sharp/2015/10/10/college-football-salaries/73719568/", "ord_in_thread": 0, "title": "Big college football programs reek of hypocrisy with coach salaries", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MORE\nIt's insane that a college football coach could make more than $7 million annually. It's especially crazy in a multibillion-dollar sports/entertainment entity that still — laughingly — passes itself off as a nonprofit operation in order to maintain its federal antitrust protection.\nBut it's the price of doing business. Or rather, the price of doing \"nonprofit business.\"\nIt's an approach dripping with hypocrisy. Michigan should be able to pay Jim Harbaugh whatever it can because college football coaching is a market-driven profession. According to a USA TODAY Sports coaching salary study, Harbaugh is set to be the second-highest-paid college football coach this season — behind Alabama's Nick Saban — at more than $7 million.\nFree market rules.\nBut don't these university and athletic administrators know how stupid they sound when they attempt to balance the realities of competitive compensation for coaches with the absurdities of unfairly limiting the financial cost of college attendance to the football players?\nAnd isn't how they make such incongruity sound practical to so many the greatest trick the NCAA ever pulled off?\nBut it's also why Wisconsin chancellor Dr. Rebecca Blank came off as appreciatively antiquated in her thinking when she told USA TODAY Sports that she had a serious problem with fellow Big Ten programs like Michigan and Ohio State paying football coaches such outrageous sums.\nThe Buckeyes' Urban Meyer ranked third on the USA TODAY list at $5.9 million. Michigan State's Mark Dantonio ranked fifth in the Big Ten and 21st overall at $3.7 million.\n\"That really begins to threaten the whole sense that we are not professional athletic teams,\" Blank said. \"I'm not terribly happy about the fact that they made those choices. That's my opinion.\"\nBut at least the Badgers practice what they preach. The salary for their football coach has remained basically the same the past four years. And Wisconsin is on its third coach during that time frame, partly because it refused to better compensate its coach and assistants.\nIt might not move Wisconsin closer to the College Football Playoff. But at least it can look itself in the mirror and not see a flaming hypocrite.\nDETROIT FREE PRESS\nStaff picks: Another pair of wins for U-M and MSU\nSpread sheet: A 14-10 overall record — following a 3-3 week against the point spread (thanks again for nothing, Sparty) — for the all-seeing, all-knowing famed seer, sage, soothsayer and former recruiting entertainment director for Louisville basketball … The Great Boodini.\nNorthwestern (plus-7) at Michigan — The APPC (Association for the Prevention of Punter Cruelty) stages a demonstration in front of Michigan Stadium following the game, protesting that the number of combined punts between the teams doubled the number of total offensive yards by the Wolverines and Wildcats. Pick: Northwestern.\nMichigan State (minus-13 1 / 2 ) at Rutgers — As punishment, the NFL sentences the officiating crew from last Monday night's game to work this collegiate game. But questions regarding the crew's competence surface again when they miss a Rutgers defensive player using an actual bat to break up a Connor Cook pass. Pick: Michigan State.\nMaryland (plus-33) at Ohio State — Rumors are flying about imminent change. Desperate to save his job and prove that he knows what he's doing, Terrapins coach Randy Edsall says before kickoff that he'll draw upon his past experience as a Volkswagen executive overseeing emissions testing. Pick: Ohio State.\nWisconsin (plus-1) at Nebraska — It's Big Red vs. Big Red-Faced. The Cornhuskers' program has eroded into such a joke that even the Big 12 wouldn't take them back. Pick: Wisconsin.\nIllinois (plus-10) at Iowa — Pick: Illinois.\nIndiana (plus-7) at Penn State — Pick: Indiana.\nMinnesota (minus-3) at Purdue — Pick: Minnesota.\nContact Drew Sharp: dsharp@freepress.com. Follow him on Twitter @drewsharp .", "external_links": ["http://www.twitter.com/drewsharp", "http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/0d804982f752b8153e6eb75436230efd1f0eb228/c=100-0-700-600/local/-/media/2015/10/09/DetroitFreePress/DetroitFreePress/635799938103829450-footballmash.jpg"], "published": "2015-10-10T09:52:00.000+03:00", "crawled": "2015-10-10T10:24:35.565+03:00", "highlightTitle": ""}