{"organizations": [], "uuid": "22b0d57a8d716688d7ecf6a91643a9896841107d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/soccer", "section_title": "Soccer News, Scores, Schedule, Standings, Stats, Photos, Videos - MSN Sports", "url": "http://www.msn.com/en-us/sports/uefa-champions-league/kevin-de-bruyne-rescues-man-city-late-vs-sevilla/ar-BBmisgy", "country": "US", "title": "Kevin De Bruyne rescues Man City late vs. Sevilla", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "Kevin De Bruyne rescues Man City late vs. Sevilla", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "22b0d57a8d716688d7ecf6a91643a9896841107d"}, "author": "Jerry Trecker", "url": "http://www.msn.com/en-us/sports/uefa-champions-league/kevin-de-bruyne-rescues-man-city-late-vs-sevilla/ar-BBmisgy", "ord_in_thread": 0, "title": "Kevin De Bruyne rescues Man City late vs. Sevilla", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kevin De Bruyne rescues Man City late vs. Sevilla FOXSports 1 day ago Jerry Trecker © Provided by Fox Sports 575431027ME00027_Manchester Injury-hit Manchester City, inspired by Yaya Toure, was outplayed for good portions Wednesday night, but Kevin De Bruyne scored off a stoppage-time counter attack to give them full points from their Champions League Group D match against Sevilla.\nAdChoices Toure found De Bruyne, who picked the far post after stepping inside from the top right of the box to turn an apparent 1-1 draw into a 2-1 victory that could kick-start their advancement to the knockout stage. For Sevilla, the loss will be a bitter pill, but they allowed City to come at them in the closing stages after dominating for long stretches.\nWith Juventus held to draw by Borussia Moenchengladbach in the other group match, City find themselves just a point behind the Italians in second place after three matches, well-positioned to get out of the tricky section.\nYevhen Konoplyanka's first half goal was no more than the visitors deserved, but it was matched by an Adil Rami own goal that cost Sevilla a deserved half-time edge. Unai Emery's team always looked sharper going forward but they let things get away in the crucial closing stage, conceding too much space to an attack that had never looked sharp and was dependent almost entirely on its never-quit effort.\nBecause Sevilla host City -- in the return pairing in what looks to be a straight fight for the second qualifying spot in the group -- they can reclaim some of the damage done, but they will surely look back at their missed chances in the Etihad Stadium with regret.\nCity, playing without injured captain Vincent Kompany until a stoppage-time cameo, and influential attackers Sergio Aguero and David Silva, labored to make an impression on an opponent who was quicker and more creative but ultimately was unable to make their advantages count.\nThe Europa League champions were in the ascendancy for the first half hour, so it was no surprise when Konoplyanka put them on top. The central defensive pairing of Eliaquim Mangala and Nicolas Otamendi looked uncertain -- Kompany's absence obvious -- and Sevilla took advantage of the disorganized backline to get on top.\nKonoplyanka had pinged a 17th minute free kick off Joe Hart's left-hand post before finding the back of the net in the 30th minute. The movement began on the right, Pablo Zabaleta seeming to switch off for a vital second and nobody was shadowing the scorer in the center of the box as he popped up alone to receive the pass from Vitolo and score from eight yards out.\nCity's attack lacked its usual fluid speed, but the goal sparked them into the response that proved enough to get them back in the match. It was the ever-dangerous Toure, whose magic work on the right byeline created the chance for the hosts to get level. Toure somehow stepped past defenders and remained in the field of play before cutting the ball back across the face of goal for Raheem Sterling's shot that Sergio Rico could only block away.\nThe rebound chance came to the feet of Wilfried Bony, who smacked the ball off the knee of Rami and past the stranded keeper just six minutes after Sevilla had taken the lead.\nSevilla continued to have no trouble finding room to attack after the restart and probably should have been back on top in the 55th minute, but Kevin Gameiro failed to take a fine header chance from a Benoit Trémoulinas cross that found the City defense absent in the middle once again. Garneiro headed over rather than testing Hart from close range.\nThe Spaniards were still controling much of the match tempo and looking dangerous whenever they could get the ball wide with runners available in the box for crosses but Gameiro's miss proved their last best chance as the pace of their play dipped in the final stages.\nCity began to make some openings late but the crosses lacked the necessary bite and the raids were sporadic rather than sustained. Still, the Premier League leaders came forward, refusing to accept a draw that looked a good result.\nFirst, Rico denied YaYa Toure as they headed into stoppage time, then City's talisman, the reigning African Player of the Year, led one more raid, found DeBruyne wide on the right and Sevilla made the mistake of giving the Belgian too much room to create.\nGo to MSN Home", "external_links": ["http://www.foxsports.com/", "http://go.microsoft.com/fwlink/?LinkID=286759"], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-23T04:26:08.900+03:00", "highlightTitle": ""}