{"organizations": [], "uuid": "69a7bfce34d2fbbabc1fa373173510bcab2a850a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newstribune.com", "main_image": "http://jeffcity.media.clients.ellingtoncms.com/static/newstribune/images/news-tribune90x90.jpg", "site_section": "http://newstribune.com//rss/headlines/sports/", "section_title": "newstribune.com stories: Mid-Missouri and National Sports", "url": "http://www.newstribune.com/news/2015/oct/16/prep-football-blair-oaks-wins-big-again/", "country": "US", "title": "Prep Football: Blair Oaks wins big again", "performance_score": 0, "site": "newstribune.com", "participants_count": 1, "title_full": "Prep Football: Blair Oaks wins big again", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T07:49:00.000+03:00", "replies_count": 0, "uuid": "69a7bfce34d2fbbabc1fa373173510bcab2a850a"}, "author": "Tony Hawley", "url": "http://www.newstribune.com/news/2015/oct/16/prep-football-blair-oaks-wins-big-again/", "ord_in_thread": 0, "title": "Prep Football: Blair Oaks wins big again", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Share \nVERSAILLES — The Blair Oaks Falcons scored 10 touchdowns — all of them on the ground — and added a field goal while ripping the Versailles Tigers 70-0 on Friday night. \nThe Falcons’ dominant ground attack churned out a total of 423 yards on just 33 carries, good enough for an average of 12.8 yards per carry. Blair Oaks added another 113 yards through the air as it outgained Versailles 536-76. \nIt was a much different story for the Tigers, who could muster just 36 yards on 25 carries (1.4 avg.). Versailles completed 7-of-20 passes for 40 yards. \nThe commanding performance helped the Falcons complete a perfect run through the Tri-County Conference, as they claimed the crown with a mark of 7-0. Blair Oaks also improved to 9-0 overall heading into district play next week. \nThe Tigers, meanwhile, dropped to 3-6 overall and 2-5 in the Tri-County. \nThe Falcons clinched the top seed in district play, meaning they’ll have home-field advantage as long as they’re playing. The Tigers finished as the eighth seed, so the teams will meet again Friday in the first round of districts, with just the venue changing. \nThe Falcons scored five touchdowns in the first quarter alone, sending the first-team offense to the bench after that. \nC.J. Closser got the scoring started at the 10:04 mark and Cody Alexander ran in the 2-point conversion to make it 8-0. \nBrenden Brown then started a trend of alternating scores with Closser, as he took one in from 30 yards out. Alexander’s 2-point run made it 16-0 with 6:55 left in the quarter. \nClosser then ripped off a 75-yard run at the 5:03 mark and when the 2-point run failed, it was 22-0. \nThen it was back to Brown, who raced in from 39 yards out with 3:59 left in the frame. Paul Karsten booted the PAT and it was 29-0. \nThen it was Closser’s turn again, also from 39 yards out, and the Falcons led 35-0 with 1:56 to go. \nBlair Oaks got back on the board with 10:20 left in the second quarter, as Jared Lootens went in from 4 yards out. Karsten kicked the PAT, then added a 25-yard field goal with 7:14 left before halftime, and the Falcons led 45-0. \nBlair Oaks’ final score of the first half came on a 1-yard run by Brayden Pritchett with 1:56 to go, making it 51-0. \nAt the half, Blair Oaks held an edge in total yardage of 371-45. \nThe first-string offense re-entered for one series in the second half, with Alexander scampering in from 32 yards out to make it 57-0 at the 5:59 mark. \nLootens then raced 69 yards to score with 2:02 left in the third and Karsten kicked the PAT, running the lead to 64-0. \nThe last score of the second half, which was played with the running clock due to the mercy rule, came on a 33-yard run by Pritchett just 57 seconds into the fourth quarter. \nClosser led all rushers with 150 yards on just five carries, while Brown had five carries for 83 yards and Lootens had five for 82. ﻿", "external_links": [], "published": "2015-10-17T07:49:00.000+03:00", "crawled": "2015-10-17T08:15:59.067+03:00", "highlightTitle": ""}