{"organizations": ["H.S. Girls Volleyball"], "uuid": "e6fe8eb75fff40f3a6f67490e4114403b5fd5ab2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.northjersey.com", "main_image": "http://www.northjersey.com:80/polopoly_fs/1.1427950!/fileImage/httpImage/100815-tj-volleyseniors.jpg", "site_section": "http://www.northjersey.com/cmlink/high-school-sports-rss.rss", "section_title": "High School Sports on NorthJersey.com", "url": "http://www.northjersey.com/sports/high-school-sports/girls-volleyball/northern-highlands-enters-heart-of-the-season-1.1427949", "country": "US", "title": "H.S. Girls Volleyball: Northern Highlands entering heart of season", "performance_score": 0, "site": "northjersey.com", "participants_count": 0, "title_full": "H.S. Girls Volleyball: Northern Highlands entering heart of season", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T07:32:00.000+03:00", "replies_count": 0, "uuid": "e6fe8eb75fff40f3a6f67490e4114403b5fd5ab2"}, "author": "", "url": "http://www.northjersey.com/sports/high-school-sports/girls-volleyball/northern-highlands-enters-heart-of-the-season-1.1427949", "ord_in_thread": 0, "title": "H.S. Girls Volleyball: Northern Highlands entering heart of season", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Keith Smollin"], "text": "Photo by Keith Smollin The Northern Highlands girls volleyball team got going this season with eight seniors providing leadership. \nThe Bergen County landscape is littered with super competitive girls' volleyball programs. Standing strong at an even 4-4 entering this week, Northern Highlands has proven itself to be among that group of tough clubs. \nSeeding for the Bergen County tournament is coming down the pike, but the Highlanders have a strategy. \n\"We hope to be above .500 and qualify for the tournament,\" head coach Caryn Schanstine said. \"There are so many quality teams in Bergen County that, no matter what the seed, a quality match will be played.\" \nWith the seeds set to be released tomorrow, the Highlanders have their work cut out for them in the short term. \nThe team has had to contend with a very difficult schedule to start the season, but such is par for the course in the loaded Big North Freedom Division. That being said, the girls are still in an enviable position, maintaining their standing after a challenging slate. \n\"Our schedule is always a challenge, but I think it continues to prepare the girls mentally and physically to always play their best,\" Schanstine said. \"There is really no team that they can let their guard up. We have been working on playing consistently and limiting unforced errors.\" \nThis experience will be valuable down the road, as the stakes get higher and the atmosphere adopts more of a playoff-like feel. \nAtmosphere adaptation should not be a problem for this squad, given the fact that the Highlanders are loaded up with a very senior-laden roster. Northern Highlands boasts eight seniors, along with three juniors, a sophomore and a freshman. \"Everyone has been contributing throughout most matches,\" Schanstine said. \nThings start with the team's three captains, all of whom are senior players. Calla Dulmage, an outside hitter, Katie Shell, a middle hitter, and Anya Riccitelli, who plays both outside and middle hitter, make up the captainship. \nDulmage is a four-year varsity player who earned first-team All-Freedom Division honors last season, while Shell is a three-year varsity regular who did the same. Shell's left-handedness has given her a unique edge at the front line positions, all of which she has played. Riccitelli also is a returning player. \nA number of other seniors contribute to the cause. Setter/opposite hitter Ysabel Lapatka starts and has been playing all around. Sam Paluzzi and Mikayla Lengel are two other senior opposite hitters who have played well. \nDefensive specialists Mallory Valente and Sarah Gunderson round out the senior contingency for Northern Highlands. Their collective experience and leadership will play a role down the stretch. \nThe team's three juniors are Haley Cooper, a middle hitter, Becca Bracuti, a libero, and setter Julie Ricca. Sophomore Morgan Valente is the team's third defensive specialist. \nAs for the lone freshman, setter Mikayla Covello has impressed many with her prolific play. \n\"Mikayla has been a pleasant surprise helping our offense,\" Schanstine said. \nCovello's rise is a product of a great system that the team has built. The team's seniors and juniors have expanded upon a sturdy Northern Highlands foundation in 2015. \n\"Every year, the upperclassmen have done a great job in continuing the tradition of wanting to be a competitive program and instilling that in the younger players,\" Schanstine said. \"The girls are aware of the success and certainly work hard every day to strive for the same success as years past. However, I stress that they have to focus on the little goals first so that the bigger goals can happen.\" \nThe bigger goals are approaching quickly, as midseason is right around the corner. The Highlanders will be put to the test, but if anyone is prepared, it is this team. Taking it one day at a time seems to be the prevailing strategy. \n\"The girls put together a list of goals in the beginning of the season that they discuss every game,\" Schanstine said. \"They know that they have to accomplish the smaller goals first so that the bigger ones can happen. Playing consistently and developing chemistry are keys to a successful season.\" \ntownjournal@northjersey.com © 2015 North Jersey Media Group Tags:", "external_links": [], "published": "2015-10-08T07:32:00.000+03:00", "crawled": "2015-10-08T18:17:25.561+03:00", "highlightTitle": ""}