{"organizations": [], "uuid": "5ff33624a9be089aafcebec88b0cded0ec3fe4e0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mid-day.com", "main_image": "", "site_section": "http://www.mid-day.com/Resources/midday/rss/sports.xml#", "section_title": "sports", "url": "http://www.mid-day.com/articles/silverstone-boss-patrick-allen-says-f1-is-a-s-product/16595180", "country": "IN", "title": "Silverstone boss Patrick Allen says F1 is a 's*** product'", "performance_score": 0, "site": "mid-day.com", "participants_count": 1, "title_full": "Silverstone boss Patrick Allen says F1 is a 's*** product' - Sports", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "5ff33624a9be089aafcebec88b0cded0ec3fe4e0"}, "author": "PA Sport", "url": "http://www.mid-day.com/articles/silverstone-boss-patrick-allen-says-f1-is-a-s-product/16595180", "ord_in_thread": 0, "title": "Silverstone boss Patrick Allen says F1 is a 's*** product'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sochi: Silverstone boss Patrick Allen has described Formula One a “s*** product” in a highly critical attack on the sport.\nSilverstone, the home of grand prix racing in Britain, faces an uncertain future after the sport’s chief executive Bernie Ecclestone revealed that their £16million race fee for this year’s event has been deferred to 2016.\nThe annual fee, which increases by five per cent each year in their contract which runs through until 2026, could cripple the famous circuit. And despite attracting a sell-out crowd of more than 120,000 fans earlier this year, Silverstone managing director Allen believes the sport is becoming increasingly difficult to sell — a topic he has broached with Ecclestone.\n“Months and months back I said it to Mr E himself that I can’t sell tickets for a s*** product,” Allen is quoted as saying in the Independent.\n“Fans don’t want to see a procession. As a promoter I can only promote what you give me and if that isn’t up to standard, people aren’t going to buy.”\nAllen added: “I’ve said that people don’t come to watch guys looking at data screens. Fans want to see gladiators racing and fighting it out in a fair fight. Nobody wants to hear drivers getting told to ‘lift’, ‘coast’ or ‘we’re not going to catch the guy in front, settle for second’.\n‘Not saleable’ \n“I think it is criminal when we have got to that state of racing and that is not saleable. I think Bernie is as frustrated with it as we all are. How long is it before the technical director is stood on the top step, not the driver? You’ve just got to throw the towel in then and look for something else.”", "external_links": [], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-09T10:13:56.396+03:00", "highlightTitle": ""}