{"organizations": [], "uuid": "a864e8081f6dbea31396b2848e3631f609129e2b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "capegazette.villagesoup.com", "main_image": "http://capegazette.villagesoup.com/clients/CapeGazette/sites/capegazette/img/logo-facebook.jpg", "site_section": "http://capegazette.villagesoup.com//rss/story/sports", "section_title": "Cape Gazette Sports Headlines", "url": "http://capegazette.villagesoup.com/p/special-hunting-days-available-for-youth-disabled-hunters/1423356?source=rss", "country": "US", "title": "Special hunting days available for youth, disabled hunters", "performance_score": 0, "site": "villagesoup.com", "participants_count": 1, "title_full": "Special hunting days available for youth, disabled hunters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T16:28:00.000+03:00", "replies_count": 0, "uuid": "a864e8081f6dbea31396b2848e3631f609129e2b"}, "author": "newsroom@capegazette.com (Staff)", "url": "http://capegazette.villagesoup.com/p/special-hunting-days-available-for-youth-disabled-hunters/1423356?source=rss", "ord_in_thread": 0, "title": "Special hunting days available for youth, disabled hunters", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Special hunting days available for youth, disabled hunters Oct 08, 2015 \nTo promote and provide additional hunting opportunities, DNREC’s Division of Fish & Wildlife has designated four Saturdays as special waterfowl, deer and turkey hunting days for youth hunters ages 10 through 15 on both public and private lands statewide. Non-ambulatory disabled hunters can also take advantage of these additional hunting opportunities on the deer and turkey dates, but federal requirements do not allow their participation in the special waterfowl hunts. Those eligible can mark their calendars for these dates: \nSaturday, Oct. 17 - Waterfowl hunting day for youth \nSaturday, Nov. 7 - Deer hunting day for youth and non-ambulatory disabled hunters \nSaturday, Feb. 6, 2016 - Second waterfowl hunting day for youth \nSaturday, April 2, 2016 - Wild turkey hunting day for youth and non-ambulatory disabled hunters \nYouth hunters must be accompanied by a licensed or exempt adult hunter age 21 or older, and must be of sufficient physical size and strength to safely handle a firearm. Youth hunters may also hunt during the regular seasons for all game and must be accompanied afield by an adult. Youth hunters age 13 through 15 must have completed a hunter education course, possess a certification card and purchase a Delaware junior hunting license. No state or federal stamps are required for youth hunters. Youth hunters age 10 through 12 must possess a license-exempt number and may take hunter education. \n“These special youth hunting days are an excellent opportunity for experienced adult hunters to share their knowledge and experience with the next generation, thereby continuing one of Delaware’s great conservation and outdoor recreation traditions,” said David Saveikis, DNREC Division of Fish & Wildlife director. “Hunting is an exciting outdoor activity for people of all ages and abilities to enjoy.” \nDelaware hunting licenses are sold online; at the licensing desk in DNREC’s Richardson & Robbins Building, 89 Kings Highway, Dover; and by license agents statewide. To find a participating agent, or to purchase a license online, visit Delaware Licenses. To promote youth hunting, the division is waiving waterfowl blind and deer stand fees for youth hunting on state wildlife areas on youth hunting days. These daily blind and stand fees apply at all other times. \nFor waterfowl hunting, standard daily duck bag limits and waterfowl hunting regulations apply. Youth hunters also are permitted to harvest snow geese and two Canada geese. On state wildlife areas, a lottery drawing for waterfowl blinds will be held 1.5 hours before legal shooting time, except for Little Creek Wildlife Area, which holds its drawing two hours before legal shooting time. Hunters should plan to arrive in time to sign up for the drawing. Hunters also should check each wildlife area’s rules before hunting. Adult companions must be licensed to hunt in Delaware or license exempt, and may not possess a firearm during the hunt. \nFor deer hunting, normal bag limits and regulations apply, and all deer taken must be registered. On state wildlife areas that require a lottery drawing for available deer stands, the drawing will be held 1.5 hours before legal shooting time. To sign up for the lottery, participating hunters should plan to arrive two hours before legal shooting time. Bombay Hook National Wildlife Refuge will hold its own lottery for its deer stands. Hunters also should check each wildlife area’s rules before hunting. Adult companions must be licensed to hunt in Delaware or license-exempt, and may not possess a firearm during the hunt. \nFor turkey hunting, normal bag limits and regulations apply. All hunters 13 years of age and older must have taken a Delaware-approved turkey hunter safety course. Adult companions must be licensed to hunt in Delaware and also must have taken a Delaware-approved turkey safety course. Adult companions must be licensed to hunt in Delaware or license exempt and may not possess a firearm during the hunt. \nSpecialized blinds/stands and hunting locations as well as special hunting permits also are available for disabled hunters. For more information, call 302-739-9912.", "external_links": [], "published": "2015-10-08T16:28:00.000+03:00", "crawled": "2015-10-09T07:20:22.376+03:00", "highlightTitle": ""}