{"organizations": [], "uuid": "2ce001d5bdda4c95e4a5fb18137c6a85732c42b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattlepi.com", "main_image": "http://ww4.hdnux.com/photos/41/57/14/8844055/5/rawImage.jpg", "site_section": "http://www.seattlepi.com/sports/more/", "section_title": "More Seattle Sports News / NBA, NHL, Golf, Tennis - seattlepi.com", "url": "http://www.seattlepi.com/news/crime/article/Bombs-rip-through-Shiite-procession-in-6587958.php", "country": "US", "title": "Bombs rip through Shiite procession in Bangladesh, killing 1", "performance_score": 0, "site": "seattlepi.com", "participants_count": 1, "title_full": "Bombs rip through Shiite procession in Bangladesh, killing 1 - seattlepi.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T03:00:00.000+03:00", "replies_count": 0, "uuid": "2ce001d5bdda4c95e4a5fb18137c6a85732c42b4"}, "author": "seattlepi.com", "url": "http://www.seattlepi.com/news/crime/article/Bombs-rip-through-Shiite-procession-in-6587958.php", "ord_in_thread": 0, "title": "Bombs rip through Shiite procession in Bangladesh, killing 1", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "DHAKA, Bangladesh (AP) — Unidentified attackers hurled home-made bombs as thousands of Shiite Muslims gathered for a religious procession in Bangladesh's capital before dawn Saturday, killing a teenage boy and injuring more than 100 other people, police said.\nThe attack on Shiites — a minority in the Sunni-dominated country — was said to be unprecedented for Bangladesh, which has seen a rise in violence this year claimed by Islamic extremist groups.\nAuthorities immediately arrested two suspects and recovered two unexploded bombs, but dismissed the attack as an attempt to further destabilize the country.\nThe Islamic State group posted a statement online claiming responsibility for the attack, according to the SITE Intelligence Group , which monitors jihadi activities.\nThe hard-line Sunni group said that \"soldiers of the Caliphate in Bangladesh\" detonated explosives in a temple of \"polytheists in the city of Dhaka, during the holding of their polytheist rituals.\" The statement could not be independently verified.\n\"Given the nature of attacks, I think this has been done to create chaos in the country. It is sabotage,\" said senior Dhaka police official Asaduzzaman Mia. \"But it is clear that it was a planned attack.\"\nWitnesses said some 25,000 people had started gathering at 2 a.m. for the 8-kilometer (5-mile) march through Dhaka's old quarter, from Huseni Dalan , an important 17th century Shiite center of learning, to a mosque.\nOf the five bombs thrown into the crowd, three exploded, sending thousands of panicked people fleeing in all directions.\nRelatives cried out for their loved ones in the dark. Shoes and sandals littered the pavement, along with colorful flags and chains used by youths to beat themselves during the procession to show their grief for Ashoura, a 10-day religious ritual marking the death of Imam Hussein , the grandson of the Prophet Muhammad .\nA 15-year-old boy died from shrapnel wounds just before reaching a hospital and was taken to the mortuary, where his brother sat wailing outside the front door.\nMost of the injured were in stable condition at local hospitals or were released within a few hours, said Dr. Nazimun Nesa of the state-run Dhaka Medical College Hospital .\nDhaka medicine shop owner Mohammed Sajib was at the procession with family and friends.\n\"Suddenly, the bombs exploded near me, and we started running,\" he said. \"My hands are covered in blood. We took many to the hospital.\"\nDespite the attacks, thousands of Shiites poured into the streets of Dhaka and elsewhere and marched without any further disruption.\nA three-member committee was set up to investigate the attacks, said police spokesman Muntasirul Islam .\nHome Minister Asaduzzaman Kamal said authorities hoped to arrest the attackers by examining closed-circuit television footage.\nBangladesh has been rocked by a series of attacks this year claimed by Islamic extremists, including the murder of four atheist bloggers and, more recently, the killing of two foreigners — an Italian aid worker and a Japanese agricultural worker.\nThe Islamic State group claimed responsibility for killing the two foreigners, though the government immediately dismissed the claims and said there was no evidence of the group having a presence in Bangladesh.\nShiites are a minority in Bangladesh, but are generally not discriminated against, and attacks against them are virtually unheard of.\n\"This is unprecedented,\" Feroz Hossain , curator of the Huseni Dalan building, told reporters. \"We have been observing this for ages, but we never faced anything like this.\"\nAfter Saturday's attack, the participants in the procession said they were determined to carry on with the ritual.\n\"We are not afraid,\" Rashed Hossain said on the street near the Huseni Dalan, where thousands of others were still gathered at noon. \"We are ready to move ahead with the procession.\"\nPrime Minister Sheikh Hasina , a moderate who pledged to stamp out militant radical groups, has overseen the arrest of dozens of suspected militants and the banning of six groups in recent years. Experts say the crackdown has left some of the country's more hard-line Muslims feeling alienated, and has led to a resurgence in activity by Islamic extremist groups.\nThe violence has rattled foreigners and threatened the impoverished country's economy, which relies heavily on foreign aid and a $25 billion garment industry that produces clothing for top international brands.\nIn another attack against a Shiite procession for Ashoura, a suicide bomber blew himself up and killed 18 other people in the southern Pakistani city of Jacobabad on Friday, police said. Shiites are regularly targeted in attacks in Pakistan.", "external_links": ["http://ap.org/schemas/03/2005/apcm", "http://ap.org/schemas/03/2005/apnm"], "published": "2015-10-24T03:00:00.000+03:00", "crawled": "2015-10-24T16:19:39.391+03:00", "highlightTitle": ""}