{"organizations": [], "uuid": "62a9f6e2a54d5eb9a9c69e4a9acb86cfb2341295", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "cjonline.com", "main_image": "http://cjonline.com/sites/default/files/images/sms-default-facebook-share.png", "site_section": "http://cjonline.com/taxonomy/term/2/feed", "section_title": "Sports", "url": "http://cjonline.com/sports/2015-10-20/royals-turn-edinson-volquez-game-5-chance-clinch-alcs", "country": "US", "title": "Royals turn to Edinson Volquez for Game 5 with chance to clinch ALCS", "performance_score": 0, "site": "cjonline.com", "participants_count": 1, "title_full": "Royals turn to Edinson Volquez for Game 5 with chance to clinch ALCS", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T02:49:00.000+03:00", "replies_count": 0, "uuid": "62a9f6e2a54d5eb9a9c69e4a9acb86cfb2341295"}, "author": "Jeff Deters", "url": "http://cjonline.com/sports/2015-10-20/royals-turn-edinson-volquez-game-5-chance-clinch-alcs", "ord_in_thread": 0, "title": "Royals turn to Edinson Volquez for Game 5 with chance to clinch ALCS", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Royals turn to Edinson Volquez for Game 5 with chance to clinch ALCS Kansas City right-hander pitched six scoreless innings in Game 1 Posted: October 20, 2015 - 6:49pm By Jeff Deters jeff.deters@cjonline.com \nThe last time the Kansas City Royals won the World Series in 1985, they clinched the American League pennant with a win at Toronto. The 2015 Royals are hoping history repeats itself Wednesday. \nWith Tuesday’s 14-2 win against the Blue Jays in Game 4 of the American League Championship Series, the Royals can advance to the World Series for the second year in a row with a victory in Game 5 on Wednesday at Rogers Centre. \nRoyals right-hander Edinson Volquez (1-1, 2.31 ERA) will face Toronto right-hander Marco Estrada (1-1, 3.09 ERA). First pitch is set for 3:07 p.m., and the game will be a rematch of Game 1 starters. \nThe last time Volquez took the mound in Game 1, he told catcher Salvador Perez that he felt “sexy.” Volquez then went out and threw six scoreless innings. So will Volquez feel sexy for Game 5? \n“Got to wait until tomorrow,” Volquez said. “I will let you know on my way back to the dugout.” \nIn the series opener, Volquez and Perez made a game plan to pound the Blue Jays inside. Volquez, though, opted to change plans during the game as he was commanding the outside corner. His velocity also was up. His fastball hit 97 mph and he had control of all of his pitches. \n“That’s one of the best feelings in the world,” Volquez said. “That day, I had a great feeling. I knew I’d pitch a really good game. I didn’t know it would end the way it ended. But I had a good feeling that day, I’m going to pitch a good game, and I did. It was good when you feel that way. I think it’s good for the team and for yourself and for the fans.” \nVolquez will be making his third postseason start for the Royals, having also pitched in Game 3 of the AL Division Series against Houston. Against the Astros, Volquez gave up three runs in 52/3 innings, striking out eight and walking one. \nAgainst the Blue Jays, Volquez gave up just two hits and struck out five and did not issue a walk. Royals manager Ned Yost is hoping for a repeat performance. \n“You hope that he can be,” Yost said. “He’s proven that he’s capable of doing it. That’s why this game is so wonderful. It’s not a cookie-cutter game. You don’t know what you’re going to get until you get out there, find out what’s working and how your command is, and if you’re duplicating your mechanics, and being able to repeat. We’ll find out tomorrow.” \nVolquez has no concern about the Blue Jays stealing signs, even though Royals starter Johnny Cueto alluded to that after giving up eight runs in two-plus innings after an 11-8 loss in Game 3. \n“Johnny said (that) last night, but that’s your fault,” Volquez said. “You’ve got to hide the ball and have better communication with the catcher giving you signs when you’re pitching. So it’s nothing wrong with it. We just have to hide the ball and give multiple signs to hide it from them.” ALCS: GAME 5 \nMatchup: Kansas City Royals at Toronto Blue Jays \nWhen: 3:07 p.m. Wednesday \nWhere: Rogers Centre, Toronto \nPitching matchups: Royals: RHP Edinson Volquez (1-1, 2.31 ERA), Blue Jays: Marco Estrada (1-1, 3.09 ERA) \nTV: Fox Sports 1", "external_links": [], "published": "2015-10-21T02:49:00.000+03:00", "crawled": "2015-10-21T06:22:44.463+03:00", "highlightTitle": ""}