{"organizations": [], "uuid": "8595b2244ae4be62917a6b4d51235641b91ec430", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-561db644/turbine/ct-young-cubs-deliver-side-spt-1014-20151013", "site_section": "http://www.chicagotribune.com/", "section_title": "Chicago Tribune: Chicago breaking news, sports, business, entertainment, weather and traffic - Chicago Tribune", "url": "http://www.chicagotribune.com/sports/baseball/cubs/ct-young-cubs-deliver-side-spt-1014-20151013-story.html", "country": "US", "title": "Young Cubs come through on the big stage", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Young Cubs come through on the big stage - Chicago Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T05:00:00.000+03:00", "replies_count": 0, "uuid": "8595b2244ae4be62917a6b4d51235641b91ec430"}, "author": "Fred Mitchell", "url": "http://www.chicagotribune.com/sports/baseball/cubs/ct-young-cubs-deliver-side-spt-1014-20151013-story.html", "ord_in_thread": 0, "title": "Young Cubs come through on the big stage", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tom Ricketts described the scene as \"baseball fantasy\" after watching so many of the Cubs' young stars contribute significantly in Tuesday night's National League Division Series clincher over the Cardinals.\n\"This is what you play for; these are the kind of games you want to play,\" the Cubs chairman said in the champagne-soaked clubhouse after the Cubs' 6-4 victory. \"This is what baseball is all about.\n\"It's why we're all here, every single one of us. Down to every usher in this park. All we want to do is win.\"\nJavier Baez, 22, cracked a three-run homer in the second inning to give the Cubs a 4-2 lead.\n\"That was the hit that changed this game,\" Ricketts said.\nRight fielder Jorge Soler, 23, threw out Tony Cruz at the plate to prevent the go-ahead run from scoring in the sixth. Fellow rookie Kyle Schwarber, 22, blasted a solo homer in the seventh to give the Cubs a more comfortable 6-4 advantage.\n\"It has just been fun to watch … fun to watch Kyle hit,\" said NL Rookie of the Year candidate Kris Bryant, 23, who tripled in the eighth. \"We're feeling pretty good about ourselves right now.\n\"Everybody plays a huge role, whether it be helping the young guys out, controlling the emotions or whatever. Javy came up huge there. I mean, we went down early (2-0), and then Javy came up big and then Kyle.\"\nRicketts could not imagine a more meaningful game to showcase the young talent, a game that also featured a key home run by first baseman Anthony Rizzo in the sixth to put the Cubs ahead 5-4.\n\"Obviously the focus of the organization over the last several years was to bring in young, talented guys who can really take us to the next level,\" Ricketts said. \"And Joe (Maddon) has got some great young guys and they are playing loose.\"\nMaddon said the mix of talented youth and steady veterans has provided the winning chemistry.\n\"It's a combination of the kids themselves,\" Maddon said. \"They're just really accountable, young baseball players that are very skilled.\n\"Combine that with this wonderful group of veterans that give them good information on a daily basis. ... We've been on the same page pretty well, and to have that really occur, the veteran group really has to buy in because they're the ones who are going to carry the message for you.\"\nAt one point Tuesday night, Ricketts said he turned around to look at the Wrigley Field fans to savor the special moment.\n\"All 42,000 people here tonight will never forget this game,\" he said. \"That's pretty crazy.\"\nNow it's on to the NL Championship Series.\n\"I can't emphasize enough that we're not done yet,\" Bryant said.\nfmitchell@tribpub.com\nTwitter @kicker34\nPrivacy Policy Major League Baseball Baseball Chicago Cubs Tom Ricketts Tony Cruz Kris Bryant Javier Baez", "external_links": ["http://www.tribpub.com/privacy-policy-and-your-privacy-rights/", "http://www.trbimg.com/img-561db644/turbine/ct-young-cubs-deliver-side-spt-1014-20151013"], "published": "2015-10-14T05:00:00.000+03:00", "crawled": "2015-10-14T06:26:52.640+03:00", "highlightTitle": ""}