{"organizations": [], "uuid": "8c8a9c8563dfc1db5826d69a2b10f9a4cf03a4f9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.idahostatesman.com", "main_image": "http://media.idahostatesman.com/smedia/2015/10/07/23/51/txWG0.AuSt.36.jpeg", "site_section": "http://www.idahostatesman.com/rss/sports", "section_title": "Idahostatesman.com -- Sports", "url": "http://www.idahostatesman.com/2015/10/07/4025070/boise-state-footballs-second-wave.html", "country": "US", "title": "Boise State football’s second wave of D-linemen helps defense dominate", "performance_score": 0, "site": "idahostatesman.com", "participants_count": 1, "title_full": "Boise State football’s second wave of D-linemen helps defense dominate", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T08:50:00.000+03:00", "replies_count": 0, "uuid": "8c8a9c8563dfc1db5826d69a2b10f9a4cf03a4f9"}, "author": "ccripe@idahostatesman.com (Chadd Cripe)", "url": "http://www.idahostatesman.com/2015/10/07/4025070/boise-state-footballs-second-wave.html", "ord_in_thread": 0, "title": "Boise State football’s second wave of D-linemen helps defense dominate", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Boise State football’s second wave of D-linemen helps defense dominate By Chadd Cripe ccripe@idahostatesman.com October 7, 2015 Updated 11 hours ago 2015-10-08T05:51:25Z JOE JASZEWSKI — jjaszewski@idahostatesman.com Buy Photo \nComing up \nJoin Chadd Cripe and Dave Southorn at 1 p.m. \n\nA look at the Mountain West quarterbacks. Is Brett Rypien the best of the bunch? \n\nSATURDAY: GAME DAY \nComplete coverage of Boise State at Colorado State. \nThe Boise State football team’s defensive line was so deep coming into the season that the Broncos didn’t think they would need to insert freshmen into the rotation. \nThe line is so deep now because of how well two freshmen have played. \nThe Broncos’ second-team defensive line plays 30-40 percent of the snaps as coaches try to keep fresh players on the field. The group has allowed the team to play top-10 defense even when some of their best players are getting a rest. \n“We just all hold ourselves really accountable,” junior tackle Elliot Hoyte said. “It doesn’t matter if it’s the ones, twos or threes. We’ve gotten to a point where we critique each other. We hold ourselves to a really high standard. If something needs to be redone, we go back and repeat it until we get it right.” \nThe second-team line the Broncos will take into Saturday’s game at Colorado State (5 p.m., CBS Sports Network) barely resembles the group they thought they would have. \nThe preseason expectation: Gabe Perez at stud (redshirting with a shoulder injury instead), Justin Taimatuia at nose (starting at tackle), Antoine Turner at tackle (out with an academic-eligibility issue) and Sam McCaskill at end. \nThe current line: redshirt freshman Jabril Frazier at stud, redshirt freshman Dereck Boles at nose, Hoyte at tackle and McCaskill, a junior, at end. Senior Robert Ash (nose), senior Tutulupeatau Mataele (tackle) and redshirt freshman David Moa (end) also get some snaps. \nFrazier’s development proved vital because the Broncos were counting on Perez, who was productive the past two seasons. Frazier was academically ineligible last fall, so he joined the team in January. \n“Jabril’s been a big surprise,” McCaskill said. “He’s really stepped in and played a big role for us. ... I don’t know if we would have been able to do what we’re doing so far without Jabril stepping up.” Live Blog Boise State-Colorado State preview \nFrazier has 10 tackles, 2.5 tackles for loss, 1.5 sacks and two pass breakups this season. Hoyte and McCaskill have added six tackles each and Boles has five, with two for loss. McCaskill has a half-sack. \n“We want more production out of that group,” coach Bryan Harsin said. “I think we have been effective in the run even with that second group. I think we’ve got some guys in there who can get after the quarterback a little more.” \nThat was an emphasis this week in practice. The defensive line has eight sacks this season — only two by the orange (No. 2) line. \nThe orange line recorded 12.5 sacks last season. \n“That’s something that we definitely need to do better,” McCaskill said. \nThat’s nitpicking, though. \nThe Broncos rank among the national leaders in points allowed (12.4, eighth), yards allowed (260.2, seventh), pass efficiency defense (89.03, fifth), rush defense (51.8, second), interceptions (11, first) and takeaways (13, tied for fifth). \nThey also have posted two shutouts in the past three games with the second-team line clinching the goose eggs. \nThe orange line takes “so much pride” in maintaining dominance, Ash said. \n“You don’t want to be that guy to give up the touchdown,” he said. \nThe orange line takes the third series in each game. The group plays sooner if there’s an extended drive. Defensive line coach Steve Caldwell doesn’t like to have his tackles on the field for more than five consecutive snaps. \nPerez helps Caldwell track snaps at home games. Graduate assistant Byron Hout, who is in the press box, also tracks playing time. \nThe second-teamers are antsy for that first snap. \n“There’s definitely a lot of excitement,” Hoyte said. “We all kind of compete among each other. Who’s going to get the first sack? Who’s going to get the first TFL (tackle for loss)? We’ve got a chance to come in now and show what we can do.” \nFor McCaskill, a starting tackle last year, and Hoyte, a member of the rotation, this is a chance to build on their experiences from 2014 and prepare for potential starting roles in 2016 (three of the four starters are seniors). \n“Sam’s playing real well,” Caldwell said. “We won 12 games with him last year as a starter. He’s continued to do well and I’d feel comfortable moving him anywhere and playing him because he’s such a great technician.” \nFor Frazier and Boles, it’s an earlier-than-expected opportunity — and valuable experience that will help offset the impending loss of seven seniors from the defensive line for 2016. \n“I always tell them, ‘Just do your job and let the plays come,’” senior starting end Tyler Horn said. “Sometimes you get out there and you just want to make a play so bad you do something wrong. Both are coming along really well.” \nWith 11 guys playing in meaningful situations, the lineup remains fluid on the line. That’s one of the group’s strengths. \n“If we don’t do well, someone behind you can step up and take your spot,” Ash said. “We’re all still family but we still want to play. That little rivalry between us helps us excel every day in practice.” Chadd Cripe: 377-6398;Twitter: @IDS_BroncoBeat", "external_links": [], "published": "2015-10-08T08:50:00.000+03:00", "crawled": "2015-10-08T20:11:45.967+03:00", "highlightTitle": ""}