{"organizations": [], "uuid": "baee11b0831d8ac1e892ef84f48f0e669b569d8d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/nba", "section_title": "NBA News, Scores, Schedule, Standings, Stats, Photos, Videos - Basketball - MSN Sports", "url": "http://www.msn.com/en-us/sports/nba/thunder-need-westbrook-to-play-angry/ar-BBmkX6B", "country": "US", "title": "Thunder need Westbrook to play angry", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "Thunder need Westbrook to play angry", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "baee11b0831d8ac1e892ef84f48f0e669b569d8d"}, "author": "Jacob Unruh, Special for USA TODAY Sports", "url": "http://www.msn.com/en-us/sports/nba/thunder-need-westbrook-to-play-angry/ar-BBmkX6B", "ord_in_thread": 0, "title": "Thunder need Westbrook to play angry", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Thunder need Westbrook to play angry USA Today Sports 7 hrs ago by Jacob Unruh, Special for USA TODAY Sports © Mark D. Smith, Mark D. Smith-USA TODAY Sports Mark D. Smith, Mark D. Smith-USA TODAY Sports OKLAHOMA CITY — In any given game, Oklahoma City Thunder All-Star point guard Russell Westbrook can grab a defensive rebound, turn, run the floor and in a blink of an eye violently finish at his hoop.\nAdChoices It’s no wonder Thunder veteran Steve Novak calls the NBA’s reigning scoring champion “Angry Russell.”\n“He’s always angry with the media, he’s angry on the court, and I think it’s not a bad thing,” Novak says. “I think it’s what fuels him and makes him go and puts him in a place he needs to be to be who he is.\n“But in the locker room he’s a totally different guy. He’s extremely well spoken, nice and funny. I think he understands what place he has to be in to be locked in to be really good, and I think that’s the ‘Angry Russell’ that (reporters) just need to be patient with.\n“Let Russell be angry.”\nWestbrook played with an extra chip on his shoulder last season, ultimately reaching a dominant level of play rarely seen in the league.\nHe recorded four consecutive triple-doubles at one point, won his first scoring title and nearly willed the injury-depleted Thunder into the playoffs without superstar Kevin Durant or Serge Ibaka. Even with a fully healthy roster, that version of Westbrook is what Oklahoma City needs this season to return to title contention.\n“Russell, he’s just Russell,” Ibaka said. “He wants to do the best he can to put the team in the playoffs. He gives everything he can, and he’s got to slow it down a little bit, too, you know.\n“Like people say, when you see it in the big picture, he’s trying to make his team win. It’s not like he’s trying to do that to make his team lose or hurt his teammates. At the end of the day we are the only ones who know the truth: He’s just trying to win. He would do whatever it takes.”\nWestbrook averaged career highs in points (28.1), rebounds (7.3), assists (8.6) and steals (2.1) last season while making a quantum leap from his previous seasons.\nEven with the increased performance, Westbrook said before training camp that he had spent the offseason working on little things to improve, instead of trying to make another drastic jump.\n“It’s important that you constantly each year find different things and different niches of your game that you want to get better at, whether it’s working on your balance, working on different things that I can do to be more effective,” Westbrook said.\nBut the question is: What could happen to this version of Westbrook with a fully healthy roster alongside Durant, who is arguably the league’s most prolific scorer?\n“We’ve been playing together for eight years. It’s not rocket science,” Westbrook said. “My job is to find a way to help us win. Kevin, obviously, him being on the floor makes it a lot easier for myself and everybody else on the floor. It’s something we’re used to doing. ... We know how to get each other back on and how to find a rhythm.”\nThunder coach Billy Donovan says he won’t ask either player to change. He instead will embrace Durant’s smoothness and Westbrook’s wildfire.\n“I think the thing that I would try to do as a coach to help those guys is allow them to be who they are,” Donovan said. “Russell is a very, very competitive attacking, aggressive point guard, and I think that’s what makes him special, what makes him great. So I don’t think you want to take that away from him and change who he is.”\nDuring his wild span of triple-doubles in which he also set a franchise record with three consecutive games of at least 40points, Westbrook added to his growing legend by donning a mask after suffering a facial fracture.\nHe refused to slow down, a trait that earned him another nickname from a teammate.\n“With him, it’s just ‘Hustle Westbrook’ for me,” center Enes Kanter said.\nPHOTOS: NBA preseason highlights\nGo to MSN Home", "external_links": ["http://www.usatoday.com/sports/", "http://go.microsoft.com/fwlink/?LinkID=286759"], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-23T05:37:47.809+03:00", "highlightTitle": ""}