{"organizations": ["Big Ten Conference", "Iowa Hawkeyes", "Hawkeyes"], "uuid": "83c0bec1110fef05a23fb5dccc1b94c34d0d2ddc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thegazette.com", "main_image": "http://www.thegazette.com/storyimage/GA/20151004/ARTICLE/151009855/AR/0/AR-151009855.jpg", "site_section": "http://feeds.feedburner.com/~r/GazetteOnlineSports/~6/1", "section_title": "Eastern Iowa Sports News and Information from Gazette Online", "url": "http://www.thegazette.com/subject/sports/hawkeyes-hit-their-mark-with-5-0-start-20151004", "country": "US", "title": "Hawkeyes hit their mark with 5-0 start", "performance_score": 0, "site": "thegazette.com", "participants_count": 0, "title_full": "Hawkeyes hit their mark with 5-0 start", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T21:25:00.000+03:00", "replies_count": 0, "uuid": "83c0bec1110fef05a23fb5dccc1b94c34d0d2ddc"}, "author": "", "url": "http://www.thegazette.com/subject/sports/hawkeyes-hit-their-mark-with-5-0-start-20151004", "ord_in_thread": 0, "title": "Hawkeyes hit their mark with 5-0 start", "locations": ["Wis.", "Jordan Canzeri", "Madison", "Wisconsin", "Iowa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Cole Croston"], "text": "Hawkeyes hit their mark with 5-0 start Hawkeyes hit their mark with 5-0 start Road wins, trophy victories and now rankings OT Cole Croston interview RB Jordan Canzeri interview Iowa Hawkeyes players reclaim the Heartland Trophy as they celebrate their Big Ten Conference football win over Wisconsin at Camp Randall Stadium in Madison, Wis., on Saturday, Oct. 3, 2015. Iowa won 10-6 to reclaim the Heartland Trophy. (Jim Slosiarek/The Gazette) Iowa Football Data Center \nI've covered Iowa football at The Gazette since 1999 Monday October 05, 2015 \nColumnist giving commentary and information about sports in Iowa. Sunday October 04, 2015 \nYour source for Iowa sports and more. Sunday October 04, 2015 \nCovering Iowa State and central Iowa for Eastern Iowa Sunday October 04, 2015 \nKernels baseball, RoughRiders hockey and a lot of things in between. Saturday October 03, 2015 \nCEDAR RAPIDS — The goal scoring for the more Diamonds & Ice stories \nI cover high school sports and Iowa women's basketball. Saturday October 03, 2015 \nYour source for all things auto racing in Eastern Iowa. Wednesday September 23, 2015 \nSharing community and high school contributed stories Friday October 02, 2015 Marc Morehouse , The Gazette October 4, 2015 | 2:25 pm \nWhether Iowa does everything or just enough right, when the Hawkeyes win the game, they sing the school fight song at a super turbo tempo in the postgame lockerroom. \nThey did just enough right in their 10-6 victory at then-No. 18 Wisconsin last weekend. They blew through the fight song and then enjoyed a selfie-a-thon with the Heartland Trophy, which goes to the Iowa-Wisconsin winner. The Hawkeyes hadn’t held it since 2009. They were all over it late Saturday afternoon. \n“I was up there today,” said senior defensive end Drew Ott, whose second quarter strip/sack of quarterback Joel Stave set up a 33-yard field goal. “It was exciting getting that trophy. I’d never seen it or touched it. It was nice to feel it.” \nSo, now it’s probably time to reset expectations for the No. 23 Hawkeyes (5-0, 1-0 Big Ten). Wait, what? No. 23 Hawkeyes? Yes, the No. 23 Hawkeyes. \nFor the first time in 75 rankings periods, the Hawkeyes woke up Sunday (OK, they were up before the Associated Press poll was released at 1 p.m.) and were ranked No. 23 in the USA Today coaches poll and No. 22 in the AP. If you think CBS was writing a CSI or some goofy detective show for Iowa’s disappearance from the rankings, you might not be wrong. \nThe Hawkeyes were ranked No. 24 going into their 2010 season finale at Minnesota. They lost, 27-24, and weren’t ranked until Sunday morning. The 75 rankings weeks without an appearance was just three weeks shorter than a stretch between 1997-2002 that spanned the end of Hayden Fry’s 20 seasons and the beginning of the Kirk Ferentz era. \nCSI Hawkeyes series finale was decidedly defensive. The Hawkeyes held Wisconsin to 86 rushing yards and two field goals. With 11 minutes left, Iowa stopped the Badgers on two runs inside Iowa’s 4, the second of which ended in defensive end Nate Meier causing a fumble and tackle Faith Ekakitie recovering. The Hawkeyes wrapped up the Heartland Trophy (which Ott apparently has nicknamed “Albert” according to his Instagram account) when they pressured Stave into an incomplete on fourth-and-2 at Iowa’s 16 with 36 seconds left. \nAnd now they’re ranked. Of course, you know what the reaction is going to be (and what it needs to be). \n“If it happens, it happens,” Ferentz said in Saturday’s postgame. “We’re not going to get too excited about it. If we’re there in November, great. To me, statistics and rankings really mean very little, and I know we’re into October now, but five weeks into it, it’s hard to get excited about anything, other than what we’re doing as a football team. \n“That can excite you a little bit.” \nFerentz is right. Rankings are fun, but they are empty calories right now. This team has done things, real things, so let’s chat about that. \n— The Hawkeyes ended 2014 0-4 in trophy games. So far this season, they’re 2-0. That’s like 1,000 percent better. (An aside, no idea where the traveling trophies go in the new Hansen Performance Center. The front lobby case, which is two stories, by the way, is full.) \n— Iowa has won a couple of different ways. Quarterback C.J. Beathard quarterback’d Iowa past Pitt. He threw for 258 yards, rushed for six first downs and led Iowa to a last-second 57-yard field goal against what is now ranked the No. 4 defense in the nation. \n— Conversely, the Hawkeyes won at Wisconsin while generating just 221 yards total offense. Beathard was held to 77 passing yards. The last time Iowa won with less than 300 yards total offense was Nebraska 2013 . The last time it won with less than 100 passing yards was Purdue 2008 . Passing yards For a more detailed breakdown of this game, click here . \n— Iowa notched its first road win over a ranked team since 2010, a 38-28 win at No. 24 Michigan on Oct. 16, so check that off. \n— Iowa won at Wisconsin despite missing wide receiver Tevaun Smith (sprained knee, out until after the bye which means an Oct. 31 return against Maryland) and starting left offensive tackle Boone Myers (neck/shoulder, week-to-week). \nTrue freshman wide receiver Jerminic Smith didn’t catch a pass, but did see the first targets of his career. Junior Cole Croston replaced Myers and might’ve made things a race at the position. \n“The bottom line is Boone Myers has started four game and now Cole’s started one,” Ferentz said. “So, he’s catching him, he’s three away. He’s been practicing well. We’ve got a lot of faith in Cole. You have faith in what you see players do and he’s been playing this year and doing a good job.” \nIowa has shaped and reshaped itself a few times already this season. It’s Illinois (4-1, 1-0) this week, which has the No. 21 defense in the nation (303.4 yards a game), and so probably expect some more sculpting. \nl Comments: (319) 398-8256; marc.morehouse@thegazette.com QB CJ Beathard interview", "external_links": [], "published": "2015-10-04T21:25:00.000+03:00", "crawled": "2015-10-05T18:51:23.449+03:00", "highlightTitle": ""}