{"organizations": ["Winnipeg Jets", "NHL"], "uuid": "e12f47d3a28fe6623a7062148af517c6d261132e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.winnipegsun.com", "main_image": "http://storage.winnipegsun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297758942676_ORIGINAL.jpg?quality=80&size=100x", "site_section": "http://www.winnipegsun.com/sports/rss.xml", "section_title": "Top Sports stories", "url": "http://www.winnipegsun.com/2015/10/10/first-things-first-for-ehlers", "country": "CA", "title": "First things first for Ehlers", "performance_score": 0, "site": "winnipegsun.com", "participants_count": 0, "title_full": "First things first for Ehlers", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T03:47:00.000+03:00", "replies_count": 0, "uuid": "e12f47d3a28fe6623a7062148af517c6d261132e"}, "author": "", "url": "http://www.winnipegsun.com/2015/10/10/first-things-first-for-ehlers", "ord_in_thread": 0, "title": "First things first for Ehlers", "locations": ["NEW YORK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Nikolaj Ehlers"], "text": "NEW YORK – Winnipeg Jets rookie Nikolaj Ehlers is enjoying his first week in the NHL and the firsts are beginning to pile up. \nFirst game, check. \nThat came Thursday against the Boston Bruins and was a steady start for the dynamic winger, recording five shots on goal in the 6-2 victory. \nFirst point, check. \nThat came as he made a nice play to find Mark Scheifele on the Jets' first goal in the 3-1 win over the Devils on Friday. \nThe next logical first for Ehlers will be his first goal and he nearly got one on a partial breakaway chance that was thwarted by Devils goalie Cory Schneider. \nWith 10 shots on goal in two games, it probably won't be long until Ehlers finds the back of the net though. \n“It's only my second game, (the goals) will come,” said Ehlers. “It's been getting better and better. I'm comfortable with the way I've been playing, but there's still a long way for me (to go).” \nTAKING NOTICE \nFor anyone who has seen the highlights from the first two Jets games of the season, it looks like Scheifele got the message that he should use his blistering shot a bit more. \nWhile Scheifele hit a lot of iron last season, he still managed to pot 15 goals in his second NHL season and put up 49 points in 82 games. \nSo don't be surprised if Scheifele eclipses 20 goals and collects 55-to-60 points in Year 3. \n“He's got a pretty quick release and he's used it well these first two games,” said Jets defenceman Tyler Myers. \nJets head coach Paul Maurice isn't surprised by Scheifele's strong start. \n“We’ve felt over the last couple of years that Mark was a guy that, boy, he hit a lot of posts and he’d almost get (the shot) off in time,” said Maurice. “You were hoping he’d get that confidence and it seemed to kick in about halfway through the year when he started making those shots. He’s getting it off his stick as fast as I’ve ever seen him and that seems to be translating into some breaks.” \nHUTCHINSON DELIVERS \nMichael Hutchinson started his second full NHL season in style, making 20 saves in Friday's 3-1 victory. \nBy simply surviving the second period, Hutchinson was already ahead of last season's first start. \nFacing the (then) defending champion Los Angeles Kings, Hutchinson gave up three goals on 13 shots in just over 22 minutes of work before he was pulled and replaced by Ondrej Pavelec. \nThat wasn't the start Hutchinson was looking for, but he's come a long way since that time. \nAlthough his numbers during the stretch run weren't nearly as good as they were before the All-Star break, that regression wasn't a surprise for a guy in his first full NHL season and he still collected 21 wins in 38 appearances. \nTeams around the NHL had more tape on Hutchinson and made some adjustments in games against him and now it's time for Hutchinson to show that he can do the same. \nFriday was the first step in that process and he passed with flying colours. \nHutchinson won't have to wait three-plus weeks to get his next start, like he did last fall either. \nWith the Jets about to enter another back-to-back situation on Monday and Tuesday, Hutchinson is expected to get the call to start against the New York Rangers at Madison Square Garden after Ondrej Pavelec starts against the New York Islanders. \nKeeping both goalies sharp can be a challenge for some coaches, but don't be surprised if the starting split ends up being somewhere around 50-32 this season. \nMENTORSHIP PROGRAM \nLong before he got to the NHL, Jets defenceman Ben Chiarot had been leaning on former Manitoba Moose blue-liner Kevin Bieksa (now with the Anaheim Ducks) as a sounding board. \nChiarot is from Hamilton and Bieksa from Grimsby, so the Ontario products had a natural bond and the relationship grew from there. \n“I've skated with him for a few years and he's been somewhat of a mentor since I was a teenager,” said Chiarot. “He's the first NHL player I really came in contact with and he's been a big part of what I do in the summers and my mentality going into the season. He's been really important for me and I can't thank him enough for what he's done for me. There's so many things he's taught me over the years that it's hard to pick just one thing. \n“Since I was 16, 17, I've watched him and tried to emulate some of the things that he does, with his aggressiveness. He plays the game hard and that's something you've got to respect. He's had a long and successful career in the NHL and he's still looking ahead to what good can come.” \nChiarot made his NHL debut against the Chicago Blackhawks in November of 2013 and spent more than half of last season with the Jets, but Thursday marked the first time he's suited up in a season opener. \n“To make the opening-night roster for the first time was a good experience,” said Chiarot. “I learned there's a bit of an adjustment from the pre-season to the regular season in the first 10 minutes of that first period. But after that, we settled in pretty good.” \nThat opener at the TD Garden didn't get off to the best start when he and partner Dustin Byfuglien had some trouble with a bouncing puck behind the net that led to the Boston Bruins first goal. \nBut Chiarot wasn't about to let that rattle him, as he settled back into a groove and had a solid game. \n“One of the biggest things I've learned with more experience is don't let a bad shift become a bad period, a bad period become a bad game,” said Chiarot. “You've got to leave it behind you when you make a mistake like that. I just tried to do that and get into my game after that.” \nSPREADING THE WEALTH \nIt's taken only two games for 15 members of the Jets to record at least one point. \nOnly Bryan Little, Jacob Trouba and Toby Enstrom haven't found the score sheet yet, but Maurice isn't the least bit concerned about that, nor should he be. \nCaptain Andrew Ladd and Blake Wheeler each have two goals and an assist to lead the Jets in scoring. \nKen.wiebe@sunmedia.ca", "external_links": [], "published": "2015-10-11T03:47:00.000+03:00", "crawled": "2015-10-11T07:46:43.609+03:00", "highlightTitle": ""}