{"organizations": [], "uuid": "b30730bc9ad9107fa1cd6ac69c430a4d23053901", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "abcnews.go.com", "main_image": "http://a.abcnews.go.com/images/Sports/espnapi_dm_151012_ncf_grier_presser_wmain.jpg", "site_section": "http://abcnews.go.com/Sports", "section_title": "Sports News &amp; Articles – Scores, Pictures, Videos - ABC News", "url": "http://abcnews.go.com/Sports/floridas-grier-suspended-year-positive-ped-test/story?id=34425006", "country": "US", "title": "Florida's Will Grier suspended for one year after positive PED test", "performance_score": 0, "site": "go.com", "participants_count": 1, "title_full": "Florida's Will Grier suspended for one year after positive PED test - ABC News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "b30730bc9ad9107fa1cd6ac69c430a4d23053901"}, "author": "abcNEWS", "url": "http://abcnews.go.com/Sports/floridas-grier-suspended-year-positive-ped-test/story?id=34425006", "ord_in_thread": 0, "title": "Florida's Will Grier suspended for one year after positive PED test", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Florida Gators quarterback Will Grier has been suspended for one year for violating NCAA rules, coach Jim McElwain announced Monday.\nGrier tested positive for a performance-enhancing substance that was found in an over-the-counter supplement, McElwain said. The positive test carries an automatic suspension of one calendar year from the NCAA, meaning Grier would not be eligible to return until Florida's seventh game of the 2016 season. He would have redshirt sophomore status at that time, a Florida spokesperson said.\nUtley eligible to play, no hearing Monday\nHaden: It was very clear that Sarkisian is not healthy\nExpect Jamaal Charles to have full recovery\nCould Ray Rice fill RB void in Kansas City? sc\nMcElwain said the school will appeal the suspension.\n\"I took an over-the-counter supplement that had something in it,\" a tearful Grier said during a Monday news conference. \"I did not check with the medical staff before taking it. I hope that people can learn from this, learn from my mistake. I'm really sorry to everyone, just really sorry.\"\nMcElwain said he was made aware of Grier's failed test on Sunday. He wanted to give Grier the chance to address his team during Monday's team meeting before speaking publicly about the suspension. McElwain said players embraced Grier and appreciated his honesty with them. Grier will continue to practice with the team, the coach said.\nMcElwain expressed remorse for Grier's situation, but he reiterated how important it is for student-athletes to be careful about taking any sort of supplements not provided by the team.\n\"It's something he feels horrible about,\" McElwain said. \"It's an honest mistake, and yet can be prevented by checking with our medical staff. This is a mistake we'll learn from.\n\"Everybody knows the policy, you police yourself. You're no different. You either do or you don't. ... Before you even take cough medicine, you've got to check with the medical staff to allow you to be able to [take it].\"\nA freshman from Davidson, North Carolina , Grier has thrown for 10 touchdowns, three interceptions and 1,204 yards for the eighth-ranked Gators.\nFlorida (6-0, 4-0) will travel to Death Valley to face No. 6 LSU (5-0, 3-0) in an SEC showdown on Saturday at 7 p.m. on ESPN.\nGrier had been a breath of fresh air for the Gators at quarterback. He became the first Florida quarterback since Tim Tebow in 2009 to pass for more than 200 yards in three consecutive games. Grier's completion percentage, passing yards per game and TD-to-interception ratio are also the best by a Gator since 2009. His completion percentage (65.8) and scramble yards (154) rank first in the SEC.\nHe had also thrown for 200 yards in three straight games, something no Florida quarterback has done since Tebow in 2009.\nWith Grier out, sophomore Treon Harris will take over at quarterback. Harris started the season opener before giving way to Grier, but he was also suspended one game earlier this season for an undisclosed violation of team rules.\nHarris started Florida's final six games of the 2014 season, finishing with a 4-2 record. He completed 49.5 percent of his passes for 1,019 yards, nine touchdowns and four interceptions.\nHarris was also suspended from the team in October 2014 during the week of the LSU game because of accusations of sexual battery, but he was later reinstated after the allegations were withdrawn.\nGrier has a higher completion percentage (65.8) and lower percentage of passes off-target (10.2) than Harris (53.6 and 22.8), according to ESPN Stats & Information. However, Harris averages 1.8 more yards per attempt. Harris has appeared in two games this season and thrown for 269 yards and two touchdowns, with no interceptions.\nThe Wynn race and sportsbook moved LSU from a 6.5-point favorite to 7.5 over Florida after the news. Wynn executive director John Avello initially opened LSU -5 on Sunday night, but took two $2,000 limit bets on the Tigers to move the number to -6.5. He then bumped it up another point after news broke that Grier would be suspended.\nAvello said he was not adjusting the Gators' odds to win the national championship at this time. Florida is 35-1 at the Wynn.\nInformation from ESPN.com's Brett McMurphy and David Purdum contributed to this report.\n \"\nFlorida's Will Grier suspended for one year after positive PED test ", "external_links": ["https://www.facebook.com/sharer.php?u=http%3A%2F%2Fabcnews.go.com%2FSports%2Ffloridas-grier-suspended-year-positive-ped-test%2Fstory%3Fid%3D34425006", "http://media.video-cdn.espn.com/motion/2015/1012/dm_151012_nfl_adickes_on_jamaal_charles_acl857/dm_151012_nfl_adickes_on_jamaal_charles_acl857_default.jpg", "https://s.abcnews.com/assets/js/merlin-core.js?v=2", "http://a.abcnews.com/assets/beta/js/abcn.js?v=47", "http://media.video-cdn.espn.com/motion/2015/1012/dm_151012_mlb_cora_utley_appeal_wont_beheard/dm_151012_mlb_cora_utley_appeal_wont_beheard_default.jpg", "http://media.video-cdn.espn.com/motion/2015/1012/dm_151012_ncf_haden_presser_on_sark/dm_151012_ncf_haden_presser_on_sark_default.jpg", "http://abcnewsplayer-a.akamaihd.net/player/2.24.0.0000/amp.premier/amp.premier.min.js?v=2", "http://twitter.com/intent/tweet?text=Florida%27s+Will+Grier+suspended+for+one+year+after+positive+PED+test+-+ABC+News+-+http%3A%2F%2Fabcnews.go.com%2FSports%2Ffloridas-grier-suspended-year-positive-ped-test%2Fstory%3Fid%3D34425006&via=ABC", "http://api.addthis.com/oexchange/0.8/forward/email/offer?url=http://abcnews.go.com/Sports/floridas-grier-suspended-year-positive-ped-test/story?id=34425006&title=Florida%27s+Will+Grier+suspended+for+one+year+after+positive+PED+test", "http://a.abcnews.com/assets/beta/js/custom/pages/trident_story.js?v=47", "http://a.abcnews.com/assets/js/s_code_15.js?v=4", "https://s.abcnews.com/assets/js/merlin-ext.js?v=2", "http://media.video-cdn.espn.com/motion/2015/1012/dm_151012_nfl_schefter_ray_rice_chiefs/dm_151012_nfl_schefter_ray_rice_chiefs_default.jpg"], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-13T01:12:53.782+03:00", "highlightTitle": ""}