{"organizations": ["Emerson", "Rutherford Bulldogs", "Lyndhurst Bears"], "uuid": "bd5bba9697ac11039c7c9d89be206d2bd6907f24", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.northjersey.com", "main_image": "http://www.northjersey.com:80/polopoly_fs/1.1436130!/fileImage/httpImage/102215-sb-qpfootemerson1.jpg", "site_section": "http://www.northjersey.com/cmlink/high-school-sports-rss.rss", "section_title": "High School Sports on NorthJersey.com", "url": "http://www.northjersey.com/sports/high-school-sports/field-hockey/rutherford-bulldogs-win-setup-showdown-lyndhurst-bears-lose-stunner-qp-wins-again-1.1436129", "country": "US", "title": "Rutherford Bulldogs win, setup showdown, Lyndhurst Bears lose stunner, QP wins again", "performance_score": 0, "site": "northjersey.com", "participants_count": 0, "title_full": "Rutherford Bulldogs win, setup showdown, Lyndhurst Bears lose stunner, QP wins again", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T19:57:00.000+03:00", "replies_count": 0, "uuid": "bd5bba9697ac11039c7c9d89be206d2bd6907f24"}, "author": "", "url": "http://www.northjersey.com/sports/high-school-sports/field-hockey/rutherford-bulldogs-win-setup-showdown-lyndhurst-bears-lose-stunner-qp-wins-again-1.1436129", "ord_in_thread": 0, "title": "Rutherford Bulldogs win, setup showdown, Lyndhurst Bears lose stunner, QP wins again", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Edward Kensik", "Derick Suazo"], "text": "Rutherford Bulldogs win, setup showdown, Lyndhurst Bears lose stunner, QP wins again October 19, 2015 Last updated: Monday, October 19, 2015, 12:57 PM By Edward Kensik Buy this photo staff photo/bernadette marciniak Queen of Peace quarterback Derick Suazo (no. 1) looks to pass to a teammate at the game against Emerson. \nNORTH ARLINGTON - Rutherford took care of business last week to set up a possible division title game with Garfield Friday while Queen of Peace won its second game, and both Lyndhurst and North Arlington lost stunners. St. Mary dropped its first game of the season. \nThe Bulldogs (6-0) stayed undefeated as they routed Elmwood Park, 47-0, last Friday setting up a possible division title battle with Garfield in Rutherford this Friday. staff photo/bernadette marciniak Queen of Peace player with the ball on Oct. 16. \nQueen of Peace (2-4) made it back-to-back victories with a 42-14 win over Emerson at home on Saturday. \nBoth Lyndhurst (2-4) and North Arlington (2-4) suffered tough losses last week. The Bears were looking for their second straight upset, but could not catch Glen Rock in the 42-35 loss on the road on Saturday. The Vikings lost 19-18 at Secaucus as the Patriots scored in the final seconds. staff photo/bernadette marciniak Queen of Peace player on the field against Emerson. \nSt. Mary (5-1) saw its 19-game undefeated regular season win streak come to an end at home against Hasbrouck Heights with a 42-28 defeat in the school's Homecoming Day game. The Gaels last lost in the regular season on October 5, 2013 to Queen of Peace (37-30). \nFor Rutherford the game against Garfield on Friday pits two teams that are undefeated in the NJIC Colonial Division and tied for first. A win over the Boilermakers would secure at least a share of the division title for the Bulldogs, the first for Rutherford since 2011. staff photo/bernadette marciniak Queen of Peace's Yasin Peppers (no. 34) will the ball after scoring a touchdown. \nWhile Rutherford can score points, it might come down to how the Bulldogs stop a Garfield team that scored 50 points against Waldwick last week. \"It's going to come down to executing the basic defensive fundamentals: getting 11 players swarming to the football as fast as possible, taking proper pursuit angles, and open-field tackling,\" said Rutherford head coach Andrew Howell. \"We have to do a better job of getting off the field on three downs, an area where we've been inconsistent this season.\" \nFriday, October 16 \nSecaucus 19, North Arlington 18 \nNorth Arlington continues to lose heartbreaking games. This was probably the toughest to swallow as Secaucus's Evander Pons scored on a one-yard plunge with three seconds remaining in the game to tie it at 18. Pats kicker Kerry Mitchell kicked the extra point to do in the Vikings. It appeared that North Arlington was going to win its third game this season when Edgar Carranza intercepted a pass and returned it 66 yards for a touchdown with six minutes left in the game. But Secaucus came back. North Arlington quarterback Michael Manzo-Lewis also fired a 6-yard touchdown pass to Timothy Ford in the second quarter. Also Manzo-Lewis sprinted 31 yards for a touchdown in the third quarter for the Vikings. \nRutherford 47, Elmwood Park 0 \nRutherford steam rolled over Elmwood Park in an NJIC Colonial Division battle at home. As it turned out the Bulldogs got all of their points in the first quarter with three different Rutherford players scoring. Bulldogs quarterback Nick Birchby hit Laris Mulic and Tom Reid for a touchdown each. Billy Finn added a 15-yard touchdown run to give the Bulldogs a 21-0 lead. For the evening Birchby threw for four touchdown passes with Reid collecting three touchdown catches. \nSaturday, October 17 \nGlen Rock 42, Lyndhurst 35 \nLyndhurst could not make it back-to-back upsets at Glen Rock. The Golden Bears stayed toe-to-toe with the NJIC Liberty Division leaders before they could not catch up in the end. It was another big day for Lyndhurst quarterback Peter Guerriero who added to his state leading rushing numbers and touchdown numbers with four rushing scores against the Panthers. Guerriero also threw a touchdown pass to Benny Franchino for 16 yards in the first quarter. The game was tied at 14 with the help of an 82-yard Guerriero run and also the Guerriero touchdown pass to Franchino. Guerriero continues to pile up the yards this season. The senior ran 25 times for 331 yards adding to being the most prolific quarterback runner in the state. The senior signal caller also completed 7-of-10 passes for 70 yards. Senior Matt DeMarco continues to be the core on the Lyndhurst defense with 18 tackles. Mike Carrino and Guerriero added 10 tackles each. \nHasbrouck Heights 42, St. Mary 28 \nSt. Mary could not get going after the first quarter. Gaels running back turned quarterback Derius Stone had four touchdowns including two in the first quarter. The two first-quarter scores gave St. Mary a 14-0 lead, and it looked like the Gaels might storm to the win. But the Aviators came back with four unanswered touchdowns as the Gaels offense and defense struggled. With starting quarterback Richard Marques injured, the Gaels tried junior Patrick Taylor, who is a wide receiver, at quarterback, but then went with Stone at quarterback in the second quarter. With the Gaels trying to figure out a signal caller, Hasbrouck Heights benefited and stormed to a 28-14 lead at halftime. St. Mary exchanged touchdowns the rest of the way as the Gaels could not come back. It was another big game for Stone who finished with 236 rushing yards. \nQueen of Peace 42, Emerson 14 \nQueen of Peace won its second game of the season that has come on back-to-back weeks. The Golden Griffins jumped out to a 28-7 lead at halftime en route to an NJIC Liberty Division victory. Queen of Peace quarterback Derick Suazo again led the squad completing 15 of 24 passes for 182 yards and two touchdown passes. Fayeson Carney only carried the ball four times but ran for 102 yards for the game and two touchdowns including a 65-yard run in the first quarter. Carney also caught a 28-yard touchdown pass from Suazo. The Queen of Peace quarterback also hit Gregory Barnas on a 15-yard pass. \nFriday, October 23", "external_links": [], "published": "2015-10-19T19:57:00.000+03:00", "crawled": "2015-10-20T00:27:23.542+03:00", "highlightTitle": ""}