{"organizations": [], "uuid": "e25e365e9d45d7ba935e1adafc315fac159a8379", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.timesunion.com", "main_image": "http://ww3.hdnux.com/photos/41/25/50/8739362/3/rawImage.jpg", "site_section": "http://timesunion.com//home/collectionRss/Homepage-HCat-Sports-6377.php", "section_title": "Sports news", "url": "http://www.timesunion.com/sports/article/Lions-visit-Seattle-seek-first-victory-6550105.php", "country": "US", "title": "Lions visit Seattle, seek first victory", "performance_score": 0, "site": "timesunion.com", "participants_count": 1, "title_full": "Lions visit Seattle, seek first victory - Times Union", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T02:08:00.000+03:00", "replies_count": 0, "uuid": "e25e365e9d45d7ba935e1adafc315fac159a8379"}, "author": "timesunion.com", "url": "http://www.timesunion.com/sports/article/Lions-visit-Seattle-seek-first-victory-6550105.php", "ord_in_thread": 0, "title": "Lions visit Seattle, seek first victory", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: Stephen Brashear Image 1 of / 1   1 SEATTLE, WA - SEPTEMBER 26: Seattle Seahawks running back Marshawn Lynch stands on California Golden Bears sideline during the first half of a game between the Washington Huskies and the California Golden Bears at Husky Stadium on September 26, 2015 in Seattle, Washington. (Photo by Stephen Brashear/Getty Images) ORG XMIT: 568510949\nPhoto: Stephen Brashear SEATTLE, WA - SEPTEMBER 26: Seattle Seahawks running back Marshawn... Lions visit Seattle, seek first victory 1  /  1 Back to Gallery Seattle \nThe previous time the Seattle Seahawks were set to face the Detroit Lions three years ago, cornerback Richard Sherman was more than happy to offer up his interest in playing the role of \"Optimus Prime\" to receiver Calvin Johnson 's \"Megatron.\"\nNow, as the Seahawks get set to host the Lions on Monday night, any individual matchup between Johnson and Sherman is secondary to where the Lions and Seahawks stand.\nDetroit (0-3) is trying to avoid its first 0-4 start since 2010, a deficit that would seem too difficult to overcome in the same division with Green Bay.\nAnd while Seattle (1-2) started the process of overcoming its 0-2 start last week by knocking off Chicago, the Seahawks can't afford to lose more ground behind division-leading Arizona.\n\"This is one of those games that could be a turning point in our season,\" Detroit linebacker James Ihedigbo said. \"You get a win like this in a place like that it could really boost our team in the right direction as we continue to go after this thing.\"\nSeattle will be without starting running back Marshawn Lynch after suffering a hamstring strain last week against Chicago. Lynch was downgraded to out on Sunday, but had yet to get going behind Seattle's retooled offensive line. He has only 128 yards rushing on 38 carries through three games. Rookie Thomas Rawls flashed last week against the Bears in Lynch's absence with 104 yards and will likely get the start.\nThe Seahawks will also be without defensive tackle Brandon Mebane (groin), and starting linebacker Bruce Irvin is questionable with an ankle injury.\nThe Lions have their own injury concerns. Running back Joique Bell is out and hopes that defensive leader DeAndre Levy would return from his hip injury were muted when despite a week of limited practice he was listed as doubtful on the final injury report.\n\"I think our team is right there,\" Detroit coach Jim Caldwell said. \"You just can't see it, but we can.\"", "external_links": [], "published": "2015-10-05T02:08:00.000+03:00", "crawled": "2015-10-05T08:29:30.936+03:00", "highlightTitle": ""}