{"organizations": [], "uuid": "7fe34fd2dd3c1b97135ed061ab8dcd15d20955fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nytimes.com", "main_image": "http://static01.nyt.com/images/2015/10/21/sports/Y-NFL/Y-NFL-facebookJumbo.jpg", "site_section": "http://www.nytimes.com/services/xml/rss/nyt/Sports.xml", "section_title": "NYT &gt; Sports", "url": "http://www.nytimes.com/2015/10/21/sports/football/landry-jones-no-3-quarterback-may-start-for-the-steelers.html", "country": "US", "title": "Landry Jones, No. 3 Quarterback, May Start for the Steelers", "performance_score": 0, "site": "nytimes.com", "participants_count": 1, "title_full": "Landry Jones, No. 3 Quarterback, May Start for the Steelers - The New York Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T05:28:00.000+03:00", "replies_count": 0, "uuid": "7fe34fd2dd3c1b97135ed061ab8dcd15d20955fc"}, "author": "The Associated Press", "url": "http://www.nytimes.com/2015/10/21/sports/football/landry-jones-no-3-quarterback-may-start-for-the-steelers.html", "ord_in_thread": 0, "title": "Landry Jones, No. 3 Quarterback, May Start for the Steelers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Sports Newsletter Get the big sports news, highlights and analysis from Times journalists, with distinctive takes on games and some behind-the-scenes surprises, delivered to your inbox every week.\nLandry Jones had his first regular-season N.F.L. action on Sunday. Now it looks as if he will make his first start this weekend.\n N.F.L. Roundup: Johnny Manziel Faces League Review After Dispute With Girlfriend OCT. 19, 2015 N.F.L. Roundup: Broncos Absorb Manning’s Interceptions and Swallow Up Browns OCT. 18, 2015 Eagles 27, Giants 7: Giants Open Strong but Bumble Game Away to Eagles OCT. 19, 2015 Pittsburgh Coach Mike Tomlin said the Steelers would prepare for Sunday’s game against the Chiefs in Kansas City, Mo., as if Jones will be the starting quarterback. The usual starter, Ben Roethlisberger, has been out since spraining the medial collateral ligament in his left knee in a road win over the St. Louis Rams on Sept. 27. His backup, Michael Vick, strained his right hamstring in Sunday’s 25-13 victory over the Arizona Cardinals.\nJones had been Pittsburgh’s third-string quarterback since being picked in the fourth round of the 2013 draft. He completed 8 of 12 passes for 168 yards and two touchdowns against the Cardinals.\nThe Steelers (4-2) have gone 2-1 without Roethlisberger. However, Vick has struggled, completing 40 of 66 passes for 371 yards with two touchdowns and one interception.\nSEAHAWKS ACTIVATE FULLBACK The Seattle Seahawks activated fullback Derrick Coleman, who had been suspended after a car crash. Coleman was arrested after the crash, but no charges have been filed.\nCENTER ON INJURED RESERVE The Tennessee Titans placed center Brian Schwenke on injured reserve. Schwenke dislocated his left ankle in Sunday’s 38-10 loss to Miami.\nJETS BRING UP RECEIVER The Jets promoted wide receiver Kenbrell Thompkins to their active roster, from their practice squad. The move came a day after wide receiver Quincy Enunwa was suspended for four games for violating the N.F.L.’s personal conduct policy. Enunwa was arrested last year and charged with simple assault.\nThompkins will face the New England Patriots, his former team, on Sunday.", "external_links": ["http://static01.nyt.com/images/2015/10/20/sports/CITY-GIANTS-2/CITY-GIANTS-2-thumbStandard.jpg", "http://static01.nyt.com/images/2015/10/19/sports/19NFL/19NFL-thumbStandard.jpg"], "published": "2015-10-21T05:28:00.000+03:00", "crawled": "2015-10-21T06:38:00.938+03:00", "highlightTitle": ""}