{"organizations": [], "uuid": "2490b985dd56713d7e201a2456e5a3a409f87337", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.rediff.com", "main_image": "http://im.rediff.com/sports/2015/oct/26hamilton1.jpg", "site_section": "http://www.rediff.com/rss/sports.xml", "section_title": "Rediff Sports", "url": "http://www.rediff.com/sports/report/hamilton-emulates-sennaseeks-to-inspire-others/20151026.htm", "country": "CH", "title": "Hamilton emulates Senna...seeks to inspire others", "performance_score": 0, "site": "rediff.com", "participants_count": 0, "title_full": "Hamilton emulates Senna...seeks to inspire others", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T08:01:00.000+02:00", "replies_count": 0, "uuid": "2490b985dd56713d7e201a2456e5a3a409f87337"}, "author": "", "url": "http://www.rediff.com/sports/report/hamilton-emulates-sennaseeks-to-inspire-others/20151026.htm", "ord_in_thread": 0, "title": "Hamilton emulates Senna...seeks to inspire others", "locations": ["United States", "Great Britain"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hamilton", "Senna", "Lewis Hamilton"], "text": "  Hamilton emulates Senna...seeks to inspire others Hamilton emulates Senna...seeks to inspire others October 26, 2015 11:01 IST IMAGE: Lewis Hamilton of Great Britain and Mercedes GP celebrates with the team in the pit lane after winning the United States Formula One Grand Prix. Photograph: Clive Mason/Getty Images \nA n 'overwhelmed' Lewis Hamilton hoped to inspire others with his achievements, just as Ayrton Senna has fired his imagination as a boy, after celebrating the greatest day of his career with a third Formula One world title. \n\"I'm just overwhelmed at the moment,\" the Briton told reporters after equaling the number of titles won by the late Brazilian. \n\"It’s difficult really to find the words. I remember my first British championship where my dad and I drove home singing 'We are the Champions'... and you know it's just crazy to think that now I'm a three-time Formula One world champion.\" \nOn a rollercoaster afternoon, following days of torrential rain, Hamilton finally achieved his lifetime's ambition just when it looked like he would have to wait at least another weekend. \nWith team mate Nico Rosberg leading, his third U.S. Grand Prix win in four years seemed to be slipping away but then it was the German who slipped up and gifted him the lead in the closing laps. \n'It was always to get the three that Ayrton had' IMAGE: Lewis Hamilton of Great Britain and Mercedes GP celebrates on the podium after winning the United States Formula One Grand Prix. Photograph: Clive Mason/Getty Images \nS uddenly, unexpectedly, he was the first British driver to take back-to-back titles and only the 10th from any nation to win more than two. \n\"I owe it all to my dad, to my family who supported me all these years and sacrificed so much for me to be here. And then the really positive energy I get from my fans who travel around the world,\" he said. \n\"I really do realise that whilst I get to enjoy driving a Formula One car, this is really a platform for me to inspire young people,\" he continued. \n\"I hope that if there is any inspiring from today it's just that: never give up on your dreams, on your hopes and on your desires. Just keep working at it.\" \nHamilton paid tribute also to Rosberg, who was in no mood for niceties, and then addressed the inevitable subject of Senna. \nEmulating the great Brazilian, who died in 1994 at the San Marino Grand Prix, has been an ambition ever since he watched him racing on television as a boy. \n'There is no-one else I look to, that I want to equal or emulate now' IMAGE: Lewis Hamilton of Great Britain and Mercedes GP celebrates on the podium after winning the United States Formula One Grand Prix. Photograph: Dan Istitene/Getty Images \nT he young Hamilton would come home from school and put on a tape of Senna's finest moments, dreaming of one day doing something similar. \nHe has already surpassed Senna's tally of 41 race wins, Sunday being Hamilton's 43rd. \nThe third title was, he said, \"a very humbling experience.\" \n\"It was always to get the three that Ayrton had,\" he explained. \n\"Of course, he wasn't from the same country as me but he was the guy that inspired me as a youngster. Now I'm like...I don't know where it's going next. There is no-one else I look to, that I want to equal or emulate now. \n\"I feel like I've got the baton now for myself and Ayrton and I'm going to carry it as far as I can, as strong as I can and keep building and see where I take it.\" Source: © Copyright 2015 Reuters Limited. All rights reserved. Republication or redistribution of Reuters content, including by framing or similar means, is expressly prohibited without the prior written consent of Reuters. Reuters shall not be liable for any errors or delays in the content, or for any actions taken in reliance thereon.", "external_links": [], "published": "2015-10-26T08:01:00.000+02:00", "crawled": "2015-10-26T10:45:57.181+02:00", "highlightTitle": ""}