{"organizations": [], "uuid": "45a888b937f02df3223e8d8adc557e61f83b5e8c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.startribune.com", "main_image": "http://stmedia.stimg.co/08_347148_15WILD092215_36757647.JPG?h=630&amp;w=1200&amp;fit=crop&amp;bg=999&amp;crop=faces", "site_section": "http://www.startribune.com/sports/index.rss2", "section_title": "Sports", "url": "http://www.startribune.com/tyler-graovac-very-doubtful-for-home-opener-nino-niederreiter-appears-ok/331775051/", "country": "US", "title": "Wild's Graovac 'very doubtful' for home opener", "performance_score": 0, "site": "startribune.com", "participants_count": 1, "title_full": "Wild's Graovac 'very doubtful' for home opener - StarTribune.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T23:18:00.000+03:00", "replies_count": 0, "uuid": "45a888b937f02df3223e8d8adc557e61f83b5e8c"}, "author": "startribune.com", "url": "http://www.startribune.com/tyler-graovac-very-doubtful-for-home-opener-nino-niederreiter-appears-ok/331775051/", "ord_in_thread": 0, "title": "Wild's Graovac 'very doubtful' for home opener", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Wild, fresh off its come-from-behind victory from three goals down against Colorado last night, practiced this afternoon at Xcel Energy Center in preparation for Saturday night's home opener against the Central Division foe St. Louis Blues.\nVladimir Tarasenko, David Backes, Alex Steen, Alex Pietrangelo, ... Kyle Brodziak & gang will try to ruin the party.\nMake sure you come down because the Wild then plays three road games in the next 11 days in yet another bizarre NHL-issued schedule to start the season. Its next home game is against Columbus on Oct. 22.\nAfternoon from the arena press room, where I'm pounding the keyboard.\nIf you want a sneak peek at Saturday's very fun read on the odd couple that is the Jonas Brodin-Matt Dumba friendship and defense tandem, check out the feature here.\nIf you didn't read the gamer and notebook from last night, check out startribune.com/wild.\nLast night's comeback win was the first time the Wild ever rallied from three goals down IN THE THIRD PERIOD ON THE ROAD in franchise history, according to the Elias Sports Bureau. Also, according to Elias, the Wild became the second team in NHL history and first since Hartford in 1986-87 to win its first game of the season by overcoming a three-goal, third-period deficit.\nA reminder: Saturday, Jim Souhan and I will co-host our podcast at Tom Reid's in St. Paul at 4 p.m. Come on down and take part. The Wild's also having a pregame party outside the arena at 4 p.m.\nOne note on last night: There was a bunch of confusion as to when Patrick Roy took his timeout. I thought it was after the Zach Parise third goal and eventual winner, and so apparently did the broadcasters. But when he gathered his team, it was actually because the Wild hats were being cleaned off the Denver rink.\nHe actually took his timeout before pulling Semyon Varlamov around two minutes left.\nAs for Saturday, Brodziak, who ranks seventh all-time in Wild history with 446 games, is skating on a line with Ryan Reaves and Steve Ott. Chris Porter, who played 173 games for the Blues over parts of six seasons, will face his former team for the first time, too.\nPorter is expected to skate on a line with Erik Haula and Ryan Carter.\nThe Wild did sustain one injury last night, and it's not Nino Niederreiter that I'm talking about. Niederreiter practiced today and is expected to play Saturday against the Blues (more on him in a bit).\nCenter Tyler Graovac, who experienced several spills on the ice last night, sustained a lower-body injury and is \"very doubtful\" to play the home opener, coach Mike Yeo said.\nSo, either Justin Fontaine (oblique) will have to make his season debut against St. Louis, the Wild would have to use seven defensemen and maybe play Nate Prosser at wing like it did today or maybe call up a forward like Zac Dalpe from the farm.\nYeo joked that Prosser had a smile on his face all practice today because he was scoring a bunch of goals at forward.\nIf Fontaine returns, Charlie Coyle looks like he would slide from right wing to center.\nYeo was noncommittal about Fontaine's availability. Fontaine said he would be ready if called upon.\nYeo said Niederreiter is fine and the \"protocol last night means the player has to go off and has to get examined before he can return. They didn’t examine him until after the game.\"\nThis is a huge problem, the Wild's unhappy and has contacted the league. Yeo said basically if that game went to overtime last night, even if Niederreiter was healthy, Niederreiter wouldn't have been able to return because no doctor cleared him.\n\"It's out of my hands now,\" Yeo said. \"I'm ready to move on.\"\nThe Wild was told there was only one Avs doctor at the game. The NHL told me there was a minimum of three, which to me makes this even more inexcusable because, yes, at the same time Gabriel Landeskog was in Colorado's locker room, but where were the other two?\nThe league said it's looking into the \"unusual delay.\"\nHere's more Yeo today:\nOn playing the Blues for the first time since knocking them off last postseason: \"Last year was last year. This is still a team that sets the bar. Regular season, they just come out of the gate. They know their game, they’re very well-coached and they’re a very deep team, so I think it would be a very big mistake on our part to think that we learned lessons and we’re in a good spot because of what happened last year. Tomorrow is a new challenge.\"\nOn the penalty kill giving up 2 goals: \"Both goals were extremely easy. That’s not our MO as a penalty killing group. It was an easy faceoff and two easy passes and an easy entry. We’ve spent so much time focusing on our power play and talking about power play and working on power play and everything else, a lot of penalty killers are also power-play guys. So, next little awhile, a real heavy focus on our PK will be important too.\"\nMikko Koivu didn't practice today because of a maintenance day, but he says he's good to go.\nHere are transcripts today from Brodziak (courtesy of St. Louis Post-Dispatch's Jeremy Rutherford) and Porter. I plan to write Brodziak for my game notebook Saturday for Sunday's paper.\nBrodziak\nPlaying Minnesota?\nI've thought about it a lot. It's exciting. Obviously spent some time there and made a lot of friendships. It'll be nice to go there and see the old teammates and the trainers that I built some pretty good friendships over the years. I'm looking forward to it. ... I'm expecting to be a little nervous. I'm just going to try and go in and have fun and play the game. Hopefully I can get a hit or do something good on the first shift and build off that.\"\nLast year's series?\nYou look at the second half of the year, we were right up there with being one of the best teams in the league. I think as a group, we were confident coming in and we knew we had a game plan and we had to stick to it. If we did that, we would give ourselves an opportunity to win. At the time, obviously fortunately it worked out for us.\nClose the door in Game 6?\nI think it was Game 4 where we got blown out pretty bad. It was Game 5 that was a huge game in the series and once we were able to win that, we knew how critical it was to close it out in Game 6 because we didn't want to come back to St. Louis for Game 7. Fortunately, we were able to do that.\nOpening night with Blues (hit post on shorthanded 2 on 1 rush)\n\"It was good. It was a good feeling to get the win for sure. There's some areas that I think individually and as a group, we need to clean up. Some habits that I played the same system for four years and I'm trying to work out some of those habits and get into building habits that this group plays with. Hopefully as the year goes on, it'll get easier and easier to do that.\"\nPorter\nPlaying st. Louis?\nI’ll be different. I have a lot of good friends on that team, but in the same sense it’s business as usual. Once the game starts, you kind of put that aside. I dealt with that in the playoffs last year against Zach. It’s part of the business.\nPlayed with?\nOtt and Reaves.\nSo Brodziak took your role?\nYeah he did. They’re a tough line to play against. They’re physical. I know what they’re all about and I wouldn’t expect anything less.\nAvoid getting hit by Reaves?\nNo, I’d like to. Him and I battled in practice so there’d be nothing new there. He’s a big boy and a physical player.\nSense rivalry?\nYou could see it coming. Game after game, they were usually close. 2-1, 1-1 going into the third usually and it seemed to get really chippy usually. After playing them in the playoffs, it’s becoming a good rivalry.\nPlayoff series?\nIt was a close series. Every game was close minus the one game. They’re tight-checking games, you don’t want to give either team much space. They have offensive guys just like we do here. We tried to limit their time and spice but the Wild last year were obviously better than we were. And knowing them coming in, they’re going to try to take it to us and have a little revenge or whatever. I’m looking forward to the challenge.\nWeird joining the Wild after playoffs?\nDefinitely. You hope you didn’t make too many people mad with the style you played the year before. But that’s what’s great about hockey – a new guy comes in and everybody welcomes him and is happy to have them on the team. If they move away, you treat them as is. I don’t expect it to be anything different tomorrow.\nBlues?\nWe had a great close knit team like we do here. Everybody got along. It’ll be difficult but it’ll be fun at the same time.\nTalk to them?\nI haven’t. I’ll just leave it as is for Game 1 and hopefully we’ll win and go from there.\nWild debut?\nIt was nice. Practice is different from a game obviously. Games bring everyone closer and guys closer together. Last night was a great team win and a great third period.\nZach’s performance?\nIt was nice. Obviously a great player. I thought from top to bottom we got better as a team. He was the beneficiary last night but it might be somebody else tomorrow night. That’s what great teams do. They find ways to win and we did that last night.\nThat's it for me. In my secondary story in Saturday's paper, you'll hear from Porter, Koivu and Devan Dubnyk on playing the Blues for the first time since the April playoff series.\nOlder Post Parise notches hat trick; Wild scores four fastest goals in team history", "external_links": [], "published": "2015-10-09T23:18:00.000+03:00", "crawled": "2015-10-10T03:21:26.298+03:00", "highlightTitle": ""}