{"organizations": [], "uuid": "7486ed537af527db88a825316a1bad8767adfa1f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.idsnews.com", "main_image": "http://media.ids.s3.amazonaws.com/59595_spiufbvswku06_webf.jpg", "site_section": "http://www.idsnews.com/section/sports", "section_title": "Sports | Indiana Daily Student", "url": "http://www.idsnews.com/article/2015/10/column-hoosiers-are-capable-of-upsetting-no-1-ohio-state", "country": "US", "title": "COLUMN: Hoosiers are capable of upsetting No.1 Ohio State", "performance_score": 0, "site": "idsnews.com", "participants_count": 3, "title_full": "COLUMN: Hoosiers are capable of upsetting No.1 Ohio State | Indiana Daily Student", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T08:03:00.000+03:00", "replies_count": 2, "uuid": "05fd31f3bcf2ae4ff93a81a5d1a367077e38c280"}, "author": "Tori Ziege", "url": "http://www.idsnews.com/article/2015/10/column-hoosiers-are-capable-of-upsetting-no-1-ohio-state#post-0", "ord_in_thread": 0, "title": "COLUMN: Hoosiers are capable of upsetting No.1 Ohio State", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "With No. 1 Ohio State rolling into town looking to bump IU into the loss column for the first time this season, there is only one question fans want answered.\nCan the Hoosiers beat the Buckeyes?\nAnd the short answer is, yes.\nThere are definitely versions of IU football that can beat versions of Ohio State.\nBut the likelihood that those versions show up? I’d say, one, maybe two, in 10.\nThe question for IU Coach Kevin Wilson then becomes how to manifest that version of IU football — the one that has shown up when it counts this season, most prominently in the third quarter where IU has shut out its opponents, 51-0.\nThis team didn’t get to 4-0 for naught. Weak non-conference or otherwise, IU has improved in every outing this season. Executing the game plan that got them here is the Hoosiers’ best shot at attaining their first win against a top-ranked team in program history.\nThe first step is to create turnovers, off of which the Hoosiers have scored 48 points this season, including two pick-sixes.\nIU leads the Big Ten with a turnover margin of plus-6, a mark that ties for seventh among all FBS teams.\nTo follow the pattern of this season in which IU has been able to shift momentum and put away games with takeaways, the Hoosiers will need to force junior quarterback Cardale Jones — who has thrown four interceptions this season — to make mistakes.\nThough chock-full of playmakers in Jones, senior halfback Braxton Miller and junior running back Ezekiel Elliot (who, in case you were wondering, found his missing dog Tuesday), the Buckeye offense is not invincible.\nOf all things, Ohio State Coach Urban Meyer said it could be IU’s “weird” 3-4 defense that gives his team the most trouble. The scheme has bedeviled Ohio State this season against Hawaii and, most notably, Northern Illinois.\nOhio State’s offensive line struggles with the bandit position, played by senior Zack Shaw and sophomore Greg Gooch for IU, because the Buckeye interior lineman aren’t able to double team and instead are left to figure out where the bandit, or attacker, is coming from.\nOf course, we can’t talk about the IU defense without mentioning Darius Latham’s indefinite absence because of suspension.\nThe loss of the junior defensive tackle from the highly-touted IU 2013 recruiting class — and who Wilson said could make plays “as well as anyone” Monday — will be a palpable detriment to a defense that struggled without him in week one and has little depth to spare.\nLatham, who had one sack and a career-best three tackles for loss against Wake Forest, will be replaced as starter by the emergent sophomore Robert McCray III.\nAlso interesting to see will be the head coaching battle between Wilson and Meyer, who are said to share similar philosophies.\nHow will Wilson inspire his team to do the unthinkable? How does he prepare for not only the physical challenge and match-up challenge, but the mental challenge too?\nHow does IU play David to Ohio State’s Goliath — because that’s essentially what this is.\nIU has an advantage because it has nothing to lose. Looking at the schedule, this game was always going to be a loss, so the Hoosiers can go out and play free.\nUnlike every other game thus far in which there has been expectation to win, IU should not be afraid to lose Saturday.\nAnd that just might be the unshackling the Hoosiers need to earn the biggest win in IU football history.\nvziege@indiana.edu", "external_links": [], "published": "2015-10-01T08:03:00.000+03:00", "crawled": "2015-10-02T07:10:58.157+03:00", "highlightTitle": ""}