{"organizations": [], "uuid": "abc1f44b43ab692df193a87a5de4e0836ff054f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.abqjournal.com", "main_image": "http://main.abqjournal.netdna-cdn.com/wp-content/uploads/2015/10/a01_jd_11oct_fedbail-400x230.jpg", "site_section": "http://www.abqjournal.com/", "section_title": "Albuquerque and New Mexico News, Sports, Business and more | Albuquerque Journal News", "url": "http://www.abqjournal.com/658046/news/state-federal-bail-bond-practices-vary-dramatically.html", "country": "US", "title": "State, federal bail practices vary widely", "performance_score": 0, "site": "abqjournal.com", "participants_count": 1, "title_full": "State, federal bail practices vary widely | Albuquerque Journal News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T07:40:00.000+03:00", "replies_count": 0, "uuid": "abc1f44b43ab692df193a87a5de4e0836ff054f7"}, "author": "Mike Gallagher / Journal Investigative Reporter", "url": "http://www.abqjournal.com/658046/news/state-federal-bail-bond-practices-vary-dramatically.html", "ord_in_thread": 0, "title": "State, federal bail practices vary widely", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A news report on the indictment of Pawan Kumar Jain, M.D., appears on TV India. The Las Cruces neurologist was charged with two counts of overprescribing opiate medications. (Kairali-Tv India Via Youtube)\nEditor’s note: The federal and state systems for dealing with defendants awaiting trial in criminal cases are vastly different. The federal system tends to focus on community safety, the state on the right to pretrial release. As a result, many federal defendants are kept locked up, while dangerous state defendants can be back on the street quickly. That could change as New Mexico takes a look at its system.\nCopyright © 2015 Albuquerque Journal\nWhen Las Cruces neurologist Pawan Kumar Jain was charged with two counts of overprescribing opiate medications leading to the deaths of two patients, 61 counts of unlawfully dispensing controlled substances and 50 counts of health care fraud, a federal magistrate judge decided the Indian-born doctor was a flight risk and ordered him held in jail until trial.\nJain’s attorneys then appealed to U.S. District Judge Robert C. Brack, asking him to allow the physician to be released before trial.\nBrack responded with a written opinion in which he set a $1 million bail bond – half cash and half property – that Jain and his family would have to meet with their own resources, without using a commercial bail bond company.\nBrack ruled that such a high bail would tie up a significant portion of Jain’s assets and – along with other release conditions imposed by the court – would significantly reduce any chance Jain would flee the country. Jain has been a naturalized U.S. citizen since 1992, but prosecutors believed he still had family ties to India.\nJain has never posted the $1 million bail and remains in jail awaiting trial. Earlier this year, a federal grand jury returned a new indictment charging Jain with two more deaths as a result of overprescribing opiate medications.\nLarge bail bonds like the one set for Jain are unusual in federal courts in New Mexico.\nMost of those charged with federal crimes are ordered held until trial with no bond allowed, and when bail is allowed, the use of commercial bail bonds is rare.\nOf those who are released, most are let go on unsecured bonds or on their personal recognizance. Conditions of release set by judges run the gamut, including third-party custody, drug testing and treatment, and mental health care.\nFederal courts bear little resemblance to their state court cousins when it comes to pretrial release for criminal defendants.\nThat’s because federal judges aren’t governed by the New Mexico Constitution, which says defendants in state courts are entitled to reasonable bail in most cases. And, unlike Brack’s ruling that said Jain had to use his own resources to post the $1 million in bail, state court defendants commonly use commercial bail bond companies.\nBut there are proposals on the table to make the state bail system more like the federal system.\nThe state Supreme Court has backed a proposed amendment to the state Constitution that would allow judges to lock up people awaiting trial if they find by “clear and convincing evidence” that the defendants are dangers to the community and/or are flight risks. That amendment is similar to the law that federal judges have followed since the 1984 Bail Reform Act went into effect.\nAlso, a court-appointed committee is considering proposals that could result in state judges relying more on unsecured bonds and pretrial release conditions, such as drug testing and GPS monitoring, and relying less on commercial bail bonds when setting conditions for release prior to trial.\n“It appears that the state is moving toward the federal system in some respects,” Chief Federal Public Defender Stephen McCue said.\nBail Reform Act\nBefore the passage of the 1984 Bail Reform Act, federal judges were in the practice of setting very high monetary bail bonds to keep defendants locked up before trial, even if they were not considered flight risks – the major factor in deciding bail at that time.\nThe Bail Reform Act allowed federal judges to consider whether a person presented a danger to the community if charged with certain crimes and permitted judges to consider the potential length of a defendant’s prison sentence when determining flight risk.\nSince the 1984 law, commercial bail bonds have all but disappeared from the federal criminal justice system.\nFewer than 2.5 percent, or 582, of the more than 24,000 federal defendants released before trial nationwide in a 12-month period posted commercial bail bonds.\nBut under the reform act, subsequent U.S. Supreme Court decisions and other criminal laws, the number of defendants held in pretrial detention expanded.\nFor instance, there is a presumption a defendant is dangerous if charged with a crime of violence or with possession of a firearm in the commission of a felony; has been convicted of prior felonies of a similar nature within the last five years; was a fugitive who eluded federal custody for a period of time or is charged with a drug felony that carries a sentence of 10 years or more.\nBut as in the case of Jain, defense attorneys try, with some success, to come up with pretrial release plans for their clients.\nPublic defender McCue said, “Overcoming that presumption – by clear and convincing evidence – isn’t a high bar” if there is evidence favorable to the defendant.\nImmigrants\nAccording to statistics compiled by the federal courts, 1,219 people were charged with federal crimes, excluding immigration crimes, in New Mexico in the year that ended Sept. 30, 2014.\nIn cases involving more serious drug trafficking or smuggling crimes, immigrants in the country without authorization are not charged with lesser immigration crimes but their immigration status often precludes any type of pretrial release.\nAcross the country, roughly 50 percent of people charged with federal crimes are released before trial. But in border states like New Mexico, that drops to about 30 percent.\nIn the 12-month period, federal data show, 410 defendants were released pending trial in New Mexico federal courts out of 1,219 people charged. Of the 410 defendants, 342 were released to some form of pretrial supervision. Only 26 were released on commercial bail bonds.\nThe vast majority of the 367 bonds set by New Mexico federal judges in that time period were unsecured bonds or releases on personal recognizance. In 48 cases, judges imposed house arrest.", "external_links": ["http://main.abqjournal.netdna-cdn.com/wp-content/uploads/2015/10/A00_jd_11oct_Bail-Bonds-346x400.png", "http://main.abqjournal.netdna-cdn.com/wp-content/uploads/2015/10/a01_jd_11oct_fedbail-640x368.jpg"], "published": "2015-10-11T07:40:00.000+03:00", "crawled": "2015-10-11T10:15:06.706+03:00", "highlightTitle": ""}