{"organizations": [], "uuid": "f0804a014e3429219f947cd30ff10cb0bbb980e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.winnipegfreepress.com", "main_image": "http://media.winnipegfreepress.com/designimages/fb-og-image.png", "site_section": "http://www.winnipegfreepress.com/rss/?path=/sports", "section_title": "Winnipeg Free Press: Sports", "url": "http://www.winnipegfreepress.com/sports/hockeys-next-big-thing-mcdavid-ready-to-bring-superstar-swagger-back-to-edmonton-330399991.html", "country": "US", "title": "Hockey's Next Big Thing: McDavid ready to bring superstar swagger back to Edmonton", "performance_score": 0, "site": "winnipegfreepress.com", "participants_count": 1, "title_full": "Hockey's Next Big Thing: McDavid ready to bring superstar swagger back to Edmonton - Winnipeg Free Press", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T12:07:00.000+03:00", "replies_count": 0, "uuid": "f0804a014e3429219f947cd30ff10cb0bbb980e7"}, "author": "Dean Bennett, The Canadian Press", "url": "http://www.winnipegfreepress.com/sports/hockeys-next-big-thing-mcdavid-ready-to-bring-superstar-swagger-back-to-edmonton-330399991.html", "ord_in_thread": 0, "title": "Hockey's Next Big Thing: McDavid ready to bring superstar swagger back to Edmonton", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "EDMONTON - Next Thursday, in the shadow of the Gateway Arch in St. Louis, after 18 years, eight months and 25 days, it's showtime for the kid who wears his birth year on his back.\nConnor McDavid — with his No. 97 jersey, soft hands and otherworldly playmaking skills — will suit up for the Oilers season opener against the Blues and take his first step toward fulfilling predictions as hockey's Next Big Thing and its first superstar of the Twitter and Tablet Age.\nThe teen from Newmarket, Ont., says right now he is just focusing on his next shift.\n\"I'm just worried about each and every day here, trying to get better and prove to the coaching staff and management team what I'm all about and making sure I'm earning their trust,\" McDavid told reporters in training camp.\nBecause of McDavid, it has become the most anticipated season in the Alberta capital since the Wayne Gretzky era.\nYou knew Edmonton was cuckoo for Connor just days after he was drafted No. 1 overall in the June entry draft, when 3,000 people showed up in the heat of July to cheer him on as he stretched and shot pucks into an empty net at Rexall Place.\nHe comes with eye-popping junior scoring numbers (285 points in 166 games), and leaves hardened hockey observers groping to explain how he does it.\nHe seems to accelerate while he's gliding, a shinny grandmaster who sees the game in slow motion, with eight gears,and eyes in the back of his head.\nFrom a defenceman's point of view he's a six-foot-one, 194–piund onrushing blur, accelerating from Vespa to Lamborghini in a heartbeat, stickhandling at top speed, eyes front, the puck moving left, right, left, right, like it's being chopped with a Ginsu knife before going through the defenceman's legs, and McDavid is gone, barrelling in from the side, swooping past the net at Mach 1, taking the goalie with him to the far side before switching to his backhand and sliding the puck over the line as neatly as a pie into an oven.\nFor marketers, he's a kid straight out of central casting, or at least out of a comic as he resembles the floppy-haired Archie Andrews.\nHe's also a product of the Age of Instant Messaging, where hundreds of thousands can and do lionize and pulverize their heroes in real time, sometimes in the same news cycle.\nLike in April, when the NHL draft lottery ping pong balls fell, the Oilers beat the odds and won the right to pick McDavid. The camera found McDavid and he seemed to be not overwhelmed or underwhelmed. Just, well, whelmed.\nThe Twitterverse exploded with interpretations of the non-expression. He doesn't like Edmonton. He does like Edmonton. He will report. He won't report.\nSo McDavid, understandably, plays a verbal neutral zone trap in media scrums, delivering bullet-proof generalizations in low-talker tones.\nThe default phrase is \"fun.\"\n\"It will be fun,\" McDavid said when asked about last month's rookie tournament in Penticton, B.C.\nAsked about playing the University of Alberta Golden Bears in an exhibition game, he said, \"It will be fun.\"\nAsked about his first game against NHL veterans, in a split squad game in Calgary, he said: \"It was fun.\"\nBut for a kid who talks softly, he wields a big stick that likely catalyzed the longed-for demolition and renovation of a carnival franchise that has missed the playoffs for nine consecutive years.\nIn that time, Oiler coaches and general managers came and went like the autumn leaves. Owner Daryl Katz was dismissed as a fan boy from the team's glory years reluctant to part ways with ex-stars like hockey operations boss Kevin Lowe and general manager Craig MacTavish.\nOne writer once likened the Oilers to a “tree fort.”\nWorse, the team that literally has an L in the middle of its jersey saw a losing culture take root.\nIn training camp this season, longtime Oiler Jordan Eberle admitted that the constant setbacks had taken their toll and that winning gold at the recent World Championships made him feel less like \"a loser.\"\nWhen the Oilers won the lottery to pick McDavid, some observers and writers said hockey itself was the big loser, bemoaning the NHL's future transcendent marquee property being consigned to immolation on the heap of its longest burning dumpster fire.\nFor McDavid's part, he never even remotely hinted he would pull an Eric Lindros and not report.\nNevertheless, within 48 hours of the lottery ball fall, the Oilers began dismantling the tree fort.\nFormer Hockey Canada president Bob Nicholson was made head of hockey and business operations.\nNicholson hired as general manager Peter Chiarelli, who had built the Boston Bruins into a Stanley cup winner. Chiarelli in turn hired ex-San Jose head coach Todd McLellan, the most sought after bench boss of the off season after Mike Babcock.\nThe scouting staff? Sacked. The assistant coaches? Out. Chiarelli began wheeling and dealing to address the team's weak spots in defence and in goal.\nVeteran Andrej Sekera was signed as a free agent as one D-men expected to get the puck to McDavid.\nMark Fayne is expected to join Sekera on the top pairing.\nNewcomers Griffin Reinhart and Eric Gryba join Oscar Klefbom and Justin Schultz on the back end.\nUp front, McDavid has been paired in the pre-season with slick-skating Taylor Hall on left wing and either Leon Draisaitl or Teddy Purcell on the right.\nThe other top line is expected to be Ryan Nugent-Hopkins with Eberle and Benoit Pouliot on the wings — a line that excelled late last season. The line will need a replacement winger to start the season, with Eberle out 4-6 weeks with a shoulder injury.\nGoaltender Cam Talbot, brought over from the New York Rangers after starring there when Henrik Lundqvist went down, is expected to be the starter.\nCan the Oilers avoid a 10th consecutive season out of the playoffs? The consensus among observers is no. Even coach McLellan isn't hyping it, telling reporters, \"We're not going to talk about playoffs here. We're going to talk about foundation.\"\nFans may be OK with that, given that in the meantime they get to watch McDavid for more than 40 nights wind up at centre ice, pick up speed, and score a goal they can talk about all the way on the drive home.\nIt may not be the playoffs.\nBut it will be fun.\n ", "external_links": [], "published": "2015-10-02T12:07:00.000+03:00", "crawled": "2015-10-02T17:26:39.568+03:00", "highlightTitle": ""}