{"organizations": ["Associated Press", "RWC Pool D Italy"], "uuid": "e5cdf51b471078808641d10d84b06e4c62ddfcf1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtontimes.com", "main_image": "", "site_section": "http://www.washingtontimes.com/rss/headlines/sports/", "section_title": "www.washingtontimes.com stories: Sports", "url": "http://www.washingtontimes.com/news/2015/oct/11/italy-beats-romania-32-22-to-secure-3rd-place-at-r/", "country": "US", "title": "Italy beats Romania 32-22 to secure 3rd place at RWC Pool D", "performance_score": 0, "site": "washingtontimes.com", "participants_count": 0, "title_full": "Italy beats Romania 32-22 to secure 3rd place at RWC Pool D", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T20:24:00.000+03:00", "replies_count": 0, "uuid": "e5cdf51b471078808641d10d84b06e4c62ddfcf1"}, "author": "", "url": "http://www.washingtontimes.com/news/2015/oct/11/italy-beats-romania-32-22-to-secure-3rd-place-at-r/", "ord_in_thread": 0, "title": "Italy beats Romania 32-22 to secure 3rd place at RWC Pool D", "locations": ["Romania", "Italy"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Italy beats Romania 32-22 to secure 3rd place at RWC Pool D By - Associated Press   \nEXETER, England (AP) - Italy ended its Rugby World Cup campaign with an entertaining 32-22 win against a valiant Romania on Sunday to secure third place in Pool D and automatically qualify for the 2019 tournament. \nDespite the win and qualifying, Italy coach Jacques Brunel still had last weekend’s 16-9 defeat to Ireland in mind. \n“I won’t be celebrating. We finished third,” Brunel said. “We were close to qualifying for the quarterfinals but didn’t manage it. For me, that’s a big disappointment.” \nItaly’s other tournament win was against Canada, 23-18. \n“If we consider that our mission was to come out of the pool, we nearly achieved our goal,” Brunel said. “We can’t achieve miracles.” \nRomania made the biggest comeback in World Cup history when it rallied from 15-0 down to beat Canada 17-15 in midweek, but ran out of time for more heroics. \nThe Oaks, however, did brilliantly to stop a landslide defeat, having trailed 22-3 at halftime and then 29-3 when No. 8 Alessandro Zanni burrowed through a gap six minutes into the second half. \nScrumhalf Edoardo Gori, right winger Leonardo Sarto, and flyhalf Tommaso Allan touched down for Italy in the first half. \nIf Romania’s players could market their refusal to accept defeat, they would be overnight millionaires, and they roared back with a vengeance with three tries in the last 15 minutes. \nRomania’s rolling maul finally kicked into gear, resulting in a try from replacement left winger Adrian Apostol, who took a feed from No. 8 Daniel Carpo and dotted over. \nThat made it 29-10 with 13 minutes remaining and, just to be safe, Allan took a penalty kick in front of the posts, drawing some jeers from the try-hungry crowd at Sandy Park. But there was more at stake than entertainment value, and the Italians were right to be cautious in light of Romania’s never-say-die attitude. \nLock Valentin Poparlan barged his way over for a try he was not even aware he had scored, until it was awarded following several video referrals that stalled a flowing game. \nThen, with one minute remaining, Apostol capped off a sweeping move with another try down the left, prompting a jubilant reaction from coach Lynn Howells. \nBut it was too late. \nItaly finished behind Six Nations rivals Ireland and France - who played their pool decider late Sunday - and Romania ended in fourth spot.", "external_links": [], "published": "2015-10-11T20:24:00.000+03:00", "crawled": "2015-10-11T22:28:13.450+03:00", "highlightTitle": ""}