{"organizations": [], "uuid": "f5f3023eb5d2ea48f8b7d40257d55eb59bb19f3e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.completesportsnigeria.com", "main_image": "http://www.completesportsnigeria.com/wp-content/uploads/2015/10/prince.jpg", "site_section": "http://www.completesportsnigeria.com/feed/", "section_title": "Complete Sports Nigeria", "url": "http://www.completesportsnigeria.com/new-finidi-aggreh-i-rejected-ghana-to-play-for-super-eagles/", "country": "US", "title": "‘New Finidi’ Aggreh: I Rejected Ghana To Play For Super Eagles", "performance_score": 0, "site": "completesportsnigeria.com", "participants_count": 1, "title_full": "‘New Finidi’ Aggreh: I Rejected Ghana To Play For Super Eagles", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T14:10:00.000+03:00", "replies_count": 0, "uuid": "f5f3023eb5d2ea48f8b7d40257d55eb59bb19f3e"}, "author": "Prince Imehiron", "url": "http://www.completesportsnigeria.com/new-finidi-aggreh-i-rejected-ghana-to-play-for-super-eagles/", "ord_in_thread": 0, "title": "‘New Finidi’ Aggreh: I Rejected Ghana To Play For Super Eagles", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Headlines , Top Features \nSunshine Stars winger, Prince Aggreh , who is in line to play for the Super Eagles against Burkina Faso this weekend, tells Completesportsnigeria.com's ADEBOYE AMOSU how he turned down overtures from Ghana so that he can wear the green and white colours of Nigeria and the comparisons with the great Finidi George… \nYour name has caused a lot of debate out there, where exactly are you from? \n(Laughs)Yes, you are right. I have been approached by a lot of people asking me about my nationality. But the truth is I was born in Sapele, Delta State here in Nigeria. \nNot only have people approached me, I have also received a lot of calls and text messages from within and outside Nigeria seeking to know if I'm a Nigerian. \nCan you mention the name of the country that approached you? \nThe Ghanaians have tried to convince me to play for them. I got a call from someone in Ghana maybe a representative of their FA who asked me about my nationality. \nHe said I should ask my parents about my nationality. I just told him straight I am a Nigerian and nothing more. I don't need to ask anybody about that because it's very clear. \nWere they really desperate to have you play for their national team? \nI think so because they kept pestering to inquire from my parents the truth about my nationality. In my mind, the only country I know is Nigeria and I was not interested in all what they were saying then. \nThis has been a breakthrough season for you, from a virtually unknown player on the streets to a Nigeria international, how do you feel about it? \nIt's a wonderful feeling. Everything is just about the grace of God. You know how difficult it is to make it as a footballer in this part of the world. \nIt was really tough playing on the streets then, but the desire to wear the national team shirt and play professional football outside the country was a big motivation for me and my friends. \nThank God the hard work has paid off today. But I don't think i'm there yet. I want to be a regular starter in the Super Eagles and also play for the biggest clubs in the world. \nWhat was is it like for you, your first day in the Super Eagles camp? \nIt was a dream come true for me. It's not something I can describe. I was happy to be in camp with the big boys from Europe. The likes of Ahmed Musa, Emmanuel Emenike and the other guys. \nIf you don't know them, you will think they are difficult guys to mix with, but they are all wonderful people and easy to relate with. \nThey played here in Nigeria before moving abroad, so they encourage us the home-based guys and make us understand that we are all one. It was a big family and I cherish that experience. \nMany have described you as the new Finidi George of Nigerian football… \nOne thing about football is that you can't totally assess yourself. It is the supporters, fans and media who can always do an objective appraisal of us the players. \nSo, if that is what they think, I believe they are right because they see me play on a frequent basis. \nDo you see yourself becoming a regular in the Super Eagles? \nThat's my dream, but it's not going to come on a platter of gold. I just have keep working hard to convince the coaches that I'm good enough to earn a starting shirt in the team. \nBut no matter what you do it is the coaches who have the final say on who starts or stays on the bench in every game. \nYou must be thinking of moving abroad anytime soon, are there offers on the table for you at the moment? \nYou are right. That's the dream of every footballer in this part of the world. I would love to play for a big European side one day. \nIt will also be great to play in the big competions like the Champions League and the Europa League. \nI know it's not going to be easy, but I'm determined not get distracted by the challenges. \nI want to take it one step at a time and I believe things will work out fine at the end of the day. \nThe English Premier League must be a big attraction for you like other African footballer… \nYes, but I don't want to reveal anything at the moment. I have a lot of good offers from clubs in Europe, but I don't want to discuss anything for now.", "external_links": [], "published": "2015-10-14T14:10:00.000+03:00", "crawled": "2015-10-14T14:40:10.348+03:00", "highlightTitle": ""}