{"organizations": [], "uuid": "15d7a10ada3b7a89148b2879869e211e3555ed1d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "union-bulletin.com", "main_image": "http://unionbulletin.media.clients.ellingtoncms.com/img/photos/2013/08/29/UB_logo.png", "site_section": "http://union-bulletin.com/rss/headlines/sports/local/", "section_title": "union-bulletin.com stories: Local Sports", "url": "http://union-bulletin.com/news/2015/oct/10/cardinals-hold-rallying-coyotes/", "country": "US", "title": "Cardinals hold off rallying Coyotes", "performance_score": 0, "site": "union-bulletin.com", "participants_count": 1, "title_full": "Cardinals hold off rallying Coyotes", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T07:31:00.000+03:00", "replies_count": 0, "uuid": "15d7a10ada3b7a89148b2879869e211e3555ed1d"}, "author": "Ken Morgan of the Walla Walla Union-Bulletin", "url": "http://union-bulletin.com/news/2015/oct/10/cardinals-hold-rallying-coyotes/", "ord_in_thread": 0, "title": "Cardinals hold off rallying Coyotes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Cardinals hold off rallying Coyotes Ken Morgan of the Walla Walla Union-Bulletin Print this article Advertisement WAITSBURG — It was all coming up roses — new red jerseys and a happy homecoming crowd — for Waitsburg here Friday following a 38-yard field goal by Jordan Garrity with 8:21 left in the third that produced a 24-0 Cardinal advantage. But Columbia-Burbank had 20 minutes left to spoil the Cardinals night. The Coyotes fought back, only to see the Cardinals defend a 2-point conversion try with 21 seconds left in the game as the Cardinals hung on for a 24-22 non-conference football win. “Our whole focus this week was to fundamentally get better,” Waitsburg coach Troy Larsen said. “We were 2-2 and seemingly going downhill (after two consecutive losses). We could either get better or the season is gone. It would be the first time in a long time that we haven’t been successful. The seniors took it to heart. We did improve and get better.” The Cardinals struck on their first possession. A Jacob Dunn-to-Brandon Penner 44-yard strike moved Waitsburg to first-and-goal at the Coyote 5. Garrity ran for four on first down, but the Coyotes stuffed the next two plays. Dunn broke the plane of the end zone on fourth down, Garrity added the PAT and Waitsburg had a lead it would not relinquish at 7-0 with 7:05 left in the first period. Waitsburg lost its first of three fumble turnovers when Coyote Caleb Schroeder fell on a loose ball at his own 35 with 1:50 to play in the first quarter. The Coyotes drove to the Cardinal 41 as time ran out in the first period with Waitsburg up 7-0. The Coyotes got to the Cardinal 31 before Russel Jarvis stopped Alexis Magallon for no gain and Dunn broke up a pass on fourth down, and the Cardinals took over on downs. Dunn hit Penner for 25, and on the next snap the two seniors connected on a 49-yard TD as the Coyote defense lost Penner, who walked in for the score and a 14-0 Cardinal lead with 8:05 left in the half. “I didn’t think it was going to be that open,” Penner said of the scoring play. “It was crazy. When I saw everybody shift to the right and I was wide open, that was a great feeling. (I was thinking) don’t drop it.” Enter Cardinal sophomore running back Chris Philbrook for the last Cardinal drive of the half. Philbrook got off runs of eight, 20, and one yards to set the Cardinals up at the Burbank 49. “Chris has zero varsity experience,” Larsen said of his sophomore, who finished the night with 74 rushing yards on nine carries. “We knew he knew the playbook and he hit the right holes, as he grows and gets faster, he’s going to be a good running back.” From the 49, Dunn hit Jason Carter for 14 yards and came back, on the next snap, to Nicolas Kitselman for 35 yards and a touchdown as the Cardinals went to intermission up 21-0. Dunn finished the first half 6-of-10 passing for 165 yards and two scores. Penner caught three balls for 118 yards and the 49-yard score. “We work on catching and receiving quite a bit,” Penner said of the passing game. “We get a jugs machine and catch 50 balls every morning. We work on our hands.” A Dunn-to-Carter 30-yard completion on a fourth-and-7 sparked the Cardinal second-half opening drive to the Burbank 22, but the Coyotes stalled the drive. Garrity split the uprights with a 38-yard field goal and a 24-0 Cardinal lead seven minutes into the second half. And then the tide turned. The Coyotes went 62 yards to narrow the lead to 24-8 with 4:09 left in the third. The Coyotes recovered their first of two consecutive successful onside kicks, but a 10-yard penalty — one of 12 Coyote penalties for 123 yards on the night — stalled the drive. Kitselman picked off a Coyote pass at his own 11 to end the drive. Dunn succumbed to a Coyote rush and fumbled into the end zone, where West Gordon recovered for a Coyote TD and the lead shrank to 24-16 at the end of three. “We came out on our heels,” Penner said of the Cardinal second-half defense. “We thought we were really good leading 24-0. We lightened up, before we got a little mad.” Thanks to a 17-yard Philbrook romp and a 13-yard catch by Kitselman, the Cardinals drove to the Coyote 3 to open the fourth. Waitsburg chose to ignore a field goal attempt and the Coyotes stuffed the Cardinal option for a six-yard loss and took over on their own 9. “We talked about kicking the field goal,” Larsen said. “We were dominating them and I kind of wanted to challenge us to get back in the game, and our kicking game doesn’t do well from that spot. All of which weighed in on our decision.” A Dunn interception stopped a Burbank drive with five minutes to play, Waitsburg had a TD called back on a penalty on its ensuing drive and then lost the ball on a fumble. The Coyotes began their last possession at their own 20 with 2:05 to play. Coyote quarterback Quentain Brown connected on a 17-yard scoring pass to AJ Dixon with 21 seconds left to pull Burbank to within 24-22. The Coyotes went for two, and the Cardinal defense chased Brown out of the pocket and to his right. Brown threw back to the middle of the end zone, but Dunn was there to pick off the pass and preserve the 24-22 Cardinal win. “Jacob got the pick,” Penner said. “That was good.” “We think we’re going to score every time,” Larsen said of being up 24-0. “They start shooting gaps and blitzing the house, and we are on our heels. Once we got on our heels, it’s hard to stop that roll. We never quit. We fought and scrambled. It was an excellent way to end preseason.” Dunn finished 11-of-21 passing for 239 yards and two touchdowns. The Cardinals’ preseason record improves to 3-2. Dunn cut his arm on a Coyote helmet and went for stitches immediately after the game, but he and starting running back Travis Crockett, who did not play in the game, are both expected back for the Southeast 2B League opener at DeSales Friday. “The five-game preseason is to get us ready for league,” Larsen said. “And now it is here. We did improve and get better.” “We’re pretty excited (for league),” Penner said. “I feel like everything is working better and we’re ready for next week.” Waitsburg 24, Columbia-Burbank 22 Burbank 0 0 16 6 — 22 Waitsburg 7 14 3 0 — 24 Waits — Dunn 1 run (Garrity kick). Waits — Penner 49 pass from Dunn (Garrity kick). Waits — Kitselman 35 pass from Dunn (Garrity kick). Waits — Garrity 38 FG. C-B — Jamison 6 run (Humphreys pass from Brown). C-B — Gordon fumble recovery in end zone (Jamison pass from Brown). C-B — Dixon 17 pass from Brown (pass intercepted). C-B Waits", "external_links": [], "published": "2015-10-11T07:31:00.000+03:00", "crawled": "2015-10-11T08:52:06.315+03:00", "highlightTitle": ""}