{"organizations": [], "uuid": "114db820089a2b7a72199598e79aee9eca301133", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.abqjournal.com", "main_image": "http://main.abqjournal.netdna-cdn.com/wp-content/plugins/journal-open-graph/img/albuquerque-journal.jpg", "site_section": "http://www.abqjournal.com/", "section_title": "Albuquerque and New Mexico News, Sports, Business and more | Albuquerque Journal News", "url": "http://www.abqjournal.com/653476/news/obama-wants-longterm-budget.html", "country": "US", "title": "Obama wants long-term budget", "performance_score": 0, "site": "abqjournal.com", "participants_count": 1, "title_full": "Obama wants long-term budget | Albuquerque Journal News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T08:05:00.000+03:00", "replies_count": 0, "uuid": "114db820089a2b7a72199598e79aee9eca301133"}, "author": "Andrew Taylor / The Associated Press", "url": "http://www.abqjournal.com/653476/news/obama-wants-longterm-budget.html", "ord_in_thread": 0, "title": "Obama wants long-term budget", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON – President Barack Obama said Friday he won’t sign another temporary government funding bill after the current one expires Dec. 11, insisting that congressional Republicans and Democrats work out a long-term budget deal with the White House.\nObama said such a deal should lift a freeze on the budgets of both the Pentagon and domestic agencies. Speaking at a White House news conference, he said he “won’t sign another shortsighted spending bill” and asserted that the U.S. can’t cut its way to prosperity.\nOn the so-called debt limit, which needs to be raised above the current $18.1 trillion cap by early November, Obama said he won’t repeat a 2011 negotiation over companion spending cuts that brought the nation to the brink of a first-ever default on its obligations.\n“We’re not going back there,” he said.\nNeither position was new or surprising, but the president’s statements came after Capitol Hill was roiled by the resignation of House Speaker John Boehner, R-Ohio.\nHe decided to leave Congress after a revolt among tea party forces who wanted him to use a temporary spending bill to force Obama to take away Planned Parenthood’s federal funding.\nThe same conservatives generally opposed lifting tight caps on spending set by the 2011 budget deal.\nTalks on spending were just beginning and were expected to focus on finding long-term cuts elsewhere in the budget to permit higher spending on the day-to-day operations of government agencies. Agreement will be difficult, in large part because of a lack of politically easy spending cuts and disagreement over how to use any money from the cuts.\nFour years ago Obama agreed to spending cuts in exchange for getting a $2.1 trillion debt limit increase through Congress. Since then he has twice refused to negotiate over the debt-ceiling issue and Congress has lifted the debt limit both times with sweeping support from Democrats.\nTreasury Secretary Jacob Lew informed Congress on Thursday that it needs to act by Nov. 5, earlier than most on Capitol Hill had thought. The issue probably will need to be dealt with before Boehner leaves at the end of the October.\nObama said that Boehner’s resignation, which has sparked GOP infighting in a handful of House leadership races, complicates the situation.\nBut Boehner says he would like to clean out Congress’ barn of as much unfinished business as possible and he may have more leeway now that he doesn’t have to worry about tea party lawmakers demanding his scalp.", "external_links": [], "published": "2015-10-03T08:05:00.000+03:00", "crawled": "2015-10-03T09:57:13.866+03:00", "highlightTitle": ""}