{"organizations": [], "uuid": "326b23ae5699a2544c1295188ec33bac90ae39e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "jacksonville.com", "main_image": "http://jacksonville.com/sites/default/files/leonard_1.jpg", "site_section": "http://feeds.jacksonville.com/JacksonvillecomSports#", "section_title": "Jacksonville sports news - Jacksonville.com and The Florida Times-Union", "url": "http://jacksonville.com/sports/college/florida-gators/2015-10-15/story/florida-must-do-what-others-havent-and-contain-lsu", "country": "US", "title": "Florida must do what others haven't and contain LSU star RB Leonard Fournette", "performance_score": 0, "site": "jacksonville.com", "participants_count": 1, "title_full": "Florida must do what others haven't and contain LSU star RB Leonard Fournette", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T05:20:00.000+03:00", "replies_count": 0, "uuid": "326b23ae5699a2544c1295188ec33bac90ae39e2"}, "author": "Graham Hack • For the Times-Union", "url": "http://jacksonville.com/sports/college/florida-gators/2015-10-15/story/florida-must-do-what-others-havent-and-contain-lsu", "ord_in_thread": 0, "title": "Florida must do what others haven't and contain LSU star RB Leonard Fournette", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home / Sports Florida must do what others haven't and contain LSU star RB Leonard Fournette \nBy Graham Hack • For the Times-Union Thu, Oct 15, 2015 @ 10:20 pm | updated Thu, Oct 15, 2015 @ 10:22 pm Back Photo: 1 of 3 Next AP FILE - In this Sept. 26, 2015, file photo, LSU running back Leonard Fournette (7) gets past Syracuse cornerback Wayne Morgan (2) for a touchdown in the first half of an NCAA college football game, in Syracuse, N.Y. It might be the matchup of the season: LSU running back Leonard Fournette, perhaps the nation's best player vs. Florida's vaunted defense. The No. 6 Tigers and No. 8 Gators meet in prime time Saturday in a game between unbeaten teams. (AP Photo/Mike Groll, File) Back Photo: 2 of 3 Next AP Mike Groll Associated Press LSU running back Leonard Fournette runs for a touchdown against Syracuse on Sept. 26. It might be the matchup of the season: LSU running back Leonard Fournette, perhaps the nation's best player vs. Florida's vaunted defense. Back Photo: 3 of 3 Next AP Associated Press Leonard Fournette has 45 percent of LSU's yards from scrimmage. \nGAINESVILLE | Three weeks ago, Tennessee quarterback Joshua Dobbs and running back Jalen Hurd exposed a tackling problem with Florida’s defense. \nAnd although the Gators have improved in that area since then, they have yet to face another physical running game since that contest. \nThat’s about to change on Saturday when Florida faces LSU running back Leonard Fournette, a player UF coach Jim McElwain believes is salivating at the thought this weekend’s matchup. \n“I’m sure he talked to the guys at Tennessee and probably feels like he could get up over 300 (yards) the way we tackle,” McElwain said. \nCompared to what the sophomore has already done this season, that wouldn’t be much of a stretch. \nThrough just five games, Fournette has already accumulated 1,022 rushing yards while averaging a staggering 8.6 yards per carry. That’s an average of 204.4 yards per game — nearly 50 yards more per game than the next closest player in the nation. \nHe has also accounted for 45 percent of the Tigers’ yards from scrimmage this season — the highest percentage from any individual player among Power Five conference teams. \nBut numbers only tell part of the story. For Florida’s defenders, the eye test tells them all they need to know about the running back. \n“He’s a nasty runner,” linebacker Jarrad Davis said. “He’s the best athlete in the nation. He’s going to be the Heisman winner, I think, just from seeing him on film compared to everybody else. He jumps out more than anybody else I’ve seen.” \nFlorida’s associate head coach and linebackers coach Randy Shannon sees a deadly combination in Fournette, a player the coach called “special.” \n“He’s a big guy that’s very powerful and has quick feet,” Shannon said. “That’s what people really don’t understand about him, he’s very quick and light on his feet.” \nSo how does Florida plan on bringing Fournette to the ground? \n“We gotta grab cloth and swarm the football,” Shannon said. “It can’t be a one-guy tackle, it’s gotta be like four or five guys gang-tackling.” \nThe Gators learned from the Tennessee game about missing in one-on-one situations, and they are determined to not leave individual defenders out on islands against the Heisman favorite. \n“One guy gets there, misses a tackle and then he breaks for 70, 80 yards,” Davis said. “We don’t want that to happen.” \nDefensive lineman Jonathan Bullard echoed those sentiments, saying that it’s paramount that the defense sticks to its game plan. \n“He’s the best back in the league,” Bullard said. “We’re just going to have to rally to the ball and tackle him.” \nThe senior is confident about he and his teammates’ chances. \n“He’s nothing that we can’t stop,” Bullard said.", "external_links": [], "published": "2015-10-16T05:20:00.000+03:00", "crawled": "2015-10-16T18:12:41.620+03:00", "highlightTitle": ""}