{"organizations": [], "uuid": "0bb1f83c869351cf0ccd09a83c22affd44ee061f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "thecourier.com", "main_image": "http://thecourier.com/wp-content/uploads/2015/10/UFUniversityofFindlayLogo14-150x150.jpg", "site_section": "http://thecourier.com/category/local-sports/feed", "section_title": "The Courier » Local Sports", "url": "http://thecourier.com/local-sports/2015/10/13/locally-oilers-second-in-bing-beall-classic/", "country": "US", "title": "Locally: Oilers second in Bing-Beall Classic", "performance_score": 0, "site": "thecourier.com", "participants_count": 1, "title_full": "Locally: Oilers second in Bing-Beall Classic", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T07:39:00.000+03:00", "replies_count": 0, "uuid": "0bb1f83c869351cf0ccd09a83c22affd44ee061f"}, "author": "The Courier", "url": "http://thecourier.com/local-sports/2015/10/13/locally-oilers-second-in-bing-beall-classic/", "ord_in_thread": 0, "title": "Locally: Oilers second in Bing-Beall Classic", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comment: 0 \nAll-tournament selections Kasey Petty and Shelby Warner were second and third in the medalist standings in leading the University of Findlay women’s golf team to a runner-up finish in the William Bing-Beall Fall Classic that wrapped up on Monday at the Findlay Country Club. \nPetty carded a 74-78–152 total in finishing second to Grand Valley State medalist Gabrielle Shipley (75-74–149). Warner shot 77-77–154 and tied for third. \nMackenzie Torres (83-76) fired a 159 and Samantha Hatter (83-77) added a 160 for UF’s 625 total. Grand Valley State went 310-304–614 to win the title. UF (317-308) was a solid second, finishing well ahead of Ashland (313-329–642), Northwood (310-33–643) and California-Pa. (318-328–646). \nBING-BEALL FALL CLASSIC AT FINDLAY COUNTRY CLUB \nTEAM STANDINGS: 1, Grand Valley State 310-304–614. 2, Findlay 317-308–625. 3, Ashland 313-329–642. 4, Northwood 310-333–643. 5, California-PA 318-328–646. 6, Walsh 331-332–663. 7, Merrimack College 333-331–664. 8, Ohio Dominican 334-333–667. 9, Ferris State 333-338–671. 10, Gannon 348-343–691. 11, Northern Michigan 339-355–694. 12, Tiffin 347-351–698. 13, Lake Superior State 358-351–709. 14, Wayne State 357-358–715. 15, Seton Hill 364-352–716. 16, Malone 355-375–730. \nOTHER UF SCORES: Mikaela Hickey 166, Kelsey Koesters 173, Hannah Schneider 175, Courtney Piatt 177 Haley Gray 181, Erin Scoby 182. \nUF equestrian wins \nCOOLVILLE — Katie Pohlman was the reserve champion on Saturday and Bethany Ockwell and Alexa Murray tied for reserve champion honors on Sunday when the University of Findlay English equestrian team opened its season with a pair of wins at the Stonegate Farm in Coolville. \nSATURDAY’S FIRSTS OPEN FENCES — Bethany Ockwell. INTERMEDIATE FENCES — Katie Pohlman. NOVICE FENCES — Melanie McCaffrey, Elle Brady. OPEN FLAT — Katie Pohlman. INTERMEDIATE FLAT — Elle Brady, Courtney O’Connor. NOVICE FLAT — Alexa Murray. WALK-TROT-CANTER — (advanced) Kacie Green, Lizzie Lengling. (beginner) Nicole Fox. WALK TROT — Megan Dulle. SUNDAY’S FIRSTS OPEN FENCES — Ockwell. NOVICE FENCES — O’Connor. OPEN FLAT –Jessica Barno, Emily Gill. INTERMEDIATE FLAT — Alyssa Simin. WALK-TROT-CANTER — (advanced) Lengling. (beginner) Morgan Turner, Maria Hogya. \nLyons named player of the week \nUniversity of Findlay senior Julie Lyons has been named the Great Lakes Intercollegiate Athletic Conference South Division Volleyball Player of the Week. \nLyons, who leads the GLIAC with a .437 spiking accuracy, had 19 kills and six blocks in leading the Oilers to wins over and No. 25-ranked Saginaw Valley State and Wayne State. \nLyons’ six blocks gave her 58 on the season and ranks her seventh in the GLIAC in that category. \nBU’s Parmenter named HCAC Volleyball Player of the Week \nBLUFFTON — Bluffton University’s Kendra Parmenter, who set a school record for career kills in leading the Beavers to wins over Defiance and Transylvania, has been named the Heartland Collegiate Athletic Conference Volleyball Player of the Week. \nParmenter broke Casey May’s BU record for career kills (1,327) when she had 17 in a 3-0 sweep of Defiance College. The senior outside hitter had 15 kills against Transylvania, boosting her current total to 1,345. Last week’s two wins ran Bluffton’s winning streak to 10 straight matches and boosted the Beavers record to 13-6 overall and 4-0 in the HCAC. \nONU’s Janusz named OAC Men’s Soccer Player of the Week \nADA — Ohio Northern junior David Janusz has been named the Ohio Athletic Conference Men’s Soccer Player of the Week after accounting for three goals and an assist in the Polar Bears’ wins over Wilmington and Mount Union. \nJanusz scored the only goal of the match in a 1-0 win over Mount Union that improved ONU’s record to 11-3 overall and 3-0 in the OAC. \nKemenah wins \nAlvada’s Chad Kemenah captured the final sprint car race of 2015 at Millstream Speedway when he held off Bryan Clauson to win the 30-lap 410 sprints race in the season finale. \nIn UMP Late Model action, it was Steve Casebolt picking up the feature win over Ada’s Jon Henry in the 30-lap event. \nTony Anderson won an accident-filled 20-lap stock car/truck race.", "external_links": [], "published": "2015-10-13T07:39:00.000+03:00", "crawled": "2015-10-13T16:53:36.724+03:00", "highlightTitle": ""}