{"organizations": [], "uuid": "09eb337705ccdbabbae34a564734e6045c43fa32", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fox8live.com", "main_image": "http://APMOBILE.images.worldnow.com/images/8945847_G.jpg", "site_section": "http://www.fox8live.com/", "section_title": "New Orleans News, Weather, Saints - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "url": "http://www.fox8live.com/story/30185236/the-latest-on-storms-record-rainfall-in-south-carolina", "country": "US", "title": "The Latest on storms: Record rainfall in South Carolina", "performance_score": 0, "site": "fox8live.com", "participants_count": 1, "title_full": "The Latest on storms: Record rainfall in South Carolina - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "09eb337705ccdbabbae34a564734e6045c43fa32"}, "author": "cbs8", "url": "http://www.fox8live.com/story/30185236/the-latest-on-storms-record-rainfall-in-south-carolina", "ord_in_thread": 0, "title": "The Latest on storms: Record rainfall in South Carolina", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By The Associated Press\nThe latest on the rainstorm that is pounding parts of the East Coast (all times local):\n8:05 a.m.\nGov. Nikki Haley says South Carolina is facing rain and flooding the likes of which haven't been seen in 1,000 years, with 2 feet of rain reported in some areas.\nHaley told NBC's Today show on Monday morning, \"Our obvious priority is safety.\"\nHaley says six people have died in her state. Another died in North Carolina.\nThe governor also says: 381 roads are closed, with 127 bridges down. More than two dozen shelters are open. Over 1,000 law enforcement personnel and 1,000 transportation department workers are working. Utility crews are working to restore service to 30,000 customers.\nHaley says most people are heeding her plea to stay off the roads.\nShe says: \"I think they get it. All you have to do is look out the window and see the flooding. It doesn't take long for you to get in your car and realize you've got to turn back around.\"\nHaley plans another update at an 11:30 a.m. news conference. She warns that the worst isn't over yet, as rain is still falling.\n7:25 a.m.\nRecord rainfall totals have been recorded in South Carolina's capital city as part of historic flooding that has deluged the area.\nThe National Weather Service says Sunday was the wettest day in the history of Columbia. The rainfall total at the Columbia Metropolitan Airport was 6.87 inches, the most rain that's ever fallen there in one day.\nForecasters say the old record of 5.79 inches was set July 9, 1959.\nThe two-day rainfall total for Saturday and Sunday was 10.44 inches. That breaks the old record of 7.69 inches set over August 16 and 17, 1949.\nSince Friday, more than 20 inches of rain has fallen in some parts of Columbia. The Weather Service says Gills Creek, an area that has seen neighborhoods and thoroughfares under water, had recorded 20.28 inches as of early Monday morning.\nThe storm stretched beyond South Carolina - in Georgia, more than 14,000 customers were still without power early Monday. That's down from 33,000 at the height of outages in the state. Many of the outages were in hard-hit Habersham County, where schools are closed Monday. Rain and high winds that toppled trees caused the outages.\n6:50 a.m.\nAuthorities have released information about a South Carolina Department of Transportation worker killed in the aftermath of torrential rains and historic flooding in the state.\nThe agency says in a news release that 45-year-old Timothy Wayne Gibson died in flood waters Sunday while overseeing work near downtown Columbia.\nDOT says Gibson was working on Garners Ferry Road, a major thoroughfare into the capital city that has seen feet of water pooling in residential and commercial areas.\nTransportation officials say Gibson was with the agency's Richland Maintenance Unit and was traveling in a truck that was caught in rushing waters, overturned and was swept away. An autopsy is scheduled Monday.\nSo far, at least seven deaths have been blamed on the vast storm that has forced hundreds from their homes, canceled schools and prompted rescues of stranded citizens by water and air.\n6 a.m.\nThousands of South Carolina residents are waking up to homes without electricity after historic flooding throughout the state.\nAn online coverage map showed that power was out early Monday morning for more than 13,500 South Carolina Electric & Gas customers. Nearly 12,000 of those outages were in Richland and Lexington counties, where flood waters have been abundant in many neighborhoods and commercial areas.\nDuke Energy said that about 7,800 of its customers had no electricity, primarily in the northwestern corner of South Carolina.\nAs of late Sunday afternoon, officials said more than 6,000 electric cooperative customers were without power, most of those also in the central and northwestern parts of the South Carolina.\n5:50 a.m.\nA mother and her infant affected by historic South Carolina flooding have been rescued from their roof top via helicopter.\nThe U.S. Coast Guard said in a news release that a crew plucked Cristi Mueller and her 15-month-old daughter Kailynn Walts from the roof of their home in Huger in Berkeley County.\nCrews got reports at around 6:20 a.m. Sunday that the family was stranded due to severe flooding in the neighborhood.\nA crew aboard an MH-65 Dolphin helicopter from Coast Guard Air Station Savannah, Georgia, was launched to rescue the two. Mueller and her daughter were taken to Mt. Pleasant Regional Airport. Officials say the woman and her child were not hurt.\n4:45 a.m.\nDays of torrential rains kept much of South Carolina and its capital gripped by floodwaters early Monday as emergency responders promised renewed door-to-door searches for anyone still trapped after a weekend deluge and hundreds of rescues.\nAt least seven weather-related deaths have been blamed on the rainstorm that has lingered for days and been linked to an unusually deep low pressure system. The storm dumped so much rain on South Carolina and parts of surrounding states that even veteran weather experts called it unprecedented.\nPolice in Columbia, the capital city, said searchers would go door-to-door in the hardest-hit areas later Monday for any still seeking safety. And it could take weeks or longer to ensure the safety of numerous roads, highways and bridges rendered impassible by a historic rainstorm that pummeled South Carolina.\n10:45 p.m.\nPolice in the flooded South Carolina capital of Columbia say they and other emergency crews will continue with \"concentrated search and rescue operations\" early Monday.\nColumbia Police Chief William Holbrook issued a statement saying the operations would check for any people in the city and nearby Richland County still needing evacuation from flooded areas.\nHe urged anyone still needing to get to safety to call 911.\n\"The operation will also include overall welfare checks,\" he said, adding crews will mark the front doors of homes checked with a fluorescent orange X once searched.\nAnyone found is to be taken out on military vehicles to safety, he added.\n ", "external_links": [], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-05T15:25:30.086+03:00", "highlightTitle": ""}