{"organizations": ["Fluvanna County High School"], "uuid": "21d300615232b09c4bf2126d035e6b7cf00ce8c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newsleader.com", "main_image": "http://www.gannett-cdn.com/-mm-/77db7c0156ace0aa2da84cbf1d29f853baf53cf4/c=0-222-2400-1578&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/24/Staunton/Staunton/635813187376082032-20151024-Conf29Cheer-GM-007.JPG", "site_section": "http://rssfeeds.newsleader.com/staunton-sports", "section_title": "Staunton - Sports", "url": "http://www.newsleader.com/story/sports/high-school/2015/10/24/waynesboro-leap-ahead-cheerleading-tourney/74565934/", "country": "US", "title": "Waynesboro leaps ahead at cheerleading tourney", "performance_score": 0, "site": "newsleader.com", "participants_count": 0, "title_full": "Waynesboro leaps ahead at cheerleading tourney", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T06:00:00.000+02:00", "replies_count": 0, "uuid": "21d300615232b09c4bf2126d035e6b7cf00ce8c9"}, "author": "", "url": "http://www.newsleader.com/story/sports/high-school/2015/10/24/waynesboro-leap-ahead-cheerleading-tourney/74565934/", "ord_in_thread": 0, "title": "Waynesboro leaps ahead at cheerleading tourney", "locations": ["Waynesboro"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Griffin", "Eden Otero"], "text": "Waynesboro leaps ahead at cheerleading tourney Eden Otero , eotero@newsleader.com 12 a.m. EDT October 25, 2015 Buy Photo Waynesboro cheerleaders dance together in their locker room between rounds during the Conference 29 competition cheer championship at Fluvanna County High School on Saturday, Oct. 24, 2015. (Photo: Griffin Moores/The News Leader) Buy Photo 222 CONNECT 4 TWEET LINKEDIN COMMENT EMAIL MORE \nPALMYRA - When Waynesboro’s cheer coach retired, Rebecca Stanley was asked to take over the Waynesboro cheer program or watch it fold. \nHer first request as head coach was that her daughter, Lanae Quick, be given the assistant coach position. \n“She eats, sleeps and breathes cheerleading,” Stanley said. “I don’t know anyone that would be better in this position than her. It didn’t make sense not to bring her. She’s been doing this her entire life. She’s competed on national teams.” \nStanley’s request paid off. \nAfter months of injuries, practices and competition, Waynesboro took first place in the Conference 29 cheer tournament with 260, the second place score, which came from Broadway, was 244.5. Buy Photo Waynesboro's Bryahnna Trice flips across the mat during the Conference 29 competition cheer championship at Fluvanna County High School on Saturday, Oct. 24, 2015. Griffin Moores/The News Leader, Griffin Moores/The News Leader Buy Photo Fullscreen Buy Photo Waynesboro cheerleaders run out to the performance mat during the Conference 29 competition cheer championship at Fluvanna County High School on Saturday, Oct. 24, 2015. Griffin Moores/The News Leader, Griffin Moores/The News Leader Buy Photo Fullscreen Buy Photo Fort Defiance cheerleaders perform during the Conference 29 competition cheer championship at Fluvanna County High School on Saturday, Oct. 24, 2015. Griffin Moores/The News Leader, Griffin Moores/The News Leader Buy Photo Fullscreen Buy Photo Waynesboro cheerleaders warmup during the Conference 29 competition cheer championship at Fluvanna County High School on Saturday, Oct. 24, 2015. Griffin Moores/The News Leader, Griffin Moores/The News Leader Buy Photo Fullscreen Buy Photo Fort Defiance cheerleaders perform during the Conference 29 competition cheer championship at Fluvanna County High School on Saturday, Oct. 24, 2015. Griffin Moores/The News Leader, Griffin Moores/The News Leader Buy Photo Fullscreen Buy Photo Waynesboro cheerleaders embrace after the second round of the Conference 29 competition cheer championship at Fluvanna County High School on Saturday, Oct. 24, 2015. Griffin Moores/The News Leader, Griffin Moores/The News Leader Buy Photo Fullscreen Buy Photo Waynesboro's Sonny Carey stretches during the Conference 29 competition cheer championship at Fluvanna County High School on Saturday, Oct. 24, 2015. Griffin Moores/The News Leader, Griffin Moores/The News Leader Buy Photo Fullscreen Buy Photo Waynesboro cheerleaders perform during the Conference 29 competition cheer championship at Fluvanna County High School on Saturday, Oct. 24, 2015. Griffin Moores/The News Leader, Griffin Moores/The News Leader Buy Photo Fullscreen Buy Photo Waynesboro head coach Rebecca Stanley raises her arms to high five her athletes before the start of the Conference 29 competition cheer championship at Fluvanna County High School on Saturday, Oct. 24, 2015. Griffin Moores/The News Leader Fullscreen Buy Photo Injured Fort Defiance cheerleaders shout along with their performing teammates during the Conference 29 competition cheer championship at Fluvanna County High School on Saturday, Oct. 24, 2015. Griffin Moores/The News Leader, Griffin Moores/The News Leader Buy Photo Fullscreen Buy Photo Fort Defiance cheerleaders perform during the Conference 29 competition cheer championship at Fluvanna County High School on Saturday, Oct. 24, 2015. Griffin Moores/The News Leader, Griffin Moores/The News Leader Buy Photo Fullscreen Buy Photo Nervous before the first round of their Conference 29 competition cheer championship, Brooklyn Sims, right, grabs onto her teammate and fellow Waynesboro classmate Sonny Carey at Fluvanna County High School on Saturday, Oct. 24, 2015. Griffin Moores/The News Leader, Griffin Moores/The News Leader Buy Photo Fullscreen Buy Photo After injuring her back, Waynesboro cheerleader Alexis Keene is tended to by her mom, Brandi Bane, left, and head coach Rebecca Stanley, right, after the last round in the Conference 29 competition cheer championship at Fluvanna County High School on Saturday, Oct. 24, 2015. Griffin Moores/The News Leader, Griffin Moores/The News Leader Buy Photo Fullscreen Buy Photo Fort Defiance cheerleaders perform during the Conference 29 competition cheer championship at Fluvanna County High School on Saturday, Oct. 24, 2015. Griffin Moores/The News Leader, Griffin Moores/The News Leader Buy Photo Fullscreen Buy Photo Waynesboro cheerleaders dance together in their locker room between rounds during the Conference 29 competition cheer championship at Fluvanna County High School on Saturday, Oct. 24, 2015. Griffin Moores/The News Leader", "external_links": [], "published": "2015-10-25T06:00:00.000+02:00", "crawled": "2015-10-25T10:53:19.847+02:00", "highlightTitle": ""}