{"organizations": [], "uuid": "4a6bbcf2b20a4974178a68318981fed65b8f15e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.al.com", "main_image": "http://imgick.al.com/home/bama-media/width620/img/alphotos/photo/2015/09/30/18873220-large.jpg", "site_section": "http://blog.al.com/sports_birmingham_impact/atom.xml", "section_title": "Sports Birmingham Impact", "url": "http://www.al.com/alabamafootball/index.ssf/2015/10/rapper_uncle_luke_told_nick_sa.html", "country": "US", "title": "Rapper Uncle Luke told Nick Saban to wear longer shorts", "performance_score": 0, "site": "al.com", "participants_count": 1, "title_full": "Rapper Uncle Luke told Nick Saban to wear longer shorts | AL.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T11:22:00.000+03:00", "replies_count": 0, "uuid": "4a6bbcf2b20a4974178a68318981fed65b8f15e3"}, "author": "John Talty | jtalty@al.com", "url": "http://www.al.com/alabamafootball/index.ssf/2015/10/rapper_uncle_luke_told_nick_sa.html", "ord_in_thread": 0, "title": "Rapper Uncle Luke told Nick Saban to wear longer shorts", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Luther Campbell, best known as Uncle Luke from the 2 Live Crew, had some advice for Nick Saban.\nCampbell met the Alabama head coach when he brought a group of Miami high school football players to a summer camp. What happened next is best described by Campbell in his own words from a terrific profile of the rapper on SBNation.\n\"It was strange that Nick Saban knows who I am. That was strange. He walks up and he's like, 'Heeeey man! What's up! Come up to the office!' So we get up there, and he's like, 'I listen to your music!' I'm sitting there looking at him like ... what? So you know I'm a s--- talker, so I start in. I told him, 'Look Nick, if me and you gonna be hanging out, you can't be wearing those tight ass shorts you got on. If we ever gonna break off and go out, you can't go like that!'\n\"Let me tell you, Nick is crazy, right. But I'm probably one of the few people down here that likes Nick. They call him Nick Satan down here, and talking to him, he knows it. He's like, 'Man, they hate me down here.' And I'm like, 'Yeah, they do.' At the same time, he's a cool dude, he is. He loves kids from Miami and wants them. When they played in the national championship down here, they let me come by the practice, so I went by and watched, learned some stuff.\"\nSaban spent two seasons with the Miami Dolphins before leaving to become Alabama's head coach. The move irked some Dolphins fans after Saban proclaimed that he wouldn't be the next Alabama coach. Saban has made recruiting Florida a major priority during his tenure in Tuscaloosa.\nCampbell's music with 2 Live Crew isn't exactly what one would expect Saban listens to, especially given his public preference for the Rolling Stones. But if Saban is great at one thing it's recruiting and knowing how to create advantages. If knowing Campbell's affiliation with the famous rap crew would help Alabama get a recruit, Saban is going to take advantage of that.\nIt seemed to work at least once with Campbell: It helped Alabama land future star receiver Amari Cooper. The rapper said Cooper was all set to commit to Miami, but when the Hurricanes coaches hesitated to take Cooper's commitment, Campbell loaded him back into the car for a trip to Tuscaloosa.\n\"Nick Saban's like, 'I want him right now. I want him and Artie Burns right now,'\" Campbell said. \"Nick stayed on him. Jumped on it. Kid went there.\"\nCheck out the rest of SB Nation's profile on Campbell here.", "external_links": ["http://www.sbnation.com/college-football/2015/10/7/9411057/luther-campbell-uncle-luke-coach-miami-hurricanes"], "published": "2015-10-08T11:22:00.000+03:00", "crawled": "2015-10-08T07:51:01.730+03:00", "highlightTitle": ""}