{"organizations": [], "uuid": "ad816270a8572ba8c94c92748637b7097c7f43e1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.si.com", "main_image": "http://cdn-jpg.si.com/sites/default/files/styles/si_gallery_slide/public/images/Jurgen-Klinsmann-USMNT-Mexico-CONCACAF-gold-cup.jpg?itok=rayd3KKc", "site_section": "http://www.si.com/htmlsitemap/2014/04/page-1", "section_title": "The Sports Illustrated HTML Sitemap Index for April, 2014 - SI.com", "url": "http://www.si.com/planet-futbol/2015/10/09/usa-mexico-concacaf-playoff-usmnt-michael-bradley-jurgen-klinsmann", "country": "US", "title": "USMNT: History won't help beat Mexico in CONCACAF Cup - Planet Futbol", "performance_score": 0, "site": "si.com", "participants_count": 1, "title_full": "USMNT: History won't help beat Mexico in CONCACAF Cup - Planet Futbol - SI.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "ad816270a8572ba8c94c92748637b7097c7f43e1"}, "author": "Brian Straus", "url": "http://www.si.com/planet-futbol/2015/10/09/usa-mexico-concacaf-playoff-usmnt-michael-bradley-jurgen-klinsmann", "ord_in_thread": 0, "title": "USMNT: History won't help beat Mexico in CONCACAF Cup - Planet Futbol", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "by Brian Straus Twitter Email Posted: Fri Oct. 9, 2015 Updated: Sat Oct. 10, 2015 PASADENA, Calif. – The U.S. national team enters Saturday evening’s Confederations Cup playoff against Mexico on a four-year unbeaten run against its archrival.\n“It’s a little sway of results. I think we’ve gotten the better of them the past so many times and I hope we keep that going,” midfielder Graham Zusi said. “We can’t look at these past five games and think we’re going to be safe.”\nIt’s six games, Graham. The U.S. is 3-0-3 against El Tri since losing the 2011 CONCACAF Gold Cup final here at the Rose Bowl.\n“Six, sorry,” he said. “Shows how much I care about the past.”\n• All of Sports Illustrated’s coverage for USA’s playoff against Mexico\nThat past has been relatively kind. Through four-plus years of ups, downs, fits and starts, the most consistent thing about coach Jurgen Klinsmann’s tenure has been the Americans’ superiority over Mexico. The U.S. went 1-0-1 during World Cup qualification in 2013 and the year before, it earned the program’s first win at the Death Star that was the Estadio Azteca.\n“Since Jurgen’s come in, things have been good,” goalkeeper Tim Howard said. “We’ve had a positive outlook. We’re confident. But we know how good they are as well. You say we have the edge. I think we have the edge. But we have to prove it.”\nIt’s a nice run of success over a very good team and the rivalry’s longest such string since Mexico enjoyed a 4-0-4 spell in the late 1990s. But Klinsmann and his players said prior to Friday’s training session, their last before taking the field against Mexico, that they had no explanation for it. No secret has been found, no weakness detected, no foolproof tactical plan devised that can be exploited or replicated on Saturday, they claimed. They’ll just have to hope their run continues for at least one more day.\nYour browser does not support iframes.\n“There’s no reason for [the streak],” Klinsmann said. “There’s a lot of respect for Mexico, always. How we approach them, how we analyze them, there’s admiration for them, for their individual players, for their program, for what they’ve done over so many years and for this rivalry. And every time you get to another clash, which happens tomorrow night, you start at 0-0 again. You have no idea how it will end, and that’s the exciting part about football. You can’t predict.”\nA search for patterns over the past few USA-Mexico matchups yields a couple of trends that may influence Klinsmann’s lineup. Captain Michael Bradley typically has played behind two attackers, which seems likely on Saturday with both Clint Dempsey and Jozy Altidore available and healthy. There’s been a stay-at-home defensive midfielder deployed in front of the back four in each of the past four USA-Mexico games. On three occasions it was Kyle Beckerman, who’s in camp and likely to see action. Clogging the middle and stunting Mexico's buildup is key.\nPlanet Futbol Video Tactical choices in the center key to USA-Mexico CONCACAF Cup playoff by Liviu Bird", "external_links": ["http://twitter.com/BrianStraus"], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-11T03:38:05.800+03:00", "highlightTitle": ""}