{"organizations": ["Ernie Davis Academy", "Elmira Notre Dame"], "uuid": "dc07dd501713117421040ec5cb06ee1342ef21a2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pressconnects.com", "main_image": "http://www.gannett-cdn.com/-mm-/fabd7713674d46ec3aade695178c800ca776c399/c=0-149-1600-1053&amp;r=x633&amp;c=1200x630/local/-/media/2015/09/26/CNYGroup/Elmira/635788910620014836--H3A9872.JPG", "site_section": "http://rssfeeds.pressconnects.com/binghamton/highschoolsports", "section_title": "Binghamton - High School Sports", "url": "http://www.pressconnects.com/story/sports/2015/09/28/fifth-quarter-sophomore-back-rise/72985026/", "country": "US", "title": "Crusaders' Craig wins twice at Elmira meet", "performance_score": 0, "site": "pressconnects.com", "participants_count": 0, "title_full": "Crusaders' Craig wins twice at Elmira meet", "spam_score": 0.0, "site_type": "news", "published": "2015-09-27T06:21:00.000+03:00", "replies_count": 0, "uuid": "dc07dd501713117421040ec5cb06ee1342ef21a2"}, "author": "", "url": "http://www.pressconnects.com/story/sports/2015/09/28/fifth-quarter-sophomore-back-rise/72985026/", "ord_in_thread": 0, "title": "Crusaders' Craig wins twice at Elmira meet", "locations": ["Elmira"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Craig", "Ron Levanduski", "Jack Thomas", "Andrew Legare", "Thomas Natatorium", "Molly Craig"], "text": "Crusaders' Craig wins twice at Elmira meet Andrew Legare and Ron Levanduski, sgsports@gannett.com 11:21 p.m. EDT September 26, 2015 Junior has already qualified for state championship meet in four events this season Buy Photo Molly Craig of Elmira Notre Dame swims to a first place finish in the 100 butterfly during the Dr. Jack Thomas Girls Swimming and Diving during the Invitational at Ernie Davis Academy's Thomas Natatorium on Saturday. (Photo: RON LEVANDUSKI / Staff photo) Buy Photo 98 CONNECT 13 TWEET LINKEDIN COMMENT EMAIL MORE \nELMIRA — Elmira Notre Dame junior Molly Craig won two events Saturday and earned Most Valuable Performer honors at the Dr. Jack Thomas Girls Swimming and Diving Invitational at Ernie Davis Academy's Thomas Natatorium. \nCraig captured the 200-yard freestyle in 1 minute, 55.84 seconds and the 100 butterfly in 59.61 seconds, with both times eclipsing the standard to qualify for the New York state championships. Last weekend at an invitational at Owego, Craig topped the state standard in the 200 individual medley and 500 freestyle. \n\"I'm really happy with with how I did today, and I'm also happy with how everyone on our team did today,\" Craig said. \"I'm really proud of everyone and just happy that I can be part of the Notre Dame girls swim team.\" \nCraig competed at states in the 200 individual medley relay last year. She will have plenty of options at this year's state meet. \n\"I'm super excited. It seems surreal,\" she said. \"I still can't believe it that I went from one to four, but it helps with training and my coaches are really great.\" \nHorseheads didn't win any events but still took home the Class A team title for the fifth straight year with 362 points, topping runner-up Maine-Endwell's 314. Ithaca finished third with 263. \n\"It was a good meet for us,\" Horseheads head coach Mark Miles said. \"I feel like I say this every year, but we were just kind of swimming in slow motion through the first half of the season and we show up here and I don't know what the magic in the pool is, but the girls step up every year and put it together and get some good times out of this. Then we work on the second half of the year.\" \nLansing won the Class B team title and Waverly was the Class C team champion, with Notre Dame third. Buy Photo Elmira Notre Dame's Molly Craig swims to a first place in the 100 butterfly during the Dr. Jack Thomas Girls Swimming and Diving Invitational at Ernie Davis Academy's Thomas Natatorium. Craig also won the 200 freestyle and was named the Most Valuable Performer of the meet. RON LEVANDUSKI / Staff photo", "external_links": [], "published": "2015-09-27T06:21:00.000+03:00", "crawled": "2015-10-02T02:15:33.672+03:00", "highlightTitle": ""}