{"organizations": [], "uuid": "83cda969f7824280deede20a11f11248fb960ea1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "chicago.suntimes.com", "main_image": "http://bullseye-prod.aggrego.org//wp-ag/wp-content/uploads/sites/71/2015/10/HomelessBelongings.jpg?o=eyJ3aWR0aCI6MCwiaGVpZ2h0IjowLCJ4IjowLjUsInkiOjAuNX0%3D&amp;s=RWZt8hzz%2BhHrTVgkJtKF%2F5nPRrI%3D", "site_section": "http://chicago.suntimes.com/", "section_title": "Chicago Sun-Times | Chicago : News : Politics : Things To Do : Sports", "url": "http://chicago.suntimes.com/chicago-politics/7/71/1019895/aldermen-vent-frustrations-chicagos-losing-battle-homelessness", "country": "US", "title": "Aldermen vent frustrations about city's losing battle against homelessness", "performance_score": 0, "site": "suntimes.com", "participants_count": 1, "title_full": "Aldermen vent frustrations about city's losing battle against homelessness | Chicago Sun-Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T21:07:00.000+03:00", "replies_count": 0, "uuid": "83cda969f7824280deede20a11f11248fb960ea1"}, "author": "| emailAddress.indexOf('@') == -1) {errorString = 'Please enter your email address';} var isError = false; if (errorString.length > 0) isError = true; if (isError) alert(errorString); return !isError;}", "url": "http://chicago.suntimes.com/chicago-politics/7/71/1019895/aldermen-vent-frustrations-chicagos-losing-battle-homelessness", "ord_in_thread": 0, "title": "Aldermen vent frustrations about city's losing battle against homelessness", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sometimes, the frustrations of being a Chicago alderman just boil over. And it’s not always about the looming vote on a $588 million property tax increase that could shorten the political careers of aldermen who dare to support it.\nAt a city budget hearing on Thursday, some Chicago aldermen let loose about what they called the city’s failed effort to attack the intransigent problem of homeless people suffering from mental illness and substance abuse.\nAld. Ariel Reboyras (30th) said he sees the same needy people so often on the streets of his North Side ward, he knows them by their first names.\n“It’s sad. I got so upset that we couldn’t do anything with one of the homeless persons on Milwaukee Avenue that I went across the street and I bought him a pint of vodka. I sat with him and drank some of that vodka with him because, if you can’t help him, you might as well join him,” Reboyras said.\n“Oh, no. That’s not true,” said Budget Committee Chairman Carrie Austin (34th).\nWhen Austin asked if he had helped the man, Reboyras said: “I got him shelter … We got him in a YMCA. My staff and I — we bought him clothes. These are little things that nobody knows the alderman does. I’m not speaking about me. I’m talking about everyone that’s here.”\nWith Lisa Morrison Butler, commissioner of the city’s Department of Family and Support Services, on the hot seat at City Council budget hearings, Reboyras said he has “yet to see any dollars” to help the situation of homeless people with mental illness.\n“They’re still there. They’ll walk from one location to another,” he said.\n“It’s not me, commissioner. There’s at least five wards — maybe 25 wards — dealing with this issue.”\nIndeed, Reboyras was not alone in unleashing his frustrations about the burgeoning problem of homelessness on Chicago streets.\nAld. Scott Waguespack (32nd) said he has “tried every which way” to get homeless people into shelters in coordination with delegate agencies funded by the city.\n“They come out. We’ll go out there with them. We’ll coordinate with Streets and San and with the Police, as we’re supposed to do. And nothing happens after that. That’s the frustrating part for me,” Waguespack said.\n“Many of them have mental illnesses that we’re not coordinating on. The stories go on every single day. Whether you’re walking to the train or you’re walking under the viaduct to the Metra or trying to get into a store. I just don’t see us giving them the options or the assistance.”\nAld. James Cappleman (46th), a former social worker, told the story of a bi-polar woman who lost one eye after a stabbing suffered on the streets. He said he never had seen the woman sober.\nCappleman said the city is spending hundreds of thousands of dollars a year on ambulance transports and emergency room visits for the woman, who is now in prison, when the money could be better spent on outreach.\n“We’re doing your department an incredible disservice. You need more funding. You need the resources to take on that leadership that the AIDS Foundation of Chicago did back in the 1980’s,” Cappleman told Butler, who has been on the job for just 50 days.\nCappleman noted that 12 years have passed since former Mayor Richard M. Daley unveiled his ambitious plan to end homelessness in Chicago.\n“It’s inexcusable that you do not have the needed resources to really help take charge and be the leader in getting these social services to work together to better coordinate and better collaborate with one another,” he said.\n“We are talking about a tough budget and property tax hikes. But, I really believe we will save the city a ton of money by providing you with the needed resources to do your job. There are too many people living on the streets. They will die—just like the AIDS crisis.”\nAld. Patrick Daley Thompson (11th), Daley’s nephew, said the northernmost portion of his ward between Roosevelt and Taylor has a “tent city” of homeless residents living beneath the expressway.\n“There has to be some compassion. Some of the neighbors sometimes get upset because they see people around. They don’t appreciate the fact that there’s mental illness,” said Thompson, whose ward includes the Pacific Gardens Mission.\n“We need to do something more to coordinate that effort. It seems to be a growing issue.”\nUnder questioning from downtown Ald. Brendan Reilly (42nd), Butler said she is working closely with the Department of Public Health to combat what has long been the most difficult to reach segment of Chicago’s homeless population.\n“With individuals who are suffering from either mental illness or have substance abuse, oftentimes it takes a long time for us to develop the relationship and trust that seems to be necessary before they will take the services,” Butler said.\n“It is challenging because they don’t have to go into shelter and they don’t have to take the services. So, this relationship that we need to develop with them, this trust, is a very necessary component of our outreach.”\nAccording to the last so-called “point-in-time count” conducted by the city, Chicago’s homeless population stands at just over 6,700. That’s a slight increase over previous count, but not as large an increase as other major cities, including New York and Los Angeles.\nButler estimated that 19.4 percent of those living on the streets and in shelters suffer from mental illness and that 22.7 percent have substance abuse problems.\n“There are individuals who, after they have been on the streets together for some time, start to feel like a family. And so, if you can’t move all of them and they can’t stay together, then sometimes they don’t want to be separated in order to go into a shelter,” Butler said.\n“I only say that as an example of how complex some of the reasons why people find themselves homeless might be.”\nAld. John Arena (45th) raised yet another complication: the “cottage industry” of unscrupulous operators who “take advantage” of the homeless by “using them as props.” They pay them $20-an-hour to panhandle from passing motorists and take a “cut of the proceeds.”\nArena suggested a public education campaign to convince the public that giving cash to the homeless is the “worst way to help.” Butler was all for the idea as a way to re-direct contributions to non-profits.\nOn the eve of his 2003 re-election, Daley established an ambitious but elusive goal of ending homelessness in Chicago by 2012 and embraced a plan to make it happen.\nIt called for shifting the focus away from shelters and toward permanent housing with a bottomless network of social services to “rebuild souls,” as Daley liked to say.\nLast fall, Mayor Rahm Emanuel lowered the bar to a more realistic, but still difficult-to-achieve goal: ending homelessness among veterans in Chicago by the end of 2015.\nThe mayor committed $800,000 in city dollars to a $5 million-a-year plan that will be primarily funded by the federal government.\nThe city’s share was to bankroll 36 “permanent supportive housing units,” rent subsidies for 70 more veterans and provide case management services to match vets with the housing option that best fits their needs.\n“By the end of 2015, there will not be a homeless veteran in the city of Chicago,” Emanuel said on that day.\n“I’m proud that the first community that we’re actually addressing and can say will not be homeless will be the veterans of our battlefields that have served their country valiantly, put their lives on the line, and we actually have put our resources into play to make sure that they have a roof over their head.”", "external_links": [], "published": "2015-10-08T21:07:00.000+03:00", "crawled": "2015-10-08T23:40:04.083+03:00", "highlightTitle": ""}