{"organizations": [], "uuid": "d67adff5dbf66d33c5808ddbdbbaace671a17c10", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcmiami.com", "main_image": "http://media.nbcmiami.com/images/1200*675/Eagles-Panthers.jpg", "site_section": "http://www.nbcmiami.com/news/sports/?rss=y&embedThumb=y&summary=y", "section_title": "NBC 6 South Florida - Sports", "url": "http://www.nbcmiami.com/news/sports/Philadelphia-Eagles-Carolina-Panthers-Sunday-Night-Football-NFL-336977941.html", "country": "US", "title": "Panthers Beat Eagles 27-16", "performance_score": 0, "site": "nbcmiami.com", "participants_count": 1, "title_full": "Panthers Beat Eagles 27-16", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T14:38:00.000+02:00", "replies_count": 0, "uuid": "d67adff5dbf66d33c5808ddbdbbaace671a17c10"}, "author": "DAVE ZANGARO", "url": "http://www.nbcmiami.com/news/sports/Philadelphia-Eagles-Carolina-Panthers-Sunday-Night-Football-NFL-336977941.html", "ord_in_thread": 0, "title": "Panthers Beat Eagles 27-16", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Getty Images The Eagles got down early again. But this time, they couldn’t recover in a 27-16 loss to the undefeated Panthers at Bank of America Stadium. The last two weeks, the Eagles gave up early touchdowns to the Saints and Giants but recovered to put together two straight wins. They couldn’t pull off another comeback on Sunday Night Football. At least they made it close. Christie Apologizes After Being Kicked Out of Amtrak Quiet Car The Eagles even got the ball with about three minutes left and trailing by eight points, but couldn’t move down the field and turned it over on downs in their own end while the Panthers added another field goal. With the loss, the Eagles blew an opportunity to have a winning record before bye week and fell to 3-4. The Panthers remain undefeated at 6-0. Paterno in Pa. Sports Hall of Fame The Eagles were down 15 points early in the third quarter after Carolina scored on its opening drive in the second half but the Eagles rebounded. The Birds scored on the ensuing drive, when Ryan Mathews took a handoff and went 63 yards for the score. Down five, the Eagles drove down the field but Caleb Sturgis missed a 50-yard field goal. The Panthers made a field goal on the ensuing drive to put them up eight. The Panthers got on the scoreboard first on a four-play, 72-yard drive in the first quarter. On that drive, the Panthers should have been pinned deep but an ill-timed and ill-advised headbutt from Najee Goode after the play gave them much better field position. The Eagles scored their first points on a 52-yard field goal by Sturgis. The field goal was Sturgis’ longest as an Eagle. But the Panthers scored on the next possession to extend the lead to two scores. With their win over the Cowboys on Sunday and the Eagles’ loss, the Giants are all alone in first place in the NFC East (see NFC East Wrap). Turning point After the Eagles’ first points of the game came on a long field goal, the Panthers got the Eagles to bite hard on a reverse play. Newton started to run the ball right and when the Birds’ defense shifted that way, he pitched the ball to Ted Ginn Jr., who sprinted down the left sideline for a gain of 43. Newton punched in a touchdown run two plays later to put the Panthers up, 14-3. Key stats While the Eagles forced three turnovers, they scored just six points off them. The Eagles gave up 204 rushing yards on Sunday night. Coming into the weekend, the biggest rushing output from any of their opponents was 127 by the Redskins. The Panthers had 118 rushing yards by halftime. Jonathan Stewart went over 100 yards and is the first running back to do so against the Eagles since Frank Gore last year in Week 4. Offensive stud Mathews continues to make his case for more carries. He had a 63-yard touchdown, the longest of his career. Bradford didn’t have an amazing game but he wasn’t the problem on Sunday. He made some nice throws and had many of his passes dropped. Offensive dud Jordan Matthews continues to have problems catching the ball. A couple more drops on Sunday night. One was thrown behind him but the ball was catchable and the bobble led to an interception. Another was a great pass from Bradford that would have gone for a first down. Darren Sproles dropped a couple and Josh Huff dropped one in the end zone. Two drops on the final drive of the game put the last nail in the coffin. Defensive stud Malcolm Jenkins had another good game and made a big-time interception toward the end of the first half. In fact, three of the four members in the secondary had interceptions. Defensive dud Bennie Logan, who had been playing at a Pro Bowl level, had two encroachment penalties that allowed Newton to have an easy rushing touchdown in the second quarter. Logan is also supposed to be the team’s run-stuffer but the Panthers put up a big game rushing against the Eagles. Injuries Eagles left tackle Jason Peters hurt his lower back and was carted off in the first quarter (see story). He went into the locker room for X-rays and did not return. It was announced that he had lower back spasms. DeMeco Ryans was inactive with a hamstring injury. He hurt his hammy last week against the Giants and didn’t practice all week. He was listed as questionable coming into the game. Up next The Eagles have their bye week and won’t be back in action until Nov. 8 against the Cowboys on the road. They follow that game with two at home against Miami and Tampa Bay. Published at 11:48 PM EDT on Oct 25, 2015", "external_links": [], "published": "2015-10-26T14:38:00.000+02:00", "crawled": "2015-10-26T16:49:41.940+02:00", "highlightTitle": ""}