{"organizations": ["First Carolina Practice Elliott Cranks Up First Carolina Practice Tools"], "uuid": "d3cb990686bf29dcd089f5e1d7fdd5f23bcfdc2d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.abccolumbia.com", "main_image": "http://media.abccolumbia.com/images/Elliott+prax+iso.jpeg", "site_section": "http://www.abccolumbia.com/sports/index.rss2", "section_title": "WOLO - Sports", "url": "http://www.abccolumbia.com/sports/Elliott-Gets-Praise-After-First-Practice-In-Charge-332597602.html", "country": "US", "title": "Elliott Cranks Up First Carolina Practice", "performance_score": 0, "site": "abccolumbia.com", "participants_count": 0, "title_full": "Elliott Cranks Up First Carolina Practice", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T07:10:00.000+03:00", "replies_count": 0, "uuid": "d3cb990686bf29dcd089f5e1d7fdd5f23bcfdc2d"}, "author": "", "url": "http://www.abccolumbia.com/sports/Elliott-Gets-Praise-After-First-Practice-In-Charge-332597602.html", "ord_in_thread": 0, "title": "Elliott Cranks Up First Carolina Practice", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Elliott"], "text": "Elliott Cranks Up First Carolina Practice Tools \nStory Created: Oct 13, 2015 at 11:41 PM EDT Story Updated: Oct 14, 2015 at 12:10 AM EDT COLUMBIA, S.C. (USC SID) -- The University of South Carolina football team practice for two hours on Tuesday afternoon at the new practice fields with music blaring from the speakers. It was the squad’s first practice under interim head coach Shawn Elliott.The players were taken aback by Steve Spurrier's decision to step down.“I was shocked. It was sad to see him go,” said junior linebacker T.J. Holloman of Steve Spurrier’s departure. “He’s a great coach. He has a great legacy here. He’s done a lot for this school that most people don’t even know.”“It’s sad,” echoed senior offensive guard Mike Matulis. “But what I think he did was very admirable, very respectable. It’s just sad. Coach Spurrier is a great guy. You all know it. You love to be around him and it’s sad to see him go.”Both players were excited to learn that Elliott was named interim coach.“I was happy for him,” said Holloman. “He works hard every day. He’s a great coach. He comes out here with a lot of enthusiasm. He just wants to win. That’s all he wants to do is win. You can see his intensity. He’s focused on getting everyone ready to play or Saturday. He uses the music for more excitement. He wants us to have a live mentality. He wants everything to be exciting, so he brought the music out here to keep that going.”“I was very excited,” noted Matulis. “I have a lot of respect for Coach Elliott. He brings such passion to the team, as you guys can see every Saturday. You can see it in his eyes that he’s just as fired up as anyone else. He brings that passion and fire to everybody on the team.”The players felt like this was bit of new beginning for them to right the ship over the final six games of the season and the practice had more energy.“Coach Elliott came the meeting today and said it’s a clean slate, it’s a new start,” said Holloman. “We’re 0-0 and right now we’re out here to work better and to beat Vandy.”“Today was one of the smoothest practices we’ve had in awhile,” added Matulis. “I felt like it was fast paced, we were hitting hard, everybody was moving, everybody was listening well. I really enjoyed it today.”Connor Mitch, who has been sidelined since the Kentucky game, the second game of the season, saw limited practice time on Tuesday, his second day of work with the team since his shoulder injury. Tailback Brandon Wilds (sore ribs) also practiced, while Deebo Samuel (hamstring) remained sidelined.The Gamecocks (2-4, 0-4 SEC) will host the Vanderbilt Commodores (2-3, 0-2 SEC) on Saturday, October 17. The annual Homecoming game is set for a 4 p.m. kick and will be televised on the SEC Network.The Gamecocks will return to the practice fields on Wednesday afternoon.", "external_links": [], "published": "2015-10-14T07:10:00.000+03:00", "crawled": "2015-10-14T15:30:48.208+03:00", "highlightTitle": ""}