{"organizations": ["Facebook Email Twitter Google"], "uuid": "ca9a690587396a7c426ff2a2954b8dfbaa406fda", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wkyc.com", "main_image": "http://cdn.tegna-tv.com/-mm-/b43894b91444667b39768987c833b2f90e50dd73/c=0-148-5299-3142&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/14/WKYC/WKYC/635803820604167343-USATSI-8855089.jpg", "site_section": "http://rssfeeds.wkyc.com/_/20/109671742/wkyc/sports", "section_title": "WKYC - Sports", "url": "http://www.wkyc.com/story/sports/nfl/browns/2015/10/14/josh-mccown-browns-have-to-build-off-momentum/73912232/", "country": "US", "title": "Josh McCown: Browns have to build off momentum", "performance_score": 0, "site": "wkyc.com", "participants_count": 0, "title_full": "Josh McCown: Browns have to build off momentum", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T22:00:00.000+03:00", "replies_count": 0, "uuid": "ca9a690587396a7c426ff2a2954b8dfbaa406fda"}, "author": "", "url": "http://www.wkyc.com/story/sports/nfl/browns/2015/10/14/josh-mccown-browns-have-to-build-off-momentum/73912232/", "ord_in_thread": 0, "title": "Josh McCown: Browns have to build off momentum", "locations": ["Baltimore"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mitch Stringer-USA", "Matthew Florjancic", "Josh McCown"], "text": "Facebook Email Twitter Google+ LinkedIn Pinterest Josh McCown: Browns have to build off momentum Browns QB Josh McCown knows the team has to build off the momentum they gained in Sunday's win over Baltimore. Post to Facebook Josh McCown: Browns have to build off momentum Browns QB Josh McCown knows the team has to build off the momentum they gained in Sunday's win over Baltimore.  //on.wkyc.com/1LudcFS   Join the Conversation To   Josh McCown: Browns have to build off momentum Matthew Florjancic, WKYC 3 p.m. EDT October 14, 2015 Browns QB Josh McCown knows the team has to build off the momentum they gained in Sunday's win over Baltimore. Browns QB Josh McCown knows the team has to build off the momentum they gained in Sunday's win over Baltimore. (Photo: Mitch Stringer-USA TODAY Sports) CONNECT TWEET LINKEDIN COMMENT EMAIL MORE \nThe first time the Cleveland Browns celebrated a victory this season, the hangover had an adverse effect, and they struggled through and needed a furious fourth-quarter comeback just to suffer a seven-point loss to the Oakland Raiders in front of their fans at FirstEnergy Stadium. \nNow, three weeks later, the Browns are sitting in a similar position after fighting hard to hold on for a 33-30 victory over the Baltimore Ravens in overtime at M&T Bank Stadium in Baltimore. However, the players know their mindset and approach to the week have to be completely different if they hope to keep the positive momentum going into Sunday's game against the Denver Broncos in what will be the Browns' only home game in October. \n\"It's crucial for us, especially as young of a team as we are,\" Browns quarterback Josh McCown said after the win over Baltimore. \"I know the guys are enjoying it, but we've got to get going on Denver and get our mind right. We've got a lot of games left, you know, and there's a great deal of satisfaction, and there's a lot that goes in every week, so we always say, it's hard to win a game in the National Football League. \n\"There's a lot that goes into every week of preparation, so when you do win, you have to sit back and enjoy it, there's no doubt about it. Especially in that kind of fashion, there's going to be a huge sense of accomplishment and all those things, but at the same time, we have to put that on the shelf and move forward and get focused on Denver and have that one-game-season mentality, where that's all we're thinking about and all we're focused on. I know the veterans and Coach Pett will be hammering that home this week so that we come out with that mindset.\" \nAlthough the Browns lost to the San Diego Chargers two weeks ago, they were confident heading into Sunday's game against the Ravens because of the way the team practiced throughout the week. Hughes knows a similar effort will be needed for the Browns to win back-to-back games for the first time since the end of October last year, when they rattled off three wins in an 11-day period. \n\"It's a big win for us because it's our first division game, and to start the division 1-0 is big,\" defensive lineman John Hughes said. \"Just to know that everybody came in and played all four quarters together, that was big for us. We were going in preaching about finishing games and being able to get it done in the last minute, and that's what we did. \n\"We talk about it all the time, not letting big losses carry on to the next week. That's the hangover part, and then, it's the same thing with wins. You don't want to get a win and be on your high horse and not be ready to play the next week, so all of those things, you've got to put in a box and just take the 24-hour rule, 48-hour rule, however you do it, and you enjoy the win or you break down the loss and then, you move forward. \n\"It's more coming out with the same mindset every Wednesday, Thursday and practice Friday, I guess. It's coming out with the mindset of getting better to get ready for Sunday. We've got a good team coming in here with Denver, and we know we've got the big test ahead of us, so (it's) just coming in with the right mindset.\" \nWith the win over the Ravens, the Browns started off AFC North Division play with a win for the first time since 2004, and their first overtime win since a 2007 win in Baltimore. That overtime win in 2007, which was also decided by a 33-30 count, was the last time the Browns defeated the Ravens in Baltimore. \n\"I just think it was a sense of relief because of how much we've put into the season and how we weren't getting the results,\" Browns coach Mike Pettine said. \"We exercised a lot of demons with a division win. We were 0-2 against Baltimore a year ago. We played them tough two times, had leads in the fourth quarter and couldn't finish. \n\"No moral victories. The fact is we went down there, a tough place to play, and went through the adversity we went through down 14-3, down 21-9 and we had the resolve to come back from both of those situations and find a way to win it. I was just so happy for the guys and happy for the staff because of how much has been put in and how the first quarter of the season went. Like I said, I hope we can relish this one briefly and use the momentum from it to move forward. \n\"To get the victory, you can just sense it in the building. We constantly talk about how important it is playing inside the division and to get a win on the road in overtime was huge. So we have to be able to build on it. We're not going to get too high from it. Again, as I say after losses, you gotta compartmentalize, but we certainly (believe) that this win is a team-building win and some real positive momentum for us.\" Read or Share this story: http://on.wkyc.com/1LudcFS TOP VIDEOS", "external_links": [], "published": "2015-10-14T22:00:00.000+03:00", "crawled": "2015-10-14T22:16:03.569+03:00", "highlightTitle": ""}