{"organizations": [], "uuid": "4f67109416f05fa8bf3d29d8cb13a87201a7fe9c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/49152148.cms", "site_section": "http://timesofindia.indiatimes.com/sports/South-Africa-in-India/top-stories/articlelist/4719919.cms", "section_title": "Top Stories - South Africa in India - Sports - The Times of India", "url": "http://timesofindia.indiatimes.com/sports/south-africa-in-india/top-stories/Shikhar-Dhawan-happy-with-his-comeback-ahead-of-South-Africa-series/articleshow/49152124.cms", "country": "IL", "title": "Shikhar Dhawan happy with his comeback ahead of South Africa series", "performance_score": 0, "site": "indiatimes.com", "participants_count": 5, "title_full": "Shikhar Dhawan happy with his comeback ahead of South Africa series - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T23:40:00.000+03:00", "replies_count": 5, "uuid": "386a1715c2a5482d582e12869fb018d1c5348bb2"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/sports/south-africa-in-india/top-stories/Shikhar-Dhawan-happy-with-his-comeback-ahead-of-South-Africa-series/articleshow/49152124.cms#post-0", "ord_in_thread": 0, "title": "Shikhar Dhawan happy with his comeback ahead of South Africa series", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BENGALURU: India A captain Shikhar Dhawan on Tuesday said the unofficial three-day match against Bangladesh A gave him an ideal opportunity to test his fitness and he is happy to have made most of the outing by scoring a sublime 150 at Chinnaswamy stadium.\n\"The match gave me good opportunity to test my fitness. I am happy the way I came back after a month's layoff. I am happy I got a ton under my belt before the South Africa series. My hand is doing good, and hopefully it remains the same in future,\" he told reporters after India A thrashed Bangladesh A by an innings and 36 runs.\nDhawan had fractured his hand during the Galle Test match and was forced to sit out from the remainder of the series.\nHaving steadily recuperated from injury and gone through paces at the National Cricket Academy, the match against Bangladesh gave Dhawan, an ideal platform to test his fitness.\nDhawan said he is now ready for the opening T20 International against South Africa in Dharamsala on October 2.\n\"I started off in a Test match mode, but luckily I got a few boundaries, and once I crossed fifty, I adopted an aggressive mould and practised some shots which could be useful when we play T20 against South Africa,\" he said.\nAsked about the South Africa challenge, Dhawan said the series will be tough and entertaining, but India would like to take advantage of the home conditions.\n\"It is going to be a tough and entertaining series. It is always good if two strong sides are playing, and of course we are playing at home and have got more advantage. Hopefully, we will use that advantage on our side and end up on a good winning note,\" he said.\nOn his captaincy, Dhawan said it was a great experience to lead young Indian players.\n\"It was a great experience to captain a young side. It was lovely to see boys so fit and so strong the way they batted - Karun Nair and Vijay Shankar, the way he was hitting sixes,\" he said.\n\"Of course, our bowlers did great job on a flat wicket. Jayant Yadav bowled really well, and everyone else did well.\" ", "external_links": ["https://play.google.com/store/apps/details?id=com.toi.reader.activities"], "published": "2015-09-29T23:40:00.000+03:00", "crawled": "2015-10-01T07:27:15.456+03:00", "highlightTitle": ""}