{"organizations": [], "uuid": "1da8a082fd00bc9fc0e1e3623e0d7c270071a64d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxsports.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "http://www.foxnews.com/sports/", "section_title": "Sports News | Latest Sports Headlines, Scores, Stats Analysis &amp; News | Fox News", "url": "http://www.foxsports.com/nfl/story/packers-prepare-for-familiar-foil-49ers-kaepernick-093015", "country": "US", "title": "Packers prepare for familiar foil, 49ers' Kaepernick", "performance_score": 0, "site": "foxsports.com", "participants_count": 1, "title_full": "Packers prepare for familiar foil, 49ers' Kaepernick | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "1da8a082fd00bc9fc0e1e3623e0d7c270071a64d"}, "author": "FoxSports", "url": "http://www.foxsports.com/nfl/story/packers-prepare-for-familiar-foil-49ers-kaepernick-093015", "ord_in_thread": 0, "title": "Packers prepare for familiar foil, 49ers' Kaepernick", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " GREEN BAY, Wis. (AP) In scouting 49ers quarterback Colin Kaepernick, the Packers look beyond his four interceptions last week against Arizona.\nKaepernick, perhaps more than any other quarterback, has been one elusive problem in recent year for the Packers. He's 3-0 as a starter against Green Bay headed into Sunday's game at Santa Clara, California.\nWith their run defense surging in recent weeks, the Packers are hoping to finally trip up Kaepernick.\n''Stop the run from the other guys first, and then if he wants and (will) try to keep it, we've got to figure out how to get him stopped,'' linebacker Julius Peppers said.\nThat's been a problem since the 2013 divisional playoffs, when Kaepernick torched the Packers for 181 yards rushing and two touchdowns on 16 carries. He threw for 263 yards and a score.\nThe 49ers beat the Packers twice more the following season, in the opener at San Francisco and the wild-card game to end Green Bay's season at Lambeau Field.\nIn the first game, Kaepernick was more of a threat with his arm; in the second, he hurt the Packers in the air and on the ground.\nDefensive lineman B.J. Raji would rather learn from the past and move on. There is good reason to be more confident.\nLast week, the Packers limited Kansas City's Jamaal Charles to 49 yards on 11 carries, though Charles did have three touchdowns. Two of those scores came in a fourth quarter that started with the Packers holding a 24-point lead.\nTwo weeks ago, Green Bay faced a different style runner in Seattle's physical Marshawn Lynch and held him to 41 yards on 15 carries. In each game, the Packers opened with a rousing effort from the front seven.\nThat group up front will likely get Letroy Guion this week; the defensive lineman is eligible to return from is three-game suspension for violating the league's substance abuse policy.\n''He brings physicality, but he also brings the energy, another energetic body that's going to run around and help you,'' Raji said.\nAt least when it comes to stopping running backs. If the Packers can hold the backs to short gains, it might lead to more third-and-longs that would make Kaepernick less likely to take off.\nSo far this year, Kaepernick has rushed 23 times for 138 yards and a score. If he does tuck and run on Sunday, the Packers can draw on facing a similar mobile quarterback in Seahawks' Russell Wilson two weeks ago.\nWilson ran for 78 yards on 10 carries in that game, along with 206 yards passing and two scores. Most of his damage took place in the third quarter, and Seattle was held scoreless for the game's final 21 minutes.\n''I think we're better equipped now for it, having seen it so many weeks prior, whereas in the past, that wasn't necessarily the case,'' Raji said about facing mobile quarterbacks.\nThe 49ers will also have something to think about with the Packers' defense.\nSince the teams didn't play last season, San Francisco will get its first look at Clay Matthews, normally an outside linebacker, at times playing on the inside. Matthews has been there more since last November to help shore up the run defense.\nMatthews has also had plays against Kaepernick in which he spied the quarterback. To best limit an option quarterback, defenses must set the edges and stay on assignment to prevent any gaps from opening quickly.\n''So, yeah, it'll be a little more to learn this week, a little more film study to put in on my behalf,'' Matthews said. ''I think it's a new defense, it's a new year, so hopefully it's a win this time around.''\nNOTES: TE Andrew Quarless was placed on injured reserve/designated to return with a sprained left knee. He must miss a minimum of eight weeks, meaning he would be eligible to return in Week 12 on Thanksgiving night against Chicago. He can start practicing with the team in six weeks. ... WR Davante Adams missed practice and wore a protective boot for his sprained left ankle. S Morgan Burnett (calf) also missed practice. Each player said he was day to day.\n---\nOnline:\nAP NFL website: www.pro32.ap.org and www.twitter.com/AP-NFL\n---\nFollow Genaro Armas at http://twitter.com/GArmasAP", "external_links": ["http://msn.foxsports.com/", "http://twitter.com/GArmasAP"], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-10-01T04:18:53.773+03:00", "highlightTitle": ""}