{"organizations": [], "uuid": "c28f92f33a1aa1a905677a22135a3509d2a89199", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.baltimoresun.com", "main_image": "http://www.trbimg.com/img-5621def4/turbine/la-sp-college-football-notes-20151017", "site_section": "http://feeds.baltimoresun.com/baltimoresun/sports/college/rss2.0.xml", "section_title": "College Sports - Baltimore Sun", "url": "http://www.baltimoresun.com/sports/college/la-sp-college-football-notes-20151017-story.html", "country": "US", "title": "Utah State knocks off turnover-prone Boise State, 52-26", "performance_score": 0, "site": "baltimoresun.com", "participants_count": 1, "title_full": "Utah State knocks off turnover-prone Boise State, 52-26", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T08:38:00.000+03:00", "replies_count": 0, "uuid": "c28f92f33a1aa1a905677a22135a3509d2a89199"}, "author": "Associated Press", "url": "http://www.baltimoresun.com/sports/college/la-sp-college-football-notes-20151017-story.html", "ord_in_thread": 0, "title": "Utah State knocks off turnover-prone Boise State, 52-26", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "var ssaUrl = ('https:' == document.location.protocol ? 'https://' : 'http://') + 'pixel.sitescout.com/iap/0ea84626951144d2';new Image().src = ssaUrl;\"/> College Football Utah State knocks off turnover-prone Boise State, 52-26 Brett Rypien Scott Sommerdorf / Salt Lake Tribune \nBoise State quarterback Brett Rypien loses his grip on the ball when he's hit by a Utah State defender before he can throw a pass Friday night. A replay showed it was an incomplete pass. \nBoise State quarterback Brett Rypien loses his grip on the ball when he's hit by a Utah State defender before he can throw a pass Friday night. A replay showed it was an incomplete pass. (Scott Sommerdorf / Salt Lake Tribune) Associated Press \nMarwin Evans returned an interception 90 yards for a touchdown as time expired before halftime, and Utah State turned Boise State's seven first-half turnovers into 35 points in the Aggies' 52-26 victory over the No. 21 Broncos on Friday night. \nThe Aggies (4-2, 3-0 Mountain West) snapped a 12-game losing streak against Boise State that dated 18 years. The 52 points are the most Boise State has ever allowed as a ranked team. \nThe Broncos (5-2, 2-1) served up four fumbles and three interceptions in the first half, including Evans' return for a score. \nUtah State's Kent Meyers threw for 157 yards and a career-high three touchdowns and added 63 yards rushing and a touchdown. Hunter Sharp caught two touchdown passes. \nNick Vigil had a game-high 14 tackles for the Aggies, and Kyler Fackrell added 11. Fackrell forced one fumble and recovered two, while Vigil had one of each. \nBoise State's Brett Rypien threw for 299 yards with three interceptions. \nCougars roll \nGreg Ward Jr. ran for three touchdowns and threw a scoring pass to guide No. 24 Houston over Tulane, 42-7, at New Orleans. The Cougars (6-0, 3-0 in the American Athletic) were playing as a ranked team for the first time since 2011. \nIn other games, Brigham Young (5-2) scored 21 consecutive points in the fourth quarter for a 38-24 victory over Cincinnati (3-3) at Provo, Utah Nevada Las Vegas played Fresno State in a late game. \nEtc. \nThe longhorn steer mascot of the University of Texas died in his sleep after recently being diagnosed with cancer. Bevo XIV was 13. The steer died at the ranch where he lived. He had not made the trip last weekend to the Texas-Oklahoma game. \nA second South Florida football player has been suspended from team activities for allegedly firing a gun on campus. Police said that junior cornerback Lamar Robbins was arrested after an investigation into the Oct. 11 arrest of freshman reserve offensive lineman Benjamin Knox . Robbins is charged with discharging a weapon on campus, a second-degree felony, and giving false information to a law enforcement officer. \nNorth Carolina cornerbacks M.J. Stewart and Mike Hughes face misdemeanor assault charges tied to an altercation near the Chapel Hill campus earlier this month. Stewart, a sophomore who has started every game for the Tar Heels this season, turned himself in and was released on an unsecured bond , according to an arrest report. The arrest warrant charges him with assault and battery for punching the victim \"several times in the face.\" Hughes, a freshman reserve, was arrested before being released on bond. \nFormer Texas wide receiver Kendall Sanders was found not guilty of sexually assaulting a former University of Texas student in a dorm room. Sanders and fellow receiver Montrel Meander were suspended from the Texas team after they were charged with sexual assault in July 2014.", "external_links": [], "published": "2015-10-17T08:38:00.000+03:00", "crawled": "2015-10-17T19:54:19.492+03:00", "highlightTitle": ""}