{"organizations": [], "uuid": "89463472e23960bd8fa01bcf0b815c29d9c78ac8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "mndaily.com", "main_image": "http://mndaily.com/", "site_section": "http://www.mndaily.com//rss/sports", "section_title": "Sports", "url": "http://mndaily.com/sports/swimming-diving/2015/10/06/zhou-leads-group-experienced-minnesota-divers", "country": "US", "title": "Zhou leads group of experienced Minnesota divers", "performance_score": 0, "site": "mndaily.com", "participants_count": 1, "title_full": "Zhou leads group of experienced Minnesota divers", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T16:10:00.000+03:00", "replies_count": 0, "uuid": "89463472e23960bd8fa01bcf0b815c29d9c78ac8"}, "author": "jthomas@mndaily.com", "url": "http://mndaily.com/sports/swimming-diving/2015/10/06/zhou-leads-group-experienced-minnesota-divers", "ord_in_thread": 0, "title": "Zhou leads group of experienced Minnesota divers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Zhou leads group of experienced Minnesota divers Gophers junior Yu Zhou was named the NCAA's diver of the year in 2015. By Thomas Jaakola October 06, 2015 While growing up in China, Yu Zhou was very involved in gymnastics until she realized a future in the sport may be bleak because of her small hands and the difficultly she had grabbing the bars. Instead, her gymnastics coach advised her to try diving. Her mother took her to join a diving team when she turned 9, and Zhou hasn’t looked back ever since. Now at the University of Minnesota, the junior is excelling in the sport. Zhou was named the 2015 NCAA Diver of the Year last season after winning the national title in the 3-meter dive. Now, she leads a group of Minnesota divers that sent eight total athletes to the NCAA Championships last year. “I love diving because there are a lot of challenges, both mentally and physically,” Zhou said. In addition to taking home an NCAA title last year, Zhou finished third in the 1-meter dive and fifth in platform diving. The Wuhan, China, native also was first in the Big Ten in the 1- and 3-meter dives last year, and said she plans to repeat both her NCAA and Big Ten titles this season. Zhou said she’s always looking for ways to improve her diving and that her focus during meets helps her succeed. “I always compete with myself; I ignore others completely sometimes during competition,” Zhou said. Zhou is the biggest standout on the men’s and women’s swimming and diving teams, which sent four athletes each to the NCAA Championships last year and have similar aspirations this year. “I think there is a great potential to send six female divers and four male divers to the Big Ten meet,” head diving coach Wenbo Chen said. On the women’s team, besides Zhou, Chen said he expects senior Jessica Ramberg, junior Lexi Tenenbaum and freshman Marian Khamis to make an impact this season. “The women’s swimming and diving team is young and has a lot of potential for growth,” Ramberg said. “The team also has a lot of depth, so I am excited to see what this team can do.” On the men’s side, Chen said the team will count on junior Matt Barnard, senior Manny Pollard, senior Dylan Zoe and freshman Alan LeBlang. Both diving teams showed well in their first meet against Florida State University, with Zhou winning the 1-meter dive and taking second in the 3-meter. Ramberg took first in the 3-meter dive, while Barnard won the 3-meter dive on the men’s side. “We have a pretty strong diving team this year,” Chen said. “They are all very competitive and very strong. I think they all have great potential to qualify for the NCAA meet.”", "external_links": [], "published": "2015-10-06T16:10:00.000+03:00", "crawled": "2015-10-08T02:14:57.364+03:00", "highlightTitle": ""}