{"organizations": ["Miami Dolphins", "Omar Kelly Dolphins", "NFL", "Dolphins", "Tennessee Titans"], "uuid": "e20b867fa1f4948f2391e8eb2716e54f9ace5d54", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sun-sentinel.com", "main_image": "http://www.trbimg.com/img-5623fe6d/turbine/sfl-instant-analysis-miami-dolphins-tennessee-titans-20151017", "site_section": "http://www.sun-sentinel.com/sports/rss2.0.xml", "section_title": "Sports - Sun Sentinel", "url": "http://www.sun-sentinel.com/sports/sfl-instant-analysis-miami-dolphins-tennessee-titans-20151017-htmlstory.html", "country": "US", "title": "Instant analysis: Miami Dolphins 38, Tennessee Titans 10", "performance_score": 0, "site": "sun-sentinel.com", "participants_count": 0, "title_full": "Instant analysis: Miami Dolphins 38, Tennessee Titans 10", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T23:53:00.000+03:00", "replies_count": 0, "uuid": "e20b867fa1f4948f2391e8eb2716e54f9ace5d54"}, "author": "", "url": "http://www.sun-sentinel.com/sports/sfl-instant-analysis-miami-dolphins-tennessee-titans-20151017-htmlstory.html", "ord_in_thread": 0, "title": "Instant analysis: Miami Dolphins 38, Tennessee Titans 10", "locations": ["Miami", "Tennessee"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tony Sparano"], "text": "Omar Kelly Dolphins Writer/Columnist The Dolphins shed the team’s finesse reputation for one Sunday and unleashed a physical brand of football that hasn’t been seen since Tony Sparano’s days. Miami pounded a physical Titans team at the line of scrimmage, rushing for 132 yards in the first half and limiting Tennessee to fewer than 100 rushing yards, setting the tone for the game. As impressive as this win was for Miami, keep in mind that the Titans are 1-4, and haven’t exactly proven they are a respectable NFL team. But then again, the Dolphins haven’t either. \n\nChris Perkins Dolphins Writer Nice job all around. I’m not going to say all that stuff interim coach Dan Campbell preached about competing and toughness works. But I’m not going to say it doesn’t work either. So kudos to Campbell. Many top players - Reshad Jones, Cameron Wake, Brent Grimes, Lamar Miller, Branden Albert - played their best game of the year. But I’m still unclear why they couldn’t do that under Joe Philbin. \n\nDave Hyde Sports Columnist What a game. What a turnaround. What a difference a coaching change can make, too. Dan Campbell wanted to changed this team's mindset from his first practice, and the team he coached Sunday was far better than anything that had been on the field this year. It's just one game. But what a game it was. \n\nKeven Lerner Online Sports Editor A commitment to the run game and the defensive ends showing up for the first time this season was more than enough to bury a rookie quarterback. Lamar Miller had 13 carries for 99 yards in the first half, an unheard-of workload during Joe Philbin's tenure. \nSteve Svekis Multimedia Reporter The Dolphins played with an energy that had been sorely missing, even in their season-opening win. With 6:43 left in the second quarter, the Dolphins set their season high for rushing yards in a game. Cameron Wake channeled the 2012 Wake (who started that season with three sack-less games and then piled up a franchise-record 4.5 in Arizona). In the second quarter alone, Wake had four sacks and two forced fumbles (a review failure probably robbed him of a third forced fumble with a couple seconds left in the first half). This was the team most people expected to see all season.", "external_links": [], "published": "2015-10-17T23:53:00.000+03:00", "crawled": "2015-10-19T00:31:58.699+03:00", "highlightTitle": ""}