{"organizations": ["Pumas"], "uuid": "7c82f4e5c00bf88ff653606e51b75fecf4af410a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/7ca5273d25a0ba4c2e89ee4790804f9a.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/rugby/diego-maradona-team-talk-fires-up-pumas/6918563/", "country": "JE", "title": "Diego Maradona team talk fires up Pumas", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "Diego Maradona team talk fires up Pumas", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T14:01:00.000+03:00", "replies_count": 0, "uuid": "7c82f4e5c00bf88ff653606e51b75fecf4af410a"}, "author": "", "url": "http://www.sport.co.uk/rugby/diego-maradona-team-talk-fires-up-pumas/6918563/", "ord_in_thread": 0, "title": "Diego Maradona team talk fires up Pumas", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Pumas Diego Maradona", "Diego Maradona"], "text": "Diego Maradona team talk fires up Pumas 10 Oct 2015 11:01:56 \ncomments \nWorld Cup quarter-finalists Argentina will conclude their pool campaign against Namibia with inspiration from Diego Maradona driving them on. \nMaradona watched the Pumas beat Tonga last week, and he has vowed to return if Argentina reach the semi-finals. \nThey face a last-eight clash against Ireland or France, and Pumas skipper Agustin Creevy has hailed Maradona's support of the team. \n\"He gave us a speech (after the Tonga game),\" Creevy said. \n\"He said the whole of Argentina was dreaming with us, everyone is behind us, supporting us. That was the reason he was here - he wanted to be a part of it. \n\"I could never have imagined he would have been there with us. It was a beautiful surprise for all of us. He said if we reach the semi-finals he will be there. He has set us a very high goal.\" \nThe Pumas return to Leicester, scene of that triumph against Tonga, on Sunday with coach Daniel Hourcade having made 11 changes, including a start at fly-half for Juan Martin Hernandez. \nNamibia, fresh from gaining a losing bonus point against Georgia in midweek, wind up their World Cup campaign without inspirational skipper Jacques Burger. \nBurger has now retired from Test rugby after being concussed during the Georgia game, and head coach Phil Davies has handed leadership duties to flanker Rohan Kitshoff for the Pool C encounter. \nDavies said: \"We've had a consistent theme of a 23-man team strategy for each game, and we are trying to pick from a spine of the team for each match so we have consistency in the selection. \n\"Prior to the tournament, from my point of view and the rest of the coaches, there was a desire for everybody in the Namibian squad to take part in at least a couple of games. \n\"That is important for the here and now, but it's also important for the legacy programme moving forward. \n\"If we go out with that guts, character and determination, anything can happen in a game of rugby.\" \nAnd Kitshoff added: \"It's important for us to take a lesson out of each match. Win or lose, we have to learn something from it, otherwise it doesn't mean anything. \n\"The vibe is good, even though we lost (against Georgia). We are looking forward to Argentina. \n\"It's one last shot for us to really show the public - and prove to ourselves - that we are good enough to compete at this level.\" Related Sport News", "external_links": [], "published": "2015-10-10T14:01:00.000+03:00", "crawled": "2015-10-10T19:58:52.767+03:00", "highlightTitle": ""}