{"organizations": ["Millburn High School", "Cedar Grove High School", "Joseph Di Bari"], "uuid": "515b4f090a2ca34cfb682707747819a8daf71f4b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.northjersey.com", "main_image": "http://www.northjersey.com:80/polopoly_fs/1.1433319!/fileImage/httpImage/101515-it-pushout.jpg", "site_section": "http://www.northjersey.com/cmlink/high-school-sports-rss.rss", "section_title": "High School Sports on NorthJersey.com", "url": "http://www.northjersey.com/sports/high-school-sports/football/cedar-grove-hands-millburn-first-loss-28-14-1.1433318", "country": "US", "title": "Millburn High School football team suffers first loss", "performance_score": 0, "site": "northjersey.com", "participants_count": 0, "title_full": "Millburn High School football team suffers first loss", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T17:12:00.000+03:00", "replies_count": 0, "uuid": "515b4f090a2ca34cfb682707747819a8daf71f4b"}, "author": "", "url": "http://www.northjersey.com/sports/high-school-sports/football/cedar-grove-hands-millburn-first-loss-28-14-1.1433318", "ord_in_thread": 0, "title": "Millburn High School football team suffers first loss", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Nick Minter", "Jim Connelly"], "text": "Millburn High School football team suffers first loss October 15, 2015 Last updated: Thursday, October 15, 2015, 10:12 AM By Jim Connelly Buy this photo staff photo by jim connelly Millburn High School's Nick Minter is pushed out of bounds by Cedar Grove High School's Joseph Di Bari Oct. 10 on a second quarter kickoff return. \nPat Leonardis, the fourth-year head coach of Millburn High School's varsity football team, has one simple request for his players each week. \n\"Play hard for four quarters.\" Buy this photo staff photo by jim connelly RJ Serruto (57) and Dean Schweinler (5) of Millburn High School tackle Cedar Grove High School quarterback Nick Zecchino Oct. 10 in the Super Essex Conference, Colonial Division opener for both teams. \nThe Millers heeded their coach's mantra Oct. 10 against visiting Cedar Grove High School, but it was not enough to prevent the local gridders from dropping a 28-14 decision in a matchup of undefeated Super Essex Conference, Colonial Division rivals. \nMillburn fell to 3-1, 0-1 in the Colonial Division. Cedar Grove is 4-1, 1-0 in the Colonial Division. \nThe second quarter, following a scoreless first 12 minutes, featured three touchdowns. \nCedar Grove struck first on a 65-yard touchdown pass from senior quarterback Nick Zecchino to junior wide receiver Evidence Njoku with 2:49 remaining in the half. Senior kicker Corrado Fazio's extra point by the visitors up by seven. \nMillburn's Serruto brothers accounted for the game's next touchdown. \nSophomore quarterback John Serruto connected with senior wide receiver John Serruto for a 14-yard scoring play with 1:02 left in the half. \nJunior kicker Jack Kirshenbaum made the game-tying extra point. \nNjoku swung the momentum in Cedar Grove's favor when he returned the ensuing kickoff 85 yards for a touchdown. Fazio's extra point made the score 14-7 with 51 seconds to go before halftime. \nCedar Grove extended its lead to three touchdowns with a pair of scores in the third quarter - a 14-yard pass from Zecchino to freshman running back J.J. Snyder and a 7-yard run by junior running back Dan DiPrenda. Fazio made both extra points. \nSenior running back Zack Weinstein (29 carries for 155 yards) accounted for Millburn's final touchdown, a 38-yard run in the fourth quarter. Kirshenbaum's extra point was good. \nPeter Serruto, who was making just his fourth career start, endured a rough night as he completed just seven of 22 passes for 108 yards and three interceptions. \n\"Peter has been doing a good job, and is working hard,\" Leonardis said. \"We are all very supportive of him. There are no negative thoughts around here. \n\"We showed a lot of poise and character for four quarters, said Leonardis, whose squad faces a second consecutive tough challenge Friday, Oct. 16, with a road contest against Orange High School (5-0, 1-0) at 7 p.m. at Bell Stadium. \nMILLER NOTES \nLeonardis, the day after the contest, was the recipient of a phone call from Cedar Grove head coach Ed Sadloch offering congratulations on the Millers' efforts. \nThe contest was scheduled to take place the previous night, only to be postponed by a series of late afternoon storms moving through the area. \nWhile the rain had stopped by the scheduled 7 p.m. kickoff, the continued presence of lightning in the area resulted in the game being called off at about 7:20 p.m. \nEmail: connellyj@northjersey.com  ", "external_links": [], "published": "2015-10-15T17:12:00.000+03:00", "crawled": "2015-10-15T19:29:55.472+03:00", "highlightTitle": ""}