{"organizations": [], "uuid": "6279c0947a7d50b26775ef8fb9b91aa92106f9c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "http://www.bostonherald.com/sites/default/files/media/2015/04/15/12YOUNG.1.jpg", "site_section": "http://bostonherald.com/sports/celtics_nba", "section_title": "Sports: Celtics &amp; NBA | Boston Herald", "url": "http://bostonherald.com/sports/celtics_nba/boston_celtics/2015/10/celtics_notebook_terry_rozier_makes_impression", "country": "US", "title": "Celtics notebook: Terry Rozier makes impression", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "Celtics notebook: Terry Rozier makes impression | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "6279c0947a7d50b26775ef8fb9b91aa92106f9c9"}, "author": "Mark Murphy", "url": "http://bostonherald.com/sports/celtics_nba/boston_celtics/2015/10/celtics_notebook_terry_rozier_makes_impression", "ord_in_thread": 0, "title": "Celtics notebook: Terry Rozier makes impression", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WALTHAM — It’s simple enough for James Young to recognize the easiest path to minutes on the Celtics.\nAs one of the most promising pure shooters on the team, the second-year swingman is the perfect complement for Isaiah Thomas , who needs shooters to draw defenders out to the edges and open up the paint.\nYoung has been grouped with Thomas enough during the last week to have an understanding of what it takes to make the equation work.\n“You space out the floor and he creates offense for us,” Young said before yesterday’s practice.\n“He goes for shots and I stay in the corner,” he said. “He uses the floor really well. He doesn’t get that many shots up. People go to other people on the court, which makes him that much better. He takes his shots and makes the team a lot better.”\nShooting alone, of course, is not going to earn Young those minutes. But his noted improvement defensively might be the key.\n“James has developed quite a bit, especially on the defensive end of the floor,” said Celtics coach Brad Stevens . “I thought he did some good things (in Wednesday night’s scrimmage). When he was in, the ball moved. He took a couple of shots I’m sure he would like to have back, but for the most part he’s making real strides.\n“Any time you’re in a position where you haven’t played as much, then the natural human reaction is that you have to hit home runs and make plays to earn time. In reality, it’s much more about doing your job as much as you can and being reliable. He’s well ahead of last year in those terms.”\nFacilitating others\nThomas will be the Celtics’ chief bread butterer, at least until team president Danny Ainge is able to land another upper-echelon scorer.\nBut the most impressive aspect of the guard’s start to training camp hasn’t merely been his scoring. Rather, it’s been his efficiency.\n“Isaiah is last on our team in field goal attempts through the four days of practice that we’ve statted, and has completely been unbelievable on offense, which tells you all he’s doing for everybody else,” said Stevens. “He’s completely unselfish, making the right read in the right situation, and he’s not forcing anything. He’s played great point guard on offense the whole time.”\nHe is, of course, making these plays against teammates. Thomas and the Celtics get their first sample of outside competition on Oct. 6 in Milan against Olimpia Milan, and then on Oct. 8 against Real Madrid.\nBut Thomas has been adept in the early going at not forcing the issue, and making the right play.\n“There’s a basketball play happening, the game will tell you what to do, and you have to make the read,” said Stevens. “We’ve spent a lot more time even in these first four practices about reading and reacting off each other with constant movement in a somewhat random, but organized, manner. It’s not going to be exact time and again, and you just have to make basketball reads.\n“Sometimes they’ll back up off of (Thomas) and he’ll be able to score, sometimes he’ll be able to blow by them and get to the rim, and sometimes he’ll have to make the right read for the other guy,” he said. “What happened the other night (in the scrimmage) was, he got a couple of his shots in transition but started the game by finding spacers, and then ended the game with Amir Johnson laying the ball in because everyone was extended out because the spacers had made shots.\n“His task will be to continue to make the right reads.”\nBattle to get back\nJared Sullinger may have an uphill fight for playing time this season, the crowded power forward position and his battle for better conditioning considered. But Stevens believes the forward has made progress early in camp in the latter area.\n“I think he’s improved conditioning-wise,” said the Celtics coach. “We’ve done a lot of work, done some running, and he’s running well. We all need to continue to get into game shape. He’s in competition with a lot of guys for minutes. He’s a good player. (During the scrimmage) he didn’t have a rhythm because of a couple of offensive fouls, but one he had Kelly ( Olynyk ) sealed and it would have been a layup otherwise. And he was the only guy we doubled in the post, and he made great plays to Tyler ( Zeller ) for a couple of open looks. But there’s stiff competition at those spots.”", "external_links": [], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-02T10:11:02.694+03:00", "highlightTitle": ""}