{"organizations": [], "uuid": "9738b9f017ec9ba06dce8ea61aa7477d91ee7ed3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www2.ljworld.com", "main_image": "http://worldonline.media.clients.ellingtoncms.com/static/ljworld.com/images/ljw-logo-1200.jpg", "site_section": "http://www2.ljworld.com/rss/headlines/sports/ku/", "section_title": "LJWorld.com stories: KU sports", "url": "http://www2.ljworld.com/news/2015/oct/02/column-svi-no-longer-new-kid-town/", "country": "US", "title": "Column: ‘Svi’ no longer new kid in town", "performance_score": 0, "site": "ljworld.com", "participants_count": 1, "title_full": "Column: ‘Svi’ no longer new kid in town", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T08:32:00.000+03:00", "replies_count": 0, "uuid": "9738b9f017ec9ba06dce8ea61aa7477d91ee7ed3"}, "author": "Tom Keegan", "url": "http://www2.ljworld.com/news/2015/oct/02/column-svi-no-longer-new-kid-town/", "ord_in_thread": 0, "title": "Column: ‘Svi’ no longer new kid in town", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Tom Keegan — Lawrence Journal-World October 2, 2015 \nAdvertisement \nKansas University basketball media day, 2014: The youngest college basketball player in the nation sat on his assigned chair — eyes a little wide, expression on the reserved side — doing his best to answer the questions sent his way. Photo Gallery KU Men's Basketball Media Day Images from KU men's basketball media day held on Thursday, Oct. 1, 2015 at Allen Fieldhouse. \nThumbnails · Gallery \nSviatoslav Mykhailiuk looked 17, which he was. And his vibe was that of the new kid dropped in the middle of a grade-school classroom in mid-year, surrounded by students who all knew each other, spoke with the same accent, rooted for the same baseball team, knew where to find the best hot dog in town. \nHe was a boy in a strange land surrounded by strangers. \nThe man seated courtside Thursday afternoon bore little resemblance to the boy from a year ago. He’s at home in Lawrence now. \n“I love friends here,” he said. “I love food. I love food. I love people. I love school. I love everything over here.” \nHe turned the clock back a year and opened a window into what the 17-year-old boy was feeling. \n“I’m not American,” he said. “It was new country for me. New language. New team. New system. New coach. It was not like for American guys who have been here all their life, playing AAU, high school, watching NCAA basketball, so they kind of know what to expect.” \nFreshmen of all backgrounds tend to compile poor shooting statistics for a variety of reasons. Mykhailiuk was no exception. He appeared in 26 games, averaged 11 minutes and shot .306 from the field, .288 from three. He showed his soft touch at the free-throw line (.833) and in warmups. Getting accustomed to the speed of the game, knowing a good shot from a bad one, and generally feeling more comfortable, all should make for a better shooting year for the sophomore from Ukraine. Press Conferences & Post-Game Interviews Bill Self discusses upcoming season, Cheick Diallo’s situation \nKansas basketball coach Bill Self answers questions about the coming season, freshman Cheick Diallo’s eligibility and the Jayhawks’ potential at KU’s annual media day. \n“I’ve been here for a year,” Svi said. “I feel more confident. I think my shot’s going to be good this year. We’ll see.” \nHe has added 17 pounds of muscle, which ought to help him maintain balance when being shoved cutting or driving to the hoop. \n“I think it will help me on defense, too,” he said. “I can be more physical, stronger. On offense, I go inside more and make shots with contact.” \nSvi said he would like to shoot “39 or 40 percent” from three. \nNaturally, he shoots a way higher percentage than that when spot-shooting, being fed the ball by a rebounder and moving from spot to spot along the three-point semicircle. \n“Working out with him this summer, getting in the gym shooting with him, he shoots the ball like crazy,” Devonté Graham said. “He was making, like, 49 threes in a row, crazy stuff like that.” \nThat was such a crazy number, I had to seek confirmation. \nForty-nine in a row? \n“No,” Svi said. “It was 47.” \nA personal record, a crazy number. Do not challenge him to a game of kihb unless you enjoy losing. \nSvi will compete for a chunk of the 120 perimeter minutes with small guards Frank Mason and Graham and wings Wayne Selden Jr., Brannen Greene and LaGerald Vick. \n“We’ve kind of got a crowded house back there,” Kansas coach Bill Self said. “We’ve got some good players. But Svi potentially, I think from what NBA people think, they think he’s probably as good a prospect as we have in the backcourt, and I do think he can be that, too. He’s so much stronger. He’s a different guy from a maturity and from a confidence standpoint, so I expect him … it’s hard to say you expect certain guys to do certain things if, in fact, they may not be starters, but I expect Svi to challenge for a starting position and be, without question, if he doesn’t start, be as good as any reserve in the country.” \nThose are tall words, but not too tall for the 6-foot-8 Mykhailiuk to reach. \n— Tom Keegan can be seen on The Drive, Sunday nights on WIBW TV.", "external_links": [], "published": "2015-10-02T08:32:00.000+03:00", "crawled": "2015-10-02T09:23:45.276+03:00", "highlightTitle": ""}