{"organizations": [], "uuid": "e64563e61a9e75d02a801ba3cf64521de8bbbb53", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/47529300.cms", "site_section": "http://timesofindia.indiatimes.com/rssfeeds/4720867.cms", "section_title": "Top Stories - Golf - Sports - The Times of India", "url": "http://timesofindia.indiatimes.com/sports/golf/top-stories/Adam-Scott-gets-11th-Presidents-Cup-underway/articleshow/49268326.cms", "country": "IL", "title": "Adam Scott gets 11th Presidents Cup underway", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "Adam Scott gets 11th Presidents Cup underway - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T11:54:00.000+03:00", "replies_count": 0, "uuid": "e64563e61a9e75d02a801ba3cf64521de8bbbb53"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/sports/golf/top-stories/Adam-Scott-gets-11th-Presidents-Cup-underway/articleshow/49268326.cms", "ord_in_thread": 0, "title": "Adam Scott gets 11th Presidents Cup underway", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "INCHEON: Adam Scott got the ball rolling in the 11th Presidents Cup on Thursday with his first drive at Jack Nicklaus Golf Club Korea, as he and International team partner Hideki Matsuyama take on Bubba Watson and J.B. Holmes in the opening foursomes. \n\nFormer US President George W. Bush offered words of encouragement to both teams and posed for photos with captains Nick Price and Jay Haas on the first tee, while boisterous Australian fans dressed in green and gold serenaded the players. \n\nThe Internationals are attempting to win the biennial competition for just the second time but face a US team stacked top to bottom with top class talent including world number one Jordan Spieth, Dustin Johnson and Rickie Fowler. \n\nThe United States took an early lead in the opening match after Holmes made a 14 footer for birdie on the second while the Internationals could only make par. \n\nThe US pair of Matt Kuchar and Patrick Reed, who are playing South Africans Louis Oosthuizen and Branden Grace, are also one up in the second foursomes match, where each team uses one ball and the players hit alternate shots. \n\nThe day's other three matches see Thongchai Jaidee and Anirban Lahiri play Fowler and Jimmy Walker, Jason Day and Steven Bowditch play Phil Mickelson and Zach Johnson, and Danny Lee and Marc Leishman take on Spieth and Johnson. \n\nSince the inaugural edition of the Cup in 1994, the United States have beaten a team of international players minus Europeans in eight events and tied once, their only defeat coming at the 1998 competition at Royal Melbourne. \n\nThat one-sidedness led to calls for a shake-up and the format for this week's event in Incheon has been tweaked to reduce the number of total points on offer from 34 to 30. \n\nHaving fewer matches could help the International team, which does not have the same strength in depth as the Americans. \n\nThe event concludes on Sunday with 12 singles matches. Stay updated on the go with Times of India News App. Click here to download it for your device.", "external_links": [], "published": "2015-10-08T11:54:00.000+03:00", "crawled": "2015-10-08T14:02:20.845+03:00", "highlightTitle": ""}