{"organizations": [], "uuid": "284c6ee3a791b445cc2d4951f273ae66aad48635", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sltrib.com", "main_image": "http://www.sltrib.com/csp/mediapool/sites/dt.common.streams.StreamServer.cls?STREAMOID=W26cjNPIoOkD4dPLNMK7OM$daE2N3K4ZzOUsqbU5sYsNiVkLogK3FBCddPmjfZi6WCsjLu883Ygn4B49Lvm9bPe2QeMKQdVeZmXF$9l$4uCZ8QDXhaHEp3rvzXRJFdy0KqPHLoMevcTLo3h8xh70Y6N_U_CryOsw6FTOdKL_jpQ-&CONTENTTYPE=image/jpeg", "site_section": "http://sltrib.com//csp/cms/sites/sltrib/RSS/rss.csp?cat=Sports", "section_title": "Sports - The Salt Lake Tribune", "url": "http://www.sltrib.com/sports/3095049-155/utah-football-freshman-britain-covey-stands", "country": "US", "title": "Utah football: Freshman Britain Covey stands out despite defeat", "performance_score": 0, "site": "sltrib.com", "participants_count": 2, "title_full": "Utah football: Freshman Britain Covey stands out despite defeat | The Salt Lake Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T03:00:00.000+03:00", "replies_count": 1, "uuid": "284c6ee3a791b445cc2d4951f273ae66aad48635"}, "author": "KYLE GOON", "url": "http://www.sltrib.com/sports/3095049-155/utah-football-freshman-britain-covey-stands", "ord_in_thread": 0, "title": "Utah football: Freshman Britain Covey stands out despite defeat", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Los Angeles • On Wednesday's airing of \"The Drive,\" wide receivers coach Taylor Stubblefield teased his freshman receiver after reviewing a play where he had missed an opportunity to score.\n\"Do you like touchdowns? Do you like big plays?\"\nAt the time, Britain Covey was lost for words. On Saturday afternoon, he showed how much he liked big plays.\nNo. 18 was the single most dynamic force for an otherwise sluggish offense on Saturday afternoon in a 42-24 loss, catching two touchdown passes and gaining 129 yards, or just about half of Utah's passing offense.\nHe also had a 40-yard punt return that was two yards short of a touchdown — a crying shame given the bobbing and weaving master class he gave USC on the play. He broke at least five tackles in the first-quarter return, setting up the Utes for a touchdown one snap later.\n  But even though Covey scored two of Utah's touchdowns and set up the third, he was as frustrated as anyone when the Utes lost at the Coliseum. \nThe freshman looked stern in the postgame news conference, gnawing on his first loss as a Ute.\n\"This feeling that we have right now, you just never want to feel it again,\" Covey said. \"I think that's part of being a competitor. You hate to lose just as much as you love to win.\"\nFailure is unfamiliar to Covey, who was 26-0 as Timpview's starting quarterback in high school, leading the Thunderbirds to state titles in 2013 and 2014. His grandfather, Stephen Covey, literally wrote the book on the habits of success.\nDuring Utah's undefeated start, he arose as one of the top receiving threats for the offense. He only took more steps in that area on Saturday, doubling his previous single-game high in yardage and taking over as the team's receiving leader.\nDefeat was painful, Covey acknowledged, but — as he often has throughout his freshman year — he seemed to find the right thing to say as he faced it for the first time.\n\"Our main goal is to win the Pac-12 South, and we're still in the driver's seat right now,\" he said. \"Going into Monday, that's going to be huge for us to have that as motivation.\"\n\nkgoon@sltrib.com \nTwitter: @kylegoon", "external_links": [], "published": "2015-10-24T03:00:00.000+03:00", "crawled": "2015-10-25T18:53:05.638+02:00", "highlightTitle": ""}