{"organizations": [], "uuid": "239d345e421abfb6831d4086522ab2edf62663f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thv11.com", "main_image": "http://www.gannett-cdn.com/-mm-/489efad1142179deef9ce5ef3cf126cd99e1a3f1/r=x633&amp;c=1200x630/http/cdn.tegna-tv.com/-mm-/9a10d18443197ab9a2a837953a60ea6375b5467c/c=4-0-1916-1080/local/-/media/2015/10/12/KTHV/KTHV/635802061401689842-Still1011-00001.jpg", "site_section": "http://rssfeeds.thv11.com/_/20/109664308/kthv/sports", "section_title": "KTHV - Sports", "url": "http://www.thv11.com/story/sports/2015/10/12/astate-red-wolves/73801590/", "country": "US", "title": "A-State making final preps for South Alabama", "performance_score": 0, "site": "thv11.com", "participants_count": 0, "title_full": "A-State making final preps for South Alabama", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T07:22:00.000+03:00", "replies_count": 0, "uuid": "239d345e421abfb6831d4086522ab2edf62663f1"}, "author": "", "url": "http://www.thv11.com/story/sports/2015/10/12/astate-red-wolves/73801590/", "ord_in_thread": 0, "title": "A-State making final preps for South Alabama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A-State making final preps for South Alabama A-State making final preps for South Alabama Post to Facebook A-State making final preps for South Alabama A-State making final preps for South Alabama  //on.kthv.com/1RBLckB   Join the Conversation To   A-State making final preps for South Alabama A-State , Press Release 11:22 p.m. CDT October 11, 2015 A-State \nJONESBORO, Ark. (A-State) Game note. A-State making final preps for South Alabama KTHV \nON TAP: Coming off a 49-35 victory over Idaho in its first Sun Belt Conference game of the season, Arkansas State continues league play Oct. 13 with a Tuesday night ESPN2 game at South Alabama. Every A-State game can be heard live on 107.9 FM in the Northeast Arkansas area. The live radio broadcast can also be accessed through the official A-State Athletics web site (AStateRedWolves.com). \nBY THE NUMBERS . . . \n0.7 career sacks p/g by Ja'Von Rolland-Jones is the 2nd highest average in the nation among active players.1 or more turnovers gained by A-State in 16 of 18 games under defensive coordinator Joe Cauthen.4 consecutive bowl game appearances, including back-to-back GoDaddy Bowl wins in 2013 and 2014.4 consecutive winning seasons by A-State (last time 1984-87).4 current players have already earned their degree -- T. Houston, L. Ferguson, B. Mays, C. Girley.4 true freshmen and seven total freshmen on A-State's current depth chart.5 school records held by J.D. McKissic, including single-game (15), season (103) & career receptions (264).5 head coaches over the last 6 years (Steve Roberts, Hugh Freeze, Gus Malzahn, Bryan Harsin, Blake Anderson).6 straight seasons, including 2015, A-State has played a regular or postseason game at Ladd-Peebles Stadium.6.8 career yards per rushing attempt by Michael Gordon is the second highest in school history.7 victories claimed by Arkansas State over its last 10 midweek games.7 fifth-year seniors and 15 total seniors on A-State's current depth chart.7 of the last 10 seasons (2005-14) have seen A-State reach bowl eligibility.7 or more victories each of the last four seasons (2011-14).8 players named to at least one major award watch list.8 of last nine years w/at least one NFL Draft selection.10 all-time wins by A-State in Sun Belt Conference openers, including the last three in a row.10 interceptions (all over the last 4 games) by A-State are tied for the second most in the nation.10 consecutive seasons with a winning record at Centennial Bank Stadium (2005-14).10 career 100-yard rushing games by Michael Gordon, including A-State's last game versus Idaho.11 punts inside the opponent's 20 by Luke Ferguson -- the most in the Sun Belt Conference.10 Sun Belt Conference Team Academic Awards over the last 13 years.11 Preseason All-Sun Belt Conference selections are the most in the league.12 career runs covering at least 40 yards by Michael Gordon.12 victories by A-State over its last 15 Sun Belt Conference road games.12 victories by A-State over its last 14 games in the month of October dating back to the 2010 season.16 players named to a Preseason All-Sun Belt Conference Team by at least one college football publication.20 receptions needed by J.D. McKissic for the 27th most in NCAA FBS history.25 \"top-10\" school records held by Fredi Knighten.26 Sun Belt Conference victories over the last four seasons (26-6 league record).28.5 career kickoff return average by J.D. McKissic is the 21st highest NCAA FBS history.30 or more points scored by A-State in 34 of its last 52 regular-season games (65 percent).32 tackles by Khari Lain, 26 more than he had all of last season and the 14th most in the Sun Belt.37 victories by A-State over the last five seasons ranks tied for the 31st most in the nation.42.5 career punting average by Luke Ferguson is the second highest in school history.46 All-Sun Belt Conference selections over the last four seasons.48 victories and just 11 losses at Centennial Bank Stadium since 2005 (.813 winning percentage).146 receiving yards needed by J.D. McKissic for the most ever by an A-State player (career).264 career receptions by J.D. McKissic -- most in A-State & Sun Belt history & most in the nation among active players.281 passing yards needed by Fredi Knighten to become the 8th player in school history w/4,000 for a career.300 or more yds total offense in 61 of last 69 games (88 pct.), including all but 2 games under Blake Anderson.400 or more yards total offense averaged last five seasons (2010-14).2010 was the last year A-State started a season with same head coach as the year prior until 2015. \nTHE PRINCIPALS: The Red Wolves began Sun Belt Conference play with a victory for third consecutive year, improving their overall record to 2-3 on the season. A-State will be looking to push its record to .500 or better for the first time this season when it faces South Alabama in its first conference road contest of the season. The Jaguars also got off to a 1-0 Sun Belt start with a 24-18 win at Troy, and they stand 1-1 at Ladd-Peebles Stadium this season. Through five games played for each squad, no more than a 19-yard average separates their total offense and total defense outputs this year. \nHEAD COACH BLAKE ANDERSON: Blake Anderson, a 14-year coaching veteran at the NCAA FBS level who also coached in an NJCAA National Championship game, was named the Red Wolves' 30th all-time head football coach on Dec. 19, 2013. Anderson led A-State to its fourth consecutive winning season and bowl-game appearance his first season at the helm, which also saw the Red Wolves break the school records for total offense (6,194), average yards total offense (476.5 yards per game), total plays (1,024), points scored (477) and touchdowns scored (65). Despite injuries forcing Anderson to use a different starting lineup in every regular-season game, his squad ranked among the top 45 teams in the nation in 23 combined offensive, defensive and special teams categories. In the process, he saw 11 of his players earn All-Sun Belt Conference recognition, which tied the second most in the league. \nFAST START: Out of 30 all-time head coaches at Arkansas State, Blake Anderson became one of just four to win at least seven games (2014) in his first season at the school. The other head coaches to win at least seven games in their first season as head coach at A-State were Bryan Harsin (2013), Gus Malzahn (2012) and Hugh Freeze (2011). \nBREAKING THE CYCLE: Arkansas State began a season with the same head coach it had the season before for the first time since 2010. Not only is Blake Anderson back for his second consecutive year, the Red Wolves have their entire coaching staff back for a second straight year for the first time since 2007. Following a nine-year stint by Steve Roberts as A-State's head coach, Hugh Freeze (Ole Miss), Gus Malzahn (Auburn) and Bryan Harsin (Boise State) all spent one year at the helm of the program. \nTHE ARKANSAS STATE - SOUTH ALABAMA SERIES: Arkansas State holds a 3-0 all-time record against South Alabama in the Sun Belt Conference series that dates back to just 2012. The Red Wolves picked up a 45-10 home win last season, one year after escaping the 2013 meeting with a narrow 17-16 win in Mobile. The Red Wolves also won the initial game between the two teams by a 36-29 score at Centennial Bank Stadium in 2012. \nALABAMA RED WOLVES: Arkansas State has 14 players on its roster from the state of Alabama, which is the third most behind just Arkansas (35) and Texas (15). Among the Red Wolves' 15 players from the state of Alabama, nine have started at least one game this season and five were named to the 2015 Preseason All-Sun Belt Conference Team. \nA-STATE vs. THE SUN BELT: Arkansas State has won 26 of its last 32 Sun Belt Conference games (.813 winning percentage) to run its all-time record in the conference to 59-42. The Red Wolves hold their most all-time victories against ULM with 23. With the exception of Appalachian State and Georgia Southern, which A-State has never faced as an SBC opponent, the Red Wolves have defeated every team in the conference since the football league was formed in 2001. Along with ULM and Louisiana-Lafayette, A-State is one of three teams that have been a part of the conference since it was formed. \nRED WOLVES OCTOBER: Dating back to the 2010 season, Arkansas State holds a 12-2 record over its last 14 games played in the month of October. The Red Wolves went undefeated in the month during both the 2011 and 2012 seasons, 1-1 in 2013, 2-1 last year and are 1-0 this season. \nROAD WARRIORS: Arkansas State has won 12 of its last 15 conference road games dating back to the 2011 season. A-State had won 10 consecutive conference road games, its longest streak ever as a member of any league, before falling at Western Kentucky in its 2013 regular-season finale. The Red Wolves went 4-0 in conference road games in both 2011 and 2012, 2-1 in 2013 and 2-2 a year ago. \nFAMILIAR TERRITORY: While A-State is playing South Alabama in Mobile for just the second time ever, the Red Wolves will be playing a game at Ladd-Peebles Stadium for the sixth time over the last five seasons (2011-15) after participating in the GoDaddy Bowl each of the last four seasons. The Red Wolves only game against USA at the stadium came during the 2013 season. The Red Wolves compiled a 3-2 record at Ladd-Peebles Stadium the last five seasons, picking up GoDaddy Bowl wins in the 2012 and 2013 seasons. \nMIDWEEK MADNESS: Historically, A-State has performed will in midweek games since joining the Sun Belt Conference. The Red Wolves hold an 11-6 record in all midweek games since its 2001 inaugural year in the league and has won seven of their last 10 midweek contests. \nAN A-STATE VICTORY WOULD . . . : give it a .500 or better record for the first time this season . . . make it 3-3 after six games for the third time (2012, 2013 & 2015) over the last four seasons and 2-0 in league play for the third straight year . . . run its record in the month of October to 13-2 dating back to the 2010 season . . . give it 27 victories over its last 33 Sun Belt Conference games . . . keep the Red Wolves undefeated against the Jaguars with a 4-0 record . . . improve its record over the last five seasons to 38-20 . . . give it 13 wins over its last 16 conference road games . . . improve its record in midweek games since 2001 to 12-6 and give it eight wins over its last 11 midweek contests. \nFIVE ALIVE: Arkansas State has put together four consecutive winning seasons (2011-14) for not only the first time as an FBS member, but also the first time at any level since 1984-87 when it was a member of the NCAA FCS. The last time the Red Wolves strung together five straight winning seasons was 1949-53. \nFIVE-YEAR WINS TOTAL: Including back-to-back 10-win seasons in 2011 and 2012, eight more in 2013, seven last year and two this season, the Red Wolves have recorded 37 victories that are tied for the 31st most in the nation over the last five years. \nSTEPPING INTO A STARTING ROLE: Seventeen players have made their first career start at A-State this season (9 vs. USC, 1 vs. Missouri, 7 vs. Missouri State), including 10 on defense and seven on offense. That is the fourth most in the nation behind just UCF (26), Kansas (25) and TCU (19). The defensive starters included DL Waylon Roberson, Donovan Ransom and Robert Mondie, LB's Tajhea Chambers, Chase Robison and Khari Lain, DB's Bo Sentimore, Cody Brown, Blaise Taylor and Jamaris Hart. Gaining their first offensive career start were OL Daniel Keith, Brandon Berg, Joseph Bacchus and Austin Moreton, QB James Tabary and TE Warren Leapheart. \nNEW FACES: Arkansas State has seen 26 total players, including six true freshmen and five redshirt freshmen, achieve their first game experience at A-State over the first three games of the season. Those 26 players are the 12th most in the nation -- TCU has the most with 36. Last season, A-State had 31 players that claimed their first game experience with the program. \nOFFENSE: Joseph Bacchus (Jr., OL), Jhamal Bell (Fr., OL) Brandon Berg (Jr., OL), Brandon Brockman (So., TE), Robert Maxwell (Jr., OL), Logan Moragne (Fr.-R, RB), Chris Murray (Jr., WR), Sterling Stowers (So., WR), James Tabary (Fr.-R, QB), Warren Wand (Fr., RB) || DEFENSE: Cody Brown (Jr., DB), Tajhea Chambers (Fr., LB), Jarrod Chandler (Fr.-R, LB), Justin Clifton (Fr., DB), Ben Gallagher (So., LB), Marcus Hudson (Fr.-R, DE), Chauncey Mason (Fr., DB), Robert Mondie (Jr., DL), Donovan Ransom (Fr., DL), Griffin Riggs (Fr., DE), Waylon Roberson (Jr., DL), Chase Robison (Jr., DE), Bo Sentimore (Jr., DB), Jake Swalley (Jr., DL) || SPECIAL TEAMS: Drew White (Jr., K), J.D. Houston (Jr., K) \nYOUTH MOVEMENT/SENIOR LEADERSHIP: Arkansas State has seven freshmen on its current depth chart, and five of the seven total are true freshmen. At the same time, the Red Wolves also have 15 seniors on their depth chart. Nine of those 15 are listed as starters and seven are fifth-year players. \nTHREE TOP-25: Three of A-State's four non-conference opponents have been ranked among the top 25 teams in the nation at some point this season. USC currently checks in on the AP Poll at No. 17 and Toledo No. 24. Missouri was ranked No. 21 in the nation at the time the Red Wolves played them. A-State began its 2015 campaign with back-to-back games against top-25 teams (No. 8 USC, No. 21 Missouri) for the first time since 2004 when it faced then-ranked No. 17 Missouri and No. 4 LSU. The Red Wolves' lone victory over a top-25 team since joining the FBS in 1992 came against No. 25 Kent State in the 2013 GoDaddy Bowl. USC was the highest ranked opponent Arkansas State had faced since playing at No. 5 Oregon to open the 2012 season. \nUNBUCKLE THE BELT: The Red Wolves stand 10-5 all-time in Sun Belt Conference openers after picking up a 49-35 win over Idaho their last time out. A-State has now won its last three Sun Belt openers, also knocking off ULM 28-14 last year and Troy 41-34 in 2013. Prior to the current three-year stretch, the last time the Red Wolves won three consecutive SBC openers was 2004-06. \nHOME SWEET HOME: Arkansas State has strung together 10 consecutive years with a winning record at Centennial Bank Stadium dating back to 2005. The Red Wolves are now 48-11 (.814 winning percentage) since the 2005 season and have won 23 of their last 27 home games. The Red Wolves actual on-field record all-time at Centennial Bank Stadium is 140-74-1 since it opened in 1974. A-State's six home wins in 2011 were its most since 1985. \nRED WOLVES TABBED THIRD IN SBC PRESEASON POLL: Arkansas State was picked third in the Sun Belt Conference Preseason Coaches Poll, receiving 96 points and one first place vote. The Red Wolves have been picked to finish among the top three teams in the league seven of the last 10 years. A-State has won the conference three of the last four years, including 2011, 2012 and 2013. \nPRESEASON ALL-SUN BELT CONFERENCE: Led by six first-team selections, Arkansas State placed a league-high 11 players on the 2015 Preseason All-Sun Belt Conference Team. The Red Wolves had two first team offense, three first team defense and one first team special teams picks, while five other players garnered second team accolades. \n101ST SEASON: Arkansas State kicked off its 101st season of football Sept. 5 at USC. A-State now holds a 443-471-37 record since the inaugural season and has played in 12 bowl games. A-State did not field a team from 1942-44 due to World War II. Arkansas State also didn't have a team in 1918 as World War I was ending. \nTHREE FORMER WALK-ONS EARN SCHOLARSHIP: Head coach Blake Anderson announced during A-State's fall camp that three former walk-ons to the Red Wolves football team have been awarded full athletics scholarships. While senior defensive back Raziel Velgis has been placed on scholarship in the past, all three have all been a walk-on member of the team at some point during their careers. In addition Velgis, sophomore receiver Sterling Stowers and sophomore defensive lineman Clifford Thomas have earned a scholarship. \nOFFENSIVE TEAM NOTES \nPLAYER OF THE WEEK: Senior running back Michael Gordon was named the Sun Belt Conference Offensive Student-Athlete of the Week on Monday after rushing for a career-high 221 yards and season-high three touchdowns against Idaho, leading Arkansas State to a 49-35 victory over the Vandals. Gordon's 221 rushing yards were the second most by a Sun Belt Conference player this season, the 11th most in the nation so far this year and the second most ever by an A-State player at Centennial Bank Stadium. He ran the ball a career-high 26 times, averaging 8.5 yards per attempt, and recorded three or more rushing touchdowns in a game for the fifth time of his career. \n300-PLUS: Dating back to the 2010 season, Arkansas State has posted at least 300 yards of total offense in 61 of its last 69 games (.884 percentage). A-State went over 300 yards in all 13 games last season, including a season-high 764 versus New Mexico State in its regular-season finale. \n400-PLUS: Including the USC, Missouri State and Idaho games, Arkansas State has posted at least 400 yards total offense in 12 of 18 games under head coach Blake Anderson and offensive coordinator Walt Bell. Last season, the Red Wolves tallied at least 500 yards total offense in five outings and ranked 20th in the nation in total offense (476.5 ypg). \nLIGHTING UP THE SCOREBOARD: A-State has posted at least 30 points in 34 of its last 52 regular-season games (65 percent) dating back to the 2011 season, including eight of the last 12. The Red Wolves have won 22 of their last 26 games when scoring at least 30 points. \nMAKE THE MOST OF YOUR TIME: Despite ranking 68th in the nation in time of possession (30:02 per game), the Red Wolves have run the 33rd most plays (371) among all FBS teams. Additionally, just seven (Arizona, Bowling Green, Oklahoma State, Oregon, Purdue, Texas Tech, UCLA) of the 32 teams that have run more plays than A-State have a lower time of possession than the Red Wolves, who average 1 play every 24 seconds. A-State broke the school record for total plays (1,024) last year when it averaged 1 play every 21 seconds. \nWAND MAKING EARLY IMPACT: Running back Warren Wand has rushed for 210 yards, the second most on the team, and is averaging 6.0 yards per carry as a true freshman. His 210 yards are the most by a true freshman at A-State since current senior cornerback Rocky Hayes posted 538 yards in 2012. Most recently, he finished the Idaho game with a career-high 70 rushing yards that included a season-long 50-yard touchdown run. \nTAKE YOUR TIME: While 52 percent of A-State's scoring drives have taken two minutes or less, the squad put together their two longest scoring drives of the season last game versus Idaho. The Red Wolves fourth scoring drive of the Idaho game covered 91 yards in 19 plays, both their highest of the season. They had another scoring drive in the third quarter that took 6:29, which was also their longest of the season. A-State has had four total drives this season that took four minutes or longer. \nOVER 2,000: This season, senior running back Michael Gordon became the 12th player in school history to record over 2,000 career rushing yards. Gordon has rushed for a team-high 455 yards this season, pushing his career total to 2,354. Currently A-State's ninth all-time leading rusher, Gordon needs an additional 165 rushing yards to become the school's eighth all-time career leader. Gordon is also ranked fifth all-time in rushing touchdowns at A-State with 25 to his credit. He has scored at least one rushing TD in 14 career games, 2+ TDs in seven contests, 3+ TDs in five outings and a career-high five against Idaho as a junior. \nGROWING NUMBERS FOR GRISWOLD: Senior tight end Darion Griswold's 803 career receiving yards are the second most in school history by an A-State tight end behind only Steve Lockhart's 1,216 accumulated between 1968-71. Additionally, Griswold's 58 receptions are the most by an A-State tight end since Trevor Gillott posted 59 from 2006-09. Lockhart also holds the school record for receptions at the position with 79 to his credit. Lockhart was a 12th round NFL Draft pick by the New Orleans Saints. \nTAKING OVER AT QB: In 11 of his 15 career starts (all over the 2013-14 seasons), senior quarterback Fredi Knighten has posted over 200 yards total offense. Knighten has recorded at least 300 yards total offense in seven of the last 11 games dating back to last season. \nA FLARE FOR THE DRAMATIC: Senior RB Michael Gordon holds a career 6.8 average per rush, which ranks as the second highest in school history, and has been a part of 19 plays covering at least 30 yards the past four seasons. He has recorded 12 career runs covering at least 40 yards: \n92 yd TD vs UAPB (2013); 70 yd TD vs ULL (2014); 68 yd vs ULM (2014); 64 yd TD vs Troy (2013); 59 vs. Idaho (2015); 55 vs. Idaho (2015); 53 vs GSU (2014); 50 vs GSU (2014); 49 yd vs ULM (2014); 44 yd TD vs Idaho (2014); 42 yd TD vs Montana State (2014); 40 yd TD vs Texas State (2013) \nMc-KISS-ic THE RECORD GOODBYE: Senior wide receiver J.D. McKissic broke the Sun Belt Conference record for career receptions during the Red Wolves' game against Idaho, recording four receptions to give him 264 for his career. He broke the Sun Belt Conference record (262) formerly held by Troy's Jerrel Jernigan (2007-10). McKissic has caught at least one pass in 41 of 42 career games, including the last six in a row dating back to last season. He entered the 2014 regular-season finale against New Mexico State with a catch in 35 consecutive games (every game of his career), which was the 12th longest streak in the nation at the time. \nRECEIVING RECORDS: J.D. McKissic has already taken over the Arkansas State record books in almost every major receiving statistical category. He holds the school record for receptions in a game (15), season (103) and career (264). He is ranked second for career receiving yards with 2,585 to his credit and has 10 receiving touchdowns that rank tied for seventh. He is the only player in school history to have 70 or more receptions in two different seasons. \nOFFENSIVE NCAA ACTIVE CAREER LEADERS: Arkansas State seniors Fredi Knighten, Michael Gordon and J.D. McKissic are all ranked among the top 31 active NCAA career leaders in at least one statistical category. McKissic leads the nation in career receptions among current players with 264, and the second closest player (Nelson Spruce of Colorado) is 28 receptions behind McKissic. \nDEFENSIVE NOTES \nMISLEADING AVERAGE: While Arkansas State is allowing 390.3 yards per game to rank fourth in the Sun Belt Conference and 77th in the nation, it has been on the field for 373 plays -- the most in the Sun Belt and 19th most in the nation. Its 5.7 yards allowed per pass attempt and 4.5 yards allowed per rush are ranked No. 1 and No. 5 in the SBC, respectively. Its 5.2 yards allowed per play is the second best in the SBC and ranks No. 59 in the nation. \nLOCK IT DOWN: Even while A-State's pass defense efficiency ranked first in the Sun Belt Conference last season at 122.3, the Red Wolves have shown improvement on that number through their first five games this year. Their pass defense efficiency this season is 102.5, which is again the best in the league and currently ranked 20th in the nation. The Red Wolves have 10 interceptions (T2nd in the nation), are allowing just a 53.3 completion percentage (28th in the nation) and 5.7 yards per pass attempt (21st in the nation). \nPLAYING IN THE BACKFIELD: Sophomore defensive end Ja'Von Rolland-Jones finished the Idaho game with a season-high 2.5 tackles for loss, giving him at least a half TFL in four of five games this season and eight of his last 10 contests dating back to last year. He also posted a half sack in the Idaho game, giving him 3.0 for the season and a team-high 11.5 for his career. He has tallied at least a half sack in seven of his last 10 games. \nPICK IT OFF: Senior cornerback Rocky Hayes entered this season with three interceptions recorded over the previous two years he spent in the defensive backfield, but already has a team-high three this season that ranks third in the Sun Belt and 18th in the nation. He completed the Idaho game with a career-high two interceptions. He is currently ranked 24th in the nation in career passes defended (25) among active players. \nTHE FAST LAIN: Sophomore linebacker Khari Lain is off to a fast start to the 2015 season, leading the Red Wolves in tackles through the first five games with 32, which is also the 14th most in the Sun Belt Conference. With an expanded role this season, Lain has already posted 26 more tackles (6) than he had a year ago. \nDEFENSIVE NCAA ACTIVE CAREER LEADERS: Arkansas State's Chris Stone, Rocky Hayes and Ja'Von Rolland-Jones are all ranked among the top-50 active NCAA leaders in one statistical category. Rolland-Jones, ranked 40th in sacks, is one of just two sophomores among the top-50 leaders in the stat. \nPICK IT OFF: While the Red Wolves were unable to record a turnover gained against USC, they came back to record 10 interceptions over their last four games. A-State posted three interceptions against Missouri, Missouri State and Idaho, which were its most since the South Alabama game a year ago. The last time A-State recorded an interception in at least four straight games was the first four contests of the 2014 season. The last time A-State posted an interception in at least five straight games during the same season was 2012 (Oct. 4-Nov. 8. The Red Wolves are ranked tied for second in the nation this season in total interceptions. \nSPECIAL TEAMS NOTES \nPLAYER OF THE WEEK: Senior wide receiver J.D. McKissic was named the Sun Belt Conference Special Teams Student-Athlete of the Week on Nov. 30 after recording a school-record 211 kickoff return yards, including a 92-yard return for a touchdown, during A-State's game against Toledo. His 211 yards were the second most in the nation this season and the fifth most ever by a Sun Belt Conference player. McKissic's 92-yard return was the 10th longest in school history and the first return for a touchdown by an A-State player since he accomplished the feat on a 98-yard return versus Idaho in 2013. He became the 10th player in Sun Belt history to post two kickoff return touchdowns in a career. McKissic increased his career kickoff return yardage total to 1,225 yards, which is the fifth most in school history. \nCOVERED UP: The Red Wolves were one of the top teams in both kickoff and punt coverage a year ago, ranking No. 4 in the nation in kickoff return defense (16.31 ypr) and No. 9 in punt return defense (3.10 ypr). Their first five games of the 2015 season saw them allow just 15.95 yards per kick return, which is the fifth best average in the nation. \nPRECISION PUNTING: Not only is senior punter Luke Ferguson ranked 30th in the nation with a 43.9 yard punting average, he has recorded 11 punts (41 percent) inside the 20 that lead the Sun Belt Conference. Ferguson has posted at least one punt inside the opponent's 20 every game this season, including a career-tying four against Missouri. He finished last season with 22 punts inside the 20 and now has 41 for his career. Read or Share this story: http://on.kthv.com/1RBLckB TOP VIDEOS", "external_links": [], "published": "2015-10-12T07:22:00.000+03:00", "crawled": "2015-10-12T08:15:11.606+03:00", "highlightTitle": ""}