{"organizations": [], "uuid": "3e3faebf2d2dae86a700689dd3741a9f75b370ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/nba", "section_title": "NBA News, Scores, Schedule, Standings, Stats, Photos, Videos - Basketball - MSN Sports", "url": "http://www.msn.com/en-us/sports/nba/reports-raptors-dwane-casey-is-on-the-hot-seat-after-playoff-failure/ar-BBmnBrh", "country": "US", "title": "Reports: Raptors' Dwane Casey is on the hot seat after playoff failure", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "Reports: Raptors' Dwane Casey is on the hot seat after playoff failure", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T03:00:00.000+03:00", "replies_count": 0, "uuid": "3e3faebf2d2dae86a700689dd3741a9f75b370ae"}, "author": "Monster storm makes landfall as category 5 in Mexico", "url": "http://www.msn.com/en-us/sports/nba/reports-raptors-dwane-casey-is-on-the-hot-seat-after-playoff-failure/ar-BBmnBrh", "ord_in_thread": 0, "title": "Reports: Raptors' Dwane Casey is on the hot seat after playoff failure", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Reports: Raptors' Dwane Casey is on the hot seat after playoff failure FOXSports 14 hrs ago © Dan Hamilton-USA TODAY Sports Feb 2, 2015; Toronto, Ontario, CAN; Toronto Raptors head coach Dwane Casey yells from the sidelines against the Milwaukee Bucks at Air Canada Centre. The Bucks won 82-75. Mandatory Credit: Dan Hamilton-USA TODAY Sports In many ways, 2014-15 was a success for the Toronto Raptors. The team made the playoffs for the seventh time in franchise history, although they came up short in the Eastern Conference's first round. That was a continuation of a late-season swoon for the Raptors, who had gotten off to a hot start and had some league observers wondering if they might be a contender to take on LeBron James' Cavaliers in the Eastern Conference finals.\nAdChoices And that downward swing could cost head coach Dwane Casey his job, according to multiple reports. CBS' Ken Berger first reported that Casey was on the hot seat earlier this week, and on Friday, Grantland's Zach Lowe confirmed the report and added some details: Casey has done good work, but Toronto embarrassed itself in the playoffs last season, and the team gutted Casey’s staff of assistants for the second time in only a few seasons. They brought in Andy Greer, a Thibodeau staffer in Chicago, to revamp the defense, and before landing Greer, they made a hard run at another defensive guru, per league sources: Darren Erman, Jackson’s former assistant in Golden State, and now the associate head coach in New Orleans.\nThe bit about the assistant coaches might not seem like much at first glance, but it's a big deal. As Steve Kerr demonstrated in leading the Warriors to a title in his first year as a coach, assistants matter quite a bit. It's paramount that a coach be comfortable with his staff and that the coaches work together to help a team be the best it can be. If the Toronto front office is making suggestions on assistants to Casey, it could be an indication that they lack confidence in him going forward.\nMORE NEWS: Want stories delivered to you? Sign up for our NBA newsletters. Go to MSN Home", "external_links": ["http://www.foxsports.com/other/daily-newslettersignup?intcmp=fscom-newsletter_nbastory", "http://www.foxsports.com/", "http://grantland.com/the-triangle/35-crazy-predictions-for-the-2015-16-nba-season/", "http://go.microsoft.com/fwlink/?LinkID=286759", "http://www.cbssports.com/nba/writer/ken-berger/25347406/george-karl-finds-himself-in-a-familiar-place-the-hot-seat"], "published": "2015-10-24T03:00:00.000+03:00", "crawled": "2015-10-24T17:54:04.580+03:00", "highlightTitle": ""}