{"organizations": [], "uuid": "011a054ce3e7a62e45cab217a224e50528d5f46d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.azcentral.com", "main_image": "http://www.gannett-cdn.com/-mm-/8b93edf856805124387e82df34797550133ae666/c=0-1362-2582-2821&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/14/Phoenix/Phoenix/635804601236929366--X5R0936.jpg", "site_section": "http://www.azcentral.com/sports/", "section_title": "azcentral sports - Phoenix Arizona Sports news, scores, schedules, photos, videos", "url": "http://www.azcentral.com/story/sports/nhl/coyotes/2015/10/14/nicklas-grossmann-protecting-arizona-coyotes-crease-grit/73966342/", "country": "US", "title": "Nicklas Grossmann protecting Arizona Coyotes' crease with grit", "performance_score": 0, "site": "azcentral.com", "participants_count": 2, "title_full": "Nicklas Grossmann protecting Arizona Coyotes' crease with grit", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T04:11:00.000+03:00", "replies_count": 1, "uuid": "011a054ce3e7a62e45cab217a224e50528d5f46d"}, "author": "azcentral.com", "url": "http://www.azcentral.com/story/sports/nhl/coyotes/2015/10/14/nicklas-grossmann-protecting-arizona-coyotes-crease-grit/73966342/", "ord_in_thread": 0, "title": "Nicklas Grossmann protecting Arizona Coyotes' crease with grit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ANAHEIM – Access to the front of the Coyotes’ net wasn’t exactly exclusively granted last season.\nThe team gave up 267 goals or 3.26 per game – the third-worst clip in the entire NHL.\nBut crashing the net has come at a steeper price for the opponent so far this season with defenseman Nicklas Grossmann on patrol.\n“I think if every time you can get guys out of the crease and help Mike (Smith) to see the pucks, that’s when you’ve done a good job,” Grossmann said.\nAZCENTRAL\nArizona Coyotes XTRA app: Get latest news, scores\nThe Coyotes acquired Grossmann in a trade with the Flyers during draft weekend and although the sample size is still small, the 30-year-old has certainly arrived as-advertised – a gritty, hard-nosed stabilizer who isn’t afraid to clear bodies out of the way so Smith can do his job.\n“He’s just a big man,” Smith said. “He’s not friendly to play against on the ice. I think it’s definitely an area we needed to address.”\nNot only has Grossmann been a pillar of toughness in front of the Coyotes’ paint, but he also maneuvered through the first two games without being tagged with a penalty.\nActually, that’s been a trend throughout Grossmann’s career. Since he debuted in 2006-07, Grossmann has topped 50 penalty minutes only twice. In 71 games with the Stars in 2009-10, he had only 32.\n“You need to be aggressive, but you can’t be stupid,” he said. “You can’t go to the box even though it’s going to happen every once in a while. You have to be smart about it. Teams got great power plays, and you don’t want to be put in that situation. But you have to be aggressive and smart. It’s not easy sometimes, but you have to try to find that balance.”\nWith the game seeming to glorify the offensive wizards on the blue line more than the rough-and-tough workers like Grossmann, the impact a player of that style can have could easily get glossed over on the periphery.\nAZCENTRAL\nArizona Coyotes' youth helps spark early success\nBut in-house, the Coyotes are grateful for what Grossmann offers.\n“Gross is a guy who plays in the trenches,” coach Dave Tippett said. “Do you want him running your power play? No. But do you want him on the ice clearing people out in front of your net with three seconds to go in the game? Yeah.”\nBlue-line shuffle\nDefenseman Zbynek Michalek was back in the lineup against the Ducks after being a late scratch Saturday with an upper-body injury.\nStefan Elliott took his spot on the blue line last-minute, playing 12:58. He took two shots on goal and committed two penalties.\n“I thought he was all right,” Tippett said. “Had a couple chances in the first period. That’s what he is. He’s an opportunistic defenseman, moves the puck pretty well. Tough situation. He jumped in and played well.”\nAZCENTRAL\nCoyotes' Mike Smith named NHL's third star of the week\nOn the move\nWhen the Coyotes hired Jon Elkin over the summer to be their new goalie coach, the plan was for Elkin to be with the team only sporadically and that remains the case.\nElkin was around last week for the start of the season but has since left. He, however, remains in communication with Smith.\n“When he is here, obviously it’s time we can get to work and do things,” Smith said. “The good thing about Jon is he watched every single game no matter if he was the coach or not. … He’s always constantly dissecting it and finding ways we can improve on so that will continue.”\nDubnyk returns\nThe Coyotes will complete the second half of a back-to-back tonight when they host the Wild, and goalie Devan Dubnyk will make his first appearance in the Valley since he was traded by the Coyotes last season.\nDubnyk joined the Wild when the team was eight points shy of a playoff spot last January but went 27-9-2 in a franchise-record 38 straight starts to catapult them to a postseason berth.\nAZCENTRAL\nPlenty of positives in Coyotes' impressive start\nAfter finishing the season with a 1.78 goals-against average and .936 save percentage, Dubnyk was named a Vezina Trophy nominee and also captured the Bill Masterton Memorial Trophy awarded to the player who best exemplifies perseverance and dedication to hockey.\n“Dubie came in, and he played well for us,” Tippett said. “He went on to have a good season last year. He’s a real good teammate, real good person. Nice to see him do well.”\nReach the reporter at sarah.mclellan@arizonarepublic.com or 602-444-8276. Follow her at twitter.com/azc_mclellan.\nThursday's game\nWild at Coyotes\nWhen: 7 p.m.\nWhere: Gila River Arena.\nTV/radio: FSAZ/KTAR-AM (620 ) .\nWild update: Minnesota is off to a 2-0 start and hasn’t played since Saturday when it beat St. Louis 3-2. Winger Zach Parise has four goals with three of those coming in the season opener – a 5-4 win over the Avalanche. Defenseman Ryan Suter paces the blue line with three points, all assists. Former Coyote Devan Dubnyk appeared between the pipes for the Wild in both games and has stopped 49 of 55 shots to start the season. Last season, the Wild won all three games against the Coyotes. Center Mikko Koivu has 26 points in 31 career games against Arizona.", "external_links": ["http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/5e774fd0dbf7197fc7379d7320a0aaf7bfb36bf3/c=0-257-1534-1791/local/-/media/2015/08/26/Phoenix/Phoenix/635762199873920709-2coyotes.jpg", "http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/c6453aa678d154629ba107f8fc3d4cc51b961fa0/c=492-0-3444-2952/local/-/media/2015/10/12/Phoenix/Phoenix/635802600399624311-smith.jpg", "http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/90e4ebc52a36c22e2514ceea890f9b3304a38fad/c=0-260-3180-2057&r=x633&c=1200x630/local/-/media/2015/10/12/Phoenix/Phoenix/635802893989094684-coyotes2.jpg", "http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/35e9d9273be31e8e3519d63365aea40da36266cc/c=0-362-2159-1582&r=x633&c=1200x630/local/-/media/2015/10/11/Phoenix/Phoenix/635801802902648366-coyotes.jpg"], "published": "2015-10-15T04:11:00.000+03:00", "crawled": "2015-10-15T06:22:29.806+03:00", "highlightTitle": ""}