{"organizations": ["USC", "ESPN Print Comment"], "uuid": "77c5650ac1c2419fad4bfbd4dc7b4b89721bc2fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "espn.go.com", "main_image": "http://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2015%2F0920%2Fap_950043418204_r10486_1296x729_16%2D9.jpg", "site_section": "http://news.google.com/news?pz=1&cf=all&ned=us&hl=en&topic=s&output=rss", "section_title": "Sports - Google News", "url": "http://espn.go.com/losangeles/college-football/story/_/id/13864229/usc-trojans-head-coach-steve-sarkisian-take-leave-absence", "country": "IL", "title": "USC head coach Steve Sarkisian to take leave of absence - ESPN", "performance_score": 6, "site": "go.com", "participants_count": 0, "title_full": "USC head coach Steve Sarkisian to take leave of absence - ESPN", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T00:55:00.000+03:00", "replies_count": 0, "uuid": "77c5650ac1c2419fad4bfbd4dc7b4b89721bc2fe"}, "author": "", "url": "http://espn.go.com/losangeles/college-football/story/_/id/13864229/usc-trojans-head-coach-steve-sarkisian-take-leave-absence", "ord_in_thread": 0, "title": "USC head coach Steve Sarkisian to take leave of absence - ESPN", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Steve Sarkisian"], "text": "Print Comment \nUSC head coach Steve Sarkisian will take a leave of absence to seek treatment for an undisclosed condition, the school announced Sunday. \nOffensive coordinator Clay Helton will take charge of the Trojans (3-2, 1-2 Pac-12), who have lost two of their last three games. Helton previously served as the Trojans' interim head coach for the 2013 Las Vegas Bowl after previous interim head coach, Ed Orgeron, quit. \nSarkisian was not in attendance at the Trojans' practice on Sunday afternoon. A player told ESPN's Shelley Smith via text that Sarkisian \"showed up lit to meetings again today.\" \nSarkisian showed up Sunday morning at USC and \"he appeared not normal\" and then was told to leave, a source told ESPN's Brett McMurphy. \"They wouldn't let him come to practice,\" a source said. USC was ranked No. 8 in the preseason AP Top 25 and picked to win the Pac-12, but has disappointed under Steve Sarkisian, losing two of its past three games. AP Photo/Mark J. Terrill \nSarkisian is in the midst of a divorce and had an incident at the Troy Salute function. \n\"He was dealing with family issues all [Saturday] night, but he hasn't been in a good place all season,\" the source told McMurphy. \nA source told ESPN's Joe Schad that Sarkisian seemed \"very emotional\" on campus at USC before missing practice and that the \"unusual\" behavior had really not been seen since he mixed alcohol and prescription medication at a booster event prior to the season which led to a \"zombie\" type feeling and slurred words. \nUSC athletic director Pat Haden met with the media after practice. \n\"I was at a basketball event earlier today when I got a call to say Sarkisian was not at practice,\" Haden said. \"I called Steve and he made it clear to me that he was not healthy, and I asked him to take an indefinite leave of absence. I think this is the right thing for our team. \n\"I've spoken to our team and our coaches -- they obviously had a great deal of concern for the health of Coach Sarkisian. It was also clear to me the support that Clay has from the team, and the staff. We've got a big task this week with the Notre Dame game, and Clay will do a great job getting our team ready. I don't have a lot of answers right now for you guys, as I first heard about this an hour and a half ago.\" \nSarkisian publicly apologized before the season after he showed up drunk at a pep rally and made a slurred public statement. He announced he would be getting unspecified treatment, but didn't believe he had a drinking problem, blaming his unsteady appearance on combining alcohol and medication. \nSarkisian, a former BYU quarterback who played in the CFL, was an assistant under Pete Carroll on the Trojans' great teams of the previous decade. Coaching alongside Lane Kiffin, Sarkisian ran USC's offense before getting hired by the University of Washington to take over a winless program in 2009. \nSarkisian rebuilt the Huskies into a regular bowl team, but couldn't lift them among the Pac-12's elite. The Torrance, California, native left Washington to return to USC after Haden fired Kiffin five games into the 2013 season and then told interim coach Orgeron that he wouldn't get the full-time job. \nHelton coached the Trojans for one game after Orgeron quit in disappointment, and Sarkisian kept the veteran coach on his new staff, which includes five coaches who worked with Sarkisian at Washington. \nSarkisian went 9-4 in his first season at USC, losing a handful of big games but showing promise in the final year of the school's NCAA-mandated scholarship restrictions. In the first recruiting cycle after the sanctions ended, Sarkisian and his staff signed the nation's consensus top class last February. \nThe Trojans were ranked No. 8 in the preseason AP Top 25 and picked to win the Pac-12 in a media poll, but the talent-laden team has been unimpressive since rising to No. 6 in the rankings last month. USC gave up 41 points in its first loss to Stanford last week, and the offense was inept throughout its five-point loss to the Huskies. \nUSC enters a tough stretch with games against No. 14 Notre Dame, No. 4 Utah and No. 23 Cal over the next three weeks. \nInformation from ESPN's Garry Paskwietz and The Associated Press was used in this report. 0 Shares", "external_links": [], "published": "2015-10-12T00:55:00.000+03:00", "crawled": "2015-10-12T01:34:32.228+03:00", "highlightTitle": ""}