{"organizations": [], "uuid": "c1cc50a8e4be222dd99c936c708456248e4e16ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newsherald.com", "main_image": "http://www.newsherald.com/Global/images/head/nameplate/fb/newsherald_200x200.png", "site_section": "http://www.newsherald.com/sports?template=rss&mime=xml", "section_title": "Sports - Panama City News Herald", "url": "http://www.newsherald.com/article/20151017/SPORTS/151019304/15769/SPORTS?rssfeed=true", "country": "US", "title": "Former Ram Elliott makes key interception", "performance_score": 0, "site": "newsherald.com", "participants_count": 1, "title_full": "Former Ram Elliott makes key interception", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T00:16:00.000+03:00", "replies_count": 0, "uuid": "c1cc50a8e4be222dd99c936c708456248e4e16ce"}, "author": "DUSTIN KENT", "url": "http://www.newsherald.com/article/20151017/SPORTS/151019304/15769/SPORTS?rssfeed=true", "ord_in_thread": 0, "title": "Former Ram Elliott makes key interception", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Former Ram Elliott makes key interception Javien Elliott might not have been expecting to get his named called going into Saturday’s home tilt against Louisville, but when it was, he certainly made the most of it. Posted Oct. 17, 2015 at 4:14 PM Updated at 4:16 PM Posted Oct. 17, 2015 at 4:14 PM Updated at 4:16 PM TALLAHASSEE — Javien Elliott might not have been expecting to get his named called going into Saturday’s home tilt against Louisville, but when it was, he certainly made the most of it. The former Rutherford Rams player, who came to FSU as a walk-on before getting awarded a scholarship this season, got his first career interception in the third quarter of the Seminoles’ 41-21 win over Louisville. Elliott came on in relief of senior Tyler Hunter, who was taken out of the game after being beaten for a touchdown pass on the Cardinals’ first possession of the second half and then flagged for a late hit after the play. Two Louisville possessions later, Cardinals’ quarterback Lamar Jackson tried to test the former walk-on with a deep pass down the middle, but the receiver couldn’t get free and fell down, with Elliott bringing in the interception at the FSU 17-yard line. Elliott said he wasn’t surprised that the Cardinals targeted him after he came into the game, but said he was ready for the challenge. “They tell me you never know when your number will be called,” he said. “It’s really true. I just wanted to make a play. I tried not to think about it (when the ball was in the air). I just made sure I caught it. I was just happy to be able to make a play.” Fisher said he was happy to see Elliott take advantage of his opportunity and that he’s a testament to what hard work and perseverance can accomplish. “To walk on here, play on the scout team, earn a scholarship, and then go out there and make plays on special teams and be ready to make a play when your number is called (is great),” he said. “I don’t think we appreciated how hard it is what that young man has done. There’s an example.” It’s the second time this season that Elliott has made an immediate impact. In the season-opening game against Texas State – the first college game of Elliott’s career – he forced a fumble on his first play on defense. Playing time has been scarce since the beginning of ACC competition, but Elliott said he had faith that he would get another chance to make an impact for the Seminoles this season. “It’s really huge,” he said. “Just trusting your family and trusting your God, it’s amazing how things can work out. Being a scholarship player is a blessing. At the same time, I still have that hunger on the inside of me like I’m still a walk-on. I try not to let it go to my head. I’m proud to be on scholarship, but I still work every day like I’m a walk-on.” Page 2 of 2 - Elliott, who played for Rutherford’s varsity team from 2008-10, took a circuitous route to playing big-time Division-I football. Receiving little interest from colleges after his senior season, Elliott became a student at GulfCoast and was out of football for two years before his father sent his high school film to FloridaState coaches, who showed interest in bringing him to FSU as a walk-on. The 5-foot-11, 176-pound safety started off on the scout team last season, but was rewarded with a scholarship near the end of fall practice by Fisher. Elliott credited his father and his family for believing that he could do something even he wasn’t sure he could. “They saw something in me that I didn’t even know about,” he said. “People were telling me, ‘you can go to Florida State and play,’ but I was like, ‘that’s a big school.’ But the closer I got here, my confidence started getting up, and when I got here, I realized I could fit in this program. It’s really the people around me that push me to do it.”", "external_links": [], "published": "2015-10-18T00:16:00.000+03:00", "crawled": "2015-10-18T01:23:31.258+03:00", "highlightTitle": ""}