{"organizations": [], "uuid": "92492e00640197b3a8f40f8aab178457b7a62869", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.coloradodaily.com", "main_image": "http://extras.mnginteractive.com/live/media/site21/2015/1008/20151008__09DCSGONw~1.jpg", "site_section": "http://feeds.coloradodaily.com/mngi/rss/CustomRssServlet/25/219106.xml", "section_title": "Sports", "url": "http://www.coloradodaily.com/sports/ci_28941565/cu-football-buffs-boast-emerging-force-diego-gonzalez?source=rss", "country": "IL", "title": "CU football: Buffs boast emerging force in Diego Gonzalez", "performance_score": 0, "site": "coloradodaily.com", "participants_count": 1, "title_full": "CU football: Buffs boast emerging force in Diego Gonzalez", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T00:56:00.000+03:00", "replies_count": 0, "uuid": "92492e00640197b3a8f40f8aab178457b7a62869"}, "author": "Pat Rooney \n\nBuffZone.com Writer", "url": "http://www.coloradodaily.com/sports/ci_28941565/cu-football-buffs-boast-emerging-force-diego-gonzalez?source=rss", "ord_in_thread": 0, "title": "CU football: Buffs boast emerging force in Diego Gonzalez", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CU football: Buffs boast emerging force in Diego Gonzalez First-year starter has made 6 of 7 from 40 yards or more By Pat Rooney \nBuffZone.com Writer Posted: 10/08/2015 03:55:30 PM MDT Teammates congratulate Colorado kicker Diego Gonzalez, center, after he made the winning field goal in overtime against Colorado State. ( Cliff Grassmick / Staff Photographer ) \nEverything anyone needs to know about Colorado Buffaloes kicker Diego Gonzalez can be gleaned from the final frantic minutes of CU's overtime win against Colorado State three weeks ago. \nWith the game tied and victory within reach, Gonzales hit the turf at Sports Authority Field and confidently aligned his sights for a 48-yard field goal that would spark a celebration as time expired. \nThe ball was snapped. Gonzalez paced through his steps ... and promptly jammed his foot into the grass during his swing, not unlike a golfer tearing up turf on a wayward shot. \nAlthough Gonzalez had an attempt blocked earlier against CSU, that errant kick at the end of regulation marked Gonzalez's first true miss in three games. It was easy to wonder if his confidence would be rattled in an overtime session that likely would require his skills. \nYet Buffs fans need not have worried. Gonzalez had already moved on before his mulligan against CSU landed well short of its mark. \nCU's junior kicker coolly knocked down a 32-yard winner moments later, displaying a focus and ability to compartmentalize that belies his five-game experience. Those traits have helped Gonzalez evolve quickly from a potential question mark to a legitimate weapon for the Buffs as they hit the road for a date Saturday at Arizona State (8 p.m., Pac-12 Networks). \n\"I just try to have a short-term memory. It doesn't matter if I made it or missed it,\" Gonzalez said. \"I analyze my kick for maybe a minute, two minutes, and then I move on. When you miss a kick it's pretty hard but that's what I'm focusing on right now. (Special teams coach Toby) Neinas always tells me the most important kick is the next one.\" Advertisement \nAfter biding his time behind four-year starter Will Oliver for two seasons, Gonzalez spent the bulk of spring drills and preseason camp battling Chris Graham for the top place-kicker job. In just a few short weeks, Gonzalez has managed to pull well ahead of the pack. \nGonzalez enters the Arizona State game having made 9 of 12 attempts, a ledger that includes a 6 of 7 mark from at least 40 yards. Gonzalez booted a pair of 46-yard field goals against Nicholls and connected for 52-yarders against CSU and last week against Oregon. \nThis week, head coach Mike MacIntyre indicated he wouldn't hesitate to give Gonzalez a shot at a 60-yarder if the situation warranted at the end of a half. \n\"I'm very happy with what he's done so far,\" Neinas said. \"Now, we've got to keep doing it. At the same time, I think Diego would tell you he'd like a couple of those kicks back. But I hope he keeps going, because for us to be good, he's going to have to be good. \n\"Am I pleased he has performed well under pressure? Absolutely, because that's the unknown. In that respect, I'd say it's a pleasant surprise. But I always felt he could do it.\" \nGonzalez, who also is perfect on 19 point-after attempts, has handled the place-kicking duties while Graham has manned the kickoffs, but that dynamic might be changing. \nMacIntyre this week compared Gonzalez's kicking form to the fickle nuances of a golf swing, saying the Buffs wanted to keep Gonzalez's scoring stroke primed instead of adding the more forceful kickoff routine to his duties. Graham, though, has tallied only 13 touchbacks on 33 kickoff attempts, and so the Buffs might soon be turning to Gonzalez's booming left leg. \n\"We've practiced (kickoffs) with both he and Chris, and we haven't hit the ball as well as in the kickoff aspect as we can and as we want to,\" Neinas said. \"I'd like to try and keep the division of labor as long as I can, but if it gets to a point where one guy is kicking that much better than the other guy, then we have to go with the guy that gives us the best chance.\"", "external_links": [], "published": "2015-10-09T00:56:00.000+03:00", "crawled": "2015-10-09T05:48:04.253+03:00", "highlightTitle": ""}