{"organizations": [], "uuid": "63ccd3c18518ea77970d79476c96a49384418575", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/2/9/152179/World/International/US-official-defends-surveillance-on-eve-of-EU-data.aspx", "country": "EG", "title": "US official defends surveillance on eve of EU data ruling - International - World", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "US official defends surveillance on eve of EU data ruling - International - World - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "63ccd3c18518ea77970d79476c96a49384418575"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/2/9/152179/World/International/US-official-defends-surveillance-on-eve-of-EU-data.aspx", "ord_in_thread": 0, "title": "US official defends surveillance on eve of EU data ruling - International - World", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related EU member state can suspend Facebook data sharing with US: Court advisor EU, US reach data protection deal allowing Europeans to sue over privacy breaches EU, US clinch data-sharing deal for security, terrorism cases: Document US intelligence does not conduct mass, indiscriminate harvesting of foreigners' private data, a senior U.S. official has said on the eve of a landmark EU court ruling that will affect thousands of companies including the likes of Facebook.\nRobert Litt, legal adviser to the Director of National Intelligence, firmly rebutted allegations that a U.S. surveillance programme known as Prism, revealed in 2013, allows authorities to hoover up such information on a vast scale.\n\"Prism is focused and reasonable. It does not involve 'mass' and 'unrestricted' collection of data,\" Litt wrote in the Financial Times, referring to the programme whose existence was leaked in 2013 by former National Security Agency contractor Edward Snowden.\nSnowden's revelations prompted an Austrian student, Max Schrems, to challenge Facebook's transfers of European users' data to its U.S. servers because of the risk of U.S. snooping. As Facebook has its European headquarters in Ireland, he filed his complaint to the Irish Data Protection Commissioner.\nThe case has found its way to the European Court of Justice (ECJ), which will rule on Tuesday on the validity of the entire legal framework, known as Safe Harbour, that allows more than 4,000 companies, from social media groups to airlines, to transfer data from the European Union to the United States.\nWithout Safe Harbour, such transfers would be forbidden, or only allowed via costlier and more time-consuming means, under EU laws that prohibit data-sharing with countries deemed to have lower privacy standards, of which the United States is one.\nSeparately from Schrems' case, the European Commission has been talking to Washington for the past two years about reviewing the 15-year-old Safe Harbour to address its own concerns.\nThose efforts could prove to be fruitless if the ECJ follows the reasoning of one of its top advisers, who said two weeks ago that Safe Harbour ought to have been scrapped.\nOfficials are waiting to see how much wiggle room the ECJ decision will leave them to come out with a strengthened framework, or if they will have to resort to other mechanisms to ensure companies can continue to transfer data.\nThe Commission will give a news conference at 1500 CET (1300 GMT) on Tuesday in reaction to the ruling.", "external_links": [], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-06T04:52:39.200+03:00", "highlightTitle": ""}