{"organizations": ["Saints", "Cowboys"], "uuid": "14f91231cf9c4d5281c548e7c94f6a7f575372d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usatoday.com", "main_image": "http://www.gannett-cdn.com/-mm-/36ca66b489d89f2e843ec1c4c2f86467c082793e/c=0-226-3664-2287&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/05/USATODAY/usatsports/df7bdc87bd7ee92c830f6a70670079cd.jpg", "site_section": "http://www.usatoday.com/sports/", "section_title": "USA Today | Sports", "url": "http://www.usatoday.com/story/sports/nfl/2015/10/04/brees-400th-td-pass-lifts-saints-over-cowboys-26-20-in-ot/73362146/", "country": "US", "title": "Brees' 400th TD pass lifts Saints over Cowboys, 26-20 in OT", "performance_score": 0, "site": "usatoday.com", "participants_count": 0, "title_full": "Brees' 400th TD pass lifts Saints over Cowboys, 26-20 in OT", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T07:49:00.000+03:00", "replies_count": 0, "uuid": "14f91231cf9c4d5281c548e7c94f6a7f575372d8"}, "author": "", "url": "http://www.usatoday.com/story/sports/nfl/2015/10/04/brees-400th-td-pass-lifts-saints-over-cowboys-26-20-in-ot/73362146/", "ord_in_thread": 0, "title": "Brees' 400th TD pass lifts Saints over Cowboys, 26-20 in OT", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Brees"], "text": "(Photo: The Associated Press)\n1 CONNECT 2 TWEET LINKEDIN COMMENT EMAIL MORE NEW ORLEANS (AP) — Drew Brees hit C.J. Spiller with a short pass that the running back turned into an 80-yard touchdown — the 400th of the Saints quarterback's career — on the second play of overtime and New Orleans won for the first time this season, 26-20 over the injury-decimated Cowboys on Monday night.\n\"We had to really earn it on both sides of the ball, all the way around,\" Brees said. \"These types of wins really strengthen you, really bring you together, help build confidence.\"\nBrees, who missed New Orleans' previous game because of a bruised rotator cuff in his right (throwing) shoulder, completed 33 of 41 throws for 359 yards and two TDs in his return.\n\"It felt fine. Felt good enough, got the job done, so we're all good,\" Brees said of his shoulder.\nMark Ingram gained 126 yards from scrimmage on a combination of runs and short passes, and Khiry Robinson had a 1-yard touchdown run for New Orleans (1-3).\nJoseph Randle scored the lone TD for Dallas (2-2) on a 1-yard run in the first half. The winning score enlivened a Superdome crowd stunned by Saints kicker Zach Hocker's 30-yard miss in the final seconds of regulation.\nDallas quarterback Brandon Weeden, filling in while Tony Romo recovers from a broken clavicle, came through with clutch 91-yard touchdown drive to tie the game in the final minutes of regulation, only to lose his 10th straight start overall, tying him with Blaine Gabbert for the longest such streak among active QBs.\nThe tying touchdown was as clutch as it gets — a 17-yard pass to Terrance Williams on fourth down with less than 2 minutes left.\nBrees then quickly marched New Orleans into what should have been easy field goal range, only to have the celebration delayed when Hocker, a first-year kicker who had hit from 51 yards earlier, hit the left upright.\nBut New Orleans won the toss and took the ball first, and two plays later, the game was over on the first TD of the season by Spiller, who was signed as a free agent last offseason.\n\"I knew nobody was going to catch him,\" Brees said.\nDallas failed to win what would have been an 11th-straight road game in regulation. But even with New Orleans struggling, winning the Superdome was going to be a tall order for a Cowboys squad so riddled with injuries.\nEarlier in the week, Dallas had ruled out star receiver Dez Bryant (foot) and defensive end Randy Gregory (ankle), who was a second-round draft pick last spring.\nMeanwhile, defensive end Greg Hardy was serving the final game of his domestic violence suspension.\nOn top of that, linebacker Sean Lee, one of Dallas' best defensive players, left in the first half with a concussion. Then Lance Dunbar, who'd rushed for 54 yards in the first half, had to be helped off the field with a knee injury after returning the kickoff to open the second half.\nBy contrast, the struggling Saints benefited not only from having Brees back, but also cornerback Keenan Lewis (hip), safety Jairus Byrd (knee) and linebacker Dannell Ellerbe (toe) in the lineup for the first time this season.\nYet, struggling New Orleans found itself in another tense, close matchup in which it could not sustain momentum.\nBrees was under constant pressure and was not consistently on target.\nHe found tight end Josh Hill for a 7-3 lead late in the first quarter, but Dallas went back in front on Joseph Randle's 1-yard TD put Dallas back ahead 10-7 minutes later.\nNew Orleans tied it at 10 on Hocker's 51-yarder and the teams exchanged field goals again to enter the fourth quarter tied at 13.\n___\nAP NFL websites: http://pro32.ap.org and http://twitter.com/AP_NFL\n1 CONNECT 2 TWEET LINKEDIN COMMENT EMAIL MORE Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.\nTOP VIDEOS", "external_links": ["http://www.gannett-cdn.com/-mm-/af66c3c26816c331b794963f11660b3e4b97f3cd/c=156-0-3507-2513&r=x404&c=534x401/local/-/media/2015/10/05/USATODAY/usatsports/df7bdc87bd7ee92c830f6a70670079cd.jpg", "http://www.linkedin.com/shareArticle?url=http%3A//usat.ly/1Rq6IZI&mini=true", "https://twitter.com/intent/tweet?url=http%3A//usat.ly/1Rq6IZI&text=Brees%27%20400th%20TD%20pass%20lifts%20Saints%20over%20Cowboys%2C%2026-20%20in%20OT&via=usatoday", "http://twitter.com/AP_NFL"], "published": "2015-10-05T07:49:00.000+03:00", "crawled": "2015-10-05T08:06:37.278+03:00", "highlightTitle": ""}