{"organizations": [], "uuid": "2b38e9999764e0d7c41a9c398992408ab60b3b6d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mid-day.com", "main_image": "http://images.mid-day.com/images/2015/oct/oscar20oct-l.jpg", "site_section": "http://www.mid-day.com/Resources/midday/rss/sports.xml#", "section_title": "sports", "url": "http://www.mid-day.com/articles/oscar-pistorius-released-from-prison-put-under-house-arrest/16621188", "country": "IN", "title": "Oscar Pistorius released from prison, put under house arrest", "performance_score": 0, "site": "mid-day.com", "participants_count": 1, "title_full": "Oscar Pistorius released from prison, put under house arrest - Sports", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "2b38e9999764e0d7c41a9c398992408ab60b3b6d"}, "author": "IANS", "url": "http://www.mid-day.com/articles/oscar-pistorius-released-from-prison-put-under-house-arrest/16621188", "ord_in_thread": 0, "title": "Oscar Pistorius released from prison, put under house arrest", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Pretoria: South African Paralympian Oscar Pistorius has been released from prison and put under house arrest nearly a year after he was jailed for killing his girlfriend Reeva Steenkamp, officials said on Tuesday.\nDepartment of Correctional Services spokesman Manelisi Wolela confirmed the athlete was released on Monday night, the Independent Online reported.\n\nOscar Pistorius. Pic/ AFP \n\"The handling of the actual placement is an operational matter of the local management, and how they handle it is their prerogative that is carried out in the best interest of all parties concerned, the victims, the offender and the Department of Correctional Services,\" he added.\nOscar Pistorius, 28, was driven under cover of darkness to his uncle's house 20 minutes away, a premature departure designed presumably to avoid the media glare, a source close to the athlete said.\nHe will not be electronically tagged but he will have restrictions on his movement, the source said, adding his parole conditions include gun ownership restrictions and continued psychotherapy sessions. The disabled sportsman is also expected to do a period of community service.\nPistorius was sentenced to five years in jail by Judge Thokozile Masipa on October 21, 2014. During the trial, he testified that he accidentally shot dead Steenkamp, 29, through a locked bathroom door at his Pretoria home on Valentine’s Day, 2013. He said he thought she was an intruder.\nPistorius was sentenced to five years for culpable homicide, and three years suspended for five years for discharging a firearm at a restaurant in January 2013.\nOn October 15, Wolela said the Kgosi Mampuru II Correctional Supervision and Parole Board (CSPB) had approved Pistorius’s placement “under correctional supervision as from October 20, 2015”.\nHowever, the Supreme Court of Appeal in Bloemfontein will hear the State’s appeal against the murder acquittal for Pistorius on November 3.", "external_links": [], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-20T11:45:55.069+03:00", "highlightTitle": ""}