{"organizations": [], "uuid": "17c81151aec70602aad579cf2a98773d1e037e60", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.star-telegram.com", "main_image": "http://www.star-telegram.com/sports/college/big-12/texas-christian-university/i3ahru/picture40514961/ALTERNATES/LANDSCAPE_1140/big%2012%20media%20day%201021%20sp%2010", "site_section": "http://www.star-telegram.com/sports/?widgetName=rssfeed&widgetContentId=714290&getXmlFeed=true", "section_title": "College & professional Sports news, scores & photos | star-telegram.com &", "url": "http://www.star-telegram.com/sports/college/big-12/texas-christian-university/article40514964.html", "country": "US", "title": "As coach Trent Johnson puts it, opportunity awaits TCU basketball", "performance_score": 0, "site": "star-telegram.com", "participants_count": 1, "title_full": "As coach Trent Johnson puts it, opportunity awaits TCU basketball", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T00:37:00.000+03:00", "replies_count": 0, "uuid": "17c81151aec70602aad579cf2a98773d1e037e60"}, "author": "Carlos Mendez \ncmendez@star-telegram.com", "url": "http://www.star-telegram.com/sports/college/big-12/texas-christian-university/article40514964.html", "ord_in_thread": 0, "title": "As coach Trent Johnson puts it, opportunity awaits TCU basketball", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "As coach Trent Johnson puts it, opportunity awaits TCU basketball \nFrogs coming off best season in Big 12 \nTwo best players from last year gone, another hurt \nSeveral players will get a chance at new roles TCU videographer Kayla McLain gets creative with a chair to get on the same level with TCU players Chris Washburn (left) and Karviar Shepherd during Big 12 basketball media day at the Sprint Center in Kansas City, Mo. Rich Sugg Kansas City Star i \nTCU has an opportunity to be a better basketball team, coach Trent Johnson said Tuesday. \nAnd he emphasized “opportunity.” \n“There are some opportunities out there for a lot of guys.” \n“You dwell on the day, the next play, the next opportunity.” \n“I tell them, ‘Hey, look, enjoy the opportunity that is presented to you and put your work in every day.’ ” \n“Obviously we’re excited about the opportunity to move to our new venue.” \nJohnson delivered his message consistently at the Big 12’s basketball media day at the Sprint Center, site of the conference tournament, where TCU played its final game of the season last year — a three-point loss to league champion Kansas. \nIt ended an 18-win season for the Horned Frogs and their best season in the Big 12. \n\n158 Starts combined at TCU for Brandon Parrish, Karviar Shepherd, Chris Washburn, Davonta Abron and Michael Williams. The rest of the roster, excluding the sidelined Kenrich Williams, has no Division I starts. \nBut Johnson brushed aside a chance — ahem, an opportunity — to talk about that. The start of his fourth season at TCU awaits. \n“We’ve got like a 4:30 flight out and a 9 p.m. practice,” he said. “So we look forward to that. This is a situation for me, and it always has been, where you don’t live in the past.” \nBut the past is telling something about TCU basketball. Last season, the Frogs won four games in the league, their most since joining in 2012. They won their first road game in the league. They won their first conference tournament game. \n“We look at that and try to build,” junior post Karviar Shepherd said. “You look at that and say, we were this good, we’re trying to get somewhere, trying to get to the NCAA tournament, trying to win some more games. But as a team, you don’t linger on the past. You try to build the future.” The Horned Frogs basketball coach talks about the upcoming season he expects from the 6-10 post player. \nIn recruiting, it translated to the signing of the top-rated combo guard in junior college, Malique Trent, and the 10th-rated player in the state, Seagoville forward J.D. Miller. Already this year, the Frogs have a commitment from three-star forward Josh Parrish of Arlington Seguin, the younger brother of TCU forward Brandon Parrish. \nSchool officials invested $72 million in a renovation of the basketball arena, set to debut with a men’s and women’s doubleheader on Nov. 13. TCU basketball coach talks about the benefits of playing in the renovated arena. \nSo momentum is building for Johnson’s opportunities. \n\nWe had our opportunities last year, and we didn’t, quite frankly, close some situations, some deals. \nTCU coach Trent Johnson \n“We had our opportunities last year, and we didn’t, quite frankly, close some situations, some deals,” he said. “So moving forward, you can have all the facilities in the world, but you’ve got to compete at a high level and win games.” \nThis year, that will have to happen without guard Kyan Anderson and forward Trey Zeigler, the two best players from last year’s team. \nHow will it be done? \n“It’s going to have to be done by committee,” Johnson said, naming true freshman Lyrik Shreiner, sophomore Chauncey Collins and junior Mike Williams. “Those three guys will be at the point guard position. So you’d like to think that three players can replace one. ... And then Trey Zeigler, from a leadership standpoint will be missed. But obviously, moving forward, guys have an opportunity to come in and make plays.” \n\nLast season, TCU was unbeaten in non-conference for the first time, going 13-0. It tied for the 10th-best start in Big 12 history. \nThe Frogs must also replace leading rebounder Kenrich Williams, a junior who will miss the season recovering from knee surgery. \nHow? \n“It’s going to be done by committee,” Johnson said. “A kid by the name of Jalen Miller, who is very, very talented, is going to have to be brought along at a faster rate than we normally would. But there are some opportunities out there for a lot of guys.” TCU basketball coach Trent Johnson talks about his team during Big 12 media day in Kansas City, Mo. \nJohnson said Shepherd, Chris Washburn, Brandon Parrish and others may or may not find themselves with new roles. It will require an adjustment. \n“We have some guys that have been through it, so to speak,” Johnson said. “The key for us is leadership, and then obviously guys having opportunities to score the ball and doing that with confidence and taking care of the ball, doing that with confidence, and being able to pass and catch and doing that with confidence. Hopefully that will put us in a situation where we get over the hump.” \nAnd have another opportunity in Kansas City next year.", "external_links": [], "published": "2015-10-21T00:37:00.000+03:00", "crawled": "2015-10-21T01:36:40.146+03:00", "highlightTitle": ""}