{"organizations": [], "uuid": "9dfc72953d1181bc18074f54be0cc4c3fb741544", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtontimes.com", "main_image": "http://media.washtimes.com.s3.amazonaws.com/media/image/2015/10/16/c16b7e5e07acab2e840f6a7067001704.jpg", "site_section": "http://www.washingtontimes.com/rss/headlines/sports/", "section_title": "www.washingtontimes.com stories: Sports", "url": "http://www.washingtontimes.com/news/2015/oct/16/questions-abound-for-utah-jazz-at-point-guard-posi/", "country": "US", "title": "Questions abound for Utah Jazz at point guard position", "performance_score": 0, "site": "washingtontimes.com", "participants_count": 1, "title_full": "Questions abound for Utah Jazz at point guard position", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T20:37:00.000+03:00", "replies_count": 0, "uuid": "9dfc72953d1181bc18074f54be0cc4c3fb741544"}, "author": "KAREEM COPELAND", "url": "http://www.washingtontimes.com/news/2015/oct/16/questions-abound-for-utah-jazz-at-point-guard-posi/", "ord_in_thread": 0, "title": "Questions abound for Utah Jazz at point guard position", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sports Questions abound for Utah Jazz at point guard position Portland Trail Blazers forward Allen Crabbe (23) defends against Utah Jazz guard Trey Burke (3) during the second half of an NBA preseason basketball game Monday, Oct. 12, 2015, in Salt Lake City. The Trail Blazers won 88-81. (AP Photo/Rick ... more > By KAREEM COPELAND - Associated Press   \nSALT LAKE CITY (AP) - The Utah Jazz find themselves in a bit of a predicament on the eve of the 2015-16 NBA season. \nGeneral manager Dennis Lindsey kept the core of the team together after a strong finish to last season. He stuck to the slow rebuild philosophy and resisted the temptation to spend lavishly in free agency. \nBut the dynamic the team hoped to continue to grow took a blow when point guard Dante Exum tore his ACL playing with the Australian national team during the summer. The Jazz were already young with sixth-year forwards Gordon Hayward and Derrick Favors as the elder statesmen among the major contributors. The loss of Exum was a significant blow. \nExum certainly wasn’t expected to play at an all-star level in his second season, but his intangibles were invaluable to the team. Coach Quin Snyder is a defense-first coach and Exum’s 6-foot-6 length, plus his quickness, at the position was an advantage over many teams on that end of the floor. \nSnyder hasn’t publicly laid out his exact plan, but he said the team will grow with Trey Burke, 22, Raul Neto, 23, and Bryce Cotton, 23. \nBurke has the most NBA experience as the No. 9 overall pick in the 2013 draft, but battled inconsistency his first two years. He said he dedicated himself to being a better professional this summer. This is a crossroads moment in Burke’s career and he needs to show marked improvement. \nThis will be Neto’s first year in the NBA and his shooting and defense must improve. Cotton went undrafted in 2014 and has only played in 15 NBA games. \nAll three are listed at 6-1. \n“Part of growth is having the confidence to play guys and be able to see mistakes,” Snyder said. “That’s a different type of production. But if we can get these guys dialed in on roles, and if they can fulfill those roles, that will be the production that we need from that position. It may not be glamorous.” \nThe uncertainty at the position has Snyder playing with different lineup combinations this preseason, including rotations without a point guard and having wings - such as Hayward, Alec Burks and Rodney Hood - bring the ball up and initiate the offense. \nEither way, the Jazz have playoff aspirations, but are down a starter already. Lindsey considers the return of Burks from a shoulder injury as their free agent acquisition, but uncertainty at point guard in a conference that has Stephen Curry, Russell Westbrook, Chris Paul, Tony Parker, Mike Conley, Damian Lillard, Rajon Rondo, Brandon Knight, Ty Lawson and Deron Williams presents a significant challenge to those postseason hopes. \nThings to watch during the 2015-16 season: \nADDED OFFENSE: The Jazz were No. 26 in the league in scoring (95.1 points per game) last season and there was a need for additional offense on the wing. Enter Burks. The 6-6, 214-pound fourth-year player has been the Jazz’s best player during preseason (13.5 points, 5.8 rebounds, 3.5 assists), showing the athleticism and scoring touch that earned him a four-year, $41 million extension last season. “I hope I am the piece they’re missing,” Burks said. \nEVEN BIGGER: The Jazz were already one of the longer teams in the league last season with every starter standing at least 6-6. The roster got even longer with the addition of 6-10 first-round draft pick Trey Lyles, 7-3 rookie center Tibor Pleiss and 7-0 center Jeff Withey. Snyder loves length on defense and those three give even him more combination options. The Jazz, however, will go small at times with Hayward playing some power forward. \nBIG 3: The Jazz need Hayward, Derrick Favors and Rudy Gobert to continue to improve to make that playoff jump. Hayward averaged a career-high 19.3 points last season and returned significantly stronger with a focus on being a better finisher. Favors set career-highs in points and blocks and spent the offseason extending the range on his jump shot. Favors was in the conversation for Most Improved Player and Defensive Player of the Year in 2014-15. He added muscle for the season and some offensive maneuvers in the paint. \nCopyright © 2015 The Washington Times, LLC.", "external_links": [], "published": "2015-10-16T20:37:00.000+03:00", "crawled": "2015-10-16T22:23:53.067+03:00", "highlightTitle": ""}