{"organizations": [], "uuid": "344157ff0919947a422a11880ffaf01a2baa9c70", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "wtop.com", "main_image": "http://wtop.com/wp-content/uploads/2015/10/Britain-Rugby-WCup-South-Africa.jpeg", "site_section": "http://wtop.com/section/sports/feed/", "section_title": "WTOP » Sections » Sports", "url": "http://wtop.com/sports/2015/10/matfield-out-pietersen-returns-for-springboks-for-quarters/", "country": "US", "title": "Matfield out, Pietersen returns for Springboks for quarters", "performance_score": 0, "site": "wtop.com", "participants_count": 1, "title_full": "Matfield out, Pietersen returns for Springboks for quarters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T15:06:00.000+03:00", "replies_count": 0, "uuid": "344157ff0919947a422a11880ffaf01a2baa9c70"}, "author": "wtopstaff", "url": "http://wtop.com/sports/2015/10/matfield-out-pietersen-returns-for-springboks-for-quarters/", "ord_in_thread": 0, "title": "Matfield out, Pietersen returns for Springboks for quarters", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home » News » Sports » Matfield out, Pietersen returns… Matfield out, Pietersen returns for Springboks for quarters By FOSTER NIUMATA October 14, 2015 8:06 am South Africa head coach Heyneke Meyer attends a training session at Pennyhill Park, in Bagshot, outside London, Tuesday, Oct. 13, 2015. South Africa will play Wales during their Rugby World Cup quarterfinal match on Saturday, Oct. 17. (AP Photo/Christophe Ena) \nLONDON (AP) — Victor Matfield made it easy in the end for South Africa coach Heyneke Meyer. \nWhether Matfield played or not was the biggest question regarding the team announcement on Wednesday for South Africa’s Rugby World Cup quarterfinal against Wales. \nBut Matfield made it moot when the Springboks great, who came out of retirement last year to play in his fourth World Cup, withdrew from consideration because his left hamstring was still sore at training on Tuesday. \nMatfield missed the last two pool games because of the hamstring problem, and Meyer said he wanted to pick the veteran lock in the reserves for the quarterfinal. Now, though, he hoped the 38-year-old Matfield would be available if the Springboks reach the semifinals. \n“It is tough losing two captains in Jean (de Villiers) and Victor, and has been a big setback for us,” Meyer said, “but we have to back the youngsters going forward.” \nMany in South Africa will be satisfied with the locking status quo, after the critical acclaim for the way Lood de Jager has paired with Eben Etzebeth. \n“The type of rugby they are playing at the moment is awesome, and they are probably two of the best locks at the moment in the competition,” Meyer said. \nThe Springboks coach also decided to leave tighthead prop Jannie du Plessis in the reserves, meaning Meyer, criticized all year for hanging on to the old guard, will persist with the young players who pulled him out of the firestorm following the tournament-opening loss to Japan. \nDu Plessis, at his third Rugby World Cup, started in South Africa’s first three games before he was replaced by Frans Malherbe for the last pool game against the United States, won 64-0 last week. Malherbe, who made his debut against Wales in 2013, has kept his place for his 10th cap. \n“Frans has played well up to now, and we have been struggling with continuity,” Meyer said. “Now our pack is playing the rugby I’ve wanted from them, and I didn’t want to change that. In the past, we lacked experience on the bench, and Jannie is a great guy to have there. \n“The decision to go with guys who played in the last game is that we have continuity for the first time this year.” \nThe rest of the starting lineup was as expected, with winger JP Pietersen recovered from a knee injury to bump out Lwazi Mvovo. Pietersen and Bryan Habana each have a hat trick of tries in the tournament, and share nine tries overall. Habana’s five have lifted his career World Cup tally to 15, equal with New Zealand great Jonah Lomu’s record. \nWith Pietersen returning, six players from the 2007 champion team will start on Saturday at Twickenham: Habana, along with hooker Bismarck du Plessis, prop Tendai Mtawarira, flanker Schalk Burger, and captain Fourie du Preez. Two more — Jannie du Plessis and Ruan Pienaar — are on the reserves bench, which will feature 337 caps, almost half as many as the starting lineup. \nAnd yet the lineup will still be the second youngest the Springboks have put out in a Rugby World Cup since the 2007 final win over England, with an age of 27. \nThe youngest, by a week on average, was the lineup last week which thrashed the Eagles at the Olympic Stadium. \n“Even though they’re young guys, they’ve played against the best in the Rugby Championship,” Meyer said of a competition in which the Springboks placed last this year. “They came through the pool matches here, and now I’m backing them. \n“What they lose in experience they make up for in fire and heart. Now it’s my job to really, really get them in the right mode.” \n___ \nSouth Africa: Willie le Roux, JP Pietersen, Jesse Kriel, Damian De Allende, Bryan Habana, Handre Pollard, Fourie du Preez (captain); Duane Vermeulen, Schalk Burger, Francois Louw, Lood de Jager, Eben Etzebeth, Frans Malherbe, Bismarck du Plessis, Tendai Mtawarira. Reserves: Adriaan Strauss, Trevor Nyakane, Jannie du Plessis, Pieter-Steph du Toit, Willem Alberts, Ruan Pienaar, Pat Lambie, Jan Serfontein. Topics:", "external_links": [], "published": "2015-10-14T15:06:00.000+03:00", "crawled": "2015-10-14T16:32:52.195+03:00", "highlightTitle": ""}