{"organizations": [], "uuid": "1d49a43e32ed089dd86abc0083770351b3a0fabe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-561ba9d9/turbine/ct-wht-wheaton-bans-ecigarettes-tl-1015-20151012", "site_section": "http://www.chicagotribune.com/", "section_title": "Chicago Tribune: Chicago breaking news, sports, business, entertainment, weather and traffic - Chicago Tribune", "url": "http://www.chicagotribune.com/suburbs/wheaton/ct-wht-wheaton-bans-ecigarettes-tl-1015-20151012-story.html", "country": "US", "title": "Council restricts e-cigarettes, vaping in certain parts of Wheaton", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Council restricts e-cigarettes, vaping in certain parts of Wheaton - Chicago Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T15:32:00.000+03:00", "replies_count": 0, "uuid": "1d49a43e32ed089dd86abc0083770351b3a0fabe"}, "author": "Marwa Eltagouri", "url": "http://www.chicagotribune.com/suburbs/wheaton/ct-wht-wheaton-bans-ecigarettes-tl-1015-20151012-story.html", "ord_in_thread": 0, "title": "Council restricts e-cigarettes, vaping in certain parts of Wheaton", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Wheaton City Council last week approved an ordinance banning e-cigarettes and vaping in certain parts of the city.\nSimilar to other tobacco products, e-cigarettes are banned from all enclosed public places, places of employment, outdoor events, and Adams and Memorial parks. They are also banned from public sidewalks within 25 feet of a public entrance, an open-air dining area or an outdoor venue during an outdoor event, according to city documents.\nThe decision aims to \"protect the public health, comfort and environment\" to ensure non-smokers and non-vapers may \"breathe air free from the hazardous effects of second-hand smoke and alternative nicotine products,\" according to the ordinance.\nFlashy flavors have allowed e-cigarettes, designed to vaporize a nicotine solution, grow into an industry with an estimated $3.5 billion in annual U.S. sales. Less than a decade after the battery-powered devices were introduced in the U.S., an estimated 10 percent of American adults and 13 percent of high school students \"vape,\" according to recent surveys.\nBut while many users perceive e-cigarettes to be healthier than traditional ones, they might have their own consequences. An increasing number of studies finds that some of the liquids used in e-cigarettes contain flavorings whose inhalation has been associated with lung problems, ranging from irritation to a rare but serious lung disease.\nThe ordinance cited findings from the Food and Drug Administration that said the solution used in e-cigarettes contains toxic chemicals found in antifreeze and other cancer-causing chemicals.\nTeens' e-cigarette use linked with later smoking Tribune wire reports Teens who use e-cigarettes are more likely than others to later smoke conventional cigarettes and other tobacco products, a study at 10 Los Angeles high schools suggests.\nThe study doesn't prove that electronic cigarettes are a \"gateway drug\" but some doctors say it bolsters arguments that the...\nTeens who use e-cigarettes are more likely than others to later smoke conventional cigarettes and other tobacco products, a study at 10 Los Angeles high schools suggests.\nThe study doesn't prove that electronic cigarettes are a \"gateway drug\" but some doctors say it bolsters arguments that the...\n(Tribune wire reports) E-cigarettes are unregulated, though that may change, as the FDA is considering a rule to extend its cigarette-regulating authority to e-cigarette devices. More than 7,700 e-cigarette flavors are being sold under more than 450 brands with no labeling or testing requirements.\nExemptions to Wheaton's e-cigarette ban include tobacco or vaping retailers.\nShould a person smoke or vape in prohibited areas, they can face fines between $100 to $250 per offense. Owners, managers and operators of any space that permits smoking or vaping where prohibited by Wheaton can face a fine of $250 or more for the first violation and at least $500 for the second violation within a year, according to city documents.\nAt last week's meeting, resident Kraig Knudsen, who has worked in the e-cigarette and vaping industry, said it is prudent for Wheaton to hold off on restricting the products until the FDA begins regulating them.\nKnudsen argued that most e-cigarette users and vapers often use the product as an effort to reduce or completely eliminate their dependence on nicotine.\n\"You'd be limiting people who are using these products as a cessation device, and an attempt to quit or reduce their nicotine dependency,\" he said. \"And that saves lives. I think you'd be working against that effort.\"\nStill, the council unanimously approved the smoke- and vape-free ordinance. Councilwoman Suzanne Fitch said the ordinance exempts any products approved by the FDA as tobacco cessation or tobacco dependency products.\n\"We don't want to ban something that's going to help people quit smoking,\" she said. \"But I think that this definition is well-drafted in that regard.\"\nmeltagouri@tribune.com\nTwitter: @marwaeltagouri\n ", "external_links": ["http://www.trbimg.com/img-55d35228/turbine/ct-teens-ecigarettes-20150818", "http://www.trbimg.com/img-561ba9d9/turbine/ct-wht-wheaton-bans-ecigarettes-tl-1015-20151012"], "published": "2015-10-12T15:32:00.000+03:00", "crawled": "2015-10-12T19:29:21.519+03:00", "highlightTitle": ""}