{"organizations": [], "uuid": "5a957f4e2b5a96a0a9dc78a72f0cb300b5a523c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03460/polo3_3460472a.jpg", "site_section": "http://www.telegraph.co.uk/sport/othersports/", "section_title": "Other Sports - Telegraph", "url": "http://www.telegraph.co.uk/sport/othersports/polo/11905806/British-polo-2015-a-season-in-review.html", "country": "GB", "title": "British polo 2015: a season in review", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "British polo 2015: a season in review - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T05:43:00.000+03:00", "replies_count": 0, "uuid": "5a957f4e2b5a96a0a9dc78a72f0cb300b5a523c4"}, "author": "The Telegraph", "url": "http://www.telegraph.co.uk/sport/othersports/polo/11905806/British-polo-2015-a-season-in-review.html", "ord_in_thread": 0, "title": "British polo 2015: a season in review", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "• Follow Telegraph's dedicated polo channel • 13 key questions from 2014 polo season Is there too much dominance by just a select few super powers in high goal polo? Gareth A Davies: Possibly but horse power and the organisation/money behind the teams plays a huge factor and generally it is the teams which pour in the most cash come out on top. Why should we be critical of King Power who have brought great interest and investment into the sport this year. Aurora Eastwood: Yes. The other teams are finding it hard to compete. This has the potential downside of pushing patrons out. Why enter high goal tournaments at vast expense if you don't have a cat in hells chance? A cut above: King Power Foxes, left, ruled the roost What could be done about it? GAD: It is the same in most sports. Investment, organisation and signings' success. The sport ought to guard against wealth being the sole factor behind success. F1 - as Aurora mentions - is testament to that. AE: Tricky one. Short of capping total spend, which would be impossible, money will talk and the best players will go to who pays them the most - ditto the wealthiest patrons can buy the best horses, the best facilities, the best managers. Who wouldn't. However the lower budget teams could look outside the box, perhaps by investigating ways to get the best out of their ponies by looking to the latest developments in biomechanics and training techniques. There's a lot of improvements to be made in those areas. This sport should not become one in which the biggest purse wins. Even F1 isn't like that - Williams spent less than half of what Ferrari spent - and came higher in the championship. Talent, passion and innovation should trump money, power and influence. Have England got their Test and International format right? GAD: There is a sense that there are missed opportunities with international and Test matches. With a summer of cricket dominated by the thrilling Test series between England and New Zealand and Australia, it would have been perfect to align the international polo season potentially against a combined Aus/NZ set-up. And why not have some women's Internationals on the same day? It would give the lady professionals something to aim for, greater sponsorship opportunities and so on. AE: In my mind the International has lost its value. It used to be the pinnacle, the highlight of the season. But now it seems to be getting harder and harder for the England team to find genuine opposition. As soon as the final bell goes at the Gold Cup final all the top players bomb-burst out of the country. The best International of the season was (in my opinion) the one at Beaufort, vs Ireland. Lovely flowing polo and both sides hungry to win. Did safety improve this year? GAD: No, and it should be one of the areas which should be rallied around in 2016. It clearly needs greater attention. It improved at Guards, but why is polo still the only equestrian sport in the UK that doesn't require kite mark helmets. AE: Nope. Absolutely zero progress from 2014. Disappointing from the HPA and also from Casablanca and La Martina. They both make bold claims of safety in their helmets and yet neither brand even has a kite mark (thus blatantly flouting EU law) let alone any kind of safety certifications. They should be ashamed of themselves and players should vote with their wallets - but they won't. The marketing spiel is very convincing (but utterly hollow). Were the women's handicaps a success and is women's polo growing? GAD: Greater sponsorship and growing numbers of women playing and all-women tournaments did have an impact this year. The Telegraph 's reports and investigations into this area exposed weaknesses in the way the women's game is viewed. There was huge interest in these reports – and they caused waves through the sport. It is an aspect of polo in this country which needs the attention of the HPA, at a club ands country level. What was an advancement was that the UK finally caught up with Argentina and the USA by introducing it, and there are obvious teething problems while it gets sorted out but the system is successfully working in the countries that have run them for while and it helps the women gain recognition. AE: I'm still not convinced by women's handicaps, as I always enjoyed the fact that polo was equally handicapped for both sexes. However if it helps the women's game grow, and attracts more sponsors, then I applaud it. Women's polo is still largely ignored by the powers that be and certainly by both the media and brands. Are there any female polo-playing La Martina ambassadors in the UK? No. Female Guards ambassadors? No. Casablanca ambassadors? No. Female players, no matter how good they are, get passed by for any sponsorship deals. It's extremely unfair and disheartening. What of the restriction on ponies per chukka as raised by Anthony Fanshawe and John Horswell in Telegraph interviews? GAD: It might appear retroactive, but why not implement it at certain tournaments and experiment with a limit of one or two ponies per chukka at the top level? Three or more changes are excessive but at least one change per chukka is beneficial to the horses rather than running a tired pony. That's when injuries occur and pony welfare is the most important part of the game. There are lots of arguments that ponies should be fit enough to play an entire chukka - not everyone who plays polo can afford young ponies, and I have spoken to players with older ponies who have had previous injuries which are more than capable of playing if you look after them and don't put too much stress on them by only using them for half chukkas. There are several benefits in being able to change but makes it take away the spectacle in the high goal if the players barely stay on a horse for a minute. AE: I agree. If nothing else it would force a return of the open, passing polo of yesteryear - a type of polo that few people would argue was not better to watch and play. Any healthy pony can be got fit enough to play a whole chukka - and if it runs out of mouth or goes loopy - arguably it should be in a different sport. It would also help the less wealthy teams to compete. • Should more be made of Pieres' mesmeric goal? What should the HPA have learnt from this year? GAD: Not to underestimate the power of women in the sport; that greater marketing is needed for international events; that the sport is going through a growth spurt and it needs to be exploited. AE: The sport has changed so much - perhaps what they need to learn is to look at it with a fresh set of eyes. A start would be allowing said fresh eyes in. The same few people have formed the committee for a very, very long time and its seemingly impossible to get in. It ought to be a democratic process. How did Royal Salute fare in its first year as International day sponsors? GAD: Royal Salute brought a fresh, imaginative feel, but there is still the sense that International Day needs ramping up a level or two. But Royal Salute's sponsorship looks very promising for the future. AE: I've no idea, they didn't invite me! All I saw of their sponsorship was the write up in the gossip magazines. I'm sure they all had a lovely time and the enclosure looked very pretty. How did Jaeger-LeCoultre fare as title sponsors of the Gold Cup? GAD: As title sponsors of the Gold Cup, they brought a verve and a new feel to the tournament, and the relationship will only grow and become stronger in 2016 as they celebrate the 70th anniversary of their Reverso watch. RELIVE colour of polo's Gold Cup final day at Cowdray Park AE: I hope they were happy - in my mind its a perfect tie up - a brand with a long history in the sport involved with what I think is the most prestigious and important high goal tournament outside Argentina. Do the major days need greater marketing? GAD: As mentioned, International Day needs greater revival and drive, and the Test and International matches need greater fanfare and marketing. Overall, they need some of the magic brought back, where are all the trade stands, celebrities, and the big parties at the International and Queen's Cup. All the carriages from Royal Ascot used to come up to the Queen's Cup and park up along the sidelines and have lunch. Where are they now? Has International Day losts its aura? AE: The International does - but I don't know how the message can be got across - it's very difficult. Within polo, players don't want to go and watch because the feeling is that it will be England v \"whoever happens to be around\" - not a genuine battle to win. Greatest memory of the season ... GAD: The Jaeger-LeCoultre Gold Cup final, and the joy of Sir Charles Williams with Apes Hill getting to the semi-finals of the Gold Cup. AE: The International at Beaufort. Worst aspect of the season ... GAD: Lack of public interest in England's Tests, which were not coherent enough. AE: Slightly predictable which teams would make semi-finals of the high goal tournaments. What of Sotogrande extending its season for teams to prepare Jan-March? GAD: It will depends what the patrons want to make out of it but it's a good idea. Other professiomnals will get a chance to play as most of the high goal is in the US and Argentina at that time. Overall an interesting development, and it will be intriguing to see if there is a take-up from patrons playing in the English season. AE: Good for them. Nice for horses to be able to prepare in the sunshine - but will it make the season too long for them? What is the greatest thing we have learnt or needs changing after 2015? GAD: Polo needs to move forward not only in improving player safety head gear, but also greater education needed for those who play in terms of horse welfare such as saddle fitting, exercise programmes, feeding and so on. Most other equine sports are miles ahead in these respects. Most sports now make their money for the sport top down, and this is an area which needs greater expansion and marketing, and that lies at the door of the HPA. AE: I think the game needs a bit of a revamp - as Fanshawe and Horswell said the game has changed, not necessarily for the better. Fresh eyes needed. Safety is also still a huge issue. Telegraphsportpage Follow @telegraphsport", "external_links": [], "published": "2015-10-02T05:43:00.000+03:00", "crawled": "2015-10-03T16:04:37.938+03:00", "highlightTitle": ""}