{"organizations": [], "uuid": "9d9430a0994459bee6cafb3ae3468a5feed616c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newtondailynews.com", "main_image": "http://www.newtondailynews.com/images/avatar.png", "site_section": "http://www.newtondailynews.com/?rss=sports", "section_title": "NDN Sports", "url": "http://www.newtondailynews.com/2015/10/21/big-ten-coaches-upset-at-bashing-of-michigan-punter/a1ozq3k/", "country": "US", "title": "Big Ten coaches upset at bashing of Michigan punter", "performance_score": 0, "site": "newtondailynews.com", "participants_count": 0, "title_full": "Big Ten coaches upset at bashing of Michigan punter", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T19:05:00.000+03:00", "replies_count": 0, "uuid": "9d9430a0994459bee6cafb3ae3468a5feed616c2"}, "author": "", "url": "http://www.newtondailynews.com/2015/10/21/big-ten-coaches-upset-at-bashing-of-michigan-punter/a1ozq3k/", "ord_in_thread": 0, "title": "Big Ten coaches upset at bashing of Michigan punter", "locations": ["Michigan"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["LUKE"], "text": "Big Ten coaches upset at bashing of Michigan punter Published: Wednesday, Oct. 21, 2015 11:05 a.m. CDT By LUKE MEREDITH AP Sports Writer \nDES MOINES — Iowa coach Kirk Ferentz banned his players from Twitter once he realized the potential pitfalls of social media. \nSome of his Big Ten colleagues might start thinking that Ferentz is on to something. \nThe downside to social media again became apparent last weekend. Michigan athletic director Jim Hackett released an open letter on Sunday urging fans to avoid “thoughtless comments” following Michigan State’s last-play 27-23 win over the Wolverines. \nMuch of negative online chatter focused on Michigan punter Blake O’Neill, whose fumble led to the game-winning touchdown for the Spartans. \n“It’s very disappointing. But it’s the world we’re living in right now, too. People tend to attack other people via social media,” Spartans coach Mark Dantonio said. “It’s just one play. It should not define a person.” \nUnlike Ferentz, most Big Ten coaches have accepted social media as a fact of life for themselves and their players. \nNorthwestern coach Pat Fitzgerald is one of the more active Big Ten coaches on Twitter. \nBut Fitzgerald had some strong words for what the “haters” who took to their computers to bash O’Neill. \nFitzgerald said he uses social media to “spread the good news” about the Wildcats and interact with fans. Fitzgerald said dealing with “trolls” is part of his job. \n“I feel sorry for those people. I really do,” Fitzgerald said. “Every young man is trying to go out there and make a play and do what’s right. When that doesn’t go right, nobody feels worse than that young person. As a coach, that’s where you try and step in and give them everything you can and try to be supportive of them.”", "external_links": [], "published": "2015-10-21T19:05:00.000+03:00", "crawled": "2015-10-22T01:08:25.648+03:00", "highlightTitle": ""}