{"organizations": [], "uuid": "fe3e1a0041cfd7e110ac8d2e2b3a0dc4b2a9fe91", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailynews.com", "main_image": "http://www.dailynews.com/apps/pbcsi.dll/storyimage/LA/20151023/SPORTS/151029772/AR/0/AR-151029772.jpg?Maxh=1500&Maxw=1500", "site_section": "http://www.dailynews.com/sports", "section_title": "Los Angeles Sports News, Sports Scores: Los Angeles Daily News", "url": "http://www.dailynews.com/sports/20151023/terence-crawford-focused-on-dierry-jean-not-manny-pacquiao", "country": "US", "title": "Terence Crawford focused on Dierry Jean, not Manny Pacquiao", "performance_score": 0, "site": "dailynews.com", "participants_count": 1, "title_full": "Terence Crawford focused on Dierry Jean, not Manny Pacquiao", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "fe3e1a0041cfd7e110ac8d2e2b3a0dc4b2a9fe91"}, "author": "Robert Morales", "url": "http://www.dailynews.com/sports/20151023/terence-crawford-focused-on-dierry-jean-not-manny-pacquiao", "ord_in_thread": 0, "title": "Terence Crawford focused on Dierry Jean, not Manny Pacquiao", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Terence Crawford almost had no choice but to become a fighter.\n“It ran in my family and the owner of the boxing gym lived right behind me,” Crawford said.\nCrawford’s father, grandfather and uncles all boxed. They never turned pro. But the Nebraska native did, and he has become one of the top pound-for-pound fighters in the world.\nAnd one of the most talked about as well.\n“That means a lot,” Crawford said during a telephone conversation Thursday. “It means that people notice my talent and they’re following me.”\nThey’ll be watching in person, and on the tube, Saturday when Crawford (26-0, 18 KOs) defends his junior welterweight title against Dierry Jean (29-1, 20 KOs) of Canada from CenturyLink Center in Crawford’s hometown of Omaha (on HBO).\nHere’s the rub: If Crawford wins, there is a solid chance he will next fight Manny Pacquiao in what is expected to be Pacquiao’s final fight. It would put Crawford on the highest stage of his career, and he’d certainly earn his best payday.\nHowever, Jean can fight. Crawford knows it, too, so he promises he is focused on the task at hand.\n“I’m not worried about that (Pacquiao) fight right now,” Crawford said. “I’m more so worried about Dierry Jean.”\nCrawford was pushed about the possibility.\n“It would mean a lot, but right now I’m just focused on Jean,” he said.\nCrawford is adamant about this.\n“Dierry Jean is a good fighter,” he said. “I am not overlooking him. There is a lot at stake for both of us. One of the secrets to my success has been to never look past an opponent or train less than 110 percent for a fight.\n“It’s all about focus and keeping the blinders on. If you don’t respect the talents of the man in the opposite corner, then you’re asking for trouble.”\nSmart man.\nJean, no doubt, is licking his chops. He’s not expected to win, so he has nothing to lose.\n“I love being the underdog,” he said. “I’m always the underdog. I’m used to it. I’m going to show everyone that I’m the top man in the junior welterweight division. I’m going to shock the world. Everything is in my favor.”\nCrawford, 28, is also a former lightweight champion. He made his only two title defenses of that belt at Century Link Center, where his fans root him on with passion. Jean couldn’t care less about all that.\nAdvertisement\n“Fighting in Omaha will have no effect on me,” said Jean, 33, who was born in Haiti. “No pressure. I’m not over here to win over Crawford’s hometown fans. I’m here to beat their champion.”\nChances of that happening aren’t strong. Crawford is a terrific fighter, and it doesn’t sound like he’d be cool with losing on his turf.\n“I am so Omaha,” he said. “I wear it on my trunks, on my sleeve and in my heart.”\nGolovkin wants Cotto-Alvarez winner\nOn Nov. 21, what figures to be a tremendous fight will take place at Mandalay Bay in Las Vegas when Miguel Cotto (40-4, 33 KOs) of Puerto Rico defends his middleweight belt against Saul “Canelo” Alvarez (45-1-1, 32 KOs) of Mexico (on HBO pay-per-view).\nGennady Golovkin, who defended his middleweight championship when he stopped David Lemieux in the eighth round of their title-unification bout this past Saturday at Madison Square Garden, wants to fight the winner.\n“I want all the belts,” said Golovkin, who has knocked out 21 consecutive opponents. “Now I have two. The winner of Cotto-‘Canelo’ for sure will be next. I’m not sure who will win that fight, but I want to fight the winner next. I’m staying at 160 until I have all the belts.”\nGolovkin is trained by West Covina native Abel Sanchez in Big Bear.\nETC\nWe’re two weeks out from Timothy Bradley (32-1-1, 12 KOs) of Palm Springs defending his welterweight belt against Brandon Rios (33-2-1, 24 KOs) of Oxnard. They will square off Nov. 7 at Thomas & Mack Center in Las Vegas (on HBO). ... Also on that card, Vasyl Lomachenko (4-1, 2 KOs) of the Ukraine will defend his featherweight title when he takes on Romulo Koasicha Martinez (25-4, 15 KOs) of Mexico. ... Gary Russell Jr. (26-1, 15 KOs) of Washington D.C. will defend his featherweight belt against Oscar Escandon (24-2, 16 KOs) of Colombia at the Hard Rock Hotel & Casino in Las Vegas (on Showtime).\n Robert.Morales@presstelegram.com or follow Robert on Twitter: @RMoralesPT Robert Morales Back to top", "external_links": ["http://boxrec.com/boxer/447121", "http://boxrec.com/boxer/33535", "http://twitter.com/RMoralesPT", "http://boxrec.com/boxer/348759", "http://mn1-laweb.newscyclecloud.com/apps/pbcsi.dll/persbilde?Avis=LA&ID=504", "http://boxrec.com/boxer/378929", "http://widgets.outbrain.com/outbrain.js"], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-24T13:32:54.461+03:00", "highlightTitle": ""}