{"organizations": [], "uuid": "0070c8588af55c255b46f8f4488542351bb1f031", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sun-sentinel.com", "main_image": "http://www.trbimg.com/img-5623b13d/turbine/sfl-miami-heat-udonis-haslem-s101815", "site_section": "http://www.sun-sentinel.com/sports/florida-gators", "section_title": "Florida Gators Sports News | UF - Sun Sentinel", "url": "http://www.sun-sentinel.com/sports/miami-heat/sfl-miami-heat-udonis-haslem-s101815-story.html", "country": "US", "title": "Miami Heat forward Udonis Haslem gets stitches vs. Houston Rockets", "performance_score": 0, "site": "sun-sentinel.com", "participants_count": 1, "title_full": "Miami Heat forward Udonis Haslem gets stitches vs. Houston Rockets - Sun Sentinel", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T16:34:00.000+03:00", "replies_count": 0, "uuid": "0070c8588af55c255b46f8f4488542351bb1f031"}, "author": "Ira Winderman", "url": "http://www.sun-sentinel.com/sports/miami-heat/sfl-miami-heat-udonis-haslem-s101815-story.html", "ord_in_thread": 0, "title": "Miami Heat forward Udonis Haslem gets stitches vs. Houston Rockets", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "There is preseason precaution and then there is Haslem havoc. Clearly the two don't mix.\nAt a time when coaches are placing a priority on players' welfare, limiting minutes and even contact during the preseason, Udonis Haslem continues to operate at the only speed he knows.\nThe sum total: three stitches above his right eye and four stitches below his left eye.\n\"The first time I've had both eyes sewn,\" Haslem said matter of factly, as the Miami Heat's preseason schedule continued with a Sunday night game against the Atlanta Hawks at Philips Arena.\nIt started in Tuesday's exhibition loss to the Orlando Magic at the Amway Center, when Haslem required three stitches above his right eye amid his typical post-play mayhem.\nThen, during the third quarter of Saturday's 105-100 preseason victory over the Houston Rockets at the Toyota Center, Haslem was forced to the locker room for four stitches below his left eye after a rebound skirmish with Rockets forward Terrence Jones, a jolt so severe that it put Jones into the NBA's concussion protocol, after he initially was treated for a jaw issue.\nSpoelstra encouraged by Hassan Whiteside's return to starting lineup Erik Spoelstra saw an active Hassan Whiteside in the center's first game. He said it was a positive step forward.\nErik Spoelstra saw an active Hassan Whiteside in the center's first game. He said it was a positive step forward.\nSee more videos \"It was innocent,\" Haslem said. \"He was jumping up for the rebound and the ball was sitting on the rim for a while. It was one of those funny bounces. He was coming down when I was going up.\"\nFor Haslem it was an innocuous moment.\n\"It's part of the game,\" he said of being twice-sewn within a five-day period. \"I've given out stitches and I've got to get some sometimes.\n\"I'm not a baby. The problem I have is the guys who can't take it but want to give it out. I can take it and give it out. Sometimes, I've got to take it.\"\nAfter starting in place of Hassan Whiteside at the start of the preseason, Haslem played off the bench Saturday with Whiteside making his preseason debut. Minutes became available for Haslem with center Chris Andersen sidelined by an illness that kept him in the locker room in Houston during the game.\nWhiteside on his return, 0 for 9 free throws Hassan Whiteside is back in the mddle in the Heat starting lineup, but work remains.\nHassan Whiteside is back in the mddle in the Heat starting lineup, but work remains.\nSee more videos winderman@tribpub.com. Follow him at twitter.com/iraheatbeat or facebook.com/ira.winderman\n Houston Rockets Miami Heat Udonis Haslem Hassan Whiteside Terrence Jones NBA Amway Center", "external_links": ["http://www.trbimg.com/img-5623b13d/turbine/sfl-miami-heat-udonis-haslem-s101815", "http://www.trbimg.com/img-56231413/turbine/sfl-spoelstra-whiteside-s101715", "http://www.trbimg.com/img-562312d7/turbine/sfl-hassan-whiteside-return-s101715"], "published": "2015-10-18T16:34:00.000+03:00", "crawled": "2015-10-18T22:42:10.274+03:00", "highlightTitle": ""}