{"organizations": [], "uuid": "415e075a189cfa04589be292bde4b72844d182f3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.al.com", "main_image": "http://imgick.al.com/home/bama-media/width620/img/alabamafootball_impact/photo/18903131-standard.jpg", "site_section": "http://impact.al.com/alabama/atom.xml", "section_title": "Alabama Sports", "url": "http://www.al.com/alabamafootball/index.ssf/2015/10/grading_alabamas_38-10_win_ove.html", "country": "US", "title": "Grading Alabama's 38-10 win over Georgia, position-by-position", "performance_score": 0, "site": "al.com", "participants_count": 1, "title_full": "Grading Alabama's 38-10 win over Georgia, position-by-position", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T16:50:00.000+03:00", "replies_count": 0, "uuid": "415e075a189cfa04589be292bde4b72844d182f3"}, "author": "John Talty | jtalty@al.com", "url": "http://www.al.com/alabamafootball/index.ssf/2015/10/grading_alabamas_38-10_win_ove.html", "ord_in_thread": 0, "title": "Grading Alabama's 38-10 win over Georgia, position-by-position", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Grading Alabama's 38-10 win over Georgia, position-by-position fitzpatrick burgess.JPG Comments \nIt was Alabama's best performance of the year. \nThere was a lot for Nick Saban to smile about after Alabama's convincing 38-10 win against Georgia on the road at Sanford Stadium. Jake Coker was terrific, the defense capitalized on four Georgia turnovers and Alabama improved to 4-1 on the season. \nIn reviewing the Tide's fourth win of the season, AL.com grades the performance of each position group against the Bulldogs. \nQuarterbacks: A \nJake Coker did everything he was asked to do. The fifth-year transfer quarterback showed poise, confidence and good decision-making against a talented Georgia defense. His lone mistake came on a bobbled snap that led to a turnover, but it was already 38-3 at that point and it wasn't entirely his fault. He finally connected on a deep throw -- a 45-yard touchdown pass to Calvin Ridley -- and finished the game an efficient 11 of 16 for 190 yards, one passing touchdown, one rushing touchdown and no interceptions. It was easily Coker's best performance as an Alabama quarterback and it came at the perfect time against a tough opponent on the road. \nRunning backs: B+ \nDerrick Henry ran for a career-high 148 yards, but it was mostly overshadowed by the performances of Coker and the defense. He had an early fumble that, while a questionable call, gave Georgia the ball on Alabama's side of the feel. He rebounded nicely from the fumble, ran for a 30-yard touchdown and was yet again the engine that made Alabama's offense go. Kenyan Drake was again unable to get anything going in the more smash mouth style of the game, finishing with zero yards on six carries. The much-publicized debut of Bo Scarbrough didn't happen until late in the fourth quarter and resulted in five yards on two carries. \nReceivers: B+ \nIt was Calvin Ridley's coming out party Saturday. Everyone knows about the freshman's talent, but he finally showcased it in a big way against the Bulldogs. He finished with a team-best five catches for 120 yards and a touchdown. He had the big 45-yard touchdown catch and a 50-yard catch to really move the Alabama offense downfield. In Robert Foster's absence, Ridley has emerged as the primary deep-threat option. Richard Mullaney came up big on a few catches -- he's still a top option on third downs -- and finished with three catches for 44 yards. \nOffensive line: A- \nIt was a strong performance from a unit that hasn't always lived up to its reputation this year. The offensive unit sprung a few big holes for Henry, especially on that 30-yard touchdown run where he went untouched, and prevented a talented Georgia defense from getting pressure on Coker. The Bulldogs didn't have a sack or quarterback hurry on Saturday, and that gave the Alabama quarterback enough time and space to make the necessary throws. Ryan Kelly and Cam Robinson are the stalwarts on the line, but even Dominick Jackson, who has struggled this year, played well and made one crucial block on a Henry run. \nDefensive line: A+ \nThe defensive line did its job like it always does. It bottled up Nick Chubb for the majority of the game; it got pressure on Greyson Lambert and totally stymied one of the nation's most efficient scoring offenses. Jarran Reed was effective and impactful throughout the game, at one point making a terrific one-handed tackle and finishing with a team-high eight tackles. True freshman Daron Payne occupied multiple blockers at times and gave Georgia's offensive line all it could handle even if it doesn't show in the statistics. There aren't enough compliments to give this group week-after-week. \nLinebackers: B \nNick Saban harped on the defensive breakdown that resulted in Nick Chubb's 83-yard run multiple times in his postgame press conference. Alabama was switching between odd and even fronts, Saban said, and Reuben Foster went to the wrong gap assignment, which gave Chubb a free lane for the big run. It was the only major mishap from a unit that played well. Reggie Ragland led the team with eight tackles and made a nice play on Malcolm Mitchell to break up a pass. Shaun Dion Hamilton had a nice day of tackling, as well. \nSecondary: A+ \nIt was a standout performance from Alabama's young but talented group. Georgia went after Marlon Humphrey early in the game and it looked like it could be a problem for the Tide. However, Saban made an adjustment and put Cyrus Jones on Malcolm Mitchell and from there Georgia was unable to do much through the air. Lambert had completed 33 of his last 35 passes coming into the Alabama game, but finished 10 of 24 for 86 yards and an interception. Eddie Jackson had a big pick-six, Humphrey had an interception on perfect coverage late in the game and true freshman ball hawk Ronnie Harrison added another interception. Not only did the secondary create three turnovers, but it did a terrific job in coverage throughout the game and really limited what Georgia could do offensively. \nSpecial teams: A \nFor the second week in a row the special teams gets an \"A\" grade. Minkah Fitzpatrick was the star of the show for his blocked punt recovery for a touchdown. The play stunned the loud Sanford Stadium and gave Alabama a commanding 17-3 lead that it would never relinquish. Adam Griffith wasn't asked to do much, but he made his 29-yard field goal to give the Tide its first points of the game. J.K. Scott had two punts for more than 50 yards and punted very well given the awful weather circumstances.", "external_links": [], "published": "2015-10-05T16:50:00.000+03:00", "crawled": "2015-10-05T17:20:36.946+03:00", "highlightTitle": ""}