{"organizations": [], "uuid": "6af13df0dca116c9fb78ea7a0199ee219b088bee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "wtop.com", "main_image": "", "site_section": "http://wtop.com/section/sports/feed/", "section_title": "WTOP » Sections » Sports", "url": "http://wtop.com/mlb/2015/10/tulowitzki-back-in-blue-jays-lineup/", "country": "US", "title": "Tulowitzki back in Blue Jays lineup", "performance_score": 0, "site": "wtop.com", "participants_count": 1, "title_full": "Tulowitzki back in Blue Jays lineup", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T00:23:00.000+03:00", "replies_count": 0, "uuid": "6af13df0dca116c9fb78ea7a0199ee219b088bee"}, "author": "wtopstaff", "url": "http://wtop.com/mlb/2015/10/tulowitzki-back-in-blue-jays-lineup/", "ord_in_thread": 0, "title": "Tulowitzki back in Blue Jays lineup", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home » News » Sports » MLB » Tulowitzki back in Blue… Tulowitzki back in Blue Jays lineup By MARK DIDTLER October 2, 2015 5:23 pm \nST. PETERSBURG, Fla. (AP) — Troy Tulowitzki is back in the AL East champion Toronto Blue Jays’ lineup after missing three weeks due to injuries. \nTulowitzki hasn’t played since Sept. 12, when he cracked his scapula and bruised muscles in his upper back after colliding with teammate Kevin Pillar in a game against the New York Yankees. He is scheduled to bat seventh and play shortstop in Friday night’s game at Tampa Bay. \n“Excited to get back to playing,” he said. “Overall it’s good enough to play. It’s just like any time with an injury, probably that area is a little bit sore. To be able to swing felt good, so it tells me I’m ready.” \nBlue Jays manager John Gibbons said Tulowitzki will get Saturday off and then play in Sunday’s regular-season finale against the Rays. \n“The key is he feels fine,” Gibbons said. “Try to get some timing going now. It will definitely help him.” \nTulowitzki had a homer, two doubles and walked once in six plate appearances of a simulated game Friday against a pair of minor league pitchers. \nDavid Price, scheduled to pitch Game 1 of the AL Division series Thursday, also took part in the simulated game and struck out Tulowitzki on a called third strike and got a fly ball to center. \n“Obviously it was a bad call on the 0-2,” Tulowitzki said with a laugh. “We had fun with it.” \nToronto obtained Tulowitzki from Colorado on July 28 in a multi-player deal. He’s is hitting .232 with the Blue Jays, but they’re 30-8 with him in the starting lineup. \n“Let’s face it, we’re a better team with him out there,” Gibbons said. Topics:", "external_links": [], "published": "2015-10-03T00:23:00.000+03:00", "crawled": "2015-10-03T01:05:20.018+03:00", "highlightTitle": ""}