{"organizations": ["US Edition Former Everton", "Everton"], "uuid": "15be9ff787a7ef9997cb2cc4ef92f7c2aec341ea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.sky.com", "main_image": "http://media.skynews.com/media/images/generated/2015/10/17/424671/default/v1/gettyimages-72306363-1-1600x900.jpg", "site_section": "http://feeds.skynews.com/feeds/rss/sports.xml", "section_title": "Sports News - Latest Sports and Football News | Sky News", "url": "http://news.sky.com/story/1571282", "country": "IL", "title": "Former Everton Manager Howard Kendall Dies", "performance_score": 0, "site": "sky.com", "participants_count": 0, "title_full": "Former Everton Manager Howard Kendall Dies", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T15:29:00.000+03:00", "replies_count": 0, "uuid": "15be9ff787a7ef9997cb2cc4ef92f7c2aec341ea"}, "author": "", "url": "http://news.sky.com/story/1571282", "ord_in_thread": 0, "title": "Former Everton Manager Howard Kendall Dies", "locations": ["UK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Howard Kendall", "Kendall"], "text": "Switch to US Edition Former Everton Manager Howard Kendall Dies The club pays tribute to its most successful manager, who led them to league, FA Cup and European titles in the 1980s. 13:29, UK, Saturday 17 October 2015 Kendall with the First Division trophy in 1985 Former Everton manager Howard Kendall has died at the age of 69. \nEverton confirmed the news on Saturday morning and hailed him as their \"most successful manager\". \nIn a statement, the club announced: \"It is with great sadness that Everton Football Club has learned of the passing of Howard Kendall, the most successful manager in the history of the club and one of the greatest players to pull on the Everton jersey. \n\"He passed away in hospital in Southport this morning at the age of 69, surrounded by loved ones. \n\"The thoughts of everyone associated with the club are with Howard's family at this difficult time.\" \nGary Lineker, whom Kendall signed for Everton, tweeted: \"Saddened to hear that Howard Kendall has passed away. Brilliantly managed the best club side I ever played for at Everton. Great bloke.\" \nKendall won the title with the club as a player in 1969 as part of the famous 'Holy Trinity' along with Alan Ball and Colin Harvey, but undoubtedly his best achievements came when he returned to Goodison Park in 1981 as manager. \nKendall ended a 14-year trophy drought by winning the FA Cup in 1984, beating Watford 2-0 in the final, and reaching the League Cup final - then the Milk Cup - in which his team lost to Liverpool. \nThe following season Everton won the First Division title and the European Cup Winners' Cup, beating Rapid Vienna 3-1 in the final. \nKendall guided Everton to the First Division title again in 1986/87, but with English clubs banned from Europe, he chose to leave, moving to Athletic Bilbao. \nThe team he assembled in the 1980s made them a powerhouse of European football. \nKendall brought through the likes of Neville Southall, Kevin Ratcliffe, Derek Mountfield, Graeme Shape, Trevor Steven, Peter Reid and Kevin Sheedy, turning them into household names. \nHe bought well too, bringing in the likes of Andy Gray and Lineker who were hugely successful strikers for him. \nKendall, who started his managerial career at Blackburn Rovers, went on to take charge at Athletic Bilbao, Manchester City, Greek side Xanthi, Notts County, Sheffield United and another Greek side, Ethnikos Pireus, as well as two more spells with the Toffees. Promoted Stories", "external_links": [], "published": "2015-10-17T15:29:00.000+03:00", "crawled": "2015-10-17T22:30:52.150+03:00", "highlightTitle": ""}