{"organizations": [], "uuid": "bf35f5a63bfad20ff61a6eac74d7c05081abaa7f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266383/sports-outdoor-sports", "section_title": "Sports: Outdoor Sports - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30222846/bag-tags-provides-custom-tags-passes-lanyards-for-ironman-world-championship", "country": "US", "title": "Bag Tags Provides Custom Tags, Passes, Lanyards for IRONMAN World Championship", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Bag Tags Provides Custom Tags, Passes, Lanyards for IRONMAN World Championship - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T12:02:00.000+03:00", "replies_count": 0, "uuid": "bf35f5a63bfad20ff61a6eac74d7c05081abaa7f"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30222846/bag-tags-provides-custom-tags-passes-lanyards-for-ironman-world-championship", "ord_in_thread": 0, "title": "Bag Tags Provides Custom Tags, Passes, Lanyards for IRONMAN World Championship", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bag Tags will contribute custom bag tags, event passes, and lanyards for participants, staff, volunteers, and members of the media at the IRONMAN World Championship in Kailua-Kona, Hawaii, this Saturday, October 10.\nEvanston, IL (PRWEB) October 09, 2015\nBag Tags Inc. will provide custom bag tags, event passes, and lanyards for participants, volunteers, staff, and members of the media at the annual IRONMAN World Championship in Kailua-Kona, Hawaii, this Saturday, October 10. More than 2,000 athletes will participate in the 140.6 mile triathlon, which has taken place in Hawaii every year since 1978.\nAs part of its ongoing relationship with IRONMAN, Bag Tags Inc. will supply luggage tags for all of the athletes. Additionally, Woven Lanyards and Event Passes – companies in the Bag Tags family that focus on custom lanyards and custom access passes, respectively – will provide event badges and lanyards for the event staff, volunteers, and media. Bag Tags Inc. currently provides tags, passes, and lanyards for every IRONMAN event in the U.S.\n“It’s just a really great organization to work with,” said Sarah Kern, creative director for Bag Tags Inc. “There are quite a few people in our company who are very active and very athletic, so it’s something that we’re very interested in. One of our former employees has actually participated in IRONMAN.”\nThe IRONMAN World Championship is organized by the World Triathlon Corporation and combines the three most challenging endurance races in Hawaii: the 2.4-mile Waikiki Roughwater Swim, the 112-mile Around-O’ahu Bike Race, and the 26.2-mile Honolulu Marathon. Professional and amateur athletes qualify to participate in the championship by first competing in IRONMAN triathlon events throughout the world.\nBag Tags Inc. has designed the tags, passes, and lanyards to reflect the location of the championship race in Hawaii so that they can serve as keepsakes of the event. “Participants are reminded of the actual place where the IRONMAN race is,” Kern said.\nThe luggage tags and event passes have photo backgrounds, and the lanyards feature a sailboat and a yellow, Hawaiian floral design for the M in the IRONMAN logo. Bag Tags Inc. is currently exploring ways to expand its relationship with the IRONMAN, which is one of the world’s leading sports brands, with 180 events in more than 20 countries.\nBag Tags Inc. offers 48 hour turnaround in supplying high-quality bag tags to various sports teams, including USA Soccer and USA Swimming.\nAbout Bag Tags Inc.\nBag Tags, Inc. has been in business for more than 16 years. It is a family owned and managed company, and a direct manufacturer of custom bag tags, identification tags and event credentials. What started in the garage as a family business in 1998 has now grown into one of the premier event credential and custom luggage tag providers in the United States. For more information, visit http://www.bagtagsinc.com .\nAbout Woven Lanyards\nWoven Lanyards creates high-quality, custom lanyards for all types of occasions. With a talented design team and friendly sales staff, Woven Lanyards is dedicated to creating a one-of-a-kind product for any business. With clients ranging from sporting events to the corporate world, Woven Lanyards can give you the best custom lanyards to meet your needs. For more information, go to http://www.wovenlanyards.com .\nAbout Event Passes\nEvent Passes specializes in providing proper passes and badges for all types of events. With over 10 years of experience, Event Passes are proficient in creating top-of-the-line, custom passes designed to meet the needs of every client. The team at Event Passes will work to ensure your event has the perfect pass to not only look good, but keep your event secure. Learn more at http://www.eventpasses.com .\nAbout IRONMAN\nIRONMAN is a leading sports brand, with 180 events in over 20 countries. IRONMAN founder John Collins, a U.S. Naval commander, started the triathlon as a way to challenge athletes who had already mastered a local biathlon in Hawaii. The first IRONMAN challenge took place in Waikiki in February 1978. To learn more, visit http://www.ironman.com .\n //www.prweb.com/releases/2015/10/prweb13013450.htm\n ", "external_links": ["http://www.prweb.com/releases/2015/10/prweb13013450.htm"], "published": "2015-10-09T12:02:00.000+03:00", "crawled": "2015-10-09T11:29:04.545+03:00", "highlightTitle": ""}