{"organizations": [], "uuid": "451ed78da22cca028ea5441b00a3c4d1cced6012", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.medpagetoday.com", "main_image": "http://clf1.medpagetoday.com/assets/images/defaultLede.png", "site_section": "http://www.aasdn.org/feed/", "section_title": ":: American Academy of Sports Dietitians and Nutritionists ::", "url": "http://www.medpagetoday.com/special-reports/slipperyslope/54151", "country": "US", "title": "CME: Controversial Curricula Draw Fire Is this education, or promotion?", "performance_score": 0, "site": "medpagetoday.com", "participants_count": 1, "title_full": "CME: Controversial Curricula Draw Fire Is this education, or promotion?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T14:19:00.000+03:00", "replies_count": 0, "uuid": "451ed78da22cca028ea5441b00a3c4d1cced6012"}, "author": "admin", "url": "http://www.medpagetoday.com/special-reports/slipperyslope/54151", "ord_in_thread": 0, "title": "CME: Controversial Curricula Draw Fire Is this education, or promotion?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Reporter, Milwaukee Journal Sentinel/MedPage Today \nTestosterone therapy is not the only CME curriculum that has provoked criticism, including charges of disease mongering. \nFor instance, recent CME courses on obesity have been funded by companies that make potentially dangerous diet drugs. \nAnd a course on the use of low- and no-calorie sweeteners in weight loss is funded by the American Beverage Association, a trade group representing makers of soda and other non-alcoholic beverages. \nA recent flashpoint is hypoactive sexual desire disorder in women, which also has been the subject of drug company funded education courses for doctors. \nIn August, the U.S. Food and Drug Administration approved Addyi (flibanserin) , the first drug to treat the condition. \nEarlier in the year, several members of the FDA advisory committee voted against approval of the drug, which cannot be used with alcohol, has only modest effectiveness and several side effects, including the possibility of severe low blood pressure. \nAdriane Fugh-Berman, MD, an associate professor of family medicine at Georgetown University who was not on the advisory committee, called hypoactive sexual desire disorder an \"invented\" condition that was designed to sell drugs. \nFugh-Berman is director of PharmedOut , a Georgetown project that questions pharmaceutical marketing practices and encourages doctors to choose CME courses not funded by industry. She also has served as an expert for witness for attorneys who have filed lawsuits against drug companies over marketing practices. \nIn 2010, the year Addyi first came before the FDA for approval, 14 industry-funded courses on hypoactive sexual desire disorder were offered free-of-charge to doctors, according to a paper last year in the Journal of Medical Ethics that was co-authored by Fugh-Berman. \nThat effort was successful at increasing doctor acceptance of the condition, the paper said. \n\"Hypoactive sexual desire disorder is a typical example of the medicalization of a normal state,\" the paper concluded. \"The commercial practice of creating or expanding the market for a drug by convincing physicians and other prescribers that an 'unmet need' exists relies on industry-funded CME.\" \nThe condition is similar to low testosterone, or \"Low T,\" which has been used to market testosterone therapy to men, said Fugh-Berman. The courses promote disease awareness and sell more drugs. \n\"Industry funded CME always sells the disease,\" she said. \"In some cases, those diseases are invented, like Low T.\"", "external_links": [], "published": "2015-10-22T14:19:00.000+03:00", "crawled": "2015-10-22T14:56:01.013+03:00", "highlightTitle": ""}