{"organizations": [], "uuid": "7a6704fe56565a12fd162ad6e83322860967e37c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usatoday.com", "main_image": "http://www.gannett-cdn.com/-mm-/dcb439d21b0b40d0fbd8f49ba673fbf3eec44ae6/c=114-85-2229-1280&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/13/USATODAY/USATODAY/635803257829490962-sw20-fantasy-1014-2015.jpg", "site_section": "http://www.usatoday.com/sports/", "section_title": "USA Today | Sports", "url": "http://www.usatoday.com/story/sports/fantasy/2015/10/13/quarterbacks-giving-fantasy-owners-fits/73859228/", "country": "US", "title": "Quarterbacks giving fantasy owners fits", "performance_score": 0, "site": "usatoday.com", "participants_count": 0, "title_full": "Quarterbacks giving fantasy owners fits", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T17:41:00.000+03:00", "replies_count": 0, "uuid": "7a6704fe56565a12fd162ad6e83322860967e37c"}, "author": "", "url": "http://www.usatoday.com/story/sports/fantasy/2015/10/13/quarterbacks-giving-fantasy-owners-fits/73859228/", "ord_in_thread": 0, "title": "Quarterbacks giving fantasy owners fits", "locations": ["USA"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Reinhold Matay", "Blake Bortles"], "text": "Blake Bortles comes off his best outing as a pro, passing for 303 yards and four touchdowns. (Photo: Reinhold Matay, USA TODAY Sports)\n3 CONNECT 17 TWEET LINKEDIN COMMENT EMAIL MORE There has been an amazing amount of upheaval among the quarterback ranks — and we are only about one-third of the way into the fantasy season.\nLook at the positional leaders, and you’ll see a fair amount of surprises. Better yet, compare those to your predraft rankings. Staying one step ahead is tough when the league seems to remake itself weekly.\nNot a quarterback-driven league\nMost fantasy leaguers don’t rush to draft a quarterback despite their occasional flashy big games. If the first five weeks mean anything, it could be middraft in 2016 before any are selected. The top fantasy quarterbacks are Andy Dalton, Aaron Rodgers, Tyrod Taylor, Tom Brady, Carson Palmer and Blake Bortles.\nYes, Blake Bortles (1,299 passing yards, 10 touchdowns).\nOut of that top group, only Rodgers and possibly Brady were drafted as starters. The top quarterbacks in Week 5 included Josh McCown, Bortles, Joe Flacco, Taylor and Brian Hoyer.\nThere is little “per game” difference in the overall top 10 quarterbacks. If you want any advantage at the position, hold at least two if not three viable options and then play matchups each week. If there is one thing that daily fantasy teaches, it’s that sticking with the same starting lineup rarely results in an optimal weekly score — even with quarterbacks.\nChief concern\nSunday dished up the normal set of injuries but none more devastating than Jamaal Charles’ anterior cruciate ligament tear. He represented more than 30% of the Kansas City Chiefs offense, and his absence impacts everyone. But the immediate dash to the waiver wire is less clear, because he will be replaced by two players.\nFor the last two seasons, Knile Davis was Charles’ primary backup. He even produced two 100-yard games and scored seven times last season. But undrafted Charcandrick West played his way to being the No. 2 this year. West was the primary backup for the last two games, and he ran for 31 yards on seven carries after Charles was injured. Coach Andy Reid said West and Davis would play and declined to name a primary back.\nHowever, West already had overtaken Davis on the depth chart. That makes him probably the first player taken on waivers this week. Don’t expect Davis to lose all value, though. Both backs need to be owned to see who produces the most.\nDavis brings more experience and has performed well in the past. Neither will be a clone of Charles, but finding a new starting running back this deep into the season can be a major difference-maker. The immediate schedule sends the Chiefs on the road to play the Minnesota Vikings and then back home to take on the Pittsburgh Steelers and Detroit Lions before reaching their Week 9 bye.\nTHEHUDDLE\nJoin The Huddle - Fantasy Football Advice, News & Draft Tools\nTight end troubles\nEven a purist would have to admit that there is a dearth of tight end production this year. Rob Gronkowski is essentially a huge wide receiver. Tyler Eifert and Gary Barnidge, the poster boy for “Life starts at 30,” have provided consistent points.\nBut players such as Jordan Reed, Travis Kelce, Jason Witten, Martellus Bennett and Greg Olsen have offered up marginal stats punctuated by one or two good games. After Gronkowski and Eifert, the difference in scoring per game for the next 10 tight ends is only around four points per game.\nIt isn’t just that the tight ends have been tightly grouped. They also have been highly inconsistent and low-scoring.\nOf the eight tight ends with a touchdown in Week 5, only Barnidge, Eifert and Larry Donnell were likely to have been fantasy starters. Derek Carrier, Ben Watson, Garrett Celek, Darren Fells and Brent Celek also scored, while averaging three catches for 30 yards on the day. None had more than 44 yards. Aside from the top three, this is a position that makes kickers look like paragons of consistency.\nWaiver-wire options\nQB Josh McCown, Cleveland Browns. He just became the first Browns quarterback to throw for 300 yards in three consecutive games. He also just broke a 34-year-old team record by passing for 457 yards. But realize he did that against the Oakland Raiders, San Diego Chargers and Baltimore Ravens. The next three opponents have top-five pass defenses. He’s worth owning for later in the year.\nQB Blake Bortles, Jacksonville Jaguars. He comes off a 303-yard, four-touchdown effort at the Tampa Bay Buccaneers, but Bortles had not topped two scores in previous games. He topped 300 yards once as a rookie, and this was his first time he tossed more than two scores in game.\nUSA TODAY FANTASY SPORTS\nUSA Today Fantasy Sports\nQB Brian Hoyer, Houston Texans. Playing with DeAndre Hopkins alone makes him worth owning. Hoyer faces the Jaguars, Miami Dolphins and Tennessee Titans next up with a chance to cement his role as the starter.\nQB Matt Cassel, Dallas Cowboys. Brandon Weeden has thrown one touchdown pass this year and is unable to move the injury-ravaged offense, so the Cowboys might be ready to look elsewhere. Coach Jason Garrett indicated he would consider a change after a Week 6 bye.\nIf Cassel is promoted, he’s unlikely to merit much fantasy consideration. The return of Dez Bryant would be a major boost, but Cassel couldn’t even win a roster spot with the Buffalo Bills this summer. He’s a placeholder for Tony Romo and not worth a fantasy roster spot.\nQB Matthew Stafford, Detroit Lions. Stafford was benched in the third quarter after throwing three interceptions. His recent stats have taken a significant downturn, but that’s not as bad as it might seem. Stafford spent the last three weeks facing the Denver Broncos, Seattle Seahawks and Arizona Cardinals. Those are the Nos. 1, 2 and 5 defenses vs. quarterbacks.\nWR Marquess Wilson, Chicago Bears. Thanks to injuries to Eddie Royal and Alshon Jeffery, Wilson started the last two weeks and produced 12 catches for 165 yards and a touchdown. He’ll drop back when the starters return but is worth it for fantasy depth because Royal and Jeffery are having durability issues.\nWR Willie Snead, New Orleans Saints. Marques Colston is in decline and injured his shoulder. Snead followed up his six-catch, 89-yard effort in Week 4 with six receptions for 141 yards. Notable, too, is that the Saints’ schedule over the next four weeks includes home games vs. the Atlanta Falcons, New York Giants and Titans, plus a game at the Indianapolis Colts.\n3 CONNECT 17 TWEET LINKEDIN COMMENT EMAIL MORE TOP VIDEOS", "external_links": ["https://twitter.com/intent/tweet?url=http%3A//usat.ly/1REBVYZ&text=Quarterbacks%20giving%20fantasy%20owners%20fits&via=usatoday", "http://www.linkedin.com/shareArticle?url=http%3A//usat.ly/1REBVYZ&mini=true", "http://www.gannett-cdn.com/-mm-/5180888989bc52a048728c86c4de46c7e789b9c2/r=500x330/local/-/media/2015/10/13/USATODAY/USATODAY/635803257829490962-sw20-fantasy-1014-2015.jpg", "http://www.gannett-cdn.com/media/2015/10/13/USATODAY/USATODAY/635803257829490962-sw20-fantasy-1014-2015.jpg", "http://www.gannett-cdn.com/-mm-/b527f6818393ab315b43108981e1df333ed58dae/r=300/http/0.gravatar.com/blavatar/2566522c266b390142ea3489c27f5e99?s=200&ts=1444515758", "http://www.gannett-cdn.com/-mm-/a60a07d95bc1b5af94c6e091d4c84251884e908f/c=0-70-2350-1837&r=x404&c=534x401/local/-/media/2015/10/13/USATODAY/USATODAY/635803257829490962-sw20-fantasy-1014-2015.jpg", "http://www.thehuddle.com/site/join.php"], "published": "2015-10-13T17:41:00.000+03:00", "crawled": "2015-10-13T19:47:00.436+03:00", "highlightTitle": ""}