{"organizations": [], "uuid": "aaf1f14c613373669d812315b497fc53994a58b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mercurynews.com", "main_image": "http://extras.mnginteractive.com/live/media/site568/2015/1019/20151019_075832_SJSU.11.RKH.102903.jpg", "site_section": "http://feeds.mercurynews.com/mngi/rss/CustomRssServlet/568/200795.xml", "section_title": "College Sports", "url": "http://www.mercurynews.com/college-sports/ci_28992751/san-jose-state-water-polo-player-was-warming?source=rss", "country": "IL", "title": "San Jose State water polo player was warming up with his club team before tragic death", "performance_score": 0, "site": "mercurynews.com", "participants_count": 1, "title_full": "San Jose State water polo player was warming up with his club team before tragic death", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T19:16:00.000+03:00", "replies_count": 0, "uuid": "aaf1f14c613373669d812315b497fc53994a58b4"}, "author": "Joe Rodriguez and Mark Gomez, Staff writers", "url": "http://www.mercurynews.com/college-sports/ci_28992751/san-jose-state-water-polo-player-was-warming?source=rss", "ord_in_thread": 0, "title": "San Jose State water polo player was warming up with his club team before tragic death", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "San Jose State student dies several days after water polo practice at campus pool \nStaff writers SAN JOSE--A San Jose State student who died a few days after a water polo practice was warming up with the club team when his teammates noticed he was submerged, a university spokeswoman said Monday. \nTeammates of Ryan Harryman pulled the unconscious 24-year-old senior and anthropology major from the pool Oct. 12 at the campus aquatics center, according to SJSU spokeswoman Patricia Harris. He was removed from life support a few days later on Saturday night at San Jose Regional Medical Center. Harryman was a member of the San Jose State Men's Water Polo Club, which is separate from the university's intercollegiate water polo team. \nHarris said Harryman probably was swimming laps with other water polo players shortly after 6 p.m. He did not hit his head by falling on the deck or diving into the pool, she said. \nHarris said campus lifeguards applied a cardiopulmonary resuscitation procedure and an automated external defibrillator, or AED, a medical emergency device. The lifeguards were followed by university police officers and emergency medical technicians, who transported him to Regional Medical Center. Members of the Sunnyvale-based Harryman family were at his side when he died. \nHis brother, William Harryman, described Ryan over the weekend as an engaging and multitalented young man who also enjoyed writing, music and delivering comedy sketches live and on film. A competitive swimmer since age 4, Harryman also had played water polo for Homestead High School in Cupertino. Advertisement \nThe Santa Clara County Medical Examiner's Office said its report on the cause of death would not be available until Tuesday at﻿ the earliest. Harris said a memorial service for Harryman could be announced the same day. Follow Joe Rodriguez at Twitter.com/joerodmercury .", "external_links": [], "published": "2015-10-20T19:16:00.000+03:00", "crawled": "2015-10-21T09:28:21.189+03:00", "highlightTitle": ""}