{"organizations": [], "uuid": "8381bf6023f2a84f827723ab5adf9d7f40959a51", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.miamiherald.com", "main_image": "http://www.miamiherald.com/news/politics-government/state-politics/ddmmao/picture38413074/ALTERNATES/LANDSCAPE_1140/IMG_Florida_Capitol_2015_2_1_DU540U2O_L135600331%20(2)", "site_section": "http://www.miamiherald.com/?widgetName=rssfeed&widgetContentId=712015&getXmlFeed=true", "section_title": "Breaking News, Sports, Weather & More | MiamiHerald.com &", "url": "http://www.miamiherald.com/news/politics-government/state-politics/article38398038.html", "country": "US", "title": "Judge rejects House, Senate redistricting maps, recommends challengers’ plan", "performance_score": 0, "site": "miamiherald.com", "participants_count": 1, "title_full": "Judge rejects House, Senate redistricting maps, recommends challengers’ plan", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T22:18:00.000+03:00", "replies_count": 0, "uuid": "8381bf6023f2a84f827723ab5adf9d7f40959a51"}, "author": "Mary Ellen Klas \nHerald/Times Tallahassee Bureau", "url": "http://www.miamiherald.com/news/politics-government/state-politics/article38398038.html", "ord_in_thread": 0, "title": "Judge rejects House, Senate redistricting maps, recommends challengers’ plan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Judge rejects House, Senate redistricting maps, recommends challengers’ plan \nJudge: The challengers’ map ‘best complies with the directions’ of the Florida Supreme Court \nThe Florida Supreme Court will review Circuit Court Judge Terry Lewis’ recommendation \nSouth Florida districts will see changes if map is adopted A Circuit Court judge is recommending the Florida Supreme Court approve congressional redistricting maps proposed by a group of challengers, rejecting those suggested by the Florida’s Republican-led House and Senate. SCOTT KEELER Tampa Bay Times i Order Reprint of this Story TALLAHASSEE \nCircuit Court Judge Terry Lewis on Friday rejected the Florida Legislature’s third attempt at redrawing its congressional districts and recommended a map proposed by the challengers — including a redrawn configuration of two Miami districts — to the Florida Supreme Court for its final review. \nLewis adopted the bulk of the map approved by lawmakers in the northern and central portions of the state but specifically rejected the proposed boundaries for District 26 in Miami, now held by Republican Congressman Carlos Curbelo. \nThe challengers, a coalition of League of Women Voters and Common Cause of Florida and a group of Democrat-leaning individuals, agreed with the Legislature’s configuration of 20 of the 27 districts proposed in a staff-drawn base map but asked the court to adopt their changes to the remaining districts. Lewis agreed. \n“The Legislature has thus not met its burden of justifying the proposed versions of Districts 20 through 27,” he wrote in a 19-page ruling. He said that a map drawn by the challengers “best complies with the directions” set out by the Florida Supreme Court in July and “I therefore recommend its adoption.” \nIn its July 9 ruling, the Supreme Court ordered the Legislature to keep the City of Homestead whole and the legislature’s solution was to create a district that performed better for Republicans by removing the black communities of Richmond Heights, Palmetto Estates and West Perrine into the neighboring District 27, now held by Republican Rep. Ileana Ros-Lehtinen. \nThe House and Senate argued that the only way to avoid reducing the ability of Hispanics from electing their own candidate is to leave the district more Republican-leaning as they have proposed. Their argument: The district is leaning Democratic and Democrats won’t elect an Hispanic. \nBut Lewis rejected that argument, noting that “Hispanics have consistently elected the candidate of their choice” in the region and rejected Florida International University Professor Dario Moreno’s testimony that the district as proposed by the challengers will “lock out” Hispanic voters. \n“Professor Moreno, who no doubt has a good bit of knowledge and expertise about elections in South Florida, testified to his concerns that the CP-1 configuration would diminish the ability of Hispanics to elect a candidate of their choice,” he wrote. “His testimony was long on pure opinion based on experience and short on systematic, scientific analysis of accepted statistical data.” \nLawmakers were handed an unprecedented set of directives in July when the Florida Supreme Court ruled that the congressional boundaries used in the 2012 and 2014 elections were invalid because lawmakers had allowed improper interference by political operatives and created congressional districts that illegally favored incumbents and political parties. The court gave them specific guidelines for redrawing eight districts and ordered Lewis to review their work and make a recommendation by Oct. 17. \nWhen lawmakers tried and failed to resolve their differences in an August special session, the court threw it back to Lewis, who had been supervising the case that has cost taxpayers more than $8 million for the last 3 1/2 years. \nThe map as recommended by Lewis leaves three sitting members of Congress in a precarious re-election situation. The district now held by U.S. Rep. David Jolly, a Republican from St. Petersburg, will become significantly more Democratic. Jolly has announced he will not seek re-election but will run for the Republican nomination for U.S. Senate. \nU.S. Rep. Gwen Graham, a Democrat from Tallahassee, will also see her current District 2 become significantly more Republican while her home base will become part of the newly drawn minority majority District 5, currently held by U.S. Rep. Corrine Brown, D-Jacksonville. \nIn Central Florida, the changes will be the most significant, as the court ordered the legislature to move the minority majority district out of the region and into North Florida. That configuration had allowed lawmakers to pack Democrats into that district and strengthen neighboring Republican districts. \nThe new configuration approved by Lewis dismantles the current District 10 held by U.S. Rep. Dan Webster, R-Winter Garden, and creates an Hispanic, Democrat-dominated seat that Webster acknowledges he could not win in. Webster, however, has said he will challenge the configuration and is campaigning to become speaker of the U.S. House of Representatives. \nThe recommended map keeps Hendry County whole, too, and keeps District 20 an African-American majority-minority district that stretches into Miramar, now held by Democratic U.S. Rep. Alcee Hastings. It also differs from the legislature’s maps by not splitting six cities in Districts 20 and 21, held by Democratic U.S. Reps. Ted Deutch and Lois Frankel. \nMary Ellen Klas: 850-222-3095 , meklas@miamiherald.com , @MaryEllenKlas Related content", "external_links": [], "published": "2015-10-09T22:18:00.000+03:00", "crawled": "2015-10-09T23:26:35.959+03:00", "highlightTitle": ""}