{"organizations": ["Treveon Graham Utah Jazz", "Bryce Cotton"], "uuid": "029ad738623aea36f67f61a35140f4d74e777bf1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ksl.com", "main_image": "http://img.ksl.com/slc/2573/257381/25738166.jpg", "site_section": "http://ksl.com//xml/294.rss", "section_title": "KSL / Sports Home / Local", "url": "http://www.ksl.com/?sid=37030011&nid=294&s_cid=rss-extlink", "country": "US", "title": "Utah Jazz waive Bryce Cotton and Treveon Graham", "performance_score": 0, "site": "ksl.com", "participants_count": 0, "title_full": "Utah Jazz waive Bryce Cotton and Treveon Graham", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T22:49:00.000+03:00", "replies_count": 0, "uuid": "029ad738623aea36f67f61a35140f4d74e777bf1"}, "author": "", "url": "http://www.ksl.com/?sid=37030011&nid=294&s_cid=rss-extlink", "ord_in_thread": 0, "title": "Utah Jazz waive Bryce Cotton and Treveon Graham", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Treveon Graham", "Bryce Cotton", "Andy Larsen"], "text": "Utah Jazz waive Bryce Cotton and Treveon Graham By Andy Larsen | Posted Oct 20th, 2015 @ 1:49pm  1 photo  \nSALT LAKE CITY — The Utah Jazz waived Bryce Cotton and Treveon Graham Tuesday, bringing the roster to the regular-season maximum of 15 players. \nGraham wasn't a surprise. He was brought in with a small guaranteed amount, always with the notion that he would likely be headed to the Idaho Stampede. However, with his look lasting as long as it did, outlasting J.J. O'Brien and Jack Cooley, was a promising sign for the wing player. He performed well in the Spurs' summer league team before signing with the Jazz, also promising for his eventual D-League performance in Idaho. The Jazz are making efforts to ensure that Idaho isn't the worst team in the D-League again. \nCotton's cut, though, is news. After all, the move leaves the Jazz with just two healthy point guards, traditionally, they've favored having three on the roster. \nBut Cotton just played so poorly during summer league and preseason that the Jazz didn't feel his upside warranted a roster spot. In his two of eight preseason games, Cotton shot just 4 of 19 (21 percent). In eight preseason games, he shot just 35 percent from the field. Cotton's accurate shooting, in theory, was his ticket to the NBA. He's not going to be an above-average passer or defender, but when he shoots that poorly, there just aren't any reasons to keep him on an NBA roster. \nThat decision was also made easier by the Jazz's success with the triple-wing lineups where the team alternates who brings up the ball among three or four wing players on the court. Those lineups have been good both offensively and defensively so far, and so the Jazz aren't worried about giving those lineups more minutes. In fact, they'd like to emphasize it as much as possible. \nThe Jazz could go forward with these 15, and it seems likely that they will. I asked Utah head coach Quin Snyder if Elijah Millsap and Chris Johnson were likely to make the opening-day roster now, and while he wouldn't commit to this being the final 15 by next week, he hinted at it positively. \n\"Without making a affirmative statement,\" Snyder started, \"if you look at the numbers that we have on our team, you could probably deduce that.\" \nRemember, last season, the Jazz signed two players off of waivers after training camp, one of them was Joe Ingles, who ended up playing a major role. I think the Jazz are very likely to stick with this 15 by Oct. 28, unless someone they really, really like comes available. Notably, I think it's very unlikely that the Jazz go into the season with fewer than 15 players. With their nonguaranteed contracts, they have the flexibility to make whatever pickups as necessary by cutting someone. Photos", "external_links": [], "published": "2015-10-20T22:49:00.000+03:00", "crawled": "2015-10-21T01:57:37.208+03:00", "highlightTitle": ""}