{"organizations": ["ASSOCIATED PRESS Michigan State"], "uuid": "e2f8a254c09c09cba50b374a0103c4ce7892d12b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.northjersey.com", "main_image": "http://www.northjersey.com:80/polopoly_fs/1.1435390!/fileImage/httpImage/101815-s-msu70p.jpg", "site_section": "http://www.northjersey.com/cmlink/sports-rss.rss", "section_title": "Sports News on NorthJersey.com", "url": "http://www.northjersey.com/sports/college-sports/college-football/michigan-state-gets-wild-win-1.1435389", "country": "US", "title": "Big Ten roundup: Michigan State escapes with wild win", "performance_score": 0, "site": "northjersey.com", "participants_count": 0, "title_full": "Big Ten roundup: Michigan State escapes with wild win", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T08:21:00.000+03:00", "replies_count": 0, "uuid": "e2f8a254c09c09cba50b374a0103c4ce7892d12b"}, "author": "", "url": "http://www.northjersey.com/sports/college-sports/college-football/michigan-state-gets-wild-win-1.1435389", "ord_in_thread": 0, "title": "Big Ten roundup: Michigan State escapes with wild win", "locations": ["Michigan"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ASSOCIATED PRESS Michigan State’s Jalen Watts-Jackson (20) scored the winning TD on the final play. \nAfter the snap was flubbed on a punt attempt and the ball went flying as the final seconds ticked down, Jalen Watts-Jackson found himself in perfect position to make an unforgettable play. \nWatts-Jackson grabbed it and raced 38 yards into the end zone for a touchdown on the final play of the game, giving the seventh-ranked Spartans a shocking 27-23 win over No. 12 Michigan in one of college football’s most unlikely endings. \n\"Football is a crazy, crazy game,\" Spartans coach Mark Dantonio said. \"You can’t hardly explain it.\" \nWith the Wolverines ahead 23-21 and 10 seconds left in Ann Arbor, Mich., Michigan punter Blake O’Neill bobbled a low snap, and spun around to try and make the kick. But he was hit, the ball popped free, Watts-Jackson caught it, avoided a few defenders in the final yards and made it into the end zone. \n\"A mistake was made,\" Michigan coach Jim Harbaugh said somberly. \"Mistakes were made. It’s very unfortunate circumstances.\" \nWatts-Jackson hurt his hip after the winning score, was carted off the field and Dantonio said he was taken to a hospital. \nMichigan State (7-0, 3-0 Big Ten) has won seven of eight in the series, its best stretch in more than a half-century. Michigan (5-2, 2-1) lost for the first time since opening the season with a setback at Utah. \nThe Wolverines were seconds away from sealing the win after Sione Houma ran for two TDs, Kenny Allen kicked three field goals and forcing the Spartans to turn the ball over on downs with 1:47 left at its 45. \nNo. 17 IOWA 40, No. 20 Northwestern 10 (at Evanston, Ill.) — Reserve running back Akrum Wadley ran for 192 yards and tied a school record with four rushing touchdowns to carry Iowa (7-0, 3-0 Big Ten). \nNEBRASKA 48, MINNESOTA 25 (at Minneapolis) — Tommy Armstrong Jr. bounced back from a pair of bad performances, passing for 261 yards and three touchdowns for Nebraska (3-4, 1-2). \nWISCONSIN 24, PURDUE 7 (at Madison, Wisc.) — Alec Ingold ran for two short scores, Joel Stave threw for 322 yards and Wisconsin’s stifling defense held Purdue to a season-low 191 yards.  ", "external_links": [], "published": "2015-10-18T08:21:00.000+03:00", "crawled": "2015-10-18T15:14:53.896+03:00", "highlightTitle": ""}