{"organizations": [], "uuid": "88d9bbc97f9b9fb0961e0cc13d07c09f6bce9110", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.13abc.com", "main_image": "http://media.graytvinc.com/images/560*315/14180.jpg", "site_section": "http://www.13abc.com/", "section_title": "Toledo, Ohio | News, Weather, &amp; Sports | 13abc", "url": "http://www.13abc.com/home/headlines/Drabik-Collins-gets-TPPA-nod-332537892.html", "country": "US", "title": "Drabik-Collins gets TPPA nod", "performance_score": 0, "site": "13abc.com", "participants_count": 1, "title_full": "Drabik-Collins gets TPPA nod", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "88d9bbc97f9b9fb0961e0cc13d07c09f6bce9110"}, "author": "13abc", "url": "http://www.13abc.com/home/headlines/Drabik-Collins-gets-TPPA-nod-332537892.html", "ord_in_thread": 0, "title": "Drabik-Collins gets TPPA nod", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Toledo (13abc, Action News) - The Toledo Police Patrolman's Association is backing indepenent candidate Sandy Drabik Collins in the race for mayor.\nThat union endorsed her husband D. Michael Collins in 2013 and he won before dieing in office 13 months later.\nTuesday, the 500-member union endorsed his wife.\nUnion president Dan Wagner said it simply, \"It was a pretty easy decision for us.\"\nStanding outside police union headquarters, the union president is encouraging his members to back Sandy Collins.\nWagner said, \"She's got the experience to get the job done, the vision is there and Toledo will be safer with her as mayor.\"\nTwo years ago, the union backed Sandy's husband Mike Collins-- who was a long- time police officer and union president himself.\n\"I just consider it a great honor.\"\nSandy Collins has administrative experience, promises to hire 40-officers each year and is committed to a force that's 70 officers bigger than it is now.\nThat's why the union likes her.\nCollins was humbled by the endorsement, saying, \"I want to earn it on my own with my own experience and I am pleased that they looked at that.\"\nBbut the TPPA also looked at the field of candidates and no doubt had issues with the three other current or former mayors in the race.\nIn 2009, Carty Finkbeiner laid off 75 officers.\nIn 2011, Mike Bell supported an effort to restrict public unions' bargaining power and he imposed concessions on union contracts.\nAnd this year, mayor Paula Hicks-Hudson has refused to replace fire chief Luis Santiago, who suffered a vote of no confidence by the firefighters.\nWhich leaves the familiar Sandy Collins...\nSaid Wagner, \"Sandy is carrying that vision in trying to bring back safety to the city.\"\nSso the choice was easy and somewhat expected.\nNow, Collins will get money and volunteers and literature from police union members who will work hard to get her elected.\nTomorrow night, the fire union will endorse a candidate.\nTypically, fire and police back the same candidate and, for all the reasons we just outlined, that's not likely to change.", "external_links": ["http://media.graytvinc.com/images/14180.jpg", "http://media.graytvinc.com/images/299*168/14180.jpg"], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-14T00:12:20.551+03:00", "highlightTitle": ""}