{"organizations": ["Mountain Lakes"], "uuid": "7af38953c0c7ae0e864267bee9f67f71e8b3e79c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.northjersey.com", "main_image": "http://www.northjersey.com:80/polopoly_fs/1.1441230!/fileImage/httpImage/102515-st-pqmtn4.jpg", "site_section": "http://www.northjersey.com/cmlink/high-school-sports-rss.rss", "section_title": "High School Sports on NorthJersey.com", "url": "http://www.northjersey.com/sports/high-school-sports/field-hockey/panthers-hold-on-to-beat-mountain-lakes-1.1441229", "country": "US", "title": "Field Hockey: Pequannock holds on to beat Mountain Lakes", "performance_score": 0, "site": "northjersey.com", "participants_count": 0, "title_full": "Field Hockey: Pequannock holds on to beat Mountain Lakes", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T06:15:00.000+02:00", "replies_count": 0, "uuid": "7af38953c0c7ae0e864267bee9f67f71e8b3e79c"}, "author": "", "url": "http://www.northjersey.com/sports/high-school-sports/field-hockey/panthers-hold-on-to-beat-mountain-lakes-1.1441229", "ord_in_thread": 0, "title": "Field Hockey: Pequannock holds on to beat Mountain Lakes", "locations": ["Pequannock"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Julia Blahut", "Joe Sarno Pequannock"], "text": "Staff photo by Joe Sarno Pequannock's Julia Blahut battles with a Mountain Lakes player for possession on Tuesday night. \nThat's what it came down to for the Pequannock Golden Panthers Tuesday night in Mountain Lakes against the Lakers following a Lakers timeout. \nComing out of the second half timeout holding a 2-1 advantage, Golden Panthers head coach Diane Bolchune said she told her team \"just to keep themselves together, collect themselves, like I said, slow the game down.\" \n\"Again, we were up so I wanted to keep it out of our defensive circle and keep it up on our end, even if we were just clearing it up the field, just get it out, just move it up and slow down,\" she said. \nIn the end the Golden Panthers (8-5-3) did just that, playing shutdown defense and capturing a narrow one-goal victory over the Lakers (6-6-1). \n\"It's a long three minutes, especially when we're up,\" Bolchune said. \nIn the end Bolchune need not have worried, as a Golden Panthers backline consisting of senior Julia Taormina, sophomore Maria McLaughlin, and junior Rory Molisso sealed the victory for the Golden Panthers by refusing to concede a goal, just like they had been doing all half. \n\"All three of them were solid back there,\" Bolchune said. \nShe said that even when they failed to stop the Lakers advance, they were still able to recover effectively. \n\"Even when they didn't, they recovered back, they were there for each other, and they were on point today,\" she said. \nThe Golden Panthers wasted little time jumping out to the lead, finding the back of the goal within the first minute of the opening whistle. \nWith the ball rolling on the doorstep of the Lakers goal, junior Emiliana Hokr was able to tap it past Lakers senior goalkeeper Meghan Cuozzo for the opening goal. \nBolchune said scoring the opening goal so early was huge for her team. \n\"I think it put a spark under us because they were all sorts of fired up after that,\" she said. \"I think it really set the tone for the rest of the game because we were pushing ourselves for sixty minutes.\" \nThe Golden Panthers would be rewarded for their efforts around the eighth minute when they were able to double their lead. \nJust like she did in their opening goal, Hokr played a role again, this time providing the assist while junior Lexi Toback tallied the goal. \n\"She's a key player for us,\" Bolchune said. \"Emiliana always tends to score when we really need a goal, whether it's tied or if we're down one with not much time. She does what she needs to do to put the ball in every time.\" \nThe Lakers would get one back about three minutes before the halftime whistle when Lakers senior Jane Brennan was able to knock it home and past Golden Panthers senior goalkeeper Kaitlyn Natoli off of an assist by fellow senior Victoria Rose. \nHeading into the second half, Bolchune said it was about keeping with what they were doing, and getting back on defense. \n\"We just kind of keep doing what we're doing, making sure we're marking on defense and making sure our mids are recovering back to help on those breakaways cause they're a lot quicker, so when we come up too far it's hard to recover back,\" she said. \nIn the end the Golden Panthers did just that, as they shut the Lakers out in the second half for their eighth victory of the season.  ", "external_links": [], "published": "2015-10-26T06:15:00.000+02:00", "crawled": "2015-10-26T09:47:08.521+02:00", "highlightTitle": ""}