{"organizations": [], "uuid": "d5cb2e119706d920486e96032ee5a72821f0c905", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "http://si.wsj.net/public/resources/images/BN-KW412_silver_G_20151021141640.jpg", "site_section": "http://www.wsj.com/news/life", "section_title": "Lifestyle, Real Estate &amp; Sports News - Wall Street Journal", "url": "http://www.wsj.com/articles/sleek-silver-jewelry-for-the-corner-office-1445452034", "country": "", "title": "Sleek Silver Jewelry for the Corner Office", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "Sleek Silver Jewelry for the Corner Office - WSJ", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T22:27:00.000+03:00", "replies_count": 0, "uuid": "d5cb2e119706d920486e96032ee5a72821f0c905"}, "author": "lauren sherman", "url": "http://www.wsj.com/articles/sleek-silver-jewelry-for-the-corner-office-1445452034", "ord_in_thread": 0, "title": "Sleek Silver Jewelry for the Corner Office", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS ENLARGE Collar, $10,675, Sidney Garber, 312-944-5225; Egg Pendant, $550, sophiebuhai.com; Jump-suit, $3,295, Calvin Klein Collection, 212-292-9000 Photo: F. Martin Ramin/The Wall Street Journal, Styling by Paula Knight, Hair & makeup by Birgitte Philippides, Model: Aube Linda/Red Model Management WHEN SOPHIE BUHAI debuted her namesake jewelry line in April, it stood out not only for its smooth, modernist shapes but also for the material in which it was made: sterling silver.\n“I’ve always worn silver and loved it,” said Ms. Buhai, previously known in the fashion world as one-half of clothing design duo Vena Cava. “My mom wore a lot of Mexican silver and my grandmother wore a lot of Scandinavian, mid-Century silver. I just noticed that nobody was doing solid sterling silver in simple but updated, shapes.”\nHer ovoid pendants and curvy cuffs have quickly gained fans, among them the museum-shop buyers at the Cooper Hewitt, Smithsonian Design Museum in New York as well as French designer Christophe Lemaire and his partner Sarah-Linh Tran who collaborated with Ms. Buhai on pieces for his spring 2016 collection.\nMs. Buhai’s success is just one sign of a budding renaissance for silver, particularly when the metal comes in bold, unembellished forms. Several jewelry designers have recently adopted silver as their material of choice, and brands like Maison Margiela and Balenciaga have begun to incorporate sleek silver-hued pieces into their jewelry collections.\nENLARGE Clockwise from top left: Triangular Choker, $900, lynnban.com; Charlotte Chesnais Medium Saturn Earrings, $460, Dover Street Market New York, 646-837-7750; Silver Plated Squared Cuff, $185, miansai.com; Silver Plated Modern Flat Cuff Bracelet, $205, miansai.com; Tom Wood Oval Marble Ring, $417, theline.com Photo: F. Martin Ramin/The Wall Street Journal, Styling by Anne Cardenas These new pieces represent a sort of cleaning up in the jewelry world. After so many years of delicate rose-gold and yellow-gold pieces that beg to be layered up—and that can be a bit overwrought for conservative professional dress codes—weighty silver offers an alternative that makes a chic but pared-back statement.\n“Silver is the cotton tee, for me,” said Paris-based jewelry designer Charlotte Chesnais, who made pieces for Nicolas Ghesquière at Balenciaga before launching her collection of subtly avant-garde serpentine cuffs and mobile-like earrings in 2015. “It’s basic, pure and simple.”\nMs. Chesnais said she finds inspiration in the starkly voluptuous 1970s-era work by Elsa Peretti for Tiffany & Co. and in Danish silver maker Georg Jensen. One major selling point for her—and for anyone looking to invest in the look—is silver’s excellent value. Indeed, sterling silver jewelry rarely hits the $2,000 mark, and most pieces are priced under $1,000. The medium size of her silver Saturn hoop earrings are $460, and her double-looped Initial cuff is $1,139. “In France, silver is considered a precious metal,” she added. “I love the idea of proposing something precious with a nice price.”\nThe desire to offer substance sans sticker shock also motivated New York-based designer Lynn Ban to start mixing silver with diamonds for the tough-luxe pieces she launched her label with in 2011. Her work takes cues from armor; it’s not always delicate. “Using gold would be cost prohibitive,” she said. For inspiration, Ms. Ban also looks to modern sculpture and art. “You don’t see a Zaha Hadid building in gold, do you?” she said. “It’s always silver.” The metal, she added, looks “substantial and significant.”\n‘ You don’t see a Zaha Hadid building in gold, do you? It’s always silver. ’\nNew York-based stylist Vanessa Traina Snow cast doubt on the idea that a silver revival is under way, arguing that something so classic never really goes away. Still, she’s excited about designers like Ms. Buhai, who she thinks are reinvigorating the metal. In fact, Ms. Traina Snow worked with Ms. Buhai on a special collection—new variations on the label’s signature Egg Pendant—to be sold at the recently opened brick-and-mortar incarnation of Ms. Traina Snow’s e-commerce site the Line, in Los Angeles, called the Apartment.\nRelated Statement Jewelry: Ring In the New Dior’s New Lucky Star Jewelry Bling of the Jungle: The Best Animal Jewelry Theirs is a simpatico relationship. Pieces like Ms. Buhai’s Egg Pendant play rather beautifully off the Line’s stock of minimalist clothes in a classic, neutral palette. The aesthetic is discerning and distinctly chic but also more office-friendly than say, the bohemian look of layered gold bracelets and stacked rings. That’s a welcome rarity with new trends.\nAnother of silver’s distinctions: It tends to look good on many different people. Mona Jensen, designer of jewelry label Tom Wood, said she favors silver because the material favors just about everyone: “After a little wearing, it kind of melts into you.”\nMs. Jensen’s best sellers are her classic silver signet rings, whose tops are flat, plain and polished or inset with a lozenge of marble, onyx or even gold—which Ms. Jensen occasionally wears before inevitably coming back to the icier metal. “Silver is cooler,” she said. “If you wear too much gold and diamonds, it’s too flashy.”\nMore in Style & Fashion A Sensible Guide to Buying Hot Fashion Trends Autumn Salves: Sunscreens for Fall and Winter The Three Fashion Designers to Know This Fall Indie Denim Brands Serve Up Something Special Fall Fashion’s Victoriana Principle Fall Fashion’s New Eccentricity Phone Cases: The New It Fashion Accessory?", "external_links": ["http://si.wsj.net/public/resources/images/BN-KW393_silver_P_20151021135930.jpg", "http://www.pinterest.com/wsj/wsj-fashion/", "http://si.wsj.net/public/resources/images/BN-KW393_silver_M_20151021135930.jpg", "http://si.wsj.net/public/resources/images/BN-KW412_silver_FR_20151021141640.jpg"], "published": "2015-10-21T22:27:00.000+03:00", "crawled": "2015-10-21T21:33:01.484+03:00", "highlightTitle": ""}