{"organizations": ["Bristol Smith", "HeFutrell", "Red Hook", "Patriots", "Poughkeepsie Journal", "North Rockland"], "uuid": "6914fe7c38ab48c8deac93227bab163dd701f0f3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.poughkeepsiejournal.com", "main_image": "http://www.gannett-cdn.com/-mm-/b7c60ca4e4f835c3a7afc750cce4f4748fcf4a5e/c=0-338-2683-1854&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/02/Poughkeepsie/Poughkeepsie/635794148729185892-DSC-5100.jpg", "site_section": "http://rssfeeds.poughkeepsiejournal.com/poughkeepsie/sports", "section_title": "Poughkeepsie - Sports", "url": "http://www.poughkeepsiejournal.com/story/sports/high-school/2015/10/04/football-huddle-makeup-make-up-poughkeepsie/73329426/", "country": "US", "title": "Football Huddle: Makeup or make-up for Poughkeepsie?", "performance_score": 0, "site": "poughkeepsiejournal.com", "participants_count": 0, "title_full": "Football Huddle: Makeup or make-up for Poughkeepsie?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T00:14:00.000+03:00", "replies_count": 0, "uuid": "6914fe7c38ab48c8deac93227bab163dd701f0f3"}, "author": "", "url": "http://www.poughkeepsiejournal.com/story/sports/high-school/2015/10/04/football-huddle-makeup-make-up-poughkeepsie/73329426/", "ord_in_thread": 0, "title": "Football Huddle: Makeup or make-up for Poughkeepsie?", "locations": ["Poughkeepsie", "Dover", "Ellenville", "North Rockland"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ryan Schumacher", "Bristol Smith", "John Jay", "Stephen Haynes", "Rino Tamburri", "Danny Diedrich", "Patrick Oehler/Poughkeepsie Journal John Jay", "Michael Cintron", "Jaquon Futrell"], "text": "Football Huddle: Makeup or make-up for Poughkeepsie? Stephen Haynes, Poughkeepsie Journal 5:14 p.m. EDT October 4, 2015 John Jay's Ryan Schumacher looks to pass the ball during Friday's game versus North Rockland. Patrick Oehler/Poughkeepsie Journal John Jay's Bristol Smith attempts to break free from North Rockland's Michael Cintron during Friday's home game. Patrick Oehler/Poughkeepsie Journal John Jay's Danny Diedrich crosses the goal line for the two point conversion in the third quarter during Friday's home game versus North Rockland. Patrick Oehler/Poughkeepsie Journal Action from Friday's game between John Jay and North Rockland. Patrick Oehler/Poughkeepsie Journal Action from Friday's game between John Jay and North Rockland. Patrick Oehler/Poughkeepsie Journal Action from Friday's game between John Jay and North Rockland. Patrick Oehler/Poughkeepsie Journal Action from Friday's game between John Jay and North Rockland. Patrick Oehler/Poughkeepsie Journal Action from Friday's game between John Jay and North Rockland. Patrick Oehler/Poughkeepsie Journal Action from Friday's game between John Jay and North Rockland. Patrick Oehler/Poughkeepsie Journal Action from Friday's game between John Jay and North Rockland. Patrick Oehler/Poughkeepsie Journal Action from Friday's game between John Jay and North Rockland. Patrick Oehler/Poughkeepsie Journal Action from Friday's game between John Jay and North Rockland. Patrick Oehler/Poughkeepsie Journal Action from Friday's game between John Jay and North Rockland. Patrick Oehler/Poughkeepsie Journal Action from Friday's game between John Jay and North Rockland. Patrick Oehler/Poughkeepsie Journal Action from Friday's game between John Jay and North Rockland. Patrick Oehler/Poughkeepsie Journal Action from Friday's game between John Jay and North Rockland. Patrick Oehler/Poughkeepsie Journal Action from Friday's game between John Jay and North Rockland. Patrick Oehler/Poughkeepsie Journal Action from Friday's game between John Jay and North Rockland. Patrick Oehler/Poughkeepsie Journal Like this topic? You may also like these photo galleries: Replay Action from Friday's game between John Jay and North Rockland. (Photo: Patrick Oehler/Poughkeepsie Journal) Story Highlights #PJTop3: Three of the top football performances in Week Five. Nominate performances by using #PJTop3 on Twitter. Jaquon Futrell, Dover: HeFutrell rushed for 296 yards and scored five touchdowns in the first half to lead Dover in a 60-0 rout of Ellenville on Friday. Bristol Smith, John Jay: The senior scored twice and ran for a career-high 159 yards, including three runs of over 30 yards, as the Patriots beat North Rockland, 29-8, on Friday. Rino Tamburri, Marlboro: The tailback ran for 234 yards and four touchdowns and also made 13 tackles to lead the Iron Dukes over Red Hook, 62-13, on Friday. 10 CONNECT 5 TWEET LINKEDIN COMMENT EMAIL MORE \nIt's been said in sports that victory is the ultimate makeup for a team, able to conceal most any blemish. But that's often superficial. \nMore importantly, winning can be a pretty good make-up — as in its ability to soothe bitterness and sometimes help a group reconnect. \nOr maybe the Poughkeepsie High School football team rekindled first, and that's what helped lead them to victory on Friday. Or maybe the win wasn't at all indicative of any improvement in chemistry. Whatever the case, the Pioneers earning a 20-14 win over Wallkill surely was a positive step for a team in desperate need of one. \nIt had been a rough three weeks for the Pioneers, the kind of brutal stretch that can derail a season and, worse, fracture a team. Two ugly blowout losses sandwiched around a forfeit, the penalty handed down by district administrators concerned about the behavior of some players. In particular, the players involved in a reported altercation on the bus ride home after a 41-12 loss at Port Jervis on Sept. 11. \nThat incident cost them the following week's game when district Superintendent Nicole Williams announced the varsity football players would do community service instead of facing Saugerties. Then, when Poughkeepsie returned to the field, they were pummeled, 59-6, by Cornwall Central. \n\"Even with the score like that, they didn't give up,\" Pioneers coach Jerry North said. \"On the bus, they kept it together and we didn't point fingers. That's what I wanted to see.\" \nIt was small. It was simple. But it was something. Poughkeepsie football to forfeit Friday as part of discipline \nFor a struggling program coming off a one-win season and for a team that may still have some internal issues festering and is led by a first-year coach, an embarrassing defeat compounding the controversy easily could have been the final ingredient for a poison potion. Imagine for a second how that could have gone. Disharmony, discord, dissent... disaster. \nThat was all seemingly averted. Then on Friday, Isaiah Williams' 15-yard touchdown reception tied the score at 14 and Troy Schoonmaker's 3-yard touchdown run with three minutes left won it for Poughkeepsie. Shaquez Nesbitt also starred, returning an interception 68 yards for a score in the first half, and Lucas Ramos and Moe Thomas each had a pick. \n\"It just shows that we have character,\" North said. \"We're starting to get some pride back.\" \nIt's also a prime example of victory serving as makeup. The victory alone, obviously, doesn't resolve everything. But it helps. Because for as bad as it's been, Poughkeepsie has a 2-3 record, which actually doesn't sound all that bad. The Pioneers already have surpassed last season's win total. Section 9 football roundup: Schoonmaker lifts Pioneers \nThere's also the make-up factor: How the joys of shared success can bring people together and help heal relationships. It's human nature — folks are usually more forgiving when happy. \nThe long-term objective of the forfeit, we presume, was to force the team to take a step back and correct itself before attempting to take the proverbial two steps forward. \"The way it was handled made them realize that the things one person does can affect everyone,\" North said. \"We all have to respect each other and have the same goal.\" \nWe can only hope for all involved that lessons were learned and that Friday's performance indicated a page being turned, on the field and off it. \n\"We have to continue sticking together as a team,\" North said. \nThat suggests it's still a work in progress, that chemistry still is being developed and camaraderie repaired. Which is to be expected. Football: Poughkeepsie stuns Roosevelt \nBut with three games remaining — beginning with a trip to Monticello at 1:30 p.m. Saturday — the Pioneers have a chance to make something of this season. For all that went wrong, there still is a chance to make up lost ground. Maybe even change the narrative. \n\"Progress has definitely been made,\" North said. \"That last bus ride, it was good. This time we were able to talk about all the good things we did.\" \nTop Week Five Game \nRoy C. Ketcham 13, White Plains 6 — Al Dockery scored a touchdown on a quarterback sneak with 5:04 remaining to seal the win as the Indians earned their second win of the season. Jesse Pascale's touchdown had given Ketcham a 7-6 lead with 9:31 left in the third quarter and his fourth-quarter interception helped seal the win. Tai-sean Dodd, battling an ankle injury, rushed for 80 yards. \nWeek Five Scoreboard", "external_links": [], "published": "2015-10-05T00:14:00.000+03:00", "crawled": "2015-10-05T16:27:07.740+03:00", "highlightTitle": ""}