{"organizations": [], "uuid": "bcca221bcd73f6846b79d1a759409ba24f38cb52", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbclosangeles.com", "main_image": "http://media.nbclosangeles.com/images/1200*759/David+Murphy+steals+third.png", "site_section": "http://www.nbclosangeles.com/news/sports/?rss=y&embedThumb=y&summary=y", "section_title": "NBC Southern California  - Sports", "url": "http://www.nbclosangeles.com/news/sports/Mets-Score-Early-But-Dodgers-Strike-Back-in-Game-5-of-NLDS-333131971.html", "country": "US", "title": "Mistake Costs Dodgers in Game 5 of NLDS", "performance_score": 0, "site": "nbclosangeles.com", "participants_count": 1, "title_full": "Mistake Costs Dodgers in Game 5 of NLDS", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T04:56:00.000+03:00", "replies_count": 0, "uuid": "bcca221bcd73f6846b79d1a759409ba24f38cb52"}, "author": "MICHAEL DUARTE", "url": "http://www.nbclosangeles.com/news/sports/Mets-Score-Early-But-Dodgers-Strike-Back-in-Game-5-of-NLDS-333131971.html", "ord_in_thread": 0, "title": "Mistake Costs Dodgers in Game 5 of NLDS", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Follow the latest in professional sports across Southern California. Mistake Costs Dodgers in Game 5 of NLDS, Game Tied 2-2 A horrific mistake by the Dodgers infielders has Game 5 of the NLDS tied 2-2 in the middle innings. Privacy Policy | More Newsletters Getty Images Daniel Murphy #28 of the New York Mets looks on from third base after advancing as the base was not covered by a Los Angeles Dodgers player in the fourth inning in game five of the National League Division Series at Dodger Stadium on October 15, 2015 in Los Angeles, California. (Photo by Harry How/Getty Images) A horrific mistake by the Dodgers infielders has Game 5 of the NLDS tied 2-2 in the middle innings. New York second baseman, Daniel Murphy, played possum and took advantage of the Dodgers in a shift, as the Mets stole a run in the top of the 4th inning. With the Dodgers leading 2-1 and Murphy on first base, Zack Greinke issued a walk to Mets slugger Lucas Duda. Murphy casually walked to first, but smartly saw LA's infield was in a shift and nobody was covering third base. Murphy touched the bag at second and took off for third stealing the base easily. One batter latter, Murphy would take on a sacrifice fly to right field, tying the winner-take-all game at 2-2. The New York Mets scored a run early Greinke, but the Dodgers struck back to score two runs in the bottom of the 1st and lead Game 5 of the NLDS 2-1 in the early innings at Dodger Stadium. Curtis Granderson led off the game with an infield single, and would score two batters later on an RBI double off the wall for Daniel Murphy. Murphy has scored the Dodgers in the NLDS, but Greinke recovered, striking out the next two batters on 95MPH fastballs, the hardest he's thrown all season, and the Mets had to settle for just one run. The Dodgers struck back in the bottom half of the inning off 2014 NL Rookie of the Year, Jacob DeGrom. DeGrom was unhittable in Game 1 of the series, but allowed four singles in the first, and LA came roaring back to take the lead. Dodgers outfielder Andre Ethier made a diving catch in the second inning to save a run for Los Angeles, but was seen arguing with manager Don Mattingly in the bottom half of the third inning, for not advancing Justin Turner who ledoff the inning with a double. The Dodgers have left six runners on base through the first four innings, and as DeGrom settles in, the lack of hitting with runners in scoring position, may come back to bite the Boys in Blue. It's turning out to be an instant classic as New York and Los Angeles battle it out for baseball supremacy and the right to play the Chicago Cubs in the National League Championship series, which begins on Saturday. The Mets are searching for their first NLCS since 2006, when they swept the Dodgers in the NLDS only to fall to the St. Louis Cardinals in the next round. Meanwhile, the Dodgers are looking to get to the NLCS for the second time in three years, but still have to take the next step and reach the World Series for the first time since 1988. Please refresh this page for more updates, stats and player reactions…", "external_links": [], "published": "2015-10-16T04:56:00.000+03:00", "crawled": "2015-10-16T06:00:05.322+03:00", "highlightTitle": ""}