{"organizations": [], "uuid": "3f972dd52f87b9b007c7e58f99bcc8e8887dd510", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pendletontimespost.com", "main_image": "", "site_section": "http://pendletontimespost.com//feed/sec/6000/", "section_title": "PendletonTimesPost.com - Sports News", "url": "http://www.pendletontimespost.com/view/story/9b4423e7f8bd4be08cc646e54aa5bc9d/SOC--Italy-No-Balotelli/", "country": "US", "title": "Doing just fine without Balotelli, Italy look ahead to Euros", "performance_score": 0, "site": "pendletontimespost.com", "participants_count": 0, "title_full": "Doing just fine without Balotelli, Italy look ahead to Euros", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T14:55:00.000+03:00", "replies_count": 0, "uuid": "3f972dd52f87b9b007c7e58f99bcc8e8887dd510"}, "author": "", "url": "http://www.pendletontimespost.com/view/story/9b4423e7f8bd4be08cc646e54aa5bc9d/SOC--Italy-No-Balotelli/", "ord_in_thread": 0, "title": "Doing just fine without Balotelli, Italy look ahead to Euros", "locations": ["Italy"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["ANDREW DAMPF", "Mario Balotelli", "Balotelli"], "text": "'Unity's our strength': Qualified for Euro 2016, Italy doing just fine without Mario Balotelli By ANDREW DAMPF AP Sports Writer   7:54   7:55   \nPeople: \n\nROME — Italy is doing just fine without Mario Balotelli. \nA convincing 3-1 win at Azerbaijan on Saturday secured the Azzurri a spot at next year's European Championship to cap a qualifying campaign in which Balotelli didn't play a single match. \nAntonio Conte, the coach hired when Cesare Prandelli resigned after the Azzurri's first-round elimination from last year's World Cup, has taken a liking to a new forward pairing of Brazilian-born Eder and the long-overlooked Graziano Pelle, a standout for Southampton in the English Premier League. \n\"We're united and unity is our strength,\" Eder said after scoring one goal and helping set up another in Baku — giving him two scores in five matches for Italy to go with six in seven Serie A appearances this season for Sampdoria. \nTeam unity was clearly a problem at last year's World Cup in Brazil, where Balotelli's personality and actions came into conflict with that of the squad's veterans. \nConte called up Balotelli once last November but he left the team with an injury before getting a chance to play. \nBefore he picked up an injury last week, there was speculation that Conte would call up Balotelli for the Azerbaijan match and Tuesday's Group H game against Norway in Rome, in which Italy can seal first place. \nAfter a dismal season at Liverpool in which he scored just one goal in the Premier League, Balotelli has shown signs of a return to form at AC Milan , scoring a majestic free kick against Udinese last month to end a seven-month scoring drought. \n\"Even if Balotelli wasn't injured I wouldn't have called him up,\" Conte said. \"Two matches and a free-kick goal are not enough to return to the national team. There's a path of continuity, performances and behavior to follow.\" \nSo if Balotelli does return to Italy's squad for next year's tournament in France, he'll do so without having played a single qualifier. \nThe Euros, it should be noted, were the stage on which Balotelli performed best, scoring both goals in Italy's 2-1 semifinal win over Germany in 2012. \nWith or without Balotelli, Conte believes the Azzurri can contend. \n\"You've got to be ambitious to go all the way,\" the coach who led Juventus to three straight Serie A titles said. \"We know full well that there are stronger national squads but with our work ethic and the quality that we have we can go for it. \n\"I'm not interested in saying if we'll finish in the last four or 12,\" Conte added. \"I don't believe in paper rankings — they're made to be disproved. But we're going to France to give bother to everyone.\" \nA four-time World Cup winner, Italy's only European Championship title came in 1968. \nConte's squad is undefeated in qualifying, having won six matches and drawn three. \nBesides Eder and Pelle, Conte has also helped revive the career of Stephan El Shaarawy, whose winning goal Saturday ended a three-year scoring drought with the national team. \nThe son of an Egyptian father and an Italian mother, the 22-year-old El Shaarawy has been hailed as one of Italy's best young players for years but he struggled with injuries and confidence in recent seasons. After failing to make Italy's squad for last year's World Cup, he transferred from AC Milan to Monaco. \n\"We knew it was a key match for qualification and we went out onto the pitch determined and focused,\" El Shaarawy said. \"We produced a performance filled with character, heart and grit.\" \nThe match was also notable for the performance of another 22-year-old. Playing in place of the injured midfield maestro Andrea Pirlo, Verratti set the tone for the match when he launched a long, vertical pass for Eder that set up the opening goal 11 minutes in. \nAnd Manchester United fullback Matteo Darmian sealed the result with his first national team goal. \n\"The squad is improving,\" Conte said. \"Now we've got to continue like this.\" \nWith or without Balotelli. \nAndrew Dampf can be followed at http://www.twitter.com/asdampf \n ", "external_links": [], "published": "2015-10-11T14:55:00.000+03:00", "crawled": "2015-10-11T15:44:17.117+03:00", "highlightTitle": ""}