{"organizations": [], "uuid": "57dbc5f5e7060b7023a7822d959b51e65c2d1930", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.philly.com", "main_image": "http://media.philly.com/images/101215_utley_1024.jpg", "site_section": "http://www.philly.com/philly_sports.rss", "section_title": "Philly.com Sports", "url": "http://www.philly.com/philly/sports/phillies/Daily_News_Agenda_Should_Chase_Utley_have_been_suspended.html", "country": "US", "title": "Daily News Agenda: Should Chase Utley have been suspended?", "performance_score": 0, "site": "philly.com", "participants_count": 1, "title_full": "Daily News Agenda: Should Chase Utley have been suspended?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T05:55:00.000+03:00", "replies_count": 0, "uuid": "57dbc5f5e7060b7023a7822d959b51e65c2d1930"}, "author": "Rich Hofmann", "url": "http://www.philly.com/philly/sports/phillies/Daily_News_Agenda_Should_Chase_Utley_have_been_suspended.html", "ord_in_thread": 0, "title": "Daily News Agenda: Should Chase Utley have been suspended?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Should Chase Utley have been suspended? Yes View results No player of his generation better exemplifies baseball played at its grittiest edge. In his distant prime, Utley's uncanny hitting ability far exceeded the boundaries set by his marginal athleticism. He compensated with unmatched effort, excellent preparation, incomparable baseball instincts...and a willingness to break the rules.\nOther players play hard, especially when coming into a base; Matt Holliday comes to mind. But Utley, a second baseman himself, is a serial offender, repeatedly and willfully abandoning any hope of touching the base with the intent of disrupting the relay; or, much worse, seeking high-speed, full-body tackles with utter disregard for safety, simply because MLB has not held him (or anyone else) accountable. \nUtley's most memorable offense also involved Tejada, in 2010, when Tejada was a 20-year-old rookie. Both in 2010 and in 2015, Utley began his slide so late he had no chance of holding the bag; in fact, he never touched the bag in either instance. Both times, he targeted Tejada's legs with his own torso. \nUtley never intends to hurt his victims, but he believes it's the price of doing business. To be fair, Utley himself absorbs plenty of punishment; Tejada's knee clipped Utley's face. \nAll of which is collateral, insignificant information. \nThe play was dirty, and typical. \nA 2011 poll by Sports Illustrated asked 250 players — 10 teams' rosters, one-third of all players — to name the \"meanest\" player in baseball. Utley finished second, with 13 percent of the vote, purely on his history of dirty play. \nHe would be a landslide winner today. \nRyan Lawrence: There is no precedent for a suspension \nI'D REALLY LIKE to use this space to defend Chase Utley and the way he has played the game for more than a dozen years in the big leagues, a way that's made him as popular or more popular than any player in Phillies history. \nI'd like to go into this exercise by saying he should not be suspended for his hard slide into Mets shortstop Ruben Tejada late Saturday night. \nBecause, there really isn't a precedent for this. \nIf you want to see a dirty slide, go to YouTube and type in \"Hal McRae Takes Out Willie Randolph.\" This was from the 1977 ALCS. McRae was not suspended. \nOK, 38 years ago is crazy, you might as well go hunting for dinosaur fossils. So, how about 27 days ago, when Chris Coghlan of the Chicago Cubs broke the leg of Pittsburgh rookie infielder Jung Ho Kang in a takeout slide attempt. \nYou can watch this one on the internet, too. Yes, Coghlan started his slide well before Utley started his, but look at his legs — they are aimed directly at Kang and nowhere in the vicinity of second base. Coghlan was not suspended. \nHow do you think the Pirates, sitting home after getting knocked out last week by the same Cubs, feel about the Utley ruling? Shouldn't their player have received justice, like Tejada? \nIs this a case of the most recent event happening to a New York team, a team from a city with a seemingly endless media contingent and vocal following, where any and every event gets magnified because HEY MAN, THIS IS NEW YORK, WHICH MEANS IT'S FAR MORE IMPORTANT THAT YOU DO SOMETHING? No one cares about you, Pittsburgh. \nThen there's the case of the umpire crew at Dodger Stadium on Saturday. They watched the Utley play live. They also had the advantage of reviewing the play via video replay, as the Dodgers challenged the initial call that Utley was out. The umpires, with help from the MLB officials also watching the video in New York, overturned that call. These people, whose only job should be to know and understand the rules, did not dismiss Utley from the game. \nGiven all of that, it's awfully tough to sit here and say Utley should be suspended. It's like you're on the playground and there's one kid making up the rules on the fly, during the game, after the fact. \nBut, in this case, those rules are in place — Rule 5.09(a)(13), which forbids \"deliberate, unwarranted, unsportsmanlike action by the runner in leaving the baseline for the obvious purpose of crashing the pivot man on a double play, rather than reach the base\" — even if it's very unfortunate they're not regularly enforced. \nYou can love the way Utley plays; but go watch the video from Saturday over and over: You can, in no way, love that slide. \nHe didn't start sliding until he was already even with the bag, he wasn't headed toward the bag, and his lower body made contact with Tejada before making contact with the actual ground. That's not a slide; it's a tackle. \nIt's unfortunate Tejada's back was turned, that second baseman Daniel Murphy's feed put the shortstop in an awkward position, and there's nothing Utley could have anticipated in a play that happens that quickly. Utley didn't intend to hurt Tejada. He intended to break up the play and tie the game. \nUtley succeeded. But, even later that night, he conceded that it was possible such a play could be construed as \"dirty.\" \n\"It depends on who you're talking to,\" Utley said. \nAnd so, the suspension is valid — so long as MLB continues to enforce the same rules in the future. \nDavid Murphy: MLB has botched this whole thing \nTHE ONLY way baseball could have been more clear about the intended message of its Utley suspension would have been to force Joe Torre to strip down to his birthday suit and walk through the streets of Queens with Kevin James following in a UPS truck and all the people yelling, \"Shame!\" \nYes, if there is one thing you can say about the custodians of America's pastime, it's that they always find a new and creative way to take advantage of an opportunity to botch things up for everyone. Credit where credit is due, then. \nAt the same time, given the geographic proximity of MLB headquarters to the lair of Darth Goodell, it's hard to believe Rob Manfred and company could not figure out the optimal way to handle these situations: deny, deny, deny until the next game starts and everybody forgets. \nUtley's takeout slide of Ruben Tejada was a play that easily could have been written off as one of those inevitable but regrettable outcomes that the sport will work harder to correct but that a championship team should be able to overcome. It was the kind of moment that called for a diplomatic statement employing words like, \"after careful review,\" and \"moving forward,\" and, \"point of emphasis in the future,\" instead of, \"Oopsies! Here's how we'll try to make it up to you, New York.\" \nThe only thing baseball's ruling accomplished was to call into question not only the integrity of Game 2 but the integrity of Games 3 and 4 as well. Because even though Utley should have been called out — and the rule book is surprisingly clear on this — there is no way anybody can watch the play and conclude that he was guilty of anything greater than attempting to do everything in his power to help his team win. In fact, the statement Torre released acknowledged that Utley was not trying to injure Tejada and was simply \"in violation of Official Baseball Rule 5.09 (a)(13).\" \nThe problem is, Torre uses the violation of Rule 5.09(a)(13) to justify the suspension, when the rule book is already clear about the penalty for such a violation: The runner is out. Just because the umpires botched the call and baseball feels guilty because it has been allowing umpires to botch similar calls throughout its history doesn't mean it is justified in using an unprecedented extrajudicial measure to make amends to the injured parties. Now, regardless of who wins the series, the loser will feel that the outcome is tainted. \nWe have a word for that: Shame! \nMike Kern: Maybe suspension can lead to a greater good \nYOU WONDER what might have happened, or not, had Chase Utley taken out Ruben Tejada at second base like that on a Wednesday night in May. Guess we'll never find out. \nWhat we do know is it obviously incited candid opinions, both ways. Chase has always been the type of guy who if he played for you, you loved whatever he did to help you win. And if he didn't, then you certainly appreciated that he was a throwback to another era. A time when a play like that would have either been mostly applauded or at least not drawn nearly as much attention. \nGiven the circumstances, I don't think it's unreasonable that Utley was suspended for two games. If nothing else, I think this will prompt Major League Baseball to take a longer look at protecting middle infielders much in the same way it did with catchers in the wake of the Buster Posey injury a few years back. In that respect, it makes sense. \nDo I think Utley made a \"dirty\" play? Not necessarily. He was trying to break up a potential doubleplay, to get the tying run across in the late innings of a game his team had to have. But did he possibly go over the line? Sure. As Pedro Martinez said, \"Would Chase teach his son to slide like that?\" I would have had no problem if he had just started to slide earlier. Or even made a better attempt to actually slide. \nThe fact that Tejada was in an awkward, unprotected position obviously didn't help. And no one should understand that better than Utley. But that's probably not what he was thinking as he went barreling in there. Knowing him, he'd probably do the same thing again. That doesn't mean he was out to hurt anyone. Still, it's hard to excuse the intent, which didn't look to be just going in hard. \nAs the rules are currently written, I'm not sure he was guilty of breaking them. But there was something not right about the appearance. Hence the action. Or reaction. \nWho knows? It might even have been necessary. Can't necessarily say the same for Chase's takeout. \nWhat they're saying about Utley \nA sampling of reactions from the baseball world about the Chase Utley controversy: \nJose Reyes, Colorado Rockies shortstop, on Twitter: \"that was a really weak attempt at a slide by utley \" \nMark Mulder, former MLB pitcher/current ESPN analyst, on Twitter: \"Like it or not, Utley plays hard and I would want him on my team.\" \nShane Victorino, Angels outfielder, former Phillie, on Twitter: \"Always called him one of my toughest teammates...Utley showing why I always called him a winner!!! \nNever wanna see anyone get hurt but I have seen worse but the magnitude of this one will bring up a lot of debate for sure!!! .... Feel bad for Tejada getting hurt.\" \nSan Diego outfielder Justin Upton, on Twitter: \"If that was a superstar shortstop we would have a Tulo Rule being enforced tomorrow.\" \nLarry Bowa, Phillies bench coach, on MLB Network radio: \"I know Utley, I know that he didn't try to hurt anybody. The shortstop put himself in harm's way.\" \nTony Gwynn Jr., former Phillies outfielder, on Twitter: \"That' s good baseball by Mr. Utley right there...Sucks to see Tejada hurt on the play tho!... agree that the slide was late, but not dirty! After a few more looks at it, Utley should have come in lower. I think the idea of coming in hard and breaking it up was right tho!\" \nFormer MLB outfielder Jose Canseco, on Twitter: \"Chase Utley's slide so dirty...wow so late .when I played I weighed 240 and would never consider hitting someone so hard.\" \nPedro Martinez, Hall of Fame pitcher and former Utley teammate, on MLB Network following game: \"I have a hard time watching this play...it seems to me Utley never had the intentions of sliding...he went straight after Tejada.\" \nBert Blyleven, Hall of Fame pitcher, on Twitter: \"Let's see, catchers can't block plate, future base runners can't slide hard into 2nd base. Let's remove OF fences to keep outfielders safe.\" \nSean Doolittle, Oakland A's reliever, on Twitter: \"Here's the issue: under current interpretation of rules, slide was legal. for player safety, rule needs to change.\" \nJerry Hairston Jr., former MLB player, on Twitter: \"Clean play by chase. Touch bag with the left hand. Hard nosed play. Can't pirouette around the bag in the #postseason.\" \nAlex Cora, former MLB player/current ESPN analyst, on Twitter: \"When your back leg lands pass the bag, it's dirty.\"", "external_links": [], "published": "2015-10-13T05:55:00.000+03:00", "crawled": "2015-10-13T06:06:57.352+03:00", "highlightTitle": ""}