{"organizations": ["Pleasantville Southeast Warren", "Facebook", "Pleasantville Facebook Email Twitter Google"], "uuid": "0050ef20422d7958adcd158da9ecf5a6059fa882", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.desmoinesregister.com", "main_image": "http://www.gannett-cdn.com/-mm-/43e46b100290a4be3b15e3c223be529a4c61d848/c=0-102-2000-1232&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/09/IAGroup/DesMoines/635800313018468999-sp.SEW-football-01.jpg", "site_section": "http://rssfeeds.desmoinesregister.com/desmoines/highschoolsports", "section_title": "Des Moines - High School Sports", "url": "http://www.desmoinesregister.com/story/sports/high-school/2015/10/10/ciml-high-school-football-des-moines-register-week-seven/73713008/", "country": "US", "title": "16 photos: Southeast Warren hosts Pleasantville", "performance_score": 0, "site": "desmoinesregister.com", "participants_count": 0, "title_full": "16 photos: Southeast Warren hosts Pleasantville", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T06:54:00.000+03:00", "replies_count": 0, "uuid": "0050ef20422d7958adcd158da9ecf5a6059fa882"}, "author": "", "url": "http://www.desmoinesregister.com/story/sports/high-school/2015/10/10/ciml-high-school-football-des-moines-register-week-seven/73713008/", "ord_in_thread": 0, "title": "16 photos: Southeast Warren hosts Pleasantville", "locations": ["Lacona", "Southeast Warren"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Dylan Deemer", "Hunter Tyree", "Pleasantville", "Ethan Worthington", "Sawyer Phillips", "Chaz Clark", "Tyler Hessong", "Gunnar Sampson", "Jackson Fischer", "Booker Beier", "Hunter Rowe", "Lance Hoch", "Alex Hommer", "Keetan Lawler"], "text": "Facebook Email Twitter Google+ LinkedIn Pinterest 16 photos: Southeast Warren hosts Pleasantville Southeast Warren quarterback Keetan Lawler looks for running room as Pleasantville senior Booker Beier gives chase. Southeast Warren hosted Pleasantville for their homecoming game Oct. 9 in Lacona. Post to Facebook 16 photos: Southeast Warren hosts Pleasantville Southeast Warren quarterback Keetan Lawler looks for running room as Pleasantville senior Booker Beier gives chase. Southeast Warren hosted Pleasantville for their homecoming game Oct. 9 in Lacona. Check out this story on desmoinesregister.com: http://dmreg.co/1LmZO6p Cancel Send A link has been sent to your friend's email address. Posted! A link has been posted to your Facebook feed. Join the Conversation To find out more about Facebook commenting please read the Conversation Guidelines and FAQs 16 photos: Southeast Warren hosts Pleasantville Buy Photo Southeast Warren quarterback Keetan Lawler looks for running room as Pleasantville senior Booker Beier gives chase. Southeast Warren hosted Pleasantville for their homecoming game Oct. 9 in Lacona. MICHAEL ROLANDS/RECORD-HERALD Fullscreen Buy Photo Southeast Warren freshman Alex Hommer takes the handoff from senior quarterback Keetan Lawler. Southeast Warren hosted Pleasantville for their homecoming game Oct. 9 in Lacona. MICHAEL ROLANDS/RECORD-HERALD Fullscreen Buy Photo Southeast Warren senior Keetan Lawler fights through the Pleasantville defense. Southeast Warren hosted Pleasantville for their homecoming game Oct. 9 in Lacona. MICHAEL ROLANDS/RECORD-HERALD Fullscreen Buy Photo Southeast Warren senior Keetan Lawler finds an opening against Pleasantville. Southeast Warren hosted Pleasantville for their homecoming game Oct. 9 in Lacona. MICHAEL ROLANDS/RECORD-HERALD Fullscreen Buy Photo Southeast Warren senior Keetan Lawler tries to fight through the tackle of Pleasantville junior Sawyer Phillips and senior Gunnar Sampson. Southeast Warren hosted Pleasantville for their homecoming game Oct. 9 in Lacona. MICHAEL ROLANDS/RECORD-HERALD Fullscreen Buy Photo Southeast Warren junior Jackson Fischer tries to tackle Pleasantville senior Booker Beier. Southeast Warren hosted Pleasantville for their homecoming game Oct. 9 in Lacona. MICHAEL ROLANDS/RECORD-HERALD Fullscreen Buy Photo Southeast Warren senior Lance Hoch returns a kickoff against Pleasantville. Southeast Warren hosted Pleasantville for their homecoming game Oct. 9 in Lacona. MICHAEL ROLANDS/RECORD-HERALD Fullscreen Buy Photo Southeast Warren senior pitches the ball on an option play as Pleasantville senior Ethan Worthington closes in. Southeast Warren hosted Pleasantville for their homecoming game Oct. 9 in Lacona. MICHAEL ROLANDS/RECORD-HERALD Fullscreen Buy Photo Southeast Warren freshman Alex Hommer tries to get past Pleasantville senior Ethan Worthington. Southeast Warren hosted Pleasantville for their homecoming game Oct. 9 in Lacona. MICHAEL ROLANDS/RECORD-HERALD Fullscreen Buy Photo Southeast Warren senior quarterback Keetan Lawler eludes Pleasantville sophomore Chaz Clark. Southeast Warren hosted Pleasantville for their homecoming game Oct. 9 in Lacona. MICHAEL ROLANDS/RECORD-HERALD Fullscreen Buy Photo Southeast Warren senior quarterback Keetan Lawler looks downfield. Southeast Warren hosted Pleasantville for their homecoming game Oct. 9 in Lacona. MICHAEL ROLANDS/RECORD-HERALD Fullscreen Buy Photo Southeast Warren junior Jackson Fischer punts against Pleasantville. Southeast Warren hosted Pleasantville for their homecoming game Oct. 9 in Lacona. MICHAEL ROLANDS/RECORD-HERALD Fullscreen Buy Photo Southeast Warren sophomore Dylan Deemer and senior Keetan Lawler sandwich Pleasantville junior Sawyer Phillips. Southeast Warren hosted Pleasantville for their homecoming game Oct. 9 in Lacona. MICHAEL ROLANDS/RECORD-HERALD Fullscreen Buy Photo Pleasantville sophomore Hunter Tyree has the ball stripped by Southeast Warren sophomore Tyler Hessong. Southeast Warren hosted Pleasantville for their homecoming game Oct. 9 in Lacona. MICHAEL ROLANDS/RECORD-HERALD Fullscreen Buy Photo Southeast Warren junior Hunter Rowe returns a kick against Pleasantville. Southeast Warren hosted Pleasantville for their homecoming game Oct. 9 in Lacona. MICHAEL ROLANDS/RECORD-HERALD Fullscreen Buy Photo Southeast Warren sophomore Dylan Deemer looks for an opening against Pleasantville. Southeast Warren hosted Pleasantville for their homecoming game Oct. 9 in Lacona. MICHAEL ROLANDS/RECORD-HERALD", "external_links": [], "published": "2015-10-10T06:54:00.000+03:00", "crawled": "2015-10-10T12:08:08.733+03:00", "highlightTitle": ""}