{"organizations": ["Hokies", "Virginia Tech", "NC State"], "uuid": "22b6af870c43896520c40c68ebdacd1e9e1a755e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.therepublic.com", "main_image": "http://d1bdhkmqqz901h.cloudfront.net/1200x630/smart/s3.amazonaws.com/hne-smedia/d/4/d42a70707a0340efa6c1c0b111a44bde/web_full_503512800917.jpg", "site_section": "http://therepublic.com//feed/sec/6000", "section_title": "Sports News from TheRepublic.com", "url": "http://www.therepublic.com/view/story/d42a70707a0340efa6c1c0b111a44bde/FBC--Virginia-Tech-Urgency", "country": "US", "title": "Hokies set to take on Wolfpack looking avoid 0-2 ACC start", "performance_score": 0, "site": "therepublic.com", "participants_count": 0, "title_full": "Hokies set to take on Wolfpack looking avoid 0-2 ACC start", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T00:36:00.000+03:00", "replies_count": 0, "uuid": "22b6af870c43896520c40c68ebdacd1e9e1a755e"}, "author": "", "url": "http://www.therepublic.com/view/story/d42a70707a0340efa6c1c0b111a44bde/FBC--Virginia-Tech-Urgency", "ord_in_thread": 0, "title": "Hokies set to take on Wolfpack looking avoid 0-2 ACC start", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Virginia Tech feels sense of urgency vs. NC State, looks to end slide and avoid 0-2 ACC start \nBy HANK KURZ Jr. - AP Sports Writer Published: 10/6/15 5:36 pm EDT - Updated: 10/6/15 5:36 pm EDT \nVirginia Tech is in a familiar spot. \nThe Hokies are coming off a home loss to Pittsburgh in their ACC opener, and getting ready to play an explosive North Carolina State team on Friday night in a game that already seems like a must-win. \n\"I look at every game as a must-win game, definitely at the beginning of ACC play,\" defensive end Ken Ekanem said this week. \"We have to approach this game like professionals and prepare like professionals and make sure we get all our assignments checked, all our assignments checked during practice and get everything down to a T.\" \nThe Hokies (2-3, 0-1 Atlantic Coast Conference) made similar comments after losing at East Carolina two weeks ago, but gave up just enough big plays, and had just enough mistakes, to come up short in a 17-13 loss to Pittsburgh. \nThe Wolfpack (4-1, 0-1) rolled through September unbeaten, then had the same outcome in its ACC opener last weekend against Louisville. The Cardinals won, 20-13, and more league losses this early won't bode well. \n\"Both of us have a lot to be playing for,\" Hokies defensive coordinator Bud Foster said. \nFoster and other coaches sounded a familiar refrain this week to what they have said for the past three mediocre seasons — that the Hokies are just a few made plays away from doing enough to win more games. \nNorth Carolina State coach Dave Doeren had a similar message for his team this week. \n\"When we talked yesterday as a team, I said that to them — I said we've learned that one tough loss can't equal two. If we can't win at Virginia Tech, let's not lose the game because of the last game,\" he said. \"They all understood. Nobody's going to be down on you. Nobody's quitting on you. Nobody's pointing fingers at you.\" \nThe Hokies were historically inept on offense against the Panthers. They allowed quarterback Brenden Motley to be sacked seven times, and finished with just 100 yards on offense, their lowest total since they managed just 60 yards in coach Frank Beamer 's first game in 1987. The sacks left them with 9 rushing yards on 33 carries. \nFullback Sam Rogers said the problem it isn't one player who could be pinpointed at the problem, but pretty much everyone on offense taking turns missing an assignment as the offense floundered. \n\"The way I look at it, everybody needs to cut out one or two plays,\" Rogers said. \"If we do that, we play a lot better. It just looks really bad. I don't think it's alarming in any way. I think we'll be alright. We'll get it straight. We just need to be more disciplined and come back and find a way to get it done.\" \nThe Hokies could be bolstered by the return of quarterback Michael Brewer , who broke his collarbone in the opener against No. 1 Ohio State. He was cleared to practice this week, and was being monitored in practice. \nWhat the Wolfpack has done through five games will surely get the Hokies' attention. \nThey will arrive at Lane Stadium featuring an offense that averages nearly 40 points per game, and does it in a balanced way. N.C. State averages 216 rushing yards per game, and 212 passing yards per game. \nFoster hopes the Hokies can stop the running game first, and then unleash their pass rush when they force the Wolfpack to throw the ball. That pass rush hasn't gotten untracked yet, managing just 10 sacks in five games. \nThis corrects the spelling if Ekanem in the third paragraph. \nThe AP's college football page: http://collegefootball.ap.org \nFollow Hank on Twitter: http://twitter.com/hankkurzjr North Carolina State quarterback Jacoby Brissett (12) passes during the first half of an NCAA college football game against Louisville at Carter-Finley Stadium in Raleigh, N.C., Saturday, Oct. 3, 2015. (Ethan Hyman/The News & Observer via AP) MANDATORY CREDIT \nThink your friends should see this? Share it with them! \nStory copyright 2015   All rights reserved. This material may not be published, broadcast, rewritten or redistributed. \nFeedback, Corrections and Other Requests: AP welcomes feedback and comments from readers. Send an email to info@ap.org and it will be forwarded to the appropriate editor or reporter. Photo Gallery: Click to view (2 Photos) We also have more stories about: (click the phrases to see a list) \nCategory:", "external_links": [], "published": "2015-10-07T00:36:00.000+03:00", "crawled": "2015-10-07T00:41:46.840+03:00", "highlightTitle": ""}