{"organizations": [], "uuid": "8e65628dcb1f7212ca0ca5c2a2b48dfb4bfc7137", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.timesunion.com", "main_image": "http://www.timesunion.com/img/pages/article/opengraph_default.jpg", "site_section": "http://www.timesunion.com/default/feed/default/feed/Sports-News-64.php", "section_title": "Sports News", "url": "http://www.timesunion.com/sports/article/Bills-McCoy-could-miss-3-more-games-6562676.php", "country": "US", "title": "Bills' McCoy could miss 3 more games", "performance_score": 0, "site": "timesunion.com", "participants_count": 1, "title_full": "Bills' McCoy could miss 3 more games - Times Union", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T07:05:00.000+03:00", "replies_count": 0, "uuid": "8e65628dcb1f7212ca0ca5c2a2b48dfb4bfc7137"}, "author": "timesunion.com", "url": "http://www.timesunion.com/sports/article/Bills-McCoy-could-miss-3-more-games-6562676.php", "ord_in_thread": 0, "title": "Bills' McCoy could miss 3 more games", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Orchard Park\nBuffalo Bills running back LeSean McCoy says he could miss another three games because of a pulled left hamstring.\nThat's the timetable McCoy says he was provided by the team's medical staff after he aggravated the injury in a 41-14 win at Miami on Sept. 27. Though calling himself a fast healer, McCoy didn't rule out being sidelined until Nov. 8, when Buffalo returns from its bye week to host Miami.\nMcCoy provided the update Friday after being ruled out from playing at Tennessee this weekend. He called the new injury a \"grade-two pull\" and acknowledged he might have come back from the injury too soon.\nMcCoy was hurt on Aug. 18, and returned for Buffalo's season opener against Indianapolis on Sept. 13.\nGiants: Strong side linebacker Devon Kennard and defensive linemen Robert Ayers Jr. and George Selvie are going to miss the Giants' game Sunday night against the San Francisco 49ers with injuries. Coach Tom Coughlin ruled out the three players and receiver Victor Cruz on Friday after they did not practice. Ayers has missed two straight games with a hamstring injury. Kennard pulled a hamstring last weekend in the win over Buffalo, and Selvie hurt a calf. Cruz has been sidelined all season with a calf injury. Linebacker Jonathan Casillas (calf) and backup cornerbacks Jayron Hosley (concussion) and Trumaine McBride (groin) are questionable for the game. Tight end Jerome Cunningham (knee), tackle Ereck Flowers (ankle) and defensive tackle Markus Kuhn (knee) all practiced and are probable.\nSeahawks: Marshawn Lynch will miss a second straight week for Seattle due to a hamstring strain. The team ruled Lynch out for Sunday's game against the Bengals . Lynch injured his hamstring in the second quarter of the team's 26-0 victory over the Chicago Bears in Week 3. Lynch returned to limited participation in practice on Thursday but is not ready to return.\nTexans: Brian Hoyer has his job back as Houston's starting quarterback. Hoyer won the job out of camp but was pulled in the fourth quarter of a season-opening loss to the Chiefs after committing two turnovers. Ryan Mallett has started since then, but he has struggled and Hoyer took over in both of the last two games as the Texans fell to 1-4. Hoyer replaced Mallett in the second quarter on Thursday night and threw for 312 yards and two touchdowns. He was intercepted by Mike Adams with less than 2 minutes left to help seal the Colts' 27-20 victory.", "external_links": [], "published": "2015-10-10T07:05:00.000+03:00", "crawled": "2015-10-10T08:20:36.358+03:00", "highlightTitle": ""}