{"organizations": [], "uuid": "c8585d6290381c82995cf788bafef73a8b46f6de", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/49161998.cms", "site_section": "http://timesofindia.indiatimes.com/sports/football/champions-league/articlelist/40924344.cms", "section_title": "Top Stories - Champions League - Football - Sports - The Times of India", "url": "http://timesofindia.indiatimes.com/sports/football/champions-league/top-stories/Champions-League-Robert-Lewandowski-nets-hat-trick-as-Bayern-Munich-crush-Dinamo-Zagreb/articleshow/49161971.cms", "country": "IL", "title": "Champions League: Robert Lewandowski nets hat-trick as Bayern Munich crush Dinamo Zagreb", "performance_score": 0, "site": "indiatimes.com", "participants_count": 4, "title_full": "Champions League: Robert Lewandowski nets hat-trick as Bayern Munich crush Dinamo Zagreb - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 3, "uuid": "a4321db031be6a6da761b377fdac0aa492070f85"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/sports/football/champions-league/top-stories/Champions-League-Robert-Lewandowski-nets-hat-trick-as-Bayern-Munich-crush-Dinamo-Zagreb/articleshow/49161971.cms#post-0", "ord_in_thread": 0, "title": "Champions League: Robert Lewandowski nets hat-trick as Bayern Munich crush Dinamo Zagreb", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MUNICH: Robert Lewandowski's phenomenal goal-scoring run continued on Tuesday with a hat-trick in Bayern Munich's 5-0 mauling as Dinamo Zagreb's 45-match unbeaten run was halted in emphatic fashion.\nLewandowski again ran riot in the Champions League home match as Mario Goetze and Douglas Costa also netted to put Bayern top of Group F following their 3-0 win at Olympiakos a fortnight ago before facing Arsenal away in three weeks.\n\"We played in a very concentrated fashion from the start and when you take your goal chances, the game was over after 30 minutes,\" said Bayern captain Philipp Lahm .\nThe Poland hot-shot has now scored 10 goals in his last three games after netting five in just nine spectacular minutes of Bayern's 5-1 hammering of Wolfsburg last Tuesday before claiming two more in Saturday's 3-0 win at Mainz.\n\"I am happy to get three more goals, but the main thing is that we won 5-0,\" said Lewandowski.\n\"It doesn't matter how many goals I score as long as we keep picking up points.\n\"The whole team played well, which creates opportunities for me.\"\nBut with 10 goals in eight days, Lewandowski is in incredible form.\n\"He's had an unbelievable week behind him,\" admitted Lahm, who joked that he expects at least three goals from Lewandowski per game from now on.\nThe thrashing of Zagreb left Bayern three points clear of second-placed Olympiakos in the table following their shock 3-2 win over Arsenal in London.\nThis was Zagreb's heaviest away defeat in Europe as the five-goal difference superseded their 6-2 loss at Real Madrid in the group stages four years ago.\nLewandowski now has 17 goals for club and country as Bayern enjoyed an easy win.\nZagreb's performance made a mockery of their 10-month unbeaten run in all competitions as they only created their first clear shot on goal with an hour gone after Bayern had raced into a 4-0 lead at the break.\nCosta opened the floodgate on 13 minutes by skipping past a defender to beat Zagreb goalkeeper Eduardo at the near post.\nThe second followed on 21 minutes when Dinamo's 18-year-old centre-back Filip Benkovic slipped after heading the ball down, Thiago Alcantara pounced on the error and his pass found Lewandowski in acres of space.\nEduardo's night went from bad to worse when he failed to deal with Goetze's weak shot after an exchange of passes with Kingsley Coman and the ball bobbled over the line to the 33-year-old's dismay on 25 minutes.\nLewandowski claimed his second on 28 minutes when he met Costa's cross and his shot cannoned off the underside of the bar to bounce over the line with the Dinamo defence cut to ribbons.\nLewandowski saved his best goal of the night to claim his hat-trick.\nCosta showed off his dazzling skills with a deft flick to Thiago, who put Lewandowski in behind the defence and the Poland striker scooped the ball over the hapless Eduardo on 55 minutes.\nOnly a good save from the Portugal national goalkeeper prevented Lewandowski getting his fourth when he dived at the striker's feet on 75 minutes.\nShortly after the Croatian double champions had their first corner as they found themselves completely outgunned as Bayern fired in 27 shots on goal to just seven in reply as Lewandowski fired wide with two clear chances.", "external_links": [], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-10-10T17:22:38.453+03:00", "highlightTitle": ""}