{"organizations": [], "uuid": "26b3f53e3f9443771f65504c9a1deb6577d807bc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.baltimoresun.com", "main_image": "http://www.trbimg.com/img-5615a23d/turbine/bs-sp-ravens-chris-givens-1008-20151007", "site_section": "http://www.baltimoresun.com/sports/rss2.0.xml", "section_title": "Sports - Baltimore Sun", "url": "http://www.baltimoresun.com/sports/ravens/bs-sp-ravens-chris-givens-1008-20151007-story.html", "country": "US", "title": "Wide receiver Chris Givens joins Ravens with more than a chip on his shoulder", "performance_score": 0, "site": "baltimoresun.com", "participants_count": 1, "title_full": "Wide receiver Chris Givens joins Ravens with more than a chip on his shoulder", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T01:48:00.000+03:00", "replies_count": 0, "uuid": "26b3f53e3f9443771f65504c9a1deb6577d807bc"}, "author": "Jeff Zrebiec", "url": "http://www.baltimoresun.com/sports/ravens/bs-sp-ravens-chris-givens-1008-20151007-story.html", "ord_in_thread": 0, "title": "Wide receiver Chris Givens joins Ravens with more than a chip on his shoulder", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Jon Meoli) \n\"He can definitely run, he can catch the football, he can run routes,\" Flacco said when asked about his first impression of Givens. \"The biggest challenge is just going to be to get him up to speed and create some kind of comfort level before we go out in a game and make it work. \n\"You can always go out there in a game and make it work game day, but you'd obviously like to have some kind of comfort level before you get to that point, just so you have a little bit of confidence going into it.\" \nGivens promised that the Ravens are getting a motivated and unburdened player who is intent on proving that the Rams erred in not giving him more offensive snaps. The Rams' leading receiver as a rookie in 2012, Givens' productivity and playing time dropped every year. At the time of the trade, he had one catch for seven yards in three games and was playing less than 30 percent of the Rams' offensive snaps. \nAsked if he had a chip on his shoulder, Givens said, \"Oh yeah, I'd call it a potato. \n\"It was very frustrating. I knew I was a guy that could complement the team and play well. I don't know if it wasn't the right fit or they liked other guys or whatever the case may be, because after the first year, my opportunities just went down.\" \nGivens had 42 catches his first year, but that number dropped to 34 in his second season and 11 in his third. Nobody questioned his speed and Givens did average 16.3 yards per reception with the Rams, but St. Louis had a hard time getting him the ball when he was on the field. \nThere were questions about Givens' route running and it didn't help the speedy receiver that the Rams lost starting quarterback Sam Bradford to season-ending injuries in back-to-back years. But the Rams clearly weren't sold on Givens, a fourth-round draft pick in 2012, as a front-line receiving threat. \nThey signed Kenny Britt, who played under head coach Jeff Fisher in Tennessee, as a free agent. They drafted former Dunbar standout Tavon Austin in the first round in 2013 and Stedman Bailey in the third round that same year. They also still looked for opportunities to get Brian Quick, a second-round pick in 2012, more involved in the offense. \nDespite having a strong preseason, Givens entered this year as the team's fourth receiver and immersed in a situation that had clearly beaten him down. He called the trade to the Ravens a \"relief.\" \n\"It just felt like a whole weight was lifted off my shoulders,\" Givens said. \"Now, I can just play football, not worry about anything and just focus on my craft and being the best that I can be.\" \nGivens said he isn't worried about learning the Ravens' offense, maintaining that he'll pick it up quickly just by going to work every day. He's already excited about catching passes from Flacco, who is considered one of the best deep-ball throwers in the NFL. \n\"I love Joe,\" Givens said. \"I've watched Joe for years, he has a strong arm, and I feel like our talents match up and we can complement each other pretty well.\"", "external_links": [], "published": "2015-10-08T01:48:00.000+03:00", "crawled": "2015-10-08T02:05:31.847+03:00", "highlightTitle": ""}