{"organizations": [], "uuid": "2c010b8a6d69c3cdda61378a9084ee0126d97a46", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kentucky.com", "main_image": "https://i.ytimg.com/vi/hqsIbSUIn34/mqdefault.jpg", "site_section": "http://www.kentucky.com/232/index.rss", "section_title": "Kentucky.com -- Sports Update", "url": "http://www.kentucky.com/welcome_page/?shf=/2015/10/16/4091109_high-school-football-scott-countys.html", "country": "US", "title": "'Madness' highlights UK's bright future", "performance_score": 0, "site": "kentucky.com", "participants_count": 1, "title_full": "'Madness' highlights UK's bright future", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T18:40:00.000+03:00", "replies_count": 0, "uuid": "2c010b8a6d69c3cdda61378a9084ee0126d97a46"}, "author": "jtipton@herald-leader.com (Jerry Tipton)", "url": "http://www.kentucky.com/welcome_page/?shf=/2015/10/16/4091109_high-school-football-scott-countys.html", "ord_in_thread": 0, "title": "'Madness' highlights UK's bright future", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "'Madness' highlights UK's bright future By Jerry Tipton jtipton@herald-leader.com October 16, 2015 Updated 2 hours ago 2015-10-17T12:44:52Z \nA quick look at Big Blue Madness. Video by Mark Cornelison | Staff KENTUCKY.COM \nMEN'S UPCOMING DATES \nOct. 21: SEC Media Day \nOct. 27: Blue-White Game \nNov. 2: Exhibition opener vs. Ottawa \nNov. 13: Regular- season opener vs. Albany \nWOMEN'S UPCOMING DATES \nOct. 22: SEC Media Day \nNov. 8: Exhibition game vs. Union (Tenn.) \nNov. 13: Regular- season opener vs. Rice \nDuring his domination proclamation at Big Blue Madness Friday night, Kentucky Coach John Calipari hit on this event's raison d'être. \n\"What does the future hold?\" he said. \nFrom somewhere in the blue-tinged darkness of a jam-packed Rupp Arena, a voice could be heard. \"Everything,\" it said. \nMadness 2015 followed form: A salute to the past. Calipari and the public address announcer reminded everyone that Kentucky possesses the greatest tradition in the history of college basketball. In case anyone missed the point, that message also appeared on a projection cloth that transformed the court into a 94-foot message board/video screen. \nIn memorable fashion, Kentucky unveiled a banner commemorating its appearance in the 2015 Final Four. Laser lights from the other end of the court illuminated the outline of each of the previous 16 banners saluting previous Final Fours in a countdown to 2015. \nA list of past accomplishments included the 38-0 start to last season. \nBut this night was about the future, and the everything that seems within reach. \n\"You all know that playing at Kentucky is about being on the biggest of big stages,\" Calipari told the crowd. \"Playing here is like performing at Carnegie Hall. If you can make it here, you can make it anywhere.\" \nHis goal, he said, was to help players make their dreams come true. \n\"They are the reason those national championship banners are up in those rafters,\" said Calipari, whose latest book, entitled Players First , was on sale in the Rupp Arena lobby. \"They are the individuals we retire jerseys for. They are the reason why thousands of you camp out for a week each year to celebrate them on this night.\" \nRepeating a familiar refrain, Calipari said that if player dreams come true, that will be the prelude to the victories and championships fans crave. \nSean Farnham, one of the announcers on the SEC Network telecast, saw an immediate future full of promise. Maybe not 38-1 good like last season, he said, \"but that doesn't mean they can't hang a banner.\" \nWhile less imposing physically, UK's new edition is faster, said Farnham, who watched the previous two days of practice. \n\"Jamal Murray is a difference-maker,\" Farnham said before the two-hour Madness show began. \"He can do a lot. There's not one aspect of his game I don't like.\" \nThe show, which cost about $300,000 according to Assistant Athletic Director Nathan Schwake, included the familiar: an introduction of the UK women's team, a dance by Coach Matthew Mitchell, cheerleaders tumbling, a strikingly deep dance team dancing. \nThere was also differences. The rapper Drake appeared on a video, but did not attend. UK issued him a cease-and-desist order last year when he posed for a picture with then-UK prospect Charles Matthews. \nThere was more of a corporate presence, thanks to commercials for mattresses, pizza, a soft drink and an auto dealership interrupting the flow. \nUK fans needed no prodding to believe in the immediate future. \nDenise Paul, a fan from Mt. Washington who sat in the second row from the top of Section 232, believed. \"High expectations,\" she said. \"Very high expectations. After last season, we need another great season.\" \nJennifer Bland, a 2012 graduate of Campbellsville University, echoed a sentiment often expressed by Calipari as she waited for Madness in her seat on the top row of Section 230. \nAlthough expecting many victories, she said, \"I don't care about the season. The (NCAA) tournament is all that matters.\" \nNCAA tournaments in 2016 and beyond seemed on Calipari's mind. So, too, perhaps of three top 10 prospects from the class of 2017 who sat and listened: No. 1 Harry Giles, No. 4 De'Aaron Fox and No. 6 Malik Monk. \nAfter noting Kentucky's enduring basketball excellence, Calipari asked the crowd a rhetorical question. \n\"Who wants to be next?\" he said. Then he answered his own question. \n\"This team wants to be next!\" he said before adding, \"And hopefully some other people in this building.\" Jerry Tipton: (859) 231-3227. Twitter: @JerryTipton. Blog: ukbasketball.bloginky.com.", "external_links": [], "published": "2015-10-16T18:40:00.000+03:00", "crawled": "2015-10-17T17:16:46.580+03:00", "highlightTitle": ""}