{"organizations": [], "uuid": "f5dbcb756b2cc45b6b35c99c8ad9b3c74b129297", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailyherald.com", "main_image": "http://www.dailyherald.com/storyimage/DA/20151013/sports/151019497/AR/0/AR-151019497.jpg&amp;updated=201510132156&amp;imageversion=Facebook&amp;exactH=630&amp;exactW=1200&amp;exactfit=crop&amp;noborder", "site_section": "http://www.dailyherald.com/rss/feed/?feed=sports_all", "section_title": "DailyHerald.com &gt; Sports", "url": "http://www.dailyherald.com/article/20151013/sports/151019497/", "country": "US", "title": "Russell says hamstring injury is 'day-to-day'", "performance_score": 0, "site": "dailyherald.com", "participants_count": 1, "title_full": "Russell says hamstring injury is 'day-to-day'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T05:56:00.000+03:00", "replies_count": 0, "uuid": "f5dbcb756b2cc45b6b35c99c8ad9b3c74b129297"}, "author": "Bruce Miles", "url": "http://www.dailyherald.com/article/20151013/sports/151019497/", "ord_in_thread": 0, "title": "Russell says hamstring injury is 'day-to-day'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Cubs will face one key question heading into the National League championship series: the health of shortstop Addison Russell.\nThe rookie felt tightness in his left hamstring as he legged out a triple in Monday's third game of the division series against the Cardinals.\nRussell went for an MRI Tuesday morning, and said after the clinching 6-4 victory that he was \"day-to-day.\"\n\"I'm going to rest up tonight and tomorrow,\" he said. \"We'll see where I am tomorrow. I've got 2-3 days to rest, so that's good, and we'll go from there.\"\nThe Cubs will open the NLCS on the road Saturday.\nIn Tuesday's victory, Javier Baez started at short in place of Russell and hit a 3-run homer in the Cubs' 4-run second inning.\n\"He's never been thrust in that moment before,\" manager Joe Maddon said of Baez. \"I have all the confidence in the world in him. He's an outstanding defender. He's a well-above average defender at third or short or second. He's really good.\"\nTweet this: Veteran catcher Miguel Montero got the Cubs' confidence rolling early this season when he came up with the hashtag #wearegood.\n\"I remember we lost a couple of games in a row,\" Montero said. \"You start reading your Twitters from the fans, and they're like, 'Oh, here it comes again.' I just wanted to send a message to our team, pretty much. I want to let them know what I feel about our team and what I believe about every single guy in our clubhouse. If we don't believe we are good, we are not going to have a chance. So we have to believe it to actually accomplish the goal.\n\"I came up with that. I never thought it was going to actually have the hit that it has, and you know, guys started believing. I guess it's a pretty good business now.\"\nSame as it always is: Joe Maddon has talked since spring training of treating no game as more important than any other so that when the Cubs get to the playoffs, they won't treat it any differently.\nMaddon was asked if he felt Wrigley Field shaking during Tuesday's late innings as the Cubs closed in on victories.\n\"It's like that every game,\" he said. \"You play a postseason game here. It's like, 'OK, it's June 17.' It's always like this. It's great.\"\nThe century mark and counting: With their four postseason victories -- one over the Pirates and three over the Cardinals -- the Cubs have 101 for the regular season and postseason combined.\n\"That's pretty good,\" said Joe Maddon, who referred back to his introductory news conference last November. \"It's pretty significant. I was hoping for 90. When I was popping off at the Cubby Bear, I was thinking 90. I'll take plus 10. Now you're looking for more than that. It's pretty impressive what our guys have done.\"\nRelated Article\nChicago Cubs advance to NLCS with 6-4 win over Cards Get great articles like this sent to your inbox! Click here to sign up for the Cubs Newsletter No Thanks Sports MLB Cubs Baseball Pro Sports Members Get More Newsletter", "external_links": ["https://twitter.com/share"], "published": "2015-10-14T05:56:00.000+03:00", "crawled": "2015-10-14T20:42:40.920+03:00", "highlightTitle": ""}