{"organizations": [], "uuid": "2b700a98cc05772ed22f537264a75dba846f25ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.beaumontenterprise.com", "main_image": "http://ww1.hdnux.com/photos/41/22/30/8726072/3/rawImage.jpg", "site_section": "http://beaumontenterprise.com//otherpubs/collectionRss/Home-HCat-Sports-7274.php", "section_title": "Home HCat Sports", "url": "http://www.beaumontenterprise.com/sports/article/Week-six-HS-Football-highlights-6544653.php", "country": "US", "title": "Week six HS Football highlights", "performance_score": 0, "site": "beaumontenterprise.com", "participants_count": 1, "title_full": "Week six HS Football highlights", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T06:22:00.000+03:00", "replies_count": 0, "uuid": "2b700a98cc05772ed22f537264a75dba846f25ee"}, "author": "Enterprise photo department", "url": "http://www.beaumontenterprise.com/sports/article/Week-six-HS-Football-highlights-6544653.php", "ord_in_thread": 0, "title": "Week six HS Football highlights", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Close Image 1 of 35 \nWest Brook's Nick Sorrell finds an opening in Channelview's defense as he runs the ball during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken Thursday, October 1, 2015 Photo by Kim Brent Photo: Kim Brent West Brook's Nick Sorrell finds an opening in Channelview's defense... Image 2 of 35 \nWest Brook's Joel Denly runs around the side as he carries the ball against Channelview during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken Thursday, October 1, 2015 Photo by Kim Brent Photo: Beaumont Enterprise West Brook's Joel Denly runs around the side as he carries the ball... Image 3 of 35 \nWest Brook's Corry McGill leaps to try for the interception on the pass to Channelview's Anthony Means, who caught it for a touchdown during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken Thursday, October 1, 2015 Photo by Kim Brent Photo: Beaumont Enterprise West Brook's Corry McGill leaps to try for the interception on the... Image 4 of 35 \nWest Brook's student section get in the spirit as they root on the Bruins during their homecoming match-up with Channelview Thursday at the Thomas Center in Beaumont. Photo taken Thursday, October 1, 2015 Photo by Kim Brent Photo: Kim Brent West Brook's student section get in the spirit as they root on the... Image 5 of 35 \nWest Brook's Innis Gaines eyes the action as he and the defense prepare to take over against Channelview during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken Thursday, October 1, 2015 Photo by Kim Brent Photo: Kim Brent West Brook's Innis Gaines eyes the action as he and the defense... Image 6 of 35 \nWest Brook's Missial Tovar kicks off the ball to Channelview during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken Thursday, October 1, 2015 Photo by Kim Brent Photo: Kim Brent West Brook's Missial Tovar kicks off the ball to Channelview during... Image 7 of 35 \nWest Brook's Channelview's during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken Thursday, October 1, 2015 Photo by Kim Brent Photo: Kim Brent West Brook's Channelview's during Thursday night's match-up at the... Image 8 of 35 \nWest Brook's David Chassion pumps up the crowd as they battle Channelview during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken Thursday, October 1, 2015 Photo by Kim Brent Photo: Kim Brent West Brook's David Chassion pumps up the crowd as they battle... Image 9 of 35 \nWest Brook's fans make their way to the stands as the sun sets before the Bruins' game against Channelview during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken Thursday, October 1, 2015 Photo by Kim Brent Photo: Kim Brent West Brook's fans make their way to the stands as the sun sets... Image 10 of 35 \nWest Brook's Justin Essex hands off the ball to Joel Denly as they battle Channelview during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken Thursday, October 1, 2015 Photo by Kim Brent Photo: Kim Brent West Brook's Justin Essex hands off the ball to Joel Denly as they... Image 11 of 35 \nWest Brook's Channelview's during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken Thursday, October 1, 2015 Photo by Kim Brent Photo: Kim Brent West Brook's Channelview's during Thursday night's match-up at the... Image 12 of 35 \nWest Brook's Channelview's during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken Thursday, October 1, 2015 Photo by Kim Brent Photo: Kim Brent West Brook's Channelview's during Thursday night's match-up at the... Image 13 of 35 \nWest Brook's dance team lines up before taking the field during Thursday night's match-up with Channelview at the Thomas Center in Beaumont. Photo taken Thursday, October 1, 2015 Photo by Kim Brent Photo: Beaumont Enterprise West Brook's dance team lines up before taking the field during... Image 14 of 35 \nWest Brook's head coach Kevin Flanigan awaits the game start with Channelview during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken Thursday, October 1, 2015 Photo by Kim Brent Photo: Beaumont Enterprise West Brook's head coach Kevin Flanigan awaits the game start with... Image 15 of 35 \nWest Brook's head coach Kevin Flanigan gives starters advice before taking the field against Channelview during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken Thursday, October 1, 2015 Photo by Kim Brent Photo: Beaumont Enterprise West Brook's head coach Kevin Flanigan gives starters advice before... Image 16 of 35 \nWest Brook's Gracie Prause shares a moment in-between cheers alongside Sparkle Team member Michael Littlefield as they gear up for the homecoming bout against Channelview during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken Thursday, October 1, 2015 Photo by Kim Brent Photo: Kim Brent West Brook's Gracie Prause shares a moment in-between cheers... Image 17 of 35 \nWest Brook's fans enjoy the pre-game activities before facing Channelview during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken Thursday, October 1, 2015 Photo by Kim Brent Photo: Kim Brent West Brook's fans enjoy the pre-game activities before facing... Image 18 of 35 \nWest Brook's dance squad lines up before taking the field as the Bruins face Channelview during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken Thursday, October 1, 2015 Photo by Kim Brent Photo: Kim Brent West Brook's dance squad lines up before taking the field as the... Image 19 of 35 \nWest Brook's fans enjoy the pre-game activities before facing Channelview during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken Thursday, October 1, 2015 Photo by Kim Brent Photo: Kim Brent West Brook's fans enjoy the pre-game activities before facing... Image 20 of 35 \nWest Brook's Bruins burst onto the field to face Channelview during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken Thursday, October 1, 2015 Photo by Kim Brent Photo: Kim Brent West Brook's Bruins burst onto the field to face Channelview during... Image 21 of 35 \nWest Brook's dance team joins in the school song before their homecoming match-up with Channelview Thursday night at the Thomas Center in Beaumont. Photo taken Thursday, October 1, 2015 Photo by Kim Brent Photo: Kim Brent West Brook's dance team joins in the school song before their... Image 22 of 35 \nWest Brook's Gracie Prause cheers alongside Sparkle Team member Michael Littlefield as they gear up for the homecoming bout against Channelview during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken Thursday, October 1, 2015 Photo by Kim Brent Photo: Kim Brent West Brook's Gracie Prause cheers alongside Sparkle Team member... Image 23 of 35 \nWest Brook's fans enjoy the pre-game activities before facing Channelview during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken Thursday, October 1, 2015 Photo by Kim Brent Photo: Kim Brent West Brook's fans enjoy the pre-game activities before facing... Image 24 of 35 \nWest Brook's Channelview's during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken Thursday, October 1, 2015 Photo by Kim Brent Photo: Kim Brent West Brook's Channelview's during Thursday night's match-up at the... Image 25 of 35 \nWest Brook's Jacoby Harris dives to try and stop Channelview's Jalen Hurts during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken Thursday, October 1, 2015 Photo by Kim Brent Photo: Kim Brent West Brook's Jacoby Harris dives to try and stop Channelview's... Image 26 of 35 \nWest Brook's fans enjoy the pre-game activities before facing Channelview during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken Thursday, October 1, 2015 Photo by Kim Brent Photo: Kim Brent West Brook's fans enjoy the pre-game activities before facing... Image 27 of 35 \nWest Brook's fans take in the pre-game activities before facing Channelview during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken Thursday, October 1, 2015 Photo by Kim Brent Photo: Kim Brent West Brook's fans take in the pre-game activities before facing... Image 28 of 35 \nWest Brook's homecoming court make their way onto the field during Thursday night's match-up with Channelview at the Thomas Center in Beaumont. Photo taken Thursday, October 1, 2015 Photo by Kim Brent Photo: Kim Brent West Brook's homecoming court make their way onto the field during... Image 29 of 35 \nWest Brook's dance team takes the field during Thursday night's match-up with Channelview at the Thomas Center in Beaumont. Photo taken Thursday, October 1, 2015 Photo by Kim Brent Photo: Kim Brent West Brook's dance team takes the field during Thursday night's... Image 30 of 35 \nWest Brook's dance team awaits entry onto the field as they get ready to face Channelview during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken Thursday, October 1, 2015 Photo by Kim Brent Photo: Kim Brent West Brook's dance team awaits entry onto the field as they get... Image 31 of 35 \nWest Brook's varsity line up before facing Channelview during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken Thursday, October 1, 2015 Photo by Kim Brent Photo: Kim Brent West Brook's varsity line up before facing Channelview during... Image 32 of 35 \nWest Brook's homecoming court takes the field before the Bruins face Channelview during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken Thursday, October 1, 2015 Photo by Kim Brent Photo: Kim Brent West Brook's homecoming court takes the field before the Bruins... Image 33 of 35 \nWest Brook's fans enjoy the pre-game activities before facing Channelview during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken Thursday, October 1, 2015 Photo by Kim Brent Photo: Kim Brent West Brook's fans enjoy the pre-game activities before facing... Image 34 of 35 \nWest Brook's Bruins burst onto the field to face Channelview during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken Thursday, October 1, 2015 Photo by Kim Brent Photo: Kim Brent West Brook's Bruins burst onto the field to face Channelview during... Image 35 of 35 Week six HS Football highlights 1 / 35 \nGet your high school football photos and scores here. Southeast Texas sports news", "external_links": [], "published": "2015-10-02T06:22:00.000+03:00", "crawled": "2015-10-02T06:56:38.195+03:00", "highlightTitle": ""}