{"organizations": [], "uuid": "c83f4f0c1fdea0ed5bd51c313b7238db4830aaf0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wcax.com", "main_image": "http://images.worldnow.com/AP/images/8909945_G.jpg", "site_section": "http://www.wcax.com/category/13537/business-news", "section_title": "Business &amp; economy news - WCAX.COM Local Vermont News, Weather and Sports-", "url": "http://www.wcax.com/story/30148107/republican-field-pushes-tax-cuts-bound-to-drive-up-debt", "country": "US", "title": "Republican field pushes tax cuts bound to drive up debt", "performance_score": 0, "site": "wcax.com", "participants_count": 1, "title_full": "Republican field pushes tax cuts bound to drive up debt - WCAX.COM Local Vermont News, Weather and Sports-", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "c83f4f0c1fdea0ed5bd51c313b7238db4830aaf0"}, "author": "wcax.com", "url": "http://www.wcax.com/story/30148107/republican-field-pushes-tax-cuts-bound-to-drive-up-debt", "ord_in_thread": 0, "title": "Republican field pushes tax cuts bound to drive up debt", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By NICHOLAS RICCARDI\nAssociated Press DENVER (AP) - Republicans came into this presidential campaign with painful memories of how, in the last one, Democrats blasted Mitt Romney's tax plan as a giveaway to the rich.\nYet Donald Trump's tax plan adds to the number of major GOP presidential candidates who propose to cut all taxes - but especially those for the wealthy - as deeply, or deeper, than Romney proposed.\nThe lesson Republicans seem to have drawn is to simply stop worrying about balancing the budget. The plans would blow open deficits over the next decade that economists estimate ranging from $3.6 trillion to $12 trillion.\nOren Cass, who was Romney's domestic policy adviser, noted the former Massachusetts governor had pledged to make his tax cuts deficit-neutral by cutting tax loopholes, though he never fully detailed how his plan would do so. Yet he was still savaged by Democrats who accused him of planning to stiff middle-class ratepayers for the benefit of the rich.\n\"You look at what Gov. Romney did and you say, 'There's nothing to be gained from being responsible that way,' \" Cass said. \"You may as well do the plan that your base is going to love.\"\nTrump initially hinted he might buck conservative economic orthodoxy and raise taxes on the wealthy. But he ended up releasing the most aggressive tax cut of all candidates to date.\nThe Tax Foundation, which favors lower taxes, estimated that his plan would increase the deficit by $12 trillion. The foundation found more than one-fifth of the plan's benefit would accrue to the top 1 percent of income earners.\nTrump's plan pointed to the enduring power of traditional conservative thinking - that lower taxes are the best way to spark growth, and any skew toward the wealthy is mainly a reflection of the outsized amount of taxes the rich already pay.\n\"Even for Trump, it's hard to be different,\" said Martin Sullivan, chief economist for the nonpartisan research group Tax Analysts. \"The new flavor is a lot of tax benefits at the low end and then much more on the high end.\"\nWith his trademark showmanship, Trump vowed to remove families making less than $50,000 from the tax rolls and allow them to send the IRS a single-page form declaring \"I win!\"\nFormer Florida Gov. Jeb Bush's plan is less flamboyant but reduces rates and raises standard deductions enough to remove those families making $40,000 and under from the rolls. Florida Sen. Marco Rubio, meanwhile, would increase the child tax credit and lower the rate for families making less than $150,000 to 15 percent.\nStill, Rubio would eliminate taxes on investment gains, which is how most of the affluent make most of their money, and Bush would lower top rates dramatically as well. Both of their plans are skewed to the wealthy, like Trump's, but less so.\nCriticism of tax proposals that benefit the wealthy grates on conservative economists. They note that the top 1 percent already pays more than a third of federal income taxes, so any large reduction would inevitably benefit them anyhow.\nThey also argue that, by goosing the economy, the benefits from well-designed tax cuts would spread out more equitably through the economy.\nStill, Democrats are poised to exploit the issue.\n\"Each one of these candidates has a tax plan that would rip a multi-trillion-dollar hole in the federal deficit, which would likely have to be offset by cuts to programs important to the middle class, including Social Security, Medicare, infrastructure and education,\" said Eric Walker, a spokesman for the Democratic National Committee. \"We need a tax system that rewards work instead of just wealth.\"\nThat sort of sound bite gnawed at Romney in 2012.\nThis time, the Republican tactic is to shrug off the slam on the deficit, said Kyle Pomerleau, an economist at the Tax Foundation.\n\"Republican candidates aren't looking to be revenue-neutral\" anymore, he said. \"They're saying 'let's cut taxes for everyone so we're not accused of raising taxes for everyone.' \"\n___\nAssociated Press writer Jeff Horwitz contributed from Washington.\nCopyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-10-05T17:21:49.735+03:00", "highlightTitle": ""}