{"organizations": [], "uuid": "c885329998fecefe07c065703d5200374f45502c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.detroitnews.com", "main_image": "http://www.gannett-cdn.com/-mm-/93305f9d83b1403528a9978e0d919f7aed0259c4/c=0-113-3340-2000&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/08/DetroitNews/B99312526Z.1_20151008204529_000_GO7JTP4E.1-0.jpg", "site_section": "https://feeds.feedblitz.com/detroit/sports", "section_title": "Detroit News - Sports", "url": "http://www.detroitnews.com/story/sports/nhl/red-wings/2015/10/08/excitement-high-wings-prepare-seasons-start/73621704/", "country": "US", "title": "Excitement high as Wings prepare for season’s start", "performance_score": 0, "site": "detroitnews.com", "participants_count": 2, "title_full": "Excitement high as Wings prepare for season’s start", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T09:08:00.000+03:00", "replies_count": 1, "uuid": "325d492c0db908aeb2d098042176faef8e12c912"}, "author": "detroitnews.com", "url": "http://www.detroitnews.com/story/sports/nhl/red-wings/2015/10/08/excitement-high-wings-prepare-seasons-start/73621704/#post-0", "ord_in_thread": 0, "title": "Excitement high as Wings prepare for season’s start", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Johan Franzen jokes around, working on his celebration technique after scoring against goalie Petr Mrazek during Red Wings practice at Joe Louis Arena in Detroit, Michigan on October 8, 2015. Detroit opens the season Friday night against the Toronto Maple Leafs.  Daniel Mears, Detroit News Fullscreen Detroit Red Wings first year head coach Jeff Blashill works with players during practice.  Daniel Mears, Detroit News Fullscreen Goalie Jimmy Howard keeps his eye on the puck, making a save on Drew Miller during drills.  Daniel Mears, Detroit News Fullscreen Darrren Helm tries to stuff the puck past goalie Petr Mrazek in net.  Daniel Mears, Detroit News Fullscreen Goalie Petr Mrazek makes a stick save on a shot during drills.  Daniel Mears, Detroit News Fullscreen Goalie Petr Mrazek makes a save with Justin Abdelkader and Luke Glendening battling in front of the net.  Daniel Mears, Detroit News Fullscreen Goalie Jimmy Howard follows the puck from the tip of Gustav Nyquist's stick right to his glove for a save during drills.  Daniel Mears, Detroit News Fullscreen Goalie Jimmy Howard follows the puck from the tip of Gustav Nyquist's stick right to his glove for a save during drills.  Daniel Mears, Detroit News Fullscreen Detroit Red Wings last practice before the season opener against the Toronto Maple Leafs Friday night at Joe Louis Arena.  Daniel Mears, Detroit News Fullscreen Detroit Red Wings Jeff Blashill calls out drills during plays.  Daniel Mears, Detroit News Fullscreen Red Wings goalie Jimmy Howard stands tall in the net during a shot during drills.  Daniel Mears, Detroit News Fullscreen Luke Glendening and Justin Abdelkader are all smiles after battling one-on-one during drills.  Daniel Mears, Detroit News Fullscreen Nineteen year old Dylan Larkin works the puck in front of goalie Petr Mrazek during drills.  Daniel Mears, Detroit News Fullscreen Detroit Red Wings Jeff Blashill works with players during practice.  Daniel Mears, Detroit News Fullscreen Detroit Red Wings goalie Petr Mrazek. Detroit Red Wings practice at Joe Lo  Daniel Mears, Detroit News Fullscreen Goalie Jimmy Howard makes a save on Luke Glendening during drills.  Daniel Mears, Detroit News Fullscreen Joakim Andersson works the puck around the net with goalie Petr Mrazek in net.  Daniel Mears, Detroit News Fullscreen Detroit Red Wings Jeff Blashill works the practice ice during drills.  Daniel Mears, Detroit News Fullscreen Goalie Jimmy Howard keeps his eye on the puck, making a save on Drew Miller during drills.  Daniel Mears, Detroit News Fullscreen Tomas Tatar works in front of goalie Jimmy Howard who makes the glove save during drills.  Daniel Mears, Detroit News Fullscreen Gustav Nyquist looks for an opening against goalie Petr Mrazek in net.  Daniel Mears, Detroit News Fullscreen Right winger Tomas Jurco moves without the puck during practice.  Daniel Mears, Detroit News Fullscreen Tomas Tatar's shot gets brushed aside by goalie Petr Mrazek to his surprise as players continued to play after practice ended.  Daniel Mears, Detroit News Fullscreen Johan Franzen goofs around, working on his celebration technique after scoring against goalie Petr Mrazek during drills.  Daniel Mears, Detroit News Fullscreen Detroit Red Wings Jeff Blashill works with players during practice.  Daniel Mears, Detroit News Fullscreen Red Wings goalie Jimmy Howard takes a breather during practice.  Daniel Mears, Detroit News Fullscreen Players play some 'small ice' hockey with the goals brought closer together during drills at practice.  Daniel Mears, Detroit News Fullscreen Landon Ferraro puts a shot on goalie Petr Mrazek during Red Wings practice at Joe Louis Arena.  Daniel Mears, Detroit News Fullscreen Swedish born defensemen Jonathan Ericsson and Niklas Kronwall have some fun with a Swedish television station, Sveriges Television, interviewing the two after practice.  Daniel Mears, Detroit News Fullscreen Like this topic? You may also like these photo galleries: Replay Autoplay Show Thumbnails Show Captions Last Slide Next Slide Rookie Dylan Larkin, 19, works the puck in front of goalie Petr Mrazek during drills Thursday at Joe Louis Arena. (Photo: Daniel Mears, Detroit News) \n1 CONNECT 9 TWEET LINKEDIN COMMENT EMAIL MORE Detroit — Jeff Blashill talks about feeling it in the room and folks approaching him around town to talk about it.\nThere is a sense this year, on the eve of a new season, with the Red Wings opening tonight against the Maple Leafs and Mike Babcock, that excitement and optimism are greater than in the recent past.\n“Yes, yes. I can sense that a little bit,” said Blashill, who is to appear as a coach in the NHL for the first time tonight.\n“I was in a youth hockey rink last night watching my 9-year-old playing squirt hockey — his team won, by the way — and I was approached by a number of different people.\n“There was people I knew that are fans, there are people I didn’t know that walked up.\n“I think there’s just an excitement level to get the season going. I think there’s a good expectation, an anticipation, of what this team could do.”\nWhile he allowed that similar feelings likely flourish in most NHL cities in North America, there is something a little different in Detroit this second week of October.\n“I think the fans have a good sense of what we feel internally that if we do the right things, we could be a very good team,” he said.\n“We also recognize how close the league is, so we’re going to have to do the right things.”\nOn the ice during practices, it is noticeable the chirping is more lively and the cheers at the end of some of Blashill’s new drills more enthusiastic and easy to muster than in recent years.\nDETROIT NEWS\nRed Wings' Blashill cautious on line shuffling\nA new coach. A couple free agents capable of making a difference. Two good goaltenders pushing each other.\nYoung guys a season more experienced.\nAnd, almost incredibly, given the history of choosing the roster for a couple decades, a 19-year-old scoring threat. And he carries himself like a 29-year-old.\n“Yeah, I think between the new players and (Dylan) Larkin coming in as a 19-year-old, I think there’s some good story lines,” said Justin Abdelkader, who exploded offensively last season with 23 goals.\n“But, I think we just approach it the same way.\n“We’re looking forward to getting things kicked off, here, at home. We think we have the opportunity to have a really good season.\n“I think we’ve had a good training camp, a good preseason. The guys are ready to go.”\nAbdelkader, who like Larkin and Luke Glendening grew up in Michigan wanting to play for the Red Wings, said he, too, has noticed a bit more buzz among the fans this year.\n“Yeah, I think the fans are really excited,” he said. “I think they’ve seen the last three years.\n“Between losing to Chicago in Game 7 and Tampa — one of those teams went on to win the Stanley Cup and one lost — I think they can see that this group is very close.\n“I think they’re optimistic about the young players coming up and the growth of our young players. And the veterans are still playing well and contributing a lot.\n“So, yeah, we’re really optimistic.\n“But so are a lot of other teams. So we know it’s going to be tough.”\nDETROIT NEWS\nKindl OK'd for Wings' opener, Ouellet demoted\nTomas Tatar said even just the annual first game at Joe Louis Arena is a thrill.\n“The opening night is real special, you know?” he said. “You’ve been waiting all summer to get the season started.\n“It’s really special when you see all those Red Wings fans in the same spot again, too.\n“Introducing the players, I think it all has a special feeling, for sure.”\nFrom his team, Blashill said he is looking for two ingredients that can be enormously effective, and yet has not been as big a part of the Red Wings repertoire the past four seasons — efficiently launching a sustained attack.\n“For us to be a really good hockey team, I think for any hockey team to be good, you want to get the puck out of your end,” Blashill said.\n“Toronto’s going to make it real hard on us. They’re going to pressure us hard.\n“So we’ve got to do a real good job of managing the puck and getting it out of our end.”\nFrom there, he said, it is a matter of controlling the puck to achieve geographic superiority.\n“Ultimately, you want to spend as much time in the other team’s end as possible,” he said. “So, we’re going to have to do a good job on our forecheck and create turnovers, and then spending O-zone time.”\nNewly acquired free agent Mike Green, a right-handed-shooting defenseman with a persistent record, when healthy, of offensive accomplishment, is a big part of the excitement, especially given his ability to launch the attack.\n“I think that’s maybe in the job description, to try to bring some offense,” Green said.\n“I’m just trying to find my place, here, within the team.\n“Obviously, an incredible foundation. I’m just trying to sort of fit in and maybe bring a little more to the puzzle.”\ngregg.krupa@detroitnews.com \ntwitter.com/greggkrupa \nMaple Leafs at Red Wings \nFaceoff: 7:30 p.m. Friday, Joe Louis Arena, Detroit\nTV/radio: FSD/97.1\nOutlook: The Red Wings start their campaign for a 25th consecutive playoff appearance with a new, young coach and significant free-agent acquisitions — D Mike Green and C Brad Richards . ... The Maple Leafs roster suggests they will not make the playoffs, but players say they notice a difference from last season playing for former Red Wings coach Mike Babcock .", "external_links": [], "published": "2015-10-09T09:08:00.000+03:00", "crawled": "2015-10-09T13:51:36.672+03:00", "highlightTitle": ""}