{"organizations": ["GNPC"], "uuid": "578f52ea62b9734b1cb50246e1c9aad5b360abc0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://www.modernghana.com/logo/final_log.png", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=2&gender=1", "section_title": "Sports News", "url": "http://www.modernghana.com/sports/646218/2/gnpc-to-support-athletics-development.html", "country": "US", "title": "GNPC to support athletics development", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "GNPC to support athletics development", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T01:00:00.000+03:00", "replies_count": 0, "uuid": "578f52ea62b9734b1cb50246e1c9aad5b360abc0"}, "author": "", "url": "http://www.modernghana.com/sports/646218/2/gnpc-to-support-athletics-development.html", "ord_in_thread": 0, "title": "GNPC to support athletics development", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sports News | 30 September 2015 23:00 CET GNPC to support athletics development By GNA \nKumasi, Sept. 30, GNA - The Ghana National Petroleum Corporation (GNPC) has signalled its determination to offer support to the promotion of athletics in the country. \nMr. Jonathan Ato Kobbie, Senior Officer in-charge of External Affairs, said it would assist to create the right environment and incentive packages to raise the standard. \nThe GNPC, he said had no doubt that given the required infrastructure and incentives, the nation could win more laurels at international competitions. \nA lot of talents abound, particularly at the grassroots, which should be tapped to 'our benefit'. \nMr. Kobbie, who was speaking to the GNA Sports on the sidelines of the 2015 Ghana's Fastest Human (GFH) competition in Kumasi, cited huge benefits to the economies of countries, which had invested in this sporting discipline and said that should provide the appetite and the inspiration. \nThe competition was organized under the auspices of the Ghana Athletics Association and the National Sports Authority with sponsorship by the GNPC. \nCompetitors from different age groups - under 10, 13 and 18 years as well as senior athletes were on hand to race for honours in the 100-metres event. \nThe competition was initiated by Reks Brobby, a former Ghanaian national athlete, three years ago, as an annual talent-hunt event to produce potential 100-metres champions at the international level. \nThe last time Ghana made any significant achievement in the sprints was in 1974 when the legendary Ohene Karikari won a Bronze medal at the Olympic Games in New Zealand. \nMr. Kobbie said his organization's decision to partner organizers of the GFH competition was a demonstration of its desire to motivate young athletes to get to the top of sporting careers. \n'We have a mission to advance this noble cause as Ghana has what it takes to make an impact on the international scene', he added. \nHe noted that sports generally was important to helping the youth to remain discipline and to embrace the sense of team work. \nGNA", "external_links": [], "published": "2015-10-01T01:00:00.000+03:00", "crawled": "2015-10-01T07:05:35.317+03:00", "highlightTitle": ""}