{"organizations": ["Associated Press", "NCAA", "AP", "Badgers"], "uuid": "b190d0a0d8d895ed4295a3d6de04ff45d26fdfcf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.htrnews.com", "main_image": "http://www.gannett-cdn.com/-mm-/4ff6af74efe6c3af1c50378abd02737896acb064/c=0-19-1793-1032&amp;r=x633&amp;c=1200x630/local/-/media/2015/09/29/WIGroup/Appleton/635791594091418410-WIS-Taiwan-Deal-0930.jpg", "site_section": "http://rssfeeds.htrnews.com/manitowoc/sports", "section_title": "Manitowoc - Sports", "url": "http://www.htrnews.com/story/sports/2015/09/29/valders-outlasts-roncalli-rally/73068812/", "country": "US", "title": "Badgers find offense as Iowa looms", "performance_score": 0, "site": "htrnews.com", "participants_count": 0, "title_full": "Badgers find offense as Iowa looms", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T04:39:00.000+03:00", "replies_count": 0, "uuid": "b190d0a0d8d895ed4295a3d6de04ff45d26fdfcf"}, "author": "", "url": "http://www.htrnews.com/story/sports/2015/09/29/valders-outlasts-roncalli-rally/73068812/", "ord_in_thread": 0, "title": "Badgers find offense as Iowa looms", "locations": ["Wis.", "Taiwan", "Madison", "Hawaii", "Wisconsin", "Iowa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Morry Gash", "Jahlani Tavai", "Gaetano DeMattei", "Morry"], "text": "Badgers find offense as Iowa looms Associated Press 8:39 p.m. CDT September 29, 2015 Morry Gash/Associated Press Taiwan Deal of Wisconsin tries to run between Hawaii?s Jahlani Tavai and Gaetano DeMattei on Saturday in Madison. Deal rushed for a career-high 147 yards in the Badgers? 28-0 victory. Wisconsin's Taiwan Deal tries to run between Hawaii's Jahlani Tavai (31) and Gaetano DeMattei during the first half of an NCAA college football game Saturday, Sept. 26, 2015, in Madison, Wis. (AP Photo/Morry Gash) (Photo: Morry Gash, AP) 1 CONNECT TWEET LINKEDIN COMMENT EMAIL MORE \nMADISON — No. 19 Wisconsin has its running game going again, piling up a season-best 326 yards in 54 attempts in last week’s 28-0 victory over Hawaii. \nThe timing couldn’t have been any better with the Badgers (3-1) opening the Big Ten season against Iowa (4-0) at Camp Randall Stadium this weekend. \n“We’ve got some young guys running the ball behind us. We’ve got some young guys on the O-line,” starting left tackle Tyler Marz said of the running attack, which entered the game against Hawaii with the lowest rushing average in the Big Ten. “Reps is the most important thing and they’re getting that whether it’s in practice or in the game settings.” \nFreshman tailback Taiwan Deal earned Big Ten Freshman of the Week honors after rushing for a career-high 147 yards and two touchdowns against Hawaii in his first starting assignment. \nDeal capped the Badgers’ longest scoring drive of the season of 97 yards on the opening drive with a 2-yard plunge. It marked the Badgers’ longest scoring drive since Montee Ball finished a 97-yard drive with a 1-yard TD run against Northern Illinois on Sept. 17, 2011. \nDeal and junior tailback Dare Ogunbowale, who ran for 85 yards and a touchdown, helped the Badgers gain a season-high 512 yards of total offense against Hawaii. \nThat one-two punch helped take the sting out of the loss of No. 1 tailback Corey Clement, who will miss four to six weeks with a sports hernia that required surgery. \n“I think the running game is just getting better every week,” quarterback Joel Stave said. “We did a good job really sticking to it the past couple of weeks and kind of pushing it and eventually getting some big runs.” \nThe Badgers’ running game will face a tough test against an Iowa defense that is one of two schools yet to allow a rushing touchdown (Navy is the other). \nIowa has allowed an average of 84.0 rushing yards per game, fourth best in the Big Ten and 12th nationally. \n“I think they’ve got very good players and I think that they understand and know their scheme, and I think the scheme is a good scheme,” Badgers coach Paul Chryst said. “Any time you’ve got a good scheme with good players, it makes a good defense.” \nStave said the renewal of the rivalry with Iowa - with the winner earning the Heartland Trophy -- presents a great challenge to open Big Ten play. \n“They’re physical. They’re always in the right spot. They’re running hard to the ball,” Stave said. “They’re a hard-nosed physical team and we are, too. That’s what’s fun about conference play and what’s fun about playing these guys.” 1 CONNECT TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http://post.cr/1FCncwk TOP VIDEOS", "external_links": [], "published": "2015-09-30T04:39:00.000+03:00", "crawled": "2015-10-03T11:26:41.833+03:00", "highlightTitle": ""}