{"organizations": [], "uuid": "6d2a642d7a9fe8e880fed8bf279c8b8788db0c69", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kctv5.com", "main_image": "http://RAYCOMGROUP.images.worldnow.com/images/8992768_G.jpg", "site_section": "http://kctv5.com//category/208603/sports?clienttype=rss", "section_title": "KCTV Kansas City - Sports", "url": "http://www.kctv5.com/story/30234829/what-we-learned-from-the-sec-in-week-6", "country": "US", "title": "What We Learned from the SEC in Week 6", "performance_score": 0, "site": "kctv5.com", "participants_count": 1, "title_full": "What We Learned from the SEC in Week 6 - KCTV5", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T16:23:00.000+03:00", "replies_count": 0, "uuid": "6d2a642d7a9fe8e880fed8bf279c8b8788db0c69"}, "author": "Brian Tynes", "url": "http://www.kctv5.com/story/30234829/what-we-learned-from-the-sec-in-week-6", "ord_in_thread": 0, "title": "What We Learned from the SEC in Week 6", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(RNN) – This year may go down as the year of close calls.\nOne week after the top 10 was deconstructed and rebuilt, it looked like it might happen again. The Nos. 2, 4 and 5 teams each had major scares but ultimately survived in the final minutes.\nNo. 2 TCU mounted a comeback in the second half to escape with a 52-45 win over Kansas State, No. 4 Michigan State topped Rutgers 31-24 after the Scarlet Knights spiked the ball on fourth down rather than attempt a Hail Mary and No. 5 Utah got six turnovers to win 30-24 over No. 23 California.\nThe biggest upset of the week was No. 10 Oklahoma falling to unranked Texas 24-17. Texas was 1-4 entering the game and head coach Charlie Strong was in danger of being booted from the job less than two years after he took it. He's still in danger of that depending on what happens the rest of the year, but the win earned him some temporary safety.\nNo. 13 Northwestern got embarrassed by resurgent No. 18 Michigan 38-0, No. 17 Southern Cal continued to show the Pac 12 is in complete disarray with a 17-12 loss to Washington and No. 19 Georgia, well, we'll get to that in a minute.\nThe season is just getting warmed up, because next week will feature three games of teams in the top 15, two of which will feature teams in the top 10, assuming Florida takes Oklahoma's spot in the rankings. Those games are (ranks as of last week) No. 4 Michigan State at No. 18 Michigan, No. 8 Alabama at No. 9 Texas A&M and No. 11 Florida at No. 7 LSU.\nHere's a look at what we learned from watching SEC games in Week 6.\n1. Leonard Fournette is as classy as he is talented. Major flooding in South Carolina led to a surreal sight this week with South Carolina wearing road jerseys in a home game at a half-empty Tiger Stadium.\nCarolina Band couldn't make the game, so The Golden Band from Tigerland learned South Carolina's alma mater and played it during pregame while spelling \"LSU\" on the field. An LSU fan who usually paints the Tiger eye logo on his body instead painted himself with a Gamecock.\nThe outcome, however, was as familiar as it could be as No. 7 LSU (5-0, 3-0) rolled 45-24. Leonard Fournette became the first player to reach 1,000 yards on the ground this season with 158 of the Tigers' 396 rushing yards and a touchdown, which significantly lowered his yards per game average.1\nBut the best performance by Fournette was his decision to auction off his game-worn jersey to help provide relief to the flood victims in South Carolina. After the game, Fournette read from a prepared statement comparing the floods to Hurricane Katrina, which displaced him and his family, and offering his \"prayers, condolences and empathy.\"\nA few weeks ago, I said college football needs more in-fighting like the feud between Bret Bielema and Kliff Kingsbury. Well, it needs more of this too.\n2. The NCAA did what the NCAA does. Where there is a good deed by a student-athlete, there also is the NCAA to tell him it's illegal.\nShortly after Fournette said he would auction that jersey, he said he was informed that it was an NCAA violation to do so. But the NCAA said it would allow it, with the minimal amount of approval possible.\nLeonard Fournette can auction his jersey for SC flood victims.\n— NCAA (@NCAA) October 11, 2015 The NCAA will always do the right thing after trying all the wrong things first. As long as an athlete isn't profiting from the jersey sale, auctioning it off for a recognized charity shouldn't be a question a legality and a clause to allow that should be implemented in the NCAA rulebook immediately.\nThe NCAA earned itself some good PR that had been prior negated by the bad PR it got for the same issue and countless previous issues. With that in mind, I'd like to help the NCAA be less awful in the future. Here's an outline statement they (and any conference or team) can release in regard to future issues, provided free of charge:\nThe NCAA commends the actions of for his/her support of and will authenticate and help facilitate the sale of his/her uniform and ensure the money raised is delivered in full as soon as possible. Additionally, the NCAA will match any and all funds raised through this effort. We encourage all our member conferences and institutions to do the same.\nIs that really so hard?\n3. Georgia did what Georgia does … again. Mark Richt. Bruh. Get it together.\nIn two weeks, Georgia has gone from SEC East frontrunner, SEC champion contender and potential playoff team to a total outsider in freefall mode.\nAs bad as Georgia's 38-10 loss to Alabama was last week, in some ways its 38-31 loss to Tennessee was worse. It's a loss to a division opponent, a second SEC loss so the Bulldogs don't control their own destiny any more, they blew a 21-point lead and Nick Chubb suffered an ugly knee injury.\nEven though Chubb went out on the first play of the game, you can't blame the loss on that. Sony Michel had 145 yards on the ground and Georgia (4-2, 2-2) opened a 24-3 lead before immediately giving it back. Tennessee scored 28 unanswered points from late in the second quarter to the end of the third quarter, including two quick scores in the final minute before halftime.\nIt isn't known how long Chubb will be out with the injury , though it's thought he won't require surgery. He did, however, lose consciousness on the sideline ans his mother said he tore his PCL and two other ligaments.\n4. You can't run on Alabama. On 25 attempts, Alabama allowed just 44 rushing yards to Arkansas. Running is the only thing Arkansas does well and that proved true in the Tide's 27-14 win.\nAlex Collins was the SEC's No. 3 rusher entering the game and despite getting only 26 yards, he still is. On the other side, Derrick Henry rushed for 95 yards and a touchdown, setting an Alabama record for consecutive games with a touchdown scored.\nTennessee gains 222 yards per game (21st nationally) while LSU averages 335 (third nationally). Alabama's defense is fourth nationally against the run allowing 77 yards per game. There's a good chance looking at those numbers will determine the outcomes of both those games and the SEC West champion.\nBut first, Alabama (5-1, 2-1) has to get past Texas A&M. The Aggies (5-0, 2-0) aren't much of a running threat so the Tide's secondary is going to be working overtime. In the past, that's not been a good thing.\n5. Jim McElwain is the coach of the year. After a 21-3 win over Missouri, Florida is well on its way to a historic turnaround. The Gators' next two games are with LSU and Georgia, and wins in both could vault them into playoff position.\nMcElwain has flipped a five-loss team that earned a bottom-tier bowl into an undefeated potential playoff contender without really changing anything the Gators do. They just do it a lot better now.\nTheir next challenge is against the nation's top running back in Fournette. Florida's defense is second in the SEC and 12th nationally against the run, allowing 99.2 yards per game. LSU's defense is right behind them, allowing 99.6.\nThat favors the Tigers, because Florida's offense has been pretty average, preferring to let the defense handle the heavy lifting, especially with the pass rush. LSU is similar numbers-wise, except in the running game. Its offense behind Fournette has been the deciding factor in every game so far. Even if Florida (6-0, 4-0) can limit Fournette, that just brings LSU down to an even level.\nMcElwain has the reputation as an offensive guru, but it's so far been his work with the defense that's made the biggest impact. If he's got some offensive tricks up his sleeve, this will be the week to use them.\n6. Ole Miss is on autopilot. There's not a lot that can be said about a 52-3 win over New Mexico State. Ole Miss (5-1, 1-1) has been in that situation a lot this season with a 76-3 win over Tennessee-Martin and a 73-21 win over Fresno State.\nThe Rebels picked up their win over Alabama, but then struggled with Vanderbilt and got whipped by Florida. Next up is Memphis. Of the Rebels' first seven games, only two should garner more than a passing glance at the final score.\nBecause of that, it's still a little difficult to know where they stand. Ole Miss got five turnovers in the six-point win over Alabama and gave up four in the 28-point loss to Florida. Their defense is a respectable 36th nationally, and their offense is 11th.\nBut those numbers are from six games with four against teams that weren't tough competition. It's still another two weeks before we get a good read on them against Texas A&M and another four weeks before they play another team with fewer than two SEC losses.\n7. Tennessee is lurking. The Vols may not factor into the SEC East race, but they threw a big curveball into the mix with the win over Georgia.\nTennessee (3-3, 1-2) is in a similar boat with Mississippi State. Both beat teams they are supposed to beat and lose to teams they are supposed to lose to, but Tennessee has the penchant for pulling a surprising upset. Georgia in particular has struggled with the Vols. The Bulldogs haven't beat Tennessee by more than one score since 2010 despite being demonstrably better each year.\nJosh Dobbs made the difference this week with 312 yards passing and three touchdowns and 118 yards rushing and two touchdowns. He's a better Dak Prescott than Dak Prescott. As long as he's in control the Vols are a contender, even though they will need some help.\n8. Missouri is not a contender. Missouri has three players in the top 10 in the SEC at their position. Miles Garrett leads the conference with 7.5 sacks. The other two are the kicker and punter.\nMissouri (4-2, 1-2) has only scored 11 offensive touchdowns in six games. In the conference, only South Carolina and Vanderbilt have fewer. And no SEC punter has made more punts than Missouri's Corey Fatony. He has five more attempts than the two players tied for second - Tennessee's Trevor Daniel and Florida's Johnny Townsend.\nMy favorite stat is when a punter has more yards than his team's offense, and Fatony was close to doubling Missouri's offense in the loss to Florida. He had nine punts for 430 yards while the Tigers' offense only had 257 yards. (Townsend did it for Florida too, with nine punts for 395 yards compared to 337 yards of offense).2\nUnless the Tigers can get some offense going soon, they may struggle to be bowl eligible.\n9. #Karma is not done with Bret Bielema. Bielema is perpetually snake-bit since coming to the SEC. He had a lot of success with Wisconsin before coming south and Arkansas had been good before he got there. But since then, it's been a steady slog of mediocrity.\nArkansas has won a total of three SEC games in two-plus years under Bielema and a lot of them have played out the way the loss to Alabama did. The Hogs (2-4, 1-2) had a 7-3 lead for almost a full quarter, but then saw it turn into a 13-point deficit in the span of six minutes.\nArkansas held its own for three quarters, but then gave up a big pass play, tried to fake a punt in their own territory and failed and then threw an interception. Outcoaching yourself is never a good tactic.\n10. Some serious coaching turnover could be in the future. Richt and Bielema are likely facing curtain calls if they can't right the ship. Richt is the longest-tenured coach in the SEC, but he's growing in unpopularity by the minute due to meltdowns in important games.3\nBielema is going to need one heck of a run to close out the season to get another year. The same is true for Vanderbilt's Derrick Mason. Vandy has been awful since he took over last year.\nThere's been speculation for years that 70-year-old South Carolina coach Steve Spurrier is nearing the end of his usefulness and with the Gamecocks in serious trouble of missing a bowl, this would be a good time to bow out.\nAnd, of course, there's always the chance Nick Saban leaves for any coaching job anywhere in the world.\nExtra points: 1 He's off record pace, but still averaging 204 yards per game. And in what is sure to be the only time this season this will be written, Fournette did not lead the Tigers in rushing yards or touchdowns. That was Derrius Guice with 161 yards and Darrel Williams with two touchdowns.\n2 He also out-punted Missouri's offense in the win over Arkansas State (299 to 282). This really is a fun stat to monitor. Take Kent State's Anthony Melchiori, for instance. He leads all NCAA punters with 50 punts and 2,032 punting yards. In six games, he has out-punted his team's offense three times and came within two yards of it in a fourth. He also out-punted both offenses twice in games against Illinois and Marshall.\n3 Accusing the media of being fans of your opponent isn't a good look, either, but Richt wasn't afraid to go there after a question about repeated injuries to his players.\n\"What We Learned\" is a weekly column examining SEC football from an off-kilter perspective. Feel free to dispute any and all statements made herein on Twitter at @BNT_RNN . Follow the feed while you're at it. Occasionally it can be humorous and/or informative. \nCopyright 2015 Raycom News Network. All rights reserved.", "external_links": [], "published": "2015-10-11T16:23:00.000+03:00", "crawled": "2015-10-11T21:20:45.404+03:00", "highlightTitle": ""}