{"organizations": [], "uuid": "be4d241b044d7f446db4fee4d2ff50f65020c36f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "", "site_section": "http://bostonherald.com/sports", "section_title": "Sports | Boston Herald", "url": "http://bostonherald.com/sports/celtics_nba/nba_coverage/2015/10/wolves_coach_names_zach_lavine_starting_shooting_guard", "country": "US", "title": "Wolves coach names Zach LaVine starting shooting guard", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "Wolves coach names Zach LaVine starting shooting guard | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "be4d241b044d7f446db4fee4d2ff50f65020c36f"}, "author": "Associated Press", "url": "http://bostonherald.com/sports/celtics_nba/nba_coverage/2015/10/wolves_coach_names_zach_lavine_starting_shooting_guard", "ord_in_thread": 0, "title": "Wolves coach names Zach LaVine starting shooting guard", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MINNEAPOLIS — Zach LaVine has gone from slam dunk champion to starting shooting guard for the Minnesota Timberwolves.\nInterim coach Sam Mitchell named LaVine the starter Wednesday, before the Wolves had even played a preseason game. The Wolves opened the preseason on Wednesday night against the Oklahoma City Thunder, but Mitchell said he was making the decision now with an eye toward the long-term health of the franchise, not the immediate future.\n\"It's not necessarily about earning (the spot),\" Mitchell said, \"it's about where you are as an organization and where you're trying to go.\"\nThe 20-year-old LaVine is entering his second season in the league. He won the dunk contest at All-Star weekend as a rookie, but has impressed Mitchell with his work ethic in training camp. LaVine is part of a young core along with Andrew Wiggins, Shabazz Muhammad, Karl-Anthony Towns, Ricky Rubio and Gorgui Dieng that the Timberwolves hope will finally drag them out of an abyss that is going on 11 years.\n\"I feel like I proved myself throughout training camp,\" LaVine said. \"I've had a really good training camp and I'm just out to prove something.\"\nLaVine has been one of the more impressive players in training camp to this point, and he gets the nod over the 32-year-old Kevin Martin, one of the best shooters in the NBA.\nOn media day Martin made it clear that he still viewed himself as one of the best shooting guards in the league and expected to remain in the starting lineup. He only played 39 games last season because of injuries, but still averaged 20.0 points and shot 39 percent from 3-point range.\nA few days after he made those comments, Martin softened his stance after a conversation with Mitchell and GM Milt Newton.\n\"I let them know that I'm never going to be a guy that chases a ring,\" Martin said. \"I want to be a part of a family type of atmosphere and that's something that we're doing here. We all had good talks about that. We'll just go from there.\"\nMitchell said he understands if Martin is not happy with the decision. But he expects Martin to continue to be a professional and compete.\n\"I'm not saying Kevin has to accept it with a smile on his face, but it's just where we are as an organization,\" Mitchell said. \"It just is what it is.\"", "external_links": [], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T15:22:44.157+03:00", "highlightTitle": ""}