{"organizations": [], "uuid": "c491dc4162efa6a7e71c321b7ee68cde62df5082", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.cntv.cn", "main_image": "", "site_section": "http://english.cntv.cn/service/rss/13/index.xml", "section_title": "CCTV.com - Sports Video", "url": "http://english.cntv.cn/2015/10/23/VIDE1445577000840141.shtml", "country": "US", "title": "UK coaches help train Chinese youths", "performance_score": 0, "site": "cntv.cn", "participants_count": 0, "title_full": "UK coaches help train Chinese youths", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T08:15:00.000+03:00", "replies_count": 0, "uuid": "c491dc4162efa6a7e71c321b7ee68cde62df5082"}, "author": "", "url": "http://english.cntv.cn/2015/10/23/VIDE1445577000840141.shtml", "ord_in_thread": 0, "title": "UK coaches help train Chinese youths", "locations": ["UK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "UK coaches help train Chinese youths \nCCTV.com   \nPresident Xi Jinping's visit to Man City is expected to emphasize bilateral cooperation that someday may help this country become a world football power. One of those efforts, the Premier Skills Program, has sent a number of British coaches to China the past half dozen years -- not to train pro players -- but instead to develop young talent and their instructors. \nA very busy field and many sweating young players. It's a common scene every afternoon at the Anwai Erxiao Primary School. \nThese students just love football ... it's not about winning a game or becoming professional players ... for them, it's the adrenaline rush of running on the field, training with their teammates, and understanding the football culture. \nThe school has bigger ambitions to allow the sports accessible for more youth. And they got help from the British coaches. In June, these students and their trainers bonded with the British coaches under the \"Premier Skills\" program. \n\"The coach talked very slowly in English to let us understand.\" \n\"He was very patient to us. You just need to ask him questions when you are confused.\" \n\"He squatted down when he was speaking to us.\" \n\"They are very precise and dedicated. Their training methods are systematic,\" Beijing Anwai Ertiao School coach Hei Jingfeng said. \n\"We learned a lot from the British coaches on their communicating methods with the young students. They take full consideration of the different needs from the students. This is out of their respect for each individual,\" Beijing Anwai Ertiao School principal Cheng Hong said. \nThe \"Premier Skills\" program was jointly launched by the Premier League and the British Council. \nSince 2009, the program has trained over 1,100 coaches across 13 Chinese cities. Over half-a-million young students have benefited from this program. \nThe program has become a highlight of the booming China-UK people-to-people exchanges. Prince William, the Duke of Cambridge, went to Nanyang High School in Shanghai in March, to check out the students training regime during his China visit. And Chinese Vice Premier Liu Yandong, attended events on bilateral football cooperation last month in the UK. The two governments agreed to do more. \n\"The UK government has agreed to coach next to 5,000 teachers. The British Council has signed agreements with Chinese sports organizations to send 200 teachers a year over to the UK to spend a few months in universities studying about wider sports, education, teaching methodology, sports nutrition, and psychology,\" Jim Addison, counsellor of British Embassy in China, said. \nThat means up to 5 million young students in China will stand to benefit in the next 5 years. The British Council -- in cooperation with the UK’s Department for Culture, Media, and Sports -- and their Chinese counterparts, also launched a new initiative named \"tomorrow stars,\" to help young talents in the soccer field. A common goal by the two governments of not only improving the skills for young football players, but also make the British national sport a special bond linking the two nations.", "external_links": [], "published": "2015-10-23T08:15:00.000+03:00", "crawled": "2015-10-23T11:41:08.658+03:00", "highlightTitle": ""}