{"organizations": [], "uuid": "b0e1a3f9206e24c6f8da398957d38ff0508fdc8b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pendletontimespost.com", "main_image": "", "site_section": "http://pendletontimespost.com//feed/sec/6000/", "section_title": "PendletonTimesPost.com - Sports News", "url": "http://www.pendletontimespost.com/view/story/f6fdad94a3af4c81a5375eb4e2e49043/FBN--Eagles-Receivers/", "country": "US", "title": "Agholor, Cooper miss practice for Eagles", "performance_score": 0, "site": "pendletontimespost.com", "participants_count": 0, "title_full": "Agholor, Cooper miss practice for Eagles", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T23:59:00.000+03:00", "replies_count": 0, "uuid": "b0e1a3f9206e24c6f8da398957d38ff0508fdc8b"}, "author": "", "url": "http://www.pendletontimespost.com/view/story/f6fdad94a3af4c81a5375eb4e2e49043/FBN--Eagles-Receivers/", "ord_in_thread": 0, "title": "Agholor, Cooper miss practice for Eagles", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Eagles wide receivers Nelson Agholor, Riley Cooper both miss practice THE ASSOCIATED PRESS   4:59   4:59   \nPeople: \nPhotos: \nPhiladelphia Eagles wide receiver Riley Cooper (14) goes down after being hit by New York Giants defensive back Trevin Wade (31) during the second half of an NFL football game, Monday, Oct. 19, 2015, in Philadelphia. (AP Photo/Matt Rourke) \nPhiladelphia Eagles tight end Brent Celek, left, and wide receiver Riley Cooper celebrate Cooper's touchdown catch against the New York Giants during the first half of an NFL football game, Monday, Oct. 19, 2015, in Philadelphia. (AP Photo/Michael Perez) \nPHILADELPHIA — Philadelphia Eagles wide receivers Nelson Agholor and Riley Cooper both sat out of practice for the second consecutive day on Thursday, putting in doubt their availability for Sunday night's game against the Carolina Panthers . \nAgholor, the 2015 first-round draft pick from the University of Southern California, suffered a leg injury when the Eagles beat the New Orleans Saints on Oct. 11. He missed Monday's win over the New York Giants . \nCooper suffered a knee injury in that win over the Giants, although he did return to the game. \n\"(Agholor) is doing things with Shaun (Huls, the director of sports science) and he's coming along,\" Eagles coach Chip Kelly said. \"I don't know, really, what his status will be this weekend. It's kind of up in the air. But he's progressing and working hard at it.\" \nIf neither Agholor nor Cooper can go against the Panthers, the Eagles would be left with slot receiver Jordan Matthews, who leads the team with 36 receptions and 384 yards, Josh Huff (11 receptions, 136) and veteran Miles Austin (seven catches, 133 yards) as their top three receivers. They also have special teams stalwart Seyi Ajirotutu, but he has played just three offensive snaps all season. \n\"Cooper is a big target down the field for us,\" Eagles quarterback Sam Bradford said. \"He has a good feel for those backside throws. I like throwing it out there to him.\" \nWhat the Eagles did for part of the Giants game when Cooper was out was go with some two tight-end formations with Zach Ertz and Brent Celek. That moved Matthews outside from the slot, while Huff, who was also bothered by a knee injury, and Austin split snaps on the other side. \n\"We were thin a little bit for a little while at receiver,\" Kelly said about Monday night's game. \"But Jordan can play any position for us, outside receiver, left side, right side, or inside.\" \nMatthews, who played outside for most of his college career at Vanderbilt, says he has no problem leaving the slot for a wide post. \n\"I love playing outside,\" Matthews said. \"When I came to the NFL, I was predominantly an outside receiver, who played some slot. Then I came here and I was predominantly in the slot. Now, I'm getting some opportunities to go back outside, so I'm back in that comfort zone I had when I got here. \n\"There is a little bit of a change and getting used to it again, but it's kind of like riding a bike. So I'll be fine.\" \nAP NFL website: http://www.pro32.ap.org and AP NFL Twitter feed:www.twitter.com/AP_NFL \nAll content copyright ©2015 Pendleton Times-Post, a division of Home News Enterprises unless otherwise noted.", "external_links": [], "published": "2015-10-22T23:59:00.000+03:00", "crawled": "2015-10-23T01:12:23.531+03:00", "highlightTitle": ""}