{"organizations": ["James River Water Trail"], "uuid": "73789a5a221abf5f1fcca0772de0bd86395516cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news-leader.com", "main_image": "http://www.gannett-cdn.com/-mm-/89379ae435d7faaff192254aa93a6506d12b0405/c=75-0-4989-2776&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/16/Springfield/Springfield/635806038227595766-SNLBrd-04-16-2015-NewsLeader-1-C001-2015-04-15-IMG-IMG-Lead-cover-photo-1-1-33AGU49V-L596317004-IMG-IMG-Lead-cover-photo-1-1-33AGU49V.jpg", "site_section": "http://rssfeeds.news-leader.com/springfield/sports", "section_title": "Springfield - Sports", "url": "http://www.news-leader.com/story/sports/college/msu/2015/10/16/one-nations-best-running-backs-and-2-other-things-bears-face-saturday/74046838/", "country": "US", "title": "Five great spots (near Springfield) to see fall colors", "performance_score": 0, "site": "news-leader.com", "participants_count": 0, "title_full": "Five great spots (near Springfield) to see fall colors", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T01:27:00.000+03:00", "replies_count": 0, "uuid": "73789a5a221abf5f1fcca0772de0bd86395516cb"}, "author": "", "url": "http://www.news-leader.com/story/sports/college/msu/2015/10/16/one-nations-best-running-backs-and-2-other-things-bears-face-saturday/74046838/", "ord_in_thread": 0, "title": "Five great spots (near Springfield) to see fall colors", "locations": ["Springfield", "Lake Springfield"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jason Bogema", "Noah", "Wes Johnson"], "text": "Five great spots (near Springfield) to see fall colors Wes Johnson , News-Leader 5:27 p.m. CDT October 16, 2015 Tandem kayakers enjoy a stretch fall colors along the James River Water Trail northeast of Lake Springfield. Jason Bogema, with son Noah in front, paddles a quiet stretch of the James River Water Trail on a sunny fall afternoon last week. Wes Johnson/News-Leader (Photo: file photo) 138 CONNECT 7 TWEET LINKEDIN 1 COMMENT EMAIL MORE \nFriday night's deep chill down to the mid 30s should help kick off fall colors in the Ozarks in a big way. \nLeaves already are beginning to glow red, gold, orange or purple, foretelling the changing of the seasons. \nA good way to track the fall colors as they progress across Missouri is through the Missouri Department of Conservation's Mo Fall Colors app , available for free online at mdc.mo.gov. The app shows real-time images of trees turning color in Missouri, GPS coordinates to find the best viewing spots, and updates on where the best colors are showing up. \nIt's not hard to find beautiful trees in glorious fall plumage. But here are five great spots to experience fall in all its glory within an hour or so of Springfield: \nThe foliage at Maple Park Cemetery has started changing colors as cooler weather arrives. (Photo: File photo) \nTopping the list and so easy to see is Maple Park Cemetery in the heart of Springfield, on Grand Street, between Campbell and Jefferson avenues. The cemetery is filled with maple trees, which arguably produce the most vivid colors of any tree in the Ozarks. \nMaple leaves always contain bright red pigments, but they're hidden by green chlorophyll during the tree's growing season. Come fall, the chlorophyll fades, allowing the maple leaf's brilliant hues to glow. \nTrees are aglow with color along the James River Water Trail along Springfield's east side. (Photo: File photo) \nHiking trails and paddling trips on the James River offer great ways to get outdoors and experience the fall colors. \nWalking trails at the Springfield Conservation Nature Center take wanderers down to the river's edge, where sycamores, oaks and ash trees already are beginning to turn from green to yellow, orange and gold. \nSplash your canoe or kayak at Lake Springfield and follow the James River Water Trail five miles upstream to enjoy trees changing color along the shoreline. \nThe cold, blue waters of Ha Ha Tonka Spring emerge from a towering rock bluff. (Photo: File photo) \nAnother beautiful fall hike among the trees, the trails at the 3,751-acre Ha Ha Tonka State Park an hour and 20 minutes northeast of Springfield are a great place to see the changing trees and towering karst cliffs up close. \nThis summer, the park and its historic stone castle ruins was voted fourth best state park in the nation by readers of USA Today. Not to be missed: The deep blue Ha Ha Tonka spring that pours 58 million gallons of water a day into a forest stream from the base of a massive vertical stone wall. \nIf you're up for a vigorous walk, Cedar Gap Conservation Area in Wright County is just 30 minutes east of Springfield, south of U.S. 60 highway. \nFall leaves reflect in a crystal clear pool of water at Cedar Gap Conservation Area. (Photo: File photo) \nThe moderately strenuous hiking trail takes visitors downhill through oaks, pines and dogwood trees to a gurgling clear creek that forms the headwaters of Bryant Creek. The first half is all downhill and takes hikers to a small log cabin that once was a fishing and hunting getaway for the previous landowner. \nVisitors are surrounded by tall, steep hills, and one of them is the second-highest prominence in Missouri. Be ready for a workout going back uphill, and wear sturdy boots. \nAn abundance of tree species will be changing color at Mizumoto Stroll Garden at Nathanael Greene/Close Memorial Park. (Photo: File photo) \nFor a much less grueling (and more kid-friendly) fall outing, take a stroll on the paved walkways at Nathanael Greene/Close Memorial Park on Springfield's west side. The tops of the park's trees are already changing color, especially around urban Lake Drummond. \nThe geese will want a snack, but visitors are encouraged not to feed them. And for a huge variety of color, walk a short distance to the Springfield-Greene County Botanical Center and the Mizumoto Japanese Stroll Garden, which features hundreds of species of trees and plants. All areas are free.", "external_links": [], "published": "2015-10-17T01:27:00.000+03:00", "crawled": "2015-10-19T09:40:38.950+03:00", "highlightTitle": ""}