{"organizations": [], "uuid": "4f5c31599b4b1178ddd392e5d310ccb292725a63", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nydailynews.com", "main_image": "http://assets.nydailynews.com/polopoly_fs/1.2404657!/img/httpImage/image.jpg_gen/derivatives/landscape_1200/583449915tk00013-30th-annua.jpg", "site_section": "http://www.nydailynews.com/sports/index.html", "section_title": "Sports News &amp; Articles: Today’s Latest Sports News - NY Daily News", "url": "http://www.nydailynews.com/sports/football/ray-lewis-dressed-part-2000-murder-article-1.2404654", "country": "US", "title": "Ray Lewis: I was too well dressed to be part of 2000 murder", "performance_score": 1, "site": "nydailynews.com", "participants_count": 1, "title_full": "Ray Lewis: I was too well dressed to be part of 2000 murder - NY Daily News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "4f5c31599b4b1178ddd392e5d310ccb292725a63"}, "author": "NEW YORK DAILY NEWS", "url": "http://www.nydailynews.com/sports/football/ray-lewis-dressed-part-2000-murder-article-1.2404654", "ord_in_thread": 0, "title": "Ray Lewis: I was too well dressed to be part of 2000 murder", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mike Coppola Former Ravens linebacker Ray Lewis says he's guilty of dressing too well, not murder. Former Ravens linebacker Ray Lewis insists that he could not have taken part in the murder of two men in 2000 because he was not dressed for the part.\nLewis was convicted of obstruction of justice in relation to the stabbings of Richard Lollar and Jacinth Baker outside an Atlanta nightclub in January 2000. Both men died from their wounds. Their murders remained unsolved.\nIn his new book, \"I Feel Like Going On,\" Lewis maintains that he was not involved, according to TMZ.com.\n\"Remember, I was dressed out, had my jewelry on, my fine mink coat,\" Lewis writes. \"I wasn't about to start mixing it up looking like that. That's the general rule of thumb when you're doing the town and looking good. The nicer you're dressed, the less inclined you are to get in a fight -- that is, if you're even inclined in that way to begin with.\"\nLewis, who is now an NFL analyst for ESPN, added that \"gangbangers\" approached his entourage at one point. Gunshots were soon fired.\n\"There I was, all dressed out in my mink coat, my fine suit,\" Lewis writes. \"Dude dresses like that, he's not looking for a fight. How I was dressed, it made no sense with what went down, those shots being fired, all of that. Forget what kind of statement my clothes might have made. Forget that I might have been a little loud, over the top. Point is, when you're dressed like that, you're off to the sidelines, and here were these gangbangers stepping out to us from the shadows, looking to make trouble -- but it was trouble we drove right past.\"", "external_links": [], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-20T23:53:20.177+03:00", "highlightTitle": ""}