{"organizations": [], "uuid": "8799ce7ae770891e5e2ef1a7fcdbaeae6b7c182e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.yankton.net", "main_image": "http://bloximages.chicago2.vip.townnews.com/yankton.net/content/tncms/assets/v3/editorial/b/25/b25b4548-6d6a-11e5-a878-bbbc24e10333/5615df9919fc1.image.jpg?resize=760%2C570", "site_section": "http://www.yankton.net/search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&nsa=eedition&c%5B%5D=sports,sports/*&f=rss", "section_title": "Yankton Press & Dakotan - sports,sports/", "url": "http://www.yankton.net/sports/article_f2125512-6d6c-11e5-9b8d-930e9c313b0f.html", "country": "US", "title": "Legacy Of Hawk Remains Strong", "performance_score": 0, "site": "yankton.net", "participants_count": 1, "title_full": "Legacy Of Hawk Remains Strong", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T06:30:00.000+03:00", "replies_count": 0, "uuid": "8799ce7ae770891e5e2ef1a7fcdbaeae6b7c182e"}, "author": "JEREMY HOECK jeremy.hoeck@yankton.net", "url": "http://www.yankton.net/sports/article_f2125512-6d6c-11e5-9b8d-930e9c313b0f.html", "ord_in_thread": 0, "title": "Legacy Of Hawk Remains Strong", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Legacy Of Hawk Remains Strong BY JEREMY HOECK jeremy.hoeck@yankton.net yankton.net | 0 comments \nMany homes across Yankton feature some kind of ‘Go Bucks!’ sign or ‘Go Gazelles!’ sign in the front yard. \nBut one house in particular in this neighborhood has a sign on the garage that reads ‘Yankton Buck Dr.’ \nThis is where Max Hawk lives. \nThis is the home of the 82-year-old former Yankton High School football coach who retired 21 years ago with 284 career victories, 18 conference titles and 10 state championships. \nIt was obvious on this afternoon that Hawk, still very visible on the Yankton athletic scene, is still surrounded by his legendary career. \nDown in the basement of his home lies what a former Press & Dakotan sportswriter, the late Hod Nielsen, called the “wall of fame.” And I see what he meant. \nDuring the course of our nearly 2-hour chat, Hawk took me down in the basement to show me all of his memorabilia. Lining one wall are plaques, framed certificates, photos, team photos and gifts from over the years. \nAfter his wife, Jane, painted the walls, all of the items came down. Most are back up now, but there are still others in hidden locations throughout the basement – some in boxes, a couple in a drawer and some stacked on a desk. \n“There’s so much stuff, I can’t keep track of it all,” Hawk says while crossing the room. \nThat’s what happens when you coach for 38 years. Items tend to pile up. And yet, each item in this basement holds special significance for Hawk, who last coached a football game in 1994. \nAs I came to find out during my first-ever lengthy conversation with Hawk, behind that at-times rough, old-football-general exterior lies a kind, sentimental soul. \nHe’s a man who takes great pride in what he did, but at the same point isn’t beyond acknowledging that he fell into the right position in Yankton back in 1965. \n“Everything just kind of fell into place for me,” he says at one point. \nStill revered by Yankton football fans and former players, Hawk joked during the start of our conversation that he realizes I was probably only there because his wins record is about to fall. \nSioux Falls O’Gorman coach Steve Kueter – who spoke at Hawk’s retirement party in 1994 – tied Hawk’s record with 284 wins after a 35-0 victory last Friday night in Yankton, of all places. Kueter will go for the record on Friday night when his Knights play at Rapid City Stevens. \nWhen it came time for me to ask him about that, Hawk gave his by-now standard answer: “Records are made to be broken.” \nHe’s also quick to point out – mostly joking – that he hasn’t won a game in 21 years, yet his record still stood for all these years. He also proudly points out that he will still have the record for public-school victories. \nTaking The Reins \nThis fall marks 50 years since Hawk – a native of Wessington Springs and native of Northern State University – took over the Yankton football program. \nThough, as he will tell you, he once said no to a coaching position in Yankton. \nAfter a successful eight-year stint at Scotland High School (where he won 52 games), Hawk wanted something more. He wanted to move up the ladder, to a larger school. He reached out to a number of schools across South Dakota and was later interviewed for a varsity assistant position in Yankton. \nThat wasn’t exactly what he had in mind, Hawk said. \n“I didn’t want to be an assistant, I had been a head coach,” he said. “I thanked them for thinking of me.” \nA month later, the Yankton job – previously held by Jack Richardson – opened up, and Hawk was asked to come to Yankton for an interview. He was offered the position and accepted. \nHis legacy was about to begin. \n“When I came here, I thought it was the best high school football job in South Dakota,” Hawk said. “They had a good reputation. They backed their athletic teams real well.” \nLittle did Hawk realize, he would vault the Yankton football program to the ranks of perennial title contender during the next 30 years. \nHe still jokes, however, that the culture – administration support, fan support, etc. – was such that just about anyone could have led the Bucks. \n“Anyone with any sense could have come in here and made them a winner,” Hawk said, smiling. \nInstead, Hawk took the reins and for all but one season over the next 30 years, he guided the Yankton Bucks to a winning record. \nHis teams, known for the punishing Wing-T offense, pummeled teams across the Eastern South Dakota Conference and Hawk’s teams would go on to win 10 state titles – including those years where final rankings determined a “mythical” champion. He was also named the National High School Coaches Association coach of the year in 1986. \nWhen South Dakota, through a lawsuit (with the assistance of guys like Hawk, Bob Burns, Jerry Miller and Dale McElhaney), finally adopted a playoff system for football, Hawk’s teams won state championships at the DakotaDome in Vermillion in 1982, 1984 and 1994 (his final season). \nWell ahead of that final season, however, fans knew Hawk would done after 1994. He had made the announcement two years earlier, partly because – as he jokes now – it would have made it harder for him to change his mind. \n“I didn’t necessarily want to back out, but I thought that would help,” Hawk said, smiling. \nHanding Over The Reins \nOne of Hawk’s new assistant coaches during that final season in 1994 wasn’t exactly a rookie. \nThe newcomer had directed Hamlin to three consecutive state titles (1989-91), but became a mouse in the corner down in Yankton. \nHis name was Arlin Likness. \nLikness had spent the previous 15 seasons at Hamlin and came to Yankton with the understandable idea that he was approaching veteran status in the coaching world. He then arrived in Yankton to find names like Hawk (37 years by that point), Jim Miner (30+ years) and Ray Kooistra (30+ years). \n“All of a sudden, I look around and think, ‘These guys have a hundred years of experience, and I’ve got 15. There’s a lot that can be learned here,’” Likness said this week. \n“My biggest contribution was learning and motivating kids.” \nThere were also some play-calling duties for Likness. \nHe remembers one time in particular that first season where he called a quarterback keeper to the far side of the field (the opposite of what became the Hawk staple). The play went for a long gain, but as Likness says smiling, Hawk wasn’t exactly the most thrilled. \nThat 1994 season would conclude in dramatic fashion, as the Bucks beat Rapid City Stevens in a double-overtime thriller in the state championship – one still referred to as perhaps the best title game in South Dakota history. \nAnd just like, Hawk’s legendary career was over. He was leaving as a champion. \nPartly because he never left Yankton and partly because – as he still displays to this day – he still knows the game so well, Hawk was in time understandably faced with the following question: Would he have ever wanted to return to the sideline? \nHe has an easy answer. \n“No,” Hawk said. \nHe does joke, though, that with the bulk of that 1994 talent coming back for another year or two, he could have probably tacked on 25 more wins to his resume – Yankton, next coached by Miner, went on to go 12-0 and win the state title in 1995. \nLikness eventually took over for Miner in 1999, and promptly led the Bucks to a 12-1 record and another state championship. \nAs Hawk sat at his kitchen table this week and ran through anecdote after anecdote, he said he proud of the fact that his legacy survived. In a period of six years, three different Yankton coaches – Hawk (1994), Miner (1995) and Likness (1999) – all won a state championship. \nPut into perspective in today’s age where head coaches are getting younger and younger, that fact still stands as one of the most impressive out of the Hawk tenure. \n“That’s pretty unusual for a school our size,” he said. “I always said, we’re a small school in a big-school league. We played all the big schools.” \nInfluence Lives On \nAlthough many high school football teams pass more times in one season than Hawk’s teams did throughout his career, his legacy remains strong. \nTwenty-one years later, many of the Hawk principles live on through his former assistants and players. \nBrady Muth is living proof. \nMuth, a 1996 YHS graduate, was a junior during Hawk’s final season and later followed in his mentor’s footsteps into the coaching world. \n“He’s always in the back of my mind as far as what is best for the program,” said Muth, now an assistant coach on Likness’ staff. \nMuth went on and played college football for three seasons at Southwest Minnesota State, then went on to coach at Irene-Wakonda (three years), Bon Homme (five years) and then to Yankton. \nEven in today’s age with the prevalence of spread offenses – which Yankton uses – Hawk’s Wing-T offensive style remains the standard, according to Muth. The Bucks during Likness’ tenure have been known for their misdirection plays, in the run game and on special teams. \n“More times than not, I think to myself, ‘Keep it simple like coach Hawk did,’” Muth said. “Make sure you can run a fullback dive before you can do anything else.” \nThe performance of last year’s Yankton squad harkened back to the days of Hawk. Yankton beat all the ‘big boy’ teams and rode a dominant defense all the way to the DakotaDome, where the Bucks edged Brookings in an overtime thriller for the championship. \nIt was almost like 1994 all over again. \nAnd it was perfect synchronicity. What’s old was new again for the Bucks. \n“As a program, we are all accountable to what coach Hawk has done before us,” Muth said. “And as a guy that played for him and now coaches in that program, there is not a practice or game that goes by that I don’t think to myself, ‘How would coach Hawk do this or handle this?’” \nLegacy Remains \nThe next time you’re at a Yankton home football game, do yourself a favor: Wait outside the Bucks locker room during halftime. \nYou’ll see a group of youngsters lining up outside the door, waiting for their heroes to slap their hands. That’s part of the Hawk tradition, as I’ve come to understand it. Taking the field at historic, 90-year-old Crane-Youngworth Field became something every young Yankton football player waited for. \nA successful program certainly sparked that interest, but what Hawk’s teams represented was more the story. \nAs Hawk began attending the National High School Coaches Association national conventions every year (next year will be his 50th consecutive), he would consistently be asked about his program’s success. The comment usually involved something like, it either speaks awfully good of Hawk’s players, awfully good of his program, or awfully good of the coaching staff. \n“I always argued, it was all three,” Hawk says from his kitchen table. \nTwenty-years after his retirement, Hawk remains in Yankton. He and his wife spend the winters at their home outside Phoenix, Arizona, but he is still active on the Yankton athletic scene – whether at home football games, at the weekly Quarterback Club, or out on the golf course. \nFootball, in particular, is very much still a large part of his life. \nAs his wins record has been threatened this season by O’Gorman’s Kueter, Hawk has been back in the news. He says he understands that, but has tended not to make a big deal out of his record over the years. \nThere’s also a good chance that within a couple years, Hawk could fall to No. 3 on the all-time wins list. Sioux Falls Roosevelt coach Kim Nelson currently stands third at 260 victories, while Likness is fourth with 248 wins. \nThe fact that it took 21 years for someone to catch Hawk speaks highly of the former coach, according to Likness. \n“He has a great winning percentage and he was pretty consistent for all those years,” the Bucks coach said. “Hats off to Max, he did a lot of things right.” \nHearing that reminded me of what Hawk said: “Anyone with any sense could have come in here and made them a winner.” \nWhile that may have been true for a short period of time, it’s doubtful that any one coach would have had the three-decades long impact that Hawk had in Yankton. \nThat basement full of plaques and memorabilia tells me he made quite an impression in Yankton. \nFollow @jhoeck on Twitter", "external_links": [], "published": "2015-10-08T06:30:00.000+03:00", "crawled": "2015-10-08T09:02:02.162+03:00", "highlightTitle": ""}