{"organizations": [], "uuid": "55f87f879ada6221dc6f92ec12df11be9e98f1f9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "wtop.com", "main_image": "", "site_section": "http://wtop.com/section/sports/feed", "section_title": "WTOP » Sections » Sports", "url": "http://wtop.com/tennis/2015/10/mondays-sports-transactions-150/", "country": "US", "title": "Monday’s Sports Transactions", "performance_score": 0, "site": "wtop.com", "participants_count": 1, "title_full": "Monday’s Sports Transactions", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T22:25:00.000+03:00", "replies_count": 0, "uuid": "55f87f879ada6221dc6f92ec12df11be9e98f1f9"}, "author": "wtopstaff", "url": "http://wtop.com/tennis/2015/10/mondays-sports-transactions-150/", "ord_in_thread": 0, "title": "Monday’s Sports Transactions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By The Associated Press October 5, 2015 3:25 pm BASEBALL American League \nLOS ANGELES ANGELS — Named Billy Eppler general manager. \nOAKLAND ATHLETICS — Promoted Billy Beane to executive vice president of baseball operations and David Forst to general manager. National League \nARIZONA DIAMONDBACKS — Fired pitching coach Mike Harkey. \nMILWAUKEE BREWERS — Announced the contracts of first base coach Mike Guerrero, pitching coach Rick Kranitz, bench coach Jerry Narron, outfield coach John Shelby and bullpen coach Lee Tunnell will not be renewed. \nWASHINGTON NATIONALS — Fired manager Matt Williams, bench coach Randy Knorr, pitching coach Steve McCatty, hitting coach Rick Schu, third base coach Bobby Henley, first base coach Tony Tarasco, bullpen coach Matt LeCroy and defensive coordinator/advance coach Mark Weidemaier. FOOTBALL \nINDIANAPOLIS COLTS — Released QB Josh Johnson. \nMIAMI DOLPHINS — Fired coach Joe Philbin. Named Dan Campbell interim coach. HOCKEY National Hockey League \nNHLPA — Defenseman Mike Weaver announced his retirement. \nARIZONA COYOTES — Assigned G Louis Domingue and LW Matthias Plachta to Springfield (AHL) and D James Melindy and LW Dan O’Donoghue to Rapid City (ECHL). Released RW Daniel Barczuk, C Cody Ferriero, D Jordan Heywood and RW Kale Kerbashian from their tryout agreements. \nBOSTON BRUINS — Waived F Max Talbot \nCALGARY FLAMES — Waived LW Mason Raymond. \nEDMONTON OILERS — Assigned F Leon Draisaitl to Bakersfield (AHL). \nMONTRAL CANADIENS — Waived G Dustin Tokarski. \nPITTSBURGH PENGUINS — Waived D Tim Erixon. \nNEW JERSEY DEVILS — Signed G Ken Appleby to a three-year, entry-level contract. \nPHILADELPHIA FLYERS — Waived D Andrew MacDonald. \nTORONTO MAPLE LEAFS — Waived D T.J. Brennan, D Andrew Campbell, C Sam Carrick, RW Matt Frattin and C Byron Froese on waivers. \nWINNIPEG JETS — Waived D Jay Harrison. American Hockey League \nAHL — Suspended Stockton C Mitchell Heard two games for a boarding incident during an Oct. 1 preseason game at San Jose. Suspended Hershey D Bobby Shea one game for an altercation during an Oct. 1 preseason game against Albany. Suspended Grand Rapids RW Joel Rechlicz for three games for a charging incident during an Oct. 2 preseason game against Lake Erie. Suspended Iowa F Kurtis Gabriel three games for his actions during an Oct. 3 preseason game against Manitoba. \nHARTFORD WOLF PACK — Reassigned F Michael Kantor to Greenville (ECHL). Loand D Kodie Curran to Greenville. Released F Alex Krushelnyski from his tryout agreement and returned him to Utah (ECHL). Released D Brett Bellemore. ECHL \nREADING ROYALS — Announced Fs Kevin Goumas and Derek Mathers and Gs Connor Knapp and Martin Ouellette were loaned to the team by Lehigh Valley (AHL). Announced Fs Kevin Sundher and D Jordan Heywood have returned to the team after being released from AHL training camp. SOCCER Federation Internationale de Football Association \nFIFA — Sanctioned the Football Association of Malaysia (FAM) after serious crowd disturbances led to the abandonment of the 2018 FIFA World Cup Russia qualifying match between Malaysia and Saudi Arabia on Sept. 8. Malaysia was fined $41,000 and will play the Nov. 17 game against United Arab Emirates without spectators. TENNIS \nWTA — Named Steven Simon CEO. COLLEGE \nBROWN — Named Jim Hayes assistant gymnastics coach. Topics:", "external_links": [], "published": "2015-10-05T22:25:00.000+03:00", "crawled": "2015-10-05T22:31:47.117+03:00", "highlightTitle": ""}