{"organizations": [], "uuid": "22a6890d239ac59a502390633cb77ba6ad4595cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/nation/crowdfunding-to-make-capital-amaravati/147815.html", "country": "US", "title": "Crowdfunding to make capital Amaravati", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "Crowdfunding to make capital Amaravati", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "22a6890d239ac59a502390633cb77ba6ad4595cb"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/nation/crowdfunding-to-make-capital-amaravati/147815.html", "ord_in_thread": 0, "title": "Crowdfunding to make capital Amaravati", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Suresh Dharur\nTribune News Service\nHyderabad, October 18\nBilled as the first such initiative in the country, the Andhra Pradesh government has unveiled crowd-funding model for building new capital city of Amaravati in the Vijayawada-Guntur region. People from across the globe can make online contribution towards construction of the capital city by purchasing a symbolic “e-brick” for Rs 10 each. The initiative, launched by Chief Minister N Chandrababu Naidu, is aimed at infusing a sense of ownership and pride among Telugus. Ever since the launch of the website “My Brick-My Amaravati” and the activation of the payment gateway on Thursday, there has been an overwhelming public response. So far, over 25,100 donors have pitched in and made contributions to the tune of Rs 1.59 crore. Sources said Telugus living in Mumbai, Pune, Hyderabad and different parts of the residuary state were quick to respond to the campaign. Employees of the newly created Capital Region Development Authority (CRDA) contributed a day’s salary, amounting to Rs 5.22 lakh, to buy 52,200 e-bricks. The names of all those who purchase the e-bricks would be registered in the electronic database. As a token of appreciation, authorities have decided to present to them certificates signed by the Chief Minister. The payment gateway set up on the website www.amaravati.gov.in allows people to buy e-bricks using their debit and credit cards. Officials said there was no restriction on the number of bricks one could buy. “We will script history as we lay the foundation for Amaravati, the people’s capital. We aspire to make it a destination of opportunities and a city of the future. I invite you to join me in building our people’s capital,” the Chief Minister said in his appeal soon after launching the initiative at Vijayawada. Meanwhile, the Telugu Desam Party (TDP) government, despite facing severe financial crunch, is going all out to make the foundation stone laying ceremony on October 22 an extravagant affair with the total expenditure expected to be over Rs 300 crore. With Prime Minister Narendra Modi agreeing to lay the foundation stone for the river front capital, coming up between Vijayawada and Guntur in the coastal Andhra region, massive arrangements are being made to make it a memorable affair. All government departments have been asked to release funds to make arrangements for hospitality, logistics and security. Besides sending out invitations to thousands of guests, including Chief Ministers, Union Ministers and MPs, the state government wants people from all 13 districts to attend the function. “The birth of Amaravati will be a spectacular occasion to create an emotional bond among people,” said P Prabhabkar, communications adviser to the state government. The Vijayawada-Guntur region has been chosen for the capital as it is centrally located and accessible from all parts of the state.", "external_links": [], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-19T02:19:06.753+03:00", "highlightTitle": ""}