{"organizations": ["Oregon Department of Forestry", "U.S. Natural Resources Conservation Service", "BLM", "Wallowa-Whitman National Forest", "NRCS", "City Herald", "Baker City Herald", "East Face", "Forest Service"], "uuid": "b55c1615879d5a64b62dab33a4568eb31da1af2f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bakercityherald.com", "main_image": "", "site_section": "http://feeds.feedburner.com/bakercityherald/LeEi", "section_title": "Baker City Herald, Baker County, OR News, Sports, &amp; Weather", "url": "http://www.bakercityherald.com/Local-News/Forest-In-Focus", "country": "US", "title": "Forest In Focus", "performance_score": 0, "site": "bakercityherald.com", "participants_count": 0, "title_full": "Forest In Focus", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T16:19:00.000+03:00", "replies_count": 0, "uuid": "b55c1615879d5a64b62dab33a4568eb31da1af2f"}, "author": "", "url": "http://www.bakercityherald.com/Local-News/Forest-In-Focus", "ord_in_thread": 0, "title": "Forest In Focus", "locations": ["Grande Ronde Valley", "Anthony Lake", "Baker County", "Ladd Canyon", "Elkhorn Mountains"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Wallowa-Whitman", "Jayson Jacoby/Baker", "Mark Bennett", "Jayson Jacoby", "Bennett"], "text": "Forest In Focus By Jayson Jacoby October 09, 2015 02:19 pm Jayson Jacoby/Baker City Herald file photo This view from the Lakes Lookout takes in Anthony Lake, right middle, and in the background much of the publicly owned forest included in the East Face project. East Face Project In The Elkhorn Mountains: Forest Service proposes major timber sale, forest restoration work By Jayson Jacoby This e-mail address is being protected from spam bots, you need JavaScript enabled to view it The Wallowa-Whitman National Forest is proposing one of its bigger timber sales in the past 25 years. The East Face project is on the east slopes of the northern Elkhorn Mountains, mainly from the Anthony Lakes Highway north toward Ladd Canyon and the Grande Ronde Valley. It includes about 48,000 acres of public land, mostly national forest, with about 1,200 acres of BLM ground. According to the 293-page environmental assessment the Forest Service released Wednesday, the East Face project is designed to reduce the risk of large wildfires in the area and to begin to restore forests that have been harmed by past logging and many decades of fire suppression. The East Face project is also designed to supplement similar work on adjacent private lands, a campaign that involves the Oregon Department of Forestry and the U.S. Natural Resources Conservation Service (NRCS). Last year the NRCS distributed $1.4 million to private landowners to help pay to thin about 3,100 acres of overcrowded forests in the east face area. The Wallowa-Whitman’s East Face project would expand that effort onto public lands. A 30-day comment period for the East Face environmental assessment started Wednesday. The Wallowa-Whitman’s proposed action — one of five strategies analyzed in the assessment — calls for commercial logging on 6,700 acres, with a total timber volume of 16.4 million board-feet. That’s more timber than the entire 2.4 million acre Wallowa-Whitman has offered for sale in some years during the past two decades. Some of the East Face logging is proposed within designated old growth areas. That would require the Forest Service to amend the 1990 management plan for the Wallowa-Whitman. The East Face project does not, however, call for cutting trees larger than 21 inches in diameter. The Forest Service agreed to that limitation for national forests east of the Cascades in the early 1990s at the behest of environmental groups that pointed out that most of the old growth trees had been cut during past decades. The proposed action — it’s alternative No. 2 in the study — also proposes building 5.3 miles of new, temporary road, rebuilding 53 miles of existing roads, and temporarily re-opening 107 miles of closed roads. The alternative calls for substantial amounts of non-commercial work as well, including cutting small trees and clearing and piling brush on about 10,000 acres, and lighting prescribed fires on about 6,700 acres. Baker County Commissioner Mark Bennett said Thursday that he hopes the East Face project goes ahead as designed. “We need to get as much timber as possible while maximizing opportunities to slow potential fire growth,” Bennett said. “Obviously timber cuts are good for Baker County as well as fuels treatment.” What’s wrong with the forests? The assessment outlines the current conditions in the area as well as what the Forest Service identifies as causes for some of the problems affecting the forests. “A combination of past management activities and exclusion of fire along with the results of acres of post fire overstocked lodgepole pine stands has led to an increase in stocking levels, fuel loadings, and dense understories,” the assessment states. “Overstocking, insects, and disease are threatening the health and vigor of many stands within the project area. Stands are not growing to their site potential ...” Those “past management activities” included logging that concentrated on the biggest and most fire-resistant trees, including ponderosa pines and tamaracks. Today’s forests contain a higher proportion of grand fir trees than was typical in the past, and these trees are more susceptible to fire, according to the Forest Service. Many acres also are supporting more trees than was customary, which makes these forests more vulnerable to insects and diseases, according to the Forest Service. See more in Friday's issue of the Baker City Herald.", "external_links": [], "published": "2015-10-09T16:19:00.000+03:00", "crawled": "2015-10-10T22:03:47.388+03:00", "highlightTitle": ""}