{"organizations": [], "uuid": "4d9b036dc96cac2375493b9f7f32ab61ba00a255", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.timesunion.com", "main_image": "http://ww1.hdnux.com/photos/41/44/12/8798900/3/rawImage.jpg", "site_section": "http://timesunion.com//home/collectionRss/Homepage-HCat-Sports-6377.php", "section_title": "Sports news", "url": "http://www.timesunion.com/sports/article/Saints-hand-Falcons-first-loss-6573550.php", "country": "US", "title": "Saints hand Falcons first loss", "performance_score": 0, "site": "timesunion.com", "participants_count": 1, "title_full": "Saints hand Falcons first loss - Times Union", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T02:58:00.000+03:00", "replies_count": 0, "uuid": "4d9b036dc96cac2375493b9f7f32ab61ba00a255"}, "author": "timesunion.com", "url": "http://www.timesunion.com/sports/article/Saints-hand-Falcons-first-loss-6573550.php", "ord_in_thread": 0, "title": "Saints hand Falcons first loss", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: Gerald Herbert Image 1 of / 1   1 New Orleans Saints tight end Benjamin Watson (82) makes a touchdown catch against the Atlanta Falcons during the second half of an NFL football game, Thursday, Oct. 15, 2015, in New Orleans. (AP Photo/Gerald Herbert) ORG XMIT: LAMS143 New Orleans Saints tight end Benjamin Watson (82) makes a touchdown catch against the Atlanta Falcons during the second half of an NFL football game, Thursday, Oct. 15, 2015, in New Orleans. (AP Photo/Gerald ... more Photo: Gerald Herbert Saints hand Falcons first loss 1  /  1 Back to Gallery New Orleans \nDrew Brees passed for 312 yards, Ben Watson racked up a career-high 127 yards receiving to go with a fourth-down touchdown catch, and the New Orleans Saints handed the Atlanta Falcons their first loss of the season with a 31-21 win on Thursday night.\nDesperate for a victory, the Saints (2-4) enjoyed big plays in all phases. Michael Mauti , who grew up near New Orleans after his father, Rich, played for the Saints, blocked a punt and recovered it for a touchdown, delighting the Superdome crowd with a play reminiscent of Steve Gleason 's famous block against Atlanta in 2006. Mark Ingram ran for two short touchdowns, and New Orleans' defense recovered three fumbles — two inside its own 20.\nDevonta Freeman rushed for 100 yards, including a 25-yard TD, for Atlanta (5-1). Matt Ryan passed for 295 yards and two TDs.\nGiants: New York's injury problems have gotten a lot worse. Everyone knew that wide receivers Odell Beckham Jr. and Rueben Randle would be iffy with hamstring injuries for Monday night's NFC East showdown against Philadelphia. The defense has bigger problems. Shutdown cornerback Prince Amukamara is going to miss two to four weeks with a partially torn pectoral muscle. He leads the team with seven passes defended. Giants coach Tom Coughlin disclosed the chest injury before Thursday's practice, which put Jayron Hosley into the starting lineup.\nRaiders: Oakland plans to put defensive end Justin Tuck on season-ending injured reserve because of a torn pectoral muscle, a person familiar with the situation tells The Associated Press . Tuck was hurt while trying to tackle Denver running back C.J. Anderson early in the fourth quarter of Sunday's 16-10 loss to the Broncos and spent the rest of the game on the sidelines wearing a sling. \nOff icials: In a rare admission of discipline for game officials, the NFL has suspended a side judge and moved a back judge off a prime-time game. The NFL suspended side judge Rob Vernatchi for one game for not managing the clock properly in the fourth quarter of Pittsburgh's game at San Diego on Monday night. The NFL also has reassigned Greg Wilson , the back judge who missed an end-zone penalty in the final moments of Detroit's loss at Seattle the previous Monday night. A person with knowledge of the move told The Associated Press that Wilson has been moved off Sunday night's Patriots-Colts game and will work Dolphins-Titans instead.\nSeahawks: Seattle suspended Derrick Coleman after police arrested him in a hit-and-run investigation, but his lawyer insisted that if the fullback left the scene at all it was only because he was dazed.\nRams: Guard Rodger Saffold will require season-ending surgery for a right shoulder injury.\nTitans: Rookie outside linebacker Deiontrez Mount will miss the rest of the season after tearing his right ACL at practice.", "external_links": [], "published": "2015-10-16T02:58:00.000+03:00", "crawled": "2015-10-16T08:36:02.768+03:00", "highlightTitle": ""}