{"organizations": ["Dallas Cowboys", "New England Patriots"], "uuid": "e80e8d3ad54b741dddc7ec231dfc28dc096537d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.koat.com", "main_image": "http://www.koat.com/image/view/-/32512486/highRes/2/-/maxh/630/maxw/1200/-/3xmnv0z/-/Greg-Hardy--Carolina-Panthers-jpg.jpg", "site_section": "http://www.koat.com/9154730?format=rss_2.0&view=feed", "section_title": "Sports News", "url": "http://www.koat.com/sports/nfl-notebook-cowboys-admonish-hardy-over-comments/35734318", "country": "US", "title": "Cowboys' Garrett talks with Hardy about comments", "performance_score": 0, "site": "koat.com", "participants_count": 0, "title_full": "Cowboys' Garrett talks with Hardy about comments", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T04:05:00.000+03:00", "replies_count": 0, "uuid": "e80e8d3ad54b741dddc7ec231dfc28dc096537d2"}, "author": "", "url": "http://www.koat.com/sports/nfl-notebook-cowboys-admonish-hardy-over-comments/35734318", "ord_in_thread": 0, "title": "Cowboys' Garrett talks with Hardy about comments", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jason Garrett", "Greg Hardy", "Tom Brady", "Hardy", "Garrett"], "text": "Cowboys' Garrett talks with Hardy about comments Hardy eligible to return after four-game suspension UPDATED 7:05 PM MDT Oct 08, 2015 Photos Grant Halverson/Getty Images Dallas Cowboys coach Jason Garrett said Thursday that the team admonished defensive end Greg Hardy for his controversial comments about New England Patriots quarterback Tom Brady’s wife and a reference to guns. More \n\"Well, we just addressed it immediately,\" Garrett said. \"That's not how we want to operate as an organization. Players and coaches in our organization understand that. \n\"We want to distinguish ourselves with our play, not with what we say. We define ourselves by what we do, not by what we say. Greg understands that now and that's how we're going ... forward.\" \nHardy created a stir Tuesday when he met with the media for the first time since signing with the Cowboys last March. Hardy's remarks included comments about Brady's wife, Gisele Bundchen. \nHardy, who hasn't played an NFL game in 14 months after a May 2014 domestic violence incident, joked about why he likes to face Brady. \n\"I love seeing Tom Brady. He's cool,\" Hardy said. \"Have you seen his wife? I hope she comes to the game; I hope her sister comes to the game, all her friends come to the game. One of my favorite games of the year, guys.\" \nHardy was also criticized and admonished for a reference to guns while explaining his approach to Sunday's game against the Patriots. \n\"I hope I come out guns blazing,\" Hardy said. \"I'm full of excitement and full of juice. I'm ready to go. I have what they call fresh legs.\" \nGarrett said Hardy understood why the Cowboys had a problem with the comments and was very receptive to the feedback. \n\"Yeah, he's very receptive, very respectful, appreciated my comments,\" Garrett said. \"Hopefully, he'll handle it the right way going forward.\" \nGarrett might need to talk with Cowboys owner Jerry Jones, who didn't have a problem with Hardy's comments, according to Sports Illustrated. \n\"When I saw him marry (Bundchen), Tom went up in my eyes 100 percent,\" Jones said from the NFL owners meeting. \"She's very, very attractive and it shows what an outstanding individual Tom is.\" \nJones also had no problem with Hardy's reference to guns. \n\"Well, you're not allowed to have guns on the football field,\" Jones said. \"We all know that's just a way of expressing yourself. I hope his guns are ablazin'.\" \nNOTES: LB Sean Lee practiced Thursday on a limited basis after missing Wednesday because of a concussion suffered last week against the New Orleans Saints. He is expected to play this week against New England.", "external_links": [], "published": "2015-10-09T04:05:00.000+03:00", "crawled": "2015-10-09T04:09:54.729+03:00", "highlightTitle": ""}