{"organizations": [], "uuid": "a52f41794dc328f0d9d471be16067cc0ec677aee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.local12.com", "main_image": "http://www.local12.com//template/ugc/wkrc/1601/qXehC9v5.jpg", "site_section": "http://www.local12.com/sports/features/local-sports//rss.xml", "section_title": "wkrc LOCAL Sports", "url": "http://www.local12.com/sports/features/local-sports/stories/Hot-starting-Bengals-not-overlooking-banged-up-Bills-219396.shtml", "country": "US", "title": "Hot-starting Bengals not overlooking banged-up Bills", "performance_score": 0, "site": "local12.com", "participants_count": 0, "title_full": "Hot-starting Bengals not overlooking banged-up Bills", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T15:57:00.000+03:00", "replies_count": 0, "uuid": "a52f41794dc328f0d9d471be16067cc0ec677aee"}, "author": "", "url": "http://www.local12.com/sports/features/local-sports/stories/Hot-starting-Bengals-not-overlooking-banged-up-Bills-219396.shtml", "ord_in_thread": 0, "title": "Hot-starting Bengals not overlooking banged-up Bills", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Hot-starting Bengals not overlooking banged-up Bills \nUpdated: Thu, Oct 15 2015, 12:57 PM \nORCHARD PARK, N.Y. (AP) -- Coach Marvin Lewis makes no apologies for playing down Cincinnati's hot start. \nFor all the excitement the Bengals (5-0) have generated lately with two come-from-behind wins engineered by quarterback Andy Dalton, Lewis isn't buying in just yet. And neither, he insists, are his players. \n\"Five games doesn't do anything for you,\" Lewis said. \"These are young football players who really have a singleness of purpose and nothing outside really matters too much to them. And what do they know? They spend too much time talking on their phones and all that other stuff.\" \nLewis has good reason to keep his team focused as they travel to play the Buffalo Bills (3-2) on Sunday. \nWith the Bengals bye week approaching, and a dramatic 27-24 overtime win over Seattle behind them, this is not the time to overlook an injury-depleted opponent with an aggressive Rex Ryan-designed defense. \nLewis is familiar with Ryan, after the two spent three years working together in Baltimore. That doesn't mean he has any insight into what the Bills might have in store -- including whether backup EJ Manuel will start in place of Tyrod Taylor, who sprained his left knee last weekend. \n\"Good luck to you guys figuring out Rex,\" Lewis said with a laugh. \nAs much as Ryan is keeping Lewis guessing on starters, the first-year Bills coach has worries of his own in facing what he refers to as the \"the best Bengal team that I can remember.\" \nAside from questions at quarterback, the Bills running game has been grounded due to injuries to starter LeSean McCoy (left hamstring) and rookie backup Karlos Williams (concussion). And the defense will be missing starting safety Aaron Williams (neck). \nThe Bills, coming off a 14-13 come-from-behind victory at Tennessee, have yet to win two straight, and have lost two in a row at home. \n\"They're hot, they're playing well and they've been to where we want to get,\" guard Richie Incognito said. \"It's a good measuring stick for us to see exactly where we're at because we gutted one out down in Tennessee.\" \nHere's several things to look for as the Bengals attempt to match their best start to a season: \nTYROD OR EJ? Though Ryan isn't ruling out Taylor a week after he got hurt against Tennessee, Manuel is in line to make his first start since losing the No. 1 job to Kyle Orton early last season. Manuel poses a running threat, but nothing like Taylor, who set a franchise record for a QB with 76 yards rushing, including a 22-yard touchdown, against Tennessee. \nThat makes it easier for the Bengals to prepare for either player. \n\"The quarterback running is a part of the offense regardless who's there,\" Lewis said. \"Obviously, an injured quarterback, they're not going to run much anyway if Tyrod does play.\" \nFAST START: The Bengals have been one of the NFL's best teams at starting off well. They gave up a touchdown in the first quarter against Seattle, the only TD they've allowed in the first half all season. The Bengals have outscored opponents 73-28 in the first half, allowing them to play while ahead. They trailed at halftime last Sunday for the first time this season. \nBY THE SACKFUL: The Bengals finished last in the NFL in sacks last season with only 20, in large part because their line got little push into the backfield. They're much better this year. After dropping Kansas City's Alex Smith five times and Seattle's Russell Wilson four times in the last two games, they're up to 15 sacks already. \n\"It's not enough,\" end Wallace Gilberry said. \"We feel like we left a lot on the field, but we're getting after it. We just want to make a statement, and that's what we've been doing these last couple weeks.\" \nNO OFFENSE: The Bills have had difficulty generating offense since McCoy was sidelined following a 41-14 win at Miami. In its past two games, Buffalo has combined for 27 first downs, had 10 three-and-outs and 522 yards offense. As for running the ball, Taylor has accounted for 91 of Buffalo's 182 yards rushing the past two weeks. \nLONDON-BOUND: While the Bengals enter their bye week, the Bills are heading directly to the airport and flying to England to prepare to face Jacksonville at Wembley Stadium on Oct. 25. Ryan said the team's traveling as soon as possible to become accustomed to the time change. \n*AP Photo/Frank Victores", "external_links": [], "published": "2015-10-15T15:57:00.000+03:00", "crawled": "2015-10-15T21:30:22.181+03:00", "highlightTitle": ""}