{"organizations": ["Central Catholic"], "uuid": "696849c98a14c2bbcea1cf1ab329f50da5465e70", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "highschoolsports.lehighvalleylive.com", "main_image": "http://hssn-media.advance.net/PennLive.com/news/e1679bad986f01b44622f3dbc7a83a3c/dotson.jpg", "site_section": "http://blog.lehighvalleylive.com/lehighvalleylive_high_school_sports_homepage_feed/atom.xml", "section_title": "lehighvalleylive.com High School Sports", "url": "http://highschoolsports.lehighvalleylive.com/news/article/-7920695873900149308/5-keys-to-nazareth-at-central-catholic-football/", "country": "IL", "title": "5 keys to Nazareth at Central Catholic football", "performance_score": 0, "site": "lehighvalleylive.com", "participants_count": 0, "title_full": "5 keys to Nazareth at Central Catholic football", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T20:21:00.000+03:00", "replies_count": 0, "uuid": "696849c98a14c2bbcea1cf1ab329f50da5465e70"}, "author": "", "url": "http://highschoolsports.lehighvalleylive.com/news/article/-7920695873900149308/5-keys-to-nazareth-at-central-catholic-football/", "ord_in_thread": 0, "title": "5 keys to Nazareth at Central Catholic football", "locations": ["Nazareth"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Brad Wilson", "Tim Wynkoop", "Jahan Dotson", "John Cupples"], "text": "The speed of Nazareth players such as wide receiver Jahan Dotson is the first concern of Central Catholic coach John Cupples this week. (Tim Wynkoop | lehighvalleylive.com contributor) By Brad Wilson | For lehighvalleylive.com on October 08, 2015 1:13 PM View/Post Comments \nNazareth vs. Central Catholic , Saturday, 2:30 p.m., J. Birney Crum Stadium, Allentown \nWinning up front. Nazareth coach Tom Falzone noted the Vikings enter with an edge up front. “They are a lot bigger than we are on the line,” he said. “We’re going to have to take some chances and our linebackers are going to have to get some penetration and do a good job of reading the plays. We’ll have to match how physical they are and really get a good push on both sides of the ball.” It may be an afternoon where technique, desire and smarts will have to overcome physical advantages for the Blue Eagles to be successful. \nLimiting the laundry. The Vikings have attracted more attention from the officials than ACC coach John Cupples would prefer. “We have really suffered some costly penalties lately,” he said. “We can’t afford that against the good teams. The penalties have taken some big plays away from us. We have to focus on the mental aspects of the game.” And speaking of those … \nWinning the reunion. Central Catholic has more than a tinge of Blue Eagles amid its green and gold, with ex-Nazareth coach (and current teacher) Rob Melosky on its coaching staff and two former Blue Eagles, linebacker Jacob Michelman and lineman Chris Brune , on the team. The dynamic is a little different than usual. “I don’t think it makes any difference – I have Coach Melosky as my gym teacher – but maybe it does want to make you win a little more,” Nazareth quarterback Travis Stefanik said. “The bragging rights are nice.” Falzone noted that he’ll have to do some things differently this week with ex-players who know the Blue Eagles well on the other side of the ball, but added: “It adds a little to the game but basically we are worried about we are doing more than anything (Central) is.” \nPlaying under the sun . Nazareth doesn’t play many day games or Saturday games; Central Catholic is used to them. “It’s a little different for us, but we’re practicing pretty much the same, preparing the same,” Stefanik said. Falzone said, “I’d rather play Saturday afternoon than Saturday night, I hate sitting around all day Saturday with no school waiting for a game. Playing on Saturday is a change from the normal Friday-night groove, but you do get an extra day to prepare.” It’s worth noting that the Vikings’ upset of Easton came on a Saturday night. \nBig plays and being fast. Cupples’ first concern with Nazareth is speed. “Their team speed on offense and special teams is a real challenge,” he said. “Seeing them on film makes that apparent. We have to be aware of where their playmakers are.” Cupples added that ball control could be useful in keeping Stefanik, Jahan Dotson , Julian Liaci and friends off the field. “We have to be able to sustain drives, and that’s where the penalties have proven to be a problem,” he said.", "external_links": [], "published": "2015-10-08T20:21:00.000+03:00", "crawled": "2015-10-09T02:10:02.190+03:00", "highlightTitle": ""}