{"organizations": [], "uuid": "3af7fee2500f10352c578c9e0ef624b95be5d54a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dodgeglobe.com", "main_image": "http://www.dodgeglobe.com/Global/images/head/nameplate/ks-dodgecity_logo.png", "site_section": "http://www.dodgeglobe.com/sports?template=rss&mime=xml", "section_title": "Sports - Dodge City Daily Globe - Dodge City, KS", "url": "http://www.dodgeglobe.com/article/20151020/SPORTS/151029890/2000/NEWS?rssfeed=true", "country": "US", "title": "Dodge City runs through WAC", "performance_score": 0, "site": "dodgeglobe.com", "participants_count": 1, "title_full": "Dodge City runs through WAC", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T04:27:00.000+03:00", "replies_count": 0, "uuid": "3af7fee2500f10352c578c9e0ef624b95be5d54a"}, "author": "John Zetmeir / Dodge City Daily Globe", "url": "http://www.dodgeglobe.com/article/20151020/SPORTS/151029890/2000/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "Dodge City runs through WAC", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Dodge City runs through WAC Comment By John Zetmeir / Dodge City Daily Globe Dodge   By John Zetmeir / Dodge City Daily Globe Posted Oct. 20, 2015 at 8:27 PM Updated at 8:27 PM By John Zetmeir / Dodge City Daily Globe Posted Oct. 20, 2015 at 8:27 PM Dodge City, Kan. Dodge City’s depth on both the boys and girls cross country teams has lead them to first place finishes more times than not this season. On Saturday in Liberal, it was a Red Demon clean sweep as both the boys and girls squads ran away with WAC titles. The girls team, who finished with a team score of 33, won their second WAC title in as many years. Coming into the season, defending their conference title was one of the main goals for girls’ head coach Brian Lenz’s group. \"That was one of goals going into the season, to win WAC,\" Lenz said. \"I think for us, as much as anything else, them running as a pack really meant a lot because that was our race plan (in Liberal) and it will be our race plan Saturday at regionals.\" Sophomore Amelia Richter took third and senior Jasmine Duarte took fourth to lead the Red Demons. Dodge City had five runners finish in the top 10. \"I really like the attitude that they have right now,\" Lenz said. \"The main part about peaking is the attitude and they are so focused and committed to what we are doing right now that I really like where we sit.\" On the boys side, junior Marcelo Cruz led the way for Dodge City with a second place finish. Just like the girls team, it was the depth the brought home the title. The boys squad also had five runners finish in the top-10. Last season the boys took third at WAC. Cruz placed 14th at last year’s 6A state cross country meet. The junior runner has continued to improve this season and one of the biggest things that has helped him is having a strong squad running around him. \"Knowing that we have a good team that can qualify for state has helped me,\" Cruz said. \"As a runner, sometimes you have to have a good team so you can push yourself even harder.\" Both squads will head to Wichita bright and early on Saturday for regionals. The boys are scheduled to run at 11 a.m. and the girls will begin at 11:30 a.m. WAC Results", "external_links": [], "published": "2015-10-21T04:27:00.000+03:00", "crawled": "2015-10-21T06:59:00.285+03:00", "highlightTitle": ""}