{"organizations": [], "uuid": "0704f5b9f2582d9510ae8d353a48d12ceab3d870", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-5530052e/turbine/chi-default-open-graph-ct-logo/", "site_section": "http://www.chicagotribune.com/", "section_title": "Chicago Tribune: Chicago breaking news, sports, business, entertainment, weather and traffic - Chicago Tribune", "url": "http://www.chicagotribune.com/news/nationworld/ct-small-plane-crashes-into-mobile-homes-20151013-story.html", "country": "US", "title": "Small plane crashes into Fla. mobile homes; at least 2 catch fire", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Small plane crashes into Fla. mobile homes; at least 2 catch fire - Chicago Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T14:05:00.000+03:00", "replies_count": 0, "uuid": "0704f5b9f2582d9510ae8d353a48d12ceab3d870"}, "author": "Tribune wire reports", "url": "http://www.chicagotribune.com/news/nationworld/ct-small-plane-crashes-into-mobile-homes-20151013-story.html", "ord_in_thread": 0, "title": "Small plane crashes into Fla. mobile homes; at least 2 catch fire", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A small plane plunged into a Florida mobile home park, churning up flames and a column of black smoke, and authorities said they rushed to check for an \"unknown number of victims\" in the chaotic aftermath.\nThe aircraft struck two homes at the Mar-Mak Colony Club in Palm Springs before 6 p.m. Tuesday, Palm Beach County Fire Rescue Capt. Albert Borroto said in an email. He said 911 callers had reported a low-flying aircraft and crew arrived at the crash site to find thick smoke rising in the air.\nBorroto said one mobile home had been completely engulfed in flames. While he said there was an \"unknown number of victims,\" he wouldn't say how many people were injured or if anyone had died. Borroto didn't immediately return calls early Wednesday for further information.\nAn AP reporter on the scene saw workers loading two stretchers into a white van. Each stretcher appeared to hold a covered body.\nDomingo Galicia said he lived in one of the mobile homes hit by the plane and that his 21-year-old daughter, Vane, was inside at the time of the crash. He said he was blocked by flames when he went to open the door to the home.\n\"Where is my daughter?\" he asked. \"I don't know where is my daughter right now.\"\nAfter speaking to a reporter, Galicia began to cry and family members huddled around him, praying in Spanish.\nClara Ingram, who lives in the trailer park, told The Associated Press that she was home at the time of the crash and heard it happen.\n\"It just pounded, like an explosion,\" Ingram said, adding that when she went to look out her door, she saw \"nothing but a big ball of fire.\"\nPalm Beach County Sheriff's spokeswoman Therese Barbera said there was no update Wednesday morning as officials waited for the National Transportation Safety Board to arrive at the scene.\nFederal Aviation Administration spokeswoman Kathleen Bergen confirmed the crash in emails to The Associated Press but said she had no further details Wednesday other than that the NTSB was in charge of investigating. It was not clear when NTSB experts would arrive.\nAs for the plane involved, she said she had no further information, adding \"the post-crash fire probably destroyed the aircraft so it will take a while for us to confirm the type.\"\nBy late Tuesday, the fires had been put out, but plumes of smoke were still rising from the scene, which was lit by flood lights.\nTyron Caswell, an employee of a car dealership across the street, told the Sun Sentinel newspaper he saw a huge plume of smoke after hearing the crash. He said employees there were reviewing security footage taken outside the building of the plane dropping from the sky.\n\"When I look back at the video it was like, 'Whoa,'\" he said, adding he was stunned by how close he was to the crash.\nThe Red Cross had been called to assist two families, authorities said.\nAssociated Press\n National Transportation Safety Board American Red Cross", "external_links": [], "published": "2015-10-14T14:05:00.000+03:00", "crawled": "2015-10-14T14:29:31.592+03:00", "highlightTitle": ""}