{"organizations": ["Linn-Mar High School", "Linn-Mar Invitational", "MVC", "Photos Center Point-Urbana", "Conference"], "uuid": "994074b58eb75b4ea4318e374b9e130882fd0227", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thegazette.com", "main_image": "http://www.thegazette.com/storyimage/GA/20151014/ARTICLE/151019814/AR/0/AR-151019814.jpg", "site_section": "http://feeds.feedburner.com/~r/GazetteOnlineSports/~6/1", "section_title": "Eastern Iowa Sports News and Information from Gazette Online", "url": "http://www.thegazette.com/subject/sports/conference-call-is-under-way-20151014", "country": "US", "title": "Conference call is under way", "performance_score": 0, "site": "thegazette.com", "participants_count": 0, "title_full": "Conference call is under way", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T22:10:00.000+03:00", "replies_count": 0, "uuid": "994074b58eb75b4ea4318e374b9e130882fd0227"}, "author": "", "url": "http://www.thegazette.com/subject/sports/conference-call-is-under-way-20151014", "ord_in_thread": 0, "title": "Conference call is under way", "locations": ["Marion", "Waterloo East", "Iowa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Haley Weideman", "Jeff Linder"], "text": "Conference call is under way Conference call is under way Volleyball: Wamac tourney starts Thursday; MVC crowns champ Saturday Gazette , Iowa Prep Sports , Prep Sports , Prep Volleyball , Preps Etc. By Jeff Linder , Sports , Sports Rotator , Photos Center Point-Urbana's Haley Weideman sets the ball during a volleyball game against Waterloo East at the Linn-Mar Invitational at Linn-Mar High School in Marion on Saturday, September 13, 2014. (Cliff Jette/The Gazette-KCRG TV9) Iowa Football Data Center \nI've covered Iowa football at The Gazette since 1999 Thursday October 15, 2015 \nColumnist giving commentary and information about sports in Iowa. Thursday October 15, 2015 \nYour source for Iowa sports and more. Thursday October 15, 2015 \nCovering Iowa State and central Iowa for Eastern Iowa Wednesday October 14, 2015 \nKernels baseball, RoughRiders hockey and a lot of things in between. Monday October 12, 2015 \nI cover high school sports and Iowa women's basketball. Wednesday October 14, 2015 \nYour source for all things auto racing in Eastern Iowa. Wednesday September 23, 2015 \nSharing community and high school contributed stories Tuesday October 13, 2015 October 14, 2015 | 3:10 pm \nCenter Point-Urbana is playing fast, playing extremely well and has full attention of Brett Mather. \n“They’re one of the hottest teams around,” said Mather, volleyball coach at West Delaware. “Looking at their scores and who they’ve beaten lately, they must be playing some great ball.” \nConference-tournament week has arrived throughout the area. On Thursday, tournaments begin with pool play for the Wamac and Tri-Rivers conferences at multiple sites, and bracket play will conclude the River Valley Conference tournament Thursday at Clarence. \nDubuque Senior will host the Mississippi Valley Conference tournament Saturday, and the Tri-Rivers tournament concludes Saturday at Lisbon. \nThe Wamac tournament ends Tuesday at Marion. Class 4A top-ranked West Delaware (38-2) is the favorite to repeat, but figures to be challenged by a number of teams, including a CPU outfit that has won 15 of its last 16 matches. \nCPU (25-5) downed 5A power Cedar Falls twice at the Hudson tournament on Saturday. \n“The girls are really clicking right now,” said Stormin’ Pointers Coach Cathy Husmann. “We’ve been working all season on speeding up our offense, and the girls have picked up on that. It’s an athletic bunch of girls that know the game very well.” \nSophomore Abigail Weideman leads the CPU attack with 3.3 kills per set. Setter Haley Weideman orchestrates the attack at 8.5 assists per set. \nThe Stormin’ Pointers are one of several threats. West Division champion Marion (23-7), Western Dubuque (17-11) and Mount Vernon (19-11) are others. But the Hawks — champions of the East Division — are the team to beat. \n“I really like where we’re at right now, and I feel like we’re getting better,” Mather said. “Our blocking has gotten better. We just need a little more consistency. We’ve got to make out opponents earn their points.” \n“Wide-open” doesn’t begin to describe the MVC free-for-all. \n“Oh my gosh, yes,” Linn-Mar Coach Teresa Kehe said. “I definitely think there are a lot of teams capable of putting together a run to win it. Maybe six, seven, eight ... “ \nCedar Rapids Kennedy (22-8) emerged from a stacked Valley Division to win it with a 6-0 record. Other Valley contenders include Cedar Falls (27-4), Linn-Mar (23-6), Iowa City West (21-10) and Dubuque Wahlert (18-11). \nDubuque Hempstead (20-9) and Iowa City High (13-12) share the Mississippi Division crown at 5-1, and Cedar Rapids Prairie (24-5) can join them with a win Thursday at Waterloo East. \n“I think the passing game has to be on for someone to make a run at it,” Kehe said. “Whoever has good ball control and serve reception consistently throughout the day will be successful.” \nWest Branch (30-4) is the favorite in the River Valley Conference; Springville (23-7) is the team to beat in the Tri-Rivers. \n* * * * * \nMISSISSIPPI VALLEY CONFERENCE TOURNAMENT \nSaturday, at Dubuque Senior & Dubuque Hempstead \nSchedule: Pools start at 9 a.m. at Senior, 10 a.m. at Hempstead. Bracket play is scheduled to start at 2:30 p.m. at both sites (championship bracket at Senior, consolation bracket at Hempstead). \nProjected pools (will be official after Thursday’s match between Cedar Rapids Prairie and Waterloo East. Teams presently designated by M-1, M-2 and M-3 will be filled by a combination of Prairie, Dubuque Hempstead and Iowa City High). \nPool A (at Senior): M-1, Iowa City West, Waterloo East, Dubuque Senior. \nPool B (at Senior): Cedar Rapids Kennedy, Cedar Rapids Xavier, Dubuque Wahlert, Cedar Rapids Washington. \nPool C (at Hempstead): M-2, Linn-Mar, Waterloo West. \nPool D (at Hempstead): Cedar Falls, M-3, Cedar Rapids Jefferson. \n* * * * * \nThursday, pool play at Mount Vernon and Van Horne, 4 p.m. both sites \nTuesday, bracket play at Marion, 4 p.m. \nPool 1 (at Mount Vernon): West Delaware, Clear Creek Amana, DeWitt Central, South Tama. \nPool 2 (at Van Horne): Marion, Dyersville Beckman, Williamsburg, Anamosa. \nPool 3 (at Van Horne): Western Dubuque, Independence, Solon, Benton Community. \nPool 4 (at Mount Vernon): Center Point-Urbana, Mount Vernon, Vinton-Shellsburg, Maquoketa. \n* * * * *", "external_links": [], "published": "2015-10-14T22:10:00.000+03:00", "crawled": "2015-10-15T21:03:23.570+03:00", "highlightTitle": ""}