{"organizations": ["Blue Jays"], "uuid": "764b6fd87c6c74bd6a4f3ee8ddb0fcc91cad393e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbssports.com", "main_image": "http://sports.cbsimg.net/images/visual/whatshot/CuetoGoinsG3101915.gif", "site_section": "http://news.google.com/news?pz=1&cf=all&ned=us&hl=en&topic=s&output=rss", "section_title": "Sports - Google News", "url": "http://www.cbssports.com/mlb/eye-on-baseball/25346298/with-help-from-cueto-blue-jays-offense-fires-on-all-cylinders-in-game-3", "country": "IL", "title": "With help from Cueto, Blue Jays' offense fires on all cylinders in Game 3 - CBSSports.com", "performance_score": 0, "site": "cbssports.com", "participants_count": 0, "title_full": "With help from Cueto, Blue Jays' offense fires on all cylinders in Game 3 - CBSSports.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T06:53:00.000+03:00", "replies_count": 0, "uuid": "764b6fd87c6c74bd6a4f3ee8ddb0fcc91cad393e"}, "author": "", "url": "http://www.cbssports.com/mlb/eye-on-baseball/25346298/with-help-from-cueto-blue-jays-offense-fires-on-all-cylinders-in-game-3", "ord_in_thread": 0, "title": "With help from Cueto, Blue Jays' offense fires on all cylinders in Game 3 - CBSSports.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mike Axisa", "Cueto"], "text": "With help from Cueto, Blue Jays' offense fires on all cylinders in Game 3 By Mike Axisa | Baseball Writer October 19, 2015 10:13 PM ET \nTORONTO -- The Blue Jays got back to being the Blue Jays in Game 3 of the ALCS Monday night. After being held to three runs total in Games 1 and 2, the Blue Jays broke out for 11 runs in their Game 3 win over the Royals ( TOR 11, KC 8 ), including three runs in the second and six more in the third. \nAfter pitching so brilliantly in Game 5 of the ALDS last week, Johnny Cueto got creamed in ALCS Game 3, allowing eight runs in two-plus innings. In hindsight, the Ryan Goins at-bat in the second inning was a sign Cueto didn't have it in Game 3 and the Blue Jays were getting their offense back on track. \nWith runners at second and third with two outs, Cueto jumped ahead in the count 0-2 to Goins, but simply couldn't put him away. It ended up it being a nine-pitch at-bat that ended with a two-run single. \nCueto threw Goins everything he had in that at-bat. A changeup, a slider and three different types of fastballs: straight four-seamer, sinking two-seamer and a cutter. Goins worked the count full before lacing the two-run single. \n\"Got down 0-2, and then it was a battle\" said Goins after the game. \"There's no need to put any extra pressure on yourself. Just come out and do what I've been doing all season, whatever I can do to help this team win is what I'm going to do.\" \nThat at-bat was the sign Cueto was in trouble, when he was unable to put the No. 9 hitter away with two outs and two on in the second (!) inning. No disrespect to Goins -- hey, he homered later in the game! -- but he's a guy someone like Cueto should carve up. \n\"I thought I made some good pitches that I didn't get the call,\" said Cueto through a translator after Game 3 when asked about the Goins at-bat. \"He battled in his at-bat.\" \nFrom that point on, Cueto was both woefully ineffective and clearly rattled. The Rogers Centre crowd chanted \"Cue-To! Cue-To!\" throughout the night a la the 2013 NL Wild Card game, and it obviously bothered Cueto. He was fidgety on the mound and taking a lot of time between pitches. \nFive consecutive batters reached base to start the third inning against Cueto. A three-run Troy Tulowitzki home run was mixed in there, blowing the game open to give the Blue Jays a 6-2 lead. Cueto faced 17 batters and retired six. Six! \n\"It happens,\" added Cueto. \"I'm confident. This is not going to end here. I'm going to get another shot at it. It's just part of the game.\" \nCueto was terrible and good teams will bludgeon terrible pitching. The Blue Jays strung together quality at-bats, jumped on hittable pitches, and did major damage when Cueto missed over the plate. Four of those 11 runners he allowed reached in two-strike counts. Here's how Inside Edge graded his start : \nThat's a generous overall grade \"D\" in my opinion. Eight runs in two-plus innings is the epitome of an \"F\" start to me. Inside Edge is not as harsh a grader as I am, I suppose. \nAnyway, Cueto was awful, no doubt about it, though the Blue Jays must be credited. Their offense was dormant in Games 1 and 2, but the good at-bats returned in Game 3. The Tulowitzki and Josh Donaldson home runs will get the most attention, but the Goins' at-bat was just as important. That was the approach that had been missing in Games 1 and 2. \n\"I felt like the entire night, we had great at-bats,\" said Donaldson after Game 3. \"Even early on, we worked the pitches. I think (Cueto) had 40 pitches in the second inning. Then (Goins) was able to get that big hit there for us ... We just rolling after that.\" \nForget about the hits and homers for a second. Look at the outs the Blue Jays made. Donaldson struck out in the first inning, but he saw six pitches. Edwin Encarnacion struck out as well, but he saw eight pitches. The Blue Jays forced Cueto to throw 25 pitches in that first inning. It was a grind, and that's what the Toronto offense does best. Grind at-bats then punish mistakes. \n\"Our lineup we feel is second to none. We feel like, sooner or later, we're going to get some breaks here or there, and we're going to score some runs,\" added Donaldson. \"I felt like we were making quality outs ... We really grinded at-bats outs. When (Cueto) did make some mistakes, we were able to make him pay.\" \nThis is similar to what happened in the ALDS, by the way. The Rangers won Games 1 and 2, but the Blue Jays got back to their normal approach in Game 3 to eke out a win, then hammered an ineffective Derek Holland in Game 4. They sped up the process in the ALCS and did that all in Game 3. \nIn a way, both the Blue Jays and Royals have similar offenses in that everyone seems to feed off each other. We've already seen the Royals string together base hit after base hit after base hit to mount remarkable comebacks this postseason. They did it to the Astros in Game 4 of the ALDS and to the Blue Jays in Game 2 of the ALCS. \nThe Blue Jays? They string together long at-bats and hit for power when things are clicking. It's a different style than Kansas City's but both work, though Toronto's approach tends to result in more big innings. The long ball is a rather devastating weapon and the Blue Jays have a lot of players who can go deep. \nCueto's ineffectiveness opened the door for the Blue Jays in Game 3. He was struggling long before the runs piled up and the \"Cue-To! Cue-To!\" chants started. The Blue Jays worked him hard in the first, working him hard in the second, and worked the rest of Royals pitching staff hard all night, resulting in those 11 runs. \n\"We desperately needed that break out,\" said manager John Gibbson \"You look at how the game finished up, those runs really came in handy. It wasn't an easy game, even though we had a big lead ... The home run ball, which is what we're known for, was a huge part of the game.\" \nWith the offense breaking out and the Royals starting the solid but not overpowering Chris Young in Game 4, suddenly the ALCS feels much closer than it did a day or two ago. The Blue Jays got back to doing what they do best and reminded everyone just how devastating they can be in Game 3. \n\"We're going to have to come out tomorrow and play just as good, if not better,\" added Donaldson. \"Tomorrow's a completely new day. We're going to have to come back out and do the same thing tomorrow if not more.\" \nTroy Tulowitzki and the Blue Jays got back to doing what they do best in Game 3. (USATSI)", "external_links": [], "published": "2015-10-20T06:53:00.000+03:00", "crawled": "2015-10-20T07:44:48.438+03:00", "highlightTitle": ""}