{"organizations": ["Notts Peter Moores"], "uuid": "fd06731e0d83e2b19e02a29ebbe124c227999916", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/c881fd2d17609e21cdffd094c5f326e7.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/cricket/peter-moores-signs-twoyear-deal-to-remain-as-coaching-consu/6962130/", "country": "JE", "title": "Peter Moores signs two-year deal to remain as coaching consultant at Notts", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "Peter Moores signs two-year deal to remain as coaching consultant at Notts", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T19:02:00.000+03:00", "replies_count": 0, "uuid": "fd06731e0d83e2b19e02a29ebbe124c227999916"}, "author": "", "url": "http://www.sport.co.uk/cricket/peter-moores-signs-twoyear-deal-to-remain-as-coaching-consu/6962130/", "ord_in_thread": 0, "title": "Peter Moores signs two-year deal to remain as coaching consultant at Notts", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Peter Moores"], "text": "Peter Moores signs two-year deal to remain as coaching consultant at Notts 19 Oct 2015 16:02:05 \ncomments \nFormer England coach Peter Moores has signed a two-year deal to remain coaching consultant at Nottinghamshire after a successful spell at the county this summer. \nMoores was appointed to the role on a short-term contract on June 30 - less than two months after his second unceremonious sacking by England. \nNottinghamshire were facing relegation in the LV= County Championship on Moores' arrival, but the former Sussex and Lancashire coach oversaw a dramatic reversal of fortunes. \nThe Trent Bridge club won 14 of their final 20 fixtures in all formats, ensuring a third place finish in Division One, while they were semi-finalists in the Royal London One-Day Cup. \n\"Working as coaching consultant at Trent Bridge has been a fantastic fit for me, giving me the freedom to work closely with both the players and coaches on a day to day basis,\" said Moores. \n\"The role gives me the opportunity to do specific one to one work with the players to support them to be at the top of their game throughout the season. \n\"Our performances in the second half of last season showed the potential of the group and if we can build on that next season, we will put ourselves in a position to enjoy some success.\" \nNottinghamshire's director of cricket Mick Newell credited Moores' input, as well as captain Chris Read's return from injury and the emergence of several talented youngsters, as the reason for their strong finish to the campaign. \n\"He brought enthusiasm and energy to the role as well as a lot of experience that our players and coaches really benefited from,\" said Newell. \n\"It was originally a short-term appointment but, with Peter very much enjoying being a part of things, we had the opportunity to make it more permanent, which is terrific for us. \n\"He'll continue to work alongside the existing coaches - something that has worked well in 2015 - and hopefully he can help us enjoy a successful next couple of seasons.\" Related Sport News", "external_links": [], "published": "2015-10-19T19:02:00.000+03:00", "crawled": "2015-10-20T20:14:53.698+03:00", "highlightTitle": ""}