{"organizations": [], "uuid": "c087c03530823dc4c595ae6b806db84ef8d63c30", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "http://images.tribuneindia.com/cms/gall_content/2015/10/2015_10$largeimg12_Monday_2015_013500738.jpg", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/jammu-kashmir/article-370-can-t-be-changed-abrogated-j-k-high-court/144930.html", "country": "US", "title": "Article 370 can’t be changed, abrogated: J&K High Court", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "Article 370 can’t be changed, abrogated: J&K High Court", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "c087c03530823dc4c595ae6b806db84ef8d63c30"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/jammu-kashmir/article-370-can-t-be-changed-abrogated-j-k-high-court/144930.html", "ord_in_thread": 0, "title": "Article 370 can’t be changed, abrogated: J&K High Court", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Majid Jahangir\nTribune News Service\nSrinagar, October 11\nThe Jammu and Kashmir High Court has described Article 370, which gives special status to the state, as a permanent provision of the Constitution that cannot be “abrogated, repealed or even amended”. The High Court observations gain significance as an RSS-backed think tank has challenged the constitutional validity of Article 35A in the Supreme Court. A Division Bench of the High Court comprising Justice Hasnain Massodi and Justice Janak Raj Kotwal held that Article 370, though titled as a “temporary provision”, has assumed place of permanence in the Constitution. The court said the Article was beyond “amendment, repeal or abrogation” as the Constituent Assembly of the state did not recommend its amendment or repeal before its dissolution. The High Court observation came in connection with petitions filed by general category government officials to challenge government orders promoting officials junior to them under the Reservation Act and Rules. The petitioners are members of J&K Engineering (Gazetted) Service Hydraulic Wing, J&K Law Officers (Subordinate) Service, J&K Engineering (Gazetted) Service, J&K Animal Husbandry (Gazetted) Service. The court said the reservation provisions made in terms of Section 6 of the Reservation Act and Reservation Rules 9, 10 and 34 were invidious and unconstitutional. The petitioners had pleaded since the 77th Constitutional Amendment Act, 1995, had not been extended to the state by a Presidential order under Clause (1) of Article 370, it was not applicable to the state. The Constituent Assembly of Jammu and Kashmir didn’t make any recommendation on amendment or repeal of Article 370 before its dissolution on January 25, 1957, the court said. “Resultantly, Article 370, notwithstanding its title showing it a ‘temporary provision’, is a permanent provision of the Constitution. It cannot be abrogated, repealed or even amended as mechanism provided under Clause (3) of Article 370 is no more available,” the court observed. Reactions from Political parties The Jammu and Kashmir High Court order has reflected the strength of the Constitution and reaffirmed the sanctity of Article 370 - Nizam-u-Din Bhat, PDP General Secretary The HC decision should settle the issue once for all. The issue was being raised by the PDP-BJP government to address a constituency other than J&K - Nasir Wani, Provincial President, NC As a political party, our ideology is abrogation of Article 370. We are in a coalition government and will adhere to the agenda of alliance. - Khalid Jehangir, J-K BJP Spokesman The HC has given cogent reasons on how the Article, despite being described as temporary in the Constitution, it has assumed permanence - Saifuddin Soz, Congress Leader", "external_links": [], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-12T00:15:10.172+03:00", "highlightTitle": ""}