{"organizations": ["Tim Sherwood Aston Villa", "Aston Villa", "Premier League"], "uuid": "f0e9164174fa4de9854891aa2f3df534df07a06d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribtown.com", "main_image": "http://d1bdhkmqqz901h.cloudfront.net/1200x630/smart/s3.amazonaws.com/hne-smedia/4/8/48c0d080ec0e47689b1146aa203bc748/web_full_356502910212.jpg", "site_section": "http://tribtown.com//feed/sec/6000", "section_title": "TribTown.com - Sports News", "url": "http://www.tribtown.com/view/story/48c0d080ec0e47689b1146aa203bc748/SOC--Aston-Villa-Swansea", "country": "US", "title": "Aston Villa loses 2-1 to Swansea in the Premier League as pressure grows on Tim Sherwood", "performance_score": 0, "site": "tribtown.com", "participants_count": 0, "title_full": "Aston Villa loses 2-1 to Swansea in the Premier League as pressure grows on Tim Sherwood", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T20:33:00.000+03:00", "replies_count": 0, "uuid": "f0e9164174fa4de9854891aa2f3df534df07a06d"}, "author": "", "url": "http://www.tribtown.com/view/story/48c0d080ec0e47689b1146aa203bc748/SOC--Aston-Villa-Swansea", "ord_in_thread": 0, "title": "Aston Villa loses 2-1 to Swansea in the Premier League as pressure grows on Tim Sherwood", "locations": ["Swansea"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tim Sherwood"], "text": "Aston Villa loses 2-1 to Swansea in the Premier League as pressure grows on Tim Sherwood THE ASSOCIATED PRESS   1:32   1:33   \nPeople: \nUnited Kingdom (463) Photos: \nAston Villa's Leandro Bacuna, left, vies for the ball with Swansea City's Sung Yeung Ki, during the English Premier League soccer match between Aston Villa and Swansea City, at Villa Park, in Birmingham, England, Saturday Oct. 24, 2015. ( Scott Heavey/PA Photo via AP) UNITED KINGDOM OUT \nBIRMINGHAM, England — Aston Villa surrendered a second-half lead to lose 2-1 at home to Swansea on Saturday and increase the pressure on manager Tim Sherwood after a sixth consecutive defeat in the Premier League. \nVilla had taken the lead in the 62nd minute when striker Jordan Ayew scored his first goal for the club with a diving header. That came just a minute after his brother, Andre Ayew of Swansea, was denied by United States goalkeeper Brad Guzan at the other end. \nBut Gylfi Sigurdsson equalized for Swansea six minutes later, whipping a free kick beyond Guzan from 30 yards (meters), after he was fouled by Villa captain Micah Richards. \nAnd Swansea got the winner when Andre Ayew prodded in Kyle Naughton's cross in the 87th. \nSherwood, who has not won a league game since the opening day of the season against Bournemouth, said he was \"gutted\" that his side had come away empty-handed. \nMore importantly, he would not be drawn about his future, with Villa mired in the relegation zone — four points from safety. \n\"It is not about me personally, it is about the football club and the players,\" he told Sky Sports. \"We are all in it together and we are in a bit of a mess at the moment. \n\"I can't affect anyone who makes the decisions at the football club. I'll keep working as hard as I can.\" \nThe first half was littered with errors and sloppy play but Federico Fernandez should have fired Swansea ahead after 13 minutes — instead ballooning his effort over the top. \nThe game only sparked into life after the two moments involving the Ayew brothers. \nFirst, Swansea's Andre Ayew was denied by a fine point-blank save from Guzan after the keeper rushed out to block the striker's effort from Bafetimbi Gomis' cross. \nInstantly, Villa broke and Gabriel Agbonlahor worked his way into the area to set up Jordan Ayew, who was left free at the far post to head home. \nHowever, Villa's lead was short-lived as Richards brought down Sigurdsson and the midfielder brilliantly curled into the bottom corner from 25 yards (meters). \nIt took the sting out of Villa and the home side struggled to break down the well-drilled Swans. \nThe Ayew brothers swapped half chances in the final 10 minutes before Andre had the final say with three minutes left. Villa was too open on the right and allowed Naughton to cross for an easy finish from close range. \nIt was a damming blow for Villa and there seemed to be drama after the final whistle as the players came off, with the tunnel rocking from side to side forcing stewards to rush in. \n\"We are in a difficult moment at the moment,\" Sherwood said. \"We will get out of it... It is not effort and desire that is the problem. It is a little bit of quality.\" \n ", "external_links": [], "published": "2015-10-24T20:33:00.000+03:00", "crawled": "2015-10-24T22:47:58.969+03:00", "highlightTitle": ""}