{"organizations": ["Detroit Lakes", "Rocori"], "uuid": "9d33469c11438cec0c2d3dbaf4020683f7a9de45", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sctimes.com", "main_image": "http://www.gannett-cdn.com/-mm-/ce01e269d07f914e3833ea1b6cbcc800431c0c51/c=3-0-1277-720&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/16/StCloud/StCloud/635805869276673605-rocori-dl.jpg", "site_section": "http://rssfeeds.sctimes.com/stcloud/highschoolsports", "section_title": "St. Cloud - High School Sports", "url": "http://www.sctimes.com/story/sports/high-school/2015/10/17/prep-football-rocori-pummels-detroit-lakes-33-0/74013248/", "country": "US", "title": "Prep football: Rocori pummels Detroit Lakes, 33-0", "performance_score": 0, "site": "sctimes.com", "participants_count": 0, "title_full": "Prep football: Rocori pummels Detroit Lakes, 33-0", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T06:40:00.000+03:00", "replies_count": 0, "uuid": "9d33469c11438cec0c2d3dbaf4020683f7a9de45"}, "author": "", "url": "http://www.sctimes.com/story/sports/high-school/2015/10/17/prep-football-rocori-pummels-detroit-lakes-33-0/74013248/", "ord_in_thread": 0, "title": "Prep football: Rocori pummels Detroit Lakes, 33-0", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tom Elliott"], "text": "Prep football: Rocori pummels Detroit Lakes, 33-0 Tom Elliott , telliott@stcloudtimes.com 10:40 p.m. CDT October 17, 2015 Spartans' line play the difference in 8-4A semifinal victory Rocori vs. Detroit Lakes (Photo: Graphic) \nDETROIT LAKES — For all that is made of the finesse aspect of Rocori football, this one was all about the trenches. \nRocori dominated line play, overpowering the power running attack of Detroit Lakes. It added up to a 33-0 win over the second-seeded Lakers on a perfect Saturday night at Mollberg Field. \n\"It was old school, right?\" said Rocori head coach Mike Rowe, who got a visit from his parents. They made the trip from Canada. \"The running game was big for both teams. \n\"It was just a lot of physical play up front. I was just very pleased with our play on the line.\" \nThe victory sends the third-seeded Spartans to the Section 8-4A championship game for the second straight year. \nRocori (7-3) plays fourth-seeded Willmar at 7 p.m. Friday at a site to be determined. The site will be finalized Monday. At stake is a state playoff berth. \n\"That's the goal,\" Spartans junior defensive lineman Colten Schramel said. \"We set our goals high.\" \nThe Cardinals (5-5) beat top-seeded Fergus Falls 27-24 in overtime Saturday. Rocori beat Willmar 41-20 on Aug. 28 in Cold Spring. \nThe Spartans believe that playing their North Central District Red Division schedule helps prepare them for the playoffs. They play Class 5A schools and occasionally take a few lumps. \n\"I'd rather be 5-3 than 8-0 if it gets us ready for the playoffs,\" Rocori senior lineman Tyler Botten. \n\"Definitely,\" Schramel. \"It gets us ready.\" \nRocori spends a lot of time passing and being deceptive in their regular-season games against the likes of Sauk Rapids, St. Cloud Tech, Sartell and Bemidji. All are 5A schools. Detroit Lakes played no 5A team this season. \nThis day, the Spartans did the brunt of their most impressive work between the tackles. Rocori rushed for 194 yards and three touchdowns on 47 carries. \nNick Warne led the way. The junior running back/defensive tackle had 18 carries for 108 yards and a touchdown and caught two passes for 24 yards. \nMeanwhile, the Spartans held Detroit Lakes to 119 yards rushing on 34 carries. Ben Nordmark, a 6-foot-1, 215-pound sophomore, rushed 20 times for 94 yards. A big chunk of it came on a 54-yard run on the Lakers' first offensive play of the third quarter. \nIt was the first time Nordmark had been held to less than 100 yards this season. He ran for nearly 1,900 yards this season. \nBut right after Nordmark's big gain to the Rocori 11, the Lakers fumbled. It was a play that was indicative of Detroit Lakes' night. \n\"They're a physical football team,\" Rowe said of the Lakers. \"I'm very pleased. \n\"I think our district (the North Central Red) helps us prepare for that.\" \nThe Spartans' Nathan Thorpe, Alex Maseltar and Ryan Vigil each had fumble recoveries. All three recoveries were deep in Detroit Lakes territory. Maseltar's and Vigil's big plays eventually turned into Rocori touchdowns. \n\"We were physical,\" said Botten, who at 6-6 and 315 pounds teams with Matt Waletzko (6-6, 295, so.) to give the Spartans half of a college-sized offensive line. \"We came off the ball hard and controlled the ball. \n\"And we won the turnover battle.\" \n\"Our coaches said if we win the turnover battle, we'll win the game,\" Schramel said. \nRocori had one fumble lost. It clearly was one big difference in the Spartans recording their first shutout of the season. \nAnd the Spartans passed well, too. Junior quarterback Connor Schoborg completed 18 of 31 passes for 185 yards and two touchdowns, one each to his bookend receivers: 6-7 Derek Thompson and 6-5 Alec Anderson. \nDetroit Lakes, meanwhile, lost starting quarterback Josh Bollig to an injury. He had been nursing a bad ankle and was replaced by Nick Aguilar. \nThe Lakers threw 16 times, completing four for 61 yards. There were a couple of trick plays that didn't work. \nBy midway through the fourth quarter, both teams had removed their starters. Rocori is in the section final. \n\"It feels good,\" Botten said. \"That's what we play for. \n\"It's what we put in all the time for.\" \nFirst quarter \nR — Derek Thompson 11 pass from Connor Schoborg (Nick Skluzacek kick) \nSecond quarter \nR — Nick Warne 7 run (Skluzacek kick) \nThird quarter \nR — Alec Anderson 5 pass from Schoborg (kick blocked) \nFourth quarter \nR — Schoborg 3 run (Skluzacek kick) \nR — Dylan Parsons 7 run (kick failed) \nIndividual statistics \nRushing: R — Warne 18-108, Tommy Wieber 10-31, Parsons 2-18, Gunnar Feldhege 7-9, Ben Hoffman 3-8, Mason Primus 1-6, Schoborg 5-3, Skluzacek 1-1. Total: 47-194. DL — Ben Nordmark 20-94, Cameron Erb 2-11, Nick Aguilar 6-9, Sam Busker 2-4, Aaron Schnathurst 1-1, Jackson Haire 1-1, Josh Bollig 2-(-1). Total: 34-119. \nPassing: R — Schoborg 18-31-0 185. DL — Aguilar 3-10-0 32, Bollig 1-5-0 29, Jacob Richter 0-1-0 0. Total: 4-16-0 61. \nReceiving: R — Thompson 4-36, Anderson 4-26, Feldhege 3-48, Warne 2-24, Jordan Barth 2-21, Skluzacek 2-16, Mitchell Heinen 1-14. DL — Matt Haire 2-38, Isaac Cihak 1-19, Richter 1-4. \nFollow Tom Elliott on Twitter @sctimestom or call 259-3661. 4 CONNECT 3 TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http://www.sctimes.com/story/sports/high-school/2015/10/17/prep-football-rocori-pummels-detroit-lakes-33-0/74013248/ TOP VIDEOS", "external_links": [], "published": "2015-10-18T06:40:00.000+03:00", "crawled": "2015-10-18T08:20:16.323+03:00", "highlightTitle": ""}