{"organizations": [], "uuid": "5659e25372d121bfd6e7515774c2fa95138980c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48531/c", "section_title": "Sports - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30349749/boys-girls-clubs-of-america-and-nestl-kick-off-national-fitness-challenge", "country": "US", "title": "Boys & Girls Clubs of America and Nestlé Kick Off National Fitness Challenge", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Boys & Girls Clubs of America and Nestlé Kick Off National Fitness Challenge - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:00:00.000+02:00", "replies_count": 0, "uuid": "5659e25372d121bfd6e7515774c2fa95138980c1"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30349749/boys-girls-clubs-of-america-and-nestl-kick-off-national-fitness-challenge", "ord_in_thread": 0, "title": "Boys & Girls Clubs of America and Nestlé Kick Off National Fitness Challenge", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Information contained on this page is provided by an independent third-party content provider. WorldNow and this Station make no warranties or representations in connection therewith. If you have any questions or comments about this page please contact pressreleases@worldnow.com .\nSOURCE Boys & Girls Clubs of America\nCompetition Aims to Get Kids to Commit to Be Fit\nBAKERSFIELD, Calif. , Oct. 26, 2015 /PRNewswire-USNewswire/ -- Boys & Girls Clubs of America (BGCA) and Nestlé in the United States held a National Fitness Challenge event this past weekend at Shirley Lane Elementary in Bakersfield, California . As part of their three-year national partnership, BGCA and Nestlé are challenging Clubs around the country to inspire local kids to achieve tangible short-term fitness goals. As the nation's number one advocate for youth, BGCA has set bold goals to enable more kids to achieve a great future, including logging 4 billion hours of physical activity from Club kids and teens by 2018.\nThe event featured Paralympic athlete and Boys & Girls Club alum Blake Leeper , who helped jump-start the competition with 200 kids from Boys & Girls Clubs of Bakersfield . Blake, who hopes to be the first American to compete in both the Paralympic and Olympic Summer Games in 2016, shared his experience with fitness and how Boys & Girls Clubs helped him develop his athletic skills.\n\"It's great to be here with Nestlé and Boys & Girls Clubs again to participate in the National Fitness Competition,\" said Blake Leeper . \"Fitness and health have always been an important part of my life, and I'm very passionate about educating and getting kids motivated to be fit. Thanks to Nestlé, Club kids around the country are going to get a chance to participate in the National Fitness Challenge each spring and fall.\"\nThrough Nestlé's support, the National Fitness Challenge will enable Clubs to host fitness competitions for kids and teen members, to encourage a competitive spirit and challenge members to achieve tangible fitness goals.\n\"We are excited to hold our National Fitness Competition in Bakersfield with Boys & Girls Clubs,\" said Paul Grimwood , chief executive officer of Nestlé USA . \"Childhood obesity is a growing problem, and we are working hard to help reverse the trend with programs that promote physical activity and nutrition education. We're thrilled to partner with the Boys & Girls Clubs in this journey.\"\nThe National Fitness Competition kicked off with Boys & Girls Clubs of Cleveland in July, and has expanded to more than 100 Clubs. Clubs host their local competitions each fall and spring with activities that are broken out by gender, age group and various levels of competition. By the program's third year, the National Fitness Competition is expected to reach 500 Clubs, engaging a total of 50,000 young people.\nA longtime supporter of Boys & Girls Clubs in local markets around the country, Nestlé and BGCA announced a three-year national partnership in April 2015 . In addition to the expanded partnership, Nestlé also provides ongoing local volunteer support to Clubs around the country. The program complements much of Nestlé's work in nutrition education at the community level, including a partnership with the National Education Association Healthy Futures to provide nutrition curriculum to K-6 educators and the students they serve.\nAbout Nestlé in the United States\nNestlé in the United States is committed to being a trusted leader in nutrition, health and wellness. Our diverse portfolio of food and beverage products provide nutritious options for every member of the family, including infants, toddlers, teens and adults, mature adults, and dogs and cats. Nestlé in the U.S. consists of seven main businesses: Nestlé USA , Nestlé Purina PetCare Company, Nestlé Waters North America, Nestlé Nutrition, Nestlé Professional, Nespresso and Nestlé Health Science. Together, these companies operate in more than 120 locations in 47 states and employ over 51,000 people. The United States is Nestlé S.A.'s largest market with combined product sales in the United States totaling more than $26 billion in 2014.\nAt Nestlé, we believe that for our business to prosper in the long term, we must create value for our employees, customers, stakeholders, consumers and the communities where we live and work. Nestlé embeds Creating Shared Value (CSV) into every part of its business, from nutrition and wellness to environmental sustainability and responsible sourcing. For more information, visit: http://www.nestleusa.com/creating-shared-value .\nAbout Boys & Girls Clubs of America\nFor more than 100 years, Boys & Girls Clubs of America (GreatFutures.org) has enabled young people most in need to achieve great futures as productive, caring, responsible citizens. Today, more than 4,100 Clubs serve nearly 4 million young people annually through Club membership and community outreach. Clubs are located in cities, towns, public housing and on Native lands throughout the country, and serve military families in Boys & Girls Clubs of America-affiliated Youth Centers on U.S. military installations worldwide. They provide a safe place, caring adult mentors, fun, friendship, and high-impact youth development programs on a daily basis during critical non-school hours. Priority programs emphasize academic success, good character and citizenship, and healthy lifestyles. In a Harris Survey of alumni, 54 percent said the Club saved their lives.\nPhoto - http://photos.prnewswire.com/prnh/20151026/DC38069-b\nPhoto - http://photos.prnewswire.com/prnh/20151026/DC38069-a\nLogo - http://photos.prnewswire.com/prnh/20130710/MM44829-b\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/boys--girls-clubs-of-america-and-nestle-kick-off-national-fitness-challenge-300166001.html\n©2015 PR Newswire. All Rights Reserved.", "external_links": ["http://photos.prnewswire.com/prnh/20151026/DC38069-a", "http://photos.prnewswire.com/prnh/20151026/DC38069-b", "http://www.nestleusa.com/creating-shared-value", "http://www.xmlnews.org/ns/", "http://www.greatfutures.org/", "http://photos.prnewswire.com/prnvar/20151026/DC38069-b", "http://photos.prnewswire.com/prnvar/20151026/DC38069-a", "http://photos.prnewswire.com/prnh/20130710/MM44829-b", "http://photos.prnewswire.com/prnvar/20130710/MM44829-b", "http://rt.prnewswire.com/rt.gif?NewsItemId=DC38069&Transmission_Id=201510261116PR_NEWS_USPR_____DC38069&DateId=20151026", "http://www.prnewswire.com/news-releases/boys--girls-clubs-of-america-and-nestle-kick-off-national-fitness-challenge-300166001.html"], "published": "2015-10-26T02:00:00.000+02:00", "crawled": "2015-10-26T19:07:15.849+02:00", "highlightTitle": ""}