{"organizations": [], "uuid": "0b6fdd224924194b3a44141e1d9b74c9b00e7aae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.indiatvnews.com", "main_image": "http://images.indiatvnews.com/sportssoccer/IndiaTv26c937_pele-in-kolkata.jpg", "site_section": "http://www.indiatvnews.com/rssfeed/sports_soccer_news.php", "section_title": "Sports >> Soccer News", "url": "http://www.indiatvnews.com/sports/soccer/mamata-sourav-rahman-celebrate-pele-s-birthday-6832.html", "country": "SG", "title": "Mamata, Sourav, Rahman celebrate Pele's birthday", "performance_score": 0, "site": "indiatvnews.com", "participants_count": 0, "title_full": "Mamata, Sourav, Rahman celebrate Pele's birthday", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T15:37:00.000+03:00", "replies_count": 0, "uuid": "0b6fdd224924194b3a44141e1d9b74c9b00e7aae"}, "author": "", "url": "http://www.indiatvnews.com/sports/soccer/mamata-sourav-rahman-celebrate-pele-s-birthday-6832.html", "ord_in_thread": 0, "title": "Mamata, Sourav, Rahman celebrate Pele's birthday", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sourav", "Mamata", "Pele", "Rahman", "Messi"], "text": "Messi the best in last 10 years, no intention to head FIFA: Pele \nKolkata: His birthday is still some days away but football legend Pele had the celebrations here on Monday, as Academy Award winning music composer A.R. Rahman sang the 'Happy birthday' jingle, and former Indian skipper Sourav Ganguly clapped in reverence. \nFelicitated by West Bengal Chief Minister Mamata Banerjee, Pele cut the birthday cake -- in the shape of the Jules Rimet trophy that Brazil permanently won by triumphing in the 1970 World Cup -- during a glittering ceremony at the Netaji Indoor Stadium, with thousands of fans of all ages chanting the legend's name. \nFlanked by the chief minister and Ganguly, a visibly emotional Pele expressed his gratefulness. \"I thank God for this day,\" said the legend. \nRahman, who has composed the music for the upcoming biopic on Pele, also sang a line of his \"Jai Ho\" song. \nPele will complete 75 on October 23. \nAt the surprise birthday celebration, the first slice of the dessert was handed over by Banerjee to Pele. \nThe football icon thanked the organisers for the effort. \n\"Thank you God for this day, for giving me this moment. Thanks to everyone who made it possible. People worked very hard to give me this opportunity. God puts you in right places with the right people and now I am with the new generation,\" he said. \nRahman, who is creating music for Pele's biopic \"Pele: Birth of a Legend\", said he was \"excited\" to meet the 74-year-old. \n\"I watched the movie not knowing who Pele was. I probably cried three times in the movie. I wanted to see the real Pele. This is the first time that I am meeting him, he is an amazing personality and inspiration,\" Rahman said after he wielded the microphone to croon \"Jai Ho\". \nPele, considered the greatest striker, will be celebrating his birthday at Buckingham Palace with Queen Elizabeth on October 23. \nPele, only player to win three FIFA World Cups, arrived in the city on Sunday, and will attend the Indian Super League (ISL) defending champions Atletico de Kolkata's home game against Kerala Blasters on Tuesday, where he will be the guest of honour. \n ", "external_links": [], "published": "2015-10-13T15:37:00.000+03:00", "crawled": "2015-10-13T12:59:11.223+03:00", "highlightTitle": ""}