{"organizations": [], "uuid": "2d6e3db11cd54c0bb39f377bfdc60048d9a4314b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eagletribune.com", "main_image": "http://bloximages.chicago2.vip.townnews.com/eagletribune.com/content/tncms/assets/v3/editorial/6/37/637830a0-42c1-5a11-9dac-43fdc481cb49/5627ff2825a12.image.jpg", "site_section": "http://www.eagletribune.com//search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&nsa=eedition&c[]=sports,sports/*&f=rss", "section_title": "Eagle-Tribune - sports,sports/", "url": "http://www.eagletribune.com/sports/national_sports/dumb-play/article_47b93162-7528-5733-97ac-344a4a5b26a8.html", "country": "US", "title": "Dumb play?", "performance_score": 0, "site": "eagletribune.com", "participants_count": 1, "title_full": "Dumb play?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T09:00:00.000+03:00", "replies_count": 0, "uuid": "2d6e3db11cd54c0bb39f377bfdc60048d9a4314b"}, "author": "Bill Burt bburt@eagletribune.com", "url": "http://www.eagletribune.com/sports/national_sports/dumb-play/article_47b93162-7528-5733-97ac-344a4a5b26a8.html", "ord_in_thread": 0, "title": "Dumb play?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Dumb play? By Bill Burt bburt@eagletribune.com Eagle-Tribune \nBrooks School football coach Pat Foley knows Chuck Pagano's pain, of course, minus the millions of national TV viewers, tweets and media columns who mocked the broken play as one of the most embarrassing in pro football history. \n\"We faked a punt earlier this year and we were unsuccessful,\" said Foley. \"The risk-reward of those types of plays is a fine line. They're obviously meant to confuse the other team, but sometimes you end up confusing yourselves even more. It's seems like that's what happend (to the Colts and Pagano) in this case.\" \nCome Sundays, most area football coaches are pro football fans, like the rest of us. And most of our area coaches not only love the Patriots, but appreciate their head coach Bill Belichick. \nIn fact, Phillips Andover Academy football coach Leon Modeste not only appreciates Belichick, he knows the Patriots coach very well. Belichick did a post-graduate year at Andover and he makes stops at the school every year and usually catches up with Modeste. \n\"It looked like the old 'swinging gate' play that many high school teams run on point after attemps or punts to see if they can catch you off guard,\" said Modeste. \"If you are prepared for it it can be be defended pretty easily. What it does is eat up your practice time getting ready to defend it. We had to prepare for a version of it at Cushing last weekend. \n\"But Cushing did it much better than the Colts. The Colts version was a disaster from the start because they had it misaligned,\" said Modeste, referring to the fact the Colts were penalized because they didn't have enough players on the line of scrimmage. \"And did they really think the Pats wouldn't be ready?\" \nAs for the gadget play that failed, all the coaches contacted said they have their own trick plays on punts and extra points. \nLondonderry High coach Jimmy Lauzon recalled being in the same position as the Colts were earlier this season, hanging with a very good team and empathizes somewhat with Pagano's plight. \n\"When you're a 10.5 point underdog like the Colts were, you want to take some chances,\" said Londonderry High coach Jimmy Lauzon. \"But it seemed to me like they were hanging with the Patriots. I made the same mistake versus Exeter this season and we also lost by one score so, of course, I regret it since it didn't work. \n\"Last year we were five-for-five in fakes and I was this genius coach,\" said Lauzon. \"This year we are one-for-five and all of a sudden I take too many chances. Hindsight is 20-20. There is no way of telling.\" \nAndover High coach E.J. Perry, who is noted for his high-powered, complex offensive scheme, said he has a hard time making fun of any coach, particularly a professional one. In fact, his brother, John, is an assistant for the Houston Texans. \n\"The Colts felt like they had to do some special things against the Patriots to win. I get that,\" said Perry. \"They had a solid gameplan script as we saw on their first drive for a touchdown. The onside kick they ran was well done. In fact, it appeared they got the ball. And that fake punt, I believe, was to draw the Patriots offsides. \n\"My brother John reminds me how intense the NFL is, but because of 'deflagate' and the perceptions of what the Colts did to the Pats, this game drew a huge national audience and was going to be a spectacle no matter what,\" said Perry. \nPerry had no issues with the call for a fake punt, if it was there to possibly draw a penalty. It was all the other stuff that followed that befuddles him. \n\"The punt was a good concept -- something we use without spreading the field as much,\" he said. \"The flaws in his punt were many though. It is discouraging to hear that the snapper had never practiced the play. Rule 101 of football and really any coaching: Don't install on Game Day. Installation means game planning and every football coach knows that installation happens the first two days of practice for the next week. Then it's all repitition, which is the key element in all three phases of football. \n\"If Pagano didn't rep the play, the play should not have been run. It also seems to me that many of the players didn't rep the play because while the snapper and the coach are getting much of the blame, one whole side of the line was lined up illegally. My belief was their was way too much risk and not enough reward in this situation.\" \nCentral Catholic coach Chuck Adamopoulos said Everett High runs a \"swing gate\" play, oftentimes looking for the right mismatch, trying outnumber the defenders. \n\"We practiced it all week,\" said Adamopoulos. \"And they tried it and still made it against us.\" \nMethuen coach Tom Ryan said every team at every level has plays like the one called by the Colts. When they work, the coach is a genius. And then they don't, well, you're coach Pagano for a week. \n\"The intention of the Colts was, I believe, to catch the Patriots in a substitution fiasco and make them burn a timeout or get a penalty, which is a good concept,\" said Ryan. \"I am not going to knock them for trying to do something out of the ordinary to beat the Patriots. However, I had issue with the entire right side of the line lining up offsides. Even if they caught the Patriots in a substitution with 12 men on the field penalty, it would have been negated by an illegal formation. \n\"Coach Pagano should have instantly recognized this because it was on his sideline, that they did not have enough men on the line of scrimmage and called a timeout,\" said Ryan. \"This is where he is at most fault. Unfortunately at the NFL level, it's things like this that get you fired.\" \nIn the end, Adamopoulos said, under those conditions, with the game being very close, Pagano could have saved himself a lot of grief if he went with the conventional play. \n\"Just punt the ball,\" said Adamopoulos. \"It was a close game. They could have pinned the Patriots deep in their own end. But what do I know?\" \nYou can email Bill Burt at bburt@eagletribune.com . Sign Up / Sign In With your existing account from... {* loginWidget *}", "external_links": [], "published": "2015-10-22T09:00:00.000+03:00", "crawled": "2015-10-22T10:16:59.851+03:00", "highlightTitle": ""}