{"organizations": [], "uuid": "4c9c26bb3a166cde32bebceca40656db3db19d84", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.vindy.com", "main_image": "http://media.vindy.com/content/image/a/5/logo/v5logo.gif", "site_section": "http://www.vindy.com/rss/headlines/kindle/sports", "section_title": "Vindy.com stories: Sports News", "url": "http://www.vindy.com/news/2015/oct/21/malkins-ot-goal-rockets-pens-to-win/", "country": "US", "title": "Malkin’s OT goal rockets Pens to win", "performance_score": 0, "site": "vindy.com", "participants_count": 0, "title_full": "Malkin’s OT goal rockets Pens to win", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T07:00:00.000+03:00", "replies_count": 0, "uuid": "4c9c26bb3a166cde32bebceca40656db3db19d84"}, "author": "", "url": "http://www.vindy.com/news/2015/oct/21/malkins-ot-goal-rockets-pens-to-win/", "ord_in_thread": 0, "title": "Malkin’s OT goal rockets Pens to win", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Malkin"], "text": "Published: Wed, October 21, 2015 @ 12:00 a.m. hockey \nPITTSBURGH \nAll was right for the Pittsburgh Penguins, at least for one game. \nTheir slumping captain finally found the scoresheet, two of their other stars also scored and a powerless power-play finally came through. \nThe Penguins and their dynamic collection of forwards hope it’s a sign of things to come. \nEvgeni Malkin scored at 1:21 into overtime on the second power play of the game and Sidney Crosby picked up his first goal of the season to lead the Penguins to a 3-2 victory over the Florida Panthers on Tuesday night. \n“I thought we generated some good chances all night,” Crosby said. “Could’ve had more, but it’s nice to see that first one go in.” \nMalkin’s third goal in as many games withstood a video review. He took a pass from Kris Letang at the top of the right circle and fired a slap shot past Roberto Luongo. The Penguins scored two power-play goals after entering on an 0-for-17 slump with the man advantage and nearing a franchise-worst 0-for-21 streak to begin the season. \nCrosby netted his first three points of the season on the first-period goal and two assists. \nPhil Kessel scored his second goal and Malkin has five points during a four-game point streak for the Penguins, who won their third straight. Marc-Andre Fleury, who has won 10 of 12 against the Panthers, stopped 31 shots. \nQuinton Howden and Derek MacKenzie scored goals for the Panthers, who battled back from a two-goal deficit despite a disallowed goal early in the third period. Luongo made 32 saves for Florida, which lost its second straight after opening the season with three wins in four games. \n“It was a frustrating night for sure,” Panthers coach Gerard Gallant said. “We thought we scored a goal, but it was disallowed. We thought they scored, we wanted to challenge and didn’t get a chance. There were some frustrating calls for sure.” \nTrailing 1-0, Florida thought it had the equalizer 1:16 into the third when Reilly Smith deflected Brian Campbell’s point shot between Fleury’s legs. But the goal was disallowed after a lengthy video review because of a high stick on the puck. \nKessel extended the Penguins’ lead two minutes later. \nLuongo had trouble gloving Rob Scuderi’s shot from the top of the circle. The rebound fell to the ice between Willie Mitchell’s skates where Kessel swept it into the net. \nHowden pulled the Panthers within a goal, 2-1, midway through the period, setting the stage for another momentum shift. Other stories of interest", "external_links": [], "published": "2015-10-21T07:00:00.000+03:00", "crawled": "2015-10-21T17:02:40.710+03:00", "highlightTitle": ""}