{"organizations": [], "uuid": "ce056fe2f4669e9a4420075048c1f4514f37a12d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-56269708/turbine/ct-college-of-dupage-robert-breuder-fired-20151020", "site_section": "http://www.chicagotribune.com/", "section_title": "Chicago Tribune: Chicago breaking news, sports, business, entertainment, weather and traffic - Chicago Tribune", "url": "http://www.chicagotribune.com/news/watchdog/cod/ct-college-of-dupage-robert-breuder-fired-20151020-story.html", "country": "US", "title": "College of DuPage board to vote on firing Robert Breuder", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "College of DuPage board to vote on firing Robert Breuder - Chicago Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T22:20:00.000+03:00", "replies_count": 0, "uuid": "ce056fe2f4669e9a4420075048c1f4514f37a12d"}, "author": "Jodi S. Cohen, Stacy St. Clair", "url": "http://www.chicagotribune.com/news/watchdog/cod/ct-college-of-dupage-robert-breuder-fired-20151020-story.html", "ord_in_thread": 0, "title": "College of DuPage board to vote on firing Robert Breuder", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "After months of public controversy and numerous investigations, embattled College of DuPage President Robert Breuder's career could come to an end Tuesday night, when the school's rancorous board of trustees takes up a vote on whether to fire him.\nBreuder's termination from the largest community college in the state would scuttle the lucrative $763,000 severance package he negotiated to leave next March, three years before his contract expired. That deal, reached earlier this year but vilified by the college community and state lawmakers, led to the election of three new trustees who vowed to find a way to fire Breuder and revoke the severance agreement.\n\"This is a very serious time at the college, and it comes after six months of investigation,\" said board Chairwoman Katharine Hamilton. \"All of the evidence has been made available to trustees. This is a big step for a new future for the college and ends the Breuder era.\"\nThe resolution to terminate Breuder, 71, lists eight reasons for the decision, including excessive spending, poor financial oversight and failing to respond to requests made under the state's open records laws.\nHamilton is expected to have the four votes necessary to approve the measure. At least one trustee, former board chairwoman Erin Birt, said she is unable to attend the emergency meeting because of a prior work commitment.\nBreuder, who started as president in January 2009, has been on paid leave since April. He declined comment Tuesday.\nIn August, the board voted 4-2 to begin termination proceedings against him, and Breuder declined to have a hearing before the board of trustees, according to Hamilton.\nPDF: COD resolution to fire Robert Breuder (scroll to page 3) Read the story Breuder's compensation package has been worth $495,000 a year, including a $314,034 base salary and perks such as housing and car allowances. If he is fired, he will no longer draw a salary but will be paid for his unused vacation and sick time.\nThe termination vote follows an internal investigation that concluded Breuder \"participated in, oversaw or failed to prevent\" various instances of \"misconduct and mismanagement.\" It determined that he \"engaged in conduct damaging to the reputation of the College,\" according to the resolution to be voted on by trustees.\n\"President Breuder violated specific policies established by the College, violated Board of Trustee and legal directives, breached his duties, and engaged in conduct damaging to the reputation of the College and the reputation of the Office of the College President,\" the resolution states.\nMany of the reasons cited for his termination are the same issues reported by the Tribune throughout this past year. They also were concerns identified in a recent review conducted by the Higher Learning Commission, the agency that accredits the college. The agency's reviewers took the rare step of recommending sanctions for issues of unethical conduct during Breuder's tenure as well as past and current concerns with the administration and board of trustees.\nCollege of DuPage trustees void president's contract, strip name off building Jodi S. Cohen and Stacy St. Clair College of DuPage trustees voted 4-3 Thursday night to void the employment contract of embattled President Robert Breuder and declare him an at-will employee, putting his controversial severance package in jeopardy.\nDuring a meeting of a deeply divided board, trustees also passed a measure that...\nCollege of DuPage trustees voted 4-3 Thursday night to void the employment contract of embattled President Robert Breuder and declare him an at-will employee, putting his controversial severance package in jeopardy.\nDuring a meeting of a deeply divided board, trustees also passed a measure that...\n(Jodi S. Cohen and Stacy St. Clair) The allegations brought by the board against Breuder include \"incurring excessive and unreasonable\" expenditures for food and drinks at the campus' fine dining restaurant, Waterleaf, as well as at the campus hotel; using college funds to pay for a membership and expenses at a hunting club; and converting a family locker room at the fitness center into a private changing area for himself and a handful of top administrators.\nHe also is accused of engaging in prohibited political activity during both a 2010 bond referendum and during the spring election for college trustees. Breuder also is blamed for controversies that occurred under his watch, including unauthorized investments and theft by an employee at the college radio station.\nHis conduct has led to a vote of no confidence from the faculty, state and federal criminal investigations, and possible sanctions from the accreditation agency, according to the resolution.\nWhile Breuder's tenure was rocky, he was credited with modernizing facilities and enhancing curricula, including adding a direct admission program to the University of Illinois' engineering school. Earlier this year, the college credited him with accomplishing more than 100 \"significant outcomes,\" including completing about $550 million in construction for new and significantly renovated buildings. A new Homeland Security Training Institute, with an underground firing range, just opened; it was commissioned under his watch and he was among its boosters.\nThe Glen Ellyn-based college — the state's second-largest provider of higher education after the University of Illinois at Urbana-Champaign — has about 29,000 students and offers nearly 100 degree and certificate programs. It received more than $108 million in property taxes and $57 million in state funding last year.\nBreuder was hired there six days after he signed a deal to retire as president of Harper College in northwest suburban Palatine. That early retirement deal paid Breuder $509,000 and gave him the title to a school-owned Lexus SUV, valued at about $40,000.\nAt the College of DuPage, Breuder's buyout deal was initially shrouded in secrecy and billed as a \"retirement\" package when it was voted on by trustees in January. The deal, however, became a symbol of outsized government spending, and lawmakers responded by passing a proposal that would limit pricey buyouts for college presidents statewide. Gov. Bruce Rauner signed that measure in September.\nTrustees also voted last month to rescind a deal to name the college's Homeland Security Education Center after Breuder.\njscohen@tribpub.com\nsstclair@tribpub.com\nTwitter @higherednews\nTwitter @stacystclair\n Colleges and Universities Education", "external_links": ["http://www.trbimg.com/img-55fb81b4/turbine/ct-college-of-dupate-breuder-contract-board-vote-20150917", "http://www.trbimg.com/img-5626807b/turbine/ct-college-of-dupage-trustees-resolution-robert-breuder-20151020", "http://www.trbimg.com/img-56269708/turbine/ct-college-of-dupage-robert-breuder-fired-20151020"], "published": "2015-10-20T22:20:00.000+03:00", "crawled": "2015-10-21T02:05:41.125+03:00", "highlightTitle": ""}