{"organizations": [], "uuid": "71dcdab6d664d143d6500a820c11c1e9520b29e6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/punjab/now-farmers-to-gherao-legislators/145742.html", "country": "US", "title": "Now, farmers to gherao legislators", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "Now, farmers to gherao legislators", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "71dcdab6d664d143d6500a820c11c1e9520b29e6"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/punjab/now-farmers-to-gherao-legislators/145742.html", "ord_in_thread": 0, "title": "Now, farmers to gherao legislators", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sarbjit Dhaliwal\nTribune News Service\nChandigarh, October 13\nWith farmers calling off their “rail roko” agitation this afternoon, a new phase of protests would start from tomorrow. “We will resist the entry of ruling coalition (SAD-BJP) MALs and MPs in rural areas and not allow them to interact with the people there, from tomorrow,” said a farmer leader Sukhdev Singh Kokri Kalan. Farmers’ bodies would also ghearo residences of all SAD-BJP ministers on October 23, a day after Dashera, he added. Decision to call off the “rail roko” agitation was taken at a meeting held at the Kisan Bhawan after yesterday’s meeting with CM Parkash Singh Badal. The meeting at the Kisan Bhawan, started at 10 pm yesterday and continued till early this morning. Eight farmers’ oganisations and four farm workers’ unions took part in the “rail roko” agitation. As farmers were not satisfied with the outcome of the meeting they had with the CM, they decided to continue the agitation, but in a different format. Leader of the Kirti Kisan Union Hardev Singh Sandhu was in favour of continuing the “rail rook” agiation as he was of the view that the CM had not conceded to any of their major demands. He did not attend the Kisan Bhavan meeting. He would not extend support to the agitation announced by Sukhdev Singh Kokri Kalan. Sandhu said his organisation would hold a meeting tomorrow to chalk out the course of action to protect interests of basmati growers, who were in deep trouble due to a big fall in bastmati prices. Sukhdev Singh Kokri Kalan said the state government agreed to frame a law to regulate the rate of interest on the money advanced to farmers by moneylenders and commission agents. The Bill would be passed in the next Assembly session. The government, however, rejected the demands of increasing compensation from Rs 8,000 per acre to Rs 40,000 per acre for the cotton crop loss and increasing the price of basmati varieties. Kokri Kalan said the outcome of the meeting with the CM was not to the satisfaction of farmers so it was decided to continue the agitation, but in a different manner. Bathinda district president of the BKU (Ekta-Ugrahan) Shingara Singh Mann said, “Our agitation has not ended. As we did not want to cause endless harassment to railway commuters, we have decided to change our method of protest.” Farmer commits suicide\nMoga: A 36-year-old debt-ridden farmer allegedly committed suicide by consuming poison at Ghal Kalan village in Moga district today. Police sources said Balwinder Singh was in depression for the past some time due to poverty and the death of his wife. Villagers said his wife, who was suffering from cancer, had died a few weeks ago. Balwinder, who had a landholding of less than 2-acres, had reportedly raised money for his wife’s treatment by taking loan from a local moneylender. After the death of his wife, he went into depression and took the extreme step. Shortage of fungicides\nMuktsar: The ongoing pesticide controversy has led to shortage of fungicides in the open market. The result: Farmers are finding it difficult to protect their paddy crop against fungal diseases. Spurious pesticides\nFazilka: Over 100 more bags of pesticides, suspected to be spurious or substandard, have been recovered from the Southern Canal, near Singhpura village in Fazilka district. Rlys lost Rs100-cr revenue\nAbohar: The loss suffered by the Railways during the farmers “rail roko” agitation exceeds Rs 100 crore, according to Rajiv Saxena, Divisional Manager, Bikaner division. (With inputs from Sanjeev Bariana, Kulwinder Sandhu, Archit Watts, Praful Chander Nagpal and Raj Sadosh)", "external_links": [], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-14T15:10:55.279+03:00", "highlightTitle": ""}