{"organizations": [], "uuid": "10830f1c6fe7efc5662ffeb1845de40fefb0be90", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266381/sports-general", "section_title": "Sports: General - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30262434/new-improved-crosskix-follows-up-their-signature-shoe-10-and-launches-20-and-apx-styles-for-2016", "country": "US", "title": "New & Improved! Crosskix Follows up their Signature Shoe (1.0) and Launches 2.0 and APX Styles for 2016!", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "New & Improved! Crosskix Follows up their Signature Shoe (1.0) and Launches 2.0 and APX Styles for 2016! - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T01:02:00.000+03:00", "replies_count": 0, "uuid": "10830f1c6fe7efc5662ffeb1845de40fefb0be90"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30262434/new-improved-crosskix-follows-up-their-signature-shoe-10-and-launches-20-and-apx-styles-for-2016", "ord_in_thread": 0, "title": "New & Improved! Crosskix Follows up their Signature Shoe (1.0) and Launches 2.0 and APX Styles for 2016!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Crosskix follows up their signature shoe with 2 NEW & IMPROVED styles - 2.0 and APX! A Superior Alternative in Foam Composite footwear.\n(PRWEB) October 14, 2015\nCrosskix redefines foam composite shoes with multi-functional athletic designs for outdoor, water sports, and casual wear. Completely water submersible athletic shoes for use in/out of water, beach wear, obstacle course racing, casual, lifestyle, and more!\nCrosskix is more than just another EVA shoe to slip on and casually wear. It’s pioneering functionality in mold-injected footwear for multi-purpose uses that comes in striking, attractive and sporty designs. Each shoe is designed and engineered for the best impact absorption, ventilation and water use. The stylish and functional athletic shoes are rugged enough for rigorous obstacle course races (TUFF MUDDER, etc), comfortable for marathon runs, and stylish for everyday casual wear in and out of the water!\nBe one of the first to experience Crosskix’s APX and 2.0. The Kickstarter “super early bird” SPECIAL pricing will start at $34/pair (any style, color, or size). Suggested Retail Prices starting at $64/pair.\nThese prices are exclusively available during the Kickstarter campaign at ( https://www.kickstarter.com/projects/crosskix/737814743?token=84226d3f ) until completion. Target delivery date is April 2016.\nCrosskix’s 2.0 design is a follow-up to the signature 1.0 shoe with more improvements in design and functionality. Features include a fully adjustable tongue with slits on the medial and lateral sides for high insteps. Marine velcro straps securely fastens the instep strap while submerged in water. Crosskix also added a “pin fastener” on the upper lateral side that can be inserted into pre-drilled holes on the instep strap allowing for full adjustment.\nThe APX is designed to fit, feel and function like a high performance sneaker. New features include a full tongue with 9mm wide anti-chorine elastic specifically made for water — and will not dry up and crack. The instep can be adjusted to any height. Like the 2.0, the APX also incorporates stylish air and water vents and scupper drain holes on the rear medial and lateral sides of the shoe.\nBoth the 2.0 and APX are designed recreational and athletic uses and are perfect for water sports and recreational activities where the user needs to go from land to water and back, without having to switch shoes.\nGreat for all ages, these Crosskix designs are perfect for anyone looking for a comfortable all-purpose athletic shoe for everyday use. Please visit crosskix.com for more information or contact Sarah(at)chicexecs(dot)com.\n //www.prweb.com/releases/2015/10/prweb13023002.htm\n ", "external_links": ["http://crosskix.com/", "https://www.kickstarter.com/projects/crosskix/737814743?token=84226d3f", "http://www.prweb.com/releases/2015/10/prweb13023002.htm"], "published": "2015-10-15T01:02:00.000+03:00", "crawled": "2015-10-15T01:28:03.145+03:00", "highlightTitle": ""}