{"organizations": [], "uuid": "7ceb8b773004972c9923f2c87d806055f0ee04cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pharostribune.com", "main_image": "http://bloximages.chicago2.vip.townnews.com/pharostribune.com/content/tncms/assets/v3/editorial/4/a6/4a65d95a-51df-505b-afda-c0f9f8e1f46f/5616035fcc6aa.image.jpg", "site_section": "http://www.pharostribune.com/search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&nsa=eedition&c[]=sports,sports/*&f=rss", "section_title": "Pharos-Tribune - sports,sports/", "url": "http://www.pharostribune.com/sports/local_sports/article_af842dc6-a125-5cbc-99f7-69a8bed12652.html", "country": "US", "title": "ATHLETE OF THE WEEK: Jacob Graf of Logansport", "performance_score": 0, "site": "pharostribune.com", "participants_count": 1, "title_full": "ATHLETE OF THE WEEK: Jacob Graf of Logansport", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T12:00:00.000+03:00", "replies_count": 0, "uuid": "7ceb8b773004972c9923f2c87d806055f0ee04cb"}, "author": "Beau Wicker Sports Editor", "url": "http://www.pharostribune.com/sports/local_sports/article_af842dc6-a125-5cbc-99f7-69a8bed12652.html", "ord_in_thread": 0, "title": "ATHLETE OF THE WEEK: Jacob Graf of Logansport", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ATHLETE OF THE WEEK: Jacob Graf of Logansport \nJ. Kyle Keener | Pharos-Tribune ATHLETE OF THE WEEK: Jacob Graf of Logansport By Beau Wicker Sports Editor Pharos-Tribune \nLogansport High School has had a boys cross country team since 1947. \nJacob Graf became the fifth runner in program history to win a North Central Conference title last Saturday at Indiana Wesleyan University in Marion. \nGraf joined an elite group including Jeff Davis (1970), Tim Smith (1973, 1974, 1975), Mark Courtad (1992) and Kyle Overway (2009, 2010) as NCC boys cross country champions from Logansport. \n“I didn’t even know about that. It was a shock to me,” said Graf of making some history. “It made me feel really good about it. It was a good accomplishment.” \nGraf, a senior, won the NCC title with a time of 16:07.11 running in cold and wet conditions. He outpaced runner-up Adam Fields, a senior from McCutcheon, by 6.42 seconds. \n“It was a good race. My race strategy at the beginning was to go with the front pack and sit behind and let them take the wind,” Graf said, “and then whatever I had in me at the end I figured I’d make my move early and take off at the end and see what would happen there. I knew the McCutcheon kid was going to be up with me. I knew we would be a good 1-2 strategy. In the end my race strategy was executed well and I think it worked out well.” \nEarlier this season Graf won his third Cass County title in a row, winning with a time of 16:25.4 at Caston to beat runner-up Mitchell Rans, a freshman from Caston, by 3.37 seconds. \nAt the Wildcat Classic, held at the IWU course on Sept. 14, Graf ran a career-best 16:01, which is the third fastest 5K time in program history behind Overway (15:30) and Courtad (15:50). \nGraf is now turning his attention to the IHSAA state tournament. \nThe Berries are hosting a sectional on Saturday. The boys race starts at 10:30 a.m., followed by the girls race. \nA year ago Graf placed third with a time of 16:54 behind Winamac’s Kyle Collins (16:33) and Zen Zupin (16:43). Both Collins and Zupin are also back for their senior seasons. \n“Kyle Collins from Winamac, he’s my main focus this week,” Graf said. “I know he really works well in the Berry Patch, that’s usually where he takes off. I’ve just got to use my home course advantage and see what I can do with that. But really the race strategy is to just go with him and see how the ending goes, maybe take off a little bit early like I did at NCCs and see if that race strategy can work out well.” \nGraf said if he’s running well like last weekend he will go all out for the win. But he added his main goal is to reach the state finals later on this fall, so he’s gearing up to be in peak form at the New Prairie Semistate. \n“I haven’t been there yet, but that’s on my list this year is to get to the state finals. That’s what we’re training for right now is really state,” he said. \nGraf is looking to run in college and he’s been able to cut a good amount of time each year of high school, and he is hoping he still has his best time of the season ahead of him this postseason. \n“I’ve been feeling great. This has been my best year physically. I’ve never been injured my four years of high school so that’s a plus that I’m trying to keep,” he said. \nThe following is a question-and-answer session with Graf. \nQ. Of the sports you play, which is your favorite? Why? \nA. Cross country, because of the challenges it brings and the teammates that make great memories. \nQ. How did you first get started in sports? At what age? \nA. I got started in third grade when my third grade teacher held the miracle mile. \nQ. Do you have any family members who played sports? \nA. My mom and dad both participated in sports, along with my brother and sister. \nQ. Have you ever played a sport that you were not successful at? \nA. I tried soccer and it didn’t work out very well. \nQ. How do you feel you’ve improved as an athlete since you first started playing? \nA. I feel like I’ve mentally become a stronger person and have learned many valuable life lessons. \nQ. Who do you consider your biggest role model? Why? \nA. My biggest role model would be my Grandpa Bob. He was always doing everything until it was perfect. \nQ. What experiences have you had in sports have made you the athlete you are today? \nA. Failing multiple times, over and over, and learning from my mistakes and building off them. \nQ. What is something that not everyone knows about you? \nA. I love to also fish, golf and play the harmonica. \nQ. What is your favorite memory of playing sports at your school? \nA. Camping in the summers with my cross country team and team bonding. Also winning NCCs. \nQ. Your favorite music, movie, TV show, etc.? \nA. Favorite band: AC/DC. Movie: Forrest Gump. Book: The Perfect Mile. Sports team: Notre Dame. \nQ. Who is the best athlete in your respective sport you’ve ever gone up against? \nA. The best athlete by far is Kyle Collins. We’ve been running together for many years and he is the hardest to beat and a very good athlete. \nQ. What are your goals for your future? Do you plan on attending college? \nA. I plan on attending college to major in criminal psychology and join the Marines as an officer after college. \nEach week during the school year the Pharos-Tribune recognizes an athlete from one of five area high schools. The recipients are selected by each school’s athletic department. Sign Up / Sign In With your existing account from... {* loginWidget *}", "external_links": [], "published": "2015-10-08T12:00:00.000+03:00", "crawled": "2015-10-12T02:59:10.349+03:00", "highlightTitle": ""}