{"organizations": [], "uuid": "c251273b7943eb675343fe40bfadaa3c1bae11ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266381/sports-general", "section_title": "Sports: General - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30166871/wimbledon-health-partners-announces-expansion-of-marketing-department", "country": "US", "title": "Wimbledon Health Partners Announces Expansion of Marketing Department", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Wimbledon Health Partners Announces Expansion of Marketing Department - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T02:01:00.000+03:00", "replies_count": 0, "uuid": "c251273b7943eb675343fe40bfadaa3c1bae11ee"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30166871/wimbledon-health-partners-announces-expansion-of-marketing-department", "ord_in_thread": 0, "title": "Wimbledon Health Partners Announces Expansion of Marketing Department", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Adds three seasoned marketing professionals to expand national brand\nBoca Raton, Florida (PRWEB) October 01, 2015\nWimbledon Health Partners (WHP), the nation’s leading on-site testing company providing physicians’ vascular, echocardiogram and NCV testing; as well as pioneering the way for high schools, colleges and universities to test students for heart abnormalities is pleased to announce the addition of three new marketing employees. Wimbledon Health Partners has recently gone through incredible growth and is now expanding its marketing department to meet new demands.\nWimbledon Health Partners announces the addition of Becky Davis the new Chief Marketing Officer. Davis brings with her twenty five years of experience at Unify, Inc. most recently as the Director of Technical Marketing. During her tenure with the company, she held a number of executive positions in various departments within the organization, including service, manufacturing, product management, pre-sales support and marketing. Over the years she has managed large global teams, driven new product introductions, led complex projects, organized tradeshows and events worldwide, and most recently designed, implemented and has been maintaining a customer advocacy program.\n“Wimbledon Health Partners is a rapidly expanding and highly successful company, and I’m looking forward to being a member of this leadership team,” says Davis. “My goal is to strengthen the brand in the marketplace, grow customer satisfaction and help WHP become a company where the most talented and passionate people want to work. I believe that my many years of experience in the corporate world will help me successfully achieve these goals.”\nAlso announced by WHP is the addition of Cynda Perun, M.B.A. as Director of Marketing at Wimbledon Health Partners. Perun has more than fifteen years of experience in the marketing industry, and is well versed in developing marketing strategies and launching programs to drive revenue growth and brand loyalty. At the American Bar Association (ABA), one of the largest voluntary professional organizations in the world, Perun was instrumental in re-launching the ABA’s online career center, implementing marketing initiatives and creating key communications that led to a significant increase in revenue and overall ABA awareness. During her time at Partners In Loyalty Marketing, a boutique marketing consultancy in Chicago, Perun consulted with pharmaceutical brands to set, analyze and optimize targeted program plans to maximize her clients’ ROI.\nAndrea Gold balances out the Wimbledon Health Partners marketing team as the new Digital Marketing Manager. Gold brings with her over twenty years of experience in publishing, digital marketing, search engine optimization (SEO) and social media management. She specializes in content management, SEO strategy, social media marketing, project management, strategic planning, PPC management and lead generation. As the online marketing director at Seaside Properties Group at Douglas Elliman she tripled company leads through PPC campaigns and SEO strategy.\nAbout Wimbledon Health Partners:\nWimbledon Health Partners was formed in response to the demand to attain on-site diagnostic testing capabilities for circulatory conditions that can be detected through the use of vascular ultrasound and echocardiography. Furthering our capabilities, nerve conduction velocity testing (NVC) is also utilized to support diagnosis of nerve involvement and manage risk. The company also reinforces its mission of promoting early testing through its athletics testing division, Wimbledon Athletics, which specifically focuses on the detection of undiagnosed cardiovascular anomalies to help minimize death among young athletes. For more information go to http://www.dxtesting.com or call (855) 200-8262.\n //www.prweb.com/releases/2015/10/prweb12998306.htm\n ", "external_links": ["https://www.facebook.com/WimbledonHealthPartners", "http://www.prweb.com/releases/2015/10/prweb12998306.htm", "https://www.linkedin.com/company/wimbledon-health-partners"], "published": "2015-10-02T02:01:00.000+03:00", "crawled": "2015-10-02T01:40:37.757+03:00", "highlightTitle": ""}