{"organizations": [], "uuid": "b5201cf54f3a195792f45e139251330d13ebe901", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nydailynews.com", "main_image": "http://assets.nydailynews.com/polopoly_fs/1.2407734!/img/httpImage/image.jpg_gen/derivatives/landscape_1200/uva23n-1-web.jpg", "site_section": "http://www.nydailynews.com/news/index.html", "section_title": "Breaking, Local and National News, Sports &amp; Entertainment - NY Daily News", "url": "http://www.nydailynews.com/news/national/u-va-student-files-3m-suit-bloody-arrest-article-1.2407735", "country": "US", "title": "U. Va. student files $3M suit for bloody arrest", "performance_score": 0, "site": "nydailynews.com", "participants_count": 1, "title_full": "U. Va. student files $3M suit for bloody arrest - NY Daily News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "b5201cf54f3a195792f45e139251330d13ebe901"}, "author": "NEW YORK DAILY NEWS", "url": "http://www.nydailynews.com/news/national/u-va-student-files-3m-suit-bloody-arrest-article-1.2407735", "ord_in_thread": 0, "title": "U. Va. student files $3M suit for bloody arrest", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bryan Beaubrun/AP Martese Johnson is held down by an officer in March in Charlottesville, Va. RICHMOND, Va. — A University of Virginia student filed a $3 million lawsuit Tuesday against the state liquor agents involved in his bloody and highly scrutinized arrest.\nMartese Johnson, 21, of Chicago filed the complaint in U.S. District Court in Charlottesville. It alleges unlawful detention and excessive use of force by three Alcoholic Beverage Control agents.\nVideo and photos of Johnson being pinned to the sidewalk by ABC agents during the March arrest were widely distributed on social media. Johnson, who is black, could be heard on the video calling the officers racist. He was bleeding from a gash in his head that, according to his lawyer, needed 15 stitches to close.\n“The Agents’ brutal and unjustified attack on Martese has left Martese permanently disfigured as there is scarring to Martese’s forehead and scalp,” the lawsuit says.\nZach Gibson/Getty Images Johnson was arrested outside the Trinity Irish Pub in Charlottsville in March. Johnson was charged with obstruction of justice and public intoxication or swearing, but those charges were dropped. After an investigation, the Charlottesville prosecutor determined that the agents did nothing wrong and declined to file charges.\nThe incident prompted Gov. Terry McAuliffe to order additional training for ABC’s 130 officers and appoint a task force to examine the agency’s law enforcement practices. The task force last month declined to recommend stripping ABC of its arrest powers but recommended that the agency emphasize regulatory activities, such as licensing compliance, over law enforcement.\nMcAuliffe also ordered a state police investigation, which concluded that agents “only used physical force to detain and arrest Johnson” and did not employ any of the more aggressive tactics that agents are allowed to use when a person resists arrest. The agents were trying to question Johnson, who was then 20, after he showed identification but was turned away from a bar across the street from U.Va.’s campus on St. Patrick’s Day.\nCharlottesville Police The charges were filed after a Virginia Department of Alcoholic Beverage Control (ABC) officer and local police confronted Johnson near “the Corner,” a popular off-campus social hub near the University of Virginia. Johnson’s lawsuit names the ABC, agency director Shawn P. Walker, and agents Jared Miller, Thomas Custer and John Cielakie as defendants.\nABC spokeswoman Kathleen Shaw said the agency does not comment on pending litigation. The attorney general’s office did not immediately respond to an email seeking comment.\nJohnson’s arrest was the second ABC incident to provoke outrage in Charlottesville. Two years ago, several agents who mistook a carton of sparkling water for beer swarmed a vehicle driven by University of Virginia student Elizabeth Daly. One agent brandished a gun and another tried to break her windshield with a flashlight. Daly fled in a panic, grazing two agents with her SUV. Charges against her were dropped, and she settled a lawsuit against the ABC for $212,500.", "external_links": [], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-23T00:04:56.054+03:00", "highlightTitle": ""}