{"organizations": [], "uuid": "77b2a60cf984c6a1eba50868699cc18f97deeeb3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.startribune.com", "main_image": "http://stmedia.stimg.co/ows_144375064551075.jpg?h=630&amp;w=1200&amp;fit=crop&amp;bg=999&amp;crop=faces", "site_section": "http://www.startribune.com/sports/index.rss2", "section_title": "Sports", "url": "http://www.startribune.com/goucher-runs-with-new-purpose-at-this-stage-of-life/330349821/", "country": "US", "title": "Goucher runs with new purpose at this stage of life", "performance_score": 0, "site": "startribune.com", "participants_count": 1, "title_full": "Goucher runs with new purpose at this stage of life - StarTribune.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T07:19:00.000+03:00", "replies_count": 0, "uuid": "77b2a60cf984c6a1eba50868699cc18f97deeeb3"}, "author": "Rachel Blount", "url": "http://www.startribune.com/goucher-runs-with-new-purpose-at-this-stage-of-life/330349821/", "ord_in_thread": 0, "title": "Goucher runs with new purpose at this stage of life", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "She always knew she was fast, with two Olympic appearances and a world championships bronze medal to prove it. Kara Goucher showed she was strong, too, beating back injuries and self-doubt early in her running career to become one of America’s premier distance specialists.\nIt wasn’t until recently, though, that the former Duluth resident discovered the quality that is defining her now. Goucher enters Sunday’s TC 10 Mile propelled by a sense of fearlessness, honed through her newest roles as a mother, a mentor for active women and a whistle-blowing advocate for drug-free sport. During a time she calls the happiest years of her life, the only thing that hasn’t kept pace is her results — something Goucher believes she can change as the 2016 Olympics draw near.\nSunday’s race precedes the Twin Cities Marathon and serves as the U.S. 10-mile championship for men and women. Goucher, 37, isn’t expecting to break her 2007 course record of 53 minutes, 16 seconds. Her summer training was slowed by hamstring issues, and she took a break from racing after the uproar over her June allegations that former coach Alberto Salazar skirted anti-doping rules.\nThat bombshell, Goucher said, put her through “a few months of hell.’’ But she harbors no regrets about giving that information to the U.S. Anti-Doping Agency, or her decision to leave mega-sponsor Nike for the small, female-centric Oiselle. That’s the same attitude she is taking into the Olympic marathon trials in February, choosing to run straight ahead without looking over her shoulder.\n“It’s been a roller-coaster ride the last couple of years, but I feel more grounded in who I am, and I feel like I have a better grip of why I’m here and what my purpose is,’’ Goucher said. “I feel such joy in my life, more than I have before.\n“It’s been a very rocky road. But I feel like I’m in a really good place right now. I just know in my gut I’m not done.’’ Twin Cities Marathon\n8 a.m. Sunday (10-mile at 7 a.m.)\nGoucher now lives in Colorado with her husband, Adam, and 5-year-old son, Colt. She has rejoined coaches Mark Wetmore and Heather Burroughs, who guided her through her college career at the University of Colorado.\nOne of the country’s most popular distance runners, Goucher finished in the top 10 in the 5,000 and 10,000 at the 2008 Olympics and was 11th in the marathon at the 2012 Summer Games. Most of her career highlights — including her bronze at the 2007 world championships, when she became the first American woman to medal in the 10,000 at worlds — came during a time when she focused only on winning. Colt’s birth began to change her perspective.\nBitter parting\nIn 2011, Goucher ended a seven-year tenure with Salazar’s training group, the Nike Oregon Project. Two years later, she made the stunning decision to leave Nike as well. Goucher said she turned down a million-dollar contract from a major company to sign with Oiselle, a fledgling apparel firm run by and for women, because it offered a collaborative, supportive environment that aligned with her values.\n“It just got to the point where I wasn’t fulfilled any more,’’ Goucher said. “Colt helped me slow down and reconnect with why I fell in love with running in the first place.\n“I knew in my gut that I wanted something different. Now, I’m around people who want to know: What do I care about in life? What do I stand for? I’ve discovered my voice, and that’s really empowering.’’\nThat emerging voice surprised the track world again last June, when Goucher was featured in a report that accused Salazar of bending anti-doping rules. Goucher alleged that her former coach urged her to take a thyroid medication that had not been prescribed to her and called him a “win-at-all-costs person’’ who was hurting the sport.\nGoucher also revealed she had taken her concerns to the U.S. Anti-Doping Agency. The controversy roiled the U.S. championships as Salazar denied the allegations, but Goucher said she received more messages of support than scorn. Speaking out was “the right thing to do’’ after seeing a rule violation, she said, and she believes “there will be justice’’ at the end of USADA’s continuing investigation.\nRole model\nFormer Gophers runner Gabriele Grunewald, a top American in the 1,500 and 3,000, said the pro running community felt Goucher was “very brave’’ for calling out such a powerful coach. “I’m proud of her,’’ Grunewald said. “It showed her character and integrity, and because she’s such an icon, it opened a lot of eyes.’’\nGrunewald said Goucher is sending other important messages, too, with her career choices, devotion to family and desire to bring more women into the sport by hosting running retreats. Goucher said those amateur runners have inspired her, too, as she endured knee surgery and a back injury over the past 18 months.\nThough Goucher is not as fit as she hoped to be for the 10 Mile, she is aiming for a time of 55 minutes in a race that will kick off her preparation for the Olympic marathon trials in Los Angeles. With her fearlessness firmly established, she is eager to prove she’s still fast, too.\n“Right before I got injured both times, I had a glimpse of the old me,’’ she said. “And the old me is good enough to make the Olympic team.\n“Before, I ran for companies, to please other people. This time, it’s just for myself. I don’t want to have any regrets in the sport; when I’m done, I want to be able to say, ‘I did everything I could do, and I gave it every shot that I had.’ And the thing is, I just know in my heart I can do it.’’", "external_links": [], "published": "2015-10-02T07:19:00.000+03:00", "crawled": "2015-10-02T12:05:21.208+03:00", "highlightTitle": ""}