{"organizations": ["High School Sports Scores & Highlights Tuesday's High School Sports Scores"], "uuid": "30ef5955a6fa6d26375575926c2ebd433582f357", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbc29.com", "main_image": "http://wvir.images.worldnow.com/images/9062103_G.jpg", "site_section": "http://www.nbc29.com/Global/category.asp?C=85724&clienttype=rss", "section_title": "NBC 29 News - Local Sports", "url": "http://www.nbc29.com/story/30311144/tuesdays-high-school-sports-scores-highlights", "country": "US", "title": "Tuesday's High School Sports Scores & Highlights", "performance_score": 0, "site": "nbc29.com", "participants_count": 0, "title_full": "Tuesday's High School Sports Scores & Highlights", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T05:41:00.000+03:00", "replies_count": 0, "uuid": "30ef5955a6fa6d26375575926c2ebd433582f357"}, "author": "", "url": "http://www.nbc29.com/story/30311144/tuesdays-high-school-sports-scores-highlights", "ord_in_thread": 0, "title": "Tuesday's High School Sports Scores & Highlights", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tuesday's High School Sports Scores & Highlights Posted: \nHere are some of the high school sports scores from Tuesday night: \nFOOTBALL: \nBlue Ridge 51, North Cross 20 \nVOLLEYBALL: \nMadison County 1, Clarke County 3Monticello 3, Orange County 0Rappahannock 3, William Monroe 0STAB 3, St. Margaret's 1Spotswood 3, Waynesboro 0Wilson Memorial 3, Stuarts Draft 0Western Albemarle 3, Albemarle 2 \nFIELD HOCKEY \nWestern Albemarle 1, Albemarle 0Covenant 3, STAB 1 \nBlue Ridge 4, Miller 1Carlisle 1 Covenant 0 Marty Hudtloff is the Sports Director at WVIR-TV. He joined the NBC29 sports team in October of 2003. He has a degree in broadcast journalism from Bradley University. Email / Full Story Sign Up for Email Alerts \nSign up to receive NBC29 news and weather updates in your inbox daily. Email Address * Thank you for signing up! You will receive a confirmation email shortly. Local Sports Headlines Local Sports Headlines More>> Tuesday, October 20 2015 10:41 PM EDT 2015-10-21 02:41:10 GMT Here are some of the high school sports scores from Tuesday night: Full Story Here are some of the high school sports scores from Tuesday night: Full Story Updated: Tuesday, October 20 2015 8:48 PM EDT 2015-10-21 00:48:35 GMT Woodberry Forest junior tight end John Kirven has verbally committed to play football at the University of Virginia. He is Virginia's first commitment for the class of 2017. Full Story Woodberry Forest junior tight end John Kirven has verbally committed to play football at the University of Virginia. He is Virginia's first commitment for the class of 2017. Full Story Updated: Tuesday, October 20 2015 6:13 PM EDT 2015-10-20 22:13:47 GMT Mallory rushed for 210 yards and two touchdowns in Monroe's 32-27 win over Madison County on Friday. Full Story Mallory rushed for 210 yards and two touchdowns in Monroe's 32-27 win over Madison County on Friday. Full Story Updated: Monday, October 19 2015 6:39 PM EDT 2015-10-19 22:39:21 GMT ESPN's College GameDay is headed to Harrisonburg. The broadcast begins Saturday at 9:00 a.m. from James Madison's campus and airs until noon, prior to JMU's homecoming game against Richmond. Full Story ESPN's College GameDay is headed to Harrisonburg. The broadcast begins Saturday at 9:00 a.m. from James Madison's campus and airs until noon, prior to JMU's homecoming game against Richmond. Full Story Monday, October 19 2015 5:23 PM EDT 2015-10-19 21:23:04 GMT T.J. Thorpe scored a 75 yard touchdown on the first catch of his UVa career Virginia receiver T.J. Thorpe, who played for North Carolina from 2011-14, caught the game winning touchdown for the Tar Heels, which stunned the Cavaliers 28-27 last year. Full Story Virginia receiver T.J. Thorpe, who played for North Carolina from 2011-14, caught the game winning touchdown for the Tar Heels, which stunned the Cavaliers 28-27 last year. Full Story Updated: Sunday, October 18 2015 4:41 PM EDT 2015-10-18 20:41:42 GMT Makenzy Doniak scored a goal and had an assist to tie for career points at UVa with 138 Senior Makenzy Doniak tied the school record for points in a career (138) with a goal and an assist on Sunday to help No. 2 Virginia post a 4-2 victory on the road at Boston College. Full Story Senior Makenzy Doniak tied the school record for points in a career (138) with a goal and an assist on Sunday to help No. 2 Virginia post a 4-2 victory on the road at Boston College. Full Story Sunday, October 18 2015 3:11 PM EDT 2015-10-18 19:11:31 GMT The UVa football team is 1-1 in the ACC following the 44-38 win against Syracuse After playing in triple overtime for the first time in program history, the UVa football team is looking for the victory against Syracuse to be a spark moving forward. Full Story After playing in triple overtime for the first time in program history, the UVa football team is looking for the victory against Syracuse to be a spark moving forward. Full Story Updated: Saturday, October 17 2015 11:53 PM EDT 2015-10-18 03:53:11 GMT Cole Murphy missed a field goal in triple overtime and Jordan Ellis scored from three yards out to give UVa its first ACC and FBS win of the 2015 season, 44-38 over Syracuse. Full Story Cole Murphy missed a field goal in triple overtime and Jordan Ellis scored from three yards out to give UVa its first ACC and FBS win of the 2015 season, 44-38 over Syracuse. Full Story Saturday, October 17 2015 11:52 PM EDT 2015-10-18 03:52:56 GMT Woodberry Forest running back Jameel Wilson celebrates after scoring a touchdown Scores and highlights from the area's prep football games on Saturday 10/17/15. Full Story Scores and highlights from the area's prep football games on Saturday 10/17/15. Full Story Updated: Saturday, October 17 2015 7:54 PM EDT 2015-10-17 23:54:01 GMT Vad Lee passed for 198 yards and two touchdowns and added 66 more yards on the ground to help lead James Madison to a 51-0 victory over Elon on Saturday Vad Lee threw for 198 yards and two touchdowns and added 66 more yards on the ground to help lead James Madison to a 51-0 victory over Elon on Saturday. Full Story Vad Lee threw for 198 yards and two touchdowns and added 66 more yards on the ground to help lead James Madison to a 51-0 victory over Elon on Saturday. Full Story All content © Copyright 2000 - 2015 WorldNow and WVIR. All Rights Reserved. For more information on this site, please read our Privacy Policy and Terms of Service .", "external_links": [], "published": "2015-10-21T05:41:00.000+03:00", "crawled": "2015-10-21T09:42:48.251+03:00", "highlightTitle": ""}