{"organizations": [], "uuid": "367e71ab2df278fd1ce7fd7b05c6c4e903740f75", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.houstonpress.com", "main_image": "http://images1.houstonpress.com/imager/u/original/7852572/2006_0409rangers_astros0017.jpg", "site_section": "http://www.houstonpress.com/news/harden-20-how-james-harden-became-houston-s-biggest-crossover-sports-celebrity-7815671", "section_title": "Harden 2.0: How James Harden Became Houston’s Biggest Crossover Sports Celebrity | Houston Press", "url": "http://www.houstonpress.com/news/whats-it-going-to-take-to-destroy-tals-hill-7852571", "country": "US", "title": "Tal's Hill Lives", "performance_score": 0, "site": "houstonpress.com", "participants_count": 1, "title_full": "Tal's Hill Lives | Houston Press", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T15:00:00.000+03:00", "replies_count": 0, "uuid": "367e71ab2df278fd1ce7fd7b05c6c4e903740f75"}, "author": "John Royal", "url": "http://www.houstonpress.com/news/whats-it-going-to-take-to-destroy-tals-hill-7852571", "ord_in_thread": 0, "title": "Tal's Hill Lives", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "EXPAND Ugh, we're never getting rid of that stupid hill. John Royal Do you have a thing that you irrationally hate? There’s no logic to that hatred, you’re in the minority, but nothing that anybody says or writes changes your mind. There’s no argument that you can hear or see that will suddenly make you see the light.\nI’ve got a couple of irrational hatreds, things that just make no sense to me and that just make me angry when people have a different outlook on the topic than I do.\nTake Tal’s Hill for example. Tal’s Hill is the most stupid, illogical thing ever conceived for a ballpark. More so than that art-deco home run sculpture at the Marlins ballpark. More so than the trays of grass that were recently taken out of NRG Stadium. There’s no reason for Tal’s Hill to exist, especially for it to exist in the field of the play. It’s a hill. A hill that sometimes a player has to run up so as to get the baseball. It serves no purpose other than to be a hill in a play in a ballpark.\nThe Astros announced earlier this year that Tal’s Hill would be no more after this season. There was a whole press release about it. It was all part of an updating for Minute Maid Park. But the reason for the destruction didn't matter. The Astros were finally going to bulldoze a monstrosity that should have never existed in the first place. No longer would the ballpark be the laughingstock of baseball. I was happy. I was thrilled.\nUntil yesterday when the Astros said oops, never mind, the Hill’s sticking around for another year. And suddenly I’m angry again, primarily because Tal’s Hill is stupid and it serves no purpose and just how hard can it really be to drive some damn bulldozers out on the turf to get rid of the damn thing. Making it worse, the Astros blamed the changed decision on the playoffs, saying that it would be too difficult to get all of the changes made to the ballpark before next season starts because of the extension of the Astros season.\n“We're going to look at, ‘Is there anything we can pull forward, any elements that aren't field-facing that don't affect the play on the field?’” president of business operations Reid Ryan said yesterday . “If we can do those, we're going to try to get those done in the offseason.”\nI know what you can do during the offseason: Bulldoze the damn hill already. How hard can it be? And as for the reason that the playoff run made it more difficult to get things done before the season started, well that makes no sense.\nAfter all, when it was announced that Tal’s Hill was done, the Astros thought there would be a Taylor Swift concert in the ballpark after the season ended. So what changed? (Yes, I know the team’s also saying that a Cricket Match that’s going to be held at MMP in a few weeks is also messing things up, but just how long does it take to bulldoze something?)\nI know that many people like Tal’s Hill. They’re also probably the same people who think Evan Gattis was a good addition to the Astros, that Bill O’Brien is a good football coach, and that James Harden is fouled every time he imitates contact with a defender.\nMany of you will disagree with me on this point, and I accept that. But there's just nothing you’re going to say that will convince me Tal’s Hill is a good thing. It never should have been built. It should’ve been destroyed years ago.\nContact: John Royal ", "external_links": ["http://www.twitter.com/houstonnews_", "http://m.astros.mlb.com/news/article/154568656", "https://www.facebook.com/HairBallsNews"], "published": "2015-10-16T15:00:00.000+03:00", "crawled": "2015-10-16T16:35:06.675+03:00", "highlightTitle": ""}