{"organizations": [], "uuid": "a1d7659ed7c1ac300122918183eed9807777e536", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pendletontimespost.com", "main_image": "", "site_section": "http://pendletontimespost.com//feed/sec/6000/", "section_title": "PendletonTimesPost.com - Sports News", "url": "http://www.pendletontimespost.com/view/story/ed831b95b36e44ddba046b245f269e42/FBN--49ers-Tomsula/", "country": "US", "title": "49ers find things to build on in fourth straight loss", "performance_score": 0, "site": "pendletontimespost.com", "participants_count": 0, "title_full": "49ers find things to build on in fourth straight loss", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T02:53:00.000+03:00", "replies_count": 0, "uuid": "a1d7659ed7c1ac300122918183eed9807777e536"}, "author": "", "url": "http://www.pendletontimespost.com/view/story/ed831b95b36e44ddba046b245f269e42/FBN--49ers-Tomsula/", "ord_in_thread": 0, "title": "49ers find things to build on in fourth straight loss", "locations": ["Baltimore", "San Francisco", "New York"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["JANIE McCAULEY"], "text": "San Francisco loses fourth straight game at end against New York, looks to Baltimore game next By JANIE McCAULEY AP Sports Writer   7:52   7:53   \nPeople: \nCalifornia (1459) \n\nSANTA CLARA, California — Sure, after that long cross-country flight, a tired coach Jim Tomsula could still point to some improvements in yet another disappointing defeat. \nHis San Francisco 49ers were in it until the very end this time on the heels of three lopsided losses. Quarterback Colin Kaepernick found a groove in the second half and succeeded several times throwing into traffic to go without an interception, while Anquan Boldin went over 100 yards receiving and Carlos Hyde nearly ran for 100 in a balanced offensive attack. \n\"I can't say like my old self, but I thought the team played well,\" Kaepernick said afterward. \"Offensively I thought we came out, we got a rhythm, we had players make big plays for us.\" \nThen, the Niners (1-4) lost it Sunday night to the New York Giants on Eli Manning's 12-yard touchdown pass to tight end Larry Donnell with 21 seconds left. That sent San Francisco to a fourth straight loss. \n\"The record's the record. That's just the fact and the reality of it, and that's not good enough,\" Tomsula said Monday. \"We've got to change that.\" \nThere are still some glaring concerns, most notably defensively after surrendering 525 yards of offense Sunday to the Giants. That included 41 completed passes by Manning for 441 yards and three touchdowns while allowing New York 30 first downs. \nNot that linebacker NaVorro Bowman sounded overly concerned after the game or his teammates a day later — even considering the 49ers have given up 127 points during this skid after opening the season with an impressive 20-3 victory against the Minnesota Vikings. \n\"Over the past couple weeks I think we've progressively gotten better as a unit. Overall, we've got to continue to build on this last performance,\" defensive lineman Quinton Dial said at Levi's Stadium. \"Real heartbreaker there, man. We can't hang our heads. It's a long season. ... It tests your manhood as a man and as a team as well. That's what we signed up for.\" \nSan Francisco's next opponent — Baltimore with its franchise-worst 1-4 start — is struggling, too, for a drastic difference from when these teams played in the Super Bowl nearly three years ago. None of the Ravens' games this season have been decided by more than six points. \nThe last time the 49ers and Ravens played a game that counted, Baltimore beat San Francisco 34-31 at the Super Bowl following the 2012 season in a matchup of former 49ers coach Jim Harbaugh and his big brother, John. Now, John comes to the Bay Area looking to beat the struggling 49ers while his brother is long gone and thriving at Michigan. \nTomsula hadn't thought that far ahead yet, only just beginning his prep for Baltimore after arriving home early Monday morning and giving his players some time to sleep. \nThe way they lost made for a tougher trip. \n\"It's one of those games you kind of feel like you got kicked in the gut,\" left guard Alex Boone said Monday. \"Offense did some good things, did some bad things. I thought we played well, though. Defense, they were in there the whole game. We shouldn't have left the game in their hands. It's one of those tough games because you feel like you did some really good things but you look back and you remember you lost, which is always hard.\" \nNOTES: TE Vernon Davis is expected to return Sunday against the Ravens after missing two games with a knee injury. ... RB Reggie Bush's tight calf was the only thing Tomsula had on his injury report. ... LB Ahmad Brooks was still away from the team following the death of his sister, with the funeral this week, so his status remained unclear. \"I won't push on that, I won't,\" Tomsula said. \nAP NFL website: http://www.pro32.ap.org and http://www.twitter.com/AP_NFL \nAll content copyright ©2015  ", "external_links": [], "published": "2015-10-13T02:53:00.000+03:00", "crawled": "2015-10-13T03:30:40.722+03:00", "highlightTitle": ""}