{"organizations": ["Air Force", "Wyoming Tribune Eagle"], "uuid": "0635badce2c8b7410e9a3042692fd84d4cfb8b92", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pendletontimespost.com", "main_image": "", "site_section": "http://pendletontimespost.com//feed/sec/6000/", "section_title": "PendletonTimesPost.com - Sports News", "url": "http://www.pendletontimespost.com/view/story/794bf86728e04c54a21c8ac6e551ead7/FBC--Wyoming-Air-Force-Cut-Blocks/", "country": "US", "title": "Air Force's cut blocks concern Cowboys defensive linemen", "performance_score": 0, "site": "pendletontimespost.com", "participants_count": 0, "title_full": "Air Force's cut blocks concern Cowboys defensive linemen", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T17:31:00.000+03:00", "replies_count": 0, "uuid": "0635badce2c8b7410e9a3042692fd84d4cfb8b92"}, "author": "", "url": "http://www.pendletontimespost.com/view/story/794bf86728e04c54a21c8ac6e551ead7/FBC--Wyoming-Air-Force-Cut-Blocks/", "ord_in_thread": 0, "title": "Air Force's cut blocks concern Cowboys defensive linemen", "locations": ["Wyoming"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["ROBERT GAGLIARDI"], "text": "Wyoming on road Saturday against Air Force team ranked fifth nationally in rushing offense By ROBERT GAGLIARDI Wyoming Tribune Eagle   10:30 amLast   10:31 am   \nPeople: \nWyoming (232) \n\nLARAMIE, Wyoming — It's Air Force week, and there are two words that most of the Wyoming defensive players will hear a lot leading up to Saturday's game. \nCut blocks. \nAir Force's triple-option offense thrives on blocks where players go low to take the feet out from under defenders. Air Force traditionally doesn't have the biggest offensive linemen, so in order to make the offense work, it must rely on quickness and - in this day and age - more nontraditional means of blocking. \n\"With Air Force, it's not a regular cut block,\" UW senior defensive end Eddie Yarbrough said. \"Most offenses, (guys) will go down and lunge at you. If you play that, then it's done. Air Force is unique because when they go down and cut, they actually crawl and roll. You have to keep playing the cut longer than you would compared to a traditional offense. \n\"You have to have great feet and eyes because those cuts come from left and right. You have to have your head on a swivel.\" \nAir Force (2-2 overall, 1-0 Mountain West) leads the conference and is fifth nationally in rushing offense (326.3 yards per game). But in last year's 17-13 UW victory, in which it scored a touchdown in the final seconds, Air Force threw for 226 yards and ran for 151. \nThe Falcons are on their second quarterback in junior Karson Roberts. Senior Nate Romine suffered a season-ending knee injury in a Sept. 17 win over San Jose State. \nSecond-year UW coach Craig Bohl said he hasn't seen Air Force throw it as much this season compared to last, but he knows the ability is there. He also said the Falcons continue to be effective and productive running the ball, and it will be a big challenge for his young defense that allows 215.6 rushing yards per game. UW (0-5, 0-1) has allowed 14 plays of 30 yards or more this season, 10 of which have resulted in touchdowns. \nSlowing down the run game and eliminating big plays will be predicated in large part on guys getting off blocks. \n\"It's always one of the more challenging weeks,\" Bohl said. \"Our players' comments after this game last year were that it was the most physical game they played, and I think a lot of it is the nature of this style of offense. We cut as well, but not as much as they do. \n\"This is the type of football, when I first started coaching, (that) everybody played. Now, defenses have to get ready for it in one week.\" \nJunior nose tackle Chase Appleby said he faced cut blocks in UW's 31-13 loss at Appalachian State last week. \n\"That was every other play,\" Appleby said. \"Air Force does it every play. It gets annoying after a while.\" \nUW faced a similar offense as Air Force's Sept. 26 at home against New Mexico. The Cowboys lost 38-28. New Mexico ran for 302 yards and had two guys with 100-yard games. The Lobos scored on run plays of 56 and 43 yards, and also had a 64-yard scoring pass. \nYarbrough said the day after playing Air Force feels comparable to how one would feel \"after a bar fight.\" Appleby agreed on the physical nature of the game, but said it comes down to another aspect. \n\"It's about speed and getting to the ball the quickest,\" he said. \"It's a physical game, but the person there the quickest wins.\" \nInformation from: Wyoming Tribune Eagle, http://www.wyomingnews.com \n ", "external_links": [], "published": "2015-10-09T17:31:00.000+03:00", "crawled": "2015-10-09T20:10:46.127+03:00", "highlightTitle": ""}