{"organizations": [], "uuid": "8c0e0c400ff82a7427fdf1110be4f5dd707fb173", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.emirates247.com", "main_image": "http://cdn-wac.emirates247.com/polopoly_fs/1.607750.1445503175!/image/1204892460.JPG", "site_section": "http://www.emirates247.com/cmlink/en/dubai-chamber-http-emirates247-com-sports-1.517973?localLinksEnabled=false", "section_title": "Dubai Chamber - http://Emirates247.com - Sports", "url": "http://www.emirates247.com/sports/cricket/physical-assault-case-against-indian-cricketer-amit-mishra-2015-10-22-1.607749", "country": "US", "title": "Physical assault case against Indian cricketer Amit Mishra", "performance_score": 0, "site": "emirates247.com", "participants_count": 1, "title_full": "Physical assault case against Indian cricketer Amit Mishra", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T11:37:00.000+03:00", "replies_count": 0, "uuid": "8c0e0c400ff82a7427fdf1110be4f5dd707fb173"}, "author": "AFP", "url": "http://www.emirates247.com/sports/cricket/physical-assault-case-against-indian-cricketer-amit-mishra-2015-10-22-1.607749", "ord_in_thread": 0, "title": "Physical assault case against Indian cricketer Amit Mishra", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Physical assault case against Indian cricketer Amit Mishra Indian police summons cricketer over allegations By Published Thursday, October 22, 2015 A file picture taken on June 15, 2014 shows Indian cricketer Amit Mishra appealing unsuccessfully for a leg-before-wicket decision during the One Day International (ODI) cricket match between India and Bangladesh at the Sher-e-Bangla National Cricket Stadium in Dhaka. Indian police on October 20, 2015 said they had summoned Indian cricketer Amit Mishra over allegations he assaulted a female filmmaker at a hotel in southern city of Bangalore in September, an official said. (AFP) \nIndian police said they have summoned Indian cricketer Amit Mishra over allegations that he assaulted a woman filmmaker in a hotel room in southern Bangalore city, an official said Tuesday. The woman, identified by police as Vandana, accused the 32-year-old Indian right-arm spinner of assaulting her with a kettle at a luxury hotel on September 25.\"We have filed an FIR (first information report) against Mishra on the basis of the complaint Vandana filed on September 27 and issued a notice asking him to appear before our investigating officer within a week,\" Sandeep Patil, Bangalore deputy commissioner of police told reporters. Patil said they have sent a copy of the summons to the Indian cricket board, as the accused was attending a camp organised by the board in the city when the alleged incident happened. The Mumbai-based film producer said in her complaint she had known the cricketer for three years and had gone to meet him at the hotel when he allegedly assaulted her. Mishra has been named as a member of the Indian squad due to play the remaining two one-day internationals this month and the first two Tests against South Africa next month. The spinner plays for the Indian team in all three formats of the game.  ", "external_links": [], "published": "2015-10-22T11:37:00.000+03:00", "crawled": "2015-10-22T12:09:45.738+03:00", "highlightTitle": ""}