{"organizations": ["Ugly Phillies", "Marlins", "Citizens Bank Park"], "uuid": "a64f689448702386f08487a191722a606bac6ebe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.delawareonline.com", "main_image": "http://www.gannett-cdn.com/-mm-/2678a475be14b1ff4c6bf54d6791a4da7d1c0844/c=0-304-3784-2442&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/04/Wilmington/Wilmington/635795853053355351-USATSI-8843744.jpg", "site_section": "http://rssfeeds.delawareonline.com/wilmington-sports", "section_title": "Wilmington - Sports", "url": "http://www.delawareonline.com/story/sports/mlb/phillies/2015/10/04/ugly-phillies-season-ends-just-short-100-losses/73354108/", "country": "US", "title": "Ugly Phillies season ends just short of 100 losses", "performance_score": 0, "site": "delawareonline.com", "participants_count": 0, "title_full": "Ugly Phillies season ends just short of 100 losses", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T06:29:00.000+03:00", "replies_count": 0, "uuid": "a64f689448702386f08487a191722a606bac6ebe"}, "author": "", "url": "http://www.delawareonline.com/story/sports/mlb/phillies/2015/10/04/ugly-phillies-season-ends-just-short-100-losses/73354108/", "ord_in_thread": 0, "title": "Ugly Phillies season ends just short of 100 losses", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Aaron Altherr", "Meghan Montemurro", "Odubel Herrera", "Jeff Francoeur"], "text": "Ugly Phillies season ends just short of 100 losses Meghan Montemurro , The News Journal 11:29 p.m. EDT October 4, 2015 Phillies right fielder Jeff Francoeur, center fielder Odubel Herrera and left fielder Aaron Altherr celebrate win in final game of the season at Citizens Bank Park. The Phillies defeated the Marlins, 7-2 to finish 63-99. (Photo: Eric Hartline-USA TODAY Sports) 2 CONNECT TWEET LINKEDIN COMMENT EMAIL MORE \nPHILADELPHIA – It took until the last day of the regular season, but the Philadelphia Phillies avoided making unwanted history. \nOn the verge of their first 100-loss season since 1961, the Phillies finished their rebuilding year with a 7-2 win against the Marlins in Sunday’s season finale at Citizens Bank Park to end the year with a 63-99 record. \nPhillies fans have certainly been aware of the team’s rebuilding efforts as the team drew 1,831,080 total fans at Citizens Bank Park in 2015, the fewest since 2002 at Veterans Stadium. While they were successful in evading the dreaded triple-digit loss mark en route to securing the No. 1 overall pick in the 2016 draft thanks to owning the worst record in Major League Baseball, manager Pete Mackanin wouldn’t classify it as a successful season. \n“We don't want to lose; we want to win,” Mackanin said Sunday. “There's a lot of things that are positives that came out of this. It's not a success when you lose that many games. And when you don't win a World Series – that's every team's goal. I said it [Saturday], when you don't win a World Series you haven't achieved your goal. I know it sounds cliché, but that's really the way it is.” \nStill, avoiding 100 losses meant something to the Phillies, as inconsequential as one more loss may seem. The postgame clubhouse was lively as players boxed up belongings to get shipped to their respective homes and many were already looking ahead to next year, a season they expect to be better than 2015. \n“That’s one of the biggest things, we wanted to go home with a big smile,” closer Ken Giles said. “We avoided something everybody – we lost 99, but everybody expected us to lose more than 100. That means something to us. We proved people wrong just by a little bit to show them we have promise and we have experience to be able to be a great team in the future.” Phillies invite four of six coaches to return for 2016 \nInterim general manager Scott Proefrock agreed with his manager and said the organization doesn’t want to find themselves in this situation on a regular basis. Proefrock reiterated Sunday that the first and foremost area the team will address in the offseason is pitching, especially veteran starting pitchers. \nDespite loading the rotation with rookie pitchers during the final month, there is no guarantee all of them – Aaron Nola, Adam Morgan, Jerad Eickhoff and Alec Asher – will be in the rotation at the start of next season. The Phillies will likely bring in at least three or four free agent pitchers to bolster the rotation and provide depth. \n“We need to put people in the rotation and hopefully put them in the right spots in the rotation and let them continue to develop,” Proefrock said. “It’s not a straight line of progression for any of these guys. The league adjusts to them and they have to adjust to the league. I think there’s still a lot of growth for a lot of these guys to undertake before they’re proven major league performers.” \nThe clubhouse has the potential to look a bit different when the team reports to Clearwater for spring training in February, though the coaching staff will remain mostly intact. Bench coach Larry Bowa, hitting coach Steve Henderson, pitching coach Bob McClure and first base coach Juan Samuel have been asked to return for next season while assistant hitting coach and third base coach John Mizerock and bullpen coach Rod Nichols did not have their contracts renewed. \nPitchers Aaron Harang, Jerome Williams and Chad Billingsley and outfielder Jeff Francoeur are free agents this year. Cliff Lee’s final year of his contract will be bought out making him a free agent while outfielder Domonic Brown is a candidate to be non-tendered and thus become a free agent. Veterans Ryan Howard and Carlos Ruiz’s future are uncertain, too, after down years and are owed a combined $33.5 million in 2016. \nAfter his first season in Philadelphia, Francoeur hoped Sunday wasn’t his last time in the Phillies’ home clubhouse. \n“We fought, grinded and clawed,” Francoeur said. “People can probably laugh and say well you still lost 99 games, but at the same time we made it goal. We didn’t want to lose 100. I thought we played really well here at the end of the season. We swept the Mets. I don’t think anybody thought we’d do that.” \nThe Phillies' search for a new GM will begin in earnest now that their season is over. That won't necessarily hinder any decisions the organization needs to make in the meantime, including re-signing any of their own impending free agents, who they have exclusive negotiating rights with until the start of free agency following the conclusion of the World Series. Proefrock said the organization has general parameters for next year's budget but didn't want to get into specifics, only noting that he expects the Phillies will have financial flexibility for 2016. \n\"I think if we feel like we want to move forward on something, obviously [incoming president] Andy [MacPhail] can make that call,\" Proefrock said. \"But I would imagine ... obviously the free agent period doesn't start until after the World Series for major league free agents, so I would assume [hiring a GM] would be resolved before we get to that point. \n\"Again, I think we'll be active in pursuing pitching. It has to be the right fit for us, though.\" \nWhile 2015 was a painful season that featured a manager resigning midseason, GM Ruben Amaro Jr. getting fired and MacPhail being brought in to take over as team president, it was a year that needed to happen if the Phillies want to return to their dominant reign of the National League East. The losses aside, the development of young players, including Franco, Nola and Odubel Herrera, was particularly important as the Phillies try to find pieces to build around.", "external_links": [], "published": "2015-10-05T06:29:00.000+03:00", "crawled": "2015-10-05T10:07:26.121+03:00", "highlightTitle": ""}