{"organizations": [], "uuid": "53c7ec7113a9b5fc5f10529ef28e5cc7f575e773", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.oregonlive.com", "main_image": "http://imgick.oregonlive.com/home/olive-media/width620/img/oregonian/photo/2015/10/01/18878457-large.jpg", "site_section": "http://www.oregonlive.com/", "section_title": "Oregon Local News, Breaking News, Sports &amp; Weather - OregonLive.com", "url": "http://www.oregonlive.com/marijuana/index.ssf/2015/10/rules_for_oregons_marijuana_in.html", "country": "US", "title": "Rules for Oregon's marijuana industry approved", "performance_score": 0, "site": "oregonlive.com", "participants_count": 2, "title_full": "Rules for Oregon's marijuana industry approved | OregonLive.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T22:04:00.000+03:00", "replies_count": 2, "uuid": "53c7ec7113a9b5fc5f10529ef28e5cc7f575e773"}, "author": "Noelle Crombie | The Oregonian/OregonLive", "url": "http://www.oregonlive.com/marijuana/index.ssf/2015/10/rules_for_oregons_marijuana_in.html", "ord_in_thread": 0, "title": "Rules for Oregon's marijuana industry approved", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Oregon Liquor Control Commission on Thursday approved wide-ranging rules that will launch the state's recreational marijuana industry next year.\nThe commission spent the morning tweaking 77 pages of administrative rules that detail everything from the security that licensed growers must have to the kind of information that has to be listed on product labels.\nAttorneys for the commission and the Oregon Department of Justice spent the afternoon revising the rules, which were approved when the board reconvened at the end of the day.\nThe regulations, which impose a seed-to-sale tracking system on marijuana destined for the recreational market, are effective in January. That's when the state begins accepting applications for licenses.\nTwo issues have been particularly thorny for Oregon policymakers: production limits for cannabis growers, and residency and ownership rules for marijuana businesses.\nOn production, the rules establish two tiers based on size and whether the marijuana is grown indoors or outside.\nA Tier I license for indoor growers allows producers to cultivate up to 5,000 square feet of space. Tier II covers between 5,001 and 10,000 square feet of production.\nFor outdoor growers, a Tier I license allows cultivation of up to 20,000 square feet, a little less than a half-acre. Growers who hold a Tier II license could cultivate between 20,001 and 40,000 square feet or a little less than an acre.\nSome marijuana producers have argued that the limits are too low.\nRob Patridge, chairman of the commission and Klamath County district attorney, acknowledged on Thursday the challenges related to setting production limits. He said the commission will revisit canopy size annually.\n\"It's a tough issue, everybody,\" Patridge told several dozen people who filled the commission conference room. \"We don't, at this point in time, have the data to make any right answer.\"\nPatridge said he's heard recently from at least one local government official in Jackson County who said cities and counties should have the ability to sign off on larger grow sites. As a result, the commission has added a provision that allows local governments to approve bigger production sites.\nLocal governments, however, will not be allowed to impose limits that are smaller than what the liquor commission allows.\nPatridge said he's also heard from several Oregon lawmakers who disapprove of proposed requirements that limit majority ownership of cannabis businesses to Oregon residents and restrict out-of-state investors from controlling the management of a marijuana company.\nSome marijuana industry representatives argue the requirements would stifle growth and investment in the state's cannabis industry.\nThe residency requirement is included in state law; the rule requiring that Oregonians make up a company's majority ownership is part of a proposed rule. Patridge has said repeatedly that the requirements are designed to support the growth of a marijuana industry run by Oregonians.\nHe said Thursday that key lawmakers have told him they intend to reverse the residency requirement when the Oregon Legislature meets next year. As a result of those discussions, the commission approved a rule that protects applicants who don't meet the requirements. They may apply and if the legislature changes the law, they won't lose their place in the application process. They would be disqualified if the law is not changed.\nOther issues that generated discussion among commissioners include:\nOn-site consumption by employees of licensed marijuana facilities: The commission approved a provision allowing employees at licensed facilities to consume marijuana at work provided they are medical marijuana patients. The Oregon Health Authority has a similar rule for dispensary workers.\nPatridge, however, warned that employees \"can't be intoxicated\" at work.\n\"If they are intoxicated, they can't do it, just to be real clear,\" he said.\nDelivery of marijuana: By law, home delivery of marijuana is allowed. Under the rules approve Thursday, businesses delivering marijuana to people 21 and older can't transport more than $100 worth of marijuana at any time.\nThe rule also allows marijuana retailers to deliver only in the city in which they are licensed to operate.\nBackground checks on budtenders: Staff that work behind dispensary counters are required to applying for a marijuana handler's permit. They are disqualified if they have a felony conviction.\nPatridge on Thursday pushed for a provision that would expand the disqualifying convictions to any marijuana-related offense, including misdemeanors. Officials researched the issue and determined that state law limits disqualifying factors to felonies.\nAfter the vote, Patridge said the commission plans to raise the issue with the Oregon Legislature next session.\nEdibles packaging: Under the rules, product packaging must be preapproved by the liquor commission. If a manufacturer changes the flavor on a product with an already approved label, that change must be reviewed by the agency. Since a particular flavor may appeal to children, Patridge said the label should be reviewed again by the state.\n-- Noelle Crombie\n503-276-7184; @noellecrombie", "external_links": ["http://www.oregon.gov/olcc/marijuana/Documents/Draft_845_025_RecreationalMarijuanaDraftRules_Rev102115.pdf"], "published": "2015-10-22T22:04:00.000+03:00", "crawled": "2015-10-23T06:08:27.805+03:00", "highlightTitle": ""}