{"organizations": [], "uuid": "b1a80a55e39e0a7b97f04997df1223214b6c1d30", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattlepi.com", "main_image": "http://ww3.hdnux.com/photos/41/41/75/8789866/4/rawImage.jpg", "site_section": "http://www.seattlepi.com/", "section_title": "Seattle news, weather, sports, events, entertainment | seattlepi.com - seattlepi.com", "url": "http://www.seattlepi.com/science/article/Americans-have-been-on-Mars-and-other-Internet-6570586.php", "country": "US", "title": "'Americans have been on Mars' and other Internet evils", "performance_score": 0, "site": "seattlepi.com", "participants_count": 1, "title_full": "'Americans have been on Mars' and other Internet evils - seattlepi.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "b1a80a55e39e0a7b97f04997df1223214b6c1d30"}, "author": "JAKE ELLISON, SEATTLEPI.COM STAFF", "url": "http://www.seattlepi.com/science/article/Americans-have-been-on-Mars-and-other-Internet-6570586.php", "ord_in_thread": 0, "title": "'Americans have been on Mars' and other Internet evils", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\"There's another space program going on — a secret space program.\" - Some Guy on YouTube\n\"We know there's life on Mars already because we sent it there.\" -- John Grunsfeld, the associate administrator of NASA's Science Mission Directorate, during a press conference Oct. 5.\nLast week, NASA released a more detailed plan for putting humans on Mars by 2030 (you can see the delightful poster below). Yeah, ho hum.\n*escalating jungle drum beat*\nBut NASA can't show a photo, make a scientific claim or even publish a ho-hum detailed plan without reactionary conspiracies and those that are determined to believe them surfacing over and over in that magical, fertile realm we call The Internet.\nFor instance, earlier this month, the space agency said it had proof of flowing water on the Red Planet. Fine, right? Well, as Newsweek reported :\nOn his radio show Monday, Rush Limbaugh dismissed NASA's announcement , saying the agency was falsifying data and promoting claims about climate change. \"There's so much fraud,\" he said. \"What's to stop them from making up something that happened on Mars that will help advance their left-wing agenda on this planet?\"\nGeez. A grand conspiracy to make you put solar panels on the roof of your home!!! Bastards!!!!\n*drum beat suddenly stops*\nA screen grab from video purporting to be of astronauts flying over Mars. A screen grab from video purporting to be of astronauts flying over... And now ... NASA is trying to figure out how to break the news to us that we've been to Mars already and even have a colony there living in caves. THAT's why they're dribbling out information from the Red Planet and boring us with their \"plans\" to get humans there.\nBut, the Internet is evil, as we know.\nWhile some people may actually believe humans went to Mars in the 1970s under the operation name \"Project Redsun,\" others are creating the illusions using video and CGI tools. The video below from 2012 has resurfaced on the Internet, and it is constructed to lead people into thinking it's real footage.\nBut is it?\nOne \"news\" website wrote about the video:\nIt shows astronauts aboard a spacecraft distancing itself from Earth as well as the arrival on the orbit of Mars. The details on the surface of the Red Planet are visible during the orbital flight.\nWhile the authenticity of this clip was called into question, the idea that NASA sent manned missions to Mars is heavily vehiculated among conspiracy circles.\nIn April 2011, more information regarding this subject was revealed by Italian journalist and UFO researcher Luca Scantamburlo. During a press conference, he presented testimony outlining the details of Project Redsun.\nWell, yeah. Some UFO expert has the scoop!\nBut the writer is correct to hold the video suspect ... because here's the original version of it created and published in 2009.\nTheFakingHoaxer had this to say about the video:\nI made this video with real photographs and the only true real footage is of the crew from the Apollo missions. Everything else is cgi with photo's. I could add a lot more into it, but I'm working on other stuff too. :-)\nThis guy is clearly not evil. He's just having fun. But the other dude who revamped the footage and put a new title on it to make it seem like it came from NASA is EVIL.\nPurposeful deception is evil, and it's just easier to perpetrate deception on the Internet. So, I guess we would have to clarify: People on the Internet are evil when they purposefully mislead others with photos, videos and all other kinds of content.\nHow do the rest of us know if something on the Internet is real?\nTake that second Quote: at the top of the story: Isn't that NASA confessing to having put people on Mars? Nope. The Quote: is out of context ... which matters. That scientist was referring to the fact that the equipment we've sent to Mars is undoubtedly contaminated with bacteria from Earth. So ... there is life on Mars and we put it there.\nOne way is to judge the quality of the lie: Is it believable at face value? You look and the artifice isn't obvious. But this is where we can run into our inexperience and will be misled, because someone has spent a hell of a lot of time making this \"image\" or \"video\" seem real.\nSo, journalism 101: Cross-reference and look for originals. For the Mars gallery above, I tracked down all those raw images on NASA's website and then republished them to have fun. So, the \"things\" you see in them are \"there\" ... but, you know they aren't what they appear to be. They're just us seeing things in the shadows and shapes. And those \"lights\" are artifacts in the image data sent back to Earth.\nAnother step in your research has to be ... doubt. If it seems utterly fantastic, it's much more likely to be a lie than the truth. Are NASA and millions of amateur astronomers involved in a conspiracy to keep us from knowing we're on Mars and that aliens are circling our planet?\nWell, that seems wildly fantastic, so I'm going with doubt on that one.\nAnother fantastic revelation that even got a response from the White House was made in 2012:\nWired wrote :\nFORGET KENYA. NEVER mind the secret madrassas. The sinister, shocking truth about Barack Obama's past lies not in east Africa, but in outer space. As a young man in the early 1980s, Obama was part of a secret CIA project to explore Mars. The future president teleported there, along with the future head of Darpa.\nThat's the assertion, at least, of a pair of self-proclaimed time-traveling, universe-exploring government agents. Andrew D. Basiago and William Stillings insist that they once served as \"chrononauts\" at Darpa's behest, traversing the boundaries of time and space. They swear: A youthful Barack Obama was one of them. ...\nOfficially, the White House says Obama never went to Mars. \"Only if you count watching Marvin the Martian,\" Tommy Vietor, the spokesman for the National Security Council, tells Danger Room. But that's exactly what a secret chrononaut wants you to believe.\nNow, that one I believe. I mean, clearly the White House would lie about it IF Obama had been teleported to Mars. Rule of thumb: If the White House would lie about it, it must be true.\n:)\nExtraZoom high resolution image Jake Ellison can be reached at 206-448-8334 or jakeellison@seattlepi.com . Follow Jake on Twitter at twitter.com/Jake_News . Also, swing by and *LIKE* his page on Facebook . If Google Plus is your thing, check out our science coverage here .", "external_links": ["https://plus.google.com/b/117812272041622443484/117812272041622443484/posts", "https://www.facebook.com/jakeellisonnews", "http://extrazoom.com/image-45258.html?s=huln50x0", "https://www.youtube.com/embed/oFu3_9PZY7I", "http://www.wired.com/2012/01/obama-mars/", "https://twitter.com/Jake_News", "http://www.newsweek.com/water-mars-conspiracy-truther-hoax-377975", "http://www.theatlantic.com/technology/archive/2015/09/did-humans-contaminate-mars/407731/?utm_source=SFFB", "http://ww3.hdnux.com/photos/41/41/75/8789866/4/920x1240.jpg", "https://www.nasa.gov/press-release/nasa-releases-plan-outlining-next-steps-in-the-journey-to-mars", "http://www.youtube.com/watch?v=HUHmd26rPKs", "https://www.youtube.com/embed/HUHmd26rPKs", "http://www.youtube.com/watch?v=Ggc3vgHNy2g"], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-16T17:55:58.259+03:00", "highlightTitle": ""}