{"organizations": [], "uuid": "dfb4a6c5a60ac51c673a1e1488ac3a6da50d97b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/49226631.cms", "site_section": "http://timesofindia.indiatimes.com/sports/TOI-CRI/articlelist/47722085.cms", "section_title": "Top Stories - TOI CRI - Sports - The Times of India", "url": "http://timesofindia.indiatimes.com/india/Govt-unveils-Kisan-projecthailstorm-app-to-assess-crop-damage/articleshow/49226547.cms", "country": "IL", "title": "Govt unveils Kisan project;hailstorm app to assess crop damage", "performance_score": 0, "site": "indiatimes.com", "participants_count": 2, "title_full": "Govt unveils Kisan project;hailstorm app to assess crop damage - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T22:35:00.000+03:00", "replies_count": 1, "uuid": "e82e9be69db2a3a4c5d0fef1899fc818cfd285fa"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/india/Govt-unveils-Kisan-projecthailstorm-app-to-assess-crop-damage/articleshow/49226547.cms#post-0", "ord_in_thread": 0, "title": "Govt unveils Kisan project;hailstorm app to assess crop damage", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW DELHI: To fasten payment of crop insurance claims to farmers, the Centre on Monday launched a pilot programme Kisan, which will use satellite and drone-based imaging and other geospatial technology to get timely and accurate data on crop yields.\nPayment of crop insurance claims is done on the basis of crop cutting experiments and the government was concerned over the delays in settlements.\nAlso to access large-scale damage to standing crops, it launched an Android-based app for collection of data of hailstorm.\nThe app will be used by state agriculture officials and the data will help the union agriculture ministry in having very fast assessment of damage to crops because of hailstorm.\n\"The crop insurance claim is calculated on the basis of crop cutting experiments. However, there has always been a problem in getting timely and accurate data, due to which payment of claims to farmers were getting delayed. A new programme Kisan is being launched on a pilot basis to address this issue,\" minister of state for agriculture Sanjeev Kumar Balyan told reporters.\nInitially, the pilot study will be carried out in rice and cotton fields in four districts during the ongoing Kharif season in Karnataka (Shimoga district), Maharastra (Yavatmal), Haryana (Kurkshetra) and Madhya Pradesh (Seoni), he said.\nIt will also be carried out during the 2015-16 rabi season in eight districts in same states to assess the crop yields of rice, wheat and shorghum, the minister said adding that the the programme will be scaled up across the country after assessing the results.\nThe programme envisages use of high resolution remote sensing data both from satellite and drone-based imaging, sophisticated modelling activity and other geospatial technology for improving the accuracy of crop yield estimation through more efficient crop cutting experiments.\nBlock level yield estimation and development of a new index based insurance approach, using remote sensing data are also envisaged under the project.\nThe programme will be jointly conducted by Mahalanobis National Crop Forecast Centre, Indian Space Research Organisation, India Meteorological Department, State Agriculture Departments and Remote Sensing Centres, Climate Change, Agriculture and Food Security (CCAFS).\nOn hailstorm app, the minsiter said, \"Hailstorms cause large scale damage to standing crops. However, at present, there is no comprehensive approach to collect hailstorm data. To overcome this, an Android app has been developed with the support of ISRO.\"\nThe app can be used through smartphones for collection of hailstorm data along with photographs and locations and can be uploaded on real-time to ISRO's Bhuvan server.\nThe app will be used by state agriculture department officials for data collection. Even farmers can download the app and send pictures of hailstorm. ", "external_links": ["https://play.google.com/store/apps/details?id=com.toi.reader.activities"], "published": "2015-10-05T22:35:00.000+03:00", "crawled": "2015-10-05T13:06:46.573+03:00", "highlightTitle": ""}