{"organizations": [], "uuid": "917921de3c0ac12b56feaceff1b0dc5dad008060", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seacoastonline.com", "main_image": "http://www.seacoastonline.com/storyimage/SO/20151014/SPORTS/151019487/AR/0/AR-151019487.jpg", "site_section": "http://www.seacoastonline.com/sports?template=rss&mime=xml", "section_title": "Sports - seacoastonline.com", "url": "http://www.seacoastonline.com/article/20151014/SPORTS/151019487/101031/SPORTS?rssfeed=true", "country": "US", "title": "HS girls soccer: PHS sophomore nets game-winner with just over 2 minutes left", "performance_score": 0, "site": "seacoastonline.com", "participants_count": 1, "title_full": "HS girls soccer: PHS sophomore nets game-winner with just over 2 minutes left", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T07:12:00.000+03:00", "replies_count": 0, "uuid": "917921de3c0ac12b56feaceff1b0dc5dad008060"}, "author": "Jay Pinsonnault jpinsonnault@seacoastonline.com", "url": "http://www.seacoastonline.com/article/20151014/SPORTS/151019487/101031/SPORTS?rssfeed=true", "ord_in_thread": 0, "title": "HS girls soccer: PHS sophomore nets game-winner with just over 2 minutes left", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Oct. 14, 2015 at 7:47 PM By Jay Pinsonnault Posted Oct. 14, 2015 at 7:47 PM » Social News PORTSMOUTH — Cyd Scarano thought her Portsmouth High School girls soccer team lost a little bit of energy towards the end of the first half of Wednesday’s Division II game against Sanborn. She felt the Clippers regained that energy and then lost it again during the start of the final 40 minutes of action, but never really sustained it until there were about 12 minutes left and the two teams were deadlocked in a 1-1 tie. Once the Clippers found that missing energy it was only a matter of time before they would score and pull out the win. Sophomore Syd Ludes proved her coach right as she controlled possession of a 50/50 ball just inside the middle of the scoring box and blasted a shot by Sanborn keeper Ellery Rasmussen with 2:11 left in regulation for the 2-1 win. “Towards the end of the game we sustained some good possession and some good offense and Syd (Ludes) just kept on working and stayed confident in our team,” Scarano said. Senior Shanley King put the original shot on Rasmussen, but when the Indians failed to clear the ball, Ludes was there for the game-winner. “The ball was bouncing around the 18 and we knew we needed another goal,” Ludes said. “I got a touch and just wanted to get it to the back and it went in. It was a team effort, everybody contributed on the goal.\" It was the third straight win for the Clippers, who improved to 8-4-1 with three games left in the regular season. “This is a really important win for us,” Scarano said. “We have a couple of tough games coming up. Our girls kept pushing today. We lost momentum, worked through our lulls, but we got it back; to me, that was really important.” Ludes, a sophomore midfielder, put the Clippers up 1-0 with a goal at the midway point of the first half. Ludes, on the right side of the field, lofted a ball over the head of Rasmussen and the ball snuck in the back of the left corner for the goal. Ludes was as shocked as anyone the ball found the back of the net. “It definitely was a surprise,” she said. “I was just trying to get the back post, but it went in; that’s always a good thing. We really needed this win, it was important. It keeps the momentum going.” Ludes doubled her offensive output on the season as she came into the game with two goals. The first coming in the final minute in a 3-1 loss to Manchester West; the second came in the next game, a 4-1 win over Manchester West. “She (Ludes) has been a very good player for us all year long,” Scarano said. “She’s very good with possession, and she’s good with the ball on her feet. Obviously, she has the capability of finishing.” Sanborn’s Sophie Smith tied the game in the 32nd minute, blasting a shot over Portsmouth keeper Izzy Hayes, who had three saves on the day. The Indians, now 7-7 on the season, lost for the third time in four games. “We tend to play up or down to our competition,” Sanborn coach Dave Miliner said. “We play our best against the best teams and you saw that today. Portsmouth is a good soccer team. We played as a team today rather than 11 individuals. This is one we can build on.” Portsmouth will host Windham (8-3-1) on Friday and Oyster River (12-1) next Wednesday before ending the regular season a week from Friday against St. Thomas Aquinas (2-9-1). By Jay Pinsonnault", "external_links": [], "published": "2015-10-15T07:12:00.000+03:00", "crawled": "2015-10-15T06:48:26.691+03:00", "highlightTitle": ""}