{"organizations": [], "uuid": "0a97530f1508302d78fe6200b071e0d49256cd17", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-56247da5/turbine/ct-turning-point-cubs-mets-spt-1019-20151018", "site_section": "http://www.chicagotribune.com/", "section_title": "Chicago Tribune: Chicago breaking news, sports, business, entertainment, weather and traffic - Chicago Tribune", "url": "http://www.chicagotribune.com/sports/baseball/cubs/ct-turning-point-cubs-mets-spt-1019-20151018-story.html", "country": "US", "title": "First three Mets batters turning point in Cubs&apos; loss", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "First three Mets batters turning point in Cubs&apos; loss - Chicago Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T08:20:00.000+03:00", "replies_count": 0, "uuid": "0a97530f1508302d78fe6200b071e0d49256cd17"}, "author": "Fred Mitchell", "url": "http://www.chicagotribune.com/sports/baseball/cubs/ct-turning-point-cubs-mets-spt-1019-20151018-story.html", "ord_in_thread": 0, "title": "First three Mets batters turning point in Cubs&apos; loss", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The situation: Curtis Granderson led off the first inning for the Mets with a single to right, just beyond the outstretched glove of second baseman Starlin Castro. David Wright, 1-for-19 in the postseason before this at-bat, doubled over the head of center fielder Dexter Fowler. Granderson, who was running on the pitch, scored easily as Jake Arrieta gave up his first run.\nWhat happened next: Daniel Murphy followed with a two-run homer, his second blast in two nights and fifth of the postseason, to give the Mets a 3-0 lead. Murphy reached down and lofted a breaking pitch from Arrieta, depositing it in the right-field seats just inside the foul pole. Arrieta, who threw 30 first-inning pitches, allowed three runs in an inning for only the second time in his previous 23 starts, according to STATS.\nThe aftermath: Arrieta appeared to settle down in the second inning, but the Mets came calling again in the third. Granderson reached on a walk. Wright struck out, but Granderson stole second. Following a visit to the mound by pitching coach Chris Bosio, Murphy was walked intentionally. Granderson promptly stole third with Yoenis Cespedes batting. Cespedes then reached on an infield single to short, scoring Granderson to make it 4-0.\nArrieta lasted five innings, allowing four runs on four hits. He struck out eight and walked two. He threw 94 pitches, 52 for strikes. The Cubs finally got on the board on a two-out RBI double by Kris Bryant that chased Mets starter Noah Syndergaard after 5 2/3 innings. A bigger inning for the Cubs was thwarted when reliever Jon Niese fanned Anthony Rizzo.\nThe reaction: \"It has not happened really in the recent past. They got on us very quickly, good at-bats by the top three guys culminated with the home run. The three-run inning held up pretty well for them throughout the entire game. Even after that, Jake wasn't as sharp as he can be, but he definitely held serve. But the ambush early got us, and then you've got to give a lot of credit to their young pitcher. Syndergaard really was very good.\" — Cubs manager Joe Maddon\nPrivacy Policy Major League Baseball Baseball New York Mets Curtis Granderson Jake Arrieta Chicago Cubs Daniel Murphy", "external_links": ["http://www.tribpub.com/privacy-policy-and-your-privacy-rights/", "http://www.trbimg.com/img-56247da5/turbine/ct-turning-point-cubs-mets-spt-1019-20151018"], "published": "2015-10-19T08:20:00.000+03:00", "crawled": "2015-10-19T19:17:07.421+03:00", "highlightTitle": ""}