{"organizations": [], "uuid": "536a75c6527d9ab4b8e7fcc4cbf7d5a8975f6e00", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/Category/6/55/Sports/World.aspx", "section_title": "World - Sports - Ahram Online ", "url": "http://english.ahram.org.eg/NewsContent/6/55/161211/Sports/World/Barcelona-will-fix-defence,-says-Luis-Enrique.aspx", "country": "EG", "title": "Barcelona will fix defence, says Luis Enrique", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Barcelona will fix defence, says Luis Enrique - World - Sports - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "536a75c6527d9ab4b8e7fcc4cbf7d5a8975f6e00"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/6/55/161211/Sports/World/Barcelona-will-fix-defence,-says-Luis-Enrique.aspx", "ord_in_thread": 0, "title": "Barcelona will fix defence, says Luis Enrique", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Neymar scores 4 goals for Barcelona in Spain la Liga Match facts: Barcelona v Rayo Vallecano (Spain la Liga) Barcelona coach Luis Enrique remains certain his team can iron out their defensive lapses after another poor display by the back line in Saturday's 5-2 La Liga win over Rayo Vallecano.\nThe scoreline flattered the Spanish and European champions, who needed a brilliant performance from Brazil forward Neymar to come back from 1-0 down and see off a spirited Rayo side, who played some attractive attacking football at the Nou Camp.\nRayo's opening goal came after slack marking by fullback Dani Alves and centre backs Gerard Pique and Jeremy Mathieu looked amateurish at times in their attempts to repel the visitors' attacks.\nBarca have already conceded 11 goals in eight matches this term compared with a mere 21 in 38 games last season as they swept to a fifth Spanish league title in seven years.\n\"The bad run will pass I am sure, these are players with a lot of quality,\" Luis Enrique told a news conference after the victory at the Nou Camp.\n\"We are not focused enough and the first goal came after a mistake in concentration,\" added the former Barca and Spain midfielder.\n\"We gave the ball away a lot in the second half and Rayo stifled us well. We have to improve.\"\nBarca's victory, with Neymar scoring four and creating one for Luis Suarez, put them level on 18 points with Real Madrid at the top, although Villarreal can reclaim first place with a win at home to Celta Vigo later on Sunday.\nBarca's next outing is on Tuesday when they travel to BATE Borisov for their Champions League Group E clash.\n(For more sports news and updates, follow Ahram Online Sports on Twitter at @AO_Sports and on Facebook at AhramOnlineSports .)", "external_links": ["https://twitter.com/AO_Sports", "https://www.facebook.com/AhramOnlineSports?fref=ts"], "published": "2015-10-18T03:00:00.000+03:00", "crawled": "2015-10-18T22:23:34.084+03:00", "highlightTitle": ""}