{"organizations": [], "uuid": "5b6a4e74fd5442bcb89d7663975fd266807e957e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/ncaabk", "section_title": "NCAA BK News, Scores, Schedule, Standings, Stats, Photos, Videos - Basketball - MSN Sports", "url": "http://www.msn.com/en-us/sports/ncaabk/outlooks-for-each-team-in-the-preseason-top-25/ar-AAfueyb", "country": "US", "title": "Outlooks for each team in the preseason top 25", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "Outlooks for each team in the preseason top 25", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "5b6a4e74fd5442bcb89d7663975fd266807e957e"}, "author": "Alec J Neuharth-Keusch, USA TODAY", "url": "http://www.msn.com/en-us/sports/ncaabk/outlooks-for-each-team-in-the-preseason-top-25/ar-AAfueyb", "ord_in_thread": 0, "title": "Outlooks for each team in the preseason top 25", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Outlooks for each team in the preseason top 25 USA Today Sports 1 day ago by Alec J Neuharth-Keusch, USA TODAY © Evan Habeeb, USA TODAY Sports Evan Habeeb, USA TODAY Sports Outlooks for each team in the USA TODAY Sports preseason top 25 coaches poll (with last season's final record in parentheses). Times are p.m. Eastern:\nAdChoices (Tie) 1. North Carolina (26-12) : The Tar Heels have their four top scorers returning for another go this season. They lost J.P. Tokoto to the NBA and although questions surround Marcus Paige after he took a step back in production last season, expect him to be one of the nation’s top guards this year while leading a talented North Carolina squad made up of six McDonald’s All-Americans. Opens: Nov. 13 vs. Temple (CBSSN, 7).\n(Tie) 1. Kentucky (38-1) Another year, another new roster for John Calipari’s Wildcats. Their top seven scorers left for the NBA, but UK will once again be at the top of the rankings in college basketball. Three five-star recruits, including No. 1 center Skal Labissiere (if eligible) and No. 1 point guard Isaiah Briscoe will be joining the Wildcats in the fall. And the cycle continues … Opens: Nov. 13 vs. Albany (SEC, 7).\nNo. 3 Maryland (28-7): Sophomore point guard Melo Trimble is looking to build upon a strong freshman season, Jake Layman is back for his final year as a Terp, and freshman sensation Diamond Stone is suiting up for UMD this season — all making Maryland one of the most sizeable teams in the nation, with loads of potential. Opens: Nov. 13 vs. Mount St. Mary’s (BTN, 7).\nNo. 4 Duke (35-4): When you lose your top-five scorers from the year before, the following season should be one to rebuild, right? Not if your team is led by Coach K. They will surely miss Jahlil Okafor, Justise Winslow, Quinn Cook and Tyus Jones, but the three five-star additions of Brandon Ingram, Chase Jeter, and Derryck Thornton will do all that they can to fill the void. Opens: Nov. 13 vs. Siena (ESPNU, 7).\nNo. 5 Kansas (27-9): It just wouldn’t feel right if Kansas wasn’t in the mix of top teams, would it? They won’t have Kelly Oubre and Cliff Alexander, but with Perry Ellis, Frank Mason III and Wayne Selden Jr. back, as well as the No. 3 power forward Cheick Diallo (if eligible), Bill Self’s Jayhawks will make some noise once again. Opens: Nov. 13 vs. Northern Colorado (8).\nNo. 6 Virginia (30-4): The NCAA’s best defense will have to make do without Justin Anderson and ACC Defensive Player of the Year Darion Atkins. But, with ACC Coach of the Year Tony Bennett, as well as Malcolm Brogdon and London Perrantes, in a system that posted the best record in the ACC two years in a row, it would be foolish to say Virginia won’t be among the ACC’s best once again. Opens: Nov. 13 vs. Morgan State (7).\nNo. 7 Iowa State (25-9): One of the many teams that left the NCAA tournament much earlier than expected, the Cyclones will be coming back with a chip on their shoulder this time around. Fred Hoiberg took his coaching talents to the NBA, but the roster didn’t take much of a hit. Georges Niang back for his senior year will prove once again that he’s one of the best players in the NCAA. Opens: Nov. 13 vs. Colorado (ESPN2, 5).\nNo. 8 Oklahoma (24-11): The Sooners lost TaShawn Thomas and Frank Booker, but when you have Buddy Hield on your team, does it really matter? The Big 12 Player of the Year averaged 17.4 points and 5.4 rebounds a game last year and will be surrounded by Isaiah Cousins, Ryan Spangler and Jordan Woodard. Opens: Nov. 17 at Memphis (ESPN, 5)\nNo. 9 Villanova (33-3): Jalen Brunson — the No. 2 point guard and No. 16 overall recruit — will make his presence felt for the Wildcats this season. Losing a leading scorer such as Darrun Hilliard II will hurt, but Josh Hart and Ryan Arcidiacono return, making Villanova one of the best three-point shooting teams in the country. Opens: Nov. 13 vs. Fairleigh Dickinson (FS2, 7).\nNo. 10 Arizona (34-4): The Wildcats were one of the best teams in the nation last season, finishing the season 34-4 and making it to the Elite Eight. Unfortunately for head coach Sean Miller, four of the starters (and the top-four scorers) from that team are gone. Freshman Allonzo Trier — the No. 4 point guard recruit — will need to play a big role this season. Opens: Nov. 13 vs. Pacific (Pac-12, 9:30).\nNo. 11 Gonzaga (35-3): Kyle Wiltjer is the most important piece of this roster. The 6-10 forward found his niche in Gonzaga last year, averaging 16.8 points and 6.2 rebounds a game. Some are calling him the preseason player of the year. The Bulldogs are strong inside with 7-1 senior Przemek Karnowski and 6-11 sophomore Domantas Sabonis. Opens: Nov. 13 vs. Pittsburgh in Okinawa, Japan (ESPN, 7).\nNo. 12 Wichita State (30-5): Senior guards Fred VanVleet and Ron Baker make up one of the best backcourts in the NCAA. With head coach Gregg Marshall back on the sidelines after a contract extension, the Shockers figure to be one of the top teams in the nation led by their senior playmakers. Opens: Nov. 13 vs. Charleston Southern (8).\nNo. 13 Michigan State (27-12): The Spartans shocked everyone last season, making it as far as the Final Four before falling to Duke. Then again, should we really have been surprised of a Tim Izzo led team making a tournament run? Standout players Travis Trice and Branden Dawson are gone, but this team still has its fair share of talent, led by senior Denzel Valentine. Opens: Nov. 13 vs. Florida Atlantic (7).\nNo. 14 California (18-15): The Golden Bears went 18-15 last season and were 7-11 against the Pac-12 last season. But, they hit the recruiting jackpot in the offseason as Jaylen Brown and Ivan Rabb, both top-10 ranked recruits, are headed to Berkeley. Leading scorers Tyrone Wallace and Jordan Matthews return, making Cal a team expected to be much improved. Opens: Nov. 13 vs. Rice (Pac-12, 11:30).\nNo. 15 Indiana (20-14): The guard-heavy Hoosiers are heading into the season after not losing many key pieces from last year. They were also able to add recruits Thomas Bryant and Juwan Morgan, as well as Max Biefeldt, a senior transfer from Michigan — all 6-8 or taller. Indiana can expect guards Yogi Ferrell and James Blackmon Jr. to lead the way once again with much more help in the frontcourt. Opens: Nov. 13 vs. Eastern Illinois (7).\nNo. 16 Utah (26-9): Delon Wright is in Toronto with the Raptors, but the Utes still have some bright spots on their roster. Seniors Brandon Taylor, Jordan Loveridge and Dakarai Tucker will have to show that they’re capable to shoot lights out from the perimeter — and sophomore 7-footer Jakob Poeltl will have to play at the same level as last season — if Utah wants to be a top team. Opens: Nov. 13 vs. Southern Utah (Pac-12, 9:30).\nNo. 17 Wisconsin (36-4) : The Badgers roster certainly took a hit this season, losing its two best players in Frank Kaminsky and Sam Dekker. However, don’t forget that Nigel Hayes, as well as head coach Bo Ryan, are still there. They will take a step back — understandably — but still have some potential. Opens: Nov. 13 vs. Western Illinois (BTN, 9).\nNo. 18 Notre Dame (32-6): Losing Jerian Grant and Pat Connaughton poses a tough challenge for the Fighting Irish. However, one of the top scoring teams in the nation will have some of its key pieces returning in Zach Auguste, Demetrius Jackson and Steve Vasturia. Pleasant surprise or disaster? Opens: Nov. 13 vs. St. Francis (7:30).\nNo. 19 LSU (22-11): The Tigers scored the No. 1 overall recruit from the 2015 class, Ben Simmons. The 6-9, 225 power forward will be joined by the No. 3 and No. 11 shooting guards, Antonio Blakeney and Brandon Sampson. With that being the case, losing leading scorers Jarell Martin and Jordan Mickey will hurt much, much less. Opens: Nov. 13 vs. McNeese State (ESPNU, 9).\nNo. 20 Vanderbilt (21-14): A young Vandy team is looking to improve upon their 14-loss season last year. Center Damian Jones will be the anchor in the paint, with guards Riley LaChance and Wade Baldwin IV providing a solid amount of scoring for one of the best perimeter shooting teams in the country. Opens: Nov. 13 vs. Austin Peay (8).\nNo. 21 Baylor (24-10): Rico Gathers, at 6-8, 275 pounds, is back for his senior season, ready to build from a season in which he averaged 11.6 points and 11.6 rebounds a game. The weight of Baylor’s success will be resting on his shoulders, as well as those of talented senior forward Taurean Prince. Opens: Nov. 13 vs. Stephen F Austin (9:30).\nNo. 22 Butler (23-11): A team that was one of the best Cinderella stories in college basketball is back for another season of potential success. Seniors Kellen Dunham and Roosevelt Jones are back, as well as NC State transfer guard Tyler Lewis. If Lewis — a McDonald’s All-American — can fill the hole left by Alex Barlow, Butler could be in for another impressive season. Opens: Nov. 14 vs. Citadel (FS2, 7:30).\nNo. 23 West Virginia (25-10): After making a push to the Sweet 16 last season, this Bob Huggins-led team will have to make magic happen once again if they want similar results. They lost their leading scorer, point guard Juwan Staten, and will need to find a go-to-guy to replace him. Opens: Nov. 13 vs. Northern Kentucky (7).\n(Tie) No. 24 Connecticut (20-15): All eyes will be on transfer guard Sterling Gibbs. Gibbs averaged 16.3 points and 3.8 assists on 43.1% shooting for Seton Hall last season, but will be suiting up for the Huskies for his senior year. They also signed the fifth-ranked point guard, Jalen Adams, who will be ready to make a splash now that Ryan Boatright is gone. Opens: Nov. 13 vs. Maine (7).\n(Tie) No. 24 Purdue (21-13): Freshman Caleb Swanigan is the first Indiana Mr. Basketball to play for Purdue in the last quarter century. The 6-8, 275 pound forward/center will be joining a frontcourt led by senior 7-footer A.J. Hammons. The Boilermakers simply have too much talent not to be ranked, but question marks still remain at the point guard position. Opens: Nov. 13 vs. North Carolina A&T (7).\nGALLERY: COACHES POLL TOP 25 TEAMS\nGo to MSN Home", "external_links": ["http://www.usatoday.com/sports/", "http://go.microsoft.com/fwlink/?LinkID=286759"], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-17T05:13:12.623+03:00", "highlightTitle": ""}