{"organizations": [], "uuid": "c00e013e9c6608d72d5e417d4aff64f37c88efcd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "mdjonline.com", "main_image": "http://mdjonline.com/images/article.jpg", "site_section": "http://mdjonline.com/rss/rss/Sports?instance=Sports&content_type=article&tags=sports&tag_inclusion=or&offset=0&limit=10&page_name=rss", "section_title": "Sports", "url": "http://mdjonline.com/bookmark/26914431", "country": "US", "title": "North Cobb Christian wins far from home", "performance_score": 0, "site": "mdjonline.com", "participants_count": 1, "title_full": "North Cobb Christian wins far from home", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T08:36:00.000+03:00", "replies_count": 0, "uuid": "c00e013e9c6608d72d5e417d4aff64f37c88efcd"}, "author": "Carlton D. White cwhite@mdjonline.com (noreply@mdjonline.com)", "url": "http://mdjonline.com/bookmark/26914431", "ord_in_thread": 0, "title": "North Cobb Christian wins far from home", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "North Cobb Christian wins far from home by By Carlton D. White cwhite@mdjonline.com The Marietta Daily Journal October 18, 2015 12:36 AM | 210 views | 0 | 0 | North Cobb Christian is beginning to understand what success feels like.The Eagles took their longest road trip of the Scott Ryle era and came out on top, posting a 35-20 victory at Class AAAA New Hampstead in Savannah Friday.The win pushed North Cobb Christian’s record to 5-2 overall, tying the mark for most victories in a season set last year under Ryle, and extended the Eagles record winning streak to three games.David Brittingham rushed 35 times for 213 yards and three touchdowns for North Cobb Christian, while Lee Cunningham totaled three receptions for 44 yards. Jaylen Dampier completed 5-of-10 passes for 63 yards with one touchdown and two interceptions. He also rushed six times for 37 yards.“I’m really pleased with all three phases of the game,” said Ryle, who is in his third season as the coach at North Cobb Christian. “We were far from home, but they took care of business and fought for a very hard win against a good team.”It didn’t take long for North Cobb Christian to get going.Dampier connected with Chandler Moeller for a 15-yard touchdown during the Eagles first drive for an early lead.New Hampstead (5-3) answered a few drives later to knot the contest at 7-all in the first quarter.The Eagles built another touchdown lead behind Brittingham’s 17-yard run and staked a 14-7 margin at the end of the first quarter.Reily Martin extended North Cobb Christian’s advantage in the second period after blocking a punt and returning the ball 23 yards for a touchdown.North Cobb Christian missed a field goal attempt as time expired and went into halftime ahead 21-7.The miscue didn’t affect the Eagles’ momentum, however, as they moved in front 28-7 following Brittingham’s second touchdown run on a 15-yard scamper.New Hampstead attempted to get back into the game with some big plays in the second half. The first was a 73-yard touchdown pass that brought the Phoenix to within two scores.Leading 28-14, Brittingham found the end zone again off a 6-yard carry early in the fourth quarter to give North Cobb Christian a 35-14 advantage.New Hampstead responded with an 85-yard touchdown run, but missed the point-after attempt, leading to the 35-20 final.“Our defense made a couple of big plays and our special teams unit played great,” Ryle said. “The blocked punt for the touchdown really got the kids excited.”The Eagles racked up 366 yards of offense, and while the defense gave up several big plays, they made up for it by following the game plan.“New Hampstead has an explosive quarterback and we wanted to put some hats on him and contain him,” Ryle said. “That put our secondary in a bind with 1-on-1 coverage, so some guys got loose. But overall, I’m really proud of the defense.”Friday’s victory was North Cobb Christian’s fourth straight on the road, following a 17-14 win over K.I.P.P. Atlanta Collegiate on Sept. 12. The Eagles’ last three games have all been road wins.“That’s three wins in a row for us, all on the road,” Ryle said. “I’m really proud of the guys for being able to deal with that schedule. We didn’t get home until 2:30 in the morning. Now, we get to play our last three games in front of our home fans.” Share This Article | similar stories", "external_links": [], "published": "2015-10-18T08:36:00.000+03:00", "crawled": "2015-10-18T09:42:23.809+03:00", "highlightTitle": ""}