{"organizations": ["Rogers"], "uuid": "a2c14ac9b04f901f0a9501bf8a359f19d555c903", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "swtimes.com", "main_image": "http://swtimes.com/sites/swtimes.com/files/field/media/web1_Spt-SHS-BHS-Simpson-td-3-bds_2.jpg", "site_section": "http://swtimes.com/taxonomy/term/3/feed", "section_title": "Sports", "url": "http://swtimes.com/sports/football/football-southside-faces-must-win-against-rogers", "country": "US", "title": "Football: Southside Faces Must-Win Against Rogers", "performance_score": 0, "site": "swtimes.com", "participants_count": 0, "title_full": "Football: Southside Faces Must-Win Against Rogers", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T13:06:00.000+03:00", "replies_count": 0, "uuid": "a2c14ac9b04f901f0a9501bf8a359f19d555c903"}, "author": "", "url": "http://swtimes.com/sports/football/football-southside-faces-must-win-against-rogers", "ord_in_thread": 0, "title": "Football: Southside Faces Must-Win Against Rogers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Records: Rogers 1-4, 1-1; Southside 2-3, 0-2 \nFearlessfriday.com Rankings: Southside No. 6; Rogers No. 11 \nLast Week: Fayetteville defeated Southside 67-21; Rogers defeated Heritage 28-6. \nLast Time: Southside defeated Rogers 17-14 on Oct. 11, 2014. \nBy Kevin TaylorTimes Record • ktaylor@swtimes.com \nAfter back-to-back blowout losses to open the 7A-West, the Southside Rebels aren’t exactly on their heels. \nBut they’re close. \nWith no room for error, the Rebels begin a stretch of five games that is essential to their 2015 playoff hopes. Southside has not missed the postseason since 2007. \nThe Rebels (2-3, 0-2) host run-oriented Rogers (1-4, 1-1) today at Rowland Stadium. \n“The thing about playing Rogers is you’re not going to get as many possessions as you might normally get,” Southside coach Jeff Williams said. “You’re probably looking at seven or eight possessions in the game, and if you waste a series or fall behind, it could be a big struggle. Every series, we’ve got to go get points someway, somehow. \n“Defensively, we’ve got to play sound up front and be disciplined.” \nSouthside led Bentonville 14-7 with less than half a minute to play in the first half three weeks ago. They ended up losing 42-14. \nLast week at Fayetteville, poor tackling, sloppy special teams play and the inability to move the ball in the first half contributed to a 67-21 loss to the Purple Dogs. \nRogers won its first game last week, but could easily have two or three more victories, Williams said. Last season, Rogers led the Rebels 14-0 at the half before a furious rally netted Southside a 17-14 victory. \n“We can’t get lulled to sleep and let them throw it over our heads like they did last year,” Williams said. “Defensively, we’ve got to play sound up front and be disciplined.” \nA key defensive stop late in the second quarter helped seal Rogers’ fate last season. \n“Probably the biggest thing last year was a goal-line stand right before the half, or they would have gone up three scores,” Williams said. “If you get behind a team like that, it seems like you have to really press, because your possessions aren’t going to be as many as they would be in a normal game.” \n“We don’t really use that as a rallying cry, other than to talk about some of the mistakes we made,” Rogers coach Shawn Flannigan said. “We had an opportunity to win that game and didn’t. The last couple of times we’ve played them, they’ve had our number.” \nPrior to last week’s 28-6 win over Heritage, the Mounties had averaged 157 yards per game. Last week, six different player combined for 325 yards. \nMilacio Freeland (98 yards) and Grayson Lee (96) led a balanced attack, with quarterback Joseph Sultemeier and fullback Sage White running for 61 and 43 yards, respectively. \n”In any offense, but especially ours, the more evenly the ball is distributed, the harder it is to defend,” Flannigan said. “If we just had one play maker, a team could take him away. We have a ton of guys that are capable of gaining a lot of positive yardage on the ground and through the air. \n“We just have to figure out ways to continue to get them the football.” \n“They’re going to come in here with a lot of emotion,” Williams said. “Anybody you beat your cross-town rival, you’re going to be sky-high. They played a good nonconference schedule; you can see them growing. The quarterback is a big, strong kid that’s hard to tackle. Coach Flannigan and those guys execute as well as anybody. \n“You’ve got to have somebody on the fullback, somebody on the quarterback, and somebody on the pitch, and if somebody breaks down it’s going to be a huge play.” \nSouthside quarterback Cooper Johnson has had a significant role with the Rebels’ offense, both throwing and passing. He’s already topped 1,000-plus yards (1,234) with nine touchdowns and just one interception. \nAnd he can beat you with his legs, too. \n“You have all these quarterbacks in the 7A-West, with the (Kasey) Ford kid at Bentonville, to the kids at Fayetteville, Har-Ber, and even Springdale,” Flannigan said. “Then you have Cooper, who is sort of an unknown, and he’s having a great year. He’s extremely accurate and does what they want really well.” \nParker Dixon leads the team with 309 rushing yards, and both Randy Rainwater and Evan Simpson have enjoyed monster receiving seasons. \nKevin White and David Matthews are also having big seasons. \nDefensively, Hunter Pogue leads the team with 63 tackles, including 33 unassisted tackles. Pogue, Ian Hattabaugh and Landon Hadley each have seven tackles for negative yardage. \nSenior Si Kilinc has a team-high nine stops for negative yardage.", "external_links": [], "published": "2015-10-09T13:06:00.000+03:00", "crawled": "2015-10-09T18:51:47.856+03:00", "highlightTitle": ""}