{"organizations": [], "uuid": "941bbcb9bd0a9130657ef1810bd30004f13f6caf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxsports.com", "main_image": "http://a.fssta.com/content/dam/fsdigital/RSN/Midwest/2015/10/12/PI-NFL-Bears-Matt-Forte-101215.vresize.1200.675.high.58.jpg", "site_section": "http://api.foxsports.com/v1/rss?partnerKey=zBaFxRyGKCfxBagJG9b8pqLyndmvo7UU&tag=kansas-city", "section_title": "FOX Sports Digital", "url": "http://www.foxsports.com/kansas-city/story/five-weeks-into-chiefs-season-and-already-two-heartbreakers-at-home-101215", "country": "", "title": "Five weeks into Chiefs' season and already two heartbreakers at home", "performance_score": 0, "site": "foxsports.com", "participants_count": 0, "title_full": "Five weeks into Chiefs' season and already two heartbreakers at home", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T18:19:00.000+03:00", "replies_count": 0, "uuid": "941bbcb9bd0a9130657ef1810bd30004f13f6caf"}, "author": "", "url": "http://www.foxsports.com/kansas-city/story/five-weeks-into-chiefs-season-and-already-two-heartbreakers-at-home-101215", "ord_in_thread": 0, "title": "Five weeks into Chiefs' season and already two heartbreakers at home", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Updated Oct 12, 2015 at 12:07p ET \nKANSAS CITY, Mo. -- Jay Cutler and the Chicago Bears showed Sunday how to overcome injuries. \nMaybe they can give the Kansas City Chiefs some advice. \nCutler engineered two fourth-quarter touchdown drives without the help of his top two wide receivers and three starting offensive linemen, all out with various ailments, hitting Matt Forte for the go-ahead score with 18 seconds left to give the Bears an 18-17 victory. \n\"I'm really proud of the guys up front,\" Cutler said. \"We were a little down in numbers on the outside, but those guys fought all game and gave us a shot.\" \nThe Bears (2-3) trailed 17-3 early in the third quarter when Chiefs star Jamaal Charles had his knee buckle while trying to make a cut. The preliminary diagnosis was a torn ACL and Charles will have an MRI exam Monday to confirm the extent of the injury. \n\"It's unfortunate, a guy like that and what he means to his team and the type of player he is,\" Chiefs wide receiver Jeremy Maclin said. \"Obviously, you don't want to lose anybody. He's a dynamic guy and one of the leaders of this team.\" \nThe Bears seized the momentum once Charles left the game. \nAfter Robbie Gould's second field goal got Chicago going, Cutler capped an 88-yard drive with a 22-yard strike to Marquess Wilson with 3:05 left. And when the 2-point conversion came up short, the Bears defense responded by forcing a quick three-and-out. \nWith help from a pass interference call on Chiefs rookie Marcus Peters, the Bears quickly moved down field again. That's when Cutler took a snap from the shotgun, dropped the ball, picked it up and spotted Forte running past safety Husain Abdullah in the end zone for the go-ahead score. \nThe Chiefs (1-4) tried a 66-yard field goal that was short as time expired. \nLookin' good! Flip through our photo album of NFL cheerleaders . Denny Medley / USA TODAY Sports \nIt was the second heartbreaking defeat at home for Kansas City this season. AFC West rival Denver scored two touchdowns in the final 2:27 for a 31-24 victory last month. \n\"Things were going relatively smooth the first half. The second half, you got to finish off the team,\" Chiefs coach Andy Reid said. \"You don't do that, then you become average.\" \nHere are some of the takeaways from Sunday's game: \nRECORD-SETTING ROBBIE: The 34-year-old Gould became the Bears' career scoring leader with 1,118 points, two more than Kevin Butler scored from 1985-95. \"We've had some pretty gutsy performances from a lot of our guys the last couple of weeks, even our kicker,\" Bears coach John Fox said. \"He did our player talk last night, so even he's been a great inspiration.\" \nMORE ON CHARLES: This is the second time Charles has torn an ACL, though it was the left knee four years ago. The timing of the injury is such that it would be hard to return by the start of next season. \"It's all very unfortunate,\" Chiefs wide receiver Jeremy Maclin said. \nSO WHO IS NEXT: Third-year pro Knile Davis and Charcandrick West, a former undrafted free agent out of Abilene Christian, will split the carries going forward. \"It's going to be a lot of guys, not just Charcandrick and Knile,\" Chiefs quarterback Alex Smith said. \"It's going to be all of us on offense. We're going to have to pick it up. \nSPEAKING OF INJURIES: Chicago got a bit more dinged up, too. Linebacker Shea McClellin hurt his knee, while cornerback Terrance Mitchell hurt his hamstring. There was no word on the extent of their injuries or how long they might be out. \nSLY FOX: The Bears coach improved to 8-1 against the Chiefs, most of those victories coming with the Broncos. He is also 5-0 in Kansas City, one of the toughest road trips in the NFL.", "external_links": [], "published": "2015-10-12T18:19:00.000+03:00", "crawled": "2015-10-12T21:59:19.018+03:00", "highlightTitle": ""}