{"organizations": ["Blue Jays Royals", "Blue Jays Kansas City"], "uuid": "313311bbbe43f2ce6bccb129a8b7ad4b1370bef6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wvtm13.com", "main_image": "http://www.wvtm13.com/image/view/-/35902484/highRes/2/-/maxh/630/maxw/1200/-/9p9a7ez/-/KC-vs--TOR-ALCS-Mike-Moustakis-Robb-Carr-Getty-Images-jpg.jpg", "site_section": "http://www.wvtm13.com/29096570?format=rss_2.0&view=feed", "section_title": "Sports News", "url": "http://www.wvtm13.com/sports/royals-rally-to-beat-blue-jays/35902906", "country": "US", "title": "Royals rally to beat Blue Jays", "performance_score": 0, "site": "wvtm13.com", "participants_count": 0, "title_full": "Royals rally to beat Blue Jays", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T02:59:00.000+03:00", "replies_count": 0, "uuid": "313311bbbe43f2ce6bccb129a8b7ad4b1370bef6"}, "author": "", "url": "http://www.wvtm13.com/sports/royals-rally-to-beat-blue-jays/35902906", "ord_in_thread": 0, "title": "Royals rally to beat Blue Jays", "locations": ["Toronto"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Royals rally to beat Blue Jays Kansas City takes 2-0 lead over Toronto in ALCS UPDATED 6:59 PM CDT Oct 17, 2015 Photos Rob Carr Getty Images \nAlex Gordon hit a go-ahead double in a five-run seventh as the Kansas City Royals batted around and rallied for a 6-3 victory over the Toronto Blue Jays on Saturday to take a 2-0 lead in the American League Championship Series.Left-hander David Price totally dominated the Royals for the first six innings, allowing only a leadoff single on his first pitch of the game to shortstop Alcides Escobar. Price retired the next 18 batters, a Blue Jays' record for consecutive batters retired in a postseason game, while striking out seven, including the side in the sixth.In the seventh, Price, who is winless in seven career postseason starts, and the Blue Jays became unraveled.The inning began with second baseman Ben Zobrist hitting a flare to shallow right that dropped between second baseman Kelvin Pillar and right fielder Jose Bautista for a single.Lorenzo Cain hit a crisp single to right, extending his postseason hitting streak to 11 games, tying a club record.First baseman Eric Hosmer singled to center, bringing home Zobrist with the first Kansas City run and advancing Cain to third. Cain scored on designated hitter Kendrys Morales' ground out.Third baseman Mike Moustakas snapped an 0-for-13 skid with a RBI-single to tie it and advanced to second on the throw home.After Price struck out catcher Salvador Perez, left fielder Gordon worked the count full before doubling to right-center to drive in Moustakas and put the Royals in front 4-3. Gordon turned on Price's 96 mph fastball, which was his 30th and final pitch of the inning. He had not thrown more than 14 pitches in any of the first six innings.Aaron Sanchez replaced Price and promptly gave up a run-producing single to right fielder Alex Rios.Moustakas' two-out eighth inning single scored Hosmer with an insurance run.The Blue Jays scored two runs in the sixth, when designated hitter Edwin Encarnacion's single scoring third baseman Josh Donaldson with the first run. Bautista, who had walked, scored on shortstop Troy Tulowitzki's double.Royals starter Yordano Ventura failed to survive the inning. Luke Hochevar was summoned with one out and the bases full, and retired Kevin Pillar and Goins on five pitches, keeping the ball in the infield.Right-hander Wade Davis yielded a single and a walk to begin the ninth, but posted his third postseason save. Left-hander Danny Duffy picked up the victory, pitching a spotless seventh inning.The Royals' pitchers streak of 18 scoreless innings ended in the third. Ventura surrendered back-to-back doubles to center fielder Kevin Pillar and Goins, the Blue Jays' eighth and ninth hitters, to start the frame.Goins' double to left on Ventura's 97 mph fastball scored Pillar for the only run in the first five innings.Escobar made a defensive gem to bail out Ventura in the second. Encarnacion and first baseman Chris Colabello opened the inning with singles. After Tulowitzki struck out, Escobar made a diving catch of catcher Russell Martin's liner and flipped to second baseman Zobrist to double off Encarnacion. Martin's scorcher was clocked at 111 mph off the bat, his hardest hit ball of the year.Price needed only 39 pitches the first four innings. He did not have a three-ball count on a batter until designated hitter Morales lined out on a full-count, seven-pitch at bat to lead off the fifth.NOTES: DH Edwin Encarnacion was in the Toronto Blue Jays lineup, batting cleanup, after having a MRI exam of his injured middle left finger on Saturday. Manager John Gibbons said if it was a regular season game Encarnacion would not be playing, \"but we need him, so he's in there.\" ... Kansas City Royals manager Ned Yost has not yet announced his Game 4 starter. \"But I'll give you a hint, his first name is Chris,\" Yost said and laughed. The two candidates are RHPs Chris Young and Kris Medlen, who has not pitched since Oct. 1. ... Kansas City golfer Tom Watson, who won eight major championships, threw out the ceremonial first pitch. ... The three Blue Jays' hits in Friday's defeat were the fewest in postseason history by the club. ... Royals RHP Johnny Cueto and Blue Jays RHP Marcus Stroman are the pitching probables for Game 3 on Monday. Related", "external_links": [], "published": "2015-10-18T02:59:00.000+03:00", "crawled": "2015-10-18T03:09:54.272+03:00", "highlightTitle": ""}