{"organizations": [], "uuid": "00029fe7868aaffd9751c3f5184123bc2dedd1c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.delawareonline.com", "main_image": "http://www.gannett-cdn.com/-mm-/f9da0ed6d44c2f9ad5c64acd8e54882588cc2d18/c=0-162-2421-1530&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/16/Wilmington/Wilmington/635806129749913114-USATSI-8515140.jpg", "site_section": "http://rssfeeds.delawareonline.com/wilmington-sports", "section_title": "Wilmington - Sports", "url": "http://www.delawareonline.com/story/sports/nba/76ers/2015/10/16/report-embiids-poor-attitude-causing-problems-sixers/74072846/", "country": "US", "title": "Report: Embiid's poor attitude causing problems for Sixers", "performance_score": 0, "site": "delawareonline.com", "participants_count": 0, "title_full": "Report: Embiid's poor attitude causing problems for Sixers", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T02:06:00.000+03:00", "replies_count": 0, "uuid": "00029fe7868aaffd9751c3f5184123bc2dedd1c6"}, "author": "", "url": "http://www.delawareonline.com/story/sports/nba/76ers/2015/10/16/report-embiids-poor-attitude-causing-problems-sixers/74072846/", "ord_in_thread": 0, "title": "Report: Embiid's poor attitude causing problems for Sixers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Joel Embiid"], "text": "Report: Embiid's poor attitude causing problems for Sixers The News Journal 7:06 p.m. EDT October 16, 2015 76ers center Joel Embiid dunks before a game in April. (Photo: Bill Streicher/USA TODAY Sports) \nThe 76ers' multi-year rebuilding process, led by enigmatic GM Sam Hinkie, has required fans to take a leap of faith. After all, this is a team that has won 37 games combined over the last two seasons. \nHinkie has further tested fans' patience by drafting players with questionable health histories. In 2013, Hinkie swapped draft picks with New Orleans and acquired Nerlens Noel, knowing full well that Noel was recovering from a torn ACL. After sitting out a year, Noel returned to action last season and was a key contributor. \nFans hoped Joel Embiid would take a similar path. Hinkie drafted Embiid No. 3 overall in 2014, knowing that the 7-foot center had had back and foot injuries while playing at Kansas. Embiid underwent foot surgery in June 2014 with the Sixers hoping he could return to the court for the 2015-16 season. \nBut a report released by Sports Illustrated on Friday cited sources who said Embiid has been habitually insubordinate, not following doctors' and trainers' orders after his 2014 operation. The article, written by Brian Geltzeiler, alleges that Embiid's refusal to consistently wear a walking boot on his injured foot led to a setback in his rehab that forced doctors to operate a second time, possibly costing Embiid this season, too. \nLast season, head coach Brett Brown sent Embiid home from a West Coast trip after he would not cooperate with the team's trainers and strength coach. \nBesides ignoring trainers and doctors, Embiid, the Sports Illustrated article reports, has refused to follow the team's nutrition plan, especially when it came to food provided in his hotel room. \n\"When a staffer went to restock the fridge each week, most everything was uneaten and unopened, and they were throwing out the fruits and vegetables every week,\" wrote Geltzeiler. \nEmbiid saw some practice time for the Sixers last season, dunking before a game in March and playing 2-on-2 in April. \nThe story details an episode in which Sixers majority owner Josh Harris is said to have told Hinkie and Brown to keep Embiid from attending the NBA Summer League in Las Vegas in July. Somehow, though, Embiid ended up in Vegas, where he occasionally took jump shots and dunked, sources said. He reportedly refused to wear his walking boot during the trip. \nThe summer league trip appears to correspond with Embiid's eagerness to return to the court. \n\"We do admit that we have to calm him down because he just wants to be on the court,\" Brown told csnphilly.com in March. \nGeltzeiler also details alleged friction between Brown and Hinkie after the latter traded reigning NBA Rookie of the Year Michael Carter-Williams to Milwaukee last season. \n\"The move angered both head coach Brett Brown and CEO Scott O’Neil, who were caught unaware,\" Geltzeiler wrote, citing \"multiple league sources.\" Brown, who was a longtime assistant coach for the Spurs, one of the NBA's most successful franchises, likely saw Carter-Williams as a player who could help the Sixers be competitive. Brown's teams have lost 127 games during his two seasons in Philadelphia. \nA team spokesman denied that the Carter-Williams trade had cause friction in the organization. \n\"That unsubstantiated rumor is a gross mischaracterization of the events leading into the Michael Carter-Williams trade. Our organization has been and will continue to be opportunistic when deal of that nature become available, \" Michael Preston told Sports Illustrated. \nStill, Brown has had little to work with in terms of talent and even less roster stability. Last season, the Sixers used 25 players, 10 more than NBA champion Golden State used, for example \nAlong with Embiid, the Sixers also drafted power forward Dario Saric in the first round in 2014. Geltzeiler's story claims that Saric's father is keeping his son away from the Sixers, preventing the team from buying Sartic out of the professional contract he has in Turkey. Saric, 21, could hold off coming to the NBA until 2017-18. Read or Share this story: http://delonline.us/1Lyxz54 TOP VIDEOS", "external_links": [], "published": "2015-10-17T02:06:00.000+03:00", "crawled": "2015-10-17T06:39:26.864+03:00", "highlightTitle": ""}