{"organizations": [], "uuid": "f9fd517dccb9bca76545e4602e863f394a175f53", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ctpost.com", "main_image": "http://ww4.hdnux.com/photos/41/40/10/8782351/3/rawImage.jpg", "site_section": "http://www.ctpost.com/home/collectionRss/Story-Blocks-Latest-Sports-12286.php", "section_title": "Story Blocks Latest Sports", "url": "http://www.ctpost.com/sports/article/Gaels-blow-past-West-Haven-6567852.php", "country": "US", "title": "Gaels blow past West Haven", "performance_score": 0, "site": "ctpost.com", "participants_count": 1, "title_full": "Gaels blow past West Haven", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T13:34:00.000+03:00", "replies_count": 0, "uuid": "f9fd517dccb9bca76545e4602e863f394a175f53"}, "author": "Doug Bonjour", "url": "http://www.ctpost.com/sports/article/Gaels-blow-past-West-Haven-6567852.php", "ord_in_thread": 0, "title": "Gaels blow past West Haven", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Gaels blow past West Haven By Doug Bonjour Published 6:37 am, Tuesday, October 13, 2015 Photo: Brian A. Pounds / Hearst Connecticut Media Image 1 of / 31 Close Image 1 of 31 \nWest Haven's Adrian Jaynes is stacked up by Shelton defenders Justin Greene, Luis De Camps Moran, and Ronald Hubbard during the first half of their football game at West Haven High School on Monday. Photo: Brian A. Pounds / Hearst Connecticut Media West Haven's Adrian Jaynes is stacked up by Shelton defenders... Image 2 of 31 \nShelton's Kevin Robinson catches a pass in front of West Haven defender Jakai Manning during the first half of their football game at West Haven High School in West Haven, Conn. on Monday, October 12, 2015. Photo: Brian A. Pounds / Hearst Connecticut Media Shelton's Kevin Robinson catches a pass in front of West Haven... Image 3 of 31 \nShelton v. West Haven football at West Haven High School in West Haven, Conn. on Monday, October 12, 2015. Photo: Brian A. Pounds / Hearst Connecticut Media Shelton v. West Haven football at West Haven High School in West... Image 4 of 31 \nShelton v. West Haven football at West Haven High School in West Haven, Conn. on Monday, October 12, 2015. Photo: Brian A. Pounds / Hearst Connecticut Media Shelton v. West Haven football at West Haven High School in West... Image 5 of 31 \nShelton v. West Haven football at West Haven High School in West Haven, Conn. on Monday, October 12, 2015. Photo: Brian A. Pounds / Hearst Connecticut Media Shelton v. West Haven football at West Haven High School in West... Image 6 of 31 \nShelton's Peter Hoff runs the ball during the first half of the Gaels' football game with West Haven at West Haven High School on Monday, October 12, 2015. Photo: Brian A. Pounds / Hearst Connecticut Media Shelton's Peter Hoff runs the ball during the first half of the... Image 7 of 31 \nShelton quarterback Zachary Tuskowski, rushed here be West Haven’s Tevar Dixon, threw four touchdown passes without an interception Monday. Photo: Brian A. Pounds / Hearst Connecticut Media Shelton quarterback Zachary Tuskowski, rushed here be West... Image 8 of 31 \nWest Haven's Justin Santos pursues Shelton runner Peter Hoff during the first half of their football game at West Haven High School in West Haven, Conn. on Monday, October 12, 2015. Photo: Brian A. Pounds / Hearst Connecticut Media West Haven's Justin Santos pursues Shelton runner Peter Hoff during... Image 9 of 31 \nShelton v. West Haven football at West Haven High School in West Haven, Conn. on Monday, October 12, 2015. Photo: Brian A. Pounds / Hearst Connecticut Media Shelton v. West Haven football at West Haven High School in West... Image 10 of 31 \nShelton v. West Haven football at West Haven High School in West Haven, Conn. on Monday, October 12, 2015. Photo: Brian A. Pounds / Hearst Connecticut Media Shelton v. West Haven football at West Haven High School in West... Image 11 of 31 \nShelton v. West Haven football at West Haven High School in West Haven, Conn. on Monday, October 12, 2015. Photo: Brian A. Pounds / Hearst Connecticut Media Shelton v. West Haven football at West Haven High School in West... Image 12 of 31 \nShelton v. West Haven football at West Haven High School in West Haven, Conn. on Monday, October 12, 2015. Photo: Brian A. Pounds / Hearst Connecticut Media Shelton v. West Haven football at West Haven High School in West... Image 13 of 31 \nShelton v. West Haven football at West Haven High School in West Haven, Conn. on Monday, October 12, 2015. Photo: Brian A. Pounds / Hearst Connecticut Media \nShelton v. West Haven football at West Haven High School in West... Image 14 of 31 \nShelton v. West Haven football at West Haven High School in West Haven, Conn. on Monday, October 12, 2015. Photo: Brian A. Pounds / Hearst Connecticut Media Shelton v. West Haven football at West Haven High School in West... Image 15 of 31 \nShelton v. West Haven football at West Haven High School in West Haven, Conn. on Monday, October 12, 2015. Photo: Brian A. Pounds / Hearst Connecticut Media Shelton v. West Haven football at West Haven High School in West... Image 16 of 31 \nShelton v. West Haven football at West Haven High School in West Haven, Conn. on Monday, October 12, 2015. Photo: Brian A. Pounds / Hearst Connecticut Media Shelton v. West Haven football at West Haven High School in West... Image 17 of 31 \nShelton v. West Haven football at West Haven High School in West Haven, Conn. on Monday, October 12, 2015. Photo: Brian A. Pounds / Hearst Connecticut Media Shelton v. West Haven football at West Haven High School in West... Image 18 of 31 \nShelton v. West Haven football at West Haven High School in West Haven, Conn. on Monday, October 12, 2015. Photo: Brian A. Pounds / Hearst Connecticut Media Shelton v. West Haven football at West Haven High School in West... Image 19 of 31 \nShelton v. West Haven football at West Haven High School in West Haven, Conn. on Monday, October 12, 2015. Photo: Brian A. Pounds / Hearst Connecticut Media Shelton v. West Haven football at West Haven High School in West... Image 20 of 31 \nShelton v. West Haven football at West Haven High School in West Haven, Conn. on Monday, October 12, 2015. Photo: Brian A. Pounds / Hearst Connecticut Media Shelton v. West Haven football at West Haven High School in West... Image 21 of 31 \nShelton v. West Haven football at West Haven High School in West Haven, Conn. on Monday, October 12, 2015. Photo: Brian A. Pounds / Hearst Connecticut Media Shelton v. West Haven football at West Haven High School in West... Image 22 of 31 \nShelton v. West Haven football at West Haven High School in West Haven, Conn. on Monday, October 12, 2015. Photo: Brian A. Pounds / Hearst Connecticut Media Shelton v. West Haven football at West Haven High School in West... Image 23 of 31 \nShelton v. West Haven football at West Haven High School in West Haven, Conn. on Monday, October 12, 2015. Photo: Brian A. Pounds / Hearst Connecticut Media Shelton v. West Haven football at West Haven High School in West... Image 24 of 31 \nShelton v. West Haven football at West Haven High School in West Haven, Conn. on Monday, October 12, 2015. Photo: Brian A. Pounds / Hearst Connecticut Media Shelton v. West Haven football at West Haven High School in West... Image 25 of 31 \nShelton v. West Haven football at West Haven High School in West Haven, Conn. on Monday, October 12, 2015. Photo: Brian A. Pounds / Hearst Connecticut Media Shelton v. West Haven football at West Haven High School in West... Image 26 of 31 \nShelton v. West Haven football at West Haven High School in West Haven, Conn. on Monday, October 12, 2015. Photo: Brian A. Pounds / Hearst Connecticut Media Shelton v. West Haven football at West Haven High School in West... Image 27 of 31 \nShelton v. West Haven football at West Haven High School in West Haven, Conn. on Monday, October 12, 2015. Photo: Brian A. Pounds / Hearst Connecticut Media Shelton v. West Haven football at West Haven High School in West... Image 28 of 31 \nShelton v. West Haven football at West Haven High School in West Haven, Conn. on Monday, October 12, 2015. Photo: Brian A. Pounds / Hearst Connecticut Media Shelton v. West Haven football at West Haven High School in West... Image 29 of 31 \nShelton v. West Haven football at West Haven High School in West Haven, Conn. on Monday, October 12, 2015. Photo: Brian A. Pounds / Hearst Connecticut Media Shelton v. West Haven football at West Haven High School in West... Image 30 of 31 \nShelton v. West Haven football at West Haven High School in West Haven, Conn. on Monday, October 12, 2015. Photo: Brian A. Pounds / Hearst Connecticut Media Shelton v. West Haven football at West Haven High School in West... Image 31 of 31 Gaels blow past West Haven 1 / 31 Back to Gallery \nWEST HAVEN — The winds of change swept through Shelton this offseason, stripping the Class LL juggernaut of a few essential parts. Gone was quarterback Mark Piccirillo , a fiery leader and author of countless big-time plays. Gone was linebacker Troy Vasilescu , a punishing tackler with a nonstop motor. \nBy no means did the departures leave the Gaels in a position where they would need a major rebuild — far from it, in fact — but they did raise questions about the SCC. A year after the Gaels rolled their way to an unbeaten regular season, only to see their run to perfection shattered in the state final by another SCC heavyweight, Xavier, had the balance of power shifted? \nNot exactly. \nFive weeks in, this season’s Gaels look a lot like the dominant 2014 version. The Gaels remained perfect Monday, blowing past West Haven 48-27 at Ken Strong Stadium. \n“Everyone’s always doubting us,” said senior wide receiver Sam Kirk, who led all players with three touchdown catches. “Coming into the season, everyone was doubting with a bunch of question marks — just like last year.” \nFellow receiver Kevin Robinson provided a spark early, capping the Gaels’ first touchdown drive (15 plays, 90 yards) with a 2-yard run and the second with a 27-yard pass from Zach Tuskowski, to make it 14-0. Tuskowski threw four touchdown passes and was interception-free for the fourth time in five starts since taking over for Piccirillo. \nIn their five wins, the Gaels are averaging a whopping 41 points. \n“Zach is playing tremendous,” Shelton coach Jeff Roy said. “He had a great game again tonight. He’s just simply doing everything we ask of him. He’s making the reads, he’s executing the offense, we’re getting the ball to our athletes in space. That’s the game plan all year, is get those guys the ball.” \nTuskowski gave Shelton the lead for good late in the first half, connecting with Kirk for a 25-yard touchdown catch and a 21-14 advantage. The Gaels followed with a perfectly executed onside kick, recovered by kicker Joe Zoppi, and doubled the lead on David Wells ’ 43-yard pass to Kirk. \n“We knew it was going to be one of those games. It was a shootout type of game,” Roy said. “We said having an extra possession may help. We saw them bailing a little bit on the kickoffs, and we had been working on surprise onside kicks. Our kicker does a great job of running it.” \nRunning back Anthony Godfrey did most of the damage for West Haven, rushing for scores of 4, 7 and 2 yards. But Godfrey alone wasn’t nearly enough for the Blue Devils (3-2) to keep pace with the high-powered Gaels. \n“Their quarterback just played great,” West Haven coach Rich Boshea said. “Their receivers played great, their offensive line did great, and our defense just wasn’t up for it today. We couldn’t stop them.” \nTuskowski wasn’t the only one to give the Blue Devils problems. Quarterback Tim McCarthy was intercepted three times, twice by Wells and once by Chris Kanios. \ndbonjour@ctpost.com; @DougBonjour \nSHELTON 48, WEST HAVEN 27 \nSHELTON 14 14 12 8 — 48 \nWEST HAVEN 7 7 7 6 — 27 \nS — Kevin Robinson 2 run (Joe Zoppi kick) \nS — Robinson 27 pass Zach Tuskowski (Zoppi kick) \nWH — Anthony Godfrey 4 run ( Jose Conde kick) \nWH — Godfrey 7 run (Conde kick) \nS — Sam Kirk 25 pass Tuskowski (Zoppi kick) \nS — Kirk 43 pass David Wells (Zoppi kick) \nWH — Godfrey 2 run (Conde kick) \nS — Chris Kanios 9 pass Tuskowski (Kick failed) \nS — Kirk 27 pass Tuskowski (Pass failed) \nWH — Chris Chance 55 pass Tim McCarthy (Pass failed) \nS — Peter Hoff 1 run (Kanios pass Tuskowski) \nRecords: Shelton 5-0; West Haven 3-2.", "external_links": [], "published": "2015-10-13T13:34:00.000+03:00", "crawled": "2015-10-13T15:23:00.154+03:00", "highlightTitle": ""}