{"organizations": [], "uuid": "4a331aca68aa89615d839d3eb4c05c7a1fd4ffdc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.indianapolisrecorder.com", "main_image": "http://bloximages.chicago2.vip.townnews.com/indianapolisrecorder.com/content/tncms/assets/v3/editorial/a/94/a94089cc-00a6-11e5-8618-9feec52d04d6/555f6724ad28e.image.jpg", "site_section": "http://www.indianapolisrecorder.com//search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&nsa=eedition&c[]=sports,sports/*&f=rss", "section_title": "Indianapolis Recorder Newspaper - sports,sports/", "url": "http://www.indianapolisrecorder.com/sports/article_57914f26-6dcf-11e5-8b87-6f4d905316b0.html", "country": "US", "title": "Coats Honors 1955 Crispus Attucks Basketball Team", "performance_score": 0, "site": "indianapolisrecorder.com", "participants_count": 1, "title_full": "Coats Honors 1955 Crispus Attucks Basketball Team", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T18:14:00.000+03:00", "replies_count": 0, "uuid": "4a331aca68aa89615d839d3eb4c05c7a1fd4ffdc"}, "author": "For the Recorder", "url": "http://www.indianapolisrecorder.com/sports/article_57914f26-6dcf-11e5-8b87-6f4d905316b0.html", "ord_in_thread": 0, "title": "Coats Honors 1955 Crispus Attucks Basketball Team", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Previous Next Crispus Attucks Dream Team of 1955 \nPictured are Crispus Attucks legendary head coach Ray Crowe, along with the 1955 basketball team that won the Indiana High School Association State Championship that year. They are the first all-Black team to win the state title. Posted: Thursday, October 8, 2015 11:14 am Coats Honors 1955 Crispus Attucks Basketball Team For the Recorder Indianapolis Recorder | 0 comments In a speech on the Senate floor, Senator Dan Coats (R-Ind.) honored the 1955 Crispus Attucks High School basketball team, who won Indiana’s state championship sixty years ago. “Not only were the Tigers the first team from Indianapolis to win the state title, they were the first African-American school in the nation to win an open state tournament,” said Coats. “The Tigers’ success on the basketball court helped tear down many lingering racial barriers of that time. This team inspired the state of Indiana with their hard work, graciousness and sportsmanship.” Coats’ full remarks, as prepared for delivery, are below: “In Indiana, few things personify the Hoosier spirit of hard work, overcoming adversity, persistence and sportsmanship more than high school basketball. Every year, the high school basketball season culminates in February and March with Hoosier Hysteria – the postseason tournament. “The height of Hoosier Hysteria was a half century ago, before school consolidation and before the advent of class basketball. At that time, Indiana had a single athletic class and crowned just one high school basketball state champion each year. For the final game of the tournament, fans would fill Butler University’s historic Hinkle Fieldhouse to standing-room-only capacity. “This phenomena is immortalized in the award-winning 1986 movie Hoosiers, one of my personal favorites. Hoosiers is based on an improbable true story. “Back in the 1950’s, hundreds of small high schools existed across the state, but no small school had ever won the basketball state championship. “In 1954, Milan High School, a rural school of with an enrollment of only 161, faced a much larger school, Muncie Central High School, whose enrollment was 2,200, in the state championship game. The Milan Indians defeated the Muncie Central Bearcats 32-30 to win the state title. Even today, Milan’s incredible accomplishment is still widely admired and discussed by Hoosier basketball fans. “Indiana high school basketball in this era produced not only Milan’s ‘David and Goliath’ squad but also another truly inspirational team. En route to winning the 1954 state championship, Milan defeated the Crispus Attucks Tigers in the semi-state. At that time, Crispus Attucks was an all-black high school in Indianapolis. “Despite their loss to Milan in 1954, the Tigers were back the next year. On March 19, 1955, sixty years ago, Crispus Attucks won the state title by defeating Gary Roosevelt High School 97-74 in the championship game. The next year, Crispus Attucks went undefeated, riding a 45-game winning streak to another state title. Attucks finished the 1950s with a third championship in 1959. Crispus Attucks High School’s 1955 state title was one of several firsts. “Not only were the Tigers the first team from Indianapolis to win the state title, they were the first African-American school in the nation to win an open state tournament. Through the perseverance and leadership of their coach, Ray Crowe, the players learned not just the game of basketball but also valuable lessons about discipline and patience. These lessons resulted in back-to-back state titles. “On the court, the Crispus Attucks teams of the mid-1950s were led by a future professional all-star, champion and Hall of Famer named Oscar Robertson. Oscar Robertson said of those Crispus Attucks teams, ‘The way we played and won, we did it with a lot of class.’ “The Tigers’ success on the basketball court helped tear down many lingering racial barriers of that time. This team inspired the state of Indiana with their hard work, graciousness and sportsmanship. “I join my fellow Hoosiers in marking the sixtieth anniversary of this milestone and honoring this team of champions.”", "external_links": [], "published": "2015-10-08T18:14:00.000+03:00", "crawled": "2015-10-13T12:18:15.479+03:00", "highlightTitle": ""}