{"organizations": [], "uuid": "68c43ea068b6b0161df2724fc37eefdbc60b56f9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sportsnews.com.au", "main_image": "http://sportsnews.com.au/defaultimage.jpg", "site_section": "http://www.sportsnews.com.au/category/motor-sport/feed/", "section_title": "Sports News Australia » Motor Sport News", "url": "http://www.sportsnews.com.au/motor-sport/yamaha-appeal-over-rossi-penalty/161104", "country": "CA", "title": "Yamaha appeal over Rossi penalty", "performance_score": 0, "site": "sportsnews.com.au", "participants_count": 1, "title_full": "Yamaha appeal over Rossi penalty", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T08:56:00.000+02:00", "replies_count": 0, "uuid": "68c43ea068b6b0161df2724fc37eefdbc60b56f9"}, "author": "AAP", "url": "http://www.sportsnews.com.au/motor-sport/yamaha-appeal-over-rossi-penalty/161104", "ord_in_thread": 0, "title": "Yamaha appeal over Rossi penalty", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Yamaha appeal over Rossi penalty Posted by AAP + on 26/10/2015 at 5:56 pm   \nYamaha have appealed against Valentino Rossi’s penalty for a collision at the Malaysian Grand Prix with the Italian claiming it has “cut me off by the legs” ahead of the MotoGP title decider. \nChampionship leader Rossi denied kicking out at defending champion Marc Marquez and sending him sliding out of the race during a tense fight for a crucial third-place finish at Sepang on Sunday. \nRossi was demoted to the back of the grid for the final race of the season at Valencia next month with only rival for the title Jorge Lorenzo just seven points behind. \nThe incident has reignited simmering bad blood between Rossi, a nine-time motorcycling champion pursuing his first title since 2009, and his rivals, including Yamaha teammate Lorenzo. \nRossi, the sport’s grand old man at 36, previously said Marquez had schemed to help his fellow Spaniard Lorenzo win precious points at the Australian Grand Prix. \n“It’s very clear from the helicopter footage (at Sepang) that I didn’t want to make him crash, I just wanted to make him lose time, go outside of the line and slow down, because he was playing his dirty game, even worse than in Australia,” Rossi said. \nThe footage showed an apparently annoyed Rossi slowing down and pinning Marquez toward the outside of the track. \nTheir bikes touched, and after Marquez slid off the track Rossi’s foot can be seen off its peg. \n“It’s clear that when my foot slipped of the foot peg Marquez had already crashed,” Rossi said in comments on Yamaha’s team site. \nMotoGP Race Director Mike Webb confirmed that Yamaha has launched an appeal. \nIn remarks posted on MotoGP’s website, Webb said Marquez was partly to blame for “causing problems to Rossi, who reacted.” \nHowever, Rossi, who has seen his lead over Lorenzo whittled down to just seven points going into the final race, called the punishment unfair, saying Marquez is “making me lose the championship.” \n“The championship is not over yet but this sanction cut me off by the legs,” he said. \nSpain’s Dani Pedrosa cruised to victory in Malaysia while Lorenzo, who is aiming for his third MotoGP crown, seized second place, followed by Rossi. \nLorenzo and Rossi have a history of tense relations, which burst out in to the open following the Sepang clash. \nLorenzo said the popular Rossi should have been punished even more severely but that his superstar status shielded him.  ", "external_links": [], "published": "2015-10-26T08:56:00.000+02:00", "crawled": "2015-10-26T09:05:38.218+02:00", "highlightTitle": ""}