{"organizations": [], "uuid": "563152857c7e202b9eaa01a04b899382c6756d14", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.keloland.com", "main_image": "http://www.keloland.com/_images/data/800x600/68067.jpg", "site_section": "http://www.keloland.com/_rss.cfm", "section_title": "KELOLAND.COM: News, Weather and Sports", "url": "http://www.keloland.com/newsdetail.cfm/project-blue-light-shines-in-sioux-falls/?id=186452", "country": "", "title": "Project Blue Light Shines In Sioux Falls", "performance_score": 0, "site": "keloland.com", "participants_count": 0, "title_full": "Project Blue Light Shines In Sioux Falls", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T07:00:00.000+03:00", "replies_count": 0, "uuid": "563152857c7e202b9eaa01a04b899382c6756d14"}, "author": "", "url": "http://www.keloland.com/newsdetail.cfm/project-blue-light-shines-in-sioux-falls/?id=186452", "ord_in_thread": 0, "title": "Project Blue Light Shines In Sioux Falls", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Leland Steva"], "text": "Project Blue Light Shines In Sioux Falls October 22, 2015, 10:00 PM by Leland Steva SIOUX FALLS, SD - \nIt's almost weekly that you see national headlines of violence towards Law Enforcement Officers. It's an issue that's happened in KELOLAND as well. Thursday night, a special event payed respects to the officers who've paid the ultimate price. \nProject Blue Light began in 1989 when family members of a Philadelphia officer who was killed in the line of duty put two blue lights in their window during the holiday season. Now the event has spread nationwide. This is the 6th year of the event in Sioux Falls, and this year has a little different message. \nIt's a somber ceremony at the Empire Mall as law enforcement officers and citizens gather to pay respects. It was the best turnout ever for the event in Sioux Falls. With the violence happening across the country, Thursday's event wasn't just about remembering the fallen officers, but also saying thank you to those who still put on the uniform. \n\"I think a lot of it is education. I think that law enforcement has reached out to the communities in the past and now I think it's up to the community to realize just what they do and how much they should be appreciative of what law enforcement does everyday,\" Julie Burke-Bowen said. \nAmong the dozens in attendance is a group of future law enforcement officers from Lake Area Tech in Watertown. It's a situation they never want to deal with in their careers, but they want to be prepared for it. \n\"We decided to come here tonight because we want to show respect for fallen officers. We go through officer down memorial pages everyday so we see how many officers have died and what they've died from and take precautionary steps and just show our love for law enforcement,\" Keifer Lesnar said. \nIt's not just about remembering the fallen officers, but the family left behind. Family members of Correctional Officer Ronald \"RJ\" Johnson and Turner County Deputy Chad Mechels were also in attendance. Event Organizer Julie Burke-Bowen says the families love seeing the support. \n\"I'm not sure the family ever gets over the loss of a loved one. I think maybe time helps it fade but at the same time this gives them a feeling that people do care and the community is rallying behind them,\" Burke-Bowen said. \nA tree with with blue lights will stand tall in the Empire Mall through the holiday season, to remind people of those that gave their life to protect the public. \nSince 1884, 64 South Dakota Law Enforcement Officers have died in the line of duty. © 2015 KELOLAND TV. All Rights Reserved.", "external_links": [], "published": "2015-10-23T07:00:00.000+03:00", "crawled": "2015-10-23T07:50:56.551+03:00", "highlightTitle": ""}