{"organizations": [], "uuid": "18855a8757d78c6ed74c1e04b925e79f0a22fecc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "onlineathens.com", "main_image": "http://onlineathens.com/sites/default/files/14830356.jpg", "site_section": "http://ath-cdn.com/taxonomy/term/2/feed", "section_title": "Sports", "url": "http://onlineathens.com/sports/2015-10-22/green-daniels-set-square-when-winder-barrow-hosts-clarke-central", "country": "US", "title": "Green, Daniels set to square off when Winder-Barrow hosts Clarke Central", "performance_score": 0, "site": "onlineathens.com", "participants_count": 1, "title_full": "Green, Daniels set to square off when Winder-Barrow hosts Clarke Central", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T05:26:00.000+03:00", "replies_count": 0, "uuid": "18855a8757d78c6ed74c1e04b925e79f0a22fecc"}, "author": "Nicole Saavedra", "url": "http://onlineathens.com/sports/2015-10-22/green-daniels-set-square-when-winder-barrow-hosts-clarke-central", "ord_in_thread": 0, "title": "Green, Daniels set to square off when Winder-Barrow hosts Clarke Central", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Green, Daniels set to square off when Winder-Barrow hosts Clarke Central By Nicole Saavedra published Thursday, October 22, 2015 close A look at the next round of state softball playoffs \nWhen Winder-Barrow fell behind in its win over host Cedar Shoals last week, the Bulldoggs’ offensive line encouraged coach Heath Webb to keep running the ball. \nWith running back CeCe Green behind them, they were confident. And the move paid off — Green scored three touchdowns in Winder-Barrow’s come-from-behind 30-25 victory. \n“It was cool to have them come to the sidelines and say, ‘Coach, we’re moving them up front, just keep running the ball, coach. Just keep running the ball, don’t feel like you’ve got to throw it,’” Webb said. “When your offensive line has that much confidence, you want to be able to feed into their confidence and they did a great job.” \nWinder-Barrow (4-3, 4-2) hosts Clarke Central (3-4, 3-3) at 7:30 p.m. today in a crucial Region 8- game pitting two of the area’s best senior running backs and two emerging sophomore quarterbacks against each other. \nGreen and Clarke Central running back JaQua Daniels were both preseason Terrific 10 selections. Green, who missed a handful of games midseason due to injury, has rushed for 899 yards and eight touchdowns on 119 carries. Daniels has tallied 666 yards and four scores on 110 carries and leads the Gladiators with 22 receptions for 200 yards and two scores. \nDaniels stands three inches taller than Green and is about 25 pounds heavier. Webb and Clarke Central coach Ahren Self gave Daniels the nod as a power runner. They credited Green on his speed. \n“CeCe is a little bit more of a shifty runner, but he has power, too,” Self said. “He doesn’t go down on the first hit and he gets a lot of yards after contact. JaQua is a little more of a power back. He does have speed as well, but there’s (a) little bit of a difference but not much. (Green’s) a little bit smaller but still runs the ball tough.” \nAnd both backs are benefiting from improving quarterback play. Winder-Barrow quarterback Brock Landis is 3-0 as a starter and has thrown for 511 yards and three touchdowns. But most crucial is Landis’ mobility, particularly his ability to scramble and extend plays. He’s run for 150 yards and six touchdowns. \n“We have to make sure we block the whole play,” Winder-Barrow lineman Justin Simmons said. “Brock, he can run around and make stuff happen.” \nClarke Central quarterback Jack Mangel has thrown for 919 yards and 10 touchdowns. In the Gladiators’ 44-7 upset of Gainesville last week, Mangel threw for 352 yards and four touchdowns. \n“They’re obviously getting better and better each week too,” Webb said. “That’s the thing with some for these teams that were young and inexperienced at the beginning of the season, now they’re starting to look pretty good.” \nAnd for both teams, it’s the perfect time to see improvements. Winder-Barrow, which topped Clarke Central 35-29 to notch its first win in 13 tries last season, has won its last three games by a touchdown or less. Since Webb’s arrival last season, they’re 6-2 in games decided by seven points or fewer. \nClarke Central’s win over Gainesville was its first in the series since 1974 and was needed after a 28-21 loss to Flowery Branch. The Gladiators are also searching for their first win on the road this season. \n“They’ve got a good environment over there,” Self said. “It’s going to be a heck of a football game. It’s going to be a war and just because we beat Gainesville, we’ve got to go in there and play them just like Gainesville because they’re just as good as they are.” \n ", "external_links": [], "published": "2015-10-23T05:26:00.000+03:00", "crawled": "2015-10-23T07:31:48.364+03:00", "highlightTitle": ""}