{"organizations": [], "uuid": "a1fdad704e6513d9362658240735e7588c657886", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.completesportsnigeria.com", "main_image": "http://www.completesportsnigeria.com/wp-content/uploads/2015/10/Hector-Cuper2.jpg", "site_section": "http://www.completesportsnigeria.com/feed/", "section_title": "Complete Sports Nigeria", "url": "http://www.completesportsnigeria.com/egypt-coach-happy-over-unity-in-pharaohs-camp/", "country": "US", "title": "Egypt Coach Happy Over Unity In Pharaohs’ Camp", "performance_score": 0, "site": "completesportsnigeria.com", "participants_count": 1, "title_full": "Egypt Coach Happy Over Unity In Pharaohs’ Camp", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T10:38:00.000+03:00", "replies_count": 0, "uuid": "a1fdad704e6513d9362658240735e7588c657886"}, "author": "Prince Imehiron", "url": "http://www.completesportsnigeria.com/egypt-coach-happy-over-unity-in-pharaohs-camp/", "ord_in_thread": 0, "title": "Egypt Coach Happy Over Unity In Pharaohs’ Camp", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "October 13, 2015 ↔ no comments Egypt Coach Happy Over Unity In Pharaohs’ Camp Share Tweet + 1 Mail \nThe bad blood generated by the rivalry between Egyptian sides Zamalek and Al Ahly gave way to national service and the national team coach Hector Cuper is satisfied by his management of situations. \nEgypt and Nigeria are preparing for 2017 African Cup of Nations qualifying battles next year and have played some friendly games to that effect. \nBut Ahly and Zamalek players were involved in a war of words after the Egypt Cup Final where Zamalek defeated their arch-rivals to claim a first domestic double since 1988. \nThat rivalry has threatened to derail the ambitions of the national team that has paraded several players from both sides. \nAccording to news outlet, Ahram.com.eg, Egypt coach Hector Cuper is satisfied by achieving his set objectives in camp. \nThe Pharaohs spent five days training in the United Arab of Emirates where they defeated Zambia 3-0 in a friendly on Sunday. \nEgypt defeated The Bullets of Zambia 3-0 in Abu Dhabi Sunday, thanks to a brace by Ahmed Hassan ‘Koka’ and a lone goal by Amr Gamal. The win marked Cúper’s fifth straight victory since being appointed Egyptian national team coach. \n“I am satisfied with the camp and I think we fulfilled most of our goals technically and morally. \n\"During the camp we were able to remove any tensions between the players and reunite them under the national team,” Cuper was quoted as saying on the Egyptian FA website on Monday. \nThe Cairo giants are set to face off again in the Egyptian Super Cup on Thursday in the UAE as the 2015/16 gets underway. \nCuper also lamented the Senegal match crisis. \n“I wanted to play two matches during our camp but unfortunately that didn’t happen. It is not true that there has been no pressure on me to play the game, we (the EFA) agreed to cancel the game after the latest discoveries,” Cuper said. \nEgypt called off a friendly game against Senegal last Thursday, same day Nigeria lost 2-0 to DR Congo in another friendly in Belgium, after finding out that the latter would field their under-23 team, rather than their senior squad. Related", "external_links": [], "published": "2015-10-13T10:38:00.000+03:00", "crawled": "2015-10-13T11:35:45.230+03:00", "highlightTitle": ""}