{"organizations": [], "uuid": "7d760d399dec52b579eb425703887b5142ef5cf3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattlepi.com", "main_image": "http://www.seattlepi.com/img/pages/article/opengraph_default.png", "site_section": "http://seattlepi.com//home/collectionRss/Home-Hcat-Sports-9098.php", "section_title": "Home Hcat Sports", "url": "http://www.seattlepi.com/sports/article/Fan-Super-Bowl-ticket-process-violates-NJ-6557769.php", "country": "US", "title": "Fan: Super Bowl ticket process violates consumer law", "performance_score": 0, "site": "seattlepi.com", "participants_count": 1, "title_full": "Fan: Super Bowl ticket process violates consumer law - seattlepi.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "7d760d399dec52b579eb425703887b5142ef5cf3"}, "author": "seattlepi.com", "url": "http://www.seattlepi.com/sports/article/Fan-Super-Bowl-ticket-process-violates-NJ-6557769.php", "ord_in_thread": 0, "title": "Fan: Super Bowl ticket process violates consumer law", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PHILADELPHIA (AP) — A New Jersey man asked a federal appeals court Thursday to revive his consumer protection lawsuit that aims to flag the NFL over the number of tickets sold to the public for the 2014 Super Bowl.\nA lawyer for Josh Finkelman , of New Brunswick, said the league releases only about 900 tickets for the public lottery, less than 1 percent of the total. The remaining tickets go to the individual teams, corporate partners, media outlets and others.\nFinkelman complained that fans like him were left to pay $2,000 or more per ticket on the secondary market. His lawyer, Bruce Nagel , argued Thursday that New Jersey law requires anyone selling tickets to an event to release 95 percent of them to the public.\n\"The NFL has done this for 50 years, and it's fine in most jurisdictions. But New Jersey consumer protection laws are stricter,\" Nagel argued to a three-judge panel of the 3rd U.S. Circuit Court of Appeals .\nThe judges seemed skeptical of Finkelman's right to sue since he never entered the Super Bowl lottery at all. But Nagel called that irrelevant, and said the case hinges on the number of tickets offered for sale.\nThe NFL, in response, said the lottery is not a public sale at all and argued that the New Jersey law doesn't apply. The lottery offers winners the chance to purchase tickets at prices that last year started at $500.\n\"There's no fundamental right to go see the Super Bowl,\" NFL lawyer Jonathan Pressment argued.\nThe judges questioned what actual harm people suffered if they missed the game because of high prices on the secondary market, and whether the NFL could be held responsible.\nThe NFL compared the issue to Catholic parishes that get a bounty of tickets to see the pope.\nThe two judges on the panel from New Jersey — Julio M. Fuentes and Maryanne Trump Barry — quipped that Pope Francis ignored New Jersey on his recent U.S. tour.\n\"We're used to it,\" Barry said.\nThe hearing came after a district judge in New Jersey threw out Finkelman's case. The 3rd Circuit then agreed to hear the appeal.\nThe case only involves Super Bowl XLVIII, held last year at the Meadowlands in East Rutherford. Finkelman is seeking class-action status to represent anyone who paid above face value for seats on the secondary market and anyone who was too frustrated by the long odds to enter the lottery.\nFinkelman, for his $2,000 ticket, sat in the nosebleed seats. The Seattle Seahawks went on to crush Peyton Manning and the Denver Broncos 43-8.", "external_links": [], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T22:49:25.539+03:00", "highlightTitle": ""}