{"organizations": [], "uuid": "9a3e2324325270c5ea157f2374d839e4460abfde", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.masslive.com", "main_image": "http://imgick.masslive.com/home/mass-media/width620/img/sports_impact/photo/tweer-thumbjpg-4fb8a4caf733702d.jpg", "site_section": "http://impact.masslive.com/sports/atom.xml", "section_title": "Sports - MassLive.com", "url": "http://www.masslive.com/sports/2015/10/radio_host_mike_bell_suspended.html", "country": "US", "title": "Radio host Mike Bell suspended for sexist comments made toward ESPN's Jessica Mendoza during game", "performance_score": 0, "site": "masslive.com", "participants_count": 1, "title_full": "Radio host Mike Bell suspended for sexist comments made toward ESPN's Jessica Mendoza during game", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T23:58:00.000+03:00", "replies_count": 0, "uuid": "9a3e2324325270c5ea157f2374d839e4460abfde"}, "author": "Nick O'Malley | nomalley@masslive.com", "url": "http://www.masslive.com/sports/2015/10/radio_host_mike_bell_suspended.html", "ord_in_thread": 0, "title": "Radio host Mike Bell suspended for sexist comments made toward ESPN's Jessica Mendoza during game", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments \nMike Bell, a sports radio host for 92.9 The Game in Atlanta , wasn't the only person who made ugly comments about a woman sitting in the booth during ESPN's Wild Card Game broadcast Tuesday night -- but he has since become the public face of the wave of sexism that emerged during the game. \nWith the Houston Astros taking the New York Yankees, former Olympic softball player Jessica Mendoza had become the first woman to be in the booth for a nationally televised MLB postseason broadcast. The milestone did not escape viewers' notice, and often for the wrong reasons. This guy is so INCENSED that a woman would be allowed near sports that he has tweeted at 59(!) strangers about it pic.twitter.com/Wz6B7kYqp9 — Molly Knight (@molly_knight) October 7, 2015 \nOf the many people who made crass and sexist comments about Mendonza's participation, it was Bell who caught most of the attention , namely for referring to her as \"Tits McGee\" while complaining about her presence. A woman made history tonight calling an MLB Playoff game for ESPN. This is what an Atlanta radio guy thought of it. pic.twitter.com/xf3Rc07EFY — Boiled Sports (@BoiledSports) October 7, 2015 Jessica Mendoza was a 4-time 1st team All-American softball player. I'd say she qualifies. Mike Bell is a genius. pic.twitter.com/zHoGIFznNh — Tim Ryan (@TheSportsHernia) October 7, 2015 \nComments of this ilk from Bell (and many others) sparked a backlash during the game, but largely went unchecked, as is often the case when women take on high-profile roles in sports journalism and broadcasting. \nFor Bell, though, the comments led to a suspension from his employer. According to AJC.com , Bell read off a statement during a pre-taped segment. \nHere's an exerpt of Bell's statement from AJC.com: \"I didn't get it,\" he said. \"I get it now. There is no place for that kind of stuff on my show. I will be more mindful. I hope I can be a better talk show host and better person. This has been an eye-opening experience.\" \nBell has since deleted the offending tweets , but did leave up one odd opinion to wrap up the whole affair: He'd rather listen to Mendonza calling games than Curt Schilling (according to a tweet that he deleted Wednesday afternoon).", "external_links": [], "published": "2015-10-07T23:58:00.000+03:00", "crawled": "2015-10-08T01:09:04.974+03:00", "highlightTitle": ""}