{"organizations": [], "uuid": "4eca1d172264ff6fb5999ac2e5ab9b7325eecb39", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thegazette.com", "main_image": "http://www.thegazette.com/storyimage/GA/20151025/ARTICLE/151029752/AR/0/AR-151029752.jpg", "site_section": "http://feeds.feedburner.com/~r/GazetteOnlineSports/~6/1", "section_title": "Eastern Iowa Sports News and Information from Gazette Online", "url": "http://www.thegazette.com/subject/sports/b1g-numbers-hawkeyes-84-chance-to-reach-playoff-20151025", "country": "US", "title": "B1G numbers: Hawkeyes 8.4% chance (?) to reach playoff", "performance_score": 0, "site": "thegazette.com", "participants_count": 0, "title_full": "B1G numbers: Hawkeyes 8.4% chance (?) to reach playoff", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T17:24:00.000+02:00", "replies_count": 0, "uuid": "4eca1d172264ff6fb5999ac2e5ab9b7325eecb39"}, "author": "", "url": "http://www.thegazette.com/subject/sports/b1g-numbers-hawkeyes-84-chance-to-reach-playoff-20151025", "ord_in_thread": 0, "title": "B1G numbers: Hawkeyes 8.4% chance (?) to reach playoff", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mike Hlas"], "text": "Mike Hlas , The Gazette October 25, 2015 | 11:24 am \nThe haves and have-nots got more separation Saturday in the Big Ten. They know who they are. \nHere are some numbers from those games and this season. \n0 — The Big Ten didn’t have any four-overtime games Saturday. The ACC (Duke 45, Virginia Tech 43) and SEC (Arkansas 54, Auburn 46) had one apiece. \n1 — Penn State avenged its 1-point (20-19) home loss to Maryland last year with a 31-30 win over the Terrapins in Baltimore. \n2 — Iowa, for all practical purposes, has a two-game lead in the Big Ten West. The Hawkeyes are one game ahead of Wisconsin, and at least two games clear of everyone else. But since Iowa beat Wisconsin, the Badgers must finish ahead of the Hawkeyes to claim the division’s berth in the league-title game. \n3 — The Big Ten is tied with the American Athletic Conference and Big 12 for most unbeaten teams with three. Iowa, Michigan State and Ohio State have perfect records, as do Houston, Memphis and Temple of the AAC, and Baylor, Oklahoma State and TCU of the Big 12. The other unbeatens are Clemson, LSU and Toledo. \n4 — Nebraska blew a fourth-quarter lead for the fourth time this season in its 30-28 loss to Northwestern. The Huskers only lost three times in Bo Pelini’s 7-season tenure when they had a fourth-quarter lead. \n6 — Wisconsin’s 24-13 win at Illinois was its sixth-straight victory over the Illini, all by double digits. \n7 — There were seven lead-changes in Penn State’s 31-30 win over Maryland. \n8 — Michigan State and Ohio State are the only 8-0 teams in FBS. \n8 — Nebraska has lost eight of its last 12 games. \n8.4 — Nate Silver, renowned statistician/writer, tweeted Saturday that Iowa has an 8.4 percent chance of reaching the College Football Playoff (and a 1 percent chance of becoming national-champion). He gave Ohio State a 58.9 percent chance of reaching the playoff, and Michigan State 27.5 percent. This was before previous unbeatens Florida State and Utah lost Saturday. \n13 — Ohio State’s Ezekiel Elliott has 13 straight 100-yard rushing games, the longest current FBS streak. He had 142 yards in the Buckeyes’ 49-7 clubbing of Rutgers. \n14 — Road teams are 14-10 in Big Ten conference games. \n15 — Fifteen PAT attempts have been missed by Big Ten kickers this season. Indiana missed two Saturday at Michigan State to tie Iowa and Rutgers for the league-most with three. \n28 — Ohio State is 28-0 in Big Ten regular-season games with Urban Meyer as coach. \n30 — Nebraska ran 30 more plays than Northwestern in the Huskers’ 30-28 loss in Lincoln, 86 plays to 56. The Huskers had the ball for 38:58. \n46 — Indiana has been outscored by a total of 46-0 in its last two fourth-quarters, in losses to Rutgers and Michigan State. \n60 — UCLA’s Ka’imi Fairbairn kicked a 60-yard field goal against California Thursday night. Until then, Iowa’s Marshall Koehn had the longest FBS field goal this season, a 57-yarder that beat Pittsburgh. \n68 — Northwestern quarterback Clayton Thorson had a 68-yard run in the first quarter at Nebraska. The Wildcats rushed for 51 yards total against Iowa the week before. \n81 — Wisconsin’s top rusher in its win at Illinois was a wide receiver. Alex Erickson had four carries for 81 yards. \n177 — Michigan State, though unbeaten, has allowed 177 points in eight games. Two years ago, the Spartans allowed 175 points in 14 games. \n398 — MSU quarterback Connor Cook passed for 398 yards in the Spartans’ 52-26 win over Indiana, two yards shy of Bill Burke’s 1999 school record. \n7,453 — Penn State junior Christian Hackenberg set the school mark for career passing yards Saturday. His 315 yards gave him 7,453. He completed just 13 passes against Maryland, but for an average of 24.2 yards per completion. Your Next Articles", "external_links": [], "published": "2015-10-25T17:24:00.000+02:00", "crawled": "2015-10-25T22:13:43.297+02:00", "highlightTitle": ""}