{"organizations": ["NASCAR"], "uuid": "4614a2c06d777a524fac44efd0071b38c8791d36", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wralsportsfan.com", "main_image": "http://wwwcache.wralsportsfan.com/asset/racing/nascar/2015/10/11/14962617/14962619-1445020959-646x485.jpg", "site_section": "http://www.wralsportsfan.com/news/rss/697/", "section_title": "Sports Fan stories from WRAL.com", "url": "http://www.wralsportsfan.com/drivers-universally-praise-nascar-s-2016-rules-package/14975234/", "country": "US", "title": "Drivers universally praise NASCAR's 2016 rules package", "performance_score": 0, "site": "wralsportsfan.com", "participants_count": 0, "title_full": "Drivers universally praise NASCAR's 2016 rules package", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T22:17:00.000+03:00", "replies_count": 0, "uuid": "4614a2c06d777a524fac44efd0071b38c8791d36"}, "author": "", "url": "http://www.wralsportsfan.com/drivers-universally-praise-nascar-s-2016-rules-package/14975234/", "ord_in_thread": 0, "title": "Drivers universally praise NASCAR's 2016 rules package", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Drivers universally praise NASCAR's 2016 rules package \nPosted 1:25 p.m. today Your friends e-mail addresses (comma separated): * Subject: * You must enter the characters with black color that stand out from the other characters By DAVE SKRETTA, AP Sports Writer \nKANSAS CITY, Kan. — Joey Logano had a one-word response when asked for his thoughts on the low-downforce rules package that NASCAR approved for next season: \"Great.\" \n\"I think it's exactly what we want,\" said Logano, the only driver already guaranteed a spot in the next round of the Chase after his victory last weekend at Charlotte. \"I think all the drivers have always wanted less downforce on the cars.\" \nNASCAR announced Wednesday it would use a base package that it used successfully at Kentucky Speedway and Darlington Raceway for next season. The package features a 3.5-inch spoiler, a 0.25-inch front leading splitter edge and a 33-inch radiator pan to cut down on the amount of downforce, which in turns means less grip that makes the cars more difficult to drive. \nWhy is that good? It takes some of the aerodynamics out of the equation, and puts races back in the hands of drivers. They are able to pass more easily and produce more exciting racing. \n\"Darlington in the past has been a tough racetrack to see a great race, and this year was one of the best races we've had all year,\" Logano said. \"The only difference was the rules package.\" \nMatt Kenseth said the biggest difference will be at tracks with one predominant groove. \n\"I think it gives you definitely more opportunities to pass if you catch a car,\" he said, \"especially at some of these tracks that are aero-sensitive.\" \nPerhaps the biggest challenge now is for Goodyear to produce the right tires for each of the tracks. Less downforce means tires can be softer and have more grip, but that in turn leads to a balancing act: Softer tires tend to break down more quickly, making safety an issue. \nGoodyear tested at Kansas recently, and will head to Michigan for tests next week. \n\"If you look at the number of different codes we run, we have about 30 to cover the three series,\" Goodyear director of racing Greg Stucker said, referring to the Sprint Cup, Xfinity and Truck Series. \"That will go up next year because the Cup will diverge from the other two.\" \nJust how much they diverge remains to be seen. \nFor now, drivers are about as universal in their approval of the rule changes as they were vocal in their disdain for the current package, which made it difficult to pass. \n\"The two races we had low-downforce were great shows. Everybody was excited about that,\" Martin Truex Jr. said. \"I think Goodyear has the biggest challenge, certain racetracks will be difficult to develop a tire. But I think it's going to be great. It's going to put it more in the drivers' hands.\" \nCopyright 2015 by The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Triangle Area Special Offers", "external_links": [], "published": "2015-10-16T22:17:00.000+03:00", "crawled": "2015-10-16T22:55:28.438+03:00", "highlightTitle": ""}