{"organizations": [], "uuid": "5a9b0abf2a96548a669b97cbebffea75b2d894d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/10d5e7798b77acc838fc05a193ef32b7.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/football/wayne-rooney-injuries-wont-hamper-manchester-city-in-derby/6983692/", "country": "JE", "title": "Wayne Rooney: Injuries won't hamper Manchester City in derby", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "Wayne Rooney: Injuries won't hamper Manchester City in derby", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T17:02:00.000+03:00", "replies_count": 0, "uuid": "5a9b0abf2a96548a669b97cbebffea75b2d894d3"}, "author": "", "url": "http://www.sport.co.uk/football/wayne-rooney-injuries-wont-hamper-manchester-city-in-derby/6983692/", "ord_in_thread": 0, "title": "Wayne Rooney: Injuries won't hamper Manchester City in derby", "locations": ["Manchester City"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Wayne Rooney"], "text": "Wayne Rooney: Injuries won't hamper Manchester City in derby 24 Oct 2015 14:02:05 \ncomments \nStriker Wayne Rooney believes Manchester City still have the players to hurt rivals United on Sunday despite the absence of David Silva and Sergio Aguero. \nWith home advantage and a shorter injury list than their rivals, United go into the 170th Manchester derby as slight favourites. \nAguero has played a key part in City's recent run of six wins from their last eight derbies. \nThe Argentinian has scored six goals in his last five matches against Manchester United, but on Sunday Wilfried Bony is expected to lead the line for the visitors because Aguero has a hamstring injury. \nBony has only scored twice this season, but in Kevin De Bruyne and Raheem Sterling, City have two deadly players who United will have to keep a close eye on, according to Rooney. \n\"Nowadays the top teams have such good squads that they can cope with injuries,\" the United striker told United Review. \n\"The players they brought in cost over £100million in De Bruyne and Sterling, so they are two fantastic young players and we have to nullify their threats and take advantage of their flaws. \n\"Raheem is a fantastic player and a great lad as well, but he is still a young lad and still has a lot to learn. The good thing about Raheem is that he wants to learn. \n\"He has started his career at City really well but hopefully we can slow him down a bit on Sunday and come out on top.\" \nHaving scored a record 11 goals in this fixture, Rooney's performance on Sunday could be decisive too. \nThe United captain has been criticised for a lean return of two goals in eight league matches this season, but continues to make significant achievements in the game. \nRooney, who turned 30 on Saturday, became England's all-time leading goalscorer in September and after scoring in the 3-0 win over Everton last week he became the joint second highest scorer in Premier League history alongside Andy Cole. \n\"He was a great striker over the years for Newcastle and for United, which I think was the best time of his career,\" Rooney said of Cole. \n\"He was a natural goalscorer, he was great to watch and he was a big player for United. \n\"It's great to be alongside him now. I am still quite a long way off Alan Shearer; he has 260 goals and that one may be difficult to reach, but I am pleased to be second with Andy.\" \nRooney reaching the landmark age of 30 has generated much debate about his ability and status at the club. \nFor Phil Jones, there is no doubt his United team-mate deserves to be regarded as one of the club's all-time greats. \nDefender Jones said: \"He's a great guy in the dressing room. He has a laugh and a joke but he's serious when he needs to be. \n\"He's a great lad, an unbelievable player and probably one of those who will go down as an all-time great for Manchester United.\" \nAnother derby winner like the famous one he struck in 2011 will help Rooney's standing, although t he former Everton forward does not believe the outcome of the match will be crucial in the race for the title. \nRooney added: \"Winning is top of our agenda, but you can't say whichever team wins will go on to win the title. \n\"There is a lot of local pride, we want to win and it's important that we go into the game confident. If we play the way we know we can, then we can certainly take the three points.\" Related Sport News", "external_links": [], "published": "2015-10-24T17:02:00.000+03:00", "crawled": "2015-10-24T20:20:53.605+03:00", "highlightTitle": ""}