{"organizations": [], "uuid": "3194f756baf87b1d66790cb1fb9859e9d5dbc068", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.rep-am.com", "main_image": "http://www.rep-am.com/img/meatball.png", "site_section": "http://www.rep-am.com/?rss=sports", "section_title": "Sports from www.rep-am.com", "url": "http://www.rep-am.com/articles/2015/10/11/sports/912350.txt", "country": "US", "title": "Close calls in Cy Young races; Harper, Donaldson for MVP", "performance_score": 0, "site": "rep-am.com", "participants_count": 0, "title_full": "Close calls in Cy Young races; Harper, Donaldson for MVP", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T08:05:00.000+03:00", "replies_count": 0, "uuid": "3194f756baf87b1d66790cb1fb9859e9d5dbc068"}, "author": "", "url": "http://www.rep-am.com/articles/2015/10/11/sports/912350.txt", "ord_in_thread": 0, "title": "Close calls in Cy Young races; Harper, Donaldson for MVP", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Donaldson", "Harper"], "text": "Tuesday, October 6, 2015 1:05 AM EDT \nClose calls in Cy Young races; Harper, Donaldson for MVP By MIKE FITZPATRICK AP Baseball Writer NEW YORK (AP) — Here's how stacked the NL Cy Young race is: Max Scherzer struck out 276 batters with a 2.79 ERA and became the first major leaguer in 42 years to throw two no-hitters in one season.Those credentials might be good enough to challenge Gerrit Cole for fourth place.In a season filled with pitching performances for the ages, Jake Arrieta, Zack Greinke and perennial contender Clayton Kershaw headline one of the deepest Cy Young fields in decades.Over in the American League, playoff-bound lefties Dallas Keuchel and David Price are nip-and-tuck, too.So with Bryce Harper and Josh Donaldson clear-cut MVPs, this time it's the men on the mound who require that extra-close look as the Baseball Writers' Association of America picks its major prize winners.Greinke had a 1.30 ERA on July 25 for the Los Angeles Dodgers, and his scoreless streak ended the next day at 45 2/3 innings — longest in the majors since Orel Hershiser's big league record of 59 in 1988. The right-hander appeared well on his way to National League honors after winning the AL Cy Young Award in 2009 with Kansas City.Then, incredibly, Arrieta caught up.Finally harnessing his ample potential, the new Chicago Cubs ace put together perhaps the greatest second half of any pitcher in history. His 0.75 ERA after the All-Star break was the lowest ever, and he won his final 11 decisions to finish 22-6 with a 1.77 ERA, topping the majors in wins.Arrieta exceeded Greinke (19-3) by 6 1/3 innings and fanned 36 more batters. Kershaw, not to be forgotten, led the league in both those categories and compiled a whopping 301 strikeouts to 236 for Arrieta. The Dodgers' lefty became the first pitcher to reach 300 since Arizona's Randy Johnson and Curt Schilling in 2002.Kershaw wound up 16-7 with a 2.13 ERA. His teammate, Greinke, led the majors at 1.66 — lowest by a qualifying pitcher since Greg Maddux's mark of 1.63 for Atlanta in 1995. That halted an unprecedented run by Kershaw of four consecutive major league ERA titles, a huge reason he won three of the past four NL Cy Young Awards and was selected league MVP last year.\"You look at the numbers and oh my God, they're right there,\" Braves manager Fredi Gonzalez said. \"All three guys. Innings pitched, batting average against, WHIPs, strikeouts. I mean it's like, holy cow.\"No wonder Scherzer (14-12), Cole (19-8, 2.60) and Madison Bumgarner (18-9, 2.93, 234 Ks) barely get a mention despite marvelous stats that could easily claim the trophy in a season without such stiff competition.\"I think Arrieta for me,\" Gonzalez said. \"Just because he pitched two games against us that were, I mean — I think our best swing was a check swing in the third inning.\"Agreed, Fredi. Arrieta by a hair.And if that's how it goes, Greinke would have the second-lowest ERA for a qualifying pitcher who did not win the Cy Young since the award's inception in 1956, according to STATS. Luis Tiant went 21-9 with a 1.60 ERA for Cleveland in 1968 but was beaten out by Detroit's Denny McLain (31-6, 1.96).Talk about a tough-luck loss. ... Wow.Voting by the BBWAA is conducted before the postseason starts Tuesday, and results will be announced in November.A look at the other big awards:AL CY YOUNG: Traded from Detroit to Toronto in late July, Price (18-5) won his second AL ERA title at 2.45. That was just a sliver better than Keuchel (20-9, 2.48), who went 15-0 in 18 home starts at Houston's hitter-friendly ballpark to help the surprising Astros earn a wild card. Price, meanwhile, pitched the AL East champion Blue Jays to their first playoff berth in 22 years.\"I think they've been both great leaders for their staff. They've given innings, they've given wins,\" said New York Yankees manager Joe Girardi, who watched his hitters struggle against both aces this season. \"It would be hard for me to pick either one.\"Same here — but the choice is Keuchel in a very close call. He pitched 11 2/3 more innings than Price, the 2012 winner with Tampa Bay.The only Cy Young Award winner to switch teams during the season was Rick Sutcliffe, traded from the Indians to the Cubs in 1984.NL MVP: Yoenis Cespedes was a fun topic this summer, especially as he slugged the New York Mets past Harper and the underachieving Nationals in the NL East. But to be fair, Cespedes spent only two months in the National League after he was acquired from Detroit. And Harper was hardly the reason Washington fell flat. He led the league in runs, OPS (by a wide margin) and WAR while tying Colorado's Nolan Arenado for the home run crown. Case closed.AL MVP: Donaldson was traded from Oakland to Toronto last offseason in a deal general manager Billy Beane might want back. The third baseman topped the league in RBIs (123) and runs (122) while sparking the Blue Jays' dangerous lineup.\"He does everything. He hits for power, he gets on base, he plays defense. There's just a lot of things to like about him as a player,\" Chicago White Sox manager Robin Ventura said. \"And knowing that Toronto hasn't been in there the last few years, he goes over in his first year and they just become a different-looking team.\"Donaldson definitely had more help than Angels star Mike Trout, last year's winner who led the AL in WAR and OPS. Both hit 41 homers. Donaldson, however, gets points for driving in 33 more runs, scoring 18 more and powering his team into the playoffs.NL ROOKIE OF THE YEAR: Kris Bryant, Chicago Cubs.AL ROOKIE OF THE YEAR: Carlos Correa, Houston Astros.NL MANAGER OF THE YEAR: Mike Matheny, St. Louis Cardinals.AL MANAGER OF THE YEAR: Paul Molitor, Minnesota Twins. \nFollow Us We encourage your feedback and dialog. Please be civil and respectful.If you're witty, to the point and quotable, your reader comments may also be included on the Around the Towns page of The Sunday Republican. Readers must be registered and logged in to post comments on the site. Registration is free. Click Here to register. A Subscription is not required to post comments only a Registration.\nLog In", "external_links": [], "published": "2015-10-06T08:05:00.000+03:00", "crawled": "2015-10-11T08:18:15.998+03:00", "highlightTitle": ""}