{"organizations": [], "uuid": "9cdbd14b16c527296f899534391b662b31a8260a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.courier-journal.com", "main_image": "http://www.gannett-cdn.com/-mm-/3a48916abc00862645644511bdcad1e5ab6c1fbf/c=0-76-600-414&amp;r=x633&amp;c=1200x630/local/-/media/2015/07/27/Louisville/B9318239026Z.1_20150727154130_000_GKLBFD6BR.1-0.jpg", "site_section": "http://www.courier-journal.com/", "section_title": "Louisville News, Sports, Business | The Courier-Journal", "url": "http://www.courier-journal.com/story/news/local/2015/10/14/louisville-water-company-omni-hotel/73929852/", "country": "US", "title": "Old Water Co. plan may endanger Omni project", "performance_score": 0, "site": "courier-journal.com", "participants_count": 13, "title_full": "Old Water Co. plan may endanger Omni project", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T00:28:00.000+03:00", "replies_count": 18, "uuid": "9cdbd14b16c527296f899534391b662b31a8260a"}, "author": "courier-journal.com", "url": "http://www.courier-journal.com/story/news/local/2015/10/14/louisville-water-company-omni-hotel/73929852/", "ord_in_thread": 0, "title": "Old Water Co. plan may endanger Omni project", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "With a landmark commission hearing looming Thursday, a top city official warned Wednesday that designating the old Louisville Water Co. site as a landmark could endanger the nearly $300 million Omni Hotel Development.\nThe landmark designation for the Third Street historical building facades — the subjects of several attempts to save them — is to be considered at 8:30 a.m. in the Old Jail Building near Liberty and Sixth streets by the Louisville Landmark & Preservation Districts Commission.\nThe city will oppose the effort to landmark the site and has good grounds for doing so, said Jeff Mosley, the city's deputy director of Louisville Forward, the arm of Mayor Greg Fischer's administration that handles development issues.\nThe landmark designation would make the Omni project \"much more difficult. It could even stop it,\" said Mosley in an interview after a Parking Authority of River City board meeting. He is chairman of the PARC board and had updated his fellow board members on the status of the Omni project.\nA group called Neighborhood Planning & Preservation filed petitions with the city in September to designate a portion of the old Water Co. building as a landmark. When the petition was filed, the city stopped demolition of the structure, leaving intact the front portion of the building constructed in 1910.\nThat building on the east side of Third near Liberty is at a key location in the Omni development target area. The Omni development is to include a 600-suite hotel, about 200 high-end apartments, a 20,000-square-foot grocery, a parking garage, and retailing and event space.\nOmni has indicated it doesn't intend to incorporate the facade or other elements of the water company building into the development's design on the grounds that it would be cost prohibitive.\nThe landmark designation would mean the city would have to demonstrate economic hardship or that a health- or safety-related emergency existed before the site could be demolished.\nTHE COURIER-JOURNAL\nNew Omni plan dresses up Third Street look\nA variety of appeals and procedural alternatives are available if the landmark's designation is approved by the commission. Ultimately, the matter could go to Jefferson Circuit Court, where the issue could languish.\nMosley said that any landmark designation would be appealed.\nThe city has filed documents with the Landmarks Commission opposing the Water Co. building's designation as a landmark because:\nIt doesn't meet six of nine criteria for such status. The petition does not indicate necessary widespread community support for the landmark declaration. The petition was signed by more than 200 citizens. The building is not associated with any historical event or with any person of historic significance. The building doesn't represent any innovation in construction. The integrity of its setting has been lost; the city recently demolished several old nearby buildings. The filing of the petition represents \"an abuse, exploitation, and manipulation of the landmark process.\" The city further contended in the filings that the Omni project would be the best use of the site. It also noted that an agency called the Downtown Development Review Overlay Committee recently approved the design of the Omni project and, in the process, found that the Water Co. building's facade and front porch couldn't be \"appropriately readapted\" into the Omni project's design.\nMartina Kunnecke, a spokeswoman for the preservation group that filed the petition, said Wednesday that the organization is keeping all options open. She said that, if the landmark status is granted, it might serve as \"an opportunity, at last, for the community to be involved in conversations about what the community wants there (at the Third Street site), as opposed to what the mayor wants.\"\nKunnecke said she doesn't think that more hotel projects are what the city needs, adding that \"there are developers who know how to incorporate historic properties into projects.\"\nA decision of the Landmarks Commission can be appealed by almost anyone directly to Jefferson Circuit Court within 90 days of the commission’s final action.\nOr, a commission action can be reviewed by the Louisville Metro Council. The council can hold a public hearing and has the ability to uphold, modify or overturn the commission’s decision, as well as imposing conditions on any landmark designation.\nReporter Sheldon S. Shafer can be reached at (502) 582-7089, or via email at sshafer@courier-journal.com. Reporter Martha Elson contributed to this story.", "external_links": ["http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/ff06794825a23b1d6c3603d6521c78cc9b5373c9/c=604-0-2906-2302/local/-/media/2015/07/27/Louisville/B9318239026Z.1_20150727182301_000_GSBBFEAT7.1-0.jpg"], "published": "2015-10-15T00:28:00.000+03:00", "crawled": "2015-10-15T12:03:57.469+03:00", "highlightTitle": ""}