{"organizations": ["Small Business Administration", "U.S. Census Bureau", "Federal Emergency Management Agency", "PG&E", "FEMA", "Aon", "Cal Fire", "California Office of Emergency Services"], "uuid": "34971fe425b032ae73ee076c389e1f5f7afc020f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.uniondemocrat.com", "main_image": "", "site_section": "http://feeds.feedburner.com/UnionDemocrat", "section_title": "The Union Democrat, Sonora, CA News, Sports, & Weather", "url": "http://www.uniondemocrat.com/index.php?option=com_content&task=view&id=117952&Itemid=199", "country": "US", "title": "Total losses unknown in Butte Fire", "performance_score": 0, "site": "uniondemocrat.com", "participants_count": 0, "title_full": "Total losses unknown in Butte Fire", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T04:00:00.000+03:00", "replies_count": 0, "uuid": "34971fe425b032ae73ee076c389e1f5f7afc020f"}, "author": "", "url": "http://www.uniondemocrat.com/index.php?option=com_content&task=view&id=117952&Itemid=199", "ord_in_thread": 0, "title": "Total losses unknown in Butte Fire", "locations": ["California", "Jesus Maria Creek", "Mokelumne Hill", "Jesus Maria Road", "Amador County", "Calaveras River", "Charamuga Ranch", "South", "North", "Mokelumne River", "London", "Calaveras County"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Guy McCarthy", "Shirley Ryan", "Brian Moss", "Jesus Maria", "Ryan", "Aon Benfield"], "text": "Total losses unknown in Butte Fire Total losses unknown in Butte Fire By Guy McCarthy, The Union Democrat October 21, 2015 01:00 am Debris removal workers clear metal scraps and other waste Monday at a property on Jesus Maria Road outside Mokelumne Hill in the Butte Fire burn area. Guy McCarthy / Union Democrat, Copyright 2015. Six weeks after the Butte Fire broke out and three weeks after the blaze was declared contained, no local, state or federal agencies have estimated a dollar amount for how much property was lost. Aon Benfield, a multinational risk-management, insurance and reinsurance brokerage based in London, puts the total economic losses from the Butte Fire at $450 million, $225 million of which was covered by insurance. A Union Democrat analysis of the home losses showed damages of about $121 million. That is based on U.S. Census Bureau data for Calaveras County of the median value of owner-occupied housing and Cal Fire’s estimate of 475 homes destroyed. The number of homes lost has vacillated from 545 in late September to 475 by Oct. 1. On Tuesday, Calaveras County estimated 550 were destroyed. Brian Moss, the county’s assistant administrative officer, said the number changed because initial assessments were done by agencies outside Calaveras County, and some assessors had difficulty telling homes from outbuildings. None of these numbers take into account losses from businesses, agriculture, other private property, utility infrastructure, county property, roads, watershed damage or public lands. Aon says it bases estimates on public media sources including news websites, publications from insurance companies, financial institution press releases and government agencies. Other costs of fighting and cleaning up after the Butte Fire are climbing. Cal Fire’s last estimate for suppressing the Butte Fire was $70.5 million as of Sept. 28, three days before the burn area was declared 100 percent contained. Another state agency, the California Office of Emergency Services, estimated Oct. 1 the total cost for removing debris from all properties damaged or destroyed by the Butte Fire at slightly more than $22 million. Erosion control and other protective measures were estimated at $828,900. As of Tuesday, the Federal Emergency Management Agency had approved $8.3 million in individual assistance funding and the federal Small Business Administration had approved $6.5 million in loans to Butte Fire victims. Calaveras County in September approved a $10 million initial budget for the Butte Fire, said Shirley Ryan, the county’s administrative officer. Three-quarters of that cost was to be covered by FEMA, 18.75 percent was to come from California Disaster Assistance Act funding, and 6.25 percent was to come from county revenue, Ryan said. The Butte Fire broke out Sept. 9 near Charamuga Ranch in Amador County, jumped the Mokelumne River and raged into Calaveras County. It burned 110.7 square miles over the next week. The fire resulted in the deaths of two men. Pacific Gas and Electric officials said Sept. 16 a live tree may have contacted a PG&E line in the vicinity of the ignition point for the Butte Fire. Cal Fire has not released information on the cause of the blaze. This week, debris removal crews are at work on burned properties off Jesus Maria Road below Highway 26. Farther down Jesus Maria, steep, partially denuded slopes loom above Jesus Maria Creek. Red streaks are evident on some steep hillsides, showing where erosion tracks are beginning to form. A Post-Fire Emergency Watershed Team report released by state agencies notes that drainages in portions of the Mokelumne River and the North and South forks of the Calaveras River will be subject to increased flood risk for the next two to five years. Back up on higher ground, the road winds through ridgetop country where black bones of manzanita and other chaparral species still stand on the charred moonscape. Some oaks and evergreens retained their leaves through the fire, and they’re singed blond-brown. They look like ghost trees, pale with full foliage. Colors in some areas are limited to black, brown, red and burnt yellow. From one ridge looking north to Amador County, where the fire started, it’s obvious where the fire chewed out vast chunks of forest, leaving black, burned gullies aimed downhill. Someone has posted signs on vacated properties that burned, warning “Unlicensed Contractors Beware: It is a felony to contract without a valid California contractor license in this disaster area. www.cslb.ca.gov CheckTheLicenseFirst.com.” Farther out Jesus Maria and on upper Whiskey Slide Road, warning signs are more frequent as the roads wind through neighborhoods where more homes were destroyed. In spite of rains on the burn this past weekend, the smells of burned wood and other things that burned in the fire still linger. Follow UnionDemocrat.com", "external_links": [], "published": "2015-10-21T04:00:00.000+03:00", "crawled": "2015-10-22T08:31:25.585+03:00", "highlightTitle": ""}