{"organizations": [], "uuid": "8d7520c991109a6ed05f05ba40ca72233470d842", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tri-cityherald.com", "main_image": "http://www.tri-cityherald.com/news/local/bpbzo1/picture38795973/ALTERNATES/LANDSCAPE_1140/Community%20Care%20Fund", "site_section": "http://www.tri-cityherald.com/?widgetName=rssfeed&widgetContentId=28324093&getXmlFeed=true", "section_title": "Breaking News, Sports, Weather & More | Tri-CityHerald.com &", "url": "http://www.tri-cityherald.com/news/local/article38795865.html", "country": "US", "title": "Kennewick police fund spends thousands to help citizens in need", "performance_score": 0, "site": "tri-cityherald.com", "participants_count": 1, "title_full": "Kennewick police fund spends thousands to help citizens in need", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T08:05:00.000+03:00", "replies_count": 0, "uuid": "8d7520c991109a6ed05f05ba40ca72233470d842"}, "author": "Tyler Richardson \nTri-City Herald", "url": "http://www.tri-cityherald.com/news/local/article38795865.html", "ord_in_thread": 0, "title": "Kennewick police fund spends thousands to help citizens in need", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "October 11, 2015 Kennewick police fund spends thousands to help citizens in need Beth Striver, 15, second from right, stands with her mother Ann LaRocque, right, younger sister Bonnie Striver, 13, left, and boyfriend Gerald Baugher, 16, with her new longboard at the intersection of Fourth Street and Morain Street in Kennewick. Beth was hit by a car at the intersection last month, and funds from the Kenenwick Police Department’s Community Care fund bought the new longboard to replace the one that was crushed in the collision. Sarah Gordon Tri-City Herald i Order Reprint of this Story \nWhen a 4-year-old boy was run over by his father’s car last summer, Kennewick police were there to help pay for a funeral. \nWhen a girl was struck by a car while crossing the street last month, Kennewick police pitched in to buy her a new longboard to replace one that was crushed in the collision. \n“It was very emotional for me,” said Ann LaRocque, the girl’s mother, of when an officer told her of the offer. “I was actually at work and started crying.” \nThere are several examples during the past few months of Kennewick police stepping up to help citizens in need. The donations have all been a result of the police department’s new Community Care Fund, established earlier this year with the help of businesses and private donations. \n“The Community Care program allows our police officers who see an immediate need to help provide hope to others, which is core to community policing,” Chief Ken Hohenberg said in a news release. \nThe fund helps offset costs that previously fell on the officers every time they wanted to help someone, like a mother in need of a crib or a kid without shoes. \nThe fund was launched after $13,000 was collected. Money has continued to be donated from the community. \nIn July, an officer came across a mother and her two young kids, who were from out of town, sleeping in the bed of a pickup in a Walmart parking lot. The officer was able to get the family a hotel room at the Clover Island Inn for a night. \nA homeless man who didn’t have food was put up at the inn for a night in July and given breakfast. \nDuring August, police had five incidents where they used money from the fund, including donating $1,000 to the family of the 4-year-old, Ismael Martinez, for the funeral. \nAn officer discovered Aug. 24 a family of five had nowhere to live for three days as they waited for housing to open up. The family was able to stay at Clover Island Inn for three nights, and the officer purchased a car seat for one of the children. \nA few days after helping the homeless family, an officer did a welfare check on a single mother with three children, two of whom are disabled. The power had been shut off in their house. Police paid her outstanding bill to get the power back on. \nAnd at the end of August, police gave food and water to a mother and her 6-year-old child as they waited for a ride back home to Toppenish. \nThe longboard was purchased in early September for LaRocque’s daughter, a sophomore at Kennewick High School, and a little more than a week later, police found a family that was about to be evicted from their home. \n“I was very impressed they reached out,” LaRocque said, adding she’s had nothing but positive experiences with local police. \nOfficers went to the home Sept. 9 after a court order was issued notifying the family of six, including five young children, that they had to vacate immediately. The family was put up for a night at the Clover Inn. \nPolice have spent $2,592 since June providing assistance to those in need. \nDonations may be sent to the program at Kennewick Police Foundation, 8524 W. Gage Blvd. A-1, PO Box 311, Kennewick, WA 99336. Mark them for the Community Care Fund. They also may be made at www.kpdfoundation.org . \nTyler Richardson: 509-582-1556; trichardson@tricityherald.com ; Twitter: @Ty_richardson Related content", "external_links": [], "published": "2015-10-12T08:05:00.000+03:00", "crawled": "2015-10-12T15:53:12.933+03:00", "highlightTitle": ""}