{"organizations": ["AAA"], "uuid": "dbcbfc9f4b7a0a9e427561f1fe76b87a4aa1074b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxsports.com", "main_image": "http://a.fssta.com/content/dam/fsdigital/fscom/nascar/images/nascarsection/2015/10/04/100415-NASCAR-quest-continues-ahn-PI.vresize.1200.675.high.86.jpg", "site_section": "http://api.foxsports.com/v1/rss?partnerKey=zBaFxRyGKCfxBagJG9b8pqLyndmvo7UU&tag=motor", "section_title": "FOX Sports Digital", "url": "http://www.foxsports.com/nascar/story/jeff-gordon-hendrick-motorsports-chase-sprint-cup-dover-aaa-400-survive-advance-100415", "country": "IL", "title": "Survive and advance: Jeff Gordon does just that in AAA 400 at Dover", "performance_score": 0, "site": "foxsports.com", "participants_count": 0, "title_full": "Survive and advance: Jeff Gordon does just that in AAA 400 at Dover", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T01:47:00.000+03:00", "replies_count": 0, "uuid": "dbcbfc9f4b7a0a9e427561f1fe76b87a4aa1074b"}, "author": "", "url": "http://www.foxsports.com/nascar/story/jeff-gordon-hendrick-motorsports-chase-sprint-cup-dover-aaa-400-survive-advance-100415", "ord_in_thread": 0, "title": "Survive and advance: Jeff Gordon does just that in AAA 400 at Dover", "locations": ["Dover"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jeff Gordon"], "text": "FOXSPORTS Survive and advance: Jeff Gordon does just that in AAA 400 at Dover Jeff Gordon does exactly what he knew he needed to do entering Sunday's AAA 400 at Dover, finishing high enough to advance to the next round of the Chase for the Sprint Cup in his final season. \nJeff Gordon drove hard in his No. 24 Hendrick Motorsports Chevrolet at Dover. By Jay Pennell Oct 4, 2015 at 6:47p ET Dover, Del. 0Shares \nJeff Gordon's quest for a fifth NASCAR Sprint Cup Series championship will continue after the veteran Hendrick Motorsports driver did what he needed to do Sunday at Dover International Speedway. \nEntering the day 10th in the Chase standings with a 12-point buffer over the cutoff, Gordon ran inside the top 10 for much of the afternoon. When a host of cars came to pit road behind Gordon under the final caution, the driver of the No. 24 Chevrolet slipped back to 12th, where he ended the day. \nBy finishing just outside the top 10, Gordon ended the day with a narrow two-point advantage over the cutoff, securing a spot in the Contender Rounds of the Chase. \n\"It was a lot of hard work. I'm proud of these guys,\" Gordon told FOXSports.com after Sunday's AAA 400. \"We fought hard and that's what we've been doing all year long. It hasn't been pretty. We've had a lot to overcome and we never give. That was pretty much what he had today, we survived and made it through.\" \nThe Contender Round of the Chase kicks off next Saturday night at Charlotte Motor Speedway before moving to Kansas Speedway and the elimination race at Talladega Superspeedway. While he is confident about the team's chances at the mile-and-a-half tracks of Charlotte and Kansas, he understands Talladega is the true wild card in it all. \n\"I'm really excited about how we ran at Chicago, so that certainly gives us some confidence in the mile-and-a-half program that it's been improved,\" Gordon said. \"Hopefully that will show at the next mile-and-a-half. Obviously, we've got to survive Talladega now, so we'll see.\" \nAdvancing to the next round of the Chase, Gordon's hopes to contend for the Sprint Cup Series championship in his final full-time season continued on. However, Gordon is not letting the thoughts of another championship seep in just yet. \n\"It's just one round at a time. We've got to perform better than we did here,\" he said. \"I think we're consistent. We have a lot of fight in us. But we've got to perform a little bit better than where we are right now.\" 0", "external_links": [], "published": "2015-10-05T01:47:00.000+03:00", "crawled": "2015-10-05T07:32:55.060+03:00", "highlightTitle": ""}