{"organizations": [], "uuid": "827104beeb2585a9be8571eff48373c9a63b45e6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nydailynews.com", "main_image": "http://assets.nydailynews.com/polopoly_fs/1.2397305!/img/httpImage/image.jpg_gen/derivatives/landscape_1200/lamar-odom.jpg", "site_section": "http://www.nydailynews.com/sports/index.html", "section_title": "Sports News &amp; Articles: Today’s Latest Sports News - NY Daily News", "url": "http://www.nydailynews.com/new-york/queens/lamar-odom-basketball-mentors-queens-recall-youth-article-1.2397306", "country": "US", "title": "Lamar Odom's basketball mentors in Queens recall his youth", "performance_score": 0, "site": "nydailynews.com", "participants_count": 1, "title_full": "Lamar Odom's basketball mentors in Queens recall his youth - NY Daily News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "827104beeb2585a9be8571eff48373c9a63b45e6"}, "author": "NEW YORK DAILY NEWS", "url": "http://www.nydailynews.com/new-york/queens/lamar-odom-basketball-mentors-queens-recall-youth-article-1.2397306", "ord_in_thread": 0, "title": "Lamar Odom's basketball mentors in Queens recall his youth", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Debbie Egan-Chin/New York Daily News Michael Kertley (l.), 57, and Wayne Carter, 63, mentored Lamar Odom when he was growing up and playing basketball on the playgrounds in Queens. Debbie Egan-Chin/New York Daily News “He’s been a gym rat all his life,” recalled Michael Kertley, a local AAU coach who watched a 12-year-old Odom on the courts inside Lincoln Park. Debbie Egan-Chin/New York Daily News “He was a mentor to the young kids, that you could get out and be successful,” said Wayne Carter (r.). Previous Next Enlarge Lamar Odom was a Queens playground legend long before becoming a Hollywood reality show star.\nOld-timers in the ex-NBA player’s South Jamaica neighborhood remember the talented youngster’s love for the game long before he found the love of a Kardashian and pop culture notoriety.\n“He’s been a gym rat all his life,” recalled Michael Kertley, a local AAU coach who watched a 12-year-old Odom on the courts inside Lincoln Park.\n“As long as I’ve known him, he’s always been into basketball,” said Kertley, 57. “When he started to grow, that’s when we knew he was gonna be a player. We knew he was special.”\nOdom stood 6-foot-3 when he arrived as a freshman at Christ the King High School, but shot up a full six inches by his sophomore year.\nHe led the Royals to the city title in his second season, and served notice that he was among the nation’s top ballers.\nKevork Djansezian/Getty Images Lamar Odom (l.) stands next to Kobe Bryant of the Los Angeles Lakers while taking on the New Orleans Hornets in the 2011 NBA Playoffs. His coach compared Odom with future NBA Hall of Famer Scottie Pippen when the youngster was just 16 years old. Odom was also named the city’s Player of the Year by the Daily News.\nThe local roundball cogniscenti continued to follow Odom as he went to college at Rhode Island and onto the Los Angeles Clippers with the fourth pick in the 1999 draft.\n“He’s our homegrown guy,” Kertley said proudly. “He’s our local boy who made good. I was happy for him. It’s like seeing your little brother make it.”\nWayne Carter, 63, remembered watching from his home opposite the courts as Odom played in pickup games. The lanky left-hander was a hero to the local athletes looking to follow in Odom’s shoes.\n“He was a mentor to the young kids, that you could get out and be successful,” said Carter.\nView Gallery The life and career of Lamar Odom Both Carter and Kertley wonder if Odom’s fame — both on and off the court — was to blame for what became a decadent lifestyle.\n“With that limelight, life changes,” said Carter. “You weren’t born that way, but you adapt to it. It’s hard dealing with that lifestyle.”\nKertley was devastated to think the one-time playground prodigy was now fighting for his life in a Nevada hospital.\n“It breaks my heart that this happened to him,” said Kertley. “We know that it didn’t necessarily have to happen to him ... He ain’t done yet. It definitely is sad, and makes me want to cry sometimes.”\nlmcshane@nydailynews.com\nRelated Stories Lamar Odom had 'every drug imaginable' in his system: report Odom 'became irate' by ‘KUWTK’ episode about friend’s death Former NBA star Lamar Odom found unconscious at brothel", "external_links": [], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-14T23:13:26.732+03:00", "highlightTitle": ""}