{"organizations": [], "uuid": "5650ea7c6e91690424b7fd81beb967bc7f2d81b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "theolympicssports.com", "main_image": "", "site_section": "http://theolympicssports.com/feed/rss", "section_title": "The Olympics Sports", "url": "http://theolympicssports.com/other-sports/boxing-superstar-amir-khan-impressed-by-qatars-sporting-vision.html", "country": "US", "title": "Boxing superstar Amir Khan impressed by Qatar’s sporting vision", "performance_score": 0, "site": "theolympicssports.com", "participants_count": 1, "title_full": "Boxing superstar Amir Khan impressed by Qatar’s sporting vision", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T22:13:00.000+03:00", "replies_count": 0, "uuid": "5650ea7c6e91690424b7fd81beb967bc7f2d81b2"}, "author": "Abdul Rahim", "url": "http://theolympicssports.com/other-sports/boxing-superstar-amir-khan-impressed-by-qatars-sporting-vision.html", "ord_in_thread": 0, "title": "Boxing superstar Amir Khan impressed by Qatar’s sporting vision", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home » OTHER SPORTS » Boxing superstar Amir Khan impressed by Qatar’s sporting vision Boxing superstar Amir Khan impressed by Qatar’s sporting vision Posted on October 14,   OTHER SPORTS No Comments By Stephen Reid from Doha, Oct 13, 2015: Amir Khan, two-time former world champion and current holder of the WBC Silver welterweight belt, spent time with Dr. Thani Al Kuwari, Secretary General of the Qatar Olympic Committee, to discuss Qatar’s sporting vision, world-class sporting facilities and the opportunity to develop boxing further in Qatar and across the Middle East. Khan is in the country as a guest of the Qatar Boxing Federation and AIBA for the prestigious World Boxing Championships, but once the marquee event finishes on Thursday night, he will remain in Doha for further two-week long training camp. “I’m really enjoying my time here in Doha, and it was great to learn more about Qatar’s vision for sport. There are so many amazing facilities here all geared to help athletes achieved their best, and you can really feel the passion for sports wherever you go. Being ringside at the Worlds [Doha 2015 AIBA World Boxing Championships] has been a memorable experience in a truly world-class venue. The boxers competing here have had the perfect place to compete and prepare for the Olympics as every aspect is of the highest standard. I’d love to have a fight in Doha at some point, for sure, and I can’t wait to get into my training,” Khan said. Dr. Al Kuwari was delighted to spend some time with the British boxing sensation: “Amir Khan is a real gentleman and a great role model for young, aspiring boxers both here in Qatar and throughout the world. I’m pleased that he has taken Doha to his heart, and that he’s seen some of what Qatar has to offer as a world-class sporting, cultural and tourist destination. By hosting the AIBA Boxing World Championships in Qatar, passion for this noble sport has been ignited and hopefully Amir will return to compete here one day in the future. He will certainly be very welcome and we’ll do everything we can to make that happen.” \nRelated posts:", "external_links": [], "published": "2015-10-13T22:13:00.000+03:00", "crawled": "2015-10-14T04:19:10.338+03:00", "highlightTitle": ""}