{"organizations": [], "uuid": "35ea5156b6210096f40f5f7b8d66fa5f32384b90", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-5623c0f0/turbine/ct-ecn-algonquin-new-business-st-1019-20151016", "site_section": "http://www.chicagotribune.com/", "section_title": "Chicago Tribune: Chicago breaking news, sports, business, entertainment, weather and traffic - Chicago Tribune", "url": "http://www.chicagotribune.com/suburbs/elgin-courier-news/news/ct-ecn-algonquin-new-business-st-1019-20151016-story.html", "country": "US", "title": "Gordman&apos;s set to close, Art Van Furniture to open in its place Elgin Courier-News", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Gordman&apos;s set to close, Art Van Furniture to open in its place - Elgin Courier-News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T04:46:00.000+03:00", "replies_count": 0, "uuid": "35ea5156b6210096f40f5f7b8d66fa5f32384b90"}, "author": "Erin Sauder", "url": "http://www.chicagotribune.com/suburbs/elgin-courier-news/news/ct-ecn-algonquin-new-business-st-1019-20151016-story.html", "ord_in_thread": 0, "title": "Gordman&apos;s set to close, Art Van Furniture to open in its place Elgin Courier-News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Even as one store closes in Algonquin, another will open.\nGordman's, the discount apparel and home goods retailer at 1500 S. Randall Road, is in its last days.\nBut renovations will soon begin to make way for Art Van Furniture to open its 10th store in the Chicagoland area.\nIn a press release, Kim Yost, CEO of Art Van Furniture, said the company is eager for those in Chicago's northwest suburbs to experience its selection of affordable home furnishings and exceptional customer service.\n\"We look forward to working hand in hand with families at our new store in the Algonquin Commons lifestyle center to enhance their homes and their lives,\" he said.\nArt Van Furniture opens new flagship store in Downers Grove Graydon Megan Downers Grove seems an unlikely spot for a Michigan-based furniture chain to place their flagship store — and a furniture store seems an unikely stage for a celebrated star to perform — but both recently happened.\nThe store is Art Van Furniture's eighth in Illinois. The opening was celebrated recently...\nDowners Grove seems an unlikely spot for a Michigan-based furniture chain to place their flagship store — and a furniture store seems an unikely stage for a celebrated star to perform — but both recently happened.\nThe store is Art Van Furniture's eighth in Illinois. The opening was celebrated recently...\n(Graydon Megan) Renovations of the new Art Van Furniture store in is expected to take about six months, with a projected grand opening in May 2016.\nStore officials said the company will create 40 new full-time and part-time jobs.\nFounded in 1959, Art Van Furniture is family-owned and headquartered in Warren, Michigan. The company operates Chicago-area stores in Batavia, Bedford Park, Chicago's Logan Square, Downers Grove, Orland Park and Woodridge. The first franchise location in Rockford is set to open next month.\nGordman's opened in the village in 2011. For the past few weeks, the store has been holding a going out of business sale.\nErin Sauder is a freelance reporter for The Courier-News.\nCopyright © 2015, Elgin Courier-News", "external_links": ["http://www.trbimg.com/img-55bfdcff/turbine/ct-dgr-art-van-opens-downers-grove-tl-0806-2-20150803", "http://www.trbimg.com/img-5623c0f0/turbine/ct-ecn-algonquin-new-business-st-1019-20151016"], "published": "2015-10-17T04:46:00.000+03:00", "crawled": "2015-10-19T02:08:10.436+03:00", "highlightTitle": ""}