{"organizations": [], "uuid": "65500af6b5e6aae8101d3e40056c1f67cf565dcb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bellinghamherald.com", "main_image": "http://www.bellinghamherald.com/sports/high-school/prep-soccer/83yzkv/picture38881650/ALTERNATES/LANDSCAPE_1140/0918+GSOC+rup+251", "site_section": "http://www.bellinghamherald.com/sports/?widgetName=rssfeed&widgetContentId=712015&getXmlFeed=true", "section_title": "College & Professional Sports News, Scores & Photos | BellinghamHerald.com &", "url": "http://www.bellinghamherald.com/sports/high-school/prep-soccer/article38881656.html", "country": "US", "title": "Storm girls’ soccer can make case for best in state at all classifications", "performance_score": 0, "site": "bellinghamherald.com", "participants_count": 1, "title_full": "Storm girls’ soccer can make case for best in state at all classifications", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:40:00.000+03:00", "replies_count": 0, "uuid": "65500af6b5e6aae8101d3e40056c1f67cf565dcb"}, "author": "Joshua Hart \nThe Bellingham Herald", "url": "http://www.bellinghamherald.com/sports/high-school/prep-soccer/article38881656.html", "ord_in_thread": 0, "title": "Storm girls’ soccer can make case for best in state at all classifications", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Storm girls’ soccer can make case for best in state at all classifications \nSqualicum won a Class 2A state title last season but are even better this year \nThe Storm have the best goal differential in the state at plus-63 \nCamas, Kentridge, Capital, White River and Seattle Academy could also make claim of “best in state” Squalicum defeated Bellingham 4-0 in girls' soccer Thursday, Sept. 17, in Bellingham. Evan Abell The Bellingham Herald Squalicum’s Kim Hazlett scores the second of her three goals during a 4-0 victory over Bellingham on Thursday, Sept. 17, in Bellingham. Evan Abell The Bellingham Herald 1 of 2 Order Reprint of this Story \nThe Squalicum girls’ soccer team is the best team in Washington state. Not just at the Class 2A level — at all levels. \nWell, it’s up for debate but the Storm certainly can make that case — and Ferndale coach Joe Gonzalez hinted at making it days before the Storm topped Ferndale 6-0. \nSince coach David Kish won’t argue that his team is better than the best big schools, we’ll do it for him. \nWe’re a complete team from Rachel (Runnals) in goal, all through the backline and up to forward. Squalicum coach David Kish \nThe Storm have rolled through all 12 games this season, easily attaining the 12-0-0 mark, while racking up 65 goals and allowing two in the process — the last opponent to find the net, however, was Burlington-Edison in the first game of the season. \nThat’s 11 straight games where teams failed to get past the Storm defense. In that time, the Storm has scored 59 goals. \n“I think the benefit for us is we have hard-working players who are skilled,” Kish said in a phone interview. “We’re a complete team from Rachel (Runnals) in goal, all through the backline and up to forward.” \nSqualicum won a state title last year — the first in school history — and somehow this team is better, although Kish is wary to say so. \n“I’ve had a lot of fantastic players,” Kish said. \nWhile there are notable difference-makers that departed from last year’s team, the core has remained the same. \nLast year’s leading scorers Kim Hazlett and Kim Dorr are again near the top of the Northwest Conference scoring charts. Dorr ranks No. 1 with 20 goals and 11 assists while Hazlett ranks third with 20 goals and eight assists. Payton Fowler, a junior now, has racked up seven goals and eight assists. Braeden Hilleary is a dynamic player in the middle and has three goals and five assists, while Sarah hulbert and Catelyn Stevenson are other returners still making a big impact. \nBut the Storm also added weapons. Kendra Steele played for Bellingham two years ago and now with the Storm has six goals and seven assists. \nRachel Dorr returned from an ACL tear, which caused her to miss all of last season, to anchor the Squalicum defense. \nI think it’s a testament to their talents and what they brought to the program. Squalicum coach David Kish \n“Gary (Warman), the Sedro-Woolley coach, thinks we’re more balanced this year,” said Kish, noting that with the injury to Dorr last year, all-Northwest Conference midfielder Michelle Saunders was forced to play defense and everyone had to adjust to different positions. “Everyone playing in their natural positions has helped.” \nSo has the familiarity with one another. \nThis group of seven seniors, bolstered by Dorr and Hazlett, has been part of a program that is on track to play in the state semifinals all four of their high school seasons. \n“I think it’s a testament to their talents and what they brought to the program. In one year of having them part of our program, our goals doubles in one season and it’s been that high ever since,” Kish said. “At the same time, they’re good at not letting egos or even talent trump the idea that we’re all a team.” \nIn a loaded district where anything can happen, the Storm is no lock for its fourth straight trip to the state semifinals, but if the blue-and-silver can get through the Northwest District, it will certainly be battle-tested. \n“These district games are so much harder than even some of our state games. It’s loaded with talent,” Kish said. “I don’t think we would have won state (last year) if Burlington and Sehome and Bellingham hadn’t pushed us. They push us and we have to get better.” \nThat test comes Tuesday night at Civic Stadium for Storm, which face second-place Burlington-Edison, which boasts the NWC’s leading goalscorer Edie Breckenridge (24 goals). With how the Storm have played though, it’s hard to predict anything other than a blowout. \nWith the stars, the depth and the balance of attack, the Storm might just be the best high school soccer team in the state of Washington. \nBut here are five other teams that could also stake that claim: \nCamas (4A): At 10-0-1, the Papermakers only slipup was a 0-0 draw with a rival Union team. There isn’t a plethora of superb competition in the Greater St. Helens League, but Camas has scored 49 goals while allowing four. This is a team 10 years removed from a state title but with NCAA Division II commit Anyssa De Vera and all-region defender Mason Minder, the Papermakers have a strong case for best in the state. \nKentridge (4A): One of the few unblemished records in the state is a fairly strong case alone for the Chargers. Paired with a plus-37 goal differential, Kentridge might break its streak of four straight losses in the first round of the Class 4A State Tournament. Peyton Chick leads the Chargers with seven goals but this team likes to spread the ball around. \nCapital (3A): The Cougars haven’t made the state playoffs since 2010, but at 9-0-1 with a draw against Central Kitsap, the Olympian team looks strong this year. The Cougars boast a plus-47 goal differential and lead the 3A Narrows league so far this season. Senior Rachel Wofford is the leading goalscorer and the captain of a team eager to get into that 3A tourney. \nWhite River (2A): Ten wins, no losses, no ties. The Hornets may only boast a plus-26 goal differential but they’re an under-the-radar squad that could challenge for a spot in the state semifinals. They haven’t made state since 2010, but this is certainly one of those teams to keep an eye on this season. \nSeattle Academy (1A): Yes, it’s a 1A team but Seattle Academy is 11-0-0 while outscoring opponents 47-2. The Emerald City Conference is certainly no slouch and Academy is just four years removed from a state title and is a lock for the state tournament every year. Last year, Seattle Academy lost in the second round but Mireya Grey’s 18 goals and 12 assists have this team rolling. \nReach Joshua Hart at 360-715-2238 or joshua.hart@bellinghamherald.com . Related content", "external_links": [], "published": "2015-10-13T03:40:00.000+03:00", "crawled": "2015-10-13T07:42:28.746+03:00", "highlightTitle": ""}