{"organizations": [], "uuid": "4a9647f06d64f08315ce0c0b20a9864614c14f0b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.abqjournal.com", "main_image": "http://main.abqjournal.netdna-cdn.com/wp-content/plugins/journal-open-graph/img/albuquerque-journal.jpg", "site_section": "http://www.abqjournal.com/", "section_title": "Albuquerque and New Mexico News, Sports, Business and more | Albuquerque Journal News", "url": "http://www.abqjournal.com/657483/news/videos-shows-apd-drive-truck-into-fleeing-suspect.html", "country": "US", "title": "Video shows officer driving truck into fleeing suspect", "performance_score": 0, "site": "abqjournal.com", "participants_count": 13, "title_full": "Video shows officer driving truck into fleeing suspect | Albuquerque Journal News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T03:45:00.000+03:00", "replies_count": 17, "uuid": "e444d8c9c051bdf5cb1955ebe7969ebbd8aaa915"}, "author": "Ryan Boetel / Journal Staff Writer", "url": "http://www.abqjournal.com/657483/news/videos-shows-apd-drive-truck-into-fleeing-suspect.html#post-0", "ord_in_thread": 0, "title": "Video shows officer driving truck into fleeing suspect", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "http://www.abqjournal.com/wp-content/uploads/2015/10/IMG_3748.mp4\nAlbuquerque police released video Friday evening that shows an officer driving an unmarked truck onto a sidewalk and into a suspect who was running from police, and then officers repeatedly using a Taser on the suspect while he is on the ground.\nThe truck and Taser were used against Danan Gabaldon in the 8400 block of Camino San Martin SW on June 4 while officers were trying to take him into custody on suspicion that he drove a vehicle at police officers on at least two prior occasions. During the arrest attempt, an officer also shot at Gabaldon and missed, police said.\n“I hope that this video is viewed in its entirety,” said Celina Espinoza, a police spokeswoman. “Remember, Gabaldon was a violent suspect who had tried to run over an officer (previously) and a sergeant.”\nA video of the arrest was shot by a nearby construction worker. Police originally refused to release the video in response to an Inspection of Public Records Act request, saying that undercover officers could be seen throughout. On Friday, the video was released, but police blocked out images of the undercover officers.\nThe video shows Gabaldon sprinting from a group of officers wearing shorts, T-shirts and police vests who are yelling for him to stop. Shortly into the chase, an unmarked Nissan truck driven by a police officer is heard accelerating.\nThe construction worker moved the camera, and the truck can’t be seen running into Gabaldon. However, police did release that officer’s lapel camera footage on Friday, and it showed Gabaldon was hit by the front of the truck and that his head hit the hood.\nEspinoza said the officer was trying to cut in front of Gabaldon to stop him from fleeing, and accidentally struck him.\nAfter Gabaldon was knocked to the ground, the construction worker’s video shows police surrounding him and taking him into custody. The videos shows that police used a Taser on him multiple times. One officer appears to punch him with a Taser multiple times.\n“I’m sorry, I’m sorry, I’m sorry,” Gabaldon screams while being stunned.\nThe nearby construction workers are heard questioning the officers’ tactics.\n“He was running and they ran him down with a car. That is not OK,” one of the workers said.\nEspinoza said Gabaldon was resisting officers’ commands when they were using a Taser on him.\nPolice didn’t release the names of any of the officers involved in Gabaldon’s arrest. Espinoza said police haven’t completed their investigations into the incident. No officer has been disciplined or is currently on leave as a result of the incident.\nAlbuquerque police are putting in place a series of court-enforceable reforms after a Department of Justice investigation found the police had a pattern of excessive force and a culture of aggression. The DOJ’s findings letter mentioned the department’s use of Tasers on suspects.\nGabaldon is being held without bail on charges that include assault with intent to commit a violent felony on a police officer.", "external_links": ["http://main.abqjournal.netdna-cdn.com/wp-content/uploads/2015/10/IMG_3748.mp4?_=1", "https://www.youtube.com/embed/1ZduddlmTUs", "http://main.abqjournal.netdna-cdn.com/wp-content/uploads/2015/10/IMG_3748.mp4"], "published": "2015-10-10T03:45:00.000+03:00", "crawled": "2015-10-11T10:21:06.911+03:00", "highlightTitle": ""}