{"organizations": [], "uuid": "4ce522b402d910afe46eda7c63f680fec47cc317", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/2/9/161375/World/International/Slovenian-army-to-help-manage-migrant-flow.aspx", "country": "EG", "title": "Slovenian army to help 'manage' migrant flow - International - World", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Slovenian army to help 'manage' migrant flow - International - World - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "4ce522b402d910afe46eda7c63f680fec47cc317"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/2/9/161375/World/International/Slovenian-army-to-help-manage-migrant-flow.aspx", "ord_in_thread": 0, "title": "Slovenian army to help 'manage' migrant flow - International - World", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Slovenia blocks over 1,000 migrants at border Slovenia to slow migrant flow over fears of bottleneck Croatia says it has agreed plan on migrants with Slovenia Hungary to seal off border with Croatia from midnight Slovenian soldiers will help police manage a surge of migrants from Croatia, the government said Tuesday after an all-night emergency meeting.\n\"The inflow of migrants over the last three days has exceeded all manageable possibilities,\" a government statement said, adding that parliament would be asked to approve legislation allowing soldiers to help in the crisis \"under very specific circumstances\".\nUnder current law, the army can only provide technical and logistical support.\nHowever, \"this does not mean a state of emergency,\" Prime Minister Miro Cerar told journalists early Tuesday.\nMore than 8,000 people streamed into the tiny EU member state on Monday, of whom 2,000 continued on to neighbouring Austria, Ljubljana said.\nSlovenia has repeatedly warned that it cannot handle more than 2,500 migrants a day. It criticised Zagreb for lifting border restrictions at Croatia's frontier with Serbia on Monday night, allowing thousands of desperate people who had been stranded in wet and muddy conditions for hours to trek to Slovenia.\nHundreds of thousands of migrants -- many fleeing violence in Syria, Africa and Afghanistan -- have been making their way from Turkey to the Balkans in recent months, hoping to reach Germany, Sweden and other EU states.\nThey were forced to forge a new route to northern Europe after Hungary sealed its Croatian border with a razor-wire fence to migrants on Saturday, just weeks after it had shut its Serbian frontier.\nThe Hungarian government's latest move pushed the flow toward Slovenia, a nation of two million.\nState radio said parliament would debate the emergency legislation on Tuesday and that it could enter into force within days.", "external_links": [], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-20T14:18:39.991+03:00", "highlightTitle": ""}