{"organizations": ["Gayville FD Remember Fallen Kansas City Firefighter Gayville FD Remember Fallen Kansas City"], "uuid": "7650c566ce1646e40cf97a833835ecf6b3093276", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.keloland.com", "main_image": "http://www.keloland.com/_images/data/800x600/67873.jpg", "site_section": "http://www.keloland.com//_rss.cfm", "section_title": "KELOLAND.COM: News, Weather and Sports", "url": "http://www.keloland.com/newsdetail.cfm/gayville-fd-remember-fallen-kansas-city-firefighter/?id=186142", "country": "US", "title": "Gayville FD Remember Fallen Kansas City Firefighter", "performance_score": 0, "site": "keloland.com", "participants_count": 0, "title_full": "Gayville FD Remember Fallen Kansas City Firefighter", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T07:00:00.000+03:00", "replies_count": 0, "uuid": "7650c566ce1646e40cf97a833835ecf6b3093276"}, "author": "", "url": "http://www.keloland.com/newsdetail.cfm/gayville-fd-remember-fallen-kansas-city-firefighter/?id=186142", "ord_in_thread": 0, "title": "Gayville FD Remember Fallen Kansas City Firefighter", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hailey Higgins GAYVILLE"], "text": "Gayville FD Remember Fallen Kansas City Firefighter October 14, 2015, 10:00 PM by Hailey Higgins GAYVILLE, SD - \nThe firefighter brotherhood across the country is mourning the loss of two Kansas City men who died earlier this week. \nThe heartbreak ripples to South Dakota where a rural volunteer department remembers a good friend and family member. \nOutside Gayville's Fire Hall, the flag waves at half-staff in rural Yankton County. \nIt's honoring the life of 43-year-old Larry Leggio who was one of two men killed when a burning Kansas City building collapsed. \nThe 17-year veteran and John Mesh had just saved the lives of two people before a wall collapsed Monday night. \nLeggio is a relative of Gayville firefighter Brian Emmoch. Years ago, Leggio convinced Emmoch to pursue firefighting when they lived together. His wife called to tell him the news. \n\"She told me there had been a bad accident in Kansas City and that Larry didn't make it. My niece is a freshman at USD and we had to tell her that her uncle was in a fire and didn't make it through,\" Emmoch said. \n\"You ask why. They are such wonderful firefighters and human beings and it never gets answered,\" Gayville Firefighter Instructor David Rabe said. \nBecause of his close ties to Gayville, Leggio would often come to firefighter fundraisers. He'd often bring at least half a dozen men from Kansas City with him. \nGayville Fire and Rescue is making plans with other South Dakota fire departments to travel for the public memorial service on Saturday. \n\"They've sacrificed the ultimate and they are our heroes,\" Rabe said. \nA fund to support the families of Leggio and Mesh is available through IAFF Local 42. \nDonations can be made by check, payable to IAFF Local 42 and should be sent to 6320 Manchester Ave., Suite 42A; Kansas City, Mo. 64133. \nSympathy cards may also be mailed to the same address. The Associated Press contributed to this report. © 2015 KELOLAND TV. All Rights Reserved.", "external_links": [], "published": "2015-10-15T07:00:00.000+03:00", "crawled": "2015-10-15T06:26:33.423+03:00", "highlightTitle": ""}