{"organizations": [], "uuid": "c8574b11e3cab8a85e56f278365ac039ba8e0b57", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxsports.com", "main_image": "http://a.fssta.com/content/dam/fsdigital/fscom/mlb/images/2015/10/18/101815-MLB-Mets-Matt-Harvey-PI-CH.vresize.1200.675.high.9.jpg", "site_section": "http://api.foxsports.com/v1/rss?partnerKey=zBaFxRyGKCfxBagJG9b8pqLyndmvo7UU&tag=jabo", "section_title": "FOX Sports Digital", "url": "http://www.foxsports.com/mlb/just-a-bit-outside/story/mlb-postseason-umpires-missed-calls-strike-zone-balls-strikes-cubs-mets-nlcs-101915?cmpid=feed:-sports-CQ-RSS-Feed", "country": "", "title": "One bad strike is all it takes", "performance_score": 0, "site": "foxsports.com", "participants_count": 0, "title_full": "One bad strike is all it takes", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T17:00:00.000+03:00", "replies_count": 0, "uuid": "c8574b11e3cab8a85e56f278365ac039ba8e0b57"}, "author": "", "url": "http://www.foxsports.com/mlb/just-a-bit-outside/story/mlb-postseason-umpires-missed-calls-strike-zone-balls-strikes-cubs-mets-nlcs-101915?cmpid=feed:-sports-CQ-RSS-Feed", "ord_in_thread": 0, "title": "One bad strike is all it takes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Rob Neyer"], "text": "One bad strike is all it takes Rob Neyer @robneyer \nHow much difference can one erroneous ball/strike call make? Most of them don’t make much difference at all. But just one can make a huge difference, even if there’s rarely a good way to know one way or the other. \nBecause calling balls and strikes is tremendously difficult, and because most umpires are approximately as good as the rest of them. \nOf course everybody loves to complain about the umpires. If your team lost and the score was even semi-close, then by God it’s probably the umpire’s fault. If you believe my Twitter feed, anyway. \nStill, sometimes umpires do miss more than they should, and sometimes the bad calls don’t even out. So I’ve taken to looking at BrooksBaseball during games, just to get a sense of how things are going for the plate umpire. If you see red squares and triangles outside the zone, those were called strikes that probably should have been balls. If you see green squares and triangles inside the zone, those were balls that probably should have been strikes. And it’s usually the called strikes that get our attention, if only because there are more of those, as umpires’ effective strike zones seem bigger then the rule-book strike zone. \nLooking at the strike zones toward the end of Sunday night’s game, I was struck by just one pitch, a called strike against a left-handed hitter that looked, on the plot, far outside. So I wondered about that pitch: who was batting, how much difference it might have made in the at-bat, etc. And since I wasn’t watching closely enough to recall a called strike so far outside, and since BrooksBaseball didn’t yet have the game logs, I did this: According to PITCHf/x, Syndergaard got a called strike on a pitch that was way, way outside. Anybody remember who was batting? — robneyer (@robneyer) October 19, 2015 \nThe responses came quickly … and the funny thing was that so many people remembered different called strikes as being egregiously outside. Rizzo. Montero. La Stella. Coughlan. At least half the Cubs’ lineup was seemingly victimized. But if there was any consensus, it was this: @robneyer Schwarber, immediately before Bryant's 2B. Next pitch was a ball, which would have been a BB, then 2B puts men on 2nd/3rd, 1 out. — Ryan Pitts (@ryanpitts) October 19, 2015 \nI went back and watched on television. And going by TBS’s strike-zone graphic, that pitch certainly does look outside, by at least a couple of inches. Leading Ron Darling to say, “That’s the one thing that’s been in the favor of Syndergaard, is that he’s been getting that little extra room off the outside part of the plate from home-plate umpire Tim Timmons.” \nHere’s the funny thing, though: According to BrooksBaseball’s plot, that fourth pitch of the at-bat did actually clip the outside edge of the strike zone . Which serves as a useful reminder that 1) all these graphs are one-dimensional, unlike the real strike zone, and 2) the graph depends on which technician is calibrating the zone. TBS says it’s outside and PITCHf/x says it’s not, and you can believe whomever you like. But I think both charity and objectivity compel us to give the umpire the benefit of the doubt when it’s so obviously questionable. \nSo if not Schwarber in the sixth, then who? \nA few people said it was Chris Coghlan, leading off the fifth. Basically the same pitch as Schwarber’s: a bit outside but hardly egregrious . \nAh, but here’s a massive clue! Call helps #Mets Strike 1 should be ball 1 Top 4 Syndergaar vs Rizzo 0% call same 5.4in from edge pic.twitter.com/WsGCIJZpvu — Mets Strike Zone (@MetsUmp) October 19, 2015 \nPITCHf/x shows a terrible call, too! A first-pitch called strike that was well outside the zone! Well, except I’m actually going back and watching the actual game, and the first pitch was well outside and low, and called a ball. Syndergaard’s second pitch was the first strike, and sure seems to have been inside the strike zone. There was, in fact, not really a questionable call in Rizzo’s at-bat. \nWhich again points to the questionable utility of real-time analysis of the strike zone. And yet there are well-meaning people relying on this stuff and getting fans upset for no particularly good reason (except that some people sorta enjoy getting upset). \nSo according to publicly available PITCHf/x interpretation, there was one truly awful called strike in the entire game ... and that pitch, we learn, didn’t actually exist. Which means now we’re down to zero real problems, at least as far as I’ve been able to see. \nAt least if our metric is strikes that obviously should have been balls. \nOn the other hand, BrooksBaseball has a whole bunch of balls that should have been strikes! At least 10, and more if you think the umpire should call the “typical” strike zone instead of the one in the ol’ rulebook. \nDo we trust these graphs, though? I’d like to watch a game sometime, without any help from a strike-zone graphic, and count the pitches that seem poorly called to me , with the benefit of nothing other than my judgment and the knowledge that the typical camera angle is problematic. \nI love the graphics and I love BrooksBaseball and I love all the rest of it. But I do think maybe we’ve become just a little too quick to think we’re seeing the strike zone, in real time, better than the umpires are seeing it. Especially when we’re seeing the zone through biased eyes...", "external_links": [], "published": "2015-10-19T17:00:00.000+03:00", "crawled": "2015-10-19T17:28:15.466+03:00", "highlightTitle": ""}