{"organizations": [], "uuid": "0e509e9a19e1bc46a2d06a4852c7f1dd4126c405", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "accesswdun.com", "main_image": "http://bf19d0142b960c98204c-6849f9022b05f72b83236695aa4e9a0a.r50.cf2.rackcdn.com/uploads/articles/2015/341893/kyle-busch-10-12_p3.jpg", "site_section": "http://accesswdun.com/rss/3/rss.xml", "section_title": "AccessWDUN.com Sports", "url": "http://accesswdun.com/article/2015/10/341893/pit-road-tangle-ruins-charlotte-race-for-busch-larson", "country": "US", "title": "Pit road tangle ruins Charlotte race for Busch, Larson", "performance_score": 0, "site": "accesswdun.com", "participants_count": 1, "title_full": "Pit road tangle ruins Charlotte race for Busch, Larson", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T16:00:00.000+03:00", "replies_count": 0, "uuid": "0e509e9a19e1bc46a2d06a4852c7f1dd4126c405"}, "author": "Reid Spencer-NASCAR Wire Service", "url": "http://accesswdun.com/article/2015/10/341893/pit-road-tangle-ruins-charlotte-race-for-busch-larson", "ord_in_thread": 0, "title": "Pit road tangle ruins Charlotte race for Busch, Larson", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Monday October 12th, 2015 2:36PM Posted 8:00AM on Monday 12th October 2015 ( 6 hours ago ) Pit road tangle ruins Charlotte race for Busch, Larson +1 By Reid Spencer-NASCAR Wire Service Kyle Busch (18) saw his chances for a win Sunday at Charlotte Motor Speedway go away after tangling with Kyle Larson on pit road under caution. Busch would rebound to finish 20th, with Larson in 21st. Photo: Jared C. Tilton/Getty Images Related Articles NASCAR Results Joey Logano dominates for Charlotte Sprint Cup victory Rain pushes NASCAR Sprint Cup at Charlotte to Sunday A win at Charlotte would be “huge” to Jeff Gordon \nCONCORD, N.C. - It was a comedy of errors, but the mistakes were too costly to be funny. \nKyle Larson was running second, and Kyle Busch third, approaching pit road after NASCAR called the eighth caution of Sunday’s Bank of America 500 because of fluid on the track. \nBusch feinted toward pit road, as he often does in similar situations. But as Busch steered his No. 18 Toyota to the right of the commitment cone at the entrance to pit road, Larson suddenly turned his No. 42 Chevrolet into Busch’s path. \nBusch’s car sustained minor damage, and Larson’s spun on pit road, but both drivers drew commitment line violations that would send them to the back of the field for the subsequent restart on lap 201 of 334. \nNeither driver recovered from the incident, as their winning chances disappeared with the contact. Busch subsequently slid in oil in the high groove and further hurt his car during contact with the outside wall. \n“We stayed out there on that caution and Kyle faked like he was coming, and the 42 (Larson) in front of us, he was on the opposite end of the commitment cone and there was no way he was going to make it,” Busch’s crew chief, Adam Stevens, said after the race. \n“He (Larson) panicked. I don’t know what happened there, but them two came together. Then we were behind the eight ball at that point, but still going to have a good day, and the track had a little bit of oil on it, didn’t get cleaned up as well—which a lot of people were talking about on the radio. Kyle slipped in it and fenced it, and that’s what really did us in.” \nLarson said he got contradictory instructions on his radio. \n“They told me to do what everybody around me was doing, and the No. 22 (race winner Joey Logano) was staying out, so I was committed to staying out,” Larson said. “And as soon as I turned right to stay out they said ‘Pit, pit, pit.’ \n“I hung a left and Kyle (Busch) was there. I feel really terrible to ruin their day, and hopefully it didn’t hurt their chances of transferring through this round (of the Chase for the NASCAR Sprint Cup). I know they deserved a top-three finish for sure. I felt awful immediately and still do. I hate it.” \nBusch salvaged a 20th-place finish, but he’s 10 points out of eighth place, the position that will transfer from the Chase’s Contender Round to the Eliminator Round. \n“Just can’t say enough about my guys – all the work that they put into these things,” Busch said. “They don’t deserve to be put in these situations year in, year out, but we are for some reason. \n“But it’s tough, and we’re going to have to battle through with what we’ve got right now. I can’t say enough about what they did on pit road getting us back salvageable.” \nDale Earnhardt, Jr. Says ‘It Ain’t Over’ \nDale Earnhardt, Jr. said he lost count of how many times he hit the wall in Sunday’s Bank of America 500. \nThe first brush with the SAFER barrier came on lap 69, after contact from Carl Edwards’ Toyota. Earnhardt later hit the wall when his No. 88 Chevrolet slid through fluid in the top groove. \nUltimately, Earnhardt finished 28th, four laps down, and left Charlotte in 11th place in the standings, 19 points out of the last transfer position to the next round of the Chase, currently held by eighth-place Brad Keselowski. \n“We tried everything we could to get laps back, because we had a good enough car to run in the top 20,” Earnhardt said. “Even after smashing it into the fence after all them times, we still had okay speed. But we just couldn’t get an opportunity to get those laps back. Other guys had trouble. And it ain’t over. Don’t worry about that. \n“I mean, we don’t have to go to Talladega (Oct. 25) and be nervous like those guys that are going to have to play it safe. We can just go hard. So, we’ve got a great car that can win that race. We can go to Kansas (next Sunday) and run great. I like that track and don’t see why we can’t run great there and maybe win the race there. It ain’t over.” \nNo Job Security For Matt Kenseth? \nMatt Kenseth and his No. 20 Joe Gibbs Racing Toyota epitomized Murphy’s Law on Sunday. \nContact with Ryan Newman’s Chevrolet, a flat right front tire and several brushes with the wall eventually forced the 2003 series champion out of the race in 42nd place—with a huge mountain to climb in the next two weeks to return to championship eligibility. \nAmong Chase drivers, Kenseth is in last place (12th), 32 points out of the last transfer position. \n“If this is the best I can do, it’s amazing I have a job,” Kenseth cracked in one of his post-race interviews. Associated Categories : Sports , NASCAR News, Sprint Cup Associated Tags : nascar, motorsports, Auto Racing, Stock Car, Asphalt, Sprint Cup Series, Motorsports Live On WDUN, Chase for the Sprint Cup © Copyright 2015 AccessWDUN.com", "external_links": [], "published": "2015-10-12T16:00:00.000+03:00", "crawled": "2015-10-12T21:41:26.737+03:00", "highlightTitle": ""}