{"organizations": [], "uuid": "a5d9e9c645b85c245882c373456caf55545c71fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mb.com.ph", "main_image": "http://www.mb.com.ph/wp-content/uploads/2015/09/Pacman.jpg", "site_section": "http://www.mb.com.ph/category/sports/sports-news/", "section_title": "mb.com.ph | Philippine News | Archive | Sports News", "url": "http://www.mb.com.ph/pacquiaos-shoulder-almost-healed/", "country": "CA", "title": "Pacquiao’s shoulder almost healed", "performance_score": 0, "site": "mb.com.ph", "participants_count": 1, "title_full": "Pacquiao’s shoulder almost healed | mb.com.ph | Philippine News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "a5d9e9c645b85c245882c373456caf55545c71fd"}, "author": "AFP", "url": "http://www.mb.com.ph/pacquiaos-shoulder-almost-healed/", "ord_in_thread": 0, "title": "Pacquiao’s shoulder almost healed", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "by AFP\nOctober 13, 2015 (updated) Eight-division boxing champion Manny Pacquiao exercises after his morning run at Griffith Park in Los Angeles, California to reach his peak form with barely two weeks before fighting undefeated Floyd Mayweather Jr. on May 2 in Las Vegas (May 3 in Manila). (Nick Giongco)\nNew York, United States | AFP - Philippine boxing legend Manny Pacquiao announced in New York Monday that he was “80 to 90 percent healed” from a shoulder operation and expected to return to training within weeks.\nPacquiao had surgery on May 7 to repair a tear to his right rotator cuff sustained in a unanimous points defeat against American Floyd Mayweather in Las Vegas just a few days earlier.\nPacquiao announced last week he would likely retire next year after one last fight to focus on his career in politics, and is in talks with Mayweather and Britain’s Amir Khan on who will be his last opponent.\n“My shoulder is 80 to 90 percent healed and I believe I can start training in November or December. I can fight early next year. I can fight by March,” he told the Asia Society in New York, whose Asia Game Changer award he is to receive at the United Nations on Tuesday.\nPacquiao, a congressman since 2010, announced this week his bid for a senate seat in national elections to be held in May next year.\nAsked about the possibility of one day running for president, the 36-year-old boxer said, “Right now, I don’t have that in my mind.”\nUnder Philippine law, presidential candidates must be at least 40.\n“Becoming a president is not the plan of the man. It’s the plan of god. Who knows if he will become a president?” said the boxer, a born-again Christian.\nPacquiao turned professional when he was 16 years old and has won an unprecedented eight world titles in as many weight divisions.", "external_links": ["http://i.po.st/static/v3/post-widget.js#publisherKey=4qcr4d26tnrf260rqrda&retina=true"], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-14T19:26:17.500+03:00", "highlightTitle": ""}