{"organizations": [], "uuid": "ed3160a9f9710e578d7fbaf2e176ecbffdb5733b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtontimes.com", "main_image": "", "site_section": "http://www.washingtontimes.com/rss/headlines/sports/", "section_title": "www.washingtontimes.com stories: Sports", "url": "http://www.washingtontimes.com/news/2015/oct/7/ellington-ready-cardinals-have-offense-they-envisi/", "country": "US", "title": "Ellington ready, Cardinals have offense they envisioned", "performance_score": 0, "site": "washingtontimes.com", "participants_count": 1, "title_full": "Ellington ready, Cardinals have offense they envisioned", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:05:00.000+03:00", "replies_count": 0, "uuid": "ed3160a9f9710e578d7fbaf2e176ecbffdb5733b"}, "author": "BOB BAUM", "url": "http://www.washingtontimes.com/news/2015/oct/7/ellington-ready-cardinals-have-offense-they-envisi/", "ord_in_thread": 0, "title": "Ellington ready, Cardinals have offense they envisioned", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ellington ready, Cardinals have offense they envisioned By BOB BAUM -   \nTEMPE, Ariz. (AP) - Coach Bruce Arians says running back Andre Ellington “should be ready to go” Sunday at Detroit. \nIf so, the Arizona Cardinals will be close to the offense they envisioned before the season started. \nThe only possible exception is tight end Darren Fells, who didn’t practice on Wednesday with a hip injury. Jermaine Gresham has been getting significant playing time at that spot, too. \nEllington hasn’t played since the opener due to a sore knee. He was listed as limited in practice but said afterward, “I feel pretty good. I’ll be ready to go.” \nIn Ellington’s absence, veteran Chris Johnson got most of the playing time at running back. Johnson is fifth in the NFL in rushing with 302 yards, averaging 4.4 yards per attempt. \nQuarterback Carson Palmer was effusive in his praise of Johnson. \n“Chris is so good at putting his foot in the ground and getting north and staying skinny through holes,” Palmer said. “He plays with so much speed in his cuts. I think that’s one of his greatest assets. He’s a great protector, really, really smart. He picked up the offense as fast as anybody picked it up since I’ve been here.” \nEllington, Palmer said, “is a dual threat. He’s as good a receiver as he is a back. … He’s so quick and elusive and has breakaway speed.” \nThe third player in Arizona’s trio of backs is rookie David Johnson, who has 15 carries for 85 yards. He had a rough game in Sunday’s 24-22 home loss to St. Louis, fumbling the opening kickoff and dropping a touchdown pass. \nPalmer overthrew the open rookie on fourth-and-two at the Rams 43 late in the game. A completion would have set up an attempt for a game-winning field goal. \nPalmer said David Johnson ‘is like Chris and ‘Dre, but I think he’s got like 35 more pounds on them, so he’s a little bit more of a bruising back that can run north and south and run with his pads low.” \nAsked if it’s hard to play three running backs, Arians said, ‘No it’s not hard, because the young guy (David Johnson) sits down.” \nWhether that really will be the case remains to be seen. \nThe Cardinals had been the most effective team in the NFL in the red zone before going 1-for-5 against St. Louis. They were 2-of-11 on third downs. \nThe offensive line, with two new members, had some communication problems last week. Left guard Mike Iupati was back from surgery to repair a torn meniscus and right tackle Bobby Massie was suspended the first four games for violating the NFL substance-abuse policy. After being sacked once in the first three games, Palmer was sacked four times by the Rams and was hit after throwing on several more occasions.", "external_links": [], "published": "2015-10-08T03:05:00.000+03:00", "crawled": "2015-10-08T05:30:27.465+03:00", "highlightTitle": ""}