{"organizations": [], "uuid": "922d9be23f64974a8c6268bd006e7362a79b0c64", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattletimes.com", "main_image": "http://www.seattletimes.com/wp-content/themes/st_refresh/img/st-meta-facebook.png", "site_section": "http://www.seattletimes.com/sports/feed/", "section_title": "The Seattle Times » Sections » Sports", "url": "http://www.seattletimes.com/sports/sounders/portland-timbers-score-5-goals-in-mls-road-victory-over-los-angeles-galaxy/", "country": "US", "title": "Portland Timbers score 5 goals in MLS road victory over Los Angeles Galaxy", "performance_score": 0, "site": "seattletimes.com", "participants_count": 1, "title_full": "Portland Timbers score 5 goals in MLS road victory over Los Angeles Galaxy", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T06:48:00.000+03:00", "replies_count": 0, "uuid": "922d9be23f64974a8c6268bd006e7362a79b0c64"}, "author": "Seattle Times staff", "url": "http://www.seattletimes.com/sports/sounders/portland-timbers-score-5-goals-in-mls-road-victory-over-los-angeles-galaxy/", "ord_in_thread": 0, "title": "Portland Timbers score 5 goals in MLS road victory over Los Angeles Galaxy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Portland Timbers score 5 goals in MLS road victory over Los Angeles Galaxy Originally published October 18, 2015 at 8:48 pm Updated October 18, 2015 at 9:05 pm Fanendo Adi scored two second-half goals in the Portland Timbers’ 5-2 rout of the host Los Angeles Galaxy in Major League Soccer. By Seattle Times staff The Associated Press \nCARSON, Calif. – Fanendo Adi scored two second-half goals in the Portland Timbers’ 5-2 Major League Soccer victory over the Los Angeles Galaxy on Sunday. \nThe Timbers (14-11-8) scored all five goals in a 25-minute span in the second half and are fourth in the Western Conference standings, though they are tied in points with third-place Vancouver. \nThe Galaxy (14-10-9), which is second in the West, conceded the most goals at home since Sept. 12, 2009, in a 6-3 loss to FC Dallas. \nThe top six teams in each conference make the playoffs. FC Dallas has clinched the West title and Los Angeles and Vancouver also have secured playoff berths. Most Read Stories Unlimited Digital Access. $1 for 4 weeks. \nThus four teams are battling for the three remaining playoff spots in the West. \nVancouver and Portland have 50 points each and the Sounders have 48. Each of those three teams has one regular-season match remaining. \nSporting Kansas City has 48 points with two matches left and San Jose has 47 points with one match left. \nAdi tied the score at 1 in the 65th minute with a turnaround left-footed strike from the middle of the area. Three minutes later, he converted a penalty kick to give Portland the lead for good. \nRobbie Keane scored both goals for the Galaxy and has 19 this season. Other MLS matches \n• Mike Grella scored in seven seconds for the fastest goal in MLS history and the host New York Red Bulls beat the Philadelphia Union 4-1 to earn the top seed in the Eastern Conference playoffs. \nGrella raced to the ball and attacked the open lane after flat-footed midfielder Michael Lahoud allowed the initial backpass to roll past him. Tim Cahill scored the previous fastest goal, at eight seconds in the Red Bulls’ 3-0 victory over the Houston Dynamo on Oct. 20, 2013. \n• Chris Pontius scored in the 39th minute and D.C. United added three second-half goals to beat the visiting Chicago Fire 4-0. \nD.C. United moved into second place in the East, one point ahead of Columbus. Seattle Times staff", "external_links": [], "published": "2015-10-19T06:48:00.000+03:00", "crawled": "2015-10-19T07:07:10.205+03:00", "highlightTitle": ""}