{"organizations": [], "uuid": "9458ca80e6a626aa85d9f6d6ba8d3adfc7c67714", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.waynepost.com", "main_image": "http://www.waynepost.com/storyimage/NU/20151019/SPORTS/151019621/AR/0/AR-151019621.jpg", "site_section": "http://www.waynepost.com/sports?template=rss&mime=xml", "section_title": "Sports - Wayne Post", "url": "http://www.waynepost.com/article/20151019/SPORTS/151019621/2000/NEWS?rssfeed=true", "country": "US", "title": "Pucko's Perspective: Buffalo's dominant defense nowhere to be found", "performance_score": 0, "site": "waynepost.com", "participants_count": 1, "title_full": "Pucko's Perspective: Buffalo's dominant defense nowhere to be found", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:10:00.000+03:00", "replies_count": 0, "uuid": "9458ca80e6a626aa85d9f6d6ba8d3adfc7c67714"}, "author": "Bill Pucko", "url": "http://www.waynepost.com/article/20151019/SPORTS/151019621/2000/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "Pucko's Perspective: Buffalo's dominant defense nowhere to be found", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Oct. 19, 2015 at 7:10 PM Updated at 7:10 PM Posted Oct. 19, 2015 at 7:10 PM Canandaigua, N.Y. Daily Messenger sports editor Bob Chavez joins long-time columnist Bill Pucko to talk about the latest Buffalo Bills game. Bill: Don't those lopsided victories by the Buffalo Bills over Indianapolis and Miami seem a lifetime ago? The loss to the Bengals was difficult to watch. Increasingly the Bills are difficult to watch. There are more questions now than there were at the beginning of the season. What happened to that dominant defense? Does the fact that Mario Williams' name is hardly ever mentioned during the telecast mean anything? Can you manage an offense minus almost all of its impact players? Were we wrong to believe that 2015 was going to be different? Bob: I don't think we were wrong to think this season was going to be different. No one plans on injuries, especially to the level in which they've hit Buffalo this season. Still, that doesn't cover what's going on with the defensive side of the ball. Against New England, the Patriots were able to find soft spots against the Bills, but they do that to every team they play. On Sunday, the Bengals just made some big plays and got some fantastic catches. It's easy to think that maybe the Buffalo defense got complacent after so much was said about it but whatever is going on, it's not good. Bill: It was striking to me how familiar the loss to the Bengals was to the loss to New England. Buffalo took the opening kickoff and marched down the field on an 11-play, 80-yard drive that resulted in a touchdown, and then stopped Cincinnati three and out. And then came the penalties that resulted in a disastrous and continual lack of field position. The Bills had the ball six times in the first half and didn't begin with the ball outside their own 20. The Bengals on the other hand had their first four drive starts all outside their own 45, two began in Buffalo territory. Somehow Buffalo was only down 17-14 at the half. Bob: I'll be the optimist and say that while the Bills are still better than they have been, they've also learned how much more they have to improve. New England and Cincinnati are among the NFL's elite and the Bills, well, they're not. It takes more than talent to win in any sport and the Bills have yet to find the chemistry they need to make all their talent excel. Bill: Like they don't have enough problems to deal with on both sides of the line, special teams is absolutely killing them. Needless and careless penalties. CBS analyst Solomon Wilcots made a great point when he said, \"penalties are a selfish act.\" You have to coach selfish play out of that team. Danny Crossman is the special teams coach. Also, Cincinnati got 84 yards on four kick returns Sunday. Where have you gone Jordan Gay, the kickoff specialist who lost his job in a roster shuffle. Bob: As bad as that area has been, it's the penalties that are the root of all this evil. Winners find a way to get past setbacks but when a team has as many setbacks as the Bills are having, it's nearly impossible. I do like what Wilcots said because the type of penalties that the Bills are taking are indeed selfish. Forget all the other stats to come up with why the Bills can't get on track. It's penalties that are killing them, plain and simple. Bill: Right after the game the Bills flew to London for a game with Jacksonville. I'll bet that was fun. The Jags are technically the home team and the Bills are 2-0 on the road. Random stat. Buffalo has been fortunate to play weaker teams on the road so far (Dolphins, Titans and Jaguars). That should have been a recipe for success, but a 1-3 home record has killed the buzz big time. The early line on the game in London is Buffalo by four. What do you think Robert? Bob: The season certainly is not over for Buffalo, but it might be if it can't get past the Jags. Injuries are not, but then again they are, an excuse to some degree. And there's no question the offensive rhythm has been affected. But there is time for Buffalo to get it together and if they can put together a two-game win streak heading into the Nov. 12 game against the Jets, anything can happen. By Bill Pucko", "external_links": [], "published": "2015-10-20T03:10:00.000+03:00", "crawled": "2015-10-20T03:33:57.163+03:00", "highlightTitle": ""}