{"organizations": [], "uuid": "2c83b4ebcf8db4e83b9a834bbad0b80a26bdca76", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.idahostatesman.com", "main_image": "http://media.idahostatesman.com/smedia/2015/10/14/23/37/emZNY.AuSt.36.jpeg", "site_section": "http://www.idahostatesman.com/rss/sports", "section_title": "Idahostatesman.com -- Sports", "url": "http://www.idahostatesman.com/2015/10/14/4035760/bronco-beat-boise-state-linebacker.html", "country": "US", "title": "Bronco Beat: Boise State linebacker Tyler Gray learns two new positions to help Broncos’ D", "performance_score": 0, "site": "idahostatesman.com", "participants_count": 1, "title_full": "Bronco Beat: Boise State linebacker Tyler Gray learns two new positions to help Broncos’ D", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T08:36:00.000+03:00", "replies_count": 0, "uuid": "2c83b4ebcf8db4e83b9a834bbad0b80a26bdca76"}, "author": "ccripe@idahostatesman.com (Chadd Cripe)", "url": "http://www.idahostatesman.com/2015/10/14/4035760/bronco-beat-boise-state-linebacker.html", "ord_in_thread": 0, "title": "Bronco Beat: Boise State linebacker Tyler Gray learns two new positions to help Broncos’ D", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Order a reprint of this story \nHawaii running back Paul Harris is brought down by Boise State linebacker Tyler Gray during the first half of Boise State’s 55-0 victory Oct. 3 at Albertsons Stadium. OTTO KITSINGER — The Associated Press \nSenior linebacker Tyler Gray might be the most accomplished player on the Boise State football team who isn’t a starter. \nHe has started 12 games over the past three seasons, appeared in all 46 games over the past four seasons and produced 153 tackles, 11 pass breakups, three interceptions and four forced fumbles. \nIn recognition of all that, coaches have found two new ways to utilize Gray this season and increase his role. He has appeared at nickel in three-linebacker defensive sets and at stud end in some passing situations. \nGray also shares the weak-side linebacker job with junior Ben Weaver, as he has the past two seasons. Weaver leads the team with 33 tackles; Gray is fourth with 22. \nGray (6-foot-4, 232 pounds) recorded his second sack of the season last week against Colorado State. His versatility could factor into the game plan again Friday at Utah State (7 p.m., CBS Sports Network). \n“He’s a guy who continues to show up and make plays,” linebackers coach Andy Avalos said. “When things pop up and we need a guy, he’s usually the first guy we go to. He’s a long, athletic football player.” \nGray’s ability allows the defense to do what offenses have been doing for years — disguise the actual positions of the 11 guys on the field. \n“It’s about getting your best guys in the best positions,” Avalos said. “... We feel like he’s one of our better pass rushers. That’s why we try to get him in some of those situations where he can put that stuff to use. ... He deserves to be out there.” \nGray had played weak-side linebacker exclusively for three years. That puts him on the short, or boundary, side of the field. \nWhen he plays nickel, he moves to the field side. \nAnd when he plays stud, he becomes a defensive end on the boundary side (he hasn’t used a three-point stance yet, though). \n“Something that’s fun and challenging is just a completely different perspective at those different positions,” Gray said. “You kind of have to get a feel for what you’re doing. The game changes by position. Just getting used to it is the biggest challenge.” \nGray started seven games in 2013 before Weaver emerged as one of the Broncos’ best players and three games in 2014 while Weaver was trying to overcome an injury. He has started two this year in the three-linebacker grouping (Virginia, Colorado State). \nBut even when Gray is the backup, he plays a significant part of the game at weak-side linebacker. The Broncos list him as a co-starter. \n“I’m just trying to do anything I can to get more time on the field,” Gray said. “When they tell me, ‘Hey, you might be playing this position,’ I’m all about it.” \nToo many hits on Rypien \nCoaches have made it clear the last two weeks: The Broncos must protect true freshman quarterback Brett Rypien better. \nAt the the same time, they say the protection has been better than it appears and Rypien needs to improve the way he protects himself, too. \nRypien was hit six times in about 65 snaps last week against Colorado State. He was sacked once. \n“Some of those were big hits, but he delivers big plays,” offensive coordinator Eliah Drinkwitz said, “The No. 1 requirement of playing this position is toughness. Obviously we’d like for him not to get hit at all but this is football and this is a contact sport. We’re going to do a better job protecting him, that’s going to be a focus for everybody involved, but he’s going to have to do a better job moving in the pocket, sliding out of trouble. And then sometimes, hey, you’ve got to take one.” \nRypien certainly has proven that he’s willing and able to take a shot to deliver a key throw. Against Colorado State and Virginia, he faced a blitz where the opponent brought more defenders than the Broncos could block. \nHe tossed a 64-yard touchdown pass to Thomas Sperbeck against Virginia and a 35-yard fade to Chaz Anderson on an almost-blind throw against Colorado State. \n“They gambled,” Drinkwitz said, “and we made them pay.” \nSome of the protection breakdowns have been the result of third-and-long situations that allow defenses to rush without reservation. Some have been the result of 1-on-1 defeats of linemen or tailbacks by defenders. Others have come from mental or communication errors. \n“(Rypien) has been taking too many hits,” junior right tackle Mario Yakoo said. “They’re not getting sacks on him but we’ve got to finish. We’re letting him get hits because we’re not finishing our blocks or we’re having miscommunication or sliding someone to the wrong side or cutting people free. We’ve got to have better awareness and communicate better and make sure we pick it up and finish.” \nOffensive line coach Scott Huff said Virginia was particularly aggressive with its blitzes, choosing to expose the secondary for a chance at the big play. Colorado State also went after Rypien. \nAt times, Huff said, the Broncos have had enough players “on paper” to pick up the blitz but all it takes is one small mistake to allow pressure on the quarterback. \n“We’ve been pretty consistent the last few weeks,” Huff said. “We’ve got a lot of meat left on the bone. We’re capable of playing better than we have.” \nLike Drinkwitz, Huff is glad to see that Rypien has made defenses pay a steep price for attacking him. \n“What hurts you is when you miss on those opportunities,” Huff said, “because the quarterback is potentially taking a hit and we’re not getting anything for it. It doesn’t hurt as bad I’d guess (if the result is a big play). ‘The Natural,’ when he broke his bat at the end, he broke Wonder Boy for a foul ball. Let’s break Wonder Boy for a home run.” \nNot there yet \nBoise State defensive coordinator Marcel Yates said this week that he won’t consider his defense dominant unless the players can prove themselves over the course of the entire season. \n“When we are done with the season and we’re a top-10 defense. You won’t hear me say we’re dominant until then,” he said. “Every week, every opponent can humble you. ... Every week you have to be humble and hungry. Every opponent is different. They’re looking for a weakness in your defense and if they find it it can change around real quick. Dominance isn’t a game or a half a season. It’s a full season of playing that way.” \nThe Broncos are seventh nationally in scoring defense (12 points per game), fifth in total defense (259.5 yards per game), second in rushing defense (60.7 yards per game) and third in pass efficiency defense (88.71 rating). \nGet on the bus \nThe Broncos will bus to and from Logan, Utah. Players and coaches say they enjoy the break from air travel. \n“You’re a little bit more relaxed on the bus,” Gray said. “It’s just a little bit different experience for us. We’ve done it a couple times and everyone seemed to like it.” \nChadd Cripe is in his 14th season covering Boise State football for the Idaho Statesman. He also votes in The Associated Press Top 25. He can be reached at ccripe@idahostatesman.com.", "external_links": [], "published": "2015-10-15T08:36:00.000+03:00", "crawled": "2015-10-15T20:20:23.176+03:00", "highlightTitle": ""}