{"organizations": [], "uuid": "f50dc4be69eda7ec4a46c28891add074851c3781", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "wtop.com", "main_image": "", "site_section": "http://wtop.com/section/sports/feed/", "section_title": "WTOP » Sections » Sports", "url": "http://wtop.com/washington-redskins/2015/10/manziel-rg3-active-manuel-starts-for-bills-with-taylor-out/", "country": "US", "title": "NFL inactives: Andrew Luck back for Colts against Patriots", "performance_score": 0, "site": "wtop.com", "participants_count": 1, "title_full": "NFL inactives: Andrew Luck back for Colts against Patriots", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T02:50:00.000+03:00", "replies_count": 0, "uuid": "f50dc4be69eda7ec4a46c28891add074851c3781"}, "author": "wtopstaff", "url": "http://wtop.com/washington-redskins/2015/10/manziel-rg3-active-manuel-starts-for-bills-with-taylor-out/", "ord_in_thread": 0, "title": "NFL inactives: Andrew Luck back for Colts against Patriots", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By The Associated Press October 18, 2015 7:50 pm \nAfter missing two games in a row with an injured right shoulder, Colts quarterback Andrew Luck was active again. \nLuck was expected to start Sunday night against the visiting New England Patriots. \nNew England linebacker Dont’a Hightower, who had been listed as questionable with a rib injury, was inactive. \nHe is second on the team with 26 total tackles and is third with 2 1/2 sacks. \n___ \n___ \nNEW ENGLAND at INDIANAPOLIS \nPatriots: DL Trey Flowers, LB Dont’a Hightower, OL Ryan Wendell, DL Geneo Grissom, WR Aaron Dobson, DL Khyri Thornton, LB Rufus Johnson. \nColts: CB Shaun Prater, RB Josh Robinson, LB Nate Irving, OL Lance Louis, OL Denzelle Good, LB Bjoern Werner, DT Zach Kerr. \n___ \nCHICAGO AT DETROIT \nBears: CB Terrance Mitchell, S Antrel Rolle, RB Antone Smith, LB Shea McClellin, OG Nick Becton, OT Jermon Bushrod, DT Bruce Gaston. \nLions: S James Ihedigbo, RB Joique Bell, LB DeAndre Levy, OT Corey Robinson, TE Eric Ebron, TE Brandon Pettigrew, DT Haloti Ngata. \n___ \nKANSAS CITY AT MINNESOTA \nChiefs: QB Aaron Murray, CB Marcus Cooper, OT Jah Reid, WR Frankie Hammond Jr., TE Brian Parker, LB Josh Mauga, NT Dontari Poe. \nVikings: QB Taylor Heinicke, WR Charles Johnson, CB Jabari Price, C Nick Easton, TE Chase Ford, DE Justin Trattou, DE Everson Griffen, \n___ \nMIAMI AT TENNESSEE \nDolphins: CB Tony Lippett, LB Chris McCain, C Sam Brenner, OL Jeff Linkenbach, WR Matt Hazel, DT A.J. Francis, S Jonathan Dowling. \nTitans: QB Charlie Whitehurst, RB Terrance West, LB Avery Williamson, G Quinton Spain, TE Chase Coffman, DE Ropati Pitoitua, NT Sammie Hill. \n___ \nDENVER AT CLEVELAND \nBroncos: LB DeMarcus Ware, OL Ty Sambrailo, RB Juwan Thompson, QB Trevor Siemian, DL Darius Kilgo, CB Lorenzo Doss, OL Shelley Smith. \nBrowns: QB Austin Davis, WR Marlon Moore, DB Joe Haden, DB Tashaun Gipson, LB Craig Robertson, WR Dwayne Bowe, TE E.J. Bibbs. \n___ \nWASHINGTON AT N.Y. JETS \nRedskins: WR DeSean Jackson, CB DeAngelo Hall, CB Chris Culliver, RB Matt Jones, OT Trent Williams, C Kory Lichtensteiger, TE Jordan Reed. \nJets: QB Bryce Petty, WR Chris Owusu, CB Marcus Williams, S Jaiquawn Jarrett, OL Jarvis Harrison, OL Ben Ijalana, DE Stephen Bowen. \n___ \nARIZONA AT PITTSBURGH \nCardinals: QB Matt Barkley, WR JJ Nelson, LB Shaq Riddick, LB Alex Okafor, T DJ Humphries, G Earl Watford, NT Xavier Williams. \nSteelers: QB Ben Roethlisberger, S Will Allen, CB Cortez Allen, LB Ryan Shazier, OL Chris Hubbard, TE Jesse James, LB Jarvis Jones. \n___ \nTEXANS AT JAGUARS \nHouston: S Quintin Demps, LB Brian Peters, C Greg Mancz, OG Xavier Su’a-Filo, WR Nate Washington, OLB Jadeveon Clowney, DE Jeoffrey Pagan. \nJacksonville: RB T.J. Yeldon, WR Marqise Lee, RB Bernard Pierce, S James Sample, DE Chris Smith, CB Nick Marshall, OL Tyler Shatley. \n___ \nCINCINNATI AT BUFFALO \nBengals: WR Greg Little, WR Mario Alford, CB Leon Hall, TE C.J. Uzomah, DT Marcus Hardison, DT Pat Sims, DE Margus Hunt. \nBills: QB Tyrod Taylor, WR Percy Harvin, RB Karlos Williams, S Josh Bush, OL Gabe Ikard, WR Marcus Easley, DT Alex Carrington. \n___ \nCAROLINA at SEATTLE \nPanthers: S Dean Marlowe, RB Brandon Wegher, TE/FB Richie Brockel, LB A.J. Klein, T Daryl Williams, DE Jared Allen, WR Kevin Norwood. \nSeahawks: CB Tye Smith, CB Marcus Burley, LB Brock Coyle, LB Nick Moody, LB Bobby Wagner, DE Frank Clark, DT Jordan Hill. \n___ \nSAN DIEGO AT GREEN BAY \nChargers: WR Stevie Johnson, CB Craig Mager, ILB Manti Te’o, OLB Tourek Williams, C Chris Watt, G Orlando Franklin, T King Dunlap \nPackers: QB Brett Hundley, WR Davante Adams, S Morgan Burnett, RB Alonzo Harris, LB Nick Perry, G Lane Taylor, NT B.J. Raji \n___ \nBALTIMORE AT SAN FRANCISCO \nRavens: WRs Darren Waller and Breshad Perriman, CB Lardarius Webb, S Terrence Brooks, RB Raheem Mostert, C Ryan Jensen, DL Chris Canty. \n49ers: WR Bruce Ellington, RB Reggie Bush, LBs Gerald Hodges and Corey Lemonier, OL Ian Silberman, NT Mike Purcell. \n___ \nAP NFL website: www.pro32.ap.org and www.twitter.com/AP_NFL Topics:", "external_links": [], "published": "2015-10-19T02:50:00.000+03:00", "crawled": "2015-10-19T02:57:13.844+03:00", "highlightTitle": ""}