{"organizations": [], "uuid": "b6581b7785d1a713909895caa62295a461e614ed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mcall.com", "main_image": "http://www.trbimg.com/img-561410e5/turbine/mc-penn-state-football-indiana-20151006", "site_section": "http://www.mcall.com/sports/college/rss2.0.xml", "section_title": "College Sports - The Morning Call", "url": "http://www.mcall.com/sports/college/psu/mc-penn-state-football-indiana-20151006-story.html", "country": "US", "title": "Penn State hopeful for Saquon Barkley's return against Indiana", "performance_score": 0, "site": "mcall.com", "participants_count": 1, "title_full": "Penn State hopeful for Saquon Barkley's return against Indiana", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T21:17:00.000+03:00", "replies_count": 0, "uuid": "b6581b7785d1a713909895caa62295a461e614ed"}, "author": "Mark Wogenrich", "url": "http://www.mcall.com/sports/college/psu/mc-penn-state-football-indiana-20151006-story.html", "ord_in_thread": 0, "title": "Penn State hopeful for Saquon Barkley's return against Indiana", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Penn State hopeful for Saquon Barkley's return against Indiana Army at Penn State Abby Drey / TNS Penn State running back Saquon Barkley cheers on his teammates from the sideline against Army on Saturday. Penn State running back Saquon Barkley cheers on his teammates from the sideline against Army on Saturday. (Abby Drey / TNS) Mark Wogenrich Contact Reporter Of The Morning Call Penn State hopes to have freshman Saquon Barkley back against Indiana. \nPenn State coach James Franklin said he hopes to have Saquon Barkley back for Saturday's game against Indiana but would not commit fully to the freshman's return. \nBarkley, a Whitehall High graduate, missed last week's game against Army West Point with an apparent ankle injury. The Lions rushed for 108 yards in a 20-14 victory. \n\"Are we hopeful we're getting Saquon Barkley back?\" Yeah, we're hopeful,\" Franklin said at his weekly press conference. \"But we don't know that right now.\" \nDespite playing just 21/2 games, Barkley has been the most impressive player on Penn State's offense this season. He leads the Big Ten, and ranks fourth nationally, in yards per carry (8.9). He also ranks fourth in the conference in rushing yards per game (93.2). \nFranklin sounded less hopeful regarding fellow running back Akeel Lynch, though the coach didn't mention Lynch outright. Lynch was injured in the San Diego State game soon after Barkley and did not play against Army as well. \nPenn State played three redshirt freshmen backs against Army, with the group combining for 99 yards on 25 carries. When asked about Barkley, and whether his offense was too dependent on the freshman, Franklin said, \"That's all we have, is freshman [running backs]. I'm not sure what the other option is.\" \nLikewise, Indiana is dealing with backfield injuries as well. Quarterback Nate Sudfeld and running back Jordan Howard both left last week's Ohio State game with ankle injuries. Hoosiers coach Kevin Wilson wouldn't say whether either could play Saturday. \nHoward is off to a great start, averaging 141.8 yards per game, second only to the Buckeyes' Ezekiel Elliott in the Big Ten. Though he wouldn't discuss his own team's injuries, Franklin speculated that it would be difficult for Howard and Sudfeld to return. \n\"Both had ankle injuries similar to some of our guys who have not been able to play,\" Franklin said. \"We've got to prepare as if they're going to be there. … If they couldn't come back in the second half [against Ohio State], it's going to be challenging for them to come back this week.\" \nPENN STATE VS. INDIANA", "external_links": [], "published": "2015-10-06T21:17:00.000+03:00", "crawled": "2015-10-06T22:27:37.836+03:00", "highlightTitle": ""}