{"organizations": ["New Orleans Saints", "Mercedes-Benz Superdome", "Facebook Email Twitter Google", "Facebook Saints", "Tampa Bay Buccaneers", "LinkedIn Pinterest Saints"], "uuid": "8d50210a0f70b10739dfbb437e095526e15a7d7e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailyworld.com", "main_image": "http://www.gannett-cdn.com/-mm-/dd91cab7c966d9afac8d2c3217d66bedd36b3dc9/r=x1683&amp;c=3200x1680/http/cdn.tegna-tv.com/-mm-/26223fc7571bf8892a65ab17723a89bd9c4422b4/c=0-257-5063-3117/local/-/media/2015/09/27/WWL/WWL/635789517526156469-brees-USATSI-8822016-1-.jpg", "site_section": "http://rssfeeds.dailyworld.com/opelousas/sports", "section_title": "Opelousas - Sports", "url": "http://www.dailyworld.com/story/sports/college/lsu/2015/10/01/lsu-michigan-opposite-ends-football-world/73180410/", "country": "US", "title": "Saints last in league in making big plays and giving them up", "performance_score": 0, "site": "dailyworld.com", "participants_count": 0, "title_full": "Saints last in league in making big plays and giving them up", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T20:34:00.000+03:00", "replies_count": 0, "uuid": "8d50210a0f70b10739dfbb437e095526e15a7d7e"}, "author": "", "url": "http://www.dailyworld.com/story/sports/college/lsu/2015/10/01/lsu-michigan-opposite-ends-football-world/73180410/", "ord_in_thread": 0, "title": "Saints last in league in making big plays and giving them up", "locations": ["LA", "USA", "New Orleans"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Derick E. Hingle", "Lyons Yellin", "Derick E. Hingle-USA", "Drew Brees"], "text": "Facebook Email Twitter Google+ LinkedIn Pinterest Saints last in league in making big plays and giving them up For years, explosive plays have been a staple of the Saints offense. This season, they have been almost non-existent, Post to Facebook Saints last in league in making big plays and giving them up For years, explosive plays have been a staple of the Saints offense. This season, they have been almost non-existent, Check out this story on WWLTV.com: http://on.wwltv.com/1FICBLL Cancel Send A link has been sent to your friend's email address. Posted! A link has been posted to your Facebook feed. Join the Conversation To find out more about Facebook commenting please read the Conversation Guidelines and FAQs Saints last in league in making big plays and giving them up Lyons Yellin / WWL-TV Sports 12:34 p.m. CDT October 1, 2015 Sep 20, 2015; New Orleans, LA, USA; New Orleans Saints quarterback Drew Brees (9) before a game against the Tampa Bay Buccaneers at the Mercedes-Benz Superdome. Mandatory Credit: Derick E. Hingle-USA TODAY Sports (Photo: Derick E. Hingle, Derick E. Hingle-USA TODAY Sports) CONNECT 9 TWEET LINKEDIN COMMENT EMAIL MORE \nNEW ORLEANS -- For years, explosive plays have been a staple of the New Orleans Saints offense. However, through three games this season, all losses, those game-changing, field-flipping, momentum grabbers have been almost non-existent, leaving many to wonder if it’s by design, a result of this team’s personnel or simply a lack of execution. \nWell, we have now our answer. \nIn his Thursday morning teleconference, Saints head coach Sean Payton was unequivocal, saying the Saints lack of explosive plays is in fact not by design. He insisted they are, and will remain an integral part of the team’s offensive philosophy. \nExplosive plays are defined as runs of 10 yards or longer, or passes of 25 yards are longer. This season, the Saints, both offensively and defensively, rank last in explosive plays produced and allowed, according to SportingCharts.com \nIn 202 offensive snaps this year, New Orleans has just seven explosive plays (4 runs, 3 passes), while allowing a league-worst 21 explosive plays on defense for a minus-14 differential. By comparison, the 2-1 Oakland Raiders rank 31st with a minus-10 differential. \nForecast: 'Same Old Saints' group is back and that has Ralph angry \n“We just finished talking about those numbers specifically,” he said. “We’re putting up after three games that kind of thing. You’re gonna have to have more explosive plays because the odds of having these 10-, 12-play drives; I mean you have to be efficient at doing that, but there has to be the ability to -- and it doesn’t necessarily mean just in the passing game -- they come in the running game, as well.” \nPayton said it’s critical the Saints find a way to stretch the field in a manner that allows his playmakers to maximize their big-play potential \n“During the week we’re thinking about not only how do we get the ball down the field, but how do we get the (running) back down the field,” he said. “And there are a few different things that go into that. But hopefully we can get better in that area.” \nThe Saints are on pace to produce just 37 explosive plays, while, at his rate, the defense is slated to allow 112. That’s a minus-75 differential. \nBy comparison, last season, the New York Giants finished last in explosive-play differential at minus-41 (67 produced, 108 allowed). Meanwhile, the Saints ranked 20th at minus-16, producing 76 on offense (47 rush, 29 pass), while allowing 92 on defense. \nClearly New Orleans has to improve on both sides of the ball if it hopes to pick up its first win of the season against Dallas on Sunday night in the Mercedes-Benz Superdome. \nLuckily, the Cowboys offense hasn’t been much better than the Saints. Dallas has produced just 10 explosive plays. That’s understandable given that No. 1 wide receiver Dez Bryant and starting quarterback Tony Romo were lost to injuries in Weeks 1 and 2, respectively. Still, “Big D’s” D has been far stingier, allowing just 10, good for fifth-best in the NFL. \nWhile Payton understands the importance of explosive plays, the fact the Saints’ inability to produce or prevent them have only contributed to their winless start. There are frankly many other contributing factors, among them turnover differential, red zone efficiency and penalties. Payton, of course, realizes the importance of them all and that none of them has a quick fix. \n“It doesn’t come in a smoothie or a pill or anything like that,” he said. “I think the first step that we were just discussing is certain things that keep you from winning.” \nAnd so far, all of those “certain things” have. Read or Share this story: http://on.wwltv.com/1FICBLL TOP VIDEOS", "external_links": [], "published": "2015-10-01T20:34:00.000+03:00", "crawled": "2015-10-02T04:46:59.849+03:00", "highlightTitle": ""}