{"organizations": [], "uuid": "f8940dcfa1dbe4ab16fd04228889b65e58332584", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "kentuckysportsradio.com", "main_image": "http://kentuckysportsradio.com/wp-content/uploads/2015/08/WillieNBA-600x338.jpeg", "site_section": "http://kentuckysportsradio.com/comments/feed/", "section_title": "Comments for Kentucky Sports Radio", "url": "http://kentuckysportsradio.com/main/is-willie-cauley-stein-out-of-shape/", "country": "US", "title": "Comment on Is Willie Cauley-Stein Out of Shape? by Say What?", "performance_score": 0, "site": "kentuckysportsradio.com", "participants_count": 1, "title_full": "Comment on Is Willie Cauley-Stein Out of Shape? by Say What?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T01:35:00.000+03:00", "replies_count": 0, "uuid": "f8940dcfa1dbe4ab16fd04228889b65e58332584"}, "author": "Say What?", "url": "http://kentuckysportsradio.com/main/is-willie-cauley-stein-out-of-shape/", "ord_in_thread": 0, "title": "Comment on Is Willie Cauley-Stein Out of Shape? by Say What?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kentucky Sports Radio University of Kentucky Basketball, Football, and Recruiting news brought to you in the most ridiculous manner possible. Browse: Home / Main / Is Willie Cauley-Stein Out of Shape? \nAccording to James Ham of CSN, Willie Cauley-Stein showed up to Sacramento Kings’ camp out of shape. On the Coz and Bru show, Ham said “when you show up to camp and can’t run up and down the court without being so winded you have to pull yourself off the court, something is wrong.” \nNow, this doesn’t exactly sounds like Cauley-Stein, who is known for being uber-athletic and always hustling. Could he be out of shape? It’s possible. But, it could also be Cauley-Stein’s sickle cell trait disorder acting up. Just a reminder sickle cell trait does affect endurance and can make it hard for Cauley-Stein to breathe. \nLet’s hope it’s just a small battle with the trait and not being out of shape. As always, these things will play out and we’ll find out exactly what happened down the road. But, for the time being let’s all give Willie Trill some support as he starts his NBA career. Article written by Bobby Reagan One time representative of UK at SEC 3v3 basketball championships. Northern Yankee living the Kentucky dream. Follow me @uklefty22 7 responses to “Is Willie Cauley-Stein Out of Shape?” Ruppeat Offender October 5, 2015 at 6:04   \nWell, Bobby Reagan, since WCS himself said that he was getting winded after two trips uno the court and vowed never to come into training camp out of shape again – I’d say he was just out of shape. Tom Seaver October 5, 2015 at 6:05   \nWCS always hustles? That’s news. Gary Marcum October 5, 2015 at 6:07   \nOr it could be the fact that he’s getting dabbed out and posting pictures of him high AF on instagram lol Say What? October 5, 2015 at 6:35 pm | Permalink \nNot a single picture like that as far back as I looked, and certainly none since the draft. Go back to your crumbling empire of whores and weep upon the rubble. KingTut October 5, 2015 at 6:13   \nWell according to Boogie, he is sleeping a lot… lol fatbrat October 5, 2015 at 6:18   \nI suppose it may be a little of all the above. I have seen a lot of reports that WCS has been spending large amounts of time in the weight room trying to bulk up. He could be a little winded but it won’t take long to get in shape. John Ellis October 5, 2015 at 6:21   \nIt’s called an off-season for a reason. Post Comment - New and Improved (not really, it just works now)", "external_links": [], "published": "2015-10-06T01:35:00.000+03:00", "crawled": "2015-10-06T01:36:35.644+03:00", "highlightTitle": ""}