{"organizations": ["Notice of Default and Election"], "uuid": "eee883a4ca3d49db18a709e4d4a53dc11439528d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.uniondemocrat.com", "main_image": "", "site_section": "http://www.uniondemocrat.com/index2.php?option=com_marketplace&page=rss&Itemid=204", "section_title": "All Classifieds | Sonora / Tuolumne News, Sports, &amp; Weather, Angels Camp, Twain Harte, Jamestown | Union Democrat", "url": "http://www.uniondemocrat.com/index.php?option=com_marketplace&page=show_ad&catid=1768&adid=1390&Itemid=204", "country": "US", "title": "T.S. No.: 2013-04459-CA A.P.N.:046-320-1200", "performance_score": 0, "site": "uniondemocrat.com", "participants_count": 0, "title_full": "T.S. No.: 2013-04459-CA A.P.N.:046-320-1200", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T10:00:00.000+03:00", "replies_count": 0, "uuid": "eee883a4ca3d49db18a709e4d4a53dc11439528d"}, "author": "", "url": "http://www.uniondemocrat.com/index.php?option=com_marketplace&page=show_ad&catid=1768&adid=1390&Itemid=204", "ord_in_thread": 0, "title": "T.S. No.: 2013-04459-CA A.P.N.:046-320-1200", "locations": ["SONORA", "California", "Mi Wuk Village", "Sonora", "Tuolumne County", "Irvine"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["JULIE L ALONZO"], "text": "Property Address: 24510 State Highway 108, Mi Wuk Village, CA 95346 NOTICE OF TRUSTEE'S SALE PURSUANT TO CIVIL CODE 2923.3(a), THE SUMMARY OF INFORMATION REFERRED TO BELOW IS NOT ATTACHED TO THE RECORDED COPY OF THIS DOCUMENT BUT ONLY TO THE COPIES PROVIDED TO THE TRUSTOR. NOTE: THERE IS A SUMMARY OF THE INFORMATION IN THIS DOCUMENT ATTACHED IMPORTANT NOTICE TO PROPERTY OWNER: YOU ARE IN DEFAULT UNDER A DEED OF TRUST DATED 12/13/2007. UNLESS YOU TAKE ACTION TO PROTECT YOUR PROPERTY, IT MAY BE SOLD AT A PUBLIC SALE. IF YOU NEED AN EXPLANATION OF THE NATURE OF THE PROCEEDING AGAINST YOU, YOU SHOULD CONTACT A LAWYER. Trustor: JULIE L ALONZO, A MARRIED WOMAN AS HER SOLE AND SEPARATE PROPERTY Duly Appointed Trustee: Western Progressive, LLC Recorded 12/27/2007 as Instrument No. 2007020818 in book ---, page--- and of Official Records in the office of the Recorder of Tuolumne County, California, Date of Sale: 11/02/2015 at 03:30 PM Place of Sale: AT THE FRONT ENTRANCE TO THE ADMINISTRATION BUILDING AT THE COUNTY COURTHOUSE COMPLEX, 2 SOUTH GREEN STREET, SONORA, CA Estimated amount of unpaid balance and other charges: $ 378,495.40 NOTICE OF TRUSTEE'S SALE WILL SELL AT PUBLIC AUCTION TO HIGHEST BIDDER FOR CASH, CASHIERS CHECK DRAWN ON A STATE OR NATIONAL BANK, A CHECK DRAWN BY A STATE OR FEDERAL CREDIT UNION, OR A CHECK DRAWN BY A STATE OR FEDERAL SAVINGS AND LOAN ASSOCIATION, A SAVINGS ASSOCIATION OR SAVINGS BANK SPECIFIED IN SECTION 5102 OF THE FINANCIAL CODE AND AUTHORIZED TO DO BUSINESS IN THIS STATE: All right, title, and interest conveyed to and now held by the trustee in the hereinafter described property under and pursuant to a Deed of Trust described as: More fully described in said Deed of Trust. Street Address or other common designation of real property: 24510 State Highway 108, Mi Wuk Village, CA 95346 A.P.N.: 046-320-1200 The undersigned Trustee disclaims any liability for any incorrectness of the street address or other common designation, if any, shown above. The sale will be made, but without covenant or warranty, expressed or implied, regarding title, possession, or encumbrances, to pay the remaining principal sum of the note(s) secured by the Deed of Trust. The total amount of the unpaid balance of the obligation secured by the property to be sold and reasonable estimated costs, expenses and advances at the time of the initial publication of the Notice of Sale is: $ 378,495.40. If the Trustee is unable to convey title for any reason, the successful bidders sole and exclusive remedy shall be the return of monies paid to the Trustee, and the successful bidder shall have no further recourse. The beneficiary of the Deed of Trust has executed and delivered to the undersigned a written request to commence foreclosure, and the undersigned caused a Notice of Default and Election to Sell to be recorded in the county where the real property is located. NOTICE TO POTENTIAL BIDDERS: If you are considering bidding on this property lien, you should understand that there are risks involved in bidding at a trustee auction. You will be bidding on a lien, not on the property itself. Placing the highest bid at a trustee auction does not automatically entitle you to free and clear ownership of the property. You should also be aware that the lien being auctioned off may be a junior lien. If you are the highest bidder at the auction, you are or may be responsible for paying off all liens senior to the lien being auctioned off, before you can receive clear title to the property. You are encouraged to investigate the existence, priority, and size of outstanding liens that may exist on this property by contacting the county recorders office or a title insurance company, either of which may charge you a fee for this information. If you consult either of these resources, you should be aware that the same lender may hold more than one mortgage or deed of trust on this property. NOTICE OF TRUSTEE'S SALE Note: Because the Beneficiary reserves the right to bid less than the total debt owed, it is possible that at the time of the sale the opening bid may be less than the total debt NOTICE TO PROPERTY OWNER: The sale date shown on this notice of sale may be postponed one or more times by the mortgagee, beneficiary, trustee, or a court, pursuant to Section 2924g of the California Civil Code. The law requires that information about trustee sale postponements be made available to you and to the public, as a courtesy to those not present at the sale. If you wish to learn whether your sale date has been postponed, and, if applicable, the rescheduled time and date for the sale of this property, you may call (866)-960-8299 or visit this Internet Web site http://www.altisource.com/MortgageServices/DefaultManagement/TrusteeServices.aspx using the file number assigned to this case 2013-04459-CA. Information about postponements that are very short in duration or that occur close in time to the scheduled sale may not immediately be reflected in the telephone information or on the Internet Web site. The best way to verify postponement information is to attend the scheduled sale. Date: September 21, 2015 Western Progressive, LLC, as Trustee for beneficiary C/o 30 Corporate Park, Suite 450 Irvine, CA 92606 Automated Sale Information Line: (866) 960-8299 http://www.altisource.com/MortgageServices/DefaultManagement/TrusteeServices.aspx For Non-Automated Sale Information, call: (866) 240-3530 Trustee Sale Assistant WESTERN PROGRESSIVE, LLC MAY BE ACTING AS A DEBT COLLECTOR ATTEMPTING TO COLLECT A DEBT. ANY INFORMATION OBTAINED MAY BE USED FOR THAT PURPOSE. Publication Dates: October 7, 14, 21, 2015 The Union Democrat, Sonora, CA 95370", "external_links": [], "published": "2015-10-14T10:00:00.000+03:00", "crawled": "2015-10-14T02:32:12.176+03:00", "highlightTitle": ""}