{"organizations": [], "uuid": "f13dd0a77293ecff82ea3c3e5ad286e0a7c4e206", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kctv5.com", "main_image": "http://kctv.images.worldnow.com/images/9078878_G.jpg", "site_section": "http://kctv5.com//category/208603/sports?clienttype=rss", "section_title": "KCTV Kansas City - Sports", "url": "http://www.kctv5.com/story/30330863/iron-man-alex-gordon-gives-himself-a-bloody-nose", "country": "US", "title": "Iron Man Alex Gordon gives himself a bloody nose", "performance_score": 0, "site": "kctv5.com", "participants_count": 1, "title_full": "Iron Man Alex Gordon gives himself a bloody nose - KCTV5", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T23:53:00.000+03:00", "replies_count": 0, "uuid": "f13dd0a77293ecff82ea3c3e5ad286e0a7c4e206"}, "author": "DeAnn Smith, Digital Content Manager", "url": "http://www.kctv5.com/story/30330863/iron-man-alex-gordon-gives-himself-a-bloody-nose", "ord_in_thread": 0, "title": "Iron Man Alex Gordon gives himself a bloody nose", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "KANSAS CITY, MO (KCTV) - The Royals are battered and in some cases bloodied but ready to clinch a World Series berth before their screaming fans Friday night.\nBut when Alex Gordon glides into left field, he might have a swollen nose.\nThat's because he cracked a ball off his face during batting practice Thursday afternoon.\nAs Bob Seger's Against the Wind played, Gordon took one off the snoz when his first swing caused the ball to bounce off the batting cage and ricochet into his mouth.\nHe didn't crumble as he did on July 9 when he tore his groin muscle, but he clearly grimaced in pain and needed a moment to gather himself.\nAs blood trickled down Gordon's face, starting pitcher Yordano Ventura looked on in concern and a trainer hastened to his side.\nIt was the last swing he took in batting practice.\nOn Monday, first baseman Eric Hosmer fouled a ball off his mouth. He spit the blood out and kept playing.\nOn Wednesday, most of catcher Salvador Perez's pre-game questions were about his pain tolerance level. He admitted he was dizzy after taking a ball off the face on Tuesday.\n\"We tough. We are big guys, I think it's more easy to get hit than the little guys,\" he said.\nHe said he is often in pain, but no particular moment stands out as more painful than another.\n\"I'm young guy. Prepare myself every day, working with the trainer, cool tub, hot tub, a workout, and God, thank you, God, for keeping me healthy,\" Perez said.\nCopyright 2015 KCTV (Meredith Corp.) All rights reserved", "external_links": [], "published": "2015-10-22T23:53:00.000+03:00", "crawled": "2015-10-23T05:23:27.301+03:00", "highlightTitle": ""}