{"organizations": [], "uuid": "413f2857e0e495e11c2a92db5542dd860c02bb41", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/1/64/154859/Egypt/Politics-/Egyptian-prosecution-to-investigate-TV-host-over-p.aspx", "country": "EG", "title": "Egyptian prosecution to investigate TV host over porn discussion - Politics - Egypt", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 3, "title_full": "Egyptian prosecution to investigate TV host over porn discussion - Politics - Egypt - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 2, "uuid": "413f2857e0e495e11c2a92db5542dd860c02bb41"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/1/64/154859/Egypt/Politics-/Egyptian-prosecution-to-investigate-TV-host-over-p.aspx", "ord_in_thread": 0, "title": "Egyptian prosecution to investigate TV host over porn discussion - Politics - Egypt", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related 5-year blasphemy sentence upheld for Egyptian TV anchor Egypt’s court orders ban on porn websites Egypt to open investigations into porn star's pictures at Giza pyramids Egypt's prosecutor ordered Tuesday the investigation of TV host and actress Entsar after complaints were submitted accusing her of lewdness, debauchery, and blasphemy in the way she discussed porn on her show, which aired on Al-Qahira Wa El-Nas channel.\nThe prosecutor also ordered investigations into Entsar's co-host, actress Heidi Karam, along with businessman and owner of Al-Qahira Wa El-Nas channel, Tarek Nour.\nIn the three police reports filed, complaints said Entsar, who is known for her daring TV roles as an actress, \"called on her audience to watch pornography as it is very beneficial to educate youth before marriage.\"\nDuring the nightly show, Nafsana (roughly meaning rancour) that focuses on women and social issues that aired last week, Entsar said that she herself watches pornography, a statement that many criticised and ridiculed on social media.\nEntsar also said that sex education should be introduced in schools.\nA third host in the show, Hoda, opposed the opinions of Entsar and Karam, saying that porn should be banned.\nThe complaints called on the prosecutor general to promptly refer Entsar, Nour, and co-host Karam to criminal court, as the content of the show's episode \"would lead to the destruction of an entire generation, creating youth of unknown parentage with no principles or ethics.\"\nThe Cairo prosecution will investigate Entsar, Karam, and Nour. The prosecution can then decide to either file charges, referring them to court, or it could dismiss the complaints with no charges.\nIn May, an administrative court ordered that the prime minister take the necessary measures to censor pornography websites inside Egypt.\nThe court's decision was theoretically enforceable but no steps were taken to implement the ruling. The decision could still be appealed at the Supreme Administrative Court.", "external_links": [], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-14T00:46:24.724+03:00", "highlightTitle": ""}