{"organizations": [], "uuid": "41bc15d51228bacc26f43ac63b96c70e658fa65a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestar.com", "main_image": "http://www.thestar.com/content/dam/thestar/sports/football/2015/10/09/colts-andre-johnson-has-two-tds-in-return-to-houston/aj.jpg", "site_section": "http://www.thestar.com/sports/football.html", "section_title": "Football, CFL, and NFL News | Sports | Toronto Star", "url": "http://www.thestar.com/sports/football/2015/10/09/colts-andre-johnson-has-two-tds-in-return-to-houston.html", "country": "CA", "title": "Colts’ Andre Johnson has two TDs in return to Houston", "performance_score": 0, "site": "thestar.com", "participants_count": 1, "title_full": "Colts’ Andre Johnson has two TDs in return to Houston | Toronto Star", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "41bc15d51228bacc26f43ac63b96c70e658fa65a"}, "author": "Kristie Rieken", "url": "http://www.thestar.com/sports/football/2015/10/09/colts-andre-johnson-has-two-tds-in-return-to-houston.html", "ord_in_thread": 0, "title": "Colts’ Andre Johnson has two TDs in return to Houston", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON—Andre Johnson proved to his former team that he still has plenty left.\nJohnson caught two touchdown passes from Matt Hasselbeck, including one for two yards in the fourth quarter, to help the Indianapolis Colts beat the Houston Texans 27-20 on Thursday night.\nReleased by Houston in March after 12 seasons with the team, Johnson had six catches for 77 yards.\nThe Colts (3-2) extended their AFC South winning streak to an NFL-record 16 games.\nBrian Hoyer, who replaced Ryan Mallett for Houston (1-4) in the second quarter, threw a pass up for grabs that was intercepted by Mike Adams with less than two minutes left.\nThe 40-year-old Hasselbeck was filling in for Andrew Luck, who missed his second straight game with a shoulder injury. Hasselbeck may not have been 100 per cent, either, after missing practice Tuesday with an illness.\nJohnson extended the lead to 27-17 with the two-yard reception with about 10 ½ minutes left. The Texans intercepted Hasselbeck’s pass in the end zone earlier in that drive, but the play was negated because of defensive holding on Eddie Pleasant. A second penalty, this one for pass interference gave the Colts a first down at the one.\nMallett got the wind knocked out of him on an illegal hit midway through the second quarter and was replaced by Hoyer. Mallett looked to be OK soon after that, but coach Bill O’Brien stuck with Hoyer. He finished with 312 yards passing with two touchdowns. Both of the touchdowns were to rookie Jaelen Strong and they came on his first two NFL receptions.\nDeAndre Hopkins had 11 receptions for 169 yards for Houston.\nJohnson entered the game without a catch in the last two games after having just one such game in his entire career in Houston. The Colts made sure that wouldn’t happen again Thursday night, going to him early. He drew boos from the home crowd when he grabbed a 23-yard reception late in the first quarter. Two plays later, he scored his first touchdown of the season when he was wide open in the back of the end zone for a four-yard reception that made it 10-0.\nMore on thestar.com\nBuffalo Sabres' Jack Eichel scores goal in first game\nConnor McDavid’s talent brought him to NHL, but focus will keep him there", "external_links": ["http://static.freeskreen.com/publisher/52/freeskreen.min.js"], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-09T07:30:38.738+03:00", "highlightTitle": ""}