{"organizations": [], "uuid": "418c8b94e01226b5a3eb4c8816259beb1f93a769", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "nypost.com", "main_image": "https://thenypost.files.wordpress.com/2015/10/eli-manning.jpg", "site_section": "http://nypost.com/sports/feed/", "section_title": "| Sports | New York Post", "url": "http://nypost.com/2015/10/12/the-horrific-eli-manning-play-that-forced-him-to-be-giants-hero/", "country": "", "title": "The horrific Eli Manning play that forced him to be Giants’ hero", "performance_score": 0, "site": "nypost.com", "participants_count": 1, "title_full": "The horrific Eli Manning play that forced him to be Giants’ hero | New York Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T05:09:00.000+03:00", "replies_count": 0, "uuid": "418c8b94e01226b5a3eb4c8816259beb1f93a769"}, "author": "Mark Cannizzaro", "url": "http://nypost.com/2015/10/12/the-horrific-eli-manning-play-that-forced-him-to-be-giants-hero/", "ord_in_thread": 0, "title": "The horrific Eli Manning play that forced him to be Giants’ hero", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Giants got away with one Sunday night. They know it. The 49ers know it. You know it.\nYes, the Giants beat the 49ers 30-27 thanks to a dizzying fourth-quarter comeback at MetLife Stadium. And yes, after the two-game losing streak to start the season, they have sole possession of first place in the NFC East at 3-2.\nBut the Giants let a lesser team hang around far too long for comfort. The primary culprit was one play that took all of six seconds, and it nearly cost the Giants a game they could not afford to lose.\nThe play encapsulated everything that had been wrong with the Giants on this night — until they came to their senses and finally put away the 1-4 49ers.\nOne play. Six seconds.\nThat’s all it took for Eli Manning to give the 49ers more hope than they had any right to have in the first half when he made an impossibly poor decision while playing with house money.\nWith an end-of-the-half chip-shot field goal in his hip pocket, Manning, trying to force one into Odell Beckham Jr., threw an interception right into the arms of 49ers cornerback Tramaine Brock in the San Francisco end zone with five seconds remaining in the half.\nInstead of the Giants trotting into the halftime locker room with a comfortable 16-6 lead that should have been more, they trudged off the field leading 13-6 after breathing life into a 49ers team that came to New Jersey riding an ugly three-game losing streak — losses by a combined 107-28.\n“We knew they’d be a dangerous, dangerous team with nothing to lose and everything to gain,’’ coach Tom Coughlin said.\nThat’s exactly what the 49ers were, and the Manning INT merely fed the beast.\n“Just a bad throw,’’ Manning said. “I was a little late with the throw trying to get it in there and I just underthrew it. Bad decision. I’ve got to throw it away there.’’\nThe Manning pick was merely one play in a half in which he had played marvelously to that point, one play in a game in which he delivered one of the finest performances of his career, finishing 41-of-54 for 441 yards and three TDs, including the 12-yard game-winner he threw to Larry Donnell with 21 seconds remaining.\nBut that first-half gaffe was symptomatic of the one thing that has held the Giants back this season, kept them from being undefeated through five games, kept them from seizing control of a division that has been a hot mess this season.\n“We’ve got a saying: ‘So what? Now what?’ ’’ Donnell said, referring to mistakes like the one Manning made at the end of the first half.\n“This is a mature team,’’ running back Rashad Jennings said. “We don’t blink.’’\nEarlier in the game, the Giants — who are red-zone challenged on offense, having entered the game with four TDs on 13 trips inside the 20 — were making an art form of turning touchdowns into field goals.\nOn the Giants’ first offensive possession, Manning underthrew Beckham on a 49-yard catch-and-run that would have gone for a touchdown had he hit him in stride.\nInstead, the underthrow allowed 49ers cornerback Kenneth Acker to save the TD with a tackle. And four plays later, the Giants were forced to settle for a 22-yard Josh Brown field goal and a 3-3 tie.\nYes, it was early, but the Giants were already committing one of the worst sins in sports: Letting a lesser opponent hang around, giving it hope.\nThe Giants’ third possession was marred by a blatant drop by Dwayne Harris on third-and-four from the San Francisco 23 that led to the Giants settling for a 41-yard Brown field goal and a 13-3 lead at the time.\nThat set the stage for that final first-half possession, when Manning would become uncharacteristically greedy. It set the stage for that one play in six seconds that looked like it might change everything.\nAnd, if you don’t think it did, you did not see the 49ers giddily running off the field toward the halftime locker room like they’d just stole Coughlin’s lunch and you didn’t notice the life the 49ers offense had in the second half after looking dysfunctional in the first.\nJust like that, a game that belonged to the Giants for 29 minutes and 49 seconds of the first half was anyone’s game — a dangerous place to be against an opponent you’re supposed to handle with relative ease at home.\nAll it took was one play and six seconds threatening to sabotage the entire night for the Giants, who survived somewhat in spite of themselves.\nShare this: Facebook Twitter Google Whatsapp Email Filed under eli manning ,  new york giants", "external_links": [], "published": "2015-10-12T05:09:00.000+03:00", "crawled": "2015-10-12T09:19:54.350+03:00", "highlightTitle": ""}