{"organizations": [], "uuid": "7e975226efa5864b59bfa8d1228d0e3ed22d1176", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "http://www.youtube.com/watch?v=-tBEPJqQz-I", "site_section": "http://bostonherald.com/sports", "section_title": "Sports | Boston Herald", "url": "http://bostonherald.com/sports/high_school/hot_shots/2015/10/hot_shots_belmonts_jessie_blake_west_makes_a_splash", "country": "US", "title": "Hot shots: Belmont's Jessie Blake-West makes a splash", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "Hot shots: Belmont's Jessie Blake-West makes a splash | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "7e975226efa5864b59bfa8d1228d0e3ed22d1176"}, "author": "Dan Ventura", "url": "http://bostonherald.com/sports/high_school/hot_shots/2015/10/hot_shots_belmonts_jessie_blake_west_makes_a_splash", "ord_in_thread": 0, "title": "Hot shots: Belmont's Jessie Blake-West makes a splash", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BELMONT — Everett Crosscup wasn’t sure he had a future swim champion on his hands the first time Jessie Blake-West began training with his Belmont Aquatic Team nine years ago.\nWhat the now Belmont High girls swimming coach knew was that Blake-West would do whatever it took to get there.\n“She was not a fast swimmer when she started,” said Crosscup. “But she developed into one through hard work, commitment and dedication to the sport of swimming. She always paid attention to details. I like to use the John Wooden saying that little things make the big things happen.”\nBig things happened to Blake-West in her junior year. She turned the 2014 Division 2 state championships into her own personal showcase, winning the 200-yard individual medley (2:08.26) and the 100-yard butterfly (56.28) as well as the 200 medley relay (1:52.01).\nBlake-West’s ability to excel at several events was a testament to her ultimate labor of love.\n“It started with a small commitment, but it’s grown to 16 hours a week,” said Blake-West. “It’s tough, I definitely have my moments where I’d rather be hanging out with my friends, but, all in all, I love swimming.”\nThe highlight of that meet came in the 100-yard butterfly. Blake-West’s winning time broke a meet record set by Brockton’s Virginia Burns (now swimming at Penn). She knew she swam a special race, but never gave the record any thought until later.\n“I try to go out and swim my best race more than swimming for a best time,” Blake-West said. “When they told me I broke the record, I was ecstatic. It’s always a goal, but I wasn’t sure I could do it.”\nIf Blake-West had to set a new standard, she was thrilled it came in the 100 butterfly. While she loves the competition of any event, the butterfly holds a special spot in her heart.\n“It’s my favorite event because I love sprinting and the fast pace,” she said. “I’m always looking to improve in the other race, but the butterfly is my strength.”\nThat intensity carries over into the classroom. An excellent student, Blake-West is a two-time member of the USA Swimming Scholastic All-America Team. A highly sought-after recruit ranked fifth in the state by CollegeSwimming.com, Blake-West verbally committed to Brown.\n“It was the perfect balance of academics and swimming,” she said. “I love the coaches, the team and I really loved the rigorous academic load.”\nBefore Blake-West heads to Brown, there is one last run at Div. 2 state glory, a date you know she has penciled into her calendar.\nDo you have a similar story in your community? Let us know at dventura@bostonherald.com or by emailing a Hot Shots-worthy video (max. 25 megabytes) to hotshots@heraldinteractive.com.", "external_links": [], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-15T11:30:31.674+03:00", "highlightTitle": ""}