{"organizations": ["Levonta Taylor", "Bayside Marlins", "Marlins", "Beach District", "Ocean Lakes Dolphins", "Dolphins", "Cox", "USA Today", "Bayside Matthew Hatfield VirginiaPreps.com Senior Writer Dolphins Down Marlins"], "uuid": "7e7a332fa83442e54c12e7d74777386b5f413dd3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "virginiapreps.rivals.com", "main_image": "", "site_section": "http://www.rivals.com/rss2feed.asp?type=HS&state=VA", "section_title": "Virginia High School Sports Headlines", "url": "https://virginiapreps.rivals.com/content.asp?CID=1817887", "country": "US", "title": "Ocean Lakes Cruises 58-6 at Bayside", "performance_score": 0, "site": "rivals.com", "participants_count": 0, "title_full": "Ocean Lakes Cruises 58-6 at Bayside", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T23:01:00.000+02:00", "replies_count": 0, "uuid": "7e7a332fa83442e54c12e7d74777386b5f413dd3"}, "author": "", "url": "https://virginiapreps.rivals.com/content.asp?CID=1817887", "ord_in_thread": 0, "title": "Ocean Lakes Cruises 58-6 at Bayside", "locations": ["Ocean Lakes", "Landstown", "Bayside", "Virginia Beach", "Bayside Ocean"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tahj Capehart", "Jermaine", "James Hamer", "Capehart", "Khalan Laborn", "Mitchell", "Chris Scott", "Teradja Mitchell", "Scott", "Tyree Dozier", "Laborn"], "text": "Ocean Lakes Cruises 58-6 at Bayside Matthew Hatfield VirginiaPreps.com Senior Writer Dolphins Down Marlins 58-6: A litany of big plays, including six touchdowns measuring 40 yards or longer, sparked the Ocean Lakes Dolphins to another dominant performance as they spoiled Homecoming for the Bayside Marlins on Saturday afternoon in Virginia Beach, 58-6 to remain unbeaten. On the year, the Dolphins have now outscored foes 447-38. Ocean Lakes has now won 23 consecutive games dating back to last season and ran their winning streak against Beach District opponents during the regular season to 39. The visitors opened with a bang, thanks to junior Khalan Laborn . Rated a four-star recruit and #34 overall in the country by Rivals.com, Laborn took the opening kickoff 90 yards for a touchdown on a day where he scored three times and racked up 308 all-purpose yards. Over the next 22 minutes, however, the Dolphins found the end zone just once. Bayside's defense held them to a 35-yard field goal by James Hamer on one occasion, sophomore linebacker Teradja Mitchell forced a fumble recovered by Tyree Dozier , and the Marlins stopped them on fourth-and-2. \"Guys answered the call today and I think we're moving in the right direction,\" said Ocean Lakes Head Football Coach Chris Scott after a win over a 6-2 Bayside squad he called, \"very good,\" afterwards. \"They've got some athletes back there that can fly around. [ Teradja ] Mitchell made some big plays. He's one of the top players and linebackers in the country. When you get a big boy running forward, we got a couple first downs, and then he stopped us. You want to see really who we are and they helped us competition-wise.\" But outside of those few stands in the first half by the Bayside defense, the Ocean Lakes offense did practically whatever it wanted in racking up a whopping 545 total yards. Helping the defending Group 6A State Champions stretch their lead out to 23 before half-time was junior wide receiver Tahj Capehart . The Class of 2017 prospect with over a dozen scholarship offers scored on a 13-yard run early in the second quarter and a 75-yard reception with 57 seconds before intermission. \"We knew we haven't had too many obstacles this season, except Salem. So we wanted to come out here and show we can compete with anybody,\" Capehart stated. \"I was excited we threw the ball around today. With them keying in on Khalan , Jermaine [ Trotman ] and Vonta ( Levonta Taylor ), I definitely felt like I had to go out there and show what I can do. Coach told me I had to go put on a big show and I'm glad I proved him right.\" It was a balanced attack for the Dolphins with 258 yards passing on seven completions as well as running the ball for 287 yards on 36 attempts. Ranked #8 in the country by USA Today , Ocean Lakes is now 8-0 and will close out the regular season against Cox (6-2) and Landstown (3-5). Trying to get to the 6A title game for the third time in four years, the Dolphins want to be sharp heading into November, and hopefully, December. \"We've got to establish that line up front because it's going to be a cold winter. We always want to be sharp there, understanding where we are and what we do,\" Scott said. \"After up front, which obviously is most important, some of these pre-snap penalties. That's a lack of discipline and we've got to take that on coaches if we're not subbing the right away or rotating them out. That really hurt us in 2012. We had three illegal procedure penalties driving on L.C. Bird. That set us back and we came up six inches short.\" Team Scoring Play (Ocean Lakes at Bayside) Game Score", "external_links": [], "published": "2015-10-25T23:01:00.000+02:00", "crawled": "2015-10-25T22:47:55.133+02:00", "highlightTitle": ""}