{"organizations": [], "uuid": "0c80e8ba0030a9fb6c6ece4d64916e9765b966b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/nation/navy-pitches-for-women-pilots-but-no-combat-role-yet/145893.html", "country": "US", "title": "Navy pitches for women pilots but no combat role yet", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "Navy pitches for women pilots but no combat role yet", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "0c80e8ba0030a9fb6c6ece4d64916e9765b966b6"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/nation/navy-pitches-for-women-pilots-but-no-combat-role-yet/145893.html", "ord_in_thread": 0, "title": "Navy pitches for women pilots but no combat role yet", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New Delhi, October 14 The Indian Navy today ruled out combat role for women for the time being citing government rules but has pitched for inducting them as pilots for its fleet of maritime reconnaissance aircraft. Navy Chief Admiral RK Dhowan said the force was proud of its women officers and that their induction started in 1992. He pointed out that women serve in the Navy in various fields — from air traffic controllers to observers on board aircraft, training, legal and even overseeing various aspects relating to construction of ships among others. “Therefore, it would be unfair to say we are lagging behind anybody,\" he said addressing a press conference on the International Fleet Review scheduled in February next year in Visakhapatnam. He was asked if the Navy has any plans to induct women in combat roles as many of the Navies coming in for the International Fleet Review will have women officers onboard their ships. He said the Navy has looked into how to increase the participation of women in other arenas of Naval way of life. “We are looking and we have taken up the issue to the Ministry of Defence as a proposal which is still under consideration to see how women pilots can be allowed in our maritime reconnaissance aircraft. That is something which is under consideration. The government will have to take a view,\" he said. Defence sources said this is being pushed forward because the aircraft flies from a land base and also lands back to the land base only. “As far as aspect related to combat are concerned, this is in consonance to the policy of the Government of India, the policy of MoD, as is applicable to three Services. As and when we look at the aspect of changes that come about, we will proceed step by step,” he said. In a major policy shift, the Indian Air Force had last week announced that it is planning to induct women as fighter pilots. Till now, all the three Services were cold to the idea of having women in combat rules because of various reasons including safety, extreme living conditions and lack of proper facilities. The Navy currently has about 9,000 officers, including about 500 women officers. Defence sources said the idea of having women in combat role in the Navy would take some time as it demands changes in the interior layout of battle platforms like separate toilets and bathrooms, bunks and rooms for women. “I can assure you that our women officers will have a major role to play in the International Fleet Review and we look forward to their showcasing our Navy with pride,\" Dhowan said. — PTI", "external_links": [], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-14T15:08:02.760+03:00", "highlightTitle": ""}