{"organizations": [], "uuid": "5f850327254a32a0f3cf4061aa6c0c10d197a9f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.statesmanjournal.com", "main_image": "http://www.gannett-cdn.com/-mm-/9bcbb32a14ea0d26e575e81dd5035fc6ba2f87c1/c=0-139-2400-1495&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/22/Salem/B9319292354Z.1_20151022121716_000_G6BCAKK3F.1-0.jpg", "site_section": "http://rssfeeds.statesmanjournal.com/salem/sports", "section_title": "Salem - Sports", "url": "http://www.statesmanjournal.com/story/sports/high-school/2015/10/22/fridays-high-school-football-preview/74392244/", "country": "US", "title": "Friday's high school football preview", "performance_score": 0, "site": "statesmanjournal.com", "participants_count": 0, "title_full": "Friday's high school football preview", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T19:22:00.000+03:00", "replies_count": 0, "uuid": "5f850327254a32a0f3cf4061aa6c0c10d197a9f8"}, "author": "", "url": "http://www.statesmanjournal.com/story/sports/high-school/2015/10/22/fridays-high-school-football-preview/74392244/", "ord_in_thread": 0, "title": "Friday's high school football preview", "locations": ["Salem", "Ore."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Blanchet", "Andrew Baker", "Bill Poehler"], "text": "Friday's high school football preview Bill Poehler , Statesman Journal 9:22 a.m. PDT October 22, 2015 Buy Photo Salem Academy quarterback Andrew Baker during their game with Blanchet on Friday, Oct. 16, 2015, in Salem, Ore. (Photo: ASHLEY SMITH / STATESMAN JOURNAL) Buy Photo 14 CONNECT 2 TWEET LINKEDIN COMMENT EMAIL MORE \nGreater Valley Conference \nGame of the week \nMcNary at No. 6 South Salem, 7:15 p.m. \nOn the air: Radio on KYKN 1430 AM, video on CCTV2 Channel 22 at 11:59 p.m. \nGVC championship implications: South Salem (7-0, 6-0) can clinch at least a share of the conference championship – its second straight – with a win in this game. McNary (4-3, 4-2) is tied for fourth in the league, but is in position to earn a state playoff spot. \nA strong argument for player of the year: There's not much more South Salem senior quarterback Gabe Matthews could do to complete the argument that he is the top player in the conference, and one of the top in the state. He has completed 94 of 151 passes (62 percent) for 1,404 yards and 24 touchdowns against two interceptions for a 126.8 quarterback rating. He's rushed for 253 yards and eight touchdowns on 39 carries. In addition, he averages 36.5 yards per punt, is 3-for-3 on field goals with a long of 45 yards and completed 39 of 40 PAT kicks. \nTough streak for Celtics: The Celtics' three-game run of tough games to finish the season didn't start well as McNary lost 43-40 to West Salem last week and still has the tough finish to go with South Salem this week and Sprague on Oct. 30. \nMcKay at Forest Grove, 7:15 p.m. \nTough finish: The Royal Scots (1-6, 1-5) showed great promise early in the season, but the team has lost three straight – including last week's 28-7 defeat to McMinnville. McKay rushed for 138 yards, but turned the ball over twice. Everyone knows Forest Grove quarterback Taylor Jensen is a prolific passer, but McKay has the athletes on defense to keep up with him. \nNorth Salem at Sprague, 7:15 p.m. \nReeling Olympians: It wasn't surprising when Sprague (5-2, 5-1) lost 56-14 to South Salem. However, when Sprague lost 39-34 to a Grant team that is No. 41 in the OSAA's power rankings, it was a surprise. Sprague is in solid position to make the state playoffs, but with North Salem and McNary in the way, the Olympians have a tough road until the postseason. \nGVC finale: This is the final conference game of the season for North Salem (3-4). Even if the Vikings don't finish in the top four in the GVC, the team still has a shot at reaching the state playoffs as one of the at-large bids. North Salem is on the bubble now as the No. 31 team in the OSAA's power rankings. Playing Sprague (No. 18 in power rankings) and 5A Summit (No. 5 in power rankings) will help, but a win in one of the final two games would help a lot, too. \nWest Albany at West Salem, 7:15 p.m. \nOn the air: Radio on KBZY 1490 AM \nA winning streak: West Salem (4-3, 4-2) has been a streaky team this season. After winning its first three games, the Titans lost their next three. West Salem's 43-40 win against McNary was the team's second straight win and asserts the team back into third place in the conference. West Albany has struggled all season, but is still a team that has the potential for an upset for any team that overlooks it. \nMid-Willamette Conference \nGame of the week \nCorvallis at Central, 7 p.m. \nA new life: Central (4-3, 3-2) gained new life with a 35-21 win last week against Silverton that snapped a two-game losing streak. The Panthers play Corvallis (3-4, 3-2) then Woodburn (0-7) in next week's regular season finale. Central is in a four-way tie for second place, but the Panthers have the potential to place second in the conference if they can win the final two games of the regular season. \n1,000 yard star: Central junior running back Alvin Berroa has improved as the season has gone along. He's rushed for 1,014 yards and nine touchdowns on 79 carries. He's proven that he can get yards against tough defenses. \nSilverton at Woodburn, 7 p.m. \nChange of direction: The Foxes (3-4, 2-3) went from leading the conference to clinging for their playoff lives in a matter of three weeks after a series of injuries. Silverton was without injured junior quarterback Sam Morrison last week and started freshman Levi Nielson at quarterback, but got back senior Noah Dahl, though in a limited role. Silverton likely needs to win its next two games, including this one against Woodburn (0-7, 0-5), to make the state playoffs. \nDallas at Lebanon, 7 p.m. \nReturn to form: The Dragons (2-5, 2-3) showed they can do what made them a contender in past seasons: Running the football. Dallas rushed for 307 yards – including 117 and three touchdowns by Tanner Earhart – on 57 carries in last week's 20-0 win against Crescent Valley. Dallas still has the potential to reach the state playoffs out of the Mid-Willamette Conference, but need to beat Lebanon and Silverton in the next two weeks to get in. \nOn Oct. 16 Silverton and Central high schools battled in Silverton to a 34-21 victory for the Panthers. (Photo: Sheldon Traver - Special to the Statesman Journal) \nOregon West Conference \nGame of the week \nNo. 9 Stayton at No. 2 Philomath, 7 p.m. \nLeague championship implications: There's a couple ways this one could go. If Philomath (6-1, 4-0) wins this game the Warriors win the league championship and get a bye to the Nov. 6 first round of the state playoffs. If Stayton (6-1, 3-1) wins this game, the Eagles create a three-way tie – as long as Cascade defeats North Marion – for the conference championship. Stayton is coming off its first loss of the year, a 31-7 defeat against Stayton. \nReturn to the ground: Stayton's running game was put on ice against Cascade, accounting for 84 yards. The Eagles had a lot of success running the ball early in the season – the team is still averaging more than 200 yards on the ground – and need to run the ball and control the clock against a Philomath team that has made opposing defenses look silly. \nNorth Marion at No. 3 Cascade, 7 p.m. \nIn playoff position: Cascade (6-1, 3-1) needs to hope Stayton beats Philomath in order to get a share of the Oregon West championship. But as long as Cascade beats North Marion(3-4, 2-2), the Cougars likely will be in the state playoffs as they would earn the one at-large berth into the state playoffs and not have to be in a play-in game. \nWest Valley League \nGame of the week \nTaft at Dayton, 7 p.m. \nRested: Dayton (5-1, 3-1) caught a needed bye last week before this key game against Taft. The Tigers (4-3, 4-1) and Pirates are playing for second place in the conference. This is the league finale for Taft. \nSheridan at Santiam Christian, 7 p.m. \nTougher road ahead: Santiam Christian (6-1, 4-0) has a tougher opponent next week in Horizon Christian, but the Eagles won't overlook Sheridan (1-5, 0-4). The Eagles have been running the ball – including 137 yards against Amity, with two touchdowns by Hunter Bain – but this would be a good game to try new things on offense. \nWillamina at Amity, 7 p.m. \nChance for Amity to finish strong: The Warriors (2-5, 1-3) have been on a tough stretch by losing three straight, but this is a winnable game. A young and winless Willamina team has surrendered more points than any 3A team except Gervais and are vulnerable. \nPacWest Conference \nColton vs. Blanchet, 7:30 p.m. \nWhere: McCulloch Stadium. \nPlayoff implications: Blanchet's 27-21 double-overtime win against Salem Academy set up the Cavaliers (6-1, 3-1) well for a state playoff berth, but a win against a Colton (4-3, 2-2) team that has lost two straight would clinch it for Blanchet. \nStar in the making: Blanchet junior running back Nick Orlandini has been a starter since his freshman year and rushed for more than 1,000 yards as a sophomore, but is now becoming a star. He rushed for two touchdowns in overtime in the game last week and has made defenses pay attention. \nScio at Jefferson, 7 p.m. \nRivalry game: Scio's held a distinct edge in the rivalry in recent years, and this year promises to be no different. Scio (7-0, 4-0) is No. 1 in the OSAA's power rankings for a reason. The Loggers have the potential to rush for 500 yards against any opponent. Jefferson (2-5, 2-2) had perhaps its best defensive outing of the season in last week's 34-12 win against Chemawa, but Scio is a challenge no team has been up for this season. \nSalem Academy at Chemawa, 7 p.m. \nLeague finale for Crusaders: Yes, Salem Academy's 27-21 loss to Blanchet last week was a shock, but the Crusaders (5-2, 3-2) finish the conference season a week early by playing Chemawa (0-7, 0-5). A win in this game for Salem Academy clinches a state playoff spot, which would be the team's second straight. Salem Academy plays at Kings Way Christian in Washington next week in a nonleague game. \nGervais at Horizon Christian, 7 p.m. \nA strong return : Horizon Christian (3-4) started the season 0-4, including forfeiting a game to Salem Academy for not having enough healthy players. Now the Hawks have won three straight and will look to make it four straight against Gervais (0-7) in this nonleague game. Buy Photo \nWest Salem wide receiver Nate Okada is tackled by Sprague linebacker Dane McKinney during a Greater Valley Conference game, Friday, Oct. 2, 2015, in Salem, Ore. (Photo: Brent Drinkut/Statesman Journal) \nGame of the week \nCentral Linn at Regis, 7 p.m. \nLeague championship aspirations: Central Linn (7-0, 2-0) took a big step toward winning the Tri-River Conference championship with last week's 33-0 win against Kennedy. The Cobras can clinch at least a share of the conference championship with a win against Regis (4-3, 1-1). \nA defensive challenge: A Regis defense that shut down Oakland in last week's 54-13 win has a significantly different challenge against Central Linn's single wing offense. That Central Linn is passing as well as they are – Jesse Wibbens threw two touchdown passes to Braden Nightingale in Friday's 33-0 win – makes the version of the single wing especially tough to defend. \nKennedy at St. Paul, 7 p.m. \nA step in the wrong direction: Kennedy's offense was held to season-lows in last week's 33-0 loss to Central Linn with Bishop Mitchell being limited to 72 yards rushing on 10 carries and Brett Traeger being held to 83 yards passing and being intercepted twice. The Trojans (6-1, 2-1) face one of the most porous defenses in a St. Paul (3-3, 0-2), which has allowed 211 points this season, sixth most in Class 2A. \nSantiam at Monroe, 7 p.m. \nNonleague tuneup: No team in the state needed a win as much as Santiam (4-3) did last week. This week's nonleague game against Monroe (2-5) gives the Wolverines a chance to build some confidence heading into the regular-season finale against Regis next week. Santiam running back Joel Hills rushed for three touchdowns in last week's 38-27 win against St. Paul. \nClass 1A \nGame of the week \nNo. 9 Sherman at No. 6 Perrydale, 7 p.m. \nLeague title: This game will determine the champion of 1A Special District 4. This is the final league game for Sherman (5-2, 5-0) while Perrydale (6-0, 4-0) plays Arlington/Condon in the league finale Oct. 30. If Sherman wins this game, the team wins the league title outright. A Perrydale win gives the team at least a share of the league championship and the tiebreaker against Sherman no matter what happens next week. \nRested: A banged-up Perrydale team desperately needed the bye the Pirates enjoyed last week. Perrydale defeated Ione 62-20 in their final road game of the season and now they play the final two games of the regular season at home. \nAlsea at Falls City, 7 p.m. \nFinal regular season game: This is the final regularly scheduled game for Falls City. The Mountaineers (2-5, 2-1 1A Special District 3) play in a league playoff game Oct. 30. Falls City defeated Triangle Lake 24-21 last week behind 183 yards and two touchdowns passing from Jay Labrado and have found their way on offense in winning two of their past three games. 14 CONNECT 2 TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http://stjr.nl/1RYNN8p TOP VIDEOS", "external_links": [], "published": "2015-10-22T19:22:00.000+03:00", "crawled": "2015-10-23T08:48:29.398+03:00", "highlightTitle": ""}