{"organizations": [], "uuid": "92ef59c430fe14c517bc963f6f6d22d1f78ae971", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "host.madison.com", "main_image": "http://bloximages.chicago2.vip.townnews.com/host.madison.com/content/tncms/assets/v3/editorial/6/b7/6b771c56-9deb-5afb-b1ea-07fc32dc38a0/5617b22bde7dc.image.jpg?resize=620%2C438", "site_section": "http://host.madison.com/search/?f=rss&t=article&c=sports/college/football*&l=25&s=start_time&sd=desc", "section_title": "host.madison.com - RSS Results in sports/college/football* of type article", "url": "http://host.madison.com/sports/college/football/tom-oates-joel-stave-not-one-of-his-backups-needed/article_675bcc79-d177-5f11-8a6f-a4acb5885575.html", "country": "US", "title": "Tom Oates: Joel Stave, not one of his backups, needed in must-win situation against Nebraska", "performance_score": 0, "site": "madison.com", "participants_count": 1, "title_full": "Tom Oates: Joel Stave, not one of his backups, needed in must-win situation against Nebraska", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T19:05:00.000+03:00", "replies_count": 0, "uuid": "92ef59c430fe14c517bc963f6f6d22d1f78ae971"}, "author": "TOM OATES toates@madison.com, 608-252-6172", "url": "http://host.madison.com/sports/college/football/tom-oates-joel-stave-not-one-of-his-backups-needed/article_675bcc79-d177-5f11-8a6f-a4acb5885575.html", "ord_in_thread": 0, "title": "Tom Oates: Joel Stave, not one of his backups, needed in must-win situation against Nebraska", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Buy Now M.P. KING — State Journal \nUW senior Joel Stave has completed 93 of 147 passes (63.3 percent) for 1,064 yards and seven touchdowns with four interceptions this season. \nLINCOLN, Neb. — An informal survey of University of Wisconsin football fans on social media, non-social media and, more accurately, anti-social media has revealed a 50-50 split regarding senior quarterback Joel Stave. \nHalf want him benched and the other half want him dismissed from the program entirely. \nEven a committed UW tailback recruit tweeted after last week’s 10-6 home loss to Iowa that the program won’t be elite “until Stave leaves.” \nThat tweet was quickly deleted, but the knee-jerk debate raged on all week over whether Stave should retain the starting job he’s held off and on for four seasons when UW meets Nebraska today at Memorial Stadium. \nSo let’s see if I’ve got this straight: There actually are UW fans out there who want coach Paul Chryst to bench Stave for a wholly inexperienced quarterback against a perennial contender at one of the nation’s most inhospitable venues in a must-win game for the Badgers? \nReally? \nSorry, but benching Stave in favor of little-used Bart Houston, never-used D.J. Gillins or redshirting true freshman Alex Hornibrook makes zero sense at this time. In fact, given the precarious situation UW finds itself in today, starting Stave is a no-brainer. \nCoaches always say they’ll start the quarterback who gives them the best chance to win and Chryst is no different. Only this time it’s not a cliche. Stave is the Badgers’ best option — actually their only option — if they hope to beat the Cornhuskers in a game they absolutely, positively have to win. \nAfter UW dropped its Big Ten Conference opener to the Hawkeyes, there was a lot of hopeful talk about how the Badgers did the same thing last year, then stormed back to win seven games in a row and claim the Western Division title by two full games. But this isn’t last year. The circumstances are radically different and UW can’t afford another loss if it wants to have any chance at reaching the Big Ten Championship Game for the fourth time in five years. \nNot even the Badgers could deny that this is a must-win game. \n“I think it is,” tight end Troy Fumagalli said. “I think every game is a must-win. Playing in the Big Ten, every opponent we play is going to be tough. They’re going to be very similar to Iowa — big, aggressive. I think every one’s a must-win from here on out.” \nIndeed, they are. A loss today would drop UW to 0-2 and all but knock it out of contention in the division just two weeks into the Big Ten season. If UW falls to Nebraska and Iowa beats visiting Illinois as expected today, an 0-2 Badgers team effectively would be three games behind the Hawkeyes because they would lose the head-to-head tie-breaker. \nUnfortunately, it gets worse. Unless 22nd-ranked Iowa face-plants after winning its first five games this season, its soft Big Ten schedule — no Ohio State, Michigan State, Michigan or Penn State — will make it hard for anyone to catch to catch it. The Hawkeyes will be favored to beat Illinois, Maryland, Minnesota and Purdue at home, though they face potentially tough road tests at 13th-ranked Northwestern (next week), Indiana and Nebraska. Still, it’s hard to see Iowa finishing worse than 6-2. \nNorthwestern, the West’s other 5-0 team, is less problematic for UW because the Wildcats must play the Badgers in Madison and they have very difficult crossover games — at Michigan today and at home against Penn State. \nEven with a loss today, the Badgers could conceivably catch the Wildcats. \nOf course, winning today would make everything easier, especially since UW’s schedule gets decidedly softer after this. \nToday’s outcome might come down to UW’s quarterback, too, because the Badgers’ inconsistent rushing attack doesn’t figure to run wild on the Cornhuskers’ strong rush defense, meaning it could be up to Stave to exploit Nebraska’s pass defense, which statistically is the worst in the nation. \nStave is UW’s best hope to take advantage of that weakness and save the Badgers from a date in the Music City Bowl. That isn’t making excuses for him, either. \nStave’s four-turnover performance against Iowa was his poorest effort of the season and contained many of the problems he’s had over the years. However, his first four games ranged from very good to acceptable, so it makes no sense to discard him based on one poor game. \nThat is especially true when you consider the lack of readiness among those who would play in Stave’s absence. Houston has thrown all of 13 passes; Gillens has never even thrown a pass; and Hornibrook, perhaps the most promising quarterback on the roster, shouldn’t waste a redshirt year just to get ready for next season. \nBesides, the quarterback position is too important and too complex to just plug in a new guy and continue on. Were UW to go with a less-experienced quarterback today, it wouldn’t even be able to run its full offense. \nIf you’re among those who have already written off this season, there is nothing that will change your mind about Stave. But UW can still have success in 2015, and Stave is the only quarterback with enough experience to make that happen. \nContact Tom Oates at toates@madison.com or 608-252-6172.", "external_links": [], "published": "2015-10-10T19:05:00.000+03:00", "crawled": "2015-10-10T21:58:28.143+03:00", "highlightTitle": ""}