{"organizations": [], "uuid": "809d8c15b98128cff9b6fdb9342fd81c717f6587", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sooeveningnews.com", "main_image": "http://www.sooeveningnews.com/Global/images/head/nameplate/mi-soo_logo.png", "site_section": "http://www.sooeveningnews.com/sports?template=rss&mime=xml", "section_title": "Sports - Sault Ste. Marie Evening News - Sault Ste. Marie, MI", "url": "http://www.sooeveningnews.com/article/20151006/SPORTS/151009461/2000/NEWS?rssfeed=true", "country": "US", "title": "Engadine runs first home cross country meet", "performance_score": 0, "site": "sooeveningnews.com", "participants_count": 1, "title_full": "Engadine runs first home cross country meet", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T18:58:00.000+03:00", "replies_count": 0, "uuid": "809d8c15b98128cff9b6fdb9342fd81c717f6587"}, "author": "John Vrancic For the Evening News", "url": "http://www.sooeveningnews.com/article/20151006/SPORTS/151009461/2000/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "Engadine runs first home cross country meet", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Engadine runs first home cross country meet Comment Sault Ste. Marie Evening News - Sault Ste. Marie, MI By John Vrancic Posted Oct. 6, 2015 at 10:58 AM By John VrancicFor the Evening News Posted Oct. 6, 2015 at 10:58 AM NAUBINWAY — It was an historic day for the Engadine Eagles Monday as they got an opportunity to run in a home cross country meet for the first time. The Eagles, fielding a full team for the first time this year, served as hosts in the second leg of the Eastern U.P. Conference Jamboree at the Hiawatha Sportsman’s Club Golf Course. “I think it went well, but it wouldn’t had gone as well without the help of Jim Beck (longtime cross country coach at downstate Chelsea).” said Engadine athletic director Deb DeWyse. “Jim has been fabulous. He donated all the material. For our first meet at Engadine, we’re just thrilled to be able to offer this to our students and the Eastern U.P. Conference. The Hiawatha Sportsman’s Club has been gracious in lending their support and resources.” Cedarville’s boys, taking four of the top five places, won this leg with 28 points. Runner-up Newberry placed four among the top nine and scored 38. Pickford was third at 91, followed by Rudyard with 100. The Cedarville girls also won with 58 points. They were followed by St. Ignace 72, Brimley 76 and Newberry 77. “Our kids did pretty well,” said Cedarville coach Ryan Wilson. “We have some work to do before the (U.P. Division 3) Finals, but they’re hard-working kids. They’re progressing pretty well. They’re excited about going to practice tomorrow.” Cedarville senior Patrick McMaken captured the boys’ individual title, covering the 3.1-mile course in 18 minutes, 48 seconds on this sunny and seasonably cool day. He was followed by Newberry’s Kindred Griffis (18:56) and teammates Avry Freel (19:09), Thomas Bohn (19:24) and Zach Claxton (19:38). “This is a great course,” said McMaken. “I wish I could run here again. This was a beautiful day to run. There was a lot of sand on the course and one hill back there, which was a steady include for about 400 yards.” McMaken also had special motivation on this early fall day. “I wanted to go out and do it for my cousin (St. Ignace senior Mitchell Snyder) who got killed in that car accident (on M-123) Friday night,” he said. “He was a great kid. I’m dedicating the rest of this season to him.” Newberry senior Natalie Beaulieu, who continues her battle with compartment syndrome, was crowned girls’ champion at 20:17. She was followed by Cedarville’s Emma Bohn (20:35) and Caroline Freel (22:17), Brimley’s Lauren Halvorsen (22:19) and Cedarville’s Leila Schlosser (22:29). “I’m real pleased with that time,” said Beaulieu. “I had to take this whole week off from running because my legs were bothering me. This reminds me I still have things to shoot for, although it’s not as bad as last year. My goal was to stay with Emma the whole way and I did that for two miles. Then, I felt I could pick up the pace. I guess this is a pretty big confidence builder. I loved the course and it was perfect running weather. I liked how it was back in the woods, and didn’t have many hills.” Page 2 of 2 - Engadine held its own in its home debut, with the boys placing fifth and the girls taking sixth among eight schools. The Eagles had a top 10 finisher in freshman Mickaela Deace, who placed ninth in the girls’ race (23:24). “There has been a little fluctuation among the boys,” said Engadine coach Tracy Germain. “They’re in a transition phase and the girls ran pretty solid. “I think we have a beautiful course. It’s very well marked. Jim (Beck) did a fabulous job setting it up and Deb (DeWyse) puts in a lot of time helping us get eveything ready. Jim is showing us all the ropes. That way we have a better idea of what’s happening.” By John Vrancic Sault Ste. Marie Evening News - Sault Ste. Marie, MI By John Vrancic", "external_links": [], "published": "2015-10-06T18:58:00.000+03:00", "crawled": "2015-10-06T21:18:43.828+03:00", "highlightTitle": ""}