{"organizations": [], "uuid": "5cab927baacf697d5bb0ebe6f7cc68b61e3a82a6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "onlineathens.com", "main_image": "http://onlineathens.com/sites/default/files/14834461.jpg", "site_section": "http://ath-cdn.com/taxonomy/term/2/feed", "section_title": "Sports", "url": "http://onlineathens.com/dogbytes/football/2015-10-24/emails-follow-losses-frustrated-fans-let-uga-decision-makers-know-how", "country": "US", "title": "Emails follow losses: Frustrated fans let UGA decision-makers know how they feel", "performance_score": 0, "site": "onlineathens.com", "participants_count": 1, "title_full": "Emails follow losses: Frustrated fans let UGA decision-makers know how they feel", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T04:19:00.000+02:00", "replies_count": 0, "uuid": "5cab927baacf697d5bb0ebe6f7cc68b61e3a82a6"}, "author": "Staff", "url": "http://onlineathens.com/dogbytes/football/2015-10-24/emails-follow-losses-frustrated-fans-let-uga-decision-makers-know-how", "ord_in_thread": 0, "title": "Emails follow losses: Frustrated fans let UGA decision-makers know how they feel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Emails follow losses: Frustrated fans let UGA decision-makers know how they feel marc.weiszer@onlineathens.com – updated Saturday, October 24, 2015 - 11:03pm \nR egular business hours at the University of Georgia are 8 a.m. to 5 p.m. weekdays. \nEmail inboxes never close. \nThat’s a good thing for people like Danny Smith, who have something to get off their chests about the football team under coach Mark Richt, especially when the Bulldogs lost back-to-back SEC games to Alabama and Tennessee earlier this month. \nSmith, a season ticket holder who lives in Tunnel Hill near Dalton, fired off an email to Georgia athletic director Greg McGarity at 10:55 p.m. on Oct. 10, hours after the Bulldogs lost 38-31 in Knoxville. \n“2015 will be another mediocre year for UGA’s football team ending with an invitation from a 2nd or 3rd tier bowl,” he wrote. “We have lost confidence in Coach Richt’s ability to beat the tougher teams on the schedule and propel the team to a championship.” He closed with “I think it is time for UGA to make a change.” \nReached by phone, Smith said he also sent an email in 2010 in support of Richt after a 1-4 start. On the night of the Tennessee game, he crafted an email in a hotel room in St. Simons Island after returning from a wedding with his wife. He saw most of the first half and then watched highlights when he returned. \n“If you go back, starting with 2008, every year we have a habit of losing games either we shouldn’t lose, or there are games against top-ranked opponents that are critical to us in terms of making it to the championship game,” said Smith, a retired hospital chief financial officer who also thinks 10 years since Georgia won an SEC title is too long. “It happened again this year. I feel like we had a pretty good football team. (Richt has) obviously got some issues at quarterback, but other than that I thought we had a pretty good team and a chance. Even if we didn’t beat Alabama, I felt we should have beat Tennessee.” \nMcGarity and/or UGA president Jere Morehead received 38 emails or letters relating to Richt and the football program between Oct. 3, the day Georgia lost to Alabama 38-10, and Oct. 14, four days after the Tennessee loss, according to an open records request by the Athens Banner-Herald and OnlineAthens.com. \nOf those, 28 either wanted Richt fired (“When the season is finished, perhaps we should make an offer to Kirby Smart of Alabama to be our next Football Head Coach,” one alum wrote), changes to be made or expressed unhappiness with the team’s performance. Four wrote to express support for Richt. \nOthers wrote about the way players acted in a pregame incident with Alabama, complained about the Sanford Stadium atmosphere, or the condition of the field at Tennessee. \n“You know probably starting Saturday night into Sunday into Monday, your inbox is going to be full of people expressing their thoughts,” McGarity said. \nSome can’t wait, sending them at halftime. \n“I read emails,” McGarity said. “Sure, if someone has time to write, I’ll read it. I have to decide on my own decisions, things of this nature. People vent. I get that. People compliment. I get that. You kind of read everything.” \nGeorgia gave Richt, now in his 15th season, an $800,000 raise and a contract extension in January after a 10-3 season. It has increased annual spending for the football program 35.7 percent and moved forward with plans for a $30 million indoor facility. Richt has helped attract a 2016 recruiting class, led by five-star quarterback Jacob Eason, that is ranked No. 8 nationally by Scout.com. \n“We are proud he is our coach and that he is a man of character and ethics,” Becca Farr wrote on Oct. 12. “We believe that Mark Richt is the man to lead the UGA football team and we believe he will lead us to a national championship. It may not happen this year, but it will happen.” \nOthers aren’t so sure. \nTommy Lawhorne, captain of UGA’s 1967 team, sent a letter to Morehead after the Tennessee loss with the handwritten message “I remain convinced our coach has lost his competitive edge.” It was written on a letter dated Dec. 17 in which he wrote he had lost confidence in Richt and mentioned he left the loss to Georgia Tech “in disgust.” \nWhen he was on the athletic board of directors in September 2011, Lawhorne said at a meeting “many of us are concerned about the state of the football program.” \nScott Ripley wrote two days after the Tennessee loss that he no longer planned to buy season tickets, because he did not think Richt could lead Georgia to another championship. \n“I’m the only one that’s fed up enough,” he said with a laugh when told he was the only fan to threaten to not renew tickets. \nHe wrote to McGarity: “I cannot tell you what to do. I only hope that this realization has hit the athletic department and that there is a plan of action in place to deal with Coach Richt’s removal and replacement in a swift and purposeful manner. I am shocked at the number of fans who still claim that Georgia can’t do better than Mark Richt and throw the tired argument of ‘who can we hire that would be better.’ I don’t know the answer to that question but other teams within our conference have proved time and again that it can be done. ... I am a 2002 graduate of the Terry College of Business and have been a season ticket holder ever since. I can no longer support the continued employment of Mark Richt as our head coach of the football team.” \nRipley, 35, who lives in Marietta and is a project manager for an electrical contracting company, is a lifelong Georgia fan. \n“The frustration has built over time,” Ripley said, mentioning a “no-show” at South Carolina in 2012, a 35-7 loss. \nRipley said he got a phone call from someone with the Georgia Bulldog Club the same day he sent his email. When asked if he would still discontinue to buy season tickets if Georgia ran the table the rest of its schedule, Ripley said he was leaning toward that. His tickets, he said, cost him more than $1,000. \nLike Ripley, Smith also praised Richt for his integrity and the way he runs his program. \n“You don’t want a coach like a Bobby Petrino or someone like that,” he said. \nRipley and Smith said they did not hear from McGarity. \nSmith said he gets surveys from UGA on his opinion on what they can do to improve the fan experience. \n“I said start winning. Start winning the games we need to win and make it to the championship.” \nMcGarity said the volume of emails this month wasn’t different than other football losses, whether it was Auburn in 2013 or Georgia Tech in 2014. \n“That’s why sometimes you’re numb to it,” he said. “... It is just typical of the type of email traffic we receive on a weekly, monthly and yearly basis. It doesn’t surprise me because people are passionate.” \nRicht was asked days after the Tennessee loss about criticism he receives. \n“We all have frustrations,” he said. “I just go back to the things I can control and I focus on that. Don’t focus on things I can’t control.” \n ", "external_links": [], "published": "2015-10-25T04:19:00.000+02:00", "crawled": "2015-10-25T06:56:56.729+02:00", "highlightTitle": ""}