{"organizations": [], "uuid": "9c849f1752d2568c230211ce8e2ec31b9344dba7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbssports.com", "main_image": "http://sports.cbsimg.net/images/visual/whatshot/pompeyandrusnoof.jpg", "site_section": "http://www.cbssports.com/partners/feeds/rss/home_news", "section_title": "Sports News : CBSSports.com", "url": "http://www.cbssports.com/mlb/eye-on-baseball/25340794/rangers-elvis-andrus-laments-worst-inning-of-career-its-a-lot-of-pain", "country": "US", "title": "Andrus says rough inning causing 'a lot of pain'", "performance_score": 0, "site": "cbssports.com", "participants_count": 0, "title_full": "Andrus says rough inning causing 'a lot of pain'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T21:18:00.000+03:00", "replies_count": 0, "uuid": "9c849f1752d2568c230211ce8e2ec31b9344dba7"}, "author": "", "url": "http://www.cbssports.com/mlb/eye-on-baseball/25340794/rangers-elvis-andrus-laments-worst-inning-of-career-its-a-lot-of-pain", "ord_in_thread": 0, "title": "Andrus says rough inning causing 'a lot of pain'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Elvis Andrus", "Andrus", "David Brown"], "text": "Rangers' Elvis Andrus laments worst inning of career: 'It's a lot of pain' By David Brown | Baseball Writer October 15, 2015 1:18 PM ET \nThere's a good chance the seventh inning of Game 5 of the 2015 ALDS is always going to be remembered as the worst moment of Elvis Andrus ' career. Andrus least of all, based only on his comments afterward, won't be able to forget. The question will be: How and when does he get over it? \nAndrus was a long way from getting over it Wednesday when, in a span of three batters, the Texas Rangers season was turned upside down in part because of Andrus' mistakes. He made two errors on what appeared to be routine plays, and couldn't make a play on an errant throw by Mitch Moreland , all of which fueled a four-run rally for the Blue Jays. The Rangers, who led by a run when the seventh inning started, could not recover and lost 6-3, ending their season on a most frustrating note. \nTypically one of the more positive, effervescent figures in the majors, Andrus understandably was down in the dumps about it. \n\"Believe me, this is the toughest time in my career right now,\" he told reporters . \"... It's a lot of pain right now.\" \nIt started with Andrus booting a grounder by Russell Martin to short: \nYour browser does not support iframes. \nThe next batter, Kevin Pillar , hit into what should have been a force play at second, but Moreland botched the throw and Andrus couldn't come up with a short-hop catch. Not Andrus' fault, but still a play he's made other times. Just not this time. \nYour browser does not support iframes. \nThe very next batter, Ryan Goins , laid down a bunt trying to move the runners to second and third. Adrian Beltre made a great play to pounce and throw to Andrus covering at the third-base bag, but it was dropped for an error. The inning was well on its way into becoming a nightmare. \nYour browser does not support iframes. \nThese incidents weren't even the most audacious events to occur in the seventh inning, as we know. From the bizarre Shin-Soo Choo deflection on what should have been a harmless flip back to the pitcher by Martin, to angry and bewildered fans throwing beer cups , to the Jose Bautista monster home run and divisive bat flip , to the half-baked attempts at peace (or something) made by Rangers pitcher Sam Dyson . \nAll of that might be the saving grace for Andrus. It's easier for his miscues to get lost. Not that he would forget. Rangers fans probably won't, either. A post by reporter Evan Grant of the Dallas Morning News asks the question directly: Will this game ruin Andrus' legacy in Texas? \n\"I've got a lot of emotions,\" Andrus said softly after letting out a defeated exhale. \"Nothing good is going through my mind right now. We had an opportunity to win and I let everybody down. I should have made the plays. They were easy plays. I should make them 100 times out of 100. There is no excuse. This is the toughest point of my career.\" \nA better question: Will it define his career? \nWill he be \"The Guy Who Couldn't Catch The Ball?\" \nAt another time and another place, the Division Series threatened to define Andrus' career. Or at least promised great things to come. In 2010, barely 22, Andrus turned Game 5 against Tampa Bay quickly in the Rangers favor with an electrifying dash around the bases. He was the energetic young face of an emerging long-term contender. \nFive years later, his career has been marked by great promise and only occasional delivery. He received a $115 million contract after 2012 and then spent the next 2 ½ seasons going nowhere until a couple of \"critical truth\" talks with coaches Tony Beasley and Dave Magadan at the start of the second half of this season. It led to a crisper, more focused approach on defense and a more confident, more authoritative swing at the plate. \nThen came Wednesday. \nWhat comes tomorrow? \nDalton Pompey (left) gets excited, and Elvis Andrus starts to slump his shoulders. (USATSI)", "external_links": [], "published": "2015-10-15T21:18:00.000+03:00", "crawled": "2015-10-16T01:14:08.973+03:00", "highlightTitle": ""}