{"organizations": [], "uuid": "629798ec67d8490dec81768ae91371633370a33b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.timesunion.com", "main_image": "http://www.timesunion.com/img/pages/article/opengraph_default.jpg", "site_section": "http://www.timesunion.com/default/feed/default/feed/Sports-News-64.php", "section_title": "Sports News", "url": "http://www.timesunion.com/sports/article/For-Bombers-a-busy-weekend-ahead-6546951.php", "country": "US", "title": "For Bombers, a busy weekend ahead", "performance_score": 0, "site": "timesunion.com", "participants_count": 1, "title_full": "For Bombers, a busy weekend ahead - Times Union", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T05:51:00.000+03:00", "replies_count": 0, "uuid": "629798ec67d8490dec81768ae91371633370a33b"}, "author": "timesunion.com", "url": "http://www.timesunion.com/sports/article/For-Bombers-a-busy-weekend-ahead-6546951.php", "ord_in_thread": 0, "title": "For Bombers, a busy weekend ahead", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Baltimore\nThe New York Yankees might have a busy weekend before getting a one-day break ahead of the playoffs.\nAfter clinching an AL wild-card berth on Thursday night with a 4-1 win over Boston, the Yankees had their game Friday against the Orioles postponed by rain.\nThe makeup will be made up as part of a split doubleheader Saturday. The starting times are at 12:05 p.m. and 7:05 p.m.\nThe teams then conclude the regular season with a matchup on Sunday afternoon.\nIvan Nova (6-10, 4.89 ERA) is scheduled to start the first game Saturday, followed by Luis Severino (5-3, 2.77).\nBut that could change if Houston loses late Friday night in Arizona, assuring New York home-field advantage in Tuesday's winner-take-all, wild-card matchup.\n\"Nova would still be the first, but Sevi, we might do something different,\" manager Joe Girardi said.\nIf New York clinches that home game, then Girardi will likely rest his regulars.\n\"The most important thing going through this weekend is to clinch the home field for us,\" he said. \"And in saying that, I don't really have plans of playing any one person two games tomorrow. To me, that doesn't make a lot of sense, that you would do that physically to the guys and risk injury (or) fatigue.\"\nBaltimore was eliminated from contention earlier this week. The Orioles need a three-game sweep to avoid a losing season.\nWei-Yin Chen (10-8, 3.35 ERA) will pitch the opener, followed by Ubaldo Jimenez (12-10, 4.10 ERA).\nChen is a pending free agent, meaning this could be the left-hander's final appearance with Baltimore. In four years with the Orioles, Chen is 45-32 with a 3.73 ERA.\nManager Buck Showalter believes it should be more of the same on Saturday.\n\"I expect him to pitch the way he has most of his time here,\" he said. \"He's been very solid all year. Very proud of his health and the things he's been able to maintain. Every time he's take the mound for us, I like our chances.\n\"Very good evaluation, very good signing. Hopefully it will continue.\"\nEarlier Friday, Chris Davis was named Most Valuable Oriole in balloting by members of the media who cover the team. Davis leads the majors with 45 home runs and has 112 RBIs.\nHe also was named Most Valuable Oriole in 2013. Davis slipped dramatically last year, batting only .197, but has come up with a season that should make him a hot commodity during the off-season, when he too becomes a free agent.\n\"We couldn't have been as competitive as we've been this year without him,\" Showalter said. \"I think he was very disappointed at the right things that happened last year. He wanted to be there for the club all year and be somebody we could count on, and he was.\"", "external_links": [], "published": "2015-10-03T05:51:00.000+03:00", "crawled": "2015-10-03T08:23:18.336+03:00", "highlightTitle": ""}