{"organizations": [], "uuid": "88833064748abf8307fafa77ec12499bf858360a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.oregonlive.com", "main_image": "http://imgick.oregonlive.com/home/olive-media/width620/img/living_impact/photo/19016734-standard.jpg", "site_section": "http://www.oregonlive.com/", "section_title": "Oregon Local News, Breaking News, Sports &amp; Weather - OregonLive.com", "url": "http://www.oregonlive.com/living/index.ssf/2015/10/how_hipsters_took_over_the_eng.html", "country": "US", "title": "How hipsters took over the English language by reviving long-lost words", "performance_score": 0, "site": "oregonlive.com", "participants_count": 9, "title_full": "How hipsters took over the English language by reviving long-lost words | OregonLive.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T16:30:00.000+03:00", "replies_count": 8, "uuid": "88833064748abf8307fafa77ec12499bf858360a"}, "author": "Douglas Perry | The Oregonian/OregonLive", "url": "http://www.oregonlive.com/living/index.ssf/2015/10/how_hipsters_took_over_the_eng.html", "ord_in_thread": 0, "title": "How hipsters took over the English language by reviving long-lost words", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bob Dylan does it. And if it's good enough for the famed Voice of a Generation, it's perfect for hipsters.\nDylanologists claim the iconic musician, for both songs and his acclaimed 2004 memoir, snatched up words and phrases from various sources, including Civil War poet Henry Timrod, an 1899 Jack London short story and F. Scott Fitzgerald's \"The Great Gatsby.\" Fellow singer-songwriter Joni Mitchell goes further, saying Dylan has \"borrowed his voice from a lot of old hillbillies. He's got a lot of borrowed things.\"\nThe snooty name for this is \"nostalgia mining,\" the rooting around in the past for ideas, behaviors and words that have gone out of style and, thus, are cool. This is where the hipster holy grail -- true authenticity -- supposedly can be found.\nTo prove that hipsters are refashioning our spoken and written language in the same way that Dylan remade popular music, linguist Chi Luu has trawled Google's Ngram Viewer, which tracks words and sentences used in print publications from 1800. Luu found that a lot of charming archaic English words have made a comeback in recent years.\n\"Hipster culture unites both conformity and non-conformity by celebrating the formerly uncool things of a past mainstream and making them appear modern, authentic and hip, hand in hand with heritage,\" Luu writes on the blog for the digital academic library JSTOR. \"Unlike other celebrated countercultures such as the punk or hip-hop movement, there still aren't many who would seriously self-identify as hipsters, yet the influence of the hipster myth on the wider cultural consumer is clear. This in turn seems to have had an impact in society on many areas of culture, including linguistic choices.\"\nLuu writes that words with \"a nostalgic air, reflecting the cultural values and tastes of the speaker,\" are suddenly popping up everywhere. These include: bespoke, peruse, dapper, mayhaps and bedchamber . You'll also find that old-timey prepositions like amidst and amongs t are back. The same goes for baby names that were long considered lost to the past, such as Silas and Adeline.\nThe most popular old-time word that hipsters have appropriated appears to be \"smitten,\" which bottomed out around 1980 and has spiked dramatically in just the past few years.\nLuu points out that many hipsters use these archaic words with a sense of irony, but it's unclear whether this affects the words' popularity in the wider culture. Does delivering a word with a smirk diminish its cool quotient? The answer, my friend, is blowin' in the wind.\n-- Douglas Perry", "external_links": ["http://www.spin.com/2014/05/bob-dylan-da-vinci-code-chronicles-memoir-dylanologists-plagiarism/", "http://www.uncut.co.uk/news/joni-mitchell-i-like-a-lot-of-bob-dylan-s-songs-but-he-s-not-very-musically-gifted-16462#Q7ifJp5jzAseEMer.99", "http://daily.jstor.org/hipster-thou-vintage-language-back-vogue/", "http://www.independent.co.uk/arts-entertainment/books/news/four-graphs-that-show-how-hipsters-are-bringing-back-vintage-language-a6702576.html"], "published": "2015-10-21T16:30:00.000+03:00", "crawled": "2015-10-22T00:38:49.790+03:00", "highlightTitle": ""}