{"organizations": ["Few Perkins", "Facebook Perkins"], "uuid": "377d0ab85fa09b41fa1a4443b77af737a60ffec9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.krem.com", "main_image": "http://www.gannett-cdn.com/-mm-/489efad1142179deef9ce5ef3cf126cd99e1a3f1/r=x633&amp;c=1200x630/http/cdn.tegna-tv.com/-mm-/0889c86a0c4751b23a15c53209cf390c1fac35ef/c=203-55-1438-752/local/-/media/2015/10/14/KREM/KREM/635803839516324574-JoshPerkins00000000.jpg", "site_section": "http://rssfeeds.krem.com/_/20/109719810/krem/sports", "section_title": "KREM - Sports", "url": "http://www.krem.com/story/sports/gonzaga-bulldogs/2015/10/14/perkins-fitting-into-new-role-williams-iii-impresses-few/73912230/", "country": "US", "title": "Perkins fitting into new role, Williams III impresses Few", "performance_score": 0, "site": "krem.com", "participants_count": 0, "title_full": "Perkins fitting into new role, Williams III impresses Few", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T08:48:00.000+03:00", "replies_count": 0, "uuid": "377d0ab85fa09b41fa1a4443b77af737a60ffec9"}, "author": "", "url": "http://www.krem.com/story/sports/gonzaga-bulldogs/2015/10/14/perkins-fitting-into-new-role-williams-iii-impresses-few/73912230/", "ord_in_thread": 0, "title": "Perkins fitting into new role, Williams III impresses Few", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Darnay Tripp", "Mark Few", "Perkins", "Josh Perkins", "Eric McClellan", "Johnathan Williams III", "Williams III"], "text": "Perkins fitting into new role, Williams III impresses Few Fellow point guard Eric McClellan believes Josh Perkins could be the top PG in the country. Post to Facebook Perkins fitting into new role, Williams III impresses Few Fellow point guard Eric McClellan believes Josh Perkins could be the top PG in the country.   KREM.com: http://on.krem.com/1RGJZJ1   Join the Conversation To   Perkins fitting into new role, Williams III impresses Few Eric McClellan thinks Josh Perkins can be the best point guard in the country after missing last season. Meanwhile Johnathan Williams III has quickly made a fan out of Mark Few. Darnay Tripp , KREM.com 10:48 p.m. PDT October 13, 2015 Fellow point guard Eric McClellan believes Josh Perkins could be the top PG in the country. Fellow point guard Eric McClellan believes Josh Perkins could be the top PG in the country. (Photo: KREM 2) CONNECT TWEET LINKEDIN COMMENT EMAIL MORE \nIt is no small task trying to replace two four year starting guards, especially when their names are Pangos and Bell. But the presence of Josh Perkins - and the promise he showed early last season - has Gonzaga and its fans feeling good about the guy running the show. \nPerkins' performance at Kraziness in the Kennel backed that up. He scored 17 points, coming on 6-for-9 shooting. He also hit 2 of 4 three point attempts, something he spent a lot of time working on last season after suffering a broken jaw. Perkins did not commit a turnover, and hit one big shot after another to win it for his team. Still technically a freshman, Perkins got some high praise from fellow point guard Eric McClellan. \n\"I think he's got the potential to be the bet point guard in the nation,\" McClellan said. \"I know that's a large statement but he works real hard, he takes his training seriously. This offseason and preseason he's improved a tremendous amount.\" \n\"He's not playing like a freshman guard right now,\" Mark Few added. \"He's pretty savvy, pretty physical. But again, there's a lot of room for growth with him.\" \n\"I seen what it took from Kevin and Gary,\" Perkins said. \"I learned mentally, phsyically. (I) took it personal in the weight room and worked out every day, got my shot right. Everything I need to do to help my team I worked on.\" \nPerkins averaged 5.0 points and 3.4 assists in the five games he played, prior to suffering the season-ending injury against Georgia. \nWe'll have to wait another year before seeing Missouri transfer Johnathan Williams III play in a real game for the Zags. If Saturday's scrimmage was any indication he has the potential to be a critical addition. Williams led the Tigers in scoring (11.9), rebounding (7.1) and blocked shots (0.6) as a sophomore. He put up 10 points, grabbed 5 boards and swatted a shot at Kraziness in the Kennel, and has quickly made a fan out of his new head coach. \n\"Doesn't he look good?\" Few said. \"He's just a joy to coach, and got a great approach. He's just eating up everything we throw at him. He's a great learner, and a hard worker, and has just been a great addition.\" \n\"He's a beast on the glass,\" Kyle Wiltjer added. \"He's really physical, he's really good. He's gonna be really big for us.\" Read or Share this story: http://on.krem.com/1RGJZJ1 TOP VIDEOS", "external_links": [], "published": "2015-10-14T08:48:00.000+03:00", "crawled": "2015-10-14T08:59:00.156+03:00", "highlightTitle": ""}