{"organizations": [], "uuid": "e076a827b634f3e339492f97be57390764437e09", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deseretnews.com", "main_image": "http://img.deseretnews.com/images/article/hires/1611709/1611709.jpg", "site_section": "http://www.deseretnews.com/sports/index.rss", "section_title": "Sports news and headlines for the Utah Jazz, BYU Cougars, Utah Utes and high schools, Salt Lake City sports, Utah sports - Deseret News", "url": "http://www.deseretnews.com/article/865639166/5A-girls-soccer-Dunns-overtime-goal-gives-Davis-dramatic-victory-over-American-Fork.html", "country": "US", "title": "5A girls soccer: Dunn's overtime goal gives Davis dramatic victory over American Fork", "performance_score": 0, "site": "deseretnews.com", "participants_count": 1, "title_full": "5A girls soccer: Dunn's overtime goal gives Davis dramatic victory over American Fork | Deseret News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "e076a827b634f3e339492f97be57390764437e09"}, "author": "Randy Hollis", "url": "http://www.deseretnews.com/article/865639166/5A-girls-soccer-Dunns-overtime-goal-gives-Davis-dramatic-victory-over-American-Fork.html", "ord_in_thread": 0, "title": "5A girls soccer: Dunn's overtime goal gives Davis dramatic victory over American Fork", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Defending 5A girls soccer champion Davis High had all it could handle Thursday against American Fork, but 6 ½ minutes into OT the Darts' Ireland Dunn drilled a shot from the left angle to give her team a tense 2-1 win and a berth in the semifinals.\nScoreboard » American Fork Davis 1 2 See more stats » “ I was pretty confident about it, but sometimes you never know, though — they can cover (the net) or to the side — and their goalie was awesome, she could've caught it. So many things could've gone wrong, but it was the right place at the right time, I guess.”\nDavis senior forward Ireland Dunn\nKAYSVILLE — Davis and American Fork had battled for nearly 90 minutes Thursday afternoon, two teams locked in a physically intense and emotionally tense quarterfinal clash of the 5A girls state soccer tournament.\nAnd then Ireland Dunn , the Darts' talented senior forward, decided enough was enough. It was time to take matters into her own hands — or in this case, her feet.\nSo 6 ½ minutes into overtime, Dunn dribbled nearly the length of the field and drilled a tough left-angle shot into the far corner of the net to give undefeated Davis a dramatic 2-1 victory at the Angel Street Soccer Complex, sending the defending 5A champion Darts (18-0-0) into next week's 5A semifinals.\n\"I knew if I'd pass it off we wouldn't have as good of a chance because the goal was just wide open,\" said Dunn. \"So sometimes you've just gotta do what you've gotta do and go for it, and that's what I decided to do.\n\"I was pretty confident about it, but sometimes you never know, though — they can cover (the net) or to the side — and their goalie was awesome, she could've caught it. So many things could've gone wrong, but it was the right place at the right time, I guess.\"\nIndeed it was and Davis, which played Tuesday without leading scorer Olivia Wade , who was in California to train with the U.S. Women's National U-17 Team, will face Region 1 champ Fremont in the 5A semifinals next Tuesday at 3:45 p.m. at Juan Diego High School. Wade, who has piled up 31 goals despite missing four games this year, will be back for that one.\n\"It was pretty crazy, crazier than we would like, but we got through it,\" said Dunn. \"We've never played American Fork before, so this was our first time and we didn't really know what we were coming into. But we knew they would come in hard. We always have known they were a good team, we have heard things about them, all good things, so when we stepped on the field, we gave it our all from the very beginning.\n\"And once we got scored on, we didn't stop,\" she said. \"We just kept playing, and they played us harder than any of us would've thought they would've played us. They are by far the best team we've played this year.\"\nMegan Rowe gave Davis a 1-0 lead in the 27th minute when she beat an American Fork defender to the ball in front of the net and poked a short shot past junior goalie Savanna Empey , who turned in a stellar effort for the Cavemen throughout the match.\nBut after the Region 2 champion Darts carried that 1-0 edge into halftime, the visiting Cavemen squared the match in the 54th minute when Kelsey Cook flicked a perfect lead pass to fellow junior Sophie Stewart , who fired off the finisher into the far-side net to tie it at 1-1.\nIt remained that way throughout the remainder of regulation, as Empey and American Fork's defense repeatedly denied the Darts' scoring threats, including a penalty kick by junior Mikayla Colohan that caromed hard off the left post in the 79th minute.\nThe Darts' own determined defense wasn't about to bend a bit either and, eventually, they sent it to overtime.\nAnd finally, Dunn got her chance down the left sideline, and she took it. This time, Dunn and the Darts would not be denied.\n\"It was tough, it was really tough,\" said Davis coach Souli Phongsavath. \"I don't know how many teams can be without their 30-goal-a-season person that scored a third of our goals and still make it to the semis. We haven't had (Wade) all week, and that just shows the depth and the heart of these girls, so I'm so proud of them for working through that.", "external_links": [], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-16T16:07:45.102+03:00", "highlightTitle": ""}