{"organizations": [], "uuid": "6e143b455a7bf03e7655a6bf676f0c1cf0b95865", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "accesswdun.com", "main_image": "http://bf19d0142b960c98204c-6849f9022b05f72b83236695aa4e9a0a.r50.cf2.rackcdn.com/uploads/articles/2015/339693/hs-volleyball-logo_p3.jpg", "site_section": "http://accesswdun.com/rss/3/rss.xml", "section_title": "AccessWDUN.com Sports", "url": "http://accesswdun.com/article/2015/10/339693/a", "country": "US", "title": "Volleyball: Gainesville closes out season with sweep of 8- matches", "performance_score": 0, "site": "accesswdun.com", "participants_count": 1, "title_full": "Volleyball: Gainesville closes out season with sweep of 8- matches", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T06:43:00.000+03:00", "replies_count": 0, "uuid": "6e143b455a7bf03e7655a6bf676f0c1cf0b95865"}, "author": "accessWDUN staff", "url": "http://accesswdun.com/article/2015/10/339693/a", "ord_in_thread": 0, "title": "Volleyball: Gainesville closes out season with sweep of 8- matches", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By accessWDUN staff Related Articles Volleyball: East Hall gets sweep at Madison County Volleyball: Lady Dragons set new wins mark, clinch No. 2 seed in 8-AAA Volleyball: GHS drops pair of matches Volleyball: Gainesville clinches two region wins \nGAINESVILLE — The Gainesville girls volleyball team closed out its regular season with a sweep of Cedar Shoals and Discovery Thursday at home. \nThe Lady Red Elephants beat Cedar Shoals 25-10, 25-17 and then knocked off Discovery 25-8, 25-10 in the finale. \nSydney King led with three aces, four assists, and 10 digs and Caroline Mercer added five aces and five digs for Gainesville. Morgan Frazier had five kills, Tangi Miller had three kills, Bessie Winston added four kills and two digs, and Sally Callahan had four aces, eight kills, and six digs for the Lady Red Elephants. \nTanai Watson had two aces, four assists, nine kills, and six digs, Abby Alexander had five kills, Anna Wylie had four kills and one block, Savannah Roys had 27 assists and four digs, and Ashley Filson added one ace and nine digs for Gainesville. \nThe Lady Red Elephants finished the regular season 31-11 and enters the Area 8- tournament next week as the No. 3 seed and will take on Loganville on Thursday at host Apalachee. Associated Tags : High school volleyball, Gainesville volleyball © Copyright 2015 AccessWDUN.com All rights reserved. This material may not be published, broadcast, rewritten, or redistributed without permission. (VIDEO) Game of the Week : Jefferson, Elbert Co. bring plenty to table in top 5 showdown The Elbert County and Jefferson High football coaches know the build up to their teams’ showdown on Friday in Elberton is mammoth -- and while they aren’t getting swept away in the hype, they understand why plenty of fans around the state are drooling over this one. 8:27PM ( 16 hours from now ) After an exciting Week 5 that featured several upsets and season-saving wins, Week 6 offers some of the best matchups of the season so far area-wide. 8:00PM ( 15 hours from now ) Falcons coach Dan Quinn said Thursday he expects receiver Julio Jones will be \"ready to rock\" on Sunday against the Houston Texans despite a new toe injury. 12:46PM ( 8 hours from now ) Sports", "external_links": [], "published": "2015-10-02T06:43:00.000+03:00", "crawled": "2015-10-02T11:05:22.786+03:00", "highlightTitle": ""}