{"organizations": [], "uuid": "183059126b9f747eca17f872a86cbae51ac55ebc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.masslive.com", "main_image": "http://imgick.masslive.com/home/mass-media/width620/img/umassfootball/photo/18878128-standard.jpg", "site_section": "http://impact.masslive.com/sports/atom.xml", "section_title": "Sports - MassLive.com", "url": "http://www.masslive.com/umassfootball/index.ssf/2015/10/umass_talking_points_mark_whip_3.html", "country": "US", "title": "UMass talking points: Mark Whipple sizes up FIU's playmakers, says Kelton Brackett could play limited snaps", "performance_score": 0, "site": "masslive.com", "participants_count": 1, "title_full": "UMass talking points: Mark Whipple sizes up FIU's playmakers, says Kelton Brackett could play limited snaps", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T22:20:00.000+03:00", "replies_count": 0, "uuid": "183059126b9f747eca17f872a86cbae51ac55ebc"}, "author": "Daniel Malone | Special to MassLive", "url": "http://www.masslive.com/umassfootball/index.ssf/2015/10/umass_talking_points_mark_whip_3.html", "ord_in_thread": 0, "title": "UMass talking points: Mark Whipple sizes up FIU's playmakers, says Kelton Brackett could play limited snaps", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments \nAMHERST – University of Massachusetts football coach Mark Whipple met with reporters after Wednesday night's practice to answer questions about Saturday's upcoming home matchup with Florida International. \nHere are a few things that stood out from talking with the UMass coach about FIU's playmakers and his team's injury situation. \nEarlier in the week, Whipple compared FIU to MAC teams, but \"with more skill.\" One of those skilled players is tight end Jonnu Smith, who was the most prolific tight end in the nation last season with 61 catches for 710 yards and eight touchdowns: \n\"He's not as tall as Jean (Sifrin), but he's explosive. He runs through people. He's a combination of Rod (Mills) and Jean. The scouts, I'm sure, have been watching him for the NFL. He got nicked up a little bit last week, but I'm sure he'll be ready to go. He's a guy that we've got to keep our eyes on.\" \nThe player throwing Smith the ball, quarterback Alex McGough, has had a strong start to the season. Whipple praised the sophomore passer for the strides he's made in year two under coach Ron Turner: \n\"He makes a lot good throws. He'll throw the deep ball and he's really accurate. Good timing. If you watch the Indiana tape, he makes a bunch of good throws. They got behind last week and he brought them back a little bit. He's a good player, a real good player.\" \nOn the UMass side of things, Whipple was asked a handful of questions about the team's nagging health issues. Not much has changed, but Whipple said cornerback Kelton Brackett could be used for limit snaps even if he doesn't practice at all this week: \n\"He might have a chance (to play Saturday). He was running around ... If a guy can play, we'll let him play. If he can give us some reps, we'll let him go. (Robert) Kitching didn't have any (practice reps) last week and he played. We feel like he's prepared. It's not like it's the first game of the season. So if he can get 10-15 plays, we'll let him go in and do it.\" \nFollow MassLive.com UMass beat writer @Daniel_Malone on Twitter or reach him via email .", "external_links": [], "published": "2015-10-01T22:20:00.000+03:00", "crawled": "2015-10-02T00:43:44.189+03:00", "highlightTitle": ""}