{"organizations": [], "uuid": "9f6353ae5eed8c607132360e0ff3f6cc10a6bc32", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "http://images.tribuneindia.com/cms/gall_content/2015/10/2015_10$largeimg23_Friday_2015_212917038.JPG", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/world/india-s-arms-build-up-will-force-pak-to-take-deterrent-measures-sharif/149668.html", "country": "US", "title": "India’s arms build-up will force Pak to take deterrent measures: Sharif", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "India’s arms build-up will force Pak to take deterrent measures: Sharif", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "9f6353ae5eed8c607132360e0ff3f6cc10a6bc32"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/world/india-s-arms-build-up-will-force-pak-to-take-deterrent-measures-sharif/149668.html", "ord_in_thread": 0, "title": "India’s arms build-up will force Pak to take deterrent measures: Sharif", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Washington, October 23\nPakistan Prime Minister Nawaz Sharif on Friday kept up his attack on India and warned that Pakistan will have to take “credible deterrent” measures in the face of Indian “arms build-up” and “dangerous military doctrines”. “While refusing dialogue, India is engaged in a major arms build-up, regrettably with the active assistance of several powers. It has adopted dangerous military doctrines. “This will compel Pakistan to take several counter-measures to preserve credible deterrence,” Sharif said in his address to the US Institute of Peace (USIP), a US Congress top American think tank. Sharif claimed that after coming to power two-and-a-half years ago, he has made several “sincere efforts” to improve relationship with India. “I accepted his (Prime Minister Narendra Modi’s) invitation to attend his swearing-in ceremony New Delhi,” he said. “The momentum this generated was scuttled when India cancelled the NSA-level talks on “flimsy excuse”, he alleged. In his address, Sharif blamed India for narrowing the talks to just one issue of terrorism after his meeting with Modi at Ufa, Russia, in July. “The cancellation of NSA-level talks have been followed by increased ceasefire violations by India across the Line of Control (LoC) and the working boundary, and a stream of hostile statements by Indian political and military leadership,” he alleged. The NSA-level talks scheduled for August 23 in New Delhi were called off at the last minute after India made it clear that Pakistan’s insistence on holding discussions on Kashmir and a meeting with separatists will not be acceptable to it.\nSharif also said anti-Pakistan actions by Hindu extremist groups in India have exacerbated the present tension in the region.\nHe was apparently referring to incidents targeting Pakistanis in India by Shiv Sena activists, who stormed the BCCI headquarters in Mumbai and forced cancellation of a meeting between the cricket chiefs of the two countries.\nEarlier, they threatened organisers of a show by legendary Pakistani singer Ghulam Ali in Mumbai, forcing them to cancel the event.\n“In my address to the United Nations General Assembly (UNGA), I proposed a new peace initiative comprising four specific and feasible steps that could serve as the basis for progress towards normalisation.\n“Unfortunately, India’s response was not positive,” he said.\nDuring his address to the UNGA on September 30, Sharif proposed a four-point “peace initiative” with India, which includes demilitarisation of Kashmir and unconditional withdrawal of forces from Siachen.\nIndia, however, had said de-militarising Kashmir is not the answer for achieving peace, but “deterrorising” Pakistan is.\nIn his address today, Sharif also said a normal and stable relationship between Pakistan and India can be build by adherence to the principle of the UN charter, especially the principle of sovereignty, equality of States and non-interference in internal affairs and the right of people of self-determination. — PTI", "external_links": [], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-23T22:20:30.646+03:00", "highlightTitle": ""}