{"organizations": [], "uuid": "263d9441e6abd47951f493743b1d1d6b60334689", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newsday.com", "main_image": "http://cdn.newsday.com/polopoly_fs/1.10765527.1440435217!/httpImage/image.JPG_gen/derivatives/display_2008/image.JPG", "site_section": "http://www.newsday.com/sports", "section_title": "NY Sports News - Newsday - Scores, Schedules, News &amp; Standings | Newsday", "url": "http://www.newsday.com/sports/columnists/bob-glauber/nfl-week-4-hot-reads-extra-points-causing-more-drama-this-season-1.10918140", "country": "US", "title": "NFL Week 4 hot reads: Extra points causing more drama this season", "performance_score": 0, "site": "newsday.com", "participants_count": 1, "title_full": "NFL Week 4 hot reads: Extra points causing more drama this season | Newsday", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T06:16:00.000+03:00", "replies_count": 0, "uuid": "263d9441e6abd47951f493743b1d1d6b60334689"}, "author": "BOB GLAUBER", "url": "http://www.newsday.com/sports/columnists/bob-glauber/nfl-week-4-hot-reads-extra-points-causing-more-drama-this-season-1.10918140", "ord_in_thread": 0, "title": "NFL Week 4 hot reads: Extra points causing more drama this season", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bob Glauber Glauber has been Newsday's national football columnist since 1992. He was Newsday's football writer covering the Jets and\nemail twitter A play that once was considered automatic is suddenly creating plenty of uncertainty -- and drama -- in the NFL this season. Surely with more to come.\nThe NFL changed the rules regarding the PAT kick, moving the spot of the snap back from the 2-yard line to the 15. So instead of a 20-yard extra-point, it's now a 33-yarder. And kickers are already feeling the effects.\nLatest columns Glauber: Gailey a big fan of Brandon Marshall Glauber: Cruz's 99-yard TD still haunts Rex Glauber: Lorenzo Mauldin a very fortunate Jet Glauber: Fitzpatrick should remain QB Glauber: Jets beating Eagles in rebuild Through three weeks, kickers have missed 13 PATs. That's more than the entire total of missed kicks from last season, when only eight PATs were missed.\nStory Jets won't use jet lag as excuse in London Story Victor Cruz gets platelet-rich plasma injection Some kickers complain that they're being penalized for being too accurate in the past, but Josh Brown of the Giants isn't one of them.\n\"The idea [from some kickers] is that it's almost a punishment for being really good at your job,\" Brown said. \"That's not mine.\"\nBrown said the longer PAT kick is actually a good thing. At least for the league's better kickers.\n\"I think it raises our value,\" said Brown, who has missed only two of 394 extra-point kicks in his career and is 7-for-7 from the longer distance this season. \"Those are valuable points at 33 yards now. It's not as easy, and we've seen guys already missing.\"\nBrown said the PAT kick becomes all the more challenging in colder weather.\n\"Especially for the guys who are going to get November and December weather in parts of the country, it's big,\" he said. \"You're going to have to focus and hit a good ball.\"\nEven though he hasn't missed a longer PAT yet, Brown has noticed a distinct change in his mental approach.\n\"First of all, defenses can score [off a blocked PAT], so for kickers in general, you just have to be very mindful of the moment, not take it off. The old PAT from the 2, you could almost do it blindfolded. But you can't do that now. You have to really pay attention to what you're doing. There's going to be a bigger rush coming because the defense can score.\"\nBroncos hot, Peyton not\nThat Peyton Manning's Broncos are off to a strong start is not unusual in the last. After all, Manning has led his teams to a 4-0 start a record six times in his career, and a win over the Vikings at home Sunday will extend that remarkable streak.\nBut it's the way the Broncos are winning that makes this year's quick start different. Manning is struggling to find his groove in first-year coach Gary Kubiak's offense, and he hasn't played particularly well. With five touchdown passes and three interceptions, Manning is on pace to throw 27 touchdowns. He hasn't thrown that few scoring passes since 2008, when he had 27 TDs with the Colts. And he might have had more that year, but rested for most of the final game because the Colts couldn't improve their playoff position.\nIt's the Denver defense that is giving Manning some relief as he works to get more comfortable with Kubiak's system. Just as John Elway benefited from having a strong running game his last two seasons with the Broncos, both of which ended with Super Bowl wins, Manning is finally getting help from a position other than himself.\nThe Denver defense has been terrific so far, with DeMarcus Ware, winner of the AFC's defensive player of the month for September, and Von Miller providing consistent pressure on the quarterback and Aqib Talib playing brilliantly at cornerback.\nCredit longtime defensive coordinator Wade Phillips, the former Broncos head coach, for quickly molding his unit into the league's top-ranked defense. Taking over for Jack Del Rio, now the head coach in Oakland, Phillips' 3-4 defense has paid immediate dividends. The Broncos are the NFL's top-ranked defense, allowing just 259.0 yards per game and just 16.3 points per game. Denver ranks second in the NFL with 10 takeaways.\nAnd though Manning is usually the one leading game-winning drives, it's the defense that has taken over in that department. Talib's 51-yard interception return for a touchdown was the winning score in Week 1 over the Ravens and Bradley Roby's 21-yard fumble return for a touchdown was the winning margin in Week 2 over the Chiefs.\nJulio Jones, by the numbers Had to do a double-take the other day looking at receiving stats. No, that was no misprint. Atlanta's Julio Jones really does have 34 catches and 440 receiving yards in just three games. Turns out those numbers are historically prolific. No one else in NFL history has had more catches through his first three games. And if Jones gets at least seven catches Sunday against the Texans, he would break Wes Welker's record for most catches through the first four games of a season (40).\nLife after Fred Jackson\nMany Bills fans were upset the team released popular running back Fred Jackson, but it turns out there was a logical reason for his ouster. That reason is Karlos Williams.\nThe Bills needed a capable backup for LeSean McCoy, who was traded from the Eagles in the offseason. But the combination of Jackson's age (34) and salary-cap number ($2.5 million for 2015), plus the team's drafting of Williams in the fifth round out of Florida State led to Jackson's release.\nThe decision was difficult, but it was also the right one. Williams has been a fine complement to McCoy, rushing for 186 yards and three touchdowns on 24 carries. In last week's win over the Dolphins, Williams led the Bills with 110 yards and a touchdown. And with McCoy's hamstring acting up, the Giants will be seeing plenty of Williams in Sunday's game at Ralph Wilson Stadium. McCoy will not play.\nJackson, meanwhile, has seen only spot duty after signing a one-year deal with the Seahawks. He has just five carries for 26 yards, backing up workhorse running back Marshawn Lynch.\nAmari's the real deal\nThe Raiders were counting on Amari Cooper to make an immediate impact this season, and the No. 4 overall pick has responded. The former Alabama star leads all NFL rookies in receptions (20) and receiving yards (290).\nIf Cooper turns out to be as good as advertised -- and we think he will -- then the Raiders will have added yet another foundation player in a two-year span. Pass-rushing linebacker Khalil Mack and quarterback Derek Carr, both of whom have enjoyed strong starts for the 2-1 Raiders, were the first two picks of last year's draft.\nDa Bears? Hardly\nExpectations for the Bears were low coming into the season, but this team has been so bad in the early going that it's approaching dumpster fire status.\nAt 0-3, they have already given up 105 points. And with little hope in sight, first-year general manager Ryan Pace sure looks like he's thinking more about 2016 than the rest of the season. Pace, who traded wide receiver Brandon Marshall to the Jets in March, dealt his best pass rusher, Jared Allen, to the Panthers, and also dealt linebacker Jonathan Bostic to the Patriots.\nIt obviously doesn't help that Jay Cutler has a hamstring problem, but even Cutler can't do much with this team as constituted. Besides, in all likelihood, he'll be next to go in what looks like a major overhaul.\n ", "external_links": ["http://twitter.com/BobGlauber", "http://www.adobe.com/go/getflashplayer", "http://static.eplayer.performgroup.com/flash/js/performgroup.js", "http://images.eplayer.performgroup.com/namedImage/12637/install_flash.gif", "http://static.eplayer.performgroup.com/flash/js/swfobject.js"], "published": "2015-10-03T06:16:00.000+03:00", "crawled": "2015-10-03T06:24:15.869+03:00", "highlightTitle": ""}