{"organizations": ["FSU"], "uuid": "fec0c2134823ffc0f98d3f66882fcee39d4fe9ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tallahassee.com", "main_image": "http://www.gannett-cdn.com/-mm-/43b47f1c56a7a1dc0ca1dd77fbb4d03a2ef1efba/c=0-125-2437-1502&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/06/Tallahassee/Tallahassee/635797490831619152-FSU-Practice-2.jpg", "site_section": "http://rssfeeds.tallahassee.com/tallahassee/sports", "section_title": "Tallahassee - Sports", "url": "http://www.tallahassee.com/story/sports/college/fsu/football/2015/10/08/fsus-jimbo-fisher-5th-highest-paid-coach-college-football/73586586/", "country": "US", "title": "FSU's Jimbo Fisher is 5th highest-paid coach in college football", "performance_score": 0, "site": "tallahassee.com", "participants_count": 0, "title_full": "FSU's Jimbo Fisher is 5th highest-paid coach in college football", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T23:39:00.000+03:00", "replies_count": 0, "uuid": "fec0c2134823ffc0f98d3f66882fcee39d4fe9ad"}, "author": "", "url": "http://www.tallahassee.com/story/sports/college/fsu/football/2015/10/08/fsus-jimbo-fisher-5th-highest-paid-coach-college-football/73586586/", "ord_in_thread": 0, "title": "FSU's Jimbo Fisher is 5th highest-paid coach in college football", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Joe Rondone/Democrat", "Jimbo Fisher", "Safid Deen"], "text": "FSU's Jimbo Fisher is 5th highest-paid coach in college football Safid Deen, Democrat staff writer 4:39 p.m. EDT October 8, 2015 Jimbo Fisher watches the FSU quarterbacks throw passes during practice at the Dunlap Training Facility on Tuesday. (Photo: Joe Rondone/Democrat) 357 CONNECT 13 TWEET LINKEDIN COMMENT EMAIL MORE \nFlorida State coach Jimbo Fisher is the fifth highest-paid college football coach in the country, according to USA Today’s updated college coaches’ salaries database published Thursday. \nFisher is slated to make $5,150,000 for the 2015 season, and could make as much as $6.6 million with bonuses. \nAlabama’s Nick Saban and Michigan’s Jim Harbaugh sit atop the list at the $7 million mark followed by Ohio State’s Urban Meyer ($5.8 million) and Oklahoma’s Bob Stoops (5.4 million). \nSince 2012, Fisher is 43-3 and tied with Saban for the most wins in college football. \nFirst-year Florida coach Jim McElwain ranks 17th on the list at $3,983,359, while Miami's Al Golden, whose Hurricanes are at Florida State on Saturday, is No. 42 at $2,539,315. \nEleven of the top-20 highest-paid coaches hail from the Southeastern Conference. \nClemson's Dabo Swinney is the second highest-paid coach behind Fisher in the Atlantic Coast Conference at No. 26 with a salary of $3,300,000. \nSwinney also could make an additional $1,125,000 with bonuses. \nFisher agreed to a new 8-year extension with the Seminoles in December of 2014. At the time, 14 head coaches were getting paid more than Fisher, who made close to $3.6 million for the 2014 season. <!--iframe--> No. 1: Nick Saban, Alabama: $7,087,481. Saban’s total pay is slightly lower than it was in 2014 primarily because he reported about $55,000 less in athletically related outside income this year than he did last year. Marvin Gentry, USA TODAY Sports Fullscreen No. 2: Jim Harbaugh, Michigan: $7,004,000. The former San Francisco 49ers coach’s total includes a $2 million signing bonus. But his overall pay package does yet include the terms of a deferred-pay arrangement the parties are to discuss after the season. Rick Osentoski, USA TODAY Sports Fullscreen No. 3: Urban Meyer, Ohio State: $5,860,000. Following the Buckeyes’ national title last season, Meyer’s contract was extended by three years and his pay from the school for this season increased by nearly $1.4 million over what it was for last season. His bonus maximum also increased to $775,000 from $550,000. Peter Casey, USA TODAY Sports Fullscreen No. 4: Bob Stoops, Oklahoma: $5,400,000. As scheduled under a contract he signed in 2014, Stoops’ pay for this season rose by about $350,000 more than what it was last season. It is set to increase by $150,000 a year in the future. Mark D. Smith, USA TODAY Sports No. 5: Jimbo Fisher, Florida State: $5,150,000. Fisher received a new eight-year contract in 2015. His pay has nearly tripled since 2010, including $2.4 million in increases over the past two years. Melina Vastola, USA TODAY Sports No. 6: Charlie Strong, Texas: $5,100,270. Strong’s pay increased from last season by a previously scheduled $100,000. Brendan Maloney, USA TODAY Sports Fullscreen No. 7: Kevin Sumlin, Texas A&M: $5,000,000. Although Sumlin’s contract was restructured to include a licensing agreement related to Texas A&M’s use of his name, image and likeness on merchandise, his pay remains unchanged – and is scheduled to remain unchanged through the 2019 season. Thomas Shea, USA TODAY Sports No. 8: James Franklin, Penn State: $4,400,00. Franklin’s pay increased from last season by a previously scheduled $100,000. Matthew O'Haren, USA TODAY Sports No. 9: Les Miles, LSU: $4,388,721. Miles is making $4.3 million in basic compensation from the school for a third consecutive year. Troy Taormina, USA TODAY Sports Fullscreen No. 10: Hugh Freeze, Mississippi: Last season, Freeze led his team to its highest national ranking since 1964. He was rewarded with a $1.3 million raise that means his pay from the school has nearly tripled since 2012, when he made $1.5 million. He made $2 million in 2013 and $3 million last season. Nelson Chenault, USA TODAY Sports Fullscreen No. 11: Art Briles, Baylor: $4,236,073. Because Baylor is a private school, Briles’ total is the one reported on the university’s most recently available federal income tax returns, which cover compensation for the 2013 calendar year, including benefits and bonuses paid. Jerome Miron, USA TODAY Sports Fullscreen No. 12: Mark Richt, Georgia: $4,124,000. Richt received a two-year contract extension after last season that runs through 2019 and included an $800,000 increase in his basic pay from the school for this season and an $800,000 increase in the maximum amount of bonus money he can receive. Dale Zanine, USA TODAY Sports No. 13: Gus Malzahn, Auburn: $4,104,500. Malzahn’s move into the $4 million club was built into a contract extension he received in 2014. His pay from the school is set to keep increasing by $250,000 a year. Jason Getz, USA TODAY Sports Fullscreen No. 14: Kirk Ferentz, Iowa: $4,075,000. Now in the second half of a 10-year deal that runs through Jan. 31, 2020, Ferentz’s pay remained unchanged from 2014, but his potential bonus maximum increased by $625,000 under a contract amendment he signed in December 2014. Reese Strickland, USA TODAY Sports No. 15: Steve Spurrier, South Carolina: $4,028,600. Spurrier’s compensation from the school for this season is unchanged from last season. Jasen Vinlove, USA TODAY Sports Fullscreen No. 16: Dan Mullen, Mississippi State: $4,000,000: In the middle of last season, the Bulldogs went from unranked to No. 1. After the season, Mullen went from making $3 million with $710,000 in possible bonuses to making $4 million with $900,000 in possible bonuses. Soobum Im, USA TODAY Sports Fullscreen No. 17: Jim McElwain, Florida: $3,983,359. McElwain’s pay for his first season at Florida is inflated above its annualized rate because it covers an elongated initial contract year that began Dec. 5, 2014 and runs through Jan. 31, 2016. His pay from Colorado State last year was set at $1.5 million. Kim Klement, USA TODAY Sports Fullscreen No. 18: Bret Bielema, Arkansas: $3,960,666: On an annualized basis, Bielema’s pay rate following a contract extension is $4 million. But that rate became effective after the start of his current contract year. He is scheduled to make $4.1 million in 2016. He made $3.2 million from the school in 2014. Nelson Chenault, USA TODAY Sports Fullscreen No. 19: Gary Patterson, TCU: $3,940,026. Because TCU is a private school, Patterson’s total is the one reported on the university’s most recently available federal income tax returns, which covers compensation for the 2013 calendar year, including benefits and bonuses paid. Jesse Johnson, USA TODAY Sports Fullscreen No. 20: Gary Pinkel, Missouri: $3,768,889. On an annualized basis, Pinkel’s pay rate following a contract extension is $4.02 million. But that rate became effective after the start of his current contract year. He is set to make $4.12 million in 2016. Excluding performance bonuses, he made $3.4 million from the school in 2014. Mark Zerof, USA TODAY Sports No. 21: Mark Dantonio, Michigan State: $3,671,520. Dantonio received a $2 million, one-time longevity payment during his previous contract year. This year, his recurring annual pay from the school rose by about $50,000. Mike Carter, USA TODAY Sports No. 22: Mike Gundy, Oklahoma State: $3,650,000. Gundy’s pay increased by a previously scheduled $150,000 over what he received last season. It is set to increase by $125,000 next season. Mike Carter, USA TODAY Sports Fullscreen No. 23: Butch Jones, Tennessee: $3,633,000. Jones was another SEC coach to get a contract extension and sizable pay increase after last season, when he helped the Vols have their first winning season since 2009. He’s making $650,000 more from the school this season than he did last season. Randy Sartin, USA TODAY Sports Fullscreen No. 24: Chris Petersen, Washington: $3,402,940. Petersen’s pay for his first season with the Huskies was inflated above its annualized rate because it covered an elongated initial contract year that ran nearly 14 months. Regardless, he remains the highest-paid coach at a Pacific-12 Conference public school. Jennifer Nicholson, USA TODAY Sports No. 25: Jim Mora, UCLA: $3,350,000. Mora’s pay increased by a previously scheduled $100,000 over what he received last season. It is set to keep rising by $100,000 per season. Casey Sapio, USA TODAY Sports Fullscreen No. 26: Dabo Swinney, Clemson: $3,305,200. Swinney’s pay increased from last season’s by a previously scheduled $150,000. It is set to go up by another $150,000 in 2016, but that raise is contractually required to be $200,000 if the Tigers win the Atlantic Coast Conference championship. Joshua S. Kelly, USA TODAY Sports No. 27: Rich Rodriguez, Arizona: $3,238,844. Rodriguez picked up a one-year contract extension through May 31, 2020, after the Wildcats went 10-4 last season, including appearances in the Pacific-12 Conference championship game and the Fiesta Bowl. Casey Sapio, USA TODAY Sports Fullscreen No. 28: Mark Stoops, Kentucky: $3,263,600. Stoops passed the $3 million mark under an increase built into the contract extension he received in the middle of last season. The new deal lets him get as much as $2.775 million in bonuses in a year, including $250,000 for each win beginning with the seventh win of a season. Mark Zerof, USA TODAY Sports No. 29: Mike London, Virginia: $3,198,400. In January 2015, London triggered a one-time payment of $750,000 for completing three-plus years of a five-year contract that runs through Dec. 7, 2016. Amber Searls, USA TODAY Sports Fullscreen No. 30: Mark Helfrich, Oregon: $3,150,000. About four weeks after the Ducks played in the College Football Playoff national title game, Helfrich signed a new, five-year contract that included a $1.15 million raise over what he made last season. His bonus maximum was increased by $500,000 to $1.635 million. Mike Carter, USA TODAY Sports Fullscreen No. 31: Kliff Kingsbury, Texas Tech: $3,147,500.Kingsbury signed a new contract just before the start of the 2014 season. Between an initial raise that occurred when the deal took effect and another $500,000 jump for this season, he is now making over $1.25 million more than he was in 2013. Michael C. Johnson, USA TODAY Sports Fullscreen No. 32: Bobby Petrino. Louisville: $3,003,500. Petrino’s basic guaranteed pay is unchanged from last season. But each year, he can get an additional $500,000 if the team’s NCAA Academic Progress Rate (APR) figure is 935 or above – which was the case in 2014. Jason Getz, USA TODAY Sports Fullscreen No. 33: Todd Graham, Arizona State: $3,002,960. Graham became the $3 million club’s newest in mid-September, when the Arizona Board of Regents approved a one-year extension and a raise from $2.8 million, which was $100,000 more than he made last season. Graham also can get more than $3.7 million in bonuses. Troy Taormina, USA TODAY Sports No. 34: Bill Snyder, Kansas State: $3,000,000. A previously scheduled $100,000 raise moved Snyder up to $3 million, and he is set for future $100,000 annual increases. Scott Sewell, USA TODAY Sports No. 35: Dana Holgorsen, West Virginia: $2,880,000: Holgorsen went above $3 million last season, when he received a one-time retention payment of $300,000. Charles LeClaire, USA TODAY Sports Like this topic? You may also like these photo galleries: Replay", "external_links": [], "published": "2015-10-08T23:39:00.000+03:00", "crawled": "2015-10-09T14:58:59.462+03:00", "highlightTitle": ""}