{"organizations": [], "uuid": "eb8f1f03a4c6dde9805a026a1259cefd3e4925eb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.northjersey.com", "main_image": "http://www.northjersey.com:80/polopoly_fs/1.1437035!/fileImage/httpImage/102115klap.JPG", "site_section": "http://www.northjersey.com/cmlink/sports-rss.rss#", "section_title": "Sports News on NorthJersey.com", "url": "http://www.northjersey.com/sports/mets-move-closer-to-fall-classic-with-5-2-win-over-cubs-1.1437034", "country": "US", "title": "Mets move closer to Fall Classic with 5-2 win over Cubs - Sports", "performance_score": 0, "site": "northjersey.com", "participants_count": 1, "title_full": "Mets move closer to Fall Classic with 5-2 win over Cubs - Sports - NorthJersey.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:23:00.000+03:00", "replies_count": 0, "uuid": "eb8f1f03a4c6dde9805a026a1259cefd3e4925eb"}, "author": "MATT EHALT", "url": "http://www.northjersey.com/sports/mets-move-closer-to-fall-classic-with-5-2-win-over-cubs-1.1437034", "ord_in_thread": 0, "title": "Mets move closer to Fall Classic with 5-2 win over Cubs - Sports", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Buy this photo ASSOCIATED PRESS Daniel Murphy, who homered for a fifth straight game, is pumped after scoring a run in the seventh for the Mets. CHICAGO – The ball scooted through Miguel Montero’s legs, and Yoenis Cespedes raced home to once again give the Mets a lead in Game 3 of the NLCS.\nWhat could have been an inning-ending strikeout turned into the deciding run and one inning later, the Mets  capitalized on Cubs mistakes to tack on two more insurance runs.\nJeurys Familia mowed down the Cubs in the ninth to wrap up a 5-2 win Tuesday night at Wrigley Field and a commanding 3-0 series lead, moving the Mets on the brink of their first World Series appearance since 2000.\nSteven Matz gets the start tonight as the Mets try to close out the series sweep.\nCespedes had two RBI and Daniel Murphy set the franchise mark with his sixth postseason homer, becoming the second player to homer in five straight playoff games.\nJacob deGrom remained undefeated in the playoffs with seven innings of two-run ball.\nThe Mets took the lead for good in the sixth but they needed some good fortune to get it done.\nWith a runner at third and two outs, Michael Conforto struck out on a Trevor Cahill breaking pitch that got past  Montero \nplating Cespedes with a gift run.. Cespedes had stolen third base with one out to put himself 90 feet away.\nWhile they received a favorable bounce on that play, the Mets were unlucky one batter later when the Wrigley Field ground rules prevented a larger inning.\nWilmer Flores hit a sinking liner to right that Jorge Soler dived at, but the ball bounced in front of him and rolled to the wall.\nConforto was running on the play and would have scored easily, but the ball rolled under the ivy. Runners can only advance two bases, so Conforto’s sure run was wiped off the board.\nMets manager Terry Collins argued the ruling to no avail. DeGrom flied out to left to strand two runners in scoring position.\nOne inning later, the Mets added a pair again by capitalizing on mistakes by the Cubs.\nWith a runner at second and one out, Murphy hit a grounder to third that Kris Bryant double-clutched, and that extra second allowed Murphy to reach on an infield single.\nCespedes followed with a liner to Kyle Schwarber in left, but the rookie misplayed the rocket and it careened off his glove for an RBI single that gave the Mets a 4-2 lead.\nOne batter later, Lucas Duda grounded to first, and Anthony Rizzo opted to touch the bag instead of firing home right away. That brief moment of hesitation provided the extra second Murphy needed to score from third for a 5-2 advantage.\nAll of those runs came against the Cubs’ bullpen, forced into the game early when the Mets knocked out Cubs starter Kyle Hendricks after four innings.\nCespedes recorded an RBI double in the first for a 1-0 lead, and the Mets took a 2-1 lead when Murphy hit a booming homer to center in the third.\nMurphy became just the second player to homer in five straight postseason games – joining Carlos Beltran (2004), and needed just eight games to set the franchise mark for most postseason homers. Murphy broke a tie with Mets legend Mike Piazza, who homered five times in 22 postseason games from 1999-2000.\nThe late rally made a winner of deGrom, who rebounded for the second straight start from a rocky first inning to limit the Cubs to four hits, two of which were homers.\nIn a 29-pitch first inning, deGrom allowed three hits, including a homer to Schwarber that evened the game at 1-all. He stranded two to end the inning.\nIn his next six innings, deGrom allowed just one hit – a solo homer to Soler – that evened the game at 2-all.\nDeGrom retired the last 11 batters he faced, and just two of the final 21 Cubs batters reached base against him, and he struck out seven while walking one.", "external_links": [], "published": "2015-10-21T03:23:00.000+03:00", "crawled": "2015-10-21T07:32:50.385+03:00", "highlightTitle": ""}