{"organizations": [], "uuid": "c38327d3d207e20971a53d7a1833154fad815cf6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.palmbeachpost.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/12/c3/4d/092715-spt-dolphins-ae-025.jpg", "site_section": "http://www.palmbeachpost.com/s/sports/", "section_title": "Sports: Dolphins, High Schools, Hurricanes, Marlins, Heat, FAU | www.palmbeachpost.com", "url": "http://www.palmbeachpost.com/news/sports/football/parker-appears-ready-to-start-contributing-to-dolp/nnz9L/", "country": "US", "title": "Healed Dolphins 1st-round pick DeVante Parker: 'I'm ready to go'", "performance_score": 0, "site": "palmbeachpost.com", "participants_count": 1, "title_full": "Healed Dolphins 1st-round pick DeVante Parker: 'I'm ready to go' | www.palmbeachpost.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T00:55:00.000+03:00", "replies_count": 0, "uuid": "c38327d3d207e20971a53d7a1833154fad815cf6"}, "author": "Hal Habib", "url": "http://www.palmbeachpost.com/news/sports/football/parker-appears-ready-to-start-contributing-to-dolp/nnz9L/", "ord_in_thread": 0, "title": "Healed Dolphins 1st-round pick DeVante Parker: 'I'm ready to go'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "No one should be surprised that Jarvis Landry is the Dolphins’ leading receiver. But good luck computing what the odds would have been that at the season’s quarter mark, running back Damien Williams and tight end Jake Stoneburner would have more receptions than first-round pick DeVante Parker.\nParker has four catches for 49 yards, in part because he has been recovering from off-season foot surgery. With the Dolphins having a bye last weekend, it’s logical to wonder if this might be when Parker begins to show why the Dolphins made such an investment in him.\nAllen Eyestone Miami Dolphins wide receiver DeVante Parker (11) makes a catch between Buffalo Bills cornerback Ronald Darby (28) and Buffalo Bills free safety Corey Graham (20) at Sun Life Stadium in Miami Gardens, Florida on September 27, 2015. (Allen Eyestone / The Palm Beach Post) “I’m ready to go,” Parker said Monday. “Whenever they give me a chance, I just have to make plays.”\nParker said his foot no longer is holding him back. During the portion of practice open to the media, he ran crisp routes at what appeared to be full speed.\n“I feel like I’m 100 percent,” he said.\nParker hadn’t been able to say that since OTAs, when he stood out virtually daily. The media saw it. Fans have not, because once they were invited to training camp, Parker was out, rehabilitating his foot.\nThings hardly changed when the regular season began. Parker played one snap in the opener against Washington. He caught one pass for 3 yards against Jacksonville. In his best game, he was targeted seven times and caught three passes for 46 yards against Buffalo, playing a career-high 42 snaps. But he played only 23 snaps against the New York Jets and was not targeted.\nParker acknowledged his confidence was high during OTAs and that surgery “pushed me back a little bit.” He now says, “I just want to show them what I can do.”\nThe Dolphins could use a lift. They rank 28th in total offense and 15th in passing.\nLandry believes Parker could be on the cusp of a breakout.\n“For me, it’s just seeing his growth, seeing the way he’s accepting coaching and seeing the way that he’s allowed to take his time to mature and really become a player,” Landry said. “Having him out there full time now, hopefully that makes a difference for us.”\nMapquest needed: Safety Michael Thomas didn’t go out of town during the bye. He instead stopped by camp Saturday, so he was among the first to learn that his locker no longer was his locker. Interim coach Dan Campbell rearranged locker assignments, grouping players by position, so Thomas wound up moving across the room. He now counts safeties Jordan Kovacs and Reshad Jones as neighbors, with cornerback Brent Grimes two stalls away.\n“I’m with some big-money guys, so I think my value increased a little bit,” said Thomas, who two years ago was added off San Francisco’s practice squad.\nAlbert healing? Left tackle Branden Albert, who missed the past two games with a hamstring problem that he suspects was a side effect from rehab following last year’s knee surgery, could be back Sunday at Tennessee. With the bye, he effectively would have had a month to heal.\n“I’m doing good,” he said.\nCornerback Brent Grimes, who injured a knee against the Jets, was off on the side during the media portion of practice.\n“I thought they looked good today,” Campbell said of Albert and Grimes. “Albert did a little bit of work today. He’s getting better every time he steps out there. And Grimes, he’s a vet, and we’ll see how he looks. He was out there and ran a little bit today.”\nMcCain on Campbell: Second-year linebacker Chris McCain was asked if he thought he might see more than just spot duty under Campbell.\n“I don’t know,” he said. “I don’t even care, man. Coach Campbell came, he just brings a new intensity, a different mind-set, to the game. He’s all about us. He’s all for the players and he understands us.\n“I’m pretty sure it’s still a numbers game. It all depends on what they need for the week and what-not. If I get more reps, good. If not, so be it.”", "external_links": ["http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/10/12/c3/4d/092715-spt-dolphins-ae-025.jpg"], "published": "2015-10-13T00:55:00.000+03:00", "crawled": "2015-10-13T06:31:26.001+03:00", "highlightTitle": ""}