{"organizations": [], "uuid": "dfd5076a06a0e82f5381455c5ca214ddfd672207", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonpost.com", "main_image": "http://img.washingtonpost.com/rf/image_908w/2010-2019/Wires/Images/2015-10-11/AP/Bears_Chiefs_Football-05d24.jpg", "site_section": "http://www.washingtonpost.com/rss/sports", "section_title": "Sports", "url": "https://www.washingtonpost.com/news/early-lead/wp/2015/10/12/chiefs-confirm-that-jamaal-charles-has-a-torn-acl-ending-his-season/", "country": "US", "title": "Chiefs confirm that Jamaal Charles has a torn ACL, ending his season", "performance_score": 0, "site": "washingtonpost.com", "participants_count": 1, "title_full": "Chiefs confirm that Jamaal Charles has a torn ACL, ending his season", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T02:36:00.000+03:00", "replies_count": 0, "uuid": "dfd5076a06a0e82f5381455c5ca214ddfd672207"}, "author": "Des Bieler", "url": "https://www.washingtonpost.com/news/early-lead/wp/2015/10/12/chiefs-confirm-that-jamaal-charles-has-a-torn-acl-ending-his-season/", "ord_in_thread": 0, "title": "Chiefs confirm that Jamaal Charles has a torn ACL, ending his season", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Chiefs confirm that Jamaal Charles has a torn ACL, ending his season Resize Text By Des Bieler October 12 at 7:16 PM Follow @DesBieler The Post's fantasy football experts, Gene Wang and Des Bieler, discuss the major takeaways from Week 5 including Jamaal Charles, Calvin Johnson, Aaron Rodgers, Blake Bortles and waiver wire options. (Thomas Johnson/The Washington Post) \nThe news that every Chiefs fan dreaded to hear arrived Monday afternoon: Jamaal Charles has a torn ACL. The injury ends the season for Kansas City’s star running back. UPDATE: The MRI has confirmed that Jamaal Charles has a torn ACL. \n[ How to replace Jamaal Charles on your fantasy football team ] \nCharles was injured during the Chiefs 18-17 loss to the Bears Sunday, when he planted his right leg to make a cut. The non-contact nature of the incident left many observers fearing the worst. Jamaal Charles is out for the remainder of today's game with a knee injury after this play. #CHIvsKC http://t.co/SI2WVXcx8C \n— NFL (@NFL) October 11, 2015 \nThe loss of Charles is a huge blow to the Chiefs, who are already reeling from a 1-4 start that has all but dashed their playoff hopes. The four-time Pro Bowler was the team’s offensive focal point, a threat to score from anywhere on the field, either on a running or receiving play. Over the last 3 seasons, no player has gotten into the end zone more frequently than Jamaal Charles pic.twitter.com/KJ89FTkwFC \n— ESPN Stats & Info (@ESPNStatsInfo) October 11, 2015 Jamaal Charles is all-time leader in yards per rush among players with 1,000+ rush attempts: J. Charles 5.5 Jim Brown 5.2 Barry Sanders 5.2 \n— Adam Schefter (@AdamSchefter) October 11, 2015 \nAfter the news broke on Monday, Charles tweeted out his belief that the injury represents a “minor set back.” \nThe running back’s confidence in a healthy return stems in large part from the fact that he has been down this road before. In 2011, Charles tore the ACL in his left knee just two games into the season; he returned in 2012 and posted 1,745 yards from scrimmage. \nHowever, Charles turns 29 this December, an age at which most running backs, regardless of overall health, are in career decline. At a listed 5-11, 199 pounds, the Chiefs star is small by NFL standards and reliant on exceptional agility and speed (as well as vision). \n[ Watch Jamaal Charles deliver a touching speech at the Special Olympics ] \nWith Charles done for this season, the Chiefs will turn to the running backs they have on hand, and they are reportedly looking at free-agent veterans such as Ben Tate and Pierre Thomas. After Charles left Sunday’s game, backup Charcandrick West received the bulk of the work, with Knile Davis and De’Anthony Thomas mixed in. Des writes for the Early Lead and the D.C. Sports Bog, scouring the Web to bring readers items of interest, both serious and amusing. He also covers fantasy football, as well as fitness topics for the MisFits. sports Success! Check your inbox for details. You might also like: Please enter a valid email address Sign Up", "external_links": [], "published": "2015-10-13T02:36:00.000+03:00", "crawled": "2015-10-13T02:40:04.208+03:00", "highlightTitle": ""}