{"organizations": [], "uuid": "8daff663287120b7775df65b162f237c0db39dfc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pr.com", "main_image": "", "site_section": "http://www.pr.com/news-by-category/152", "section_title": "Sports: Baseball Press Releases and News - PR.com", "url": "http://www.pr.com/press-release/642754", "country": "US", "title": "Akadema Unveils Its New All Black Gator Series Baseball Gloves", "performance_score": 0, "site": "pr.com", "participants_count": 1, "title_full": "Akadema Unveils Its New All Black Gator Series Baseball Gloves - PR.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "8daff663287120b7775df65b162f237c0db39dfc"}, "author": "PR.com", "url": "http://www.pr.com/press-release/642754", "ord_in_thread": 0, "title": "Akadema Unveils Its New All Black Gator Series Baseball Gloves", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Akadema Unveils Its New All Black Gator Series Baseball Gloves\nThe new Gator series baseball gloves are made with top of the line leather and a tough gator skin look that makes it look sharp wit the new all black design.\nHawthorne, NJ, October 22, 2015 --( PR.com )-- Akadema’s newest gloves, The Gator Series, will be released and available for purchase for the holiday season. This new top of the line glove has turned many heads around the industry already. This new series, somewhat similar to the old Gator models, has an all-new redefined look. The all black Torino leather with the Gator skin gives this brand new series of gloves a new meaning of toughness. The Gator series gloves come in 11.5”, 11.75”, and 12.75”, as well as a catchers mitt. Each glove comes with specific webbing either in the traditional I-web or H-web. This series of gloves are perfect for any infielder, pitcher, catcher, and outfielder at any level. Pro quality leather that is easy to break in, and will last for many seasons of play.\nAbout Akadema: Akadema is the world’s most exciting baseball and softball equipment company. In its short history, Akadema has become the hottest baseball and softball equipment company for professional, college, high school and serious youth players. Akadema attributes their increase in market share to their innovative quality professional product line, which is contrast to mass production products that have little to do with quality or feel. Akadema has long stood for high quality and performance and wants you to Bring Your \"A\" Game. Akadema comes highly endorsed by MLB players like: Manny Ramirez, Shane Victorino, Cameron Maybin, Ross Ohlendorf, Vin Mazzaro, Brad Ziegler, Craig Breslow, David Murphy, Brandon McCarthy, Derek Holland, Jose Guillen and many others as well as Senior Advisors and MLB Hall of Famers Gary Carter and Carl Yastrzemski.\nContact:\nAkadema Inc.\n140 5th Avenue\nHawthorne, NJ 07506\nPhone: 973-304-1470\nFax: 973-636-6375\nwww.akademapro.com", "external_links": [], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-22T11:43:50.343+03:00", "highlightTitle": ""}