{"organizations": [], "uuid": "447789fc804a6191f2c43c4b59f03722aad842be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dallasnews.com", "main_image": "http://www.dallasnews.com/incoming/20151005-collegesportsblog_files_2013_11_stoops1.jpg.ece/BINARY/original/collegesportsblog_files_2013_11_Stoops1.jpg", "site_section": "http://www.dallasnews.com/sports/college-sports/oklahoma-sooners/", "section_title": "Oklahoma Sooners News - Sports News for Dallas, Texas ", "url": "http://www.dallasnews.com/sports/college-sports/headlines/20151005-bob-stoops-wants-oklahoma-to-cut-down-on-penalties.ece", "country": "US", "title": "Bob Stoops wants Oklahoma to cut down on penalties", "performance_score": 0, "site": "dallasnews.com", "participants_count": 1, "title_full": "Bob Stoops wants Oklahoma to cut down on penalties | Dallas Morning News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T02:30:00.000+03:00", "replies_count": 0, "uuid": "447789fc804a6191f2c43c4b59f03722aad842be"}, "author": "Kate Hairopoulos", "url": "http://www.dallasnews.com/sports/college-sports/headlines/20151005-bob-stoops-wants-oklahoma-to-cut-down-on-penalties.ece", "ord_in_thread": 0, "title": "Bob Stoops wants Oklahoma to cut down on penalties", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NORMAN, Okla. -- Oklahoma senior receiver Sterling Shepard could picture what coach Bob Stoops would do if he found a Sooner tweeting on his cellphone during halftime of a game.\n\"He'll probably take it and snap it,\" Shepard surmised.\n\"Probably a fair assessment,\" Stoops agreed later.\nIt was a topic of conversation Monday because Texas cornerback Kris Boyd retweeted a suggestion by a Texas A&M fan that he transfer during last Saturday's 50-7 loss at TCU. Boyd has since issued an apology.\nThe No. 10 Sooners and Longhorns meet for the 110th time Saturday at Fair Park's Cotton Bowl.\nStoops said he didn't previously have an in-game cellphone policy, but that the topic would be addressed with the team.\nHe said he finds it \"foolish\" if his players are reading social media comments from fans of other programs. But his only main concern, he said, is that players aren't sharing any sort of team information.\n\"Because then it's like you just held your own press conference,\" Stoops said. \"If you want to tell everyone you're at the grocery store picking up Twinkies, have at it. If you're telling what's happening in our building, now it's a problem.\"\nKicker search: Texas coach Charlie Strong said he planned to open up competition for the kicker job.\nSenior Nick Rose had a key missed extra point against California and was off target on field goal attempts of 39 and 40 yards against TCU. He is 4 of 7 on field goal tries this season. Strong informed Rose of his decision this past weekend.\nJunior Nick Jordan, who connected on 9 of 15 as a freshman in 2012, is listed behind Rose on the depth chart.\nFlag days: Oklahoma racked up 12 penalties for 134 yards in a sometimes chippy 44-24 win last week over West Virginia.\nThe Sooners have been flagged for at least eight penalties in each of their four games. They rank next-to-worst in the Big 12, averaging 94 yards of penalties a game.\n\"I'm still really angry at our team, disappointed at our lack of discipline,\" Stoops said.\nThomas makes big return from suspension: Sophomore cornerback Jordan Thomas intercepted two passes for 61 yards and broke up another pass against West Virginia. He made the plays in his return from a one-game suspension for undisclosed violation of team rules. Thomas earned OU player of the week honors, a rarity, Stoops said, immediately following a suspension. OU forced five West Virginia turnovers.\nDeep-fried celebration: It's not the main motivator for OU to win the annual Red River game, of course. But if the Sooners do win, as they have four of the last five seasons, they may get to spend a little time enjoying the State Fair that surrounds the Cotton Bowl after the game.\nSenior center Ty Darlington has previously tried the fried cheesecake and fried bacon-wrapped cinnamon roll.\n\"If you lose, you don't go to the Fair. You get back on the bus and go back to Norman,\" Darlington said. \"I might go really fat and try fried butter this year, if we can make it happen.\"\nAdvice for Strong: Former Texas coach John Mackovic said he expects Strong to continue to evaluate his team during an interview with Austin's 104.9-FM The Horn.\n\"And I think Charlie Strong will look throughout the year on a regular basis and especially at the end of the season and say, 'OK, we need to make some adjustments to what we believed was the case when we came here,'\" Mackovic said. \"I believe he's a good enough coach to do that, and he will do that.\"\nInjury update: OU junior Stanvon Taylor (foot), a backup cornerback and special teams contributor, will miss Saturday's game, Stoops said.\nUT receiver/returner Daje Johnson will be evaluated daily after suffering a head injury against TCU in the first quarter. He left and did not return.\n\"We're not going to put him out there unless he's ready to go,\" Strong said.\nStrong said offensive lineman Kent Perkins (knee) remains day-to-day, while he expected defensive end Shiro Davis (knee) to return to practice later this week. Neither played against TCU.\nBig 12 writer Chuck Carlton contributed to this report.\nOn Twitter:\n @kHairopoulos", "external_links": ["https://twitter.com/kHairopoulos"], "published": "2015-10-06T02:30:00.000+03:00", "crawled": "2015-10-19T06:14:52.614+03:00", "highlightTitle": ""}