{"organizations": [], "uuid": "9822a13905a085c079ef52f1ecb25be0b15f82e9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.baltimoresun.com", "main_image": "http://www.trbimg.com/img-562a9b11/turbine/ph-cc-sp-terps-jake-funk-1024-20151023", "site_section": "http://www.baltimoresun.com/sports/rss2.0.xml", "section_title": "Sports - Baltimore Sun", "url": "http://www.baltimoresun.com/sports/ph-cc-sp-terps-jake-funk-1024-20151023-story.html", "country": "US", "title": "Damascus' Jake Funk becomes latest to join 'The Movement' at Maryland", "performance_score": 0, "site": "baltimoresun.com", "participants_count": 1, "title_full": "Damascus' Jake Funk becomes latest to join 'The Movement' at Maryland", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T23:31:00.000+03:00", "replies_count": 0, "uuid": "9822a13905a085c079ef52f1ecb25be0b15f82e9"}, "author": "Daniel Gallen", "url": "http://www.baltimoresun.com/sports/ph-cc-sp-terps-jake-funk-1024-20151023-story.html", "ord_in_thread": 0, "title": "Damascus' Jake Funk becomes latest to join 'The Movement' at Maryland", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Damascus' Jake Funk becomes latest to join 'The Movement' at Maryland Terps coach Locksley on preparing for Penn State \nTerps football coach Mike Locksley talks about his teams different approach to the season. \"There's no pressure on us, we have nothing to lose,\" said coach Mike Locksley to his players about Saturday's game. (Kevin Richardson) \nTerps football coach Mike Locksley talks about his teams different approach to the season. \"There's no pressure on us, we have nothing to lose,\" said coach Mike Locksley to his players about Saturday's game. (Kevin Richardson) Daniel Gallen Contact Reporter Carroll County Times Damascus running back Jake Funk was Maryland's first commit under Mike Locksley. \nJake Funk had been developing through his entire career at Damascus, putting up eye-catching numbers at running back as the Swarmin' Hornets racked up wins and marched through the playoffs, but the attention he was receiving from colleges didn't match the level he thought he was capable of playing. \nHe hit the midway point of his senior season with an offer to play linebacker from Wisconsin, offers from the three service academies and offers from other low-level Football Bowl Subdivision schools, plus some from Football Championship Subdivision schools. \nBut then Maryland got involved, and things started moving faster. And on Oct. 14, the three-star recruit became Maryland's first commitment for the Class of 2016 under interim coach Mike Locksley. \n\"I definitely was hoping that they would [offer me],\" Funk said. \"Them being the hometown school meant a lot to me. Them playing in the Big Ten made it an easier decision on me, too, because I come from a Big Ten family. It just felt right, so I decided to commit sooner than later.\" \nOn Oct. 12, Maryland running backs coach Terry Richardson attended a Damascus practice. The next day, the Terps offered him a scholarship. Funk talked things over with his family — his dad played football at Penn State and his older brother played lacrosse at Ohio State — and made the decision to commit. Funk didn't announce his decision until Oct. 16 because Damascus had a game the night before and he didn't want to be inundated with well-wishes while trying to prepare.", "external_links": [], "published": "2015-10-23T23:31:00.000+03:00", "crawled": "2015-10-24T02:21:38.914+03:00", "highlightTitle": ""}