{"organizations": ["Wolverines", "U-M", "Spartans", "NW", "OSU", "MSU"], "uuid": "af4ca82a0eac1d2f55a2ace1fb51c00cd200618d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "live.freep.com", "main_image": "http://avatars.scribblelive.com/2012/2/2/8c78bf69-f967-4078-8834-bff46eaa3a13.jpg", "site_section": "http://rssfeeds.freep.com/freep/sports", "section_title": "Detroit Free Press - Sports", "url": "http://live.freep.com/Event/Chat_with_Wolverines_writer_Mark_Snyder_22", "country": "US", "title": "Live: Chat with Wolverines writer Mark Snyder", "performance_score": 0, "site": "freep.com", "participants_count": 0, "title_full": "Live: Chat with Wolverines writer Mark Snyder", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T17:59:00.000+03:00", "replies_count": 0, "uuid": "af4ca82a0eac1d2f55a2ace1fb51c00cd200618d"}, "author": "", "url": "http://live.freep.com/Event/Chat_with_Wolverines_writer_Mark_Snyder_22", "ord_in_thread": 0, "title": "Live: Chat with Wolverines writer Mark Snyder", "locations": ["Caroo", "Maryland", "Michigan"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Joe Bolden", "Harbaugh", "Dan", "Rudock", "Smith", "John O'Korn", "Drew Sharp", "Jacque Strappe", "Greg", "Desmond Morgan", "Desmond Woodson", "Mike", "Carty Finkbeiner", "Mark Snyder Mark", "Joe", "James Ross", "Ross", "Higdon", "Jake", "Mark", "Chris Tag", "Narduzzi", "Johnny", "Bob", "Mike Fitzgerald", "Stribling", "Hoke", "Drake Johnson", "Trae Waynes", "Channing Stribling", "Mark Snyder", "Ben Gedeon", "Chris", "RunTheBall", "Kahle", "Lucas", "Paul Bunyan", "Chesson", "Deveon", "Cook"], "text": "Mark, what is the biggest difference between Harbaugh and Hoke that you've seen so far? by Lucas 10/16/2015 3:28:36 PM I don't really get into the polls because I feel they're flawed, not have a set criteria. But I know you're all interested so we continue to write about them. If you beat the No. 7 team, I'd guess they'd take MSU spot. Somewhere around there. by Mark Snyder 10/16/2015 3:28:34 PM If Michigan wins big tomorrow (more than 1 TD), where do you see them landing in next week's polls? by Desmond Woodson 10/16/2015 3:27:13 PM Probably not significant. He has rotated onto the field but with U-M playing so many defensive backs, he's playing less than previous years with Joe Bolden and especially Desmond Morgan getting more time. Ben Gedeon's role has increased already. by Mark Snyder 10/16/2015 3:26:52 PM impact of James Ross suspension? by Carty Finkbeiner 10/16/2015 3:25:47 PM The fact that he visited while still committed to the Buckeyes and reportedly enjoyed the trip makes the chances sound decent. by Mark Snyder 10/16/2015 3:25:42 PM What are you hearing about the chances of Michigan landing the 2016 #1 RB who is a current verbal commit to OSU? by Mike 10/16/2015 3:25:15 PM Overrated may not be the best word. I'd say more that it hasn't arrived and has a better chance to prove itself on Saturday. Even then, it may not be totally convincing because of the Spartans' inconsistency on offense. But if MSU plays at its peak, it'll be a telling matchup. by Mark Snyder 10/16/2015 3:25:12 PM The last three shutouts can be explained as follows: BYU - undersized players; Maryland - worst B1G team, yet U of M only scored 6 points in the first half; and NW - mostly running game with a young QB. Could this defense be overrated against a team like MSU? by Mork 10/16/2015 3:23:45 PM There are some track photos that my parents have in the basement and they were sketched I was so slow. by Mark Snyder 10/16/2015 3:23:37 PM Mark---What was your fastest time running the 100 meters OR the 40 back in the day? by RunTheBall 10/16/2015 3:22:53 PM I saw him cut and move differently than any other back on the roster with his burst. That's why he's playing, to give a different dimension, even if it's only a few carries per game. by Mark Snyder 10/16/2015 3:22:50 PM What is your first impression of Higdon from last week. I saw a nice combination of power and speed. He was hit in the backfield and powered for a 1 yd gain and had a nice slip move for a quick 8 yds. by Jacque Strappe 10/16/2015 3:22:16 PM The Ross one? Questionable, but understandable. If the goal is to protect the players, it has to be called. Him missing the first half this week seems like an odd part of the rule. by Mark Snyder 10/16/2015 3:22:14 PM The dual hits on Rudock created an interesting situation. The first hit, the one that was flagged and reversed, could be understandable why it was reversed, because it was more of a glancing blow. The second hit looked like a targeting but the first one was the one flagged and therefore the only one reviewed. My understanding was they couldn't address the hit they didn't flag. by Mark Snyder 10/16/2015 3:20:55 PM What was your take on the two \"targeting\" calls last week? by Mike 10/16/2015 3:18:59 PM They said they wanted to protect Smith and that's why he was pulled out. We saw him after the game and he didn't have any noticeable issues. by Mark Snyder 10/16/2015 3:18:52 PM Deveon left the game in the third quarter limping, favoring his other ankle. Is he hurt again? by Mike 10/16/2015 3:18:11 PM We've heard he's very versatile acting as the scout team quarterback, simulating the other team's QB. That means he can move but also has a strong arm. How he adapts to the offense and whether he can make the decisions that Rudock does -- the coaches put a lot on his plate when plays come into the game -- will be the interesting part with O'Korn. by Mark Snyder 10/16/2015 3:18:03 PM Mark, I hear a lot bout the transfer QB we got in John O'Korn. You have mentioned multiple times in these chats that you hear he might be the best QB on the roster. What specifically have you heard that makes him stand out during his year without eligibility? by Johnny 10/16/2015 3:16:16 PM Michigan's special teams have been spectacular this year, especially with Peppers in the return game. That it was Chesson who returned the kickoff for a touchdown just reinforced that it's not just Peppers creating but the blocking is improved as well. by Mark Snyder 10/16/2015 3:16:06 PM How much advantage does UM have in special teams?...MSU has given up both a punt and kickoff return for touchdowns...Could it be a Peppers PR turn this week? by RunTheBall 10/16/2015 3:15:05 PM Michigan State threw for over 360 yards last week but most of the season hasn't been anywhere near that. The Wolverines probably would like to have Cook put the ball in the air for them to make a play. Not too many teams have been able to hit anything downfield on U-M. I think the U-M front could get some pressure without blitzing. by Mark Snyder 10/16/2015 3:14:59 PM What do you see as the key for Michigan stopping the Spartan passing attack? Might we see an unusual amount of blitzing? by Dan 10/16/2015 3:13:45 PM Harbaugh said on Monday that Stribling would be returning this week. As for Drake Johnson, I don't know what the injury is but he was able to give them two carries last week, one on the goal line so knowing he'd get a ton of contact, it can't be something severe. by Mark Snyder 10/16/2015 3:13:35 PM Status on Drake Johnson and Channing Stribling heading into tomorrow? by Joe 10/16/2015 3:12:36 PM I think they're missing the NFL-caliber players lost in the secondary far more. Trae Waynes was an elite cornerback. Narduzzi surely made a difference but he didn't give up that bomb to Caroo last week or struggle to tackle someone on a 70-yard run. by Mark Snyder 10/16/2015 3:12:15 PM I know State has injuries which has slowed there D but how much do you think they are missing Narduzzi? by Fsollars 10/16/2015 3:11:16 PM No. They may not win, but I don't think there's any chance they're overlooking anything. by Mark Snyder 10/16/2015 3:11:11 PM Is it possible that Michigan may be reading and listening to the hype? And may overlook this game. by Chris Tag 10/16/2015 3:10:47 PM I know there's a lot of clamor and interest but so far it hasn't been necessary, so there's no reason for them to put him there. Maybe it would be a statement going forward, but they're far more concerned with him being ready on defense, with all his responsibilities, and in the return game. Maybe if it's late in the game and they need a spark. But just for show? I don't know about that by Mark Snyder 10/16/2015 3:10:42 PM Peppers on offense this week? by Chris 10/16/2015 3:09:20 PM They've done it to everyone else. The Michigan defense has been impressive limiting opponents' chances. Recently they haven't been tested in the red zone so it's tough to know how they'll react. by Mark Snyder 10/16/2015 3:08:30 PM Can Michigan D keep the MSU offense out of the end zone and just hold them to field goals ? by Greg 10/16/2015 3:07:00 PM They haven't won seven yet, have they? by Mark Snyder 10/16/2015 3:06:54 PM 7-5? You are the expert along with the real \"expert\" Drew Sharp. by Bob 10/16/2015 3:05:43 PM I think Harbaugh was well aware of the program's struggles over the past decade. He may not want to talk about the past but he knows what has happened. by Mark Snyder 10/16/2015 3:05:36 PM JH has already described this week as a \"trophy game\". As is the game two weeks from now. How surprised do you think he was in coming back to AA, to find both Paul Bunyan and the jug gone? Unheard of in his day. by Jleed 10/16/2015 3:04:48 PM They've pressured everyone so far, even if the sack numbers don't reflect it. U-M's success in the tackles for loss is an example of how swarming the line has been. Cook has a quick release though, so I wouldn't expect as much blitzing for fear of getting burned. by Mark Snyder 10/16/2015 3:04:28 PM Mark,Do you feel UM can pressure Cook enough to make up for.our lack of speed at the LB spot as well as secondary. And I know it sounds crazy because of their recent success, I just think we still have a athleticism problem in our back 7 on defense. by Kahle 10/16/2015 3:03:12 PM Canteen has battled injuries and in fall camp had worked at receiver and corner. U-M hasn't fed the slot receiver too much and he hasn't been in there much anyway. The tight ends and fullbacks have caught some of the shorter passing game targets. by Mark Snyder 10/16/2015 3:03:01 PM I thought that Freddie Canteen would play a greater role in the Michigan passing game this year. He's very quick and has proven that he can catch and run with the ball. What's up? by Mike Fitzgerald 10/16/2015 3:01:08 PM No, I don't think they'll go deep often. But I do think they will take a shot and probably early in the game, knowing that by hitting it, it could swing momentum. These rivalry games can change based on a big play, moreso than other weeks. by Mark Snyder 10/16/2015 3:00:40 PM It seems all year msu hasn't been great defending long pass- even wmu almost hit them twice w 35+. Jake has been just off on a couple deep routes- do you see mi going deep often? Msu defensive line has been less than advertised exerting much pressure on lesser opponents by Bronco 77 10/16/2015 2:59:33 PM I'm here, let's roll.", "external_links": [], "published": "2015-10-16T17:59:00.000+03:00", "crawled": "2015-10-16T18:29:29.011+03:00", "highlightTitle": ""}