{"organizations": [], "uuid": "f68b10bd1c2bf9acbe2d3fbf5edf8ff907c36ab5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pe.com", "main_image": "http://www.pe.com/images/logo.gif", "site_section": "http://www.pe.com/sections/sports/", "section_title": "Sports : Press Enterprise", "url": "http://www.pe.com/articles/yards-782396-valley-temecula.html", "country": "US", "title": "FOOTBALL: Temecula Valley shakes sluggish start to pound Tahquitz, 41-7", "performance_score": 0, "site": "pe.com", "participants_count": 1, "title_full": "FOOTBALL: Temecula Valley shakes sluggish start to pound Tahquitz, 41-7 - Press Enterprise", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "f68b10bd1c2bf9acbe2d3fbf5edf8ff907c36ab5"}, "author": "BRIAN HAAS", "url": "http://www.pe.com/articles/yards-782396-valley-temecula.html", "ord_in_thread": 0, "title": "FOOTBALL: Temecula Valley shakes sluggish start to pound Tahquitz, 41-7", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BY BRIAN HAAS / CONTRIBUTING WRITER\nPublished: Oct. 2, 2015 Updated: Oct. 3, 2015 12:02 a.m. HEMET – Temecula Valley overcame a sluggish start on Friday night as it defeated Hemet Tahquitz 41-7 in a nonleague game.\nJunior running back Lika Palmer found the end zone for three scores, carrying the ball 18 times for 147 yards.\n“It was a little frustrating in the early goings,” Temecula Valley coach some Rick Mey said. “We didn’t have the best warm up for this game and we knew that we were going to face some adversity because of it, but eventually we were able to get rolling.”\nAfter a scoreless first frame, it was Temecula Valley that would score first, late in the second quarter.\nThe Golden Bears traveled 78 yards in a little under two minutes on the scoring drive, capping it off with a 1-yard touchdown run from Palmer.\nTemecula Valley then added to its lead on the last play of the half when a scrambling Vincent Bowes found Palmer on a fourth-and-long play in the back of the end zone.\n“I ran a streak and went back side,” Palmer said of the play. “I was just hoping that (Bowes) would see me and he did.”\nIt was the defense and special teams of Temecula Valley that stood out in the second half.\nWith three minutes left in the third quarter Nate Gardner returned a punt 75 yards down the sideline, which was followed a minute later by a Cullen Muir interception that was taken 35 yards for a touchdown.\nZak Simon added a 65-yard punt return for a touchdown with seven minutes left to secure the victory.\nTahquitz scored its only touchdown in the final minute when Nuri Smith found the end zone from 47 yards out.\nBowes went 4 of 7 in the air for 47 yards while rushing for 78 yards. Simon led the Bears in receptions with three for 23 yards.\nThe Titans were led by a 74 yard rushing performance from Smith, while quarterback William Keegan went 13 for 29 in the air for 131 yards. CJ Sullivan had three catches for 77 yards.\nTemecula Valley (4-1) will open up Southwestern League play at Chaparral on Friday, while Tahquitz (1-4) will start Mountain Pass league play hosting Beaumont.", "external_links": [], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-03T15:19:29.730+03:00", "highlightTitle": ""}