{"organizations": [], "uuid": "59504375c4310737f324760cc737262cb1320963", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "nypost.com", "main_image": "https://thenypost.files.wordpress.com/2015/10/dickey.jpg", "site_section": "http://nypost.com/sports/feed/", "section_title": "| Sports | New York Post", "url": "http://nypost.com/2015/10/13/curious-decision-takes-blue-jays-season-out-of-david-prices-hands/", "country": "", "title": "Curious decision takes Blue Jays season out of David Price’s hands", "performance_score": 0, "site": "nypost.com", "participants_count": 1, "title_full": "Curious decision takes Blue Jays season out of David Price’s hands | New York Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T15:11:00.000+03:00", "replies_count": 0, "uuid": "59504375c4310737f324760cc737262cb1320963"}, "author": "Justin Terranova", "url": "http://nypost.com/2015/10/13/curious-decision-takes-blue-jays-season-out-of-david-prices-hands/", "ord_in_thread": 0, "title": "Curious decision takes Blue Jays season out of David Price’s hands", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Blue Jays made it to Game 5, but they left their ace in Texas.\nToronto manager John Gibbons opted to use David Price to relieve R.A. Dickey in the bottom of the fifth inning with the Blue Jays up 7-1, a runner on first and two outs. Gibbons said after the 8-4 win Price would be unavailable for Game 5 at Rogers Centre on Wednesday night.\nPrice disagrees – saying he’d be available in relief – but the bigger question may be why Price was used at all in a game the Blue Jays were winning decisively and with the knuckleballer Dickey pitching effectively.\n“I was hoping today to get five [innings] out of R.A., maybe six if things went well,” Gibbons told Yahoo Sports of Dickey, who had just thrown 78 pitches. \nR.A. Dickey (second from left) gets a visit in the fourth inning from pitching coach Pete Walker (right). Photo: Getty Images “We did have a nice little lead, [but] the way I looked at it, we were starting to roll around that top a little bit. One thing I’ve learned over the years is that sometimes the best way to win games is, don’t let a team get back into it.”\nPrice pitched into the eighth inning, allowing three runs, doing enough to keep the Blue Jays well ahead. But, what now?\nPrice is 2-6 with a 5.04 ERA over 12 postseason appearances (six starts), but the reason they successfully landed him at trade deadline was starts like Wednesday’s, for which he’ll now be seated in the bullpen. It’s why the Rangers got Cole Hamels at the same deadline, and the lefty will be on the mound against Blue Jays’ Game 2 starter Marcus Stroman.\n“When it comes down to it, my job is to manage the team and try to win the game,” Gibbons said.\n“All those things factored in. I thought it was the best move. Probably not a popular move, but that’s what you’ve got to do. In the regular season, it’s different. That doesn’t happen. But in a do-or-die game for us, and I’ve seen it too many times in this business, especially with the kind of lineup [Texas has] and the way things were stacking up for us. They get a couple guys on [and hit] a long ball, it’s a totally different game.”\n  david price ,  john gibbons ,  marcus stroman ,  mlb playoffs ,  texas rangers ,  toronto blue jays", "external_links": [], "published": "2015-10-13T15:11:00.000+03:00", "crawled": "2015-10-13T19:27:09.898+03:00", "highlightTitle": ""}