{"organizations": [], "uuid": "dd92f4cc6165514869f4781a1b58aa87840c1783", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.si.com", "main_image": "http://cdn-jpg.si.com/sites/default/files/styles/si_gallery_slide/public/2015/10/05/joe-philbin-fired-miami-dolphins.jpg?itok=_-YFgMcF", "site_section": "http://news.google.com/news?pz=1&cf=all&ned=us&hl=en&topic=s&output=rss", "section_title": "Sports - Google News", "url": "http://www.si.com/nfl/2015/10/05/dolphins-possible-candidates-0", "country": "IL", "title": "Life after Philbin: Potential head coaching candidates for Miami - Sports Illustrated", "performance_score": 0, "site": "si.com", "participants_count": 0, "title_full": "Life after Philbin: Potential head coaching candidates for Miami - Sports Illustrated", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T20:08:00.000+03:00", "replies_count": 0, "uuid": "dd92f4cc6165514869f4781a1b58aa87840c1783"}, "author": "", "url": "http://www.si.com/nfl/2015/10/05/dolphins-possible-candidates-0", "ord_in_thread": 0, "title": "Life after Philbin: Potential head coaching candidates for Miami - Sports Illustrated", "locations": ["Miami"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Philbin", "Bill Lazor", "Kevin Coyle", "Ross"], "text": "0 0 0 More His job moving forward will be thankless, because it will take a borderline miracle to turn this team around in short order. Defensive coordinator Kevin Coyle reportedly is out, too, and offensive coordinator Bill Lazor is feeling the heat himself. Most legitimate options to replace Philbin permanently are under contract with other teams, meaning Ross will have to wait on them until the end of the season. \nSo, what's next for the Dolphins? Here are a few potential candidates, be it now or in January: \nJim Schwartz: A long shot, sure, but if the Dolphins are desperate to find someone right now with experience as a head coach, this is an option. Schwartz ran the show in Detroit from 2009-13 before being fired, taking the Lions to the playoffs in 2011. He then turned in a successful one-year run as Buffalo's defensive coordinator. Even if the Dolphins don't see Schwartz as their new head coach, he could be an upgrade as the defensive coordinator. \nBill Cowher: Ross reportedly wanted to swing for the fences last time he needed a new head coach, prior to hiring Philbin for the 2012 season. Jon Gruden then was linked to the Dolphins, and his name likely will surface again—the contract extension he signed through 2021 with ESPN makes the odds of him returning to the sidelines quite slim. \nRoss has a better chance with Cowher, though the 58-year-old also has settled in as a TV analyst, far removed from the stresses of coaching. Cowher last manned a head-coaching post for Pittsburgh in 2006. He has hinted in the past that he would be open to coming out of unofficial retirement, but is this the job that could lure him? \nJim Harbaugh: Ross denied back in March that he had courted Harbaugh once the latter left the 49ers . Ross's presence at the University of Michigan—he donated $200 million to the eponymous business school—makes it almost unfathomable to believe he would ask Harbaugh to leave Ann Arbor after just one year on the job there. Count on hearing the suggestion, though. \n• The MMQB: How the Jets defense became the NFL’s best \nKyle Shanahan: The Falcons ' offensive coordinator interviewed for the same job in Miami in 2014; Lazor was hired instead. However, Shanahan, 35, figures to receive a head-coaching shot at some point soon, especially considering his early success in Atlanta. His dad, Mike, could be another big-name possibility for Ross. \nAdam Gase: Considered for multiple off-seasons now to be among the likeliest to be promoted from a coordinator role to head coach, somewhere. It didn't happen for him last off-season, so he followed John Fox to Chicago as offensive coordinator. Whenever a coaching vacancy opens in the coming months, Gase will be among the obvious candidates. \nTeryl Austin: The Lions were afraid that they would lose their defensive coordinator after he turned in a brilliant 2014. The first few weeks of 2015 have not gone as swimmingly, but Austin, 50, remains a highly respected assistant with designs on a head-coaching job. The respective success stories (thus far) of Todd Bowles and Dan Quinn transitioning from defensive coordinator to head coach will help Austin's case.", "external_links": [], "published": "2015-10-05T20:08:00.000+03:00", "crawled": "2015-10-05T23:38:32.667+03:00", "highlightTitle": ""}