{"organizations": [], "uuid": "9e543bfab22189b950ad4e3a59726891891d0f3f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.baltimoresun.com", "main_image": "http://www.trbimg.com/img-53fdf16a/turbine/bal-baltimore-default-facebook-icon", "site_section": "http://feeds.baltimoresun.com/baltimoresun/sports/college/rss2.0.xml", "section_title": "College Sports - Baltimore Sun", "url": "http://www.baltimoresun.com/sports/college/ph-cc-sp-fb-gettysburg-mcdaniel-advance-1003-20151002-story.html", "country": "US", "title": "Terror hope weather plays in their favor", "performance_score": 0, "site": "baltimoresun.com", "participants_count": 1, "title_full": "Terror hope weather plays in their favor", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T00:04:00.000+03:00", "replies_count": 0, "uuid": "9e543bfab22189b950ad4e3a59726891891d0f3f"}, "author": "Jake Rill", "url": "http://www.baltimoresun.com/sports/college/ph-cc-sp-fb-gettysburg-mcdaniel-advance-1003-20151002-story.html", "ord_in_thread": 0, "title": "Terror hope weather plays in their favor", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Terror hope weather plays in their favor DYLAN SLAGLE/STAFF PHOTO / Carroll County Times McDaniel wide receiver Bamasa Bailor is unable to make a catch while defended by Catholic's Matt Christensen during the first half of the Green Terror's season-opener against Catholic in Westminster Saturday, Sept. 5, 2015. McDaniel wide receiver Bamasa Bailor is unable to make a catch while defended by Catholic's Matt Christensen during the first half of the Green Terror's season-opener against Catholic in Westminster Saturday, Sept. 5, 2015. (DYLAN SLAGLE/STAFF PHOTO / Carroll County Times) Jake Rill Contact Reporter Carroll County Times McDaniel football is hoping the weather plays in its favor for Saturday's game against Gettysburg. \nThe rain in the forecast for today is no longer as bad as originally forecasted, now that Hurricane Joaquin's track appears to have shifted off the east coast. \nIf there ends up being not as much rain, one person who will be disappointed is McDaniel coach Mike Hoyt. \nHoyt said he was hoping for it to be a downpour, something that could play in the Green Terror's favor against Gettysburg. The unbeaten Bullets run an option offense and so far this season, teams have struggled to stop their powerful rushing attack, the best in the Centennial Conference this year. \n\"I hope it's a monsoon out there,\" Hoyt said. \"I hope it rains and I hope the wind blows, because they're an option football team and they rely on speed, and the weather will definitely play in our favor.\" \nWhile Gettysburg (4-0, 3-0 Centennial) has been tough to stop on the ground, McDaniel (0-4, 0-3) is coming off a game where it had no trouble stopping Ursinus' run game. Although the Bears won 33-17, the Terror held them to 61 rushing yards. \nIt was the fewest rushing yards McDaniel has allowed in a game under Hoyt, and the fewest since holding Catholic to 14 rushing yards in the 2011 season opener. \nBut this week's task should be much tougher. The Bullets are averaging 281.2 rushing yards a game, nearly 20 more than any other team in the conference. That has also helped Gettysburg rank second in total offense this season behind only fellow unbeaten Johns Hopkins. \n\"They're a little different run philosophy than Ursinus was,\" Hoyt said. \"Ursinus was two backs, run right at you. ... Gettysburg is more spread you out, they're going to use speed and athleticism.\" \nThat's not the only aspect of the Terror's defense that shined last week. McDaniel notched three more sacks to push their season total to 14, most in the conference. \nThe Green Terror have had troubles in other areas though, as they continue to search for their first win since the first game of the 2014 season. Their losing streak has reached 13 games and they have one more shot to break it before the midseason bye week. \nMcDaniel scored 17 points last week, its most in a conference game this season, but seven of those points came on a defensive score, a fumble recovery by Claude-Michel Richardson. On offense, quarterback Matty Callahan connected with Sean Montgomery for a touchdown, but also threw four interceptions. \nHoyt said he knows that his team needs to do a better job of taking care of the football this week if it wants to have a chance to end its losing streak. \n\"There's things we've got to get better at,\" Hoyt said. \"I don't know how many times you can turn the ball over five times and win a football game. We take care of those things, and I think we beat Ursinus. But unfortunately, we made those mistakes.\"", "external_links": [], "published": "2015-10-03T00:04:00.000+03:00", "crawled": "2015-10-03T18:59:01.062+03:00", "highlightTitle": ""}