{"organizations": [], "uuid": "81dc20d1e92dae4319784c783e78c5eb8621e666", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sportsnews.com.au", "main_image": "http://sportsnews.com.au/defaultimage.jpg", "site_section": "http://www.sportsnews.com.au/category/rugby-union/feed/", "section_title": "Sports News Australia » Rugby Union News", "url": "http://www.sportsnews.com.au/rugby-union/destroyed-parisse-out-of-italys-rwc/159390", "country": "CA", "title": "‘Destroyed’ Parisse out of Italy’s RWC", "performance_score": 0, "site": "sportsnews.com.au", "participants_count": 1, "title_full": "‘Destroyed’ Parisse out of Italy’s RWC", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T19:12:00.000+03:00", "replies_count": 0, "uuid": "81dc20d1e92dae4319784c783e78c5eb8621e666"}, "author": "AAP", "url": "http://www.sportsnews.com.au/rugby-union/destroyed-parisse-out-of-italys-rwc/159390", "ord_in_thread": 0, "title": "‘Destroyed’ Parisse out of Italy’s RWC", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "‘Destroyed’ Parisse out of Italy’s RWC Posted by AAP + on 10/10/2015 at 3:12 am   \nItalian captain Sergio Parisse’s World Cup lasted just 65 minutes as he is not fit for their final Pool D game against Romania on Sunday. \nThe 32-year-old No.8 said a calf problem that ruled him out of the first two games – he underwent an operation to drain a haematoma prior to the tournament – had flared up again following his dynamic performance in the 16-9 defeat to Ireland last Sunday. \n“I wasn’t really ready to start the match against Ireland and it was physically hard, even those 65 minutes, and afterwards my calf hurt a lot,” said Parisse. \n“I really wanted to do my best against Ireland after all the recovery work I did with Stade Francais (his club) in Paris, but at the end I was destroyed. \n“I wasn’t able to give my all in training and I would only be at about 55 per cent for a match which you need to be near 100 per cent for.” \nParisse’s fellow backrow veteran Mauro Bergamasco, in his fifth World Cup, also did not make the matchday squad, but for strategic reasons. \n“The choice was made with the idea of winning the match, not from the heart,” said coach Jacques Brunel. \n“We want to have the best chance to win this match. It is better with (Samuela) Vunisa with the characteristics he has.” \nParisse concurred with the French coach. \n“I agree with Jacques, in that he has to send out the best team he has,” said Parisse. \n“It has been a pleasure and a joy to play four World Cups with him (Bergamasco) and some of my best memories are from playing alongside him. \n“He deserves all the praise he has received for playing five World Cups, but this is a technical choice.” \nParisse would not be drawn on whether this would bring down the curtain on his international career. \n“It is more important to focus on the match against Romania than whether or not this is my last World Cup or whether I will play for Italy again,” said Parisse. \nWith Parisse’s deputy Leonardo Ghiraldini not recovered from a thigh injury suffered in the 23-18 win over Canada, 34-year-old South Africa-born lock Quintin Geldenhuys takes over the captain’s armband. \nItaly have to avoid defeat – they lead Romania by a point – to retain third place in the pool and qualify automatically for the 2019 World Cup. \nItaly team to play Romania: \nLuke McLean; Leonardo Sarto, Michel Campagnaro, Tommaso Benvenuti, Giovanbattista Venditti; Tommaso Allan, Edoardo Gori; Alessandro Zanni, Simone Favaro, Francesco Minto; Josh Furno, Quintin Geldenhuys (capt); Lorenzo Cittadini, Andrea Manici, Matias Aguero. \nReserves: Davide Giazzon, Alberto De Marchi, Dario Chistolini, Valerio Bernabo, Samuela Vunisa, Guglielmo Palazzani, Carlo Canna, Enrico Bacchin.  ", "external_links": [], "published": "2015-10-09T19:12:00.000+03:00", "crawled": "2015-10-09T20:00:26.361+03:00", "highlightTitle": ""}