{"organizations": [], "uuid": "0d6fab5f6ef511ee03e6375a126fda1c785c96e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.syracuse.com", "main_image": "http://imgick.syracuse.com/home/syr-media/width620/img/post-standard/photo/2015/10/10/18946077-large.jpg", "site_section": "http://impact.syracuse.com/sports/atom.xml", "section_title": "Syracuse &amp; Central NY Sports", "url": "http://www.syracuse.com/motorsports/index.ssf/2015/10/super_dirt_week_2015_jimmy_phelps_wins_salute_to_the_troops_150.html", "country": "US", "title": "Super DIRT Week 2015: Jimmy Phelps wins Salute to the Troops 150", "performance_score": 0, "site": "syracuse.com", "participants_count": 1, "title_full": "Super DIRT Week 2015: Jimmy Phelps wins Salute to the Troops 150 | syracuse.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T10:49:00.000+03:00", "replies_count": 0, "uuid": "0d6fab5f6ef511ee03e6375a126fda1c785c96e5"}, "author": "Doug Elkins | Contributing writer", "url": "http://www.syracuse.com/motorsports/index.ssf/2015/10/super_dirt_week_2015_jimmy_phelps_wins_salute_to_the_troops_150.html", "ord_in_thread": 0, "title": "Super DIRT Week 2015: Jimmy Phelps wins Salute to the Troops 150", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Syracuse, N.Y. — It was a long day on the mile at Syracuse as two days of racing were squeezed into one after Friday's rain. Baldwinsville's Jimmy Phelps used pit strategy to get out front and win the Salute to the Troops 150 on Saturday for his first-ever victory at Super DIRT Week.\nPhelps used the rules of the race to his advantage as he pitted for fuel after the third caution of the race at lap 41. He then came back down pit road with the remainder of the cars 18 laps later for what was the DIRTcar mandated pit stop that had to take place after lap 50.\nThe rules say that a driver has to pit after lap 50 but they don't say what they have to do once they are there. Since Phelps had already packed his modified full of fuel he was able to do a quick stop and go and pull out ahead of the rest of the drivers that did a full fuel stop on lap 68.\nPhelps came out behind the car of Matt Janiak, who stayed out on the track and once Janiak pitted 10 laps later Phelps was in the lead.\n\"We knew it wasn't going to be easy. The track definitely came apart a little more than we expected,\" Phelps said. \"It was beautiful in the heat race. Obviously we weren't on it again for several hours. That's the stuff you worry about. If our race car was good, if our motor was good, you never know. You hit a hole wrong, take a tire off the rim, break a shock or bend something. That's what I was probably most worried about.\"\nHe also had to worry about was 2013 Syracuse 200 winner and pole-sitter Billy Dunn, who won his heat race earlier in the day. Dunn passed both Brett Hearn and Tim McCreadie late to pick up second place and with two laps to go he caught Phelps.\n\"I knew Billy (Dunn) was good and it sounded like he might have found something coming off the top in (turn) two. We were hoping Tim (McCreadie) could keep him at bay,\" Phelps said. \"We definitely didn't need that last restart but our car restarted well. I don't know if we would have held him off for another 20 laps … We were being awful cautions and if we had to turn it up we probably could have done that.\"\nAs for Dunn, he was driving hard and making passes on the outside, something that is not very common at Syracuse. But he wondered if trying to make up for a past mistake might have cost him the race on Saturday.\n\"That was pretty wild. We ran out of gas the last two years and I was bound and determined we weren't going to do that again,\" Dunn said. \"We probably only needed to take one can (of fuel) gas, it got us behind filling up. I just ran as hard as I could the rest of the race about wrecking every lap and I'm pretty happy to get back to where we did and finish second in this race again … We gave it our all.\"\nRestarts didn't work out well for moonlighting late model driver Tim McCreadie and he felt that last restart may have cost him second place.\n\"I needed five or six laps to get going again. It wouldn't fire for three, four or five laps,\" McCreadie said. \"Once it got rolling I thought we were a touch better than them but the restarts at the end I didn't need.\"\nAs for Phelps, he hopes he can do it again Sunday and be the last driver to win on the mile at Syracuse.\n\"The big block race is what we want for sure but this is an awful special win for us,\" Phelps said. \"We don't do it enough to have lost it a bunch. I just feel real fortunate that we came here and had a car that could run up front, had great pit strategy, the guys did a great job, we got in and out, we had enough fuel and it worked out. I mean I couldn't be happier. We're going to enjoy this and we're going to get up in the morning and focus on trying to do it again.\"\nDIRTcar: Salt City 78 Drivers start their engines for the Salt City 75 at DIRTweek.", "external_links": [], "published": "2015-10-11T10:49:00.000+03:00", "crawled": "2015-10-11T10:35:16.760+03:00", "highlightTitle": ""}