{"organizations": [], "uuid": "75140439a457cd6111cbdcd8fbda13d6525210c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.morningsun.net", "main_image": "http://www.morningsun.net/Global/images/head/nameplate/ks-pittsburg_logo.png", "site_section": "http://www.morningsun.net/sports?template=rss&mime=xml", "section_title": "Sports - Morning Sun", "url": "http://www.morningsun.net/article/20151022/SPORTS/151029950/2000/NEWS?rssfeed=true", "country": "US", "title": "Pitt State women picked 4th in MIAA poll", "performance_score": 0, "site": "morningsun.net", "participants_count": 1, "title_full": "Pitt State women picked 4th in MIAA poll", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T06:28:00.000+03:00", "replies_count": 0, "uuid": "75140439a457cd6111cbdcd8fbda13d6525210c2"}, "author": "Michael Bauer mbauer@morningsun.net", "url": "http://www.morningsun.net/article/20151022/SPORTS/151029950/2000/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "Pitt State women picked 4th in MIAA poll", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Pitt State women picked 4th in MIAA poll Comment Posted Oct. 22, 2015 at 10:28 PM By Michael Bauer Posted Oct. 22, 2015 at 10:28 PM Pittsburg, Kan. Coming off their third NCAA Division II Tournament appearance in the last four years, the Pittsburg State women’s basketball team now faces a transition phase after losing five seniors from last year, including the Gorilla women's all-time leading point scorer in All-American Lizzy Jeronimus. The Gorillas, who went 27-7 last year, enter this season with only four upperclassmen made up of two seniors and two juniors. “We had a special group of five seniors that put our program on the map,” said Pitt State head coach Lane Lord on the MIAA conference website. “When you lose an All American and four seniors, it’s tough. But we are excited about our young kids. We have two juniors and seniors and the rest are sophomores and freshmen. All four juniors and seniors are doing a great job of leading the younger players.” Among those coming back are swingman Cathy Brugman and forward Kylie Gafford. “Cathy is a very quiet leader, who leads by example,” Lord said. “Kylie’s been very vocal, and leads our defense and does a great job of getting us in right sets and teaching kids where to be.” Other returning players include sophomore Elena Flott, sophomore guard Mikaela Burgess as week as junior guards Paige Lungwitz and Hadyn Herlocker. “Flott had a great season for us.,” Lord said. “Her season was cut short due to an injury, but she’s fought back and will have a great sophomore year. Burgess is going to play an even bigger role this year. Herlocker is a junior, but we feel very good about her and Burgess at point guard. With five seniors gone from last year, Lord stressed that leadership on the court will be even more important this season. “The leadership is such an important part of college basketball,” Lord said. “We have six true freshmen and five sophomores. It’s going to be a challenge to compete every day, but the younger players know what it takes to be successful in this league, and it’s only a matter of time until they catch up to speed.” On Thursday, the MIAA released the 2015-16 preseason standings. The Gorillas were picked to finish fourth with 128 points based on a vote by the league’s head coaches. Three-time defending MIAA Tournament champions Emporia State is predicted to finish first, receiving 13 first-place votes and 169 points. ESU went on to the Final Four in the NCAA Division II Tournament last year before losing to the eventual National Champions California (Pennsylvania) in the semi-finals. Emporia State went 29-5 and 15-4 in conference play. Page 2 of 2 - Fort Hays State, who won the 2014-15 regular season MIAA Conference Title, was picked to finish second after receiving one first-place vote. Central Missouri sits at third with 135 points. Missouri Western State was slated at fifth, four points behind the Gorillas with 124 points. “Our goals are to finish in the top three in the league and give us a chance to get into the NCAA Tournament,” Lord said. “We want to play our best basketball at the end of the year.” The Gorillas and the Hornets ended up playing each other four times last season — one of which was in the MIAA Tournament and the other in the NCAA Tournament — with the Hornets winning on each occasion. The Tigers were another MIAA representative in the 2015 national tournament before losing to ESU in the regional final. FHSU also fell to the Hornets in the MIAA Tournament final. The Gorilla women will begin their season at Allen Fieldhouse on Nov. 1 against Kansas University in an exhibition game before traveling to Manhattan to face Kansas State University on Nov. 9. Pittsburg State will begin the regular season at Minot, North Dakota against Minot State on Nov. 13 in the MIAA/NSIC Conference Challenge. The Gorillas’ home opener will take place on Dec. 2 against Northeastern State. Michael Bauer is a sports reporter for the Pittsburg Morning Sun. E-mail him at mbauer@morningsun.net and follow him on twitter at @michaeljohn391. By Michael Bauer", "external_links": [], "published": "2015-10-23T06:28:00.000+03:00", "crawled": "2015-10-23T14:19:33.400+03:00", "highlightTitle": ""}