{"organizations": [], "uuid": "018455e3957314459622257aee4ef4ae50ae73ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.abc2news.com", "main_image": "http://sharing.abc2news.com/sharewews/photo/2015/10/16/Police_Report__Johnny_Manziel_pulled_ove_3577540001_25331367_ver1.0_640_480.jpg", "site_section": "http://www.abc2news.com/feeds/rssFeed?obfType=RSS_FEED&siteId=10009&categoryId=10004", "section_title": "Sports | WMAR", "url": "http://www.abc2news.com/sports/police-report-johnny-manziel-pulled-over-during-domestic-argument-admits-to-drinking", "country": "US", "title": "Police stopped Manziel, fighting with girlfriend", "performance_score": 0, "site": "abc2news.com", "participants_count": 1, "title_full": "Police stopped Manziel, fighting with girlfriend", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T21:28:00.000+03:00", "replies_count": 0, "uuid": "018455e3957314459622257aee4ef4ae50ae73ae"}, "author": "Joe Pagonakis", "url": "http://www.abc2news.com/sports/police-report-johnny-manziel-pulled-over-during-domestic-argument-admits-to-drinking", "ord_in_thread": 0, "title": "Police stopped Manziel, fighting with girlfriend", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Police Report: Johnny Manziel pulled over during domestic argument, admits to drinking WEWS Browns quarterback Johnny Manziel, was pulled over by Avon police after police said a domestic argument got out of hand on Interstate 90 westbound earlier in the week. WEWS SAN DIEGO, CA- OCTOBER 4: Quarterback Johnny Manziel #2 of the Cleveland Browns looks on in the huddle against the San Diego Chargers during their NFL Game on October 4, 2015 in San Diego, California. (Photo by Donald Miralle/Getty Images) Donald Miralle Copyright 2015 Scripps Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. Show Caption Previous Next \nAVON, Ohio - Browns quarterback Johnny Manziel, was pulled over by Avon police after police said a domestic argument got out of hand on Interstate 90 westbound earlier in the week. \nPolice said alcohol was involved. The argument took place between Manziel and his Texas Christian University girlfriend Colleen Elizabeth Crowley. \nAccording to a four-page police report obtained exclusively by newsnet5.com, both were drinking but were not charged. \nDownload the ABC2 News app for the iPhone , Kindle and Android \nThe incident started on I-90 westbound near the Nagle Road overpass on Monday at 6 p.m. \nAccording to the report, a witness called police after seeing Manziel's white Nissan use the shoulder of the road to pass her at a high speed. \nThe witness told police the couple was arguing and Crowley attempted to exit the vehicle while they were on the road. \nIn the report, both Manziel and Crowley admitted they were having an argument . Crowley said she threw Manziel's wallet out of the window. \nThe report stated the couple then stopped the car in an Avon neighborhood and continued arguing. That's when a second witness called police. \nMinutes later, police stopped Manziel's car on Nagle Road where he said both he and Crowley had been drinking in downtown Cleveland earlier that day. \nIn the report, Crowley told police Manziel pushed her head into a window. She wanted her cell phone because she was concerned about her safety and said she just wanted to return to Texas. \nThe report stated police did see an abrasion on Crowley's arm but later determined that the abrasion was from Manziel's attempt to keep her from getting out of the vehicle while it was on the road. \nAccording to the report, police did not believe the couple was intoxicated to the point where they could be charged and Crowley told officers that she did not want to press charges so both were allowed to leave the scene in Manziel's car. \nThe Browns released a statement claiming they were aware of the incident: \nWe were aware of the situation. It is a matter that we take seriously and have expressed our concerns to Johnny directly. Those conversations will remain private and we will refrain from further comment at this time.", "external_links": [], "published": "2015-10-17T21:28:00.000+03:00", "crawled": "2015-10-17T21:50:00.552+03:00", "highlightTitle": ""}