{"organizations": [], "uuid": "a7d5f4dc382040265c8c59a8e774fde5bf2e4e4b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "http://s3.reutersmedia.net/resources/r/?m=02&d=20151012&t=2&i=1086313657&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB9B035", "site_section": "http://www.reuters.com/news/sports", "section_title": "Sports News, Highlights &amp; Coverage | Reuters.com", "url": "http://www.reuters.com/article/2015/10/12/us-nhl-highlights-idUSKCN0S607120151012", "country": "US", "title": "Plekanec grabs double as Montreal beat Ottawa", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Plekanec grabs double as Montreal beat Ottawa | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T08:00:00.000+03:00", "replies_count": 0, "uuid": "a7d5f4dc382040265c8c59a8e774fde5bf2e4e4b"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/10/12/us-nhl-highlights-idUSKCN0S607120151012", "ord_in_thread": 0, "title": "Plekanec grabs double as Montreal beat Ottawa", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(The Sports Xchange) - Center Tomas Plekanec led the Canadiens with two goals, while Torrey Mitchell had the other as Montreal spoiled the Ottawa Senators home opener with a 3-1 victory on Sunday\nBoth teams rested their first choice goalies, with rookie Mike Condon stopping 20 shots for the win for Montreal.\n\"A lot of times when the backup goes in there, you see (the team) changing, and we didn't change anything,\" Canadiens defensemen P.K. Subban said.\n\"Guys felt confident with him in there. He established early that he was ready and he was sharp.\n\"Listen, I've got to give him credit. He went in there and did exactly what he had to do. We get that from Carey (Price) every night. What Carey brings, we got that from him tonight.\"\nSenators goalie Matt O'Connor made 31 saves, while center Jean-Gabriel Pageau scored their lone goal.\nPlekanec beat O'Connor with a weak shot that bounced off the goaltender to open the scoring before he picked up his second on a breakaway with 1:26 remaining in the first period when he put it through O'Connor's pads.\nPageau put Ottawa on the board in the second period with a short-handed goal, before Mitchell deflected a screened shot by Subban that O'Connor never saw into the net with just over 14 minutes remaining in the game.\nCondon then made two big stops off Erik Karlsson in the final minute with O'Connor on the bench for an extra attacker to preserve the victory.\n\"I was very, very lucky. (Karlsson) had the whole side of the net open, so lucky he shot it back into me,\" Condon said.\n\"I thought the guys played an awesome game.\n\"I think we only had 15 shots against going into the third period, only maybe five or six scoring chances. They made my workload very light.\"\nSenators coach Dave Cameron was concerned that his team had not played with enough energy to really challenge the rookie goaltender.\n\"We talk all the time about if we're going to establish ourselves as any kind of team that's tough to play against, you have to go through pucks, not around them,\" Cameron said.\n\"Montreal did a good job of choking us off, but if you don't respond by going through pucks and getting pucks to the net, it's going to be a long night.\n\"It was a long night.\"\n(Compiled by Greg Stutchbury)", "external_links": [], "published": "2015-10-12T08:00:00.000+03:00", "crawled": "2015-10-12T07:30:50.808+03:00", "highlightTitle": ""}