{"organizations": [], "uuid": "a6b92bdfe250bfd85b08b3114b8684a942810693", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "http://images.tribuneindia.com/cms/gall_content/2015/10/2015_10$largeimg12_Monday_2015_152159196.JPG", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/nation/46-37-pc-turnout-recorded-till-2-pm/144981.html", "country": "US", "title": "46.37 pc turnout recorded till 2 pm", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "46.37 pc turnout recorded till 2 pm", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "a6b92bdfe250bfd85b08b3114b8684a942810693"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/nation/46-37-pc-turnout-recorded-till-2-pm/144981.html", "ord_in_thread": 0, "title": "46.37 pc turnout recorded till 2 pm", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Patna, October 12\nThe high-stake Bihar Assembly election began on Monday with voting starting at 7 am in 49 seats, spread over 10 districts, in the first of the five phases of elections amid elaborate security arrangements. Over 46.37 per cent turnout was recorded till 2 pm. The Election Office hourly bulletin said Cheria Bariarpur saw a maximum of 56.5 per cent voting till 2 pm. Polling percentage was 31.79 per cent in Samastipur, 52.17 per cent in Begusarai, 50 per cent in Khagaria, 43 per cent in Bhagalpur, 38.69 per cent in Banka, 55.6 per cent in Munger, 39 per cent in Lakhisarai, 46 per cent in Sheikhpura and 41 per cent in Nawada, the EC bulletin said. A total number of 1,35,72,339 electorate will cast their votes in the 49 Assembly seats for which 583 candidates, including 54 women, are in the fray. The polling will be held between 7 am and 3 pm in nine constituencies - Tarapur, Jamalpur, Suryagraha, Rajauli (SC), Govindpur, Sikandara (SC), Jamui, Jhajha and Chakai. The duration of polling on four constituencies - Alauli (SC), Beldaur, Katoria (ST), Belhar - will end at 4 pm. The polling for the remaining 36 constituencies will be held between 7 am to 5 pm. The duration of polling hours in 13 Assembly seats have been shortened on the basis of assessment of law and order situation with all these constituencies falling in Naxal-hit areas, Additional Chief Electoral Officer (ACEO) R Laxmanan said. Of the total electors, there are 72,37,253 male, 63,17,602 female and 405 third gender, he said. Among the break-up of seats being contested by different political parties in the first phase, the BSP leads the pack with 41 candidates, followed by the BJP (27), RJD (17), LJP (13), Congress (8) and RLSP (6). Among the left front constituents, the CPI has fielded 25 candidates followed by the CPI-M at 12. As many as 13,212 polling stations have been set up for the first phase for which 63,624 polling personnel have been deployed, he said. Laxmanan said that 1.20 lakh personnel of Central Paramilitary Forces have been deployed to ensure free and fair polls adding that every polling station will be manned by a CPF personnel. Out of the total number of 13,212 polling stations, 7,384 are tagged as critical and 2,255 are Left-Wing Extremists-hit. He said that five helicopters, including three Unmanned Aerial Vehicles (UAVs) have been deployed for air surveillance during polling. The number of mounted police force to be used for patrolling stands at 50, while 33 motor boats have been pressed into service for riverine petrolling. As many as 935 video cameras and 339 android mobile phones have been put into use to ensure free and fair poll, the ACEO said. Meanwhile, Prime Minister Narendra Modi has urged voters to exercise their franchise in large numbers. He particularly exhorted the young voters to cast their votes. \"Urging all those voting today in Bihar to vote in large numbers. I particularly urge my young friends to cast their vote.\" the Prime Minister tweeted. —PTI", "external_links": [], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-12T14:24:01.965+03:00", "highlightTitle": ""}