{"organizations": [], "uuid": "60c0242859089a714339b170d42216f391f1efa6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "http://s4.reutersmedia.net/resources/r/?m=02&d=20151015&t=2&i=1087076046&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB9E00Z", "site_section": "http://www.reuters.com/news/sports", "section_title": "Sports News, Highlights &amp; Coverage | Reuters.com", "url": "http://www.reuters.com/article/2015/10/15/us-sports-fantasy-probe-idUSKCN0S901420151015", "country": "US", "title": "Business model of daily fantasy sports under federal probe: WSJ", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Business model of daily fantasy sports under federal probe: WSJ | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T04:57:00.000+03:00", "replies_count": 0, "uuid": "60c0242859089a714339b170d42216f391f1efa6"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/10/15/us-sports-fantasy-probe-idUSKCN0S901420151015", "ord_in_thread": 0, "title": "Business model of daily fantasy sports under federal probe: WSJ", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The U.S. Justice Department and the Federal Bureau of Investigation are looking into the business model of daily fantasy sports operators and trying to determine whether they violate federal laws, the Wall Street Journal reported, citing people familiar with the matter.\nCustomers of DraftKings Inc have been approached by FBI agents from the Boston office, asking them about their experiences with the company, the WSJ said, citing a person familiar with the matter.\nThe probe is at a preliminary stage and no decision has been reached. The Justice Department is trying to ascertain if daily fantasy games are a form of gambling that are outside the purview of the exemption, the newspaper reported.\nA spokeswoman for DraftKings told the WSJ that they have no knowledge of the specifics of any federal investigation but added that they strongly disagree with any notion that the company has engaged in any illegal activities.\nThe fantasy sports industry has faced a firestorm of criticism since news broke that an employee at DraftKings won $350,000 from a $25 entry in an American football contest on the rival FanDuel site using what reports said appeared to be inside information.\nRepresentatives at the Justice Department, FBI, DraftKings, and FanDuel were not immediately available for comment outside regular U.S business hours.\nFantasy sports companies FanDuel Inc and DraftKings said last week that they had banned their employees from all daily fantasy games and also barred staff from rival companies from their sites.\nDaily fantasy sports, which have developed in recent years, allow participants to draft teams in games played in just one day. It has allowed fans to bet with a frequency that some critics argue is akin to sports betting or gambling.\nFanDuel and DraftKings are privately owned and both valued at more than $1 billion.\n(Reporting by Shivam Srivastava in Bengaluru; Editing by Bernard Orr )", "external_links": [], "published": "2015-10-15T04:57:00.000+03:00", "crawled": "2015-10-15T04:32:42.772+03:00", "highlightTitle": ""}