{"organizations": [], "uuid": "e3b664c3db599332aecc833629464da0f3bc30dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stwnewspress.com", "main_image": "http://bloximages.chicago2.vip.townnews.com/stwnewspress.com/content/tncms/assets/v3/editorial/e/cd/ecdd6d4a-6950-11e5-bb4c-e307c53b56ae/560eff96582b5.image.jpg?resize=760%2C505", "site_section": "http://www.stwnewspress.com//search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&nsa=eedition&c[]=sports,sports/*&f=rss", "section_title": "Stillwater News Press - sports,sports/", "url": "http://www.stwnewspress.com/sports/simmons-effect-on-osu-goes-beyond-box-score/article_aac08b6e-694f-11e5-834b-6bcb17a39164.html", "country": "US", "title": "Simmons’ effect on OSU goes beyond box score", "performance_score": 0, "site": "stwnewspress.com", "participants_count": 1, "title_full": "Simmons’ effect on OSU goes beyond box score", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T02:00:00.000+03:00", "replies_count": 0, "uuid": "e3b664c3db599332aecc833629464da0f3bc30dc"}, "author": "ksteckley@stwnewspress.com(Kieran Steckley)", "url": "http://www.stwnewspress.com/sports/simmons-effect-on-osu-goes-beyond-box-score/article_aac08b6e-694f-11e5-834b-6bcb17a39164.html", "ord_in_thread": 0, "title": "Simmons’ effect on OSU goes beyond box score", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "by Kieran Steckley \nThere is a lot to like about Ryan Simmons the football player. \nThe fifth-year senior is Oklahoma State’s active leader in tackles (202) and second in tackles for a loss (25.5). The latter number is good for fifth among all Cowboys in the Mike Gundy era (2005-present). He has also started 30 consecutive games. \nAnd there is a lot to love about Ryan Simmons the leader. \n“The way he can influence other people is impressive,” fellow redshirt senior wide receiver David Glidden said. “He has an effect on people that to the younger guys that truly stands out and makes an impression.” \nLeading seems to come naturally for Simmons. He has the talent to legitimize his words, he is mature beyond his years and has a voice that takes over a room with one word. \n“Got to be noticeable,” Simmons said smiling. \nMiddle linebackers – which are typically the quarterback of the defense – and senior members of the defense are always looking to him for leadership. But Simmons established himself as the unquestioned leader of the team years ago. \nEvery week a few days before a game, OSU coach Mike Gundy holds a team meeting and gives players an open forum to speak to everyone. Before OSU was set to play UTSA in 2013, Simmons – who was a redshirt sophomore and had only been a full-time starter for one game – took the opportunity from his coach. \n“Ryan stepped up immediately and was the first one to talk,” Glidden said. “That moment right there stood out to me for a long time about Ryan.” \nSimmons hasn’t stopped being a leader ever since. \n“It’s the experience,” senior cornerback Kevin Peterson said. “It’s the maturity. He’s been here when we won the Big 12 Championship. He’s been here when we’ve been great, and he has been here when we’ve been in slumps. He’s been through it all. He knows a whole lot of things we don’t know. So it’s like going to a father figure or a grandparent. He always has good insight.” \nCalling Simmons “grandpa” is a term of endearment and a quick way for younger players to poke fun of him. But it’s also a subtle reminder to harbor the time he has left wearing the Oklahoma State orange and black. \n“It’s crazy how fast it goes by,” Simmons said. “I’ve been taking advantage of every single day. You cherish it a lot more. You are not really focusing on the extra things. You’re just trying to live in the moment. Make the most of it.\" \nIt’s something that has been on Simmons’ mind since the days immediately following OSU’s 33-22 win against Washington in the Cactus Bowl. Simmons graduated in May with a degree in business management with a minor in sports management. He is working this fall to complete his marketing minor. \nThe lighter academic schedule allows Simmons to turn his focus almost solely on football and taking advantage of every day he has remaining to put on an OSU uniform. \n“It hits home,” Simmons said. “It’s a good feeling to be in your last year. I thought about that frequently. I had to prepare different. I had to go about things different.” \nThat self-awareness Simmons brings to the table breeds confidence. It’s infectious to the rest of the team. \n“He doesn’t speak like he doesn’t know anything,” Peterson said. “He speaks to what he knows, what he is taught and what he has learned. He doesn’t speak just knowing he has been that guy who has been here for five years. Everybody knows that. Everybody sees that. But you could tell he is really confident in what he says and what he does.” \nHow could Simmons not know what he is talking about? His redshirt season was spent watching the Cowboys’ historic Big 12 and Fiesta Bowl championship season. He also played on a team that was in the Heart of Dallas Bowl and endured a five-game losing streak in 2014. \n“You get the feeling and you get what it is to feel that way,” Simmons said. “I know what it is to be at those low times. It’s all good for you. You don’t ever want to be something where you are thinking too high of yourself. You can stay even keel the whole time. It’s a learning process. \n“Being at those times where you are low and you aren’t winning as much as you are used to, it’s good for you. Brings you back to reality and you know that you need to progress and work harder.” \nSimmons’ perspective also allows him to realize what a win like the one his team had against Texas on Saturday means. And if Simmons recognizes it, better believe the rest of the team does, too. \n“Think about all the circumstances of the game,” Simmons said. “Coaches not having the headsets, not having the opportunity to have another look and only going off word of mouth of what was going on in the field and being able to adjust and hold them to such little yards in the second half is a major boost for us. It’s a confidence boost as well. I just feel great that we finished and got the offense the ball back. We did our job.” \nDuring Simmons’ time at Oklahoma State, there has been emphasis on recruiting young talent at linebacker. If guys like Gyasi Akem, Justin Phillips, Josh Mabin and Kirk Tucker – the same people who rib Simmons with old man jokes – develop to their potential, Simmons’ significance will be felt well after he makes his last tackle. \n“I want to make sure I have impact on a lot of guys,” Simmons said. “When you leave here, you want people to have a good impression of you. I always try to make sure these guys know they can come to me with whatever, they can talk to me. We are all cool. I want to pass on whatever knowledge I can give them to help them out and progress. I’m here for them. \n“It’s always good to see guys that are progressing, doing well right now and in the future knowing what the program can be like.” \nFollow Stillwater News Press sports reporter Kieran Steckley on Twitter @Kieran_Steckley for Oklahoma State football updates and live game coverage throughout the season.  ", "external_links": [], "published": "2015-10-03T02:00:00.000+03:00", "crawled": "2015-10-05T12:07:57.824+03:00", "highlightTitle": ""}