{"organizations": ["Rugby Union", "Sport Howe", "Reuters", "Bournemouth", "Cardiff"], "uuid": "29c0648d0caf79eef55245db8936b7a0de41e47f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "http://s3.reutersmedia.net/resources/r/?m=02&d=20151013&t=2&i=1086613615&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB9C0CQ", "site_section": "http://mf.feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "http://uk.reuters.com/article/2015/10/13/uk-soccer-england-bou-howe-idUKKCN0S70UC20151013?feedType=RSS&feedName=sportsNews", "country": "US", "title": "Howe desperate to continue Bournemouth's rapid rise", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "Howe desperate to continue Bournemouth's rapid rise", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T13:13:00.000+03:00", "replies_count": 0, "uuid": "29c0648d0caf79eef55245db8936b7a0de41e47f"}, "author": "", "url": "http://uk.reuters.com/article/2015/10/13/uk-soccer-england-bou-howe-idUKKCN0S70UC20151013?feedType=RSS&feedName=sportsNews", "ord_in_thread": 0, "title": "Howe desperate to continue Bournemouth's rapid rise", "locations": ["Ireland", "Wales", "Bournemouth"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Howe", "Eli Walker", "Rebecca NadenLivepic"], "text": "Related: Sport Howe desperate to continue Bournemouth's rapid rise Rugby Union - Wales v Ireland - Dove Men Test - Millennium Stadium, Cardiff, Wales - 8/8/15Wales' Eli Walker (C) in actionAction Images via Reuters / Rebecca NadenLivepic \nBournemouth manager Eddie Howe is \"desperate\" to continue the club's meteoric rise over the last three seasons and credits a collective effort is the reason for their success. \nThe Cherries were sitting at the bottom of the third tier of English football when Howe took over for the second time and the manager has since guided them to two promotions in three seasons. \n\"I am desperate to move this club forward even more and to continue the success we have had,\" Howe told the Daily Echo. \n\"It is never about one person. It is a collective effort to produce a successful team. It requires everybody to move things forward and to help each other. \n\"The players are the most important ones because they have to go out and deliver and they have certainly done that for the last three years,\" the former Burnley manager added. \nBournemouth, however, have found it difficult in the Premier League as they lie 15th in the table and have picked up eight points from eight games, the lowest of any promoted side. \nThey have also lost several key players to long-term injuries, including leading goal-scorer Callum Wilson, record signing Tyrone Mings and summer recruit Max Gradel. \n\"Whenever you are in a position of responsibility, you are going to be criticised and there will be people waiting for you to fail. That is when you need a thick skin,\" Howe said. \n\"There are going to be setbacks and disappointments. It is all part of the job but you need to have a resilience and confidence in yourself that you can withstand the bad times and, hopefully, enjoy the successes. \n\"To this point, it has been a brilliant journey and I feel there is a lot more to come,\" the 37-year-old added. \n(Reporting by Shravanth Vijayakumar in Bengaluru, editing by Ed Osmond) \nOur top photos from the past 24 hours. Slideshow Trending On Reuters", "external_links": [], "published": "2015-10-13T13:13:00.000+03:00", "crawled": "2015-10-13T13:36:03.379+03:00", "highlightTitle": ""}