{"organizations": [], "uuid": "933d862ba2ab40b0139a6c3d3f88d374fa6a077c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/soccer", "section_title": "Soccer News, Scores, Schedule, Standings, Stats, Photos, Videos - MSN Sports", "url": "http://www.msn.com/en-us/sports/premier-league/search-for-the-legendary-football-hoaxster-turned-houdini/ar-AAftTpT", "country": "US", "title": "Search For the Legendary Football Hoaxster Turned Houdini", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "Search For the Legendary Football Hoaxster Turned Houdini", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "933d862ba2ab40b0139a6c3d3f88d374fa6a077c"}, "author": "Steve Menary", "url": "http://www.msn.com/en-us/sports/premier-league/search-for-the-legendary-football-hoaxster-turned-houdini/ar-AAftTpT", "ord_in_thread": 0, "title": "Search For the Legendary Football Hoaxster Turned Houdini", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Search For the Legendary Football Hoaxster Turned Houdini Bleacher Report 1 day ago Steve Menary © Solent News Ali Dia is a mystery, a man seemingly happy to let fiction blend with fact.\nAdChoices Two decades after perpetrating one of football's most brazen stunts by persuading Graeme Souness to let him play in the Premier League for Southampton , precious little is known about the man who purported to be the cousin of George Weah, the legendary former AC Milan player who won the Ballond'Or in 1995.\nWas Dia a prankster or a deluded dreamer? In the all-pervasive world of social media, he has succeeded in vanishing without a trace. So is he even alive, or maybe he never really existed at all?\nWith one of football's most mysterious figures celebrating his 50th birthday this year, Bleacher Report went in search of the Ali Dia legend, and in search of the truth...\nAli Dia. His name is plastered across the Internet. How a man dubbed the worst player to ever feature in the Premier League duped a hardened pro like Souness into giving him a game is legend.\nDia's story has been copied and pasted ad infinitumonline, but the real story of the Don Quixote of modern football is harder to pin down. What is certain is that Dia was not, as a his agent claimed , Weah's cousin. Nor did he ever play internationally for Senegal or at club level for Bologna or Paris Saint-Germain .\nSo who was Ali Dia?\nFirst of all, let's get his name straight. Constant repetition online tells us he was Ali Dia, but after a trawl through club records and newspaper archives and speaking to former playing colleagues, it appears when he first surfaced in France and at all his subsequent clubs he was known as AlyDia.\nHis Wikipedia profile suggests between 1988 and 1992 he was linked to French clubs Beauvais, Dijon, La Rochelle and Saint Quentin, but the French Football Federation told Bleacher Report there is no record of Ali/Aly Dia playing professional football as an overseas player in France.\nThose four clubs did not respond to questions about Dia, but in December 1993, AlyDia did sign a contract with AL Chateaubriant to play in National League Three, which is equivalent to the fifth tier of French football.\nThe deal was not for playing but for spending 87 hours a month working with the club's youth teams, and worth 3,030 French francs a month (around £343 today). Not a fortune, but Dia was a semi-professional footballer.\nHe lived on the Boulevard Victor Hugo, and club chairman Michel Bonnier told Bleacher Report that Dia played regularly in the A and B teams in 1993/94. Then on Aug. 1, 1994, Dia resigned.\n\"The player was looking for a new club,\" Bonnier said.\nGiven the number of times he was subsequently released, this could have been cause for regret, but Dia had bigger ambitions. After serving a three-month notice period, he left for Avignon, where he holed up at 13 Rue Saint Michel. But his dreams seemed to flounder.\nAfrican players were becoming increasingly prevalent in France, particularly those from former French colonies. Perhaps this was when Dia recognised the benefits of moving to a non-French speaking country, where he could create a new CV?\n\" @unibet : #HappyBirthday to the #BPL legend that is Ali Dia! #SaintsFC pic.twitter.com/W3CSBpQlO9 \" Ali Dia is a liar...\n— Megan Owen (@MegstasBar) August 20, 2015\nMaybe so, as when our protagonist reappeared, he succeeded in making his top-flight debut...in Finland.\nIn 1995, Dia joined Finnairin Palloilijat, a Helsinki-based club commonly known as FinnPa that was founded three decades earlier by staff from the Finnish national airline, Aero. In 1993, FinnPa won promotion to the Veikkausliiga, the top flight of Finnish football, for the first time.\nThe Veikkausliiga then included many players now well known in England, from SamiHyypia, later a Champions League winner with Liverpool, to striker ShefkiKuqi and goalkeepers Jussi Jaaskelainen, AnttiNiemi and TeuvoMoilanen.\nThe move was a step up, but it had been achieved with some now familiar tall tales. \"Yes, he was telling those stories [about George Weah] then,\" former FinnPa team-mate Kalle Lehtinensaid.\nWeah was a good man to invent connections with. In 1995, he won not only the Ballond'Or but also the FIFA Player of the Year award. European clubs were starting to buy into the potency of African players on a larger scale, but checking them out was not easy as the Internet was in its infancy. Much of the information would typically come through a third party.\nCould a semi-professional Finnish club confirm whether Dia was really Weah's cousin? No. Dia also discovered that not only did this invention get him a game, it also got him a good deal.\nFinnPa's roster started with youth academy players on £50 a week, but as an overseas player with a pedigree—albeit an imaginary one—Dia's former FinnPa team-mates believe he was among the top earners on £250 a week.\nDia made his FinnPa debut in the first round of Veikkausliiga matches at Haka on April 30, 1995. With eight minutes to go, he came on but made no impact in a 0-0 draw. Dia was introduced after 74 minutes in the sixth round away at VPS with FinnPa leading 2-0 but did nothing of note as his team won 3-1.\nDespite Aero's backing, the club had a small squad, and Dia reappeared in the eighth round of the Veikkausliiga on June 15 at home to Ilves. This time, he started. His moment had arrived, and Dia certainly made his mark.\nAccording to an account in the Finnish newspaper HelsinginSanomat, Dia was caught offside 10 times and spent most of the game ruining his own team's attacks.\nAt the end of the first half, a chance came to make amends. Dia was through on goal. With just the Ilves goalkeeper to beat, he sent his header tamely into Tommi Kainulainen's hands. FinnPa lost 3-1. Despite his inability to score or even stay onside, Dia played the entire match. That proved rare, but Dia did start FinnPa's next match away to FC Jazz.\nAfter an opening 45 minutes in which he was described by HelsinginSanomat as \"invisible,\" Dia was subbed a minute into the second half. His time at FinnPa was nearly up, but it would not be forgotten.\nOn June 21, he made his fifth and final appearance in the 10th round against Jaro. Back on the bench, Dia got on after 81 minutes but again to little effect. After five matches in the No. 18 jersey of FinnPa, Dia managed a yellow card but not a single goal.\n\"When Ali arrived, he had something. With the outside of his right foot, he could go round a defender,\" former team-mate SimoValakari told Bleacher Report. \"But that was all he had. After the first two weeks, bam, it was gone. Maybe it was the parties or something, but then he looked like he had never played football at all.\"\nIn early July, FinnPa's manager HeikkiSuhonen had just 13 fit players at training before an important game at MikkelinPalloilijat. \"Some of the players are being taped on the physio's table, and slowly FinnPa's situation is being revealed in all of its ugliness,\" HelsinginSanomat reported. \"One wonders where is French striker AlyDia?\"\nNot for the first time—or the last—he had vanished.\n\"Aly went to his mother's funeral, to France or Senegal, I don't know. He was supposed to return on Tuesday and according to my calendar it is Tuesday,\" Suhonen told the paper.\nFinnPa's situation became uglier. After being relegated in 1998, Aero pulled the plug. The club's debts were unsustainable. FinnPa collapsed.\nSpending £250 a week for a player who made no contribution could not have helped the club's financial situation, but that was far from FinnPa's only outlay on Dia.\nOn arriving in Helsinki, he was picked up at the airport by Valakari, who worked part-time in the FinnPa back office. The club paid for Dia to stay at a hotel, where he ran up a sizeable mini-bar bill, according to Valakari, before he moved into a flat rented by the club.\nWhen Dia disappeared after the Jaro game, Valakari was sent to the flat with the spare key. \"When I opened the door, I could not believe what I saw,\" Valakari said. \"It was like a hurricane had gone through the flat, and there were bones on the floor. It was like some kind of witchcraft.\"\nWhether those bones were witchcraft-related, or just the remnants of a KFC meal, no one knows, but Dia's Scandinavian adventure was not over.\nHe resurfaced in northern Finland and signed for PK-35, a club from Kakkonen then in the second tier Eastern Division. The tall tales continued. \"He just showed up and was telling people those stories,\" former team-mate Toni Korkeakunnas told Bleacher Report.\nDia scored once in three matches, then left.\nHis former team-mates at both clubs remember a private man. No one ever met any of Dia's friends or family, and his most well-known family connection proved a fiction.\n\"He was a very humble player in the dressing room. He didn't say a lot of words, but he was always smiling. He never talked of himself or his life, just that he had a wife in France,\" Valakari said.\nIn autumn 1995, Dia arrived in Germany at VfBLubeck. Like FinnPa, Lubeck had recently won promotion and were then at their highest level in the second Bundesliga. The second tier of German football was preferable to the freezing netherworld of the Finnish lower league.\nVfB Lubeck were then coached by Michael Lorkowski, who had previously won the DfB Cup with Hannover 96. After moving to Lubeck, Lorkowski's success continued with promotion to the second tier of German football.\nNow a social worker in Hamburg, Lorkowski recalls general manager HelmutSchulte brought Dia to VfBLubeck at the start of the 1995/96 season after also being taken in by the Weah connection.\nPleasant surprise: nice chat in cafeteria @UniHannover with Michael Lorkowski, coach @Hannover96 cup winner team 1992 pic.twitter.com/WRwjdvmFQF\n— Politics of Sports (@Danyel_Reiche) August 26, 2015\nAfter Dia scored five goals in a trial game, a tie to the AC Milan star did not look so unlikely. \"That must be his lucky day, then later he was incredible (sic) bad,\" says Lorkowski, who, briefly taken in by that five-goal haul, selected his new striker on Matchday 5.\nDia came on after 73 minutes of a game at Hannover 96 but made no impression in a 0-0 draw. Dia missed Matchday 6, but he got a second chance on Matchday 7 as Lubeck hosted VfB Leipzig. Again a sub, Dia was introduced on 62 minutes with Lubeck a goal down but made no mark as Leipzig won 2-0.\nAfter two matches, Dia's time in Germany was over. But his ambitions were undimmed as, armed with an imaginary CV that seemed to work, he set off for the UK and the most infamous period of his peripatetic footballing career.\nAfter arriving in England, Dia sought out trials at a number of clubs, including Gillingham. They have no record of his presence, but Bleacher Report confirmed he played a game for Rotherham United's reserves at the club's old Millmoor home.\nDia told Rotherham that he was a Senegalese international and had been with Lubeck the previous season. The latter, at least, was true—to a point. The last of his two brief appearances for the German side was 10 months earlier. He failed to impress against Stockport County's second string on Oct. 8, 1996. Stockport won 2-1. Dia was substituted.\nDia then dropped into the non-league game at Blyth Spartans, where he first met Peter Harrison, later a notorious football agent but then the Northern Premier League club's manager.\nOn Nov. 9, 1996, Dia came off the bench as Spartans lost 2-1 at home to Boston United. Then, once again, Dia vanished. \"He simply turned up at Southampton without us knowing,\" Blyth's veteran media manager Phil Castiaux told Bleacher Report.\nOn Nov. 22, Southampton received international clearance from the English Football Association for Dia, a manouvere made easier by his French wife. A day later, Dia made that solitary Premier League appearance for the Saints as a surprising replacement for Matt Le Tissier at the Dell against Leeds United.\nThat showing has been written about exhaustively ever since, but Dia's arrival did not merit a mention locally.\nGraham Hiley, then a young reporter at the Southern Daily Echo , recalled: \"I watched him in training, and I remember thinking he would not be signed as he did not look good enough and thought no more about him until I got to the ground.\n\"A fan told me he was on the bench, and I could not believe it. I felt really bad as I had not even put him in the squad, but then it never occurred to me that I should.\"\nJust 14 days after arriving, Dia was gone. His one-month contract at Southampton had been terminated midway through.\nDia went back up north, leaving a hotel bill unpaid. Records show he made a brief appearance for Port Vale's reserves—reportedly scoring both goals in a 3-2 defeat against Sunderland at Roker Park.\nNo offer followed. So he contacted Harrison, who ran a business called Activity Sportswear and worked as an agent. When Gateshead manager Colin Richardson called looking to buy some training tops, Harrison threw in an extra.\nGateshead had recently won promotion to the GM Vauxhall Conference, but despite the presence of Gary and Justin Robson, the two younger brothers of England legend, Bryan Robson, life in the top tier of the English non-league game was difficult. By November, Richardson was being described in print as \"beleaguered\" by the Gateshead Post .\nWhat Gateshead and their ebullient chairman John Gibson needed was a marquee signing. Who better than an African international striker?\nGibson is now a septuagenarian columnist for the Chronicle newspaper. In a 2014 column , he recalled:\nI spoke with my manager and a couple of other directors, then—deciding no one could take Dia at his word—I phoned the police on the south coast and the hotel where our intrepid international footballer had hung his hat.\nThere had been a whisper Ali had made a quick getaway in his car and that his hotel bill had remained unpaid.\nAnyway, we got all that sorted and decided that on a match-to-match basis we couldn't lose.\nOn Dec. 13, 1996, Dia signed until the end of that season. Briefly in Finland and Germany, Dia had shown signs of talent. He did so again on his Gateshead debut.\n\"Dia showed good pace and marked his debut with a late goal having already provided the assist for Paul Thompson to register his 13th goal of the campaign,\" the Gateshead Post reported as Bath City were hammered 5-0 at home. Dia was rated 7/10 by the Post .\nThe next day, the Sunday Mirror exposed Dia's long con and how he had tried the Weah trick on Bournemouth, Gillingham and Port Vale. But like his claims to have played for Bologna, Paris Saint-Germain or Senegal, this was all a fantasy.\nUnabashed, Dia played for Gateshead six days later with the customary smile recalled by all who knew him. Did he know about the Mirror story?\nHe shrugged it off in an interview with the Post , which loyally called the expose \"false allegations\" and noted Dia had recently scored for Senegal in a 3-1 World Cup qualifying win over Guinea. But Senegal never played Guinea—they were knocked out in the first round of the 1998 World Cup qualifiers by Togo.\nDia bullishly told the Post : \"I have been portrayed as a con man and a poor player, but I am neither and intend to prove people wrong.\n\"Obviously I'm disappointed not to have made it in the Premiership, but I've got faith in my own ability and my only concern now is Gateshead. My contract is just until the end of the season. But if things go well, who knows, I could stay longer.\"\nThings did not go well. After he had seemingly found his true level against Bath, Dia's performances dipped. He started the next two matches after being unmasked but did not score against Hednesford or Stalybridge.\nGateshead were now in a relegation dogfight. Richardson needed a hero.\nIn his fourth match, Dia played the full 90 minutes and had two good chances to score but missed. Gateshead slumped to a disastrous home defeat against Halifax. Worse followed. Dia played the whole next match at home to Telford and at one point humiliatingly lost the ball straight from the restart. He made amends by scoring with a header, but Gateshead lost 3-2, and Richardson was fired.\nThree backroom staff—Dave Clarke, Jeff Wrightson and Kenny Lowe—took charge for the next game in the FA Trophy at home to Runcorn. Dia was not even on the bench.\nAs rumours swirled around Gateshead about Richardson's successor, a lifeline appeared for Dia as Harrison was linked with the job.\nSurely his own agent would return him to the starting lineup? Instead, former Middlesbrough and Northern Ireland goalkeeper Jim Platt got the job.\nWhat was, by Dia's standards, the halcyon period of his career was nearly over.\nGateshead's first game under Platt was away to Slough. Dia was on the bench. On 66 minutes, Platt introduced his overseas \"star\" as a replacement for Justin Robson. After 18 minutes, he took him off again.\n\"When I brought him on, he was terrible,\" Platt told Bleacher Report two decades later. \"He was absolutely hopeless.\"\nDia was a substitute in Platt's second game against Kettering, but he stayed on the bench.\n\"John Gibson said we'd got the player from Southampton, and he was supposed to be our star player,\" Platt said. \"Gateshead only trained twice a week, and you don't get a chance look at a player until you see them in a match.\n\"I told Gibson that he wasn't for us.\"\nDia was put on the transfer list and disappeared—until he suddenly returned to the bench for a vital game at home to Bromsgrove.\nIn Dia's absence, Platt had revived Gateshead. Surely now was not the time to turn to a player whom the club's own manager thought was hopeless?\nDid somebody say… the new Ali Dia? #saintsfc pic.twitter.com/Awgh3pTF5G\n— Connor Armstrong (@ConnorArmstrong) September 23, 2015\nWith eight minutes to go, Platt took off Gary Innes for Dia, who got a warm reception. With a minute to go, Dia and the Gateshead forward line pressured Bromsgrove's Darren Growcutt into turning the ball into his own net, which resulted in a vital 1-0 win.\nIn his last appearance, Dia was part of a winning team. Rated 6/10 by the Post , he did not even finish last in the newspaper's player-of-the-season ratings. That ignominious position went to the injury-dogged Ian Brady.\nGateshead stayed up, but no one came in for Dia. He was released at the end of the season. A brief, fruitless spell ensued at Spennymoor United. The club folded in 2005. No one at the revived side, Spennymoor Town, recalls Dia. But he never gave up.\nIn the 1997/98 season, Gateshead's reserve team manager Alan Shoulder told Gibson that a player approached him in the club car park asking to join in training with a view to a possible trial.\nThat would-be trialist? Dia, of course.\nDia featured briefly for Gateshead's second string in the Wearside League early in the 1997/98 season before again vanishing.\nHe reportedly graduated from Northumbria University, as per the Scotsman , with a degree in business or finance in 2001, but he has since achieved the almost impossible feat of completely vanishing.\nThe only trail he left is in the endless Internet mentions. There are accounts in his name on Twitter and Facebook , but surely no one who accepts a friend request from Russ Tafari can be real? Or can they?\nThe Facebook account says he runs a sports agency called GO2 Football Representation, but no such company has been registered at Companies House.\nData Protection laws prevent the university from passing on details about Dia or even confirming that he has a degree from there, but in 2012 (before those laws were enacted), the university told FourFourTwo magazine they had lost touch with him.\nFourFourTwo claimed to have briefly spoken to Dia on his mobile in 2008, but he cut them off and changed the number two days later.\nJohn Gibson said his old signing \"seems to have fallen off the world.\"\nThere is no sign of an Ali or AlyDia on the UK electoral register, so maybe he never really existed?\n\"Maybe he changed his name, or maybe that was never really his name in the first place,\" Peter Harrison speculates.\nThat is certainly possible. Perhaps he invented the persona of Ali/Aly Dia to pursue a career in football, then reverted to who he really was.\nIn the 1990s, there was a Senegalese international called Aly Male playing with AS Douanes in Dakar. Was that whom Dia wanted to be?\nSports journalists in Dakar have never heard of a Senegalese international called Ali/Aly Dia. But was he even Senegalese? Weah was, after all, Liberian.\nThe man who called up and fooled Souness was called SidibaAlassana. Was he an agent, or a friend? Citing Data Protection, FIFA will not confirm if an agent has ever been licensed with this name. The Senegalese Football Federation did not respond to questions about Dia or Alassana.\nAnd what of Mrs. Dia? Dia told the Post in early 1997 that his wife was moving to Tyneside. At the time, Harrison owned two houses on the same Mount Lonnen terrace in Eighton Banks. Harrison lived in one, and for six months, he rented the other to Dia.\nAfter paying a visit to the semi-rural location of Eighton Banks, the idea of the Dias walking in the surrounding fields or dropping into the local pub, The Ship, for a post-match beer appears nice. But this, too, is a fantasy.\n\"I bumped into him out socialising in Newcastle, but I never met his wife,\" Harrison told Bleacher Report.\nWas Mrs. Dia too, like his relationship with Weah, a figment of Dia's imagination?\nHaving a French wife secured his work permit, but throughout his travels in Europe, there were no confirmed sightings or meetings of her.\nLike Dia's team-mates, Harrison recalls a personable guy who gave little away. \"He was a bit of a mystery,\" said Harrison, who has moved from Eighton Banks.\nSo is this really a mystery that's impossible to solve? Who was this quixotic character? Was he a delusional fantasist or a cynical fabricator?\nPlatt told Bleacher Report: \"He wasn't a bad fella. He was quite personable. Even when I took him off, he just smiled. But if you had any belief in yourself, you would react badly. Other players would have just told me to f--k off.\"\nDespite being ridiculed—Le Tissier later described Dia as being like \" Bambi on ice \"—as he showed from FinnPa to Saints, Dia was just happy to play, no matter how foolish he looked to the watching crowd.\nAnd he had enough front to convince football people in at least three countries that he was related to Weah. That he was an international. That he had played at the top level. When he was exposed, Dia had sufficient balls to play on—albeit not very well.\nDia also made money out of the game. In the short spell from joining Saints to playing for Gateshead, he pocketed £3,500 in signing-on fees. Souness later admitted Southampton paid Dia about £2,000 for his 14 days at the club, while Dia received a £1,500 signing-on fee at Gateshead.\nAt Gateshead, he was again among the top earners. Gary Robson was reputed to be on £400 a week at the Tyneside club, but he had made nearly 300 Football League appearances. Dia was on a similar amount after one Premier League appearance.\n\"He must have been on at least £400 a week as he was paying me rent and always paid that,\" said his agent Harrison.\nIn our more linked-up world, the crazy tale of Ali/Aly Dia seems unlikely to occur again in the English Premier League, but maybe it could elsewhere.\nKorkeakunnas, Dia's former team-mate, is now coach of FC Lahti in the Finnish Premier League. He is constantly swamped with CVs of African players of dubious provenance. These come from unknown agents, who are, due to recent FIFA changes, also unregulated.\nPerhaps Dia is out there somewhere combining his business degree with one of football's more fantastical playing careers and telling young players: \"Yes, you too can play in the Premier League, just like me...\"\nAll Quote: s were gathered firsthand unless otherwise stated. Information presented from newspaper reports, along with accounts of matches Dia played in, was gathered during research by the author.\nGo to MSN Home", "external_links": ["https://twitter.com/hashtag/HappyBirthday?src=hash", "http://t.co/WRwjdvmFQF", "http://t.co/W3CSBpQlO9", "https://twitter.com/hashtag/BPL?src=hash", "https://twitter.com/Danyel_Reiche/status/636502427970207744", "https://twitter.com/ConnorArmstrong/status/646766384748359680", "http://t.co/Awgh3pTF5G", "http://bleacherreport.com/", "https://twitter.com/Hannover96", "https://twitter.com/MegstasBar/status/634422691341172736", "http://www.scotsman.com/news/so-whatever-happened-to-ali-dia-the-premiership-s-worst-player-1-1358809#axzz3oXodZHwy", "https://twitter.com/hashtag/saintsfc?src=hash", "https://twitter.com/UniHannover", "http://www.chroniclelive.co.uk/lifestyle/nostalgia/gibbo-files-ali-huge-souness-7016814", "https://en.wikipedia.org/wiki/Ali_Dia", "http://news.bbc.co.uk/sport2/hi/football/1118488.stm", "http://go.microsoft.com/fwlink/?LinkID=286759", "http://www.youtube.com/watch?v=GyT1r_oVcdA", "https://twitter.com/hashtag/SaintsFC?src=hash", "http://www.footballfancast.com/football-blogs/whatever-happened-to-ali-dia", "http://www.theguardian.com/football/blog/2008/nov/22/southampton-championship", "https://www.facebook.com/AliDiaBarmyArmy?fref=ts", "https://twitter.com/unibet", "https://twitter.com/alidia_sotonleg"], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-17T17:21:45.500+03:00", "highlightTitle": ""}