{"organizations": [], "uuid": "5b2468be4e7dea4a03dc10ee1a8f6f361e46a77a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deccanherald.com", "main_image": "http://www.deccanherald.com/page_images/original/2015/10/24/508057.gif", "site_section": "http://www.deccanherald.com/rss/sports.rss", "section_title": "Deccan Herald - Sports", "url": "http://www.deccanherald.com/content/508057/ugly-scene-kotla-gambhir-tiwary.html", "country": "US", "title": "Ugly scene at Kotla as Gambhir, Tiwary nearly exchange blows", "performance_score": 0, "site": "deccanherald.com", "participants_count": 1, "title_full": "Ugly scene at Kotla as Gambhir, Tiwary nearly exchange blows", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T03:00:00.000+03:00", "replies_count": 0, "uuid": "5b2468be4e7dea4a03dc10ee1a8f6f361e46a77a"}, "author": "New Delhi", "url": "http://www.deccanherald.com/content/508057/ugly-scene-kotla-gambhir-tiwary.html", "ord_in_thread": 0, "title": "Ugly scene at Kotla as Gambhir, Tiwary nearly exchange blows", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ugly scene at Kotla as Gambhir, Tiwary nearly exchange blows New Delhi, Oct 24, 2015, (PTI) There were ugly scenes at Feroz Shah Kotla ground as rival captains Gautam Gambhir and Manoj Tiwary nearly came to exchanging blows during the Ranji Trophy match between Delhi and Bengal, here today. \n\nSituation came to such a pass that umpire K Srinath had to come between the two players as Gambhir moved towards Tiwary to hit him and he also came charging at the Delhi skipper.\n\nIn fact in an unprecedented ugly gesture, Gambhir even pushed umpire Srinath, who was trying to get him out of the way to hit Tiwary.\n\nTouching umpire is a grave offence in cricket, which could invite a ban.\n\nThe incident happened in 7.1 over when Partha Sarathi Bhattacharjee got out of Manan Sharma's bowling and Tiwary came in to bat at No. 4 wearing a cap.\n\nTiwary first took guard and was about to take strike. But he stopped the bowler and signalled at the dressing room to bring his helmet as a pacer was operating from the other end.\n\nDelhi players felt that it was a deliberate time wasting tactic.\n\nManan ticked off Manoj and he told him to lay off. All of a sudden, Gambhir, at first slip, got into the action and started abusing the Bengal skipper, who then retaliated.\n\nSuddenly all hell broke loose as Gambhir said: \"Shaam ko mil tujhe maroonga (Meet me in the evening, I will hit you). And Tiwary retorted, saying: \"Shaam kya abhi bahar chal (Why wait till evening, let's go out and settle it now\").\n\nUmpire Srinath then sprinted from bowler's end.\n\nGambhir with his fists raised charged towards Tiwary, who was also not ready to back down. Umpire Srinath came in the middle, but Gambhir to everyone's horror pushed the umpire trying to get him out of the way.\n\nManoj was then seen shouting at Gambhir, saying: \"Did I tell you anything? Why did you have to come in between.\"\n\nBoth Tiwary and Gambhir will be summoned by the match referee Valmick Buch.", "external_links": [], "published": "2015-10-24T03:00:00.000+03:00", "crawled": "2015-10-24T14:31:30.628+03:00", "highlightTitle": ""}