{"organizations": ["West Salem High School", "GVC"], "uuid": "c689f8ad66d1d81abed573b5e038e791f674e0aa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.statesmanjournal.com", "main_image": "http://www.gannett-cdn.com/-mm-/d0225c7bc4d281f9f8ce4bae770092f767b49eb8/c=0-247-3000-1935&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/14/Salem/B9319211362Z.1_20151014004456_000_GTDC82VCM.1-0.jpg", "site_section": "http://rssfeeds.statesmanjournal.com/salem/sports", "section_title": "Salem - Sports", "url": "http://www.statesmanjournal.com/story/sports/high-school/2015/10/14/west-salem-sweeps-west-albany-take-gvc-lead/73911430/", "country": "US", "title": "West Salem sweeps West Albany to take over GVC lead", "performance_score": 0, "site": "statesmanjournal.com", "participants_count": 0, "title_full": "West Salem sweeps West Albany to take over GVC lead", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T07:51:00.000+03:00", "replies_count": 0, "uuid": "c689f8ad66d1d81abed573b5e038e791f674e0aa"}, "author": "", "url": "http://www.statesmanjournal.com/story/sports/high-school/2015/10/14/west-salem-sweeps-west-albany-take-gvc-lead/73911430/", "ord_in_thread": 0, "title": "West Salem sweeps West Albany to take over GVC lead", "locations": ["West Albany", "Ore", "Albany", "West Salem"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Bill Poehler", "Paige Whipple"], "text": "West Salem sweeps West Albany to take over GVC lead Bill Poehler , Statesman Journal 9:51 p.m. PDT October 13, 2015 Buy Photo Main photo: West Salem High School's Paige Whipple goes up for kill past West Albany defenders during their volleyball game on Tuesday, Oct. 13, 2015, in Albany, Ore. Secondary photo: Members of the West Salem High School team celebrate a point against West Albany during their volleyball game. (Photo: ASHLEY SMITH / STATESMAN JOURNAL) Buy Photo 12 CONNECT 7 TWEET LINKEDIN COMMENT EMAIL MORE \nALBANY – A conference championship eluded West Salem High School's volleyball team for almost a decade. \nIf the Titans hit anything like they did Tuesday night in a sweep of West Albany then the Greater Valley Conference championship is inevitable. \nWest Salem had a stellar .429 hitting percentage as they beat West Albany 25-19, 25-18, 25-17 on the road to take over sole possession of the GVC lead. \n\"It's a great feeling,\" junior setter Mattie Kelly said. \"We're going really far and it's awesome to be a part of it at West Salem and representing our school.\" \nWest Salem improves to 15-3 and 12-1 in the Greater Valley Conference, and drops West Albany to 12-2 in conference and 13-7 overall. \nThis is the latest in a season West Salem has been in sole possession of a conference lead since 2007. \n\"It feels very good, but we still have pressure on us because everybody wants to take a game from us and we have to just be ready to go,\" coach Katie Herber said. \"We have to be ready to go against McMinnville on Thursday, we got to turn it around and bring it to Sprague on the following Tuesday and we got McNary, which is a huge match for us. \n\"The way I look at it is this is one big hurdle for us, where we took the pressure, which is huge. This team has struggled with the pressure, and we were able to keep our nerves down and overcome.\" \nA West Albany team that placed third in the Class 6A state tournament last season and won the conference title a year ago couldn't keep up with the offense that West Salem produced. \nJunior outside hitter Paige Whipple had 19 kills by hitting .548 and junior middle blocker Delaney Smith had 12 kills by hitting .647. \nThe setting of Kelly, who had 39 assists, was key, but Kelly also had three blocks and disrupted West Albany's offense from the front row. \n\"She's definitely very smart with her placement,\" said Whipple, who also had 10 digs and two aces. \"The setters have setters practice every day before practice. All they do is reps, reps, so that they're setting the same ball, consistent spot every time, and it's just clicked with Mattie and she's starting to get really consistent. \n\"I've never seen her block like that. It was amazing. And she's really been working. She's been going to training and stuff, working on her vertical and she's gotten so much better.\" \nBoth teams started the match hitting high percentages in the first set. West Albany led at 19-18 until Delaney Smith's kill started a 7-0 West Salem run to clinch the first set. \nWest Salem led almost the entirety of the second set and Kelly worked different hitters into the offense and into different positions. \nWest Albany led the early stages of the third set until Whipple broke a 13-13 tie with a kill, a block and a kill for three straight points to launch the Titans to a 10-1 run, capped off by two consecutive aces by Whipple for a 21-14 lead. \nThe development of the Titans from even a few weeks ago is remarkable. The team is playing error-free and asserted itself as a team to contend with on the state level. \n\"We've been escalating ever since our first game,\" Kelly said. \"We haven't hit our rough patch yet so it's nice that we're continually improving every match, every game, every practice.\" \nbpoehler@StatesmanJournal.com, (503) 399-6701 or twitter.com/bpoehler \nWest Salem d. West Albany 3-0 \nScores: 25-19, 25-18, 25-18 \nAt West Albany \nKills- Whipple (WS) 19. Digs- Whipple (WS) 10. Blocks- Kelly (WS) 3. Assists- Kelly (WS) 39. Aces- Whipple (WS) 2. 12 CONNECT 7 TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http://stjr.nl/1RGFb6i TOP VIDEOS", "external_links": [], "published": "2015-10-14T07:51:00.000+03:00", "crawled": "2015-10-14T08:56:32.851+03:00", "highlightTitle": ""}