{"organizations": ["Columbia College", "Etsy Store"], "uuid": "47ca21ce6d8830f2e4c13ba550fb2e04aace6b1b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.uniondemocrat.com", "main_image": "", "site_section": "http://feeds.feedburner.com/UnionDemocrat", "section_title": "The Union Democrat, Sonora, CA News, Sports, & Weather", "url": "http://www.uniondemocrat.com/index.php?option=com_content&task=view&id=117945&Itemid=199", "country": "US", "title": "Sonora woman weaves business out of beads", "performance_score": 0, "site": "uniondemocrat.com", "participants_count": 0, "title_full": "Sonora woman weaves business out of beads", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T04:00:00.000+03:00", "replies_count": 0, "uuid": "47ca21ce6d8830f2e4c13ba550fb2e04aace6b1b"}, "author": "", "url": "http://www.uniondemocrat.com/index.php?option=com_content&task=view&id=117945&Itemid=199", "ord_in_thread": 0, "title": "Sonora woman weaves business out of beads", "locations": ["Sonora", "Columbia State Historic Park", "Bay Area"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Lacey Peterson", "Elliott", "Stacey Elliott", "Marilyn Elliott"], "text": "Sonora woman weaves business out of beads Sonora woman weaves business out of beads By Lacey Peterson, The Union Democrat October 21, 2015 01:00 am Stacey Elliott, of Sonora, began making animals and other creatures out of beads about six years ago after seeing similar creations at a craft fair in the Bay Area. Lacey Peterson / Union Democrat, Copyright 2015. It was at a craft show in the Bay Area that Stacey Elliott was inspired to make animals and creatures out of beads at prices anyone could afford. The Sonora woman said she saw really cool beaded animals, but the small ones were $150, way out of the price range for most people. So Elliott went home and started making her own. Her first was a replica of her dog. That was six and a half years ago, and Elliott said local event organizers and residents have been so supportive she has been able to turn her hobby into a business. When Elliott first started making animals and other creatures out of beads and wire, the only books she could find with patterns were in German, so she learned by sight. Now she makes her own patterns for her menagerie of creations. The smallest animals she makes take about half an hour, she said, and the largest, a tarantula, takes her about three days or 10 hours, depending on how she breaks it up. Elliott said she’s always been interested in beadwork and that her mom was always supportive of her artistic endeavors. Before starting her own business, Elliott Bead Creations, and opening an Etsy store online, Elliott worked in the retail and food industries. She graduated from Columbia College as a business major and uses that knowledge in her business. About the time Elliott started doing beadwork full time, she was working as a gas station attendant and was robbed at gunpoint. She was 24 at the time and said the incident was traumatizing. She experienced post traumatic stress disorder and would get really nervous in public. Doing the beadwork has been therapeutic, Elliott said. “It’s more of a relaxation thing for me” than it is work, she explained. Elliott has a mountain of glass beads at home and attends local craft shows and farmer’s markets to sell her wares. Her mom, Marilyn Elliott, of Sonora, makes and sells natural gemstone jewelry, and the pair operate a booth together. She said American Indian pow-wows make up a bulk of her sales. She has a booth each year at the local Tuolumne Me-Wuk Acorn Festival and said the tribe has been very supportive of her business. She also had a booth at the recent Festifall all at Columbia State Historic Park, and she is a regular at the Friday night Farmers Market in Angels Camp. Making beaded animals is fun and different, Elliott said. “I haven’t had anybody duplicate it,” she said. Each piece has her trademark — a small metal tag with a howling coyote — a tribute to her Alaskan malamute. Her collection of animals range from small spiders and turtles priced around $5 to mermen, dinosaurs, penguins, lions, lemurs and sharks. She even made a goose that laid a golden egg. Her highest priced items are $100. Elliott said it’s important to her to offer affordable items so that children, who really enjoy her creations, can afford to buy them. “That way, if a kid only has $5, they can get something,” Elliott said. Elliott’s Etsy Store is online at www.etsy.com/shop/ElliottBeadCreations, or she can be reached by email at This e-mail address is being protected from spam bots, you need JavaScript enabled to view it", "external_links": [], "published": "2015-10-21T04:00:00.000+03:00", "crawled": "2015-10-22T08:29:25.548+03:00", "highlightTitle": ""}