{"organizations": [], "uuid": "54e6cfa9b067c5b94cc8b6f1f66e86c1c9faf60e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "mdjonline.com", "main_image": "http://matchbin-assets.s3.amazonaws.com/public/sites/624/thumbs/HM9H_rgbKSU_vs_POINT_08.jpg", "site_section": "http://mdjonline.com/rss/rss/Sports?instance=Sports&content_type=article&tags=sports&tag_inclusion=or&offset=0&limit=10&page_name=rss", "section_title": "Sports", "url": "http://mdjonline.com/bookmark/26902943", "country": "US", "title": "Owls show they can throw the ball as well as they can run it", "performance_score": 0, "site": "mdjonline.com", "participants_count": 1, "title_full": "Owls show they can throw the ball as well as they can run it", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T08:31:00.000+03:00", "replies_count": 0, "uuid": "54e6cfa9b067c5b94cc8b6f1f66e86c1c9faf60e"}, "author": "John Bednarowski sportseditor@mdjonline.com (noreply@mdjonline.com)", "url": "http://mdjonline.com/bookmark/26902943", "ord_in_thread": 0, "title": "Owls show they can throw the ball as well as they can run it", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Owls show they can throw the ball as well as they can run it by John Bednarowskisportseditor@mdjonline.com The Marietta Daily Journal  31 AM | 403 views | 0 | 3 | | With Point’s Jalen Outten around his waist, Kennesaw State receiver Justin Sumpter uses his left hand to corral a pass from Trey White for a touchdown in the first half Saturday. The Owls’ option-based offense put up 308 yards through the air in dominating their final non-conference game. Staff photo by Kelly J. Huff slideshow KENNESAW — Chaston Bennett scored three touchdowns and Kennesaw State rolled up 699 yards of total offense as the Owls routed Point 56-17 on Saturday at Fifth Third Bank Stadium.Kennesaw State (4-1) completed its non-conference schedule by dominating NAIA-level Point (5-2) in nearly every aspect of the game. Coach Brian Bohannon said it was important to make the corrections that plagued the Owls two weeks ago in their 31-27 loss at Dayton.“It was a big deal for us to come out with a purpose,” Bohannon said. “We came out business-like and got some work done. We did a better job with special teams. I think we played an all-around football game.”The Owls completed 12 passes for 308 yards and ran the ball 58 times for 391 yards — all without a 100-yard receiver or runner. The defense held Point to 340 yards of offense — nearly 100 yards under its average — and allowed only one quick strike with an 86-yard touchdown pass that came on a broken play.One of the highlights for Kennesaw State, with the exception of Jae Bowen’s 49-yard touchdown run down the sideline, was the offensive line and running game taking complete control without the benefit of big plays. The Owls won the time of possession by a nearly 14-minute margin by punishing the Point defensive line with 5-, 6- and 7-yard runs all afternoon.“We definitely got better (Saturday),” Bohannon said. “We’re going to get in games where we’re going to have to grind it out. We made progress on it, without a doubt.”Quarterback Trey White had his best game of the season, completing nine of 14 passes for 239 yards, along with three touchdowns to complete Kennesaw State’s first three scoring drives. White hit Darnell Holland for a 43-yard touchdown in the first quarter, connected with Bennett on a 69-yard wheel route to start the second and then found Justin Sumpter for a 19-yard touchdown pass to put the Owls up 21-0 with 8:31 left before the half.Bennett led all receivers with 90 yards, while Holland had 84 and Bowen 53. “We had a great game plan,” White said. “My job is to get the ball in the hands of our best athletes.”After Bowen got the running game going with his touchdown, Bennett, who led the Owls with 70 rushing yards, scored from 14 yards out late in the second quarter. He added his second rushing touchdown midway through the third quarter to push Kennesaw State’s lead to 42-10. Backup quarterback Jake McKenzie, who replaced White in the second half, added a 14-yard touchdown run, and CheDarious Robinson scored from 3 yards out in the fourth to make the score 56-10.In all, 13 different players carried the ball for Kennesaw State. McKenzie finished with 64 yards, Bowen had 60, White 55 and Holland 41.Starting running back Micah Reed ran for 39 yards, but he was forced out of the game with a leg injury in the first half. Bohannon said Reed could miss next week’s Big South Conference opener against Gardner-Webb, but it was too early to know the extent of the injury. Linebacker Kyron Minter and defensive back Taylor Henkle were also banged-up, though Bohannon said he said he thought they would both be alright. Minter left the game with a trainer holding his left arm after a big hit while making a tackle in the second quarter. Henkle, who was noticeably limping in the second half, continued to play on defense, but he was replaced by Bowen on punt return duties. Share This Article | similar stories", "external_links": [], "published": "2015-10-11T08:31:00.000+03:00", "crawled": "2015-10-11T14:24:31.129+03:00", "highlightTitle": ""}