{"organizations": [], "uuid": "a7674d9bfe1d415f628440b3453165c9c9c39f30", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/49071581.cms", "site_section": "http://timesofindia.indiatimes.com/Sports/More-sports/Cycling/articlelist/3413195.cms", "section_title": "Cycling - More sports - Sports - The Times of India", "url": "http://timesofindia.indiatimes.com/sports/more-sports/cycling/Linda-Villumsen-wins-womens-world-time-trial-title/articleshow/49071537.cms", "country": "IL", "title": "Linda Villumsen wins women's world time trial title", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "Linda Villumsen wins women's world time trial title - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-09-23T20:13:00.000+03:00", "replies_count": 0, "uuid": "a7674d9bfe1d415f628440b3453165c9c9c39f30"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/sports/more-sports/cycling/Linda-Villumsen-wins-womens-world-time-trial-title/articleshow/49071537.cms", "ord_in_thread": 0, "title": "Linda Villumsen wins women's world time trial title", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "RICHMOND: Danish-born New Zealander Linda Villumsen, five times previously on the podium without a victory, broke through on Tuesday to win the women's individual time-trial at the World Road Cycling Championships.\nThe 30-year-old Kiwi, who won last year's Commonwealth Games time-trial, captured the world crown by completing the 29.9km (18.5 miles) course in 40mins 29.87secs.\nDutch star Anna Van der Breggen was the runner-up, 2.54 seconds back, with 2014 world champion Lisa Brennauer of Germany third, 5.26 off the pace.\n\"I just can't believe it. I really can't believe it,\" Villumsen said. \"Everything has turned out my way. It's incredible.\"\nVillumsen, who became a New Zealand citizen six years ago, was third at worlds in 2009, 2010 and 2012, and second in 2011 and 2013. She was also fourth in the 2012 London Olympics, missing a medal by less than two seconds.\n\"It's difficult being every time on the podium and nearly there and not quite there and almost there,\" Villumsen said. \"It all worked out my way today and it feels great.\"\nRacing over the longest women's world time-trial course in 20 years helped, Villumsen said.\n\"I like a longer course,\" she said. \"Usually I fade out a little bit. On a longer course I hold myself back. When I was halfway and I wasn't empty, I thought, 'This is going well.'\"\nEven after she moved into the lead, she was scared she might miss out again until her dream finally came true.\n\"I don't really know how I did it. I could only think: 'go as fast as I can,'\" she said. \"At the end, I was like, 'I'm not going to say anything until the last rider is across.'\"\nGerman-born Australian Katrin Garfoot was fourth, just ahead of two-time reigning Olympic champion Kristin Armstrong, a 42-year-old American and two-time world champion back from retirement.\nArmstrong was the second of 44 riders on the course, leaving nearly 2 1/2 hours before last-out Brennauer, but had the time to beat entering the final wave of riders.\nDrama built as Villumsen, third out in the final wave, reached 7km 6.43 seconds ahead of Armstrong, and Van der Breggen trimmed that interval best by four seconds.\nFrom there, Villumsen set the pace all the way to the finish.\n\"I expected a big fight for the medals,\" Brennauer said.\nVan der Breggen, 25, added to a season that saw her win the Women's Giro d'Italia and La Course by Le Tour as well as the Dutch time-trial title.\n\"It's nice to be on the podium,\" she said. \"My season has gone better than I expected. I'm very happy.\"\nBrennauer, 27, claimed the last podium spot only two days after helping Velocio capture a fourth consecutive women's team time-trial crown.\n\"I tried not to overpace it,\" Brennauer said. \"I tried to save enough for the last straight. I'm pretty happy with my strategy. With that climb at the end there's not much you can hold back.\"\nArmstrong missed the podium spot that would have secured a berth at next year's Rio de Janeiro Olympics, where she hopes to \"Three-peat.\" Armstrong is already the oldest women's Olympic time-trial champion and the event in Rio is scheduled to be staged on the eve of her 43rd birthday. ", "external_links": ["https://play.google.com/store/apps/details?id=com.toi.reader.activities"], "published": "2015-09-23T20:13:00.000+03:00", "crawled": "2015-10-01T00:23:39.997+03:00", "highlightTitle": ""}