{"organizations": [], "uuid": "66acd74c81c55106570ebd79ae1d9b39c36cbbbe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wlox.com", "main_image": "http://WLOX.images.worldnow.com/images/6341016_G.jpg", "site_section": "http://www.wlox.com/Global/category.asp?C=1705&nav=DYFw&clienttype=rss", "section_title": "WLOX - SPORTS", "url": "http://www.wlox.com/story/30173830/the-friday-night-football-showdown-kicks-off-week-7", "country": "US", "title": "The Friday Night Football Showdown kicks off Week 7", "performance_score": 0, "site": "wlox.com", "participants_count": 1, "title_full": "The Friday Night Football Showdown kicks off Week 7", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T22:18:00.000+03:00", "replies_count": 0, "uuid": "66acd74c81c55106570ebd79ae1d9b39c36cbbbe"}, "author": "AJ Giardina", "url": "http://www.wlox.com/story/30173830/the-friday-night-football-showdown-kicks-off-week-7", "ord_in_thread": 0, "title": "The Friday Night Football Showdown kicks off Week 7", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Friday Night Football Showdown kicks off Week 7 Posted: agiardina@wlox.com BILOXI, MS (WLOX) - \nThe 2015 high school football season is moving along at a quick pace. It's week 7 and teams are jockeying for position to crack the state playoffs. \nTyler Bouldin and I will have highlights from six games on the Friday Night Football Showdown beginning at 10:15 on WLOX-ABC/CBS, followed by the Friday Night Football Showdown Post Game Show on WLOX.com at 10:35. \nThe Pass Christian Pirates have run off three consecutive wins and travel to Hancock County, a date with the home standing Bay High Tigers. Coach Casey Wittmann's 3-2 Pirates are coming off wins over South Jones, West Harrison and West Lincoln. The Tigers of head coach Jeff Hopgood have also posted a 3-2 record and open Region 8-4A play against the Pirates. \nSt. Stanislaus opened the season against high profile opponents losing to Gulfport, St. Paul's of Mobile and Brother Martin of New Orleans with a win over Long Beach in the Rockachaws first four games. Coach Bill Conides watched his Rockachaws beat D'Iberville 35-34 two weeks ago that gives them confidence and momentum as St. Stanislaus opens the Region 8-4A race tonight at home hosting Vancleave. \nIn Region 4-6A play the Ocean Springs Greyhounds travel to D'Iberville. The 4 and 1 Greyhounds opened region play with a 17-13 decision over Hancock last Friday. The Warriors knocked off Biloxi 35-17. It will be the Ocean Springs defense trying to contain D'Iberville quarterback Jacquelle Green, the Louisville commitment. \nHarrison Central goes after back-to-back wins and more importantly back-to-back wins in Region 4-6A, on the road at Biloxi tonight. The Red Rebels flexed their muscle last Friday with a 55-26 win over previously unbeaten George County in Lyman. Harrison Central took advantage of a number of Rebel turnovers. The Indians dropped a 35-17 decision to D'Iberville last week and quarterback Tray Shaffer was shaken up in the game. \nSt. Martin hopes to bounce back under the win column against Hancock in the Kiln. Gulfport handed the Yellow Jackets a 28-10 setback, the first loss of the season for St. Martin. The Hawks were stopped at the one yard line as time expired last Friday and Ocean Springs held off Hancock 17-13. Hawks running back and defensive back Michael Scardino returned last week and he's a player who can score from any place on the field. \nPearl River Central has been piling up the points this season and the Blue Devils are coming off a 68-28 win over Stone. PRC is 4 and 1 on the season, 1 and 0 in the Region race and travel to Gautier tonight. The Gators dropped a tough 28-21 decision to Picayune last week and are led by quarterback LeCharles Pringle. \nThose are the six games featured on the the WLOX Friday Night Football Showdown, plus we'll have all the scores. \nGet out and support your local high school football teams! \nCopyright 2015 WLOX. All Rights Reserved. Can't Find Something?", "external_links": [], "published": "2015-10-02T22:18:00.000+03:00", "crawled": "2015-10-02T22:30:17.007+03:00", "highlightTitle": ""}