{"organizations": ["Wallabies"], "uuid": "265cf116892302b122dcabae1441e1a2a29d44ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pendletontimespost.com", "main_image": "", "site_section": "http://pendletontimespost.com//feed/sec/6000/", "section_title": "PendletonTimesPost.com - Sports News", "url": "http://www.pendletontimespost.com/view/story/d259eca0182f487d8db01d773e488e5d/RGU--RWC-Referee-Controversy/", "country": "US", "title": "Aussies defend referee's exit, say bottle thrown on field", "performance_score": 0, "site": "pendletontimespost.com", "participants_count": 0, "title_full": "Aussies defend referee's exit, say bottle thrown on field", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T19:28:00.000+03:00", "replies_count": 0, "uuid": "265cf116892302b122dcabae1441e1a2a29d44ad"}, "author": "", "url": "http://www.pendletontimespost.com/view/story/d259eca0182f487d8db01d773e488e5d/RGU--RWC-Referee-Controversy/", "ord_in_thread": 0, "title": "Aussies defend referee's exit, say bottle thrown on field", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["JOHN PYE"], "text": "Wallabies coach defends referee's hasty departure after bottle thrown on pitch at World Cup By JOHN PYE AP Sports Writer   12:28 pmLast   12:28 pm   \nSubjects: \nUnited Kingdom (463) \n\nLONDON — Craig Joubert has drawn the ire of Scotland, where they're screaming dark blue murder over his contentious late penalty call that cost their team a Rugby World Cup quarterfinal victory against Australia before he ran from the field at Twickenham. \nEx-Scotland international Gavin Hastings said the South African referee's hasty exit from the field after Australia's last-minute, 35-34 win on Sunday was \"one of the worst things I have seen on a rugby field.\" On the BBC, he accused Joubert of not wanting to face the Scottish players in the wake of the decision. \nHe demanded Joubert be \"sent home\" and not be allowed to officiate in another test. \nFormer England scrumhalf Matt Dawson condemned Joubert's quick departure as a \"disgrace.\" In a Twitter post that was retweeted thousands of times, Dawson said: \"How dare you sprint off the pitch after that decision!!\" \nAustralia coach Michael Cheika defended Joubert on Monday, saying his speedy exit was likely because a bottle was thrown onto the pitch. \n\"Someone threw a bottle at him, didn't they? I'd be racing off, too, if I saw a bottle coming,\" said Cheika, who has been sanctioned in the past for criticizing match officials. \"I don't think anything of him going off quickly. \n\"I don't like the way that people are making something out of the way he ran off the field.\" \nJoubert was harshly criticized in the British press for awarding the penalty for a Scottish offside infringement following a lineout in their own half in the 78th minute, when the ball was tapped loose and ricocheted forward from one man in a dark-blue jersey to another. In the process, the ball apparently came into contact with Australia replacement scrumhalf Nick Phipps, but Joubert didn't see that from his angle, and made the call based on instinct. \nHe couldn't ask for a review from the Television Match Official, because referrals can only be sought when awarding a try or assessing acts of foul play. \nIf he'd seen the ball hit Phipps' hand, Joubert could have ruled it an accidental offside by Scotland and awarded Australia a scrum. \nGiven the Wallabies had scored five tries — and had one disallowed by the TMO after a referral by Joubert — and were within range to attempt a dropped goal, there's no saying the Scots would have won, anyway. \nIt was two opportunistic tries, including Mark Bennett's intercept in the 74th minute, and accurate goalkicking from captain Greig Laidlaw that gave the Scots the chance at an against-all-odds victory with five minutes remaining. \nIt's also questionable if the English media would have been so outraged at a decision going against Scotland if the Scots weren't the last European team left in contention. \nAustralia's win ensured that, for the first time, all of the Rugby World Cup semifinalists came from one hemisphere — the south. Australia will play Argentina, and defending champion New Zealand will play South Africa. \nThe All Blacks trounced France by a record margin, Argentina beat Six Nations champion Ireland 43-20 and South Africa scored a late try to beat Wales. Those wins came before the Australians played Scotland, which was given almost no chance of ending the southern hemisphere streak but got the closest to it. \nScotland coach Vern Cotter said he needed to review the game before commenting on the calls, but said he thought a TMO decision on a yellow card for his winger, Sean Maitland, in the second half was 50-50. Laidlaw said he believed the last penalty was wrongly awarded, and thought the referee may have had the same feeling when he watched a replay on the big screen as Bernard Foley was lining up Australia's winning kick. \nWorld Rugby chief executive Brett Gosper, an Australian, said he didn't know why Joubert left the field so quickly, but backed the referee's integrity. \nHe noted the controversy, though, and said Joubert's performance would be subject to a regular assessment by Joel Jutge, head of match officials. \nCheika said he has been stunned by the backlash, adding that nobody questioned any decisions that went against his team. \n\"I've been really interested to see some of the rhetoric that's come out about officialdom over the week,\" Cheika said. \"Some decisions you'll get and some decisions you won't. \n\"Everything in rugby is open to interpretation because everything in rugby is a contest. That's the great thing about rugby — it's a contest sport.\" \nAll content copyright ©2015 Pendleton Times-Post, a division of Home News Enterprises unless otherwise noted.", "external_links": [], "published": "2015-10-19T19:28:00.000+03:00", "crawled": "2015-10-19T21:07:42.281+03:00", "highlightTitle": ""}