{"organizations": [], "uuid": "205e66b41bf61ff5e73aa25677ee279e06ebcd31", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattlepi.com", "main_image": "http://www.seattlepi.com/img/pages/article/opengraph_default.png", "site_section": "http://www.seattlepi.com/sports/more/", "section_title": "More Seattle Sports News / NBA, NHL, Golf, Tennis - seattlepi.com", "url": "http://www.seattlepi.com/news/article/Former-Joint-Chiefs-chairman-Dempsey-joining-NBA-6545212.php", "country": "US", "title": "Former Joint Chiefs chairman Dempsey joining NBA as adviser", "performance_score": 0, "site": "seattlepi.com", "participants_count": 1, "title_full": "Former Joint Chiefs chairman Dempsey joining NBA as adviser - seattlepi.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "205e66b41bf61ff5e73aa25677ee279e06ebcd31"}, "author": "seattlepi.com", "url": "http://www.seattlepi.com/news/article/Former-Joint-Chiefs-chairman-Dempsey-joining-NBA-6545212.php", "ord_in_thread": 0, "title": "Former Joint Chiefs chairman Dempsey joining NBA as adviser", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (AP) — Gen. Martin Dempsey , the recently retired chairman of the Joint Chiefs of Staff , was appointed special adviser to NBA Commissioner Adam Silver on Friday.\nDempsey, the highest-ranking U.S. military officer the past four years, will participate in NBA functions and serve as chairman of the newly formed Jr. NBA Leadership Council . His position begins Jan. 1.\nSilver called him \"one of our country's most respected leaders, as well as a brilliant strategist.\"\n\"General Dempsey's unwavering commitment to a life of service reflects the values that we strive to embody as an organization, and I am delighted he will continue his work with the league,\" the commissioner said in a statement.\nDempsey worked closely with the NBA through the league's Hoops for Troops program, which conducted basketball clinics and health seminars on military bases throughout the country. He said basketball has always been a favorite sport in his family and he's \"seen firsthand how it can bring people together.\"\n\"After four decades of service in the United States armed forces, I look forward to working with the league to help improve communities and positively impact the children of civilian and military families,\" Dempsey said.\nDempsey will take part in the NBA's overseas exhibition games and its All-Star weekend, and participate in some league meetings. The leadership council he will chair will aid the NBA's efforts to engage 5 million youth over the next two years through basketball organizations, live events and interactive experiences.\nDempsey joined U.S. men's basketball coach Mike Krzyzewski , a fellow graduate of the U.S. Military Academy , and USA Basketball chairman Jerry Colangelo in August on a leadership panel at Nellis Air Force Base in Nevada. He participated in other league and USA Basketball activities during his time as chairman of the Joint Chiefs, which ended late last month.", "external_links": ["http://ap.org/schemas/03/2005/apcm", "http://ap.org/schemas/03/2005/apnm"], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-02T21:07:21.005+03:00", "highlightTitle": ""}