{"organizations": [], "uuid": "5a4c487ed05b870fda4caacdc344d09661c8c361", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wlox.com", "main_image": "http://WAFB.images.worldnow.com/images/4660140_G.jpg", "site_section": "http://www.wlox.com/Global/category.asp?C=1705&nav=DYFw&clienttype=rss", "section_title": "WLOX - SPORTS", "url": "http://www.wlox.com/story/30207293/kickoff-for-lsu-vs-south-carolina-game-set-for-230-pm-in-baton-rouge", "country": "US", "title": "Kickoff for LSU vs. South Carolina game set for 2:30 p.m. in Baton Rouge", "performance_score": 0, "site": "wlox.com", "participants_count": 1, "title_full": "Kickoff for LSU vs. South Carolina game set for 2:30 p.m. in Baton Rouge", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T01:30:00.000+03:00", "replies_count": 0, "uuid": "5a4c487ed05b870fda4caacdc344d09661c8c361"}, "author": "WAFB Staff", "url": "http://www.wlox.com/story/30207293/kickoff-for-lsu-vs-south-carolina-game-set-for-230-pm-in-baton-rouge", "ord_in_thread": 0, "title": "Kickoff for LSU vs. South Carolina game set for 2:30 p.m. in Baton Rouge", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kickoff for LSU vs. South Carolina game set for 2:30 p.m. in Bat - WLOX.com - The News for South Mississippi Member Center: Kickoff for LSU vs. South Carolina game set for 2:30 p.m. in Baton Rouge Posted: Wednesday, October 7 2015 6:30 PM EDT 2015-10-07 22:30:36 GMT Source: WAFB LSU has scheduled a 5 p.m. news conference today to discuss logistics of this Saturday’s LSU-South Carolina football game that will now be held at Tiger Stadium. More >> LSU has scheduled a 5 p.m. news conference today to discuss logistics of this Saturday’s LSU-South Carolina football game that will now be held at Tiger Stadium. More >> Updated: Wednesday, October 7 2015 5:21 PM EDT 2015-10-07 21:21:31 GMT The University of South Carolina Athletics Department has decided to move this weekend's game against the LSU Tigers to Death Valley in response to this weekend's unprecedented floods. University Athletics Director Ray Tanner announced on Tuesday that the school was thinking about moving the game because of the safety of fans trying to get to Williams-Brice Stadium. Tanner said the stadium was in good shape, however.Copyright 2015 WIS. All rights reserved. More >> The University of South Carolina Athletics Department has decided to move this weekend's game against the LSU Tigers to Death Valley in response to this weekend's unprecedented floods. University Athletics Director Ray Tanner announced on Tuesday that the school was thinking about moving the game because of the safety of fans trying to get to Williams-Brice Stadium. Tanner said the stadium was in good shape, however.Copyright 2015 WIS. All rights reserved. More >> Wednesday, October 7 2015 11:30 AM EDT 2015-10-07 15:30:57 GMT LSU head coach Les Miles (Source: WAFB) LSU head coach Les Miles and South Carolina head coach Steve Spurrier spoke Tuesday morning during the SEC coaches weekly media teleconference and there were several questions about the location of the game. More >> LSU head coach Les Miles and South Carolina head coach Steve Spurrier spoke Tuesday morning during the SEC coaches weekly media teleconference and there were several questions about the location of the game. More >> Updated: Oct 06, 2015 11:58 PM 2015-10-07 10:29:13 GMT LSU will play the University of South Carolina this weekend, but where the game will be held has yet to be determined. South Carolina has been hit recently by heavy rains and flooding. More >> LSU will play the University of South Carolina this weekend, but where the game will be held has yet to be determined. South Carolina has been hit recently by heavy rains and flooding. More >> BATON ROUGE, LA (WAFB) - \nIf viewing this story on a mobile device or in an email, click the link to watch the 6 p.m. news conference about Saturday's LSU-USC game - http://shout.lt/bfpXz \nOfficials have announced the game between South Carolina (2-3, 0-3 SEC) and No. 7 LSU (4-0, 2-0 SEC) will be played in Tiger Stadium in Baton Rouge. LSU tweeted that the kick off will be at 2:30 p.m. Central. \n\"After much thought and consideration, and in conjunction with local and state authorities and with our own university administration, we have made the decision to move Saturday’s football game to Baton Rouge,\" University of South Carolina athletics director Ray Tanner said. \"Changing venues on such short notice is no easy task, and I would like to thank LSU President F. King Alexander and athletics director Joe Alleva for their cooperation and flexibility in working with us to change the site for Saturday’s football game.\" \nThe LSU ticket office reported season ticket holders will get the first shot at purchasing tickets at some time Wednesday afternoon. The general public will be allowed to purchase tickets starting Thursday at 6 p.m. #LSU ticket office - season ticket holders get first shot this afternoon sometime, general public Thursday 6 pm. @Wafb — Jacques Doucet (@JacquesDoucet) October 7, 2015 \nTickets that were issued for the game when it was scheduled to be played in South Carolina will not be valid at Tiger Stadium. Click here for more ticket and parking information . \nMark Ewing, LSU senior associate athletic director, said minus LSU expenses for hosting the game, all ticket sales will be transferred to South Carolina as it is the Gamecocks' home game. \nLSU sports information director Michael Bonnette said LSU will be in its normal locker room and on its normal sideline. \nThe game was scheduled to be televised on ESPN, but according to Bonnette, the television situation is being worked on. \nBonnette also said the Tigers will be sensitive to South Carolina when it comes to \"hype videos,\" etc. #LSU band will perform, 325 strong as usual for home games. They were all contacted yesterday, anticipating this, per Roy M King. @WAFB — Jacques Doucet (@JacquesDoucet) October 7, 2015 \nLSU Band Director Roy King says the LSU band is learning South Carolina Gamecocks' alma matter and fight song, and plans to incorporate them into the pregame. #LSU band is learning South Carolina Gamecocks' alma matter + fight song, plans to incorporate in pregame, per Roy M King. @WAFB — Jacques Doucet (@JacquesDoucet) October 7, 2015 \nThe game was moved due to the flooding around Columbia, SC. \nOfficials with USC said William-Brice Stadium, where the game was originally scheduled to be played, is in good shape. There were concerns about the safety of fans and the use of resources needed for saving lives and property. \nCopyright 2015 WAFB . All rights reserved. Can't Find Something?", "external_links": [], "published": "2015-10-08T01:30:00.000+03:00", "crawled": "2015-10-08T02:21:23.539+03:00", "highlightTitle": ""}