{"organizations": [], "uuid": "a4629675d74d04789adee3828841026a4e543af8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.buffalonews.com", "main_image": "http://www.buffalonews.com/storyimage/BN/20151002/SPORTS/151009723/AR/0/AR-151009723.jpg&exactW=1000&exactH=1000&AlignV=middle&Q=80", "site_section": "http://www.buffalonews.com/section/rssGen?profileID=1004&profileName=Sports", "section_title": "The Buffalo News - Sports", "url": "http://www.buffalonews.com/sports/auto-racing/clark-considered-a-living-legend-among-local-drivers-20151002", "country": "US", "title": "Clark considered a living legend among local drivers", "performance_score": 0, "site": "buffalonews.com", "participants_count": 1, "title_full": "Clark considered a living legend among local drivers - Sports - The Buffalo News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T02:47:00.000+03:00", "replies_count": 0, "uuid": "a4629675d74d04789adee3828841026a4e543af8"}, "author": "buffalonews", "url": "http://www.buffalonews.com/sports/auto-racing/clark-considered-a-living-legend-among-local-drivers-20151002", "ord_in_thread": 0, "title": "Clark considered a living legend among local drivers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "This is the fifth in a series of stories profiling the Greater Buffalo Sports Hall of Fame Class of 2015.\nBy Owen O’Brien\nNews Sports Reporter\nIt’s impossible for Art Clark to forget about his racing career because no one will let him.\nClark will be inducted into the Greater Buffalo Sports Hall of Fame on Nov. 4. Since his induction was made public, he’s received phone calls and letters from friends, family and racing fans nearly every day.\nBut it goes even beyond congratulatory calls. Clark never knew exactly how many races he won over his 52-year career until he received a package in the mail from a fan with each of his victories documented, printed out and put together behind plastic sleeves. The total number: 339 main events, which is even more impressive knowing Clark didn’t win a main event until his ninth year. Clark’s amazed at the response he’s received over his career.\n“It’s an honor,” said Clark, who began his racing career at Buffalo’s Civic Stadium, later known as War Memorial Stadium. “Every day I go out to the mailbox and get cards congratulating me for being inducted into the Hall of Fame. I must have 25-30 cards from the last two weeks.”\nEverything Clark learned about cars came through trial and error. He’d work on something for a week or two, and if it failed, it meant he did something wrong. He started as young as 12 years old in Orchard Park. Clark became so talented that his mother let him use their barn for mechanical repairs.\nClark lost his father at 4 years old, ironically in a car wreck. He was told throughout his childhood that racing was in his blood – that he was meant to work with cars.\n“Evidently I got the smell of that exhaust fumes and it stuck with me,” Clark said.\nRacing was Clark’s love, but he was smart enough to realize it was also his best advertisement. When he’d race on weekends, thousands of people learned his name – and often saw him win. So when their cars got banged up, they came to Clark’s garage. His garage was just called “Art Clark.” There was no fancy name. No clever advertisements. All he needed was the respect gained on the raceway.\nFrom working on other people’s cars, he began to realize how he could improve his own. Since Clark started racing, he did all the work on his own car. He did all the experimenting and improving. He wouldn’t even take cash sponsorships on his No. 7 car.\nHe did make a compromise though. Clark would never take money, but because he was doing the work on his car, he would put a business’ name on his car for a few weeks in exchange for things like car parts and tires. When Clark expanded his garage, now located in West Seneca, he needed concrete. He received the concrete in exchange for putting the owner’s name on his car.\nClark had plenty of sponsorship opportunities, but he turned them all down. Ultimately Clark “didn’t want to be obligated to you for supporting” his “hobby.”\nAnd that was how Clark always viewed racing, as a hobby. Sure, he made his share on money on the racetrack. One race he’ll never forget is when he won $8,000 in Canada in 1974. He also made money with the work in his garage. So don’t be mistaken, racing was monetarily rewarding for Clark. But once the fun was gone, Clark was done.\nHe ended his career is 2005, despite still winning six events that year against much younger drivers. But he felt he lost the passion. Today, Clark doesn’t have to drive much anymore. His house is right next to his auto repair garage. It’s the same West Seneca garage he spent 50 years working on cars – both his own and the community’s. When Clark’s surrounded by old car parts, pictures, letters, ladders, tires, nuts, bolts and everything else that goes into building a car, he’s in his comfort zone.\nAnd trophies. Don’t forget about the trophies. Make sure not to have a medal detector when walking into Clark’s home or the hardware will attack. His entire living room, yes, entire living room, is filled with every trophy he’s ever won. Trophies, stuffed animals from his grand kids and an old television are the only things that fill the room.\n“I told a guy once I had to quit racing because I ran out of room for the trophies,” Clark joked.\nAlthough his racing career is over, Clark’s certainly not in relaxation mode. In August, he was up on the roof fixing the garage for the shop. His friends tell him to stop doing that kind of stuff, but he can’t help himself. He feels the need to be working.\nClark will forever be synonymous with Western New York racing. And it doesn’t look like anyone will forget that any time soon.\nThe Greater Buffalo Sports Hall of Fame induction ceremony is Nov. 4 at the Buffalo Niagara Convention Center. Tickets are $95 each, $850 for a table of 10 and includes a 25th anniversary book. RSVP by Oct. 19 at www.gbshof.com .\nemail: sports@buffnews.com", "external_links": [], "published": "2015-10-03T02:47:00.000+03:00", "crawled": "2015-10-03T04:45:00.987+03:00", "highlightTitle": ""}