{"organizations": [], "uuid": "e6606610e094ea2422e84532e914cd5520d1bb55", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ksl.com", "main_image": "http://img.ksl.com/slc/2568/256836/25683619.jpg", "site_section": "http://ksl.com//xml/294.rss", "section_title": "KSL / Sports Home / Local", "url": "http://www.ksl.com/?sid=36899041&nid=1153&s_cid=rss-extlink", "country": "US", "title": "Weber State wins 24-21 overtime thriller in Montana", "performance_score": 0, "site": "ksl.com", "participants_count": 1, "title_full": "Weber State wins 24-21 overtime thriller in Montana", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T05:54:00.000+03:00", "replies_count": 0, "uuid": "e6606610e094ea2422e84532e914cd5520d1bb55"}, "author": "Mark Douglas, KSL.com Contributor", "url": "http://www.ksl.com/?sid=36899041&nid=1153&s_cid=rss-extlink", "ord_in_thread": 0, "title": "Weber State wins 24-21 overtime thriller in Montana", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By | Posted \nMISSOULA, Mont. — The last time Weber State won in Missoula was in 1987, and that streak ended Saturday night. \nOn the first play in overtime, Weber State forced a fumble to gain possession. After pushing the ball to the 10-yard line, senior WSU place-kicker Josh Kealamakia sent the ball through the uprights for a 27-yard field goal to secure the 24-21 upset win over No. 12 Montana. \nThis Wildcat win comes just one week after a 44-0 blowout loss at home to Southern Utah University. Weber had won its two previous games before losing to SUU but looked to have taken a step back after the huge loss. Weber put the tough defeat behind it and went into a hostile environment to pick up a huge win against a high-caliber Montana team. \nWeber State had success running the ball with 253 yards on the ground. Power back Eric Wilkes led the charge by rushing for 112 yards and a touchdown before going down with an injury late in the fourth quarter. \nThis is the second 100-plus yard rushing performance for the running back this season. Wilkes has proven to be highly effective in the return game as well, picking up 438 total yards over the last six games. \nQuarterback Jadrian Clark found seams in the Montana defensive line and added 87 yards on the ground. The junior took several big hits during the game, including a crushing hit in the first quarter from a UM linebacker as he was trying to pick up a first down. \nMontana scored 14 straight points after giving up a quick first-half touchdown to Weber early in the first quarter. Montana quarterback Chad Chalich found success early in the first half, throwing 136 yards with a touchdown connection to wide receiver Ben Roberts. Chalich also picked up 24 yards on the ground before going down with a foot injury just before halftime. He did not return for the remainder of the game. \nBoth teams ramped up the defense in the second half with the only points scored coming off a Montana touchdown pass at the 4:51 mark in the fourth quarter to tie the game 21-21. \nJunior WSU linebacker Tre'von Johnson put on a dominating performance on the defensive end picking up 13 tackles and forcing the overtime fumble to secure the victory. \nThis victory moves Weber State back to .500 with a 3-3 overall record on the season and 2-1 in Big Sky Conference play.", "external_links": [], "published": "2015-10-11T05:54:00.000+03:00", "crawled": "2015-10-11T09:19:45.517+03:00", "highlightTitle": ""}