{"organizations": ["NFL", "AP Philadelphia Eagles", "Northwest Arkansas News Sticking"], "uuid": "75f89e01b2c1c91815f8f5942deaeae0e67497af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.google.com", "main_image": "http://media.arkansasonline.com/img/photos/2015/10/15/resized_99263-2cchipkellymugbw_25-20167.jpg", "site_section": "http://news.google.com/news?pz=1&cf=all&ned=us&hl=en&topic=s&output=rss", "section_title": "Sports - Google News", "url": "http://news.google.com/news/url?sa=t&fd=R&ct2=us&usg=AFQjCNGzr2fRtV_0Hs7Zq3wXemCp8bD6ow&clid=c3a7d30bb8a4878e06b80cf16b898331&cid=52778970060558&ei=H8cgVuHEMpvya4vroqgB&url=http://www.nwaonline.com/news/2015/oct/16/sticking-with-the-pros-kelly-insists-20/", "country": "IL", "title": "Sticking with the pros, Kelly insists - Northwest Arkansas News", "performance_score": 0, "site": "google.com", "participants_count": 0, "title_full": "Sticking with the pros, Kelly insists - Northwest Arkansas News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T10:46:00.000+03:00", "replies_count": 0, "uuid": "75f89e01b2c1c91815f8f5942deaeae0e67497af"}, "author": "", "url": "http://news.google.com/news/url?sa=t&fd=R&ct2=us&usg=AFQjCNGzr2fRtV_0Hs7Zq3wXemCp8bD6ow&clid=c3a7d30bb8a4878e06b80cf16b898331&cid=52778970060558&ei=H8cgVuHEMpvya4vroqgB&url=http://www.nwaonline.com/news/2015/oct/16/sticking-with-the-pros-kelly-insists-20/", "ord_in_thread": 0, "title": "Sticking with the pros, Kelly insists - Northwest Arkansas News", "locations": ["Philadelphia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Matt Rourke", "Chip Kelly", "Bob Brookover", "Kelly"], "text": "Sticking with the pros, Kelly insists By Bob Brookover The Philadelphia Inquirer Posted: October 16, 2015 at 2:40 a.m. Matt Rourke) Credit: AP Philadelphia Eagles head coach Chip Kelly speaks with members of the media at the NFL football team's practice facility, Thursday, Oct. 15, 2015, in Philadelphia. \nSorry Southern California. Forget about it Texas. Dream on Maryland. \nPhiladelphia is the place Chip Kelly would rather be and, all things considered, he would have to be insane to think otherwise. \nAs the Eagles have struggled to find some level of consistency through their first five games this season, one constant remained Thursday. Kelly, for the third consecutive season, shot down the rumors and reports that suggested he might be interested in a return to coaching at the college level. \n\"No,\" Kelly said before a questioner could complete his sentence about the sad and sudden job opening at USC after Athletic Director Pat Haden fired troubled coach Steve Sarkisian earlier this week. \nKelly repeated the word \"no\" three more times, but he knows that probably won't stop the speculation the next time a big-time college job becomes available. \n\"I know you have an obligation and I understand that,\" Kelly said before his team went through another practice in preparation for Monday night's NFC East showdown with the New York Giants. \"It's going to happen. We're not successful and we're not winning. I came from college; I'm going to go back to college. I hope someday to be like [Giants] Coach [Tom] Coughlin and win enough games where I can stay around long enough where the speculation ends.\" \nIt really should end now. \nSure, USC is a prestigious program with 11 national championships, seven Heisman Trophy winners and a Hollywood backdrop. Texas, with its nine national titles and its own television network, also is an attractive job. The Longhorns reportedly had interest in Kelly after his first season with the Eagles and they could again after this one. Even Maryland has been mentioned as wanting to make a run at Kelly. Good luck with that. \nTruth is, USC, Texas, Maryland and every other major program in college football has the same chance of landing Kelly: None. \nAt his introductory news conference in 2013, Kelly made it clear how he felt about the issue of being a hit-and-run NFL coach like Nick Saban was in Miami or former Arkansas Razorbacks coach Bobby Petrino in Atlanta. \n\"I'm all in,\" Kelly said. \"I think it was Cortez who burned the boats. I've burned the boats, so I'm not going back. I'm in. I'm an NFL coach and this is where I want to be. If there was any indecision ... I wouldn't have made the jump.\" \nThings, of course, can change. Jim Harbaugh probably could not have envisioned returning to his alma mater at Michigan when the San Francisco 49ers reached the Super Bowl in 2012. But that was before his relationship with team CEO Jed York deteriorated. \nThings have also changed for Kelly since the head coach \"burned the boats.\" The alterations in his case, however, have built an even stronger bond between Kelly and the Eagles. Why would a man who wanted to coach at the game's highest level consider leaving when he just recently won an epic power struggle? \nKelly, after the offseason ouster of general manager Howie Roseman, is the rare coach who also has final say on team personnel. Owner Jeffrey Lurie is the only man he has to answer to and it would be difficult to find a more loyal boss in the NFL. \nIt is a perfect situation for a man who is all about the football and it's much easier to be all about the football when you don't have to make recruiting trips and pat boosters on the back. \nKelly looks at these college openings without any interest. Rest assured, however, that the next time a storied college program is in search of a head coach, Kelly's name will immediately and inanely surface again. \nSports on 10/16/2015", "external_links": [], "published": "2015-10-16T10:46:00.000+03:00", "crawled": "2015-10-16T12:45:46.588+03:00", "highlightTitle": ""}