{"organizations": [], "uuid": "fa8019ea47e59f2faa39c0b013f37fc04f0180cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "sports.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/VGA_I8dn9CajMmg7Wyp9GQ--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://media.zenfs.com/en_us/Sports/ap/201510071629593804377.cf.png", "site_section": "http://sports.yahoo.com/ncaab/rss.xml", "section_title": "Yahoo Sports - NCAA Men's Hoops News", "url": "https://sports.yahoo.com/news/iowa-looking-uthoff-become-star-15-16-212746328--ncaab.html", "country": "US", "title": "Iowa looking for Uthoff to become a star in '15-16", "performance_score": 0, "site": "yahoo.com", "participants_count": 1, "title_full": "Iowa looking for Uthoff to become a star in '15-16 - Yahoo Sports", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "fa8019ea47e59f2faa39c0b013f37fc04f0180cd"}, "author": "LUKE MEREDITH (AP Sports Writer)", "url": "https://sports.yahoo.com/news/iowa-looking-uthoff-become-star-15-16-212746328--ncaab.html", "ord_in_thread": 0, "title": "Iowa looking for Uthoff to become a star in '15-16", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Done . View photo\nIowa's Jarrod Uthoff (20) drives up court during the second half of an NCAA college basketball game … IOWA CITY, Iowa (AP) -- From Matt Gatens to Devyn Marble to Aaron White , Iowa's best teams under Fran McCaffery have been led by a senior standout.\nIs Jarrod Uthoff next in line?\nThe answer to that question could determine whether the Hawkeyes make it back to the NCAA Tournament.\nUthoff certainly seems like he's ready to step up after ranking second on the team with 12.4 points, 6.4 rebounds, 1.6 blocks and just over one steal per game as a junior last year. Iowa, which went 22-12 in 2014-15, opens its sixth season under McCaffery on Nov. 13 against Gardner-Webb.\n''He definitely has the potential to be the Big Ten Player of the Year,'' Iowa point guard Mike Gesell said. ''He's that type caliber of player...he's ready to make his mark.''\nIowa's methodical rise to national relevance has been mirrored by the steady progression of McCaffery's best players.\nRecent history suggests that Uthoff could be in for by far the biggest season of his career.\nBy the end of 2011-12, Gatens was one of the best players in the Big Ten. He became the first Iowa player in 15 years to lead the team in scoring in seven straight games, and his heroics might have been enough to drag the Hawkeyes into the NCAA Tournament had they not been done in by a weak non-conference schedule.\nMarble actually made his leap during the NIT as a junior, averaging 20.6 points a game while leading Iowa to the title game. He then averaged 17 points a game in 2013-14, helping Iowa return to the NCAA Tournament for the first time in eight years.\nWhite more than made up for Marble's departure for the NBA last season. He, like Marble, was a first-team All-Big Ten pick as a senior - and he became the first Hawkeye in 30 years to lead the team in points (16.4), rebounds (7.3) and steals (1.3) per game.\nIowa could use a star turn from Uhtoff, who has been told repeatedly by McCaffery to be more aggressive.\n''It gives you more confidence in yourself. For me, my teammates back me up and say 'Yo, you should've taken that shot. You got that'... I think that helps me the most. When you've got coach (McCaffery) telling me to be more aggressive, it helps my confidence,'' Uthoff said.\nThe difference between Uthoff and Iowa's previous top options is that he's much more laid back than those three players.\nBut he might have more raw ability that anyone McCaffery has ever had at Iowa.\nThere's little Uthoff can't do on the floor. He was Iowa's top 3-point shooter last season, and he can beat guys off the dribble with ease. Uthoff excels in transition, but he can also guard bigger guys in the paint.\nThe fact that Uthoff was the only player in the country with at least 50 steals, 55 blocks and 35 steals a year ago is proof of just how versatile he is.\n''I want him to put it on the floor, shoot 3s, drive the ball, shoot his pull-up, post up. He's got a very unique game,'' McCaffery said. ''He's got that big shot-making ability.''\nThe next step for Uthoff is to prove he can be the star the Hawkeyes need. After all, he's the only returnee who averaged more than 8 points a game last year.\n''Jarrod Uthoff does not have the same personality as Aaron White,'' McCaffery said.'' That said, he's one of the hardest-working people I've ever been around. That, in and of itself, is a great example to the young guys we brought in. He's more likely to talk less and have a big impact.''\n---\nFollow Luke Meredith on Twitter at www.twitter.com/LukeMeredithAP and on Facebook at www.facebook.com/LukeMeredithAP\nSports & Recreation Basketball Fran McCaffery Devyn Marble   31890/85227  ", "external_links": [], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-09T16:03:07.431+03:00", "highlightTitle": ""}