{"organizations": [], "uuid": "fd3af7a627bd82ea113fed0bbca9fe2d4f2bb965", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/49261269.cms", "site_section": "http://timesofindia.indiatimes.com/sports/racing/trackometer/articlelist/10436849.cms", "section_title": "Trackometer - Racing - Sports - The Times of India", "url": "http://timesofindia.indiatimes.com/world/south-asia/Aung-San-Suu-Kyi-says-she-will-lead-govt-if-party-wins-Myanmar-polls/articleshow/49260051.cms", "country": "IL", "title": "Aung San Suu Kyi says she will lead govt if party wins Myanmar polls", "performance_score": 0, "site": "indiatimes.com", "participants_count": 2, "title_full": "Aung San Suu Kyi says she will lead govt if party wins Myanmar polls - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:16:00.000+03:00", "replies_count": 1, "uuid": "72e0f6422d5f2f4c3f01c6a3872b65fd39b21c8d"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/world/south-asia/Aung-San-Suu-Kyi-says-she-will-lead-govt-if-party-wins-Myanmar-polls/articleshow/49260051.cms#post-0", "ord_in_thread": 0, "title": "Aung San Suu Kyi says she will lead govt if party wins Myanmar polls", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "YANGON: Myanmar opposition leader Aung San Suu Kyi said Wednesday if her party wins upcoming elections she will lead the country from behind the scenes circumventing a clause in the constitution that bars her from the presidency.\nIf the November 8 vote is credible, most observers believe Suu Kyi's National League for Democracy party will win the most seats in the country's parliament.\nBy forming a coalition with smaller parties, it could control a majority.\nA clause in the 2008 constitution, drafted when the country was under military rule, prevents Suu Kyi from taking the top job because her late husband and two children are British nationals.\nThere are no obvious alternatives within her party's ranks.\n\"I've made it quite clear that if the NLD wins the elections and we form a government, I'm going to be the leader of that government whether or not I'm the president,'' Suu Kyi told Indian television channel India Today TV.\n\"Why not?'' she asked with a smile. ``Do you have to be a president in order to lead a country?''\nMyanmar, a predominantly Buddhist nation of 59 million people, began moving from a half-century of military rule toward democracy in 2011. Though there are many concerns _ including the exclusion of ethnic Rohingya Muslims from the process and irregularities in voting lists _ most observers believe next month's elections are the country's best chance in decades for relatively free and credible polls.\nUnder the constitution, however, the military will hold 25 percent of the seats in parliament regardless of the outcome. It also will retain control of all portfolios related to national security.\nSuu Kyi said in the interview, released ahead of its broadcast Wednesday night, that the constitution needs to be amended to change that _ a comment she acknowledged was likely to anger the still-powerful military.\nSuu Kyi was under house arrest during 1990 elections that were swept by her party, but the military annulled the results and refused to hand over power. The following year, she won the Nobel Peace Prize, but the junta confined her to her home for much of the next 20 years. Stay updated on the go with Times of India News App. Click here to download it for your device.", "external_links": ["https://play.google.com/store/apps/details?id=com.toi.reader.activities"], "published": "2015-10-08T03:16:00.000+03:00", "crawled": "2015-10-07T18:29:02.012+03:00", "highlightTitle": ""}