{"organizations": [], "uuid": "21a193b29a792dded43c54497832aa3b8d93ab61", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/ab2fbc76e50d59d5ce733238ed7aa8e6.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/golf/italys-andrea-pavan-in-a-share-of-the-lead-at-hong-kong-ope/6972096/", "country": "JE", "title": "Italy's Andrea Pavan in a share of the lead at Hong Kong Open", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "Italy's Andrea Pavan in a share of the lead at Hong Kong Open", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T09:32:00.000+03:00", "replies_count": 0, "uuid": "21a193b29a792dded43c54497832aa3b8d93ab61"}, "author": "", "url": "http://www.sport.co.uk/golf/italys-andrea-pavan-in-a-share-of-the-lead-at-hong-kong-ope/6972096/", "ord_in_thread": 0, "title": "Italy's Andrea Pavan in a share of the lead at Hong Kong Open", "locations": ["Hong Kong Open Italy", "Italy"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Andrea Pavan"], "text": "Italy's Andrea Pavan in a share of the lead at Hong Kong Open 22 Oct 2015 06:32:01 \ncomments \nItaly's Andrea Pavan made the ideal start as he battled to retain his European Tour card for next season in the Hong Kong Open on Thursday. \nPavan came into the week 191st in the Race to Dubai and needing to finish second or better to climb into the top 110 and keep hold of his playing privileges. \nThat would represent a career-best for the 26-year-old, who has never recorded a top-three finish, but four birdies in his last six holes gave him an opening 64 and a share of the lead with Taiwan's Lu Wei-chih on six under par. \nLu, who came close to retirement three years ago after undergoing brain surgery, won three times on the Asian Tour before a non-malignant tumour was discovered in 2012. \nThe 36-year-old carded eight birdies and two bogeys in his 64 and benefited from giving himself a pep talk after falling one over par early in his round. \n\"Today, the first three holes, I was not feeling very focused on the golf course,\" Lu said. \"And then after the third-hole bogey, I just told myself that I can't do this because if I don't try to get back to my form, it might not be a good round. \n\"Fortunately I birdied four, five and six and I started feeling much better and getting into the flow. Then the back nine, I felt very comfortable. Today is a really good round for me.\" \nLu's countryman CT Pan was a shot behind the leaders on five under, with SSP Chawrasia, Oliver Fisher and Kevin Phelan all on four under. Fisher is 105th on the Race to Dubai and looks to be safe for next season, while Phelan is 123rd and in need of a good finish at Fanling. \nBritish Masters winner Matt Fitzpatrick justified his position as one of the pre-tournament favourites with an opening 67, with American Ryder Cup star Patrick Reed on two under after three late bogeys. \nLast-minute entrant Ian Poulter was one under par after eight holes as he looked to make the most of his dramatic late entry into the event, the 39-year-old only arriving in Hong Kong at 7pm on Wednesday. \nPoulter dropped out of the world's top 50 on Sunday and was therefore ineligible for his planned appearance in the upcoming WGC-HSBC Champions event in Shanghai, meaning he would be unable to play the 13 events required for European Tour membership. \nOnly members can qualify for Europe's Ryder Cup team and that meant Poulter was forced into a frantic journey from Orlando to Hong Kong - via New York - but only after former US PGA champion Rich Beem generously agreed to give up his tournament invite to allow Poulter a place in the field. Related Sport News", "external_links": [], "published": "2015-10-22T09:32:00.000+03:00", "crawled": "2015-10-22T20:19:56.174+03:00", "highlightTitle": ""}