{"organizations": [], "uuid": "31a540ddb93b5ba660e719621b0c65e986832878", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "http://images.tribuneindia.com/cms/gall_content/2015/10/2015_10$largeimg16_Friday_2015_103237608.jpg", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/world/obama-to-discuss-nuclear-security-concerns-with-pak/146739.html", "country": "US", "title": "Obama to discuss nuclear security concerns with Pak", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "Obama to discuss nuclear security concerns with Pak", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "31a540ddb93b5ba660e719621b0c65e986832878"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/world/obama-to-discuss-nuclear-security-concerns-with-pak/146739.html", "ord_in_thread": 0, "title": "Obama to discuss nuclear security concerns with Pak", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Washington, October 16\nThe United States will discuss concerns about the security of Pakistan's nuclear arsenal during a visit to Washington next week by Pakistani Prime Minister Nawaz Sharif, the White House said on Thursday. The News York Times reported on Thursday that the Obama administration was concerned that Pakistan might be on the verge of deploying a small tactical nuclear weapon that would be harder to protect from falling into hands of militants. The paper said the administration was also seeking to prevent Pakistan deploying missiles that could reach beyond its main foe India, and was thus exploring a possible deal to limit the Pakistani arsenal that could involve relaxing restrictions on access to nuclear technology. White House spokesman Josh Earnest played down the prospect of an agreement when asked if there was a serious effort to reach a deal with Pakistan on nuclear technology in the run-up to Sharif visit, which is expected to start on Tuesday. \"I would not be overly excited about the prospects of reaching the kind of agreement that is being speculated about publicly,\" he told a regular news briefing, adding that it was \"not likely to come to fruition next week. \"But the United States and Pakistan are regularly engaged in a dialogue about the importance of nuclear security. And I would anticipate that that dialogue would include conversations between the leaders of our two countries.\" Earnest added that the administration was confident the Pakistani government was \"well aware of the range of potential threats to its nuclear arsenal\" and that \"Pakistan has a professional and dedicated security force that understands the importance and the high priority that the world places on nuclear security.\" Nuclear-armed Pakistan is troubled by violent Islamist militancy, and the prospect of a nuclear device falling into the hands of radicals has long been a worst-case fear of Western security officials. The New York Times said the United States had spent as much as $100 million during the Bush administration on a program to help secure Pakistan's nuclear arsenal, an effort that had continued under Obama. The paper said US officials were concerned that smaller, short-range nuclear weapons Pakistan designed to use against any Indian invasion were easier to steal and to use if they should fall into the hands of a rogue commander. Pakistan maintains there is no chance of Islamist militants getting their hands on atomic weapons. Pakistan has had the world's fastest-growing nuclear arsenal, and a report by two US think tanks this year said its expansion \"goes well beyond the assurances of credible minimal deterrence provided by Pakistani officials.\" The Carnegie Endowment for International Peace and the Stimson Center said Pakistan had the capacity to add 20 warheads annually and could have as many as 350 weapons in 10 years time. —Reuters", "external_links": [], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-16T21:33:58.878+03:00", "highlightTitle": ""}