{"organizations": ["Bologna", "Venice"], "uuid": "959c5d1b01bcd4e2c3be5471e1c4292dc803a7fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pendletontimespost.com", "main_image": "", "site_section": "http://pendletontimespost.com//feed/sec/6000/", "section_title": "PendletonTimesPost.com - Sports News", "url": "http://www.pendletontimespost.com/view/story/11ef79b81f3d4a559ecca9dc87cc5eb0/SOC--Venezia-Tacopina/", "country": "US", "title": "After leaving Bologna, NY lawyer Tacopina buys Venice's club", "performance_score": 0, "site": "pendletontimespost.com", "participants_count": 0, "title_full": "After leaving Bologna, NY lawyer Tacopina buys Venice's club", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T19:45:00.000+03:00", "replies_count": 0, "uuid": "959c5d1b01bcd4e2c3be5471e1c4292dc803a7fc"}, "author": "", "url": "http://www.pendletontimespost.com/view/story/11ef79b81f3d4a559ecca9dc87cc5eb0/SOC--Venezia-Tacopina/", "ord_in_thread": 0, "title": "After leaving Bologna, NY lawyer Tacopina buys Venice's club", "locations": ["NY", "Venice"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["ANDREW DAMPF", "Tacopina", "Joe Tacopina"], "text": "After Rome and Bologna, Joe Tacopina arrives in Venice on his Grand Tour of Italian soccer By ANDREW DAMPF AP Sports Writer   12:45 pmLast   12:45 pm   \nOrganizations: \nPhotos: \nJoe Tacopina poses for photographers in Venice, Italy, Friday, Oct. 9, 2015. New York lawyer Joe Tacopina leads a group of investors who have purchased Venice's fourth-division soccer club. Tacopina and fellow American investors John Goldman and John Tapinis announced the purchase of Venezia FC in the lagoon city Friday. (AP Photo/Luigi Costantini) \nFrom left, John Goldman, Joe Tacopina and John Tapinis pose for photographers in Venice, Italy, Friday, Oct. 9, 2015. New York lawyer Joe Tacopina leads a group of investors who have purchased Venice's fourth-division soccer club. Tacopina and fellow American investors John Goldman and John Tapinis announced the purchase of Venezia FC in the lagoon city Friday. Tacopina and fellow American investors John Goldman and John Tapinis announced the purchase of Venezia FC in the lagoon city Friday. (AP Photo/Luigi Costantini) \nROME — After Rome and Bologna, Venice is the latest stop for New York lawyer Joe Tacopina in his Grand Tour of Italian soccer. \nTacopina and a group of American investors announced the purchase of the lagoon city's fourth-division soccer club Venezia FC on Friday. \nThe move comes less than 20 days after Tacopina resigned as president of Serie A club Bologna because of a rift with Canadian investor Joey Saputo — having only been in charge there for 11 months. \nTacopina was also formerly on the board of directors at Roma, which in 2011 became the first foreign-owned club in Serie A. \n\"This is it. This is the final resting stop,\" Tacopina told The Associated Press by phone after posing for pictures beside Venice's Grand Canal, with gondolas in the background. \"This is a big project. It's a long-term project.\" \nThe operation cost about 6 million euros ($6.7 million), Tacopina said. \nNew York sports lawyer John Goldman and finance manager John Tapinis joined Tacopina in announcing the deal. \nJames Daniels, the CEO of Connecticut-based High Ridge Brands, is also an investor. \n\"John and John are on the board,\" Tacopina said. \"There are a couple of others who are partners but silent investors.\" \nVenezia's last appearance in Serie A came in 2001-02. The squad's biggest title was the 1941 Italian Cup. \nThe club currently plays at the Pierluigi Penzo stadium on the island city. Tacopina has plans for a new 28,000-seat stadium on the mainland near the Marco Polo airport. Plans call for a basketball arena to be constructed next to the soccer stadium. \n\"We've already had some of the biggest stadium engineers and architects from America at the site,\" he said. \"So it's moving along.\" \nVenezia has had a perfect start this season with six straight wins, 18 goals scored and three conceded. \nTacopina attributed the solid start to sporting director Giorgio Perinetti, who formerly worked at Juventus, Roma and Napoli. \n\"He has put together a team that could compete in Serie B right now,\" Tacopina said. \nThe goal, of course, is returning to Serie A — an accomplishment Tacopina experienced in his limited time at Bologna. But with several divisions to climb, reaching the top flight will take several promotions. \n\"The number of years is not the important thing,\" Tacopina said. \"What's important is to progress every year. But with Perinetti I wouldn't bet against us.\" \nTacopina represented New York Yankees slugger Alex Rodriguez in his drugs case but the lawyer said he doesn't currently have any high-profile cases. \nThat leaves more time for soccer — or \"calcio\" as the sport is called in Italy. \n\"I spend a substantial amount of time here,\" Tacopina said. \"For running the team I have to stay here and I will.\" \nAndrew Dampf can be followed at http://www.twitter.com/asdampf \n ", "external_links": [], "published": "2015-10-09T19:45:00.000+03:00", "crawled": "2015-10-09T20:10:32.848+03:00", "highlightTitle": ""}