{"organizations": [], "uuid": "2a71349140d44a4eebe1e9e25b3a3f894a69544e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtontimes.com", "main_image": "http://media.washtimes.com.s3.amazonaws.com/media/image/2015/10/26/1f8be7b21e80e030850f6a70670028b3.jpg", "site_section": "http://www.washingtontimes.com/rss/headlines/sports/", "section_title": "www.washingtontimes.com stories: Sports", "url": "http://www.washingtontimes.com/news/2015/oct/26/world-series-how-the-mets-and-royals-match-up/", "country": "US", "title": "World Series: How the Mets and Royals match up", "performance_score": 0, "site": "washingtontimes.com", "participants_count": 1, "title_full": "World Series: How the Mets and Royals match up", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T09:17:00.000+02:00", "replies_count": 0, "uuid": "2a71349140d44a4eebe1e9e25b3a3f894a69544e"}, "author": "MIKE FITZPATRICK and HOWIE RUMBERG", "url": "http://www.washingtontimes.com/news/2015/oct/26/world-series-how-the-mets-and-royals-match-up/", "ord_in_thread": 0, "title": "World Series: How the Mets and Royals match up", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sports World Series: How the Mets and Royals match up Kansas City Royals first baseman Eric Hosmer prepares to bat during a baseball workout Sunday, Oct. 25, 2015, in Kansas City, Mo. The Royals will face the New York Mets in Game 1 of the World Series on Tuesday in ... more > By MIKE FITZPATRICK and HOWIE RUMBERG -   \nA position-by-position look at the New York Mets and Kansas City Royals going into the World Series, starting Tuesday night at Kauffman Stadium: \n___ \nFirst Base: \nMets: Lucas Duda. A streaky slugger with a good eye when he’s going well, the quiet Duda was given an everyday job early last season over Ike Davis in a wise evaluation by the Mets. Duda has delivered on that promise of big power, with 57 homers and 165 RBIs over the past two years. He’s worked hard to become a better-than-you-think fielder, and he busted out of a bad slump with a homer, two doubles and five RBIs in the NL Championship Series clincher at Wrigley Field. \nRoyals: Eric Hosmer. The two-time Gold Glove winner finally became the middle-of-the-order force the Royals were hoping for when they drafted him third overall in 2008. He set career highs of 93 RBIs and 98 runs this season while raising his batting average nearly 30 points to .297. He struggled at the plate in the AL playoffs but knocked in 11 runs on 10 hits in 45 at-bats. \nEdge: Even. \n___ \nSecond Base: \nMets: Daniel Murphy. There’s a new Mr. October in the Big Apple. Always a good contact hitter, Murphy worked all year on generating more power. Something started to click in the second half and he set a career high with 14 home runs. That was just the beginning, though. The 2014 All-Star, who can become a free agent next month, has homered in a record six consecutive postseason games. He batted .529 (9 for 17) against the Chicago Cubs to win NLCS MVP honors, and is hitting .421 with seven homers and 11 RBIs in nine postseason games overall. He credits his No. 3 spot in the lineup and first-year Mets hitting coaches Kevin Long and Pat Roessler. Murphy can be shaky on the bases and in the field, but his all-around performance in the playoffs was spectacular. \nRoyals: Ben Zobrist. A trade-deadline acquisition from Oakland, Zobrist took over at second base down the stretch when Omar Infante went out with an oblique injury in mid-September. Zobrist has had an impressive postseason, hitting .325 through the first two rounds, including four doubles and two homers in the ALCS. He has World Series experience with Tampa Bay in 2008. \nEdge: Mets. Murphy is on a roll. \n___ \nShortstop: \nMets: Wilmer Flores. Nearly traded in late July, Flores became an instant fan favorite when cameras caught him crying during a game because he thought he’d been jettisoned by the only organization he’s ever played for. He began the season as the starter and took over again in the playoffs when Ruben Tejada broke his leg on a late takeout slide by Chase Utley of the Dodgers. Flores had 16 homers this year and delivered several clutch hits. He’s limited on defense but has been more consistent since his early-season struggles. \nRoyals: Alcides Escobar. A pest in the leadoff spot and a whiz with the glove, Escobar has blossomed this October. He likes to swing early in the count, and he set a record with hits to start four straight playoff games in one series. The ALCS MVP, Escobar is the postseason hits leader with 17, one more than Murphy.", "external_links": [], "published": "2015-10-26T09:17:00.000+02:00", "crawled": "2015-10-26T11:11:57.117+02:00", "highlightTitle": ""}