{"organizations": ["Kentucky Christian"], "uuid": "7cf655b48b9cb476b0fade655ba676760fc34199", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fox17.com", "main_image": "http://fox17.com//sports/features/sports-unlimited/images/sports_unlimited_stopimg.png", "site_section": "http://fox17.com//sports/features/sports-unlimited/rss.xml", "section_title": "wztv Sports Unlimited", "url": "http://www.fox17.com/sports/features/sports-unlimited/stories/Cumberland-beats-Kentucky-Christian-54-21-217327.shtml", "country": "US", "title": "Cumberland beats Kentucky Christian, 54-21", "performance_score": 0, "site": "fox17.com", "participants_count": 0, "title_full": "Cumberland beats Kentucky Christian, 54-21", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T23:29:00.000+03:00", "replies_count": 0, "uuid": "7cf655b48b9cb476b0fade655ba676760fc34199"}, "author": "", "url": "http://www.fox17.com/sports/features/sports-unlimited/stories/Cumberland-beats-Kentucky-Christian-54-21-217327.shtml", "ord_in_thread": 0, "title": "Cumberland beats Kentucky Christian, 54-21", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Cumberland beats Kentucky Christian, 54-21 \nUpdated: Sat, Oct 10 2015, 07:29 PM \nLEBANON, Tenn. – Austin Chaplin rushed 31 times for 229 yards and three touchdowns, Moses Cornelius added 116 yards and two TDs and Cumberland rushed for 410 yards in a 54-21 victory over Kentucky Christian here Saturday at Nokes-Lasater Field. \nThe Bulldogs (3-3) won their second straight contest and played at home for the first time in five weeks. Cumberland scored four times in the opening quarter and added two more touchdowns in the third and fourth periods. Chaplin scored on runs of three, two and four yards while Cornelius added 45 and four-yard TD runs in the final period. \nChaplin gained 149 yards in the first half and Cornelius posted 104 of his 116 in the final period, including the 45-yard scoring run that put the Bulldogs ahead, 47-21, with 13:50 left in the game. Nathan Anderson blocked his third punt of the year on KCU’s next possession and three plays later Cornelius barreled in from four yards out for the final score of the contest. \nJustin Snyder passed for 185 yards and one touchdown on 16-of-28 and added 47 yards rushing and two touchdowns, including a 63-yard TD scamper late in the third quarter. Brandon Mallory caught four passes for 44 yards with a five-yard TD catch as well. \nGraham Johnston completed 17-of-45 passes for 305 yards and two touchdowns but was sacked four times and harassed numerous others. Jamuel Jones rushed 26 times for 87 yards and one score for the Knights (0-6). \nThe Cumberland defense allowed just 127 yards in the second half, limiting the Knights to just one TD. \nKentucky Christian scored on the first play of the game, with Johnston hitting Tony Prater on a slant route and Prater outrunning Anthony Knight for a 75-yard touchdown. KCU’s two-point try was no good. \nSnyder connected with Ladarius Rodgers on CU’s first offensive play for 24 yards, but he was stripped of the ball and Kentucky Christian recovered at the CU44. The Bulldog defense allowed two first downs but a sack by Andrew Leonard and Donovan Norfleet pushed the Knights back and Johnston’s passes on third and fourth down were incomplete, giving the ball back to the home team. \nCumberland moved 73 yards on nine plays, including rushes of 17 and 28 yards by Chaplin, and the junior carried the final three yards for the score, giving CU a 7-6 lead. \nThe Bulldogs took their next possession 60 yards on eight plays, with Snyder hitting Michael Green for 13 yards and rushing once for nine yards. Snyder’s pass to Mallory put the ball at the KCU1, but Joseph Rushin was stopped twice before Snyder carried the final yard on fourth down for a 14-6 lead with 6:35 left in the opening quarter. \nThe Knights answered, though, moving 75 yards on seven plays to knot the game at 14. Johnston found Tyler Hadynski for 54 yards on the drive and Jones rushed nine yards to the CU9. Johnston hit Deandre Riddick for the touchdown and found Jones in the flat for the two-point try with 4:11 left in the first period. \nThe Bulldogs took the lead for good after Green returned the ensuing kickoff 47 yards to midfield and KCU was called for a personal foul on the play as well. Snyder passed to Green for 14 yards and Chaplin carried for 19 yards and then the final two, giving CU a 21-14 lead. \nA 13-yard punt by the Knights late in the first period gave the Bulldogs the ball at the KCU 41-yard line. Snyder connected with Marcus Bryson for 15 yards on third down and hit Chaplin in the flat for nine yards to the KCU1. A false start penalty pushed the ball back, but Mallory caught a five-yard TD pass for a 28-14 advantage. \nTyler Burr made an incredible diving interception at the CU49 early in the second period, but a personal foul penalty on the Bulldogs and a bad snap on the punt gave the Knights the ball at the CU42. Kentucky Christian moved to the 14 but Johnston passes fell incomplete on second and fourth down, turning the ball back over the Cumberland. \nA short punt by Matthew Alter into the wind put the Knights back in business at the CU43 and Johnston hit Darren Pendergrass for 20 yards. The drive stalled again and Luke Eisnaugle missed a 32-yard field goal. The Bulldogs took the 28-14 edge to the half. \nCumberland moved 75 yards on eight plays on the first drive of the second half. Chaplin rushed for 17, 12, 18 and two yards on the first four plays of the possession and then got the final 12 yards on three carries after a pass interference penalty on the Knights, pushing the CU advantage to 34-14.Kentucky Christian took advantage of another short field midway through the period after Snyder fumbled on sack by Earl Stoudemire. Johnston hit Prater for 13 yards and a pass interference penalty on CU put the ball at the two. The Bulldogs stuffed Jones twice and Johnston’s third down pass was incomplete, but Jones got the final yard on fourth down, cutting the Bulldog lead to 34-21. \nCumberland answered quickly, with Cornelius rushing twice for six yards apiece before Snyder faked the handoff and went up the middle for 63 yards, with Green throwing a key block downfield to free the junior quarterback.Early in the fourth quarter Cornelius rushed for 11 yards and then 45 for the score. He got the final touchdown as well after the blocked punt for the final TD of the contest. \nCourtesy: Cumberland Sports Information Department Related Stories", "external_links": [], "published": "2015-10-10T23:29:00.000+03:00", "crawled": "2015-10-11T03:46:49.887+03:00", "highlightTitle": ""}