{"organizations": [], "uuid": "a23c29f56643076754c23a523249e8ae61d0fe37", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.press-citizen.com", "main_image": "http://www.gannett-cdn.com/-mm-/d6a7b28d2253775aef87fc560d052c99a1c39a1e/c=0-0-1440-814&amp;r=x633&amp;c=1200x630/local/-/media/IowaCity/GenericImages/2014/04/07//1396901655000-west-hs.jpg", "site_section": "http://rssfeeds.press-citizen.com/iowacity/sports", "section_title": "Iowa City - Sports", "url": "http://www.press-citizen.com/story/sports/high-school/2015/10/23/clear-creek-aman-fairfield-high-school-football/74512568/", "country": "US", "title": "Pleasant Valley tops West in regular-season finale, again", "performance_score": 0, "site": "press-citizen.com", "participants_count": 0, "title_full": "Pleasant Valley tops West in regular-season finale, again", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T07:41:00.000+03:00", "replies_count": 0, "uuid": "a23c29f56643076754c23a523249e8ae61d0fe37"}, "author": "", "url": "http://www.press-citizen.com/story/sports/high-school/2015/10/23/clear-creek-aman-fairfield-high-school-football/74512568/", "ord_in_thread": 0, "title": "Pleasant Valley tops West in regular-season finale, again", "locations": ["Pleasant Valley"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ryan Murken"], "text": "Pleasant Valley tops West in regular-season finale, again Ryan Murken, rmurken@press-citizen.com 11:41 p.m. CDT October 23, 2015 West High School CONNECT 1 TWEET LINKEDIN COMMENT EMAIL MORE \nBETTENDORF, Ia. — Same teams, same stakes, same result. \nFor the second straight season, Pleasant Valley used a strong second half to pull away from West High, clinching the Class 4A District 7 title with a 35-20 win in the regular-season finale for both teams at Spartan Field on Friday. \nThe win was the fifth straight for Pleasant Valley (7-2), which finished 4-0 in District 4 play for the second straight season after downing West High 38-24 at fog-covered Trojan Field in last year’s regular-season finale. \nPleasant Valley will host back-to-back playoff games with a win in Wednesday’s opening round while West High (3-6) will host an opening-round playoff game on Wednesday. \n“It wasn’t quite as foggy this year but it sure felt a lot like last year,” Pleasant Valley coach Rusty VanWetzinga. “They are a talented team and we have to come ready to go every week, we have to execute and we have to play hard and I thought our guys did that tonight.” \nJunior quarterback Terry Saul rushed for 226 yards and scored all five Spartan touchdowns as Pleasant Valley rolled up 378 yards on the ground. \nSaul scored on runs of 10 and 6 yards in the first half and added three short scoring runs in the second half, including a pair of 4-yarders in the fourth quarter that secured the win. \nThe 5-foot-10, 175-pound Saul had 32 of the Spartans’ 58 rushing attempts while sophomore fullback Arthur Braden added 128 yards on 22 carries. \n“It’s a triple option, if they take away the other two options one person is going to have success in our offense,” Saul said. “They can’t take away everything.” \nPleasant Valley jumped to a 7-0 lead less than three minutes into the game on a touchdown on its opening drive. \nAfter stopping West High on a fourth-down attempt, the Spartans went 37 yards in four plays and took a 7-0 lead on a 10-yard touchdown run by Saul. \nPleasant Valley upped the lead to 14-0 with a 10-play, 87-yard drive that Saul capped with a 6-yard touchdown run. \n“In our option attack one day it might be our fullback, one day it might be C.J. Carter and today it was Terry,” VanWetzinga. “I thought Terry made great reads, he pulled it when he had to and he was able to get downfield and use his athleticism.” \nWest High answered with a quick drive, marching 72 yards in six plays and cut the lead to 14-7 on a 7-yard touchdown pass from Alex Henderson to Oliver Martin. \nMartin hauled in the over the shoulder pass from Henderson in the corner of the end zone with 6:43 left in the first half. \nPleasant Valley took a 21-7 lead with 12-play, 82-yard drive that ended with Saul’s third touchdown run of the game, a 2-yarder with 2:22 left in the third quarter. \nAgain, West answered cutting the lead to 21-14 on a 10-yard touchdown run by Henderson on an option keeper with 11:49 left. \nThe Trojans forced Pleasant Valley to go three-and-out on its ensuing possession, but couldn’t handle the punt and Pleasant Valley’s Carter Christian recovered at the West High 34. \n“The difference from last year to this year is we beat ourselves more this year than we could recover from,” Hartwig said. “It was self-inflicted wounds and I take responsibility as the head coach.” \nSeven plays later Saul scored on a 4-yard keeper to put the Spartans on top 28-14 with 7:42 left. \n“That was huge for us, it was a great swing in momentum,” Saul said of the fumble recovery. “We knew as an offense we just had to put it in the end zone.” \nHenderson finished 19 of 32 through the air for West High for 191 yards and two touchdowns connecting with Jacquese Parks for an 11-yard touchdown pass on the game’s final play. \nMartin finished with 11 catches for 129 yards for West High, which will await to find its opening-round playoff opponent when the pairings are announced by the Iowa High School Athletic Association Saturday morning. \n“The quarterback is good and by the time they get to week nine they have run this offense all season, it’s flowing better than it has all year and that’s the idea behind it,” Hartwig said. “When we get off schedule on offense and they stay on schedule they keep the ball and that’s how they won.” \nReach Ryan Murken at 319-339-7369 or rmurken@press-citizen.com and follow him on Twitter at @rmmurken. \nWest High", "external_links": [], "published": "2015-10-24T07:41:00.000+03:00", "crawled": "2015-10-24T17:15:16.395+03:00", "highlightTitle": ""}