{"organizations": [], "uuid": "2c4e18019a3a754292066f73a103469386096e76", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/6/51/154862/Sports/Egyptian-Football/Egypt-Ahly,-a-pillar-of-stability,-hit-by-unfamili.aspx", "country": "EG", "title": "Egypt' Ahly, a pillar of stability, hit by unfamiliar internal wrangling - Egyptian Football - Sports", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Egypt' Ahly, a pillar of stability, hit by unfamiliar internal wrangling - Egyptian Football - Sports - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "2c4e18019a3a754292066f73a103469386096e76"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/6/51/154862/Sports/Egyptian-Football/Egypt-Ahly,-a-pillar-of-stability,-hit-by-unfamili.aspx", "ord_in_thread": 0, "title": "Egypt' Ahly, a pillar of stability, hit by unfamiliar internal wrangling - Egyptian Football - Sports", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Ahly chairman promises trophies next season following protest by fans New season, new faces as Ahly prepare for Super Cup showdown with Zamalek Ahly fans protest appointment of Peseiro as head coach Factbox: New Ahly coach Jose Peseiro Ahly exclude iconic Manuel Jose from coaching short list: Board member Jose linked with return to Ahly; Schaaf and Paqueta among candidates for job Egypt Super Cup is a difficult mission: Ahly's caretaker coach Zizo Ahly were long hailed as a pillar of stability and professionalism, sidestepping the kind of internal wrangling which hit their arch rivals to dominate the football scene in Egypt and Africa and play in a league of their own.\nTheir success was so huge that their fans did not bear a single season without a major title after 11 trophy-laden years that included five African Champions League titles, having lost both the Egyptian Premier League and Egypt Cup to bitter foes Zamalek.\nBut that was not the only reason that the fan frustration boiled over at the end of the season, shortly after the team suffered an embarrassing 4-3 defeat at home to South Africa's Orlando Pirates that knocked them out of the African Confederation Cup semis.\nUnfamiliar war of words between some club officials, the coach criticism of the board and the departure of a man who oversaw the team's summer signings made it look as if Ahly are acting in the same way Zamalek used to during the latter's 11-year league drought.\nSpanish coach Juan Garrido was dismissed in the latter stages of the season and replaced with Fathi Mabrouk and dressing-room discord also made headlines, further enraging the Ahly fans who used to make fun of Zamalek's often bizarre problems.\nChairman Mahmoud Taher was partially blamed for the kind of internal strife not seen in the club in decades, with many Ahly fans demanding his resignation.\nMabrouk slams Taher, exposes problems\nTaher appeared to criticise Mabrouk when he hinted that he was not \"strong enough\" to handle the team, a criticism echoed by many of the supporters after several of Ahly's players made shushing gestures when they scored.\nThere was also a famous rift between then football director Wael Gomaa, club icon, and skipper Hossam Ghaly.\nGomaa, a former rock-solid defender who played alongside Ghaly for several years, was Quote: d by local media as saying that the former Tottenham Hotspur midfielder had \"insulted\" some of his teammates.\nReports said that Gomaa's subsequent resignation was down to an argument with the board, who insisted he should not have disclosed any dressing-room problems. Gomaa also blamed the board for siding with Ghaly and not backing him.\n \"We can't deny that there are problems in the football team. [Outgoing] football director Alaa Abdel-Sadek did his best to resolve them, but his efforts were offset by bad luck,\" Taher said during a television interview earlier this week.\n\"The problem is that Ahly have more talented and young players along with the newly signed players we brought in for the new season. They need to be led by a strong coach who can improve harmony within the team.\n\"We listen carefully to the fans' anger, as we are angry as well.\"\nMabrouk angrily reacted to Taher's words, saying the team had borne the brunt of internal rifts.\n\"My main target was always pleasing the fans. The club's interests are what matter most,\" Mabrouk, who as a caretaker boss led Ahly to the league title in 2014, said in a television interview.\n\"There was a split inside the club as the team stars were treated in a special way, unlike the young ones. Ahly players lost the fighting spirit and that was a main reason for the heavy 4-3 loss to Orlando in the Confederation Cup semi-final.\n\"I was brave to take charge in these difficult circumstances but some people inside the club were fighting me.\"\nA win over Zamalek in Thursday's Super Cup title will move some way into alleviating fan anger, with stop-gap coach Abdel-Aziz Abdel-Shafy \"Zizo\" replacing Mabrouk.\nBut a defeat would cast further doubts over the future of Taher's board of directors, especially after the appointment of Portuguese coach Jose Peseiro, who should lead the club following the Zamalek clash, prompted a wave of protests.\nAhly's die-hard supporters made no secret of their anger, chanting against Taher and his board when they attended a training session a few days before the Super Cup. They deem Peseiro unfit for the demanding job, saying that he had only won one trophy since beginning his coaching career more than 20 years ago.\nMany also alluded to his perceived soft-handed approach at a time when the team appear in disarray.\nAgainst Jose's return\nAhly's management also came under fire after snubbing fan demand for the return of iconic coach Manuel Jose, who led the team to a host of titles in three spells.\nCaretaker boss Zizo firstly said that Jose is a strong candidate, before board member Taher El-Sheikh confirmed that the 69-year-old tactician is out of the race.\nIt was reported that Ahly's vice-president Ahmed Saied strongly opposed the return of the Portuguese boss, who is hugely popular with the fans.\n\"We respect Jose's history with Ahly but there are some people inside the club who are eyeing personal benefits from Jose's presence,\" Taher said without elaborating further but hinted that the coach, who said he was willing to take charge of the team for a fourth stint, only made a name for himself after becoming the Red Devils' manager.\nHaitham Orabi departure\nThe internal rifts also included the departure of a man credited with making some prominent signings in the summer, including the arrival of Gabon striker Malick Evouna.\nHaitham Orabi, who is also popular with many supporters, suddenly handed in his resignation, complaining that he was neither informed nor consulted over the hiring of Peseiro.\nFootball Committee member Walid Salah El-Din also left following last season's failure while Adly El-Qaeyi, famously known for helping sign a host of stars in the mid-2000s, rejected an offer to become the club's spokesman despite initially accepting it.\n\"Orabi hasn't officially resigned; he just announced that he had left via media. He was just a new employee who has been tested for three months and his departure is not a problem at all,\" Chairman Taher said.\n\"El-Qayei hasn't even started his work. I don't know the reasons behind his refusal. He didn't talk with me,\" Taher said.\nEl-Qayei blamed unnamed people for working against the interests of Ahly, but said he will reveal their names if they \"didn't stop doing that\", hinting at possible escalation of the kind of internal feuds that were never associated with Egypt and Africa's most successful club.\n(For more sports news and updates, follow Ahram Online Sports on Twitter at @AO_Sports and on Facebook at AhramOnlineSports .)", "external_links": ["https://twitter.com/AO_Sports", "https://www.facebook.com/AhramOnlineSports?fref=ts"], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-14T00:43:05.127+03:00", "highlightTitle": ""}