{"organizations": [], "uuid": "426d205b7850be34e7a0d50e47e537b97673f06d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.times-herald.com", "main_image": "http://content.times-herald.com/nthv2/img/fb-promo-def.jpg", "site_section": "http://feeds.times-herald.com/rss/sports", "section_title": "The Times-Herald > Sports", "url": "http://www.times-herald.com/Sports/20151009-SPORTS-TrinityFootball", "country": "US", "title": "Region co-leader Trinity trying not to look ahead tonight vs. Dominion", "performance_score": 0, "site": "times-herald.com", "participants_count": 0, "title_full": "Region co-leader Trinity trying not to look ahead tonight vs. Dominion", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T09:21:00.000+03:00", "replies_count": 0, "uuid": "426d205b7850be34e7a0d50e47e537b97673f06d"}, "author": "", "url": "http://www.times-herald.com/Sports/20151009-SPORTS-TrinityFootball", "ord_in_thread": 0, "title": "Region co-leader Trinity trying not to look ahead tonight vs. Dominion", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments \nWhile having no plans to alter their uniforms for Halloween, Trinity Christian may already be anxiously awaiting the final Friday in October in a regular season finale that could decide home-field advantage in the GISA state playoffs and quite possibly a Region 1-AAA title. \nBut unfortunately for the Lions, the calendar still only reads Oct. 9, 2015. \nTrinity Christian is among just three county teams in action tonight while getting ready for Homecoming festivities at four local high schools next week. \nEast Coweta and Newnan face crucial road trips in Region 3- . The unbeaten Indians head to Langston Hughes and the Cougars travel to Westlake needing a win to also stay unbeaten in region play. \nNorthgate and The Heritag School are both off. \nIn order for Trinity’s final two football games against co-region leader Loganville Christian (6-0, 2-0) and rival Heritage School (3-4, 2-1) to make a difference, the Lions need to take care of business the next two weeks starting with tonight’s home game against winless Dominion Christian. \nRiding a three-game win streak, Trinity continues to make strides in head coach Dan Matthews’ first season. The Lions took another big step last week by defeating Holy Spirit 28-7 on the road, but not with- out potentially learning a lesson along the way. \n“Some of the younger guys last week were already talking in the first quarter about getting in the game,” Matthews said. “They scored right away on us off a big play. I think they learned their lesson last week.” \nTrinity made adjustments on both sides of the ball at halftime of a 7-7 game last week before dominating the final two quarters. The Lions defense held their opponents to around 100 total yards for \nthe third consecutive game, with Griffin Christian, Georgia Christian and Holy Spirit managing just 14 points combined during a three-game win streak. \n“The kids really responded. Both of the last two weeks they’ve had one big play,” Matthews said. “We’ve been trying really hard this week to work on not giving up those big plays.” \nDominion Christian, meanwhile, hasn’t had much luck against Trinity since the two began an annual rivalry in 2012. Last year’s trip to Marietta, however, resulted in a much closer 21-14 victory against head coach Javier Jen- kins’ Knights program, which has earned a reputation for its pass-heavy spread offense. \nNumbers both on and off the field have been a bigger issue for Dominion than in years past. The Knights online roster stands at 17 players heading into tonight, with some opponents taking advantage. \nOf its five losses, Dominion has only been within 25 points in just one game, fall- ing 55-52 in a 1-AAA shootout with Bethlehem Christian (1-5, 1-2). \nSenior Levi Lewallen (6-1, 275) leads a large group of upperclassmen, however. Of the Knights 17 players, 11 are seniors including quarterback Manny Carucci (6-1, 175), receiver Dorien Jenkins (5-8, 150) and tackle Jordan Hair (6-2, 230). \nPreston McDuffie scored three touchdowns in the victtory for the Lions, who might have received their biggest push after seeing Joseph Cot- ton’s interception called back on a penalty in a 7-7 game in the first half. \n“I think that’s what really lit us up,” Matthews said after the win. “We came out and stopped them again.” \nMcDuffie’s second touch- down pushed a 14-7 Trinity lead before the Lions put the game away by doubling its point total in the fourth quarter. \nBen Kritko’s interception set up McDuffie’s third score of the game. Cotton then got his interception back late — this time minus a Trinity penalty — before finishing off a scoring drive with a 20-yard touchdown run. More", "external_links": [], "published": "2015-10-09T09:21:00.000+03:00", "crawled": "2015-10-09T23:35:15.278+03:00", "highlightTitle": ""}