{"organizations": ["Tuolumne County Superior Court", "Sonora Police Department", "District Attorney’s Office", "Tuolumne Fire Protection District", "Tuolumne County Sheriff’s Office", "Calvary Chapel"], "uuid": "6ee482e1e006496f0d46d0c8b62fb8595ec431bd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.uniondemocrat.com", "main_image": "", "site_section": "http://feeds.feedburner.com/UnionDemocrat", "section_title": "The Union Democrat, Sonora, CA News, Sports, & Weather", "url": "http://www.uniondemocrat.com/index.php?option=com_content&task=view&id=117660&Itemid=199", "country": "US", "title": "October trial set for alleged arsonist", "performance_score": 0, "site": "uniondemocrat.com", "participants_count": 0, "title_full": "October trial set for alleged arsonist", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T04:00:00.000+03:00", "replies_count": 0, "uuid": "6ee482e1e006496f0d46d0c8b62fb8595ec431bd"}, "author": "", "url": "http://www.uniondemocrat.com/index.php?option=com_content&task=view&id=117660&Itemid=199", "ord_in_thread": 0, "title": "October trial set for alleged arsonist", "locations": ["Soulsbyville", "Tuolumne County"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Twain Harte", "Donald Segerstrom", "Tori Thomas", "Catherine Yvonne Park"], "text": "October trial set for alleged arsonist October trial set for alleged arsonist By Tori Thomas, The Union Democrat September 30, 2015 01:00 am A woman accused of starting a fire in June that destroyed a Soulsbyville home and burned about an acre of grass is set to go to trial Oct. 7. Catherine Yvonne Park, 60, of Soulsbyville, was arrested June 23 on a charge of felony arson after a mobile home on the 17000 block of Timber Drive was destroyed in a fire. The fire was reported about 2:30 p.m. June 23 and was fully contained about 3:45 p.m. Park pleaded not guilty Aug. 31 before Tuolumne County Superior Court Judge Donald Segerstrom. According to the Tuolumne County Sheriff’s Office, deputies were called to the address multiple times in the days leading up to the fire. A June 22 Sheriff’s Office dispatch log shows that deputies were called to the address at 3:07 p.m. after receiving a report that someone was pounding on the door saying, “Let me in.” At 9:27 p.m., a caller reported receiving a text message saying, “You’re going to die tonight.” At 9:54 p.m., a caller reported a brick was thrown through a window of the home. A June 23 dispatch log shows a call from the residence at 10:12 a.m. about another brick through a window, and at 12:20 p.m. another report was made about a broken window. Members of the county’s Fire Investigation Unit, which included fire investigation experts from the Tuolumne County Sheriff’s Office, District Attorney’s Office, Sonora Police Department and Cal Fire, combed the scene. The home was half consumed by flames when first responders arrived, according to Cal Fire, and the fire quickly spread to surrounding grass and brush. At one point, the blaze threatened other structures and neighboring hillsides, including Calvary Chapel. Baseline Conservation Camp, Tuolumne Fire Protection District, Twain Harte Fire, Mi-Wuk-Sugar Pine Fire Protection District, Tuolumne County Fire and Cal Fire responded. The equipment assigned to the fire included two air tankers, an air attack plane, a helicopter and nine fire engines. Park was released from the Tuolumne County Jail Sept. 5 on $60,000 bond. A trial readiness conference is scheduled for Oct. 6. Follow UnionDemocrat.com", "external_links": [], "published": "2015-09-30T04:00:00.000+03:00", "crawled": "2015-10-01T07:10:39.203+03:00", "highlightTitle": ""}