{"organizations": [], "uuid": "cc0a5f04808884db65b8dfc7db9115aadeb3cf6e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbssports.com", "main_image": "http://cbssports.com/images/pitinoscandalcbs.jpg", "site_section": "http://www.cbssports.com/partners/feeds/rss/home_news", "section_title": "Sports News : CBSSports.com", "url": "http://www.cbssports.com/collegebasketball/eye-on-college-basketball/25347117/louisville-ad-sex-escort-scandal-wont-cause-rick-pitino-to-resign", "country": "US", "title": "Louisville AD: Sex, escort scandal won't cause Rick Pitino to resign", "performance_score": 0, "site": "cbssports.com", "participants_count": 36, "title_full": "Louisville AD: Sex, escort scandal won't cause Rick Pitino to resign - CBSSports.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T22:16:00.000+03:00", "replies_count": 35, "uuid": "cc0a5f04808884db65b8dfc7db9115aadeb3cf6e"}, "author": "Matt Norlander", "url": "http://www.cbssports.com/collegebasketball/eye-on-college-basketball/25347117/louisville-ad-sex-escort-scandal-wont-cause-rick-pitino-to-resign", "ord_in_thread": 0, "title": "Louisville AD: Sex, escort scandal won't cause Rick Pitino to resign", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The maelstrom of controversy and scandal that has taken over college basketball will not lead to a Rick Pitino resignation, according to Louisville athletic director Tom Jurich.\nJurich put out a statement today that reads , \"Coach Pitino has no plans to step down, he has a long-term contract here and he absolutely did not know anything about the allegations.\"\nPreviously, Louisville's president put out a statement of support for Jurich but neglected to reference, let alone mention, Pitino .\nTuesday brought about the biggest media flare-up regarding the Louisville scandal since the story broke on Oct. 2 . With five former Louisville players and recruits confirming details of the book \"Breaking Cardinal Rules: Basketball and the Escort Queen,\" co-written by self-described madam Katina Powell, calls for Pitino's job have been growing louder .\nPowell told ESPN's Outside the Lines that nearly two dozen dancers worked for her from 2010 to 2014, and said all but \"roughly speaking, about five or six\" had sex with Louisville recruits and/or players during that time. Former U of L basketball staffer Andre McGee is at the center of the allegations. Powell said McGee arranged the parties. An unnamed former Louisville player told ESPN he was given a \"stack of $1 bills\" by McGee, and that he was told to give that money to Powell's employees. \n\nAll of this happened, from time to time, inside Billy Minardi Hall, an on-campus residence building named after Pitino's late brother-in-law. \n\nPowell's legal team is scheduled to meet with Louisville's team of lawyers on Tuesday afternoon.\n\"I couldn't make this up if I wanted to,” Powell told ESPN. \"I have no reason and I haven't the need … everything that I'm saying is 100 percent the truth.\"\nPitino told Yahoo Sports on Tuesday, \"There's only one person who can speak on this matter, and that's Andre McGee. He owes it to his teammates, coaches and the university to tell the truth. The truth has got to come out, and not just to the NCAA.\" Rick Pitino has denied knowing an iota of the allegations until he was informed late this summer. (USATSI) Topics: Louisville Cardinals , NCAAB", "external_links": [], "published": "2015-10-20T22:16:00.000+03:00", "crawled": "2015-10-21T03:57:35.969+03:00", "highlightTitle": ""}