{"organizations": ["Giteau Advice Pumas Playmaker Sanchez Feeds Off Wilkinson"], "uuid": "ef7d84e353ad86eb3f28822643ad564debdb3f0b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "jakartaglobe.beritasatu.com", "main_image": "http://img.thejakartaglobe.com/2015/10/2015-10-20T113623Z_88342583_MT1ACI14110193_RTRMADP_3_RUGU-1024x618.jpg", "site_section": "http://jakartaglobe.beritasatu.com/rss/sports/", "section_title": "Sports | Jakarta Globe", "url": "http://jakartaglobe.beritasatu.com/rugby/pumas-playmaker-sanchez-feeds-off-wilkinson-giteau-advice/", "country": "ID", "title": "Pumas Playmaker Sanchez Feeds Off Wilkinson, Giteau Advice", "performance_score": 0, "site": "beritasatu.com", "participants_count": 0, "title_full": "Pumas Playmaker Sanchez Feeds Off Wilkinson, Giteau Advice", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T21:31:00.000+03:00", "replies_count": 0, "uuid": "ef7d84e353ad86eb3f28822643ad564debdb3f0b"}, "author": "", "url": "http://jakartaglobe.beritasatu.com/rugby/pumas-playmaker-sanchez-feeds-off-wilkinson-giteau-advice/", "ord_in_thread": 0, "title": "Pumas Playmaker Sanchez Feeds Off Wilkinson, Giteau Advice", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sanchez Feeds Off Wilkinson", "Rex Gowar"], "text": "Pumas Playmaker Sanchez Feeds Off Wilkinson, Giteau Advice i By : Rex Gowar | on 8:31 AM October 22, 2015 Category : Sports , Rugby \nBagshot, England. Argentina's Nicolas Sanchez picked up useful hints from former England flyhalf Jonny Wilkinson and Wallaby center Matt Giteau at Toulon which he hopes can help him steer Argentina to a Rugby World Cup semi-final victory over Australia on Sunday. \nSanchez has been superb in dictating the Pumas' attacks at a tournament in which they have scored 26 tries in five matches. \nHe has notched 74 points, second only to Scotland captain Greig Laidlaw, after Argentina's 43-20 quarter-final win over Ireland. \n\"If you ask me who has been the best rugby player ever, I'd say Wilkinson and to have been next to him was spectacular and I tried to make the most of that,\" Sanchez told reporters on Wednesday. \n\"Giteau is a world-class player who attacks well and makes good decisions,\" he said at Argentina's Pennyhill Park retreat outside London where hosts England were based before their early exit. \nSanchez, who spent a season at Toulon but has now committed himself to Argentina's new Super Rugby franchise, said Wilkinson looked after every detail in his game. \n\"He told me it was very important to have a good place kicker,\" he told reporters. \"These matches can be decided by a few points so it's important to get 100 percent of your kicks.\" \nSanchez said it also helped him to have Juan Martin Hernandez, flyhalf in the 2007 bronze medal-winning team, beside him at inside centre. \n\"Juan gives a lot to the team, he give you a long pass out wide, he is one of the best in the team at that, it's like having another flyhalf in the team,\" Sanchez said. \nHe said veterans like Hernandez and flanker Juan Martin Fernandez Lobbe were a calming influence in the hottest moments of a match like when Ireland came back to within three points of the Pumas early in the second half. \nOverall the squad are feeling calmer than in the build-up to Sunday's clash with Ireland in Cardiff but the butterflies would come as they prepared for the biggest challenge of their lives. \n\"We must do what we did against New Zealand, win our one-on-ones and the breakdown and not commit penalties because if we do, Australia will choose to go for a lineout where they are very good,\" Sanchez said. \nReuters", "external_links": [], "published": "2015-10-21T21:31:00.000+03:00", "crawled": "2015-10-22T08:49:27.931+03:00", "highlightTitle": ""}