{"organizations": [], "uuid": "860dd778a0c5dcceffdd36adbee8d4d4efe20b25", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.heraldbulletin.com", "main_image": "http://heraldbulletin/content/tncms/live/global/resources/images/_site/og_image_heraldbulletin.jpg", "site_section": "http://www.heraldbulletin.com/search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&nsa=eedition&c[]=sports,sports/*&f=rss", "section_title": "Herald Bulletin - sports,sports/", "url": "http://www.heraldbulletin.com/sports/tigers-argylls-polish-off-volleyball-sectional-foes/article_f24f2ef8-7a80-11e5-a0d0-ffa2b06609a4.html", "country": "US", "title": "Tigers, Argylls polish off volleyball sectional foes", "performance_score": 0, "site": "heraldbulletin.com", "participants_count": 1, "title_full": "Tigers, Argylls polish off volleyball sectional foes", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T21:55:00.000+03:00", "replies_count": 0, "uuid": "860dd778a0c5dcceffdd36adbee8d4d4efe20b25"}, "author": "Rick Teverbaugh The Herald Bulletin", "url": "http://www.heraldbulletin.com/sports/tigers-argylls-polish-off-volleyball-sectional-foes/article_f24f2ef8-7a80-11e5-a0d0-ffa2b06609a4.html", "ord_in_thread": 0, "title": "Tigers, Argylls polish off volleyball sectional foes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tigers, Argylls polish off volleyball sectional foes By Rick Teverbaugh The Herald Bulletin Herald Bulletin \nALEXANDRIA – It was the matchup everyone wanted and expected and it was set into place Saturday morning in the semifinals of the Alexandria volleyball sectional. \nMadison-Grant erased Eastbrook 25-11, 25-12, 25-14 after Alexandria had disposed of a stubborn Elwood team 25-16, 25-15, 25-20. \nThe first set was the dominating for the No. 1-ranked Tigers over the Panthers. Alex led 9-5 but then went on a streak where it won 11 of the next 14 points. In that stretch Megan Miller had three kills and Makaylea Alberts added two more. \nIn the second set, Elwood led as late as 9-7 behind the net play of Mckenzie Wilson. But the Tigers had another spurt saved up. They scored 14 of the next 17 points. Seven of those points came on Alberts’ serve, four coming off her aces. Miller polished off the Panthers by nailing three straight aces. \nThe final set, Alexandria waited until Alberts took over the serve with her team ahead only 22-20. She served the final three points, two coming on Miller kills. \nMadison-Grant rode roughshod over the other group of Panthers from Eastbrook. \nIn the opening set, the Argylls allowed the Panthers to score just three points on serve. Mallorie Havens had five kills, Sloane Stewart had four kills and two blocks while Maddie Barnhart and Kelsey Kohlmorgen had two kills each. \nHavens got the Argylls off to a big start in set two by serving eight straight points, half of them on aces. Eastbrook did manage to get within four at 13-9, but when Kenzie Stitt took over serve for MG with the score 19-12, it was over. Stitt served three straight aces. Kohlmorgen had a stuff block and Maddi Evans, inserted to serve the final point, aced it. \nEastbrook led in the final set 4-2 until Hannah Alcala took over the serve. She served the next nine points, two on aces. Three more points came from the strong net play of Stewart. The match was closed out on a Havens block and a Stewart kill. \nThe Alexandria vs. Madison-Grant title match will be the fourth time the two teams have met this season. The Tigers have won the previous three. Sign Up / Sign In With your existing account from... {* loginWidget *}", "external_links": [], "published": "2015-10-24T21:55:00.000+03:00", "crawled": "2015-10-24T22:38:03.025+03:00", "highlightTitle": ""}