{"organizations": [], "uuid": "535139442ce2bf8b2fa50fc56afb70a5e6771095", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.oregonlive.com", "main_image": "http://imgick.oregonlive.com/home/olive-media/width620/img/ent_impact_music/photo/18871023-standard.jpg", "site_section": "http://www.oregonlive.com/", "section_title": "Oregon Local News, Breaking News, Sports &amp; Weather - OregonLive.com", "url": "http://www.oregonlive.com/music/index.ssf/2015/09/portland_hip_hop_day_announcement.html", "country": "US", "title": "Mayor Hales launching Portland Hip-Hop Day, but is it enough?", "performance_score": 0, "site": "oregonlive.com", "participants_count": 7, "title_full": "Mayor Hales launching Portland Hip-Hop Day, but is it enough? | OregonLive.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T21:35:00.000+03:00", "replies_count": 6, "uuid": "d3010ce60fffecfbd28561e4d8bbc70396d3e6a0"}, "author": "David Greenwald | The Oregonian/OregonLive", "url": "http://www.oregonlive.com/music/index.ssf/2015/09/portland_hip_hop_day_announcement.html#post-0", "ord_in_thread": 0, "title": "Mayor Hales launching Portland Hip-Hop Day, but is it enough?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Portland will honor its hip-hop community for the first time on Oct. 15, with a Hip-Hop Day celebration and live concert at City Hall.\n\"I am so excited to have Portland hip-hop artists in City Hall,\" Mayor Charlie Hales said in a statement to the Oregonian. \"One of the things I love about this city is the creative energy we bring to everything we do. When The Decemberists launched their album in City Hall, we saw how there could be creativity in civic engagement. With the help of our wonderful partners StarChile and DJ O.G.ONE, we're going to have some of Portland's top hip-hop artists perform in City Hall, honoring hip-hop as an important piece of our identity as a city—and hopefully bringing people to City Hall who've never been here before.\"\nBefore the official confirmation, news emerged through Mic Capes' Instagram feed : the Portland MC shared an announcement with a list of performers and a different statement.\n\"I want to help deliver the message that hip-hop has an important place in the identity of our city,\" Hales is Quote: d in Capes' post.\nHip-hop's place in the city has been hotly debated in the last two years. Tensions between Portland authorities and the hip-hop community exploded in March 2014, when police presence at an Illmaculate concert led to a premature ending and a community outcry. Some hip-hop performers have felt themselves unjustly targeted and pressured by the attention of police and fire marshals, making live performance -- an important part of their artistic expression and livelihood -- a struggle. Authorities have denied the claims, with the scene's frustrations leading to the Independent Police Review team's efforts to inspect the issue. Its December 27-page report ultimately called for better communication.\nThose events came amid a handful of national articles, including a controversial Noisey piece , dwelled on the dfficulities of Portland hip-hop artists—with little attention left for the music.\nHip-Hop Day may picture the community in another light.\nThe event, according to Capes' shared press release, will include Vinnie Dewayne, Mic Capes, Jon Belz, DJ Juggernaut, Lady X and Oz Rock, with StarChile and DJ O.G. One, the Portland Trail Blazers' resident DJ, hosting the show.\nNews spread quickly through the hip-hop scene on Wednesday, prompting both social media support and suspicion.\n\"A hip hop show and suddenly everyone's promoting Charlie Hales and the 'good communication' they've supposedly facilitated in Portland,\" Mohammed Alkhadher, who performs as BigMo, wrote on Twitter.\nKenny Fresh, a label runner and Xray.fm DJ, hoped performers would use the day's megaphone responsibly.\nif you're performing at that Hip-Hop Day, please don't waste the opportunity to speak some truth to all the local government in attendance\n— Ned Flichsenchill (@kennyfresh) September 30, 2015 And as debate went on, Portland singer Blossom looked for the high ground.\nThe drama over this Portland hip/hop show is tew tew much. Don't let em divide us\n— Blossom (@thatsBlawesome) September 30, 2015 I'm down to make this day about us and not the mayor. That's how they win.\n— Blossom (@thatsBlawesome) September 30, 2015 Capes posted the news on Instagram with pride: \"THIS IS HUGE!!! BE THERE!!!!\" he wrote.\n\"As of late, the police haven't been harassing hip-hop shows,\" he said over the phone. \"I feel like we can look at it a bunch of different ways. For hip-hop, I feel like it is (a step forward).\"\nStill, he acknowledged the looming mayoral race, which will see Hales seeking a second term in 2016 .\n\"Hales is a politician, he's trying to get re-elected,\" Capes said, laughing. \"I see it as a culmination of all the hard work. Keep going, keep doing what we doing. I don't see this as, just because it's a Hip-Hop Day, there won't be problems with police and all that.\"\nHales has shown a particular interest in music as mayor: an honor from the city has been previously bestowed on \"Louie Louie,\" the rock 'n' roll staple popularized by local acts the Kingsmen and Paul Revere and the Raiders in the '60s. This January's Decemberists Day celebrated a more modern success, The Decemberists, an act who have topped the Billboard charts while serving as ambassadors for a certain Portland style of whimsical, and Caucasian, creativity.\n-- David Greenwald\ndgreenwald@oregonian.com\n503-294-7625; @davidegreenwald", "external_links": ["https://twitter.com/thatsBlawesome/status/649285091785469952", "https://twitter.com/davidegreenwald", "https://instagram.com/p/8Q-CwPubRW/", "https://twitter.com/kennyfresh/status/649291559037374465", "https://twitter.com/thatsBlawesome/status/649285450343907328", "https://instagram.com/p/8Q-CwPubRW/?taken-by=mic_capes", "http://noisey.vice.com/blog/portland-has-a-hip-hop-problem"], "published": "2015-09-30T21:35:00.000+03:00", "crawled": "2015-10-01T00:18:32.389+03:00", "highlightTitle": ""}