{"organizations": [], "uuid": "462215cbd0ec4930af87b41e853841f60fade709", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thetimesnews.com", "main_image": "http://www.thetimesnews.com/Global/images/head/nameplate/thetimesnews_logo.png", "site_section": "http://www.thetimesnews.com/sports/elon-sports?template=rss&mime=xml", "section_title": "Elon Sports - The Times-News", "url": "http://www.thetimesnews.com/article/20151003/SPORTS/151009689/15218/SPORTS?rssfeed=true", "country": "US", "title": "A chance to make big splash: Elon encounters one of FCS level's elite programs", "performance_score": 0, "site": "thetimesnews.com", "participants_count": 1, "title_full": "A chance to make big splash: Elon encounters one of FCS level's elite programs", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T08:43:00.000+03:00", "replies_count": 0, "uuid": "462215cbd0ec4930af87b41e853841f60fade709"}, "author": "Adam Smith Times-News asmith@thetimesnews.com", "url": "http://www.thetimesnews.com/article/20151003/SPORTS/151009689/15218/SPORTS?rssfeed=true", "ord_in_thread": 0, "title": "A chance to make big splash: Elon encounters one of FCS level's elite programs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Oct. 3, 2015 at 12:41 AM Updated at 12:43 AM Combine the reality at work with the opportunity at hand for the Elon football team and today’s game at New Hampshire creates a situation teeming with excitement. Here’s the improving Phoenix, boosted by a winning feeling and budding confidence, facing one of the established powers in the Colonial Athletic Association and all of the Football Championship Subdivision. “It gets me real pumped,” Elon safety Chris Blair said. “It’s the chance to take down one of the big dogs. This is huge for our program. To win it would mean taking the next step to becoming a great team in the CAA. “I don’t care if we’re looked at as a lower program in the CAA, each and every day, like (today), if you’re not coming out for greatness, there’s no reason to come out and play.” Elon has won two of its last three games — marking the first time in three years even modest success such as that has happened — and arrives with an unmistakable sense of momentum after last week’s breakthrough defeat of Towson, the first victory in the new league for the Phoenix, which went 0-8 in its conference debut last year. All of a sudden, Elon has started 1-0 in the CAA and is — yes, of course, it’s exceedingly early — tied for first place in the league standings. Quarterback Connor Christiansen said a growing faith has become one of the positive effects of Elon’s recent victories, which were met with happy locker room scenes, bouncing and roaring celebrations at Gardner-Webb and at home after the Towson game. “Now, I think we’ve set the expectation,” Christiansen said. “We’ve shown we can win and so I think people don’t accept losses anymore. Winning is the best feeling and it makes you want to have it more. “And I think the great thing about being 1-0 in the conference is the opportunity to go 2-0. That’s exciting. We’ve tasted what victory feels like in the CAA and we feel that we can compete against the good teams. So why not us? Why not go beat the No. 20 team in the nation?” There’s plenty worth considering in regard to why-nots, such as: ■ New Hampshire is 43-5 at home in Cowell Stadium, nicknamed “The Dungeon,” since the start of the 2007 season. ■ The Wildcats, last year’s CAA champions, have won eight straight home games in the league, with their last loss coming in November 2012. ■ Today is New Hampshire’s homecoming and the game has been sold out since Tuesday. Page 2 of 2 - ■ New Hampshire is coming off a 57-14 rout of Central Connecticut State that contained season highs in passing (263 yards), rushing (235 yards), total offense (498 yards), sacks (seven) and turnovers forced (three). ■ New Hampshire mauled Elon 48-14 last season, crashing the welcoming party for Elon’s first CAA game in school history. The Wildcats pulled some of their starters early in the third quarter that day while bolting to a 48-0 lead. “Last year they ran all over us,” Christiansen said. “I haven’t mentioned anything about revenge,” Elon coach Rich Skrosky said. “I think this team, our team, is a truly different team. I think there’s a little bit more belief and a little bit more trust.” Skrosky said he holds immense respect for New Hampshire’s sustainability through the years. The program has produced FCS records with its current streaks of 11 straight playoff trips and 160 consecutive weeks of being ranked in the Top 25. Skrosky also can’t help but appreciate the moment Elon and its progress will encounter today. His voice echoed around Rhodes Stadium on Tuesday night, issuing motivational reminders and challenges as the Phoenix finished practice. “I can’t wait,” Skrosky said. “To me, it’s all about opportunity, grabbing this opportunity, because you ain’t going to get them every day. That’s what good teams do. Now, are we good enough? We’ll find out.” Elon (2-2, 1-0) at No. 20 New Hampshire (2-2, 0-1) Kickoff: 3:30 p.m. today Radio: WSML-FM 104.5, WSML-AM 1200 Where: Cowell Stadium (capacity 6,500) Coaches: Rich Skrosky (second season at Elon, 3-13). Sean McDonnell (17th season at New Hampshire, 128-75). Series: New Hampshire leads 1-0 Extra points …: These Colonial Athletic Association football schools are separated by about 795 miles. This marks the farthest north Elon has ever traveled for a game and its longest road trip since a 2002 game at Northwestern State in Louisiana. … Elon hasn’t started 2-0 in a league since 2009, when the Phoenix was in the Southern Conference. … New Hampshire has used four quarterbacks this season. Sean Goldrich , the Wildcats’ top option at the position, hasn’t played since Sept. 12 due to injury. Adam Riese makes his second career start today. He threw for 188 yards and three touchdowns in last week’s blowout of Central Connecticut State. … Elon linebackers John Silas and Corey Mitchell are tied for first place in the CAA with 46 tackles apiece. They’re both averaging 11.5 tackles per game. … Running back Dalton Crossan leads New Hampshire in rushing (257 yards), kickoff returns (208 yards) and catches (17) on the season. His 145.5 all-purpose yards per game is the best mark in the league. … Elon could be without a pair of experienced starters on defense in lineman Marquise Wright and cornerback Adrian McClendon . Both players are listed as questionable due to injuries. True freshman Greg Liggs Jr. played in place of the absent McClendon last week. By Adam Smith", "external_links": [], "published": "2015-10-03T08:43:00.000+03:00", "crawled": "2015-10-03T08:15:28.953+03:00", "highlightTitle": ""}