{"organizations": [], "uuid": "448130d4d8a6c235c7e20bf4242be4e9fa6e89f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theolympian.com", "main_image": "http://www.theolympian.com/sports/nfl/seattle-seahawks/gh9fxb/picture37915518/ALTERNATES/LANDSCAPE_1140/hawks_lions_camcausesfumble", "site_section": "http://www.theolympian.com/sports/?widgetName=rssfeed&widgetContentId=712015&getXmlFeed=true", "section_title": "College & Professional Sports News, Scores & Photos | TheOlympian.com &", "url": "http://www.theolympian.com/sports/nfl/seattle-seahawks/article37914942.html", "country": "US", "title": "Kam Chancellor, defense save Seahawks in 13-10 win over winless Lions", "performance_score": 0, "site": "theolympian.com", "participants_count": 1, "title_full": "Kam Chancellor, defense save Seahawks in 13-10 win over winless Lions", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T06:32:00.000+03:00", "replies_count": 0, "uuid": "448130d4d8a6c235c7e20bf4242be4e9fa6e89f5"}, "author": "Gregg Bell \nStaff writer", "url": "http://www.theolympian.com/sports/nfl/seattle-seahawks/article37914942.html", "ord_in_thread": 0, "title": "Kam Chancellor, defense save Seahawks in 13-10 win over winless Lions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "October 5, 2015 Kam Chancellor, defense save Seahawks in 13-10 win over winless Lions As Lions receiver Calvin Johnson stretches for the end zone, Seahawks safety Kam Chancellor prepares to punch the ball loose in the waning moments of the fourth quarter. Photo taken in Seattle on Monday, Oct. 5, 2015. Drew Perine Staff photographer i \nThe Seahawks were saved by a touchback in the \"Fail Mary\" end zone. \nOh, and … Welcome back, Kam Chancellor. \nSeattle’s beloved team leader and Pro Bowl strong safety, 11 days removed from a two-month holdout, Megatron’d Detroit receiver Calvin Johnson off both his feet following a catch over the middle. Later in the fourth quarter, Chancellor saved the game. \nFormer Seahawk Golden Tate kept the Lions alive with a big catch on third down late. But then Chancellor hit Johnson just before he carried a catch across the goal line with 1:51 left. That turned what would have been Detroit’s winning touchdown into the saving touchback, a fumble out of the back of the same, north end zone in which Tate simultaneously catch a desperation pass to end a Monday night win over the Packers in 2012. \nThe defense not allowing an offensive touchdown for the second straight week – plus a clinching, 50-yard completion from harassed Russell Wilson to Jermaine Kearse – is how the Seahawks won their second straight game 13-10 over the Lions on another zany Monday night at CenturyLink Field. \nBut can these Seahawks keep winning this way? \nIt worked – barely – against Detroit (0-4, the league’s only winless team), this reliance on a back-to-form defense. Seattle pounded Lion after Lion and left him withering into the turf injured or stunned, or both. \nOn offense, Wilson ran around making playground plays behind an awful offensive line while avoiding six more sacks than the four he got in front of 69,005 somewhat unsatisfied home fans. \nThe Seahawks (2-2) played for just the second time in six seasons without Marshawn Lynch. He was out with an injured hamstring, though looked good running on the field two hours before kickoff. That was a positive sign he may be ready to return on Sunday when Seattle plays at unbeaten Cincinnati. \nThe offense managed just one touchdown without the NFL’s rushing leader since 2011. Undrafted rookie Thomas Rawls led Seattle with 48 yards on 10 carries replacing Lynch. \nWilson got sacked six times by a team that was 24 th in the 32-team league in sacks per game coming in. Wilson lost two fumbles. Detroit’s Caraun Reid scooped up the second one and ran 27 yards for the touchdown early in the fourth quarter. Suddenly, Seattle’s lead was down to 13-10, and the offense’s woes got further magnified. \nAfter yet another Seahawks’ three-and-out on offense, Detroit drove from its own 9 to the red zone. Then Chancellor saved the night.", "external_links": [], "published": "2015-10-06T06:32:00.000+03:00", "crawled": "2015-10-06T07:10:40.087+03:00", "highlightTitle": ""}