{"organizations": [], "uuid": "911b298e1cc5c7d75054b23fbf1caa757181c5d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/10/13/12944363/v2fitlogo.jpg", "site_section": "http://www.prweb.com/rss2/9960sportsmedicine.xml", "section_title": "Health: Sports Medicine", "url": "http://www.prweb.com/releases/2015/09/prweb12944363.htm", "country": "US", "title": "Concussion Health Launches Cutting Edge Concussion Rehab", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Concussion Health Launches Cutting Edge Concussion Rehab", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "911b298e1cc5c7d75054b23fbf1caa757181c5d7"}, "author": "Jeseka Kreitner", "url": "http://www.prweb.com/releases/2015/09/prweb12944363.htm", "ord_in_thread": 0, "title": "Concussion Health Launches Cutting Edge Concussion Rehab", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Austin-based Concussion Health announces the launch of a certification course known as Visual Vestibular Functional Integration Training (V2FIT). The V2FIT certification course has been designed to provide practical application of treatment strategies in the functional integration of the visual and vestibular systems following a concussion. So much of the media attention or even research efforts have focused on cognition as the key component of a concussion program, but it is only one tool. Dizziness, visual disturbances and balance problems are common symptoms with head trauma, and dizziness has been identified as the number one predictor for post-concussion syndrome.\nThis course takes an interdisciplinary approach focusing on cognition, balance/vestibular and vision/oculomotor. It also recognizes the importance of other factors that may interfere with concussion recovery such as past medical history, migraines, previous head trauma, learning disorders, decreased neck strength, anxiety or depression. Additional factors to consider are sleep patterns, pain and even diet.\nThe visual and vestibular symptoms are highly integrated, and disruption in either of these symptoms cannot only hinder concussion recovery but increase the risk of more serious injury, especially if the individual returns to their previous level of activities too soon. “It is estimated that 85-90% of an athlete’s performance is guided by their visual system,” said Mary McMains Beck, OD, MEd, FCOVD and President of Austin Eye Gym. “This is often overlooked. Vision is pervasive in the brain, so it can be a significant performance indicator and can quickly help determine if an injury is sustained.” Both the visual and vestibular systems have multiple pathways to multiple parts of the central nervous system. A concussion can cause shearing of the pathways which negatively impacts vestibular and visual function and integration.\nIn a more recent publication regarding the Vestibular/Ocular Motor Screening (VOMS), researchers from the UPMC Sports Medicine Concussion Program noted that symptom provocation with performing tests for the vestibular ocular reflex (VOR), visual motion sensitivity (which is essentially VOR cancellation) and near point convergence revealed an 89% accuracy in diagnosing a concussion yet it is estimated that these series of tests are performed less than five percent of the time.\nKeep in mind that according to the National Institutes of Health, it takes an average of 17 years for original research to be integrated into clinical practice. “The educational resources we are committed to providing are evidence based medicine that not only relies on published research but successful treatment outcomes that we have had with our own patients through the years,” said Bridgett Wallace, PT, DPT and Concussion Health’s Director of Clinical Education. “The V2FIT certification course includes a level of expertise and clinical experience that is not only being practiced but is continually evolving and expanding our understanding of best practices.”\nThe V2FIT certification course was developed by Dr. Beck and Bridgett Wallace, PT, DPT, two practicing clinicians determined to provide cutting edge education and tools that will result in the most positive outcomes. Course participants receive online education that includes step-by-step video training and live coaching sessions organized into a flexible schedule that allows time to complete the training.\nThe V2FIT Certification is a four part series:\n PART 1: VISUAL VESTIBULAR FUNCTIONAL INTEGRATION TRAINING PART 2: ADVANCED TREATMENT STRATEGIES & PROBLEM SOLVING DIFFICULT CASES PART 3: WORKSHOP WITH A CONCUSSION HEALTH SPECIALIST PART 4: EXAMINATION\nDo you have a burning question about visual-vestibular concussion rehab? Are you confused about what to incorporate into your initial evaluation? If so, you are probably asking questions such as: How do I know if visual and/or vestibular exercises are needed and if so, where would I find a good resource for visual exercises? How do I know if further referral is needed? You also might be asking: If VOMS is abnormal, do I need to be doing vestibular and visual rehab? Maybe the question you are asking is: How do I utilize information from the BESS test?\nTune in to a free live training call with Dr. Beck and Bridgett Wallace, PT, DPT on October 21st at 11:00am CST answering these questions and discussing visual vestibular concussion rehab. Click here for more information on the live training call and course registration. The V2FIT certification course starts on November 2nd and registration opens on October 21st.\nRemember there is no one discipline or one tool that is the answer for a successful concussion management program. It is not only a multi-disciplinary approach but an INTRA-disciplinary approach with the understanding that each individual must be treated uniquely. Each recovery process can differ not only between individuals but within the individual themselves if they should suffer more than one concussion. Remember: once you have seen one concussion, you have seen one concussion.\nAbout Concussion Health\nWith the ever-growing expansion of mixed learning through live and online courses, Concussion Health was founded in 2009 to provide online education specific to concussion management in an effort to share these findings and bridge the gap between sports medicine and vestibular therapy, as well as emphasize the importance of vision assessment and therapy. Concussion Health provides thorough, easy to follow, and clinically valuable education & tools to support best practices in concussion rehab.\nAbout Mary McMains Beck, OD, MEd, FCOVD\nDr. Beck is Board Certified in Vision Development by the College of Optometrists in Vision Development, Diplomate of the American Board of Optometry and holds a Master of Education degree in Visual Function in Learning. President of Austin Eye Gym (outpatient Vision Therapy Center), she is also an educator for Minds on the Move, providing accredited continuing education on vision development and function to occupational therapists, physical therapists and speech language therapists. Dr. McMains has accumulated more than 500 hours of continuing education in her specialty and has more than 13 years of experience in her field.\nAbout Bridgett Wallace, PT, DPT\nBridgett Wallace, PT, DPT, has a doctorate of physical therapy and holds a competency-based certification in vestibular rehabilitation. She has been treating patients with dizziness and balance disorders for more than 15 years and is the President of 360 Balance & Hearing (specialty clinic for the evaluation and treatment of dizziness and balance disorders). Ms. Wallace’s work encompasses a wide variety of patient populations ranging from pediatrics to geriatrics, from multi-factorial balance problems to collegiate athletes post-concussion, and inner-ear disorders to neurological disorders. She consults locally and nationally on the development of balance centers and medical management of vestibular disorders, including RTP protocols for post-concussion athletes.", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL2NvbmN1c3Npb25oZWFsdGguY29tL3YyZml0Lw==", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy51cG1jLmNvbS9tZWRpYS9OZXdzUmVsZWFzZXMvMjAxNC9QYWdlcy91cG1jLXJlc2VhcmNoZXJzLWNyZWF0ZS12ZXN0aWJ1bGFyLXRlc3QtZm9yLWNvbmN1c3Npb25zLmFzcHg=", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL2NvbmN1c3Npb25oZWFsdGguY29tLw==", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy52MmZpdC5vcmcv"], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-15T16:25:23.281+03:00", "highlightTitle": ""}