{"organizations": [], "uuid": "bfc42ede49ebf245ec93ee711f4d5da44bacf60d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mercurynews.com", "main_image": "http://local.mercurynews.com/common/dfm/assets/logos/1200x627/mercurynews.png", "site_section": "http://feeds.mercurynews.com/mngi/rss/CustomRssServlet/568/200223.xml", "section_title": "Sports", "url": "http://www.mercurynews.com/sports/ci_28998732/lawsuit-alleges-cal-high-officials-knew-possible-sex?source=rss", "country": "IL", "title": "Lawsuit alleges Cal High officials knew of possible sex abuse by wrestling coach, didn't alert authorities", "performance_score": 0, "site": "mercurynews.com", "participants_count": 1, "title_full": "Lawsuit alleges Cal High officials knew of possible sex abuse by wrestling coach, didn't alert authorities", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T15:50:00.000+03:00", "replies_count": 0, "uuid": "bfc42ede49ebf245ec93ee711f4d5da44bacf60d"}, "author": "Matthias Gafni\n\nmgafni@bayareanewsgroup.com", "url": "http://www.mercurynews.com/sports/ci_28998732/lawsuit-alleges-cal-high-officials-knew-possible-sex?source=rss", "ord_in_thread": 0, "title": "Lawsuit alleges Cal High officials knew of possible sex abuse by wrestling coach, didn't alert authorities", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Lawsuit alleges Cal High officials knew of possible sex abuse by wrestling coach, didn't alert authorities By Matthias Gafni Posted: 10/21/2015 05:49:17 AM PDT Updated: 10/21/2015 05:50:40 AM PDT SAN RAMON -- A year before former California High wrestling coach Kevin Lopez was arrested and charged with molesting three boys, a concerned parent reached out to administrators and claimed Lopez had inappropriately touched boys and girls, according to documents obtained by this newspaper. \nBut instead of immediately reporting the concerns to police or Child Protective Services, as required by state law, San Ramon Valley Unified School District officials conducted their own investigation and cleared Lopez of wrongdoing, a lawsuit alleges. \nLopez, 28, pleaded guilty earlier this year to eight felony counts of lewd acts on children between the ages of 14 and 15 and other related charges involving three boys from 2003 to 2014. He was sentenced to 10 years, eight months in prison. \nThe coach was arrested after a victim's parents found incriminating texts on their son's phone and reported their suspicions to California High School officials in September 2014. A school official went to police, according to a San Ramon police report. That victim is now suing the school district and New Life Church of Alamo, where Lopez worked as a youth pastor. \nBut 10 months earlier, in November 2013, at least three district administrators who knew of a different parent's concerns failed to alert authorities, allowing Lopez to continue to work with and molest children, according to the lawsuit filed late last week. Advertisement \n\"This is the classic example of why school administrators should not conduct investigations into sex abusers,\" said attorney Robert Allard, who represents the 16-year-old boy and his mother. \"They should have let police handle it once reasonable suspicion was formed.\" \nIn California, school officials are required by law to immediately report suspicions of abuse to police or Child Protective Services. Documents obtained through a public records request, including handwritten notes by school officials, shed new ﻿details on the case and appear to illustrate what has become an alarming occurrence in child-molestation cases involving educators and students -- districts often mistakenly investigate allegations themselves rather than turn over the information to authorities. \nThe victim in the lawsuit was 15 years old when he was molested by Lopez, who was 27 at the time, from August 2013 to September 2014, including kissing and attempted oral sex. \nWhen police were finally alerted, they brought Lopez in for questioning, but once they began asking about the victim, Lopez asked for his attorney and the interview ended, according to the police report. However, after detectives left the interview room, Lopez continued talking to himself, and his comments were recorded. \n\"How did they find out? How did they find out about (victim's name)? (Expletive)! ... OK God, I'm scared. Please help me,\" the police report stated. \nDetectives then read a text off Lopez's phone in earshot of the interview room, which Lopez heard and, according to the police report, the coach said aloud: \"God ... can you help me right now. (Expletive) miracles right now, God. Please help me.\" \nIn the 2014 police report, Detective Rob Ransom wrote that during his investigation, California High School administrators told him they had received a complaint the year before from a concerned parent of a former student at the San Ramon school. The parent suggested that Lopez may have inappropriately touched boys and girls. \n\"The allegations were unsubstantiated after an investigation by the school,\" Ransom wrote. \nSan Ramon Capt. Dan Pratt confirmed Tuesday that his department was never notified of the 2013 report. Pratt did not know whether anyone contacted CPS about the matter. Asked whether anyone reported the 2013 allegation and why an internal investigation was conducted instead of alerting police and CPS, San Ramon Valley Unified spokeswoman Elizabeth Graswich said she could not comment about pending litigation. \nInternal district documents show handwritten notes by an unknown administrator on a \"Things To Do\" notepad, apparently as the administrator took notes from the 2013 \"concerned parent\" about Lopez. One note indicates: \"Kevin touched students inappropriately.\" \nAnother two pages of handwritten notes titled \"Kevin Lopez\" from 2013 appear to be from a meeting with the former wrestling coach where he downplays his relationship with a victim. That note also mentions a \"victim\" who was then 24 and \"abused at a wrestling camp.\" The day after that, on Nov. 14, 2013, a California High official wrote in an email to a teachers' union representative that he had spoken to Lopez: \"I could not confirm any of the concerns.\" \nBill Grimm, senior attorney with the Oakland-based National Center for Youth Law, said school leaders often fall into the trap of investigating sex abuse allegations themselves when they have no expertise in such probes, and by law are supposed to allow professionals to handle such cases. \n\"I would have erred on the side of reporting on this,\" Grimm said of the Lopez case, after reviewing documents. \"School administrators, teachers and principals are not investigators. They're not supposed to be investigators, and when in doubt they should report.\" \nThe boy also knew Lopez from New Life Church, where the pair spent time and traveled together on church outings, according to the police report and lawsuit. \n\"Grooming and/or molestations occurred during church-sponsored activities,\" Allard said. \"Also, it is believed that members of the church knew Lopez was spending an inordinate amount of time with minor males, including the plaintiff John Doe.\" \nA call to the church was not returned. In the police report, the detective noted that during his molestation investigation, Lopez \"was receiving support from the church members.\" \nAllard said the boy is struggling with what happened to him. \n\"This is going to be a painful wound that he'll have to deal with the rest of his life,\" Allard said. Contact Matthias Gafni at 925-952-5026. Follow him at Twitter.com/mgafni .", "external_links": [], "published": "2015-10-21T15:50:00.000+03:00", "crawled": "2015-10-21T16:20:39.386+03:00", "highlightTitle": ""}