{"organizations": [], "uuid": "42c528e8586da5b3563db6b4d182d8ee7e2530fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kansan.com", "main_image": "http://bloximages.chicago2.vip.townnews.com/kansan.com/content/tncms/assets/v3/editorial/5/b3/5b365e94-6264-11e5-92aa-734a7840be15/5603607f1f855.image.jpg?resize=760%2C507", "site_section": "http://www.kansan.com//search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&nsa=eedition&c[]=sports,sports/*&f=rss", "section_title": "The University Daily Kansan - sports,sports/", "url": "http://www.kansan.com/sports/ku-volleyball-s-undefeated-run-ends-with-loss-to-no/article_47d11892-79fe-11e5-8d4d-4786603aedae.html", "country": "US", "title": "KU volleyball's undefeated run ends with loss to No. 2 Texas", "performance_score": 0, "site": "kansan.com", "participants_count": 1, "title_full": "KU volleyball's undefeated run ends with loss to No. 2 Texas", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T06:21:00.000+03:00", "replies_count": 0, "uuid": "42c528e8586da5b3563db6b4d182d8ee7e2530fe"}, "author": "Josh McQuade | @L0neW0lfMcQuade", "url": "http://www.kansan.com/sports/ku-volleyball-s-undefeated-run-ends-with-loss-to-no/article_47d11892-79fe-11e5-8d4d-4786603aedae.html", "ord_in_thread": 0, "title": "KU volleyball's undefeated run ends with loss to No. 2 Texas", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Missy Minear/KANSAN 092315_vbcvskstate_missyminear-5.jpg \nSenior outside hitter Tiana Dockery hits the ball over the net Wednesday night against Kansas State. The Jayhawks defeated the Wildcats in four sets. Posted: Friday, October 23, 2015 10:21 pm KU volleyball's undefeated run ends with loss to No. 2 Texas Josh McQuade | @L0neW0lfMcQuade kansan.com 19-0. The Jayhawks hit the road for Austin, Tex. at 19-0 — their best record in program history. Their opponent, the Texas Longhorns, were ranked No. 2 in the nation, but the Jayhawks were a top 10 team in their own right, looking for their 20th-straight win this year. The clock finally struck midnight. The Jayhawks perfect season came to an end at the Gregory Gymnasium, as the Longhorns proved to be too much for the Jayhawks to handle, sweeping the match (25-16, 25-19, 25-14). \"Tonight can be a learning experience if we allow it to be,\" Kansas coach Ray Bechard said after the match to KU Athletics. \"Obviously [the Longhorns] forced us into things we didn't want to do. That's what good teams do, but then you have to have a response to that.\" Kansas showed some jitters in the first set, which they never led at any point. The team posted five service errors, while allowing Texas to record a hitting percentage of .517. However, things would tighten up. After dropping the 1st set, No. 7 #kuvball has responded well vs. No. 2 Texas. KU won the first 5 pts of the set and currently leads 15-12. — Scott Chasen (@SChasenKU) October 24, 2015 The second set showed a change of pace as the Jayhawks regained their footing. Kansas scored the first five points of the set, forcing Texas to use its two timeouts before either team had reached 20 points. However, after Kansas took a 17-12 lead, the tide would turn. The Longhorns went on an 8-1 run, taking control of the match at 20-18. They'd eventually finish off the set at 25-19. \"[We] were managing the second set fine, and then they got on a run,\" Bechard said. \"We needed to get into the locker room at one (set) apiece. [Instead,] they went on a late run in the second set, and that carried over into the third.\" After two sets, Kansas needed a miracle if they we're going to complete the comeback. Kansas had not dropped two sets in any game this year, and had only dropped the first set of the match a single time, in an early game against Arkansas. However, the momentum was too much for the Jayhawks to stop. After 2 sets: No. 7 #kuvball trails No. 2 UT 2-0. Texas takes the 2nd set 25-19. #kuvball had not lost 2 sets in a match prior to this one. — Kansan Sports (@KansanSports) October 24, 2015 The team lost the third set 25-14. Kansas posted just eight kills in the set, with a surprisingly low hitting percentage of just .027. Te team committed seven errors, an unprecedented mark for the team over their first 19 games. Simply put, Kansas did not look like itself tonight. The Jayhawks, who came into the contest averaging around 50 kills per match, only posted 33 kills, compared to 48 for the Longhorns. Along with the low kill total, the Jayhawks also recorded 17 attacking errors. As a team, the Jayhawks struggled, although there were some varying individual performances. \nSophomore Kelsie Payne, who is originally from Texas, recorded 10 kills to only one error. Additionally, sophomore setter Ainise Havili was just a dig away from recording a double-double, as she posted 28 assists and 9 digs; Havili also posted two kills. \nHowever, there weren't enough of those positive individual performances for the Jayhawks to win. And even when the individuals thrived, it wasn't for long enough stretches to prove decisive. \n\"We have to play good against good teams for two hours. You can't play good for half a set or three-fourths of a set [and expect to win],\" Bechard said. \"We've had matches this year where that worked. Obviously tonight that wasn't the answer.\"", "external_links": [], "published": "2015-10-24T06:21:00.000+03:00", "crawled": "2015-10-24T15:39:52.189+03:00", "highlightTitle": ""}