{"organizations": [], "uuid": "65b5dc570bf46bd44af960194ce8859f5bf789b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sportsnews.com.au", "main_image": "http://sportsnews.com.au/defaultimage.jpg", "site_section": "http://www.sportsnews.com.au/category/rugby-union/feed/", "section_title": "Sports News Australia » Rugby Union News", "url": "http://www.sportsnews.com.au/rugby-union/cheika-settles-on-best-xv-against-england/158442", "country": "CA", "title": "Cheika settles on best XV against England", "performance_score": 0, "site": "sportsnews.com.au", "participants_count": 1, "title_full": "Cheika settles on best XV against England", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T10:04:00.000+03:00", "replies_count": 0, "uuid": "65b5dc570bf46bd44af960194ce8859f5bf789b2"}, "author": "AAP", "url": "http://www.sportsnews.com.au/rugby-union/cheika-settles-on-best-xv-against-england/158442", "ord_in_thread": 0, "title": "Cheika settles on best XV against England", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Cheika settles on best XV against England   5:04 pm \nAfter 11 months of tinkering, Wallabies coach Michael Cheika has finally settled on the line-up he hopes will take Australia to Rugby World Cup glory. \nFor the first time in his 11-Test reign, the wily coach has retained his first-choice starting XV. \nIn Saturday’s Pool A crunch match with England at Twickenham, Cheika will field the same starting side that tasted success in Australia’s World Cup opener against Fiji. \nThursday’s team naming is the surest indication yet that Cheika and assistants Stephen Larkham and Nathan Grey believe this to be the Wallabies’ strongest line-up, which will be skippered by Stephen Moore in his 98th Test. \nIn the most notable selection, Cheika has opted for the steadying hand and more reliable boot of Bernard Foley over the mercurial Quade Cooper as his five-eighth in the Twickenham pressure cooker. \nThere was an opportunity for several other players to force their way into the side, with undeniable performances from the second-string XV against Uruguay on Sunday – but the 65-3 thrashing, while impressive, wasn’t able to change Cheika’s mind. \n“We’ve been working hard each day this week to improve our game before we play England on Saturday,” said Cheika. \n“I believe that this selection, the same starting team that ran out (against) Fiji, has been really clear on where we must improve and the level we must be at to compete with England, and we know that it’s going to be a very tough challenge. \n“The group is really committed to making all Australians truly proud of how we represent them at this Rugby World Cup and Saturday night (Sunday AEDT) will be another opportunity for us to do that.” \nThe starting line-up most closely resembles the team rolled out for the opening Bledisloe Cup match this year – won 27-19 by the Wallabies in August to secure the Rugby Championship. \nIt includes the dynamic back-row combination of Michael Hooper and David Pocock, who will wear No.8. \nThe pair were dominant against Fiji, with Pocock grabbing a double in a man-of-the-match performance, and was also hailed a great success after they wreaked havoc against the All Blacks in Sydney – the only other time they had started a match together. \nAs well as Foley, Cheika has also shown faith in Will Genia, despite pressure from back-up half Nick Phipps. \nCooper performed strongly in attack against Uruguay, setting up three tries with his unpredictable play, but a sloppy day with the boot – kicking five from 11 attempts – hurt his case with points expected to be at a premium in the Twickenham cauldron. \nVeteran Drew Mitchell also impressed against Uruguay, scoring a double, but was unable to oust the ever-reliable Rob Horne from the left wing spot. \nAdam Ashley-Cooper lines up on the other wing, with Matt Giteau and Tevita Kuridrani forming the midfield. \nMeanwhile, locks Rob Simmons and Kane Douglas held off a challenge from Dean Mumm, and the front row of Sekope Kepu, Scott Sio and Moore will be tasked with stopping the English scrum. \nThe match has taken on even greater importance following Australia’s failure to secure a bonus point in their victory over Fiji and England’s loss last weekend to Wales. \nDefeat for England would almost certainly end their tournament in the group stages on their home soil, while Australia would also be in danger of missing the quarter-finals should they be defeated. \nWallabies’ starting line-up to face England: \nIsrael Folau, Adam Ashley-Cooper, Tevita Kuridrani, Matt Giteau, Rob Horne, Bernard Foley, Will Genia, David Pocock, Michael Hooper, Scott Fardy, Rob Simmons, Kane Douglas, Sekope Kepu, Stephen Moore (capt), Scott Sio.  ", "external_links": [], "published": "2015-10-01T10:04:00.000+03:00", "crawled": "2015-10-01T14:05:13.612+03:00", "highlightTitle": ""}