{"organizations": [], "uuid": "06b07be86bd7d2bfe1d562bdccd9a158f89b838c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/47529300.cms", "site_section": "http://timesofindia.indiatimes.com/rssfeeds/4719148.cms", "section_title": "The Times of India Sports: Extensive sports coverage, key statistics and free downloads", "url": "http://timesofindia.indiatimes.com/sports/toi-cri/KL-Rahul-Arvind-back-in-Karnataka-squad/articleshow/49341357.cms", "country": "IL", "title": "KL Rahul, Arvind back in Karnataka squad", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "KL Rahul, Arvind back in Karnataka squad - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T00:00:00.000+03:00", "replies_count": 0, "uuid": "06b07be86bd7d2bfe1d562bdccd9a158f89b838c"}, "author": "Sunil Subbaiah", "url": "http://timesofindia.indiatimes.com/sports/toi-cri/KL-Rahul-Arvind-back-in-Karnataka-squad/articleshow/49341357.cms", "ord_in_thread": 0, "title": "KL Rahul, Arvind back in Karnataka squad", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BENGALURU: Karnataka's Ranji Trophy campaign is set to get stronger with the return of Test batsman KL Rahul and left-arm pacer Sreenath Arvind for their third Group A league match against Vidarbha starting Thursday at the M Chinnaswamy stadium. \n\nRahul returns to first class cricket after recovering from the quadriceps strain he had sustained during India's tour of Sri Lanka in August while Arvind was part of the Indian squad for the T20 series against South Africa. M Nidish and medium pacer David Mathias who were included in the 15 for the last match have been left out. \n\nRahul will look to make the most of the opportunity to regain match fitness before the national selectors sit down to pick the Indian Test squad for the South Africa series. The 23-year-old was one of the key contributor to Karnataka's success for the past two seasons. Last season, Rahul scored 838 runs from five matches including a triple hundred (337). He was the second highest run-scorer when Karnataka won the trophy in 2013-14 season. \n\nMeanwhile, Arvind's inclusion will lend much-needed variety to the pace attack. Arvind, who made his India debut against South Africa in the first T20 earlier this month, played a key role last season finishing with a total of 42 scalps. \n\nSquad: Vinay Kumar R (Captain), CM Gautam (Vice Captain -WK), Samarth R, Robin Uthappa, Manish Pandey, Karun Nair, Shishir Bhavane, Shreyas Gopal, Suchith J, Mithun A, Sharath HS, Udit B Patel, Arvind S, Mayank Agarwal, Rahul KL. Stay updated on the go with Times of India News App. Click here to download it for your device.", "external_links": [], "published": "2015-10-14T00:00:00.000+03:00", "crawled": "2015-10-13T20:42:08.669+03:00", "highlightTitle": ""}