{"organizations": [], "uuid": "140d04c7f8c7ee4292c7fe705c7a6b768f19b1b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailyherald.com", "main_image": "http://www.dailyherald.com/storyimage/DA/20151023/SPORTS/151029308/AR/0/AR-151029308.jpg&amp;updated=201510232359&amp;imageversion=Facebook&amp;exactH=630&amp;exactW=1200&amp;exactfit=crop&amp;noborder", "site_section": "http://www.dailyherald.com/rss/feed/?feed=sports_all", "section_title": "DailyHerald.com &gt; Sports", "url": "http://www.dailyherald.com/article/20151023/sports/151029308/", "country": "US", "title": "Rose returns in Bulls' 103-102 win over Mavericks", "performance_score": 0, "site": "dailyherald.com", "participants_count": 1, "title_full": "Rose returns in Bulls' 103-102 win over Mavericks", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T07:59:00.000+03:00", "replies_count": 0, "uuid": "140d04c7f8c7ee4292c7fe705c7a6b768f19b1b2"}, "author": "Daily Herald news services", "url": "http://www.dailyherald.com/article/20151023/sports/151029308/", "ord_in_thread": 0, "title": "Rose returns in Bulls' 103-102 win over Mavericks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LINCOLN, Neb. -- Derrick Rose made his preseason debut, playing just over 10 minutes, and Doug McDermott hit a fallaway jumper with a second left to give the Bulls a 103-102 victory over the Dallas Mavericks on Friday night.\nBefore the game, head coach Fred Hoiberg told\nBulls.com it was all about Rose getting back in his groove.\n\"If he's comfortable playing, that's the big thing,\" said Hoiberg. \"If he was comfortable going out there, we were going to play him. Talking to the trainers and doctors about it, they felt good about getting him out there. We'll see how he does out and make that determination (about playing next Tuesday) in the next few days.\"\nHoiberg had to like what he saw as Rose settled in Friday, playing about 5 minutes in both the first and second quarters. He had 8 points on 4-of-6 shooting.\nRose seemed uplifted by his effort on Friday as well.\n\"I thought I was going to facilitate the game, he said. But I saw openings and I got all the way to the basket. It's very encouraging.\"\nRose had been sidelined since fracturing his left orbital bone on Sept. 29 during the Bulls' first scrimmage.\nTaj Gibson had 16 points and 7 rebounds while Tony Snell and Nikola Mirotic had 14 points each.\nThe Bulls will host Cleveland to open the regular season on Tuesday.\nThey may catch another break since superstar LeBron James still isn't practicing because of a troublesome back.\nThe four-time MVP received an anti-inflammatory injection in his back on Oct. 13, but hasn't practiced since as he hasn't been cleared by Cleveland's medical and training staffs. James, who played in just two of Cleveland's seven preseason games, said Friday that he's not positive he'll be on the floor against the Bulls.\n\"If everything goes right,\" he said. \"We feel like we're progressing really well and if we can continue to do that, then I'm optimistic that I'll be able to go.\"\nGet great articles like this sent to your inbox! Click here to sign up for the Bulls Newsletter No Thanks Sports Chicago NBA Bulls Basketball Pro Men", "external_links": ["https://twitter.com/share"], "published": "2015-10-24T07:59:00.000+03:00", "crawled": "2015-10-24T12:52:08.027+03:00", "highlightTitle": ""}