{"organizations": [], "uuid": "b93a0a1c560e90b556701e042aaf7f4eeb080a29", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "http://images.tribuneindia.com/cms/gall_content/2015/10/2015_10$largeimg22_Thursday_2015_013049671.jpg", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/community/panj-pyaras-summon-jathedars-suspended/149174.html", "country": "US", "title": "Panj Pyaras summon jathedars, suspended", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "Panj Pyaras summon jathedars, suspended", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "b93a0a1c560e90b556701e042aaf7f4eeb080a29"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/community/panj-pyaras-summon-jathedars-suspended/149174.html", "ord_in_thread": 0, "title": "Panj Pyaras summon jathedars, suspended", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "GS Paul\nTribune News Service\nAmritsar, October 21\nThe Shiromani Gurdwara Parbandhak Committee today suspended the Panj Pyaras of Akal Takht after they summoned five jathedars (Sikh high priests), including that of Akal Takht, to clarify their recent decision to grant pardon to the Dera Sacha Sauda chief. The Panj Pyaras, nominated by the SGPC, had issued a “diktat” to the jathedars to appear in person at Akal Takht on October 23 at 10 am. The Panj Pyaras — Satnam Singh, Tirlok Singh, Mangal Singh, Satnam Singh Khanda and Major Singh — pronounced the “gurmata” (resolution) during a meeting at Akal Takht Secretariat today. SGPC chief Avtar Singh Makkar said they were suspended for violating the service rules. “With this, the decision to summon the five high priests stands annulled. It was against the administrative ethics to take such a decision and could divide the Sikh community. That’s why they have been suspended,” he said. The SGPC also suspended six other employees, including secretaries Roop Singh and Manjit Singh, for staging a protest against the Akal Takht Jathedar at Gurdwara Manji Sahib on October 20. The others suspended were: Karaj Singh, Harcharan Singh Khalsa, Harpal Singh and Surjeet Singh. On September 24, the five high priests - Akal Takht Jathedar Gurbachan Singh, Takht Keshgarh Sahib Jathedar Mal Singh, Takht Damdama Sahib acting Jathedar Gurbaksh Singh, Takht Patna Sahib Jathedar Iqbal Singh and Takht Hazoor Sahib 'granthi' (priest) Ram Singh - had issued 'gurmata' pardoning dera chief Gurmeet Ram Rahim Singh for his alleged blasphemous act of wearing attire similar to that of Guru Gobind Singh in 2007. The Panj Pyaras today summoned the jathedars to justify their decision to pardon the dera chief merely on the basis of a \"pardon letter\" sent through his representatives to Akal Takht. After facing criticism from the Sikh community, the Akal Takht Jathedar had withdrawn the pardon edict on October 16. Satnam Singh, who pronounced the summons, said the jathedars had pardoned the dera chief without taking into confidence the interest of the Khalsa Panth. \"We read media reports about the turmoil among the Sikh masses due to this anti-panthic decision. The intensity of this anguish forced the jathedars to withdraw the gurmata of pardoning the dera chief. Taking cognizance of the conscience of the Sikh community in general, we decided to question them about the rationale behind their decision,\" he said. Jathedar Akal Takht Gurbachan Singh refused to comment on the suspension. Sikh scholars back Panj Pyaras This is the first time that the jathedars of five Takhts have been summoned by Panj Pyaras to clarify their decision in this manner, said Sikh scholars. They, however, said the Panj Pyaras were justified in summoning the high priests. Former Principal Khalsa College Chawinda Devi and Sikh scholar Dr Baljinder Singh said during the battle of Chamkaur, the last five surviving Sikhs constituted themselves into the council of Panj Pyaras and commanded Guru Gobind Singh to leave the fortress and save himself to reassemble the Sikhs. \"They were not of any ordinary gurdwara, but belonged to the Akal Takht, the highest temporal seat of the Sikhs.\" \"They are vested with the power to award religious punishment to the guilty after seeking explanation for religious offences. They had justifiably summoned the jathedars of Takhts in the light of the shattered sentiments of the Sikhs across the world,\" he said. Takht Damdama Sahib's former Jathedar Kewal Singh said at crucial junctures in the past, the Panj Pyaras had acted collectively as the supreme authority. \"When it can be put into practice during the Guru-era, why can't it be done now? The jathedars should be asked the reason for pardoning the dera chief and later taking the U-turn\", he said.", "external_links": [], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-22T04:10:26.801+03:00", "highlightTitle": ""}