{"organizations": [], "uuid": "57f01c93901f25d1b909c7f58912546d11a82bfc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "abcnewsradioonline.com", "main_image": "http://abcnewsradioonline.com/storage/news-images-october-2015/getty_100815_seppblatter.jpeg?__SQUARESPACE_CACHEVERSION=1444318385986", "site_section": "http://abcnewsradioonline.com/sports-news/rss.xml", "section_title": "Sports News", "url": "http://abcnewsradioonline.com/sports-news/fifa-president-sepp-blatter-banned-for-90-days.html", "country": "US", "title": "FIFA President Sepp Blatter Banned for 90 Days", "performance_score": 0, "site": "abcnewsradioonline.com", "participants_count": 1, "title_full": "FIFA President Sepp Blatter Banned for 90 Days", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T18:22:00.000+03:00", "replies_count": 0, "uuid": "57f01c93901f25d1b909c7f58912546d11a82bfc"}, "author": "Jeanette Torres", "url": "http://abcnewsradioonline.com/sports-news/fifa-president-sepp-blatter-banned-for-90-days.html", "ord_in_thread": 0, "title": "FIFA President Sepp Blatter Banned for 90 Days", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Share Article \nPhilipp Schmidli/Getty Images (NEW YORK) -- FIFA President Sepp Blatter has been suspended for three months, FIFA announced on Thursday.During the 90-day ban, Blatter cannot \"represent FIFA in any capacity, act on the organisation’s behalf, or communicate to media or other stakeholders as a FIFA representative,\" FIFA said in a statement.The suspension stems from criminal proceedings that were opened against Blatter last month amid accusations that he signed an \"unfavorable\" deal for FIFA and made a \"disloyal payment\" to Michel Platini, president of Europe's governing body for the sport. Platini and FIFA Secretary General Jérôme Valcke have also been banned for 90 days.In a statement Thursday, Blatter's lawyers said their client was \"disappointed that the Ethics Committee did not follow the Code of Ethics and Disciplinary Code, both of which provide for an opportunity to be heard.\"\"Further, the Ethics Committee based its decision on a misunderstanding of the actions of the Attorney General in Switzerland, which has opened an investigation but brought no charge against the President. In fact, the prosecutors will be obliged by law to dismiss the case if their investigation, barely two weeks old, does not establish sufficient evidence,\" they continued. \"President Blatter looks forward to the opportunity to present evidence that will demonstrate that he did not engage in any misconduct, criminal or otherwise,” the statement concluded.Issa Hayatou, the longest-serving vice president on FIFA's executive committee, will serve as the acting president during Blatter's ban.Blatter has been the head of FIFA since 1998, though numerous accusations of corruption and scandals have befallen the organization since then.Earlier this summer, U.S. Attorney General Loretta Lynch opened up an investigation into bribery and corruption within FIFA.Copyright   11:22AM", "external_links": [], "published": "2015-10-08T18:22:00.000+03:00", "crawled": "2015-10-09T05:55:12.297+03:00", "highlightTitle": ""}