{"organizations": [], "uuid": "10d598ddd907c9e8a81feb204ceec761a76a3864", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seacoastonline.com", "main_image": "http://www.seacoastonline.com/Global/images/head/nameplate/SeacoastOnline_logo.png", "site_section": "http://www.seacoastonline.com/sports/UNH-college?template=rss&mime=xml", "section_title": "College Sports - seacoastonline.com", "url": "http://www.seacoastonline.com/article/20151024/SPORTS/151029467/101033/SPORTS?rssfeed=true", "country": "US", "title": "UNH football falls to Delaware", "performance_score": 0, "site": "seacoastonline.com", "participants_count": 1, "title_full": "UNH football falls to Delaware", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T06:23:00.000+02:00", "replies_count": 0, "uuid": "10d598ddd907c9e8a81feb204ceec761a76a3864"}, "author": "Staff Reports sports@fosters.com", "url": "http://www.seacoastonline.com/article/20151024/SPORTS/151029467/101033/SPORTS?rssfeed=true", "ord_in_thread": 0, "title": "UNH football falls to Delaware", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "UNH football falls to Delaware Wildcats outscored 25-0 in second half Comment Posted Oct. 24, 2015 at 11:21 PM Updated at 11:23 PM Posted Oct. 24, 2015 at 11:21 PM Updated at 11:23 PM » Social News NEWARK, Del . — Casey DeAndrade and Hayden Knudson both finished with a game-high 11 tackles, but the University of New Hampshire football team was defeated 31-14 by the University of Delaware in Saturday night’s CAA conference game at Delaware Stadium. UNH falls to 3-4 overall and 1-3 in the CAA while Delaware improves to 3-4, 2-2. The Blue Hens outgained their guests 355-183 yards, including 235-50 — as well as 25-0 in points — in the second half. Dalton Crossan was UNH’s top ground gainer with 10 carries for 24 yards, including a three-yard TD run that opened the game scoring; he finished with 146 all-purpose yards that included 113 kickoff return yards. Jared Allison was the top receiver with seven catches for 34 yards, including a two-yard touchdown. Kyon Taylor had 35 yards on three catches. Sean Goldrich finished 18 of 33 for 129 yards, one TD and one interception. UNH’s defense recorded eight tackles for a loss, including two sacks. Cam Shorey led the way with 2.5 tackles for a loss, including a sack, as part of his seven total tackles. Delaware carried the ball 55 times for 284 yards (5.2 yards per carry) and four touchdowns. Kareem Williams gained 140 yards on 16 rushes with a three-yard score. Thomas Jefferson had a pair of one-yard scoring runs and a 7-yard rushing TD as part of his 26 carries for 98 yards; he also had two catches for a team-high 41 yards. Joe Walker completed 7 of 11 passes for 71 yards. New Hampshire returns to action Oct. 31 (1 p.m.) at home against the University of Rhode Island. Delaware opened the game with an onside kick, but UNH’s Mike Kelly aught the ball at the UD 46 and the Wildcats took advantage of the excellent field position to take a 7-0 lead at 9:10. UNH converted 4th-and-1 at the UD 37 on Crossan’s four yard run as well as 4 th -and-3 at the UD 7 on Goldrich’s four-yard completion to Allison that set up Crossan’s three-yard TD run. The Blue Hens responded with a 10-play, 75-yard touchdown drive that was aided by a defensive pass interference penalty. Jefferson found a hole between the right guard and tackle for the one-yard score that trimmed the deficit to 7-6 at 4:21. Frank Raggo pulled the ensuing PAT kick wide left. New Hampshire closed the second quarter with a 12-play, 67-yard drive in 2:02 to extend the lead to 14-6 with five seconds on the clock. The drive started with a defensive pass interference call against UD that set up 1 st -and-10 at the UNH 48 and was extended on Crossan’s 15-yard rush on 4 th -and-1 to the Delaware 28. The Wildcats converted their fourth fourth down of the game when Goldrich connected with Taylor on a 22-yard pass play that set up 1 st -and-goal at the 2. Facing third down with 10 seconds on the clock, Goldrich hit Allison on an out patter to the left sideline for a two-yard TD pass. Delaware outscored the Wildcats 18-0 in the third quarter to take control of the game. Raggo’s 33-yard field goal capped an 8-play, 49-yard drive that pulled the Blue Hens within 14-9 at 8:12. Crossan returned the ensuing kickoff 42 yards to the UNH 45, but UNH’s offense went 3-and-out. A 41-yard punt by Christian Breda pinned UD at its 9 yard-line but on the next play Williams raced down the right sideline for an 84-yard gain to the UNH 7. Jefferson ran between the left guard and tackle untouched into the end zone, and Walker ran the ball in on the 2-point PAT conversion to give Delaware its first lead of the game, 17-14, at 6:04 of the third quarter. UD’s Eric Patton recovered Crossan’s fumble on the kickoff return at the UNH 23 and Jefferson scored his third rushing TD of the game four plays later — from one yard out — to extend the advantage to 24-14 at 4:06 to give the Blue Hens 14 points in a span of 1:58 and 18 points in 4:06. Delaware secured the victory with a time-consuming touchdown drive that started at its 24 with 13:29 left in the fourth quarter. The Blue Hens marched 76 yards of 10 minutes, 20 seconds; Williams ended the drive with a three-yard TD run to make it 31-14 with 3:09 to play.", "external_links": [], "published": "2015-10-25T06:23:00.000+02:00", "crawled": "2015-10-25T07:44:57.934+02:00", "highlightTitle": ""}