{"organizations": [], "uuid": "d740e5238d1e94e00ee9faa6300b1afbcc7e65c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/47529300.cms", "site_section": "http://timesofindia.indiatimes.com/rssfeeds/4720867.cms", "section_title": "Top Stories - Golf - Sports - The Times of India", "url": "http://timesofindia.indiatimes.com/sports/golf/top-stories/Grillo-captures-season-opening-event-in-a-playoff/articleshow/49449741.cms", "country": "IL", "title": "Grillo captures season-opening event in a playoff", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "Grillo captures season-opening event in a playoff - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T15:20:00.000+03:00", "replies_count": 0, "uuid": "d740e5238d1e94e00ee9faa6300b1afbcc7e65c6"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/sports/golf/top-stories/Grillo-captures-season-opening-event-in-a-playoff/articleshow/49449741.cms", "ord_in_thread": 0, "title": "Grillo captures season-opening event in a playoff", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NAPA: Rookie Emiliano Grillo sank a birdie putt on the second playoff hole to outlast Kevin Na and claim his first USPGA Tour title in the season-opening tournament on Sunday. \n\nThe 23-year-old from Argentina, who earned his PGA Tour card just two weeks ago by winning the Web.com Tour Championship, fired a three-under 69 -- draining a long birdie putt on the 72nd hole to set up the playoff. \n\nGrillo, already being touted as rookie of the year contender, won in his first tournament as a card-carrying tour member. His previous appearances on the US Tour came through sponsor's invitations. \n\nHe showed he could compete on the big stage, losing in a playoff to Alex Cejka of Germany in the Puerto Rico Open and tying for 10th in the Barbasol Championship. \n\nGrillo had a three-foot putt for the win on the first playoff hole but his ball just caught the left edge and stayed out. \n\nHe and Na both parred the hole so that sent them back to the tee off the par-five 18th again to try and decided the winner. \n\nNa hit a nice tee shot, but he chose to go with a driver off the fairway on his second and hooked it behind a tree. That left him with a tricky third shot from the rough. \n\nHe managed to avoid the tree, but his ball sailed past the hole and landed on the other side of the green. His first putt also went long, opening the door for Grillo to win it with a birdie. \n\nNa shot a two-under 70 in regulation to finish tied with Grillo at 15-under 273. \n\nSouth Africa's Tyrone Van Aswegen shot one of the best rounds of the day at four-under 68 despite starting his morning in a California hospital. He finished tied for third with Justin Thomas and Jason Bohn who shot 69 and 70 respectively. \n\nVan Aswegen woke up feeling sick and was taken by ambulance to a hospital where doctors told him he was suffering from dehydration and vertigo. He was treated with intravenous fluids for the dehydration and released just in time to make his tee time - benefitting from a 20-minute fog delay. \n\nEngland's Justin Rose (72), South Africa's Charl Schwartzel (68), Patrick Rodgers (70) and Kyle Reifers (72) shared sixth place on 276. \n\nBrendan Steele, who led through the first three rounds, struggled mightily Sunday and finished tied for 17th after shooting a disappointing four-over 76. \n\nWorld number three Rory McIlroy shot a three-under 69 for a nine-under 279, six strokes off the pace. Stay updated on the go with Times of India News App. Click here to download it for your device.", "external_links": [], "published": "2015-10-19T15:20:00.000+03:00", "crawled": "2015-10-19T23:20:04.109+03:00", "highlightTitle": ""}