{"organizations": [], "uuid": "3632b453b1f1974ebe83f15f4cfdfc33788c4fe7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wickedlocal.com", "main_image": "http://www.wickedlocal.com/storyimage/WL/20151015/SPORTS/151017238/AR/0/AR-151017238.jpg", "site_section": "http://www.wickedlocal.com/sports?template=rss&mime=xml", "section_title": "Sports - Wicked Local", "url": "http://www.wickedlocal.com/article/20151015/SPORTS/151017238/2000/NEWS?rssfeed=true", "country": "US", "title": "Saugus boys soccer fights for that elusive victory", "performance_score": 0, "site": "wickedlocal.com", "participants_count": 1, "title_full": "Saugus boys soccer fights for that elusive victory", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T01:21:00.000+03:00", "replies_count": 0, "uuid": "3632b453b1f1974ebe83f15f4cfdfc33788c4fe7"}, "author": "Bill Sheehan Correspondent", "url": "http://www.wickedlocal.com/article/20151015/SPORTS/151017238/2000/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "Saugus boys soccer fights for that elusive victory", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Saugus boys soccer fights for that elusive victory Comment Posted Oct. 15, 2015 at 5:21 PM Updated at 5:21 PM Posted Oct. 15, 2015 at 5:21 PM SAUGUS The Sachems are still looking for the right combination that will give them the kind of firepower up front that can put some pressure on the opposition, while giving their own defense a break. “I like how we’re playing defensively,” said coach Dan D’Amico, “but we’re struggling to put the ball in the net. You can only hold off a team for so long on defense when you’re not getting offense.” After losing some key goal scorers from last year’s squad, Saugus has relied on some of its younger and more inexperienced forwards to step up and try to generate some offensive momentum. “We’re rotating some players in to see who can take over the forward position,” D’Amico said. Hoping to find its first win of the season with six games remaining, Saugus needs big performances on both sides of the ball to turn the corner. So far, several individuals have responded. Matt LeBlanc has caught the eye of his coach and teammates alike after consistently showcasing his talents on the field: “I’m really impressed with his foot skills,” D’Amico said of the junior forward. “And he still has another year to grow as a player and get stronger.” From his position at left defender, senior Mike DeBenedictis represents a consistent presence in the backfield. “He’s been playing especially strong for us,” D’Amico added. Senior captain Drew Nelson has made an impact with the tremendous versatility he has brought to the Sachems. “He’s played almost every single position,” noted his coach. “He’s had a really solid season.” Along with Nelson, co-captains Jeremy Trinagle and Connor MacEachern have continued to show their dedication during a difficult season. “They give it their all in every game,” D’Amico said. “They work our system, and play their hearts out.” As they wrap up the season over the next two weeks, the Sachems have their eyes on their first win, but as long as the effort is there, their coach will still be proud of what his team has done. “The goal for the rest of the way is to play our best,” said the second-year coach. “We’ve improved along the way, and there are games where we should be able to compete. “A win would be good, but we play for pride in every game, and the kids still have a positive mindset.” Page 2 of 2 - The Sachems had their work cut out for them against Beverly Oct. 13 after press deadline. The Panthers are one of the strongest teams in the conference. The Saugus boys will then be on the road Friday against host Swampscott. By Bill Sheehan", "external_links": [], "published": "2015-10-16T01:21:00.000+03:00", "crawled": "2015-10-16T01:42:02.754+03:00", "highlightTitle": ""}