{"organizations": ["Naples Europe Saints"], "uuid": "56e4bd3dbfb7d4b2e17777b1c0065ccf843aeca0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stripes.com", "main_image": "http://www.stripes.com/polopoly_fs/1.373823.1445107814!/image/image.JPG_gen/derivatives/landscape_490/image.JPG", "site_section": "http://feeds.stripes.com/starsandstripes/sports#", "section_title": "Stars and Stripes Sports", "url": "http://www.stripes.com/sports/europe/saints-go-marching-into-playoffs-by-holding-off-naples-1.373821", "country": "US", "title": "Saints go marching into playoffs by holding off Naples", "performance_score": 0, "site": "stripes.com", "participants_count": 0, "title_full": "Saints go marching into playoffs by holding off Naples", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T03:56:00.000+03:00", "replies_count": 0, "uuid": "56e4bd3dbfb7d4b2e17777b1c0065ccf843aeca0"}, "author": "", "url": "http://www.stripes.com/sports/europe/saints-go-marching-into-playoffs-by-holding-off-naples-1.373821", "ord_in_thread": 0, "title": "Saints go marching into playoffs by holding off Naples", "locations": ["Naples", "Naples Aviano", "Italy"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Darius Brown", "Jason Duhr/Stars", "Roers", "Hayden Roers"], "text": "Europe Saints go marching into playoffs by holding off Naples Aviano quarter back Hayden Roers makes a break for an opening during Saturday's football game at Aviano Air Base. Roers carried the ball 17 times for 77 yards. Jason Duhr/Stars and Stripes Aviano's Darius Brown attempts to break the hold of Naples' Christopher Green during Saturday's football game at Aviano Air Base, Italy. Aviano beat Naples 21-14. Jason Duhr/Stars and Stripes Naples page \nAVIANO AIR BASE, Italy – The Aviano Saints earned a spot in the playoffs Saturday by defeating Naples, 21-14. \nThe win didn’t come easily for the Saints as the Wildcats arrived determined to pull off their first win of the season. \n“We knew it was going to be a battle,” said Aviano coach Rick Dahlstrom, whose team will travel to face No. 3 Bitburg next weekend. “Naples is a very good team, but we got off to a fast start and they started coming back, but the kids just hung in there.” \nA final drive by Naples to try to tie or win the contest came up about a dozen yards short. \nRunning back Christopher Green was hit by Aviano’s Hayden Roers causing Green to lose the ball, which was recovered by the Saints’ Darius Brown. \n“It was the right play call, he (Green) broke it and busted through, like he had been doing all day,” Naples coach Mark Tyler said. “He scored two touchdowns for us already and was trying to make something else happen.” \nThe Wildcats were down 21-7 heading into the second half, with Green tallying the Naples touchdown from 16 yards out in the second quarter. \nGreen scored again on a 30-yard run in the third quarter as the Wildcats staged a comeback. \nGreen carried the ball 18 times for the Wildcats, accumulating 164 yards throughout the game. \n“He’s elusive,” Dahlstrom said. “So it was hard to tackle him, but I think the kids played him well, because he was in our game plan.” \nThe Naples’ defense managed to shut out the Saints in the second half, only allowing them to gain a few yards at a time on their final drives, but every play kept the clock ticking. \n“They were so much bigger than us it was harder to move them,” Dahlstrom said. “When you can’t move people on the line of scrimmage you lose that battle.” \nAviano had 13 carries in the fourth quarter and the Wildcats held the Saints to minimal yardage in most of those carries. \n“Their number 60 (Adriane Hines) played a fantastic game,” Dahlstrom said. “He was all over the field making tackles, and was hard to defend.” \nAviano running back Manny Gamboa, a converted guard, put Aviano’s first two touchdowns on the scoreboard in the first half, each capping multiple-carry drives. \n“Today, Manny Gamboa became a running back,” Dahlstrom said. “He was finding the holes and making the cuts.” \nGamboa ran for 127 yards on 21 carries. \nAviano’s Aaron Island received a kickoff and ran it back for more than 50 yards for a touchdown. \nThe Wildcats completed nine of 17 passing attempts, moving the ball 83 yards down the field, but giving up two interceptions in the process. Roers and Jimmie Montgomerie each intercepted a pass for Aviano and Naples' Sebastian Staten had one as well. \n“Two turnovers in the first half was important,” Tyler said. \nAviano quarterback Roers only passed for 5 yards, but fared better at running the ball, carrying it 17 times for 77 yards. His counterpart, Naples’ Javonte West, gained 60 on the ground. \n“Naples is a very physical, well-coached team,” Dahlstrom said. “They had a tough schedule and they’re young, but hats off to them – they came to play.”", "external_links": [], "published": "2015-10-18T03:56:00.000+03:00", "crawled": "2015-10-18T20:15:05.092+03:00", "highlightTitle": ""}