{"organizations": [], "uuid": "c7a7c550b161befcf6573ccf0cacb2b18ce36695", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.miamiherald.com", "main_image": "http://www.miamiherald.com/news/state/florida/naxklu/picture37452627/ALTERNATES/LANDSCAPE_1140/erica2%20presser%20lnew%20cmg", "site_section": "http://www.miamiherald.com/?widgetName=rssfeed&widgetContentId=712015&getXmlFeed=true", "section_title": "Breaking News, Sports, Weather & More | MiamiHerald.com &", "url": "http://www.miamiherald.com/news/state/florida/article37407942.html", "country": "US", "title": "Firm says Gov. Scott’s stake in pipeline project is ‘irrelevant’", "performance_score": 0, "site": "miamiherald.com", "participants_count": 1, "title_full": "Firm says Gov. Scott’s stake in pipeline project is ‘irrelevant’", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T02:41:00.000+03:00", "replies_count": 0, "uuid": "c7a7c550b161befcf6573ccf0cacb2b18ce36695"}, "author": "Dan Christensen \nFloridaBulldog.org", "url": "http://www.miamiherald.com/news/state/florida/article37407942.html", "ord_in_thread": 0, "title": "Firm says Gov. Scott’s stake in pipeline project is ‘irrelevant’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Firm says Gov. Scott’s stake in pipeline project is ‘irrelevant’ \nEnvironmental groups seek to block $3 billion project \nCoalition seeks all correspondences from Scott, his office \nStaff says governor’s blind trust shields him from conflict Florida Governor Rick Scott C.M. GUERRERO EL NUEVO HERALD i Order Reprint of this Story \nLawyers for a company that wants to build a natural gas pipeline in North Florida have told a judge that environmental opponents should be blocked from “presenting evidence or argument” about Gov. Rick Scott’s financial interest in the company. \n“Such evidence is irrelevant and the admission of which would be unfairly prejudicial,” attorneys for Sabal Trail Transmission, LLC told Administrative Law Judge Bram D.E. Canter in last week’s filing. \nThe Florida Department of Environmental Protection (DEP), which is backing the $3 billion Sabal Trail pipeline, filed a similar argument earlier this month when it called the “allegation regarding a conflict of interest … not material to this proceeding.” \nSabal Trail is a joint venture of Spectra Energy Partners and Florida Power & Light parent NextEra Energy. Spectra Energy’s investors have included Scott. \nThe nonprofit WWALS Watershed Coalition filed for an administrative hearing on Sept. 3 after state regulators said they intended to award Sabal Trail both a permit and rights to drill under riverbeds in order to build the 267-mile stretch of 36-inch underground pipeline in Florida. The nonprofit has asked the judge to deny the permit. \nAmong the documents WWALS has asked the DEP to produce are all communications from Scott or his executive office about the Sabal Trail project since the governor took office. \nThe case is proceeding quickly. On Sept. 21, Sabal Trail’s attorneys at the Tallahassee law firm Hopping Green & Sams invoked a law that Scott signed in May 2013 that speeds up the permitting process for the construction of interstate natural gas pipelines. \nUnder the law, challenges to new pipelines must be heard within 30 days “regardless of whether the parties agree to the summary proceedings.” Before Scott signed the law, natural gas pipelines were specifically excluded from consideration for expedited review. \nThe bill (HB 999) that ultimately amended the law to include expedited review for natural gas pipelines was introduced by then State Rep. Jimmy Patronis, R-Pensacola. and was overwhelmingly passed by the Legislature. Last October, Republican Scott appointed the term-limited Patronis to Florida’s Public Service Commission. Hearing next month \nJudge Canter has set a hearing on Sabal Trail, which is to run a total of 474 miles from Alabama and Georgia to a hub south of Orlando, for Oct. 19-22 in either Jasper or Live Oak. \nThe issuance of a Florida environmental resources permit would be a key step toward construction of the pipeline. But it is not the only remaining hurdle. \nThe Federal Energy Regulatory Commission is the lead federal agency responsible for reviewing the Sabal Trail proposal and preparing an environmental impact statement. FERC’s decision is expected by the end of the year. \nWWALS’s petition contends the pipeline poses threats to native wildlife, including threatened species, and argues that proposed drilling into the area’s karst limestone to lay pipe could cause new sinkholes to form. \nThe group, an affiliate of the Waterkeeper Alliance, also raises a potentially explosive political issue: Whether Gov. Scott, as a trustee of the state board that owns the land beneath the rivers, has a conflict of interest because of his investments in Spectra Energy and Williams Company, owner of the Transco pipeline from which Sabal Trail plans to obtain its gas. \n“The governor and other public officials are prohibited by state ethics laws from owning stock in businesses subject to their regulation or that do business with state agencies,” the group’s petition says. \nThe governor’s blind trust is supposed to shield him, and the public, from conflicts of interest by putting his investments under the control of an independent trustee, and keeping them secret. Public officers who put their assets in a qualified blind trust receive immunity from prohibited conflicts of interest. \nAs FloridaBulldog.org has reported, however, Scott’s trustee is Hollow Brook Wealth Management, run by his longtime business crony Alan Baazar . The blind trust also has proved ineffective in preventing public disclosure of Scott’s assets. \nMoreover, Florida’s qualified blind trust law, which Scott signed into law in May 2013, does not contemplate the unique situation that has transpired as Scott has used the law. Big investment \nScott created his original blind trust in 2011. Last year, while qualifying to run for reelection, he dissolved that trust, disclosed a lengthy list of his assets, opened a new blind trust and immediately stashed his assets into it. \nThe asset list revealed that during Scott’s first term the governor acquired substantial investments in the natural gas industry. His holdings, first reported by FloridaBulldog.org in July 2014 , included stock in Spectra Energy, majority owner of Sabal Trail Transmission; Williams and more than two dozen other entities that produce and/or transport natural gas, including some with substantial Florida operations. \nScott’s investments in Spectra and Williams also gave him a financial interest in the Gulfstream pipeline that runs from Alabama to Tampa Bay under the Gulf of Mexico. Those companies and their limited partnerships jointly own and operate Palmetto-based Gulfstream Natural Gas System, LLC. \nScott, too, reported owning a bigger stake in Energy Transfer, the publicly traded master limited partnership whose subsidiaries include a joint venture that owns Florida Gas Transmission, Florida’s other major natural gas pipeline that runs from Texas through the Florida peninsula to Miami-Dade. \nScott also has invested in Boardwalk Pipeline Partners, a master limited partnership that wholly owns Gulf South Pipeline Co. Gulf South operates pipelines in Florida’s Panhandle. \nScott has declined to be interviewed about the matter, but his staff has said the governor has no conflicts because he has no knowledge of the current contents of the blind trust that are under the control of trustee Hollow Brook Wealth Management and Alan Baazar. Related content", "external_links": [], "published": "2015-10-03T02:41:00.000+03:00", "crawled": "2015-10-03T22:06:17.423+03:00", "highlightTitle": ""}