{"organizations": [], "uuid": "9ee9a4f30b9a29d4f79f2276ec8f703f6922573e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "", "site_section": "http://bostonherald.com/sports/college", "section_title": "Sports: College | Boston Herald", "url": "http://bostonherald.com/sports/college/college_football/2015/10/coach_fisher_likes_progress_of_no_11_seminoles_defense", "country": "US", "title": "Coach Fisher likes progress of No. 11 Seminoles' defense", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "Coach Fisher likes progress of No. 11 Seminoles' defense | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "9ee9a4f30b9a29d4f79f2276ec8f703f6922573e"}, "author": "Associated Press", "url": "http://bostonherald.com/sports/college/college_football/2015/10/coach_fisher_likes_progress_of_no_11_seminoles_defense", "ord_in_thread": 0, "title": "Coach Fisher likes progress of No. 11 Seminoles' defense", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "TALLAHASSEE, Fla. — While Florida State has been giving up yards and first downs its last two Atlantic Coast Conference games, the 11th-ranked Seminoles are still stingy when it comes to points.\nThe Seminoles (5-0, 3-0 ACC) began their preparation Monday for Louisville with an eye on solidifying a defense that has surrendered 783 yards and 46 first downs in wins over Miami and Wake Forest the last two weeks.\n\"We've still got a lot to work on,\" senior defensive end Giorgio Newberry said. \"Keep practicing and working and getting better.\"\nAnd his coach believes the improvement has been notable.\n\"There's no alarm,\" Jimbo Fisher said. \"I like what we are doing.\"\nMiami's 24 points in its loss Saturday was the most allowed by the Seminoles, who have allowed opponents an average of 14 points a game.\n\"We're again evolving into the kind of team we need to be,\" Fisher said. \"I've been pleased, but not satisfied.\"\nThe Seminoles have 10 sacks at this point compared to 17 all season a year ago and just three interceptions, but Fisher noted the defense has broken up passes (18) in addition to quarterback hurries (15).\nFlorida State defensive tackle Demarcus Walker was a force against Miami and Monday was named the ACC defensive player of the week. The 281-pound junior had a pair of sacks, forced a fumble and batted won a pass attempt.\nFisher said the young Seminole defense (three seniors in the starting unit) is right on schedule in its progression and will be faced with its toughest challenge to date in Louisville. The Cardinals come into the contest averaging 27.4 points and 388 yards a game while allowing 20.2 points and 323.8 yards overall.\n\"You watch the film ... you see a 5-0 team,\" Fisher said in reference to Louisville (2-3, 1-1 ACC). \"They have three losses but all of those have come right down to the wire.\"\nLouisville's three losses are all to teams that are or were ranked — Auburn, Clemson and Houston — and by a total of 13 points.\nWhile outlining the Louisville talent, Fisher left little doubt he thinks the Seminoles are about to meet their toughest opponent personnel wise on Saturday.\nThe Seminoles are 13-2 over the years against the Cardinals with their lone home loss in the relative short series coming in 1952 when a young Johnny Unitas completed 16 of 21 passes for 198 yards and three touchdowns to spark a 41-14 Louisville victory.\nFlorida State rallied from a 21-0 deficit a year ago in Louisville in a 42-31 win.\nThe Seminoles will be looking for their 28th consecutive ACC win which would put them one shy of the school record set in the early 1990s. If they get it, sophomore tailback Dalvin Cook will likely play a role. He was named the league's top offensive player of the week on Monday after his 222-yard, two touchdown rushing performance against the Hurricanes.", "external_links": [], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T14:34:19.226+03:00", "highlightTitle": ""}