{"organizations": [], "uuid": "c7f311dcd08e29e271c7077aa2f04e9e01dec922", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/47529300.cms", "site_section": "http://timesofindia.indiatimes.com/rssfeeds/4720867.cms", "section_title": "Top Stories - Golf - Sports - The Times of India", "url": "http://timesofindia.indiatimes.com/sports/golf/top-stories/McIlroy-nearly-struck-by-fellow-competitors-drive/articleshow/49438586.cms", "country": "IL", "title": "McIlroy nearly struck by fellow competitor's drive", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "McIlroy nearly struck by fellow competitor's drive - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T15:18:00.000+03:00", "replies_count": 0, "uuid": "c7f311dcd08e29e271c7077aa2f04e9e01dec922"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/sports/golf/top-stories/McIlroy-nearly-struck-by-fellow-competitors-drive/articleshow/49438586.cms", "ord_in_thread": 0, "title": "McIlroy nearly struck by fellow competitor's drive", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "World number three Rory McIlroy narrowly escaped a possible injury during the third round at the Frys.com Open in California on Saturday. \n\nThe Northern Irishman had just played a chip shot from next to the green at the driveable par-four 17th when he was nearly struck by the tee shot of big-hitting Emiliano Grillo, of Argentina. \n\nGrillo's drive landed only a couple of feet from a surprised McIlroy, who clearly received no warning that he was in danger of being hit. \n\nMcIlroy's playing competitor Kyle Reifers, who was standing next to McIlroy, raised his hands angrily after he was also almost struck. \n\n\"I just can't imagine what Grillo was thinking back there on the tee,\" said Golf Channel commentator Peter Jacobsen, a former tour winner. \n\nMcIlroy composed himself and responded by draining a 10-footer to save par. \n\n\"It hit between the two of us, probably a foot from both of us,\" Reifers told Golf Channel. \n\nGrillo told the broadcasters that no officials had been on the tee at the 296-yard hole, which requires a blind drive, and that his threesome had made a group decision to hit. The green is blocked from view from the tee by a clump of pine trees. \n\nFour-times major champion McIlroy returned to action just two months ago after missing the British Open with a ruptured left ankle ligament he suffered playing soccer. \n\nMcIlroy shot 71 and was out of contention on six-under 210 at the Silverado Resort in Napa in the opening event of the 2015-16 PGA Tour season. Stay updated on the go with Times of India News App. Click here to download it for your device.", "external_links": [], "published": "2015-10-18T15:18:00.000+03:00", "crawled": "2015-10-19T05:30:01.521+03:00", "highlightTitle": ""}