{"organizations": [], "uuid": "8cdd4800df2079d9358a65b8c75588ee3e11f1f2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "nypost.com", "main_image": "https://thenypost.files.wordpress.com/2015/10/torts.jpg", "site_section": "http://nypost.com/sports/feed/", "section_title": "| Sports | New York Post", "url": "http://nypost.com/2015/10/21/john-tortorella-to-coach-be-angry-about-the-blue-jackets/", "country": "", "title": "John Tortorella to coach, be angry about the Blue Jackets", "performance_score": 0, "site": "nypost.com", "participants_count": 1, "title_full": "John Tortorella to coach, be angry about the Blue Jackets | New York Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T12:32:00.000+03:00", "replies_count": 0, "uuid": "8cdd4800df2079d9358a65b8c75588ee3e11f1f2"}, "author": "Jonathan Lehman", "url": "http://nypost.com/2015/10/21/john-tortorella-to-coach-be-angry-about-the-blue-jackets/", "ord_in_thread": 0, "title": "John Tortorella to coach, be angry about the Blue Jackets", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "John Tortorella is back.\nThe tempestuous former Rangers boss was installed Wednesday as the new coach of the Columbus Blue Jackets following the firing of Todd Richards.\nTortorella is tasked with reforming the Blue Jackets after a horrendous 0-7-0 start under Richards in which they scored 13 goals and conceded 34.\nThe 57-year-old Tortorella is the NHL’s winningest U.S.-born coach with a 446-375-115 record over 14 seasons, including a Stanley Cup with the Tampa Bay Lightning in 2004.\nHe has been out of hockey since the Canucks fired him in May 2014 after one season in Vancouver.\nTortorella acknowledged spending the past year soul-searching to determine what he might have done differently in Vancouver. It was a season in which a second-half collapse led to the Canucks missing the playoffs three years after reaching the Stanley Cup final.\n“I have searched and looked at situations of what I could’ve done a better job there, and I do have some answers with that,” he said. “So sure, I think you become a better coach when you dig deep.”\nTortorella signed a three-year contract and will make his debut Thursday when Columbus visits Minnesota.\n“John Tortorella is an experienced National Hockey League coach with a proven track record of success,” general manager Jarmo Kekalainen said in statement released by the team. “He is a Stanley Cup winner, and we believe the right person to lead our team at this time.”\nThe Blue Jackets restocked their roster this summer after closing last season on 16-2-1 run.\n“None of us saw our season unfolding the way it has. And every one of us from management to coaches to players bears responsibility,” Kekalainen said. “There is still a lot of hockey to be played and we believe this change was necessary to give our team the best chance to accomplish the goals we’ve set for this season.”\nBrandon Dubinsky, a longtime resident of Tortorella’s doghouse in New York, is the Blue Jackets’ alternate captain.\nWith AP \n  brandon dubinsky ,  columbus blue jackets ,  john tortorella ,  new york rangers ,  nhl", "external_links": [], "published": "2015-10-21T12:32:00.000+03:00", "crawled": "2015-10-21T20:01:24.922+03:00", "highlightTitle": ""}