{"organizations": ["Edmonton Oilers fan Oilers"], "uuid": "19b8af11bdddb2250be578df35f1fee38dba79d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.edmontonsun.com", "main_image": "http://storage.edmontonsun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297755008109_LARGE_BOX.jpg?quality=80&stmp=1443675969387&size=100x", "site_section": "http://www.edmontonsun.com/sports/rss.xml", "section_title": "Top Sports stories", "url": "http://www.edmontonsun.com/2015/09/30/jordan-eberle-injury-not-the-panic-for-edmonton-oilers-fan", "country": "CA", "title": "Jordan Eberle injury not the panic for Edmonton Oilers fan", "performance_score": 0, "site": "edmontonsun.com", "participants_count": 0, "title_full": "Jordan Eberle injury not the panic for Edmonton Oilers fan", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T04:18:00.000+03:00", "replies_count": 0, "uuid": "19b8af11bdddb2250be578df35f1fee38dba79d2"}, "author": "", "url": "http://www.edmontonsun.com/2015/09/30/jordan-eberle-injury-not-the-panic-for-edmonton-oilers-fan", "ord_in_thread": 0, "title": "Jordan Eberle injury not the panic for Edmonton Oilers fan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jordan Eberle"], "text": "Oilers \nIt was the day that defined the difference between this year’s Edmonton Oilers and the stuck-in-the-cellar editions of the franchise that preceded it. \nJordan Eberle, the team’s leading scorer in three of the last five seasons left the game against the Arizona Coyotes with a shoulder injury the night before. Wednesday morning the Oilers announced Eberle would be out somewhere between Halloween and the Grey Cup. \nIf this had happened last year, the whole town would have fallen into a rut the size of the Panama Canal. \nThat’s it! The season has been sewered before it’s started! The end is opening night! \nWith five of the team’s first six games on the road, there’s going to be a little angst for starters built in, considering the way it started for the Oilers last year. But maybe you noticed. The population handled the first semi-major injury of Eberle’s career with no real reduction in the mood and attitude of excitement and optimism going forward. \nIf this were last year, Edmonton would be contemplating the possibility of Will Acton moving up in the lineup to replace him. \nThere was no joy in Mudville Wednesday with the news but Oilers fans weren’t experiencing massive depression. \nFor the first time in eons the Oilers have depth to deal with an injury to a top six forward. And while the preference would obviously be to have Eberle’s near point-per-game production in the lineup, the unfortunate injury likely provides an extended audition for Leon Draisaitl and Anton Slepyshev, if they hadn’t already earned their positions on the team to start the season. \nThe Eberle injury was only the half of it on the defining day of the turning-point season in Oilers history. \nIt was also announced Wednesday that Darnell Nurse had been sent to the Oilers new AHL farm team, the Bakersfield Condors. \nThis one you could see coming. The Oilers telegraphed the intention to send their No. 7 pick in the 2013 draft for extended development in the organization. \nThe first hint was when Nurse didn’t have an NHL-calibre defensive partner to begin proceedings at three-day training camp session in Leduc. \nThe second came when new head coach Todd McLellan broke his team into Group A (Edmonton) and Group B (Bakersfield) early. Nurse was in Group B. \nIf you needed a third hint it came Tuesday when somebody asked a general question of McLellan that wasn’t dealing specifically with Nurse. \n“In an ideal world, in a perfect world, all players would get overripe in the American League. They would feel really good about their roles and be itching, almost complaining, to get to the NHL. \n“Everybody is in a hurry. The coaches are in a hurry to get to the NHL. The players are in a hurry to get to the NHL. Sometimes you have to slow some things down.” \nThe Oilers have been a long, long, long way from a perfect world until this year. Now they can come closer to following the Detroit model. They can afford to wait. \nThey didn’t do that with most of their top young talent. It’s tougher to develop in the big top. But how do you send them to the farm when they’re one of your very best players walking in the door and the fan base wants to watch them play? \nAnton Lander and Oscar Klefbom are excellent examples. \nLander was virtually wrecked by a confidence-killing coach who used him all wrong in the NHL when he should have been developing into the player who has five goals this pre-season, one more than the entire Arizona Coyotes team. \nIf it weren’t for the absolute idiocy of putting Lander on the waiver wire to keep Will Acton, he wouldn’t have had the AHL time that made the difference when he came up to play for his old Oklahoma City coach Todd Nelson when Dallas Eakins got fired. \nWhile the defence was a disaster, Klefbom got ripe enough in Oak City to handle it when the time came. Now he has a new seven-year extension. \nInstead of crying for the Oilers to keep Nurse, most of the fan base is good with this move. Nurse will be back when he’s further developed, has a greater appreciation for being in the NHL. There’s not much question he’s going to have a long career here and be part of a team when he gets here (months not years) that has a fantastic future ahead. \nThat’s decidedly the difference in the Edmonton Oilers today and the Edmonton Oilers yesterday. \nFollow me on Twitter.com/sunterryjones By Terry Jones , Edmonton Sun First posted: Wednesday, September 30, 2015 07:05 PM MDT | Updated: Wednesday, September 30, 2015 07:18 PM MDT \nIt was the day that defined the difference between this year’s Edmonton Oilers and the stuck-in-the-cellar editions of the franchise that preceded it. \nJordan Eberle, the team’s leading scorer in three of the last five seasons left the game against the Arizona Coyotes with a shoulder injury the night before. Wednesday morning the Oilers announced Eberle would be out somewhere between Halloween and the Grey Cup. \nIf this had happened last year, the whole town would have fallen into a rut the size of the Panama Canal. \nThat’s it! The season has been sewered before it’s started! The end is opening night! \nWith five of the team’s first six games on the road, there’s going to be a little angst for starters built in, considering the way it started for the Oilers last year. But maybe you noticed. The population handled the first semi-major injury of Eberle’s career with no real reduction in the mood and attitude of excitement and optimism going forward. \nIf this we", "external_links": [], "published": "2015-10-01T04:18:00.000+03:00", "crawled": "2015-10-01T10:25:18.410+03:00", "highlightTitle": ""}