{"organizations": [], "uuid": "2d3858cb83b71a78ec3ecdc9101ee9857d161e41", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/b5f641cf8f88d646a4f77d308f3ed570.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/rugby/david-humphreys-ireland-lock-iain-henderson-can-be-one-of-w/6905935/", "country": "JE", "title": "David Humphreys: Ireland lock Iain Henderson can be one of world's best", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "David Humphreys: Ireland lock Iain Henderson can be one of world's best", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T17:01:00.000+03:00", "replies_count": 0, "uuid": "2d3858cb83b71a78ec3ecdc9101ee9857d161e41"}, "author": "", "url": "http://www.sport.co.uk/rugby/david-humphreys-ireland-lock-iain-henderson-can-be-one-of-w/6905935/", "ord_in_thread": 0, "title": "David Humphreys: Ireland lock Iain Henderson can be one of world's best", "locations": ["Ireland"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Iain Henderson", "David Humphreys"], "text": "David Humphreys: Ireland lock Iain Henderson can be one of world's best 08 Oct 2015 14:01:56 \ncomments \nIain Henderson will be one of the stars of the World Cup, according to his former Ulster boss David Humphreys. \nFormer Ireland fly-half Humphreys backed Ulster powerhouse lock Henderson to gain world superstar status now he has fought his way into Joe Schmidt's starting line-up. \nGloucester rugby director Humphreys brought Henderson through at Ulster, and hailed the 23-year-old's World Cup impact as Ireland have secured their place in the quarter-finals. \n\"Iain Henderson has the potential to be one of the best players in the world,\" Humphreys told Press Association Sport. \n\"I still remember the first day he turned up at Ulster training, the first day I met him. \n\" You certainly wouldn't have identified him then at that point as someone who had that ability. \n\"We knew the physical attributes he had, but there's so much more to becoming a professional rugby player. \n\"He's one of those players who has come into the professional environment and has thrived. \n\"He's met every challenge, trains hard, prepares well and the one thing is, does he understand how good he can be? \n\"I'm delighted to see the way he has progressed, his impact for Ireland over the last two weeks has made him one of the first names on the team-sheet now. \n\"He has the potential to be one of the stand-out performers at this World Cup, particularly if Ireland are successful.\" \nIreland ground to 16-9 victory over Italy at London's Olympic Stadium last week, to secure their last-eight berth. \nIf the beat France in Cardiff on Sunday, head coach Schmidt's men will top Pool D, line up Argentina in the quarter-finals and avoid the All Blacks' half of the draw. \nHumphreys backed Henderson to extend his fine tournament form, now he has become a serious rival to Devin Toner's claims to partner captain Paul O'Connell at lock. \n\"For some players they take time to take stock of how much they can achieve, but every step up a level for Iain he has performed at his very best,\" said Humphreys. \n\"I do think that every time he has met a challenge he has achieved it. \n\"But now he's got to find that belief in himself that he produces performances week in and week out and becomes a real leader, that's the measure of a top player. \n\"He's got to be a leader for Ulster and Ireland, but it's that ability to play at the very top level, whether he's away with Ulster at Zebre, or for the British and Irish Lions away in New Zealand. \n\"Once he understands that I have no doubt that he will be a star for Ireland for many years to come.\" \nFrance have spent the week trying to unnerve Ireland's linchpin fly-half Johnny Sexton, pledging to target him physically at the Millennium Stadium. \nThe French have tried the same tactic despite losing their last two matches with Ireland, and Humphreys believes Sexton will remain unfazed amid the onslaught. \n\"It will be water off a duck's back for him,\" said Humphreys. \n\"There's a lot of mind games, media battles, it's part of the PR war that goes on. \n\"Everybody understands how important Johnny Sexton is to Ireland, how important Johnny Sexton performing at his best is for Ireland. \n\"And France, if they let Johnny play well Ireland will win the game. \n\"So they'll try every trick to upset him, but the player he is, the person that he is, I have no doubt he'll be outstanding this weekend. \n\"He knows a lot of these guys, the character he is, how competitive he is, none of that will change his mindset. \n\"Ireland are playing their first mini knockout game of the tournament. \n\"He'll be well prepared and I've no doubt he'll perform well.\" Related Sport News", "external_links": [], "published": "2015-10-08T17:01:00.000+03:00", "crawled": "2015-10-08T19:53:08.938+03:00", "highlightTitle": ""}