{"organizations": [], "uuid": "0f9e2247596322293d21caafcd2a252b8b01b293", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.boston.com", "main_image": "http://p.o0bc.com/rf/image_1920x1190/Boston/2011-2020/2014/06/05/Boston.com/Arts/Images/2014-05-02T063653Z_704132443_GM1EA52141M01_RTRMADP_3_USA.jpg", "site_section": "http://www.boston.com/", "section_title": "Boston, MA news, breaking news, sports, video | Boston.com", "url": "http://www.boston.com/entertainment/tv/2015/10/20/two-local-chefs-will-rep-boston-new-top-chef-season/ldp22LmeY18nikF9cD4sMJ/story.html", "country": "", "title": "Two local chefs will rep Boston in new Top Chef season - Television", "performance_score": 0, "site": "boston.com", "participants_count": 1, "title_full": "Two local chefs will rep Boston in new Top Chef season - Television", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "0f9e2247596322293d21caafcd2a252b8b01b293"}, "author": "boston.com", "url": "http://www.boston.com/entertainment/tv/2015/10/20/two-local-chefs-will-rep-boston-new-top-chef-season/ldp22LmeY18nikF9cD4sMJ/story.html", "ord_in_thread": 0, "title": "Two local chefs will rep Boston in new Top Chef season - Television", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Top Chef travels around the country, finding new cooks and filming in a new city every season. Last year, the TV series filmed in Boston, and though the show has relocated to California for its 13th season, the Hub is still repping in the culinary competition. Bravo announced that two Boston chefs—Karen Akunowicz of Meyers + Chang and Carl Dooley, previously of Craigie on Main— will be in the Top Chef running this time around.\nSeason 13, which premiers December 2, takes the cheftestants through a whirlwind six-city Californian road trip, stopping in Los Angeles, San Francisco, San Diego, Santa Barbara, Oakland, and the Greater Palm Springs area.\nAkunowicz and Dooley — who is opening a new restaurant called The Table in Cambridge early next year, according to his bio on the Top Chef website — will cook to compete for $125,000 furnished by San Pellegrino, a feature in Food & Wine magazine, and a showcase at the annual Food & Wine Classic in Aspen, Colorado.\nAdvertisement - Continue Reading Below Though originally from New Jersey, Akunowicz has called Boston home for over a decade. She’s a graduate of the Cambridge School of Culinary Arts and UMass Amherst. Akunowicz is a 2015 James Beard Nominee for Best Chef Northeast.\nDooley, in true New England fashion, got his start at age 16 at a lobster shack in Maine, but went to high school in Cambridge. He attended the New England Culinary Institute and finished abroad. Once back in the States, Dooley worked under Chef Tony Maws (whom he considers a mentor) at Craigie Street Bistro. Dooley is leaving Maws’s side at Craigie on Main to open The Table, which is affiliated with and located at the Season to Taste Catering headquarters in North Cambridge.\nHost Padma Lakshmi and head judge Tom Colicchio are back, with veteran judges Gail Simmons, Richard Blais, and Emeril Lagasse joining for Season 13 of Top Chef . Guests include MC Hammer and model Chrissy Teigen, according to Bravo.\nEater Boston reports that one challenge will be inspired by @ChefJacquesLaMerde , a parody Instagram personality that beautifully — and enthusiastically — plates dishes like “TATER TOTS, PEPPERONI MAYONNAISE, KETCHUP CAVIAR, PRE-GRATED PARMESAN AND PETALS MADE FROM SOME YELLOW FLOWERS BUT ALSO JUST MADE FROM MORE PEPPERONIS!!!!”", "external_links": ["http://boston.eater.com/2015/10/19/9569457/top-chef-13-karen-akunowicz-carl-dooley", "http://www.bravotv.com/people/carl-dooley", "https://instagram.com/p/8oKxJ_G-YT/?taken-by=chefjacqueslamerde", "http://www.bravotv.com/top-chef/videos/playlist?clip=2915634", "https://instagram.com/chefjacqueslamerde/", "https://www.starchefs.com/cook/events/2015/rising-stars/boston/carl-dooley", "http://www.bravotv.com/the-daily-dish/top-chef-season-13-chrissy-teigen-mc-hammer?cid=soc_dg_fb_TopChef"], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-20T20:06:49.801+03:00", "highlightTitle": ""}