{"organizations": ["Dodgers", "Mets", "Padres"], "uuid": "c127f002c0154cf55f3a4bfaab7f5a5fae77d23d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribtown.com", "main_image": "http://d1bdhkmqqz901h.cloudfront.net/1200x630/smart/s3.amazonaws.com/hne-smedia/d/e/de406b7a3bb144b18546d32699f0b1ec/web_full_222284807020.jpg", "site_section": "http://www.tribtown.com//feed/sec/6000", "section_title": "TribTown.com - Sports News", "url": "http://www.tribtown.com/view/story/de406b7a3bb144b18546d32699f0b1ec/BBN--Padres-Dodgers", "country": "US", "title": "Dodgers beat Padres 6-2 to gain half-game on Mets for home-field advantage in playoffs", "performance_score": 0, "site": "tribtown.com", "participants_count": 0, "title_full": "Dodgers beat Padres 6-2 to gain half-game on Mets for home-field advantage in playoffs", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T08:36:00.000+03:00", "replies_count": 0, "uuid": "c127f002c0154cf55f3a4bfaab7f5a5fae77d23d"}, "author": "", "url": "http://www.tribtown.com/view/story/de406b7a3bb144b18546d32699f0b1ec/BBN--Padres-Dodgers", "ord_in_thread": 0, "title": "Dodgers beat Padres 6-2 to gain half-game on Mets for home-field advantage in playoffs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["BETH HARRIS"], "text": "Dodgers beat Padres 6-2 to gain half-game on Mets for home-field advantage in playoffs By BETH HARRIS AP Sports Writer   1:36   1:36   \nPeople: \nClick to view (6 Photos) \nLOS ANGELES — There's something about Dodger Stadium that makes Alex Wood pitch especially well. \nHe earned his career-high 12th victory, and the Los Angeles Dodgers beat the San Diego Padres 6-2 Friday night to take a half-game lead over the Mets for home-field advantage in their upcoming playoff series. \n\"I've always enjoyed pitching here,\" said Wood, who was acquired from the Braves on July 30. \nWood (12-12) allowed two runs and five hits in seven innings, struck out four and walked one. He finished 3-2 with a 2.41 ERA in five home starts. The left-hander set career highs in starts (32) and innings (189 2/3) this season. \n\"It seemed like he was ahead in the count and kept the ball down,\" Dodgers manager Don Mattingly said. \nThe Dodgers improved to 90-70 — their third straight season with as many wins — after the Mets (89-70) got rained out earlier. New York, however, holds the tiebreaker because it won the season series. The teams will meet in the NL Division Series starting next Friday. \n\"We just want to win,\" Mattingly said. \"We can only control that part of it.\" \nLos Angeles reached the 90-win mark for third straight year for just the second time in franchise history, joining the 1976-78 and 1951-56 teams. Their 53 home wins are tied for third-best in stadium history. \n\"We're playing for home field. I think it's a fairly big deal,\" Wood said. \"It's go time. Guys are getting their last at-bats for a week.\" \nCorey Seager's two-run single highlighted a five-run third inning for the Dodgers. \nCasey Kelly (0-2) gave up three straight one-out singles in the third. Adrian Gonzalez's RBI single scored their first run and Justin Turner followed with a grounder for another run. \nSeager's two-run single made it 4-0 and A.J. Ellis' RBI single completed the burst. \nTurner's RBI single in the fifth extended the Dodgers' lead to 6-0. \nSan Diego scored twice in the seventh on Alexi Amarista's groundout and Cody Decker's sacrifice fly. \nKelly gave up six runs — three earned — and eight hits in 4 1-3 innings in his second start of the season after missing most of the last two years while recovering from Tommy John surgery. The right-hander struck out three and walked two. \n\"It just feels great just to get back on the mound at this level and still know that I can do it,\" Kelly said. \"I've been dealing with a lot of inconsistency, so I was happy just to get my feet wet and get ready for next year.\" \nTRAINER'S ROOM \nPadres: OF Justin Upton, who has a neck strain, isn't able to swing a bat, so he would be limited to pinch running or playing his position for a couple of innings in the last two games. \nDodgers: OF Yasiel Puig, on the DL with a strained right hamstring, will rejoin the team this weekend after running and playing in the field the last two days in Arizona. \nHOT HOWIE \nKendrick went 2 for 4 with a double and two runs scored while hitting safely for the eighth time in 11 games since returning from the DL on Sept. 19. He is 12 for 42 with two doubles and five RBI since being activated. \nSHIELDS SHUT DOWN \nJames Shields won't make his scheduled start Sunday in the Padres' final game. Instead, the team will rely on its bullpen and had yet to name a starter Friday, when Shields talked to manager Pat Murphy about it. \"The organization thinks it's best to get a better look at our bullpen pieces and use that game like a lot of teams use that game, to find out more and more about the young players,\" Murphy said. \nUP NEXT \nPadres: Robbie Erlin (1-1, 6.30 ERA) gave up four runs and four hits in 1 2-3 innings of last weekend's loss to San Francisco. \nDodgers: Zack Greinke (18-3, 1.68) has won his last seven home starts with a 1.07 ERA in that span, and continues to lead the majors in ERA. He is 5-1 with a 1.61 ERA in 11 career starts against the Padres. \n ", "external_links": [], "published": "2015-10-03T08:36:00.000+03:00", "crawled": "2015-10-03T12:18:46.230+03:00", "highlightTitle": ""}