{"organizations": [], "uuid": "9274f6730b2be63eeea38244acfa6bbd7862be8f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/5/33/152548/Arts--Culture/Music/-Its-a-story-of-hope-Egypts-filmmaker-on-his-rocku.aspx", "country": "EG", "title": "'It's a story of hope': Egypt's filmmaker on his rockumentary about Les Petits Chats - Music - Arts & Culture", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "'It's a story of hope': Egypt's filmmaker on his rockumentary about Les Petits Chats - Music - Arts & Culture - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "9274f6730b2be63eeea38244acfa6bbd7862be8f"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/5/33/152548/Arts--Culture/Music/-Its-a-story-of-hope-Egypts-filmmaker-on-his-rocku.aspx", "ord_in_thread": 0, "title": "'It's a story of hope': Egypt's filmmaker on his rockumentary about Les Petits Chats - Music - Arts & Culture", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Release of rockumentary about Egypt's band Les Petits Chats PHOTO GALLERY: Les Petits Chats singers close Bibliotheca Alexandrina Summer Festival VIDEO: Les Petits Chats Singers to reunite in Bibliotheca Alexandrina It comes as a surprise, or rather the sad truth, that the once extremely popular Les Petits Chats, the Egyptian band whose concerts saw roaring crowds and swooning ladies, is now forgotten, together with a large chunk of Egypt’s cultural history.\nThough it is still popular with the generation that witnessed its rise in the 1970s, today the name Les Petits Chats rarely rings a bell among the youngest breed of music lovers.\nThe band had a famed reunion at Palm Hills compound in the satellite city of Sheikh Zayed, Egypt in 2009, f ollowed by the Les Petits Chats Singers concert at the Bibliotheca Alexandrina last year, but while they continue to touch the hearts of older listeners, they only raise the eyebrows of the young.\nOne such young person was particularly puzzled by the stories of Les Petits Chats...\nSherif Nakhla, a filmmaker, decided to embark on a journey to uncover the riches of Egypt’s cultural golden age. His odyssey has resulted in Les Petits Chats, a rockumentary that brings back to today’s audiences the lost romantic feel of the band and their time.\nAfter six years of work, finally, the film will have its world premiere at the Arabian Sights Film Festival in Washington DC in mid-October.\nNakhla double majored in theatre and journalism at the American University in Cairo, graduating in 2002. He practiced cultural journalism for a few years, writing for platforms such as Al-Ahram Weekly. But his directorial repertoire now comprises numerous stage productions and the film Miraculum (2007), which won Best Socio-Political Documentary at the New York International Independent Film & Video Festival as well as an Achievement Award at the Newport Beach Film Festival.\nNakhla’s dynamic biography also points to a close attachment to music: he was a member of the Mercury rock and roll band, he plays drums and guitar and works as a DJ in various venues.\nIt was this combination of interests with a focus on film, “a sector that remains closest to my heart,” as Naklha puts it, is what drew his attention to Les Petits Chats.\nLes Petits Chats in the 1960s (Photo: courtesy of Sherif Nakhla)\nLes Petits Chats is probably Egypt’s best known cover band of all time.\nLaunched in 1967 as a quintet, the band included vocalist and band manager Wagdi Francis, alongside Ezzat Abou Ouf on keyboards, Omar Khairat on drums, and guitarists Freddy Rizk and Bert Andresia. Through the years, the lineup changed many times, incorporating names such as saxophonist Lukas, singers Sobhi Bidair, Talaat Zein and Hussein Serag Rady, keyboardists Hany Shenouda and Hany Meimary, guitarists Omar Khorshid and Pino Phares, among others. As their popularity soared, concerts across Egypt were soon supplemented with regional appearances to constant acclaim.\n“The band is our cultural heritage. They are not just Les Petits Chats, they are icons of the time,” Nakhla comments.\nHe goes on to explain how his work on the film began in 2009 when the band was preparing for their reunion.\n“It was this whole Les Petits Chats phenomenon that hit me in the face, and immediately I felt the need to investigate it further,” he says, explaining that he could not skip noticing that whenever the name of Les Petits Chats was mentioned, it created excitement among the generation whose youth was embedded in the Egypt of the 1960s and 1970s.\n“I wanted to understand what the big deal was. What is this romantic era that the older generation keeps talking about? What happened to their romance? I soon found out about the many values Les Petits Chats stand for: perseverance, teamwork. As much as those terms sound like clichés they are all true. At the same time their musicianship is mesmerising…”\nNakhla points to each of Les Petits Chats’s members becoming a significant figure in his respective field.\nThough the young generation may not know Les Petits Chats, they are well aware of composer Omar Khairat, actor Ezzat Abou Ouf, tenor Sobhi Bidair, and the late musician Omar Khorshid.\nNakhla calls Les Petits Chats “our national pride,” saying that it is through the band that his film presents the Egypt that used to be.\nYet it took the young director six years to make the movie.\n“Honestly, when I started out in 2009, I had other commitments on my plate and I wasn’t sure how to approach this film. To top off my confusion, many changes and developments took place around the concert time, and my mind slowly shifted from making a film about the band’s reunion at the Palm Hills compound to creating something that would portray Les Petits Chats within the socio-historical context of their era.”\nBy the end of 2009 Nakhla had all the ingredients for a film, and this is when he decided not to make a conventional one.\n“I looked at all this footage. It was all very raw and if it wasn’t for my journalistic experience I would’ve had hard time putting together all the bits and pieces of the film. Journalism helped me look at it as if I was structuring an in-depth report. It helped me find the rhythm of the story too.”\nBut the film production did not go smoothly. In the following months, and years, Nakhla was engaged in different projects, going back and forth with Les Petits Chats. During this time the film’s producer communicated with the Dubai International Film Festival and the platform expressed an interest in screening the early cut, but Nakhla did not feel ready to show his rockumentary to the world.\n“Despite the amazing opportunity, which would include screening the unfinished film and flying the band to Dubai, together with Wael Omar, a co-producer from Middlewest Films, we decided to let it go. Though it would’ve been a great event, the film was not yet what we wanted it to be.”\nProgress was interrupted again by the 2011 revolution, and though at certain point Nakhla felt he had reached first-draft stage, the constantly changing political backdrop raised questions regarding priorities.\n“Everything seemed to be on hold, including my life and career. I could no longer see any context for Les Petits Chats. I wanted it to be a nostalgic work yet I no longer had this feeing. I was even considering re-cutting the whole movie.”\nFinally Nakhla went back to his core idea of creating a film about Les Petits Chats against the backdrop of their own time.\n“I am very happy with this decision,” he says. “The only regret I have is that Lukas passed away and was not able to see the film released.” Apart from all the delays, the film was “made with tears” and involved many emotional aspects.\nLes Petits Chats in the 1960s (Photo: courtesy of Sherif Nakhla)\nThe film includes several interviews with the band members, alongside other personalities who serve as commentators on the era.\n“I preferred to step back and not to introduce any narrator, leaving the whole film to the band members. I think this is my favourite take on documentary filmmaking,” he explains.\nWith the film’s soundtrack incorporating Les Petits Chats archival material and their rehearsals in 2009, the band’s story is additionally intertwined with photographs showcasing their history and that of Egypt. The viewer walks out of the screening with a deeper understanding of the two decades that enveloped Les Petits Chats’s stardom.\nThough the film was already screened in 2012 as work in progress during the Ismailia Film Festival and its final version shown as part of the Zawya art house segment of Oshtoora, a music festival that took place in South Sinai between 10 and 12 April this year, it is the the 20th Arabian Sights Film Festival release in Washington DC that Nakhla considers to be the world premiere.\nThe film is nominated for a jury award, competing with Eyes of a Thief (Palestine), I am Nojoom, Age 10 and Divorced (France/Yemen/UAE) and Zinzana (UAE). Nakhla underlines that standing alongside such important movies is a humbling experience. He adds that he hopes to screen the film to a large audience in Egypt in November or December this year.\nThe release of the film will be accompanied by memorabilia in the form of a package including a DVD of the movie, a coffee-table book of photos and copies of articles about the band, and a CD of their 1971 concert with the voices of Wagdi Francis and Sobhi Bidair, Omar Khairat on drums, Hany Shenouna on keyboards and Pino Phares on lead guitar.\n“It is an entertainment movie yet also a story of hope,” Nakhla says.\nWhile for those who were young back in the day, the film will be an emotional experience, for today’s younger viewers it will be an introduction to the band and the now distant culture of their country.\n“Maybe such a phenomenon won’t happen again but it did happen and I wanted to frame it,” Nakhla says, adding in a tone of regret that “all this has somehow been swept under the carpet, like it never happened. Our generation doesn’t know this time and they definitely do not realise the strength of Les Petits Chats. Though Egypt has many contemporary bands, the young people are not aware that nothing compares to the popularity of Les Petits Chats.”\nNakhla points to the peak of Les Petits Chats’ popularity, when the band was giving two concerts per week for years on end, thrilling crowds of over 5,000 people.\nNakhla is still awaiting feedback from audiences and critics’. In the meanteam he is going back to work on another film, Bent Giran (Next-door Girl), which is “a different kind of movie yet very musical as well. Instead of paying tribute to the romantic era of Les Petits Chats and the Westernised Egypt of the time, Bent Giranis more of a tribute to the Abdel-Halim Hafez era and that kind of musical artistry.”\nThis article was first published in Al Ahram Weekly\nFor more arts and culture news and updates, follow Ahram Online Arts and Culture on Twitter at @AhramOnlineArts and on Facebook at Ahram Online: Arts & Culture", "external_links": ["https://twitter.com/AhramOnlineArts", "https://www.facebook.com/ahramonlinearts"], "published": "2015-10-10T03:00:00.000+03:00", "crawled": "2015-10-10T15:01:35.608+03:00", "highlightTitle": ""}