{"organizations": [], "uuid": "9054a49c2e0c7b7f00299c22ff7c39659b74069c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.si.com", "main_image": "http://cdn-jpg.si.com/sites/default/files/styles/si_photo_tile_image_marquee/public/2015/10/12/usa-shape-1.jpg?itok=AERT7A6q", "site_section": "http://www.si.com/htmlsitemap/2014/07/page-1", "section_title": "The Sports Illustrated HTML Sitemap Index for July, 2014 - SI.com", "url": "http://www.si.com/planet-futbol/2015/10/12/usa-mexico-tactics-concacaf-cup-jurgen-klinsmann-ferretti", "country": "US", "title": "USA vs Mexico tactics: USMNT failed to assert itself in playoff - Planet Futbol", "performance_score": 0, "site": "si.com", "participants_count": 5, "title_full": "USA vs Mexico tactics: USMNT failed to assert itself in playoff - Planet Futbol - SI.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 5, "uuid": "9054a49c2e0c7b7f00299c22ff7c39659b74069c"}, "author": "", "url": "http://www.si.com/planet-futbol/2015/10/12/usa-mexico-tactics-concacaf-cup-jurgen-klinsmann-ferretti", "ord_in_thread": 0, "title": "USA vs Mexico tactics: USMNT failed to assert itself in playoff - Planet Futbol", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "by Liviu Bird Twitter Facebook Email Posted: Tue Oct. 13, 2015 The entertainment of Mexico and the United States’ match for a spot in the 2017 FIFA Confederations Cup couldn’t hide both teams’ tactical deficiencies. Neither entered the game in an ideal situation, but Mexico seemed just slightly better-prepared for the one-off playoff, winning 3-2 in extra time . While United States manager Jurgen Klinsmann settled into the reactive posture the Americans have displayed on the world stage for some time in the CONCACAF Cup playoff on Saturday, Mexico interim coach Ricardo Ferretti did the opposite. His bold and attack-minded lineup, featuring three center forwards and no true wingers, showed no fear as Juan Carlos Osorio would be taking over from him soon, regardless of the result. That result was a win in which El Tri attacked from the first whistle and, at least in the top half of the field, looked largely comfortable. The U.S. displayed the same spirit that impressed fans worldwide at the World Cup, coming back from two one-goal deficits to tie, but the Americans hardly ever imposed themselves on the game.\nThe U.S. lined up in a narrow 4-4-2 with Michael Bradley reprising his usual free role ahead of Kyle Beckerman. Clint Dempsey drifted between the midfield and target man Jozy Altidore, linking the lines with mixed results, though his hold-up play improved in the second half.\nPlanet Futbol Video In loss to Mexico, U.S. beaten by the very skill it aspires to match by Brian Straus", "external_links": ["http://facebook.com/liviubird", "http://twitter.com/liviubird"], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-14T08:25:19.250+03:00", "highlightTitle": ""}