{"organizations": [], "uuid": "9a1eae2739e47f8b99dc2d7e45162695650cfd97", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.detroitnews.com", "main_image": "http://www.gannett-cdn.com/-mm-/f9a40c7431f972ddc8fe07c48817d5d11f173152/c=0-150-4735-2825&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/20/DetroitNews/B99315979Z.1_20151020151310_000_GOCKBAO1.1-0.jpg", "site_section": "https://feeds.feedblitz.com/detroit/sports#", "section_title": "Detroit News - Sports", "url": "http://www.detroitnews.com/story/sports/motor/2015/10/20/michigans-jones-among-trio-testing-cars-mis/74281758/", "country": "US", "title": "Michigan’s Jones among trio testing 2016 cars at MIS", "performance_score": 0, "site": "detroitnews.com", "participants_count": 1, "title_full": "Michigan’s Jones among trio testing 2016 cars at MIS", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T18:14:00.000+03:00", "replies_count": 0, "uuid": "9a1eae2739e47f8b99dc2d7e45162695650cfd97"}, "author": "detroitnews.com", "url": "http://www.detroitnews.com/story/sports/motor/2015/10/20/michigans-jones-among-trio-testing-cars-mis/74281758/", "ord_in_thread": 0, "title": "Michigan’s Jones among trio testing 2016 cars at MIS", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Erik Jones (left), a Swartz Creek graduate, is currently the points leader of the NASCAR Camping World Truck series. (Photo: Matt Sullivan, Getty Images) \nCONNECT TWEET LINKEDIN COMMENT EMAIL MORE Brooklyn, Mich. — Chase Elliott took some time away from his pursuit of the Xfinity series championship Tuesday, testing the 2016 Sprint Cup car during a day-long practice session at Michigan International Speedway.\nElliott, the 19-year-old son of one Sprint Cup legend, Bill Elliott, will be replacing another legend next year when he makes a big step forward in his career to supplant four-time Cup champion Jeff Gordon in the No. 24 Chevrolet for Hendrick Motorsports with NAPA sponsorship.\nElliott was on the two-mile superspeedway in a Chevrolet while another teenager, 19-year-old Michigan native Erik Jones, filled in for Denny Hamlin in the No. 11 Toyota for Joe Gibbs Racing. Xfinity points leader Chris Buescher (1,093) was testing a Ford for Roush-Fenway.\nElliott trails Buescher by 27 points with three races left. Jones, a Swartz Creek graduate, is currently the points leader of the NASCAR Camping World Truck series.\nThe base package for the 2016 Cup car includes a 3.5-inch spoiler, a 0.25-inch front leading splitter edge and a 33-inch wide radiator pan. These components will provide lower downforce on the cars and Goodyear plans to develop tires to complement them.\nThe package is similar to that used earlier this season at Kentucky Speedway, and Darlington Raceway featured a similar aero package.\nCharacteristics of the lower downforce rules package includes more off-throttle time for drivers and decreasing corner speeds, leading to more passing zones over the entire track, also allowing for multiple tire combinations to be levered.\nIn addition to the base package, each track will continue to feature specific rules, including tire combinations and drive train configurations to create the best racing for each track length, layout and surface.\nThe drivers talked to media members after their morning session, then went back out on the track for another few hours in the afternoon.\n“You’re just going so much faster in the Cup car, having more power and you’re out of the gas more at the end of the straightaway where as in a Xfinity car you’re just about wide open around the entire race track at least for the beginning stages of a run,” Elliott said. “We’re just trying to get used to it, definitely some differences. Hopefully we can give Goodyear some good feedback and make sure they bring back a tire that will allow us to race hard and put on a good show for people who are sitting here\n“We ran Darlington or at least a little bit of Darlington on a low downforce package so until you get into a race, and at least at Michigan in particular, I think it’s going to be hard to know exactly what it’s going to do or how much you’re going to be able to race people unless they let us go out here and race each other. I’m not sure how you’re going to know how it’s going to be around other cars until you try it out.\n“I’d like to think it’s going to be better, but I don’t know how much better it will be. I hope that this is a small step into continuing down this path. We don’t need to stop here with this low downforce package. I think it needs to continue if that’s the direction we need to go in and not get satisfied too soon.”\nSo, does Elliott feel extra pressure headed into next season replacing Gordon.\n“Jeff’s obviously done some amazing things and I have all the respect in the world for both Jeff and my dad as to what they’ve done,” Elliott said, “but unless I do my job it doesn’t matter. It doesn’t matter what my last name is or who drove the 24 car this year or last year of the past 15 years for that matter unless I go out and do my part and contribute the way I need to contribute and do my role, it’s irrelevant, you won’t be around very long, that’s just the way it is.\n“Hopefully, I can do my part, try to get going and fire off well next year.”\nJones will run full time for Kyle Busch in the Xfinity series next season. He has started at least one race in all three of NASCAR series this year.\n“It’s definitely a change for me, and you know I drove the Cup car back a few months ago in Kansas with the normal package that they are running right now in the Chase,” Jones said. “It’s has just a different feel, different driving style (at Kansas), and then coming here with the low downforce package, definitely a lot more off-throttle time, a little bit more challenging to drive, little bit more driver input which is nice.\n“We’ve been running through some tire compounds and just figuring some stuff out. Overall, I feel like for the Cup series this is a step in the right direction from what I experienced in Kansas and then feeling this out, I definitely feel it’s a pretty good change.”\nJones said he got the call from JGR representatives a couple of weeks ago to check his availability for the test, then was told Saturday night he would fill in for Hamlin.\n“I’m sure Denny just wants to get rested up and be 100 percent for the Chase,” Jones said of Hamlin, who is second in points to Joey Logano in the Chase for the Cup championship headed into Sunday’s race at Talladega. “Anytime I can get laps in these cars it’s beneficial to me. It’s a neat experience to be at Michigan at home and in a Cup car. Some of my family thought it was neat I’d be out here doing this. It’s one of top cars in the sport, just honored they asked me. It’s a pretty cool opportunity.”\nFireKeepers Casino title sponsor for June race \nIt was announced during a morning news conference that the June 12 Sprint Cup race at MIS will be known as the FireKeepers Casino 400.\nThe multi-year deal runs through the June 2018 race.\nThe Firekeepers Casino in Battle Creek recently celebrated its sixth anniversary and has been affiliated with MIS the last couple of years.\nHomer A. Mandoka , Tribal Council Chairman of the Nottawaseppi Huron Band of the Potawatomi, talked of FireKeepers’ big move.\n“I’ve been here watching races for about three decades off and on, sometimes hitting both races,” Mandoka said. “It’s an awesome experience for people to take part in, getting together socially, but then when it’s race time everyone’s rooting for their driver or teams. It’s great.\n“We’ve been building for this, actually when we first opened I was first talking about an idea like this because I knew what the attendance capacity was, market conditions and it’s only an hour drive (from FireKeepers to MIS). What we’re hoping for is that people come here a day early or stay a day late and come visit us.”\ndavid.goricki@detroitnews.com \ntwitter.com/DavidGoricki", "external_links": [], "published": "2015-10-20T18:14:00.000+03:00", "crawled": "2015-10-20T22:42:17.768+03:00", "highlightTitle": ""}