{"organizations": [], "uuid": "b48cbc94aae4dbf7e8e3d648d04d3dde2b1f52c0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.uniondemocrat.com", "main_image": "", "site_section": "http://feeds.feedburner.com/UnionDemocrat", "section_title": "The Union Democrat, Sonora, CA News, Sports, & Weather", "url": "http://www.uniondemocrat.com/index.php?option=com_content&task=view&id=117954&Itemid=199", "country": "US", "title": "Arrests made in Railroad Flat shooting", "performance_score": 0, "site": "uniondemocrat.com", "participants_count": 0, "title_full": "Arrests made in Railroad Flat shooting", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T14:02:00.000+03:00", "replies_count": 0, "uuid": "b48cbc94aae4dbf7e8e3d648d04d3dde2b1f52c0"}, "author": "", "url": "http://www.uniondemocrat.com/index.php?option=com_content&task=view&id=117954&Itemid=199", "ord_in_thread": 0, "title": "Arrests made in Railroad Flat shooting", "locations": ["Rail Road Flat", "Calaveras County Jail", "South Railroad Flat Road", "Calaveras County"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Grammer", "Leon Michael Grammer", "Tori Thomas", "Kevin Raggio", "Jeremiah Lee Barrett", "Barrett", "Jackson"], "text": "Arrests made in Railroad Flat shooting Arrests made in Railroad Flat shooting By Tori Thomas, The Union Democrat October 21, 2015 11:02 am Two men were arrested Tuesday in connection with the shooting deaths of three men near Rail Road Flat. Jeremiah Lee Barrett, 30, of Jackson, was arrested and charged with murder and conspiracy to commit a crime. He is being held in Calaveras County Jail on $2.5 million bond. His brother, Leon Michael Grammer, 38, was arrested and charged with being an accessory and conspiracy to commit a crime. He was released from Calaveras County Jail on $30,000 bond. Deputies responded to a parcel of land on the 1400 block of South Railroad Flat Road 9:20 a.m. Tuesday after receiving reports of a shooting. Upon arrival, deputies found three Caucasian men shot to death — two lying on a dirt roadway, and the other lying off the roadway. In a statement released Wednesday morning, the Sheriff’s Office reported Grammer, who resides at the address, saw at least three trespassers on his property he believed were stealing from a medical marijuana garden located on the property . Grammer called Barrett and asked him to come to the property. Grammer allegedly armed himself with a firearm and shot several rounds toward the men. Upon arrival, Barrett confronted the men running on a roadway and allegedly shot them with a shotgun. The Calaveras County Sheriff’s Office did not release the names of the men who were killed, pending notification of next of kin. Kevin Raggio, Calaveras County coroner, confirmed the bodies of the three men are at coroner's office. “It’s definitely a homicide,” he said. Contact Tori Thomas at This e-mail address is being protected from spam bots, you need JavaScript enabled to view it or 588-4526. Follow her on Twitter @ToriThomasUD. Follow UnionDemocrat.com", "external_links": [], "published": "2015-10-21T14:02:00.000+03:00", "crawled": "2015-10-22T08:28:59.077+03:00", "highlightTitle": ""}