{"organizations": ["Toronto Blue Jays"], "uuid": "bde972151c629ddead52af9f590474a979e6f857", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usatoday.com", "main_image": "http://www.gannett-cdn.com/-mm-/5b04356dee775a8cf46861935bd69ff636d3e64b/c=0-186-3185-1985&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/08/USATODAY/USATODAY/635799337755267808-c01-main-1009.jpg", "site_section": "http://news.google.com/news?pz=1&cf=all&ned=us&hl=en&topic=s&output=rss", "section_title": "Sports - Google News", "url": "http://www.usatoday.com/story/sports/mlb/2015/10/08/blue-jays-rangers-alds-josh-donaldson-david-price-playoff-struggles/73621432/", "country": "IL", "title": "Ace beaten, stars ailing: Are Blue Jays in deep in ALDS vs. Rangers? - USA TODAY", "performance_score": 0, "site": "usatoday.com", "participants_count": 0, "title_full": "Ace beaten, stars ailing: Are Blue Jays in deep in ALDS vs. Rangers? - USA TODAY", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:54:00.000+03:00", "replies_count": 0, "uuid": "bde972151c629ddead52af9f590474a979e6f857"}, "author": "", "url": "http://www.usatoday.com/story/sports/mlb/2015/10/08/blue-jays-rangers-alds-josh-donaldson-david-price-playoff-struggles/73621432/", "ord_in_thread": 0, "title": "Ace beaten, stars ailing: Are Blue Jays in deep in ALDS vs. Rangers? - USA TODAY", "locations": ["USA"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Joe Lemire", "Josh Donaldson", "Dan Hamilton"], "text": "Ace beaten, stars ailing: Are Blue Jays in deep in ALDS vs. Rangers? Is it getting late early for the Toronto Blue Jays? Post to Facebook Ace beaten, stars ailing: Are Blue Jays in deep in ALDS vs. Rangers? Is it getting late early for the Toronto Blue Jays? Check out this story on USATODAY.com: http://usat.ly/1RwRWjI Cancel Send A link has been sent to your friend's email address. Posted! A link has been posted to your Facebook feed. Join the Nation's Conversation To find out more about Facebook commenting please read the Conversation Guidelines and FAQs Ace beaten, stars ailing: Are Blue Jays in deep in ALDS vs. Rangers? Joe Lemire, Special for USA TODAY Sports 9:29 p.m. EDT October 8, 2015 Josh Donaldson passed a concussion test, but will be reevaluated Friday morning after he was hurt in Game 1 of the ALDS. (Photo: Dan Hamilton, USA TODAY Sports) 1 CONNECT 1 TWEET LINKEDIN COMMENT EMAIL MORE \nTORONTO — Blue Jays ace David Price has a good chance to win his second American League Cy Young, and his new club won nine of his 11 outings after they traded three promising pitching prospects to the Detroit Tigers for him at the trade deadline. \nAfter Thursday’s 5-3 loss to the Texas Rangers in Game 1 of the AL Division Series, however, he has lost all six career postseason starts, this one after allowing five runs in seven innings. \n“I want that monkey off my back,” Price said. “I expect to have better results out there.” \nHeavily favored Toronto, which was an AL-best 43-18 (.705) since beginning a midseason trading binge, now finds itself down a game in the series with the prospect of facing Rangers ace — and former World Series MVP — Cole Hamels in Friday’s Game 2 matinee. \nWhile losing the first postseason game in Canada for 22 years disappointed the 49,384 rambunctious fans who filled the Rogers Centre, the confidence burnished by a two-month hot streak spree was not diminished. \n“I’m ready for tomorrow already,” catcher Russell Martin said. “This game’s over with.” \nAdded right fielder Jose Bautista, “It doesn’t change anything about our approach.” Rangers power tops Blue Jays, take 1-0 lead in ALDS \nThe Jays also must worry a little about their two best players, Bautista and third baseman Josh Donaldson, who each exited the game early with injuries. Bautista left in the ninth due to hamstring cramping that he said wouldn’t keep him out of today’s lineup. \nDonaldson may represent a more significant concern - the club announced that the AL MVP candidate, who took an inadvertent knee to the head while breaking up a double play at second base, passed concussion tests and will be reevaluated Friday morning. \nTexas had its own injury concern, with third baseman Adrian Beltre departing the game after barely being able to reach first on a run-scoring single. The early diagnosis was lower back stiffness, but manager Jeff Banister said he will undergo an MRI. “He’s the heart and soul of this ballclub,” Banister said. \nRougned Odor scored three of Texas’ five runs, even if he only reached base once fully of his own volition. The young lefty second baseman was hit by two Price pitches and sharply lined a home run off Price in the seventh for an insurance run. \nTwice did Texas hit ground balls with a runner on first base in the third inning and, while neither was sharply hit, the fact that Odor and Delino DeShields were stealing on those pitches ruined Toronto’s double-play chances. Subsequent singles later scored those runners from second base. \nRangers catcher Robinson Chirinos added a two-run homer in the fifth, and DeShields went 2-for-4 with a double. Those two and Odor all made their postseason debut a memorable one. AL Division Series capsule: Astros vs. Royals \n“They have experience playing the game of baseball, and they’re doing things that they’ve done all year long,” Gibbons said. \nToronto — by far the majors’ highest-scoring offense — only mustered three one-run innings thanks to an RBI single from Edwin Encarnacion, a run-scoring double from Kevin Pillar and a solo homer from Bautista. \n“We take a lot of pride in being able to overcome our starter not having his best, but that’s a good team over there,” Pillar said. \nTexas starter Yovani Gallardo, who shut out the Jays for 13 2/3 regular-season innings, received the win after allowing two runs in five innings. “He was making quality pitches on the corners,” Bautista said. \nMartin said Price’s command was “not as pinpoint as he can be, but he still managed.” Price didn’t allow five earned runs in any start for the Blue Jays this season. He attributed two first-inning walks to early nerves, not the 11-day layoff he had between starts, and said simply, “I didn’t throw the ball the way I’m capable of tonight.” \nThere’s no single reason why he’s struggled in October, a month whose results may be more random than fans and players would like to believe — Dodgers ace Clayton Kershaw, a former MVP and three-time Cy Young winner, has even worse career playoff numbers, after all. \nThe answer to Price’s playoff woes and underachieving postseason reputation lies in the series of handwritten notes that have adorned his locker for the past few months, each reading, “If you don’t like it, pitch better,” with triple underlines under the last two words. \nAsked about the scrawled sign earlier this season, Price cryptically replied, “It is it. It is everything.” Postseason baseball certainly is, when legacies are minted and the season’s last few months fade from memory. \nGALLERY: Rangers-Blue Jays clash in ALDS", "external_links": [], "published": "2015-10-09T03:54:00.000+03:00", "crawled": "2015-10-09T04:39:11.085+03:00", "highlightTitle": ""}