{"organizations": ["Blue Knights", "GSC", "Golden Eagles", "WVWC", "CU", "TFL", "West Virginia State", "NCAA", "FSU", "Mountain Lions", "Glenville State", "NDC", "MEC", "Calvinaugh Jones", "Falcons", "Mountain East Conference West Liberty", "Allen Cross", "Cavs", "Bobcats"], "uuid": "5485f741cc7275a690f426c4b1f19f8f8269f032", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wdtv.com", "main_image": "http://www.wdtv.com/content/images/Sports/week8-preview.jpg", "site_section": "http://www.wdtv.com/rss.cfm?type=Sports", "section_title": "Welcome to 304 SPORTS", "url": "http://www.wdtv.com/wdtv.cfm?func=view&section=Sports&item=Week-8-Division-II-Football-Preview-26333", "country": "US", "title": "Week 8 Division II Football Preview", "performance_score": 0, "site": "wdtv.com", "participants_count": 0, "title_full": "Week 8 Division II Football Preview", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T23:13:00.000+03:00", "replies_count": 0, "uuid": "5485f741cc7275a690f426c4b1f19f8f8269f032"}, "author": "", "url": "http://www.wdtv.com/wdtv.cfm?func=view&section=Sports&item=Week-8-Division-II-Football-Preview-26333", "ord_in_thread": 0, "title": "Week 8 Division II Football Preview", "locations": ["Concord", "West Virginia Wesleyan", "Urbana", "Charleston", "Fairmont State", "West Virginia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jeremy Johnson", "Terrance Younger", "Alderson Broaddus", "Tevin Drake", "Mitchell Shegos", "Malik Grove", "Marcus Porter", "Rahmann Lee", "Zach Chatlain", "Zachary Blair", "Michael Anderson", "Mason Olszewski", "Conwell", "Anton McCallum", "C.J. Davis", "Jabre Lolley", "Kyle Kaplan", "Wallace", "Ryan Deal", "Jeff Ziemba", "Wes Lane", "Marvin Elam", "Fabian Guerra", "Cooper Hibbs", "Earon", "Dakota Conwell", "Andrew Fairamo"], "text": "Created on October 23, 2015 @ 4:13PM Courtesy: Mountain East Conference West Liberty (4-3, 4-2) comes into the matchup having won three of its last four. Several players have recovered from injury, notably wideout Anton McCallum who has 18 catches for 367 yards and four touchdowns in the last four games. WLU is paced by the play of quarterback Dakota Conwell who has thrown 12 touchdown passes this season and rushed for six others. Conwell has 1,404 yards through the air and is second on the team in rushing with 323 yards. On defense, safety Andrew Fairamo has stepped up his game as of late recording five tackles for a loss in the last two games. Notre Dame comes to West Liberty with an overall record of 2-5 (2-4 MEC), but the Falcons season has been a series of close calls: five of the team's seven games have been decided by less than two touchdowns. Last week, NDC got on the positive end of a close game with a 23-21 victory at home against preseason favorite Concord. Like Conwell, Notre Dame's Malik Grove is a dual-threat quarterback who has accounted for 19 touchdowns this season (12 passing, seven rushing). Grove has thrown just one interception in his four starts and is completing 56 percent of his passes during that stretch. Wideout Mitchell Shegos leads the MEC with 47 catches on the year and has 586 yards with five touchdowns. On defense, NDC posted its first shutout in program history in the second week of the season, but the Falcons are still surrendering 32.1 points per game. Zach Chatlain is one of just three players in the MEC to average double-digit tackles recording 10.1 per game. In other MEC action, No. 9 Shepherd (6-0) faces a tough test at Concord (4-3) where the Mountain Lions are 3-0 this year. Two of the top offenses in the league match up as Glenville State (5-2) travels to West Virginia State (4-3). With Rahmann Lee out with injury, Tevin Drake responded last week with 294 rushing yards in a non-conference win. WVSU, on the other hand, was stifled last week in a loss at Shepherd. Charleston (6-1) faces Urbana (2-5) on the road as it looks for its sixth-straight win, and Fairmont State (3-3) plays host to UVa-Wise (0-7). Week Seven Rewind Glenville State opened the week with a convincing 48-30 win over Alderson Broaddus in non-conference play on Thursday night ... Tevin Drake rushed for 294 yards on 44 carries ... the Pioneers racked up 34 first downs compared to just 13 for AB ... Wes Lane and Earon Settles each and interceptions for GSC ... Notre Dame's Kyle Kaplan hit a field goal with 6:30 left in the fourth quarter to lift the Falcons past Concord, 23-21 ... NDC squandered a 17-0 first half lead as the Mountain Lions rallied in the second half and led 21-20 midway through the fourth ... Malik Grove had 262 yards passing with one touchdown and 52 yards on the ground with another score ... CU's Calvinaugh Jones rushed for over 100 yards for the third-straight game and became the school's all-time leading rusher ... West Virginia State pulled to within a touchdown early in the third quarter, but No. 10 Shepherd close the game with 23-straight points to secure a 46-17 win over the Yellow Jackets ... WVSU had more first downs and more passing yards, but were limited to just 28 yards rushing ... SU had the ball for nearly five more minutes ... Jeff Ziemba was picked off for the first time this season ... SU's running back tandem of Allen Cross and Jabre Lolley each scored two touchdowns ... Charleston held off a late Fairmont State rally to defeat the Falcons, 38-31 ... the Golden Eagles led 31-7 early in the third quarter before the FSU surge ... Mason Olszewski, playing in place of the injured Jeremy Johnson, was 14-of-23 for 263 yards with one touchdown and two interceptions, and had 55 yards rushing and another score on the ground ... Marvin Elam led the UC ground game with 106 yards and a pair of scores ... FSU's Cooper Hibbs was 27-of-44 for 378 yards and four touchdown passes ... the Falcons has a pair of wide receivers go over 100 yards with Fabian Guerra (109) and LaChristopher Lee (166) ... Marcus Porter had two interceptions for FSU and eight tackles ... West Liberty out-scored UVa-Wise 23-0 in the second half to defeat the Cavs, 30-6 ... Dakota Conwell had a part in all four WLU touchdowns throwing for two and rushing for two ... Anton McCallum had 107 yards and a touchdown receiving ... UVa-Wise had just 14 yards rushing ... Andrew Fairamo had nine tackles, including three for a loss and a sack ... Zachary Blair added to his TFL total for the Cavs adding 1.5 ... WVWC picked up its first win of the season defeating Urbana, 34-7 ... the Bobcats rolled up 24 first downs and held the Blue Knights to just nine ... UU had just 56 yards rushing ... Michael Anderson had a season-high 176 yards and a TD for the Bobcats ... WVWC's Ryan Deal was 19-of-32 for 216 yards and three TDs ... D'Gary Wallace had 10 total tackles (nine solo) to go with two TFL and an interception he returned 57 yards for UU. Notable Home teams went 4-1 last week in the MEC. The top two teams in the MEC (Shepherd, Charleston) are 7-0 at home this year. Home teams are 6-0 in the MEC Thursday Night Game of the Week. Five different players have thrown four TD passes in a game this season ... two of them are from West Virginia Wesleyan (Luke Casey and Ryan Deal) ... Deal and Dakota Conwell have accomplished the feat twice ... FSU's Cooper Hibbs was the latest to join the club last week vs. UC. Tevin Drake's 44 carries vs. ABU were an MEC record. His four rushing TDs matched a conference record. C.J. Davis' 112 punt return yards are the third-most in a single game in MEC history. FSU's Marcus Porter became the fifth player in the league this season to have two interceptions this game. There have been four shutouts in the MEC this season, most recently Fairmont State blanking Urbana two weeks ago. There were just two shutouts in the MEC in 2014 and five in 2013. Fairmont State is one of just four teams in the NCAA to not throw an interception this season. UVa-Wise's Terrance Younger has five 100-yard receiving games this year. The MEC single-season record for 100-yard receiving games is seven. Urbana's 90 interception return yards last week vs. WVWC were the most in the MEC this season. Share", "external_links": [], "published": "2015-10-23T23:13:00.000+03:00", "crawled": "2015-10-24T00:18:42.358+03:00", "highlightTitle": ""}