{"organizations": [], "uuid": "d59e7cdf1183eeb0274acc6fdfc88cac02e3f120", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/47529300.cms", "site_section": "http://timesofindia.indiatimes.com/rssfeeds/4720867.cms", "section_title": "Top Stories - Golf - Sports - The Times of India", "url": "http://timesofindia.indiatimes.com/sports/golf/top-stories/Rashid-Khan-grabs-lead-Arjun-Atwal-misses-cut-at-Taiwan-Masters/articleshow/49194681.cms", "country": "IL", "title": "Rashid Khan grabs lead, Arjun Atwal misses cut at Taiwan Masters", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "Rashid Khan grabs lead, Arjun Atwal misses cut at Taiwan Masters - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T18:36:00.000+03:00", "replies_count": 0, "uuid": "d59e7cdf1183eeb0274acc6fdfc88cac02e3f120"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/sports/golf/top-stories/Rashid-Khan-grabs-lead-Arjun-Atwal-misses-cut-at-Taiwan-Masters/articleshow/49194681.cms", "ord_in_thread": 0, "title": "Rashid Khan grabs lead, Arjun Atwal misses cut at Taiwan Masters", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "TAIPEI: Indian golfer Rashid Khan survived a double bogey start to card a two-under 70 and wrest the halfway lead even as the seasoned Arjun Atwal missed the cut at the Mercuries Taiwan Masters here on Friday. \n\nThe 24-year-old, who won two Asian Tour titles last year, fought back strongly with six birdies against two bogeys for a 70 that gave him a total of six-under 138. \n\nRashid was one shot ahead of overnight leader Danny Chia, whose second round 72 gave him a total of 139 but allowed the Indian, who was one behind after first round, to move one ahead after the second round. \n\nThe top two were well ahead of the rest as five players including Siddikur Rehman (69-74), Liang Wen-chong (70-73), Antonio Lascuna (72-71), Pan Cheng-Tsung (71-72) and Mithun Perera (71-72) were tied for third at one-under 143. \n\nAlso making the cut were Chiragh Kumar (77-71) and S Chikkrangrappa (72-76) and Himmat Rai (73-75), all in tied-26th. \n\nHowever, with only Top-50 and ties making the cut, Rahil Gangjee (76-75) and Arjun Atwal (76-75) missed the cut by one. Also making an early exit were Gaganjeet Bhullar (76-78) and Angad Cheema (81-82) as did Daniel Chopra (75-79). \n\nRashid, who has had a very modest season with Tied-24th at Hero Indian Open as his best this year, had a rattling double bogey start. \n\n\"I started really bad. I hit it into the bunker from where I had to chip it out. I hit it onto the green but three-putted for a double bogey, which was a very disappointing start. But I didn't let it affect my game. The 15-footer I holed on the next hole for par gave me a little confidence.\" \n\nThereafter, he did not look back. \n\n\"I had three straight birdies starting from the fifth which got my game going. I chipped in from greenside bunker on the fifth and made up and down there. I told my caddy if I can shoot three or four-under par, it will be good. But I three-putted on the ninth again. I kept the ball in play on the back nine, made another three birdies although I three-putted on 17th. I holed a six-footer putt for birdie on the 18th, which was a good finish to the round.\" \n\nOn the position right now, he said, \"Overall, I was feeling confident with my game but my short game just wasn't as good today. I didn't putt well and my chipping was not good as I didn't manage to control the distance at all. My ball striking was good. I was able to find most of the fairways and greens out there. That helped today.\" \n\n\"This is my first time at the Mercuries Taiwan Masters and it's nice to be here. This season hasn't been great for me so far but like I said earlier, I practiced a lot and it's good to see the efforts paying off.\" \n\nChia had two birdies and two birdies in an even-par round of 72. Chiragh Kumar was the other Indian, who played well on second day. He began with three birdies on front nine but was unable to build on it and with a back nine of two-over 38, he finished at 71, but made the cut comfortably.  ", "external_links": [], "published": "2015-10-02T18:36:00.000+03:00", "crawled": "2015-10-02T16:34:23.369+03:00", "highlightTitle": ""}