{"organizations": ["Raiders", "Chargers"], "uuid": "123b28f9e6913c0701b2fbb6e8c95271b2f6326d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ocregister.com", "main_image": "http://images.onset.freedom.com/ocregister/gallery/nwlmi1-b88546980z.120151021184925000gm7cnmc8.10.jpg", "site_section": "http://ocregister.com//common/rss/rss.php?catID=18969", "section_title": "The Orange County Register - News Headlines : Sports Columns", "url": "http://www.ocregister.com/articles/chargers-688643-play-wednesday.html", "country": "US", "title": "Alexander: Time has arrived for Chargers to make their move", "performance_score": 0, "site": "ocregister.com", "participants_count": 0, "title_full": "Alexander: Time has arrived for Chargers to make their move - The Orange County Register", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "123b28f9e6913c0701b2fbb6e8c95271b2f6326d"}, "author": "", "url": "http://www.ocregister.com/articles/chargers-688643-play-wednesday.html", "ord_in_thread": 0, "title": "Alexander: Time has arrived for Chargers to make their move", "locations": ["SAN DIEGO"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SAN DIEGO – If the Chargers have a season-changing winning streak in them, it must begin Sunday against the Raiders.\nYes, San Diego is 2-4. And yes, there is truth in the old Bill Parcells saying that in the NFL, you are what your record says you are.\nBut your record is also influenced by who you play, where you play and when you play them, as well as how you’re playing. And the Chargers seem about to encounter the soft underbelly of their schedule.\nThe teams that handed the Chargers their four losses are a combined 19-4, including undefeated Cincinnati and Green Bay. The teams they beat, Detroit and Cleveland, are a combined 3-9.\nNow they embark on a six-week stretch against five sub-.500 teams – the Raiders (2-3), Baltimore (1-5), Chicago (2-4), Kansas City (1-5) and Jacksonville (1-5) – with a bye week mixed in.\nCumulative record, for those who weren’t keeping count: 7-22. Opportunity to get back into the race for a playoff spot: Huge.\n“You can’t get on a roll unless you win one in a row,” Philip Rivers said Wednesday, reiterating that the margin is often razor-thin.\n“The hard part is that either side (offense or defense) can pick out a play in three games, where (if the play is made) the outcome’s totally different,” he said.\n“Other teams are saying the same thing … it goes back and forth. We all could be 6-0, or we all could be 0-6 with a few plays here and there. That’s what makes the game so much fun every week.”\nWell, maybe 5-1 in the Chargers’ case. The 31-14 loss in Minnesota on Sept. 27 was lopsided enough that it would have taken more than a couple of plays to make a difference.\nBut his point makes sense. To take advantage of this opportunity and get on that roll, the Chargers must make plays more successfully and more often.\nSo is there true reason for optimism? Perhaps.\nTackle King Dunlap and guard Orlando Franklin joined their teammates for a full practice Wednesday for the first time in four weeks, immediately making the left side of the Chargers’ offensive line better. And that is not to minimize the contributions of fill-ins Chris Hairston and Kenny Wiggins, part of a makeshift unit that enabled Rivers to throw for 503 yards last Sunday while playing all 92 offensive snaps.\n“Obviously, we know what King and Orlando can do,” Danny Woodhead said. “But we trust whoever’s out there.”\nAs always, the midweek injury report provides few clues. Nine players didn’t participate in Wednesday’s practice. Eric Weddle (groin) and Keenan Allen (hip), both sidelined in the Green Bay game, were among them. So was Manti Te’o (ankle), who didn’t play against the Packers.\nAnd so were Melvin Gordon (listed with an ankle owie) and Antonio Gates (a knee boo-boo), who were in fact probably taking maintenance days. Gordon, in fact, confirmed he’d be physically able to play Sunday; his issue will be holding on to the football, after fumbling twice, losing one, and being sent to the bench for the entire second half in his home state last weekend.\nBeyond that, Coach Mike McCoy brought up the issue of effort earlier this week. He seemed to imply that some young players – of whom the Chargers have many – weren’t following the lead of veterans such as Rivers and Weddle and Gates, who come into the facility early, stay late and put in plenty of extra work.\n“I’m not questioning by any means the work ethic of our football team at all,” McCoy said Wednesday, backtracking slightly.\n“My message is that we’re asking everybody to do a little more. It’s not that they weren’t doing enough, but as the season goes along you’ve got to push yourself harder. ... You have to look at yourself and say, ‘How can I improve every day in one little area?’”\nExtra work, extra preparation, and extra attention to detail never hurt. So why, then, weren’t the coaches cranking up the piped-in noise during Wednesday’s practice?\nAfter all, Pittsburgh Steelers fans pumped up the volume during the Chargers’ last “home” game two Mondays ago. When Raiders fans invade Qualcomm on Sunday, you don’t think Rivers and the offense will need to go to the silent count?\nContact the writer: jalexander@pe.com", "external_links": [], "published": "2015-10-21T03:00:00.000+03:00", "crawled": "2015-10-22T10:34:10.668+03:00", "highlightTitle": ""}