{"organizations": ["Barcelona By JOSEPH WILSON Associated Press", "Barcelona"], "uuid": "97f65938ed25e7f5ea3f37b114b2b86f6287c630", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.greenfieldreporter.com", "main_image": "http://d1bdhkmqqz901h.cloudfront.net/1200x630/smart/cdn1.therepublic.com/smedia/1/3/13b60e960a844e8091384b14ee18c8b1/web_full_907059894572.jpg", "site_section": "http://greenfieldreporter.com//feed/sec/6000", "section_title": "GreenfieldReporter.com - Sports News", "url": "http://www.greenfieldreporter.com/view/story/13b60e960a844e8091384b14ee18c8b1/SOC--Extra-Time", "country": "US", "title": "Suarez succeeds in suppressing his impulses at Barcelona", "performance_score": 0, "site": "greenfieldreporter.com", "participants_count": 0, "title_full": "Suarez succeeds in suppressing his impulses at Barcelona", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T15:54:00.000+02:00", "replies_count": 0, "uuid": "97f65938ed25e7f5ea3f37b114b2b86f6287c630"}, "author": "", "url": "http://www.greenfieldreporter.com/view/story/13b60e960a844e8091384b14ee18c8b1/SOC--Extra-Time", "ord_in_thread": 0, "title": "Suarez succeeds in suppressing his impulses at Barcelona", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Suarez"], "text": "After a year in burgundy and blue, Suarez succeeds in suppressing his impulses at Barcelona By JOSEPH WILSON Associated Press   9:54   9:54   \nPeople: Photo Gallery: \nClick to view (4 Photos) \nBARCELONA, Spain — Wearing the burgundy-and-blue of Barcelona, Luis Suarez has succeeded in suppressing his violent impulses while maintaining his magnificence in front of goal. \nThe Spanish club can only hope that the rehabilitated Uruguayan is here to stay because he has become irreplaceable for Barcelona coach Luis Enrique, especially in the absence of the injured Lionel Messi. \nSuarez was the most maligned player on the planet when he arrived in disgrace at Barcelona after being slapped with a four-month ban and expulsion from the World Cup for biting Italy defender Giorgio Chiellini. \nDespite his otherwise soft-spoken and even friendly demeanor off the field, Suarez's third multi-match ban for sinking his teeth into an opponent — to go with another suspension for racial abuse — had created the widespread perception that he was incorrigible and that it was only a matter of time before he added another incident to his growing record of misdemeanors. \nBut Suarez, who has received therapy, has since done what he can to restart his career in Spain. He has helped Barcelona win four trophies while avoiding any outbreaks of rage or knee-jerk overreactions after brushes with opposing defenders that can trigger his worst responses. \nSuarez celebrated his anniversary on Sunday by scoring a hat trick to rally Barcelona past Eibar for a 3-1 win that kept the defending champions level on points with league leader Real Madrid . \nThose were Suarez's 33rd, 34th and 35th goals in 57 appearances since Barcelona jeopardized its motto of being \"more than a club\" by signing the volatile striker. \nWith Messi out with a left-knee ligament tear, Suarez and Neymar have kept the team in contention. Suarez also scored to complete a 2-1 comeback over Bayer Leverkusen in the Champions League. He leads the team with 10 goals overall this campaign. \n\"He is unstoppable,\" Barcelona coach Luis Enrique said. \"He is a fundamental player for us and does not have a substitute.\" \nBarcelona's decision to overlook a reputation left in tatters by the World Cup biting ban was considered cynical by many, but the 28-year-old Suarez said what he needed to after leaving Liverpool and arriving at Camp Nou last year. After apologizing, he publicly pledged that he would not bite again, and said that he was receiving \"professional\" help to control his emotions. \nSuarez seems right at home in Barcelona. He was already well acquainted with Mediterranean city, regularly visiting his wife's family in the area, and communication with his teammates, coaches and staff was easier in his native Spanish. \nPerhaps more importantly, he knew his place on the team. No longer would he be the No. 1 option in attack like at Liverpool, when he led the Premier League in scoring with 31 goals. At Barcelona, Suarez immediately took a supporting role behind Messi. \nHe certainly rose to the occasion in the biggest matches last season, scoring in the 2-1 win over Madrid that helped Barcelona reclaim the league title, and then adding Barcelona's second goal in its 3-1 win over Juventus in the Champions League final. \nHe also appears to have developed a technique for avoiding trouble: Just walk away. \nAgainst Eibar, Suarez fell to the ground entangled with a defender. Once on their feet they jawed at each other, but at the point where it could have gotten ugly, Suarez turned away. \nIronically, given Messi's tax fraud case and the lawsuit over Neymar's contract, Suarez is the only one of the three stars not to taint Barcelona's reputation. \nHe still has a long way to go to prove he has exorcised all his demons, and he will need to finish out the remaining years of his career on his absolute best behavior to leave behind an evenly mildly positive legacy. \nUntil then, there is always the lingering worry that one stiff knock or naughty word from an adversary and it could all unravel. \nAll content copyright ©2015 Daily Reporter, a division of Home News Enterprises unless otherwise noted.", "external_links": [], "published": "2015-10-26T15:54:00.000+02:00", "crawled": "2015-10-26T15:57:57.616+02:00", "highlightTitle": ""}