{"organizations": ["NL", "Los Angeles Dodgers", "New York Mets"], "uuid": "97bcc76b6b20f127bfa05de53bcc95adbfcd1d20", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jsonline.com", "main_image": "http://media.jrn.com/images/b41ea5d6-4737-40e2-8a8d-e4caf0178bec.jpg", "site_section": "http://www.jsonline.com/rss?c=y&path=%2Fsports%2Fnational&atom=y", "section_title": "JSOnline.com Sports - National Top Stpries", "url": "http://www.jsonline.com/sports/national/torre-to-review-utleys-slide-for-possible-discipline-mjsurnpublicidaporgfa68a8f4edc64391ae777c6c4d29.html", "country": "US", "title": "Torre to review Utley's slide for possible discipline", "performance_score": 0, "site": "jsonline.com", "participants_count": 0, "title_full": "Torre to review Utley's slide for possible discipline", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T10:21:00.000+03:00", "replies_count": 0, "uuid": "97bcc76b6b20f127bfa05de53bcc95adbfcd1d20"}, "author": "", "url": "http://www.jsonline.com/sports/national/torre-to-review-utleys-slide-for-possible-discipline-mjsurnpublicidaporgfa68a8f4edc64391ae777c6c4d29.html", "ord_in_thread": 0, "title": "Torre to review Utley's slide for possible discipline", "locations": ["Los Angeles"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kyle Glaser", "Ruben Tejada", "Adrian Gonzalez", "Torre", "John McCoy/Los", "Utley", "Howie Kendrick"], "text": "Torre to review Utley's slide for possible discipline     Los Angeles Dodgers' Chase Utley, left, and Howie Kendrick celebrates after scoring on a hit by Adrian Gonzalez during the seventh inning in Game 2 of baseball's National League Division Series against the New York Mets, Saturday, Oct. 10, 2015 in Los Angeles. (AP Photo/Gregory Bull) New York Mets shortstop Ruben Tejada falls after a slide by Los Angeles Dodgers' Chase Utley during the seventh inning of an NL Division Series baseball game Saturday, Oct. 10, 2015, in Los Angeles. (John McCoy/Los Angeles Daily News via AP) By Kyle Glaser,   Oct. 11, 2015 (0) Comments \nLOS ANGELES (AP) - Major League Baseball executive Joe Torre will review the controversial slide by Los Angeles Dodgers second baseman Chase Utley into New York Mets shortstop Ruben Tejada for possible disciplinary action after Game 2 of their NL Division Series. \nUtley broke Tejada's right leg during the seventh inning of the Dodgers' 5-2 win Saturday night while trying to break up a double play at second base. \n\"I'd hate to think that Utley tried to hurt somebody,\" said Torre, MLB's chief baseball officer. \"It certainly was late. That concerns me. The lateness of the slide. ... I'm looking at it to see if anything should be done.\" \nTorre, a former manager of the Dodgers and New York Yankees, was at Dodger Stadium for the game. \n\"I have to determine if I thought it was excessive,\" he said. \"Not that you shouldn't slide hard, but as I said, just the late slide is probably the only thing that is in question right now.\" \nA comment in the Official Baseball Rules to Rule 5.09 (a) (13) says umpires could have called an inning-ending double play if they decided Utley had gone outside the baseline and interfered with Tejada fielding the throw. \n\"The objective of this rule is to penalize the offensive team for deliberate, unwarranted, unsportsmanlike action by the runner in leaving the baseline for the obvious purpose of crashing the pivot man on a double play, rather than trying to reach the base,\" the comment says. \"Obviously this is an umpire's judgment play.\" \nUtley was only about a foot off the base. Torre said second base umpire Chris Guccione ruled it was a legal slide on the field. \n\"That's a judgment call,\" Torre said. \"I'm still watching replays of it. They get a chance, one shot to look at it. ... I can't fault the umpire for everything he had to look at.\" \nTorre also said umpires were correct to award Utley second base after the Dodgers asked for a video review, which determined Tejada did not touch the base on the play. Utley did not touch the base on the slide. \n\"He never needed to touch the base because the umpire called him out,\" Torre said. \"You're correcting the umpire's mistake. In that situation, going to replay and they see the runner never touched the base, but the umpire called him out, by replay rules we can correct the situation and put the runner on the bag.\" \nTorre said Tejada was not subject to the protection of the \"neighborhood play\" which allows fielders to not touch the base but still be credited with the out. The throw Tejada received from second baseman Daniel Murphy took Tejada away from the bag. \n\"This wasn't a neighborhood play because spinning around and reaching for the ball and stuff like that,\" Torre said.  ", "external_links": [], "published": "2015-10-11T10:21:00.000+03:00", "crawled": "2015-10-11T11:01:02.080+03:00", "highlightTitle": ""}