{"organizations": [], "uuid": "2d1d9b3c647136eeed1052fd13625870b45bc333", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.brightonpittsfordpost.com", "main_image": "http://www.brightonpittsfordpost.com/storyimage/NU/20151026/NEWS/151029760/AR/0/AR-151029760.jpg", "site_section": "http://www.brightonpittsfordpost.com/sports?template=rss&mime=xml", "section_title": "Sports - Brighton-Pittsford Post", "url": "http://www.brightonpittsfordpost.com/article/20151026/NEWS/151029760/2000/NEWS?rssfeed=true", "country": "US", "title": "Pittsford Sutherland girls volleyball win on senior night", "performance_score": 0, "site": "brightonpittsfordpost.com", "participants_count": 1, "title_full": "Pittsford Sutherland girls volleyball win on senior night", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T15:34:00.000+02:00", "replies_count": 0, "uuid": "2d1d9b3c647136eeed1052fd13625870b45bc333"}, "author": "Submitted to the Post", "url": "http://www.brightonpittsfordpost.com/article/20151026/NEWS/151029760/2000/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "Pittsford Sutherland girls volleyball win on senior night", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Pittsford Sutherland girls volleyball win on senior night Comment By Submitted to the Post Brighton-Pittsford Post By Submitted to the Post Posted Oct. 26, 2015 at 8:34 AM By Submitted to the Post Posted Oct. 26, 2015 at 8:34 AM Junior varsity set the tone, and varsity followed suit, with two exciting wins over Penfield on Senior Night at Sutherland. Coach Lynne Allen’s squad remained unbeaten as they took the final two games from the Patriots 25-23 and 25-23 after losing the first game 25-19. Penfield sent an arsenal of shots over the net, but the Knights turned them back with 63 digs including 24 from Hannah Catello-Stooks, who earned player of the game honors. Sidra Morchower handed out 17 assists including 11 to Sophie Shemirani who had 6 kills and Cami Eder who had 5. The team had 10 aces, including four from Ronnie Hollenberg. Prior to the start of the varsity match, the seven seniors from Penfield were introduced and given flowers by a Sutherland player. The players being honored were Melanie Marsh, Andrea Green, Leah Sherman, Hope Shuman, Sarah Blowers, Aliah Bowllan and Andrea Allen. The 10-1 Patriots were firing on all cylinders and took the first game 25-18, but the never-say-die Knights fought back to win the next three games 25-20, 25-21 and 25-23 in front of a packed gymnasium. Sarah Blowers and Savvy Bothner led the hitting attack with 30 kills. Andrea Green added five kills and two blocks. Kieran Nanavati had five kills and Hope Shuman notched two kills. The defense was led by libero Aliah Bowllan, who had 29 digs. Andrea Allen also had 25 digs to go with her 40 assists. Blowers and Bothner combined for 32 digs, and Mary Bayer had a big night, contributing eight digs. The Knights traveled to West Irondequoit to face the Eagles with the league championship on the line and came away with three-game victory, 25-14, 25-23 and 25-21. The tandem of Blowers and Bothner accounted for 23 kills, five aces and 23 digs. Andrea Green had seven kills and two timely blocks. Freshman Kieran Nanavati continues to improve as she added six kills. Aliah Bowllan had another outstanding night with 28 digs, and Andrea Allen had the offense running smoothly with her 34 assists and 20 digs. The team heads to Webster Schroeder to take on the Warriors on their senior night. By Submitted to the Post Brighton-Pittsford Post By Submitted to the Post Posted Oct. 26, 2015 at 8:34 AM", "external_links": [], "published": "2015-10-26T15:34:00.000+02:00", "crawled": "2015-10-26T18:03:36.497+02:00", "highlightTitle": ""}