{"organizations": [], "uuid": "4c17799e89323d7bda9bb9df532c896b92db0d60", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.odt.co.nz", "main_image": "", "site_section": "http://www.odt.co.nz/sport/other/feed", "section_title": "Otago Daily Times: Other Sports News", "url": "http://www.odt.co.nz/sport/athletics/358949/athletics-smith-bounces-back-ankle-injury-win", "country": "NZ", "title": "Athletics: Smith bounces back from ankle injury to win", "performance_score": 0, "site": "odt.co.nz", "participants_count": 1, "title_full": "Athletics: Smith bounces back from ankle injury to win", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T19:27:00.000+03:00", "replies_count": 0, "uuid": "4c17799e89323d7bda9bb9df532c896b92db0d60"}, "author": "Robert van Royen", "url": "http://www.odt.co.nz/sport/athletics/358949/athletics-smith-bounces-back-ankle-injury-win", "ord_in_thread": 0, "title": "Athletics: Smith bounces back from ankle injury to win", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Athletics Hill Free Half Marathon winner Jonah Smith follows Neale McLanachan before taking the lead. Photo by Gregor Richardson. Jonah Smith bounced back from a niggly ankle injury to win the Hill Free Half Marathon at Outram yesterday. \nThe 20 year old had done little running since suffering tendinitis in his right ankle after finishing second in the Dunedin marathon last month, but crossed the line in 1hr 16min 8sec yesterday to win the half. \nHe sat behind Neale McLanachan for the first 19km, before the front runner dropped off the pace and settled for second in 1hr 16min 26sec. \nThe pair started out strong, running the first 10km at 1hr 13min pace. However, both slowed at the halfway mark despite near perfect conditions. \n''We both just slowed right down,'' Smith said after the race. \n''I didn't slow down as much as [Neale], put it that way, but neither of us were anywhere near our personal bests.'' \nSmith clocked a personal best 1hr 12min 24sec at the Christchurch event in May but was not expecting to threaten that coming off his ankle injury and a ''pretty bad cold''. \nThe Caversham runner hardly trained since picking up the injury, but did turn out at the third track and field meet of the season on Saturday. \nHe ran the 3000m at the Caledonian Ground to test out his ankle and get rid of some ''rust'', and decided to run the half marathon after coming through unscathed. \nSmith said his ankle was ''a lot better'' after yesterday's win, which bodes well for the track season. \n''At the moment I'm just going to get back into training for the Otago 10,000m championships in December,'' he said. \n''Between now and then, I have got a couple of months to refocus and get a bit of speed going for that.'' \nMel Aitken (38) continued her winning form, clocking 1hr 20min 52sec as she came home first female finisher. \nRather than looking exhausted after running 21.1km at a good clip, Aitken looked as though she had just completed a morning stroll through the Dunedin Botanic Gardens. \n''Yeah, happy enough,'' she said when asked about her performance. \n''I haven't done a half since April, so it's just nice to make sure you're still on par. This course is flat, but I never do a good time with it. So I'm very happy with that.'' \nAitken, who won the Dunedin marathon last month, is preparing for the Auckland marathon, which doubles as the national championships, on November 1. \nShe plans to run the 10km race at the Cromwell half marathon the week before to work on her speed. \nShell Cobby was the second woman across the line in 1hr 26min 58sec, good enough to win the women's open section. \nKen McDonald and Shireen Crumpton won the men's and women's 10km races respectively. \nMcDonald clocked 36min 32sec, while Crumpton, who finished second in the Dunedin half marathon last month, stopped the clock in 38min 21sec. \nCampbell Neilson (20min 16sec) and Kathryn Kennedy (19min 26sec) won the men's and women's 5km races. \nIncluding the children's race and walkers, almost 250 people competed in the annual event.", "external_links": [], "published": "2015-10-11T19:27:00.000+03:00", "crawled": "2015-10-12T05:02:10.006+03:00", "highlightTitle": ""}