{"organizations": [], "uuid": "970e84c3d42d84c56f848d62685ffa69ddc2134e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/49122596.cms", "site_section": "http://timesofindia.indiatimes.com/Sports/More-sports/Cycling/articlelist/3413195.cms", "section_title": "Cycling - More sports - Sports - The Times of India", "url": "http://timesofindia.indiatimes.com/sports/more-sports/cycling/Britains-Armitstead-wins-womens-world-road-race-title/articleshow/49122577.cms", "country": "IL", "title": "Britain's Armitstead wins women's world road race title", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "Britain's Armitstead wins women's world road race title - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-09-27T16:05:00.000+03:00", "replies_count": 0, "uuid": "970e84c3d42d84c56f848d62685ffa69ddc2134e"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/sports/more-sports/cycling/Britains-Armitstead-wins-womens-world-road-race-title/articleshow/49122577.cms", "ord_in_thread": 0, "title": "Britain's Armitstead wins women's world road race title", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "RICHMOND: Britain's Lizzie Armitstead outraced Dutch rival Anna Van der Breggen over the final 100 meters to win the women's road race crown Saturday at the World Road Cycling Championships.\nArmitstead trailed until a charge up the final climb and completed the 129.8km (80.6 miles) road course in 3hrs 23mins 56.00secs to defeat Van der Breggen by half a bike length with American Megan Guarnier third.\n\"It's a very special thing, a dream come true,\" Armitstead said. \"I just couldn't believe it.\"\nThe 26-year-old Commonwealth Games champion, who took a silver medal at the 2012 London Olympics road race, was in the peloton that chased down breakaways into the closing minutes.\nArmitstead moved to the right up the final climb and surged ahead on the final straight, getting into a sprint fight with Van der Breggen over the closing stretch as the crowd roared.\nThe English star took the rainbow jersey and wept as she realized she had claimed her long-sought first world road race title.\n\"I didn't get to celebrate,\" Armitstead said. \"I was going all the way to the line. I can't believe it. I'm so happy.\"\nVan der Breggen said she would change nothing about her final moves.\n\"It was a really good sprint, but Lizzie was fast,\" Van der Breggen said. \"You could smell the jersey and you go for the jersey.\n\"We had a good race. We have to be happy with it, but you are so close.\"\nGuarnier hung just behind Armitstead to reach the podium and book a berth at the Rio Olympics.\n\"Anytime Lizzie attacks it's going to put anybody in the hurt box,\" she said. \"I knew I had to stay on Lizzie's wheel if I wanted a shot at the podium.\"\nThe course featured repeating cobblestone climbs, a 200m test at Libby Hill and a shorter but steeper rise at 23rd Street, and a 300m climb just ahead of the final turn for the finish.\nNumerous solo riders made charges as the race wore on but none had an impact until Australia's Rachel Neylan broke ahead with 28km remaining and sparked the first multi-rider breakaway.\nNine riders charged ahead by 30 seconds with 24km remaining as several favorites lingered behind, stretching the margin to 60 seconds after the penultimate Libby Hill climb.\nThat was too much for Armitstead, who found little help for a charge and had to bide her time until the closing kilometers when the break pack faded.\n\"I had to be patient,\" she said. \"Thankfully other teams took it on.\"\nThe peloton reeled in the remnants of the lead pack on the penultimate climb, with Armitstead and training partner Tiffany Cromwell of Australia battling into the final climb.\nDutch rival Lucinda Brand raced in front and Armitstead countered to begin her run to victory.\n\"I'm still in shock,\" Armitstead said. It was a game really. I stuck to my plan.\"\nFrance's Pauline Ferrand-Prevot, the 2014 winner as well as reigning world cyclo-cross and mountain bike champion, was knocked over in an early crash but recovered to finish sixth. ", "external_links": ["https://play.google.com/store/apps/details?id=com.toi.reader.activities"], "published": "2015-09-27T16:05:00.000+03:00", "crawled": "2015-10-01T00:23:30.305+03:00", "highlightTitle": ""}