{"organizations": ["Boise State", "Utah State"], "uuid": "fc781e9e4ee194f68070322b4a1638c63a1e6241", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deseretnews.com", "main_image": "http://img.deseretnews.com/images/article/hires/1612316/1612316.jpg", "site_section": "http://www.deseretnews.com/sports/index.rss", "section_title": "Sports news and headlines for the Utah Jazz, BYU Cougars, Utah Utes and high schools, Salt Lake City sports, Utah sports  - Deseret News", "url": "http://www.deseretnews.com/article/865639263/Saturday-Morning-QB-Stars-and-stats-from-Utah-States-shock-over-No-21-Boise-State.html?pg=all", "country": "US", "title": "Saturday Morning QB: Stars and stats from Utah State's shock over No. 21 Boise State", "performance_score": 0, "site": "deseretnews.com", "participants_count": 0, "title_full": "Saturday Morning QB: Stars and stats from Utah State's shock over No. 21 Boise State", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T19:50:00.000+03:00", "replies_count": 0, "uuid": "fc781e9e4ee194f68070322b4a1638c63a1e6241"}, "author": "", "url": "http://www.deseretnews.com/article/865639263/Saturday-Morning-QB-Stars-and-stats-from-Utah-States-shock-over-No-21-Boise-State.html?pg=all", "ord_in_thread": 0, "title": "Saturday Morning QB: Stars and stats from Utah State's shock over No. 21 Boise State", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kent Myers"], "text": "“ It was amazing. Weve wanted to beat Boise State so bad since last year. We really wanted that revenge. We just have to battle it out, and thats what we came in here and did.” USU quarterback Kent Myers \nLOGAN — It had been said all week that Boise State’s offense would be the ultimate test for the Utah State’s defense. Well, the Aggies ’ passed with flying colors. \nIn the Broncos’ four games prior to Friday’s game, BSU outscored its opponents 204-24. In just one night, the Aggies more than doubled that number with a shocking 52-26 victory. \n“I don’t know if I have ever seen anything like that first half,” Utah State head coach Matt Wells said. “Hats off to our players. It was an unbelievable effort and an unbelievable win for this program.” \nScoring recap: \nBoise State drew blood first with a 46-yard field goal just a few minutes into the game. Little did the Broncos know that it would be their only lead of the night. Kent Myers connected a short pass to Wyatt Houston a few minutes later to snag the lead at 7-3. \nJake Thompson extended the Aggie lead with a 51-yard field goal. The USU scoring continued as Myers found Hunter Sharp for a touchdown with just under a minute to go in the first quarter to mark a 17-3 lead in the first. \nThe second quarter was the quarter that won the game. The powerhouse Aggie defense forced turnover after turnover, and the Aggie offense turned them into touchdown after touchdown. The Broncos punched in a touchdown with just over three minutes to play in the half to cut the gap to 24-10. \nThen came the Aggie explosion with three touchdowns in under a minute and a half. Myers bolted in a 39-yard run, Myers found Sharp on a 91-yard pass, and Marwin Evans returned an interception for 90-yards. \nThat was that. Maverik Stadium erupted as the Aggies hit the locker room at halftime with an unbelievable 45-10 lead. \nBoth teams scored a touchdown each in the third quarter before the Broncos put up a field goal and a rushing touchdown in the final quarter. \nUtah State’s seven-point second half didn’t matter because its 45-point first half more than sealed the deal. \n“It was amazing. We’ve wanted to beat Boise State so bad since last year. We really wanted that revenge,” Myers said. “We just have to battle it out, and that’s what we came in here and did.” \nUtah State’s three stars \nNick Vigil, LB \nDefensively, Vigil posted four solo tackles and 10 assisted tackles for a total of 14. Vigil also led the game with two sacks and 2.5 tackles for loss for 20 yards. \nAlong with forcing his second fumble of the season and the seventh of his career, Vigil recovered the first fumble of his career in the first half. \n“The defense played pretty well,” Vigil laughed. “We got a lot of turnovers, which was huge to give our offense opportunities in the red zone.” \nKyler Fackrell, LB \nFackrell’s 2.5 tackles for loss increase his TFL total to 10.5 on the season and 31.5 in his career. The senior linebacker recovered two fumbles and tacked on a season-high 11 tackles (four solo and seven assisted). \nMarwin Evans, SS \nEvans put up what was arguably the play of the game. The senior defensive back snagged the first interception of his career, and he returned 90 yards for his first career touchdown. \nAs if that wasn’t enough, Evans forced a fumble in the second quarter. \nAnalyzing the stats \nThe Aggies rushed for 197 yards to the Broncos’ 87; BSU had 299 receiving yards to USU’s 157; and both teams went 5 of 16 on third-down conversions. So, what was the difference? Turnovers. \nBoise State had eight turnovers to Utah State’s one. The Aggies forced two fumbles in the first quarter, two fumbles and three interceptions in the second quarter, and another forced fumble in the third quarter. \n“The key to the game was obviously those turnovers and turning them into touchdowns,” Wells said. “Both sides fed off each other’s energy and production. The stats are pretty even except for that one thing.” \nMyers is now 8-1 as the Aggies’ starting quarterback. The sophomore completed 17 of 24 passes for 157 yards and no interceptions. Myers also rushed for 76 yards, including a 39-yard touchdown. \nWho’s next \nMyers said the team will take 24 hours to enjoy their big win over Boise State, but then it’s on to San Diego State. \nThe Aztecs hold a 2-0 Mountain West record — the only undefeated team in the West Division — with their third conference game set to kick off Saturday at 7:30 p.m. PT at San Jose State. \nAfter launching the season with a massive 37-3 win over San Diego, the Aztecs suffered three-straight losses before picking up wins over Fresno State (21-7) and Hawaii (28-14). \n“This is obviously a huge win, but it means nothing if we don’t do anything the rest of the season,” Vigil said. “We still have a lot of work to do in the Mountain West, and we have another big opponent coming up in San Diego State.” \nThe Aggie-Aztec conference battle will begin next Friday, Oct. 23, at 8:30 p.m. MT at Qualcomm Stadium in San Diego. Related Stories USU launches its own space exploration Recommended Stories", "external_links": [], "published": "2015-10-17T19:50:00.000+03:00", "crawled": "2015-10-17T20:28:34.245+03:00", "highlightTitle": ""}