{"organizations": ["Cubs View Larger New York Mets", "Chicago Cubs", "Mets"], "uuid": "f51df9cf45f983957d2af15be544b7be4fe4653c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wftv.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/21/ca/8a/ebefe482bbf04f9f86b61e5ffdee0494-ec8b684098754d6a9d2fbbc0a7db0e76-0.jpg", "site_section": "http://www.wftv.com/feeds/categories/sports/", "section_title": "News | Sports", "url": "http://www.wftv.com/ap/ap/top-news/the-latest-banged-up-perez-a-ok-for-alcs-game-5/nn7CM/", "country": "US", "title": "The Latest: Mets jump to 4-0 lead over Cubs", "performance_score": 0, "site": "wftv.com", "participants_count": 0, "title_full": "The Latest: Mets jump to 4-0 lead over Cubs", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:47:00.000+03:00", "replies_count": 0, "uuid": "f51df9cf45f983957d2af15be544b7be4fe4653c"}, "author": "", "url": "http://www.wftv.com/ap/ap/top-news/the-latest-banged-up-perez-a-ok-for-alcs-game-5/nn7CM/", "ord_in_thread": 0, "title": "The Latest: Mets jump to 4-0 lead over Cubs", "locations": ["Chicago"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["J. Phillip", "Lucas Duda"], "text": "View Larger New York Mets' Lucas Duda is congratulated in the dugout after hitting a three-run home run during the first inning of Game 4 of the National League baseball championship series against the Chicago Cubs Wednesday, Oct. 21, 2015, in Chicago. (AP Photo/David J. Phillip) Sponsored Links By The Associated Press The Associated Press \nThe latest on the League Championship Series. The Toronto Blue Jays beat the Royals 7-1, sending the ALCS back to Kansas City for Game 6. The Mets can wrap up the NL's spot in the World Series with a win over the Cubs in Game 4 that started at 8:07 p.m. Here's a look at what's happening (all times EDT): \n8:34 p.m. \nIf the past is prologue, the Cubs may want to get a head start at cleaning out their lockers. \nFirst-inning jitters — and the Mets' home-run hitters taking advantage of them to build a lead — have gone a long way toward explaining why Chicago is down 3-0 in games. In what has become a disturbing pattern, back-to-back homers by Lucas Duda and Travis d'Arnaud off Cubs starter Jason Hammel put New York ahead 4-0 in the top half of the first. \nIf Cubs manager Joe Maddon has any tricks left up his sleeve, this might be a good time to start using them. His team went down quietly in the bottom half of the opening frame and Hammel was pulled for Travis Wood after walking the first batter he saw in the second inning. He was booed throughout his walk to the dugout by Cubs fans staring at a National League pennant drought that dates to 1945. \n___ \n7:33 p.m. \nFrom one T.C. to another: Mets coach Terry Collins has been getting encouragement from a New York coach who knows a thing or two about winning. \nThe Giants' Tom Coughlin has texted him several times during this run. \n\"I'm extremely impressed he would take the time,\" Collins said. \"He's got a lot going on his plate right now to take the time. But he called me when we won the division, congratulating me.\" \nHe has had a tough time reaching him because it's \"like getting through to the president when you call the Giants.\" But Collins did leave a message. \nThe two don't know each other. But they have some things in common, besides their initials. \nBoth have endured criticism. And if the Mets win the World Series, both will have led New York teams to championships. \n___ \n7:26 p.m. \nVeteran David Ross is starting at catcher for the Cubs. \nManager Joe Maddon said he decided to go with the right-handed hitting Ross over Miguel Montero with lefty Steven Matz starting for the Mets. He would also catch Jon Lester as he usually does in Game 5 Thursday if the Cubs extend the series. \nRoss is hitless in three at-bats over two playoff games after batting .176 during the regular season. Montero is 2 for 20 in the postseason. \n___ \n7:17 p.m. \nMarco Estrada pitched one-hit ball into the eighth inning, giving Toronto's tattered bullpen a rest and leading the Blue Jays over the Kansas City Royals 7-1 Wednesday to close to 3-2 in the American League Championship Series. \nToronto forced the series back to Kansas City, where Yordano Ventura will start for the defending AL champions on Friday against David Price in Game 6. \n___ \n6:50 p.m. \nRight-hander Marco Estrada left with a 6-1 lead after giving up back-to-back two-out hits in the eighth inning. \nRoyals catcher Salvador Perez homered into the right-field bullpen for Kansas City's first run of the game and Alex Gordon followed with a single. \nEstrada got a huge cheer and a standing ovation from the crowd of 49,325 as he was replaced by right-hander Aaron Sanchez. \nWith the Blue Jays facing elimination, Estrada allowed one run and three hits, struck out five and walked one. \nEstrada retired his first nine batters before Alcides Escobar singled to begin the fourth. Ben Zobrist followed by grounding into a double play. \nThe Royals didn't have another runner until Lorenzo Cain's two-out walk in the seventh. \n___ \n6:18 p.m. \nTroy Tulowitzki gave the Blue Jays a 5-0 lead with a three-run double off Kansas City's Kelvin Herrera, the only hit in Toronto's four-run sixth inning. \nEdinson Volquez walked Ben Revere starting the inning, then hit Josh Donaldson with a pitch. Jose Bautista ended a 10-pitch at bat by laying off a close 3-2 pitch that had the Royals bench upset at plate umpire Dan Iassogna's call. Edwin Encarnacion followed with a bases-loaded walk, bringing Herrera on in relief. \nAfter Chris Colabello struck out on three pitches, Tulowitzki lined the first pitch on one hop off the wall in left-center. \nBlue Jays right-hander Marco Estrada has allowed just one hit through his first six innings. \n5:32 p.m. \nMarco Estrada and Edinson Volquez are locked in quite a duel in Game 5 of the ALCS. Estrada has allowed one hit and faced the minimum through five innings. Volquez made one mistake and Chris Colabello sent it over the left-field wall for a 1-0 lead. The Game 1 winner, Volquez has allowed just three hits. \n___ \n5:05 p.m. \nAlcides Escobar, who else?, had the first hit off Blue Jays starter Marco Estrada, a groundball single past a diving shortstop Troy Tulowitzki leading off the fourth inning. Estrada then got Ben Zobrist to ground into a double play. Lorenzo Cain popped out to second to end the inning. \nEscobar entered Game 5 batting .600 in the series. \n___ \n4:55 p.m. \nBlue Jays starter Marco Estrada is perfect one time through the Royals' lineup, retiring all nine batters. Kansas City's Edinson Volquez has made only one mistake, and Chris Colabello hit it for a home run in the second. 1-0 Blue Jays in Game 5. \n4:45 p.m. \nRoyals first baseman Eric Hosmer made a fine over-the-shoulder catch in shallow right field to retire Edwin Encarnacion for the first out of the second inning in a scoreless Game 5 of the ALCS. \nHosmer made the catch right on the foul line with his back turned toward the infield. \nSeveral Royals players stood on the top step of the dugout and held their caps aloft to salute the catch. \nToronto's Chris Colabello followed with a ball no one could catch, hitting a solo homer to left-center off Edinson Volquez. It was the first hit by either team. \n___ \n3:45 p.m. \nIt's Oct. 21, 2015, the day Marty McFly traveled from 1985 to 2015 in \"Back to the Future II,\" and the Blue Jays were playing along. Just before the lineups were announced before Game 5, Huey Lewis and the News' \"The Power of Love,\" the song made famous in the first film of the series, played over the PA system. \nRoyals pitcher Jeremy Guthrie was photographed wearing a pair of sneakers that looked a lot like the self-lacing shoes that Michael J. Fox wore in the movie. \n___ \n3:11 p.m. \nOne loss away from elimination in the ALCS, the Blue Jays don't have $82 million catcher Russell Martin in the starting lineup against Kansas City's Edinson Volquez. \nDioner Navarro is behind the plate and batting seventh, because he's worked well with Toronto right-hander Marco Estrada. The pair teamed up in 20 of Estrada's 28 starts. \nMartin, who signed a five-year contract with Toronto last November. He hit .240 with a career-best 23 home runs and 77 RBIs this season. \nNavarro, who is in the final year of a two-year, $8 million deal, hit .246 with five homers and 20 RBIs in 54 games. \n___ \n1:10 p.m. \nRoyals catcher Salvador Perez has taken a beating this series, with fouls hitting off his mask, collarbone and one right below the Rawlings gold label — only for Gold Glove winners — on his chest protector, and that was just in Game 4. During the ALDS he even underwent concussion testing. \nBut Perez gave a broad smile when he sat down in the pregame interview room and blurted out, \"I feel great today, guys! Thank you very much.\" \n___ \n1:05 p.m. \nManager John Gibbons knows do-or-die games this year. His Blue Jays trailed the AL Division Series 2-0 then won three straight to advance. The task is more daunting now, trailing the Royals 3-1 in the best-of-seven set. But his club could look no further than its own history for some motivation: Toronto led Kansas City 3-1 in the 1985 ALCS and lost. \nGibbons said in his pregame talk, David Price, Aaron Sanchez, Roberto Osuna and even R.A. Dickey, who threw only 48 pitches Tuesday in Game 4, are all available. Copyright The Associated Press Sign up for our WFTV Morning News Headlines Newsletter Sign Up", "external_links": [], "published": "2015-10-22T03:47:00.000+03:00", "crawled": "2015-10-22T04:22:18.949+03:00", "highlightTitle": ""}