{"organizations": ["Sonora Police Department", "Columbia", "Mill Villa Road", "Confidence Mine Court"], "uuid": "bc939d6ef37513556096ef06f00a0b0af6341bec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.uniondemocrat.com", "main_image": "", "site_section": "http://feeds.feedburner.com/UnionDemocrat", "section_title": "The Union Democrat, Sonora, CA News, Sports, & Weather", "url": "http://www.uniondemocrat.com/index.php?option=com_content&task=view&id=117650&Itemid=190", "country": "US", "title": "News of Record for Sept. 30, 2015", "performance_score": 0, "site": "uniondemocrat.com", "participants_count": 0, "title_full": "News of Record for Sept. 30, 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T04:00:00.000+03:00", "replies_count": 0, "uuid": "bc939d6ef37513556096ef06f00a0b0af6341bec"}, "author": "", "url": "http://www.uniondemocrat.com/index.php?option=com_content&task=view&id=117650&Itemid=190", "ord_in_thread": 0, "title": "News of Record for Sept. 30, 2015", "locations": ["Nob Hill Circle", "Ridgewood Drive", "Lyons Bald Mountain Road", "Sonora", "North Arbona Circle", "Groveland", "Sanguinetti Road", "Soulsbyville", "Yerba Santa Drive", "North Palm Avenue", "East Bald Mountain Road", "Jamestown", "Airport Road", "Chihuahua", "Rialto", "Serrano Road"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Twain Harte", "Pauline Court", "William Carl Turnbull", "Gregory Lewis Stires", "Jerry Christopher Coey", "Roselyn Lane"], "text": "News of Record for Sept. 30, 2015 News of Record for Sept. 30, 2015 By Union Democrat staff September 30, 2015 01:00 am TUOLUMNE COUNTY The Sonora Police Department reported the following: SUNDAY 10:06 a.m., unwanted person — A man and woman were on a Sylvan Drive property yelling at each other continually for the past two days. 1:35 p.m., animal complaints — A Chihuahua was locked inside a black pickup truck parked in front of a Sanguinetti Road business. 5:52 p.m., threats — A man with a scraggly beard stopped a person’s vehicle on East Bald Mountain Road and began threatening, cursing and growling at them. MONDAY 1:49 p.m., suspicious circumstances — A man wearing white and turquoise swim trunks stared at an elementary school near Pauline Court for a while and then went down a nearby trail. 3:19 p.m., animal complaints — A large dog was left inside a red convertible parked in front of a West Stockton Street business. 3:52 p.m., animal complaints — A panting dog was seen inside a maroon vehicle parked in a Sanguinetti Road parking lot. 8:17 p.m., suspicious circumstances — A man was lying in the middle of North Arbona Circle underneath a light pole. The Sheriff’s Office reported the following: SUNDAY 12:33 a.m., Jamestown — A driver was pulled over for crossing the fog lines along Mill Villa Road while he was eating. 3:19 a.m., Jamestown — A Golf Links Road woman continuously heard a car door open and close. 6:25 p.m., Sonora area — A trailer on Sawmill Flat Road was burglarized. 10:08 p.m., Columbia — Someone banged on a woman’s Parrotts Ferry Road doors and windows. MONDAY 12:02 a.m., Sonora area — A person driving a brown-and-red-colored vehicle drove up and down Serrano Road multiple times. 3:41 a.m., Columbia — A man wearing only underwear was found on Airport Road during a patrol check. His wife told deputies that someone had began chasing them and while running away they passed through a lot of brush and took their clothes off to remove the stickers, and they went to the airport to get help. Deputies helped the man find his clothes and gave them a ride. 5:22 a.m., Big Oak Flat — A woman told a car full of men driving along Highway 120 to “stop casing stores” and that she had a gun. 8:45 a.m., Columbia — An iPad and laptop were stolen from a Sawmill Flat Road residence. 9:12 a.m., Twain Harte — When a Confidence Mine Court man confronted his neighbor about her erratic driving she said, “I don’t want to talk to you! Go on, get outta here! I’m running you out!” 9:31 a.m., Soulsbyville — A Hazel Avenue storage shop was broken into and a quad was stolen. 9:52 a.m., Jamestown — A Wigwam Road woman heard a man yelling for help. 11:46 a.m., Sonora area — A Ridgewood Drive residence was burglarized. 12:19 p.m., Sonora area — A woman received paperwork for a grant called “Gold Star Kids,” which she later realized was a scam. 12:28 p.m., Groveland — A set of keys, a cellphone and one shoe were found on Pine Mountain Drive. 4:31 p.m., Jamestown — Two transients were lying on the sidewalk by a Main Street park. 5:42 p.m., Sonora area — A Highway 49 storage unit was broken into. 6:43 p.m., Sonora area — A Yerba Santa Drive man used tools that he did not have permission to use. 6:52 p.m., Sonora area — A man trespassed on a Roselyn Lane property. 7:32 p.m., Columbia — A Green Street residence was broken into. 8:37 p.m., Sonora area — A person driving along Chaparral Road appeared to be casing houses. 9:03 p.m., Groveland — A woman was harassed via text message. 10:24 p.m., Twain Harte — Several teenagers were possibly drinking and causing damage to a Meadow Drive park. Felony bookings SUNDAY 1:10 p.m., Jamestown — William Carl Turnbull, 46, of the 18000 block of Highway 108, was booked on suspicion of false imprisonment and misdemeanor battery after an arrest on Highway 108. 3:15 p.m., Groveland — Gregory Lewis Stires, 50, of the 2000 block of North Palm Avenue, Rialto, was booked on suspicion of burglary after an arrest on Nob Hill Circle. 6:10 p.m., Sonora — Jerry Christopher Coey, 43, transient, was booked on suspicion of threatening with intent to terrorize after an arrest on Lyons Bald Mountain Road. MONDAY", "external_links": [], "published": "2015-09-30T04:00:00.000+03:00", "crawled": "2015-10-01T07:10:26.012+03:00", "highlightTitle": ""}