{"organizations": [], "uuid": "1d7a691964a76f512cd351f9385617412233e2d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/golf", "section_title": "Golf News, Leaderboard, Schedule, Photos, Videos - MSN Sports", "url": "http://www.msn.com/en-us/sports/golf/on-the-road-with-british-open-champion-zach-johnson/ar-BBmoB2A", "country": "US", "title": "On the Road With British Open Champion Zach Johnson", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "On the Road With British Open Champion Zach Johnson", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T03:00:00.000+03:00", "replies_count": 0, "uuid": "1d7a691964a76f512cd351f9385617412233e2d5"}, "author": "Zach Johnson", "url": "http://www.msn.com/en-us/sports/golf/on-the-road-with-british-open-champion-zach-johnson/ar-BBmoB2A", "ord_in_thread": 0, "title": "On the Road With British Open Champion Zach Johnson", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "On the Road With British Open Champion Zach Johnson Golf 9 hrs ago Zach Johnson © Golf Claret chug: The mood was festive on Johnson's and Spieth's flight home from St. Andrews. The Champion Golfer of the Year sounds off on flying home with the Claret Jug, living out of the back of a Dodge and his (caffeine-free) jet-lag cure.\nThere were a bunch of us on that jet heading back from St. Andrews: Jordan Spieth, Harris English, Jason Dufner, Billy Horschel. A moment like that can be surreal when I think about where I once was and where I am. You never know how long it's going to last, but I try to enjoy every moment.\nAdChoices Back in my mini-tour days , my house and my transportation were one and the same. My closet was the trunk of the green Dodge Intrepid that I drove everywhere, with my clubs stuffed in it and a bar that I hung my clothes from. On the rare occasions when I flew, I went economy and it felt like the ultimate luxury.\nMostly I deal with jet lag with a pretty basic formula: I work out on the day of my arrival, stay up as late as possible that first night and then, when it's time to crash, crash hard. I've never had a cup of coffee in my life. Not because I think I wouldn't like it. I'm afraid I'd love it.\nThe upside to traveling in more comfort is that it takes less of a physical toll and allows me to better enjoy my quality time. With my kids the age they are, that's my number-one priority.\nI've been lucky with my luggage . Once, at the 2007 British Open at Carnoustie, my clubs didn't show up till Wednesday. Overall, though, I've had the good fortune of never having to go without a fresh change of clothes.\nMy circumstances have changed , but at heart I'm still that midwestern guy. On the road, I don't really need, or even want, five-star amenities. I just want to feel like I'm at home.\nGo to MSN Home", "external_links": ["http://go.microsoft.com/fwlink/?LinkID=286759", "http://www.golf.com/"], "published": "2015-10-24T03:00:00.000+03:00", "crawled": "2015-10-25T02:52:11.497+02:00", "highlightTitle": ""}