{"organizations": [], "uuid": "c6a78b5895dc1fe42f084ee760af0d8d8dc7bf73", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtontimes.com", "main_image": "http://media.washtimes.com.s3.amazonaws.com/media/image/2015/10/18/c26e8f85d8302f2e850f6a706700046d.jpg", "site_section": "http://www.washingtontimes.com/rss/headlines/sports/", "section_title": "www.washingtontimes.com stories: Sports", "url": "http://www.washingtontimes.com/news/2015/oct/18/foleys-late-penalty-gives-australia-a-35-34-win-ov/", "country": "US", "title": "Foley's late penalty gives Australia a 35-34 win over Scots", "performance_score": 0, "site": "washingtontimes.com", "participants_count": 1, "title_full": "Foley's late penalty gives Australia a 35-34 win over Scots", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T20:17:00.000+03:00", "replies_count": 0, "uuid": "c6a78b5895dc1fe42f084ee760af0d8d8dc7bf73"}, "author": "JOHN PYE", "url": "http://www.washingtontimes.com/news/2015/oct/18/foleys-late-penalty-gives-australia-a-35-34-win-ov/", "ord_in_thread": 0, "title": "Foley's late penalty gives Australia a 35-34 win over Scots", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sports Foley’s late penalty gives Australia a 35-34 win over Scots Australia’s Drew Mitchell scores a try during the Rugby World Cup quarterfinal match between Australia and Scotland at Twickenham Stadium, London, Sunday, Oct. 18, 2015. (AP Photo/Frank Augstein) more > By JOHN PYE - Associated   \nLONDON (AP) - With the crowd booing, fuming Scotland players huddled within earshot, and with the Rugby World Cup ambitions of two countries balancing on his kick, Bernard Foley calmly landed a last-minute penalty goal that gave Australia a 35-34 win on Sunday. \nAustralia’s win, decided on a contentious penalty for offside awarded by referee Craig Joubert in a dramatic climax to the quarterfinals, ensured the semifinalists are all from the southern hemisphere for the first time. \nThe Wallabies will play Argentina, which thumped Ireland 43-20 hours earlier at Cardiff. \nDefending champion New Zealand faces South Africa - both teams have won the title twice. \nJoubert’s hasty departure from the field caused an outcry on social media, drawing harsh criticism not only from Scottish supporters but from former test players as well. \nFew figured Scotland, which placed last in the Six Nations and narrowly held off Samoa to finish second in Pool B, had a chance against the Wallabies, who were the form team of the pool stage with wins over England and Wales. But the Scots were Europe’s last hope in the tournament, and shook the Australians with their grit, their energetic ball carries and their physical presence at the breakdown. \nThe crowd of 77,110 was overwhelmingly backing the Scots, and it erupted when the Scots rallied to take a 34-32 lead five minutes from time when center Mark Bennett intercepted a pass and sprinted 30 meters untouched to score between the posts, and his inspirational captain Greig Laidlaw, converted it. \nHeading into the last minute, Scotland was penalized for offside as the loose ball bobbled around from a lineout, giving Foley the chance he needed to make amends for his three missed conversions in the first half. Despite the rain and the nerves, he nailed it. \n“That’s a penalty and that’s how it works - that’s life,” Australia coach Michael Cheika said on the field, to another chorus of boos and howls. “You’ve still got to kick it.” \nLaidlaw, who kicked five penalties and two conversions to keep Scotland in the game as Australia piled on five tries, was on the verge of tears after the match. \n“We’re one kick away from being in the semifinals of the World Cup, and arguably we should have been,” Laidlaw said. “It’s hard to take. It’s a very, very upset dressing room.” \nLaidlaw didn’t think Jon Welsh was offside at the end, arguing that replacement Australia scrumhalf Nick Phipps touched the ball after it went forward off Scotland’s Josh Strauss and was caught by Welsh. \nHe said he didn’t even think Joubert was certain of it, and said, “He made a sharp exit at the end of the game, that’s for sure.” \nThe match concluded a disruptive week for Scotland that included two players being suspended for three weeks before having their bans overturned and being recalled on match day. Early in the second half, winger Sean Maitland was yellow-carded for a deliberate knock-on when he appeared to be reaching for an intercept, another call that Scotland coach Vern Cotter described as “50-50.” \nThe Australians scored five tries, including a pair to veteran winger Drew Mitchell that took his career tally to 14 in the World Cup - one off the record - and others to Adam Ashley-Cooper, Michael Hooper and Tevita Kuridrani.", "external_links": [], "published": "2015-10-18T20:17:00.000+03:00", "crawled": "2015-10-18T22:50:31.667+03:00", "highlightTitle": ""}