{"organizations": [], "uuid": "a3d47412ad0d50233106903a985ba6ab2778a19e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.abqjournal.com", "main_image": "http://main.abqjournal.netdna-cdn.com/wp-content/plugins/journal-open-graph/img/albuquerque-journal.jpg", "site_section": "http://www.abqjournal.com/", "section_title": "Albuquerque and New Mexico News, Sports, Business and more | Albuquerque Journal News", "url": "http://www.abqjournal.com/653425/news/pac-spending-in-council-races-calls-into-question-public-campaign-financing-2.html", "country": "US", "title": "Outside groups spending big in City Council races", "performance_score": 0, "site": "abqjournal.com", "participants_count": 2, "title_full": "Outside groups spending big in City Council races | Albuquerque Journal News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T07:34:00.000+03:00", "replies_count": 1, "uuid": "bca7901fd1aeadcb1b576a326965d6ccab09f374"}, "author": "Dan McKay / Journal Staff Writer", "url": "http://www.abqjournal.com/653425/news/pac-spending-in-council-races-calls-into-question-public-campaign-financing-2.html#post-0", "ord_in_thread": 0, "title": "Outside groups spending big in City Council races", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Copyright © 2015 Albuquerque Journal\nCity Council candidates Pat Davis and Israel Chávez each received more than $36,000 in public money this year to finance their campaigns for office.\nAnd – with few exceptions – that’s all they’re allowed to spend.\nBut there could be much more spent to help them get elected, because both are supported by political committees that are raising private funds.\nDavis, in fact, could see another $32,000 spent in his favor this year, thanks to a committee headed by Richard Ellenberg, a former chairman of the Santa Fe Democratic Party.\nThat’s more than Davis’ two opponents have raised combined. Republican Hess “Hessito” Yntema has raised about $25,600 in private donations this year, and Democrat Sam Kerwin has about $2,300.\n“I see it as a huge conflict,” Yntema said Friday, the deadline for a new round of campaign finance disclosures. “The entire financing scheme this election has been suspect.”\nKerwin isn’t happy about it, either.\n“I think it raises serious questions about what debts are owed,” Kerwin said. “Who are these people?”\nUnder city election rules, which are consistent with U.S. Supreme Court decisions including a case called Citizens United, it’s legal for independent committees to raise and spend unlimited amounts of money to support a publicly financed candidate, as long they don’t coordinate with the candidate’s campaign.\nThat’s the case this year, the committees and the candidates they support say.\nDavis said the group working in his district – registered under the name Albuquerque Forward – provides a balance to the outside groups that have targeted him.\nAn anti-abortion group has targeted Davis with graphic mailers – one of which shows a woman lying naked, dead from an abortion, the caption says – but hasn’t registered with the city to report its activity. It calls Davis “too extreme” for the district.\nThe group behind the mailers, Protest ABQ, faces a preliminary ethics hearing scheduled for later this month on a complaint filed by an employee of ProgressNow, an advocacy group run by Davis.\n“Our current system is not able to hold them accountable” before the election, Davis said in an interview. “I think Albuquerque Forward is providing a balance to these outside groups in the race. The difference is, they’re playing by the rules.”\nEllenberg, chairman of Albuquerque Forward, said his group registered with the city like it’s supposed to and filed all of its reports. The committee is “proud to communicate” Davis’ position on the issues to voters in District 6, he said in a written statement.\nDavis himself, meanwhile, also faces an ethics complaint – over an unrelated issue in which he’s accused of improperly coordinating with ProgressNow.\nDavis says the complaint has no merit. It was filed by Michael A. Wartell, who said he supports Yntema but isn’t a campaign volunteer, and a preliminary ethics hearing is scheduled Oct. 20.\nOther race\nThe race involving Chávez, meanwhile, has had much more limited activity. An outside group supporting him, A New Direction for ABQ, reported about $3,300 in fundraising.\nChávez’s opponent, incumbent Republican Brad Winter, said he isn’t concerned.\n“We’ve had outside groups in a lot of different elections,” said Winter, who didn’t accept public financing and raised $41,000.\nChávez, for his part, said the committee is an independent group and there’s not much for him to say about it.\nA third political committee, funded by the SouthWest Organizing Project, a left-leaning advocacy group, also registered with the city and plans to run a telephone bank in the two council races. It had not yet reported any financial activity by Friday afternoon.\nBalance of power\nThe outcome of Tuesday’s city election could reshape the balance of power at City Hall.\nDemocrats now hold a 5-4 edge on the council. But Tuesday’s results could expand their edge to 6-3 – enough to override vetoes by Mayor Richard Berry, a Republican.\nOn the other hand, Republican victories could return the council to a GOP majority of 5-4.\nIn District 4, the incumbent, Winter, a longtime educator, has held the seat for 16 years, representing a conservative area in the Northeast Heights. His opponent, Chávez, is an outspoken progressive who works for Equality New Mexico, an LGBT advocacy and civil rights organization.\nThe District 6 seat – where Davis is running – is friendly ground for Democrats. It covers much of the university area, Nob Hill and the Southeast Heights.\nThere’s no incumbent in the race. Democrat Rey Garduño is retiring.\nChanges to come?\nNo matter the outcome, changes could be in store. Some councilors and candidates have said they would like to take a new look at the public financing system – in place since 2007 – and the enforcement of ethics violations.\nCourt challenges have chipped away at Albuquerque’s election rules over the years.\nPublicly financed candidates used to be eligible for matching funds, for example, if they were outspent by an opponent. And privately financed candidates used to be barred from accepting contributions from corporations or business entities.\nNeither rule is in place anymore.\nA similar debate over public financing played out in Santa Fe last year.\nJavier Gonzales, who won the mayor’s race, faced criticism after two political action committees and a national AFL-CIO affiliate came in to support him, spending nearly as much as the candidates each received in public funding.\nGonzales said he didn’t want and had nothing to do with the PAC support.\nCritical mailers\nAlbuquerque Forward has delivered mailers slamming Yntema. Some pieces say he’s backed by a “radical anti-abortion group” and the “Republican Money Machine.”\nAbout half of the group’s fundraising – $16,000 – has come from union groups.\nYntema, for his part, said he put out word that he preferred that Gov. Susana Martinez’s political organization, Susana PAC, avoid involvement in his race.\nAs for the graphic abortion mailers, Yntema, a lawyer, said he views abortion as a question of law – and it’s legal throughout most of a woman’s pregnancy.\nThe anti-abortion group is targeting Davis on its own, Yntema said.\nDavis, meanwhile, said the city should reconsider its election rules.\n“We still see these outside groups continuing day after day to spend whatever they want undisclosed to attack me and support Hess,” Davis said. “I think what it shows is the system is broken on all sides.”", "external_links": [], "published": "2015-10-03T07:34:00.000+03:00", "crawled": "2015-10-03T20:08:36.795+03:00", "highlightTitle": ""}