{"organizations": [], "uuid": "4c11310ef937d785212b5f1786450babae5c1918", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-56259b3a/turbine/ct-notre-dame-football-week-off-spt-1020-20151019", "site_section": "http://www.chicagotribune.com/services/chi-ct-college-rss,0,2899820.hyperlink", "section_title": "College Sports - Chicago Tribune", "url": "http://www.chicagotribune.com/sports/college/ct-notre-dame-football-week-off-spt-1020-20151019-story.html", "country": "US", "title": "Week off comes at right time for Irish, who are ready to hit the road", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Week off comes at right time for Irish, who are ready to hit the road", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T04:37:00.000+03:00", "replies_count": 0, "uuid": "4c11310ef937d785212b5f1786450babae5c1918"}, "author": "Paul Skrbina", "url": "http://www.chicagotribune.com/sports/college/ct-notre-dame-football-week-off-spt-1020-20151019-story.html", "ord_in_thread": 0, "title": "Week off comes at right time for Irish, who are ready to hit the road", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Week off comes at right time for Irish, who are ready to hit the road \nAll the action from Notre Dame Stadium. Paul Skrbina Contact Reporter Chicago Tribune Irish show their faces one last time before prime-time Halloween game vs. Temple. \nDefensive lineman Jerry Tillery bounced carefully on a trampoline while signing mini footballs and posing for selfies Monday night inside a gymnasium at North Side Middle School. \nTillery and the rest of his Notre Dame teammates made one final public appearance, on behalf of coach Brian Kelly's Kelly Cares Foundation, before hitting the road for home for the team's week off after Saturday's 41-31 victory against USC. \nThe 11th-ranked Irish (6-1) will take their show on the road for four of their final five games, starting with a prime-time matchup on Halloween against No. 22 Temple (6-0) at Lincoln Financial Field in Philadelphia. The national ABC broadcast is scheduled for a 7 p.m. kickoff, it was announced Monday. \nNotre Dame will be back in Pennsylvania the following week to face No. 25 Pittsburgh at Heinz Field. The Irish's final home game, Nov. 14 against Wake Forest, precedes trips to Fenway Park to play Boston College and Palo Alto, Calif., to take on No. 10 Stanford. \n\"Now we have to take that (mental toughness) and be road warriors,\" Kelly said. \"That's the next question. That's yet to be determined about how we're playing on the road.\" \nThe Irish are 1-1 with a two-point loss to Clemson and a last-second victory at Virginia. \nKelly hit the road Monday ahead of his players, traveling to Alabama for a luncheon before returning for the event in Elkhart. He said he and his staff will spend most of this week recruiting, including visits to Michigan and Florida. \nAs far as quarterback DeShone Kizer is concerned, the week off couldn't come at a better time, especially with two victories separating them from the 24-22 loss in Death Valley. Not to mention the bumps and bruises that could use some TLC. \n\"To take a loss in the middle of that stretch, it allowed us to re-evaluate and get us going into the bye week,\" Kizer said. \"We have a lot of confidence now.\" \nAnd, for the next week, some quiet.", "external_links": [], "published": "2015-10-20T04:37:00.000+03:00", "crawled": "2015-10-20T05:20:22.212+03:00", "highlightTitle": ""}