{"organizations": [], "uuid": "84e7865690cf9c01c2281c396066823e9e936978", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48531/sports", "section_title": "Sports - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30259121/universal-sports-network-to-become-tv-home-for-world-surf-leagues-big-wave-2015-16-season", "country": "US", "title": "Universal Sports Network to Become TV Home for World Surf League's Big Wave 2015 - 16 Season", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Universal Sports Network to Become TV Home for World Surf League's Big Wave 2015 - 16 Season - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "84e7865690cf9c01c2281c396066823e9e936978"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30259121/universal-sports-network-to-become-tv-home-for-world-surf-leagues-big-wave-2015-16-season", "ord_in_thread": 0, "title": "Universal Sports Network to Become TV Home for World Surf League's Big Wave 2015 - 16 Season", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " World Surf League\nNetwork and WSL Announce Distribution Agreement\nLOS ANGELES , Oct. 14, Universal Sports Network and the World Surf League (WSL) announced today a distribution agreement to air the 2015-16 WSL Big Wave Tour, bringing the world's biggest surfing events direct to fans in the United States . The deal gives the year-round home to Olympic, endurance and action sports programming exclusive TV Everywhere broadcast rights and event re-broadcast rights during the upcoming WSL Big Wave season which opens October 15, 2015 .\nComprised of seven potential event sites across three continents, the WSL's Big Wave Tour tests the physical and mental skills of 24 of the best big wave surfers. Competition dates are scheduled for windows when the weather and surf are expected to combine to produce giant waves, 25-feet tall and higher, and events are given a \"Green Alert\" with only 72-hours' notice, adding to the anticipation for both the athletes and fans.\nThrough the partnership, Universal Sports will air the following four Big Wave Tour events either live or on delay during the October 15, 2015 – February 28, 2016 competition window:\nOregon Challenge ( Lincoln City, Oregon ) Punta Galea Challenge (Punta Galea, Spain ) Pe'ahi Challenge ( Haiku, Hawaii ) Todos Santos Challenge (Todos Santo, Mexico ) In addition, Universal Sports will air encore presentations of other WSL Big Wave events including the 2014 Billabong Pico Alto ( Pico Alto , Peru ) and 2015 Quiksilver Ceremonial (Punta de Lobos , Chile ) in preparation for the upcoming season later this month.\n\"The World Surf League's Big Wave Tour features the best big wave surfers in the world,\" said Universal Sports Network SVP of Digital Media and Strategic Partnerships Edward Derse. \"We look forward to showing these courageous and skilled athletes as they compete on some of the ocean's most awesome backdrops and iconic waves for our audience to experience.\"\n\"We are honored to partner with Universal Sports Network to bring the exhilaration of Big Wave surfing to millions in America,\" said Peter Mel , former Big Wave World Champion and Commissioner of the WSL's Big Wave Tour. \"The BWT is extremely excited that this deal gives us the opportunity - conditions permitting - to broadcast four heart-pounding Big Wave events to millions of fans, especially the Pe'ahi Challenge in Hawaii .\"\nPe'ahi - commonly known as \"Jaws\" - is widely regarded as the most challenging big wave in the world.\nUniversal Sports Network is the premier multi-platform media destination of year-round Olympic, endurance and action sports programming. The network is available nationwide on DIRECTV, DISH, Time Warner Cable, Bright House Networks, Cox Communications, Verizon FiOS, CenturyLink Prism, and numerous regional cable and IPTV operators in markets across the country. To find Universal Sports by zip code, please visit universalsports.com .\nAbout Universal Sports Network\nUniversal Sports Network, a partnership between NBC Sports and InterMedia Partners, LP, is the premier multi-platform media destination for Olympic-related sports programming in the United States. Offering more than 1,200 hours of original programming each year, Universal Sports has exclusive rights to world and national championship events in a wide array of sports, including swimming, track and field, gymnastics, cycling, skiing, figure skating and rugby. Whether on television, online, or on the go with mobile and tablet applications, Universal Sports offers a four-screen experience to fans of global sports every day of the year. For more information, please visit UniversalSports.com .\nAbout The World Surf League (WSL)\nThe mission of the WSL is simple: to inspire positive change for surfing, our fans and the environment. Formerly the Association of Surfing Professionals (ASP), the WSL has been championing the world's best surfing since 1976, running global products across the Samsung Galaxy men's and women's Championship Tours, Big Wave Tour, Qualifying Series, Junior and Longboard Championships, as well as the WSL Big Wave Awards. The League possesses a deep appreciation for the sport's rich heritage while promoting progression, innovation and performance at the highest levels; it strives to put the world's best surfers on the world's best waves.\nShowcasing the world's best surfing on its digital platform at WorldSurflLeague.com, the WSL has energized an already-passionate global fan base with millions around the world tuning in to see the likes of Kelly Slater, Filipe Toledo, Gabriel Medina, Makua Rothman, Grant \"Twiggy\" Baker, Greg Long , Stephanie Gilmore, John John Florence, Carissa Moore and others do battle in the most dynamic field of play in all of sports. For more information, please visit www.worldsurfleague.com .\n releases/universal-sports-network-to-become-tv-home-for-world-surf-leagues-big-wave-2015--16-season-300159455.html\n ", "external_links": ["http://www.worldsurfleague.com/", "http://www.xmlnews.org/ns/", "http://universalsports.com/tv-listings/channel-finder/", "http://rt.prnewswire.com/rt.gif?NewsItemId=CG27441&Transmission_Id=201510141100PR_NEWS_USPR_____CG27441&DateId=20151014", "http://www.prnewswire.com/news-releases/universal-sports-network-to-become-tv-home-for-world-surf-leagues-big-wave-2015--16-season-300159455.html", "http://universalsports.com/"], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-14T19:08:05.888+03:00", "highlightTitle": ""}