{"organizations": ["NFL"], "uuid": "1651e056d07b7f8119b4634cc639dc0933b7e29e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestreet.com", "main_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/giantspats_600x400.jpg", "site_section": "http://news.google.com/news?hl=en&gs_rn=0&gs_ri=serp&tok=8AfznjItXar1mg6jgdkyIw&ds=n&pq=facebook&cp=13&gs_id=5j&xhr=t&q=yahoo+-sports&newwindow=1&gl=us&bav=on.2,or.r_gc.r_pw.r_cp.r_qf.&bpcl=39468505&biw=1366&bih=643&um=1&ie=UTF-8&output=rss", "section_title": "yahoo -sports - Google News", "url": "http://www.thestreet.com/story/13335784/1/yahoo-is-in-desparete-need-of-a-lifeboat-but-is-the-nfl-the-answer.html", "country": "IL", "title": "Yahoo! Is In Desparete Need of a Lifeboat, But Is the NFL the Answer? - TheStreet.com", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "Yahoo! Is In Desparete Need of a Lifeboat, But Is the NFL the Answer? - TheStreet.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T16:48:00.000+03:00", "replies_count": 0, "uuid": "1651e056d07b7f8119b4634cc639dc0933b7e29e"}, "author": "", "url": "http://www.thestreet.com/story/13335784/1/yahoo-is-in-desparete-need-of-a-lifeboat-but-is-the-nfl-the-answer.html", "ord_in_thread": 0, "title": "Yahoo! Is In Desparete Need of a Lifeboat, But Is the NFL the Answer? - TheStreet.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Reprint \nThe National Football League has a chance to rescue Yahoo! ( YHOO - Get Report ) , and it couldn't come soon enough. It just depends on what the company will do with the partnership. \nYahoo!'s third-quarter earnings landed like a thud this week, laying bare the Internet portal's many problems and challenges. On Sunday, though, Yahoo! has a chance for redemption, and maybe even a bump to its share price, when it broadcasts from the London the NFL's first live worldwide streaming of a league game at 9:30 A.M. EST. \nMost importantly, it's for free. No need to have a subscription to NFL Ticket or a pay-TV operator. Free. Of course, the game features two of the NFL's weaker teams, the Buffalo Bills and the Jackson Jaguars, but it's still likely to be a well-watched event. \nFor the NFL, the game brings the league closer to strengthening its international footprint. For Yahoo!, it offers a chance for advertising and an audience, especially one that craves to someday cut the cable. \n\"There is probably no greater media property or cultural entity with equity out there than the NFL, especially this time of year,\" said Mike Wiese, head of content and entertainment at J. Walter Thompson , an international advertising agency. \"This is something that will have an immediate audience... Yahoo! gets overlooked here domestically. Globally it's a platform the world knows.\" \nYahoo! reaches a billion monthly users so it would make sense that the game would attract a large audience and in response, ad revenue. In a phone interview, Yahoo senior vice president of video, design and emerging offerings, Adam Cahan said the company is \"delighted by advertiser demand\" so far. Earlier this week, Yahoo! said it had sold out on ads for the live stream. \nHowever, it's not clear how much advertisers paid for the stream time, but it's unlikely it amounted to a profit for the company. Estimates from Business Insider and The New York Times say Yahoo! paid at least $20 million for the game. \n\"It's a real money loser for Yahoo!,\" said Eric Jackson, founder and managing member of Ironfire Capital and writer for TheStreet . \"A badly thought-out exercise because they paid $20 million for the rights to stream and are paying CBS to produce the game.\" \nJackson says he thinks the game has potential for Yahoo! to continue working with live streaming opportunities, but the management team isn't there to see it through. \nThe company's third quarter earnings fell below analyst's and the company's forecasts. As a result, a number of sell-side analysts lowered Yahoo!'s price target. Shares for the company fell sharply after the results were announced on Tuesday. \nYahoo! and NFL have stressed that the live stream game is a trial run and they're hoping to collect data, especially on how many viewers tune in from outside the U.S. The early morning time slot in the states is the middle of the day in Europe and in the evening over in Asia, both more convenient times for people who sleep in on the weekends. \n\"The kind of content that people want to watch isn't restricted to just U.S. audiences. I think the NFL knows this,\" said Wiese. \"Football is probably the benchmark of what an international sporting experience can do... From a financial standpoint, I think that's where you'll find the greatest success, with a global reach.\" \nYahoo! has a chance to garner a new audience and possibly continue the streaming streak but only as long as they don't drop the ball. \n\nThis article is commentary by an independent contributor. At the time of publication, the author held TK positions in the stocks mentioned. Check Out Our Best Services for Investors \nPortfolio Manager Jim Cramer and Director of Research Jack Mohr reveal their investment tactics while giving advanced notice before every trade. Product Features:", "external_links": [], "published": "2015-10-23T16:48:00.000+03:00", "crawled": "2015-10-23T22:08:27.558+03:00", "highlightTitle": ""}