{"organizations": ["Coconino High School Football", "Glendale Prep", "Mingus Union", "Glendale Prep Academy", "Cougars", "Cowboys", "Valley Union", "Badgers"], "uuid": "17ded4f01a0aa0eb52d1e7c0ee8f3b4eb67b4d5e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "dcourier.com", "main_image": "http://dcourier.com/SiteImages/Article/150416a.jpg", "site_section": "http://www.dcourier.com/2_rss.xml", "section_title": "The Daily Courier RSS Feeds: Sports", "url": "http://dcourier.com/Main.asp?SectionID=2&SubSectionID=2&ArticleID=150416", "country": "US", "title": "Prep Football Games, Week 6: Prescott takes on Coconino", "performance_score": 0, "site": "dcourier.com", "participants_count": 0, "title_full": "Prep Football Games, Week 6: Prescott takes on Coconino", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T10:01:00.000+03:00", "replies_count": 0, "uuid": "17ded4f01a0aa0eb52d1e7c0ee8f3b4eb67b4d5e"}, "author": "", "url": "http://dcourier.com/Main.asp?SectionID=2&SubSectionID=2&ArticleID=150416", "ord_in_thread": 0, "title": "Prep Football Games, Week 6: Prescott takes on Coconino", "locations": ["Mathern Field", "Bagdad", "Fredonia", "Camp Verde H.S.", "Flagstaff", "Spring Valley", "Coconino", "Pima", "Glendale", "Chino Valley", "Cromer Stadium"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Bradshaw Mountain", "Mingus", "Dalton Mills", "Prescott", "Barry Goldwater", "Doug Cook", "Bradshaw"], "text": "Prep Football Games, Week 6: Prescott takes on Coconino High School Football - Week 6Friday, Oct. 2 Prescott (4-1) at Coconino (3-3)7 p.m. at Cromer Stadium in Flagstaff Division III No. 27-ranked Prescott, winner of three straight games, opens Section VIII action tonight at No. 39 Flagstaff Coconino.The Panthers, who have played inconsistently so far this season, defeated Barry Goldwater, 55-34, at home Friday, Sept. 25, after consecutive blowout losses in weeks 3 and 4.But the Badgers are trending the other way - gaining confidence and out to prove that they're a section title contender. Prescott has the edge in this one.  Bradshaw Mtn. (4-1) at Mingus Union (4-1)7 p.m. at Bright Field in Cottonwood Two-time defending section champion Bradshaw Mountain has beaten Mingus each of the past two years, and tonight's contest to begin D-III, Section VIII play has the makings of a barnburner.The D-III No. 9-ranked Bears, who are riding a four-game winning streak, registered their first convincing victory of the 2015 season versus Thunderbird Sept. 25, at home, scoring 21 points off three Chiefs turnovers in the first half en route to a 38-13 rout.The No. 22 Marauders, who've won two straight, are champing at the bit to try and upset Bradshaw. When the Bears limit their penalties and ignite their high-octane offense, they're tough to beat. Mingus' defense will be ready, though. Pick 'em.  Chino Valley (2-3) at Camp Verde (1-4)7 p.m. at Camp Verde H.S. in Camp Verde The Division 5 No. 30-ranked Cougars should be favored to win this rivalry game tonight at No. 32 Camp Verde in their D-V, Section III opener - and that's saying something.Chino Valley has won two in a row after the program had struggled mightily through a 13-game losing streak dating back to a winless 2014.Camp Verde's lost four of its first five games in 2015 and owns a 1-2 mark at home. Over the past five years, Chino is 3-2 against the Cowboys. Keep this in mind: The Cougars haven't had a three-game winning streak since 2009. Now's the time.  Fredonia (1-4 overall, 0-2 section) at Mayer (2-3, 0-2)7 p.m. at Mathern Field in Spring Valley On Homecoming, it's make-or-break time for Division VI No. 18 Mayer, which has lost its first two Section I games.Expect the Wildcats to return to the win column tonight in this sectional match-up versus a struggling Fredonia team that's on a four-game slide and ranked No. 26.  Bagdad (5-1 overall, 1-0 section) at Glendale Prep (4-1, 1-0)7 p.m. at Glendale Prep Academy field in Glendale Both D-VI No. 4-ranked Bagdad and No. 8 Glendale Prep were on the receiving end of wake-up calls in Week 5.The defending D-VI runner-up Sultans lost a regular-season game for the first time in 2-1/2 years after a gut-wrenching 40-38 setback to No. 1 Pima. Meanwhile, No. 3 Valley Union roughed up Glendale Prep, 54-6.Bagdad coach Dalton Mills will have his Sultans firing on all cylinders in this Section III tilt tonight.- Doug Cook, Daily Courier", "external_links": [], "published": "2015-10-02T10:01:00.000+03:00", "crawled": "2015-10-02T11:14:24.392+03:00", "highlightTitle": ""}