{"organizations": [], "uuid": "cadbd937c5399d0ef4148cb24d6d77b97cde8d51", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.times-herald.com", "main_image": "http://content.times-herald.com/nthv2/img/fb-promo-def.jpg", "site_section": "http://feeds.times-herald.com/rss/sports", "section_title": "The Times-Herald > Sports", "url": "http://www.times-herald.com/Sports/20151011-SPORTS-MSFootball", "country": "US", "title": "Evans, Lee advance to this week’s semifinals", "performance_score": 0, "site": "times-herald.com", "participants_count": 0, "title_full": "Evans, Lee advance to this week’s semifinals", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T09:20:00.000+03:00", "replies_count": 0, "uuid": "cadbd937c5399d0ef4148cb24d6d77b97cde8d51"}, "author": "", "url": "http://www.times-herald.com/Sports/20151011-SPORTS-MSFootball", "ord_in_thread": 0, "title": "Evans, Lee advance to this week’s semifinals", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Lee", "Evans"], "text": "Evans, Lee advance to this week’s semifinals Sunday, October 11, 2015 Comments \nEvans and Lee football teams advanced to Wednesday’s semifinal round of the Coweta County Middle School Athletic League football playoffs following victories last week. \nDefending champion Lee picked a perfect time to pick up its first win, upsetting Arnall 16-12 and avenging a loss to the Knights during the regular season. \nEvans also moved on to the Final Four by shutting out Smokey Road 13-0. The Cougars defeated the Wildcats for the second time in as many weeks to keep their season alive. \nThis week’s semifinal games find top seeds East Coweta and Madras hosting opponents. The Indians will welcome Evans while Lee travels to play the Eagles. \nBoth of Wednesday’s kickoffs are at 5 p.m. The semifinal winners will meet on Tuesday, Oct. 20, at the high- est remaining seed’s high school field of choice. \nA pair of two-point conversions by Antino Hogan made the difference in last week’s win for Lee. The Wolves opened their scoring on Timothy Johnson’s 15-yard run in the second quarter. \nQuarterback Michael Corbitt then connected with receiver Jeremiah Freed on a 20-yard touchdown pass in the third quarter. \nEvans’ defense shut down Smokey Road despite being shorthanded due to injuries. Will Harper, Justin Adcock and Jaren Whithurst played on both sides of the ball due to missing teammates, playing nearly every snap of the game. \n“We played excellent and fought through extreme adversity,” said Evans Joach Joshua Cyprian. “We played not only as a team, but as a family.” \nThe Cougars’ defense also came up with a key fumble recovery by E.J. Harris that set up a Evans’ first touchdown of the game. \nAfter a scoreless first quarter, Evans converted off the turnover on Michael McGinnis’ two-yard run. Punter Grant Whitaker, who also had an extra point in the victory, helped keep Smokey Road in poor field position during the game, pinning the Wildcats inside their 10-yard line. \nA 6-0 lead carried through halftime before the Cougars added an insurance score in the third quarter on Bryson Moss’ 60-yard touchdown run. \nCOUGARS 13, WILDCATS 0 \nSmokeyRoad 0 0 0 0 —0 \n2nd Quarter \nE — Michael McGinnis 2 run (Grant Whitaker extra point) \n3rd Quarter \nE — Bryson Moss 60 run More", "external_links": [], "published": "2015-10-11T09:20:00.000+03:00", "crawled": "2015-10-11T23:38:29.864+03:00", "highlightTitle": ""}