{"organizations": [], "uuid": "690208cf2d1eeb8a6180f8bcd18d2030984882c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kctv5.com", "main_image": "http://kctv.images.worldnow.com/images/601550_G.JPG", "site_section": "http://kctv5.com//category/208603/sports?clienttype=rss", "section_title": "KCTV Kansas City - Sports", "url": "http://www.kctv5.com/story/30190118/frank-whites-biggest-worry-about-the-royals", "country": "US", "title": "Frank White's worries about the Royals", "performance_score": 0, "site": "kctv5.com", "participants_count": 1, "title_full": "Frank White's worries about the Royals - KCTV5", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T19:14:00.000+03:00", "replies_count": 0, "uuid": "690208cf2d1eeb8a6180f8bcd18d2030984882c9"}, "author": "Neal Jones, News Producer/Editor", "url": "http://www.kctv5.com/story/30190118/frank-whites-biggest-worry-about-the-royals", "ord_in_thread": 0, "title": "Frank White's worries about the Royals", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "KANSAS CITY, MO (KCTV) - There we sat, surrounded by the kind of stuff Royals fans would kill to see, touch and savor. Two framed Royals jerseys are on the wall, just above the Rawlings Gold Glove award.  World Series bats sit in a rack on the opposite wall. There is a replica miniature statue of our host sitting on a nearby table. The actual statue sits inside Kauffman Stadium.\nWhile the star of the show doesn't even notice all these things, KCTV5 photographer Greg Milota and I are like kids in a candy store. We're both dying to just take it all in, like an art lover at the Louvre. But we're here to work. We're here to ask Royals Hall of Famer Frank White about this Royals team. (Greg's also here for an autograph, but that's another story!)\nKCTV5 Sports Director Michael Coleman's on his way here for a sit-down interview with one of baseball's greatest second baseman, but Greg and I can't wait to ask Frank his thoughts.\n\"What's your biggest worry about this Royals team, heading into the playoffs?\" I ask. \nHe doesn't hesitate. \"Pitching. Starting pitching,\" he answers.\n\"Even though they've all been good, they've had their tough times in the past few weeks,\" he continues. \"I have confidence that the top four guys they put out there, (Yordano) Ventura, (Johnny) Cueto, (Kris) Medlen and (Edinson) Volquez all have the ability to go out there and throw that gem that you need, but at the same time, they all have the ability to implode too.\"\nImplode.\nNot a pretty word.\nWhite's not smiling. Greg looks like he wants to cry. If Frank notices our stricken expressions, he doesn't show it. \"This team's been built around pitching and defense,\" he says. \"They need good pitching.\"\nLike hundreds of thousands of other Royals fans, Greg and I are hoping this Royals team can give us another October ride for the ages. Last year, many of us were just thrilled to see the Boys in Blue in the postseason. The World Series run was just icing on the cake.\nNot this year.\nAfter building the American League's best record, we want more. In fact, we want it all.\nSo does Frank White. His basement is filled with mementos from his two World Series appearances. He knows how special playing on baseball's biggest stage is for a player. He likes this team's attitude.\n\"I think the guys are pretty relaxed,\" he says. \"They learned a valuable lesson last year.\"\nWhite, and his Royals teammates learned the same lesson in 1976, when they made their first playoff appearance.\n\"The experience of making the playoffs in 1976 helped us the next year, when we won over one-hundred games,\" the six-time gold glove winner said, \"And I think last year's experience will help this Royals team. I think their initial approach going in will be, 'we've been there, we know what the atmosphere's like. We can handle that crowd noise.'\"\nWhile White likes the make-up of this Royals team, he is concerned about the loss of Omar Infante at second base.\n\"He and Alcides Escobar really give the Royals great defense, and while (Ben) Zobrist gives them a great bat, the shortstop and second baseman need to be used to playing with each other. They need to know exactly what the other guy's going to do in each situation. they lost that when they lost Infante to injury.\"\nWhite really loves the addition they made to this year's team in designated hitter Kendrys Morales, whom he managed in winter league ball.\n\"That guy can hit. He gives them some pop,\" White smiles. \"This year's team can play long-ball more than last year's club.\"\nBut it still comes back to starting pitching.\n\"Ventura gives us the best track record of consistency going in, so it wouldn't bother me to see him start game-one, but everyone else, you just sit there and look at them like, 'they're good pitchers, but not great pitchers. Let's hope they have a good day.'\"\nAs Greg and I pack up our TV gear, we take one last look around. Frank's basement is truly a wonder to behold. Over his 18-year career, he won just about every honor a player can win, including a World Series championship. Proof of his success is all around us.\nFrank White and his teammates were special players who came together to form a special team- a championship team.\nLast year's Royals team followed in their footsteps, and we Royals fans are hopeful that this year's ball club can do the same thing.\nLike Frank said, it will probably come down to pitching.\nGreg, Michael and I came to Frank White's house for an interview, but we also wanted some reassurance that this year's Royals can take us all on another magical playoff ride.\nWhat we got instead was a glimpse into greatness, Frank's greatness, and the greatness of those old Royals teams. We also got a dose of truth.\nFrank's truth: Playing baseball is hard. Playing championship baseball takes more than good hitting and pitching, it takes greatness.Sometimes, it takes luck.\nWe know the Royals are talented. But will they be lucky.\nGood luck, great pitching and defense can overcome anything.\nFrank's basement walls are proof of that.\nYou can see Frank's interview about this Royals team on the KCTV5 special, Taking the Crown , Wednesday evening at 6:30.\nCopyright 2015 KCTV (Meredith Corp.) All rights reserved", "external_links": [], "published": "2015-10-05T19:14:00.000+03:00", "crawled": "2015-10-06T01:20:18.135+03:00", "highlightTitle": ""}