{"organizations": [], "uuid": "4c0dd26c0fe297f314e666824a881c5398c99845", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www2.ljworld.com", "main_image": "http://worldonline.media.clients.ellingtoncms.com/img/croppedphotos/2015/10/01/goodcrop_t800.jpg?90232451fbcadccc64a17de7521d859a8f88077d", "site_section": "http://www2.ljworld.com/rss/headlines/sports/ku/", "section_title": "LJWorld.com stories: KU sports", "url": "http://www2.ljworld.com/news/2015/oct/02/ku-looking-few-good-d-linemen/", "country": "US", "title": "KU looking for a few good (D-line)men", "performance_score": 0, "site": "ljworld.com", "participants_count": 1, "title_full": "KU looking for a few good (D-line)men", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T08:23:00.000+03:00", "replies_count": 0, "uuid": "4c0dd26c0fe297f314e666824a881c5398c99845"}, "author": "Benton Smith", "url": "http://www2.ljworld.com/news/2015/oct/02/ku-looking-few-good-d-linemen/", "ord_in_thread": 0, "title": "KU looking for a few good (D-line)men", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Benton Smith — Lawrence Journal-World October 2, 2015 \nAdvertisement \nKansas University’s football coaching staff knew entering Year One of a difficult rebuilding project the Jayhawks would have deficiencies in a number of areas this season. They thought — and hoped — defensive end would be one position KU could count on for depth and productivity. \nThrough three games, however, head coach David Beaty hasn’t seen the amount of sacks and tackles for loss he envisioned the defensive ends providing. \nSenior captain Ben Goodman rarely has let Kansas down. His 3.5 sacks tie him with Kansas State’s Jordan Willis for the fourth-best mark in the Big 12, and Goodman’s 4.5 tackles for loss rank eighth in the conference. \nBut KU had just five sacks from its defense against three nonconference opponents. KU’s 1.67 sacks a game ranks eighth in the Big 12 — slightly ahead of West Virginia’s 1.33 and Texas Tech’s 0.75 — entering Saturday’s league opener at Iowa State (11 a.m. kickoff). \nIdeally, KU wants its defensive line creating pressure in the backfield so it doesn’t have to send a fifth or sixth defender and put young defensive backs on islands. \n“Really, that group, I think they are taking it personally,” Beaty said of the defensive ends, coached by Calvin Thibodeaux. “They understand they have higher aspirations than what they have played with to this point. And for us to be to where we need to be, those guys got to continue to get better — just like the rest of them — but they really do.” \nDefensive coordinator Clint Bowen pointed out fourth-year juniors Anthony Olobia and Damani Mosby, former junior-college standouts who line up on the other end from Goodman, remain relatively inexperienced. Obviously, the same goes for true freshman Dorance Armstrong, who hasn’t played as much. So that’s one reason Olobia has four total tackles (none for negative yardage), Mosby has three tackles (one for a loss of 14 yards versus Memphis) and Armstrong one tackle (for a five-yard loss vs. South Dakota State). Bowen thinks the learning curve has hit them particularly hard. \n“You feel good about them in terms of spring ball and all of that, but BCS football, when it’s the real game, things change a little bit,” Bowen said. “And you’ve gotta realize those kids, they’ve played three BCS football games in their life, and it’s a different level. It’s a different level when the guy across from you is all the sudden 6-(foot)-8, 350 (pounds) and can move a little bit, as opposed to what you played against in the past.” \nBeaty wants more production out of Olobia and Mosby, in particular, because he isn’t satisfied with KU’s eight total tackles for loss. Defensive tackle Corey King has one and fellow senior DT Kapil Fletcher was credited with 0.5. \nGoodman said all of KU’s defensive linemen need to make more “special” plays on running and passing downs. \n“We definitely need more sacks and more production out of each of us,” the 6-3, 253-pound senior added, “because we haven’t gotten a win, and teams have been running the ball. So that starts up front.” \nThe Jayhawks haven’t created enough disruption at the line of scrimmage to put opponents in many third-and-long scenarios. Beaty said the only way they can fix that is through fundamentals and repetition. When coaches have reviewed game video, they’ve noticed KU failing to keep a low pad level. Many times, the ends’ stances are limiting their effectiveness. \n“One of the things that creates negative-yardage plays is great explosion, great blow delivery up front, and we’re working at it,” Beaty said. “We’ve got a lot of young guys up front. We have a couple of older dudes, but there’s a lot of those young dudes that are playing. And they are having to learn that you’ve got to be able to play low to high, and I think that will start creating some more situations where we can create TFLs.”", "external_links": [], "published": "2015-10-02T08:23:00.000+03:00", "crawled": "2015-10-02T09:24:08.565+03:00", "highlightTitle": ""}