{"organizations": [], "uuid": "5d5f619c99055ea27dd90cc519a57f2bca5e3db1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fox14tv.com", "main_image": "http://KOAM.images.worldnow.com/images/8986500_G.jpg", "site_section": "http://www.fox14tv.com/", "section_title": "Fox 14 News - FOX 14 TV Joplin and Pittsburg News Weather Sports |", "url": "http://www.fox14tv.com/story/30229586/neighbors-react-to-12-year-olds-death", "country": "US", "title": "Neighbors React to 12-Year Old's Death", "performance_score": 0, "site": "fox14tv.com", "participants_count": 1, "title_full": "Neighbors React to 12-Year Old's Death - FOX 14 TV Joplin and Pittsburg News Weather Sports |", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T07:02:00.000+03:00", "replies_count": 0, "uuid": "5d5f619c99055ea27dd90cc519a57f2bca5e3db1"}, "author": "Tim Spears", "url": "http://www.fox14tv.com/story/30229586/neighbors-react-to-12-year-olds-death", "ord_in_thread": 0, "title": "Neighbors React to 12-Year Old's Death", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "JASPER, MISSOURI - As police still piece together what led a 13-year old boy killing a 12-year old girl in Jasper, MO., neighbors are still doing the same.\nOn a road named Placid.. Thursday night was anything but.\n\"It's always surprising and shocking to hear something like that,\" said Ron Wright; who knew many of the first responders flooding the street Thursday night, when 12-year old Teresa Potts was shot and killed.\nWright himself has grandchildren not much older.\n\"I know I'd feel terrible if my kids.. if something like that happened to them,\" Ron said. \"But I don't know.. you don't ever know what's going to happen to someone to make them do something like that.\"\nHis son Tony lives one mile south of Placid Rd. He was eating dinner with his family when officials arrived on the scene.\n\"We saw about half a dozen deputies sheriffs cars go by with lights and sirens,\" Tony said. \"And that's unusual out in this area.\"\nHe said he heard of problems at the Potts home\n\"And that sheriffs department had been out here making visits before,\" Tony said. \"I didn't know for sure what it was, but they don't come out to here for no reason.\"\nBut both say in more than 20 years, nothing like this has happened in the rural area\n\"I guess I'm more shocked than anything,\" Tony said. \"Nobody expects this thing to happen anywhere. especially in a place like this. Wouldn't anticipate a shooting of this kind.\"\n\"Just happens I guess,\" Ron said. \"Don't know how to do anything about it.\"\nWhen asked, the family of the victim declined to comment on the situation.", "external_links": [], "published": "2015-10-10T07:02:00.000+03:00", "crawled": "2015-10-10T21:54:04.282+03:00", "highlightTitle": ""}