{"organizations": [], "uuid": "56f28d20ea28b1aea378c7f571a95500a777ed6f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "http://www.bostonherald.com/sites/default/files/media/ap/8fa84d03fd0e4260ae51bf35b4d270ab.jpg", "site_section": "http://bostonherald.com/sports/golf", "section_title": "Sports: Golf | Boston Herald", "url": "http://bostonherald.com/sports/golf/2015/10/alison_lee_xi_yu_lin_share_lead_in_lpga_malaysia", "country": "US", "title": "Alison Lee, Xi Yu Lin share lead in LPGA Malaysia", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "Alison Lee, Xi Yu Lin share lead in LPGA Malaysia | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "56f28d20ea28b1aea378c7f571a95500a777ed6f"}, "author": "Associated Press", "url": "http://bostonherald.com/sports/golf/2015/10/alison_lee_xi_yu_lin_share_lead_in_lpga_malaysia", "ord_in_thread": 0, "title": "Alison Lee, Xi Yu Lin share lead in LPGA Malaysia", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "KUALA LUMPUR, Malaysia — Alison Lee shot a 6-under 65 on Thursday for a share of the first-round lead in the LPGA Malaysia, the first tour event since her emotional Solheim Cup debut.\nLee birdied five of the first eight holes at Kuala Lumpur Golf and Country Club, and added birdies on Nos. 12 and 14. The 20-year-old UCLA student bogeyed the par-3 17th and — after rain and lightning delayed play more than three hours — got up-and-down for par on the par-4 18th.\nIn the Solheim Cup last month in Germany, Lee was left in tears after Suzann Pettersen called for the American to be penalized for picking up her ball when she mistakenly thought a short putt had been conceded in the completion of a fourballs match. Infuriated, the U.S. rallied to beat Europe in the biggest comeback in event history, with Lee winning her singles match.\nChina's Xi Yu Lin matched Lee at 65.\nMichelle Wie was a stroke back along with defending champion Shanshan Feng, Yani Tseng and Chella Choi. Wie had eight birdies and three bogeys. Feng dropped out of a tie for the lead when she three-putted the final hole for her lone bogey.\nTop-ranked Inbee Park, the 2012 winner, was tied for 10th at 68. She won two majors this year and is tied with second-ranked Lydia Ko for the tour victory lead with four.\nKo had a 71. The 18-year-old New Zealander is coming off consecutive victories in the Canadian Women's Open and Evian Championship, where she became the youngest major champion.\nPettersen opened with a 77. The Norwegian star had a double bogey and four bogeys.\nThe event is first of five straight in Asia. The LPGA KEB Hana Bank Championship is next week in South Korea, followed by stops in Taiwan, China and Japan.", "external_links": [], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T14:23:46.344+03:00", "highlightTitle": ""}