{"organizations": ["Boston College"], "uuid": "6ac5095d908d53582f5f86c0320e0017a41c27a6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wralsportsfan.com", "main_image": "http://wwwcache.wralsportsfan.com/asset/colleges/duke/2015/10/03/14945659/2015ncsufbvlville12-728x485.jpg", "site_section": "http://www.wralsportsfan.com/news/rss/697/", "section_title": "Sports Fan stories from WRAL.com", "url": "http://www.wralsportsfan.com/talking-points-pack-fail-test-heels-resilient/14946478/", "country": "US", "title": "Talking Points: Pack fails test, Heels resilient", "performance_score": 0, "site": "wralsportsfan.com", "participants_count": 0, "title_full": "Talking Points: Pack fails test, Heels resilient", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T15:49:00.000+03:00", "replies_count": 0, "uuid": "6ac5095d908d53582f5f86c0320e0017a41c27a6"}, "author": "", "url": "http://www.wralsportsfan.com/talking-points-pack-fail-test-heels-resilient/14946478/", "ord_in_thread": 0, "title": "Talking Points: Pack fails test, Heels resilient", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Duke", "Joe Ovies"], "text": "Duke downs Boston College 9-7 By Joe Ovies \n1. NC State started their year with four dominating wins, fantastic individual performances, talk of being an ACC Atlantic Division sleeper and a bunch of \"yeah, but...\" from pundits. \n\"Yeah, but they played an easy non-conference schedule.\" \n\"Yeah, but the Wolfpack hasn't played a Power 5 team.\" \n\"Yeah, but NC State hasn't been tested.\" \n\"Yeah, but do we really know anything about this team?\" \nThe Pack had an opportunity to shut that sort of talk down on Saturday against Louisville, a chance to prove something with a win against a team in their weight class. Instead, NC State was an unrecognizable mess compared to their September swagger and literally fumbled away a highly attainable victory. \nStart with the crucial turnovers. Wide receiver Jumichael Ramos' fumble on the Louisville 4-yard line ended up as a touchdown on the subsequent drive. Running back Matt Dayes, a workhorse in the first month of the season, fumbled late in the third quarter just as NC State looked as though it was establishing rhythm. \nWhile it would be easy to blame weather conditions, Louisville has been an opportunistic team all season with 10 turnovers gained coming into the game. The Wolfpack couldn't create the same breaks. \nThrow in first-half miscues like penalties and the inability to stop the Cardinals quarterback Lamar Jackson on third down, and NC State simply put themselves in a disadvantage. Worse, the offense looked tight against a real defensive line that could stop the run and an opposing coaching staff who knew what to expect out of dynamic play-makers like Jaylen Samuels. \nNC State's disappointing conference opener simply puts the Wolfpack back in the same place it was last season – looking like a decent team, but unable to execute the little things necessary to consistently beat other good football squads. \nThey'll get another chance to shush the \"yeah, but...\" on Friday night against Virginia Tech. overheard on the walk back one nc state player talking to his mom after the loss: 'gonna wake up get me some popeye's and forget about it' — martin rickman (@martinrickman) October 3, 2015 \n2. If North Carolina took their cue from social media after they found themselves down three touchdowns early in the second quarter, they would've logged off and gone about their day. Fans were done, and who could blame them? Nobody wanted to watch another disastrous trip to Atlanta. \nBut the Tar Heels didn't quit, rallying from from 21 points down to beat Georgia Tech 38-31. They pulled of their largest comeback in Carolina history, their first win in A-Town since 1997 and gave head coach Larry Fedora a much needed signature win. \nNorth Carolina's victory also solidified why Marquise Williams should be and will continue to be the starting quarterback in Chapel Hill. Some of his throws can be questionable, but there is no denying his ability to move the Tar Heels and put points on the board. Williams rushed for a career-high 148 yards, scored two touchdowns and caught the go-ahead touchdown from wide receiver Quinshad Davis. \nWhile it's easy to get caught up in QB talk, the real difference against the Yellow Jackets occurred with second-half defensive adjustments. Sophomore linebacker Cayson Collins came up big with a crucial forced fumble and key tackles. The Tar Heels also kept Georgia Tech from widening their 28-24 lead with a huge goal-line stand. \n3. If you like defensive football, y'all would've loved Duke's win over Boston College . It had everything you wanted, from clutch field goals to strategic punts. It was the sort of game where a complete pass was a big deal. SIRENS REGGAETON HORNS WE HAVE A COMPLETED BOSTON COLLEGE PASS AND IT WAS A GOOD ONE OUT TO THE BC 34-YARD LINE — Lauren Brownlow (@lebrownlow) October 3, 2015 \nDuke kicker Ross Martin, along with another great defensive performance, was the difference in Durham. And who knows, maybe it'll be the difference in the Coastal Division. The Blue Devils are in serious contention to pull off a trip to Charlotte for the second time in three years. \n4. Let me be up front about my disdain for discussions about officiating. The refs are human, we have to accept they won't catch everything, and blathering on about the injustices of wrong calls typically obscures the real reasons why teams win or lose. \nThat being said, there were some bad games called by ACC officials on Saturday, and I'd love to see how the home office in Greensboro graded out crews in Raleigh and Atlanta. \nIf you thought you knew what constituted holding in football, think again! If you enjoy laborious reviews over seemingly easy decisions, the ACC has you covered! Throwing false start flags well after a timeout was called? Sure, why not! Spotting the ball and measurements? Close is good enough! — Jason Knott (@jasonmknott) October 3, 2015 \nM.C. Escher is impressed with the optical trick of a visible chain link next to a football resulting in a first down. \n5. Following Virginia Tech's 17-14 home loss to Pitt, there will be some tough conversations about head coach Frank Beamer in the coming week. Today's crowd of 49,120 smallest at Lane Stadium since expansion. Had 42,452 for Rutgers in 1998. #Hokies — David Teel (@DavidTeelatDP) October 3, 2015 #Hokies 2-8 in last 10 home games versus FBS opponents. — David Teel (@DavidTeelatDP) October 3, 2015 #Hokies ' 100 yards today fewest since 60 against Clemson in Frank's first game as coach -- 1987. — David Teel (@DavidTeelatDP) October 3, 2015 #Hokies ' 9 rushing yards today fourth-lowest of Beamer Era. — David Teel (@DavidTeelatDP) October 3, 2015 Brief postgame w/players. Terse postgame w/media. As salty as I've seen Beamer since Orange Bowl beatdown from Stanford. — David Teel (@DavidTeelatDP) October 3, 2015 \n6. Ohio State and Michigan State squandered all the goodwill and positive perception of the Big Ten this season with uninspiring wins over Indiana and Purdue. Or did they? \nI'm curious to see how the College Football Playoff committee and the national media handle the Buckeyes. They might get the benefit of the doubt as a defending national champion, which is typically how it works, or they'll get the 2014 Florida State treatment. Judging by how Kirk Herbstreit spent a chunk of ESPN's GameDay saying Ohio State would still be No. 1 if you stripped away the preseason positioning, my guess is it'll be the former rather than the latter. \nI bring this up to illustrate how it really doesn't matter what the ACC does, folks have decided it is the worst Power 5 conference. They'll pick and choose what to highlight. \nFor instance, Clemson can beat Notre Dame, but everyone was too busy drafting their tired \"Clemsoning\" tweets and columns as the Irish mounted a comeback (you know, like good teams do). Instead of looking at Miami's loss to Cincinnati on Friday as an individual indictment of a program that has gone 84-58 overall since joining the ACC, it's easier to make a lazy joke about the conference. \nAfter the SEC, which is at the very least the most competitive conference in college football, everyone else is largely indistinguishable. It's not a fun discussion that'll get sports radio calls going or message boards worked into a lather, but it is what it is. Credits", "external_links": [], "published": "2015-10-04T15:49:00.000+03:00", "crawled": "2015-10-04T16:29:53.387+03:00", "highlightTitle": ""}