{"organizations": [], "uuid": "a77e0b37253b36885353d063c7d852b553041ec4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nytimes.com", "main_image": "http://static01.nyt.com/images/2015/10/14/nytnow/rugby15/rugby15-facebookJumbo.jpg", "site_section": "http://www.nytimes.com/services/xml/rss/nyt/GlobalSports.xml", "section_title": "NYT > International Sports", "url": "http://www.nytimes.com/2015/10/15/sports/rugby/argentina-rugby-world-cup-pumas-attacking-style.html?partner=rss&emc=rss&_r=0", "country": "US", "title": "On Rugby: Argentina’s Pumas Impress With New Offensive Flair", "performance_score": 0, "site": "nytimes.com", "participants_count": 1, "title_full": "On Rugby: Argentina’s Pumas Impress With New Offensive Flair", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T13:17:00.000+03:00", "replies_count": 0, "uuid": "a77e0b37253b36885353d063c7d852b553041ec4"}, "author": "EMMA STONEY", "url": "http://www.nytimes.com/2015/10/15/sports/rugby/argentina-rugby-world-cup-pumas-attacking-style.html?partner=rss&emc=rss&_r=0", "ord_in_thread": 0, "title": "On Rugby: Argentina’s Pumas Impress With New Offensive Flair", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Argentina’s Pumas Impress With New Offensive Flair By EMMA STONEY Supported by Photo Julián Montoya of Argentina scoring one of Argentina's nine tries in its 64-19 victory over Namibia. Credit Harry Engels/Getty Images \nAdvertisement WELLINGTON, New Zealand — For those who have not followed Argentina’s development in the Rugby Championship, its ambitious and attacking style of play at the Rugby World Cup might come as a surprise. In fact, it is a style that the Pumas have been developing over the past four years. “Last year we started playing more attacking rugby. It was good for us. It’s the type of rugby we have to play in order to develop our team,” Argentina scrumhalf Tomás Cubelli said earlier this year. The need for Argentina to change from its set-piece oriented, conservative style — which many of its players were used to at their clubs in France and England — was highlighted after the Tri-Nations competition was expanded in 2012 to include Argentina and renamed the Rugby Championship. The three Tri-Nations teams — Australia, New Zealand and South Africa — played much more open rugby, and Argentina knew it would have to adapt to stand a chance against its higher-ranked opponents. Graham Henry, who led New Zealand to the World Cup title in 2011, was brought in as a technical adviser for the Pumas. His first goal was simple: improving the players’ basic skills so they could play an all-around game mixing both offense and defense. The Pumas have always had a formidable scrum that could match up with the best in the world and a ferocious defense, but they were also a team that struggled to build sustained attacks because their ball-handling skills often were subpar. Quite often instead they relied on individual brilliance. But that is now much less the case. The players’ skill levels improved dramatically under Henry and Argentina’s former coach, Santiago Phelan. But more importantly, under current Argentina Coach Daniel Hourcade, there has also been a shift in mind-set. No longer does Argentina just want to restrict the number of points scored against them — the players seem confident enough to want to challenge defenses by keeping the ball and playing a more wide-open game. It has not always been a smooth transition, something that Cubelli acknowledged in July before a Rugby Championship match against New Zealand in Christchurch. “Maybe we were not ready to take the risk in the first two years,” Cubelli said. “Taking the risk we were maybe knowing that some games we were not going to get the results that we want. “We were not used to attacking, and we attacked a lot and lost the ball, and that was difficult for us. Now we’re getting a balance in our game.” In those first two years the players, especially those coming from European club rugby, did find it difficult when they faced the more attack-minded teams of New Zealand and Australia and, to a lesser extent, South Africa. In 2012 and 2013 the Pumas did not win a game in the Rugby Championship. Their best result was a 16-16 draw against South Africa in 2012, while the following year they suffered heavy losses to South Africa and Australia as fatigue took its toll on players who were based in Europe but had to play tests in the Southern Hemisphere. (In comparison, nearly all the national team players for Australia, New Zealand and South Africa compete in Super Rugby, so the tests are not at the end of a long domestic season for them and the strain from travel is far less.) \nAdvertisement", "external_links": [], "published": "2015-10-14T13:17:00.000+03:00", "crawled": "2015-10-15T00:12:32.523+03:00", "highlightTitle": ""}