{"organizations": ["Ducks", "San Jose Sharks"], "uuid": "e9132ab7df495a0ddd38f3b17256824d1f9b1418", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ocregister.com", "main_image": "http://images.onset.freedom.com/ocregister/gallery/nw2g52-ducks.know.1011.jpg", "site_section": "http://ocregister.com//common/rss/rss.php?catID=18901", "section_title": "The Orange County Register - News Headlines : Sports", "url": "http://www.ocregister.com/articles/nip-687037-sharks-ducks.html", "country": "US", "title": "Sharks nip Ducks: What you need to know - The", "performance_score": 0, "site": "ocregister.com", "participants_count": 0, "title_full": "Sharks nip Ducks: What you need to know - The Orange County Register", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "e9132ab7df495a0ddd38f3b17256824d1f9b1418"}, "author": "", "url": "http://www.ocregister.com/articles/nip-687037-sharks-ducks.html", "ord_in_thread": 0, "title": "Sharks nip Ducks: What you need to know - The", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Here’s what you need to know about the Ducks’ 2-0 loss to the San Jose Sharks on Saturday night:\nTHE GAME IN 140 CHARACTERS OR FEWER \n- Someone had to break up the goaltending show Frederik Andersen and Martin Jones was putting on. The Sharks' Patrick Marleau did so twice.\nQUOTE OF THE NIGHT \n“The positive is we know how hard we have to work. It’s a game where they worked from beginning to end. We had spots where we were gliding. We can’t afford to do that.”\n- Ducks coach Bruce Boudreau on his team’s performance in defeat.\nSTAT OF THE NIGHT \n- Ducks captain Ryan Getzlaf was strong in the faceoff circle with 14 wins in 21 draws but played a largely passive game for the most part. Getzlaf wasn’t particularly strong with the puck and finished with a minus-2 rating.\nPLAYER OF THE GAME \n- Apparently the 36-year-old Patrick Marleau still has some game. His days as the Sharks’ captain are long gone but Marleau had a game-high seven shots on goal and the only two goals. He had just 19 last season, his lowest over an 82-game slate since 2007-08.\nANALYSIS \n- Maybe there is something to the Sharks already having one game – and one rousing win over the Kings – under their belt as Andersen said afterward but the Ducks didn’t match San Jose’s tenacity or persistence following an effective first 10 minutes. Both goalies were on but the Sharks didn’t allow themselves to get frustrated and stuck to their system. Meanwhile, the Ducks started to scramble too much in the defensive end and allowed Jones to see most of the pucks they fired at him.\nKEY MOMENT \n- The Ducks made Sharks goalie Martin Jones work in the second period, forcing him a few tough stops among his 15 saves. They failed to build on that in the third as they were outshot 17-3. And when Marleau slipped a wraparound shot Frederik Andersen’s pads with 4:50 left, that was essentially that.\nANY NEWS? \n- The experiment of keeping longtime linemates Getzlaf and Perry apart last for 2 &frac12; periods. Getzlaf and Perry were together early on but only for a few seconds as Getzlaf was at the end of a long shift. Boudreau put the two back together with Carl Hagelin in the third, looking to generate offense with the Ducks down a goal.\n- Four Ducks made their official debut. Kevin Bieksa played 24:26 and had four blocked shots. Shawn Horcoff and Mike Santorelli combined for three shots on goal, while Santorelli had a late hooking penalty. Chris Stewart had two shots on goal but was moved to the fourth line in the third.\nMORE POSTGAME QUOTES \nBRUCE BOUDREAU\n(on Marleau’s second goal …)\n“Well, it’s deflated a little bit. When it’s a 1-0 game, even if you’re having trouble scoring, you know one shot is all it’s going to take to get the game tied. When it’s 2-0 and their goalie’s playing the way he is, it gets in your head a little bit.”\n(on the Sharks controlling the third period …)\n“I don’t know if that’s the benefit of already playing a game or not. They’re a good hockey club over there.”\n(on the Corey Perry -Rickard Rakell-Jiri Sekac line …)\n“They had the most chances I would think. I changed at the last 10 minutes, thinking that it might get a spark with [Corey] going back with Getzlaf. Those are things you try to do when you’re down a goal and you don’t see too much offense being poured in.”\nFREDERIK ANDERSEN\n(on his play …)\n“I felt good. Saw the puck well. What I worked on this summer, I could tell improvement in my game already. I think that’s a good sign. Still a lot of work to do.”\nPETER DeBOER\n(on his first home opener as San Jose coach …)\n“It was a great hockey game. It was a great game to coach, to be a part of and great for the fans. There were two big teams going at it and great goaltending.”\n(on whether the Sharks made a statement by opening with wins over the Kings and Ducks …)\n\"I think a statement was made that the Sharks are back and we're for real this year. We talked about it through training camp. We're only two games in but we played two tough teams. I think our game is getting better every day. I think the guys are feeling good about what we're doing. We just have to keep moving forward with that.” \n\nPOSTGAME NOTES \n• The Ducks went 32-for-58 in the faceoff circle with Ryan Kesler winning 12 of 20 draws in addition to Getzlaf’s strong night there.\n• Only two penalties were called in a tightly-contested game that had a number of post-whistle scrums. San Jose captain Joe Pavelski was whistled for boarding the Ducks’ Rickard Rakell in the first and Ducks winger Mike Santorelli served two minutes for hooking late in the third.\n• Hampus Lindholm played a game-high 25:16 for the Ducks.\n• In addition to the 44 shots they had on goal, the Sharks had 20 more blocked and attempted 12 others. The Ducks had 57 total attempts.\n• The Sharks out-hit the Ducks, 31-22. Mike Brown had a game-high eight. Andrew Cogliano led the Ducks with four.\n• Jakob Silfverberg led the Ducks with four shots on goal. Jiri Sekac and Cam Fowler each had three.\n• San Jose’s Marc-Edouard Vlasic played in his 672 nd game, moving him past Mike Rathje into first among defensemen in franchise history.\nDUCKS’ RECORD/STANDING \n0-1-0 (0-1-0 on road), tied for fifth place in Pacific Division\nWHAT’S NEXT? \n- The Ducks play Vancouver in their home opener on Monday at Honda Center at 7 p.m.", "external_links": [], "published": "2015-10-11T03:00:00.000+03:00", "crawled": "2015-10-11T22:31:42.542+03:00", "highlightTitle": ""}