{"organizations": [], "uuid": "951c4d6f9a8bc132bb171624eb234befcda18d96", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.beaumontenterprise.com", "main_image": "http://ww1.hdnux.com/photos/41/51/75/8822600/3/rawImage.jpg", "site_section": "http://www.beaumontenterprise.com/sports/hs/collectionRss/Sports-HS-Heds-8127.php", "section_title": "Sports HS Heds", "url": "http://www.beaumontenterprise.com/sports/hs/article/Lockhart-enjoying-record-setting-season-6580188.php", "country": "US", "title": "Lockhart enjoying record-setting season", "performance_score": 0, "site": "beaumontenterprise.com", "participants_count": 1, "title_full": "Lockhart enjoying record-setting season", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T09:00:00.000+03:00", "replies_count": 0, "uuid": "951c4d6f9a8bc132bb171624eb234befcda18d96"}, "author": "David Thompson", "url": "http://www.beaumontenterprise.com/sports/hs/article/Lockhart-enjoying-record-setting-season-6580188.php", "ord_in_thread": 0, "title": "Lockhart enjoying record-setting season", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Close Image 1 of 1 Ivan Lockhart runs past a Buna defender in a game earlier this season. Lockhart has broken two school rushing records this season and has his sights set on two more. Ivan Lockhart runs past a Buna defender in a game earlier this season. Lockhart has broken two school rushing records this season and has his sights set on two more. Photo: Hale Hughes 1 / 1 Back to Gallery \nWoodville running back Ivan Lockhart had his doubts about suiting up for the 2015 football season. \nAfter falling short of his own lofty expectations a year ago, and suffering through a nagging hamstring injury and a concussion, Lockhart - a four-sport athlete - gave thought to dropping football. \nBut that thought was quickly erased after Lockhart received words of encouragement from his teammates. \n\"My team told me they needed me,\" Lockhart said. \"That's all I needed to hear.\" \nLockhart is off the best start of his career this season, having set two school records - longest touchdown run (96 yards against Joaquin) and most touchdowns in a game (5 against New Waverly). \nNow, Lockhart, who has rushed for 1,061 yards and 15 touchdowns thus far, is closing in on a couple of more records owned by Adam Rigsby and Malcolm Lewis . Rigsby holds the Eagles' single-season rushing record with 1,333 yards set in 2007, while Lewis' 17 touchdowns in 2005 is most in school history. \n\"Woodville is a great community and just to be known as someone who has done something great here, is a big accomplishment for me,\" Lockhart said. \"I never thought I'd be the one to do something like this.\" \nEagles second-year coach Mike Waldie isn't surprised by Lockhart's success. \n\"He's a kid who can go to the house on any play,\" Waldie said. \"But if you watch him, he runs very well over his pads and can run over people. Sometimes you have power backs, scat backs or just speed guys, but Ivan truly has all three styles and that's what makes him so special.\" \nAlthough setting records has been fun, Lockhart hopes his success leads to an opportunity on the next level. \n\"My mom just graduated from college, while working part-time,\" Lockhart said. \"The thing she always tell me is to find a place that will pay for my education. I know the best chance of me going to college may be through football, (but) I want my mom and my family to be proud of me.\" \nLockhart's athleticism has made him a standout not only on the football field, but on Woodville's baseball and basketball teams where he's a starter, and in track and field where he advanced to last year's regional track meet in the 100-meters and long jump. \n\"He's really focused on becoming a bigger, faster, stronger athlete and realizing he can go from football into basketball and track and starting on the baseball team,\" Waldie said. \"He's made a commitment to put Woodville and his teammates first and not just pick one sport he can be great at. He's the prime example of what we are trying to do here.\"", "external_links": [], "published": "2015-10-21T09:00:00.000+03:00", "crawled": "2015-10-21T16:07:55.269+03:00", "highlightTitle": ""}