{"organizations": [], "uuid": "43e16446792a44ad4c9a120f5c006a2fa2b138e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/486d756ec02e1384c8100a7ac55ba661.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/football/arsene-wenger-asked-roy-hodgson-to-leave-theo-walcott-on-eng/6976595/", "country": "JE", "title": "Arsene Wenger asked Roy Hodgson to leave Theo Walcott on England bench", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "Arsene Wenger asked Roy Hodgson to leave Theo Walcott on England bench", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T14:16:00.000+03:00", "replies_count": 0, "uuid": "43e16446792a44ad4c9a120f5c006a2fa2b138e2"}, "author": "", "url": "http://www.sport.co.uk/football/arsene-wenger-asked-roy-hodgson-to-leave-theo-walcott-on-eng/6976595/", "ord_in_thread": 0, "title": "Arsene Wenger asked Roy Hodgson to leave Theo Walcott on England bench", "locations": ["England"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Roy Hodgson", "Theo Walcott", "Arsene Wenger"], "text": "Arsene Wenger asked Roy Hodgson to leave Theo Walcott on England bench 23 Oct 2015 11:16:53 \ncomments \nArsenal manager Arsene Wenger has revealed he asked England boss Roy Hodgson to be cautious with Theo Walcott in the Euro 2016 qualifier against Lithuania as he feared the artificial pitch in Vilnius could cause an injury. \nWalcott scored against Estonia at Wembley on October 9, and he then travelled with the rest of the squad to Lithuania ahead of the Three Lions' final qualifier tie on the 3G surface at the LFF Stadium. \nHowever, the 26-year-old, who had been in good form for both club and country, was an unused substitute as Hodgson's somewhat experimental side coasted to a 3-0 victory. \nWenger confirmed he had a direct conversation with the England boss concerning how to best manage Walcott, who was sidelined for almost a year following a knee injury which ruled him out of the 2014 World Cup. \n\"I cannot call every national coach after every game to ask them not to play the players,\" said Wenger, who was frustrated as Aaron Ramsey did double duty for Wales and then suffered an injury after his return to Arsenal. \n\"We had a conversation about Theo, because England were playing on an artificial pitch. In the end the decision was left to Roy Hodgson, but I didn't speak to (Wales manager Chris) Coleman. \n\"We asked him (Hodgson) to consider being cautious, and to speak to Theo to ask him how he felt.... because they (England) played on an artificial pitch, Theo had come back from a long-term injury and basically nobody wants to play on artificial pitches, as we know.\" \nRamsey, who played in Wales' match against Andorra despite qualification for Euro 2016 already having been secured, faces at least a month out with a hamstring injury. Related Sport News", "external_links": [], "published": "2015-10-23T14:16:00.000+03:00", "crawled": "2015-10-23T20:12:09.354+03:00", "highlightTitle": ""}