{"organizations": [], "uuid": "c147c7b0f82ee71f9876a5e5c71163af377797ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "savannahnow.com", "main_image": "http://savannahnow.com/sites/default/files/images/sms-default-facebook-share.jpg", "site_section": "http://savannahnow.com/", "section_title": "savannahnow.com | Savannah Georgia's source for News, Entertainment, Sports, Weather, Classifieds, Jobs, Autos, Real Estate and St. Patricks Day", "url": "http://savannahnow.com/column/2015-10-09/ann-mcfeatters-why-ben-carson-wont-win-white-house", "country": "US", "title": "Ann McFeatters: Why Ben Carson won't win White House", "performance_score": 0, "site": "savannahnow.com", "participants_count": 1, "title_full": "Ann McFeatters: Why Ben Carson won't win White House | savannahnow.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T18:55:00.000+03:00", "replies_count": 0, "uuid": "c147c7b0f82ee71f9876a5e5c71163af377797ee"}, "author": "ANN MCFEATTERS", "url": "http://savannahnow.com/column/2015-10-09/ann-mcfeatters-why-ben-carson-wont-win-white-house", "ord_in_thread": 0, "title": "Ann McFeatters: Why Ben Carson won't win White House", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SPECIAL OFFER FOR NEW READERS 99 cent digital subscription to savannahnow.com\nSubscriber-members get access to ALL our digital products AND become eligible for free event tickets, discount coupons and other benefits. SIGN UP FOR SUBSCRIBER BENEFITS As a Savannah Morning News / savannahnow.com subscriber, you're eligible for members-only discounts. Download your coupons now. By ANN MCFEATTERS Here is my diagnosis of why Ben Carson, the retired pediatric neurosurgeon who currently is running second in GOP polls for president, will never win the White House.\nHe says he never yells. He says that if faced with a mass killer with a gun, he would not submit but would fight back. He does not believe in evolution and insists the devil is behind such a “fairy tale.” He thinks a non-Christian such as a Muslim should never be a U.S. president. He once accused the Obama administration of being like Nazi Germany.\nCarson appeals to too many special interest groups: The speak-softly-and-carry-a-big-stick crowd. The pro-gun people. The creationists. The religious bigots. The know-nothings.\nAnd he’s a doctor. We don’t really like doctors. They scare us. We hate going to their offices. Very seldom do they have good news. And they cost a lot. If people are reluctant to finance Donald Trump, who keeps boasting how much money he has, they will be ultimately just as hesitant to donate to a surgeon beyond $10 or $25.\nNo, Dr. Carson. There are just too many things against you. With all those disparate groups liking you, you can’t possibly hope to get them all under one political tent.\nIn all honesty, we don’t really know much about Carson except that he surgically separated conjoined twins and that his political beliefs are weird. The media are not quite sure what to make of him, because he is so, well, low-key and soft-spoken, a refreshing change from the bombastic New York real estate mogul in the race.\nAs a candidate, Carson is bizarre. He wants teachers to have guns. But the guns would be locked up, you see, so children wouldn’t get them. Teachers would be trained in “diversionary” tactics if a gunman walked into an elementary school room shooting, as horrifically has happened. Then the kindergarten teacher would run over and unlock her desk drawer and kill the gunman before he fired a shot.\nCarson told Fox News that if he were confronted by a gunman, “I would not just stand there and let him shoot me. I would say: ‘Hey, guys, everybody attack him! He may shoot me, but he can’t get us all.’ ” In Oregon, an Army veteran who tried to stop the gunman was shot multiple times and nine others were killed before the gunman killed himself.\nNo, sir, if a gunman asked Ben Carson his religion, as the Oregon gunman did, Carson would boast that he is a Christian, apparently before bashing the gunman into unconsciousness with his stethoscope.\nCarson the doctor, who says he has treated many gunshot wounds, wrote on Facebook, “I never saw a body with bullet holes that was more devastating than taking the right to arm ourselves away.” The fact that none of the pending gun control legislation would take away the right to own guns is immaterial. That 33,000 people die each year in this country because of gun violence does not warrant being more careful about who gets to buy guns.\nSome of the things Carson says make us wonder what that phrase, “Well, it’s not brain surgery,” really means.\nThe lesson Carson and Trump seem to have taught us so far is that it’s true. Anybody CAN run for president!\nAnn McFeatters is an op-ed columnist for Tribune News Service", "external_links": ["http://sav-cdn.com/sites/all/themes/savannahnow/images/blank.gif"], "published": "2015-10-09T18:55:00.000+03:00", "crawled": "2015-10-10T14:18:28.664+03:00", "highlightTitle": ""}