{"organizations": ["Gabe Hughes of Florida Tech", "Brandon Keel", "West Alabama Florida Tech", "Brandon Keel of West Alabama", "Montell Dent of West Alabama", "Florida Tech"], "uuid": "95ea99da86f4dd9af037627ff7914484495e6c6c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.floridatoday.com", "main_image": "http://www.gannett-cdn.com/-mm-/3f07e6a96e094e43f9220f8261b9874707b9208b/c=0-165-3580-2188&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/10/Brevard/Brevard/635801124095590727-crb101915-fball-.jpg", "site_section": "http://rssfeeds.floridatoday.com/brevard/sports", "section_title": "Brevard - Sports", "url": "http://www.floridatoday.com/story/sports/2015/10/10/second-win-in-a-row/73759606/", "country": "US", "title": "Florida Tech football team defeats West Alabama", "performance_score": 0, "site": "floridatoday.com", "participants_count": 0, "title_full": "Florida Tech football team defeats West Alabama", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T06:06:00.000+03:00", "replies_count": 0, "uuid": "95ea99da86f4dd9af037627ff7914484495e6c6c"}, "author": "", "url": "http://www.floridatoday.com/story/sports/2015/10/10/second-win-in-a-row/73759606/", "ord_in_thread": 0, "title": "Florida Tech football team defeats West Alabama", "locations": ["West Alabama", "West Alabaman", "FLORIDA", "Florida Tech"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Joey Caruso", "Brandon Keel", "Dezmon Huntley", "Collin O'Neal", "Mark Cato", "Martez Reaves", "Craig Bailey/FLORIDA", "Manny Abad", "Kenny Johnston", "Gabe Hughes", "TJ Lowder", "Duke Leland", "Randy Satterfield", "Trevor Sand", "Tevin Kirkland", "Izauea Lanier", "Andrew Adaor", "Taderion Myhand", "Greg Thomas", "Jaaron Barrett", "Leo Alba", "Michael J Parsons", "Gary Holmes", "Daryl Collins", "Antwuan Haynes", "Wayne Saunders"], "text": "Florida Tech football team defeats West Alabama Michael J Parsons , FLORIDA TODAY 11:06 p.m. EDT October 10, 2015 Buy Photo TJ Lowder of Florida Tech is brought down by Brandon Keel of West Alabama during Saturday's game. Craig Bailey/FLORIDA TODAY Buy Photo Gary Holmes of Florida Tech is brought down by Brandon Keel of West Alabama during Saturday's game. Craig Bailey/FLORIDA TODAY Buy Photo Trevor Sand of Florida Tech is taken down by Montell Dent of West Alabama during Saturday's game. Craig Bailey/FLORIDA TODAY Fullscreen Buy Photo Trevor Sand of Florida Tech runs between West Alabama players Brandon Keel (33) and Duke Leland (2) during Saturday's game. Craig Bailey/FLORIDA TODAY Fullscreen Buy Photo Florida Tech's Mark Cato recovers a fumble before West Alabama's Martez Reaves (40) can recover it during Saturday's game. Craig Bailey/FLORIDA TODAY Fullscreen Buy Photo Florida Tech's Leo Alba II intercepts a ball intended for West Alabama's Daryl Collins but lands out of bounds during Saturday's game. Craig Bailey/FLORIDA TODAY Fullscreen Buy Photo Skylar Sheffield (55) and Tevin Kirkland (25) of Florida Tech tackle West Alabama QB Dezmon Huntley during Saturday's game. Craig Bailey/FLORIDA TODAY Fullscreen Buy Photo Taderion Myhand of West Alabaman intercepts a ball intended for Gabe Hughes of Florida Tech during Saturday's game. Craig Bailey/FLORIDA TODAY Fullscreen Buy Photo Manny Abad of Florida Tech rips the gal away from West Alabama player Randy Satterfield during Saturday's game. Craig Bailey/FLORIDA TODAY Fullscreen Buy Photo Florida Tech's Antwuan Haynes catches a pass in front of West Alabama player Brandon Keel during Saturday's game. Craig Bailey/FLORIDA TODAY Fullscreen Buy Photo Florida Tech's Antwuan Haynes is sandwiched by Brandon Keel and Greg Thomas of West Alabama during Saturday's game. Craig Bailey/FLORIDA TODAY West Alabama QB Dezmon Huntley is taken down by Florida Tech's Joey Caruso during Saturday's game. Craig Bailey/FLORIDA TODAY Fullscreen Buy Photo Manny Abad of Florida Tech watches as West Alabama player Randy Satterfield makes the catch but was able to rip the ball away during Saturday's game. Craig Bailey/FLORIDA TODAY Kenny Johnston and Trevor Sand celebrate Sand's touchdown Saturday against West Alabama. Craig Bailey/FLORIDA TODAY Trevor Sand of Florida Tech scores a TD during Saturday's game. Craig Bailey/FLORIDA TODAY Florida Tech's Collin O'Neal loses the ball and West Alabama recovers the fumble during Saturday's game. Craig Bailey/FLORIDA TODAY Trevor Sand of Florida Tech runs the ball during Saturday's game. Craig Bailey/FLORIDA TODAY Fullscreen Buy Photo Florida Tech players Wayne Saunders II and Jaaron Barrett tackle West Alabama's Taderion Myhand after his interception in Saturday's game. Craig Bailey/FLORIDA TODAY Mark Cato hands off to Trevor Sand during Saturday's game. Craig Bailey/FLORIDA TODAY West Alabama QB Dezmon Huntley is pursued by Florida Tech's Andrew Adaor during Saturday's game. Craig Bailey/FLORIDA TODAY Fullscreen Buy Photo Gabe Hughes (19) makes a catch, escapes from the grasp of Montell Dent of West Alabama and scores a touchdown. Craig Bailey/FLORIDA TODAY Kenny Johnston of Florida Tech runs after a pass reception during Saturday's game. Craig Bailey/FLORIDA TODAY Trevor Sand is run out of bounds by Izauea Lanier of West Alabama during Saturday's game. Craig Bailey/FLORIDA TODAY Like this topic? You may also like these photo galleries: Replay Last Slide Next Slide Buy Photo Trevor Sand of Florida Tech runs between West Alabama players Brandon Keel (33) and Duke Leland (2) during Saturday's game. (Photo: Craig Bailey/FLORIDA TODAY) Buy Photo 55 CONNECT 5 TWEET LINKEDIN COMMENT EMAIL MORE \nFlorida Tech football coach Steve Englehart preaches that explosion plays and turnovers win football games. \nSaturday night, he was proven right as the Panthers came up with several explosion plays on both offense and defense, defeating West Alabama 24-13 in a Gulf South Conference game at Florida Tech Panther Stadium on the campus of Palm Bay High. \nThe first half belonged to the Panthers as they put up 353 yards of total offense, finding the end zone twice and could have scored two more if not for turnovers in the red zone. \n“I thought our offense played as perfect as you could possibly play in the first half besides those two plays,” Englehart said. \nThe Panthers drove right down the field on their first series, but quarterback Mark Cato had to sit out a play after losing his helmet. The snap was mishandled and West Alabama scooped up the fumble. \nAfter the defense held the Tigers to a 3-and-out, the offense again marched down the field, this time scoring on Trevor Sand’s 9-yard touchdown run. \nFlorida Tech struck fast as the second quarter began as Cato found Gabe Hughes sprinting down the field for an 80-yard pass play. It was Hughes’ first touchdown of the season and gave the Panthers a 14-0 lead. \n“It is good to get it off my chest and finally score, make a big play out there for my team,” Hughes said of not only his first touchdown but also his first 100-yard game of the season. \nWest Alabama got on the board with 29 seconds left in the first half after the defense held the Tigers to a 25-yard field goal. Florida Tech turned around and got into position for Drake Hillman to send the Panthers to the locker room with a 17-3 lead. \nAfter another big stop by the defense held West Alabama to a field goal in the third quarter, Cato struck again, this time to T.J. Lowder for 60 yards. \n“I wish our offense would have been more consistent, and I told them we can’t just be an all-or-nothing type of offense, we have to be able to drive the ball,” Englehart said. “But we did get those big plays and that was the difference in the game.” \nThe defense would continue to dominate in the red zone, forcing the Tigers to turn it over on downs, and Chris Stapleton recovered a fumble on another drive as they held them out of the end zone until the fourth quarter. \n“Everybody works hard and we are hard on each other. Mistakes are touchdowns, you have to be confident and go get it. We call it the Moment of Truth, you have to make it happen,” Florida Tech defensive back Manny Abad said. “Coach was putting us in great position and we just locked it down.” \nThe Panthers also locked down their second straight Gulf South Conference win and improved to 3-3 overall. \n“We got Gulf South wins back-to-back and that is a big deal,” Abad said. “Every win in college football is a big win but from now on, it is playoff mode, win every game and hopefully make it past November.” 55 CONNECT 5 TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http://on.flatoday.com/1LoGjun TOP VIDEOS", "external_links": [], "published": "2015-10-11T06:06:00.000+03:00", "crawled": "2015-10-11T08:54:51.234+03:00", "highlightTitle": ""}