{"organizations": [], "uuid": "cf97d95bf1173385bc213ba5796a452343e72473", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kctv5.com", "main_image": "http://kctv.images.worldnow.com/images/8993916_G.jpg", "site_section": "http://kctv5.com//category/208603/sports?clienttype=rss", "section_title": "KCTV Kansas City - Sports", "url": "http://www.kctv5.com/story/30235952/chiefs-second-half-collapse-proves-season-changing", "country": "US", "title": "Chiefs second half collapse proves season changing", "performance_score": 0, "site": "kctv5.com", "participants_count": 1, "title_full": "Chiefs second half collapse proves season changing - KCTV5", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T22:40:00.000+03:00", "replies_count": 0, "uuid": "cf97d95bf1173385bc213ba5796a452343e72473"}, "author": "Posted by Chris Oberholtz, Multimedia Producer", "url": "http://www.kctv5.com/story/30235952/chiefs-second-half-collapse-proves-season-changing", "ord_in_thread": 0, "title": "Chiefs second half collapse proves season changing", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "KANSAS CITY, MO (FOOTBALLKC) - In one of the worst possible losses Kansas City could have imagined, the Chiefs lost Jamaal Charles to injury and suffered a second half collapse to one of the weakest teams in football.\nThings started off strong for the Chiefs as Jaye Howard forced a fumble in the end-zone, with Ramik Wilson recovering for the touchdown. Teams that score a defensive touchdown end up winning nearly 70% of the time.\nThe productive play continued with Kansas City driving down the field as a De’Anthony Thomas touchdown catch extended their lead to 14-3.\nWith a 17-3 lead at the half, the Chiefs appeared poised for a victory.\nIt was on the first drive in the second half that Charles was injured in what looks to be a torn ACL, and just a few plays later Cairo Santos had his field goal attempt blocked. From then out it was all Chicago, as the Bears out gained the Chiefs 220-52 in total yards.\nAlex Smith didn’t turn the ball over, but didn’t perform well in the clutch either. He completed 16 of 30 attempts for 181 yards, but failed to come through on key third downs. For the entire second half the Chiefs couldn’t sustain long drives and allowed Chicago to creep back into the ball game.\nThe defense looked strong at times, most notably Jaye Howard. The big defensive end hauled in six tackles, two of which a tackle for loss. With that said, the Chiefs front seven was unable to put much pressure on Cutler, and when they did they couldn’t bring him down.\nWith Chicago out multiple starters, the defense could have done much better in rushing the passer and eliminating 3rd down conversions. Especially on the final two Chicago drives, where the Bears turned in a 67 yard and 88 yard drive in the final five minutes to pull off the comeback win.\nCutler made some very impressive throws to end the game, but the Bears shouldn’t have even been in that position. Even without Charles, a 14-point lead at the half in Arrowhead should be a win against lower echelon teams.\nWhether it’s on Smith for not completing the late throws, the receivers for some key drops, defense for providing little pass rush, or Andy Reid for poor clock management and play calling, it was a bad team loss on Sunday.\nCharles will undergo an MRI Monday to determine the severity of his injury, but all signs point to another torn ACL. Kansas City will look to overcome the loss and snap a four game losing streak next week, as they travel to Minnesota to face the 2-2 Vikings.\nCopyright 2015 KCTV (Meredith Corp.) All rights reserved.", "external_links": [], "published": "2015-10-11T22:40:00.000+03:00", "crawled": "2015-10-12T02:57:10.580+03:00", "highlightTitle": ""}