{"organizations": [], "uuid": "07de8e6a2ad1ef21a9ea91b3ec29cf0ebc9e2322", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kctv5.com", "main_image": "", "site_section": "http://kctv5.com//category/208603/sports?clienttype=rss", "section_title": "KCTV Kansas City - Sports", "url": "http://www.kctv5.com/story/30181795/manager-john-farrell-returning-to-red-sox-after-cancer-scare", "country": "US", "title": "Manager John Farrell returning to Red Sox after cancer scare", "performance_score": 0, "site": "kctv5.com", "participants_count": 1, "title_full": "Manager John Farrell returning to Red Sox after cancer scare - KCTV5", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T03:00:00.000+03:00", "replies_count": 0, "uuid": "07de8e6a2ad1ef21a9ea91b3ec29cf0ebc9e2322"}, "author": "cbs8", "url": "http://www.kctv5.com/story/30181795/manager-john-farrell-returning-to-red-sox-after-cancer-scare", "ord_in_thread": 0, "title": "Manager John Farrell returning to Red Sox after cancer scare", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By TOM WITHERS\nAP Sports Writer CLEVELAND (AP) - A second straight troubling season for the Boston Red Sox is ending on an uplifting note - manager John Farrell is expected back next season after undergoing cancer treatment.\nBoston announced Farrell's return before the season finale against Cleveland on Sunday. The 53-year-old left the Red Sox on Aug. 14 after being diagnosed with Stage 1 lymphoma, detected when he had surgery to repair a hernia.\nFarrell completed chemotherapy treatments in Boston this past week, and barring any medical complications, the club is expecting him to be back in the dugout next season.\nFarrell was hired as Boston's manager in October 2012 and led the Red Sox to a World Series title in his first season. He signed a two-year contract extension in February through the 2017 season with club holding an option for 2018.\nFarrell has a 246-243 (.503) record with the Red Sox. He managed for two seasons in Toronto prior to being signed by the Red Sox.\nTorey Lovullo has served as interim manager while Farrell was on medical leave. The Red Sox have signed Lovullo to a two-year extension through 2017 and said he will return to his role as bench coach in 2016. Lovullo, who played with Farrell and is one of his closest friends, has waived the right to pursue managerial openings.\nBoston did not renew the contract of first-base coach Arnie Beyeler.\nAt 78-83 entering Sunday's finale, the Red Sox had seven more wins than in 2014. Boston will have consecutive losing seasons for the first time since 1993-94.\nCopyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-04T03:00:00.000+03:00", "crawled": "2015-10-04T20:37:01.055+03:00", "highlightTitle": ""}