{"organizations": [], "uuid": "a8a78230d9e8438780277da1042c8917b2bbee7b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattletimes.com", "main_image": "http://www.seattletimes.com/wp-content/themes/st_refresh/img/st-meta-facebook.png", "site_section": "http://www.seattletimes.com/", "section_title": "The Seattle Times | Local news, sports, business, politics, entertainment, travel, restaurants and opinion for Seattle and the Pacific Northwest. ", "url": "http://www.seattletimes.com/nation-world/former-billionaire-from-medina-appears-in-court-in-bid-to-get-out-of-jail/", "country": "EU", "title": "Former billionaire from Medina appears in court in bid to get out of jail", "performance_score": 0, "site": "seattletimes.com", "participants_count": 1, "title_full": "Former billionaire from Medina appears in court in bid to get out of jail | The Seattle Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T15:00:00.000+03:00", "replies_count": 0, "uuid": "a8a78230d9e8438780277da1042c8917b2bbee7b"}, "author": "MATT VOLZ", "url": "http://www.seattletimes.com/nation-world/former-billionaire-from-medina-appears-in-court-in-bid-to-get-out-of-jail/", "ord_in_thread": 0, "title": "Former billionaire from Medina appears in court in bid to get out of jail", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "HELENA, Mont. (AP) — The one-time billionaire founder of Montana’s ultra-exclusive Yellowstone Club made his first public appearance in court Monday after six months in jail, but it will take at least another month for the judge who locked him up to decide whether he’s earned his release.\nTim Blixseth and his attorneys set out to prove that they have completely accounted for $13.8 million he received from the sale of a Mexican resort. Blixseth, of Medina, Washington, was ordered not to sell any assets during the Yellowstone Club bankruptcy proceedings, in which creditors say Blixseth owes more than $250 million.\nU.S. District Judge Sam Haddon found Blixseth in civil contempt for failing to reveal what happened to the money once the sale came to light, and ordered him to be held in the Cascade County Detention Facility on April 20.\nHaddon billed Monday’s hearing as Blixseth’s last chance to come clean, which legal experts interpreted as a message that Blixseth could face criminal contempt charges.\nMost Read Stories Pair split; now can she divorce nickname? Next Air Force One will fly faster, farther with advanced technology What’s really wrong with the Seahawks? They’re just not as good Panthers 27, Seahawks 23: What the national media are saying about another Seattle collapse Seattle Seahawks to lift suspension on fullback Derrick Coleman Unlimited Digital Access. $1 for 4 weeks. Blixseth, 65, sat with his attorneys, but did not testify. Instead, his accountant took the stand for nearly six hours to answer questions about how he tracked the money from the 2011 Tamarindo resort sale through tangled transactions that involved more than 20 businesses and bank accounts in the U.S. and in Mexico.\nAccountant Cameron Keller said he used bank records, company ledgers, invoices, bills and any other supporting documents he could find to chart the money’s path through Blixseth’s various companies. The result was thousands of pages of documents that Keller said shows the Tamarindo money has all been traced — and completely spent.\n“This is the most detailed accounting that I’ve ever seen,” Blixseth attorney Paul Brain said after the hearing. But, Brain added, there are holes that just can’t be filled due to the time that’s passed and because the sale happened in a foreign country.\nAttorneys for the Yellowstone Club bankruptcy trustees were quick to point out those holes, which included numerous transactions where the recipient of money wasn’t identified or the payment couldn’t be explained.\nSome payments appeared to be mischaracterized, such as a $3,600 bill from a wine shop that was labeled as a yacht expense. Other transactions were described as loan payments or property sales with no supporting documentation. Trustee attorneys also questioned money that went to Blixseth’s wife’s bank accounts with no explanation.\n“There are key elements where he has not complied with the judge’s order, specifically showing the purpose of those transactions,” trustee attorney Kevin Barrett said.\nHaddon emphasized that he would not consider Blixseth in compliance until he satisfied every element of his orders, which includes showing the purpose of the transactions.\nBrain said the accountant’s report can only goes so far, but should satisfy the judge’s order when combined with other evidence and testimony that has been submitted.\nHaddon ordered both sides to submit their final arguments before he takes up the matter for deliberation on Nov. 20.\nUntil then, he ordered Blixseth back to jail.\nMATT VOLZ", "external_links": [], "published": "2015-10-20T15:00:00.000+03:00", "crawled": "2015-10-20T17:48:56.734+03:00", "highlightTitle": ""}