{"organizations": [], "uuid": "e8f89483edd855a7c59829c61c68fe078ae7bf8a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/47529300.cms", "site_section": "http://timesofindia.indiatimes.com/sports/football/top-stories/articlelist/4720865.cms", "section_title": "Top Stories - Football - Sports - The Times of India", "url": "http://timesofindia.indiatimes.com/sports/football/top-stories/Spains-Del-Bosque-drops-Costa-recalls-Thiago/articleshow/49195597.cms", "country": "IL", "title": "Spain's Del Bosque drops Costa, recalls Thiago", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "Spain's Del Bosque drops Costa, recalls Thiago - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T00:59:00.000+03:00", "replies_count": 0, "uuid": "e8f89483edd855a7c59829c61c68fe078ae7bf8a"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/sports/football/top-stories/Spains-Del-Bosque-drops-Costa-recalls-Thiago/articleshow/49195597.cms", "ord_in_thread": 0, "title": "Spain's Del Bosque drops Costa, recalls Thiago", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MADRID: Spain coach Vicente del Bosque has overlooked Diego Costa and recalled Thiago Alcantara for the holders' final two Euro 2016 Group C qualifiers against Luxembourg and Ukraine this month.\nChelsea forward Costa is suspended for the match against Luxembourg in Logrono in a week's time but would have been available for the game in Kiev three days later. He was replaced on the 23-man roster by Juventus striker Alvaro Morata.\nBayern Munich midfielder Thiago, who is back on good form after a series of knee problems and last played for La Roja in a friendly against Italy in March 2014, comes in as cover for injured pair Andres Iniesta and Koke.\nCelta Vigo winger Nolito, Villarreal captain Bruno Soriano and Real Sociedad center back Inigo Martinez were also included, with Bayern fullback Juan Bernat and Sevilla midfielder Vitolo also dropped.\nSpain can make sure of their place at the tournament in France next year with a win against minnows Luxembourg, who are second-from-bottom in the section.\nDel Bosque's side have 21 points from eight matches, two ahead of Slovakia, who host Belarus on Friday. Ukraine are third on 16 points ahead of their match away to bottom side Macedonia.\nSpain squad:\nGoalkeepers: Iker Casillas (Porto), David De Gea (Manchester United), Sergio Rico (Sevilla)\nDefenders: Dani Carvajal (Real Madrid), Gerard Pique (Barcelona), Marc Bartra (Barcelona), Juanfran (Atletico Madrid), Sergio Ramos (Real Madrid), Jordi Alba (Barcelona), Cesar Azpilicueta (Chelsea), Inigo Martinez (Real Sociedad)\nMidfielders: Sergio Busquets (Barcelona), Santi Cazorla (Arsenal), David Silva (Manchester City), Isco (Real Madrid), Cesc Fabregas (Chelsea), Bruno Soriano (Villarreal), Thiago Alcantara (Bayern Munich), Juan Mata (Manchester United)\nForwards: Pedro (Chelsea), Paco Alcacer (Valencia), Alvaro Morata (Juventus), Nolito (Celta Vigo) ", "external_links": ["https://play.google.com/store/apps/details?id=com.toi.reader.activities"], "published": "2015-10-03T00:59:00.000+03:00", "crawled": "2015-10-03T21:48:18.744+03:00", "highlightTitle": ""}