{"organizations": ["Xinhua", "Philippines China"], "uuid": "d4e47a653c68cec1bcf87e19b15a755ab624f90b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.shanghaidaily.com", "main_image": "http://www.shanghaidaily.com/images/mzl.dlomxgvi.png", "site_section": "http://rss.shanghaidaily.com/portal/mainsite/Sports", "section_title": "Shanghai Daily: Sports", "url": "http://www.shanghaidaily.com/sports/basketball/China-beats-India-to-meet-Iran-Japan-to-play-Philippines/shdaily.shtml", "country": "", "title": "China beats India to meet Iran, Japan to play Philippines", "performance_score": 0, "site": "shanghaidaily.com", "participants_count": 0, "title_full": "China beats India to meet Iran, Japan to play Philippines", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T21:26:00.000+03:00", "replies_count": 0, "uuid": "d4e47a653c68cec1bcf87e19b15a755ab624f90b"}, "author": "", "url": "http://www.shanghaidaily.com/sports/basketball/China-beats-India-to-meet-Iran-Japan-to-play-Philippines/shdaily.shtml", "ord_in_thread": 0, "title": "China beats India to meet Iran, Japan to play Philippines", "locations": ["Iran", "Japan", "China", "India"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "China beats India to meet Iran, Japan to play Philippines Source: Xinhua | October 2, 2015, Friday | Online Edition \nCHINA overwhelmed India 104-58 on the Chinese National Day to take on defending champion Iran in the Asian Men's Basketball Championship. \nJapan and the Philippines also advanced into the semifinals, after beating Qatar and Lebanon respectively on Thursday. \nThe host side set the tone, outscoring India 27-15 in the first quarter. China's point guard, Zhao Jiwei, was hit by Amritpai with elbow on the face that quarter but he still managed to have seven points and three assists. \nThe second and third quarter witnessed former NBA player Yi Jianlian shining over the rim with several slam dunks. Although Bhriguvanshi Vishesh had eight straight points for India in the last period, China already built a huge lead of over 40 points and finished it 104-58. \nYi Jianlian poured in 18 of his 21 points in the first half to lead China on the scoreboard, Bhriguvanshi Vishesh had a match high 22. \nIran, which lost to South Korea in the 2014 Asian Games final, beat the old foe 75-62. \nIran led in rebound 44-20 with South Korea dropping their well-known three-pointer skills with a two-out-of-13 behind the arc. \nHamid Ehadadi dominated the paint with 18 points and 14 rebounds. \nNow all eyes are on host China. \n\"Spectators care more about the game against Iran rather than this one since Iran has been Asian champion since 2009,\" said Chinese head coach Gong Luming. \"As a new team, we will have to challenge the best team to be the best in the future.\" \nJapan outscored Qatar every single quarter to book a semifinal ticket Thursday afternoon. \nTakatoshi Furukawa helped Japan with a game high 22 points and five rebounds in the 81-67 victory. \nJason William and Former NBA player Andray Blatche contributed 25 and 24 points respectively in the Philippines' 82-70 win over Lebanon. \nThe Philippines faces Japan in the semifinals.", "external_links": [], "published": "2015-10-01T21:26:00.000+03:00", "crawled": "2015-10-02T06:39:39.673+03:00", "highlightTitle": ""}