{"organizations": [], "uuid": "96b889ac794c73085622caf5345006828f7d8552", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "jakartaglobe.beritasatu.com", "main_image": "http://img.thejakartaglobe.com/2015/10/AUTO-PRIX-RUS-F1-QUALIFYING-204735-01-02-1024x676.jpg", "site_section": "http://jakartaglobe.beritasatu.com/rss/sports/", "section_title": "Sports | Jakarta Globe", "url": "http://jakartaglobe.beritasatu.com/motorsport/russian-retirement-major-blow-rosberg/", "country": "ID", "title": "Russian Retirement Is Major Blow for Rosberg", "performance_score": 0, "site": "beritasatu.com", "participants_count": 0, "title_full": "Russian Retirement Is Major Blow for Rosberg", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T08:20:00.000+03:00", "replies_count": 0, "uuid": "96b889ac794c73085622caf5345006828f7d8552"}, "author": "", "url": "http://jakartaglobe.beritasatu.com/motorsport/russian-retirement-major-blow-rosberg/", "ord_in_thread": 0, "title": "Russian Retirement Is Major Blow for Rosberg", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Alan Baldwin", "Nico Rosberg", "Rosberg"], "text": "INDEX Russian Retirement Is Major Blow for Rosberg i Mercedes AMG Petronas F1 Team's German driver Nico Rosberg drives during the qualifying session of the Russian Formula One Grand Prix at the Sochi Autodrom circuit. (AFP Photo/Andrej Isakovic) By : Alan Baldwin | on 7:20 PM October 11,   Featured , Motorsport \nSochi, Russia. Nico Rosberg's fading Formula One title hopes suffered another massive blow on Sunday when the German retired his Mercedes from the Russian Grand Prix after leading from pole position. \nThe German, who had started the race 48 points adrift of double world champion Lewis Hamilton with 100 points remaining to be won after Sochi, had complained of a broken throttle pedal. \nHamilton took over the race lead, knowing a ninth victory of the season would leave the Briton 73 points clear of his team mate and in line to secure his third crown in Texas in two weeks' time. \nThe retirement was also a setback for Mercedes, who had hoped to wrap up the constructors' title in Sochi for the second year in a row and had the \"2015 world champions\" T-shirts printed and ready. \nMercedes need to score three points more than Ferrari to clinch that title on Sunday, but the Italian team had Sebastian Vettel and Kimi Raikkonen in third and fourth after Rosberg's retirement. \n\"Your team mate has retired. Let us focus on this race,\" Hamilton, who passed Rosberg on the sixth lap, was told over the team radio after the German pulled into the pits and stepped out of the car at the end of lap seven. Sochi Autodrom – October 11. (JG Infographic/R. Thatit Tri Adiwanto) \nRosberg put a brave face on his second retirement of the season and second in four races. \n\"F1 is pretty incredible sometimes how tough it is,\" he told the BBC. \n\"After a great start, leading the race and feeling confident. Straight after the safety car the pedal broke. It was quite dangerous. Definitely not a nice way to end the day. \n\"The championship is more difficult of course but I am never going to win a championship like that when normal things break. But I will come back, keep pushing, keep attacking and try to win in Texas.\" \nReuters", "external_links": [], "published": "2015-10-11T08:20:00.000+03:00", "crawled": "2015-10-12T10:03:18.208+03:00", "highlightTitle": ""}