{"organizations": [], "uuid": "95db62abb4947e43e68f578ac9036074bb86f83d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "nypost.com", "main_image": "https://thenypost.files.wordpress.com/2015/10/dk1.jpg", "site_section": "http://nypost.com/sports/feed/", "section_title": "| Sports | New York Post", "url": "http://nypost.com/2015/10/04/meet-the-astros-stud-ace-whos-completely-baffled-yankees/", "country": "", "title": "Meet the Astros’ stud ace who’s completely baffled Yankees", "performance_score": 0, "site": "nypost.com", "participants_count": 1, "title_full": "Meet the Astros’ stud ace who’s completely baffled Yankees | New York Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T02:52:00.000+03:00", "replies_count": 0, "uuid": "95db62abb4947e43e68f578ac9036074bb86f83d"}, "author": "Dan Martin", "url": "http://nypost.com/2015/10/04/meet-the-astros-stud-ace-whos-completely-baffled-yankees/", "ord_in_thread": 0, "title": "Meet the Astros’ stud ace who’s completely baffled Yankees", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BALTIMORE — Rosters still need to be set for the Yankees wild-card game against the Astros in The Bronx on Tuesday, and though Joe Girardi likely will sweat over some of those decisions, the outcome figures to lie mostly on the arms of Masahiro Tanaka and Dallas Keuchel.\nAnd if history is any indication, the Yankees postseason could be very short.\nIn two starts this season, Keuchel has held the Yankees scoreless in 16 innings. He pitched a shutout in Houston on June 25, striking out a dozen, and then tossed seven innings without giving up a run at The Stadium on Aug. 25.\nGirardi’s answer to this domination?\n“I hope the third time’s the charm,” Girardi said. “He’s been good and he’s been tough on us. We like the guy going for us and it’s one game.”\nPerhaps the two best things the Yankees have going into the game are that Keuchel will be starting on three days’ rest for the first time in his career.\nAnd that thanks to Arizona’s win over Houston in the regular season finale on Sunday, the Yankees get to face Keuchel in The Bronx.\nWhile he had no problem pitching there earlier in the season, he was unbeatable in Houston this season, going 15-0 with a 1.46 ERA at home, compared to 5-8 with a 3.77 ERA on the road.\nTanaka, though, gave up six runs in just five innings in a loss at Houston on June 27.\nGirardi said there would be “no limitations” on the right-hander Tuesday, who didn’t look sharp in his lone outing after being shut down with a right hamstring strain.\nPlenty of other roster decisions need to be made by 10 a.m. Tuesday, such as whether CC Sabathia will be in the bullpen.\nThe big three of Justin Wilson, Dellin Betances and Andrew Miller will be available, as will Adam Warren, who could serve as a long man if Tanaka falters.\nOf course, regardless of how Tanaka performs, the Yankees will have to score some runs, which has been an issue over the last two weeks.\n“Keuchel has been as good as there is in the league,” Chase Headley said. “They have a lot of good, young players. We’ve got our work cut out for us.”\nCarlos Beltran agreed.\n“He’s a good pitcher,” Beltran said. “I’ve faced him many times. You have to have a good plan. He’s gonna sink a lot of balls. We have to make sure we get him up and hopefully find holes.”\n“They’re young, they’re fast,” Girardi said. “The big thing is we have to shut them down and keep them off the bases. They do have power. They hit the ball out of the ballpark just like we do.”\nShare this: Facebook Twitter Google Whatsapp Email Filed under dallas keuchel ,  houston astros ,  new york yankees", "external_links": [], "published": "2015-10-05T02:52:00.000+03:00", "crawled": "2015-10-05T10:45:59.461+03:00", "highlightTitle": ""}