{"organizations": [], "uuid": "74c74732867475e4771e4729b7874e3278b0689a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "http://s2.reutersmedia.net/resources/r/?m=02&d=20151012&t=2&i=1086505702&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB9B10E", "site_section": "http://feeds.reuters.com/reuters/sportsNews", "section_title": "Reuters: Sports News", "url": "http://www.reuters.com/article/2015/10/12/us-basketball-stadium-san-francisco-idUSKCN0S628920151012", "country": "US", "title": "Warriors NBA team buys land for San Francisco basketball arena", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Warriors NBA team buys land for San Francisco basketball arena | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T01:52:00.000+03:00", "replies_count": 0, "uuid": "74c74732867475e4771e4729b7874e3278b0689a"}, "author": "Rory Carroll", "url": "http://www.reuters.com/article/2015/10/12/us-basketball-stadium-san-francisco-idUSKCN0S628920151012", "ord_in_thread": 0, "title": "Warriors NBA team buys land for San Francisco basketball arena", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SAN FRANCISCO The Golden State Warriors basketball team on Monday acquired a 12-acre site in San Francisco's Mission Bay neighborhood where it plans to build a new, 18,000-seat arena for the reigning NBA champs.\nThe waterfront vacant lot was purchased from cloud computing company Salesforce.com Inc for an undisclosed amount.\nThe Warriors' plan is unique in that it would be the only completely privately financed arena or stadium in the United States over the past two decades.\n\"The Warriors are making an unprecedented, $1 billion-plus investment in San Francisco,\" said Rick Welts, president and chief operating officer of the National Basketball Association team based in Oakland, California. \"We're the only sports team in America doing this all with private funds, on private land, with no public subsidy.\"\nLast week UCSF, which operates a hospital complex in the area, voiced its support for the project after the city agreed to a traffic plan that includes $40 million in transit improvements to reduce congestion on game days.\nAlso last week the Mission Bay Citizens Advisory Committee, which was tasked with vetting the Warriors' plans, voted unanimously to endorse it.\nUp next is an environmental review of the project and the property.\nThe Mission Bay Alliance, an opposition group that consists of people affiliated with the hospital, bio science investors and neighborhood groups, said they will continue to battle against the project.\n\"We think we will beat the Warriors in the environmental review process,\" said Sam Singer, a spokesman for the alliance, noting that he has already identified 50 potential environmental problems with the indoor arena.\nHe said his group, which believes the arena will create major traffic problems, is willing to go to the ballot box or the courts to stop it. The group believes a space 11 blocks south of the Mission Bay site is a better location for the arena.\nIf the current proposal wins all necessary approvals, the stadium could be open in time for the 2018-2019 NBA season.\n\"We've been the Bay Area's team for more than 50 years, and this plan keeps us in the Bay Area for the next 50 and beyond,\" the Warriors' Welts said. \"If there were any lingering doubts about our commitment to Mission Bay, purchasing this land should put them to rest. We love this neighborhood; nobody else is getting this land.\"\n(Reporting by Rory Carroll; Editing by Richard Chang )", "external_links": [], "published": "2015-10-13T01:52:00.000+03:00", "crawled": "2015-10-13T01:43:56.789+03:00", "highlightTitle": ""}