{"organizations": [], "uuid": "7a2e2a66f6eba5e274c32493f450939b5462e6f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www2.ljworld.com", "main_image": "http://worldonline.media.clients.ellingtoncms.com/static/ljworld.com/images/ljw-logo-1200.jpg", "site_section": "http://www2.ljworld.com/rss/headlines/sports/", "section_title": "LJWorld.com stories: Sports", "url": "http://www2.ljworld.com/news/2015/oct/17/chiefs-desperate-win/", "country": "US", "title": "Chiefs desperate for a win", "performance_score": 0, "site": "ljworld.com", "participants_count": 1, "title_full": "Chiefs desperate for a win", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T07:34:00.000+03:00", "replies_count": 0, "uuid": "7a2e2a66f6eba5e274c32493f450939b5462e6f8"}, "author": "Associated Press", "url": "http://www2.ljworld.com/news/2015/oct/17/chiefs-desperate-win/", "ord_in_thread": 0, "title": "Chiefs desperate for a win", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Associated Press — Associated Press October 17, 2015 \nAdvertisement \nMinneapolis  Adrian Peterson can still hear the raspy, booming voice in the back of his head. \nEric Bieniemy, his position coach with the Minnesota Vikings for his first four NFL seasons, sure didn’t give the star running back the star treatment. Bieniemy yelling tough-love instruction at a young Peterson was one of the familiar sounds of a Vikings practice from 2007-10. \nNow, Bieniemy is the running backs coach for the Kansas City Chiefs, who play today at Minnesota. So Peterson will have the opportunity before and after the game to greet one of his old mentors. \nPeterson was watching the Chiefs play Denver last month on television when he saw contemporary and fellow Texas native Jamaal Charles lose two fumbles that ultimately cost Kansas City a victory. \n“I was like, ‘Oh, Lord. I can just imagine what he’d be saying to him on the sideline,’” Peterson said. “I was actually going to call E.B. and say something to him about it, but I was like, ‘He might cuss me out.’ But I’m kind of glad I didn’t because I think that following Sunday I fumbled the ball three times. I lost one. I thought about him then, too: ‘I can just imagine what E.B. would be saying right now.’” \nCharles won’t play this week, or at all the rest of the year. He tore the ACL in his right knee last week. \nHere are some key angles to know about the game today: \nDefending the pass defense: The Chiefs’ secondary has been taking heat for failing to stop Jay Cutler in the fourth quarter last week in the 18-17 loss to Chicago, but the inability of the front seven to put pressure on the Bears quarterback was the root of the problem. The Chiefs only have 11 sacks this season, and All-Pro outside linebacker Justin Houston has just three after setting a franchise record with 22 last season. \nKansas City, which has allowed a league-most 13 touchdowns passing this year, was second in the NFL in 2014 with an average of 17.6 points allowed per game. The Chiefs were fifth in sacks last season and seventh in yards allowed. \n“We’re not ourselves,” free safety Husain Abdullah said. “Last year, regardless of the situation or the moment we were put in, we were able to make the play, and this year we haven’t been so fortunate.” \nFamiliar faces: Bieniemy won’t be the only former Vikings coach to revisit Minnesota this weekend. Chiefs assistant Brad Childress was head coach of the Vikings for four-plus seasons before being fired in 2010. \nChildress, who carries the unique title of spread game analyst/special projects while serving as a jack-of-all-trades of sorts and a trusted adviser to head coach Andy Reid, first worked with Reid on the staff at Northern Arizona. In 1986, when Reid was the offensive line coach and Childress was the offensive coordinator, the Lumberjacks beat the Weber State Wildcats 45-24 in a Big Sky Conference game. \nWeber State’s defensive coordinator that day? Mike Zimmer, now Vikings head coach. \nRunning back committee: Without Charles, the Chiefs will rely on backup Knile Davis, undrafted free agent Charcandrick West and ex-LSU standout Spencer Ware. The powerful Davis has played well in relief the past two seasons. West, the pride and product of Abilene Christian, is a smaller, elusive runner in the mold of Charles. Ware was just elevated from the practice squad. \n“Coach Reid is a genius,” West said. “He makes us fit in this offense. He puts us where we need to be in the right spot.” \nSafety dance: The Vikings have had a rising star in the secondary since drafting Harrison Smith in the first round in 2012, but they’ve had trouble stabilizing the other starting safety spot since then. Robert Blanton and Andrew Sendejo have both had opportunities this year, and Zimmer hinted that Antone Exum could play some there this week, too. \nAbdullah was a starter there for the Vikings over two seasons until a concussion forced him out in 2011. \nSUPER BOWL REUNION: As part of a season-long celebration of the 50th Super Bowl, the NFL has recognized 19 rematches on the 2015 schedule, including the Chiefs and Vikings, who played for the championship on Jan. 11, 1970, in New Orleans. The Vikings were scheduled to have 11 former players on hand, all of whom played in their four Super Bowl defeats. \nThe Chiefs have lost 13 of their 16 playoff games since they beat the Vikings that day more than 45 years ago, last winning in the tournament following the 1993 season. \nCHIEFS-VIKINGS CAPSULE \nKANSAS CITY (1-4) at MINNESOTA (2-2) \nNoon today, CBS (WOW channels 5, 13, 205, 213 \nOPENING LINE — Vikings by 21⁄2 \nRECORD VS. SPREAD — Chiefs 1-4, Vikings 3-1 \nSERIES RECORD — Chiefs lead 7-4 \nLAST MEETING — Chiefs beat Vikings 22-17, Sept. 2, 2011 \nLAST WEEK — Chiefs lost to Bears 18-17; Vikings had bye, lost to Broncos 23-20 on Oct. 4 \nAP PRO32 RANKING — Chiefs No. 24, Vikings No. 14 \nCHIEFS OFFENSE — OVERALL (18), RUSH (18), PASS (21). \nCHIEFS DEFENSE — OVERALL (26), RUSH (13), PASS (27). \nVIKINGS OFFENSE — OVERALL (31), RUSH (2), PASS (32). \nVIKINGS DEFENSE — OVERALL (17), RUSH (26), PASS (12). \nSTREAKS, STATS AND NOTES — This is only second meeting in Minnesota between Chiefs and Vikings over last 19 seasons. Vikings beat Chiefs 45-20 at Metrodome in 2003, behind 146 yards and three TDs rushing by Onterrio Smith. ... Chiefs have lost star RB Jamaal Charles for season to torn right ACL. He tore left one in 2011. ... Chiefs QB Alex Smith has been sacked 21 times, second-most in NFL behind Russell Wilson (22). ... Travis Kelce has 328 yards receiving for Chiefs, third-best among TEs in league behind Rob Gronkowski and Gary Barnidge. ... Kansas City FS Husain Abdullah spent first four years with Vikings, starting 24 games over 2010 and 2011 seasons. ... Vikings have won five straight at temporary outdoor home TCF Bank Stadium. ... Vikings are sixth in NFL with average of 18.3 points allowed per game. Last time they gave up fewer than 20 points per game was 2009. ... Minnesota allowing league-best 0.8 yards per punt return. ... Fantasy Tip: Charcandrick West and Knile Davis expected to share carries for Chiefs in absence of Charles, facing Vikings’ defense vulnerable against run at times.", "external_links": [], "published": "2015-10-18T07:34:00.000+03:00", "crawled": "2015-10-18T09:41:09.885+03:00", "highlightTitle": ""}