{"organizations": [], "uuid": "ad910d660938607dd0f9b648d24be0c443ca82ff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ammoland.com", "main_image": "http://www.ammoland.com/wp-content/uploads/2015/10/mb-oddcouple.jpeg", "site_section": "http://www.ammoland.com/feed/", "section_title": "AmmoLand.com Shooting Sports News", "url": "http://www.ammoland.com/2015/10/winchester-deadly-passion-calls-turkeys-and-drops-lures-this-sunday/", "country": "US", "title": "Winchester Deadly Passion Calls Turkeys and Drops Lures This Sunday", "performance_score": 0, "site": "ammoland.com", "participants_count": 1, "title_full": "Winchester Deadly Passion Calls Turkeys and Drops Lures This Sunday", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T16:08:00.000+03:00", "replies_count": 0, "uuid": "ad910d660938607dd0f9b648d24be0c443ca82ff"}, "author": "Michelle Scheuermann", "url": "http://www.ammoland.com/2015/10/winchester-deadly-passion-calls-turkeys-and-drops-lures-this-sunday/", "ord_in_thread": 0, "title": "Winchester Deadly Passion Calls Turkeys and Drops Lures This Sunday", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Winchester Deadly Passion Calls Turkeys and Drops Lures This Sunday Video | Posted on \n11:30 a.m. ET on Sportsman Channel Winchester Deadly Passion \nMINNETONKA, MN; ( Ammoland.Com ) — Melissa Bachman is ready for an outdoor adventure that will take her from springtime turkey hunting in Illinois to dropping lures for paddlefish in Oklahoma. Whether on land or on the water, Bachman is ready to put her hunting and fishing skills to the test in this unpredictable episode. Tune in to Winchester Deadly Passion , on Sportsman Channel Sunday, June 5 at 11:30 a.m. ET. \nWatch a sneak peek here: http://www.thesportsmanchannel.com/shows/winchesters-deadly-passion/ \nBachman begins her journey in Illinois on the hunt for springtime turkey. The huntress knows there is a chance the birds will fall silent, making it nearly impossible to pinpoint a good shot. With only a five-day season ahead of her, she needs to use her time wisely to fill her tag. A giant long beard eventually comes through the field and Bachman must decide if this is the tom for her. \n“It’s challenging when the turkeys just aren’t making any noise,” explained Bachman. “I had to switch my strategy before I finally got my eye on what I was looking for – a giant tom.” \nComing off of a tough Illinois hunt, Bachman is ready to switch from land to water to reel in unique underwater fare – paddlefish. She heads to Oklahoma to meet up with a paddlefish expert to see if she can learn best practices to pull in the catch of the day. \n\n“There was non-stop action all day out on the water,” said Bachman. “No other place is home to so many paddlefish, and we were having a blast.” \nLearn more about Winchester Deadly Passion at http://MelissaBachman.Com on, Instagram at http://Instagram.com/Melissa_Bachman and http://Facebook.Com/WinchesterDeadlyPassion \nAbout Winchester Deadly Passion : Every good hunter needs a solid role model, and Melissa Bachman, host of Winchester Deadly Passion , fits that bill perfectly with a unique ability to share her love for hunting with passionate fans and viewers. Winchester Deadly Passion is 26 weeks of non-stop action and pure entertainment as Melissa travels the globe going head-to-head with everything from world-class red stag and thousand pound gators to Boone and Crocket whitetails and thunderous bull elk. With rifle, bow or shotgun in hand, Melissa’s fast-paced, in-the-moment hunting style will keep you on the edge of your seat, while her expertise and decades of experience give viewers useful tips and strategies they can use afield. \nAbout Winchester Ammunition \nWinchester, The American Legend™, is a global leader in sporting, law enforcement, military and personal defense ammunition production. Winchester continues to raise the bar with new products like Long Beard™ XR™ and W Train and Defend™ personal defense ammunition. Visit www.winchester.com for product information or connect with us on Facebook at Facebook.com/WinchesterOfficial . \nWinchester Ammunition is a proud supporter of the NSSF’s Project ChildSafe. For more information on the Own It? Respect It. Secure It. SM Initiative, please log on to: www.NSSF.org/ORS", "external_links": [], "published": "2015-10-16T16:08:00.000+03:00", "crawled": "2015-10-16T16:22:07.482+03:00", "highlightTitle": ""}