{"organizations": [], "uuid": "2089f3d3889c3e90c30ddf313075f31edd51ee27", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "savannahnow.com", "main_image": "http://savannahnow.com/sites/default/files/images/sms-default-facebook-share.jpg", "site_section": "http://savannahnow.com/", "section_title": "savannahnow.com | Savannah Georgia's source for News, Entertainment, Sports, Weather, Classifieds, Jobs, Autos, Real Estate and St. Patricks Day", "url": "http://savannahnow.com/news/2015-10-11/teacher-year-winner-praised-her-work-education", "country": "US", "title": "Teacher of the Year winner praised for her work in education", "performance_score": 0, "site": "savannahnow.com", "participants_count": 1, "title_full": "Teacher of the Year winner praised for her work in education | savannahnow.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T20:24:00.000+03:00", "replies_count": 0, "uuid": "2089f3d3889c3e90c30ddf313075f31edd51ee27"}, "author": "Lee Shearer | Athens Banner-Herald", "url": "http://savannahnow.com/news/2015-10-11/teacher-year-winner-praised-her-work-education", "ord_in_thread": 0, "title": "Teacher of the Year winner praised for her work in education", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " By Lee Shearer | Athens Banner-Herald ATHENS, Ga. — Having a passion for one's work is a cliché of our times, but for Clarke County Teacher of the Year Lori Camden it's accurate.\n\"She is honestly one of the most passionate teachers I have ever known,\" said one who knows her well, Burney-Harris-Lyons Middle School principal Melanie Sigler, who's worked with Camden for 10 years.\n\"She is one of those people you look forward to seeing every day because she always comes in with a smile,\" Sigler said. \"Her positive energy just makes you excited about what you do every day.\"\nCamden edged out two other finalists, Desilyn Culliver of Gaines Elementary School and Marc Ginsberg of Cedar Shoals High School, for the 2015-16 teacher award.\nSigler was worried a couple of years ago when Camden asked for a private meeting with the principal. Was Camden about to quit?\n\"I'm getting burned out,\" she told Sigler, who thought for a minute her fears were confirmed. But instead of quitting, English/language arts teacher Camden said, \"I want a new challenge.\"\nAs it turned out, Sigler was thinking about asking Camden to take a new slot, teaching reading skills to students who'd fallen behind their classmates, and Camden was thinking about asking for the same job.\nNow Camden is in her second year of that work, and she's seeing her students' reading abilities grow.\n\"I love seeing my kids' faces when they finally get it,\" she said. \"It is the most rewarding feeling ever.\"\nHigh-energy almost all the time, Camden teaches as if there's a lot at stake, because there is.\n\"If we don't fix it, their chances of making it in the long run, in high school, are very, very slim,\" she said.\nStudents are in her class 57 minutes, and she tries to make every minute count, without turning children off.\n\"They've got to buy into me as a teacher in order for me to teach them,\" she said.\nShe noticed a pattern last year — her seventh- and eighth-grade students made good progress, but sixth-graders not as much. The older students knew her, she figured, or knew her reputation; the sixth-graders didn't. This year, sixth-graders are getting it, too, maybe because they've heard about her from older classmates or siblings.\n\"I just try to ingrain in them, it's fine if we get it wrong. If we keep trying, we'll eventually get it right,\" she said.\nLooking at Camden's background, you might say she was destined to be a teacher, but Camden didn't think so growing up in the Madison County town of Comer.\nBoth her parents are educators, along with two of her mother's siblings, as well as two of her grandparents.\nLike Sigler, many of Camden's students think she made the right career choice.\n\"She helps us,\" said Yaremi Sanchez.\n\"If we get something wrong, she helps us get it right,\" said sixth-grader Tommy Salazar.", "external_links": ["http://sav-cdn.com/sites/all/themes/savannahnow/images/blank.gif"], "published": "2015-10-11T20:24:00.000+03:00", "crawled": "2015-10-11T22:14:24.281+03:00", "highlightTitle": ""}