{"organizations": [], "uuid": "e831ad4aa7511c9579cb0d51fa4fd9fe494a388d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sltrib.com", "main_image": "http://www.sltrib.com/csp/mediapool/sites/dt.common.streams.StreamServer.cls?STREAMOID=QixdJbvMPQG3NrLtNA1xSc$daE2N3K4ZzOUsqbU5sYsoUW$BOaElGaJ7J9qZTVNUWCsjLu883Ygn4B49Lvm9bPe2QeMKQdVeZmXF$9l$4uCZ8QDXhaHEp3rvzXRJFdy0KqPHLoMevcTLo3h8xh70Y6N_U_CryOsw6FTOdKL_jpQ-&CONTENTTYPE=image/jpeg", "site_section": "http://sltrib.com//csp/cms/sites/sltrib/RSS/rss.csp?cat=Sports", "section_title": "Sports - The Salt Lake Tribune", "url": "http://www.sltrib.com/sports/3044751-155/prep-football-late-touchdown-lifts-hunter", "country": "US", "title": "Prep football: Late touchdown lifts Hunter over Viewmont, 30-23", "performance_score": 0, "site": "sltrib.com", "participants_count": 1, "title_full": "Prep football: Late touchdown lifts Hunter over Viewmont, 30-23 | The Salt Lake Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "e831ad4aa7511c9579cb0d51fa4fd9fe494a388d"}, "author": "TREVOR PHIBBS", "url": "http://www.sltrib.com/sports/3044751-155/prep-football-late-touchdown-lifts-hunter", "ord_in_thread": 0, "title": "Prep football: Late touchdown lifts Hunter over Viewmont, 30-23", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "West Valley • Hunter needed to travel nearly length of the field with less than minute remaining in a tie ballgame against Viewmont on senior night. The thought of playing conservatively for extra time never crept into the minds of the Wolverines.\n\"We're going to win it. No overtime,\" said Hunter coach Scott Henderson. \"We're going right now.\" \nPinned on its own end, Hunter baited Viewmont's safety into pursuing a decoy post route, which freed up receiver Olson Williams on the sideline. Quarterback McKay Meidlinger hit the speedy receiver, who streaked up the hashes and evaded one defender before plowing into the end zone with five seconds remaining to furnish Hunter's dramatic 30-23 win on Thursday.\n  \"Senior night,\" said Williams emotionally after collapsing into his teammate's shoulders. \"I was playing for my mom. She passed away about five years ago. I live with my aunt and uncle. I wouldn't be here without them.\"\nWilliams finished with three touchdowns, two interceptions — both of which led to scores, including the game-winner — several pass breakups and numerous jarring hits in his final regular-season home game, but the win essentially secured one of the top two seeds in Region 2 for Hunter, which is accompanied with home-field advantage in the postseason. \n\"What else do we ask? We ask our playmakers to step up,\" Henderson said of Williams.\nAfter trailing 16-0 at halftime, Viewmont reeled off 20 unanswered points in the third quarter on an 88-yard slip screen from Cole Huish to Cortland George, a 5-yard scamper by Huish and a blocked punt recovered by Hunter Burt with 3:30 in the third quarter.\n\"We had a good first half and then came out flat in the third quarter,\" Henderson explained. \"They punched us in the mouth, and that's one thing about our kids — we're resilient. We settled down in the fourth quarter and took care of the ball offensively, did some things defensively. We stepped up when we needed to.\"\nViewmont fumbled on the second play from scrimmage, as the ball bounced fortuitously into Hunter's Palepoi Gilmore's awaiting arms. The senior defensive back positioned Meidlinger's 7-yard touchdown pass to Williams with his 41-yard return. Williams found the end zone for the second time, putting Hunter up 13-0 in the second on a jet sweep after snagging an interception. David Mapa's pick with 3:41 remaining in the second set up Alma Hansen's 22-yard field goal as time expired for a 16-0 lead at intermission. \nThe Vikings predictability on offense in the first half — routinely resorting to dives, bubble screens and hitches — paired with their inability to generate any push at the point of attack equated to vanilla results, but in the third quarter Viewmont adjusted its scheme and exploited a mismatch by testing Hunter's secondary vertically with 6-foot-3 receiver Ryan Cleghorn.\nThe Wolverines eventually recaptured the lead on Duke Atiga's 10-yard rush in the fourth quarter before Viewmont pulled even at 23 apiece with 3:20 remaining on Preston Pitt's 24-yard field goal. The Vikings regained possession shortly thereafter with a defensive stop, but Williams' second interception with 36.2 on the clock set up the winning score.\n\"Yeah, honestly, yes,\" Williams said when asked if he knew he'd score once he caught it. \"Coach says catch every ball and go for that end zone.\"\ntphibbs@sltrib.com \nTwitter: @trevorphibbs", "external_links": [], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-10T02:17:27.554+03:00", "highlightTitle": ""}