{"organizations": ["Bulldogs for TEC", "Tigers", "Dakota Roach", "TEC"], "uuid": "0958d94f39a8e5ab47e773c5d7cdf408429464fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pal-item.com", "main_image": "http://www.gannett-cdn.com/-mm-/d91031d21a8ff16ee39d4754c6333f80a20a559c/c=0-793-2982-2478&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/02/INGroup/Richmond/635794191345971955-Dakota-Roach-mug.jpg", "site_section": "http://rssfeeds.pal-item.com/richmond/sports", "section_title": "Richmond IN - Sports", "url": "http://www.pal-item.com/story/sports/2015/10/02/tigers-topple-bulldogs-tec-win/73218696/", "country": "US", "title": "Tigers topple Bulldogs for TEC win", "performance_score": 0, "site": "pal-item.com", "participants_count": 0, "title_full": "Tigers topple Bulldogs for TEC win", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T05:38:00.000+03:00", "replies_count": 0, "uuid": "0958d94f39a8e5ab47e773c5d7cdf408429464fd"}, "author": "", "url": "http://www.pal-item.com/story/sports/2015/10/02/tigers-topple-bulldogs-tec-win/73218696/", "ord_in_thread": 0, "title": "Tigers topple Bulldogs for TEC win", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ron Greeson"], "text": "Tigers topple Bulldogs for TEC win Ron Greeson, For the Palladium-Item 10:38 p.m. EDT October 2, 2015 Dakota Roach 4 CONNECT TWEET LINKEDIN COMMENT EMAIL MORE \nCENTERVILLE, Ind. – In the rain and the wind Friday night, visiting Hagerstown and the host Bulldogs battled to earn a much-sought Tri-Eastern Conference win at Centerville’s Craig Field. \nIn the end, it was the Hagerstown Tigers who emerged victorious by a 33-8 score. It was the third win in a row for the 3-4 Tigers, now 3-2 in the conference. The 'Dogs fell to 0-7 and 0-5, respectively. \nThe Tigers took the lead in the first half when Dakota Roach ran 5 yards for a score late in the first quarter. \nThen two Bulldog turnovers resulted in short fields and Tiger touchdowns. Frankie Bush ran 37 yards for a touchdown after a fumble recovery, and then an interception by Brett Burns preceded a Clayton Barber run to paydirt. \nKeeton Adams kicked all three extra points and the Tigers led 21-0 before the 'Dogs rallied right before halftime on homecoming night. \nPreston Hurst returned the subsequent kickoff to midfield, then Centerville took the ball in to score. \nConsecutive runs by Kody Witham got the ‘Dogs close, then Dylan Benedict passed to Peyton Hobson for a 15-yard touchdown. Austin Vandevender then ran in the two-point conversion to make it 21-8. \nThe senior Roach was a big ground gainer throughout the game, and he scored on runs of 41 and 18 yards in the third quarter for the last 12 points of the game. \nHagerstown began its turnaround with a win at Ball State vs. Union County two weeks ago, and now have added wins over Tri High and Centerville after dropping four games, all against tough competition in Shenandoah, Knightstown, Northeastern and Winchester. \nHead coach Scott Snodgrass of Hagerstown is pleased with the continued good play of his charges. \n“I think the attitude and effort of the guys has been good all along, and I just think the belief may have picked up a little bit since we won that first one,” Snodgrass said. “We tried to throw it a little bit tonight, but the running game was working well with the conditions, and it was just easier to do that. The backs were running well, and the line was blocking well. \n“I thought coming in that we matched up well, and we had a good night tonight.\" \nRoach, a senior, was just one of several backs to break long runs in the game. \n“I am just looking for holes back there when I am running the ball,” Roach said of his approach when he takes a handoff. “The O-line does a good job, and I just look for room to run, then run hard.” \nHe had 11 carries for 103 yards, unofficially, in Friday’s win. \nCenterville had a chance to make a game of it early in the third quarter, recovering an onside kick, then driving the ball deep in Tiger territory, but fumbled the ball away. \nMoments later, Roach broke free for the first of his two third-quarter touchdowns. \n“I thought we had a good chance when we recovered the kick, but then we had the big turnover,” said Centerville head coach Perry Irwin. “The kids fought hard, but they have all year.\" \nNext week, both team play in conference road games, with Centerville going to Union County and Hagerstown to Union City 4 CONNECT TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http://pinews.co/1L9ArVF TOP VIDEOS", "external_links": [], "published": "2015-10-03T05:38:00.000+03:00", "crawled": "2015-10-03T06:18:15.054+03:00", "highlightTitle": ""}