{"organizations": ["Michigan State"], "uuid": "f35ba1a6e7f4bd0958dce714aa77e25d129cf73d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribtown.com", "main_image": "http://d1bdhkmqqz901h.cloudfront.net/1200x630/smart/s3.amazonaws.com/hne-smedia/7/b/7badc2d5a2ce4ea188c0c443dc14019a/web_full_996012059371.jpg", "site_section": "http://tribtown.com//feed/sec/6000", "section_title": "TribTown.com - Sports News", "url": "http://www.tribtown.com/view/story/7badc2d5a2ce4ea188c0c443dc14019a/FBC--T25-Michigan-State-Cloud-Nine", "country": "US", "title": "No. 7 Michigan State must come back to Earth after dramatic win; Indiana up next", "performance_score": 0, "site": "tribtown.com", "participants_count": 0, "title_full": "No. 7 Michigan State must come back to Earth after dramatic win; Indiana up next", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:01:00.000+03:00", "replies_count": 0, "uuid": "f35ba1a6e7f4bd0958dce714aa77e25d129cf73d"}, "author": "", "url": "http://www.tribtown.com/view/story/7badc2d5a2ce4ea188c0c443dc14019a/FBC--T25-Michigan-State-Cloud-Nine", "ord_in_thread": 0, "title": "No. 7 Michigan State must come back to Earth after dramatic win; Indiana up next", "locations": ["Earth", "Indiana"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["NOAH"], "text": "No. 7 Michigan State must come back to Earth after dramatic win; Indiana up next By NOAH TRISTER AP Sports Writer   8:01   8:01   \nPeople: \nMichigan (860) \nEAST LANSING, Michigan — Mark Dantonio finally settled on a name for the final play that gave Michigan State its incomprehensible victory over Michigan. \nIt's called Rangers: Mission 4:10. \n\"We were saying all week that mental is to physical as four is to one — that you had to be four times mentally tough than you were physically tough,\" Dantonio said. \"The ten seconds obviously comes in at the back end, with the last ten seconds of the game.\" \nThose 10 seconds will be replayed for years in this state, with the Spartans snatching victory when Michigan's punter fumbled a snap and Michigan State's Jalen Watts-Jackson ran the ball back for a touchdown and a 27-23 win. \nMichigan State basketball coach Tom Izzo was at Michigan Stadium with his son on Saturday — and had already started up the tunnel when the Spartans pulled off their stunning escape. \n\"I didn't actually see the exact play, believe it or not,\" Izzo said. \"That was like missing a free throw and then a guy throwing it behind his back the length of the court.\" \nThe seventh-ranked Spartans (7-0, 3-0 Big Ten) now have to find some way to come back to Earth and prepare for next weekend's game against Indiana. The Hoosiers (4-3, 0-3) are in last place in the Big Ten's East Division, but they played Ohio State tough earlier this month, and their fast-paced offense could be dangerous if Michigan State isn't sharp. \nThe Spartans have won seven of their last eight against Michigan, and they've also done a nice job avoiding letdowns in the immediate aftermath of those emotional wins. Since Dantonio took over as coach, Michigan State is 7-1 in games immediately following the matchup with Michigan. The only loss came last season, when the Spartans routed the Wolverines, then had an open date before losing at home to Ohio State. \n\"It's all about handling success I think,\" Dantonio said. \"Obviously the worst thing we can do is fall backwards here, so we need to continue to move forward and you know, our dreams are ahead of us, and they start this Saturday. So I think our players will be ready to play.\" \nWatts-Jackson had surgery on his hip after injuring himself on that desperate return. He returned to the Michigan State campus Monday. \n\"He was in good spirits,\" Dantonio said. \"The man, the legend, is back.\" \nQuarterback Connor Cook said he was getting treatment Monday when Watts-Jackson came into the training room using a walker. \n\"Word got around that he was in the training room,\" Cook said. \"Everyone was giving him hugs and telling him how much they loved him and how crazy the whole night was.\" \nDantonio said Watts-Jackson's hip has been repaired, but he has to stay off it for three months and could miss spring practice. \nNOTES: Watts-Jackson hasn't spoken to reporters since the play — he went to the hospital right away and had surgery Sunday. A Michigan State spokesman said he'll be made available once he's ready. ... One player who did talk Tuesday was RB Delton Williams, who was suspended in March, shortly after being arraigned on a charge of brandishing a firearm in public. He later pleaded guilty to a reduced charge. Williams was allowed to return to the Spartans this fall as a non-scholarship athlete, and he did not have a carry until two weekends ago at Rutgers. \"I apologize to anybody that feels that I let them down, but I'm making it right,\" Williams said. \"I tear up sometimes. I get a little sensitive sometimes when I think about it, because I know where I could be. Life is about battles. You just keep fighting.\" \nAP College Football: http://www.collegefootball.ap.org", "external_links": [], "published": "2015-10-21T03:01:00.000+03:00", "crawled": "2015-10-21T04:30:07.369+03:00", "highlightTitle": ""}