{"organizations": [], "uuid": "4812c87ec72b016bae0cc10205c5c2fba0d4443d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.torontosun.com", "main_image": "http://storage.torontosun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297755241538_LARGE_BOX.jpg?quality=80&stmp=1443747698321&size=100x", "site_section": "http://www.torontosun.com/sports/baseball", "section_title": "Baseball | Sports | Toronto Sun", "url": "http://www.torontosun.com/2015/10/01/world-series-champion-giants-pitcher-jeremy-affeldt-to-retire", "country": "CA", "title": "World Series champion, Giants pitcher Jeremy Affeldt to retire | MLB | Baseball", "performance_score": 0, "site": "torontosun.com", "participants_count": 1, "title_full": "World Series champion, Giants pitcher Jeremy Affeldt to retire | MLB | Baseball", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T02:40:00.000+03:00", "replies_count": 0, "uuid": "4812c87ec72b016bae0cc10205c5c2fba0d4443d"}, "author": "Janie McCauley, THE ASSOCIATED PRESS", "url": "http://www.torontosun.com/2015/10/01/world-series-champion-giants-pitcher-jeremy-affeldt-to-retire", "ord_in_thread": 0, "title": "World Series champion, Giants pitcher Jeremy Affeldt to retire | MLB | Baseball", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "San Francisco Giants reliever Jeremy Affeldt is retiring after the season, not a surprise move for the 14-year veteran as he turns his attention to family and further involvement with several causes he has worked with for years.\nThe left-hander announced Thursday this would be his last weekend of baseball as the reigning World Series champions end the year without a playoff berth. Affeldt, 36, was the 2014 World Series Game 7 winner at Kansas City and is completing an $18 million, three-year contract and his seventh season with the Giants.\nWhile Affeldt had kept open the idea of pitching one more year when this season began, he said he would listen to his three sons to help him make the decision -- if they wanted him home, that might win out. Wife Larisa had been supportive of him continuing to pitch.\nAffeldt also pitched for Kansas City, Colorado and Cincinnati. He has missed 34 games this season for two stints on the disabled list, with a strained pitching shoulder and a left knee injury. He twisted the knee during an Aug. 24 off day while playing with his sons outside Spokane, Washington, where he grew up and still lives.\nThat was just one of several fluke injuries sustained in off-the-field mishaps by the lefty in recent years.\nIn April 2011, he sprained his right knee and went on the DL after reaching out to catch his then-4-year-old, 60-pound son when the boy jumped off the couch to greet his father. On Sept. 8 that year, he sliced his non-throwing hand while separating frozen hamburgers during a barbecue with his family on an off-day. The paring knife he was using pushed through a hamburger patty and deep into his hand. Affeldt came within a millimeter of an artery and underwent surgery about eight hours later to repair nerve damage in his pinkie.\n\"I got hurt on the field, which is comforting to me,\" Affeldt later said of a more normal injury.\nAfter going 1-2 with a 2.70 ERA in 67 appearances over 63 1-3 innings during the 2012 season, Affeldt received his last contract. He has been part of a stable bullpen that has been such a key for manager Bruce Bochy's club in winning three of the past five World Series titles.\nThe Giants are out of the post-season this time in another odd-year miss after a title season.\nThe ex-military brat who is open about his deep faith released a book in 2013, \"To Stir a Movement: Life, Justice, and Major League Baseball.\" He acknowledged he overcame homophobia when he initially joined the Giants in 2009 and often would seclude himself in a hotel room.\nIn the book, he also acknowledged how he returned $500,000 to the Giants after a typo in the contract gave him an accidental bonus before the 2010 season.\nHe began his book and life story in Thailand, where Affeldt -- about 10 at the time -- was grabbed by a man and pulled toward a building as he fought to get away, only to have his dad catch up and help him escape.\nAffeldt has become a strong supporter of efforts to stop sex trafficking, and believes that's where he could have been headed that day. His father was stationed in Guam at the time, so they travelled regularly in Asia.\nGoing into Thursday's series finale against the Dodgers, Affeldt had a 43-46 career record and 3.97 ERA in 772 appearances spanning 924 2-3 innings with 28 saves. He joins right-hander Tim Hudson heading into retirement, and both will be recognized during games Saturday and Sunday against Colorado.\nTop stories Popular Latest Videos Has Taylor Swift cursed the Toronto Blue Jays?\n0\nJulian Fantino charged with assault over 1973 arrest\n0\nShould our health-care dollars really go to IVF for all?\n0\nOmar Khadr arrives in Toronto for visit with grandparents\n0\nBlue Jays bench falls short in never-ending Baltimore finale\n0\nChloe brings sporty chic to Paris Fashion Week\n0\n10 spooky spots where it's Halloween all year\n0\nHas Taylor Swift cursed the Toronto Blue Jays?\n0\nCurves ahead: How plus-size shopping is changing\n0\nDoes your doctor always know best?\n0\nZabi Akbari - Witness To Kirby Rd Fatal Crash\nVaughan crash eyewitness\nPlenty Of Work Left For Leafs\nPat Kane Video\nRaptors media day\nMore from Baseball\nYankees return to playoffs after two-year absence 0\nInside Toronto sun.com Life\nChloe brings sporty chic to Paris Fashion Week 0", "external_links": ["http://pubads.g.doubleclick.net/gampad/clk?id=182027221&iu=/3081/SMCO_ENUR_TSUN_EN_WEB", "http://pubads.g.doubleclick.net/gampad/clk?id=228633661&iu=/3081/SMCO_ENUR_TSUN_EN_WEB", "http://pubads.g.doubleclick.net/gampad/clk?id=182024221&iu=/3081/SMCO_ENUR_TSUN_EN_WEB", "http://pubads.g.doubleclick.net/gampad/clk?id=183052021&iu=/3081/SMCO_ENUR_TSUN_EN_WEB"], "published": "2015-10-02T02:40:00.000+03:00", "crawled": "2015-10-02T15:41:46.563+03:00", "highlightTitle": ""}