{"organizations": [], "uuid": "0da75cc443ec6b6b21dc052f66670d4c21a43d47", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.coloradodaily.com", "main_image": "http://extras.mnginteractive.com/live/media/site21/2015/1005/20151005__06DCSFBUw~1.jpg", "site_section": "http://feeds.coloradodaily.com/mngi/rss/CustomRssServlet/25/219106.xml", "section_title": "Sports", "url": "http://www.coloradodaily.com/sports/ci_28925972/cu-football-buffs-ground-game-losing-traction?source=rss", "country": "IL", "title": "CU football: Buffs' ground game losing traction", "performance_score": 0, "site": "coloradodaily.com", "participants_count": 1, "title_full": "CU football: Buffs' ground game losing traction", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T16:27:00.000+03:00", "replies_count": 0, "uuid": "0da75cc443ec6b6b21dc052f66670d4c21a43d47"}, "author": "Brian Howell \n\nBuffZone.com Writer", "url": "http://www.coloradodaily.com/sports/ci_28925972/cu-football-buffs-ground-game-losing-traction?source=rss", "ord_in_thread": 0, "title": "CU football: Buffs' ground game losing traction", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CU football: Buffs' ground game losing traction Colorado managed 77 yards Saturday in loss to Oregon By Brian Howell \nBuffZone.com Writer Posted: 10/05/2015 07:55:04 PM MDT Colorado tailback Phillip Lindsay, left, tries to shake a tackle by Oregon's Tyree Robinson during Saturday's game at Folsom Field. ( Jeremy Papasso / Staff Photographer ) \nLook at the numbers, and it might appear that the Colorado football team has finally found the high-powered running attack it has sought for years. \nA breakdown of those numbers, however, shows that CU isn't quite there. \nCU (3-2, 0-1 Pac-12) enters this week with the Pac-12's third-ranked rushing offense, yet looking for answers after compiling just 77 yards on the ground in Saturday's 41-24 loss to Oregon. \n\"I wasn't satisfied with the running game,\" CU head coach Mike MacIntyre said following the loss to the Ducks. \"We didn't run the ball as well as we'd like. We've got some running backs down, but that's no excuse. We have to be able to be more balanced. We just never really got in a rhythm.\" \nTo this point, CU is averaging 233.0 rushing yards per game and 4.8 yards per rush. In the Pac-12, only Oregon has more rushing touchdowns than CU's 14; the Ducks have 15. \nMost of the Buffs' damage, however, has come against three poor defensive teams — Hawaii (116th in rushing defense), Massachusetts (118th) and Nicholls (112th in FCS). Against those three teams, the Buffs have 963 yards (321 per game) and 12 touchdowns. \nRoom to run was hard to find against Colorado State and Oregon, though. \n\"We need to be able to execute a little bit better staying on the back side blocks,\" MacIntyre said. \"When we've been able to run the ball well, we've gotten to the second level and cut off the backers a few times and cut them down. That will help us.\" Advertisement \nGetting to the second level wasn't easy against Oregon or Colorado State. \nTailbacks Phillip Lindsay and Christian Powell combined for just 67 yards on their 22 carries against the Ducks. That duo had just 80 yards on 23 carries against CSU. \n\"We just have to get things going, get things working,\" said Powell, who scored on a 2-yard run against the Ducks. \"Just continue working on the little techniques, the little details, everything that goes with getting the running game going.\" \nHaving a full complement of players would help. \nMichael Adkins II has been CU's best tailback this season, gaining 209 yards and three touchdowns in the first two games. \nAdkins, however, injured his left hamstring on his first carry against Colorado State on Sept. 19. He essentially hasn't played the last three games and doesn't appear likely to play on Saturday against Arizona State (3-2, 1-1). \nThe Buffs have also played the last three games without highly regarded freshman Patrick Carr, who was also injured after just one carry against CSU. Carr, who brings some speed to the backfield, could return this week. \nPowell said it would be nice to have everybody on board, but said the struggles on the ground are \"just kind of an offense thing.\" \nEarly on against the Ducks, CU sent Powell on sweep left and he got hit for a 4-yard loss. During the final three quarters, the Buffs had just one outside run, sending Lindsay and Powell between the tackles almost exclusively. \nThe holes weren't there against Oregon, and they weren't there against CSU. The Buffs, however, believe they can find some success on the ground as they season goes along. \n\"We'll have some nights we can run it and we'll have some nights we won't run it as well,\" MacIntyre said, \"but I definitely believe we can run the football.\" \nCU in prime time again \nOn Monday, the Pac-12 announced that CU's Oct. 17 game against Arizona will kick off at 7 p.m. from Folsom Field, and that the game will be broadcast on Fox Sports 1. \nIt will mark CU's third consecutive night game. After kicking off with Oregon at 9:08 p.m. last week, the Buffs are scheduled for an 8 p.m. MDT kickoff this Saturday at Arizona State. \nCU has played 42 night games at Folsom Field over the years, going 24-16-2 in those games. \nBrian Howell: howellb@dailycamera.com , on Twitter: @BrianHowell33. \nColorado Buffaloes at Arizona State Sun Devils \nWhen: Saturday, 8 p.m. \nWhere: Sun Devil Stadium in Tempe, Ariz. \nTV: Pac-12 Network \nRadio: 850 AM Colorado tailback Christian Powell rushes into the end zone for a 2-yard touchdown run Saturday. ( Jeremy Papasso / Staff Photographer )", "external_links": [], "published": "2015-10-06T16:27:00.000+03:00", "crawled": "2015-10-07T00:08:56.210+03:00", "highlightTitle": ""}