{"organizations": [], "uuid": "d914ec27d6625ae5289d3d2a65bb8de9095b162a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.asiaone.com", "main_image": "http://news.asiaone.com/sites/default/files/original_images/Jul2015/20150729_Reuters_Platini.jpg", "site_section": "http://asiaone.feedsportal.com/c/34151/f/618420/index.rss", "section_title": "Sports", "url": "http://news.asiaone.com/news/sports/english-fa-suspends-support-platinis-fifa-candidacy", "country": "US", "title": "English FA suspends support for Platini's FIFA candidacy", "performance_score": 0, "site": "asiaone.com", "participants_count": 1, "title_full": "English FA suspends support for Platini's FIFA candidacy", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T15:37:00.000+03:00", "replies_count": 0, "uuid": "d914ec27d6625ae5289d3d2a65bb8de9095b162a"}, "author": "chenj@a1", "url": "http://news.asiaone.com/news/sports/english-fa-suspends-support-platinis-fifa-candidacy", "ord_in_thread": 0, "title": "English FA suspends support for Platini's FIFA candidacy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "English FA suspends support for Platini's FIFA candidacy Photo: Reuters English FA suspends support for Platini's FIFA candidacy Reuters | Friday, Oct 16, 2015 Shares Shares 1 \nLONDON - The English Football Association has suspended support for Michel Platini's bid to become FIFA president, after learning \"more information relating to the issues from Mr Platini's lawyers\", the FA said in a statement. \nPlatini, who is standing in the FIFA presidential election scheduled for Feb. 26, and incumbent Sepp Blatter were banned for 90 days by the FIFA Ethics Committee last week pending a full investigation into both men's activities. \nSwitzerland's attorney general's office initiated criminal proceedings against Blatter over a two million Swiss francs ($2.1 million) payment from FIFA to Platini in 2011 for work carried out by the Frenchman between 1998 and 2002. Both men have denied any wrongdoing. \nPlatini's lawyers gave a presentation to all UEFA member associations on Thursday. \n\"The FA wishes Mr Platini every success in fighting these charges and clearing his name, and has no interest in taking any action that jeopardizes this process,\" they said in a statement issued on the FA website on Friday. \n\"However, notwithstanding the above, at the UEFA meeting on Thursday, the FA learnt more information relating to the issues at the centre of this case from Mr Platini's lawyers. \n\"We have been instructed that the information must be kept confidential and therefore we cannot go into specifics. \n\"As a result of learning this information, the FA board has on Friday morning concluded that it must suspend its support for Mr Platini's candidature for the FIFA Presidency until the legal process has been concluded and the position is clear. \n\"A decision can then be taken on who to support in the Presidential election on 26 February 2016.\" Must read sports", "external_links": [], "published": "2015-10-16T15:37:00.000+03:00", "crawled": "2015-10-16T19:40:06.848+03:00", "highlightTitle": ""}