{"organizations": [], "uuid": "675e15aef500e648bcad02baf4cd22c819a6dc1f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/2/8/161259/World/Region/EU-adopts-legislative-framework-for-lifting-Iran-s.aspx", "country": "EG", "title": "EU adopts legislative framework for lifting Iran sanctions - Region - World", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "EU adopts legislative framework for lifting Iran sanctions - Region - World - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "675e15aef500e648bcad02baf4cd22c819a6dc1f"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/2/8/161259/World/Region/EU-adopts-legislative-framework-for-lifting-Iran-s.aspx", "ord_in_thread": 0, "title": "EU adopts legislative framework for lifting Iran sanctions - Region - World", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Iran says ready to start 'huge task' of dismantling centrifuges Obama orders steps towards lifting Iran sanctions Iran deal closer to reality as US prepares sanctions waivers The European Union on Sunday adopted the framework for lifting its sanctions against Iran, although the measure will only take effect once Tehran has met its obligations under a landmark nuclear deal, EU foreign policy chief Federica Mogherini said.\n\"This is another important milestone that brings us a step closer to the beginning of implementation of the (nuclear agreement agreed in July), to which we are strongly committed,\" Mogherini said in a joint statement with Iranian Foreign Minister Javad Zarif.\n\"Iran will now start the implementation of its nuclear-related commitments with the objective of full and effective completion,\" it added.\nThe EU announcement came shortly after President Barack Obama ordered the US government to also take steps towards lifting sanctions on Iran.\nThe procedures began 90 days after the UN Security Council endorsed the accord struck between six world powers and Tehran in Vienna on July 14, under which Iran agreed to curb its nuclear programme in return for relief from damaging economic sanctions.\nThe EU sanctions are expected to be dismantled \"around the end of the year or early next year\" after the International Atomic Energy Agency certifies that Iran has met its commitments, a Western diplomat told AFP on Friday.\nThe EU and US sanctions have proved very damaging, locking up billions in Iranian assets overseas and starving the oil-dependent economy of crucially needed technology and investment.", "external_links": [], "published": "2015-10-18T03:00:00.000+03:00", "crawled": "2015-10-19T08:14:25.585+03:00", "highlightTitle": ""}