{"organizations": [], "uuid": "c592ffe45a096490729706d351363e6b560a9027", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/3/12/152146/Business/Economy/Egyptian-business-activity-grows-at-slower-pace-in.aspx", "country": "EG", "title": "Egyptian business activity grows at slower pace in September -PMI - Economy - Business", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Egyptian business activity grows at slower pace in September -PMI - Economy - Business - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "c592ffe45a096490729706d351363e6b560a9027"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/3/12/152146/Business/Economy/Egyptian-business-activity-grows-at-slower-pace-in.aspx", "ord_in_thread": 0, "title": "Egyptian business activity grows at slower pace in September -PMI - Economy - Business", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Egypt business activity expands in August at sharpest rate of 2015: PMI Egypt's business activity falls in July as production drops: PMI Egypt business activity expands in June for first time in five months: PMI Business activity in Egypt expanded for the second consecutive month in September, although the pace of gains in output and new orders slowed, a survey showed on Monday.\nEgypt's economy is still struggling since a popular uprising ousted autocrat Hosni Mubarak in 2011 and was followed by political instability that kept foreign investors and tourists away.\nIn a survey, the Emirates NBD Egypt Purchasing Managers Index (PMI) for the non-oil private sector fell to 50.2 points in September, from an eight-month high of 51.2 in August, but stayed above the 50-point mark that indicates growth in activity.\nThe index was below 50 points for the first five months of 2015.\n\"Given ongoing weakness in the export sector, it is encouraging that the overall PMI index continued to show an expansion in private sector activity,\" said Jean-Paul Pigat, senior economist at Emirates NBD.\n\"While the pace of growth is moderate, the survey nevertheless points to a slight improvement in domestic demand in the first quarter of Egypt's fiscal year FY2015/16. The challenge will be to maintain this momentum through the remainder of the year.\"\nThe PMI's output sub-index eased to 51.5 points in September from 52.8 points in the previous month, and only one-in-five panellists reported improved activity due to stronger demand.\nThe new orders index slipped to 50.5 points, from August's 52 points, while the new export orders index shrank for the third consecutive month, to 47.8 points from 49.2 points a month earlier.\nThe employment index for the non-oil private sector fell to its lowest level in five months at 48.7 points, from 49.3 points in August.\nPresident Abdel Fattah al-Sisi has pledged to reduce the jobless rate to 10 percent over the next five years. Unemployment stood at 12.8 percent during the first three months of 2015 according to the government's statistics agency, but analysts believe actual unemployment may be higher.\nThe index of output prices fell to 49.5 points from 50.2 points in August.\nEgypt's urban consumer inflation has slowed, to 7.9 percent in August from 8.4 percent in July, official data showed in early September.", "external_links": [], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-06T04:52:58.441+03:00", "highlightTitle": ""}