{"organizations": ["Arizona Cardinals", "Pittsburgh Steelers", "NFL"], "uuid": "e7ada02b95316df35747a2cd31df8d075f7e632e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.whio.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/18/80/55/ab82a1e4fc674628a28faef66ee27698-ee4c957ecc644610aaa58888cd72173f-0.jpg", "site_section": "http://www.whio.com/feeds/categories/sports/", "section_title": "News | Sports", "url": "http://www.whio.com/ap/ap/top-news/browns-manziel-active-for-game-manuel-to-start-for/nn5Q9/", "country": "US", "title": "The Latest from NFL Week 6: Vick returns after shot to head", "performance_score": 0, "site": "whio.com", "participants_count": 0, "title_full": "The Latest from NFL Week 6: Vick returns after shot to head", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T21:49:00.000+03:00", "replies_count": 0, "uuid": "e7ada02b95316df35747a2cd31df8d075f7e632e"}, "author": "", "url": "http://www.whio.com/ap/ap/top-news/browns-manziel-active-for-game-manuel-to-start-for/nn5Q9/", "ord_in_thread": 0, "title": "The Latest from NFL Week 6: Vick returns after shot to head", "locations": ["Pittsburgh"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Vick", "J. Puskar", "Mike Vick"], "text": "Pittsburgh Steelers quarterback Mike Vick prepares to pass against the Arizona Cardinals in the first quarter an NFL football game Sunday, Oct. 18, 2015, in Pittsburgh. (AP Photo/Gene J. Puskar) Sponsored Links By The Associated Press The Associated Press \nThe latest from NFL games around the league on the sixth Sunday of the season (all times EDT): \n2:35 p.m. \nMichael Vick is back in for the Steelers. \nHe left after his helmet collided with a Cardinals defender's knee. But Vick returned on Pittsburgh's next series — and the Steelers offered this explanation for the QB's absence: He had dirt in his eye. \n— Will Graves reporting from Pittsburgh. \n___ \n2:15 p.m. \nSteelers backup quarterback Michael Vick went to the sideline after his helmet collided with the right knee of Arizona's Kevin Minter at the end of a play. \nVick was diving forward when he took the shot to the head. Referee Ed Hochuli checked on Vick as the quarterback stood up after the play. \nWhen Vick left, third-string QB Landry Jones came in and took his first regular-season NFL snap. \nVick started in place of Ben Roethlisberger, who missed a third consecutive game with an injured knee. \n___ \n1:50 p.m. \nAqib Talib and the Denver Broncos' defense keep stealing the football and scoring points. \nTalib ran back an interception of Josh McCown 63 yards for a touchdown on the second play of the second quarter against Cleveland — his eighth career return for a TD, the most in the NFL since 2009. \nIt was Denver's 15th takeaway and fourth defensive TD this season. \n— Tom Withers reporting from Cleveland. \n___ \n1:40 p.m. \nThe Minnesota Vikings would have taken a 2-0 lead in the first quarter against the Kansas City Chiefs had Jerome Boger's officiating crew not missed a safety. \nOn third-and-12 from the Kansas City 2, Chiefs left guard Ben Grubbs was called for holding Vikings defensive tackle Sharrif Floyd — and a holding call in the end zone is an automatic safety. \nBoger announced the penalty occurred in the field of play. \nBut replays indicated Floyd was held in the end zone — and Vikings coach Mike Zimmer was livid on the sideline. \nMike Pereira, former NFL VP of officiating and now a TV analyst for Fox, agreed with Zimmer, tweeting: \"After looking at it again, it's clearly a safety.\" \n— Jon Krawczynski reporting from Minneapolis. \n___ \n1:15 p.m. \nClock problems seem to be following the Pittsburgh Steelers around. \nOne game after 18 seconds were incorrectly run off late in the fourth quarter of the Steelers' victory at San Diego, Pittsburgh experienced another timing issue on the first play of scrimmage against visiting Arizona on Sunday. \nFlags flew before the Cardinals' opening snap for what would have been a delay-of-game penalty. But referee Ed Hochuli waived off the penalty, pointing out the play clock had started too early. \n— Will Graves reporting from Pittsburgh. \n___ \n1:05 p.m. \nShady's back. \nAfter missing time with a left hamstring injury, Buffalo running back LeSean McCoy's first carry Sunday — his first carry since Week 3 — went for 33 yards, his longest rush of the season. \nA great block by tight end Charles Clay sent McCoy free up the right side on the opening play from scrimmage in the Bills' game against Cincinnati. \n— John Wawrow reporting from Orchard Park, New York. \n___ \n12:25 p.m. \nMiami interim head coach Dan Campbell has made plenty of changes since replacing Joe Philbin nearly two weeks ago. Now he's made a couple more tweaks, this time to the starting lineup for the Dolphins (1-3). \nCampbell benched right guard Jamil Douglas and will start Billy Turner against the Tennessee Titans (1-3). He also benched starting wide receiver Greg Jennings in place of Kenny Stills. \nThe Tennessee Titans also made their own starting lineup change due to injury. Inside linebacker Avery Williamson is inactive with a strained hamstring. The second-year player out of Kentucky usually wears the coach-player communicator device in his helmet to call the defensive plays. \n— Teresa M. Walker reporting from Nashville, Tennessee. \n___ \n12:05 p.m. \nWith a light snow falling at Ralph Wilson Stadium, the Cincinnati Bengals (5-0) hit Buffalo seeking to match a franchise-best start to a season set twice, in 1975 and 1988. The Bengals' longest single-season winning streak is seven games, which they set in closing the 1970 season. \nQuarterback Andy Dalton has a three-game streak in which he's had 300-plus yards passing. That's one short of matching the franchise-record streak he set from Oct. 13-31, 2013. \nAs for the Bills (3-2), they have a chance to open a season 4-2 or better for the first time since 2011, and just the third time since 2000. Buffalo has also lost two straight home games — its worst streak since losing three straight in 2011. \n— John Wawrow reporting from Orchard Park, New York. \n___ \n11:55 a.m. \nThe Minnesota Vikings have a surprise scratch from the lineup: defensive end Everson Griffen. \nGriffen was out with an unspecified illness, according to the team, leaving the Vikings without their best pass rusher against Kansas City. The Chiefs allowed 22 sacks over their first five games, tied for most in the NFL with Seattle. \nGriffen has three sacks in four games this season. In his past 20 games since becoming a full-time starter, he has 15 sacks. The Vikings were also without backup defensive end Justin Trattou, who was out for the second straight game because of a foot injury. That left them with only three healthy defensive ends: starter Brian Robison, rookie Danielle Hunter and second-year pro Scott Crichton. Hunter was in the starting lineup for Griffen. \n— Dave Campbell reporting from Minneapolis. \n___ \n11:50 a.m. \nBrowns quarterback Johnny Manziel is active for Sunday's game despite being involved in a domestic incident this past week. \nManziel will back up starter Josh McCown as the Browns host the unbeaten Denver Broncos. \nManziel acknowledged to police that he drank alcohol on Monday before the former Heisman Trophy winner and his girlfriend, Colleen Crowley, were questioned after they were involved in a heated argument on the highway. According to a police report, Manziel was driving at a high rate of speed and passed cars on the shoulder before police were called. \nManziel was not arrested. \nThe Browns released a statement Friday saying they had spoken to Manziel about his behavior. However, the team did not exclude him from Sunday's game. \nThe incident raised concerns about Manziel, who spent 70 days in a rehab facility during the offseason for an unspecified condition. \n— Tom Withers reporting from Cleveland. \n___ \n11:40 a.m. \nBills starting quarterback Tyrod Taylor is out, and running back LeSean McCoy is returning after missing two weeks for Buffalo's game against the Cincinnati Bengals. \nBackup EJ Manuel will make his first start in a little more than a year in place of Taylor, who sprained his left knee in a 14-13 win over Tennessee last weekend. McCoy returned to practice last week, and will start after being nagged by a pulled left hamstring he initially injured during training camp. \nBuffalo is still without backup running back Karlos Williams, who will miss his second straight game with a concussion. \nStarting receiver Sammy Watkins is active after missing two weeks with a right calf injury. However, receiver Percy Harvin has been ruled out because of a hip injury. \n— John Wawrow reporting from Orchard Park, New York. \n___ \nAP NFL websites: http://pro32.ap.org and http://twitter.com/AP_NFL Copyright The Associated Press Sign up for our WHIO-TV Daily Headlines Newsletter Sign Up", "external_links": [], "published": "2015-10-18T21:49:00.000+03:00", "crawled": "2015-10-18T21:59:48.942+03:00", "highlightTitle": ""}