{"organizations": [], "uuid": "a0e491b90a4b76082e7ca4babe2fc7bd8396c607", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usatoday.com", "main_image": "http://www.gannett-cdn.com/-mm-/a045ffd366331620d6c19d5e977a8c93356c83dd/c=0-160-3828-2313&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/26/USATODAY/usatsports/be013ecb2a045d2f850f6a706700a2de.jpg", "site_section": "http://www.usatoday.com/sports/", "section_title": "USA Today | Sports", "url": "http://www.usatoday.com/story/sports/ncaab/2015/10/26/louisville-begins-with-youth-distraction-of-a-sex-scandal/74626402/", "country": "US", "title": "Louisville begins with youth, distraction of a sex scandal", "performance_score": 0, "site": "usatoday.com", "participants_count": 0, "title_full": "Louisville begins with youth, distraction of a sex scandal", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T19:05:00.000+02:00", "replies_count": 0, "uuid": "a0e491b90a4b76082e7ca4babe2fc7bd8396c607"}, "author": "", "url": "http://www.usatoday.com/story/sports/ncaab/2015/10/26/louisville-begins-with-youth-distraction-of-a-sex-scandal/74626402/", "ord_in_thread": 0, "title": "Louisville begins with youth, distraction of a sex scandal", "locations": ["Louisville"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Photo: The Associated Press)\n1 CONNECT TWEET LINKEDIN COMMENT EMAIL MORE LOUISVILLE, Ky. (AP) — Louisville is facing challenges on the court, and off of it heading into the season.\nThe Cardinals have such a young roster that coach Rick Pitino signed a couple of graduate transfers to provide leadership.\nThen came the escort allegations this month.\nKatina Powell has alleged that former Cardinals staffer Andre McGee hired her and other dancers to strip and have sex with players and recruits from 2010-14. Four investigations have been launched, and the scrutiny has raised questions about the Hall of Fame coach's future with the program.\nPitino has denied knowledge of the activities alleged in Powell's book and vows not to resign. Players have been told not to discuss the sex scandal, but the Cardinals (27-9, 12-6 ACC) will probably be reminded of it often by opposing fans and asked about it during their second season of Atlantic Coast Conference play.\nPitino is skipping this week's ACC media day to allow the event to remain focused on basketball instead of the allegations. He's taking the same approach with his team, which includes seven newcomers.\n\"They're all very talented,\" Pitino said of the group. \"We can shoot; we can shoot free throws, which is a welcome sight. We've got a lot of potential because our young guys will grow and get better and better.\"\nLouisville lost four regulars from last season's squad that reached the NCAA East Region final. Pitino landed five freshmen that he has declared as his best class ever at the school: forwards Deng Adel and Ray Spalding, and guards Jay Henderson, Donovan Mitchell and Ryan McMahon.\nPitino even added his version of \"one-and-dones\" with fifth-year players Damion Lee (Drexel) and Trey Lewis (Cleveland State), whose experience and leadership is critical to developing this young group.\nFor the 6-foot-6 Lee, the role is nothing new.\n\"Here, it's great because it's not just me being a leader,\" he said, referring to junior forward Mangok Mathiang. \"But overall it's not much different, because leadership is leadership.\"\n___\nHere are other things to watch in Louisville's season:\nQ FACTOR: Though 6-3 Lewis was brought in to provide some backcourt experience, sophomore Quentin Snider appears to be the point man for the Cardinals. Taking over after the late-season dismissal of Chris Jones, Snider showed promise as a floor leader and shooter in averaging 4.1 points, 1.6 rebounds and 1.3 assists per game. \"\nMATURING BIG MEN: How much sophomore 7-footers Anas Mahmoud and Mats Stockman play this season remains to be seen, but they have a better grasp of American basketball. Mahmoud, from Egypt, has gained more weight necessary to bang inside to go along with solid defensive and shooting skills. Stockman, a native of Norway, is running the floor better and has shown signs of becoming a rim protector as well.\nREADY AND ADEL: Deng Adel was impressive on both ends of the floor in both scrimmages and could be the versatile small forward Pitino has sought. More important than being a strong shooter and ball handler is the 6-7 Sudan native's defensive ability that could make him a part of his coach's defensive trademark defensive strategy.\nKEY GAMES: The Cardinals travel to Michigan State on Dec. 2 in a rematch of last year's regional final. They also visit rival Kentucky on Dec. 26 and play a home-and-home series with defending NCAA champion Duke in February after facing the Blue Devils just once last season.\nHARD LESSONS: The Cardinals won just once during an August tour against Pitino-coached Puerto Rican national teams featuring professional and veteran players. The upside is Louisville built chemistry that has smoothed the transition for the newcomers. \"It gave me a great gauge of what we need to work on, where we're going to pursue our weaknesses and understand what our strengths were,\" Pitino said. \"It was great for them for that reason alone.\"\n___\nFollow Gary B. Graves on Twitter: www.twitter.com/GaryBGraves\n___\nAP College Basketball: www.collegebasketball.ap.org\n1 CONNECT TWEET LINKEDIN COMMENT EMAIL MORE Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.\nTOP VIDEOS", "external_links": ["https://twitter.com/intent/tweet?url=http%3A//usat.ly/1N2yZFU&text=Louisville%20begins%20with%20youth%2C%20distraction%20of%20a%20sex%20scandal&via=usatoday", "http://www.linkedin.com/shareArticle?url=http%3A//usat.ly/1N2yZFU&mini=true", "http://www.gannett-cdn.com/-mm-/a0afbb18533581e0091b29287e7e948ce54ad8ef/c=264-0-3563-2474&r=x404&c=534x401/local/-/media/2015/10/26/USATODAY/usatsports/be013ecb2a045d2f850f6a706700a2de.jpg"], "published": "2015-10-26T19:05:00.000+02:00", "crawled": "2015-10-26T18:33:56.763+02:00", "highlightTitle": ""}