{"organizations": [], "uuid": "124a56be1e276303ab36dc0f75fc51d62bdf0015", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eagletribune.com", "main_image": "http://bloximages.chicago2.vip.townnews.com/eagletribune.com/content/tncms/assets/v3/editorial/e/fb/efbd58ba-0708-51c1-b544-498a402f9281/561d4dc60f124.image.jpg", "site_section": "http://www.eagletribune.com//search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&nsa=eedition&c[]=sports,sports/*&f=rss", "section_title": "Eagle-Tribune - sports,sports/", "url": "http://www.eagletribune.com/sports/saluting-our-area-s-unsung-heroes/article_3efe4bdb-9334-5e58-8ad2-4717c8aff7ea.html", "country": "US", "title": "Saluting our area’s Unsung Heroes", "performance_score": 0, "site": "eagletribune.com", "participants_count": 1, "title_full": "Saluting our area’s Unsung Heroes", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T07:00:00.000+03:00", "replies_count": 0, "uuid": "124a56be1e276303ab36dc0f75fc51d62bdf0015"}, "author": "Michael Muldoon mmuldoon@eagletribune.com", "url": "http://www.eagletribune.com/sports/saluting-our-area-s-unsung-heroes/article_3efe4bdb-9334-5e58-8ad2-4717c8aff7ea.html", "ord_in_thread": 0, "title": "Saluting our area’s Unsung Heroes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Saluting our area’s Unsung Heroes \nUnsung Hero Julia Dello Russo plays soccer for Central Catholic Saluting our area’s Unsung Heroes \nUnsung Hero John Burgess runs for Haverhill. Saluting our area’s Unsung Heroes \nUnsung Hero Abi ScovottI plays field hockey for Haverhill Posted: Friday, October 16, 2015 12:00 am \nSaluting the overachievers, the quiet leaders and the often overlooked athletes in local high school sports. \nCoaches or ADs should send nominations to Unsung Heroes writer Michael Muldoon at mmuldoon@eagletribune.com . \nJohn Burgess \nTop of the Class \nBurgess is a young man of many talents. \nHe’s ranked fifth overall in his class and he was named a National Merit Scholar Commended Student. Musically, he’s a big star in the Haverhill High drama club (suggestion: check out “A Christmas Carol” this winter) and sang the national anthem at the Haverhill Invitational track meet last spring. \nHis whole family is musically inclined including his mother, Erin, the chorus director at Ward Hill Church. \nThe 5-foot-10 cross country tri-captain may be the most improved Hillie. He’s been in the Hillies’ top five throughout the fall. \nJohn works at DiBurro’s and enjoys the movie “Jaws,” chocolate animal crackers, “Seinfeld,” actress Estelle Harris, Dustin Pedroia and art teacher Jeffrey Paszko. \nJulia Dello Russo \nDello Russo has played every position except goalie. \n“Julia is our vocal leader at practice and a fan favorite,” said coach Casey Grange. \nThe senior from Wilmington’s favorite athletic accomplishment is being named a tri-captain. She followed her sister, Olivia (CCHS ‘14), to Central. \nDuring the summer she worked for Andover dentist Dr. Lombardo. Dello Russo hopes to attend Mass. College of Pharmacy to study sonography. \nJulia has a dog, a miniature dachshund named Benny. Near the top of her bucket list is visiting the family’s home in Italy. \nDello Russo’s favorites include the movie “A Walk to Remember,” the TV show “Grey’s Anatomy” and its McDreamy star Patrick Dempsey, soccer star Abby Wambach and English teacher Katie Andrade. \nABI SCOVOTTI \nHaverhill Field Hockey \nRough, Tough Hillie \nScovotti won’t back down from anyone or anything. She battled mononucleosis in the preseason and to get ready for games she and her teammates like to play pick-up football. \n“When the ball goes into the defensive end, Abi is always there to make a key stop,” said coach Christopher Drew. \nAbi also plays lacrosse for the Brown and Gold. Her sister, Madeline (HHS ‘13), played field hockey and tennis. \nAbi is the manager of the girls’ hockey team and works at Carter’s Ice Cream. The National Honor Society student is looking to major in education with Michigan State, Clemson and South Carolina her favorite schools. \nShe has two dogs, Bichons named Stella and Percy. \nHer favorite TV show is “Zoey 101” and her favorite movie is “Lilo and Stitch.” Sign Up / Sign In With your existing account from... {* loginWidget *}", "external_links": [], "published": "2015-10-16T07:00:00.000+03:00", "crawled": "2015-10-16T07:28:23.607+03:00", "highlightTitle": ""}