{"organizations": ["Carver-Hawkeye Arena", "Whitney Jennings"], "uuid": "913a148de76672ad1db2307dd8efb669c7b77c25", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.desmoinesregister.com", "main_image": "http://www.gannett-cdn.com/-mm-/5ec4aea8d15ff90df5cfd0eaa783c6b87ef8c328/c=0-383-2838-1986&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/14/IAGroup/IowaCity/635804438630210154-PC.NCAAWBB.IowaVAmerican.032015.JustinTornerPhoto-16.jpg", "site_section": "http://rssfeeds.desmoinesregister.com/desmoines/sports", "section_title": "Des Moines - Sports", "url": "http://www.desmoinesregister.com/story/sports/2015/10/14/des-moines-register-sports-roundup-october-fourteenth/73969520/", "country": "US", "title": "Lisa Bluder likes early competition among Iowa women", "performance_score": 0, "site": "desmoinesregister.com", "participants_count": 0, "title_full": "Lisa Bluder likes early competition among Iowa women", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:27:00.000+03:00", "replies_count": 0, "uuid": "913a148de76672ad1db2307dd8efb669c7b77c25"}, "author": "", "url": "http://www.desmoinesregister.com/story/sports/2015/10/14/des-moines-register-sports-roundup-october-fourteenth/73969520/", "ord_in_thread": 0, "title": "Lisa Bluder likes early competition among Iowa women", "locations": ["Miami", "American", "Iowa", "Iowa City"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Lisa Bluder", "Aaron Zimmerman", "Ryan Murken"], "text": "Lisa Bluder likes early competition among Iowa women The battle for minutes is fierce for the Iowa women's basketball team. Post to Facebook Lisa Bluder likes early competition among Iowa women The battle for minutes is fierce for the Iowa women's basketball team. Check out this story on press-citizen.com: http://icp-c.com/1LuBuzN Cancel Send A link has been sent to your friend's email address. Posted! A link has been posted to your Facebook feed. Join the Conversation To find out more about Facebook commenting please read the Conversation Guidelines and FAQs Lisa Bluder likes early competition among Iowa women Ryan Murken, rmurken@press-citizen.com 7:27 p.m. CDT October 14, 2015 Iowa's Whitney Jennings (15) strips the ball from American's Aaron Zimmerman (13) during the first half of play of the first round game of the NCAA Div I Women's Basketball Championship at Carver-Hawkeye Arena in Iowa City on Friday, March 20, 2015. Iowa advanced to play Miami on Sunday in the second round of the tournament with a 75-67 victory. (Justin Torner/Freelance for the Press-Citizen) (Photo: Press-Citizen File Photo) \nLisa Bluder doesn’t need to be reminded who is missing from last year's Sweet 16 squad. \nJudging from the energy level the Iowa women's basketball coach has witnessed during the first week of practice, current players don’t need a reminder about the openings, either. \nWith three starters gone from last year’s Iowa team that finished 26-8 and advance to the NCAA regional semifinals, the competition for starting spots and minutes has been intense since practice opened Oct. 5. \n“The competition is just at a different level because of the opportunity for minutes, and they know that,” Bluder said. “They are smart. They know what we’ve lost and what is open and what is available.” \nIowa must replace three starters in departed seniors Bethany Doolittle, Samantha Logic and Melissa Dixon. That trio combined to account for more than 53 percent of the Hawkeyes' scoring a year ago. \nAn extra incentive hasn't been needed to get players' attention. \n“They are competing every day in practice,” Bluder said. “I haven’t talked about going hard, I haven’t talked about staying focused, because they know what is at stake. So that is kind of nice.\" \nJunior Ally Disterhoft, announced Wednesday as a preseason all-Big Ten Conference selection by league coaches , is the lone Iowa returner to average double figures a year ago. She tied for the team-lead at 14.8 points per game. \nSophomore Whitney Jennings, who made 31 starts a year ago as a freshman, is the other returning starter. Jennings averaged 9.1 points per game as a freshmanl. \n“Whitney didn’t have the biggest jump to make, but she has made a jump,” Bluder said. “She was already pretty darn good.” \nSenior captain Kali Peschel has 22 starts in her career and should be in for a bigger role this season after averaging a career-best 5.1 points per game in 2014-15. \nPeschel, who joins Disterhoft as captains, is expected to help pick up a directive role. \n“We lost a lot of leadership with our three captains last year, and that is something we have to continue to work on,” Bluder said. “Ally and Kali are doing a nice job with that, and we are just trying to help them learn to become better leaders.” \nThere is a lot to be sorted out between now and the Nov. 13 opener against North Dakota. With eight underclassmen on its roster, Iowa will have more than a few players working into new roles this winter. \nBluder has liked what she has seen from sophomore forward Carly Mohns and said freshmen Megan Gustafson and Tania Davis would \"definitely be in the mix of things.\" \nA 6-foot-3 post, Gustafson is a candidate to help replace Doolittle’s production in the paint. The 5-foot-4 Davis is a likely replacement for Logic at point guard. \nMohns saw action in 14 games a year ago, averaging less than five minutes per game. \n“The most improved freshman from last year to this year is Carly Mohns,” Bluder said. “I really like what she is doing. She is shooting the 3-pointer confidently, she is rebounding extremely well for us, and she looks like she belongs.\" \nReach Ryan Murken at 319-339-7369 or rmurken@press-citizen.com and follow him on Twitter at @rmmurken .", "external_links": [], "published": "2015-10-15T03:27:00.000+03:00", "crawled": "2015-10-16T03:55:43.939+03:00", "highlightTitle": ""}