{"organizations": [], "uuid": "44fb0c930d0ac7919022f57e5f3d3f276c6193f4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/1/64/153826/Egypt/Politics-/Egypts-Administrative-Prosecutors-to-form-parliame.aspx", "country": "EG", "title": "Egypt's Administrative Prosecutors to form parliamentary elections operations room - Politics - Egypt", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Egypt's Administrative Prosecutors to form parliamentary elections operations room - Politics - Egypt - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "44fb0c930d0ac7919022f57e5f3d3f276c6193f4"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/1/64/153826/Egypt/Politics-/Egypts-Administrative-Prosecutors-to-form-parliame.aspx", "ord_in_thread": 0, "title": "Egypt's Administrative Prosecutors to form parliamentary elections operations room - Politics - Egypt", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Egypt's Wafd Party invokes past glories in parliamentary bid For the Love of Egypt: High profile, low on politics in parliament race Sawiris: Free Egyptians party not looking for majority in parliament INTERVIEW: Former NDP members will definitely be in 2015 Egypt's parliament, says expert The Administrative Prosecution Authority Club issued a decision Tuesday to form a central operations room in order to monitor the parliamentary election process, state news agency MENA reported.\nThe operations room will receive comments and complaints from the judges responsible for supervising the electoral process, and will serve as a link between the Administrative Prosecution Club and the Higher Elections Committee.\nThe number of administrative prosecution members who will supervise the elections, set to begin on 18 October, is 2,500, according to judge Ahmed Galal, the Administrative Prosecution Authority spokesperson.\nAround 16,000 members of different judicial bodies, including administrative prosecutors, judges, and State Council members, will supervise the election process inside polling stations. They will be stationed in general and secondary councils, in addition to coordination councils in the governorates involved in the first phase of the elections.\nThe operations room will continue working until the election results are announced, and will issue a report with observations about the electoral process which will be submitted to the Higher Elections Committee.", "external_links": [], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-14T00:33:31.576+03:00", "highlightTitle": ""}