{"organizations": [], "uuid": "ab9f6c057aa89e6c3b97ed26a7cee1d6bd3a8706", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/2/8/155876/World/Region/France-signs-deals-worth--bn-with-Saudi-Arabia.aspx", "country": "EG", "title": "France signs deals worth $10 bn with Saudi Arabia - Region - World", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 2, "title_full": "France signs deals worth $10 bn with Saudi Arabia - Region - World - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 1, "uuid": "ab9f6c057aa89e6c3b97ed26a7cee1d6bd3a8706"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/2/8/155876/World/Region/France-signs-deals-worth--bn-with-Saudi-Arabia.aspx", "ord_in_thread": 0, "title": "France signs deals worth $10 bn with Saudi Arabia - Region - World", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Saudi foreign minister sees no future for Bashar in Syria Saudi executed for killing policeman Saudis tell Russia: Syria action will have \"dangerous consequences\": Source Putin meets Saudi defence minister amid differences over Syria France on Tuesday announced a series of deals worth 10 billion euros ($11.4 billion) with Saudi Arabia, reinforcing growing ties between the two countries.\nPrime Minister Manuel Valls announced the deals, some still to be finalised, on Twitter during a visit to Riyadh.\nHe said they showed that his government was \"mobilised for our companies and employment\".\nThe agreements include contracts and letters of intent between the two countries, whose economic and political ties have grown under President Francois Hollande.\nOne agreement was a Saudi order for 30 patrol boats, while another will create a Saudi fund for investment in small- and medium-sized French businesses.\nThe lifting of an embargo on French beef, imposed over \"mad cow\" disease, will allow 37 French firms to resume exports to the Gulf kingdom, Valls' office said.\nOther deals under discussion could cover telecommunications and surveillance satellites, urban transport and energy.\nFrance is the third-largest investor in Saudi Arabia, and Valls said he expects additional deals to be finalised.\n\"We don't doubt for one instance that these letters of intent will be confirmed,\" said Valls.\nThe announcements came during the third high-level visit this year by French officials to the world's largest oil exporter.\nFrance has boosted ties with the conservative Islamic kingdom -- the Arab world's largest economy -- despite persistent criticism from rights activists of its record on civil liberties.\nFor Saudi Arabia, expanding ties with France are part of an effort to build alliances beyond its traditional defence partner the United States, to counter Riyadh's regional rival Iran.\nValls late on Monday opened a forum to promote commercial ties between French and Saudi firms.\nHe is on a regional tour which has already taken him to Jordan and Egypt, along with Defence Minister Jean-Yves Le Drian.\nForeign Minister Laurent Fabius is also in Riyadh.\nHollande visited in January to pay his respects after king Abdullah died, and in May returned to become the first Western leader to attend a Gulf Cooperation Council summit.\nThe order for patrol boats is the latest in a series of weapons deals Paris has made in the region this year.\nOn Saturday, Egypt signed a deal with France to buy two Mistral warships originally ordered by Russia.\nAccording to French government sources, Egypt will pay 950 million euros, with \"significant\" financing from Saudi Arabia.\nFrance this year also sold 24 Rafale warplanes to Egypt and Qatar.\nIn Cairo, Valls highlighted joint efforts against extremism, saying: \"We all have a common enemy -- Daesh.\"\nHe was using an Arabic acronym for the jihadist Islamic State group which has seized territory in Syria and Iraq, where it has carried out widespread atrocities, and inspired attacks elsewhere.\nBoth France and Saudi belong to the US-led coalition that has bombed IS which has also claimed responsiblity for attacks in the kingdom this year.\nRiyadh and its Sunni-dominated neighbours accuse their Shiite regional rival Iran of meddling in Iraq, Syria, Lebanon and Yemen.\nSince March, Riyadh has led an Arab coalition backing local Yemeni forces, first with air strikes and now also with ground troops, against Iran-supported Huthi rebels who had seized much of Yemen.\nHuman rights watchdogs have repeatedly criticised the coalition's aerial bombardment of Yemen, saying they had hit with no military targets.\nFrench aid agency Action Against Hunger (ACF) on Monday said Valls's visit seemed to favour negotiating contracts, notably military ones \"with a powerful economic ally\", instead of looking for diplomatic solutions to the war in Yemen where civilians are suffering.\nThe French delegation was discreet on the subject of human rights, but Valls told reporters he had \"called for clemency\" for Ali al-Nimr, a member of the minority Shiite community facing the death penalty.\nNimr was just 17 when arrested in February 2012 after taking part in pro-reform protests, and his case has raised international concerns.", "external_links": [], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-14T00:37:36.575+03:00", "highlightTitle": ""}