{"organizations": [], "uuid": "5e98dec78b815211f955914df594234c5c0650dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.vindy.com", "main_image": "http://media.vindy.com/content/image/a/5/logo/v5logo.gif", "site_section": "http://www.vindy.com/rss/headlines/kindle/sports", "section_title": "Vindy.com stories: Sports News", "url": "http://www.vindy.com/news/2015/oct/26/james-vows-to-not-cut-corners/", "country": "US", "title": "James vows to not cut corners", "performance_score": 0, "site": "vindy.com", "participants_count": 0, "title_full": "James vows to not cut corners", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T06:00:00.000+02:00", "replies_count": 0, "uuid": "5e98dec78b815211f955914df594234c5c0650dc"}, "author": "", "url": "http://www.vindy.com/news/2015/oct/26/james-vows-to-not-cut-corners/", "ord_in_thread": 0, "title": "James vows to not cut corners", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["James"], "text": "Published: Mon, October 26, 2015 @ 12:00 a.m. \nAssociated Press \nCLEVELAND \nLeBron James won’t cut any corners to prolong his NBA career. \nAfter practicing for the first time since receiving an anti-inflammatory injection in his back, increasing the chances he’ll play in Tuesday’s season opener in Chicago, James said he would never consider sitting out practices to preserve his body. \n“I haven’t gotten to this point by cheating the game,” the four-time MVP said. “If I’m capable of practicing, I will practice. If I’m capable of playing, I’ll play. When I’m not, I’ll quit. The game has gave too much for me to ever cheat the game. That’s not how I was born. That’s not how I was taught. \n“And when I’m not able to do it to my level, then I’ll quit. It’s that simple.” \nJames had been limited to shooting drills and conditioning since getting the shot in his back Oct. 13, a day after playing in his second exhibition game. But he took part in every aspect of Cleveland’s workout Sunday and said how his back responds will determine whether he plays against the Bulls. \n“The real test will be how I feel tomorrow when I get up,” he said. “It was good to be back out there with the guys.” \nThe 30-year-old James received a similar shot early last season, when he was slowed by back pain and a strained left knee. He returned refreshed and led the Cavs to the NBA Finals, where he posted the best individual stats by any player in league history. \nBut as he enters his 13th season, there are some signs James is slowing down. He missed a career-high 13 games last season and he has logged nearly 44,000 minutes. James sat out five of Cleveland’s seven exhibition games during this preseason, and the team has discussed reducing his minutes further to keep him fresh for the playoffs — and maybe a run at his third title. \nJames laughed when he was asked if he felt “fresh” heading into the season. \n“Nah,” he said. “My rookie year I was fresh. I feel good. I still got some more rehab to do to continue to get everything stronger and get my back right. The test will be tomorrow, coming after getting some contact, bumping and hitting screens, but I feel pretty good.” \nJames said he did not sustain any injury during the preseason and the injection and rest program had “been in the works.” And if has any setbacks and needs to sit down, James said he will if necessary. \nAlthough his stats were down last season, James is in great shape and believes he can play at his unrivaled level. \n“It’s for me now to go out and prove it to myself,” James said. \nThe Cavs, who were ravaged by injuries during their postseason run to the finals, will begin this season at less than full strength. In addition to James’ back issues, All-Star guard Kyrie Irving remains sidelined after undergoing surgery to repair a broken kneecap. \nAlso, forwards Kevin Love (shoulder surgery), Anderson Varejao (Achilles injury), Tristan Thompson (contract holdout) and center Timofey Mozgov (knee surgery) are working their way back into shape, and guard Iman Shumpert (wrist surgery) will be out two more months. Other stories of interest", "external_links": [], "published": "2015-10-26T06:00:00.000+02:00", "crawled": "2015-10-26T16:18:08.539+02:00", "highlightTitle": ""}