{"organizations": [], "uuid": "b95a96be682c9482c3f7f4ea439fb91d9a197481", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/4b27d9ee9f22dd445df1a5aedb932c2e.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/football/west-broms-james-mcclean-gets-fa-warning-but-escapes-ban/6962300/", "country": "JE", "title": "West Brom's James McClean gets FA warning, but escapes ban", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "West Brom's James McClean gets FA warning, but escapes ban", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T19:31:00.000+03:00", "replies_count": 0, "uuid": "b95a96be682c9482c3f7f4ea439fb91d9a197481"}, "author": "", "url": "http://www.sport.co.uk/football/west-broms-james-mcclean-gets-fa-warning-but-escapes-ban/6962300/", "ord_in_thread": 0, "title": "West Brom's James McClean gets FA warning, but escapes ban", "locations": ["West Brom"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["James McClean"], "text": "West Brom's James McClean gets FA warning, but escapes ban 19 Oct 2015 16:31:52 \ncomments \nThe Football Association have issued West Brom's James McClean with a formal warning after his celebration against Sunderland. \nThe Baggies midfielder has escaped a fine or suspension while both clubs have been reminded of their responsibilities following the melee which was sparked by McClean's actions. \nThe ex-Sunderland midfielder appeared to taunt the travelling fans at the end of West Brom's 1-0 Barclays Premier League win on Saturday, which sparked an angry reaction from the Black Cats' players. \nLee Cattermole and Danny Graham confronted McClean, who played for Sunderland between 2011 and 2013, before McClean was taken away by team-mate Craig Gardner. \nReferee Martin Atkinson mentioned the incident in his official report, but did not see McClean's initial clenched fist gesture to the Sunderland fans. \nThe FA studied the video and decided to warn the Republic of Ireland international who had been jeered by the visiting fans during the game. \nThey sung 'f*** the IRA' following his refusal to wear a Remembrance Day poppy on his shirt while playing for them against Everton in 2012. \nHe claimed he was 'hung out to dry' by the club, insisting he was not allowed to tell his side, and finally explained his reasons in an open letter to then Wigan chairman Dave Whelan when playing for the Latics in November last year. \nMcClean also refused to face the English flag while on West Brom's American tour in the summer and was told by boss Tony Pulis he must show more respect. \nThe 26-year-old has already confirmed he will not wear a poppy while playing for the Baggies next month. \nHe told the club: \"We are coming up to Remembrance Day and I won't wear a poppy on my shirt when those games come around. People say that by not wearing a poppy, I'm being disrespectful, but they don't ask why it is that I choose not to wear it.\" Related Sport News", "external_links": [], "published": "2015-10-19T19:31:00.000+03:00", "crawled": "2015-10-20T20:14:45.240+03:00", "highlightTitle": ""}