{"organizations": [], "uuid": "469aa01ed744e8bb8facdfac5dcd5c9350196a7d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/nfl", "section_title": "NFL News, Scores, Schedule, Standings, Stats, Photos, Videos - Football - MSN Sports", "url": "http://www.msn.com/en-us/sports/nfl/colts-fake-punt-among-nfls-dumbest-plays/ar-AAfE7eG", "country": "US", "title": "Colts' fake punt among NFL's dumbest plays", "performance_score": 0, "site": "msn.com", "participants_count": 18, "title_full": "Colts' fake punt among NFL's dumbest plays", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 18, "uuid": "469aa01ed744e8bb8facdfac5dcd5c9350196a7d"}, "author": "BARRY WILNER, AP Pro Football Writer", "url": "http://www.msn.com/en-us/sports/nfl/colts-fake-punt-among-nfls-dumbest-plays/ar-AAfE7eG", "ord_in_thread": 0, "title": "Colts' fake punt among NFL's dumbest plays", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Colts' fake punt among NFL's dumbest plays Associated Press 11 hrs ago By BARRY WILNER, AP Pro Football Writer The Colts' attempt to fool the Patriots with a fake punt Sunday night only made Indianapolis look foolish.\nAdChoices It might not have been the dumbest call or execution of a play in NFL history, but it certainly ranks down there in the litany of failures.\nAnd there are many to rival this one, in which Indy, trailing by six points in the third quarter, lined up nine players to the right, with only the snapper (wideout Griff Whalen) and the quarterback (safety Colt Anderson) on the left.\nNew England wasn't tricked a bit, and the Colts' plan was supposed to include taking a delay of game. Instead, Anderson took a premature snap and was at the bottom of a tidal wave of Patriots tacklers.\nGame over, basically.\n\"The whole idea there was on fourth-and-3 or less, shift our alignment to where you either catch them misaligned, they try to sub some people in, catch them with 12 men on the field, and if you get a certain look, you can make a play,\" coach Chuck Pagano said. \"Alignment-wise, we weren't lined up correctly, and then there was a communication problem on the snap, and I take responsibility for that.\"\nWho gets the blame on some of the other classic Bozo plays in NFL annals? Read on:\n© AP Photo,File Abner Haynes (28), of the Dallas Texans, scampers around left end in first quarter action against the Buffalo Bills in this file photo from Sept. 30. 1962. ABNER HAYNES — The star running back for the AFL's Dallas Texans in 1962 misunderstood coach Hank Stram's directions on the coin flip for overtime. He won and chose to kick off into a hefty wind. Fortunately for Haynes, the Texans (now the Kansas City Chiefs) held off the Oilers and won in double OT.\n© Provided by Associated Press 25, 1964, file photo, Minnesota Vikings defensive end Jim Marshall (70) picks up a fumble by the San Francisco 49ers during the fourth quarter of an NFL football game in San Francisco. After picking up the ball, Marshall ran to the wrong end zone and then tossed the ball off the field, scoring a safety for the 49ers. (San Francisco Examiner via AP) JIM MARSHALL — One of the most durable players in NFL history, the defensive end is best known for going the wrong way with a fumble. The Vikings standout recovered a fumble by the 49ers' Billy Kilmer and, disoriented, returned it 66 yards to his own end zone. Safety, San Francisco.\n< PREVIOUS SLIDE SLIDE 1 of 3 NEXT SLIDE > FILE - In this Jan. 14, 1973, file photo, Washington Redskins Mike Bass (41) gets the ball which is deflected out of Garo Yepremian's hands, left, during the Super Bowl in Los Angeles. Yepremian had his kick blocked, the ball bounced back to him and then he tried to pass but the ball was deflected towards Bass, who caught it and ran it in for a touchdown. © AP Photo/File\nGARO YEPREMIAN — Perhaps the most infamous play in a Super Bowl, Dolphins kicker Garo Yepremian had his attempt blocked by Washington in 1973. He picked up the ball, made a clumsy attempt to pass, and it flew directly to the Redskins' Mike Bass. He went 49 yards for a TD, but Miami held on to close out its perfect season.\n© AP Photo/G. Paul Burnett, File FILE - In this Nov. 19, 1978, file photo, Philadelphia Eagles' Herman Edwards (46) pounces on the ball fumbled by New York Giants quarterback Joe Pisarcik (9) during an NFL football game in East Rutherford, N.J. The Eagles won 19-17. JOE PISARCIK, JOHN MCVAY, BOB GIBSON — The \"Miracle at the Meadowlands,\" when Giants QB Joe Pisarcik followed the orders of coach John McVay and offensive coordinator Bob Gibson to hand off to future Hall of Fame fullback Larry Csonka when kneeling would have clinched a victory over Philadelphia. Pisarcik's attempt never got to Csonka, hit the turf and Eagles DB Herman Edwards picked up the ball and ran into the end zone for the winning points.\n© AP Photo/Chris O'Meara, File FILE - In this Jan. 31, 1993, file photo, Dallas Cowboys defender Leon Lett (78) has the football stripped from his hand by Buffalo Bills' Don Beebe as he nears the goal line with a recovered fumble in the fourth quarter of Super Bowl XXVII in Pasadena, Calif. LEON LETT — Late in Dallas' 1993 Super Bowl rout of Buffalo, Cowboys DL Leon Lett picked up a fumble and headed down the right sideline undisturbed. As he approached the goal line, he began showboating, sticking the ball out front. Bills receiver Don Beebe caught him and knocked the ball out of Lett's hands for a touchback.\n© Provided by Associated Press 25, 1993, file photo, Dallas Cowboys' Leon Lett (78) and Miami Dolphins' Bert Weidner (60) reach for a ball after Lett slides into the ball after the Cowboys blocked a field goal attempt in the snow during an NFL game in Irving, Texas. After Lett touched the ball the Dolphins recovered and then kicked again for the win. The Dolphins won 16-14. (Star-Telegram via AP) MAGS OUT; (FORT WORTH WEEKLY, 360 WEST); INTERNET OUT; MANDATORY CREDIT LEON LETT (again) — This time, Miami was trying a field goal in the snow in Dallas on Thanksgiving Day — seriously. The kick was blocked and sat on the white stuff untouched. Until Lett, despite claiming he knew the rules that it was a dead ball if no one touched it, tried to pounce on the pigskin. It slid away, the Dolphins recovered and kicked the winning field goal. Lett called it \"brain freeze.\"\n© Rick Osentoski/AP Detroit Lions quarterback Dan Orlovsky (8) in action against the Arizona Cardinals during a game at Ford Field in Detroit, Sunday, Oct. 11, 2015. DAN ORLOVSKY — In the midst of the NFL's only 0-16 season, the Lions QB obliviously stepped out of the back of the end zone while scrambling, awarding the Vikings a safety.\n© AP Photo/Julio Cortez, File FILE - In this Nov. 22, 2012, file photo, New York Jets quarterback Mark Sanchez is hit by New England Patriots defensive end Jermaine Cunningham (96) and Justin Francis (94) during the second half of an NFL football game in East Rutherford, N.J. Earlier in the game, Sanchez ran into the back of teammate Brandon Moore and fumbled the ball, which was recovered by Patriots' Steve Gregory and returned for a touchdown. MARK SANCHEZ — New England could give thanks to Jets QB Mark Sanchez on Thanksgiving night when his running back missed a handoff, so Sanchez took off and smacked into the butt of guard Brandon Moore. Out came the ball, scooped up by Patriots DB Steve Gregory, who trotted into the end zone for a touchdown.\n© Scott Halleran/Getty Images A file photo of Dwayne Rudd #57 of the Cleveland Browns from the year 2001. DWAYNE RUDD — Cleveland linebacker Dwayne Rudd blew his top and cost the Browns a win. Rudd was penalized for ripping off his helmet and flinging it in celebration during the final seconds against Kansas City. That extended the opening game in 2002, and the Chiefs won.\n© Tim Fuller/USA TODAY Sports A file photo of ex-Detroit Lions manager Jim Schwartz. JIM SCHWARTZ — What is it about Thanksgiving? Jim Schwartz threw his red flag on a play that already would be reviewed, Justin Forsett's 81-yard TD run for Houston. But because the Lions coach challenged — considered a delay of the next snap by league rules — the replay official couldn't initiate a review. What should have been an 8-yard rush because Forsett was down by conduct turned into a touchdown. Detroit lost in overtime.\n© Keith Srakocic/AP NFL referee Jerome Boger signals a safety after Tennessee Titans Darius Reynaud took the opening kickoff near the goal line in the first quarter of an NFL football game, Sunday, Sept. 8, 2013 in Pittsburgh. The play was reviewed and upheld. DARIUS REYNAUD: The Titans opened the 2013 season at Pittsburgh in fine fashion. Darius Reynaud botched handling the opening kickoff outside the end zone, and stepped back over the goal line to down the ball. Two points for the Steelers.\n© Joe Nicholson/USA TODAY Sports Seattle Seahawks head coach Pete Carroll talks with Seattle Seahawks running back Marshawn Lynch (24) during pre game warmups against the Arizona Cardinals at CenturyLink Field. PETE CARROLL, DARRELL BEVELL: A \"Beast\" of a botched play. With perhaps the best short-yardage back in football, Marshawn Lynch, on the field, the Seahawks threw on second down from the Patriots 1. The ball was intercepted to clinch New England's victory.\nIn the Super Bowl.\nDid we say dumb?\nGo to MSN Home", "external_links": ["http://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAfC41d.img&quot;}},{&quot;csId&quot;:&quot;BB2D59E&quot;,&quot;description&quot;:&quot;The", "http://ap.org/", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BB6qRzt.img&quot;,&quot;title&quot;:&quot;Pats", "http://ui.bamstatic.com/120sports/util/embed/ots.embed.js&quot;}", "http://go.microsoft.com/fwlink/?LinkID=286759", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BB6qRzt.img&quot;,&quot;title&quot;:&quot;Tecmo", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BB6qRzt.img&quot;,&quot;title&quot;:&quot;What", "http://c.120sportsstatic.com/gen/client/rss/timeline.xml&quot;},{&quot;ns&quot;:&quot;ignore_this_version&quot;,&quot;value&quot;:&quot;System.Collections.Generic.List`1", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BB6qRzt.img&quot;,&quot;title&quot;:&quot;Pagano", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAfF6hh.img&quot;}},{&quot;csId&quot;:&quot;BB2D59E&quot;,&quot;description&quot;:&quot;The", "http://ui.bamstatic.com/120sports/util/embed/ots.embed.js&quot;,&quot;tags&quot;:", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAfDWNC.img&quot;}}", "http://b.scorecardresearch.com/b?&quot;,&quot;Category&quot;:&quot;football_nfl&quot;},&quot;Mute&quot;:&quot;true&quot;,&quot;HomePageLink&quot;:&quot;//www.msn.com/en-us&quot;,&quot;GeofenceUseSps&quot;:&quot;false&quot;,&quot;GeofenceEnabled&quot;:&quot;true&quot;,&quot;AutoPlay&quot;:&quot;true&quot;,&quot;AutoPlay&quot;:true,&quot;Mute&quot;:true,&quot;SwfCacheRefreshTime&quot;:86400,&quot;AdConfig&quot;:{&quot;FWFlashProfile&quot;:&quot;188286:MSN_US_AS3_LIVE&quot;,&quot;FWHtml5Profile&quot;:&quot;188286:MSN_HTML5_Live&", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAfCFkr.img&quot;}}"], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-20T20:51:22.805+03:00", "highlightTitle": ""}