{"organizations": [], "uuid": "f6cbc323065a493303edf6233232ad05a896d4c7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reviewjournal.com", "main_image": "http://www.reviewjournal.com/sites/default/files/field/media/2015-10-03T181916Z_1047065424_NOCID_RTRMADP_3_NCAA-FOOTBALL-SOUTH-CAROLINA-AT-MISSOURI.jpg", "site_section": "http://www.reviewjournal.com/taxonomy/term/31/feed", "section_title": "Sports", "url": "http://www.reviewjournal.com/sports/sideline/head-ball-coach-steve-spurriers-most-colorful-quotes", "country": "US", "title": "'Head Ball Coach' Steve Spurrier's most colorful quotes", "performance_score": 0, "site": "reviewjournal.com", "participants_count": 0, "title_full": "'Head Ball Coach' Steve Spurrier's most colorful quotes", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:38:00.000+03:00", "replies_count": 0, "uuid": "f6cbc323065a493303edf6233232ad05a896d4c7"}, "author": "", "url": "http://www.reviewjournal.com/sports/sideline/head-ball-coach-steve-spurriers-most-colorful-quotes", "ord_in_thread": 0, "title": "'Head Ball Coach' Steve Spurrier's most colorful quotes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Steve Spurrier"], "text": "'Head Ball Coach' Steve Spurrier's most colorful quotes 'Head Ball Coach' Steve Spurrier's most colorful quotes \nOct 3, 2015; Columbia, MO, USA; South Carolina Gamecocks head coach Steve Spurrier reacts in the game against the Missouri Tigers during the first half at Faurot Field. Mandatory Credit: Jasen Vinlove-USA TODAY Sports By Todd DeweyLas Vegas Review-Journal \nSteve Spurrier, who resigned as South Carolina's \"Head Ball Coach\" on Monday, was one of the winningest coaches and most entertaining personalities in college football history. \nIn honor of his departure, here are a dozen of Spurrier's most colorful quips, most of which were shots at his Southeastern Conference opponents. \nOn Auburn: 1. (After a fire at the Auburn library destroyed 20 books) \"The real tragedy was that 15 hadn't been colored yet.\" \nOn Florida State: 2. (When Jadeveon Clowney got a speeding ticket) \"I didn't know Jadeveon's car could go that fast. He doesn't have a pretty car like those FSU guys used to drive.\" \n3. \"You know what FSU stands for, don't you? Free Shoes University.\" \nOn Alabama: 4. \"In 12 years at Florida, I don't think we ever signed a kid from the state of Alabama … Of course, we found out later that the scholarships they were giving out at Alabama were worth a whole lot more than ours.\" \nOn Tennessee: 5. \"Will be the 14th time I've coached in Neyland Stadium. … I've coached there more than some of their head coaches.\" \n6. (When asked about Tennessee's failure to make the Sugar Bowl while he was at Florida) \"You can't spell Citrus without U-T.\" \n7. (On former Tennessee star Peyton Manning) \"I know why Peyton came back for his senior year. He wanted to be a three-time star of the Citrus Bowl.\" \nOn Georgia: 8. \"I don't know. I sort of always liked playing them that second game because you could always count on them having two or three key players suspended.\" \n9. \"Why is it that during recruiting season they sign all the great players, but when it comes time to play the game, we have all the great players? I don't understand that. What happens to them?\" \nOn Clemson coach Dabo Swinney: 10. Swinney said of Spurrier: \"He's from Pluto, and I'm from Mars.\" Spurrier shot back: \"Dabo probably thinks there's only, what, nine planets out there? I think I read where Pluto may not be considered one now.\" \nOn getting old: 11. \"People ask me why are you still coaching? I forgot to get fired and I'm not going to cheat.\" \n12. \"The Pope is 77 years old and he's in charge of a billion people. All I have to do is put 11 on the field.\" \nSpurrier, 70, won the 1966 Heisman Trophy at Florida and guided the Gators to the 1996 national title. He also guided the Gamecocks to three consecutive 11-win seasons from 2011 to 2013 and compiled a 228-89-2 mark in 25 seasons as a college coach. \n\"I'll just be the former Head Ball Coach now,\" he said. Comment section guidelines The below comment section contains thoughts and opinions from users that in no way represent the views of the Las Vegas Review-Journal or GateHouse Media. This public platform is intended to provide a forum for users of reviewjournal.com to share ideas, express thoughtful opinions and carry the conversation beyond the article. Users must follow the guidelines under our Commenting Policy and are encouraged to use the moderation tools to help maintain civility and keep discussions on topic.", "external_links": [], "published": "2015-10-14T03:38:00.000+03:00", "crawled": "2015-10-14T04:56:34.095+03:00", "highlightTitle": ""}