{"organizations": [], "uuid": "661a4bede2d22388449152d9ed3e05824e19d458", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailyitem.com", "main_image": "http://bloximages.chicago2.vip.townnews.com/dailyitem.com/content/tncms/assets/v3/editorial/a/8e/a8ed9d6a-6e25-11e5-8ec5-7b5326f79759/561719452a1e6.image.jpg?resize=760%2C545", "site_section": "http://www.dailyitem.com//search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&nsa=eedition&c[]=sports,sports/*&f=rss", "section_title": "The Daily Item - sports,sports/", "url": "http://www.dailyitem.com/sports/h-s-field-hockey-lewisburg-extends-win-streak-at-mifflinburg/article_bfcc59da-6e26-11e5-a4d9-4f81fb8dbb28.html", "country": "US", "title": "H.S. field hockey: Lewisburg extends win streak at Mifflinburg", "performance_score": 0, "site": "dailyitem.com", "participants_count": 1, "title_full": "H.S. field hockey: Lewisburg extends win streak at Mifflinburg", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T04:40:00.000+03:00", "replies_count": 0, "uuid": "661a4bede2d22388449152d9ed3e05824e19d458"}, "author": "Harold Raker For The Daily Item", "url": "http://www.dailyitem.com/sports/h-s-field-hockey-lewisburg-extends-win-streak-at-mifflinburg/article_bfcc59da-6e26-11e5-a4d9-4f81fb8dbb28.html", "ord_in_thread": 0, "title": "H.S. field hockey: Lewisburg extends win streak at Mifflinburg", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Justin Engle/The Daily Item Lewisburg Mifflinburg Field Hockey 2 \nMifflinburg's Libby Whittaker and Lewisburg's Tess Omlor battle for the ball during Thursday's game in Mifflinburg. Justin Engle/The Daily Item Lewisburg Mifflinburg Field Hockey 3 \nMifflinburg's Delanie Noll and Lewisburg's Cassie Sumfest chase after the ball during Thursday's game. Justin Engle/The Daily Item Lewisburg Mifflinburg Field Hockey 1 \nMifflinburg's Breonna Catherman plays defense on Lewisburg's Emma Bailey during Thursday afternoon's game at Mifflinburg. Posted: Thursday, October 8, 2015 9:40 pm H.S. field hockey: Lewisburg extends win streak at Mifflinburg By Harold Raker For The Daily Item DailyItem.com MIFFLINBURG — Cassie Sumfest had a simple message for her Lewisburg teammates at halftime of a scoreless game with rival Mifflinburg on Thursday. She said it would take just one goal to win it. As usual, the Wildcats were pushing the Green Dragons to the limit in the Heartland Athletic Conference-Division I contest. But with 21 minutes, 20 seconds left in the game, Sumfest saw a chance to take matters into her own hands. Moments after the Green Dragons earned a free hit at the top of the circle, the junior captain reared back and blasted a shot into the back of the cage for the lone goal in Lewisburg’s 1-0 victory. Lewisburg coach Jess Zeller said, \"Cassie told the team at halftime, ‘We just need one goal to win it,’ and then she went out and got it.\" Sumfest said, \"I just knew we needed to get shots on goal and, if we can, get rebounds. I was just looking for a goal and looking for a rebound if it came off.\" Sumfest, who has 16 goals and four assists on the season (eight goals in a current four-game win streak), added, \"I always think every single shot I take, every opportunity, is a goal.\" The Green Dragons’ defense and goalie Dentin Kline made it stand up for a hard-fought victory for Lewisburg (8-5 overall, 6-1 HAC-I) in their third game in four days. \"I knew fatigue would be a factor and we were playing a long-hit game (in the first half) and I think that was a sign of fatigue,\" Zeller said. \"At halftime, we (talked about) we have to go back to our game, go back to basics, and that’s what we did.\" Mifflinburg (5-7-1, 2-5) had the visitors on their heels for much of the first half, and had a 5-3 edge in shots on goal, with constant pressure inside the circle. Mifflinburg coach Jayme Longacre, whose team has lost four in a row, all shutouts, said, \"We were pleased with the effort and the amount of offensive opportunities. We had a decent amount of shots and they came so close. Unfortunately they just didn’t hit the backboard for us.\" Sumfest said that, at halftime, \"I tried to get my team together and I told them that we should play as a team and play as one because I thought we were very disconnected; our passes weren’t connecting, and so the mentality we needed was just to get shots.\" Lewisburg had the better of it in the second half, but the Wildcats still had their chances. Nevertheless, their forays into the Lewisburg end produced just one shot, a one-on-one on which Kline came out to make a terrific save to preserve the lead. \"Dentin made a great save. She stepped out at the perfect time,\" Zeller said of the senior captain. \"She’s good under pressure.\" \"It’s hard,\" Longacre said. \"Games like this are the toughest to talk about.\" Longacre said the Wildcats are still eyeing a District 4 Class AA playoff spot and they know what they need to do to get there. They must win four of last five to qualify. Mifflinburg could have led 1-0 at the half, but a goal by Amanda Schlegel late in the period was disallowed because it touched a teammate’s foot. \"They’re working hard (and) they’re improving. They’re getting there; they’re just not there yet,\" Longacre said. \"The adrenaline was definitely pumping and they wanted it — they wanted it a lot,\" Longacre said of the feeling after the teams’ second scoreless first half of the season. \"A 1-0 game is always hard, but you have to be pleased with the attitude and the effort.\" Longacre said a little bit of air went out of her team moments after the Sumfest goal, but she used a pair of timeouts to get them settled down and they still generated some opportunities. \"We were still attacking,\" she said. But Lewisburg played tough defensively when it needed it most. \"Our defense really stepped up. We worked on some defensive stuff (Wednesday) at practice and hopefully that made a difference,\" Zeller said. \nLewisburg ended with an 8-5 advantage in corners, while the shots were even at 7. Kline had four saves, and Mifflinburg’s Keanna Delp had five. Sign Up / Sign In With your existing account from... {* loginWidget *}", "external_links": [], "published": "2015-10-09T04:40:00.000+03:00", "crawled": "2015-10-09T09:53:57.468+03:00", "highlightTitle": ""}