{"organizations": [], "uuid": "e0aa070434e6591885c4c1668eb80e87e0a8c1a1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sportsnews.com.au", "main_image": "http://sportsnews.com.au/defaultimage.jpg", "site_section": "http://www.sportsnews.com.au/category/rugby-union/feed", "section_title": "Sports News Australia » Rugby Union News", "url": "http://www.sportsnews.com.au/rugby-union/all-blacks-forward-thinking-for-boks-clash/160531", "country": "CA", "title": "All Blacks forward thinking for Boks clash", "performance_score": 0, "site": "sportsnews.com.au", "participants_count": 1, "title_full": "All Blacks forward thinking for Boks clash", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T16:32:00.000+03:00", "replies_count": 0, "uuid": "e0aa070434e6591885c4c1668eb80e87e0a8c1a1"}, "author": "AAP", "url": "http://www.sportsnews.com.au/rugby-union/all-blacks-forward-thinking-for-boks-clash/160531", "ord_in_thread": 0, "title": "All Blacks forward thinking for Boks clash", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "All Blacks forward thinking for Boks clash Posted by AAP + on 21/10/2015 at 12:32 am   \nThe All Blacks are being coy about what they may have up their sleeves to surprise the Springboks in their World Cup semi-final at Twickenham on Saturday. \nWhen they last met in Johannesburg three months ago, they hit the front with a Richie McCaw try from a deft line-out move five minutes from time before a late penalty secured a 27-20 victory. \nKieran Read was the architect. He lured the Springbok jumpers back in anticipation of a long throw, opening a huge gap in the middle where hooker Codie Taylor lobbed the ball for a waiting McCaw to pounce. \nIt wasn’t too dissimilar to Tony Woodcock’s try when they beat France 8-7 in the 2011 final. \nRead indicated in Johannesburg it was part of a bagful of tricks the All Blacks had been rehearsing for the World Cup. \nBut ahead of Saturday’s crucial showdown, the backrower was giving nothing away about what the All Blacks may have planned. \n“We’ll just do what we do every week with the line-outs,” he deadpanned. \n“A line-out move isn’t going to win you the game. It is turning up, getting out there and playing as hard as you can and playing with your mates beside you.” \nBut the All Blacks are certain it is in the forwards where the Springboks will back themselves to gain the upper hand. \nIn particular the driving maul which the All Blacks have had difficulty defending in the past. \nWhen their vulnerability was exposed by Argentina who scored two tries against New Zealand from rolling mauls during their Rugby Championship Test in July, a defensive All Blacks coach Steve Hansen labelled the move “bloody boring”. \nBut it remains a legitimate part of the game and Read said it was up to the All Blacks to learn how to combat it. \n“Their drive is a key weapon for them,” he said, running through the options available for the All Blacks. \n“Initially you’ve got to be disciplined so you don’t give them penalties, don’t give then a chance to kick out to the corner, other than that get up and win the ball. Hopefully we can do that and stop them right away. \n“It’s part of the game that is there to be utilised and it’s a great thing that it keeps all different shapes and sizes in this game which is great. \n“It’s something that you’ve got to adapt to and we’ll certainly get it this week.” \nBut if South Africa want to play it tight the All Blacks ultimate weapon is to run their heavy forwards into the ground with an expansive running game. \n“They’ve obviously adopted a style that they think is a style they need to win a World Cup and we’re working hard to get our style right,” assistant coach Ian Foster said. \n“We want guys fit for 80 minutes playing fast, aggressive rugby and we’ve worked hard on that. \n“It’s not just the fitness it’s also the squad, the ability to bring guys off the bench to really add value in that area and we’ve certainly seen the benefits of that recently.” \nThe ability of the bench to speed up an already high-tempo style played a big part in the All Blacks runaway 62-13 win over France in the quarter-finals. \nScrum-half Tawera Kerr-Barlow came on for 15 minutes and scored two tries, one from a back-of-the-hand pass by replacement prop Joe Moody that Sonny Bill Williams would have been proud of. \nWilliams, who played the last 30 minutes, was a central figure in two other tries.  ", "external_links": [], "published": "2015-10-20T16:32:00.000+03:00", "crawled": "2015-10-20T18:42:12.907+03:00", "highlightTitle": ""}