{"organizations": [], "uuid": "e1fee265cf6397f6c9867d2b0f47ddf94e5fdea8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newstribune.com", "main_image": "http://jeffcity.media.clients.ellingtoncms.com/static/newstribune/images/news-tribune90x90.jpg", "site_section": "http://newstribune.com//rss/headlines/sports/", "section_title": "newstribune.com stories: Mid-Missouri and National Sports", "url": "http://www.newstribune.com/news/2015/oct/16/prep-football-osages-johnson-faces-against-his-for/", "country": "US", "title": "Prep Football: Osage’s Johnson faces off against his former team to end regular season", "performance_score": 0, "site": "newstribune.com", "participants_count": 1, "title_full": "Prep Football: Osage’s Johnson faces off against his former team to end regular season", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T09:40:00.000+03:00", "replies_count": 0, "uuid": "e1fee265cf6397f6c9867d2b0f47ddf94e5fdea8"}, "author": "Tim Leible", "url": "http://www.newstribune.com/news/2015/oct/16/prep-football-osages-johnson-faces-against-his-for/", "ord_in_thread": 0, "title": "Prep Football: Osage’s Johnson faces off against his former team to end regular season", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Download podcast \n“They went 4-of-5 on fourth downs and they scored on four of those drives, that’s 28 points,” Johnson said. “If you look at our offensive drives we’ve had, we had three turnovers, we had a holding penalty that set us back and we didn’t convert, we had a fumbled snap that sent us back and we didn’t convert and we had a false start that sent us back and we didn’t convert. \n“So you look at those key plays that we’ve kinda been talking about all year and these are things that we’re gonna have to clean up if we wanna be the team that we think that we can be.” \nThis has been a problem for Osage all season, particularly on the offensive end. But as the season winds down, it will be what ends their season if they don’t fix things. Now, in the final week of the regular season, the Indians will face a Hallsville team that has been hard to read this year. They’ve had their share of ups and downs; beating Southern Boone in triple overtime, losing to Versailles and having a tight game with Eldon. They’ve really hit all ends of the spectrum, so it’s hard to know what to expect out of them on a week-to-week basis. \n“You watch at times they look really really good at times and at times they make mistakes,” Johnson said. “Part that is they’re kind of in the same situation as us where they have a very small senior class. They’re a team that’s up and down largely because of their inexperience.” \nBut if there is one opposing coach who knows this team better than the others, it’s Johnson. Prior to becoming the head coach at Osage last season, Johnson held the same position at Hallsville for two years, so he knows a lot of the personnel there well. \n“I know the personnel, I know who the kids are,” said Johnson. “It makes it tougher for my end because you really wanna win, but I don’t wanna think anything bad for those kids because they’re good people on that sideline. I want them to win every game except when they play us.” \nBut, while Johnson still likes the players on the opposing sideline, his focus is still on improving his team. One of the keys for the Indians will be their quarterback play. Zach Wheeler had to leave the game last week with a shoulder injury. He’s played through pain for a few weeks now and will be a game-time decision tonight. If Wheeler isn’t ready to go, Dylan Riley will likely shift to quarterback. Riley does have experience at the position and his brother, Austin, was the team’s quarterback last season. \nAround the quarterback, the offense has played well. Riley and Dylan Brown have played well out of the backfield and Britten McLaughlin and Jason Edwards have been strong at receiver, so if Wheeler is ready to go, the offense is in much better shape. \nThe Indians will be going against a solid defense, especially at middle linebacker. The duo of Collin Drummond and Garret Vincent move and tackle very well. They have the range to make plays on the outside and they strength to make plays up the middle. They will make running the ball, which has been Osage’s bread and butter, a bit more difficult. \nJohnson knows that Drummond in particular is going to be an important player to keep their eyes on. \n“(Drummond) is a stud, he’s a really good football player. He’s a kid we have talked to our offensive line about that you’re not gonna beat him, just beat him to the point of attack,” Johnson said. “We’re not gonna go head-to-head with him and try to absolutely beat him and drive block him and move him 10 yards down the field because he’s too strong…but if we can get our hips in the right position and beat him to the point of attack, then we’re gonna give our running backs some room to move.” \nOn the offensive side of the ball, Hallsville is pretty balanced. They like to run the ball with Garret Vincent and pass the ball well enough to keep you honest. \nThe biggest threat in the passing game will be tight end Taylor Vincent, who is very capable of making plays downfield. \nSchool of the Osage hosts Hallsville - Updates on Twitter: @SOTOsports . Listen live online: cool1027.com \nPodcast", "external_links": [], "published": "2015-10-16T09:40:00.000+03:00", "crawled": "2015-10-16T11:14:18.629+03:00", "highlightTitle": ""}