{"organizations": ["Northwest Halifax"], "uuid": "c6fdb83bbaf41fce5c880dab3b9b7238c018f7b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "ncpreps.rivals.com", "main_image": "", "site_section": "http://mckeenshockey.rivals.com/rss2feed.asp?type=HS&state=NC", "section_title": "North Carolina High School Sports Headlines", "url": "https://ncpreps.rivals.com/content.asp?CID=1811491", "country": "IE", "title": "Top 1A Games: Week 8", "performance_score": 0, "site": "rivals.com", "participants_count": 0, "title_full": "Top 1A Games: Week 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T15:59:00.000+03:00", "replies_count": 0, "uuid": "c6fdb83bbaf41fce5c880dab3b9b7238c018f7b6"}, "author": "", "url": "https://ncpreps.rivals.com/content.asp?CID=1811491", "ord_in_thread": 0, "title": "Top 1A Games: Week 8", "locations": ["Tarboro", "East Montgomery", "Swain County", "Lakewood", "South Creek", "Northampton County", "Northhampton County", "Northampton"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Aaron Little", "Antonio Williams", "Frayer", "James Kenan", "Arron Flowers", "Maynor", "Jeremiah Wilson"], "text": "NCPreps Week 8 1A Preview Riverside vs Northhampton County Game Preview: This is a nice matchup between two 4-2 teams. Riverside will have to travel to Northampton County (they are 1-2 on the road this year) behind Jeremiah Wilson, who is averaging 211 yards per game. Northampton is on a four game winning streak, after defeating Northwest Halifax 61-6. Whoever wins takes a big step in the Two Rivers conference. East Montgomery vs North Stanly Game Preview: This will be a fun one to watch, as both teams come in with only one loss on the season. For North Stanly, it is all about their stud running back Antonio Williams, who is averaging 276 yards on the ground this season. East Montgomery will have to stack the line and keep him under control. Colby Maynor and Arron Flowers are two players for East Montgomery to watch for, as they also lean heavy on the run game. Rosewood vs Lakewood Game Preview: Two 5-2 teams come together Friday night in a battle of top teams in the Carolina 1A conference. Rosewood is coming off a tremendous win against James Kenan last week, while Lakewood has been the top defensive team in the conference. But who will win this matchup, the Lakewood defense (47 total points given up) or the Rosewood offense (263 total points on offense)? South Creek vs Tarboro Game Preview: This is the second game to watch in the Two Rivers Conference, as Tarboro leads the way with a 5-1 record and South Creek isn't far behind with a 4-1 record. Tarboro has been playing well but will they be able to take on an offense that has posted 212 total points on offense and only given up 82 on defense. Roman Frayer and Aaron Little are two players that will have to be stopped for Tarboro in this matchup. Other Games Games: Cherokee vs Swain County\nManteo vs Columbia", "external_links": [], "published": "2015-10-08T15:59:00.000+03:00", "crawled": "2015-10-09T05:26:56.760+03:00", "highlightTitle": ""}