{"organizations": ["Calgary Stampeders"], "uuid": "b570d0db5af323a18ab4a1890960243394391119", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.calgarysun.com", "main_image": "http://storage.calgarysun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297761310919_LARGE_BOX.jpg?quality=80&stmp=1445130610741&size=100x", "site_section": "http://www.calgarysun.com/sports/rss.xml", "section_title": "Top Sports stories", "url": "http://www.calgarysun.com/2015/10/17/calgary-stampeders-snapshots-brandon-smith-picks-off-pair-of-passes", "country": "CA", "title": "Calgary Stampeders Snapshots: Brandon Smith picks off pair of passes", "performance_score": 0, "site": "calgarysun.com", "participants_count": 0, "title_full": "Calgary Stampeders Snapshots: Brandon Smith picks off pair of passes", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T04:03:00.000+03:00", "replies_count": 0, "uuid": "b570d0db5af323a18ab4a1890960243394391119"}, "author": "", "url": "http://www.calgarysun.com/2015/10/17/calgary-stampeders-snapshots-brandon-smith-picks-off-pair-of-passes", "ord_in_thread": 0, "title": "Calgary Stampeders Snapshots: Brandon Smith picks off pair of passes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["HAMILTON", "Brandon Smith"], "text": "HAMILTON — Inside the Calgary Stampeders locker-room, the Twitter-less Brandon Smith is known as No Twitty Smitty. \n\nHis play did all the talking Saturday in a 27-15 win over the Toronto Argonauts at Tim Hortons Field, with Smith registering his third-career two-interception game and first since the 2010 season. \nThe shutdown defensive back kick-started the Stamps on their way to their 12th win of the season by picking off Argonauts quarterback Trevor Harris on the first Double Blue possession of the game. \nSmith stepped in front of the throw near midfield and ended up taking it all the way down to the Argos’ five-yard line, where Bo Levi Mitchell found Marquay McDaniel for the touchdown on the very next play. \n“I wish I would’ve gotten into the endzone myself, but just to put the team in position to score and come away with some points early in the game to try to slow it down and take some of the pressure off the early-game jitters, I mean, that’s a big play,” Smith said. \nWhen Smith picks off passes, he seems to do it in bunches. \nKnown more for his cover skills than his ball skills — he now has 11 interceptions in his eight-year career — Smith picked off a pair of passes in back-to-back games during the Labour Day series five years ago. \n“That’s always a good thing,” Smith said with a grin. \n“I wish I could get them all in one game. If I could get 10 in one game and don’t have no more for the rest of the season, that’d be fine with me. I just have to seize the moment and when the opportunity presents itself, just come down with the play.” \nPOST PATTERNS \nSmith wasn’t the only one coming up with a big interception of Harris, as LB Glenn Love snuffed out an Argos drive in the second half with his first-career pick and subsequent pitch to FS Josh Bell. He had to go way, way back to recall his last interception. “Not even UCLA,” Love laughed. “Back in high school? I saw a ball in the air, I caught it, and my boy J-Bell said pitch it back and I thought he had some burners, but he didn’t.” ... Amazingly, during last week’s 15-11 win by the Edmonton Eskimos over the Stamps, neither team ran an offensive play in the redzone ... After averaging 28.3 points per game in its first nine games, the Stamps offence has produced just 21.0 points per game in its last six games ... Tough news for RB Tyler Varga, who the Stamps took in the third round of the 2015 CFL Draft, as the Indianapolis Colts placed the Kitchener, Ont., product on season-ending injured reserve with a concussion ... Everyone figured the Stamps would have a pass-rusher reach double digits in sacks this season, but here’s betting no one had Freddie Bishop III reaching that mark first. He ran down Harris from the back side for his 10th sack of the season in the first half and then added his 11th later on. Charleston Hughes then joined Bishop in double digits later in the game, as the Stamps produced six sacks on the night. \nSHORT YARDAGE \nThe inactives for the Stamps were DE Brandon Boudreaux and OL Randy Richards, who split RT reps with Garry Williams during the week. Williams, who has made eight starts on the left side this season, returned from a two-game absence due to a foot injury ... DB Shane Herbert and OL Scott Mitchell were inactive for the Argos ... Four current or former Stampeders sit atop the CFL yards-after-catch list. Marquay McDaniel (389) leads the way, followed closely by Ottawa RedBlacks’ Brad Sinopoli (388), Montreal Alouettes’ Nik Lewis (344) and Eric Rogers (341). Newly-acquired RB Jerome Messam is sixth with 337 YAC ... Rogers dropped a wide-open touchdown pass in the fourth quarter, and he took some ribbing from his teammates. QB Bo Levi Mitchell couldn’t be too mad, though. “For all the plays he’s made for me this year, I can’t even think about that one again,” Mitchell said. “I’m not too worried about it.”", "external_links": [], "published": "2015-10-18T04:03:00.000+03:00", "crawled": "2015-10-18T16:07:53.739+03:00", "highlightTitle": ""}