{"organizations": [], "uuid": "e295496fd10a3d8f14c9aa12584a95ca94b2cdf4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fox8live.com", "main_image": "http://WVUE.images.worldnow.com/images/9035865_G.jpg", "site_section": "http://www.fox8live.com/", "section_title": "New Orleans News, Weather, Saints - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "url": "http://www.fox8live.com/story/30283139/punt-block-worth-more-than-just-points-for-mauti-family", "country": "US", "title": "Punt block worth more than just points for Mauti family", "performance_score": 0, "site": "fox8live.com", "participants_count": 1, "title_full": "Punt block worth more than just points for Mauti family - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T04:19:00.000+03:00", "replies_count": 0, "uuid": "e295496fd10a3d8f14c9aa12584a95ca94b2cdf4"}, "author": "Written by: Rob Masson", "url": "http://www.fox8live.com/story/30283139/punt-block-worth-more-than-just-points-for-mauti-family", "ord_in_thread": 0, "title": "Punt block worth more than just points for Mauti family", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MANDEVILLE, LA (WVUE) - It may turn out to be one of the great moments in Saints’ history.\nThursday night's blocked-punt-turned-touchdown was worth more than just six points to Michael Mauti and his father.\nLast night, with the Saints leading 7-0 in the first quarter, former Mandeville high linebacker Michael Mauti blocked a Falcons punt then took the ball into the end zone for a touchdown to put a beleaguered Saints team firmly in control against their bitter rivals.\n\"What a special moment...my feet haven't hit the ground yet,\" Mauti said.\nTo say it was a memorable play would be selling it short. Michael was only recently signed to play for the team he watched growing up. And playing on special teams last night, he followed in the footsteps of his father Rich, who was watching from the stands.\n\"I saw it, with my binoculars, but Nancy just missed it ... and i said Michael he blocked the punt,\" Rich Mauti said.\nMicheal's touchdown makes he and his father the only father-son combo to score touchdowns for the Saints in the team's nearly 50 years history. Rich Mauti, now a North Shore real estate agent, played for the Saints from 1977-83.\n\"There's no words for me to describe that,\" Michael Mauti said. \"Since I put on the uniform for the first time, that's been a dream of mine to follow in his footsteps.\"\nMichael Mauti told us that last night's punt, block, touchdown play wasn't just a fluke, he said it was a designed play and something he's thought about for a long time.\n\"I hit the ground, the ball was next to me and then the next thing you know I was on my feet and started running,\" Michael said. \"It was unbelievable.\"\nThe play itself reminded fans of the famous Steve Gleason blocked punt in the first game back in the dome after Hurricane Katrina. It was a block which also helped turn the tide against the Falcons.\n\"I've seen that play in my head 100 times before last night, then fruition ... unbelievable moment,\" Michael said.\nAnd to make things even sweeter, Gleason, battling ALS, was in the stadium last night.\n\"We're just thrilled that he's getting some good things happening to him and having some excitement like I had,\" Rich said.\nThe Mautis hope there are many more special moments to come.\nCopyright 2015 WVUE . ", "external_links": [], "published": "2015-10-17T04:19:00.000+03:00", "crawled": "2015-10-17T09:43:39.063+03:00", "highlightTitle": ""}