{"organizations": [], "uuid": "e7371113dcd27ff22b498b414440cee44b73523e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtontimes.com", "main_image": "", "site_section": "http://www.washingtontimes.com/rss/headlines/sports/", "section_title": "www.washingtontimes.com stories: Sports", "url": "http://www.washingtontimes.com/news/2015/oct/17/texas-tech-holds-off-kansas-30-20/", "country": "US", "title": "Texas Tech holds off Kansas 30-20", "performance_score": 0, "site": "washingtontimes.com", "participants_count": 1, "title_full": "Texas Tech holds off Kansas 30-20", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T22:59:00.000+03:00", "replies_count": 0, "uuid": "e7371113dcd27ff22b498b414440cee44b73523e"}, "author": "AMIE JUST", "url": "http://www.washingtontimes.com/news/2015/oct/17/texas-tech-holds-off-kansas-30-20/", "ord_in_thread": 0, "title": "Texas Tech holds off Kansas 30-20", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Texas Tech holds off Kansas 30-20 By AMIE JUST   \nLAWRENCE, Kan. (AP) - The Texas Tech defense kept the Red Raiders in the game at Kansas. \nCoach Kliff Kingsbury was not impressed by his offense Saturday morning despite the 30-20 victory. \n“We were lucky to win the game,” Kingsbury said. “Guys got nervous and we just all choked on that side of the ball. It’s the only way to put it.” \nPatrick Mahomes threw for 359 yards and a score and De’Andre Washington rushed for 160 yards and a TD. Washington shared Kingsbury’s sentiment. \n“The offense just didn’t come through,” Washington said. “The offense just didn’t come to play, really. It’s all it was.” \nThe Red Raiders (5-2, 2-2 Big 12) racked up 225 yards rushing and a touchdown on the ground. Texas Tech’s 30 points were the least amount the team has scored all season. \nFive different Texas Tech offensive playmakers recorded over 50 yards receiving. Zach Austin led the Red Raiders with 80 yards receiving, Jakeem Grant had 76 yards, Devin Lauderdale had 50, Cameron Batson, 58, and Reginald Davis, 57 yards and a score. \nTexas Tech continued its streak of perfection, as the Red Raiders are 9-0 inside Memorial Stadium, a record dating to 1966. \nKansas (0-6, 0-3) is riding a nine-game losing streak and is 0-6 for the first time since 1988. Before this season, Kansas had only started 0-6 three times in program history, in 1954 and 1988. Head coach David Beaty is still waiting for his first win. \nBut just because Kansas is 0-6 doesn’t mean they aren’t a worthy opponent. \n“I feel like people underestimated the opponent and (didn’t) understand that this is college football and any team can beat any team, especially in the Big 12,” defensive end Branden Jackson said. \nFreshman quarterback Ryan Willis was 35 of 50 for a career-high 330 yards passing in his second start for the Jayhawks. Willis turned the ball over three times, throwing two picks and dropped a fumble. Running back De’Andre Mann gained 107 yards on 15 carries. \nKansas had its share of bloopers, most of those coming on special teams. \nMatthew Wyman missed an extra point attempt and two field goals, a 52-yard attempt and a 34-yard attempt, and Nick Bartolotta shanked a 22-yard field goal wide right. \nBut Kansas wasn’t going out without a fight. Kansas had back-to-back touchdowns in the fourth quarter to put them down by 3.", "external_links": [], "published": "2015-10-17T22:59:00.000+03:00", "crawled": "2015-10-18T00:08:01.635+03:00", "highlightTitle": ""}