{"organizations": [], "uuid": "1a4cf194a46c134dac43127e2c008e22854d290f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.winnipegfreepress.com", "main_image": "http://media.winnipegfreepress.com/images/624*432/NYM152-1013_2015_205225_high.jpg", "site_section": "http://www.winnipegfreepress.com/rss/?path=/sports", "section_title": "Winnipeg Free Press: Sports", "url": "http://www.winnipegfreepress.com/sports/kershaw-ends-post-season-skid-pitches-dodgers-past-mets-3-1-to-send-nlds-to-game-5-in-la-332594722.html", "country": "US", "title": "Kershaw ends post-season skid, pitches Dodgers past Mets 3-1 to send NLDS to Game 5 in LA", "performance_score": 0, "site": "winnipegfreepress.com", "participants_count": 1, "title_full": "Kershaw ends post-season skid, pitches Dodgers past Mets 3-1 to send NLDS to Game 5 in LA - Winnipeg Free Press", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T01:07:00.000+03:00", "replies_count": 0, "uuid": "1a4cf194a46c134dac43127e2c008e22854d290f"}, "author": "Mike Fitzpatrick, The Associated Press", "url": "http://www.winnipegfreepress.com/sports/kershaw-ends-post-season-skid-pitches-dodgers-past-mets-3-1-to-send-nlds-to-game-5-in-la-332594722.html", "ord_in_thread": 0, "title": "Kershaw ends post-season skid, pitches Dodgers past Mets 3-1 to send NLDS to Game 5 in LA", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, N.Y. - Short rest has never been the issue for Clayton Kershaw in October. Winning when he couldn't afford to lose, that was the problem.\nKershaw finally came through with the season on the line Tuesday night, saving Los Angeles from another early playoff exit by pitching the Dodgers to a 3-1 victory over the New York Mets that forced their NL Division Series to a deciding Game 5.\n\nLos Angeles Dodgers' Enrique Hernandez (14) is greeted by Los Angeles Dodgers Justin Turner (10) after scoring against the New York Mets during the third inning of baseball's Game 4 of the National League Division Series, Tuesday, Oct. 13, 2015, in New York. (AP Photo/Frank Franklin II) \nWorking on only three days' rest, Kershaw shut down the Mets for seven innings and Justin Turner delivered a key hit against his former team. The series shifts back to Los Angeles on Thursday night, with fellow Dodgers ace Zack Greinke scheduled to start against Jacob deGrom.\nThe winner hosts the wild-card Chicago Cubs in the NL Championship Series opener Saturday.\n\"Definitely happy to be going back home,\" Kershaw said. \"They like us a little better there.\"\nStill the target of chanting Mets fans, Chase Utley watched from the bench again as the Dodgers did enough at the plate to hand hometown rookie Steven Matz his first loss in the majors.\nUnable to muster much offence against Kershaw, the Mets squandered their only chance to close out the series at home.\n\"Tonight he was commanding all three (pitches) and was just flat-out unhittable,\" New York captain David Wright said.\nKershaw's one-out single led to a three-run third. Adrian Gonzalez blooped an RBI single and Turner added a two-run double, providing support for the lefty ace.\nThe reigning NL MVP and three-time Cy Young Award winner snapped a five-start losing streak in the playoffs — the longest in Dodgers history.\n\"I'm actually really happy for him. I mean, this kid is tremendous. Everything that you're supposed to be, he is,\" Dodgers manager Don Mattingly said. \"This guy's an animal, the way he works, represents us, the game of baseball, himself. I mean, he's really a credit to the game, and so you're really happy for him to be able to do that tonight.\"\nAfter dropping the series opener 3-1 to deGrom, Kershaw was 1-6 with a 4.99 ERA in 12 career post-season games, including nine starts. He lost elimination games each of the past two years, once on three days' rest.\nBut this time, Kershaw was just as dominant as he normally is during the regular season.\n\"There's no curse or anything,\" he said. \"Just got to get through the seventh.\"\nHe struck out eight, walked one and yielded only three hits, quieting another revved-up crowd at Citi Field as the night wore on. Daniel Murphy hit his second solo homer off Kershaw in the series, both coming in the fourth inning.\nKenley Jansen got four outs for his second save. With two runners on in the eighth and the count full, he retired Murphy on a fly to right. The right-hander then worked a 1-2-3 ninth as the Dodgers ended a seven-game losing streak in road playoff games.\n\"I feel confident with Zack going in Game 5 back home,\" Kershaw said. \"I really wanted to win tonight, definitely. For a lot of reasons, but obviously most important was just to give Zack a chance.\"\nKershaw improved to 1-1 with a 1.89 ERA in a trio of playoff starts on three days' rest.\nWith a $290 million payroll that's $66 million higher than any other team, the Dodgers are seeking their first pennant since winning the 1988 World Series. They've captured three straight NL West titles but won only one playoff series during that span — in part because Kershaw got little run support in four consecutive post-season losses to St. Louis.\nBut after Los Angeles allowed 13 runs to the Mets in Game 3, a Dodgers post-season record, Kershaw restored order when his team absolutely needed it.\nThe 24-year-old Matz was pitching in a big league game for the first time in 19 days after a balky back sidelined him late in the season. Still, he looked sharp early and snapped off several effective curveballs.\nThat same pitch caused him trouble, too.\nKershaw singled to left-centre on a 2-2 curve for the first hit of the game. With two outs, Howie Kendrick grounded a single up the middle and Gonzalez dumped an RBI single into centre.\nTurner then lined a 2-0 curve into the left-field corner to make it 3-0, tormenting his former team yet again. Let go by the Mets after the 2013 season — they declined to offer him arbitration — he is 7 for 15 (.467) in the series with four doubles and three RBIs.\n\"Honestly, I never thought he'd be this good of a hitter. He's one of the best hitters in the game,\" Kershaw said. \"We thought he'd be a great utility player.\"\nMatz grew up a Mets fan on Long Island, about 50 miles from Citi Field, and his family attended the game. He went 4-0 with a 2.27 ERA in six major league starts this season, but the team saw enough to pitch him in the playoffs — in part because Matz threw gems to help clinch championships at Class A in 2013 and Double-A last year.\n\"The one pitch I know he wants back is the pitch to Kershaw,\" Collins said. \"We've got all the confidence in the world that if we get to the next round, he's going to be a part of that rotation.\"\nUP NEXT\nDodgers: Greinke allowed a pair of solo homers during a 5-2 victory in Game 2. He went seven innings and struck out eight without a walk. The right-hander is 3-2 with a 3.48 ERA in eight post-season starts. He was 19-3 with a 1.66 ERA this season, the lowest in the majors since Atlanta ace Greg Maddux posted a 1.63 mark in 1995.\nMets: Making his post-season debut last Friday at Dodger Stadium, deGrom pitched seven scoreless innings. Last season's NL Rookie of the Year struck out 13, matching Tom Seaver's franchise record for a post-season game.\nReport Error Submit a Tip Refund Refund", "external_links": [], "published": "2015-10-14T01:07:00.000+03:00", "crawled": "2015-10-14T08:32:07.002+03:00", "highlightTitle": ""}