{"organizations": [], "uuid": "8d14c638f1bbe5debb98344cce1fac3611cd31e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbssports.com", "main_image": "http://sports.cbsimg.net/images/visual/whatshot/jacob-degrom-101015.jpg", "site_section": "http://www.cbssports.com/partners/feeds/rss/home_news", "section_title": "Sports News : CBSSports.com", "url": "http://www.cbssports.com/mlb/eye-on-baseball/25333655/mets-win-game-1-over-dodgers-seven-things-to-know", "country": "US", "title": "Mets win Game 1 over Dodgers: Seven things to know", "performance_score": 1, "site": "cbssports.com", "participants_count": 20, "title_full": "Mets win Game 1 over Dodgers: Seven things to know - CBSSports.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T07:19:00.000+03:00", "replies_count": 20, "uuid": "a5f0fe5faeb1bd2ffffea5d51ec77de51e2ba652"}, "author": "Matt Snyder", "url": "http://www.cbssports.com/mlb/eye-on-baseball/25333655/mets-win-game-1-over-dodgers-seven-things-to-know#post-0", "ord_in_thread": 0, "title": "Mets win Game 1 over Dodgers: Seven things to know", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The New York Mets went into Dodger Stadium and beat the Los Angeles Dodgers , 3-1, Friday night to take a 1-0 lead in the best-of-five NLDS.\nDaniel Murphy hit a solo homer for the winners while David Wright had a two-run single and Jeurys Familia recorded the save. What else? Well, here are seven things to know.\n1. Clayton Kershaw didn't choke, but he wasn't great \nHeading into the 2015 postseason, the narrative on Clayton Kershaw -- easily the best pitcher in the world when considering what we've seen in the past five regular seasons -- was that he chokes in the playoffs. He brought a 1-5 record with a 5.12 ERA in 51 career postseason innings into the game.\nFor the most part, Kershaw had \"it\" in Game 1. Through six innings, he had 11 strikeouts while the only run he allowed was a solo homer to Daniel Murphy .\nKershaw left with the bases loaded in the seventh and the bullpen allowed two of those runners to score. So those count against Kershaw. \nThe final line? 6 2/3 IP, 4 H, 3 ER, 4 BB, 11 K.\nNo, that's not ace-caliber work, necessarily, but it's definitely not a choke job. If the bullpen does its job (we'll get to that in a second), Kershaw comes away with one earned run and 11 strikeouts. That's good.\nOf course, it's not great. It's not what we saw from his counterpart, because ...\n2. Jacob deGrom was brilliant \nMets starter deGrom only got to hear about Kershaw going into the game and he'll probably only hear about Kershaw afterward. So be it. He was the better pitcher in Game 1. He didn't need help to get through the seventh, he didn't allow a solo homer and he only walked one. Jacob deGrom was the best pitcher in Game 1. (USATSI) The final line? 7 IP, 5 H, 0 ER, 1 BB, 13 K.\nThat's superior. Jacob deGrom went out and announced his presence with authority, striking out six of the first eight batters he faced and never looked back. He knew he was going up against the mighty Kershaw in Dodger Stadium and he answered the call. He was nails.\nSeriously, here's a call to give more attention nationally to deGrom being good than the silly \"Kershaw in playoffs\" narrative, though I'm not holding my breath.\nAn underrated aspect to this?\n3. David Wright came through against Pedro Baez \nThis isn't just a play-by-play listing. It means something.\nKershaw needed to be relieved in the seventh inning of a 1-0 playoff game with the bases loaded by Pedro Baez against David Wright. Wright laced a single up the middle to drive home two and give the Mets their cushion.\nKershaw had walked three guys that inning. He was clearly done. So the Dodgers went to the bullpen and an effective but obscure reliever gave up a hit to the Mets' two-hole hitter.\nThe fact of the matter is that deGrom never put his team in the position to have to make a decision like this. Kershaw did.\nDeGrom was \"The Man\" in Game 1. That Kershaw wasn't this dominant doesn't mean he was a choke artist, but it does mean he was outpitched. That isn't up for dispute.\n4. In all, this was all about Kershaw and deGrom \nDead horse alert, but this game really was all about the two starters. They made history together and deGrom made some Mets history of his own . And deGrom > Kershaw.\n5. Michael Cuddyer is a butcher in LF \nIt's been years since Cuddyer should have been employed anywhere but first base or DH, but there he was in left field for the most important Mets game since 2006. Sure enough, he was exposed a few times, most notably when Corey Seager 's ground-rule double totally ate him up. It was one of the worst angles you'll ever see an MLB outfielder take.\nThe reason I bring this up is that it would appear Mets manager Terry Collins was looking to maximize offense at the expense of defense against Kershaw. It's just that Cuddyer hit .259/.309/.391 this season. That's not very good for a corner outfielder and it's definitely not the type of line that makes you think, \"Oh, we definitely need this bat in the lineup at all costs.\" Why not just use their best defensive outfield with Yoenis Cespedes in left, Juan Lagares (.259/.289/.358, by the way) in center and Curtis Granderson in right?\nAt least with a right-hander going in Game 2 for the Dodgers, Collins will (hopefully?) use lefty-swinging rookie Michael Conforto (.270/.335/.506) in left.\n6. The chances we see Kershaw on short rest just went up \nIn each of the past two seasons, we've seen the Dodgers bring Kershaw back on short rest in the NLDS round. It sounded like they didn't want to do that this year, but with a loss already on the books and the possibility of Alex Wood squaring off against an active Steven Matz , the Mets pretty clearly have the edge in Games 3 and 4 based upon pitching matchups and being at home (the Dodgers were 37-44 on the road this year). Having already taken Game 1, the Mets have the upper hand here. So we very well might see the Dodgers move Kershaw up again.\nAnd if they do, how will he fare?\n7. The pressure is all on the Dodgers now \nThis is the third time in a row the Dodgers have been to the postseason. They have a payroll in the stratosphere. They have a new front office structure. And they haven't been to the World Series since 1988. As an added little thorn in their side, the rival Giants have won three of the last five World Series.\nMeantime, the Mets have an excellent young pitching staff in place with workload concerns this postseason. If the Mets don't get the job done here, there are reasons. It can easily be explained. There are also reasons to believe they'll be back and have a few more chances with this rotation when it's not quite as taxed.\nWe could write many more words on the subject, but the simple matter here is that the Dodgers need this series a lot more than the Mets do. And the Dodgers just burned one game of Kershaw -- when they only really have two reliable starters -- and lost it.\nThe Dodgers have to win Game 2. The Mets have already gotten a leg up in this series, even if they lose on Saturday. That's really the single most important takeaway from this game.\nTopics: Alex Wood , Clayton Kershaw , Corey Seager , Curtis Granderson , Daniel Murphy , David Wright , Jacob DeGrom , Juan Lagares , Michael Conforto , Michael Cuddyer , Pedro Baez , Steven Matz , Yoenis Cespedes , Los Angeles Dodgers , New York Mets , San Francisco Giants , MLB", "external_links": [], "published": "2015-10-10T07:19:00.000+03:00", "crawled": "2015-10-10T18:43:17.210+03:00", "highlightTitle": ""}