{"organizations": [], "uuid": "e2ece179d99c5b0a7c8b7d6a7e7dbe002a55916e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "accesswdun.com", "main_image": "http://bf19d0142b960c98204c-6849f9022b05f72b83236695aa4e9a0a.r50.cf2.rackcdn.com/uploads/articles/2015/339946/jef-elb-wood2-be_p3.jpg", "site_section": "http://accesswdun.com/rss/3/rss.xml", "section_title": "AccessWDUN.com Sports", "url": "http://accesswdun.com/article/2015/10/339946/no-3-dragons-wood-roll-over-no-4-elbert-27-8", "country": "US", "title": "(VIDEO) No. 3 Dragons, Wood roll over No. 4 Elbert, 27-8", "performance_score": 0, "site": "accesswdun.com", "participants_count": 1, "title_full": "(VIDEO) No. 3 Dragons, Wood roll over No. 4 Elbert, 27-8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T16:17:00.000+03:00", "replies_count": 0, "uuid": "e2ece179d99c5b0a7c8b7d6a7e7dbe002a55916e"}, "author": "Jeff Hart", "url": "http://accesswdun.com/article/2015/10/339946/no-3-dragons-wood-roll-over-no-4-elbert-27-8", "ord_in_thread": 0, "title": "(VIDEO) No. 3 Dragons, Wood roll over No. 4 Elbert, 27-8", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Jeff Hart Sports Reporter Jefferson's Colby Wood cuts upfield in the Dragons' win over Elbert County on Friday in Elberton. photo: Bobby Escoe Related Articles 2015 High school football rankings 2015 High School Football region standings WEEK 6: Playoff, region races shaping up after big night VIDEO: Gainesville makes most of six Salem turnovers to set up Lanier showdown \nELBERTON -- It may have been advertised as the Colby Wood vs. Mecole Hardman showdown. But it was the Dragons offensive line that deserved top-billing Friday night. \nThe group of Caleb Chandler, Dontae Wilson, Alex Corbett, Hunter Griffith, and Nick Holman controlled the line of scrimmage and opened huge holes for Wood, who pounded out 284 yards on 47 carries and four touchdowns to lead Class AAA third-ranked Jefferson to a 27-8 victory over No. 4 Elbert County at The Granite Bowl. \nThe win put Jefferson (6-0, 2-0 Region 8-AAA) in firm control for the moment atop the region standings. Elbert County (5-1, 1-1) is essentially two games back with the head-to-head loss and Hart County also has a loss in the region. The Dragons and the Bulldogs close out the regular season next month in Jefferson. \n“This was a big win for us,” Jefferson coach Ben Hall said. “I thought the guys did a great job from the beginning. We didn’t turn the ball over and Colby just did a great job of finding the holes.” \nWood finished with more carries than Elbert County ran plays (41) on the night. The Dragons defensive line was able to neutralize the Blue Devils potent offense most of the game. \n“The guys did a great job all night,” Hall said. “They controlled the line and we were able to put some long drives together to control the ball and keep them off the field. That was the key to the game.” \nSenior center Alex Corbett said they knew coming in their play may decide the outcome. \n“Both teams have great players and both lines are good,” Corbett said. “We just tried to come out and take control and get our ground game going. It feels good to be able to have the kind of game we did.” \nHardman finished with 107 yards and one touchdown on 17 carries, but most of that came on the Blue Devils’ only scoring drive early in the fourth quarter after the Dragons had already built a 21-0 lead. \nAll four of the Jefferson scoring drives consumed big chunks of time and were at least 10 plays and 61-yards in length. Jefferson finished with 308 yards rushing on 56 attempts, with 161 coming in the second half on 39 rushes. The Dragons did not throw a pass in the second half. \nThe teams traded punts to open the game as both defenses forced quick three-and-outs. The Blue Devils appeared to grab the early momentum on their next drive as Hardman broke several tackles on the way to a 35-yard touchdown run. But the score was called back on a penalty and they were forced to punt. \nThey traded punts again before Jefferson finally mounted its first drive of the game. The Dragons started at their own 20 and threw just one pass while moving to the Blue Devils 26. They faced a 4th-and 2 and Wood capped the drive with a 26-yard touchdown blast up the middle after a timeout for a 7-0 lead with 10:34 left in the second quarter. \nOther than Hardman’s one run that was called back, the Dragons defense did a masterful job on Hardman. They held the shifty quarterback to just xx yards on xx carries and x-for-x passing in the first half. \nOn the next Elbert County possession following Wood’s fourth-down run, the Jefferson defense forced a 3rd-and-31 with a sack, a tackle for loss, and a penalty to force another Blue Devils punt. \nWood would do a little of everything on the Dragons next drive. He caught a screen pass on 3rd-and-18 and serpentined for 21 yards to keep the drive alive. Later, he rumbled 25 yards on a 3rd-and-3 at the Elbert 43. He capped that drive with a 1-yard scoring with 12 seconds left in the half for a 14-0 lead. \nThe half fittingly ended for both teams as the Jefferson defense sacked Hardman on the final play. \nWood had 24 carries for 128 yards and two touchdowns in the first half alone. The Jefferson defense held Hardman to just 35 yards on four carries and just 28 yards passing. The Blue Devils had 39 yards rushing on 10 carries in the first half. \nThings were much the same to start the second half. After trading punts to open the third quarter, Jefferson marched 55-yards, capped by Wood’s second 1-yard scoring run, for a 21-0 lead with 54 seconds left in the quarter. \nThe Blue Devils finally got their running game going on the next drive. Hardman broke loose for a 26-yard run and then Latravious Barnett followed with 16-yard run to move the ball to the Jefferson 30 to end the third quarter. \nHardman later capped the drive with a 4-yard touchdown run and added a 2-point conversion run to cut the lead to 21-8 with 9:54 left in the game. \nAfter Jefferson extended the lead to 27-8, Elbert County drove down inside the Jefferson 20 but Hardman was picked off at the Dragons 3 to essentially seal the game. \nOne guess on who had the interception: Wood, of course. \nSCORING SUMMARY", "external_links": [], "published": "2015-10-03T16:17:00.000+03:00", "crawled": "2015-10-03T16:12:35.841+03:00", "highlightTitle": ""}