{"organizations": [], "uuid": "37bf8f93b5defaf1ce2d51eefa91e2b99c888d8b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fox8live.com", "main_image": "http://WVUE.images.worldnow.com/images/9008529_G.jpg", "site_section": "http://www.fox8live.com/", "section_title": "New Orleans News, Weather, Saints - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "url": "http://www.fox8live.com/story/30252887/man-shot-twice-when-he-told-robber-he-didnt-have-anything", "country": "US", "title": "Man shot twice when he told robber he didn't have anything", "performance_score": 0, "site": "fox8live.com", "participants_count": 1, "title_full": "Man shot twice when he told robber he didn't have anything - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T01:34:00.000+03:00", "replies_count": 0, "uuid": "37bf8f93b5defaf1ce2d51eefa91e2b99c888d8b"}, "author": "Written by: Natasha Robin", "url": "http://www.fox8live.com/story/30252887/man-shot-twice-when-he-told-robber-he-didnt-have-anything", "ord_in_thread": 0, "title": "Man shot twice when he told robber he didn't have anything", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW ORLEANS, LA (WVUE) - “He was coming to the bus stop to go to work,” Lionel Fischer said.\nFischer said he and his friend meet up at the bus stop every morning on their way to work. This morning, though, things were much different. His friend didn’t show up on time.\n“We were sitting down there, and we hear some shots. We were so scared. We didn’t know which way to go,” Fischer said.\nMoments later, he says he heard his friend screaming from down the street.\n“I didn’t know who it was at first. He was walking up and he said, 'I got shot,'” Fischer said.\nPolice said just before 5 a.m., the 63 year old victim was walking near Morrison Road and Read Boulevard when a man pulled up in a gray truck and demanded his property.\n“He told us the guy got out the truck and asked for money. He said, 'I ain’t got none,' and he shot him,” Fischer said.\nPolice said when the victim didn’t hand over anything, the gunman shot him twice.\n“They didn’t have to shoot him,\" said a woman who was waiting for a bus. \"They could have just went about their business. This was an innocent person, and they didn’t have to shoot him.”\nThe woman, who did not want to be identified, told FOX 8 that she uses the bus stop every day to go to work, and the attempted armed robbery and shooting will make her think twice about coming back.\n“Sometimes I’m leaving out at seven or eight in the morning, and it could have been me at the bus stop when this happened,” she said.\nFischer said his friend was just trying to make an honest living when he became a victim.\n“He a good guy. I told him I feel sorry for him,” Fischer said.\nThe victim is hospitalized in critical condition.\nPolice are still investigating.\nCopyright 2015 WVUE. ", "external_links": [], "published": "2015-10-14T01:34:00.000+03:00", "crawled": "2015-10-14T03:30:45.886+03:00", "highlightTitle": ""}