{"organizations": [], "uuid": "36d9e33702abb4b6912c7beddbd7ad4e17cf6cd5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtontimes.com", "main_image": "http://media.washtimes.com.s3.amazonaws.com/media/image/2015/10/22/5a810e97a30c992f850f6a7067008c61.jpg", "site_section": "http://www.washingtontimes.com/rss/headlines/sports/", "section_title": "www.washingtontimes.com stories: Sports", "url": "http://www.washingtontimes.com/news/2015/oct/23/lundqvist-hayes-lead-rangers-to-4-1-win-over-coyot/", "country": "US", "title": "Lundqvist, Hayes lead Rangers to 4-1 win over Coyotes", "performance_score": 0, "site": "washingtontimes.com", "participants_count": 1, "title_full": "Lundqvist, Hayes lead Rangers to 4-1 win over Coyotes", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T07:41:00.000+03:00", "replies_count": 0, "uuid": "36d9e33702abb4b6912c7beddbd7ad4e17cf6cd5"}, "author": "DENIS P. GORMAN", "url": "http://www.washingtontimes.com/news/2015/oct/23/lundqvist-hayes-lead-rangers-to-4-1-win-over-coyot/", "ord_in_thread": 0, "title": "Lundqvist, Hayes lead Rangers to 4-1 win over Coyotes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sports Lundqvist, Hayes lead Rangers to 4-1 win over Coyotes Arizona Coyotes goalie Mike Smith (41) reacts after New York Rangers’ Chris Kreider (20) scored a goal during the second period of an NHL hockey game Thursday, Oct. 22, 2015, in New York. (AP Photo/Frank Franklin II) more > By DENIS P. GORMAN - Associated Press - Friday, October 23, 2015 \nNEW YORK (AP) - Keith Yandle admitted he was emotional facing the Coyotes on Thursday. \nYandle scored his first goal of the season and the New York Rangers beat Arizona 4-1. \n“Getting your first goal of the season (is) always fun, (and) against your old team,” Yandle said. “It’s nice to get the win. \n“That’s most important.” \nChris Kreider, Rick Nash and Kevin Hayes also scored for New York. Nash’s goal was his 700th career point. Mats Zuccarello added two assists, and Henrik Lundqvist made 34 saves. \nYandle played for the Coyotes from the 2006-07 season until he was acquired by the Rangers last season at the trade deadline. \n“I tried not to let it get in my head,” Yandle said. “After the first couple of (shifts) it was game time and time to play.” \nKlas Dahlbeck scored for Arizona. The Coyotes have lost four in a row after opening the season 3-0. Mike Smith made 24 saves for Arizona. \n“We have to be better than what we’ve been,” Coyotes captain Shane Doan said. \nHayes broke a 1-1 tie with his second goal of the season at 2:35 of the third period. Smith turned the puck over to J.T. Miller trying to play the puck behind the goal line. Miller found Hayes along the goal line, and the second year center lifted a backhand into the net. \n“Brutal play,” Smith said. “I heard someone call for it and it didn’t happen to be our player. It cost us. \n“That’s on me. I have to make a better play than that.” \nFour minutes later, Yandle’s first goal of the season increased the lead to 3-1. With New York on the power play, Yandle fired a shot from the point that found its way into the net. \nThe first of two regular-season meetings this season also marked the first time Yandle and Coyotes winger Anthony Duclair played against their former teams. \nNew York acquired Yandle, defenseman Chris Summers and a fourth-round pick in next June’s draft for Duclair, a second-round pick in the 2015 draft and a conditional first-round selection in June’s draft in a trade last season.", "external_links": [], "published": "2015-10-23T07:41:00.000+03:00", "crawled": "2015-10-23T08:38:29.587+03:00", "highlightTitle": ""}