{"organizations": [], "uuid": "127e47f33f00ae816c77330b701932bb4d1ed75e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cleveland.com", "main_image": "http://imgick.cleveland.com/home/cleve-media/width620/img/plain-dealer/photo/2015/10/11/18949887-large.jpg", "site_section": "http://www.cleveland.com/pluto/", "section_title": "Cleveland, OH Sports Blog | Terry's Talkin' Sports - cleveland.com ", "url": "http://www.cleveland.com/budshaw/index.ssf/2015/10/cleveland_browns_210.html", "country": "US", "title": "Cleveland Browns more than holding their own with Josh McCown at QB -- Bud Shaw's Sports Spin", "performance_score": 0, "site": "cleveland.com", "participants_count": 16, "title_full": "Cleveland Browns more than holding their own with Josh McCown at QB -- Bud Shaw's Sports Spin | cleveland.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T01:38:00.000+03:00", "replies_count": 15, "uuid": "24d51d72f23a7876f7e1a4800b6695b615461a54"}, "author": "Bud Shaw, Northeast Ohio Media Group", "url": "http://www.cleveland.com/budshaw/index.ssf/2015/10/cleveland_browns_210.html#post-0", "ord_in_thread": 0, "title": "Cleveland Browns more than holding their own with Josh McCown at QB -- Bud Shaw's Sports Spin", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CLEVELAND, Ohio – Josh McCown has now split matchups with Philip Rivers and Joe Flacco in the past two weeks.\nRumor has it there were defenses involved, too, though the evidence is scant.\nIn a city that's been on the short end of these QB tete-a-tetes for years – Flacco was 13-1 against the Browns Sunday for a reason – it's difficult to see the last few weeks in any other context. The Browns' expensive, underachieving defense requires McCown to be something he hasn't been his entire career -- consistently good -- and yet he's answering that call.\nAfter a stirring overtime win in Baltimore Sunday in which McCown threw for a franchise record 457 yards, maybe we can stop making so much of the roll call of quarterbacks to come – Peyton Manning, Carson Palmer, Andy Dalton, Ben Roethlisberger.\nProbably not. But how about just for a day or two?\nMcCown is not only giving the Browns every chance to win since his rusty first half against Oakland, he's the biggest reason the Browns have to believe in themselves. The strong running game and stubborn defense that were supposed to prop up the latest journeyman quarterback to wear the orange and brown (and other combinations to come) have shown up sparingly.\nThe Browns defense had its moments. But it benefited most Sunday from an ankle injury to Justin Forsett after getting gouged again on the edges in the fourth quarter. Forsett was gone for the final series of regulation in which the Ravens settled for a field goal and then stayed on the sideline when the Ravens went three-and-out in overtime.\nThe running game was there in spurts. It may not be the healthiest strategy to depend on McCown to keep slicing defenses, but it's working. And confidence is building, not despite him, but because of him.\nIt's not only working. That's faint praise. Sunday it reversed a season heading in the wrong direction: 1-3 is a bad start; 1-4 with Denver and Arizona as two of the next three opponents – would've introduced yet another black cloud into a young season. OK, blacker cloud. That's what Baltimore's two early TDs felt like for Browns fans.\nMcCown was terrific early on third downs but stumbled in the red zone. The red zone isn't all about the passing game. The Ravens didn't have to worry about the Browns running the ball down there (until the overtime period).\nMcCown threw 51 times. Two bad plays jumped out. Two.\nOnce, when he threw an interception nullified by a stupid Ravens' pass interference penalty. And late in regulation when, victimized by his head coach's time management issues, he scrambled and wasted more precious clock instead of throwing the ball away.\nBecause of McCown's good work, nobody has mentioned the other quarterback's name for the past two weeks. That's probably not quite true. After the loss to San Diego, you still heard the argument that if McCown could play that well and the Browns still find a way to lose, what was the point? Why not find out about No. 2?\nMcCown deserved a better take than that last week. It was a week argument then. Now, it's moot. The offense is growing in different ways because McCown is reading blitzes, making smart decisions, involving more receivers.\nAnother Gary Barnidge circus catch helped immensely, but there was nothing else even the least bit fluky in what the Browns offense did to Baltimore.\nMcCown going deep. McCown scrambling judiciously. McCown taking advantage of Ravens linebackers in coverage. My take at halftime was that the Browns can win with Josh McCown but they can't win as much as they'll need to with McCown being the most productive player on either side of the ball.\nSunday's outcome doesn't change that opinion regarding the long term. They'll still need to run the ball more consistently and stop the run.\nBut it's just as true to say he's the one propping them up and -- judging his season to date -- there could be more where that came from.", "external_links": [], "published": "2015-10-12T01:38:00.000+03:00", "crawled": "2015-10-12T12:27:50.678+03:00", "highlightTitle": ""}