{"organizations": [], "uuid": "391cccf45dfb3a8539b43ebc2f7023b101601047", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wcax.com", "main_image": "", "site_section": "http://www.wcax.com/category/13530/national-news", "section_title": "National News - WCAX.COM Local Vermont News, Weather and Sports-", "url": "http://www.wcax.com/story/30131659/life-on-mars-nasa-says-planet-appears-to-have-flowing-water", "country": "US", "title": "Life on Mars? NASA says planet appears to have flowing water", "performance_score": 0, "site": "wcax.com", "participants_count": 1, "title_full": "Life on Mars? NASA says planet appears to have flowing water - WCAX.COM Local Vermont News, Weather and Sports-", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "391cccf45dfb3a8539b43ebc2f7023b101601047"}, "author": "wcax.com", "url": "http://www.wcax.com/story/30131659/life-on-mars-nasa-says-planet-appears-to-have-flowing-water", "ord_in_thread": 0, "title": "Life on Mars? NASA says planet appears to have flowing water", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By MARCIA DUNN\nAP Aerospace Writer CAPE CANAVERAL, Fla. (AP) - Mars appears to have flowing rivulets of water, at least in the summer, scientists reported Monday in a finding that boosts the odds of life on the red planet.\n\"Mars is not the dry, arid planet that we thought of in the past,\" said Jim Green, director of planetary science for NASA.\nScientists in 2008 confirmed the existence of frozen water on Mars. Now instruments aboard NASA's Mars Reconnaissance Orbiter have yielded what researchers said is the strongest evidence yet that water in liquid form trickles down certain Martian slopes.\nAnd because liquid water is essential to life, the finding could have major implications for the possibility of microscopic life forms on Earth's next-door neighbor.\n\"It suggests that it would be possible for there to be life today on Mars,\" NASA's science mission chief, John Grunsfeld, said at a Washington news conference.\nThe rivulets - if that's what they are, since the evidence for their existence is indirect - are about 12 to 15 feet wide and 300 feet or more long, scientists said. They apparently consist of wet soil, not standing water.\nThe water is believed to contain certain salts - not ordinary table salt, but magnesium perchlorate, magnesium chlorate and sodium perchlorate. Like road salt used to melt ice and snow on Earth, such compounds can prevent water from freezing at extremely low temperatures.\nThat would explain how water could exist in liquid form on Mars, which has an average temperature of minus 81 degrees Fahrenheit.\nIn addition to supporting life, the presence of liquid water could make things easier for astronauts visiting or living on Mars. Water could be used for drinking and for creating oxygen and rocket fuel. NASA's goal is to send humans there in the 2030s.\nMichael Meyer, lead scientist for NASA's Mars exploration program, said the only definitive way for now to determine whether there's life on Mars is to collect rocks and soil for analysis on Earth, something a U.S. lander set for liftoff in 2020 will do.\n\"Water is one of the most precious resources necessary for a human mission to the red planet,\" Rep. Lamar Smith, R-Texas, chairman of the House science, space and technology committee, said in a statement. \"The more evidence we find of it, the more encouraged I am for future Mars missions.\"\nAlfred McEwen of the University of Arizona at Tucson, a scientist on the project, said he, for one, believes the possibility of life on Mars to be \"very high.\"\nThe source of the briny water is a mystery. Scientists said it could be melting ice, an underground aquifer, water vapor from the thin Martian atmosphere, or some combination.\nThe evidence of flowing water consists largely of dark, narrow streaks on the surface that tend to appear and grow during the warmest Martian months and fade the rest of the year. The streaks are in places where the temperature is as low as 10 below zero.\nThey were spotted by the Mars orbiter's high-resolution, telescopic camera, and another on-board instrument detected the chemical signature of salt compounds combined with water.\nMcEwen said that there appears to be a \"significant volume\" of water, speculating it could fill many Olympic swimming pools, but that it is spread thin.\nPresent-day Mars is nothing like ancient Mars. Three billion years ago, our most Earthlike neighbor had a huge ocean, but something radical happened, and exactly what remains a mystery.\nThe notion of water and life on Mars has been irresistible to earthlings for generations.\nIn 1877, Italian astronomer Giovanni Schiaparelli spied what he called \"canali\" on Mars - Italian for \"channels\" - but the word was mistranslated as \"canals\" in English, causing imaginations to run wild. In the early 1900s, amateur astronomer Percival Lowell claimed to have spotted irrigation canals and theorized they were built by Martians.\nIn 2008, NASA's Phoenix spacecraft landed on Mars and confirmed the long-suspected presence of ice in the soil. The Mars Reconnaissance Orbiter has been circling the planet since 2006.\nThe latest findings were published in the journal Nature Geoscience. The lead author, Lujendra Ojha, a doctoral candidate at Georgia Institute of Technology, first noticed the streaks on Mars in 2010. Ojha and colleagues speculated at the time that they were seeing flowing water.\nFor NASA, at least, the timing couldn't be better. This Friday, the NASA-approved movie \"The Martian\" has its premiere.\n___\nThis story has been corrected to show that the average temperature on Mars is minus 81, not minus 85.\n___\nOnline:\nNASA: http://mars.nasa.gov\n ", "external_links": [], "published": "2015-09-28T03:00:00.000+03:00", "crawled": "2015-10-02T23:03:11.650+03:00", "highlightTitle": ""}