{"organizations": [], "uuid": "38acf659e5947a8478b90d89e43f0fec90e0f965", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxsports.com", "main_image": "http://a.fssta.com/content/dam/fsdigital/fscom/nfl/images/2015/10/18/101815-NFL-Indianapolis-Colts-head-coach-Chuck-Pagano-MM-PI.vresize.1200.675.high.99.jpg", "site_section": "http://api.foxsports.com/v1/rss?partnerKey=zBaFxRyGKCfxBagJG9b8pqLyndmvo7UU&tag=laces-out", "section_title": "FOX Sports Digital", "url": "http://www.foxsports.com/nfl/laces-out/indianapolis-colts-new-england-patriots-failed-fake-punt-play-101815?cmpid=feed:-sports-CQ-RSS-Feed", "country": "", "title": "Colts take air out of building with horrendous trick play fail", "performance_score": 0, "site": "foxsports.com", "participants_count": 0, "title_full": "Colts take air out of building with horrendous trick play fail", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T06:34:00.000+03:00", "replies_count": 0, "uuid": "38acf659e5947a8478b90d89e43f0fec90e0f965"}, "author": "", "url": "http://www.foxsports.com/nfl/laces-out/indianapolis-colts-new-england-patriots-failed-fake-punt-play-101815?cmpid=feed:-sports-CQ-RSS-Feed", "ord_in_thread": 0, "title": "Colts take air out of building with horrendous trick play fail", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Transaction: See who is wheeling and dealing \nThe Colts were facing fourth-and-3 at their own 37, down 27-21 late in the third quarter. After the Patriots scored a touchdown to open the second half, Indianapolis forced New England to punt on consecutive drives and seemed to finally slow down Brady & Co. when this six-play drive stalled. \nWhat’s worse than that was the result: \nAfter snuffing out the play, the Patriots took the ball over on downs on the Colts’ 35, took all of six plays to score a touchdown, and stretched their lead to 34-21. The Colts would get no closer until an all-too-late touchdown with 79 seconds to play. \nSo … maybe the Colts were trying to force the Patriots into burning a timeout? \nEither way, after standing around for a few seconds, Whalen snapped the ball and Anderson was swarmed by the several defenders who were standing right there with nobody blocking them. \nAfter the game, Belichick said he actually wasn’t all that surprised be the play. \n\"We expected this to be a gadget game,\" Belichick told the media after the game. \"Their punter ran a sweep against Tennessee a couple weeks ago, so that's something they've done in the past.\" \nSounds about right, since the Pats owned the play from before the snap. NFL supports Breast Cancer Awareness Month by going pink \nAs for some players? \n\"It turned out to be one of the worst failed fakes probably of all time,\" Indianapolis punter Pat McAfee said. \n\"I saw the formation, and I wasn't sure what was going on,\" Patriots defensive end Chandler Jones said. \"It was great awareness by our team.\" \nAnd the man who will ultimately take the heat for the call? \n\"The whole idea there was on fourth-and-3 or less, shift our alignment to where you either catch them misaligned, they try to sub some people in, catch them with 12 men on the field and if you get a certain look, you can make a play,\" Colts coach Chuck Pagano told the media after the game. \"Alignment-wise we weren't lined up correctly, and then a communication problem on the snap. I take responsibility for that.\" \nNow … let's turn it over to social media: true — Andrew Siciliano (@AndrewSiciliano) October 19, 2015 Not since Sonny Corleone at the Toll Booth in the Godfather has someone faced as poor odds as Whalen on that play — Joe Reedy (@joereedy) October 19, 2015 Colts gonna raise a new banner post game. #NFL #Football pic.twitter.com/JLhWOBIixK — Matthew Henderson (@mhenderson95) October 19, 2015 In a final act of defiance, The Colts coaching staff dramatically hurled the playbook into the sea. pic.twitter.com/CnWGaIeebv — Will McAvoy (@WillMcAvoyACN) October 19, 2015 great now belichick is gonna steal that punt play", "external_links": [], "published": "2015-10-19T06:34:00.000+03:00", "crawled": "2015-10-19T14:54:16.636+03:00", "highlightTitle": ""}