{"organizations": [], "uuid": "904fa7ab8e93812210495b4d75e7452fbb65ae74", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thetimesnews.com", "main_image": "http://www.thetimesnews.com/Global/images/head/nameplate/thetimesnews_logo.png", "site_section": "http://www.thetimesnews.com/sports/acc-sports?template=rss&mime=xml", "section_title": "ACC Sports - The Times-News", "url": "http://www.thetimesnews.com/article/20151022/SPORTS/151029710/15217/SPORTS?rssfeed=true", "country": "US", "title": "Tar Heels coach goes all positive despite cloud over program", "performance_score": 0, "site": "thetimesnews.com", "participants_count": 1, "title_full": "Tar Heels coach goes all positive despite cloud over program", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T08:45:00.000+03:00", "replies_count": 0, "uuid": "904fa7ab8e93812210495b4d75e7452fbb65ae74"}, "author": "Bob Sutton", "url": "http://www.thetimesnews.com/article/20151022/SPORTS/151029710/15217/SPORTS?rssfeed=true", "ord_in_thread": 0, "title": "Tar Heels coach goes all positive despite cloud over program", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Oct. 22, 2015 at 12:42 AM Updated at 12:45 AM GREENSBORO — Coach Sylvia Hatchell came ready to repel doom and gloom associated with the North Carolina women’s basketball program. “I see it as an opportunity to show everybody, including you,” Hatchell told reporters Wednesday at the Atlantic Coast Conference women’s basketball media day. Hatchell’s program has come under particular scrutiny during the NCAA’s investigation into academic fraud involving athletes at the university. That was followed by a spring exodus of transfers from the program. She refused to be led down a path of negativity during sessions at Grandover Resort. “People think it’s a rough time. This is a great time,” she said. “This will be our finest hour. … I’m great. I’m fine. … We’ve got what it takes.” North Carolina is coming off a 26-9 season that ended with an NCAA Tournament Sweet 16 loss to South Carolina. Then came a series of player departures amid speculation of yet-to-be revealed NCAA penalties. Sophomore guard Jamie Cherry said she never wavered in her support for Hatchell and the Tar Heels. “I’ve been loyal to Coach Hatchell since I was a freshman in high school,” Cherry said. Senior forward Xylina McDaniel said she was firm in her commitment to complete her college career with the Tar Heels. “Loyalty is everything to me,” McDaniel said. “Coach Hatchell has shown her loyalty to us and I’m going to show that right back.” Hatchell, who’s entering her 30th season at the university, dealt with leukemia during the 2013-14 season. She declined to address questions directly relating to NCAA matters. She said she’s capable of offering a positive perspective regarding the state of the program. “We’ve won some championships,” she said. “We’ve got some more ahead of us we’re going to win.” Hatchell said the program is lined up to sign seven players in next month’s early signing period, insisting repeatedly that it’s a sign of strength for the program. “Every day is an opportunity and we’re going to be fine,” she said.", "external_links": [], "published": "2015-10-22T08:45:00.000+03:00", "crawled": "2015-10-22T17:00:24.289+03:00", "highlightTitle": ""}