{"organizations": [], "uuid": "31ec861fa7037f8a5f0fb8423f51447827350367", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/nation/uk-allows-sikhs-to-wear-turbans-at-workplace/140516.html", "country": "US", "title": "UK allows Sikhs to wear turbans at workplace", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "UK allows Sikhs to wear turbans at workplace", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "31ec861fa7037f8a5f0fb8423f51447827350367"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/nation/uk-allows-sikhs-to-wear-turbans-at-workplace/140516.html", "ord_in_thread": 0, "title": "UK allows Sikhs to wear turbans at workplace", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "London, October 1\nSikhs in Britain will no longer face legal action for wearing turbans in majority of workplaces after the government announced a new set of rules on Thursday. “Turban-wearing Sikhs will now have the right to choose not to wear head protection and will be exempt from legal requirements to wear a safety helmet in the majority of workplaces,” an official statement from the British government said. “This change demonstrates that, whoever you are, whatever your background, and whatever industry you choose — if you work hard and want to get on in life, this government will be on your side,” said UK minister for employment Priti Patel. “As the Prime Minister’s Indian Diaspora Champion as well as employment minister, I’m delighted to be part of the government that has made this change. It makes me proud that the UK is the home of such a talented, ambitious and hardworking community.” Since 1989, Sikhs working in the construction industry have been exempt from rules requiring head protection but because of the legal loophole those in less dangerous industries, such as those working in factories and warehouses, were not. Turban-wearing Sikhs will now have the right to choose not to wear head protection and will be exempt from legal requirements to wear helmets in the majority of workplaces. “We are pleased that Parliament listened to our campaign and enabled this vital change in the law. It will make a real difference to Sikhs in the UK by increasing the number of workplaces that turban-wearing Sikhs can work in whilst maintaining their religiously mandated identity,” said Gurinder Singh Josan, spokesperson for Sikh Council UK. — Agencies", "external_links": [], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-02T08:17:01.754+03:00", "highlightTitle": ""}