{"organizations": [], "uuid": "099379bb89278fec4fe3ee852b4485017a264f05", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.oregonlive.com", "main_image": "http://imgick.oregonlive.com/home/brightcove01/width620/img/13/260825828001/201508/1329/260825828001_4444236111001_500-.jpg?pubId=260825828001", "site_section": "http://www.oregonlive.com/", "section_title": "Oregon Local News, Breaking News, Sports &amp; Weather - OregonLive.com", "url": "http://www.oregonlive.com/politics/index.ssf/2015/10/kicker_rebate_confirmed_--_and.html", "country": "US", "title": "Kicker rebate confirmed -- and you'll get a bit less", "performance_score": 0, "site": "oregonlive.com", "participants_count": 18, "title_full": "Kicker rebate confirmed -- and you'll get a bit less | OregonLive.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T21:15:00.000+03:00", "replies_count": 18, "uuid": "1d07aa117965002de14b7b813933115de2f3ba6e"}, "author": "Michelle Brence | The Oregonian/OregonLive", "url": "http://www.oregonlive.com/politics/index.ssf/2015/10/kicker_rebate_confirmed_--_and.html#post-0", "ord_in_thread": 0, "title": "Kicker rebate confirmed -- and you'll get a bit less", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Remember the kicker rebate announced in late August? Oregon taxpayers will still get one -- but it will be a bit less than expected.\nThe state Office of Economic Analysis announced Tuesday that it had certified the kicker -- and that taxpayers will get a credit on their 2015 state income taxes of 5.6 percent. In August, state economists had estimated the percentage at 5.8 percent.\nThe difference won't amount to a lot of money for most people. The median kicker rebate announced in August was $124. The new, lower percentage would shave about $4.25 off that, making the median rebate just under $120.\nYou can find out exactly how much you'll get using our kicker calculator:\nThe percentage changed after state officials revised the amount of revenue that came in from people who don't live in Oregon full time, said Paul Warner, the state's legislative revenue officer.\nIn total, the state will return $402 million to taxpayers. That figured didn't change from August.\nThe state's unique kicker law is triggered when Oregon's tax revenues (minus corporate income taxes) exceed the forecast made at the start of the two-year budget cycle by 2 percent or more.\nWhen that occurs, all the extra revenue must be returned to taxpayers. (The corporate kicker works the same way, but the surplus now goes to schools.)\nYou won't get a check like the last time the kicker kicked in 2007. Instead, you'll get 5.6 percent of your 2014 state tax liability back as a credit on your 2015 taxes.\n That means a couple of things. If you didn't pay Oregon taxes in 2014, you won't get a kicker. It's a rebate, so you have to pay in to get anything out.\nAlso, if you owe more in taxes for 2015 than your rebate, you won't get anything to spend. The rebate will just lower your tax bill. If the state owes you money, your kicker rebate will be added to your overall refund.\nFinally, if you don't owe Oregon taxes in 2015, you'll still have to file a tax return to claim your kicker.\nHere's how to figure out exactly what your kicker will be worth. Dig out your 2014 Oregon tax form and find your \"total tax before credits.\"\nOn Oregon Form 40 — the one most use — look on Line 31. For Form 40P, look on Line 52. On Form 40N, look on Line 53. Then take that figure and multiply it by 0.056 to get the amount of your rebate. (If you're among the small percentage of taxpayers who paid income taxes and claimed credits in a state or states other than Oregon, subtract that credit before multiplying.)\nLearn more about the kicker with previous coverage on OregonLive and on the state of Oregon's website .\nIan K. Kullgren contributed.\n-- Michelle Brence\nmbrence@oregonian.com\n503-412-7059\n@mbrence", "external_links": ["http://www.oregon.gov/DAS/OEA/pages/index.aspx", "http://www.oregon.gov/dor/pages/general_faqs.aspx"], "published": "2015-10-06T21:15:00.000+03:00", "crawled": "2015-10-07T08:37:36.148+03:00", "highlightTitle": ""}