{"organizations": [], "uuid": "6bbed6981aacce540313c2b6fb2dc61897d36cd6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/2/8/155888/World/Region/Erdogan-sees-Syria-link-in-Ankara-attack,-orders-s.aspx", "country": "EG", "title": "Erdogan sees Syria link in Ankara attack, orders state probe - Region - World", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Erdogan sees Syria link in Ankara attack, orders state probe - Region - World - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "6bbed6981aacce540313c2b6fb2dc61897d36cd6"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/2/8/155888/World/Region/Erdogan-sees-Syria-link-in-Ankara-attack,-orders-s.aspx", "ord_in_thread": 0, "title": "Erdogan sees Syria link in Ankara attack, orders state probe - Region - World", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Turkey faces period of instability in wake of attacks Hundreds gather at funeral of Turkish bomb victims, chanting anti-govt slogans ISIS prime suspect in Ankara bombing: Turkey PM Turkey sees ISIS hand in Ankara bombings: Security Sources Turkish President Recep Tayyip Erdogan on Tuesday ordered a special state probe into possible shortcomings over the Ankara bombings which killed 97, saying intelligence indicated the attack had its origins in Syria.\nThe government has said the Islamic State (IS) group is the prime suspect behind Turkey's deadliest attack, which saw two suicide bombers blow themselves up in crowd of leftist and pro-Kurdish activists at a peace rally.\nErgodan -- who has come under fire over alleged security lapses -- broke three days of silence with his first public remarks on the attacks at a joint news conference with visiting Finnish President Sauli Niinisto.\nHe announced that he ordered the State Supervisory Council (DDK), an inspection body attached to the Turkish presidency, to undertake a special investigation \"to handle (the attack) from a different perspective\".\nIts probe will be held in parallel with the regular police and judicial investigation. The DDK has in the past probed state-sensitive issues like the death in 1993 of former president Turgut Ozal, which many regard as suspicious.\nAmid bitter criticism of the authorities' handling of the disaster, Erdogan admitted there were security shortcomings but said their magnitude would be made clear only later.\n\"There must undoubtedly be a mistake, a shortcoming in some place. Of what dimension? This will emerge after examinations.\"\nWith pressure growing to dismiss Interior Minister Selami Altinok, Erdogan said immediate resignations were not appropriate.\n\"If there's any negligence of duty, then both the prime minister and related units will take steps needed. Nobody should doubt it.\"\nThere have been growing indications that the authorities are focussing on possible parallels or even links to a July 20 suicide bombing at a peace rally in Suruc on the Syrian border that killed 34.\nThe government blamed IS for that attack, which also targeted a gathering of pro-Kurdish and leftist activists.\nWithout giving further details, Erdogan said Turkey received intelligence indicating that the Ankara attack may be linked to Syria, where IS jihadists have captured swathes of territory up to the Turkish border.\n\"We received intelligence that there were some preparations for various attacks by entering our country. There is some intelligence that this has roots in Syria,\" he said.\nOver the weekend and on Monday, police arrested dozens of people with suspected links to IS in cities stretching from the Mediterranean resort of Antalya to the southern city of Adana.\nErdogan said the Ankara attack culprits will be brought to justice but warned \"some patience is needed\" as DNA tests are carried out on the remains of the two suicide bombers.\nTurkey's NATO allies have long pointed the finger at Ankara for not taking a tougher line as IS militants seized swathes of northern Iraq and Syria.\nBut following months of Western pressure, Turkey is now a full member of the US-led coalition against IS and allowing American jets to use its Incirlik air base for raids, potentially making it a more likely target for IS attacks.\nThe attack has raised political tensions to new highs as Turkey prepares for a November 1 snap election, with polarisation within the country now greater than ever.\nSelahattin Demirtas, the leader of the pro-Kurdish Peoples' Democratic Party (HDP) which lost several members in the blasts, accused Ankara of turning a \"blind eye\" to IS in Syria.\nHundreds of labour activists gathered in front of Istanbul's Sirkeci train station -- the fabled terminus of the Orient Express -- in the hope of marching through the city to remember the dead.\n\"We know the killer!\" read the slogan on several banners, accusing the government of complicity in the bombing. The government has ridiculed such claims.\nBut tensions rose after the police blocked their way, saying the rally was not appropriate following a ban issued overnight by the Istanbul authorities.\nScuffles broke out as demonstrators clashed with truncheon-wielding police in riot gear, AFP photographers said.\nWith Turkey on a high alert after the violence, the authorities on Tuesday defused a suspect package in front of Ankara train station.\nThe attacks came as the government was waging a relentless \"anti-terror\" offensive against the outlawed Kurdistan Workers Party (PKK), even after the group announced a ceasefire at the weekend.\nIn the latest air raids on PKK targets, the military said 12 \"terrorists\" were killed in air strikes on their hold-outs in the southeastern Hakkari region.", "external_links": [], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-14T00:45:49.940+03:00", "highlightTitle": ""}