{"organizations": ["Shaw Media Correspondent"], "uuid": "945dc959114026db6b333c609bfc34b743f8ca8c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.morrisherald-news.com", "main_image": "http://www.morrisdailyherald.com/images/avatar.png", "site_section": "http://www.morrisherald-news.com/?rss=sports", "section_title": "MDH Sports", "url": "http://www.morrisherald-news.com/2015/10/18/seneca-football-getts-glimpses-of-the-future-in-late-season/aml5ml4/", "country": "US", "title": "Seneca football getts glimpses of the future in late season", "performance_score": 0, "site": "morrisherald-news.com", "participants_count": 0, "title_full": "Seneca football getts glimpses of the future in late season", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T06:06:00.000+03:00", "replies_count": 0, "uuid": "945dc959114026db6b333c609bfc34b743f8ca8c"}, "author": "", "url": "http://www.morrisherald-news.com/2015/10/18/seneca-football-getts-glimpses-of-the-future-in-late-season/aml5ml4/", "ord_in_thread": 0, "title": "Seneca football getts glimpses of the future in late season", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["MARK JOHNSON"], "text": "Seneca football getts glimpses of the future in late season Published: Sunday, Oct. 18, 2015 10:06 p.m. CDT By MARK JOHNSON - Shaw Media Correspondent \nPLANO – Seneca found itself Friday night in a position that has been all too familiar over the past several years – playing without hope of making the state football playoffs. Related Links Second-half turnovers doom Seneca football in loss to Lisle \nA 47-7 loss at Wilmington in Week 7 officially eliminated the Fighting Irish from the postseason, making this the 13th time in 14 seasons their season will end after nine weeks. All that was left Friday at Plano, where Seneca lost 48-23, and this week against Coal City is the chance to play spoiler. \nAs the injuries have mounted on top of injuries, coach Ted O’Boyle and his staff have been challenged to simply field a full team. Seneca’s health situation has been so bad that late in the Wilmington game, its varsity was forced to turn to what had been the backup quarterback for its sophomore team at the beginning of the season. \nWhile Hunter Greve, who started the year as the starting sophomore-team quarterback, was back for the Plano game and was able to play the whole night, Wyatt Aldrich, Jack Coonan and Anthony Willoughby joined the list of banged-up players during the game. \nThe positive side to the injury mess is that several sophomores and juniors have gained valuable varsity experience out of necessity. Several made an impression Friday on O’Boyle. \n“I thought Hunter Greve did a nice job at quarterback, kind of controlling it tonight. … He’s kind of been thrown into this, and I liked what I saw tonight. I saw him kind of grow up with some confidence,” O’Boyle said. \n“I saw (junior) Austin Cockream come into the linebacker position and make some stops. We’re really depleted – injuries have really hurt us at the linebacker position – Austin came in, did a nice job. I thought our receivers really did a good job early in the game. They ran good routes. We didn’t complete a whole lot, (but) we created separation there at times.” \nGreve has been a quarterback much of the time since he started to play organized football with the Seneca Pride in sixth grade. \nGreve, who describes himself as a “more vocal” player than he was in August, expects the reps he has gotten with the varsity Irish will pay off in future seasons. \n“I’ll be very prepared,” Greve said. “I’ll be going to quarterback camp in the summer, just trying to get better all around.” \nThe future has not completely overshadowed the present for O’Boyle, however. He wants the Irish to have as successful a sendoff as possible for the players about to play their final game next week. \n“Credit the seniors for showing you can still play as hard as you can no matter what. I think (the sophomores and juniors) can learn something from some of this stuff,” O’Boyle said. \n“I even thanked ‘em this week, the seniors. I know this season wasn’t what we had hoped for, with the injuries we’ve sustained, it’s just been devastating, and for guys to continue to come to practice and continue to give effort, and the effort that they gave tonight was just great.”", "external_links": [], "published": "2015-10-19T06:06:00.000+03:00", "crawled": "2015-10-19T11:11:24.075+03:00", "highlightTitle": ""}