{"organizations": ["Ohio U Miami", "Ohio U"], "uuid": "d2be6ef93af809a670d70251d3fa39dbc9cd385d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.local12.com", "main_image": "http://www.local12.com//template/ugc/wkrc/1601/m62Es5w7.jpg", "site_section": "http://www.local12.com/sports/features/local-sports/rss.xml", "section_title": "wkrc LOCAL Sports", "url": "http://www.local12.com/sports/features/local-sports/stories/Miami-coach-discusses-matchup-against-Ohio-U-214646.shtml", "country": "US", "title": "Miami coach discusses matchup against Ohio U", "performance_score": 0, "site": "local12.com", "participants_count": 0, "title_full": "Miami coach discusses matchup against Ohio U", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T16:59:00.000+03:00", "replies_count": 0, "uuid": "d2be6ef93af809a670d70251d3fa39dbc9cd385d"}, "author": "", "url": "http://www.local12.com/sports/features/local-sports/stories/Miami-coach-discusses-matchup-against-Ohio-U-214646.shtml", "ord_in_thread": 0, "title": "Miami coach discusses matchup against Ohio U", "locations": ["Miami"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Miami coach discusses matchup against Ohio U \nUpdated: Mon, Oct 05 2015, 02:10 PM \nOXFORD, Ohio (WKRC) -- Miami football coach Chuck Martin discusses the loss at Kent State and previews this Saturday's game against Ohio U in the video. The teams will meet at 2:00 p.m. in Athens. Miami has dropped four straight games. Image and video courtesy Miami University Athletics Related Stories Entertainment News \nBOX OFFICE - \"THE MARTIAN\" \nNEW YORK (AP) -- Just days after NASA announced findings suggesting there's water on Mars, a movie about an astronaut stranded on the planet made a splash at the box office. Get This \nATLANTA BRAVES PLAYER BRINGS DOWN MASCOTS \nATLANTA (AP) -- The Atlanta Braves haven't exactly had a lot of big hits this past season -- which is why they finished about two dozen games behind the first-place New York Mets in the National League East. Business News \nUS services growth slows in September as orders plunge \nWASHINGTON (AP) -- Growth in the U.S. services sector slowed in September as sales fell and new orders plunged, evidence that stock market volatility may have hit consumer confidence and limited spending. \nIN THE NEWS: GOOGLE IS NOW \"ALPHABET\" \nNEW YORK (AP) -- \"I don't know, but I can alphabet it to find out.\" Stay Connected: \n© 2015 Sinclair Broadcast Group. All Rights Reserved. Local 12 WKRC-TV is the local station for breaking news, The Weather Authority forecast, traffic alerts, community news, Cincinnati Bengals and Reds sports updates, and CBS network news and entertainment programming for the Cincinnati and the Tri-State area of Southwest Ohio, Northern Kentucky and Southeast Indiana, including Anderson Township, Avondale, Blue Ash, Bond Hill, Camp Washington, Cheviot, Cleves, Colerain Township, Columbia-Tusculum, Corryville, Norwood, Delhi, East Price Hill, Golf Manor, Hyde Park, Lebanon, Loveland, Lower Price Hill, Madeira, Mariemont, Mount Adams, Mount Airy, Mount Healthy, Mount Lookout, Mount Washington, Oakley, Over-The-Rhine, Reading, Sedamsville, Sharonville, Springdale, St. Bernard, South Cumminsville, Symmes Township, Mason, Hamilton, Union Township, Walnut Hills, West Chester, Wyoming, West Price Hill, Westwood, Winton Hills, Alexandria, Bellevue, Covington, Crescent Springs, Erlanger, Fort Mitchell, Fort Thomas, Fort Wright, Florence, Hebron, Highland Heights, Newport, Southgate, Villa Hills, Walton, Aurora, Greendale, and Lawrenceburg.", "external_links": [], "published": "2015-10-05T16:59:00.000+03:00", "crawled": "2015-10-06T03:40:43.068+03:00", "highlightTitle": ""}