{"organizations": [], "uuid": "e8acadec5e81a7b65ef56cba626ab823965ec0ef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deseretnews.com", "main_image": "http://img.deseretnews.com/images/article/hires/1614943/1614943.jpg", "site_section": "http://www.deseretnews.com/sports/index.rss", "section_title": "Sports News | Deseret News", "url": "http://www.deseretnews.com/article/865639656/Third-ranked-Utes-just-keep-on-picking-them-off.html", "country": "US", "title": "Third-ranked Utes just keep on picking them off", "performance_score": 0, "site": "deseretnews.com", "participants_count": 1, "title_full": "Third-ranked Utes just keep on picking them off | Deseret News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "e8acadec5e81a7b65ef56cba626ab823965ec0ef"}, "author": "Dirk Facer", "url": "http://www.deseretnews.com/article/865639656/Third-ranked-Utes-just-keep-on-picking-them-off.html", "ord_in_thread": 0, "title": "Third-ranked Utes just keep on picking them off", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Utah enters Saturday's game at USC with 13 interceptions on the season, tied for second-best in the nation, and the team's most since finishing 2011 with 19.\nUpcoming Games Utah Football Utah Utah @ USC Los Angeles Memorial Coliseum, Los Angeles Oct. 24, 5:30 p.m. 1 Day 20 Hrs 24 Mins 48 Secs More Coverage Utah football notes: Hatfield making an impact Utah vs. USC in six numbers Ute Los Angelenos say they wanted to get away Enemy camp: 5 questions with a USC beat writer “ We do a lot of film study to make sure that we’re all together and make sure we know where the ball is going to be and put ourselves in better positions, I guess you could say, to catch the ball.”\nUtah safety Marcus Williams\nSALT LAKE CITY — Utah’s defense is picking off passes with great regularity. The third-ranked Utes enter Saturday’s game at USC with 13 interceptions in six games. Only one team in the nation (Arkansas State) has more at this point in the season.\n“It doesn’t really surprise me. We do this stuff in practice. So when we come to the game it’s just like practice,” said sophomore safety Marcus Williams, who leads the Pac-12 with four interceptions. “Practice is how you get better and once you do it in practice it shows up in the game.”\nWilliams added that interceptions are rare and that when they come to you, you’ve got to make plays.\n“We do a lot of film study to make sure that we’re all together and make sure we know where the ball is going to be and put ourselves in better positions, I guess you could say, to catch the ball,” he said.\nJust two seasons ago, Utah finished the year with only three interceptions. The Utes had 12 in 2014, a figure that was surpassed in last week’s 34-18 win over Arizona State.\n“I hope it doesn’t stop. Let me say that,” said cornerbacks coach Sharrieff Shah. “I think it’s a product of a few things — a lot of hard work in the offseason, a lot of continuous work in-season. Every single drill that we can do with our boys involves a ball.”\nHowever, he noted that’s nothing new.\n“It’s not like we didn’t do it last year. But for some reason, you know, sometimes it bounces your way and when it bounced our way this year we’re catching them,” Shah explained. “You know, we had missed opportunities which was the story maybe a year ago. We certainly had opportunities to pick the ball but we didn’t catch it. We didn’t come down with it. This year, we’re coming down with it.”\nShah noted that a concerted effort is being made after practice to just do the small things and keep catching the ball. He reminds the guys about dropping easy balls, noting that it's not always the hard ones that are caught.\n“It’s capitalizing and making the boys recognize that every single interception, or possible interception, is a reality and it happens just like that in a game,” Shah said.\nSuccess begets success, Shah continued, and confidence generates confidence. As such, he wants the defense to have its memory banks filled with interceptions and a belief that plays can be made rather than any sort of hesitancy. It allows for more calculated risks and an increased number of interceptions.\n“I think it’s a product of coaches preaching it, practicing it and players buying into it,” said Utah coach Kyle Whittingham.\nEven so, Whittingham acknowledged that getting interceptions is emphasized every year. The odd thing, he noted, is there’s an abundance some years and a dearth in others. Takeaways, in general, are kind of an elusive stat.\n“You don’t always have complete control of it on the defensive side,” Whittingham said.\nSince joining the Pac-12 in 2011, Utah has finished with a positive turnover margin in three of four seasons. This year, the Utes are tied for second in the nation (at plus-2.0 per game) with 19 takeaways and seven turnovers. The latter reflects the premium Whittingham places on the offense taking care of the ball — something he believes is easier to control than getting interceptions and fumble recoveries.\nWhittingham, though, credits defensive coordinator John Pease and the staff for the increased emphasis on getting takeaways. There are other factors as well for the increase.", "external_links": ["http://deseretnews.sportsdirectinc.com/football/ncaaf-teams.aspx?page=/data/ncaaf/teams/team93.html", "http://deseretnews.sportsdirectinc.com/football/ncaaf-teams.aspx?page=/data/ncaaf/teams/team71.html"], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-23T06:06:31.196+03:00", "highlightTitle": ""}