{"organizations": [], "uuid": "56d72945f0bde36dc9650b1abc315c31d64c9c71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/motorsports", "section_title": "NASCAR / Motors News, Race Results, Schedule, Standings, Photos, Videos - MSN Sports", "url": "http://www.msn.com/en-us/sports/motorsports/elliott-sadler-leaving-roush-fenway-joining-jr-motorsports-in-16/ar-AAf2lWq", "country": "US", "title": "Elliott Sadler leaving Roush Fenway, joining JR Motorsports in '16", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "Elliott Sadler leaving Roush Fenway, joining JR Motorsports in '16", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "56d72945f0bde36dc9650b1abc315c31d64c9c71"}, "author": "Jay Pennell", "url": "http://www.msn.com/en-us/sports/motorsports/elliott-sadler-leaving-roush-fenway-joining-jr-motorsports-in-16/ar-AAf2lWq", "ord_in_thread": 0, "title": "Elliott Sadler leaving Roush Fenway, joining JR Motorsports in '16", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Elliott Sadler leaving Roush Fenway, joining JR Motorsports in '16 FOXSports 12 hrs ago Jay Pennell © NASCAR via Getty Images SPARTA, KY - SEPTEMBER 26: Elliott Sadler , the driver of the #1 OneMain Financial Ford, waits to qualify for the the NASCAR Xfinity Series VisitMyrtleBeach.com 300 at Kentucky Speedway on September 26, 2015 in Sparta, Kentucky. (Photo by Andy Lyons/Getty Images)\nJR Motorsports announced Friday that veteran driver Elliott Sadler and OneMain Financial will join the organization to compete for the NASCAR XFINITY Series championship in 2016. While a press conference was scheduled for Friday morning, Sadler and team co-owner Dale Earnhardt Jr. broke the news via Periscope prior to the official announcement.\nAdChoices \"We are very pleased to welcome OneMain Financial and Elliott into the JR Motorsports family,\" said Kelley Earnhardt Miller, co-owner and general manager of JRM. \"Elliott has raced a few times for us in the past, and now together with OneMain Financial, we're thrilled to put together a championship-caliber team for him in 2016. Off-track, JRM is looking forward to developing a mutually beneficial partnership with OneMain Financial and one that will help further their brand.\"\nThe 40-year-old veteran has made at least one XFINITY Series start in 18 seasons, recording 10 wins, 66 top fives, 144 top 10s and 16 poles. Sadler finished second in the championship standings in 2011 and 2012, and currently sits sixth in the points headed into this weekend's race at Dover International Speedway. Sadler has spent this season with Roush Fenway Racing.\n\"It's an honor to be in the position to represent JR Motorsports and OneMain Financial on and off the track next season,\" Sadler said. \"I've known Kelley and Dale Jr. a long time, and I respect their passion and desire to win in this business. I'm proud to partner with OneMain Financial and continue our longstanding relationship.\"\nThis marks the fifth team Sadler has joined since the 2011 season, when he competed for Kevin Harvick Inc. His journey has taken him from KHI to Richard Childress Racing (2012), Joe Gibbs Racing (2013-2014), Roush Fenway and now JRM.\nSadler will continue with OneMain Financial over at JRM, marking six years of the partnership between the driver and sponsor. As part of the deal, each of the JRM cars will have OneMain Financial as an associate sponsor in 2016.\n\"We are delighted to continue our commitment to racing as one of the longest running primary sponsors in the NASCAR XFINITY Series,\" said Mary McDowell, OneMain Financial's CEO. \"To say we are excited about partnering with JR Motorsports in 2016 is an understatement. Not only will Elliott Sadler continue to represent our brand while driving for us again, but JRM has a number of unique platforms and assets which will prove valuable to our employees, customers and brand.\"\nSadler's car number and crew chief for 2016 have yet to be determined and will be announced at a later date.\nGo to MSN Home", "external_links": ["http://www.foxsports.com/", "http://go.microsoft.com/fwlink/?LinkID=286759"], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-03T04:47:18.451+03:00", "highlightTitle": ""}