{"organizations": [], "uuid": "00f3ef295dc2150b2b474bf746bf6844d8aa6413", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com/asset/1200_630/562e51a21400001b013c91ce.jpeg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/sports/index.xml", "section_title": "Sports - The Huffington Post", "url": "http://www.huffingtonpost.com/entry/osu-crowd-driver-charged-murder_562e510fe4b0443bb5649c4a", "country": "US", "title": "Woman Who Allegedly Drove Into OSU Crowd Charged With Murder", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Woman Who Allegedly Drove Into OSU Crowd Charged With Murder", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T18:17:00.000+02:00", "replies_count": 0, "uuid": "00f3ef295dc2150b2b474bf746bf6844d8aa6413"}, "author": "Hilary Hanson", "url": "http://www.huffingtonpost.com/entry/osu-crowd-driver-charged-murder_562e510fe4b0443bb5649c4a", "ord_in_thread": 0, "title": "Woman Who Allegedly Drove Into OSU Crowd Charged With Murder", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Woman Who Allegedly Drove Into OSU Crowd Charged With Murder She's suspected of driving while intoxicated. By Lenzy Krehbiel-Burton Posted: 10/26/2015 12:17 PM EDT | Edited: 42 minutes ago \nSTILLWATER, Okla., Oct 26 (Reuters) - A woman suspected of plowing her car into a crowd at a homecoming rally for Oklahoma State University, killing four and injuring dozens, is set to make her first court appearance on Monday to answer to four counts of second-degree murder. \nAdacia Avery Chambers, 25, is suspected of driving while intoxicated when she rammed her gray Hyundai Elantra into a crowd watching Saturday's parade in Stillwater, killing three adults and a toddler, police said. ASSOCIATED PRESS \nChambers was expected to make an initial appearance in Payne County District Court on Monday afternoon, police said. \nFour dozen people were also injured, five of them critically, in the incident that sent shockwaves through the college town about 70 miles west of Tulsa. The incident was captured on mobile-phone video and seen globally. \nSecond-degree murder charges can bring between 10 years and life in prison. Police were awaiting results of a blood test administered to Chambers after the crash. \nHer lawyer, Tony Coleman, told reporters on Sunday he believes his client is mentally ill and that he doubted she was drunk at the time of the crash. \n\"In my opinion, Ms. Chambers suffers from a mental illness,\" Coleman was quoted as saying by the Tulsa World newspaper. \"Exactly what type is yet to be determined.\" \nA man who was watching the parade with his family said the crash sounded like a bomb had gone off, transforming the festive school rally into a blood-soaked crime scene. \nKilled on the scene were Bonnie Stone and Marvin Stone, both 65 and of Stillwater, as well as Nikita Nakal, 23, of Mumbai, India. Two-year-old Nash Lucas, of Weatherford, Oklahoma, died later at a hospital, police said. (Reporting by Lenzy Krehbiel-Burton; Writing by Jon Herskovitz; Editing by Mohammad Zargham)", "external_links": [], "published": "2015-10-26T18:17:00.000+02:00", "crawled": "2015-10-26T19:02:06.723+02:00", "highlightTitle": ""}