{"organizations": [], "uuid": "8eed9f1cca853c12ae0eaa2aac50f9399c4a7c87", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mysanantonio.com", "main_image": "http://ww2.hdnux.com/photos/03/10/41/821365/3/rawImage.jpg", "site_section": "http://www.mysanantonio.com/rss/feed/mySA-Sports-921.php", "section_title": "mySA Sports", "url": "http://www.mysanantonio.com/sports/outdoors/article/Outdoors-Calendar-Oct-16-xx-6571567.php", "country": "US", "title": "Outdoors: Calendar, Oct. 16-Jan. 17", "performance_score": 0, "site": "mysanantonio.com", "participants_count": 1, "title_full": "Outdoors: Calendar, Oct. 16-Jan. 17 - San Antonio Express-News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T15:30:00.000+03:00", "replies_count": 0, "uuid": "8eed9f1cca853c12ae0eaa2aac50f9399c4a7c87"}, "author": "John Goodspeed", "url": "http://www.mysanantonio.com/sports/outdoors/article/Outdoors-Calendar-Oct-16-xx-6571567.php", "ord_in_thread": 0, "title": "Outdoors: Calendar, Oct. 16-Jan. 17", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: DirectToArchive Image 1 of / 1 Caption\nClose\nImage 1 of 1 Honey Creek which is part of the Honey Creek State Natural Area. The area is part of Guadalupe River State Park. Though most families come to the state park for the river, it also has 5.3 miles of hiking trails. Honey Creek State Natural Area is only open to the public by guided hike. Photo credit: Tara Dooley Honey Creek which is part of the Honey Creek State Natural Area. The area is part of Guadalupe River State Park. Though most families come to the state park for the river, it also has 5.3 miles of hiking ... more Photo: DirectToArchive Outdoors: Calendar, Oct. 16-Jan. 17 1 / 1 Back to Gallery\nFriday\nTexas Wildlife Association : Webinar on chronic wasting disease, noon-1 p.m., texas-wildlife.webex.com. TWA and Texas A&M AgriLife Extention discussion for hunters about the disease, its history, symptoms, transmission and how hunters can participate in monitoring efforts. Free. Session will be archived at texas-wildlife.org.\nGuadalupe River State Park: Nature Explorers: Insect-i-gations, an exploration of the world of insects, part of a monthly series for homeschoolers ages 5-10. 9-11 a.m., Discovery Center . RSVP at craig.hensley@tpwd.texas.gov . Free. Entrance fees apply. Call 830-438-7653.\nSaturday\nGovernment Canyon State Natural Area: 10th anniversary celebration 9 a.m.-2 p.m. includes guided hikes, children’s activities, displays about the past, present and future and booths from supporters. 12861 Galm Road. Free, but entrance fees - half off Friday and Saturday - apply. Call 210-688-9055 or click on friendsofgc.org.\nFriends of Government Canyon SNA : Explore the Canyon, a hike guided by authorities on flora, fauna, geology and cultural history of the state natural area, 12861 Galm Road, 8:30 a.m.-noon. Meet at Visitors Center. Entrance fee. RSVP not required. Call 210-688-9055, Ext. 289, or click on friendsofgc.org.\nMitchell Lake Audubon Center : 11th annual Hoot & Harvest Festival, with hayrides, pumpkin decorating, butterfly walks, native plant sale and food trucks, 9 a.m.-4 p.m. Raptor show at 1 p.m. 10750 Pleasanton Road. Free, but $2 suggested donation for parking. Call 210-628-1639 or click on mitchelllake.audubon.org.\nGuadalupe River State Park: Fish-O-Rama, a beginners session for children on knot tying, identifying fish and casting, 10 a.m.-2 p.m.. Gear available to borrow. Free. Entrance fees apply. Call 830-438-7653.\nGuadalupe River State Park: Bats of Texas, with search for bats following presentation, 7:30-9 p.m., amphitheater. Free. Entrance fees apply. Call 830-438-7653.\nAlamo Area Moderators: Monthly match of the cowboy action shooting club, 8 a.m., Lone Star Weapons and Tactics Range, 5419 FM 1343, Devine. 210-493-9320 or alamoareamoderators.com.\nTejas Caballeros: Monthly match of the cowboy action shooting club, 8 a.m., on a private range near Driftwood. 512-894-0897 or tejascaballeros.org.\nTuesday-Wednesday\nPadre Island National Seashore: Visitors can help artist-in-residence Tyler Hudock create a mural 9 a.m.-5 p.m. at the picnic area in the parking lot by the Malaquite Visitor Center . Click on nps.gov/pais or call 361-949-8068.\nTuesday\nAlamo Fly Fishers: Monthly meeting, 7 p.m. at Alamo Heights Presbyterian Church , 6201 Broadway. Nonmembers welcome. Call Rob Burlingame 210-507-1123.\nWednesday\nSan Antonio Metropolitan League of Bass Clubs: Monthly meeting, 7:30 p.m., VFW Hall, 202 W. Aviation Blvd., Universal City. Click on sa-metrobass.org.\nOct. 24\nGuadalupe River State Park: Bird Walk and Talk Along the River, with park host interpreter Laura Paulson , 8:30-11 a.m. For ages 10 and older. Binoculars available. Meet at Discovery Center. Free. Entrance fees apply. Call 830-438-7653.\nGuadalupe River State Park: Stories in the Stars with presentation and viewing through telescopes hosted by the San Antonio Astronomical Association , 7:30-9:30 p.m. Meet at the amphitheater. Free. Entrance fees apply. Call 830-438-7653.\nPalmetto State Park: Fishing with a Ranger, a program for beginners outlining the basics, 10-11 a.m. Some loaner poles and tackle available. Bring your own bait. Free with park admission. Call 830-672-3266 or click on tpwd.texas.gov.\nGarner State Park: Autumn Celebration welcoming cooler weather and Halloween with pumpkin carving (bring your own), carnival games, spooky tales and campfire treats, 6-8:30 p.m., CCC Pavilion. Free. Admission fees apply. Call 830-232-6132, Ext. 236.\nGuadalupe River Chapter of Trout Unlimited: Meeting, 9 a.m., Canyon Lake Community Resource and Recreation Center, Sattler. Presentation at 11 by Spencer Seim on fly fishing in New Mexico. Call Scott Thompson , 830-931-3900, or visit grtu.org.\nOct. 25\nGuadalupe River State Park: 11th annual Halloween at the Park for families with children ages 2-12, 6-8:30 p.m. Storytelling, lighted trail walk, decorations, hot dogs and drinks. $10 per vehicle in addition to entrance fees. Call 830-438-7653.\nOct. 27\nTexas Outdoors Woman Network of San Antonio: Monthly meeting with a special presentation, 6 p.m., Lion & Rose, 842 N.W. Loop 410. Nonmembers welcome. For more information, click on townsa.org.\nNew Braunfels Fly Fishers: Monthly meeting with guest speaker, 7 p.m., McKenna Event Center , 801 W. San Antonio St., New Braunfels. Nonmembers welcome. Call Jay Rogers , 830-837-3022. or click on newbraunfelsflyfishers.org.\nOct. 31\nGuadalupe River State Park: Fishing 101, basics for children and beginners including fishing for sunfish, bass and catfish, 9-11 a.m. Bait and loaner rods and reels available. Free. Entrance fees apply. RSVP at craig.hensley@tpwd.texas.gov .\nGuadalupe River State Park: Halloween Night Hike, 7:30-9 p.m. Costumes encouraged for walk in search of owls, bats and more. Meet at amphitheater. Free. Entrance fees apply. RSVP at craig.hensley@tpwd.texas.gov\nNov. 1\nTexas Freshwater Fishing Hall of Fame : Deadline for nominations of individuals or organizations that have made a lasting contribution to freshwater fishing in Texas. Click on tpwd.texas.gov and search for the hall of fame.\nNov. 6\nBandera County Convention and Visitors Bureau : 53rd annual Hunters Bar-B-Que & MusicFest, 3:30-10:30 p.m., Cattleman’s Barn at Antler Oaks Lodge. Outdoor gear vendors, auction, gun raffle. Almost Patsy Cline Band, 3:30 p.m.; Chris Saucedo , 8 p.m. $25, includes barbecue plate. Special music and events at area dance halls. Click on banderahuntersbbq.com.\nUvalde Chamber of Commerce : 34th annual Hunters’ Roundup, 5 p.m.-midnight, Uvalde County Fairplex. Music, vendor booths, exhibits, food, gun raffle. Click on uvalde.org or call 830-278-3361.\nLlano Chamber of Commerce : Hunter Appreciation Day, 9 a.m.-3 p.m., 100 Train Station Drive, Llano. Free goody bags, food, drinks, vendor and hunting guide booths, firearm raffle. Click on llanochamber.org or call 325-247-5354.\nNov. 10-11\nTexas Parks & Wildlife Department : Fall and nightscape photography workshop, 3 p.m. Nov. 10 to 8 a.m. Nov. 11, Enchanted Rock State Natural Area. Includes shooting without a flash, light painting and star and campfire photography. $250. Click on txoutdoorphotoworkshops.com.\nNov. 11\nPadre Island National Seashore : No entrance fee weekend, to commemorate Veterans Day. Call 361-949-8068 or click on nps.gov .\nNov. 14-15\nTexas Firearms Festival : Nearly 50 exhibitors and 20 bays where visitors can try out firearms from dozens of manufacturers with ammo included; retail sales for firearms and accessories, 10 a.m-5 p.m. both days. Best of the West Shooting Range in Liberty Hill, northwest of Austin. $60 one day, $25 non-shooters; $275 VIP. Click on texasgunfest.com.\nTexas Outdoor Family : Hands-on basics of camping for those with little or no experience with tent, gear provided, Pedernales State Park. $65 for family of up to six. Call 512-389-8903 or email tofsp@tpwd.texas.gov .\nNov. 14\nPalmetto State Park : Fishing with a Ranger, a program for beginners outlining the basics, 10-11 a.m. Some loaner poles and tackle available. Bring your own bait. Free with park admission. Call 830-672-3266 or click on tpwd.texas.gov.\nDec. 5-6\nTexas Parks & Wildlife Department : Adventure sports photography workshop, 8 a.m.-5 p.m., McKinney Falls State Park. Includes composition and exposure and photography of kayaking, swimming, fishing, hiking and biking. $250. Click on txoutdoorphotoworkshops.com.\nDec. 12\nPalmetto State Park : Fishing with a Ranger, a program for beginners outlining the basics, 10-11 a.m. Some loaner poles and tackle available. Bring your own bait. Free with park admission. Call 830-672-3266 or click on tpwd.texas.gov.\nJan. 15-17\nHouston Safari Club : Annual Worldwide Hunting Expo, Waterway Marriott Hotel & Convention Center. Speakers, seminars, outfitters and gear. Click on houstonsafariclub.org.\nHave an item for the Outdoor Calendar? Email John Goodspeed at john@johngoodspeed.com", "external_links": ["http://www.nps.gov/", "http://ww2.hdnux.com/photos/03/10/41/821365/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/03/10/41/821365/3/920x920.jpg"], "published": "2015-10-15T15:30:00.000+03:00", "crawled": "2015-10-15T17:20:58.783+03:00", "highlightTitle": ""}