{"organizations": [], "uuid": "3a279add3ceaa33197892fcaf92e91d00a985d42", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.waynepost.com", "main_image": "http://www.waynepost.com/storyimage/NU/20151017/SPORTS/151019660/AR/0/AR-151019660.jpg", "site_section": "http://www.waynepost.com/sports?template=rss&mime=xml", "section_title": "Sports - Wayne Post", "url": "http://www.waynepost.com/article/20151017/SPORTS/151019660/2000/NEWS?rssfeed=true", "country": "US", "title": "HS football: Red Jacket topples Clyde-Savannah", "performance_score": 0, "site": "waynepost.com", "participants_count": 1, "title_full": "HS football: Red Jacket topples Clyde-Savannah", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T03:46:00.000+03:00", "replies_count": 0, "uuid": "3a279add3ceaa33197892fcaf92e91d00a985d42"}, "author": "Dan Glickman Messenger Post Freelancer", "url": "http://www.waynepost.com/article/20151017/SPORTS/151019660/2000/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "HS football: Red Jacket topples Clyde-Savannah", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Oct. 17, 2015 at 7:46 PM Canandaigua, N.Y. MANCHESTER _ In a battle of undefeated rivals that also served as the “Service Bowl” fundraiser to honor troops and emergency workers, Red Jacket's football team took advantage of late scores to defeat the Clyde-Savannah Golden Eagles, 28-14, on Saturday afternoon. With the win, Red Jacket (7-0) completes its second straight perfect regular season and wins the Finger Lakes West regular season title heading into the Section V Class D playoffs. “It's a great feeling,” said Sean Sheets, the team's leading rusher, who ran for 288 yards on Saturday. \"We've still got a lot of work to do. We got a new season coming up, and we've got to keep it going.\" A cold and windy day from the start, Red Jacket never trailed but never led by more than one score until the final minutes as the Golden Eagles (6-1) continually answered. A touchdown sneak by Red Jacket quarterback Thomas Palmeri with 6:13 left in the first quarter and the ensuing 2-point conversion gave the Indians an 8-0 lead, but Clyde-Savannah closed to with a point when Bryan Garret caught a touchdown pass by Nate Paddock. A no-doubt and wide-open 39-yard pass from Palmeri to Kris Amos made it 14-7 for Red Jacket in the second quarter, but by halftime Clyde-Savannah's Derrick Chance scored on a run to tie the score 14-14. And there the score would remain as a defensive struggle emerged in the second half. Each side turned the ball over before Sheets put Red Jacket ahead for good with a TD run with just more than 6 minutes left in the game. Dan Colasurdo's 2-point run gave the Indians a 22-14 lead. Colasurdo capped Red Jacket's scoring with a TD run and Tyler Gardner's five tackles led the defense. Coach Josh Henninger was happy with the performance, especially given the opponent and how much they had prepared. “I thought we played well, I thought it was the best game we played all year, and it all came in step from the week of preparation we had,” he said, “We knew it was going to be a tough game for all four quarters of battle.” Up next for Red Jacket is the Class D Tournament and the pursuit of a third straight title. By Dan Glickman", "external_links": [], "published": "2015-10-18T03:46:00.000+03:00", "crawled": "2015-10-18T03:42:49.889+03:00", "highlightTitle": ""}