{"organizations": ["Phoenix Coyotes", "Vancouver Canucks", "Columbus Blue Jackets"], "uuid": "36479a81da24e501e1f57e213c272f9ccf7d7762", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cincinnati.com", "main_image": "http://www.gannett-cdn.com/-mm-/ca10c0e00d77f1e379dac86555fdbfe7ecf7cb42/c=0-188-2419-1555&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/21/USATODAY/USATODAY/635810226366482145-USP-NHL-Preseason-Phoenix-Coyotes-at-Vancouver-Ca.jpg", "site_section": "http://www.cincinnati.com/sports/", "section_title": "Cincinnati Sports", "url": "http://www.cincinnati.com/story/sports/nhl/jackets/2015/10/21/john-tortorella-good-fit-columbus-blue-jackets/74325162/", "country": "US", "title": "Why John Tortorella is a good fit to fix Columbus Blue Jackets problems", "performance_score": 0, "site": "cincinnati.com", "participants_count": 0, "title_full": "Why John Tortorella is a good fit to fix Columbus Blue Jackets problems", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T19:14:00.000+03:00", "replies_count": 0, "uuid": "36479a81da24e501e1f57e213c272f9ccf7d7762"}, "author": "", "url": "http://www.cincinnati.com/story/sports/nhl/jackets/2015/10/21/john-tortorella-good-fit-columbus-blue-jackets/74325162/", "ord_in_thread": 0, "title": "Why John Tortorella is a good fit to fix Columbus Blue Jackets problems", "locations": ["USA"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["John Tortorella", "Anne-Marie Sorvin", "John Tortorell"], "text": "John Tortorell coaches the Vancouver Canucks during a game against the Phoenix Coyotes in 2013. (Photo: Anne-Marie Sorvin, USA TODAY Spor)\n10 CONNECT 35 TWEET LINKEDIN 1 COMMENT EMAIL MORE Todd Richards is out and John Tortorella is in as the new coach of the Columbus Blue Jackets.\nTortorella has previously been a head coach in Tampa Bay, and with the New York Rangers and Vancouver Canucks. He won a Stanley Cup in Tampa Bay, and he’s known as a high energy, tough-love leader. His job is to turn around a talented team that has lost its first seven games of the season.\nThe Blue Jackets are known as a talented team with unfulfilled promise. Here’s what you know about Tortorella’s move to Columbus:\nWhy this is a good fit for this team : The Blue Jackets have ability, but they haven’t yet figured out how to translate talent into wins. The Blue Jackets need to embrace the identity of a winner, and we’ve seen Tortorella do that in Tampa Bay and with the New York Rangers. The Blue Jackets are struggling defensively, and he knows how to fix that. The Blue Jackets boast some team toughness, and Tortorella will make that work to their advantage.\nHow this could blow up : If Tortorella hasn’t learned from his past coaching stops, this move will only have short-term benefit. Tortorella is hard on players and his gruffness wears on people over time. Most of us have had a boss that can be challenging to endure. In the past, Tortorella has been that boss that everyone talks about as being over the top. But he is a very smart man, and you have to believe that he knows he needs to add another layer of humanity to his coaching style.\nWhat will Tortorella do first : Demand that the Blue Jackets be relentless when they don’t have the puck. He insists on a commitment to shot-blocking and gritty checking. The Rangers still benefit from his time in New York. He helped transform Dan Girardi, Ryan McDonagh and Marc Staal into more aggressive defenders.\nIs it already too late for the Blue Jackets? : They have dug themselves a deep hole with seven consecutive losses, but they have 75 games remaining to state their case to make the playoffs. They can’t afford any lengthy adjustment period to Tortorella’s system. At some point, they need to put together a lengthy winning streak to offset this poor start. They have the offensive might to do this.\nThis isn’t Todd Richards’ fault : He is being fired because that is the easiest solution. He bears some responsibility because he couldn’t figure out how to stop the defensive bleeding. But no one believes he did a poor job. Don’t forget that he was behind the bench when the team went 12-0-1 to close last season. The players didn’t perform well this season. Goalie Sergei Bobrovsky wasn't sharp. When you an evaluating a coaching performance, the first question you should ask is: How well is his goalie playing? It seemed as if the losing streak climbed into the Blue Jackets’ heads. The more they lost, the worse they played.\n10 CONNECT 35 TWEET LINKEDIN 1 COMMENT EMAIL MORE Read //usat.ly/1LLv1Aw", "external_links": ["http://www.gannett-cdn.com/-mm-/cd1b995efecc433371bdf3e78f929e46449c7c11/c=0-121-2419-1940&r=x404&c=534x401/local/-/media/2015/10/21/USATODAY/USATODAY/635810226366482145-USP-NHL-Preseason-Phoenix-Coyotes-at-Vancouver-Ca.jpg", "http://www.gannett-cdn.com/-mm-/50117b4bfe181f32492ec4d414638d7c08e560e6/r=500x400/local/-/media/2015/10/21/USATODAY/USATODAY/635810226366482145-USP-NHL-Preseason-Phoenix-Coyotes-at-Vancouver-Ca.jpg", "https://twitter.com/intent/tweet?url=http%3A//usat.ly/1LLv1Aw&text=Why%20John%20Tortorella%20is%20a%20good%20fit%20to%20fix%20Columbus%20Blue%20Jackets%20problems&via=enquirer", "http://www.linkedin.com/shareArticle?url=http%3A//usat.ly/1LLv1Aw&mini=true", "http://usat.ly/1LLv1Aw", "http://www.gannett-cdn.com/media/2015/10/21/USATODAY/USATODAY/635810226366482145-USP-NHL-Preseason-Phoenix-Coyotes-at-Vancouver-Ca.jpg"], "published": "2015-10-21T19:14:00.000+03:00", "crawled": "2015-10-21T22:43:19.478+03:00", "highlightTitle": ""}