{"organizations": [], "uuid": "38f4cf59ba58d0d753c1ee7ce8b3d8a2dfb7735d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/ncaabk", "section_title": "NCAA BK News, Scores, Schedule, Standings, Stats, Photos, Videos - Basketball - MSN Sports", "url": "http://www.msn.com/en-us/sports/ncaabk/kentucky-and-duke-set-for-1st-meeting-since-2012/ar-AAf8YnQ", "country": "US", "title": "Kentucky and Duke set for 1st meeting since 2012", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "Kentucky and Duke set for 1st meeting since 2012", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "38f4cf59ba58d0d753c1ee7ce8b3d8a2dfb7735d"}, "author": "Tyler Weeks", "url": "http://www.msn.com/en-us/sports/ncaabk/kentucky-and-duke-set-for-1st-meeting-since-2012/ar-AAf8YnQ", "ord_in_thread": 0, "title": "Kentucky and Duke set for 1st meeting since 2012", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kentucky and Duke set for 1st meeting since 2012 isportsweb.com 1 day ago Tyler Weeks © Andrew D. Bernstein / Getty Images Mike Krzyzewski and John Calipari will see their Blue Devil and Wildcat squads meet for the 1st time since 2012. On Nov. 17, a matchup will take place between two of the top programs in college basketball. Two foes will finally face each other for the first time since November 13th, 2012. The clash of the titans will finally take place. The reigning champs will defend their throne against their most formidable opponent. Kentucky will face Duke.\nAdChoices Every college basketball fan knows the resume of these programs and their coaches. They may not know the players of in this year’s upcoming game yet, but they will be introduced to the new exciting faces. They include Skal Labissierre, Isaiah Briscoe, Brandon Ingram, and Chase Jeter. Hall of Fame coaches John Calipari and Mike Krzyzewski will prepare these players and their respective teams for a showdown that will excite every college basketball fan in the nation. The excitement stems from the history and achievements these two programs have been building over recent years.\nBetween the two programs, there have been countless All-Americans and first-round NBA draft picks since their last matchup. That November 2012 game was lost by Kentucky, so former Wildcats will watch in hope that this year’s team will avenge them. Both teams have hung a championship banner since the last time they played. Most of the top high school prospects have been recruited by both schools and have wrestled with choosing one or the other, sometimes neither. That is why this matchup is so important. These two prestigious teams are standing in each other’s way on the quest to the top of the mountain.\nThe fans wish they could have seen Jahlil Okafor vs Karl- Anthony Towns, Julius Randle vs Jabari Parker, or Brandon Knight vs Kyrie Irving while they suited up for either side wearing blue and white. Instead, they will settle for this year’s game. The fans can’t wait.\nGo to MSN Home", "external_links": ["http://go.microsoft.com/fwlink/?LinkID=286759"], "published": "2015-10-06T03:00:00.000+03:00", "crawled": "2015-10-07T21:39:17.809+03:00", "highlightTitle": ""}