{"organizations": [], "uuid": "d976d4de6b6a95b3f4add501451c8bfe6c610c85", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jpost.com", "main_image": "http://www.jpost.com/HttpHandlers/ShowImage.ashx?ID=295600", "site_section": "http://www.jpost.com/Israel-News/Sports", "section_title": "Israel Sports | The Jerusalem Post ", "url": "http://www.jpost.com/Blogs/Double-vision/Double-Vision-the-Jerusalem-I-Love-426235", "country": "IL", "title": "Double Vision: the Jerusalem I Love - Blogs", "performance_score": 0, "site": "jpost.com", "participants_count": 1, "title_full": "Double Vision: the Jerusalem I Love - Blogs - Jerusalem Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T03:59:00.000+03:00", "replies_count": 0, "uuid": "d976d4de6b6a95b3f4add501451c8bfe6c610c85"}, "author": "DINAH JACOBS", "url": "http://www.jpost.com/Blogs/Double-vision/Double-Vision-the-Jerusalem-I-Love-426235", "ord_in_thread": 0, "title": "Double Vision: the Jerusalem I Love - Blogs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Just a few weeks ago, I sat in my friends' Sukkah in Jerusalem's Abu Tor neighborhood where Jews and Arabs live in close proximity. Now, walking alone as I did that night, I would not venture there.\nIt's hard to grasp that so much has changed in a short time in the city I live in and love so dearly.\nBefore the outbreak of horrific attacks on Jews throughout Israel, much of it centered in Jerusalem, I walked the city at all hours, except in areas known to be dangerous. Walking home alone from a late Shabbat dinner on a Friday night, I felt as safe as I did as a kid in America decades ago. I accepted invitations to go anywhere, anytime without a thought about logistics. I enthusiastically participated in the plethora of events -- intellectual, cultural artistic -- that are part of the bounty of life in Jerusalem, never wondering if it would be safe.\nAfter 18 years of continually visiting Israel, I bought a home here last summer and early this year made Aliyah -- a dream come true. As an olah hadasha, I delight in the sense of community I have found in my newly adopted city.\nDuring these weeks of terror, it is this strength of our community which allows me to face the stress, anxiety and uncertainty that has become our daily bread.\nNow life is a web of contradictions.\nFor example, stop checking the news obsessively we are counseled -- but stay well informed.\nDon't go to places A and B -- but live normally.\nEquip yourself to fight off a stabbing attack -- but remember that any weapon can and might be used against you.\nWhen I follow international news or Facebook posts of family and friends living outside of Israel, life is beyond contradictory. It's a double vision of reality.\nUSA cable TV channels are fixated on the 2016 Presidential elections more than a year away. Israeli media tell us if we can reach home for dinner tonight, if the highway from Tel Aviv to Jerusalem is open after a security closure.\nFriends in the US brag about the teamwork of their baseball playoff favorites. We see life-saving teamwork executed by Israeli Rescue Squads at the scene of a terror attack.\nOn USA campuses, football season has begun and collegians obsess about winning. In Israel we ask, can the schools even be open with necessary, far greater security?\nThe world outside of Israel seems more distant than ever. Hillary's emails, sports teams' wins and losses. As Rhett Butler told us in Gone With the Wind, \"Frankly, my dear, I don't give a damn.\"\nIsrael demands my full attention on a real time basis. My \"need to know,\" my desire to know, is totally Israeli, even at times self-centered as I cope with everyday realities.\nJerusalem today is tense and struggling to be joyful.\nYet this, too, is the Jerusalem I love. Our sense of community is as strong as it was last summer during the declared war, Operation Protective Edge. I live in the eternal Capital of our Homeland, a privilege my grandparents in America could only dream about. Here, in both good times and challenging times, I truly am home.\nShare on Facebook Twitter Google Plus", "external_links": [], "published": "2015-10-18T03:59:00.000+03:00", "crawled": "2015-10-18T07:46:49.768+03:00", "highlightTitle": ""}