{"organizations": [], "uuid": "5be9474bcc2b6a3a88d697495f9ee3cfccb25cf9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-561c8eb1/turbine/ct-democratic-debate-dawn-turner-20151012", "site_section": "http://www.chicagotribune.com/", "section_title": "Chicago Tribune: Chicago breaking news, sports, business, entertainment, weather and traffic - Chicago Tribune", "url": "http://www.chicagotribune.com/news/ct-democratic-debate-dawn-turner-20151012-story.html", "country": "US", "title": "Quizzing the Democratic presidential candidates - Chicago Tribune", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Quizzing the Democratic presidential candidates - Chicago Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T13:02:00.000+03:00", "replies_count": 0, "uuid": "5be9474bcc2b6a3a88d697495f9ee3cfccb25cf9"}, "author": "Dawn M. Turner", "url": "http://www.chicagotribune.com/news/ct-democratic-debate-dawn-turner-20151012-story.html", "ord_in_thread": 0, "title": "Quizzing the Democratic presidential candidates - Chicago Tribune", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "On Tuesday evening, millions of us will tune in to the Democratic presidential debate on CNN. We know in advance that candidate Hillary Clinton will be quizzed on her use of a private email server while she was secretary of state, Bernie Sanders will talk about income inequality, and Martin O’Malley, Jim Webb and Lincoln Chafee will just try to jockey for position.\nBut most of all, I’m hoping that the time we’ll spend together will be more fruitful than what we got from the last debate with the Republican candidates. Three hours of back and forth that yielded little more than a tutorial on how to pit the candidates against front-runner Donald Trump.\nI asked three Chicagoans what they would ask the Democratic candidates if they were facing them in Las Vegas. Here’s what they had to say:\nMarshaun Bacon is the senior curriculum specialist at Youth Guidance’s Becoming A Man, or B.A.M., a Chicago-based dropout and violence prevention program that focuses on character building. It has received funding from the My Brother’s Keeper initiative, launched by President Barack Obama in 2014 to support programs with proven (and I stress, proven) records of helping young men of color do well in school and get good jobs.\nOne of the things that’s great about this country is the ideology around supporting Americans who are willing to pull themselves up by their bootstraps. If bootstraps were standard-issue, that would be fine. But not everyone gets a pair.\nWhen we think about Obama’s journey to the presidency and the obstacles he’s overcome, I want to ask: “How do we create a society where everyone gets a fair chance? Particularly people in groups that have been marginalized and where there are few resources. What’s the plan to support young men who have the grit to say, ‘Despite what I’ve been through, I want to do something better and be someone better.’”\nGet ready for the first Democratic debate Rex W. Huppke For the first time this campaign season, the Democratic presidential primary candidates will come together for a nationally televised debate that will undoubtedly be filled with words and facial expressions and …\nHmmm? What? Oh, sorry.\nIn the wake of two GOP presidential primary...\nFor the first time this campaign season, the Democratic presidential primary candidates will come together for a nationally televised debate that will undoubtedly be filled with words and facial expressions and …\nHmmm? What? Oh, sorry.\nIn the wake of two GOP presidential primary...\n(Rex W. Huppke) People need help. When we talk about deservedness, it should be more about the content of a person’s character than their ZIP code.\nI would ask each candidate: “What is your specific plan for supporting the My Brother’s Keeper initiative, leveling the ‘playing field’ for young men of color who want to contribute positively to society despite a lack of resources?”\nMariame Kaba is the executive director of Project Nia, a grass-roots organization dedicated to ending youth incarceration.\nI know they’re not at the state level, where the criminal-legal stuff takes place. But from where they control the levers, I’m interested in knowing if they’re satisfied with the Sentencing Reform and Corrections Act as proposed by the Senate earlier this month.\nThe bill gives judges, among other things, more of a say in exempting nonviolent drug offenders from harsh mandatory minimum sentencing. Do they agree with what’s currently on the table? What would they suggest that’s different?\nVermont Senator Bernie Sanders (I-VT) Melina Mara / The Washington Post Sen. Bernie Sanders (I-Vt.) prepares to speak at Benedict College in Columbia, S.C., on Sept. 12. Sen. Bernie Sanders (I-Vt.) prepares to speak at Benedict College in Columbia, S.C., on Sept. 12. (Melina Mara / The Washington Post) Connected to that, what are they going to do about policing in this country, the ways in which some police officers act with impunity? How do they see the connection between policing and what’s happening with our prisons and jails? I’d love to hear them talk about the prison industrial complex as a whole in our society.\nAnd because these issues are connected to economics, I’m interested in what they have to say about making sure people have a living wage and job guarantees. I’m not talking about the minimum wage. I want to know the candidates’ thoughts on guaranteeing a basic income. If we can get to the economics, everything else will work itself out.\nRichard Longworth is a nonresident fellow at the Chicago Council on Global Affairs. Before that, he was a foreign correspondent for the Tribune and covered the collapse of communism in Moscow and in Eastern Europe. Beyond asking Clinton why Cubs player Kris Bryant isn’t hitting, he said his question would have to do with income inequality.\nAs a correspondent in Moscow, I witnessed the collapse of communism, and now I’m wondering if capitalism is collapsing. I would want to get to this question of income inequality because I think it is the issue of our time.\nInequality between the wealthiest Americans and average Americans gets worse every day. In recent years, the top 1 percent has captured no less than 95 percent of all growth in national income. At the same time, wages for average workers have stagnated or fallen. Communism collapsed because it failed to deliver the goods to most people. How long does the American economic system have before it suffers the same fate for the same reason?\nI would like to stress that this doesn’t downplay the very real racial crisis playing out in Chicago and other cities. But it’s really linked. (Harvard University professor of political economy) Benjamin Friedman has written that serious reform, racial and otherwise, takes place in a time of prosperity and rising incomes, because people who are themselves secure are more likely to be generous.\nThe civil rights movement, for instance, took place in the ’60s, before stagnation hit in the ’70s. You’d think that people who are oppressed themselves would seek solidarity with others who are oppressed. It doesn’t work that way. When everybody’s scrapping for a crumb from a shrinking pie, it pits black vs. white, white vs. black, and both of them against immigrants. Not pretty.\nWe have to wonder: Can the American system as it is now organized, provide a solution to this? Can it offer a level of economic decency to most people?\nI think these are fantastic questions that I’d like to see the Democrats and the Republicans answer. Let’s tune in Tuesday night and see what happens.\ndmturner@tribpub.com\nCopyright © 2015, Chicago Tribune Hillary Clinton Barack Obama Bernie Sanders Lincoln Chafee", "external_links": ["http://www.trbimg.com/img-561c272f/turbine/ct-democratic-debate-huppke-20151012", "http://www.trbimg.com/img-561cdc19/turbine/sns-debate-09766e5e-5982-11e5-9f54-1ea23f6e02f3-20151013", "http://www.trbimg.com/img-561c8eb1/turbine/ct-democratic-debate-dawn-turner-20151012"], "published": "2015-10-13T13:02:00.000+03:00", "crawled": "2015-10-13T14:04:10.292+03:00", "highlightTitle": ""}