{"organizations": [], "uuid": "08d36fa2b3e475741ab110287953d373cfe7440c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canindia.com", "main_image": "http://canindia.com/wp-content/uploads/2012/06/01/Avatar.jpg", "site_section": "http://canindia.com/category/sports/feed", "section_title": "CanIndia NEWS » Sports Archive » CanIndia NEWS", "url": "http://www.canindia.com/2015/10/khalin-tied-third-bhullar-joint-ninth-at-tpc-golf-meet/", "country": "US", "title": "Khalin tied third, Bhullar joint ninth at TPC golf meet", "performance_score": 0, "site": "canindia.com", "participants_count": 1, "title_full": "Khalin tied third, Bhullar joint ninth at TPC golf meet", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T14:16:00.000+03:00", "replies_count": 0, "uuid": "08d36fa2b3e475741ab110287953d373cfe7440c"}, "author": "NewsWire", "url": "http://www.canindia.com/2015/10/khalin-tied-third-bhullar-joint-ninth-at-tpc-golf-meet/", "ord_in_thread": 0, "title": "Khalin tied third, Bhullar joint ninth at TPC golf meet", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Added on October 8, 2015 NewsWire Khalin tied third, Bhullar joint ninth at TPC golf meet 0 0 0 0 0 Taipei, Oct 8 (IANS) Indian golfers Khalin Joshi and Gaganjeet Bhullar scored an impressive four-under 68 and 69 to take tied third and joint ninth positions, respectively, after the opening round of the $500,000 Yeangder Tournament Players Championship (TPC) here on Thursday. While Khalin got five birdies against a lone bogey, Bhullar had five birdies and dropped two shots at the par-72 Linkou International Golf and Country Club. Lin Wen-tang of Chinese Taipei produced a bogey-free five-under 67 to share the opening round lead with countryman Hung Chun-kang. Lin, a six-time winner on the Asian Tour, and unheralded Hung, who turned professional two years ago, held a slim one-shot lead at the Asian Tour event. Miguel Tabuena of the Philippines, who finished second last year, Shaun Norris of South Africa, Panuphol Pittayarat of Thailand and India’s Khalin tied for the third place alongside Chinese Taipei duo Hung Chien-yao and veteran Lu Wen-teh. Defending champion Prom Meesawat of Thailand opened his campaign with a solid 70 to trail the leaders by three shots. Among other Indians in the fray, Angad Cheema was tied 32nd following a 71, while S. Chikka, Rashid Khan and Subhankar Sharma shared the 65th spot on one-over 73. Himmat Rai and Rahil Gangjee were tied 86th with identical 74s, while Chiragh Kumar, who scored 75, was the lowest-placed Indian at joint 108th. Kaupurthala-based Bhullar, who was struggling with his form and fitness due to a wrist injury for the past two seasons, refused to call it a start of good things to come after signing with an impressive 69. “I’m happy with the way I’m playing. I missed a lot of short putts but it is still early because it is only the first day. I had a good finish to the round with two birdies. I’ve been striking the ball really well in the past three weeks so I hope to continue,” the 27-year-old said in a release. “There was no wind in the morning and I don’t think it will pick up. Golf is a funny game. Not everybody plays in the same condition. The weather has been quite good this week,” the world No.825 added. “I worked hard during the off season but I won’t say that it has paid off yet because it is only Thursday. More consistent rounds until Sunday then I will be able to say yes, it is starting to pay off.”", "external_links": [], "published": "2015-10-08T14:16:00.000+03:00", "crawled": "2015-10-08T14:35:41.830+03:00", "highlightTitle": ""}