{"organizations": [], "uuid": "2978c082c356f8710188b784b8f9c3c793dc2ff5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.vaildaily.com", "main_image": "http://www.vaildaily.com/csp/mediapool/sites/dt.common.streams.StreamServer.cls?STREAMOID=k2RJasWEwk76yVkQvl19d8$daE2N3K4ZzOUsqbU5sYtSzQ7TKPuQsBj$$Zy5TSRpWCsjLu883Ygn4B49Lvm9bPe2QeMKQdVeZmXF$9l$4uCZ8QDXhaHEp3rvzXRJFdy0KqPHLoMevcTLo3h8xh70Y6N_U_CryOsw6FTOdKL_jpQ-&CONTENTTYPE=image/jpeg", "site_section": "http://www.vaildaily.com/csp/mediapool/sites/SwiftShared/assets/csp/rssCategoryFeed.csp?pub=VailDaily&sectionId=1005&sectionLabel=Sports", "section_title": "The VailDaily Section RSS Feed: Sports", "url": "http://www.vaildaily.com/news/sports/18750204-113/vonn-skips-world-cup-opener-after-10-week-injury", "country": "US", "title": "Vonn skips World Cup opener after 10-week injury layoff", "performance_score": 0, "site": "vaildaily.com", "participants_count": 1, "title_full": "Vonn skips World Cup opener after 10-week injury layoff", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T23:23:00.000+03:00", "replies_count": 0, "uuid": "2978c082c356f8710188b784b8f9c3c793dc2ff5"}, "author": "ERIC WILLEMSEN Associated Pr", "url": "http://www.vaildaily.com/news/sports/18750204-113/vonn-skips-world-cup-opener-after-10-week-injury", "ord_in_thread": 0, "title": "Vonn skips World Cup opener after 10-week injury layoff", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Expand Photo AP | AP Lindsey Vonn, of the United States, left, and teammate Mikaela Shiffrin stand at the finish area at the Rettenbach glacier, ahead of Saturday's women's giant slalom Ski World Cup race in Soelden, Austria, Friday, Oct. 23, 2015. (AP Photo/Giovanni Auletta) « » Related Media SOELDEN, Austria — Lindsey Vonn will skip Saturday’s first race of the Alpine skiing season as she doesn’t feel confident about the icy conditions on the race hill, 10 weeks after fracturing an ankle bone. The four-time overall World Cup champion returned successfully to training on skis Thursday, but decided after another practice session Friday not to start in a giant slalom on the Rettenbach glacier on Saturday. “In the few runs I’ve had since returning to snow I have felt strong, confident and been skiing without pain,” she wrote on her Facebook page. “However, the icy conditions on the race hill coupled with the fact that it’s only been 10 weeks since I fractured my ankle makes me slightly hesitant.” The American said she planned to return to the World Cup in Aspen for a giant slalom on Nov. 28 before traveling to Lake Louise for speed races the following week. Vonn crashed during a training camp in New Zealand in August, suffering yet another setback after an impressive return from serious knee injuries last season. She set a record for most women’s World Cup wins and earned her seventh downhill season title. The American, who turned 31 Sunday, said her priority was to avoid any risks of hurting herself again. “If the snow conditions were different my decision would have been different as well,” she said. “But at this stage in my career I suppose it’s better to err on the side of caution.” The U.S. ski team Alpine director, Patrick Riml, said it was Vonn’s own decision not to start. “She has been talking with the coaching staff about this but today, she didn’t. She did make that call,” Riml told The Associated Press. “There was no need for us to sit down with her.” Riml called it “a smart decision” as “two days (of skiing) is not enough even if she’s doing well. In my opinion she could only lose on the race tomorrow. Important is now to get the feeling back, to get the timing back, to get a good training block in and then she’s is just going to be ready for Aspen.” Vonn said Thursday she felt “awesome” after resuming ski training free of pain, and that her left ankle showed no reaction and held up “a lot better than I expected, honestly.” Vonn finished third in the overall standings last season and is the highest ranked skier to start in the new campaign as Austria’s Anna Fenninger (injury) and Slovenia’s Tina Maze (year off) won’t compete. Chasing her fifth big crystal globe, the American could become the oldest female skier to win the overall title. The record is held by Swiss great Vreni Schneider, who was 30 when she last triumphed in 1995.", "external_links": [], "published": "2015-10-23T23:23:00.000+03:00", "crawled": "2015-10-24T00:14:40.310+03:00", "highlightTitle": ""}