{"organizations": [], "uuid": "a1a3316fe47cff4468f9e7b4d2a38ee66e6d3a16", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deccanchronicle.com", "main_image": "http://www.deccanchronicle.com/sites/default/files/Anurag-Thakur_AFP_1_0_0.jpg", "site_section": "http://www.deccanchronicle.com/sports", "section_title": "Sports | Deccan Chronicle", "url": "http://www.deccanchronicle.com/151019/sports-cricket/article/anurag-thakur-virtually-rules-out-indo-pak-cricket-series", "country": "US", "title": "Anurag Thakur virtually rules out Indo-Pak cricket series", "performance_score": 0, "site": "deccanchronicle.com", "participants_count": 1, "title_full": "Anurag Thakur virtually rules out Indo-Pak cricket series", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T10:20:00.000+03:00", "replies_count": 0, "uuid": "a1a3316fe47cff4468f9e7b4d2a38ee66e6d3a16"}, "author": "PTI", "url": "http://www.deccanchronicle.com/151019/sports-cricket/article/anurag-thakur-virtually-rules-out-indo-pak-cricket-series", "ord_in_thread": 0, "title": "Anurag Thakur virtually rules out Indo-Pak cricket series", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PTI | October 19, 2015, 21.01 pm On the possibility of a meeting with PCB chief Shaharyar Khan in the capital, BCCI secretary Anurag Thakur was not willing to give an official word about it. (Photo: AFP) New Delhi : BCCI secretary Anurag Thakur on Monday virtually ruled out the possibility of an early resumption of Indo-Pak bilateral cricket series even as he strongly condemned the Shiv Sena protests inside the Board headquarters in Mumbai.\nPCB Chairman Shaharyar Khan is in India to discuss the possibility of an Indo-Pak series in December as per an MoU signed between the two Boards, but Thakur said that first the conditions have to improve to hold talks and only then a bilateral series could be a possibility.\n\"First of all I condemn this attack. You can't barge into BCCI premises and force people not to hold talks with the PCB chairman. I think BCCI President is competent enough to discuss the matter with the PCB chairman but the final call is always taken after discussing with the union government.\nIn a democracy you can protest, but on the streets. Raise your voice but you can't barge into someone's home, office, headquarters, I think that was not fair,\" Thakur said on the sidelines of the selection committee meeting in the national capital.\nRead: Ex chiefs advise PCB to stop chasing India for series\n\"In terms of relations between BCCI and PCB, we had held talks five months earlier and then again. I had made it clear earlier as well that the talks can continue between the Boards, but cricket will only happen when conditions will improve,” he said.\nThakur said it will be very difficult for him to give a timeframe as to when cricketing ties can be restored. \"Talks will happen between the two nations and only then the Boards will be able to decide. The two governments will have to start talking at one level. If you talk about the December series, it will be very difficult for me to commit till we talk with the union government\", he said.\nOn the possibility of a meeting with Shaharyar in the capital, Thakur was not willing to give an official word about it.\n\"I had met Mr Shaharyar Khan during the ICC meet. He wanted to meet the new BCCI President and put his stance. There is no official meeting with him in Delhi,\" he said.\nAlso dispelling rumours about a tri-series involving Pakistan and Bangladesh, Thakur said that the focus is just on Indo-Pak bilateral ties.\nAlso Read: Declare Shiv Sena as a “terrorist organisation”, says Pakistan Punjab Assembly to UN\n\"Holding a tri-series between India, Pakistan and Bangladesh was never discussed with us, it was never on our agenda. We have been talking only on the Indo-Pak bilateral series, which was due in the month of December. Even in the previous meetings there was no commitment from the BCCI side because we were clear that we need to discuss all this with the union government. And there were few pending discussions with the PCB and BCCI and till the time they are not resolved we cannot go to the union government and take a final call,\" he said.\nAn MoU was signed between the two boards in 2014 to play five bilateral-series till 2023 -- in an eight-year cycle. But Thakur said that some things go beyond an MoU when it comes to relations between two nations.\n\"It's not only about MoU, it's also about the prevalent conditions and the relationship where it stands today. And I think PCB chairman wanted to meet the newly-elected President to talk about pending issues which we could not resolve earlier. So once we resolve those issues, then only we will go and talk to the union government and that stage has not arrived,\" he said.\n Cricket Team India Pakistan BCCI PCB Anurag Thakur Shaharyar Khan Also Read Declare Shiv Sena as a “terrorist organisation”, says Pakistan Punjab Assembly to UN Politics shouldn't be mixed with cricket, says ICC president Zaheer Abbas Shiv Sena workers barge into BCCI office, talks with PCB chief rescheduled 10 Sena workers arrested for protesting at BCCI headquarters granted bail", "external_links": ["http://platform.twitter.com/widgets.js", "http://static.ak.fbcdn.net/connect.php/js/FB.Share", "http://campaign.bharatmatrimony.com/track/clicktrack.php?trackid=00100326114361", "https://apis.google.com/js/plusone.js", "http://dd508hmafkqws.cloudfront.net/sites/default/files/styles/article_node_view/public/Anurag-Thakur_AFP_1_0_0.jpg", "http://twitter.com/share?url=http://www.deccanchronicle.com/151019/sports-cricket/article/anurag-thakur-virtually-rules-out-indo-pak-cricket-series", "http://www.facebook.com/sharer.php", "http://dd508hmafkqws.cloudfront.net/sites/default/files/Anurag-Thakur_AFP_1_0_0.jpg", "http://vuukle.com/js/vuukle.js", "http://dd508hmafkqws.cloudfront.net/sites/default/files/BharatMatrimony_texlink_banner_620x40px.gif"], "published": "2015-10-20T10:20:00.000+03:00", "crawled": "2015-10-19T23:52:06.387+03:00", "highlightTitle": ""}