{"organizations": ["Blue Eagles", "Blue Eagle", "Duxbury High", "Eagles", "Aaron Chases", "DHS", "Duxbury", "Plymouth North"], "uuid": "c90c77f47c0f66e6e1a1d23dec588ab9e1f08f36", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wickedlocal.com", "main_image": "http://www.wickedlocal.com/storyimage/WL/20151010/SPORTS/151019394/AR/0/AR-151019394.jpg", "site_section": "http://www.wickedlocal.com/sports?template=rss&mime=xml", "section_title": "Sports - Wicked Local", "url": "http://www.wickedlocal.com/article/20151010/SPORTS/151019394/2000/NEWS?rssfeed=true", "country": "US", "title": "PLYMOUTH NORTH FOOTBALL: Duxbury survives a furious Blue Eagle comeback", "performance_score": 0, "site": "wickedlocal.com", "participants_count": 0, "title_full": "PLYMOUTH NORTH FOOTBALL: Duxbury survives a furious Blue Eagle comeback", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T06:03:00.000+03:00", "replies_count": 0, "uuid": "c90c77f47c0f66e6e1a1d23dec588ab9e1f08f36"}, "author": "", "url": "http://www.wickedlocal.com/article/20151010/SPORTS/151019394/2000/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "PLYMOUTH NORTH FOOTBALL: Duxbury survives a furious Blue Eagle comeback", "locations": ["Whitman-Hanson", "Duxbury"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ryan Reagan", "Reagan", "Bobby Maimaron", "Hagen", "Cam Drew", "Jake Burkhead", "Potter", "Drew", "Myles Uva", "Collin Prudente", "Joe Gooley", "TJ Hagen", "Spencer Potter", "North", "Duxbury"], "text": "Posted Oct. 10, 2015 at 9:59 PM Updated at 10:03 PM Posted Oct. 10, 2015 at 9:59 PM Updated at 10:03 PM The Duxbury High and Plymouth North football teams met in a true heavyweight battle Saturday. Many blows were landed by both combatants, but neither squad came up with the knockout blow. The final decision, however, went to Duxbury as they took the lead in the race for the Patriot League title with a 28-19 win. When they watch the game films Plymouth North will know it could have very easily been them coming away with the win. After going down 21-0 at the half the Blue Eagles used the break to re-group, re-focus and re-energize, returning for the third quarter with a new fire in their eyes. North scored the next 19 points and had a chance to take a 22-21 lead with 2:23 left to play but Aaron Chases' 42-yard field goal fell short of the mark. With the ball back in its possession, Duxbury earned a couple first downs to kill the clock before Bobby Maimaron and Ryan Reagan connected on a touchdown pass in the final minute of the game. The first half belonged to Duxbury as they decisively won the battle at the line of scrimmage. Collin Prudente had a short TD run to open the scoring late in the first quarter. Reagan hauled in a 17-yard scoring strike to make it 14-0 and then a dump off pass to Joe Gooley in the final minute of the half turned into a 20-yard touchdown to send the Dragons to the locker room leading 21-0. Plymouth North's loaded with seniors this season and those veteran leaders flipped the script after the break as the Eagles mounted a furious comeback. Leaning more on its passing attack after watching the running game get bottled up in the first half, senior QB Cam Drew hit TJ Hagen, Jake Burkhead and Spencer Potter with some big passes to move the ball down the field in large chunks. It looked like North got on the board three minutes into the second half when a scrambling Drew threw a dart to Hagen in the end zone but the official ruled Drew was over the line of scrimmage when he threw the ball, nullifying the score and giving DHS the football on its own 19. DHS turned the ball over on downs and North scored for real on the next possession on a Spencer Potter five-yard touchdown catch. The kick missed and Duxbury led 21-6 with 4:19 left in the third quarter. North again quickly stopped the Dragon offense on their next possession. The Eagles turned to the passing game and went 70 yards in three minutes, finishing things off with a nine-yard Drew to Potter connection, A Chase kick made it 21-13 with a little more than a quarter left to play. North's defense forced Duxbury to a third consecutive three-and-out and the Eagles struck quick when Drew tossed a 15-yard completion and then Myles Uva broke free for a pretty 51-yard touchdown run. The two-point conversion attempt that would have tied the game was stopped but Plymouth North had cut the lead to 21-19. Page 2 of 2 - Duxbury picked up some traction the next time they had the football but they were stopped short on a huge fourth-and-three, giving the surging Eagles the football at midfield with 7:44 left on the clock. It boiled down to a fourth-and-15 from the 25 with 2:23 left but Chases' 42-yard field goal attempt was straight, but short. Duxbury picked up a couple big first downs on the ground and Reagan's touchdown catch sealed the deal in the final minute. Plymouth North (4-1) travels to Whitman-Hanson Friday night. Email the reporter at dwolcott@wickedlocal.com and follow him on Twitter, @DavidWolcott1. Wicked Local Posted Oct. 10, 2015 at 9:59 PM Updated at 10:03 PM", "external_links": [], "published": "2015-10-11T06:03:00.000+03:00", "crawled": "2015-10-11T07:52:53.169+03:00", "highlightTitle": ""}