{"organizations": [], "uuid": "84d1fc7d96f76d7914d4948f9369e0550fdaaa67", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.abc2news.com", "main_image": "http://media2.abc2news.com/photo/2015/10/02/3_Keys_for_Maryland_to_beat_Michigan_1_3497220000_24669596_ver1.0_640_480.jpg", "site_section": "http://www.abc2news.com/feeds/rssFeed?obfType=RSS_FEED&siteId=10009&categoryId=10004", "section_title": "Sports | WMAR", "url": "http://www.abc2news.com/sports/college-sports/terps/3-keys-for-terps-football-to-overcome-michigan", "country": "US", "title": "3 Keys for Maryland to overcome Michigan", "performance_score": 0, "site": "abc2news.com", "participants_count": 0, "title_full": "3 Keys for Maryland to overcome Michigan", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T07:54:00.000+03:00", "replies_count": 0, "uuid": "84d1fc7d96f76d7914d4948f9369e0550fdaaa67"}, "author": "", "url": "http://www.abc2news.com/sports/college-sports/terps/3-keys-for-terps-football-to-overcome-michigan", "ord_in_thread": 0, "title": "3 Keys for Maryland to overcome Michigan", "locations": ["Michigan", "Maryland"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Joaquin"], "text": "3 Keys for Terps football to overcome Michigan Big Ten opener was rescheduled due to Joaquin 12:54 AM, Oct 2, 2015 Previous Both teams' Big Ten opener was rescheduled because of Hurricane Joaquin. WMAR Previous Next \nPressbox Online writer Gary Stein shares the three keys for Maryland to overcome Michigan in the video above. \nThe Associated Press breaks Saturday's game down below: \nThe Big Ten Conference has changed the time of Michigan's game at Maryland to noon Eastern Saturday, moving up kickoff by eight hours amid concerns over drenching rain and the approach of Hurricane Joaquin. FULL COVERAGE | Tracking Maryland's Most Severe Weather \nThe hurricane was expected to hit the Bahamas and move toward the U.S., but a wide swath of the East Coast already had rain in the forecast this weekend. Maryland was among the states expected to see some of the heaviest rain. The game between No. 22 Michigan (3-1) and Maryland (2-2) will be the Big Ten opener for both. See Also: Hurricane Joaquin prompts Big Ten Network to cancel Maryland on-site broadcast \n\nNo. 22 Michigan (3-1, 0-0 Big Ten) at Maryland (2-2, 0-0), Noon (BTN) Line: Michigan by 16. Series Record: Michigan leads 3-1 WHAT'S AT STAKE Big Ten opener for both teams. For Michigan, it's a chance prove it can win on the road under first-year coach Jim Harbaugh. The Terrapins want to show they're better than what they showed in a 45-6 loss to West Virginia last week. KEY MATCHUP Maryland QB Caleb Rowe against Michigan's shutdown defense. If Rowe can't protect the football, the Terrapins could get blown out. He was guilty of three interceptions and three fumbles in his first start, a win over South Florida in Week 2, before getting picked off four times and being pulled at West Virginia. PLAYERS TO WATCH Michigan: RB De'Veon Smith is averaging 4.8 yards per carry and has scored four touchdowns in three games. He was banged up last week but is the key figure in a rushing attack that is averaging 202 yards per game. Maryland: KR Will Likely has returned 12 punts for a total of 337 yards, a 28.1 yard average that ranks second in the country. He also leads the nation with two punt returns for touchdowns. FACTS & FIGURES Michigan has won three straight under first-year coach Jim Harbaugh following loss to Utah. ... Wolverines went 1-4 on road last year, and one of their home losses came against Maryland. ... Michigan is 82-25-2 in conference openers, including wins in 44 of last 47. ... Six different Wolverines have scored TDs this season. ... Maryland's Brandon Ross ran for 130 yards last week to move up to 13th on school career list with 1,943. ... For the first time in school history, four true freshmen have scored TDs for Terrapins: Avery Edwards, Ty Johnson, D.J. Moore and Jahrvis Davenport. ... Maryland has 17 sacks, second in nation behind Penn State.", "external_links": [], "published": "2015-10-02T07:54:00.000+03:00", "crawled": "2015-10-02T08:40:47.811+03:00", "highlightTitle": ""}