{"organizations": [], "uuid": "275358c501b46d9ffbb43a908a16d44848416948", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.oregonlive.com", "main_image": "http://imgick.oregonlive.com/home/olive-media/width620/img/oregonian/photo/2015/10/01/18881837-large.jpg", "site_section": "http://www.oregonlive.com/", "section_title": "Oregon Local News, Breaking News, Sports &amp; Weather - OregonLive.com", "url": "http://www.oregonlive.com/history/2015/10/roseburg_school_shooting_recal.html", "country": "US", "title": "Roseburg school shooting recalls 'the Blast,' town's history of tragedies (PHOTOS)", "performance_score": 0, "site": "oregonlive.com", "participants_count": 6, "title_full": "Roseburg school shooting recalls 'the Blast,' town's history of tragedies (PHOTOS) | OregonLive.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T15:53:00.000+03:00", "replies_count": 5, "uuid": "8cb777eb8e6dac62d7cf2ee1b453d9e57ff166aa"}, "author": "Joseph Rose | The Oregonian/OregonLive", "url": "http://www.oregonlive.com/history/2015/10/roseburg_school_shooting_recal.html#post-0", "ord_in_thread": 0, "title": "Roseburg school shooting recalls 'the Blast,' town's history of tragedies (PHOTOS)", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Chuck McCullum heard about the Umpqua Community College shootings from drivers pulling up to buy gas on Thursday morning.\nSomeone shot up the college, they said. It was a rampage. The radio said a lot of people were dead. Confused, angry, sobbing, they asked: How could this happen to Roseburg?\nThe community's sudden shock and horror reminded McCollum, who has owned the Texaco station at Stephens and Mosher for 54 years, of the somber aftermath of \"the Blast.\"\nIn the pre-dawn darkness of Aug. 7, 1959, a truck carrying 6 1/2 tons of dynamite and blasting agent exploded, leveling downtown Roseburg and killing 14 people.\nFor such a small, quiet town in Southern Oregon's timber country, Roseburg -- population 22,000 -- has had more than its fair share of \"hurting and crying,\" McCollum said.\nOn Thursday morning, 10 people were killed, including gunman 26-year-old Chris Harper-Mercer, and seven injured in a mass shooting in a writing and speech class in the college's Snyder Hall. It was the deadliest school shooting in Oregon history.\nIt's also the second school shooting in Roseburg since 2006, when a high school freshman survived several bullet wounds . Three years earlier, the community mourned eight local wildland firefighters who died on a remote highway while returning home from battling a blaze in Idaho.\nBut before Thursday's barbarity at Umpqua Community College, it was hard for anyone to imagine that the cold fingers of death would touch the town like it did in 1959.\nAmong locals, the explosion -- which left a 52-foot-diameter crater and made worldwide news -- is known simply as the Blast.\n\"It was our claim to fame – until today,\" said Karen Bratton, a research librarian for the Douglas County Museum, a few hours after Thursday's shooting filled the air with sirens.\nThe blast remains one of the state's worst disasters.\nThe Oregonian/1959 The stage was unknowningly set by George Rutherford, a Pacific Powder Co. employee who parked a delivery truck containing construction dynamite next to the Garretsen Building Supply Company warehouse for the night.\nMcCullum, who was 17, remembers walking past the truck on his way home from a movie and late-night snack at Roseburg's 24-hour hamburger joint.\nThe rig was parked across from the Coca-Cola factory, where McCullum liked to admire the glass bottles lined up in the windows. But the red delivery truck caught the boy's attention that night. The word \"Explosives\" was painted on its side.\n\"It was huge,\" McCollum said. \"It had nice chrome wheels. You didn't see chrome wheels like that back then.\"\nShortly after 1 a.m., a fire erupted at the Garretsen Supply warehouse, just feet from the truck. As people stopped to watch firefighters spray the flames, the truck caught fire.\nSomeone yelled for everybody to run, according to a 50 th anniversary story written by Brent Walth for The Orgeonian in 2009 . \"Seconds later,\" Walth wrote, \"a flash consumed them all.\"\nMcCullum said he had walked a mile away from the truck and was approaching the Umpqua River when the truck exploded. He felt the force of the blast in his chest.\nThe Oregonian reported that the \"freakish nature\" of the blast knocked people off their feet and out of their beds. Rutherford, who tried to move the truck before it caught fire, was hospitalized with cuts. Police said he was in a state of shock bordering on hysteria.\nThe Oregonian/1959 Walth's account told the heartbreaking fate of one family that had been watching the warehouse burn from their window about a block away. \"The husband had stepped away to use the bathroom,\" he wrote. \"When the blast hit, collapsing walls saved his life as razors of glass shredded his wife and 4-year-old daughter.\"\nFourteen died, 125 were injured. The blast leveled eight blocks. Three hundred businesses within a 30-block radius were damaged, including 72 declared structurally unsafe.\nDowntown – what was left of it – \"looked like a war zone,\" Bratton said. McCollum said he knew some of the firefighters and policemen killed in the explosion.\nUmpqua Community College opened two years after the Blast.\nMcCollum refuses to say his hometown in the Umpqua River Valley is cursed. He also would go only so far in comparing the 56-year-old tragedy with the mass shooting at UCC.\nOne was a fluky accident, which led to new rules about how explosives are handled. The other was an act of evil, he said.\n\"They both interrupted this town, but they're not the same,\" he said, admitting he let few tears roll down his cheek after he heard about what unfolded on at the college.\n\"But we'll do like we'll always do: We'll pick up our pants, go to work and find a way to come together like a family.\"\n— Joseph Rose\n503-221-8029\njrose@oregonian.com\n@josephjrose", "external_links": ["https://www.youtube.com/embed/hbFzdyrSg44", "http://twitter.com/josephjrose", "http://www.komonews.com/news/archive/4102611.html"], "published": "2015-10-02T15:53:00.000+03:00", "crawled": "2015-10-02T20:17:12.795+03:00", "highlightTitle": ""}