{"organizations": [], "uuid": "ca072e55bb3177446e3916f1abf9e13eeef03075", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "", "site_section": "http://bostonherald.com/sports/bruins_nhl", "section_title": "Sports: Bruins &amp; NHL | Boston Herald", "url": "http://bostonherald.com/news_opinion/national/2015/10/1_fatally_shot_at_texas_southern_university_housing_complex", "country": "US", "title": "1 fatally shot at Texas Southern University housing complex |", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "1 fatally shot at Texas Southern University housing complex | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "ca072e55bb3177446e3916f1abf9e13eeef03075"}, "author": "Associated Press", "url": "http://bostonherald.com/news_opinion/national/2015/10/1_fatally_shot_at_texas_southern_university_housing_complex", "ord_in_thread": 0, "title": "1 fatally shot at Texas Southern University housing complex |", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON — One person was killed and another wounded during a shooting Friday at a Texas Southern University student-housing complex, and the Houston campus has been placed on lockdown, university and police officials said.\nHouston police spokesman Kese Smith said a possible suspect has been detained. The shooting was reported around 11:30 a.m. at University Courtyard Apartments, a student-housing apartment complex on the edge of campus.\nSmith said it wasn't clear whether the individuals were students, but he said one person was killed and another person was wounded.\nUniversity spokesman Kendrick Callis said the campus is on lockdown and classes have been cancelled at the school, which has about 9,700 students.\nPolice and emergency vehicles were at the scene, though no additional details were immediately available.\nThe incident occurred just hours after another shooting near the same housing complex. The university said in a statement that the earlier shooting occurred early Friday morning, and that the school was increasing police presence on campus. Details about the earlier shooting weren't immediately available, and it's unclear whether the shootings are related.\nThe incident follows a fatal shooting earlier Friday at Northern Arizona University, where an overnight confrontation between students escalated into gunfire that killed one person and wounded three others. Last week, eight students and a teacher were fatally shot at Umpqua Community College in Oregon. The gunman in the Oregon shooting also wounded nine people before turning the gun on himself.\n___\nDavid Warren reported from Dallas.", "external_links": [], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-09T21:59:21.213+03:00", "highlightTitle": ""}