{"organizations": [], "uuid": "147e734b7c057b0367dac32982873112dcd94844", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mercurynews.com", "main_image": "http://extras.mnginteractive.com/live/media/site568/2015/1015/20151015__SJM-FRYSGOLF-1016-01~1.JPG", "site_section": "http://feeds.mercurynews.com/mngi/rss/CustomRssServlet/568/200223.xml", "section_title": "Sports", "url": "http://www.mercurynews.com/sports/ci_28976244/no-tiger-woods-no-problem-at-frys-com?source=rss", "country": "IL", "title": "Brendan Steele shoots 63 to take first-round lead at Frys.Com Open", "performance_score": 0, "site": "mercurynews.com", "participants_count": 1, "title_full": "Brendan Steele shoots 63 to take first-round lead at Frys.Com Open", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T08:10:00.000+03:00", "replies_count": 0, "uuid": "147e734b7c057b0367dac32982873112dcd94844"}, "author": "Carl Steward\n\ncsteward@bayareanewsgroup.com", "url": "http://www.mercurynews.com/sports/ci_28976244/no-tiger-woods-no-problem-at-frys-com?source=rss", "ord_in_thread": 0, "title": "Brendan Steele shoots 63 to take first-round lead at Frys.Com Open", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Brendan Steele shoots 63 to take first-round lead at Frys.Com Open By Carl Steward Posted: 10/15/2015 04:27:14 PM PDT Updated: 10/15/2015 08:13:45 PM PDT NAPA -- Two-thirds of the Frys.com Open's power trio delivered the goods in Thursday's opening round, a sweet development for a tournament that lost Tiger Woods as a major attraction less than a month ago. \nWithout Woods, who had back surgery a week after committing to the event in September, the event's star focus shifted to the supergroup of Rory McIlroy, Justin Rose and Brandt Snedeker. They easily commanded the largest first-day gallery on Silverado Resort's North Course. Brandt Snedeker reacts after missing a birdie putt on the third green of the Silverado Resort North Course during the first round of the Frys.com PGA Tour golf tournament Thursday, Oct. 15, 2015, in Napa, Calif. (AP Photo/Eric Risberg) ( Eric Risberg ) \nMcIlroy, the world's No. 1 golfer for 54 straight weeks and much of the past three years until Jordan Spieth and Jason Day passed him during the past two months, shot a 4-under par 68 despite several missed birdie opportunities. Rose, ranked seventh in the world, came in a stroke lower with a 5-under 68. Only Snedeker, a two-time AT&T Pebble Beach Pro-Am champ and the 2012 FedEx Cup winner, faltered with a 1-over 73. \nRose was tied for seventh after the opening round while McIlroy was tied for 13th behind Brendan Steele, a 32-year-old native Californian who shot a 9-under 63 to take the lead in the opening tournament of the 2015-16 season. Venezuelan Jhonattan Vegas was a stroke back after an 8-under 64. Harold Varner III, just the second African-American since Woods to earn a PGA Tour card, was alone in third, two strokes back after finishing eagle-birdie-birdie for a 7-under 65. Advertisement \nTo be sure, there is no shortage of compelling story lines after the first round, and with two of the biggest names in golf on the leader board in the PGA Tour's leadoff event for 2015-16, Frys.com officials looking for big crowds in Napa this weekend have to be ecstatic. \nIt was a strong debut performance by a pair of players from the United Kingdom who had never played Silverado until a few days ago. McIlroy was long and precise off the tee all day and his approach shots were equally on target, and he might have been even closer to the top of the board if he'd been able to sink a few more putts. \n\"On the greens, I obviously gave myself a lot of chances,\" McIlroy said. \"I converted a few, but I'll need to hole a few more. I feel like this is a golf course that you can give yourself a lot of chances. There are guys that are 6-, 7-, 9-under par. That's what you sort of need to do around here. \n\"But if I can keep hitting the ball the way I am and just hole a few more, I will be OK.\" \nAsked how many reasonable birdie putts got away, the 26-year-old McIlroy said, \"Maybe five. There were a lot of putts from inside 12 feet that I could have made and didn't.\" \nRose, meanwhile, played beautifully, and perhaps most surprisingly, showed improved length off the tee for a player who turned 35 in July. He credits better fitness and swing adjustments but said the biggest boost was a recent switch to TaylorMade's M1 driver. Justin Rose, of Great Britain, chips the ball up to the ninth green of the Silverado Resort North Course during the first round of the Frys.com PGA Tour golf tournament Thursday, Oct. 15, 2015, in Napa, Calif. (AP Photo/Eric Risberg) ( Eric Risberg ) \n\"Yeah, the M1 has been good to me,\" he said. \"I drove the ball so well last year, and to put a new driver in play speaks to how good it is.\" \nThe Englishman's increased distance has been dramatic enough to get the attention of his compatriot and longtime friend from Northern Ireland, McIlroy. \n\"I haven't seen him hit the ball as long,\" McIlroy said of Rose. \"Even at the Tour Championship, I played with him and he was hitting it past me. That hasn't really happened that much before. He was getting me by 20-25 yards.\" \nAnd McIlroy's response? \n\"I actually changed shafts on my driver,\" he said. \"So he was only getting by me by about 5-10 (yards) today.\" \nOn a warm, dry, wind-free day, the field bludgeoned the Silverado layout with more than 80 players beating the par of 72. Nobody did it better than the bogey-free Steele, who grew up in the tiny Southern California mountain town of Idyllwild and developed a golf game despite the fact that there was no course in the vicinity. \n\"Not even a little golf course,\" said Steele, who birdied half his holes, including seven of the first nine. \"My dad put a little net in the back yard, a little artificial putting green, dug out a bunker and filled it with sand from the hardware store. That was sort of where I kind of learned how to play. It was just a situation where you get a club in your hand any way you can.\" Steele's lone tour win came back in 2011. \nVegas' personal story is just as compelling. Golf is not a major sport in Venezuela, but despite an up-and-down career that has been down of late, Vegas fashioned a game good enough to win the Bob Hope Classic in 2011, which made him the first from his country to win a PGA Tour event. \n\"It's a long story, but it all starts with my dad working in oil camps that we have managed in Venezuela, where Americans used to go work in the oil business,\" Vegas said. \"They built 9-hole golf courses. My dad used to work in some of those camps, and I was able to use some of those golf courses.\" \nAnother notable in contention is former Stanford standout Patrick Rodgers, who was tied for 13th with McIlroy after his 68. Follow Carl Steward on Twitter at twitter.com/stewardsfolly .", "external_links": [], "published": "2015-10-16T08:10:00.000+03:00", "crawled": "2015-10-16T08:15:25.090+03:00", "highlightTitle": ""}