{"organizations": [], "uuid": "8d3407d732f59e173a826f5f55bd5456dd758f74", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kplctv.com", "main_image": "http://kplc.images.worldnow.com/images/4157606_G.jpg", "site_section": "http://www.kplctv.com/Global/category.asp?C=4385&nav=menu66_4&clienttype=rss", "section_title": "KPLC-TV - Sports", "url": "http://www.kplctv.com/story/30180498/pokes-win-big-on-the-road-against-nicholls-staying-unbeaten", "country": "US", "title": "Pokes win big on the road against Nicholls staying unbeaten", "performance_score": 0, "site": "kplctv.com", "participants_count": 1, "title_full": "Pokes win big on the road against Nicholls staying unbeaten", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T07:54:00.000+03:00", "replies_count": 0, "uuid": "8d3407d732f59e173a826f5f55bd5456dd758f74"}, "author": "McNeese State Sports Information Department", "url": "http://www.kplctv.com/story/30180498/pokes-win-big-on-the-road-against-nicholls-staying-unbeaten", "ord_in_thread": 0, "title": "Pokes win big on the road against Nicholls staying unbeaten", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Pokes win big on the road against Nicholls staying unbeaten Posted: (Source: McNeese State University) THIBODAUX, La. (KPLC) - \nMcNeese quarterback Daniel Sams threw for 140 yards and rushed for another 89 as the 15th-ranked Cowboys improved to 4-0 for the second time since 2013 after a 37-7 win over Nicholls in Southland Conference action on Saturday afternoon. \nThe Cowboys remain atop the league standings at 3-0 while Nicholls (0-4, 0-2) dropped its 22nd-consective game with the loss including its seventh straight to the Cowboys. \nSams’ 89 rushing yards pushed him over 1,000 for his career (1,057) and becoming just the fourth quarterback in school history to reach the milestone. \nMcNeese’s No. 1 ranked scoring defense in the nation (6.7 ppg) and No. 2 in total defense (249.0 ypg) held the Colonels to just seven points and 239 total yards of offense. Nicholls managed just 52 offensive yards and five first downs in the second half alone. \nThe Cowboys’ offense entered the game ranked 13th in the nation in rushing (248.7) and 20th in total (437.3) and finished with 268 yards on the ground and 480 total. \nIn addition to Sams’ team-high 89 yards rushing, Ryan Ross added 74 yards and a score followed by David Hamm with 57 and Derrick Milton with 32. \nSams finished the game completing 12 of 20 passes for 140 yards with a score while Grant Ashcraft hit 2 of 3 passes for 23 yards. \nMcNeese got things going on its first drive when Sams found Tavarious Battiste for 34 yards for a 7-0 lead with 8:25 to play in the first quarter in a play that was set up by a 17 yard run by Ryan Ross to get the ball to the Nicholls side of the field. \nThe Cowboys got the ball back after forcing Nicholls into a 3-and-out and put together an 11-play, 53-yard drive that was finished off by a Ross 6-yard purge to make it 13-0 with 10:53 to play in the half. \nAnother defensive stand that was finished off by a Bo Brown sack of Figaro, gave the Cowboys the ball back. What followed was the longest scoring drive of the season at 14 plays, 90 yards and took 6:41 off the clock. \nDuring that drive, the moved the ball at will on the ground with 11 of those plays being rushes for 60 yards. Sams ended the drive with a 4-yard plunge to give McNeese a 20-0 lead with 1:51 to play in the half. \nOn the ensuing kickoff, kicker Jean Breaux connected with Colonel return man Darius Knight at the Nicholls 49 to force a fumble and recovered by the Cowboys’ Kelvin Bennett. On the next play, McNeese pulled out the razzle dazzle play with a wide receiver lateral pass from David Bush to Shelby for a 49-yard score and a 27-0 lead. \nNicholls ended any chance of being shutout with a 5-play drive that went 70 yards and took just 1:04 off the clock to make it 27-7 at the half. \nMcNeese scored on four of its five possessions in the first half. \nThe second half was a little quieter with the only touchdown scored came on a fumble recover in the endzone by defensive tackle Anthony Yruegas who fell on the ball after Brown dislodged it from Figaro with his second sack of the game. \nMcNeese tacked on a 36-yard field goal by Trent Manuel to make it 37-7 with 7:03 to play in the game. \nFigaro completed 14 of 20 passes for 177 yards and a touchdown to lead Nicholls’ offense while running back Michael Henry paced the team with 39 yards rushing. \nThe Cowboys will return home next Saturday for a big league game against Southeastern Louisiana in a battle of conference unbeatens with kickoff slated for 6 p.m. \nWORTH NOTING: McNeese’s quarter streak of holding opponents scoreless came to an end at 8 straight when Nicholls scored with 1:31 to play in the second quarter… McNeese is 4-0 under head coach Matt Viator for the third time in his career (2007, 2013, 2015) and 3-0 to start SLC play (2007, 2013, 2015)… The Cowboys have allowed 27 points through four games. It’s the least amount of points allowed through that many games since 1979 (26 points)… Kent Shelby has caught a TD pass in three straight games… The running game has rushed for 200 or more yards all four games Can't Find Something?", "external_links": [], "published": "2015-10-04T07:54:00.000+03:00", "crawled": "2015-10-04T08:15:59.912+03:00", "highlightTitle": ""}