{"organizations": [], "uuid": "ac22d962dabb03e74c69e73ebdabae1207b0ba5d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nytimes.com", "main_image": "http://static01.nyt.com/images/2015/10/18/sports/18COLUMBIA/18COLUMBIA-facebookJumbo.jpg", "site_section": "http://www.nytimes.com/services/xml/rss/nyt/Sports.xml", "section_title": "NYT &gt; Sports", "url": "http://www.nytimes.com/2015/10/18/sports/ncaafootball/columbias-coach-faces-his-old-team-and-the-lions-fall-hard.html", "country": "US", "title": "Columbia’s Coach Faces His Old Team, and the Lions Fall Hard", "performance_score": 0, "site": "nytimes.com", "participants_count": 1, "title_full": "Columbia’s Coach Faces His Old Team, and the Lions Fall Hard - The New York Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T05:06:00.000+03:00", "replies_count": 0, "uuid": "ac22d962dabb03e74c69e73ebdabae1207b0ba5d"}, "author": "Tom Pedulla", "url": "http://www.nytimes.com/2015/10/18/sports/ncaafootball/columbias-coach-faces-his-old-team-and-the-lions-fall-hard.html", "ord_in_thread": 0, "title": "Columbia’s Coach Faces His Old Team, and the Lions Fall Hard", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Al Bagnoli never wanted to become the central figure whenever the University of Pennsylvania kicked off against his Columbia Lions. There are some things even one of the most successful coaches in Football Championship Subdivision history cannot control.\nPenn capitalized on four Columbia turnovers and assorted other breakdowns in pounding the Lions, 42-7, on Saturday in the inaugural Bagnoli Bowl at Robert K. Kraft Field.\n“We did not play as well as we had been and are capable of, and that starts with me,” Bagnoli said after the Quakers outgained his team in yards, 417-199, in rolling to their 18th consecutive victory against Columbia.\nBagnoli became central to the matchup as soon as Columbia made the stunning announcement on Feb. 23 that he had agreed to take over its downtrodden program three months after he retired with the most victories of any coach in the Quakers’ 137-year football history.\nPenn had named Bagnoli the director of special projects as a show of appreciation for his 148-80 record and the nine Ivy League championships he produced in 23 years there. The last of his titles came in 2012. In the final two seasons under Bagnoli, the Quakers were 4-6 and 2-8.\nBagnoli leads all active F.C.S. coaches in victories with a 233-95 record. He had only three losing seasons coaching at Penn and at Union College in Schenectady, N.Y.\nSome of those who know Bagnoli well were not surprised that he was unable to adjust to a desk job after so many years of pacing the sidelines. The startling development was that, at 62, he would assume a major rebuilding effort at Columbia. The Lions last had a winning season in 1996.\nColumbia (1-4, 0-2) booted what Bagnoli described as the “800-pound gorilla in the room” when it pounded winless Wagner, 26-3, at home last Saturday to end a 24-game losing streak. But consecutive wins by the Lions for the first time in five years? That was too much to ask, even if Penn (2-3, 1-1) has sputtered since Ray Priore succeeded Bagnoli. Priore spent 16 years as Bagnoli’s defensive coordinator, nine as his associate head coach.\nBagnoli’s first meeting with his former team reminded him of how much work he must do to change a culture of losing at Columbia. While Penn was opportunistic in adding to its advantage in a series it leads, 73-21-1, Columbia self-destructed as it had under so many previous coaches with lesser résumés. And an eagerly anticipated Homecoming Day ended quietly.\n“You turn it over the way we did in the spots we did, and it’s a recipe for disaster,” Bagnoli said after his team fumbled six times — losing two — and was intercepted twice.\nAfter the Lions stitched together a 10-play, 68-yard drive that ended in quarterback Skyler Mornhinweg’s 6-yard scoring toss to Cameron Dunn, they presented Penn with a gift touchdown on their next possession when Scooter Hollis, a senior wide receiver, fumbled and the Quakers’ Sam Philippi, a freshman safety, recovered at the Lions’ 21-yard line. Two plays later, Alek Torgersen, a junior quarterback, rifled the first of his three touchdown passes, a 19-yard bullet to Ryan Kelly.\nAdvertisement\n Advertisement\n Torgersen completed 19 of 29 pass attempts for 270 yards. He acknowledged that he drew added incentive from the unusual circumstances surrounding the game.\n“I’m sure everyone had a little more fire under his feet to win emphatically,” Torgersen said. “That was the goal. That’s always the goal.”\nTorgersen said Penn players understood why Bagnoli accepted a lucrative offer to coach Columbia.\n“He loves football, and he had a great opportunity to go to Columbia,” he said. “I have the utmost respect for him.”\nPriore said he and Bagnoli spent more than an hour on the phone Wednesday. He also said the matchup increased the competitiveness in both of them.\n“If we were playing basketball,” he said, “I would be fouling him, and he would be fouling me.”\nBagnoli said that watching game film of Penn brought back a rush of memories for him.\n“It wasn’t just your ordinary game,” he said. “You watch tape, and you’re not saying, ‘Look at 49,’ or ‘Look at 10.’ You know the names and the backgrounds.”\nWhen it was over, Priore took a few minutes before rejoining his jubilant team to visit with Bagnoli and the coach’s wife and family. Then they headed to opposite locker rooms, with Bagnoli understanding perhaps as never before how far he must go merely to restore Columbia to respectability.", "external_links": [], "published": "2015-10-18T05:06:00.000+03:00", "crawled": "2015-10-18T05:07:24.916+03:00", "highlightTitle": ""}