{"organizations": [], "uuid": "4a9ceb09a58dd80fc6ec3fdd9480e47ce3684ce2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/47529300.cms", "site_section": "http://timesofindia.indiatimes.com/rssfeeds/4720867.cms", "section_title": "Top Stories - Golf - Sports - The Times of India", "url": "http://timesofindia.indiatimes.com/sports/golf/top-stories/Mickelson-repays-captain-for-Presidents-Cup-pick/articleshow/49310547.cms", "country": "IL", "title": "Mickelson repays captain for Presidents Cup pick", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "Mickelson repays captain for Presidents Cup pick - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T18:24:00.000+03:00", "replies_count": 0, "uuid": "4a9ceb09a58dd80fc6ec3fdd9480e47ce3684ce2"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/sports/golf/top-stories/Mickelson-repays-captain-for-Presidents-Cup-pick/articleshow/49310547.cms", "ord_in_thread": 0, "title": "Mickelson repays captain for Presidents Cup pick", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SEOUL: Phil Mickelson may have been a controversial choice for the United States' Presidential Cup team but the veteran American more than repaid the faith shown in him. \n\nAlthough Mickelson had played in the 10 previous editions of the Presidents Cup, he did not earn automatic selection this time and only got in after Jay Haas chose him as one of his captain's picks. \n\nNot everyone was convinced Mickelson deserved his spot. He hasn't won a tournament in more than two years and has slipped down the rankings and is currently 24th. And at 45, he was the oldest man chosen for the biennial event. \n\nBut Mickelson proved all the doubters wrong by playing the lead role in his team's one-point win over the Internationals. \n\nHe earned 3.5 points from his four matches, including a full point in Sunday's decisive singles, where he thrashed South Africa's 2011 Masters champion Charl Schwartzel 5&4. \n\n\"I love these team events. They are my favourite weeks of the year,\" he told a news conference. \n\n\"I love playing with these guys. I love the emotions that we share and the intensity and the pressure that we deal with each match throughout the week. \n\n\"I hope that I have an opportunity to compete in more Presidents Cups.\" \n\nThe left-hander twice holed out from bunkers, including one spectacular effort from 138 yards on Friday, and might well have got maximum points if not for an obscure penalty clause he incurred for using a wrong ball in Friday's morning foursomes. \n\nThe infraction cost him and his playing partner Zach Johnson two holes in one but they fought back to halve their match with Jason Day and Adam Scott. \n\nMickelson is an unwavering fan of the Presidents Cup, even though it is yet to generate the same hype as the Ryder Cup. \n\n\"We still feel the pressure. We still feel the emotion. We still feel the excitement,\" he said. \n\n\"It still means that much to us. Always has and I hope others see what a great event this Presidents Cup is.\" \n\nNo sooner had he finished his final round than Mickelson turned his attention to next year's Ryder Cup, where the American will try to win back the trophy from Europe. \n\n\"I'm certainly looking forward to next year's Ryder Cup as well,\" he said. \n\n\"And I hope that I don't put the captain in a position where he has to pick me this time. I hope that I will be able to make it on my own.\" Stay updated on the go with Times of India News App. Click here to download it for your device.", "external_links": [], "published": "2015-10-11T18:24:00.000+03:00", "crawled": "2015-10-11T22:39:14.777+03:00", "highlightTitle": ""}