{"organizations": [], "uuid": "309b744e25985c611dee5dedb8a7f38570f024fa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.timesunion.com", "main_image": "http://ww3.hdnux.com/photos/41/53/63/8830150/3/rawImage.jpg", "site_section": "http://www.timesunion.com/default/feed/default/feed/Sports-News-64.php", "section_title": "Sports News", "url": "http://www.timesunion.com/sports/article/Fredette-among-four-Spurs-cuts-6583095.php", "country": "US", "title": "Fredette among four Spurs cuts", "performance_score": 0, "site": "timesunion.com", "participants_count": 1, "title_full": "Fredette among four Spurs cuts - Times Union", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T05:46:00.000+03:00", "replies_count": 0, "uuid": "309b744e25985c611dee5dedb8a7f38570f024fa"}, "author": "timesunion.com", "url": "http://www.timesunion.com/sports/article/Fredette-among-four-Spurs-cuts-6583095.php", "ord_in_thread": 0, "title": "Fredette among four Spurs cuts", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: Skip Dickstein Image 1 of / 1 Caption\nClose\nImage 1 of 1 Former Glens Falls High basketball star Jimmer Fredette, now with the NBA's Sacramento King's, works with kids June 26, 2013, at his basketball camp at the Saratoga Springs Rec Center in Saratoga Springs, N.Y. ( Skip Dickstein/Times Union ) Former Glens Falls High basketball star Jimmer Fredette, now with the NBA's Sacramento King's, works with kids June 26, 2013, at his basketball camp at the Saratoga Springs Rec Center in Saratoga Springs, N.Y. ... more Fredette among four Spurs cuts 1 / 1 Back to Gallery San Antonio\nThe San Antonio Spurs have waived guard Jimmer Fredette , a Glens Falls native and graduate of Glens Falls High School .\nThe Spurs also waived Youssou Ndoye , Keifer Sykes and Deshaun Thomas on Wednesday.\nThe Spurs gave Fredette a partially guaranteed deal in July to come to training camp and provide some outside shooting to a veteran roster that is priming for another title run this season. But Fredette was underwhelming, scoring four points in 26 minutes in the preseason.\nFredette was the 10th overall pick by Milwaukee in the 2011 draft after a sensational career at BYU. The Bucks subsequently traded him to Sacramento, where he spent his first two NBA seasons. He has struggled in the NBA, bouncing around to Chicago and New Orleans as well before landing the tryout with San Antonio.\nFredette is now looking for his fifth team in five years.\nCavaliers: Cleveland and free-agent forward Tristan Thompson have agreed in principle on a five-year, $82 million contract, ending his holdout. Thompson, who helped Cleveland get to the NBA Finals last season when he filled in for an injured Kevin Love during the playoffs, had been seeking a maximum deal. The sides had been at a stalemate, but reached an oral agreement Wednesday, less than a week before the season opener. The team hopes to make the signing official Thursday. After Thompson declined to sign a one-year, $6.9 million qualifying offer from the team, it appeared he might be willing to sit out part of the regular season. LeBron James had called Thompson's holdout a \"distraction\" during training camp. But he'll be on the floor as the Cavs try to defend their Eastern Conference title. Thompson averaged 10.8 rebounds in the playoffs last season.", "external_links": ["http://ww3.hdnux.com/photos/41/53/63/8830150/3/920x920.jpg", "http://ww3.hdnux.com/photos/41/53/63/8830150/3/square_gallery_thumb.jpg"], "published": "2015-10-22T05:46:00.000+03:00", "crawled": "2015-10-22T11:35:14.823+03:00", "highlightTitle": ""}