{"organizations": [], "uuid": "397089c92759d5a3867260526e606913ec7ba3cf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.boston.com", "main_image": "http://p.o0bc.com/rf/image_1920x1190/Boston/2011-2020/2015/09/30/Boston.com/BCOM/Images/2015-09-30T180330Z_1200212670_GF10000228003_RTRMADP_3_USA-POLITICS.jpg", "site_section": "http://www.boston.com/", "section_title": "Boston, MA news, breaking news, sports, video | Boston.com", "url": "http://www.boston.com/news/politics/2015/09/30/mitt-romney-going-after-donald-trump-again/aQo0Q8K5ttpZPq3w9RBsdJ/story.html", "country": "", "title": "Mitt Romney is going after Donald Trump again - Politics", "performance_score": 0, "site": "boston.com", "participants_count": 1, "title_full": "Mitt Romney is going after Donald Trump again - Politics", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "397089c92759d5a3867260526e606913ec7ba3cf"}, "author": "boston.com", "url": "http://www.boston.com/news/politics/2015/09/30/mitt-romney-going-after-donald-trump-again/aQo0Q8K5ttpZPq3w9RBsdJ/story.html", "ord_in_thread": 0, "title": "Mitt Romney is going after Donald Trump again - Politics", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Former presidential runner-up Mitt Romney criticized Donald Trump’s position on ISIS and expressed doubt on Wednesday that the leading Republican candidate will be elected president.\n“I will support the Republican nominee. I don’t think that’s going to be Donald Trump,” Romney said with a smile at The Atlantic ’s Washington Ideas Forum, according to Politico . “My party has historically nominated someone who’s a mainstream conservative.”\nRomney pointed to Trump’s comments about ISIS on 60 Minutes , in which he suggested the U.S. should let ISIS fight in Bashar al-Assad in Syria unimpeded.\nAdvertisement “I thought that was both absurd and dangerous, and I just don’t think that kind of proposal is likely to lead him to become our nominee,” Romney said .\nRomney and Trump have repeatedly criticized each other over the summer as Trump’s outspoken comments have helped him surge to a lead in Republican polls. Trump said Romney “ choked ” during his 2012 race, while Romney rushed to rip Trump for his comments on Mexican-Americans and on Sen. John McCain .\nRomney, who was one of those mainstream conservatives when nominated in 2012, named a few other candidates he thought would be more appropriate: Chris Christie, John Kasich, Marco Rubio, Jeb Bush, Lindsey Graham, and perhaps Carly Fiorina, he said.\n“Each of them has staked out territory which is not extreme,” Romney said.\nRomney’s remarks came just a day after his wife Ann diplomatically handled a question about whether Trump was “good for politics” in comments to Yahoo’s Katie Couric.\n“More people are listening, I think more people are becoming engaged, more people are paying attention than ever before,” she said. “That, I would say, would be a good thing.”\nGallery: 10 things you didn’t know about Donald Trump\nPrevious -- of -- Next Trump doesn’t drink a drop of alcohol. That didn’t stop him from turning out his own Trump Vodka, with the slogan “Success Distilled,” in 2006. Charles Krupa / AP Previous -- of -- Next Trump offered President Barack Obama free, lifetime use of his golf courses. The only thing he required in return was Obama’s resignation. Damian Dovarganes / AP Previous -- of -- Next Trump likes to boast about the his degree from the Wharton School of Business at the University of Pennsylvania, but some of his colleagues recently told “NY Daily News” that he wasn’t well-known around campus. Courtesy of Flickr / Creative Commons els1124 Previous -- of -- Next Before marrying his current wife Melania in 2005, Donald Trump was married twice—first to Ivana Trump, then to Marla Maples. Ethan Miller / Getty Images Previous -- of -- Next Trump is a germaphobe, and he doesn’t like to shake hands. In his book, he wrote that “One of the curses of American society is the simple act of shaking hands, and the more successful and famous one becomes the worse this terrible custom seems to get.” Spencer Platt / Getty Images Previous -- of -- Next Advertisement Previous -- of -- Next Trump partnered with the Hyatt corporation to buy the Commodore Hotel next to Grand Central Station, which is now known as the Grand Hyatt Hotel. Trump also paid to revamp the station in the 1970s. When the renovation was complete, he hung a giant banner that said “Trump” accross the scaffolding. Mario Tama / Getty Images Previous -- of -- Next Trump had the opportunity to buy the Patriots in 1988, but he turned down the opportunity because he didn’t think it was a good investment. The team is now worth more than $2 billion. Jim Davis / The Boston Globe Previous -- of -- Next Trump won a Razzie Award for worst supporting actor in the film “Ghosts Can’t Do It” in 1990. He was playing himself in the movie. Andrew H. Walker / Getty Images Previous -- of -- Next In a divorce deposition, Ivana Trump claimed that Donald Trump had raped her while the two were married. She later softened the statement, saying that it was “not in the criminal sense.” Donald Trump’s attorney recently said there is no such thing as marital rape, even though it is explicitly against the law. File Photo Previous -- of -- Next Trump has said he is a strong supporter of the Second Amendment, and that he wants to limit some restrictions on guns. When asked about the guns that he owns, he told an NBC reporter that it’s “none of her business.” Richard Ellis / Getty Images Previous -- of -- Next Advertisement", "external_links": ["http://www.cnn.com/2015/09/27/politics/donald-trump-isis-syria-russia-60-minutes/", "http://www.msnbc.com/hardball/watch/trump--mitt-romney-failed--he-choked-508995139949", "http://www.ijreview.com/2015/09/433665-mitt-romney-names-republicans-win-presidential-election/?utm_content=buffer20919&utm_medium=social&utm_source=twitter.com&utm_campaign=buffer", "http://www.cnn.com/2015/07/18/politics/donald-trump-john-mccain-war-hero/", "http://thehill.com/blogs/ballot-box/gop-primaries/246871-romney-trumps-comments-have-hurt-gop", "http://www.politico.com/story/2015/09/mitt-romney-donald-trump-gop-president-214271"], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-10-01T01:56:59.692+03:00", "highlightTitle": ""}