{"organizations": [], "uuid": "16ffee2e7ffce1591ed120083767d9c86effa9c8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.swxrightnow.com", "main_image": "http://SWXRN.images.worldnow.com/images/9002844_G.jpg", "site_section": "http://www.swxrightnow.com/category/208735/z-local-sports-headlines?clienttype=rss", "section_title": "Sports and Weather Right Now - RSS - College Sports Headlines", "url": "http://www.swxrightnow.com/story/30245014/press-pass-pullman-episode-five", "country": "US", "title": "Press Pass Pullman: Episode Five", "performance_score": 0, "site": "swxrightnow.com", "participants_count": 1, "title_full": "Press Pass Pullman: Episode Five", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T07:36:00.000+03:00", "replies_count": 0, "uuid": "16ffee2e7ffce1591ed120083767d9c86effa9c8"}, "author": "John Collett", "url": "http://www.swxrightnow.com/story/30245014/press-pass-pullman-episode-five", "ord_in_thread": 0, "title": "Press Pass Pullman: Episode Five", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Press Pass Pullman: Episode Five - SWX Right Now-Sports for Spokane, CdA, Tri-Cities, WA Member Center: Press Pass Pullman: Episode Five by John Collett, SWX Reporter Hear from Coach Leach and others after their big win over the Oregon Ducks. \nIt's episode five of the SWX original program 'Press Pass Pullman' \nIn this week's show hear interviews from WSU Head Coach Mike Leach, Sophomore Quarterback Luke Falk, and Sophomore Linebacker Peyton Pelluer. Plus, Coach Leach talks about Christopher Columbus for the Student Question of the Week. \nCheckout 'Press Pass Pullman' in the above videos. Press Pass Pullman: Episode Five Hear from Coach Leach and others after their big win over the Oregon Ducks. In this week's show hear interviews from WSU Head Coach Mike Leach, Sophomore Quarterback Luke Falk, and Sophomore Linebacker Peyton Pelluer. Plus, Coach Leach talks about Christopher Columbus for the Student Question of the Week. More >> In this week's show hear interviews from WSU Head Coach Mike Leach, Sophomore Quarterback Luke Falk, and Sophomore Linebacker Peyton Pelluer. Plus, Coach Leach talks about Christopher Columbus for the Student Question of the Week. More >> WSU Beats Oregon for the First-Time Since 2006 For the first-time since 2003, Washington State beat the Oregon Ducks in Eugene. Luke Falk threw for season-high 505 yards and five touchdowns, including a momentary nail-biter that turned out to be the game winner, and the Cougars snapped an eight-game losing streak to the Ducks with a 45-38 victory in double overtime on Saturday. More >> Luke Falk threw for season-high 505 yards and five touchdowns, including a momentary nail-biter that turned out to be the game winner, and the Cougars snapped an eight-game losing streak to the Ducks with a 45-38 victory in double overtime on Saturday. More >> Gonzaga Gears Up for Basketball Season with Kraziness in the Kennel The Zags will be open the 2015-16 season with an exhibition against Eastern Oregon on Saturday, November 7th. The Gonzaga men's basketball team put on a show in front of a packed house at the Kraziness in the Kennel event at the McCarthey Athletic Center on Saturday afternoon. More >> The Gonzaga men's basketball team put on a show in front of a packed house at the Kraziness in the Kennel event at the McCarthey Athletic Center on Saturday afternoon. More >> Eagles Use 4th Quarter Comeback to Edge Cal Poly in OT The seventh-ranked Eastern Washington University football team rallied from a 15-point deficit in the fourth quarter to force overtime and then beat Cal Poly on Saturday. The seventh-ranked Eastern Washington University football team rallied from a 15-point deficit in the fourth quarter to score 22 unanswered points in the final 5:11 of regulation and in overtime to top Cal Poly and the top rushing offense in the nation 42-41 in a Big Sky Conference showdown Saturday. More >> The seventh-ranked Eastern Washington University football team rallied from a 15-point deficit in the fourth quarter to score 22 unanswered points in the final 5:11 of regulation and in overtime to top Cal Poly and the top rushing offense in the nation 42-41 in a Big Sky Conference showdown Saturday. More >> Whitworth Stays Perfect With 24-7 Win Over UPS Whitworth controlled the clock and the field position to improve to 5-0 overall and 2-0 in the NWC this season. Whitworth University controlled the field position and the clock during a 24-7 Northwest Conference football win at Puget Sound on a windy, rainy day at Baker Stadium. More >> Whitworth University controlled the field position and the clock during a 24-7 Northwest Conference football win at Puget Sound on a windy, rainy day at Baker Stadium. More >> Wednesday, October 7 2015 2:30 AM EDT 2015-10-07 06:30:15 GMT Jacob Thorpe of the Spokesman-Review shares his thoughts on the Cougars' football season. SWX's John Collett is joined by WSU Beat Writer Jacob Thorpe to talk about Washington State's loss to California and look ahead to Saturday's game against Oregon. More >> SWX's John Collett is joined by WSU Beat Writer Jacob Thorpe to talk about Washington State's loss to California and look ahead to Saturday's game against Oregon. More >> Tuesday, October 6 2015 8:38 PM EDT 2015-10-07 00:38:23 GMT Gonzaga Senior Kyle Wiltjer averaged 16.8 points per game last season. Gonzaga men's basketball player Kyle Wiltjer was named the CBS Sports Preseason Player of the Year, CBSSports.com announced Tuesday. More >> Gonzaga men's basketball player Kyle Wiltjer was named the CBS Sports Preseason Player of the Year, CBSSports.com announced Tuesday. More >> Episode Four of Press Pass Pullman Washington State is now 2-2 after their 34-28 loss to California on Saturday. Fresh off a 34-28 loss to the California Golden Bears, get the latest from the Washington State Cougars in the SWX Original Program 'Press Pass Pullman' More >> Fresh off a 34-28 loss to the California Golden Bears, get the latest from the Washington State Cougars in the SWX Original Program 'Press Pass Pullman' More >> Arkansas St. Runs Away From Idaho 49-35 Idaho falls to 0-2 in Sun Belt Conference play after 49-35 loss to Arkansas State. Michael Gordon ran for three touchdowns to lead Arkansas State to a 49-35 win over Idaho in Sun Belt Conference play on Saturday night. More >> Michael Gordon ran for three touchdowns to lead Arkansas State to a 49-35 win over Idaho in Sun Belt Conference play on Saturday night. More >> Whitworth Takes NWC Opener Over George Fox Whitworth built a 27-0 halftime lead and cruised to a 37-14 win over visiting George Fox on Saturday in the Pine Bowl in the Northwest Conference opener for both schools. Whitworth built a 27-0 halftime lead and cruised to a 37-14 win over visiting George Fox on Saturday in the Pine Bowl in the Northwest Conference opener for both schools. More >> Whitworth built a 27-0 halftime lead and cruised to a 37-14 win over visiting George Fox on Saturday in the Pine Bowl in the Northwest Conference opener for both schools. More >> Spokane, Coeur d'Alene and surrounding areas. More >> Spokane, Coeur d'Alene and surrounding areas. Breaking news, weather and community information for Billings, MT and surrounding areas. More >> Billings, Mont. and surrounding area, including northern Wyoming. Press Pass Pullman: Episode Five Hear from Coach Leach and others after their big win over the Oregon Ducks. In this week's show hear interviews from WSU Head Coach Mike Leach, Sophomore Quarterback Luke Falk, and Sophomore Linebacker Peyton Pelluer. Plus, Coach Leach talks about Christopher Columbus for the Student Question of the Week. More >> In this week's show hear interviews from WSU Head Coach Mike Leach, Sophomore Quarterback Luke Falk, and Sophomore Linebacker Peyton Pelluer. Plus, Coach Leach talks about Christopher Columbus for the Student Question of the Week. More >> WSU Beats Oregon for the First-Time Since 2006 For the first-time since 2003, Washington State beat the Oregon Ducks in Eugene. Luke Falk threw for season-high 505 yards and five touchdowns, including a momentary nail-biter that turned out to be the game winner, and the Cougars snapped an eight-game losing streak to the Ducks with a 45-38 victory in double overtime on Saturday. More >> Luke Falk threw for season-high 505 yards and five touchdowns, including a momentary nail-biter that turned out to be the game winner, and the Cougars snapped an eight-game losing streak to the Ducks with a 45-38 victory in double overtime on Saturday. More >> Wednesday, October 7 2015 2:30 AM EDT 2015-10-07 06:30:15 GMT Jacob Thorpe of the Spokesman-Review shares his thoughts on the Cougars' football season. SWX's John Collett is joined by WSU Beat Writer Jacob Thorpe to talk about Washington State's loss to California and look ahead to Saturday's game against Oregon. More >> SWX's John Collett is joined by WSU Beat Writer Jacob Thorpe to talk about Washington State's loss to California and look ahead to Saturday's game against Oregon. More >> Episode Four of Press Pass Pullman Washington State is now 2-2 after their 34-28 loss to California on Saturday. Fresh off a 34-28 loss to the California Golden Bears, get the latest from the Washington State Cougars in the SWX Original Program 'Press Pass Pullman' More >> Fresh off a 34-28 loss to the California Golden Bears, get the latest from the Washington State Cougars in the SWX Original Program 'Press Pass Pullman' More >> Goff Leads Cal Past WSU 34-28 in Pac-12 Opener Jared Goff threw four touchdowns in Cal's 34-28 win over WSU. Jared Goff got off to a shaky start and still threw for 390 yards and four touchdowns to lead No. 24 California to a 34-28 victory over Washington State on Saturday in the Golden Bears' first game as a ranked team in six years. More >> Jared Goff got off to a shaky start and still threw for 390 yards and four touchdowns to lead No. 24 California to a 34-28 victory over Washington State on Saturday in the Golden Bears' first game as a ranked team in six years. More >> Press Pass Pullman: Episode Three It's Episode Three of Press Pass Pullman. Fresh off Washington State's lone bye week of the season, hear from WSU Head Coach Mike Leach and the rest of the team as they prepare for Saturday's game at California. More >> Fresh off Washington State's lone bye week of the season, hear from WSU Head Coach Mike Leach and the rest of the team as they prepare for Saturday's game at California. More >> Jacob Thorpe Talks WSU Football With Non-Conference Play Winding Down The Spokesman-Review's Jacob Thorpe shares his thoughts on WSU Football after the Cougars move to 1-1 on the season. WSU Beat Writer Jacob Thorpe breaks down the Rutgers win for the Cougars and looks forward to Saturday's match up with Wyoming. More >> WSU Beat Writer Jacob Thorpe breaks down the Rutgers win for the Cougars and looks forward to Saturday's match up with Wyoming. More >> WSU's Falk Earns Pac-12 Offensive Player of the Week Honors Luke Falk earned Pac-12 Offensive Player of the Week honors after leading the Cougars past Rutgers. After leading his team to a crucial road win at Rutgers on Saturday, Washington State quarterback Luke Falk has been named the Pac-12 Offensive Player of the Week. Falk threw for a season-high 478 yards, completing 47-of-66 passes with four touchdowns and no interceptions in Washington State's come-from-behind, 37-34 win over the Scarlet Knights. More >> After leading his team to a crucial road win at Rutgers on Saturday, Washington State quarterback Luke Falk has been named the Pac-12 Offensive Player of the Week. Falk threw for a season-high 478 yards, completing 47-of-66 passes with four touchdowns and no interceptions in Washington State's come-from-behind, 37-34 win over the Scarlet Knights. More >> Falk Leads Washington State to Dramatic Win at Rutgers Luke Falk and the WSU football team took down Rutgers on Saturday. PISCATAWAY, N.J. (AP) - Luke Falk led a 10-play, 90-yard touchdown drive, finding River Cracraft with an eight-yard strike with :13 left to lift Washington State past Rutgers, 37-34 Saturday. Falk threw for 468 yards and four touchdowns. More >> PISCATAWAY, N.J. (AP) - Luke Falk led a 10-play, 90-yard touchdown drive, finding River Cracraft with an eight-yard strike with :13 left to lift Washington State past Rutgers, 37-34 Saturday. Falk threw for 468 yards and four touchdowns. More >>", "external_links": [], "published": "2015-10-13T07:36:00.000+03:00", "crawled": "2015-10-13T08:31:48.049+03:00", "highlightTitle": ""}