{"organizations": ["Bradshaw Mountain", "Mingus", "AM Prep Football Black & Blue Rivalry", "Mingus Union", "Black & Blue", "Black & Blue Rivalry Fact Sheet  Tonight", "Bradshaw", "AIA", "Badgers", "Collett said.The Badgers"], "uuid": "6dbb12ed6e713648f705bd925e125580130d6339", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "dcourier.com", "main_image": "http://dcourier.com/SiteImages/Article/151128a.jpg", "site_section": "http://www.dcourier.com/2_rss.xml", "section_title": "The Daily Courier RSS Feeds: Sports", "url": "http://dcourier.com/Main.asp?SectionID=2&SubSectionID=2&ArticleID=151128", "country": "US", "title": "Black & Blue Rivalry: Bragging rights, playoff lives at stake once again as Bradshaw visits Prescott tonight", "performance_score": 0, "site": "dcourier.com", "participants_count": 0, "title_full": "Black & Blue Rivalry: Bragging rights, playoff lives at stake once again as Bradshaw visits Prescott tonight", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T16:02:00.000+03:00", "replies_count": 0, "uuid": "6dbb12ed6e713648f705bd925e125580130d6339"}, "author": "", "url": "http://dcourier.com/Main.asp?SectionID=2&SubSectionID=2&ArticleID=151128", "ord_in_thread": 0, "title": "Black & Blue Rivalry: Bragging rights, playoff lives at stake once again as Bradshaw visits Prescott tonight", "locations": ["Shepard Field", "Peach", "Walkup Skydome", "Prescott Valley", "Flagstaff"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ryan Greene", "Daniel Otero", "John Trout", "Justin Castro", "Jared Woodruff", "Drue Scully", "Mike McMahon", "Prescott", "Lou Beneitone", "Louis Cruz", "Skylor Clinton", "Shane Sorrells", "Bradshaw", "Gunner Bundrick", "David", "R.J. Aguilar", "Collett", "Luke Roberts", "Brandon Comeno.Bundrick", "Nate Hayter", "Bill White", "Roberts", "Sorrells", "Doug Cook", "Steve Moran", "David Moran", "Mingus", "Kyle Peach", "Audsley", "John Rodriguez", "Derek Knotek", "Bill Gahn", "David Pearce", "Cruz", "Chuck Apap", "Tyler Audsley", "Bundrick", "Cody Collett", "Moran", "Christian Setter"], "text": "10/23/2015 6:02:00 AM Prep Football Black & Blue Rivalry: Bragging rights, playoff lives at stake once again as Bradshaw visits Prescott tonight Courier photos/composite On the left, Bradshaw senior John Trout (#77), Off./Def. Lineman, lines up against Prescott senior Louis Cruz (#50), Off./Def. Lineman. Black & Blue Rivalry Fact Sheet  Tonight's game is at 7 p.m. at Bill Shepard Field in Prescott. Prescott leads the series, 17-5. Prescott wins by an average score of 28-16. (585 total points for Prescott; 370 total points for Bradshaw Mountain) 8 of the 22 games have been decided by a TD or less. The highest scoring game occurred in 2005 when PHS won, 42-31. The lowest scoring game occurred in 2002 when PHS won, 13-6. Coaching records include: Bill Gahn, PHS (3-0); Bill White, PHS (1-0); Lou Beneitone, PHS (10-4); Steve Moran, Bradshaw (1-4); Steve Moran, PHS (1-0); John Rodriguez, Bradshaw (0-3); Mike McMahon, Bradshaw (0-4); Chuck Apap, Bradshaw (3-4); Cody Collett, PHS (2-1); Jared Woodruff, Bradshaw (0-1); David Moran, Bradshaw (1-0). Doug Cook The Daily Courier PRESCOTT - For the Prescott and Bradshaw Mountain high school football teams, the 23rd annual \"Black & Blue\" rivalry game today, Oct. 23, at Bill Shepard Field means more than bragging rights and capturing the 19 Cup trophy.Both squads are in AIA's Division III, Section VIII. And over the past few years, they've battled as much for the section championship and an automatic berth into the D-III state tournament as anything.So, let's start with the Badgers and what they must do to qualify for the 16-team state playoffs in November.D-III No. 26-ranked Prescott enters today's tilt with a 1-1 section record. If the Badgers beat No. 14 Bradshaw (2-1) and section-leading No. 12 Mingus Union (2-0) at home Oct. 30, they can win the section outright provided either Mingus or Coconino (0-3) defeats Flagstaff (1-1). The Eagles upset Prescott Oct. 16 at Walkup Skydome, muddying the section title picture.\"We have to win the last two (games to make the playoffs),\" Badgers coach Cody Collett said. \"We knew we pretty much had to win the section to get in.\"Like Prescott, Mingus, which faces Flagstaff today, controls its playoff fate.However, two-time defending section champion Bradshaw, a 20-15 loser at Mingus in its section opener Oct. 2, must beat Prescott and hope Mingus loses twice (vs. Flagstaff and Prescott) to claim a third straight title. That's a tall order not lost on Bradshaw coach David Moran or Bears senior lineman John Trout, but accepted by both.\"This team, all through summer and all through even last year, we've just been building and building and building,\" Trout said. \"And every time we'd face adversity, we might get pushed back a little bit, but we'd come together as a team and fight it even harder.\"The Bears might still qualify for the playoffs as an at-large team even if they don't win the section. Bradshaw closes the regular season at D-III No. 8 Maricopa.\"Since Mingus, we've regrouped and we're a better football team than we were two to three weeks ago,\" Moran said. \"We have not changed anything in our approach this week. Our kids know what we expect, and that's to play Bradshaw football.\"Added Trout, \"Right now I think more of our focus is on playoffs. If we win out, then we might go to playoffs.\"***Prescott enters tonight's game healthy after struggling with injuries throughout the preseason in August, Collett said.The Badgers admit they overlooked Flagstaff Oct. 16 - the same Eagles squad Bradshaw crushed 44-14 at home Oct. 9. Collett accepts the blame for the 36-6 loss, which snapped a five-game winning streak.\"There will not be any excuses,\" Collett said. \"We'll be ready to play. We've had a great week of practice.\"It's likely that whichever team's offense commits the fewest turnovers and penalties will win the 2015 rivalry game. Prescott and Bradshaw possess swarming defenses gifted at causing turnovers.Badgers senior offensive right tackle/nose guard Louis Cruz said whichever team puts forth the best effort will win.\"It's just going to be a fun game for us,\" he added. \"This is probably one of the hardest weeks we've practiced. There's a lot more tension during practices.\" Prescott and Bradshaw's offenses aren't as potent as they were in 2014. Skylor Clinton, the Badgers' do-everything tailback and leading scorer last fall, graduated in the spring. Tyler Audsley and Shane Sorrells, the Bears' 'lightning and thunder' backfield combination of leading scorers, also graduated.One could argue Prescott's run-dominated, spread-like offense has gained balance in 2015, though, as junior tailback Christian Setter, who has run for nearly 1,000 yards, and sophomore quarterback Ryan Greene form a two-headed rushing threat behind a decent line. And senior wideouts Derek Knotek and Nate Hayter have bolstered the Badgers' receiving corps.\"Offensively, they've got some good weapons there - more than the last couple years,\" said Moran, who's coaching in his third rivalry game after playing in three of them as a Bear in the early- to mid-1990s. \"They're spreading the ball around more, and Setter has done well for them.\"In his fourth year as Badgers coach, Collett's done a yeoman's job of shaping high-scoring offenses. This year, he's had few upperclassmen, and yet the unit has developed quickly.Some critics might disagree. At Flagstaff, for example, Prescott digressed - committing a handful of turnovers. Will that come back to bite a green PHS unit again this week?\"We didn't play right (at Flagstaff),\" Cruz said. \"Anything that could've went wrong, went wrong that night. (Friday's rivalry game) is our way of showing that we're not done yet. Any team that we're going to play, like Mingus or Bradshaw, is going be thinking that we're going to quit after that loss, because it was such a tough loss. It's our time to come back.\"Bradshaw's so-called 'Black Plague' defense is disciplined and sturdy, though, even without standout senior linebacker Drue Scully, who was lost for the year with a broken leg at Mingus.\"We have to not turn the ball over,\" Collett said. \"We usually win the turnover battle.\"Offensively, Bradshaw lost more than Prescott in the off-season minus Audsley and Sorrells. The Bears have relied more on junior quarterback Gunner Bundrick - a gifted athlete who can run, and who's not afraid to absorb a hit or dish one.\"We need to keep Bundrick in the pocket,\" Collett said.Bears tailback Justin Castro has progressed in recent weeks after a rough start, as have wideouts David and Daniel Otero, and Brandon Comeno.Bundrick has not been a particularly efficient passer this season, partly because of his tendency to overthrow, and partly because open receivers have dropped balls. But there's no denying that Bundrick has a gun for an arm. And if he gets hot, he's difficult to contain.That's where the Prescott defense's speed on the edge should help against Bradshaw's spread.If Badgers such as senior inside linebacker Kyle Peach (seven interceptions, including three for TDs) and star outside LBs Luke Roberts and David Pearce are free to roam, Bradshaw could struggle.Expect Prescott's improved defensive line to blitz Bundrick and try to force him into bad passes that Peach and Roberts would be waiting in the wings to snare.\"Our defense has done a really good job forcing turnovers and with tackles for loss,\" Collett said. \"It's better suited for spread-type teams (like Bradshaw's).\"Collett added that Bundrick's \"a great player,\" and Bradshaw's veteran offensive line is \"strong.\" Bradshaw senior o-lineman Trout, who doubles as a d-lineman, anchors the unit alongside fellow senior R.J. Aguilar.\"Trout is one of the better two-way linemen I've seen in a while,\" Collett said.***This season, Prescott is 3-0 at home, while Bradshaw's 2-1 on the road. In this game, you throw away those numbers - even though the Badgers are 8-3 at Shepard Field in this series.What was once a lopsided rivalry in Prescott's favor has leveled out over the past eight years. Since 2007, each team owns a 4-4 record against the other. The Badgers lead the all-time series 17-5.Collett is 2-1 as head coach against Bradshaw, winning blowouts in his first two meetings before suffering a 29-7 loss in 2014 in Prescott Valley. During that time, Prescott's made the state playoffs once, while Bradshaw's qualified twice.Moran was defensive coordinator at Bradshaw in 2013 and interim coach in 2014 before becoming head coach in 2015. As a former Bears star quarterback and defensive back, Moran has perhaps had as much vested in this series as anyone.\"Our boys are prepared for Friday night,\" Moran said. \"It's a big game for both programs, and it's always been competitive.\"", "external_links": [], "published": "2015-10-23T16:02:00.000+03:00", "crawled": "2015-10-23T18:58:37.194+03:00", "highlightTitle": ""}