{"organizations": ["Detroit Lions", "NFL", "A.J. Green", "Packers", "Chicago Bears"], "uuid": "ac7b6f863ea3788e14b0dba3adda078df7c479f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailyherald.com", "main_image": "http://www.dailyherald.com/storyimage/DA/20151022/sports/151029612/AR/0/AR-151029612.jpg&amp;updated=201510221043&amp;imageversion=Facebook&amp;exactH=630&amp;exactW=1200&amp;exactfit=crop&amp;noborder", "site_section": "http://www.dailyherald.com/rss/rss.asp?section=sports_prep_top5", "section_title": "DailyHerald.com  > sports_prep_top5", "url": "http://www.dailyherald.com/article/20151022/sports/151029612/", "country": "US", "title": "What will it cost Chicago Bears to keep Alshon Jeffery?", "performance_score": 0, "site": "dailyherald.com", "participants_count": 0, "title_full": "What will it cost Chicago Bears to keep Alshon Jeffery?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T17:43:00.000+03:00", "replies_count": 0, "uuid": "ac7b6f863ea3788e14b0dba3adda078df7c479f5"}, "author": "", "url": "http://www.dailyherald.com/article/20151022/sports/151029612/", "ord_in_thread": 0, "title": "What will it cost Chicago Bears to keep Alshon Jeffery?", "locations": ["South Carolina"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Cutler", "Bob", "Green", "Jay Cutler", "Alshon Jeffery", "Alshon", "Jeffery", "Darius Slay", "Randall Cobb", "Jordy Nelson", "Matt Forte"], "text": "The Bears will soon have a big decision to make on Alshon Jeffery. Big, as in how big of a contract they're willing to offer the four-year veteran when his rookie contract expires after this season. Jeffery is the most dangerous big-play weapon on the Bears' roster -- maybe the only one. It has been apparent in the first six games this season just how important the 2013 Pro Bowl wide receiver is to the Bears' offensive attack. In the two games that Jeffery played -- Week One and Week Six -- the Bears averaged 423 yards of total offense and 28.5 points. In the four that he missed with a hamstring injury, the Bears averaged 295 yards and 20.7 points. \"If you watched the game, just catching the ball down the field, (he's) a down-the-field threat,\" Bears running back Matt Forte said after Jeffery returned to the lineup and caught 8 passes for 147 yards and 1 touchdown against the Detroit Lions. \"We've been dinking and dunking a little bit. Q (Marquess Wilson) was able to stretch the field a little bit, too, but Alshon being in there, he was able to catch the ball down the field a lot and open it up for some of the other guys in the passing game, too.\" The Bears lost both games in which Jeffery played, but that had more to do with the 68 points they allowed than anything else. The Lions game was vintage Jeffery, even though he had missed four straight weeks of practice. He set up a field goal with a 45-yard reception on a deep jump ball on which he easily outmaneuvered cornerback Darius Slay. Then, with 21 seconds left in regulation and starting from his own 20-yard line, quarterback Jay Cutler went to Jeffery along the sideline on back-to-back plays that picked up 25 and 24 yards. \"He's just a difference-maker,\" Cutler said. \"You get Alshon over there, and he makes you feel comfortable. He can win the jump ball one-on-one more times than not and good things will happen.\" In the previous two seasons, the 6-foot-3, 216-pound second-round pick out of South Carolina caught 89 passes for 1,421 yards and 7 touchdowns in 2013 and followed that up with 85 catches for 1,133 yards and 10 TDs last season. While he played all 32 games in those two seasons, there now are durability concerns because Jeffery missed all four preseason games this year, as well as four regular-season games that matter. As a rookie, he missed three games with a hand injury and two with a sprained knee. If he stays healthy for the remainder of this season, however, his value won't be diminished by durability concerns. So, the questions looms: How much is a big, rangy, 1,000-yard Pro Bowl wide receiver with a huge catch radius who's just 25 years old worth on the open market? The Packers gave Jordy Nelson a four-year, $39.05 million deal before this season, and he's five years older than Jeffery. A closer comparison might be the Packers' Randall Cobb, who got $40 million over four years. He's 25, too, and has numbers similar to Jeffery. A month ago, A.J. Green got $60 million over four years, but he's more durable and has been more productive than Jeffery for twice as long. At 27, Green appears on his way to a fifth straight 1,000-yard season. So, the guess here is that Jeffery costs the Bears $50 million for four years. With all the other holes they have to fill, it's a price the Bears might have to pay. • For more on the Bears, visit chicagofootball.com, and follow Bob's NFL and Bears reports on Twitter @BobLeGere. Get great articles like this sent to your inbox!", "external_links": [], "published": "2015-10-22T17:43:00.000+03:00", "crawled": "2015-10-22T23:07:10.044+03:00", "highlightTitle": ""}