{"organizations": [], "uuid": "96a10a019f826e7ff2b02ea17ba1555902da0d44", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48531/c", "section_title": "Sports - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30224108/glassesoffs-new-dynamic-game-like-technology-shows-significant-improvement-in-visual-parameters-critical-for-sport-performance", "country": "US", "title": "GlassesOff's New Dynamic Game-Like Technology Shows Significant Improvement in Visual Parameters Critical for Sport Performance", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "GlassesOff's New Dynamic Game-Like Technology Shows Significant Improvement in Visual Parameters Critical for Sport Performance - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "96a10a019f826e7ff2b02ea17ba1555902da0d44"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30224108/glassesoffs-new-dynamic-game-like-technology-shows-significant-improvement-in-visual-parameters-critical-for-sport-performance", "ord_in_thread": 0, "title": "GlassesOff's New Dynamic Game-Like Technology Shows Significant Improvement in Visual Parameters Critical for Sport Performance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " GlassesOff Inc.\nNew study will be presented today at the Federation of European Neuroscience Societies(FENS) meeting.\nNEW YORK , October 9, 2015 /PRNewswire/ --\nGlassesOff Inc. (OTCBB: GLSO) announced today the results of a new study among young people that showed significant improvement across multiple visual performance parameters, consistent with an increase in visual processing speed. Visual processing speed is considered critical for superior athletic performance in sports that require swift reaction time.\nThe new study demonstrated that playing a simple, dynamic mobile game with GlassesOff's new dynamic technology could result in a significant real-life increase in visual processing speed. In addition, the required daily game-playing duration was successfully decreased to approximately five minutes, a 50% decrease from the older-generation GlassesOff platform technology.\nThe study included 20 young adults with normal or corrected-to-normal vision in both eyes. All participants completed a total of 40 sessions, and their vision performance was tested before and after the study. Following the use of GlassesOff's new dynamic game-like technology, participants achieved significant improvement in both far and near visual performance, such as visual acuity, reaction time, stereo acuity and contrast sensitivity. This improvement, together with improvement in temporal masking is consistent with an increase of visual processing speed.\nNimrod Madar , CEO of GlassesOff, said: \"When we first set out to develop a new product aiming to improve professional and recreational athletes' performance, it was clear that we needed to develop a product that doesn't only demonstrate scientific efficacy, but is also fun to use. We are very pleased with the new generation of our technology, and we continue to focus on the planned launch of our sports application, as well as the anticipated launch of a new GlassesOff™ reading improvement product, which we expect will also use this new platform. With these new launches, we plan on offering our clients, both those seeking to improve in sports and reading, a dynamic and fun game experience that delivers significant value in about five minutes of daily game play.\"\nGlassesOff will present the findings from the study today, Friday October 9 , at the Federation of European Neuroscience Societies (FENS) meeting, in Thessaloniki, Greece at 1:40 PM local time.\nAbout FENS\nFounded in 1998 at the first Forum of European Neuroscience, the Federation of European Neuroscience Societies (FENS) is the main organization for neuroscience in Europe . FENS currently represents 42 European national and mono-disciplinary neuroscience societies with close to 23,000 member scientists from 32 European countries.\nAbout GlassesOff\nGlassesOff Inc. (OTCBB:GLSO) is public, a neuroscience technology company, utilizing patented technology to develop and commercialize consumer-oriented software applications. The Company is developing and commercializing next generation vision performance applications. GlassesOff has developed a proprietary, patent protected neuroscience technology platform to improve near vision performance through brain exercise, by improving the image processing function in the visual cortex of the brain. http://www.glassesoff.com .\nSafe Harbor Statement: This press release contains forward-looking statements, which may be identified by words such as \"expects,\" \"plans,\" \"projects,\" \"will,\" \"may,\" \"anticipates,\" \"believes,\" \"should,\" \"would,\" \"intends,\" \"estimates,\" \"suggests,\" \"has the potential to\" and other words and phrases of similar meaning, including statements regarding the results of effectiveness of GLASSESOFF's applications. Investors are cautioned that forward-looking statements involve risks and uncertainties that may affect GLASSESOFF's business and prospects, including the risks that GLASSESOFF may not succeed in generating any revenues or developing any commercial products, that the products may not achieve the expected results or effectiveness, and other risks and uncertainties that may cause results to differ materially from those set forth in the forward-looking statements. In addition to the risk factors described above, investors should consider the economic, competitive, governmental, technological and other factors discussed in GLASSESOFF's filings with the Securities and Exchange Commission. The forward-looking statements contained in this press release speak only as of the date the statements were made, and we do not undertake any obligation to update forward-looking statements, except as required under applicable law.\n ", "external_links": ["http://www.xmlnews.org/ns/", "http://rt.prnewswire.com/rt.gif?NewsItemId=enUK201510092276A&Transmission_Id=201510090808PR_NEWS_USPR_____enUK201510092276A&DateId=20151009"], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-09T23:37:25.245+03:00", "highlightTitle": ""}