{"organizations": [], "uuid": "f3475753a9069a17e42aac4fadd01b93ec595617", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/2/8/161328/World/Region/Four-held-in-Turkey-over-Ankara-attack,-bomber-ide.aspx", "country": "EG", "title": "Four held in Turkey over Ankara attack, bomber identified - Region - World", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Four held in Turkey over Ankara attack, bomber identified - Region - World - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "f3475753a9069a17e42aac4fadd01b93ec595617"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/2/8/161328/World/Region/Four-held-in-Turkey-over-Ankara-attack,-bomber-ide.aspx", "ord_in_thread": 0, "title": "Four held in Turkey over Ankara attack, bomber identified - Region - World", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Turkish police arrest 50 in Ankara bombing probe Death toll in Ankara attack rises to 102: Prosecutors Ankara bombing attacks trail leads to homegrown jihadists ISIS prime suspect in Ankara bombing: Turkey PM A criminal court in Turkey has ordered the detention of four people over a deadly Ankara attack, as the country's PM said Monday that one of the two suicide bombers involved had been officially identified.\nThe suspects, remanded in custody after going before a judge on Sunday night, were charged with making \"explosive devices with the intention to kill\" and \"an attempt to disrupt constitutional order\", Anatolia news agency said Monday.\nThe Ankara prosecutor in charge of the case meanwhile released two other suspects and issued a warrant for nine others accused of playing a part in the October 10 attack that killed 102 people, the worst of its kind in Turkey's history.\nTurkish authorities have said ISIS group is the \"number one suspect\" for the attacks which targeted a pro-Kurdish and liberal peace rally calling for an end to hostilities between security forces and Kurdish rebels.\nPolice suspect the bombers were two young Turks from the city of Adiyaman in the south of the country, a stronghold for Islamist militants, according to Turkish media reports.\nOne was identified in the reports as Yunus Emre Alagoz, brother of the man who carried out a similar attack in July in Suruc, a town in southern Turkey on the border with Syria, that killed 34 people.\nThe other, identified as Omer Deniz Dundar, had twice been to Syria recently, the reports said.\nPrime Minister Ahmet Davutoglu confirmed Monday that one of the suicide bombers had been officially identified through DNA testing, but would not provide any details to avoid \"plunging people into panic\".\n\"One of the terrorists has been identified. We are exploring ties between the attacks on Suruc, Ankara and Diyarbakir,\" he said in a television interview.\nFive people were killed in Diyarbakir in June after a bomb exploded during a pre-election campaign rally for the pro-Kurdish Peoples' Democratic Party (HDP). One man was arrested for involvement in that attack.\nDavutoglu said a total of 768 people had been arrested over suspected links to ISIS since the Suruc attack in July, and pledged to track down those responsible for the latest atrocity.\nMany of those arrested have since been released.\nThe four remanded in custody on Sunday were part of a group originally detained due to suspicious posts on Twitter.\nAnkara prosecutors have banned the publication of materials relating to the investigation, and Davutoglu insisted that \"all words, all information which could plunge people into panic would help the terrorists\".\nThe head of the Islamic-rooted AF ruling party did, however, say he believed \"groups like Daesh, the PKK and DHKP-C... are working hand in hand to harm Turkey and drag it into chaos,\" referring ISIS group, the outlawed Kurdistan Workers' Party and the far-left Revolutionary People's Liberation Party-Front.\nPolice on Sunday arrested some 50 foreign nationals in a sweep targeting suspected ISIS fighters with alleged links to the bombings.\nTurkey is the main point of entry to Syria for ISIS recruits.\nThe attack has raised political tensions to new highs as Turkey prepares for a snap election on November 1, in a country that has become more polarised than ever.\nPressure has piled on President Recep Tayyip Erdogan, with opposition figures blaming him for security lapses over the Ankara attack and failing to crack down on ISIS.", "external_links": [], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-20T04:21:00.263+03:00", "highlightTitle": ""}