{"organizations": [], "uuid": "7449338d31fe520112b2dd6c936a36cb5a2cc816", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nydailynews.com", "main_image": "http://assets.nydailynews.com/polopoly_fs/1.2405938!/img/httpImage/image.jpg_gen/derivatives/landscape_1200/mob22n-1-web.jpg", "site_section": "http://www.nydailynews.com/news/index.html", "section_title": "Breaking, Local and National News, Sports &amp; Entertainment - NY Daily News", "url": "http://www.nydailynews.com/news/crime/goodfellas-mob-snitch-explains-betrayal-asaro-trial-article-1.2405940", "country": "US", "title": "'Goodfellas' mob snitch explains betrayal at Asaro trial", "performance_score": 0, "site": "nydailynews.com", "participants_count": 1, "title_full": "'Goodfellas' mob snitch explains betrayal at Asaro trial - NY Daily News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "7449338d31fe520112b2dd6c936a36cb5a2cc816"}, "author": "NEW YORK DAILY NEWS", "url": "http://www.nydailynews.com/news/crime/goodfellas-mob-snitch-explains-betrayal-asaro-trial-article-1.2405940", "ord_in_thread": 0, "title": "'Goodfellas' mob snitch explains betrayal at Asaro trial", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jane Rosenberg/for New York Daily News Gaspar Valenti, a Bonanno associate and father of Anthony (Fat Sammy) Valenti, testifies at Brooklyn Federal Court in connection with the Lufthansa \"Good Fellas\" heist on Tuesday. The Goodfella who helped pull off the biggest heist in U.S. history was a brokefella some 30 years later when he helped the feds set a trap for his cousin — Bonanno crime family captain Vincent Asaro.\nGaspare Valenti began secretly taping Asaro after they had a falling-out three decades after the infamous 1978 Lufthansa robbery that netted them and their crew $6 million in cash and jewelry.\n“Over money, as usual,” Valenti testified Wednesday, when asked at Asaro’s racketeering trial what their argument was about.\nTestifying in Brooklyn federal court, Valenti said that by 2010 he was out of cash and sick of the mob life.\n“I called the FBI,” he said. “I needed help financially to support my family. I was just tired of that life. I was having nightmares about things that I had experienced.”\nValenti said the FBI quickly quickly signed him up to be an informant and he agreed to wear a wire to tape Asaro.\nIn the meantime, Valenti said, the government paid his expenses, including the rent and electrical bill.\n“All this time you’re with me I never got you pinched,” Asaro told Valenti at the Esquire Diner in Ozone Park, Queens, unaware that his cousin is taping him.\nJANE ROSENBERG/REUTERS Vincent Asaro looks on as his trial begins in this court sketch from New York Monday. But Asaro, who is also charged with strangling a suspected snitch in 1969 with a dog chain, had also became a shadow of his formerly fearsome self, the tapes revealed.\nIn one taped conversation, Asaro revealed he was stuck playing Mr. Mom because his much-younger Chinese wife was shacked-up with her boyfriend. He complained he couldn’t do any robberies because he had to take care of the baby.\n“I mean, you’re tied down with the baby,” Asaro said.\nIn another, Asaro described his bleak existence.\n“I don’t usually come out early no more,” he said. “Where am I gonna go? I got no place to go. They brought me a nice striped bass last night.”\nIt was not immediately clear who “they” was.\nAsked where he hangs out, Asaro said he sometimes spent time at an Ozone Park bowling alley or at the Cafe Liberty, an old Gambino family social club on Liberty Ave.\nJoe Marino/New York Daily News Vincent Asaro (c.), being taken from FBI Headquarters in 2014. Asaro, was one of four organized crime associates arrested, and is believed to be involved in the infamous 1978 Lutfhansa Heist. “People hate me in there, I don’t pay my dues,” Asaro said.\nStill, Asaro could muster-up some menace when necessary.\nThere was a tape of Asaro shaking down a relative for a $3,000 share of a house of a deceased family member that had just been sold.\nOn still another tape, Asaro admitted he was at a Waldbaum’s in Howard Beach preparing for a more modest job.\n“I’m gonna make lentil soup,” he could be heard saying.\nThis was 68-year-old Valenti’s second day on the stand. And this time, his hulking son, Anthony (Fat Sammy) Valenti, was not in the courtroom starting daggers at this dad.\nThe hefty hoodlum told The Daily News earlier that he had come to show support for Asaro — not for his father, who broke the Mafia code of silence.\nKen Murray/AP Police cordon off an area around a stolen black van they suspect was used by thieves who escaped with more than $6 million in cash and jewels from JFK airport in December of 1978. Valenti told the court the JFK heist, which figured in the movie “Goodfellas,” was planned at Robert’s Lounge on Lefferts Blvd., a joint in Queens a short drive from the scene of the spectacular crime — Kennedy Airport. It’s now a Guyanese and Jamaican restaurant.\nEarlier, Valenti described in detail how the Lufthansa robbery went down. And he rattled off the names of the robbery crew that Asaro and legendary Luchese mobster James (Jimmy the Gent) Burke assembled.\nValenti also named Henry Hill, a mobster turned FBI informant whose biography was the basis of “Goodfellas.” And he revealed that deceased Gambino family chief John Gotti got a cut of the loot, even though he had nothing to do with the heist.\n“To keep peace among the families, we didn’t want retribution or anyone to rob us,” Valenti answered when asked why the Dapper Don got some of the dough.\nBut when Valenti described how some members of the crew “died and some went missing” after the robbery, federal Judge Allyne Ross told the jury “to ignore the last comment.”\nRoss ruled earlier that prosecutors cannot tell the jury about the bloodbath because the elder Burke was responsible for whacking a half-dozen members of the crew, not Asaro.\njmarzulli@nydailynews.com", "external_links": [], "published": "2015-10-21T03:00:00.000+03:00", "crawled": "2015-10-21T22:35:07.314+03:00", "highlightTitle": ""}