{"organizations": [], "uuid": "db70c2b225bc752e7f5a8e5b783c31d5a38d8f86", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.operationsports.com", "main_image": "", "site_section": "http://www.operationsports.com/rss.xml", "section_title": "Operation Sports", "url": "http://www.operationsports.com/newspost.php?id=859650", "country": "US", "title": "Rory McIlroy PGA TOUR To Add New Golfers, Modes and Courses Between Now & March", "performance_score": 0, "site": "operationsports.com", "participants_count": 1, "title_full": "Rory McIlroy PGA TOUR To Add New Golfers, Modes and Courses Between Now & March", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T20:02:00.000+03:00", "replies_count": 0, "uuid": "db70c2b225bc752e7f5a8e5b783c31d5a38d8f86"}, "author": "Steve_OS", "url": "http://www.operationsports.com/newspost.php?id=859650", "ord_in_thread": 0, "title": "Rory McIlroy PGA TOUR To Add New Golfers, Modes and Courses Between Now & March", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Rory McIlroy PGA TOUR To Add New Golfers, Modes and Courses Between Now & March 12:02 PM - October 12, 2015 by Steve_OS EA Sports will be adding new free content for Rory McIlroy PGA TOUR, including new golfers, modes and courses. No specific dates have been given for the content, but they promise to release it between now and the end of March, 2016. Check out the details below. Golfers: Dustin Johnson, Henrik Stenson Fantasy Course: Treasure Island Real-World Courses: Quail Hollow (North Carolina), TPC Stadium at PGA West (California), Oakmont Country Club (Pennsylvania) New Play Now Modes: Skins, Four Ball, Alternate Shot and Best Ball # 1 Thrash13 @ 10/12/15 12:17 PM Free content is free content! I'm a huge fan of Dustin Johnson, and Quail Hollow is one of my favorite golf courses. I can't wait to see how great it looks on the PS4. The same goes for the other new courses as well, even the new fantasy course. Haha Lastly, the added modes will definitely help freshen things up a bit. This is stuff that probably should've been in the original game, but I'll take it and be happy for sure! # 2 CRIP4LIFE @ 10/12/15 12:39 PM Quote: New Play Now Modes: Skins, Four Ball, Alternate Shot and Best Ball i just want these in online modes so with can play with/against our friends. who ever heard of a golf game where you cant play 2v2 and skins foursomes WITH YOUR FRIENDS? and i definitely miss me and a friend coop ranked against 2 other humans in alt shot or best ball. # 3 Dazraz @ 10/12/15 01:35 PM Would love to see Quick Tournaments return as an Offline Mode. # 4 davis420 @ 10/12/15 02:40 PM I know free is free but I feel like we won't see this until around December at the earliest. # 5 Golfsprince @ 10/12/15 02:43 PM Quote: Originally Posted by Thrash13 Free content is free content! I'm a huge fan of Dustin Johnson, and Quail Hollow is one of my favorite golf courses. I can't wait to see how great it looks on the PS4. The same goes for the other new courses as well, even the new fantasy course. Haha Lastly, the added modes will definitely help freshen things up a bit. This is stuff that probably should've been in the original game, but I'll take it and be happy for sure! From what I understand, the dev team had to learn the Frostbite engine and it took them a long time to get used to it. Now that they're used to it, they'll be able to add more content which is nice. Also, from what Justin Patel has said, the game modes will be out possibly by not this upcoming update, but the update after. Treasure Island will be in the next update according to Justin Patel. # 6 smitty67 @ 10/12/15 04:22 PM I'm glad to see all of this being added. I would like a real Tour schedule now that more courses are being added, but, hey, having the US Open course will be nice. Since all of this is happening between now and March, could we possibly see Augusta added by April? # 7 tjhamstar @ 10/12/15 05:15 PM Plenty of games to keep me busy in the meantime. Excited to just hear of the new content being planned. Hoping new game modes will be added to online as well at some point.", "external_links": [], "published": "2015-10-12T20:02:00.000+03:00", "crawled": "2015-10-13T04:11:08.361+03:00", "highlightTitle": ""}