{"organizations": [], "uuid": "467a01de0d3b4aad5b2693f43e71f791b0a41320", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-562564f2/turbine/ct-charm-northlight-review-ent-1020-20151019", "site_section": "http://www.chicagotribune.com/", "section_title": "Chicago Tribune: Chicago breaking news, sports, business, entertainment, weather and traffic - Chicago Tribune", "url": "http://www.chicagotribune.com/entertainment/theater/reviews/ct-charm-northlight-review-ent-1020-20151019-column.html", "country": "US", "title": "&apos;Charm&apos; review: New play about LGBTQ youth is a real charmer - Chicago Tribune", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "&apos;Charm&apos; review: New play about LGBTQ youth is a real charmer - Chicago Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T00:48:00.000+03:00", "replies_count": 0, "uuid": "467a01de0d3b4aad5b2693f43e71f791b0a41320"}, "author": "Chris Jones", "url": "http://www.chicagotribune.com/entertainment/theater/reviews/ct-charm-northlight-review-ent-1020-20151019-column.html", "ord_in_thread": 0, "title": "&apos;Charm&apos; review: New play about LGBTQ youth is a real charmer - Chicago Tribune", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In 2012, Tribune columnist Dawn M. Turner introduced Chicago to Gloria Allen, a 66-year-old transgender Chicagoan, who regularly ate lunch at the Center on Halsted with other senior members of the lesbian, gay, transgender, bisexual and questioning/queer community. Allen, who is African-American, cast her discriminating and experienced eye upon some of the young people who were frequenting the center and found them lacking in comportment, table manners and etiquette. Thus Allen started teaching a class therein.\nA charm school, if you like, for LGBTQ youth.\nAllen, widely called \"Mama Gloria,\" thus became the Emily Post of Halsted Street, offering young people guidance in dressing appropriately, interacting politely, taking care of their skin, making introductions. Northlight Theatre Artistic Director BJ Jones read that column and brought it to the attention of Chicago writer Philip Dawkins, who showed up at one of Mama Gloria's classes, notebook in hand.\nThe fictionalized result opened Sunday night in Steppenwolf's Garage Theatre (although this is technically a Northlight Theatre production). And \"Charm,\" as this world premiere is called, is not only charming but has the potential to be a real hit.\nThe idea of an unconventional but caring teacher uniting an initially hostile and fragmented group of students, along with similarly skeptical administrators, is not a new idea, of course. \"Dead Poets Society,\" \"School of Rock\" and \"Stand and Deliver\" all plow that same field. But the reason Hollywood keeps repeating the formula is that it works. I think, deep down, we all love great teachers and feel guilty about how little they are valued in American society.\nAnd \"Charm,\" which would make an excellent movie, has the advantage of being about a group of students unlike any of those previous class rosters.\nHanding down lessons learned on her journey: Transgender senior teaches tricks of the trade to a new generation at LGBT charm school Dawn Turner Trice About a year ago, a retired Gloria Allen thought having lunch at the Center on Halsted with other lesbian, gay, bisexual and transgender senior citizens was simply one of the highlights of her week.\nBut while at the center, which offers an array of youth services for the LGBT community, Allen,...\nAbout a year ago, a retired Gloria Allen thought having lunch at the Center on Halsted with other lesbian, gay, bisexual and transgender senior citizens was simply one of the highlights of her week.\nBut while at the center, which offers an array of youth services for the LGBT community, Allen,...\n(Dawn Turner Trice) Dawkins, who is among the Chicago theater's very brightest young writing talents, does not sanitize their lives, but he makes Mama's charges, most of whom show up at first just for the free food, a very empathetic group, which is crucial in all stories of this kind. And in the hands of the warm-centered actor Dexter Zollicoffer, Mama Gloria, now Mama Darleena, becomes at once a caring figure and a living representative of a very different world for a transgender woman, whose experience gives her real gravitas.\nOften underestimated, Zollicoffer has played a plethora of second bananas on Chicago's stages — he recently showed up as a servant in the Goodman Theatre's \"Little Foxes.\" But Mama Darleena takes a back seat to no one. And she has allowed Zollicoffer to do the best work of his career to date — he oozes empathy for the hard-knock life, bitterness being unattractive in a lady. \"An Adam's apple,\" he tells his students in regard to their makeup, \"is a speed bump on the way to glamour.\"\nZollicoffer is matched by Namir Smallwood, who plays Beta, the student who reveals the most pain and complexity by the end of the show. This is a tough and concealing role, and Smallwood is simply extraordinary. You also fall hard for Donny and Victoria (played by Julian Parker and BrittneyLove Smith), a struggling couple taught by Mama D to treat each other with kindness, as well as for Monica Orozco, who plays a tough streetwalker named Ariela and whose hard-edged work serves as a reminder that Dawkins and Jones know how to avoid sentimentality.\nIndeed, Jones has cast his clearly low-budget production, which doesn't have much of a design, with actors who naturally avoid cliches. Elizabeth Ledo plays D, the character who hires Mama Darleena and who is intended, in part, to be the authority figure who neither gets nor approves of Mama's methods. But in \"Charm,\" that role is radically different, in that D confronts Mama from the left. Charm, D argues, is a product of the straight, majority culture. Rather than teach young people how to sip tea decorously in the English style, D says, why not teach them to take tea as they would prefer?\nGood point, the play allows. And thus we get a very interesting debate on whether good manners are culture-bound or a boundary-crossing way in which any polite society stays polite. Ledo, invariably an emotionally present performer, pulls D away from paper-tiger territory and shows us someone just doing her best in a complex world. And Dawkins makes clear that even Mama still has stuff to learn.\nIn past work, Dawkins has exhibited a habit of setting up a traditional structure and then suddenly abandoning it two-thirds of the way through, which tends to leave the audience flailing until things get back on track. With \"Charm,\" that happens here early in Act 2, when a show with all kinds of initial drive takes a dive into the vague and unspecific. A plot strand involving a potential tea at the Drake Hotel is thrust to the forefront, then abandoned for too long, only to be wrapped up unconvincingly in the final moments. That needs some work. \"Charm\" is a piece that does not need structural subversion — it will live or die based on the heart of the characters and the power of its ideas. The rest just comes off as unnecessary. We just want to enjoy Mama's class, and enjoy it we do.\nThis true ensemble cast just crackles with life in all of its youthful messiness. Mama's mantra — which becomes exceptionally moving and resonant as this story wends its way through her curriculum — could be summed up as \"I am looking at you\" and \"I see you.\" That's Dawkins' main point, especially as regarding the most uncertain character of them all, Matthew Sherbach's moving, and carefully named, Lady.\nIt's easy for rich, straight kids to put on some white gloves, the play suggests. But you can't be charming when the world doesn't offer you the time of day. Or to put that a little differently, the current of charm flows two ways or not at all.\nChris Jones is a Tribune critic.\ncjones5@tribpub.com\nTwitter @ChrisJonesTrib\n\"Charm\" — 3.5 stars\nWhen: Through Nov. 8\nWhere: Steppenwolf Garage Theatre, 1624 N. Halsted St.\nRunning time: 2 hours, 15 minutes\nTickets: $20-$40 at 312-335-1650 or steppenwolf.org\n Entertainment", "external_links": ["http://www.steppenwolf.org/", "http://www.trbimg.com/img-562507ba/turbine/ct-handing-down-lessons-learned-on-her-journey-transgender-senior-teaches-tricks-of-the-trade-to-a-new-20151019", "http://www.trbimg.com/img-562564f2/turbine/ct-charm-northlight-review-ent-1020-20151019"], "published": "2015-10-20T00:48:00.000+03:00", "crawled": "2015-10-20T01:29:33.215+03:00", "highlightTitle": ""}