{"organizations": [], "uuid": "90e486376cb88840364a2ce278241c1f9e8e036b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "chicago.suntimes.com", "main_image": "http://bullseye-prod.aggrego.org//wp-ag/wp-content/uploads/sites/71/2015/10/KIM_FOXX.jpg?o=eyJ3aWR0aCI6MCwiaGVpZ2h0IjowLCJ4IjowLjUsInkiOjAuNX0%3D&amp;s=JoGwCuBbi5r8ahVlZuy8fqLOOSU%3D", "site_section": "http://chicago.suntimes.com/", "section_title": "Chicago Sun-Times | Chicago : News : Politics : Things To Do : Sports", "url": "http://chicago.suntimes.com/opinion/7/71/1041248/laura-washington-kimberly-foxx-learned-cabrini-green", "country": "US", "title": "Laura Washington: What Kimberly Foxx learned at Cabrini-Green", "performance_score": 0, "site": "suntimes.com", "participants_count": 1, "title_full": "Laura Washington: What Kimberly Foxx learned at Cabrini-Green | Chicago Sun-Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T23:38:00.000+02:00", "replies_count": 0, "uuid": "90e486376cb88840364a2ce278241c1f9e8e036b"}, "author": "| emailAddress.indexOf('@') == -1) {errorString = 'Please enter your email address';} var isError = false; if (errorString.length > 0) isError = true; if (isError) alert(errorString); return !isError;}", "url": "http://chicago.suntimes.com/opinion/7/71/1041248/laura-washington-kimberly-foxx-learned-cabrini-green", "ord_in_thread": 0, "title": "Laura Washington: What Kimberly Foxx learned at Cabrini-Green", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Follow @mediadervish We sat by the window at the Starbucks on the second floor of a bustling Target store. A new police station across the street. A few doors west, a glistening “sustainable” high-rise apartment building (studios start at $1,675). A Whole Foods store nearby.Kimberly Foxx sipped her chai, and declared, “I promised I’d never come into this Target.”Foxx spent her childhood on this old site, in the Cabrini-Green housing projects. At 14, she moved away for a better life. That’s Cabrini-Green, that nationally notorious haven for crime, violence and poverty. Those massive warehouses for the poor that were neglected by the powers that be. OPINION\nFollow @mediadervish\nThe Near North development was sitting on ultra-prime real estate. It had to go. Cabrini was demolished, the neighborhood gentrified.\nCabrini, Foxx told me, is why she is running for Cook County state’s attorney in the March 2016 Democratic primary.\nAt age 43, she comes with a hefty resume. She served in the Cook County public guardian’s office, representing children who were abused, neglected or with special needs. Then a 12-year stint as a prosecutor and supervisor in the Cook County state’s attorney’s office. Then chief of staff to Cook County Board President Toni Preckwinkle.\nFoxx gazed out at the bright autumnal sun and spoke passionately about her close-knit family. Her mother’s sisters all raised families at Cabrini. On her high-rise floor, there was a “sense of community.”\nOutsiders saw it differently. “We knew that we were isolated and kind of crouched together because we were poor, because we were black. We knew that. And how we were treated reflected that.”\nThe city wrote them off. They were “hostages,” she said, to neglect, violence and poverty.\nThis new neighborhood is booming. Yet, she wondered: “Why were we not good enough to have this type of investment?”\nYou are.“I know what happens when you invest in people. When you are not imposing punitive policies and you believe in the potential of people who come before you.”A cousin was shot eight times. A classmate served 20 years in prison for a crime he did not commit. She has lost track of the many boys she grew up with who are now in prison.Foxx eschews “myopic” law-and-order, lock-‘em-up policies. She favors a different kind of justice: “holistic” reforms that will divert non-violent offenders to services that will keep them out of the system.As state’s attorney, for example, she would work to divert the school-to-prison pipeline that sends “thousands” of children to jail when they fight or mouth off on school grounds. Now, prosecutors charge many of those kids with felonies. “Once that finger goes in the ink, once that mug shot his been taken, once that number is assigned to you … it’s got a detrimental effect.”\nFoxx wants partnerships with the Chicago Public Schools and youth agencies on restorative justice strategies and support services that address the causes, like violence and addiction.\nIsn’t that a hard sell in a city gripped by an epidemic of street violence?\n“We should be tough on violent crime. Absolutely.”\nFoxx added, “if you don’t address the conditions that get you there and only are reacting, we’re gonna keep battling these issues of violence in those neighborhoods.”\nAnd continue to fail the families ravaged by violent crime and over-incarceration. And fail to help them fight the front-end causes, like addiction, mental illness and political neglect.\nCabrini is gone, but we can save its hostages.\nFollow Laura Washington on Twitter: Follow @mediadervish\nTweets by @mediadervish", "external_links": ["https://twitter.com/mediadervish"], "published": "2015-10-25T23:38:00.000+02:00", "crawled": "2015-10-26T04:51:49.550+02:00", "highlightTitle": ""}