{"organizations": [], "uuid": "eb9f0e2e1a4ba68d4a1abfb1f5f74966b91541ec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pressherald.com", "main_image": "http://www.pressherald.com/wp-content/uploads/2015/10/727110_ALDS-Astros-Royals-Baseb61.jpg", "site_section": "http://www.pressherald.com/category/sports/feed/", "section_title": "The Portland Press Herald / Maine Sunday Telegram » Sports", "url": "http://www.pressherald.com/2015/10/08/astros-top-royals-for-alds-lead/", "country": "US", "title": "Astros win at Kansas City to take early lead in AL playoff series", "performance_score": 0, "site": "pressherald.com", "participants_count": 1, "title_full": "Astros win at Kansas City to take early lead in AL playoff series", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T06:49:00.000+03:00", "replies_count": 0, "uuid": "eb9f0e2e1a4ba68d4a1abfb1f5f74966b91541ec"}, "author": "The Associated Press", "url": "http://www.pressherald.com/2015/10/08/astros-top-royals-for-alds-lead/", "ord_in_thread": 0, "title": "Astros win at Kansas City to take early lead in AL playoff series", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "increase font size Astros win at Kansas City to take early lead in AL playoff series Collin McHugh tosses six effective innings and gets solid defense as Houston tops Kansas City, 5-2. The Associated Press Read Article \nKANSAS CITY, Mo. — Collin McHugh and the Houston Astros beat the Kansas City Royals at their own game Thursday night, relying on sharp pitching and stingy defense for a 5-2 victory in the opener of their AL Division Series. \nMcHugh (1-0) allowed four hits, including a pair of solo homers by Kendrys Morales, while pitching around a 49-minute rain delay. The right-hander lasted six innings before turning the game over to his bullpen, which scattered three runners over the final three frames. Houston players celebrate Thursday night after their victory over the Kansas City Royals in Game 1 of the American League Division Series. The Associated Press The Royals’ Eric Hosmer walks back to the dugout after flying out to end the eighth inning of what ended as a 5-2 loss to the Houston Astros. The Associated Press Houston Astros starter Collin McHugh throws in the first inning. He gave up just four hits to the Royals in six innings to earn the win. The Associated Press Related Headlines Rangers beat Blue Jays ace David Price to take opener of AL Division Series Search photos available for purchase: Photo Store → \nTony Sipp, Will Harris and Oliver Perez got the game to Luke Gregerson, who handled the ninth to earn the save. \nGeorge Springer and Colby Rasmus went deep for the homer-happy Astros, but they also scored via the same sort of small ball the Royals used in reaching the World Series last season. \nYordano Ventura (0-1) yielded three runs on four hits and a walk in two innings for Kansas City, but did not come back after the delay. Chris Young served up Springer’s home run with one out in the fifth, but tossed four otherwise solid innings of relief. \nThe Astros, who struggled so mightily on the road this season, have apparently solved their woes just in time. They beat the Yankees 3-0 in New York in Tuesday night’s wild-card game, then took care of a Royals club built specifically for spacious Kauffman Stadium. \nHouston also made it the first time since 1970 that visiting teams won baseball’s first four postseason games, STATS said. The other two times it happened were 1906 and 1923. \nThe Astros wasted no time getting Ventura in trouble, loading the bases with nobody out in the first inning. The hard-throwing ace settled down to retire the next three batters, but Rasmus and Evan Gattis provided RBI groundouts to give Houston a 2-0 lead. \nJose Altuve tacked on another run in the second with a single to right. \nThe Royals answered in the bottom half, just as rain started to fall, when Morales ripped McHugh’s 89 mph fastball down the right-field line. \nThe rain became a downpour as the inning progressed, and lightning sent fans scurrying for the concourse. \nThe tarp was pulled onto the field between innings. \nWhen the game resumed, the Royals sent Young to the mound rather than Ventura. Astros manager A.J. Hinch stuck with McHugh even though he hadn’t thrown a pitch for nearly an hour. \nMorales got the better of McHugh again in the fourth, driving a 1-1 pitch over the wall in right. Morales became the first Royals player with two homers in a postseason game since George Brett against Toronto in the 1985 AL Championship Series. \nUnfortunately for the Royals, Morales was the only hitter who could solve McHugh. That left the darlings of last year’s postseason facing a crucial Game 2 on Friday, when another defeat would leave them on the brink of elimination. Share", "external_links": [], "published": "2015-10-09T06:49:00.000+03:00", "crawled": "2015-10-09T08:07:44.382+03:00", "highlightTitle": ""}