{"organizations": [], "uuid": "4dc9bb152db5ba9c786991dba2f07c2696f62f8a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nwaonline.com", "main_image": "http://media.arkansasonline.com/static/nwaonline/redesign/images/nwadg_logo_square.png", "site_section": "http://www.nwaonline.com/rss/headlines/sports/prep/", "section_title": "NWAonline stories: High School Sports - Northwest Arkansas", "url": "http://www.nwaonline.com/news/2015/oct/10/missed-field-goal-seals-bryant-victory-/", "country": "US", "title": "Missed field goal seals Bryant victory", "performance_score": 0, "site": "nwaonline.com", "participants_count": 1, "title_full": "Missed field goal seals Bryant victory", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T10:08:00.000+03:00", "replies_count": 0, "uuid": "4dc9bb152db5ba9c786991dba2f07c2696f62f8a"}, "author": "Walter Woodie Special to the Democrat-Gazette", "url": "http://www.nwaonline.com/news/2015/oct/10/missed-field-goal-seals-bryant-victory-/", "ord_in_thread": 0, "title": "Missed field goal seals Bryant victory", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Missed field goal seals Bryant victory By Walter Woodie Special to the Democrat-Gazette Posted: October 10, 2015 at 2:08 a.m. \nALMA -- Bryant found a way to win a close 7A/6A-Central game and gave Coach Paul Calley his 100th victory in the process. \nAlma missed a 26-yard field goal with 29 seconds left as the unbeaten Hornets hung on for a 27-24 victory at Airedale Stadium on Friday night. \n\"Almost didn't get [the 100th victory],\" Calley said. \"Alma fought us all the way to the end. I knew coming in they were going to move the football. They are so precise on offense. \nBryant (6-0, 3-0) will travel West again next week to face Greenwood in a battle of 7A/6A-Central unbeatens. \n\"We knew it would be a big challenge against Bryant,\" Alma Coach Doug Loughridge said. \"Our kids did not back down from the challenge. It has been our motto since the offseason to step up to the big boys. We will see teams like that in the 6A playoffs.\" \nThe Hornets took the lead for good at 27-24 with 4:26 left on a 13-yard touchdown pass from Gunnar Burns to Aaron Orender. After completing 2 passes for 4 yards, Burks was 3-for-3 for 38 yards on the game-winning drive. The Hornets went 68 yards in 10 plays. \n\"We knew we were going to throw it at some point,\" Calley said. \"They started overloading us and put us behind the sticks. Luckily, we made the plays.\" \nThe drive looked stalled after a holding penalty left Bryant with a first-and-24 at the Airedales 25. On third-and-12, Burks found Orender in the back of the end zone for the go-ahead score. \nCalley said he was worried Alma would be able to drive for a winning score. \n\"I was afraid we gave them too much time and lo and behold, we did,\" Calley said. \nHe was almost right as the Airedales (4-2, 2-1) marched from their 19 to the Hornet 3. Two Bryant penalties led to Alma first downs, including an offsides penalty on a field goal attempt left the ball at the 3. Two runs for losses and an incomplete pass left Alma kicker Aidan Walker with a 26-yard field goal on the left hash. \nAfter Bryant called its final timeout, a poor snap led to the kick that was low and wide left. \n\"I thought they might get a little conservative and our run defense has been good all year,\" Calley said. \nAlma rallied from a 20-10 deficit in the third quarter with two Noah Dodson touchdown passes to give the Airedales a 24-20 lead going into the final quarter. Dodson hit Drake Pendergraft for a 77-yard touchdown pass at with 8:33 left in the third, then on its next possession, Alma went 62 yards in 13 plays, capped by Dodson hitting Thomas Hall over the middle for a 19-yard score with 1:10 left. \n7A/6A-EAST \nNO. 4 CABOT 49, WEST MEMPHIS 28 \nWEST MEMPHIS — Junior quarterback Jarrod Barnes punctuated a big night with two key fourth-quarter touchdowns to lead Cabot over West Memphis. \nBarnes rushed for 215 yards and three touchdowns, the last two of which were difference-makers with the Panthers clinging to a pair of one-touchdown leads. \nLeading West Memphis (3-3, 1-2 7A/6A-East) 28-21 and facing a third and 17, the Panthers lined up in a Spread formation with Barnes in the Shotgun. He darted through a hole 5 yards off the line and scored a 74-yard touchdown. \nWith his team leading 35-28, Barnes put the finishing touch on the victory with a 22-yard touchdown with 4:54 to play in the fourth quarter to make it 42-28. \nCabot (6-0, 3-0) tacked on a touchdown when junior running back Alex Roberts scored on a 29-yard run with 2:52 left in the game. \nWest Memphis took a 7-0 early lead when quarterback Kylin Whiting, who accounted for three touchdowns, threw a 61-yard touchdown pass to Steven Stone with 4:29 to play in the first quarter. \nBut the Panthers answered when senior Holdyn Barnes returned his third kickoff for a touchdown this season. This one went for 84 yards and it led to a 21-7 halftime lead. \nThe Blue Devils came alive offensively in the second half, flipping two Cabot turnovers into touchdowns after the visitors had increased their lead to 28-7. \nSports on 10/10/2015", "external_links": [], "published": "2015-10-10T10:08:00.000+03:00", "crawled": "2015-10-10T13:07:34.100+03:00", "highlightTitle": ""}