{"organizations": [], "uuid": "1f45a9417d506ba1f173e87c2c3be1e90e4868e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/mlb", "section_title": "MLB News, Scores, Schedule, Standings, Stats, Photos, Videos - Baseball - MSN Sports", "url": "http://www.msn.com/en-us/sports/mlb/donaldson-leading-by-example-in-mvp-caliber-year-for-blue-jays/ar-AAfed9s", "country": "US", "title": "Donaldson leading by example in MVP-caliber year for Blue Jays", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "Donaldson leading by example in MVP-caliber year for Blue Jays", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "1f45a9417d506ba1f173e87c2c3be1e90e4868e3"}, "author": "Jim Carrey's ex-girlfriend's suicide note had a heartbreaking plea to the actor", "url": "http://www.msn.com/en-us/sports/mlb/donaldson-leading-by-example-in-mvp-caliber-year-for-blue-jays/ar-AAfed9s", "ord_in_thread": 0, "title": "Donaldson leading by example in MVP-caliber year for Blue Jays", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Donaldson leading by example in MVP-caliber year for Blue Jays FOXSports 8 hrs ago © Getty Images TORONTO, CANADA - JUNE 8: Josh Donaldson #20 of the Toronto Blue Jays greets a member of the Miami Marlins as he tips his helmet during MLB game action against the Miami Marlins on June 8, 2015 at Rogers Centre in Toronto, Ontario, Canada. (Photo by Tom Szczerbowski/Getty Images) During his time in Oakland, Josh Donaldson went from unknown to underrated to invaluable in just a couple of seasons.\nAdChoices This quick transformation took Donaldson by surprise as he didn't realize he was \"the guy\" until he reflected on his time there.\nThis transformation has helped him tremendously with the Toronto Blue Jays, where he was evolved into an MVP front runner and superstar.\n“I think, just over the course of being in Oakland, not really being the guy there to start being the guy and not really noticing that I was the guy. Then coming here, with a lot of guys that are really good and then just at the beginning trying to fit in,\" Donaldson told the Toronto Star . \"And the next part, trying to go out there and play the game the right way. Be an example for some of the guys that are in this clubhouse.\n“Just the willingness to go out there and try to take some pressure off those guys. And if they need advice, that’s where I’m at. I really believe we’re on the right track, and we’ve been kind of slowly pushing the ball forward all season long. And this is where we are today.”\nBy setting an example for his teammates, he was molded into a leader in a clubhouse that already had veterans in Jose Bautista, Edwin Encarnacion and Mark Buehrle.\nIn his first season with Toronto, Donaldson hit .297 with 41 home runs and 124 RBI, leading the Blue Jays to their first playoff berth since 1993.\nGo to MSN Home", "external_links": ["http://www.foxsports.com/", "http://go.microsoft.com/fwlink/?LinkID=286759", "http://www.thestar.com/sports/bluejays/2015/10/07/josh-donaldson-perfect-fit-within-blue-jays-dynamic-dimanno.html"], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T15:58:05.473+03:00", "highlightTitle": ""}