{"organizations": [], "uuid": "9be0135f2927ad3ee4b4f3616dfc100da6509ff3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.vindy.com", "main_image": "http://media.vindy.com/content/image/a/5/logo/v5logo.gif", "site_section": "http://www.vindy.com/rss/headlines/kindle/sports", "section_title": "Vindy.com stories: Sports News", "url": "http://www.vindy.com/news/2015/oct/09/more-high-school-results/", "country": "US", "title": "More high school results", "performance_score": 0, "site": "vindy.com", "participants_count": 0, "title_full": "More high school results", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T07:00:00.000+03:00", "replies_count": 0, "uuid": "9be0135f2927ad3ee4b4f3616dfc100da6509ff3"}, "author": "", "url": "http://www.vindy.com/news/2015/oct/09/more-high-school-results/", "ord_in_thread": 0, "title": "More high school results", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published: Fri, October 9, 2015 @ 12:00 a.m. \nVOLLEYBALL \nBoardman 25-25-25, Hubbard 17-17-20 \nKatie Platt led the Spartans (14-4, 9-3 All-American Conference Red) with 21 assists and nine digs. Krista Johnson made 14 digs and 11 kills and Courtney Platt had 15 digs. For the Eagles (4-12, 3-9), Adria Powell made 10 kills and Kristen Fahndrich had 15 digs. Emily Krinos made 18 assists and Annie Zagorec had nine blocks. JV: Boardman, 2-0. \nGirard 23-25-25-25, Howland 25-20-22-22 \nLexi Crown had 14 points, four aces, and three blocks, Makayla Trebella had nine kills and 20 digs and Melanie Bakes had 33 assists for the Indians (10-9). For the Tigers (10-10), Cassie Murcko had 21 kills and two blocks, Caroline Henneman had five kills and two aces, and Lexi Miner had 30 assists. JV: Howland, 2-0. \nPoland 25-25-25, Warren Harding 10-19-23 \nShymara Dykes had six points, five blocks, 12 kills and 12 digs. Kristin Sampson scored two aces and had 21 assists. For Poland, Cordray Sundstrom had 11 kills, Jen Eich had 23 assists, and Logan Kountz had seven kills, and Jill Penman had 14 points and 17 digs. JV: Poland, 2-0. \nBrookfield 25-25-25, Campbell 14-17-16 \nFor Brookfield (8-10), Bailey Drapola had 10 kills, Katie Bender had 25 assists, Olivia Vogal had two blocks, and Kenzie Drapola had nine aces, eight digs, and 16 points. \nLiberty 25-25-17-25, Champion 13-17-25-19 \nJackie Mulvain made 11 kills and Ashley Naylor made 17 digs for the Golden Flashes. \nCardinal Mooney 25-25-25, Warrensville Heights 12-4-8 \nMaddie Abrigg had eight kills and nine aces, Marcella Adams had 13 digs, and Autumn DeSantis had seven kills for the Cardinals. JV: Mooney, 2-0. \nLowellville 23-25-24-25-17, Mineral Ridge 25-21-26-14-15 \nMacey Garland had 13 kills, 45 digs, three aces and 21 assists to lead the Rams. She was assisted by Anna Bodo, who had 13 kills and 31 digs, and Sabrina Stokes, who had 22 digs. \nUnited 25-26-21-25, Springfield Local 9-24-25-14 \nLogan Daggy had four aces, 17 kills and 10 points, Camryn Jerrett four blocks, 13 kills, and six points, an Mariah Eisenbraun had four aces, five kills, and 10 points for United. Kasey Kohler led Springfield with 10 kills. Quinn Crowe had seven kills and six blocks and for Springfield. \nWestern Reserve 25-25-25, Sebring 17-12-21 \nAlexis Hughes scored 11 points with four aces while Sydney Miller made eight kills and seven digs for the Blue Devils (13-7). Alexis Miller contributed eight kills and three blocks, JennyStubbs made seven digs and Tiana Nicopolis made 28 assists. For the Trojans (4-15, 3-4 Inter Tri-County League), Sydney Smith led with seven points and eight digs. Murphy Flowers had 19 digs. \nWarren JFK 22-25-23-25-15, Clev. Central Catholic 25-15-25-19-8 \nJulia Lombardi had three kills and four aces, Adrianna Placanica had four aces and 34 digs, and MacKayla Kroll had three blocks for the Eagles. JV: JFK, 2-0. \nNewton Falls 18-25-25-25, LaBrae 25-17-23-9 \nGabby Kline had 20 kills, four blocks, and 18 points, Kate Wainwright had 51 assists, 23 digs, and 16 points, and Izzy Kline had 19 kills and four blocks for Newton Falls (19-0). JV: Newton Falls, 2-0. \nColumbiana 25-14-25-10-16, Wellsville 15-25-15-25-14 \nDee Dixon had 12 kills, two blocks, one assits, and two digs, Hannah Hum had one kill, three points, two aces, two assists, and 34 digs, and Emily Gosselin had six points, four aces, 19 assists, and 12 digs for Columbiana. \nSouthern 19-23-25-25-16, South Range 25-25-22-14-14 \nLynni Ritter had 20 kills and nine blocks, Eliza Garlough had 29 digs and 15 points, and Codi Taylor had four aces for South Range (14-5). For Southern (18-1), Hannah Brothers had 47 assists, Abby Smolley had 15 kills and ten points, and Anna Sever had five blocks. \nBOYS SOCCER \nCrestview 3, Hubbard 0 \nMitch Lindsay, Matt Nery, and Josh Batchelor each scored for Crestview (11-2-2), with assists from Riley µackall, Jeff Roberts, and Batchelor. Scott Murray, goalkeeper for Crestview, earned his ninth shutout with five saves. Jake Shaffer made eight saves for the Eagles (5-4-3). \nPoland 4, Edgewood 0 \nMarcus Trevis, Trey Medvec, and Matthew Holsinger scored for Poland (8-1-5), with Holsinger contributing two. Joe Shiels, Steve Massarelli, Reed McCreery, and Holsinger all had an assist. Bryan Montgomery had two saves for Poland. JV: Poland, 1-0. \nBoardman 4, Harding 1 \nAdam Deely scored the first goal for Boardman on a penalty kick, with later goals scored by Chris Dailey, Shane Learman, and Jacob Smotzer. Boardman goalkeeper Kevin Durkin had two saves. Mauro Moreno scored on a penalty kick for Harding. JV: Boardman, 7-0. \nEast Liverpool 4, Ursuline 1 \nP.J. Conway scored Ursuline’s only goal off of an assist by Mark Fusillo. Brian Meek scored twice for East Liverpool. Ursuline goalkeeper Bryce Blazek had five saves, and Liverpool’s Dallas Brewer had six. \nCanfield 1, Austintown Fitch 1 \nTanor English scored the single goal for Canfield (8-3-2) from an assist by Justin Montanzeri. Kyle Cyphert scored for Fitch (10-2-2) unassisted. Jeff Joseph made 12 saves for Canfield, and Hunter Klaus made four saves for Fitch. JV: Canfield, 1-0. \nStaff reports", "external_links": [], "published": "2015-10-09T07:00:00.000+03:00", "crawled": "2015-10-09T16:40:19.790+03:00", "highlightTitle": ""}