{"organizations": [], "uuid": "2707bfdf658034758cb508bc06aa934556ea1270", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/soccer", "section_title": "Soccer News, Scores, Schedule, Standings, Stats, Photos, Videos - MSN Sports", "url": "http://www.msn.com/en-us/sports/soccer/around-europe-neymar-wijnaldum-strike-for-four-yaya-toure-unhappy/ar-AAfD4sf", "country": "US", "title": "Around Europe: Neymar, Wijnaldum strike for four; Yaya Toure unhappy", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "Around Europe: Neymar, Wijnaldum strike for four; Yaya Toure unhappy", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "2707bfdf658034758cb508bc06aa934556ea1270"}, "author": "Ben Lyttleton", "url": "http://www.msn.com/en-us/sports/soccer/around-europe-neymar-wijnaldum-strike-for-four-yaya-toure-unhappy/ar-AAfD4sf", "ord_in_thread": 0, "title": "Around Europe: Neymar, Wijnaldum strike for four; Yaya Toure unhappy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\nAround Europe: Neymar, Wijnaldum strike for four; Yaya Toure unhappy Sports Illustrated 14 hrs ago Ben Lyttleton © Sports Illustrated Neymar scores four goals for Barcelona Four-goal performances are the new hat tricks as Barcelona's Neymar and Newcastle's Georginio Wijnaldum both lit up Europe with their individual performances this weekend. Elsewhere, normal service resumed in England, where Jurgen Klopp's time at Liverpool is underway, while there are managerial dilemmas to solve in Germany and Spain. Napoli continues to talk down its title chances in Italy, despite evidence to the contrary, while in France actions off the pitch seized the most attention.\nAdChoices Here is the rundown of this weekend’s highlights Around Europe:\nNormality resumes in Premier League This was the weekend normal service was resumed in the Premier League. For the first time this season, last year’s top four sides all won, while the three newly-promoted sides all lost. Chelsea restored some stability to its campaign with a scrappy 2-0 win over Aston Villa. Chelsea boss Jose Mourinho dropped Eden Hazard, explaining the team needed to defend better. The obvious upshot was that Hazard has already been linked to Real Madrid in the Spanish press. Hazard, though, is apparently backing Mourinho to turn things around, unlike some of his teammates who, as the London Evening Standard reported last week, have turned him into the brunt of a joke behind his back. If that is correct, then it’s a long way back for Mourinho (or for them, if he finds out who they are).\nElsewhere, the Jurgen Klopp era began on a positive note, with a clear improvement in Liverpool’s performance in its 0-0 draw at Spurs.\nIt is refreshing to note Klopp talk of how happy he is with his players, insisting he can work with them to turn things around, rather than the standard response from a new coach who wants to wait for a transfer window so he can bring in some different players. Klopp backs his ability as a coach, and after only three days of working with the players who came back late from international duty, you could see why.\nPODCAST: Expectations for Klopp at Liverpool; USA failure fallout Manchester City, meanwhile, shrugged off the absences of David Silva and Sergio Aguero to thrash Bournemouth 5-1, but a storm may be brewing after Yaya Toure told L’Equipe that, despite all the trophies he’s won, and money he has earned, he is still not happy. Toure started the season like a train but is upset that the English press does not give him the recognition he deserves.\n“When it's bad, they exaggerate it. When it's good, they forget it. They always use their little methods to annoy me, to exclude me,” he said. He has not forgotten that journalists claimed his salary when he joined from Barcelona in 2010 (after winning six trophies in a season) was “a disgrace” and explained that he was there to help the club grow. “What happened next? We won almost everything,” he said.\n?Toure’s words are set to become a self-fulfilling prophecy: the English press will once again jump on his negative comments and ignore the positives, like his pride of captaining the Ivory Coast to African Cup of Nations success or his charity work in Africa. Instead you can expect to see headlines like: “It’s hard for me to go out in Manchester” on Tuesday. Example: The Sun online called him \"Wah-Wah Toure, crybaby City star.\"\nSo, does Toure have a point? He has been the African Confederation (CAF) Player of the Year for the last four years and was outstanding in City’s two title-winning seasons. The implication in his interview, never made explicit, is that his African-ness is a barrier to recognition. He tells the story of how he met a 15-year-old in Abidjan in the summer of 2014, after he had scored 26 goals in a season, who said: “You tell us to work hard like you, but you think that we are going to work like you ask only to be treated like that?” Toure responded, saying, “The kids are seeing through their idols and now asking questions.”\nThe biggest problem in the perception of Toure comes via his agent Dmitry Seluk; the stigma he caused by claiming Toure was upset that City had not acknowledged his birthday–“It’s really sick,” he said–has never gone away. In the two summers since, Toure has been linked with moves away from the Eithad, despite signing a four-year contract in April 2013 seeing him through to 2017.\nHere is a sensitive guy who thinks the media is out to get him and is not good at handling bad press. Wouldn't you be the same? Instead of mocking Toure for being precious, and accusing him of trying to engineer a new deal, perhaps we should take a more understanding approach. Let’s hope City takes responsibility for one of its star players and does the same.\nArsenal's ideal Wenger replacement: Pep Bayern Munich’s latest win, a 1-0 victory over Werder Bremen, was the ninth in a row for the Bundesliga champion elect. Its last defeat in the first half of a season came three years ago (a home loss to Leverkusen in October 2012) and coach Pep Guardiola was able to rest Douglas Costa as he played yet another formation for his ever-rotating (and crucially, never-bored) winning machine. The changes keep his players fresh ahead of a Champions League game at Arsenal Tuesday, which Bayern will want to win for a few reasons.\nFirstly, it has not always had things its own way against Arsenal, despite knocking out the Gunners in 2013 (on away goals) and 2014 (3-1). The chance to knock out a side that could cause problems in the knockout stage is one worth taking. Given that Arsenal lost its opening two matches, a point-less return from two Bayern games would make qualification highly improbable.\nThen there is the Guardiola factor.\nArsenal coach Arsene Wenger told BeInSport last season that the Spaniard once called him up when he was a player and asked to join Arsenal. “Can I come and see you?” he asked Wenger.\n“I was intrigued by this call and the way he expressed himself and so I invited him round for dinner,” Wenger explained. “He came to my house, we had dinner, and he told me that he wanted to play for Arsenal, and for me. He said: ‘I want you to give me a chance to show me what I can still do for you. Let me make it clear, it’s not a question of money, I just want a chance.’ I had to explain to him that I had Patrick Vieira who was playing in a similar position and I had enough quality in midfield and that the timing was not right. So I told him that it wasn't going to happen and he went to Italy [to Brescia].”\nTuesday might not be the best time to have a similar conversation–nor the right occasion to mention the uncertainty about Guardiola’s future in Bavaria beyond this season –but it could provide Arsenal with the reminder that the Spaniard would be ideal to replace Wenger as coach. Despite reports linking Guardiola to Manchester City, Arsenal’s board would be remiss if it did not find out Guardiola’s intentions beyond Bayern.\nAnd if there was half a chance he was interested in Arsenal–and he did want to play for them after all–it should encourage Wenger to stand aside so it could get him.\nTime running out for Moyes at Sociedad In Spain, Barcelona hit five goals past Rayo Vallecano without Lionel Messi while Real Madrid got back to winning ways against Levante, as both sides joined Celta Vigo, (for whom La Liga’s star of the season–and Barca target–Nolito scored a last-minute winner), at the top of La Liga. The story of this week, though, could be in San Sebastian where Real Sociedad’s latest defeat, at home to Atletico Madrid, could prove to be the beginning of the end for David Moyes.\nThere’s no great shame in losing 2-0 to Atletico, for whom Antoine Griezmann scored a solo goal early on against his former side (even if being allowed to run through the middle of the pitch 40 yards out without a single challenge coming in was a bit generous).\nBut it was the manner of the defeat that upset the fans at the Anoeta, where the team has not won for five games this season, its worst run for nine years.\nReal Sociedad had two players sent off and could have had a late penalty; instead, Atletico broke upfield and scored the second. La Real has dropped into the bottom three with one win in eight games. TV pundits mused whether Moyes’s lack of Spanish is preventing him getting his ideas across to the team. After the match, he insisted his position was not under threat: “We work hard, we prepare the players, we go about the job right. You can't always keep changing your manager, and think that that is the answer to your problems.”\nReports coming out of England suggest he is interested in replacing Tim Sherwood at Aston Villa, in which case he’d be swapping one relegation battle for another. With fans booing off the team and shouting for Moyes to “go home,” it could just happen.\nOff-field drama overshadows Real Madrid's France visit French broadcaster BeInSport is encouraging PSG fans to wear their PSG shirts in the work-place on Wednesday: #Jourdumaillot is a sign of the excitement that the Champions League tie against Real Madrid is generating in the city. Older fans remember the 1993 UEFA Cup tie, when PSG overcame a 3-1 first leg loss to win 4-1 at Parc des Princes courtesy of Antoine Kombouaré’s injury-time winner. These were the days of Ginola, Weah and Valdo, when PSG was more like the Madrid of its day.\nThis match could provide clues to see if this is the season PSG can make the breakthrough into the top tier in Europe; last season eliminating Chelsea in the last 16 was a huge moment, but topping a group containing Real Madrid could have benefits in the next round. Friday’s 2-0 win over Bastia, in which Zlatan Ibrahimovic scored both goals, was notable for the assist from Edinson Cavani on his goal; in their three years playing together, this was only Cavani’s second assist to Ibra for a goal!\nThe biggest talking-points in France, though, remain focused off the pitch. Mathieu Valbuena was victim of a plot to blackmail him over mobile-phone footage of him in flagrante delicto. His former Marseille teammate Djibril Cisse was questioned in connection to the offense–he claimed he was only trying to help Valbuena. It was barely mentioned that the footage was of Valbuena with his wife. It’s deeply depressing that this kind of thing even goes on.\nNicolas Anelka then posted an astonishing video on YouTube in which he accused his former boss at Liverpool, Gerard Houllier, whose new book has just come out, of racism. “What happened when you were at Liverpool and all the players, English or foreign, wanted to re-sign? You re-signed them by improving their contracts,” he said. “What happened when blacks, people with black skin like me, came into your office, what did you say? You haven't written that in your book! Your words: 'No, you blacks, once we give you more money, you do **** all. Those are your words, Gerard!”\nHoullier said it was “absolutely ludicrous and ridiculous” and threatened to sue Anelka for “serious slander.” He said: “I never, never said that… I defy anyone to say that I'm a racist with the number of black players with whom I have had the chance to work. You ask them. I am going to see if I am going to sue.”\nIt's an unedifying story all around.\nNapoli claims another top victim They call it the Derby D’Italia but neither Inter nor Juventus did their title hopes much good in a compelling 0-0 draw Sunday night. Inter had the better of the first half, Juventus the second half, while Gigi Buffon made one stunning save from Marcelo Brozovic’s surprise curler. Instead the focus was once again on Napoli, which followed up wins over Lazio, Milan and Juventus with another impressive victory, this one over top-of-the-table Fiorentina.\nGonzalo Higuain scored the winner but once again the key player was Lorenzo Insigne, who was injured on international duty but fortunately declared fit for this one. He scored the opener, his sixth of the campaign, and is flourishing in Maurizio Sarri’s 4-3-3 system.\n“I express myself better in a 4-3-3,” he told Ul Mattino after Sarri ditched 4-3-1-2 with Insigne as the trequartista.\nNapoli has now won four of its last five games and is only three points off the top. Sarri has said it’s way too early to start thinking about the title, but even he might have noticed Italian coaching great Arrigo Sacchi’s comment in AS last month: “Naples is not a city with a winning mentality. This team has never won anything really important. Even Maradona, the best player I've seen, never lifted a European Cup.”\nCould this season be the time to end that?\nTop three players of the week Georginio Wijnaldum (Newcastle)\nThe Dutch midfielder scored four goals and inspired Newcastle to its first Premier League win of the season. The former PSV captain has now scored six this season–only Jamie Vardy has more in England's top flight–and becomes the first midfielder to score four in an English game since Frank Lampard in 2010. Newcastle needed inspiration before next week’s basement derby against Sunderland, and Wijnaldum provided it.\nNeymar (Barcelona)\nThe Brazilian also scored four goals. Neymar scored two penalties, which he won, with a smart new technique: short run-up, eyeballing the goalkeeper, and again waiting for him to move first. He could keep that job even when Messi returns. It was not just his spot kicks though; Neymar’s skills were on full display, as he also set up Luis Suarez for a fifth goal. Sport’s headline, \"Leader,\" summed it up.\nRaheem Sterling (Manchester City)\nThe Englishman, who showed some of the swagger that was his trademark at Liverpool, netted a hat trick as City coasted by Bournemouth . It helped that Kevin de Bruyne was on hand with some sensational passes–the defense-splitter for the second goal, which Sterling ran onto and dummied the keeper and two players before scoring was special–but Sterling has shown he can contribute to the goals tally when City needs it.\nAhead of games against Sevilla and Manchester United, that could be perfect timing.\nTop three goals of the week Miralem Pjanic (Roma vs. Empoli)\nThe Bosnian midfielder scored a cracking free kick in Roma’s home win. He has now scored three dead-ball goals this season and Ireland, which drew Bosnia & Herzegovina in the Euro 2016 qualifying playoffs, needs to beware.\nHatem Ben Arfa (Nice vs. Rennes)\nNice is now Ligue 1’s top-scoring team, with 17 goals in its last four games, the latest a 4-0 win over Rennes. Once again it was inspired by the in-form Ben Arfa, whose second goal of the night was this exquisite jink, dribble and finish (he also set up Said Benrahma for the fourth goal, which was not so bad itself). Talk will continue to link Ben Arfa to a France call-up but he may have burned those bridges now. Let’s just enjoy his talent while we can.\nSergio Pellissier (Chievo vs. Genoa)\nThis was a moment of genius from the Chievo captain, who has spent 15 years and played over 400 games for the Flying Donkeys. The cross is just behind him but no matter: a backheel-flick volley leveled the scores in Genoa before the host scored a last-minute winner.\nGo to MSN Home", "external_links": ["http://www.youtube.com/watch?v=kma-PcZF_fI", "http://www.si.com/planet-futbol/2015/10/15/podcast-usmnt-klinsmann-usa-mexico-u23-toronto-fc-mls-playoffs-klopp-mourinho", "http://www.si.com/", "http://fansided.com/2015/10/17/raheem-sterling-nets-first-half-hat-trick-manchester-city-video/", "http://www.si.com/planet-futbol/2015/10/18/newcastle-georginio-wijnaldum-four-goals-norwich-city", "http://go.microsoft.com/fwlink/?LinkID=286759"], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-20T12:41:08.307+03:00", "highlightTitle": ""}