{"organizations": [], "uuid": "4193516bbf7931eec442d07b96e6b715e36e9c9a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "http://images.tribuneindia.com/cms/gall_content/2015/10/2015_10$largeimg23_Friday_2015_204612483.JPG", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/nation/manjhi-seeks-stringent-action-against-vk-singh/149650.html", "country": "US", "title": "Manjhi seeks ‘stringent’ action against VK Singh", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "Manjhi seeks ‘stringent’ action against VK Singh", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "4193516bbf7931eec442d07b96e6b715e36e9c9a"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/nation/manjhi-seeks-stringent-action-against-vk-singh/149650.html", "ord_in_thread": 0, "title": "Manjhi seeks ‘stringent’ action against VK Singh", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Patna/Jammu, October 23\nBJP ally Hindustani Awam Morcha’s (HAM) chief Jitan Ram Manjhi on Friday criticised Union Minister V.K. Singh’s ‘dog remark’ and urged Prime Minister Narendra Modi to initiate action against him. “If V.K. Singh has compared the incident of burning of Dalits with (burning of) dogs, the Prime Minister should take cognisance of it and initiate appropriate action against him,” Manjhi said in a statement. Manjhi, a former Bihar Chief Minister and a prominent Dalit leader, sought “stringent” action for the remark “so that no leader dare to make such a statement on incident of atrocities on Dalits.” He said he was deeply hurt by the Faridabad incident, where four members of a Dalit family were set on fire resulting in the death of two children. Manjhi said taking birth in any caste or a house was not in the control of an individual. “If somebody has taken birth in a Dalit family, what’s his/her fault? What kind of crime is in being a Dalit?” he said in the statement. Union Minister of State and another BJP ally Rashtriya Lok Samata Party (RLSP) chief Upendra Kushwaha has also advised leaders to avoid giving such controversial statements. Singh’s remark had also provided opportunities to grand secular alliance leaders Nitish Kumar and Lalu Prasad to attack BJP-led NDA in Bihar, where Assembly polls are on. The Congress, one of the three constituents of Grand Secular Alliance along with JD(U) and RJD in Bihar, today asked the Prime Minister and BJP president Amit Shah to break their silence on V.K. Singh’s dog remark and urged the Prime Minister to sack him from the ministry. “Both Prime Minister Narendra Modi and BJP president Amit Shah have not spoken a word on such a sensitive issue (dog remark). This shows the mindset of BJP and its central leadership which is reflected in General V.K. Singh’s remark. “They do not differentiate between a man and a dog,” Bihar PCC president Ashok Choudhary said in Patna. The Opposition National Conference in Jammu and Kashmir today criticised Gen Singh for his dog analogy and demanded “stern action” against him. “(It is) Very unfortunate, shameful and unbecoming of a minister. It deserves condemnation. I would call it very uncivilised on the part of General to have made such a callous, careless remark, just an apology will not do. “Stern action should be taken against any responsible person who makes such an irresponsible statements,” NC Provincial president Devender Singh Rana told reporters here today. Asked if the Prime Minister should ask Singh to resign, Rana said, “That is not for anybody to say that he should resign, but under law I think he should be prosecuted for making such a derogatory remark against a section of a society.” — PTI", "external_links": [], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-23T22:25:56.550+03:00", "highlightTitle": ""}