{"organizations": [], "uuid": "a4f51e01187391cbdba91d0f61c8a0d01d2682e1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/47529300.cms", "site_section": "http://timesofindia.indiatimes.com/sports/racing/top-stories/articlelist/10514745.cms", "section_title": "Top Stories - Racing - Sports - The Times of India", "url": "http://timesofindia.indiatimes.com/sports/racing/top-stories/I-never-sprayed-Putin-says-Hamilton/articleshow/49325917.cms", "country": "IL", "title": "I never sprayed Putin, says Hamilton", "performance_score": 0, "site": "indiatimes.com", "participants_count": 2, "title_full": "I never sprayed Putin, says Hamilton - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 1, "uuid": "a4f51e01187391cbdba91d0f61c8a0d01d2682e1"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/sports/racing/top-stories/I-never-sprayed-Putin-says-Hamilton/articleshow/49325917.cms", "ord_in_thread": 0, "title": "I never sprayed Putin, says Hamilton", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Formula One world champion Lewis Hamilton has dismissed as wide of the mark reports that he sprayed Russian President Vladimir Putin with the winner's champagne after Sunday's grand prix in Sochi.\n\"I actually didn't. I didn't actually spray him. I think there's a weird picture but I didn't spray him. I definitely don't want anything (to happen),\" the Mercedes driver told Sky Sports television on Monday with a smile.\nHamilton, who flew back home to Britain to join the team's celebrations after they won their second successive constructors' championship in Russia, has got into trouble previously for his champagne-spraying antics on the podium.\nHe was criticised and accused of sexist bullying in April for aiming a spray of champagne directly in the face of a Chinese Grand Prix hostess in Shanghai.\nThat incident, highlighted in photographs that showed the woman flinching, triggered condemnation in Britain and Germany as well as on Chinese social media but the hostess herself played it down.\nPutin presented Hamilton with the winner's trophy on Sunday, with the Briton starting the traditional champagne spraying ritual before the president had left the podium.\nPhotographs appeared to show dark flecks of champagne foam on the back of Putin's jacket as he departed.\nSome media reports subsequently suggested Hamilton, who is now on the brink of a third drivers' title, had 'soaked' the Russian leader, leading to jokes on social media about what punishment the driver might suffer.", "external_links": [], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-19T23:39:53.237+03:00", "highlightTitle": ""}