{"organizations": [], "uuid": "ceff4ec09f565e5e39d4a1b11c0291456d23cc99", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "herald-review.com", "main_image": "http://bloximages.chicago2.vip.townnews.com/herald-review.com/content/tncms/assets/v3/editorial/a/0e/a0ed95b7-38d7-5499-a0a1-7e4526de189c/561a4f647085f.image.jpg", "site_section": "http://www.herald-review.com/search/?f=rss&c[]=sports/golf&sd=desc&s=start_time", "section_title": "herald-review.com - RSS Results in sports/golf", "url": "http://herald-review.com/sports/golf/an-exciting-outcome-in-presidents-cup-nothing-more/article_b0c4e05c-cd8d-5c66-ade5-35ed209a4e1e.html", "country": "US", "title": "An exciting outcome in Presidents Cup, nothing more", "performance_score": 0, "site": "herald-review.com", "participants_count": 1, "title_full": "An exciting outcome in Presidents Cup, nothing more", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T13:56:00.000+03:00", "replies_count": 0, "uuid": "ceff4ec09f565e5e39d4a1b11c0291456d23cc99"}, "author": "DOUG FERGUSON", "url": "http://herald-review.com/sports/golf/an-exciting-outcome-in-presidents-cup-nothing-more/article_b0c4e05c-cd8d-5c66-ade5-35ed209a4e1e.html", "ord_in_thread": 0, "title": "An exciting outcome in Presidents Cup, nothing more", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "1 of 3 Lee Jin-man \nUS team captain Jay Haas, front centre, poses with his team after they defeated the International team 15 1/2 to 14 1/2 to retain the Presidents Cup at the Jack Nicklaus Golf Club Korea, in Incheon, South Korea, Sunday, Oct. 11, 2015.(AP Photo/Lee Jin-man) Woohae Cho \nUS team captain Jay Haas, front centre, poses with his team after they defeated the International team 15 1/2 to 14 1/2 to retain the Presidents Cup at the Jack Nicklaus Golf Club Korea, in Incheon, South Korea, Sunday, Oct. 11, 2015. (AP Photo/Woohae Cho) Woohae Cho \nUnited States' Rickie Fowler takes a selfie photo as he celebrate's after defeating the International team 15 1/2 to 14 1/2 to retain the Presidents Cup at the Jack Nicklaus Golf Club Korea, in Incheon, South Korea, Sunday, Oct. 11, 2015.(AP Photo/Woohae Cho) AP An exciting outcome in Presidents Cup, nothing more By DOUG FERGUSON 0 Lee Jin-man \nUS team captain Jay Haas, front centre, poses with his team after they defeated the International team 15 1/2 to 14 1/2 to retain the Presidents Cup at the Jack Nicklaus Golf Club Korea, in Incheon, South Korea, Sunday, Oct. 11, 2015.(AP Photo/Lee Jin-man) Woohae Cho \nUS team captain Jay Haas, front centre, poses with his team after they defeated the International team 15 1/2 to 14 1/2 to retain the Presidents Cup at the Jack Nicklaus Golf Club Korea, in Incheon, South Korea, Sunday, Oct. 11, 2015. (AP Photo/Woohae Cho) Woohae Cho \nUnited States' Rickie Fowler takes a selfie photo as he celebrate's after defeating the International team 15 1/2 to 14 1/2 to retain the Presidents Cup at the Jack Nicklaus Golf Club Korea, in Incheon, South Korea, Sunday, Oct. 11, 2015.(AP Photo/Woohae Cho) \nINCHEON, South Korea (AP) — The best Presidents Cup in 10 years revealed exactly what the Americans need to do if they want to win the Ryder Cup. \nLobby for an increase in points. \nThe International team long believed that playing more matches gave the Americans an advantage because of their depth, and the fact this Presidents Cup wasn't decided until the final match suggests some truth to that. \nIt was a petty argument. The International team was disappointed the matches were not reduced from 34 to 28, and the Americans were irritated by a compromise that reduced them to 30. This was as close as the Presidents Cup has ever come to hard feelings. \nThat's why the two cups only the look the same from the outside. One contains a bone dry martini, the other a lava flow. \nAnd that's why the Americans should celebrate great golf and a great victory without thinking it was a big step toward solving their recent Ryder Cup woes. \nIt's not going to hurt. The assistants that U.S. captain Jay Haas had with him last week were Ryder Cup captain Davis Love III, Fred Couples, Jim Furyk and Steve Stricker. At least three of them will be central figures at the Ryder Cup for the rest of the decade or more. The idea behind that Ryder Cup Task Force was to build some continuity. \nEven so, the Presidents Cup is more like a dress rehearsal compared with opening night that is the Ryder Cup. \nThe theater was full at the Jack Nicklaus Golf Club Korea, and cheers resounded from across the course for great shots. The players just couldn't figure out what they meant. The Koreans had never seen such a collection of golf stars before. Except for Bae Sang-moon and Danny Lee, this was not a partisan crowd. \nDuring one of the early practice rounds, as five players were in one group and there were laughs all around, one of the coaches was hopeful that the Americans could take this relaxed mood with them to Hazeltine for the Ryder Cup next year. \nBut they can't. Or at least they haven't. \nThe Ryder Cup is different. The stakes are higher, the scrutiny more intense. The competition is tougher. Golf gets personal that week. \nInternational captain Nick Price spoke all speak about how difficult it was to pull together 12 players from seven countries on three continents who spoke six languages (more considering Anirban Lahiri also speaks Bengali and some Punjabi), and how proud he was of how well they bonded. What he didn't mention is that the flag is manufactured, and so is the name of the team. \nThe running joke in the early days of the Presidents Cup was that it was the United States against Florida because so many were PGA Tour members. That hasn't changed. Thongchai Jaidee of Thailand was the only International player who won't have full PGA Tour status next season. \nThat's what prompted Couples, golf's version of Yogi Berra, to say, \"They're all Americans, they were just born in a different country.\" \nBut this is about more than a country, a continent or even a flag. \nThe Ryder Cup rivalry is about a tour. \nIt's the European Tour — \"country cousins\" is the term Padraig Harrington once used — against the PGA Tour that is so rich and powerful that it's where most Europeans want to play. You can create a rivalry, but not a chip on the shoulder. That's personal. \nAnd you can't transfer that winning feeling from one cup to the other, either. They are separate events. Americans play loose and make putts in the Presidents Cup because that's all they've been doing since it started in 1994 (except for 1998 in Australia, when a lot of them were shopping online for Christmas). \nEurope is loose and making putts in the Ryder Cup because they've been winning. It takes the Americans winning the Ryder Cup, and winning it again, to change that. And the Americans haven't won consecutive Ryder Cups since the year Jordan Spieth was born. \nThe tide is shifting in the Ryder Cup. The youth movement is strong, and most of it resides in America — Spieth, Dustin Johnson, Fowler, Patrick Reed, with a host of others who will make it harder than ever to get on a team. \nThat ebb didn't start Sunday in South Korea. It won't start until next fall in Minnesota. \nAmong the guests last week on a bone-chilling Sunday was Derek Sprague, the PGA of America president who already is doing his part to boost U.S. chances by not making the Ryder Cup about him. Love was driving by when he saw Sprague, called him over and said. \"I've already some ideas for next year.\" \nSprague went over to hear them. \n\"Hand warmers,\" Love said.", "external_links": [], "published": "2015-10-12T13:56:00.000+03:00", "crawled": "2015-10-13T22:45:36.241+03:00", "highlightTitle": ""}