{"organizations": [], "uuid": "765be8e5fb5713e2192cb32523a45041e07af405", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbssports.com", "main_image": "http://sports.cbsimg.net/images/blogs/Goodell-Tom-Brady-10-07-15.png", "site_section": "http://www.cbssports.com/partners/feeds/rss/home_news", "section_title": "Sports News : CBSSports.com", "url": "http://www.cbssports.com/nfl/eye-on-football/25330933/goodell-has-no-regrets-suspending-tom-brady-rules-apply-to-everyone", "country": "US", "title": "Goodell has no regrets suspending Tom Brady: 'Rules apply to everyone'", "performance_score": 0, "site": "cbssports.com", "participants_count": 22, "title_full": "Goodell has no regrets suspending Tom Brady: 'Rules apply to everyone' - CBSSports.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T05:00:00.000+03:00", "replies_count": 39, "uuid": "66db80f06c84ff86c45a2a915cc7f9510f8dcb3c"}, "author": "John Breech", "url": "http://www.cbssports.com/nfl/eye-on-football/25330933/goodell-has-no-regrets-suspending-tom-brady-rules-apply-to-everyone#post-0", "ord_in_thread": 0, "title": "Goodell has no regrets suspending Tom Brady: 'Rules apply to everyone'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "It was just over a month ago that Tom Brady 's four-game suspension for Deflategate was overturned by United States District Court Judge Richard Berman.\n\nThe latest from SportsLine Jets, Giants gaining respect \n\nThe only reason the Patriots quarterback was in court is because NFL commissioner Roger Goodell had upheld Brady's four-game suspension after a June 23 appeal hearing .\nIt's a good thing Brady doesn't have to deal with Goodell anymore because if the NFL commissioner had to do it all over again, it sounds like he'd definitely hit Brady with another four-game suspension.\nDuring the owners meetings in New York on Wednesday, Goodell said that he doesn't regret suspending Brady and that the NFL's rules \"apply to everybody.\"\n\"I have a lot of respect and admiration for Tom. I know him personally. I admire him tremendously, and he's a future Hall of Fame player,\" Goodell said. \"But our rules apply to everybody. They apply to every single player.\"\nGoodell said the league will never play favorites.\n\"Every single player expects those rules to apply to everybody,\" Goodell said. \"Every coach does, every fan does, every partner, every team does. So our rules and the integrity of our game aren't because somebody's popular or somebody's a Super Bowl champ or not. They're to be applied evenly. Our teams expect that, and that's our job. That's our responsibility. That's my job.\"\nAlthough Deflategate dragged on for almost nine months and cost the NFL over $5 million to investigate, Goodell has no regrets suspending Brady.\n\"I don't regret that, and we will continue to uphold the integrity of the game, and we'll do that as vehemently as we can,\" Goodell said.\nThe NFL is appealing Judge Berman's decision and a big reason the league is doing that is because Goodell wants to make sure he has the power he was given when the players and owners negotiated the Collective Bargaining Agreement in 2011.\n\"This isn't about any individual player or any individual incident,\" Goodell said. \"This is about the rights that we negotiated in 2011, the rights for us to have the authority to make sure we discipline. Protecting the integrity of the game is not something we're going to compromise.\"\nIf you were hoping you'd never hear the words Deflategate again, that's not going to happen. The NFL's appeal is expected to be heard as early as Feb. 1 , right around the time that Brady could be playing in the Super Bowl .\n\nRoger Goodell has no regrets suspending Tom Brady. (NFL.com screen grab) \n\nTopics: Tom Brady , New England Patriots , NFL", "external_links": [], "published": "2015-10-08T05:00:00.000+03:00", "crawled": "2015-10-08T07:52:40.404+03:00", "highlightTitle": ""}