{"organizations": ["AP"], "uuid": "8096f0db1bb55efb4264b07086b03bb7ef5b6c8d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.krmg.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/19/32/aa/5379e862be2243daa45fae637dc1ea3f-6fc3eec021224d1cab535d20d8e627a0-0.jpg", "site_section": "http://www.krmg.com/feeds/categories/sports/", "section_title": "News | Sports", "url": "http://www.krmg.com/ap/ap/top-news/oscar-pistorius-released-from-prison-put-under-hou/nn58L/", "country": "US", "title": "Pistorius at uncle's mansion after being released from jail", "performance_score": 0, "site": "krmg.com", "participants_count": 0, "title_full": "Pistorius at uncle's mansion after being released from jail", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T13:30:00.000+03:00", "replies_count": 0, "uuid": "8096f0db1bb55efb4264b07086b03bb7ef5b6c8d"}, "author": "", "url": "http://www.krmg.com/ap/ap/top-news/oscar-pistorius-released-from-prison-put-under-hou/nn58L/", "ord_in_thread": 0, "title": "Pistorius at uncle's mansion after being released from jail", "locations": ["Pretroia", "South Africa", "Pretoria", "JOHANNESBURG"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["CHRISTOPHER TORCHIA", "Herman Verwey/Pool", "Oscar Pistroius", "Manelisi Wolela", "Thokozile Masipais", "Themba Hadebe", "Hadebe", "Pistorius", "Anneliese Burgess", "Burgess", "Oscar Pistorius"], "text": "Updated: 5:31 a.m. Tuesday, Oct. 20, 2015 | Posted: 5:30 a.m. Tuesday, Oct. 20, 2015 Pistorius at uncle's mansion after being released from jail Related View Larger FILE - In this Friday, Oct. 17, 2014 file photo, Oscar Pistorius is escorted by police officers as he leaves the high court in Pretoria, South Africa. A South African official says Oscar Pistorius has been released from prison and placed under house arrest. Manelisi Wolela, a spokesman for South Africa's correctional services department, said the double-amputee Olympic runner who fatally shot his girlfriend on Valentine's Day 2013 was put under \"correctional supervision\" late on Monday, Oct. 19, 2015. (AP Photo/Themba Hadebe, File) View Larger FILE - In this Tuesday, Oct. 21, 2014 file photo, Oscar Pistorius sits in court in Pretoria, South Africa, after judge Thokozile Masipais sentenced him to five years imprisonment for culpable homicide. A South African official says Oscar Pistorius has been released from prison and placed under house arrest. Manelisi Wolela, a spokesman for South Africa's correctional services department, said the double-amputee Olympic runner who fatally shot his girlfriend on Valentine's Day 2013 was put under \"correctional supervision\" late on Monday, Oct. 19, 2015. (Herman Verwey/Pool photo via AP, file) View Larger The Kgosi Mampuru Prison is seen in Pretroia Tuesday, Oct. 20, 2015. Oscar Pistorius, the double-amputee Olympic runner who fatally shot his girlfriend in 2013, was released from the prison and placed under house arrest on Monday night. Pistorius had served nearly a year of his five-year sentence for manslaughter. (AP Photo) View Larger Pedestrians walk across the house of Oscar Pistorius' uncle in Pretoria, South Africa, Tuesday, Oct. 20, 2015. Pistorius, the double-amputee Olympic runner who fatally shot his girlfriend in 2013, was released from prison and placed under house arrest on Monday night, a South African official said. While out on bail during his trial, the 28-year-old Pistorius had stayed at his uncle's mansion in an upmarket suburb of Pretoria. (AP Photo/Themba Hadebe) View Larger A security officer walks across the the house of Oscar Pistorius' uncle in Pretoria, South Africa, Tuesday, Oct. 20, 2015. Pistorius, the double-amputee Olympic runner who fatally shot his girlfriend in 2013, was released from prison and placed under house arrest on Monday night, a South African official said. While out on bail during his trial, the 28-year-old Pistorius had stayed at his uncle's mansion in an upmarket suburb of Pretoria. (AP Photo/Themba Hadebe) View Larger Anneliese Burgess, a spokesperson for Oscar Pistroius family, reads a statement outside the house of Pistorius' uncle in Pretoria, South Africa, Tuesday, Oct. 20, 2015. Pistorius, the double-amputee Olympic runner who fatally shot his girlfriend in 2013, was released from prison and placed under house arrest on Monday night, a South African official said. The spokeswoman for Oscar Pistorius' family said the athlete is at his uncle's home after being released from jail to move to house arrest. (AP Photo/Themba Hadebe) View Larger The house of Oscar Pistorius's uncle stands in Pretoria, South Africa, Tuesday, Oct. 20, 2015. A spokeswoman for Oscar Pistorius' family said the athlete is at his uncle's home after being released from jail to move to house arrest. Pistorius, the double-amputee Olympic runner, fatally shot his girlfriend in 2013. (AP Photo/Themba Hadebe) View Larger Oscar Pistorius' uncle's house stands in Pretoria, South Africa, Tuesday, Oct. 20, 2015. A spokeswoman for Oscar Pistorius' family says the athlete is at his uncle's home after being released from jail to move to house arrest. Speaking outside the home of Pistorius' uncle, Anneliese Burgess said Tuesday \"Oscar is here and Oscar is at home with the family.\" (Themba Hadebe) View Larger The house of Oscar Pistorius's uncle is seen in Pretoria, South Africa, Tuesday, Oct. 20, 2015. A spokeswoman for Oscar Pistorius' family said the athlete is at his uncle's home after being released from jail to move to house arrest. Pistorius, the double-amputee Olympic runner, fatally shot his girlfriend in 2013. (AP Photo/Themba Hadebe) View Larger Anneliese Burgess, a family spokesperson, reads a statement outside Oscar Pistorius' uncle's house in Pretoria, South Africa, Tuesday, Oct. 20, 2015. Burgess says the athlete is at his uncle's home after being released from jail to move to house arrest. Burgess said Tuesday \"Oscar is here and Oscar is at home with the family.\" (AP Photo/Themba Hadebe) View Larger Anneliese Burgess, a family spokesperson, takes a question after reading a statement outside Oscar Pistorius' uncle's house in Pretoria, South Africa, Tuesday, Oct. 20, 2015. Burgess says the athlete is at his uncle's home after being released from jail to move to house arrest. Burgess said Tuesday \"Oscar is here and Oscar is at home with the family.\" (AP Photo/Themba Hadebe) By CHRISTOPHER TORCHIA and GERALD IMRAY The Associated Press JOHANNESBURG — \nOscar Pistorius was with his family at his uncle's mansion Tuesday after the Olympic athlete who killed his girlfriend was released from prison under cover of darkness and moved to house arrest a day earlier than expected. \n\"Oscar is here, and Oscar is at home with the family,\" said Anneliese Burgess, the spokeswoman for the Pistorius family, addressing dozens of reporters outside Arnold Pistorius' home in Waterkloof, an upmarket suburb of South Africa's capital Pretoria. \n\"The family is happy that Oscar is at home,\" Burgess said. \nPistorius, the double-amputee runner who fatally shot Reeva Steenkamp in 2013, was moved from a central Pretoria jail on Monday night when he had been expected to be released on Tuesday. \nHe left the jail at 7:30 p.m. local time, the Department of Corrections said, and appears to have slipped unnoticed by media into the three-story, red-bricked home that stands behind ornate black gates. \nThe murder trial of Pistorius generated intense international interest. The surprising decision to release Pistorius a day early, and at night, appeared to have avoided the spectacle and logistical challenges caused by a large gathering of TV crews and other journalists hoping to catch a glimpse of Pistorius on the way out of prison, nearly a year to the day after he was sent to jail. \nPistorius has served a year of a five-year sentence for manslaughter for killing Steenkamp. Under South African law, he is eligible to serve the remainder under correctional supervision, a form of house arrest. \nThe decision to release the 28-year-old Pistorius early was only communicated to his family at short-notice, Burgess said. Confirming Pistorius' release, South Africa's Department of Corrections said that the decision over when and how an offender is released is made by the prison. \n\"The handling of the actual placement is an operational matter of the local management, and how they handle it is their prerogative that is carried out in the best interest of all parties concerned,\" Manelisi Wolela, a spokesman for the corrections department, said in a cellphone text message. \nBurgess was surrounded by reporters and camera crews — many of whom had camped out at the house overnight — when reading a prepared statement outside Arnold Pistorius' house on Tuesday morning. Pistorius will be under house arrest at the grand home with lush, landscaped gardens and a large, cross-shaped swimming pool. Many ambassadorial residences line the street. \nApparently responding to criticism that Pistorius' release after just a year in prison was too lenient, Burgess said Pistorius' sentence \"has not been shortened or reduced.\" \n\"He now enters the next phase of his sentence. He will serve this under the strict conditions that govern correctional supervision,\" she said. \nUnder South African law, an offender sentenced to five years or less in jail can be released to correctional supervision after serving one-sixth of the term — in Pistorius' case 10 months. \nThe full conditions under which Pistorius must live for the next four years have not been released by the corrections department and Burgess would not detail them on Tuesday. Only two conditions for Pistorius' house arrest were previously made public: Pistorius must continue to undergo psychotherapy while under house arrest and he is not allowed to handle any firearms. \nTypically, offenders under correctional supervision can only leave their home for specific reasons, like to attend church or to do grocery shopping. They generally cannot leave the house at night. Pistorius will not be required to wear an electronic tagging device. \nPistorius would \"strictly adhere to\" the conditions of his release, Burgess said, and his family would \"support him.\" \nPistorius was acquitted of murder last year for the Valentine's Day shooting death of Steenkamp, but prosecutors have appealed the trial verdict of culpable homicide, or manslaughter, and will seek a murder conviction again at South Africa's Supreme Court on Nov. 3. \nIf Pistorius is convicted of murder by a panel of five judges at the appeal, he faces going back to prison for 15 years, the minimum sentence for murder in South Africa, which no longer has the death penalty. \nPistorius has maintained that he thought Steenkamp was an intruder in his Pretoria home and killed her by mistake. Prosecutors said he shot her intentionally during an argument after she fled to a bathroom stall. \nFollowing a suggestion by South Africa's minister of justice that Pistorius should meet with the parents of his slain girlfriend, Tania Koen, the lawyer for Steenkamp's parents, said they would be open to that. \nHowever, \"the timing would have to be right,\" Koen told the AP. The proper time would be after Pistorius' case is heard by the Supreme Court, Koen said, and \"he (Pistorius) would have to initiate it.\" \nOn the day she was killed by Pistorius, Reeva Steenkamp was due to give a speech on domestic abuse at a school. Her mother will on Wednesday deliver that same speech at a school in the Steenkamps' home town of Port Elizabeth, Koen said. \nPistorius, known as \"Blade Runner\" for his carbon-fiber running blades, gained worldwide fame when he ran against able-bodied athletes at the 2012 London Olympics, the first amputee runner to compete at the games. \nWolela, the correctional services department spokesman, had previously not ruled out ultimately allowing Pistorius to return to training, although it's unclear if Pistorius has the desire to revive his once-inspiring athletics career. \n___ \nImray reported from Somerset West, South Africa. Copyright The Associated Press", "external_links": [], "published": "2015-10-20T13:30:00.000+03:00", "crawled": "2015-10-20T14:23:02.351+03:00", "highlightTitle": ""}