{"organizations": [], "uuid": "e7bf3da9dcf4563e02694ba6c74b23dc77f46de1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nj.com", "main_image": "http://imgick.nj.com/home/njo-media/width620/img/njcom_photos/photo/2015/10/18/18996217-standard.jpg", "site_section": "http://blog.nj.com/realtimesports_impact/rss.xml", "section_title": "New Jersey Real-Time Sports", "url": "http://www.nj.com/rutgersfootball/index.ssf/2015/10/rutgers_receiver_leonte_carroo_will_be_a_game-time.html", "country": "IL", "title": "Rutgers receiver Leonte Carroo will be a game-time decision for Ohio State matchup", "performance_score": 0, "site": "nj.com", "participants_count": 1, "title_full": "Rutgers receiver Leonte Carroo will be a game-time decision for Ohio State matchup", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T19:57:00.000+03:00", "replies_count": 0, "uuid": "e7bf3da9dcf4563e02694ba6c74b23dc77f46de1"}, "author": "Dan Duggan | NJ Advance Media for NJ.com", "url": "http://www.nj.com/rutgersfootball/index.ssf/2015/10/rutgers_receiver_leonte_carroo_will_be_a_game-time.html", "ord_in_thread": 0, "title": "Rutgers receiver Leonte Carroo will be a game-time decision for Ohio State matchup", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments \nPISCATAWAY — Each day this week, Rutgers wide receiver Leonte Carroo has been able to do more. The question now is if the Scarlet Knights' best player will make enough progress from an ankle injury to play in Saturday night's matchup with No. 1 Ohio State at High Point Solutions Stadium . \n\"Leonte was out here today,\" Rutgers coach Kyle Flood said after the team's practice on Thursday. \"He did some stuff. He did more than yesterday and he's moving in the right direction.\" \nRutgers has a somewhat unconventional practice schedule, as Thursdays are light days referred to as \"run-throughs.\" The team holds more physically demanding practices on Fridays, whereas many teams hold \"walk-throughs\" the day before a game. \nCarroo, who has 21 catches for 472 yards and nine touchdowns this season, missed the most intense practices of the week on Tuesday and Wednesday, but Flood said the receiver did more on Wednesday than Tuesday. Carroo's status for Saturday likely won't be known until pregame warm-ups. \n\"What that means for Saturday, I don't really know,\" Flood said. \"We'll put out (an injury) report tomorrow. But it's probably going to be a game-time decision.\" \nFlood said on Wednesday that he doesn't have a strict guideline in regards to how many times a player needs to practice to be ready for a game. \n\"For a younger player, you'd like to see him out there,\" Flood said. \"Somebody like Leonte, who has played so much football, I don't really have a concern.'' \nRELATED: Do Rutgers' questionable players typically play? \nFive significant contributors were listed as questionable on the injury report Flood released on Monday, including starting cornerback Blessuan Austin (upper body). If Austin can't play, true freshman Jarius Adams would be in line for his first career start. \n\"Jarius had a good week,\" Flood said. \"I like how he's prepared. I like how mentally he's locked in. Now he's got to go out there Saturday and take the corrections from last week and be a better player, because that's all we want. We just want him to keep improving as the season goes on.\"", "external_links": [], "published": "2015-10-22T19:57:00.000+03:00", "crawled": "2015-10-22T23:29:49.877+03:00", "highlightTitle": ""}