{"organizations": [], "uuid": "ab68c38c9fd1ce8349d2411335e83835e39e2c0a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.timesunion.com", "main_image": "http://ww2.hdnux.com/photos/41/31/47/8755665/5/rawImage.jpg", "site_section": "http://www.timesunion.com/default/feed/default/feed/Sports-News-64.php", "section_title": "Sports News", "url": "http://www.timesunion.com/sports/article/Albany-Academy-wins-Class-A-golf-title-6557642.php", "country": "US", "title": "Albany Academy wins Class A golf title", "performance_score": 0, "site": "timesunion.com", "participants_count": 1, "title_full": "Albany Academy wins Class A golf title - Times Union", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T07:37:00.000+03:00", "replies_count": 0, "uuid": "ab68c38c9fd1ce8349d2411335e83835e39e2c0a"}, "author": "Pete Dougherty", "url": "http://www.timesunion.com/sports/article/Albany-Academy-wins-Class-A-golf-title-6557642.php", "ord_in_thread": 0, "title": "Albany Academy wins Class A golf title", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: Lori Van Buren Image 1 of / 11 Caption\nClose\nImage 1 of 11 Austin Fox of Bethlehem makes a putt during the Section II Class A golf championship at Eagle Crest Golf Club on Wednesday, Oct. 7, 2015 in Clifton Park, N.Y. (Lori Van Buren / Times Union)\nBuy this photo Photo: Lori Van Buren Austin Fox of Bethlehem makes a putt during the Section II Class A... Image 2 of 11 Erin Rivera of Amsterdam putts during the Section II Class A golf championship at Eagle Crest Golf Club on Wednesday, Oct. 7, 2015 in Clifton Park, N.Y. (Lori Van Buren / Times Union)\nBuy this photo Photo: Lori Van Buren Erin Rivera of Amsterdam putts during the Section II Class A golf... Image 3 of 11 Pat Mattis of Bethlehem chips onto the green during the Section II Class A golf championship at Eagle Crest Golf Club on Wednesday, Oct. 7, 2015 in Clifton Park, N.Y.(Lori Van Buren / Times Union)\nBuy this photo Photo: Lori Van Buren Pat Mattis of Bethlehem chips onto the green during the Section II... Image 4 of 11 Mitch Virkler of Shenendehowa putts during the Section II Class A golf championship at Eagle Crest Golf Club on Wednesday, Oct. 7, 2015 in Clifton Park, N.Y. Pat Mattis of Bethlehem watches at left. (Lori Van Buren / Times Union)\nBuy this photo Photo: Lori Van Buren Mitch Virkler of Shenendehowa putts during the Section II Class A... Image 5 of 11 Zack Douglas of Ballston Spa reads his next putt during the Section II Class A golf championship at Eagle Crest Golf Club on Wednesday, Oct. 7, 2015 in Clifton Park, N.Y. (Lori Van Buren / Times Union)\nBuy this photo Photo: Lori Van Buren Zack Douglas of Ballston Spa reads his next putt during the Section... Image 6 of 11 Tim Pisinski of Shaker just misses a putt during the Section II Class A golf championship at Eagle Crest Golf Club on Wednesday, Oct. 7, 2015 in Clifton Park, N.Y. Pat Mattis of Bethlehem watches at left. (Lori Van Buren / Times Union)\nBuy this photo Photo: Lori Van Buren Tim Pisinski of Shaker just misses a putt during the Section II... Image 7 of 11 Jess Messina of Shaker hits a fairway shot during the Section II Class A golf championship at Eagle Crest Golf Club on Wednesday, Oct. 7, 2015 in Clifton Park, N.Y. (Lori Van Buren / Times Union)\nBuy this photo Photo: Lori Van Buren Jess Messina of Shaker hits a fairway shot during the Section II... Image 8 of 11 Austin Fox of Bethlehem hits a fairway shot during the Section II Class A golf championship at Eagle Crest Golf Club on Wednesday, Oct. 7, 2015 in Clifton Park, N.Y. (Lori Van Buren / Times Union)\nBuy this photo Photo: Lori Van Buren Austin Fox of Bethlehem hits a fairway shot during the Section II... Image 9 of 11 Christian Gramuglia of Burnt Hills-Ballston Lake hits a fairway shot during the Section II Class A golf championship at Eagle Crest Golf Club on Wednesday, Oct. 7, 2015 in Clifton Park, N.Y. (Lori Van Buren / Times Union)\nBuy this photo Photo: Lori Van Buren Christian Gramuglia of Burnt Hills-Ballston Lake hits a fairway... Image 10 of 11 Austin Fox of Bethlehem watches his ball just miss the hole during the Section II Class A golf championship at Eagle Crest Golf Club on Wednesday, Oct. 7, 2015 in Clifton Park, N.Y. (Lori Van Buren / Times Union)\nBuy this photo Photo: Lori Van Buren Austin Fox of Bethlehem watches his ball just miss the hole during... Image 11 of 11 Albany Academy wins Class A golf title 1 / 11 Back to Gallery Clifton Park\nWhen a sophomore-heavy Albany Academy team won the Section II Class A golf championship two years ago, it was a surprise. When those same Cadets finished third last year, it was a disappointment.\nSo in their final shot to show that the 2013 title wasn't a fluke, four Academy seniors were on a mission Wednesday at Eagle Crest Golf Club .\nTom Sneeringer carded an even-par 72 to lead four Cadets who shot 80 or lower to give Academy its second sectional championship in three years.\n\"That's a day marked on our calendars since that day,\" said Sneeringer, referring to last year's sectionals. \"We had a bitter taste in our mouth. We figured we would come out here and give it our best shot, and it worked out for us.\"\nAlbany Academy ended 11 strokes behind co-winners CBA and Shaker last year. This time the Cadets cruised to a nine-shot victory over Shenendehowa.\n\"They felt like they let it slip last year,\" 13th-year Academy coach Jak Bestle said. \"Other teams played really well, and they wanted to get back to the top this year. On top of that, they wanted to get as many guys as possible to make it through to the next round. These are four seniors who have been together since freshman year, so it's a pretty special thing moving on to Orchard Creek next week.\"\nThe top 27 — anyone who shot 83 or better — advanced to Tuesday's A-B-C-D championship at Orchard Creek. They will compete with the top 20 from Tuesday's Class B and C-D sectionals in a 36-hole competition to determine the nine-player state team. The field will be cut to the top 16 before the final round Thursday, Oct. 15.\nThe top four Cadets qualified, although Sneeringer lost medalist honors to Bethlehem sophomore Austin Fox , younger brother of two-time sectional champion Victor Fox , who shot 71.\n\"I've grown about six inches from last year,\" said Fox, who had four kick-in birdies and three bogeys, \"so I'm hitting the ball a lot farther and I've gotten a little better at hitting the ball straighter.\"\nShen advanced five players to the A-B-C-D qualifier but didn't have a player at par as Academy did with Sneeringer, who shot 84 last year and didn't advance to Orchard Creek. He contributed a 77 to the Cadets' winning effort in his sophomore season.\n\"At least for me, it helped so much,\" Sneeringer said of being part of the 2013 sectional champs. \"Even last year I was even nervous going into sectionals, and today I don't think I was nervous at all. I didn't make any bad decisions because of it. Even on the last hole, the last couple of putts, I was pretty even keel.\"\n\"It was a mission at the beginning of the year to get back to this point,\" Bestle said. \"There was really an air of confidence all week. I hadn't seen that in a while. It was fun to see them come through on the course.\"\npdougherty@timesunion.com • 518-454-5416 • @Pete_Dougherty\nSection II Class A golf\na advanced to next week's A-B-C-D qualifier\nTeam results\n(Four lowest scores count toward team total)\nAlbany Academy (304) : a- Tom Sneeringer 72 , a-John Malicki 75, a-Sean Puleo 77, a-Patrick Hayes 80, Ryan Warnick 89, Jon Scotto 91.\nShenendehowa (313) : a-Tommy McPartlon 75, a-Mike Ross 79, a-Mason Munger 79, a-Angelo Cafaro 80, a-Mitch Virkler 83, Paul Liguori 86.\nCBA (320) : a-Jack O'Hara 75, a-Connor Adams 80, a-Kyle Adams 80, Tyler Hartman 85, Ryan Munroe 87, Jake Bundy 96.\nBethlehem (320) : a-Austin Fox 71, a-Harry Thorpe 81, Tyler Hull 84, Henry Manley 84, Ryan Davis 86, Tat Mattis 87.\nSaratoga (333) : a-Rob Battle 83, a-Colton Hart 83, a-Nate Shawyer 83, Seungmin Kim 84, Ben Palmateer 84, Grayson DeMarco 87.\nGuilderland (334) : a-Kellen Reiner 80, a-Jimmy Gray 83, Colin Buyck 84, Will Burger 87, Bob Kelty 87, Jeff Sullivan 94.\nShaker (338) : a-Madison Braman 80, a-Tim Pinskinski 83, Nick Pascazio 86, Jess Messina 89, Cam Pierro 92, Hanna Fitzgerald 98.\nQueensbury (340) : a-Noah Bonn 80, Alex Hearley 84, Alec Chase 85, Josh Bonn 91, Riley Kain 95.\nBallston Spa (352) : a-Graem DeLong 79, Jake DeVito 89, Zach Douglas 92, Zach Durfee 92, Tyler Keegan 92, Dalton Krogh 97.\nNiskayuna (354) : a-Nick Rumsey 82, Michael Doxie 84, Tyler Gregory 88, Gallagher Gregory 100, Ryan Dell 103, Vince Tricozzi 105.\nLa Salle (364) : Rob DeBenedetti 90, Keane Toomey 90, Sebastian Vanderbeak 90, Ryan Brennan 94, Quentin Crudo 95, Logan Discanio 105.\nBurnt Hills (368): Christian Gramuglia 83, Owen Jones 83, Alex Wellington 95, Connor Hotaling 107, Gianni Plemenik 108.\nOther individuals\n(players whose teams weren't eligible for team title)\nAmsterdam : Jon LaBahn 104, Erin Rivera 107.\nAverill Park : Juliette Melita 90, D.J. Marone 104.\nColonie : Christian Ristau 94, Mike Jeffers 97, Anthony Bisognano NC, A.J. Mazzone NC.\nSchenectady : a-Wyatt Pisarski 78, Calvin Cleworth 85, Jason Cyr 87.", "external_links": ["http://ww3.hdnux.com/photos/41/31/47/8755674/5/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/31/47/8755665/5/920x920.jpg", "http://ww1.hdnux.com/photos/41/31/47/8755668/5/920x920.jpg", "http://ww4.hdnux.com/photos/41/31/47/8755671/5/920x920.jpg", "http://ww4.hdnux.com/photos/41/31/47/8755667/5/square_gallery_thumb.jpg", "http://timesunion.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20Times%20Union&image=http://ww2.hdnux.com/photos/41/31/47/8755665/5/628x471.jpg", "http://ww4.hdnux.com/photos/41/31/47/8755671/5/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/31/47/8755669/5/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/31/47/8755673/5/920x920.jpg", "http://ww3.hdnux.com/photos/41/31/47/8755666/5/920x920.jpg", "http://ww4.hdnux.com/photos/41/31/47/8755667/5/920x920.jpg", "http://timesunion.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20Times%20Union&image=http://ww3.hdnux.com/photos/41/31/47/8755670/5/628x471.jpg", "http://ww1.hdnux.com/photos/41/31/47/8755668/5/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/31/47/8755673/5/square_gallery_thumb.jpg", "http://timesunion.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20Times%20Union&image=http://ww3.hdnux.com/photos/41/31/47/8755666/5/628x471.jpg", "http://ww1.hdnux.com/photos/41/31/47/8755672/5/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/31/47/8755670/5/920x920.jpg", "http://timesunion.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20Times%20Union&image=http://ww3.hdnux.com/photos/41/31/47/8755674/5/628x471.jpg", "http://timesunion.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20Times%20Union&image=http://ww2.hdnux.com/photos/41/31/47/8755669/5/628x471.jpg", "http://ww3.hdnux.com/photos/41/31/47/8755674/5/920x920.jpg", "http://timesunion.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20Times%20Union&image=http://ww1.hdnux.com/photos/41/31/47/8755668/5/628x471.jpg", "http://timesunion.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20Times%20Union&image=http://ww4.hdnux.com/photos/41/31/47/8755667/5/628x471.jpg", "http://ww2.hdnux.com/photos/41/31/47/8755669/5/920x920.jpg", "http://ww2.hdnux.com/photos/41/31/47/8755665/5/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/31/47/8755670/5/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/41/31/47/8755672/5/920x920.jpg", "http://timesunion.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20Times%20Union&image=http://ww4.hdnux.com/photos/41/31/47/8755671/5/628x471.jpg", "http://timesunion.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20Times%20Union&image=http://ww1.hdnux.com/photos/41/31/47/8755672/5/628x471.jpg", "http://ww3.hdnux.com/photos/41/31/47/8755666/5/square_gallery_thumb.jpg", "http://timesunion.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20Times%20Union&image=http://ww2.hdnux.com/photos/41/31/47/8755673/5/628x471.jpg"], "published": "2015-10-08T07:37:00.000+03:00", "crawled": "2015-10-08T12:29:31.777+03:00", "highlightTitle": ""}