{"organizations": [], "uuid": "9ccd2688111970874c77e551e81a98f36a737af3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nwaonline.com", "main_image": "http://media.arkansasonline.com/img/photos/2015/10/21/82111545_Igor-mug.jpg", "site_section": "http://www.nwaonline.com/rss/headlines/sports/prep/", "section_title": "NWAonline stories: High School Sports - Northwest Arkansas", "url": "http://www.nwaonline.com/news/2015/oct/21/jacociunas-wins-6a-state-title-panthers-1/", "country": "US", "title": "Jacociunas wins 6A state title, Panthers runner-up", "performance_score": 0, "site": "nwaonline.com", "participants_count": 1, "title_full": "Jacociunas wins 6A state title, Panthers runner-up", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T09:00:00.000+03:00", "replies_count": 0, "uuid": "9ccd2688111970874c77e551e81a98f36a737af3"}, "author": "Staff Reports", "url": "http://www.nwaonline.com/news/2015/oct/21/jacociunas-wins-6a-state-title-panthers-1/", "ord_in_thread": 0, "title": "Jacociunas wins 6A state title, Panthers runner-up", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jacociunas wins 6A state title, Panthers runner-up Panthers state runner-up Posted: October 21, 2015 at 1 a.m. Igor Jacociunas \nSiloam Springs junior exchange student Igor Jacociunas defeated Jonesboro's Connor Mackey 6-3, 6-3 in the Class 6A boys state tennis singles finals at Russellville on Tuesday. \nThe Panthers finished as the Class 6A state runner-up behind Jonesboro, which won its eighth straight team championship. \n\"It is very exciting and such a blessing to get to be a part of such a great group of young men,\" said Siloam Springs tennis coach Scott Wright. \"They have worked hard all season to get to this point. Being the 2015 6A state runners-up and Igor winning the 2015 6A boys singles state title is a special moment for our team.\" \nIt was the third time Jacociunas and Mackey have played this season. The two played in a match at Conway on Sept. 10 with Mackey winning 8-2. They also played in the finals of the 6A-East Conference Tournament last week at Russellville with Mackey winning due to Jacociunas having to withdraw because of cramps. \nBut the third time proved to be the charm for Jacociunas, who came to Siloam Springs this fall as an exchange student from Brazil. \nEarlier on Tuesday, Jacociunas defeated Jonesboro's Eli Leonard 6-2, 6-1 to advance to the finals. \nBy reaching the finals, Jacociunas qualified to participate in the state overall tournament Oct. 28 and 29 at Burns Park in North Little Rock. \nAfter receiving an opening round bye, Jacociunas defeated Eli Jones of Little Rock Parkview 6-1, 6-0 in the quarterfinals to advance to Tuesday's semifinal. \nIn doubles action, the Siloam Springs team of juniors Kip Dooley and Noah Slater advanced to the Class 6A semifinals on Tuesday morning where they were defeated by Jonesboro's team of Tate Snider and Mason Mitchell 6-0, 6-2. \n\"Kip and Noah had a great run in the second half of the season taking fifth in conference and fourth in state,\" Wright said. \nOn Monday, Dooley and Slater had defeated the team of Yuen/Hanson of Little Rock Parkview 6-2, 6-0 in the opening round of the tournament. Dooley and Slater then defeated Lake Hamilton's team of Robbins and Larey 6-0, 6-0 in the quarterfinals. \nThey end the season with an 18-7 record in doubles action. \nAlso on Monday, Siloam Springs sophomore Orest Los won his opening round game against Matt Hortmann of Lake Hamilton 6-0, 6-0. However, Los lost to Junius Ross of Little Rock Hall 6-4, 6-2 in the quarterfinals. He finishes the season with a record of 22-4. \nSports on 10/21/2015", "external_links": [], "published": "2015-10-21T09:00:00.000+03:00", "crawled": "2015-10-21T14:14:44.783+03:00", "highlightTitle": ""}