{"organizations": [], "uuid": "32364246046a986b2824d7b63990e3f4433b9ebf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.upi.com", "main_image": "http://cdnph.upi.com/sv/ph/og/upi/8241444280662/2015/1/31c75feeebacbaeed4976bc0c5952e5d/v2.1/Defiant-New-York-Giants-WR-Odell-Beckham-Jr-plans-to-appeal-fine.jpg", "site_section": "http://rss.upi.com/news/sports_news.rss#", "section_title": "Sports News - UPI.com", "url": "http://www.upi.com/Sports_News/2015/10/08/Defiant-New-York-Giants-WR-Odell-Beckham-Jr-plans-to-appeal-fine/8241444280662/", "country": "US", "title": "Defiant Giant: Odell Beckham Jr. plans to appeal", "performance_score": 0, "site": "upi.com", "participants_count": 1, "title_full": "Defiant Giant: Odell Beckham Jr. plans to appeal - UPI.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T04:06:00.000+03:00", "replies_count": 0, "uuid": "32364246046a986b2824d7b63990e3f4433b9ebf"}, "author": "upi.com", "url": "http://www.upi.com/Sports_News/2015/10/08/Defiant-New-York-Giants-WR-Odell-Beckham-Jr-plans-to-appeal-fine/8241444280662/", "ord_in_thread": 0, "title": "Defiant Giant: Odell Beckham Jr. plans to appeal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "| License Photo EAST RUTHERFORD, N. J. -- After hearing he was fined $9,000 for throwing a punch in last week's 24-10 win over the Buffalo Bills, New York Giants wide receiver Odell Beckham Jr. said he will appeal and he will not change how he plays the game.\nBeckham was visible on tape swinging at Bills safety Duke Williams after quarterback Eli Manning had his first pass of the season picked off by defensive back Stephon Gilmore.\nBeckham, who was shoved to the ground on a legal block by Williams, got up and clearly threw a punch at the side of the Williams' head. Although that did not draw a flag in the game, the NFL reviewed the tape and determined there was indeed an infraction.\nBeckham, who seemed unimpressed by the fuss surrounding him Wednesday, said he planned to appeal the fine.\n\"I get punched every single game,\" he said. \"I get hit in my face every single game. It is what it is, but we're playing football and these are grown men out here.\n\"I don't think anybody should be talking about what happened after they lost the game.\"\nBut Beckham does not intend to change when it comes to discerning between aggression and retaliation.\n\"I just go out there and play football,\" he said. \"It's all there is to it; we're playing football and nothing else really matters.\"\nHead coach Tom Coughlin said that the fiery 22-year-old receiver came to him Wednesday morning to discuss his actions, which were first reported by the Buffalo News on Tuesday.\n\"Obviously I was disappointed because he is beyond and above a lot of that stuff,\" Coughlin said, adding. \"I think he'll put it behind him.\"\nThis is not the first time that Beckham has been involved in some extracurricular activities resulting from his competitive nature.\nLast year in a game against the St. Louis Rams, Beckham was at the center of a sideline brawl that resulted in defensive end Damontre Moore and now former receiver Preston Parker being ejected from the game after they went to Beckham's defense.\nIn this latest episode, the Bills weren't very complimentary of this year's cover boy on Madden football, calling him \"prima donna\" and a \"cheap shot\" artist, according to the Buffalo News report from Tuesday.\n\"It doesn't bother me,\" Beckham said of the Bills' criticism, which he said he didn't read. \"I sleep like a baby every night.\"\n  Report: NY Giants' Odell Beckham Jr. to be fined for punching Bills linebacker Giants' Odell Beckham Jr. headed to Pro Bowl NFL's Odell Beckham debuts as Head and Shoulders spokesman Beckham Jr. lands Madden NFL 16 cover", "external_links": [], "published": "2015-10-08T04:06:00.000+03:00", "crawled": "2015-10-08T08:17:36.561+03:00", "highlightTitle": ""}