{"organizations": [], "uuid": "1868db58ad460eb8224c7bfb0fd0c864a8260a35", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mailtribune.com", "main_image": "http://www.mailtribune.com/Global/images/head/nameplate/MailTribune_logo.png", "site_section": "http://www.mailtribune.com/sports/professional?template=rss&mime=xml", "section_title": "Pro Sports - MailTribune.com", "url": "http://www.mailtribune.com/article/20151014/SPORTS/151019821/101041/SPORTS?rssfeed=true", "country": "US", "title": "Manfred explores changes to takeout slide rule", "performance_score": 0, "site": "mailtribune.com", "participants_count": 1, "title_full": "Manfred explores changes to takeout slide rule", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T10:00:00.000+03:00", "replies_count": 0, "uuid": "1868db58ad460eb8224c7bfb0fd0c864a8260a35"}, "author": "Chicago Tribune", "url": "http://www.mailtribune.com/article/20151014/SPORTS/151019821/101041/SPORTS?rssfeed=true", "ord_in_thread": 0, "title": "Manfred explores changes to takeout slide rule", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Manfred explores changes to takeout slide rule Comment Posted Oct. 14, 2015 at 2:00 AM By Chicago Tribune Posted Oct. 14, 2015 at 2:00 AM » Social News After the success of the so-called Buster Posey rule to protect catchers from home plate collisions, baseball is now looking to alter the rule on takeout slides. “We started talking to the union about this,” commissioner Rob Manfred said before Game 4 of the Cubs-Cardinals NLDS at Wrigley Field. “It is another example of player safety, which is really high on our radar screen. We’ve got a lot of money invested in ballplayers. The players themselves have tremendous playing opportunities in terms of what they can earn and I think it’s important we protect them.” The proposed change stems from two recent incidents — Chris Coghlan’s slide into Jung Ho Kang that broke the leg of the Pirates’ shortstop on Sept. 17, and Chase Utley’s slide into Ruben Tejada that broke Tejada’s leg last Saturday in Game 2 of the Dodgers-Mets NLDS. Utley received a two-game suspension, which is under appeal and will be heard Monday in New York. Manfred said MLB has heard from management about the issue, and he expects to also hear from Players Union head Tony Clark. “It’s a natural follow up to the home plate (collision rule) change,” he said. “We had the situation in Pittsburgh with the player there (Kang) that brings into focus how damaging it can be to a club, and obviously to the players.” Is a new rule really needed? “I think the sentiment we’re getting from clubs is making a change in this area makes sense,” he said. “And it’s important to protect what are very valuable assets.” Manfred also said MLB is exploring rules that would add netting to areas in ballparks after several injuries from flying bats and foul balls this season. “The biggest challenge for us is our ballparks are really, really different,” he said. “It’s not like it’s a uniform rink size. You have to really think through what you are doing in order to develop regulations that applies in a place like Wrigley and applies in a place like Oakland, which may be opposite ends of the spectrum.” Manfred said there won’t be any upcoming changes in the wild-card game format, despite the fact that teams with the second and third-best records in baseball — the Cubs and Pirates — met in the do-or-die NL wild-card game. “Look, I am really comfortable with the playoff format we have now,” he said. “It is an unusual circumstance to have three teams like the three teams in the National League Central be as good as they were and win as many games as they did. “I understand why people are asking the question. Having said that, I think it’s a mistake to rethink your playoff format based on one year of experience. We’ll see how it goes for a couple more years and I think we’ll be open to making adjustments.” By Chicago Tribune", "external_links": [], "published": "2015-10-14T10:00:00.000+03:00", "crawled": "2015-10-14T17:59:29.958+03:00", "highlightTitle": ""}