{"organizations": [], "uuid": "5fcb0070b617e23b5d4c584f2e88b0c988131d39", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ocvarsity.com", "main_image": "http://images.onset.freedom.com/ocvarsity/medium/s-volleyballgirls.jpg", "site_section": "http://www.ocvarsity.com/common/rss/rss.php?", "section_title": "OCVarsity.com Sports : News", "url": "http://www.ocvarsity.com/articles/park-80534-canyon-set.html", "country": "US", "title": "Villa Park survives five-set battle with Canyon", "performance_score": 0, "site": "ocvarsity.com", "participants_count": 1, "title_full": "Villa Park survives five-set battle with Canyon", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T07:23:00.000+03:00", "replies_count": 0, "uuid": "5fcb0070b617e23b5d4c584f2e88b0c988131d39"}, "author": "DAMIAN CALHOUN", "url": "http://www.ocvarsity.com/articles/park-80534-canyon-set.html", "ord_in_thread": 0, "title": "Villa Park survives five-set battle with Canyon", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Villa Park survives five-set battle with Canyon October 15, 2015 9:23 PM BY DAMIAN CALHOUN STAFF WRITER \nANAHEIM - After the first three sets, the Villa Park girls volleyball team would have done anything to get to a fifth set against host Canyon. \nThe Spartans were able to catch their breath, refocus and rallied to defeat the Comanches, 25-21, 23-25, 19-25, 25-14, 15-11, Thursday night in a Crestview League match. \n“The play overall was good,” Villa Park coach Megan Spurgin said. “Especially coming back from two games down is huge for us because we hadn’t seen a five-set win in a long time.” \nThe Spartans (11-11, 2-1) hadn’t been in a five-set match since the Lakewood Classic in early September, but with the experience of playing the Dave Mohs Tournament and Durango Fall Classic under their belts, the Spartans weren’t going to shy away from this spot of adversity. \nIn the fifth set, the Spartans led 8-5, but Canyon (10-9, 2-1) would tie the score at 10-10 on a kill from Alexis Turley-Young . Villa Park retook the lead for good on a kill from Maddie Olsen and block by Emily Condon . \n“Our attitude was to pick up the energy and to never give up,” Villa Park senior setter Emily Elder said. “We weren’t nervous, knowing that those girls are my sisters and knowing that they’re always by side is something that motivates me to win for them. \n“The key was to be aggressive and to not get timid and always be smart with the ball.” \nElder and the Spartans were certainly motivated at the start of the fourth set. \nVilla Park jumped out to a 6-1 lead in the fourth set and after Canyon fought back to get to 8-7, the Spartans retook control, taking advantage of some errors for a 14-7 lead. The lead would eventually reach double digits. \n“I think they had a little bit more stamina than us in the fourth set,” Canyon coach Matt Peacock said. “We got a little bit tired and stopped doing the little things that got us up 2-1. \n“They definitely came out and took care of the ball, they played with a little bit more fire and that translated into transition swings for them and we couldn’t get a run.” \nEmma Calle led the Spartans with 24 kills. Maddie Olsen had 16 and Meghan Murphy added 12. \nTurley-Young led Canyon with 17 and Hailey Manliguis had 15. \nThe teams will face each other again Nov. 3.", "external_links": [], "published": "2015-10-16T07:23:00.000+03:00", "crawled": "2015-10-16T08:53:45.308+03:00", "highlightTitle": ""}