{"organizations": [], "uuid": "915a8f597dfac4df67aa26eb7fa25b27dc300963", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "http://www.bostonherald.com/sites/default/files/media/ap/a663df700f4046b0b45bbca6de456938.jpg", "site_section": "http://bostonherald.com/sports/patriots_nfl", "section_title": "Sports: Patriots &amp; NFL | Boston Herald", "url": "http://bostonherald.com/sports/patriots_nfl/nfl_coverage/2015/10/nfl_has_some_little_known_rules_and_regulations", "country": "US", "title": "NFL has some little-known rules and regulations", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "NFL has some little-known rules and regulations | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "915a8f597dfac4df67aa26eb7fa25b27dc300963"}, "author": "Associated Press", "url": "http://bostonherald.com/sports/patriots_nfl/nfl_coverage/2015/10/nfl_has_some_little_known_rules_and_regulations", "ord_in_thread": 0, "title": "NFL has some little-known rules and regulations", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Thanks to Seattle linebacker K.J. Wright and back judge Greg Wilson, football fans now know all about the obscure NFL rule known as the \"illegal bat.\"\nThe Seahawks received a big break when a flag wasn't thrown on Wright for batting Calvin Johnson's fumble out of the back of the end zone for a touchback after Kam Chancellor knocked it loose just shy of the goal line.\nThe Lions (0-4) never got the ball at the 1 like they should have and went home still the league's only winless team. The Seahawks (2-2) might have saved their season with the 13-10 win that could have ramifications deep into the winter.\nPete Carroll and Wright both admitted they didn't know the rule. NFL VP of Officiating Dean Blandino said the back judge didn't feel it was an \"overt act,\" but the league's thick rule book doesn't mention any leeway for an inadvertent violation, stating: It is an illegal bat if:\n—a. any player bats or punches a loose ball in the field of play toward his opponent's goal line\n—b. any player bats or punches a loose ball (that has touched the ground) in any direction, if it is in either end zone\n—c. an offensive player bats a backward pass in flight toward his opponent's goal line\nThere are several other obscure NFL rules that many people — and maybe even some officials — might not be aware of, such as \"No player may deliberately kick a loose ball.\"\nHere are some others:\nHEADS UP: Every fan knows if a kickoff goes out of bounds before being touched by the receiving team, that team gets the ball at the 40-yard line instead of the 20. But how many know the returner can step out of bounds, reach back on the field of play and grab the ball to prevent a touchback? Randall Cobb of the Packers did. On Dec. 23, 2012, he made the heads-up play when the Titans' kickoff stopped just inside his 5-yard line. Instead of trying to return it, Cobb stepped out of bounds and reached back to grab the ball at the 4, giving the Packers possession at their 40. That's because if any part of the player's body is out of bounds when he makes contact with the ball, the ball is ruled out of bounds.\nSAME SIDE: \"At the option of the home team, both the players' benches may be located on the same side of the field.\" Nobody does this anymore but the Packers used to when they split their home schedule between Green Bay and Milwaukee until they abandoned the old County Stadium 20 years ago. This made for interesting substitutions and some winded players. One time, former Lions coach Wayne Fontes was so caught up in the action he didn't realize he had meandered all the way down in front of the Packers' bench and was grabbing the wrong players to send into the game.\nDELAY OF GAME: Teams can get flagged even before the game begins. They'll lose the coin toss for both halves and any overtime and be assessed a 15-yard penalty from the spot of the kickoff for the first half if they're not on the field at least 10 minutes before the scheduled start of the game or if they don't send the captains out in time for the pregame coin toss, which occurs three minutes before kickoff.\nHIPSTERS: While all players must wear shoulder, thigh and knee pads, hip pads aren't required. \"It is recommended that all players wear hip pads designed to reasonably avoid the risk of injury,\" the rule book says. \"Unless otherwise provided by individual team policy, it is the players' responsibility and decision whether to follow this recommendation and use such pads. If worn, such pads must be covered by the outer uniform.\"\nROGER THAT: In addition to the tightened pregame protocol for the two dozen primary game balls to prevent another \"Deflategate\" scandal, there are other rules pertaining to the pigskins. Among them: \"The Ball must be a 'Wilson,' hand selected, bearing the signature of the Commissioner of the League, Roger Goodell.\"", "external_links": [], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T12:38:22.339+03:00", "highlightTitle": ""}