{"organizations": [], "uuid": "68c6fd78ba518485daabe1f5bdc5655fedee8a3a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "savannahnow.com", "main_image": "http://savannahnow.com/sites/default/files/images/sms-default-facebook-share.jpg", "site_section": "http://savannahnow.com/", "section_title": "savannahnow.com | Savannah Georgia's source for News, Entertainment, Sports, Weather, Classifieds, Jobs, Autos, Real Estate and St. Patricks Day", "url": "http://savannahnow.com/do/2015-10-07/annual-savannah-greek-festival-marks-65-years", "country": "US", "title": "Annual Savannah Greek Festival marks 65 years", "performance_score": 0, "site": "savannahnow.com", "participants_count": 1, "title_full": "Annual Savannah Greek Festival marks 65 years | savannahnow.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T18:38:00.000+03:00", "replies_count": 0, "uuid": "68c6fd78ba518485daabe1f5bdc5655fedee8a3a"}, "author": "Kim Wade", "url": "http://savannahnow.com/do/2015-10-07/annual-savannah-greek-festival-marks-65-years", "ord_in_thread": 0, "title": "Annual Savannah Greek Festival marks 65 years", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SPECIAL OFFER FOR NEW READERS 99 cent digital subscription to savannahnow.com\nSubscriber-members get access to ALL our digital products AND become eligible for free event tickets, discount coupons and other benefits. SIGN UP FOR SUBSCRIBER BENEFITS As a Savannah Morning News / savannahnow.com subscriber, you're eligible for members-only discounts. Download your coupons now. By Kim Wade W hen you hear the words Savannah Greek Festival, your mouth probably starts to water.\nYou don’t even need to know how to pronounce pastitsio, spanakopita, koulourakia or flogeres when you go — just ask for one of everything and give your taste buds what they have been missing all year.\nIf you’ve never been, prepare to be entertained with live Greek entertainment while stuffing your face with authentic Greek food and pastries.\nThere is even a bakaliko (Greek grocery store) and agora (marketplace) featuring many of the Greek items you may not be able to find in Savannah.\nAdd authentic Greek music to the background, and you’ll feel like you’ve left Savannah for the day.\nThe 65th annual Savannah Greek Festival will take place from 11 a.m. to 9 p.m. Oct. 8-10 at the Hellenic Community Center, 14 W. Anderson St. Admission is free until 4 p.m. Oct. 8-9 and a $2 donation is accepted after 4 p.m. those days and all day Oct. 10. The festival is sponsored by St. Paul’s Greek Orthodox Church and church tours are also available during select times.\nA complete schedule and menu as well as a map of the layout of the festival are available at www.savannahgreekfest.com.\nCo-chair of the event, Jimmy Stevens, says the group has a few new additions to this year’s festival.\nFirst, they added the option for online ordering for drive-thru orders. There are also some new menu items.\n“Souvlaki (similar to a gyro but with pork or chicken rather than traditional lamb) is a new food item this year and we also made more room for people to sit down and enjoy eating in the courtyard this year,” he says.\nStevens says festival goers need to be sure to bring an ID if they plan to purchase alcoholic beverages and to “come with a good attitude and healthy appetite and see what Greek heritage is all about.”\nWhile the lines can get long on Friday evening and Saturday, he says it’s always his favorite part of the festival to see “all the people coming.”\n“It’s great to see the community support us,” he adds. “Having grown up in Savannah, I get to see a lot of people I don’t typically get to see at the festival.\n“I love the crowds coming and seeing everybody have a good time.”\nHe adds that a portion of the proceeds go to benefit charities and the event is put together by volunteers.\n“Our volunteers put this on and they don’t just work the three days of the festival. They start preparing in the month of May and without them, this festival wouldn’t happen.”\nIF YOU GO\nWhat: Savannah Greek Festival\nWhen: 11 a.m. to 9 p.m. Oct. 8-10\nWhere: Hellenic Community Center, 14 W. Anderson St.\nCost: Free until 4 p.m. Oct. 8-9; $2 donation after 4 p.m. Oct. 8-9 and all day Oct. 10\nInfo: www.savannahgreekfest.com", "external_links": ["https://bit.ly/ZyZ8mc)", "https://bit.ly/ZyZaur", "https://itunes.apple.com/us/app/dosavannah/id626862925?ls=1&mt=8", "https://play.google.com/store/apps/details?id=hr.apps.n53744379", "http://sav-cdn.com/sites/all/themes/savannahnow/images/blank.gif", "http://i.imgur.com/2Ix6dHF.png", "https://bit.ly/Ke006c"], "published": "2015-10-07T18:38:00.000+03:00", "crawled": "2015-10-08T09:22:16.064+03:00", "highlightTitle": ""}