{"organizations": ["The University of Hawaii", "University of Hawaii", "CIA", "New York Police Department", "Cavaliers", "Democratic", "Eau Claire", "Interior Department"], "uuid": "978bf232b861971a147bd7d7643b5579755a75fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wqow.com", "main_image": "", "site_section": "http://www.WQOW.com/Global/category.asp?C=13566&clienttype=rss", "section_title": "WQOW TV News 18 - National Sports - Headline", "url": "http://www.wqow.com/story/30320944/cavaliers-thompson-reach-agreement-on-long-term-contract", "country": "US", "title": "Cavaliers, Thompson reach agreement on long-term contract", "performance_score": 0, "site": "wqow.com", "participants_count": 0, "title_full": "Cavaliers, Thompson reach agreement on long-term contract", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T05:15:00.000+03:00", "replies_count": 0, "uuid": "978bf232b861971a147bd7d7643b5579755a75fb"}, "author": "", "url": "http://www.wqow.com/story/30320944/cavaliers-thompson-reach-agreement-on-long-term-contract", "ord_in_thread": 0, "title": "Cavaliers, Thompson reach agreement on long-term contract", "locations": ["New York City", "Washington", "West", "Mauna Kea", "Hawaii", "UK", "D.C."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jeb Bush", "Hillary Rodham Clinton", "Joe Biden", "John Brennan", "Bush", "Barack Obama", "Lamar Odom", "Biden", "Thompson"], "text": "Cavaliers, Thompson reach agreement on long-term contract - WQOW TV: Eau Claire, WI NEWS18 News, Weather, and Sports Member Center: Biologists fly drone to track health of endangered orcas Federal biologists flying a drone have taken thousands of rich images of endangered Puget Sound orcas showing the whales are in good condition this year and that several appear to be pregnant. More >> Federal biologists flying a drone have taken thousands of rich images of endangered Puget Sound orcas showing the whales are in good condition this year and that several appear to be pregnant. More >> Former UK telescope to be removed from Hawaii mountain The University of Hawaii has announced the third Mauna Kea observatory that will be decommissioned, fulfilling the governor's request to remove 25 percent of the telescopes from the mountain. More >> The University of Hawaii announced Wednesday that a third observatory will be taken down from Mauna Kea - a move that fulfills the governor's request to remove 25 percent of telescopes from the mountain considered... More >> Lamar Odom,   Suspect in NYC officer killing was wanted in other shooting New York City police say the gunman suspected of killing an officer is in custody with a gunshot wound, and three others have been taken in for questioning. More >> A man with a lengthy arrest record got out of jail and into a drug treatment program months before he was accused of gunning down a police officer while wanted in another shooting, infuriating the police commissioner and... More >> Ordered to drop politics, ex-coal CEO shows views on trial An outspoken critic of President Barack Obama charged with conspiring to violate mine safety rules before a deadly explosion is under orders not to tell jurors he's being persecuted by Democrats. More >> An outspoken critic of President Barack Obama, charged with conspiring to violate mine safety rules before a deadly explosion, is under orders not to tell jurors he's being persecuted by Democrats. More >> Man detained in road-rage killing of 4-year-old girl Police are asking for the public's help as authorities try to identify and find an assailant who shot and killed a 4-year-old girl on an Albuquerque freeway. More >> Police detained a man on Wednesday in connection with the road-  who was shot in the backseat of her father's truck after he picked up her and her brother from school, signaling a... More >> Quote Box: Political world reacts to Biden sitting out race Vice President Joe Biden announced on Wednesday that he will not make a third run for president, a decision that spares him the ordeal of mounting a challenge to Democratic frontrunner Hillary Rodham Clinton - and... More >> Vice President Joe Biden announced on Wednesday that he will not make a third run for president, a decision that spares him the ordeal of mounting a challenge to Democratic frontrunner Hillary Rodham Clinton - and the risk... More >> The Latest: Suspect arrested for death of NYPD officer The latest on the fatal shooting of a New York Police Department officer during a gunbattle and chase involving a stolen bicycle   fatal shooting of a New York Police Department officer during a gunbattle and chase involving a stolen bicycle   Bush would move Interior Department HQ to the West Jeb Bush says if he's elected president he'd try to move the Interior Department's headquarters to the West. More >> Jeb Bush said Wednesday that he would rein in regulation at the Interior Department as president and try to move its headquarters from Washington, D.C., to the West, home to 90 percent of federally owned land. More >> WikiLeaks publishes CIA director John Brennan's emails The Wikileaks organization has posted material from what appears to be CIA director John Brennan's personal email account, including a draft security clearance application containing personal information. More >> The WikiLeaks organization posted material Wednesday from what appears to be CIA Director John Brennan's personal email account, including a draft security clearance application containing personal information. More >>", "external_links": [], "published": "2015-10-22T05:15:00.000+03:00", "crawled": "2015-10-22T05:22:06.529+03:00", "highlightTitle": ""}