{"organizations": [], "uuid": "c76a1e0c2c6288ffcc54269088af1c2ba96b164c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "chicago.suntimes.com", "main_image": "http://bullseye-prod.aggrego.org//wp-ag/wp-content/uploads/sites/71/2015/10/Screen-Shot-2015-10-04-at-9.01.31-PM.png?o=eyJ3aWR0aCI6MCwiaGVpZ2h0IjowLCJ4IjowLjUsInkiOjAuNX0%3D&amp;s=MU0vjTq2tOs%2F2ni20XQWZjSHLBY%3D", "site_section": "http://chicago.suntimes.com/", "section_title": "Chicago Sun-Times | Chicago : News : Politics : Things To Do : Sports", "url": "http://chicago.suntimes.com/baseball/7/71/1012357/cubs-raised-bar-97-win-season-look-pittsburgh", "country": "US", "title": "Cubs 'raised bar' with 97-win season, look for more in Pittsburgh", "performance_score": 0, "site": "suntimes.com", "participants_count": 1, "title_full": "Cubs 'raised bar' with 97-win season, look for more in Pittsburgh | Chicago Sun-Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T05:02:00.000+03:00", "replies_count": 0, "uuid": "c76a1e0c2c6288ffcc54269088af1c2ba96b164c"}, "author": "| emailAddress.indexOf('@') == -1) {errorString = 'Please enter your email address';} var isError = false; if (errorString.length > 0) isError = true; if (isError) alert(errorString); return !isError;}", "url": "http://chicago.suntimes.com/baseball/7/71/1012357/cubs-raised-bar-97-win-season-look-pittsburgh", "ord_in_thread": 0, "title": "Cubs 'raised bar' with 97-win season, look for more in Pittsburgh", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MILWAUKEE – They didn’t get home field for the wild-card game like they set out Sunday to steal, but the Cubs delivered on something much bigger when they finished off a 97-win season by beating the Milwaukee Brewers 3-1 at Miller Park.\n“We just raised our bar,” first baseman Anthony Rizzo said. “And the bar’s set from here on out, to keep repeating this. Now it’s on us to repeat this next year. Now it’s on us to go out and compete in the postseason.”\nThe Cubs’ eight-game winning streak to close the regular season gave them a chance to secure home field for Wednesday’s wild-card playoff against the Pirates – until the Pirates beat the Reds in their season finale.\nThe last time the Cubs won 97 games, in 2008, they had the best record in the National League; this time it’s good for third place in the NL Central – the first time in 47 seasons of division alignment that the top three records in the majors came out of one division.\n“How could you possibly be disappointed with anything our players have done this year,” said Cubs manager Joe Maddon, who predicted this unlikely playoff berth during his introductory press conference last fall when he was hired. “It’s pretty phenomenal.”\nThe Cubs play Wednesday night in a win-or-go-home playoff in Pittsburgh – where they have won six of 10 games. The winner of that game opens the division series in St. Louis two days later.\n“It’s going to be a different environment, obviously,” World Series veteran David Ross said. “But we’ve played well there. We know that team, they know us; they know we’re good, we know they’re good.\n“The one-and-done is exciting. It’s definitely different than the norm, but it’s a fun different. The focus level will be through the roof. I’m getting chills thinking about it.”\nNotes: When Dan Haren (11-9) allowed just one run in six innings, it gave the Cubs’ starting pitchers a 0.35 ERA in 51 1/3 innings (and 7-0 record) over the final eight games. …Rizzo singled home two runs in the first inning to reach 100 RBIs for the first time in his career. He’s one of four left-handed hitters in franchise history to have 30 homers and 100 RBIs in a season. … Rookie of the Year favorite Kris Bryant (who missed the first eight games for service-time considerations) walked three times and singled and finished with 99 RBIs – drawing walks in both at-bats with a man in scoring position. “Just shows he’s not a selfish player,” Rizzo said. Said Maddon: “It’s too bad, but obviously it gives him something to shoot for next year.”", "external_links": ["https://www.youtube.com/embed/zPg5yCHIGxc?feature=oembed"], "published": "2015-10-05T05:02:00.000+03:00", "crawled": "2015-10-05T12:09:05.688+03:00", "highlightTitle": ""}