{"organizations": [], "uuid": "6a2ad6d7edba382d46bfb3bee2d566717f5671d6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.emirates247.com", "main_image": "http://cdn-wac.emirates247.com/polopoly_fs/1.607575.1445410422!/image/1921738658.jpg", "site_section": "http://www.emirates247.com/cmlink/en/sports-1.260504?localLinksEnabled=false", "section_title": "Sports", "url": "http://www.emirates247.com/sports/local/former-lanka-badminton-champion-deepika-holds-court-in-dubai-2015-10-21-1.607574", "country": "US", "title": "Former Lanka badminton champion Deepika holds court in Dubai", "performance_score": 0, "site": "emirates247.com", "participants_count": 1, "title_full": "Former Lanka badminton champion Deepika holds court in Dubai", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T09:42:00.000+03:00", "replies_count": 0, "uuid": "6a2ad6d7edba382d46bfb3bee2d566717f5671d6"}, "author": "Allaam Ousman", "url": "http://www.emirates247.com/sports/local/former-lanka-badminton-champion-deepika-holds-court-in-dubai-2015-10-21-1.607574", "ord_in_thread": 0, "title": "Former Lanka badminton champion Deepika holds court in Dubai", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Former Lanka badminton champion Deepika holds court in Dubai 25 Emirati women are being coached by her for a tournament in December By Wednesday, October 21, 2015 Sriyani Deepika coaching students at Dubai Stars. (Supplied) \nFormer Sri Lanka badminton champion Sriyani Deepika is now showing her mastery on the courts of Dubai albeit as a professional coach. Deepika had merely hoped to resume her banking career when she moved to the UAE three years ago to join her husband. However her arrival coincided with the World Badminton Federation (BWF) choosing the UAE as a destination for the World Super series Finals. Being unsuccessful in her quest to find employment in a bank, she focussed her energies on what she knows best since the age of 12 - badminton. Now, Deepika is a much sought-after and respected badminton coach in the UAE and runs her own academy in two centres in Dubai.\"When I came here (Dubai) I did not have hopes of playing badminton. I came to join my husband. I was a banker by profession for more than 15 years in Sri Lanka. I did not succeed in getting a banking job so I pursued my professional interests. Now I have forgotten bank life and continuing my badminton career,\" said Deepika who ran an academy in Sri Lanka for 12 years. Her professionalism, enthusiasm and dedication have impressed officials and players alike in her second home.\"Just like in Sri Lanka, now people in Dubai also know me as a badminton player. I'm living not among Sri Lankans, but Emiratis and mostly Indians. The cooperation I got in Sri Lanka, I'm receiving here as well,\" said Deepika who is focusing on coaching 25 Emirati women in preparation for a tournament in December. Her training centres are at Jumeirah Model Girls School near Safa Park and Dubai Stars Sportsplex near Arabian Centre in Mizhar. Above all, she is pleased to contribute in efforts to promote badminton in the UAE.\"The WBF has appointed Jaafar Ibrahim who is making great efforts to form a badminton association in the UAE. I'm happy to help in this process and for Dubai Sports Council for giving me the opportunity,\" said Deepika who is excited by the fact that the world's best players would be descending in Dubai for the second time for the World Super series Finals in December. Deepika also regularly competes in local tournaments.\"Even though I'm growing old, I don't like to lose when I play a badminton match.Whenever I get on the court, I have that determination and spirit to win,\" said Deepika who won the last of her five national singles titles more than a decade ago. \"Win or lose, playing is an advantage for coaching because to show demonstration being a player is easy and also maintain my fitness,\" added the 48 year-old mother of two teenage sons.\"Both played badminton but not seriously. Dinuth (22) is pursuing a career in flying in the US while Shehan (17) is a good musician,\" she said proudly. Deepika is still virtually married to badminton.\"I'm happy to have a long history with the sport. Even after marrying, I'm still living on the court. I don't think anybody has played badminton for such a long time. I'm having two children and still continue my sports career,\" said Deepika who has not retired as a player. However, her bid to represent Sri Lanka at the World Senior Badminton Championships in Sweden last month, ended in disappointment.\"There were about 15 players from Sri Lanka who had entered but they could not take part because the WBF has some problem with the Sri Lanka Badminton Association (SLBA),\" said Deepika. The world body has suspended the SLBA since July. However, she made the trip to Sweden and gained experience as a line judge ahead of the Dubai tournament.\"I got a certificate as a line judge. It was a great experience and achievement since I did 40 matches and it will help me for the World Super series,\" said Deepika gratefully acknowledging Yonex for sponsoring her even in Dubai. Share with a friend or colleague Your e-mail address:", "external_links": [], "published": "2015-10-21T09:42:00.000+03:00", "crawled": "2015-10-21T19:56:49.548+03:00", "highlightTitle": ""}