{"organizations": [], "uuid": "e52cd652aecfe8ce752a1ccc87525114c15ab1e4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "abcnewsradioonline.com", "main_image": "http://abcnewsradioonline.com/storage/news-images-october-2015/getty_102215_donmattinglydodgers.jpeg?__SQUARESPACE_CACHEVERSION=1445534289306", "site_section": "http://abcnewsradioonline.com/sports-news/rss.xml", "section_title": "Sports News", "url": "http://abcnewsradioonline.com/sports-news/don-mattingly-wont-return-to-dodgers-in-2016.html", "country": "US", "title": "Don Mattingly Won’t Return to Dodgers in 2016", "performance_score": 0, "site": "abcnewsradioonline.com", "participants_count": 1, "title_full": "Don Mattingly Won’t Return to Dodgers in 2016", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T20:13:00.000+03:00", "replies_count": 0, "uuid": "e52cd652aecfe8ce752a1ccc87525114c15ab1e4"}, "author": "Carmen Cox", "url": "http://abcnewsradioonline.com/sports-news/don-mattingly-wont-return-to-dodgers-in-2016.html", "ord_in_thread": 0, "title": "Don Mattingly Won’t Return to Dodgers in 2016", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Share Article \nMike Stobe/Getty Images (LOS ANGELES) — Don Mattingly won’t be returning as manager of the Dodgers in 2016. Team officials announced the mutual agreement in a written statement Thursday after talks that lasted several days.“As the dialogue progressed daily, it evolved to a point where we all agreed that it might be best for both sides to start fresh,” Dodger President of Baseball Operations Andrew Friedman said. “We decided to think about it for a couple of days and when we spoke again, we felt comfortable that this was the direction to go.”Friedman expressed hisrespect for “Donnie,” and added that he “thoroughly enjoyed working with him this past season.”“I want to thank him for his hard work and collaboration, as well as his accomplishments, including three consecutive National League West titles. I wish him nothing but success in the future,” he said.The Dodgers never advanced to the World Series under Mattingly’s management.Though Mattingly had one year remaining on his contract, the Los Angeles Times reports the club’s decision to part ways with Mattingly was both amicable and mutual.In the Dodgers’ written statement Thursday, Mattingly was quoted, saying he was “honored and proud” of his time as manager in Los Angeles.“I’ve enjoyed my experiences and relationships with the organization’s staff and players throughout my eight years in L.A.,” Mattingly said.A successor to Mattingly has not been named, however, the Los Angeles Times reports three “in-house” possibilities: coaches Tim Wallach and Ron Roenicke and Gabe Kapler, Dodgers director of player development.As for what’s next for Mattingly, he said he’s “still very passionate about managing and hope[s] to get the opportunity in the near future.”Copyright © 2015, ABC Radio. All rights reserved. Thursday, October 22, 2015 at 1:13PM", "external_links": [], "published": "2015-10-22T20:13:00.000+03:00", "crawled": "2015-10-23T13:48:52.166+03:00", "highlightTitle": ""}