{"organizations": ["Rubin Kazan", "Liverpool", "Anfield"], "uuid": "8b3e298e1e1ccf3f51fac1a3b3e0c63471a3f4eb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/o63vma8llg_1466597814681_2321777193134.jpg", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=1", "section_title": "Sports News", "url": "http://www.modernghana.com/news/651015/1/europa-league-preview-liverpool-v-rubin-kazan-klop.html", "country": "US", "title": "Europa League Preview: Liverpool v Rubin Kazan, Klopp's Anfield debut", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "Europa League Preview: Liverpool v Rubin Kazan, Klopp's Anfield debut", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T23:06:00.000+03:00", "replies_count": 0, "uuid": "8b3e298e1e1ccf3f51fac1a3b3e0c63471a3f4eb"}, "author": "", "url": "http://www.modernghana.com/news/651015/1/europa-league-preview-liverpool-v-rubin-kazan-klop.html", "ord_in_thread": 0, "title": "Europa League Preview: Liverpool v Rubin Kazan, Klopp's Anfield debut", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Klopp"], "text": "  21:06 CET Europa League Preview: Liverpool v Rubin Kazan, Klopp's Anfield debut By Wires \nKlopp makes his first Anfield appearance as Liverpool manager when the Russian side arrive at for what promises to be a memorable occasion. \nWhile it will be special game for the German, it’s one of real significance one too, with the Reds needing a win to turn around their lacklustre opening to the European campaign. \nTwo draws from two games represents a disappointing start, and Klopp will be looking to spark an immediate upturn starting on Thursday night. \nThursday’s Anfield clash will be a historic first meeting between the two sides. \nBoth do have previous against clubs from the respective countries however – the Reds have taken on Russian opposition 11 times, winning six, drawing once and losing on four occasions. \nRubin have faced and beaten Wigan 1-0, Tottenham 1-0 and Chelsea 3-2 all in the Europa League, and the Reds will have to ensure they’re not added to the list of home clubs beaten by Kazan, who have claimed big results but are yet to win on English soil. \nMost of Rubin’s European outings have come in the Europa League, but they have proven a threat for Europe’s elite too – picking up a famous 2-1 victory against then Champions League holders, Barcelona, at the Nou Camp. \nThe visitors return to continental competition after a year absence, with their last adventure in 2013/14 ending at the round 32 stage of the Europa League after losing to Real Betis. \nThey will be looking to improve on that this time around – making the most of their fortunate qualification that saw them take Dynamo Moscow’s place – but like Liverpool, must start picking points up. \nRubin Kazan land on Merseyside with a new manager at the helm. \nValeri Chaly recently took over from the dismissed Rinat Bilyaletdinov – father of former Everton and current Kazan midfielder, Diniyar. \nSince taking the job, the new coach has mustered just two wins from eight games in charge. \nFormer Blue, Bilyaletdinov could feature against the Reds, who will have to keep an eye on the experienced but talented Turkish midfielder, Gokdeniz Karadeniz. \nBrazilian attacking midfielder Carlos Eduardo – who joined Kazan in a big money €20million move from Hoffenheim in 2010 – is another dangerous option at Rubin’s disposal. \nRubin come into the clash at the foot of Group B with only a single point to their name from their opening two matches. \nThe Russians suffered defeat to group leaders Sion before playing out a goalless stalemate against Bordeaux. \nAn improvement in performance and result in France will provide increased confidence heading into Thursday night, with the chance to cause an upset against the script on Klopp’s Anfield debut. \nDespite being the only side in the group to have lost, Rubin have conceded the same amount of goals as Liverpool, scoring only one less than the Reds. \nAs with their struggling start in Europe, Kazan are in the middle of a less-than-impressive Russian Premier League campaign. \nThey sit in 12th place having picked up just three wins in 12 games, losing eight of those fixtures. \nAs a result of their poor form both domestically and in Europe, the Russians arrive with only one win from their last seven games. \nThe Reds are even worse off in comparison, with only one win from their last 10 matches in all competitions after the goalless draw at Tottenham. \nForm GuideEurope: Rubin Kazan – LD Liverpool – DD \nAll competitions: Last 10 games:Rubin – WLWLDLLDLW", "external_links": [], "published": "2015-10-22T23:06:00.000+03:00", "crawled": "2015-10-23T05:47:57.674+03:00", "highlightTitle": ""}