{"organizations": [], "uuid": "a0f435e9774340f0bbd433d06a484f3a61a30f24", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.heraldnews.com", "main_image": "http://www.heraldnews.com/storyimage/WL/20151013/SPORTS/151018870/AR/0/Colts-Luck-Hasselbeck.jpg", "site_section": "http://www.heraldnews.com/sports/pro-sports?template=rss&mime=xml", "section_title": "Professional Sports - The Herald News, Fall River, MA", "url": "http://www.heraldnews.com/article/20151013/SPORTS/151018870/11734/SPORTS?rssfeed=true", "country": "US", "title": "Meeting with Patriots may not be any stroke of Luck for Colts", "performance_score": 0, "site": "heraldnews.com", "participants_count": 1, "title_full": "Meeting with Patriots may not be any stroke of Luck for Colts", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T11:30:00.000+03:00", "replies_count": 0, "uuid": "a0f435e9774340f0bbd433d06a484f3a61a30f24"}, "author": "Glen Farley", "url": "http://www.heraldnews.com/article/20151013/SPORTS/151018870/11734/SPORTS?rssfeed=true", "ord_in_thread": 0, "title": "Meeting with Patriots may not be any stroke of Luck for Colts", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Meeting with Patriots may not be any stroke of Luck for Colts Albeit against an admittedly undermanned offense in the Cowboys, the Patriots' defense showed it is improving. Next up is a trip to Indianapolis and a meeting with Andrew Luck (if healthy), who has a history of struggling against the Pats. Comment Posted Oct. 13, 2015 at 3:26 AM Updated at 3:30 AM Posted Oct. 13, 2015 at 3:26 AM Updated at 3:30 AM FOXBORO – The Indianapolis Colts have been out of Luck for a couple of weeks. This week, they have the misfortune of playing an unbeaten Patriots team that’s ready to release nine months of pent-up anger on them. No need to rehash the NFL soap opera we’ve come to know as Deflategate. That’s been done ad nauseam in the past and is sure to be rehashed time and time again in the days leading up to Sunday night’s game in Indianapolis. New to the equation, though, is a Patriots defense that stepped forward this past Sunday in Dallas; a defense that took the air out of an admittedly undermanned Cowboys offense. Quarterback Brandon Weeden is no Andrew Luck (at this point, I’m not even sure he’s even Gary Hogeboom) and he was lacking a couple of weapons in Dez Bryant, the Cowboys’ game-breaking wide receiver, and Lance Dunbar, their pass-catching back. But the Patriots’ defense, which was also operating shorthanded when linebacker Dont’a Hightower left early with a rib injury (forgotten man Jerod Mayo and Jonathan Freeny filled in), went to big “D” and was “Dominant” with a capital “D.” Let’s not go putting them among the elite of the league’s defenses, but the Patriots have shown major improvement on that side of the ball since they wilted in the fourth quarter at Buffalo in Week Two to the point where it needed a diving interception by cornerback Logan Ryan to seal the deal, 40-32. Obviously looking to make Tony Romo’s backup beat them, the Patriots’ focus was on stuffing the run, which they did in a first half in which their offense was struggling (Tom Brady was sacked five times), allowing the team to build a 13-3 lead en route to a 30-6 win. Banging pads with arguably the best offensive line in the league, the Patriots, in an effort led by do-it-all linebacker Jamie Collins (five tackles in the half, 10 – with one forced fumble – in the game), limited the Cowboys to 40 yards on 13 rushing attempts in the first half and forced them into three-and-outs on six of their first seven possessions. Throughout the game, the Patriots were able to limit the damage done by Jason Witten, Dallas’ dependable and durable tight end (five catches for just 33 yards with one lost fumble in the game), and Cole Beasley, the Cowboys’ version of Julian Edelman, (Beasley had four receptions for just 40 yards). For a couple of Sundays at least, forgotten were the concerns borne of an offseason that saw Super Bowl champion cornerbacks Darrelle Revis, Brandon Browner and Kyle Arrington all depart. Page 2 of 2 - Modest as Weeden’s 188 yards passing were in Sunday’s game, they are even more so when one considers that 114 came in the fourth quarter, a.k.a. garbage time, and even then he couldn’t get the Cowboys into the end zone. Granted, they were playing the Jacksonville Jaguars the previous week, but over the past two Sundays the Patriots’ defense has surrendered just two touchdowns and three field goals, while forcing 10 punts, three turnovers (two interceptions and one fumble recovery) and two changes of possessions on downs with two other possessions ending the half. Which brings us to next Sunday’s game in Indy where Luck (if healthy) awaits; if not they’ll get 40-year-old Matt Hasselbeck, who, with the aid of the NFL schedule maker (games against Tennessee and Houston) has quarterbacked the Colts to two straight wins and into first place in the always-humorous AFC South (where the Colts’ competition is a combined 3-11). The fact that the Colts released the third quarterback on their roster, Josh Johnson, on Monday would seem to point toward Luck’s return, if not for the fact that they took the same action last week, then re-signed Johnson prior to Thursday night’s 27-20 win in Houston. If the Patriots do see Luck, they’ll be facing a quarterback who struggled in guiding the Colts to a 1-2 start, his passer rating of 65.1 barely above the 63.6 – are you ready? – Ryan Mallett is lugging around after being benched by the Texans. Couple that with the fact that he is 0-4 lifetime against the Patriots, with a woeful passing percentage of 50.3 and a passer rating that isn’t much better (58.7), and a return on Sunday night may not guarantee a stroke of Luck at all for the Colts.", "external_links": [], "published": "2015-10-13T11:30:00.000+03:00", "crawled": "2015-10-13T12:55:36.927+03:00", "highlightTitle": ""}