{"organizations": [], "uuid": "905ad372eea9896c47432d4ee667dbffc5ac8478", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prnewswire.com", "main_image": "http://photos.prnewswire.com/prnvar/20150310/180864LOGO", "site_section": "http://www.prnewswire.com/rss/sports/sporting-news.rss", "section_title": "PR Newswire: General Sports", "url": "http://www.prnewswire.com/news-releases/yiptvs-televised-live-boxing-collaboration-with-ringtv-resumes-with-exciting-action-packed-bouts-from-madison-square-garden-533021261.html", "country": "US", "title": "YipTV's Televised Live Boxing Collaboration with RingTV Res", "performance_score": 0, "site": "prnewswire.com", "participants_count": 1, "title_full": "YipTV's Televised Live Boxing Collaboration with RingTV Res", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T20:08:00.000+03:00", "replies_count": 0, "uuid": "905ad372eea9896c47432d4ee667dbffc5ac8478"}, "author": "YipTV", "url": "http://www.prnewswire.com/news-releases/yiptvs-televised-live-boxing-collaboration-with-ringtv-resumes-with-exciting-action-packed-bouts-from-madison-square-garden-533021261.html", "ord_in_thread": 0, "title": "YipTV's Televised Live Boxing Collaboration with RingTV Res", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WEST PALM BEACH, Florida , Oct. 15, 2015 /PRNewswire-HISPANIC PR WIRE/ -- Broadband OTT television service YipTV , which gives subscribers 16 live TV channels to watch free, continues its televised boxing collaboration with Oscar De La Hoya's RingTV and Golden Boy Promotions this Saturday night with a live, action-packed card from famed New York boxing mecca Madison Square Garden . Logo - http://photos.prnewswire.com/prnh/20150310/180864LOGO\nThe RingTV – YipTV telecast is preliminary to the headlining Madison Square Garden event of the evening: the IBF and WBA middleweight title unification bout between Gennady \"GGG\" Golovkin (33-0, 30 KOs) and Montreal's David Lemieux (34-2, 31 KOs).\nRingTV boxing shows, which are \"broadband-cast\" live by YipTV, feature promising young boxers who are expected to contend for championships in the future.\nSaturday's matchups are expected to include:\nA hard-hitting 10-round bout featuring Montreal's Ghislain Maduma (17-1, 11 KOs) who makes his United States debut against Maurice Hooker (18-0-2, 14 KOs) of Dallas , for the North American Boxing Organization's junior welterweight title; A six-round lightweight bout pitting undefeated Lamont Roach Jr. (8-0, 3 KOs), of Washington, D.C. , against Jose Bustos , (7-5-3, 4 KOs), of Juarez, México; and A four-round super lightweight fight featuring Kazakhstan's undefeated Ruslan Madiyev (5-0, 3 KOs) versus Sean Gee (2-2) of Chicago. Commentators for the card will be Dave Bontempo , Kevin Kelly and 20-time middleweight champion and future hall of famer Bernard Hopkins .\n\"We're pleased to partner with YipTV as together we're bringing fight fans the next golden age of boxing,\" said David Tetreault , Executive Vice President for Digital Media and Studio Operations at Golden Boy Promotions. \"Together with Golden Boy Promotions, YipTV enables its subscribers to see the next generation of young boxing heroes as they fight their way toward title bouts and ring championships.\"\nYipTV is the first multi-channel Over the Top (OTT) television provider of personalized, low-cost TV content that eliminates the need for cable or satellite TV subscriptions. With availability over any type of wired or mobile broadband connection, YipTV uses Internet-based delivery technology to provide affordable access to international programming content at only $14.99 a month, with no long-term service commitments or contracts.\nThe company always offers 16 of its channels at no charge for an unlimited period of time – with no credit card or contract required at membership sign-up -- and nine of its Premium TV channels are free for a one-week trial period.\nSubscribers sign up for YipTV at www.yiptv.com , and then download apps for iOS or Android devices from the Apple AppStore or GooglePlay. In addition to Android- or iOS-enabled smart devices, YipTV lets subscribers explore a whole world of live telecasts using a Smart TV, laptop or desktop computer. YipTV also can be viewed on a traditional TV screen using an Apple TV™ or a Google Chromecast™ device.\nAbout YipTV:\nYipTV, Inc., is a privately held company with offices in West Palm Beach, Fla. , and New Brunswick, N.J. , that provides low-cost, live television channels, including domestic and international network content. Founded in 2012, YipTV is an Over the Top (OTT) television content provider that distributes over 80 channels and programs in multiple languages, letting subscribers watch YipTV on televisions, tablets, computers, smartphones and other Internet-enabled devices. YipTV sends video content via the public Internet to broadband users, bypassing legacy cable systems and head end technology, and then passes that savings directly to the consumer. For more information, please visit https://www.yiptv.com/ .\nMedia Contact:\nJim Byrnes , on behalf of YipTV\nComunicano\n+1 610-333-1794 (office)\n+1 610-248-5053 (mobile)\njbyrnes@comunicano.com\nSOURCE YipTV\nRELATED LINKS\nhttp://www.yiptv.com", "external_links": ["http://www.yiptv.com/", "https://www.yiptv.com/live-tv/index.php/en/", "https://www.yiptv.com/"], "published": "2015-10-15T20:08:00.000+03:00", "crawled": "2015-10-15T15:12:20.985+03:00", "highlightTitle": ""}