{"organizations": [], "uuid": "dacc83757baf63470e1c48e07fea3ef1ec74fc52", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "neighbornewspapers.com", "main_image": "http://neighbornewspapers.com/images/article.jpg", "site_section": "http://neighbornewspapers.com/rss/rss/Sports?instance=Sports&content_type=article&tags=sports&tag_inclusion=or&offset=0&limit=10&page_name=rss", "section_title": "Sports", "url": "http://neighbornewspapers.com/bookmark/26920081", "country": "US", "title": "Softball continues postseason play in N. Fulton", "performance_score": 0, "site": "neighbornewspapers.com", "participants_count": 1, "title_full": "Softball continues postseason play in N. Fulton", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T22:13:00.000+03:00", "replies_count": 0, "uuid": "dacc83757baf63470e1c48e07fea3ef1ec74fc52"}, "author": "E. Marcel Pourtout mpourtout@neighbornewspapers.com (noreply@neighbornewspapers.com)", "url": "http://neighbornewspapers.com/bookmark/26920081", "ord_in_thread": 0, "title": "Softball continues postseason play in N. Fulton", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Softball continues postseason play in N. Fulton by E. Marcel Pourtout October 21, 2015 02:13 PM | 218 views | 0 | | Three local prep softball programs are still in contention for a state championship and a spot in the Elite Eight for their respective classifications which are held in Columbus starting on Oct. 29Cambridge has continued its stellar play in Class 5A, winning its best-of-three first-round series in the state playoffs over Southwest DeKalb on Oct. 14. The Bears won the first contest 15-0 and the second one 12-0. Cambridge, which improved its record this season to 20-1, have 16 shutouts this year and scored 10 or more runs in 10 contests this season. It has also claimed a region title as well.The Bears look to improve their five-game winning streak this Wednesday when they host Jones County out of Gray in the second-round of the playoffs. The Greyhounds, who finished the regular season second in Region 2 , have won 21 contests this season and won its first-round series over Ware County two games to one.Blessed Trinity also advanced to the second round of the postseason in Class 3A with a series sweep over Southeast Bulloch at home on Oct. 14. The Titans won the first contest 5-0 behind a complete-game, four-hit shutout thrown by Maggie Connolly. Blessed Trinity won the second game 8-6. The Titans received contributions from seniors Christine Kraybill and Nina Castro and the plate and defensively at shortstop from Skylar Hamilton.Blessed Trinity will host Oconee County out of Watkinsville on Wednesday in the second round. The Warriors finished second in Region 8AAA, have won 15 games this season and won its first-round series over Pepperell two games to none.“We will need to continue having strong defense, solid pitching along with smart and aggressive base running to beat a strong program like Oconee County,” Titans’ coach Jonathan Grattan said.Fellowship Christian out of Class A will begins its postseason on Wednesday at Prince Avenue Christian in Athens. The Paladins are slotted at the number 14 seed in the Class A Private playoff bracket. “We will have to come up with some good hits,” Fellowship Christian coach Shannon Holt said. “They have an awesome pitcher, but if we hit well and stop them defensively we can come out with a win. We have a team that is amazing; they have a heart to play and a heart to win.”Prince Avenue comes into the contest and the number three seed in the playoffs out of Region 8A and won 17 contests this season. Share This Article | similar stories", "external_links": [], "published": "2015-10-21T22:13:00.000+03:00", "crawled": "2015-10-22T16:06:25.091+03:00", "highlightTitle": ""}