{"organizations": [], "uuid": "ede22f875022765136066d74adaa19a347e32e2a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3337804/images/o-DEFAULT-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/sports/index.xml", "section_title": "Sports - The Huffington Post", "url": "http://www.huffingtonpost.com/mudit-kakkar/end-of-an-era_2_b_8350524.html", "country": "US", "title": "End of an Era", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "End of an Era", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T17:59:00.000+03:00", "replies_count": 0, "uuid": "ede22f875022765136066d74adaa19a347e32e2a"}, "author": "Mudit Kakkar", "url": "http://www.huffingtonpost.com/mudit-kakkar/end-of-an-era_2_b_8350524.html", "ord_in_thread": 0, "title": "End of an Era", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nSachin, Ganguly, Dravid and Laxman. Each of these legends inspire fierce devotion and nostalgia among Indian cricket fans. As they walked into the sunset of their careers, Laxman was fondly remembered for his deliciously wristy play, Ganguly for his maverick captaincy, Dravid for nerves of steel and Sachin for, well, being Sachin. As a diehard Indian cricket fan myself, I know it's almost blasphemous to reduce these great careers to a few words of praise, but I recount them solely to emphasize how someone with a shorter career than each of the Fab Four still evokes more awe, amazement and now sadly, even nostalgia. \nI distinctly remember how Sehwag took it upon himself to smack the first ball of each of India's first five World Cup 2011 matches for a boundary; almost as if it were considered auspicious to start proceedings in such a fearless manner. But fear is an emotion only mere mortals can understand. Sehwag operated in a rarefied realm where the sound of the ball hitting the middle of the his bat, a delirious crowd and a disconsolate bowler walking back to his run-up were like oxygen to him -- he batted for this sensory experience. \nIndia's scoreline, as briskly as it moved, became a footnote while he was at the crease. To the fan and mostly to him, what mattered was the big flourish of his bat. Neither the bowler nor the spectator had an idea of what was coming; he could be on 295 and slam you for a six or be on 293 and get dismissed. We could guess, but like in any great thriller movie, never correctly predict. Maybe this is why he was such a delight to watch. It was nerve-wracking. It was Sehwag. \n\"End of an era\" is a platitude used and abused in high praise of any outgoing eminent personality. But in this case, it really encapsulates so much more. The complete Indian top-order that any 90s kid grew up watching has now definitively hung its international boots: the one who bared his torso and waved his shirt in a Lord's balcony, the duo who forged one of India's most defiant Test partnerships, the God of Cricket himself, and now, the man who played every game like a T20 match even before T20 arrived. Let that sink in. \nI still have the newspaper which followed Sachin's retirement, and I intend to preserve it. But I have no such plans for the newspaper that followed Sehwag's brilliant \"I did it my way\" parting note, and it's not because the publishers decided to give him less than half the coverage that they afforded Sachin. It's because after reading it cover to cover, I rolled it, held it in my right hand, walked to my balcony, flexed my arms and made a small paper ball out of a stray supplementary newspaper. With the trees my spectators and a song on my lips, I gently threw the ball up in the air and whacked it out of the balcony using the rolled newspaper. It went far; I must have timed it well. Thank you Viru. \nFollow Mudit Kakkar on Twitter: www.twitter.com/kakkarmudit More:", "external_links": [], "published": "2015-10-22T17:59:00.000+03:00", "crawled": "2015-10-22T18:41:04.278+03:00", "highlightTitle": ""}