{"organizations": ["Associated Press", "LSU Brett Martel", "Florida Gators"], "uuid": "4c1d348adfd946afcad79abd38bcca7c5797b1a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.floridatoday.com", "main_image": "http://www.gannett-cdn.com/-mm-/b33ff648739061f5f0b22fc7539540b6117f8a54/c=0-108-3743-2222&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/05/27/Brevard/B9317495698Z.1_20150527101708_000_GNTATC04S.1-0.jpg", "site_section": "http://rssfeeds.floridatoday.com/brevard/floridagatorsports", "section_title": "Brevard - Florida Gator Sports", "url": "http://www.floridatoday.com/story/sports/college/university-florida/2015/10/16/amid-distractions-florida-visits-lsu/74078086/", "country": "US", "title": "Amid distractions, Florida visits LSU", "performance_score": 0, "site": "floridatoday.com", "participants_count": 0, "title_full": "Amid distractions, Florida visits LSU", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T02:04:00.000+03:00", "replies_count": 0, "uuid": "4c1d348adfd946afcad79abd38bcca7c5797b1a3"}, "author": "", "url": "http://www.floridatoday.com/story/sports/college/university-florida/2015/10/16/amid-distractions-florida-visits-lsu/74078086/", "ord_in_thread": 0, "title": "Amid distractions, Florida visits LSU", "locations": ["Gainesville", "Florida"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jim McElwain"], "text": "Amid distractions, Florida visits LSU Brett Martel, Associated Press 7:04 p.m. EDT October 16, 2015 Florida Gators coach Jim McElwain is getting closer to his debut in Gainesville. (Photo: Kim Klement-USA TODAY Sports) CONNECT 3 TWEET LINKEDIN COMMENT EMAIL MORE \nBATON ROUGE, La. — If the resurgent Florida Gators leave LSU’s Death Valley with their first loss this season, they’ll have to wonder, what if? \nThe matchup of No. 8 Florida (6-0, 4-0 Southeastern Conference) and sixth-ranked LSU (5-0, 3-0) on Saturday night is certain to be one of the most anticipated college football contests in the nation this week. \nYet the competitive balance seems to have tipped in LSU’s favor because of Florida’s recent off-the-field issues. Gators starting quarterback Will Grier was suspended one year on Monday for violating the NCAA’s policy on performance-enhancing drugs. Then Florida freshman defensive back Deiondre Porter, one of the club’s top special teams players, hadn’t been arrested this week for allegedly firing a gun in the direction of his pregnant girlfriend. \nAs if trying slow down star LSU running back Leonard Fournette wasn’t enough. Now the Gators’ ability to compartmentalize will be seriously tested. \nFirst-year Florida coach Jim McElwain said playing major college football is always going to challenge players’ ability to focus, even without suspensions or arrests. \n“Let’s talk about chaos and distractions. Playing in Tiger Stadium, in a night game, there’s a lot of it going on,” McElwain said. “This team, they’re about each other and they care, obviously. But at the same time, you’ve got to move on and those are the lessons we learn in life. Sometimes, things happen. So are you going to sit there and hang your head?” \nTreon Harris will be Florida’s quarterback going forward, and McElwain seems to believe Harris is ready. \n“He did a really good job of, when he was in that (backup) role, of preparing like a starter,” McElwain said. “I wish every guy on our team did that because you just never know. You’re one play away.” \nLSU coach Les Miles has seen firsthand how well a talented team can overcome distractions. His own team dealt with them in 2011, when then-starting quarterback Jordan Jefferson was suspended in connection with a bar fight. The Tigers didn’t lose until their rematch with Alabama in the national title game. So Miles is forecasting an epic showdown with the Gators, distractions and all. \n“This is a top-10 matchup. This is Tiger Stadium at its best,” Miles said. “This should be a great game, a very competitive game, and certainly two very capable football teams.” \nSome story lines surrounding the Florida-LSU matchup: \nFORMIDABLE FOURNETTE: LSU’s best hope for a Heisman Trophy winner since Billy Cannon in 1959 has averaged 204.5 yards through five games this season and has scored 12 touchdowns. Florida’s top priority will be to stop him. So far, the Gators have yielded 99.2 yards rushing per game, second best in the SEC. \nHARRIS VS. HARRIS: Florida sophomore Treon Harris has started seven previous games in his career, including the 2015 season opener. He’s 5-2 and passed for 215 yards and two TD’s in his lone start this year vs. New Mexico State. LSU sophomore Brandon Harris has six career starts, five this season. He hasn’t been relied upon much, but passed for a career-high 228 yards last week against South Carolina. \nCOACHING SUCCESS: McElwain, who came to Florida from Colorado State, has won 15 of his last 16 games as a head coach and is the first Florida coach since Galen Hall in 1984 to start 6-0 in his first season. Miles, now in his 11th season with LSU, has 108 victories with the Tigers, second most in school history. \nPASSING CHALLENGE: If LSU is forced to pass, pressure mounts on Brandon Harris and his top two targets, Malachi Dupre and Travin Dural. They’ll have to beat Florida’s talented defensive backs, headlined by Jalen Tabor, who has two interceptions for TDs and Vernon Hargreaves III, who has three picks. “Hargreaves is a very smart player,” Dural said. “You can tell he studies a lot of film. He knows what you are going to do.” \nKICKING MATTERS: Florida place-kicker Austin Hardin is sidelined with a leg injury, so the Gators go with Jorge Powell, who has only two career attempts, but made both. LSU’s Trent Domingue has hit all seven of his attempts this season.  //on.flatoday.com/1RNkLbL TOP VIDEOS", "external_links": [], "published": "2015-10-17T02:04:00.000+03:00", "crawled": "2015-10-17T09:27:37.737+03:00", "highlightTitle": ""}