{"organizations": [], "uuid": "8a7f2f333f926080bafe697e12a1209813210f38", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/5dbac2223827e8b919e81d53f15738c4.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/golf/australia-to-host-2016-world-cup-of-golf-and-2019-presidents/6918592/", "country": "JE", "title": "Australia to host 2016 World Cup of Golf and 2019 Presidents Cup", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "Australia to host 2016 World Cup of Golf and 2019 Presidents Cup", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T14:16:00.000+03:00", "replies_count": 0, "uuid": "8a7f2f333f926080bafe697e12a1209813210f38"}, "author": "", "url": "http://www.sport.co.uk/golf/australia-to-host-2016-world-cup-of-golf-and-2019-presidents/6918592/", "ord_in_thread": 0, "title": "Australia to host 2016 World Cup of Golf and 2019 Presidents Cup", "locations": ["Australia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Australia to host 2016 World Cup of Golf and 2019 Presidents Cup 10 Oct 2015 11:16:57 \ncomments \nWorld number two Jason Day has welcomed the news that Australia will host the World Cup of Golf in 2016 and the Presidents Cup in 2019. \nBoth events will be played in November on one of Melbourne's famous sandbelt courses, with the venue and exact dates yet to be announced. \nRoyal Melbourne hosted the World Cup in 2013 and Day won the individual tournament as well as partnering Adam Scott to victory in the team competition. The event will return to its original team format in 2016. \n\"I'm very, very happy that we're returning to Melbourne,\" US PGA champion Day said. \"Whether we play at Royal Melbourne or some other golf course, I just like playing that sort of golf, and being back in front of the home crowd will be fantastic.\" \nRoyal Melbourne was the site of the International team's only outright victory to date in the Presidents Cup and also hosted the event in 2011. \nPGA Tour commissioner Tim Finchem said: \"The PGA Tour and the International Federation of PGA Tours are elated to partner with the State of Victoria and bring the Presidents Cup and World Cup of Golf back to Australia. \n\"Australia is home to some of the best golfers on the PGA Tour - not to mention some of the world's most passionate fans - and we know Victoria will stage wonderful events for the competitors, as well as fans visiting and watching around the globe. \n\"The success of the recent 2011 Presidents Cup and 2013 World Cup of Golf has reinforced Victoria's stature as a global golf destination and make the area a perfect choice to welcome these esteemed competitions back within the next four years.\" Related Sport News", "external_links": [], "published": "2015-10-10T14:16:00.000+03:00", "crawled": "2015-10-10T19:58:50.714+03:00", "highlightTitle": ""}