{"organizations": ["Iowa State"], "uuid": "f88123b0278c3c3ba9108c0871f703b845b01196", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thegazette.com", "main_image": "http://www.thegazette.com/storyimage/GA/20151001/COLLEGESPORTS/151009952/AR/0/AR-151009952.jpg", "site_section": "http://feeds.feedburner.com/~r/GazetteOnlineSports/~6/1", "section_title": "Eastern Iowa Sports News and Information from Gazette Online", "url": "http://www.thegazette.com/subject/sports/college/football/2-minute-drill-iowa-state-vs-kansas-20151001", "country": "US", "title": "2-Minute Drill: Iowa State vs. Kansas", "performance_score": 0, "site": "thegazette.com", "participants_count": 0, "title_full": "2-Minute Drill: Iowa State vs. Kansas", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T02:47:00.000+03:00", "replies_count": 0, "uuid": "f88123b0278c3c3ba9108c0871f703b845b01196"}, "author": "", "url": "http://www.thegazette.com/subject/sports/college/football/2-minute-drill-iowa-state-vs-kansas-20151001", "ord_in_thread": 0, "title": "2-Minute Drill: Iowa State vs. Kansas", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "October 1, 2015 | 7:47 pm \nISU RUSH OFFENSE VS. KANSAS RUSH DEFENSE \nIowa State ranks last in the Big 12 in rushing offense, but started to find its way last time out. The Cyclones ran for 207 yards against Toledo, including 126 from red-shirt freshman Mike Warren. Expect Tyler Brown, Trever Ryen and Joshua Thomas to all get carries behind a relatively healthy offensive line. Meanwhile, Kansas allowed 312 yards on the ground to Rutgers last week. Advantage: Iowa State \nISU PASS OFFENSE VS. KU PASS DEFENSE \nDespite all of the weapons Iowa State has at wide receiver, defenses through three games have dictated only a few will get touches. Against the Jayhawks, look for the Cyclones to spread the ball around more easily. Allen Lazard has been steady with 15 catches, 150 yards and a score while D’Vario Montgomery emerged against Toledo. But this could be a breakout game for Quenton Bundrage against a KU defense that allows 288 passing yards per game. Advantage: Iowa State \nKANSAS RUSH OFFENSE VS. ISU RUSH DEFENSE \nKe’aun Kinner has been one of a few bright spots for Kansas, averaging 98.3 rushing yards through three games. The Jayhawks are running for 181 yards per game aided by mobile quarterback Montell Cozart. Kansas has been unable to rush well on a consistent basis and ran for just 64 yards on 29 carries last week. Demond Tucker and Dale Pierson will be at the front of the ISU defense and must be sound at the point of attack, but did hold Kareem Hunt — arguably one of the best backs in the nation — to 129 yards. Advantage: Iowa State \nKANSAS PASS OFFENSE VS. ISU PASS DEFENSE \nKU red-shirt freshman receiver Tyler Patrick was elevated from scout team and is listed as a starter recently because of injuries. The Jayhawks pass offense throws for 244.7 yards per game, but will face the strength of the ISU defense. The Cyclones secondary will be bolstered by the return of Qujuan Floyd and gets experienced depth with Sam E. Richardson behind Brian Peavy. Advantage: Iowa State \nSPECIAL TEAMS \nISU kicker Cole Netten is 5-for-8 on field goals this season, but missed the game winning 32-yarder against Toledo before bouncing back in overtime from 44 yards out. Punter Colin Downing has averaged 41.6 yards per punt on 14 kicks with nine kicks inside the 20. Allen Lazard is second in the Big 12 in punt return average at 17 yards while KU punter Eric Kahn is last in the conference at 35.1 yards per kick. Nick Bartolotta is 3-for-3 on Kansas field goals. Advantage: Iowa State \nISU WILL WIN IF ... \nIt can continue the success of the rushing attack from two weeks ago and contains Kansas runners. Mike Warren’s production on the ground will give Iowa State a chance to mix things up on offense and open up the passing game against a KU defense that allows 542.3 yards of total offense. Ke’aun Kinner and Montell Cozart have been the key to most of the Jayhawks’ offensive success, so slowing them down could stall the entire offense. \nKU WILL WIN IF ... \nIt can force turnovers and keep Iowa State out of the red zone. The Cyclones are last in the Big 12 in red zone offense with scores on 7-of-11 chances. Iowa State has also only turned it over four times this season, so Kansas must capitalize on any extra chances it gets. \nINTANGIBLES \n1. Kansas leads the all-time series against Iowa State 50-38-6 and even has the advantage in games in Ames at 22-21-3, but the Cyclones have won four of the last five meetings. \n2. The last time Iowa State won its Big 12 opener was in 2002 when it beat Kansas 45-3 in Mark Mangino’s first conference game on the Jayhawks’ sidelines. \n3. When Kansas and Iowa State met in 2013, it was the coldest game ever played in Jack Trice Stadium with a temperature of 8 degrees at kickoff. The Cyclones won 34-0. \n3 AND OUT \n1. ISU senior quarterback Sam Richardson has never started a game against Kansas. He was injured in 2013 and ’14 and junior Grant Rohach got the nod. Richardson did relieve Steele Jantz in 2012, throwing 23-for-27 for 250 yards and four touchdowns. \n2. Cyclones offensive coordinator Mark Mangino, offensive line coach Brandon Blaney, wide receiver coach Tommy Mangino and KU coach David Beaty were all on the Jayhawks staff in 2008-09. \n3. An Iowa State win Saturday would mark the first Big 12 win for the Cyclones since they beat West Virginia 52-44 in 3OT on Nov. 30, 2013 in Morgantown. \nPREDICTION \nIowa State 35, Kansas 20 Your Next College Football Articles", "external_links": [], "published": "2015-10-02T02:47:00.000+03:00", "crawled": "2015-10-02T18:41:43.512+03:00", "highlightTitle": ""}