{"organizations": [], "uuid": "77266df8891b537ffb34c03ce86956969eb11bc2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.si.com", "main_image": "http://cdn-jpg.si.com/sites/default/files/styles/si_gallery_slide/public/2015/10/08/anthony-davis-alvin-gentry-pelicans.jpg?itok=hmjUMBZv", "site_section": "http://www.si.com/htmlsitemap/2014", "section_title": "The Sports Illustrated HTML Sitemap Index for 2014 - SI.com", "url": "http://www.si.com/nba/2015/10/08/anthony-davis-pelicans-alvin-gentry-jrue-holiday-tyreke-evans", "country": "US", "title": "Alvin Gentry leading rebirth of Anthony Davis and Pelicans - NBA", "performance_score": 0, "site": "si.com", "participants_count": 1, "title_full": "Alvin Gentry leading rebirth of Anthony Davis and Pelicans - NBA - SI.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 1, "uuid": "99d0e9e48021e2101a5731d83794da7c48a6981e"}, "author": "", "url": "http://www.si.com/nba/2015/10/08/anthony-davis-pelicans-alvin-gentry-jrue-holiday-tyreke-evans#post-0", "ord_in_thread": 0, "title": "Alvin Gentry leading rebirth of Anthony Davis and Pelicans - NBA", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "by Rob Mahoney Twitter Email Posted: Thu Oct. 8, 2015 WHITE SULPHUR SPRINGS, W.Va. — Rather than learn new teammates and new plays at training camp, the New Orleans Pelicans have endeavored to learn an entirely new way of thinking. Their brains had been conditioned to patience; under Monty Williams last season, New Orleans plodded along at the league’s fourth-slowest pace, deferring to the point of dormancy. Management saw fit to caffeinate the team’s offense by relieving Williams of his post and hiring Alvin Gentry, former Warriors assistant and seven-seconds-or-less booster, to coach the same personnel in a very different way.\nA sleepy pocket of West Virginia was chosen as the site of the Pelicans ’ collective reprogramming. Every morning, players would rise from under their floral bedspreads and trek across the resort grounds to an indoor tennis facility. Inside they found a pair of hardwood courts that had been disassembled and driven some 2,000 miles to serve as their launchpad. They drilled, they scrimmaged, and most important: they ran.\n“If you want to be a jogging team, you can be a jogging team,” Gentry said. “But if you want to be a running team…well, it’s not something that just happens overnight. It's not so much running fast but running consistently. That's what we're trying to establish.”\nPace of play is at the center of many of the greatest misconceptions in basketball, including the ease with which it can be manipulated. It might seem as though getting a group of top-notch athletes to ramp up the tempo would be as simple as a coach pushing on the rhetorical throttle. In reality, players are products of their learned habits. Teams can find prime scoring opportunities when they make a conscious effort to run. They can only make hay, though, when the itch to push in transition comes from a deeper-seated instinct.\nThe source of that subconscious voice is persistent coaching. Pelicans players are prompted about running the floor in film sessions, on the practice court, and in casual conversation. Drills are executed at full speed and scrimmages played with an 18-second shot clock (Gentry says that when his team really needs a kick, he’ll drop it to 15).\n“I equate it to a wide receiver that knows the ball's not coming to him,” Gentry said. “You still have to run the route just like it's coming to you to keep the defense honest. Our goal is to make sure everyone is [running] like the wide receiver that the ball is coming to.”\nPlayers are taught to finish out defensive possessions but to end them in a sprinter’s stance, ready to fire off. Within the first three steps, the Pelicans aim to spread wide into their respective lanes, from which they can move the ball and capitalize on the first quality shot. The reminders are constant. They also reinforce the stylistic compromise that Gentry and his staff have made in ramping up the tempo and relinquishing micromanagerial authority.\n“People can talk about wanting to go fast,” Pelicans assistant Phil Weber said. “At the end of the day, many coaches—I don't want to label all coaches, but many coaches—invariably want to control.\n“[Gentry] is a special type of a coach.”\n***\nPhoto: Layne Murdoch Jr./Getty Images\nNew Orleans first made contact with Gentry in mid-May, roughly a week after Williams’s dismissal. To a man, the Pelicans are insistent that Williams did good work with the team; he was credited not only for giving this group its competitive foundation but also his tremendous work in drawing up after-timeout plays—on which New Orleans was the single most efficient team in the league, per Synergy Sports. All of that rings true. Yet from a wider perspective, it's clear the Pelicans believe they can can do more. They return players responsible for 90% of last season's total minutes but brought in a head coach with a radically different system.\n“It was an organizational decision,” Demps said. “Monty did a lot of good things for us; I thought that Monty did a great job of establishing a blue-collar approach. I thought our guys played hard. We did feel that we had come to a point where we wanted a change in leadership and our goal is maximizing our team.\n“We wanted to get a coach that was the best fit for our current team in the short term and the long term, and for our organization and our community. We felt Alvin was the ideal choice. His style of play will be a little different than what we’ve done in the past. Our goal is to maximize our group. The West is so tough right now that you have to maximize your team just to compete.”\nNBA The rapid rise of Anthony Davis by Lee Jenkins", "external_links": ["http://twitter.com/RobMahoney"], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-09T04:34:52.278+03:00", "highlightTitle": ""}