{"organizations": [], "uuid": "1fdbeaf331e110ba04fda58295e7044afa7a83eb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "http://s4.reutersmedia.net/resources/r/?m=02&d=20151009&t=2&i=1085882151&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB981AU", "site_section": "http://www.reuters.com/news/sports", "section_title": "Sports News, Highlights &amp; Coverage | Reuters.com", "url": "http://www.reuters.com/article/2015/10/09/us-baseball-playoffs-chicago-idUSKCN0S32RE20151009", "country": "US", "title": "In Chicago, Cubs baseball fans dare to dream as playoffs begin", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "In Chicago, Cubs baseball fans dare to dream as playoffs begin | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T03:40:00.000+03:00", "replies_count": 0, "uuid": "1fdbeaf331e110ba04fda58295e7044afa7a83eb"}, "author": "Fiona Ortiz", "url": "http://www.reuters.com/article/2015/10/09/us-baseball-playoffs-chicago-idUSKCN0S32RE20151009", "ord_in_thread": 0, "title": "In Chicago, Cubs baseball fans dare to dream as playoffs begin", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO Every Chicago Cubs fan can recite the bitter moments over decades past when they dared to hope their eternally doomed team would make the playoffs or even win a World Series, only to see catastrophe strike.\nThis year Cubs followers are shedding hardened layers of pessimism as the team - which has not won a World Series in more than a century and has not played in one since 1945 - heads into the post-season against arch-rivals the St. Louis Cardinals.\nAhead of Game One of their best-of-five series against the Cardinals in St. Louis on Friday evening, even hardened skeptics were swept away by the electricity in the air and the blue-and-white \"W\" for \"win\" flags being flown everywhere from sports bars to City Hall.\n\"I am allowing my pessimism to go away. I was out today and saw everyone wearing their Cubs shirts and I was like 'wow,'\" said lifelong fan Rich Brown, 49, who grew up watching the team from the Wrigley Field bleachers, where rowdy fans gather in an area without assigned seats.\nFans are getting goosebumps over the talented, young team coached by manager Joe Maddon and led by pitching ace Jake Arrieta.\nNo other American pro sports team in baseball, football, hockey or basketball has had such a prolonged championship drought and the Cubs are the dubious record-holders of both the longest World Series drought and the longest division pennant drought in Major League Baseball.\nFans are still nursing their disappointment from 2003 when the Cubs were six outs away from going to the World Series. The team was swept by the Dodgers in the first round of the 2008 post-season.\nGround zero for Cubs gloominess is at the Billy Goat Tavern on Chicago's north side. In 1945, so the legend goes, the then-owner of the tavern put a curse on the team when ushers did not let his pet goat into Wrigley Field.\n\"We've heard less about the goat this year than in any post-season run I remember,\" said a White Sox fan interviewed at the Billy Goat, who declined to give his name.\nA more positive portent comes from the 1989 movie \"Back to the Future,\" in which a character spies a 2015 newspaper headline \"Cubs Sweep Series in 5.\"\n\"It's a perfect time to be overcome with the romance of baseball. This is a really hopeful and fun time to be a Cubs fan,\" said Anders Lindall, 37, a two-decade fan who shares season tickets with family and friends.\nHe treasures a scorecard his grandmother filled out at a World Series Cubs-Yankees game in 1932. Although, of course, the Cubs lost that one too.\nEither the Cardinals or the Cubs will meet the Mets or the Dodgers to try to win the National League pennant and earn a trip to the World Series.\n\"I'm enthusiastic. But a person is only born with so much stomach lining. And at this juncture I've used just about all of it up,\" said long-time Cubs fan Mike Kearns.\n(Reporting by Fiona Ortiz; Editing by Dan Whitcomb and Lisa Shumaker )", "external_links": [], "published": "2015-10-10T03:40:00.000+03:00", "crawled": "2015-10-10T03:14:37.320+03:00", "highlightTitle": ""}