{"organizations": [], "uuid": "e98df613fc2608178b4730503a156dda850b60ff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fox8live.com", "main_image": "http://WAFB.images.worldnow.com/images/8846922_G.jpg", "site_section": "http://www.fox8live.com/", "section_title": "New Orleans News, Weather, Saints - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "url": "http://www.fox8live.com/story/30222128/events-shift-low-ticket-sales-thursday-after-last-minute-change-for-lsu-game", "country": "US", "title": "Events shift, low ticket sales Thursday after last-minute change", "performance_score": 0, "site": "fox8live.com", "participants_count": 1, "title_full": "Events shift, low ticket sales Thursday after last-minute change - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T07:22:00.000+03:00", "replies_count": 0, "uuid": "e98df613fc2608178b4730503a156dda850b60ff"}, "author": "WAFB Staff", "url": "http://www.fox8live.com/story/30222128/events-shift-low-ticket-sales-thursday-after-last-minute-change-for-lsu-game", "ord_in_thread": 0, "title": "Events shift, low ticket sales Thursday after last-minute change", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BATON ROUGE, LA (WAFB) - Moving the LSU game against South Carolina to Baton Rouge means other events around the Capital City are scrambling to change their times or locations.\nThat isn't the only adjustment as pulling enough staff to cover certain areas has become a chore.\nThe Cap City Beerfest in Town Square was supposed to be a late afternoon event when the game was scheduled to be away. Now, organizers have turned it into a tailgate party before the game.\nThe key in pulling off the venue switch for the game this weekend is flexibility.\nEmergency Services in Baton Rouge are feeling stretched thin due to scheduling conflicts around Saturday's sudden football game at Tiger Stadium.\nMike Chustz with the East Baton Rouge EMS said medical crews have been scheduled to work several events around Baton Rouge this weekend. Then, it became clear he needed enough people to cover Saturday's game.\n\"Getting people to work on Saturday on their days off is tough sometimes,\" said Chustz.\nEMS workers get two Saturdays off a month, so they'll be covering the game with less staff than normal.\n\"All the people who had events previously scheduled with us were all panicking and calling,\" said Chustz.\nFor those who going to the game, EMS reminds the public to make sure to limit the alcohol and caffeine intake and fill up on water and sports drinks instead.\nChustz said with temperatures hitting close to 90, they are moving enough trucks over to LSU to treat people for heat illnesses. He said the saving grace may be low turnout.\nAccording to the LSU Ticket Office, a little more than 36,000 tickets were sold for the game by Thursday evening.\nThings were very quiet inside the LSU Ticket Office Thursday, but staff say they expect most fans will buy tickets on the day of the game or online.\nThey've rolled out two mobile buildings, each with five windows, in case a lot of people walk up Saturday to buy tickets.\nA couple of students said they can't beat the $5 student tickets, but still, some say the announcement came too late for them to go to the game.\n\"Yea, it's kind of last minute,\" said Donnie Savoie, a student at LSU.\nSavoie said there is a reason for the almost non-existent ticket lines.\n\"A lot of my friends are still heading out of town. Just normal activities we do for away games. Kind of messed us up with this one,\" said Savoie.\nIn addition to welcoming South Carolina fans, the university said Red Cross volunteers will be in and around Tiger Stadium to accept donations for flood relief.\nIn his email to fans, Joe Alleva told fans they should take advantage of see the Tigers and another SEC Legend, Steve Spurrier.\nHe also said that some fans asked about having the field inside the stadium painted in South Carolina colors, but he said that won't happen because LSU has another home game next week.\nCopyright 2015 WAFB . All rights reserved.", "external_links": [], "published": "2015-10-09T07:22:00.000+03:00", "crawled": "2015-10-09T17:15:14.771+03:00", "highlightTitle": ""}