{"organizations": [], "uuid": "7056430afbdad2a75bbd039a1b9682acc4873969", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.abqjournal.com", "main_image": "http://main.abqjournal.netdna-cdn.com/wp-content/uploads/2015/10/JimmyRomero-320x400.jpg", "site_section": "http://www.abqjournal.com/", "section_title": "Albuquerque Journal | Albuquerque and New Mexico News, Sports, Business and more", "url": "http://www.abqjournal.com/663483/news/the-night-before-domestic-violence-court-hearing-man-charged-with-stabbing-woman-in-new-dv-case.html", "country": "US", "title": "The night before domestic violence court hearing, man charged with stabbing woman in new DV case", "performance_score": 0, "site": "abqjournal.com", "participants_count": 2, "title_full": "Albuquerque Journal | The night before domestic violence court hearing, man charged with stabbing woman in new DV case", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T02:10:00.000+03:00", "replies_count": 1, "uuid": "7056430afbdad2a75bbd039a1b9682acc4873969"}, "author": "Edmundo Carrillo/Journal North", "url": "http://www.abqjournal.com/663483/news/the-night-before-domestic-violence-court-hearing-man-charged-with-stabbing-woman-in-new-dv-case.html", "ord_in_thread": 0, "title": "The night before domestic violence court hearing, man charged with stabbing woman in new DV case", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SANTA FE — A man with a long history of domestic violence has been arrested for allegedly stabbing his girlfriend with a knife Tuesday night, the night before he was supposed to appear in court on a prior domestic violence case involving the same woman.\nJimmy Romero, 33, was booked into the Santa Fe County jail after police say he stabbed the victim near her armpit, causing her to be transported to Presbyterian Española Hospital to receive four stitches and treatment for other minor wounds.\nJimmy Romero\nAccording to an incident report from the Santa Fe County Sheriff’s Office, deputies responded to a domestic dispute call on Finley Road in the Arroyo Seco area at 8:30 p.m. Tuesday. The victim said she and Romero were watching TV in his room at this mother’s house when he began calling her names and grabbed her by the hair. She said she began hitting Romero to try to get away from him.\nAfter Romero’s stepfather came into the room to separate them, the victim said, she went to the front of the house. While waiting for his parents to retrieve her belongings from his room, the woman said Romero came at her with a knife and slashed at her with it, causing a three or four-inch laceration. Deputies also noticed a small cut on the victim’s forehead and a small amount of bleeding near her left temple.\nThe woman told police Romero became angry because he had to go to sleep for an early-morning court hearing for a pending domestic violence case involving the same victim. Romero told police the woman had accused him of cheating and pulled a knife and started swinging it at him, but his accounts of what happened were inconsistent, according to the report. Romero also admitted to drinking a beer that day, and deputies reported smelling alcohol on his breath.\nRomero was charged with aggravated battery against a household member with a deadly weapon, battery against a household member and tampering with evidence after being identified as the aggressor. He was also charged with violating the conditions of his release in the pending domestic violence case because he was not supposed to have contact with the victim or drink alcohol. Deputies also learned that Romero and the victim have a daughter. No Santa Fe County Magistrate Judge has set a bond for Romero as of Wednesday evening.\nRomero was released from jail two weeks ago for aggravated assault with a deadly weapon against a household member and aggravated battery against a household member in the previous domestic violence incident with the victim that happened in August, and he has been charged several times with domestic assault and battery. He had a battery charge dismissed in 2013 and pleaded guilty to aggravated battery with a deadly weapon in 2012.\nIn 2011, Romero pleaded guilty to battery against a household member and had charges of aggravated assault, aggravated battery and tampering with evidence dropped in a separate incident later that year. Romero pleaded guilty to battery against a household member in 2003 and pleaded guilty to assault against a household member in 2004.", "external_links": ["http://main.abqjournal.netdna-cdn.com/wp-content/uploads/2015/10/JimmyRomero.jpg"], "published": "2015-10-22T02:10:00.000+03:00", "crawled": "2015-10-22T16:38:00.631+03:00", "highlightTitle": ""}