{"organizations": [], "uuid": "165e9bf5ef37b37f9473087a83af7583372114b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.baltimoresun.com", "main_image": "http://www.trbimg.com/img-562adf60/turbine/bs-va-sp-mcdonogh-soccer-medghalchi-20151023", "site_section": "http://www.baltimoresun.com/sports/high-school/rss2.0.xml#", "section_title": "High School Sports - Baltimore Sun", "url": "http://www.baltimoresun.com/sports/high-school/bs-va-sp-mcdonogh-soccer-medghalchi-20151023-story.html", "country": "US", "title": "McDonogh soccer goalie Arman Medghalchi shines in second-best sport", "performance_score": 0, "site": "baltimoresun.com", "participants_count": 1, "title_full": "McDonogh soccer goalie Arman Medghalchi shines in second-best sport", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T04:20:00.000+03:00", "replies_count": 0, "uuid": "165e9bf5ef37b37f9473087a83af7583372114b1"}, "author": "Glenn Graham", "url": "http://www.baltimoresun.com/sports/high-school/bs-va-sp-mcdonogh-soccer-medghalchi-20151023-story.html", "ord_in_thread": 0, "title": "McDonogh soccer goalie Arman Medghalchi shines in second-best sport", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Read the story \nWith strong players in front of him — the Eagles have two of the top central defenders in seniors Michael Deshields and Cale Thorne — Medghalchi has been able to stay comfortable in goal. \n\"My defense is really strong and they help me with a lot of stuff. They know I don't play soccer year round and they are used to that,\" he said. \"Communication is a big thing. The more you communicate the more confident you get and once you have confidence, everything sort of takes care of itself.\" \nQuaranta said he's come to expect consistent play from Medghalchi along with at least two or three big saves per game. \nIn McDonogh's big showdown against No. 2 Calvert Hall on Oct. 9 — in what would end in a 2-0 win for the Eagles — Medghalchi was at his best with a difficult reaction save on a blistering shot from Cardinals junior Reugo Nnadozie. \nThe shot seemed to come out of nowhere from the left side and was aimed for the top far post when Medghalchi reached high to tip it over the crossbar, keeping McDonogh's 1-0 lead. \nMedghalchi used much of the instruction he has learned from first-year goalkeeper coach William Vanzela to make the save: Take a quick and big first step toward the shooter to be able to lift off and use the opposite hand from where the shot is coming — this time the right — to send it over the crossbar. \nQuaranta said the save was as good as any goalkeeper at any level could make. \n\"And that's not an exaggeration,\" he added. \nVanzela, the star goalie for the Major Arena Soccer League's Blast, smiled wide after the effort. \n\"He did a very good job. Every time he makes a big save, I celebrate,\" he said. \nSo did Medghalchi, who got approval from his defense. \n\"It always feels great, especially when your defenders come up to you and give you a high five,\" he said. \"Before the season, Coach William told me to look forward to those moments because you can make one mistake as a goalie and everything can turn against you. So you have to make sure to cherish those moments.\"", "external_links": [], "published": "2015-10-24T04:20:00.000+03:00", "crawled": "2015-10-24T05:17:20.524+03:00", "highlightTitle": ""}