{"organizations": [], "uuid": "03dd40f2d8989555fc74d94a5db4c37b7a404bf9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.arcamax.com", "main_image": "http://www.arcamax.com/newspics/131/13113/1311351.jpg", "site_section": "http://www.arcamax.com/sports/", "section_title": "Sports | ArcaMax Publishing", "url": "http://www.arcamax.com/sports/baseball/s-1733055?fs", "country": "US", "title": "Billy Eppler steps boldly into his new job as Angels general manager | Baseball", "performance_score": 0, "site": "arcamax.com", "participants_count": 1, "title_full": "Billy Eppler steps boldly into his new job as Angels general manager | Baseball | ArcaMax Publishing", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "03dd40f2d8989555fc74d94a5db4c37b7a404bf9"}, "author": "arcamax.com", "url": "http://www.arcamax.com/sports/baseball/s-1733055?fs", "ord_in_thread": 0, "title": "Billy Eppler steps boldly into his new job as Angels general manager | Baseball", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ANAHEIM, Calif. -- The perception around baseball is that the Los Angeles Angels general manager operates somewhere between a rock and a hard place, the presence of powerful strong-willed Manager Mike Scioscia and heavy-handed, too-intrusive Owner Arte Moreno making it a difficult and perhaps thankless job to fill.\nJerry Dipoto found the situation untenable and abruptly resigned as Angels GM on July 1 amid renewed friction with Scioscia and a perceived lack of support from upper management.\nInto this fray steps Billy Eppler, who was formally introduced as the team's general manager on Monday with absolutely no trepidation about what he's getting into. It helps to be armed with a four-year contract and five years of work under tyrannical former New York Yankees owner George Steinbrenner.\n\"In my DNA, I'm looking for a place that has high expectations, with a demanding work environment, because I'm used to it,\" said Eppler, who spent 11 years with the Yankees, the last four as assistant GM. \"That's professionally how I grew up, so it's second nature to me.\n\"That's why I gravitated toward this job. There were no red flags on my part. There was nothing I worried about. And I think growing up in that New York environment and the microscope that comes with it ... I don't know, maybe that played in my favor.\"\nWhen Dipoto was hired in October 2011, Moreno said the GM would have \"complete power\" to make baseball decisions, but it didn't turn out that way.\nDipoto couldn't have fired Scioscia, who is seven years into a 10-year, $50 million contract and announced Monday that he will return for 2016. And Moreno -- not Dipoto -- was the driving force behind the ill-fated signing of Josh Hamilton to a five-year, $125 million contract after the 2013 season.\nAsked Monday if Eppler, 40, would have total control of baseball operations, Moreno said, \"He will have as much as he can take, really.\"\nEppler said he wasn't sure how much autonomy he would have in decision-making.\n\"It wasn't something that came up during the interview process,\" he said. \"But it was evident they wanted somebody to lead baseball operations, and they put me in the role to do that.\"\nEppler, runner-up to Dipoto in 2011 and the choice among a field of 10 finalists this time, leans more toward consensus-building than autocratic rule.\n\"I collect information from everybody; I get opinions from everybody,\" he said, \"and I try not to make decisions too quickly.\"\nAdvanced statistics would complement those decisions, Eppler said, \"but I do not believe they are a driver of decision-making. I believe analytics can be a very valuable weapon. But I think you have to educate the people using analytics, because like any weapon, if you don't use it right, it can blow up on you.\"\nEppler is a San Diego native who pitched for the University of Connecticut and has a background is in scouting and player development. He will spend several weeks getting to know the front office and field staff.\n\"Generally, I'm a little bit more resistant to change,\" said Eppler, who grew under the tutelage of Yankees GM Brian Cashman. \"I believe in working with the people that are here, and I know a lot of them.\"\nThen, Eppler said, it will be time to \"roll up our sleeves and really get to work\" on a roster in dire need of a front-of-the-rotation starter, a potent left-field bat, a third baseman, a middle reliever and possibly a second baseman.\nThere will be attractive options on the free-agent market, including pitchers David Price, Jordan Zimmerman and Zack Greinke and outfielders Yoenis Cespedes and Justin Upton.\nBut the Angels, who finished one game out of the playoffs, already have commitments of about $165 million toward their 2016 payroll. To sign a marquee player or two, they probably would have to blow past the $189 million luxury tax threshold, which Moreno said he is willing to do.\n\"Our plans are not to rebuild,\" Moreno said. \"I don't want to put a hamstring on the team. If we find areas where we need to make the investment, we're going to make the investment.\"\nEppler said he is \"generally pleased\" with what he considers a \"championship-caliber core,\" which includes superstar center fielder Mike Trout, first baseman Albert Pujols, right fielder Kole Calhoun, shortstop Erick Aybar and pitchers Garrett Richards, Huston Street and Joe Smith.\nHe said he has spoken to Scioscia about his desire to \"build a team that fits the ballpark it plays in,\" an indication Eppler might lean more toward pitching and defense rather than offense.\n\"There are some thoroughbreds that can pull the cart,\" Eppler said, \"so we're going to try to land some other horses that can help pull it.\"\n(c)2015 Los Angeles Times\nVisit the Los Angeles Times at www.latimes.com\nDistributed by Tribune Content Agency, LLC.\nShare Comment", "external_links": ["https://plus.google.com/share?url=http://www.arcamax.com/sports/baseball/s-1733055", "http://twitter.com/share?url=http://www.arcamax.com/sports/baseball/s-1733055&hashtags=ArcaMax", "http://www.facebook.com/sharer.php?u=http://www.arcamax.com/sports/baseball/s-1733055&h=Billy+Eppler+steps+boldly+into+his+new+job+as+Angels+general+manager"], "published": "2015-10-06T03:00:00.000+03:00", "crawled": "2015-10-08T01:17:17.415+03:00", "highlightTitle": ""}