{"organizations": ["Associated Press", "TCU", "Iowa State"], "uuid": "300406e8016ceb25fff716c2d47b004d95e17ebf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pendletontimespost.com", "main_image": "", "site_section": "http://pendletontimespost.com//feed/sec/6000/", "section_title": "PendletonTimesPost.com - Sports News", "url": "http://www.pendletontimespost.com/view/story/7702ea82b79c4720ac2e21c5c2cb67b7/FBC--Iowa-State/", "country": "US", "title": "Second-half slump dooms Iowa St in 45-21 loss to No. 3 TCU", "performance_score": 0, "site": "pendletontimespost.com", "participants_count": 0, "title_full": "Second-half slump dooms Iowa St in 45-21 loss to No. 3 TCU", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T07:30:00.000+03:00", "replies_count": 0, "uuid": "300406e8016ceb25fff716c2d47b004d95e17ebf"}, "author": "", "url": "http://www.pendletontimespost.com/view/story/7702ea82b79c4720ac2e21c5c2cb67b7/FBC--Iowa-State/", "ord_in_thread": 0, "title": "Second-half slump dooms Iowa St in 45-21 loss to No. 3 TCU", "locations": ["Iowa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Boykin", "CHUCK SCHOFFNER"], "text": "Trevone Boykin throws for 436 yards, 4 TDs and No. 3 TCU rolls past Iowa State 45-21 By CHUCK SCHOFFNER Associated Press   18, 2015 - 12:30 amLast Updated: October 18, 2015 - 12:30 am   \nPeople: \nIowa (673) \n\nAMES, Iowa — Matching one of the nation's best teams stride for stride for a half, Iowa State had legitimate hopes of springing a major upset. \nThen the offense went south and those hopes vanished. No. 3 TCU was just too good Saturday night. \nIowa State led 21-14 late in the first quarter and trailed just 24-21 at halftime. But TCU scored on the opening possession of the second half and the Cyclones were never a serious threat again \n\"It's very frustrating,\" ISU receiver Quenton Bundrage said. \"I personally felt like we could have won this game. We let it slip out of our hands.\" \nTrevone Boykin threw for 436 yards and four touchdowns as TCU rolled past Iowa State 45-21 for its third road win in four weeks. Josh Doctson had 190 yards receiving and two TDs for the Horned Frogs (7-0, 4-0 Big 12), who went on a 31-0 run after the first quarter. \nBut it was touch and go for a while. \nIowa State piled up 262 yards in the opening quarter and looked as sharp offensively as it had all year. But they had few answers for TCU's defensive adjustments and managed only 199 yards over the final three quarters. \n\"They started bringing more pressure, they started bringing pressure off the edge,\" Iowa State coach Paul Rhoads said. \"They were adding not just five guys but six guys against the run game. And they tackled. They're a well-coached defensive football team.\" \nBoykin's 3-yard TD run with 14:36 left put TCU ahead 38-21. Doctson made it a rout with a 42-yard touchdown catch six minutes later. \nSam Richardson had 251 yards passing for Iowa State (2-4, 1-2). But Mike Warren, who had averaged 182 yards rushing over his three previous starts, was held to 78 on 22 carries. \n\"I think we gave them a run for their money there in the first half,\" Richardson said. \"We just didn't get it done in the second.\" \nTCU went 86 yards to open the second half, and a 13-yard TD run by Kyle Hicks made it 31-21. Nick Orr forced a fumble on a blind side blitz to kill an Iowa State drive, and Boykin's touchdown run capped an 85-yard drive that put Iowa State behind by 17. \nThe Cyclones were threatening to pull back within 10, but Joshua Thomas fell down on a fourth-down screen pass with 11:20 to go. Boykin connected with Doctson six plays later. \nRhoads had preached to his team all week about the importance of a fast start. \nThe Cyclones got one, with a 74-yard touchdown reception by Allen Lazard — who finished with 147 yards on five catches — bookended by short TD runs by Thomas and Warren in the first quarter. \nTCU started just as quickly though, scoring on TD throws from Boykin to Doctson (20 yards), Kolby Listenbee (21 yards) and Charlie Reid (14 yards). \n\"There's a reason they're ranked third in the country and you saw it tonight as they backed it up with a 60-minute effort,\" Rhoads said. \"I'm proud of our guys for what they did for the first 30. We needed a little bit more out of them to finish it off to have an opportunity.\" \nAll content copyright ©2015 Pendleton Times-Post, a division of Home News Enterprises unless otherwise noted.", "external_links": [], "published": "2015-10-18T07:30:00.000+03:00", "crawled": "2015-10-18T07:32:33.021+03:00", "highlightTitle": ""}