{"organizations": [], "uuid": "43a453bd2340d21ad712f8fedad5b28493945749", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.aspentimes.com", "main_image": "http://www.aspentimes.com/csp/mediapool/sites/dt.common.streams.StreamServer.cls?STREAMOID=8Pq4pOl6B9BxUcvdAEDQes$daE2N3K4ZzOUsqbU5sYtBLgCquoeZb1f69_72PrvIWCsjLu883Ygn4B49Lvm9bPe2QeMKQdVeZmXF$9l$4uCZ8QDXhaHEp3rvzXRJFdy0KqPHLoMevcTLo3h8xh70Y6N_U_CryOsw6FTOdKL_jpQ-&CONTENTTYPE=image/jpeg", "site_section": "http://www.aspentimes.com/csp/mediapool/sites/SwiftShared/assets/csp/rssCategoryFeed.csp?pub=AspenTimes&sectionId=972&sectionLabel=Sports", "section_title": "The Aspen Times Section RSS Feed: Sports", "url": "http://www.aspentimes.com/news/sports/18739949-113/football-basalt-passes-test-vs-battle-mountain", "country": "US", "title": "Football: Basalt passes test vs. Battle Mountain", "performance_score": 0, "site": "aspentimes.com", "participants_count": 1, "title_full": "Football: Basalt passes test vs. Battle Mountain", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T08:40:00.000+03:00", "replies_count": 0, "uuid": "43a453bd2340d21ad712f8fedad5b28493945749"}, "author": "DALE STRODE", "url": "http://www.aspentimes.com/news/sports/18739949-113/football-basalt-passes-test-vs-battle-mountain", "ord_in_thread": 0, "title": "Football: Basalt passes test vs. Battle Mountain", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Media The Longhorns passed the test. The Basalt High School football team came from behind in the second half Friday night to beat Battle Mountain 20-10 in a Western Slope League North showdown at BHS Stadium. Playing in front of a huge crowd, the Longhorns erased a 10-6 halftime deficit with a pair of second-half scores. Basalt took the lead in the third quarter when they drove 79 yards for a touchdown on the Longhorns’ first possession of the second half. Two screen passes from quarterback Miles Levy set up the Longhorns at the 13-yard line of Battle Mountain. On fourth down, Cameron Firmin ran 13 yards on a reverse for a Basalt touchdown with 6:02 to play in the third quarter. His TD gave Basalt a 12-10 lead. David Flores kicked the conversion for a 13-10 Basalt lead. After an exchange of punts, the Longhorns extended the lead to 20-10 with a 55-yard scoring drive. On fourth down and 2 at the 5-yard line, Levy passed to Raul Torres in the end zone for a BHS touchdown. Flores’ PAT put Basalt ahead 20-10 with 9:40 to play in the game. The Longhorns sealed the victory by controlling the ball for the final 8:15 of the game, preserving the key conference win. Ian Lumsden, who had a 65-yard run earlier in the game, rushed for three key first downs in the closing drive. Basalt improved to 3-1 in the Western Slope North, 4-4 overall. Battle Mountain dropped to 2-2 in conference, 3-4 overall. The Basalt defense shut out the Huskies in the second half. “The kids played so well,” Basalt head coach Carl Frerichs said. “In the first half, we shot ourselves in the foot with turnovers and penalties.” But, he said, they responded in the second half. “The whole offensive line is getting better and better,” he said. “They’re understanding the plays.” He credited hard running from Lumsden and Alex Alberto. “They ran their tails off,” Frerichs said. He said the Basalt defense played extremely well against the Huskies and quick quarterback Demetrius Parrish. “The D line played really well; the linebackers followed their responsibilities,” Frerichs said. “We were solid all night.” He said Alberto led the way at middle linebacker as the Longhorns won on a chilly, damp evening in Basalt. To open the game, Battle Mountain scored first after recovering a Basalt fumble deep in the Longhorns’ territory. The Huskies’ touchdown came on an 16-yard screen pass from Parrish to Zane Hensel with 10:12 to play in the second quarter. Basalt pulled to within 7-6 after taking advantage of good field position. The Longhorns drove to the Battle Mountain 1-yard line but were stopped on a fourth-down play, turning the ball back to the Huskies. But Basalt immediately forced a punt from the end zone, with the Longhorns taking over at the Battle Mountain 34-yard line. The Longhorns drove to a touchdown with the crucial play coming on a 35-yard completion from Levy to Raul Torres. The score came on a 1-yard TD pass from Levy to Kyle Roberts. The Huskies blocked the point-after kick to retain a 7-6 lead with 4:30 to play in the first half. Battle Mountain pushed the lead to 10-6 with a 33-yard field goal by Chase Keep as time ran out in the second quarter. But the halftime lead would vanish with the second-half Basalt comeback and the Longhorns’ defensive stand. Basalt will play at Aspen next Friday night in the final regular-season game. “Like I said last week, we’re excited to keep this going,” the Basalt head coach said. “We want to keep this going.”", "external_links": [], "published": "2015-10-24T08:40:00.000+03:00", "crawled": "2015-10-24T08:11:58.784+03:00", "highlightTitle": ""}