{"organizations": [], "uuid": "706b3384e3e24379e38b137d4d263c5700cb2c71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "http://www.bostonherald.com/sites/default/files/media/2015/09/19/091915Bruinsjm17.jpg", "site_section": "http://bostonherald.com/sports/bruins_nhl", "section_title": "Sports: Bruins &amp; NHL | Boston Herald", "url": "http://bostonherald.com/sports/bruins_nhl/boston_bruins/2015/10/bruins_notebook_brad_marchand_improves_cross_gets_call", "country": "US", "title": "Bruins notebook: Brad Marchand improves, Cross gets call", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "Bruins notebook: Brad Marchand improves, Cross gets call | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "706b3384e3e24379e38b137d4d263c5700cb2c71"}, "author": "Stephen Harris", "url": "http://bostonherald.com/sports/bruins_nhl/boston_bruins/2015/10/bruins_notebook_brad_marchand_improves_cross_gets_call", "ord_in_thread": 0, "title": "Bruins notebook: Brad Marchand improves, Cross gets call", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WILMINGTON — There hasn’t been a lot of good news for the Bruins in the first week of the season, but there was yesterday: Brad Marchand was back on the ice just three days after suffering a concussion.\nFor a change, it appears a Bruins player suffered a concussion that was not too severe.\n“I feel pretty good,” Marchand said after skating and competing fairly hard in the quick practice while wearing a green non-contact jersey. “Now it’s just about trying to get back as fast as I can. You never know. These things are day-to-day. You can feel good for a few days and then take a step back.\n“But I’m happy with how I feel. Hopefully I don’t have any setbacks. Whatever the doctors tell me to do, I’m going to do what they say.”\nThe after-effects of concussions can last as little as a few days or as long as years. It appears Marchand, in contrast to Patrice Bergeron, Marc Savard and Nathan Horton, has one of the least severe sorts. Generally, players with such injuries are held out for about a week or less, if they pass the NHL’s concussion protocol tests.\nAs the Bruins flew west for tonight’s game in Denver against the Avalanche, Marchand went along. The guessing is that he’ll miss this game but return for Saturday’s in Glendale, Ariz., against the Coyotes.\nMarchand was hurt when his head crashed into the elbow of Canadiens winger Dale Weise. The contact looked purely unintentional, and Marchand cleared Weise of any ill-intent.\n“I think he just tried to shoot,” Marchand said. “I knew he was going to shoot. I just tried to get to him before he did. I think he just kind of brought his elbow up. He had no idea I was there.”\nThe Bruins’ 0-3-0 start is their worst since the 1999-2000 team lost its first three games. A loss tonight would give the B’s their first 0-4-0 record since 1964-65. Yet, there is still an optimistic feeling in the locker room, hoping that going on the road and playing simpler and smarter hockey should help get the team on track.\n“There’s no quick fixes in this game,” Marchand said. “We’ve shown good signs in the (three) games. We haven’t won yet, but there’s a lot of good things we can build off. Having (Zdeno Chara) back in the lineup is big. We still have a lot to learn and a lot to build on, but I still believe we’re going to be a good team. Just because of three games, it’s not going to tell our season. We’re not worried. You want to stay composed. This is three games. There’s been a lot worse starts than this, and teams (have gone on to) good seasons.\n“We know we’re not in the best situation right now, but there’s a long season ahead of us. We’ll improve. We do have a lot of young guys and a lot of new guys. The only way for us to go is up.”\nCoach Claude Julien wants to see his team respond better to the adversity that comes in a game.\n“Our starts in all three games were good,” Julien said. “Where we’ve had some trouble through the course of the game (is) instead of bending a little bit — there’s times when the other teams get a little bit of momentum — we’ve broken down and given up goals. You can bend in a game, but you’ve got to be able to get your game back.\n“Like I said, we’ve broken down and we kind of chase the game at times. That’s an area where change has to come. If we do bend along the way, let’s make sure that that’s all it is and we bounce back. It is a mental thing, and we’ve got to overcome that.”\nBruins notes\nDefenseman Joe Morrow was placed on injured reserve (illness), and the Bruins recalled ex-Boston College star Tommy Cross . This will be the first NHL stint for the Simsbury, Conn., native, who was the B’s second-round pick (35th overall) in 2007. Cross, 26, has been a captain in prep school (Westminster), on BC’s 2012 championship team and with Providence this season. . . .\nThe Bruins have surrendered 16 goals in three games while the Avs, who are 1-1-0, have scored 10 goals. The B’s need to play what is known as “a good road game,” marked by tight defense and not trying to put on an offensive show. . . .\nCongrats to East Longmeadow’s Frankie Vatrano , named AHL Player of the Week after scoring five goals in two games for Providence. . . .\nEx-Bruins center Carl Soderberg , who got an exorbitant free agent contract (five years, $4.75 million annual cap hit) from Colorado, has two assists and an average of 16:42 in ice time.", "external_links": [], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-14T07:19:25.805+03:00", "highlightTitle": ""}