{"organizations": [], "uuid": "51914a657e440461f12bd28a1f78414eef6a0e78", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "sports.dailymirror.lk", "main_image": "", "site_section": "http://sports.dailymirror.lk/feed/rss/\r", "section_title": "Mirror Sports", "url": "http://sports.dailymirror.lk/2015/10/19/roma-face-knockout-trip-to-leverkusen/", "country": "", "title": "Roma face ‘knockout’ trip to Leverkusen", "performance_score": 0, "site": "dailymirror.lk", "participants_count": 1, "title_full": "Roma face ‘knockout’ trip to Leverkusen", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T16:09:00.000+03:00", "replies_count": 0, "uuid": "51914a657e440461f12bd28a1f78414eef6a0e78"}, "author": "Shehan", "url": "http://sports.dailymirror.lk/2015/10/19/roma-face-knockout-trip-to-leverkusen/", "ord_in_thread": 0, "title": "Roma face ‘knockout’ trip to Leverkusen", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Roma face ‘knockout’ trip to Leverkusen AFP Published : 6:39 pm October 19,   51 reads | \nRoma stalwart Daniele De Rossi said Tuesday’s Champions League group stage trip to Bayer Leverkusen is like a knockout game for the Italians. \nRoma are bottom of Group E with a single point from two matches ahead of the back-to-back clashes with the Germans. \n“There’s no question, it won’t be easy against Leverkusen because we’re playing away from home and they are a quality side,” said De Rossi. \n“Qualification for the next round of the Champions League is at stake in this match so it will be a kind of mini knockout game.” \nLeverkusen were unlucky to lose 2-1 at the Camp Nou last time out, having led defending champions Barcelona at home after hammering BATE Borisov 4-1 at the BayArena in their opening European match. \nThe Germans are just one point behind leaders Barcelona in the table and eager to claim a win over Roma ahead of the return in the eternal city on November 4. \nBut Roger Schmidt’s Bayer have struggled of late in the Bundesliga and were held to a goalless draw at home to Hamburg on Saturday, their second straight draw to leave them eighth in the table. \n“We created some good opportunities which we didn’t use to turn the game in our favour. The result is okay, we have to live with it,” said head coach Schmidt after the Hamburg draw. \nGermany defender Roberto Hilbert is definitely out with a knee injury, while midfielders Kevin Kampl (illness) and Lars Bender (ankle) face a race to be fit in time. \nLeverkusen’s home record against Serie A teams is four wins, a draw and three defeats. \nRoma warmed up for the trip to Germany with a 3-1 defeat of Empoli on Saturday as Italy veteran Daniele de Rossi marked his 500th appearance for the Rome club with his first goal of the season. \nBut they are still seeking a first win after drawing 1-1 at home with Barcelona and losing 3-2 at BATE in Belarus. \nCoach Rudi Garcia has welcomed Brazilian defender Leandro Castan back for his first home start since May 2014 after a lengthy injury absence. \nGarcia hinted that Edin Dzeko, Maicon and Germany international Antonio Ruediger could all be ready for Tuesday’s game. \n“It’s great to have a player like him (Maicon) available again,” said Garcia. \n“We’ll have Dzeko and Ruediger back with us soon as well. Edin is close to a full recovery and that’s a good thing for the team with Tuesday in mind.” \n“It’s our third league win in a row, now we can focus on the Champions League and we’re going to Leverkusen looking for a win.” \nGarcia’s men lead the league for goals scored so far (20), but they have also conceded 10 in eight games. \nGarcia said: “It’s good that we’re scoring lots but we always concede at least one. I hope we can change that, starting on Tuesday.” \nElsewhere, Azzurri legend Francesco Totti is still out injured and doubtful to even make the squad on Tuesday.", "external_links": [], "published": "2015-10-19T16:09:00.000+03:00", "crawled": "2015-10-19T17:30:56.247+03:00", "highlightTitle": ""}