{"organizations": [], "uuid": "b6cfc4c1b6ca6bcd48e7a57f3f251c19bf07872e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.times-herald.com", "main_image": "http://content.times-herald.com/nthv2/img/fb-promo-def.jpg", "site_section": "http://feeds.times-herald.com/rss/sports", "section_title": "The Times-Herald > Sports", "url": "http://www.times-herald.com/Sports/20151010-east-coweta-langston-hughes-WB-", "country": "US", "title": "Panthers, Green too much for Indians while now alone in 1st", "performance_score": 0, "site": "times-herald.com", "participants_count": 0, "title_full": "Panthers, Green too much for Indians while now alone in 1st", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T06:16:00.000+03:00", "replies_count": 0, "uuid": "b6cfc4c1b6ca6bcd48e7a57f3f251c19bf07872e"}, "author": "", "url": "http://www.times-herald.com/Sports/20151010-east-coweta-langston-hughes-WB-", "ord_in_thread": 0, "title": "Panthers, Green too much for Indians while now alone in 1st", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Panthers, Green too much for Indians while now alone in 1st by \nLangston Hughes junior quarterback Isaiah Green and a young Panthers defense proved Friday that they’re not going anywhere in the Region 3- playoff race despite their overall record. \nNot that East Coweta needed a reminder. \nFor the second consecutive year, Green victimized the Indians, leading Hughes to a pair of third-quarter scores that helped turn a halftime deadlock into a 29-21 win at home that also handed the Indians their first loss of the 2015 season. \nThe Panthers broke a 7-7 tie with 22 unanswered points in the second half, and despite a valiant effort by East Coweta backup quarterback Christian Reid, the outburst was too much to overcome. \nThe win was the third straight by Hughes, all in region play, following a brutal non-region schedule that included matchups against Mays, Grayson and Creekside. Following Friday’s two 3- games involving teams from Coweta County, the Panthers were alone in first place at 3-0. \nEast Coweta, Westlake and Newnan were all tied for second at 2-1 after Westlake’s 41-21 victory over Newnan. \nA year after shining against East Coweta in a 28-10 victory at Garland Shoemake Stadium in Sharpsburg in his first few games as a starter, Green connected on seven of nine pass attempts over a pair of impressive scoring drives in the third quarter. \nThe contest was a contrast of how teams began respective halves. East Coweta fumbled the opening kickoff, and despite recovering, gave the ball back to Hughes’ young defense on an interception by its senior captain, linebacker Jeffrey Allison, on the Indians’ third snap of the game. \nIt took the Panthers three plays to convert from the East Coweta 7-yard line for an early 7-0 lead. \nOn the heels of last week’s 7-0 shutout win over Westlake, the Indians’ defense held strong for the final 22 minutes of the first half, limiting Hughes to just 14 yards rushing by halftime. \nEast Coweta, meanwhile, put together the bulk of its 152 first-half yards on a 10-plus play drive that included Devonte Brown’s successful fake punt. \nBrown eventually carried the Indians down to the goal line off consecutive handoffs before Indians quarterback Will LaGuardia made up for his earlier interception with a 1-yard sneak, tying the game at 7-7 with 3:58 left in the second quarter. \nA fourth-down sack by Dontavious Burks helped squash a Panthers’ drive inside the East Coweta 40 in the second quarter. Despite a missed 37-yard field goal attempt by kicker Wyatt Palmer, the Indians continued to carry momentum into halftime. \nA see-saw battle in the first half, though, quickly went Hughes’ direction directly from the third-quarter kickoff, having deferred after winning the coin flip. Green led the Panthers on a 10-play, 80-yard drive, with the biggest play coming on a fourth-down pass to junior receiver Karim Puckett to the Indians’ 15-yard line. \nIt took just two plays from there, the latter with Green taking it in himself to give Hughes a lead for good. In perhaps a sign of things to come, a botched snap on the PAT was turned into a two-point pass from Rashad Burch to Allison for a 15-7 advantage. \nStops by Allison and freshman Charles Thomas on Hughes’ defense then forced a three-and-out by East Coweta. That set up another scoring march by the Panthers, this time from their own 47-yard line. \nGreen connected on three attempts, the last of which came on a 24-yard scoring strike to Burch to push Hughes’ lead to 22-7 at the end of the third quarter. \nAmidst the third quarter, East Coweta also lost senior linebacker Alec Jimerson, the Indians’ second-leading tackler, to a knee injury that left him on crutches at the game’s end. \nMinus Jimerson, Hughes opened the fourth quarter with a final drive. Green connected with Puckett and Sean Nelson before Whitmore broke into the open for a 31-yard touchdown run and a 29-7 lead. \nReid came on for LaGuardia after East Coweta’s starting quarterback had his helmet knocked off and gave the Indians a late spark. His second rushing attempt of the season went for a 28-yard touchdown with nine minutes to play. \nBattling to the finish, Reid found Justin Crump on a 43-yard catch and run with 48 seconds to play, setting up an onsides kick attempt, but Hughes recovered and ran out the clock. \nPanthers 29, Indians 21 \nEast Coweta 0 7 0 14 — 21 \nL. Hughes 7 0 15 7 — 29 \n1st Quarter \nLH — Demetrius Whitmore 1 run (Fernando Sdelamore kick), 10:21 \n2nd Quarter \nEC — Will LaGuardia 1 run (Wyatt Palmer kick), 3:58 \n3rd Quarter \nLH — Isaiah Green 2 run (Rashad Burch pass to Jeffrey Allison), 8:17 \nLH — Burch 24-yard pass from Green (Sdelamore kick) \n4th Quarter \nLH — Whitmore 31 run (Sdelamore kick), 10:00 \nEC — Christian Reid 28 run (Palmer kick), 8:15 \nEC — Justin Crump 43-yard pass from Reid (Palmer kick), 0:48 More", "external_links": [], "published": "2015-10-10T06:16:00.000+03:00", "crawled": "2015-10-10T23:36:59.781+03:00", "highlightTitle": ""}