{"organizations": [], "uuid": "a5e1bc9168913c5ff95639de4b850493c243c357", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kentucky.com", "main_image": "http://media.kentucky.com/smedia/2015/09/30/00/49/I3Oc.AuSt.79.jpeg", "site_section": "http://www.kentucky.com/281/index.rss", "section_title": "Kentucky.com -- Sports Columnists", "url": "http://www.kentucky.com/2015/10/01/4066496/mark-story-sorry-dickie-v-larry.html", "country": "US", "title": "Mark Story: Sorry, Dickie V., Larry Brown fits rather well among big-time college hoops coaches", "performance_score": 0, "site": "kentucky.com", "participants_count": 0, "title_full": "Mark Story: Sorry, Dickie V., Larry Brown fits rather well among big-time college hoops coaches", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T02:50:00.000+03:00", "replies_count": 0, "uuid": "a5e1bc9168913c5ff95639de4b850493c243c357"}, "author": "", "url": "http://www.kentucky.com/2015/10/01/4066496/mark-story-sorry-dickie-v-larry.html", "ord_in_thread": 0, "title": "Mark Story: Sorry, Dickie V., Larry Brown fits rather well among big-time college hoops coaches", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Larry Brown", "Dickie V."], "text": "Order a reprint of this story \nIn this March 18, 2015 file photo, SMU coach Larry Brown watches his team during practice at the NCAA college basketball tournament in Louisville, Ky. The NCAA banned the SMU mens basketball team from postseason play Tuesday, Sept. 29, 2015, and suspended Brown for nine games after concluding that he lied to investigators, ignored academic fraud and fell far short of expectations in leading his staff when it came to compliance. (AP Photo/David Stephenson) DAVID STEPHENSON — AP \nNow that Larry Brown has hit the hat trick of scandal — presiding over an NCAA punishment at SMU after previously leading UCLA and Kansas onto probation — the ensuing uproar directed at him has been kind of refreshing. \nDick Vitale, seemingly every college coach's best friend, wants Brown barred from working in college hoops. \nIn light of the fact that Naismith Memorial Basketball Hall of Fame members Brown and Jim Boeheim will each serve NCAA-mandated, nine-game suspensions this winter, USA Today and CBSSports.com writers are asking if the Hall should no longer admit active college coaches. \nTo which, I have two thoughts. \n1.) In our cynical time, who knew people could still work up some old-fashioned, moral outrage about college sports cheating? \n2.) Anyone saying that Larry Brown somehow \"doesn't fit\" as a college basketball coach is in denial about the real nature of big-time hoops coaching. \nThere are six current men's college head men — Boeheim, Brown, John Calipari, Mike Krzyzewski, Rick Pitino and Roy Williams — who have been enshrined in the Naismith Basketball Hall of Fame as coaches (new St. John's head man Chris Mullin is in as a player). \nOf those six, Brown and Boeheim (two) have presided over multiple NCAA probations, and Calipari vacated Final Fours at two different schools. The NCAA implicated Pitino in eight violations as a (very young) Hawaii assistant. \nKansas was hit for a probation in 2006 over \"impermissible inducements and benefits\" provided by \"athletics interests\" that occurred on Williams' watch. According to The Raleigh News & Observer, Williams' North Carolina players were enrolled in 117 \"sham courses\" during the allegedly long-running academic scandal at that school. \nEven Duke and Krzyzewski, whose NCAA record is clear, have had \"smoke\" around their program in the form of Corey Maggette/Myron Piggie and Lance Thomas and his jewelry purchase. \nIf I counted right, there are 19 Division I men's college hoops coaches in the Basketball Hall of Fame who were active as recently as 1990. Of those 19, 11 presided over programs that were punished by the NCAA at some time in their tenures. \n(That doesn't take into account a couple of the post-1990 Hall of Famers — looking at you Bobby Knight and John Chaney — whose programs were not punished for cheating but who each had substantial anger management problems that led to embarrassing comportment issues. I would argue those bullying incidents were worse than many cheating scandals). \nWhat all this says about big-time college basketball and the men who thrive coaching it is, what, exactly? \nA.) They are victimized because the NCAA \"amateurism\" rules that govern their sport are completely unrealistic; \nB.) It is impossible to get the kind of players it takes to win at the highest level and keep \"clean hands;\" \nC.) College presidents tend to talk a big game of educational perspective but incentivize winning at all costs with their hiring and firing decisions; \nD.) We in the sports media tend to write/talk a big game of \"doing things the right way\" but incentivize winning at all costs with how we write/talk about coaches who won't cheat to win and then don't win (enough). \nE.) The ticket-buying public gets no emotional gratification from losing even when it's done with honor, but gets total satisfaction from winning regardless of how it is done; \nF.) To varying degrees, all of the above. \nThe correct answer is \"F.\" \nAs for the immediate Larry Brown issues, he left others to clean up his messes at UCLA and Kansas. So rather than Brown being forced out at SMU, he ought to have to stay and help the school ride out its punishment. \nMeanwhile, there is no point in changing Hall of Fame eligibility to eliminate active coaches. \nJerry Tarkanian presided over four NCAA probations at three schools. When the Hall enshrined \"Tark the Shark\" in 2013, it sent the signal it was going to evaluate college coaches on hoops accomplishments alone. \nThat's the only way to do it, really. \nIf you are going to disqualify men's big-time college coaches who are tainted by off-the-court problems, there will essentially be no men's big-time college coaches in the Basketball Hall of Fame. Mark Story: (859) 231-3230. Email: mstory@herald-leader.com. Twitter: @markcstory. Blog: markstory.bloginky.com.", "external_links": [], "published": "2015-10-02T02:50:00.000+03:00", "crawled": "2015-10-02T17:10:52.054+03:00", "highlightTitle": ""}