{"organizations": [], "uuid": "fe9b09cbd14e3c70d509c34b3dcb048f6e2ab9af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/302914891133a882cd5fe448a3778bc9.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/football/if-messi-and-ronaldo-are-the-top-two-who-is-the-worlds-thi/6911554/", "country": "JE", "title": "If Messi and Ronaldo are the top two, who is the world's third best player; Hazard, Suarez, Bale?", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "If Messi and Ronaldo are the top two, who is the world's third best player; Hazard, Suarez, Bale?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T12:28:00.000+03:00", "replies_count": 0, "uuid": "fe9b09cbd14e3c70d509c34b3dcb048f6e2ab9af"}, "author": "", "url": "http://www.sport.co.uk/football/if-messi-and-ronaldo-are-the-top-two-who-is-the-worlds-thi/6911554/", "ord_in_thread": 0, "title": "If Messi and Ronaldo are the top two, who is the world's third best player; Hazard, Suarez, Bale?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ronaldo", "Suarez", "Charlie Firth", "Messi"], "text": "If Messi and Ronaldo are the top two, who is the world's third best player; Hazard, Suarez, Bale? By Charlie Firth (columnist) 09 Oct 2015 09:28:57 \nreads \ncomments \nMany think that the most heated debate in football comes from the top, the question being as follows: Who is better, Lionel Messi or Cristiano Ronaldo? \nAdmittedly, it’s a tough argument, one of which anyone who’s ever watched the two has an opinion on. But I’m not convinced that this is the hardest question in football at the moment. \nFor me, the hardest question in football is: Who is the third best player in the world? \nI’ll be flicking through nine players I think are worthy of taking the accolade, those who aren’t quite up there with Messi and Ronaldo, but are still a player to be feared. \nLuis Suarez \nThe former Liverpool man commanded a £75 million fee last year and frankly it’s no wonder as to why. Plenty out there believe we won’t see a player of his quality playing in the Premier league for some time, and I’d agree, certainly Fantasy Football is a hell of a lot harder without him. \nSuarez has a crazy toolbox of skills to utilise, and on top of that he scores goals. Goals, goals, goals. In a career spanning over 12 seasons, Suarez has managed an outstanding 251 goals in 417 career appearances, with a further 43 strikers for his international side Uruguay. \nIn terms of comparing him to Messi and Ronaldo, the 28-year-old could be construed as some sort of hybrid between the two, scoring the incredible amount that Cristiano does while seeming to have the same mystifying effect that Messi does upon the audiences of world football. \nManuel Neuer \nThe globes third choice in the Ballon D’or last year, and though he certainly hasn’t had the same season as he did last term, he’s still one magnificent keeper. \nThough many commend Neuer’s incredible shot stopping ability, I personally reckon he’s one of the best players in the world just because he’s completely reinvented his position, something that I doubt many players can say for themselves, even Messi and Ronaldo. \nThe 29-year-old has basically added another dimension to goalkeeping, adding the role of a ‘Sweeper Keeper.’ It’s something that involves nerves of steel, a real knack of quick decision making, as well as pace and tackling ability. Purely based on this, Neuer is up there with the best ever. \nEden Hazard \nOoo… Controversy. Does Hazard even deserve to be on this shortlist? I think it would be harsh not to give him a mention. The Premier League player of the season last year has wowed English fans for a couple of years now, and his magic feet are something to be feared. \nThe Belgian’s goalscoring progression across the seasons is actually quite fascinating. At Lille and Chelsea respectively, he scores more and more each season, although you wonder if his growth will be stunted this year, after a horrible start to the season for both him and his club. \nComparing him to the two greats, despite playing Ronaldo’s position he’s definitely more of a Messi than a Ronaldo, he has that same jaw dropping, magic ability that Messi does. Unfortunately for Eden, he doesn’t come near to some of the other players on this list in quality, let alone Messi and Ronaldo… Yet. \nZlatan Ibrahimovic \nI’m definitely not the Swede’s biggest fan, but he is one hell of a striker. His portfolio of former clubs is something to see, he’s had an incredible career, as well as entertaining football fans with his – sometimes – childish antics and sense of self admiration. \nA similar goals to game ratio as Luis Suarez, Zlatan has scored 344 goals in 625 appearances, going with 57 for Sweden on the international stage. Ibrahimovic might even be the player to play for the most successful clubs in the world, although he’s never played in England. \nWhere is he among Messi and Ronaldo? Certainly a Ronaldo. The cocky, goalscoring brute who puts himself first, but in a way that benefits the team, most of the time. Though Ibra will live long in the memory, I don’t think he’s up there. \nSergio Aguero \nGiven the bloated fees payed for some strikers these days, £38 million for Sergio Aguero seems like a masterstroke move from Manchester City. A player you just can’t hate, the little Argentine could be considered as the Messi of the Premier League, boasting similar attributes to the other little Argentine. \nThe 27-year-old, like all the other forwards on this list, has a brilliant goal rate, particularly at Manchester City, where he has a phenomenal 115 goals in 175 games. His five against Newcastle last weekend reminded us all of just how good this guy is. \nAnd on top of that, he just seems like a nice bloke. Humble and talented, two things that go together very nicely, and Aguero is both. He could certainly be the third best player in the world, and in my opinion is the best player in England. \nRobert Lewandowski \nBlowing minds – that seems to be Robert Lewandowski’s new occupation. It must be sickening for all the other enormous clubs around the world to think he joined Bayern Munich for free, especially rivals Borussia Dortmund. \nThe Polish centre forward will be thankful a volcano killed his move to Blackburn Rovers, and glad that he joined Borussia Dortmund, where he went from strength to strength, with 74 goals in 131 games for the German side. \nNow, a 10 minute rout against Wolfsburg in which he scored five goals has inspired him into a mind blowing vain of form, seeing him become Europe’s top scorer. I don’t think there’s any doubt that Lewandowski is one of the best players in the world, and in terms of top strikers, it’s such a close call between himself, Aguero and Suarez. \nGareth Bale \nJust what on Earth has happened to Gareth Bale? The Welsh Wizard has disappeared into obscurity over the last couple of months, and was so bad towards the end of last season that Real Madrid fans even went and vandalised his car. \nHowever, the world most expensive player must deserve some place on this shortlist? \nI love Gareth Bale. Although I’m not at all keen on the haircut he seems to have these days, I think the way he plays his football is wonderful. He lit up the Premier League with Tottenham, and I’d just love to see him recapture that form once more in Spain. \nIs he the third best player in the world? I’m not too sure. But he certainly can be, he’s just a bit out of touch at the moment, it happens to everyone. \nNeymar \nIt’s hard to put Neymar on a scale of the best players in the world. The Brazilian wonderkid's talents are hard to miss, but he does have the tendency to go not show up in games. \nBut there’s no denying he’s an excellent player. He has all the attributes to become a top winger; pace, skill, man beat-ability and a sweet strike. He could be the man to replace Messi, for a while, whilst he sits on the sidelines. \nOn a scale from Ronaldo to Messi, he’s probably more of a Messi. As said before, his skills and agility are similar to what Messi has, and in my opinion he has the ability to replace Messi as the best player in the world, when he’s older. \nThomas Muller \nOriginally I wasn’t going to give Muller a place on this list, but I just can’t. The German forward is an outstanding football player, and is one of my favourite players in world football. I think he’s excellent. \nEight in eight in the Bundesliga at the moment, and a player who can play all across the front line. His international escapades only point him in one direction: to one day overtake Miroslav Klose as the all time World Cup top scorer. \nIn terms of comparison to Messi and Ronaldo, he can’t really be compared to either of them, he’s not massively like either of them. The 26-year-old is a fine, fine player with a magnificent striker, and magnificent ability. He could easily fit as the third best player in the world. \nSo, take your pick. Who do you reckon is the best player in the world, after Lionel Messi and Cristiano Ronaldo. In my opinion, it’s Luis Suarez. I think he’s an outstanding footballer, who could fit into any team in the world, but it really could be anyone. Here’s some honourable mentions. \nArjen Robben", "external_links": [], "published": "2015-10-09T12:28:00.000+03:00", "crawled": "2015-10-09T19:51:51.520+03:00", "highlightTitle": ""}