{"organizations": [], "uuid": "d9e7ebd2b6f1f17d671cad5fe7828b40818fbbd3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.commercialappeal.com", "main_image": "http://media.jrn.com/images/774823.jpg", "site_section": "http://www.commercialappeal.com/sports/index.rss", "section_title": "Sports", "url": "http://www.commercialappeal.com/sports/small-crowd-more-interaction-at-newly-formatted-memphis-madness-fanfest-228c6958-95ff-5f4f-e053-0100-336708161.html", "country": "US", "title": "Small crowd, more interaction at newly formatted Memphis Madness FanFest", "performance_score": 0, "site": "commercialappeal.com", "participants_count": 9, "title_full": "Small crowd, more interaction at newly formatted Memphis Madness FanFest", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T02:11:00.000+02:00", "replies_count": 10, "uuid": "d9e7ebd2b6f1f17d671cad5fe7828b40818fbbd3"}, "author": "Jason Smith", "url": "http://www.commercialappeal.com/sports/small-crowd-more-interaction-at-newly-formatted-memphis-madness-fanfest-228c6958-95ff-5f4f-e053-0100-336708161.html", "ord_in_thread": 0, "title": "Small crowd, more interaction at newly formatted Memphis Madness FanFest", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Just a year ago University of Memphis freshmen K.J. and Dedric Lawson were part of an A-list group of recruits sitting courtside at FedExForum as rapper Rick Ross capped another highly attended Memphis Madness with a 30-minute concert that rocked the building.\nOn a rainy Saturday afternoon, with no performer and no star-studded list of recruits in the building, a newly formatted Memphis Madness FanFest event intended to provide more personal interaction between fans and Tigers players drew less than 500 people.\nYet the players seemed genuinely appreciative of those who did show up to meet and support them Saturday despite the uncertainty surrounding this year's team — which has 10 new faces, including eight freshmen — and with the fan base still soaring over the football team's 14th straight win Friday night in Tulsa.\n\"It was not usual (or) what we're used to, but it was a great event,\" K.J. Lawson said. \"A lot of people came out that's really (behind) the team. I thought it was really genuine. You had a lot of family, a lot of friends, a lot of people that's going to be in your corner the whole year, even when things go bad.\n\"I appreciate anybody that came out because I'm grateful for that, because nobody had to show up. You see the real fans that are out here and we're going to see the fans that are just fair-weather. You know who they are.\"\nCoach Josh Pastner said he expected a lower turnout Saturday than previous Madness events because the U of M didn't hire a performer this year and didn't promote the event as heavily as in years past. Madness had primarily become a recruiting tool for Memphis, with the event no longer marking the official start of practice. But the Tigers have had most of their high-level 2016 recruiting targets on campus already for official visits.\n\"I was fine just saying, 'Hey, let's not even have it,' but we knew we needed to do something for the fans,\" Pastner said. \"So I felt this was a good compromise that allowed little kids to come on the floor and fans to come and intermingle with their team and shoot baskets on the floor.\"\nAsked if he thought the low turnout reflected a drop-off in enthusiasm about the program, which is coming off an 18-14 season and saw its best player from last season, Austin Nichols, transfer to Virginia in July, Pastner said: \"Anywhere I go, everyone is so interested and excited for the season. Now, maybe they want to see how we do with the change of personnel; how we play.\n\"So I think there's as much as excitement and there's gonna be as many eyes locked in on us as maybe there's ever been because maybe there's gonna be a lot of unanswered questions and a lot of new personnel. Maybe there's a few people out there that don't want us to do well, and they're going to be watching hoping we don't do well. But I think the masses want us to do well and they're going to be excited about their team.\"\nAs for the fans who came, which included Memphis mayor-elect Jim Strickland and his family, they were encouraged to walk on the Tigers' home court and interact and mingle with the players. The players signed autographs and shot baskets with the fans as well.\nLongtime Memphis supporter Verlinda Henning said she was glad she came.\n\"The people that are here are getting an opportunity to build rapport with the players. We have a lot of new players on the team this year, and it's a way to get to know them and connect with the team and be ready to cheer when the season tips off,\" Henning said.\nMemphis will return to FedExForum on Nov. 6 for its lone exhibition game of the preseason against LeMoyne-Owen before tipping off the regular season Nov. 14 against Southern Miss at FedExForum.\n\"I just think this year we're gonna surprise a lot of people because people are not expecting us to do the best,\" sophomore guard Markel Crawford said. \"A couple people (transferred). Not the biggest team. Not the biggest names. But I just think when people see us play, they're gonna see how hard we go for that name across our jersey. It's going to be a big year for us.\"", "external_links": [], "published": "2015-10-25T02:11:00.000+02:00", "crawled": "2015-10-25T09:40:25.494+02:00", "highlightTitle": ""}