{"organizations": [], "uuid": "0ecb0ba9aefafa21782323909cea769414e4d802", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/92cf05e9ed0cd033ac24f446a8daa18a.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/rugby/cian-healy-ireland-to-chase-world-cup-glory-for-injured-cap/6925427/", "country": "JE", "title": "Cian Healy: Ireland to chase World Cup glory for injured captain Paul O'Connell", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "Cian Healy: Ireland to chase World Cup glory for injured captain Paul O'Connell", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T23:31:00.000+03:00", "replies_count": 0, "uuid": "0ecb0ba9aefafa21782323909cea769414e4d802"}, "author": "", "url": "http://www.sport.co.uk/rugby/cian-healy-ireland-to-chase-world-cup-glory-for-injured-cap/6925427/", "ord_in_thread": 0, "title": "Cian Healy: Ireland to chase World Cup glory for injured captain Paul O'Connell", "locations": ["Ireland"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Paul O'Connell Cian Healy", "Cian Healy", "Paul O'Connell"], "text": "Cian Healy: Ireland to chase World Cup glory for injured captain Paul O'Connell 11 Oct 2015 20:31:56 \ncomments \nCian Healy has admitted Ireland will chase World Cup glory to honour captain Paul O'Connell's glittering Test career. \nSkipper O'Connell's Ireland career is almost certainly at an end after his serious hamstring injury midway through the superlative 24-9 World Cup victory over France. \nO'Connell banged the turf in anguish and anger as his team-mates left the Millennium Stadium field for the half-time interval, eventually carried from the turf by stretcher. \nIreland prop Healy hailed the talismanic 35-year-old's influence on Joe Schmidt's squad, before vowing to do him justice if O'Connell is ruled out of the rest of the tournament. \n\"Hopefully Paul will be alright, but you get dealt those hands sometimes,\" said Healy, after Ireland secured a quarter-final against Argentina. \n\"Being the fella he is and seeing how hard he's worked, that would be the case, you dig in and you'd want to put on a show for him. \n\"Hopefully he'll be okay, but if not then that will definitely give us extra motivation.\" \nMunster stalwart O'Connell's Test career appears at an end after 108 caps then, but Ireland could also be shorn of Johnny Sexton, Peter O'Mahony and Sean O'Brien against the Pumas. \nHead coach Schmidt's men will now face Argentina in Cardiff on Sunday, eyeing their first-ever World Cup semi-final. \nSexton is battling groin trouble, while O'Mahony has knee ligament damage - and O'Brien could face a citing for an alleged first-minute punch to France lock Pascal Pape's ribs. \nIreland rallied remarkably to see off France without a host of their most influential players, and Healy backed Schmidt's men to continue that trend. \n\"When you're playing with the likes of Paul (O'Connell) and Johnny (Sexton) they don't give you an option, you have to know your plays inside-out,\" said Healy. \n\"Thankfully we were able to keep it going once they went off. \n\"Our squad is strong and everyone knows what they are doing, so any guys who come into the side can keep that going. It was clear to see that Paul was frustrated, so we'll just have to wait to see how he is.\" \nScrum-half Conor Murray hailed Ian Madigan's calming influence in replacing Sexton, who trudged out after just 25 minutes. \nMadigan has just five Test starts for Ireland, but Murray believes the Leinster playmaker showed the world every inch of his class. \nThe 26-year-old would play a pivotal role against Argentina should Sexton lose his fitness battle after his groin strain. \n\"It was a huge performance from Ian Madigan,\" said Murray. \" I said to him afterwards - it was a massive test and challenge for him, and he passed it with flying colours. \n\"Straight away he came on and kicked a penalty and I think that might have settled his nerves. \n\"Losing someone like Johnny is huge for the team, and I think Mads probably felt an extra bit of pressure on him coming on. And I think he delivered in spades. \n\"Not only his own performance but he just had a bit of composure about him when he came on. \n\"He understands the gameplan very well, he knows exactly what we want to do, and he just carried that confidence throughout the team and he just put people at ease when things were tight. \n\"He knew what we wanted to do and we were just constantly chatting on the pitch. \n\"I've known Ian for a long time and I've always known how good he is. \n\"So it's no surprise to me, but I think it's great for everyone to see what he's capable of.\" Related Sport News", "external_links": [], "published": "2015-10-11T23:31:00.000+03:00", "crawled": "2015-10-12T20:02:03.429+03:00", "highlightTitle": ""}