{"organizations": [], "uuid": "e6a8006e0802fb6f75c6a142617b84ec4135b0fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/2/8/161432/World/Region/Draft-Arab-UNESCO-resolution-on-AlAqsa-compound-dr.aspx", "country": "EG", "title": "Draft Arab UNESCO resolution on Al-Aqsa compound draws Israel ire - Region - World", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Draft Arab UNESCO resolution on Al-Aqsa compound draws Israel ire - Region - World - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "e6a8006e0802fb6f75c6a142617b84ec4135b0fb"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/2/8/161432/World/Region/Draft-Arab-UNESCO-resolution-on-AlAqsa-compound-dr.aspx", "ord_in_thread": 0, "title": "Draft Arab UNESCO resolution on Al-Aqsa compound draws Israel ire - Region - World", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Israeli fire kills Palestinian in Gaza border clashes: Medics 47 Palestinians killed by Israel in October, 1,850 injured: Health ministry Ban in surprise visit to Israel, occupied Palestinian territories Kerry calls for end to Israeli-Palestinian violence A group of Arab states has angered Israel by submitting a draft resolution to the UN cultural body stating that Jerusalem's Western Wall is an \"integral part\" of the Al-Aqsa mosque compound.\nThe flashpoint compound, which is considered sacred to Islam, is located in the southeastern corner of the Old City in Israeli-occupied east Jerusalem.\nMuslims call it Al-Haram al-Sharif (the Noble Sanctuary).\nIn the draft text seen by AFP on Tuesday, Algeria, Egypt, Kuwait, Morocco, Tunisia and the United Arab Emirates condemn Israeli actions at the compound, including restricting access to Muslim worshippers during Eid celebrations last month over security fears.\nIt also states that \"the Buraq Plaza (the name given to the square in front of the Western Wall) is an integral part of the Al Aqsa Mosque/Al Haram Al-Sharif.\"\nThe draft will be put to a vote on Wednesday or Thursday within UNESCO's 58-member executive board.\nIsrael denounced the statement as \"a clear endeavour to distort history\" and appropriate the site.\n\"The Temple Mount and the Western Wall in the heart of Jerusalem lie at the foundation of Jewish history. These are incontrovertible facts of history,\" said Deputy Foreign Minister Tzipi Hotovely.\nUNESCO chief Irina Bokova on Tuesday expressed concern over the matter.\n\"She deplores the recent proposals under discussion by the UNESCO executive board that could be seen to alter the status of the Old City of Jerusalem and its walls, inscribed on UNESCO's World Heritage list, and that could further incite tensions,\" the UN body said in a statement.\n\"The director-general appeals to the UNESCO executive board to take decisions that do not further inflame tensions on the ground and that encourage respect for the sanctity of the holy sites.\"\nThe Al-Aqsa compound is a 14-hectare (35-acre) rectangular esplanade at the southeast corner of the Old City which was seized by Israel during the 1967 Six-Day War and later occupied in a move never internationally recognised.\nIsrael considers all of Jerusalem as its undivided capital, but the Palestinians want the eastern sector as capital of their future state.\nBelieved to be where the Prophet Mohammed made his night journey to heaven, it is the third-holiest site in Islam after the Grand Mosque in Mecca and the Prophet's Mosque in Medina, both in Saudi Arabia.\nJews are allowed to enter the compound itself, but are forbidden from praying there for fear of triggering tensions with Muslim worshippers.\nThe current wave of protests and repression started in late July when 18-month old toddler Ali Dawabsha was burned to death and three other Palestinians severely injured after their house in the occupied West Bank was set on fire by Israeli settlers.\nThe parents of the toddler, Riham and Saad, and their other son Ahmad later lost their lives after suffering serious injuries in the arson attack.\nPalestinians have been protesting repeated Israeli and illegal Jewish settler attacks on Al-Aqsa mosque and closing the Muslim holy site on a number of occasions to worshippers.\n*This story was edited by Ahram Online.", "external_links": [], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-20T23:28:40.361+03:00", "highlightTitle": ""}