{"organizations": [], "uuid": "e72968775fc53fe7d44ded62ff0eb9ad285a302e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.upi.com", "main_image": "http://cdnph.upi.com/sv/ph/og/upi/4321444465871/2015/1/8e1fca6f8f7b9a076f6d5d3c33045c0c/v2.1/Chicago-Blackhawks-edge-New-York-Islanders-in-Barclays-Center-opener.jpg", "site_section": "http://rss.upi.com/news/sports_news.rss#", "section_title": "Sports News - UPI.com", "url": "http://www.upi.com/Sports_News/2015/10/10/Chicago-Blackhawks-edge-New-York-Islanders-in-Barclays-Center-opener/4321444465871/", "country": "US", "title": "Blackhawks edge Islanders, open at Barclays Center", "performance_score": 0, "site": "upi.com", "participants_count": 1, "title_full": "Blackhawks edge Islanders, open at Barclays Center - UPI.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T07:33:00.000+03:00", "replies_count": 0, "uuid": "e72968775fc53fe7d44ded62ff0eb9ad285a302e"}, "author": "upi.com", "url": "http://www.upi.com/Sports_News/2015/10/10/Chicago-Blackhawks-edge-New-York-Islanders-in-Barclays-Center-opener/4321444465871/", "ord_in_thread": 0, "title": "Blackhawks edge Islanders, open at Barclays Center", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "| License Photo NEW YORK -- The Chicago Blackhawks had a milestone home opener ruined Wednesday night by the New York Rangers. Two nights later, the Blackhawks went to New York and returned the favor -- albeit against a different opponent and in a borough the NHL had never visited before.\nRight winger Patrick Kane scored twice, including a power play goal with 3:11 left in overtime Friday night that allowed the defending Stanley Cup champion Blackhawks to spoil the New York Islanders' opener with a 3-2 win in the first regular-season game at the Barclays Center.\nThe Blackhawks went on a man advantage when Islanders defenseman Nick Leddy was whistled for slashing 1:25 into overtime. Seconds later, Kane, who also scored in the second period, passed into the crease to center Jonathan Toews , who was initially credited with the goal when the puck skipped past Islanders goalie Thomas Greiss.\nBut the goal was given to Kane after it was determined the puck never touched Toews.\n\"I thought Jonny had position and it was kind of a set play to try and throw it to him,\" Kane said. \"It's something we tried a lot last year with 'Sharpie' (former Blackhawks left winger Patrick Sharp ) and it worked pretty successfully.\nThere's been a few times like that where I've tried to pass it across and it hits a stick or something and ends up going in the net. So it's really not a bad play.\"\nThe Blackhawks, who raised the 2015 Stanley Cup banner before Wednesday's 3-2 loss to the New York Rangers, evened their record at 1-1.\n\"It was the biggest goal coming into tonight's game: Get the first win of the season,\" Kane said.\nThe goal by Kane disappointed most of the announced sellout crowd of 15,795 that turned out to see the Islanders' first game since they left Long Island's Nassau Coliseum, where the franchise spent its first 42 seasons.\n\"Thought it was a good crowd,\" Kane said. \"They're obviously pretty excited for their team coming into a new building and having the first game here in Brooklyn. Seemed like they were pretty loud and into it.\"\nWhile there were several pockets of empty sets, those who took the train into Brooklyn were energized, particularly at the start and finish.\nThe Islanders paid homage to their past while acknowledging their new era during a stirring pregame ceremony. After a brief video that began with an aerial view of Nassau Coliseum and ended with Islanders logos and championship banners adorning Brooklyn landmarks, Coldplay's \"Fix You\" -- which was the Islanders' entrance song last season -- began playing.\nIslanders center and captain John Tavares led the Islanders to center ice, where players gathered around the team logo and raised their sticks, just as they did before the Coliseum's final opening night on Oct. 11, 2014.\nAfterward, a moment of silence was held in honor of Al Arbour, who coached the Islanders to their four straight Stanley Cups in the early 1980s and died in August.\nLong Islander Alexa Ray Joel, whose father Billy closed out Nassau Coliseum with a concert Aug. 4, performed the national anthem. The ceremonial first puck drop was then held with dynasty members Mike Bossy, Bobby Nystrom, Billy Smith and Bryan Trottier joining several politicians as well as Islanders owner Charles Wang , ownership partners Jon Ledecky and Scott Malkin at center ice.\nLedecky and Malkin will take over majority ownership next season.\nThe Blackhawks scored the first goal in the new building when a turnover by Islanders center Brock Nelson led directly to center Artem Anisimov's unassisted short-handed goal with 6:32 left in the first period.\n\"That was a big goal for us, first penalty we had to kill all year,\" Blackhawks coach Joel Queeneville said. \"Score short-handed goals on the road, you usually have a good night. And it turned out to be a big factor in the game.\"\nTavares, appropriately enough, tied the score with the Islanders' first Brooklyn goal 5:22 into the second period.\n\"I thought about that when he scored, probably just like everybody else -- your captain, your best player, first game here and he (scores) the first one,\" Islanders coach Jack Capuano said.\nKane gave the Blackhawks the lead with 4:49 remaining in the second period before Islanders defenseman Marek Zidlicky tied it 1:18 into the third.\nNew York peppered Chicago goalie Corey Crawford (33 saves) in the final minutes of regulation, but Tavares was wide left with a little more than three minutes left and Crawford turned back two shots by right winger Kyle Okposo in the final 30 seconds.\n\"It comes down to a short-handed goal (and) a power play goal,\" Capuano said. \"We gave up one goal even strength. We'll take that on most nights.\"\nGreiss made 32 saves in his debut for the Islanders, who fell to 11-21-10-1 all time in season openers.\nNOTES: The game was the second played under the NHL's new three-on-three overtime rules. The Tampa Bay Lightning beat the Philadelphia Flyers 3-2 on Thursday. ... The Islanders and Blackhawks complete a home-and-home in Chicago on Saturday. ... The Islanders scratched G Jaroslav Halak (upper body), RW Steve Bernier and D Ryan Pulock. ... G Thomas Greiss became the seventh different opening-night goalie for the Islanders in the last eight seasons. The only goalie to start multiple openers for the Islanders since 2008 is Evgeni Nabokov . ... The Islanders' first game at Barclays came two days after the 43rd anniversary of the franchise's debut, a 3-2 loss to the Atlanta Flames at Nassau Coliseum. ... The Blackhawks scratched RW Kyle Baun and D David Rundblad. ... Blackhawks RW Viktor Tikhonov played in his first NHL game since April 11, 2009. Tikhonov subsequently spent two seasons in the AHL and four seasons in his native Russia.\n  Chicago 3, Buffalo 0 N.Y. Islanders to move to Barclays Center NHL unveils 2015-16 schedule NHL: Chicago 5, New York Islanders 4 (SO)", "external_links": [], "published": "2015-10-10T07:33:00.000+03:00", "crawled": "2015-10-10T11:43:22.226+03:00", "highlightTitle": ""}