{"organizations": [], "uuid": "9189ce8e706d3199895affa1ae3c4514ab0f0a97", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/2/8/152559/World/Region/Limited-options-for-West-after-Russia-escalation-i.aspx", "country": "EG", "title": "Limited options for West after Russia escalation in Syria - Region - World", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Limited options for West after Russia escalation in Syria - Region - World - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "9189ce8e706d3199895affa1ae3c4514ab0f0a97"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/2/8/152559/World/Region/Limited-options-for-West-after-Russia-escalation-i.aspx", "ord_in_thread": 0, "title": "Limited options for West after Russia escalation in Syria - Region - World", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related US, Russia to hold new Syria air safety talks: Pentagon US, Russia urged to cooperate to help Syria conflict Russia will soon suffer 'casualties' after Syria intervention: US defence secretary Russia raids have weakened armed groups, helped army: Syria general Blind-sided by Russia's sudden escalation in Syria, Western powers must abandon hopes of toppling the regime and instead make do with steering Moscow away from actions that deepen the conflict, analysts say.\nThe strategy of the United States and its allies looked uncertain long before Russian President Vladimir Putin decided to dramatically increase his military involvement in Syria in recent weeks.\nThe West's strategic shortcomings were demonstrated by the disastrous $500-million (440-million-euro) US programme to train and arm moderate rebels, which generated only a handful of fighters, many of whom surrendered or were captured almost immediately. The scheme was finally scrapped on Friday.\nThe confusion has looked all the greater since the start of Russia's far more clear-eyed engagement in support of its old ally, President Bashar al-Assad.\n\"The Russian mission is tight and focused around the aim of preserving Assad while the West has had a muddled approach, trying to remove Assad, prevent the rise of extremists and preserve state institutions at the same time,\" said Julien Barnes-Dacey, Middle East fellow at the European Council on Foreign Relations.\nRussia has flexed its muscles with repeated air strikes and the launching this week of 26 cruise missiles from the Caspian Sea.\n\"The Russians have shown a naval capacity that was not expected,\" said Thomas Gomart, head of the French Institute for Foreign Relations.\n\"They are in the process of creating a bubble over Syria and challenging the West's aerial supremacy.\"\nThe message goes beyond the immediate concerns of the Syrian conflict, he said.\nSince the Gulf War in 1991, the West has prioritised control of the skies -- a fact that Russia is trying to challenge.\nRussia's moves have severely limited the West's options about what to do next in the war-torn country.\nWith Russia's planes in Syrian airspace and its advisors surrounding Assad, any remaining Western hopes of toppling his regime are effectively over for the time being.\n\"There's no desire in the West to go to war with Russia over Syria, and there is a legitimate fear that counter-escalation will only lead to more violence, state breakdown, extremism and refugees,\" Barnes-Dacey said.\n\"There is no win to be had from making things more difficult for the Russians, when Europe will pay the cost as well.\"\nAt the same time, many are worried that Russia's dramatic intervention will boost the strength of ISIS group by fuelling militant recruitment and decimating other rebel groups that compete with it for dominance.\nThe West's primary task, then, could be to steer Moscow towards a more constructive involvement in the conflict.\n\"The West must convince the Russians of the complexity of the crisis, the risks of their moves,\" said Camille Grand, head of the Strategic Research Foundation in Paris.\nShe counts herself among the analysts who feel Putin has bitten off more than he can chew in Syria, and may soon realise that the best move is to rein in Assad's excesses and make an accommodation with the West.\n\"The long-shot hope is that having secured Assad's position and recognising that total victory is impossible, Moscow will put pressure on the regime to end its barrel bombing of civilians and open up a governance and humanitarian space in outlying areas that can act as an alternative to the militant groups,\" said Barnes-Dacey.\nAnother scenario is that the different powers end up dividing Syria between themselves, with Russia responsible for Assad's \"core Syria\", while Western countries focus on disrupting ISIS group in outlying areas.\n\"Russia has shown no meaningful desire to take on ISIS and the West will feel compelled to continue its military action against the group, which in many circles is still seen as the main threat to the wider region and world,\" said Barnes-Dacey.\n\"In a sense Moscow's action may end up clarifying the de facto soft partition of the country that had already been emerging,\" he added.\nWith no obvious solution in sight, the West may have to resort to the international grouping that helped seal the deal over Iran's nuclear programme, said Eugene Rumer, head of the Russia and Eurasia Program at Carnegie.\n\"The P5+1 -- the US, Russia, France, Great Britain, China, all UN Security Council permanent members joined by Germany -- is a unique forum where the key parties can come together to seek a way to solve the Syrian crisis.\n\"For the US, the P5+1 format would bring some advantages as well as a measure of compromise. It would insulate the US from the charge of unilateralism and create a real coalition to deal with the crisis whose legitimacy under the UN umbrella would be unassailable.\"", "external_links": [], "published": "2015-10-10T03:00:00.000+03:00", "crawled": "2015-10-10T15:08:33.174+03:00", "highlightTitle": ""}