{"organizations": [], "uuid": "4bdb642f76cb35db493e689fc6fe85fa2c4ed38e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fox8live.com", "main_image": "http://WVUE.images.worldnow.com/images/8938040_G.jpg", "site_section": "http://www.fox8live.com/", "section_title": "New Orleans News, Weather, Saints - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "url": "http://www.fox8live.com/story/30299541/basic-precautions-urged-after-7-cars-burglarized-5-stolen-in-algiers", "country": "US", "title": "Basic precautions urged after 7 cars burglarized, 5 stolen in Al", "performance_score": 0, "site": "fox8live.com", "participants_count": 1, "title_full": "Basic precautions urged after 7 cars burglarized, 5 stolen in Al - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T01:08:00.000+03:00", "replies_count": 0, "uuid": "4bdb642f76cb35db493e689fc6fe85fa2c4ed38e"}, "author": "Written by: FOX8Live.com Staff", "url": "http://www.fox8live.com/story/30299541/basic-precautions-urged-after-7-cars-burglarized-5-stolen-in-algiers", "ord_in_thread": 0, "title": "Basic precautions urged after 7 cars burglarized, 5 stolen in Al", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW ORLEANS, LA (WVUE) - After several car burglaries in the Algiers area, the NOPD is urging drivers to take basic but important safety precautions when parking their vehicles.\nSince Oct. 11, there have been seven auto burglaries and five auto thefts reported in the Fourth District. In each of the burglaries, the vehicles were left unlocked, and in two of thefts, drivers left keys in the ignition.\nFollowing is a list of the incidents:\nOn October 11, 2015, a 32-year-old male reported that his vehicle had been burglarized on October 9, 2015 while parked under his carport in the 2000 block of LeBeouf Street. The victim told police he left his vehicle unlocked with his house key inside around 4:00 p.m. When he returned to it, he discovered that the interior of the vehicle had been ransacked and his house key was missing from the vehicle. The investigation is on-going.\nOn October 11, 2015, a 68-year-old male and a 39-year-old female reported that their vehicles had been burglarized on October 10, 2015 while parked in the driveway of their home in the 3000 block of Behrman Highway. The victims told police they left their vehicles unlocked around 7:30 p.m. The victims discovered several items missing including money and keys to a boat. The investigation is on-going.\nOn October 11, 2015, a 34-year-old female reported that her vehicle had been burglarized near the intersection of English Turn Drive and Island Club Drive. The victim told police that the vehicle was parked near a home in the area and was found with the door open. Detectives could not find any signs of forced entry. The investigation is on-going.\nOn October 14, 2015, a 51-year-old female reported that her vehicle had been burglarized near the intersection of Aurora Drive and Brighton Place. The victim told police she parked her vehicle in the area on October 13, 2015 around 5:00 p.m. and later returned to find it had been burglarized. Detectives could not find any signs of forced entry. The investigation is on-going.\nOn October 14, 2015, a female reported that her vehicle had been burglarized in the 2400 block of Sanctuary Drive. The victim told police that she left her vehicle parked on the street around 7:30 p.m. with her purse inside. When she returned to the vehicle around 8:00 p.m., she discovered her purse had been stolen. Detectives could not find any signs of forced entry. The investigation is on-going.\nOn October 17, 2015, a 33-year-old man reported that his vehicle had been burglarized in the 2900 block of Hudson Street. The victim told police he parked his vehicle in the driveway of his home around 12:30 a.m. that day. Later that morning, the victim said he returned to his vehicle and found papers scattered across the front seats. The investigation is on-going.\nOn October 13, 2015, a 42-year-old male reported his vehicle stolen from the 5500 block of Tullis Drive. The victim told police that he parked his car near his apartment around 6:30 p.m., left the keys in the ignition inside the unlocked vehicle and went inside to get some shoes. When he returned to the parking lot, he discovered his vehicle was missing. The investigation is on-going.\nOn October 13, 2015, a 30-year-old woman reported her vehicle stolen from the 5600 block of Tullis Drive. The victim told police that she had left her vehicle parked, unlocked and running in the area while she went inside of a friend’s apartment around 9:00 p.m. The victim said that when she returned outside, she observed an unknown male exit a Jeep on Tullis Drive and enter her vehicle. The victim said that the male drove off in her vehicle in an unknown direction. The suspect was described as a thin, black male with a short haircut, wearing dark pants and a white shirt. The vehicle is described as a tan Pontiac Bonneville. The investigation is on-going.\nOn October 16, 2015, a 63-year-old woman reported her vehicle stolen from her home in the 3000 block of Behrman Highway. The victim told police she exited her vehicle and secured it with the remote before walking inside her home around 9:45 p.m. on October 15, 2015. The next morning, the victim discovered her vehicle was gone. The vehicle was later recovered that afternoon in a driveway of a home in the 3500 block of Garden Oaks. The investigation is on-going.\nOn October 16, 2015, a 65-year-old woman reported her vehicle stolen from her in the 300 block of Diana Street. The victim told police that she parked her black, 2007 GMC Envoy in front her home around 5:00 p.m. She said when she looked outside her window later that night, the vehicle was gone. Through the course of the investigation, detectives learned the victim had left a pair of keys to the vehicle in the console. The investigation is on-going.\nOn October 16, 2015, a 38-year-old woman reported her vehicle stolen from the 4400 block of General DeGaulle Drive. The victim told police that she parked her 2011 blue Chevy Malibu in the back parking lot of a building in the area. The victim said she locked and secured her vehicle and had her keys with her, but also had an extra set of keys in the vehicle’s console. During the course of the investigation, police were able to track the stolen vehicle to a home in the 3600 block of Lang Street. The investigation is on-going.\nCitizens with information that can help solve crime are asked to call Crimestoppers at 822-1111 or toll-free 1-877-903-STOP. You could receive a cash reward of up to $2,500 for the information leading only to the arrest, except on homicides, where Crimestoppers will pay half of the reward upon the arrest and half on the indictment of the responsible person(s). You do not have to give your name nor testify to receive the reward but you must contact Crimestoppers directly with your information. Citizens can also submit an anonymous tip online to Crimestoppers at www.crimestoppersgno.org.\nCopyright 2015 WVUE. ", "external_links": [], "published": "2015-10-20T01:08:00.000+03:00", "crawled": "2015-10-20T07:11:30.104+03:00", "highlightTitle": ""}