{"organizations": [], "uuid": "fbaa4a8538ba8526bde90515eca611422a220ed3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/motorsports", "section_title": "NASCAR / Motors News, Race Results, Schedule, Standings, Photos, Videos - MSN Sports", "url": "http://www.msn.com/en-us/sports/motorsports/5-reasons-why-martin-truex-jr-will-win-the-chase-for-the-sprint-cup/ar-AAfqcEG", "country": "US", "title": "5 reasons why Martin Truex Jr. will win the Chase for the Sprint Cup", "performance_score": 0, "site": "msn.com", "participants_count": 2, "title_full": "5 reasons why Martin Truex Jr. will win the Chase for the Sprint Cup", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 1, "uuid": "fbaa4a8538ba8526bde90515eca611422a220ed3"}, "author": "Jared Turner", "url": "http://www.msn.com/en-us/sports/motorsports/5-reasons-why-martin-truex-jr-will-win-the-chase-for-the-sprint-cup/ar-AAfqcEG", "ord_in_thread": 0, "title": "5 reasons why Martin Truex Jr. will win the Chase for the Sprint Cup", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "5 reasons why Martin Truex Jr. will win the Chase for the Sprint Cup FOXSports 1 day ago Jared Turner © NASCAR via Getty Images CHARLOTTE, NC - OCTOBER 09: Martin Truex Jr., driver of the #78 Furniture Row/Visser Precision Chevrolet, sits in the garage area during practice for the Bank of America 500 at Charlotte Motor Speedway on October 9, 2015 in Charlotte, North Carolina. (Photo by Jared C. Tilton/NASCAR via Getty Images)\nFollowing a third-place finish Sunday at Charlotte Motor Speedway, Martin Truex Jr. was asked about his strategy for the two remaining races in the Contender Round of the Chase for the Sprint Cup.\nAdChoices Sitting third among the 12 championship-eligible drivers, Truex is in a relatively comfortable and somewhat enviable spot heading to Kansas Speedway for Sunday's Hollywood Casino 400. However, with just 12 points separating Truex from ninth-place Ryan Newman -- the first driver on the wrong side of the cutoff spot for the next round -- Truex doesn't plan to go super-conservative this weekend at Kansas or in the following Sunday's elimination race at Talladega.\nThe Furniture Row Racing driver instead plans to do everything within his power to win one of the next two races, which would guarantee automatic entry into the next round.\n\"Honestly, I think going to Kansas, a win is huge. It would be so huge,\" Truex said immediately after Sunday's Bank of America 500 won by Joey Logano. \"It's so critical to try to get that win out of the way. Logano is the only one that's going to sleep for the next two weeks. You know what I mean?\n\"Kansas has been one of my best racetracks, and certainly one of my best since I went to Furniture Row. Honestly, we're going there as hard as we can go with everything we have to try to win just because we know Talladega is that wild card. Third is great, but yeah, I mean, our strategy is we still think we need to win next week.\"\nFollowing are five reasons why Truex will capture his first Sprint Cup title in just a few weeks at Homestead-Miami Speedway:\n5. He's well-liked: OK, so being popular among your peers and fans doesn't put speed in your car. But it certainly doesn't hurt, either. Truex, whose longtime girlfriend's battle with ovarian cancer has been well-documented, has become sort of like everyone's second-favorite driver in this Chase. Having people in your corner and having the respect of your competitors is never a bad thing when you're in pursuit of a championship.\n4. Consistency: Only three drivers have more top-10 finishes this season than Truex, who has come home in the top 10 on 19 occasions in 30 outings. Although wins carry huge signifiance in the Chase, consistency still counts for something -- as the Challenger Round, and Jimmie Johnson's failure to advance beyond it, recently proved.\n3: Underdog status: Everyone loves an underdog, right? Of the 12 remaining Chase drivers, no one is a longer longshot than Truex from a pure depth-of-resources standpoint. That's because his team -- Denver, Colorado-based Furniture Row Racing -- is a single-car organization. Everyone else in the Chase has a teammate -- and all the advantages and additional resources that come with having a teammate. As an underdog, though, it's easy for Truex to be overlooked, which could allow him to sneak up on some people in the closing weeks.\n2. He can win: Truex got a huge monkey off his back in June when he won in convincing fashion at Pocono Raceway. Not only was it his first win since 2013 and first in two seasons with Furniture Row; it also secured a berth in the Chase and proved to everyone that the driver and his team led by first-year crew chief Cole Pearn are capable of getting to Victory Lane.\n1. He's already surpassed expectations: Coming off the worst season of his career in 2014 when he finished a dismal 24th in the standings, Truex wasn't a pre-season favorite to make the Chase much less be a serious title contender. With Truex having already surprised a lot people just by getting this far, there's no reason he can't surprise again by going all the way and hoisting the championship trophy in South Florida at season's end.\nGo to MSN Home", "external_links": ["http://www.foxsports.com/", "http://go.microsoft.com/fwlink/?LinkID=286759"], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-15T17:01:58.514+03:00", "highlightTitle": ""}