{"organizations": ["Eagles", "Cam Newton Eagles"], "uuid": "0b551dbfd77542a1143372c6dad316574b975e73", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thedailyjournal.com", "main_image": "http://www.gannett-cdn.com/-mm-/40cff871e1a9e1fe655b4fc5507ea2b203370ed3/c=0-35-1998-1164&amp;r=x633&amp;c=1200x630/local/-/media/Wilmington/Wilmington/2014/11/11/635512707341292379-EaglesPanthers0027.JPG", "site_section": "http://rssfeeds.thedailyjournal.com/vineland/sports", "section_title": "Vineland Sports", "url": "http://www.thedailyjournal.com/story/sports/2015/10/21/prep-schedule/74349806/", "country": "US", "title": "Eagles will try to corral Panthers QB Cam Newton", "performance_score": 0, "site": "thedailyjournal.com", "participants_count": 0, "title_full": "Eagles will try to corral Panthers QB Cam Newton", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T01:51:00.000+03:00", "replies_count": 0, "uuid": "0b551dbfd77542a1143372c6dad316574b975e73"}, "author": "", "url": "http://www.thedailyjournal.com/story/sports/2015/10/21/prep-schedule/74349806/", "ord_in_thread": 0, "title": "Eagles will try to corral Panthers QB Cam Newton", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Cam Newton Martin Frank", "Cam Newton"], "text": "Eagles will try to corral Panthers QB Cam Newton Martin Frank , The News Journal 6:51 p.m. EDT October 21, 2015 Buy Photo The Eagles sacked Panthers quarterback Cam Newton nine times when they faced him last season. (Photo: ANDRE L. SMITH/THE NEWS JOURNAL) Buy Photo 4 CONNECT 4 TWEET LINKEDIN COMMENT EMAIL MORE \nPHILADELPHIA - Eagles defensive lineman Fletcher Cox said there’s only one way to stop Carolina Panthers quarterback Cam Newton: \n“Hit him, hit him, hit him, hit him, hit him,” Cox said. “Even when they run the ball, hit him. I think that will shake him up a bit, make him frustrated, and that’s when all quarterbacks start doing crazy things.” \nNewton hasn’t done too many “crazy things” this season as his Panthers are 5-0. The Eagles face Carolina, which is led by Newton and a strong defense, Sunday night in Charlotte, North Carolina. \nAll of it seemed so unlikely after Newton lost his top receiver, Kelvin Benjamin, to a torn ACL before the season started. That left Newton with tight end Greg Olsen and wide receiver Ted Ginn Jr. as his top targets. \nNewton, who stands 6-foot-5 and weighs 245 pounds, has made it work. He has thrown for only 1,078 yards, which ranks 26th among quarterbacks, and has completed just 55.4 percent of his passes, which ranks 33rd. But he has thrown just four interceptions, compared with Eagles quarterback Sam Bradford, who has nine INTs in six games. \nNewton, of course, is always a threat to run. He has 225 yards rushing on 50 carries, ranking third among quarterbacks in rushing, behind only San Francisco’s Colin Kaepernick and Seattle’s Russell Wilson. He also has running back Jonathan Stewart, who has 298 yards in five games. \nThe Panthers have more rushing attempts than any team in the NFL, and they rank third in rushing yards per game with an average of 132.8. \n“We’ll have a game plan for him,” defensive tackle Cedric Thornton said. “We’re not intimidated by Cam Newton. He’s a great player. We’ve played him before. We’ll be ready.” \nChances are, the Eagles won’t be facing the same player as last season, when they dominated Newton and the Panthers in a 45-21 win on Nov. 10. Newton threw three interceptions and was sacked nine times. Connor Barwin had 3.5 of them, acting as a “spy” on Newton, who rushed for only six yards. \nNewton, however, was limited as a runner for most of last season after having ankle surgery in the spring of 2014. He was also dealing with a rib injury that pestered him throughout last season. \n“This year, he’s really running the offense at a high rate,” Eagles defensive coordinator Bill Davis said. “You’re going to get your runs from him, which is unique to the NFL. You’re going to get about eight to 10 runs from him that you have to prepare for. But probably more impressively is how he has kind of settled into the passing game. He’s not making mistakes. He’s taking what you give him, and he’s moving the ball a little bit.” Eagles Alonso, Kendricks return to practice \nThat was evident last Sunday when Newton led the Panthers back from a 20-7 deficit in the third quarter for a 27-23 win over the Seattle Seahawks. His 26-yard touchdown pass to Olsen with 32 seconds left capped an 80-yard drive. Newton threw for 269 yards and rushed for 30 more. \n“There were some things that went on against Seattle where he was orchestrating the offense,” Panthers coach Ron Rivera said. “There were times when he just flat-out put his hand up to the sideline and said, ‘Hey, I’m making this call here.’ That’s a credit to him growing within our offense and understanding how to attack our opponent.” \nNewton is the first running quarterback that the Eagles have faced this season. But Davis said that’s not such a disadvantage because they practiced against the read-option when Tim Tebow was in training camp. \nNewton, however, is tough for the Eagles, or any team, to simulate in practice because of his size. Third-string quarterback Thad Lewis has that task this week. \n“I can’t grow 4 inches and emulate his size,” Lewis said with a laugh. “You try to give the best zone-read look that you can. … That’s the easy part, no doubt about it. I just can’t be 6-6. He’s massive. You see him in gear, and it’s ridiculous. He’s a big boy.” \nContact Martin Frank at mfrank@delawareonline.com . Follow on Twitter @Mfranknfl.", "external_links": [], "published": "2015-10-22T01:51:00.000+03:00", "crawled": "2015-10-22T21:37:05.804+03:00", "highlightTitle": ""}