{"organizations": ["Astros Toronto", "Astros Royals"], "uuid": "4ea706eaf686e6bd5fc7293a0fdd320b22c45a46", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wvtm13.com", "main_image": "http://www.wvtm13.com/image/view/-/35849544/highRes/2/-/maxh/630/maxw/1200/-/o388tlz/-/Royals-Astros-5-jpg.jpg", "site_section": "http://www.wvtm13.com/29096570?format=rss_2.0&view=feed", "section_title": "Sports News", "url": "http://www.wvtm13.com/sports/royals-7-astros-2/35849798", "country": "US", "title": "Royals go to ALCS with 7-2 win over Astros", "performance_score": 0, "site": "wvtm13.com", "participants_count": 0, "title_full": "Royals go to ALCS with 7-2 win over Astros", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T06:28:00.000+03:00", "replies_count": 0, "uuid": "4ea706eaf686e6bd5fc7293a0fdd320b22c45a46"}, "author": "", "url": "http://www.wvtm13.com/sports/royals-7-astros-2/35849798", "ord_in_thread": 0, "title": "Royals go to ALCS with 7-2 win over Astros", "locations": ["Kansas City"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Royals go to ALCS with 7-2 win over Astros Toronto to open series in Kansas City on Friday UPDATED 10:28 PM CDT Oct 14, 2015 Photos Jamie Squire/Getty Images \nKANSAS CITY, Mo. -- Johnny Cueto stepped up big-time on the big stage, holding the Houston Astros to two hits over eight innings as the Kansas City Royals won 7-2 Wednesday night in fifth and decisive game of the American League Division Series. Kershaw tosses 7 innings, Dodgers even series \nClayton Kershaw threw seven terrific innings on three days' rest Tuesday night as the Los Angeles Dodgers pushed the National League Division Series to the limit with a 3-1 win over the New York Mets in Game 4 at Citi Field. Cubs beat Cardinals to reach NLCS \nPlayers, coaches and executives partied in the clubhouse and on the field after the Cubs beat the St. Louis Cardinals 6-4 to win the National League Division Series on Tuesday in front of a raucous Wrigley Field crowd. Chicago won the best-of-five series in four games. More \nThe Royals advance to the AL Championship Series, where they will meet the Toronto Blue Jays, who eliminated the Texas Rangers on Wednesday afternoon. The series begins Friday at Kauffman Stadium. \nCueto, who was acquired in a July 26 trade with the Cincinnati Reds, retired the final 19 batters he faced after third baseman Luis Valbuena hit a two-run homer in the second inning. It was the only mistake Cueto made. \nThe right-hander walked none and struck out eight, his high in 15 starts with the Royals, including two starts in the ALDS. \nWhile Cueto was brought in to be the staff ace, he was disappointing until Wednesday. In one five-game stretch, all losses, Cueto had an earned-run average higher than 9.00, and overall he was 4-7 with a 4.76 ERA in 13 regular-season starts for Kansas City. \nHowever, when the Royals needed him the most -- win or go home until spring training -- Cueto came through. It was his first postseason victory. He was 0-2 with a 5.52 ERA in his four previous playoff starts. \nRoyals right fielder Alex Rios, who had only 32 RBIs in 105 regular-season games, provided the key hit, a two-run double in the three-run fifth inning that gave Kansas City the lead. \nDesignated hitter Kendrys Morales put an exclamation point on the game with a three-run homer off Astros 20-game winner Dallas Keuchel with two outs in the eighth. \nKeuchel, who was brought in to keep Houston's deficit at a manageable 4-2, yielded a leadoff double to Alcides Escobar and intentionally walked Lorenzo Cain before Morales drilled a 2-2 slider over the left field fence. Morales, who led the Royals with 106 RBIs in the regular season, hit three home runs in the ALDS. \nKansas City closer Wade Davis worked a flawless ninth to set up a thunderous roar before 40,566 fans. \nAfter Cueto retired the first two batters in the second, he should have been out of the inning on a play the Royals routinely make. Astros designated hitter Evan Gattis hit a grounder down the third base line that Mike Moustakas backhanded, but his throw to first was off line. Gattis jarred the ball loose from first baseman Eric Hosmer as he attempted to make a tag and it was ruled an infield single. \nThat proved costly. On the next pitch, Valbuena drove a 94 mph pitch from Cueto into the Astros' bullpen, making it 2-0. Valbeuna was 2-for-14 (both singles) in postseason before the homer. \nThe Royals broke through with a hustle run in the fourth. With one out, Cain sliced a single to right. With the count full, Cain was running on a pitch from right-hander Colin McHugh (1-1) to Hosmer, who blooped it into shallow center. When Carlos Gomez fell down fielding the ball, Cain never stopped running and scored standing up, cutting the lead to 2-1.The Royals forged ahead with a three-run fifth and sent McHugh to the showers. Perez was hit by a pitch leading off the inning and stopped at third on Gordon's ground-rule double to right. \nAstros manager A.J. Hinch went to his bullpen, bringing in Mike Fiers, who was acquired from the Milwaukee Brewers along with Gomez in a July 30 trade. Rios, who batted .140 with runners in scoring position with less than two outs during the regular season, hit a grounder down the third base line for a double, putting the Royals ahead by a run. \nShortstop Alcides Escobar bunted Rios to third and Zobrist got him home with a flyout to right fielder George Springer. \nMcHugh, who beat the Royals in the first game of the ALDS, was charged with three runs and five hits in four-plus innings. \nNOTES: Astros LF Colby Rasmus, who hit four home runs in the first five postseason games, was moved to cleanup. DH Evan Gattis, who had a .150 average with no extra-base hits and one RBI in postseason play entering Wednesday, was dropped to sixth. ... Royals manager Ned Yost used the same lineup for all five ALDS games. ... Commissioner Rob Manfred was on hand for the game. ... The Royals are the only team in major league history to win an elimination game when down by at least four runs entering the eighth inning, doing it twice, in the 2014 AL wild-card game and in Game 4 on Monday. ... The Royals honored Kansas City, Mo., firefighters Larry Leggio and John Mesh, who died Monday in a fire. Eric Hosmer, whose father Mike was a firefighter for 29 years in Miami, met with the families of the fallen firefighters before the game.", "external_links": [], "published": "2015-10-15T06:28:00.000+03:00", "crawled": "2015-10-15T08:42:29.541+03:00", "highlightTitle": ""}