{"organizations": ["Neshanic Valley Golf Course", "Somerset County Park Commission", "New Jersey Water Supply Authority", "Somerset County Park Commission Neshanic Valley Golf Course", "Bald Eagle"], "uuid": "04ff059679a6b09d946ad0eb60a0fee34a07f633", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mycentraljersey.com", "main_image": "http://www.gannett-cdn.com/-mm-/e348b05216c3cfd92fba99423948d9f75b7488cc/c=0-133-1440-947&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/16/NJGroup/Bridgewater/635805903771227334-Bald-eagle-2.JPG", "site_section": "http://rssfeeds.mycentraljersey.com/bridgewater/sports", "section_title": "Bridgewater - Sports", "url": "http://www.mycentraljersey.com/story/sports/high-school/2015/10/16/tennis-volleyball-roundup-friday-oct/74081384/", "country": "US", "title": "Neshanic Valley Golf Course keeps sanctuary designation", "performance_score": 0, "site": "mycentraljersey.com", "participants_count": 0, "title_full": "Neshanic Valley Golf Course keeps sanctuary designation", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T20:24:00.000+03:00", "replies_count": 0, "uuid": "04ff059679a6b09d946ad0eb60a0fee34a07f633"}, "author": "", "url": "http://www.mycentraljersey.com/story/sports/high-school/2015/10/16/tennis-volleyball-roundup-friday-oct/74081384/", "ord_in_thread": 0, "title": "Neshanic Valley Golf Course keeps sanctuary designation", "locations": ["Neshanic Valley", "New Jersey"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Neshanic Valley Golf Course keeps sanctuary designation Rich Reitman 1:24 p.m. EDT October 16, 2015 This Bald Eagle is a regular visitor to Somerset County Park Commission Neshanic Valley Golf Course. The facility has earned recertification as a \"Certified Audubon Cooperative Sanctuary” through the Audubon Cooperative Sanctuary Program for Golf Courses. (Photo: Somerset County Park Commission) Story Highlights To reach certification, a course must demonstrate a high degree of environmental quality Neshanic Valley is one of 20 courses in New Jersey and 912 courses in the world to hold the honor Neshanic Valley also earned “River-Friendly” designation from the New Jersey Water Supply Authority 1 CONNECT TWEET LINKEDIN COMMENT EMAIL MORE \nBRANCHBURG The Somerset County Park Commission's Neshanic Valley Golf Course has retained its designation as a Certified Audubon Cooperative Sanctuary through the Audubon Cooperative Sanctuary Program for Golf Courses, an Audubon International program. \nParticipation is designed to help course personnel plan, organize, implement and document a comprehensive environmental management program and receive recognition for their efforts. To reach certification, a course must demonstrate a high degree of environmental quality in a number of areas, including Environmental Planning, Wildlife & Habitat Management, Outreach and Education, Chemical Use Reduction and Safety, Water Conservation and Water Quality Management. \n\"Neshanic Valley Golf Course has shown a strong commitment to its environmental program. They are to be commended for their efforts to provide a sanctuary for wildlife on the golf course property,\" said Tara Pepperman, director of Cooperative Sanctuary Programs at Audubon International. \nNeshanic Valley is one of 20 courses in New Jersey and 912 courses in the world to hold the honor. The golf course was first designated as a Certified Audubon Cooperative Sanctuary in 2009. \nThe recertification process, coordinated by Andrew Hojnowski, manager of Golf Maintenance, required a visit by a local community representative, Craig Tolley, assistant professor of Landscape and Horticultural Technology at County College of Morris. \n“Neshanic Valley is a well-managed golf course where protecting the environment is just as important as playability,” he said. \nThe site visit provides an objective verification of some of the more visible aspects of the course’s environmental management activities and offers an opportunity for golf course representatives to share publicly some of the voluntary actions they have taken to protect and sustain the land, water, wildlife and natural resources around them. \nOf the course’s recertification, Hojnowski wrote: “Environmental stewardship has always been a top priority at Neshanic Valley and we strive to ensure that we fulfill that responsibility. We continually prove that we can maintain the highest quality golfing experience while still protecting the environment around us.” Neshanic Valley has also earned River-Friendly designation from the New Jersey Water Supply Authority, Groundwater Guardian by the Groundwater Foundation, Environmental Stewardship by the New Jersey Department of Environmental Protection and has been named at 36th-best municipal golf course in the country by Golfweek magazine. Neshanic Valley is an all-inclusive golfing experience with a 27-hole Championship Course, a 9-hole Academy Course, the Learning Center and the Callaway Golf Performance Center. The state-of-the-art Learning Center includes a double-ended driving range with grass and mat hitting areas, a 12,000-square-foot putting green, a practice facility including bunkers and three chipping greens, and two practice holes. The Callaway Golf Performance Center at Neshanic Valley offers a state-of-the-art computerized golf club fitting and swing analysis system, operated by Callaway-trained professionals. Information on Somerset County Park Commission activities may be found at www.somersetcountyparks.org . Read or Share this story: http://mycj.co/1RML4it TOP VIDEOS", "external_links": [], "published": "2015-10-16T20:24:00.000+03:00", "crawled": "2015-10-17T03:32:30.746+03:00", "highlightTitle": ""}