{"organizations": [], "uuid": "1ff8966e856be85156df20a4e31fbe50443999d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.beaumontenterprise.com", "main_image": "http://ww1.hdnux.com/photos/41/23/62/8731792/7/rawImage.jpg", "site_section": "http://www.beaumontenterprise.com/sports/hs/collectionRss/Sports-HS-Heds-8127.php", "section_title": "Sports HS Heds", "url": "http://www.beaumontenterprise.com/sports/hs/article/Bulldogs-top-Panthers-6547402.php", "country": "US", "title": "Silsbee falls in shootout", "performance_score": 0, "site": "beaumontenterprise.com", "participants_count": 1, "title_full": "Silsbee falls in shootout", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T07:38:00.000+03:00", "replies_count": 0, "uuid": "1ff8966e856be85156df20a4e31fbe50443999d5"}, "author": "Danny Shapiro", "url": "http://www.beaumontenterprise.com/sports/hs/article/Bulldogs-top-Panthers-6547402.php", "ord_in_thread": 0, "title": "Silsbee falls in shootout", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published 11:39 pm, Friday, October 2, 2015 Image 1 of / 9 Close Image 1 of 9 \nThe Silsbee Tiger's Dontre' Thomas is tripped by the Huffman Falcon's Tyler Price Friday Night at Tiger's Stadium by Denzel Seale. The Silsbee Tiger's Dontre' Thomas is tripped by the Huffman... Image 2 of 9 \nThe Silsbee Tiger's players defend thier line against the Huffman Falcon's Friday Night at Tiger's Stadium by Denzel Seale. The Silsbee Tiger's players defend thier line against the Huffman... Image 3 of 9 \nThe Silsbee Tiger's players defend thier line against the Huffman Falcon's Friday Night at Tiger's Stadium by Denzel Seale. The Silsbee Tiger's players defend thier line against the Huffman... Image 4 of 9 \nThe Huffman Falcon's Cody gets tackled by The Silsbee Tigers Defense Friday Night at Tiger's Stadium by Denzel Seale. The Huffman Falcon's Cody gets tackled by The Silsbee Tigers... Image 5 of 9 \nThe Silsbee Tiger's and the Huffman Falcons prepare for the play Friday Night at Tiger's Stadium by Denzel Seale. The Silsbee Tiger's and the Huffman Falcons prepare for the play... Image 6 of 9 \nThe Silsbee Tiger's Quaterback runs the ball against the Huffman Falcon's defense Friday Night at Tiger's Stadium by Denzel Seale. The Silsbee Tiger's Quaterback runs the ball against the Huffman... Image 7 of 9 \nthe Silsbee Tiger's Quaterback regroups after tackle from the Huffman Falcon's defense Friday Night at Tiger's Stadium by Denzel Seale. the Silsbee Tiger's Quaterback regroups after tackle from the... Image 8 of 9 \nThe Silsbee Tiger's coach advise player on important play Friday Night at Tiger's Stadium by Denzel Seale. The Silsbee Tiger's coach advise player on important play Friday... Image 9 of 9 1 / 9 Back to Gallery \nHuffman-Hargrave held off a late Silsbee rally to defeat the Tigers 50-47 Friday at Tiger Stadium in Silsbee's home district opener. \nWHAT HAPPENED: Huffman-Hargrave quarterback Cody Gaitan threw for six touchdowns, including three in the second half to lead the Falcons to victory. The bubble screen worked all night for Gaitan and the Falcons, who scored on touchdown passes of 70, 53 and 23 yards off the bubble screen. Silsbee quarterback Dontre' Thomas accounted for all seven (five passing, two rushing) of the Tigers' touchdowns in the loss. \n\"We dug ourselves a hole early that we never seemed to get out of,\" Silsbee head coach Bobby McGallion said. \"We didn't get in sync until it was too late.\" \nTURNING POINT: Gaitan connected with receiver Trey Lundy on a 70-yard bubble screen touchdown on the second play of scrimmage in the second half, which extended the Falcons' lead to 18 points. It was the first of two touchdown catches for Lundy. \n\"That play certainly didn't help us,\" McGallion said. \"But that's football. Sometimes things like that happen.\" \nMOST-SPECTACULAR PLAY: With the Falcons lead trimmed to three with just over seven minutes remaining, the Falcons went on a five-minute, game-clinching drive highlighted by a 28-yard third down touchdown pass from Gaitan to receiver Lane Shivley . Gaitan dropped back into the pocket and threw a strike over the middle to Shivley, who brought in the pass in the end zone over the diving, outstretched hands of a Silsbee safety. \n\"I'm really proud of how our team fought back,\" McGallion said. \"But that's just another one of those plays that just happens.\" \nBY THE NUMBERS: Huffman-Hargrave recovered two first-half onside kicks, which allowed the Falcons to run 44 plays opposed to Silsbee's 23 plays and take a 24-12 halftime lead, which they never relinquished. Huffman had 23 first downs in the game compared to nine for Silsbee. \nRECORDS: Huffman-Hargrave 3-2, 1-0. Silsbee 4-2, 1-1 \nHE SAID IT: \"(Huffman-Hargrave) is a good football team,\" McGallion said. \"We have to give them credit where it's due. They played a heck of a football game.\" \nNEXT UP: Huffman-Hargrave plays host to Splendora next Friday at 7:30 p.m. Silsbee is off next Friday but returns to action on the road Oct. 16 against Splendora at 7:30 p.m. \nDShapiro@BeaumontEnterprise.comTwitter.com/DannyShapiro13", "external_links": [], "published": "2015-10-03T07:38:00.000+03:00", "crawled": "2015-10-03T10:51:30.993+03:00", "highlightTitle": ""}