{"organizations": ["North Hunterdon Phillipsburg"], "uuid": "cdf2b02e7fab4df6ee7f5f4cd29327d8260116a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "highschoolsports.lehighvalleylive.com", "main_image": "http://hssn-media.advance.net/PennLive.com/news/3eb2e9f29b0e808b48dd05143b8f4c6a/woody1.jpg", "site_section": "http://blog.lehighvalleylive.com/lehighvalleylive_high_school_sports_homepage_feed/atom.xml", "section_title": "lehighvalleylive.com High School Sports", "url": "http://highschoolsports.lehighvalleylive.com/news/article/7317163085228536505/4-throw-ins-from-phillipsburgs-boys-soccer-win-over-north-hunterdon/", "country": "IL", "title": "4 throw-ins from Phillipsburg's boys soccer win over North Hunterdon", "performance_score": 0, "site": "lehighvalleylive.com", "participants_count": 0, "title_full": "4 throw-ins from Phillipsburg's boys soccer win over North Hunterdon", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T05:40:00.000+03:00", "replies_count": 0, "uuid": "cdf2b02e7fab4df6ee7f5f4cd29327d8260116a3"}, "author": "", "url": "http://highschoolsports.lehighvalleylive.com/news/article/7317163085228536505/4-throw-ins-from-phillipsburgs-boys-soccer-win-over-north-hunterdon/", "ord_in_thread": 0, "title": "4 throw-ins from Phillipsburg's boys soccer win over North Hunterdon", "locations": ["Phillipsburg"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["North Hunterdon"], "text": "Phillipsburg 3, North Hunterdon 1 \nStateliners bag the target. North Hunterdon coach John Simpson knew his team would be facing a fired-up foe when they arrived at the Phillipsburg Athletic Complex Thursday. “They wanted this one,” he said after the 3-1 Stateliner win. Yes, they did. “We were definitely motivated for this one,” said Phillipsburg senior tri-captain Joe Takacs . “We lost to them three times by one goal each time last season and they beat us in the (Hunterdon/Warren/Sussex) final. We were going to stay focused today.” \nA steady hand in midfield for Phillipsburg. Sometimes there seemed to be several No. 13’s on the field for Phillipsburg, so active and involved was junior Woody Crosby-Piszczek . “Woody did a fantastic job,” Stateliner coach Evan Weller said. “He wins passes, he controls the midfield, and he has such vision off the ball.” Crosby-Piszczek was equally effective tracking back on defense or sparking an attack, and he wasn’t afraid to be physical. And he helped settle down the Stateliners after North had tied the game with a frustrating goal to surrender. “We had to stay focused and not let it bother us,” Crosby-Piszczek said. Not much seems to bother Crosby-Piszczek in the midfield. \nFrom one coach to another, genuine praise: The Lions’ Simpson, while discussing Phillipsburg’s desire to avenge last year’s trio of losses, launched into unsolicited praise of Weller. “The evolution of this program is a tribute to Coach Weller,” he said. “You can see what he has done with the program in the way they play, and the talent he has developed. Phillipsburg plays with heart.” \nP’burg’s eyes on the prize . The Stateliners may need some help to win the Skyland Conference Raritan Division championship –“we’re playing catch-up and we need some results from other teams,” Weller said – but they don’t lack for confidence they can do so. Asked who the best team in the division, senior midfielder Keegan Halloran said. “I think we are.” Takacs said, “When we play our best, we can play with the best. We have to stay focused and not let down in any game.” Crosby-Piszczek added, “If everything continues to come together for us, we can be the best team in the league.” The Stateliners have to be considered a contender for H/W/S honors as well. All this optimism will get a stern test Tuesday when Pingry, ranked No. 11 in the state, visits the Stateliners; North had tied Pingry 1-1 recently. A win Tuesday would be a real statement for the Stateliners.", "external_links": [], "published": "2015-10-09T05:40:00.000+03:00", "crawled": "2015-10-10T02:21:37.052+03:00", "highlightTitle": ""}