{"organizations": ["Alabama Crimson Tide", "Boston College Eagles", "Texas Tech Red Raiders", "Florida Gators", "Texas A&M Aggies", "NCAA", "Aggies", "West Virginia Mountaineers", "Kansas State Wildcats", "Kansas Jayhawks", "ESPN", "Michigan State", "Memphis Tigers", "Oklahoma Sooners", "NCAA College Football Frenzy", "Arkansas Razorbacks", "Texas Tech", "Spartans", "Texas Longhorns", "Iowa State Cyclones", "TCU Horned Frogs", "Pitt Panthers", "Louisville Cardinals", "Northwestern Wildcats", "SEC", "Clemson Tigers", "Florida State Seminoles", "LSU Tigers", "Michigan Wolverines", "Big House", "Michigan State Spartans", "Iowa Hawkeyes", "Baylor Bears", "CBS"], "uuid": "3b0f749b27be167aac9c31c42541aff0068d0024", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.calgarysun.com", "main_image": "http://storage.calgarysun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297761300202_LARGE_BOX.jpg?quality=80&stmp=1445146376173&size=100x", "site_section": "http://www.calgarysun.com/sports/rss.xml", "section_title": "Top Sports stories", "url": "http://www.calgarysun.com/2015/10/17/ncaa-college-football-frenzy----sort-of-separation-saturday", "country": "CA", "title": "NCAA College Football Frenzy -- Sort-of Separation Saturday", "performance_score": 0, "site": "calgarysun.com", "participants_count": 0, "title_full": "NCAA College Football Frenzy -- Sort-of Separation Saturday", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T08:09:00.000+03:00", "replies_count": 0, "uuid": "3b0f749b27be167aac9c31c42541aff0068d0024"}, "author": "", "url": "http://www.calgarysun.com/2015/10/17/ncaa-college-football-frenzy----sort-of-separation-saturday", "ord_in_thread": 0, "title": "NCAA College Football Frenzy -- Sort-of Separation Saturday", "locations": ["Mich.", "Mississippi", "Texas", "Georgia", "Ann Arbor", "Michigan", "Alabama", "Florida"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Le’Raven Clark", "Johnny Manziel", "Minkah Fitzpatrick", "Jalen Watts-Jackson", "Mark Dantonio", "Blake O’Neill", "Akrum Wadley", "Kyle Allen", "Eddie Jackson", "Jordan Canzeri", "Allie LaForce", "Seth Russell", "Derrick Henry", "Leonard Fournette", "Dalvin Cook", "Nick Saban", "Dantonio", "Allen", "Everett Golson"], "text": "It was billed as Separation Saturday. A day meant to separate the contenders from the pretenders in the NCAA football world. Good-bye, Michigan. See ya, Florida. So long, Texas A&M. OK, so maybe there wasn’t as much separation as there could have been in the three games involving six of the top 12-ranked college pigskin squads. That’s especially true of the No. 5 Michigan State Spartans and the No. 12 Michigan Wolverines. The Big Ten rivals went down to the wire, and only a crazy ending put Sparty in the win column — a fumble by Michigan punter Blake O’Neill, who was trying to grab a low snap, was returned for the winning points on the final play of the game. Jalen Watts-Jackson somehow bullied his way into the endzone from 38 yards out for that bizarre touchdown at the buzzer for a 27-23 shocker by Michigan State (7-0) over host Big Blue (5-2) at a stunned Big House in Ann Arbor, Mich.“What do you say?” Spartans head coach Mark Dantonio told ESPN post-game. “You gotta believe, I guess. We kept talking about being mentally strong and just keep playing. Unbelievable. “I guess we won on a crazy play, but we played hard and with conviction, and that’s what we asked our guys to do,” Dantonio continued. “We’re 7-0. We advance — that’s what it means. In the big picture, our (national title) dreams are still alive.” In College Station, Texas, the No. 10 Alabama Crimson Tide (6-1) rolled up a 41-23 victory over the No. 9 Texas A&M Aggies (5-1), but turnovers for TDs marred the game in the visiting team’s favour. Turns out Aggies QB Kyle Allen is no Johnny Manziel, who earned his Heisman Trophy as a freshman pivot for A&M three years ago with a signature win over the Crimson Tide. Allen, who threw 20-of-40 for 263 yards and one TD, had his issues. Try three interceptions returned by Alabama for touchdowns. Tide freshman Minkah Fitzpatrick had two of them — a 33-yard one to open scoring and a 55-yard one to wrap up the day. In between time, a 93-yard pick-six by ’Bama’s Eddie Jackson in the second quarter put the Tide up three TDs. It didn’t hurt either that ’Bama running back Derrick Henry scampered to a career-high 236 yards and two TDs on 32 carries in what was a well-controlled game by the visitors.“This is a great team win,” Tide head coach Nick Saban told CBS’ Allie LaForce post-game. “The turnovers in the game were huge. There were a lot of big plays in the game — our interceptions, and they had a punt return for a touchdown (of 68 yards by Christian Kirk).” The late game saw the No. 6 LSU Tigers, behind Heisman Trophy-frontrunner Leonard Fournette’s 180-yard, two-TD effort, edge the No. 8 Florida Gators 35-28 in a hotly-contested tilt. Bottom line: The losers won’t be falling too far in the standings and still may be able to play their way back in to College Football Playoff consideration. SECOND & LONG Curious that the Crimson Tide were somehow demoted to 10th spot in the AP Top 25 last weekend despite taking care of the stubborn SEC-rival Arkansas Razorbacks 27-14. They tumbled two spots in the rankings, while Texas A&M stuck at No. 9 and Florida rose two spots to No. 8, essentially meaning Florida flip-flopped with ’Bama. Made no sense since all three teams earned quality— but similar — wins over SEC opponents. And seven days later, the Tide proved with their play that it was a strange flip in the Top 25 … It’s not like Spartans head coach Mark Dantonio is soon going to forget his 100th career win since it was an absurd triumph over his team’s instate rival … At the top of the rankings: Seth Russell used his arm (380 yards) and his legs (160 yards) to carry the No. 2 Baylor Bears (6-0) to an easy 62-38 victory over the West Virginia Mountaineers (3-3); the No. 3 TCU Horned Frogs (7-0) shutout the Iowa State Cyclones (2-4)over the final three quarters in a 45-21 win; and the No. 5 Clemson Tigers (6-0) doubled up the Boston College Eagles (3-4) 34-17. THIRD & GOAL Upset of the day: The No. 13 Ole Miss Rebels (5-2) were eaten alive by the host Memphis Tigers (6-0) 37-24 to put a dagger in Mississippi’s national title hopes. Memphis, arguably the best Group of 5 team in the country, is for real with a 13-game win streak … The Kansas Jayhawks (0-6) threw a scare in to the Texas Tech Red Raiders (5-2), who staved off the home-side lesser lights with the help of a crazy two-point convert that saw the centre lateral the snap back to 308-lb. lineman Le’Raven Clark, who then bulled his way into the endzone — usat.ly/1Ppp92e . Texas Tech won 30-20 … Everett Golson had a big day of passing — 26-of-38 for 372 yards and three TDs — to go with Dalvin Cook’s 163 rushing yards and two scores, helping the No. 11 Florida State Seminoles (6-0) turn back the Louisville Cardinals (2-4). FOURTH & INCHES Seldom-used RB Akrum Wadley ran roughshod for the No. 17 Iowa Hawkeyes (7-0), rolling up 204 yards and four TDs on 26 carries in relief of injured star RB Jordan Canzeri to help his club declaw the suddenly-tame No. 20 Northwestern Wildcats (5-2) 40-10 … The No. 19 Oklahoma Sooners (5-1) bounced back after losing to the terrible Texas Longhorns by obliterating the host Kansas State Wildcats (3-3) 55-0 … Not so long ago, the Georgia Tech Yellow Jackets were ranked and a title darkhorse, but a 31-28 home loss to the Pitt Panthers (5-1) gives the Ramblin’ Wreck (2-5) a fifth-straight loss.", "external_links": [], "published": "2015-10-18T08:09:00.000+03:00", "crawled": "2015-10-18T16:09:05.861+03:00", "highlightTitle": ""}