{"organizations": [], "uuid": "53d6a1bdc34d6e7ccf99947ff40ebc3a3f4316d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.baltimoresun.com", "main_image": "http://www.trbimg.com/img-53fdf16a/turbine/bal-baltimore-default-facebook-icon", "site_section": "http://feeds.baltimoresun.com/baltimoresun/sports/college/rss2.0.xml", "section_title": "College Sports - Baltimore Sun", "url": "http://www.baltimoresun.com/sports/college/dp-spt-virginia-tech-s-kendall-fuller-will-miss-the-rest-of-the-season-after-having-knee-surgery-20150930-post.html", "country": "US", "title": "Virginia Tech's Kendall Fuller will miss the rest of the season after having knee surgery", "performance_score": 0, "site": "baltimoresun.com", "participants_count": 1, "title_full": "Virginia Tech's Kendall Fuller will miss the rest of the season after having knee surgery", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T18:14:00.000+03:00", "replies_count": 0, "uuid": "53d6a1bdc34d6e7ccf99947ff40ebc3a3f4316d0"}, "author": "Norm Wood", "url": "http://www.baltimoresun.com/sports/college/dp-spt-virginia-tech-s-kendall-fuller-will-miss-the-rest-of-the-season-after-having-knee-surgery-20150930-post.html", "ord_in_thread": 0, "title": "Virginia Tech's Kendall Fuller will miss the rest of the season after having knee surgery", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Virginia Tech's Kendall Fuller will miss the rest of the season after having knee surgery Virginia Tech's Kendall Fuller discusses defensive effort at Purdue \nFuller on Tech knowing its capable of being great on defense, even with young starters stepping in \nFuller on Tech knowing its capable of being great on defense, even with young starters stepping in Norm Wood Contact Reporter Fuller suffered a torn meniscus in August and tried to play through the injury in the first three games \nBLACKSBURG -Virginia Tech cornerback Kendall Fuller will miss the rest of the season after having surgery Tuesday to repair a torn meniscus in his right knee, according to Tech’s athletic department. \nFuller, a junior, suffered the injury in August during preseason practices. Prior to the injury, he was considered by many NFL draft analysts to be a potental first-round selection in next year’s draft. If his stock remains high after the knee injury, there’s a chance he’s played his final game in a Tech uniform. \n“Kendall was very determined to compete as long as he could with this injury,” Tech coach Frank Beamer said in a statement released by the athletic department. “While we are all disappointed that he is sidelined for the remainder of the season, we know Kendall will approach his rehab with a positive attitude and will continue to contribute to our team with his knowledge and leadership.” \nIn three games this season, Fuller had seven tackles, including a sack, a pass breakup and a forced fumble. He sat out last Saturday in Tech’s 35-28 loss at East Carolina. \nTech defensive coordinator Bud Foster said Tuesday he was prepared to move forward in Saturday’s game against Pittsburgh with redshirt freshman Terrell Edmunds filling in for Fuller. Of course, Foster made that statement before details on Fuller’s injury were released. \n“Kendall courageously attempted to play the first three games of this season with a torn meniscus that occurred during preseason camp in August,” Tech trainer Mike Goforth said in the statement. “After this past weekend’s game, it was decided that surgery would be the best option moving forward, and Kendall will miss the remainder of the 2015 football season. The procedure was performed Tuesday morning and Kendall is expected to have a full recovery.” \nFuller, a 6-foot-0, 196-pound Baltimore, Md. native, was one of the nation’s top returning cornerbacks this season after earning second team All-America honors last season from the Football Writers Association of America and the Walter Camp Foundation, and third-team All-America distinction from the Associated Press. \nHe was a first team All-Atlantic Coast Conference pick last season, finishing in a tie with Louisville’s Gerod Holliman for the ACC lead in passes defended (17). Fuller had 54 tackles, including 4.5 for loss and two sacks, and two interceptions. \nHe had offseason surgery to repair a fractured left wrist he played with all season. Though he sat out spring practices, he was fully recovered from surgery by the summer. \nComing out of Our Lady of Good Counsel High in Olney, Md., Fuller was considered by recruiting analysts one of the nation’s top five cornerbacks in the class of 2013. He followed in the footsteps of brothers Vincent, Kyle and Corey as players at Tech.", "external_links": [], "published": "2015-09-30T18:14:00.000+03:00", "crawled": "2015-10-01T18:39:29.184+03:00", "highlightTitle": ""}