{"organizations": [], "uuid": "a2af9c4b39a4d8adbb5ce797cd2124aa8dd93f6e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/0f45a03a9b11b02f81aab39f6a5031ca", "site_section": "http://www.news.com.au/sport/american-sports", "section_title": "American Sports | US Sports News | News.com.au", "url": "http://www.news.com.au/sport/sports-life/jarryd-hayne-on-day-to-day-life-in-the-nfl/story-fno61i58-1227569923064", "country": "AU", "title": "Jarryd Hayne NFL: 49ers rookie on life in the NFL", "performance_score": 0, "site": "news.com.au", "participants_count": 1, "title_full": "Jarryd Hayne NFL: 49ers rookie on life in the NFL", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T18:28:00.000+03:00", "replies_count": 0, "uuid": "a2af9c4b39a4d8adbb5ce797cd2124aa8dd93f6e"}, "author": "Jai Bednall", "url": "http://www.news.com.au/sport/sports-life/jarryd-hayne-on-day-to-day-life-in-the-nfl/story-fno61i58-1227569923064", "ord_in_thread": 0, "title": "Jarryd Hayne NFL: 49ers rookie on life in the NFL", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Video Image Jarryd Hayne trains with San Francsico first team 0:28 NFL: Jarryd Hayne continues to impress in the NFL, this week the rookie was seen training with the San Francsico 49ers first team\nOctober 15th 2015 6 days ago /video/video.news.com.au/Sport/More Sports/ Jarryd Hayne: “I don’t have a life anymore.”\nJai Bednall news.com.au TWELVE months ago, Jarryd Hayne told a stunned Australian sporting public he was quitting rugby league to chase his dream of playing in the NFL.\nToday he’s hurrying into the San Francisco 49ers locker room at Levi’s Stadium looking to quickly change out of a sweat-soaked Superman T-shirt into something cleaner before a special teams meeting begins next door.\nSo much has happened since that teary press conference at the Parramatta Leagues Club on October 14 last year, Hayne says it feels “like a lifetime ago”.\nFor starters, the boy from Minto who fell in love with American football playing Madden has put away his controller. With a six-day-a-week, 8am-5pm work schedule he simply doesn’t have time for computer games anymore.\n“I literally haven’t turned it on for four months now,” Hayne told news.com.au at his locker. “I haven’t got a life anymore. It’s pretty much get home, study or just flick through emails from back home.”\nWhile that means he is yet to experience the unique thrill of playing as himself in Madden , the 27-year-old’s life hasn’t been short of unique experiences. From the early homesickness and struggles learning the playbook to the highs of his unbelievable preseason and now the season proper, Hayne’s life has been a series of memorable twists and turns.\nHe’s sold jerseys at the same rate as the NFL’s best players, seen interest in his journey reach unprecedented levels for an Australian athlete and had everyone from Andrew Bogut to Magic Johnson offer an opinion on how he’s going.\n“It’s been a heck of a journey,” Hayne says.\nJarryd Hayne, Bruce Ellington and Quinton Patton in the 49ers locker room. Source: Getty Images\nRight now — from the vision we see during games — Hayne looks like a man still greatly enjoying the novelty of playing on stages like New York’s MetLife Stadium but also a born competitor struggling with the transition from being an 80-minute a game NRL superstar to a rarely-used punt returner fighting for crumbs in a struggling team.\nSo far there has been more good than bad in Hayne’s return game. He’s averaging 10.3 yards per return, not far off the 12-yard average 49ers special teams coach Thomas McGaughey expects of a top returner. His most recent effort — a 16-yard gain in last week’s defeat against the Giants — showcased the parts of his game his coaches love.\n“He caught the ball, set it and got vertical,” McGaughey said. “(Giants punter) Brad Wing stuck one a yard from the sideline, Jarryd made a good catch, he made the long snapper miss and got down the field.”\nUnfortunately that was the only return he had all game.\nAussie punts to Aussie in 49ers, Giants clash 0:55 NFL: In a rare sighting in American football, Australian punter for the New York Giants, Brad Wing, punts to another Aussie in San Francisco 49ers punt returner Jarryd Hayne\nOctober 12th 2015 8 days ago /video/video.news.com.au/Sport/More Sports/ Hayne’s desperation to make his mark on the league as quickly as possible adds an element of risk to his position as the 49ers’ preferred returner of punts. It’s one position where mistakes can be game-changing. Be aggressive but not reckless, McGaughey preaches.\n“We talk to all of our returners in that fashion,” he told reporters. “We want to make sure we let the plays come to us, we don’t chase them. You start chasing plays you make mistakes and I think that’s something all those guys — including Jarryd — has to manage. You’ve got to pick your spots and then once your spot’s there you got to make it happen.”\nWhile there has been the occasional sign of Hayne’s frustration at his lack of opportunity, he’s too much of a pro to speak about it at length. At least publicly.\n“Everything keeps getting better,” he said. “Every week I get more comfortable with understanding what’s going on, the playbook and everything in general.”\nThat includes the 25C days currently being enjoyed on the West Coast.\n“California is great. I can’t believe the weather, it’s the best climate I’ve ever lived in. It’s just consistently warm all year round. Sydney is a bit up and down. Sydney’s summer is beautiful and obviously the winter gets a bit cold. We’re coming into the start of winter now and it’s still nice. I was at the beach two days ago.”\nHayne making an impact with his limited opportunity at running back. Source: Reuters\nProjecting where he’ll be 12 months from now is a much cloudier proposition. So far Hayne has enjoyed a relatively smooth beginning in San Francisco. He hasn’t suffered any injuries and appears well-supported by the ’Niners coaching staff.\nIt would be nice to think his playing time will increase incrementally to the point he’s seeing up to a dozen carries a game at running back on occasion. But this is the NFL, anything can happen. Miami sacked its coach four games into the season. The 49ers — under rookie coach Jim Tomsula — haven’t exactly been setting the world on fire. Who knows what that could mean for Tomsula, and in turn Hayne?\nWhat’s clear is Hayne is good enough to play in this league. Asked where Hayne could be 12 months from now, McGaughey said: “It’s up to Jarryd.”\n“How much time is he willing to put in, in terms of studying the game and just the maturation process?\n“Who knows? Next year he might be leading the league in punt returns ... He has that kind of ability to get those big averages because he’s a big, straight-ahead, strong runner and he does a good job of making people miss in space. He has the ability to be a great punt returner.”\nMcGaughey sees things in practice that others may not notice. Hayne looks more comfortable every week. He’s starting to play faster and understand the game more — on offence and special teams.\n“It’s going to take a little time but eventually he’s going to get where he wants to be,” McGaughey says.\nWhere exactly that is, Hayne refuses to say. Is he happy just playing in the NFL — or does he want to be the type of star he was at Parramatta? After taking huge strides in his first 12 months, where will he be this time next year?\n“Who knows?” Hayne said. “I’m not worried about (where I’ll be in) 12 months. If I worried about where I was going to be in 12 months, 12 months ago, I wouldn’t be here, you know?”\nJump back to top\nsport breaking news 18:13 PM Live: Victoria closes on second spot 21:14 PM Heartache Hilton: Bulls down dogged CA XI 20:00 PM Giants unapologetic over Treloar, McCarthy 14:28 PM Fanning ‘upset’ by KFC’s shark attack ad 11:07 AM Proteas keeper equals Sachin Tendulkar", "external_links": ["http://cdn.newsapi.com.au/image/v1/external?url=http%3A%2F%2Fcontent4.video.news.com.au%2Ffoxsports%2Fprod%2Farchive%2F2015%2F10%2F15%2FDVU_151015_NFL_HAYNE_TRAINS_WITH_FIRST_TEAM_PKG.jpg&width=650&api_key=kq7wnrk4eun47vz9c5xuj3mc", "http://cdn.newsapi.com.au/image/v1/46cd05ad41a6e797334b646d27d3f46d", "http://cdn.newsapi.com.au/image/v1/external?url=http%3A%2F%2Fcontent4.video.news.com.au%2Ffoxsports%2Fprod%2Farchive%2F2015%2F10%2F12%2FDVU_1210_NFL_WING_PUNTS_TO_HAYNE_V2.jpg&width=650&api_key=kq7wnrk4eun47vz9c5xuj3mc", "http://cdn.newsapi.com.au/image/v1/origin:fatwire.", "http://cdn.newsapi.com.au/image/v1/0f45a03a9b11b02f81aab39f6a5031ca", "http://cdn.newsapi.com.au/image/v1/3bf34bd0b354828de0707e01159cedd5", "http://widgets.outbrain.com/outbrain.js"], "published": "2015-10-15T18:28:00.000+03:00", "crawled": "2015-10-20T17:48:56.544+03:00", "highlightTitle": ""}