{"organizations": [], "uuid": "5ca770ba655b6d0de3c7994abdde7b35fd1f32cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.denverpost.com", "main_image": "http://extras.mnginteractive.com/live/media/site36/2015/1013/20151013__Shawn-McCormack-life-sentence-child-pornography-kidnapping-charge~p1.jpg", "site_section": "http://www.denverpost.com/", "section_title": "Colorado Breaking News, Sports, Weather, Traffic, Jobs - The Denver Post", "url": "http://www.denverpost.com/news/ci_28963916/colorado-springs-man-gets-life-kidnapping-toddler-making", "country": "US", "title": "Colorado Springs man gets life for kidnapping toddler, making child porn", "performance_score": 0, "site": "denverpost.com", "participants_count": 1, "title_full": "Colorado Springs man gets life for kidnapping toddler, making child porn - The Denver Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T12:05:00.000+03:00", "replies_count": 0, "uuid": "5ca770ba655b6d0de3c7994abdde7b35fd1f32cd"}, "author": "Jesse Paul", "url": "http://www.denverpost.com/news/ci_28963916/colorado-springs-man-gets-life-kidnapping-toddler-making", "ord_in_thread": 0, "title": "Colorado Springs man gets life for kidnapping toddler, making child porn", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A Colorado Springs man was sentenced Tuesday to life in prison for kidnapping a toddler and using the child to produce child pornography, federal officials say.\nShawn McCormack, 31, was convicted in April 2015 by a federal jury in California of four counts of sexual exploitation of a child and two counts of kidnapping, the Department of Justice said in a news release.\nMcCormack feigned to be a friend of a couple in Bakersfield, Calif., where he would stay as an occasional overnight guest, prosecutors say.\n\"During several of the overnight stays, in the middle of the night, McCormack removed the couple's toddler from the house and sexually abused the toddler in nearby motels and other locations,\" the release said.\nHe would then returned the toddler to the house before the parents awoke, according to officials.\nMcCormack photographed and recorded the abuse and distributed the images and videos online, the release said, including to an undercover officer with the Toronto Police Services.\n\"McCormack also recorded his sexual abuse of a second toddler and distributed those images as well,\" according to the release.\nThe Gazette reports the abuse happened in 2009 and that McCormack was arrested in El Paso County in 2011 on a federal warrant.\n\"McCormack's depraved actions in this case are the stuff of nightmares,\" Assistant U.S. Attorney General Leslie R. Caldwell said in a statement.", "external_links": ["http://gazette.com/black-forest-man-accused-of-raping-infant/article/125324"], "published": "2015-10-13T12:05:00.000+03:00", "crawled": "2015-10-14T02:04:55.001+03:00", "highlightTitle": ""}