{"organizations": [], "uuid": "0b22a490cd3c39c0427bcd700876f868c45484f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports", "section_title": "Sports News, Scores, Schedules, Standings, Stats, Photos, Videos - MSN Sports", "url": "http://www.msn.com/en-us/sports/mma/ronda-rousey%e2%80%99s-next-fight-body-image-in-hollywood/ar-AAfi0CG", "country": "US", "title": "Ronda Rousey’s Next Fight: Body Image in Hollywood", "performance_score": 0, "site": "msn.com", "participants_count": 24, "title_full": "Ronda Rousey’s Next Fight: Body Image in Hollywood", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 29, "uuid": "3cf00079465a858516c44d89784f6ed748956c96"}, "author": "SHEILA MARIKAR", "url": "http://www.msn.com/en-us/sports/mma/ronda-rousey%e2%80%99s-next-fight-body-image-in-hollywood/ar-AAfi0CG#post-0", "ord_in_thread": 0, "title": "Ronda Rousey’s Next Fight: Body Image in Hollywood", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ronda Rousey’s Next Fight: Body Image in Hollywood The New York Times 17 hrs ago By SHEILA MARIKAR < PREVIOUS SLIDE SLIDE 1 of 5 NEXT SLIDE > Ms. Rousey's duality — she is both sweet and vicious — makes her intriguing to marketing and movie executives. © Jake Michaels for The New York Times LOS ANGELES — Once, while at a fitting for a television commercial, the mixed martial arts fighter Ronda Rousey received a bit of unwelcome feedback. She had been planning to lose a few pounds before filming, “but because somebody said something really rude to me, I came into the shoot purposely way heavier,” she recalled on a recent afternoon at her home in the beachside neighborhood of Venice, adding a few epithets for emphasis.\nAdChoices Did they dare question her?\n“Oh, hell no,” Ms. Rousey said with a grin, “and the campaign ended up being amazing, even though I was heavier just to make a point.” (For which company was the ad? She declined to say but noted, coyly, that her breasts are bigger in it than in any other commercial she’s done. A breakfast sandwich takes second billing to cleavage in her Carl’s Jr. ad .)\n“I swear to God,” she said, shaking her head, “if anyone calls me fat one more time in my life, I’m going to kill them.”\nAt one time, up-and-coming Hollywood personalities did not say such things. But Ms. Rousey, 28, a tight coil of muscle and moxie, is helping slake the entertainment industry’s sudden thirst for female feistiness. The first American woman to win an Olympic medal (bronze) in judo, she turned to mixed martial arts in need of a new challenge, and a reason to give up the drinking, smoking and pill-popping that seduced her after her success in Beijing in 2008.\nShe trained for the Ultimate Fighting Championship even though the U.F.C.’s president, Dana White, said he would never let a woman into the league.\nMs. Rousey’s prowess changed that — there are more than 50 women now — and since her 2013 debut, she has been undefeated in her weight class, overpowering and outwitting her opponents in the octagon with signature moves like the arm bar. Ms. Rousey’s specialty, which she learned from her mother, the former judo world champion AnnMaria De Mars, is designed to hyperextend her adversary’s elbow, leave her in a cast and, ideally, produce another victory.\nIn August, Ms. Rousey defeated her most recent opponent, Bethe Correia, in 34 seconds in Rio de Janeiro. After the fight, Ms. De Mars got into the ring and told her daughter that she should have finished off Ms. Correia faster.\n“She was very mad when I said I was going to draw out the fight,” Ms. Rousey said of her mother.\nHer Argentine mastiff, Mochi, trotted up to her knees; Ms. Rousey bent down to nuzzle the dog’s head. “But I did, I did kind of draw it out didn’t I, Mochi?” she cooed as Mochi started licking her face. “I could’ve gone to the ground a couple times, but I purposely kept it standing because I wanted to knock her out.”\nThis is the duality that makes Ms. Rousey so intriguing to marketing and moviemaking powers that be: She’s both sweet and vicious, able to break an arm one day and gyrate topless for a denim advertising campaign the next.\n“I found a contrast between what I’ve seen her do in the ring and this kind of hippie girl that lives in Venice and loves music and is very creative,” said Peter Berg, who is directing Ms. Rousey in the film “Mile 22” with Mark Wahlberg.\nShe plays a C.I.A. field operative in Indonesia desperate to return home to her daughter, a meatier role than Ms. Rousey’s small part in “Entourage” this past summer. “ ‘Mile 22’ will be an opportunity for her to stretch and find layers and levels as an actress that we haven’t seen yet,” Mr. Berg said.\nThe fighter has been taking acting classes for two years, and she is working with a fashion stylist. But to say she has adopted the glossy magazine version of a Hollywood lifestyle would be a stretch.\nMs. Rousey lives in an 800-square-foot bungalow that she shares with a roommate, Marina Shafir, another mixed martial arts fighter.\nTypical 20-something trappings were strewn across the apartment this particular morning: a magenta fleece blanket bunched up on the couch, a hookah in the corner of the living room, and clothes hanging from the rungs of a ladder that lead up, presumably, to Ms. Shafir’s loft bed. (One mark of celebrity: a video feed of four security cameras mounted on a wall.)\nMs. Rousey, who also has a loft bed, uses the entire lower half of her bedroom as a closet. She dug through it (“It’s kind of like, disheveled a little bit,” she said as an apology) to find the sports bra she wore for the fight with Ms. Correia, a prototype of a bra she’s working on with Reebok that can handle M.M.A.-caliber tussling and frenetic limb-grabbing.\n“We added silicone grip all over the bottom and inside the straps so they stay,” she said. “Girls in M.M.A. have lats and things like that that can spill out.”\nHer closet spills out into the garage, which includes a wall of Reebok shoes that she sometimes gives to guests if they’re a size 8½. Above it is a framed spread of a photo shoot she did for Vogue’s body issue in 2008, the year she won her Olympic medal, a high point in an upbringing marred by loss and struggle.\nWhen Ms. Rousey was 8, her father, suffering from a back injury that had become debilitating, committed suicide. He drove his Ford Bronco down to a nearby pond and threaded a hose from the tailpipe through the driver’s side window.\nTalking about him now, Ms. Rousey visibly shrinks. “I think about it all the time,” she said when asked what he would think about the woman she grew to be. “And I don’t know because I didn’t have the privilege of getting to know him as an adult. I feel like in eight years, it was not nearly enough time to get to know the kind of man he really was.”\nFighting gave her a focus through her teenage years, but struggling with weight limits for judo tournaments fostered a fraught relationship with food and, for a time, bulimia. Her body didn’t match the ideal she saw in men’s magazines, and going to school in Los Angeles, she would wear zip-up jackets even on 90-degree days.\n“I was afraid to show my big arms,” she said.\nSulking and self-loathing weren’t allowed at home, said Ms. Rousey’s oldest sister, Maria Burns Ortiz, a former sports journalist and a founder of a video game company who lives in Santa Monica., Calif. (Ms. Rousey has another older sister, Jennifer Rousey, and a younger sister, Julia DeMars.)\n“Whining was not really tolerated,” Ms. Burns Ortiz said. “We just kind of thought she was running around and doing judo all the time — that’s why she was in sweats.”\nIn 2012, Ms. Rousey posed nude (save for a set of carnation-pink hand wraps) on the cover of ESPN the Magazine. She has been in similarly sultry shoots for Maxim and the Sports Illustrated swimsuit issue, in part, she said, to embrace the body that used to embarrass her.\n“If I can represent that body type of women that isn’t represented so much in media, then I’d be happy to do that,” she said. “When women say that going on publications directed at men is somehow demeaning, I don’t think that’s true. I think that’s one really effective way to change the societal standard women are held to.”\nHere’s another: talking frankly about her weight. Ms. Rousey, who is 5 feet 7 and fights at 135 pounds, weighed 153 on this September day. She feels most attractive around 148. “That’s like my favorite weight,” she said. But she still likes to get a little bigger than that, sometimes, because she has to choose between the look of her abs and breasts. “You can’t have both,” she said.\nLast year, Buffalo Jeans signed her as a face of the brand. In photos and videos from her first Buffalo Pro shoot, Ms. Rousey looks like the girl next door, if the girl next door were really ripped, smiling playfully while revealing menacing midsection muscles in an unbuttoned denim shirt.\n“Frankly, that’s what we loved about her,” said Dari Marder, the chief marketing officer of Iconix Brand Group, which partly owns Buffalo. “She wasn’t supermodel size.”\nMs. Rousey cares about nice clothes. She wore a black-and-white dress with mesh and cutouts customized for her by Inas Couture to the ESPY Awards in July , where she received the best female athlete award as well as the ire of some fashion critics ( E! decreed her outfit “more club-worthy than red-carpet ready” ). Last week, on Jimmy Fallon’s show, she wore a House of CB dress with a neckline that nearly reached her navel.\nShe has a wish list of brands she would like to work with, including Helmut Lang (“they fit my body so well,” she said) and Stuart Weitzman. She admires the style of Beyoncé and Rihanna (“I don’t have the same coloring but I have the same outline,” she said). At the Made in America festival last month, Beyoncé gave Ms. Rousey her stamp of approval, playing an excerpt from a tirade Ms. Rousey went on in a U.F.C. video about what she calls “a kind of chick that just tries to be pretty and be taken care of by somebody else.”\n“We seem to be in this conflicting era for women, where women are doing so amazingly and taking over the athletic world, but we’re also in a time where — — ” Ms. Rousey said, and paused. “How can I really put it? That women without any skills that freeload are being glorified. That’s something I was raised not to be. That you’re supposed to contribute to the world, not consume from it.”\nMs. Rousey doesn’t shy away from trash-talking her opponents (the hyping of a U.F.C. fight is as integral to the league as the fight itself), and she laps up the adoration of her fans, who send her renderings of herself as Captain Marvel and the Joker, the comic book character she identifies with the most. Raised Roman Catholic, she took the confirmation name Joan of Arc to receive the sacrament “because St. Joan of Arc was the only girl saint that killed and kicked ass on her way to martyrdom. I was like, ‘Go Joan!’ ”\nReal-life corollaries are harder to come by for Ms. Rousey. David Carter, the executive director of the Sports Business Institute at the University of Southern California Marshall School of Business, said that while the fighter shares the girl-power infectiousness of Serena Williams, “I don’t think you can compare her to Serena or any other female athlete who has worked their way up through a male-dominated sport,” adding that Ms. Rousey’s sport “provides her a very unique platform.”\nMs. Rousey staggers photo shoots around fights, running the risk, however slight considering her perfect record in 12 mixed martial arts bouts , of walking onto a set in a cast. She itches for more time with her trainer Edmond Tarverdyan, who made her take 20 days off after her fight against Ms. Correia. In early September, she was training every other day in preparation for her match next month against Holly Holm in Melbourne, Australia.\n“That’s the thing I’m worst at, resting,” Ms. Rousey said. “I have to be forced to do it. Sometimes I think of loopholes. ‘Oh, I’m just going for a walk, up a dune that’s 45 degrees, but I’m walking, so it’s not a workout.’ ”\nHer next major film project, after “Mile 22,” is an adaptation of “My Fight/Your Fight,” the memoir she wrote with Ms. Burns Ortiz. Ms. Rousey will play herself for the bulk of the movie, which she described as “a mix between ‘8 Mile’ and ‘Rocky.’ ” She plans to take improvisational acting classes and help cast a younger version of herself.\nShe wants to be as good in this arena as she is in the octagon, but as she bent over to pop the joints in the toes of her right foot, which was sore from a day of shooting with Reebok and elevated on a WrestleMania folding chair, she turned back to what got her here in the first place.\n“I can’t do it forever, but I’ll do it for as long as I can,” she said. “People call me a whole lot of things, but above anything else, I’m a fighter, and it’s going to be hard to accept an identity without that.”\nGo to MSN Home", "external_links": ["http://www.eonline.com/news/676681/best-worst-dressed-at-the-2015-espy-awards-ciara-hannah-davis-more", "http://www.youtube.com/watch?v=5UV9-AL2JtQ", "http://www.nytimes.com/video?partner=msft_msn", "http://www.nytimes.com/2015/08/04/fashion/when-will-fashion-discover-ronda-rousey.html?_r=0", "http://www.ufc.com/fighter/Ronda-Rousey", "http://www.youtube.com/watch?v=qI2YwwTDr5w", "http://www.inascouture.com/", "http://go.microsoft.com/fwlink/?LinkID=286759"], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-10T14:22:21.616+03:00", "highlightTitle": ""}