{"organizations": [], "uuid": "385715c88ae66263e8d5cc4b811ead5210e14fe0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/49431136.cms", "site_section": "http://timesofindia.indiatimes.com/Sports/More-sports/Snooker/Billiards/articlelist/3413193.cms", "section_title": "Snooker/Billiards - More sports - Sports - The Times of India", "url": "http://timesofindia.indiatimes.com/world/middle-east/Iran-rejects-criticism-of-its-missile-test/articleshow/49431127.cms", "country": "IL", "title": "Iran rejects criticism of its missile test", "performance_score": 0, "site": "indiatimes.com", "participants_count": 3, "title_full": "Iran rejects criticism of its missile test - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T01:22:00.000+03:00", "replies_count": 2, "uuid": "385715c88ae66263e8d5cc4b811ead5210e14fe0"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/world/middle-east/Iran-rejects-criticism-of-its-missile-test/articleshow/49431127.cms", "ord_in_thread": 0, "title": "Iran rejects criticism of its missile test", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "TEHRAN: Iran said on Saturday that its recent test launch of a long-range missile does not violate UN Security Council resolutions as claimed by the United States and France.\n\"Our missile tests have nothing to do with Resolution 2231, which only mentions missiles designed to carry nuclear warheads,\" Iranian foreign minister Mohammad Javad Zarif told a news conference.\nSpeaking in Tehran alongside his German counterpart Frank-Walter Steinmeier, he added: \"None of the Islamic Republic of Iran's missiles have been designed for nuclear capabilities.\"\nIran announced Sunday it had successfully tested a new domestically produced long-range missile without specifying its exact range.\nDefence minister Hossein Dehghan said the new missile \"can be guided and controlled until hitting the target.\"\nThe US ambassador to the UN Samantha Power on Friday said the missile launched by Iran is a \"medium-range ballistic missile inherently capable of delivering a nuclear weapon\".\n\"This was a clear violation of UN Security Council Resolution 1929,\" she said, echoing similar criticism from the French foreign ministry, adding that the US would seek action at the Security Council.\nResolution 1929 prohibits Tehran from conducting ballistic missiles tests.\nResolution 2231, which was adopted a few days after Iran struck the July 14 landmark nuclear deal with world powers, bars Iran from developing missiles \"designed to carry nuclear warheads\".\nThe nuclear deal reached with Britain, China, France, Germany, Russia and the United States aims to limit Iran's nuclear program in return for lifting international sanctions.\nIran insists it has no plans to develop atomic weapons.\nZarif told the news conference that \"nuclear weapons have no place in the military doctrine of Iran\" and said that the missile programme of the Islamic republic does not violate UN resolutions. Stay updated on the go with Times of India News App. Click here to download it for your device.", "external_links": ["https://play.google.com/store/apps/details?id=com.toi.reader.activities"], "published": "2015-10-18T01:22:00.000+03:00", "crawled": "2015-10-17T17:08:41.025+03:00", "highlightTitle": ""}