{"organizations": [], "uuid": "497ce108d6b8e076877154eff83f199a267b59f4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "buckeyextra.dispatch.com", "main_image": "http://buckeyextra.dispatch.com/content/graphics/ohio-state-all-purpose/ohio-state-block-o-and-football.jpg", "site_section": "http://dispatch.com//content/syndication/sports_osu.xml", "section_title": "The Columbus Dispatch OSU Sports Feed", "url": "http://buckeyextra.dispatch.com/content/stories/2015/10/05/osu-football-insider-1005.html", "country": "US", "title": "Ohio State football insider | Buckeyes' offensive consistency still missing in action", "performance_score": 0, "site": "dispatch.com", "participants_count": 1, "title_full": "Ohio State football insider | Buckeyes' offensive consistency still missing in action | Buckeye Xtra Sports", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T23:40:00.000+03:00", "replies_count": 0, "uuid": "497ce108d6b8e076877154eff83f199a267b59f4"}, "author": "The Columbus Dispatch", "url": "http://buckeyextra.dispatch.com/content/stories/2015/10/05/osu-football-insider-1005.html", "ord_in_thread": 0, "title": "Ohio State football insider | Buckeyes' offensive consistency still missing in action", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "25 words or fewer \n\nThere’s Zeke, there’s the streaks, there’s Zeke and his streaks. There also are squeaks as the top-ranked Buckeyes nevertheless keep winning. \n\nIn the polls \n\nOhio State, which has won a nation’s-best 18 straight games and 25 straight regular-season Big Ten games, tied Oklahoma for the most weeks ever at the top of the Associated Press poll at 101 when the Buckeyes clung to No.1 on Sunday despite the close call at Indiana. The Buckeyes also remained No.1 in the coaches’ poll. In both they lost No.1 votes, though, going from the first team to be the unanimous No.1 in the AP preseason poll in August to seeing just 38 of the 61 media voters put them No.1 on Sunday. Meanwhile, Texas Christian replaced Michigan State at No.2 in both polls. \n\nWho’s hot? \n\nEzekiel Elliott, the running back known as Zeke. His touchdown streaks of 55, 65 and 75 yards were the pilings of a 274-yard day, tied for second best in Ohio State history with Keith Byars behind Eddie George’s 314 against Illinois in 1995. It also boosted Elliott’s 100-yard game streak to 10. He’s nowhere close to two-time Heisman Trophy winner Archie Griffin’s NCAA record streak of 31, but with four games overall in the 200s, Elliott is second in school history to George’s five.\n\nWhat’s not hot? \n\nOffensive consistency, but that’s been the refrain all season. The Buckeyes unapologetically thrive on the big play, but the meat-and-potatoes possessions have been few and far between, primarily because of inconsistency in the passing game and turnovers, a trend which coach Urban Meyer called “alarming.” OSU is tied for 101st in the country in turnover margin at minus-0.80. Receiver Jalin Marshall had two lost fumbles on Saturday, and quarterback Cardale Jones tossed another interception. \n\nWhat went right? \n\nThe defense put the shackles on the fast-starting Hoosiers midway through the game after watching leading rusher Jordan Howard limp off in the second quarter with an ankle sprain and starting quarterback Nate Sudfeld do the same in the third. But then the Buckeyes forgot that backup quarterback Zander Diamont could run — his stunning 79-yard keeper for a TD in the fourth quarter put the Hoosiers within striking distance. But the defense rose on the last possession to stop four tries from inside the 10-yard line for the tying TD, with cornerback Eli Apple knocking away the last pass attempt in the back of the end zone. \n\nBack to the drawing board \n\nMeyer said he wants to get the ball to Braxton Miller more often, reflecting immediately after Miller’s two-touch game. But Miller netted just 5 yards on his two chances. In the past three games, he has had nine carries for 35 yards and three catches for 18. Since the red-hot start at Virginia Tech, the magic has waned considerably.\n\nDinged up \n\nCorey Smith, a big part of the receiver rotation and a rising star on special teams, was lost for the season with a serious left leg injury. Linebacker Raekwon McMillan went into the game dealing with a migraine, and he wound up leading the team in tackles with 14 before being replaced by Camren Williams.\n\nCatch that? \n\nThe Buckeyes were penalized 109 yards at Indiana, with several of those flags blunting strong offensive or defensive efforts. Ohio State is the 29th-most penalized team in the country, averaging 70.40 yards per game. But then, second-ranked TCU is 16th in that category (80.40), and fourth-ranked Baylor leads the nation in penalty yards (103.75). Third-ranked Michigan State is being penalized a mere 41.40 yards per game.\n\nUp next \n\nMaryland, which was owned by Michigan on Saturday. The Terrapins, beaten 45-6 by West Virginia the game before, were shut out 28-0 by the Wolverines. Coach Randy Edsall is dealing with a quarterback conundrum because starter Caleb Rowe has been ineffective (three interceptions against Michigan) and replacement Daxx Garman has been little better. The Terps are 114th nationally in total offense (332.4).\n\nThis week’s challenge \n\nCritics are getting louder. The Buckeyes’ promised offensive fireworks package has dissolved into the hand-it-to-Zeke-and-watch-him-streak show. Maryland is 109th in the country in total defense, so there will be no excuse for the Buckeyes stumbling on offense again on Saturday.\n\ntmay@dispatch.com \n\n@TIM_MAYsports", "external_links": [], "published": "2015-10-04T23:40:00.000+03:00", "crawled": "2015-10-05T04:06:48.826+03:00", "highlightTitle": ""}