{"organizations": [], "uuid": "6de7d9d56b3fc1b82bc43fd7f12a068aeb43fe50", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cairnspost.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/external?url=http://content4.video.news.com.au/foxsports/prod/archive/2015/10/10/DVU_V8S_BATHURST_SHOOTOUT_HIGHLIGHTS.jpg&width=650&api_key=kq7wnrk4eun47vz9c5xuj3mc", "site_section": "http://feeds.news.com.au/public/rss/2.0/cpost_news_sport_3328.xml", "section_title": "CairnsPost | Sports", "url": "http://www.cairnspost.com.au/sport/bathurst-1000-david-reynolds-secures-pole-position-in-wet-top-10-shootout-for-endurance-classic/story-fnjpuwrj-1227564198688?from=public_rss", "country": "IL", "title": "Reynolds on pole after wet and wild Shootout", "performance_score": 0, "site": "cairnspost.com.au", "participants_count": 0, "title_full": "Reynolds on pole after wet and wild Shootout", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T11:32:00.000+03:00", "replies_count": 0, "uuid": "6de7d9d56b3fc1b82bc43fd7f12a068aeb43fe50"}, "author": "", "url": "http://www.cairnspost.com.au/sport/bathurst-1000-david-reynolds-secures-pole-position-in-wet-top-10-shootout-for-endurance-classic/story-fnjpuwrj-1227564198688?from=public_rss", "ord_in_thread": 0, "title": "Reynolds on pole after wet and wild Shootout", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["David Reynolds"], "text": "V8S: Check out the highlights from the Bathurst 1000 Top 10 Shootout laps. Fox Sports Sport/Motor Sport/V8 David Reynolds romped to pole position for the 2015 Bathurst 1000. Source: Supplied \nDAVID Reynolds produced the perfect morale boost for Prodrive Racing, splashing to pole position for the Bathurst 1000 in a very wet Top 10 Shootout. \nA torrential downpour left Mount Panorama soaking wet by the time the cars began rolling out onto the circuit one by one, Reynolds’ turn to race the clock coming when conditions were near their best. \nScroll down for reports from Qualifying and Practice 6 plus a blow-by-blow blog of the day’s action. David Reynolds put his #55 Falcon on pole for the Bathurst 1000. Source: Getty Images \n“I might’ve got lucky with the conditions but I tried to put a good lap in,” he said. “It was safe and it was fast.” \nIt was also over a second clear of anything any of his rivals could manage. \nReynolds was third out of the gate and had a nervous wait while six drivers tried and failed to beat his mark, the final chequered flag sparking jubilant scenes in the Prodrive Racing garage just 24 hours after Chaz Mostert’s horrifying crash. \nMostert himself was even part of the celebrations - by proxy. As Reynolds and co-driver Dean Canto posed for the obligatory victor’s photos, team principal Tim Edwards phone produced a picture of Mostert giving a double thumbs-up from his hospital bed. Mostert gives thumbs-up from hospital bed after Reynolds took pole. Source: AAP \nScott McLaughlin will start alongside Reynolds on the front row, with Jason Bright and Lee Holdsworth filling row two, while first man out James Moffat jumped five spots to end the session fifth. \nThe rain returned half-way through the session, Shane van Gisbergen turning on his well-renowned wet-weather skills to be the best of those with the worst conditions in sixth. \nScott Pye was next from Jamie Whincup, while Fabian Coulthard slipped down from provisional pole for the second year in a row to start Sunday’s race from ninth, with Tim Slade rounding out the top ten. \nHere’s how the Shootout went down. JAMES MOFFAT - 2m30.0084s, P5 \nMoffat was the pioneer, tiptoeing around Hell Corner and lighting the tyres up on the exit with wheelspin. He was very cautious from there, the No.99 Altima twitching and drifting as he scrabbled for grip. It’s a solid lap that proves better than most will manage. \n1m01.2998s for Sector 1 (5th)0m41.5117s for Sector 2 (4th)0m47.1969s for Sector 3 (4th) Moffat's Bathurst 1000 Top 10 Shootout 2:45 \nV8: Ride on-board with James Moffat for his Top 10 Shootout lap at the V8 Supercars Bathurst 1000. Fox Sports Sport/Motor Sport/V8 LEE HOLDSWORTH - 2m29.8139s, P4 \nVery very sideways through Griffins Bend but ultra smooth across the top. Slower to Forrest’s Elbow than Moffat but more than makes up for it on the run down the hill. Provisional pole after two runners. \n1m01.2119s for Sector 1 (4th)0m42.1770s for Sector 2 (8th)0m46.4250s for Sector 3 (2nd) Holdsworth's Bathurst 1000 Top 10 Shootout 2:45 \nV8: Ride on-board with Lee Holdsworth for his Top 10 Shootout lap at the V8 Supercars Bathurst 1000. Fox Sports Sport/Motor Sport/V8 DAVID REYNOLDS - 2m27.8201s, P1 \nSquirming under acceleration to start the lap, Reynolds is pinpoint accurate between the white lines on the run up the hill. A wiggle on the entry to the Chase doesn’t stop him from heading to the top of the provisional order by two seconds. \nReynolds: “I think it’s the first time I’ve ever been around here in the wet.” \n1m00.3218s for Sector 1 (fastest)0m41.2932s for Sector 2 (3rd)0m46.2051s for Sector 3 (fastest) Reynolds' Bathurst 1000 Top 10 Shootout 2:48 \nV8: Ride on-board with David Reynolds for his Top 10 Shootout lap at the V8 Supercars Bathurst 1000. Fox Sports Sport/Motor Sport/V8 SCOTT McLAUGHLIN - 2m28.9746s, P2 \nSuper smooth through Griffins and the Cutting but it doesn’t count on the stopwatch. He’s down on Reynolds by 0.7s at Sector 1, but pegs back a couple on the run to the top of Conrod before stopping the clocks over a second shy of the Falcon. \nMcLaughlin: “I’m just trying to bring it home mate. We’ve got bigger things that we’re trying to achieve tomorrow.” \n1m01.0841s for Sector 1 (2nd)0m41.0879s for Sector 2 (fastest)0m46.8026s for Sector 3 (3rd) McLaughlin's Bathurst 1000 Top 10 Shootout 2:40 \nV8: Ride on-board with Scott McLaughlin for his Top 10 Shootout lap at the V8 Supercars Bathurst 1000. Fox Sports Sport/Motor Sport/V8 JASON BRIGHT - 2m29.7006s, P3 \nNot a great exit from Murrays, then flirts more than most with the exit kerb at Hell. He too is seven tenths off Reynolds but is quicker than the green Falcon across the top. A conservative run through the chase nets him provisional third, the rain starting again just as he crosses the finish line. \n1m01.0865s for Sector 1 (3rd)0m41.1098s for Sector 2 (2nd)0m47.5043s for Sector 3 (7th) Bright's Bathurst 1000 Top 10 Shootout 2:37 \nV8: Ride on-board with Jason Bright for his Top 10 Shootout lap at the V8 Supercars Bathurst 1000. Fox Sports Sport/Motor Sport/V8 SCOTT PYE - 2m31.6312s, P7 \nPye’s wet tyres have been scrubbed of their waxy coating during the preceding qualifying session, but wetter weather means he’s unable to make good use of them. He’s conservative out of the Cutting and then gets crossed up most of the way to Reid Park. The lap doesn’t improve from there, leaving him slowest of all to that point. \nPye: “We just struggled getting up front temperature. We just lost so much time getting into the corner. I don’t know if it was raining more, but we just had no front (grip) at all. It’s cool to have this place to yourself for one lap, that’s for sure.” \n1m02.0218s for Sector 1 (8th)0m42.1628s for Sector 2 (7th)0m47.4466s for Sector 3 (5th) Pye's Bathurst 1000 Top 10 Shootout 2:46 \nV8: Ride on-board with Scott Pye for his Top 10 Shootout lap at the V8 Supercars Bathurst 1000. Fox Sports Sport/Motor Sport/V8 JAMIE WHINCUP - 2m32.0536s, P8 \nThe track is markedly wetter for Whincup’s lap and it shows on the stopwatch. The car fights him on the exit of the Cutting and he locks the fronts over the kerb at the Esses. Slowest of all so far. \nWhincup: “It was a big lap. No grip, just no grip. If it’s like this tomorrow we’re in big trouble.” \n1m02.5284s for Sector 1 (9th)0m41.8716s for Sector 2 (5th)0m47.6536s for Sector 3 (8th) Whincup's Bathurst 1000 Top 10 Shootout 2:41 \nV8: Ride on-board with Jamie Whincup for his Top 10 Shootout lap at the V8 Supercars Bathurst 1000. Fox Sports Sport/Motor Sport/V8 TIM SLADE - 2m34.7168s, P10 \nOne of the smoothest of all out of Hell, the rears light up at his next gearchange, hurting his run up the hill. He’s 2.4s down at the first split and never recovers. He’s slowest of all to the exit of the Elbow and brings it home slowest of all to that point. The conditions are noticably worse up the top compared to earlier in the session. \n1m02.7846s for Sector 1 (10th)0m43.6779s for Sector 2 (10th)0m48.2543s for Sector 3 (10th) Slade's Bathurst 1000 Top 10 Shootout 2:44 \nV8: Ride on-board with Tim Slade for his Top 10 Shootout lap at the V8 Supercars Bathurst 1000. Fox Sports Sport/Motor Sport/V8 SHANE VAN GISBERGEN - 2m30.8456s, P6 \nWide at Hell to start the lap, he looks ultra smooth but is still a second down on Reynolds at the first split. He’s spectacular across the top, brushing the mirror at Sulman Park and drifting out of McPhillamy and the Dipper. He can do no better than sixth, but faster than any of the three drivers that immediately preceded him. \n1m01.3565s for Sector 1 (6th)0m42.0409s for Sector 2 (6th)0m47.4482s for Sector 3 (6th) Van Gisbergen's Bathurst 1000 Top 10 Shootout 2:36 \nV8: Ride on-board with Shane van Gisbergen for his Top 10 Shootout lap at the V8 Supercars Bathurst 1000. Fox Sports Sport/Motor Sport/V8 FABIAN COULTHARD - 2m32.1246s, P9 \nFor the second year running Coulthard doesn’t convert provisional pole to P1 but the conditions were stacked well against him. He’s sideways on opposite lock - one handed! - up the hill but is 1.2s down by the first split. He comes home with a lap that is ninth by the stopwatch but among the best ranked by bravery. \n1m01.5316s for Sector 1 (7th)0m42.6657s for Sector 2 (9th)0m47.9273s for Sector 3 (9th) Coulthard's Bathurst 1000 Top 10 Shootout 2:38 \nV8: Ride on-board with Fabian Coulthard for his Top 10 Shootout lap at the V8 Supercars Bathurst 1000. Fox Sports Sport/Motor Sport/V8 \nQUALIFYING REPORT \nMOTHER nature rained on Prodrive’s parade when it came time for V8 Supercars qualifying at the Bathurst 1000. \nFabian Coulthard led an all-Holden top four, topping the session with a 2m06.1 from Shane van Gisbergen, Tim Slade and Jamie Whincup, with Scott Pye, Jason Bright, Scot McLaughlin, David Reynolds, Lee Holdsworth and James Moffat all advancing to the Top 10 Shootout. \nRains arrived just before the halfway mark of the rescheduled session, leaving some of the biggest contenders standing on the outside looking in. \nMark Winterbottom ended the session in 14th, having been on his second flying lap when the showers arrived. Mark Winterbottom missed out on a place in the Top 10 Shootout at the Bathurst 1000. Source: News Corp Australia \n“What do yo do, you know?” he said. \n“We probably missed the window by about five seconds or something, because up through the cutting we were eight tenths up. \n“I was on for a ‘five’ and the rain comes down, and you either stick it in the fence, or just count your losses. \n“But 14th’s alright, we’ll bounce back tomorrow, but for me the best part of Bathurst is the Shootout and we’ll be a spectator.” \nCraig Lowndes ended up one spot behind him, with Holden Racing Team stars Jack Perkins and Garth Tander ending up 17th and 22nd. \nThe curveball of the rain has resulted in a mixed top 10, with six Holdens to be joined by just two Fords, a Volvo and a Nissan in the Shootout. Mark Winterbottom & Lowndes miss top 10 shootout 0:45 \nV8S: Mark Winterbottom and Craig Lowndes have missed out on qualifying for the top 10 shootout, with Fabian Coulthard qualifying fastest. Fox Sports Sport/Motor Sport/V8 \nPRACTICE 6 REPORT \nFABIAN Coulthard has asserted his credentials as the chief contender for pole position for the Bathurst 1000, topping the final practice session ahead of V8 Supercars qualifying at Mount Panorama. \nWe didn’t quite see the Hollywood laptimes of Friday, when Jamie Whincup set a blistering 2m04s lap in the afternoon, but not for a want of trying, though. \nCoulthard was faster than Whincup’s record setting pace to the first sector, then just 0.16s down at the top of Conrod before encountering traffic at the Chase. Fabian Coulthard was the fastest driver in Practice 6 at the Bathurst 1000. Source: News Corp Australia \nNonetheless, the flying Kiwi still managed his fastest ever lap of Mount Panorama with a 2m05.2119s. \n“I’m not sure who was in the car, but I was flashing my lights at them down Conrod asking them to please be nice get out of my way, but they were on a lap too,” he said. \n“I’d like that lap record back, so I was trying pretty hard. \n“I’ve been working pretty hard with Phil my engineer and the boys to try and make it better. \n“It’s still not perfect; I don’t think you’ll ever get a perfect car around here, but I wouldn’t mind one. \nCoulthard ended the session 0.17s ahead of Mark Winterbottom, with Scott Pye setting a 2m05.5095s lap at the mid-point of the session that held for third overall. Bathurst 1000, Practice 6: Fabian Coulthard fastest again 1:36 \nMotorsport: Fabian Coulthard maintained his strong run of form at the Bathurst 1000 to top practice six at Mount Panorama. Fox Sports 10 Oct 2015 Sport/Motor Sport/V8 \nShane van Gisbergen, David Reynolds, Jason Bright, Garth Tander, Scott McLaughlin, Andre Heimgartner and James Moffat rounding out the top 10. \nThe rescheduled 40 minute session concluded largely without incident, save for a few small spins as drivers took cars out on simulation runs ahead of Saturday afternoon’s qualifying sessions. \nAsh Walsh spun his Wendy’s-backed Erebus at Hell Corner forcing Lee Holdsworth to take evasive action, the No.18 Holden lightly brushing the wall but incurring no damage. \nNeither of the Red Bulls showed their strength in that session, Whincup and Craig Lowndes ending it down in 18th and 20th, while Simona de Silvestro logged her first lap in the 2m08s of the weekend.", "external_links": [], "published": "2015-10-10T11:32:00.000+03:00", "crawled": "2015-10-10T11:58:30.173+03:00", "highlightTitle": ""}