{"organizations": [], "uuid": "29c03bd4cb2fe7c63d0a477cf206d14307a8631e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/49205257.cms", "site_section": "http://timesofindia.indiatimes.com/sports/Copa-America-2015/articlelist/47642055.cms", "section_title": "Top Stories - Copa America 2015 - Football - Sports - The Times of India", "url": "http://timesofindia.indiatimes.com/city/bhubaneswar/E-FIR-system-launched-in-Odisha/articleshow/49205183.cms", "country": "IL", "title": "E-FIR system launched in Odisha", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "E-FIR system launched in Odisha - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T21:44:00.000+03:00", "replies_count": 0, "uuid": "29c03bd4cb2fe7c63d0a477cf206d14307a8631e"}, "author": "Debabrata Mohapatra", "url": "http://timesofindia.indiatimes.com/city/bhubaneswar/E-FIR-system-launched-in-Odisha/articleshow/49205183.cms", "ord_in_thread": 0, "title": "E-FIR system launched in Odisha", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BHUBANESWAR: Nearly fifteen months after dry run, the Odisha police on Saturday launched its ambitious 'e-FIR' system under the Centre-sponsored Crime and Criminal Tracking Network and Systems (CCTNS) project.\nChief minister Naveen Patnaik inaugurated the system, which enables tech-savvy people to send their complaints to police in all districts through online. All the 531 police stations in the state have been computerized to receive complaints through online.\n\"By browsing www.citizenportal-op.gov.in, people can avail services like lodging of complaints, request for FIR copy, verification of tenants, applying for procession licence, permission for protest/strike, character certificate request, employee verification, request for lost property and complain about missing persons,\" ADG and director of state crime records bureau B Radhika said. \"There is a link of 'citizen portal' on the home page of the website of Odisha police (www.odishapolice.gov.in) from where people can avail the services,\" Radhika said.\nPolice said complainants will have to create their user IDs and furnish personal details before filing complaints. Soon after lodging their FIRs, the complainants will be asked to visit concerned police stations to complete some official formalities for further investigation. Complainants would be able to track the progress in their cases online.\nNon-registration of complaints by the police has been one of the common complaints, plaguing the Odisha police of late. The other accusations include harassment by rude cops and bribe to accept complaints.\n\"Online complaint registration is a people-friendly initiative. But I think it will help only a particular section of people, who are tech-savvy. Poor and illiterate people will not be benefited. The government should ensure these people are not harassed during manual registration of cases at police stations,\" said High Court lawyer Bibhu Prasad Tripathy.\nPolice drew flak for failure of a women-friendly project—ICLIK—(Instant Complaint Logging Internet Kiosk) for women, which was launched on January 28, 2014. Police have so far received not more than ten complaints. ICLIK, an ATM lookalike device installed inside an ATM booth in Saheed Nagar, encourages women to instantly lodge their grievances without immediately visiting the police stations. The machine is having touch screen interface, GPRS connectivity, an inbuilt camera, microphone, scanner and a printer where complaints can be filed in three modes—by online filing, voice recording and document scanning. Once the complaint is registered, the same would be transferred to a central server, located at the DCP office and subsequently to police stations for further action. ", "external_links": ["https://play.google.com/store/apps/details?id=com.toi.reader.activities"], "published": "2015-10-03T21:44:00.000+03:00", "crawled": "2015-10-03T12:06:50.868+03:00", "highlightTitle": ""}