{"organizations": [], "uuid": "bf2c506384e12deef40ab274f7749ca561114e14", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newstribune.com", "main_image": "http://jeffcity.media.clients.ellingtoncms.com/static/newstribune/images/news-tribune90x90.jpg", "site_section": "http://newstribune.com//rss/headlines/sports/", "section_title": "newstribune.com stories: Mid-Missouri and National Sports", "url": "http://www.newstribune.com/news/2015/oct/16/prep-football-helias-treating-tonights-game-sulliv/", "country": "US", "title": "Prep Football: Helias treating tonight’s game at Sullivan as start of the postseason", "performance_score": 0, "site": "newstribune.com", "participants_count": 1, "title_full": "Prep Football: Helias treating tonight’s game at Sullivan as start of the postseason", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T10:35:00.000+03:00", "replies_count": 0, "uuid": "bf2c506384e12deef40ab274f7749ca561114e14"}, "author": "Tom Rackers", "url": "http://www.newstribune.com/news/2015/oct/16/prep-football-helias-treating-tonights-game-sulliv/", "ord_in_thread": 0, "title": "Prep Football: Helias treating tonight’s game at Sullivan as start of the postseason", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Download podcast \nSullivan (5-3) will bring a three-game winning streak into the 7 p.m. contest. \n“They look a little more human on film, they don’t have the size of some of the teams we’ve seen this year,” Rulo said. “You have to take care of business when you play someone in your classification. \n“We’ve shown glimpses of it against the bigger schools, now we need to do it on every play, every drive, every series against the Class 4 schools.” \nThe Eagles offense, which scored a season-high 41 points last week in a 10-point win against Owensville, operates out of a double-wing formation. That means Sullivan likes to run the football. Run it a lot as the Eagles have 326 carries as a team this season to just 44 passes. \nSullivan quarterback Caleb Pryor (6-foot-2, 200 pounds, jr.) tops the Eagles with 752 yards (5.9 avg.) while scoring four touchdowns. \n“He’s a physical specimen,” Rulo said. “Not many quarterbacks wear gloves on both hands, but he does, so you figure he’s going to run it. But he does throw a nice ball when he does throw it.” \nTroy Creek (5-10, 200 jr.) is next with 531 yards (6.2 avg.) and a Four Rivers Conference best 13 touchdowns. Nathan Johnson (6-0, 180 sr.) has 361 rushing yards (5.6 avg.), while Dylan Harmon (5-4, 180 sr.) has 267 yards (7.4 avg.). \n“(Harmon) kind of hides behind the line and sneaks out down the field,” Rulo said. \nJohnson leads the Eagles with six catches for 279 yards (46.5 avg.) and three TDs. \nIn its five wins this season, Sullivan has allowed a total of 80 points. In the three losses, that total is 116. \nThe Eagles have racked up 18 sacks and nine interceptions. Harmon tops the team with 77 total tackles (46 solo). \n“They really try to be physical,” Rulo said. “The linebackers get right behind the line, it looks like a huge defensive line up there. You have to be ready for that.” \nThe Eagles will have to be ready for a Crusader offense coming off an impressive performance last Friday at Rockhurst. The Crusaders ran 70 plays against the Hawklets and scored 25 points in a 10-point loss. \n“We saw the complete offense,” Rulo said. “You always want to score more points and get the W, but we did a lot of good things.” \nThe play of backup quarterbacks Curtis Campbell and Chandler Luebbert had something to do with those good things. The two, pressed into service after an injury to starter Alex Faddoul, combined to help the Crusaders rack up 331 yards. \n“I was really proud of the way they played,” Rulo said. “The best thing is they still have things to improve on and that’s great because that means they can play even better.” \nThe two spent the season trying to master the offense on the JV level. That’s why they didn’t step in immediately when Faddoul was injured in the Jamboree. \n“At the beginning of the year, I told them I did not want to put them in their first varsity game in a new offense in Week 1,” Rulo said. “I think they showed the experience they’ve gotten throughout the season in practice and in JV games.” \nControlling the ball tonight could be key on several levels. \n“It helps us feel more comfortable on offense and it keeps our defense off the field and gives them a chance to rest,” Rulo said. “Sullivan is a team that can hold it for 6-7 minutes. You may not get that many chances against them, so you’d better get some points when you can.” \nThe Crusaders are getting some reinforcements at the running back position. \nAlex Werner, limited to defense only last week, could see snaps on offense. Jake Burnett will return at running back and at linebacker after missing last week with an injury, while Malik Davis is returning after missing the past four games. \n“Now we’ve got a stable of guys and we need to figure out what each of them can do offensively,” Rulo said. \nThe Crusaders have had their ups and downs playing one of the toughest schedules in the state this season. Now Rulo wants his team to put that experience to good use. \n“It’s what we’ve learned from that experience,” he said. “If we didn’t learn anything from it, the hard schedule doesn’t mean anything. But I think we learned from it and I’m excited to see what we can do when we play Class 4 schools the rest of the way.” \nNotes: The Crusaders were nearly at full strength in practice this week, Rulo said. Luebbert will get the start at quarterback. Campbell will miss the game with a knee injury he suffered against Rockhurst and Faddoul will sit again this week. … Weston Porter, a senior co-captain, continues to get healthier and may return sometime in the postseason. … In addition to Owensville, Sullivan has defeated Washington (26-21), Union (33-7), Hermann (21-14) and St. James (21-7). The Eagles have lost to Park Hills Central (52-14), St. Clair (34-13) and Pacific (30-27). … Helias currently is fourth in the Class 4 District 7 standings behind Hannibal, Mexico and Warrenton. With one week to go, Helias would host Wentzville: Liberty in the district opener. \nHelias at Sullivan - Updates on Twitter: @tjrackers \nPodcast", "external_links": [], "published": "2015-10-16T10:35:00.000+03:00", "crawled": "2015-10-16T11:15:11.384+03:00", "highlightTitle": ""}