{"organizations": [], "uuid": "b84e6bff0c0705de6a87260f818116063cd4643f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "accesswdun.com", "main_image": "http://images.accesswdun.com/uploads/articles/2015/344773/matt-kenseth-10-24_p3.jpg", "site_section": "http://accesswdun.com/rss/3/rss.xml", "section_title": "AccessWDUN.com Sports", "url": "http://accesswdun.com/article/2015/10/344773/kenseth-isnt-buying-loganos-explanation-from-kansas", "country": "US", "title": "Kenseth isn’t buying Logano’s explanation from Kansas", "performance_score": 0, "site": "accesswdun.com", "participants_count": 1, "title_full": "Kenseth isn’t buying Logano’s explanation from Kansas", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T16:00:00.000+03:00", "replies_count": 0, "uuid": "b84e6bff0c0705de6a87260f818116063cd4643f"}, "author": "Reid Spencer-NASCAR Wire Service", "url": "http://accesswdun.com/article/2015/10/344773/kenseth-isnt-buying-loganos-explanation-from-kansas", "ord_in_thread": 0, "title": "Kenseth isn’t buying Logano’s explanation from Kansas", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Saturday October 24th, 2015 8:59PM Posted 8:00AM on Saturday 24th October 2015 ( 12 hours ago ) Kenseth isn’t buying Logano’s explanation from Kansas +1 By Reid Spencer-NASCAR Wire Service Matt Kenseth stands in the garage area during practice for Sunday's NASCAR Sprint Cup Series race at Talladega Superspeedway. Photo: Patrick Smith/Getty Images Related Articles NASCAR Notebook: Earnhardt, Jr. must win at Talladega Kurt Busch stays at SHR, adds Monster as sponsor VIDEO: Joey Logano, Kyle Busch leave Kansas victorious Coby sweeps Thompson to win third Whelen Mod title \nTALLADEGA, Ala. - Joey Logano’s pants may not be on fire, but his ears might be burning after Matt Kenseth accused the driver of the No. 22 Team Penske Ford of being less than forthcoming in his assessment of last Sunday’s fateful wreck at Kansas Speedway. \nLogano insists he didn’t dump Kenseth on purpose with less than five laps left in the Hollywood Casino 400, a race Kenseth desperately needed to win to earn a berth in the Eliminator Round of the Chase for the NASCAR Sprint Cup. \nLogano won the race. Kenseth finished 14th. And the Joe Gibbs Racing driver didn’t think much of Logano’s characterization of the decisive wreck as “hard racing.” \n“Someday he might mature a little bit,” Kenseth said after Friday’s opening NASCAR Sprint Cup Series practice at Talladega Superspeedway, site of Sunday’s CampingWorld.com 500. “But, first of all, he should have stopped running his mouth… \n“And number two, he’s lying when he said he didn’t do it on purpose, because he lifted (my) tires off the ground, offset to the left, and he’s too good a race car driver to do that by accident.” \nFor practical purposes, Kenseth is in the same position he found himself last week—needing a victory to advance to the Eliminator Round. With victories at Charlotte and Kansas, Logano already is locked into the Chase’s third round. \nWin Or Bust For Dale Earnhardt, Jr. \nDale Earnhardt, Jr. comes to Talladega 11th in the Chase standings, four points in front of Matt Kenseth and 31 behind Martin Truex, Jr. in eighth place, the last transfer position into the Chase’s Eliminator Round. \nThough there are far-fetched scenarios that would enable Earnhardt to advance without a victory, a Talladega win on Sunday is by far the most realistic way for Earnhardt to keep his title hopes alive. \nToward that end, Earnhardt has a straightforward plan. \n“We’re just going to go out there and practice and work on the car and do what we need to do today,” Earnhardt said on Friday at Talladega. “Qualifying is (Saturday). We’ll try to do as good a job as we can there, and when the race starts, run up front and try to stay toward the lead. \n“I think it’s important to be in the lead in the last 50 laps of the race, so we’re going to try to be there.” \nEarnhardt also applauded NASCAR’s move to limit the number of possible green-white-checkered-flag finishes to one for Sunday’s race. \n“I thought three was a lot,” Earnhardt said. “I still think three is a lot—anywhere at any race. One attempt was kind of the norm, if anybody ever did that in racing in the last 100 years. One attempt seemed to be plenty. And I thought that was a good move for NASCAR, not only considering what happened in Daytona (with Austin Dillon’s wreck in July), but just one attempt. \n“We want to finish under green. We should hopefully finish under green without the opportunity of a green-white-checkered. But if there is a problem where we have to run extra laps, they’ll be one attempt, and that should satisfy not only the fans, but the drivers and everybody involved.” \nReddick Needs Wins To Make Up Ground \nIn recent weeks Ford driver Tyler Reddick has fallen out of the NASCAR Camping World Truck Series lead, thanks largely to a 19th-place finish at Canadian Tire Motorsport Park and a 15th-place run at New Hampshire. \nNow third in the standings and 16 points behind series leader Erik Jones, Reddick knows believes he can make up ground in short order, if he can find his way back to victory lane. The Brad Keselowski Racing driver has two wins this season but none since Dover in the year’s sixth event. \n“I think to be able to truly win the championship we’re going to have to win a couple races,” Reddick said on Friday at Talladega, site of Saturday’s fred’s 250. “We’ve won two races early in the year and hit a stretch there where we weren’t in the right position to be able to win a race, but we were able to get top fives and be able to stay pretty close with those other two (Jones and second-place Matt Crafton). \n“The last couple races, consistency-wise, we’ve made a few mistakes and we’ve had bad races, which we haven’t really had all year long, so we put ourselves in position where we have to win, but I feel like it’s no different than any other weekend we’ve come into. We’ve always come with the same mind-set, to win that race at that given event.” \nWDUN will have live MRN Radio coverage of Sunday’s NASCAR Sprint Cup Series race from Talladega Superspeedway beginning at 1 pm on 102.9 FM. Associated Categories : Sports , NASCAR News, Sprint Cup Associated Tags : nascar, motorsports, Auto Racing, Stock Car, Asphalt, Sprint Cup Series, Motorsports Live On WDUN, Chase for the Sprint Cup © Copyright 2015 AccessWDUN.com Watson leads Clemson to rout of Miami Former Gainesville High standout Deshaun Watson threw for one touchdown and ran for another before sitting out most of the second half and No. 6 Clemson rolled to a 42-0 lead by halftime on the way to embarrassing Miami 58-0 on Saturday - the worst loss in the 90-year history of Hurricanes football. 9:57PM ( 57 minutes from now ) Jefferson's run in the Class AAA state volleyball tournament came to a gut-wrenching end Saturday in the Elite 8 at Holy Innocents'. 9:28PM ( 28 minutes from now ) The Piedmont College women's soccer team completed its 2015 regular season on Saturday afternoon with a 2-0 shutout win at Greensboro College in USA South play. 5:45PM ( 3 hours ago )", "external_links": [], "published": "2015-10-24T16:00:00.000+03:00", "crawled": "2015-10-25T03:02:01.673+02:00", "highlightTitle": ""}