{"organizations": [], "uuid": "d687e865d8e1e7675cf50921907e28a3c7373194", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deccanherald.com", "main_image": "http://www.deccanherald.com/images/logo.jpg", "site_section": "http://www.deccanherald.com/rss/sports.rss", "section_title": "Deccan Herald - Sports", "url": "http://www.deccanherald.com/content/506865/didnt-think-ex-karnataka.html", "country": "US", "title": "'Didn't think I was ex-Karnataka'", "performance_score": 0, "site": "deccanherald.com", "participants_count": 0, "title_full": "'Didn't think I was ex-Karnataka'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T16:49:00.000+03:00", "replies_count": 0, "uuid": "d687e865d8e1e7675cf50921907e28a3c7373194"}, "author": "", "url": "http://www.deccanherald.com/content/506865/didnt-think-ex-karnataka.html", "ord_in_thread": 0, "title": "'Didn't think I was ex-Karnataka'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  'Didn't think I was ex-Karnataka' 'Didn't think I was ex-Karnataka' October 17,2015, Bengaluru, DHNS \nVidarbha’s Ganesh Satish, a former Karnataka captain, said that it was good to come back and score runs at his home ground and there was no real pressure to play against a team that he was part of for many years. “I really didn’t give too much of a thought to the fact that I am a local boy and played for Karnataka earlier. I just focused hard and I am happy to have helped my team,” said Ganesh, who slammed an unbeaten 81 in Vidarbha’s first innings here on Friday.Ganesh admitted that the familiarity of the wicket helped him in his knock. “I have known KSCA wicket for long and I have played alongside many of them in the Karnataka team for close to eight years. These things helped me plan my innings.”Helping his side finish at a respectable total, Ganesh said he was happy to perform well against a strong team like Karnataka. “Good scores in Ranji Trophy are important. Karnataka are a champion side. They don’t give opportunities easily and it was nice to have played well against a good team like them,” he said. Tight bowling Karnataka leg-spinner Shreyas Gopal stressed that his team’s bowlers must maintain a tight length and remain disciplined on the third day to get themselves back in the game.“We need to keep our bowling nice and tight and make sure we take all the chances that come by,” Shreyas said.Shreyas observed that there was not much help from the pitch for the bowlers and Karnataka didn’t display any wayward bowling. “On a slow pitch we didn’t allow them to post a big total and that’s a positive.“We missed few close verdicts on leg before wickets and who knows it could have changed the course of the game,” Shreyas added.The youngster exuded confidence that Karnataka can make an impact and make the encounter tighter. “If we can get them all out as soon as possible and hit back with our batting, we still have a good game in our hand,” he signed off.", "external_links": [], "published": "2015-10-16T16:49:00.000+03:00", "crawled": "2015-10-17T00:02:28.056+03:00", "highlightTitle": ""}