{"organizations": [], "uuid": "1298b69e636576a30b74f198c346308f36a06340", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.boston.com", "main_image": "http://p.o0bc.com/rf/image_1920x1190/Boston/2011-2020/2015/10/15/Boston.com/BCOM/Images/wiggs_Chairs_358891-8968-4448.jpg", "site_section": "http://www.boston.com/", "section_title": "Boston, MA news, breaking news, sports, video | Boston.com", "url": "http://www.boston.com/news/local/massachusetts/2015/10/15/boston-getting-its-first-wax-museum/3HYLo3EfYutVTLMStoN9KP/story.html", "country": "", "title": "Boston is getting a wax museum - Massachusetts news", "performance_score": 0, "site": "boston.com", "participants_count": 1, "title_full": "Boston is getting a wax museum - Massachusetts news", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "1298b69e636576a30b74f198c346308f36a06340"}, "author": "boston.com", "url": "http://www.boston.com/news/local/massachusetts/2015/10/15/boston-getting-its-first-wax-museum/3HYLo3EfYutVTLMStoN9KP/story.html", "ord_in_thread": 0, "title": "Boston is getting a wax museum - Massachusetts news", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "From the Museum of Fine Arts to the John F. Kennedy Presidential Library and Museum, Boston’s attractions draw visitors from near and far to see distinguished art and experience the city’s history. Now, the city’s museum scene is getting a new addition: a wax museum.\nThe Boston Wax Museum is slated to open next spring just outside of City Hall Plaza, The Boston Business Journal reported. It’ll be the first U.S. venture from Dreams Entertainment Group, a company based in Brazil.\nThe 16,000-square-foot space at 1 Washington Mall will serve as a home for wax figure recreations of historically influential Bostonians, as well as New England sports and entertainment icons, according to the BBJ .\nAdvertisement - Continue Reading Below Read the full BBJ story here .\nRelated gallery: Free Boston museums\nPrevious -- of -- Next The Peabody Museum of Archaeology & Ethnology at Harvard University is free to Massachusetts residents every Sunday morning (year-round) from 9 a.m. to noon and on Wednesdays from 3 to 5 p.m (September through May) — a $12 savings. Proof of residency is required. And it’s always free for Massachusetts teachers. Open 9 a.m. to 5 p.m. at 11 Divinity Ave., Cambridge. Flickr / Mahesh Previous -- of -- Next The Museum of Bad Art displays, well, bad art. All three locations are free, but the Somerville one requires a ticket to a Somerville Theatre event at 55 Davis Square (the museum is in the basement). Other locations: Brookline Interactive Group/Brookline Access Television at 46 Tappan St. in Brookline and the New England Wildlife Center, 500 Columbian St., South Weymouth. The Museum of Bad Art Previous -- of -- Next The Fuller Craft Museum is free on Thursdays from 5 p.m. to 9 p.m., a savings of $8. It is located at 455 Oak St. in Brockton. Photo by Carol Eckert Previous -- of -- Next The Boston University Art Gallery, which presents four to five exhibitions annually and often incorporates local talent, is free daily. Located at 855 Commonwealth Ave., Boston. Open Tuesday through Friday, 10 a.m. to 5 p.m.; Saturdays and Sundays, 1 p.m. to 5 p.m. Jake Levin/Boston University Photography Previous -- of -- Next If it’s your birthday, or your name is Isabella, admission is free at the Isabella Stewart Gardner Museum at 25 Evans Way in Boston (a $15 savings). Also, kids under 18 are always free. It is open Wednesday through Monday, 11 a.m. to 5 p.m. and Thursdays until 9 p.m. It is closed on Tuesdays. Flickr/charleshoffman Previous -- of -- Next Advertisement Previous -- of -- Next The MIT Museum at 265 Massachusetts Ave. in Cambridge is free the last Sunday of the month from September to June (a $10 savings). And it’s always free for members of the Massachusetts Teacher Association and New England Museum Association. The museum is open daily 10 a.m. to 5 p.m., exept on major holidays. MIT Museum Previous -- of -- Next The Art Complex Museum is free daily and houses the art collection of the Carl A. Weyerhaeuser family. The museum offers exhibitions, lectures, concerts, classes, demonstrations, and more. It’s located at 189 Alden St., Duxbury. Open Wednesday through Sunday, 1 p.m. to 4 p.m. The Art Complex Museum Previous -- of -- Next The Institute of Contemporary Art is free Thursdays from 5 p.m. to 9 p.m. (a $15 savings). Families who participate in Play Dates the last Saturday of the month are also free (except in December). 100 Northern Ave., Boston. Alan Zindman Previous -- of -- Next The Yiddish Book Center, a non-profit organization dedicated to rescuing and translating Yiddish books, is free to the public daily. Take a guided tour every Sunday at 11 a.m. and 1 p.m. Located at 1021 West St., Amherst. Open Sunday through Friday, 10 a.m. to 4 p.m. Dina Rudick/Globe Staff Previous -- of -- Next The Davis Museum at Wellesley College, which displays paintings, sculptures, photographs, and more, is free daily. Located at 106 Central St., Wellesley. Open Tuesday through Sunday, 11 a.m. to 5 p.m. Davis Museum and Cultural Center Previous -- of -- Next Advertisement", "external_links": ["http://www.bizjournals.com/boston/real_estate/2015/10/exclusive-a-wax-museum-is-coming-to-boston-but-it.html?ana=twt"], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-16T02:00:47.209+03:00", "highlightTitle": ""}