{"organizations": ["CSU Bakersfield Linsey McClain"], "uuid": "6ddd1e7509e9d1c83303a7d647b55754853c3d39", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deseretnews.com", "main_image": "http://img.deseretnews.com/images/article/hires/1614368/1614368.jpg", "site_section": "http://www.deseretnews.com/sports/uvu/index.rss", "section_title": "Utah Valley University sports scores, stats, schedules and UVU news - Deseret News", "url": "http://www.deseretnews.com/article/865639577/UVU-soccer-Utah-Valley-travels-to-play-Grand-Canyon-CSU-Bakersfield.html?pg=all", "country": "US", "title": "UVU soccer: Utah Valley travels to play Grand Canyon, CSU Bakersfield", "performance_score": 0, "site": "deseretnews.com", "participants_count": 0, "title_full": "UVU soccer: Utah Valley travels to play Grand Canyon, CSU Bakersfield", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T04:15:00.000+03:00", "replies_count": 0, "uuid": "6ddd1e7509e9d1c83303a7d647b55754853c3d39"}, "author": "", "url": "http://www.deseretnews.com/article/865639577/UVU-soccer-Utah-Valley-travels-to-play-Grand-Canyon-CSU-Bakersfield.html?pg=all", "ord_in_thread": 0, "title": "UVU soccer: Utah Valley travels to play Grand Canyon, CSU Bakersfield", "locations": ["Utah Valley"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Abby Jameson"], "text": "Published: Wednesday, Oct. 21 2015 7:10 p.m. MDT Updated: 7 hours ago Junior midfielder Abby Jameson (center) dribbles the ball up the field. Utah Valley heads out on the road this week to take on WAC foes Grand Canyon and CSU Bakersfield Linsey McClain, UVU Athletics Enlarge photo» \nThe Utah Valley University women's soccer team heads out on the road this week to take on Grand Canyon and CSU Bakersfield. The Wolverines face Grand Canyon on Friday at 5 p.m. MT, before traveling to play CSU Bakersfield on Sunday at 11 a.m. PT. \nUtah Valley (11-4-1, 6-0-1) remains atop the WAC standings after picking up a pair of wins last week, defeating Grand Canyon, 3-1, before taking down CSU Bakersfield, 3-2. UVU has now won six straight and has an unbeaten streak of seven-straight matches. The Wolverines wrapped up their home slate last week with an unbeaten record of 9-0-1, marking just the second time in UVU history the Wolverines have finished the season undefeated at home. \n\"These two matches will really test us,\" Utah Valley head coach Brent Anderson said. \"But I like the way the team is playing right now. They have been working hard and are confident in their abilities so now is a good time to challenge ourselves on the road.\" \nJunior forward Sheridan Fox continues to lead the Wolverines in scoring with eight goals, which ranks second in the WAC. Senior midfielder Kasandra Anderson leads the team and the conference with eight assists. Anderson leads the team with 20 points. \nUtah Valley leads the WAC in numerous statistical categories, including goals (40), assists (40) and points (120). The team ranks in the top six nationally in all three categories. \nAbout the opposition \nGrand Canyon enters Friday's match with a 6-8-2 overall record and a 3-3-1 mark in WAC play. The Antelopes went 0-2 last week as the team dropped a pair of road matches at Utah Valley and Seattle U. GCU has been impressive at home, compiling a 5-1-1 record that includes wins over Northern Arizona, Colorado State and UMKC. Sophomore forward Milla Benedetti leads the 'Lopes with seven goals and 16 points this season. \nCSU Bakersfield heads into the week with a 5-9-2 overall record and a 3-3-1 mark in league play. The 'Runners dropped a pair of road matches last week, falling 3-0 at Seattle before dropping a 3-2 decision at Utah Valley. CSUB has lost three of its last four matches. Freshman forward Aminah Settles leads CSUB and the WAC with nine goals and 19 points. \nUtah Valley wrapped up its home slate with a 9-0-1 unbeaten record. It is just the second-ever unbeaten season at home for the Wolverines, with the previous undefeated season being a 3-0-0 mark in 2003. \nEleven different Utah Valley players have registered at least one goal this season. Fox leads the team with eight goals. Anderson and Jamie Brown each have six goals. Taylor Kirk owns five goals while Libby Weber , Sydney Fitzpatrick and Kali Stubbs each have three goals. Sara Callister and Tori Smith have two goals. Breanna McCarter and Rylee Gritton each have one score this year. \nAs of Oct. 14, Utah Valley leads the WAC in points (120), goals (40), goals per game (2.50), assists (40) and assists per game (2.50). Individually, Anderson leads the WAC in assists (eight) and assists per game (0.50). Fox ranks tied for second in the WAC with eight goals. Jessica Duffin ranks second in the WAC with six shutouts. \nNationally, Utah Valley ranks fourth in total points (120), fifth in assists (40), sixth in total goals (40), seventh in points per game (7.50), eighth in assists per game (2.50) and ninth in scoring offense (2.50). Individually, Anderson ranks 19th in the nation with eight assists. She also ranks 25th nationally in assists per game (0.50). \nThe Utah Valley women's soccer team ranks 14th in the nation in accumulative attendance for the season. The Wolverines have welcomed 10,739 fans through the Clyde Field gates this season, putting them ahead of 319 teams nationally. UVU ranks 14th ahead of Texas Tech, West Virginia, Georgia, Tennessee, Stanford and UCLA. Jason Erickson works in the communications office at the Utah Valley University athletic department.   on  ", "external_links": [], "published": "2015-10-22T04:15:00.000+03:00", "crawled": "2015-10-22T11:26:15.383+03:00", "highlightTitle": ""}