{"organizations": [], "uuid": "a299e8336ee6b2a4dd68c3c0322445d8e3216c0e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.oregonlive.com", "main_image": "http://imgick.oregonlive.com/home/olive-media/width620/img/leader/photo/2015/10/21/19020930-large.jpg", "site_section": "http://www.oregonlive.com/", "section_title": "Oregon Local News, Breaking News, Sports &amp; Weather - OregonLive.com", "url": "http://www.oregonlive.com/forest-grove/index.ssf/2015/10/despite_native_american_mascot.html", "country": "US", "title": "Despite Native American mascot ban, Banks residents say 'Braves Forever'", "performance_score": 0, "site": "oregonlive.com", "participants_count": 2, "title_full": "Despite Native American mascot ban, Banks residents say 'Braves Forever' | OregonLive.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T13:00:00.000+03:00", "replies_count": 1, "uuid": "a299e8336ee6b2a4dd68c3c0322445d8e3216c0e"}, "author": "Dillon Pilorget | The Oregonian/OregonLive", "url": "http://www.oregonlive.com/forest-grove/index.ssf/2015/10/despite_native_american_mascot.html", "ord_in_thread": 0, "title": "Despite Native American mascot ban, Banks residents say 'Braves Forever'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Even as the 2017 deadline for changing Native American-themed mascots in Oregon public schools approaches, people in Banks are saying, \"Once a Brave, always a Brave.\"\nIt's a phrase they say out loud and, increasingly, on their shirts, declaring their dedication to a community that rallies around its high school and its mascot.\n\"Everybody's trying to get the Braves head on as many things as possible before we can't do it anymore,\" said Jaime Berning, co-president of the Banks Middle School Parent Teacher Organization. Her group has been selling T-shirts and sweatshirts inscribed with \"Banks Braves Forever.\"\nThe hint of defiance in that message is not altogether unintentional, Berning said. But so far, it seems a message people want to hear. The PTO's first shipment of 80 shirts flew out of stock within one week. People bought multiple sizes for their kids so they'd have Braves gear to grow into.\nBut the Banks Braves and their associated logo, a Native American man's head in profile, will soon be required to change along with 14 similar mascots in the state. The Oregon Board of Education voted in 2012 to ban mascots depicting Native Americans. As of now, school districts like Banks have until July 1, 2017 to eliminate their Native American mascots.\nA district survey earlier this year in Banks showed that about 95 percent of 1,000 respondents wanted to keep the \"Braves\" name, while about 93 percent wanted to keep the current logo.\n\"Nobody likes change,\" said Paula Jacobs, Berning's co-president at the middle school PTO. \"It's going to be a tough one to switch that over.\"\nAnd Berning said even if the mascot does change, \"People are still going to say they're Braves.\"\nThis sort of attachment makes sense for a town of 1,900 like Banks, said Trevor Beard, who volunteers to podcast all of Banks' home football games and most away games, along with some volleyball matches.\n\"Smaller towns, they get attached to high school sports really easily,\" Beard said. \"Once they get attached to a team or a mascot, it becomes part of them. It kind of becomes a characteristic about the community.\"\nRecognizing this, the district's new first-year superintendent, Jeff Leo, said he'd like to put the decision on a new mascot into the hands of the citizens and the Banks School Board.\nLike his predecessor, Bob Huston, Leo's been working to create a relationship with the Confederated Tribes of Grande Ronde. He's holding out hope that the Board of Education will grant exceptions to the ban where districts reach written agreements with federally recognized tribes, allowing the Braves to stay Braves.\n\"If we can't, we have a lot of planning to do,\" Leo said, as far as determining what a new mascot could be and how to manage – and pay for – removing the Braves image from gym floors, banners, scoreboards and websites. \"It'd be a long process, one that we need to start fairly soon.\"\nThough the state legislature approved Senate Bill 1509 in 2014, allowing districts to make such agreements with tribes, the Board of Education rejected a similar rule amendment last May. As it stands now, the Board of Education will not accept these agreements as exemptions to the ban, according to Oregon Department of Education spokesperson Crystal Greene.\nGreene said board members have time to change their minds and that the issue should come before them again around the end of the year.\nStill, Braves fans are preparing for a mascot change. Beard said there's been some talk around town about simply dropping the \"s\" and becoming the Banks Brave, with a different logo. This, Beard said, would likely maintain the piece of the mascot that people in Banks actually feel attached to.\n\"I think it's more about the characteristic of being brave, rather than the logo itself,\" he said.\nJacobs and Berning too said their team name represents honor and bravery to them, that it's considered more as a positive adjective describing their town than a noun for a Native American.\nIn that way, Beard said, \"I don't think the Braves will ever be replaced fully.\"\n-- Dillon Pilorget\ndpilorget@oregonian.com\n503-294-5927\n@ForestGReporter", "external_links": ["https://twitter.com/forestgreporter"], "published": "2015-10-22T13:00:00.000+03:00", "crawled": "2015-10-22T16:03:50.662+03:00", "highlightTitle": ""}