{"organizations": [], "uuid": "dd6db946305ead46b3d38de8fa8859f42b8b1ec7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sacbee.com", "main_image": "http://www.sacbee.com/news/local/crime/spgip7/picture41403315/ALTERNATES/LANDSCAPE_1140/IMG_2947", "site_section": "http://www.sacbee.com/?widgetName=rssfeed&widgetContentId=713546&getXmlFeed=true", "section_title": "Breaking News, Sports, Weather & More | Sacbee.com &", "url": "http://www.sacbee.com/news/local/crime/article41375010.html", "country": "US", "title": "Girl, 13, in critical condition after shots fired at her West Sacramento home", "performance_score": 0, "site": "sacbee.com", "participants_count": 1, "title_full": "Girl, 13, in critical condition after shots fired at her West Sacramento home", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T17:32:00.000+02:00", "replies_count": 0, "uuid": "dd6db946305ead46b3d38de8fa8859f42b8b1ec7"}, "author": "Richard Chang \nrchang@sacbee.com", "url": "http://www.sacbee.com/news/local/crime/article41375010.html", "ord_in_thread": 0, "title": "Girl, 13, in critical condition after shots fired at her West Sacramento home", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Girl, 13, in critical condition after shots fired at her West Sacramento home \nGirl in Solano Street home with grandmother at time of shooting \nPolice haven’t identified any suspects \nNo indication of any incident preceding shooting Sacto 911 \nCovering crime, police and courts in the Sacramento region A 13-year-old girl was struck by a bullet while sitting on the couch inside this West Sacramento home. Richard Chang rchang@sacbee.com i \nrchang@sacbee.com \nA 13-year-old West Sacramento girl was fighting for her life Sunday after being hit in the head by a shot fired from outside her house. \nPolice say someone fired five shots about 8:50 p.m. Saturday at the home in the 900 block of Solano Street, leaving a trail of bullet holes on the single-story structure’s facade. The incident occurred not far from the popular Riverpoint Marketplace anchored by Ikea and Walmart. \nNo description of a shooter has been established, and it’s unclear how the person or people responsible fled, whether on foot or by car. Investigators said there was no indication of an incident that preceded the shooting. The girl was at home with her grandmother, who is her caretaker. They are the house’s only residents. \nAfter undergoing surgery at UC Davis Medical Center, the girl was still listed in critical condition Sunday afternoon, according to West Sacramento police. The victim’s name was not released. \nNo one answered the door Sunday at the tan-colored duplex, perched on the corner of Solano Street, adjacent to a church. But neighbors expressed disbelief that a shooting could occur in what they said was a safe neighborhood. \nAlan Franciscus, 67, who lives across the street from the victim, said he was watching TV when he heard a series of pops. \n“I thought it was firecrackers, but they sounded a little different,” Franciscus said. \nWhen Franciscus rushed out, he said, about a dozen police squad cars and other emergency responders surrounded the home. \nPolice are asking the public’s help in identifying the assailant. A canvas of the area late Saturday turned up few leads, said Sgt. Roger Kinney, a West Sacramento Police Department spokesman. \n“Nobody saw anything. We didn’t really get any helpful information,” Kinney said, adding that no surveillance cameras exist for that block. \nAnyone with information on this incident is asked to call West Sacramento police at 916-372-3375.", "external_links": [], "published": "2015-10-25T17:32:00.000+02:00", "crawled": "2015-10-26T11:59:31.432+02:00", "highlightTitle": ""}