{"organizations": ["Reuters"], "uuid": "b0e9028828e0c025bf187c7db224c4da4edc39d1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "jakartaglobe.beritasatu.com", "main_image": "http://img.thejakartaglobe.com/2015/10/2015-10-10T173434Z_87500074_MT1ACI14065120_RTRMADP_3_RUGU-1024x702.jpg", "site_section": "http://jakartaglobe.beritasatu.com/rss/sports/", "section_title": "Sports | Jakarta Globe", "url": "http://jakartaglobe.beritasatu.com/rugby/scotland-carry-rugby-hopes-hemisphere/", "country": "ID", "title": "Scotland Carry the Rugby Hopes of a Hemisphere", "performance_score": 0, "site": "beritasatu.com", "participants_count": 0, "title_full": "Scotland Carry the Rugby Hopes of a Hemisphere", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T10:28:00.000+03:00", "replies_count": 0, "uuid": "b0e9028828e0c025bf187c7db224c4da4edc39d1"}, "author": "", "url": "http://jakartaglobe.beritasatu.com/rugby/scotland-carry-rugby-hopes-hemisphere/", "ord_in_thread": 0, "title": "Scotland Carry the Rugby Hopes of a Hemisphere", "locations": ["Scotland", "Australia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mitch Phillips", "Israel Folau"], "text": "INDEX Scotland Carry the Rugby Hopes of a Hemisphere i Australia are tipped as the hot favorite to take out the World Cup, with Israel Folau in fitting form. (Reuters Photo/Andrew Couldridge) By : Mitch Phillips | on 9:28 PM October 18, 2015 Category : Sports , Rugby \nLondon. Scotland stand between a first southern hemisphere clean sweep of the World Cup quarter-finals on Sunday but will have to find the performance of their lives to overcome hot favorites Australia at Twickenham. \nArgentina await the winners of Sunday's match after their 43-20 victory over Ireland in Cardiff, while New Zealand and South Africa also clash next weekend after their wins over Wales and France on Saturday. \nThough the Scots are outsiders against a Wallaby team who looked hugely impressive in topping Pool A above England and Wales, they were given a boost on Sunday when previously banned forward duo Ross Ford and Jonny Gray were named in the starting lineup after winning their appeals against suspensions for a tip tackle. \nCoach Vern Cotter initially named Fraser Brown at hooker and Tim Swinson at lock but in his revised team released an hour before kickoff, they dropped to the bench. \nEven at full strength, the Scots need everything to go their way to upset the southern hemisphere juggernaut in balmy conditions perfect for running rugby. \nThey have won two of the previous three meetings but Australia had taken the previous 16, including a World Cup quarter-final in 2003. \nScotland's only previous appearance in the last four came in 1991, when they lost on home soil to England, and they have not won a game at Twickenham since 1983. \nAustralia, fresh from winning the Rugby Championship, are seeking to win the title for the third time in the UK having won at Twickenham in 1991 and Cardiff in 1999. \nOrdinarily Scotland's best hope would be to smother the life out of the free-running Wallabies and try to squeeze a win via the set-piece but even that approach looks a stiff challenge now the Australian scrum has improved so much. \nInjuries have deprived them of influential flanker David Pocock and fullback Israel Folau but they are hardly weakened by the inclusion of Ben McCalman and Kurtley Beale. \n\"They are a team that is more dangerous at the end, so we can't even allow a slight slip in concentration,\" said Cotter. \nReuters", "external_links": [], "published": "2015-10-18T10:28:00.000+03:00", "crawled": "2015-10-19T09:20:35.077+03:00", "highlightTitle": ""}