{"organizations": [], "uuid": "64762151183a141bbf54f2e888c7d9f706373c76", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "jacksonville.com", "main_image": "http://jacksonville.com/sites/default/files/gators_18.jpg", "site_section": "http://feeds.jacksonville.com/JacksonvillecomSports#", "section_title": "Jacksonville sports news - Jacksonville.com and The Florida Times-Union", "url": "http://jacksonville.com/sports/college/florida-gators/2015-10-17/story/no-6-lsu-uses-special-teams-hold-no-8-florida", "country": "US", "title": "No. 6 LSU uses special teams to hold off No. 8 Florida", "performance_score": 0, "site": "jacksonville.com", "participants_count": 1, "title_full": "No. 6 LSU uses special teams to hold off No. 8 Florida", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T06:02:00.000+03:00", "replies_count": 0, "uuid": "64762151183a141bbf54f2e888c7d9f706373c76"}, "author": "Graham Hack", "url": "http://jacksonville.com/sports/college/florida-gators/2015-10-17/story/no-6-lsu-uses-special-teams-hold-no-8-florida", "ord_in_thread": 0, "title": "No. 6 LSU uses special teams to hold off No. 8 Florida", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "No. 6 LSU uses special teams to hold off No. 8 Florida \nBy Graham Hack Sat, Oct 17, 2015 @ 11:02 pm | updated Sat, Oct 17, 2015 @ 11:28 pm Photos AP LSU running back Leonard Fournette (7) carries for a touchdown against Florida during the first half of an NCAA college football game Saturday, Oct. 17, 2015, in Baton Rouge, La. BATON ROUGE, La. | Special teams nearly powered No. 8 Florida to victory on Saturday night. But as it turned out, that was the unit that ultimately doomed the Gators. Florida (6-1, 4-1 SEC) fell 35-28 at No. 8 LSU (6-0, 4-0), struggling defensively against the balanced offensive attack of the Tigers. But it was a classic call from LSU coach Les Miles that ultimately proved to be the difference. With the game tied 28-28 early in the fourth quarter, Miles drew up a fake field goal, which placekicker Trent Domingue ran in for a 16-yard touchdown. That would prove pivotal down the stretch, as LSU was able to hold on and keep Florida’s offense from scoring, despite several chances for the Gators, including a last-ditch Hail Mary attempt to end the game. The fake field goal would make up for an otherwise atrocious day for LSU’s special teams, which muffed a punt that resulted in a Florida score and allowed a punt return touchdown to the Gators. The muff occurred after a Florida punt on its first drive of the game. On the play, LSU’s Tre’Davious White mishandled the return, allowing the ball to bounce directly up after hitting his arms and to fall right into arms of Florida’s Nick Washington. The Gators would score four plays later on a fourth-and-one touchdown pass from quarterback Treon Harris to tight end Jake McGee from LSU’s five-yard line for an early 7-0 lead. Harris would finish the game with 271 yards and two touchdowns on 17-of-32 passing. For almost the rest of the first half, though, the Tigers took the momentum. Leonard Fournette ate up clock and ran through Florida defenders, reaching the 100-yard mark in the first half on just 15 carries. He also ran for two touchdowns in the second quarter, and LSU quarterback Brandon Harris had a passing touchdown sandwiched in between them. Fournette would finish the game with 31 carries for 180 yards, the sixth-consecutive game with more than 150 yards for the leading Heisman Trophy candidate. Just before halftime, Florida answered back, putting together a 4-play, 80-yard drive that ended with a second touchdown pass from Harris to McGee. The drive took just 44 seconds to brought the game within a touchdown with 1:34 remaining in the half. But LSU would answer right back, scoring on a 50-yard touchdown pass from Harris to Malachi Dupre with 15 seconds left before halftime for a 28-14 lead. Florida’s defense clamped down in the second half, keeping the LSU offense from scoring and largely limited Fournette from big plays. Meanwhile, Florida’s offense jumped out of the gate, scoring a touchdown on its opening drive to cut the lead to 28-21. Then, freshman Antonio Callaway scored on the punt return to tie the game with 1:04 to play in the third quarter. LSU would drive down the field on the ensuing possession, setting the stage for Miles’ fake field goal call. Florida would get the ball three more times in the fourth quarter, but were unable to get the ball closer than the LSU 35-yard line. The Gators would get the ball to midfield for a Hail Mary at the end of the game which fell incomplete.", "external_links": [], "published": "2015-10-18T06:02:00.000+03:00", "crawled": "2015-10-18T18:13:04.673+03:00", "highlightTitle": ""}