{"organizations": ["Associated Press"], "uuid": "553716d03c3c4e60576d6dbe4c6cabc6c5881cdb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pendletontimespost.com", "main_image": "", "site_section": "http://pendletontimespost.com//feed/sec/6000/", "section_title": "PendletonTimesPost.com - Sports News", "url": "http://www.pendletontimespost.com/view/story/42f7f0e1807e427eb50d55b7defc2d8b/US--Lamar-Odom/", "country": "US", "title": "Ex-NBA star Lamar Odom is alert and improving, his aunt says", "performance_score": 0, "site": "pendletontimespost.com", "participants_count": 0, "title_full": "Ex-NBA star Lamar Odom is alert and improving, his aunt says", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T19:11:00.000+03:00", "replies_count": 0, "uuid": "553716d03c3c4e60576d6dbe4c6cabc6c5881cdb"}, "author": "", "url": "http://www.pendletontimespost.com/view/story/42f7f0e1807e427eb50d55b7defc2d8b/US--Lamar-Odom/", "ord_in_thread": 0, "title": "Ex-NBA star Lamar Odom is alert and improving, his aunt says", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["SALLY HO", "Lamar Odom"], "text": "Ex-NBA star Lamar Odom alert and improving, but unclear when he may leave hospital, aunt says By SALLY HO Associated Press   12:10 pmLast   12:11 pm   \nPeople: Photo Gallery: \nClick to view (3 Photos) \nLAS VEGAS — Lamar Odom is alert and his condition is improving after the former NBA star was found unconscious at a Nevada brothel a week ago, his family said Monday. \nAlvina Alston, publicist for Odom's aunt JaNean Mercer, said the former reality-TV personality is undergoing testing, but there is no word yet on when he might be released from the hospital. Odom is overcoming \"insurmountable obstacles\" and defying the odds, Mercer said in a statement. \n\"Each day Lamar is getting stronger and reaching significant milestones in his recovery,\" the statement said. \nOdom was found in extremely critical condition at the Love Ranch brothel in the rural community of Crystal, Nevada, on Oct. 13 and was hospitalized in Las Vegas. He regained consciousness and communicated for the first time Friday. \nThe brothel said workers saw him drink alcohol and take supplements sold as \"herbal Viagra.\" The Food and Drug Administration issued a warning in 2013 against one brand he took, Reload, after it was found to contain sildenafil, the active ingredient in prescription Viagra. \nHe also told at least one of the women that he had done cocaine, but the brothel says it did not see him take any drugs or find any there. \nOdom's family, including estranged wife Khloe Kardashian, rushed to Las Vegas to be by his side at the hospital. Friends, teammates and loved ones also have visited and posted requests for prayers on social media. \nLove Ranch owner Dennis Hof has said that Odom arrived Oct. 10 for a four-day stay and spent $75,000 on two women who accompanied him in a VIP suite. \nAll content copyright ©2015 Pendleton Times-Post, a division of Home News Enterprises unless otherwise noted.", "external_links": [], "published": "2015-10-19T19:11:00.000+03:00", "crawled": "2015-10-19T21:07:43.108+03:00", "highlightTitle": ""}