{"organizations": [], "uuid": "3e712f592d489b255ae6b307520444bfcb6bc393", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailyherald.com", "main_image": "http://www.dailyherald.com/storyimage/DA/20150930/sports/150939954/AR/0/AR-150939954.jpg&amp;updated=201509300458&amp;imageversion=Facebook&amp;exactH=630&amp;exactW=1200&amp;exactfit=crop&amp;noborder", "site_section": "http://www.dailyherald.com/rss/feed/?feed=sports_all", "section_title": "DailyHerald.com &gt; Sports", "url": "http://www.dailyherald.com/article/20150930/sports/150939954/", "country": "US", "title": "Several Cubs in line for postseason hardware", "performance_score": 0, "site": "dailyherald.com", "participants_count": 2, "title_full": "Several Cubs in line for postseason hardware - DailyHerald.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T13:30:00.000+03:00", "replies_count": 1, "uuid": "c5488422d9d06e2cc0e517744c6e0051ecbd06ca"}, "author": "Bruce Miles", "url": "http://www.dailyherald.com/article/20150930/sports/150939954/#post-0", "ord_in_thread": 0, "title": "Several Cubs in line for postseason hardware", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Come November, several members of the Chicago Cubs family need to have their cellphones handy.\nBallots will be submitted before the end of the regular season by members of the Baseball Writers Association of America for Most Valuable Player, Cy Young Award, Rookie of the Year and Manager of the Year.\nCubs people will get votes in all four categories, and some likely will be taking home hardware.\nHere is how it could shake out:\nMost Valuable Player: This is always a tricky one because of the word \"valuable.\" Is the MVP the best or most outstanding player, or is he the player who was most valuable in helping his team reach the postseason? It's all in the eyes of the individual voter.\nBryce Harper of the Washington Nationals is having an epically good season. He entered Tuesday with 41 home runs and a wins-above-replacemnt (WAR) of 10.2. Also among the position-player MVP candidates are Cincinnati's Joey Votto and Arizona's Paul Goldschmidt.\nBut the Nationals aren't going to the playoffs and neither are the Reds or the Diamondbacks.\nOn the other hand, the Cubs, Cardinals and Pirates all are going to the postseason. Andrew McCutchen is the engine that makes Pittsburgh go. Jason Heyward has been solid as St. Louis has endured injury after injury.\nAnd what of the Cubs? After pitcher Jake Arrieta won his 21st game Sunday night, talk turned to him possibly winning the MVP as well as the Cy Young. You can argue that no one has been more valuable to the Cubs making the playoffs this year.\nSome argue that pitchers have their own award and should not be considered for MVP, but Arrieta has been truly dominant this season.\nKris Bryant and Anthony Rizzo are in the top 10 in WAR in the National League. Each will get plenty of votes.\nCy Young: Just a few weeks ago, perhaps even days ago, the Los Angeles Dodgers' Zack Greinke was considered a shoo-in for the Cy Young. But Arrieta has put on a second-half charge of historic proportions.\nNot only does he lead the major leagues with 21 victories, his 0.80 ERA since the all-star break is the lowest in major-league history. He has pitched a club-record 19 straight quality starts.\nGreinke is no slouch. He is 18-3 with a 1.68 ERA and a WHIP of 0.85. Arrieta has an ERA of 1.82 and a WHIP of 0.88. Wins by pitchers have been looked at in a new light lately and devalued somewhat, but Cubs manager Joe Maddon said Sunday that Arrieta \"has earned\" those 21 victories.\nClayton Kershaw of the Dodgers is 15-7 with an ERA of 2.25 and a WHIP of 0.91. Right now, he's third behind the pick-'em of Arrieta-Greinke.\nRookie of the Year: When the San Francisco came to Chicago for a four-game series in early August, the Giants' Matt Duffy was considered a Rookie of the Year candidate along with Bryant.\nNow, this one looks like Bryant's all the way. He entered Tuesday night with a line of .281/.372/.502 with 26 homers and 99 RBI. Duffy was at .298/.338/.431 with 11 homers and 74 RBI.\nThis looks like a closed case.\nManager of the Year: Because of the Cubs' success and because Maddon is Maddon, he will get a lot of consideration.\nBut it's going to be hard to look past the job Mike Matheny has done in St. Louis. The Cardinals are poised to win 100 games, and they've done it while withstanding injuries to such players as Adam Wainwright, Matt Holliday, Yadier Molina, Randal Grichuk and Carlos Martinez, among others.\nJust Monday night, outfielder Stephen Piscotty suffered a head injury in a nasty collision at PNC Park in Pittsburgh.\nThe New York Mets and manager Terry Collins have won the NL East, and they struggled offensively much of the year.\nAs much as Maddon has done with the Cubs, it would be hard to go against Matheny in this one.\n• Follow Bruce's reports on Twitter@BruceMiles2112.\nGet great articles like this sent to your inbox! Click here to sign up for the Cubs Newsletter No Thanks Sports MLB Cubs Baseball Pro Sports Newsletter", "external_links": ["https://twitter.com/share"], "published": "2015-09-30T13:30:00.000+03:00", "crawled": "2015-10-01T01:47:34.561+03:00", "highlightTitle": ""}