{"organizations": [], "uuid": "62fa448b4b7177bba33dd2cef2965cf2328a9526", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.brandonsun.com", "main_image": "http://media.brandonsun.com/designimages/squaresun_web.jpg", "site_section": "http://brandonsun.com//rss?path=/sports/local", "section_title": "Local Sports", "url": "http://www.brandonsun.com/sports/local/van-den-ham-riding-way-to-top-336233481.html", "country": "US", "title": "Van den Ham riding way to top", "performance_score": 0, "site": "brandonsun.com", "participants_count": 0, "title_full": "Van den Ham riding way to top", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T11:00:00.000+03:00", "replies_count": 0, "uuid": "62fa448b4b7177bba33dd2cef2965cf2328a9526"}, "author": "", "url": "http://www.brandonsun.com/sports/local/van-den-ham-riding-way-to-top-336233481.html", "ord_in_thread": 0, "title": "Van den Ham riding way to top", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Chris Jaster", "Van den Ham"], "text": "Van den Ham riding way to top By: Chris Jaster Report Error \nMichael van den Ham made history this year by helping found Canada’s first pro cyclo-cross team, and he’s looking at making a little more history this weekend by winning his first national title. \nThe 23-year-old Brandon native placed third in his first time in the Elite Division at the event last year, and he is hoping for a similar finish at this year’s Canadian championships in Winnipeg on Saturday. \n“Last year I went in saying I’d be satisfied with a top-five finish and I’d be happy with a podium. I don’t think that has actually changed, it’s just a different (mindset) going into this year,” he said. “Last year I had no idea what I was capable of. I didn’t know if a podium was a possibility, it was just a goal of mine. \n“After last year, I know I am capable of winning the race. It won’t be easy, there’s probably 10 other guys capable of winning the race, but the big difference is realizing if I play my cards right on the right day then that is a possibility.” \nCyclo-cross typically consists of multiple laps of a short course with steep obstacles that force a rider to dismount and carry their bike before resuming the ride. \nVan den Ham, who recently graduated from The King’s University in Edmonton with a political science degree, will have a huge support team at the national championships. His brother Doug will race in the event trying to defend his 30-to-39-year-old age group title. \nThe other three members of his cyclo-cross team — Craig Richey, Raphael Gagne and Natasha Elliot — will also compete. \nIt’s the first time the entire team, which van den Ham and Richey formed, will compete in the same event. \nUnlike road racing, cyclo-cross is not a big team sport during the race. However, van den Ham sees other benefits to being part of a team, especially one made up of four Canadians. \n“The aspect of the team comes from being able to organize yourself at races and be able to go to sponsors and say here’s two or three or four of us and here’s the type of benefit we can provide your company, and we can share equipment,” he said. \n“We do try to help each other out a little bit in races but cyclo-cross doesn’t lend itself to teamwork that much.” \nThe five-foot-10, 155-pound van den Ham is feeling good heading into the national championship. He wasn’t happy with his 60th place finish at the first-ever World Cup event in North America in Las Vegas earlier this year, but he was happy with a ninth place finish at a competition in Providence, R.I. \nNormally the Canadian championship would be the midway point in the season for van den Ham, but this year it’s more like the beginning. In November, he’s moving to Belgium with his wife, Kiera. Belgium is the centre of cyclo-cross in the world and he plans on entering quite a few events during his three months there. \n“Going to Belgium is about the experience. I have some ambitions for having good races. My ambitions in North American would be getting a podium or winning, and in Belgium that might be getting 30th place,” he said. \n“It’s a little bit nerve-racking. It’s a whole new experience for me. It will be really great. Racing against the best in the world every single weekend is one thing, but it’s also forcing me to take a step back and live like a professional.” \nAlthough there’s a lot on the go right now for van den Ham, he is looking forward to racing close to home in Manitoba again before beginning a new journey overseas. \n“I’ve been looking forward to it since a year ago,” he said. “Last year, I was absolutely blown away by how many people came out from Brandon and Winnipeg. To have someone who’s from Manitoba, and I haven’t lived here for five years now because of school, but to have someone who’s from Manitoba and was a part of that cycling community and is a part of that cycling community to cheer for, it was amazing.” \n» cjaster@brandonsun.com", "external_links": [], "published": "2015-10-23T11:00:00.000+03:00", "crawled": "2015-10-23T15:46:06.883+03:00", "highlightTitle": ""}