{"organizations": ["Copa America Conmebol", "Copa America SANTIAGO"], "uuid": "e092186ce12654f346b015a8722a219c4b8da0d6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "", "site_section": "http://mf.feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "http://uk.reuters.com/article/2015/10/16/uk-soccer-world-conmebol-fifa-idUKKCN0SA2QO20151016?feedType=RSS&feedName=sportsNews", "country": "US", "title": "Conmebol take control of rights for 2016 Copa America", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "Conmebol take control of rights for 2016 Copa America", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T01:13:00.000+03:00", "replies_count": 0, "uuid": "e092186ce12654f346b015a8722a219c4b8da0d6"}, "author": "", "url": "http://uk.reuters.com/article/2015/10/16/uk-soccer-world-conmebol-fifa-idUKKCN0SA2QO20151016?feedType=RSS&feedName=sportsNews", "ord_in_thread": 0, "title": "Conmebol take control of rights for 2016 Copa America", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Conmebol take control of rights for 2016 Copa America SANTIAGO \nSANTIAGO The South American football confederation has taken over the management of sponsorship and rebroadcast rights for the 2016 Centenary Copa America, the confederation (Conmebol) said on Friday. \nThe move sidelines Argentine company Datisa and removes another obstacle to hosting the tournament in the United States. \n\"Conmebol and Datisa have agreed to rescind all the commercial rights that Datisa had for the sale of sponsorship and rebroadcasts associated with the Centenary Copa America,\" a Conmebol statement said. \n\"Conmebol will take control of those commercial rights while they together with the CONCACAF and the United States Soccer Federation will identify new partners to sell the tournament's commercial rights through a new and transparent process.\" \nThree of the main shareholders in Datisa were among those indicted by the U.S. in May during a crackdown on worldwide football corruption which has tarnished FIFA's reputation. \nThe U.S. indictment said the three men conspired to win and keep hold of lucrative media rights contracts from regional football federations through the payment of up to $110 million in bribes. \nThe three, Alejandro Burzaco, Hugo Jinkis and his son Mariano Jinkis, are all Argentine citizens. \nBurzaco has been extradited to the United States and is out on bail after pleading not guilty. The Jinkis's have been released from house arrest but cannot stray from their places of residence longer than 24 hours without a judge's permission. \nThey have surrendered their passports while a judge seeks more information from U.S. authorities. \nTheir indictments were one of the reasons the future of the 2016 Centenary Copa America was thrown into doubt. \nAnother issue is whether heads of top Latin American confederations will travel to the U.S.. Some bosses are thought to fear arrest if they set foot in the country. \nAlthough the Copa is usually contested every four years by teams from South America, a special centenary version was announced for next year with teams from all over the Americas. \nThe Copa America was first held in 1916 and is the oldest international tournament in the world. \n(Writing by Andrew Downie, reporting by Felipe Iturrieta, editing by Ken Ferris) \nOur top photos from the past week. Slideshow Trending On Reuters", "external_links": [], "published": "2015-10-17T01:13:00.000+03:00", "crawled": "2015-10-17T01:34:28.716+03:00", "highlightTitle": ""}