{"organizations": [], "uuid": "d526bc2652a95113b303e696fefe999c92b9d51f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "couriernews.com", "main_image": "http://matchbin-assets.s3.amazonaws.com/public/sites/2218/thumbs/32S2_SPT_Jeff_Graves.jpg", "site_section": "http://couriernews.com/rss/rss/Sports?instance=Sports&amp;content_type=article&amp;tags=sports_high_school+sports_collegiate+sports_professional+sports_scoreboard+sports_other&amp;tag_inclusion=or&amp;offset=0&amp;limit=25&amp;page_name=rss", "section_title": "Sports", "url": "http://couriernews.com/bookmark/26920489", "country": "US", "title": "Graves sets record during Panthers’ loss", "performance_score": 0, "site": "couriernews.com", "participants_count": 1, "title_full": "Graves sets record during Panthers’ loss", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T23:15:00.000+03:00", "replies_count": 0, "uuid": "d526bc2652a95113b303e696fefe999c92b9d51f"}, "author": "Travis Simpson (noreply@couriernews.com)", "url": "http://couriernews.com/bookmark/26920489", "ord_in_thread": 0, "title": "Graves sets record during Panthers’ loss", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "slideshow CLARKSVILLE — Panthers wide receiver Jeff Graves had plenty to celebrate after Clarkville’s 54-48 loss on Friday at Metheny Field.Sure, the scoreboard didn’t look the way he wanted, but the senior broke two school records against the Harrison Golden Goblins.Graves now holds the record for most reception yards in a game at 247 and the most touchdown catches in a season at 13.Graves wasn’t the only Clarksville player with bloated numbers. The Panthers had 610 yards of total offense. Quarterback Mason Schucker threw for 348 yards and four touchdowns. Running back Jason White had 202 yards and a touchdown.Typically, the team with those kinds of numbers comes out on top. Panthers second-year head coach Eli Cranor said the team hasn’t quite reached their potential at playing through all four quarters of the game — but they have learned how to fight.Clarksville trailed 21-7 after the first quarter.“We were never stopped the entire game,” he said. “We never punted.”But the Panthers defense didn’t stop the Harrison offense, either. At least, not until a very critical moment in the game.“Harrison kicked a little pooch kick, and it rolled backwards, and they got it,” Cranor said. “We got the ball back with 3:27 left in the game and we throw an interception, but our defense shows up with its only three-and-out stop of the game. They got us the ball with a chance to win. We don’t want to be a team that has to score 55 points in a game to win, but our defense put us in a position to win the game.”Clarkville’s offense, which had been unstoppable for much of the night, came up short in the final moments of the game.Cranor praised his quarterback for his approach this season.“He’s 15 years old,” Cranor said. “He doesn’t even drive a car yet, but at this point in the season he has 1,544 passing yards and 17 touchdowns. We are 1-6, but it’s so far from where we were last year. Last year, Harrison beat us 69-6.”When asked how he was doing after Friday’s game and Monday’s practice, Graves kept it simple: “Superb. I’m doing superb.”  ", "external_links": [], "published": "2015-10-21T23:15:00.000+03:00", "crawled": "2015-10-22T02:16:28.615+03:00", "highlightTitle": ""}