{"organizations": ["Central Bulldogs", "Central Rance Burger"], "uuid": "96b55f94482b7d9849500343a3aec726c1d5df33", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news-leader.com", "main_image": "http://www.gannett-cdn.com/-mm-/20448327b1a675930dc3acecc2314256566e0e4f/c=0-23-718-429&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/19/Springfield/Springfield/635808661509840537-SNLBrd-10-07-2015-NewsLeader-1-D002--2015-10-06-IMG-SNLBrd-09-18-2015-Ne-1-1-19C5HN2N-L687796224-IMG-SNLBrd-09-18-2015-Ne-1-1-19C5HN2N.jpg", "site_section": "http://rssfeeds.news-leader.com/springfield/sports", "section_title": "Springfield - Sports", "url": "http://www.news-leader.com/story/sports/high-school/2015/10/20/news-leader-playoff-game-week-glendale-central/74230196/", "country": "US", "title": "News-Leader Playoff Game of the Week: Glendale at Central", "performance_score": 0, "site": "news-leader.com", "participants_count": 0, "title_full": "News-Leader Playoff Game of the Week: Glendale at Central", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T07:17:00.000+03:00", "replies_count": 0, "uuid": "96b55f94482b7d9849500343a3aec726c1d5df33"}, "author": "", "url": "http://www.news-leader.com/story/sports/high-school/2015/10/20/news-leader-playoff-game-week-glendale-central/74230196/", "ord_in_thread": 0, "title": "News-Leader Playoff Game of the Week: Glendale at Central", "locations": ["Harrison Stadium", "Glendale"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Quintin Batson"], "text": "News-Leader Playoff Game of the Week: Glendale at Central Rance Burger , News-Leader 11:17 p.m. CDT October 19, 2015 Buy Photo Quarterback Quintin Batson and the Central Bulldogs (5-4) host Glendale (3-6) Friday at Harrison Stadium at 7 p.m. in the Class 5 District 5 playoffs. (Photo: News-Leader File Photo) Buy Photo 311 CONNECT 13 TWEET LINKEDIN COMMENT EMAIL MORE \nCentral used Glendale as a temporary home. On Friday, the Bulldogs invite the Falcons into their house. \nGlendale (3-6) and Central (5-4) open the postseason Friday at Harrison Stadium in the opening round of the 2015 high school football district playoffs. The game comes seven days after Central played a home game at Glendale because of a nationally televised Drury University soccer match at Harrison Stadium and a 24-hour lightning postponement of Central’s Week 9 game with Mt. Vernon. \nCentral improved to 5-4 for its first winning season since the 8-2 campaign of 2002. Bulldogs fans turned Lowe Stadium into a backdrop of home field advantage for an overtime win against the Mountaineers. \n“It’s been 13 years since we had a winning season in the regular season. It was a special moment, the whole thing was great,” Central coach Lorenzo Williams said. “All the kids were super on Cloud Nine.” \nWilliams’ elation was cut short as he learned of Parkview beating Lebanon 42-35, which impacted Central’s standing in the Class 5 District 5 playoffs. \n“One of my defensive staff guys turns around and he goes, ‘hey, man, Parkview beat Lebanon,’” Williams recounted. “I’m like, oh, that means we’ve got to play Glendale? We definitely took the short end of the straw in our district.” \nGlendale picked up its second straight win by beating Camdenton 60-41 on the road. The Falcons score an average of 47.3 points per game with sophomore quarterback Alex Huston passing for 515.3 yards per game under the tutelage of offensive coordinator Ben Mauk. \n“We try to score every time we have the ball and try to take the pressure off our defense,” Mauk said. \nGlendale beat Camdenton for the first time in 24 years. George H.W. Bush was President of the United States when the Falcons last beat the Lakers in 1991. \nMauk said Monday at the Springfield Quarterback Club’s weekly luncheon that Glendale would need to play its best game of the year to advance to the district semifinals against Republic. \n“We’re going to probably play the most athletic team in our district,” Mauk said of Central. “You can tell they are a very well-coached team. Obviously, they have very good athletes.” \nWilliams said he spent much of the weekend watching game film in effort to learn more of Glendale’s 5-wide receiver hurry-up offense. He praised the Falcons for mixing plays and preventing defenses from making adjustments. \n“Once you get over the initial shock then you’re shocked again because they do something else,” Williams said. “It’s just crazy.” \nThe Springfield News-Leader Game of the Week helps showcase one high school football game per week through the regular season. The Game of the Week is selected by the News-Leader staff based on an array of criteria including quality of play, rivalry, conference significance and playoff implications. \nNews-Leader Game of the Week \nGlendale (3-6) at Central (5-4) \nFriday, Oct. 23, 7 p.m. \nHarrison Stadium 311 CONNECT 13 TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http://sgfnow.co/1LHyGiH TOP VIDEOS", "external_links": [], "published": "2015-10-20T07:17:00.000+03:00", "crawled": "2015-10-21T07:04:04.324+03:00", "highlightTitle": ""}