{"organizations": ["Auburn", "Facebook Auburn", "Arkansas Facebook Email Twitter Google", "Arkansas", "Arkansas Auburn"], "uuid": "91535cc2887491e372515b8437d57a10e269c866", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.montgomeryadvertiser.com", "main_image": "http://www.gannett-cdn.com/-mm-/6e49f9998371372883fa04f0e45c04991e2960e0/c=0-37-734-452&amp;r=x633&amp;c=1600x630/local/-/media/2015/10/16/Montgomery/Montgomery/635805572693682751-unnamed.jpg", "site_section": "http://rssfeeds.montgomeryadvertiser.com/montgomery/auburnsports", "section_title": "Montgomery - Auburn Sports", "url": "http://www.montgomeryadvertiser.com/story/sports/college/auburnauthority/2015/10/18/auburn-qb-sean-white-likely-start-arkansas/74200348/", "country": "US", "title": "Auburn QB Sean White likely to start at Arkansas", "performance_score": 0, "site": "montgomeryadvertiser.com", "participants_count": 0, "title_full": "Auburn QB Sean White likely to start at Arkansas", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T05:57:00.000+03:00", "replies_count": 0, "uuid": "91535cc2887491e372515b8437d57a10e269c866"}, "author": "", "url": "http://www.montgomeryadvertiser.com/story/sports/college/auburnauthority/2015/10/18/auburn-qb-sean-white-likely-start-arkansas/74200348/", "ord_in_thread": 0, "title": "Auburn QB Sean White likely to start at Arkansas", "locations": ["Kentucky", "Arkansas"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Rhett Lashlee", "Matthew Stevens", "Sean White"], "text": "Facebook Email Twitter Google+ LinkedIn Pinterest Auburn QB Sean White likely to start at Arkansas Auburn offensive coordinator Rhett Lashlee said “it’s safe to say” Sean White will make the start at Arkansas Saturday. Post to Facebook Auburn QB Sean White likely to start at Arkansas Auburn offensive coordinator Rhett Lashlee said “it’s safe to say” Sean White will make the start at Arkansas Saturday. Check out this story on montgomeryadvertiser.com: http://on.mgmadv.com/1LEVAqV Cancel Send A link has been sent to your friend's email address. Posted! A link has been posted to your Facebook feed. Join the Conversation Matthew Stevens , Montgomery Advertiser 9:57 p.m. CDT October 18, 2015 Auburn OC Rhett Lashlee talks about Kentucky win and Arkansas matchup. Matthew Stevens \nAUBURN — No more quarterback controversy, at least for this week. \nSean White will be behind center for Auburn Saturday. \nAuburn offensive coordinator Rhett Lashlee said Sunday that he anticipates White being Auburn’s starting quarterback Saturday at Arkansas (11 a.m., SEC Network) and for the foreseeable future after his 255-yard performance Thursday night. \n“I think it's safe to say he'll probably start the game Saturday,” Lashlee said of Auburn quarterback Sean White. \nWhite was efficient and more dynamic while directing the Auburn offense Thursday night to a 30-27 victory at Kentucky. The redshirt freshman, who was embroiled in a quarterback competition for 10 days with junior Jeremy Johnson after the Tigers bye week preparation, finished Thursday night 17 of 27 for 255 yards. He hit six different receivers and was a huge reasons Auburn (4-2, 1-2 in Southeastern Conference) was 11 of 18 on third downs during the game. \n“I think he had one decision on a naked down at the goal line that should have been intercepted (and) that's really probably the only poor decision with the football I thought he made,” Lashlee said. “I thought his ball security was much better. I think he'll just get more and more confident and it's something we can build on.” \nAuburn head coach Gus Malzahn said after the win Thursday night that the coaching staff came out of Lexington, Kentucky thinking they can be more aggressive in the passing game and they have two quarterbacks they can trust for the rest of the 2015 season. \n“We wanted to come out with an aggressive mindset,” Malzahn said. “We felt Sean gave us the best chance to win and that’s nothing negative on Jeremy. We feel good about Jeremy.” \nSean White (13). Auburn at Kentucky in Lexington, Ky. on Thursday, Oct. 15, 2015. (Photo: Zach Bland/Auburn Athletics) \nWhite said after the win that he was told he would get the start the night before the game in the team hotel and made sure he kept the job throughout the Thursday night affair. Auburn scored touchdowns on its first two drives and White was 6 of 10 for 124 yards in the opening quarter. Comparatively, White was the same 6 of 10 for 108 yards in the entire game against San Jose State two weeks prior. \n“I’d say they were more available because of what the defense was giving us,” White said about some deep passing plays to Ricardo Louis . “We took some shots more because it worked out that way.” \nWhite and Louis both had career highs in yardage and at least for one night made for Auburn’s best deep threat duo in the 2015 season. In the first game following D’haquille Williams’ dismissal Kentucky played a soft zone or straight man on Auburn’s wide receivers basically begging for Auburn (4-2, 1-2 in the SEC) to attempt a deep pass. \n“We wanted to be aggressive and allow (White) to give guys a chance to make plays and he did that,” Lashlee said. “Even when it was kind of covered, he put it where somebody like Ricardo could go up and make a play on it.” \nLouis, Auburn’s 6-foot-2 senior flanker, caught a 27 and 41-yard pass to set up touchdowns on the Tigers first two drives of the game. \n“We’ve got to be a good team offense (because) I’m not going say Ric will catch seven balls for 150 yards every week, maybe he will but for the most part I thought when the ball was thrown everybody’s way, they did a good job making plays,” Lashlee said Sunday night. Auburn quarterback Sean White improved to 2-1 as a starter after Thursday night's 30-27 win at Kentucky. Duane Rankin/Montgomery Advertiser \nWhite was able to help Auburn convert third downs at a 8 of 11 rate early and that resulted in 23 first-half points. The redshirt freshman found a new target in Marcus Davis over the middle as the junior, who played high school games as a quarterback against White years ago, finished with five catches for a career-high 49 yards. \n“Even with the lack of inexperience, he plays with a lot of confidence and shows courage,” Davis said Sunday night. \nJohnson, who attempted to win back the starting job after losing it three weeks into the 2015 season, will continue to be the backup and likely the receiver on Kerryon Johnson’s wildcat formation. \n“He handled it really well, he really did,” Lashlee said. “I have been really proud of what he’s been doing.” \nLashlee echoed the words of Malzahn about the comfort of not having a complete unknown as the backup option at quarterback for the rest of the 2015 season. \n“We’ve got two guys that we’ve got to be able to win with,” Lashlee said. “This is a tough league and you never know if a guy gets nicked up what the situation calls for.” Read or Share this story: http://on.mgmadv.com/1LEVAqV Most Popular", "external_links": [], "published": "2015-10-19T05:57:00.000+03:00", "crawled": "2015-10-19T19:59:02.484+03:00", "highlightTitle": ""}