{"organizations": [], "uuid": "2c901476141967fa49764b7989e67d3daf9c811c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.emirates247.com", "main_image": "http://cdn-wac.emirates247.com/polopoly_fs/1.605015.1443533292!/image/3661062104.jpg", "site_section": "http://www.emirates247.com/cmlink/en/dubai-chamber-http-emirates247-com-sports-1.517973?localLinksEnabled=false", "section_title": "Dubai Chamber - http://Emirates247.com - Sports", "url": "http://www.emirates247.com/sports/cricket/pakistan-vs-zimbabwe-3rd-odi-hosts-eye-historic-series-win-2015-10-05-1.605631", "country": "US", "title": "Pakistan vs Zimbabwe 3rd ODI: Hosts eye historic series win", "performance_score": 0, "site": "emirates247.com", "participants_count": 1, "title_full": "Pakistan vs Zimbabwe 3rd ODI: Hosts eye historic series win", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T07:26:00.000+03:00", "replies_count": 0, "uuid": "2c901476141967fa49764b7989e67d3daf9c811c"}, "author": "Cricket Correspondent", "url": "http://www.emirates247.com/sports/cricket/pakistan-vs-zimbabwe-3rd-odi-hosts-eye-historic-series-win-2015-10-05-1.605631", "ord_in_thread": 0, "title": "Pakistan vs Zimbabwe 3rd ODI: Hosts eye historic series win", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Pakistan vs Zimbabwe 3rd ODI: Hosts eye historic series win Zimbabwe levelled the series with a controversial win on Saturday By Published Monday, October 05, 2015 Pakistan's batsman Shoaib Malik prepares to play a shot in front of wicketkeeper Richmond Mutambami during the second of two T20 cricket matches between Zimbabwe and Pakistan at Harare Sports Club on September 29, 2015. AFP \nZimbabwe are eyeing a historic series win against Pakistan after winning the second one-day international in controversial circumstances at Harare Sports Club on Saturday. Rain and then bad light put stalled Pakistan's remarkable chase of 277 after having slumped to 76-6 as Zimbabwe won by five run on the D/L method to register their first win against Pakistan in over two years. It was a decision that left Pakistan in dismay and Shoaib Malik furious.“I think the game was in our favour,” said Malik, who was left stranded on 96 not out after orchestrating Pakistan’s recovery from 76-6 to 256-8 and needing 21 runs off two overs for victory.“Obviously there are certain ICC rules and we have to follow them. I think overall it was a great game, but at the end of the day it’s a little bit disappointing the way it ended,\" he added. Malik batted for almost 42 overs and kept Pakistan in the hunt by adding 111 runs for the seventh wicket with Aamer Yamin, who struck a maiden ODI fifty, and an unbroken 63 for the ninth wicket with Yasir Shah. Malik also gave credit to the Zimbabweans for the way they played. \"We started off well bowling as a unit, but obviously we must also give credit to the Zimbabwean batsmen, especially (Chamu) Chibhabha and (Elton) Chigumbura. Especially Chigumbura and the way he batted at the end,\" he added. Having squared the series, the hosts will enter the third and final match on Monday seeking a historic bilateral ODI series win. However, it won’t be easy going at all for Zimbabwe as Azhar Ali’s men, seething after the controversial loss, will look to hit back hard. Pakistan remain favourites to win the series, having already taken both Twenty20 matches between the two sides. Their bowling made the difference in the first ODI - which they won by 131 runs - thanks to a spin masterclass by Yasir Shah. Zimbabwe skipper Elton Chigumbura warned his side against complacency in the final game of the series.“In the game of cricket, you can’t relax until the very last ball,” Chigumbura said who was one of two half centurions on Saturday. “There was a lot of pressure on the team and the players showed good character. We hope to do well on Monday and win the series.” Teams (from ): Pakistan : Azhar Ali (captain), Mohammad Hafeez, Ahmed Shehzad, Sohaib Maqsood, Shoaib Malik, Babar Azam, Sarfraz Ahmed (wicket-keeper), Mohammad Rizwan, Immad Wasim, Anwar Ali, Wahab Riaz, Yasir Shah, Rahat Ali, Mohammad Irfan, Asad Shafiq, Bilal Asif. Zimbabwe: Elton Chigumbura (captain), Sikandar Raza Butt, Chamunorwa Chibhabha, Craig Ervine, Luke Jongwe, Neville Madziva, Hamilton Masakadza, Christopher Mpofu, Richmond Mutumbami (wicket-keeper), Taurai Muzarabani, John Nyumbu, Tinashe Panyangara, Prosper Utseya, Malcolm Waller, Sean Williams. Umpires: Russell Tiffin (Zimbabwe) and Ruchira Palliyaguruge (Sri Lanka). TV umpire:Jeremiah Matibiri (Zimbabwe). Match referee: David Jukes (England).  ", "external_links": [], "published": "2015-10-05T07:26:00.000+03:00", "crawled": "2015-10-05T08:05:43.161+03:00", "highlightTitle": ""}