{"organizations": [], "uuid": "2058161a885eac65d0f0c0c1cb2314058d728729", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "xclusiveyachts.com", "main_image": "", "site_section": "http://www.rssfeedgenerate.com/feed/36358/", "section_title": "Watersports, Water Sports Dubai, Donut Ride, Dubai, Banana Boat Ride Dubai", "url": "http://xclusiveyachts.com/corporate-staff-event-ideas-dubai.html", "country": "US", "title": "Why not hold your next corporate function on board a luxury yacht", "performance_score": 0, "site": "xclusiveyachts.com", "participants_count": 1, "title_full": "Why not hold your next corporate function on board a luxury yacht", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T10:02:00.000+03:00", "replies_count": 0, "uuid": "2058161a885eac65d0f0c0c1cb2314058d728729"}, "author": "xclusiveyachtsdubai@gmail.com", "url": "http://xclusiveyachts.com/corporate-staff-event-ideas-dubai.html", "ord_in_thread": 0, "title": "Why not hold your next corporate function on board a luxury yacht", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "favicon Xclusive Yachts is the best fit for: - Company staff party - Team Building Event - Corporate Event - Office Party - Product Launch - Staff Function - Award Ceremonies We will coordinate and create the right mood and ambience for any occasion, whether your theme is casual or elegant. Let us help you create a nautical adventure that will be the buzz of the office. We serve food and drink onboard and we can weigh anchor to allow delegates to sun-bathe, swim or even enjoy a variety of water sports rides. Prices start from AED 500 per person fully inclusive of catering & bevarages. We can cater to events for upto 200 guests, we have a dedicated team who will take care of your every need for your corporate event. Call and ask to speak to our corporate events manager. As an organization, you set the tone in your industry. Similarly, it is important that you set the tone in letting your clients and/or employees have a luxurious time after some hard work. When it comes to corporate entertainment in Dubai, there is no one who does it better than Xclusive Yachts. Not only do we understand the relevance of innovative corporate event ideas in Dubai, but we also love executing them to precision for you. So, be it product launches, team building events or corporate parties, Xclusive Yachts can do it for you. One of our most acclaimed services is the offering and execution of staff party ideas, appreciated by corporates in Dubai and overseas. Our Clients:", "external_links": [], "published": "2015-10-12T10:02:00.000+03:00", "crawled": "2015-10-12T10:02:23.819+03:00", "highlightTitle": ""}