{"organizations": ["K-State"], "uuid": "330c56abb45b86bcf6389537808b14a34f2e239f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "themercury.com", "main_image": "", "site_section": "http://themercury.com/feeds/kstate-sports", "section_title": "The Manhattan Mercury - K-State Sports", "url": "http://themercury.com/articles/k-state-sweeps-texas-tech", "country": "US", "title": "K-State sweeps Texas Tech", "performance_score": 0, "site": "themercury.com", "participants_count": 0, "title_full": "K-State sweeps Texas Tech", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T07:47:00.000+02:00", "replies_count": 0, "uuid": "330c56abb45b86bcf6389537808b14a34f2e239f"}, "author": "", "url": "http://themercury.com/articles/k-state-sweeps-texas-tech", "ord_in_thread": 0, "title": "K-State sweeps Texas Tech", "locations": ["Texas"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By The Mercury October 24, 2015 \nLUBBOCK, Texas — The Kansas State volleyball team used its offense early and defense late to earn its second straight road win with a sweep of Texas Tech (25-20, 26-24, 25-19) on Saturday at the United Supermarkets Arena. \nThe Wildcats (12-8, 4-4 Big 12) had 36 of their 49 kills over the first two sets, including 17 in the first set when it hit .389, while six blocks in the third limited the Red Raiders (13-9, 2-6 Big 12) to a .024 clip in the set and under .200 for the match (.178). \nK-State has now won three of its last four matches overall, with each victory featuring a Wildcat defense that held its opponent to a sub-.200 hitting efficiency. \n“When we came out of the break, our priority was to be better at point scoring,” said K-State head coach Suzie Fritz. “We felt like we were not holding them to the hitting efficiency that we felt were capable of. We really tried to emphasize defense in set three, such as being more disciplined at the net with our hands.” \nThe K-State offense had two attackers reach double figures in kills, led by 14 from Brooke Sassin. The outside hitter used her .270 attack percentage, on 37 swings, to notch her most kills in a match since October 3 at TCU and 16th effort this season with 10 or more kills. Katie Reininger, meanwhile, tallied 12 kills on a .440 clip, her third Big 12 match this year with a hitting percentage of .350 or higher. The redshirt junior also added five blocks to give her a match-high 15 points. \n“We were in great rhythm,” said Fritz. “Being a good offensive team for us means being in a good offensive balance. We had everybody, in some degree, rolling early on — hitting for high efficiency, finding some way to get their kills. The distribution was really good.” \nTwo other Wildcats, Katie Brand and Macy Flowers, matched Reininger for the team lead in blocks. Brand had 14 digs to go with her five stuffs while she piloted the offense with 41 assists, her second 40-assist effort in a three-set match this season. The double-double for Brand was her Big 12-best 13th of the year and 44th of her career. \nFlowers, who is averaging 1.78 blocks/set over the last three matches, added nine kills on a .375 clip. The nine kills for Flowers were her most in a contest since she had 11 in her K-State debut on October 3. \nK-State’s back row was just as stingy as it had 51 digs, including 19 in the third. Kober tied Brand for the match-high in digs with 14. \nThe Wildcats fired out of the gate in the first, totaling 11 kills on their first 20 swings to hit .500 (one error) in the early going. Texas Tech had pulled within two at the 10-8 mark, but an 8-2 run gave K-State its largest advantage of the match, 18-10. \nThe Wildcats overcame nine attack errors (six unforced) in the second with 19 kills, including eight by Sassin. The junior, who took a team-high 18 swings in the set, used her sixth kill to help K-State come out of its final timeout and even the score at 20-20. She later had a kill to give the Wildcats a 22-21 lead and used her final one to square it up at 23-all. \nTexas Tech brought it to set point first following the Wildcats’ ninth attack error, but Schultejans used a kill and a block assist to help K-State pull ahead, 25-24. Bryna Vogel quickly ended it on the next rally by splitting the Texas Tech block for her only kill of the set. \nSimilar to the first set, K-State never trailed in the third thanks to its half-dozen blocks. Texas Tech did close it to a one-point K-State advantage at 10-9, but a Wildcat timeout halted the Red Raiders’ momentum while a kill by Brand, combo block by Brand and Flowers, and kill by Sassin restored K-State’s four-point lead. \nThe Wildcats did not allow the Red Raiders to narrow the gap any closer than two points over the remainder of the set after 17-15 as K-State scored eight of the last 12 points. A block by Reininger and Sami Flattum brought it to set point before Alyssa Schultejans’ seventh kill of the match sealed the win. \nThe Wildcats remain in road action with their next match on Wednesday at West Virginia. First serve is set for 5 pm CT.", "external_links": [], "published": "2015-10-25T07:47:00.000+02:00", "crawled": "2015-10-25T08:23:14.941+02:00", "highlightTitle": ""}