{"organizations": ["Stastny St. Louis Blues"], "uuid": "084ec085cdd81cd8f65b9329b8cea8d6bcce8f0a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribtown.com", "main_image": "http://d1bdhkmqqz901h.cloudfront.net/1200x630/smart/s3.amazonaws.com/hne-smedia/1/8/18b0613c80ef42d9b15edba2c1c31e92/web_full_171484986684.jpg", "site_section": "http://www.tribtown.com//feed/sec/6000", "section_title": "TribTown.com - Sports News", "url": "http://www.tribtown.com/view/story/18b0613c80ef42d9b15edba2c1c31e92/HKN--Banged-Up-Blues", "country": "US", "title": "St. Louis Blues forced to regroup for extended period without Schwartz, Stastny", "performance_score": 0, "site": "tribtown.com", "participants_count": 0, "title_full": "St. Louis Blues forced to regroup for extended period without Schwartz, Stastny", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T21:41:00.000+02:00", "replies_count": 0, "uuid": "084ec085cdd81cd8f65b9329b8cea8d6bcce8f0a"}, "author": "", "url": "http://www.tribtown.com/view/story/18b0613c80ef42d9b15edba2c1c31e92/HKN--Banged-Up-Blues", "ord_in_thread": 0, "title": "St. Louis Blues forced to regroup for extended period without Schwartz, Stastny", "locations": ["Stastny", "St. Louis Blues"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["R.B. FALLSTROM", "Schwartz"], "text": "St. Louis Blues forced to regroup for extended period without Schwartz, Stastny By R.B. FALLSTROM AP Sports Writer First Posted: October 26, 2015 - 3:40 pmLast Updated: October 26, 2015 - 3:41 pm We also have more stories about: (click the phrases to see a list) \nPeople: \nMissouri (724) \nST. LOUIS — In the St. Louis Blues' first game without top forwards Jaden Schwartz and Paul Stastny, it took players a while to adjust. \nCoach Ken Hitchcock pointed out that his players have no choice. \nStastny is out at least another month with a broken right foot and Schwartz will be re-evaluated in three months after surgery for a fractured left ankle sustained in a freak practice accident on Friday. Schwartz had 63 points last season and Stastny had 46 points, and had five points in five games this season. \nA third forward, Patrik Berglund, isn't expected back until January after shoulder surgery. \nSome help is on the way. The Blues anticipate activating All-Star defenseman Kevin Shattenkirk (groin) and promising rookie Robby Fabbri (concussion) in time for Tuesday night's game against Tampa Bay. The 19-year-old Fabbri was a first-round pick in 2014 and has been a high scorer in juniors. \nStill, it's going to take a group effort to compensate for all of that lost offense. \nThe Blues turned up the intensity across the board on Saturday, erasing a two-goal third-period deficit before losing 3-2 in overtime to the Islanders. They outshot New York 15-2 in the third. \n\"I think we're going to have to get a little creative with what we do with our roster, and we're going to have to get more from certain people,\" Hitchcock said. \"But if we keep up with our work ethic, we keep our spirit up, we're going to get through this thing and hopefully come out better.\" \nThe malaise was evident at the start of the Islanders game when the Blues won just 5 of 15 of face-offs in the first period. Hitchcock noted a lack of aggressive checking. \n\"We weren't sharp off the bat,\" goalie Brian Elliott said. \"We did a great job just kind of settling down and kind of taking over the game.\" \nThe bottom line is that they salvaged something, and that's important right now. \n\"To lose in overtime is a disappointment but you have to be happy with the one point and kind of move on from it and learn from that start,\" Elliott said. \"We had a lot of good things so you can't hang your head too much.\" \nBesides Shattenkirk and Fabbri, the Blues will lean heavier on young Dmitrij Jaskin. They can give increased roles to veterans Scott Gomez and Scottie Upshall, too. Both made the team as tryouts. \n\"We've got to manufacture points, we've got to manufacture goals,\" Hitchcock said. \"It's not going to come as smooth and as easy as it once did.\" \nUpshall was supposed to be in the lineup Saturday but became ill about an hour before game-time. \n\"We know we're anticipating that Shattenkirk and Fabbri will be back in on Tuesday,\" Hitchcock said. \"I'm sure Upshall will be back in, so we're going to get a little bit of stability.\" \nRookie defenseman Colton Parayko has stepped in from the start, showing a knack for offense along with solid play on the back line. He had a goal and assist in the Saturday surge. The Blues can always lean on strong net-minding with Elliott and Jake Allen sharing duties. \n\"It's just about guys stepping up and filling roles,\" Elliott said. \"We lost some big-time players and now it's opportunities.\" \n ", "external_links": [], "published": "2015-10-26T21:41:00.000+02:00", "crawled": "2015-10-26T21:59:35.719+02:00", "highlightTitle": ""}