{"organizations": [], "uuid": "45c4f9ee14925fc2f0b8be3968a7fdb2eda81a5c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mcall.com", "main_image": "http://www.trbimg.com/img-5620704a/turbine/mc-liberty-freedom-boys-soccer-20151015", "site_section": "http://www.mcall.com/sports/rss2.0.xml", "section_title": "Sports - The Morning Call", "url": "http://www.mcall.com/sports/varsity/mc-liberty-freedom-boys-soccer-20151015-story.html", "country": "US", "title": "Riad leads Patriots to one-goal win", "performance_score": 0, "site": "mcall.com", "participants_count": 1, "title_full": "Riad leads Patriots to one-goal win", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T06:31:00.000+03:00", "replies_count": 0, "uuid": "45c4f9ee14925fc2f0b8be3968a7fdb2eda81a5c"}, "author": "Michael Blouse", "url": "http://www.mcall.com/sports/varsity/mc-liberty-freedom-boys-soccer-20151015-story.html", "ord_in_thread": 0, "title": "Riad leads Patriots to one-goal win", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Riad leads Patriots to one-goal win Soccer MICHAEL KUBEL / THE MORNING CALL \nLiberty's Colin Muller goes after the ball with Freedom's Alex Thomas in their boys soccer game at Bethlehem Area School District Stadium on Thursday. -//// MICHAEL KUBEL / The Morning Call ---- Thursday October 15, 2015 \nLiberty's Colin Muller goes after the ball with Freedom's Alex Thomas in their boys soccer game at Bethlehem Area School District Stadium on Thursday. -//// MICHAEL KUBEL / The Morning Call ---- Thursday October 15, 2015 (MICHAEL KUBEL / THE MORNING CALL) Michael Blouse Special to The Morning Call \nThe Eastern Pennsylvania Conference playoffs start on Saturday, but don't try to tell Freedom senior Steven Riad that the Patriots' 3-2 win over Bethlehem city rival Liberty Thursday night wasn't as important as any postseason victory. \nThe relentless Riad scored two first-half goals and assisted on another as Freedom opened up a 3-1 advantage at halftime. \nCoach Michael O'Connell's Patriots then withstood a frantic and valiant comeback attempt by the Hurricanes in the second half. \n“We wanted this so bad that you can't even understand,” said Riad, a senior who was recognized along with the other seniors on both teams before the night game at Bethlehem Area School District Stadium. \n“We knew we couldn't lose this game. This win is as big as winning any championship game. We had our hearts broken by them two weeks ago [Liberty won the first matchup 2-1], and we've been waiting for this rematch ever since.” 1975 state champion Liberty soccer team celebrates 40th anniversary \nLiberty High School celebrated the 40th anniversary of the 1975 soccer team’s PIAA state championship season on Thursday Oct. 15, 2015 at halftime of the Liberty vs Freedom soccer game. \nLiberty High School celebrated the 40th anniversary of the 1975 soccer team’s PIAA state championship season on Thursday Oct. 15, 2015 at halftime of the Liberty vs Freedom soccer game. See more videos \nFreedom snapped Liberty's 11-match winning streak and improved to 13-5 overall and 13-3 in the conference. Liberty suffered its second defeat this season and is 16-2 and 14-2. \nThe last time the Patriots and Hurricanes played on Oct. 1, Freedom lost senior Mezen Abdalla to a knee injury. Abdalla, the team's leading scorer last year, formed a potent 1-2 punch along with Riad. Since the setback, Riad has played even better and others have picked up the offensive slack. \nEarly in Thursday's contest, Riad was absolutely dominant on the offensive end. \nHe scored twice in the first 23 minutes, and had two other solid scoring opportunities before the break. Riad also assisted on Michael Silva's goal with 11:16 remaining in the first half. \nPhoto Gallery -- As Liberty plays Freedom in boys soccer on Senior night, the 1975 Liberty State Champion boys soccer team is honored. (MICHAEL KUBEL \\ THE MORNING CALL) \n“Like coach tells us, it's all about heart,” Riad said. “It doesn't matter if you're double-teamed or triple-teamed — you've got to find a way. Hustle takes you a long way.” \nThe Hurricanes came storming back in the second 40 minutes — they dominated possession — and closed within one goal when Colin Muller scored with 10:49 remaining. Liberty had plenty more opportunities in the final 10 minutes, but the Patriots found a way to finish off the win. \nFreedom keeper John Eltringham was outstanding in goal and was credited with eight saves. \n“This was the best lesson we could get before playoffs,” Liberty coach Jason Horvath said. “It's not something we wanted, but I think it'll be a wakeup call for our team. We certainly came out in the second half with more energy, but Freedom outworked us.” \nAfter the contest, Riad embraced Muller — Liberty's star senior — at midfield and said he looked forward to another match in the EPC championship game. Both teams have a lot of work to do before then. \nThe conference playoffs are set — pairings, seeds, sites and times become official today — with the opening-round contests scheduled for Saturday at the site of the higher seeded team. \nUnofficially, top seed Emmaus plays Central Catholic at 2 p.m., No. 2 Pocono Mountain East meets Pleasant Valley at a time to be determined, No. 3 Liberty plays Stroudsburg at 2:30 at BASD Stadium, and No. 4 Freedom takes on Parkland at 4:30 at BASD. \n“We needed this win and it came at the right time,” O'Connell said. “As long as we contain our emotions and use them in a positive way, this could be great momentum.” \nA halftime ceremony was held to recognize Liberty's 1975 state championship team. \nMichael Blouse is a freelance writer. \nFREEDOM 3, LIBERTY 2", "external_links": [], "published": "2015-10-16T06:31:00.000+03:00", "crawled": "2015-10-16T06:51:31.284+03:00", "highlightTitle": ""}