{"organizations": ["Clemson"], "uuid": "53adfcdaad8b4720d4da4a50bfb897381e6902a9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.postandcourier.com", "main_image": "http://www.postandcourier.com/storyimage/CP/20151017/PC20/151019484/AR/0/AR-151019484.jpg", "site_section": "http://www.postandcourier.com/apps/pbcs.dll/section?Category=PC2007&template=rss", "section_title": "National Sports", "url": "http://www.postandcourier.com/article/20151017/PC20/151019484/1032&ampsource=RSS", "country": "US", "title": "Pigskin Picks: Shawn Elliott, Deshaun Watson get vocal", "performance_score": 0, "site": "postandcourier.com", "participants_count": 0, "title_full": "Pigskin Picks: Shawn Elliott, Deshaun Watson get vocal", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T08:01:00.000+03:00", "replies_count": 0, "uuid": "53adfcdaad8b4720d4da4a50bfb897381e6902a9"}, "author": "", "url": "http://www.postandcourier.com/article/20151017/PC20/151019484/1032&ampsource=RSS", "ord_in_thread": 0, "title": "Pigskin Picks: Shawn Elliott, Deshaun Watson get vocal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Deshaun Watson", "D. Easley", "Shawn Elliott"], "text": "Pigskin Picks: Shawn Elliott, Deshaun Watson get vocal Oct 17 2015 12:01 am Sophomore quarterback Deshaun Watson has taken on more of a leadership role at Clemson. AP Photo/Timothy D. Easley Week 7, weak numbers. \nOnline \nTo play along, go to postandcourier.com/pigskinpicks . South Carolina is 1-8 in Southeastern Conference games since a 2014 win at Vanderbilt. Interim head coach Shawn Elliott seeks to avoid the SEC East basement in a Saturday home game against the Commodores. Boston College seeks to score at Clemson. The Eagles suffered a 3-0 loss at Wake Forest last week. I hope to avoid losing a game to Warren Peper in the Pigskin Picks standings for the fourth week in a row. Vanderbilt atSouth Carolina Elliott is fired up. “It’s a great opportunity for our staff, for our team, for our fan base and for our university as a whole to come together to rally around this team and see what happens,” he said of the first game without Steve Spurrier on the sideline since 2004. Vanderbilt coaches would be wise to take advantage of South Carolina’s probable early intensity and try a lot of misdirection stuff. But while Elliott is wrong when he says “We’ve got a lot of great players here,” the Gamecocks have enough capable talent to avoid going 0-5 in the SEC. Gene Sapakoff pick: South Carolina, 24-17 Warren Peper pick: South Carolina, 31-25 Boston Collegeat Clemson Clemson coaches asked Deshaun Watson to get a little more vocal last week, and the sophomore quarterback came through with words and action in a 43-24 victory over Georgia Tech. “Sometimes you have to step in there and say something and get guys riled up and take leadership of this team,” offensive co-coordinator Tony Elliott said. “We’ve been challenging him.” Just another sign of necessary improvement for a Clemson team with big dreams. Sapakoff pick: Clemson, 24-3 Peper pick: Clemson, 28-10 The Citadel at Samford Showdown of the two highest scoring teams in the Southern Conference (Samford 35.2 points per game, The Citadel 33.8). Dominque Allen was 7-for-10 passing for 125 yards last week in the Citadel’s artful 39-12 win over Wofford. Sapakoff pick: Samford, 34-31 Peper pick: Samford, 35-21 CSU at Presbyterian Presbyterian is way better than its 1-5 record. The tough schedule included a 24-17 loss to FCS power Coastal Carolina last week. The Buccaneers (4-1) held Monmouth to 115 yards last week in a 37-7 rout. Sapakoff pick: CSU, 31-14 Peper pick: CSU, 27-24 Howard at S.C. State S.C. State (2-3) had 18 penalties in its last outing, a 17-14 loss at Bethune-Cookman. Stop imploding and the Bulldogs can get on a winning streak. Howard (0-5) lost 76-0 at Boston College last month. Sapakoff pick: S.C. State, 28-14 Peper pick: S.C. State, 30-24 Louisville atFlorida State Dalvin Cook bounced back from the injured list to rush for 222 yards on 22 carries as Florida State rallied for a 29-24 victory over Miami last week. Sapakoff pick: Florida State, 24-17 Peper pick: Florida State, 28-21 Wake Forest atNorth Carolina The Deacons, coming off that 3-0 victory over Boston College, are No. 15 in total defense. The Tar Heels have won four straight since that season-opening loss to South Carolina. Sapakoff pick: North Carolina, 27-13 Peper pick: North Carolina, 30-17 Florida at LSU I picked Florida in an upset when Warren Peper and I recorded our sneak-peek Pigskin Picks video Monday morning (available each week at postandcourier.com). So I have to stick with the Gators, who lost quarterback Will Grier to a performance enhancing drug suspension this week. Sapakoff pick: Florida, 24-23 Peper pick: LSU, 34-24 Missouri at Georgia Even without Nick Chubb and coming off back-to-back losses to Alabama and Tennessee, Georgia can still win the SEC East. But the Bulldogs can’t look ahead to their two weeks to get ready for Florida. Sapakoff pick: Georgia, 28-24 Peper pick: Georgia, 30-20 Penn Stateat Ohio State The Nittany Lions quietly are 2-0 in the Big Ten. Ohio State quarterback J.T. Barrett has become a red zone monster. Sapakoff pick: Ohio State, 35-14 Peper pick: Ohio State, 38-20 Last week’s results: Warren Peper 8-2, Gene Sapakoff 7-3 Season: Warren Peper 41-19, Gene Sapakoff 39-21 Follow Gene Sapakoff on Twitter @sapakoff Keywords", "external_links": [], "published": "2015-10-17T08:01:00.000+03:00", "crawled": "2015-10-17T09:26:20.647+03:00", "highlightTitle": ""}