{"organizations": [], "uuid": "92e9e8002092deefe457fa5b7460b30b809ee6a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "savannahnow.com", "main_image": "http://savannahnow.com/sites/default/files/images/sms-default-facebook-share.jpg", "site_section": "http://savannahnow.com/", "section_title": "savannahnow.com | Savannah Georgia's source for News, Entertainment, Sports, Weather, Classifieds, Jobs, Autos, Real Estate and St. Patricks Day", "url": "http://savannahnow.com/accent/2015-10-23/family-relationships-holiday-stress-here", "country": "US", "title": "Family Relationships: Holiday stress is here", "performance_score": 0, "site": "savannahnow.com", "participants_count": 1, "title_full": "Family Relationships: Holiday stress is here | savannahnow.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T19:14:00.000+03:00", "replies_count": 0, "uuid": "92e9e8002092deefe457fa5b7460b30b809ee6a4"}, "author": "Michelle Aycock", "url": "http://savannahnow.com/accent/2015-10-23/family-relationships-holiday-stress-here", "ord_in_thread": 0, "title": "Family Relationships: Holiday stress is here", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Michelle Aycock A reader asked, “Every year my family gets together for the holidays. I can’t believe that the holidays are coming up and I haven’t even planned. My family expects me to plan and do everything. I don’t get along with my mother-in law and I find myself stressed out to the point I get sick. Do you have any advice on how to deal with the upcoming stress I experience from the holidays?”\nThis is a common problem during the holidays. The holidays are supposed to be a time of fun and enjoyment, however this is not the case for some individuals. With the holiday season quickly approaching, trying to accommodate extended family can be difficult and may feel at times impossible, not to mention stressful. When families come together so do the problems. If there is already tension between family members, being under one roof will only intensify problems. But, for the most part, this may be unavoidable during the holidays.\nI know you may feel like you have to do exactly what is expected of you during the holidays. However this is not the case; you really don’t have to. The holidays are a time to celebrate and enjoy family and friends. Choosing to do what you will enjoy is the key.\nJust because in the past you have always assumed certain responsibilities for the holidays and your extended family expects you to continue to do so, does not mean that you have to. If these traditions or assumed responsibilities are causing you stress during the holidays, then do something different.\nHere are some ways you to cope with the upcoming holiday stress:\n• Do what you want to and give yourself a break. To lower holiday stress, decide your limitations and stick with them. Don’t say yes when you really mean no. Try not to take on more than you can handle as this will only add to the stress of the holidays. You may decide that this holiday season you don’t want to plan everything.\n• Realize your family may get upset with you. You can’t control how other people act or what they will say. Don’t expect that you will be able to resolve underlying family issues during the holidays. You would be better off focusing your energies on how you are feeling and making your mind up to enjoy yourself no matter what other family members may say or do.\n• Do something different. If the family tradition is getting together at your house, but this is causing unbearable stress or you’re feeling overwhelmed, then suggest that some other family member host the holiday dinner at their house and that family stay there instead of your place.\nKeep in mind that the holidays are a time of celebration and enjoying your family’s company, hopefully to make happy memories that you can look back on with positive feelings. When planning your upcoming holidays with family, consider your happiness and well-being.\nMichelle Aycock is a licensed psychotherapist. Her office number is 912-233-4294. Her website is www.coastaltherapist.com . Submit a family relationship question at michelle@coastaltherapist.com.", "external_links": ["http://sav-cdn.com/sites/all/themes/savannahnow/images/blank.gif"], "published": "2015-10-23T19:14:00.000+03:00", "crawled": "2015-10-24T11:19:25.400+03:00", "highlightTitle": ""}