{"organizations": [], "uuid": "2d904123145a58965c2a543ed544e10381201358", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.al.com", "main_image": "http://imgick.al.com/home/bama-media/width620/img/alphotos/photo/2015/10/10/18946482-large.jpg", "site_section": "http://impact.al.com/alabama/atom.xml", "section_title": "Alabama Sports", "url": "http://www.al.com/alabamafootball/index.ssf/2015/10/grading_alabamas_27-14_win_aga.html", "country": "US", "title": "Grading Alabama's 27-14 win against Arkansas, position-by-position", "performance_score": 0, "site": "al.com", "participants_count": 1, "title_full": "Grading Alabama's 27-14 win against Arkansas, position-by-position", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T17:05:00.000+03:00", "replies_count": 0, "uuid": "2d904123145a58965c2a543ed544e10381201358"}, "author": "John Talty | jtalty@al.com", "url": "http://www.al.com/alabamafootball/index.ssf/2015/10/grading_alabamas_27-14_win_aga.html", "ord_in_thread": 0, "title": "Grading Alabama's 27-14 win against Arkansas, position-by-position", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments \nIt was an uneven performance in Alabama's fifth win of the season. \nAlabama lost the turnover margin but ultimately defeated Arkansas, 27-14, at Bryant-Denny Stadium on Saturday night. The defense was great as usual, but the offense didn't have its best effort. \nIn reviewing the Tide's fifth win of the season, AL.com grades the performance of each position group against the Razorbacks. \nQuarterbacks: C \nIn what was a pattern on Saturday night, Jake Coker regressed after a nearly flawless performance against Georgia. Coker threw two interceptions -- one on a very bad decision and the other on a pass thrown too high that bounced off Richard Mullaney's hands -- and didn't have the offense in rhythm for much of Saturday night. In his defense, he did handle Arkansas' pressure fairly well and connected on a beautiful long touchdown to Calvin Ridley to give Alabama the lead. It wasn't Coker's worst performance, but he'll need to play better if Alabama is going to beat teams like Texas A&M and LSU. \nRunning backs: B \nDerrick Henry finished with 95 yards and a touchdown, but it was tough sledding against the Razorbacks. With the offensive line unable to get much push, Henry was on his own and got hit in the backfield a few times. He finished with 27 carries – another sign he's going to keep getting a heavy workload – and finished the game with a 3.5 yards per carry average. Kenyan Drake looked better than he had in recent games, finishing with 29 yards on seven carries. It wasn't a standout performance from this group, but it did enough to move the ball on less than ideal circumstances. \nReceivers: B \nRidley was the star of the show for the second game in a row. The true freshman had the 81-yard touchdown and finished with nine catches for 140 yards. He's clearly Alabama's top target right now and Lane Kiffin's preferred deep threat. Mullaney had one pass bounce off his hands though it wasn't entirely his fault. ArDarius Stewart had a nice 37-yard catch and Kenyan Drake was an efficient five catches for 37 yards, but outside of Ridley there wasn't much excitement from the receivers. \nOffensive line: D \nThe offensive line struggled throughout the game against the Razorbacks. Cam Robinson clearly looks to be hampered by something, unable to get much push and committed two penalties though both might have been questionable calls. The offensive line couldn't create many holes or pass protect well, let alone impose its will, setting up for Coker and Henry to both have long nights. It was a major step back from a group that played very well against Georgia the prior weekend. \nDefensive line: A \nIt's the best unit on this team and it proves that every single game. The defensive line totally bottled up Arkansas star running back Alex Collins, who entered the game averaging 159 yards per game but finished with 26 in Tuscaloosa. It pressured Brandon Allen throughout the night, delivering big hits and forcing him to make a few ill-advised throws. A'Shawn Robinson, Jarran Reed and Daron Payne overpowered Arkansas' huge offensive line and won the battle of the trenches. Once the defensive line took away Arkansas' running game, it was just a matter of waiting on the Tide offense to put up some points. \nLinebackers: A \nReggie Ragland was a beast, running all over the field and making a big impact. Nick Saban called it one of Ragland's best performances and it wasn't hard to see why. He finished with a team-high eight tackles, plus a sack, a forced fumble and two quarterback hurries. Dillon Lee had one of the highlights of the night when he blew up Alex Collins' attempted pass block. This unit also deserves credit for totally limiting Collins, one of the SEC's top running backs, to such a meager output. \nSecondary: B+ \nOutside of a late long touchdown, the defensive secondary did a good job limiting Arkansas quarterback Brandon Allen's options. Eddie Jackson had his team-best third interception, Minkah Fitzpatrick had two pass break ups and Cyrus Jones did a nice job in coverage against the Razorbacks' top receiver Drew Morgan. This unit will be greatly tested next week against Texas A&M's talented group of receivers. \nSpecial teams: C- \nAdam Griffith's regression is the big reason for the \"C-\" grade. Griffith, who entered the game having made his last five field goals, missed two against the Razorbacks, including a chip from 25 yards, to leave Nick Saban with more questions about the kicking position. The one positive from this unit was the old J.K. Scott was back, booming big kicks throughout the night.", "external_links": [], "published": "2015-10-12T17:05:00.000+03:00", "crawled": "2015-10-12T17:42:28.988+03:00", "highlightTitle": ""}