{"organizations": [], "uuid": "76fa94c9a1e6f47bd3f9ec2c0c39e0666574e3e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sportsnews.com.au", "main_image": "http://sportsnews.com.au/defaultimage.jpg", "site_section": "http://www.sportsnews.com.au/category/afl/feed", "section_title": "Sports News Australia » AFL News", "url": "http://www.sportsnews.com.au/afl/daniel-chick-does-not-lie-brereton/158563", "country": "US", "title": "Daniel Chick does not lie: Brereton", "performance_score": 0, "site": "sportsnews.com.au", "participants_count": 1, "title_full": "Daniel Chick does not lie: Brereton", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:50:00.000+03:00", "replies_count": 0, "uuid": "76fa94c9a1e6f47bd3f9ec2c0c39e0666574e3e8"}, "author": "AAP", "url": "http://www.sportsnews.com.au/afl/daniel-chick-does-not-lie-brereton/158563", "ord_in_thread": 0, "title": "Daniel Chick does not lie: Brereton", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Daniel Chick does not lie: Brereton Posted by AAP + on 02/10/2015 at 10:50 am AFL GRAND FINAL OFFER! If your team leads at any break but loses, CASH BACK up to $100!* PLUS Sign up now for a $501 Bonus Bet! \nHawthorn legend Dermott Brereton has backed Daniel Chick’s honesty in the wake of his explosive allegations about West Coast’s drug culture during the mid-2000s. \nBrereton said he had a deep friendship with Chick and believed he spoke out about illicit and prescription drug use at the Eagles to rid himself of a burden. \n“I know Daniel’s a really honest character and when he gets on a roll he tends to tell the truth,” Brereton told SEN radio. \n“He needs to expunge himself of the burden, the weight of the knowledge he’s been carrying in his mind. \n“I wish it didn’t happen but I understand why it did come out.” \nBrereton said there was no one from Hawthorn, where Chick played 149 games before switching to West Coast, who would say a bad word about him. \n“Daniel Chick, I’ve never known to tell one lie,” Brereton said. \nDaniel Kerr, 2006 Norm Smith Medallist Andrew Embley and fellow former Eagle Karl Langdon all blasted Chick for his allegations. \nBrereton said some people in Western Australia unfairly blamed Chick for fallen star Ben Cousins’ drug addiction. \n“They want to create and paint a boogeyman that actually brought this trouble on – that wasn’t Daniel Chick,” Brereton said. \nBrereton said Chick had admitted to him that he was “no angel”, but he had tried to protect Cousins. \nChick told News Corp that he and former premiership teammates Cousins and Kerr took massive doses of asthma drug prednisone and the use of cocaine, ecstasy and methamphetamine was widespread throughout the squad. \nBrereton said Chick felt he was encouraged to play through damaging bouts of asthma, a disease which killed Chick’s brother. \n“I’ve seen the pictures of his throat and honestly it’s like somebody put his throat in the vice and started hitting it, squeezing the vice and hammering it,” Brereton said. \n“I think there’s a duty of care there for people who were his employers to look after and assist him.” \n“This is Daniel’s feelings – he’s left footy and footy has sucked him dry.”  ", "external_links": [], "published": "2015-10-02T03:50:00.000+03:00", "crawled": "2015-10-02T03:54:51.730+03:00", "highlightTitle": ""}