{"organizations": [], "uuid": "3863ba2e29628d09245aba555b0a4508fd93babc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "kentuckysportsradio.com", "main_image": "http://kentuckysportsradio.com/wp-content/uploads/2014/09/rip-their-heads-off-vandy-uk-phtog-bad-300x200.jpg", "site_section": "http://kentuckysportsradio.com/comments/feed/", "section_title": "Comments for Kentucky Sports Radio", "url": "http://kentuckysportsradio.com/main/btis-rants-and-ramblings-uk-footballs-first-step-beat-mississippi-state-and-vanderbilt/", "country": "US", "title": "Comment on BTI’s Rants and Ramblings: UK Football’s First Step? Beat Mississippi State and Vanderbilt by 8 god", "performance_score": 0, "site": "kentuckysportsradio.com", "participants_count": 1, "title_full": "Comment on BTI’s Rants and Ramblings: UK Football’s First Step? Beat Mississippi State and Vanderbilt by 8 god", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T15:36:00.000+03:00", "replies_count": 0, "uuid": "3863ba2e29628d09245aba555b0a4508fd93babc"}, "author": "8 god", "url": "http://kentuckysportsradio.com/main/btis-rants-and-ramblings-uk-footballs-first-step-beat-mississippi-state-and-vanderbilt/", "ord_in_thread": 0, "title": "Comment on BTI’s Rants and Ramblings: UK Football’s First Step? Beat Mississippi State and Vanderbilt by 8 god", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted in Main | 2 Responses \nAlong with UK’s 5/6 SEC East opponents every year, UK has also played Mississippi State every single season since the league expanded before the 1992 season. I think it is safe to say that for the 2 divisions, the weakest teams historically are Vanderbilt in the East and Mississippi State in the West. Doesn’t mean those programs haven’t had good teams/seasons during the last 23 years or that Kentucky hasn’t been a worse program at certain times that either. But it simply means that over the course of the last 23 years, those are the worst programs in their respective divisions. \nWith that said, there is so much talk about how Kentucky football can make this work. We’ve completely blown chances against Florida and Auburn already this year, but let’s be honest, those are elite programs. Maybe not great teams this year, but elite PROGRAMS. Kentucky is trying to build an elite program. And the first step in doing that is beating the bottom feeders of your league year in and year out. For Kentucky, they get lucky. They obviously get Vanderbilt every year but also the worst team in the West too. They got the best draw of any team. What have they done with that? Very, very little. Since 1992, take a look at how UK has done against those 2 opponents: \n(out of 23 seasons total) Beat both Vandy and MSU: 5 times ( 2006 , 2005, 2002, 1998 , 1996) Beat Vandy, Lost to MSU:8 times (2014, 2010, 2009, 2007 , 2004, 2001, 1999 , 1997) Beat MSU, Lost to Vandy: 3 times ( 2008 , 2003, 1993 ) Lost to both Vandy and MSU: 7 times (2013, 2012, 2011, 2000, 1995, 1994, 1992) \n*those in bold were bowl-eligible years (*2002 won 7 games but was bowl ineligible) \nYear in and year out, Vanderbilt and Mississippi State are the 2 worst conference opponents on UK’s schedule. And only 5 times in 23 seasons have they been able to beat both in a season. That completely hamstrings you from having big seasons. Kentucky may have already shot themselves in the foot for a big season with the home losses to Florida and Auburn, but if they want to turn this into a good season, they need to beat both of these teams. Unfortunately MSU has become quite a good team the last couple seasons but once Dax Prescott leaves that program will slide back down. Even still, this is a WINABLE game on the UK schedule. Ranking the most likely wins, Mississippi State was near the top of most people’s list. UK needs to convert this game to make up for Florida or Auburn. \nMark Stoops is currently 1-3 against Vandy and Mississippi State. For the future, winning these 2 games is a must. If this program wants to be taken seriously at all, step 1 is not losing games you should win. Saturday could be the start of that. Article written by Bryan the Intern 2 responses to “BTI’s Rants and Ramblings: UK Football’s First Step? Beat Mississippi State and Vanderbilt” carvingitup October 22, 2015 at 8:13 am | Permalink | Reply \nDon’t leave out Tennessee in your ramblings! If we can stop the UTK running game we can win. All focus needs to be on MSU, we need this game in the worst way! 8 god October 22, 2015 at 8:36 am | Permalink | Reply \nBTI, you suck.", "external_links": [], "published": "2015-10-22T15:36:00.000+03:00", "crawled": "2015-10-22T15:37:36.862+03:00", "highlightTitle": ""}