{"organizations": [], "uuid": "32f9c883ee54473428ba7a65ce08da63df1cf15c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theglobeandmail.com", "main_image": "http://static.theglobeandmail.ca/00e/sports/baseball/article26794601.ece/ALTERNATES/w620/sp-bb-kelly-1013.JPG", "site_section": "http://www.theglobeandmail.com/sports/", "section_title": "Sports - The Globe and Mail", "url": "http://www.theglobeandmail.com/sports/baseball/kelly-with-jays-season-on-the-line-time-to-go-for-broke-and-open-dome/article26794602", "country": "CA", "title": "Kelly: With Jays’ season on the line, time to go for broke and open dome", "performance_score": 0, "site": "theglobeandmail.com", "participants_count": 16, "title_full": "Kelly: With Jays’ season on the line, time to go for broke and open dome - The Globe and Mail", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T04:27:00.000+03:00", "replies_count": 16, "uuid": "32f9c883ee54473428ba7a65ce08da63df1cf15c"}, "author": "Cathal Kelly", "url": "http://www.theglobeandmail.com/sports/baseball/kelly-with-jays-season-on-the-line-time-to-go-for-broke-and-open-dome/article26794602", "ord_in_thread": 0, "title": "Kelly: With Jays’ season on the line, time to go for broke and open dome", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A A There are a number of good, logistical reasons why the dome at the Rogers Centre needs to be closed during Wednesday afternoon’s deciding game of the American League Division Series.\nAfter more than 25 years of use, the mechanism that controls the roof has middle-aged performance issues. It has trouble getting going in the cold. At 15 C, it starts getting creaky. Around 10 C, you risk a small contraction of the structure which may knock the motors that move the roof out of sync.\nGlobe and Mail Update Oct. 14 2015, 11:36 AM EDT Video: Why the MLB has made the call to keep the roof closed at the Rogers Centre There is the real chance that, once opened on what most would call a mild autumn day, the roof cannot be closed again. It’s gotten stuck before. Once stuck, it is preposterously vulnerable.\nUnlike outdoor arenas, the Rogers Centre has no drainage system. If it gets sufficiently wet, it’s not a ballpark any more. It’s an aquarium.\nConsider this, people: You and I spent more than $500-million to build something that is less impervious to the elements than the shed in your backyard.\nRogers Communications Inc., the owner and operator of the team and the building, has taken a hellacious amount of stick from locals over the roof. People are still going to the park in shorts.\nRogers is acting as if the games are being played in Kamchatka.\nThe man out front is Blue Jays’ senior vice-president Stephen Brooks. He’s become a bit of a social-media jiu jitsu artist – the angrier fans get at him about the miserable lid, the more reasonable Mr. Brooks becomes.\n“We would love the roof to be open. Baseball is meant to played outdoors,” he said Tuesday.\nWell, there you go. Let’s talk about that feeling. I mean, what’s the worst that can happen?\n“The risk is damaging the roof such that it cannot be closed again, causing millions of dollars of damage and making the building unplayable.”\nOh.\nNow that they’re in the playoffs, the Toronto Blue Jays do not have the final say on whether the dome can be opened. That rests with the office of the commissioner of baseball, Rob Manfred.\nThe commissioner’s office is not interested in mechanical issues or the temperature, per se. It only insists that whatever condition the roof is in when the teams take batting practice – opened or closed – must be maintained until the completion of the game.\nAs of this writing, the forecast for Wednesday at 4 p.m. – when the Jays will go do-or-die with the Texas Rangers – is clear and 13 C. There is a slight chance of rain, but when isn’t there?\nThat’s on the edge, but we’ll be audacious, right?\n“If I had to guess – and it’s not my decision – the roof will be closed,” Mr. Brooks said Tuesday.\nSo we’re out of luck.\nPractically, it makes sense.\nThis is not a time to be practical.\nThe Jays are a team driven by power. When closed, the dome is a concrete power dampener. The air stills and thickens. The ball does not travel off the bat. Outdoor home runs become indoor shots to the warning track.\nIn the 13th inning of Game 2, Josh Donaldson hooked a ball to the second deck in left field. It curled foul by a few metres. If the dome’s open and the wind is swirling, that’s probably a home run and the Jays aren’t playing Wednesday. They’re resting up, waiting for the winner of Kansas City-Houston.\nInstead, they got small-balled to death and here we are.\nThe numbers are unequivocal. Toronto had one of the best home records in baseball this season, but there was a profound disconnect between how the Jays did with the roof open (38-14) and with it closed (11-14). That is too big a spread to be an anomaly.\nThat roof-closed record has worsened by two losses in the playoffs.\nThis spat between fans and officials has been framed largely as an issue of aesthetics – Rogers Centre is a claustrophobic, humid pillbox when sealed.\nBut there is the very real potential that an engineering issue may cost the fan base its overdue postseason celebration. The numbers certainly suggest that. Is ownership really going to let that happen if there’s even a small chance it might affect the outcome?\nTeams spend many millions on players who don’t work out, and think nothing of it. But the idea of having to replace a motor or pull out a few seats is an economic bridge too far? Seriously?\nRogers stands to make a significant sum from another playoff round. That profit effect will echo through next year. What’s that worth when weighed against the risk of a roof malfunction?\nIsn’t this why people get into business? To take risks? This seems to be a rather low one.\nOne of the virtues of having means is that you can pay for new toys. I’m sure you’ve noticed your phone bill; Rogers can afford to refurbish something it bought for a nickel on the dollar.\nThe bottom line is this: It is the responsibility of the people who maintain the building to safeguard it. That’s why they draw a cheque.\nAs the people who provide the means for that cheque, fans have no similar responsibility.\nA lot of people have paid a lot of money to watch mediocre baseball over the past 20 years. They’ve paid for Rogers Centre several times over. They’ve earned the right to break it. And once broken, it can be fixed. Because everything can be fixed.\nAbsolute worst-case scenario – the Jays play a World Series in High Park. I’m up for it.\nThis year, Jays management took several imaginative leaps to transform the team. Trading away a zillion prospects for Troy Tulowitzki, David Price et al looks like genius now.\nIt most certainly would not if the Jays had folded up in the last couple of weeks of the regular season. People would be getting fired. Instead, they’re heroes.\nIt’s time for their employers to be as bold.\nOn an accountant’s spreadsheet, it isn’t a good idea to open the dome on Wednesday. But sometimes it’s fun to be bad. It’s even more fun to win.\nFollow Cathal Kelly on Twitter: @cathalkelly\n BASEBALL Game 5 hasn’t started yet, but the Blue Jays are already winning Twitter\nBlue Jays fans 'come together’ to celebrate team’s Game 4 win\nRe-signing ace David Price begins with respect during the postseason\nTopics: Toronto Blue Jays Comments Print /\nLicense A A", "external_links": ["http://admin.brightcove.com/js/BrightcoveExperiences.js", "https://accounts.brightcove.com/en/terms-and-conditions/.", "http://license.icopyright.net/g2/3.8425?icx_id=26794602", "https://twitter.com/@cathalkelly", "http://license.icopyright.net/3.8425?icx_id=26794602"], "published": "2015-10-14T04:27:00.000+03:00", "crawled": "2015-10-15T02:01:24.275+03:00", "highlightTitle": ""}