{"organizations": ["Delta High School", "Star Press"], "uuid": "aad30514cc00b33fbceeb43f82e1fb539767bc22", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestarpress.com", "main_image": "http://www.gannett-cdn.com/-mm-/a8260c801dd4b5ece46ce6ab9cdc305be22e537b/c=0-286-5616-3459&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/01/INGroup/Muncie/635793254430698861-MNI-0929-HazmatSituationPICKS09.JPG", "site_section": "http://rssfeeds.thestarpress.com/muncie/sports/", "section_title": "Muncie - Sports", "url": "http://www.thestarpress.com/story/sports/high-school/2015/10/22/ian-landwehr-keeps-grandfather-mind-state/74254790/", "country": "US", "title": "Ian Landwehr keeps grandfather in mind at state", "performance_score": 0, "site": "thestarpress.com", "participants_count": 0, "title_full": "Ian Landwehr keeps grandfather in mind at state", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T23:50:00.000+03:00", "replies_count": 0, "uuid": "aad30514cc00b33fbceeb43f82e1fb539767bc22"}, "author": "", "url": "http://www.thestarpress.com/story/sports/high-school/2015/10/22/ian-landwehr-keeps-grandfather-mind-state/74254790/", "ord_in_thread": 0, "title": "Ian Landwehr keeps grandfather in mind at state", "locations": ["Dakota Crawford"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ian Landwehr", "Corey", "Landwehr"], "text": "Ian Landwehr keeps grandfather in mind at state Dakota Crawford , dmcrawford@muncie.gannett.com 5:45 p.m. EDT October 22, 2015 Buy Photo Yorktown's Ian Landwehr celebrates after his 102 career win Thursday evening at the tennis sectional held at Delta High School. Landwehr holds the record for wins in the state after the victory. (Photo: Corey Ohlenkamp/The Star Press, Corey Ohlenkamp/The Star Press) Buy Photo CONNECT TWEET LINKEDIN COMMENT EMAIL MORE \nMUNCIE — Three times Ian Landwehr has played in the tennis semifinals at the Indiana state tournament, and three times he’s lost. He’s won an Indiana state record 105 matches in his high school career, but never that state championship. \nTo win, he says, would mean more than he can put in words. Overcoming three consecutive losses at the state level would mean a lot, but this year’s tournament means even more for the senior. \n“Earlier… I stated that this year was dedicated to my grandfather that passed away,” he said. “That stands true.” \nWhile Landwehr spent five weeks playing tennis in Dusseldorf, Germany, his grandfather — the man that encouraged Landwehr to give up baseball and soccer — died. It was July 7, leaving Landwehr abroad for about a month, playing through the pain of losing one of his biggest fans. \nHis flight home landed one day before Yorktown’s school year began. He was tired and emotional for those first couple weeks, but it didn’t take him long to get on top of things and refocus. \n“I realized what I was playing for,” he said. \nThis year’s draw doesn’t leave Landwehr an easy path to the championship that he'd so much like to win and tribute to his grandfather. He’ll first play North Central senior Steven Christie, who is 17-1 this season. If he wins there, he could find himself playing Richmond junior Eric Hollingsworth, who is a perfect 21-0 this season. \nNow, Landwehr himself is 18-1 this season. But, his one loss this season was courtesy of Hollingsworth. Landwehr said he had just a few mistakes in that match, and Hollingsworth capitalized. \nHe’s been on a roll since that loss, though, with a nearly-perfect showing at the regional where he gave up just one point in two matches. \n“Knowing that I’ll get another chance at Eric (Hollingsworth) is what motivates me,” Landwehr said. “It’s been making me work so much harder the last couple weeks.” \nHis coach, Bob Darby, has been with Yorktown for three seasons. He’s seen Landwehr mature and build confidence through a semester in California, that playing time in Germany and three trips to the state tournament. \nOf course, Darby is careful not to be overconfident. He says they’ll take it one match at a time, focusing on their first match against Christie, not the potential for a rematch with the sole player to knock off Landwehr this season. \n“There’s no worth in talking about Hollingsworth when we’re not there yet,” Darby said. \nIt will be a state tournament nine years in the making for Landwehr. He’s eyeing college tennis, hopefully with a Big Ten or Atlantic Coast Conference team, but he’s careful not to lose sight of the task at hand. \nAll the while he’s glad he made the choice to stick with this sport, with the support of his grandfather. \n“He was the one that told me to stick with what I believed in,” Landwehr said. “Tennis is what I believe in. Just because of him, I’m still in this sport and doing as well as I am.” \nContact Ball State sports reporter Dakota Crawford at dmcrawford@muncie.gannett.com or follow @DakotaCrawford_. Read or Share this story: http://tspne.ws/1RZxqbG TOP VIDEOS", "external_links": [], "published": "2015-10-22T23:50:00.000+03:00", "crawled": "2015-10-23T01:20:58.230+03:00", "highlightTitle": ""}