{"organizations": [], "uuid": "19539fa2d7a6633e9466b2955dce9d7cae11bb17", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/sport/don-t-shift-coach-wrestlers-urge-haryana-govt/149979.html", "country": "US", "title": "Don’t shift coach, wrestlers urge Haryana govt", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "Don’t shift coach, wrestlers urge Haryana govt", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T03:00:00.000+03:00", "replies_count": 0, "uuid": "19539fa2d7a6633e9466b2955dce9d7cae11bb17"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/sport/don-t-shift-coach-wrestlers-urge-haryana-govt/149979.html", "ord_in_thread": 0, "title": "Don’t shift coach, wrestlers urge Haryana govt", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sunit Dhawan\nTribune News Service\nRohtak, October 23\nThe Haryana government’s move to transfer wrestling coach Mandeep from Chhotu Ram Stadium in Rohtak to Panipat has not gone down well with the budding sportspersons of the town and the nearby areas. The coach has been training sportspersons in Rohtak for the last few years and has been instrumental in the success of women wrestlers of the area. The women wrestlers have urged the state authorities to reconsider their decision as his transfer will have an adverse impact on the wrestlers’ preparation for the upcoming national and international events. As many as 60 wrestlers, including 25 girls, at the Chhotu Ram Stadium have lamented that transferring their coach at this juncture would have an adverse impact on their preparations for the big events in the near future. “A coach plays a significant role in the success of a sportsperson. Mandeep sir has been working with us for a long time and he understands our problems and requirements well. If he is transferred, it will be a big setback for all of us,” said Sakshi Malik, a Commonwealth silver medalist. International wrestlers Seema and Neetu also maintain that the absence of the coach would affect their training. Their concern is echoed by other international athletes such as Suman, Deepak, Reena, Pinki, Bhim, Samiksha, Nikki, Ritu, Teena and Rekha. As many as 12 girls and two boys from the centre have performed well at the international level.", "external_links": [], "published": "2015-10-24T03:00:00.000+03:00", "crawled": "2015-10-24T20:14:58.127+03:00", "highlightTitle": ""}