{"organizations": [], "uuid": "1524eb4815475481f6b9de5b100174ce00096eb8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.syracuse.com", "main_image": "http://imgick.syracuse.com/home/syr-media/width620/img/buffalo-bills/photo/2015/10/22/19023560-standard.jpg", "site_section": "http://impact.syracuse.com/sports/atom.xml", "section_title": "Syracuse &amp; Central NY Sports", "url": "http://www.syracuse.com/buffalo-bills/index.ssf/2015/10/ej_manuel_on_facing_doug_marrone_old_coach_buffalo_bills_london.html", "country": "US", "title": "Buffalo Bills QB EJ Manuel calls facing Doug Marrone in London 'an afterthought'", "performance_score": 0, "site": "syracuse.com", "participants_count": 1, "title_full": "Buffalo Bills QB EJ Manuel calls facing Doug Marrone in London 'an afterthought' | syracuse.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T22:19:00.000+03:00", "replies_count": 0, "uuid": "1524eb4815475481f6b9de5b100174ce00096eb8"}, "author": "Matthew Fairburn | mfairburn@syracuse.com", "url": "http://www.syracuse.com/buffalo-bills/index.ssf/2015/10/ej_manuel_on_facing_doug_marrone_old_coach_buffalo_bills_london.html", "ord_in_thread": 0, "title": "Buffalo Bills QB EJ Manuel calls facing Doug Marrone in London 'an afterthought'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Hertfordshire, England — If Buffalo Bills quarterback EJ Manuel has built up hard feelings toward the coach that benched him in 2015, he did his best to hide those feelings when meeting with the media Thursday in England.\nRex Ryan declared Tyrod Taylor out for the Bills' game against the Jaguars in London, meaning Manuel will get to start against the Jacksonville Jaguars, who have Doug Marrone and Nathaniel Hackett on their staff. Marrone was Manuel's head coach for his first two seasons in the league, while Hackett was his offensive coordinator.\n\"Yeah, obviously I know coach Marrone and coach Hackett are both on their staff,\" Manuel said. \"I'm not necessarily playing against them, though. I'm playing against their defense. That's my main focus is preparing for Jacksonville's defense. The other stuff is kind of an afterthought.\"\nStill, it's tough for Manuel to deny having a bit of added motivation. Marrone benched him just 14 starts into his career, and Manuel wasn't able to work his way back into the lineup until last week. It's not bad timing for Manuel to be in the lineup.\n\"Yeah, no question,\" Manuel said. \"I definitely want to help our team win. At the end of the day, we want to get this win and move forward into our bye week and after that get on a role. That's the main goal for me.\"\nManuel did his best to deflect questions about how Marrone was as a coach and didn't want to say he holds any grudge. The smile on his face said everything about what this game means to him. The mere mention of Marrone's name got a reaction from Manuel. Of course, he just wants to win, but to do so against the guy who didn't think he was good enough would be a bit sweeter.", "external_links": [], "published": "2015-10-22T22:19:00.000+03:00", "crawled": "2015-10-22T17:40:27.727+03:00", "highlightTitle": ""}