{"organizations": [], "uuid": "a5d3765541dc8a73c427b76a22f3dae70dd2ec2a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nola.com", "main_image": "http://imgick.nola.com/home/nola-media/width620/img/tpphotos/photo/2015/09/26/18841100-large.jpg", "site_section": "http://www.nola.com/lsu/index.ssf/2015/10/", "section_title": "LSU Tigers Football, Baseball, Basketball | Sports &amp; Athletics NOLA.com", "url": "http://www.nola.com/lsu/index.ssf/2015/10/leonard_fournette_as_plenty_to.html", "country": "US", "title": "Not so fast -- Leonard Fournette has plenty to gain by staying at LSU: Jeff Duncan", "performance_score": 0, "site": "nola.com", "participants_count": 6, "title_full": "Not so fast -- Leonard Fournette has plenty to gain by staying at LSU: Jeff Duncan | NOLA.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T02:03:00.000+03:00", "replies_count": 5, "uuid": "339cb66fa547ac662807cc57319ca04113b9daa8"}, "author": "Jeff Duncan, NOLA.com | The Times-Picayune", "url": "http://www.nola.com/lsu/index.ssf/2015/10/leonard_fournette_as_plenty_to.html#post-0", "ord_in_thread": 0, "title": "Not so fast -- Leonard Fournette has plenty to gain by staying at LSU: Jeff Duncan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A month ago Leonard Fournette wasn't even considered the best running back in the SEC. He was a second-tier candidate for the Heisman Trophy.\nNow folks want the LSU sophomore to jump straight into the NFL Draft?\nTalk about rushing to judgment.\nThis might the biggest knee-jerk reaction college football has seen since Beano Cook pegged Ron Powlus to win two Heisman Trophies.\nWe live in a microwave society. Everybody wants everything right now, this quick. In today's technology-driven world, no one wants to wait for anything.\nSometimes that's a good thing. Egg Genies and Uber, for example.\nSometimes, though, it's better to allow things to mature at the proper rate -- things like college football players.\nLeonard Fournette just might be the best player in college football. He certainly has looked that way for the first month of the season. And he might indeed be the rare college player capable of making an early jump to the NFL after his second season.\nBut I ask, what's the hurry? Fournette has played a total of 15 college games. Fact is, he's just now getting good at the game after leaning the game's idiosyncrasies as a freshman. Let him enjoy it for a little while.\nI understand the argument.\nLes Miles: Leonard Fournette getting more 'attention' from foes, media | Video LSU coach Les Miles talks to the media at Monday's press conference.\nEveryone knows the Marcus Lattimore story. He was South Carolina's version of Fournette five years ago. Then came a series of devastating knee injuries. Lattimore was drafted in the fourth round of the 2013 NFL Draft but never recovered from his injuries and retired from football in November.\nNo one wants to see another Lattimore situation.\nAnd I understand those that argue about the principle of the matter, that no one should stand in the way of someone's ability to earn a living.\nObviously, most 20-somethings aren't ready physically or mentally for the demands of professional sports, but Kobe Bryant, Serena Williams and Jordan Speith have proven there are exceptions to the rule in every sport.\nThe outrage reached epic proportions this week. After watching Fournette run roughshod over his opponents for a third straight game, seemingly every media member in America has blasted the NFL for its age-limit restrictions and ripped the NCAA again for its onerous control.\nHas anyone considered how hypocritical this argument is?\nFirst, we rip the NFL for its slow embrace of player safety. Now, we want 20-year-olds to trade hits with men twice their age.\nMoreover, no one seems to be listening to the only opinion that really matters: Fournette, himself. Instead of speaking for him, maybe we should listen to him.\nFournette told ESPN's Joe Schad after the Auburn game that he doesn't think players should be able to turn pro after their sophomore seasons because they may be ready physically but not mentally.\nAnd there's some merit to that idea. Fournette is unquestionably ready for the next level physically. Auburn can attest. But mentally? Well, that's another question altogether.\nFournette is mature beyond his years but he's also just 18 months removed from high school. It's easy to forget that he just turned 20 in January. And then you see his braces and watch him while away an afternoon with his buddies playing video games and you remember how looks can be deceiving.\nMaybe that's why Fournette, in the midst of the media firestorm this week, tweeted, \"I will never jump ship ... drowning with my brothers.\"\nSounds like someone more than content to live in the precious present.\n\"The reality of it is Leonard is a squared-away guy,\" Miles said on his weekly radio show on Wednesday. \"He'll do the right thing. I'm for him.\"\nMiles understands the situation better than anyone. He knows Fournette is a unique talent. He might not say so publicly, but he fully understands the business side of Fournette's situation. And trust me, so does Fournette and his team of advisers. Why do you think Miles said he and Fournette have had \"lengthy conversations\" about insurance policies?\nMiles said he and his staff are monitoring Fournette's carries, and I have no doubt they will going forward. Even Miles' most ardent critics acknowledge the man genuinely cares about the best interests of his players, maybe even to a fault.\nGreat players like Herschel Walker and Adrian Peterson actually saw their touches reduced as their college careers progressed. I expect LSU to employ a similar method of operation with Fournette.\nAnd forget this notion that Fournette has little to gain by playing football at LSU. Myriad reasons exist for him to stay in school.\nFirst, Fournette will have a chance to win a national title and cement his legacy as perhaps one of the greatest players in LSU history. Legacy might not mean anything to some people, but it does to Fournette.\nSecond, he'll have another chance to be coached and trained by some of the best in the business, Frank Wilson, Cam Cameron and Tommy Moffitt. At LSU, he'll continue to improve his blocking, pass catching and explosiveness, all areas NFL scouts would like to see him enhance. Again, there's a value to such elite coaching and training.\nAnd, third, he can continue to build his brand. Playing on national television every other week is invaluable. LSU provides a powerful platform for Fournette to bolster his Q Rating.\nReggie Bush landed more than $11 million in endorsement deals before he stepped foot on an NFL field thanks to Southern Cal's high profile. Similar opportunities will await Fournette if he continues on a similar path.\nIn fact, I'd argue he will only enhance his draft stock and marketing portfolio by playing another year.\n\"We just want Leonard to go to class, go to football, enjoy a smattering of media opportunities and play ball on Saturday and have fun,\" Miles said. \"Have fun with his college. I think the approach we have is a quality one.\"\nI couldn't have said it better myself. How many times can you say that about a Les Miles Quote: ?", "external_links": [], "published": "2015-10-02T02:03:00.000+03:00", "crawled": "2015-10-02T06:15:38.716+03:00", "highlightTitle": ""}