{"organizations": [], "uuid": "de3d810aef8a195bbb89c64f85a030f1992d9dbe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.contracostatimes.com", "main_image": "http://local.contracostatimes.com/common/dfm/assets/logos/1200x627/contracostatimes.png", "site_section": "http://feeds.contracostatimes.com/mngi/rss/CustomRssServlet/571/225005.xml", "section_title": "Sports", "url": "http://www.contracostatimes.com/business/ci_29025952/yahoos-groundbreaking-stream-nfl-game-garners-15-million?source=rss", "country": "IL", "title": "Yahoo's groundbreaking stream of NFL game garners 15 million viewers", "performance_score": 0, "site": "contracostatimes.com", "participants_count": 1, "title_full": "Yahoo's groundbreaking stream of NFL game garners 15 million viewers", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T22:30:00.000+02:00", "replies_count": 0, "uuid": "de3d810aef8a195bbb89c64f85a030f1992d9dbe"}, "author": "Paresh Dave \n\nLos Angeles Times", "url": "http://www.contracostatimes.com/business/ci_29025952/yahoos-groundbreaking-stream-nfl-game-garners-15-million?source=rss", "ord_in_thread": 0, "title": "Yahoo's groundbreaking stream of NFL game garners 15 million viewers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Yahoo's groundbreaking stream of NFL game garners 15 million viewers By Paresh Dave Posted: 10/26/2015 01:30:02 PM PDT Updated: 10/26/2015 01:30:08 PM PDT Just over 15 million people across the world watched the National Football League's first free, online live stream of a game. \nYahoo paid $17 million for the rights to stream Sunday's matchup between the Jacksonville Jaguars and Buffalo Bills, which took place in London and aired at 6:30 a.m., according to Bloomberg. That's slightly under the rights price for a typical game, according to analyst estimates. \nOn Monday, the NFL and Yahoo declared the experiment a success. The audience total put the stream somewhere between average TV viewership for Monday Night Football at 13.5 million and Thursday Night Football at 17.6 million, the NFL said. \nYahoo said it sold all the advertising spots for the game but had to cut average prices in half to $100,000, Reuters reported. \nThe Jaguars-Bills game was by no means a big one, and likely wouldn't have garnered the same audience had it only been on TV. The NFL estimated that about 1 million people watched on TV in Buffalo, Jacksonville and the United Kingdom or online in China through a separate service. \n\"We're thrilled with the results of our initial step distributing an NFL game to a worldwide audience and with the work of our partner, Yahoo,\" Hans Schroeder, senior vice president for media strategy, business development and sales for the NFL, said in a prepared statement. Advertisement \nInvestors haven't seen much value in Yahoo, which draws millions of users to a mix of email services, news and other content but hasn't translated that into strong revenue growth. The NFL test could open the door to bigger sports-streaming deals, though it's unclear whether Yahoo made money off the stream. Yahoo shares sharply rose early Monday before falling flat, like the broader stock market. \nThe service was capable of delivering video in HD at 60 frames per second, and analysts said that they saw few complaints about the quality.", "external_links": [], "published": "2015-10-26T22:30:00.000+02:00", "crawled": "2015-10-26T22:36:24.428+02:00", "highlightTitle": ""}