{"organizations": ["Eastern Kentucky"], "uuid": "50d2efdf089ea93cc2f7c6306cce3d1dbbd33dca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pendletontimespost.com", "main_image": "", "site_section": "http://pendletontimespost.com//feed/sec/6000/", "section_title": "PendletonTimesPost.com - Sports News", "url": "http://www.pendletontimespost.com/view/story/54e9f8c499254fc7a57c16d8cfe1f484/FBC--E-Kentucky-Kentucky/", "country": "US", "title": "Kentucky aims to avoid a letdown against Eastern Kentucky", "performance_score": 0, "site": "pendletontimespost.com", "participants_count": 0, "title_full": "Kentucky aims to avoid a letdown against Eastern Kentucky", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T19:33:00.000+03:00", "replies_count": 0, "uuid": "50d2efdf089ea93cc2f7c6306cce3d1dbbd33dca"}, "author": "", "url": "http://www.pendletontimespost.com/view/story/54e9f8c499254fc7a57c16d8cfe1f484/FBC--E-Kentucky-Kentucky/", "ord_in_thread": 0, "title": "Kentucky aims to avoid a letdown against Eastern Kentucky", "locations": ["Missouri", "Kentucky", "Eastern Kentucky"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["GARY B."], "text": "After upsetting Missouri, Kentucky aims to avoid letdown against neighboring Eastern Kentucky By GARY B. GRAVES AP Sports Writer   12:33 pmLast   12:33 pm   \nPeople: \n\nLEXINGTON, Kentucky — Kentucky vows there won't be a letdown this week. \nThe Wildcats want to avoid what would be their worst nightmare — getting upset coming off an emotional win against a ranked opponent. \nKentucky hosts FCS Eastern Kentucky this Saturday, a Bluegrass neighbor with everything to gain against a Southeastern Conference counterpart that stands to lose more than just a game if they are complacent. \nThe Wildcats ended their 18-game losing streak against ranked teams with last week's 21-13 win over then-No. 25 Missouri. Kentucky is looking for its second straight 4-1 start in Saturday night's non-league matchup against EKU (2-1), which aims for its first series win over the Wildcats in four tries. \nThe Colonels routed Austin Peay 51-13 last week and have scored 50 points in both of their victories. Kentucky coach Mark Stoops has stressed that explosiveness to keep players focused. \n\"There are a lot of plays and schemes that we see a lot from different people,\" Stoops said this week of EKU. \"Everybody gets creative and tries to do different things for certain games, but I see a good football team that's well-coached.\" \nThough the on-field history between the schools located about 30 miles apart has been sporadic, an off-field incident in January between players from both programs has caused concern over whether lingering emotions will carry over to Saturday night. \nA scuffle between players in a Richmond, Kentucky, bar near EKU's campus left Colonels player Colton Scurry hospitalized with facial fractures. Wildcats quarterback Drew Barker was punched in the head by EKU player Patrick Graffree, a former Wildcat, during another confrontation in an EKU dormitory. \nA grand jury did not indict any of the players involved in either incident, but EKU suspended Scurry and Graffree. They were reinstated in July. \nStoops said he talked to EKU coach Dean Hood this week to head off any potential problems and promised earlier this week to discipline any Wildcat for chippy play. Kentucky junior linebacker Jason Hatcher said the chance to follow up a big victory by beating a local rival has kept the team's attention. \n\"EKU has some good guys out there, so we can't be sleeping on them,\" Hatcher said. \nHere are some things to watch when Eastern Kentucky visits Kentucky: \nRED ZONE PROFICIENCY: Kentucky is tied for first nationally by converting all 12 opportunities inside the 20, including eight touchdowns. The Wildcats have converted 23 straight red-zone chances dating back to last October against Mississippi State. \nDON'T BLINK: Other than against Florida, Kentucky has responded with clutch touchdowns or defensive stands to win games by 19 total points. Stoops cited the Wildcats' poise as one of the most encouraging signs about this team and added, \"we have not played perfect football by any stretch, but I believe we have showed great resolve all year and I think we can build on that.\" \nTRANSFER U: Mobley is among four ex-Wildcats players and 12 former FBS players on EKU's roster. One Colonel that Kentucky must account for is former Ohio State defensive end Noah Spence, who was an all-Big Ten Conference first-teamer in 2013. Spence has 15 tackles including five for loss and three sacks, and has also forced two fumbles. \nHEAVY HEARTS: EKU redshirt freshman Joey Kraemer, 19, died last weekend in a single-car crash west of the Richmond campus. Kentucky will recognize Kraemer during the playing of \"My Old Kentucky Home\" before the game.", "external_links": [], "published": "2015-10-02T19:33:00.000+03:00", "crawled": "2015-10-02T19:52:57.912+03:00", "highlightTitle": ""}