{"organizations": ["Cairns", "Cowboys", "News Corp Australia"], "uuid": "a6d628d07bf1a8ba091e99fe82b3120423fb303b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cairnspost.com.au", "main_image": "http://resources2.news.com.au/images/2015/10/15/1227569/938110-099e53fe-72d4-11e5-87c5-82c509632f8f.jpg", "site_section": "http://feeds.news.com.au/public/rss/2.0/cpost_news_sport_3328.xml", "section_title": "CairnsPost | Sports", "url": "http://www.cairnspost.com.au/sport/pride-youngster-earns-golden-shot-with-nrl-champions/story-fnjpuwrj-1227569937813?from=public_rss", "country": "IL", "title": "Powering intothe big time", "performance_score": 0, "site": "cairnspost.com.au", "participants_count": 0, "title_full": "Powering intothe big time", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:31:00.000+03:00", "replies_count": 0, "uuid": "a6d628d07bf1a8ba091e99fe82b3120423fb303b"}, "author": "", "url": "http://www.cairnspost.com.au/sport/pride-youngster-earns-golden-shot-with-nrl-champions/story-fnjpuwrj-1227569937813?from=public_rss", "ord_in_thread": 0, "title": "Powering intothe big time", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sheldon Powe-Hobbs", "Marc McCormack"], "text": "Weather: Cairns 20 °C - 29 °C . Shower or two. Sport Pride youngster earns golden shot with NRL champions by: What are these? Sheldon Powe-Hobbs will head to the Cowboys in the off-season for a train and trial contract. Picture: Marc McCormack Source: News Corp Australia \nTHE Cowboys have a new trialist and a new fan rolled in one, with Sheldon Powe-Hobbs earning a pre-season chance to impress the NRL champions. \nThe Northern Pride prop, 23, will spend three months on a training deal in Townsville in an opportunity history suggests can lead to big things. \nPowe-Hobbs will work under the nose of North Queensland coach Paul Green, assistant Jason Demetriou and the club’s high performance squad, the same ticket previously accepted by NRL alumni Ben Spina, Davin Crampton and Joel Riethmuller. \nThe path taken by the Babinda junior is one of perseverance, with a serious back injury sidelining Powe-Hobbs for all of 2013. \nIn a sign of where he sat in the Pride’s pecking order and plans at the start of last year, he spent the opening weeks in the CDRL with Kangaroos. \nBy the end of the year, the former Storm under-20 had become a bench power player for the twin champions. \nHis readiness to accept leadership in a young pack in 2015 — capped with claiming the club’s Players’ Player award — earned him his Cowboys shot. \n“I’m excited and looking forward to learning a lot,” Powe-Hobbs said. \n“Hopefully I can prove myself enough that they want to keep me. \n“It was probably my best year, after having more expectations. \n“Joel and Ben went down and got a contract the next year. But obviously there’s a lot of hard work to go.” \nAs well as an eager student, North Queensland will welcome another fan on their overflowing bandwagon. \n“It’s funny because I’m actually a Broncos supporter but my family are Cowboys fans,” he laughed. \n“Watching the grand final was interesting. Gorden Tallis was always my favourite player growing up. \n“I suppose that’s where that came from, but to even go down to the Cowboys to train is a huge honour. \n“Broncos have always been my team but I might have to start going for the Cowboys.” \nWith big men Matt Scott and James Tamou on modified pre-season programs, coupled with the reduction of interchange, the tank of the tireless Powe-Hobbs may be a selling point. \nPrevious train and trialists have reported back to Pride pre-season with streamlined and hardened frames, something coach Joe O’Callaghan is hoping for. \n“It’s not only the chance to do a pre-season at an NRL club but to do it with the current champions,” he said. \n“I’m excited not only to see how he goes but to see what he brings back. \n“This is what we do at ISC level.” \nPowe-Hobbs will complete the Pride’s opening few weeks of pre-season before reporting for Cowboys duties in Townsville on November 23.", "external_links": [], "published": "2015-10-15T03:31:00.000+03:00", "crawled": "2015-10-15T19:52:44.541+03:00", "highlightTitle": ""}