{"organizations": ["NHL"], "uuid": "52e2ad805be69dd4de6eeb5eb8b64b2cf5584a1b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.brandonsun.com", "main_image": "http://media.brandonsun.com/designimages/squaresun_web.jpg", "site_section": "http://brandonsun.com//rss?path=/sports/local", "section_title": "Local Sports", "url": "http://www.brandonsun.com/sports/local/whl-notebook-nhl-scouts-keep-close-eye-on-wheaties-clague-kaspick-330066551.html", "country": "US", "title": "WHL Notebook: NHL scouts keep close eye on Wheaties Clague, Kaspick", "performance_score": 0, "site": "brandonsun.com", "participants_count": 0, "title_full": "WHL Notebook: NHL scouts keep close eye on Wheaties Clague, Kaspick", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T11:00:00.000+03:00", "replies_count": 0, "uuid": "52e2ad805be69dd4de6eeb5eb8b64b2cf5584a1b"}, "author": "", "url": "http://www.brandonsun.com/sports/local/whl-notebook-nhl-scouts-keep-close-eye-on-wheaties-clague-kaspick-330066551.html", "ord_in_thread": 0, "title": "WHL Notebook: NHL scouts keep close eye on Wheaties Clague, Kaspick", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Report Error \nKale Clague and Tanner Kaspick of the Brandon Wheat Kings have been identified as two prospects to keep an eye on. \nIn National Hockey League Central Scouting’s preliminary players to watch list, the pair are among 40 Western Hockey League players on the radar for next year’s draft. \nClague is identified as an \"A\" prospect, which Central Scouting defines as a potential first-rounder, while Kaspick is a \"C\" prospect, which suggests he could be picked in the fourth to sixth rounds. \nKaspick was pleased with being noticed but said this is where the work begins. \n\"It’s nice to get the recognition for everything I’ve done up to this point but the year is still to come and that’s what I’m going to be scouted on,\" Kaspick said. \"There’s a long road to get there but it’s just nice to have that there for now.\" \nEighteen of the WHL’s 22 teams have prospects on the list, with Prince Albert leading the way with five and Red Deer following with four. \nThe other players listed as \"A\" prospects in the league are Sam Steel (Regina Pats), Max Lajoie (Swift Current Broncos) and Tyler Benson (Vancouver Giants). Ten others are \"B\" prospects, who are potential second- or third-round choices. \nOne Manitoba Junior Hockey League player was named, Dean Stewart of the Portage Terriers, whose WHL rights belong to the Saskatoon Blades. \nA pair of Wheat King prospects who never reported are also on the list. Joey Anderson was a 2013 ninth-round bantam pick who is currently playing with the American under-18 team, while Rhett Gardner, who was acquired in the deal that sent Alessio Bertaggia to Spokane, is at the University of North Dakota. \nLast week, Bob McKenzie of TSN had Clague ranked ninth overall for the 2016 NHL draft. \nSIGNINGS: A pair of former Wheat Kings signed pro deals in the last few days. \nEric Roy, who graduated from the Wheat Kings this spring, signed with the East Coast Hockey League’s Allen Americans on Friday, while Colby Robak, who had been skating with the Wheat Kings in practice recently after playing with them from 2006 to 2010, signed a one-year deal on Monday with the Rochester Americans of the American Hockey League. Robak began his pro career with the Americans in 2010-11. \nPLAYER OF THE WEEK: Alex Forsberg of the Victoria Royals has been named both the Western Hockey League and the Canadian Hockey League player of the week. He had seven points in two games, including a pair of goals and posted a plus-minus rating of plus-3. \nREADERS’ INPUT: I received a number of Tweets and emails after last week’s column when I asked readers for Wheat Kings who were overlooked in the WHL’s recent top-125 player list. The submissions I received include Ryan Pulock, Kelly Glowa, Peter Schaeffer, Kevin Cheveldayoff, Terry Yake, Dave Thomlinson, Dave Chartier, Ron Hextall and Matt Calvert. \nOne player who crossed my mind who wasn’t listed or suggested was 1995 trade deadline pickup Bryan McCabe, who was a terrific WHL player. It reminds me why cutting down 50 years of great players to 125 outstanding players was such a tough chore. \nPerry Bergson is the Brandon Sun’s hockey reporter. \n» pbergson@brandonsun.com", "external_links": [], "published": "2015-09-30T11:00:00.000+03:00", "crawled": "2015-10-01T04:12:23.278+03:00", "highlightTitle": ""}