{"organizations": [], "uuid": "3fe255788e9cab89562a408326491294918ca708", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jdsupra.com", "main_image": "http://www.jdsupra.com/showThumbnail.aspx?img=15417_2356.jpg&size=og", "site_section": "http://www.jdsupra.com/resources/syndication/docsRSSfeed.aspx?ftype=ArtEntertainmentSportsLaw&premium=1", "section_title": "Art, Entertainment, & Sports Law RSS Feed | JD Supra Law News", "url": "http://www.jdsupra.com/legalnews/intellectual-property-happy-birthday-to-49502/", "country": "US", "title": "Intellectual Property: Happy Birthday to You (10/15)", "performance_score": 0, "site": "jdsupra.com", "participants_count": 1, "title_full": "Intellectual Property: Happy Birthday to You (10/15)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T23:56:00.000+03:00", "replies_count": 0, "uuid": "3fe255788e9cab89562a408326491294918ca708"}, "author": "Bond Schoeneck &amp; King PLLC", "url": "http://www.jdsupra.com/legalnews/intellectual-property-happy-birthday-to-49502/", "ord_in_thread": 0, "title": "Intellectual Property: Happy Birthday to You (10/15)", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sound off Birthday \nIf you have ever been to a Chili’s restaurant, odds are you have heard this birthday jingle. Perhaps you have also heard different birthday greetings at other chain restaurants. More likely than not, you have not heard any wait staff sing the iconic song Happy Birthday to You . This is not one of the restaurants’ clever marketing ploys. Rather, it is a direct consequence of decades of copyright infringement threats by Warner/Chappell Music, a division of Warner Music Group (\"Warner) and top three music recording company in the world. Warner has raked in approximately $2 million a year enforcing its mighty Happy Birthday to You copyright, forcing chain restaurants, television show writers, theater producers and others to either pay or come up with a new tune. That is, until a recent U.S. District Court decision from California. \nOn September 22, 2015, in the case, Marya v. Warner/Chappell Music (1), the Court invalidated Warner’s purported ownership rights of the tune Happy Birthday to You . The plaintiffs brought this case in 2014, contending that Warner does not own the \"copyright in the Happy Birthday to You lyrics and that they should be compelled to return the ‘millions of dollars of unlawful licensing fees’ they . . . collected by wrongfully asserting copyright ownership.\" In the decision, the court looked at the history of Happy Birthday to You dating back to 1893, the year Warner claimed a school teacher Patty Hill wrote the lyrics to go to a melody that was composed by her sister Mildred. Note that copyright law protects music and lyrics separately. Neither party to the case challenged the copyright status of the melody since it was borrowed from a different song, composed by the Hill sisters, and entered the public domain when it lost its copyright protection in 1949. \nAccording to Warner, the Hill sisters, through their heirs, transferred their right in the lyrics to Warner’s predecessor, Summy-Birchard, Inc., who then recorded the alleged copyright in 1935(2). The crux of the argument was whether Patty Hill ever transferred her rights to the lyrics. If not, Summy-Birchard, Inc. could never have filed a valid copyright in the lyrics. The Court found that any transfer in rights between the Hill sisters and Summy-Birchard involved piano arrangements and melodies and that there was insufficient proof to show there had been any transfer of the rights to the lyrics. Therefore, even assuming Patty Hill actually wrote the lyrics, she did not do anything with her common law right in the and thus Warner did not own them. \nWhile this decision is certainly a loss for Warner(3), it does not necessarily mean Happy Birthday to You is in the public domain, free and clear of copyright restrictions. The decision simply invalidated one group’s claim to the lyrics of the tune. The Court was careful to word the decision in such a way that left open the possibility that Happy Birthday to You is what is commonly labeled as an \"orphan work;\" which is a potentially copyrighted work with no known true creator. However, the chances of someone coming out of the woodwork to prove a valid claim to this song from over 100 years ago are slim. This being said, if a handful of well-suited lawyers carrying briefcases show up to your door just as seven 5-year olds are about to sing \"Happy Birthday, lock the door.", "external_links": [], "published": "2015-10-07T23:56:00.000+03:00", "crawled": "2015-10-08T04:17:21.188+03:00", "highlightTitle": ""}