{"organizations": [], "uuid": "16551f7f879cc604c43ed0aeca4b010afcc775d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "cjonline.com", "main_image": "http://cjonline.com/sites/default/files/14794199.jpg", "site_section": "http://cjonline.com/taxonomy/term/2/feed", "section_title": "Sports", "url": "http://cjonline.com/sports/hawkzone/2015-10-08/bill-self-wanting-see-late-night-full-again", "country": "US", "title": "Bill Self wanting to see Late Night full again", "performance_score": 0, "site": "cjonline.com", "participants_count": 1, "title_full": "Bill Self wanting to see Late Night full again", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T00:21:00.000+03:00", "replies_count": 0, "uuid": "16551f7f879cc604c43ed0aeca4b010afcc775d2"}, "author": "Jesse Newell", "url": "http://cjonline.com/sports/hawkzone/2015-10-08/bill-self-wanting-see-late-night-full-again", "ord_in_thread": 0, "title": "Bill Self wanting to see Late Night full again", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bill Self wanting to see Late Night full again KU scheduled to have five top-35 recruits in attendance Posted: October 8, 2015 - 4:21pm By Jesse Newell jesse.newell@cjonline.com \nLAWRENCE — Though it had been 39 days since Bill Self sent out a Tweet, the Kansas coach broke his drought Thursday morning. \n“Can't believe Late Night is tomorrow,” Self said on his Twitter account. “Watch our Royals in afternoon then head to Allen for the fun. Guys are excited to see a full house.” \nJust how important a night is this for KU recruiting? Self going to social media to ask for fans to show up should answer that question pretty well. \nLate Night in the Phog is scheduled to run from 6:30 through 9:30 p.m. Friday at Allen Fieldhouse. Admission is free, and the event is first come, first serve; doors will be closed when capacity is reached. \nThat wasn’t a problem a year ago. For the first time in Self’s tenure, a Late Night had empty seats in 2014, as an accident on K-10, Royals playoff game and previous-year seating fiasco resulted in a less-than-capacity showing. \nSelf is hoping that was just a one-year glitch. \n“I would appeal to everyone ... don't assume that you can't get in, assume that you can and you will because you will be able to,” Self said. “And it should be a very fun night.” \nSelf is adding to the entertainment this year. \nTwo contestants will be selected from the crowd to attempt two half-court shots. Should they make either shot, Self will write the winner a $10,000 check. \nThere’s another twist as well: The contestants can pick anyone in the building — outside of a KU player or recruit — to take their shots for them. \n“I hope they both win,” Self said. \nThe event will include the customary skits, videos and scrimmages, but most important to Self will be the impact it has on visiting recruits. \nKU is scheduled to have Rivals.com’s No. 2 (Harry Giles), 5 (De’Aaron Fox), 6 (Malik Monk), 16 (Marques Bolden) and 35 (Schnider Herard) players in town from the class of 2016. \nDoors open to the general public at 5 p.m., and most lots around the Fieldhouse will be free for parking after 5 p.m. Fans are encouraged to bring non-perishable food items that will be donated to “Just Food” of Douglas County. \nThe event also will be televised on Jayhawk Network (Cox 22 in Topeka).", "external_links": [], "published": "2015-10-09T00:21:00.000+03:00", "crawled": "2015-10-09T03:57:54.174+03:00", "highlightTitle": ""}