{"organizations": [], "uuid": "956e6ea947d203265cb2d0d5a3c09dd54c6d1c05", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.denverpost.com", "main_image": "http://extras.mnginteractive.com/live/media/site36/2015/1014/20151014__20151015_C1_FEXXKENTHARVEY~p2.jpg", "site_section": "http://www.denverpost.com/", "section_title": "Colorado Breaking News, Sports, Weather, Traffic, Jobs - The Denver Post", "url": "http://www.denverpost.com/lifestyles/ci_28970311/cinematographer-rises-challenges-everest", "country": "US", "title": "Cinematographer rises to challenges of Everest", "performance_score": 0, "site": "denverpost.com", "participants_count": 1, "title_full": "Cinematographer rises to challenges of Everest - The Denver Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T20:01:00.000+03:00", "replies_count": 0, "uuid": "956e6ea947d203265cb2d0d5a3c09dd54c6d1c05"}, "author": "Jason Blevins", "url": "http://www.denverpost.com/lifestyles/ci_28970311/cinematographer-rises-challenges-everest", "ord_in_thread": 0, "title": "Cinematographer rises to challenges of Everest", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kent Harvey was in his tent and heard the pre-dawn roar. He knew immediately it was bad.\n\"I didn't even have to open my tent. I just clicked on my radio and it was a cacophony of people and distress calls,\" says the 47-year-old veteran cinema tog-rapher.\nIt was April 18, 2014, and an avalanche had just ripped down Everest's Khumbu Icefall, killing 16 Sherpas. Harvey, from Denver, was at base camp preparing his select team of climbers and cameramen to capture images for the $55 million Hollywood film \"Everest,\" which documents the catastrophic 1996 mission that left 12 climbers dead.\nAs yet another disaster settled onto Everest's base camp, Harvey, a father of two, couldn't shake the tragedy. He was on Everest to film a movie about a disaster, with players who had been involved in that doomed 1996 expedition. His first ever gig as the director of photography for a movie was in the Himalayas in 1999, when climbing legend Alex Lowe and high-altitude cameraman Dave Bridges were killed in an avalanche on Shishipangma.\n\"Everest, it just takes such a fine balance of career, work and passion,\" he said. \"What happened on the ice fall in 2014, it will happen again. It's just the inherent risks of climbing Everest. It's dangerous.\"\nAdvertisement Still, Harvey led his team for a brief foray into the treacherous icefall the next week, collecting video and landscapes that would become the backdrop for the film's climactic climbing scenes.\nAnd on that day, another avalanche came down from above the ice fall, not necessarily close enough to threaten the team, but close enough.\nPhoto courtesy of Kent Harvey \"It was sobering, for sure,\" said Harvey, who has summitted Everest twice, both times lugging heavy cameras to film top climbers for Eddie Bauer's First Ascent line of outerwear. \"But I love being in the Himalayas. I love what I do as a cinematographer, and I had a very attractive opportunity to go to Everest to work as a second-unit director of photography in a major Hollywood movie. Those chances do not come around often. Even having to climb Everest, I would rather my kids see their dad pursuing a craft and a dream and a passion than sitting around bored and angry that I hate my job. I think my kids — and my wife — get that on some level.\"\nHarvey, a former ski patroller from Crested Butte and mountain guide for Outward Bound and the Colorado Mountain School, got his big break behind the lens working for Warren Miller Entertainment. He spent many years behind the scenes, documenting the world's top skiers ripping remote peaks.\nOne of his first lessons was that very little goes as planned when far afield. Athletes, Mother Nature and technical challenges always throw curve balls. Harvey has developed a reputation for delivering despite all challenges.\n\"He knows how to make things happen in the field, so I could always be confident sending Harvs into the field that he would make the location production work despite whatever creative concept or Mother Nature threw at him,\" said Max Bervy, who worked 25 years as a director and producer for Warren Miller Entertainment.\nKent Harvey films climbers doubling for actors arriving at base camp in the new \"Everest\" movie. Courtesy of Kent Harvey \"Everest,\" in many ways, is the apex of Harvey's career thus far. He's spent close to 100 days of his life on Everest or at Everest Base Camp, always working with a camera slung over his shoulder. Every trip required three to five months of intensive training, running, skiing, biking and hours in the gym. It's enough preparatory work to make him pine for those 14-hour days filming movies like \"Captain America: Civil War\" and \"Iron Man\" on established sets.\nBut Harvey, who Bervy called \"one of the best action- sports cinematographers in the business,\" has a healthy mix of commercial, adventure and blockbuster jobs on his résumé. He can move easily between shooting \"Lone Survivor\" scenes in rugged New Mexico to more posh shots for American Express to remote ski lines in Russia.\n\"When I decided to get into film, I really had this idea of synthesizing my passion for the outdoors and film,\" he said.\nThe script for director Baltasar Kormákur's \"Everest\" was first penned in 1997, but a pair of made-for-television documentaries on the 1996 disaster derailed the film project. When it was revived and rewritten a couple of years ago, Harvey came aboard to gather the video that would be used as backdrops for actors working on stage sets in Italy. He was planning to take his team to the summit, but the avalanche in the Khumbu Icefall ended the climbing season. His team did not make it above the icefall.\nIcelandic director Kor mákur, who Harvey described as a rigorous researcher who pored over every book, film and transcript surrounding the 1996 disaster, assembled photos, previous video from David Breashear's 1998 IMAX film \"Everest\" and historic shots to finish the film's high-altitude scenes.\nLast month, as \"Everest\" joined two other feature films on Himalayan climbing, \"Sherpa\" and \"Meru,\" in theaters worldwide, Nepalese tourism officials banned novice climbers from Everest, citing safety and environmental impacts.\n\"I've had people say that watching this movie is as close as you can get to climbing Everest without actually climbing, and I'd say, to some degree, that is true,\" Harvey said. \"It's a pretty good take on it.\"", "external_links": ["http://extras.mnginteractive.com/live/media/site36/2015/1014/20151014__20151015_C1_FEXXKENTHARVEY~p3_200.jpg", "http://extras.mnginteractive.com/live/media/site36/2015/1014/20151014__20151015_C1_FEXXKENTHARVEY~p1.jpg"], "published": "2015-10-15T20:01:00.000+03:00", "crawled": "2015-10-15T14:14:25.982+03:00", "highlightTitle": ""}