{"organizations": [], "uuid": "4e3f2d78cb7cc64599434ecc4b69952d78c86ad0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.providencejournal.com", "main_image": "http://www.providencejournal.com/storyimage/PJ/20151012/SPORTS/151019769/AR/0/AR-151019769.jpg", "site_section": "http://www.providencejournal.com/sports?template=rss&mime=xml", "section_title": "Sports - providencejournal.com", "url": "http://www.providencejournal.com/article/20151012/SPORTS/151019769/13933/NEWS?rssfeed=true", "country": "US", "title": "Defense remains a primary focus for URI basketball", "performance_score": 0, "site": "providencejournal.com", "participants_count": 1, "title_full": "Defense remains a primary focus for URI basketball", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T06:37:00.000+03:00", "replies_count": 0, "uuid": "4e3f2d78cb7cc64599434ecc4b69952d78c86ad0"}, "author": "Kevin McNamara", "url": "http://www.providencejournal.com/article/20151012/SPORTS/151019769/13933/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "Defense remains a primary focus for URI basketball", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Defense remains a primary focus for URI basketball Comment Follow @kevinmcnamara33 Posted Oct. 12, 2015 at 10:37 PM SOUTH KINGSTOWN — Just one glimpse at a Dan Hurley practice plan tells you all you need to know about his focus points in the first two weeks of practice. There is palpable buzz around Hurley’s Rhode Island Rams this fall, and with good reason. The Rams are coming off a 23-win season and a victory in the National Invitation Tournament. They’ll likely be picked to finish in the top three at Atlantic 10 media day next week and are a solid pick to advance to the NCAA Tournament in March. But while Hurley acknowledges that the higher expectations are due in large part to “the best offensive team that I’ve had in my four years here,” the Rams’ practice sessions speak to a larger truth. Any Hurley coached team — every one he’s ever led, he says — is a defense-first group. “We push ourselves in the defensive drills,” says Jared Terrell, a sophomore guard who is a tiger on the defensive end. “The shell drills, the rotation drills. That’s our main focus.” Hurley says his hope is that many of the traits that made last year’s NIT team one of the nation’s best on defense carries over to this group. As many as four newcomers could easily slide into the Rams’ rotation, so the coaching staff is drilling defensive concepts as hard as ever. “As a coach you always have to be flexible. You can’t try to fit a square peg into a round hole,” Hurley says. “This time of the year you have to figure out pretty quickly what’s going to give your team the best chance. Will we be a top-10 team in the country again in terms of defensive efficiency? I don’t know, but we’re going to work at it.” Last season, the Rams led the entire country in 3-point percentage defense (26.5 percent). They allowed just 60.2 points, 30th best nationally. In the Kenpom.com efficiency ratings, the Rams finished ninth in defense, three slots ahead of national champion Duke. But that team’s best defender, T.J. Buchanan, graduated. So has interior banger Gilvydas Biruta. The Rams need newcomers such as Memphis transfer Kuran Iverson, talented Italian freshman forward Nicola Akele and Towson transfer Four McGlynn to mesh with the returnees on the defensive end. “We’re searching right now for what our true identity is going to be,” Hurley says. “But looking at our talent level now, if we don’t lose our edginess and toughness and intensity that my teams usually play with we’re going to have a good year. If we hold onto that, with the firepower we’ve added, we should be OK.” Page 2 of 2 - What is undeniable is that this year’s Rhody squad has a much-improved offensive repertoire. This is good news. The Rams’ season didn’t go as far as the NCAAs a year ago because they couldn’t shoot very straight. URI was one of the worst teams in the country (313th of 345) in 3-point shooting and was 292nd in free-throw percentage (.655). Those numbers could improve this season due to the program’s additions, but more importantly improvement from several key returnees who have simply spent needed time in the gym. The likely starting backcourt of Terrell (32 percent on 3s) and Jarvis Garrett (.276) struggled badly as freshmen but are shooting with confidence now. Star junior E.C. Matthews (16.9 ppg.) should see more open shots this season and that’s bound to help him increase his 32-percent rate from 3-point range. McGlynn scored more than 1,100 points in his first three collegiate seasons and may have the most dependable shooting stroke on the team. Hurley says the addition of Iverson and Akele give his team additional length and scoring ability it lacked in the frontcourt last season. They will join junior forward Hassan Martin, who shot nearly 60 percent from the floor a year ago. “We are a more skilled team, and a little more versatile,” Hurley says. “We have shooters now. Guys who can make shots makes up for a lot of mistakes.” Hurley says he challenged his sophomore guards to improve and “Jarvis [Garrett] and Jared Terrell, just by looking at them you know how much time they’ve spent on their games.” Terrell says he appreciates the fact that with more talent on the court, offense should come easier for everyone. “We have more talent, obviously, but we have unselfish guys. We are all looking to make the better play,” he says. As the end of a physical practice neared on Monday, Hurley shook his head at an errant shot and turned his back on untimely turnovers. But when a Ram didn’t fight over a screen or was slow to close out on a shooter, the whole team knew something was wrong. “All you can do as a coach is create a feeling in your culture and the way you practice,” Hurley says. “We intend to practice hard and pay attention to detail defensively. You can always control that and that’s helped a lot of teams win a lot of games.”", "external_links": [], "published": "2015-10-13T06:37:00.000+03:00", "crawled": "2015-10-13T13:12:53.514+03:00", "highlightTitle": ""}