{"organizations": ["Manchester United", "Red Devils", "BST Manchester United"], "uuid": "57bc09d4d47d9a7c2503695857f6347235aad22c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ibtimes.co.uk", "main_image": "http://d.ibtimes.co.uk/en/full/1463880/manchester-united.jpg", "site_section": "http://ibtimes.co.uk//rss/sports", "section_title": "IBTimes.co.uk : Sports", "url": "http://www.ibtimes.co.uk/everton-vs-manchester-united-red-devils-quintet-misses-training-after-hectic-international-break-1524245", "country": "US", "title": "Everton vs Manchester United: Red Devils quintet misses training after hectic international break", "performance_score": 0, "site": "ibtimes.co.uk", "participants_count": 0, "title_full": "Everton vs Manchester United: Red Devils quintet misses training after hectic international break", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T10:08:00.000+03:00", "replies_count": 0, "uuid": "57bc09d4d47d9a7c2503695857f6347235aad22c"}, "author": "", "url": "http://www.ibtimes.co.uk/everton-vs-manchester-united-red-devils-quintet-misses-training-after-hectic-international-break-1524245", "ord_in_thread": 0, "title": "Everton vs Manchester United: Red Devils quintet misses training after hectic international break", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Louis van Gaal", "Pradhan Muthanna"], "text": "By Pradhan Muthanna October 16, 2015 08:08 BST Manchester United manager Louis van Gaal saw 17 players travel for international duty with their respective national teams. Getty \nManchester United manager Louis van Gaal missed several key players for the club's first full training session after a two-week international break, which saw 17 players join up with their national squads. The Red Devils, who are in the third place in the Premier League, are preparing to face Everton on Saturday (17 October) as they look to keep pace with league leaders Manchester City, whom they trail by two points. \nAccording to Manchester Evening News , United quintet Antonio Valencia, Sergio Romero, Ashley Young, Juan Mata and David de Gea missed training and the report claims that the Dutch manager's team for their trip to Goodison Park could be influenced due to the number of players involved with their national teams over the last two weeks. \nEcuadorian international Valencia was part of his country's team for their 2018 World Cup qualifier clash against Bolivia on Tuesday (13 October) night, while Sergio Romero travelled with Argentina for their qualifier clash against Paraguay, and their long-haul flights back to Manchester saw them miss the session on Thursday (15 October). \nYoung's absence, on the other hand, was mysterious as the Red Devils winger remained at Old Trafford after being overlooked by Roy Hodgson for England's Euro 2016 qualifiers against Estonia and Lithuania. The winger has not been a first-team regular this season following the arrival of Memphis Depay, but has been used by the manager in various positions in defence and attack. \nDe Gea and Mata were also absent on Thursday, as they were a part of the Spain squad that ensured their place in the European Championships in France next year and consolidated their place on top of their qualification group with a win over Ukraine in Kiev. The former Chelsea player, however, the report claimed, was at United's training base to collect his player of the month award for September. More about Manchester United", "external_links": [], "published": "2015-10-16T10:08:00.000+03:00", "crawled": "2015-10-16T10:33:54.756+03:00", "highlightTitle": ""}