{"organizations": [], "uuid": "d4d9443c631b9e15bbe6efcad789be40e998ecaa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tri-cityherald.com", "main_image": "http://www.tri-cityherald.com/news/local/l6jrof/picture41157915/ALTERNATES/LANDSCAPE_1140/West%20Richland%20Library", "site_section": "http://www.tri-cityherald.com/?widgetName=rssfeed&widgetContentId=28324093&getXmlFeed=true", "section_title": "Breaking News, Sports, Weather & More | Tri-CityHerald.com &", "url": "http://www.tri-cityherald.com/news/local/article41157918.html", "country": "US", "title": "West Richland to vote on contract with Mid-Columbia Libraries", "performance_score": 0, "site": "tri-cityherald.com", "participants_count": 1, "title_full": "West Richland to vote on contract with Mid-Columbia Libraries", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T08:17:00.000+03:00", "replies_count": 0, "uuid": "d4d9443c631b9e15bbe6efcad789be40e998ecaa"}, "author": "Geoff Folsom \nTri-City Herald", "url": "http://www.tri-cityherald.com/news/local/article41157918.html", "ord_in_thread": 0, "title": "West Richland to vote on contract with Mid-Columbia Libraries", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "West Richland to vote on contract with Mid-Columbia Libraries \nLibrary contract to be extended through at least 2018 \nVoters may be asked to approve 1 percent utility tax \nTax would pay for library expansion Doug Barnes of West Richland uses a computer at the West Richland Library Thursday afternoon. The city council is scheduled to vote on extending its contract with Mid-Columbia Libraries on Oct. 27 at a special meeting and if a ballot measure passes next year an expansion and renovation of the library will take place. Sarah Gordon Tri-City Herald i Order Reprint of this Story \nWest Richland could be getting an improved library with extended hours but at a higher cost. \nThe city council is scheduled to vote on extending its contract with Mid-Columbia Libraries on Oct. 27 at a special meeting. The agreement will initially go through the end of 2018, but will be extended through 2021 if voters agree next year to a 1 percent tax on power bills with Benton Rural Electric Association. \nThe tax increase is needed so West Richland can pay the yearly fee it is charged by Mid-Columbia Libraries, Mayor Brent Gerry said. West Richland, which has contracted with Mid-Columbia Libraries since 1978, even though it is not part of the library district, has been paying Mid-Columbia $376,000 a year. Benton County contributes another $119,000. \n“It will make it a great place for our citizens for another 10 to 20 years,” Gerry said. \nThe city will continue to pay the library system an amount based on a 37-cents-per-$1,000 property tax valuation, which cities in the library district pay. But it will get more bang for its buck, with the library now opening on Sunday and having a certified librarian on staff. \nThe city owns the library building at 3803 W. Van Giesen St., but Mid-Columbia Libraries owns library collection. \nIf the ballot measure passes next year, an expansion and renovation of the library also will take place. The city council chambers are to move to the new $4.7 million municipal services building, near the intersection of Belmont Boulevard and Keene Road, in 2016, which Mid-Columbia Libraries Executive Director Kyle Cox said will allow the library to increase its collection space by 20 percent. \nImprovements likely will include new carpet, furniture, artwork, computers and technology enhancements, Cox said. \n“There are a lot of possibilities and potential in terms of what we could do,” he said. \nThe contract, which the library district’s board approved Tuesday, calls for the library to move to a temporary location if it needs to be closed for more than 60 days, or use bookmobiles to make up for the closure if renovations can be done quicker than that. Cox hopes the library, which is paying for the renovations, can do enough work in advance that it can close the facility for a shorter time period. \nWest Richland had problems with what the library district was charging because it pays for the services through a 2.5-percent tax on telephone service. But Gerry said that money is drying up because people are getting rid of landline phones, while the amount the library charges is rising because of increased property values. \nUsing revenue from electricity charges should be more sustainable, he said. The library and city plan to work together educating the public about the need for the tax. \n“Power is not something we would lose as time goes on,” Gerry said. “We’re just trading the tax base from one utility to another.” \nThe tax increase would add a dollar to the cost of a $100 electric bill, said Jessica Platt, West Richland finance director. \nWest Richland had discussions with Richland about possibly contracting for services with its library after Richland was listed as an option in the report from Ruth Metz Associates. But Gerry said the move ultimately got Mid-Columbia Libraries to the table. \nThe report said West Richland’s costs for the library had been increasing at a rate of 5.6 percent per year. \n“West Richland and the library came together for an agreement that benefits both parties,” Cox said. “Ultimately, the citizens of West Richland really win.” \nGeoff Folsom: 509-582-1543; gfolsom@tricityherald.com ; Twitter: @GeoffFolsom Related content", "external_links": [], "published": "2015-10-23T08:17:00.000+03:00", "crawled": "2015-10-23T16:10:50.400+03:00", "highlightTitle": ""}