{"organizations": ["Baylor"], "uuid": "b893f10495181887f2116743dae69a2fb58cc4c5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thegazette.com", "main_image": "http://www.thegazette.com/storyimage/GA/20151023/ARTICLE/151029782/AR/0/AR-151029782.jpg", "site_section": "http://feeds.feedburner.com/~r/GazetteOnlineSports/~6/1", "section_title": "Eastern Iowa Sports News and Information from Gazette Online", "url": "http://www.thegazette.com/subject/sports/college/football/isu-2-minute-drill-baylor-20151023", "country": "US", "title": "ISU 2-Minute Drill: Baylor", "performance_score": 0, "site": "thegazette.com", "participants_count": 0, "title_full": "ISU 2-Minute Drill: Baylor", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T23:26:00.000+03:00", "replies_count": 0, "uuid": "b893f10495181887f2116743dae69a2fb58cc4c5"}, "author": "", "url": "http://www.thegazette.com/subject/sports/college/football/isu-2-minute-drill-baylor-20151023", "ord_in_thread": 0, "title": "ISU 2-Minute Drill: Baylor", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "October 23, 2015 | 4:26 pm \nISU RUSH OFFENSE VS. BAYLOR RUSH DEFENSE \nMike Warren has gained 156 yards per game on the ground in the last four contests, but Baylor is stout on its defensive line. Shawn Oakman is a big, athletic end at 6-foot-9, 275 pounds and the Bears are second in the Big 12 in rush defense, allowing 137.8 yards per game. Advantage: Baylor \nISU PASS OFFENSE VS. BAYLOR PASS DEFENSE \nIowa State has the talent on the outside with the likes of Allen Lazard, D’Vario Montgomery and Quenton Bundrage, but quarterback Sam Richardson struggled to produce consistently for the final three quarters against TCU. Baylor has forced seven interceptions in six games and if the pass rush makes Richardson uncomfortable early, it will be tough for him to gain confidence or momentum through the air. Advantage: Baylor \nBAYLOR RUSH OFFENSE VS. ISU RUSH DEFENSE \nThe Bears put up a gaudy 348.7 yards per game on the ground and have scored double the amount of rushing touchdowns (20) as Iowa State. Shock Linwood has 803 rush yards through six games, and will be a tough challenge for Demond Tucker and the ISU defensive front to contain. Advantage: Baylor \nBAYLOR PASS OFFENSE VS. ISU PASS DEFENSE \nSeth Russell hasn’t shown many deficiencies through six games this season, leading the Big 12 in pass efficiency (210.0) and tossing 27 touchdowns to five interceptions. Corey Coleman is a potential Heisman Trophy candidate at receiver and will give the ISU secondary fits with his athletic frame. Advantage: Baylor \nSPECIAL TEAMS \nISU coach Paul Rhoads said kicker Cole Netten has struggled with consistency in recent practices, but ISU punt returner Allen Lazard has given special teams a spark with 16.9 return yards per game — second in the Big 12. Baylor punter Drew Galitz has punted just 12 times this season while Corey Coleman is third in the conference in all-purpose yards (153.0 per game) with 16 touchdown catches. Advantage: Baylor \nISU WILL WIN IF … it can dominate time of possession and force Baylor into committing uncharacteristic mistakes. The Bears haven’t been in a tightly contested game in the fourth quarter yet, so if the Cyclones can find what worked in the first quarter against TCU and sustain it, they will have a shot to be close heading into the final period. \nBAYLOR WILL WIN IF … it can make Iowa State uncomfortable offensively. Baylor is too good on offense not to put up points, so the key for a BU win will be smothering the Cyclones’ offensive personnel and forcing Sam Richardson into tough down and distance situations. \nINTANGIBLES \n1. Baylor leads the all-time series with Iowa State 7-6, including 4-2 in Waco. The two ISU wins at Baylor came in 2000 (31-17) and 2004 (26-25). \n2. The Bears have the longest home-winning streak in the FBS (19 games) and haven’t lost at home since Oct. 13, 2012 to TCU. \n3. Hurricane Patricia has complicated weather conditions for Saturday’s game and put Waco in a flash flood warning with a 100 percent chance of precipitation on game day. \n3 AND OUT \n1. Iowa State is one of just four teams (Oklahoma State, Texas and West Virginia) to hold the Baylor offense under 30 points in the last four seasons. \n2. Baylor defensive coordinator Phil Bennett held the same position at Iowa State from 1984-86 while current defensive pass game coach Maurice Linguist was an All-Big 12 defensive back for the Bears, graduating in 2006. \n3. Saturday will be the Cyclones’ first visit to McLane Stadium, which became the home venue for Baylor when it opened to start the 2014 season. \nPREDICTION: Baylor 56, Iowa State 21 \nl Comments: montzdylan@gmail.com", "external_links": [], "published": "2015-10-23T23:26:00.000+03:00", "crawled": "2015-10-24T22:08:06.975+03:00", "highlightTitle": ""}