{"organizations": ["NFL WEEK"], "uuid": "6c96b86e464c8593139a6be648e78b7a99b33105", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.vindy.com", "main_image": "http://media.vindy.com/content/image/a/5/logo/v5logo.gif", "site_section": "http://www.vindy.com/rss/headlines/kindle/sports", "section_title": "Vindy.com stories: Sports News", "url": "http://www.vindy.com/news/2015/oct/19/nfl-week--sundays-other-games/", "country": "US", "title": "NFL WEEK 6 Sunday’s other games", "performance_score": 0, "site": "vindy.com", "participants_count": 0, "title_full": "NFL WEEK 6 Sunday’s other games", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T07:00:00.000+03:00", "replies_count": 0, "uuid": "6c96b86e464c8593139a6be648e78b7a99b33105"}, "author": "", "url": "http://www.vindy.com/news/2015/oct/19/nfl-week--sundays-other-games/", "ord_in_thread": 0, "title": "NFL WEEK 6 Sunday’s other games", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published: Mon, October 19, 2015 @ 12:00 a.m. \nAFC \nBengals 34, Bills 21 \nORCHARD PARK, N.Y. \nWith A.J. Green attracting much of the Buffalo Bills’ attention, Bengals receiver Marvin Jones made a suggestion to quarterback Andy Dalton to open the third quarter. “I told Andy to just throw it because I’m go to run and get it,” Jones said, referring to his 42-yard, over-the-shoulder catch that eventually set up his 10-yard touchdown on the Bengals opening drive of the second half. “If you’re going to take away one person, we’ve got six, seven other people that can do the job. And it went my way.” The Bengals (6-0) and their multi-threat offense continued to roll as they matched the team’s best start to a season in franchise history. With Green covered, Dalton turned his attention elsewhere in throwing touchdown passes to Jones, Tyler Eifert and Jeremy Hill. Giovani Bernard also scored on a 17-yard run in a game the Bengals blew open by scoring 17 points on their first three drives of the second half. \nDolphins 38, Titans 10 \nNASHVILLE \nCameron Wake got his first four sacks this season and also forced two fumbles — all in the first half — and Miami won in Dan Campbell’s debut as interim coach. The Dolphins (2-3) came in having lost three straight, costing coach Joe Philbin his job Oct. 5. Miami finished with six sacks and two interceptions against Marcus Mariota. The rookie quarterback needed a knee brace and was replaced by Zach Mettenberger after the 2-minute warning. Lamar Miller ran for 113 yards and a TD for Miami. The Titans (1-4) lost their fourth straight. \nTexans 31, Jaguars 20 \nJACKSONVILLE, FLA. \nBrian Hoyer threw three touchdown passes on third down, two to DeAndre Hopkins, for Houston. The Jaguars (1-5) lost their fourth in a row and raised more questions about coach Gus Bradley’s job security. The Texans (2-4) started emptying the stadium midway through the fourth after Andre Hal returned an interception 41 yards for a touchdown and a 31-14 lead. It was the sixth pick-six thrown by Blake Bortles in 19 career starts. \nNFC \nPanthers 27, Seahawks 23 \nSEATTLE \nCam Newton sang and danced in celebration. And when he stopped, he gave Greg Olsen a hard time for twice being brought down at the 1-yard line before finally getting in the end zone when it mattered most. This one meant a little more for the Carolina Panthers, winning on the home field of the two-time NFC champs. “This was one of the bigger victories we’ve had since I’ve been here,” Carolina coach Ron Rivera said. Newton capped Carolina’s fourth-quarter rally with a 26-yard touchdown pass to Olsen with 32 seconds left, and the Panthers improved to 5-0, rallying for a stunning win. Down 23-14, Carolina went 80 yards on each of its final two possessions for touchdowns that left the Panthers jubilant and the Seahawks stinging about a second straight fourth-quarter collapse. Carolina winning its first four games was impressive. But this victory adds the validity. “It’s a great win, but it does only count for one,” Olsen said. “That’s the reality of this business. But it felt good. We’ve had our battles against these guys.” Newton was 12 of 15 for 169 yards in the fourth quarter and threw for 269 yards overall. His first 80-yard drive in the final quarter resulted in Jonathan Stewart’s second 1-yard touchdown run with 3:55 left to cut Seattle’s lead to 23-20. But Graham Gano pulled the extra point wide left. After Carolina’s defense forced Seattle to punt, Newton led a final 80-yard scoring drive that left Seattle stunned for the second straight week. \nLions 37, Bears 34 OT \nDETROIT \nA win, finally. Matt Prater kicked a 27-yard field goal with 2:29 left in overtime, and Detroit won for the first time this season. Matthew Stafford heaved a 57-yard pass to Calvin Johnson to set up the kick for the Lions (1-5). Johnson finished with six receptions for 166 yards. The Bears (2-4) had chances for a third straight comeback win. Chicago’s Robbie Gould kicked a 29-yard field goal as time expired in regulation. The tying score was set up by Darius Slay getting called for interference after Jay Cutler’s 25- and 24-yard passes to Alshon Jeffery. \nINTERLEAGUE \nPackers 27, Chargers 20 \nGREEN BAY, WIS. \nRookie cornerback Damarious Randall had a feeling that Philip Rivers’ final pass might be headed his way. Fourth-and-goal from the 3 with 15 seconds left, and the San Diego Chargers needed a touchdown to tie the Green Bay Packers and possibly force overtime. Randall had to keep tabs on both Antonio Gates and Danny Woodhead lined up on the right side of the formation. The first-round draft pick lunged to poke away Rivers’ short throw to Woodhead near the front right pylon in the final seconds to preserve the Packers’ victory, overcoming a career performance by Rivers. “Biggest play of the game,” coach Mike McCarthy said. “Damarious is off to a great start.” The fans inside Lambeau Field erupted with a collective sigh of relief. Green Bay (6-0) survived its biggest scare of the season to stay unbeaten.Rivers set franchise marks with career highs of 43 completions, 65 attempts and 503 yards passing. He threw for two touchdowns for the Chargers (2-4). His 43 completions were the most in NFL history in a loss; he needed one more, at least. But as the fourth-down play developed, Randall remembered that San Diego ran the same play on second down, but tried to get the ball to Gates. This time, linebacker Clay Matthews covered Gates inside. Woodhead broke outside, with Randall trailing from behind. “I was acting like I really wasn’t seeing him, but honestly, I was just trying to bait him a little bit,” Randall said. On his back after being knocked down by linebacker Julius Peppers, Rivers arched his neck up, then went back down in frustration and flailed his arms. Another Chargers loss occurred in the final seconds. San Diego lost to Pittsburgh on the last play on Monday night. “Brutal loss, obviously, losing the way we did,” coach Mike McCoy said. \nJets 34, Redskins 20 \nEAST RUTHERFORD, N.J. \nRyan Fitzpatrick threw two touchdown passes and ran for another score, and the Jets overcame a sloppy first half. Chris Ivory ran for 146 yards and a TD on 20 carries for the Jets, who improved to 4-1 for the first time since 2010. Brandon Marshall had seven catches for 111 yards, and Eric Decker also caught a TD. The Redskins are 2-4. \nVikings 16, Chiefs 10 \nMINNEAPOLIS \nDespite an erratic performance by Terry Bridgewater, Minnesota’s tough defense and rookie wide receiver Stefon Diggs came through over mistake-prone Kansas City. Alex Smith’s 42-yard touchdown pass to Albert Wilson midway through the fourth quarter pulled the Chiefs within three points, but the Vikings (3-2) played well enough early to survive their ragged finish. The Chiefs (1-5) had eight penalties for 95 yards. Diggs had 129 yards on seven catches. Bridgewater threw two interceptions. Adrian Peterson, who was on the sideline late in the game with the Vikings trying to put it away, finished with 60 yards on 26 carries. \nAssociated Press", "external_links": [], "published": "2015-10-19T07:00:00.000+03:00", "crawled": "2015-10-19T12:46:43.171+03:00", "highlightTitle": ""}