{"organizations": [], "uuid": "b758e642c392dd6bfaf4d951b90b43ca40d27e60", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "manilastandardtoday.com", "main_image": "http://manilastandardtoday.com/panel/_files/images/default/default-thumb.jpg", "site_section": "http://manilastandardtoday.com/feed/sports/", "section_title": "The Standard Sports", "url": "http://manilastandardtoday.com/2015/10/05/nu-overpowers-ateneo-captures-v-league-crown/", "country": "CA", "title": "NU overpowers Ateneo, captures V-League crown", "performance_score": 0, "site": "manilastandardtoday.com", "participants_count": 1, "title_full": "NU overpowers Ateneo, captures V-League crown", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T19:01:00.000+03:00", "replies_count": 0, "uuid": "b758e642c392dd6bfaf4d951b90b43ca40d27e60"}, "author": "MST Sports", "url": "http://manilastandardtoday.com/2015/10/05/nu-overpowers-ateneo-captures-v-league-crown/", "ord_in_thread": 0, "title": "NU overpowers Ateneo, captures V-League crown", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NU overpowers Ateneo, captures V-League crown NU overpowers Ateneo, captures V-League crown By MST Sports | Oct. 05, 2015 at 12:01am \nNATIONAL University threw the full weight of its might and overpowered Ateneo for the second straight time, bagging the Shakey’s V-League Season 12 Collegiate Conference crown via an emphatic 25-21, 26-24, 25-19 victory in sudden death before a packed Sunday crowd at The Arena in San Juan City. \nFour players churned out double-digit outputs to underscore the Lady Bulldogs depth with ace setter Rubie de Leon virtually having a field day flicking feeds to both flanks while at times confusing the Lady Eagles defenders with her combination plays and quick sets. \nThe veteran playmaker made Myla Pablo (15 hits), sisters Dindin Manabat (11) and Jaja Santiago (10) and skipper Jorelle Singh (10) look good with her virtuoso performance that included a brilliant dink in the second set. \nThe Lady Eagles, behind Alyssa Valdez, Bea de Leon, Amy Ahomiro and Jhoanna Maraguinot, did fight back after trailing majority of the way in all three sets, keeping the Ateneo crowd on the edge of their seats. But each time, the Lady Bulldogs had an answer coming off a huddle and went on to clinch the one-hour, 21-minute victory on a de Leon attack that sailed long. \nIt was NU’s second title since beating Ateneo in this conference two years ago and the first under coach Roger Gorayeb, who also handled the Lady Eagles when they dropped a 1-3 decision to the NU-mentored Edjet Mabbayad in Season 10 of the league sponsored by Shakey’s. \n“I’m happy as a coach because I helped NU win another Shakey’s V-League title,” said Gorayeb in the din of the NU celebration at centercourt. “I’m also happy for Ateneo because most of its players today were also my players when I was still the coach of the team.” \nPablo, relegated to background majority of the conference, saved her best for last and top scored with 15 hits, outscoring the fancied Valdez, who managed just 14 points in the decider after a forgettable nine-hit performance in Ateneo’s 22-25, 17-25, 17-25 loss in Game 2 last week. \nThe 22-year-old graduating Marketing student later bagged the Finals MVP honors. \n“Coach (Roger) told me that if I just listen to him, I would win awards. I did and I’m really thankful to him for helping me improve my game,” said the soft-spoken Pablo. \nValdez, who fired 20 hits in Ateneo’s 25-19, 25-13, 25-21 victory in the opener of the title series presented by PLDT Home Ultera and backed by Mikasa and Accel, offered no excuses and credited NU’s superb all around performance. \n“No excuses. NU just played perfect volleyball today (yesterday),” said Valdez, who earlier copped the conference MVP crown. \n“One big factor for them is their veteran players, who have championship experience,” added Valdez. \nAteneo actually wrested a 24-23 edge in the second frame on a de Leon ace but Manabat tied the count on her pet running attack and the Lady Bulldogs snatched the set with a block and on a Maraguinot errant spike. \nFalling behind 1-6 in the third, the Lady Eagles fought back to force a 10-all count but the Lady Bulldogs came out of the huddle to string three straight points and stayed for good, foiling Ateneo’s last stand after NU’s Jasmine Nabor made a service error and Ahomiro rammed in a kill.  ", "external_links": [], "published": "2015-10-04T19:01:00.000+03:00", "crawled": "2015-10-05T08:08:08.449+03:00", "highlightTitle": ""}