{"organizations": [], "uuid": "dd17a10f8b548bbf8414c74c2cbb2ac8d0027041", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dnaindia.com", "main_image": "http://static.dnaindia.com/sites/default/files/2015/10/10/384055-emissions-getty.jpg", "site_section": "http://www.dnaindia.com/", "section_title": "DNA India | Latest News, Live Breaking News on India, Politics, World, Business, Sports, Bollywood", "url": "http://www.dnaindia.com/money/report-mercedes-honda-mazda-mitsubishi-join-volkswagen-in-the-diesel-emissions-scandal-row-2133482", "country": "SG", "title": "Mercedes, Honda, Mazda, Mitsubishi join Volkswagen in the diesel emissions scandal row", "performance_score": 0, "site": "dnaindia.com", "participants_count": 5, "title_full": "Mercedes, Honda, Mazda, Mitsubishi join Volkswagen in the diesel emissions scandal row | Latest News & Updates at Daily News & Analysis", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T18:02:00.000+03:00", "replies_count": 4, "uuid": "1bc72c3ce48f04babebc7dae89fbb1036c786a4f"}, "author": "dna webdesk", "url": "http://www.dnaindia.com/money/report-mercedes-honda-mazda-mitsubishi-join-volkswagen-in-the-diesel-emissions-scandal-row-2133482#post-0", "ord_in_thread": 0, "title": "Mercedes, Honda, Mazda, Mitsubishi join Volkswagen in the diesel emissions scandal row", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Representational image Getty Images According to the Guardian reports, four other car companies have joined Volkswagen in the emissions scandal row. Mercedes-Benz, Honda, Mazda and Mitsubishi's diesel cars have been alleged to emit more pollution than in regulatory tests.\nReportedly, Honda models emit six times the regulatory limit of NOx pollution and other models emit 20 times the NOx pollution coming out of their exhaust pipes.\nNOx pollution is believed to cause premature deaths and has also resulted in increase in health costs. Nick Molden whose company Emissions Analytics tested the cars told the Guardian that \"the issue is a systematic one\".\nIt was revealed that Renault, Nissan, Hyundai, Citroen, Fiat, Volvo and Jeep were also involved in pumping out more NOx than permitted.\nData from Emissions Analytics revealed that Mercedes-Benz cars emit 2.2 times more NOx than permitted. Honda, Hyundai and all the other cars' NOx emissions are alleged to be higher on the road than in the EU lab test.\nAccording to the Guardian , Mercedes and Honda said they are supporting a tightening of regulations. In order to help strengthen regulatory and consumer confidence, Honda said they supported additional testing.\nAn emissions expert at Transport and Environment , Greg Archer told the Guardian that the new emissions analytics result prove that Volkswagen scandal is just the starting. \"What we are seeing here is a diesel-gate that covers many different car models.\"\nThe only solution according to him is to conduct fresh tests on the road and verify it by an authority which is not biased or paid by the car company.\nLast month, Volkswagen had been found to have flouted stringent US emission norms, by fitting a defect device that makes the engine function at a reduced capacity, thereby emitting lesser gases when the vehicle determines that it is being inspected. Otherwise in the real world, the defect device will turn off and will function at full capacity for a better performance.\nVolkswagen had said that nearly 11 million cars worldwide have the defect device. Volkswagen Passenger Cars hds said that about 5 million cars have the cheating device, while Audi admitted that 2.1 million of its cars are affected, and 1.2 million Skodas have the device.\n(With Agencies)", "external_links": ["https://apis.google.com/js/platform.js"], "published": "2015-10-10T18:02:00.000+03:00", "crawled": "2015-10-11T02:11:59.257+03:00", "highlightTitle": ""}