{"organizations": [], "uuid": "78402dcfe2453636dd3a2ae2b522cd9198be94d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "juneauempire.com", "main_image": "http://juneauempire.com/sites/default/files/14810872.jpg", "site_section": "http://jun-cdn.com/taxonomy/term/2/2/feed", "section_title": "Sports", "url": "http://juneauempire.com/sports/2015-10-15/ibesate-leads-jamestown-bats", "country": "US", "title": "Ibesate leads Jamestown bats", "performance_score": 0, "site": "juneauempire.com", "participants_count": 1, "title_full": "Ibesate leads Jamestown bats", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T11:06:00.000+03:00", "replies_count": 0, "uuid": "78402dcfe2453636dd3a2ae2b522cd9198be94d8"}, "author": "Klas Stolpe", "url": "http://juneauempire.com/sports/2015-10-15/ibesate-leads-jamestown-bats", "ord_in_thread": 0, "title": "Ibesate leads Jamestown bats", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Former JDHS player top batter for undefeated college team Posted: October 15, 2015 - 12:06am Back | Next COURTESY PHOTO WOU Western Oregon's Lance Ibesate connects on a pitch during fall baseball action last week. Ibesate, a 2012 JDHS graduate, is leading the Wolfpack in hitting and fielding. Back | Next COURTESY PHOTO WOU Western Oregon's Lance Ibesate connects on a pitch during fall baseball action last week. Ibesate, a 2012 JDHS graduate, is leading the Wolfpack in hitting and fielding. JUNEAU EMPIRE \nSmall in stature, former Juneau-Douglas High School baseball and basketball star Lance Ibesate is big on game. \nOn Wednesday the Jamestown University senior second baseman played in the World Series. \nOkay, it was the Jimmies’ three-game intersquad Orange and Black series, but it was typical Ibesate … key hits, stolen bases and no errors. \n“It is a good time,” Ibesate said. “It is a chance for us to have fun and see all our improvement over the Fall and things.” \nIbesate was on the Orange team. The Black won 2-0 in game one, the Orange 8-0 game two, and game three on Wednesday was tight. \n“We lost 6-5 in extra innings,” Ibesate said. “I was lead off and went 1-3. Started at second and didn’t make any errors. Stole a base. Heck of a game and the intensity was through the roof and it was a fun environment to play in.” \nJust a week earlier, the Jimmies went 8-0 in their Fall season and Ibesate averaged a team-high .423 during the first 7 games and after the eighth had extended his hitting streak to 10 games dating back to last season. Last year Ibesate hit .368 in 46 games for Jamestown during their North Star Athletic Association conference regular season title. \n“Lance has picked up where he left off last year,” Jamestown coach Tom Hager said. “He set the tone by getting on base, stealing and making plays. We think he is the spark plug of the team. We are also asking him to be the leader of this team. We think he can do that verbally as well as on the field. Lance plays the game right.” \nIn the eight-game fall season, Ibesate ranked first in the NAIA Division I individual ratings in runs scored (12) and fielding percentage (1.000), second in assists per game (3.750), third in total stolen bases (5) and fourth in total assists (30). Ibesate averaged 1.375 hits per game, 3.625 at bats per game, 0.750 runs batted in per game and 1.875 putouts per game. \nThe fall season carries weight in the overall record but not the conference. The overall record is used for an at-large bid to the NAIA National Tournament if a team does not win their conference tourney. \n“There are two ways to qualify for the national tournament,” Hager said. “Winning the conference tournament or receiving an at-large bid. If we can continue to win ball games we can continue to move up the ladder in the national polls we have an extra advantage.” \nLast season Jamestown finished 30-16 and won the NSAA regular season conference title. \n“Unfortunately we did not play well in the playoffs,” Hager said. “Our team expects to have tremendous amounts of success. We return the majority of our pitching staff and five of the team’s nine starting position players. The goal, no matter what time of the year is to continue to improve.” \nAmong this year’s fall wins were a sweep over last season’s conference champions Mayville and a win over rival Valley City State. \n“It was a really good fall season,” Ibesate said. “This team is a good group of guys. One of my many questions was how do we get started and get all the new recruits and freshmen in for four weeks of practice. We all responded and we all clicked the first day of practice. We knew we could be special and it has shown.” \nThe Jimmies carry a chip on their shoulder after not qualifying for last season’s NAIA National Tournament. \n“The seniors made it clear this year that we need to play with an edge on the field,” Ibesate said. “We can’t go out like we did last year. We understand what is at stake. I just go out and play. I am always aggressive. Whatever it takes to win games … a bunt, a steal or making the routine play.” \nIbesate is majoring in communications and will graduate this spring. \n“This is kind of a bittersweet season for me,” Ibesate said. “It is my last season as a college baseball player. I haven’t looked at future baseball plans. I am just taking it day by day. I am just going to practice and enjoying my senior year.” \nIbesate has everything a next level scout loves, except his size. \n“I am not the biggest guy,” Ibesate said. “I am 5-foot-7, 165-pounds guy on a good day. My lifelong saying has always been, ‘It is not how big you are, it is how big you play.’ I have said that always.” \nNext up for the Jimmies is the winter season. A November, December and January filled with lifting and running five days a week. \n“The dark months are coming up,” Ibesate said. “Today was the last day to be out on the field. We start weights and conditioning next week. It is a chance to put down the baseball and the bat and take a break from the field and get better physically and mentally in the gym. It is time to get stronger and ready for the spring season. This time is extremely important, not just me but all the seniors. We have to set the example, it starts with us. We know what it takes through our years here.”", "external_links": [], "published": "2015-10-15T11:06:00.000+03:00", "crawled": "2015-10-15T13:03:47.066+03:00", "highlightTitle": ""}