{"organizations": ["Cavaliers", "Alec Beavers"], "uuid": "429bcfefb5f35349d8c4a4458fdb532e1286a677", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chillicothegazette.com", "main_image": "http://www.gannett-cdn.com/-mm-/afb32d281918fd824ae2f631d6200fac7e17c39f/c=0-269-2869-1883&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/08/Chillicothe/B9319190916Z.1_20151008230409_000_GTOC69CKR.1-0.jpg", "site_section": "http://rssfeeds.chillicothegazette.com/chillicothe/sports", "section_title": "Chillicothe - Sports", "url": "http://www.chillicothegazette.com/videos/sports/high-school/2015/10/09/73650728/", "country": "US", "title": "Cavs’ boys soccer locks up third straight SCOL title", "performance_score": 0, "site": "chillicothegazette.com", "participants_count": 0, "title_full": "Cavs’ boys soccer locks up third straight SCOL title", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T05:56:00.000+03:00", "replies_count": 0, "uuid": "429bcfefb5f35349d8c4a4458fdb532e1286a677"}, "author": "", "url": "http://www.chillicothegazette.com/videos/sports/high-school/2015/10/09/73650728/", "ord_in_thread": 0, "title": "Cavs’ boys soccer locks up third straight SCOL title", "locations": ["Chillicothe", "Wilmington", "Herrnstein Field"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jason Johansen", "Brock Netter", "Jess"], "text": "Cavs’ boys soccer locks up third straight SCOL title Brock Netter 10:56 p.m. EDT October 8, 2015 Chillicothe's Alec Beavers drives the ball away from a Wilmington player Thursday at Herrnstein Field. (Photo: Jess Grimm/Chillicothe Gazette) Chillicothe won its third straight SCOL title, Thursday night, with a 7-1 win over Wilmington. Senior Jason Johansen led the Cavaliers to victory with a hat trick. 89 CONNECT 2 TWEET LINKEDIN COMMENT EMAIL MORE \nCHILLICOTHE — Chillicothe’s boys soccer team clinched a third straight SCOL Championship with a dominant 7-1 victory over Wilmington on Thursday night. \nAlong with the championship, the Cavaliers (11-2-1, 11-0 SCOL) also kept their undefeated conference streak going. They haven’t lost in the SCOL since entering the league back in 2012. \n“We have a lot of great kids that play,” Chillicothe coach Mike McCorkle said. “These kids pretty much dedicate their entire year to playing soccer. They’re playing in the fall, the winter and the spring. They really enjoy and love the game of soccer. We’re now 33-0 in league play over the last three years. It’s tremendous and that’s a tribute to how hard the kids have worked.” \nWill Krieger got the scoring started for the Cavaliers, netting the first goal of the contest with 33:44 left in the first half, giving Chillicothe a lead. Just a few minutes later, Andrew Benson connected from 10 yards out, pushing the Cavalier’ lead to 2-0 with 30:37 remaining. \nWith 18:25 still to play, Alec Beavers found Jason Johansen streaking down the field between two defenders, ultimately ending with him finding the back of the net for the goal, giving the Cavaliers a 3-0 lead. \nLess than two minutes later, Krieger connected for his second goal of the contest, extending Chillicothe’s lead to 4-0 with 16:29 remaining in the half and putting the game out of reach for Wilmington. \n“These two together have been incredible for us this year,” McCorkle said. “Johansen has been a great scorer for us over the past two years. He has tremendous footwork and skills. Will has gotten better and better every day. He’s our leading scorer for the year. We call them ‘Thunder and Lightning’. Jason has more of the thunder foot and Will is just lightning quick and they’re a great combination to have up top for us.” \nJohansen, however, was just getting warmed up as he shook three Hurricane defenders inside the box to connect for his second goal of the game with 8:49 left in the first half, furthering the Cavalier’ lead to 5-0. \nHe had one more goal left in him as he found the back of the net to complete the hat trick and give the Cavaliers a 6-0 lead with 33:26 remaining in the second half. \n“I’ve always been told I have a knack for scoring,” Johansen said. “I know that when I’m in the box, they are always going to be defenders all around me. I usually have my head down going for the goal, but once I look up, things change a little bit. But I always find a way to find the open lane and kick the ball in the back of the net.” \nJohn Graves would round out the Cavaliers’ scoring effort just three minutes later, giving Chillicothe a 7-0 lead with 30:45 left in the contest. Wilmington’s lone goal of the night came off the foot of Sam Spirk with 18:10 remaining in the game. \n“We wanted to come out tonight and be the aggressors,” McCorkle said. “Wilmington is a good team, they’re just young. And that’s something we were able to take advantage of with our experience, size and speed. They start two freshman and six sophomores, so they’ll be a really good team over the next couple of years.” \nWith the season winding down and tournaments just around the corner, the Cavaliers have their mind on the big picture ahead. But they are well aware that they still have business to handle. \n“We want to finish undefeated in the league for the third straight year,” Johansen said. “A senior night win would put us at 34-0 total in league play and we want that on our record. We are definitely a team and a family. We work together through practice and we bring it all together out here on the field. We have two big games left and we feel that we can keep this momentum going and make a deep run in the tournament.” \nThe Cavaliers will look to complete the undefeated conference season, next Thursday, when they host Hillsboro. 89 CONNECT 2 TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http://ohne.ws/1Ll2yBo TOP VIDEOS", "external_links": [], "published": "2015-10-09T05:56:00.000+03:00", "crawled": "2015-10-09T20:08:13.159+03:00", "highlightTitle": ""}