{"organizations": [], "uuid": "7ea9a33a4547345f853bd9378673425aa66c37ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theday.com", "main_image": "http://www.theday.com/storyimage/NL/20151013/SPORT10/151019778/AR/0/AR-151019778.jpg&imageversion=16by9&Maxw=960", "site_section": "http://www.theday.com/section/rss08", "section_title": "The Day RSS Feeds - Professional Sports News", "url": "http://www.theday.com/professional-sports/20151013/granderson-mets-let-their-bats-do-the-talking", "country": "US", "title": "Granderson, Mets let their bats do the talking", "performance_score": 0, "site": "theday.com", "participants_count": 1, "title_full": "Granderson, Mets let their bats do the talking", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T08:21:00.000+03:00", "replies_count": 0, "uuid": "7ea9a33a4547345f853bd9378673425aa66c37ae"}, "author": "Associated Press", "url": "http://www.theday.com/professional-sports/20151013/granderson-mets-let-their-bats-do-the-talking", "ord_in_thread": 0, "title": "Granderson, Mets let their bats do the talking", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Granderson, Mets let their bats do the talking Travis d'Arnaud, left, greets Yoenis Cespedes after Cespedes hit a fourth-inning, three-run home run during the Mets' 13-7 rout of the Los Angeles Dodgers in Game 3 of the National League Division Series in Citi Field on Monday night. The Mets lead the series 2-1. (AP Photo/Kathy Willens)  21AM Associated Press \nNew York — With big hits rather than beanballs, the New York Mets wiped out the Los Angeles Dodgers and took control of their testy Division Series. \nCurtis Granderson drove in five runs with two doubles off the wall, Travis d'Arnaud and Yoenis Cespedes homered, and New York's dangerous bats busted loose for a 13-7 victory Monday night that gave the Mets a 2-1 advantage in the best-of-five NL playoff. \nBefore a bloodthirsty crowd of 44,276 in the first postseason game at Citi Field, the Mets broke their postseason scoring record as New York public enemy Chase Utley watched from the Los Angeles bench. The NL East champs quickly erased an early three-run deficit and made a winner of a mediocre Matt Harvey in his playoff debut. \nBack in the postseason for the first time in nine years, New York can reach the NL Championship Series with another win at home Tuesday night in Game 4. \nTrying to save the Dodgers' season, ace lefty Clayton Kershaw will start on three days' rest. Hometown rookie Steven Matz goes for the Mets. \nUtley is the subject of scorn in New York after his late takeout slide Saturday night broke the right leg of Mets shortstop Ruben Tejada at Dodger Stadium. \nAmid much speculation the Mets would seek revenge, manager Terry Collins said before the game Harvey was told not to. \n\"This is too big a game. We need to not worry about retaliating,\" Collins said. \"We need to worry about winning. ... We can play angry, but we've got to play under control.\" \nIn the end, Utley never got in the game and the Mets saved all their hard hits for when they were at the plate. \nHarvey labored through five innings in his first outing since missing a mandatory postseason workout and apologizing after he arrived. \nLos Angeles lefty Brett Anderson took the loss, tagged for six runs and seven hits in three ineffective innings. \nGranderson's five RBI matched a Mets postseason record set by Carlos Delgado in Game 4 of the 2006 NLCS at St. Louis, when New York set its previous postseason high with 12 runs. \nSeven seasons after it opened, Citi Field was trimmed in traditional postseason bunting for the Mets' first home playoff game since Carlos Beltran took strike three from Cardinals right-hander Adam Wainwright to end the 2006 NLCS at Shea Stadium. \nRevved-up fans showed up early hungering for payback against Utley, left out of the lineup despite strong career numbers versus Harvey (6 for 18 with a home run). \nRegular starter Howie Kendrick remained at second base, and Dodgers manager Don Mattingly said Utley was on the bench not for safety but solely \"baseball reasons.\" \nUtley was eligible to play after appealing a two-game suspension for his slide, deemed illegal after a review by Major League Baseball. \nAs loud boos rang out during pregame introductions, Utley stared stone-faced straight into the lens while a camera lingered on his face for a few extra seconds. \nThe 7 Line Army and other fans waving orange towels brought cutouts with Utley's face in the bull's-eye of a target. One sign near the first base dugout read: \"Chase Ugly Is Still Philthy,\" a nod to his 12-plus years playing Mets nemesis for rival Philadelphia. And even New York Mayor Bill de Blasio weighed in, calling Utley \"guilty as sin.\" \nMeanwhile, Tejada raised his fist to a rousing ovation when he was introduced in full uniform alongside teammates. With a walking boot and Mets cane, he hobbled out to the baseline as fans — some carrying \"WinForRuben\" signs with his face on them — chanted the shortstop's name. \nJust as Harvey got set to throw first pitch, there was more confusion. Mattingly and Collins each huddled with umpires during a 5-minute delay because the replay phone in the Dodgers' dugout was on the fritz. \nIn the middle of the first inning came an announcement that the line was fully operational. \nAnd perhaps fittingly, Kendrick, the first batter of the game, hit a grounder to shortstop — where fan-favorite sub Wilmer Flores fielded it flawlessly on his backhand. Mets starter Matt Harvey, the ex-Fitch great, battled through five innings, striking out seven and earning the victory as the Mets took a 2-1 lead in the NLDS with a 13-7 win over the Los Angeles Dodgers on Monday night at Citi Field. (AP Photo/Julie Jacobson)", "external_links": [], "published": "2015-10-13T08:21:00.000+03:00", "crawled": "2015-10-13T08:42:30.165+03:00", "highlightTitle": ""}