{"organizations": ["Rugby League"], "uuid": "37eca25281a94e12c71a3dc60c4c7694b7fc76c8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cairnspost.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/external?url=http://content4.video.news.com.au/foxsports/prod/archive/2015/10/22/FSD_221015_RLG_MENINGA_FOR_KANGAROOS.jpg&width=650&api_key=kq7wnrk4eun47vz9c5xuj3mc", "site_section": "http://feeds.news.com.au/public/rss/2.0/cpost_news_sport_3328.xml", "section_title": "CairnsPost | Sports", "url": "http://www.cairnspost.com.au/sport/mal-meninga-to-kangaroos-biggest-challenges-for-queensland-if-champion-coach-moves-on/story-fnjpuwrj-1227578952429?from=public_rss", "country": "IL", "title": "Mal to Roos? Queensland’s big dilemma", "performance_score": 0, "site": "cairnspost.com.au", "participants_count": 0, "title_full": "Mal to Roos? Queensland’s big dilemma", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T10:24:00.000+03:00", "replies_count": 0, "uuid": "37eca25281a94e12c71a3dc60c4c7694b7fc76c8"}, "author": "", "url": "http://www.cairnspost.com.au/sport/mal-meninga-to-kangaroos-biggest-challenges-for-queensland-if-champion-coach-moves-on/story-fnjpuwrj-1227578952429?from=public_rss", "ord_in_thread": 0, "title": "Mal to Roos? Queensland’s big dilemma", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Roos", "Mal Meninga"], "text": "Rugby League: Queensland coach Mal Meninga says he's ready to walk away from Origin and take over the Australian team. Fox Sports Sport/NRL/News Mal Meninga may abandon his Queensland post. Source: FoxSports \nMAL Meninga has put his hand up high to signal his interest in the Kangaroos coaching job. \nThere’s strong signs pointing towards those in charge giving his appointment the thumbs up. \nIt’s good news for Australia, but it will leave Queensland looking for a new Origin coach. \nWhile the ARL hasn’t ruled out the possibility of Meninga coaching both the Kangaroos and Maroons, the man himself believes it should be one or the other. \n“If the Australian job is a full-time gig, I would seriously considering giving up the Queensland job, yes,” Meninga told The Courier Mail . \n“I wouldn’t have time to coach a club or Origin side. \n“My view is that the Australian job should be a full-time position and be filled by someone who can do the job full-time.” Mal Meninga and Cameron Smith enjoy the 2015 series win. Source: News Corp Australia \nThe problem for Queensland Rugby League is the three-year contract extension Meninga has reportedly signed. \nThey had their coach locked in until 2019, and all of a sudden they will have to scramble to find a replacement quick. \nWith the Kangaroos due to play a one-off Anzac Test in April, the ARL would likely want to find a replacement for Tim Sheens by the new year. \nSo who could fill Meninga’s shoes for Queensland and what other challenges would it cause the champion Maroons? The Origin candidates \nThere’s a couple of contenders running ahead of the pack when the QRL begins the search for the next Meninga. \nMichael Hagan has been Meninga’s assistant for the past five years. \nIt could be argued he kickstarted Queensland’s decade of dominance, having coached the side in 2004 and 2005 before passing the reins. \nHagan knows the playbook inside and out, meaning the disruption to the Maroons camp would be minimal heading into the 2016 series. \nThe other leading contender is Kevin Walters . \nCurrently Wayne Bennett’s assistant at Brisbane, Walters has been around the traps and worked with some of the best in the business. \nSpeaking to foxsports.com.au , long-time mate and fellow Broncos assistant Allan Langer said Walters would not be out of place in charge of Queensland. Mal Meninga and Michael Hagan chat during training. Source: News Corp Australia \n“He knows what it’s all about,” Langer said \n“He’s been there, done that, and been around this side for a number of years. He would certainly be a great choice. \n“Mal has had Micky Hagan and Kevvy Walters around him the past couple of years, and Neil Henry has been there too. \n“Anyone who has come through the ranks with Mal I’m sure will be a chance of getting the job. \n“It would be a tough job to take on, but also very enjoyable.” \nHenry is contracted to Gold Coast and would be unable to coach a state team while in charge of an NRL club. Dean Ritchie: 'Smith had to go' 4:27 \nNRL: The Daily Telegraph's Dean Ritchie says outgoing NRL CEO Dave Smith had to go in order for the code to salvage any relationship they have left with News Corp and Fox Sports following the botched broadcast deal. Fox Sports Sport/NRL Meninga’s legacy with the Maroons \nThe Maroons have won nine of the past 10 Origin series since Meninga took the reins. \nOf the 30 games he’s coached, Queensland has won 20 and lost 10. \nIt’s a phenomenal record, no doubt about it. \nBut what Meninga will leave behind runs much deeper than numbers in the history books. \nPetero Civoniceva — who played 33 games for Queensland and 45 for Australia — says Meninga has built a culture that will remain ingrained in the entire state. \n“I think his greatest strength is his ability to build a really strong team culture,” Civoniceva told foxsports.com.au . \n“That’s been the cornerstone of the success of that Queensland side for a number of years. \n“His presence alone is something that’s very important to the boys.” \nCivoniceva is confident Meninga’s “team culture” can be just as easily transferred to the Kangaroos job. \n“It’s obviously there already but Mal would grow that,” he said. Where to now for Queensland? \nThe iconic State of Origin contest has been dominated by one team for the past 10 years. \nA masterful coach and a core group of players has made the Maroons a formidable side. \nBut all good things must come to an end. \nWould Meninga’s exit mark the end of an era for Queensland? \nPlayers like Cameron Smith, Johnathan Thurston, Corey Parker, Billy Slater, Cooper Cronk, and Sam Thaiday are edging closer to retirement. \nJustin Hodges has already called time on his Origin career. Cameron Smith, Johnathan Thurston and Billy Slater. Source: News Corp Australia \nAt best the current group will make it through to 2017 in tact. \n“You look at Smithy, Thursto, Cooper, Corey ... it will be interesting now to see what happens with this team,” Maroons legend Langer admitted. \nBut Petero Civoniceva has confidence in the next batch of Queensland talent. \n“There’s certainly a group of players that are definitely going to feature for Queensland in the next few years that have been a part of the make-up for a little while,” Civoniceva said. \n“It’s one of those things, great teams and great clubs have to evolve.” \nSo, if by 2017 Queensland has a new coach, a new hooker, a new halves pairing, and new fullback, can the Maroons continue their Origin dominance? \nWe might be about to find out.", "external_links": [], "published": "2015-10-22T10:24:00.000+03:00", "crawled": "2015-10-22T12:11:51.425+03:00", "highlightTitle": ""}