{"organizations": [], "uuid": "5035709c00dd5ccab3e3f1d7e019eb4fce8eaaf3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtontimes.com", "main_image": "http://media.washtimes.com.s3.amazonaws.com/media/image/2015/10/09/AP_424760269350.jpg", "site_section": "http://www.washingtontimes.com/rss/headlines/sports/", "section_title": "www.washingtontimes.com stories: Sports", "url": "http://www.washingtontimes.com/news/2015/oct/9/redskins-tight-end-derek-carrier-ready-step-jordan/", "country": "US", "title": "Redskins tight end Derek Carrier ready to step up with Jordan Reed out", "performance_score": 0, "site": "washingtontimes.com", "participants_count": 1, "title_full": "Redskins tight end Derek Carrier ready to step up with Jordan Reed out", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T23:26:00.000+03:00", "replies_count": 0, "uuid": "5035709c00dd5ccab3e3f1d7e019eb4fce8eaaf3"}, "author": "Anthony Gulizia", "url": "http://www.washingtontimes.com/news/2015/oct/9/redskins-tight-end-derek-carrier-ready-step-jordan/", "ord_in_thread": 0, "title": "Redskins tight end Derek Carrier ready to step up with Jordan Reed out", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Football Redskins tight end Derek Carrier ready to step up with Jordan Reed out Washington Redskins running back Alfred Morris (46) tries to get away from Miami Dolphins defensive end Terrence Fede (78) who is blocked by Redskins tight end Derek Carrier (89) during the first half of an NFL football game Sunday, Sept. ... more > By Anthony Gulizia - The Washington Times   \nASHBURN — Washington Redskins tight end Derek Carrier is used to adjusting. \nWhen he signed with the San Francisco 49ers in 2013 after brief stints in Oakland and Philadelphia, he knew he had to make a change if he wanted to remain on an NFL roster. \nThat’s when the former undrafted wide receiver from Beloit College — a tiny Division III liberal arts school in Wisconsin — seized an opportunity to switch to tight end, even if it meant adding almost 30 pounds to his 6-foot-4 frame. \n“Playing wide receiver, it was physical, but it’s a completely different game stock-blocking on the outside as opposed to being in the trenches and blocking guys that are upwards of 50 pounds heavier than you,” said Carrier, who now weighs 241 pounds. “I gained about 30 pounds, probably up until two years ago. I ate everything and anything, as much as I could. It was pretty gross at some points, just how much I was eating.” \nOn Aug. 21, the Redskins traded a 2016 fifth-round pick for Carrier, who caught nine passes for 105 yards in 11 games with San Francisco last season. \nThe Redskins desperately needed depth at the position after losing both Niles Paul and Logan Paulsen to season-ending injuries in the preseason. Though Carrier was a late addition, he shed his identity as a pass-catching tight end and worked closely with positional coach Wes Phillips to improve his run blocking. Through four games, he has played more than 50 percent of the team’s offensive snaps, mostly as a blocker in multiple-tight end sets. \nNow, Carrier is ready to adapt again. The Redskins will face the Atlanta Falcons without tight end Jordan Reed, who is out because of a concussion, meaning even more playing time for Carrier and more opportunities to catch the ball. \n“I think something for me personally, I take pride in being a complete player,” Carrier said. “It’s not so much looking forward to the opportunity to catch the ball more, but being able to incorporate both phases into my game. \n“Part of me is really excited I’ll be a bigger part of the game plan.” \nCarrier’s pride in being a complete player is what motivated him to improve his run blocking in Washington. Carrier was acquired less than a month before the start of the regular season, but he worked diligently to adapt to the Redskins’ system. \n“I think my run blocking has been pretty darn good since I got here,” Carrier said after the Redskins’ 24-10 victory against St. Louis. \n“I give all the credit to the coaches, helping me with the techniques they use and being strict and lot letting anything slide.” \nIn last Sunday’s 23-20 win against Philadelphia, Carrier caught two passes for 18 yards, including a 15-yard gain on second-and-16 that gave the Redskins a more favorable third-down scenario. \nReed, who has a team-high 278 receiving yards, proved to be one Cousins’ most reliable targets so far this season, along with receiver Pierre Garcon. Reed and Garcon are tied for a team-high 24 receptions, and 18 of Reed’s catches have been for a first down. \nThe Redskins are optimistic about Carrier’s ability to step up in the passing game this Sunday against Atlanta.", "external_links": [], "published": "2015-10-09T23:26:00.000+03:00", "crawled": "2015-10-10T00:29:29.385+03:00", "highlightTitle": ""}