{"organizations": ["Jets", "J.P. PELZMAN Print"], "uuid": "a3d5fc95d5f62e9c7d178478748723750bc3a66a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.northjersey.com", "main_image": "http://www.northjersey.com/designimages/NorthJerseyFacebook_377x196.jpg", "site_section": "http://www.northjersey.com/cmlink/sports-rss.rss", "section_title": "Sports News on NorthJersey.com", "url": "http://www.northjersey.com/sports/jets-expect-sheldon-richardson-to-be-eligible-for-next-game-1.1426016", "country": "US", "title": "Jets expect Sheldon Richardson to be eligible for next game", "performance_score": 0, "site": "northjersey.com", "participants_count": 0, "title_full": "Jets expect Sheldon Richardson to be eligible for next game", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T05:27:00.000+03:00", "replies_count": 0, "uuid": "a3d5fc95d5f62e9c7d178478748723750bc3a66a"}, "author": "", "url": "http://www.northjersey.com/sports/jets-expect-sheldon-richardson-to-be-eligible-for-next-game-1.1426016", "ord_in_thread": 0, "title": "Jets expect Sheldon Richardson to be eligible for next game", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sheldon Richardson"], "text": "Jets expect Sheldon Richardson to be eligible for next game October 5, 2015, 4:43 PM Last updated: Monday, October 5, 2015, 10:27 PM By J.P. PELZMAN Print \nThe Jets are second in the NFL in total defense, and first in fewest points allowed. \nAnd oh yeah, they almost certainly will have the services of the 2013 NFL Defensive Rookie of the Year when they play their next game. \nThat’s not a comforting thought for opponents. \nThe NFL hasn’t imposed any additional discipline on Sheldon Richardson, so the star defensive end will be eligible to play when the Jets return to action Oct. 18 against Washington. Richardson, who was suspended for the first four games of the season for violating the NFL’s substance-abuse policy, had a continuance of his pending court case Monday in St. Charles County, Mo. \nThe hearing was postponed until Nov. 9, the day after the Jets play Jacksonville at MetLife Stadium. \nRichardson is facing five misdemeanor charges, including resisting arrest, for an incident July 14 in which he allegedly drove his 2014 Bentley at speeds of up to 143 mph while apparently racing with another car. Once the case is finished, he could face additional discipline from the league under its personal-conduct policy. But the Jets expect him to be available for their next game, after their bye this week. \nRichardson’s impending return “gives us an extra weapon, extra depth,” coach Todd Bowles said on a conference call. “We’ve got to get him back in football shape and get him in the rotation.” \nRichardson was prohibited from practicing with the team during his suspension, although he was allowed to be at the team’s complex and attend meetings. \nThe defense has played very well without Richardson, but Bowles doesn’t think his return will disrupt that unit’s chemistry. \n“You don’t have a challenge finding places for good players to play,” the coach said. \nBowles indicated the Jets won’t make a corresponding move until next week, which means they apparently have been given a roster exemption for now. They eventually will have to remove a player from the 53-man roster to make room for Richardson. \n“We’re obviously happy to have him,” quarterback Ryan Fitzpatrick said. “I’ve never played with him. I’ve played against him, but I know he’s a great player. It was tough all off-season going up against our defense, so it’s nice to see them bullying somebody else for a change.” \n“It’s a huge addition to our defense,” linebacker Demario Davis said. \nBRIEFS: The NFL will not impose any discipline on controversial Miami DT Ndamukong Suh, who was involved in a play Sunday during which he kicked Fitzpatrick in the head and knocked off his helmet. The NFL deemed the contact inadvertent. What does Fitzpatrick think? \n“I don’t know,” he said. “I know I got asked after the game, and I didn’t really know what happened other than [that] my helmet came off. I have not even watched the game yet to be honest, so I don’t know. I think [the NFL] came out and ruled that it was unintentional, so I’ve got no worries.” \nBowles listed S Calvin Pryor (bruised knee), LB David Harris (quadriceps), DE Leonard Williams (sprained ankle) and RB Bilal Powell (groin) as players who were injured Sunday. “I won’t be able to tell until next week,” Bowles said when asked about their availability for the next game, but he added that the bye week “came at a good time.” … The Jets signed former New England and Oakland WR Kenbrell Thompkins to the practice squad. He totaled 53 catches over the last two seasons and recently was waived from the Patriots’ practice squad. WR-KR Walt Powell was waived from the practice squad to make room. \n© 2015 North Jersey Media Group Tags:", "external_links": [], "published": "2015-10-06T05:27:00.000+03:00", "crawled": "2015-10-06T05:56:59.973+03:00", "highlightTitle": ""}