{"organizations": ["Star Press", "Ball State"], "uuid": "f067a0d7d848e6d59207f3e3378f497b49953b6a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestarpress.com", "main_image": "http://www.gannett-cdn.com/-mm-/4d1bf7cb783de206715c4895d9011782dc1437fc/c=0-207-3755-2328&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/03/INGroup/Muncie/635795074846613245-MNI-1003-Ball-State-vs-Toledo06.jpg", "site_section": "http://rssfeeds.thestarpress.com/muncie/sports/", "section_title": "Muncie - Sports", "url": "http://www.thestarpress.com/story/sports/high-school/2015/10/17/left-everything-burris-hollihan-returns/72992312/", "country": "US", "title": "LIVE BLOG: Ball State vs. Georgia State", "performance_score": 0, "site": "thestarpress.com", "participants_count": 0, "title_full": "LIVE BLOG: Ball State vs. Georgia State", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T01:28:00.000+03:00", "replies_count": 0, "uuid": "f067a0d7d848e6d59207f3e3378f497b49953b6a"}, "author": "", "url": "http://www.thestarpress.com/story/sports/high-school/2015/10/17/left-everything-burris-hollihan-returns/72992312/", "ord_in_thread": 0, "title": "LIVE BLOG: Ball State vs. Georgia State", "locations": ["Georgia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jordan Williams", "Toledo", "Corey", "Ryan O'Gara"], "text": "LIVE BLOG: Ball State vs. Georgia State Ryan O'Gara , rogara@muncie.gannett.com 6:28 p.m. EDT October 17, 2015 Buy Photo Ball State's wide reciever Jordan Williams attempts to gain yards after catching a quick screen pass on Saturday during Ball State's homecoming game against Toledo. Ball State lost 24-10. (Photo: Corey Ohlenkamp/The Star Press, Corey Ohlenkamp/The Star Press) Buy Photo 2 CONNECT 18 TWEET LINKEDIN COMMENT EMAIL MORE \nFINAL: GEORGIA STATE 31, BALL STATE 19 \n1:46 : Neal throws an interception, and this one is over. Georgia State in victory formation. \nGEORGIA STATE 31, BALL STATE 19 \n2:13 : Arbuckle sneaks in from one yard to put the nail in the coffin. His 68-yard pass to Donovan Harden to the 1 on blown coverage was the big play. \n3:26 : A three-and-out for Ball State gives ball back to Georgia State at its own 30. Defense has pitched a shutout in the second half, need another stop. \n3:59 : Ball State has only itself to blame for not getting the ball back with more time left. After Keenan Noel knocked down 2nd-and-12 pass and Dedrick Cromartie wrapped up on third down, Cywettniei Brown was flagged for roughing the kicker on 4th-and-7, a 15-yard penalty. Ball State is typically very disciplined, coming into this game with the third fewest penalty yards in the country. \nStill though, Ball State has a chance here. \n6:58 : Pete Lembo playing it safe — for now. Cardinals punted on 4th-and-3 from own 38. Georgia State takes over at own 28. \nThe big development from that possession was KeVonn Mabon appeared to hurt his left knee pretty badly on an incomplete deep pass. He could not put any pressure on it as he was helped off very slowly. The Cardinals' No. 2 receiver hurt it last week against Northern Illinois. I highly doubt we will see him again today. A large group of players gathered around him on the sideline during the TV timeout. \n8:54 : Defense gets another stop. Ball State has probably two possessions left, but this is a big one. Drive starts at own 16. \nGEORGIA STATE 24, BALL STATE 19 \n10:41 : Neal delivers a 19-yard touchdown pass to Jordan Williams, but the conversion fails. Still, Cardinals needed that badly. Within a possession now, which is what you need there. Key play on that 7-play, 51-yard drive was KeVonn Mabon's 15-yard catch on 3rd-and-6. \n12:42 : Anthony Winbush gets the Cardinals' second sack of the day on 3rd-and-5. Defense has done its part in the second half, the offense needs a score here now. Lacanaria returns the punt 24 yards and Cardinals take over at own 49. \nEND OF 3RD QUARTER: GEORGIA STATE 24, BALL STATE 13 \n0:10 : Neal's 49-yard touchdown pass to a wide-open Chris Shillings is called back for offensive pass interference. That's the second time in three weeks Ball State has had touchdown called back for offensive pass interference... Jordan Williams' touchdown that would've cut Toledo's lead to 24-17 midway through the fourth quarter was also called back, and Ball State wound up missing a field goal in that one. On this one, Cardinals punt and Georgia State gets ball at own 26. \n2:44 : Ball State gets another stop. Good coverage from Martez Hester on 3rd-and-8 pass as Cardinals brought some pressure. They take over at own 18. \nGEORGIA STATE 24, BALL STATE 13 \n4:46 : Hagee drills a 29-yard field goal, but Cardinals thinking what could have been there... Neal kept alive a 3rd-and-8 play from the 12 and threw back across the field, but the pass went through Curry's hands in the end zone. \n8:27 : Sean Wiggins with two big plays to stop Georgia State's streak of four straight scoring drives. First he got Arbuckle for a sack and 6-yard loss, then he recovered a fumble to get Ball State the ball at Georgia State's 46. \n11:12 : Ball State threatens but ultimately punts. Neal had 13-yard run on zone read to open the drive. He had four carries for seven yards in the first half, three of which were sneaks in short-yardage situations. Neal tucked the ball a lot in his first three games, not as much here lately. Georgia State ball on own 11. \nHALFTIME: GEORGIA STATE 24, BALL STATE 10 \n0:00 : Will Lutz makes a 50-yard field goal to end the half. If not for three penalties for 30 yards would Panthers have scored another touchdown? \n1:06 : Ball State turns the ball over on downs. Drops have killed several drives. Can Cardinals get a stop here? \nGEORGIA STATE 21, BALL STATE 10 \n2:51 : Arbuckle sneaks in from a yard out. The Panthers have touchdowns on three straight drives. What's the fix for the defense? I don't know. Time to try something different? Georgia State is up to 231 total yards after a slow start. Panthers have had some big games, but Appalachian State held them to 225 last week — in the entire game. \n6:34 : Ball State goes three-and-out. I wonder how much pressure the offense feels knowing the defense can't stop anyone? Georgia State takes over at its own 41. \nGEORGIA STATE 14, BALL STATE 10 \n7:44 : So about that Ball State defense... Georgia State needed just eight plays and 2:27 to go 65 yards as Robert Davis hauls in 11-yard touchdown pass from Nick Arbuckle. \nBALL STATE 10, GEORGIA STATE 7 \n10:11 : Riley Neal hits Dylan Curry for 4-yard touchdown. Good response from Cardinals as a 17-play drive should give the defense time to recover. Key play was Neal hitting Corey Lacanaria for 16 yards on 3rd-and-12. \nEND OF FIRST QUARTER \nGEORGIA STATE 7, BALL STATE 3 \n0:15 : Kyler Neal caps a 11-play, 75-yard drive with a 4-yard touchdown run. Interesting play on that drive... Georgia State wide receiver fumbled the ball, then appeared to intentionally bat ball out of bounds. Who saw that Seahawks/Lions game on Monday Night Football a few weeks ago when that call was missed? Refs apparently ruled ball was already out of bounds. I'll say this... it was very, very close. Would've backed Georgia State up. Would it have mattered? You tell me. \nBALL STATE 3, GEORGIA STATE 0 \n4:45 : Morgan Hagee caps 12-play, 48-yard drive with a 35-yard field goal. Nice run/pass balance for Cardinals so far with Neal attempting nine passes and eight team rushing attempts. \n8:59 : A missed tackle from Zack Ryan doesn't hurt the Cardinals as Georgia State punts again. Ball State takes over at own 34. \n11:05 : Neal hit his first three throws, misses last two and Ball State will punt on its first possession. Still scoreless as Georgia State takes over at its own 13. \n13:36 : Ball State's defense forces a three-and-out. It's early, but good sign for the Cardinals. There weren't too many of those last week. Northern Illinois scored on nine — YES NINE — straight possessions last week. \nGAME NOTES \n-- Ball State (2-4) hosts Georgia State (1-4) in non-conference action. Cardinals have lost their last three, including a 59-41 loss at Northern Illinois last week. \n-- This is Ball State's final non-conference game of the season. The Cardinals have 10 non-conference wins in five years under head coach Pete Lembo. \n-- Riley Neal set a Ball State freshman record with 393 passing yards last week at Northern Illinois. He threw touchdown passes to four receivers, all for their first scores of the season. His 53-yard TD pass to Cywettnie Brown was the Cardinals' longest play of the season. \n-- The Cardinals have had a lot of success on fourth down, converting 9 of 11 this season. They were 4 of 4 last week at Northern Illinois, including a five-yard touchdown from Neal to Jordan Hogue. \n-- Ball State continues to be one of the least penalized teams in the country. The Cardinals were flagged just three times for 40 yards at Northern Illinois. Ball State's average of 30.8 penalty yards per game ranks as the third fewest in Division-I football. \n-- Senior wide receiver Jordan Williams has a reception in 30 consecutive games. He tallied his third straight 100-yard receiving game at Northern Illinois, finishing with nine catches for 108 yards. His 2,358 career receiving yards rank fifth in program history. 2 CONNECT 18 TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http://tspne.ws/1LAq25K TOP VIDEOS", "external_links": [], "published": "2015-10-18T01:28:00.000+03:00", "crawled": "2015-10-18T04:35:17.231+03:00", "highlightTitle": ""}