{"organizations": [], "uuid": "d82f02b0feee06a981e37fd65e584e41f040386d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews/", "section_title": "Reuters: Sports News", "url": "http://uk.reuters.com/article/2015/10/18/uk-rugby-union-world-ireland-argentina-s-idUKKCN0SC0NU20151018", "country": "US", "title": "Brilliant Pumas down Ireland to reach semi-finals", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "Brilliant Pumas down Ireland to reach semi-finals", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T17:17:00.000+03:00", "replies_count": 0, "uuid": "d82f02b0feee06a981e37fd65e584e41f040386d"}, "author": "", "url": "http://uk.reuters.com/article/2015/10/18/uk-rugby-union-world-ireland-argentina-s-idUKKCN0SC0NU20151018", "ord_in_thread": 0, "title": "Brilliant Pumas down Ireland to reach semi-finals", "locations": ["Ireland"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Nick Mulvenney"], "text": "CARDIFF | By Nick Mulvenney \nCARDIFF Argentina stunned an injury-depleted Ireland with an early onslaught and finished at a canter to secure a 43-20 victory on Sunday that sent them into the Rugby World Cup semi-finals for the second time. \nEven the Six Nations champions of the last two seasons could not halt the unstoppable march of the Southern Hemisphere as the impressive Pumas joined New Zealand and South Africa in the last eight. \nBlistering two-try opening and closing salvos allied with the assured place-kicking of flyhalf Nicolas Sanchez earned Argentina a Twickenham meeting with Australia or Scotland, who play in the last quarter-final later on Sunday. \nEarly tries from centre Matias Moroni and winger Juan Imhoff silenced the passionate Irish following in the 72,316 Millennium Stadium crowd and when Sanchez kicked the first of his five penalties, the Pumas were 17-0 up after 14 minutes. \nIreland fought back with tries from replacement winger Luke Fitzgerald in the 24th minute and flanker Jordi Murphy shortly after the break to cut the deficit to 20-17, but three points was as close as the Irish would get. \nSanchez kept the scoreboard ticking over and clinical finishing from fullback Joaquin Tuculet and Imhoff for tries in the last 11 minutes ensured Argentina would match their breakthrough achievement of reaching the last four in 2007. \nIreland deserve credit for their comeback because for the first quarter-of-an-hour, it looked like Argentina would romp into the semi-finals on the back of a stunning display of total rugby. \nHammering into contact and transferring the ball through the hands of backs and forwards alike at pace, it took only four minutes for Moroni to score in the corner after a sweeping move. \nSix minutes later Imhoff beat Rob Kearney in a race to Santiago Cordero's chip through and did superbly to touch down before the ball went dead. \nIreland were able to regroup in the 17th minute when Pumas prop Ramiro Herrera earned a yellow card for a no-arms tackle and before he returned Fitzgerald skipped down the touchline and stepped inside Juan Martin Hernandez for a try. \nIt was a break up the middle from Fitzgerald, on for the injured Tommy Bowe, that sent Murphy through for a second Irish try which brought the crowd back into the match. \nUltimately, though, the absence of captain Paul O'Connell and playmaker Johnny Sexton as well as two regular starting flankers were losses Ireland could not afford and their quest for a first World Cup semi-final will go on for at least another four years.", "external_links": [], "published": "2015-10-18T17:17:00.000+03:00", "crawled": "2015-10-18T18:44:03.912+03:00", "highlightTitle": ""}