{"organizations": [], "uuid": "57d33e99c56d5ca30063234bf7186fdd59af2653", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pe.com", "main_image": "http://images.onset.freedom.com/pressenterprise/thumb/nwnn0h-b88547565z.120151022205528000gqpcod4v.10.jpg", "site_section": "http://www.pe.com/sections/sports/", "section_title": "Sports : Press Enterprise", "url": "http://www.pe.com/articles/dodgers-784189-mattingly-information.html", "country": "US", "title": "MOURA: Expect Dodgers to get younger as overhaul continues", "performance_score": 0, "site": "pe.com", "participants_count": 1, "title_full": "MOURA: Expect Dodgers to get younger as overhaul continues - Press Enterprise", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "57d33e99c56d5ca30063234bf7186fdd59af2653"}, "author": "PEDRO MOURA", "url": "http://www.pe.com/articles/dodgers-784189-mattingly-information.html", "ord_in_thread": 0, "title": "MOURA: Expect Dodgers to get younger as overhaul continues", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By PEDRO MOURA / STAFF WRITER\nPublished: Oct. 22, 2015 Updated: Oct. 23, 2015 12:08 a.m. LOS ANGELES – It was never expressly described as such – is it ever? – but it has become clear in the last week that 2015 was a rebuilding year for the Dodgers.\nThe men running the team for the first time repeatedly declined to forfeit future potential for current improvement. They committed a bunch of current money to preserve future expenditures.\nThey thought they might be able to win while doing that it, if they played it right. They did not win. They probably did not play it right, if not entirely wrong. And now, after Thursday’s announcement, the question becomes: Will 2016 be the same?\n“We expect to have a younger team going forward,” Dodgers general manager Farhan Zaidi said at the news conference called to explain Mattingly’s expiration as the Dodgers’ manager. “The timing makes sense for us, from that standpoint.”\nIf Zaidi and president of baseball operations Andrew Friedman are to be believed, they would have been equally OK with Don Mattingly returning as exiting from his post. That stated truth is hard to reconcile.\nBut let’s examine.\nIn the year-and-a-week since he took over the Dodgers, Friedman has gotten rid of the major-league, Triple-A, and Double-A managers, re-assigned a major-league coach, fired eight other minor-league coaches and several international scouts. He has watched others resign, including longtime vice president of medical services Stan Conte, and welcomed others to look elsewhere, including Mattingly’s array of assistant coaches.\nTo say the Dodgers decision-makers got rid of Mattingly because they desired a sabermetrically-inclined manager is to oversimplify the situation. It’s not like they thought a year ago he was an advanced data fiend. He essentially managed like most rational observers imagined he would. There’s reason to think that with time he could have become better at incorporating them into his decisions, too.\n“I don't think fluency with that stuff is as necessary as openness to ideas,” Zaidi said Thursday.\nSaid Mattingly, in January: “If you’re not using analytics as part of your decision-making process, you’re a fool.”\nHe said then that his preeminent question was in regards to the quality of the data he was presented.\n“Is better information out there as we go deeper into it?” Mattingly asked. “From that standpoint, I want to learn. I want to get better, and if there’s a better way to do it, then that’s the way we do it.”\nThe Dodgers believe their information is the best, or, at least, will be the best. And Friedman of course would not say as much, but the widespread expectation is that Gabe Kapler becomes the immediate favorite to succeed Mattingly. Kapler, the Dodgers’ player development director, has staked a portion of his success to his abilities in implementing information.\nI wrote in May about his efforts introducing Dodger minor leaguers to advanced metrics, quoting an article he wrote for Fox Sports in 2013. It is, really, his managing manifesto, and it is applicable here.\n“The next real advantage will come not from which team can acquire the most information, but from which team can best put that information into practice,” Kapler wrote. “Herein lies one of the great challenges of implementing winning, but unconventional, technique. Players are resistant to change; managers are disinclined to upset habits.”\n1 2 Next Page", "external_links": [], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-23T13:04:53.427+03:00", "highlightTitle": ""}