{"organizations": [], "uuid": "f552cebd73b2d648aa79acafa74a07d6ef9b6efc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/ncaafb", "section_title": "NCAA FB News, Scores, Schedule, Standings, Stats, Photos, Videos - Football - MSN Sports", "url": "http://www.msn.com/en-us/sports/ncaafb/opinion-nows-the-time-for-usc-to-fire-haden-too/ar-AAfljRn", "country": "US", "title": "Opinion: Now's the time for USC to fire Haden, too", "performance_score": 0, "site": "msn.com", "participants_count": 13, "title_full": "Opinion: Now's the time for USC to fire Haden, too", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 12, "uuid": "f552cebd73b2d648aa79acafa74a07d6ef9b6efc"}, "author": "George Schroeder, USA TODAY Sports", "url": "http://www.msn.com/en-us/sports/ncaafb/opinion-nows-the-time-for-usc-to-fire-haden-too/ar-AAfljRn", "ord_in_thread": 0, "title": "Opinion: Now's the time for USC to fire Haden, too", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Opinion: Now's the time for USC to fire Haden, too USA Today Sports 16 hrs ago by George Schroeder, USA TODAY Sports © Ross D. Franklin, AP Ross D. Franklin, AP With USC football coach Steve Sarkisian terminated , it's time to evaluate USC's athletic director, too.\nAdChoices Pat Haden contributed to the spectacle. The leave of absence Haden told Sarkisian to take was about seven weeks too late. Clearly, the coach is struggling with serious issues. Let's hope he's able to get help and recover. But his boss either didn’t recognize the magnitude of the problem or declined to deal with it in August, when Sarkisian made that intoxicated, profane appearance at the annual “Salute to Troy” booster function.\nEither way, this debacle is on Haden. And now that Sarkisian is gone, it might be time to ask Haden to leave, too, for the latest in a series of high-profile missteps.\nWhen he was hired, the former Trojans star was a clear upgrade from Mike Garrett, but that's not saying much. USC fans like to carp, and with some justification, about the NCAA's extremely harsh penalties for the Reggie Bush violations. But Garrett's insolence and defiance played a huge role in what the Trojans got.\nHaden's arrival was hailed as an important and necessary change.\nToo bad it hasn't worked out that way. In five years as athletic director, he's has gotten some things right — and some very big things wrong. He fired Lane Kiffin, who'd been hired by Garrett. But then, like Garrett before him, he mistakenly tried to recapture the Pete Carroll era by hiring a former assistant.\nNever mind Sarkisian's off-field issues, which might stretch back to his time at Washington. Sarkisian deserves credit for resurrecting a Huskies program that was in ashes, but there weren't any real signs he had the coaching acumen to lead a program like USC back to its standard, which is Pac-12 titles and national titles.\nBoise State's Chris Petersen, one of the winningest active coaches in college football, might not have been a great fit at USC, but he was available. Instead, he ended up at Washington after Sarkisian moved to USC. And last week, when the Huskies upset the Trojans, the coaching mismatch was glaring. It was the Trojans' second loss, and if it didn't mathematically eliminate them from any of their lofty goals, it realistically showed their obvious flaws.\nBefore that, there was the spectacle of Haden, during a 2014 game against Stanford, responding to a request from Sarkisian (conveyed by text message from another staff member) and leaving the press box for the sidelines, where he confronted officials over calls. The Pac-12 Conference fined Haden $25,000 and reprimanded him for \"inappropriate sideline conduct.\" To be clear: any in-game sideline conduct by an athletic director is inappropriate, and that's before adding Haden's status as a member of the College Football Playoff selection committee.\nAnd then, after Sark's antics just before the season, Haden came up with a \"private plan\" for Sarkisian that included counseling but did not include any time away from the job. Any doubt that it was absolutely the wrong course was removed Sunday, when according to reports, Sarkisian was not in any condition to conduct practice.\nJust like in 2013, when Haden fired Kiffin at midseason, the Trojans are now in disarray, with an interim head coach and an uncertain future, on the field and especially off.\nSarkisian is clearly struggling. But his athletic director did not help him — or the football program — when he allowed Sarkisian to continue coaching after the August incident.\n\"I've got lots of people who disagree with me,\" Haden said a few days later. \"That's OK. Leaders have to make decisions. Sometimes they're popular. Sometimes they're not.\"\nAnd sometimes, bad decisions add up — and require someone else to make another tough decision.\nGo to MSN Home", "external_links": ["http://www.usatoday.com/sports/", "http://www.usatoday.com/story/sports/ncaaf/2015/10/12/usc-fires-steve-sarkisian-football-coach-pat-haden/73834102/", "http://go.microsoft.com/fwlink/?LinkID=286759"], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T18:54:16.614+03:00", "highlightTitle": ""}