{"organizations": [], "uuid": "d062c7d8b2cdbe507f68764c307729d5f5288e98", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nydailynews.com", "main_image": "http://assets.nydailynews.com/polopoly_fs/1.2407221!/img/httpImage/image.jpg_gen/derivatives/landscape_1200/mta23n-1-web.jpg", "site_section": "http://www.nydailynews.com/news/index.html", "section_title": "Breaking, Local and National News, Sports &amp; Entertainment - NY Daily News", "url": "http://www.nydailynews.com/new-york/mta-announces-plans-increase-service-12-subway-lines-article-1.2407222", "country": "US", "title": "MTA announces plans to increase service on 12 subway lines", "performance_score": 0, "site": "nydailynews.com", "participants_count": 1, "title_full": "MTA announces plans to increase service on 12 subway lines - NY Daily News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "d062c7d8b2cdbe507f68764c307729d5f5288e98"}, "author": "NEW YORK DAILY NEWS", "url": "http://www.nydailynews.com/new-york/mta-announces-plans-increase-service-12-subway-lines-article-1.2407222", "ord_in_thread": 0, "title": "MTA announces plans to increase service on 12 subway lines", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Susan Watts/New York Daily News This crowded 4/5/6 subway platform at Union Square may be a thing of the past. The MTA announced plans Thursday to increase service on 12 subway lines. More trains are on the way for New York City subway commuters — but not until next summer.\nThe Metropolitan Transportation Authority announced plans Thursday to increase service on 12 subway lines.\nThe biggest bump will come on weekends for the shuttle service on 42nd St., the agency said.\nAnother 31 additional round trips will be added to major lines on weekends — including the cramped C line, which will have three more trains running on Sundays.\nThe changes reflect the subway system’s surging ridership, which the MTA has struggled to accommodate.\nThe city’s subways moved an average of 5.6 million daily customers in 2014, and 2015 subway ridership is on track to exceed that record.\nThe service changes will go into effect in June 2016.\nThe number of weeknight round trips on the 42nd St. shuttle will double to 24 between 9:30 p.m. and 11:30 p.m., bringing down the average time between trains to five minutes during that time period.\nThe extra service accommodates customers who traverse the two busiest subway stations in the system, Times Sq-42 St. and Grand Central-42 St., which also serve as major transfer points for Metro-North and 13 subway lines.\nOther major lines that will be increasing service include the Seventh Ave. 12 lines, with a total of five additional round trips during peak and evening hours; the Eighth Ave. ACE lines, with three additional round trips during midday and evening hours and three more round trips on Sunday mornings; the JMZ lines, with a total of three additional weekday round trips; and the system's busiest route: the Lexington Avenue 456 lines, with seven additional weekday evening round trips.\nThe city’s antiquated system makes it difficult for the MTA to add extra trains, due to limitations on car and track capacity during peak hours.\nAlso, the need to perform ongoing maintenance and capital construction work during off-peak hours limits expansion.\n“People want to live or work in places that are readily accessible by mass transit, and New York City Transit must take new real estate trends into account to help these areas thrive,” said James Ferrara, interim president of NYC Transit.\n“However, our subway system is more than a century old and even where we are aided by new technology, we are still limited by the overall age and condition of the system and the maintenance that is needed to run trains safely,” he noted.\nThe cost for the implementation of these changes is $5.8 million annually and has been included in the 2016 operating budget, the agency said.", "external_links": [], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-22T20:05:04.781+03:00", "highlightTitle": ""}