{"organizations": [], "uuid": "7563de6a852e5c2a765609dd9bd796573d69ebd4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/nhl", "section_title": "NHL News, Scores, Schedule, Standings, Stats, Photos, Videos - Ice Hockey - MSN Sports", "url": "http://www.msn.com/en-us/sports/nhl/bouwmeester-gives-back-by-donating-scholarships-to-hometown-university/ar-AAfhgmK", "country": "US", "title": "Bouwmeester gives back by donating scholarships to hometown university", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "Bouwmeester gives back by donating scholarships to hometown university", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "7563de6a852e5c2a765609dd9bd796573d69ebd4"}, "author": "Quaid taken into custody in Vermont trying to cross border", "url": "http://www.msn.com/en-us/sports/nhl/bouwmeester-gives-back-by-donating-scholarships-to-hometown-university/ar-AAfhgmK", "ord_in_thread": 0, "title": "Bouwmeester gives back by donating scholarships to hometown university", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bouwmeester gives back by donating scholarships to hometown university FOXSports 1 day ago © Jasen Vinlove-USA TODAY Sports Oct 8, 2015; St. Louis, MO, USA; St. Louis Blues defenseman Jay Bouwmeester (19) skates with the puck as Edmonton Oilers center Connor McDavid (97) defends during the first period at Scottrade Center. Mandatory Credit: Jasen Vinlove-USA TODAY Sports When Jay Bouwmeester was a child, he said he did not dream of playing in the NHL. Instead, the Edmonton native dreamt of playing hockey for the University of Alberta. Bouwmeester's parents and sister all went to school there, but Bouwmeester has yet to realize that dream. His hockey talent helped him bypass college while he played in Canadian juniors instead. Once his NHL career began, Bouwmeester put his dreams of playing for the Golden Bears to rest.\nAdChoices But just because Bouwmeester never attended the U of A, it does not mean he has not gotten involved in the community. Two years ago, Bouwmeester set up two scholarships for prospective students -- one for men and one for women -- who wish to play hockey at the U of A. Each scholarship awards recipients with up to $5,000 toward their university fees.\n\"It’s in my parents names,\" Bouwmeester told reporters of the scholarships . \"It’s more for them. It’s something that’s close to their hearts.\n\"When I was a kid, I hung out there. Before the games on Friday night, they used to have ice and all the old guys would go and skate so I’d go out with my dad when I was real small.\"\nBouwmeester is now one of the big guys at the rink. The 32-year-old has an Olympic gold medal to his name and is a vital part of the St. Louis defense. Bouwmeester earned the third-most ice time of any Blues player in the team's first game Thursday night, a 3-1 win over Edmonton. He tallied one assist in 21:08 minutes on the ice.\n(h/t Edmonton Sun )\nMORE NEWS: Want stories delivered to you? Sign up for our NHL newsletters. Go to MSN Home", "external_links": ["http://www.foxsports.com/other/daily-newslettersignup?intcmp=fscom-newsletter_nhlstory", "http://www.foxsports.com/", "http://go.microsoft.com/fwlink/?LinkID=286759", "http://www.edmontonsun.com/2015/10/08/childhood-friends-fabbri-mcdavid-connect-brodziak-niche-happy-bouwmeesters-scholarships"], "published": "2015-10-10T03:00:00.000+03:00", "crawled": "2015-10-11T04:07:39.733+03:00", "highlightTitle": ""}