{"organizations": [], "uuid": "b4a08e675225f355aac757876662da1c21a527e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deseretnews.com", "main_image": "http://img.deseretnews.com/images/article/hires/1615722/1615722.jpg", "site_section": "http://www.deseretnews.com/sports/index.rss", "section_title": "Sports News | Deseret News", "url": "http://www.deseretnews.com/article/865639832/BYU-football-cruises-to-70-6-victory-over-winless-Wagner.html", "country": "US", "title": "BYU football cruises to 70-6 victory over winless Wagner", "performance_score": 0, "site": "deseretnews.com", "participants_count": 9, "title_full": "BYU football cruises to 70-6 victory over winless Wagner | Deseret News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T02:00:00.000+02:00", "replies_count": 8, "uuid": "b4a08e675225f355aac757876662da1c21a527e2"}, "author": "Jeff Call", "url": "http://www.deseretnews.com/article/865639832/BYU-football-cruises-to-70-6-victory-over-winless-Wagner.html", "ord_in_thread": 0, "title": "BYU football cruises to 70-6 victory over winless Wagner", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BYU had no problems in the first half against the outmanned Wagner Seahawks and lead 49-0 at halftime Saturday at LaVell Edwards Stadium. The Cougars rolled up 456 total yards and held Wagner to only 37.\nScoreboard BYU WAGNER 0 0 Full box score/Player stats Upcoming Games BYU Football BYU BYU @ SJ State Spartan Stadium, San Jose Nov. 6, 9:30 p.m. 13 Days 3 Hrs 26 Mins 25 Secs More Coverage BYU makes the most of scheduled win over outmanned Wagner in 70-6 blowout Wagner coach John Houghtaling said the experience, as a whole, was, \"tremendous for everybody\", save the \"last 60 minutes on the field\"\n— Brandon Gurney (@BrandonCGurney) October 24, 2015 PROVO — Having mastered the art of the fourth-quarter comeback this season, BYU tried something new Saturday afternoon.\nThe Cougars wanted to shake off the slow starts that’s plagued them and get off to a fast start for a change. With the exception of the loss to Michigan, all of their games had been decided in the fourth quarter.\nAs expected, it was a much different story against FCS opponent Wagner — as this game was over early in the first quarter. BYU sprinted to a 28-0 lead at the end of the first period.\nIn the end, the Cougars overwhelmed the Seahawks, 70-6, before an announced crowd of 56,015 at LaVell Edwards Stadium.\n“That was one of the focuses that we had going into this game,” coach Bronco Mendenhall said of the strong start. “Mindset-wise, we chose to take the ball first (on the opening kickoff). There was a few things we wanted to focus on and starting fast offensively was one of those. That was certainly accomplished.”\nIt marked BYU's first 70-point game, and first 700-yard total offense performance (741 yards), since the 2001 season-opener against Tulane. It was the fourth-highest single-game total offense outing in school history.\nThe Cougars (6-2) scored their first touchdown 93 seconds into the game against Wagner (0-7) and scored TDs on its first seven possessions to go up 28-0 at the end of the first quarter and 49-0 at halftime.\nTalk about fast — in terms of time, BYU’s first six TD drives took 1:13, :46, 1:03, 2:34, 1:53 and 1:28, respectively.\nWhen the Cougars went up 21-0 with 7:52 left in the first quarter, the Cougars were averaging 17.2 yards per play, compared to .8 yards per play for Wagner.\nThe Seahawks went three-and-out on their first three possessions and didn’t get their first first down until late in the first quarter.\nQuarterback Tanner Mangum, who played six series, completed 12 of 13 passes for 237 yards and three touchdowns. Backup Beau Hoge was 8 of 11 for 117 yards and a touchdown and he ran 12 times for 49 yards. And Koy Detmer, Jr. made his BYU debut.\nRunning back Algernon Brown rushed six times for 109 yards and two TDs before suffering a cut on his shin after a 37-yard touchdown run in the first quarter. Francis Bernard gained 54 yards on nine carries and a TD.\nMitch Mathews caught three passes for 44 yards and two touchdowns and Terenn Houk caught two passes for 65 yards.\nAt halftime, BYU had rolled up 457 yards of total offense compared to 37 yards for Wagner. The Cougars had converted on 5 of 5 third-down situations and the Seahawks were 1 of 8.\nMidway through the second quarter, BYU coaches sent in all of its backups to play the rest of the game.\n“The team handled this game as ideally as much as we could,” Mendenhall said. “Both backup quarterbacks got some work and about everyone that we wanted to play we did play.”\nWagner got on the scoreboard with 6:52 left in the third quarter on a 15-play, 70-yard drive that took 8:08 off the clock to open the third quarter, and BYU fans cheered for the visiting team. But alas, the PAT was blocked.\n“We wanted to start strong, whether the first quarter or the third quarter, not letting our foot off the gas pedal and just keep executing,” said linebacker Manoa Pikula. “After that touchdown, we got back on track.”\nBYU finished with 411 yards passing and 330 rushing, and the Cougars didn’t punt once. Wagner ended up with 129 yards of total offense.\n“This whole week the biggest challenge was coming out and treating them like any other team,” Pikula said. “I thought we responded really good to that. The first half was perfect — well, not perfect, but we played really good.”\nBYU has a bye next week before visiting San Jose State on Nov. 6.\nEMAIL: jeffc@deseretnews.com", "external_links": ["http://deseretnews.sportsdirectinc.com/football/ncaaf-teams.aspx?page=/data/ncaaf/teams/team33.html", "http://deseretnews.sportsdirectinc.com/football/ncaaf-players.aspx?page=/data/ncaaf/players/player46007.html", "http://deseretnews.sportsdirectinc.com/football/ncaaf-boxscores.aspx?page=/data/ncaaf/results/2015-2016/boxscore48711.html", "https://twitter.com/BrandonCGurney/status/658050512592334848"], "published": "2015-10-25T02:00:00.000+02:00", "crawled": "2015-10-25T02:05:23.632+02:00", "highlightTitle": ""}