{"organizations": [], "uuid": "29498f2320921375f6e962032ab7cee353e784dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.uniondemocrat.com", "main_image": "", "site_section": "http://www.uniondemocrat.com/index2.php?option=com_marketplace&page=rss&Itemid=204", "section_title": "All Classifieds | Sonora / Tuolumne News, Sports, &amp; Weather, Angels Camp, Twain Harte, Jamestown | Union Democrat", "url": "http://www.uniondemocrat.com/index.php?option=com_marketplace&page=show_ad&catid=1768&adid=731&Itemid=204", "country": "US", "title": "T.S. No. 0125001554 Loan No. 77873908 APN: 024-112-08", "performance_score": 0, "site": "uniondemocrat.com", "participants_count": 0, "title_full": "T.S. No. 0125001554 Loan No. 77873908 APN: 024-112-08", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T10:00:00.000+03:00", "replies_count": 0, "uuid": "29498f2320921375f6e962032ab7cee353e784dd"}, "author": "", "url": "http://www.uniondemocrat.com/index.php?option=com_marketplace&page=show_ad&catid=1768&adid=731&Itemid=204", "ord_in_thread": 0, "title": "T.S. No. 0125001554 Loan No. 77873908 APN: 024-112-08", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "T.S. No. 0125001554 Loan No. 77873908 APN: 024-112-08 ad date: 10/09/2015 \nT.S. No. 0125001554 Loan No. 77873908 APN: 024-112-08 NOTICE OF TRUSTEES SALE YOU ARE IN DEFAULT UNDER A DEED OF TRUST DATED 8/19/2008. UNLESS YOU TAKE ACTION TO PROTECT YOUR PROPERTY, IT MAY BE SOLD AT A PUBLIC SALE. IF YOU NEED AN EXPLANATION OF THE NATURE OF THE PROCEEDING AGAINST YOU, YOU SHOULD CONTACT A LAWYER. On 10/30/2015 at 3:30 PM At the main entrance to the Tuolumne Administration Center, 2 South Green Street, Sonora, California 95370, Old Republic Title Company, as the duly appointed Trustee under the Deed of Trust recorded on 8/28/2008, as Instrument No. 2008011552, of Official Records in the office of the Recorder of Tuolumne County, California, executed by: Alan Scott Cole and Christine Lavina Cole, Husband and Wife as Joint Tenants, as Trustor, Mechanics Bank, as Lender/Beneficiary, WILL SELL AT PUBLIC AUCTION TO THE HIGHEST BIDDER FOR (payable at time of sale in lawful money of the United States by cashiers check drawn on a state or national bank, check drawn by a state or federal credit union, or a check drawn by a State or federal savings and loan association, or savings association, or savings bank specified in Section 5102 of the Financial Code and authorized to do business in the state) all right, title and interest conveyed to and now held by it under said Deed of Trust in the property situated in said County, California, describing the land therein: As more fully described on said Deed of Trust. The street address or other common designation, if any, of the real property described above is purported to be: 28620 Herring Creek Lane Strawberry, CA 95375 The undersigned Trustee disclaims any liability for any incorrectness of the street address and other common designation, if any, shown herein. Said sale will be made is an \"AS IS\" condition, but without covenant or warranty, expressed or implied, regarding title, possession, or encumbrances, to pay the remaining principal sum of the note(s), advances, if any, under the terms of the Deed of Trust, estimated fees, charges and expenses of the Trustee and of the trusts created by the Deed of Trust, to wit: $522,555.64 (Estimated). Accrued interest and additional advances, if any, will increase this figure prior to sale. It is possible that at the time of sale the opening bid may be less than the total indebtedness due. NOTICE TO POTENTIAL BIDDERS: If you are considering bidding on this property lien, you should understand that there are risks involved in bidding at a trustee auction. You will be bidding on a lien, not on the property itself. Placing the highest bid at a trustee auction does not automatically entitle you to free and clear ownership of the property. You should also be aware that the lien being auctioned off may be a junior lien. If you are the highest bidder at the auction, you are or may be responsible for paying off all liens senior to the lien being auctioned off, before you can receive clear title to the property. You are encouraged to investigate the existence, priority, and size of outstanding liens that may exist on this property by contacting the county recorders office or a title insurance company, either of which may charge you a fee for this information. If you consult either of these resources, you should be aware that the same lender may hold more than one mortgage or deed of trust on the property. NOTICE TO PROPERTY OWNER: The sale date shown on this notice of sale may be postponed one or more times by the mortgagee, beneficiary, trustee, or a court, pursuant to Section 2924g of the California Civil Code. The law requires that information about trustee sale postponements be made available to you and to the public, as a courtesy to those not present at the sale. If you wish to learn whether your sale date has been postponed, and, if applicable, the rescheduled time and date for the sale of this property, you may call 888-988-6736 or visit this Internet Web site www.salestrack.tdsf.com, using the file number assigned to this case 0125001554. Information about postponements that are very short in duration or that occur close in time to the scheduled sale may not immediately be reflected in the telephone information or on the Internet Web site. The best way to verify postponement information is to attend the scheduled sale. This property which is subject to this Notice of Sale does not fall within the purview of California Civil Code Section 2923.5. Date: 10/6/2015 Old Republic Title Company, as Trustee 1000 Burnett Avenue, Suite #400 Concord, California 94520 (866) 248-9598 by: Debbie Jackson, Vice President TAC: 979767 Publication Dates: October 9, 16, 23, 2015 The Union Democrat, Sonora, CA 95370", "external_links": [], "published": "2015-10-09T10:00:00.000+03:00", "crawled": "2015-10-09T13:50:55.585+03:00", "highlightTitle": ""}