{"organizations": [], "uuid": "a36a0d3e3e329c31c5121a448ad4c274e68902e0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bleacherreport.com", "main_image": "http://img.bleacherreport.net/img/images/photos/003/532/252/hi-res-e719b4306beba4ef516d41c264614d8a_crop_exact.jpg?w=1500&h=1500&q=85", "site_section": "http://news.google.com/news?pz=1&cf=all&ned=us&hl=en&topic=s&output=rss", "section_title": "Sports - Google News", "url": "http://bleacherreport.com/articles/2577727-mets-vs-dodgers-keys-for-each-team-to-win-nlds-game-2", "country": "IL", "title": "Mets vs. Dodgers: Keys for Each Team to Win NLDS Game 2 - Bleacher Report", "performance_score": 0, "site": "bleacherreport.com", "participants_count": 0, "title_full": "Mets vs. Dodgers: Keys for Each Team to Win NLDS Game 2 - Bleacher Report", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T15:56:00.000+03:00", "replies_count": 0, "uuid": "a36a0d3e3e329c31c5121a448ad4c274e68902e0"}, "author": "", "url": "http://bleacherreport.com/articles/2577727-mets-vs-dodgers-keys-for-each-team-to-win-nlds-game-2", "ord_in_thread": 0, "title": "Mets vs. Dodgers: Keys for Each Team to Win NLDS Game 2 - Bleacher Report", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments The first one was absolutely marvelous and historic. \nThe pitching duel between New York Mets ace Jacob deGrom and Los Angeles Dodgers counterpart Clayton Kershaw is why pitchers get top billing in Game 1s. For the first time in postseason history, each starter struck out at least 11 hitters , but it was the Mets’ offense that broke through and took the National League Division Series lead with a 3-1 win Friday night at Dodger Stadium. \nThat puts the Dodgers into a corner for Saturday night’s Game 2 having already lost home-field advantage and in danger of dropping the first two games of a best-of-five series. \nThe positive for the Dodgers is Zack Greinke , one of the frontrunners for the league’s Cy Young Award, starts. The positive for the Mets: They have already dispatched of one of Los Angeles’ aces before stepping foot back in New York. \nThe second game is clearly more critical for the Dodgers now, but each team still has holes to fill and the Mets are not in the business of giving away a playoff game on the road just because they are one up. The keys for winning Game 2 are things that could make or break it for either club. \nAdrian Gonzalez, Rest of Dodgers Must Capitalize On Chances Lenny Ignelzi/Associated Press \nOpportunities arose, that much is certain. The Dodgers did not take advantage of them, another certainty. \nFor as dominant as deGrom was in Game 1, the Dodgers did manage six base runners against him in his seven innings of work. Their problem was they could not get the timely, high-leverage hit that postseason wins, or any win, requires. \nNot until the eighth inning did the Dodgers get a hit with a runner in scoring position, and for the game they were a miserable 2-for-12 with runners on base. They finished 1-for-8 with runners in scoring position and stranded seven runners. \nGonzalez, who drove in that eighth-inning run and hit .188 in last year’s NLDS, stranded two and struck out three times. Corey Seager and Andre Ethier also left two on base. Kershaw stranded four, but as a pitcher that’s somewhat expected and griping about it is pointless. Your browser does not support iframes. Tweet \nThe Dodgers finished the regular season as one of the best offensive teams in the majors, but they looked nothing like that Friday. And while deGrom had plenty, or everything, to do with that, the Dodgers’ numbers with men on base were inexcusable since they’ll typically equate to losing. \nThey will likely have chances to find timely hits against New York’s Game 2 starter Noah Syndergaard, but if they do what they did in Game 1, this series can become lopsided before it heads east. \nYoenis Cespedes Needs A Breakout Performance Richard Mackson-USA TODAY Sports \nThings might seem understandably rosy for the Mets after beating Kershaw and winning Game 1 on the road, but a major part of the reason the Mets have their current expectations are because of the second-half exploits of Cespedes, the man who garnered MVP consideration before he played even 35 games in the league this year. \nFor as absurd as that argument was, it gained traction as the Mets motored toward the NL East title. But the correction eventually came, and Cespedes finished the regular season hitting .219/.282/.406 with 17 strikeouts in his last 71 plate appearances. \nThe trend continued Friday as he went 0-for-4 with three strikeouts and stranded four runners. \nAssuming Greinke is his usual dominant self in Game 2, the Mets will need Cespedes’ bat to show a sign of life if they are going to have a good chance at sweeping at Chavez Ravine. \nGreinke’s Brilliance, Syndergaard’s Surge Continued Danny Moloshok/Associated Press \nThe first game of this series was such a pitching duel that the Mets’ three runs seemed like a barrage of offense. With Greinke and Syndergaard going Saturday, there could be a similar feeling in Game 2. \nGreinke led the majors with a 1.66 ERA, and he has yet to allow more than two runs in his four postseason starts with the Dodgers, giving him a 1.93 ERA in his 28 innings. \nSyndergaard has had some bumps this season, including one recently, but over his final four starts of the season he had a 2.93 ERA (nine earned runs in 27.2 innings). One of those turns, against the New York Yankees, ended in five earned runs allowed over six innings, but he allowed no more than two in the other three. Your browser does not support iframes. Tweet \nHe had a 4.23 ERA on the road this season, but two of those final four starts were on the road and he allowed three runs in 14.2 innings. \n“To me it's just all about getting comfortable out there on the mound, on the road,” Syndergaard told reporters at his press conference Friday. “I feel like the last couple starts I had on the road I had a lot of success, a lot of comforts. The big thing for me was being able to execute my pitches and become more of a pitcher, not a thrower. And I feel like that's going to play a huge role [in Game 2].” \nFor their clubs to have a realistic chance to win Saturday night, both starters will have to continue their recent dominance. \n\nAll quotes, unless otherwise specified, have been acquired first-hand by Anthony Witrado. Follow Anthony on Twitter @awitrado and talk baseball here .", "external_links": [], "published": "2015-10-10T15:56:00.000+03:00", "crawled": "2015-10-10T16:42:29.549+03:00", "highlightTitle": ""}