{"organizations": [], "uuid": "fdd9c443cdeecf5c6da5257e904b9ece41a920a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.completesportsnigeria.com", "main_image": "http://www.completesportsnigeria.com/wp-content/uploads/2015/10/IMG_20151004_210315.jpg", "site_section": "http://www.completesportsnigeria.com/?feed=rss2", "section_title": "Complete Sports Nigeria", "url": "http://www.completesportsnigeria.com/ideye-chrisantus-open-goal-accounts-musa-dauda-on-target/", "country": "US", "title": "Ideye, Chrisantus Open Goal Accounts; Musa, Dauda On Target", "performance_score": 0, "site": "completesportsnigeria.com", "participants_count": 1, "title_full": "Ideye, Chrisantus Open Goal Accounts; Musa, Dauda On Target", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T00:35:00.000+03:00", "replies_count": 0, "uuid": "fdd9c443cdeecf5c6da5257e904b9ece41a920a3"}, "author": "Nurudeen Obalola", "url": "http://www.completesportsnigeria.com/ideye-chrisantus-open-goal-accounts-musa-dauda-on-target/", "ord_in_thread": 0, "title": "Ideye, Chrisantus Open Goal Accounts; Musa, Dauda On Target", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Eagles Euro Roundup / Ideye, Chrisantus Open Goal Accounts; Musa, Dauda On Target Ideye, Chrisantus Open Goal Accounts; Musa, Dauda On Target \n—Ekong, Oboabona, Igboun In Action \nBy James Agberebi: \nNigerian striker, Brown Ideye, opened his goal account on Sunday for Olympiacos in their 2-0 away win against PAOK Thessaloniki in the Greek Super League. Ideye scored in the 27th minute to put his side 1-0 ahead. He was later replaced by Alfred Finnbogason on 68 minutes. Olympiacos’ second goal was scored by Luka Milivojevic. Still in Greece, former junior international Macauley Chrisantus was the hero for AEK Athens, as he scored his first goal in their 1-0 win against Atromitos. Chrisantus scored three minutes after coming on for Ronald Vargas in the 79th minute. In Russia, Ahmed Musa continued his goal scoring form for CSKA Moscow as his 77th minute strike sealed a 2-0 win against Dinamo Moscow. The goal was Musa’s sixth in 11 appearances for CSKA this season. Pontus Wernbloom opened the scoring for CSKA in the 47th minute. Former Midjylland forward, Sylvester Igboun, was instrumental in UFA’s 1-1 draw against Krasnodar at home, as he provided the assist for their first goal scored by Semyon Fomin. Igboun has scored two goals in nine outings for UFA. In Norway, Eagles defender, William Troost-Ekong, was in action for Haugesund but couldn’t prevent them from losing 2-1 at home to Odd. Troost-Ekong was in action for 90 minutes. Odd did not parade their Nigerian forward, Chukwuma Akabueze. Godfrey Oboabona was in action in the Turkish league and featured for 90 minutes for Rizespor but still went down with them in their 3-2 home loss to Bursaspor. \nFormer Flying Eagles player, Michael Olaitan, featured for FC Twente in their 3-1 loss to AZ Alkmaar in their Eredivisie clash. Olaitan later made way for Thomas Agyepong in the 76th minute. MeanWhile, Chinedu Ede featured for 90 minutes. Nigerian striker, Abiola Dauda, was on target for Vitesse as they thrashed Groningen 5-0. Dauda was introduced for Chelsea on-loan player, Dominic Solanke, who was also on target. \nIn Serie A, Ogenyi Onazi was overlooked for selection for Lazio as they beat Frosinone 2-0. Onazi has only seen action just once for Lazio this current campaign. Super Eagles winger, Moses Simon, was on for 90 minutes in Belgium, as Gent defeated Club Brugge 4-1. It was Simon’s 10th game of the season but he is yet to score. One-cap Super Eagles forward, Imoh Ezekiel, was replaced by Matias Suarez in the 65th minute, as Anderlecht played out a 1-1 draw against Mechelen. Also in the Belgian league, Nigerian player, Wilfred Ndidi, was on for 82 minutes in Genk’s 3-1 win against Standard Liege. Ndidi was replaced by Byram Heynen.", "external_links": [], "published": "2015-10-05T00:35:00.000+03:00", "crawled": "2015-10-05T01:14:48.757+03:00", "highlightTitle": ""}