{"organizations": [], "uuid": "e3fbc8aae5017ea4bfe505ac005f751663985481", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ocregister.com", "main_image": "http://images.onset.freedom.com/ocregister/gallery/nwlujz-b88546780z.120151021214308000ghccnmpi.10.jpg", "site_section": "http://ocregister.com//common/rss/rss.php?catID=18901", "section_title": "The Orange County Register - News Headlines : Sports", "url": "http://www.ocregister.com/articles/rivers-688661-good-clippers.html", "country": "US", "title": "Doc Rivers hopes public practice helps switch allegiances to Clippers", "performance_score": 0, "site": "ocregister.com", "participants_count": 0, "title_full": "Doc Rivers hopes public practice helps switch allegiances to Clippers - The Orange County Register", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "e3fbc8aae5017ea4bfe505ac005f751663985481"}, "author": "", "url": "http://www.ocregister.com/articles/rivers-688661-good-clippers.html", "ord_in_thread": 0, "title": "Doc Rivers hopes public practice helps switch allegiances to Clippers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES – Minutes after Clippers coach Doc Rivers warmly welcomed the red-clad fans to USC’s Galen Center on Wednesday for a rare public practice, DeAndre Jordan spotted one spectator wearing an all-too-familiar purple-and-gold jersey.\n“Get your (rear) out of here,” Jordan repeatedly told the fan. The Clippers center presumably was joking.\nThe fan didn’t budge, though, and he and roughly 2,500 other spectators watched the Clippers go through 75 minutes of shooting drills, a five-on-five scrimmage and even a mini-dunk contest as they prepared for their final preseason game Thursday against Portland at Staples Center.\nLos Angeles might not be Clippers Nation yet, but Rivers said bringing the public practice to USC’s arena gives fans the chance to get to know the team better, interact with them and possibly even switch allegiances.\n“Any time the fans can see them out of their norm, which means on the floor playing, it’s good,” Rivers said. “So these things are good.”\nThe light practice also gave the Clippers the opportunity to shake off Tuesday’s technical-filled physical game against the Golden State Warriors. Referees handed out a combined eight technical fouls.\n“The last thing they probably wanted in an exhibition was any stuff,” Rivers said. “So they probably did call it closer than usual. I don’t know if they did or they didn’t. I didn’t talk to them.”\nFouls and chippiness aside, Rivers said he was pleased with his team’s performance in the 130-95 victory.\n“Our basketball was good and that’s what you want to see,” Rivers said. “The other stuff is the other stuff and I don’t like it. We need to get better. … But overall, just the way we played – defense in the first half, the way we played offense – I thought that was a good show for us.”\nRivers said the mental part of the game is what he believes the Clippers need to work on as the regular season nears. The Clippers open Wednesday at Dallas.\n“That part, I think we have to get better, especially when you have a lead,” Rivers said. “The only thing that can go wrong from that point on when you have a lead like that is your composure and if you lose that, then they (opponents) have a chance.\n“But the way you were playing, the basketball part wasn’t working. So in games like that, teams are going to try other stuff to see if that will get you going. One of the things we talk about all the time is taking a hit, taking the voice and walking away and not responding. That’s the toughest. It was preseason, but it was good; it was good to go through.”\nDEFENSE SHINES \nRivers said he was impressed with the Clippers’ defensive effort, especially from the new players. The Warriors turned over the ball 23 times.\n“Wes (Johnson) came in and since he’s been with us, we’ve been working on something with him, and he did it the first time and got a steal and you could see the whole bench jumping up,” Rivers said.\n“Now you’ve got to do it again and again and again. It’s good, though. I think we have a chance to be a really good defensive team.”\nMVP TALK \nTV analyst and former NBA coach Jeff Van Gundy said earlier this week that Blake Griffin should be considered for Most Valuable Player honors this season. Rivers didn’t disagree.\n“Well, I think Jeff is brilliant. I hope he’s right. I think he’s right. … I think just winning and getting better will put you into that category and when you’re that talented and you’re winning, then you have to be thrown into that category.”\nContact the writer: jcarr@ocregister.com", "external_links": [], "published": "2015-10-21T03:00:00.000+03:00", "crawled": "2015-10-22T10:13:10.291+03:00", "highlightTitle": ""}