{"organizations": [], "uuid": "e4c3539b3be33883ef2a560371a72f9a380cbe78", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "accesswdun.com", "main_image": "http://images.accesswdun.com/uploads/articles/2015/343419/matt-kenseth-joey-logano-10-18_p3.jpg", "site_section": "http://accesswdun.com/rss/3/rss.xml", "section_title": "AccessWDUN.com Sports", "url": "http://accesswdun.com/article/2015/10/343419/logano-turns-kenseth-wins-kansas-race-in-overtime", "country": "US", "title": "Logano turns Kenseth, wins Kansas race in overtime", "performance_score": 0, "site": "accesswdun.com", "participants_count": 1, "title_full": "Logano turns Kenseth, wins Kansas race in overtime", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:27:00.000+03:00", "replies_count": 0, "uuid": "e4c3539b3be33883ef2a560371a72f9a380cbe78"}, "author": "Reid Spencer-NASCAR Wire Service", "url": "http://accesswdun.com/article/2015/10/343419/logano-turns-kenseth-wins-kansas-race-in-overtime", "ord_in_thread": 0, "title": "Logano turns Kenseth, wins Kansas race in overtime", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Monday October 19th, 2015 10:01AM 8:37AM ( 1 hour ago ) News Alert Posted 7:27PM on Sunday 18th October 2015 ( 14 hours ago ) Logano turns Kenseth, wins Kansas race in overtime +1 By Reid Spencer-NASCAR Wire Service Matt Kenseth (20) spins after contact from Joey Logano (22) during Sunday's NASCAR Sprint Cup Series race at Kansas Speedway. Logano went on to score the victory, while Kenseth finished 14th. Photo: Todd Warshaw/Getty Images Related Articles \nKANSAS CITY, Kan. – Block me once, and I’ll cut you some slack. \nBlock me twice — and it’s “Gotcha.” \nThat, in essence, was the conversation on Joey Logano’s team radio after Logano spun race leader Matt Kenseth in turn 1 with less than five laps left in the Hollywood Casino 400 at Kansas Speedway. \nLogano went on to win the race after a green-white-checkered-flag restart that sent the race two laps past its scheduled distance of 267 laps. The driver of the No. 22 Team Penske Ford has monopolized the Contender Round of the Chase for the NASCAR Sprint Cup, having won back-to-back races at Charlotte and Kansas. \nThe victory was Logano’s second at the 1.5-mile track — the first coming in last year’s Chase — his fifth of the season and the 13th of his career. But it may have come at the expense of the title hopes of the driver who replaced him in the No. 20 Joe Gibbs Racing Toyota. \nHe finished .491 seconds ahead of runner-up Denny Hamlin, who held off Jimmie Johnson at the stripe to take the second spot. Johnson ran third, followed by Kasey Kahne and Kyle Busch. \nDesperately needing a victory to revive his chances to make the cut for the Chase’s Eliminator 8 Round, Kenseth had grabbed the lead from Jimmie Johnson after a restart on lap 248. Using all his skills to keep the faster car of Logano behind him, Kenseth blocked Logano on the frontstretch as the duo ran up on lapped cars near the start/finish line. \nKenseth moved up to block again as he entered turn 1, but a tap from Logano’s Ford sent the No. 20 Camry spinning. \nKenseth kept his car off the wall and finished 14th, but the result was far more costly than a mere 13 positions. After finishing 42nd at Charlotte a week earlier, Kenseth could have salvaged his season with a victory and a guaranteed entry into the Eliminator 8 Round. \nNow Kenseth, who is 35 points out of the final transfer position (eighth place) likely must win at Talladega to advance. \nUnderstandably upset by the outcome, Kenseth had a clear-cut view of the incident. \n“It was really cut and dry,” Kenseth said. “He (Logano) picked my rear tires off the ground and wrecked me, so there’s no debate about that one… He was a little bit tighter on that short run than I was, and I couldn’t get away from him. \n“All day we had him pretty good. I still thought I was going to be able to stay in front of him and saw those lapped cars coming and tried getting a couple runs off the top there and I was plenty clear, got up in front of him and he just decided to take us out.” \nTo Logano, it was merely a case of aggressive racing on the part of both drivers. As Logano pursued Kenseth during the decisive run, Logano was squeezed into the outside wall, scraping the right side of his car. \n“It was good, hard racing,” Logano said. “We were racing each other really hard, and I got in the fence twice on the straightaways. He raced me hard, and I raced him hard back. That’s the way I race. If I get raced like that, I’ll race the same way. \n“That’s how I’ve always been, and it will always be that way. I really couldn’t be more proud of this team. To be sitting in such a great position going into Talladega makes us feel really, really good.” \nAsked whether he thought turning Kenseth was a good move, Logano replied, “I didn’t think it was a good move when I hit the wall. I’m sure we’ll talk about it. I felt like, ‘Hey, I’ve got to race hard. I got in the fence twice,’ so I wasn’t going to put up with it.” \nKenseth said he had no plans to discuss the incident with Logano. \n“I’m really disappointed,” Kenseth said. “I’ve probably been one of his biggest supporters. It was an awkward thing, obviously, taking his ride, and I was excited for him when he started winning at Penske and when he got that ride and even found him today and congratulated him about racing against each other for a championship. \n“I was very disappointed that he would do that… Yeah, I was running the lane he wanted to run in, but, my goodness, isn’t this racing? Strategically, I don’t think it wasn’t the smartest move on his part. He’ll probably sleep good tonight — I hope he enjoys that one. It’s not what I would have done, but he had a decision to make and that’s the one he made.” \nLogano insisted he didn’t wreck Kenseth on purpose. \n“We were just going for the same piece of real estate,” Logano said. \nKenseth believed otherwise. Asked whether he thought the wreck was intentional, Kenseth asserted, “Absolutely — 100 percent.” \nWithout the magnitude of drama Kenseth experienced, Dale Earnhardt, Jr. also leaves Kansas in dire straits. A loose left rear tire forced Earnhardt to pit road for an unscheduled stop in lap 165. The No. 88 Chevrolet finished 21st, two laps down. \nCurrently 11th in the standings, 31 points behind eighth-place Martin Truex, Jr., Earnhardt, like Kenseth, enters next Sunday’s race at Talladega with a win-or-bust mentality. \nOther than Logano, none of the other Chase drivers will be able to relax next Sunday. Only 20 points separate second-place Hamlin from Ryan Newman in 10th — with seven spots in the Eliminator 8 Round still up for grabs. \nNASCAR Sprint Cup Series Kansas Speedway – Kansas City, KS Hollywood Casino 400 – Oct. 18, 2015 \n1. (14) Joey Logano, Ford, 269, $377023. 2. (5) Denny Hamlin, Toyota, 269, $239405. 3. (21) Jimmie Johnson, Chevrolet, 269, $219791. 4. (24) Kasey Kahne, Chevrolet, 269, $163655. 5. (3) Kyle Busch, Toyota, 269, $169746. 6. (9) Kurt Busch, Chevrolet, 269, $135595. 7. (8) Ryan Blaney(i), Ford, 269, $112170. 8. (2) Carl Edwards, Toyota, 269, $115670. 9. (1) Brad Keselowski, Ford, 269, $161611. 10. (6) Jeff Gordon, Chevrolet, 269, $153681. 11. (10) Ryan Newman, Chevrolet, 269, $141460. 12. (16) Brian Scott(i), Chevrolet, 269, $125283. 13. (18) Ricky Stenhouse, Jr., Ford, 269, $114125. 14. (11) Matt Kenseth, Toyota, 269, $152886. 15. (7) Martin Truex, Jr., Chevrolet, 269, $130395. 16. (4) Kevin Harvick, Chevrolet, 268, $157975. 17. (12) Greg Biffle, Ford, 268, $133683. 18. (19) Trevor Bayne, Ford, 268, $142525. 19. (13) Paul Menard, Chevrolet, 268, $109350. 20. (28) Jamie McMurray, Chevrolet, 268, $131036. 21. (15) Dale Earnhardt, Jr., Chevrolet, 267, $115545. 22. (29) Danica Patrick, Chevrolet, 267, $107245. 23. (38) Casey Mears, Chevrolet, 267, $122678. 24. (23) Aric Almirola, Ford, 267, $134756. 25. (22) David Ragan, Toyota, 266, $124334. 26. (30) Justin Allgaier, Chevrolet, 266, $118553. 27. (27) A.J. Allmendinger, Chevrolet, 265, $122153. 28. (31) Sam Hornish Jr., Ford, 265, $121440. 29. (20) Kyle Larson, Chevrolet, 265, $122703. 30. (34) Matt DiBenedetto #, Toyota, 265, $106992. 31. (32) Alex Bowman, Chevrolet, 264, $94245. 32. (35) Brett Moffitt #, Ford, 264, $93545. 33. (39) Cole Whitt, Ford, 264, $90845. 34. (37) Michael Annett, Chevrolet, 263, $90645. 35. (17) Tony Stewart, Chevrolet, 263, $117624. 36. (33) David Gilliland, Ford, 262, $98220. 37. (40) Jeb Burton #, Toyota, 260, $89953. 38. (42) Reed Sorenson, Ford, 258, $84528. 39. (43) Will Kimmel III, Ford, 255, $80465. 40. (26) Clint Bowyer, Toyota, Accident, 170, $110623. 41. (25) Austin Dillon, Chevrolet, Accident, 154, $109401. 42. (36) J.J. Yeley(i), Toyota, 144, $68465. 43. (41) Landon Cassill(i), Chevrolet, Engine, 127, $64965. \nAverage Speed of Race Winner: 135.732 mph. \nTime of Race: 2 Hrs, 58 Mins, 22 Secs. Margin of Victory: 0.491 Seconds. \nCaution Flags: 7 for 39 laps. \nLead Changes: 21 among 9 drivers. \nLap Leaders: B. Keselowski 1-28; K. Harvick 29-49; J. Logano 50-66; C. Mears 67-68; C. Edwards 69-71; M. Kenseth 72-109; J. Logano 110; M. Kenseth 111-155; J. Logano 156; M. Kenseth 157-177; J. Logano 178-185; M. Kenseth 186; J. Logano 187-194; M. Kenseth 195-213; J. Johnson 214; R. Blaney(i) 215-219; C. Edwards 220-222; P. Menard 223-229; M. Kenseth 230-243; J. Johnson 244-247; M. Kenseth 248-262; J. Logano 263-269. \nLeaders Summary (Driver, Times Lead, Laps Led): M. Kenseth 7 times for 153 laps; J. Logano 6 times for 42 laps; B. Keselowski 1 time for 28 laps; K. Harvick 1 time for 21 laps; P. Menard 1 time for 7 laps; C. Edwards 2 times for 6 laps; R. Blaney(i) 1 time for 5 laps; J. Johnson 2 times for 5 laps; C. Mears 1 time for 2 laps. \nTop 16 in Points: J. Logano – 3,095; D. Hamlin – 3,082; Kurt Busch – 3,077; C. Edwards – 3,076; K. Harvick – 3,071; J. Gordon – 3,071; B. Keselowski – 3,071; M. Truex Jr. – 3,070; Kyle Busch – 3,064; R. Newman – 3,062; D. Earnhardt Jr. – 3,039; M. Kenseth – 3,035; J. Mcmurray – 2,154; J. Johnson – 2,134; P. Menard – 2,109; C. Bowyer – 2,086. Associated Categories : Sports , NASCAR News, Sprint Cup Associated Tags : nascar, motorsports, Auto Racing, Stock Car, Asphalt, Sprint Cup Series, Motorsports Live On WDUN, Chase for the Sprint Cup © Copyright 2015 AccessWDUN.com", "external_links": [], "published": "2015-10-19T03:27:00.000+03:00", "crawled": "2015-10-19T17:03:58.860+03:00", "highlightTitle": ""}