{"organizations": [], "uuid": "8e4a757790234ccf725741b16b2413089c500db8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "savannahnow.com", "main_image": "http://savannahnow.com/sites/default/files/14803562_1.jpg", "site_section": "http://savannahnow.com/", "section_title": "savannahnow.com | Savannah Georgia's source for News, Entertainment, Sports, Weather, Classifieds, Jobs, Autos, Real Estate and St. Patricks Day", "url": "http://savannahnow.com/opinion/2015-10-25/1st-district-pick-johnson", "country": "US", "title": "1st District pick: Johnson", "performance_score": 0, "site": "savannahnow.com", "participants_count": 4, "title_full": "1st District pick: Johnson | savannahnow.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T13:59:00.000+02:00", "replies_count": 6, "uuid": "8e4a757790234ccf725741b16b2413089c500db8"}, "author": "DispatchDaemon", "url": "http://savannahnow.com/opinion/2015-10-25/1st-district-pick-johnson", "ord_in_thread": 0, "title": "1st District pick: Johnson", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photos Steve Bisson/Savannah Morning News\nVan Johnson\nR esident of Savannah’s 1st District, which includes much of the city’s eastside, must choose between a three-term incumbent and a hard-working newcomer when they make their pick at the ballot box in the city’s Nov. 3 elections.\nOur recommendation is to stick with incumbent Van Johnson, who is one of the most accessible and approachable members on City Council. Mr. Johnson, who works for Chatham County’s human resources department, also is a former county police officer who is familiar with the long list of public safety concerns and has rightly made improving public safety a big part of his campaign.\nMr. Johnson has supported efforts by Metro Police Chief Joseph Lumpkin to beef up his force, which is budgeted for 605 sworn officers, a number that may be insufficient given the number of tourists and other non-residents who are in the city each day. But more than any other alderman, Mr. Johnson has been looking beyond the police department for other ways to reduce the violent crime that is threatening to make parts of the city unlivable. For example, he has been a lone alderman in the wilderness calling for enforcement of the city’s curfew to keep young people off the street late at night. Likewise, he has been a chorus of one in calling for enforcement of the city’s parental responsibility ordinance to address the problem of negligent parents who fail to discipline their children and look elsewhere when they get in trouble.\nNeither the curfew nor the parental responsibility ordinance is popular among some segments in the city, including many who live in his district who doubt the rules would be fairly and uniformly enforced across racial and class lines. But a bigger worry is coming up with ways so that patrol officers aren’t forced to use their valuable time as babysitters and to find programs that are effective in teaching parenting skills and in turning around the lives of young men who lack positive male role models. Mr. Johnson doesn’t just talk the talk on efforts to reduce violence among young black male and men of color, he walks the walk. He was a primary driver of the local Youth Commissions at the city and county levels so that the next generation of Savannahians can be more engaged in civic life.\nContrary to what his challenger has claimed, Mr. Johnson has done a good job in getting capital improvement projects for the 1st District. Indeed, a Feb. 3 memo from City Manager Stephanie Cutter that lists funding allocations by aldermanic district for the city’s capital improvement program and SPLOST VI projects shows the 1st District on top with $16.9 million worth of spending.\nBut there’s more to an alderman’s job than bringing home the bacon. Other duties include standing up for what’s right, even if it is unpopular. Mr. Johnson was among several city leaders who convinced an angry mob to see reason after a white police officer fatally shot a young black suspect who was in police custody in a tense incident on Augusta Avenue last September. He was among those urging people to cool down and wait for all the facts to come out, unlike other elected officials, like County Commissioner Yusuf Shabazz and his wife, City Alderwoman Estella Shabazz, who were on the scene for other reasons. Johnson also rightly voted with the majority on Council to bounce Rochelle Small-Toney as city manager, which temporarily made him the target of a recall effort by a few loudmouths in the community.\nIt’s no secret that Mr. Johnson is positioning himself for a run for the mayor’s post in four years and winning a fourth term and then making the most of it are critical to his career plans. This is one time when ambition can be positively channeled to make City Council more productive and more in tune to what citizens want and the city desperately needs in terms of a drastic improvement in public safety, better leadership and improved competency.\nWe salute Ms. Bernetta Lanier for her commitment to improving Savannah and for giving voters a choice on election day. But we give the nod to Van Johnson and recommend his candidacy to 1st District voters.", "external_links": ["http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/14803562_1.jpg", "http://sav-cdn.com/sites/default/files/imagecache/superphoto/14803562_1.jpg", "http://sav-cdn.com/sites/all/themes/savannahnow/images/blank.gif"], "published": "2015-10-25T13:59:00.000+02:00", "crawled": "2015-10-26T13:55:48.593+02:00", "highlightTitle": ""}