{"organizations": [], "uuid": "31257eb20023c6b64b5c9ab4322c1c6b2c4564eb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "http://images.tribuneindia.com/cms/gall_content/2015/10/2015_10$largeimg02_Friday_2015_225744638.jpg", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/real-estate/will-lower-emis-beat-the-blues/140723.html", "country": "US", "title": "Will lower EMIs beat the blues?", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "Will lower EMIs beat the blues?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "31257eb20023c6b64b5c9ab4322c1c6b2c4564eb"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/real-estate/will-lower-emis-beat-the-blues/140723.html", "ord_in_thread": 0, "title": "Will lower EMIs beat the blues?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Geetu Vaid\nWith realty pundits almost writing off the chances of any spurt in sales during the forthcoming festive season, the RBI’s 50 bps repo rate cut announced earlier this week has created some ripples in the market. Though it will be too optimistic to talk about a turnaround and revival, there is no denying the fact that this move will prepare the pitch for things to improve somewhat. So, the end users who have been sitting along the fence waiting for the right moment can at least be sure of lower EMIs on their home loans even though the builder lobby is in no mood to relent on the price issue. With the latest interest revision, the RBI has cut repo rate by a total of 125 basis points this year to a four-year low that should act as a catalyst to revive sentiments in the real estate sector. Calling it the last cut of the year and a bold move Anuj Puri, Chairman & Country Head, JLL India, said, “With this huge cut, RBI has clearly abandoned its cautious baby-steps approach and assumed a bolder stance, obviously because the current economic fundamentals provide it with the room to do so. Given the magnitude of this step, I do not think any further rate cuts are likely in this financial year, especially since the RBI foresees a moderate growth in inflation rate in the interim months”. Industry mavens have termed this as a boon for affordable housing segment. “For the affordable housing sector, the outlook is nevertheless bright, since the RBI Governor has made provisions for lending to this sector to become less stringent and broader in scope”, adds Puri. According to Sanjay Dutt, MD, India, Cushman & Wakefield, “At a time when Indian cities are witnessing subdued housing sales, this correction in prime lending rates would help stimulate home buyers’ interest and spur home-buying decisions. Although demand from end-users may take a bit longer to transform to active buying, buyer inquiries may increase in the short-term in expectation of lenders passing on the benefits of reduced interest rates”. The RBI decision that has come amid stable inflation indicators, is good news for steady economic growth and is expected to bolster investment demand. The timing of the move may bring cheer for developers sitting on unsold stock. “This move goes to show that the economy at the macro level is becoming robust by the day. With festival season around the corner, we anticipate a change in market sentiment which will benefit home buyers and various stakeholders in real estate,” says Prateek Mittal, Executive Director, Sushma Buildtech. However, the actual impact of the announcement remains to be seen as not many banks have been following the rate cut cycle, the loss of which has been passed onto the customers. According to experts while banks with high liquidity can easily afford to decrease their lending rates without touching the deposit rates, those with lesser liquidity are first forced to decrease the deposit rate and then drop the lending rates. “Cheaper low value housing loans will also help in augmenting the affordable housing segment. However, it is important that the banks translate the rate cuts into lower lending rates so that consumers can leverage the true benefits of the announcement,” says Brotin Banerjee, CEO and MD, Tata Housing Development Company. Apart from the buyers, the developers’ lobby is also waiting for the home loan interest rates to drop. “We sincerely hope that both Finance Ministry and RBI will ask all the banks to transfer the benefits to the end consumer, else this move will severely stop short of benefiting the consumer and only help in buffering the bottom lines of the bank”, says Amit Modi, Director ABA Corp and Vice President CREDAI Western UP. Housing sector is also likely to get a leg up with lowering of minimum risk weight on individual housing loans from the current 50 per cent. With this the banks will be able to free more funds to lend for affordable housing. This means that banks will have to set aside less capital for affordable housing loans leading to availability of more funds for the segment. “With a view to improve affordability of low-cost housing for economically weaker sections and low income groups and giving a fillip to Housing for All, while being cognizant of prudential concerns, it is proposed to reduce the risk weights applicable to lower value but well collateralised individual housing loans,\" the RBI said. “RBI has proposed to lower risk weights on individual housing loans in the affordable segment (currently minimum risk weights in housing loans is 50%) to boost low cost housing. This will help in meeting govt’s target ‘Housing for all’ by 2022. Along with rate cuts, this means housing loan market should see a pick up in volumes”, says Rishi Mehra, Co-Founder, Deal4loans.com.", "external_links": [], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-03T00:25:37.550+03:00", "highlightTitle": ""}