{"organizations": ["Manchester City Late Kevin De Bruyne", "Manchester City"], "uuid": "88c9628bbc0253f3d13ad33125dc0a209e73cdc0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/d4b287a19bf04d52c69b1e1d0d828736.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/football/late-kevin-de-bruyne-strike-seals-dramatic-win-for-mancheste/6971365/", "country": "JE", "title": "Late Kevin De Bruyne strike seals dramatic win for Manchester City", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "Late Kevin De Bruyne strike seals dramatic win for Manchester City", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T00:16:00.000+03:00", "replies_count": 0, "uuid": "88c9628bbc0253f3d13ad33125dc0a209e73cdc0"}, "author": "", "url": "http://www.sport.co.uk/football/late-kevin-de-bruyne-strike-seals-dramatic-win-for-mancheste/6971365/", "ord_in_thread": 0, "title": "Late Kevin De Bruyne strike seals dramatic win for Manchester City", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kevin De Bruyne"], "text": "Late Kevin De Bruyne strike seals dramatic win for Manchester City 21 Oct 2015 21:16:57 \ncomments \nKevin De Bruyne struck an injury-time winner as Manchester City came from behind to claim a dramatic 2-1 win over Sevilla in the Champions League. \nCity had looked to be labouring to another unconvincing result in the competition, with only an Adil Rami own goal after Yevhen Konoplyanka's earlier strike saving them from possible defeat at the Etihad Stadium. \nBut as the game moved into four minutes of added time, De Bruyne raced on to a Yaya Toure through-ball and guided a shot into the bottom corner. \nThe goal transformed the mood at a hitherto subdued ground, with the even later introduction of Vincent Kompany off the bench further lifting fans. \nManuel Pellegrini's decision to leave Kompany on the bench for a second successive game was one of the night's major talking points. \nPellegrini has not started his captain since expressing frustration at his recent appearance for Belgium after a spell out injured. \nIt was a decision that looked likely to backfire as City continued to look vulnerable in his absence and were regularly cut open by the Spaniards on a drizzly evening. \nCity did create numerous chances but lacked the composure of the visitors, who also hit the woodwork through Konoplyanka. \nSome of City's better moments came early on and Jesus Navas, hoping to his mark against his home-town club, had the first opportunity of the night with a well-struck shot from distance. \nDe Bruyne then teed up Toure with a good ball into the box but the midfielder missed the ball and Bony's consequent effort lacked power. De Bruyne also shot across goal but, despite these chances, City spent most of the first half on the back foot. \nKonoplyanka was the obvious dangerman and he smashed a free-kick against the post before Joe Hart saved Grzegorz Krychowiak's follow-up strike. \nKonoplyanka saw another chance deflected wide and Krychowiak missed the target with a free header from one of several Sevilla corners. \nCity had to rely on counter-attacks and Navas might have done better with one opportunity in front of goal before Yaya Toure saw a shot deflected over. \nThe home defence was cut open time after time and it eventually caught up with them as Vitolo squared for Konoplyanka to fire home the opening goal after 30 minutes. \nCity did produce a good response and they levelled within six minutes. Toure drove to the byline and pulled the ball back across goal. Raheem Sterling's shot was saved but Bony reacted quickly to the rebound and the ball was deflected in off Rami. \nBut despite the leveller, City continued to look vulnerable with Vicente Iborra heading over a good chance before the break and Kevin Gameiro similarly wasting an even better chance after the restart. \nThe second half was more subdued than the first but Iborra sliced a volley wide and substitute Michael Krohn-Delhi also missed the target as Sevilla continued to carry the greater threat. \nCity's supporters were clearly anxious and it was Sevilla's who were the more vocal but the hosts roused themselves in the closing moments. \nToure forced a good save from Sergio Rico with 89 minutes on the clock and De Bruyne then had the final say. \nTWEET OF THE MATCH \nSuper Kev does it again! A wonderful goal from @DeBruyneKev surely wins the game for City!! 2-1! #cityvsfc #mcfc \n- The official Manchester City Twitter account on Kevin De Bruyne's later winner in the 2-1 victory over Sevilla. \nPLAYER RATINGS \nJoe Hart: 6 (out of 10) \nBacary Sagna: 5", "external_links": [], "published": "2015-10-22T00:16:00.000+03:00", "crawled": "2015-10-22T20:21:43.600+03:00", "highlightTitle": ""}