{"organizations": [], "uuid": "ba0478457a7bc7dd873d434e0ed5ed630552d487", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-561bbd16/turbine/ct-democratic-debate-questions-hillary-clinton-20151012", "site_section": "http://www.chicagotribune.com/", "section_title": "Chicago Tribune: Chicago breaking news, sports, business, entertainment, weather and traffic - Chicago Tribune", "url": "http://www.chicagotribune.com/news/opinion/commentary/ct-democratic-debate-questions-hillary-clinton-20151012-story.html", "country": "US", "title": "Here&apos;s what to ask Hillary Clinton at the first Democratic debate", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Here&apos;s what to ask Hillary Clinton at the first Democratic debate - Chicago Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T17:00:00.000+03:00", "replies_count": 0, "uuid": "ba0478457a7bc7dd873d434e0ed5ed630552d487"}, "author": "Jennifer Rubin", "url": "http://www.chicagotribune.com/news/opinion/commentary/ct-democratic-debate-questions-hillary-clinton-20151012-story.html", "ord_in_thread": 0, "title": "Here&apos;s what to ask Hillary Clinton at the first Democratic debate", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A Republican with as many flip-flops, conflicts of interest and scandals as Hillary Clinton would likely be out of the presidential race — or would never have run in the first place. At the very least the first debate would be a forum to grill that problematic candidate. I am dubious Clinton will receive anything approaching that treatment at the debate on Tuesday. We hope her opponents put her feet to the fire and CNN's Anderson Cooper formulates specific, probing questions that do not permit her to filibuster, but let's not count on it.\nLet's see how many of these questions are asked, and whether the moderator asks follow-up questions to pin her down:\n1. You said dozens of times the Trans-Pacific Partnership was the \"gold standard.\" Now you oppose it. Have you read the entire deal? Other than political expediency, why have you flip-flopped? Was NAFTA a mistake too?\n2. Job growth has slowed again. Do you think we need higher taxes and more regulation or less to create more jobs? What pro-growth measure do you support that does not entail more government spending?\n3. There is no evidence from government studies that the Keystone XL Pipeline is environmentally harmful. Why do you now oppose it? Do you oppose domestic natural gas and oil development?\n4. What evidence do you have that subsidizing \"green jobs\" is economically productive? Why, for example, should a taxpayer making $50, 000 a year subsidize a Tesla buyer? Was Solyndra a warning about the perils of government picking winners and losers?\n5. You have said the Russian reset was worth it. Do you still think so? What went wrong?\n6. Was the failure to act decisively and early to oust Syrian President Bashar al-Assad a grave foreign policy error? If we had, would the Islamic State have taken root? Would there be millions of refugees? Would there be a quarter million dead Syrians? Why did you not quit if you thought the policy was misguided?\n7. You applauded the administration when it brought in Russia to address Syria's chemical weapons and thereby avoided military action to uphold the red line. Was that a mistake? If so, do you bear some responsibility for the geopolitical and humanitarian disaster that followed?\n8. Given how many wars are going on in the Middle East, allies' open expressions of concern about our reliability, Russia's aggression in Syria and Ukraine, Iran's continued support for terror, China's territorial expansionism and the vast expansion of the Islamic State, how did your foreign policy work out? What went wrong? Which part are you responsible for?\n9. If jihadists have more recruits, more weapons, more territory and more confidence than they did at the start of the Obama administration, has the Obama anti-terror policy failed? What would you do differently?\n10. Is the FBI engaged in a partisan witch hunt or are there grounds to investigate how you and your advisers handled classified materials? If you are named an unindicted co-conspirator will you drop out of the race?\n11. Did you lie when you said there was no classified material on the server? Did you forward classified material to others who did not have the appropriate clearance?\n12. Did you put national security intelligence at risk for personal convenience?\n13. You have said that what you did was allowed. Who allowed it? Did you ask permission? Former secretaries of state Colin Powell and Madeleine Albright have said they would not permit such an e-mail set up. Do you agree it was harmful to national security?\n14. Did your emphasis on settlements impair the peace process and/or the relationship with Israel?\n15. Would you have allowed Iran to keep its nuclear infrastructure? Obtain 10-year sunset? Get relief from the ban on conventional weapons? Keep its ICBM program?\n16. Was it wise to set up a back channel to Iran and keep those talks secret from Israel?\n17. You have said we need to combat Iranian aggression in the region. Doesn't the Iran deal, including release of $150 billion to Iran, make Iran stronger in the region? If we earned only a pause in Iran's nuclear weapons program in exchange for measures which promote more violence in the region, as we see in Syria, would that be a failure or a success?\n18. Did you underestimate or ignore the rise and spread of al-Qaeda and the Islamic State? If not, what did you do to prevent their spread?\n19. You and your husband have collected hundreds of millions for yourselves or your foundation from rogue states, hedge funds and Russian oligarchs. Did they give that money to you to gain access? Because they are great humanitarians? How can the American people ever be certain your decisions would not be affected by that money? Why did you not comply fully with the conflict of interest agreement you entered into with the administration?\n20. How much does someone have to earn to be \"rich\"?\nWashington Post\nJennifer Rubin writes the Right Turn blog for The Post, offering reported opinion from a conservative perspective.\n Syria Russia Hillary Clinton Islamic State Anderson Cooper Madeleine Albright North American Free Trade Agreement", "external_links": ["http://www.trbimg.com/img-561bbd16/turbine/ct-democratic-debate-questions-hillary-clinton-20151012"], "published": "2015-10-12T17:00:00.000+03:00", "crawled": "2015-10-12T19:37:37.375+03:00", "highlightTitle": ""}