{"organizations": [], "uuid": "662b56a69d9a9d353a3e3208ac93516d12858df5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailyherald.com", "main_image": "http://www.dailyherald.com/storyimage/DA/20150930/sports/150939813/AR/0/AR-150939813.jpg&amp;updated=201509302343&amp;imageversion=Facebook&amp;exactH=630&amp;exactW=1200&amp;exactfit=crop&amp;noborder", "site_section": "http://www.dailyherald.com/rss/feed/?feed=sports_all", "section_title": "DailyHerald.com &gt; Sports", "url": "http://www.dailyherald.com/article/20150930/sports/150939813/", "country": "US", "title": "White Sox slugger Abreu 1 RBI shy of making history", "performance_score": 0, "site": "dailyherald.com", "participants_count": 1, "title_full": "White Sox slugger Abreu 1 RBI shy of making history - DailyHerald.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T07:43:00.000+03:00", "replies_count": 0, "uuid": "662b56a69d9a9d353a3e3208ac93516d12858df5"}, "author": "Scot Gregor", "url": "http://www.dailyherald.com/article/20150930/sports/150939813/", "ord_in_thread": 0, "title": "White Sox slugger Abreu 1 RBI shy of making history", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jose Abreu is 1 RBI shy of joining some pretty exclusive company.\nIn Wednesday night's 5-3 loss to the Royals in 10 innings at U.S. Cellular Field, Abreu hit a solo home run in the seventh inning.\nAbreu now has 30 homers and 99 RBI for the season. If he drives in 1 more run, the White Sox' first baseman will join Albert Pujols (2001-02) as the only players to total 30 or more home runs and 100-plus RBI in their first two seasons.\n\"We'll get him 1 more RBI,\" manager Robin Ventura said. \"He was pretty happy with his home run, and he should be. Anytime you start saying there's only one other guy that's done something, it's impressive. For as long as people have been around doing this game, it's quite an accomplishment.\"\nAbreu had better numbers (36 HRs, 107 RBI) as a rookie, but his second year in the major leagues has been a little easier to navigate.\n\"Last year I learned a lot about how to handle a season as long as this,\" Abreu said through a translator. \"And that experience helped me to get through this year in a better way, in better shape also. I think that you always have to learn from every day, from every season. That's what is helpful for me this year and that's why I feel good now.\"\nCatcher Tyler Flower had a big night at the plate, going 4-for-4 and tying the game at 3-3 in the eighth inning with an RBI double.\nEric Hosmer's 2-run homer off David Robertson with two outs in the 10th decided the outcome.\nJose Quintana pitched another strong game for the White Sox, allowing 3 runs on 5 hits in 9 innings. The 26-year-old lefty has pitched 200 or more innings for three straight seasons.\nKnee surgery for Johnson:\nMicah Johnson didn't look comfortable after rejoining the White Sox from Class AAA Charlotte on Sept. 8. In nine games, Johnson batted .115 (3-for-26) and continued playing tentative defense at second base.\nOn Thursday, Johnson is going to have arthroscopic surgery on his left knee.\n\"They're going to go in and clean it up and get it fixed,\" manager Robin Ventura said. \"He had something he just felt like was in there. Playing-wise, you just can't play your best. They did the right thing; you go in and check. It's not that big a deal, but it's enough to go in and fix it.\"\nWhen Johnson is healed up and ready to get back on the field, improving his throws to second base on forceouts and double-play attempts is a top priority.\n\"It's repetition,\" Ventura said. \"Repetition is what helps that, and I think for him it's going to be having the confidence to be able to do that and make a slight change and be comfortable with it. That's always doable, and I think he has the ability to do that.\"\nGet great articles like this sent to your inbox! Click here to sign up for the White Sox Newsletter No Thanks Sports MLB White Sox Baseball Pro Men", "external_links": ["https://twitter.com/share"], "published": "2015-10-01T07:43:00.000+03:00", "crawled": "2015-10-02T00:44:48.286+03:00", "highlightTitle": ""}