{"organizations": [], "uuid": "1752305cf17a519cdfde94a39d3913f2f52142a1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mpnnow.com", "main_image": "http://www.mpnnow.com/Global/images/head/nameplate/mpnnow_logo.png", "site_section": "http://www.mpnnow.com/sports?template=rss&mime=xml", "section_title": "Sports - MPNnow", "url": "http://www.mpnnow.com/article/20151001/SPORTS/151009948/2000/NEWS?rssfeed=true", "country": "US", "title": "AREA ROUNDUP: Marcus Whitman girls swimming defeats Midlakes", "performance_score": 0, "site": "mpnnow.com", "participants_count": 1, "title_full": "AREA ROUNDUP: Marcus Whitman girls swimming defeats Midlakes", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T06:56:00.000+03:00", "replies_count": 0, "uuid": "1752305cf17a519cdfde94a39d3913f2f52142a1"}, "author": "Messenger Post sports@messengerpostmedia.com", "url": "http://www.mpnnow.com/article/20151001/SPORTS/151009948/2000/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "AREA ROUNDUP: Marcus Whitman girls swimming defeats Midlakes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Oct. 1, 2015 at 10:56 PM By Messenger Post Posted Oct. 1, 2015 at 10:56 PM Canandaigua, N.Y. RUSHVILLE — The Marcus Whitman girls swim team improved to 6-1 with a 107-78 win over Midlakes. Courtney Copper, Ashleigh Parsons, Hailey Rossi and Morgan Smithling started off the meet with a first-place finish in the medley relay for the Wildcats. The senior Copper won the 50 free and 100 fly, Rossi won the 200 individual medley and 100 free, and senior Victoria Shively won in diving. Smithling took first in the 100 backstroke, and eighth grader Parsons finished in first in the 100 breaststroke. Marcus Whitman and Pal-Mac are the only undefeated teams left in the league, and they will meet next week. “The girls are really motivated to see what they can do,” Marcus Whitman coach Marcy Adams said. “They came into this season not knowing what to expect after losing six seniors, but a lot of the younger girls have stepped up and done well for us so far.” The Wildcats will host the Red Raiders at 4:30 p.m. on Tuesday. In other high school girls swimming action on Thursday: Fairport 103, Canandaigua 83 Grace Chen placed first for the Red Raiders in the 100 backstroke and the 200 individual medley. Sabrina Turek won the 200 free, and 500 free and Kaitlyn Ringhoff finished first in the 50 free and 100 butterfly. GIRLS SOCCER South Seneca 8, Romulus 1 Mackenzie Kenyon had a hat trick and Kelsey Shaulis scored two goals to lead the Falcons. Emily Dey added a goal and an assist and Morgan McGonigal made four saves for South Seneca. Romulus’ Emma Voorhees made 24 saves in net for the Warriors. Naples 2, Marcus Whitman 1 All three goals were scored in the second half. Emma Lincoln scored the first goal of the game for Naples on a shot from 25 yards out, but Whitman’s Ellie Nemitz answered six minutes later to tie the game at one. Skylar Matthews scored the game-winner three minutes after the Whitman goal. Ashley Wight made five saves in goal for the Big Green. BOYS SOCCER South Seneca/Romulus 3, Sodus 0 Lincoln Bachman-Lowe scored two goals and Eli Corning added one goal for SS/R. Skylar Rasmussen made eight saves for the shutout. Canandaigua 2, Greece Arcadia 1 OT Jonathon Brown scored the first goal for Canandaigua 14 minutes into the game and then scored the game-winner on a penalty kick with less than a minute left in the first overtime. Carter Englert scored the lone goal for Arcadia, and Jake Corcoran made five saves. Canandaigua’s Jarrett McWilliams made five saves to help lead the Braves to a 7-2-1 record. The Braves travel to Livonia on Saturday. GIRLS TENNIS Page 2 of 2 - Mynderse 4, Newark 1 Samantha Pundt (6-1, 6-3), Rachel Sullivan (6-3, 6-1) and Meredith Perine (6-1, 7-5) all won in singles play. Sarah Kohberger and Lily Redding won 6-4, 6-1 in second doubles for Mynderse (11-2). Ashley Porter and Kaitlyn Pieters won 7-5, 6-3 in first doubles for Newark. Canandaigua 6, Churchville-Chili 1 The Braves improved to 7-6 with the win. Era Gjonbalaj (6-2, 6-4), Linda Coleman (6-0, 6-1) and Amy Jennings (5-7, 6-2, 6-2) picked up wins in singles play for Canandaigua. The Braves’ Shea Simmons and Natalie Logan won 6-3, 7-5 in first doubles, Megan Ogden and Morgan Szczepkowski won 6-1, 6-4 in second doubles and Brynn Schauman and Kelsey Towne won 6-1, 6-4 in third doubles. GIRLS VOLLEYBALL Canandaigua 3, Batavia 1 The Braves won the first game 28-26, the second game 25-22 and the third game 25-21. Canandaigua’s Sarah Braddon had nine kills and four aces, Rachel Simmons had eight kills and three aces, and Dale Sandle added 12 digs. Batavia’s Tessa Engel led the Devils with 12 kills. South Seneca 3, Bloomfield 2 The Falcons won the second game 25-9, the third game 25-20 and the fifth game 25-7. Bailey Minges led South Seneca with 18 digs and 13 assists and Laura Wyckoff added 11 kills. Grace Bartle had 11 kills and Hannah Penn added nine digs and four aces for Bloomfield. Lyons 3, Clyde-Savannah 0 The Lions swept the Golden Eagles 25-19, 25-19 and 25-16. Kiyarra Juliano led Lyons (8-4) with 13 assists and Teaonna Jenkins had five kills and five digs. Riley Carr led Clyde-Savannah with 12 assists. Wayne 3, Midlakes 1 Wayne won the first game 25-13, the second game 25-21 and the third game 25-18. Katie Leaty led Wayne with 30 assists. Connor Parrow had 18 digs and 14 assists, Brittanie Forde had 11 kills and 12 digs, and Aubrey O’Brien added 17 digs to lead Midlakes. GOLF South Seneca 242, Naples 261 Andrew Fleischman was the medalist of the match with a 38 for Naples. Max Stamberger and Kyle Shields each shot a 47 for the Falcons. By Messenger Post", "external_links": [], "published": "2015-10-02T06:56:00.000+03:00", "crawled": "2015-10-02T06:53:42.544+03:00", "highlightTitle": ""}