{"organizations": [], "uuid": "c10e954b8263f659e00f863d70eaa784bdea3c48", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nydailynews.com", "main_image": "http://assets.nydailynews.com/polopoly_fs/1.2389495!/img/httpImage/image.jpg_gen/derivatives/landscape_1200/knicks-bauru.jpg", "site_section": "http://www.nydailynews.com/sports/index.html", "section_title": "Sports News &amp; Articles: Today’s Latest Sports News - NY Daily News", "url": "http://www.nydailynews.com/sports/basketball/knicks/isola-derek-fisher-held-accountable-article-1.2389496", "country": "US", "title": "Isola: Derek Fisher should be held accountable", "performance_score": 2, "site": "nydailynews.com", "participants_count": 1, "title_full": "Isola: Derek Fisher should be held accountable - NY Daily News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "c10e954b8263f659e00f863d70eaa784bdea3c48"}, "author": "NEW YORK DAILY NEWS", "url": "http://www.nydailynews.com/sports/basketball/knicks/isola-derek-fisher-held-accountable-article-1.2389496", "ord_in_thread": 0, "title": "Isola: Derek Fisher should be held accountable", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Corey Sipkin/New York Daily News Derek Fisher's commitment to the Knicks comes into question after the latest incident. It wasn't the worst season in Knicks history that has Derek Fisher on the clock. It is the most regrettable weekend of his short coaching career that did the trick.\nImagine if Carmelo Anthony, after the fifth day of training camp, informed his superiors that he would be traveling to Los Angeles to visit his child only to end up at the home of the estranged wife of a current NBA player that results in a physical altercation with the player. And on top of that, misses the very next practice.\nWe would all question, rightfully so, Carmelo's commitment and common sense.\nBut this is much worse than a player getting himself into an awkward and embarrassing mess for himself and the organization. The head coach of the Knicks shouldn't be missing a practice in training camp. Whether he should even be cavorting with the estranged wife of Grizzlies forward Matt Barnes is another story.\nBarnes, a former Knick, is a renowned hot head who should be suspended for reportedly driving from the Grizzlies training camp in Santa Barbara to assault Fisher. Barnes has a long rap sheet. Mostly altercations with opposing players. And he's good for at least three menacing threats, via social or mainstream media, per season.\nLast year, Barnes was fined for a nasty exchange with Suns owner Robert Saver. During the Clippers-Rockets series Barnes was fined by the league for shouting profanities at James Harden's mother. Very sweet indeed.\nMichael Buckner/Getty Images The Knicks are caught up in the wrong triangle, this one between Fisher, Matt Barnes (l.) and Gloria Govan (r.). Fisher knows all about Barnes. They were teammates for two seasons with the Lakers. That's probably where Fisher first met Barnes' wife, Gloria, who made a name for herself on the reality TV show \"Basketball Wives,\"a distasteful program that makes NBA officials cringe.\nThe incident in Los Angeles was a scene right out of the trashy show. Fisher, who filed for divorce from his wife last March, is the victim here since Barnes reportedly attacked him. Fisher might press charges. But on some level Fisher should be held accountable as well. Why put yourself in this position on the first week of training camp 2,500 miles from your team?\nThe 17-win Knicks were the joke of the NBA last year. Fisher just made himself a punch line with the entire league.\n\"It's a no-no,\" said one team official. \"You don't date wives of players. A coach can't do that.\"\nThe transition from playing a final season to immediately becoming a head coach is a difficult one. It's not easy to gain the respect and trust of players, especially established veterans who were still leery of Fisher for his role in the Player's Union a few years back.\nAndrew D. Bernstein/NBAE/Getty Images Barnes (l.) and Fisher (floor) used to be teammates together. This latest incident, one week into Fisher's second year on the bench, doesn't help matters. And if you know anything about an NBA locker room you know the players are having a good laugh at Fisher's expense. Fisher-Barnes-Gloria is not the triangle the Knicks should be focused on.\nFOLLOW THE DAILY NEWS SPORTS ON FACEBOOK. \"LIKE\" US HERE\nFisher was a very likable player who has been much more guarded as a coach. He has always conducted himself as a professional. But now he's made his job that much tougher. He's also placed Phil Jackson in a bad spot. Two weeks ago, Jackson volunteered to the media that he would be spending more time around Fisher and the team this season. Who knew that it meant Jackson would have to shadow his unproven coach 24/7 and on both coasts.\n\"I'm here, I'm focused,\" Fisher said prior to Wednesday's preseason opener at the Garden. \"It's not something that's going to take me away from who we are and what we're trying to do.\"\nThat's not true. He's already missed one practice. What type of message does that send to relatively new team? You think Greg Popovich takes the first weekend off to sit around a bonfire with a player's wife? Pat Riley? Doc Rivers? Phil Jackson?\nFisher's job performance was mostly ignored last season once the Knicks become irrelevant in January. For a guy that lost more games in one season than any Knicks coach in history, Fisher got a free pass. Those days are over now.\nRelated Stories Derek Fisher refuses to comment on altercation with Barnes Knicks coach Derek Fisher attacked by Matt Barnes", "external_links": ["https://www.facebook.com/NYDNSports"], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T03:36:22.618+03:00", "highlightTitle": ""}