{"organizations": [], "uuid": "18a037bb281f4164e9d3a67d3df918b335eedf8c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "http://www.bostonherald.com/sites/default/files/media/ap/4792e6b8113a4a0aad30a33f731149e3.jpg", "site_section": "http://bostonherald.com/sports", "section_title": "Sports | Boston Herald", "url": "http://bostonherald.com/sports/soccer/2015/10/manchester_derby_draw_rooney_scrutiny_frustrates_van_gaal", "country": "US", "title": "Manchester derby draw: Rooney scrutiny frustrates Van Gaal", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "Manchester derby draw: Rooney scrutiny frustrates Van Gaal | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T01:23:00.000+02:00", "replies_count": 0, "uuid": "18a037bb281f4164e9d3a67d3df918b335eedf8c"}, "author": "Associated Press", "url": "http://bostonherald.com/sports/soccer/2015/10/manchester_derby_draw_rooney_scrutiny_frustrates_van_gaal", "ord_in_thread": 0, "title": "Manchester derby draw: Rooney scrutiny frustrates Van Gaal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Manchester derby draw: Rooney scrutiny frustrates Van Gaal Associated Press Merchandise is seen for sale before the English Premier League soccer match between Manchester United and Manchester City at Old Trafford Stadium, Manchester, England, Sunday, Oct. 25, 2015. (AP Photo/Jon Super) comments Tweet MANCHESTER, England — The first scoreless Manchester derby in five years left Louis van Gaal frustrated and combative.\nNot over the inability of his United team — like City — to produce more than one shot on target but at the increased scrutiny of Wayne Rooney's performance up front in the Premier League on Sunday.\nA day after his 30th birthday, Rooney's seemingly guaranteed starting place looks harder to justify, however much the striker exerts himself in attempting to regain the prolific form of the past.\nThe clamor will surely grow for Van Gaal to shift Anthony Martial, the 19-year-old Frenchman who cost up to 80 million euros ($90 million) to sign last month, from the left wing to Rooney's center forward role.\nIn Van Gaal, though, Rooney has a staunch public champion — for now at least.\n\"I have to talk every week about Rooney, why?\" the United manager said in the news conference after the 0-0 draw.\nFew doubt Rooney's commitment in the twilight of his career. After a clash of heads in the first half with City captain Vincent Kompany, staples were applied to stem the flow of blood and the striker returned to action at Old Trafford.\nBut United's top earner, who collects up to 300,000 pounds ($460,000) a week, has scored only twice in his nine league games this season, did not even manage a shot off target against City and even his passes were wayward. The hunt for Bobby Charlton's United scoring record has suddenly slowed, with Rooney 13 from the 249 goal target.\n\"I don't give any answers more about Wayne Rooney because I am sick of it,\" Van Gaal said.\nSuch mediocrity was not confined to Rooney in the 170th Manchester derby as the neighbors, whose squads collectively cost more than $1.2 billion to assemble, provided a telling demonstration of how heavy spending does not always translate into glory on Sunday.\nThey remain among the title favorites. City returned to top spot, ahead of Arsenal on goal difference, with United two points back in fourth.\nIt took until the 82nd minute for Jesus Navas to curl a shot at United goalkeeper David De Gea. And Joe Hart only made his first save six minutes later when the City goalkeeper stretched to tip Chris Smalling's shot wide, just after United substitute Jesse Lingard hit the crossbar.\n\"I thought I'd nicked it,\" Smalling said. \"We were the team that was really pressing and going for that winner but it wasn't our luck.\"\nUnited was playing after an away Champions League game at CSKA Moscow on Wednesday when City was at home.\nFor this most tribal of footballing rivalries, there was not a single Manchester-born player in either lineup as United and City both lacked intensity.\nYaya Toure was the closest visiting player to score in the first half. The midfielder headed over and scooped a shot wide.\nAt half time, Van Gaal recalled telling his players: \"You can shoot also from outside the box ... try your luck.\"\nThe chants of \"attack, attack, attack\" seemed more in desperation than expectation from the home fans.\nNot until the start of the second half did United look like it could breach Hart's goal, although Smalling's header from a corner floated wide.\n\"(City) have the right to play compact, and they have done it,\" Van Gaal said. \"They have a fantastic team also on the counterattack, but we have prevented that also in a very professional way. So I cannot complain.\"\nOnly in the last 10 minutes did either side show the desire required to collect all three points. But it was too late in this poor advert for the world's richest soccer competition from two of its wealthiest teams.\n\"The second half we lose so many balls that it was impossible to try to create chances,\" City manager Manuel Pellegrini said. It was \"a good draw in a difficult stadium.\"\n___\nRob Harris can be followed at www.twitter.com/RobHarris and www.facebook.com/RobHarrisReports", "external_links": ["http://player.mediabong.net/se/56.js?url=", "https://twitter.com/share?text=Manchester+derby+draw%3A+Rooney+scrutiny+frustrates+Van+Gaal"], "published": "2015-10-26T01:23:00.000+02:00", "crawled": "2015-10-25T22:29:45.307+02:00", "highlightTitle": ""}