{"organizations": [], "uuid": "1e061f986d4946e7b447c9022ef1faf4d9084707", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.northjersey.com", "main_image": "http://www.northjersey.com/designimages/NorthJerseyFacebook_377x196.jpg", "site_section": "http://www.northjersey.com/cmlink/sports-rss.rss#", "section_title": "Sports News on NorthJersey.com", "url": "http://www.northjersey.com/news/sullivan-everything-going-mets-way-1.1435595", "country": "US", "title": "Sullivan: Everything going Mets' way - News", "performance_score": 0, "site": "northjersey.com", "participants_count": 1, "title_full": "Sullivan: Everything going Mets' way - News - NorthJersey.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:10:00.000+03:00", "replies_count": 0, "uuid": "1e061f986d4946e7b447c9022ef1faf4d9084707"}, "author": "Tara Sullivan", "url": "http://www.northjersey.com/news/sullivan-everything-going-mets-way-1.1435595", "ord_in_thread": 0, "title": "Sullivan: Everything going Mets' way - News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK — The fault line ripped open when David Wright’s heretofore silent bat awoke with a scorching double to center field, a deep Citi Field hit that would give the Mets the first run in the first inning of this pivotal second game of the National League Championship Series against the Cubs.\nThe earthquake of noise continued as Wright cruised into second base and Curtis Granderson crossed home plate – yet another sold-out home crowd dancing to the marvelous sounds of postseason baseball, their long-suffering wait for a night like this more than enough protection against the cold Queens air.\nA familiar, favorite soundtrack guided their moves, with the opening notes of Daniel Murphy’s Irish jig introduction song turning the approach to his ensuing at-bat into an all-out dance party.\nAnd then — and then — Murphy made another magical Mets night officially erupt.\nWhen the newest October darling took Jake Arrieta’s fourth pitch into the right field seats, when the unlikeliest October hero replaced a near-miss line drive foul ball with a no-doubt, golf ball drive just inside the foul pole, when the bearded, lumbering infielder followed Wright across home plate and into a dugout full of high fives and hugs, when one of most veteran members of the roster ascended those same dugout steps for the tip of the cap the crowd demanded, well, then it was clear how much this new Mets Stadium could come alive, rumbling as it did under the weight of 44,502 delirious occupants.\nWith Murphy’s franchise-record-tying fifth postseason long ball (matching franchise favorite Mike Piazza), with Noah Syndergaard’s unhittable mix of pitching power and finesse, with Granderson’s outright theft of a potential home run by the Cubs’ Chris Coghlan, with a beautiful bullpen bridge to another perfect Jeurys Familia save, all of it underscored by the appetite of a fan base starving for the return of championship days, the Mets used up every ounce of their home field advantage, beating the Cubs for the second time in as many nights, 4-2.\nAnd so does this magic baseball carpet ride continue, rounding a corner toward Chicago’s Wrigley Field, which will host Game 3 Tuesday night, Game 4 Wednesday and Game 5 (if needed!) Thursday. How could the Mets not believe in their destiny now? Already 2-0 against a team they’d lost to seven straight times in the regular season, already victorious over the two best pitchers (Jon Lester and Arrieta) on the Cubs’ staff, already buoyed by the remarkable emergence of Murphy’s clutch hitting and the ridiculous dominance by the latest young pitcher, how could anyone doubt the sense of destiny carrying this team?\nWith Syndergaard extending the work Matt Harvey did a night before and with Jacob deGrom — the same man who defeated both ends of the Dodgers’ one-two pitching punch, Clayton Kershaw and Zack Greinke, in the five-game Division Series — taking the ball for Game 3, the Mets head west with every right to dare this dream to come true.\nWhat else to make of a night that welcomed a scuffling team captain, Wright, into the hitting party? When Wright sent Dexter Fowler chasing to retrieve a ball that landed just out of reach of his outstretched glove, when Fowler finally corralled the run-scoring hit, it sure felt as if a final piece of a large Mets puzzle was falling into place. It was Wright who had only just told his manager, Terry Collins, he would understand if Collins wanted to bench him, to let a bat that had managed only one hit this entire postseason and a back that requires more rest to have the night off.\n“I will tell you, this is David Wright, OK?” Collins said before the game, recalling a conversation the two had in the hours after the Mets’ Game 1 win, one he said went something like this:\nCollins: “How you doing?”\nWright: ”OK.”\nCollins: “Are you stiff?”\nWright: “Terry, it was 35 degrees out there, we’re all stiff.”\nCollins: “No, how are you?”\nWright. “I’m fine. Now, I suck. But I’m fine.”\nTo which Collins concluded: “That’s him. Is it getting to him? No. He’s a baseball player. He’s been in this environment a long time. I just keep saying, ‘Hey, look, keep putting those good at-bats on because it’s going to happen.’ He’s just too good a player.”\nWright delivered on that faith Sunday, a first-inning hit to puncture the aura of the Cy Young hopeful Arrieta, a calm, confident stroke that rippled through an entire lineup. His last clutch hit had come all the way back in Game 1 of the division series against the Dodgers, and while he filled the interim games with a few timely walks and his usual stellar defense, a contribution at the plate was what he really craved.\n“That’s about as sweet as I thought it was going to be,” Wright said that night in Los Angeles, his mind reflecting on how much of his season was lost to a back injury. “It was fun, and that’s what I love to do.”\nE-mail: sullivan@northjersey.com", "external_links": [], "published": "2015-10-19T03:10:00.000+03:00", "crawled": "2015-10-19T07:13:17.717+03:00", "highlightTitle": ""}