{"organizations": [], "uuid": "6fd65c34332fafbb7dd8a458e71c7052a7982bd5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theguardian.com", "main_image": "https://i.guim.co.uk/img/static/sys-images/Guardian/Pix/pictures/2015/10/7/1444244210711/94107e95-dea6-4ec5-86d2-d7ad5c8cf413-2060x1236.jpeg?w=1200&amp;q=85&amp;auto=format&amp;sharp=10&amp;s=1229dec8b47b5b66adf256f31f2109b3", "site_section": "http://www.theguardian.com/us", "section_title": "Latest US news, world news, sports and opinion from the Guardian | theguardian.com | The Guardian", "url": "http://www.theguardian.com/film/2015/oct/07/kate-winslet-new-york-film-festival-younger-generation-women", "country": "GB", "title": "Kate Winslet: 'It's sad more young women don't compliment each other' | Film", "performance_score": 0, "site": "theguardian.com", "participants_count": 15, "title_full": "Kate Winslet: 'It's sad more young women don't compliment each other' | Film | The Guardian", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T05:53:00.000+03:00", "replies_count": 16, "uuid": "613055d1faa3676715b082522b35220e6aab0dc3"}, "author": "Nigel M Smith", "url": "http://www.theguardian.com/film/2015/oct/07/kate-winslet-new-york-film-festival-younger-generation-women#post-0", "ord_in_thread": 0, "title": "Kate Winslet: 'It's sad more young women don't compliment each other' | Film", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kate Winslet urged young women to be more complimentary to their female friends during a dinner held in her honour at the New York film festival on Tuesday.\n“It’s sad that we don’t seem to come across young girls saying to their friends: ‘Wow, you’re so pretty’,” she said. “Young women these days, because they’re exposed to levels of criticism in the media, they just automatically criticise their friends, themselves and each other. It’s bizarre.”\nThe actor has long campaigned against women being held to artificial standards of beauty. She is fiercely against cosmetic surgery (“it goes against my morals,” she was reported as once saying), and made headlines in 2003 after complaining about a GQ cover on which her legs were airbrushed to make them look thinner. Winslet’s picture also received considerable post-production on a 2013 Vogue cover .\nRelated: Kate Winslet's Vogue cover is ageless. But not in a good way | Emma Brockes\nWinslet said: “Whenever I see my image digitally altered in any way, I speak out about it. I don’t want my daughters to look at those images [and say]: ‘Wow, you really look like that.’ It’s sort of dishonest and I can’t deal with that.”\n“It’s up to this generation,” she continued. “We live in a time where media is so widespread – the internet and social media being what it is. I think young girls, they want to be pretty, they want to feel loved – and they look at images of people who are often not necessarily curvy or healthy – these kind of womanly things that I believe in – and it just bothers me that they aspire to look like that.”\nThe actor was at the festival in support of her performance in Danny Boyle’s Aaron Sorkin-scripted drama Steve Jobs , in which she stars opposite Michael Fassbender, who plays the titular Apple co-founder. Since its first screening at the Telluride film festival, Winslet and the film have been considered as frontrunners for the awards race this autumn .\nSteve Jobs “It’s a very special opportunity that I’m having right now, that I can talk about a film that I genuinely love,” she said of the movie. “When my husband and I saw it for the first time, I was very emotional. I felt so proud to be a part of something that is this accomplished. It’s a really rare feeling, that.”\nWinslet also expressed gratitude to director Peter Jackson, who gave the actor her first big film break with Heavenly Creatures in 1994. She considers her casting in the project as the “biggest stroke of luck” in her career.\n“Not only was I asked to play an extraordinary part in a true story, but people actually liked the film,” she said of her first major feature. “It became that movie that people still talk about.”\nRelated: Kate Winslet: five best moments\nWinslet’s performance in Heavenly Creatures led to her being cast in Ang Lee’s Sense and Sensibility , soon followed by James Cameron’s record-breaking blockbuster Titanic , which made her one of the world’s most recognisable stars.\nWinslet said the immense success of Titanic caught her off-guard: it is the second highest-grossing film of all time, not adjusted for inflation. “Call me naive, but I had no idea – I really didn’t – that that was what was going to happen with that film and to my life. I look back and I just remember thinking: ‘I don’t really know how to do this being famous thing.’\nFacebook Twitter Pinterest Leonardo DiCaprio and Kate Winslet in Titanic. Photograph: Allstar/20 CENTURY FOX/Sportsphoto Ltd.\n“In a funny way, I also didn’t feel that I particularly earned it. I was only 21 and I was still learning everything on the job. I knew that if I allowed myself to really catapult myself into that world, I would have made me unhappy, possibly. I just knew that I had to keep acting.”\nFollowing Titanic, Winslet took the opposite approach of her co-star in the film, Leonardo DiCaprio, by only appearing in smaller budgeted, independent films for several years. While DiCaprio starred in the star-packed period action film The Man in the Iron Mask, Winslet opted for Hideous Kinky, a small-scale drama set in Morocco.\n“I was in a position where I could choose, and chose to do some smaller films,” she explained. “I wanted to stay grounded and I wanted to learn. I also didn’t want to burn out. I think it was the right thing.”", "external_links": ["https://i.guim.co.uk/img/static/sys-images/Guardian/Pix/pictures/2015/10/7/1444244886460/4b4effd3-f013-42f4-81cf-6f44a7257c62-1020x612.jpeg?w=300&q=85&auto=format&sharp=10&s=7b05b94ddfc62fb7018a54265c749990", "http://www.telegraph.co.uk/news/celebritynews/8700007/Kate-Winslet-Cosmetic-surgery-goes-against-my-morals.html", "https://i.guim.co.uk/img/static/sys-images/Guardian/Pix/pictures/2015/10/7/1444244886460/4b4effd3-f013-42f4-81cf-6f44a7257c62-1020x612.jpeg?w=605&q=85&auto=format&sharp=10&s=8dfb322ef6e6cffe8fc7834b33110592", "https://twitter.com/intent/tweet?text=Kate%20Winslet%3A%20", "https://i.guim.co.uk/img/static/sys-images/Guardian/Pix/pictures/2015/10/7/1444244886460/4b4effd3-f013-42f4-81cf-6f44a7257c62-1020x612.jpeg?w=445&q=85&auto=format&sharp=10&s=5e963d6a90006cbc32ca3f8594672807", "https://i.guim.co.uk/img/static/sys-images/Guardian/Pix/pictures/2015/10/7/1444244886460/4b4effd3-f013-42f4-81cf-6f44a7257c62-1020x612.jpeg?w=620&q=85&auto=format&sharp=10&s=dc2e2a34cf31f1852f75fac8bef980d1", "https://www.youtube.com/embed/aEr6K1bwIVs?wmode=opaque&feature=oembed", "http://www.youtube.com/watch?v=aEr6K1bwIVs", "http://us.hellomagazine.com/film/2003/01/10/katewinslet/", "https://www.facebook.com/dialog/share?app_id=180444840287&href=http%3A%2F%2Fgu.com%2Fp%2F4d4fa%2Fsfb%23img-2&redirect_uri=http%3A%2F%2Fgu.com%2Fp%2F4d4fa&picture=http%3A%2F%2Fstatic.guim.co.uk%2Fsys-images%2FGuardian%2FPix%2Fpictures%2F2015%2F10%2F7%2F1444244886460%2F4b4effd3-f013-42f4-81cf-6f44a7257c62-1020x612.jpeg", "http://www.pinterest.com/pin/create/button/?description=Kate+Winslet%3A+%27It%27s+sad+more+young+women+don%27t+compliment+each+other%27&url=http%3A%2F%2Fwww.theguardian.com%2Ffilm%2F2015%2Foct%2F07%2Fkate-winslet-new-york-film-festival-younger-generation-women&media=http%3A%2F%2Fstatic.guim.co.uk%2Fsys-images%2FGuardian%2FPix%2Fpictures%2F2015%2F10%2F7%2F1444244886460%2F4b4effd3-f013-42f4-81cf-6f44a7257c62-1020x612.jpeg"], "published": "2015-10-08T05:53:00.000+03:00", "crawled": "2015-10-08T01:32:16.222+03:00", "highlightTitle": ""}