{"organizations": ["Montezuma Tigerhawk", "Montezuma", "Hyde Newton Daily News"], "uuid": "0136cb8d7eddd0cb5922fd20adb79798f84acc2a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newtondailynews.com", "main_image": "", "site_section": "http://www.newtondailynews.com/?rss=sports", "section_title": "NDN Sports", "url": "http://www.newtondailynews.com/2015/10/05/tigerhawk-defense-responds-in-win-over-montezuma/aelhnjo/", "country": "US", "title": "Tigerhawk defense responds in win over Montezuma", "performance_score": 0, "site": "newtondailynews.com", "participants_count": 0, "title_full": "Tigerhawk defense responds in win over Montezuma", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T19:41:00.000+03:00", "replies_count": 0, "uuid": "0136cb8d7eddd0cb5922fd20adb79798f84acc2a"}, "author": "", "url": "http://www.newtondailynews.com/2015/10/05/tigerhawk-defense-responds-in-win-over-montezuma/aelhnjo/", "ord_in_thread": 0, "title": "Tigerhawk defense responds in win over Montezuma", "locations": ["Colfax-Mingo"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tigerhawk defense responds in win over Montezuma Published: Monday, Oct. 5, 2015 11:41 a.m. CDT • Updated: Monday, Oct. 5, 2015 12:18 p.m. CDT Caption (Troy Hyde/Daily News) Members of the Colfax-Mingo football team celebrate a 14-9 victory over Montezuma on Friday night. The Tigerhawks are now 5-1 overall and 4-0 in Class A District 7 play. By Troy Hyde Newton Daily News \nCOLFAX — With an offensive unit that includes the school’s all-time leading passer and two of the top receivers in school history, it was Colfax-Mingo’s defense that stole the show on Friday night. \nThe Tigerhawk defense got three sacks from Colin Lourens, forced two big turnovers in the second half and came up with a big goal-line stand late in the third quarter during a 14-9 victory over rival Montezuma in Class A District 7 play. \nIt was the biggest game for Colfax-Mingo since the Tigerhawks last hosted a playoff game in 2003, and the home team delivered in front of its fans. \nThe win puts the Tigerhawks in a great position to end the home playoff game drought. \nColfax-Mingo is 4-0 in district play and only Iowa Valley, BGM and GMG remain on the schedule. BGM is undefeated and ranked No. 2 in Class A, but GMG and Iowa Valley have a combined two wins. \n“This is a huge win for our program, and a huge win for our boys,” Colfax-Mingo coach Jeff Lietz said. “One of our goals is a home playoff game, and honestly if we take care of business with Iowa Valley and GMG, it doesn’t matter what happens with BGM. \n“We’re not conceding the district championship, but this win is a pretty good step in the direction of accomplishing our goal of hosting a playoff game.” \nThe defense was the reason the Tigerhawks were able to knock off the defending district champions, but the offense had its moments. \nJared Myers, the school’s all-time leading passer with 5,831 yards, threw for 300 yards and two touchdowns, and Jacob Lietz and Blake Summy combined for 12 catches and 230 yards. \nMontezuma took an early 7-0 lead when it drove 60 yards in seven plays late in the first quarter. Carson Losure had first-down runs of 15 and 11 yards and then got to paydirt on a 12-yard touchdown run. \nAfter that, the Tigerhawk defense shut down the Braves. \nThey forced three straight three and outs after Losure’s touchdown, and the Tigerhawks took the lead for good when Myers connected with Summy on a 12-yard touchdown pass with 2:16 left in the first half. \nColfax-Mingo got on the board earlier in the second quarter when Myers found Lietz for a 57-yard touchdown pass play. \nLietz snagged the pass from Myers far enough to get the first down on third and three but made a few moves before sprinting past the Braves defense to the end zone. \n“That play is a designed out, but I just took a little step back, and they over pursued,” Jacob Lietz said. “Colin and Lane (Dunblazer) got me a huge block in the middle and I just took off to the end zone.” \nThe Tigerhawks led 14-7 at that half and those 14 points held up because of a shutdown defense in the second half. \nMontezuma’s only points came when Lietz was tackled in the end zone on a running play following Colfax-Mingo’s huge goal-line stand late in the third quarter. \nThe Braves got the ball at the Colfax-Mingo 10-yard line following a Tigerhawk fumble. They gained nine yards on the first two plays, but lost two on third and one and then Losure was stuffed on fourth down. \n“The defense was huge,” Lourens said. “When we needed to make plays, we made them. Getting a goal-line stand against a running team says a lot about how well the defense played.” \nMontezuma got the ball back after the safety, but Summy turned away that drive with an interception. \nColfax-Mingo gave the ball back to the Braves after a punt, and Montezuma’s final chance to take the lead ended when Lietz forced a fumble and Summy dove on the football, out-battling two Brave players in the process. \n“The goal line stand was huge. We forced big turnovers and I couldn’t be happier with our defense,” Coach Lietz said. “I challenged that unit before the game. I told them that everyone knows us for being a big-play offense. I want tonight to be the night that everyone knows we play defense, too.” \nThe Tigerhawks started their final drive on their own 39-yard line. They picked up enough first downs to run out the clock. The biggest first down came on second-and-six when Myers went up top to Lourens for 24 yards. Lourens finished with five catches for 45 yards. \nLietz recorded a team-high 13.5 tackles and forced the fourth-quarter fumble that halted Montezuma’s final chance to rally. Lourens had 6.5 tackles, four tackles for loss and a career-high three sacks. Garrett Chapman also played his best game of the year, finishing with six tackles. \nLietz finished with 133 yards on six catches, while Summy caught six passes for 97 yards. \nThe six catches pushes Summy into the top spot on Colfax-Mingo’s career receptions list. He has 110 catches, passing Joe Borts’ previous record of 107. Jacob Lietz has 97 career catches. He is only nine catches away from the single-season record of 52 set by Borts in 2010. \n“We had to get this (win) to get to our goal,” Jacob Lietz said. “We can’t overlook anybody, but it was a big win.” \nColfax-Mingo returns to action at 7 p.m. Friday when it travels to Marengo to face Iowa Valley (1-5. 1-3). \nMontezuma 7-0-0-2—9 \nMontezuma — Losure 12-yd run (McKeag kick) \nColfax-Mingo — Lietz 57-yd pass from Myers (Buehrer kick) \nColfax-Mingo — Summy 12-yd pass from Myers (Buehrer kick) \nMontezuma — Lietz tackled in end zone for a safety", "external_links": [], "published": "2015-10-05T19:41:00.000+03:00", "crawled": "2015-10-06T09:57:32.457+03:00", "highlightTitle": ""}