{"organizations": ["Bucyrus"], "uuid": "c03a2766b69d9a040f50faba1fe12deedbbe0363", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bucyrustelegraphforum.com", "main_image": "http://www.gannett-cdn.com/-mm-/ab3fd73c48ca3f09970ba973e88f658fcde303dc/c=0-0-4604-2601&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/19/OHGroup/Bucyrus/635808547089127149-002-5-.JPG", "site_section": "http://rssfeeds.bucyrustelegraphforum.com/bucyrus/highschoolsports", "section_title": "Bucyrus - High School Sports", "url": "http://www.bucyrustelegraphforum.com/story/sports/high-school/2015/10/19/volleyball-tournament-kicks-off-bang/73997906/", "country": "US", "title": "Volleyball tournament kicks off with a bang", "performance_score": 0, "site": "bucyrustelegraphforum.com", "participants_count": 0, "title_full": "Volleyball tournament kicks off with a bang", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T00:47:00.000+03:00", "replies_count": 0, "uuid": "c03a2766b69d9a040f50faba1fe12deedbbe0363"}, "author": "", "url": "http://www.bucyrustelegraphforum.com/story/sports/high-school/2015/10/19/volleyball-tournament-kicks-off-bang/73997906/", "ord_in_thread": 0, "title": "Volleyball tournament kicks off with a bang", "locations": ["Wynford"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jake", "Galion", "Jake Furr", "Crawford"], "text": "Volleyball tournament kicks off with a bang Jake Furr , Reporter 7:54 p.m. EDT October 19, 2015 Most teams will see action Wednesday, Buckettes earn bye The OHSAA Volleyball tournament kicks off on Tuesday with most area teams playing Wednesday (Photo: Jake Furr/Telegraph-Forum) Bucyrus, Colonel Crawford, Wynford, Galion play on Wednesday Buckeye Central plays Thursday with first round bye CONNECT TWEET LINKEDIN COMMENT EMAIL MORE \nTuesday marks the start of the OHSAA High School Volleyball tournament for area schools and just one Crawford County team will be in action. Most teams will see action on Wednesday and one school earned a first round bye. \nThe tournament is all about the luck of the draw so let’s take a look at who area teams will be playing this week. \nSouth Central Trojans/Danbury Lakers at Buckeye Central Buckettes \nThe Buckettes will be patiently waiting the outcome of the Trojans and Lakers game to see who they will be hosting on Thursday evening. The Trojans are 10-12 while the Lakers are 0-9. The likely outcome will pit the Trojans making the trip. \nThe Buckettes are hitting a stride as of late after losing their final matchup to Northern 10 Conference champ Upper Sandusky – Buckeye Central has won seven straight since then including a win against Carey. The Buckettes regular season record stands at 17-4. \nShould the home court advantage yield a win, a district semifinal matchup at Willard would be the result. The Buckettes need to keep doing what they are doing and continue to gel. Super sophomore Jenna Karl and senior Jenna Delarber have the Buckettes in prime position to make a deep postseason run. Sarah Heydinger has come on as of late as a block specialist and Erin Baldosser is producing great results from the serving line. \nGibsonburg Golden Bears at Wynford Royals \nThis should be the most interesting first-round matchup of all of the county teams. The Royals stand at 12-10 and are the No. 8 seed in the district. The Golden Bears come in with a record of 14-8 and the No. 9 seed according to coaches. The two will clash on Wednesday evening. \nAlthough the Royals own the inferior record, the higher seed gives them home court advantage. The advantage could be the deciding factor in the contest. Alyssa Harrer has been the constant throughout the season for the Royals, but it is the emergence of a more aggressive Tara Zinser that has produced yet another weapon. Rhieannae Cory is one of the N10’s top setters who likes to be sneaky and record some kills at opportune times. \nThe Royals also possess senior leadership and experience. Along with Harrer and Cory, Mallory Moore is always a threat to produce a dominating game. Maci Cooper likes the outside hitting position and Jade Stuckman is a great passer from the libero position. \nBucyrus Redmen at Mohawk Warriors \nThe Redmen will be traveling to Mohawk on Wednesday evening for a first round matchup featuring N10 foes. Bucyrus owns the No. 13 seed while the Warriors are ranked sixth. Both meetings during the regular season saw the Warriors take home two 3-0 wins. \nBut, as is normal in the tournament, it is hard to beat a team three times in one season. The Redmen will be looking to pull off the upset because they are the team with nothing to lose. The Redmen also have five seniors with four years of tournament experience. \nKelci Simms is having a career year defensively. Her 70 blocks are tops in the N10 and she will be surely looking to add to that total before her final season is over. Gabby Seibert has been dubbed the “most athletic person on the court night in and night out” by head coach Allysen Coleman. Look for her to use that athleticism to keep the Redmen close. \nTorie Tanner is another one of those athletic Redmen hitters that could take over a game in a blink of an eye. Seayra Spears is coming back from a midseason injury and has found a groove of late and Mackenzie Whitmore will be itching to set up her teammates for kills. \nColonel Crawford Eagles at Margaretta Polar Bears \nThe Eagles may have had the most luck of the draw of any team in the area. They will be traveling to Margaretta for an evenly matched game. The Polar Bears are 9-13 while the Eagles stand at 8-14. Unfortunately for both teams, No.1 ranked Edison will be in the future for the winner. \nThe Eagles have underperformed this season. They possess possibly the best libero in the N10 in Jada Klingenberger who reached 1,000 digs in her career earlier this season. Her 407 this season is 80 more than the next highest total in the conference. \nJenna Siegel is also among the top hitters in the league. The Eagles do not possess a ton of experience having just two seniors on the squad, yet the talent is there. Samantha Mutchler is the N10 leader in serving. The Eagles will have to put a complete game together to advance. \nWillard Flashes at Galion Tigers \nThe Tigers will be hosting the 6-14 Willard Crimson Flashes on Wednesday. As the No. 4 seed, the Tigers should have no problem advancing to a very interesting showdown with Crestview. \nThe Tigers have been led by two of the top players in Crawford County – Taylor Valentine and Marissa Gwinner. Valentine has recorded 358 kills on the season and Gwinner has sent down 243 kills. The dynamic duo will be too much for the Flashes to handle, but how far will the two take the Tigers? Gwinner is just a sophomore, but her athleticism pits her beyond her years. Valentine is a senior and will be looked at as the leader of this group. \nMansfield St. Peter’s Spartans at Crestline Bulldogs \nThe Bulldogs earned the No. 10 seed in the coach’s poll for the Division IV District tournament. Crestline will be hosting the tournament game as they host Mansfield St. Peter’s. \nBoth teams are winless on the year and the winner will advance to play top seeded Monroeville. \njfurr@gannett.com", "external_links": [], "published": "2015-10-20T00:47:00.000+03:00", "crawled": "2015-10-20T08:50:28.316+03:00", "highlightTitle": ""}