{"organizations": [], "uuid": "91299b63228ccaf240a0401508a95be73a01d35e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thesportsbank.net", "main_image": "http://www.thesportsbank.net/core/wp-content/uploads/2011/05/michael-jordan-kobe-bryant-218x300.jpg", "site_section": "http://www.thesportsbank.net/feed/", "section_title": "The Sports Bank.Net", "url": "http://www.thesportsbank.net/lakers-2/kobe-bryant-lakerland-complicated/", "country": "US", "title": "Kobe Bryant complicates everything in Lakerland this year", "performance_score": 0, "site": "thesportsbank.net", "participants_count": 1, "title_full": "Kobe Bryant complicates everything in Lakerland this year", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T19:20:00.000+03:00", "replies_count": 0, "uuid": "91299b63228ccaf240a0401508a95be73a01d35e"}, "author": "paulmbanks", "url": "http://www.thesportsbank.net/lakers-2/kobe-bryant-lakerland-complicated/", "ord_in_thread": 0, "title": "Kobe Bryant complicates everything in Lakerland this year", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tweet Kobe Bryant ‘s retirement decision is not set in stone. Yes, his contract expires after this season, but as Kobe told a reporter “who the hell said” that he was leaving. Bryant has also said that fielding retirement questions an indeed be a “pain in the ass” (it’s mild, entry-level swearing day here in the opening paragraph) Lakers insiders (and today, c’mon who isn’t “an insider”) believe that Kobe Bryant will be done after this season, for what it’s worth. Whether Kobe Bryant will continue playing after 2015-16 or not is uncertain. And it’s one of many uncertainties on this Lakers team. It’s going to be a Lakers club that will be very difficult to gauge this season. Kobe is coming off two straight surgeries, and three incomplete seasons due to injury. He might stay another year if he makes it through the whole season unscathed. NBA on TNT commentators Reggie Miller and Brent Barry did a NBA season preview conference call today. Kobe Bryant was one of the myriad topics discussed. Miller on Lakers veteran guard Kobe Bryant’s return from injury: “Don’t be surprised if Kobe wins the comeback player of the year. [Head coach] Bryon Scott is going to have to play a masterfully hand of poker with Kobe.” Miller on the young players surrounding Kobe : “All of these guys idolize Kobe. They grew up watching him and they want to put him in the best light, but Kobe has to allow them to put them in the best light. They can’t run everything through Kobe; not at this point in his career. He has to allow these young guys to grow, falter and fall down. I don’t mind tough love, but he can’t break them. There’s nothing wrong with being tough. If he allows them to grow within the ‘Black Mamba’ mantra, then the Lakers will be okay. Are they a playoff team? No. If the Lakers want to go forward as a franchise, these young players have to get better. They can get better under the tutelage of Kobe Bryant.” \nThere’s also been a lot of talk that Kobe Bryant could see some time at the four this season. That idea is interesting to say the least. \nPaul M. Banks owns, operates and sometimes writes The Sports Bank.net , which is partnered with FOX Sports Engage Network. The website is also featured on News Now. Banks, a former writer for the Washington Times, currently contributes to the Chicago Tribune RedEye. He also appears regularly on numerous television and radio talk shows all across the country. Catch him Tuesdays on KOZN 1620 The Zone.", "external_links": [], "published": "2015-10-23T19:20:00.000+03:00", "crawled": "2015-10-23T20:35:00.952+03:00", "highlightTitle": ""}