{"organizations": [], "uuid": "8d747978054573744a6b9cf45b3c0ae4f944cc48", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailyherald.com", "main_image": "http://www.dailyherald.com/storyimage/DA/20151010/sports/151019918/AR/0/AR-151019918.jpg&amp;updated=201510091822&amp;imageversion=Facebook&amp;exactH=630&amp;exactW=1200&amp;exactfit=crop&amp;noborder", "site_section": "http://www.dailyherald.com/rss/feed/?feed=sports_all", "section_title": "DailyHerald.com &gt; Sports", "url": "http://www.dailyherald.com/article/20151010/sports/151019918/", "country": "US", "title": "Battle of defenses: No. 13 Northwestern vs No. 18 Michigan", "performance_score": 0, "site": "dailyherald.com", "participants_count": 1, "title_full": "Battle of defenses: No. 13 Northwestern vs No. 18 Michigan - DailyHerald.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T09:00:00.000+03:00", "replies_count": 0, "uuid": "8d747978054573744a6b9cf45b3c0ae4f944cc48"}, "author": "Associated Press", "url": "http://www.dailyherald.com/article/20151010/sports/151019918/", "ord_in_thread": 0, "title": "Battle of defenses: No. 13 Northwestern vs No. 18 Michigan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ANN ARBOR, Mich. -- Northwestern and Michigan have made steady climbs up The Associated Press poll due to their defenses.\nThe 13th-ranked Wildcats have shut out two teams and are giving up a nation-low seven points a game. That has helped Northwestern equal its total number of victories in each of the previous two years. If the Wildcats win Saturday at the Big House, they will be 6-0 for the first time since 1962 when Ara Parseghian was their coach.\n\"Everyone's gonna give us their best shot now,\" Northwestern offensive guard Matt Frazier said. \"But we like that. We accept the challenge.\"\nNo. 18 Michigan, meanwhile, is a win away from matching the number of victories it had last year in Brady Hoke's final season before being fired.\nThe Wolverines have blanked consecutive opponents, rank first in third-down defense and second in points allowed under Jim Harbaugh.\nEntering the battle of stingy units, Harbaugh refused to add to the hype.\n\"The two defenses won't go against each other in the game,\" he deadpanned.\nMichigan defensive tackle Ryan Glasgow, though, added to the anticipation.\n\"Our goal is to be the best defense in the country,\" he said. \"We don't shy away from talking about that.\"\nHere are some things to watch when the Wolverines (5-0, 1-0 Big Ten) travel to play the Wolverines (4-1, 1-0):\nMEASURING STICK: The Wildcats publicly downplayed the importance of the game with coach Pat Fitzgerald going as far as saying he didn't know what a statement game was at his weekly news conference. The winners and losers may eventually look back at the matchup as pivotal. After going 5-7 last year, Glasgow is glad to be playing in a significant game in October. \"I'm looking forward to our team being able to make a statement,\" he said.\nBAD MEMORIES: Michigan has won four straight games in the series, including last year's 10-9 victory at Northwestern. \"We got thumped,\" Fitzgerald lamented. Frazier acknowledged his team will be a little more motivated. \"Thinking back, those losses stick out to me over the years,\" he said. \"I definitely want to get one this week, but we're just focused on going 1-0 every week.\"\nMUTUAL RESPECT: Harbaugh and Fitzgerald played, about a decade apart, for the teams they're coaching and they've become relatively fond of each other. \"I was a fan growing up,\" the 40-year-old Fitzgerald said. \"Got to know him a bit personally when he was at Stanford and we'd see each other recruiting. ... You've got to tip your hat to the success he's had.\" The 51-year-old Harbaugh went as far as inviting Fitzgerald to come to Ann Arbor last summer to speak at a football camp for high school players. \"He did a tremendous job talking to the campers, sharing football lessons and life lessons,\" Harbaugh recalled.\nRUNNING GAME: Both teams may struggle to run the ball, but the team that does it best will likely win. Northwestern's Justin Jackson has run for 100-plus yards in three straight weeks, four times this season and 10 during his short career. Jackson, though, ran for a career-low 35 yards and a career-low 2.1 yards per attempt last year against Michigan. The Wolverines are hoping running back De'Veon Smith can play after missing last week's win at Maryland with an injured right ankle. If Smith has to sit again, the Wolverines will probably lean on Drake Johnson, who has beat out Ty Isaac to be the team's No. 2 running back, after having major knee surgery twice.\nCOMEBACK PLAYER: Frazier, who started against Minnesota, may be the happiest player on the field after a long list of setbacks that started with surgery on his right ankle in January. \"Three days after that surgery, I had to have emergency surgery on my spine,\" he recalled. \"So then I started recovering from that, getting incorporated back into workouts a bit. I tore my left pec. And then I think maybe a week or two after that, I was hospitalized. I had an infection in my pelvis, and it went septic, it got in my bloodstream. I was hospitalized for 10 days, three or four days in ICU.\"\n Sports Chicago Big Ten Northwestern Football College Men", "external_links": ["https://twitter.com/share"], "published": "2015-10-10T09:00:00.000+03:00", "crawled": "2015-10-10T12:42:42.937+03:00", "highlightTitle": ""}