{"organizations": [], "uuid": "97004ee691945c9c9cd9ae891a3b02127445fbb1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.brecorder.com", "main_image": "", "site_section": "http://brecorder.com//rss/?feed_id=5&format=raw", "section_title": "Business Recorder - Sports", "url": "http://www.brecorder.com/sports/other-sports/257160-ronaldo-targets-euro-2016-to-crown-career.html", "country": "", "title": "Ronaldo targets Euro 2016 to crown career", "performance_score": 0, "site": "brecorder.com", "participants_count": 0, "title_full": "Ronaldo targets Euro 2016 to crown career", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T10:04:00.000+03:00", "replies_count": 0, "uuid": "97004ee691945c9c9cd9ae891a3b02127445fbb1"}, "author": "", "url": "http://www.brecorder.com/sports/other-sports/257160-ronaldo-targets-euro-2016-to-crown-career.html", "ord_in_thread": 0, "title": "Ronaldo targets Euro 2016 to crown career", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ronaldo", "Parvez Jabri"], "text": "  16:04 Posted by Parvez Jabri 0 \nMADRID: Cristiano Ronaldo is targeting Euro 2016 glory with Portugal to crown his glittering career, Spanish sports daily Marca reported on Wednesday. \n\"At club level and on a personal level I've already won everything,\" said Ronaldo, who picked up the European golden boot award this week after scoring 48 league goals in 35 games for Real Madrid last season. \n\"But I haven't won a title with the national team,\" lamented Ronaldo, a beaten Euro 2004 finalist and a World Cup 2006 and Euro 2012 semi-finalist. \n\"It would be the pinnacle of a great career (winning the European championship) and this is what I'm hoping for. My hope is that 2016 will be the year.\" \n\"We have a good coach and an excellent president and the new generation of younger players coming through has helped us move along,\" he explained. \nFernando Santos, who coached Greece at the 2014 World Cup, guided Portugal to qualification for Euro 2016 this week by topping Group I ahead of Albania, Denmark, Serbia and Armenia. \nIn his seventh season at Real Madrid, Ronaldo also told Marca he would love to continue at the club. \n\"All being well I have a contract here until I'm 33 and as I have said time and again my dream is actually to finish my career here, \n\"I'm 30 now but I want to play another five or six years more. In fact If we look after ourselves it's possible to play up to 40 and that's what I'd like to do. \n\"I feel good here, I feel useful here and I want that to carry on. \nIn September Ronaldo became Real Madrid's top ever goal scorer and the top ever scorer in the European Champions League. \nHe is openly courted by his former club Manchester United and by Qatar-backed Paris Saint Germain. Copyright AFP (Agence France-Presse), 2015", "external_links": [], "published": "2015-10-14T10:04:00.000+03:00", "crawled": "2015-10-14T14:20:24.625+03:00", "highlightTitle": ""}