{"organizations": [], "uuid": "2de8c5df306ed3afacbc3270dea56a095dfa1e2f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.morningsun.net", "main_image": "http://www.morningsun.net/Global/images/head/nameplate/ks-pittsburg_logo.png", "site_section": "http://www.morningsun.net/sports?template=rss&mime=xml", "section_title": "Sports - Morning Sun", "url": "http://www.morningsun.net/article/20151017/SPORTS/151019907/2000/NEWS?rssfeed=true", "country": "US", "title": "No. 22 PSU prepares for No. 3 NWMS", "performance_score": 0, "site": "morningsun.net", "participants_count": 1, "title_full": "No. 22 PSU prepares for No. 3 NWMS", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T07:22:00.000+03:00", "replies_count": 0, "uuid": "2de8c5df306ed3afacbc3270dea56a095dfa1e2f"}, "author": "Lucas Davis ldavis@morningsun.net", "url": "http://www.morningsun.net/article/20151017/SPORTS/151019907/2000/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "No. 22 PSU prepares for No. 3 NWMS", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "No. 22 PSU prepares for No. 3 NWMS Comment Posted Oct. 17, 2015 at 12:01 AM By Lucas Davis Posted Oct. 17, 2015 at 12:01 AM Pittsburg, Kan. After suffering its second loss of the season last week, Pittsburg State football turns its attention to rival Northwest Missouri State at 2:30 p.m. Saturday at Carnie Smith Stadium. The No. 22 Gorillas (4-2) lost a hard-fought road battle against the No. 18 Emporia State last weekend, diminishing their playoff hopes after taking their second loss of the season. With their backs against the wall — much like last season — a win against the third-ranked Bearcats has the potential to vault Pitt State into another postseason run. Saturday’s contest between the MIAA rivals will be televised live on The Cox Channel KS — airing on channels 122 and 2122 (HD). The Bearcats head into the game with a perfect 6-0 record, tied with the Hornets for the top spot in the MIAA Conference. Pitt State Offense PSU quarterback John Roderique Jr. leads the Gorillas offense with a 137.5 efficiency rating, completing 97-of-his-157 passes for 1,264 yards, nine touchdowns and seven interceptions. He is averaging 210 yards through the air per game. A dual threat, Roderique leads the Gorillas in rushing with 466 yards on 80 attempts. He has a team-high nine rushing touchdowns. PSU's Jeff Seybold has 456 rushing yards on 90 attempts to lead all running backs. His four touchdowns on the ground are the second most on the team. He has 158 receiving yards this season with another three touchdowns coming through the air. The Gorillas have a pair of dynamic wide receivers on the roster in Marquise Cushon and Levi Copelin, with Copelin leading the team at 323 yards receiving and a pair of touchdowns on 20 catches. Cushon has 309 yards receiving on 24 catches. He has 94 rushing for the Gorillas. Northwest Missouri Offense The Bearcats are scoring an average of 44 points per game, accumulating 162 yards on the ground and 262 through their six wins. Quarterback Brady Bolles has a 120 efficiency rating this season, completing 112-of-208 passes for 1,400 yards, nine touchdowns and four interceptions. He is averaging 233 passing yards per game for the Bearcats. Northwest Missouri has four rushers with more than 200 yards on the ground this season, led by by Phil Jackson at 225 yards and five touchdowns on 52 carries. Cameron Wilcox has 224 yards and a touchdown on 52 carries, while Bolles’ 212 yards and four rushing touchdowns make him dangerous anytime the ball in his hands. With six receivers having more than 100 yards gained this season, the Bearcats feature a deep pass-catching crops. The threat to pay attention to will be Shawn Bane, a 5-foot-11-inch freshman with the ability to stretch the field and take the top off a defense. He leads the team in receiving with 420 yards on 25 grabs, averaging 70 yards per game. Pitt State Defense The Gorilla defense is allowing 27.83 points per game this season. As a unit, they are giving up 163 yards per game on the ground and 257 yards through the air. Page 2 of 2 - Leading PSU in tackles is safety Deron Washington, who has amassed 54 through six games. He has the second-most broken-up passes on the team with seven. Linebacker Spencer Brown is second in tackles with 45. His three tackles-for-loss are tied for third most on the Gorillas. Safety Devron Moore (41) and linebacker Spencer Brown (38) are the remaining two Gorillas with more than 25 tackles this season. Leading Pitt State in takeaways is cornerback Darnell Walker, who has five interceptions. He has a team-high eight pass-break-ups. Northwest Missouri Defense NWMS has been stingy on the defensive side of the ball through six games this season. They have allowed opponents an average of 10 points a game, while holding them to 65 yards rushing and 150 passing yards per contest. Linebacker Jacob Vollstedt leads the Bearcats in tackles with 47. His 6.5 tackles-for-loss are second most on the team to Brandon Yost, who has 8.0. Safties Edward Richey and Jack Young lead the Bearcats in interceptions with two each. Northwest Missouri State has six other players on the team who have intercepted a pass this season. Lucas Davis is the sports editor of the Pittsburg Morning Sun. Email him at ldavis@morningsun.net and follow him on twitter at @LDsportswriter. By Lucas Davis", "external_links": [], "published": "2015-10-17T07:22:00.000+03:00", "crawled": "2015-10-17T08:36:57.838+03:00", "highlightTitle": ""}