{"organizations": ["AP", "Western Sydney Wanderers"], "uuid": "909b4c0a151e5c3685f941d27130eeb69471ca03", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usatoday.com", "main_image": "", "site_section": "http://www.usatoday.com/sports/", "section_title": "USA Today | Sports", "url": "http://www.usatoday.com/story/sports/soccer/2015/10/24/sydney-wins-tight-derby-to-go-atop-a-league-table/74542548/", "country": "US", "title": "Sydney wins tight derby to go atop A-League table", "performance_score": 0, "site": "usatoday.com", "participants_count": 0, "title_full": "Sydney wins tight derby to go atop A-League table", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T23:52:00.000+03:00", "replies_count": 0, "uuid": "909b4c0a151e5c3685f941d27130eeb69471ca03"}, "author": "", "url": "http://www.usatoday.com/story/sports/soccer/2015/10/24/sydney-wins-tight-derby-to-go-atop-a-league-table/74542548/", "ord_in_thread": 0, "title": "Sydney wins tight derby to go atop A-League table", "locations": ["SYDNEY", "Sydney"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Milos Ninkovic"], "text": "CONNECT TWEET LINKEDIN COMMENT EMAIL MORE SYDNEY (AP) — Milos Ninkovic scored in the 88th minute to give Sydney FC a 1-0 win over Western Sydney Wanderers in a feisty derby Saturday, sending his team to the top of Australian football's A-League after the third round.\nNinkovic controlled Brandon O'Neill's lofted pass, beat Nikolai Topor-Stanley and sent his sharply-angled shot across goalkeeper Andrew Redmayne and into the bottom corner, clinching the win in front of 40,000 fans.\nSydney's fourth win in its last five derby clashes with the Wanderers set it atop the table, one point clear of Brisbane, which lost 3-2 at Wellington to end its winning start to the season.\nWellington moved into joint-second place beside Brisbane and Newcastle, which stunned the defending champion Melbourne Victory 1-0 at Newcastle on Friday.\nSydney coach Graham Arnold praised his team's \"outstanding\" defense in a match in which the Wanderers often seemed the better side.\n\"It was a typical derby,\" Arnold said. \"It was physical, it was fast, erratic at times but we showed a lot of character, a lot of heart.\n\"For me, early in the season it's about getting points but it's about the performance. I said to them at halftime I would rather lose than play the way we did the first half.\"\nWestern Sydney dominated the first 45 minutes without being able to break down the Sydney defense. Jaushua Sotirio's appeared to have scored from a header for the Wanderers before halftime but was deemed offside.\n\"It's a goal,\" Wanderers coach Tony Popovic said. \"If it's line ball and we're supposed to be giving the attacking team an advantage then that's a goal.\n\"We were clearly the better side, not probably better but clearly better.\"\nNewcastle extended an eight-game and six-year winning streak over the Victory at home with Friday's 1-0 win at Hunter Stadium. David Carney scored in the 75th minute to give Newcastle the points and to leave Victory coach Kevin Muscat to lament his team's poor finishing.\n\"We dominated the game territorially, just in the final third, the end-product, creating those opportunities and turning good chances into goals wasn't there and we paid the price for it,\" Muscat said.\nWellington conceded an early goal to Dimitri Petratos, but rallied for a 3-2 win after substitute Blake Powell scored in the 78th minute.\n\"I thought the first goal was against the run of play,\" Wellington coach Ernie Merrick said. \"I thought we had them on toast. We've got so many boys now that want to score goals.\"\nMelbourne City beat Central Coast 3-1 on Sunday. The third round will conclude with a match between Perth and Adelaide.\nCONNECT TWEET LINKEDIN COMMENT EMAIL MORE Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.\nTOP VIDEOS", "external_links": ["https://twitter.com/intent/tweet?url=http%3A//usat.ly/1S35hAE&text=Sydney%20wins%20tight%20derby%20to%20go%20atop%20A-League%20table&via=usatoday", "http://www.linkedin.com/shareArticle?url=http%3A//usat.ly/1S35hAE&mini=true"], "published": "2015-10-24T23:52:00.000+03:00", "crawled": "2015-10-25T14:04:22.698+02:00", "highlightTitle": ""}