{"organizations": [], "uuid": "b4f7eef15d2894fc754c095c6eabafd0af73ba57", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "couriernews.com", "main_image": "http://matchbin-assets.s3.amazonaws.com/public/sites/2218/thumbs/5VP_Cyclones.jpg", "site_section": "http://couriernews.com/rss/rss/Sports?instance=Sports&amp;content_type=article&amp;tags=sports_high_school+sports_collegiate+sports_professional+sports_scoreboard+sports_other&amp;tag_inclusion=or&amp;offset=0&amp;limit=25&amp;page_name=rss", "section_title": "Sports", "url": "http://couriernews.com/bookmark/26924601", "country": "US", "title": "Cyclones seek Senior Night triumph", "performance_score": 0, "site": "couriernews.com", "participants_count": 1, "title_full": "Cyclones seek Senior Night triumph", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T19:42:00.000+03:00", "replies_count": 0, "uuid": "b4f7eef15d2894fc754c095c6eabafd0af73ba57"}, "author": "Travis Simpson (noreply@couriernews.com)", "url": "http://couriernews.com/bookmark/26924601", "ord_in_thread": 0, "title": "Cyclones seek Senior Night triumph", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "slideshow The decision to go for the 2-point conversion rather than the point-after kick against the Van Buren Pointers last Friday at Cyclone Stadium did more than secure a 32-31 win for the Russellville Cylcones.“It has to make a difference on their confidence,” Russellville first-year head coach Billy Dawson said. “We had preached all week that we weren’t hoping to win, we were going to win. So we made the call. We decided that the game was going to end right here. The kids executed, and it turned out awesome.”Dawson said the players carried the momentum with them into practice this week. Actually, Dawson said the team has always shown up to practice with the goal of improving.“You would have never guessed we were a 1-5 team when we were practicing for Van Buren,” he said. “You’d never guess we are 2-5 now. It’s been a good week of practice.”The Cyclones (2-5, 1-3) will host the Alma Airedales on Friday to celebrate Senior Night. Dawson said he expects talented opposition, with momentum on their side.The Airedales defeated the Conway Wampus Cats 40-35 last week and are 5-2 on the season and 3-1 in the 7A/6A-Ceentral Conference. Alma’s only losses were 35-19 to Fort Smith Southside and 27-24 to the Bryant Hornets.“They’ve played well for a number of weeks,” Dawson said.But how do the Cyclones match up? Dawson said it was hard to tell.“There’s no question they are very well-coached and they play hard,” he said. “But people always ask me about match-ups, and yes, football is a game of match-ups, but it’s hard for me to tell until I see them. On film, we think so, but you can’t tell anything about their physicality or how strong they are, since you don’t know anything about the guy they are going against.”Dawson said the Airedales will line up in several offensive formations and make use of “their very talented quarterback.”“They’re going to try and make you make a mistake,” he said. “For us, defensively, it’s going to be about lining up and executing. I think they are pretty balanced. They will run as much as they can, but they will try to hit on some big plays. They are kind of a trick play sort of offense. They’ll do a reverse-pass play and some other different stuff in there. They try and catch you with your eyes wrong. If you aren’t disciplined, they are very effective.”Alma has generated 2,962 yards of total offense this year — 1,350 on the ground and 1,502 through the air. Russellville hasn’t been quite as balanced. The Cyclones have 1,505 yards passing and 896 rushing. Balance, Dawson said, would be key to a Russellville victory.“We have to be more balanced,” he said. “We have to be able to run the ball some. In terms of run-pass option, in terms of formation, we have gotten better as the year has gone on. We have to be able to run it on some throwing downs and throw it on some running downs.”Kickoff is scheduled for 7 p.m. at Cyclone Stadium.  ", "external_links": [], "published": "2015-10-23T19:42:00.000+03:00", "crawled": "2015-10-23T21:48:00.602+03:00", "highlightTitle": ""}