{"organizations": [], "uuid": "a646a9af5dd6d66d5b22ce950a0307fb527a5587", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.completesportsnigeria.com", "main_image": "http://www.completesportsnigeria.com/wp-content/uploads/2015/10/sepp1.jpg", "site_section": "http://www.completesportsnigeria.com/?feed=rss2", "section_title": "Complete Sports Nigeria", "url": "http://www.completesportsnigeria.com/fifa-ban-blatter-platini-valcke-for-three-months/", "country": "US", "title": "FIFA Ban Blatter, Platini, Valcke For Three Months", "performance_score": 0, "site": "completesportsnigeria.com", "participants_count": 1, "title_full": "FIFA Ban Blatter, Platini, Valcke For Three Months", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T13:46:00.000+03:00", "replies_count": 0, "uuid": "a646a9af5dd6d66d5b22ce950a0307fb527a5587"}, "author": "Nurudeen Obalola", "url": "http://www.completesportsnigeria.com/fifa-ban-blatter-platini-valcke-for-three-months/", "ord_in_thread": 0, "title": "FIFA Ban Blatter, Platini, Valcke For Three Months", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Headlines / FIFA Ban Blatter, Platini, Valcke For Three Months FIFA Ban Blatter, Platini, Valcke For Three Months Headlines \nAn investigation into the corruption scandal in world football body FIFA has led to 90-day bans for President Sepp Blatter, UEFA President Michel Platini and FIFA secretary-general Jerome Valcke. FIFA released a statement on Thursday morning to announce the decisions, which could mean CAF President Issa Hayatou will take charge of the global body. FIFA statement reads: “The adjudicatory chamber of the Ethics Committee chaired by Hans Joachim Eckert has provisionally banned FIFA President Joseph S. Blatter, UEFA President and FIFA Vice-President Michel Platini, and FIFA Secretary General Jérôme Valcke (who has already been put on leave by his employer FIFA) for a duration of 90 days. The duration of the bans may be extended for an additional period not exceeding 45 days. \nThe former FIFA Vice-President Chung Mong-joon has been banned for six years and fined CHF 100,000. During this time, the above individuals are banned from all football activities on a national and international level. The bans come into force immediately. \nThe grounds for these decisions are the investigations that are being carried out by the investigatory chamber of the Ethics Committee. The chairman of the chamber is Dr Cornel Borbély. \nThe investigation into Joseph S. Blatter is being carried out by Robert Torres, the investigation into Michel Platini by Vanessa Allard. The proceedings against the South Korean football official Chung Mong-joon were opened in January 2015 based on findings in the report on the investigation into the bidding process for the 2018/2022 FIFA World Cups. \nHe has been found guilty of infringing article 13 (General rules of conduct), article 16 (Confidentiality), article 18 (Duty of disclosure, cooperation and reporting), article 41 (Obligation of the parties to collaborate) and article 42 (General obligation to collaborate) of the FIFA Code of Ethics. The Ethics Committee is unable to comment on the details of the decisions until they become final, due to the provisions of article 36 (Confidentiality) of the FIFA Code of Ethics.”", "external_links": [], "published": "2015-10-08T13:46:00.000+03:00", "crawled": "2015-10-08T16:26:15.656+03:00", "highlightTitle": ""}