{"organizations": ["Battle Creek Enquirer", "St. Philip"], "uuid": "dbc32fec3dd0398d50d9d2c131d20567cfe705ca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.battlecreekenquirer.com", "main_image": "http://www.gannett-cdn.com/-mm-/ea9478eaec5fe8e27dbe74a5b506bf587013fb42/c=0-112-2394-1465&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/10/BattleCreek/B9319208797Z.1_20151010172532_000_G7IC6Q74J.1-0.jpg", "site_section": "https://feeds.feedblitz.com/battlecreek/sports", "section_title": "Battle Creek - Sports", "url": "http://www.battlecreekenquirer.com/story/sports/high-school/2015/10/22/prep-football-lot-line-week-9-area-teams/74327864/", "country": "US", "title": "Prep Football: Lot on the line in Week 9 for area teams", "performance_score": 0, "site": "battlecreekenquirer.com", "participants_count": 0, "title_full": "Prep Football: Lot on the line in Week 9 for area teams", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T23:46:00.000+03:00", "replies_count": 0, "uuid": "dbc32fec3dd0398d50d9d2c131d20567cfe705ca"}, "author": "", "url": "http://www.battlecreekenquirer.com/story/sports/high-school/2015/10/22/prep-football-lot-line-week-9-area-teams/74327864/", "ord_in_thread": 0, "title": "Prep Football: Lot on the line in Week 9 for area teams", "locations": ["St. Philip"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Waldron", "Bill Broderick", "Brendan Gausselin", "Brayden Darr"], "text": "Prep Football: Lot on the line in Week 9 for area teams Bill Broderick , Battle Creek Enquirer 4:46 p.m. EDT October 22, 2015 St. Philip vs. Lawrence one of the big games in final week as several area teams still have a lot on the line in Week 9 St. Philip’s Brayden Darr heads to the end zone as Brendan Gausselin (14) trails behind against Waldron on Saturday. (Photo: Al Lassen/For the Enquirer) CONNECT TWEET LINKEDIN COMMENT EMAIL MORE \nIt is Week 9 of the high school football season. Many teams are already looking to next year, with their 2015 goals out of reach. Other teams have already achieved what they wanted to in this regular season and are getting ready for the postseason. \nBut there are a group of teams with still a lot on the line in Week 9, and there's no bigger game with more at stake in this area than St. Philip playing Lawrence in 8-man football. \nIt is No. 3-ranked St. Philip going on the road vs. No. 2-ranked Lawrence. Broderick: My message to senior football players \nYes, both teams have conference titles in the bag and playoff spots achieved, but what is on the line this Friday for the Tigers is a chance to beat the only team St. Philip has lost to in the last two years. \n\"This game, this is the one we have circled, been waiting for a whole year to play. Last year they knocked us out, two years ago they knocked us out. It's the team we need to get past to really get somewhere and we have been preparing for this the entire season,\" St. Philip senior quarterback Brendan Gausselin said. \"This is the game of our season. It can make or break us, definitely.\" The Enquirer's Bill Broderick and Nick Buckley break down the Week 9 matchups for the city's prep football teams. Bill Broderick \nSt. Philip is undefeated at 8-0 and ranked No. 3 in the latest Associated Press 8-man football division. But the Tigers also were undefeated at this point last year before losing to Lawrence in the final week of the season. And then, St. Philip saw its season end in the second week of the playoffs with another loss to Lawrence. \nLawrence's lone loss is to a team from Wisconsin. Prep Gameday Scouting Reports, Players of the Week \n\"This game has been on our mind all off-season, all season. We are 19-3 over the last two years and all three games we have lost have been to Lawrence,\" St. Philip coach David Downey said. \"The team knows how big this game is, they know how good Lawrence is. We have a lot of respect for their team, they have a good team over there. They are No. 2, we are No. 3, but we have something to prove.\" \nSt. Philip feels like it didn't give itself the best chance to beat Lawrence the last two years, with the Tigers being hampered by injuries. Two seasons ago, St. Philip lost its starting quarterback in the Lawrence game and last season the Tigers were without Brayden Darr, its leading rusher from a year ago and this season's top gainer. \nHowever, St. Philip still would have had its hands full last season as Lawrence went on to a state title and a 13-0 mark in 2014. \n\"Lawrence was by far the best team in 8-man football last year. They deserved the state championship, nobody really compared to them. But this year I think the division is wide open and there's no clear-cut favorite,\" Downey said. \"This game will send a message, not only to Lawrence, but everybody else we face down the road that we are a pretty good football team. So we want to come out strong and put on a good showing.\" Who is No. 1 in final week of E-10 poll? \nSt. Philip still has the goal of going undefeated on the season and the Tigers also know, win or lose this week, they could be seeing Lawrence again in the playoffs with their postseason life on the line. \nBut all of that takes a back seat to what will be on the line Friday for the St. Philip players. \n\"It's a small-school game, there maybe won't be a lot of people there, but to us it's the biggest game of the year. To us it will be like USC vs. Notre Dame,\" Gausselin said. \"This game will be electric and it would feel really good to finally beat Lawrence if we can get it done.\" Enquirer staffers make high school football picks \nLeague titles still on the line in Week 9 \nFor two other city teams, there is also a lot to play for in the final week of the regular season. \nBattle Creek Central and Lakeview are tied for first place in the Southwestern Michigan Athletic Conference East Division. Both need a win to clinch the title. \nLakeview is 3-1 in the division and faces Gull Lake (2-6) at home. If the Spartans win, it will be a third straight division title for the football program. \nBCC is 3-1 in the division and will go on the road to see Loy Norrix (1-7). If the Bearcats win, it will their first division title since they shared the title in 2008. \nUndefeated seasons on the line in Week 9 \nColdwater and Climax-Scotts, as well as St. Philip, all have a chance at an undefeated regular season. \nColdwater will face Adrian (2-6) for a chance at the school's first 9-0 season. \nClimax-Scotts can finish an undefeated regular season with a win at New Buffalo (3-5) for the Panthers' first perfect 9-0 mark since 2012. \nPlayoffs on the line in Week 9 \nTeams needing a win in the final week to reach the six-wins plateau to clinch a spot in the postseason include Lakeview (5-3), Olivet (5-3), Delton Kellogg (5-3) and Colon (5-3). All could still make it in the playoffs at 5-4 with a loss based on their high computer point totals. \nArea teams who have already had their playoff tickets punched include St. Philip (8-0), Climax-Scotts (8-0), Homer (7-1), Marshall (7-1) and Coldwater (8-0). Read or Share this story: http://bcene.ws/1RZwKmJ TOP VIDEOS", "external_links": [], "published": "2015-10-22T23:46:00.000+03:00", "crawled": "2015-10-23T00:41:17.054+03:00", "highlightTitle": ""}