{"organizations": [], "uuid": "f9edaec2ecd716bd6cb67da97e6499ec4fd95d39", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.naharnet.com", "main_image": "http://images1.naharnet.com/images/170717/w140.jpg?1444310361", "site_section": "http://www.naharnet.com/sports", "section_title": "Naharnet — Sports", "url": "http://www.naharnet.com/stories/en/191573-golden-boy-platini-tarnished-by-blatter-links", "country": "US", "title": "Golden Boy Platini Tarnished by Blatter Links", "performance_score": 0, "site": "naharnet.com", "participants_count": 1, "title_full": "Golden Boy Platini Tarnished by Blatter Links — Naharnet", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T00:19:00.000+03:00", "replies_count": 0, "uuid": "f9edaec2ecd716bd6cb67da97e6499ec4fd95d39"}, "author": "Naharnet Newsdesk", "url": "http://www.naharnet.com/stories/en/191573-golden-boy-platini-tarnished-by-blatter-links", "ord_in_thread": 0, "title": "Golden Boy Platini Tarnished by Blatter Links", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "One of the greatest footballers in history, Michel Platini was on target just two weeks ago for becoming the next head of FIFA, the sport's paramount body.\nBut on Thursday, his dream was dealt a shattering blow by the financial scandal that has engulfed FIFA president Sepp Blatter.\nAn ethics panel suspended Platini for 90 days after Swiss investigators said the UEFA chief had received a \"disloyal payment\" of two million Swiss francs ($2.04 million, 1.8 million euros) from Blatter.\nIn his mid-1980s heyday, the elegant French playmaker was one of the best players in the world.\nHe led France to 1984 European Championship glory and starred at club level for Saint-Etienne and Juventus.\nHe won two Serie A titles with Turin as well as the 1985 European Cup -- a triumph overshadowed by events off the field that night at the Heysel Stadium, where 39 fans were killed in a crush before the game against Liverpool in Brussels.\nHe was honored with the Ballon d'Or, the top honor for individual talent, in three successive years --1983, 1984 and 1985.\nThe World Cup proved to be beyond his powers, with Les Bleus losing in the semi-finals in 1982 and 1986.\nAs a young coach, his France team failed even to qualify for the 1990 World Cup and then bowed out of Euro 92 at the group stage.\nInstead, Platini turned to administration, serving as co-president of the organizing committee of the 1998 World Cup -- which France won on home soil.\nHe gave his support to Blatter when the Swiss won that year's FIFA presidential elections, before working as vice-president of the French Football Federation in 2001 and then taking charge of UEFA, gathering European associations, in 2007.\nAs the tide of sleaze has risen around FIFA, the 60-year-old Platini has sought to position himself as the man to clean up an organization brought to its knees by endless corruption scandals.\nHe announced his candidature for the FIFA presidency when Blatter sensationally announced in June that he was organizing a snap election to choose his successor.\nBut while Platini's reputation as a player remains undimmed, his longstanding ties to Blatter -- dubbed a \"father and son\" relationship by a rival for the FIFA presidency -- threaten to tarnish his image as a reformer.\nPlatini supported Blatter when the Swiss won the 1998 FIFA presidential election and remained a close ally for a long time, though he has sought to distance himself from the 79-year-old as the corruption scandal has grown.\nBut he has come under intense pressure since being named in a Swiss criminal investigation into Blatter, who is accused of making the contested payment to Platini.\nPlatini insists his conscience is clear and the payment was for contractual work carried out for FIFA. The governing body has also said the suspension does not automatically invalidate Platini's candidature.\nThe Frenchman has also come under fire for his decision to support Qatar's controversial bid to host the 2022 World Cup -- a move he has defended, saying the Gulf state was the \"right choice\" for the tournament.", "external_links": [], "published": "2015-10-09T00:19:00.000+03:00", "crawled": "2015-10-08T21:03:54.028+03:00", "highlightTitle": ""}