{"organizations": [], "uuid": "c7fcb620a414bb723ccb000dcd9783d927233fe8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theguardian.com", "main_image": "https://i.guim.co.uk/img/media/a5a925940af07c7bd3d1b04568623578dd1db77b/0_0_2576_1546/master/2576.jpg?w=1200&amp;q=85&amp;auto=format&amp;sharp=10&amp;s=789959c26d734c70aef0a5a8473ef0cf", "site_section": "http://www.theguardian.com/us", "section_title": "Latest US news, world news, sports and opinion from the Guardian | theguardian.com | The Guardian", "url": "http://www.theguardian.com/film/2015/oct/22/angelina-jolie-unbroken-shown-japan-racism-protests", "country": "GB", "title": "Angelina Jolie's Unbroken to be shown in Japan after racism protests | Film", "performance_score": 1, "site": "theguardian.com", "participants_count": 1, "title_full": "Angelina Jolie's Unbroken to be shown in Japan after racism protests | Film | The Guardian", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T15:24:00.000+03:00", "replies_count": 0, "uuid": "c7fcb620a414bb723ccb000dcd9783d927233fe8"}, "author": "Justin McCurry", "url": "http://www.theguardian.com/film/2015/oct/22/angelina-jolie-unbroken-shown-japan-racism-protests", "ord_in_thread": 0, "title": "Angelina Jolie's Unbroken to be shown in Japan after racism protests | Film", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Japanese moviegoers will finally get the chance to see Unbroken , Angelina Jolie’s film about an American POW tortured by the Japanese, despite attempts by right-wingers to prevent its release.\nRelated: Angelina Jolie's Unbroken is racist, say Japanese nationalists\nThe film, which was released in the US and other countries at the end of last year, will be shown at a cinema in Tokyo next February before being screened at other locations, according to media reports.\nDirected by Jolie, Unbroken tells the story of the US Olympic runner and air force pilot Louis Zamperini , who spent 47 days adrift after his B-24 bomber crashed into the Pacific in 1943.\nAfter being captured he spent two years in prison camps in Japan , where he was tortured and starved by guards.\nBased on Laura Hillenbrand’s bestselling 2010 book Unbroken: A World War II Story of Survival, Resilience and Redemption, the film was condemned by conservatives in Japan as racist and “anti-Japanese” for its depictions of sadistic prison guards torturing Zamperini and other POWs.\nRightwing activists launched campaigns on Change.org and Facebook calling for the film to be banned, and for Jolie to be told she was no longer welcome in Japan. A spokesman for the ultra-conservative pressure group the Society for the Dissemination of Historical Fact described the film as “pure fabrication”.\nZamperini, who died last year aged 97, later returned to Japan to meet his captors, but his chief wartime tormentor, a prison guard named Mutsuhiro Watanabe, reportedly turned down his request for a meeting.\nThe Japanese promotional posters for the film describe it as the true story of a man “who survived hell for two years at a prison camp”.\nJolie said she was not concerned about the criticism of her film. “It’s a beautiful film that has a beautiful message,” she told USA Today in December ahead of the film’s worldwide release.\n“We were very conscious of showing all sides of the war, including the bombing of Tokyo. But this is Louis’ experience and he … had a very difficult time as a POW. So we want to pay respect and show that all people suffer in war.”\nUnbroken is not the first foreign film to have drawn criticism from Japan’s ultra-nationalists.\nIn 2010, cinemas dropped plans to show The Cove – an Oscar-winning film about the annual slaughter of dolphins in the town of Taiji – after activists threatened to disrupt screenings.\nThe film was eventually shown after prominent film industry figures called on distributors and cinemas to defend free speech.", "external_links": [], "published": "2015-10-22T15:24:00.000+03:00", "crawled": "2015-10-22T09:36:28.008+03:00", "highlightTitle": ""}