{"organizations": [], "uuid": "70e47ebf99e3622ea0b530dbaeea3d815b1943f4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "http://images.tribuneindia.com/cms/gall_content/2015/10/2015_10$largeimg01_Thursday_2015_011700618.jpg", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/punjab/protesters-hijack-pau-event-in-gurdaspur/140127.html", "country": "US", "title": "Protesters hijack PAU event in Gurdaspur", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "Protesters hijack PAU event in Gurdaspur", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "70e47ebf99e3622ea0b530dbaeea3d815b1943f4"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/punjab/protesters-hijack-pau-event-in-gurdaspur/140127.html", "ord_in_thread": 0, "title": "Protesters hijack PAU event in Gurdaspur", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ravi Dhaliwal Tribune News Service Gurdaspur, September 30\nHundreds of irate farmers today took reportedly control of the Kisan Mela held at the Punjab Agricultural University’s (PAU’s) regional station here. Apprehending that the situation may deteriorate further, the Chief Guest GS Babbehali, Chief Parliamentary Sectretary (Agriculture) and Dr BS Dhillon, PAU Vice-Chancellor, stayed away from the event. The VC had arrived in the city last night, but did not turn up at the venue while the CPS was asked by the police to stay put at his native village Babbehali. Hundreds of police personal remained mute spectators to the proceedings. Despite the fact that anti-riot vehicles were stationed and the area where the stage was set up was barricaded, the farmers hijacked the event. A number of senior police officers of the district police were told to remain present at the mela venue by Senior Superintendent of Police Gurpreet Singh Toor, who was monitoring the situation. The farmers were led by youth leader Kanwalpreet Singh Kakki who apart from addressing the gathering repeatedly challenged the police to \"take him off the stage.\" \"Kisan Melas are held to educate farmers on issues concerning them. It was from this very stage last year that PAU officials had sold a dream to us that 1509 variety of paddy would change their lives for good. The dream has now turned into a nightmare,\" he said. The protesters removed the official banners and placed hoardings of Pagri Sambhal Jatta, the organisation formed by Kakki. Neither the PAU authorities nor senior police officers tried to pacify the demonstrators. The organisers of the event, sensing that things could get out of hand, decided to wind up the Kisan Mela midway.", "external_links": [], "published": "2015-10-01T03:00:00.000+03:00", "crawled": "2015-10-01T10:19:31.821+03:00", "highlightTitle": ""}