{"organizations": [], "uuid": "9a1664d63e24d824704f7282fd59bb6f2d56d990", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.morningsun.net", "main_image": "http://www.morningsun.net/storyimage/KM/20151021/SPORTS/151029964/AR/0/AR-151029964.jpg", "site_section": "http://www.morningsun.net/sports?template=rss&mime=xml", "section_title": "Sports - Morning Sun", "url": "http://www.morningsun.net/article/20151021/SPORTS/151029964/2000/NEWS?rssfeed=true", "country": "US", "title": "Gorilla men picked 5th in preseason poll", "performance_score": 0, "site": "morningsun.net", "participants_count": 1, "title_full": "Gorilla men picked 5th in preseason poll", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T05:47:00.000+03:00", "replies_count": 0, "uuid": "9a1664d63e24d824704f7282fd59bb6f2d56d990"}, "author": "Michael Bauer mbauer@morningsun.net", "url": "http://www.morningsun.net/article/20151021/SPORTS/151029964/2000/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "Gorilla men picked 5th in preseason poll", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Gorilla men picked 5th in preseason poll Comment Posted Oct. 21, 2015 at 9:47 PM Updated at 9:47 PM Posted Oct. 21, 2015 at 9:47 PM Pittsburg, Kan. The Pittsburg State men’s basketball team will enter the 2015-16 season with a fifth-place ranking in the MIAA Conference standings. The Gorillas — who are the defending MIAA Tournament champions — received one first-place vote and 134 points in voting of the conference’s 14 head coaches as the MIAA released the preseason poll on Wednesday. Northwest Missouri State, who won the 2014-15 MIAA regular season title, was voted No. 1 after receiving nine first-place votes and 164 points to earn the top ranking. NWMSU went 25-7 last year, losing to the Gorillas, 65-58, in the MIAA Conference Tournament. The Central Missouri Mules were picked to finish second after receiving one first-place vote and 143 points. The Nebraska Kearney Lopers garnered 141 points and one first-place vote to take third place, while Missouri Southern State had two first-place votes and 140 points to land at fourth. The Gorillas and the Missouri Southern Lions met in last year’s MIAA Tournament Championship game with the Gorillas winning 91-65 in Kansas City, Missouri to earn an at-large bid for the NCAA Division II Tournament. It was the first time since 2007 the Gorillas made it to the national tournament. “I’m hoping that we can carry over that success from last into this year,” said Pitt State head coach Kevin Muff on The MIAA’s website. “It was a great year, it was fun, but we stressed to our team that it’s over. The makeup of this year’s team is similar in some ways, but in a lot of ways, it’s different. Guard against complacency is just going to happen because of the league and the type of competition we see night in and night out. We’re similar in some ways, but we're a different team too. We have some new guys in key positions that are going to have to play in critical roles for us, and guys who are returning will play more significant roles.” PSU ended last season with a 20-12 record (12-7 in the MIAA), falling to Minnesota State Moorhead, 80-68, in the first round of the NCAA Tournament. Minnesota State Moorhead defeated Central Missouri and Northwest Missouri State in the following rounds to advance to the Elite Eight. “You can’t hang your hat on what you did last year but we’re going to be hungry this year. But our guys are up and ready for the challenge,” Muff said. Four players return for the Gorillas, who started 13 games or more last season. Pitt State will bring back eight letter winners from last year. Junior guard Josiah Gustafson returns, coming off a first-team All-MIAA performance from 2014-15. He averaged 15.5 points and 3.6 rebounds per game. Gustafson has been working to recover from an injury from the end of last season. Page 2 of 2 - Another player returning is senior guard Javis Flynn after leading the conference in assists (5.0 average per game) and steals last year. Senior guard Trey Starks, who ended up taking the MVP of the MIAA Conference Tournament last year, is back after playing in the final 12 games for the Gorillas last year. He averaged 12.3 points per game. “Javis Flynn had a great season last year for us, and is a great facilitator,” Muff said. “He’s a true point guard. We’re going to look for him to improve his play and build on what he did last year. \"[Josiah] Gustafson spent the late summer and early fall working hard getting himself back into the shape, getting the ball back in his hands and recovering from his injury.” The Gorillas will also welcome back seniors Denton Hays, Lamine Dieng and junior Trevor Gregory. “Inside the paint, we've got big returners in Lamine, Denton Hayes and Trevor Gregory. Those guys are rock solid for us,” Muff said. Pittsburg State will start the season with on Wednesday Nov. 4 at Kansas University for an exhibition. The Gorillas will begin the regular season on Nov. 13 in Joplin, Missouri by participating in the MIAA.NSIC Classic, facing Minnesota State Mankato. PSU will face St. Cloud State on Saturday, Nov. 14. The Gorillas’ home opener will take place on Thursday, Nov. 19 at John Lance Arena against William Jewell. Michael Bauer is a sports reporter for the Pittsburg Morning Sun. E-mail him at mbauer@morningsun.net and follow him on twitter at @michaeljohn391. By Michael Bauer", "external_links": [], "published": "2015-10-22T05:47:00.000+03:00", "crawled": "2015-10-22T14:26:29.422+03:00", "highlightTitle": ""}