{"organizations": [], "uuid": "6a7bca127cd17a6072b06bbf5d4e8840e9e339ea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "http://wncontent.images.worldnow.com/images/4482045_G.jpg", "site_section": "http://www.cbs8.com/category/38907/childrens-health-news", "section_title": "Children Health: Vaccinations, school, sports, autism, learning - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30308106/study-says-tdap-vaccine-safe-during-pregnancy", "country": "US", "title": "Study says Tdap vaccine safe during pregnancy", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Study says Tdap vaccine safe during pregnancy - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T22:52:00.000+03:00", "replies_count": 0, "uuid": "6a7bca127cd17a6072b06bbf5d4e8840e9e339ea"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30308106/study-says-tdap-vaccine-safe-during-pregnancy", "ord_in_thread": 0, "title": "Study says Tdap vaccine safe during pregnancy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(HealthDay News) -- Even if a woman gets a tetanus-containing shot before she conceives, it is still safe to give her the tetanus-containing Tdap vaccine while she is pregnant, new research indicates.\nAs it stands, federal guidelines state that the Tdap vaccine, which also guards against diphtheria and pertussis (whooping cough), is recommended for every woman during every pregnancy.\nHowever, there has been a lack of research on the safety of giving the vaccine during pregnancy, the researchers noted. And some women have often balked at the recommendation.\n\"Pregnant patients are often reluctant to take medications, especially vaccinations,\" explained Dr. Jennifer Wu, an obstetrician/gynecologist at Lenox Hill Hospital in New York City, who was not involved with the study. \"Recent recommendations for Tdap vaccines are often met with resistance from patients. Some of the foremost concerns are safety to the fetus, and also safety to the mother, if she has had this vaccination in the past.\"\nBut the new study should help put those fears to rest, the researchers said.\n\"Our findings should reassure patients and clinicians who might be hesitant to give Tdap vaccine to pregnant women who recently received a Tdap or other tetanus-containing vaccination,\" wrote study author Dr. Lakshmi Sukumaran, from the U.S. Centers for Disease Control and Prevention, and colleagues.\nAnother expert concurred.\n\"The vaccination can be given at any time during pregnancy as it is not a live vaccine,\" said Dr. Tracy Adams, a maternal-fetal medicine specialist at Winthrop-University Hospital in Mineola, N.Y. \"This study adds to the growing body of evidence that suggests the safe use of inactivated virus or bacterial vaccines or toxoids in pregnancy in order to prevent disease in both mother and child.\"\nMeanwhile, the Tdap vaccine protects against whooping cough, which has increased in prevalence over the past decade in the United States, the researchers pointed out. And newborns and infants are more likely to be hospitalized or die from whooping cough than older children and adults.\nIn the study, the researchers analyzed data from more than 29,000 women who received Tdap in pregnancy in California, Colorado, Minnesota, Oregon, Washington and Wisconsin. They compared outcomes among those women who had received a tetanus-containing vaccine less than two years before pregnancy, two to five years before pregnancy and more than five years before pregnancy.\nRegardless of how long it had been since the women last received a tetanus-containing vaccine, there were no significant differences in rates of fever, allergy or local reactions among mothers or in rates of small for gestational age, premature birth and low birth weight among infants.\nThe study authors added that further research is needed to determine if giving Tdap vaccine to pregnant women who recently received a tetanus-containing vaccine increases the risk of stillbirth or miscarriage.\nThe study was published Oct. 20 in the Journal of the American Medical Association .\nMore information\nThe U.S. Centers for Disease Control and Prevention has more about the Tdap vaccine .\nCopyright ", "external_links": ["http://www.cdc.gov/vaccines/hcp/vis/vis-statements/tdap.html", "http://images.worldnow.com/Revenue/images/275529_G.jpg", "http://www.healthday.com/"], "published": "2015-10-20T22:52:00.000+03:00", "crawled": "2015-10-20T22:27:45.731+03:00", "highlightTitle": ""}