{"organizations": [], "uuid": "0b36c2d3367f461d0f3258f8fb4d618fd0cc0ebd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nytimes.com", "main_image": "http://static01.nyt.com/images/2015/10/06/sports/06soccerwatch/06soccerwatch-facebookJumbo.jpg", "site_section": "http://www.nytimes.com/services/xml/rss/nyt/Sports.xml", "section_title": "NYT &gt; Sports", "url": "http://www.nytimes.com/2015/10/06/sports/soccer/live-and-kicking-soccer-games-to-watch-this-week.html", "country": "US", "title": "Live and Kicking: Soccer Games to Watch This Week", "performance_score": 1, "site": "nytimes.com", "participants_count": 1, "title_full": "Live and Kicking: Soccer Games to Watch This Week - The New York Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T00:09:00.000+03:00", "replies_count": 0, "uuid": "0b36c2d3367f461d0f3258f8fb4d618fd0cc0ebd"}, "author": "Andrew Das", "url": "http://www.nytimes.com/2015/10/06/sports/soccer/live-and-kicking-soccer-games-to-watch-this-week.html", "ord_in_thread": 0, "title": "Live and Kicking: Soccer Games to Watch This Week", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " This week includes the start of the latest international soccer break. That is good news at Liverpool, which can use the time off to hire a manager and figure out just exactly what it is they’re doing , and at Chelsea, where things cannot get much worse. Or can they ?\nWorld Cup Qualifying The 2018 qualifying cycle in South America, an 18-game slog that will not end until November 2017, kicks off Thursday. The highlight of Matchday 1 is Brazil’s visit to Chile (7:30 p.m., Eastern time, beIN), but do not look for Neymar in it: He is still suspended from an incident during his last game in Chile . In fact, Neymar will miss Brazil’s first two qualifiers as he serves the remainder of that four-match ban.\nEuro 2016 Liverpool Fires Manager Brendan Rodgers OCT. 4, 2015 Success Is No Longer Foreign to East Timor, but the Players Are OCT. 1, 2015 FIFA Bars Jack Warner, a Former Executive, From Soccer Activities SEPT. 29, 2015 Coca-Cola, Visa, McDonald’s and Anheuser-Busch Call On FIFA’s Sepp Blatter to Resign OCT. 2, 2015 The final 15 qualifiers and the eight playoff spots for next year’s tournament in France will be determined over the current break (the top two finishers in each group and the best third-place team qualify directly). Among those close enough to taste it: Germany, which will claim a spot as long as it does not lose in Dublin on Thursday (2:45 p.m., ESPN), and Portugal, which also leads its group. Portugal faces the same math as the Germans — just don’t lose — when it hosts second-place Denmark in Braga on Thursday (2:45 p.m., ESPN Deportes).\nWales must wait until Saturday to claim its first-ever place in the Euros; it needs only a tie at Bosnia and Herzegovina. The Netherlands, the second greatest team in the world and one you should consider. ... Oh, never mind. The Dutch have to climb over Turkey to get into a November playoff; that will not be easy and they’ll need some help .\nThe Concacaf Clásico You may have heard about this game. United States vs. Mexico at the Rose Bowl on Saturday night (9:30 p.m., Fox Sports 1). The winning team goes to the 2017 Confederations Cup in Russia, its coach celebrated as a genius tactician and motivator who preserved the nation’s honor. The losing side spontaneously combusts amid spasms of second-guessing, hand-wringing and blame. So, you know, it should be fun.\nWe’re pretty sure the pregame show started two weeks ago, but check your local listings for hyperbole in your area. And please do enjoy every minute of it.\nLoading... Go to Home Page »\nSite Index The New York Times News World U.S. Politics N.Y. Business Tech Science Health Sports Education Obituaries Today's Paper Corrections Opinion Today's Opinion Op-Ed Columnists Editorials Contributing Writers Op-Ed Contributors Opinionator Letters Sunday Review Taking Note Room for Debate Public Editor Video: Opinion Arts Today's Arts Art & Design ArtsBeat Books Dance Movies Music N.Y.C. Events Guide Television Theater Video Games Video: Arts Living Automobiles Crossword Food Education Fashion & Style Health Jobs Magazine N.Y.C. Events Guide Real Estate T Magazine Travel Weddings & Celebrations Listings & More Classifieds Tools & Services Times Topics Public Editor N.Y.C. Events Guide TV Listings Blogs Cartoons Multimedia Photography Video NYT Store Times Journeys Subscribe Manage My Account Subscribe Subscribe Times Insider Home Delivery Digital Subscriptions NYT Opinion Crossword Email Newsletters Alerts Gift Subscriptions Corporate Subscriptions Education Rate Mobile Applications Replica Edition International New York Times", "external_links": ["http://static01.nyt.com/images/2015/10/03/sports/03SOCCERweb/03SOCCERweb-thumbStandard.jpg", "http://www.youtube.com/watch?v=R53frx5bC0g", "http://static01.nyt.com/images/2015/10/02/sports/02TIMORweb1/02TIMORweb1-thumbStandard.jpg", "http://www.uefa.com/uefaeuro/qualifiers/season=2016/standings/round=2000446/group=2002428/index.html", "http://a1.nyt.com/assets/article/20151005-135251/images/foundation/logos/", "http://www.liverpoolfc.com/news/first-team/195175-liverpool-fc-part-company-with-brendan-rodgers", "http://www.theguardian.com/football/blog/2015/oct/05/liverpool-identity-brendan-rodgers-fsg-premier-league", "http://static01.nyt.com/images/2015/09/30/sports/30FIFAweb/30FIFAweb-thumbStandard.jpg", "http://static01.nyt.com/images/2015/10/05/sports/05liverpool/05liverpool-thumbStandard.jpg"], "published": "2015-10-06T00:09:00.000+03:00", "crawled": "2015-10-06T01:10:45.571+03:00", "highlightTitle": ""}