{"organizations": [], "uuid": "ef63f697e7d20b0a0b09977b2205a98f66007a6b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "http://www.bostonherald.com/sites/default/files/media/2015/10/01/100115footballjw01.jpg", "site_section": "http://bostonherald.com/sports/high_school", "section_title": "Sports: High School | Boston Herald", "url": "http://bostonherald.com/sports/high_school/2015/10/fenway_a_field_of_dreams_for_high_school_teams", "country": "US", "title": "Fenway a field of dreams for high school teams", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "Fenway a field of dreams for high school teams | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "ef63f697e7d20b0a0b09977b2205a98f66007a6b"}, "author": "Dan Ventura", "url": "http://bostonherald.com/sports/high_school/2015/10/fenway_a_field_of_dreams_for_high_school_teams", "ord_in_thread": 0, "title": "Fenway a field of dreams for high school teams", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BC High running back Steve Timmins heard the rumors about playing a football game at Fenway Park a few weeks back, but dismissed it.\nYesterday, that rumor officially became a reality.\nCaptains and coaches from the eight high school teams who were selected to play at Fenway Park received a grand tour of the facility. They spent some time in the visitors clubhouse, before heading out to the Green Monster for an extended photo session.\n“I really didn’t think we’d be here,” Timmins said. “But once we realized it was going to happen, we were all pretty excited. To be able to play a football game at a place like this is amazing.”\nBC High and Catholic Memorial will play in the nightcap (7 p.m.) on Wednesday, Nov. 25. The earlier game (4) pits two more Catholic Conference teams as Xaverian and St. John’s Prep lock horns.\n“To get a chance to play at Gillette last year and Fenway this year is great,” said Xaverian lineman Nick Allsop. “Walking down the tunnel and coming onto this field was pretty amazing.”\nHistory will be the calling card on Thanksgiving Day as the oldest public school rivalry (Needham-Wellesley) and oldest continuous high school rivlary (Boston Latin-Boston English) will be featured.\nNeedham and Wellesley will play in the first game at 9 a.m. For Roy Johan, a former Needham head coach now serving an assistant on David Duffy’s staff, the wait was 52 years in the making.\n“When I was playing at Boston University in 1963, we were supposed to play Boston College here,” Johan said. “The day before we were going to play, President (John) Kennedy was assassinated and the game was called off.”\nIn the second game, Latin and English will kick off at noon. The game will carry a little special meaning for John McDonough, who is retiring as head coach following the 2015 season.\n“This is really special for me and our kids,” McDonough said. “We practice just a few minutes away from here, so we hear the noise whenever there is a home game at Fenway. It’s a nice place to coach my last game.”", "external_links": [], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-02T10:39:06.812+03:00", "highlightTitle": ""}