{"organizations": [], "uuid": "4b8085e72ab34e6f96eabfde5a661894b8cda1b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.syracuse.com", "main_image": "http://imgick.syracuse.com/home/syr-media/width620/img/post-standard/photo/2015/09/01/18663849-large.jpg", "site_section": "http://impact.syracuse.com/sports/atom.xml", "section_title": "Syracuse & Central NY Sports", "url": "http://www.syracuse.com/buffalo-bills/index.ssf/2015/10/with_tyrod_taylor_questionable_is_ej_manuel_ready_to_step_in_for_bills_against_b.html", "country": "US", "title": "With Tyrod Taylor questionable, is EJ Manuel ready to step in for Bills against Bengals?", "performance_score": 0, "site": "syracuse.com", "participants_count": 1, "title_full": "With Tyrod Taylor questionable, is EJ Manuel ready to step in for Bills against Bengals?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T23:17:00.000+03:00", "replies_count": 0, "uuid": "4b8085e72ab34e6f96eabfde5a661894b8cda1b5"}, "author": "Matthew Fairburn | mfairburn@syracuse.com", "url": "http://www.syracuse.com/buffalo-bills/index.ssf/2015/10/with_tyrod_taylor_questionable_is_ej_manuel_ready_to_step_in_for_bills_against_b.html", "ord_in_thread": 0, "title": "With Tyrod Taylor questionable, is EJ Manuel ready to step in for Bills against Bengals?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments \nOrchard Park, N.Y. — A lot has happened since EJ Manuel last started an NFL game. Since Manuel lost his job after a demoralizing loss to the Houston Texans in Week 4 of last season, the Buffalo Bills have switched coaches, the quarterback who replaced Manuel has retired, and Donald Trump has become a leading candidate for President. \nMore than 365 days have come and gone since he was benched, and Manuel has bounced around from No. 2 to No. 3 and back to No. 2 on the Bills' depth chart. Now, with starting quarterback Tyrod Taylor listed as questionable for Week 6 with a knee injury, Manuel could find his way back onto the field. The 2013 first-round pick, who lasted only 14 games in his first stint as a starter, could get another shot to show what he can do. \nThat's rare, and he knows it. He also realizes nothing is permanent, but there's still an air of confidence about Manuel that hasn't existed in a while. Standing at his locker Friday, Manuel said he doesn't care when he gets word on if he's starting or not. He'll be ready either way. For as much as Manuel had to fix physically in his game during his time away, it's what's between his ears that needed more work. \n\"You have to believe in yourself,\" Manuel said. \"As I've gotten older, that's one thing I've learned. You have to play the whole game 60 minutes. You can't get upset if the first quarter doesn't go how you want it to. For example, last week we weren't offensively doing what we wanted to do, what we knew we were capable of, but Tyrod stayed the course and he helped out team win when it was all said and done. Having resiliency as a quarterback like that, that's what I want in myself.\" \nAll Manuel has been able to do for the last year is talk about his growth. He got a brief chance to show it in the preseason and played well. Working mostly against backups, most wrote off Manuel's play, but the Bills saw enough development to trade away veteran backup Matt Cassel two weeks into the season and promote Manuel. \n\"You know it was tough decision for this organization because, quite honestly, we were very confident in EJ Manuel,\" Rex Ryan said. \"The fact we were also confident in Matt, there's no question. It came down to the fact that we are so confident in EJ and his improvement that, you know, it was really more about that than anything else.\" \nThe Bills better hope they were right. Their choices for Sunday are rolling out a hobbled Taylor or a healthy Manuel. Manuel has been taking most of the reps with the first-team offense throughout the week, and offensive coordinator Greg Roman is confident the offense will be prepared regardless of who plays. \n\"Certainly you can't just say, 'Hey, we got this game plan for this quarterback, and this game plan for the other guy.' Cause there's 10 other guys out there too and there's only so much data space during the week for them to simulate a game plan, the adjustments, and all those other things. So I think there's gotta be a middle ground that you try to achieve and you try to tailor it to one guy — no pun intended — but at the same time that there's enough carryover that the rest of the offense can really assimilate it to a high enough level to really go out and execute it.\" \nManuel said Roman's scheme helped rebuild his confidence, and it's part of the reason he wanted to stay in Buffalo to develop. Still, it's tough to know what to expect from Manuel after so much time away. Don't tell that to second-year receiver Sammy Watkins, though. He seems sure of what the Bills will get if Manuel is under center. \n\"I think this game, he's going to come in and light it up, just because he had that time to sit and watch Tyrod make plays,\" Watkins said. \"Now he can see, 'Hey, Tyrod can make plays. I can go out and do the same.' I think he's going to have a monster game. He's really going to go out there, throw a lot of passes, make the right corrections at the line, and he'll be good.\"", "external_links": [], "published": "2015-10-16T23:17:00.000+03:00", "crawled": "2015-10-17T20:56:57.052+03:00", "highlightTitle": ""}