{"organizations": [], "uuid": "e4435dd129e153e6aa7555ddd16e1b972ed79d38", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.abqjournal.com", "main_image": "http://main.abqjournal.netdna-cdn.com/wp-content/uploads/2015/10/b01_jd_18oct_duran-e1445140509543.jpg", "site_section": "http://www.abqjournal.com/", "section_title": "Albuquerque and New Mexico News, Sports, Business and more | Albuquerque Journal News", "url": "http://www.abqjournal.com/661594/news/duran-proposes-new-campaign-finance-rules.html", "country": "US", "title": "Duran proposes new rules for campaign finance", "performance_score": 0, "site": "abqjournal.com", "participants_count": 1, "title_full": "Duran proposes new rules for campaign finance | Albuquerque Journal News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T08:02:00.000+03:00", "replies_count": 0, "uuid": "e4435dd129e153e6aa7555ddd16e1b972ed79d38"}, "author": "Deborah Baker / Journal Staff Writer", "url": "http://www.abqjournal.com/661594/news/duran-proposes-new-campaign-finance-rules.html", "ord_in_thread": 0, "title": "Duran proposes new rules for campaign finance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Even as she faces criminal charges for allegedly misusing her own campaign contributions, Secretary of State Dianna Duran is moving ahead with new rules governing campaign finance.\nDuran’s office has come up with a package of proposals – including how candidates may spend money donated to them – and has scheduled a public hearing for Friday.\nThe secretary of state has the final say on the new rules, and her office would like to have them in place before next year’s elections.\nDURAN: Faces charges of fraud for misuse of funds\nDuran’s office was already working on the package when she was charged in late August by Attorney General Hector Balderas with fraud, embezzlement and other crimes for allegedly using her campaign money for personal expenditures, including at casinos.\nDuran has pleaded not guilty and is fighting the charges. She has rejected calls to step down.\nAsked about the extent of Duran’s involvement in the new rules, her chief of staff, Ken Ortiz, said only that she “has always been supportive of efforts to clarify the intentions and requirements of the Campaign Reporting Act.”\nSome critics have said Duran should step back from the process.\nThe advocacy group ProgressNow New Mexico said that removing herself is the only way voters will be confident the rules changes “are being made honestly and with the best intentions.”\nOrtiz said the rule-making has been done under the direction of the office’s election director and that the process has been transparent.\nSome of the proposed rules were prompted by an elections bill passed in this year’s legislative session. It required the secretary of state to have a system for online voter registration by July 2017 and to make minor changes in the order of candidates on the ballot.\nOther rules have been in the works at Duran’s office for a couple of years in an effort to clarify existing law and get New Mexico in sync with federal court decisions.\nInterim Election Director Kari Fresquez said the goal is rules that help the office administer an ambiguous law and provide “a fair, consistent way to guide everyone.”\nThe rules for the Campaign Reporting Act, including what candidates can and cannot do with their campaign funds, would be the first such set of rules from the secretary of state.\nCurrently, candidates must rely on broad wording in the law, along with previous rulings from the secretary of state and the attorney general.\nThe proposed rules specify what campaign contributions cannot be used for: dues for country clubs, health clubs and recreational facilities, for example, as well as clothing, massages, medical treatments, and hair and nail treatments.\nThey also make it clear that campaign funds cannot be used for charitable donations unless the recipients are recognized as nonprofits under the federal IRS codes – so, for example, donations to funds set up locally to help a family would be out.\nThe rules say expenses attributable to a campaign, but not to personal use or personal living expenses, are permissible.\nIt’s OK to use campaign funds for campaign- or office-related legal expenses, including challenging an opponent, but not for paying fines or penalties from the secretary of state or a court, the rules say.\nCandidates have gotten in hot water for their questionable uses of campaign funds.\nThe Ethics Bureau in Duran’s office has recently been reviewing the use of campaign funds by state Rep. James Roger Madalena, D-Jemez Pueblo, for surgery expenses, clothing and help for a needy family.\nA couple of significant federal court decisions in recent years have narrowed which politically active groups must disclose their donors and which political committees are subject to contribution limits.\nLegislation has been introduced repeatedly to bring New Mexico’s law into compliance with those rulings, but it hasn’t passed.\nIn 2009, a U.S. district judge in Albuquerque said that only organizations whose major purpose is to elect or defeat a candidate can be required to register and report as a political committee.\nIn 2012, another U.S. district judge in Albuquerque, relying on the U.S. Supreme Court’s decision in the Citizens United case, said political committees that spend money independent of candidates – so-called super PACs – are not subject to contribution limits.\nBut nothing in state law or regulations defines what it means to coordinate with a candidate.\nCommon Cause New Mexico, which has submitted written comments to the secretary of state, says Duran’s proposed rules are flawed in their attempt to address the two rulings.\nThe organization contends that while some groups – labor unions or national PACs, for example – cannot be required to report as political committees, they can be told to disclose the sponsorship and financing of their ads supporting or opposing candidates or ballot measures. But the new rules don’t require that.\nThat leaves individuals and groups “free to inundate the airwaves and print media with blatant political advertising” whose financial backers would remain unknown to voters, Common Cause said.\nThe organization also said the proposed rules for coordinated expenditures aren’t tough enough. Loopholes in the rules would allow candidates to coordinate with corporations or labor unions in all types of advertising, and evade contribution limits and reporting, according to Common Cause.\nIn other written comments, former Santa Fe County Democratic Chairman Richard Ellenberg complained that the rules make it hard to raise small contributions at the grass-roots level.\nCandidates would have to report the names of all individual contributors for events that charge more than $15 admission or raise more than $1,000. Campaigns collecting many small contributions would be “overwhelmed with reporting expenses” and would lose contributions if people had to fill out forms to contribute $20, he said.\n“This rule overly burdens low-dollar, grass-roots campaigns,” Ellenberg wrote.", "external_links": ["http://main.abqjournal.netdna-cdn.com/wp-content/uploads/2015/10/b01_jd_18oct_duran-e1445140509543.jpg"], "published": "2015-10-18T08:02:00.000+03:00", "crawled": "2015-10-18T13:33:09.621+03:00", "highlightTitle": ""}