{"organizations": [], "uuid": "558e0c6c74b0919723faf054520f157db84cae53", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs2iowa.com", "main_image": "http://www.cbs2iowa.com//template/ugc/kgan/1621/QnJOFrCp.PNG", "site_section": "http://cbs2iowa.com//sports/features/sports-featured//rss.xml", "section_title": "kgan Sports Featured", "url": "http://www.cbs2iowa.com/sports/features/sports-featured/stories/Sportscast---October-5-2015-214991.shtml", "country": "US", "title": "Sportscast - October 5, 2015", "performance_score": 0, "site": "cbs2iowa.com", "participants_count": 0, "title_full": "Sportscast - October 5, 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T03:06:00.000+03:00", "replies_count": 0, "uuid": "558e0c6c74b0919723faf054520f157db84cae53"}, "author": "", "url": "http://www.cbs2iowa.com/sports/features/sports-featured/stories/Sportscast---October-5-2015-214991.shtml", "ord_in_thread": 0, "title": "Sportscast - October 5, 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sports » Sports Featured » Sportscast - October 5, 2015 Sports Featured \nUpdated: Mon, Oct 05 2015, 11:06 PM \nThe full sportscast from the Fox 28 News at 9 on Monday, October 5th. Related Stories   Ed Thomas Coach of the Week Faith, Family, Football. Words of Inspiration from the Coach Ed Thomas Foundation. CBS 2 and FOX 28 in partnership with the Eastern Iowa Airport are looking for coaches who embody the spirit of Coach Thomas by having a strong impact on the community and on the sidelines. Nominate your favorite coach from any sport in the form below. Your Name: Tell us about your nomination: Please re-enter the code shown in the image below. AP News Wires Get This \nSEX TIPS-UNIVERSITY \nMADISON, Wis. (AP) -- How to satisfy a woman isn't the sort of lesson a dorm director should be teaching. Business News \nMajor business and economic events scheduled for Tuesday: \nWASHINGTON (AP) -- A day after the Obama administration struck a trade deal with 11 other Pacific Rim countries, the Commerce Department releases international trade data for August. Science/Tech News \nIN THE NEWS: SPORTS BETTING SITES INVESTIGATED \nLAS VEGAS (AP) -- You've probably seen the ads; they are all over channels that broadcast sporting events: places where you can win money by playing fantasy teams. \nSite Map Stay Connected: \n© 2014, KGAN-TV | Portions are Copyright 2014 Associated Press. All rights reserved. This material may not be published, broadcast, rewritten, or distributed. KGAN CBS provides local news, weather forecasts, notices of events and items of interest in the community, sports and entertainment programming for Cedar Rapids and nearby towns and communities in the Corridor and throughout eastern Iowa, including Iowa City, Waterloo, Dubuque, North Liberty, Coralville, Marion, Morengo, Williamsburg, Washington, Tiffin, Tipton, Solon, Mount Vernon, Lisbon, Central City, Urbana, Independence, Manchester, Dyersville, Oelwein, Cedar Falls, Waverly, Evansdale, Guttenberg, West Union, New Hampton, Decorah, Waukon, Maquoketa, Sigourney, Fairfield, Grundy Center, La Porte City, Dysart, Fayette, Elkader, Strawberry Point and Belle Plaine.  ", "external_links": [], "published": "2015-10-06T03:06:00.000+03:00", "crawled": "2015-10-06T15:43:45.634+03:00", "highlightTitle": ""}