{"organizations": ["Ottawa Sun First", "RedBlacks"], "uuid": "0165097acea9f12b32285d247b0e03e2184eaa5f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ottawasun.com", "main_image": "http://storage.ottawasun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297757485797_LARGE_BOX.jpg?quality=80&stmp=1444956800889&size=100x", "site_section": "http://www.ottawasun.com/sports/rss.xml", "section_title": "Top Sports stories", "url": "http://www.ottawasun.com/2015/10/15/redblacks-season-so-far", "country": "CA", "title": "RedBlacks' season so far", "performance_score": 0, "site": "ottawasun.com", "participants_count": 0, "title_full": "RedBlacks' season so far", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T02:19:00.000+03:00", "replies_count": 0, "uuid": "0165097acea9f12b32285d247b0e03e2184eaa5f"}, "author": "", "url": "http://www.ottawasun.com/2015/10/15/redblacks-season-so-far", "ord_in_thread": 0, "title": "RedBlacks' season so far", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tim Baines"], "text": "RedBlacks' season so far We look back at every game in 2015 as we enter the final stretch of the year By Tim Baines , Ottawa Sun First posted: Thursday, October 15, 2015 07:17 PM EDT | Updated: Thursday, October 15, 2015 07:19 PM EDT \nOttawa Redblacks' Jeremiah Johnson is tackled by Toronto Argonauts' Ricky Foley during second quarter CFL action in Ottawa on Tuesday, Oct 6, 2015. THE CANADIAN PRESS/Sean Kilpatrick Article RedBlacks \nGAME 1 \nIn their season opener, in Montreal, the RedBlacks won 20-16. QB Henry Burris threw three first-half interceptions, but rallied his team in the second half with Jeremiah Johnson scoring from six yards out in the fourth quarter. Ernest Jackson also caught a 13-yard TD pass, while Moton Hopkins and Jovon Johnson came through with huge interceptions. The Alouettes lost QB Jonathan Crompton then his backup, Dan LeFevour, to injuries. Rookie Canadian QB Brandon Bridge finished the game. \nGAME 2 \nIn their home opener, the RedBlacks matched last season's win total, with a 27-16 decision over the Lions. Receivers Greg Ellingson, Jackson and Brad Sinopoli had touchdowns. On defence, linebacker Damaso Munoz had six tackles and a sack and Jerrell Gavins had a terrific interception. \nGAME 3 \nIn a game played in Edmonton, the RedBlacks may have played their worst game EVER. The Eskimos pounded the RedBlacks 46-17. A turning point was a bad decision to throw by Burris, which resulted in a 57-yard touchdown by Edmonton's John Ojo. A bright spot: Defensive tackle Zack Evans intercepted a pass and rumbled into the end zone from 66 yards out. \nGAME 4 \nOn home turf, in the return match, the RedBlacks came up on the wrong end of a 23-12 decision. For nearly 17 minutes to start the game, the RedBlacks didn't have a first down. Interceptions by Jerrell Gavins, Brandon McDonald and Jovon Johnson allowed the RedBlacks to stay in the game, but Burris scored his team's only touchdown on a quarterback keeper. After 10 straight sellouts, this game fell more than 2,000 fans short of a full house. \nGAME 5 \nThe RedBlacks won 29-26 over the defending Grey Cup champs, the Calgary Stampeders, in overtime. Kicker Delbert Alvarado missed a 32-yard field goal and a 32-yard convert, but hit a 34-yarder to win the game, then lost his job when Chris Milo was signed during the bye week. Burris connected on 28-of-43 passes for 389 yards. He threw TD strikes to Jackson, Ellingson and Chris Williams. Defensive end Aston Whiteside, in his RedBlacks debut, had two forced fumbles. \nGAME 6 \nThe RedBlacks got a late touchdown from Burris, who scored from a yard out after a pass interference call on Dominique Ellis, to beat the Alouettes 26-23. Burris completed 32-of-44 passes for 323 yards, while Ellingson caught eight passes for 110 yards. Chevon Walker rushed for 84 yards. Linebacker Antoine Pruneau has his first career interception. \nGAME 7 \nIn a road game that coach Rick Campbell called “ugly,” the RedBlacks fell 48-3 to the Stampeders. With regular punt returner Williams sidelined, McDonald fumbled two punts and Jovon Johnson lost another — all three leading to Calgary touchdowns. Burris wasn't sharp, completing 7-of-17 passes for 114 yards and was replaced by Thomas DeMarco to start the second half. Walker rushed seven times for 11 yards. \nGAME 8 \nIn Toronto, the RedBlacks let one get away, with the Argos winning 30-24. The RedBlacks lost a 24-17 lead in the fourth quarter, letting a Toronto drive continue after defensive back McDonald (he would get cut a couple of days later) took a 15-yard objectionable conduct penalty for yapping at Toronto receiver Vidal Hazelton, who ironically soon after scored a touchdown. Two Toronto field goals sealed the deal. Burris completed 32-of-36 passes for 426 yards. Taking over for Walker as the starting running back, Jeremiah Johnson scored two touchdowns. Defensive back Gavins scored the other Ottawa TD on an interception. \nGAME 9 \nAt TD Place, the RedBlacks beat Saskatchewan 35-13, a result that would see the Roughriders fire coach Corey Chamblin and GM Brendan Taman. Johnson rushed for 92 yards on 12 carries, scoring three touchdowns. Burris, who completed 19-of-33 passes for 269 yards, rushed for a touchdown. Maurice Price also caught a touchdown pass. The RedBlacks defence had 10 sacks — including three by Justin Capicciotti and two each by Hopkins, Keith Shologan and Munoz. \nGAME 10 \nThe RedBlacks put a stop to a 10-game (22-of-23) losing streak by Ottawa CFL teams in Vancouver, beating the Lions 31-18. An Ottawa team hadn't won in B.C. since 1990. Ottawa held the CFL's leading rusher Andrew Harris to just four yards on three carries. Milo booted five field goals for the RedBlacks, who got big interceptions from Pruneau and Jovon Johnson and a 100-yard rushing effort (on 17 carries) from Jeremiah Johnson. \nGAME 11 \nThe RedBlacks escaped with a 30-27 win in Regina. Burris fumbled twice, but gave his team a 27-24 lead with three minutes left. After a long kickoff return by Tristan Jackson, the Roughriders tied the game. The RedBlacks scored the winning points on a 14-yard Milo field goal. Milo had earlier missed a convert and a field goal. Williams caught eight passes for 137 yards. \nGAME 12 \nGoing into the game with a three-game winning streak, the RedBlacks were slow out of the gate and the Argos jumped into a 14-0 lead. Trailing 24-10 at the half, the RedBlacks couldn't recover and lost 35-26. Penalties were an issue as Ottawa got flagged 12 times for 115 yards in the first half alone. An 85-yard Chad Owens punt return for a TD was also a killer. Ellingson caught two touchdown passes, while Munoz picked off a Trevor Harris pass and ran 40 yards for a major. \nGAME 13 \nIt was the Henry Burris Show as the RedBlacks dismantled the Montreal Alouettes 39-17 at home. Burris broke a CFL record with 45 completions (on 53 attempts), taking down the mark established by Montreal's Anthony Calvillo on Oct. 4, 2008 against Hamilton. Burris threw for 504 yards before being yanked from the game and also ran for two touchdowns. Williams and Sinopoli caught touchdown passes, while Price also had a big game with nine catches for 104 yards. Milo booted three field goals and the RedBlacks also got a safety. \nGAME 14 \nIn a game that could have gone either way, the RedBlacks had their hearts broken with 25 seconds when Chad Owens made an outstanding one-handed diving catch in the end zone as the Argos won 38-35. The RedBlacks lost running back Jeremiah Johnson late in the first half with a dislocated foot and he's gone for the remainder of the season, replaced by William Powell. Ottawa got another scare with a handful of seconds on the clock when Burris went down with what looked like an injury to his throwing shoulder. He was replaced by DeMarco for the final play of the game. Burris has shrugged it off and is ready to go this week. Argos QB Harris threw five touchdown passes, but was picked off twice — by Abdul Kanneh and Gavins. The RedBlacks got TDs from Jeremiah Johnson, Ellingson and Jackson and Milo booted four field goals.", "external_links": [], "published": "2015-10-16T02:19:00.000+03:00", "crawled": "2015-10-16T05:00:18.361+03:00", "highlightTitle": ""}