{"organizations": [], "uuid": "eb75f87cc451405d5ee8ec10ddc0c00d8a50c27a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.northjersey.com", "main_image": "http://www.northjersey.com:80/polopoly_fs/1.1429624!/fileImage/httpImage/hawthorne101015.JPG", "site_section": "http://www.northjersey.com/cmlink/sports-rss.rss#", "section_title": "Sports News on NorthJersey.com", "url": "http://www.northjersey.com/sports/h-s-football-ryan-vander-werf-leads-hawthorne-s-win-over-pompton-lakes-19-14-1.1429623", "country": "US", "title": "H.S. football: Ryan Vander Werf leads Hawthorne’s win over Pompton Lakes, 19-14 - Sports", "performance_score": 0, "site": "northjersey.com", "participants_count": 1, "title_full": "H.S. football: Ryan Vander Werf leads Hawthorne’s win over Pompton Lakes, 19-14 - Sports - NorthJersey.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T03:57:00.000+03:00", "replies_count": 0, "uuid": "eb75f87cc451405d5ee8ec10ddc0c00d8a50c27a"}, "author": "ED MILLS", "url": "http://www.northjersey.com/sports/h-s-football-ryan-vander-werf-leads-hawthorne-s-win-over-pompton-lakes-19-14-1.1429623", "ord_in_thread": 0, "title": "H.S. football: Ryan Vander Werf leads Hawthorne’s win over Pompton Lakes, 19-14 - Sports", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Buy this photo JIM ALCORN/SPECIAL TO THE RECORD Hawthorne quarterback Ryan Vander Werf, right, heads down the sideline on a run in the second quarter vs. Pompton Lakes. HAWTHORNE – Quaterback Ryan Vander Werf proved to be the difference for Hawthorne in a big NJIC Liberty Division clash Friday night at Allison N. King Field.\nVander Werf, a senior, threw for one touchdown and ran for two more to lead Hawthorne past Pompton Lakes, 19-14, as the Bears scored two fourth-quarter touchdowns to break a 7-7 tie.\nWith 10:01 left in the game Vander Werf scored on a 3-yard run to cap a 65-yard, 10-play drive to give Hawthorne (4-1, 2-1) a 13-7 lead. Three minutes later, as the Bears got the ball back again, Vander Werf went 70 yards around his right end for a score to give the Bears a 19-7 lead.\nOn the night, Vander Werf carried 22 times for 183 yards. He also passed for 101 yards.\nPompton Lakes (2-2, 1-2) made it close with five minutes remaining when sophomore quarterback Kevin Cotter found junior wide receiver Nick Posimato with a 21-yard touchdown pass to cap a 72-yard, eight-play march that made the score 19-14.\nVander Werf had a big 22-yard run for a first down, but Pompton Lakes still forced a punt with 2:16 left. However, the Bears defense stopped the Cardinals on downs with less than a minute left near midfield and that was the game.\nA 38-yard touchdown run by junior Chris Grecco had given Pompton Lakes a 7-0 lead early in the third quarter after a 27-yard punt return by Will Verrico had set the Cardinals up in fine position at the Hawthorne 48-yard line.\nBut the Bears answered with a 78-yard, 12 play march to tie the game at 7 on a 19-yard touchdown pass from Vander Werf to senior split end David Mascis late in the third quarter.\nBoth teams had chances to take advantage of turnovers in the opening 24 minutes, but each defense stiffened when tested.\nHawthorne recovered two fumbles after punting the ball away to the Cardinals, but the Pompton Lakes defense was equal to the task. Pompton Lakes also recovered a fumble after booting the ball away on a punt, but the Bears defense was equally tenacious.\nPompton Lakes finally started moving the ball early in the second quarter, but it took a couple of penalties against the visitors to really get them going.\nFacing a first-and-36 from his own 40, the Cardinals’ Cotter hit Nick McDonald with a 14-yard pass, followed by a 12-yard toss to Ian Higgins. On a third-and-10 from the Hawthorne 34, Cotter found Joe Pagliaroni with a 10-yard pass down to the 24 and a first down.\nBut after another first down, Hawthorne rose up and forced a 29-yard field goal attempt by Pompton Lakes, which was short and the game was still scoreless with eight minutes left before the half.\nHawthorne then went on an extended 61-yard, 10-play drive of its own, keyed by a 19-yard run by Vander Werf and a 16-yard pass from Vander Werf to Chris Hascup.\nBut the drive stalled at the Pompton Lakes 14-yard line with 28 seconds left in the half as the teams went into halftime in a scoreless deadlock.", "external_links": [], "published": "2015-10-10T03:57:00.000+03:00", "crawled": "2015-10-10T08:37:23.594+03:00", "highlightTitle": ""}