{"organizations": ["Hawks"], "uuid": "921e5d6550574105a59423397bd71ecbd8057831", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxsports.com", "main_image": "http://a.fssta.com/content/dam/fsdigital/RSN/South/2015/04/16/PI-NBA-Hawks-Al-Horford-41615.vresize.1200.675.high.36.jpg", "site_section": "http://api.foxsports.com/v1/rss?partnerKey=zBaFxRyGKCfxBagJG9b8pqLyndmvo7UU&tag=nba", "section_title": "FOX Sports Digital", "url": "http://www.foxsports.com/nba/story/atlanta-hawks-al-horford-paul-millsap-tiago-splitter-offense-problems-preseason-102515?cmpid=feed:-sports-CQ-RSS-Feed", "country": "", "title": "Should the Hawks be worried about their offense after awful preseason?", "performance_score": 0, "site": "foxsports.com", "participants_count": 0, "title_full": "Should the Hawks be worried about their offense after awful preseason?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T04:43:00.000+02:00", "replies_count": 0, "uuid": "921e5d6550574105a59423397bd71ecbd8057831"}, "author": "", "url": "http://www.foxsports.com/nba/story/atlanta-hawks-al-horford-paul-millsap-tiago-splitter-offense-problems-preseason-102515?cmpid=feed:-sports-CQ-RSS-Feed", "ord_in_thread": 0, "title": "Should the Hawks be worried about their offense after awful preseason?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Should the Hawks be worried about their offense after awful preseason? \nAl Horford could spend even more time on the perimeter this season. Tim Fuller / USA TODAY Sports Oct 25, 2015 at 10:43p ET 0Shares \nWhen the Atlanta Hawks lost DeMarre Carroll this offseason in free agency to the Toronto Raptors, many expected the Eastern Conference finalist would take a step back on defense. Yet if the preseason is any indication, Atlanta might be in more trouble on the other end of the court as it works to fit new pieces into coach Mike Budenholzer's intricate system. \nAs noted by Kris Willis of Peachtree Hoops , the Hawks defense outperformed the offense in the preseason, and it wasn't particularly close. The defense is comfortable and confident, and it's channeling offenses to the spots that the Hawks prefer. As for the offense: Atlanta has a 93.7 offensive rating through seven games including the throwaway game in the finale against Detroit. There have been flashes, but the stretches of sustained execution that became a trademark last season have been largely absent. That is to be expected given the amount of players used by the coaching staff along with the amount of new faces that are being incorporated into the system. Atlanta is also adding new wrinkles for existing players. Al Horford went 6 for 16 from three-point range and severely reduced the amount of mid-range attempts that he took. Paul Millsap saw time at small forward in big alignments. It will be interesting to see if those trends carry into the regular season or if the experimenting ends with the preseason. \nThose big alignments could prove to be the bellwether for the Hawks this season. With the addition of Tiago Splitter , Atlanta has a little bit of a pickle. Either Horford and Millsap need to play down, in which case the Hawks are dependent on their outside shooting, or the three will have to rotate minutes at the center and power forward positions. \nAll three are talented, and it's not necessarily a bad problem to have. But Atlanta could get off to a slow start as it figures out the best way to use its frontcourt rotation. MORE NEWS: Want stories delivered to you? Sign up for our NBA newsletters. 0", "external_links": [], "published": "2015-10-26T04:43:00.000+02:00", "crawled": "2015-10-26T05:01:17.108+02:00", "highlightTitle": ""}