{"organizations": [], "uuid": "92807f279b8a6f884258d38521bac462a891a3a8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtontimes.com", "main_image": "", "site_section": "http://www.washingtontimes.com/rss/headlines/sports/", "section_title": "www.washingtontimes.com stories: Sports", "url": "http://www.washingtontimes.com/news/2015/oct/22/bucannon-at-last-listed-as-linebacker-shining-this/", "country": "US", "title": "Bucannon, at last listed as linebacker, shining this season", "performance_score": 0, "site": "washingtontimes.com", "participants_count": 1, "title_full": "Bucannon, at last listed as linebacker, shining this season", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T04:24:00.000+03:00", "replies_count": 0, "uuid": "92807f279b8a6f884258d38521bac462a891a3a8"}, "author": "BOB BAUM", "url": "http://www.washingtontimes.com/news/2015/oct/22/bucannon-at-last-listed-as-linebacker-shining-this/", "ord_in_thread": 0, "title": "Bucannon, at last listed as linebacker, shining this season", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bucannon, at last listed as linebacker, shining this season By BOB BAUM - Associated Press   \nTEMPE, Ariz. (AP) - His locker is still with the team’s defensive backs, but Deone Bucannon is almost always an inside linebacker now. \nAnd a very good one. \nThrough six games, last year’s first-round pick leads the team in tackles with 53, 14 more than the runner-up, fellow inside linebacker Kevin Minter. Bucannon has 42 solo tackles, 13 more than Minter. \nHe has been remarkably consistent: Seven tackles against New Orleans, eight (and a forced fumble) against Chicago, eight against San Francisco, nine against St. Louis, a career-high 13 against Detroit and eight against Pittsburgh. \nIn four of the six games, Bucannon has led the team or tied for the lead in tackles. \n“He’s extremely fast and physical,” Arizona coach Bruce Arians said. “When you have those combinations, like Tyrann (Mathieu), it really doesn’t matter the size of the package, if you have the passion, the speed and the physical-ness, you’ll make plays.” \nThe Cardinals seemed to have every intention of having Bucannon play safety when they chose him out of Washington State with the 27th pick of the 2014 draft. \nBut Arizona has three other talented safeties - Mathieu, Rashad Johnson and Tony Jefferson. There wasn’t a lot of room for Bucannon, other than when one of those three was hurt. He played a handful of games at safety as a rookie, but more and more as the season progressed, Bucannon found himself in the “box” alongside Minter. \nThis year, the Cardinals signed free agent Sean Witherspoon to add veteran presence to the inside linebacker position. But Weatherspoon hurt a hamstring in training camp and the coaches looked to Minter and Bucannon. Weatherspoon is healthy now, but can’t get on the field, except on special teams. \nOn the depth chart, Bucannon is listed as starting $ILB (That’s not a typo, he’s playing ‘dollar’ or “money” linebacker). \nLast year, Bucannon talked about how quickly things happened playing that close to the line of scrimmage. At safety, he had a chance to watch things unfold in front of him. \nHe may not have loved moving to a new, difficult position, but he’s not complaining. Quite the opposite. \n“I didn’t have a problem with anything,” he said. “I just wanted to get on the field. I’m in the NFL. If I get an opportunity to get on the field, I’m more than happy. That’s a dream come true for me. There’s never been negativity going wherever they want me to go.” \nBucannon is 6-foot-1, 211 pounds, big enough for a safety, awfully small for an inside linebacker. He makes up for lack of size with quickness and instinct. \n“We have a whole lot of respect for him obviously,” said Mathieu, who at 5-foot-9 knows about playing undersized and at more than one position (cornerback, safety).", "external_links": [], "published": "2015-10-23T04:24:00.000+03:00", "crawled": "2015-10-23T05:42:55.246+03:00", "highlightTitle": ""}