{"organizations": [], "uuid": "8c7059209c09622dc20c08b8e4c2cbe66e42b533", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.westword.com", "main_image": "http://images1.westword.com/imager/u/original/7197548/terrapin-care-station.jpg", "site_section": "http://www.westword.com/news", "section_title": "Denver, Colorado News: Politics, Crime, Sports, Marijuana and Education Journalism | Westword", "url": "http://www.westword.com/news/boulder-loosens-restrictions-on-towns-marijuana-businesses-7197547", "country": "US", "title": "Boulder Loosens Restrictions on Town's Marijuana Businesses", "performance_score": 0, "site": "westword.com", "participants_count": 2, "title_full": "Boulder Loosens Restrictions on Town's Marijuana Businesses | Westword", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T17:50:00.000+03:00", "replies_count": 1, "uuid": "33c07e796638ab74ca8aed4f607d7220e8f77f12"}, "author": "Michael Roberts", "url": "http://www.westword.com/news/boulder-loosens-restrictions-on-towns-marijuana-businesses-7197547#post-0", "ord_in_thread": 0, "title": "Boulder Loosens Restrictions on Town's Marijuana Businesses", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Terrapin Care Station operates separate medical and recreational dispensaries in Boulder; a new marijuana advisory group will review that rule. Ken Hamblin The Boulder City Council has decided to loosen up some of its restrictions on the town’s marijuana industry.\nDuring a meeting that went late Tuesday night, councilmembers unanimously approved an ordinance that will update Boulder’s medical and recreational codes after numerous marijuana-industry stakeholders and community members voiced their displeasure with the current system. Updates to the regulations include removing a zero-tolerance policy for regulatory violations, adding a system for hearings when fines are assessed, allowing marijuana seeds to be sold in Boulder, and letting infused-product manufacturers obtain wholesale products outside of Boulder. The changes also eliminate a deadline for medical dispensaries to convert to recreational sales or lose the privilege forever and will allow pot shops to sell an approved list of non-marijuana products, in accordance with the state-approved roster of limes, olives, trays and other items that can be sold in Colorado liquor stores.\n“We’ve evolved as a community,” Boulder City Attorney Tom Carr said in describing the changes. “We’re trying to develop something that’s reasonable and balanced for a regulatory scheme.”\nRelated Stories Boulder Scraps Protected Bike Lanes on Folsom Because Drivers Hate Them Most of the previous rules dated from five years ago, before recreational marijuana was legalized in Colorado and when there were still gray-area medical marijuana businesses and some shady characters in the mix. Now, almost three years after the vote to allow recreational sales, the council felt the industry had matured enough to relax its policy and line up more closely with the newer state regulations\n“We have an industry that’s mature. You talk to the folks around it and they’re business people,” Carr said. “Yeah, they’re committing a federal felony, but that’s not really our problem.”\nSome people felt the new ordinances don’t go far enough, though. Christopher Woods, owner of Boulder-based dispensary chain Terrapin Care Station, believes that Boulder should deal with marijuana businesses similar to the way it handles beverage licensing, which follows state guidelines with less local regulation. “I feel it’s unfair to ask the city staff and city council to dedicate their resources continually as the state rules continue to evolve,” Woods told councilmembers. “It would be like if the Boulder Police Department were asked to regulate the use of pesticides.”\nThe council agreed to set up a marijuana advisory group made up of local industry stakeholders, residents and city staff to help consider future marijuana regulation issues.\nAs of September, there were 24 marijuana dispensaries in the City of Boulder and 32 in Boulder County.\nHave a tip? Send it to thomas.mitchell@westword.com\nContact: Thomas Mitchell Follow: Westword Westword", "external_links": ["http://www.twitter.com/denverwestword", "https://www.facebook.com/DenverWestword"], "published": "2015-10-02T17:50:00.000+03:00", "crawled": "2015-10-03T04:11:42.076+03:00", "highlightTitle": ""}