{"organizations": [], "uuid": "95c34a4898b6bae1b064588aabaad6980e6d474c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dnaindia.com", "main_image": "http://static.dnaindia.com/sites/default/files/2015/10/18/386545-donald-trump-afp.jpg", "site_section": "http://www.dnaindia.com/", "section_title": "DNA India | Latest News, Live Breaking News on India, Politics, World, Business, Sports, Bollywood", "url": "http://www.dnaindia.com/world/report-911-attacks-would-never-have-happened-if-i-were-us-president-donald-trump-2136290", "country": "SG", "title": "9/11 attacks would never have happened if I were US President: Donald Trump", "performance_score": 0, "site": "dnaindia.com", "participants_count": 1, "title_full": "9/11 attacks would never have happened if I were US President: Donald Trump | Latest News & Updates at Daily News & Analysis", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T19:23:00.000+03:00", "replies_count": 0, "uuid": "95c34a4898b6bae1b064588aabaad6980e6d474c"}, "author": "Agencies", "url": "http://www.dnaindia.com/world/report-911-attacks-would-never-have-happened-if-i-were-us-president-donald-trump-2136290", "ord_in_thread": 0, "title": "9/11 attacks would never have happened if I were US President: Donald Trump", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "US presidential hopeful Donald Trump AFP photo US Republican presidential candidate Donald Trump seems to have kicked off a fresh controversy, claiming that the 9/11 terror attacks would never have happened if he had been the President.\nHe credited his belief to his extremely tough stance on illegal immigration. \"I am extremely, extremely tough on illegal immigration. I’m extremely tough on people coming into this country. I believe that if I were running things, I doubt those people would have been in the country,\" Trump said on Fox News Sunday.\n\"With that being said, I’m not blaming George W Bush. But I don’t want Jeb Bush saying, ‘My brother kept us safe,’ because September 11 was one of the worst days in the history of this country.\"\nIn turn, George W Bush's brother Jeb Bush, also a prospective Republican party candidate, on Sunday said his fellow rival Donald Trump discusses foreign policy like a reality show star and the support for the real estate tycoon will eventually wane.\n\"Trump is an actor playing the role of a presidential candidate,\" Bush said, upping the ante against the billionaire.\n\"I have grave doubts, to be honest with you,\" Bush told CNN in an interview. \"He (Trump) is not taking the responsibility, the possibility of being president of the US really seriously. Not boning up on the issues, not having a broad sense of the responsibilities of what it is to be a president,\" Bush said.\n“Look, my brother responded to a crisis, and he did it as you would hope a president would do. He united the country, he organized our country, and he kept us safe. And there's no denying that. The great majority of Americans believe that.”\n“No. I mean, so next week, Mr Trump is probably going to say that FDR was around when Japan attacked Pearl Harbor. It's what you do after that matters. And that's the sign of leadership,” Bush said.\n\"Across the spectrum of foreign policy, Trump talks about things as though he's still on 'The Apprentice',\" Jeb Bush said, making a reference to the popular US reality game show hosted by Trump. \"It gives me great concern,\" said the former Florida Governor, who is trailing behind Trump in all national polls.\nAccepting that \"Trump is a phenomenal personality,\" Bush, however, predicted that he will not succeed in winning the Republican party nomination. \"I don't think Trump is going to win the nomination. I think we are going to have a nominee that will unite the party and win the presidency,\" Bush said, adding \"when people begin to think about who's going to be president of the US, who has the judgement and the seriousness to be president, I think that his support will wane.\"\nHe also offered a rare praise for Democratic front-runner Hillary Clinton's debate performance.\n\"She did a good job in the debate, for sure. She's a smart person, no doubt about that. But every chance she had to lay out a different approach than the one we're on now, she actually doubled or tripled down on it, more taxes, more regulation, more creating barriers on people's ability to rise up,\" Bush said.\n(With inputs from PTI)", "external_links": [], "published": "2015-10-18T19:23:00.000+03:00", "crawled": "2015-10-18T21:09:32.644+03:00", "highlightTitle": ""}