{"organizations": [], "uuid": "68cb8a9e83b23bcd3ff9159bf14c2655951bc8c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "union-bulletin.com", "main_image": "http://unionbulletin.media.clients.ellingtoncms.com/img/photos/2013/08/29/UB_logo.png", "site_section": "http://union-bulletin.com/rss/headlines/sports/", "section_title": "union-bulletin.com stories: Sports", "url": "http://union-bulletin.com/news/2015/oct/13/uws-petersen-knows-what-ducks-adams-capable/", "country": "US", "title": "UW’s Petersen knows what Ducks’ Adams is capable of", "performance_score": 0, "site": "union-bulletin.com", "participants_count": 1, "title_full": "UW’s Petersen knows what Ducks’ Adams is capable of", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T19:51:00.000+03:00", "replies_count": 0, "uuid": "68cb8a9e83b23bcd3ff9159bf14c2655951bc8c3"}, "author": "Adam Jude, The Seattle Times", "url": "http://union-bulletin.com/news/2015/oct/13/uws-petersen-knows-what-ducks-adams-capable/", "ord_in_thread": 0, "title": "UW’s Petersen knows what Ducks’ Adams is capable of", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "UW’s Petersen knows what Ducks’ Adams is capable of Adam Jude, The Seattle Times Print this article Advertisement SEATTLE — As the rivalry game against Oregon approaches Saturday, Washington coach Chris Petersen said he wasn’t sure who would start at quarterback for the Ducks. But he had a pretty good guess, and he didn’t need any reminders about what Vernon Adams Jr. was capable of at Husky Stadium. Adams, sidelined for three Oregon games with a broken index finger on his right throwing hand, threw seven touchdown passes last year against the Huskies while playing for Eastern Washington. No quarterback has ever thrown that many touchdowns against UW. Petersen was asked Monday if he would peek at the film of Adams from that narrow UW victory over Eastern Washington. “I don’t need to peek at that,” Petersen said. “I remember it very clearly.” Clearly, the Ducks (3-3, 1-2 Pac-12) could use Adams, who transferred from EWU this summer under the NCAA’s fifth-year graduate exception. Adams then broke his finger in Oregon’s season opener against EWU. Without Adams, Oregon has rotated two quarterbacks, Jeff Lockie and Taylor Alie. The Ducks lost to Utah, 62-20, on Sept. 26, and lost to Washington State, 45-38, in double overtime Saturday. The Huskies (3-2, 1-1 Pac-12), coming off an upset of USC, are a 1½-point betting favorite over the Ducks, believed to be the first time that has happened since 2003. Petersen, however, said he isn’t buying into the idea that the Ducks are down. “If our team for one second thinks this is like a different Oregon program, I know what’ll happen, and it won’t be good,” he said. Victor out for first half Based on his tone and his body language, Petersen wasn’t at all pleased with the targeting call that went against UW sophomore linebacker Azeem Victor in the fourth quarter against USC. Petersen wasn’t going to go beyond that, though, in expressing his displeasure about the call. The Pac-12 can issue fines to coaches who criticize officiating. “I can’t say anything. That’s the bottom line,” he said. “You guys have seen it and it is what it is. I know what your opinion is. I know what everybody’s opinion is. It is what it is.” Victor will also have to sit out for the first half against Oregon. Replays of the play appear to show that Victor’s helmet made contact with the shoulder of USC’s Cody Kessler, not with Kessler’s helmet. The Pac-12 office does not review targeting penalties, a process that Petersen would like to see changed. “I would really hope so, that it would get looked at,” he said. Feeney is Pac-12 player of the week Senior Buck linebacker Travis Feeney, for the first time in his career, has been named the Pac-12 defensive player of the week after posting 3.5 tackles for loss, including 2.5 sacks, against USC. “Travis is a really good athlete … and still learning the nuances of that position,” Petersen said. “But he’s obviously gaining weekly. When he’s on, he’s as good as anybody out there.” Petersen said there were a handful of Huskies who could’ve earned that recognition this week. And, in fact, it was another player — not Feeney — who earned the team’s defensive player of the week honors: cornerback Darren Gardenhire. A sophomore from Long Beach, Calif., Gardenhire intercepted Kessler on the game’s first drive. He nearly intercepted another pass later in the game. “Those are some tough guys to cover now (at USC). And he was covering them,” Petersen said. “… So I think he’s starting to settle down and really see things for what they are.” Note • Several thousand tickets remain for Saturday night’s UW-Oregon game, which could be the first sellout at Husky Stadium since the 2013 Apple Cup. In UW’s three September games, the average attendance of 58,513 was down 9 percent from 2014.  ", "external_links": [], "published": "2015-10-13T19:51:00.000+03:00", "crawled": "2015-10-14T11:21:48.921+03:00", "highlightTitle": ""}