{"organizations": [], "uuid": "84c2f8b4d06f9a3802e8be0608a8e2b19c74fd71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.timesreporter.com", "main_image": "http://www.timesreporter.com/storyimage/OH/20151014/SPORTS/151019733/AR/0/golf.jpg", "site_section": "http://www.timesreporter.com/sports?template=rss&mime=xml", "section_title": "Sports - Times Reporter", "url": "http://www.timesreporter.com/article/20151014/SPORTS/151019733/2000/NEWS?rssfeed=true", "country": "US", "title": "High school sports report: Dover headed to state tourney", "performance_score": 0, "site": "timesreporter.com", "participants_count": 1, "title_full": "High school sports report: Dover headed to state tourney", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T08:36:00.000+03:00", "replies_count": 0, "uuid": "84c2f8b4d06f9a3802e8be0608a8e2b19c74fd71"}, "author": "Times-Reporter staff report", "url": "http://www.timesreporter.com/article/20151014/SPORTS/151019733/2000/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "High school sports report: Dover headed to state tourney", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Oct. 14, 2015 at 12:36 AM By Times-Reporter staff report Posted Oct. 14, 2015 at 12:36 AM The Dover Tornadoes, who won the Division II state title a season ago, will get a chance at a title in Division I next week as they earned the last qualifying spot with a team score of 324 at the district tournament at The Legends of Massillon on Tuesday. Katlyn Shutt led the way for the Tornadoes with a 74 as she shot a 37 on the front nine and a 37 on the back nine. Mackenzie Dale added a 77 (37-40) while Allison Mills carded an 83 (42-41) and Alexis Wilkinson a 90 (44-46) to round out the scoring. Fifth player Tatum Symons had a 96 (44-52). “Survive and advance,” said Dover head coach Eric Adams. “Getting fifth place is as good as the first spot right now. We feel we can do better and that our best golf is yet to come.” The Tornadoes will play next Friday and Saturday at the Ohio State University Gray Course in Columbus. GlenOak won the district title on a fifth-player score. Both the Golden Eagles and Avon carded a 318, while Green posted a 321 for third and Jackson was fourth at 323. VOLLEYBALL • Alexis Gilland and Sydney Gilland combined for 28 kills and 32 points, while teammate Maggie Dominick added 24 assists as Central Catholic (16-5, 14-1) dominated Hiland 25-2, 25-4, 25-11 in an Inter-Valley Conference contest. • Laura Crawford recorded 21 kills, 18 digs, 10 points and three aces as Ridgewood (18-3, 14-1) earned a 25-16, 25-18, 25-15 win over visiting Strasburg. The Tigers were led by Maria McGrath with 11 assists and Lauren Allensworth with 10 digs. • Caitlin Clarke had 21 kills and Aleena Robinson added 37 assists as Claymont earned a hard-fought 25-19, 25-21, 25-23 win over New Philadelphia. Taryn Davis led New Phila (16-5, 9-3) with 23 assists, eight points and three blocks. • Sawyer Campbell had 17 points and 10 assists and Megan Cercone added 11 points as Dover dominated Rosecrans 25-7, 25-4, 25-9 to improve to 8-13 overall. • Sara Loomis recorded 11 points, 15 kills, eight blocks and 12 digs and Carrie Meenan added 19 assists as Malvern downed East Canton 25-22, 25-15, 25-13 to improve to 16-5 overall and 11-4 in the IVC. • Sadie Green had 12 points and MiKayla Poole added 16 assists as Carrollton downed Minerva 25-15, 25-21, 25-13 to improve to 10-10 overall and 8-5 in the Northeastern Buckeye Conference. • Tusky Valley knocked off host Indian Valley 25-27, 25-14, 25-18, 25-13 in Principals’ Athletic Conference play. Taylor Williams had nine points, seven kills and 21 digs to help the Braves’ effort. • West Holmes improved to 15-3 overall and 10-3 in the Ohio Cardinal Conference with a decisive 25-6, 25-12, 25-8 win over Wooster. BOYS SOCCER Page 2 of 2 - Coshocton defeated St. Clairsville 3-1 as Conner Roahrig, Ben Batchelor and Austin Wheeler tallied for the Redskins. • Zach Buchanan scored the lone goal for West Holmes as the Knights fell in overtime to Orrville 2-1 in the Ohio Cardinal Conference tournament. By Times-Reporter staff report", "external_links": [], "published": "2015-10-14T08:36:00.000+03:00", "crawled": "2015-10-14T10:50:31.278+03:00", "highlightTitle": ""}