{"organizations": [], "uuid": "64bb919a7adc0c1e8c86e678ece881b1e759f071", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.themalaymailonline.com", "main_image": "http://www.themalaymailonline.com/uploads/articles/2015-10/football_20151013_euro_spain_David_de_Gea.jpg", "site_section": "http://www.themalaymailonline.com/feed/rss/sports\r", "section_title": "The Malay Mail Online | Sports", "url": "http://www.themalaymailonline.com/sports/article/de-gea-inspired-spain-second-stringers-deny-ukraine", "country": "MY", "title": "De Gea-inspired Spain second stringers deny Ukraine", "performance_score": 0, "site": "themalaymailonline.com", "participants_count": 0, "title_full": "De Gea-inspired Spain second stringers deny Ukraine", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:45:00.000+03:00", "replies_count": 0, "uuid": "64bb919a7adc0c1e8c86e678ece881b1e759f071"}, "author": "", "url": "http://www.themalaymailonline.com/sports/article/de-gea-inspired-spain-second-stringers-deny-ukraine", "ord_in_thread": 0, "title": "De Gea-inspired Spain second stringers deny Ukraine", "locations": ["Spain", "Ukraine"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "De Gea-inspired Spain second stringers deny Ukraine Tuesday October 13, 2015 Print Article \nWhen all Spain’s defence seems breached, there is David de Gea (right), here putting his foot forward to save against Ukraine’s Ruslan Rotan. — Reuters pics KIEV, Ukraine, Oct 13 — Spain ended Ukraine’s hopes of automatic qualification for Euro 2016 as Mario Gaspar’s solitary goal on his international debut handed the European Champions a 1-0 win in Kiev yesterday. \nCesc Fabregas missed a penalty on his 100th cap, but Spain were grateful for a fantastic goalkeeping display from David de Gea to seal an eighth consecutive win in Group C. \nSlovakia’s 4-2 win over Luxembourg ensured they qualify for next year’s finals in France in second place. \nUkraine finished third and will now face a two-legged playoff in November to try and make it through. \n“I always try to do my best and today I played well, but the most important thing was to win,” De Gea told Television Espanola. \nDe Gea has had to wait for his opportunities in the national team despite stunning performances for Manchester United in the past two seasons, but his latest display will only add to the call for Vicente del Bosque to start him ahead of captain Iker Casillas at the finals next June. \n“I have to compete as best I can. Today I had some luck, but I need to continue playing like this,” added De Gea. \nDel Bosque made 10 changes to the side that sealed their place in France with a 4-0 win over Luxembourg on Friday, with only Fabregas keeping his place. \nUkraine had plenty of opportunities to take advantage of an inexperienced Spanish back four that had just 11 caps between them prior to kick-off, but a combination of some poor finishing and De Gea kept the hosts at bay. \nDe Gea was called into action for the first time as he turned Kravets’s shot from a narrow angle behind before somehow turning Rotan’s volley over the bar with an outstretched leg on 15 minutes. \nMario Gaspar (left) celebrates his goal with team mate Isco. However, the hosts were caught out by a wonderful move from the visitors five minutes later to open the scoring as Nolito and Thiago Alcantara exchanged passes and the latter marked his first international appearance for 19 months with a lovey cross for Gaspar to head home. \nDel Bosque’s men had a great chance to double their lead moments later when Fabregas was brought down by Oleksandr Kucher inside the area. \nHowever, Spain’s captain for the evening couldn’t convert from the spot as Andrey Pyatov flew to his left to pull of a fine save. \nDe Gea denied Kravets twice more before the break and Denys Garmash headed over from point-blank range as Ukraine piled forward in the search of an equaliser. \nYet, they were nearly caught on the break when Nolito placed his shot too close to Pyatov with the goal at his mercy. \nChelsea boss Jose Mourinho was in the crowd reportedly keeping an eye on Dynamo Kiev winger Andriy Yarmolenko ahead of the English champions clash with the Ukrainians next week. \nAnd Yarmolenko came alive at the start of the second period as he smashed a shot off the outside of the post. \nSpain should have sealed all three points when Paco Alcacer was denied by Pyatov after brilliant skill by Isco and Thiago to set up the Valencia man and Nacho was penalised for a foul on Yarmolenko before Mikel San Jose smashed home the rebound. \nHowever, De Gea had to come to his side’s rescue again with brilliant saves from Garmash and Oleksandr Zinchenko’s late volley to seal a frustrating night for the hosts. — Reuters", "external_links": [], "published": "2015-10-13T03:45:00.000+03:00", "crawled": "2015-10-13T03:55:43.351+03:00", "highlightTitle": ""}