{"organizations": [], "uuid": "670865edc4bbc13625fc4e60099f244bc4e1fdfd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/49302174.cms", "site_section": "http://timesofindia.indiatimes.com/rssfeeds/4719148.cms", "section_title": "The Times of India Sports: Extensive sports coverage, key statistics and free downloads", "url": "http://timesofindia.indiatimes.com/sports/boxing/Boxer-Dheeraj-Rangi-wins-silver-at-World-Military-Games/articleshow/49302167.cms", "country": "IL", "title": "Boxer Dheeraj Rangi wins silver at World Military Games", "performance_score": 0, "site": "indiatimes.com", "participants_count": 2, "title_full": "Boxer Dheeraj Rangi wins silver at World Military Games - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T21:48:00.000+03:00", "replies_count": 1, "uuid": "b02ddc0635aff0853c39a0ebc9afc8e998751c9c"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/sports/boxing/Boxer-Dheeraj-Rangi-wins-silver-at-World-Military-Games/articleshow/49302167.cms#post-0", "ord_in_thread": 0, "title": "Boxer Dheeraj Rangi wins silver at World Military Games", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MUMBAI: Lightweight (60 kg) boxer Dheeraj Rangi on Saturday secured the silver medal in the World Military Games being held in Mungyeong, South Korea. \n\nThe 20-year-old Indian fighter went down to Algeria's Yahia Abdelli in the gold medal bout and settled for second place, the lone Indian boxer to do so in the Games, said a media release from JSW Sports which supports him. \n\nIndia won four medals in all in boxing at these games. Mohammed Husamuddin, Devanshu Jaiswal and Narendra Berwal claimed bronze medals. In the final, Rangi fought valiantly even though he sustained a severely bruised hand in the opening minute of the bout. Ultimately, the Algerian prevailed by a 3-0 verdict in a fight that was much closer than what the scoreline suggested. \n\nRangi, who defeated boxers from Tanzania, Cameroon, Germany and Kazakhstan enroute to the final of the lightweight category, said he was disappointed to miss out on the gold medal. \n\n\"I was in really good rhythm all through the competition. In the first three rounds, I managed unanimous victories and they gave me a lot of confidence. Even today I was very confident of coming out on top against the Algerian however the hand injury that I sustained hampered my approach,\" he said. \n\nA native of Haryana, the youngster trains at the Army Sports Institute (ASI) in Pune and has been a part of JSW's Sports Excellence Program (SEP) for the past two years. Stay updated on the go with Times of India News App. Click here to download it for your device.", "external_links": [], "published": "2015-10-10T21:48:00.000+03:00", "crawled": "2015-10-10T20:30:26.444+03:00", "highlightTitle": ""}