{"organizations": ["Penn State", "OSU"], "uuid": "eea4daa48be0a3b117cdd1071a65a1f29ccd4df7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.vindy.com", "main_image": "http://media.vindy.com/content/image/a/5/logo/v5logo.gif", "site_section": "http://www.vindy.com/rss/headlines/sports-local", "section_title": "Vindy.com stories: Local Sports", "url": "http://www.vindy.com/news/2015/oct/17/osu-vs-psu-nassib-a-match-for-bosa/", "country": "US", "title": "Penn State’s Nassib a match for OSU’s Bosa", "performance_score": 0, "site": "vindy.com", "participants_count": 0, "title_full": "Penn State’s Nassib a match for OSU’s Bosa", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T07:00:00.000+03:00", "replies_count": 0, "uuid": "eea4daa48be0a3b117cdd1071a65a1f29ccd4df7"}, "author": "", "url": "http://www.vindy.com/news/2015/oct/17/osu-vs-psu-nassib-a-match-for-bosa/", "ord_in_thread": 0, "title": "Penn State’s Nassib a match for OSU’s Bosa", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Nassib"], "text": "Published: Sat, October 17, 2015 @ 12:00 a.m. \nAssociated Press \nColumbus \nPenn State knows all about Joey Bosa, the Ohio State defensive end whose game-ending sack against the Nittany Lions last year wrapped up an overtime victory for the Buckeyes in Happy Valley. \nBosa was the Big Ten defensive player of the year and an All-American in 2014, but the best pass rusher in the Big Ten so far this season will be playing for the visiting team when Penn State (5-1, 2-0 Big Ten) meets No. 1 Ohio State (6-0, 2-0) tonight. \nPenn State’s Carl Nassib leads the nation with 10 sacks and the Nittany Lions are tops as a team with 25 sacks. \nNassib was a walk-on best known as the brother of former Syracuse quarterback and current New York Giants backup Ryan Nassib when he got to Penn State as a 220-pound linebacker. Now at 277 pounds, the 6-foot-7 defensive end looks and plays a lot like Bosa (6-6, 275), a highly touted recruit who has 221/2 sacks in two-plus seasons. \nPenn State coach James Franklin noted Bosa had played 329 plays in five games and Nassib had played 280 in six this year. \n“Everybody that plays Ohio State is concerned about Bosa,” Franklin said. “He’s got a lot of attention, he’s on a lot of awards lists and deservedly so. But I think if you’re just talking about efficiency and production based on plays, number of plays of tackles for loss, sacks, things like that, I think you can make the argument Carl Nassib is in a similar discussion.” \nBosa got his first full sack last week against Maryland, but sacks don’t tell the whole story. \n“I think I’m getting to the quarterback a lot,” Bosa said. “Maybe not bringing him down, it’s been pretty annoying getting there so many times and not coming up with the sack or the sack and a half, whatever it is. I think I’ve been playing well.” \nBosa’s take down of Christian Hackenberg to end Penn State’s last possession in double-overtime last year was one of the most memorable plays in one of the most memorable games of what turned out to be a championship season for the Buckeyes. \nHere’s what else to watch for when Ohio State plays Penn State, trying to extend its winning streak to 20 games: \nTWO-QUARTERBACK SYSTEM \nOhio State coach Urban Meyer might have finally found a formula that works with quarterbacks Cardale Jones and J.T. Barrett last week. Jones played the big part of the field and Barrett played in the red zone. \nIs this the plan going forward? \n“I think so, but I’m not writing it in Sharpie yet,” Meyer said. \nIt worked great against Maryland. Jones had his best game of the season and Barrett scored three touchdowns. Penn State’s defense, ninth in the country in yards per play allowed (4.23), is much tougher. \nON THE GROUND \nOhio State star Ezekiel Elliott has 11 straight 100-yard rushing games and is second in the conference at 139.2 yards per game. \nPenn State is still searching for a go-to back and consistent running games. The Nittany Lions are 12th in the Big Ten in rushing at 157.3 yards per game and seventh in yards per rush at 4.53. \nFreshman Saquon Barkely seemed to be emerging as Penn State’s top tailback, but injured his right ankle and foot against San Diego State and has missed the last two games. His status for Ohio State is uncertain. \nBLACK OUT \nOhio State players will wear all-black uniforms and helmets, a first, and the school is encouraging fans to wear black for a Black Out at Ohio Stadium. Other stories of interest", "external_links": [], "published": "2015-10-17T07:00:00.000+03:00", "crawled": "2015-10-17T13:22:29.394+03:00", "highlightTitle": ""}