{"organizations": [], "uuid": "1cce6fa622a9d8ea7f157ce58395ceb81a4bd091", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "savannahnow.com", "main_image": "http://savannahnow.com/sites/default/files/images/sms-default-facebook-share.jpg", "site_section": "http://savannahnow.com/", "section_title": "savannahnow.com | Savannah Georgia's source for News, Entertainment, Sports, Weather, Classifieds, Jobs, Autos, Real Estate and St. Patricks Day", "url": "http://savannahnow.com/opinion/2015-10-13/letters-editor-wednesday", "country": "US", "title": "Letters to the editor Wednesday", "performance_score": 0, "site": "savannahnow.com", "participants_count": 5, "title_full": "Letters to the editor Wednesday | savannahnow.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T18:27:00.000+03:00", "replies_count": 4, "uuid": "1cce6fa622a9d8ea7f157ce58395ceb81a4bd091"}, "author": "DispatchDaemon", "url": "http://savannahnow.com/opinion/2015-10-13/letters-editor-wednesday", "ord_in_thread": 0, "title": "Letters to the editor Wednesday", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Now we can come home in peace — and victory\nAllen Harvey is a good man — a patriot, a Marine and a respected Vietnam veteran in the local area. I respect him as a fellow veteran, a brother and an advocate of a strong American military presence worldwide.\nWe were not allowed to win the Vietnam War politically, as Harvey so eloquently reflects in the article “State to honor Vietnam vets” on Oct. 7. Some were not allowed to savor and openly take pride in their active service in the Vietnam War. Some were treated poorly upon returning from Vietnam — but not me.\nI proudly wear and display my Vietnam Campaign Medal, Vietnam Service Medal, RVN Gallantry Cross and my Air Medal, reflecting volunteer military service “in-country” totaling more than 27 months. It’s becoming rare to see that little green ribbon with a “1960” banner emblazoned across its face on a military uniform these days. Harvey and I can savor ours — we’ve got it!\nAnd my favorite thing to do is visit the military bases in the Lowcountry — Parris Island, Kings Bay, Fort Stewart and Hunter Army Air Field — and to mingle with and support the Marines, sailors, soldiers and airmen currently serving in our great military forces. Some of these troops have it much worse than Harvey and I ever did, so they need our understanding and support as big brothers.\nAn argument can be made that we should have never been in a ground war in Vietnam at all after World War II. But we supported France in its failed effort to re-establish the French Indochina colonial empire up until their defeat at Dien Bien Phu in 1954. I still wonder why we were there. I guess I always will.\nI’ve made peace with Vietnam, the Vietnamese immigrants and their descendants living here. Some of our finest American citizens are Vietnamese, so now Harvey and I can come home in peace — and victory.\nMICHAEL W. REA\nSavannah\nIt’s time for Bushes, Clintons to step aside\nThis letter is prompted by the latest letter from Stanley Harris, Jr. that was printed on Oct. 6 (“Political dynamics — a perspective”). Mr. Harris compared attacks on Hillary Clinton with attacks on President Harry Truman in the 1948 election based on his recollection and David McCullough’s excellent biography, “Truman.”\nHarry Truman was remarkable because he did not seek the office, but once he became president he did not shy away from making tough decisions and withstood criticism, not only from Republicans, but also from members of his own party who did not like his position on civil rights, labor issues and even his humble origins and Midwest twang (having become used to the privileged patrician speech patterns of FDR).\nBut I think Truman is more remarkable for what he did not do: run for re-election in 1952. The 22nd Amendment limiting terms specifically excluded Truman. While praising Washington, Jefferson, Monroe, Madison, Jackson, Wilson and Coolidge for standing by the two-term precedent, he criticized Grant and the two Roosevelts for breaking that precedent.\nHe said, “....eight years as President is enough and sometimes too much for any man to serve in this capacity. There is a lure in power. It can get into a man’s blood just as gambling and lust for money have been known to do.”\nNow we have a Bush and a Clinton running for president. The Bush family (father and sons) have been on the national stage since 1980 — 35 years. The Clintons (husband and wife) have been on the national stage since 1992 — 23 years.\nTruman said, “This is a republic. The greatest in the history of the world. I want the country to continue as a republic. Cincinnatus and Washington pointed the way. When Rome forgot Cincinnatus its downfall began. When we forget the examples of such men as Washington, Jefferson and Andrew Jackson, all of whom could have had a continuation in the office, then we will start down the road to dictatorship and ruin.”\nI suggest it is time for the Bushes and the Clintons to step aside and let others participate in the most important office and decisions of our country. Clearly they are not the most capable our country has to offer. Perhaps they just have the most lust for power and ability to game the system. By the way, there are several countries that pass power among families — Cuba and North Korea, to name two.\nMICHAEL G CARPENTER\nSavannah\nDo the math — Is this how Tybee wants to spend its money?\nI raised three stepsons on Tybee in the late ’80s and early ’90s, and during that time Tybee was changing quickly. The island started losing more and more children around that time. So Tybee Public School closed and St. Michael’s had a much smaller enrollment. The Tybee recreation department had fewer kids for its teams and a lot of kids ended up playing on older teams in order to have enough to field a team.\nAs the ’90s progressed, the island still had a passion for opportunities for kids and talked about a pool and a gym. The pool idea sunk and eventually near 2000 a gym was built with folks scratching their heads. However, by that time, more kids were gone and it was apparent that the gym was just a big empty box on the island. Nice to have, but did not deliver the “value” promised.\nWhen the YMCA opened, it gave a little more use. More recently, the city bought a campground that had been purchased earlier from a developer that was going to change the recreation camping area to a housing complex. Of course, the city did inherit a pool with the campground.\nOver the last couple years, some adult islanders have used the campground pool for water aerobics. Their biggest complaint is that they had to pay for a lifeguard, it’s too small and the water is cold.\nSo this is where the newest toy for Tybee comes into play.\nOut of these complaints, they have formed the Tybee Community Pool committee to build a “Camelot” pool. Their website describes this complex as something any plush retirement resort would have. On the website, they offer some dollar amounts for construction and operations and make their projections — “warm and fuzzy.” But their construction estimate has already risen by approximately 30 percent in just 18 months (January 2014 through July 2015) and would easily top $1 million before construction could be completed.\nThat sure is plush!\nThey are trying to sell this complex as something for the children. Teach the children how to swim and have a place for them to stay out of trouble.\nIslanders have raised their children in the ocean, the back river and the creeks for decades. They learned to swim, surf, body surf, camp, fish and boat.\nThe bottom line is that Tybee is faced with many critical issues: overcrowding, inadequate parking, ageing infrastructure, developing a sustainable source for fresh water, etc. Is a more than $1 million “plush” pool really a top priority and the best way to spend our taxpayer dollars?\nDo the math!\nJACK BOYLSTON\nTybee Island", "external_links": ["http://sav-cdn.com/sites/all/themes/savannahnow/images/blank.gif"], "published": "2015-10-13T18:27:00.000+03:00", "crawled": "2015-10-14T20:18:00.025+03:00", "highlightTitle": ""}