{"organizations": [], "uuid": "a099414b0d5fa6c5a5108b5ecef892d197ad0029", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.recordnet.com", "main_image": "http://www.recordnet.com/Global/images/head/nameplate/fb/ca-recordnet_logo.png", "site_section": "http://www.recordnet.com/sports/high-school-sports?template=rss&mime=xml", "section_title": "High School Sports - recordnet.com", "url": "http://www.recordnet.com/article/20151015/SPORTS/151019787/101016/SPORTS?rssfeed=true", "country": "US", "title": "Stagg, McNair battle for Stockton, SJAA", "performance_score": 0, "site": "recordnet.com", "participants_count": 1, "title_full": "Stagg, McNair battle for Stockton, SJAA", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T06:22:00.000+03:00", "replies_count": 0, "uuid": "a099414b0d5fa6c5a5108b5ecef892d197ad0029"}, "author": "Thomas Lawrence Record Staff Writer", "url": "http://www.recordnet.com/article/20151015/SPORTS/151019787/101016/SPORTS?rssfeed=true", "ord_in_thread": 0, "title": "Stagg, McNair battle for Stockton, SJAA", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "HIGH SCHOOL FOOTBALL PREVIEWS: WEEK 7 Stagg, McNair battle for Stockton, SJAA Comment Posted Oct. 15, 2015 at 12:01 AM Updated Oct 15, 2015 at 10:22 PM By Thomas Lawrence Posted Oct. 15, 2015 at 12:01 AM Updated Oct 15, 2015 at 10:22 PM Game of the Week \nWho: Stagg (2-4, 1-0 SJAA) at McNair (5-1, 1-0 SJAA) \nWhen: 7:15 p.m. today \nWhere: Ronald E. McNair football stadium \nKey matchup: Stagg d... \nWho: Stagg (2-4, 1-0 SJAA) at McNair (5-1, 1-0 SJAA) \nWhen: 7:15 p.m. today \nWhere: Ronald E. McNair football stadium \nKey matchup: Stagg defensive back Cutrell Haywood has his hands full with McNair's Derrion Grim, a nationally-heralded wide receiver \nUpdates: Follow Thomas Lawrence on Twitter @RecordPreps. For scores and live updates from across the area, go to stocktonpreps.com » Social News STOCKTON — The connections between the Stagg and McNair football teams are deeper than meets the eye. McNair coach Terry Hampton, a Lincoln grad, attended Stagg his freshman year and once had an office at the school as a San Joaquin County probation officer. The Delta Kings and Eagles feature mobile, multi-talented quarterbacks and dynamic wide receivers, in shotgun spread offenses. And most importantly, both believe they’ll need to win their head-to-head matchup to be crowned San Joaquin Athletic Association champions come November. McNair (5-1, 1-0 SJAA) entertains Stagg (2-4, 1-0) in The Record’s Game of the Week at 7:15 p.m. Friday. “Everybody’s fired up for the big game. It’s basically a league championship,” Delta Kings quarterback Lavante Bushnell said. “It’s my senior year. I want to go out with a bang. I want to get this league championship for my school and everybody on my team.” Stagg junior Cutrell Haywood, a wide receiver and defensive back, feels the same. Plus, he wants the future Delta Kings to witness greatness. “Give our younger brothers a chance to shoot for a bigger goal when they come up,” Haywood said. Haywood went off last week with seven catches for 191 yards and three touchdowns in a 58-0 rout of Edison. His most vital role today may be trying to stifle the Eagles’ wide receiver corps. McNair senior Derrion Grim leads the nation with 22 touchdown receptions, according to MaxPreps.com , with 1,333 receiving yards. And senior Sean Hamilton (552 yards, nine touchdowns) is a returning first-team All-Area selection. “They have the potential to put up a lot of points,” Hampton said. “Look at the tendencies of the players you’re lined up against (on film). That will make us victorious at the end.” The man delivering the ball to Grim and Hamilton is senior quarterback Osai Brown. He’s already on the precipice of reaching his junior year total of 33 TD passes, at 2,124 yards and 32 TDs. Stagg faced dynamic offenses like McNair’s in losses to Modesto, Foothill-Pleasanton and Oakdale-McClymonds — this preseason to prepare for games like this one and its regular-season finale against Chavez. “Big game guys,\" said Delta Kings coach Don Norton, on what will determine the winner Friday. \"They’re going to show up and they’re going to make big plays. That’s the difference.\" That could mean Haywood. That could mean Grim. Or Brown. Or Bushnell. Or someone who’s trying to stop them, like Eagles senior linebacker Noah Faatau — the reigning SJAA Defensive MVP. “Their quarterback is a good scrambler,” Faatau said of Bushnell, “and I’m planning on manning up on him all game.” Said Norton: “Our kids are fired up a lot about it. You don’t get a lot of opportunities to play for a league championship.” orton added every league game is vital, yet, “maybe this one is just a touch more.” Modesto-Central Catholic (6-0, 3-0 VOL) at Manteca (6-0, 3-0 VOL), 7 p.m. Rarely does Week 7 feature a battle of unbeatens. But the Buffaloes, ranked No. 9 in CalHiSports.com’s latest state Division III rankings, and the Raiders (No. 3) have been exceptional. Manteca’s defense has been unmerciful, with three shutouts, a total of 20 points allowed and one touchdown yielded by the starters. Central Catholic has pounded its Valley Oak League opponents thus far, and has a signature win — a two-touchdown victory Sept. 11 at St. Mary’s. The returning players from the 2014 Buffaloes can take this one personal, as they lost 29-28 in overtime to the Raiders in Modesto in the VOL opener. Kimball (1-5, 0-3 VOL) at Sierra (3-3, 1-2 VOL), 7 p.m. Timberwolves coach Jeff Harbison knows his group must start winning, and now. Sierra likely needs to win three of its final four games to return to the Sac-Joaquin Section playoffs. And the Timberwolves face a Jaguars team that’s lost four consecutive games, and is tied for last in the VOL with East Union. Timberwolves running back Mark Paule Jr. has 662 rushing yards and eight touchdowns, but is coming off a career-low 27-yard performance. Oakdale (6-0, 3-0 VOL) at East Union (3-3, 0-3 VOL), 7 p.m. The Lancers are reeling after three consecutive losses to open VOL play: routs against Lathrop (35-0) and Sierra (54-28) and a heart-breaker at Weston Ranch (26-20). If recent history is a barometer, East Union's woes may continue. Oakdale has won 21 consecutive games in the series. Weston Ranch (4-2, 1-2 VOL) at Lathrop (3-3, 1-2 VOL), 7 p.m. Just as the Timberwolves are seeking an at-large bid into the playoffs, this “Battle of I-5\" could put the Cougars or Spartans on an inside track to have a shot at six victories. Lathrop coach Joe Pirillo and Weston Ranch’s Seth Davis are Manteca High graduates of 2004 and 2006, who played for Buffaloes coach Eric Reis. Bear Creek (0-6, 0-1 SJAA) at Franklin (1-5, 0-1 SJAA), 7:15 p.m. The Bruins have beaten the Yellowjackets four consecutive times, but are on a seven-game losing streak dating to last November. Bear Creek’s defense has shown it’s capable, but senior cornerback Darius Livingston is out with an ankle injury and Yellowjackets running back Jovon Woods is a scoring threat with every touch. Both teams took their lumps in their SJAA openers, as Chavez crushed Bear Creek 60-6 and McNair manhandled Franklin 72-6. Chavez (3-3, 1-0 SJAA) at Edison (0-6, 0-1 SJAA), 7:15 p.m. The Titans’ offense is clicking, and that’s bad news for the Vikings, who surrendered 58 points in an SJAA-opening loss to Stagg last week. Chavez senior quarterback Keith Dosier, a rare lefty, has completed 66 percent of his passes for 1,138 yards, 11 touchdowns and three picks. Lodi (2-4, 0-1 TCAL) at Tracy (3-3, 1-0 TCAL), 7:15 p.m. The Bulldogs’ defense shined in a 17-7, Tri-City Athletic League opening win against Tokay. And the focus will be there again, as Tracy prepares for Lodi’s Wing-T offense — led by senior quarterback Matt Meehleis and fullback Kade Piazza. Lodi suffered a gut-wrenching loss to Lincoln — 38-34 after leading by 12 through one quarter. St. Mary’s (4-2, 1-0 TCAL) at Tokay (3-3, 0-1 TCAL), 7:15 p.m. at the Grape Bowl Last season, the Rams’ defense was dominating. Oddly enough, their only shutout was a 32-0 rout of Tokay at home. The Tigers, and first-year head coach Michael Holst, have their chance for revenge at the Grape Bowl. St. Mary’s offense was unstoppable last week, as junior quarterback Jake Dunniway completed all of his pass attempts, in a 53-20 waxing of West. The Rams have won 13 consecutive games over the Tigers. That winning streak started in current coach Tony Franks’ inaugural year leading St. Mary's. West (4-2, 0-1 TCAL) at Lincoln (3-3, 1-0 TCAL), 7:15 p.m. Last October, the Wolf Pack nearly earned a signature upset over the Trojans. In that 14-6 loss, West running back Marcel Dancy was bottled up, held to 33 yards on 14 carries, with a long run of 7 yards. So Dancy, who’s season-low was 84 yards against St. Mary’s, has plenty of motivation. Lincoln has won four consecutive games over West. Gustine (6-0, 3-0 SL) at Ripon Christian (5-1, 2-1 SL), 7:30 p.m. The Knights, fresh off a 59-0 dismantling of Waterford, have senior quarterback Travis Zuidervaart (931 yards) on the brink of 1,000 passing yards. OUT-OF-AREA GAMES Brookside Christian (2-5, 1-1 CCAA) at Modesto-Big Valley Christian (5-2, 2-1 CCAA), 7 p.m., Escalon (3-3, 0-1 TVL) at Hilmar (3-3, 0-1 TVL), 7:30 p.m., Linden (1-5, 0-2 MLL) at Sonora (6-1, 3-0 MLL), 7:30 p.m., Ripon (3-3, 1-0 TVL) at Mountain House (0-6, 0-1 TVL), 7:30 p.m. — Contact reporter Thomas Lawrence at (209) 546-8272 or tlawrence@recordnet.com. Follow him atrecordnet.com/sportsblog and on Twitter @RecordPreps. By Thomas Lawrence", "external_links": [], "published": "2015-10-16T06:22:00.000+03:00", "crawled": "2015-10-16T20:23:24.692+03:00", "highlightTitle": ""}