{"organizations": [], "uuid": "0ec2a626ac3139e5def9644fe00dc487efebc9a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.duquoin.com", "main_image": "http://www.duquoin.com/storyimage/IO/20151021/SPORTS/151029840/AR/0/AR-151029840.jpg", "site_section": "http://www.duquoin.com/sports?template=rss&mime=xml", "section_title": "Sports - Du Quoin Evening Call - Du Quoin, IL", "url": "http://www.duquoin.com/article/20151021/SPORTS/151029840/2000/NEWS?rssfeed=true", "country": "US", "title": "FOOTBALL PREVIEW: Back in the playoffs, Indians get tough tune-up with Murphysboro", "performance_score": 0, "site": "duquoin.com", "participants_count": 1, "title_full": "FOOTBALL PREVIEW: Back in the playoffs, Indians get tough tune-up with Murphysboro", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T07:31:00.000+03:00", "replies_count": 0, "uuid": "0ec2a626ac3139e5def9644fe00dc487efebc9a3"}, "author": "Doug Daniels", "url": "http://www.duquoin.com/article/20151021/SPORTS/151029840/2000/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "FOOTBALL PREVIEW: Back in the playoffs, Indians get tough tune-up with Murphysboro", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "FOOTBALL PREVIEW: Back in the playoffs, Indians get tough tune-up with Murphysboro Comment   Doug Daniels Posted Oct. 21, 2015 at 12:01 AM Updated at 11:31 PM Posted Oct. 21, 2015 at 12:01 AM Updated at 11:31 PM Du Quoin, Ill. It's late October, temperatures are cooling off, the Chicago Cubs are back to losing again, and the Du Quoin Indians are back in the IHSA Football Playoffs. Things are officially back to normal. With their big win over Nashville last Friday night, the Indians will be playing postseason football for the first time since 2012, which was also the last time they won a conference championship. Around Du Quoin spirits are high, and it's no different at football practice. \"They've been excited, and at times it scares you that they might be a little too excited,\" said DHS head coach A.J. Hill. \"They're really talking about it a bunch. We've got to do a good job, and I've got to do a good job, of reminding them that we play one of the best teams in the south on Friday night. We've still got to prepare for that. It's good that they're excited and it's good for the program and everything, but we've still got to take care of business this week and try to get a win on Friday night. It could change a lot of things for us in the playoffs and where we end up going.\" The feeling is a new one for the entire current group of players, but that statement is even more true for the guys from Elverado High School. In just the second year of the DHS-EHS football co-op, players from Elverado are getting a taste of playoff football and contributing in a major way. \"They've done a good job,\" Hill said of the Elverado group. \"They're a close-knit group, especially the senior class. They've worked hard in the offseason. A lot of them are involved in a bunch of different sports. It's nice for them to see some success (in football) for the first time, win a conference championship, go to the playoffs.\" \"It's just big for the kids. None of our kids really know how to react because they've never been there before, so they're going to be excited and pumped up, especially the seniors. It's a happy medium of letting them be excited about it, but at the same time we've got to focus on Friday night. We've got to come out and put our best game out there because Murphysboro is a good football team.\" Du Quoin has won four of their last five games, losing only to Sparta in the Bulldogs' Super Bowl in week six during SIRR Mississippi Division play. The team has shown improvement in terms of limiting turnovers and putting points on the board. After scoring 14 and 18 points against tough defenses from Harrisburg and Herrin, the Indians have topped 20 points in every game since, and are now averaging just under 30 points a week which tops the conference. \"We had one of our poorest games at Sparta,\" said Hill, \"but up until that point and since then we've finished games pretty well and eliminated some mistakes. I tell them every Friday night, let's go get a team win. You're doing it not only for yourself but for the guy next to you. It's fun to see them go out there and make some plays together and not just hear a bunch of me talk and a bunch of we talk. I think that's the biggest thing, our team has bought into being in this together, it doesn't matter who is scoring touchdowns, who is making tackles, as long as it's an Indian.\" Page 2 of 3 - But if you want to talk about good offensive teams in southern Illinois, look no further than Du Quoin's week nine opponent. Murphysboro averages over 45 points per game and has looked like a juggernaut for seven of their eight contests. With weapons all over the field for the Devils, Hill says his focus has been on just doing what his team does best. \"I think you just look at your strengths,\" said Hill. \"We've just got to prepare for what we do best, and keep getting better at that. Throw in a few wrinkles, but you don't want to overload the kids, especially in week nine. You don't want kids out there thinking about where to line up, what they've got to do. It's throwing in a few wrinkles and still doing the things you do well, just making it look a little different.\" \"We don't need to get crazy. They're a good football team and we're going to have to play our best game to win on Friday night. I believe in this bunch and I know they can do it. We've had a good week of preparation and that makes a coach feel better, when you come out and your kids are focused and executing plays. We've just got to go out and do the things we do well on Friday night.\" It's hard to pinpoint exactly what the Red Devils do best on offense, because they do so many things so well. Quarterback Braden Miller has thrown for over 1,300 yards and 19 touchdowns. Running back Clay Rendleman has over 800 yards rushing and 10 touchdowns. Receivers Marshall Grammar and Kane Toliver are both in southern Illinois' top 10 in receiving yardage. \"I think the guy that makes them go is Braden Miller, their quarterback,\" Hill said. \"He does a tremendous job with that offense. He's a good passer, he looks real smooth. How well they run that offense and how smoothly it goes, he's the one making it go with the motions and all the fakes. He does a great job of hiding the ball.\" \"Rendleman is a load, but they've really got so many other weapons that it's hard to just focus on Rendleman. He's a big, strong kid, and it takes a lot of guys to tackle him, but if you just key on Rendleman they've got five other guys that can break it open at any time. It goes back to us getting pressure on Miller and making him think about it a little bit. Any quarterback, if you hit them a time or two, they start thinking about it. It makes them a little uncomfortable. I think that'll be our key to the game, getting a little pressure on him and making him think about getting hit, because he really executes and runs that offense well.\" Page 3 of 3 - On Saturday, Du Quoin will learn where they'll be headed in week ten. The IHSA Playoff Pairings Show begins at 8 p.m. and the Indians are expected to draw a road game in Class 3A, which is scheduled to be announced around 8:30 p.m. By Doug Daniels   Doug Daniels Posted Oct. 21, 2015 at 12:01 AM Updated at 11:31 PM", "external_links": [], "published": "2015-10-22T07:31:00.000+03:00", "crawled": "2015-10-22T08:47:21.752+03:00", "highlightTitle": ""}