{"organizations": [], "uuid": "cd9a2bec3fe5ecf910c19b3546766e8d7157f305", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fox8live.com", "main_image": "http://APMOBILE.images.worldnow.com/images/9021123_G.jpg", "site_section": "http://www.fox8live.com/", "section_title": "New Orleans News, Weather, Saints - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "url": "http://www.fox8live.com/story/30266132/10-things-to-know-for-friday", "country": "US", "title": "10 Things to Know for Friday", "performance_score": 0, "site": "fox8live.com", "participants_count": 1, "title_full": "10 Things to Know for Friday - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T13:50:00.000+03:00", "replies_count": 0, "uuid": "cd9a2bec3fe5ecf910c19b3546766e8d7157f305"}, "author": "cbs8", "url": "http://www.fox8live.com/story/30266132/10-things-to-know-for-friday", "ord_in_thread": 0, "title": "10 Things to Know for Friday", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By The Associated Press\nYour daily look at late-breaking news, upcoming events and the stories that will be talked about Friday:\n1. HOW OBAMA'S DECISION TO KEEP TROOPS IN AFGHANISTAN IMPACTS PRESIDENTIAL RACE\nCandidates now will be pressed to say how they will try to end the protracted conflict - and do what Obama could not.\n2. US SUSPICIONS MAY HAVE LED TO DEADLY ATTACK ON AFGHAN HOSPITAL\nAmerican special ops analysts believed the site was being used by a Pakistani operative to coordinate Taliban activity, the AP learns.\n3. LAWYER SAYS HASTERT WILL PLEAD GUILTY IN HUSH-MONEY CASE\nThe move by the ex-House speaker could ensure that allegations of sexual misconduct are never revealed in public.\n4. WHAT'S GIVING HOPE TO FAMILIES OF VICTIMS OF AIR TRAGEDY\nProsecutors say they've identified two Libyans as suspects in the 1988 bombing of a Pan Am jet over Lockerbie, Scotland.\n5. NEVADA ORDERS DAILY FANTASY SPORTS SITES TO SHUT DOWN IN STATE\nThe decision comes amid a growing backlash by regulators who contend that sites like FanDuel and DraftKings should be regarded as gambling, rather than games of skill.\n6. JEB BUSH ECLIPSED BY GOP RIVAL\nThe candidate raised $13.4 million over the summer for his Republican presidential bid - far less than political newcomer Ben Carson.\n7. DETAILS EMERGE ON ODOM'S STAY AT BROTHEL\nThe ex-NBA star spent about $75,000 for a four-day stay in a VIP suite at the Love Ranch in rural Nevada, and chose two women to accompany him.\n8. WHO'S GETTING READY TO LEAVE PRISON\nOscar Pistorius, the double-amputee Olympic runner who fatally shot his girlfriend on Valentine's Day 2013, will move to house arrest next week, South Africa's corrections department says.\n9. PLENTY OF MOISTURE PREDICTED FOR US\nEl Nino will bring a wet but not necessarily snowy winter this year to much of the country, forecasters say.\n10. VERMONT JUDGE RELEASES ACTOR RANDY QUAID, WIFE FROM CUSTODY\nThe couple say they'll now address the 5-year-old criminal charges they're facing in California.\nCopyright 2015 The Associated Press. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-15T13:50:00.000+03:00", "crawled": "2015-10-16T07:48:07.392+03:00", "highlightTitle": ""}