{"organizations": [], "uuid": "382186457a70ffa90abf2ce93bc8738e73002c6d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/j/v/i/c/z/image.related.articleLeadwide.620x349.gjvqct.png/1443348054737.jpg", "site_section": "http://www.smh.com.au/sport/us-sports", "section_title": "US Sports | American Football, Baseball, Basketball, NHL, NFL, NBA &amp; MLB", "url": "http://www.smh.com.au/sport/us-sports/jarryd-hayne-likely-to-play-for-san-francisco-49ers-against-arizona-cardinals-20150926-gjvqct.html", "country": "AU", "title": "Jarryd Hayne likely to play for San Francisco 49ers against Arizona Cardinals", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Jarryd Hayne likely to play for San Francisco 49ers against Arizona Cardinals", "spam_score": 0.0, "site_type": "news", "published": "2015-09-27T03:00:00.000+03:00", "replies_count": 0, "uuid": "382186457a70ffa90abf2ce93bc8738e73002c6d"}, "author": "Peter Mitchell", "url": "http://www.smh.com.au/sport/us-sports/jarryd-hayne-likely-to-play-for-san-francisco-49ers-against-arizona-cardinals-20150926-gjvqct.html", "ord_in_thread": 0, "title": "Jarryd Hayne likely to play for San Francisco 49ers against Arizona Cardinals", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Return to video Video settings Please Log in to update your video settings\nVideo will begin in 5 seconds.\nDon't play Play now More video Recommended Moody Mourinho makes new media vow\nWellington Phoenix player scores a wonder goal from outside the box\nSky Blues win Sydney Derby\nPhoenix edge Roar\nRWC 2015: Folau, Pocock named to face Pumas\nReplay video Return to video Video settings Please Log in to update your video settings\nJarryd Hayne: Not only Aussie making headlines Young Australian punter Michael Dickson is making the news for all the wrong reasons after his performance seemingly cost his Texas team the game.\nPT0M45S 620 349 Los Angeles: Jarryd Hayne looks set to be named in the San Francisco 49ers' 46-man squad to play the Arizona Cardinals, but a question mark hangs over the Australian.\nThe 49ers announced on Sunday morning (AEST) that running back Reggie Bush would not play against the Cardinals.\n#49ers RB Reggie Bush has been ruled OUT for #SFvsAZ . Bush will not travel with the team.\n— San Francisco 49ers (@49ers) September 26, 2015 Dealing the Cards: an injury to Reggie Bush means Jarryd Hayne is likely to get game time against Arizona. Photo: Getty Images\nWith Bush out and starting running back Carlos Hyde carrying an injury, it is likely Hayne and Mike Davis will be in the picture for more playing time.\nAdvertisement However do the 49ers have enough faith in Hayne to let him play significant minutes in a regular season NFL game?\nThe answer will come on Sunday (6.05am Monday AEST) inside the undefeated Cardinals' silver, UFO-like indoor University of Phoenix Stadium.\nIt's a perfect venue for a punt returner like Hayne, who in a jittery debut a fortnight ago dropped his first regular season punt in strong, swirling winds at the 49ers' outdoor Levi's Stadium.\nWith the 49ers' ruling out Bush and punt returner Bruce Ellington being classified as \"questionable\" for the game, the team is possibly short in the two positions Hayne plays.\nBush and Ellington sat out last week's drubbing by the Pittsburgh Steelers and starting running back Hyde was sidelined for large minutes after suffering a helmet to the thigh and a blow to his head.\nDespite the injuries to team-mates, Hayne was almost a spectator, with just one punt return for seven yards and two carries at running back for three yards.\nThe two rookies who the 49ers went to instead, running back Davis and returner DeAndrew White, were ineffective against the Steelers.\nDavis had seven carries for only 14 yards while White had one punt return for four yards.\nWith the 49ers testing Davis and White and sitting Hayne last week, perhaps the best read on how the 49ers coaches rate Hayne will be on how much they use him against the red hot Cardinals.\nHayne is in the interesting position of having the fifth biggest-selling NFL jersey, beating $100 million quarterbacks Aaron Rogers, Russell Wilson, Tony Romo and the 49ers' leader, Colin Kaepernick.\nBut, if he is a bystander in Arizona on a team where the positions he plays are depleted by injury, the 49ers obviously have doubts whether he is ready to help them in the 2015/16 season.\nHayne says he doesn't view his jersey sales as an achievement, with his focus on being a valuable member of the 49ers.\nHe hasn't courted media attention, instead attempting to avoid it, since landing in San Francisco with his focus on learning his new sport.\n\"I never set out to inspire people, I never set out to motivate people,\" Hayne wrote on Instagram.\nAAP", "external_links": ["https://twitter.com/49ers/status/647854003783491584", "https://twitter.com/hashtag/SFvsAZ?src=hash", "https://twitter.com/hashtag/49ers?src=hash"], "published": "2015-09-27T03:00:00.000+03:00", "crawled": "2015-10-24T20:26:33.354+03:00", "highlightTitle": ""}