{"organizations": [], "uuid": "0332e8254266e81316d90ccaa7889999ff743d63", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.latimes.com", "main_image": "http://www.trbimg.com/img-5616b8e6/turbine/la-sp-sn-boxing-peter-quillin-daniel-jacobs-haymon-showtime-20151008", "site_section": "http://www.latimes.com/sports/sportsnow/rss2.0.xml\r", "section_title": "Sports Now - Los Angeles Times", "url": "http://www.latimes.com/sports/sportsnow/la-sp-sn-boxing-peter-quillin-daniel-jacobs-haymon-showtime-20151008-story.html", "country": "", "title": "Boxer Peter Quillin puts business first in charting ring career", "performance_score": 0, "site": "latimes.com", "participants_count": 1, "title_full": "Boxer Peter Quillin puts business first in charting ring career", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T21:59:00.000+03:00", "replies_count": 0, "uuid": "0332e8254266e81316d90ccaa7889999ff743d63"}, "author": "Lance Pugmire", "url": "http://www.latimes.com/sports/sportsnow/la-sp-sn-boxing-peter-quillin-daniel-jacobs-haymon-showtime-20151008-story.html", "ord_in_thread": 0, "title": "Boxer Peter Quillin puts business first in charting ring career", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Boxer Peter Quillin puts business first in charting ring career Peter Quillin vs. Michael Zerafa Billie Weiss / Getty Images \nPeter Quillin after defeating Michael Zerafa on Sept. 12. \nPeter Quillin after defeating Michael Zerafa on Sept. 12. (Billie Weiss / Getty Images) Lance Pugmire Contact Reporter \nIt isn't what fight fans want to hear from boxers, but Peter Quillin takes great pride in his emphasis on a business plan. \nBusiness is what brought Quillin to powerful boxing manager Al Haymon’s stable. It’s what caused him to vacate his former World Boxing Organization middleweight belt and walk from a $1.4 million pay day against opposing promoter Top Rank’s fighter, Matt Korobov, and it’s why he’s here now. \nQuillin on Dec. 5 will have the opportunity to collect the World Boxing Assn. World middleweight title when he fights another Haymon product, champion Daniel Jacobs, in a Showtime-televised fight from Barclays Center in Brooklyn, N.Y. \n“Guys have done all these great things in boxing and we’ve seen it all before — how, when they’re done, they don’t have a penny to show for their hard work,” Quillin said. \n“That’s not what I want for myself, so I tell myself, ‘I’m going to do whatever I can in my will to make sure I’m going to be smart about my business in boxing.’ See the most-read stories in Sports this hour >> Read the story \n“For some, it’s all about the glory — and there can be glory — but you have to remember you do this as a job. There’s a lot on the line in the ring. Some guys go into that ring thinking they’re going to come out a winner and they hardly come out with their life. So it’s all fun and games until somebody gets hurt. Only then do people realize it’s not a game. I respect this about the game, and that’s why I have the aspirations and goals to give my son a better life than I have.” \nQuillin’s words are sincere, though his decision to vacate his title burns followers of the sport who expect warrior mentalities, not maneuvers motivated by a manipulated payday elsewhere. To those people the move reeked of Haymon’s desire to avoid the risk of a loss by one of his boxers to a rival promoter’s fighter, all the while orchestrating a bigger in-house fight like the one on Dec. 5. (Lance Pugmire) \nAfter balking at Korobov, Quillin proceeded to come in overweight in an April 2014 draw against Andy Lee, then returned to showcase his power Sept. 12 in a one-sided fifth-round knockout win over Michael Zerafa, who was hospitalized afterward. \nQuillin said the match against Jacobs is to prove “that I can stay undefeated, and be a worthy challenger to a guy with a belt. I don’t need to prove anything else to anybody. Everybody knows I come to give a good fight.” \nOf the result against Lee, he said, “The hardest thing to do in life is accept the things you don’t want to accept. I have a draw on my record. I need to move on. \n“This, now, is a very exciting fight and I’m game for the challenge to put on a good show.” \nRaised in Grand Rapids, Mich., Quillin now resides in Brooklyn. He’ll train in Miami with Wild Card Boxing Club assistant trainer Eric Brown. \nJacobs told The Times he expects his speed advantage to dictate the outcome. \n“I’m proven myself all-around against worthy challengers,” Quillin said. “Everybody can say what they’re good at until they step in the ring. Then all that stuff has to come together. I might not be fast, but I’m smart, I’m very defensive and I fight very hard.” \nWhen asked if his motivation, like another middleweight belt-holder, Gennady Golovkin, is to unify the division, Quillin spoke instead of money. \n“I’m going to keep on proving myself. Everyone has different roads they want for themselves,” he said. “I want to make money outside of the ring, and keep the money I make in boxing. I own five houses and want to own more. Everything I do in the ring makes my life outside the ring great. So that comes with big fights — Jacobs, ‘GGG’ [Golovkin], a rematch with Andy Lee.” \nIf harping on finances offends, so be it. Now, he said, “definitely” feels like his time. \n“To not have people respect you is hard. People look at you as a boxer just taking punches, and that’s all your worth,” Quillin said. “No. I think I’m worth way more than that. I went back to school to get my GED. I’m trying to inspire kids and bring up the … culture from complaining about what you don’t have to … you can work for what we don’t have. \n“I don’t live my life with regrets. I take every lesson as an opportunity from God himself. … Patience is important in regular life. Not being patient results in characteristics that are not truly you, anxiety, overaggressiveness. Good things come from patience. My heart is to work in patience. Like my dad said, ‘Why rush in a minute when you can lose your life in a minute?’”", "external_links": [], "published": "2015-10-08T21:59:00.000+03:00", "crawled": "2015-10-08T22:06:04.594+03:00", "highlightTitle": ""}