{"organizations": [], "uuid": "4010bf612fa7e0b4f3e4c29946e0f993fe3d0d08", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/world/us-to-sell-8-new-f-16-fighter-jets-to-pak-report/149230.html", "country": "US", "title": "US to sell 8 new F-16 fighter jets to Pak: Report", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "US to sell 8 new F-16 fighter jets to Pak: Report", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "4010bf612fa7e0b4f3e4c29946e0f993fe3d0d08"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/world/us-to-sell-8-new-f-16-fighter-jets-to-pak-report/149230.html", "ord_in_thread": 0, "title": "US to sell 8 new F-16 fighter jets to Pak: Report", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Washington, October 22\nThe US is preparing to sell eight new F-16 fighter jets to Pakistan, a media report has said ahead of Prime Minister Nawaz Sharif’s meeting with President Barack Obama today.\nAccording to a report in New York Times, the Congress was notified just days ago about the proposed sale of the additional fighters although it is not clear if the White House plans to announce the sale of the aircraft during Sharif’s trip.\nSharif landed in the US on October 20 on a state visit, and is scheduled to meet Obama today.\nThe new fighter jets would add to Pakistan’s sizable force of fighter jets which includes more than 70 F-16s and dozens of French and Chinese attack aircraft, it said.\nEarlier in April, the US State Department approved Pakistan’s request for a billion dollars worth of military hardware and equipment, identifying Pakistan as a country of vital importance for US foreign policy and national interests.\nDawn newspaper reported that in May this year, the US handed over to Pakistan over 14 combat aircraft, 59 military trainer jets and 374 armoured personnel carriers.\nThe weapons supplied to Pakistan were earlier used by American forces in Afghanistan and Iraq.\nThe report said that many in the US Congress are concerned that the F-16 jets are more useful to Pakistan in its long confrontation with India than for counterterrorism operations.\nIt is not certain whether the Congress will approve the deal.\nAccording to the report, the Congress and the US State Department are already in a standoff over an effort to sell used Navy cutter vessels to Pakistan earlier this year.\nIn March, the US House Committee on Foreign Affairs put a hold on about $150 million in foreign military financing.\nThe committee said the cutters were not essential to fighting militants, NYT Quote: d US officials as saying. — PTI", "external_links": [], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-22T14:28:42.719+03:00", "highlightTitle": ""}