{"organizations": ["Argentina Rory Best", "Argentina"], "uuid": "4824aaa62c298563a08009c655c5259d8eca09be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/eb6cd1c63799d758aca6d8062e42bd70.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/rugby/rory-best-says-ireland-will-prepare-for-every-eventuality/6944283/", "country": "JE", "title": "Rory Best says Ireland will 'prepare for every eventuality' against Argentina", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "Rory Best says Ireland will 'prepare for every eventuality' against Argentina", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T17:16:00.000+03:00", "replies_count": 0, "uuid": "4824aaa62c298563a08009c655c5259d8eca09be"}, "author": "", "url": "http://www.sport.co.uk/rugby/rory-best-says-ireland-will-prepare-for-every-eventuality/6944283/", "ord_in_thread": 0, "title": "Rory Best says Ireland will 'prepare for every eventuality' against Argentina", "locations": ["Ireland"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Rory Best"], "text": "Rory Best says Ireland will 'prepare for every eventuality' against Argentina 16 Oct 2015 14:16:58 \ncomments \nRory Best has vowed Ireland will not fall into the same World Cup scrummaging trap against Argentina as in their nervy victory over Italy. \nBest admitted Ireland missed a trick in their preparation for their tense 16-9 Pool D triumph against the Azzurri, failing to account fully for the injury absences of Martin Castrogiovanni and Leonardo Ghiraldini. \nThe Ulster hooker pledged Ireland will cover every angle for Sunday's World Cup quarter-final against the Pumas in Cardiff, with Jerome Garces in charge - the same referee as against the Italians. \nBest challenged Ireland to cope without injured talisman Paul O'Connell, acknowledging \"there won't be anyone to hold your hand\". \n\"With Paulie missing we have both Jamie Heaslip and myself who captain Leinster and Ulster respectively,\" Best said. \n\"It's important guys stand up and lead by example. \n\"If you try to do too much then it can be detrimental to you as a leader, so while Paulie will be a loss everyone has to step up. \n\"They're not going to have their hand held by Paulie's leadership this week. \n\"Come Sunday at one o'clock on the pitch there won't be anyone to hold your hand. \n\"Against Italy there were a lot of things we could have done better. \n\"We probably weren't as prepared for that scrum, there were a few ifs and buts with Castrogiovanni and Ghiraldini, would they play or wouldn't they play that week. \n\"From our point of view, probably what we've learned in hindsight is that we need to prepare for every eventuality. \n\"We didn't then and for us it's about making sure that we do everything we can. \n\"The referees are doing a good job; our responsibility is to make sure we take it out of their hands by preparing properly, and making sure we execute the plan as accurately as we can. \n\"There are times you have a bit of a slip-up. \n\"Thankfully it didn't cost us against Italy, but this is the week to make sure it doesn't happen again. \n\"This is knock-out rugby and the chance to make history.\" \nArgentina's unorthodox \"Bajada\" scrummaging method has caught several sides cold in the World Cup, the locks unusually binding on the props hips in a bid to pin all the pressure through the opposing hooker. \nIreland's number two knows full well the Pumas will try to pin him in at the set-piece, but insisted Joe Schmidt's side have been hard at work devising strategies this week with scrum coach Greg Feek. \n\"We've got to make sure we have the tools to try to combat that,\" Best said. \n\"They are a quality scrum. Right through this tournament and the Rugby Championship they've performed very, very well. \n\"Traditionally everyone talks about Argentina and the scrum and it's probably only in the last couple of years they've got that back again. \n\"It's a big weapon for them. \n\"Ultimately we need to make sure that we're on the money, because they're a quality scrum. \n\"We know they're going to come after us because that's what they do no matter who they're playing. \n\"We need to be able to make sure that doesn't become a factor that makes us lose the game. \n\"Everyone's looking for an advantage somewhere, a different angle. \n\"We have our own technique that with Feeky now it's more than four years we've been working together. \n\"Myself, Mike Ross and Cian Healy, last weekend was our 30th cap starting together, so we're used to each other. \n\"And for us it's about making sure our technique is good and correct and that we trust what's worked for us for a large part of those 30 Tests.\" Related Sport News", "external_links": [], "published": "2015-10-16T17:16:00.000+03:00", "crawled": "2015-10-16T20:07:35.902+03:00", "highlightTitle": ""}