{"organizations": [], "uuid": "5b1aacfa707e4804e19678b487b5c895ac443b09", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fredericknewspost.com", "main_image": "http://bloximages.newyork1.vip.townnews.com/fredericknewspost.com/content/tncms/custom/image/0fa3e2d0-fff4-11e4-89a9-77b204e19fad.jpg?_dc=1432238442", "site_section": "http://www.fredericknewspost.com//search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&c[]=sports,sports/*&f=rss", "section_title": "www.fredericknewspost.com - RSS Results in sports,sports/* of type article", "url": "http://www.fredericknewspost.com/opinion/columns/in-post-loss-disappointment-redskins-culture-change-comes-into-focus/article_457972d4-c460-5bbc-925f-b492df4a6171.html", "country": "US", "title": "In post-loss disappointment, Redskins' culture change comes into focus", "performance_score": 0, "site": "fredericknewspost.com", "participants_count": 1, "title_full": "In post-loss disappointment, Redskins' culture change comes into focus", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T08:00:00.000+03:00", "replies_count": 0, "uuid": "5b1aacfa707e4804e19678b487b5c895ac443b09"}, "author": "Jerry Brewer The Washington Post", "url": "http://www.fredericknewspost.com/opinion/columns/in-post-loss-disappointment-redskins-culture-change-comes-into-focus/article_457972d4-c460-5bbc-925f-b492df4a6171.html", "ord_in_thread": 0, "title": "In post-loss disappointment, Redskins' culture change comes into focus", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In post-loss disappointment, Redskins' culture change comes into focus By Jerry Brewer The Washington Post 8 hrs ago 0 \nScot McCloughan, the man charged with fixing all that ails the Washington Redskins, kept pacing in and out of a melancholy locker room Sunday afternoon. The general manager wasn’t there as an evaluator this time. He was a sympathizer. Every time he saw a dejected player enter, he walked over to give a back pat and whisper encouragement, making sure to acknowledge the positives bushwhacked by an overtime loss. \nNine months ago, McCloughan was hired to make over a carefree locker room that accepted losing too easily. So it speaks to the team’s growth that the new sheriff in town could substitute discipline with compassion. \nDon’t be cynical. It’s not like the franchise will be given a key to the city for losing a close game and feeling bad about it. But if you focus on what the team is trying to become — a vision that has been missing for too long — then you understand the significance. \nIt’s another sign the Redskins might not be as fragile as we thought. They’re not full of the nonsense that has burdened them in the past. They’re still in a novice stage of development, but they’re a real football team right now, with a professional and serious approach to complement a burgeoning competitive mentality. They’re not a week-to-week concern so much anymore. They haven’t exactly stabilized, but they have graduated from around-the-clock monitoring to longer-term worrying about their health. \nA heartbreaking 25-19 loss to Atlanta shouldn’t devastate them, same as injuries haven’t derailed them. The players can take a blow, face hard truths and learn. They have to prove it this week with another credible road performance against the New York Jets, and they’ll have to keep proving it until they become a good and consistent team. But you can depend on them to get up and try again. \nIt’s a basic thing. Then again, you’re talking about a team that posted a 7-25 record the past two seasons. There is no such thing as an insignificant brick in this renovation. \n“I’m disappointed at the loss, but I’m not disappointed with the team,” nose tackle Terrance Knighton said. \nKnighton’s outlook is far superior to the worthless debate about moral victories. Few games produce clear, black-and-white feelings about what happened. It’s never as simple as win and be merry, or lose and get teary. It is possible to lament a lost opportunity and still feel positive about the team’s direction. With some perspective, it doesn’t have to be a bad thing. \nThis Washington team, with new personnel and better leadership joining some committed holdovers, has a clearer understanding of the concept. \n“You should never, ever get used to losing,” said Coach Jay Gruden, who also walked around the locker room to encourage his players after the game Sunday. “It should hurt every time, and it should hurt more the next time than it did the last time. I think our guys are starting to feel that. They understand the work that they’re putting in here and the effort that they’re giving on the field. \n“When you give maximum effort on the field and you don’t get rewarded with a victory, it hurts. It does. Our guys were hurt afterwards. I don’t think there was any laughing or joking in the locker room. I think they’re all disappointed. That’s a good thing.” \nAmid the disappointment, Gruden has a chance to instill a higher standard. On Monday, the comforting should’ve ended. If Washington is as sturdy as I think, it can face the problems that contributed to a bitter defeat without falling apart mentally. \nIt can admit the defense, for all it did to limit Falcons quarterback Matt Ryan and neutralize wide receiver Julio Jones without starting cornerbacks Chris Culliver and DeAngelo Hall, gave up the lead twice in the fourth quarter. The offense couldn’t run the ball and contributed to the defense’s fatigue by not retaining possession for as long as it normally does, but good defenses find a way to close, especially when given multiple opportunities. \nWashington can admit its offensive issues, too. Beyond Kirk Cousins being inaccurate on some simple passes and throwing the game-ending interception, Gruden didn’t like the way the team performed around the quarterback. The run game produced a season-low 51 yards and 2.1 yards per carry. But Gruden was most upset that he didn’t call a better game. \nThe coach saved the harshest criticism for his third-and-goal decision to call a screen pass to Jamison Crowder with 2 minutes 49 seconds remaining in regulation and Washington ahead 13-12. The play lost four yards. The Redskins settled for a field goal. \nAsked if he liked the call, Gruden said: “No. No. That was awful.” \nWashington also can admit its failure to score off turnovers. After managing only three takeaways in the first four games, the defense had its first two interceptions of the season and recovered a fumble against Atlanta. The offense squeezed just three points out of the defense’s three forced turnovers. Atlanta was let off the hook for its mistakes. \nThrow in another third quarter in which the Redskins failed to score — opponents have a 29-3 edge in that period this season — and Gruden has plenty of areas to emphasize. As much as the loss hurts, the players have to revisit the pain in order to get better. No denial or coddling allowed. \n“There were some plays that, quite frankly, we didn’t make,” Gruden said. “We didn’t coach good enough, but we’re right there. You can see the improvement. I think everybody can. We consistently have to do a better job of putting games back-to-back-to-back somehow.” \nYou’re seeing the skeleton of a team capable of making these corrections. Washington is one-third of the way to planting its flag in a good neighborhood again, a place where NFL teams make news for things other than catastrophe. \n“I feel like we are right there as a football team and can compete with anybody,” Gruden said. \nFor proof, you could observe the lowered heads in the locker room Sunday. McCloughan noticed. The general manager vowed in the preseason that the team would compete like it hadn’t in a long time. As he consoled his morose players, he had to feel their growth as well as their pain. Tags", "external_links": [], "published": "2015-10-14T08:00:00.000+03:00", "crawled": "2015-10-14T16:30:52.082+03:00", "highlightTitle": ""}