{"organizations": [], "uuid": "d1ebc24f70677469bd23aeaf354bcaf80735a2d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/himachal/hc-fines-petitioner-for-misusing-pil-process/145127.html", "country": "US", "title": "HC fines petitioner for misusing PIL process", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "HC fines petitioner for misusing PIL process", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "d1ebc24f70677469bd23aeaf354bcaf80735a2d8"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/himachal/hc-fines-petitioner-for-misusing-pil-process/145127.html", "ord_in_thread": 0, "title": "HC fines petitioner for misusing PIL process", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Vijay Arora\nShimla, October 12\nThe High Court has imposed a fine of Rs 1 lakh on a resident of West Bengal for misusing law. Dismissing the petition filed by Satish Kumar Singh, the Division Bench comprising Chief Justice Mansoor Ahmad Mir and Justice Tarlok Singh Chauhan observed: “The court is required to satisfy itself regarding the credentials of the petitioner, prima facie correctness of the information given by him, as a public interest litigation (PIL) cannot be used for suspicious products of mischief. It has to be aimed at redressal of genuine public wrong or public injury and not publicity-oriented or founded on personal vendetta or private motive.” It observed: “The public interest litigation petition is not a pill or panacea for all wrongs. It is essentially meant to protect basic human rights of the weak and disadvantaged. It is a weapon which has to be used with care and circumspection. The judiciary has to be extremely careful to see that behind the beautiful veil of public interest, an ugly private malice is not lurking.” The petitioner had urged the court to refrain the Central Government from transferring immovable properties attached to schools under the Central Tibetan School Administration, Ministry of Human Resource Development, Government of India to the Central Tibetan Administration, which is a foreign institution and also not to allow Tibetans to run parallel government within the territory of India. The court was informed on behalf of the respondents that a similar petition had been filed before the Calcutta High Court by the wife of the petitioner and that it was dismissed by the court on merits. Dismissing the petition, the Bench observed: “Under no circumstances can the petitioner be permitted to assail the order passed by the Division Bench of the Calcutta High Court before this court. Not only the courts but also the litigants are bound by propriety, procedure and judicial discipline, therefore, no one can be permitted to breach the same.” It observed: “The petitioner is a permanent resident of West Bengal. What special interest he has in this state and, particularly, with the Central Tibetan School Administration and Central Tibetan Administration? The answer to this is not difficult to find. The record reveals that the petitioner is a disgruntled dismissed employee of the Central Tibetan School Administration. It clearly establishes beyond any reasonable doubt that the process of public interest litigation has been misused by the petitioner and the instant petition has been filed only with mala fide objectives and for vindication of his personal grievances on considerations that are extraneous to public interest.”", "external_links": [], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T04:07:19.540+03:00", "highlightTitle": ""}