{"organizations": ["Chelsea"], "uuid": "2c4ef7104d80d9d4767734f71dd7a34b27dd35d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/4b4e99e241ad278fb0b2b035227048a4.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/football/how-can-jose-mourinho-solve-chelseas-problems/6897112/", "country": "JE", "title": "How can Jose Mourinho solve Chelsea's problems?", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "How can Jose Mourinho solve Chelsea's problems?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T14:28:00.000+03:00", "replies_count": 0, "uuid": "2c4ef7104d80d9d4767734f71dd7a34b27dd35d3"}, "author": "", "url": "http://www.sport.co.uk/football/how-can-jose-mourinho-solve-chelseas-problems/6897112/", "ord_in_thread": 0, "title": "How can Jose Mourinho solve Chelsea's problems?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jose Mourinho"], "text": "How can Jose Mourinho solve Chelsea's problems? By Goose (columnist) 06 Oct 2015 11:28:32 \nreads \ncomments \nJose Mourinho has admitted he is in the worst spell of his managerial career. \nThe Chelsea boss has seen his defending Premier League champions take just eight points from their opening eight fixtures - losing half of those and stuttering in Europe in the process. \nWith a Football Association charge and the dreaded vote of confidence from the Stamford Bridge board also over his head, we take a look at what the self-proclaimed 'Special One' needs to do to get back on track. \nTEAM SELECTION \nIn an attempt to address a poor start to the campaign, Mourinho has already demoted his long-trusted lieutenant John Terry from untouchable to squad player. The Portuguese should also be praised for pulling the likes of Nemanja Matic and Pedro from his starting line-ups. \nBut, if history, price tag and reputation are of little consequence to Mourinho, why is he steadfast in his selection of Branislav Ivanovic at right-back? \nThe Serbian has endured a torrid start to the season and merely seeing his name on the team sheet will give opposing wingers the feeling they are in for a fruitful afternoon. Baba Rahman was procured in the transfer window for over £20million and has yet to make an appearance in the Premier League, with the option of switching Cesar Azpilicueta back to his original role on the right of the defence and drafting in the Ghana international. \nMourinho says Rahman needs time to adapt and is not enough of an aerial threat to displace Ivanovic but struggling Aston Villa are the visitors on Saturday so surely a little experimentation is allowed and even expected. \nSOLE FOCUS \nWith his team misfiring on the pitch, Mourinho has looked everywhere else for a reason as to why Chelsea's title defence has faltered quite so spectacularly. \nHe has argued with the club's medical staff, been reprimanded by the FA for blasting referees and has been churlish in most of his dealings with the media. \nThe time has surely come for Mourinho to focus on matters on the pitch, on the training ground and in the dressing room rather than looking for an external cause for such a dismal run. \nMOTIVATION \nEden Hazard was the PFA Player of the Year and Football Writers' Association Footballer of the Year last season. He will not win either this year unless we see a remarkable transformation. Ivanovic may be playing poorly but he cannot have become a bad player overnight, likewise Matic. \nRadamel Falcao has continued the sort of scoring form that saw Manchester United opt against signing him on a permanent deal last season. Mourinho needs to weave his magic on these players. \nHe has built teams who have believed in him and gone into battle for him and he needs to invoke such passion and instil that belief all over again at a time when his own motivation seems to be waning. Related Sport News", "external_links": [], "published": "2015-10-06T14:28:00.000+03:00", "crawled": "2015-10-06T19:42:55.094+03:00", "highlightTitle": ""}