{"organizations": [], "uuid": "ae150910942faf0d081f1886eb36df1b13f937d6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wgem.com", "main_image": "http://WGEM.images.worldnow.com/images/9013964_G.jpg", "site_section": "http://www.wgem.com/category/123718/sports?&clienttype=rss", "section_title": "WGEM - SPORTS", "url": "http://www.wgem.com/story/30258984/2015/10/14/wgem-sc-prep-athlete-of-the-week-ballot-wk-7", "country": "US", "title": "WGEM SC Prep Athlete of the Week Ballot (Wk 7)", "performance_score": 0, "site": "wgem.com", "participants_count": 1, "title_full": "WGEM SC Prep Athlete of the Week Ballot (Wk 7)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T18:14:00.000+03:00", "replies_count": 0, "uuid": "ae150910942faf0d081f1886eb36df1b13f937d6"}, "author": "Josh Houchins", "url": "http://www.wgem.com/story/30258984/2015/10/14/wgem-sc-prep-athlete-of-the-week-ballot-wk-7", "ord_in_thread": 0, "title": "WGEM SC Prep Athlete of the Week Ballot (Wk 7)", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WGEM SC Prep Athlete of the Week Ballot (Wk 7) - WGEM.com: Quincy News, Weather, Sports, and Radio Member Center: What player deserves to win this week's Dene Lambkin Honda/Hyundai Prep Athlete of the Week award? (info about each player below) Ethan Barnett, Central Lee (football) Jack Baumann, Hannibal (soccer) Jordan Hildebrand, Unity (volleyball) Will Fox, West Hancock (football) \nThank you for participating in our poll! A winner will be announced Tuesday morning on WGEM SportsCenter. The Dene Lambkin Honda/Hyundai... WGEM SC Prep Athlete of the Week Ballot (Wk 7) Posted: jhouchins@wgem.com \nBelow is a list of the nominees for The Dene Lambkin Honda/Hyundai & WGEM SportsCenter Prep Athlete of the Week featuring Jason Deters . The fan vote counts as one vote in the total vote process with 10 sports broadcasters/writers submitting ballots as well. The winner will be announced Tuesday morning at 7:20 on WGEM SportsCenter -- ESPN 1440 AM, WGEM-AM app, or WGEM.com/sports. \nFrom Oct 12 - Oct. 18 \nEthan Barnett (Central Lee) -- The back carried the rock a whopping 36 times, gaining a game-high 203 yards Friday night, as the Hawks claimed a Class 2A District 5 title. He also rushed for two scores. \nJack Baumann (Hannibal) -- The program's all-time leading goal scorer added to his record by going for nine goals in a three-win week for the Pirates. He scored five on Tuesday to beat Fulton and then added four more Thursday against Canton. \nJensen Crenshaw (Canton) -- The Lady Tigers are back to the state tournament and it was Crenshaw's bat that helped lead the charge. In the quarterfinal on Saturday she finished a double short of hitting for the cycle. Earlier in the week, she had an RBI in the win over Atlanta. \nBrodie Dunker (Unity/Payson) -- Guaranteed a spot in the playoffs for the first time since 2010, the Mustangs were led by their quarterback in a big win on the road at Winchester. Dunker threw for 278 yards and five touchdowns while also scoring twice on the ground. \nDrew Eaton (QND) -- Coming off a ninth-place finish last year in the Class 2A state tournament, the golfer capped his high school career finishing tied for second overall at the Class 1A state meet with a two-day total of 149 -- one shot off the winner. On Monday he earned medalist honors with a 77 at the Hamilton Sectional. \nShamar Griffith (Hannibal) -- The Pirates went to Columbia and not only got revenge from last year's loss to Battle, but also capped the regular season undefeated for the first time since 2000. Griffith torched the Spartans for 309 yards and four scores. \nJordan Hildebrand (Unity) -- Named to the all-tournament team at the Sherrard Volleyball Tournament, Hildebrand led the Lady Mustangs with 43 kills on the day, guiding the team to the title in a win over Wethersford. \nWill Fox (West Hancock) -- Rushing for 200 yards and four touchdowns, the back helped lead the charge for the Titans to not only clinch a spot in the playoffs for the first time since 2007, but also knock off neighbor Illini West. Can't Find Something? 513 Hampshire Quincy, IL 62301 Switchboard: (217) 228-6600", "external_links": [], "published": "2015-10-18T18:14:00.000+03:00", "crawled": "2015-10-18T20:11:27.560+03:00", "highlightTitle": ""}