{"organizations": [], "uuid": "49ffe1052daf33af5ec8bc826890d4f633a40a07", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sacbee.com", "main_image": "http://www.sacbee.com/news/local/transportation/2ybxuc/picture41386836/ALTERNATES/LANDSCAPE_1140/rt_odors", "site_section": "http://www.sacbee.com/?widgetName=rssfeed&widgetContentId=713546&getXmlFeed=true", "section_title": "Breaking News, Sports, Weather & More | Sacbee.com &", "url": "http://www.sacbee.com/news/local/transportation/article41386842.html", "country": "US", "title": "Sacramento RT considers rules to limit ‘noxious odors,’ other objectionable rider traits", "performance_score": 0, "site": "sacbee.com", "participants_count": 1, "title_full": "Sacramento RT considers rules to limit ‘noxious odors,’ other objectionable rider traits", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T20:19:00.000+02:00", "replies_count": 0, "uuid": "49ffe1052daf33af5ec8bc826890d4f633a40a07"}, "author": "Tony Bizjak \ntbizjak@sacbee.com", "url": "http://www.sacbee.com/news/local/transportation/article41386842.html", "ord_in_thread": 0, "title": "Sacramento RT considers rules to limit ‘noxious odors,’ other objectionable rider traits", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sacramento RT considers rules to limit ‘noxious odors,’ other objectionable rider traits \nAgency cleaning up its system before downtown arena opening \nNew proposal: Smelly riders can be kicked off buses, trains \nHomeless advocate says rules may be discriminatory Sacramento Regional Transit officials say that new rules to limit offensive odors and other objectionable rider characteristics are meant to enhance the overall riding experience for customers, not discriminate against homeless people or any other group. Hector Amezcua hamezcua@sacbee.com i \ntbizjak@sacbee.com \nSacramento Regional Transit officials on Monday will consider a proposal to ban people from riding trains and buses who are a nuisance to other passengers, including people who “emanate a noxious odor” and who play music other passengers can hear. \nThe proposed rules are part of an effort by the transit agency to clean up service and improve its image among potential riders. Downtown business leaders and several new members of the Sacramento RT board say the agency needs to make improvements to attract “choice” riders when the downtown sports and entertainment arena opens in October 2016. \nThe proposed administrative prohibitions, listed in a staff report, are: \n▪ Boarding trains or buses unless clothed above and below the waist and wearing footwear that has a sole. \n▪ Emanating a noxious odor from body, clothing or possessions that discomforts other passengers, unless the odor relates to a disability or medical condition. \n▪ Sleeping on a train that has reached the end of a line. \n▪ Playing sound equipment that’s audible to other passengers. \nPam Haney, advocacy coordinator for Wellspring Women’s Center in Oak Park, which purchases transit tickets for some of its clients, said the odor proposal looks discriminatory. \nHaney said she suspects RT is unlikely to kick someone off a bus whose perfume is overpowering or to prohibit local law school rugby players from riding after a match. \n“It seems as though the primary goal of this change is enabling them to have an administrative route to be additionally discriminatory toward homeless people,” Haney said. \nRegional Transit General Manager Mike Wiley said the administrative changes are not directed at the homeless or any group, nor are they directly related to the opening of the downtown arena next year. RT has been trying for some time to make the riding experience more attractive and comfortable, he said. \n“We have an overall emphasis on enhancing security” and rider experience, he said. “We’re trying to focus on controlling improper behavior.” \nThe Sacramento RT staff report cites administrative rules that lay out the circumstances under which someone can be forced off a bus or train: “If the individual refuses to stop the prohibited conduct, they are asked to leave the vehicle or premises. If they refuse, authorized personnel may remove the offending individual from the vehicle or premises using the least amount of force necessary.”", "external_links": [], "published": "2015-10-25T20:19:00.000+02:00", "crawled": "2015-10-25T23:52:27.711+02:00", "highlightTitle": ""}