{"organizations": [], "uuid": "b68e623a7e4ba40d594efc2dd752e19c0a915c2b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reporterherald.com", "main_image": "http://extras.mnginteractive.com/live/media/site47/2015/1003/20151003__03rhsTVMVFootballw~1.jpg", "site_section": "http://feeds.reporterherald.com/mngi/rss/CustomRssServlet/47/244119.xml", "section_title": "Sports", "url": "http://www.reporterherald.com/sports/ci_28916023/thompson-valley-football-snaps-crosstown-skid-by-win?source=rss", "country": "IL", "title": "Thompson Valley football snaps crosstown skid with win over Mountain View", "performance_score": 0, "site": "reporterherald.com", "participants_count": 1, "title_full": "Thompson Valley football snaps crosstown skid with win over Mountain View", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T10:03:00.000+03:00", "replies_count": 0, "uuid": "b68e623a7e4ba40d594efc2dd752e19c0a915c2b"}, "author": "Sean Star \n\nReporter-Herald Sports Writer", "url": "http://www.reporterherald.com/sports/ci_28916023/thompson-valley-football-snaps-crosstown-skid-by-win?source=rss", "ord_in_thread": 0, "title": "Thompson Valley football snaps crosstown skid with win over Mountain View", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Thompson Valley football snaps crosstown skid with win over Mountain View Sparked by a fake punt TD, Eagles score 15 straight points to begin second half By Sean Star \nReporter-Herald Sports Writer Posted: 10/03/2015 12:53:05 AM MDT Thompson Valley senior Gunner Mengel (25) sprints 65-yards for a touchdown on a fake punt against Mountain View on Friday at Patterson Stadium. The Eagles would win, 40-23, their first victory against the Lions since 2007. ( Trevor L Davis / Loveland Reporter-Herald ) \nWhat's an extra hour when it's been eight years? \nThompson Valley entered Friday without a win over a crosstown rival since 2007. \nOff to a 3-1 start this season, the 2015 Eagles seemed primed to snap that skid, so a 60-minute lightning delay before kickoff didn't little to deter coach Matt Smith's squad from ending the drought. \nSpurred by Gunner Mengel's 65-yard touchdown run off a fake punt midway through second quarter, the Eagles beat a crosstown rival for the first time in eight years with their 40-23 win over Mountain View. \n\"I'm so proud of these guys. They've worked so hard. They deserve it,\" said Smith, whose team won its fourth straight to improve to 4-1. \"Mountain View is a phenomenal team. For us to get them tonight was unbelievable for the program and for the kids.\" \nAfter each team scored a pair of touchdowns in the first quarter, the Eagles took the lead for good on the fake punt by Mengel, who on fourth-and-10 from his own 35 refused to go down after picking up the first down, zig-zagging his way through the MVHS defense until he found the end zone. \nAn Ivan Thomas 25-yard field goal just before the end of the first half cut the Eagles' lead to 18-17. But TVHS owned the third quarter, scoring 15 unanswered points to take control. \n\"There's no question they were hungry. I woudln't say they were any hungrier than we were,\" said MVHS coach Bart Mayes, whose team led 7-0 and 14-6 in the first quarter. \"But they did a good job. They executed at the times they needed to and we didn't. My hat's off to them. They've got some good athletes over there and they made plays, and their coaching staff did a nice job.\" Advertisement \nTVHS sophomore quarterback Kanaan Turnbull tossed two of his three touchdowns in the decisive third quarter, the first an 8-yard catch and run to Matt Berg and the second a 31-yard scramble to Cody Lesperance. \nIn between those scores, following consecutive sacks by the Eagles near the MVHS goal line, Austin Emrick blocked a punt that resulted in a safety. Mountain View running back Tommy Hochheimer (34) slips a tackle by Thompson Valley's Mike Berg in the first half Friday at Patterson Stadium. ( Trevor L Davis Loveland Reporter-Herald ) \n\"Defense is playing amazing,\" said Smith, whose team allowed just 22 points its previous three games. \"After those first couple drives the kids came off the field saying how fast they were. It's tough to duplicate that kind of team speed in practice. I think once we got used to it a little bit, got settled in, they really figured it out.\" \nThe Lions didn't give in easily, making it a 10-point game with 7:30 to go on a 10-yard touchdown pass from Dennis Landry to Dakota Sedillo to make it 33-23. But three lost fumbles in the second half by by the Lions -- including one on a kickoff following a 1-yard plunge by Patton Graff that made it 40-23 -- cost the Lions dearly. \n\"We're so talented as a team, and we just killed ourselves on little mistakes,\" said Sedillo, who led the Lions with six catches, good for 44 yards. \"It's just a team thing that we really needed to pull together, and I don't know if we did. We couldn't really find it as a team.\" \nThe victory was truly a complete effort by the Eagles, who gained more than 350 yards of offense, forced the three turnovers, had four sacks and held the Lions to 15 points fewer than their season average. \n\"Everyone had to pitch in and play, that's for sure,\" said Emrick, who along with fellow defensive end Justin Curtis helped contain Landry by pressuring him and keeping him in the pocket. \"It's huge, absolutely huge. Everybody was fired up.\" \nTurnbull finished 12-for-20 passing for 246 yards, three touchdowns and one interception. As has been the case often this season, his favorite target was Matt Berg, who caught seven passes for 134 yards and a touchdown. \n\"He's so good with his progressions. He looks down and checks down to everybody,\" Berg said of Turnbull. \"He just throws it all around; he's not selfish with who he's going to throw to. It's really nice to have him at quarterback.\" \nThe Lions opened the scoring with a 33-yard run by Landry and followed that up later in the quarter with a 1-run by Tommy Hochheimer. But the Eagles countered each time, first a with a 28-yard scoring toss from Turnbull to Jake Hornick, followed by a 5-yard run by Patton Graff. \nBoth teams return to Patterson next week, the Lions against Silver Creek on Thursday, the Eagles Friday against Adams City (3-1). The following week TVHS plays Loveland, another crosstown rival that has had the Eagles' number for years. \n\"That's in the future, but we're ready,\" Emrick said. \"We'll be prepared.\" \nSean Star: 970-669-5050, sstar@reporter-herald.com or twitter.com/seanvstar \nEagles 40, Mountain Lions 23 \nAt Patterson Stadium Mountain View (2-3) 14 3 0 6 — 23 Thompson Valley (4-1) 12 6 15 7 — 40 \nFirst quarter \nMVHS — Dennis Landry 33 run (Ivan Thomas kick), 10:14. TVHS — Jake Hornick 28 pass from Kanaan Turnbull (conversion failed), 5:10. MVHS — Tommy Hochheimer 1 run (Thomas kick), 2:30. TVHS — Patton Graff 5 run (conversion failed), 0:23. \nSecond quarter \nTVHS — Gunner Mengel 65 run (conversion failed), 4:50. MVHS — Thomas 25 field goal, 0:42. \nThird quarter \nTVHS — Matt Berg 8 pass from Turnbull (conversion failed), 7:05. TVHS — Austin Emrick blocked punt for a safety, 5:37. TVHS — Cody Lesperance 31 pass from Turnbull (Mengel kick), :05. \nFourth quarter \nMVHS — Dakota Sedillo 10 pass from Landry (conversion failed), 7:30. TVHS — Graff 1 run (Mengel kick), 5:34.", "external_links": [], "published": "2015-10-03T10:03:00.000+03:00", "crawled": "2015-10-03T10:39:05.467+03:00", "highlightTitle": ""}