{"organizations": [], "uuid": "09862104e8e6613063748f47a48b49cf78b1016c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fox8live.com", "main_image": "http://WVUE.images.worldnow.com/images/8982009_G.jpg", "site_section": "http://www.fox8live.com/", "section_title": "New Orleans News, Weather, Saints - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "url": "http://www.fox8live.com/story/30226105/suspect-shot-gibson-man-over-drugs-3-arrested", "country": "US", "title": "Suspect shot Gibson man over drugs; 3 arrested", "performance_score": 0, "site": "fox8live.com", "participants_count": 1, "title_full": "Suspect shot Gibson man over drugs; 3 arrested - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T20:49:00.000+03:00", "replies_count": 0, "uuid": "09862104e8e6613063748f47a48b49cf78b1016c"}, "author": "Written by: FOX8Live.com Staff", "url": "http://www.fox8live.com/story/30226105/suspect-shot-gibson-man-over-drugs-3-arrested", "ord_in_thread": 0, "title": "Suspect shot Gibson man over drugs; 3 arrested", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "GIBSON, LA (WVUE) - Officers made three arrests in connection to the shooting death of a man found slumped over in his car in Gibson.\nThe body of Robert Swan, 24, was discovered Wednesday morning in the 4700 block of Bayou Black Drive.\nOn Thursday, Terrebonne Parish Sheriff's Office detectives received information that a suspect, Kyle Cedatol, was in the same area with his girlfriend, Tiffany Dardar. 30.\nDetectives conducted surveillance of a residence on Highway 316 in Gray and saw the couple getting into a red Ford Mustang. Officers followed the car to the area of Highway 90 near Chacahoula.\nDeputies say they pulled the vehicle over and Cedotal ran into the marsh with a backpack. A TPSO K-9 followed the suspect, where he was quickly apprehended.\nCedotal was carrying three firearms and illegal drugs, deputies said.\nHe was treated for a dog bite and taken to a local hospital.\nThe driver of the Mustang and Cedotal's girlfriend, who was in the back seat, were taken into custody.\nDardar was arrested for accessory after the fact to second-degree murder and possession of a controlled dangerous substance. Her bond was set at $500,000.\nThe driver was determined not be involved in the shooting and was released.\nCedatol was later arrested for one count of second-degree murder, possession of a firearm in the presence of a CDS, three counts of possession with intent to distribute CDS 2 and one count of possession with intent to distribute CDS 1, and possession of a firearm by a convicted felon. His bond has been set at $1,000,000.\nOne of Cedatol's friends was also arrested. Joshua Babin, 21, was charged with one count of accessory after the fact to second-degree murder. His bond was seat at $100,000.\nAll three suspects remain in the Terrebonne Parish Criminal Justice Complex.\nAn autopsy confirmed that Swan died from a single gunshot wound, according to investigators.\nDetectives believe the motive for the murder appears to be related to drugs.\nA firearm used in the shooting was also recovered, officer said.\nCopyright 2015 WVUE . ", "external_links": [], "published": "2015-10-09T20:49:00.000+03:00", "crawled": "2015-10-10T13:39:52.692+03:00", "highlightTitle": ""}