{"organizations": [], "uuid": "15e340074af4b1253900e3d458cedeced59be218", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "wtop.com", "main_image": "http://wtop.com/wp-content/uploads/2015/10/Britain-Rugby-WCup-New-Zealand-Tonga2.jpeg", "site_section": "http://wtop.com/section/sports/feed/", "section_title": "WTOP » Sections » Sports", "url": "http://wtop.com/sports/2015/10/carter-has-moved-on-since-2007-desperate-to-reach-rwc-final/", "country": "US", "title": "Carter has moved on since 2007, desperate to reach RWC final", "performance_score": 0, "site": "wtop.com", "participants_count": 1, "title_full": "Carter has moved on since 2007, desperate to reach RWC final", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T16:21:00.000+03:00", "replies_count": 0, "uuid": "15e340074af4b1253900e3d458cedeced59be218"}, "author": "wtopstaff", "url": "http://wtop.com/sports/2015/10/carter-has-moved-on-since-2007-desperate-to-reach-rwc-final/", "ord_in_thread": 0, "title": "Carter has moved on since 2007, desperate to reach RWC final", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home » News » Sports » Carter has moved on… Carter has moved on since 2007, desperate to reach RWC final By JEROME PUGMIRE October 13, 2015 9:21 am New Zealand's Daniel Carter, left, Ma'a Nonu, centre, and Sonny Bill Williams celebrate after the Rugby World Cup Pool C match between New Zealand and Tonga at St James' Park, Newcastle, England, Friday, Oct. 9, 2015. New Zealand won the match 47-9. (AP Photo/Jon Super) \nDan Carter has moved on from that day in 2007 that will long remain one of the most painful in his illustrious career. \nAhead of another Rugby World Cup quarterfinal between New Zealand and France in Cardiff, the All Blacks flyhalf is focusing on the French class of 2015 rather than the match he lost eight years ago. \n“They love playing the All Blacks in big matches and I know they will perform out their skin,” Carter said. “They will. That’s one of their strengths. They can just flick a switch and turn it on. Look at the last World Cup.” \nCarter and All Blacks skipper Richie McCaw were involved in the 20-18 quarterfinal loss in the Welsh capital in 2007, which the New Zealanders avenged — narrowly — four years later by beating the French in the final. \nMcCaw got to lift the trophy on home soil when New Zealand clinched its second World Cup title. But Carter didn’t get to play because of an injured groin. Carter, the leading scorer in test rugby, has never played a World Cup final, and that remains his aim. To do that, he has to get past France on Saturday. \nFinally injury-free, Carter has helped the All Blacks coast through the pool stage to qualify atop Pool C. France placed second in Pool D, losing 24-9 to Ireland last Sunday in the decider and getting “smashed” in the rucks, as French scrumhalf Sebastien Tillous-Borde bluntly put it. \nCarter knows better than to take group stage form into account. In 2011, France reached the final after a chaotic pool stage — riddled by talk of players threatening mutiny against then-coach Marc Lievremont — ended in defeat to Tonga. \nFrom verging on self-capitulation, the French regrouped and pushed New Zealand all the way in the final, losing 8-7. \n“They didn’t have a lot of form in the pool stages yet when they hit the play-offs, they flicked that switch,” Carter said. “That’s the beauty of knockout rugby. This is the final for both sides now.” \nCarter was one of the stars of the 2007 tournament before the All Blacks lost to France, despite having a commanding halftime lead. He insists that loss hasn’t scarred him. \n“We are not looking in the past. We are more excited about this challenge than anything else,” the 33-year-old Carter said. “It was eight years ago and we have moved on from there with a new team who have been through a lot together.” \nCarter — test rugby’s leading points scorer — had a taste of playing in France, too, before his stint with Perpignan was cut short by a ruptured Achilles tendon. \n“I didn’t play many games in France but I think I have played against them enough,” Carter said. “Form and momentum doesn’t count for much with the French. They can be poor one week and awesome the next. They will be disappointed with the way they played against Ireland and that is a dangerous sign for us.” \nIf Saturday’s contest is close, New Zealand will need Carter to be at his kicking best. \nHe converted six of the seven tries scored in last week’s 47-9 win over Tonga, despite some distractions from McCaw. \nThe veteran forward did not play in that match as he was resting a sore hip, so he was assigned to carry the kicking tee out when Carter was kicking. \n“He dropped it a couple of times. He was actually squashing my tee too,” said Carter, who needs five more points to reach 150 in World Cups. “Then he started talking rugby before I was kicking, so I’m pretty keen to get him back in the team rather than running on like that.” Topics:", "external_links": [], "published": "2015-10-13T16:21:00.000+03:00", "crawled": "2015-10-13T16:43:48.140+03:00", "highlightTitle": ""}