{"organizations": ["Milan Puskar Center Team Room", "Oklahoma State", "Baylor", "Georgia Southern"], "uuid": "e7daed42d28f85e00fb76d2ed34f741e0ce4bbd5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wdtv.com", "main_image": "http://www.wdtv.com/content/images/Sports/danastill1020.jpg", "site_section": "http://www.wdtv.com/rss.cfm?type=Sports", "section_title": "Welcome to 304 SPORTS", "url": "http://www.wdtv.com/wdtv.cfm?func=view&section=Sports&item=Dana-Holgorsen-Postgame-Press-Conference-Bye-Week-1020-26272", "country": "US", "title": "Dana Holgorsen Postgame Press Conference (Bye Week 10/20)", "performance_score": 0, "site": "wdtv.com", "participants_count": 0, "title_full": "Dana Holgorsen Postgame Press Conference (Bye Week 10/20)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T01:41:00.000+03:00", "replies_count": 0, "uuid": "e7daed42d28f85e00fb76d2ed34f741e0ce4bbd5"}, "author": "", "url": "http://www.wdtv.com/wdtv.cfm?func=view&section=Sports&item=Dana-Holgorsen-Postgame-Press-Conference-Bye-Week-1020-26272", "ord_in_thread": 0, "title": "Dana Holgorsen Postgame Press Conference (Bye Week 10/20)", "locations": ["Jordan", "Fort Worth", "William Crest", "MORGANTOWN"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["William", "Dana Holgorsen", "Briles", "Shelton", "Ka'Raun White", "Mike", "Tony Gibson", "Skyler Howard", "Shawn", "Mathis", "Andrew Billings", "Donte Thomas-Williams", "Devonte", "Thompson", "Kevin", "David", "Shelton Gibson", "Mike Joseph", "Joseph", "Corey Coleman", "Jamal Palmer", "Smallwood", "Josh Lambert", "Chris Chugunov", "Ben Eshenbaugh", "Sills", "Gibson", "Tyler Orlosky", "David Sills", "Terrell Chestnut", "Gibby", "Daikiel", "Jay Lee", "Oakman"], "text": "Written by Ben Eshenbaugh Created on October 20, 2015 @ 6:41PM Courtesy WVU Sports Communications: MORGANTOWN, W.Va. (October 20, 2015) - Coach Dana Holgorsen addresses members of the media on Tuesday, Oct. 20, at the Milan Puskar Center Team Room. Opening Statement Welcome everybody. We are on bye week No. 2, and I want to give you an update on what the schedule is going to be like. We will get back to work today. We will practice Tuesday and Wednesday. (Director of strength and conditioning) Mike Joseph and his gang will get them on Thursday for a heavy day. We will also be able to get out on the road and recruit some. We have to take advantage of the days that we are allowed to do that, so we will be out Thursday and Friday, and then we will get back to work on Saturday. (Director of strength and conditioning) Mike (Joseph) will lift the guys real hard on Saturday, and then Sunday will be a heavy practice day. It will be just like an in-season Tuesday. We will practice Sunday, Monday and Tuesday. Then we will travel on Wednesday and go play Thursday night in Fort Worth. That's where we are at, and I am looking forward to getting back to work here today. With that said, I'll take some questions. On redshirt senior cornerback Terrell Chestnut and other injuries on the team He's day-to-day. He tries hard, and he has had a shoulder injury for quite some time now. He actually had it before this game, and he tried to play through it, but it was too sore. He needs this week. We had four hard games in a row. The rest is going to do them all some good. We will utilize this week to get everyone as healthy as we possibly can. Sunday is where it is important to see where everyone is at. We will make sure that he is resting. (Redshirt freshman offensive lineman) Yodny (Cajuste) was banged up during the game. We will rest him all week. (Redshirt junior offensive lineman) Tyler Orlosky could hardly even walk out there. We will rest him all week. A lot has been made about (junior running back) Wendell (Smallwood). Specific guys question why we are not using him very much. I can assure you that we will use him as much as we possibly can, but he has not practiced a day in the last two weeks. However, he gets out there and gives everything he has for the team. He will benefit from this week as well. I would imagine when I talk to you all next Monday, I will have a better sense as far as where everyone is at. On the plan for freshman quarterback David Sills moving forward Running back? He's 6-foot-3 and 190 pounds. We will keep experimenting with him. He has been playing receiver for about two or three weeks now. This kid was groomed to be a quarterback. He has played quarterback his whole life. He signed here to play quarterback, and he played quarterback all last spring. If you remember what we said about him after the Georgia Southern game, the kid loves to play football, and he has done everything that we have asked him to do in order to be the scout team player of the week for Georgia Southern. When you get into the weekly grind of preparing for an opponent, there is not a whole lot of time for the developmental aspects of things. He is playing quarterback on Thursday nights, when we have our little Thursday night football stuff. He started playing receiver for (assistant coach/defensive coordinator/linebackers Tony Gibson) Gibby because we don't have enough bodies to play receiver on the scout team. He turned some people's heads down there, so I took him last week and had a talk with him. We practiced, and he looked pretty good. I asked him if he wanted to go play ball, and he said that he wants to do anything he can to help the team. We put him out there at wide out. If I didn't think he could compete, I wouldn't have put him out there. I put him out there, and he looked good, so we will probably keep doing it. Unless you have a better idea. Do you think running back is the thing to do with him? On if freshman quarterback David Sills would replace junior quarterback Skyler Howard due to injury No. He hasn't taken enough reps at quarterback. He has been there on scout team. (Redshirt freshman quarterback) William Crest has been taking reps. (Freshman quarterback) Chris Chugunov has been taking reps. Those guys would have the best chance to go in there and run the offense based on the reps that we have been giving them. It would be tough to put a guy in at quarterback that hasn't taken any reps since August. On what is the most difficult part of developing the young quarterbacks throughout the course of the season You can only rep one quarterback. He (junior quarterback Skyler Howard) has been getting the reps. We have been doing some different things with (redshirt freshman quarterback) William (Crest) to give him the ball. That has worked out good, and we will continue to explore options when it comes to him and what he can do. That third-team quarterback has always been tough to rep. Everywhere I have been, there has been minimal reps for a third-team quarterback. There is just not enough time in the day to be able to get those reps. (Freshman quarterback) Chris Chugunov) Chugs has been the guy that is smart, and he is in tune with what we are doing. If we need him to go out there and play, then he will. If not, then we will utilize his redshirt, and we will start to give him reps in January. Because you can't practice those guys very much in the fall, my plan with (freshman quarterback) David (Sills) moving forward is to do what you have to do to help the team win, and then we will reassess it in January. We will see who is on campus and who we need to rep. On how much of a bounce back did junior quarterback Skyler Howard have from the Oklahoma State game to the Baylor game I thought he attacked the week really good. He ignored what the outside was saying, and he used that to motivate him. He studied the game plan hard. He spent some time with his family because he's from Fort Worth. He did that, so that was good for him. He was around a lot of people that believed in him and patted him the back. They told him they loved him and all that stuff. I think that was good for him. He was motivated to play. He knew what we were asking him to do. He took a bunch of deep breaths, and he went out there and played football. It was probably the main reason I ran a quarterback draw on the first play. I was hoping he would get the crap knocked out of him to release a lot of tension and anxiety, which I think is good for him. I think he played well. The clock is still ticking a little bit too fast. That has something to do with our o-line needing to do a better job of protecting. We played a very, very good defensive line. (Junior defensive tackle Andrew Billings) No. 75 is the best defensive lineman I have faced in over 20 years of coaching. The stuff that he was doing was unbelievable. That's a challenge when you see that in front of you. That is a challenge for any quarterback. (Senior defensive end Shawn) Oakman played better than I have seen him play. The other one, (senior defensive end Jamal Palmer) No. 92, rushed the passer better than Oakman did. That was a good d-line. We are going to continue to face good d-lines, so he has to continue to have confidence with the guys in front of him. The guys in front of him need to continue to improve with their protection. With that said, I do think the intermediate routes were better. We hit (redshirt sophomore wide receiver) Ka'Raun (White), (freshman quarterback) David (Sills) and (redshirt sophomore wide receiver) Shelton (Gibson) on some intermediate passes. I thought (junior quarterback) Skyler (Howard) threw the deep ball really well. We had two or three touchdowns downfield that he threw great balls on. We were this close to hitting two or three more, which would've put us at a huge day offensively. I think we are getting closer, and I think he has been a big part of that. On what he has seen out of redshirt sophomore wide receiver Ka'Raun White that has made him ready to go out there and compete We just need more bodies to play. It is a long season. Guys are going to be worn down, so other bodies have to step up and play. (Redshirt sophomore wide receiver) Ka'Raun (White) is new. He has been on campus since June. Kevin (White) was on campus for a whole year before things started to click for him. I am not comparing the two. I'm not. I won't. He is starting to settle in and understand what we are asking him to do. He's working hard, and he had his best week of practice last week. We knew it was going to be hot, and we knew it was going to be a long game, so we forced ourselves to play (redshirt sophomore wide receiver) Ka'Raun (White) and (freshman quarterback) David (Sills). On the inside, we wanted to play more people as well. We had (junior wide receiver Daikiel) Shorts, (redshirt junior wide receiver Devonte) Mathis and (senior wide receiver) Jordan (Thompson) all playing inside. I haven't had three inside receivers in a long time. I played three of them this week. (Redshirt freshman running back) Donte Thomas-Williams was in the game at running back to provide some depth. That's going to be important moving forward for all those guys. On the process that it takes to develop a deep wide receiving core I think when you look at my track record and (Baylor's head coach) Art's (Briles) track record, we develop receivers through how we practice and how we do things. Their (senior wide receiver Jay Lee) No. 4 is a prime example of a fourth-year guy that is 6-foot-3, 220-pounds. He is fast and physical. You look at him and say 'wow, that dude is going to be playing for a long time,' and he is. (Junior wide receiver) Corey Coleman is another guy who is a third-year player, and he has been in the system for three years. He has been in the weight room for a long time. He is physical, fast and twitchy. He has developed to what I think is the top receiver in college football. Then there is (sophomore wide receiver) KD Cannon, who has been there for two years, and he is going to be making plays for quite a while. All three of those guys are NFL-type bodies that have a good rapport with their quarterback. I've said this forever. How quick can we get there is my job. We have a bunch of first-year receivers or second-year receivers that we are going to be talking about for a long time. If you would rather talk about those guys right now, it is nowhere along the same lines that we were talking about Kevin (White) at this time last year. How quick we can get there, I don't know. I know (redshirt sophomore wide receiver Shelton Gibson) No. 1 is getting really close for us. He's getting really close. We have to get the other guys to continue to develop and mature. They have to continue to build confidence to where they can make a bunch of plays to make a difference in the game. We are not there yet, but we are going to get there pretty quick. On evaluating the team midway through the season Offensively, I think we are pretty close to where we thought we would be. Our deal from the beginning was all about getting better. We have a lot of youth, a lot of new players and a lot of inexperience. We just have to keep getting better, and I think we are. We are on track, and we need to continue on that path. Defensively, we lost an All-American guy that has played a bunch. I think our defense has to keep playing their butt off, and they have to be consistent. They have to be as consistent as they possibly can. I am happy with where special teams is as well. There has been a lot of good things that are happening on special teams, and we need to continue to use that as a positive. We need to make sure that it doesn't hurt us in anyway, and it hasn't. On redshirt junior kicker Josh Lambert He's had a rough go of it. He had an injury in camp that we have talked about, and that has kept him from full speed until the week before the first game. He has been playing catch-up, and then he has been under the weather here the last couple weeks. He is fighting hard. He is trying. He has the right mentality. It's just the physical nature of what has to exist, and that is not there right now. The good news is that it's not a goofy kicker thing. He's trying, and we all believe in him. He has to get healthy, and he is not quite there right now. On installing new plays offensively during the bye week that he does not normally do on a weekly basis There are always wrinkles that we can work on a little bit. Yeah. We are going to put in the wishbone, do some Wing-T things. We run the quarterback so much anyways that we are going to start pitching it left and right. No. Again, offensively it is about improvement. The only way you improve is to keep doing the same thing over and over again until it becomes second nature and you are not focusing on what to do. You are comfortable on what to do, and you know how to do it. You have to keep getting better and better at it. It's the only way to get better. We have a system that we believe in, and we have players that we believe in. We have coaches that we believe in. We are just going to keep doing it, and we are going to keep getting better at it. It's the only approach. I don't think what we are doing is the problem. I think we need to keep doing it to the point where it becomes second nature, and we are better at it. On scrimmaging the redshirt players We scrimmage those guys every Thursday, so we won't do anything different this week. It is more about rest. I think getting guys away from it is important. We are here so much, and obviously with the 20-hour rule, we can't keep them a whole lot more than that anyways. The guys come up, and they are here a lot. Having down time is important. We gave them Sunday off, and we gave them Monday off. We will give them Friday off. It's not like they can take any mini-vacations or anything like that, but they can just have some down time to be normal student-athletes. I think that is important. With that said, the young developmental guys are always developing. They have separate developmental lift times. Sometimes when we are meeting on some things, they are downstairs getting a developmental lift in. How much time can you actually practice those guys? We devote Thursday nights as that day. This Thursday we can't do it because we have to go recruit, but next Tuesday we will practice those guys again. Who looks good, and who doesn't? I don't know. They just have to keep playing. Share", "external_links": [], "published": "2015-10-21T01:41:00.000+03:00", "crawled": "2015-10-22T11:57:59.158+03:00", "highlightTitle": ""}