{"organizations": [], "uuid": "1aa6d1be7921d2924e15e6a173bc2560c7c81ea1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "cjonline.com", "main_image": "http://cjonline.com/sites/default/files/14793673.jpg", "site_section": "http://cjonline.com/taxonomy/term/2/feed", "section_title": "Sports", "url": "http://cjonline.com/sports/2015-10-08/wu-football-looking-stay-miaa-hunt-heading-clash-central-missouri", "country": "US", "title": "WU football looking to stay in MIAA hunt heading into clash with Central Missouri", "performance_score": 0, "site": "cjonline.com", "participants_count": 1, "title_full": "WU football looking to stay in MIAA hunt heading into clash with Central Missouri", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T22:13:00.000+03:00", "replies_count": 0, "uuid": "1aa6d1be7921d2924e15e6a173bc2560c7c81ea1"}, "author": "Rick Peterson Jr.", "url": "http://cjonline.com/sports/2015-10-08/wu-football-looking-stay-miaa-hunt-heading-clash-central-missouri", "ord_in_thread": 0, "title": "WU football looking to stay in MIAA hunt heading into clash with Central Missouri", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WU football looking to stay in MIAA hunt heading into clash with Central Missouri Ichabods meet Mules in MIAA TV Game of the Week Saturday Posted: October 8, 2015 - 2:13pm Photos FILE PHOTOGRAPH/THE CAPITAL-JOURNAL Washburn quarterback Derek McGinnis and the Ichabods host Central Missouri on Saturday at Yager Stadium. Both teams enter with 3-2 records. By Rick Peterson Jr. richard.peterson@cjonline.com \nLike Washburn, Central Missouri’s season has been highlighted by a couple impressive wins but hindered by a couple heartbreaking losses. \nWith identical records of 3-2, both teams will be battling to stay in the MIAA hunt when the Ichabods meet the Mules at 2:37 p.m. Saturday at Yager Stadium for the MIAA Television Game of the Week. \n“They’re in the same boat we are,” WU coach Craig Schurig said. “They’ve had a very tough schedule, and they’ve played well. The two games they’ve lost, they very easily could have won. They’re as strong of a team there is in the conference. \n“We know you’ve got to win these types of games if you want to be in the mix. We feel like we’re that kind of team. We have a couple losses on our record, but we feel like we’re right there. We just have to clean some things up.” \nUCM dropped a 45-34 decision to Emporia State in Week 2 and then surrendered a late lead to No. 3-ranked Northwest Missouri to take a 34-30 loss to the Bearcats. But the Mules rebounded to post blowout wins against Nebraska-Kearney (38-7) and Missouri Southern (54-10). \n“They throw a lot of different formations at you, trying to catch you out of position,” said WU linebacker Alec Steuber, who snagged two interceptions last week at Fort Hays State. “Their quarterback (Garrett Fugate) has a pretty good arm so we’re going to have to do well against the pass.” \nFugate has thrown for 294 yards per game while completing 59 percent of his passes with 11 touchdowns and three interceptions. Running back Markel Smith averages 64.4 yards per game on the ground while Jaylen Zachery has a team-high 22 catches for 489 yards with four touchdowns. \n“They really keep you off balance with all the things that they do, and they’ve always done that,” Schurig said. “Defensively, they’re very similar to what we faced against Pitt and Hays, in the sense that they’re strong up front, have good linebackers and a strong secondary. We feel like we match up well, but we’re going to have to win some one-on-one battles and cut down on some of those mental mistakes.” \nA recurring issue has been the Ichabods tendency to rack up penalty yardage. Washburn is the most penalized team in the conference, averaging 83.4 yards per game in penalties. \n“We’ve had good drives, but it’s been penalties that have killed us,” WU quarterback Derek McGinnis said. “If we pay attention and stop getting penalties this week, I think we’ll be just fine on the offensive side. \n“We know how big this game is for the MIAA and for our season. We’re working really hard this week to try and win this game on Saturday.” \nWashburn receiver Connor Crimmins is expected to miss his second straight game with a high-ankle sprain. \nSaturday’s game will be broadcast locally on Cox Channel Kansas. CENTRAL MISSOURI AT WASHBURN \nKickoff: 2:37 p.m. Saturday, Yager Stadium \nRadio: KTPK-FM (106.9) \nRecords: Central Missouri 3-2, 3-2 MIAA; Washburn 3-2, 3-2 \nNext: Washburn at Missouri Western, Oct. 17 \nRick Jr. Peterson can be reached at (785) 295-1290 or rick.peterson.jr@cjonline.com .Follow Rick Jr. on Twitter @RickiePeterson .", "external_links": [], "published": "2015-10-08T22:13:00.000+03:00", "crawled": "2015-10-09T03:58:25.624+03:00", "highlightTitle": ""}