{"organizations": [], "uuid": "a98704b8bbe5dc173287fac839d16c3c40d7ed77", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/4cc3c6b250c661a2f2b970a26b7cf956.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/cricket/one-eye-on-weather-as-west-indies-hold-hopes-of-sri-lanka-wi/6983313/", "country": "JE", "title": "One eye on weather as West Indies hold hopes of Sri Lanka win", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "One eye on weather as West Indies hold hopes of Sri Lanka win", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T14:46:00.000+03:00", "replies_count": 0, "uuid": "a98704b8bbe5dc173287fac839d16c3c40d7ed77"}, "author": "", "url": "http://www.sport.co.uk/cricket/one-eye-on-weather-as-west-indies-hold-hopes-of-sri-lanka-wi/6983313/", "ord_in_thread": 0, "title": "One eye on weather as West Indies hold hopes of Sri Lanka win", "locations": ["West Indies", "Sri Lanka"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "One eye on weather as West Indies hold hopes of Sri Lanka win 24 Oct 2015 11:46:56 \ncomments \nThe second Test between Sri Lanka and West Indies is delicately poised after day three but there are fears the weather could have the final say in Colombo. \nThe tourists bowled out Sri Lanka for 206 in the second innings to leave themselves with a target of 244 for victory. \nThey made it to 20 for one before tea, but there was no play thereafter as rain began to fall and more is forecast, with an early start scheduled for Sunday as a result. \nSri Lanka began the day on 76 for two but soon lost Kaushal Silva, who added only one to his overnight score of 31 before edging Jomel Warrican into the slips. \nJust two balls later, Dinesh Chandimal followed for 12 thanks to an inside edge off Jerome Taylor which was pouched by Denesh Ramdin, leaving Sri Lanka on 84 for four. \nAngelo Mathews and Milinda Siriwardana set about rebuilding the innings, with the latter smacking two sixes as they got the scoreboard moving. \nHowever, their partnership ended when Kraigg Brathwaite bowled around the wicket and found an outside edge which Jermaine Blackwood snapped up to send Siriwardana back for 42. \nMathews stuck around a while longer, making 46 before an ambitious reverse-sweep helped Brathwaite bring up his maiden Test five-for, but his partners had been departing regularly and by that point Sri Lanka were on 206 for nine. \nMoments later, Brathwaite had his sixth victim as Nuwan Pradeep went for a duck and Sri Lanka were done. \nBrathwaite could not perform any such heroics with the bat, trapped lbw by Dhammika Prasad for just three as West Indies began their reply, but Shai Hope had quickly made 16 as the tourists made some progress before the close. Related Sport News", "external_links": [], "published": "2015-10-24T14:46:00.000+03:00", "crawled": "2015-10-24T20:22:44.822+03:00", "highlightTitle": ""}