{"organizations": [], "uuid": "4493a8df19294b7eb2d7189508a36c40cb2382aa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/ncaafb", "section_title": "NCAA FB News, Scores, Schedule, Standings, Stats, Photos, Videos - Football - MSN Sports", "url": "http://www.msn.com/en-us/sports/ncaafb/college-footballs-reality-is-running-away-from-polls/ar-AAf6MRn", "country": "US", "title": "College Football's Reality Is Running Away From Polls", "performance_score": 0, "site": "msn.com", "participants_count": 13, "title_full": "College Football's Reality Is Running Away From Polls", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 13, "uuid": "dffbf0e31aaae7700e091c3b7551efc2f4c0ce2d"}, "author": "Samuel Chi", "url": "http://www.msn.com/en-us/sports/ncaafb/college-footballs-reality-is-running-away-from-polls/ar-AAf6MRn#post-0", "ord_in_thread": 0, "title": "College Football's Reality Is Running Away From Polls", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "College Football's Reality Is Running Away From Polls ThePostGame 1 day ago Samuel Chi © Provided by ThePostGame Northwestern The worst flaw of the now defunct Bowl Championship Series was its heavy use of the polls. For the final 10 years of the BCS, the polls accounted for two-thirds of the formula, effectively dictating the championship matchup every year. Never mind that the polls -- especially the Coaches poll -- were fraught with biases and willful ignorance.\nOn the other hand, the College Football Playoff has only been around a year, but there are two things the committee has gotten it right. One, wait until November before ranking teams; two, treat the season in totality each week, not as an extension of the previous week.\nAdChoices The first week of October in the 2015 season showed us why. Four teams in the AP top 10 lost and the top two teams looked so pedestrian it once again called their legitimacy into question. But because the polls are hopelessly married to their own preseason rankings -- and preconceptions and prejudices -- the voters largely just shuffled their rankings instead of starting from scratch.\nBut with a quarter of the season in the books and conference season having started, we have enough data points to look at how things really stand. They don't reflect very much what was predicted in the preseason and certainly don't look much like the polls:\nACC\nPreseason forecast : Clemson will challenge Florida State in the Atlantic while Georgia Tech should dominate the Coastal.\nReality at the moment : Things have gone according to plan in the Atlantic while Georgia Tech is a wreck and not a rambling one, after three consecutive losses.\nWhat the future might hold : Clemson lost just four ACC games in the past three seasons, three of them to the Seminoles, denying it a chance to play for the conference championship each season. But the Seminoles are not the championship-caliber teams they were with Jameis Winston and the Tigers will get its chance to dethrone them on Nov. 7. In the Coastal, it might come down to UNC-Duke, like it always is in basketball.\nBig 12\nPreseason forecast : The \"One True Champion\" will actually be settled on the field as TCU and Baylor face each other in the season finale.\nReality at the moment : Both the Frogs and Bears are still unbeaten -- and ranked second and third in the AP poll, respectively -- despite some uneven performances caused by defensive deficiencies. They're still on that collision course.\nWhat the future might hold : The conference's old standard-bearer Oklahoma will have something to say about who wins the Big 12. The Sooners play Baylor, TCU and Oklahoma State -- the three other unbeaten Big 12 teams -- in consecutive weeks to close out the regular season.\nBig Ten\nPreseason forecast : Defending national champion Ohio State will sail through to the playoff once again, provided it gets by pesky Michigan State in the regular season.\nReality at the moment : The Buckeyes and Spartans are thought to be the two best teams in the country, at least by the pollsters as of last week, but they might not even be the two best teams in the Big Ten. Both teams limped to their respective 5-0 records having beaten just one team with a winning record each.\nWhat the future might hold : It's possible the conference's real two best teams are meeting next week. No. 18 Michigan is hosting No. 13 Northwestern in a game featuring the Big Ten's two best defenses. The Wolverines, with new coach Jim Harbaugh fast-tracking a rebuilding project, are looking formidable and get to play both Michigan State and Ohio State at the Big House.\nPac-12\nPreseason forecast : Oregon will breeze through the North while a five-way scrum will settle the South.\nReality at the moment : Only two conference teams are unbeaten and that will be reduced to one next week as No. 23 Cal goes to Salt Lake City to take on No. 5 Utah. They're certainly not the two teams anyone picked to win the respective divisions, but they're the last ones without a loss in a conference that's as competitive as predicted.\nWhat the future might hold : Every team in the South -- except Utah -- already has at least one conference loss each and the race may still be decided in the showdown between the L.A. schools in the final week of the season. In the North, would you believe that it may come down to the Big Game?\nSEC\nPreseason forecast : The SEC West is so tough that every teams should be ranked in the top 25 (and all were at some point of the season). The East should be a cakewalk for Georgia.\nReality at the moment : Alabama, left for dead after losing to Ole Miss, is far from that after trouncing not-for-prime-time Georgia between the hedges. That, combined with the Rebels' blowout loss at Florida, puts the Tide right back in the tight West race, with LSU and Texas A&M the only unbeatens in the division.\nWhat the future might hold : While the only teams we can write off for certain are Auburn and Arkansas, the East will be settled at the World's Largest Outdoor Cocktail Party. Florida, off to a surprising 5-0 start, is poised to derail another promising season for Mark Richt's Bulldogs.\nGroup of Five\nPreseason forecast : Boise State is the heavy favorite to once again secure the automatic entry reserved for the top Group of Five champion.\nReality at the moment : The 25th-ranked Broncos lost to independent BYU but remains very much in the hunt. A quartet of teams have emerged from the American Athletic as potential challengers (Houston, Temple, Memphis and Navy, respectively ranked just outside of the top 25 at Nos. 28-31), as is No. 24 Toledo from the MAC.\nWhat the future might hold : Each of the aforementioned teams except Navy has beaten at least one Power 5 opponent. But the Broncos, with two wins over Power 5 teams (Washington and Virginia) hold the trump card if they win out because of their brand recognition.\nGame of the Week\nClemson 24, Notre Dame 22 : If the Irish's playoff hopes didn't die in the Clemson muck, it's at best on life support. By falling behind early and failing to score on the two-point conversion to tie the score late, Notre Dame was exposed as a team that padded its record by pounding weaklings (combined record of the four teams it beat is 5-13). The Irish's only path to the playoff now is finish 11-1, defeat both USC and Stanford and hope one of those teams win the Pac-12.\nPlayer of the Week\n© Provided by ThePostGame Ezekiel Elliott Ezekiel Elliott, Ohio State : The junior running back rushed for a career-high 274 yards and scored three touchdowns to rescue the Buckeyes from an upset loss at Indiana and remain No. 1. Without his second-half touchdown runs of 55, 65 and 75 yards, Ohio State's repeat title quest would've hit a serious bump.\nOur rankings\nJust like the committee, we bake this pie fresh every week:\n1. Utah, 2. Clemson, 3. Oklahoma, 4. Michigan State, 5. TCU, 6. Northwestern, 7. Florida, 8. LSU, 9. Ohio State, 10. Texas A&M, 11. Baylor, 12. Florida State, 13. Michigan, 14. Notre Dame, 15. Stanford.\n-- Samuel Chi is the managing editor of RealClearSports.com and proprietor of College Football Exchange . Follow him on Twitter at @ThePlayoffGuru .\nGo to MSN Home", "external_links": ["http://www.realclearsports.com/", "http://go.microsoft.com/fwlink/?LinkID=286759", "http://www.twitter.com/theplayoffguru", "http://www.collegefootballexchange.com/"], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-06T23:08:26.108+03:00", "highlightTitle": ""}