{"organizations": [], "uuid": "08fb041706604a9c8446f41e4ea770f91c001bea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.oregonlive.com", "main_image": "http://imgick.oregonlive.com/home/brightcove01/width620/img/13/260825828001/201510/1380/260825828001_4525052700001_2015-1001-montage-A.jpg?pubId=260825828001", "site_section": "http://www.oregonlive.com/", "section_title": "Oregon Local News, Breaking News, Sports &amp; Weather - OregonLive.com", "url": "http://www.oregonlive.com/politics/index.ssf/2015/10/oregon_college_shooting_umpqua.html", "country": "US", "title": "Inside Umpqua Community College: Pop, pop, pop — then panic", "performance_score": 0, "site": "oregonlive.com", "participants_count": 1, "title_full": "Inside Umpqua Community College: Pop, pop, pop — then panic | OregonLive.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T04:24:00.000+03:00", "replies_count": 0, "uuid": "08fb041706604a9c8446f41e4ea770f91c001bea"}, "author": "Denis C. Theriault | The Oregonian/OregonLive", "url": "http://www.oregonlive.com/politics/index.ssf/2015/10/oregon_college_shooting_umpqua.html", "ord_in_thread": 0, "title": "Inside Umpqua Community College: Pop, pop, pop — then panic", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ROSEBURG — Jenny Friedman watched the students rushing past her office with wonder.\nThe English instructor looked at the clock — 10:38 a.m., 12 minutes before classes in Umpqua Community College's Snyder Hall were supposed to let out. Something was wrong.\n\"We are in a lockdown, and this is not a drill,\" another instructor barked after Friedman stepped into the stream of students.\nShe darted back inside with her office-mate, pulling the blinds, locking the door and huddling under her desk. They waited. Then came more running, then screams and then shots — bam, bam, bam, in quick succession. The quiet returned.\n\"Fifteen shots,\" she told The Oregonian/OregonLive on Thursday. \"That was it.\"\nSome of those shots came from the 26-year-old gunman. Some came from police. Minutes after a puzzled Friedman first checked her clock — the same time frantic students started calling 911 — officers broadcast a grisly discovery.\n\"Suspect is down,\" the officers who rushed to Snyder Hall told dispatchers. \"We've got multiple gunshot wounds. We're going to need multiple ambulances.\"\nTen people died, including the gunman, authorities confirmed Thursday. Seven others were wounded, three critically. And survivors in Snyder Hall and all across the campus were left to process what had happened.\n\"I have no cellphone, car keys, house keys or wallet, but I'm home,\" Amy Fair, an English professor at Umpqua, posted on Facebook after the shooting. She had been checked by police officers, loaded on a bus like others and driven to the Douglas County Fairgrounds.\nHer writing class shared a wall with the classroom where the shooting started.\n\"So glad to be safe, but I'm still a little shellshocked,\" Fair wrote. \"Those of us who were on campus know less than everyone else — they weren't telling us anything.\"\nA freshman in Fair's class, Hannah Miles, said the first shot sounded like a loud pop. Her classmates were startled, and the room got quiet, but Fair resumed teaching.\nThen, again: pop, pop.\nFair knocked on the door of the adjoining classroom where it seemed like the noises were coming from. There wasn't an answer. Just three to five more pops. That was when Fair told the class to leave.\nThey ran toward the center of the campus and hid in a small room in the campus bookstore. Miles left her keys and wallet behind. She borrowed a phone to call her father, who prayed with her over the line.\nAnother English professor, Jillanne Michell, described the sudden commotion Thursday in Snyder Hall, where at least four English classes were in session.\nIn all, 35 people were in the building when shots rang out. Like Friedman, Michell counted several.\n\"I heard the shots,\" Michell said. \"It was a lot.\"\n Douglas County's 911 dispatchers, taking their first call at 10:38 a.m., were beset almost immediately with calls detailing bloodshed.\n\"Somebody is outside one of the doors, shooting at the doors,\" they reported, according to 911 audio. \"We have one female that has been shot at this time.\"\nPolice arrived at Snyder Hall within minutes of the first call, identifying the shooter as a man and saying they found him on the building's southeast side. They used the words \"long gun\" — a rifle or shotgun — to describe his weapon. An email went out on campus telling students and staff to shelter in place.\nSix minutes after the first call, at 10:44 a.m., officers reported exchanging shots with the gunman. It wasn't clear late Thursday whether police killed the gunman or he shot himself.\nKortney Moore told the Roseburg News-Review she was in her writing class when a bullet blasted through the window. She saw her teacher shot in the head. Then she saw the shooter was in the classroom.\nHe told everyone to get on the ground, she told the newspaper, before asking them to stand up and state their religion. But he started firing everywhere.\nShe said she was on the ground next to people who'd been shot — waiting like others until police, finding the gunman dead, issued an all-clear.\nOne of Umpqua's board members, Wendy Weikum, said a student from a neighboring classroom called her soon after the shooting. She wanted to say she wouldn't be able to make her piano lesson Thursday night.\n\"She was very shaken up,\" Weikum said. \"I didn't ask any specifics. She just said she heard it.\"\nThe chaos that unfolded in Snyder Hall quickly rippled across Umpqua's campus and beyond.\nLorie Andrews, 57, who lives across the street from the campus, heard the shots while sitting on her back porch. She counted the police cars and ambulances — 75 and 20, respectively — that coursed in immediately after.\nMcCrae Kittleman, 17, was sitting through a math class in Umpqua's science building, just a short walk from Snyder Hall, when a professor sprinted into the room and broke the news.\n\"All of a sudden everyone was freaking out about stuff happening over in Snyder Hall, which is right next-door,\" said Kittelman, who gave interviews to Fox News and others while under lockdown. \"One girl got a call saying a friend of hers was shot, which was really hard.\"\nWithin minutes, Kittelman said, his mother had heard the news and was texting him to see whether he was OK. He said he was.\nAnd as loud as the gunfire was for the dozens of students hiding or running for their lives in Snyder Hall, the wait inside the science building was eerily silent.\n\"That was one of the most strange and disquieting parts,\" Kittelman said. \"There were no sounds at all.\"\nKittelman's mother, a Douglas County commissioner from 2004-08 and an editor of Roseburg's Beacon newspaper, stood at the closed-off intersection outside the college as the first buses left campus.\n\"I waved at him,\" Marilyn Kittelman said. \"It's just a relief.\"\nStaff writers Lynne Terry, Carli Brosseau, Jim Ryan, Emily E. Smith, Rebecca Woolington, Mike Rogoway, Andrew Greif, Anna Griffin and Casey Parks contributed to this report.\n— Denis C. Theriault\ndtheriault@oregonian.com\n503-221-8430; @TheriaultPDX", "external_links": [], "published": "2015-10-02T04:24:00.000+03:00", "crawled": "2015-10-02T10:20:22.296+03:00", "highlightTitle": ""}