{"organizations": [], "uuid": "1d2b02b8b11242c3b7b38e3e2db255c7a60f1d4b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.timesunion.com", "main_image": "http://ww3.hdnux.com/photos/41/24/24/8733990/3/rawImage.jpg", "site_section": "http://timesunion.com//home/collectionRss/Homepage-HCat-Sports-6377.php", "section_title": "Sports news", "url": "http://www.timesunion.com/sports/article/LEADING-OFF-AL-playoff-positioning-down-to-last-6548899.php", "country": "US", "title": "LEADING OFF: AL playoff positioning down to last day", "performance_score": 0, "site": "timesunion.com", "participants_count": 1, "title_full": "LEADING OFF: AL playoff positioning down to last day - Times Union", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T03:01:00.000+03:00", "replies_count": 0, "uuid": "1d2b02b8b11242c3b7b38e3e2db255c7a60f1d4b"}, "author": "timesunion.com", "url": "http://www.timesunion.com/sports/article/LEADING-OFF-AL-playoff-positioning-down-to-last-6548899.php", "ord_in_thread": 0, "title": "LEADING OFF: AL playoff positioning down to last day", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: LM Otero, AP Image 1 of / 8   8 Los Angeles Angels' Kole Calhoun celebrates with teammates after hitting a solo home run during the ninth inning of a baseball game against the Texas Rangers in Arlington, Texas, Saturday, Oct. 3, 2015. The Angels won 11-10.\nPhoto: LM Otero, AP Los Angeles Angels' Kole Calhoun celebrates with teammates after... Image 2 of 8 Los Angeles Angels' Garrett Richards delivers during a baseball game against the Oakland Athletics, Wednesday, Sept. 30, 2015, in Anaheim, Calif. (Kyusung Gong/The Orange County Register via AP) MAGS OUT; LOS ANGELES TIMES OUT; MANDATORY CREDIT\nPhoto: Kyusung Gong, AP Los Angeles Angels' Garrett Richards delivers during a baseball... Image 3 of 8 New York Yankees second baseman Rob Refsnyder dives for a shallow fly ball hit by Baltimore Orioles' Paul Janish in the eighth inning of the second baseball game of a doubleheader in Baltimore, Saturday, Oct. 3, 2015. Janish earned a single on the play. The Orioles won 4-3.\nPhoto: Gail Burton, AP New York Yankees second baseman Rob Refsnyder dives for a shallow... Image 4 of 8 Cincinnati Reds' Adam Duvall, left, rounds third after hitting a solo home run off Pittsburgh Pirates starting pitcher A.J. Burnett, right, in the seventh inning of a baseball game, Saturday, Oct. 3, 2015, in Pittsburgh.\nPhoto: Keith Srakocic, AP Cincinnati Reds' Adam Duvall, left, rounds third after hitting a... Image 5 of 8 Toronto Blue Jays' Mark Buehrle pitches to the Tampa Bay Rays during the first inning of a baseball game Friday, Oct. 2, 2015, in St. Petersburg, Fla.\nPhoto: Chris O'Meara, AP Toronto Blue Jays' Mark Buehrle pitches to the Tampa Bay Rays... Image 6 of 8 Chicago Cubs pitcher Kyle Hendricks delivers to the Milwaukee Brewers during the first inning of a baseball game Saturday, Oct. 3, 2015, in Milwaukee.\nPhoto: Darren Hauck, AP Chicago Cubs pitcher Kyle Hendricks delivers to the Milwaukee... Image 7 of 8 Houston Astros Colby Rasmus (28) celebrates with third base coach Gary Pettis after hitting a solo home run against the Arizona Diamondbacks in the forth inning during a baseball game, Saturday, Oct. 3, 2015, in Phoenix.\nPhoto: Rick Scuteri, AP Houston Astros Colby Rasmus (28) celebrates with third base coach... Image 8 of 8 LEADING OFF: AL playoff positioning down to last day 1  /  8 Back to Gallery A look at what's happening around the major leagues Sunday:\n___\nGO WEST\nAfter a rousing comeback win against Texas, the Angels send Garrett Richards to the mound on three days' rest with a chance to force a tiebreaker for the second AL wild card. Cole Hamels starts for Texas — the Rangers have won each of Hamels' last nine starts. Should Los Angeles win it would also need the Astros to lose at Arizona to force a tiebreaker Monday.\nHOME, AT LAST\nPittsburgh still needs a win or a Chicago Cubs loss to secure home-field advantage Wednesday night in the NL wild-card game. If the Cubs beat Milwaukee — and the Pirates lose to Cincinnati — the one-game playoff would be held at Wrigley Field. J.A. Happ starts the regular-season finale for the Pirates. The left-hander is 6-2 with a 2.04 ERA in 10 starts since being acquired from Seattle at the trade deadline. Dan Haren (10-9), a midseason addition to the Cubs, gets the ball against the Brewers.\nPINSTRIPED PROBLEMS\nThe Yankees entered Saturday with an opportunity to clinch home field in the AL wild-game but were swept by the Orioles in a doubleheader. If they win the regular-season finale against Baltimore with Michael Pineda (12-11) starting, they will play Tuesday at Yankee Stadium. Otherwise, they need help from the Astros.\nBATTNG CROWNS\nDetroit's Miguel Cabrera heads into Sunday with a .338 average and was headed to his fourth AL batting title in five years. In the NL, Washington's Bryce Harper was just ahead of Miami's Dee Gordon , .330754 to .330606\nSWING AND A MISS\nThe Los Angeles Dodgers ' Clayton Kershaw , the reigning NL MVP and Cy Young Award winner, enters his final regular-season start Sunday against San Diego with 294 strikeouts and could become the first pitcher to fan 300 in a season since Arizona's Randy Johnson in 2002.\nMARK UP?\nMark Buehrle may make the last regular-season start of his career, and on one day's rest to boot, in Toronto's season finale against Tampa Bay. The 16-year veteran is two innings shy of his 15th consecutive season with 200 or more innings, and so even though he threw 6 2-3 innings on Friday, manager John Gibbons is considering pitching the 36-year-old to get him to the mark. \"We'll see how Mark feels,\" Gibbons said Saturday.\nALL AT 3\nMajor League Baseball made the schedule for the final day of the regular season with all 15 games set to start at 3 p.m. EDT to add a bit of suspense to any remaining playoff races. The plan did get washed out, though. Atlanta and St. Louis were postponed by rain Saturday night and will play a doubleheader, with the first game starting at 1 p.m.", "external_links": [], "published": "2015-10-04T03:01:00.000+03:00", "crawled": "2015-10-04T07:18:06.288+03:00", "highlightTitle": ""}