{"organizations": [], "uuid": "6abc3d46e326766c233bc7be1505b543bcaa4651", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.northjersey.com", "main_image": "http://www.northjersey.com:80/polopoly_fs/1.1440042!/fileImage/httpImage/102215-mt-cubeddu.jpg", "site_section": "http://www.northjersey.com/cmlink/high-school-sports-rss.rss", "section_title": "High School Sports on NorthJersey.com", "url": "http://www.northjersey.com/sports/high-school-sports/boys-soccer/finding-a-new-footing-1.1440041", "country": "US", "title": "Boys Soccer: Montclair High heads into county tournament on hot streak", "performance_score": 0, "site": "northjersey.com", "participants_count": 0, "title_full": "Boys Soccer: Montclair High heads into county tournament on hot streak", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T23:24:00.000+03:00", "replies_count": 0, "uuid": "6abc3d46e326766c233bc7be1505b543bcaa4651"}, "author": "", "url": "http://www.northjersey.com/sports/high-school-sports/boys-soccer/finding-a-new-footing-1.1440041", "ord_in_thread": 0, "title": "Boys Soccer: Montclair High heads into county tournament on hot streak", "locations": ["Montclair"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Print \nAfter a decent start to the year, the Montclair High School boys soccer team dove head-first into a hot streak that saw them win seven of their next eight games and that helped them earn the third seed in the Essex County tournament. The Mounties now prepare for their quarterfinal game on Saturday, Oct. 24 at 3:30 p.m. when they will host either Montclair Kimberley Academy or Newark Academy in a Mountie double-header as they will play immediately following the girls soccer team's quarterfinal against Newark Academy at 1:30 p.m. Staff Photo by Nick Verhagen Michael Cubeddu looks to juke past a Columbia defender. \nEver since the season-opener on Sept. 7, head coach Jack Weber has been looking forward to what this year's squad has been capable of. \n\"The team's really grown up,\" Weber said. \"They've done a great job at realizing when to work harder, force teams to chase them, play quicker and take more risks and it's been a great reward for us.. They know when they need to do 'x', 'y' and 'z'.\" \nOne of the things that Weber is happiest about is that a lot of the decision making and motivation is coming from within and that they've been stepping to the plate on their own. One of the teams' biggest flaws in the beginning of the year was that they were making extremely avoidable mental mistakes. To see the team take that huge step in success goes to show that, like Weber said in the beginning, the talent on the team has always been there but they were getting in their own way. \nThe Mounties may only have 20 goals to their name through 13 game but, inversely, have allowed a mere six due in part to a consistent defensive effort and senior goalie Phillip Martin and his 35 saves. What's nice is that the offense has finally matched the defense and the Mounties have become an extremely well-rounded team, including having forced own goals in their road wins against Ocean Township and Irvington. \n\"A tell-tale sign that a team's been working harder is when they can force own goals,\" Weber said. \"You put somebody under so much pressure that their defense is forced to face the same direction as your offense and they make mistakes.\" \nWeber added that the team this year has become a very tight-knit group with everybody contributing and looking at the bigger picture and adhering to the gameplan. Weber is especially happy with how the defense has been performing after graduating four senior defensemen. As a whole, the Mounties have come together quite nicely. Whether it be their newly-found offense, their consistent defense or their leadership and synergy, the team is working together and firing on all cylinders. \nThe Mounties have played both MKA and Newark academy before, winning both games by a combined 4-1. Over the course of both game, the Mounties allowed only eight shots on goal, compared to taking 27. Along with forcing an own goal against MKA, sophomore Reece Bordick and seniors Ned Michalitsianos and Amani Marshall found the back of the net. \nIf the Mounties can win on Saturday, the semifinals will be held at Belleville on Wednesday, Oct. 28. \nEmail: verhagen@northjersey.com © 2015 North Jersey Media Group Tags:", "external_links": [], "published": "2015-10-23T23:24:00.000+03:00", "crawled": "2015-10-24T08:33:50.716+03:00", "highlightTitle": ""}