{"organizations": [], "uuid": "5b93662d79e1e926ec9dbc375379956f7b22e1ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.denverpost.com", "main_image": "http://extras.mnginteractive.com/live/media/site36/2015/1013/20151013__20151015_T5_ZTT15ADAMSBOE~p1.JPG", "site_section": "http://www.denverpost.com/", "section_title": "Colorado Breaking News, Sports, Weather, Traffic, Jobs - The Denver Post", "url": "http://www.denverpost.com/adamsco/ci_28963592/candidates-face-off-3-5-adams-county-school", "country": "US", "title": "Candidates face off in 3 of 5 Adams County school boards in Nov. races", "performance_score": 0, "site": "denverpost.com", "participants_count": 1, "title_full": "Candidates face off in 3 of 5 Adams County school boards in Nov. races - The Denver Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T20:01:00.000+03:00", "replies_count": 0, "uuid": "5b93662d79e1e926ec9dbc375379956f7b22e1ce"}, "author": "Megan Mitchell", "url": "http://www.denverpost.com/adamsco/ci_28963592/candidates-face-off-3-5-adams-county-school", "ord_in_thread": 0, "title": "Candidates face off in 3 of 5 Adams County school boards in Nov. races", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "School board races across the state this fall will have some of the greatest impacts in low-funded districts in which elected policymakers will address widespread capacity concerns and tight budgets that don't add up to the increased need.\nIn Adams County, where population growth has exponentially surpassed annual operating budgets , school board members face daunting challenges.\nOf five school districts in Adams County, three have at-large seats up for election this fall: Adams 12 Five Star Schools, Adams 50 in Westminster and School District 27J in Brighton.\nThe Adams 14 district in Commerce City and the Mapleton School District received the same number of candidate applications as seats open, so their elections were cancelled.\n\"I think it is a really high-stakes environment that school board members are voted into and serve in, and it should be reflective of the community,\" said Bruce Caughey, executive director of the Colorado Association of School Board Executives.\nCaughey said that in an exceptionally tight budget environment such as that of public education in Colorado, it is important for voters to elect people that will represent their priorities when making tough decisions on how to spend taxpayer money.\nAdvertisement \"It is unfortunate that so many in our communities don't know who is running for their school board,\" Caughey said. \"I think it is important that voters become informed.\" School District 27J, Brighton\nFive of the seven School District 27J Board of Education seats are open on the Nov. 3 ballot. The 27J directors are four-year terms with the exception of District 4, which is a two-year term.\nIn Districts 1, 4 and 7, all current board incumbents are running unopposed. That's Roberta Thimming for District 1, Kyle Farner in 4 and Gregory Piotraschke in 7. District 6 incumbent Teresa Gallegos is running against three challengers: Farid A. Jalil, Stanley Hiller and Luke Ricards. Candidates Lloyd Worth and Michael Landwehr are vying for director Donna Petrocco's vacated seat in District 3.\nThe district, which serves Brighton and parts of Commerce City and Thornton, also has a $248 million bond measure on the ballot this fall, the outcome of which will dictate the bulk of the new board's work in 2016 and onward, said district spokesperson Kevin Denke.\n\"Another factor is that we remain one of the lowest funded school districts in the state in terms of per-pupil revenue and mill levy override funding,\" he said. \"With no substantial changes expected at the state level in terms of educational funding, this board likely will have to weigh at some point the possibility of a mill levy override proposal to increase our operational funding.\"\nOther ongoing goals for the 27J education board include increasing graduation rates by 2 percent every year until a 95 percent rate is reached and maintained, and increasing composite ACT scores by .5 points every year. Adams 12 Five Star Schools\nA contested District 4 seat from the Adams 12 board of education election in 2013 is open again this year after a July 11, 2014, ruling by a Broomfield District Court judge that proclaimed that the sitting board member, Rico Figueroa, was not legally elected. Figueroa had filled the seat after it was discovered that the elected candidate lived outside district boundaries.\nFigueroa will not run again for that seat, which will only be a two-year term due to the unusual vacancy. The Adams 12 Board of Education has five directors that are typically elected to four-year staggered terms.\nThree candidates are running for District 4: Amira Amal Assad-Lucas, Brian M. Batz, who is serving on the board now after a mid-year appointment for Figueroa's seat , and Jessy Briton Hamilton.\nIn District 2, Daniel Garcia and Jamey Lockley are competing for Robert Willsey's vacated seat, and four candidates — Stephanie James, Jeff Jasica, Laura Mitchell and Teresa Thomson Walsh — are running for the district seat, to be vacated by current board president Mark Clark. Adams 50, Westminster\nThis year, three of five at-large director seats are up for election, with four candidates.\nIncumbents Ken Ciancio and Larry Dean \"Dino\" Valente, who currently serves as the board vice president, are running for reelection; newcomers Max Math and Paola Urgiles are challenging them. Mapleton School District\nMapleton Schools are located in generally unincorporated portions of south Adams County. Most schools are south of 92nd Avenue and north of 64th Avenue along the Interstate 25 corridor.\nThere are no elections for the Mapleton board this year because the two open seats will be filled by the only two candidates who applied for those seats — current board president Ken Winslow and Cindy Croisant, who has served on the board in the past. Adams 14, Commerce City\nThe Commerce City school district, which has an 81 percent at-risk student population, the highest in Adams County, will not have elections this year as three candidates, Timio Archuleta, Harvest Thomas, and incumbent David Rolla were the only people to file for candidacy for three open seats on the at-large, five-member board.\nMegan Mitchell:303-954-2650, mmitchell@denverpost.com or @MMitchelldp\nYourHub reporter Joe Rubino contributed to this report.", "external_links": [], "published": "2015-10-15T20:01:00.000+03:00", "crawled": "2015-10-15T14:11:44.213+03:00", "highlightTitle": ""}