{"organizations": ["Clippers"], "uuid": "93baaedaf86ba907df212f9512fcd59117ba7d73", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.torontosun.com", "main_image": "http://storage.torontosun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297756505863_ORIGINAL.jpg?quality=80&size=100x", "site_section": "http://www.torontosun.com/sports/rss.xml", "section_title": "Top Sports stories", "url": "http://www.torontosun.com/2015/10/04/raptors-ease-to-win-over-clippers-in-pre-season-opener", "country": "CA", "title": "Raptors ease to win over Clippers in pre-season opener", "performance_score": 0, "site": "torontosun.com", "participants_count": 0, "title_full": "Raptors ease to win over Clippers in pre-season opener", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T04:50:00.000+03:00", "replies_count": 0, "uuid": "93baaedaf86ba907df212f9512fcd59117ba7d73"}, "author": "", "url": "http://www.torontosun.com/2015/10/04/raptors-ease-to-win-over-clippers-in-pre-season-opener", "ord_in_thread": 0, "title": "Raptors ease to win over Clippers in pre-season opener", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Report an error VANCOUVER - \nPredictably and logically, given the tone training camp took, Raptors head coach Dwane Casey was only interested in what this group showed him defensively Sunday night as they opened the pre-season with a win over a veteran Los Angeles Clippers squad. \n“Just picking up stuff we are doing,” Casey said of his hopes going into the first game. “We are doing some different things defensively. Offensively we may look like we haven’t seen the offensive side of the ball yet, but I think defensively just making sure we are doing what we are supposed to do defensively.” \nCasey wasn’t exaggerating when he talked about the lack of attention the offence has received through training camp although they managed enough in a 93-73 pre-season opener victory. \nAll you had to do was watch the first quarter of Sunday night’s game when the starters were in for the bulk of the time to see the uncertainty there as the team introduced both a new starting small forward and power forward to the mix. \nThe small forward of course is DeMarre Carroll while the power forward, at least in the first pre-season game, was Patrick Patterson. \nBetween them they took one shot in the first quarter and that was a miss by Patterson. \nThat, too, wasn’t surprising given Carroll was impossible to speak to all week about anything but defence. \nCarroll wound up committing his fifth foul about four minutes into the third and that pretty much ended his night. \nBut through Carroll and through a week-long, intensive focus on everything defence Casey got almost everything he wanted. \nThere are sure to be quibbles about this and that when the team dissects the game tape before Monday’s test against the defending champion Golden State Warriors in San Jose, Calif., but first time out of the gate, the defensive culture that went missing a year ago appears to have been relocated. \nThe Clippers, who already had a game under their belts before arriving in Vancouver, never found a rhythm against the Raptors. The only easy baskets were run-outs on turnovers or the odd DeAndre Jordan jam off some of those Chris Paul lobs. \nEverything else was earned. \nThe Clippers shot just 42% through three quarters after which the starters for both teams took a seat. \nSome other takeaways from the first game: \n- The leaner Kyle Lowry is more active than ever and just as deadly. On top of that he got to the line 12 times and converted 11 in a team-high 26-point performance in just 21 minutes. \n- This coming off the bench stuff seems to agree with Terrence Ross. Ross was clearly more comfortable and at ease in the role and through one game is showing renewed interest in his defensive role. Ross had six points and four steals while getting to the line four times in just 16 minutes. \n- Luis Scola may be 35 but he has plenty left. Scola had 13 points and eight rebounds in just 18 minutes. Between he and Ross they were the leaders on a second unit that fans are wondering about with the loss of Lou Williams and Greivis Vasquez. The second unit looked in good hands with those two leading the way Sunday night. \n- In addition to Bennett’s shoulder injury, three other Raptors were held out with various hurts. James Johnson has a sore left Achilles, Lucas Nogueira has a sore left hamstring and Axel Toupans has a sore right ankle. \nmike.ganter@sunmedia.ca", "external_links": [], "published": "2015-10-05T04:50:00.000+03:00", "crawled": "2015-10-05T05:13:35.843+03:00", "highlightTitle": ""}