{"organizations": ["Dodgers"], "uuid": "daa60c0f14238d083a962eb19a1470ef4042b170", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.desmoinesregister.com", "main_image": "http://www.gannett-cdn.com/-mm-/b456ef42d286ec42ff8f218f98518528aa690111/c=0-93-1999-1222&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/02/DesMoines/B9319114573Z.1_20151002235504_000_G93C4DRTO.1-0.jpg", "site_section": "http://rssfeeds.desmoinesregister.com/desmoines/highschoolsports", "section_title": "Des Moines - High School Sports", "url": "http://www.desmoinesregister.com/story/sports/high-school/2015/10/02/chris-cuellar-iowa-high-school-football-take-five-fort-dodge/73265132/", "country": "US", "title": "Take Five: Unusual uncertainty this late in prep season", "performance_score": 0, "site": "desmoinesregister.com", "participants_count": 0, "title_full": "Take Five: Unusual uncertainty this late in prep season", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T07:29:00.000+03:00", "replies_count": 0, "uuid": "daa60c0f14238d083a962eb19a1470ef4042b170"}, "author": "", "url": "http://www.desmoinesregister.com/story/sports/high-school/2015/10/02/chris-cuellar-iowa-high-school-football-take-five-fort-dodge/73265132/", "ord_in_thread": 0, "title": "Take Five: Unusual uncertainty this late in prep season", "locations": ["Indianola"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sam Cook", "Chris Cuellar"], "text": "Take Five: Unusual uncertainty this late in prep season Chris Cuellar , ccuellar@dmreg.com 11:29 p.m. CDT October 2, 2015 Fort Dodge senior Sam Cook looks for running room against Indianola on Friday night. The Dodgers faced their stiffest challenge of the season in the road matchup but still walked away with a 49-36 victory to move to 6-0. (Photo: MICHAEL ROLANDS/INDIANOLA RECORD-HERALD) CONNECT 1 TWEET LINKEDIN COMMENT EMAIL MORE \nWe're supposed to know how Iowa high school football will play out two-thirds of the way through the season, right? \nThe great games are making that difficult. Class 1A is competitive, No. 1 teams are safe and the Class 4A District 4 race will come down to the wire, but that's about all we know. \nLet's Take Five and break it down. \n1. Tribute from District 4 \nFourth-ranked Fort Dodge sits atop what should be the best district free-for-all in Class 4A. But the competition showed Friday night it was closing the gap. \nPreviously-ranked Indianola gave the Dodgers their toughest test , simply by being the first opponent to score on coach Matt Miller's squad by halftime. The Dodgers (6-0, 2-0) raced to a big lead before hanging on 49-36. \nThe Indians (3-3, 0-2) are gatekeepers of the final playoff spot — Marshalltown (3-3, 1-1) beat Mason City (1-5, 0-2) 20-7 at home — so it's up to the athletic and battle-tested teams, Waukee and Urbandale, to challenge Fort Dodge. \nThe Warriors (4-2, 2-0) are next in line after knocking off No. 9 Urbandale (3-3, 1-1) on the road 28-14. How messy will things get in the final three weeks? \n2. Big schools, big blowouts \nIf you're sensitive to ugly scores, avert your eyes. \nNo. 2 Valley (5-1) crushed Council Bluffs Abraham Lincoln 69-0 in West Des Moines. Suburban squads Johnston and Ankeny took down Des Moines Roosevelt and East 49-0 and 49-7, respectively. Ankeny Centennial had even less trouble at Hoover, running out to a 52-0 halftime lead. \nDistrict play in 4A can produce some distinct mismatches, and Week 6 was full of them. Both teams have to try and make the best of what can be a bad situation, often inside the first quarter. \n\"We can't control what they can or can't do,\" Valley coach Gary Swenson told Central Iowa Sports Network with a 48-0 halftime lead. \"You've got to get your starters a good half of football, then you can sub down and see what happens with everybody else. \n\"If they can't stop us, we can't help that.\" Friday's Class 4A football recaps \n3. Competition shakes up Class 1A \nFriday's night's best games belonged to 1A. District implications met ranked matchups and produced finishes that will certainly shake up the classification's rankings and playoff picture. \nSecond-ranked Madrid had a 20-0 lead early against 2014 semifinalist Fort Dodge St. Edmond, but allowed 31 straight points on the road. The Gaels (3-3) held on 31-26 and handed Madrid (5-1) an important District 7 defeat. \nSenior running back Terrill Heinrich kept No. 4 Hinton (6-0) unbeaten by rushing in the go-ahead touchdown against West Lyon with 93 seconds left. The eighth-ranked Wildcats (4-2) have played in back-to-back title games, but now need help to win District 2. \nAnd back in central Iowa, Van Meter (5-1) had its defense turn up when it mattered most at No. 5 Panorama. The Bulldogs trailed at halftime 14-13 but emerged with a 28-14 win. Panorama (5-1) saw what other District 8 teams will: Van Meter has shut out three other opponents for a reason. \n4. Pride of Pleasantville \nCoach Gabe Bakker's team snapped a five-year playoff drought last season, but it was hardly a breakthrough. The Trojans finished 5-5 and limped in as a fourth-place qualifier. Through six weeks in 2015, it's fair to call Pleasantville a Class A powerhouse. \nRising to third in the Register rankings after an impressive 5-0 start, Pleasantville was supposed to get its toughest test at Earlham on Friday and instead posted its fourth shutout of the season. The 40-0 road drubbing means the Trojans have allowed just 13 points all season. Senior quarterback Zeb Adreon has accounted for more than 13 touchdowns already. \n5. Hockenson still chasing history \nChariton senior T.J. Hockenson keeps edging closer to the top of Iowa's all-time receiving charts, and Friday's performance at No. 7 Norwalk helped his cause: 16 receptions for 165 yards and two touchdowns. The 6-foot-5 Iowa tight end recruit is on the verge of holding career records on his own. \nHockenson's 45 touchdown receptions are second all-time, and just one behind Pleasantville's Grant McGraw. Another 16-catch night would tie him for the most receptions in state history; Hockenson is at 209, and Cherokee's Chris Campbell set the mark at 225. \nThe long shot is receiving yardage. Hockenson became the third player in Iowa history to cross 3,000 receiving yards on Friday night and finished the game at 3,150. That's third behind McGraw (3,710) and South Winneshiek's Jordan Rommes (3,340). Chariton plays Knoxville (4-2) next week.", "external_links": [], "published": "2015-10-03T07:29:00.000+03:00", "crawled": "2015-10-03T08:38:53.652+03:00", "highlightTitle": ""}