{"organizations": [], "uuid": "0e0d2f0c9d17c15400c8d808832011cb4945cc0d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "savannahnow.com", "main_image": "http://savannahnow.com/sites/default/files/14788012.jpg", "site_section": "http://savannahnow.com/", "section_title": "savannahnow.com | Savannah Georgia's source for News, Entertainment, Sports, Weather, Classifieds, Jobs, Autos, Real Estate and St. Patricks Day", "url": "http://savannahnow.com/do/2015-10-08/interactive-dinner-theater-becomes-halloween-attraction", "country": "US", "title": "Interactive dinner theater becomes a Halloween attraction | savannahnow.com", "performance_score": 0, "site": "savannahnow.com", "participants_count": 1, "title_full": "Interactive dinner theater becomes a Halloween attraction | savannahnow.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T20:34:00.000+03:00", "replies_count": 0, "uuid": "0e0d2f0c9d17c15400c8d808832011cb4945cc0d"}, "author": "Linda Sickler", "url": "http://savannahnow.com/do/2015-10-08/interactive-dinner-theater-becomes-halloween-attraction", "ord_in_thread": 0, "title": "Interactive dinner theater becomes a Halloween attraction | savannahnow.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photos Back | Next Photo by Megan Jones Odd Lot's Halloween Murder Mystery cast Back | Next Photo by Megan Jones Odd Lot's Halloween Murder Mystery cast Back | Next Photo by Megan Jones Odd Lot's Halloween Murder Mystery cast Back | Next Photo by Megan Jones Odd Lot's Halloween Murder Mystery cast\nBy Linda Sickler The murder-mystery dinner theater presented Fridays at Savannah Coffee Roasters will have a seasonal twist throughout the month of October.\nJustin P. Kent is the owner of Odd Lot Productions, which presents On the Spot Mysteries.\n“The murder mystery we’ve been doing all summer has been really successful,” he says. “If it’s not sold out, it’s right close to it.\n“The Halloween version is essentially the same thing. We’ve just come up with some ridiculous Halloween-style characters.\n“We have a vampire, a mad scientist, a bizarre crow man, nurses, the whole thing,” Kent says. “It’s full of crazy Halloween characters, but we go through the same basic murder mystery we’ve been doing.”\nThe show is unique in Savannah.\n“To the best of my knowledge, I don’t know of anyone else doing anything like it, so we’re really proud of it,” Kent says. “The audience gets to choose who plays the characters — a detective and three suspects.\n“The audience gets to choose the murder victim and what they did for a living and things like that,” he says. “We all get into our characters and improvise a murder mystery that night.”\nPatrons are loving the show.\n“We’ve had a great response,” Kent says. “We’ve gotten some really nice reviews on TripAdvistor.”\nThe $40 cost of admission includes food.\n“They get a three-course gourmet meal,” says Lori Collins, owner of Savannah Coffee Roasters. “We make everything on site. We have five chefs here.\n“We’re very fussy about our food. We usually have a good choice of salad or soup.\n“Diners have three choices of entrees,” she says. “Lately we’ve had pork ribeye with an applesauce, risotto and last week we had ravioli. Dessert is whatever the chef’s inspiration has been.”\nThe combination has been very successful.\n“It’s been sold out every week except for the last three,” Collins says. “If we get 60 people, we do it downstairs and set up tables in the foyer.\n“We don’t like to do much more than 60, but we could do 65,” she says. “If there are no more than 40, we seat them upstairs. Everybody needs to be able to see the actors at the same time.”\nThe Halloween version is especially exciting, Collins says.\n“It’s a legitimate time for adults to dress up and be silly, so we’re encouraging people to dress up,” she says. “One couple is dressing up as the Sanderson sisters, who were hung for being witches.”\nThe four actors in the show have as much fun as the audience.\n“All of us are enjoying it so much,” Kent says. “It is one of our favorite things. But we were a little nervous starting out.\n“We had this idea to do an improvisational murder mystery, but we wondered if we would be able to create a definite storyline on the spot,” he says. “But it flows so well and is so much fun.”\nThe Halloween version will lead to a holiday edition in November. The show is suitable for all ages.\n“We always make everything we do family friendly,” Kent says. “Kids always have an interesting take on our characters and show.\n“It’s always different and the crowd that comes in always makes it different,” he says. “We always work with the crowd.”\nActors who participate include Kent, Lynita Spivey, John Dorsey, Marshall Frey, Megan Jones, Sarah Makar, Thomas Houston, Chris Soucy and Darren Newton. All are members of Odd Lot.\n“There is no script,” Kent says. “We have a basic formula for a murder mystery where we present characters and motives, but every time the show is one we come up with on the spot.\n“If you come back, you may get the same cast, but you won’t necessarily get the same characters. It’s not always the same cast, either.\n“There’s just no way to make it the same thing twice, even if we wanted to,” he says. “It’s an interesting animal we’ve created that’s kind of come into its own.”\nThe relationship between Odd Lot and Savannah Coffee Roasters began almost before the restaurant opened its doors.\n“(Odd Lot members) Chris Soucy and Megan Jones came in here pretty much the first week we opened, and they loved the space,” Collins says. “They were looking for a home for their shows.\n“Last year we were doing the murder mystery,” she says. “But it was really only moderately successful because we weren’t doing it with dinner.”\nTourists turn the experience into an entire evening of entertainment.\n“They definitely want to do a ghost tour as part of it when they come,” Collins says. “We found we were losing people because we were booking at 7 and 7:30 p.m.\n“Chris and I got together and decided to do it early. We get young people in their mid-20s up to people in their mid-70s.\n“Friday night is the perfect night for it,” she says. “They’ve arrived for the weekend and it’s something to do.”\nThe menu changes every week.\n“It always gourmet,” Collins says. “The cost is $25 for the meal and $15 for the show.\n“We keep a varied international menu and the show is always different,” she says. “We’ve had people coming back for a second show already.”\nGuests are seated family style.\n“It’s a very nice way to meet people, particularly if you don’t know anyone local,” Collins says. “If we’ve got tourists, we try to mix them with locals. They all get to talking because the show is so interactive.”\nReservations are highly recommended.\n“It’s a great combination of dinner and a show,” Collins says. “We have such a load of space, but it fills up.\n“Often, we have last-minute tickets,” she says. “Always call us up because we don’t like to turn anyone away.”\nAs a result of their success, Odd Lot is getting requests for public events and has done some corporate events.\n“I’m already getting calls about Christmas parties,” Kent says. “The word is getting out.\n“I can’t stress enough how unique it is. I think that’s what has me so excited about it.\n“It’s worth people’s time to come see it,” he says. “They’re not going to find anything else like this.”\nIF YOU GO\nWhat: On the Spot Mysteries dinner theater\nWhen: 6:30 p.m. every Friday\nWhere: Savannah Coffee Roasters, 215 W. Liberty St.\nCost: $40; includes three-course dinner and interactive, improvised show\nInfo: 912-352-2994", "external_links": ["http://sav-cdn.com/sites/all/themes/whitelabel/images/blank.gif", "http://i.imgur.com/2Ix6dHF.png", "https://bit.ly/ZyZ8mc)", "http://sav-cdn.com/sites/default/files/imagecache/superphoto/14788007.jpg", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/14788006.jpg", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/14788004.jpg", "https://bit.ly/ZyZaur", "http://sav-cdn.com/sites/default/files/imagecache/superphoto/14788004.jpg", "http://sav-cdn.com/sites/default/files/imagecache/superphoto/14788006.jpg", "https://itunes.apple.com/us/app/dosavannah/id626862925?ls=1&mt=8", "https://play.google.com/store/apps/details?id=hr.apps.n53744379", "http://sav-cdn.com/sites/default/files/imagecache/superphoto/14788012.jpg", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/14788007.jpg", "http://sav-cdn.com/sites/all/themes/savannahnow/images/blank.gif", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/14788012.jpg", "https://bit.ly/Ke006c"], "published": "2015-10-08T20:34:00.000+03:00", "crawled": "2015-10-08T20:15:29.194+03:00", "highlightTitle": ""}