{"organizations": [], "uuid": "3c3b327791832e4c04079c94f6577e0b718b38cf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nola.com", "main_image": "http://imgick.nola.com/home/brightcove01/width620/img/6/260825829001/201510/1886/260825829001_4569231145001_0fe6fc1f-3146-4722-b728-ead23e21bb30-still.jpg?pubId=260825829001", "site_section": "http://www.nola.com/baton-rouge/", "section_title": "Baton Rouge, LA Local News, Breaking News, Sports &amp; Weather - NOLA.com", "url": "http://www.nola.com/news/index.ssf/2015/10/mourners_call_for_ny_church_to.html", "country": "US", "title": "Mourners call for NY church to close after one brother killed, another beaten", "performance_score": 0, "site": "nola.com", "participants_count": 3, "title_full": "Mourners call for NY church to close after one brother killed, another beaten | NOLA.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T05:26:00.000+03:00", "replies_count": 2, "uuid": "3c3b327791832e4c04079c94f6577e0b718b38cf"}, "author": "Patrick Lohmann | plohmann@syracuse.com", "url": "http://www.nola.com/news/index.ssf/2015/10/mourners_call_for_ny_church_to.html", "ord_in_thread": 0, "title": "Mourners call for NY church to close after one brother killed, another beaten", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW HARTFORD, N.Y. — Hundreds of mourners gathered behind the Word of Life Christian Church on Tuesday night to remember Lucas Leonard, pray for Christopher Leonard and call for the closure of a church that event organizers said put the town \"on the map\" for all the wrong reasons.\nThe candlelight vigil and prayer service featured singers and speakers from the Utica area and lasted about an hour. Afterward, neighbors lined up along the sidewalk outside the Word of Life Church and shouted and sang \"Amazing Grace\".\nThe light was on in at least one room of the church, but the cries went unacknowledged.\nJust over a week ago, six members of the church were arrested in the savage beating death of Lucas Leonard, 19, and the assault of Christopher Leonard, 17. The young men's parents were among those arrested, and Christopher is expected to testify Wednesday at a felony hearing against his half-sister, Sarah Ferguson, and co-defendant Joseph Irwin.\nStacey Wendell lights a candle at a makeshift memorial for 19 year-old Lucas Leonard who was beaten to death on October 12 at the Word of Life Christian Church in Chadwicks. The church is in the background. Wendell is the organizer of the vigil being held for the two Leonard brothers who were beaten. Michael Greenlar | mgreenlar@syracuse.com Apart from the prayers, there was anger directed at the church. The vigil was held against a 20-foot hedge lining one of the church's borders. It was an example, neighbors have said, of the isolated church's abandonment of the community and mysterious behavior for decades.\n\"We want them gone,\" organizer Stacey Mendell told the crowd to cheers. \"We want peace back in our community. We want justice for our boys.\"\nMendell is organizing a fundraiser for Christopher and is trying to organize support to get the church shut down. Another organizer, Ami Loomis, said the community needs to step up for Christopher.\n\"He needs to know there's life outside that place,\" she said. \"He needs to know there's a community behind him.\"\nAttendees said the last week or so has been a whirlwind of local and national news media who have descended upon the small town. They lamented the fact that this story has given the area notoriety.\n\"I'm in disbelief of what happened here,\" said Sharon Rowan of South Utica. \"I just hope Lucas is in heaven now and that Chris does well tomorrow when he has to testify.\"\nThe Word of Life Christian Church's gates were closed. However, a sign written in black cursive stated, \"Church closed during our time of mourning.\"", "external_links": ["http://media.syracuse.com/crime_impact/photo/2015-10-20-mjg-beatings1jpg-9d58dc3cd6f775dc.jpg", "http://topics.syracuse.com/tag/Word%20of%20Life%20Church/posts.html", "http://media.syracuse.com/crime_impact/photo/19014259-large.jpg"], "published": "2015-10-21T05:26:00.000+03:00", "crawled": "2015-10-21T11:25:27.869+03:00", "highlightTitle": ""}