{"organizations": [], "uuid": "6d0a9fb081554d28889e4904db7cb6eec9c476da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/2/9/161311/World/International/-Pakistan-PM-heads-to-US-for-talks-with-Obama-on-A.aspx", "country": "EG", "title": "Pakistan PM heads to US for talks with Obama on Afghan peace - International - World", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Pakistan PM heads to US for talks with Obama on Afghan peace - International - World - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "6d0a9fb081554d28889e4904db7cb6eec9c476da"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/2/9/161311/World/International/-Pakistan-PM-heads-to-US-for-talks-with-Obama-on-A.aspx", "ord_in_thread": 0, "title": "Pakistan PM heads to US for talks with Obama on Afghan peace - International - World", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Pentagon chief: US not leaving Afghanistan Pakistani PM says he wants to revive Afghan-Taliban talks MSF says 33 staff, patients still missing after US air strike Pakistan rejects accusations of involvement in Kunduz attack Pakistan's Prime Minister Nawaz Sharif arrives in the US on Tuesday and is likely to face pressure to bring the Taliban to the negotiating table, days after Washington said it was delaying its withdrawal from Afghanistan.\nUS President Barack Obama last week reversed a pledge to pull troops out as he admitted Afghan forces were not ready to stand alone against the resurgent Islamists, who briefly captured a key northern city this month.\nThe US sees Pakistan as one of the few sources of influence over the extremists, and analysts say Washington will use the four-day trip to urge Sharif to keep pushing for a new round of talks.\n\"The US has two objectives behind this visit,\" said Pakistan political analyst Hassan Askari.\n\"The first is to put pressure on Pakistan to bring the Afghan Taliban to the negotiation table and the second is to persuade Pakistan to discourage the activities of the Afghan Taliban within Pakistan.\"\nWashington's relationship with Islamabad is a prickly one, born of a fraught inter-dependency but pollinated by mutual mistrust.\nPakistan was once the Taliban's main sponsor and its chief protector, but nominally switched sides after the September 11, 2001 attacks on the US.\nHowever, US officials suspect the organisation still receives succour from elements in Pakistan, including the nation's powerful spy agency.\nThat charge is repeated by Kabul, which accuses Islamabad of harbouring and nurturing Taliban insurgents -- allowing them to launch attacks in Afghanistan before melting back across the border.\nUnder pressure from the US, which has previously tied millions of dollars of aid to Pakistan's commitment to tackling militancy, Islamabad last year launched a military offensive in its northwestern tribal areas, where the insurgents had previously operated with impunity.\nStaunching the flow of blood in Afghanistan's 14-year war, which has claimed tens of thousands of lives, has taken on greater urgency in recent months.\nAfter years on the back foot, the Taliban scored a stinging victory when they captured the northern city of Kunduz -- the first time they have controlled a major urban centre since their 2001 overthrow.\nAfghanistan's under-par military eventually wrestled it back with the help of US special forces and air support, and at the cost of the American bombing of a Doctors Without Borders hospital which killed at least 24 patients and staff.\nObama's about-face on troop withdrawal last week -- he has now committed to keeping a 9,800-strong force there through much of next year -- crowned a miserable few months, and Washington will be looking to Sharif to help turn things around.\nIslamabad brokered the first set of direct talks between the Taliban and the Afghan government in July, but another round was derailed by the revelation of the death of Taliban leader Mullah Omar.\nSharif this month said he was trying to revive peace negotiations.\nWhite House spokesman Josh Earnest told reporters Pakistan had already played an important role in the talks.\nSaying he did not want to speak \"for the Pakistani government\", he stated that it was \"the president's view that everybody in the region recognises... the important benefits associated with progress on reconciliation talks\".\nThat progress could have important financial implications for Pakistan, which has received $4.6 billion in aid from the US under the now expired Kerry-Lugar-Berman (KLB) act since 2009.\nThe US is currently set to give an estimated $794 million to Pakistan in aid in the 2016 fiscal year.\n\"Pakistan will push more on this side, to get military assistance,\" Askari said, adding that Sharif is \"likely to succeed\".", "external_links": [], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-20T04:18:11.056+03:00", "highlightTitle": ""}