{"organizations": ["Liverpool"], "uuid": "ac311f8e806e352eb2cd23eb43001616aa346f07", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/b561da19e6461912c3809707bc086af9.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/football/dietmar-hamann-backs-jurgen-klopp-to-get-the-best-out-of-liv/6904550/", "country": "JE", "title": "Dietmar Hamann backs Jurgen Klopp to get the best out of Liverpool crop", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "Dietmar Hamann backs Jurgen Klopp to get the best out of Liverpool crop", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T08:16:00.000+03:00", "replies_count": 0, "uuid": "ac311f8e806e352eb2cd23eb43001616aa346f07"}, "author": "", "url": "http://www.sport.co.uk/football/dietmar-hamann-backs-jurgen-klopp-to-get-the-best-out-of-liv/6904550/", "ord_in_thread": 0, "title": "Dietmar Hamann backs Jurgen Klopp to get the best out of Liverpool crop", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jurgen Klopp", "Dietmar Hamann"], "text": "Dietmar Hamann backs Jurgen Klopp to get the best out of Liverpool crop 08 Oct 2015 05:16:57 \ncomments \nJurgen Klopp will fulfil Liverpool owners' Fenway Sports Group's expectations to get better results out of the current squad, according to former midfielder Dietmar Hamann. \nNegotiations are continuing with the former Borussia Dortmund manager to take over at Anfield with confirmation expected by the end of the week. \nThere has been almost universal support for the appointment but, crucially, it is what Klopp can affect immediately which may make the most difference. \n\"Too often managers go into a new job and three months later complain the players aren't fit enough, they're not good enough and that he needs 10 new players,\" the ex-Reds and Germany star Hamann told talkSPORT. \n\"This guy says 'No, no, I think this squad is all right'. \n\"Of course he will want one or two players in key positions but, if you look at his Dortmund team, he brought these players in and he got the best out of them. \n\"There were three players in recent years he turned from nobodies into world-class players and all three of them left - Nuri Sahin, Shinji Kagawa and Mario Gotze. \n\"They all left the club and they all failed - so that means he brings out the best of players. \n\"People say his players leave and can't play in a different system. I'm not interested in what players do when they leave Liverpool, I want him to bring the best out of players. \n\"He did that at Dortmund and I'm pretty sure he will do it at Liverpool and if you're not on board and you're not prepared to sacrifice yourself for the team then I don't think you've got a future at Liverpool.\" \nGermany defender Mats Hummels, who signed for Klopp's Dortmund from Bayern Munich in 2008 and was a key figure in their success, had nothing but praise for his former boss. \n\"There is no doubt about it, he is a fantastic coach, he's absolutely great,\" said the centre-back, speaking in Dublin ahead of Germany's Euro 2016 qualifier with the Republic of Ireland. \n\"You thought 'What is he going to do post Dortmund?, then clubs like Liverpool certainly came into the frame. \n\"He lives, eats, breathes and thinks football day after day. \n\"He will be a fantastic addition and I am certainly keeping my fingers crossed for the next step in his career.\" Related Sport News", "external_links": [], "published": "2015-10-08T08:16:00.000+03:00", "crawled": "2015-10-08T19:54:06.403+03:00", "highlightTitle": ""}