{"organizations": [], "uuid": "6b67a6a351175192b232f3bb604eccaccc64eb99", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chron.com", "main_image": "http://ww2.hdnux.com/photos/41/34/54/8768277/7/rawImage.jpg", "site_section": "http://www.chron.com/sports/headlines/collectionRss/Sports-Headlines-Staff-Stories-10767.php\r", "section_title": "Sports Headlines Staff Stories", "url": "http://www.chron.com/sports/highschool/article/Who-are-the-Greater-Houston-Area-s-best-running-6571622.php", "country": "US", "title": "Who are the Greater Houston Area's best running backs?", "performance_score": 0, "site": "chron.com", "participants_count": 1, "title_full": "Who are the Greater Houston Area's best running backs?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T07:08:00.000+03:00", "replies_count": 0, "uuid": "6b67a6a351175192b232f3bb604eccaccc64eb99"}, "author": "Angel Verdejo Jr.", "url": "http://www.chron.com/sports/highschool/article/Who-are-the-Greater-Houston-Area-s-best-running-6571622.php", "ord_in_thread": 0, "title": "Who are the Greater Houston Area's best running backs?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Image 1 of 11 Darius Anderson, George Ranch A verbal commitment to Missouri, Anderson has taken on a bigger role after the Longhorns graduated plenty from a year ago. He’s answered the call, rushing for 169 yards against Dawson and 231 against rival Foster. Darius Anderson, George Ranch A verbal commitment to Missouri, Anderson has taken on a bigger role after the Longhorns graduated plenty from a year ago. He’s answered the call, rushing for 169 yards against... Photo: For The Chronicle Image 2 of 11 Rakeem Boyd, Stratford The Texas A&M verbal pledge missed 1 1/2 games with an ankle injury, but it hasn’t stopped him from putting his imprint on the Spartans’ 2015 season - Boyd returned against Magnolia and scored three first-half touchdowns. Rakeem Boyd, Stratford The Texas A&M verbal pledge missed 1 1/2 games with an ankle injury, but it hasn’t stopped him from putting his imprint on the Spartans’ 2015 season - Boyd returned against Magnolia... Photo: Thomas B. Shea Image 3 of 11 Luke Hudson, The Woodlands Christian Hudson doesn’t play for the biggest team in Houston - The Warriors played in TAPPS’s Division III. But that hasn’t stopped the 6-foot, 190-pound senior from putting together a resume that now includes 6,000 all-purpose yards. Luke Hudson, The Woodlands Christian Hudson doesn’t play for the biggest team in Houston - The Warriors played in TAPPS’s Division III. But that hasn’t stopped the 6-foot, 190-pound senior from putting... Photo: David Hopper, Freelance Image 4 of 11 Daequan Jones, La Marque The senior has a goal to rush for 2,000 yards in the regular season and he doing a good job in getting there. Through seven games, Jones has 1,457 yards on the ground and averages more than eight yards every rush. Daequan Jones, La Marque The senior has a goal to rush for 2,000 yards in the regular season and he doing a good job in getting there. Through seven games, Jones has 1,457 yards on the ground and averages... Photo: Andy Tolbert Image 5 of 11 Sammy Linton, Deer Park The Deer aren’t too secretive with their offense. They run and run some more. And Linton is the workhorse. He averages just over 27 carries per game and is on the short list of players with 300-yard games this year. Sammy Linton, Deer Park The Deer aren’t too secretive with their offense. They run and run some more. And Linton is the workhorse. He averages just over 27 carries per game and is on the short list of... Photo: Jerry Baker, For The Houston Chronicle Image 6 of 11 Jordan Myers, Dickinson An athlete who has seen time nearly everywhere on the offensive side of the ball, Myers settled in at running back after an all-state year at tight end in 2014. It’s worked - the Rice verbal pledge has 1,023 yards and 19 scores. Jordan Myers, Dickinson An athlete who has seen time nearly everywhere on the offensive side of the ball, Myers settled in at running back after an all-state year at tight end in 2014. It’s worked - the... Photo: Bob Levey, Houston Chronicle Image 7 of 11 Sewo Olonilua, Kingwood Olonilua is likely destined to end up on the other side of the ball, playing either safety or linebacker at TCU. But for now, he’s tearing up opposing defenders and averaging more than 10 yards per carry for the Mustangs. Sewo Olonilua, Kingwood Olonilua is likely destined to end up on the other side of the ball, playing either safety or linebacker at TCU. But for now, he’s tearing up opposing defenders and averaging more... Photo: Jerry Baker, Freelance Image 8 of 11 Kyle Porter, Katy The tradition continues. Porter has 974 yards and 15 touchdowns on the ground this season. He averages 10 yards per carry is will follow Rodney Anderson (Oklahoma) and Adam Taylor (Nebraska) into the college ranks. Kyle Porter, Katy The tradition continues. Porter has 974 yards and 15 touchdowns on the ground this season. He averages 10 yards per carry is will follow Rodney Anderson (Oklahoma) and Adam Taylor (Nebraska)... Photo: Bob Levey, Houston Chronicle Image 9 of 11 Justin Pratt, Klein Collins The list of 6A teams capable of winning a state title out of Region II includes Klein Collins, who feature a workhorse in Pratt, a 5-foot-7 dynamo with one 2,000-yard season on his resume and the workings of another one in 2015. Justin Pratt, Klein Collins The list of 6A teams capable of winning a state title out of Region II includes Klein Collins, who feature a workhorse in Pratt, a 5-foot-7 dynamo with one 2,000-yard season on his... Photo: Jerry Baker, Freelance Image 10 of 11 Trelon Smith, Cypress Ridge Speaking of 300-yard games, Smith doesn’t have one - the junior has two. Smith ran for 325 yards and three touchdowns against Jersey Village and followed it with 328 yards and three scores against against Cypress Springs. Trelon Smith, Cypress Ridge Speaking of 300-yard games, Smith doesn’t have one - the junior has two. Smith ran for 325 yards and three touchdowns against Jersey Village and followed it with 328 yards and... Photo: Wilf Thorne, For The Chronicle Image 11 of 11 Who are the Greater Houston Area's best running backs? 1 / 11 Back to Gallery \nSure the spread offense is as popular as ever and you'll find all over the state at every level. And sure that means quarterbacks and wide receivers are the \"it\" positions nowadays. \nBut as most coaches will tell you, running the football is still needed to be successful. Houston has some of the state's best running backs. \nClick through the gallery above to see 10 running backs having stellar seasons and ones to keep on your radar.", "external_links": [], "published": "2015-10-15T07:08:00.000+03:00", "crawled": "2015-10-15T07:51:11.163+03:00", "highlightTitle": ""}