{"organizations": [], "uuid": "048d28f4149a9b4756b63ac6344e62b92d903870", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "nypost.com", "main_image": "https://thenypost.files.wordpress.com/2015/10/wright31.jpg", "site_section": "http://nypost.com/sports/feed/", "section_title": "| Sports | New York Post", "url": "http://nypost.com/2015/10/19/how-did-the-mets-win-game-2-its-as-easy-as-1-2-3/", "country": "", "title": "How did the Mets win Game 2? It’s as easy as 1-2-3", "performance_score": 0, "site": "nypost.com", "participants_count": 1, "title_full": "How did the Mets win Game 2? It’s as easy as 1-2-3 | New York Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T06:55:00.000+03:00", "replies_count": 0, "uuid": "048d28f4149a9b4756b63ac6344e62b92d903870"}, "author": "Dan Martin", "url": "http://nypost.com/2015/10/19/how-did-the-mets-win-game-2-its-as-easy-as-1-2-3/", "ord_in_thread": 0, "title": "How did the Mets win Game 2? It’s as easy as 1-2-3", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "While the Mets specialized in tense victories in their NLDS win against the Dodgers, they didn’t take long to take control Sunday night at Citi Field.\nAfter seeing a resurgent offense in the second half of the season, Travis d’Arnaud was pleased his teammates made things a bit easier for starter Noah Syndergaard in a 4-1 win over the Cubs in Game 2 of the NLCS.\n“That first inning was huge,” d’Arnaud said. “First Curtis [Granderson] gets on and then David [Wright] drives him in with that huge shot to center. [Daniel Murphy] homers and we’re kind of on our way. It was awesome to watch.”\nThe Mets had a 3-0 lead before Jake Arrieta retired a batter and that was enough for Syndergaard and the bullpen.\nThe biggest outlier in the top of the order had been Wright, who had brushed off questions whether his back injury may be limiting him, but he eased some doubts with his booming shot to dead center off Chicago starter Jake Arrieta.\nOne batter later, Murphy made it a three-run lead with yet another blast into the seats.\nThe Mets have almost become accustomed to Murphy’s heroics. It was Wright who had fallen on hard times, without a hit since his two-run single in the NLDS opener against the Dodgers.\nManager Terry Collins’ decision to stick with Wright, 1-for-19 in the postseason entering the game, in the two-hole even as his woes at the plate mounted during this postseason paid off.\n“We don’t doubt him,” Granderson said. “Sure, the results may not have been there lately, but he means so much more than that to our team.”\nOn defense, Wright added a nice play at third, ranging far to his left on Chris Coghlan’s grounder to start the fifth.\n“I told you we had a little laugh [Saturday] night when I asked him how he was feeling physically and he said he was fine, and he said, ‘Outside of the fact that I suck right now, I’m doing good,’ ’’ Collins said. “We need his presence in the lineup. He’s still dangerous, and every time he walks in that batter’s box, you just feel good like he’s going to get something good to hit, and hit it over the fence or against the fence. That leadership, you’ve got to have it on the field.”\nThough Wright’s spirit had remained OK, his production had not been.\nInstead of placing the blame entirely on himself, though, Wright did credit some of the opposing pitchers, including the four big starters: Clayton Kershaw and Zack Greinke of the Dodgers and Arrieta and Jon Lester of the Cubs.\n“We’re not facing any slouches,” Wright said. “It’s Kershaw, Greinke, Kershaw, Greinke, Lester, Arrieta. Or at least it’s seemed that way.”\nIt’s that mentality that Collins believes will help not just Wright, but most of the veterans in the lineup who have not hit well this postseason.\n“Are they getting to him? No. He’s a baseball player,” Collins said. “He’s been in this environment a long time. I just keep saying, ‘Hey, look, keep putting those good at-bats on, because it’s going to happen.’ He’s just too good a player.”\nShare this: Facebook Twitter Google Whatsapp Email Filed under chicago cubs ,  curtis granderson ,  daniel murphy ,  david wright ,  mlb playoffs ,  new york mets ,  nlcs ,  terry collins", "external_links": [], "published": "2015-10-19T06:55:00.000+03:00", "crawled": "2015-10-19T13:17:16.172+03:00", "highlightTitle": ""}