{"organizations": ["Arkansas Democrat-Gazette"], "uuid": "56dea85c14de308f3c3a0f3c072024ccbc91dc8f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nwaonline.com", "main_image": "http://media.arkansasonline.com/img/photos/2015/10/21/resized_99263-1ctenpenny45pclr_90-20191.JPG", "site_section": "http://www.nwaonline.com/rss/headlines/sports/prep/", "section_title": "NWAonline stories: High School Sports - Northwest Arkansas", "url": "http://www.nwaonline.com/news/2015/oct/22/wreck-kills-former-nlr-football-standou/", "country": "US", "title": "Wreck kills former NLR football standout", "performance_score": 0, "site": "nwaonline.com", "participants_count": 0, "title_full": "Wreck kills former NLR football standout", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T10:46:00.000+03:00", "replies_count": 0, "uuid": "56dea85c14de308f3c3a0f3c072024ccbc91dc8f"}, "author": "", "url": "http://www.nwaonline.com/news/2015/oct/22/wreck-kills-former-nlr-football-standou/", "ord_in_thread": 0, "title": "Wreck kills former NLR football standout", "locations": ["North Little Rock", "Mississippi"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Rick McFarland", "Altee Tenpenny"], "text": "Wreck kills former NLR football standout By Troy Schulte Posted: October 22, 2015 at 2:46 a.m. Rick McFarland Running back Altee Tenpenny, a former Arkansas Democrat-Gazette All-Arkansas Preps football player from North Little Rock, died Tuesday in a one-car accident in Mississippi. He was 20. \nAltee Tenpenny strolled through North Little Rock High School this past summer, showing off an SEC championship ring while seemingly upbeat despite the rocky turn his football career had taken. A map showing the location of the car crash that killed Altee Tenpenny. (Credit: Arkansas Democrat-Gazette) Photo Gallery View \nNorth Little Rock assistant Blake Pizan said the former Charging Wildcats running back was wearing his usual wide smile and chatting with underclassmen, just as he had done during previous visits since leaving the school as one of the nation's top recruits in 2013. \nThat's what made the news of Tenpenny's death even more difficult Wednesday. \nTenpenny, a former Arkansas Democrat-Gazette All-Arkansas Preps player, died Tuesday evening in a one-car accident near Glen Allan in rural Mississippi, about 30 miles south of Greenville, according to the Mississippi Highway Patrol. He was 20. \n\"The world has lost a smiling face and a great young man,\" Pizan said Wednesday. \"He did a lot of great things here at North Little Rock and helped put North Little Rock on the map in a sense.\" \nTenpenny was believed to have been on his way to central Arkansas on Tuesday from Thibodeaux, La., where on Monday he had informed Nicholls State Coach Tim Rebowe that he was leaving the program a day after being arrested on a weapons charge. \nA statement from the Mississippi Highway Patrol said Tenpenny's 2008 Dodge Charger was northbound on U.S. 1 when he ran off the left side of the roadway and struck a sign. The car then went down an embankment, crossed a county road and overturned several times before colliding with a utility pole, ejecting Tenpenny. \nThe Highway Patrol responded to the accident about 5 p.m. Tenpenny was transported to Delta Regional Medical Center in Greenville, Miss., where he was pronounced dead just after 7 p.m. Central, according to the highway patrol. \nA Highway Patrol spokesman said officials did not know how fast Tenpenny was driving at the time of the accident but that alcohol was not thought to be a factor. An investigation into the accident is ongoing. \nTenpenny was rated a four-star recruit by Rivals.com coming out of North Little Rock after rushing for 1,385 yards and 20 touchdowns as a senior in 2012. He chose Alabama over a slew of other offers, but his only official visits were to Alabama and Arkansas. \nAlabama Coach Nick Saban called Tenpenny's death a \"tragedy.\" \n\"This was a guy who was in our program and who was good friends with a lot of our players,\" Saban said Wednesday during the SEC coaches teleconference. \"We want to be as supportive as possible to all the people who are affected by this.\" \nTenpenny was a reserve for the Crimson Tide in 2013 and 2014, appearing in 26 games and rushing for 218 yards. He helped the Crimson Tide win an SEC title in 2014, but he left Alabama in January and enrolled in May at Nevada-Las Vegas. \nHe never played a game for UNLV after being dismissed from the team for a violation of team rules in August, and his next stop was at FCS member Nicholls State. He practiced with the Colonels, but a university spokesman said Tenpenny had yet to be cleared by the NCAA following his second transfer to a four-year school within a year. \nTenpenny never played in a game at Nicholls State. A university spokesman said Tenpenny's status had been \"week to week\" and that Rebowe had remained hopeful Tenpenny would see the field this season, but that changed after the running back's arrest Sunday morning. \nAccording to a report from the LaFourche Parish sheriff's department, deputies heard a single gunshot outside their office about 5:40 a.m. Sunday and received a report of a man in a red jacket stepping into oncoming traffic along Louisiana 1. \nDeputies found Tenpenny wearing a red jacket and walking along the highway that splits Thibodeaux running east to west. They also found a loaded handgun concealed by his pants and jacket. Tenpenny didn't have a permit to carry the weapon and admitted to firing the weapon, which he said he had obtained from a teammate, according to the report. \nTenpenny was arrested and booked into LaFourche Parish Detention Center on charges of illegally carrying weapons, illegal use of weapons or dangerous instrumentalities, and obstructing a public passage. He was released Monday after posting $2,100 bond. \nRebowe suspended Tenpenny indefinitely upon the running back's arrest. A school spokesman said Wednesday that Tenpenny and Rebowe met Monday afternoon and that Tenpenny had decided to \"resign from the university.\" \n\"On behalf of the players, coaches and all of us at the university, we are extremely saddened by the news of the passing of Altee Tenpenny,\" Rebowe said in a statement Wednesday. \"We extend our condolences to his friends, family and former teammates.\" \nOthers also remembered Tenpenny on Wednesday. \nPizan said he spoke with Tenpenny before the running back transferred to UNLV and recalled how Tenpenny was always happy no matter the circumstances. \n\"Everybody makes mistakes,\" Pizan said. \"But when he made a mistake he always had a positive attitude and said, 'OK, I'm going to change the way I want to do things.' \n\"We can learn from Altee.\" \nArkansas Coach Bret Bielema, who recruited Tenpenny shortly after he was hired at Arkansas, said in a post on Twitter that he would never forget the running back's smile and personality. \nUNLV Coach Tony Sanchez recalled coaching Tenpenny in the U.S. Army high school all-star game before their brief time together at UNLV. \n\"I've had a little bit of a relationship with him for a while,\" Sanchez told the Las Vegas Review-Journal . \"It's tragic any time a young man passes too early. It's a really sad thing, and my heart goes out to his family. It's a real shame.\" \nTennessee running back Alvin Kamara was a teammate of Tenpenny's at Alabama in 2013 and said he had talked to Tenpenny on Tuesday. \n\"Just to wake up and get that news was heartbreaking,\" Kamara told reporters Wednesday. \"I know those guys over there are hurting. It hurts me a lot, but I know he's resting easy now.\" \nArkansas linebacker Brooks Ellis described Tenpenny as \"a great player and a great person.\" \n\"He was always smiling,\" said Ellis, a former Fayetteville High School linebacker who faced Tenpenny in the 2012 Class 7A high school playoffs and in college. \"I'm sad to see him go. My thoughts and prayers go out to his family.\" \nFuneral services are pending. \nInformation for this article was contributed by Matt Jones of the Arkansas Democrat-Gazette . \nSports on 10/22/2015", "external_links": [], "published": "2015-10-22T10:46:00.000+03:00", "crawled": "2015-10-22T13:37:24.048+03:00", "highlightTitle": ""}