{"organizations": ["Ducks", "Columbus", "Anaheim", "Anaheim Ducks"], "uuid": "c5f947ada406deafc6d2677c71f4e153b2be1f85", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.startribune.com", "main_image": "http://stmedia.stimg.co/08_358157_07WILD102515_37121497.JPG?h=630&amp;w=1200&amp;fit=crop&amp;bg=999&amp;crop=faces", "site_section": "http://www.startribune.com/sports/index.rss2", "section_title": "Sports", "url": "http://www.startribune.com/wild-takes-advantage-of-lackluster-ducks-in-3-0-victory/336714081/", "country": "US", "title": "Wild takes advantage of lackluster Ducks in 3-0 victory", "performance_score": 0, "site": "startribune.com", "participants_count": 0, "title_full": "Wild takes advantage of lackluster Ducks in 3-0 victory", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T03:02:00.000+02:00", "replies_count": 0, "uuid": "c5f947ada406deafc6d2677c71f4e153b2be1f85"}, "author": "", "url": "http://www.startribune.com/wild-takes-advantage-of-lackluster-ducks-in-3-0-victory/336714081/", "ord_in_thread": 0, "title": "Wild takes advantage of lackluster Ducks in 3-0 victory", "locations": ["Minnesota", "Winnepeg", "Anaheim"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Thomas Vanek", "Ryan Kesler", "Carter", "Corey Perry", "Shawn Horcoff", "Carl Hagelin", "Maroon", "Jason Zucker", "Andersen", "Patrick Maroon", "Devan Dubnyk", "Matt Dumba", "Jonas Brodin", "Chris Porter", "Jason Pominville", "Ryan Getzlaf", "Jared Spurgeon", "Dumba", "Vanek", "Getzlaf", "Bruce Boudreau", "Frederik Andersen", "Justin Fontaine", "Charlie Coyle", "Ryan Carter"], "text": "Purchase: Order Reprint Something’s wrong with the Anaheim Ducks. Saturday night in front of 19,034 fans, the Wild dominated virtually every moment of the hockey game. A 30-15 shot advantage is evidence of that. Yet, the Ducks were remarkably still only down a goal halfway through when they began taking careless penalty after needless penalty after reckless penalty. Five in a row before the Wild took its first. Thomas Vanek finally provided the Wild that crucial two-goal lead, the Wild quickly struck a third time and the sputtering Ducks ultimately left town with a lackluster 3-0 defeat. That’s now six losses in seven games for the preseason Stanley Cup-favorite darlings. With rumors starting to circulate that coach Bruce Boudreau is in trouble, the Ducks have scored a startling six goals -- none by Corey Perry, Ryan Getzlaf and Ryan Kesler and seem slow and lethargic. Wild 3, Anaheim 0 Today: 5 p.m. at Winnepeg (FSN) (FSN) The Ducks demonstrated their frustration throughout the second period when tempers boiled over. Getzlaf, their captain, took two undisciplined penalties, but the game turned when Patrick Maroon spent an entire TV timeout following Ryan Carter around like a shadow. The officials got in between before the faceoff. After the faceoff, Maroon still wanted to fight Carter. With the Wild up 1-0, Carter smartly didn’t oblige. Instead, Maroon ran around the entire shift, and with the eyes of the refs on him, he hauled down Chris Porter. Three seconds after the Wild’s fifth scoreless power play expired, Vanek scored his fourth goal of the season by unleashing a bullet through a Nino Niederreiter screen for a 2-0 lead. The Wild had a 22-6 shot advantage at the time. Carter then got the last laugh on Maroon. The 2007 Ducks Stanley Cup champ scored his first goal of the season shorthanded off a nice setup from Justin Fontaine late in the period for a 3-0 lead. Matt Dumba also scored for the Wild, Jared Spurgeon picked up his third and fourth assists in the past two games and Devan Dubnyk made 15 saves for his 15th career shutout as the Wild improved to 5-1-1 this season and 3-0 at home. The Ducks, who had beaten the Wild in 10 of the past 11 meetings and last Sunday in Anaheim, snapped a six-game winning streak in Minnesota. In Thursday’s win against Columbus, the Wild got off to its ugliest start of the season. That was not the case Saturday when the Wild was by far the better of the two teams. The Ducks looked lifeless early and barely generated scoring chances. Fourth-liner Shawn Horcoff did score, but that would have only counted in soccer and was erased after a short review. Carl Hagelin also nearly potted a goal off a rebound in a scoreless game, but Charlie Coyle went into a butterfly and did his best Dubnyk impression by saving the goal. Finally, with the Wild creating shot after shot, Dumba scored his first goal of the season and the first goal this season by a Wild defenseman. After a tremendous workmanlike shift by Jason Zucker, Dumba took his pass behind the net, centered himself and roofed a backhander with a driving Jason Pominville perhaps decoying Frederik Andersen. The ensuing shift, Dumba nearly scored again. He scooped up Jonas Brodin’s rebound in the left circle and had a wide open net, but an out-of-position Andersen stretched out his paddle and Dumba managed to hit it. But it was a good period by the Wild and it started with the No. 1 power-play unit spending more than two minutes in the zone and not scoring. Despite exceptional puck movement, the Wild only registered one shot because the Ducks blocked five of their 12 in the opening period. .", "external_links": [], "published": "2015-10-25T03:02:00.000+02:00", "crawled": "2015-10-25T03:07:42.504+02:00", "highlightTitle": ""}