{"organizations": [], "uuid": "57e0be0af6b3e04a9f0c6894e03f922ae978b74d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.al.com", "main_image": "http://imgick.al.com/home/bama-media/width620/img/sports_impact/photo/courtney-upshawjpg-60359ab65bef7d87.jpg", "site_section": "http://impact.al.com/sports/atom.xml", "section_title": "Sports", "url": "http://www.al.com/sports/index.ssf/2015/10/ravens_courtney_upshaw_faces_r.html", "country": "US", "title": "Ravens' Courtney Upshaw faces rival Steelers without expensive playmate Ben Roethlisberger", "performance_score": 0, "site": "al.com", "participants_count": 1, "title_full": "Ravens' Courtney Upshaw faces rival Steelers without expensive playmate Ben Roethlisberger", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T23:00:00.000+03:00", "replies_count": 0, "uuid": "57e0be0af6b3e04a9f0c6894e03f922ae978b74d"}, "author": "Mark Inabinett | minabinett@al.com", "url": "http://www.al.com/sports/index.ssf/2015/10/ravens_courtney_upshaw_faces_r.html", "ord_in_thread": 0, "title": "Ravens' Courtney Upshaw faces rival Steelers without expensive playmate Ben Roethlisberger", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ravens' Courtney Upshaw faces rival Steelers without expensive playmate Ben Roethlisberger courtney upshaw.jpg Baltimore Ravens outside linebacker Courtney Upshaw sacks Pittsburgh Steelers quarterback Ben Roethlisberger during the first quarter of an NFL game at M & T Bank Stadium in Baltimore, Md., on Sept. 11, 2014. (AP Photo) Comments \nMaybe Baltimore outside linebacker Courtney Upshaw can get out of the Ravens' game against the Pittsburgh Steelers on Thursday night without incurring an NFL fine. \nAfter all, Pittsburgh quarterback Ben Roethlisberger isn't going to play. He got knocked out of action for a few weeks on a tackle by St. Louis Rams safety Mark Barron , a former teammate of Upshaw's at Alabama , on Sunday, and Upshaw said before the teams met in the playoffs last season: \"Every time I touch Ben, the NFL sends me a letter.\" \nLast season, the former Eufaula High School star was fined $16,537 by the NFL for a roughing-the-passer penalty called during a sack of Roethlisberger on Sept. 11. The fine was cut in half on appeal. Then the NFL hit Upshaw with a $20,000 fine for a roughing-the-passer penalty for another hit on Roethlisberger on Nov. 2. \nUpshaw got the last laugh for the 2014 season: During Baltimore's 30-17 playoff victory over Pittsburgh, he got a sack of Roethlisberger with no penalties, even though Upshaw knocked the Steelers QB out of the game for a few plays in the fourth quarter. \nWith Roethlisberger out because of a bone bruise and sprained knee ligament on Thursday night, Pittsburgh will use Mike Vick at quarterback against the Ravens. \nOf bigger concern to Upshaw, though, is the September performance of the Baltimore defense. After Baltimore started the season with a 19-13 loss to the Denver Broncos, the Ravens' defense has surrendered the lead in the fourth quarter of two straight games as the team dropped to 0-3. \nRELATED: C.J. MOSLEY SAYS 0-3 RAVENS NEED TO DO SOME 'SOUL SEARCHING' BEFORE THURSDAY NIGHT'S GAME \nThe Oakland Raiders beat Baltimore 37-33 by driving 80 yards in nine plays to score a touchdown with 26 seconds remaining on Sept. 20. On Sunday, the Cincinnati Bengals moved 80 yards on six plays to score a touchdown with 2:10 remaining in their 28-24 victory over the Ravens. \n\"I can sit here and think of big words and tell you what all the leaders said when they broke it down with the wise words this week,\" Upshaw told reporters. \"But at the end of the day, we have to win games. They brought us in here to win games, and we just have to do that.\" \nFOR MORE OF AL.COM'S COMPREHENSIVE COVERAGE OF THE NFL, GO TO OUR NFL PAGE \nVick might not even be Upshaw's biggest problem on Thursday night. The quarterback said , \"It's not on me try to go out and win this game by myself,\" and he has wide receiver Antonio Bell, the NFL's leading receiver in 2014, and running back Le'Veon Bell, the AFC's leading rusher in 2014, to lean on. \nBell is of particular interest to Upshaw. \nAs the strongside linebacker opposite pass-rushing specialist Elvis Dumervil in the Ravens' linebackers lineup, Upshaw can take pride in Baltimore's streak of 29 games without allowing an opposing ball-carrier to run for 100 yards – almost double the NFL's next-longest current streak. \n\"I feel like, honestly, I'm the best in the game at setting that edge in the run game,\" Upshaw said .", "external_links": [], "published": "2015-10-01T23:00:00.000+03:00", "crawled": "2015-10-01T23:54:27.234+03:00", "highlightTitle": ""}