{"organizations": [], "uuid": "471b7c2ddd5b10a49be32a66afcd43f3b8143e6b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtontimes.com", "main_image": "http://media.washtimes.com.s3.amazonaws.com/media/image/2015/10/17/a539a469affc1c2e850f6a706700979f.jpg", "site_section": "http://www.washingtontimes.com/rss/headlines/sports/", "section_title": "www.washingtontimes.com stories: Sports", "url": "http://www.washingtontimes.com/news/2015/oct/19/pat-narduzzi-has-no-25-pitt-ranked-and-ahead-of-sc/", "country": "US", "title": "Pat Narduzzi has No. 25 Pitt ranked and ahead of schedule", "performance_score": 0, "site": "washingtontimes.com", "participants_count": 1, "title_full": "Pat Narduzzi has No. 25 Pitt ranked and ahead of schedule", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T23:27:00.000+03:00", "replies_count": 0, "uuid": "471b7c2ddd5b10a49be32a66afcd43f3b8143e6b"}, "author": "NATE BARNES", "url": "http://www.washingtontimes.com/news/2015/oct/19/pat-narduzzi-has-no-25-pitt-ranked-and-ahead-of-sc/", "ord_in_thread": 0, "title": "Pat Narduzzi has No. 25 Pitt ranked and ahead of schedule", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sports Pat Narduzzi has No. 25 Pitt ranked and ahead of schedule Pittsburgh’s Tyler Boyd (23), Ryan Lewis (38) and Artie Rowell (57) celebrate after the second half of an NCAA college football game against Georgia Tech, Saturday, Oct. 17, 2015, in Atlanta. Pittsburgh won 31-28. (AP Photo/Mike Stewart) more > By NATE BARNES -   \nPITTSBURGH (AP) - Pat Narduzzi arrived at Pittsburgh last December. His job was to find a way to elevate a team seemingly stuck around .500 for years. \nHe’s well ahead of schedule. \nThe Panthers are 5-1 and ranked at No. 25, cracking the poll for the first time in five years. An early sign of success, sure, but Narduzzi is not swayed by an arbitrary ranking. \n“It’s just a number,” he said. “We’re more than a number.” \nPitt is 3-0 in the wide-open ACC Coastal Division and has played four of six games on the road, including a 31-28 win at Georgia Tech last Saturday. \n“We’ve got goals and we’ve got places we want to go and our kids know that,” Narduzzi said. “If they look at the 25 and they walk out there, write it on their wristband ‘Oh, we’re No. 25,’ I don’t think that’s going to happen.” \nPitt’s previous ranking was No. 15 in the 2010 preseason under coach Dave Wannstedt. The Panthers didn’t last long - they were out of the poll after an opening loss to Utah. \nNow, behind one of the nation’s top defensive units and most accurate passers in the ACC in Nate Peterman, Pitt is one of the league’s biggest surprises. \nNarduzzi and his staff understand the importance of the ranking to the players. After all, the Panthers didn’t receive a single vote in the previous week’s poll. \n“The great thing is they were nowhere on the radar,” Narduzzi said. “They weren’t even a blip a week ago. We talk about earning respect and we do that every week and our kids earned it.” \nPeterman ranks 13th in the nation with a 66.7 completion percentage. He completed 14 of 21 attempts for 162 yards and a career-high three touchdowns when the Panthers edged the Yellow Jackets on Chris Blewitt’s school-record 56-yard field goal with just over a minute to go. \nA transfer from Tennessee, Peterman took the starting job from incumbent Chad Voytik last month. He sees the ranking as a stepping stone. \n“It’s encouraging, for sure,” Peterman said. “I think even after the Virginia Tech game that was big when coach Narduzzi told us they don’t give out midseason awards and there’s no championship in the middle of the season.” \nAs Pitt begins the second half of its season, Narduzzi doesn’t expect his players’ approach to waver even if they aren’t the no-name unit they were in August. \n“I think that’s who they are,” Narduzzi said. “I think that’s what we’ve coached in this room and I don’t think we’ll be any different.”", "external_links": [], "published": "2015-10-19T23:27:00.000+03:00", "crawled": "2015-10-20T00:38:55.301+03:00", "highlightTitle": ""}