{"organizations": ["Iran Group D"], "uuid": "74e1617e1d1cd936b6ab3f39404f18c167ff3378", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailysabah.com", "main_image": "http://i.tmgrup.com.tr/dailysabah/2015/10/03/HaberDetay/1443810892723.jpg", "site_section": "http://dailysabah.com//rss/sports", "section_title": "Daily Sabah - Sports", "url": "http://www.dailysabah.com/football/2015/10/03/eight-of-irans-female-football-players-revealed-to-be-men", "country": "TR", "title": "Eight of Iran's female football players revealed to be men", "performance_score": 0, "site": "dailysabah.com", "participants_count": 0, "title_full": "Eight of Iran's female football players revealed to be men", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T19:34:00.000+03:00", "replies_count": 0, "uuid": "74e1617e1d1cd936b6ab3f39404f18c167ff3378"}, "author": "", "url": "http://www.dailysabah.com/football/2015/10/03/eight-of-irans-female-football-players-revealed-to-be-men", "ord_in_thread": 0, "title": "Eight of Iran's female football players revealed to be men", "locations": ["Portugal", "Iran", "Frankfurt"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ADD A MESSAGE YOUR E-MAIL Iranian women wave national flags prior to the Portugal v Iran Group D match at the World Cup stadium in Frankfurt. They are not allowed to watch games in Iran. \nIran, where women are not allowed to watch games, is being accused of getting men to suit up for its national team. Eight of Iran's female football team players are actually men awaiting sex change operations, it has been claimed, according to the Telegraph. The country's football association was accused of being \"unethical\" for knowingly fielding eight men in its women's team. Mojtabi Sharifi, an official close to the Iranian league, told an Iranian news website: \"[Eight players] have been playing with Iran's female team without completing their sex change operations.\" On Wednesday, authorities reportedly ordered gender testing of the entire national squad and leading league players. The names of the players thought to be male were not revealed. The Iranian women's team play in headscarfs, long-sleeved tops and tracksuit bottoms. In 2014, the country's football governing body introduced random checks after it was revealed that four national team players were either men who had not completed sex change operations, or were suffering from sexual development disorders. In 2010, doubts were raised about the gender of the team's goalkeeper. Gender change operations are legal in Iran according to a fatwa - or religious ruling - pronounced by the late Ayatollah Ruhollah Khomeini, spiritual leader of the 1979 Islamic revolution. The law contrasts with the strict rules governing sexual morality under the country's Sharia legal code, which forbids homosexuality and pre-marital sex. Sex changes are commonly carried out in phases in Iran, with the full procedure taking up to two years and including hormone therapy before the full gender transformation is completed. Football is highly popular among many Iranian women, despite religious rules that bar them from entering stadiums to watch matches between male teams. Earlier this month the women's national team captain was unable to fly with the squad to Malaysia because her husband refused her permission to fly. \"As a Muslim woman, I wanted to work for my country's flag to be raised [at the games], rather than traveling for leisure and fun,\" Niloufar Ardalan, 30, said at the time. \"I wish authorities would create [measures] that would allow female athletes to defend their rights in such situations.\"", "external_links": [], "published": "2015-10-02T19:34:00.000+03:00", "crawled": "2015-10-03T06:25:07.344+03:00", "highlightTitle": ""}