{"organizations": [], "uuid": "e8d99c1aadc6c60d97ca77de60bde3b358170f71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.richmondregister.com", "main_image": "http://bloximages.chicago2.vip.townnews.com/richmondregister.com/content/tncms/assets/v3/editorial/e/52/e52f4366-7ab2-11e5-b441-cfb99415ab32/562c2873e7861.image.jpg", "site_section": "http://richmondregister.com//search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&nsa=eedition&c[]=sports,sports/*&f=rss", "section_title": "Richmond Register - sports,sports/", "url": "http://www.richmondregister.com/sports/ovc-football-colonels-roll-past-tennessee-state/article_b6b62806-7ab2-11e5-9b67-8f71872f5794.html", "country": "US", "title": "OVC FOOTBALL: Colonels roll past Tennessee State, 45-21", "performance_score": 0, "site": "richmondregister.com", "participants_count": 1, "title_full": "OVC FOOTBALL: Colonels roll past Tennessee State, 45-21", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T02:52:00.000+02:00", "replies_count": 0, "uuid": "e8d99c1aadc6c60d97ca77de60bde3b358170f71"}, "author": "Nathan Hutchinson, Register Sports Editor", "url": "http://www.richmondregister.com/sports/ovc-football-colonels-roll-past-tennessee-state/article_b6b62806-7ab2-11e5-9b67-8f71872f5794.html", "ord_in_thread": 0, "title": "OVC FOOTBALL: Colonels roll past Tennessee State, 45-21", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Nathan Hutchinson, Register Sport Editor 10.25 eku 1 \nEKU's Ethan Thomas breaks loose for an 80-yard touchdown Saturday against Tennessee State in Richmond. Nathan Hutchinson, Register Sports Editor 10.25 eku 2 \nEKU's Devin Borders catches a touchdown pass Saturday in a win over Tennessee State at Roy Kidd Stadium. Nathan Hutchinson, Register Sports Editor 10.25 eku 3 \nEKU's Ben Madon catches a pass Saturday against Tennessee State in Richmond. Nathan Hutchinson, Register Sports Editor 10.25 eku 4 \nEKU's Jared Sanders celebrates with teammates after scoring a touchdown Saturday against Tennessee State in Richmond. Posted: Saturday, October 24, 2015 8:52 pm OVC FOOTBALL: Colonels roll past Tennessee State, 45-21 Nathan Hutchinson, Register Sports Editor Richmond Register \nThe Colonels had two of their biggest playmakers out of the lineup for Saturday’s Homecoming matchup with Tennessee State. \nStill, they were able to put together another very impressive all-around performance. \nEKU (5-2, 3-0) set up a first-place showdown with Jacksonville State next weekend by blasting long-time rival Tennessee State, 45-21, at Roy Kidd Stadium. \nThe Colonels rushed for a season-best 256 yards and got four touchdowns from quarterback Bennie Coney (three passing, one rushing) as they rolled to a ninth-straight victory on Homecoming. \nBryan Green also had two touchdown catches for EKU. \n“We just found a way,” Coney said. “That’s our philosophy. We’ve been putting in work and it shows.” \nAll-American running back Dy’Shawn Mobley was sick and did not dress. So, freshman Ethan Thomas carried the load for the EKU ground attack, racking up 149 yards on 18 carries with a touchdown. \nThe Colonels had a 10-0 lead late in the second quarter when Thomas busted loose for an 80-yard touchdown run. \n“The line blocked great and the receivers blocked great,” Thomas said of the play. “It all just came together.” \nThat TD run gave the Colonels a comfortable 17-0 lead at halftime. \n“He’s been our most consistent (running back) because everyone else has taken turns being sick or hurt,” EKU coach Dean Hood said of Thomas. “Dy’Shawn was sick all week. He didn’t even dress. Then, Adam pulled a hamstring today.” \nGreen continued his emergence as an offensive force for the Colonels. \nAfter catching a touchdown pass in wins over both Tennessee Tech and SEMO, the transfer from Akron had nine catches for 122 yards and got into the end zone two more times. \nGreen had a 13-yard TD catch on the Colonels’ first drive and a 6-yard TD catch in the third quarter. \n“I feel like we are starting to come together as a team and get some chemistry,” Green said. \nConey was extremely solid once again. \nThe junior completed 27-of-41 passes for 292 yards and had one interception. The quarterback also rushed for 38 yards, including a 12-yard touchdown run that put EKU up 31-0 in the third quarter. \nLed by Coney, the Colonels were 10-of-15 on third down. \n“He’s doing everything pretty well,” Hood said of Coney. \nConey also had a 4-yard pass to Devin Borders late in the third quarter. \nEKU got an 11-yard TD run by Jared Sanders in the fourth quarter and a 30-yard field goal from Lucas Williams in the second quarter. \nThe Colonels were without senior standout defensive back Stanley Absanon for a second-straight game. \nStill, the defense held its own, especially in the first half. \nWith EKU leading just 10-0, Tennessee State put together a 9-play, 73-yard drive and appeared to be ready to get back into the game. \nBut, Kiante Northington came up with an interception in the end zone that kept the Tigers off the board. \nThe Colonels limited TSU to just 127 total yards in the first half. \n“When you don’t have a guy like Stanley for two games, guys have got to step up if you are going to win — and they have,” Hood said. \nThe defense sealed the win when Trey Thomas came up with an interception in the final minute. \n“The defensive line got pressure and made the quarterback hurry,” Thomas said. “I saw it, broke on it. It was a good way to finish the game.” \nJunior defensive lineman Noah Spence had a sack and two tackles for loss. The Ohio State transfer has at least one sack in every game this year. \nSo far this season, the Colonels have dominated OVC competition. In four wins, they have out-scored their league rivals 171-61. \nThe victory over TSU keeps EKU at the top of the OVC standings with Eastern Illinois (4-3, 4-0 OVC) and Jacksonville State (6-1, 4-0). \nThe Colonels are set to meet the top-ranked Gamecocks next Saturday in Alabama. \n“It’s going to be crazy,” Coney said of the matchup with JSU. “We are going to go out there with the same gameplan as every week. We are going to play hard to win.”  ", "external_links": [], "published": "2015-10-25T02:52:00.000+02:00", "crawled": "2015-10-25T08:48:43.006+02:00", "highlightTitle": ""}