{"organizations": ["Saint-Etienne", "PSG"], "uuid": "f89fa5922cb6119b84662c722f9691b9b8692271", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.themalaymailonline.com", "main_image": "http://www.themalaymailonline.com/uploads/articles/2015-10/Zlatan_Ibrahimovic2610.JPG", "site_section": "http://www.themalaymailonline.com/feed/rss/sports\r", "section_title": "The Malay Mail Online | Sports", "url": "http://www.themalaymailonline.com/sports/article/ligue-1-psg-go-seven-points-clear-with-saint-etienne-win", "country": "MY", "title": "Ligue 1: PSG go seven points clear with Saint-Etienne win", "performance_score": 0, "site": "themalaymailonline.com", "participants_count": 0, "title_full": "Ligue 1: PSG go seven points clear with Saint-Etienne win", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T03:08:00.000+02:00", "replies_count": 0, "uuid": "f89fa5922cb6119b84662c722f9691b9b8692271"}, "author": "", "url": "http://www.themalaymailonline.com/sports/article/ligue-1-psg-go-seven-points-clear-with-saint-etienne-win", "ord_in_thread": 0, "title": "Ligue 1: PSG go seven points clear with Saint-Etienne win", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Print Article \nParis St Germain's Zlatan Ibrahimovic shoots a free kick as Saint-Etienne's players looks on, during their French Ligue 1 match at the Parc des Princes stadium in Paris, France, October 25, 2015. — Reuters pic PARIS, Oct 26 — Zlatan Ibrahimovic was among the scorers as Paris Saint-Germain opened up a seven-point gap over their nearest rivals at the top of Ligue 1 with a 4-1 victory over Saint-Etienne yesterday. \nLayvin Kurzawa and Edinson Cavani netted before Ibrahimovic, PSG’s all-time leading scorer, got his seventh goal in his last four matches against Saint-Etienne to put the game beyond the visitors at the Parc des Princes. \nMarco Verratti put through his own net to give Les Verts, who are fifth, a consolation but Lucas headed in the hosts’ fourth to secure a comfortable PSG win that underlined the yawning gap between them and the rest of French football. \nLaurent Blanc’s side have still not lost a game this season in any competition and are now undefeated in 20 Ligue 1 matches since March. \nThat form has allowed them to move seven points clear of Angers, the newly-promoted surprise package who drew 0-0 at home to Guingamp on Saturday. \nBlanc made three changes to the team that drew with Real Madrid in the Champions League during the week and it was one of those players brought into the side, Kurzawa, who opened the scoring midway through the first half. \nThe former Monaco left-back fired in a low shot from the left side of the penalty area that Saint-Etienne ‘keeper Stephane Ruffier got a touch to but could not keep out. \nRuffier did make a tremendous save to deny Cavani before the break but he could not prevent the Uruguayan from converting an Ibrahimovic assist three minutes after the interval for his seventh league goal of the season. \nCavani returned the favour when he set up the Swedish striker to grab his seventh of the campaign midway through the second period, before a Marquinhos clearance ricocheted off Verratti and in for an own goal at the other end. \nHowever, a Lucas back-post header crossed the line despite Ruffier’s attempts to keep it out as the capital club put the seal on their victory. \n“To have 29 points after 11 matches is a very good thing, because some of our direct rivals have been dropping points,” said Blanc. \n“We need to try to improve our game in the league and play with greater determination so we don’t get taken by surprise when it comes to the Champions League.” \nMonaco, Marseille win \nEarlier, Monaco closed in on the European places with a 1-0 win at Reims as Bernardo Silva got the only goal of the game against their 10-man hosts. \nLeonardo Jardim’s team opened the scoring in the 11 th minute at the Stade Auguste-Delaune when Nabil Dirar crossed from the right and the diminutive Silva got up to head in his third goal of the season at the back post. \nThey might have added to their lead but Argentine striker Guido Carrillo hit both posts before the interval, while Jordan Siebatcheu hit the upright for Reims in stoppage time. \nThe hosts had been reduced to 10 men midway through the second half when Antoine Devaux walked for a second yellow card, as Monaco claimed a first league win in a month to climb to eighth. \n“Away from home our team is very compact and very good in the transitions,” said Jardim. \n“We tried to score the second goal, first by playing our game, and then by trying to be more direct. We were unable to put the game to bed, but I think we deserved the victory.” \nMarseille, meanwhile, ended a run of seven games without a win as Michy Batshuayi and Romain Alessandrini scored in a 2-1 success at Lille. \nBatshuayi opened the scoring late in the first half, converting his eighth goal already this season after Alessandrini’s initial attempt had come back off the post. \nThe Belgian then returned the favour in the second half, setting up Alessandrini for a superb curling finish high into the net to double Marseille’s lead before Sebastien Corchia pulled a goal back for LOSC. \nElsewhere yesterday, Bordeaux recorded just their third league win of the campaign, beating winless bottom club Troyes 1-0 thanks to a late strike by 18-year-old substitute Adam Ounas. — AFP", "external_links": [], "published": "2015-10-26T03:08:00.000+02:00", "crawled": "2015-10-26T03:15:17.577+02:00", "highlightTitle": ""}