{"organizations": [], "uuid": "05bc1f05fafa2cdd9c29122d10929a9cb45140c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "", "site_section": "http://www.prweb.com/rss2/9960sportsmedicine.xml", "section_title": "Health: Sports Medicine", "url": "http://www.prweb.com/releases/2015/10/prweb13026041.htm", "country": "US", "title": "Aria Health Launches High School Sportsmanship Award to Promote Sportsmanship and Fair Play Among High School Athletes", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Aria Health Launches High School Sportsmanship Award to Promote Sportsmanship and Fair Play Among High School Athletes", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "05bc1f05fafa2cdd9c29122d10929a9cb45140c4"}, "author": "Kourtnaye Lewis", "url": "http://www.prweb.com/releases/2015/10/prweb13026041.htm", "ord_in_thread": 0, "title": "Aria Health Launches High School Sportsmanship Award to Promote Sportsmanship and Fair Play Among High School Athletes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "As more and more pressure is put on high school athletes, Aria Health , the largest healthcare provider in Northeast Philadelphia and Lower Bucks County, conducted a survey to determine attitudes towards high school sports and sports-related injuries, and found that 71 percent of respondents completely or somewhat agree that youth sports have become too competitive. To shine a spotlight on the positive life lessons that can be learned through participating in high school sports, the Aria 3B Orthopaedic Institute is proud to announce the High School Sportsmanship Award, a scholarship program aimed at promoting sportsmanship among high school athletes in Northeast Philadelphia, Lower Bucks County, Center City, and South Jersey. Aria’s survey, which was conducted in spring 2015, also found that:\n 95 percent of respondents completely or somewhat agreed that it is important for children to learn about good sportsmanship. 88 percent of respondents completely or somewhat agree that sports present a good way to build character and teach life lessons.\n“Participating in school athletics promotes healthy and active lifestyles, and also presents an opportunity for youth to learn valuable life lessons. It’s clear that sports can build character, but when sports become too competitive and injuries increase, children can lose interest, making sportsmanship critical at the high school level,” said Arthur R. Bartolozzi, MD, director of sports medicine, Aria 3B Orthopaedic Institute. “Seeing firsthand the positive impact sports can have on long-term physical health and personal growth, we look forward to honoring our local high school athletes who are champions of sportsmanship and help spread positive and fun play.”\nIn partnership with The Philadelphia Inquirer, the High School Sportsmanship Award will recognize and award high school senior athletes who demonstrate sportsmanship and positivity through their actions and attitudes on and off the field, regardless of athletic ability. Nominations will open in October 2015 and winners will be announced in December 2015.\nThe High School Sportsmanship Award is open to athletes in their senior year at select high schools in the communities that the Aria 3B Orthopaedic Institute serves, including Northeast Philadelphia, Lower Bucks County, Center City, and South Jersey. High school principals and athletic directors are encouraged to nominate one senior athlete who displays the characteristics of sportsmanship, including demonstrating respect and courtesy for teammates, coaches and opponents; practicing fairness while playing; and encouraging teammates to exhibit these same qualities, while also promoting fun on the field.\nNomination forms and milestone dates have been distributed to selected schools, and all award winners will be announced in December 2015. Award recipients will be invited to join Aria Health at an awards breakfast ceremony in spring 2016 where students will be recognized as leaders in their respective sports amongst other student athletes, principals and their parents. In addition, they will receive a $1,000 scholarship to the university of their choice.\nFor more information about the Sportsmanship Awards, or the Aria Health 3B Orthopaedic Institute, please call 1-888-ORTHO3B (678-4632) or visit Aria3bortho.org\nAbout 3B Orthopaedics at Aria Health:\nRecognized as leaders in their fields, the specialists of 3B Orthopaedics at Aria Health have over 100 years of combined experience with expertise in joint replacement for hip and knee, sports medicine, complex shoulder treatment, foot and ankle, and comprehensive spine care. To learn more, visit ARIA3BORTHO.org or call 1-888-ORTHO3B.\nAbout Aria Health:\nAria Health is the largest healthcare provider in Northeast Philadelphia and Lower Bucks County. With three leading-edge community hospitals and a strong network of outpatient centers and primary care physicians, Aria upholds a longstanding tradition of bringing advanced medicine and personal care to the many communities it serves. For more information about Aria Health please visit http://www.ariahealth.org “Like” Aria Health on Facebook at http://www.facebook.com/ariahealth and “Follow” Aria Health on Twitter at @AriaHealth.\n###", "external_links": ["http://www.facebook.com/ariahealth", "http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly93d3cuYXJpYTNib3J0aG8ub3JnLw==", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5hcmlhaGVhbHRoLm9yZw==", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5mYWNlYm9vay5jb20vYXJpYWhlYWx0aA=="], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-19T18:24:39.439+03:00", "highlightTitle": ""}