{"organizations": [], "uuid": "ac8cdc0b19d03cc3193c6ec020f05e1a0a931e45", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.outsports.com", "main_image": "https://cdn1.vox-cdn.com/thumbor/T1e2mfu_atvMW0BWp0yYXAszXag=/201x58:1890x1008/1600x900/cdn0.vox-cdn.com/uploads/chorus_image/image/47358600/Coach-2-01.0.0.jpeg", "site_section": "http://www.huffingtonpost.com/tag/college-sports/feed", "section_title": "College Sports on Huffington Post", "url": "http://www.outsports.com/2015/10/7/9474273/bryant-university-basketball-coach-chris-burns-gay", "country": "US", "title": "Chris Burns Comes Out As First Gay Division I Basketball Coach", "performance_score": 0, "site": "outsports.com", "participants_count": 1, "title_full": "Chris Burns Comes Out As First Gay Division I Basketball Coach", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T11:50:00.000+03:00", "replies_count": 0, "uuid": "ac8cdc0b19d03cc3193c6ec020f05e1a0a931e45"}, "author": "The Huffington Post News Team", "url": "http://www.outsports.com/2015/10/7/9474273/bryant-university-basketball-coach-chris-burns-gay", "ord_in_thread": 0, "title": "Chris Burns Comes Out As First Gay Division I Basketball Coach", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bryant University's You Can Play video \nIn college I had a boyfriend, Anthony Nicodemo . He was always coming to games and coming to visit me, so suspicions were certainly there. But again I hid that with small relationships with women on campus, so the guys on the team would see me socializing and not really suspect anything. People at Bryant did a good enough job respecting my privacy. The basic homophobia entrenched in so much of sports was still there obviously, but it was never directed straight at me. My fear kept my true self as hidden as possible. \nMeeting Anthony, and finding the person I thought was the one other gay guy in basketball, meant everything to me. We connected immediately and were attached at the hip. We never discussed our attractions openly at the start - we were just guy-friends talking hoops. But we both knew. It was the ultimate unspoken bond. Over the years we formed a connection that was as special as they come. We were as close as two people could possibly be. No one knows me better than Anthony. \nIt made it even more special that we both shared the love of the game. We connected as people with our love for basketball. \nIf it weren't for him I wouldn't have gone to Providence College for a year and then transferred to Bryant, where I had a successful college career . He was my motivator, he kept me focused and pushed me to always be better. It was everything a partner would do for someone they love. I certainly would not have had the successes I had, and probably wouldn't be coaching college basketball where I am today, if it weren't for him and our secret relationship. That's what the closet does to you, and it did it to me in the worst way: Detaching from my family and my best friend. \nSlowly I became more comfortable with myself, and Anthony did as well. I felt both pressure and fear rise in me. All of those early years, just beginning to explore my sexuality, were filled with a bit of denial - As comfort rose I realized someday I would have to embrace and accept that this is who I am, and that I will need to be honest with people about it. \nIn those secretive years, I had grown accustomed to a lot of lying and deceiving. When you're lying to everyone about who your are at your core, lying about everything else gets easy. Those habits and behaviors were very toxic for every aspect of my life. Slowly, piece by piece, I became detached from everyone, including Anthony. I ran from everything that was real in my life to try and keep myself hidden. \nThat's what the closet does to you, and it did it to me in the worst way: Detaching from my family and my best friend. \nAs I met other gay men in sports, and other gay men with similar interests to mine, I found so many people that I felt I could connect with on a level that made our sexual orientation somewhat coincidental. That was crucial for me. I found people in the community whom I didn't have to spend my time relating to just because we were gay, but because we liked the same kinds of things. It's one of the things that had drawn me to Anthony - our mutual love of basketball. I can't give enough credit to the friends in the community I have made for helping me reach this moment. \nAs a leap of faith, basically due to Anthony and Cyd Zeigler, I decided last year to attend the Nike LGBT Sports Summit . I met so many people there - gay people in sports - who made me finally realize that this day would come. \nTo see that support group of people, who have all been working for so many years in sports, was incredibly powerful and inspiring. Being able to learn and talk with members from all parts of the LGBT community sank in just how important being able to tell my story would be, and how there is a responsibility that comes along with meeting these people and being in the positions that we are in the athletic world. \nThe work of all the people who've come before me makes sharing my true self something that is a responsibility, not just a choice. \nThe Supreme Court decision in June legalizing same-sex marriage was probably the time when I knew without a doubt that I was going to do this. When I saw how powerful it was for people, and when I had the time to sit and think about how this affects me and has shaped my own journey in life, it became a no-brainer. There is no greater feeling than being a part of something bigger than just you. That's what has always made sports so special for me. \nI thought of the people who never got to see that day, who fought for equal rights but didn't get their time. They deserve to be validated and recognized for their efforts and for their struggles. That day, when the Supreme Court released its decision, was when I knew beyond anything else: This is all bigger than myself. \nThere is no greater feeling than being a part of something bigger than just you. That's what has always made sports so special for me. \nSince I started telling people in college basketball over the last few months, I've realized my fears were far worse than reality. I've realized that people, for the most part, are human beings first. For a guy who's relatively cynical and can be negative, the reactions of people in my sport and in my life have shut me right up and reenergized my hope in the human spirit, in empathy. \nYou've got to give the majority of people credit for changing attitudes and credit to all the people who have worked to make that possible . Things have gone fairly well for me so far. \nLike the people before me, I hope my story empowers someone, even if it's just one person. But it's a process for everyone. \nMy advice: Take your time and be comfortable. Everyone's personal journey is special and unique, and no one should feel pressure to do anything they aren't comfortable with. \nBut always know this: When the time comes to share your true self, you will feel so much love and relief and hope and freedom. It's a truly special feeling, and I just can't thank enough every single person who has helped guide and support me to this point. \nYou can find Chris Burns on Facebook and on Twitter . More from Outsports", "external_links": [], "published": "2015-10-08T11:50:00.000+03:00", "crawled": "2015-10-11T13:41:02.594+03:00", "highlightTitle": ""}