{"organizations": [], "uuid": "b316f65e1f05aae8eb2b3ddc4a63f1e279e7ffe5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "nypost.com", "main_image": "https://thenypost.files.wordpress.com/2015/10/noah4.jpg", "site_section": "http://nypost.com/sports/feed/", "section_title": "| Sports | New York Post", "url": "http://nypost.com/2015/10/22/noah-syndergaard-100-percent-sure-mets-will-win-world-series/", "country": "", "title": "Noah Syndergaard ‘100 percent’ sure Mets will win World Series", "performance_score": 0, "site": "nypost.com", "participants_count": 1, "title_full": "Noah Syndergaard ‘100 percent’ sure Mets will win World Series | New York Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T07:51:00.000+03:00", "replies_count": 0, "uuid": "b316f65e1f05aae8eb2b3ddc4a63f1e279e7ffe5"}, "author": "Kevin Kernan", "url": "http://nypost.com/2015/10/22/noah-syndergaard-100-percent-sure-mets-will-win-world-series/", "ord_in_thread": 0, "title": "Noah Syndergaard ‘100 percent’ sure Mets will win World Series", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO — Noah knows.\nRookie right-hander Noah Syndergaard is a big man with big confidence and he believes the Mets’ sweep of the Cubs in the NLCS is not the end of this Amazin’ ride.\nNot even close.\nAs for how confident Syndergaard is that the Mets will win their third World Series title in franchise history — against the Royals or the Blue Jays, the club that drafted him — Syndergaard left no doubt.\n“I’m 100 percent confident,’’ Syndergaard told The Post as teammates poured champagne on one another in the wildest of celebrations after the Mets’ 8-3 win Wednesday night at Wrigley wiped away the Cubs in a four-game sweep in the NLCS.\nTo make his point crystal clear, Syndergaard repeated his claim.\n“One hundred percent,” he said.\nModal Trigger Noah Syndergaard '100 percent' sure Mets will win World Series Posted: October 22, 2015 View Thumbnails Previous Next Advertisement David Wright waves to the crowd after Game 4 of the NLCS. AP\nJacob deGrom Anthony Causi\nMichael Cuddyer raises the Mets wrestling belt after beating the Cubs to advance to the World Series. Charles Wenzelberg\nDaniel Murphy Anthony Causi\nMets closer Jeurys Familia is mobbed by teammates after the Mets captured the National League crown. Anthony Causi\nCharles Wenzelberg\nSteven Matz celebrates after starting Game 4 of the NLCS. Charles Wenzelberg\nJeff Wilpon (left) Charles Wenzelberg\nCharles Wenzelberg\nAnthony Causi\nCurtis Granderson Charles Wenzelberg\nCharles Wenzelberg\nNLCS MVP Daniel Murphy celebrates with his child, Noah. Anthony Causi\nChief Executive Officer Saul Katz and owner Fred Wilpon of the New York Mets pose with the NLCS trophy. Getty Images\nBack to the Start Share this: Facebook Twitter Google Whatsapp Email arrow Mets celebrate their playoff victory in style 14 Photos See how the Amazin's toasted their win against the Cubs. arrow The day in photos 14 Photos Lion cubs get cuddly, Vice President Joe Biden announces he's not running for Prez and more. arrow The day in photos 16 Photos Lemurs get in the Halloween spirit, Vice President Joe Biden mulls on Walter Mondale and more. arrow Revisiting the Lufthansa Heist immortalized in ‘Goodfella’ 13 Photos As Vincent Asaro heads to trial, look back at the real-life case that inspired \"Goodfellas.\" The day in photos 17 Photos Baby orangutans see no evil, a Thailand parade brings piercing looks and more. The day in photos 14 Photos Soldiers celebrate, models show off outlandish styles and more. The day in photos 16 Photos Critters celebrate fall, Vice President Joe Biden chuckles at candidacy rumors and more. Katy, Heidi and Sofia go gorgeously glam for fall 13 Photos While summer may be over, Katy Perry, Heidi Klum and Sofia Vergara are still bringing the stylish heat this fall. The day in photos 14 Photos Find out what kind of critter this cutie is, see visitors' reactions to the reinstated Times Square Kiss Cam and more. The day in photos 13 Photos New York's Finest remember their fallen, newborn pandas grace Toronto and more. The day in photos 17 Photos Indigenous Peoples Day steals some of Columbus' thunder, lion cubs snuggle, Russian President Vladimir Putin watches a race and more. NY Mets beat LA Dodgers 3-1 15 Photos It’s easy to tell when Joe Girardi is getting defensive 10 Photos Here are 10 times Joe Girardi really wasn't amused. The day in photos 16 Photos Cougar cubs get a checkup, students break a world record and more. Best shots from the Comedy Wildlife Photography Awards 39 Photos The Comedy Wildlife Award photography winners are here, and these critters will crack you up. Emma, Dakota and Miranda pucker up their pink pouts 8 Photos Emma Roberts, Dakota Johnson and Miranda Kerr are among the stars sporting pretty pink pouts this fall. Thumbnails Captions OFF Share Share this: Facebook Twitter Google Whatsapp Email More Galleries This was a long journey for Syndergaard, who learned some valuable lessons in spring training about supporting teammates by making sure to be on the bench, even if it’s just an intersquad game.\nOnce he came to the Mets from Triple-A Las Vegas, Syndergaard was a difference maker, especially in the postseason.\n“We have the pitching, the hitting and the defense. We have it all,’’ Syndergaard said.\nSo get ready for a parade, Mets fans.\nflytheM (M is for Murphy/Mets) #LGM \n— Noah Syndergaard (@Noahsyndergaard) October 22, 2015 \n\n“We came into this season a little bit of an underdog, we washed away all those doubts that people had about us,’’ Syndergaard said. “And it was unbelievable challenge as a team but we came together and that made all the difference.\n“As pitchers we came together on the mound as well, and we all believe in one another. And I was able to go out there and have the most fun I’ve ever had in my life.’’\nHe then looked around the room at all the celebrating and joyful faces.\n“This is a little bit of heaven right now,’’ Syndergaard said.\nMore baseball heaven is to come.\nShare this: Facebook Twitter Google Whatsapp Email Filed under chicago cubs ,  mlb playoffs ,  new york mets ,  nlcs ,  noah syndergaard", "external_links": [], "published": "2015-10-22T07:51:00.000+03:00", "crawled": "2015-10-22T18:13:23.993+03:00", "highlightTitle": ""}