{"organizations": [], "uuid": "7be19468dcbf5dd42a32846c68e71c69e5a4a2b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "wtop.com", "main_image": "http://wtop.com/wp-content/uploads/2015/10/Georgia-Tennessee-Football2.jpeg", "site_section": "http://wtop.com/section/sports/feed/", "section_title": "WTOP » Sections » Sports", "url": "http://wtop.com/ncaa-football/2015/10/no-19-georgia-loses-chubb-falls-38-31-to-tennessee/", "country": "US", "title": "No. 19 Georgia loses Chubb, falls 38-31 to Tennessee", "performance_score": 0, "site": "wtop.com", "participants_count": 1, "title_full": "No. 19 Georgia loses Chubb, falls 38-31 to Tennessee", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T04:29:00.000+03:00", "replies_count": 0, "uuid": "7be19468dcbf5dd42a32846c68e71c69e5a4a2b5"}, "author": "wtopstaff", "url": "http://wtop.com/ncaa-football/2015/10/no-19-georgia-loses-chubb-falls-38-31-to-tennessee/", "ord_in_thread": 0, "title": "No. 19 Georgia loses Chubb, falls 38-31 to Tennessee", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "No. 19 Georgia loses Chubb, falls 38-31 to Tennessee By STEVE MEGARGEE October 10, 2015 9:29 pm Georgia running back Nick Chubb (27) lays on the trainers table after being injured on a tackle by Tennessee defensive back Emmanuel Moseley (12) during the first half of an NCAA college football game Saturday, Oct. 10, 2015 in Knoxville, Tenn. (AP Photo/Wade Payne) \nKNOXVILLE, Tenn. (AP) — Georgia’s agonizing afternoon started on the first play from scrimmage and continued right up to the final horn. \nJoshua Dobbs threw for a career-high 312 yards, ran for 118 more and accounted for five touchdowns Saturday as Tennessee erased a 21-point deficit in a 38-31 victory over the 19th-ranked Bulldogs. \nThe defeat was doubly painful for Georgia (4-2, 1-2 SEC), which lost star running back Nick Chubb to an injured left knee on the game’s first snap. Georgia coach Mark Richt was unsure after the game about the severity of Chubb’s injury. \n“As of right now we’re still pretty hopeful that it won’t require surgery, but we’re not 100 percent sure of that,” Richt said. \nGeorgia’s had a history of bad luck with running backs and knee injuries. \nIn Georgia’s overtime victory at Tennessee two years ago, both running back Keith Marshall and wide receiver Justin Scott-Wesley tore ACLs in their right knees to knock them out for the remainder of the season. Todd Gurley’s standout career at Georgia ended last season when he tore his ACL against Auburn. \nWhile the Bulldogs await word on Chubb’s injury, they also must search for answers now that their playoff dreams are likely out of reach. Ranked eighth after winning their first four games of the season, Georgia has lost two straight and is in danger of falling out of the Top 25. \n“There’s really no other option but to regroup and come back, come back fighting,” Georgia quarterback Greyson Lambert said. “I feel like we’re a resilient team and we’ll be able to come back and move forward from this.” \nGeorgia’s Reggie Davis scored on a 70-yard punt return and 48-yard catch but dropped a potential game-tying 56-yard pass with less than four minutes left. The Bulldogs drove from their own 1-yard line to Tennessee’s 27 in their final possession, but Brian Randolph broke up Lambert’s pass to Malcolm Mitchell in the right corner of the end zone as time expired. \nLambert was 15 of 32 for 279 yards. Sony Michel stepped in for Chubb and rushed for a career-high 145 yards, including 124 before halftime as Georgia grabbed a 24-3 lead. Michel also fumbled a kickoff return that led to a Tennessee touchdown as the Vols began their comeback. \n“I feel like we lost the game because of me,” Michel sad. “I wasn’t holding on to the ball tight enough. I just gave it away and (it) took away momentum.” \nTennessee (3-3, 1-2) erased that 21-point margin to beat a ranked team for just the second time in its last 30 attempts. The Vols also ended a five-game losing streak in this annual series. \nThe Vols’ rally was particularly surprising because they entered the day having dropped three of their last four games. Tennessee had blown two-touchdown leads in all its losses. \n“They had a different look,” Tennessee coach Butch Jones said. “This football team was not going to be denied. They were going to find a way to win the football game. I’m just happy for them because they deserve to have this feeling.” \nThe comeback tied for the third-biggest deficit Tennessee had ever overcome in a victory. The Vols beat Vanderbilt 38-36 in 1987 after trailing 28-3 and won 35-34 at Notre Dame in 1991 after falling behind 31-7. \nGeorgia hadn’t lost a game it had led by at least 21 points since at least 1996, the earliest year STATS LLC had on file. \nDobbs was 25 of 42 with three touchdown passes for Tennessee. He ran for two touchdowns, including a 5-yarder that broke a 31-all tie with 5:48 left. \n“We know football is a crazy game,” Dobbs said. “Anything can happen, and we had that mindset all day. … We did a great job of perseverance, and we kept fighting.” \n___ \nAP college football website: http://collegefootball.ap.org Topics:", "external_links": [], "published": "2015-10-11T04:29:00.000+03:00", "crawled": "2015-10-11T04:43:58.925+03:00", "highlightTitle": ""}