{"organizations": [], "uuid": "bd7f8c24364ebfceb83bbfbf55987fcc4910aeba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fox14tv.com", "main_image": "http://KOAM.images.worldnow.com/images/8967675_G.jpg", "site_section": "http://www.fox14tv.com/", "section_title": "Fox 14 News - FOX 14 TV Joplin and Pittsburg News Weather Sports |", "url": "http://www.fox14tv.com/story/30210896/krps-radio-warp-drive-brings-in-donations-early-to-shorten-on-air-fundraiser", "country": "US", "title": "KRPS Radio Warp Drive Brings in Donations Early to Shorten On-Ai", "performance_score": 0, "site": "fox14tv.com", "participants_count": 1, "title_full": "KRPS Radio Warp Drive Brings in Donations Early to Shorten On-Ai - FOX 14 TV Joplin and Pittsburg News Weather Sports |", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T02:16:00.000+03:00", "replies_count": 0, "uuid": "bd7f8c24364ebfceb83bbfbf55987fcc4910aeba"}, "author": "Lisa Olliges, Reporter and Weekend Anchor", "url": "http://www.fox14tv.com/story/30210896/krps-radio-warp-drive-brings-in-donations-early-to-shorten-on-air-fundraiser", "ord_in_thread": 0, "title": "KRPS Radio Warp Drive Brings in Donations Early to Shorten On-Ai", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PITTSBURG, KANSAS - KRPS takes a new route to raising funds for the radio station.\n The radio station on the Pittsburg State University campus got support from listeners in advance of its semi-annual on air membership campaign.\n \"This is KRPS 89.9 listeners supported public radio,\" a typical message from on air talent Eric Cross.\nNormally at this time those tuning in would be hearing an on air membership campaign that could last for several days. But the fall funding drive ended in just two and half hours. That’s because more than forty thousand dollars came in in advance.\nIn what it called the warp drive, thirty second spots encouraged listeners to give online or through a 1-800 number in advance in order to avoid program interruptions.\nStation general manager Missi Kelly says,\n\"We did a mailing out to all of our current members saying it’s time to renew their membership. Then three weeks ago, today we started on air with spots letting people know the warp drive is here. Now’s the time to give and the more we raise beforehand the less we'll have to be on air fund raising.\"\nKelly says listeners sent a clear message about how they want to give donating forty thousand before the on air campaign and then the remaining eight thousand for the goal in just two and a half hours this morning.\nKRPS has a half million dollar budget getting only seventeen thousand dollars from the state and the rest from foundations, donations, leasing tower space and the university.", "external_links": [], "published": "2015-10-08T02:16:00.000+03:00", "crawled": "2015-10-08T08:59:05.133+03:00", "highlightTitle": ""}