{"organizations": [], "uuid": "4cd62125a30b81fc5ec1d47a223b8b4002400c2b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "wtop.com", "main_image": "http://wtop.com/wp-content/uploads/2015/10/Cubs-Coachs-Bartman-Memory-Baseball.jpeg", "site_section": "http://wtop.com/section/sports/feed/", "section_title": "WTOP » Sections » Sports", "url": "http://wtop.com/ncaa-basketball/2015/10/ex-coach-ben-braun-recalls-seeing-bartmans-wrigley-reach/", "country": "US", "title": "Ex-coach Ben Braun recalls seeing Bartman’s Wrigley reach", "performance_score": 0, "site": "wtop.com", "participants_count": 1, "title_full": "Ex-coach Ben Braun recalls seeing Bartman’s Wrigley reach", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T01:57:00.000+03:00", "replies_count": 0, "uuid": "4cd62125a30b81fc5ec1d47a223b8b4002400c2b"}, "author": "wtopstaff", "url": "http://wtop.com/ncaa-basketball/2015/10/ex-coach-ben-braun-recalls-seeing-bartmans-wrigley-reach/", "ord_in_thread": 0, "title": "Ex-coach Ben Braun recalls seeing Bartman’s Wrigley reach", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ex-coach Ben Braun recalls seeing Bartman’s Wrigley reach By JANIE McCAULEY October 15, 2015 6:57 pm FILE - In this Thursday, Feb. 7, 2008 file photo, California head coach Ben Braun argues a call in the second half of a college basketball game against Oregon State in Berkeley, Calif. Former California basketball coach Ben Braun had returned home to Chicago on the recruiting trail and found himself at Wrigley Field in October 2003 when the Chicago Cubs' hopes of ending their World Series drought were shaken with help of fan Steve Bartman's fateful reach over the left-field fence. (AP Photo/Jeff Chiu, File) \nSAN FRANCISCO (AP) — Former California basketball coach Ben Braun had returned home to Chicago on the recruiting trail and found himself at Wrigley Field in October 2003 when the Chicago Cubs’ hopes of ending their World Series drought were shaken with help of fan Steve Bartman’s fateful reach over the left-field fence. \nIt kept Moises Alou from a potential catch on a foul ball hit by Florida’s Luis Castillo in Game 6 of the NL Championship Series, and the Marlins went on to rally in that game before winning the series in the deciding Game 7 and then the World Series against the New York Yankees. \nBraun was right near Bartman that night. He was the one who promptly called security when he saw things getting out of hand in a hurry with other fans’ rage. \n“I was only a couple rows behind him and I saw what was happening. Fans were very irate,” Braun recalled to The Associated Press at Pac-12 men’s basketball media day Thursday. “First it was insults, then it was beer cups, then it was beer bottles and other things. Pretty soon I said, ‘You know, I think somebody better contact the security, it’s pretty serious,’ so I did. Security came and escorted him out. Of course they had to cover him because people were throwing things at him. From what I understood they took him back into the clubhouse, kept him there ’til after the game and got him out of town somehow, maybe put him in disguise. That was going to be a pretty ugly incident.” \nBraun still remembers it well. \n“So I feel at least I helped a pretty serious Cubs fan, and he was. People forget, he was a die-hard Cubs fan,” said Braun, who later coached at Rice and now working as a college basketball television analyst. “He ended up reaching for a ball that three or four other people reached for as well. Because he’s the one they saw, he’s the one that got targeted. They could have targeted three or four other people there.” \nThese wild-card Cubs of 2015, still chasing the franchise’s first World Series championship since 1908, and are now on to the NLCS following their NLDS victory against St. Louis. \nBraun, a shortstop in his day at New Trier High School, is among the lifelong fans sensing something good might just happen this time, at long last. He began going to games once he could walk, even skipping school a couple of times to be in the stands. \n“I’ve been a Cubs fan since early on. I played baseball in high school at New Trier in Chicago. We were the No. 1 rated team in the state, so baseball was in my blood,” Braun said. “I went to a few games when we probably should have been in school but that’s another story. To see what the Cubs are doing now is just so exciting not just for Cubs fans but for people in their organization, their former players, former managers, the owners now, the neighborhood. My grandfather grew up close to the neighborhood. So it’s a special time. They’re as exciting a team as I’ve seen in some time.” Topics:", "external_links": [], "published": "2015-10-16T01:57:00.000+03:00", "crawled": "2015-10-16T02:10:57.038+03:00", "highlightTitle": ""}