{"organizations": [], "uuid": "c401e1addef1acdb06d45954d3eaa258c110b10e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/47529300.cms", "site_section": "http://timesofindia.indiatimes.com/sports/TOI-CRI/articlelist/47722085.cms", "section_title": "Top Stories - TOI CRI - Sports - The Times of India", "url": "http://timesofindia.indiatimes.com/sports/toi-cri/top-stories/Mumbai-look-to-Siddesh-Lad-for-succour/articleshow/49213367.cms", "country": "IL", "title": "Mumbai look to Siddesh Lad for succour", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "Mumbai look to Siddesh Lad for succour - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T18:27:00.000+03:00", "replies_count": 0, "uuid": "c401e1addef1acdb06d45954d3eaa258c110b10e"}, "author": "Gaurav Gupta", "url": "http://timesofindia.indiatimes.com/sports/toi-cri/top-stories/Mumbai-look-to-Siddesh-Lad-for-succour/articleshow/49213367.cms", "ord_in_thread": 0, "title": "Mumbai look to Siddesh Lad for succour", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "VIZIANAGRAM: A few players put their hand up at the right time, delivering brave heart performances to keep Mumbai's hopes alive in their Ranji Trophy opener against Andhra at the Dr PVG Raju ACA Sports Complex here on Saturday .\nHeading into the final day of the match, half of the Mumbai side was back in the hut with another 87 runs needed to secure the first innings lead and the three points that fall in their bag as a result of it. Mumbai ended Day Three at 158 for five after clawing back heroically into the game. On a wicket where the odd ball is staying low, the visitors' hopes rest on Siddhesh Lad, who rescued the domestic giants from a precarious situation of 61 for four while in pursuit of 245, with a brilliant, unbeaten 63 (107b, 10x4, 1x6). Perhaps, the presence of the experienced Abhishek Nayar, who is fresh at the crease, will help Lad in taking Mumbai home without further panic.\nMumbai, though, must thank their medium pacer Balwinder Sandhu for keeping their hopes alive. The 28-year-old, by no means quick, compensates the lack of pace with movement to rattle the batsmen. On Saturday, Sandhu got the big fish with his first ball of the day as Andhra skipper Mohammad Kaif, batting on 90, spooned him straight to short midwicket.\nIt triggered a procession which saw the hosts lose their last six wick ets for 31 runs in the morning session.Sandhu finished with his fourth five wicket haul (5-53), while paceman Shardul Thakur chipped in with 3-47.Both exploited the early morning moisture to put Mumbai in the driver's seat.\nSandhu's good work was, however, almost frittered away by his team's batsmen as Andhra's disciplined seam attack took out the Ranji giants' top half at little expense. While skipper Aditya Tare, Shreyas Iyer and Suryakumar Yadav failed to get going, opener Akhil Herwadkar, who looked like having dug himself in, fell for the `bouncer trap' as he hooked B Aiyyappa down the fine leg's throat.\nWith Mumbai stuck in troubled waters at 61 for four, Lad, who walked in next, unleashed his favourite strokes -the pull and the cover drive, on a regular basis to give some much-needed impetus to the Mumbai innings.\nThe 23-year-old found able company in Nikhil Patil jr, whose 27 off 110 balls was far worth much more that statistics would say. The duo added 97 for the fifth wicket before Patil lost his middle stump to a fuller ball from CV Stephen. The dismissal provided a glimmer of hope for Andhra, whose players' shoulders had just begun to droop.\n ", "external_links": ["https://play.google.com/store/apps/details?id=com.toi.reader.activities"], "published": "2015-10-04T18:27:00.000+03:00", "crawled": "2015-10-05T13:14:30.571+03:00", "highlightTitle": ""}