{"organizations": ["Republican", "Email Facebook", "Former Citadel", "Air Force", "Bulldogs", "The Citadel", "Citadel ¬¬ Citadel", "Citadel", "Worcester State"], "uuid": "f5b53be9d70e1564ee974a568af1874d21bf5f6a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.postandcourier.com", "main_image": "http://www.postandcourier.com/storyimage/CP/20151023/PC20/151029709/AR/0/AR-151029709.jpg", "site_section": "http://www.postandcourier.com/apps/pbcs.dll/section?Category=PC2007&template=rss", "section_title": "National Sports", "url": "http://www.postandcourier.com/article/20151023/PC20/151029709/1032&ampsource=RSS", "country": "US", "title": "For Citadel coach Donnell Boucher, tragedy a test of strength", "performance_score": 0, "site": "postandcourier.com", "participants_count": 0, "title_full": "For Citadel coach Donnell Boucher, tragedy a test of strength", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T20:55:00.000+03:00", "replies_count": 0, "uuid": "f5b53be9d70e1564ee974a568af1874d21bf5f6a"}, "author": "", "url": "http://www.postandcourier.com/article/20151023/PC20/151029709/1032&ampsource=RSS", "ord_in_thread": 0, "title": "For Citadel coach Donnell Boucher, tragedy a test of strength", "locations": ["Florence", "America", "Worcester", "Mass.", "Greenville", "Furman", "The Citadel", "Germany", "Chicopee"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Donnell Boucher", "Bouchers", "Kitty", "Black", "Mike Houston", "Brigitte Niebergall", "Mike", "Russell K. Pace/The", "Niebergall", "Mike Boucher", "Michael Black", "Denise", "Boucher", "Denise Boucher"], "text": "Email Facebook @jeff_fromthepc Oct 23 2015 12:55 pm Russell K. Pace/The Citadel ¬¬ Citadel strength and conditioning coach Donnell Boucher lost his grandmother and uncle in a recent house fire. × Strength is Donnell Boucher’s business. For the last seven years, Boucher has been in charge of the strength and conditioning of athletes at The Citadel, rising from graduate assistant coach to assistant athletic director while developing a reputation as one of the best in the business. “He’s fantastic, and The Citadel is fortunate to have him,” Citadel football coach Mike Houston said. “He’s one of the best young strength coaches I’ve seen, and if he wanted to market himself, I’m sure he could be at a bigger school. But he loves it here at The Citadel.” Over the past week, that love has been returned as Boucher has found his own strength severely tested. A fast-moving fire destroyed the Boucher family home in Chicopee, Mass., last Sunday, killing Boucher’s grandmother and an uncle. Another uncle, a cousin and Boucher’s mother escaped the fire, but the house was totally destroyed, leaving the survivors without a home and the Bouchers without the center of their family life. “All my deepest memories from my childhood are from that house,” said Boucher, 32. “That house acted as the hub for our entire family. All of our holidays were spent there with the entire family.” Boucher usually accompanies The Citadel football team on its road trips, but will not be in Greenville on Saturday when the Bulldogs play at rival Furman. He’s back home in Chicopee, trying to help his family members rebuild their lives. “Our family is really all we’ve got,” said Boucher, who graduated in 2005 from Worcester State, a Division III school in Worcester, Mass., where he was a four-year letterman in football. “My grandmother had five sons and one daughter, and they all live up there. I was one of the only family members to move away and live outside of Chicopee.” Boucher’s grandmother, Brigitte Niebergall, was 87. She was known as Kitty, but Donnell Boucher called her “Oma”, which is German for “Grandmother.” Niebergall came to America from Germany with an American solider after World War II and became the matriarch of the Boucher family. Her late son, Mike Boucher, was 60 and lived with her after retiring. A member of the Air Force reserve. Mike bought the house for his mother in the 1980s. Donnell Boucher’s mother, Denise, was staying in a basement apartment in the house and was in the shower last Sunday when the fire broke out. She told The Republican newspaper that when she heard smoke alarms sounding, she got out of the shower, opened the door and found the house was full of smoke. Denise Boucher yelled to her mother and brother and ran outside, but they were not able to escape the house. “Now, my mom, my uncle and my cousin are without a place to live,” Donnell Boucher said. “The house is a total loss, and we’ll have to knock it down and rebuild something on the land. Nobody really knows what the next move is.” Whatever that move is, Boucher said, The Citadel family has rallied to his support. A fund set up on www.youcaring.com has raised more than $20,000 in less than a week, much of it from Citadel supporters and former athletes. “It’s just been an unimaginable response,” said Boucher. “People I’ve never even met, graduates from 20 and 30 years ago. I don’t know them, and they just know I’m a member of The Citadel’s staff. But they are going out of their way to help us, and it’s been overwhelming. “The outpouring of support has really shaken me,” he said. “It’s truly given me strength and a sense of purpose.” For Citadel folk, its payback for all that Boucher has invested in them. Former Citadel football player Michael Black, from Florence, posted this message on Facebook. “Donnell Boucher is the only reason I stayed at The Citadel my freshman year, ultimately graduating and commissioning into the (Air Force),” Black said. “His drive and pure commitment to helping others, both in and outside the weight room, is literally infectious.” Enlarge The scene of a house fire that killed two members of Citadel strength coach Donnell Boucher’s family in Chicopee, Mass. (Dave Roback/The Republican) \nThe scene of a house fire that killed two members of Citadel strength coach Donnell Boucher’s family in Chicopee, Mass. (Dave Roback/The Republican) × Enlarge The Citadel’s Donnell Boucher at his family’s former home in Chicopee, Mass.. The house burned down last Sunday, killing his grandmother and uncle (Photo provided) \nThe Citadel’s Donnell Boucher at his family’s former home in Chicopee, Mass.. The house burned down last Sunday, killing his grandmother and uncle (Photo provided) ×", "external_links": [], "published": "2015-10-23T20:55:00.000+03:00", "crawled": "2015-10-23T20:28:17.512+03:00", "highlightTitle": ""}