{"organizations": [], "uuid": "38c81c633901e2fda0fd9b08048e7a8371cf5a63", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-5616cb99/turbine/bal-maryland-coach-randy-edsall-fired-20151008", "site_section": "http://www.chicagotribune.com/services/chi-ct-college-rss,0,2899820.hyperlink", "section_title": "College Sports - Chicago Tribune", "url": "http://www.chicagotribune.com/sports/college/bal-maryland-coach-randy-edsall-fired-20151008-story.html", "country": "US", "title": "Maryland fires football coach Randy Edsall; seeks coach to 'excite fan base'", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Maryland fires football coach Randy Edsall; seeks coach to 'excite fan base'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T05:33:00.000+03:00", "replies_count": 0, "uuid": "38c81c633901e2fda0fd9b08048e7a8371cf5a63"}, "author": "Don Markus, Daniel Gallen", "url": "http://www.chicagotribune.com/sports/college/bal-maryland-coach-randy-edsall-fired-20151008-story.html", "ord_in_thread": 0, "title": "Maryland fires football coach Randy Edsall; seeks coach to 'excite fan base'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Maryland athletic director Kevin Anderson said on Sunday that he first began pondering the dismissal of head football coach Randy Edsall after the Terps were chased out of their stadium by Bowling Green a month ago, but he began having doubts about the direction of the program late last season. ... \nMaryland athletic director Kevin Anderson said on Sunday that he first began pondering the dismissal of head football coach Randy Edsall after the Terps were chased out of their stadium by Bowling Green a month ago, but he began having doubts about the direction of the program late last season. ... (Peter Schmuck) \nAnderson said that the university plans to use the extra television revenue that it earns from jumping to the Big Ten from the Atlantic Coast Conference last year to help pay off Edsall and hire a new coach. \n“There is a short-term cost [of paying off Edsall], but we feel that there are going to be long-term benefits and that entering the Big Ten and being associated with the conference, it has changed our economic model and we'll be able to weather this,” Anderson said. \nA source familiar with the financial model Anderson plans to use said that the package for the next football coach will increase significantly in order to attract a high-profile candidate. “We will be able to double it at least,” the source said. \nIf Maryland can significantly increase the package, the Terps might be able to attract a head coach away from a top football program. \nOn Sunday, Anderson praised Edsall, mostly for the job he had done in solidifying the program academically. \n“Randy's done a lot of great work, he helped us tremendously in our mission academically, he's developed a lot of great young men who played football here,” Anderson said. “Over the past two years, we had shown improvement, we went to two bowl games, but over the last six games we had a significant setback and that's why I made my decision.” \nEdsall's time at Maryland started with a lot of promise after he went 74-70 in 12 seasons at the University of Connecticut. \nHe led the Terps, wearing the first iteration of Under Armour's “Maryland Pride” uniforms before a prime-time audience, to a 32-24 victory over Miami at the beginning of the 2011 season. Less than two weeks later, Maryland pushed eventual Orange Bowl champion West Virginia to the brink in a six-point loss. \nBut things deteriorated quickly from there. The Terps lost eight straight games to finish 2-10. In 2012, Maryland finished the year with six straight defeats and 4-8 overall. \nEdsall struggled to endear himself to Maryland fans, and even some players, after replacing the popular Friedgen. There were culture clashes that first season, when Edsall instituted a new set of rules, including a ban on earrings and hats inside Gossett Football Team House. Twenty-four players left the program within a year. \nThe Terps improved their academic performance and graduation rate under Edsall. With the help of Locksley, a former assistant coach during Friedgen's early years who returned in 2012 after an unsuccessful head coaching stint at New Mexico, Maryland's recruiting improved. \nLast season, the Terps finished 7-6 for the second straight year, including a respectable 4-4 record in their inaugural Big Ten season, with watershed road wins over Penn State and Michigan. \nBut in the end, Edsall's record at Maryland was not better than or even comparable to Friedgen's. It was similar to those of Joe Krivak (20-34) and Mark Duffner (20-35), both of whom were fired after five seasons. \nAnderson said that he didn't start having any second thoughts Saturday during the game at Ohio State, when the Terps took a surprising 7-0 lead and, even more shockingly, tied the game at 21 early in the second half after falling behind by two touchdowns late in second quarter. Maryland is 2-4 overall and 0-2 in the Big Ten. \n“Yesterday, we lost by 21 points,” he said flatly. \nBaltimore Sun editor Alexander Pyles contributed to this article.", "external_links": [], "published": "2015-10-12T05:33:00.000+03:00", "crawled": "2015-10-14T11:48:37.166+03:00", "highlightTitle": ""}