{"organizations": [], "uuid": "756a523aa06c9f61a4bc5a4b642e611ef76e1156", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/49265678.cms", "site_section": "http://timesofindia.indiatimes.com/sports/articlelist/4720867.cms", "section_title": "Top Stories - Golf - Sports - The Times of India", "url": "http://timesofindia.indiatimes.com/india/Infiltration-bids-down-in-2015-but-more-men-killed/articleshow/49265649.cms", "country": "IL", "title": "Infiltration bids down in 2015, but more men killed", "performance_score": 0, "site": "indiatimes.com", "participants_count": 2, "title_full": "Infiltration bids down in 2015, but more men killed - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T13:03:00.000+03:00", "replies_count": 1, "uuid": "86621ad98fb6ede6490929b67cc2f0c1105f496b"}, "author": "Bharti Jain", "url": "http://timesofindia.indiatimes.com/india/Infiltration-bids-down-in-2015-but-more-men-killed/articleshow/49265649.cms#post-0", "ord_in_thread": 0, "title": "Infiltration bids down in 2015, but more men killed", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW DELHI: Indian security forces have achieved greater success in thwarting terrorist infiltrations from Pakistan this year but at a greater cost as 34 men in uniform were martyred until September as compared to 25 in the corresponding period of 2014.\nTotal incidents at 151 match the levels recorded until September last year and as many as 77 militants were killed over this period as against 78 in 2014, even though civilian fatal casualties are slightly lower at 16 from 19 last year.\nThe latest infiltration figures accessed by TOI show a major decline in attempts, both successful and unsuccessful. In 81 attempts reported until September this year, 32 terrorists were neutralized by security forces manning the LoC/international border, 37 were forced to return to the Pakistan side and two were arrested. Only 10 militants could successfully cross into Indian territory.\nThis is in stark contrast to the figures for 2014, when there were 222 attempts, ending in killing of 52 intruders and the turning back of 105 others, even as 65 managed to sneak into J&K.\nHowever, what is striking is the sharp rise in infiltration over the past two months of August and September, with attempts jumping 33% to 81 by September-end from 61 in July. This is largely attributed to attempts to push in as many militants before winter sets in and the passes get blocked by snow.\nAttributing the rising component of local recruits vis-a-vis foreign militants in J&K essentially to \"falling levels of infiltration\", an intelligence operative claimed the stepped-up guard at the LoC/international border limited the successful infiltration attempts to just 10 as compared to 65 in the whole of last year. This has pushed up the percentage of local terrorists as part of the total numbers active in the Valley.\nHome ministry sources said around 200-220 terrorists/militants, both local and foreign, are estimated to be holed up in the Valley. Though they possess arms, not many are actively engaging the security forces in encounters. \"This could be due to their poor and inadequate training. Earlier the militants could exfiltrate and train at camps in PoK, but the heightened vigil by Indian forces at the border has made this a difficult proposition... not many local recruits are well-versed in the use of arms, which has made them less of a worry to the security agencies,\" a senior officer in the security establishment told TOI.\nSources said much of the local recruitment was taking place in Tral and Pulwama. \"Many of the new recruits are unable to adapt to the hard life of a militant that involves living in the jungles... they are not as committed or hardened and there have been some cases of these terrorists wanting to return to their families,\" said the officer.\nStay updated on the go with Times of India News App. Click here to download it for your device.", "external_links": ["https://play.google.com/store/apps/details?id=com.toi.reader.activities"], "published": "2015-10-08T13:03:00.000+03:00", "crawled": "2015-10-08T03:45:56.410+03:00", "highlightTitle": ""}