{"organizations": ["Walsall Tweet"], "uuid": "8f53aa5bfa3acd4e17cea4454983dd6427dc11b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.expressandstar.com", "main_image": "", "site_section": "http://www.expressandstar.com/sport/feed", "section_title": "Midlands Sport News - West Midlands Sport - Sports News Scores « Express & Star", "url": "http://www.expressandstar.com/sport/walsall-fc/2015/10/24/dean-smith-penalty-call-affected-walsall/", "country": "GB", "title": "Dean Smith: Penalty call affected Walsall", "performance_score": 0, "site": "expressandstar.com", "participants_count": 0, "title_full": "Dean Smith: Penalty call affected Walsall", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T20:05:00.000+03:00", "replies_count": 0, "uuid": "8f53aa5bfa3acd4e17cea4454983dd6427dc11b3"}, "author": "", "url": "http://www.expressandstar.com/sport/walsall-fc/2015/10/24/dean-smith-penalty-call-affected-walsall/", "ord_in_thread": 0, "title": "Dean Smith: Penalty call affected Walsall", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Dean Smith"], "text": "Tweet \nHaving found themselves 2-0 and 3-2 up at the Weston Homes Community Stadium, the Saddlers saw shouts for a spot-kick waved away. \nTom Bradshaw’s overhead kick hit a defender’s hand. But, instead of pointing to the spot, referee Seb Stockridge allowed play to go on. \nTony Humes’ side going up the other end and taking a 4-3 lead through Darren Ambrose. \nAnd Smith admitted that decision, together with some uncharacteristically poor defending meant he was disappointed to leave Essex without all three points. \nThe Saddlers boss said: “We’re bitterly disappointed not to have won. We were 2-0 up at half-time and played some fantastic stuff in the first-half. \n\"But there was always an attacking threat from them and they had a few chances in the first half, as well. \n“I spoke to the players about things at half-time and about what not to do and we went and did the opposite to be honest. \n“The lad (George Moncur) scored a good goal for their first and the second one we thought was offside, but it was marginally onside. \n“Their third goal was a speculative strike from the edge of the box with people not doing their jobs in terms of our players and their fourth goal, we should have had a penalty at the other end. \n“They broke away and scored and I feel that that decision cost us two points.” \nWalsall rescued a point in stoppage though James O’Connor's late leveller and then could have won it right at the end when Kieron Morris rattled the bar. \nAnd, while disappointed not to get the victory, Smith was pleased with his side’s character to score so late on. \nHe said: \"It showed the character of the players when we equalised because, at that stage, it was a test. \n“We got the equaliser and we still wanted to get the ball to try and score a winner and we nearly did through Kieron Morris’s shot that rattled the bar. \n“Colchester are a good attacking team – I always felt that we could score goals against them but our defending has to be better. More on this story:", "external_links": [], "published": "2015-10-24T20:05:00.000+03:00", "crawled": "2015-10-25T02:52:51.367+02:00", "highlightTitle": ""}