{"organizations": [], "uuid": "1439ad5968e223e011627a0d135dc65ab8f9affb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fox8live.com", "main_image": "http://APMOBILE.images.worldnow.com/images/8973546_G.jpg", "site_section": "http://www.fox8live.com/", "section_title": "New Orleans News, Weather, Saints - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "url": "http://www.fox8live.com/story/30217349/merkel-zerai-pope-francis-all-in-nobel-peace-prize-buzz", "country": "US", "title": "Merkel, Zerai, Pope Francis all in Nobel Peace Prize buzz", "performance_score": 0, "site": "fox8live.com", "participants_count": 1, "title_full": "Merkel, Zerai, Pope Francis all in Nobel Peace Prize buzz - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T20:23:00.000+03:00", "replies_count": 0, "uuid": "1439ad5968e223e011627a0d135dc65ab8f9affb"}, "author": "cbs8", "url": "http://www.fox8live.com/story/30217349/merkel-zerai-pope-francis-all-in-nobel-peace-prize-buzz", "ord_in_thread": 0, "title": "Merkel, Zerai, Pope Francis all in Nobel Peace Prize buzz", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By MARK LEWIS\nAssociated Press OSLO, Norway (AP) - Europe's record-breaking refugee crisis was a hot topic ahead of the Nobel Peace Prize announcement on Friday, but a Saudi blogger, a pope who reveres the Earth and its poorest people and the key players in the Iranian nuclear deal were also generating buzz.\nThe Norwegian Nobel Committee has given no clues but those bringing relief to the hundreds of thousands of desperate people arriving in Europe have attracted interest from gamblers and pundits. Here are some names being mentioned in the annual Peace Prize guessing game:\nANGELA MERKEL\nThe German chancellor became the face of European inclusiveness in September when she pledged to open the country's borders to refugees fleeing Syria and other war-torn areas.\nShe was nominated before the Feb. 1 deadline for her role in trying to broker peace between Russia and Ukraine, but the committee could still consider her for subsequent actions.\nKristian Berg Harpviken, head of the Peace Research Institute Oslo, says Merkel's \"humane response\" to the immigration crisis has shamed other European leaders, helping to avert an even worse humanitarian crisis. However, she has angered politicians at home and in transit countries like Hungary, who accuse her of creating an irresistible lure for millions who are unhappy in their homelands.\nMerkel leads the peace prize odds at the British betting house William Hill.\nTHE REV. MUSSIE ZERAI\nThe U.N. High Commissioner for Refugees (UNHCR) has twice picked up the Nobel Peace Prize, but after awards to the European Union in 2012 and the Organization for the Prohibition of Chemical Weapons in 2014, the panel might prefer a human face.\nThe Rev. Mussie Zerai, an Eritrean Catholic priest who helps coordinate rescue missions with the Italian and Maltese coast guards, has been nominated for his role in saving distressed people en route from Africa to Europe.\nPOPE FRANCIS\nA book by Geir Lundestad, the former secretary of the Norwegian Nobel Committee, suggests the group has had a historic antipathy to awarding the prize to pontiffs. But Pope Francis is the rumor that won't go away.\nHe is a notable champion of the poor, opening the Vatican up to the homeless and demanding greater distribution of the world's wealth to the neediest. His involvement in the historic U.S.-Cuba rapprochement has only burnished his peace-making credentials. And his recent encyclical on the environment, which demands nothing less than a new world order to protect the Earth and its most vulnerable people, has reinvigorated efforts to fight global warming.\nBut the committee should be warned: Francis has either returned or regifted most honors, medals and awards given to him, although he probably would accept the cash and give it immediately to charity.\nRAIF BADAWI\nThe Saudi blogger who criticized the kingdom's powerful clerics on a liberal blog was sentenced last year to 10 years in prison and 1,000 lashes for insulting Islam. Rights groups say the case against Badawi is part of a wider crackdown on freedom of speech.\nAfter the deadly Charlie Hebdo attacks in Paris in January, the Nobel committee might see Badawi as a relatively uncontroversial way of recognizing the issue. Earlier this week, Badawi also jointly won the PEN Pinter Prize, a major free-speech award.\nOther free speech advocates are nominated: a Danish newspaper editor involved in the publication 10 years ago of caricatures of the Prophet Muhammad and the Russian newspaper Novaya Gazeta, which has criticized the Kremlin and run investigations into official Russian corruption.\nJOHN KERRY AND JAVAD ZARIF\nThe U.S. secretary of state and his Iranian counterpart did the face-to-face negotiating that experts say was the critical final component of July's deal on Iran's nuclear program.\nTariq Rauf, director of the Swedish peace institute SIPRI and a former nuclear inspector, says the agreement to end sanctions against Iran in return for strict controls on Iranian nuclear development was the most important multilateral agreement in decades.\n\"But it took the diplomacy of these two men to break the more than a decade long deadlock, end the suffering of ordinary Iranians and strengthen the moderates against the mullahs,\" he said.\nHe wondered, however, whether the Nobel committee might wait until 2016 to see if the nuclear agreement sticks.\nCopyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-08T20:23:00.000+03:00", "crawled": "2015-10-09T17:15:19.558+03:00", "highlightTitle": ""}