{"organizations": [], "uuid": "e36004f536b508eafdaf5838781b977625f8dfbc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.times-herald.com", "main_image": "http://content.times-herald.com/nthv2/img/fb-promo-def.jpg", "site_section": "http://feeds.times-herald.com/rss/sports", "section_title": "The Times-Herald > Sports", "url": "http://www.times-herald.com/Sports/20151015-SPORTS-NewnanSoftball", "country": "US", "title": "Lady Cougars crush Newton in mercy-rule win", "performance_score": 0, "site": "times-herald.com", "participants_count": 0, "title_full": "Lady Cougars crush Newton in mercy-rule win", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T09:19:00.000+03:00", "replies_count": 0, "uuid": "e36004f536b508eafdaf5838781b977625f8dfbc"}, "author": "", "url": "http://www.times-herald.com/Sports/20151015-SPORTS-NewnanSoftball", "ord_in_thread": 0, "title": "Lady Cougars crush Newton in mercy-rule win", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Newton"], "text": "Comments \nCOVINGTON — If the Newnan Lady Cougars softball team had any doubts about opening the Class state tournament on the road Wednesday against Newton, they were quickly laid to rest. \nUsing a potent offense, Newnan rolled to a sweep of the host Lady Rams 14-0 and 12-4 in games called by the mercy rule. \nThe Lady Cougars outhit the Lady Rams 25-9 while returning to the GHSA Class Sweet 16. \nNewnan went into the contest as the No. 3 seed out of Region 3- after losing to both East Coweta and South Cobb last week in the region tournament, and will now travel to South Forsyth for the second-round game. \nSouth Forsyth swept Peachtree Ridge in its first round. \nThe winner advances to Columbus and the Elite 8. \nNewnan pitcher Addie Andrews picked up the win in both games, combining for eight strikeouts, one walk and five hits. \nNewnan set the table in the first game with six runs in the first three innings. The Lady Cougars kept the offense going with two more runs in the fourth, and put the game away with an six-run offensive explosion in the fifth. \nLeslie Davis paced the Lady Cougars to the victory in the first game, finishing 2-for-4 with three RBIs. Katelin Richardson was 3-for-3 with two RBIs, including a triple. \nDavis finished the first game with two doubles and Sarah Vallery also added a double. \nDanielle Curlee helped spark the Lady Cougars’ offense from the bottom of the order in the first game, finishing with two hits. \nLittle changed for Newnan in the nightcap. With the Lady Rams batting first in the second contest, Newnan gave up a run in the top of the first, but regained the lead for good when it pushed three runs across the plate in the bottom of the first. \nFrom there, it scored at least one run in every inning, including two in the second, five in the third, and one each in the fourth and fifth. \nThe Lady Rams managed to push one more run across in the second and two in the fifth before the Lady Cougars put and end to the Lady Rams’ season. \nLeadoff hitter Hannah Scarbrough led the offense with a 2-for-4 performance in the second game and scored three times. \nVallery continued to swing a potent bat in the second game, with two RBIs. First baseman Maysen Willard also drove in a pair of runs. \nDarby Keene and Curlee also had an RBI. \nGAME 1 \nLady Cougars 14, Lady Rams 0 \nNewnan 024 26—14 16 2 \nNewton 000 00—0 2 5 \nWP — Addie Andrews \nLady Cougars 12, Lady Rams 4 \nNewton 110002 — 4 3 2 \nNewnan 32511x—1293", "external_links": [], "published": "2015-10-15T09:19:00.000+03:00", "crawled": "2015-10-15T23:47:01.850+03:00", "highlightTitle": ""}