{"organizations": ["Waynesville", "Monett", "FINAL Osceola", "FINAL Bolivar", "Mount Vernon", "Nixa", "FINAL Catholic", "East Newton", "Springfield Catholic", "Lakers", "LaSalle", "Cedarville", "Kickapoo", "FINAL Lighthouse Christian", "Strafford", "Comets", "Lockwood", "Northwest", "Trey Collins, Kendall Young and Colby Davis", "Eagles", "FINAL Greenland", "Cabool", "Hollister", "McAuley Catholic", "Buffalo", "Colby Cornett", "Green Forest", "Chargers", "Marshfield", "Bulldogs", "Berryville", "Carl Junction", "Neosho", "Marionville", "Chiefs", "Pierce City", "Carthage", "McDonald County", "Webb City", "Glendale", "Kickapoo High School", "Bobcats", "Camdenton", "Houston", "Tigers", "Rogersville", "West Plains", "Cassville", "Sarcoxie", "Mustangs", "Thayer", "Skyline", "Marshfield TD"], "uuid": "a278911785caf1f24384cb68c2633d05c29b6179", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ozarkssportszone.com", "main_image": "http://imgsrv.ozarkssportszone.com/image/DbGraphic/201510/3172085.jpg", "site_section": "http://www.kspr.com/sports/21051914_21051920?format=rss_2.0&view=feed", "section_title": "Sports Top Stories", "url": "http://www.ozarkssportszone.com/Week-7-Football-Roundup/22029203", "country": "US", "title": "Week 7 Football Roundup", "performance_score": 0, "site": "ozarkssportszone.com", "participants_count": 0, "title_full": "Week 7 Football Roundup", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T10:12:00.000+03:00", "replies_count": 0, "uuid": "a278911785caf1f24384cb68c2633d05c29b6179"}, "author": "", "url": "http://www.ozarkssportszone.com/Week-7-Football-Roundup/22029203", "ord_in_thread": 0, "title": "Week 7 Football Roundup", "locations": ["Warrensburg", "Waynesville", "Monett", "Lebanon", "Springfield", "Marshfield", "Hughesville", "Parkview", "Nixa", "Tulsa", "Neosho", "East Newton", "Marionville", "Aurora", "Pierce City", "Carthage", "Willow Springs", "Webb City", "Glendale", "Nevada", "El Dorado Springs", "Houston", "Camdenton", "Strafford", "Rogersville", "West Plains", "Cassville", "Republic", "Hillcrest", "Cabool", "Buffalo"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Stuart McKarus", "Nicos Oropeza", "Matt Duley", "Harrison", "Lance Hymer", "Darrian Guillory", "Austin Fodge", "Ben Friend", "Cornett", "Braden Pender", "Jacob Baird", "Mark Duley", "Zack Brown", "Riley Watkins", "Ava", "Connor Sechler", "Branson", "Burlage", "McKarus", "Mason Brown", "Grant Taylor", "Chase Allen", "Jarrett Esposito", "Adrian", "Nathan Poynter", "Nathaniel Burlage", "Cloyd", "Quentin Cotton", "Jackson Bagley", "Chris Stanley", "Joplin", "Jasper", "Cooper Lunas", "Clinton", "Vernon", "Lockwood", "Nick Haddock", "Malachi Stout", "Billy Meredith", "Ethan Kelley", "Devin Hames", "Rolla", "Derek Burr", "Chris Jones", "Marcos Rodriguez", "Miller", "McAuley Catholic", "Hollister", "Tanner Merz", "Josh Pruett", "Mason Robertson", "Tucker Hargrove", "Burr", "Keegan Chrisco", "Parker Sopek", "Spencer Eagleburger", "Carl Junction", "Ayden Henry", "Caleb McFarlin", "Dalton Cloyd", "Hunter Puckett", "Willard", "Hadlock", "Hunter Yeargan", "Austin Zeigler", "Jarrett Massie", "Nate Bray", "Kyle Smith", "Fisher Ray", "Lamar", "Robbie Avila", "Hunter", "Gavin Dunnan", "Houston", "Jacob Eden", "Greenfield", "Stockton", "Brenton Bush", "Maverick McGee", "Kenny Chambers", "Brayden Lumley", "Jerney Jones", "FINAL Rolla", "Nick Crites", "FINAL Gentry", "Payton Evans", "Neal Ukena", "Chris Lawson", "Sarcoxie", "Butler", "Chris Dettling", "Austin Schock", "Jacob LaSalle", "Thayer", "Massie", "Ben Schnelle"], "text": "1 Awards Week 7 Football Roundup Lots of big games and performances around the area in Week 6. Here's a recap of all the action from Friday, Oct. 2. No. 1 Webb City 35, Neosho 7 - FINAL CLICK HERE FOR PHOTOS Neosho was within 13-7 at halftime, but scored 22 unanswered points in the second half. A Devin Hames TD run got Neosho within 13-7 with 13.5 seconds left in the second quarter. Webb City scored twice in the third quarter, including an interception return for a TD, to go up 28-7. Webb City (7-0 overall, 5-0 COC-Large) plays at Ozark next week. Neosho (4-3 overall, 2-3 COC-Large) plays at Republic. No. 1 Lamar 63, East Newton 6 - FINAL CLICK HERE FOR PHOTOS Lamar put away East Newton early, leading 28-0 after one quarter and 42-0 at halftime. Stuart McKarus’ 43-yard TD run gave Lamar a 21-0 lead. A 68-yard TD run by Cooper Lunas made it 35-0 Lamar three minutes into the second quarter. McKarus scored again to open the second half, making it 49-0. Lamar (7-0 overall, 6-0 Big 8) plays at Aurora next week. East Newton (0-7 overall, 0-6 Big 8) plays at Cassville. No. 2 Carl Junction 35, No. 6 Monett 0 - FINAL CLICK HERE FOR PHOTOS CLICK HERE FOR VIDEO Carl Junction led 22-0 at halftime and went on to hold Monett scoreless. The Bulldogs (7-0 overall, 6-0 Big 8) host Seneca next week. Monett (5-2 overall, 5-2 Big 8) hosts Clinton. No. 2 Marionville 22, Fair Grove 20 - FINAL CLICK HERE FOR A RECAP Marionville stopped Fair Grove on a potential game-tying 2-point conversion to win a Mid-Lakes Conference thriller. With less than five minutes to go, Dalton Cloyd’s 4-yard TD run got Fair Grove within 22-20, but the Comets stopped the Eagles on the ensuing 2-point try. Cloyd’s TD run was the only score of the second half, after Marionville led 22-14 at halftime behind three first-half TD runs from Jacob LaSalle. He had 33 carries for 123 yards, and was 8-for-14 passing for 104 yards, but also threw a fourth-quarter interception that set up Cloyd’s score. LaSalle would get an interception of his own, on defense, on Fair Grove’s 2-point try to preserve the Marionville lead. Fair Grove QB Brayden Lumley was 11-for-15 for 118 yards but was picked off twice. Austin Fodge carried 13 times for 51 yards for Fair Grove. The Eagles (5-2 overall, 3-2 Mid-Lakes) host Ash Grove next week. Marionville (7-0, 4-0 Mid-Lakes) visits Skyline in a game that will determine the Mid-Lakes Conference champion. No. 3 Skyline 21, Strafford 14 - FINAL CLICK HERE FOR PHOTOS CLICK HERE FOR VIDEO Jacob Eden’s 15-yard TD run gave Strafford a 14-7 lead in the second quarter, but Skyline tied it 14-all by halftime then scored the only touchdown of the second half – with 7 minutes left in the fourth quarter – to remain undefeated on the season. Skyline (7-0 overall, 5-0 Mid-Lakes) hosts Marionville for the Mid-Lakes Conference championship next week. Strafford (2-5 overall, 1-4 Mid-Lakes) hosts El Dorado Springs. No. 5 Lockwood 46, Sarcoxie 20 - FINAL CLICK HERE FOR PHOTOS Lockwood continued its streak of scoring 40 or more points in every game this season, improving to 6-0 overall and 4-0 in the SRVC. Lockwood QB Ben Schnelle was 15-for-24 for 162 yards, a passing TD and a rushing TD. His 27-yard TD run in the third quarter gave Lockwood a 38-6 lead. Lockwood plays at Miller next week. Sarcoxie (1-5 overall, 1-4 SRVC) plays at Butler. No. 8 Kickapoo 42, No. 6 West Plains 21 - FINAL CLICK HERE FOR A RECAP Kickapoo led 20-6 at halftime, then matched West Plains touchdown-for-touchdown in the second half to win a battle of undefeated Ozark Conference teams. Chiefs QB Chris Lawson was 13-for-21 passing for 169 yards. Running back Malachi Stout had 98 rushing yards and three touchdowns. Kickapoo got a 28-yard TD run from Maverick McGee and a 90-yard kickoff return by Stout that gave the Chiefs a 13-6 lead at the time. West Plains (6-1) hosts Parkview next week. Kickapoo (7-0) travels to Lebanon. No. 7 Carthage 41, Branson 6 - FINAL Carthage got TD runs from Trey Collins, Kendall Young and Colby Davis to defeat Branson at home. The Tigers (6-1 overall, 4-1 COC-Large) host Nixa next week. Branson (1-6 overall, 1-4 COC-Large) hosts Willard. No. 7 Mountain Grove 20, Salem 14 - FINAL Mtn. Grove led 20-14 at halftime, and both teams were held scoreless in the second half. The Panthers (6-1 overall, 4-1 SCA) play at Houston next week. Salem (3-4 overall, 2-3 SCA) plays at MV-BT/Liberty. No. 7 MV-BT/Liberty 46, Cabool 8 - FINAL CLICK HERE FOR PHOTOS Liberty poured in on from the start, scoring two quick touchdowns and taking a 39-0 lead into halftime. Eagles QB Josh Pruett was 11-for-18 for 195 yards and two touchdowns, and also rushed seven times for 51 yards and three touchdowns. Liberty’s Brenton Bush caught four passes for 85 yards and 2 TDs. Marcos Rodriguez had eight rushes for 60 yards and a touchdown. Liberty (7-0, 5-0 SCA) hosts Salem next week. Cabool (0-7, 0-5 SCA) plays at Ava. No. 8 Reeds Spring 50, Hollister 0 - FINAL Reeds Spring dominated throughout, leading 21-0 after the first quarter and 42-0 at halftime. Nick Haddock’s 66-yard TD run on the first play of the third quarter gave the Wolves a 50- lead. The Wolves (7-0 overall, 5-0 COC-Small) host Central next week. Hollister (2-5 overall, 1-4 overall) visit Rogersville. No. 9 Thayer 35, Ava 20 - FINAL CLICK HERE FOR A RECAP Thayer QB Ayden Henry passed for 185 yards and two touchdowns, while Tucker Hargrove scored a pair of touchdowns as the Bobcats won a conference game on the road. After a 79-yard run by Nate Bray, Ava’s Caleb McFarlin had a 1-yard TD run with six seconds left in the first quarter to give the Bears a 12-7 lead. It was all Bobcats from there. Thayer scored 28 unanswered points, including a Braden Pender 35-yard TD run that made it 35-12. Thayer (6-1 overall, 4-1 SCA) hosts Willow Springs next week. Ava (4-3 overall, 2-3 overall) hosts Cabool. No. 10 Nixa 19, Ozark 7 - FINAL CLICK HERE FOR A RECAP Nixa defeated Ozark for the third straight season in the annual rivalry game, overcoming a sloppy start in the first half. Nixa led 6-0 at halftime, then got second-half touchdowns from Jacob Baird (13-yard TD catch) and Chase Allen (22-yard TD catch). Nixa RB Nicos Oropeza had 119 rushing yards on 20 carries. Ozark got a late, 27-yard touchdown run from Nathaniel Burlage to avoid the shutout. Burlage rushed for 83 yards for the night off 11 carries. Nixa (4-3 overall, 3-2 COC-Large) plays at Carthage next week. Ozark (1-6 overall, 0-5 COC-Large) hosts Webb City. Other area games Waynesville 42, Camdenton 21 - FINAL CLICK HERE FOR A RECAP Waynesville got its first win over Camdenton since 2007. The Lakers (3-4) play at Joplin next week. Waynesville (3-4) plays at Glendale. Republic 49, Willard 35 - FINAL CLICK HERE FOR A RECAP Republic scored the first 28 points of the game, then held on for the win after Willard made it a 28-21 game going into the fourth quarter. A 9-yard TD pass from Kyle Smith to Kenny Chambers got Willard within 42-35, but Republic answered with a 67-yard Riley Watkins TD run to go up 49-35 with under two minutes to play. Republic’s Jerney Jones had 26 carries for 204 yards and three touchdowns, and also had a 55-yard receiving touchdown. Willard’s Hunter Yeargan had 31 carries for 249 yards and three touchdowns. Willard (4-3 overall, 2-3 COC-Large) plays at Branson next week. Republic (4-3 overall, 3-2 COC-Large) hosts Neosho. Rolla 61, Glendale 44 - FINAL Rolla scored 20 points in the final 3:16 of the first half, including a 100-yard interception TD return as time expired, to lead 42-30 at halftime. Rolla led 48-36 going into the fourth quarter. Bulldogs QB Zack Brown passed for over 400 yards and six touchdowns. Keegan Chrisco scored six TDs. The Rolla defense forced six turnovers on the night. Rolla (2-5) plays at Hillcrest next week. Glendale (1-6) hosts Waynesville. Joplin 35, Lebanon 7 - FINAL CLICK HERE FOR A RECAP In a surprisingly lopsided game, Joplin led 35-0 at halftime and dominated the Yellowjackets on the road. In the first quarter, Mark Duley caught a TD pass and also returned a fumble for a TD. In the second quarter, Chris Jones had a 2-yard TD run, Matt Duley a 14-yard TD run, and Darrian Guillory caught an 80-yard TD pass from Colby Cornett in the final 30 seconds to give Joplin a 35-0 halftime lead. Joplin put together 307 yards of total offense as Cornett threw for 207 yards and the Eagles added 100 yards rushing. Joplin (5-2 overall) hosts Camdenton next week. Lebanon (5-2) hosts Kickapoo. Springfield Central 38, Marshfield 22 - FINAL CLICK HERE FOR VIDEO Leading 8-7 after the first quarter, Central broke the game open in the second quarter and led by at least two possessions the rest of the way. The Bulldogs scored twice in the second quarter to lead 24-7 at halftime. A Marshfield TD in the third quarter made it 24-14, but Central answered with a score of its own to go up 32-14 at the 2:23 mark. Another Marshfield TD cut the Central lead to 32-22 early in the fourth quarter, but Central scored a TD about three minutes later to make it 38-22. Central (4-3 overall) plays at Reeds Spring next week. Marshfield (2-5 overall, 2-2 COC-Small) plays at Buffalo. Bolivar 69, Rogersville 0 - FINAL Bolivar blasted Rogersville, leading 42-0 after the first quarter. Bolivar QB Connor Sechler was 11-for-13 for 204 yards and two touchdowns, only playing the first half. Bolivar (6-1 overall, 4-0 COC-Small) has won its last four games (all COC-Small) by a combined margin of 264-6. The Liberators play at Catholic next week. Rogersville (1-6 overall, 1-3 COC-Small) hosts Hollister. Mount Vernon 23, Cassville 16 - FINAL CLICK HERE FOR A RECAP Jarrett Massie caught the game-winning touchdown with three minutes remaining as Mt. Vernon defeated Cassville on homecoming. Massie also had a first-half TD grab, hauling in a 22-yarder from QB Hadlock that gave Mt. Vernon a 16-9 halftime lead. Mt. Vernon (3-4 overall, 3-4 Big 8) hosts McDonald County next week. Cassville (2-5 overall, 2-4 Big 8) hosts East Newton. Springfield Catholic 51, Buffalo 14 - FINAL Catholic was in control from start to finish, leading 20-0 after the first quarter, 37-0 at halftime, and 44-0 going into the fourth quarter. The Irish rushed for over 300 yards and had several players finish with around 60-80 yards on the ground. Catholic's Tanner Merz carried 10 times for 76 yards and 2 TDs. Neal Ukena carried 6 times for 80 yards and a TD. Nick Crites carried 8 times for 56 yards and a TD. Robbie Avila, Mason Robertson and Hunter Puckett also had rushing TDs for Catholic. Buffalo (1-6 overall, 0-4 COC-Small) hosts Marshfield next week. Catholic (2-5 overall, 2-2 COC-Small) hosts Bolivar. Ash Grove 62, Pleasant Hope 0 - FINAL Ash Grove QB Jackson Bagley tossed four touchdowns in the home victory. Spencer Eagleburger had 107 total yards and two touchdowns. Parker Sopek had 95 total yards and two touchdowns. Ash Grove (4-3 overall, 1-3 Mid-Lakes) plays at Fair Grove next week. Pleasant Hope (0-7 overall, 0-5 Mid-Lakes) hosts Stockton. Houston 29, Willow Springs 22 - FINAL CLICK HERE FOR PHOTOS Houston jumped out to a quick 14-0 lead, fell behind in the fourth quarter after leading all game, then got the game-winning score with 1:13 left to prevail. The Tigers improved to 4-3 overall, continuing their best football season in several years. Trailing 22-21, Chance Hunter’s 4-yard TD run with just over a minute remaining made it 29-22 and proved to be the game-winner. Houston scored on the second play of the game, then went up 14-0 as Nathan Poynter threw a TD pass to Ethan Kelley. An Austin Schock interception helped set up the score. Willow Springs would get a 71-yard TD run from Chris Stanley to cut the deficit to 14-8 after one quarter. Hunter’s 15-yard TD run pushed Houston’s lead up to 21-8. Two Willow Springs touchdowns, including a 55-yard TD pass, gave the Bears their first lead of the game (22-21) with 8:08 remaining in the fourth quarter. Houston (2-3 SCA) hosts Mtn. Grove next week. Willow Springs (1-6 overall, 1-4 SCA)) plays at Thayer. El Dorado Springs 48, Pierce City 20 - FINAL CLICK HERE FOR PHOTOS The Bulldogs led 14-7 after the first quarter, 28-7 at halftime and 42-13 going into the fourth quarter. El Dorado Springs (3-4 overall) plays at Strafford next week. Pierce City (2-4 overall, 2-3 SRVC) hosts McAuley Catholic. Diamond 47, Miller 12 - FINAL Diamond improved to 5-2 overall and plays at Liberal next week. Miller fell to 1-6 overall and returns home to face Lockwood next week. Seneca 36, McDonald County 32 - FINAL In a back-and-forth game that had multiple lead changes, Seneca held off the Mustangs to improve to 2-5 overall. Seneca QB Derek Burr connected with Quentin Cotton for a 44-yard TD pass, putting the Indians up 16-14 with 3:08 left in the first half. Less than two minutes later, McDonald County scored to go ahead 20-16. But Seneca would answer with a score of its own in the final minute to lead 22-20 at halftime. In the third quarter, Burr threw a 5-yard TD pass to Gavin Dunnan to put Seneca up 28-20. After McDonald County got within 28-26, Lance Hymer’s 1-yard TD run and a 2-point conversion pushed the Seneca lead back to 36-26 with 2:15 left in the game. The Mustangs got a late TD, but time would eventually run out on them. Seneca (2-4 Big 8) plays at Carl Junction next week. McDonald County (1-6 overall, 1-5 Big 8) plays at Mt. Vernon. Lighthouse Christian 22, Tulsa NOAH 9 - FINAL Lighthouse Christian came away with a victory in its trip to Tulsa. Chargers RB Ben Friend had 31 carries for 224 yards and two touchdowns, and also intercepted two passes on defense. On the second play from scrimmage, Friend had a 72-yard touchdown run to put the Chargers up 8-0. Lighthouse Christian led 14-0 at halftime after Grant Taylor hit Haaken Friend for a 38-yard touchdown pass in the second quarter. The Lighthouse Christian defense also got big games from Haaken Friend (8 tackles), Austin Zeigler (8 tackles, 2 for loss) and Fisher Ray (7 tackles). Lighthouse Christian (4-2) hosts Midway next week, at Kickapoo High School. Aurora 29, Nevada 7 - FINAL Aurora led 15-7 at halftime and scored the only two touchdowns of the second half. Aurora QB Payton Evans was 13-for-21 for 105 yards and two touchdowns. Senior fullback Chris Dettling had 23 carries for 132 yards and a touchdown. Senior Billy Meredith caught four passes for 27 yards and a touchdown, and also had two carries for 83 yards and a touchdown. Aurora’s defense had one of its best performances of the season, holding Nevada to 68 passing yards and 38 rushing yards. The Houn’ Dawgs (4-3 overall, 3-3 Big 8) host Lamar next week. Nevada (2-4) plays at Warrensburg. Butler 55, Stockton 35 - FINAL Butler outscored Stockton to improve to 6-1 overall. The Bears led 21-7 at halftime, then 27-7 after an early third-quarter touchdown. A Stockton touchdown cut the deficit to 33-21 with 7:59 left in the fourth quarter. Butler scored 21 seconds later to make it 39-21. Later, Mason Brown’s touchdown made it 47-35 midway through the fourth quarter, but that would be Stockton’s last score of the game. Stockton (2-5 overall, 2-2 Mid-Lakes) plays at Pleasant Hope next week. Jasper 13, McAuley Catholic 0 - FINAL Jasper’s offense scored its fewest points of the season, but its first shutout of 2015 helped the Eagles improve to 7-0 overall. Jasper, 7-0 in the SRVC, hosts Windsor next week. A league title game against Lockwood (6-0) looms in Week 9. Greenfield 92, Northwest (Hughesville) 34 - FINAL Jarrett Esposito had seven touchdowns as Greenfield had its highest point output of the season. The 8-man Wildcats (3-3 overall) play at McAuley Catholic next week. Osceola 7, Adrian 0 - FINAL Osceola made a late defensive stand on 4th and goal to preserve the win and improve to 5-2 overall. The Indians play at Cole Camp next week. ARKANSAS SCHOOLS Little Rock Christian 58, Harrison 21 - FINAL Gentry 38, Berryville 22 - FINAL Cedarville 42, Green Forest 34 - FINAL Greenland 35, Yellville-Summit 0 - FINAL North Little Rock 62, Mountain Home 60 - FINAL Thursday's Game", "external_links": [], "published": "2015-10-03T10:12:00.000+03:00", "crawled": "2015-10-03T11:38:19.470+03:00", "highlightTitle": ""}