{"organizations": [], "uuid": "940acb961949c24c81edd2ee0648ad0c70ae8270", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.timesunion.com", "main_image": "http://www.timesunion.com/img/pages/article/opengraph_default.jpg", "site_section": "http://www.timesunion.com/default/feed/default/feed/Sports-News-64.php", "section_title": "Sports News", "url": "http://www.timesunion.com/sports/article/Pitchers-duel-to-decide-NLCS-spot-6571547.php", "country": "US", "title": "Pitchers' duel to decide NLCS spot", "performance_score": 0, "site": "timesunion.com", "participants_count": 1, "title_full": "Pitchers' duel to decide NLCS spot - Times Union", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T06:49:00.000+03:00", "replies_count": 0, "uuid": "940acb961949c24c81edd2ee0648ad0c70ae8270"}, "author": "timesunion.com", "url": "http://www.timesunion.com/sports/article/Pitchers-duel-to-decide-NLCS-spot-6571547.php", "ord_in_thread": 0, "title": "Pitchers' duel to decide NLCS spot", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Los Angeles\nOne ace helped the Los Angeles Dodgers stave off elimination against the New York Mets .\nNow their other one gets a chance to extend the playoffs in a deciding Game 5.\nComing off Clayton Kershaw 's stellar outing that tied the NL Division Series 2-2, Zack Greinke takes the mound on Thursday night against Jacob deGrom of the Mets.\nDeGrom, the Game 1 winner over Kershaw, will pitch on full rest, just like Game 2 winner Greinke.\nThe Dodgers are trying to advance to the NL Championship Series for the first time in two years. The Mets are seeking their first playoff series win since 2006, which was their most recent postseason appearance.\nThe winner takes on the Chicago Cubs in the NLCS at home starting Saturday.\nFittingly, the Dodgers' season could either be prolonged or end on back-to-back appearances by Kershaw and Greinke, whose arms propelled them to a third consecutive NL West title and a franchise-record third straight playoff appearance.\n\"They've given us two guys that stop streaks, save your bullpen, are just day-in, day-out consistent guys,\" manager Don Mattingly said by phone Wednesday when both teams traveled back to Los Angeles. \"You can really count on what you're going to get from them 90-something percent of the time.\"\nWith Greinke and deGrom squaring off again, Kershaw says the series is \"dead-even.\"\n\"As good as Zack is and has been the whole year, deGrom has been the same, so there's really no home-field advantage when you're facing a guy like deGrom,\" he said. \"We saw that in Game 1. He's just very impressive, just very tough to square up. If you can get strikeouts on heaters like he can, it's really tough.\"\nGreinke has pitched at least six innings in all 33 of his starts with a 1.66 ERA that led the majors. As one of two right-handers on the Dodgers' postseason roster, he has allowed two or fewer runs 27 times.\nHe came up big in the only other elimination game of his career, winning Game 5 of the 2013 NLCS against St. Louis, which led the series 3-1. Greinke allowed two runs in seven innings to force a sixth game, which Kershaw started and lost 9-0 to end the season.\n\"He'll paint the corners. He'll keep the ball down,\" said Mets rookie left fielder Michael Conforto , who will start against Greinke. \"If he throws that fastball down at the knees we'll have to make him do that over and over again. But if he elevates, be aggressive with that and hit the ball hard somewhere and just try to keep him in the middle of the plate.\"\nGreinke is facing the Mets for the second time in five days, only now the Dodgers' season is on the line for the second straight game.\n\"It seems like in my experience usually you have one good game and one bad game,\" he said by phone Wednesday. \"But the better you pitch, the better your chances are. So my plan is just to pitch as good as possible and hopefully it works out.\"\nMattingly said catcher Yasmani Grandal is 50-50 to play Thursday because of his left shoulder that he tweaked in Game 3. He said the issue is whether Grandal can swing without pain; catching would not bother him. If Grandal can't go, A.J. Ellis would start. Greinke said he's pitched equally well with either one behind the plate.\nDeGrom struck out a postseason franchise-record 13 over seven scoreless innings in his victorious playoff debut against Kershaw last Friday at Dodger Stadium. Greinke allowed two runs — both solo homers — and struck out eight over seven innings in winning the following night.\n\"I felt good yesterday. I feel good today,\" deGrom said after arriving in Los Angeles. \"But an extra day never hurts you, especially with how many pitches (121) I threw before, so, yeah, I think that does help.\"\nMets manager Terry Collins said the entire bullpen — including starters Noah Syndergaard and Matt Harvey — would be available Thursday if deGrom gets in trouble early. Previously, Collins had said Harvey wouldn't be used in Game 5.\n\"I talked to him on the plane today and he said he'd be ready,\" the manager said.\nEllis calls it \"a huge mountain to climb\" against deGrom.\n\"We got an amazing pitcher, too, in Zack and we get to play at home in front of our great fans,\" he said. \"It's going to be a really, really big battle for us, because Jacob showed us Game 1, just how talented and special he is.\"\nDeGrom proved unflappable in front of a partisan Dodgers crowd in Game 1, displaying the same calm under pressure as he did pitching a scoreless inning at the All-Star Game in July.", "external_links": [], "published": "2015-10-15T06:49:00.000+03:00", "crawled": "2015-10-15T14:38:36.330+03:00", "highlightTitle": ""}