{"organizations": [], "uuid": "734b0e293e216d175a7c9192d8723a39e34c3215", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.timesunion.com", "main_image": "http://ww1.hdnux.com/photos/41/60/66/8850864/5/rawImage.jpg", "site_section": "http://www.timesunion.com/default/feed/default/feed/Sports-News-64.php", "section_title": "Sports News", "url": "http://www.timesunion.com/sports/article/Injury-darkens-Albany-victory-6589912.php", "country": "US", "title": "Injury darkens Albany victory", "performance_score": 0, "site": "timesunion.com", "participants_count": 1, "title_full": "Injury darkens Albany victory - Times Union", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T05:39:00.000+02:00", "replies_count": 0, "uuid": "734b0e293e216d175a7c9192d8723a39e34c3215"}, "author": "Pete Dougherty", "url": "http://www.timesunion.com/sports/article/Injury-darkens-Albany-victory-6589912.php", "ord_in_thread": 0, "title": "Injury darkens Albany victory", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: PAUL BUCKOWSKI Image 1 of / 9 9 Buy photo Graham Black, left, of the Albany Devils battles Colin Greening of the Binghamton Senators during their game at the Times Union Center on Sunday, Oct. 25, 2015, in Albany, N.Y. (Paul Buckowski / Times Union) Graham Black, left, of the Albany Devils battles Colin Greening of the Binghamton Senators during their game at the Times Union Center on Sunday, Oct. 25, 2015, in Albany, N.Y. (Paul Buckowski / Times Union) Photo: PAUL BUCKOWSKI Buy this photo Image 2 of 9 Buy photo Graham Black of the Albany Devils tries to keep control of the puck during their game against the Binghamton Senators at the Times Union Center on Sunday, Oct. 25, 2015, in Albany, N.Y. (Paul Buckowski / Times Union) Graham Black of the Albany Devils tries to keep control of the puck during their game against the Binghamton Senators at the Times Union Center on Sunday, Oct. 25, 2015, in Albany, N.Y. (Paul Buckowski / Times ... more Buy this photo Image 3 of 9 Buy photo Marc-Andre Gragnani of the Albany Devils brings the puck up the ice during their game against the Binghamton Senators at the Times Union Center on Sunday, Oct. 25, 2015, in Albany, N.Y. (Paul Buckowski / Times Union) Marc-Andre Gragnani of the Albany Devils brings the puck up the ice during their game against the Binghamton Senators at the Times Union Center on Sunday, Oct. 25, 2015, in Albany, N.Y. (Paul Buckowski / Times ... more Buy this photo Image 4 of 9 Buy photo Jim O'Brien of the Albany Devils sends Colin Greening of the Binghamton Senators down onto the ice during their game at the Times Union Center on Sunday, Oct. 25, 2015, in Albany, N.Y. (Paul Buckowski / Times Union) Jim O'Brien of the Albany Devils sends Colin Greening of the Binghamton Senators down onto the ice during their game at the Times Union Center on Sunday, Oct. 25, 2015, in Albany, N.Y. (Paul Buckowski / Times ... more Buy this photo Image 5 of 9 Buy photo Paul Thompson of the Albany Devils collides with Bignhamton player during their game at the Times Union Center on Sunday, Oct. 25, 2015, in Albany, N.Y. (Paul Buckowski / Times Union) Paul Thompson of the Albany Devils collides with Bignhamton player during their game at the Times Union Center on Sunday, Oct. 25, 2015, in Albany, N.Y. (Paul Buckowski / Times Union) Photo: PAUL BUCKOWSKI Buy this photo Image 6 of 9 Buy photo Matt Lorito of the Albany Devils races towards the goal with the puck during their game against the Binghamton Senators at the Times Union Center on Sunday, Oct. 25, 2015, in Albany, N.Y. (Paul Buckowski / Times Union) Matt Lorito of the Albany Devils races towards the goal with the puck during their game against the Binghamton Senators at the Times Union Center on Sunday, Oct. 25, 2015, in Albany, N.Y. (Paul Buckowski / ... more Buy this photo Image 7 of 9 Buy photo Corbin McPherson, left, of the Albany Devils tries to keep control of the puck as Ryan Dzingel of the Binghamton Senators tries to knock it away during their game at the Times Union Center on Sunday, Oct. 25, 2015, in Albany, N.Y. (Paul Buckowski / Times Union) Corbin McPherson, left, of the Albany Devils tries to keep control of the puck as Ryan Dzingel of the Binghamton Senators tries to knock it away during their game at the Times Union Center on Sunday, Oct. 25, ... more Buy this photo Image 8 of 9 Buy photo Matt Lorito, center, of the Albany Devils watches his attempted shot go wide of the net during their game against the Binghamton Senators at the Times Union Center on Sunday, Oct. 25, 2015, in Albany, N.Y. (Paul Buckowski / Times Union) Matt Lorito, center, of the Albany Devils watches his attempted shot go wide of the net during their game against the Binghamton Senators at the Times Union Center on Sunday, Oct. 25, 2015, in Albany, N.Y. ... more Buy this photo Image 9 of 9 Injury darkens Albany victory 1 / 9 Back to Gallery Albany\nIn a near-empty Times Union Center , the noise was negligible to begin with Sunday afternoon, but it became eerily quiet early in the second period of an American Hockey League game.\nPaul Thompson of the Albany Devils was skating toward the corner when Zack Stortini of the Binghamton Senators blindsided him into the boards. There didn't seem to be intent on Stortini's part, but he was issued major and match penalties for the hit.\nThompson was helped off the ice and did not return, and the Devils, trailing 1-0 at the time, used the five-minute power play to ignite a 4-1 victory.\nMore Information\nDEVILS 4, SENATORS 1\nBinghamton 1 0 0 — 0\nAlbany 0 2 2 — 0\nFirst period — 1, Binghamton, Puempel 3 (Paul), 18:25 (pp). Penalties —Blandisi, Alb (holding), :25; Tropp, Alb (high-sticking), 1:21; Puempel, Bng, double minor (roughing), 8:50; Albany bench (too many men; served by Thompson), 11:38; Letourneau-Leblond, Alb (high-sticking), 16:28.\nSecond period — 2, Albany, Lorito 1 (Sislo, Pietila), 6:33 (pp). 3, Albany, Tropp 2 (Boucher, Burlon), 14:38 (pp). Penalties —Stortini, Bng, major-game misconduct (boarding), 5:01; Boucher, Alb (slashing), 6:46; Dziurzynski, Bng (high-stickkng), 9:28; Greening, Bng (slashing), 13:11;\nThird period — 4, Albany, Blandisi 2 (Lorito, Gragnani), 6:34 (pp). 5, Albany, Boucher 2 (Gragnani, O'Brien), 12:42. Penalties —Greening, Bng (delay of game), 6:10; O'Dell, Bng, minor-major-misconduct (instigating, fighting), 10:41; Burlon, Alb, major (fighting), 10:41; Letourneau-Leblond, Alb (high-sticking), 18;54.\nShots on goal — Binghamton 11-6-7—24. Albany 16-11-11—38.\nPower-play opportunities — Binghamton 1 of 6; Albany 4 of 10.\nGoalies — Binghamton, O'Connor 0-3-0 (38 shots-34 saves). Albany, Danis 3-1-1 (24-23). T—2:28. A—2,025.\nThe fans — announced attendance was 2,025, but there were about 800 actually on hand — sat in stunned silence as Thompson, the AHL's second-leading goal scorer last season, stayed on the ice for a few minutes.\n\"You can tell how quiet it was in the building,\" said Devils coach Rick Kowalsky , noting that Thompson will see a doctor Monday. \"You're just scared. You never know. It was good to see him moving and the fact he got off the ice. It was a dangerous, dangerous situation. You never want to see that happen.\"\nStortini already had been sent to the locker room before Thompson, with assistance from the trainer, skated off.\n\"We saw it on video. ... It shows Thompson tripping right before he got there,\" Binghamton coach Luke Richardson said. \"It's unfortunate. Obviously they're very cautious in those areas. They gave him a five-minute penalty. We're not going to argue it. We tried to work our best to kill it off, and hopefully nothing more will be coming of it.\"\nThe Senators failed to kill off the major penalty as Matt Lorito scored the game-tying goal. It was the first of four power-play tallies for the Devils, who were granted 10 opportunities.\nIt was the third game in a 47-hour window for Albany, which appeared to get a second wind after the Thompson injury.\n\"It was a sleepy game up until that point,\" Lorito said. \"There wasn't a whole lot going on. We were down 1-0, we weren't playing how we wanted to play. When that happened, any time anyone goes down like that, it's a pretty dangerous play. It woke our bench up, and we played better after that. Once we got that first goal, we kept it going and ended up finishing up strong.\"\nCorey Tropp got the go-ahead score at 14:38 of the second, banging home a rebound from a scrum in front of the net.\nJoseph Blandisi and Reid Boucher added man-advantage goals in the third as Devils rose from 17th (.148) to 11th (.216) in AHL power-play percentage.\n\"Even the games we weren't scoring that many, we had some good looks,\" Tropp said. \"It was just a matter of a lot of new guys being together for the first time. Sometimes at the start of the season, it takes a little longer than you would hope, but tonight's is a good step forward in the right direction.\"\nThe Devils have six rookie forwards on the roster in addition to newcomers Tropp and Jim O'Brien as key components on the power play.\nThe biggest difference may be defenseman Marc-Andre Gragnani , who has played 74 NHL and 331 AHL career games, who assisted in two of the goals and now is Albany's early-season scoring leader with five points.\n\"We've talked about wanting to shoot the puck and create opportunities,\" Kowalsky said. \"Gragnani's a big part of that. He's deceptive up there. He doesn't telegraph passes. Him and Sis (right wing Mike Sislo , who also plays the point on the power play) have developed some chemistry. We found two units that can make plays.\"\npdougherty@timesunion.com • 518-454-5416 • @Pete_Dougherty", "external_links": ["http://ww3.hdnux.com/photos/41/60/66/8850866/5/920x920.jpg", "http://ww2.hdnux.com/photos/41/60/66/8850869/5/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/41/60/66/8850871/5/square_gallery_thumb.jpg", "http://timesunion.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20Times%20Union&image=http://ww1.hdnux.com/photos/41/60/66/8850864/5/628x471.jpg", "http://ww3.hdnux.com/photos/41/60/66/8850866/5/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/60/66/8850870/5/920x920.jpg", "http://ww2.hdnux.com/photos/41/60/66/8850865/5/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/41/60/66/8850864/5/920x920.jpg", "http://ww4.hdnux.com/photos/41/60/66/8850871/5/920x920.jpg", "http://timesunion.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20Times%20Union&image=http://ww2.hdnux.com/photos/41/60/66/8850869/5/628x471.jpg", "http://ww2.hdnux.com/photos/41/60/66/8850865/5/920x920.jpg", "http://timesunion.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20Times%20Union&image=http://ww4.hdnux.com/photos/41/60/66/8850871/5/628x471.jpg", "http://timesunion.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20Times%20Union&image=http://ww1.hdnux.com/photos/41/60/66/8850868/5/628x471.jpg", "http://ww4.hdnux.com/photos/41/60/66/8850867/5/920x920.jpg", "http://ww3.hdnux.com/photos/41/60/66/8850870/5/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/41/60/66/8850868/5/920x920.jpg", "http://timesunion.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20Times%20Union&image=http://ww2.hdnux.com/photos/41/60/66/8850865/5/628x471.jpg", "http://timesunion.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20Times%20Union&image=http://ww3.hdnux.com/photos/41/60/66/8850870/5/628x471.jpg", "http://ww1.hdnux.com/photos/41/60/66/8850868/5/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/41/60/66/8850864/5/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/60/66/8850869/5/920x920.jpg", "http://timesunion.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20Times%20Union&image=http://ww4.hdnux.com/photos/41/60/66/8850867/5/628x471.jpg", "http://ww4.hdnux.com/photos/41/60/66/8850867/5/square_gallery_thumb.jpg", "http://timesunion.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20Times%20Union&image=http://ww3.hdnux.com/photos/41/60/66/8850866/5/628x471.jpg"], "published": "2015-10-26T05:39:00.000+02:00", "crawled": "2015-10-26T07:35:34.059+02:00", "highlightTitle": ""}