{"organizations": [], "uuid": "dade1966086de2dadfb4ef1278578bd21c8788c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.detroitnews.com", "main_image": "", "site_section": "https://feeds.feedblitz.com/detroit/sports", "section_title": "Detroit News - Sports", "url": "http://www.detroitnews.com/story/sports/high-school/2015/10/17/state-tennis-roundup-doubles-powers-cranbrooks-title/74140564/", "country": "US", "title": "State tennis roundup: Doubles powers Cranbrook’s title", "performance_score": 0, "site": "detroitnews.com", "participants_count": 1, "title_full": "State tennis roundup: Doubles powers Cranbrook’s title", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T20:56:00.000+03:00", "replies_count": 0, "uuid": "dade1966086de2dadfb4ef1278578bd21c8788c4"}, "author": "detroitnews.com", "url": "http://www.detroitnews.com/story/sports/high-school/2015/10/17/state-tennis-roundup-doubles-powers-cranbrooks-title/74140564/", "ord_in_thread": 0, "title": "State tennis roundup: Doubles powers Cranbrook’s title", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "1 CONNECT 3 TWEET LINKEDIN COMMENT EMAIL MORE Finishing undefeated in doubles is a fairly uncommon occurrence. Bloomfield Hills Cranbrook-Kingswood’s Nos. 1 and 2 doubles teams both won their flights in the Division 3 state finals Saturday in Holland.\nAs a team, Cranbrook finished first with 38 points.\n“I thought it was a great day for our program,” Cranbrook coach Jeff Etterbeek said. “To have the opportunity to win this one was great.”\nCranbrook’s No. 1 doubles team of Nolan Trepeck and Matthew Gerard defeated Detroit Country Day’s Damian Runkle and Adam Junn, 3-6, 6-1, 6-4 to cap a 22-0 season.\n“It was a surreal moment,” Trepeck said of the state title. “Reaching the finals the last two years and coming up short was painful and our whole team entered the season with a chip on our shoulder. To go undefeated, especially considering the strength of schedule we played,is an incredible feeling.”\nHe said matching up against area rival Country Day, which Cranbrook did three times this season, adds another component.\n“Playing Country Day is always a battle,” Trepeck said. “Our team has a lot of respect for Country Day. Our two schools’ rivalry runs deep and we love to compete against DCD. It's different in the sense that we typically play them three times per year. By the time States comes, we know their games inside and out and they know ours as well.”\nEtterbeek said the play of all three doubles teams, which combined to lose only one match, provided vital leadership during the state title run.\n“I think the key to our success this year was those three doubles teams,” he said.\nCranbrook’s Marc Sable, the team’s No. 1 singles player, lost in the finals to Holland Christian’s JP Avila in straight sets, 6-1, 6-4.\nTrepeck said Sable, a fellow senior who is his best friend, made an impact on his team.\n“It’s been an incredible ride with him these past four years,” Trepeck said. “He leads by example day in and day out. He's the hardest worker I know and is someone I look to as a role model when it comes to tennis. Ever since we were freshmen we talked about this day and it's an incredible feeling to hoist the trophy with him and bring a state championship back to Cranbrook.”\nCountry Day, the only other area team in the top five, finished second overall with 30 points.\nDivision 1 \nBloomfield Hills and Novi tied for first in overall team scores with 26 points. Ann Arbor Pioneer (third, 22), Ann Arbor Huron and Troy (tied for fourth, 21), Northville (sixth, 18), Birmingham Brother Rice (seventh, 17), Grosse Pointe South (eighth, 10), Clarkston and Port Huron Northern (T-ninth, eight) all finished in the top 10.\nNorthville’s Connor Johnston won the No. 1 singles flight, 6-1, 6-1 over Josh Mukherjee (Bloomfield Hills).\nBrother Rice’s Sean Abelarde and Jarreau Campbell won the No. 1 doubles title, 6-3, 6-4 over Troy’s Sai Kagithala and Kevin Feitsam.\nDivision 2 \nThree area teams tied for fourth in Division 2. Birmingham Groves, Birmingham Seaholm and Detroit U-D Jesuit joined Grand Rapids Forest Hills Northern with 17 points. Grand Rapids Forest Hills Central tied Portage Central for first place with 30.\nU-D Jesuit’s Louis Wyre and Joey Wilson lost in the No. 1 doubles finals, 6-4, 4-6, 7-5.\nDivision 4 \nAnn Arbor Greenhills won the overall team title with 36 points. Grosse Pointe Woods University Liggett finished second with 28.\nOtsego’s Luke Ford defeated Williamston’s Oliver Weaver, 6-7, 6-4, 6-3 to win the No. 1 singles title.\nGreenhills’ Sam Talsma won the second singles flight, 6-4, 6-3 over Liggett’s Christian Illitch.\nBrandon Johnson and Jack Harris (Greenhills) won the doubles title, 6-4, 6-3 over Matt Kintz and Jarrett Berends of Grand Rapids NorthPointe Christian.\nAl Willman is a freelance writer", "external_links": [], "published": "2015-10-17T20:56:00.000+03:00", "crawled": "2015-10-18T20:41:04.963+03:00", "highlightTitle": ""}