{"organizations": [], "uuid": "07bc3feae3b2a20eb5789de0fe39027b3faf0c2a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.idsnews.com", "main_image": "http://media.ids.s3.amazonaws.com/59609_spiuwswebf.jpg", "site_section": "http://www.idsnews.com/section/sports", "section_title": "Sports | Indiana Daily Student", "url": "http://www.idsnews.com/article/2015/10/iu-looks-for-first-win-in-7-games", "country": "US", "title": "IU looks for first win in 7 games", "performance_score": 0, "site": "idsnews.com", "participants_count": 1, "title_full": "IU looks for first win in 7 games | Indiana Daily Student", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T07:45:00.000+03:00", "replies_count": 0, "uuid": "07bc3feae3b2a20eb5789de0fe39027b3faf0c2a"}, "author": "Danny White", "url": "http://www.idsnews.com/article/2015/10/iu-looks-for-first-win-in-7-games", "ord_in_thread": 0, "title": "IU looks for first win in 7 games", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The IU women’s soccer team is at the crossroads of its season.\n“This is the point in the season where teams either go one way or the other,” IU Coach Amy Berbary said. “I’m not worried at all — this is where we can make it or break it, and everybody’s on the bus right now.”\nAfter two Big Ten losses during the weekend at Wisconsin and No. 18 Minnesota, IU is still searching for its first conference win of the season. IU has a chance this weekend and looks to previous performances for optimism going into this weekend’s match-up against Iowa.\n“We’re teetering on the edge here,” Berbary said. “We tied two of the best teams in the country a couple weeks ago.”\nIU plays Iowa at 8 p.m. Saturday at Bill Armstrong Stadium. IU (3-5-4) has not won a game since Sept. 4, a 2-0 win against Middle Tennessee State in Baton Rouge, Louisiana. Despite the lack of recent wins, IU women’s soccer is ranked 49th in the RPI, and Berbary said she is satisfied with where it stands.\n“With everything that has happened to us, for us to be 49th out of 342 is unbelievable,” Berbary said. “I think we’re in a pretty good spot.”\nIowa (6-5) is on a four-game losing streak and looking to turn things around in Bloomington. The Hawkeyes are 0-4 in Big Ten play.\n“They’re a lot like us,” Berbary said. “They’re searching for their first win too, so it’s going to be an absolute battle Saturday.”\nDespite Iowa’s record, the current team’s staff has never defeated the Hawkeyes. Berbary has that first win front and center as a goal for her players Saturday.\n“I don’t think anyone on this team has beaten Iowa,” Berbary said. “Maybe (Sarah) Stone because she’s the oldest one. But I know our staff hasn’t and neither have any of the kids.”\nUnlike their previous games, the Hoosiers will have the advantage of playing at home.\nIU has not won at home this season but has an opportunity against an Iowa squad that is 0-3 away from home.\n“I think playing at home is always comfortable,” Berbary said. “It gives our team a sense of calmness to be at home and we have a sense of pride when we run out there.”\nThe injured IU players have also contributed to the team despite its inability to take the field by encouraging teammates and trying to improve by watching.\n“When you have to sit there and actually watch the game, mentally, physically, you come out better,” Berbary said. “Because you know what you had to go through to get back on that field.”\nWith injuries to key players, the Hoosiers need leadership.\nIt doesn’t fall on one player, though.\n“I think it’s everybody,” Berbary said. “We keep saying that word ‘united’ and we still are, and our season isn’t even close to being over.”", "external_links": [], "published": "2015-10-02T07:45:00.000+03:00", "crawled": "2015-10-03T08:29:28.694+03:00", "highlightTitle": ""}