{"organizations": [], "uuid": "fbfe619321ba46c29b8bfae74e0baefa235adeac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "http://si.wsj.net/public/resources/images/OD-BI003_SFF_G_20151012104655.jpg", "site_section": "http://www.wsj.com/news/life", "section_title": "Lifestyle, Real Estate &amp; Sports News - Wall Street Journal", "url": "http://www.wsj.com/articles/gabriela-camaras-recipe-for-shrimp-a-la-veracruzana-1444662850", "country": "", "title": "Gabriela Cámara’s Recipe for Shrimp a la Veracruzana", "performance_score": 0, "site": "wsj.com", "participants_count": 2, "title_full": "Gabriela Cámara’s Recipe for Shrimp a la Veracruzana - WSJ", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T19:14:00.000+03:00", "replies_count": 1, "uuid": "f61b626e8e71bd56df68acf30f226b46c7517589"}, "author": "Kitty Greenwald", "url": "http://www.wsj.com/articles/gabriela-camaras-recipe-for-shrimp-a-la-veracruzana-1444662850#post-0", "ord_in_thread": 0, "title": "Gabriela Cámara’s Recipe for Shrimp a la Veracruzana", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "1 COMMENTS ENLARGE SEE THE LIGHT | This fresh, simple dish is a far cry from the heavily sauced fare many diners in the U.S. have come to expect from ‘Mexican’ restaurants. Photo: James Ransom for The Wall Street Journal, Food Styling by Ryan Reineck, Prop Styling by Stephanie Hanes The Chef: Gabriela Cámara\nENLARGE Gabriela Cámara Illustration: Michael Hoeweler Her restaurants: Contramar, in Mexico City, and Cala and the forthcoming Tacos Cala, in San Francisco\nWhat she is known for: Introducing flavors from Mexico’s coast to the country’s interior and beyond. Serving rustic, soulful seafood dishes to stylish city dwellers.\nSEVENTEEN YEARS AFTER opening Mexico City’s Contramar, where the simply cooked seafood draws a sophisticated crowd, Gabriela Cámara just opened Cala, her second seafood restaurant, in downtown San Francisco . “How do you cook Mexican food for people who think they already know it?” she said. “In San Francisco we aren’t serving what people think they know. Our focus is on seafood and vegetables, and the cooking is more refined and delicate.”\nMs. Cámara’s first Slow Food Fast contribution, a warming shrimp “a la Veracruzana”—that is, in the style of Veracruz, on Mexico’s east coast—exemplifies the pure flavors and keen sense of balance the chef is known for. Capers, green olives, oregano and jalapeños punch up the tomato sauce. But, there is only enough of each ingredient to complement the shrimp without overwhelming them.\nServed throughout Mexico, this dish nods to the Mediterranean side of the Mexican kitchen. “Most likely a Spanish person brought this recipe to Veracruz, where there is a lot of fish,” Ms. Cámara offered. Variations abound. “Some people use bell pepper, but I don’t think you need it,” she said. “I do like cooking the shrimp with the skins on, or pounding some of the skins into a paste and stirring it in. The skins add incredible flavor.” In the end, flavor always trumps orthodoxy: “Above all else, it has to taste great.”", "external_links": ["http://si.wsj.net/public/resources/images/BN-KS332_SFFILL_750V_20151012110002.jpg", "http://si.wsj.net/public/resources/images/BN-KS332_SFFILL_1000V_20151012110002.jpg", "http://si.wsj.net/public/resources/images/OD-BI003_SFF_FR_20151012104655.jpg"], "published": "2015-10-12T19:14:00.000+03:00", "crawled": "2015-10-12T19:11:35.956+03:00", "highlightTitle": ""}