{"organizations": [], "uuid": "c7ad3df6da007acc4825bbedd1aba86665adcec2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chron.com", "main_image": "http://ww2.hdnux.com/photos/41/53/70/8830485/3/rawImage.jpg", "site_section": "http://www.chron.com/sports/headlines/collectionRss/Sports-Headlines-Staff-Stories-10767.php", "section_title": "Sports Headlines Staff Stories", "url": "http://www.chron.com/sports/outdoors/article/6-charged-in-wholesale-slaughter-of-animals-in-6583162.php", "country": "US", "title": "6 charged in 'wholesale slaughter' of animals in Leon County", "performance_score": 0, "site": "chron.com", "participants_count": 1, "title_full": "6 charged in 'wholesale slaughter' of animals in Leon County", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T05:56:00.000+03:00", "replies_count": 0, "uuid": "c7ad3df6da007acc4825bbedd1aba86665adcec2"}, "author": "Shannon Tompkins", "url": "http://www.chron.com/sports/outdoors/article/6-charged-in-wholesale-slaughter-of-animals-in-6583162.php", "ord_in_thread": 0, "title": "6 charged in 'wholesale slaughter' of animals in Leon County", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Close Image 1 of 1 A total of nine firearms, including a .22 rifle fit with a homemade sound suppressor, were seized in Leon County from a group of six Centerville residents facing 120 felony charges and 58 Class A misdemeanor charges. The suspects are allegedly responsible for the killing of at least 68 white-tailed deer, among other wildlife. A total of nine firearms, including a .22 rifle fit with a homemade sound suppressor, were seized in Leon County from a group of six Centerville residents facing 120 felony charges and 58 Class A misdemeanor ... more 6 charged in 'wholesale slaughter' of animals in Leon County 1 / 1 Back to Gallery \nA pair of seemingly unconnected investigations by law enforcement officers in Leon County - one by Texas game wardens looking into a landowner's report of a suspected poaching incident, the other by county sheriff's deputies investigating incidents of vandalism and other property crimes - resulted this week in arrests tied to what state wildlife law enforcement officials say ranks as the most egregious, disturbingly vicious poaching-related case any can recall. \nSix Centerville residents, four charged as adults and two juveniles, face a flood of criminal charges, including a total of 120 felonies and 58 Class A misdemeanors, for violations of state wildlife laws tied to what Col. Craig Hunter , director of Texas Parks and Wildlife Department 's law enforcement division, called \"wholesale slaughter of game animals, non-game wildlife and domestic animals.\" \nAccording to officers, the group illegally killed at least 68 white-tailed deer, an assortment of other wildlife including alligator, blue heron, vulture and egret, six head of cattle (one of which was hacked to death with a machete) and several domestic cats during a three-month frenzy of criminal acts that included more than a dozen burglaries and several acts of vandalism and other damage to private and public property. \nThe suspects also face criminal charges in those non-wildlife-related cases; the Leon County Sheriff's Office has filed charges on three of the suspects and is preparing to file charges on the other three. The six, facing felony charges that carry prison terms of as much as two years, also could face federal wildlife-related criminal charges and, if convicted of state charges, well over $10,0000 in civil restitution for illegally taken wildlife. \n'Beyond poaching' \nGame wardens seized nine firearms, including a .22 rifle fit with a homemade sound suppressor, from the group. \nAll of the charges involve violations alleged to have occurred in Leon County, a rural county located about midway between Houston and Dallas and bisected by Interstate 45. \nThose charged as adults are Daniel Wyatt Pate , 20, and John Edward Persaud , 19, along with two 17-year-olds. \nTwo juveniles also face charges in the cases. \n\"I don't know how to compare this to anything I've seen before,\" Capt. Mike Hanson , Rusk-based supervisor for TPWD's law enforcement division and 23-year veteran Texas game warden, said of the case. \"The scope is just way beyond poaching deer.\" \nState game wardens began investigating the case after a Sept. 1 call from a landowner who had found a whitetail doe, dead from a gunshot, in his pasture the morning after his wife told him she had heard a shot during the night, Hanson said. At the same time, the Leon County Sheriff's Office was investigating a series of property crimes in the rural county. Those investigations began turning up information that tied suspects to both cases. TPWD wardens Oscar Hensen and Randy Harper and Sgt. Brian Stafford of the Leon County Sheriff's Office worked together and broke the case. \nAccording to investigators, between June 4 and Sept 1, the six were involved in serial illegal activity that regularly included poaching whitetail deer at night. \n'Some kind of record' \nThe investigation documented 68 illegally taken deer, most of them shot from motor vehicles at night from public roadways. In some instances, officers allege, the poaching occurred on the feeder roads of Interstate 45; officers said at least 15 deer were poached from land adjacent to the heavily traveled highway. In several instances, the suspects returned multiple times to the same areas, killing deer and committing other crimes, officers said. They killed as many as five deer in a single night of poaching, sometimes removing back straps and hindquarters from the deer but often simply leaving the animals to rot where they fell, Hanson said. \nThe total tally of deerillegally killed by the group almost certainly is much higher than the 68 whitetails they are charged with poaching, officers said. That total could easily exceed 100 when deer that were wounded and died later or were poached and not found or otherwise documented are included. \n\"We've really got no way to measure how many deer, total, were involved,\" Hanson said. \nBut even at 68 deer, the total far exceeds the largest number of deer involved in a single poaching case any TPWD law enforcement officers can recall. \n\"There have been cases where we've had people take a dozen or so deer over a period of time; I think 17 or 20 is the most I've ever heard of,\" Hanson said. \"This case has got to be some kind of record.\" \n'Pretty vicious crimes' \nOfficials underscored that the poaching of deer and illegal killing of other wildlife was just a part of the three-month crime spree that included shooting out the window of a business, shooting road signs, destroying mailboxes, shooting a parked truck as well as the burglaries (most of hunter's deer camps), the killing of livestock and the shooting of house cats and other animals. \nThe extent and range of crimes alleged against those charged shocked even veteran game wardens. \n\"I don't think I've ever see a case like this in the 41 years I've been in law enforcement,\" Hunter, TPWD game warden chief, said. \"There are some pretty vicious crimes in there.\" \nThe charges filed against the group reflect the extent of those alleged crimes. The 120 felony charges filed against the group are for killing a white-tailed deer on private property without the consent of the landowner; each violation is a state jail felony punishable by as much as two years in prison and a fine of $10,000. The 58 Class A misdemeanor charges are for hunting from a public roadway and carry a penalty of as much as a year in jail and a $4,000 fine. \nGame wardens said they were surprised that the poaching ring could operate for three months, firing what they suspect was hundreds of rounds of gunfire, usually at night, sometimes within view of travelers on Interstate 45 and leaving dead deer and other wildlife - evidence of crimes - scattered around the county without anyone reporting suspicious activity to law enforcement. \n\"It's baffling, particularly when you know how protective most landowners and hunters are of deer and other wildlife,\" Hanson said of how the group seemed to operate without fear of being reported or caught. \nDuring their investigation, officers learned many landowners and others had heard gunshots during the night but never reported the incidents to wardens or other law enforcement.", "external_links": [], "published": "2015-10-22T05:56:00.000+03:00", "crawled": "2015-10-22T12:34:24.135+03:00", "highlightTitle": ""}