{"organizations": [], "uuid": "a3485211161ca37e57382105b187a9ff4382555a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wgem.com", "main_image": "http://WGEM.images.worldnow.com/images/9063523_G.jpg", "site_section": "http://www.wgem.com/category/123718/sports?&clienttype=rss", "section_title": "WGEM - SPORTS", "url": "http://www.wgem.com/story/30312215/2015/10/21/turning-back-the-clock-1985-qhs-vs-qnd-football-part-i", "country": "US", "title": "Turning Back the Clock: 1985 QHS vs. QND football (Part I)", "performance_score": 0, "site": "wgem.com", "participants_count": 1, "title_full": "Turning Back the Clock: 1985 QHS vs. QND football (Part I)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T07:45:00.000+03:00", "replies_count": 0, "uuid": "a3485211161ca37e57382105b187a9ff4382555a"}, "author": "Ben Marth", "url": "http://www.wgem.com/story/30312215/2015/10/21/turning-back-the-clock-1985-qhs-vs-qnd-football-part-i", "ord_in_thread": 0, "title": "Turning Back the Clock: 1985 QHS vs. QND football (Part I)", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Turning Back the Clock: 1985 QHS vs. QND football (Part I) - WGEM.com: Quincy News, Weather, Sports, and Radio Member Center: Turning Back the Clock: 1985 QHS vs. QND football (Part I) Posted: Photo Courtesy: Quincy Herald-Whig \nQUINCY, Ill. (WGEM) -- It's been 30 years since gridlock on the Gem City gridiron.But the memories haven't drifted away for a few of the QND alums who played in the 1985 affair.\"We were out on the field and (QHS) came out 10 (players) at a time. I can still remember seeing this from their locker room,\" Joe Obert, a former Raider wide receiver and defensive end, and current QND assistant coach, said.\"I said 'Ok there's the first 10, there's the second 10.' And they just kept coming. I realized wow. We had 35 (players) and I think they had about 90 dressed.\"The Raiders found themselves on the wrong end of a 34-0 loss to rival Quincy High in the season opener. It was a campaign that eventually ended without a win.\"We couldn't get any traction against them,\" former QND quarterback Jim Bergman said in regards to the Blue Devils.\"Their defense was amazing (and) their offense was amazing. We were definitely out-matched that night.\"Three decades later and the rivalry will be renewed on Friday night.A game the former QND players say has been a long time coming.\"People say it's just another game. Well, it's not,\" Jeff Meyer, who played guard and linebacker for the 1985 QND team, indicated.\"It's more than just another game. It's your crosstown rival. I'm glad to see they're bringing (the game) back.\"The message is clear...enjoy the moment because beyond 2016 there's no certainty the two programs will play again.It's something the 1985 rosters know all too well.\"It's been fun and that's the best thing about this rivalry,\" Bergman noted. \"You see these folks over the years and this week all (the memories) come back. You get to reminisce about it. I just hope they keep it on the schedule for many years to come.\"According to Obert, \"Over the years I've made a lot of friends with the guys who played at Quincy High and I've had to listen for a long time about how they beat us.\"\"As a coach now I hope that our kids step up and understand what QND needs to do. 30 years of waiting to beat the Devils is hopefully upon us.\"NOTE -- Coming up Thursday on WGEM News at 10, a look back at the 1985 contest from the Quincy High School angle - a victory which snapped the Blue Devils 27-game losing streak. Can't Find Something? 513 Hampshire Quincy, IL 62301 Switchboard: (217) 228-6600", "external_links": [], "published": "2015-10-21T07:45:00.000+03:00", "crawled": "2015-10-21T11:31:38.784+03:00", "highlightTitle": ""}