{"organizations": [], "uuid": "0d37a78b09b08075c55f34fac5f15846f48a4eb0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "nypost.com", "main_image": "https://thenypost.files.wordpress.com/2015/10/cain-alcs.jpg", "site_section": "http://nypost.com/sports/feed/", "section_title": "| Sports | New York Post", "url": "http://nypost.com/2015/10/24/royals-dramatically-set-up-world-series-date-with-mets/", "country": "", "title": "Royals dramatically set up World Series date with Mets", "performance_score": 0, "site": "nypost.com", "participants_count": 1, "title_full": "Royals dramatically set up World Series date with Mets | New York Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T03:37:00.000+03:00", "replies_count": 0, "uuid": "0d37a78b09b08075c55f34fac5f15846f48a4eb0"}, "author": "George A. King III", "url": "http://nypost.com/2015/10/24/royals-dramatically-set-up-world-series-date-with-mets/", "ord_in_thread": 0, "title": "Royals dramatically set up World Series date with Mets", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "KANSAS CITY, Mo. — Bring on the Mets.\nThe Royals, after a pulsating 4-3 victory over the Blue Jays on Friday night in Game 6 of the ALCS at Kauffman Stadium in front of 40,494 delirious customers, will play host the National League champions in Game 1 of the World Series Tuesday night.\nIt’s the second straight season the Royals will play in the World Series. Last year they lost in seven games to the Giants.\nThough it’s hard to believe any Mets pitcher will match what Madison Bumgarner did to them a year ago, the Royals will have to deal with the stellar starting foursome of Matt Harvey, Jacob deGrom, Noah Syndergaard and Stephen Matz, not to mention NLCS MVP Daniel Murphy.\nThe first two games will be at Kauffman Stadium with Games, 3, 4 and 5 at Citi Field.\nIt’s the Mets’ first World Series gig since they lost to the Yankees in five games in 2000.\n“It’s going to be tough. With deGrom, Syndergaard and Harvey they have great pitching,’’ Royals left fielder Alex Gordon said. “It will be a tough test for us. Hopefully we come through.’’\nMike Moustakas, who homered in the second inning off David Price for a 2-0 lead, praised the Mets.\n“They are a great team,” Moustakas said. “They made the World Series. They are a phenomenal team.\n“We have to find a way to beat them.’’\nAlcides Escobar, the ALCS MVP, won’t overlook the Mets’ pitching.\n“They are a really good team with really good pitching,’’ the Royals shortstop said.\nFormer Yankees pitching coach and current Royals pitching coach Dave Eiland praised the Mets’ arms, but stood up for his hurlers.\n“They have a great staff but we like our guys, too,’’ Eiland said.\nRoberto Osuna, the Blue Jays’ 20-year-old closer, started the home eighth inning following a 45-minute rain delay.\nOsuna walked Lorenzo Cain to start the inning and watched right fielder Jose Bautista field Eric Hosmer’s single near the line — then throw to second base instead of toward home. That allowed Cain to score from first and put the Royals ahead, 4-3.\n“It worked because Lorenzo Cain ran hard,’’ Royals manager Ned Yost said.\nWade Davis, who came back following the 45-minute rain delay at the start of the home eighth, gave up a leadoff single to Russell Martin. Dalton Pompey, who pinch ran for Martin, stole second and third before Davis walked Kevin Pillar, who then stole second. With runners on second and third, Davis struck out pinch-hitter Dioner Navarro and Ben Revere before ending the game by getting Josh Donaldson to ground out to Moustakas.\n“Throw the ball to first base and go celebrate,’’ Moustakas said of what he was thinking after fielding Donaldson’s grounder.\nBautista’s second homer of the game tied the score, 3-3, in the eighth inning off Ryan Madson.\n“Our club doesn’t mind being tied late,’’ Yost said. “They know the bullpen we have will hold the fort.’’\nMadson took over for Kelvin Herrera to start the eighth with the Royals leading, 3-1, and six outs away from the World Series.\nHerrera had replaced starter Yordano Ventura with one out, a runner on second and the Royals leading, 2-1, in the sixth inning.\nHerrera fell behind Colabello, 3-1, got the count full and blew away Colabello with a 100-mph fastball and stranded Edwin Encarnacion when his routine fly ball to center landed in Cain’s glove.\nVentura went 5 ¹/₃ innings, allowed a run, four hits and whiffed five. Herrera provided 1 ²/₃ innings of shutout relief.\nBlue Jays left fielder Ben Revere turned in the play of the ALCS when he crashed into the wall to rob Salvador Perez of an extra base hit with Moustakas on first and no outs in the seventh inning.\nDavid Price gave up solo homers to Ben Zobrist in the first and Moustakas in the second. Aaron Sanchez replaced Price with two outs in the seventh, the Royals leading, 2-1, and Moustakas on second.\nSanchez gave up an RBI single to former Blue Jays Alex Rios that upped the hosts’ lead to 3-1. Escobar followed with a single to left but Sanchez got Zobrist on a grounder to the right side.\nShare this: Facebook Twitter Google Whatsapp Email Filed under alcs ,  kansas city royals ,  mlb playoffs ,  new york mets ,  toronto blue jays ,  world series", "external_links": [], "published": "2015-10-24T03:37:00.000+03:00", "crawled": "2015-10-24T14:21:04.549+03:00", "highlightTitle": ""}