{"organizations": [], "uuid": "41a511dc7ff6bfcb848f39ba7382bce5e2ea6f65", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "courier-tribune.com", "main_image": "http://courier-tribune.com/sites/courier-tribune.com/files/field/media/web1_FOR-WEB-MURPHY.jpg", "site_section": "http://courier-tribune.com/taxonomy/term/3/feed", "section_title": "Sports", "url": "http://courier-tribune.com/sports/pro/murphy-s-law-hit-home-run-six-straight-postseason-games", "country": "US", "title": "Murphy’s Law: Hit home run in six straight postseason games", "performance_score": 0, "site": "courier-tribune.com", "participants_count": 0, "title_full": "Murphy’s Law: Hit home run in six straight postseason games", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T06:00:00.000+03:00", "replies_count": 0, "uuid": "41a511dc7ff6bfcb848f39ba7382bce5e2ea6f65"}, "author": "", "url": "http://courier-tribune.com/sports/pro/murphy-s-law-hit-home-run-six-straight-postseason-games", "ord_in_thread": 0, "title": "Murphy’s Law: Hit home run in six straight postseason games", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Murphy"], "text": "Murphy’s Law: Hit home run in six straight postseason games Murphy’s Law: Hit home run in six straight postseason games \nRECORD - New York infielder David Murphy has hit home runs in six consecutive postseason games. From wire reports \nCHICAGO — The game’s hottest reliever wants no part of facing him. A former batting champion can’t imagine what it’s like to be on such a streak. And Daniel Murphy himself can’t figure out how he’s doing it. \nWhen scouts for either the Kansas City Royals or the Toronto Blue Jays file their reports on the New York Mets offense for the World Series, they’ll have to get creative in their suggestions of how to go after Murphy. \nThey won’t get much help from their Chicago Cubs counterparts, who studied him plenty and came away with no answers. \nMurphy, the easy choice for MVP of the National League Championship Series, continued his assault on playoff pitchers with yet another home run in the Mets’ 8-3 victory Wednesday night, which completed a four-game sweep of the Cubs. \nBy homering in a sixth consecutive game, belting a two-run drive over the center-field wall in the eighth inning, Murphy set a postseason record and capped one of the most remarkable playoff series in memory. \nCarlos Beltran’s eight-homer outburst for the Houston Astros in 12 games during the 2004 playoffs falls in a similar category — Murphy has seven long balls in nine games so far — but the heroics by the Mets second baseman are certainly more surprising. \nMurphy established a career high with 14 homers this season. A San Diego State statistics professor, Jim Lackritz, calculated that Murphy’s chances of tying Beltran’s record of homering in five consecutive postseason games were 1-in-100,000. His odds of breaking the mark, as he did Wednesday? One in a million. \nOutfielder Michael Cuddyer, who won the 2013 NL batting crown, was asked what it feels like to get on that kind of streak. \n“I don’t know, I’ve never been on a streak like that before,’’ Cuddyer said with a guffaw. “I can’t describe it. I’ve never been that hot. Hot’s an understatement.’’ \nNot only did Murphy clear the fences for the fourth time in this series, tying an NLCS record, but he missed going yard by just a few feet in the seventh, settling for a double as part of a 4-for-5 night that left him with a .529 series batting average. His 1.294 slugging percentage also set an NLCS mark. \nThe heroics have put Murphy’s name alongside the likes of accomplished sluggers like Beltran and Barry Bonds, who cranked out eight home runs in 17 games in the 2002 postseason, which leaves him just as puzzled as everybody else. \n“I’ve talked to (hitting coach) Kevin Long about it. I can’t explain it,’’ Murphy said. “It’s just such a blessing to be able to contribute to what we’ve been able to do. … I’m excited to be able to do something to help us win ballgames, but I can’t explain it.’’ \nMurphy, perhaps growing more comfortable in his role of postseason beast, allowed himself a rare fist pump as he rounded the bases. The drive into the basket in center increased New York’s lead to 8-1, making it the sixth time he has homered in a Mets win. Only the one he hit off Clayton Kershaw in Game 4 of the Division Series came in a losing cause. \nMurphy has been so locked in that he went up looking for a changeup against Cubs reliever Fernando Rodney and somehow was able to react to the fastball. And it clearly doesn’t matter these days who’s on the mound. Murphy mistakenly said the homer in the eighth came off Hector Rondon, who instead pitched a scoreless ninth. \n“He threw two heaters, and the second one exploded on me,’’ Murphy said of Rodney. “So now I’m like I don’t know what to look for. I might as well stay in the changeup because I don’t have the fastball measured. And he threw another heater and I just swung. I hoped I would have took it. And then when I hit it, I said, ‘Oh, my goodness.’ ’’ \nMurphy’s barrage helped the Mets outscore the Cubs 21-8 in the series \nBy Sunday, the Mets will know their World Series opponent, and their bullpen will have gotten a rest after throwing 4 1/3 innings Wednesday in relief of rookie Steven Matz, who allowed just four hits and a run but got an early hook. \nCloser Jeurys Familia made his fourth scoreless appearance of the series and eighth of the playoffs, but even he acknowledged he’s happy not to have to deal with a hitter in such a zone as Murphy. \n“I don’t want to face Murphy right now,’’ Familia said with a laugh when asked how he would pitch to him. “He’s feeling it, and when that happens a player has to take advantage of it. Everything’s going well for him.’’ \nAnd, by extension, for the Mets as well.", "external_links": [], "published": "2015-10-23T06:00:00.000+03:00", "crawled": "2015-10-23T06:57:15.929+03:00", "highlightTitle": ""}