{"organizations": [], "uuid": "48eeeda2d3f8fc9eaac0fc2f942373550cff2c04", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/6/51/161504/Sports/Egyptian-Football/Preview-Ahly-eye-fresh-Egyptian-league-start-follo.aspx", "country": "EG", "title": "Preview: Ahly eye fresh Egyptian league start following forgettable campaign - Egyptian Football - Sports", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Preview: Ahly eye fresh Egyptian league start following forgettable campaign - Egyptian Football - Sports - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "48eeeda2d3f8fc9eaac0fc2f942373550cff2c04"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/6/51/161504/Sports/Egyptian-Football/Preview-Ahly-eye-fresh-Egyptian-league-start-follo.aspx", "ord_in_thread": 0, "title": "Preview: Ahly eye fresh Egyptian league start following forgettable campaign - Egyptian Football - Sports", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Egyptian Premier League fixtures & results (1st matchday) Injury sidelines Ahly's defender Rabia for 10 days Injuries hit Ahly ahead of Egyptian Premier League opener Ahly's ball-standing man apologizes for Zamalek's angered players Ahly’s new coach Peseiro aware of tough mission but determined to succeed Ahly will be hoping to put a frustrating season behind them when they kick off their 2015-16 Egyptian Premier League campaign against Talae El-Geish under the tutelage of newly-appointed manager Jose Peseiro on Thursday.\nA disappointing season saw Ahly finish without winning a major trophy for the first time since 2004 after losing the league and cup titles to arch-rivals Zamalek.\nA shock 5-3 aggregate defeat at the hands of South Africa's Orlando Pirates saw Ahly exit the Confederation Cup in humiliating fashion following a 4-3 return-leg loss in Cairo.\nThe result sealed the fate of then-coach Fathi Mabrouk, shortly after having his contract renewed, after intially taking over Ahly on a temporary basis following the sacking of Juan Carlos Garrido.\nFormer Real Betis boss Garrido was wielded the axe similarly after another continental debacle, which saw Ahly bow out of the Champions League last-16 as they were relegated to the Confederation Cup.\nBut a thrilling 3-2 Super Cup win over Zamalek gave the Reds' fans hopes that their club would now hit their stride and make up for a forgettable season.\nThe victory relieved pressure on the beleaguered club's board- who came under immense criticism from media and fans alike following the appointment of the Portuguese Peseiro.\nRumors circulated that Ahly were going to reinstate Manuel Jose, a manager under whom the club rejoiced in a blaze of glory and record-breaking triumphs, for a fourth stint – with their fans keeping their fingers crossed.\nThe club's faithful, however, were disillusioned with the news of Peseiro's appointment, with the board of directors bearing the brunt of their fans' wrath.\nBut after their win over Zamalek in the season's curtain raiser, the Ahly supporters started to regain confidence in their side – with the arrival of center-back duo Ramy Rabia and Ahmed Hegazy consolidating their shaky backline.\nRabia, however, will not be able to feature against Geish due to fatigue, as summer-signing Malick Evouna will miss the opening game due to an ankle problem.\nRight-back Bassem Ali has also been omitted due to injury.\n(For more sports news and updates, follow Ahram Online Sports on Twitter at @AO_Sports and on Facebook at AhramOnlineSports .)", "external_links": ["https://twitter.com/AO_Sports", "https://www.facebook.com/AhramOnlineSports?fref=ts"], "published": "2015-10-21T03:00:00.000+03:00", "crawled": "2015-10-22T04:37:21.188+03:00", "highlightTitle": ""}