{"organizations": [], "uuid": "2282290833786b9963a2fcccdc8c12d8e255aefe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "jacksonville.com", "main_image": "http://jacksonville.com/sites/default/files/14810185.jpg", "site_section": "http://feeds.jacksonville.com/JacksonvillecomSports#", "section_title": "Jacksonville sports news - Jacksonville.com and The Florida Times-Union", "url": "http://jacksonville.com/sports/college/florida-state-seminoles/2015-10-14/story/acc-notebook-better-times-dabo-swinney-pluto", "country": "US", "title": "ACC Notebook: Better times for Dabo Swinney, Pluto", "performance_score": 0, "site": "jacksonville.com", "participants_count": 1, "title_full": "ACC Notebook: Better times for Dabo Swinney, Pluto", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:42:00.000+03:00", "replies_count": 0, "uuid": "2282290833786b9963a2fcccdc8c12d8e255aefe"}, "author": "Garry Smits", "url": "http://jacksonville.com/sports/college/florida-state-seminoles/2015-10-14/story/acc-notebook-better-times-dabo-swinney-pluto", "ord_in_thread": 0, "title": "ACC Notebook: Better times for Dabo Swinney, Pluto", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ACC Notebook: Better times for Dabo Swinney, Pluto \nBy Garry Smits Wed, Oct 14, 2015 @ 8:42 pm | updated Wed, Oct 14, 2015 @ 8:53 pm Photos AP Richard Shiro Associated Press Clemson coach Dabo Swinney high-fives a fan before the game against Georgia Tech on Saturday in Clemson, S.C. \nOne might say Dabo Swinney and Steve Spurrier were linked in an astronomical way. \nNot that they were born under the same sign. But one of the most notable exchanges between Swinney, the coach at Clemson, and Spurrier, who resigned at South Carolina on Tuesday, involved the solar system ... and Swinney feels a bit vindicated. \nHere’s the background: A reporter, hoping to get Swinney to say something controversial, asked Swinney once if he and Spurrier got along. Swinney said that they did, but were different types of people. \n“He’s from Mars. I’m from Pluto,” Swinney said. \nThat was after the International Astronomical Union downgraded Pluto to a “dwarf planet” in 2006. When Spurrier was asked to comment on Swinney’s characterization, he replied: “I don’t think Dabo knows Pluto ain’t a planet anymore.” \n“I was like, ‘Dadgum, Pluto was a planet when I was at Alabama,’” Swinney said earlier this week during a news conference at Clemson. “I missed that news flash.” \nHowever, there have been recent moves to re-designate Pluto as a planet. \n“We finally beat them last year [breaking a five-game losing streak against Spurrier] and guess what’s happened?” Swinney said. “Pluto has made a comeback.” \n\nPunting for miles \nWake Forest punter Alex Kinal had a huge game last week in a 3-0 victory over Boston College, kicking 10 times for a 51.3 yard average and four punts dropped inside the Boston College 20. \nHe also passed a milestone in becoming the all-time ACC career leading in punting yardage with 12,383 yards. That’s slightly more than 7 miles of punts, but isn’t that like being the all-time minor league home-run leader? \nGiven the fact that Wake has played four games in a row in which the final margin was eight points or less (the Deacons went 2-2 in those games), coach Dave Clawson is happy with what he has — field position. \n“He’s the best in the conference and the best in the country,” Clawson said. “He does not care about his average. All he cares about is the net punt. The amount he puts inside the 10-yard line and the amount he hangs up there ... to make it not returnable.” \nKinal is fifth overall in the ACC with a 44.2 yard average. But he leads the league with 19 punts downed or fair-caught inside the 20, and Wake is 10th in the nation and first in the ACC in net punting (the kick minus return yards) at 42.2. \n\nBoehme pushing QB Sirk at Duke \nDuke coach David Cutcliffe said redshirt sophomore quarterback Parker Boehme of Jacksonville Beach will become more of a part of the offense as the season winds on. \nWhich doesn’t mean Cutcliffe is displeased in the slightest with starter Thomas Sirk , a redshirt junior from Macclenny. \nBoehme ran for 27 yards and two touchdowns and completed 3-of-3 passes for 46 yards in Duke’s 44-3 victory over Army last week. It was his most work since the second game and showed Cutcliffe that there is a place for Boehme the rest of the season as the Blue Devils face a rugged slate of Coastal Division opponents after a bye week: at Virginia Tech, Miami, at North Carolina and Pittsburgh. \n“I think [Boehme] is going to play a role for us down the stretch that will be important,” Cutcliffe said. “Whether it’s red zone, short yardage, goal line or even open field, he’s a talented youngster with outstanding speed. He’s got a lot of skill sets I think can help us win games.” \nSirk, fourth in the ACC in passing yardage with 210 yards per game, and 10th in the league in rushing with 54.2 yards per game, is still entrenched on the first team. He threw for 197 yards and one touchdown and rushed for 53 yards against Army. \n“They are best friends and certainly focused on our team,” Cutcliffe said. “Although I promise you they compete every day on the practice field, which I love. It’s making us better.” \n\nFord sets TD record \nVirginia Tech isn’t exactly Wide Receiver U, but the since the Hokies joined the ACC in 2005, they’ve had some good ones: Josh Morgan , Jarrett Boykin , Eddie Royal and Danny Coale , to name a few. \nBut until last week’s 28-13 victory over N.C. State, Tech never had a receiver catch three touchdown passes in one ACC game. Isaiah Ford took care of that in the first half on catches of 2, 5 and 27 yards. Ford caught the most TD passes for a Hokies wide receiver in one game since former Jaguar Ernest Wilford snagged four against Syracuse in 2002, when both teams were in the Big East.", "external_links": [], "published": "2015-10-15T03:42:00.000+03:00", "crawled": "2015-10-15T18:11:03.569+03:00", "highlightTitle": ""}