{"organizations": [], "uuid": "173fcf8c738e645442757797ad10acaa0bcacf21", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ocvarsity.com", "main_image": "http://images.onset.freedom.com/ocvarsity/medium/nwk5r8-arashlee580.jpg", "site_section": "http://www.ocvarsity.com/common/rss/rss.php?", "section_title": "OCVarsity.com Sports : News", "url": "http://www.ocvarsity.com/articles/park-80653-foothill-villa.html", "country": "US", "title": "Foothill turns battle with rival Villa Park into blowout", "performance_score": 0, "site": "ocvarsity.com", "participants_count": 1, "title_full": "Foothill turns battle with rival Villa Park into blowout", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T09:56:00.000+03:00", "replies_count": 0, "uuid": "173fcf8c738e645442757797ad10acaa0bcacf21"}, "author": "DAN ALBANO", "url": "http://www.ocvarsity.com/articles/park-80653-foothill-villa.html", "ord_in_thread": 0, "title": "Foothill turns battle with rival Villa Park into blowout", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Foothill turns battle with rival Villa Park into blowout October 20, 2015 11:56 PM By DAN ALBANO STAFF WRITER \nFormer Foothill water polo stars Jay Lovero and Frank Reynolds returned to their alma mater Tuesday to watch a rivalry they helped make one of the fiercest in Orange County. \nThe script took an unexpected twist, but Lovero and Reynolds were still smiling afterward. \nCenter Griffin Gaughran scored five goals, reserve sophomore JJ Hornecker added four and goalie Arash Izadmanesh made nine saves as second-ranked Foothill defeated visiting No. 10 Villa Park, 18-1, in the most lopsided game in the series since the first game in 1973. \nThe series once-dubbed the “Battle of the Century”, a reference to the strength of the programs and their old league affiliation, has produced 16 one-goal games among countless classic encounters. \nBut Foothill’s tight press fed a swift counterattack that didn’t miss much in the Crestview League game. The Knights scored the first 17 goals, including nine on counterattacks, en route to their first victory against Villa Park (15-6, 1-1) in their 50-meter pool. \nWhen the Knights (16-2, 1-0) weren’t scoring on fast-breaks, they countered Villa Park’s help-defense to find Gaughran at center. The senior scored all five of his goals from 2 meters. \n“I wasn’t expecting (the game) to be the way it was,” said Foothill coach Jim Brumm , who has coached the Knights since 1987. \n“Some of the old games were classics. We both had small pools. I remember games where they put caution tape around the benches just to keep the crowd off the benches. … Nothing bad, the place was just so crowded.” \nMike Miller and Zane Scott each added three goals for Foothill, and Chas Hornecker had two. \nDefender Bobby Lee dished out five assists. The senior said the Knights’ recent 18-7 loss to Harvard-Westlake of Studio City in the finals of the S & R Sport tournament has fueled the team for the past week and a half. \n“Playing them definitely pushed our practices,” Lee said. “We went a lot harder, trained harder and I guess it showed in this game.” \nIzadmanesh, a rising junior, said he wasn’t surprised by the result. \n“We’ve just been putting in a lot of work lately,” he said. “We expected to dominate and come out with intensity.” \nVilla Park scored with 2:43 left in the fourth on a power-play strike by Dash Farr on an assist by Garrett Gauf . The Spartans capitalized after Foothill was whistled in the backcourt for delaying a free pass following a turnover. \nVilla Park coach John Carcich declined comment after the game, but Brumm commented on the rivalry, which Foothill leads, 28-20. \n“There’s times that we got whupped, too,” he said. “Sometimes it depends on your years with kids. There were times that Villa Park was really strong and got us pretty good.” \nIn 1973, Foothill defeafed first-year Villa Park, 23-0. \nIn nonleague: \nSegerstrom 12, No. 10 JSerra 11: Seth Chavez tipped in a corner throw from Jose Barajas as the Jaguars upset the host Lions, who share the No. 10 spot in the county poll this week with Villa Park. \nContact the writer: dalbano@ocregister.com", "external_links": [], "published": "2015-10-21T09:56:00.000+03:00", "crawled": "2015-10-21T14:10:39.822+03:00", "highlightTitle": ""}