{"organizations": [], "uuid": "ebfaa3c2524cf8a79e85cbaf7d174153bf34fe5e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattletimes.com", "main_image": "http://static.seattletimes.com/wp-content/uploads/2015/10/4ac23c812029459c9e30674a58c86f39-1200x630.jpg", "site_section": "http://www.seattletimes.com/", "section_title": "The Seattle Times | Local news, sports, business, politics, entertainment, travel, restaurants and opinion for Seattle and the Pacific Northwest. ", "url": "http://www.seattletimes.com/nation-world/mexico-braces-for-strongest-hurricane-in-western-hemisphere/", "country": "EU", "title": "Patricia slams Mexico Pacific Coast as Category 5 hurricane", "performance_score": 0, "site": "seattletimes.com", "participants_count": 1, "title_full": "Patricia slams Mexico Pacific Coast as Category 5 hurricane | The Seattle Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T15:15:00.000+03:00", "replies_count": 0, "uuid": "ebfaa3c2524cf8a79e85cbaf7d174153bf34fe5e"}, "author": "CHRISTOPHER SHERMAN", "url": "http://www.seattletimes.com/nation-world/mexico-braces-for-strongest-hurricane-in-western-hemisphere/", "ord_in_thread": 0, "title": "Patricia slams Mexico Pacific Coast as Category 5 hurricane", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PUERTO VALLARTA, Mexico (AP) — Hurricane Patricia roared ashore in southwestern Mexico as a Category 5 storm Friday evening, bringing lashing rains, surging seas and cyclonic winds hours after it peaked as one of the strongest storms ever recorded.\nThere were early reports of some flooding and landslides as the storm moved over inland mountains after nightfall. Television news reports from the coast showed some toppled trees and lampposts and inundated streets. Milenio TV carried footage of cars and buses being swept by floodwaters in the state of Jalisco.\nBut authorities said there were no immediate reports of fatalities or the kind of major, widespread damage feared earlier in the day when forecasters warned of a potentially “catastrophic” landfall.\n“The first reports confirm that the damage has been less than those expected from a hurricane of this magnitude,” President Enrique Pena Nieto said in a taped address late Friday. He added, however, that “we cannot yet let our guard down.”\nRelated Stories How Hurricane Patricia exploded overnight into biggest ever in Pacific Local residents with ties to Puerto Vallarta wait, watch for hurricane news Patricia slams Mexico Pacific Coast as Category 5 hurricane Flooded Interstate 45 backs up traffic 12 miles Prosecutors: Man sprayed graffiti on prehistoric carving Kate’s red dress warms U.K.’s ties with China Indeed, Patricia’s projected path was headed next over a mountainous region dotted with hamlets that are at risk for dangerous mudslides and flash floods, and where communications can be sketchy. It wasn’t clear when emergency crews would be able to fully assess the storm’s impact in those isolated areas.\nVideos from the storm Instagram images from Camino Real Manzanillo A video posted by Héctor R Sánchez (@yeto26sanchez) on Oct 23, 2015 at 3:28pm PDT\nThe storm was expected to weaken rapidly and dissipate Saturday, but it was still capable of soaking the region with heavy rain.\nPatricia “continues to advance and continues to be extremely dangerous,” national civil protection coordinator Luis Felipe Puente warned via Twitter. “Stay informed and follow recommendations.”\nPatricia’s center made landfall as a monstrous Category 5 hurricane with maximum sustained winds of 165 mph (270 kph), but in a relatively low-populated stretch of the Jalisco state coast near Cuixmala. The nearest significant city, Manzanillo, was about 55 miles (85 kilometers) southeast and outside the zone of the storm’s hurricane-force winds.\nBy late Friday, Patricia was rapidly losing steam but was still a major hurricane with winds at 130 mph (215 kph), the center reported, or just above the threshold for a Category 4.\nIts center was about 50 miles (75 kilometers) southeast of the resort city of Puerto Vallarta, where rain began to fall harder than it had all day but there was still no sign of strong winds. Streets were deserted except for police patrolling slowly with their emergency lights on.\nBrandie Galle, a tourist from Grants Pass, Oregon, said she sheltered with other guests in a ballroom with boarded-up windows at the Hard Rock Hotel in Puerto Vallarta. Workers let them out to eat in a hotel restaurant after the city was not feeling any major effects from the storm two hours after landfall. There was no visible damage to the building.\nGalle said some guests desperate to leave had earlier paid $400 for taxis to drive them the 120 miles (200 kilometers) to the inland city of Guadalajara.\nPatricia formed suddenly Tuesday as a tropical storm and quickly strengthened to a hurricane. Within 30 hours it had zoomed to a record-beating Category 5 storm, catching many off guard with its rapid growth.\nBy Friday it was the most powerful hurricane on record in the Western Hemisphere, with a central pressure of 880 millibars and maximum sustained winds of 200 mph (325 kph), according to the National Hurricane Center.\nPatricia’s power while still out at sea was comparable to that of Typhoon Haiyan, which left more than 7,300 dead or missing in the Philippines two years ago, according to the U.N.’s World Meteorological Organization. More than 4 million people were displaced and over 1 million houses were destroyed or damaged in 44 provinces in the central Visayas region, a large cluster of islands.\nMexican officials declared a state of emergency in dozens of municipalities in Colima, Nayarit and Jalisco states, and ordered schools as many residents stocked up on canned food and other supplies. Authorities opened hundreds of shelters and sent thousands of emergency crews to aid people.\nMost Read Stories 5 ways CaliBurger is better than In-N-Out Seattle Seahawks fan: Why I'm flipping the switch and turning off my loyalties to this team Seattle Mariners hire Scott Servais as manager, expected to name Tim Bogar bench coach Files for lawsuit against CIA stolen in 'suspicious' break-in at UW Bill the Butcher workers still seeking CEO who vanished with their pay Unlimited Digital Access. $1 for 4 weeks. According to the 2010 census, there were more than 7.3 million inhabitants in Jalisco state and more than 255,000 in Puerto Vallarta municipality. There were more than 650,000 in Colima state, and more than 161,000 in Manzanillo.\nOne of the worst Pacific hurricanes to ever hit Mexico slammed into the same region, in Colima state, in October 1959, killing at least 1,500 people, according to Mexico’s National Center for Disaster Prevention.\nThe Sokols, a family of five from suburban Detroit, were supposed to fly out of Puerto Vallarta on Friday but ended up hunkering down for hours in a shelter at a university after their flight was canceled. By night they were back where they began: at their hotel, and no worse for wear.\n“It’s amazing it went from the worst in history to just some heavy rain,” Susanna Sokol said, noting that at least the hurricane gave her daughter a birthday to remember.\n“It was pretty stressful for a while,” Tom Sokol said. “I felt guilty for taking my kids here.”\nU.S. State Department spokesman Mark Toner said tens of thousands of American citizens were believed to be vacationing or living in areas likely to be affected by the storm.\nThe airports in Puerto Vallarta, Manzanillo and Tepic were closed Friday, but officials announced an air bridge Saturday to ferry stranded travelers out of areas hit by the storm.\nPatricia also threatens Texas with forecasters saying that even after the storm breaks, up its tropical moisture will likely feed heavy rains already soaking the state.\nThe U.S. National Weather Service said a flash flood watch would be in effect through Sunday morning for Dallas-Fort Worth, Austin and San Antonio.\nA coastal flood warning was in effect through Friday night in Corpus Christi. Galveston was under a coastal flood advisory until Saturday night.\n___\nAP Science Writer Seth Borenstein in Washington contributed to this report.\nCHRISTOPHER SHERMAN", "external_links": ["http://embed.newsinc.com/Single/iframe.html?WID=2&VID=29852342&freewheel=90341&sitesection=seseattletimes&height=200&width=300", "http://embed.newsinc.com/Single/iframe.html?WID=2&VID=29852362&freewheel=90341&sitesection=seseattletimes&height=200&width=300", "http://embed.newsinc.com/Single/iframe.html?WID=2&VID=29852296&freewheel=90341&sitesection=seseattletimes&height=200&width=300", "https://instagram.com/p/9MmYwNFZxv/"], "published": "2015-10-23T15:15:00.000+03:00", "crawled": "2015-10-24T08:17:00.475+03:00", "highlightTitle": ""}