{"organizations": [], "uuid": "43d27efc360a6010b554e642e952bf4e9cefed4f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "thecabin.net", "main_image": "", "site_section": "http://thecabin.net/RSS/sports.xml", "section_title": "TheCabin.net - Conway, Arkansas - Sports", "url": "http://thecabin.net/sports/2015-10-17/loss-maumelle-puts-eagles-backs-wall", "country": "US", "title": "Loss to Maumelle puts Eagles' backs to wall", "performance_score": 0, "site": "thecabin.net", "participants_count": 1, "title_full": "Loss to Maumelle puts Eagles' backs to wall", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T04:07:00.000+03:00", "replies_count": 0, "uuid": "43d27efc360a6010b554e642e952bf4e9cefed4f"}, "author": "MEREDITH SCOTT", "url": "http://thecabin.net/sports/2015-10-17/loss-maumelle-puts-eagles-backs-wall", "ord_in_thread": 0, "title": "Loss to Maumelle puts Eagles' backs to wall", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Loss to Maumelle puts Eagles' backs to wall Posted: October 17, 2015 - 8:07pm By MEREDITH SCOTT LOG CABIN CORRESPONDENT \nVILONIA — With just under three minutes to go in the third quarter and down by two points, Vilonia needed a big play Friday night. \nOn fourth down the Eagles were 7 yards from a first down at the Maumelle 43. \nLuke Gordon’s previous two passes were incomplete. Downfield, he spotted Nick Howard inside the 5. \nHoward caught the ball and took a few steps before Maumelle’s Tyric Robinson took him down in the end zone. \nTouchdown Eagles. Bryce Garrison’s kick was good and Vilonia was up by 24-19, a final feel-good moment in a 32-24 loss. \n“Going into the second half, we knew [Maumelle’s defense] would have a little energy,” Vilonia coach Mike Stout said. “Our plan was to try to take the ball and drive it down, and wear down their defensive line a little bit.” \nHoward’s touchdown was the Eagles’ second of the quarter, making it seem like a second-half rally was going to give Vilonia its second conference win. \nBut the lead was short lived. \nSeven seconds into the fourth quarter, Maumelle’s Jacob Acklin rushed 11 yards for another Hornet touchdown. \nVilonia wouldn’t score again. \nStout said “tackling, containing speed and ball security” were the team’s main focuses going into Friday night’s game. But the Eagles “didn’t do any of that,” he said. \nDespite their last drive starting at their own 34 with 30.9 seconds to play, and moving the ball 38 yards in 20.4 seconds, Gordon and the Eagles were unable to make a last-second touchdown after a last-second pass into the end zone. \nThe 32-24 loss to Maumelle dropped the Eagles to 1-3 in the 5A-West conference. Ranked above Farmington and Clarksville, the Eagles hopes at a playoff appearance aren’t completely done. \n“We’ve gotta win the games remaining and get help,” Stout said. “We’ve thought that every game except for one was winnable. We’re young at what we’re doing and that showed tonight.” \nStout and his Eagles have three games left in the regular season with Farmington up next.", "external_links": [], "published": "2015-10-18T04:07:00.000+03:00", "crawled": "2015-10-18T09:23:36.618+03:00", "highlightTitle": ""}