{"organizations": [], "uuid": "495059cc135331a166ffdf24d437fbaf9bbf218e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/golf", "section_title": "Golf News, Leaderboard, Schedule, Photos, Videos - MSN Sports", "url": "http://www.msn.com/en-us/sports/golf/johnson-relishes-opportunity-at-presidents-cup/ar-AAf89XR", "country": "US", "title": "Johnson relishes opportunity at Presidents Cup", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "Johnson relishes opportunity at Presidents Cup", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "495059cc135331a166ffdf24d437fbaf9bbf218e"}, "author": "Steve DiMeglio, USA TODAY Sports", "url": "http://www.msn.com/en-us/sports/golf/johnson-relishes-opportunity-at-presidents-cup/ar-AAf89XR", "ord_in_thread": 0, "title": "Johnson relishes opportunity at Presidents Cup", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Johnson relishes opportunity at Presidents Cup USA Today Sports 18 hrs ago by Steve DiMeglio, USA TODAY Sports © Jason Getz, USA TODAY Sports Johnson relishes opportunity at Presidents Cup INCHEON CITY, Korea – Zach Johnson's flight to Korea to play for flag, team and captain in the Presidents Cup went halfway around the world.\nAdChoices The journey was nothing compared with the road he traveled to get here.\nBorn and raised in Iowa, the son of a chiropractor never imagined as a kid he'd be playing as an adult on golf's biggest stages.\nNot when he played baseball, basketball, football and soccer.\n\"It wasn't in my thoughts,\" Johnson said.\nNot when he finally started getting serious about golf while being one of the team's best players at Regis High School in Cedar Rapids and Drake University in Des Moines.\n\"Dreams would have been a stretch, even,\" Johnson said.\nAnd not when he was traveling the back roads to play in golf's minor leagues, from the Prairie Golf Tour to the NGA Hooters Tour to the now-named Web.com Tour.\n\"Maybe a dream here and there, but not really,\" Johnson said.\nBut the kid from Iowa \"just kept getting better,\" as he said after winning the 2007 Masters on one of the game's grandest stages at Augusta National.\nThis season, at 39, he had one of his best campaigns. Ten top-10s on the PGA Tour that included becoming the Champion Golfer of the Year when he won the British Open in a playoff on the Old Course in St. Andrews, birthplace of the game. The winner of 12 PGA Tour titles finished sixth in the FedExCup and earned his way onto the U.S. team for the Presidents Cup, which starts Thursday at the Jack Nicklaus Golf Club Korea.\n\"Oh, man it is special. Any time I have that on my sleeve it's special,\" Johnson said as he pointed to an American flag. \"It's an honor to make the team and it's more of an honor to take the Cup back to the states. I just relish these opportunities because, one, they are hard to get to, and, two, you don't know how many you are going to get.\"\nThis will be the fourth time Johnson will wear the flag in the Presidents Cup, in addition to playing in the Ryder Cup four times. He's one of the leaders of this year's squad, a player who has worked and played his way into that position of trust. And his love of team sports is inspiring to his teammates.\n\"Team sports have always been a driving force and the competition that comes with it has always been something that I've been attracted to,\" said Johnson, the oldest player in the field at The Tour Championship. \"When you can combine an individual game with a team atmosphere led by great leaders and you are with a band of guys you love to be around and you admire and you trust, and having your wives and girlfriends with us, you can't really explain how pure it is.\n\"Then you have your nation's flag on your sleeve and that makes it even better. … There is motivation to get back to this again, to make the Ryder Cup team next year. Being friends with the young guys helps me. Once you play for your country, you just want to do it as many time much as possible.\"\nGo to MSN Home", "external_links": ["http://www.usatoday.com/sports/", "http://go.microsoft.com/fwlink/?LinkID=286759"], "published": "2015-10-06T03:00:00.000+03:00", "crawled": "2015-10-06T22:04:56.378+03:00", "highlightTitle": ""}