{"organizations": [], "uuid": "6a39504aa05846e6630fe07b49da5f58864829c0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thegazette.com", "main_image": "http://www.thegazette.com/storyimage/GA/20151008/ARTICLE/151009682/AR/0/AR-151009682.jpg", "site_section": "http://feeds.feedburner.com/~r/GazetteOnlineSports/~6/1", "section_title": "Eastern Iowa Sports News and Information from Gazette Online", "url": "http://www.thegazette.com/subject/sports/uni-football-opponent-breakdown-north-dakota-state-20151008", "country": "US", "title": "UNI football opponent breakdown: North Dakota State", "performance_score": 0, "site": "thegazette.com", "participants_count": 0, "title_full": "UNI football opponent breakdown: North Dakota State", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T00:29:00.000+03:00", "replies_count": 0, "uuid": "6a39504aa05846e6630fe07b49da5f58864829c0"}, "author": "", "url": "http://www.thegazette.com/subject/sports/uni-football-opponent-breakdown-north-dakota-state-20151008", "ord_in_thread": 0, "title": "UNI football opponent breakdown: North Dakota State", "locations": ["North Dakota"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jeremiah Davis"], "text": "Jeremiah Davis , The Gazette October 8, 2015 | 5:29 pm \nThe setup to Northern Iowa vs North Dakota State has an all-too-familiar feel for the Panthers. A top-five team on the road awaits the No. 10 team in FCS, this time some team that just happens to have won the last four FCS national championships. UNI (2-2, 0-1 MVFC) doesn’t get a break after the loss to Illinois State, and has its work even more cut out for it when going into the FargoDome to face No. 2/3 North Dakota State (3-1, 1-0). The Panthers need a near-perfect performance if they want to snap the Bison’s 25-game home winning streak. \nEach week we’ll have the Panthers’ opponents schedule and results, its offensive and defensive outlook, highlight key players and offer a prediction with the help of a beat writer for the opposing team. This week it’s Jeff Kolpack, who covers North Dakota State for The Forum in Fargo, N.D. NORTH DAKOTA STATE SCHEDULE/RESULTS \nAug. 29 at No. 12/13 Montana, L, 38-35 \nSept. 12 vs Weber State, W, 41-14 \nSept. 19 vs North Dakota, W, 34-9 \nOct. 3 at No. 5/7 South Dakota State, W, 28-7 \nOct. 10 vs No. 10 UNI \nOct. 17 vs South Dakota \nOct. 24 at No. 19/21 Indiana State \nOct. 31 at Southern Illinois \nNov. 7 vs Western Illinois \nNov. 14 at No. 7/9 Youngstown State \nNov. 21 vs Missouri State OFFENSIVE OUTLOOK \nNorth Dakota State runs out of a power system that puts quarterback Carson Wentz and running back King Frazier in advantageous positions nearly every play. \nSecond-year head coach Chris Klieman (who Panther fans know well) has followed in his old boss’ footsteps in letting offensive coordinator Tim Polasek set the offensive tone, and the results speak for themselves. Because of that power style, the Bison tend to run more than pass, but clearly are effective in whatever they do. As a team, the Bison average 4.6 yards per carry, and while the system they run is designed to wear down opponents, the NDSU offense uses misdirection, play action and unique offensive formations to find big plays repeatedly. Of the 11 players who have registered a carry this season six of them have runs of 20 yards or longer. Wentz is no stranger to big plays himself, averaging 8.3 yards per pass, with a handful of long touchdown throws — the longest of which is 55 yards. \nThis offense is efficient (212.8 yards per game on the ground, 231 per game passing) and will find whatever weaknesses in a defense and exploit them repeatedly. When they control the pace and time of possession, they control the game. Montana showed earlier this season that track meets aren’t NDSU’s forte — at least this season. Forcing turnovers (an issue for NDSU so far) and keeping Wentz and Co. off the field will be vital for UNI. \nFrom Kolpack on North Dakota State’s offensive outlook: \n“Offensively, the team is led by senior quarterback Carson Wentz, who not only has the attention of NDSU opponents but a steady stream of professional scouts coming through Fargo as well. Wentz has thrown 10 touchdown passes without an interception and leads an offensive that has been productive. Certainly, Wentz is a key player as any quarterback in the Missouri Valley Football Conference is. The one downside statistic to the Bison are the six lost fumbles, which ranks them a tie for 106th in the FCS in that category.” DEFENSIVE OUTLOOK \nThe Bison line up in a standard 4-3 defensive scheme that Klieman — the former UNI defensive backs coach and Panther defensive back — carried over with him when he left Cedar Falls for Fargo. \nThe Bison are strong up front on the defensive line, and have seven total sacks from that group. NDSU simply stifles opponents in the run game, allowing just 40.8 yards per game to opponents on the ground this season, including minus-4 for the whole game against South Dakota State and 4 total yards rushing for North Dakota the week before that. The Bison have continuity in the front seven, and rely heavily on linebackers to finish off what the defensive line flushes sideways or backwards. NDSU has been particularly effective in blitz packages since the Montana loss, evidenced by three sacks and six tackles for loss collectively from linebackers and cornerbacks. Ten total sacks and 20 tackles for loss through four games prove this unit is as good as it gets. \nIf there is any kind of weakness, NDSU appears to lack in the secondary. That was showcased most specifically by Montana, as the Grizzlies were able to throw all over the Bison to get that upset. Still, NDSU gives up just 262.2 total yards per game so far this season, so establishing the run is going to be both extremely difficult and extremely necessary if UNI wants a chance to win. \nFrom Kolpack on North Dakota State’s defensive outlook: \n“It wasn’t a promising defensive start for NDSU, which saw Montana throw the ball all over the field in a 38-35 loss to open the season. Not only did the Bison defensive coaches see it, but a national television audience on ESPN got to witness it as well. It wasn’t pretty. But things have changed for the Bison since then, most notably getting standout cornerback C.J. Smith back from an injury and that — and time — has appeared to have calmed the seas. NDSU has held its opponents to minus 8 yards rushing in the last nine quarters.” KEY PLAYERS \nKing Frazier, RB — Sure, Carson Wentz is in the driver’s seat of the diesel truck that is the NDSU offense, but if Wentz is the driver, Frazier is the motor. He spent last season as the No. 2 back behind John Crockett, and averaged 5.5 yards in 111 carries, and finished the season with 616 yards and four touchdowns. He’s stepped into the lead back role this season and flourished, carrying 55 times so far for 278 yards (5.1 per carry) with three touchdowns. Most importantly, he’s exceptional at keeping his feet driving forward and being the north-south runner that makes this offense flow. He’s got just seven negative yards this season. \nNick DeLuca, LB — The junior linebacker from Omaha, Neb. has done anything and everything for the NDSU defense this season. He leads the team with 28 tackles, is second in tackles for loss with three and is a half-sack from being tied for the lead in sacks at two. He also has one of the Bison’s two interceptions this season and has forced a fumble. Being a jack-of-all-trades is important for any linebacker, but when playing teams that run the ball a lot or rely on run-focused quarterbacks, a player like DeLuca sees his importance skyrocket. \nKolpack’s key players for North Dakota State: Carson Wentz, QB and C.J. Smith, DB . PREDICTION \nIn a perfect scenario, Northern Iowa is able to force Wentz, Frazier and the NDSU offense into turnovers and can find some flow in the short passing game and read option run game to stay on the field and control the clock. In a worst-case scenario, the Panthers look like they did offensively against Illinois State, and the Bison wear down a talented UNI defense like NDSU did against South Dakota State. The Panthers have been unpredictable so far this season, and have lacked some mental focus in terms of penalties — both things that do not put them in an advantageous position against one of the best teams in the country, at one of the toughest places to play in the country. That inconsistency bites them again; North Dakota State 26, Northern Iowa 14 . \nFrom Kolpack: \n“With NDSU’s defense playing so well, the Panthers will have to have a decided edge in the turnover department, which is certainly possible. Still, the Bison have won 25 straight at the Fargodome and I see that continuing with a 24-10 NDSU win .” \nl Comments: (319) 368-8884; jeremiah.davis@thegazette.com Your Next Articles", "external_links": [], "published": "2015-10-09T00:29:00.000+03:00", "crawled": "2015-10-09T19:44:49.844+03:00", "highlightTitle": ""}