{"organizations": [], "uuid": "da523c4ca0d75c4d8c14459207076a3938b80db5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.contracostatimes.com", "main_image": "http://local.contracostatimes.com/common/dfm/assets/logos/1200x627/contracostatimes.png", "site_section": "http://feeds.contracostatimes.com/mngi/rss/CustomRssServlet/571/225005.xml", "section_title": "Sports", "url": "http://www.contracostatimes.com/athletics/ci_28918961/5-mariners-5-drew-pomeranz-may-have-undergo?source=rss", "country": "IL", "title": "A's 5, Mariners 5: A's Drew Pomeranz may have to undergo surgery", "performance_score": 0, "site": "contracostatimes.com", "participants_count": 1, "title_full": "A's 5, Mariners 5: A's Drew Pomeranz may have to undergo surgery", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T08:23:00.000+03:00", "replies_count": 0, "uuid": "da523c4ca0d75c4d8c14459207076a3938b80db5"}, "author": "John Hickey\n\njhickey@bayareanewsgroup.com", "url": "http://www.contracostatimes.com/athletics/ci_28918961/5-mariners-5-drew-pomeranz-may-have-undergo?source=rss", "ord_in_thread": 0, "title": "A's 5, Mariners 5: A's Drew Pomeranz may have to undergo surgery", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A's 5, Mariners 5: A's Drew Pomeranz may have to undergo surgery By John Hickey Posted: 10/03/2015 10:23:02 PM PDT Updated: 10/03/2015 10:46:08 PM PDT SEATTLE -- Drew Pomeranz has a decision to make. \nThe A's reliever has heard the recommendation that he should have clavicle resection procedure to clear up problems in his left shoulder. \nNow he has to decide if that's what he wants to do. Either way, the A's, down to their final game of the season Sunday after going to extra innings tied 5-5 with the Mariners after 11 innings Saturday, expect Pomeranz to be healthy and ready to go when the club reconvenes for spring training in Mesa, Ariz., in February. \nOakland shut Pomeranz down the last week of September with AC joint problems in his left shoulder. A similar issue sent him to the disabled list for .two weeks in May. \nAfter reviewing an MRI on the shoulder, A's associate team orthopedist Dr. Will Workman recommended to Pomeranz that he have some work done on his shoulder where he is dealing with some arthritic conditions. \n\"Drew is going to see some other opinions,'' A's trainer Nick Paparesta said Saturday. \"He'll sit down and determine if this is something he wants to do at this stage or if he just wants to let (the shoulder) calm down.'' \nRecovery time on the procedure, which Yankees' closer Mariano Rivera once had on his right shoulder, is about six weeks. \n\"Usually when you think shoulder surgery, you think bad things, a year or whatever,'' manager Bob Melvin said. \"What we're being told now, it's not that. If he does have this done, he should be fine come spring training.'' Advertisement \nChecking on the status of injured Oakland pitchers has become something of a full-time job. The A's have seven pitchers who have been shut down for the year, although it's something of a moot point with Sunday being the final day of the season. \nStarter Jarrod Parker continues to throw after having missed the last two seasons following 2013's Tommy John surgery. The A's had hoped to have him back mid-season, but as he was tuning up in the minor leagues he hurt his right elbow and needed surgery to mend a medial epicondyle fracture. The A's don't know if he will be available come spring training. \nStarter A.J. Griffin, on the other hand, should be good to go next February in Mesa, Ariz. Like Parker, he's coming back from missing two years after Tommy John surgery. He's shut down now because of some tendinitis in his right shoulder. \"I think Griffin hopefully should be a full-go once he gets to spring,'' Melvin said. \nStarter Jesse Hahn missed the second half of the season with a right forearm strain. He's throwing now, still relatively softly and not to a great distance, but the A's are optimistic that he will be good to go come spring training. \nStarter Jesse Chavez (fractured elbow), starter Kendall Graveman (strained left oblique) and reliever Evan Scribner (torn right lat muscle) all are expected to be healthy come spring training. \nIn the non-pitching category, Melvin said catcher Josh Phegley, sidelined by a concussion late in September, might have played some this weekend if he was with the club. He stayed behind in Oakland, so that won't happen. First baseman Ike Davis had successful hip surgery in August and has been doing his rehab work in Arizona. \nDanny Valencia hit a three-run homer, his second bomb in as many games, in the first inning as the A's built up an early 4-0 lead Saturday. But Oakland was in a 5-4 hole in the ninth when Brett Lawrie delivered a sacrifice fly that scored Billy Burns with the tying run and led to extra-inning. \nThirty-six players flew with the A's on this last road trip, but only 15 will be flying back to Oakland after Sunday's finale. The other 21 are heading home from Seattle. Some of the ones living in the Eastern Time Zone have time to kill Sunday while waiting for red-eye flights. Some are opting to watch the Seattle Sounders host the LA Galaxy at Century Link Field across the street from Safeco Field. Others are opting to watch Neil Young at the WaMu Theater downtown at the convention center. \nBig league clubs were given the option to use iPads (with their wireless functions disabled) in the dugouts the last week of the season as an experiment. Melvin said he'd prefer to wait to test the digital approach until spring training. \"We're kind of set on what we do in the dugout right now,'' he said. \"It seems like more of a spring training thing.'' \nFor more on the A's, see John Hickey's Inside the A's blog at ibabuzz.com/athletics . Follow him on Twitter at twitter.com/JHickey3 .", "external_links": [], "published": "2015-10-04T08:23:00.000+03:00", "crawled": "2015-10-04T08:52:38.414+03:00", "highlightTitle": ""}