{"organizations": [], "uuid": "485f310db64727af065230124aa710663b5a6fec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "jakartaglobe.beritasatu.com", "main_image": "http://img.thejakartaglobe.com/2015/10/TOPSHOTS-RUGBYU-WC-2015-RSA-USA-190361-01-02-1024x681.jpg", "site_section": "http://jakartaglobe.beritasatu.com/rss/sports/", "section_title": "Sports | Jakarta Globe", "url": "http://jakartaglobe.beritasatu.com/rugby/history-looms-world-cup-quarter-finalists-fine-tune/", "country": "ID", "title": "History Looms as World Cup Quarter-Finalists Fine-Tune", "performance_score": 0, "site": "beritasatu.com", "participants_count": 0, "title_full": "History Looms as World Cup Quarter-Finalists Fine-Tune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T22:34:00.000+03:00", "replies_count": 0, "uuid": "485f310db64727af065230124aa710663b5a6fec"}, "author": "", "url": "http://jakartaglobe.beritasatu.com/rugby/history-looms-world-cup-quarter-finalists-fine-tune/", "ord_in_thread": 0, "title": "History Looms as World Cup Quarter-Finalists Fine-Tune", "locations": ["USA", "US", "South Africa", "London"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mike Collett-White", "Dennis", "Cameron Dolan", "Willem Alberts", "Willie"], "text": "INDEX History Looms as World Cup Quarter-Finalists Fine-Tune i South Africa's back row forward Willem Alberts (C) and South Africa's full-back Willie le Roux (R) jump for the ball with US back row forward Cameron Dolan (L) during a Pool B match of the 2015 Rugby World Cup between South Africa and USA at the Olympic Stadium, east London. (AFP Photo/Adrian Dennis) By : Mike Collett-White | on 9:34 AM October 16, 2015 Category : Sports , Rugby \nLondon. History looms large as the eight quarter-finalists gear up for the knockout phase of the Rugby World Cup, with some teams desperate to replicate the heroics of upsets past and others out to see familiar patterns repeated. \nWales and South Africa go first on a mouth-watering weekend of action, kicking off on Saturday afternoon at Twickenham with a match Springboks coach Heyneke Meyer expects to be an arm-wrestle. \n\"We're playing against a well-balanced side that always likes to mix things up when it comes to physicality,\" he told reporters on Thursday, as teams put the final touches to their preparations and more lineups were announced. \nMeyer has made just a single change to his starting XV from the side that routed the United States 64-0, with in-form winger JP Pietersen returning from injury to replace Lwazi Mvovo. \nSouth Africa lead the countries' head-to-heads 27-2 with one draw, and Wales have been hit by a series of injuries to key players in the build-up to the tournament and during it. \nBut the Welsh will take heart from their triumph over adversity to make it out of a very tough group, which also included Australia and England. \nWales have made three changes to their team, centre Tyler Morgan, prop Gethin Jenkins and flanker Dan Lydiate all returning to the side. \n\"The physicality and intensity of the matches so far will stand us in good stead for what is going to be a huge battle against the Springboks,\" Wales coach Warren Gatland said. \nSaturday's other game is New Zealand against France in Cardiff, with the formidable All Blacks favourites to progress but Les Bleus aware that they are capable of springing a surprise, having done so at the 1999 and 2007 World Cups. \nFrench prop Jean-Baptiste Poux, who appeared in the 2007 quarter-final, conceded that good fortune played its part. \n\"We were kind of scared of conceding 50 points but we made it, with a bit of luck, and we gave 200 per cent,\" he told Reuters. \nNew Zealand coach Steve Hansen is leaving little to chance, recalling captain Richie McCaw to lead a squad of 23 with a combined 1,295 caps and including no fewer than four men who have been named world player of the year. \n\"The thing the old guys bring you is experience. You can't buy that. When you are under the pump, you need people in that group that can cope with it,\" Hansen told a news conference. \nHalfback pairing \nFor France, Morgan Parra was named at scrumhalf to partner flyhalf Frederic Michalak, as coach Philippe Saint-Andre continued to tinker with his halfback pairing. \nPowerhouse center Mathieu Bastareaud was dropped from the starting line-up and flanker Bernard Le Roux comes in for Damien Chouly. \nIreland meet Argentina on Sunday, also in Cardiff, and, if recent form is any guide, the Irish have little to fear, having beaten their opponents the last five times they have met. \nBut then there is history. \nIreland have known only heartbreak from their previous quarter-final appearances, playing five and losing five. \nThe Irish players need no reminding that their country has tripped up at the same hurdle so many times before and what is at stake. \n\"It's a big weekend for Irish rugby,\" prop Nathan White said. \"If we get through this one it's the furthest we've ever been so there's plenty of focus around, plenty of drive in the lads.\" \nAustralia face Scotland at Twickenham on Sunday in the final last-eight clash. \nThe build-up to that match has been overshadowed by bans that have ruled out Scotland hooker Ross Ford and lock Jonny Gray who were handed three-week suspensions for a dangerous tackle on Samoa's Jack Lam. \n\"We hold Ross and Jonny in very high regard and as a result will be launching a robust appeal to challenge their suspensions, which we feel are unduly harsh,\" Scottish Rugby Chief Executive Mark Dodson said. \nThe suspensions have been heavily criticised, and even Australia coach Michael Cheika expressed sympathy for the banned pair. \nFormer Wales flyhalf Jonathan Davies described the inconsistency of the tournament's disciplinary hearings as a \"disgrace.\" \nReuters", "external_links": [], "published": "2015-10-15T22:34:00.000+03:00", "crawled": "2015-10-16T09:31:49.647+03:00", "highlightTitle": ""}