{"organizations": [], "uuid": "d578d07535635ee030575010079657929c29ca89", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sun-sentinel.com", "main_image": "http://www.trbimg.com/img-56229edf/turbine/os-fsu-florida-state-seminoles-louisville-cardinals-game-story-20151017", "site_section": "http://www.sun-sentinel.com/sports/rss2.0.xml", "section_title": "Sports - Sun Sentinel", "url": "http://www.sun-sentinel.com/sports/os-fsu-florida-state-seminoles-louisville-cardinals-game-story-20151017-story.html", "country": "US", "title": "Big second half propels FSU to easy win over Louisville", "performance_score": 0, "site": "sun-sentinel.com", "participants_count": 1, "title_full": "Big second half propels FSU to easy win over Louisville", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T01:19:00.000+03:00", "replies_count": 0, "uuid": "d578d07535635ee030575010079657929c29ca89"}, "author": "Brendan Sonnone", "url": "http://www.sun-sentinel.com/sports/os-fsu-florida-state-seminoles-louisville-cardinals-game-story-20151017-story.html", "ord_in_thread": 0, "title": "Big second half propels FSU to easy win over Louisville", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Big second half propels FSU to easy win over Louisville FSU's Dalvin Cook talks hamstring and Heisman after Louisville game \nFSU running back Dalvin Cook talks hamstring and Heisman talk after 41-21 win over Louisville. \nFSU running back Dalvin Cook talks hamstring and Heisman talk after 41-21 win over Louisville. Brendan Sonnone Contact Reporter Orlando Sentinel \nTALLAHASSEE — FSU players sleep-walked through the first half. \nCoach Jimbo Fisher attributed the sluggish start to a young team pressing too much, trying to prove it belongs among the nation’s elite. \nReceiver Kermit Whitfield said the noon kickoff was to blame. \nRegardless of the reason, No. 11 FSU appeared poised for a letdown against visiting Louisville Saturday. \nThen Dalvin Cook — on one good hamstring — woke his team up. The sophomore running back broke four tackles on his way to a 54-yard touchdown early in the second half, serving as a catalyst in the Seminoles’ 41-21 victory over the Cardinals (2-4, 1-2 ACC) at Doak Campbell Stadium. \nPICTURE GALLERY: Check out pictures from the NCAA football game between the Florida State Seminoles and Louisville Cardinals at Doak Campbell Stadium in Tallahassee. \nFisher watched the run — a perfect blend of power and speed — with his mouth wide open, perplexed by the highlight-reel run he should be well accustomed to seeing by now. \n“Just being me,” Cook said with a sheepish grin. “That’s it.” \nCook’s first of two touchdown runs put FSU (6-0, 4-0 ACC) ahead 13-7. It fired up an announced crowd of 71,225, with thousands of students tardily sauntering into the stadium. \nHis second score, from 14 yards out, extended the Seminoles’ lead to 27-14 late in the third period and put the game out of reach. Cook finished with 163 rushing yards on 22 carries and added another 60 yards on four receptions despite dealing with a nagging hamstring pull that caused him to exit the game twice. Jacob Pugh guarantees that FSU will lead country in sacks \nFSU linebacker Jacob Pugh, high off strong showing over Louisville, guaranteed that his team will lead the country in sacks. \nFSU linebacker Jacob Pugh, high off strong showing over Louisville, guaranteed that his team will lead the country in sacks. See more videos \n“Once we get that momentum, there’s nothing that can stop us. That put a spark in us,” Whitfield said of Cook’s first touchdown run. “He’s a just a freak of nature. That’s all I can say.” \nCook, who now has 955 rushing yards and 10 touchdowns this season, left teammates and Louisville players alike stunned with his performance. \nThe Miami native invigorated the Seminoles, but it took a complete performance to knock out a feisty Louisville squad. \nThe Cardinals went ahead 7-3 at the 2:20 mark in the first quarter, with freshman quarterback Lamar Jackson floating an 18-yard touchdown pass to receiver James Quick. The Seminoles had back-to-back breakdowns in coverage after starting nickel back Trey Marshall left the game due to an arm injury. \nFSU was held to 150 yards of total offense in the first half and went into the break trailing 7-6. \n“I think you saw a tale of two halves,” Fisher said. “I think you saw what a team can do in the first half when it’s not totally focused or presses itself, and obviously focus was the issue.” \nThe Seminoles showed glimpses of what they could be, scoring touchdowns on their first five drives of the second half. \nLouisville initially responded well to Cook’s touchdown scamper, answering immediately with a 19-yard score from Jackson to Quick. The duo combined for three touchdowns on the afternoon and Jackson finished with 307 passing yards while completing 20 of 35 attempts. \nWhitfield built FSU’s lead to 27-14 on a 70-yard touchdown reception mid-way through the third period. Quarterback Everett Golson — who threw for 372 yards and three touchdowns despite feeling pressure from a stout Louisville defense most of the game — found the speedy receiver on a check-down throw and then watched him take off for the score. \nFSU then stifled Louisville’s comeback attempt on the next drive when freshman safety Derwin James came off the edge to sack Jackson and forced a fumble. Seminoles freshman defensive end Josh Sweat recovered the ball. Florida State got to Jackson five times and held the dynamic runner to 32 rushing yards. \nCook scored his second touchdown of the game three plays after James’ fumble. \n“They don’t know how good they are,” Fisher said of his underclassman-heavy squad. “They’re a really good team that if it goes and relaxes and plays, it can do what it wants to do.”", "external_links": [], "published": "2015-10-18T01:19:00.000+03:00", "crawled": "2015-10-18T03:01:42.974+03:00", "highlightTitle": ""}