{"organizations": [], "uuid": "45d921b775e295c1769776f63433d8cd1ed51394", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegram.com", "main_image": "http://www.telegram.com/storyimage/WT/20151004/SPORTS/151009556/AR/0/AR-151009556.jpg&MaxW=1200&MaxH=630", "site_section": "http://www.telegram.com/sports?template=rss&mime=xml", "section_title": "Sports - telegram.com", "url": "http://www.telegram.com/article/20151004/SPORTS/151009556/101360/NEWS?rssfeed=true", "country": "US", "title": "Red Sox Notes: Boston logs back-to-back seasons in last place for first time since 1929-30", "performance_score": 0, "site": "telegram.com", "participants_count": 1, "title_full": "Red Sox Notes: Boston logs back-to-back seasons in last place for first time since 1929-30", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T05:04:00.000+03:00", "replies_count": 0, "uuid": "45d921b775e295c1769776f63433d8cd1ed51394"}, "author": "Tim Britton @TimBritton", "url": "http://www.telegram.com/article/20151004/SPORTS/151009556/101360/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "Red Sox Notes: Boston logs back-to-back seasons in last place for first time since 1929-30", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Tim Britton@TimBritton Posted Oct. 4, 2015 at 9:03 pm Updated at 9:04 PM CLEVELAND — The Red Sox closed out their season with a disappointing sweep at the hands of the Indians. Cleveland finished it off on Sunday with a 3-1 victory. Boston's offense went cold over the final days of the season. In losing their final four games of the season, the Red Sox scored a total of four runs. Their only tally on Sunday came when Xander Bogaerts and David Ortiz doubled consecutively in the first inning. Ortiz then made the final out of the inning by attempting to steal third. Ortiz finished the year with a .913 OPS, 37 home runs and 108 RBIs. Bogaerts closed his breakout campaign with 196 hits, good for second in the American League. \"It definitely would have been a nice accomplishment,\" Bogaerts said of reaching the 200-hit milestone. \"I'm obviously extremely happy with the way my season has been and how we played down the stretch. It's a lot of excitement going into next year.\" Rick Porcello took his 15th loss of the season despite a solid afternoon. Porcello's biggest mistake was an errant pickoff throw to first base in the third inning that assisted two Indians runs. The right-hander went seven innings, allowing three runs (two earned) on 10 hits. He lowered his ERA below 5, finishing the year at 4.92. \"That's me,\" Porcello said of his encouraging final six weeks. \"I'm not going to go out there and strike out 17 and throw no-hitters (like the Nationals' Max Scherzer), but I'll give us a chance to win. I was able to finish strong. Take some positives out of that, learn a little bit and carry that into next year.\" The Red Sox finished the season at 78-84, alone in last place in the American League East for the second straight time and the third time in four years. Boston had not finished last in consecutive seasons since 1929-1930. \"Collectively, we're pushing forward, and everything is looking very bright for a solid 2016,\" manager Torey Lovullo said. \"I think we built a lot of this foundation here this year with some young score players. We're ready to move forward in advance to next season.\" Tribute to Orsillo Following the final out of Sunday's season finale, the Red Sox exited the visiting dugout at Progressive Field and tipped their caps to departing broadcaster Don Orsillo. \"Thank you, boys,\" Orsillo said as he waved down to the players and placed his hand over his heart. \"Orsillo rounding third and heading home.\" \"That was something that we collectively thought would be a very nice gesture for Don,\" Lovullo said. \"He means a lot to all of us in different ways, but he means so much to the community and to the Boston Red Sox. We just wanted to acknowledge him for his hard work and all that dedication.\" \"We were happy to do it just to show him a little bit of love and respect for what he's done for us,\" said Brock Holt. \"He loves what he does, and he's really good at it. Just being around him, he's a good person. We're going to miss him, and everyone that watches him on TV is going to miss his voice calling the games, for sure.\" NESN did not renew Orsillo's contract, starting a firestorm of criticism in August. Earlier this week, it was announced that Orsillo will become part of the broadcast team for the San Diego Padres in 2016. A leaner Hanley? The Red Sox have asked Hanley Ramirez to lose 15 to 20 pounds this offseason in order to be better suited to the infield, Lovullo said Sunday. \"It was outlined in his exit physical that he comes in at a certain weight. That's our expectation,\" Lovullo said. \"We all know when you carry extra weight, it puts more stress on your joints. To be an infielder you have to be a little more agile.\" Lovullo wanted to make it clear that Boston has these year-end conversations with every player about conditioning. That also includes Pablo Sandoval. \"We're keeping an eye on our athletes. We don't just let them go home and do nothing,\" Lovullo said. \"They're on a program they follow and they're expected to follow. It's part of being on the Boston Red Sox. You come to spring training ready to go.\" Beyeler out The Red Sox aren't bringing back every member of their coaching staff. The team announced Sunday morning that first base coach Arnie Beyeler would not be retained for 2016. Informed of the decision on Saturday night, Beyeler coached first for the Red Sox on Sunday. He also brought out the lineup card. \"I just really wanted to change a little bit of the mixture on (the coaching staff),\" president of baseball operations Dave Dombrowski said. \" I feel in Arnie's case, he's done a great job in so many ways. He took the news as well as you possibly can. He's a good person. He's worked hard. He's been a Red Sox person. We just wanted to make a change on the staff in a direction, and that's the one we decided to go on.\" \"Arnie has been so dedicated, so loyal, and is one of the hardest-working coaches that I've ever been around,\" Lovullo said. \"He spends so much time watching video, positioning guys. He does a great job with their footwork and fundamental and getting them out there and drilling them. He also does a great job controlling our running game. \"I'm sorry to see him move on, sorry to see that decision, but as we all know in this game, things change quickly and there's reasons for a change. Arnie will be just fine. He'll land on his feet again. He's a very qualified coach.\" Beyeler was disappointed, but understanding of the decision. \"I was disappointed without a doubt, but that said, I have nothing but good things to say about these guys,\" said Beyeler, who has been with the Red Sox organization for nine seasons. \"To get a chance to bring me up here on the big-league staff was a dream come true. I had a nice ride out of that.\" It's hard not to see Beyeler as a kind of scapegoat for the failure of Ramirez to take to left field. Boston's outfield coordinator, Beyeler oversaw Ramirez's disastrous conversion to left. He was also criticized by Yoenis Cespedes after the outfielder was traded to Detroit last offseason. At the same time, Beyeler was the man in charge when Brock Holt and Mookie Betts transitioned seamlessly to the outfield. \"I can look in the mirror walking out of here and I did the best I could do while I was here,\" Beyeler said. \"When you finish in last place, things can change, guys get moved, people get fired. That's the nature of the business.\" Beyeler said he did not believe the problems with Ramirez were the deciding factor in the organization's decision to move on. \"I didn't get that feeling at all,\" he said. \"(Dombrowski) just said they needed to make a change. My spot was the one that they decided to change. I've been in this situation before and something good came out of it.\" Beyeler had been on the major-league staff for three seasons. Prior to that, he had managed for six years in the system — four of them in Portland and two in Pawtucket. He won the Governors' Cup in 2012 with the PawSox.", "external_links": [], "published": "2015-10-05T05:04:00.000+03:00", "crawled": "2015-10-05T04:49:54.261+03:00", "highlightTitle": ""}