{"organizations": [], "uuid": "69df682f5740ebe1b35b6e4cbe53eb99e9e8664b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.detroitnews.com", "main_image": "http://www.gannett-cdn.com/-mm-/e0e6eebcec01acd20bcb33d4e4c62476792c8682/c=0-96-1314-838&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/12/DetroitNews/DetroitNews/635802565157502604-MS.jpg", "site_section": "https://feeds.feedblitz.com/detroit/sports", "section_title": "Detroit News - Sports", "url": "http://www.detroitnews.com/story/sports/nfl/lions/2015/10/12/stafford-wont-be-on-short-leash-now-or-in-future/73825720/", "country": "US", "title": "Stafford won't be on short leash, now or in future", "performance_score": 0, "site": "detroitnews.com", "participants_count": 3, "title_full": "Stafford won't be on short leash, now or in future", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T17:25:00.000+03:00", "replies_count": 2, "uuid": "86d3912f57527b00e3756e14bbe093c7c78dd092"}, "author": "detroitnews.com", "url": "http://www.detroitnews.com/story/sports/nfl/lions/2015/10/12/stafford-wont-be-on-short-leash-now-or-in-future/73825720/#post-0", "ord_in_thread": 0, "title": "Stafford won't be on short leash, now or in future", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Matthew Stafford throws in the second quarter Sunday. (Photo: Daniel Mears, Detroit News) \nCONNECT 4 TWEET LINKEDIN 1 COMMENT EMAIL MORE Allen Park — The Lions benched Matthew Stafford for poor play for the first time in his career Sunday, but coach Jim Caldwell said Monday the quarterback won't be on a shorter leash, so to speak, moving forward.\n\"He's never been on a leash,\" Caldwell said during his news conference. \"He's never been on any sort of a leash, and he won't be in the future.\"\nStafford remains the Lions' starting quarterback despite the coaches pulling him in the third quarter of the team's 42-17 loss to the Arizona Cardinals at Ford Field.\nThe 27-year-old Stafford ranks at the bottom among NFL quarterbacks in two key efficiency statistics — 33rd in passer rating and 34th in yards per attempt. He's 17th in completion percentage, 15th in passing yards, tied for 16th in touchdowns and leads the NFL with eight interceptions.\nDETROIT NEWS\nCaldwell on Ford family: 'They're not happy'\nYet, Caldwell still thinks Stafford can \"certainly\" be fixed as a quarterback, saying Sunday's disaster in which he threw three interceptions was just one game.\n\"There's still time,\" he said of Stafford turning his career around. \"I'm not closing the door on it. At this particular time, there's not anybody that's playing as well as we think they're capable — save for a few guys here and there obviously. But, still, he's relatively a young quarterback in this league, so he's still got time.\"\nStafford finished Sunday's game 20 of 32 for 188 yards and one touchdown, and his interceptions were thrown right at Cardinals defenders. He said after the game that Caldwell told him at halftime if he threw a third interception his day would be over, and after chucking one to cornerback Patrick Peterson on the Lions' first third-quarter drive, Stafford had to watch Dan Orlovsky lead the offense.\n\"One of the things, to be candid with you, is the fact that any time you have play going on like that I certainly think it warrants some changes,\" Caldwell said of pulling Stafford. \"And so that's the one (change) that we decided yesterday, and today is a little different. He still is our starting quarterback, but I'm just certainly not interested in watching those kinds of performances consistently.\"\nAnd Caldwell thinks sticking with Stafford is the right move for the Lions.\n\"He's one of those guys that I think is a real competitor, and I think you'll see him work at improving across the board,\" he said. \"But it's not just him, he needs some help as well.\"\njkatzenstein@detroitnews.com \ntwitter.com/jkatzenstein", "external_links": [], "published": "2015-10-12T17:25:00.000+03:00", "crawled": "2015-10-12T21:49:57.654+03:00", "highlightTitle": ""}