{"organizations": [], "uuid": "3e82022938bbb03b90d8a73dcebed37126d1eb89", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-5621b82f/turbine/ct-cubs-haugh-spt-1017-20151016", "site_section": "http://www.chicagotribune.com/", "section_title": "Chicago Tribune: Chicago breaking news, sports, business, entertainment, weather and traffic - Chicago Tribune", "url": "http://www.chicagotribune.com/sports/columnists/ct-cubs-haugh-spt-1017-20151016-column.html", "country": "US", "title": "Joe Maddon vs. Terry Collins: Different types with complementary styles - Chicago Tribune", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Joe Maddon vs. Terry Collins: Different types with complementary styles - Chicago Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T05:55:00.000+03:00", "replies_count": 0, "uuid": "3e82022938bbb03b90d8a73dcebed37126d1eb89"}, "author": "David Haugh", "url": "http://www.chicagotribune.com/sports/columnists/ct-cubs-haugh-spt-1017-20151016-column.html", "ord_in_thread": 0, "title": "Joe Maddon vs. Terry Collins: Different types with complementary styles - Chicago Tribune", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "One day during the 1997 baseball season, back before defensive shifts were commonplace, ingenious Angels bench coach Joe Maddon walked into manager Terry Collins' office to suggest moving three infielders to the right side of second base when Ken Griffey Jr. batted.\nMaddon came armed with spray charts for Collins and other numbers crunched with one of the few computers the Angels used then for scouting. Two other aspects of that encounter still stand out to Maddon: the presence of late Hall of Fame manager Sparky Anderson, an Angels broadcaster at the time, and the immediate reaction of Collins.\n\"I told him what I thought and he was all for it,'' the Cubs manager recalled Friday at Citi Field, where his team will play Collins' Mets on Saturday night in Game 1 of the National League Championship Series. The battle for the NL pennant pits two old buddies with starkly different personalities who have known each other for 34 years and plotted strategy side-by-side in the Angels dugout from 1997-99.\n\"It was the start of the computer age in baseball and Joe was into the computers,'' Collins said of his first staff member who typed the lineup instead of writing it. \"When I interviewed him and saw his organization, preparation and personality, I said, 'This is the guy.'''\nAlmost two decades later, Cubs fans emphatically say the same thing about one of baseball's biggest innovators, a bold thinker whose time under Collins helped build confidence in his instincts. Maddon's abstract style complemented Collins' paint-by-number approach, his affability a nice counter to Collins' brusqueness. Even now, neither man has changed much as the loose Cubs and the grinding Mets reflect their managers — opposites chasing the same goal, two smart baseball men who always understood each other.\n\"He gave me a lot of latitude, permitted me to work,'' Maddon said of Collins, the majors' oldest manager at 66 making his first postseason appearance. \"If I had a bunch of information, I would just stand there and read it to him before the game and he would never forget anything. He has a really great mind.''\nThe Angels thought so in October 1996 when they hired Collins as their manager over Maddon and six other candidates. Fresh off a firing from the Astros, Collins wanted to surround himself with at least a few coaches in-house to ease his transition. He asked several Angels players for input at his introductory news conference. The same name kept coming up: Maddon, the Angels' popular first-base coach from 1994-96.\nCollins had known Maddon since 1981 when both were Class A managers — Collins at Lodi (Calif.) and Maddon at Idaho Falls — and considered him as intelligent as he was upbeat. But for Maddon to remain in the Angels organization he had been part of since 1976, he had to convince Collins during an interview at the Biltmore Hotel in Phoenix.\n\"Believe me, man, that was a big moment for me otherwise I could have been sent out in the minor leagues again,'' Maddon said. \"I was always grateful for T.C. for giving me that opportunity.''\nYou might say Collins gave Maddon a chance to prove himself at the end of his tenure too. When Collins resigned with 29 games to go in the 1999 season after losing control of the clubhouse, Maddon finished 18-11 as the team's interim manager.\nMarcel Lachemann, the Angels pitching coach under Collins, chuckled recalling how Maddon made an impression on players then much the same way he does now. It was the same quality that compelled Lachemann to give Maddon his first job on a major-league staff in 1994 when he hired him as the Angels first-base coach during Lachemann's stint as manager.\n\"Joe's extremely optimistic, as everybody in Chicago knows by now,'' Lachemann said from his home in California. \"I always have said this about Joe: He could step in a pile of (crap), look at the bottom and say, 'Damn, I can take this and fertilize my lawn.' Terry, on the other hand, was different, more intense. He needed somebody like Joe to balance it out.''\nNothing illustrated those differences better Friday than the managers' responses to the same question from a member of the national media about 1969, when the Cubs infamously collapsed as the \"Miracle Mets\" won the World Series.\nMaddon fondly remembered watching \"Kiner's Korner,'' post-game show on WOR-TV as a ninth-grader in Hazleton, Pa., meeting '69 Mets reliever Tug McGraw and calling outfielder Cleon Jones his favorite Met.\n\"It was quite a time, man, the way (the Mets) came back,'' Maddon said. \"It was a pretty special moment for the Mets, just as a young baseball fan.''\nIn contrast, Collins — having slept just a few hours following an all-night, cross-country flight from Los Angeles after dispatching the Dodgers — felt less like reminiscing.\n\"1969?! People in this room weren't even born in 1969,'' Collins snapped. \"I was trying to graduate from college.''\nThe biggest test of Collins' career begins now. How fun that the outcome could depend on what manager has all the answers, Collins or the guy who used to give him advice.\ndhaugh@tribpub.com\nTwitter @DavidHaugh\nPrivacy Policy Copyright © 2015, Chicago Tribune Major League Baseball Joe Maddon Los Angeles Angels New York Mets Chicago Cubs Terry Collins Houston Astros", "external_links": ["http://www.tribpub.com/privacy-policy-and-your-privacy-rights/", "http://www.trbimg.com/img-5621b82f/turbine/ct-cubs-haugh-spt-1017-20151016"], "published": "2015-10-17T05:55:00.000+03:00", "crawled": "2015-10-17T07:33:13.451+03:00", "highlightTitle": ""}