{"organizations": [], "uuid": "cec98fac092b56370f04225b13d913634a10b0f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "http://s4.reutersmedia.net/resources/r/?m=02&d=20151024&t=2&i=1089415369&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB9N04V", "site_section": "http://www.reuters.com/news/sports", "section_title": "Sports News, Highlights &amp; Coverage | Reuters.com", "url": "http://www.reuters.com/article/2015/10/24/us-tennis-women-finals-sharapova-idUSKCN0SI09J20151024", "country": "US", "title": "Sharapova wary of Finals chances after injury-hit season", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Sharapova wary of Finals chances after injury-hit season | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T14:35:00.000+03:00", "replies_count": 0, "uuid": "cec98fac092b56370f04225b13d913634a10b0f6"}, "author": "John O'Brien", "url": "http://www.reuters.com/article/2015/10/24/us-tennis-women-finals-sharapova-idUSKCN0SI09J20151024", "ord_in_thread": 0, "title": "Sharapova wary of Finals chances after injury-hit season", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SINGAPORE Maria Sharapova is renowned for her sheer determination in the face of adversity but in Singapore on Saturday, the Russian was quick to cast doubt over her chances of winning the WTA Finals after an injury-ravaged second half of the season.\nThe 28-year-old enjoyed a positive start to her campaign by reaching the Australian Open final, which she lost to Serena Williams, before her regular season effectively ended with a Wimbledon semi-final defeat to the same opponent.\nA leg strain ruled Sharapova out of the U.S. Open and she pulled out of her comeback match in Wuhan with a forearm injury last month, opting to return to Europe to convalesce before arriving in Singapore wary of her chances of victory.\n\"I've done quite a few start and stops in the last four months, that's kind of been the toughest part, but ultimately, I know that a lot of the girls have been fighting for the last few positions in the last few weeks,\" Sharapova told reporters.\n\"I've had the luxury by being somewhat consistent in the first half of the year to give myself the opportunity just to heal, knowing I was already in, doing everything I could not having to rush around, seeing if I could play through a tough injury or not.\n\"So, yeah, that's been helpful, but obviously frustrating not competing.\"\nWhen Williams opted to skip the Singapore event after ending her season early following her shock U.S. Open semi-final loss, the eight-women tournament was thrown open but Sharapova does not expect to benefit from the American's absence.\n\"Look, it's a big step for me to be here and feel that I am healthy,\" added Sharapova, who will compete round robin play in the Red Group alongside Simona Halep, Agnieszka Radwanska and U.S. Open champion Flavia Pennetta.\n\"It will be a bigger step that I'll be able to compete in those three matches and finish them off healthy. That's my goal,\" the world number three said.\n\"Everything else I just have to take the positives out of because I feel I've committed myself to being here and done everything possible.\n\"If I can stay healthy and work my way through the matches no matter who I'm playing, in this particular situation I have to worry about myself a little bit more than who I'm playing against.\"\nThe five-times grand slam tournament champion won the WTA Finals for her first and only time back in 2004 but she does not see herself as the player to beat when the tournament begins at the Singapore Indoor Stadium on Sunday.\n\"That's not the way that I think. I don't think it would be fair to myself if I thought that way,\" she admitted. \"I'm one of the eight players. I did something to be in the field. I want to take my opportunity and that's how I see it from my side.\"\nGarbine Muguruza, Petra Kvitova, Angelique Kerber and Lucie Safarova are the quartet who make up the White Group.\n(Editing by Sudipto Ganguly )", "external_links": [], "published": "2015-10-24T14:35:00.000+03:00", "crawled": "2015-10-24T14:11:08.135+03:00", "highlightTitle": ""}