{"organizations": [], "uuid": "e4ef4e411698302480b7c8fcfb831c776265caa9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cincinnati.com", "main_image": "http://www.gannett-cdn.com/-mm-/f135272a321fd27c8d3d3379121c4afad27b3b16/c=0-66-2000-1191&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/18/USATODAY/usatsports/e3ac4311d941342e850f6a7067005f32.jpg", "site_section": "http://www.cincinnati.com/sports/", "section_title": "Cincinnati Sports", "url": "http://www.cincinnati.com/story/sports/nfl/2015/10/18/browns-waste-chances-lose-26-23-in-ot-to-manning-broncos/74193922/", "country": "US", "title": "Browns waste chances, lose 26-23 in OT to Manning, Broncos", "performance_score": 0, "site": "cincinnati.com", "participants_count": 1, "title_full": "Browns waste chances, lose 26-23 in OT to Manning, Broncos", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:29:00.000+03:00", "replies_count": 0, "uuid": "e4ef4e411698302480b7c8fcfb831c776265caa9"}, "author": "AP", "url": "http://www.cincinnati.com/story/sports/nfl/2015/10/18/browns-waste-chances-lose-26-23-in-ot-to-manning-broncos/74193922/", "ord_in_thread": 0, "title": "Browns waste chances, lose 26-23 in OT to Manning, Broncos", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Photo: The Associated Press)\nCONNECT 2 TWEET LINKEDIN COMMENT EMAIL MORE CLEVELAND (AP) — For the Browns, it always seems to end in heartbreak against the Broncos.\nThe Denver drought endures.\nJosh McCown threw a costly interception in the final minute of regulation and the Browns couldn't capitalize on intercepting Peyton Manning three times as they lost 26-23 in overtime Sunday to the Broncos, who have won 11 straight over Cleveland.\nMcCown, who played so brilliantly last week in an overtime win at Baltimore, had the Browns driving for a potential game-winning field goal when he inexplicably forced a pass that was intercepted with 44 seconds left in regulation.\nOn second down at the Denver 46, McCown rolled right from pressure and looked downfield. But instead of throwing the ball away and keeping the drive alive, McCown threw it into traffic and was picked by safety David Bruton Jr.\n\"I was stepping up trying to throw the ball out of bounds and avoid a sack so we could keep moving up to get in field-goal range and win this thing,\" McCown said. \"I just didn't get enough on the ball when I threw it. It just makes me sick because there is an opportunity there in regulation to win.\"\nThe Browns (2-4) had another chance in overtime, when Barkevious Mingo intercepted Manning and returned it to the Denver 39.\nCleveland only needed 10 yards or so to give kicker Travis Coons a chance to hand the Broncos (6-0) their first loss. But running back David Turbin was thrown for a 3-yard loss and McCown was sacked on consecutive plays, forcing Cleveland to punt.\nGiven a third chance, Manning drove the Broncos from their 12 to set up a 34-yard field goal by Brandon McManus with 4:56 left in OT. The Browns haven't beaten the Broncos since 1990, and prior to that regular-season win, Cleveland lost to Denver in three AFC title games in four years.\nThis loss didn't sting like those, but McCown and his teammates were hurting from a win that slipped away.\n\"It's just a huge missed opportunity,\" said McCown, who finished 20 of 39 for 213 yards and threw two TD passes to Gary Barnidge.\n\"We'll feel like that for the next 24 hours or so. Then, we have to bounce back and respond. We felt this same way walking into the locker room out in San Diego (a 30-27 loss). We felt like we had missed opportunity and we responded, and we have to do the same thing.\"\nDown 10-0 at halftime, the Browns chipped away and finally took the lead when linebacker Karlos Dansby grabbed a pass bobbled by Broncos running back Ronnie Hillman and returned it 35 yards for a touchdown with 8:07 left.\nBut Cleveland's lead lasted all of 14 seconds as Manning countered with a 75-yard TD pass to Emmanuel Sanders, who streaked past Browns cornerback Tramon Williams to make it 23-20.\nCoons kicked a 26-yard field goal with 1:30 left in regulation to tie it, and the Browns got the ball back when they forced the Broncos to punt after a series that lasted 19 seconds.\nMcCown's 14-yard completion moved the ball to the Denver 46 before Cleveland's 36-year-old QB, who has shown a tendency to try to do too much, made his costly mistake.\nMcCown accepted blame for the loss.\n\"I walk out of these things putting it all on me and go, 'Man, if I would have been better, we would have won the game,'\" he said. \"That's just how I'm wired.\"\nOnce again, Cleveland's defense didn't do enough.\nHillman rushed for 111 yards as Denver picked up 152 on the ground. The Browns gave up 111 yards receiving to Demaryius Thomas and 109 to Sanders. Also, Cleveland did not sack Manning, who passed for 290 yards.\n\"To be on the brink of a heck of a win and to not be able to finish it, it is a tough deal,\" coach Mike Pettine said. \"Looking at players' faces, you just see disappointment. Playing a team like that, they minimalize your margin for error. We just made too many mistakes to come away with a win.\"\nNOTES: Barnidge is the first Browns TE to score a TD in four straight games since Hall of Famer Ozzie Newsome in 1981. ... Dansby leads all active NFL linebackers with 18 career interceptions and five TD returns. ... The last time the Browns played consecutive overtimes games was in 2009. ... CB Joe Haden (concussion) and S Tashaun Gipson (ankle) were inactive. ... RB Robert Turbin made his Browns debut and had 27 yards on 12 carries.\n___\nAP NFL website: www.pro32.ap.org and www.twitter.com/AP_NFL\nCONNECT 2 TWEET LINKEDIN COMMENT EMAIL MORE Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.\nRead //usat.ly/1RQsgPm", "external_links": ["http://usat.ly/1RQsgPm", "https://twitter.com/intent/tweet?url=http%3A//usat.ly/1RQsgPm&text=Browns%20waste%20chances%2C%20lose%2026-23%20in%20OT%20to%20Manning%2C%20Broncos&via=enquirer", "http://www.gannett-cdn.com/-mm-/e9ad9e0015f06e209809356f7d9970b868ff273e/c=162-0-1838-1257&r=x404&c=534x401/local/-/media/2015/10/18/USATODAY/usatsports/e3ac4311d941342e850f6a7067005f32.jpg", "http://www.linkedin.com/shareArticle?url=http%3A//usat.ly/1RQsgPm&mini=true"], "published": "2015-10-19T03:29:00.000+03:00", "crawled": "2015-10-19T06:39:13.990+03:00", "highlightTitle": ""}