{"organizations": [], "uuid": "7fae951978d03fb668a1dc6f003bad0053404fe8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.staradvertiser.com", "main_image": "http://media.bclocalnews.com/images/20150218_spo_furtherrev.jpg", "site_section": "http://www.staradvertiser.com/sports/breaking/index.rss", "section_title": "Breaking-Sports", "url": "http://www.staradvertiser.com/sports/breaking/20150930_Ioane_named_honorary_captain_for_host_Boise_State_against_UH.html", "country": "US", "title": "Ioane named honorary captain for host Boise State against UH", "performance_score": 0, "site": "staradvertiser.com", "participants_count": 10, "title_full": "Ioane named honorary captain for host Boise State against UH - Hawaii News - Honolulu Star-Advertiser", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T01:08:00.000+03:00", "replies_count": 9, "uuid": "b99997277b7fdbf7c493e572ef01667f2a50db7c"}, "author": "Dave Reardon", "url": "http://www.staradvertiser.com/sports/breaking/20150930_Ioane_named_honorary_captain_for_host_Boise_State_against_UH.html#post-0", "ord_in_thread": 0, "title": "Ioane named honorary captain for host Boise State against UH", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BOISE, Idaho >> Punahou and Boise State standout Jeremy Ioane will be an honorary captain for the Broncos on Saturday when they host Hawaii in the Mountain West Conference football opener for both schools, a BSU athletics official confirmed today. On May 5, Ioane received a kidney transplant from his twin sister, Jasmine. His kidney function had been getting progressively worse for nearly three years due to a rare disease called IgA nephropathy.\nHe played last season despite undergoing regular dialysis treatment, and his illness was not publicly disclosed until two days before the last game of the season. Ioane also managed to graduate despite the illness that often left him listless.\nJasmine Ioane, also a star athlete at Punahou, is a recent graduate of Weber State where she played softball. She is also scheduled to be honored at Broncos Stadium on Saturday.\nBoth siblings told the Honolulu Star-Advertiser today that they feel fine nearly five months after their surgeries. Jeremy has been in Hawaii, spending time working out and helping to coach defensive backs at Punahou. Jasmine lives in Boise and recently started a full-time job.\n\"I'm good,\" said Jeremy, who at 175 pounds now has regained about half of the weight he lost due to the illness. \"I'm coming (to Boise) on Friday, hopefully. I'm going to be flying standby.\"\nSaid Jasmine: \"For the most part I feel like I didn't even have surgery.\"\n ", "external_links": [], "published": "2015-10-01T01:08:00.000+03:00", "crawled": "2015-10-02T01:58:19.150+03:00", "highlightTitle": ""}