{"organizations": [], "uuid": "4badbf4b062d2f358cadd54d36692074deb0ee40", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kirotv.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/20/58/ce/horne.jpg", "site_section": "http://www.kirotv.com/", "section_title": "Seattle News, Weather, Traffic, Video and Sports | KIRO 7... | www.kirotv.com", "url": "http://www.kirotv.com/news/news/pot-business-owners-say-city-targetting-them/nn6r6/", "country": "US", "title": "Pot business owners say city targetting them", "performance_score": 0, "site": "kirotv.com", "participants_count": 1, "title_full": "Pot business owners say city targetting them | www.kirotv.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:56:00.000+03:00", "replies_count": 0, "uuid": "4badbf4b062d2f358cadd54d36692074deb0ee40"}, "author": "kirotv.com", "url": "http://www.kirotv.com/news/news/pot-business-owners-say-city-targetting-them/nn6r6/", "ord_in_thread": 0, "title": "Pot business owners say city targetting them", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ryan Kunkel, owner of \"Have a Heart Cafe,\" says he has worked hard to comply with Seattle's new medical marijuana law.\n\"We found edible companies that would darken their products and make the colors benign so they don't appeal to children,\" he said, pointing to his \"pot\" lozenges.\nThe law, which took effect Aug. 17, is designed to close medical marijuana dispensaries that opened after recreational pot became legal in Washington state.\n\"We were open before 2013,\" said Kunkel. \"We're compliant. We have testing. We have done all of the recommendations the city made in its resolution.\"\nBut Monday, his dispensary on Aurora Avenue, was visited by an inspector from the city's Department of Finance and Administrative Services.\nShe left a citation : accusing him of operating without a valid marijuana business license. It has happened at all three of his businesses.\n\"The enforcement resolution was supposed to go out to the out -of-compliance store fronts and recreational delivery services,\" Kunkel insisted, \"not the stores that are in compliance like myself.\"\nHe was asked if he believes the city is harassing him. \"Correct,\" he said.\nJohn Davis says the city hasn't bothered him nor the two medical marijuana businesses he owns, including this one in West Seattle.\n\"No, no,\" he said, \"I haven't been cited.\"\nIndeed, he defended the city.\n\"They're not out to get anyone,\" he said. \"It's a matter of going through the process. They're simply trying to... figure out what is black market and what is legal.\"\nThe city of Seattle admitted late Tuesday that the inspector made a mistake.\nKunkel's business should not have been cited but a spokeswoman insists the inspectors are not singling him out, that they are just trying to enforce a brand new law.", "external_links": ["http://w.sharethis.com/button/buttons.js"], "published": "2015-10-21T03:56:00.000+03:00", "crawled": "2015-10-21T07:15:05.620+03:00", "highlightTitle": ""}