{"organizations": [], "uuid": "dd04c7a2388b8b63ad6475f3a65da66ed5bf39db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.coloradodaily.com", "main_image": "http://extras.mnginteractive.com/live/media/site29/2015/1021/20151021__22BZMBBw~1.jpg", "site_section": "http://feeds.coloradodaily.com/mngi/rss/CustomRssServlet/25/219106.xml", "section_title": "Sports", "url": "http://www.coloradodaily.com/sports/ci_29003443/cu-mens-basketball-weight-lifted-buffs-dom-collier?source=rss", "country": "IL", "title": "CU men's basketball: Weight lifted for Buffs' Dom Collier", "performance_score": 0, "site": "coloradodaily.com", "participants_count": 1, "title_full": "CU men's basketball: Weight lifted for Buffs' Dom Collier", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T00:59:00.000+03:00", "replies_count": 0, "uuid": "dd04c7a2388b8b63ad6475f3a65da66ed5bf39db"}, "author": "Pat Rooney \n\nBuffZone.com Writer", "url": "http://www.coloradodaily.com/sports/ci_29003443/cu-mens-basketball-weight-lifted-buffs-dom-collier?source=rss", "ord_in_thread": 0, "title": "CU men's basketball: Weight lifted for Buffs' Dom Collier", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CU men's basketball: Weight lifted for Buffs' Dom Collier Sophomore says pressure is off after high expectations in first year \nBuffZone.com Writer Posted: 10/21/2015 03:36:18 PM MDT \nDom Collier saw all the success being enjoyed by Josh Scott and figured he was next in line. \nCollier's credentials were similar, and perhaps even loftier, than Scott's when he arrived at CU's campus a little more than a year ago. Like Scott, Collier was a homegrown star, leading Denver East to a lopsided win in the 2014 Class 5A state championship game on the very same Coors Events Center floor Collier would soon call home. \nIt was a script Collier was ready to embrace, the local prep standout eager to follow in Scott's footsteps to continue the winning ways at the state's biggest Division I program. Colorado basketball players Josh Scott, left, and Dominique Collier talk to reporters on media day Wednesday. ( Cliff Grassmick / Staff Photographer ) \nUnfortunately for Collier and the Buffs, nearly everything that could have gone wrong for the Denver native pretty much did during his freshman campaign. Injuries and inconsistent play soon dampened the expectations for Collier, and heading into his sophomore season CU's guard admits he allowed the pressure of being a homegrown star to weigh him down somewhat as a rookie. \n\"Yeah, coming in I'm seeing Josh have such a good year his freshman year, so I really wanted to match that,\" Collier said. \"Just hearing everyone from home and Boulder talking about if I'm ready to have a good year, I put a lot of pressure on myself. But now, all the pressure is off. I'm ready to play this year.\" Advertisement \nAfter averaging at least 20 points each season from his sophomore through senior years at Denver East, Collier made the first two 3-point attempts of his career while finishing 2 of 3 from 3-point range in his CU debut at Wyoming. Unfortunately for Collier, he never again shot that well from long range the remainder of the season. \nCollier averaged 19.3 minutes in 30 games, but shot just .345 from the floor — a mark that included a frustrating 26.9 percent (18 for 67) from 3-point range. Though he ranked fourth on the team in assists, Collier also committed 38 turnovers while battling nagging injuries. \nHealthy once again and far more comfortable in Boulder than he was a year ago, Collier believes he is ready to produce in the manner he originally envisioned. \n\"Last year, I feel like I didn't play well enough to be on anyone's radar,\" Collier said. \"Now it's just time for me to just go out there and play basketball and show people what I can do.\" \nDuring Wednesday's annual media day gathering at the Coors Events Center, head coach Tad Boyle admitted the strength of his club resides in the front court, with question marks surrounding the team along the perimeter. A more comfortable, more confident Collier could provide one answer to those questions. \n\"I had conversations with Dom at this time about not putting too much pressure on yourself, because I do think there is that element when you're local, and you've been blown up for the last three years as a high school player in the area, there's some pressure that goes with that,\" Boyle said. \"The conversation this offseason and certainly right now turns to confidence. So there's again that fine balance where, 'Hey, you're a good player, but don't put too much pressure on yourself,' to, 'You have to believe in yourself.' \n\"That's where we're at right now. Sometimes you forget ...(with) college kids, you might see the wide bodies and the good players, but their minds are 18, 19 years old. There's some elements that aren't quite developed yet. And I think Dom's a good example. He's still a young man still trying to find himself on a college campus and he's playing in front of 11,000 people.\"", "external_links": [], "published": "2015-10-22T00:59:00.000+03:00", "crawled": "2015-10-22T05:06:48.554+03:00", "highlightTitle": ""}