{"organizations": [], "uuid": "ed28040c45f772c1f42ef21be8ba1c1d43b3e3af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "wtop.com", "main_image": "", "site_section": "http://wtop.com/section/sports/feed/", "section_title": "WTOP » Sections » Sports", "url": "http://wtop.com/nfl/2015/10/vikings-rookie-lb-kendricks-handed-starting-job-over-bye/", "country": "US", "title": "Vikings rookie LB Kendricks handed starting job over bye", "performance_score": 0, "site": "wtop.com", "participants_count": 1, "title_full": "Vikings rookie LB Kendricks handed starting job over bye", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T01:18:00.000+03:00", "replies_count": 0, "uuid": "ed28040c45f772c1f42ef21be8ba1c1d43b3e3af"}, "author": "wtopstaff", "url": "http://wtop.com/nfl/2015/10/vikings-rookie-lb-kendricks-handed-starting-job-over-bye/", "ord_in_thread": 0, "title": "Vikings rookie LB Kendricks handed starting job over bye", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home » News » Sports » NFL » Vikings rookie LB Kendricks… Vikings rookie LB Kendricks handed starting job over bye By JON KRAWCZYNSKI October 12, 2015 6:18 pm \nEDEN PRAIRIE, Minn. (AP) — While most of his Minnesota Vikings teammates got a nice long break during their bye week, rookie linebacker Eric Kendricks got a promotion. \nThe Vikings decided to trade starting middle linebacker Gerald Hodges to San Francisco last week for a backup offensive lineman and a late-round draft pick. The move opened a spot for Kendricks, a second-round draft pick out of UCLA. \n“I just know the situation I’m given right now, and that’s a great opportunity,” Kendricks said on Monday after the Vikings returned to work. “I’m just going to take that and run with it and keep working hard and keep my head down.” \nThe Vikings sent the talented but erratic Hodges to the 49ers for backup center Nick Easton and a sixth-round draft choice. The move allowed the Vikings to add some much needed depth on the offensive line, where starting center John Sullivan is still recovering from back surgery, and add another draft pick for GM Rick Spielman. \nBut it also took away a third-year player who earned the starting job in the middle during training camp. He had 20 tackles in the first four games of the season, but Kendricks had steadily been working his way into more and more playing time as the season was progressing. \n“I think Eric has done a good job and basically he has been a starter,” coach Mike Zimmer said. \nZimmer was tight-lipped about the move on Monday, offering terse answers to several queries about moving Hodges. \n“I didn’t get this many questions when my father died about a guy,” he said, referencing his father’s death in August. \nKendricks has 19 tackles and a sack, and said he is growing more and more comfortable with the transition from UCLA to the NFL. But he wasn’t ready to say that the decision to trade Hodges served as a vote of confidence for his development. \n“I try not to think of it like that,” Kendricks said. “People were texting me and things like that. I just knew that it comes down to me working hard. I always try to prepare for myself the same way every game. I’m not going to change the way I prepare. I guarantee you that.” \nSpielman said Kendricks has proven that he’s ready to handle the workload on a team that has designs on making a playoff run after missing out the last two seasons. The Vikings (2-2) host the Kansas City Chiefs (1-4) on Sunday. \n“He is a very instinctive football player,” Spielman said of Kendricks after the trade was made last week. “Each week, as you see the more reps he’s getting, the more comfortable he’s getting with the speed of this game. And he makes plays when he’s out there.” \nNOTES: Sullivan, who is on the injured reserve list with designation to return, did some light running in practice on Monday. He said he felt good and hoped to return to practice when he is eligible next week. Sullivan has to miss at least three more games before being eligible to play, per NFL rules. … WR Mike Wallace (knee), WR Charles Johnson (ribs) and S Andrew Sendejo (knee) did not practice. \n___ \nAP NFL website: www.pro32.ap.org and www.twitter.com/AP_NFL Topics:", "external_links": [], "published": "2015-10-13T01:18:00.000+03:00", "crawled": "2015-10-13T01:26:36.416+03:00", "highlightTitle": ""}