{"organizations": ["The Associated Press"], "uuid": "2f712df1d2668b3cbe4476fcbb74f9afc96bdf42", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.durangoherald.com", "main_image": "http://durangoherald.com/storyimage/DU/20151022/SPORTS01/151029828/AR/0/AR-151029828.jpg", "site_section": "http://www.durangoherald.com/section/sports?template=RSS&mime=xml", "section_title": "Sports", "url": "http://www.durangoherald.com/article/20151022/SPORTS01/151029828/-1/sports&source=RSS", "country": "US", "title": "Lindsay Vonn feels ‘awesome’ in return to World Cup form", "performance_score": 0, "site": "durangoherald.com", "participants_count": 0, "title_full": "Lindsay Vonn feels ‘awesome’ in return to World Cup form", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T06:26:00.000+03:00", "replies_count": 0, "uuid": "2f712df1d2668b3cbe4476fcbb74f9afc96bdf42"}, "author": "", "url": "http://www.durangoherald.com/article/20151022/SPORTS01/151029828/-1/sports&source=RSS", "ord_in_thread": 0, "title": "Lindsay Vonn feels ‘awesome’ in return to World Cup form", "locations": ["OELDEN", "Austria", "Germany", "Switzerland", "New Zealand"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Shiffrin", "Mikaela", "Vreni Schneider", "Nicole Hosp", "Marco", "Tina Maze", "Fenninger", "Shinichiro", "Vonn", "Lara Gut", "Mikaela Shiffrin", "Viktoria Rebensburg", "Lindsay Vonn", "Lindsey Vonn", "Anna Fenninger"], "text": "Lindsay Vonn feels ‘awesome’ in return to World Cup form Lindsay Vonn feels ‘awesome’ in return to World Cup form World champion feels ‘awesome’ Tweet Shinichiro Tanaka/Associated Press file photo Lindsey Vonn will flex her skills this year and hope to add to her four World Cup championships. Shinichiro Tanaka/Associated Press file photo Lindsey Vonn will flex her skills this year and hope to add to her four World Cup championships. S OELDEN, Austria Lindsey Vonn felt “awesome” after resuming ski training free of pain on Thursday, 10 weeks after fracturing a bone in her left ankle and just two days before the new World Cup season starts. The four-time overall champion made eight practice runs on a glacier, without her ankle showing any reaction. “I didn’t feel anything. It didn’t hurt and it wasn’t swollen afterward,” the American told The Associated Press. “A lot better than I expected, honestly.” Vonn crashed during a training camp in New Zealand in August, suffering yet another setback after an impressive return from serious knee injuries last season. She broke the all-time record for most women’s World Cup wins and grabbed her seventh downhill season title. Vonn finished third in the overall standings, trailing only Anna Fenninger and Tina Maze. Both the injured Austrian and the Slovenian, who is taking a break from ski racing, won’t compete this year. Having recovered just before the new season starts is a huge relief for Vonn. “I’ve been doing some work in my ski boots the last couple of weeks to get used to it but you never know until you step on your skis,” she said. “Right away the first run felt awesome. It was a really good feeling to be back on snow.” Despite the 10-week layoff, Vonn still hasn’t ruled out a start in Saturday’s giant slalom on the Rettenbach glacier. She will train again on Friday. “I am going to push myself hard. I really want to make sure there is no pain. I want to make sure it’s not swollen after the training,” Vonn said. “And then as long as it is holding up well and I feel comfortable and confident, it’s worth to start. My goal may not be to be on the podium but if I get a top 10, you never know how valuable these points will be at the end of the year.” Fenninger’s and Maze’s absence and the retirement of Austria’s Nicole Hosp have left Vonn the only skier on the women’s circuit to have won the overall title before. And if the American, who turned 31 Sunday, will manage to win her fifth crystal globe, she will become the oldest female skier to win that trophy, breaking Vreni Schneider’s 20-year-old record. The Swiss standout was 30 when she won her third overall title in 1995. The ankle injury won’t hamper her physically, and she won’t spend many thoughts about the risk of hurting herself again. “Injuries are not a mental problem for me,” Vonn said. “If I have any physical pain, then that’s what slows me down. Falling, crashing, injuring, it never bothers me. It’s part of the game. So it was not in my mind at all today.” Once an all-event skier, Vonn won’t compete in slaloms anymore. To have a shot at the overall championship, she will need to score heavily again in downhill and super-G and take as many points as possible from GS. “The main thing is I have to dominate the speed events. I really have to win as many races as I can,” said Vonn, who labeled Switzerland’s Lara Gut, Germany’s Viktoria Rebensburg and fellow American Mikaela Shiffrin as her main rivals for the season. “Mikaela is definitely the favorite,” she said about her 20-year-old teammate. “She had a great season in GS last year. She’s always a big competitor. I won’t race slalom and she can win nearly all of them. In giant slalom she also has a good chance and if she can be fast in super-G, she’s definitely a huge competitor.” Shiffrin, however, played the ball back to Vonn. “She does know how to win the overall title and she is a tough fighter. I would say she is probably the best bet,” said Shiffrin, who ruled out that Vonn could be affected by her far from ideal preparation for the season. “If you think about last year and the comeback she made after essentially two years of not being able to ski, she won her second race back.” Tweet Marco Trovati/Associated Press file photo Lindsey Vonn is the most decorated female American skier by totaling 67 career race wins, an all-time women’s record. Marco Trovati/Associated Press file photo Lindsey Vonn is the most decorated female American skier by totaling 67 career race wins, an all-time women’s record.", "external_links": [], "published": "2015-10-23T06:26:00.000+03:00", "crawled": "2015-10-23T09:04:46.664+03:00", "highlightTitle": ""}