{"organizations": [], "uuid": "2d589e53259e22a2fbd42b339d11d78308254fdd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.capecodtimes.com", "main_image": "http://www.capecodtimes.com/Global/images/head/nameplate/fb/capecodtimes_200x200.png", "site_section": "http://www.capecodtimes.com/sports/high-school?template=rss&mime=xml", "section_title": "Local Sports - capecodtimes.com", "url": "http://www.capecodtimes.com/article/20151006/SPORTS/151009569/101036?rssfeed=true", "country": "US", "title": "Field hockey: Nauset evens record behind McNamara, Cavanaugh", "performance_score": 0, "site": "capecodtimes.com", "participants_count": 1, "title_full": "Field hockey: Nauset evens record behind McNamara, Cavanaugh", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T05:49:00.000+03:00", "replies_count": 0, "uuid": "2d589e53259e22a2fbd42b339d11d78308254fdd"}, "author": "Cape Cod Times sports@capecodonline.com", "url": "http://www.capecodtimes.com/article/20151006/SPORTS/151009569/101036?rssfeed=true", "ord_in_thread": 0, "title": "Field hockey: Nauset evens record behind McNamara, Cavanaugh", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Oct. 6, 2015 at 9:49 PM By Cape Cod Times Posted Oct. 6, 2015 at 9:49 PM » Social News SOUTH YARMOUTH - Junior Lucy McNamara and freshman Emily Cavanaugh split in goal en route to Nauset's 2-0 shutout over Sturgis West on Tuesday afternoon at Simpkins Field. Junior Mackenzie Meads gave McNamara and Cavanaugh all the offense the would need, scoring on a breakaway just 13:28 into the match. Junior Michaela Donlon doubled the lead just six minutes later on a feed from Meads as Nauset (4-4) took the 2-0 lead to the half. Jess Kimball held the Warriors out in the second half for Sturgis West (2-6) but Nauset still held on for the win. The Warriors got strong play from senior Tanner Deegan and sophomore Lauren Monger. Barnstable 0, Notre Dame (Hingham) 0: The Red Raiders earned another point from Cougars, this time battling to a scoreless tie in Hyannis. Barnstable (4-4-1) won the first meeting of the two 2-1 in its second game of the season. This time around it was a midfield battle throughout, with the Red Raiders not able to beat the Notre Dame (Hingham) goalie and Barnstable’s defense also coming up strong. Goalie Lindsey Charron made five saves in the shutout for the Red Raiders while getting key defensive support from Annie Spence, Kellyn Eordekian and Nia Eddy-Pina. Barnstable also got strong play in the midfield from Ann Mudie and Caroline Spalt. Monomoy 14, Hull 0: The Sharks used 11 different scorers en route to a in in Hull. Senior Megan Lesperance, in her first season playing field hockey, netted her first two varsity goals, while junior Julie Lacontore added her first varsity tally in the win. Monomoy improved to 8-2, 6-2 in the South Shore League with the victory. Nantucket 5, Sturgis East 0: The Whalers used goals from five different sources, shutout out the Storm on the island. Kait Smith kept Sturgis East (0-5) in the game with 17 saves. Nantucket improves to 5-3, 3-0 Cape & Islands. East Bridgewater 2, Mashpee 1: The Vikings turned the tide on the Falcons, earning a home win in East Bridgewater a day after Mashpee won at home. Alex Gumbert scored for the Falcons (6-4, 4-3 South Shore League) in the second half to cut into East Bridgewater’s lead, which was 2-0 at the half. Chyla Hendricks earned the assist on Gumbert’s tally. Mashpee beat the Vikings 3-1 on Monday in Mashpee. By Cape Cod Times", "external_links": [], "published": "2015-10-07T05:49:00.000+03:00", "crawled": "2015-10-08T10:04:25.957+03:00", "highlightTitle": ""}