{"organizations": [], "uuid": "a5d9c9016ad177c7ec63187541209df1660abebd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/0e7ded16c3cb2a282894dce8d5066406.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/golf/brendan-steele-stays-clear-of-big-names-in-california/6949987/", "country": "JE", "title": "Brendan Steele stays clear of big names in California", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "Brendan Steele stays clear of big names in California", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T05:16:00.000+03:00", "replies_count": 0, "uuid": "a5d9c9016ad177c7ec63187541209df1660abebd"}, "author": "", "url": "http://www.sport.co.uk/golf/brendan-steele-stays-clear-of-big-names-in-california/6949987/", "ord_in_thread": 0, "title": "Brendan Steele stays clear of big names in California", "locations": ["California"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Brendan Steele"], "text": "Brendan Steele stays clear of big names in California 17 Oct 2015 02:16:53 \ncomments \nBrendan Steele has spent four-and-a-half years looking to rediscover that precious winning feeling and it could return this weekend at the Frys.com Open in Napa Valley, California. \nNow aged 32, Steele marked his rookie year on the PGA Tour with victory at the Texas Open in April 2011, but he has yet to lift silverware since. \nHe was second at the Humana Challenge in January 2015, but put himself in pole position after 36 holes at the Silverado course on Friday after following up his breathtaking opening 63 with a solid 70 to reach 11 under par. \nIn doing so he held a two-shot lead over a chasing pack featuring Steele's fellow American Will Wilcox and Venezuelan Jhonattan Vegas who were among four players tied on nine under after their respective rounds of 67 and 71. Vegas made a bogey six at the last rather than the birdie that would have seen him tie for the lead. \nCanadian Graham DeLaet and American Harold Varner III, in his first PGA Tour event of 2015 and just his fourth overall, were also sitting pretty on nine under. DeLaet added a 68 to his opening 67, while Varner backed up Thursday's sparkling 65 with a solid 70. \nFront-runner Steele was born locally, in mountainous Idyllwild, California, and lives even closer by to this week's course, in the nearby city of Irvine. \nHe would be a popular winner of a tournament which this year is peppered with top-class talent. \nScotland's Martin Laird, who tied for third place last year, and England's world number seven Justin Rose were in close attendance, tied for sixth on eight under, while Rory McIlroy toiled for a one-under 71 to stand five under, Northern Ireland's world number three tied for 19th and needing a big weekend to put himself in contention. \nLaird also had a 71, while Rose was keeping him company after firing a three-under 69, breaking 70 despite hitting a pair of wayward shots on the back nine. \nAmerican Colt Knost was a notable mover, a six-under 66 allowing him to surge 57 places into a tie for 10th on seven under par. Related Sport News", "external_links": [], "published": "2015-10-17T05:16:00.000+03:00", "crawled": "2015-10-17T20:14:40.302+03:00", "highlightTitle": ""}