{"organizations": [], "uuid": "1b5af8a7b1242fe54958ef55986e29a1c9ed53d1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/2/8/161261/World/Region/Israel-erects-wall-to-protect-Jews-in-occupied-Jer.aspx", "country": "EG", "title": "Israel erects wall to 'protect Jews' in occupied Jerusalem - Region - World", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Israel erects wall to 'protect Jews' in occupied Jerusalem - Region - World - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "1b5af8a7b1242fe54958ef55986e29a1c9ed53d1"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/2/8/161261/World/Region/Israel-erects-wall-to-protect-Jews-in-occupied-Jer.aspx", "ord_in_thread": 0, "title": "Israel erects wall to 'protect Jews' in occupied Jerusalem - Region - World", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Kerry to meet Netanyahu, Abbas on Palestinian-Israeli unrest this week Armed Israeli settlers injure three during attack on Palestinian houses in El-Khalil city Palestinian shot after stabbing Israeli soldier in Hebron: Israel army Israeli occupation police on Sunday began erecting a wall in annexed east Jerusalem to protect a Jewish neighbourhood subject to firebomb and stone attacks launched from a Palestinian village.\nThe wall would effectively divide Palestinian Jabel Mukaber and Jewish Armon Hanatziv, raising criticism among the government's opposition, which considered the move a de facto division of Jerusalem.\nAs of Sunday, police had placed six slabs below Jabel Mukaber, each about 2.5 metres (yards) high and two metres long. Black lettering in Hebrew at the bottom of the slabs read \"temporary mobile police barrier\".\nThe municipality said the wall would eventually cover a 300-metre strip, stressing it would not be peripheral and it was being placed where \"there is a history of stone and firebomb throwing at Jewish homes and cars\".\nJabel Mukaber has been a hotspot in the recent wave of violence in which 42 Palestinians and seven Israelis have been killed, raising fears of a full-blown Palestinian uprising grew.\nThree Palestinian residents of the village had been killed by Israel security forces over alligation of killing three Israeli settlers in two separate attacks in Jerusalem on Tuesday.\nOn Saturday, a 16-year-old Palestinian was shot dead by police after claims of attempting to stab border police at a checkpoint near Jabel Mukaber.\nOn the other hand, an Israeli person has died after being wounded in a shooting attack Sunday on the central bus station of the southern Israeli city Beersheba, a hospital said.\nBeersheba's Soroka hospital said in a statement that 10 people were evacuated to its trauma room and one of them was pronounced dead on arrival.\nPolice also announced the death of a person from the same attack. Details about the person's identity were not immediately known.\nThe new wall will join a series of checkpoints set up in recent days at the exits of some of the Palestinian sectors of east Jerusalem, including Jabel Mukaber.\nThe Zionist Union, the centre-left party which leads the opposition to Prime Minister Benjamin Netanyahu's coalition, criticised the move.\n\"Netanyahu officially divided Jerusalem today,\" it said in a statement. \"Netanyahu has lost the ability to keep the safety of Israel's citizens and Jerusalem's unity.\"\nIsrael unilaterally regards Jerusalem -- which it has fully occupied in 1967 Six-Day War -- as its historic and undivided capital.\nPalestinians, however, see the city as occupied territory and want the capital of a future independent state to be located there in accordance with international law.\n*The story was edited by Ahram Online.", "external_links": [], "published": "2015-10-18T03:00:00.000+03:00", "crawled": "2015-10-19T08:03:23.779+03:00", "highlightTitle": ""}