{"organizations": [], "uuid": "f9a3525dfbc5da557dd1a90b9170c19f7a18aced", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxsports.com", "main_image": "http://a.fssta.com/content/dam/fsdigital/fscom/nascar/images/nascarsection/2015/10/11/101115-NASCAR--Justin-Allgaier-LN-PI.vresize.1200.675.high.18.jpg", "site_section": "http://api.foxsports.com/v1/rss?partnerKey=zBaFxRyGKCfxBagJG9b8pqLyndmvo7UU&tag=nascar", "section_title": "FOX Sports Digital", "url": "http://www.foxsports.com/nascar/story/dale-earnhardt-jr-charlotte-bank-of-america-500-not-pleased-track-conditions-oil-spill-101115", "country": "", "title": "Drivers not pleased about track conditions after oil cleanup", "performance_score": 1, "site": "foxsports.com", "participants_count": 0, "title_full": "Drivers not pleased about track conditions after oil cleanup", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T02:31:00.000+03:00", "replies_count": 0, "uuid": "f9a3525dfbc5da557dd1a90b9170c19f7a18aced"}, "author": "", "url": "http://www.foxsports.com/nascar/story/dale-earnhardt-jr-charlotte-bank-of-america-500-not-pleased-track-conditions-oil-spill-101115", "ord_in_thread": 0, "title": "Drivers not pleased about track conditions after oil cleanup", "locations": ["Concord", "N.C."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Updated Oct 11, 2015 at 7:43p ET Concord, N.C. — \nFollowing Sunday's Bank of America 500 at Charlotte Motor Speedway, a number of drivers were quite vocal about oil on the track late in the going. \nWhen Justin Allgaier got into the back of Michael McDowell on a restart on Lap 182, he crushed the radiator and sent fluids all over the racing surface. While NASCAR and track officials cleaned the track with Speedy Dry, a number of drivers complained oil remained on the track, and ultimately paid the price for hitting it. \nWhen the race restarted on Lap 190, Dale Earnhardt Jr . got into the outside wall harder than he had earlier in the event. One lap later, Brad Keselowski hit the wall in the same spot on the track. On Lap 195, Sam Hornish Jr . hit the wall in the same spot and the caution eventually flew. \nJoe Gibbs Racing's Kyle Busch hit the wall as well, screaming to his crew over the radio, \"It'd be nice if they cleaned the (bleeping) oil up in Turn 2!\" \nAfter the race, Earnhardt was emphatic he ran through oil and was upset NACAR could not get the track clean. \n\"We all hit the wall,\" a frustrated Earnhardt said after the race. \"I hit the wall, then the 2 (Brad Keselowski) hit the all, then we ran another lap, I pitted and a bunch of other guys hit the wall. There was oil down there. It wasn't Speedy Dry. I've raced this s--t for 20 years, I know what oil and Speed Dry is. We hit fluid, flew in the wall freaking hard, that's not Speedy Dry. There was oil up there. Dale Earnhardt Jr. to charge ahead with 'nothing-to-lose' attitude despite troubles \n\"The 51 (Allgaier) blew a hose,\" he explained. \"He didn't knock a hole in the bottom of the engine that would just leave a track of oil. He blew a hose or something that is going to spray oil and throw oil all about the racetrack and up the racetrack. So maybe it was two-and-a-half car lengths wide how much oil was on the track, you just don't know. You can put (Speedy Dry) where the car went, but you've got to get out there maybe and feel around, get your hands on the track and see what's up.\" \nThat is exactly what Sprint Cup Series managing director Richard Buck said NASCAR and track officials did following the Allgaier incident, adding he was \"absolutely confident there was no oil\" in the high groove of the track. \n\"We always listen to the spotters and the drivers. We get calls all day long,\" Buck said standing behind the NASCAR hauler. \"We've got spotters around the track, and officials and cleanup (crews), and we'll make the rounds over the radio. Not only that, in that instance we actually had men on the ground walking that high groove. They couldn't see anything. We had the caution car â Brett (Bodine, pace car driver), he's very experienced at that. We got the reports. We looked everywhere, including putting people on the ground and walking the area they said the oil was and there was no oil.\" \nWhen told NASCAR had officials on the track, Earnhardt did not back down on his claim, saying there was definitely oil on the racing surface. \n\"S--t, man, guys hit the fence. What do you want me to do? I hit the (bleeping) wall. I know I hit oil. I promise,\" he said with a laugh. \"I'll argue with them all day long because I'm right. I don't know if they want to argue about it, and I'm not saying they want to, but they shouldn't want to argue that because all them cars hit the wall down there.\" \nStill, Buck said his team and the track officials did everything they could to assess the situation and made the best call they felt they could make given the information they had. \n\"I don't know that you say anybody misread anything,\" he said. \"We all did our jobs. We even had a human being -- who was protected by the trucks -- alk that area. We do everything we can to bring the race back to raceable conditions. I think we have an excellent record of that. Sometimes with some of these lubricants and things they use, there is some staining to the track and we'll go back and do some checking on that with Brett and Buster (Auton) just to make sure we have got up all the fluids. We did that today.\"", "external_links": [], "published": "2015-10-12T02:31:00.000+03:00", "crawled": "2015-10-12T03:57:53.884+03:00", "highlightTitle": ""}