{"organizations": [], "uuid": "5981cc59ad262e5a14d20672758c2358bf025983", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fox8live.com", "main_image": "http://APMOBILE.images.worldnow.com/images/9095399_G.jpg", "site_section": "http://www.fox8live.com/", "section_title": "New Orleans News, Weather, Saints - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "url": "http://www.fox8live.com/story/30345343/hamilton-wins-us-grand-prix-and-f1-season-championship", "country": "US", "title": "Hamilton wins US Grand Prix and F1 season championship", "performance_score": 0, "site": "fox8live.com", "participants_count": 1, "title_full": "Hamilton wins US Grand Prix and F1 season championship - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T00:16:00.000+02:00", "replies_count": 0, "uuid": "5981cc59ad262e5a14d20672758c2358bf025983"}, "author": "cbs8", "url": "http://www.fox8live.com/story/30345343/hamilton-wins-us-grand-prix-and-f1-season-championship", "ord_in_thread": 0, "title": "Hamilton wins US Grand Prix and F1 season championship", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By JIM VERTUNO\nAP Sports Writer AUSTIN, Texas (AP) - Lewis Hamilton took off his racing helmet and bent low in a moment of quiet reflection after winning a tight race and another Formula One championship.\nMercedes teammate Nico Rosberg sat nearby, slumped in a feeling of disgust revealed when Hamilton tossed him his second-place cap and the German flipped it right back, nearly hitting Hamilton in the face.\nHamilton ignored the gesture, turned and walked to the victor's podium to celebrate winning the United States Grand Prix to secure his third Formula One season title.\n\"In the final laps I was thinking about my family and my dad standing in the rain watching me race, as a crazy parent thinking someday he might be a good driver,\" Hamilton said. \"It's hard to believe I'm here as a three-time champion.\"\nIt was Rosberg's mistake that helped make this one happen. The German skidded off a short straight out of the 12th turn with eight laps to go at the Circuit of the Americas, opening the gap Hamilton needed.\nHamilton's third U.S. win in four years gave him 21 over two seasons and his 10th this year. The 30-year-old is the first Formula One driver to win 10 or more races in consecutive seasons.\nFor Rosberg, it was yet another race of frustration for a driver who enjoys the dominance of his Mercedes car, but can't get the better of his boyhood friend turned rival.\n\"Not saying something wrong with the car, for now I think it's a mistake I made,\" Rosberg said.\nA third season championship earns Hamilton a spot among the great drivers in the sport's history. Three matches his idol Ayrton Senna and ties Jackie Stewart for most championships by a British driver. Only Michael Schumacher, Juan Manuel Fangio, Alain Prost and current Ferrari driver Sebastian Vettel have won more.\n\"For me, it was always to get the three Ayrton had,\" Hamilton said, calling it \"very humbling.\"\nVettel finished third. He could have pushed the championship race to next week in Mexico City if he had been able to pass Rosberg on the final lap for second.\n\"This is Lewis's day.\" Vettel said. \"I've been in this seat before. The nights after you win the championship are pretty special too.\"\nHamilton's first world title in 2008 came down to the final turn in the final race of the season. The second and third have been much more dominant.\nHis switch to Mercedes in 2013 put him in Formula One's dominant car after the engine change from the screaming V8s to a V6 turbo hybrid. Hamilton and Mercedes have been out front ever since. His closest rival has been Rosberg.\nHamilton's title march seemed inevitable entering the weekend until harsh weather pounded the Austin area for three days, forcing drivers and teams to push their cars through difficult conditions of a slick track and low visibility.\nConstant rain pushed qualifying all the way to Sunday morning, the first time that's happened since 2013 and just the fourth since 2004.\nWhen Rosberg took the pole position, Hamilton said he'd be cautious from No. 2 and wouldn't do anything \"crazy.\"\nNo chance.\nHamilton roared out of the start and forced Rosberg wide into the first turn at the top of the 130-foot incline and their cars touched tires. By the time they were hurtling back down hill, Hamilton had seized the lead.\nThe move gave Rosberg nowhere to go and he soon found himself in fourth as Red Bull's Daniil Kvyat and Daniel Ricciardo jumped into the gap on Hamilton's rear.\n\"It was extremely aggressive,\" Rosberg said. \"Lewis came into me.\"\nThe Mercedes and Red Bull cars battled through several lead changes and wheel-to-wheel racing over the first 20 laps. Vettel, who started 13th because of an engine change grid penalty, crept his way through the field in hopes of keeping his own slim title chances alive.\nBut the race and the season again boiled down to Mercedes duel over the final 10 laps. Rosberg's wobbly drift into the grass opened the door for the world champion.\nRosberg set a scorching lap to catch Hamilton but couldn't do it and had to fight off Vettel just to stay in second.\n\"There were so many times I thought I had lost the race,\" Hamilton said. \"But I never for one second thought I couldn't do it.\"\nCopyright 2015 The Associated Press. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-26T00:16:00.000+02:00", "crawled": "2015-10-26T02:47:52.227+02:00", "highlightTitle": ""}