{"organizations": ["OU K-State"], "uuid": "cae00dda15f091ab6d069d4681c5d7367a526fb2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "themercury.com", "main_image": "", "site_section": "http://themercury.com/feeds/kstate-sports", "section_title": "The Manhattan Mercury - K-State Sports", "url": "http://themercury.com/articles/k-state-looks-for-first-big-12-road-win-at-ou", "country": "US", "title": "K-State looks for first Big 12 road win at OU", "performance_score": 0, "site": "themercury.com", "participants_count": 0, "title_full": "K-State looks for first Big 12 road win at OU", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T22:10:00.000+03:00", "replies_count": 0, "uuid": "cae00dda15f091ab6d069d4681c5d7367a526fb2"}, "author": "", "url": "http://themercury.com/articles/k-state-looks-for-first-big-12-road-win-at-ou", "ord_in_thread": 0, "title": "K-State looks for first Big 12 road win at OU", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tim Everson"], "text": "K-State looks for first Big 12 road win at OU By Tim Everson October 16, 2015 \nThe Kansas State volleyball team heads back onto the road for the fourth time in conference play to take on Oklahoma tonight. \nLast Saturday, the Wildcats (10-7, 2-3) recorded their second Big 12 win this season as they swept West Virginia in Bramlage Coliseum. \nK-State head coach Suzie Fritz seemed pleased with her team’s defense but hopes to find a better offensive effort from her team in Norman. \n“Well enough,” Fritz said, describing K-State’s effort on Saturday. “I think we’re still a work in progress for sure. But I was pleased with our defensive side maybe more than the other side. I thought we got our hands on more balls at the net, I thought we made good defensive effort in the back row. I thought we put together more serving, scoring runs in that fashion… I thought we made more progress than the other way.” \nLeading the way for K-State on Saturday was freshman outside hitter Alyssa Schultejans, who had 12 kills on .308 hitting. \nIt was the fourth time this season that Schultejans has led the Wildcats in offense in a season that has seen several different players step up and take the reins. \n“Well, I think if you can get them all going together,I think the idea is that balance is best offensively, so you really don’t want somebody having to carry all of the load,” Fritz said. “I think it’s a little bit of a blessing and a curse that when you see that and you see somebody else another night, and then you see someone else a third night, ideally it would be best if we could get some balance and have all of them running together.” \nK-State has not won at Oklahoma (7-10, 1-4) since 2008, but has won two in a row in Manhattan. \nAfter coming off of a NCAA tournament appearance last season, the Sooners have struggled so far this year. \nOU is coming off of a four-set loss at No. 2 Texas, which gives the Sooners a two-game losing streak heading into tonight’s match. \nThe Sooners’ only Big 12 win this season was a four-set victory against Baylor at home. K-State swept the Bears last month to open its Big 12 schedule at home. \nOklahoma has been good at the net so far this season, ranking third in the Big 12 in both blocks and hitting percentage so far this season. \nHowever, the Sooners have struggled in serve and receive, ranking dead last in the conference in aces, and second-to-last in both digs and opponents’ hitting percentages. \nFritz still believes, even with the Sooners’ struggles, that K-State’s success relies mainly on what the Wildcats bring to the court. \n“Still a lot of where we feel like we can affect change is on our side of the net,” she said. “Your work list is long, so you have to prioritize what are the areas where we feel like we can affect change the fastest…We feel like, right now, those areas are continuing to be a good first swing side-out team. \n“We feel like we can be more effective with our serving and we feel like we have to turn digs to points. And that’s a lot even though that’s only three things there’s a lot that goes into being good at those three things… I think we’re seeing some gradual progress.” \nFirst serve between the Wildcats and the Sooners is set for 6 p.m. at McCasland Field House.", "external_links": [], "published": "2015-10-16T22:10:00.000+03:00", "crawled": "2015-10-17T04:31:31.981+03:00", "highlightTitle": ""}