{"organizations": ["Michigan State on State", "Michigan State", "Big House", "Michigan State Spartans", "Univerisity of Michigan Wolverines Sione Houma", "Michigan State Spartans Connor Cook", "Michigan Wolverines", "Michigan Wolverines Royce Jenkins-Stone", "MSU", "Detroit Free Press"], "uuid": "f44850c1fcaef6e44d5e5974be4a03a0b146ffb6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freep.com", "main_image": "http://www.gannett-cdn.com/-mm-/61bd364c18344c2704c1cb673c107d2e42d31b6a/c=0-17-2397-1371&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/17/DetroitFreePress/DetroitFreePress/635807088959368813-UM-101715-MSU-JHG25.jpg", "site_section": "http://rssfeeds.freep.com/freep/sports", "section_title": "Detroit Free Press - Sports", "url": "http://www.freep.com/story/sports/columnists/drew-sharp/2015/10/17/michigan-state-michigan-wolverines/74146910/", "country": "US", "title": "Sharp: Fabulous game adds to lore of U-M/MSU rivalry", "performance_score": 0, "site": "freep.com", "participants_count": 0, "title_full": "Sharp: Fabulous game adds to lore of U-M/MSU rivalry", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T03:37:00.000+03:00", "replies_count": 0, "uuid": "f44850c1fcaef6e44d5e5974be4a03a0b146ffb6"}, "author": "", "url": "http://www.freep.com/story/sports/columnists/drew-sharp/2015/10/17/michigan-state-michigan-wolverines/74146910/", "ord_in_thread": 0, "title": "Sharp: Fabulous game adds to lore of U-M/MSU rivalry", "locations": ["Michigan State", "Rockford", "South Carolina", "Michigan State Spartans Delano Hill", "Delano Hill", "Canton", "Michigan Stadium", "Michigan", "Ann Arbor Michigan"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Olivia Strang", "Jehiu Chesson", "Jarrod Wilson", "James Palazeti", "Mark Marek", "Diane Weiss", "Paul Bunyan Trophy", "Tom Izzo", "Brian Vrable", "Niko Palazeti", "Maeve Jamieson", "Luke Vrable", "Andy Bell", "Monroe", "Karan Higdon", "Macgarrett Kings Jr.", "Jalen Watts-Jackson", "Ann Arbor", "Chris Farmer", "John Henry", "Shane Rambaldo", "Brooks", "Elizabeth Boles", "Gerald Holmes", "Chris Frey", "Romina Palazeti", "Kristen McGraw-Allen", "Miles Jamieson", "Cook", "Steve Spurrie", "David Webster", "Jessica MacIver", "Elizabeth", "Connor Cook", "Joe Bolden", "Koby McGraw-Allen", "Blake O'Neill", "Andrew Ignasiak", "Blake", "Johnny Boles", "Julian H. Gonzalez/Detroit Free Press Julian H. Gonzalez", "Jake Rudock", "Julian H. Gonzalez", "Burbridge", "Romina", "Jim Harbaugh", "Lawrence Thomas", "Max Adamo", "Jon Reschke", "Donavon Clark", "Karen Houchlei", "Sione Houma", "Karen", "Tim Houchle", "James Azure", "Scott", "Kirthmon F. Dozier", "Jayme Milligan", "Erica McNeely", "Mark Dantonio", "Rick Henry", "Lloyd Carr", "Jake Butt", "Chris Woemley", "Mary Ann", "Nick Padla", "Paul Bunyan", "Arjen Colquhoun", "Megan Bott", "Ashley McLaughlin", "Matthew Godin"], "text": "Michigan State celebrates with their fans after MSU's 27-23 win Saturday in Ann Arbor. Diane Weiss DFP Fullscreen Buy Photo Michigan State's Lawrence Thomas carries the Paul Bunyan Trophy after their 27-23 over Michigan on Saturday in Ann Arbor. Julian H. Gonzalez DFP Fullscreen Buy Photo Michigan punter Blake ONeill cases down the muffed punt that Michigan State recovered and returned for the game-winning touchdown as the clock ran out for a 27-23 win over Michigan on Saturday in Ann Arbor. Julian H. Gonzalez DFP Fullscreen Buy Photo Michigan State's Jalen Watts-Jackson, far left, recovers the muffed punt by Michigan punter Blake O'Neill, right, and ran it back was the clock ran out for State's game-winning touchdown for 27-23 win on Saturday in Ann Arbor. Julian H. Gonzalez DFP Fullscreen Buy Photo Michigan State's Arjen Colquhoun, left, and Macgarrett Kings Jr. carry the Paul Bunyan Trophy after their 27-23 win over Michigan on Saturday in Ann Arbor. Julian H. Gonzalez DFP Fullscreen Buy Photo Michigan State offensive lineman Nick Padla, left, and Donavon Clark, right, hold up the Paul Bunyan Trophy as they sing the fight song after their 27-23 win over Michigan on Saturday in Ann Arbor. Julian H. Gonzalez DFP Fullscreen Buy Photo Michigan State quarterback Connor Cook leaving the field after their 27-23 win over Michigan on Saturday in Ann Arbor. Julian H. Gonzalez DFP Fullscreen Buy Photo Michigan State's Jalen Watts-Jackson runs the ball down the side lines for the winning touchdown after he picked up a muff punt in the last 10 seconds of MSU's 27-23 win Saturday in Ann Arbor. Diane Weiss DFP Fullscreen Buy Photo Michigan State celebrates Jalen Watts-Jackson game-winning touchdown after he picked up a muff punt in the last 10 seconds of MSU's 27-23 win Saturday in Ann Arbor. Diane Weiss DFP Fullscreen Buy Photo Michigan State celebrates Jalen Watts-Jackson game-winning touchdown after he picked up a muff punt in the last 10 seconds of MSU's 27-23 win Saturday in Ann Arbor. Diane Weiss DFP Fullscreen Buy Photo Univerisity of Michigan Wolverines Sione Houma scores against the Michigan State Spartans during first quarter action Saturday, October 17, 2015 at Michigan Stadium in Ann Arbor. Kirthmon F. Dozier, Detroit Free Press Buy Photo Fullscreen Buy Photo Univerisity of Michigan Wolverines Chris Woemley sacks the Michigan State Spartans Connor Cook during second quarter action Saturday, October 17, 2015 at Michigan Stadium in Ann Arbor. Kirthmon F. Dozier, Detroit Free Press Buy Photo Fullscreen Buy Photo Michigan State's Jon Reschke breaks up a pass to Michigan's Karan Higdon in the second quarter on Saturday, October 17, 2015, in Ann Arbor. Julian H. Gonzalez/Detroit Free Press Julian H. Gonzalez, Detroit Free Press Buy Photo Fullscreen Buy Photo Univerisity of Michigan Wolverines defenders tackle the Michigan State Spartans Gerald Holmes during first quarter action Saturday, October 17, 2015 at Michigan Stadium in Ann Arbor. Kirthmon F. Dozier, Detroit Free Press Buy Photo Fullscreen Buy Photo Michigan's Matthew Godin chases down Michigan State quarterback Connor Cook and forces Cook to get rid of the ball for an incompletion in the first quarter on Saturday, October 17, 2015, in Ann Arbor. Julian H. Gonzalez/Detroit Free Press Julian H. Gonzalez, Detroit Free Press Buy Photo Fullscreen Buy Photo Univerisity of Michigan Wolverines Jehiu Chesson makes a catch against the Michigan State Spartans Delano Hill during second quarter action Saturday, October 17, 2015 at Michigan Stadium in Ann Arbor. Kirthmon F. Dozier, Detroit Free Press Buy Photo Fullscreen Buy Photo Michigan head coach Jim Harbaugh complains their was a hold on against Michigan State on State's touch down play in the second quarter on Saturday, October 17, 2015, in Ann Arbor. Julian H. Gonzalez/Detroit Free Press Julian H. Gonzalez, Detroit Free Press Buy Photo Fullscreen Buy Photo Univerisity of Michigan Wolverines Royce Jenkins-Stone tackles the Michigan State Spartans aaron Burbridge during second quarter action Saturday, October 17, 2015 at Michigan Stadium in Ann Arbor. Kirthmon F. Dozier, Detroit Free Press Buy Photo Fullscreen Buy Photo Michigan and Michigan State fans pack he Big House during 1st quarter action between Michigan and Michigan State in Ann Arbor, Saturday, Oct. 17, 2015. Diane Weiss, Detroit Free Press Buy Photo Fullscreen Buy Photo Univerisity of Michigan Wolverines Chris Woemley sacks the Michigan State Spartans Connor Cook during second quarter action Saturday, October 17, 2015 at Michigan Stadium in Ann Arbor. Kirthmon F. Dozier, Detroit Free Press Buy Photo Fullscreen Buy Photo Michigan State's LJ Scott runs out of the tackles of Michigan's Jarrod Wilson , left, and Delano Hill, back, for a touchdown to tie the game 7-7 on Saturday, October 17, 2015, in Ann Arbor. Julian H. Gonzalez/Detroit Free Press Julian H. Gonzalez, Detroit Free Press Fullscreen Buy Photo Michigan fan Jayme Milligan (R) celebrates as the Michigan defense stopped Michigan State on 4th down during 1st quarter action and Michigan State fan Erica McNeely (L) looks on in the Big House during action between Michigan and Michigan State in Ann Arbor, Saturday, Oct. 17, 2015. Diane Weiss, Detroit Free Press Buy Photo Fullscreen Buy Photo Michigan quarterback Jake Rudock throws the ball away under pressure from Michigan State's Chris Frey binging up fourth down late in the second quarter on Saturday, October 17, 2015, in Ann Arbor. Julian H. Gonzalez/Detroit Free Press Julian H. Gonzalez, Detroit Free Press Fullscreen Buy Photo Michigan State's Jon Reschke brakes up pass to Michigan tightend Jake Butt in the second quarter on Saturday, October 17, 2015, in Ann Arbor. Julian H. Gonzalez/Detroit Free Press Julian H. Gonzalez, Detroit Free Press Buy Photo Fullscreen Buy Photo Michigan's Sione Houma ru s for a first down in the first quarter against Michigan State on Saturday, October 17, 2015, in Ann Arbor. Julian H. Gonzalez/Detroit Free Press Julian H. Gonzalez, Detroit Free Press Fullscreen Buy Photo Michigan head coach Jim Harbaugh yelling about the call that resulted in the ejection of defensive player Joe Bolden in the second quarter against Michigan State on Saturday, October 17, 2015, in Ann Arbor. Julian H. Gonzalez/Detroit Free Press Julian H. Gonzalez, Detroit Free Press Fullscreen Buy Photo Michigan's Joe Bolden jumps up and down yelling at the student section as he leaves the field after being ejected from the game in the second quarter againsf Michigan State on Saturday, October 17, 2015, in Ann Arbor. Julian H. Gonzalez/Detroit Free Press Julian H. Gonzalez, Detroit Free Press Buy Photo Fullscreen Buy Photo Fans cheer in the Big House during 1st quarter action between Michigan and Michigan State in Ann Arbor, Saturday, Oct. 17, 2015. Diane Weiss, Detroit Free Press Buy Photo Fullscreen Buy Photo Michigan State fan Chris Farmer a 2002 graduate signals a MSU first down as he watches the game from the last row in Michigan Stadium during 1st quarter action between Michigan and Michigan State in Ann Arbor, Saturday, Oct. 17, 2015. Diane Weiss, Detroit Free Press Buy Photo Fullscreen Buy Photo Michigan fans cheer their team the Big House prior to the start of the game between Michigan and Michigan State in Ann Arbor, Saturday, Oct. 17, 2015. Diane Weiss, Detroit Free Press Buy Photo Fullscreen Buy Photo Michigan head coach Jim Harbaugh leads his team onto the field for their football game against Michigan State on Saturday, October 17, 2015, in Ann Arbor. Julian H. Gonzalez/Detroit Free Press Julian H. Gonzalez, Detroit Free Press Buy Photo Fullscreen Buy Photo Michigan State fan freshman Andrew Ignasiak is sandwiched in between his two friends , Michigan freshman Max Adamo and David Webster in the Big House prior to the start of action between Michigan and Michigan State in Ann Arbor, Saturday, Oct. 17, 2015. Diane Weiss, Detroit Free Press Buy Photo Fullscreen Buy Photo Michigan State fans Karen and Tim Houchle and Shane Rambaldo (R) cheer on the Spartans in the Big House prior to the start of action between Michigan and Michigan State in Ann Arbor, Saturday, Oct. 17, 2015. Diane Weiss, Detroit Free Press Buy Photo Fullscreen Buy Photo Former South Carolina coach Steve Spurrie, center gets a selfie with Michigan head coach Jim Harbaugh and former head coach Lloyd Carr before the Michigan State game on Saturday, October 17, 2015, in Ann Arbor. Julian H. Gonzalez/Detroit Free Press Julian H. Gonzalez, Detroit Free Press Buy Photo Fullscreen Buy Photo Fans cheer in the Big House during 1st quarter action between Michigan and Michigan State in Ann Arbor, Saturday, Oct. 17, 2015. Diane Weiss, Detroit Free Press Buy Photo Fullscreen Buy Photo Michigan fan James Azure, 24 from Rockford, shows off his colors as he tailgates with friends , Saturday, Oct. 17, 2015 prior to the game between Michigan and Michigan State. Diane Weiss, Detroit Free Press Buy Photo Fullscreen Buy Photo Luke Vrable, 10, plays a friendly game of football with his father Brian Vrable while they tailgate together, Saturday, Oct. 17, 2015 prior to the game between Michigan and Michigan State. Diane Weiss, Detroit Free Press Buy Photo Fullscreen Buy Photo Michigan fans cheer as the team arrives for their game against Michigan State Saturday, October 17,2015 in Ann Arbor Michigan. Kirthmon F. Dozier, Detroit Free Press Buy Photo Fullscreen Buy Photo Newlyweds Elizabeth Boles, 50, and husband Johnny Boles, 47 of Monroe, who were married on Friday, walk outside of Michigan Stadium, Saturday, Oct. 17, 2015 prior to the game between Michigan and Michigan State. Elizabeth surprised her husband with tickets for the game as a honeymoon gift. Diane Weiss, Detroit Free Press Buy Photo Fullscreen Buy Photo Olivia Strang, 9, of Traverse city his a tackling dummy in the fan zone in Ann Arbor, Saturday, Oct. 17, 2015 prior to the game between Michigan and Michigan State. Diane Weiss, Detroit Free Press Buy Photo Fullscreen Buy Photo Brothers and sister John Henry, Karen Houchlei and Rick Henry tailgate together, Saturday, Oct. 17, 2015 prior to the game between Michigan and Michigan State. Diane Weiss, Detroit Free Press Buy Photo Fullscreen Buy Photo Michigan State fans Maeve Jamieson 11, and her brother Miles Jamieson 12, from Grosse Point walk to the Michigan vs Michigan State game Saturday, October 17,2015 in Ann Arbor Michigan. Kirthmon F. Dozier, Detroit Free Press Buy Photo Fullscreen Buy Photo Michigan and Michigan State fans tailgate in Ann Arbor, Saturday, Oct. 17, 2015 prior to the game between Michigan and Michigan State. Diane Weiss, Detroit Free Press Buy Photo Fullscreen Buy Photo James Palazeti, (7) hits a blocking dummy as he runs through the fan zone outside of Michigan Stadium in Ann Arbor, Saturday, Oct. 17, 2015 prior to the game between Michigan and Michigan James Palazeti is related to former Michigan State football player Niko Palazeti. Diane Weiss, Detroit Free Press Buy Photo Fullscreen Buy Photo Michigan State basketball coach Tom Izzo greets football coach head coach Mark Dantonio on the field at Michigan Stadium before their football game against Michigan on Saturday, October 17, 2015, in Ann Arbor. Julian H. Gonzalez/Detroit Free Press Julian H. Gonzalez, Detroit Free Press Buy Photo Fullscreen Buy Photo Romina Palazeti, 4, hits a blocking dummy as she runs through the fan zone outside of Michigan Stadium in Ann Arbor, Saturday, Oct. 17, 2015 prior to the game between Michigan and Michigan State. Romina is related to former Michigan State football player Niko Palazeti. Diane Weiss, Detroit Free Press Buy Photo Fullscreen Buy Photo Michigan and Michigan State fans tailgate in Ann Arbor, Saturday, Oct. 17, 2015 prior to the game between Michigan and Michigan State. Diane Weiss, Detroit Free Press Buy Photo Fullscreen Buy Photo Michiagan fans tailgate in Ann Arbor, Saturday, Oct. 17, 2015 prior to the game between Michigan and Michigan State. Diane Weiss, Detroit Free Press Buy Photo Fullscreen Buy Photo Fans tailgate in Ann Arbor, Saturday, Oct. 17, 2015 prior to the game between Michigan and Michigan State. Diane Weiss, Detroit Free Press Buy Photo Fullscreen Buy Photo Mary Ann and Mark Marek of Canton and season ticket holders for 34 years pose at their tailgate site in Ann Arbor, Saturday, Oct. 17, 2015 prior to the game between Michigan and Michigan State. Diane Weiss, Detroit Free Press Buy Photo Fullscreen Buy Photo Michigan State football coach head coach Mark Dantonio on the field at Michigan Stadium before their football game against Michigan on Saturday, October 17, 2015, in Ann Arbor. Julian H. Gonzalez/Detroit Free Press Julian H. Gonzalez, Detroit Free Press Fullscreen Buy Photo Koby McGraw-Allen 1 1/2 is carried by his mother Kristen McGraw-Allen as they walk through the crowds outside of Michigan Stadium in Ann Arbor, Saturday, Oct. 17, 2015 prior to the game between Michigan and Michigan State. Diane Weiss, Detroit Free Press Buy Photo Fullscreen Buy Photo Michigan and Michigan State fans Ashley McLaughlin, 2008 UM graduate, her sister Jessica MacIver, MSU graduate and UM nursing school, Megan Bott, MSU graduate and UM nursing school relax with golden retriever Brooks and great pyrenees Bear as they tailgate in Ann Arbor, Saturday, Oct. 17, 2015 prior to the game between Michigan and Michigan State. Diane Weiss, Detroit Free Press Buy Photo Fullscreen Buy Photo Michigan fan Andy Bell sets up his satelite dish before the Michigan vs Michigan State game Saturday, October 17,2015 in Ann Arbor Michigan. Kirthmon F. Dozier, Detroit Free Press Buy Photo Fullscreen Buy Photo Michigan fans party on State street before the Michigan vs Michigan State game Saturday, October 17,2015 in Ann Arbor Michigan. Kirthmon F. Dozier, Detroit Free Press Buy Photo", "external_links": [], "published": "2015-10-18T03:37:00.000+03:00", "crawled": "2015-10-18T04:04:29.851+03:00", "highlightTitle": ""}