{"organizations": [], "uuid": "924e7b5667201ae49f4645802db4000eb7eed971", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ky3.com", "main_image": "http://www.ky3.com/image/view/-/35791340/highRes/1/-/maxh/640/maxw/640/-/c38k94/-/492184634-miguel-montero-of-the-chicago-cubs-tags-out-gettyimages-jpg.jpg", "site_section": "http://www.ky3.com/sports/21049292_21049298?format=rss_2.0&view=feed", "section_title": "Sports Top Stories", "url": "http://www.ky3.com/sports/Cardinals-face-Cubs-ace-in-Game-3-of-NLDS-at-Wrigley-Field/21049292_35791246", "country": "US", "title": "Cardinals face Cubs ace in Game 3 of NLDS at Wrigley Field", "performance_score": 0, "site": "ky3.com", "participants_count": 0, "title_full": "Cardinals face Cubs ace in Game 3 of NLDS at Wrigley Field", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T22:43:00.000+03:00", "replies_count": 0, "uuid": "924e7b5667201ae49f4645802db4000eb7eed971"}, "author": "", "url": "http://www.ky3.com/sports/Cardinals-face-Cubs-ace-in-Game-3-of-NLDS-at-Wrigley-Field/21049292_35791246", "ord_in_thread": 0, "title": "Cardinals face Cubs ace in Game 3 of NLDS at Wrigley Field", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tweet \nOCTOBER 10: Miguel Montero #47 of the Chicago Cubs tags out Yadier Molina #4 of the St. Louis Cardinals in the fifth inning during game two of the National League Division Series between the St. Louis Cardinals and the Chicago Cubs at Busch Stadium on October 10, 2015 in St Louis, Missouri. (Photo by Michael B. Thomas/Getty Images) \nThe Chicago Cubs did what they needed to do in the first two games of the National League Division Series and head home with a chance to take the best-of-five set at Wrigley Field. \nThe St. Louis Cardinals, who visit the Cubs for Game 3 on Monday, will try to bounce back after an error-marred performance in Game 2. The Cardinals took an early lead on Matt Carpenter's lead-off homer in Game 2 but made a pair of errors in the second inning as Chicago scored three times without getting the ball out of the infield before Jorge Soler's two-run homer capped the big frame. \n\"It is hard to watch a club that's played so well defensively, see a couple things happen that are kind of uncharacteristic for us, but they do happen,\" St. Louis manager Mike Matheny told reporters. \"We gotta figure out ways to get around 'em.\" \nAvoiding a deficit in the series could prove to be a tough task when the Cardinals go up against Chicago ace Jake Arrieta in Game 3. \n\"Getting Jake pitching the next game is kind of a good thought for us, obviously,\" Cubs manager Joe Maddon told reporters. \"He's been pitching -- how can I even say? You've all been watching; he's been spectacular.\" \nTV: 6:07 p.m. ET, TBS PITCHING MATCHUP: Cardinals RH Michael Wacha (17-7, 3.38 ERA) vs. Cubs RH Jake Arrieta (22-6, 1.77) \nWacha is hoping a shaky final month doesn't carry over into the postseason after he went 2-3 with a 7.88 ERA in five September starts. The Texas A&M product yielded seven home runs in those five outings and lost to Chicago twice in that span, allowing a total of 10 runs and 12 hits - four homers - in nine total innings against the Cubs. Wacha is 4-2 with a 3.48 ERA in six career postseason games - five starts. \nArrieta started the wild-card game at Pittsburgh and scattered four hits without a walk while striking out 11 in a shutout. The Cy Young Award candidate has not lost since July 25 and has allowed a total of two earned runs in his last 10 outings. Arrieta is 2-1 with a 2.42 ERA in four starts against St. Louis this season but has not faced the Cardinals since July 7. \nCopyright 2015, Schurz Communications", "external_links": [], "published": "2015-10-12T22:43:00.000+03:00", "crawled": "2015-10-13T00:06:18.539+03:00", "highlightTitle": ""}