{"organizations": [], "uuid": "0ef4c6acda302461cddb8c21446cf9ebfd6a9f73", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "hawaiitribune-herald.com", "main_image": "http://hawaiitribune-herald.com/sites/hawaiitribune-herald.com/files/field/image/2372996_web1_kona-vs-kam-f-ball02--1-.jpg", "site_section": "http://hawaiitribune-herald.com/taxonomy/term/3/feed", "section_title": "Sports", "url": "http://hawaiitribune-herald.com/sports/local-sports/biif-division-ii-football-kamehameha-not-resting-laurels-it-vies-repeat", "country": "US", "title": "BIIF Division II football: Kamehameha not resting on laurels as it vies for repeat", "performance_score": 0, "site": "hawaiitribune-herald.com", "participants_count": 1, "title_full": "BIIF Division II football: Kamehameha not resting on laurels as it vies for repeat", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T13:49:00.000+03:00", "replies_count": 0, "uuid": "0ef4c6acda302461cddb8c21446cf9ebfd6a9f73"}, "author": "nefeeder", "url": "http://hawaiitribune-herald.com/sports/local-sports/biif-division-ii-football-kamehameha-not-resting-laurels-it-vies-repeat", "ord_in_thread": 0, "title": "BIIF Division II football: Kamehameha not resting on laurels as it vies for repeat", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BIIF Division II football: Kamehameha not resting on laurels as it vies for repeat Published October 23, 2015 - 12:49am By MATT GERHART Hawaii Tribune-Herald \nThere are myriad reasons why, but Kamehameha coach Dan Lyons has not spent much time this week watching film of his team’s 2015 highlight to date – the Warriors’ 24-0 victory against Konawaena on Sept. 25. \nIt could be because Wildcats sophomore quarterback Austin Ewing didn’t play in that game \nMaybe Lyons doesn’t expect the conditions for tonight’s BIIF Division II football championship game in Kealakekua to be the same as that rainy night in Keaau when Konawaena turned the ball over five times. \nIs Lyons’ battling complacency? \nPerhaps those reasons have played small roles, but most of all the fifth-year coach just wants his team to worry about the task at hand. \n“I think we’re really focused on what we feel we need to work on and what we need to get better at,” Lyons said. “I think we know that if we play to our level, it will work itself out on the field.” \nMental toughness and embracing the grind were two themes in practice this week, more so than the prize – either the Warriors (6-2 BIIF, 9-2) will walk away with a repeat or the Wildcats (7-1, 9-1) will stake their claim to a dynasty with a fourth title in five years. \nWhich is not to say Lyons doesn’t worry about the opposition. \nAs well as sophomore DallasJ Duarte has taken to quarterbacking in his first year of competitive football, few have been as impressive this season as Ewing. \nLyons has taken the time to watch film of a player some are labeling “the franchise.” The Warriors dodged a bullet when he sat out the earlier meeting. \n“Good reads and he makes quick decisions,” Lyons said. “They’re well-coached and when they get going they play with a lot of energy and momentum. \n“(Austin) has the ability the pull the trigger and get the ball out quickly.” \nThe offenses will mirror each other at times with both quarterbacks guiding uptempo, quick-hitting passing attacks. Duarte picked a good year to try out for football – all-league running back Kaeo Batacan, multiple playmakers and a sturdy offensive line provide the perfect safety blanket. \n“I think he’s always learning and getting used to his role,” Lyons said of Duarte. “He has a lot he needs to get better at, but he’s far exceeded expectations.” \nDefensively, the Warriors’ have only allowed 34 points in their past five games. \nKamehameha’s season can be broken down into three phases. \nThe Warriors appeared to have filled all their holes and were clicking on all cylinders during a 3-0 preseason, but they lost a lead at Kealakehe in their opener and then committed seven turnovers in an ugly home loss to Hilo during a 1-2 league start. Since, Kamehameha has won five in a row – including a victory against you-know-who. \n“Realistically, there seems to be a point after a long summer where we lose focus,” Lyons said. “We started to turn it around when we committed to working hard again. \n“I think this team is more focused than the team that won last year was. We like the work we’ve put in.” \nOf course, last year doesn’t matter. In fact, neither does Sept. 25.  ", "external_links": [], "published": "2015-10-23T13:49:00.000+03:00", "crawled": "2015-10-24T03:18:22.925+03:00", "highlightTitle": ""}