{"organizations": [], "uuid": "1b5c541fa00cb9ad0164783b41e397a1a0296c01", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtontimes.com", "main_image": "http://media.washtimes.com.s3.amazonaws.com/media/image/2015/10/15/AP_1112111210102.jpg", "site_section": "http://www.washingtontimes.com/rss/headlines/sports/", "section_title": "www.washingtontimes.com stories: Sports", "url": "http://www.washingtontimes.com/news/2015/oct/15/lamont-peterson-hopes-win-again/", "country": "US", "title": "LOVERRO: Lamont Peterson hopes to start winning again near where it all began", "performance_score": 0, "site": "washingtontimes.com", "participants_count": 1, "title_full": "LOVERRO: Lamont Peterson hopes to start winning again near where it all began", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T23:09:00.000+03:00", "replies_count": 0, "uuid": "1b5c541fa00cb9ad0164783b41e397a1a0296c01"}, "author": "Thom Loverro", "url": "http://www.washingtontimes.com/news/2015/oct/15/lamont-peterson-hopes-win-again/", "ord_in_thread": 0, "title": "LOVERRO: Lamont Peterson hopes to start winning again near where it all began", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sports LOVERRO: Lamont Peterson hopes to start winning again near where it all began Lamont Peterson, center, poses after a boxing match against Amir Khan, of England, Sunday, Dec. 11, 2011, in Washington. (AP Photo/Nick Wass) more > By Thom Loverro - The Washington Times -   \nANALYSIS/OPINION: \nLet’s face it: Lamont Peterson has already won. \nThe hometown fighter, facing off Saturday afternoon against undefeated Felix Diaz Jr., at EagleBank Arena at George Mason, wins every time he steps in the ring. He wins every day he adds another chapter to his story of personal triumph. \nThe story is well known. He and his brother Anthony, a lightweight contender who will also be on the card on Saturday, were both homeless on the streets of Washington by age 10. The story goes they were abandoned by a mother who was overwhelmed and a father who was in prison. \nBarry Hunter, a local boxing coach, saw something special in these two young boys — fighting to live on the streets of Washington — and took them in, serving as both their trainer and surrogate father. He remains the guiding force in the Petersons’ lives today, and will be in their corners Saturday night, when Lamont fights before the hometown fans for the first time since his unanimous decision win over Dierry Jean at the D.C. Armory in January 2014. \nPeterson recognizes the impact he can have in his hometown, where his story has become the stuff of local legend. \n“It’s times like this when you’re with kids that you really see how important it is to be around positive role models,” he said. “How you can make a difference by just being there. It is always important for me to give back, and fighting in my hometown lets me do that. \n“When I’m on the road, you have to move around a lot and work out in a hotel gym, but the benefit of being at home is that I get to sleep in my own bed, work out at my own gym, and it’s 100 times better for me,” Peterson said. “At the end of the day, I love to fight in front of my hometown fans.” \nHe is revered in Washington fight gyms. Veteran local fighter Jimmy Lange, who will also fight on the card, spoke of the honor of fighting on a card headlined by Peterson. \n“I am absolutely honored to be on this card, because Lamont is a real champion in and out of the ring,” Lange said. \nThe inspirational story is a winner. Everybody loves Peterson. \nWhat Peterson would like to do is win in the ring again. The former 140-pound world champion has lost two of his last four fights, including the last time he was seen in a Premiere Boxing Champions show in April — a majority-decision loss to highly touted Danny Garcia, which many observers found controversial (myself not included; I thought he started way too late to dominate the fight). The card will be televised on NBC starting at 4 p.m. \nPeterson (33-3-1, 17 knockouts) believes he is better than the opponents he has lost to. \n“I would like to avenge some defeats that I’ve had,” he said. “I’m better than anyone I’ve ever lost to. I’d like to have the opportunity to go out and prove that I’m better than the people I lost to.” \nHis most memorable fight took place in Washington nearly four years ago. He scored a controversial upset split decision over Amir Khan at the Washington Convention Center to become the World Boxing Association and International Boxing Federation 140-pound world champion.", "external_links": [], "published": "2015-10-15T23:09:00.000+03:00", "crawled": "2015-10-16T01:21:36.461+03:00", "highlightTitle": ""}