{"organizations": ["Facebook Mac", "Brahmas", "Facebook Email Twitter Google"], "uuid": "f65d3b6d0aa3233dbb41d1bc63f309a822cec80b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kens5.com", "main_image": "http://www.gannett-cdn.com/-mm-/dd91cab7c966d9afac8d2c3217d66bedd36b3dc9/r=x1683&amp;c=3200x1680/http/cdn.tegna-tv.com/-mm-/c76cd7bbcd22222d5f2520292bb92c261fcd36b0/c=0-426-4608-3029/local/-/media/2015/10/02/KENS/KENS/635793794955802790-FBH-MacArthur-quarterback-Tyler-Vitt-sitting-in-coaches-office.jpg", "site_section": "http://rssfeeds.kens5.com/_/20/109838946/kens5/highschoolsports", "section_title": "Kens5 - HIgh School Sports", "url": "http://www.kens5.com/story/opinion/contributors/david-flores/2015/10/02/mac-sophomore-quarterback-vitt-took-challenge-heart/73201334/", "country": "US", "title": "Mac sophomore quarterback Vitt took challenge to heart", "performance_score": 0, "site": "kens5.com", "participants_count": 0, "title_full": "Mac sophomore quarterback Vitt took challenge to heart", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T18:56:00.000+03:00", "replies_count": 0, "uuid": "f65d3b6d0aa3233dbb41d1bc63f309a822cec80b"}, "author": "", "url": "http://www.kens5.com/story/opinion/contributors/david-flores/2015/10/02/mac-sophomore-quarterback-vitt-took-challenge-heart/73201334/", "ord_in_thread": 0, "title": "Mac sophomore quarterback Vitt took challenge to heart", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Josh Jung", "Ben Cook", "Tyler Vitt", "Vitt"], "text": "Facebook Email Twitter Google+ LinkedIn Pinterest Mac sophomore quarterback Vitt took challenge to heart Tyler Vitt has completed 70 of 97 passes with no interceptions for 1,389 yards and 18 touchdowns in five games. Post to Facebook Mac sophomore quarterback Vitt took challenge to heart Tyler Vitt has completed 70 of 97 passes with no interceptions for 1,389 yards and 18 touchdowns in five games.  //on.kens5.com/1L8PJdg   Mac sophomore quarterback Vitt took challenge to heart  56 a.m. CDT October 2, 2015 MacArthur sophomore quarterback Tyler Vitt has helped the Brahmas get off to a 4-1 this season.     standout MacArthur quarterback Josh Jung quit football in January to concentrate on baseball, Brahmas coach Ben Cook turned to 15-year-old freshman Tyler Vitt to lead the offense. \n“I just said, ‘Let’s go, let’s go,’” Cook said Thursday, recalling his conversation with Vitt. “He took to it and went to work. His work ethic is unbelievable.” \nEight months later, Vitt ranks among the top quarterbacks in the San Antonio area. Now a 16-year-old sophomore – his birthday was Wednesday – Vitt has demonstrated a maturity beyond his years in adapting to his starting role. \nOff to their best start since advancing to the state quarterfinals in 2010, MacArthur (4-1, 1-0) plays Churchill (3-1) in a District 26-6A game   Heroes Stadium. The Brahmas, who have won three in a row since losing to Clemens in a 45-43 barnburner, are No. 6 in the KENS 5 Class 6A area rankings. Friday night's game will be the district opener for Churchill. \n“They really mix up their coverages a lot, more than other teams we’ve played,” Vitt said. “Their DBs are quicker than anybody we’ve played. They’re big and physical on the defensive line.” \nVitt has been coolly efficient as the catalyst in Mac’s explosive offense, completing 70 of 97 passes with no interceptions for 1,389 yards and 18 touchdowns. He also has proven to be a strong leader, always an important quality for a quarterback. \n“We talked to Tyler about it in the spring and he’s come along real well,” Cook said. “He has a quality about him that people gravitate toward him. He’s not one of those yelling, screaming type leaders. He’s just one of those types who people will follow because he’s so humble. I know everyone says that – ‘My guy is humble’ – but he really is.” \nVitt, 6-foot-1 and 195 pounds, started his freshman year on the junior varsity before getting moved up to the varsity at midseason when Jung’s backup went down with an injury. \n“We threw him out there and got him going,” Cook said. “We put him in a game against Reagan as a kick returner and he got some reps as a quarterback against Lee and Roosevelt.” \nTyler Vitt, handing off to running back Dai'jon Williams in last week's win over Madison, has demonstrated leadership beyond his years this season, Coach Ben Cook says. (Photo: David Olmos / Special to Kens5.com) \nVitt, who also plays baseball for Mac, cemented his position as the Brahmas’ starting quarterback in the spring with his command of the offense. \n“That’s what I’d been waiting for,” Vitt said. “I was excited to lead my teammates. I worked hard all this summer to be the man.” \nCook attributes much of Vitt’s development to quarterbacks coach Trey Fitzpatrick, who has forged a strong bond with him. \n“I have a very good relationship with him,” Vitt said. “He’s like a brother and a dad. We’re so close that we can joke with each other, but also get down to business. We watch a lot of film together and he works with me on everything.” \nVitt also has a benefited from playing with a group of talented, experienced receivers, an outstanding running back and a strong offensive line. \n“The receiving group that we have are those sophomore kids who were on the varsity for us in 2013,” Cook said. “They’ve played a lot.” \nNow seniors, Bobby Lepovitz (19 catches, 461 yards, 6 TDs), Jeremiah Cura (13-237-5) and Nate Vega (12-192-3) all have contributed to Vitt’s development. Senior running back Daijon Williams has rushed for 710 yards and 11 TDs on 80 carries, and also has 12 receptions for 266 yards and three TDs. \n“It’s a very balanced group,” Cook said. “In our type of offense (no-huddle spread), Tyler’s the type of kid we give a lot of freedom to put the ball where you need to put it, and he’s done a great job of that. He just makes good decisions. \n“That’s something his coach (Fitzpatrick) stresses to him, and that’s what our offense is built on. We don’t think we’re going to just overpower people, but we’ve got to do what we can do and that’s try to be precise and try do things the right way.” \nMacArthur coach Ben Cook says that one of Tyler Vitt's best qualities as a quarterback is making good decisions under pressure. (Photo: David Flores / Kens5.com) \nVitt has learned that the mental aspects of playing football are critical to success. \n“Every night before I go to sleep I watch a little bit film of the team we’re going to play,” he said. “I come in twice a week before school and watch film with Coach Fitz.” \nVitt has a strong arm and “can make all the throws,” Cook said. “He’s got touch. He can put it on you, he can throw deep. It’s very impressive the tools that he has.” \nVitt, a center fielder, played on the Mac varsity baseball team as a freshman last season. He was a pitcher/center fielder on the McAllister All-Star team that advanced to the Little League World Series in 2012, a year after McAllister finished third in the country at the tournament. \nVitt said playing in front of such large crowds as a 12-year-old gave him a poise that he’s drawn from as a high school quarterback. One of his teammates on the McAllister team, Jordan Cardenas, is a running back at Churchill. \n“It was a cool experience,” Vitt said. \nCook has been impressed with Vitt’s steady leadership since he became a starter. \n“He has a good balance of respect for the older guys who have done it, but at the same time he knows what his job is,” Cook said. “He knows that the responsibility of being a quarterback is to be leader. Not in everything. We believe that it takes 11 guys out there working together. \n“If we complete a pass, it’s 11 guys contributing. These guys buy into that. That’s something Tyler believes in, too.” \nVitt is all in with that. \n“That’s the mentality,” Vitt said. “We have a bunch of players who just don’t want to let each other down.” Read or Share this story: http://on.kens5.com/1L8PJdg TOP VIDEOS", "external_links": [], "published": "2015-10-02T18:56:00.000+03:00", "crawled": "2015-10-02T19:15:08.781+03:00", "highlightTitle": ""}