{"organizations": [], "uuid": "41516371e27f2d667662c9ff98d63c5fc4609473", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mysanantonio.com", "main_image": "http://www.mysanantonio.com/img/pages/article/opengraph_default.jpg", "site_section": "http://www.mysanantonio.com/sports/collectionRss/Sports-Article-Template-Recent-Stories-Simple-List-9201.php", "section_title": "Sports Article Template Recent Stories Simple List", "url": "http://www.mysanantonio.com/sports/article/Collins-relishing-in-full-time-role-in-Arkansas-6560380.php", "country": "US", "title": "Collins relishing in full-time role in Arkansas' backfield", "performance_score": 0, "site": "mysanantonio.com", "participants_count": 1, "title_full": "Collins relishing in full-time role in Arkansas' backfield", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T09:20:00.000+03:00", "replies_count": 0, "uuid": "41516371e27f2d667662c9ff98d63c5fc4609473"}, "author": "KURT VOIGT, AP Sports Writer", "url": "http://www.mysanantonio.com/sports/article/Collins-relishing-in-full-time-role-in-Arkansas-6560380.php", "ord_in_thread": 0, "title": "Collins relishing in full-time role in Arkansas' backfield", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Collins relishing in full-time role in Arkansas' backfield Kurt Voigt, Ap Sports Writer Updated 1:25 am, Friday, October 9, 2015 FAYETTEVILLE, Ark. (AP) — Alex Collins was Arkansas coach Bret Bielema's most high-profile signing in his first recruiting class after leaving Wisconsin. After two understated 1,000-yard rushing seasons in a part-time role, the junior running back has taken advantage of a full-time opportunity this season — and how. Collins, despite some initial struggles this season filling the void left by injured running back Jonathan Williams, has entered rare territory in the last three weeks as Arkansas (2-3, 1-1 Southeastern Conference) has tried to recover from a disappointing start to the season. The 5-foot-11, 215-pound back has rushed for more than 150 yards in each of the Razorbacks' last three games, joining two-time Heisman Trophy runner-up Darren McFadden as the only other player in school history to accomplish that feat. Collins has also finally produced some of his best performances in SEC play at a time of desperation for Arkansas. After averaging 66.6 yards rushing per SEC game in his first two seasons, Collins is averaging 152.5 this season — including a 27-carry, 154-yard effort in last week's 24-20 win at Tennessee. \"I think it came at the perfect time,\" Bielema said. Collins rushed for 1,110 yards as a freshman in 2013 and 1,026 a year ago, despite sharing carries — which he was expected to do again entering this season. However, fellow 1,000-yard rusher Williams injured his left foot during a preseason scrimmage. He is likely out for the season. Never one to wallow in the despair of the moment, Bielema said Williams' injury wasn't \"a setback in any way, shape or form\" for Arkansas. It was a comment many questioned following Arkansas' 16-12 loss to Toledo on Sept. 12, a defeat in which Collins managed only 54 yards on the ground on 20 carries. Collins said the shocking loss led to soul-searching on his part, as well as his teammates, and he's responded by piling up 475 yards rushing over the last three games. He is now third in the SEC in rushing with 656 yards this season, trailing only LSU's Leonard Fournette and Georgia's Nick Chubb as the Razorbacks prepare to face No. 8 Alabama (4-1, 1-1) on Saturday. \"I think he's one of the best backs in the SEC,\" Crimson Tide defensive end Jonathan Allen said. \"He may not get the recognition of the other people, but he's definitely a physical guy.\" Collins has shown a more physical style so far this season, despite dropping 10 pounds during the offseason in an attempt to increase his speed. Even with the more contact, he's continued to show the slashing, side-stepping ability he said has been aided with the increased workload. After carrying the ball 20 or more times in only three games all of last season, Collins has reached that mark in his last four games this year. That includes 81 carries over the last three games, an amount that's just fine with Collins and his coaches. \"Now that I'm getting way more carries than I was the previous years, I can get a feel for a game and a better understanding, and I can get a feel for the team and know what works and what doesn't work,\" Collins said. \"Before, I had to kind of figure it out on the fly and try to guess where I was going, because I didn't know when my last rep was going to be.\" ___ AP Sports Writer John Zenor in Tuscaloosa, Ala., contributed to this report. ___ AP College Football website: www.collegefootball.ap.org Latest Headlines", "external_links": [], "published": "2015-10-09T09:20:00.000+03:00", "crawled": "2015-10-09T10:46:08.358+03:00", "highlightTitle": ""}