{"organizations": [], "uuid": "a11c4d32459d614953a9756582929e33ca29dc2b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "couriernews.com", "main_image": "http://couriernews.com/images/article.jpg", "site_section": "http://couriernews.com/rss/rss/Sports?instance=Sports&amp;content_type=article&amp;tags=sports_high_school+sports_collegiate+sports_professional+sports_scoreboard+sports_other&amp;tag_inclusion=or&amp;offset=0&amp;limit=25&amp;page_name=rss", "section_title": "Sports", "url": "http://couriernews.com/bookmark/26907577", "country": "US", "title": "FCA to host Fields of Faith", "performance_score": 0, "site": "couriernews.com", "participants_count": 1, "title_full": "FCA to host Fields of Faith", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T18:12:00.000+03:00", "replies_count": 0, "uuid": "a11c4d32459d614953a9756582929e33ca29dc2b"}, "author": "Travis Simpson (noreply@couriernews.com)", "url": "http://couriernews.com/bookmark/26907577", "ord_in_thread": 0, "title": "FCA to host Fields of Faith", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "FCA to host Fields of Faith by Travis Simpson The Courier Your Messenger For The River Valley 09:12 AM, Wednesday, October 14 2015 | 231 views | 0 | 0 | | When the Russellville Cyclones leave the turf at Cyclone Stadium on Fridays, they leave their blood, sweat and tears behind them. When the Fellowship of Christian Athletes (FCA) leave after today's Fields of Faith, they hope to do the same — spiritually.Fields of Faith is a national, student-led event conducted at football stadiums across the country. Students invite, pray for, share with and challenge their peers to follow the teachings of Jesus Christ. According to the Fields of Faith website, a football field provides a neutral rally point where a community can come together.Because community is exactly what it's all about, FCA director Christina Wilbers said.\"It's a time for prayer, listening to a speaker and worship for the entire community,\" she said. \"We invite everyone, and it's free. It brings the kids closer together. We have people busing in from all over the River Valley. Instead of being athletic rivals, this gives them common ground.\"Three-time Olympic gold medalist Leah Amico will be the guest speaker. Amico played softball professionally for the Arizona Wildcats, where she won three National Championships between 1993-97. Amico won her gold medals in 1996, 2000 and 2004.These days she resides in California with her husband and three children, hosts \"More Than Conquerors\" on The Bible Network (TBN) and speaks at events such as Fields of Faith.\"I got to meet her last night,\" Wilbers said. \"She is an outstanding lady. Kids are just attracted to her. She has been through a lot, like anyone who competes athletically at that level.\"Reflection, a local youth drama team from First Baptist Church, will perform, as well as live music from the band The Side Notes.Wilbers said the band, which is also youth led, formed specifically for Fields of Faith.\"It's musicians from six different churches,\" she said. \"They came together to provide the music.\"At the end of the event, participants will clasp hands to encircle the field in prayer. Wilbers said there were so many people at last year's event the circle overlapped. She is hoping it overlaps even more this year.Fields of Faith kicks off at 7 p.m. at Cyclone Stadium.  ", "external_links": [], "published": "2015-10-14T18:12:00.000+03:00", "crawled": "2015-10-14T20:37:39.801+03:00", "highlightTitle": ""}