{"organizations": [], "uuid": "69bb9dc1967b993f89ce1ce2ef9df5244289b20b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.norwichbulletin.com", "main_image": "http://www.norwichbulletin.com/storyimage/CT/20151023/SPORTS/151029724/AR/0/AR-151029724.jpg", "site_section": "http://www.norwichbulletin.com/sports?template=rss&mime=xml", "section_title": "Sports - The Bulletin", "url": "http://www.norwichbulletin.com/article/20151023/SPORTS/151029724/17199/NEWS?rssfeed=true", "country": "US", "title": "Senior running back scores 2 TDs to help NFA end 2-game losing streak", "performance_score": 0, "site": "norwichbulletin.com", "participants_count": 1, "title_full": "Senior running back scores 2 TDs to help NFA end 2-game losing streak", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T07:17:00.000+03:00", "replies_count": 0, "uuid": "69bb9dc1967b993f89ce1ce2ef9df5244289b20b"}, "author": "Jason Levy jlevy@norwichbulletin.com", "url": "http://www.norwichbulletin.com/article/20151023/SPORTS/151029724/17199/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "Senior running back scores 2 TDs to help NFA end 2-game losing streak", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "• Killingly defeats New London for 1st time since 2003 WILLIMANTIC — With Norwich Free Academy football coach Jemal Davis running out of healthy bodies, someone needed to step up to end a two-game losing streak. Senior Peyton Whittaker answered the call, scoring both of the Wildcats touchdowns in a hard-fought 13-6 victory over Windham on Friday night. With starting quarterback Jawaun Johnson still sidelined, the NFA coaches told the Wildcats that players needed to rise to the occasion and get some momentum going for when Johnson does return, which is expected to be next week against Ledyard. Whittaker scored on touchdown runs of 41 and 6 yards in the second and fourth quarters, respectively. He led NFA (4-2) in rushing with 84 yards on 18 carries. “It was really important because we’re getting him back, hopefully pretty soon and we know we need to win if we still want to get in the playoffs, so it’s big,” Whittaker said. “It’s really tough when you lose one of your more important players on your offense and you got to kind of change things up and find other guys that can get things done.” Still alive Davis knew just how important it was to get the win to keep his team’s playoff hopes alive. “It gives us, still, an opportunity to pursue our goal, which is obviously to get into the playoffs. We still got a long road ahead, we’ve got great teams we’ve got to play, but 8-2 gets us in,” Davis said. “Getting this keeps us on track. It was a great win against a very great team.” Davis originally planned to rotate quarterbacks Shea McManaway and Tyler Briggs, but an injury to Briggs knocked him out of the game, leaving it up to McManaway. After he went 0-for-5 in the first half, he found his groove in the second by completing 5 of 7 passes for 48 yards. Davis said McManaway’s steady hand was key to the Wildcats coming out on top. “He went in there and did extremely well, controlled the tempo of the game, and that’s what we needed him to do,” Davis said. But the growing list of injured players is unchartered territory for Davis. “Right now, when we did our count we’ve got 15 guys right now that are out. I’ve never experienced that in my — I’ve been doing this about 20 years and I haven’t experienced that,” Davis said. Whippets struggle The Whippets (5-2) opened the scoring in the second quarter when Andrew Gonzalez recovered a fumble and returned it 20 yards for the score. Page 2 of 2 - But Windham’s offense was unable to support its defense. Several drives came to a halt in NFA territory. Seiji Arzuaga led the Windham offense with 80 yards on 16 carries while Cullan Contos totaled 76 yards on the ground and added 33 yards through the air. “You have to consider the defense, I think they have a very good defense,” Windham coach Brian Crudden said. “They got big guys up front, they got people that can move at linebacker and secondary and our situation might be more one of missed opportunities.” Windham had a chance to tie or take the lead late in the fourth quarter. After an NFA three-and-out, Contos returned the ensuing punt 35 yards, setting Windham up at the NFA 20. After a short completion to Contos, quarterback Brody Labbe was picked off in the end zone by Caleb Parker, sealing the game for the Wildcats. Labbe tried to keep his team in the game, but several wide receivers dropped passes in key moments, which helped end drives early. Labbe completed only four passes, all to Contos. With two weeks until Windham’s next game at New London, Crudden will have the Whippets refine the basics to get back to their winning ways. “We’re going to become more fundamentally sound and work on our assignments and skills and stuff like that,” Crudden said.", "external_links": [], "published": "2015-10-24T07:17:00.000+03:00", "crawled": "2015-10-24T16:45:40.116+03:00", "highlightTitle": ""}