{"organizations": [], "uuid": "b802e4e304c05927ceec94f310760f5dba49b312", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-5530052e/turbine/chi-default-open-graph-ct-logo/", "site_section": "http://www.chicagotribune.com/sports/highschool", "section_title": "Illinois High School Sports News - Preps Plus - Chicago Tribune", "url": "http://www.chicagotribune.com/sports/suburbs/naperville-sun/sports/ct-nvs-boys-golf-dupage-valley-st-1002-20151001-story.html", "country": "US", "title": "Thomas Huang helps Neuqua Valley take title in DVC debut - Naperville Sun", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Thomas Huang helps Neuqua Valley take title in DVC debut - Naperville Sun", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:28:00.000+03:00", "replies_count": 0, "uuid": "b802e4e304c05927ceec94f310760f5dba49b312"}, "author": "Paul Johnson", "url": "http://www.chicagotribune.com/sports/suburbs/naperville-sun/sports/ct-nvs-boys-golf-dupage-valley-st-1002-20151001-story.html", "ord_in_thread": 0, "title": "Thomas Huang helps Neuqua Valley take title in DVC debut - Naperville Sun", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Neuqua Valley coach Bart Carbonneau has a deep roster, allowing him to fluctuate his lineup throughout the season.\nAt Thursday's DuPage Valley Conference Meet at Bartlett Hills, Carbonneau had junior Thomas Huang in the second slot.\nThe way Huang played, it didn't matter where he was positioned.\nHuang shot a 74 to win medalist honors and propel the Wildcats to a 310 and the DVC title in their first year in the league.\n\"It was a pretty boring round, no big numbers, nothing too spectacular,\" Huang said. \"The weather conditions were difficult with the wind. The key was keeping the ball low and putting well. I made a couple of good putts coming in to save a couple of strokes.\"\nThe Wildcats showed off their depth. With No. 1 player Greg Crowley limited to an 85, Jack Richards and Jack Vercautron contributed 78s and No. 7 golfer Matt Rouches added an 80 to carry the Wildcats to the title.\n\"With how many people that we have that can go low, that's been a big advantage for us all year,\" Huang said. \"That's one of the reasons why we've been playing so well.\"\nNeuqua Valley's Jessica Yuen wins DuPage Valley girls golf title Paul Johnson Neuqua Valley senior golfer Jessica Yuen has accomplished much in her high school career, but one thing eluded her until Tuesday.\nThe two-time defending Class AA state champion has set many school and course records during her four seasons. But on Tuesday, she was finally the medalist at her conference...\nNeuqua Valley senior golfer Jessica Yuen has accomplished much in her high school career, but one thing eluded her until Tuesday.\nThe two-time defending Class AA state champion has set many school and course records during her four seasons. But on Tuesday, she was finally the medalist at her conference...\n(Paul Johnson) Neuqua faced a stiff challenge in its first DVC match earlier this season, traveling to Arrowhead to face perennial DVC contender Wheaton Warrenville South. Neuqua handed the Tigers their only loss of the regular season to set the tone.\n\"That was huge,\" Carbonneau said. \"I texted the guys and their families right away, 'Great win, the DVC knows that Neuqua is here.' \"\nThe Wildcats also had a narrow win over Naperville North, a match in which Neuqua won 145-147, the best rounds either team shot all season. Neuqua also had to break a tie with Metea Valley on the fifth scorecard during the season.\nThat showed Carbonneau the kind of quality Neuqua would face in the DVC.\n\"I will say that every school here has the capability of putting four scores together,\" Carbonneau said. \"You have great competition every match, and I think that helps us. We don't have any matches off.\"\nNaperville North suffered three close losses during the regular season, so the Huskies couldn't come back and win the conference title. They could try to win the conference meet, however, and the Huskies put up a 319 to finish second.\nBrendan Boyd fired a 76 from the fifth slot in the lineup to lead the way. Connor Ladone added a 78.\n\"We knew that we couldn't win the actual DVC, but our team goal was to win the tournament,\" North coach Ryan Hantak said. \"We knew we had a chance. We came up a little short, but second is not too bad. It gives us some momentum going into regionals next week.\"\nMetea finished fourth, shooting a 324 behind a 76 from David Lipan. Waubonsie Valley finished sixth in its first run through the DVC, shooting a 328. Jake Wright was second individually with a 75. Naperville Central was seventh with a 339. Tommy Dunsire shot an 80.\nIn an already difficult golf league, the DVC got that much stronger with the addition of the Valley schools.\n\"It's harder to win this thing now because of the schools that are in here,\" Hantak said. \"You have to bring your A game every time you play a match.\"\nPaul Johnson is a freelance reporter for the Naperville Sun.\nCopyright © 2015, Naperville Sun Sports", "external_links": [], "published": "2015-10-02T03:28:00.000+03:00", "crawled": "2015-10-02T15:23:56.362+03:00", "highlightTitle": ""}