{"organizations": [], "uuid": "203f3388e84c04787ae86961d64f743482b1add4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jsonline.com", "main_image": "http://media.jrn.com/images/b99583980z.1_20150930155958_000_g4bcop0v.1-1.jpg", "site_section": "http://www.jsonline.com/rss?c=y&path=/tablet/sports&atom=y", "section_title": "JSOnline.com Tablet - Sports", "url": "http://www.jsonline.com/sports/packers/positive-energy-by-lacy-starks-powers-up-packers-run-attack-b99583980z1-330156661.html", "country": "US", "title": "Positive energy by Lacy, Starks powers up Packers' run attack", "performance_score": 0, "site": "jsonline.com", "participants_count": 0, "title_full": "Positive energy by Lacy, Starks powers up Packers' run attack", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T00:22:00.000+03:00", "replies_count": 0, "uuid": "203f3388e84c04787ae86961d64f743482b1add4"}, "author": "", "url": "http://www.jsonline.com/sports/packers/positive-energy-by-lacy-starks-powers-up-packers-run-attack-b99583980z1-330156661.html", "ord_in_thread": 0, "title": "Positive energy by Lacy, Starks powers up Packers' run attack", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Starks", "Lacy"], "text": "Loading... \nGreen Bay — They were born four years, three months and five days apart. \nOne was a high school quarterback who flew under the radar. The other was one of the most highly sought after running backs in the nation. \nOne spent three years turning heads at Alabama. The other was barley noticed at Buffalo. \nIn so many ways, James Starks and Eddie Lacy seem like polar opposites. But when Lacy arrived in Green Bay three seasons ago, he realized in a hurry that his \"personality twin\" was just a few lockers over. \n\"James Starks and I, we're the exact same in a sense,\" Lacy said. \"His personality is to always be a happy guy. And I'm happy all the time. And I think that's mainly the reason me and Starks get along so well is because is we're both like carefree individuals. We're just really happy people.\" \nIn a locker room where life is awfully good — winning, hefty contracts, fame — the majority of the Green Bay Packers have plenty of reasons to smile. But good luck finding two happier humans — in any walk of life — than Lacy and Starks. \n\"I was always like this. As a child, my Mom said I never really cried much,\" Starks said. \"To me, there ain't no reason to be sad. People walking around sad all the time, I don't understand why. I'm just blessed to live another day.\" \nLacy seemingly sees life the same way. \n\"I'm never really down,\" he said. \"I don't know what it is. Me and Starks, we're just happy people.\" \nThe Packers are also pretty happy to have one of the best running back tandems in football today. While many teams are searching to find one productive back, Green Bay has two. \nIn 2013, with Lacy enjoying a terrific rookie season and Starks producing a career year, the Packers ranked seventh in the NFL in rushing. Last year, Green Bay finished 11th. \nBetween 1973-2012, the Packers had just two seasons where they ranked higher. Those came in 2003 (third) and 2004 (10th) when Ahman Green was one of the NFL's best backs and Najeh Davenport was one of the game's top reserves. \n\"I'll put our two guys up against anybody,\" Packers right guard T.J. Lang said in August. \nWith good reason. \nLacy had more rushing yards (2,317) and touchdowns (24) in his first two seasons than any running back in Packers history. When you consider the franchise has produced players like Green, Jim Taylor, John Brockington and Tony Canadeo, that accomplishment means even more. \nBut when Lacy has missed time, Starks has always been there to pick up the slack. \nStarks, one of the stars in Green Bay's run to the 2010 Super Bowl title, had 95 yards on 20 carries against Seattle's vaunted defense in Week 2. When Lacy left a 2013 game against Washington with a concussion, Starks ran for 132 yards and a touchdown. \nHappy? The Packers certainly are. \n\"That's just what he does,\" Packers quarterback Aaron Rodgers said of Starks. \"He was out most of the season in 2010 and we weren't sure who this guy was who was standing on the sidelines the whole year and he goes to Philly and has a hundred yards and he's a big part of our Super Bowl run. That's the kind of guy he is. \n\"He's very easygoing, kind of a relaxed personality in the locker room and the kind of guy you love playing with.\" \nPerhaps Starks has a case of perma-grin because he knows his chances of ever reaching this point were remote, at best. \nStarks played quarterback at Niagara Falls High School (New York), and avoided trouble in one of the country's most economically depressed towns. \nStarks suffered a bevy of injuries during his collegiate days at Buffalo, and most believed he would go undrafted and be a priority free agent. But Packers general manager Ted Thompson selected Starks in the sixth round. \nToday, only 10 players on Green Bay's active roster have more NFL seasons than Starks. Starks has a Super Bowl ring. And Starks has been given the key to the city in his hometown of Niagara Falls. \nMany see Starks with a constant smile on his face and think it's because he bucked the odds. Not so. Starks says this is who he is and who he's always been — with or without football. \n\"I've never changed and I probably never will,\" Starks said. \"People tell me that I'm chill, mellow and humble. I'm just grateful. I count my blessings and I'm grateful for every opportunity I get.\" \nLacy is cut from the same cloth. \nHurricane Katrina wiped out the Lacy family home in Gretna, La., in 2005. The family was displaced between Louisiana and Texas, before Lacy finally finished up high school in Geismer, La. \nSomehow, through it all, Lacy stayed the positive, upbeat person that his teammates love today. \n\"I think that making the people around you happier is pretty important,\" Lacy said. \"There's days when people come in here and they might not feel like being bothered. Then you've got dudes that are like happy and bringing positive energy. And even if you don't know it, it rubs off onto that individual and puts them in a better mood.\" \nThere's no doubt, Lacy's positivity rubs off on others. The same goes for Starks. \nWhen it comes to Green Bay's running game, there's a lot to smile about. And the Packers' two jovial backs will remain front and center. \n\"Life is good,\" Lacy said. \"It's definitely good. \n\"There's just not too many days unless something crazy happens where you won't see Starks smiling. And I'm the same way. It's fun to be teammates with that guy.\" \nThis story appeared in Packer Plus Magazine. To subscribe, call 414-224-2222 or go to www.jsonline.com/subscribe . © 2015 , Journal Sentinel Inc. All rights reserved.", "external_links": [], "published": "2015-10-01T00:22:00.000+03:00", "crawled": "2015-10-01T01:04:33.986+03:00", "highlightTitle": ""}