{"organizations": [], "uuid": "d241fb7142856f56f539fe95f66bd71bcf516d28", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.abqjournal.com", "main_image": "http://main.abqjournal.netdna-cdn.com/wp-content/uploads/2015/10/BC-US-MED-Marijuana-Adults-IMG-jpg-400x236.jpg", "site_section": "http://www.abqjournal.com/", "section_title": "Albuquerque Journal | Albuquerque and New Mexico News, Sports, Business and more", "url": "http://www.abqjournal.com/663256/health/marijuana-use-in-us-adults-doubles-in-decade-surveys-show.html", "country": "US", "title": "Marijuana use in U.S. adults doubles in decade, surveys show", "performance_score": 0, "site": "abqjournal.com", "participants_count": 2, "title_full": "Albuquerque Journal | Marijuana use in U.S. adults doubles in decade, surveys show", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T04:34:00.000+03:00", "replies_count": 1, "uuid": "d241fb7142856f56f539fe95f66bd71bcf516d28"}, "author": "Lindsey Tanner / The Associated Press", "url": "http://www.abqjournal.com/663256/health/marijuana-use-in-us-adults-doubles-in-decade-surveys-show.html", "ord_in_thread": 0, "title": "Marijuana use in U.S. adults doubles in decade, surveys show", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO — Marijuana use among U.S. adults doubled over a decade, rising to almost 10 percent or more than 22 million mostly recreational users, government surveys show.\nThe trend reflects a cultural shift and increasingly permissive views about the drug, the researchers say, noting that other studies have shown increasing numbers of adults think marijuana should be legalized. Recreational use is now permitted in four states.\nAlmost 1 in 3 users had signs of marijuana dependence or abuse, a slight decline from a decade ago.\nThe results come from a comparison of health surveys from 2001-02 and 2012-13 sponsored by the National Institute on Alcohol Abuse and Alcoholism. Almost 80,000 adults aged 18 and older participated in face-to-face interviews about various health-related behaviors. Results were published Wednesday in the journal JAMA Psychiatry.\nPOT PARTAKERS\nParticipants were asked if they had used marijuana in the past year, and about signs of problematic use. Those include trying but unable to reduce heavy use, and continued use despite knowing it may be damaging health or causing depression or anxiety — problems affecting about 6.8 million adults, the latest survey suggests.\nUse increased among all ages but was most common in adults aged 18-29.\nTeen marijuana use is higher. About 23 percent of high school students had used the drug in the past month in 2013 — but it has been somewhat stable during the past decade, other research shows.\nEXPERTS’ TAKE\nBecause most states didn’t have medical marijuana laws during the survey years, the results likely reflect mostly recreational use, said Deborah Hasin, a Columbia University professor, substance abuse researcher and the study’s lead author.\nThe results “show people can use marijuana without harms, but there are risks,” she said, adding that more research on causes of problematic use is needed.\nDr. Wilson Compton, deputy director of the National Institute on Drug Abuse, said other research has shown similar trends but that the sharp increase found in the surveys is striking. Prevalence of dependence “is of great concern” to public health officials, he said.\nMARIJUANA LANDSCAPE\nRecreational use is legal in four states — Alaska, Colorado, Oregon and Washington — and many more have moved to reduce penalties for marijuana possession. Proposed laws supporting recreational use have been introduced in at least 21 states this year, according to the National Conference of State Legislatures.\nMedical marijuana programs have been approved in 23 states.\n___\nOnline:\nJAMA Psychiatry: http://bit.ly/1LnNeCK", "external_links": ["http://bit.ly/1LnNeCK"], "published": "2015-10-22T04:34:00.000+03:00", "crawled": "2015-10-22T16:54:28.056+03:00", "highlightTitle": ""}