{"organizations": [], "uuid": "ea87db1a9d28d7bd873f95c85ff07d307dbc6528", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.al.com", "main_image": "http://imgick.al.com/home/bama-media/width620/img/alphotos/photo/2015/10/17/18994727-large.jpg", "site_section": "http://impact.al.com/alabama/atom.xml", "section_title": "Alabama Sports", "url": "http://www.al.com/alabamafootball/index.ssf/2015/10/two_alabama_dbs_break_school_r.html", "country": "US", "title": "Two Alabama DBs break school records, add to already strong seasons", "performance_score": 0, "site": "al.com", "participants_count": 1, "title_full": "Two Alabama DBs break school records, add to already strong seasons", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T17:21:00.000+03:00", "replies_count": 0, "uuid": "ea87db1a9d28d7bd873f95c85ff07d307dbc6528"}, "author": "Matt Zenitz | mzenitz@al.com", "url": "http://www.al.com/alabamafootball/index.ssf/2015/10/two_alabama_dbs_break_school_r.html", "ord_in_thread": 0, "title": "Two Alabama DBs break school records, add to already strong seasons", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments \nOne final interception return for a touchdown sealed the win. \nTexas A&M remained within striking distance, down just 11 and possessing the ball with more than five minutes left in the fourth quarter. \nThat changed when Alabama freshman cornerback Minkah Fitzpatrick intercepted Aggies quarterback Kyle Allen over the middle of the field, worked toward the sideline and ran the rest of the way for a 55-yard touchdown return. \nFitzpatrick had two interceptions, returning both for touchdowns during Alabama's 41-23 win over Texas A&M Saturday. Strong safety Eddie Jackson, meanwhile, had two interceptions of his own, including one he returned 93 yards for a score to give the Tide a 28-6 lead midway through the second quarter. \nBoth broke school records Saturday while adding to what has already been strong seasons for both. \nFitzpatrick became the first Tide player to ever return two interceptions for scores in one game. \nJackson had 119 yards in interception returns, a new school record. \nIn addition, Alabama's 207 total interception return yards are a new single-game school record, the third-highest mark in SEC history and the most an SEC team has posted since Tennessee had 214 in 1971. \nRELATED: Inside Minkah Fitzpatrick's rise from 'peanut butter room' to one of Alabama's top young players \nThrough seven games, Fitzpatrick is tied for fifth on the Tide with 24 tackles, has three stops for a loss, two sacks, the two pick-sixes, a team-high six pass breakups among non-defensive linemen and a blocked punt that he recovered and returned for a touchdown. \nJackson — who moved from cornerback to safety during the spring — is tied with Fitzpatrick for fifth on the team with 24 tackles, has five interceptions, two pick-sixes and a forced fumble that he recovered. \nOnly five players nationally entered Saturday with at least five interceptions. \nJackson has already established a new Alabama record for interception return yards in a season with 230. \nThe previous record was 163. Eddie Jackson's pick-six vs Texas A&M This low angle replay captures the full speed and dramatic return from Eddie Jackson's pick-six against Texas A&M", "external_links": [], "published": "2015-10-18T17:21:00.000+03:00", "crawled": "2015-10-18T18:22:30.709+03:00", "highlightTitle": ""}