{"organizations": ["Carolina Panthers"], "uuid": "5d99fe73270bf4942196ba3f997b8cb480962de3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.google.com", "main_image": "http://imgick.cleveland.com/home/cleve-media/width620/img/sports_impact/photo/19047558-large.jpg", "site_section": "http://news.google.com/news?pz=1&cf=all&ned=us&hl=en&topic=s&output=rss", "section_title": "Sports - Google News", "url": "http://news.google.com/news/url?sa=t&fd=R&ct2=us&usg=AFQjCNHd1z84ozHJFgiK_3dNpP0SaUeuxQ&clid=c3a7d30bb8a4878e06b80cf16b898331&cid=52778976876990&ei=mCcuVpj0KtOCaKqKnIAG&url=http://www.cleveland.com/sports/index.ssf/2015/10/new_england_patriots_carolina_2.html", "country": "IL", "title": "New England Patriots, Carolina Panthers stay unbeaten; remembering Flip ... - cleveland.com", "performance_score": 0, "site": "google.com", "participants_count": 0, "title_full": "New England Patriots, Carolina Panthers stay unbeaten; remembering Flip ... - cleveland.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T14:23:00.000+02:00", "replies_count": 0, "uuid": "5d99fe73270bf4942196ba3f997b8cb480962de3"}, "author": "", "url": "http://news.google.com/news/url?sa=t&fd=R&ct2=us&usg=AFQjCNHd1z84ozHJFgiK_3dNpP0SaUeuxQ&clid=c3a7d30bb8a4878e06b80cf16b898331&cid=52778976876990&ei=mCcuVpj0KtOCaKqKnIAG&url=http://www.cleveland.com/sports/index.ssf/2015/10/new_england_patriots_carolina_2.html", "ord_in_thread": 0, "title": "New England Patriots, Carolina Panthers stay unbeaten; remembering Flip ... - cleveland.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments \nCLEVELAND, Ohio – The growing connection between Cam Newton and Ted Ginn Jr. and the long-established link between Tom Brady and Danny Amendola helped the Carolina Panthers and the New England Patriots remain unbeaten Sunday. The NBA, and especially the Minnesota Timberwolves, mourned the death of Cuyahoga Heights native Flip Saunders. LeBron James returned to practice, but his status for Tuesday's opener is unclear. \nThe New York Mets and Kansas City Royals are set to begin the World Series Tuesday in Kansas City. \nArian Foster and Josh McCown top the NFL injury report. Johnny Manziel could start for the Browns, pending an NFL investigation. \nA controversial finish at Talladega had Kevin Harvick denying he caused a crash so he could advance in the NASCAR Sprint Cup playoffs, which waved goodbye to Dale Earnhardt Jr., among others. \nA rookie named Smyie Kaufman won on the PGA Tour while Formula One driver Lewis Hamilton joined elite company. \nIt's time to gear up for the Breeders Cup. \nAnd bear hunting in Florida ended with a bang. \nThese are some of the trending sports stories Monday: \nCarolina loves Ginn: Ted Ginn Jr. has played professionally for teams in Florida, California, Arizona and North Carolina. \nNorth Carolina has been good to him. \nGinn, formerly known as a draft bust during his time with the Miami Dolphins, has flourished in his two stints with the Carolina Panthers, and that continued Sunday night in the 27-16 win against the Philadelphia Eagles. Ginn hauled in five catches for 59 yards to lead the team and threw in a run of 43 yards as he continues his return to relevance in Charlotte. (Charlotte Observer) \nDanny Amendola leads Pats: On a day when receivers were dropping passes left and right, Danny Amendola proved to be one of the most sure-handed. \nThe veteran wideout was targeted nine times and caught eight passes for 86 yards, including the go-ahead touchdown with 7:16 left, as the Patriots defeated the Jets, 30-23, yesterday at Gillette Stadium. (Boston Herald) \nJohnny Manziel next up for Browns: Johnny Manziel might have to start next week against the Cardinals because of Josh McCown's shoulder injury -- providing he's not suspended by the NFL by then for his domestic incident on Oct. 12. The NFL has scheduled an interview with Manziel, but the date and location of that meeting is not yet known, a league source said. After the 24-6 loss to the Rams, during which Manziel replaced McCown with 3:26 left, Manziel addressed his domestic incident for the first time, but declined to go into detail. (cleveland.com) \nNFL injury report: Arian Foster injured his right Achilles tendon late in the fourth quarter of Houston's 44-26 loss at Miami on Sunday. Texans coach Bill O'Brien said he didn't know the severity of the injury, but added \"it obviously didn't look good.\" If Foster tore his Achilles, his season is over. FOX Sports NFL Insider Mike Garafolo reported Sunday that initial tests on the tendon are indeed that it is torn. (Fox Sports) \nFlip Saunders loomed large in NBA: Once deemed too small to make it big in the sport he so loved, Flip Saunders became a Minnesota basketball icon: a four-year starter at the University of Minnesota, the winningest coach in Timberwolves history and, in his second stint with the team, one of the most powerful executives in professional basketball. \nThe team announced \"with extreme sadness\" that its part-owner, president of basketball operations and head coach had died Sunday morning, four months after he began chemotherapy for Hodgkin's lymphoma, then suffered complications from the treatment. \nHe was 60. (Minneapolis Star Tribune) \nMary Schmitt Boyer recalls Saunders : I'm surprised Flip Saunders ever talked to me again. \nOur first meeting, in the early 1990s, was awkward, to say the least -- an awkwardness that was entirely my fault. \nBut Saunders, 60, who died of cancer much too soon on Sunday, became a good friend during my 25 years of covering the NBA -- and even after I left The Plain Dealer in 2014. (The Plain Dealer) \nSaunders' love of the game: Flip Saunders loved to talk basketball. Absolutely loved it. \nDidn't matter the occasion, whether it was on or off the record, at morning, noon or night. Flip was at his best talking basketball. \nThe man had a million basketball stories, usually involving one of his million friends, former teammates or coaches. (Minneapolis Star Tribune) LINK: More Flip Saunders coverage from Minneapolis Star Tribune \nLeBron James practices: LeBron James practiced fully on Sunday for the first time since receiving an anti-inflammatory injection in his back on Oct. 13, a step toward joining the Cavaliers on the court when the 2015-16 NBA season opens Tuesday in Chicago. James, who has never missed an opener as he enters his 13 th season, said I \"think the real test will be how I feel tomorrow when I get up\" as he stopped short of declaring himself a go for Tuesday night. (cleveland.com) \nBreaking down Mets and Royals: A position-by-position look at the New York Mets and Kansas City Royals going into the World Series, starting Tuesday night at Kauffman Stadium (Associated Press) \nJoey Logano wins, Dale Earnhardt Jr. eliminated in controversial race: Joey Logano used a controversial finish at Talladega Superspeedway to sweep the second round of NASCAR's playoffs and end Dale Earnhardt Jr.'s championship chances. \nThe race ended under caution when reigning Sprint Cup champion Kevin Harvick stumbled on the final restart to trigger a multi-car accident in the middle of the field. Because NASCAR said this week it would make just one attempt to finish the race under the green flag, the field was frozen and Earnhardt was denied the chance to race Logano for the win. (Associated Press) \nKevin Harvick denies causing wreck: Kevin Harvick denied triggering a last-lap wreck Sunday at Talladega Superspeedway to ensure his advancing into the next round of the Chase for the Sprint Cup. \nAfter one restart was aborted because of a crash before the leaders got to the start-finish line, Harvick, in 10th, was in jeopardy of falling out of the Chase as his motor was about to blow prior to the one attempt to have a green-white-checkered finish. (ESPN) LINK: Video of wreck and finish from Harvick's dash camera \nLewis Hamilton wins U.S. Grand Prix: Lewis Hamilton joined the elite group of triple Formula One world champions on Sunday after winning a thrilling U.S. Grand Prix that kept the crowd on tenterhooks right to the very end. \nThe first British driver to win back-to-back titles, Hamilton realized a lifelong ambition to equal the tally of his boyhood idol Ayrton Senna, the Brazilian triple champion who died in 1994. \nFerrari's four-time champion Sebastian Vettel finished third, after starting 13th and fighting back to chase Rosberg nose-to-tail over the final lap with the crowd on the edge of their seats on a cold and blustery afternoon after morning rain. (Reuters) \nGear up for the Breeders Cup: They say if you want to make an impression in Lexington you must remember your three Bs - Basketball, Bourbon and Betting. Next weekend the latter of the trio becomes the focal point as 200 pre-entries have been declared for the latest edition of the Breeders' Cup, first run at Hollywood Park way back in 1984. \nThen the event was a seven-race experience, run in a day. Next weekend, however, Breeders' Cup moves its circus for the very first time to the cradle of the breeding industry at Keeneland for a two-day extravaganza featuring 13 races with a prize fund of $26m. Oh, and as ever, the Europeans are coming. (Irish Times) \nRookie Smylie Kaufman wins Shriners Open : The puns on his first name undoubtedly have been used countless times. So let's just say Smylie Kaufman had a lot to smile about Sunday. \nThe PGA Tour rookie had the best day of his brief professional career, tearing up TPC Summerlin with a final-round 10-under-par 61 and holding off six pursuers to win the Shriners Hospitals for Children Open. \nKaufman finished with a four-day total of 16-under 268. It was the highest winning score for the Shriners Open since the tournament went to a four-round format in 2004. In 2005, Wes Short Jr. won with a 266. (Las Vegas Review-Journal) \nFlorida bear hunt halted: Florida's first bear hunt in two decades, which sparked protests by animal rights activists, was called off after just two days after nearly 300 bears were killed, wildlife officials said on Sunday. \nThe hunt, which was slated to last up to one week and allow as many as 320 black bears to be killed, was ended after 295 of the animals were \"harvested,\" the Florida Fish and Wildlife Conservation Commission said in a statement. \nThe hunt aimed to stabilize a population of bears that had rebounded to more than 3,000 from several hundred in the 1970s, according to the commission. (Reuters)", "external_links": [], "published": "2015-10-26T14:23:00.000+02:00", "crawled": "2015-10-26T15:16:27.211+02:00", "highlightTitle": ""}