{"organizations": [], "uuid": "0f3b98f35bc247691b66efaa9601d25ea9dc966d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "http://images.worldnow.com/AP/images/9095394_G.jpg", "site_section": "http://www.cbs8.com/category/13548/college-sports-news", "section_title": "College Sports: NCAA news, scores, updates &amp; more - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30345342/hamilton-wins-us-grand-prix-and-f1-season-championship", "country": "US", "title": "Hamilton wins US Grand Prix and F1 season championship", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Hamilton wins US Grand Prix and F1 season championship - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T02:00:00.000+02:00", "replies_count": 0, "uuid": "0f3b98f35bc247691b66efaa9601d25ea9dc966d"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30345342/hamilton-wins-us-grand-prix-and-f1-season-championship", "ord_in_thread": 0, "title": "Hamilton wins US Grand Prix and F1 season championship", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By JIM VERTUNO\nAP Sports Writer AUSTIN, Texas (AP) - Lewis Hamilton seized on a late mistake by Mercedes teammate Nico Rosberg to win the United States Grand Prix on Sunday and secure his third Formula One season championship.\nHamilton overtook Rosberg with eight laps to go when Rosberg locked his tires and helplessly watched his teammate zoom past.\nHamilton had to beat Rosberg and outscore Ferrari's Sebastian Vettel by nine points to wrap up his second consecutive championship with Mercedes. He also won with McLaren in 2008.\nThe win also gave Hamilton his 21st victory over two seasons and 10th this year. He is the first Formula One driver to win 10 or more races in consecutive seasons.\nVettel, who could have pushed the title chase to next week in Mexico City, finished third after starting 13th.\nHamilton's third world championship puts his name among the top drivers in the history of the sport, matching title wins with greats like his idol Ayrton Senna, and tying Jackie Stewart for most championships by a British driver. Only Michael Schumacher, Juan Manuel Fangio, Alain Prost and Vettel have won more.\nAfter the race Hamilton radioed to his crew \"This is the greatest moment of my life. To my family, I love you all.\"\nThe 30-year-old's first world title came down to the final turn in the final race of the season. The last two have been more dominant, and this latest one was decided in a thrilling duel with his teammate.\nHamilton's switch to Mercedes in 2013 put him with the team that would prove to be far ahead of the pack since Formula One's engine switch from the screaming V8s to a V6 turbo hybrid.\nHamilton's been out front ever since. His closest rival has been Rosberg, who challenged for the title in 2014, but saw his chance die in the final race and hasn't been able to come nearly as close this year.\nHamilton's title march seemed inevitable entering the weekend until harsh weather pounded the Austin area for three days, forcing drivers and teams to push their cars through difficult conditions of a slick track and low visibility.\nConstant rain pushed qualifying all the way to Sunday morning, the first time that's happened since 2013 and just the fourth since 2004.\nAfter difficult qualifying when Rosberg took the pole position, Hamilton warned he'd be cautious and wouldn't do anything \"crazy.\"\nBut there was no way he wasn't going to gun for the title.\nHamilton roared out of the start and forced Rosberg wide into the first turn at the top of the 130-foot incline. By the time the cars were hurtling back down the hill, Hamilton had seized the lead. The move literally gave Rosberg nowhere to go and the German soon found himself in fourth as Red Bull's Daniil Kvyat and Daniel Ricciardo jumped into the gap on Hamilton's rear.\nThe Mercedes and Red Bull cars exchanged a series of overtaking moves over the first 20 laps with the front-runners jockeying through wheel-to-wheel racing. Vettel, whose new engine had turned in impressive times in practice and qualifying, crept his way through the field in hopes of keeping his own slim title chances alive.\nBut the race and the championship again boiled down to Mercedes duel over the final 10 laps.\nAnd then Rosberg opened the door to the world champion.\nAfter holding Hamilton off on the long straight away at the Circuit of the Americas, Rosberg made the critical mistake between turns 12 and 13. He skidded left on the grass, and tried to recover as Hamilton zipped by.\nRosberg set a scorching lap to catch Hamilton but couldn't do it and had to fight off Vettel just to stay in second.\n ", "external_links": [], "published": "2015-10-25T02:00:00.000+02:00", "crawled": "2015-10-25T23:30:35.141+02:00", "highlightTitle": ""}