{"organizations": [], "uuid": "f1a3da76d5e7ddcf397c50edd1b5e03ddc3ab875", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.commercialappeal.com", "main_image": "http://media.jrn.com/images/Gabby+Little.jpg", "site_section": "http://www.commercialappeal.com/sports/index.rss", "section_title": "Sports", "url": "http://www.commercialappeal.com/sports/littles-four-goals-lead-mustangs-to-regional-championship-225863f5-fb73-6793-e053-0100007f005e-335440011.html", "country": "US", "title": "Little’s four goals lead Mustangs to regional championship", "performance_score": 0, "site": "commercialappeal.com", "participants_count": 1, "title_full": "Little’s four goals lead Mustangs to regional championship", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T06:06:00.000+03:00", "replies_count": 0, "uuid": "f1a3da76d5e7ddcf397c50edd1b5e03ddc3ab875"}, "author": "John Varlas", "url": "http://www.commercialappeal.com/sports/littles-four-goals-lead-mustangs-to-regional-championship-225863f5-fb73-6793-e053-0100007f005e-335440011.html", "ord_in_thread": 0, "title": "Little’s four goals lead Mustangs to regional championship", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Gabby Little, Houston soccer Pretty much everything Gabby Little touched ended up in the back of the net Wednesday. And because of her efforts, Houston is one victory away from another state tournament trip.\nThe Mustangs — last year's AAA runners-up and the 2013 champs — won the Region 8-AAA championship over visiting Collierville, 4-0. Little, who is committed to Ole Miss, got all four of the goals for the Mustangs, who will host the loser of Thursday's Bartlett-Arlington match for the right to go Murfreesboro next week.\n\"Our whole team — and the boys team, too — their mindset when they come here is them against everybody,\" said Houston coach David Wolff. \"It's them against the world, and they just go out there and eat rocks.\"\nHouston (18-0-0) attacked from the outset and got its first goal about 12 minutes in when Jillian Hildreth made a great surging run to the right before crossing for Little.\nShe then added three more after halftime, getting the fourth when Collierville goalkeeper Emily Samisch parried Jenna Kemp's hard shot right into her path.\n\"I just was just really looking to get my teammates to play off me,\" Little said. \"They were actually double-teaming Paola (Ellis) and I was able to make some runs.\"\nFor the Dragons, it was an emotional night.\nCoach Brittany Streger said before the game her team attended the funeral of Grant Roberson, a Collierville student who died last week due to injuries sustained in a car wreck. That, coupled with the death two weeks ago of popular cross-country coach Robbie Simmons, has taken its toll.\n\"It's tough,\" Streger said. \"They're high school kids.\"\nCollierville will travel to face the Bartlett-Arlington winner on Saturday for the right to advance to state.\nSAINTS, LIONS WIN AT STATE\nBriarcrest and Harding — who finished the regular season ranked 1-2 in The Commercial Appeal's Super Six — opened the state volleyball tournament with victories Wednesday in Murfreesboro.\nThe Saints (44-4) defeated Nashville Father Ryan 25-21, 25-16, 25-19 to set up a Division 2-AA semifinal against powerful Chattanooga Baylor Thursday at 11:30 a.m. at MTSU. Baylor (44-4) advanced with a 25-20, 25-15, 25-12 victory over St. Agnes.\nThe Stars were later eliminated by Father Ryan, winning the first two sets before falling in five.\nIn Division 2-A, Harding (40-6) downed St. Mary's 25-16, 25-18, 25-17 to set up a semifinal match against Knoxville Webb at 10 a.m. at MTSU. Webb (51-4) defeated St. George's, 25-16, 19-25, 25-12, 25-12 to advance.\nIn an elimination match later, the Gryhons ousted the Turkeys 26-24, 25-21, 25-22 and will play at 1 p.m. at MTSU against the Harding-Webb loser. It was the first trip to state in school history for St. Mary's.\nIn AAA, White Station — making its first appearance at state since 1997 — lost to Murfreesboro Siegel in its opener (25-11, 25-11, 25-13) and then to Franklin (25-21, 25-16, 18-25, 22-25, 15-7) and was eliminated.\nHouston lost its opener in three sets against Farragut, then played Ooltewah in a late elimination game. Action at the Murphy Center was delayed for around three hours due to a power outage.", "external_links": ["http://media.jrn.com/images/Gabby+Little.jpg", "http://media.jrn.com/images/200*299/Gabby+Little.jpg"], "published": "2015-10-22T06:06:00.000+03:00", "crawled": "2015-10-22T12:25:03.298+03:00", "highlightTitle": ""}