{"organizations": [], "uuid": "c18a64c0f4436de6a3cb691782c5f3f4c2ab10f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mailtribune.com", "main_image": "http://www.mailtribune.com/Global/images/head/nameplate/MailTribune_logo.png", "site_section": "http://www.mailtribune.com/sports?template=rss&mime=xml", "section_title": "Sports - MailTribune.com", "url": "http://www.mailtribune.com/article/20151007/SPORTS/151009665/101039/SPORTS?rssfeed=true", "country": "US", "title": "Raiders home to begin second half of CCC", "performance_score": 0, "site": "mailtribune.com", "participants_count": 1, "title_full": "Raiders home to begin second half of CCC", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:52:00.000+03:00", "replies_count": 0, "uuid": "c18a64c0f4436de6a3cb691782c5f3f4c2ab10f8"}, "author": "SOU Sports Information", "url": "http://www.mailtribune.com/article/20151007/SPORTS/151009665/101039/SPORTS?rssfeed=true", "ord_in_thread": 0, "title": "Raiders home to begin second half of CCC", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Raiders home to begin second half of CCC Comment Posted Oct. 7, 2015 at 7:52 PM By SOU Sports Information Posted Oct. 7, 2015 at 7:52 PM » Social News ASHLAND — The unusually high degree of difficulty Southern Oregon University faced during last week's road trip to College of Idaho and Eastern Oregon was not overlooked this week by NAIA Top 25 voters. That's why, despite enduring their first two losses of the season, the Raiders were still No. 12 in Tuesday's latest poll — just four spots down from last week and one spot back from where they were at this point a year ago. That puts the Raiders (15-2, 8-2 Cascade Conference) in favorable position going into the second half of their 20-match CCC schedule. All five of the other teams with records of .500 or better in league contests will have to play on SOU's home floor this time around. It starts this weekend, as third-place Northwest (12-5, 8-3) visits Riehm Arena for a 7 p.m. match Friday and Evergreen (3-13, 3-8) will be in town for a 5 p.m. match Saturday. Week in review: SOU was victimized Friday by the College of Idaho's All-American setter, Sierra Porter, who had 50 assists in leading the Coyotes to a 17-25, 25-17, 25-18, 25-23 upset. Their .278 attacking average was the highest for a Raider opponent all season, until No. 7 Eastern Oregon hit .336 behind three attackers with 11 kills apiece in Saturday's 25-21, 25-15, 26-24 sweep. It had been 40 matches since the last time SOU dropped a league match in straight sets. The Raiders hadn't lost back-to-back CCC matches since making the same road trip to close out the 2012 regular season. About that Top 25 : Biola (Calif.) kept the No. 1 ranking for the sixth straight week and is one of five undefeated teams remaining in the NAIA. Eastern Oregon has won 12 straight and still leads the CCC, but didn't move up from the No. 7 spot it's held the last four weeks. College of Idaho broke back into the receiving votes category and is No. 34 overall. Home history: The Raiders are 118-16 at home over the last 10 seasons. Their longest win streak over that stretch was 20, starting late in 2006 and extending into the '07 season. They can extend their streak to 16 and 17 this weekend, and have also won 16 consecutive sets at Riehm Arena. Leaderboard : Through 10 matches, the team leaders in the CCC are consistent with the standings: SOU is second to EOU in attacking average (.245), average against (.124), kills per set (13.6) and blocks pet set (2.3), and third in assists (12.5) and digs (15.4). The balance of the Raiders makes them hard to prepare for; five different starters are averaging at least two kills per set in CCC play, and EOU is the only other team that can make that claim. It also makes spotting trends a challenging task, as all of those players have led the team in kills at some point. Tyana Andrews was the most consistent threat last weekend with 21 kills compared to six errors, and she ranks sixth in the CCC at 3.2 kills per set. Niki Small (.403) and Emma Gasman (.340) rank first and fourth in attacking average, and Lauren McGowne is second in assists (11.1). Gasman and Small also lead the Raiders defensively, ranking four (1.2/set) and sixth (1.0/set) in the league, and redshirt-freshman Ashlyn Flynn is second in digs (4.9/set). About Northwest : The Raiders will attempt to extend their win streak in the series against Northwest to 24 matches after dominating the first meeting on Sept. 12 with 25-19, 25-18, 25-11 win. The Eagles are off to their best start in 10 years and riding a four-match win streak, but still haven't taken a set from a top-three team in the conference. They rank fourth in attacking average (.230) and average against (.156), and have two of the most efficient attackers in the league in Hannah Hanson (.289) and Dakota Adams (.276). The lead the CCC in aces per set (2.1) but allowed SOU to record 10 of its own during the first meeting. About Evergreen : The Raiders have won 24 straight matches and 58 straight sets against the Geoducks, most recently winning 25-20, 25-16, 25-19 on Sept. 11 in Olympia. They're eighth in the CCC in attacking (.131) and 10th in opponents' average (.241), and had lost nine straight until Saturday's sweep of Walla Walla. Freshman Natalie Taylor has provided a spark with 3.4 kills per set, and junior Jorden Porter averages 3.0. Men’s Soccer RAIDERS ON ROAD : The Southern Oregon men's soccer team travels to Washington this week to take on Evergreen State College in Olympia on Friday and Northwest University in Kirkland on Saturday. Both games start at noon. The Raiders (9-4, 4-4 CCC) had home-field advantage last weekend and took advantage with three key points. Warner Pacific defeated SOU on Friday, 4-1, but the Raiders bounced back with a 1-0 win against Eastern Oregon on Saturday. Five Cascade Conference games are left on the schedule. The Raiders are tied in sixth place with Oregon Tech and have just as many points (15) as the third-place team, but have played at least one more game than everyone except the Owls. Ten teams own CCC records of .500 or better, but only eight will qualify for the conference tournament. Quick Strikes: - Freshman Diego Buenrostro scored SOU's goal Friday and Kirk Bassett had the game-winner on Saturday. Of the 33 goals the Raiders have this season, 27 have been scored by freshmen, and 17 of 23 have been assisted by freshmen. - The Raiders are 5-3 on the road, with a 1-3 mark in the CCC. - SOU has tallied 32 goals and 96 shots on goal to its opponents 15 goals and 59 shots on goal. - SOU goalkeeper Jonathan Morales got his fourth start of the season against Eastern Oregon, collecting a season-high four saves. The shutout was his third, and he's allowed one goal with 12 saves overall. - The team's leaders in points are Brendan Allen (7 goals, 2 assists), Ahmon Afenegus (4 goals, 5 assists), Dakota Marquez(4 goals, 3 assists) and Diego Buenrostro (5 goals). Around the CCC : Corban, which has not allowed a goal this season, is No. 7 and Rocky Mountain is No. 20 in the latest NAIA Top 25 poll. The teams will meet Saturday in Salem for the NAIA Game of the Week. About Evergreen : The Geoducks (7-1, 4-1) have outscored their opponent 32-5 overall and 17-2 in the CCC. Their only loss of the season was against Northwest (2-1) on Sept. 26. Midfielder Juan Lopez owns a team-high six goals. He punched in five of those last weekend against Multnomah and Walla Walla. Tanner Williams leads in assists (9) and shots (35). About Northwest : Picked second in the CCC preseason poll, the Eagles are 5-5 overall and 3-2 in the CCC. Junior midfielder Kyle Zimmerman leads the team in goals (seven), shots (36) and shots on goal (19). Against Pacific on Sept. 5 Zimmerman tallied a season high two goals. Eagle goalkeeper Daniel Christenson has appeared in ten games and started in nine of those. He has tallied 50 saves, 27 of those coming in the first three games of the season. By SOU Sports Information", "external_links": [], "published": "2015-10-08T03:52:00.000+03:00", "crawled": "2015-10-08T06:46:18.488+03:00", "highlightTitle": ""}