{"organizations": [], "uuid": "b8b9227479b9879707b43faafff2cbde4b244fe9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nydailynews.com", "main_image": "http://assets.nydailynews.com/polopoly_fs/1.2392664!/img/httpImage/image.jpg_gen/derivatives/landscape_1200/nhl.jpg", "site_section": "http://www.nydailynews.com/sports/index.html", "section_title": "Sports News &amp; Articles: Today’s Latest Sports News - NY Daily News", "url": "http://www.nydailynews.com/sports/hockey/rangers/rangers-line-hayes-stepan-kreider-showing-chemistry-article-1.2392665", "country": "US", "title": "Rangers' line of Hayes-Stepan-Kreider showing chemistry", "performance_score": 0, "site": "nydailynews.com", "participants_count": 1, "title_full": "Rangers' line of Hayes-Stepan-Kreider showing chemistry - NY Daily News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "b8b9227479b9879707b43faafff2cbde4b244fe9"}, "author": "NEW YORK DAILY NEWS", "url": "http://www.nydailynews.com/sports/hockey/rangers/rangers-line-hayes-stepan-kreider-showing-chemistry-article-1.2392665", "ord_in_thread": 0, "title": "Rangers' line of Hayes-Stepan-Kreider showing chemistry", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jerry Lai/USA Today Sports Derek Stepan and the Rangers return to the Garden Saturday night with a 2-0 record. Friday night’s 4-2 victory in Columbus put Rangers center Derek Stepan in a great mood, and not only because he and right wing Kevin Hayes had teamed to score the winning goal for the second straight game to open the season.\nStepan was more excited by what he’d learned overall from Friday’s effort about his new line with Hayes and left wing Chris Kreider: That they seem to have an intuitive feel for each other on the ice, which is no given even when elite talents merge.\n“Our line has good chemistry,” Stepan said before flying home to host the Blue Jackets in Saturday night’s home opener at the Garden. “It’s crazy. We always talk about how difficult it is at times to find that. We clicked, and we seemed to find each other.”\nKreider and Stepan have a well-established chemistry going back to Alain Vigneault’s first season with the team – the coach rarely if ever separates them. Hayes’ addition to start this season, however, was a new, unfamiliar wrinkle.\nFOLLOW THE DAILY NEWS SPORTS ON FACEBOOK. \"LIKE\" US HERE\nHayes centered the Rangers’ third line last season as a rookie, but this fall, rookie center Oscar Lindberg made the team. Vigneault also doesn’t trust J.T. Miller in the defensive zone, so the coach opted for Hayes’ upside in his top-six to begin the regular season.\nWednesday night in Chicago, Hayes’ incredible pop pass back in front of an empty Blackhawks net set up Stepan’s first-period goal for a 3-1 lead, which held up as the game-winner in a 3-2 victory. Then on Friday night in Columbus, in a game in which Stepan was fast and determined with and without the puck, Hayes’ playmaking and puck-handling stood out especially off the rush with his center and the speedy Kreider.\nHayes’ scored a side-angle goal on a snoozing Sergei Bobrovsky off a Stepan feed for Friday’s game-winner, but it was more about what he’d done the rest of the night that illustrated his greatest value.\n“Hayes-ee scores kind of a goofy one, but we had some great looks all night long,” Stepan said. “We were moving our feet. Hayes-ee is a guy who can make plays on his own, and that helps our line. And if I can get pucks up to them and they can go two-on-two the other way on their ‘D,’ it opens everything up. We’re feeling good as a line.”\nStepan’s intelligent playmaking and position, Hayes’ elite size and skill, and Kreider’s speed and physicality are a potentially lethal combination if they can maintain that chemistry consistently. They can be better than they were on Friday, too, as pointed out by Vigneault.\n“Other than our not wanting to shoot the puck as much as I would have liked, especially on the rush, I thought for the most part we did alright,” he said.\nHayes in particular had a couple of plays off the rush when he either held the puck too long and lost an opportunity to make a play, or passed when maybe he should have shot it, even though he still finished with four shots on goal – another indicator of how he played.\nThat’s why, Vigneault said, no one should shake their head at Hayes’ fluky game-winning goal from the wing.\n“But that’s about shooting the puck,” Vigneault said. “So I think a couple of instances where we had great opportunities to get it on net but we wanted that extra pass. And (Hayes’ goal) is a great example where sometimes you’ve just got to throw it on the net.”\nIt’s constructive criticism for Vigneault’s young forwards, who finding a rhythm sooner than they expected.\nRelated Stories Rangers ride three-goal outburst for 4-2 win in Columbus Rangers open season with 3-2 win over Blackhawks Adam Graves lays wreath at gravesite of Rangers founder Ex-Ranger Aaron Ward arrested after incident with wife", "external_links": ["https://www.facebook.com/NYDNSports", "http://www.adobe.com/go/getflashplayer", "http://static.eplayer.performgroup.com/flash/js/performgroup.js", "http://images.performgroup.com/namedImage/12637/install_flash.gif", "http://static.eplayer.performgroup.com/flash/js/swfobject.js"], "published": "2015-10-10T03:00:00.000+03:00", "crawled": "2015-10-10T23:40:05.390+03:00", "highlightTitle": ""}