{"organizations": [], "uuid": "df01b2ddcf57642cff17e5cdfb1dccb7d2ced036", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/editorials/climate-change-action/141523.html", "country": "US", "title": "Climate change action", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "Climate change action", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "df01b2ddcf57642cff17e5cdfb1dccb7d2ced036"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/editorials/climate-change-action/141523.html", "ord_in_thread": 0, "title": "Climate change action", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Decades of negotiations later, who bears the blame and the bill remains at the centre of the global fight against climate change. An agreeable middle ground is what the Paris summit seeks to achieve in a few months from now. While standing up to the developed world's pressure to do more, emerging economies like India continue to fall back upon claims of a relatively lesser contribution to climate change and the urgent need for development. India has climbed up several notches in the list of worst polluters, so the fundamental defence is fast losing ground. Growth at the cost of rampant environmental loss too deserves a serious policy relook. Conversely, the country's Intended Nationally Determined Contributions towards a post-2020 international pact invoke Mahatma Gandhi's message of human beings acting as trustees of natural resources. New Delhi’s climate action plan for 2030 pledges energy efficiency. India is banking on a reduction in emissions intensity, or emissions per unit of GDP, increasing the forest cover, and a larger role for renewable energy in power generation. The target of 33-35 per cent reduction in emission intensity in 15 years builds on the goal India had set for itself in 2009. That commitment of a 20-25 per cent cut by 2020 at 2005 levels is achievable. The next step is difficult, after the success of basic measures such as the shift to CFL bulbs and LED lights. The industry now has to step in and take a hit. That is a challenging task, made clear by the government's admission that while it is ready for cleaner Euro 6 emission standards for vehicles, the industry is not considering the cost. The plan lists a tree fund for companies setting up projects on forest land, along with highway tree-lines. The hitch is that afforestation has limited utility; natural dense forests have the real ability to be carbon sinks. The third target is a huge jump in the share of non-fossil fuel in power generation by 2030. An ambitious task, but achievable. The estimated bill for such climate changes actions is $2.5 trillion. Now that is truly ambitious.", "external_links": [], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-05T12:34:41.642+03:00", "highlightTitle": ""}