{"organizations": ["Redskins", "Falcons"], "uuid": "381c5a1635e0a6622f321c6efbe55f77174346a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pendletontimespost.com", "main_image": "", "site_section": "http://pendletontimespost.com//feed/sec/6000/", "section_title": "PendletonTimesPost.com - Sports News", "url": "http://www.pendletontimespost.com/view/story/50253bd4b00946099e2e83c88bff9f65/FBN--Redskins/", "country": "US", "title": "WR Ryan Grant slips, Redskins fall to Falcons 25-19 in OT", "performance_score": 0, "site": "pendletontimespost.com", "participants_count": 0, "title_full": "WR Ryan Grant slips, Redskins fall to Falcons 25-19 in OT", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T01:53:00.000+03:00", "replies_count": 0, "uuid": "381c5a1635e0a6622f321c6efbe55f77174346a0"}, "author": "", "url": "http://www.pendletontimespost.com/view/story/50253bd4b00946099e2e83c88bff9f65/FBN--Redskins/", "ord_in_thread": 0, "title": "WR Ryan Grant slips, Redskins fall to Falcons 25-19 in OT", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ryan Grant", "CHARLES ODUM"], "text": "Crucial slip by WR Ryan Grant too much for Redskins to overcome in 25-19 loss to Falcons in OT By CHARLES ODUM AP Sports Writer   6:53   6:53   \nGeorgia (561) \n\nATLANTA — With his intended receiver sprawled on the field, it was difficult to tell if Kirk Cousins' last pass was on target. \nAfter Washington receiver Ryan Grant slipped, Atlanta's Robert Alford made the easy interception and returned the ball 59 yards for a touchdown, lifting the undefeated Falcons to a 25-19 win over the Redskins in overtime Sunday. \nAfter leading most of the game, the Redskins (2-3) were denied their first back-to-back wins in almost a year — since Weeks 7 and 8 in 2014. \n\"This is a tough one, man,\" said Redskins coach Jay Gruden. \"We had an opportunity.\" \nPerhaps protecting Grant, Cousins wouldn't say if his last pass was good. \n\"Until I watch the film I can't say confidently,\" Cousins said. \"... I can just say I tried to put the ball where I thought it needed to be put.\" \nGruden was more forthcoming. \n\"Our receiver slips and falls and they get a pick six,\" Gruden said. \"Ryan Grant just slipped and fell. It's unfortunate.\" \nGrant was not available for postgame interviews. \nCousins completed 21 of 32 passes for 219 yards with one touchdown and two interceptions. \n\"There's nowhere to point other than to myself,\" Cousins said. \"I've got to make those throws.\" \nWashington's dismal running game may deserve blame. Matt Jones, who sprained his big toe, had 11 carries for 20 yards, including a 1-yard touchdown run for a 13-12 lead midway through the fourth quarter. Alfred Morris had eight carries for only 15 yards. \nThe Falcons, led by Devonta Freeman's 153 yards and a touchdown, outrushed the Redskins 176-51. \n\"We haven't been too consistent with our running game the last few weeks,\" Morris said. \nThe Redskins had the first possession of OT and Cousins moved the team to midfield. On second and 8 from the 50, Grant slipped while trying to adjust to Cousins' pass. Alford was in perfect position for the interception before racing down the sideline for the touchdown. \nCousins said he felt pressure from Atlanta's pass rush before trying to complete the pass to Grant. \n\"I was hot off the left side and felt need to get rid of the football and not take a sack and kill the drive,\" Cousins said. \"... I made the throw and the guy made the play and that was it.\" \nAlford had two interceptions but also had a pass interference penalty in the fourth quarter to set up a Washington touchdown. \nAtlanta trailed 16-12 before Freeman's 6-yard scoring run with 24 seconds remaining in regulation. The Falcons (5-0) are the first team to start 5-0 when trailing in the fourth quarter of four games. \nFreeman had an apparent 13-yard scoring catch ruled incomplete on a review two plays before his scoring run. \nDustin Hopkins' 52-yard field goal for Washington on the final play of regulation forced overtime. \nThe Falcons overcame two interceptions and a lost fumble by Matt Ryan, who completed 24 of 42 passes for 254 yards with no touchdowns. \nJulio Jones, who began the day leading the NFL in catches, and Roddy White were held without a catch in the first half. Jones finished with five catches for 67 yards. White, who complained about his diminished role early in the week before meeting with coach Dan Quinn, had two catches for 23 yards. \nWhite's first catch of the day, a 16-yarder, moved the Falcons to the Washington 14 in the fourth quarter. Freeman ran for 11 yards and Atlanta again gave the ball to Freeman. He was stripped by defensive end Chris Baker near the 2 and the ball bounced into the end zone. Jones fell on the fumble for a touchdown. \nRyan's pass for Leonard Hankerson on the 2-point attempt was incomplete. \nWashington had a quick answer. Following a pass interference call against Alford, Jones' 1-yard run gave Washington a 13-12 lead; Cousins' pass for Pierre Garcon was incomplete on the 2-point attempt. \nCousins' first-quarter 7-yard pass to tight end Derek Carrier was the only touchdown for either team through three quarters. \nOnline: \nAP NFL website: http://www.pro32.ap.org and AP NFL Twitter feed: http://www.twitter.com/AP_NFL \n ", "external_links": [], "published": "2015-10-12T01:53:00.000+03:00", "crawled": "2015-10-12T03:11:24.495+03:00", "highlightTitle": ""}