{"organizations": ["EPC"], "uuid": "5b08ffcb9d8b17df9ee9f73e9c80dc1643728afd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "highschoolsports.lehighvalleylive.com", "main_image": "http://hssn-media.advance.net/PennLive.com/news/812a7851c3959e687047c6dc1e2e872c/MTWhitehallFreedomfootball.jpg", "site_section": "http://blog.lehighvalleylive.com/lehighvalleylive_high_school_sports_homepage_feed/atom.xml", "section_title": "lehighvalleylive.com High School Sports", "url": "http://highschoolsports.lehighvalleylive.com/news/article/-6677145037001707195/freedoms-cordell-cotto-anchors-epcs-top-defense-ahead-of-parkland-showdown/", "country": "IL", "title": "Freedom's Cordell Cotto anchors EPC's top defense ahead of Parkland showdown", "performance_score": 0, "site": "lehighvalleylive.com", "participants_count": 0, "title_full": "Freedom's Cordell Cotto anchors EPC's top defense ahead of Parkland showdown", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T23:02:00.000+03:00", "replies_count": 0, "uuid": "5b08ffcb9d8b17df9ee9f73e9c80dc1643728afd"}, "author": "", "url": "http://highschoolsports.lehighvalleylive.com/news/article/-6677145037001707195/freedoms-cordell-cotto-anchors-epcs-top-defense-ahead-of-parkland-showdown/", "ord_in_thread": 0, "title": "Freedom's Cordell Cotto anchors EPC's top defense ahead of Parkland showdown", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Greg Joyce", "Matt Smith", "Cordell Cotto"], "text": "Freedom senior tight end/defensive end Cordell Cotto has registered four sacks this season. (Matt Smith | For lehighvalleylive.com) By Greg Joyce | For lehighvalleylive.com on October 21, 2015 3:58 PM View/Post Comments \nA year ago, the Freedom High School football team raced out to a 7-0 start for the first time in school history. \nThe Patriots are 7-0 again, but what was a big accomplishment a year ago is now just another step in where they want to be. \n“It’s a great feeling, we’re just not content,” senior tight end/defensive end Cordell Cotto said. “We want to get the job done this year and keep going on.” \nThat starts Friday night against Parkland (6-1), a game Freedom lost 21-13 last year for its first loss. \nRELATED : Freedom quarterback Joe Young questionable for Friday against Parkland \nHaving been through it all before, the Patriots are hoping that experience makes a difference in this year’s tilt. \n“We have a lot of guys returning from last year, so I don’t expect us to be star struck by any means,” coach Jason Roeder said. “We do have last year as a point of reference I guess. But beyond that, it’s about this year. It’s Week 8, we’re playing a first-place game. We get to go on the road and play the three-time defending (district) champs. I talked to the guys, you couldn’t ask for a better position to be in than the one you’re sitting in right now.\" \nFreedom (7-0) is currently in first place in the EPC South, the only unbeaten team left. One major reason in the strong start is the defense, which has allowed a league-low 75 points. \nCotto has been a handful for opposing offenses to stop, with four sacks to lead the team. \n“He’s physically gifted, but he’s also a very intelligent football player and he pays attention to the little things,” Roeder said. “I think he’s done a better job with that. In years past, he could get away with his physical ability. Now he’s pairing that with an attention to detail at his position and it’s making him a real force.” \nThe 6-foot-4, 270 pounder has received Division I college interest and visited Temple over the weekend. The Owls’ staff may be at the game Friday night, where Cotto fill be facing off against a Temple recruit in Parkland’s Kenny Yeboah . \nThat will just be added motivation for Cotto when he takes the field. \n“We’ve just been practicing hard, practicing how we play,” he said. “Every snap in practice we go 100 percent and keep flying around.” \nJunior linebacker Brady Hornbaker leads the Patriots in tackles while junior Deshawn Polk and senior Joeshua Ortiz have been just as stout on the defensive line alongside Cotto. \n“They’re playing assignment football,” Roeder said. “Not only are they playing disciplined football, but they’re playing very fast and with an edge. Our defensive coaches have done an outstanding job getting them prepared, week in and week out, and putting them in a position that they can play fast and play very aggressively.” \nThe Freedom defense will have its biggest test of the year Friday as it tries to contain a Devante Cross-led Parkland offense. The Boston College commit and senior quarterback hurt the Patriots last year more on the ground (16 carries for 143 yards and a touchdown) than through the air (7-for-15 for 148 yards, one touchdown, one interception). \nThe Patriots held Whitehall’s Gianni Sinatore to 30 yards on 11 carries last week and are hoping that game began to prepare them for Cross. \n“Just contain him,” Cotto said. “Once we contain him, everything else will just fall in place.” \nWhile Freedom waits to find out the status of starting quarterback Joe Young (leg), it remains focused on the game that many have had their eye on since the preseason. \nFor seven weeks, the Patriots had fight the urge to think about a rematch with the Trojans. Now, that week has finally come. \n“We heard it a lot in the offseason,” Roeder said. “Our kids read the papers and a lot of people talked to them about football the whole offseason. I think this is one a lot of people looked forward to. It was our job, as a program, to just keep us focused one week at a time. But now here we are, Week 8, and we get to go in with an undefeated record and that’s exciting.” \nThe Friday night showdown kicks off a grueling final three weeks for Freedom, with games against Parkland, Easton and Liberty left on the schedule. \nLast year, the Patriots went 1-2 in that stretch. This year, they’re ready for a different result. \n“These are all games we want,” Cotto said. “We’ve been talking about them since the beginning of the year. Now it’s time to go out and get it.”", "external_links": [], "published": "2015-10-21T23:02:00.000+03:00", "crawled": "2015-10-22T03:02:29.078+03:00", "highlightTitle": ""}