{"organizations": [], "uuid": "ae2fa98b091dc57137d4d59daa6ae9085539ae81", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/ncaafb", "section_title": "NCAA FB News, Scores, Schedule, Standings, Stats, Photos, Videos - Football - MSN Sports", "url": "http://www.msn.com/en-us/sports/ncaafb/no-4-tcu-seeks-first-back-to-back-wins-over-texas-in-nearly-60-years/ar-AAf1k8k", "country": "US", "title": "No. 4 TCU seeks first back-to-back wins over Texas in nearly 60 years", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "No. 4 TCU seeks first back-to-back wins over Texas in nearly 60 years", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "ae2fa98b091dc57137d4d59daa6ae9085539ae81"}, "author": "Shooter who killed 9 at Oregon college identified", "url": "http://www.msn.com/en-us/sports/ncaafb/no-4-tcu-seeks-first-back-to-back-wins-over-texas-in-nearly-60-years/ar-AAf1k8k", "ord_in_thread": 0, "title": "No. 4 TCU seeks first back-to-back wins over Texas in nearly 60 years", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "No. 4 TCU seeks first back-to-back wins over Texas in nearly 60 years FOXSports 9 hrs ago © Brendan Maloney-USA TODAY Sports Nov 27, 2014; Austin, TX, USA; TCU Horned Frogs safety Sam Carter (17) celebrates with teammates after intercepting a pass against the Texas Longhorns during the game at Darrell K Royal-Texas Memorial Stadium. Mandatory Credit: Brendan Maloney-USA TODAY Sports There's a nationally televised Big 12 game on a major over-the-air network featuring one of the nation's top teams Saturday morning. Nothing unusual about that.\nWhat is unusual is everything else about the matchup that pits Texas against TCU. The No. 4-ranked Horned Frogs are in their fourth year as a member of the Big 12, yet it still sounds odd to call TCU, and not Texas, the heavy favorite.\nThese days, it's TCU, along with No. 5 Baylor, who controls the conference. Texas, and to an extent Oklahoma, have taken backseats to teams no one could have predicted would grow into Power 5 national title contenders just a few years ago.\nThe Frogs have won two of three Big 12 meetings against Texas since joining the league, including last year's Thanksgiving night romp in Austin. The matchup has taken on a true role reversal with the Horns being the double-digit underdog seeking a measure of respect, and TCU bringing the swagger of a champion.\nA TCU victory would, in fact, be a monumental one in this longtime series between these two schools located about three hours apart. It would give TCU wins over Texas in back-to-back seasons for the first time since 1958 and 1959. Remember, these teams played annually as members of the Southwest Conference before it broke up and formed the Big 12, which excluded the Frogs.\nAnd if Texas has hopes of stealing this one on TCU's home field, the odds are heavily stacked against them. Under coach Gary Patterson, TCU is 34-3 as a top-10 team and 23-1 as a top-5 team as they are in this one.\nThe Horned Frogs are riding a 12-game win streak dating back to last October's heartbreak loss at Baylor. That streak ranks second nationally behind Ohio State's 17-game win streak. Since 1980, Patterson has guided six 12-game win streaks, the most in the nation. He broke a tie with last week's 55-52 win at Texas Tech, surpassing legendary Florida State coach Bobby Bowden.\n(h/t TCU Sports)\nMORE NEWS: Want stories delivered to you? Sign up for our College Football newsletters. AdChoices Go to MSN Home", "external_links": ["http://www.foxsports.com/", "http://www.foxsports.com/other/daily-newslettersignup?intcmp=fscom-newsletter_cfbstory", "http://go.microsoft.com/fwlink/?LinkID=286759"], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-02T12:56:14.379+03:00", "highlightTitle": ""}