{"organizations": [], "uuid": "3f5387d42a2d8c54ab1df72dfca8e6a2a7643171", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/nfl", "section_title": "NFL News, Scores, Schedule, Standings, Stats, Photos, Videos - Football - MSN Sports", "url": "http://www.msn.com/en-us/sports/nfl/jaguars-hold-on-to-beat-bills-34-31-in-london/ar-BBmq7gY", "country": "US", "title": "Jaguars hold on to beat Bills 34-31 in London", "performance_score": 0, "site": "msn.com", "participants_count": 13, "title_full": "Jaguars hold on to beat Bills 34-31 in London", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T02:00:00.000+02:00", "replies_count": 17, "uuid": "3f5387d42a2d8c54ab1df72dfca8e6a2a7643171"}, "author": "CHRIS LEHOURITES, AP Sports Writer", "url": "http://www.msn.com/en-us/sports/nfl/jaguars-hold-on-to-beat-bills-34-31-in-london/ar-BBmq7gY", "ord_in_thread": 0, "title": "Jaguars hold on to beat Bills 34-31 in London", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\nJaguars hold on to beat Bills 34-31 in London Associated Press 8 hrs ago By CHRIS LEHOURITES, AP Sports Writer\nAdChoices LONDON (AP) -- Jacksonville's defense came up big in the first half, and quarterback Blake Bortles came through late to rally the Jaguars to the victory.\nSeven seconds of defensive excellence gave the Jaguars a big lead they eventually squandered away, but Bortles came through when needed in a 34-31 win over the Buffalo Bills on Sunday at Wembley Stadium.\nBOX SCORE: JAGUARS 34, BILLS 31\nWATCH: Bills vs. Jaguars highlights\nBortles threw a 31-yard game-winning touchdown pass to Allen Hurns with 2:16 remaining, after Buffalo safety Corey Graham intercepted a pass and returned it 44 yards to put the Bills ahead in a seesaw game that was streamed live on Yahoo's website.\n\"To be able to stay calm and to have a big lead and give it up and be able to come back and score to win the game is huge,\" Bortles said. \"I think it speaks to the personality of this team, and it's cool to be a part of.\"\nBortles' throw, his second TD pass of the game, came with open space for him to run for a first down. But instead of going on his own, he saw Hurns heading toward the end zone and let it fly.\n\"What we're seeing in Blake is that he does keep his eyes downfield,\" Jaguars coach Gus Bradley said. \"His eyes are always downfield looking for opportunities.\"\nThe Jaguars (2-5) won their first game in London after losing in each of the past two seasons at Wembley, the home of England's national soccer team. The Bills (3-4) were playing in the British capital for the first time.\nEJ Manuel started at quarterback for the Bills for the second straight game because of the absence of the injured Tyrod Taylor, one of the many injuries Buffalo is struggling to overcome.\nManuel's early lapses allowed Jacksonville to take a 27-3 lead, but the backup QB turned things around for a while and led the rally until the Jaguars took over for good in the final minutes.\n\"It was bad football,\" said Manuel, who is 6-10 as an NFL starter with four straight losses. \"Not playing sound and trying to force balls in that I can't do. Turnovers for scores was very tough.\"\nBortles was 13 of 29 for 182 yards, two touchdowns and one interception. The defense was even better, though, scoring two touchdowns in a 7-second span and setting up another for T.J. Yeldon, who finished with 116 yards.\nTrailing 3-0, Bortles hit Allen Robinson on a 10-yard touchdown pass. Then the defense stepped up.\nOn third-and-9, Aaron Colvin forced a fumble from Manuel. Sergio Brown nearly smothered the ball, but Chris Clemons grabbed the loose ball and ran 6 yards into the end zone.\nAfter the kickoff and a touchback, Manuel was again in the pocket but his pass was picked off by Telvin Smith, who ran it in from the 26.\nAnd the defense wasn't done yet. On the fourth play of the next drive, Manuel was again picked off, this time by Paul Posluszny.\nThe Jaguars' offense didn't disappoint this time, with Yeldon running it in from the 28 to give Jacksonville a 27-3 lead after Jason Myers missed the extra point.\n\"Anything that could go wrong did go wrong,\" Bills coach Rex Ryan said, \"and we are still able to overcome it to take a lead, and then we blew it.\"\nThe Bills' comeback started when Manuel completed a 16-yard touchdown pass to Robert Woods. That score and another field goal from Dan Carpenter made it 27-13 at the half.\nIn the fourth quarter, Carpenter kicked a third field goal before Manuel hit Marcus Easley on a 58-yard touchdown pass -- only minutes before Graham gave the Bills a 31-27 lead with 5:21 left.\nWhile the Bills were piling up the points, the Jaguars struggled to get the ball moving in the fourth quarter.\n\"We tried to mix in some run and pass, tried to burn some clock, and it didn't work,\" Bradley said. \"But we tried to stay aggressive.\"\nManuel started at quarterback for the second straight game, and for the second straight loss this season. He finished with 298 yards on 24 of 42 passing with two touchdowns and two interceptions.\nRyan said he was sticking by his backup quarterback.\n\"He knows it wasn't the best time for him, but we kept believing in him,\" Ryan said.\nManuel was starting because Taylor sprained a ligament in his left knee in the 14-13 win over Tennessee on Oct. 11. With a week off after the trip, as usual for teams playing in London, Taylor will have more time to heal before the Bills host the Miami Dolphins on Nov. 8.\nThe Jaguars, who will again travel to London next season, next play at the New York Jets, also on Nov. 8.\nFor the Bills, the week off should help heal some of the injuries that have blighted their season, especially to Taylor.\n\"I've never known a team that needed a bye week so badly,\" Ryan said.\nNOTES: The 58-yard TD pass from EJ Manuel to Marcus Easley was Buffalo's longest play of the season ... This was the second of three regular-season NFL games at Wembley this season. The New York Jets beat the Miami Dolphins 27-14 on Oct. 4, and the Detroit Lions will face the Kansas City Chiefs next Sunday ... The attendance was 84,021, the second highest at Wembley after 2009 when the New England Patriots beat the Tampa Bay Buccaneers.\n< PREVIOUS SLIDE SLIDE 1 of 5 NEXT SLIDE > Telvin Smith of Jacksonville Jaguars scores a touchdown in the second quarter on an interception at Wembley Stadium on October 25, 2015 in London, England. © Alan Crowhurst/Getty Images\nGo to MSN Home", "external_links": ["http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BBmpyPQ.img&quot;}}", "http://ap.org/", "http://go.microsoft.com/fwlink/?LinkID=286759", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BBkyxle.img&quot;,&quot;title&quot;:&quot;Jaguars", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BB6qRzt.img&quot;,&quot;title&quot;:&quot;Redskins", "http://ui.bamstatic.com/120sports/util/embed/ots.embed.js&quot;}", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BB6qRzt.img&quot;,&quot;title&quot;:&quot;Highlights:", "http://c.120sportsstatic.com/gen/client/rss/timeline.xml&quot;},{&quot;ns&quot;:&quot;ignore_this_version&quot;,&quot;value&quot;:&quot;System.Collections.Generic.List`1", "http://b.scorecardresearch.com/b?&quot;,&quot;Category&quot;:&quot;football_nfl&quot;},&quot;Mute&quot;:&quot;true&quot;,&quot;HomePageLink&quot;:&quot;//www.msn.com/en-us&quot;,&quot;GeofenceUseSps&quot;:&quot;false&quot;,&quot;GeofenceEnabled&quot;:&quot;true&quot;,&quot;AutoPlay&quot;:&quot;true&quot;,&quot;AutoPlay&quot;:true,&quot;Mute&quot;:true,&quot;SwfCacheRefreshTime&quot;:86400,&quot;AdConfig&quot;:{&quot;FWFlashProfile&quot;:&quot;188286:MSN_US_AS3_LIVE&quot;,&quot;FWHtml5Profile&quot;:&quot;188286:MSN_HTML5_Live&", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BBmpXYS.img&quot;}}", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BBmq5xt.img&quot;}},{&quot;csId&quot;:&quot;BB2D59E&quot;,&quot;description&quot;:&quot;Kirk", "http://ui.bamstatic.com/120sports/util/embed/ots.embed.js&quot;,&quot;tags&quot;:", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BBmqhBx.img&quot;}},{&quot;csId&quot;:&quot;BB2D59E&quot;,&quot;description&quot;:&quot;LSU", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BB6qRzt.img&quot;,&quot;title&quot;:&quot;Jags"], "published": "2015-10-25T02:00:00.000+02:00", "crawled": "2015-10-26T03:12:46.498+02:00", "highlightTitle": ""}