{"organizations": [], "uuid": "647d5694e08b21a0e1ec6b8796e22e94d1eb46c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mb.com.ph", "main_image": "http://www.mb.com.ph/wp-content/themes/city-desk/images/fb-image_200x200.jpg", "site_section": "http://www.mb.com.ph/category/sports/", "section_title": "mb.com.ph | Philippine News | Archive | Sports", "url": "http://www.mb.com.ph/feu-tames-ateneo-grabs-lead/", "country": "CA", "title": "FEU tames Ateneo, grabs lead", "performance_score": 0, "site": "mb.com.ph", "participants_count": 1, "title_full": "FEU tames Ateneo, grabs lead | mb.com.ph | Philippine News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "647d5694e08b21a0e1ec6b8796e22e94d1eb46c1"}, "author": "Christian Jacinto", "url": "http://www.mb.com.ph/feu-tames-ateneo-grabs-lead/", "ord_in_thread": 0, "title": "FEU tames Ateneo, grabs lead", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "by Christian Jacinto\nOctober 12, 2015 Games Wednesday\n(Smart Araneta Coliseum)\n2 p.m. – La Salle vs UE\n4 p.m. – FEU vs UP\nIt was far from a repeat of the lopsided victory Far Eastern University inflicted on Ateneo in the first round, but a win is a win and FEU coach Nash Racela can live with that.\nFar Eastern University’s Monbert Arong tries to pass the ball while being dwarfed by Ateneo’s Chibueze Ikeh during their UAAP game yesterday at the Smart Araneta Coliseum. The Tamaraws won, 66-61.\n(Bob Dungo Jr.)\nThe Tamaraws held off the stiff challenge posed by the Blue Eagles right from the onset and came away with a 66-61 victory yesterday to take a momentary hold of the solo lead in the UAAP basketball tournament at the Smart Araneta Coliseum.\nFEU took advantage of Ateneo coach Bo Perasol’s decision to rest Kiefer Ravena in the early part of the fourth period. The Tamaraws zoomed to a 55-49 lead and then held on to score the decisive win.\nMac Belo hounded Ravena on defense while the Tams frontline were able to gain crucial rebounds after the Blue Eagles scored five unanswered points to pull within 55-54. Ravena was responsible for all of the points but he and his teammates missed the crucial baskets in the closing minutes to allow FEU to seal their sixth straight triumph and gain first place with a 7-1 record.\n“It was a struggle,” said Racela, whose team thrashed Ateneo, 88-64, in the first round. “We committed a lot of fouls in the first half. It was hard for us to make adjustments. I think it’s good na yung mga ibang tao na pinasok namin were effective.”\nThe Blue Eagles dropped their third straight game and fell to fourth at 4-4, a game behind the defending champion National University Bulldogs, University of the East Red Warriors and University of the Philippines Maroons, all with 3-5 slates.\nThe latest defeat before Perasol disclosed his intention to leave the team after the season.\n“Coach Bo and his coaching staff did a great job in adjusting, they had a lot of players being open in the first half so I take my hats off to him and his coaching staff,” Racela said.\nBelo led the way for FEU with 12 points, five rebounds and two assists but his defense on Ravena from the opening tip was what he was more concerned about.\n“Si Kiefer kasi magaling, mahirap talaga depensahan siguro so kailangan talaga limitahan lang ang touches ni Kiefer, pero nakakashoot pa rin,” Belo said.\nRussell Escoto and Roger Pogoy also had their moments for the Tams as they finished with 10 points apiece as Mike Tolomia played in limited minutes after being plagued with early foul trouble.\nRavena once again led Ateneo in the loss with 15 points even as rookie Adrian Wong added 14 points.", "external_links": ["http://i.po.st/static/v3/post-widget.js#publisherKey=4qcr4d26tnrf260rqrda&retina=true"], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-11T21:13:12.915+03:00", "highlightTitle": ""}