{"organizations": [], "uuid": "30145aa8d18ccb4bccc63b156a21253ca1f715bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.gainesvilleregister.com", "main_image": "http://bloximages.chicago2.vip.townnews.com/gainesvilleregister.com/content/tncms/assets/v3/editorial/0/cc/0cc643c8-7a10-11e5-9ab2-27453dc870eb/562b1720679e6.image.jpg?resize=760%2C490", "site_section": "http://www.gainesvilleregister.com//search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&nsa=eedition&c[]=sports,sports/*&f=rss", "section_title": "Daily Register.com - sports,sports/", "url": "http://www.gainesvilleregister.com/news/burkburnett-puts-leopards-playoff-hopes-in-jeopardy/article_f92730e8-7a0f-11e5-a7e3-f73615910ee5.html", "country": "US", "title": "Burkburnett puts Leopards playoff hopes in jeopardy", "performance_score": 0, "site": "gainesvilleregister.com", "participants_count": 1, "title_full": "Burkburnett puts Leopards playoff hopes in jeopardy", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T08:27:00.000+03:00", "replies_count": 0, "uuid": "30145aa8d18ccb4bccc63b156a21253ca1f715bb"}, "author": "EVAN GRICE Sports Editor", "url": "http://www.gainesvilleregister.com/news/burkburnett-puts-leopards-playoff-hopes-in-jeopardy/article_f92730e8-7a0f-11e5-a7e3-f73615910ee5.html", "ord_in_thread": 0, "title": "Burkburnett puts Leopards playoff hopes in jeopardy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Staff photo by Evan Grice Hanging on \nGainesville’s Micheal Bradley fights for yardage during a district game against Wichita Falls Hirschi last week at Leopard Stadium. Bradley and his teammates fell to Burkburnett Friday night on the road by a score of 14-2. GHS will be back at home next Friday night against Decatur at 7:30 p.m. Posted: Saturday, October 24, 2015 12:27 am Burkburnett puts Leopards playoff hopes in jeopardy   \nIf there was ever a game in which the Gainesville Leopards will be asking themselves “What If ?” it’s going to be after Friday night. \nGHS endured sloppy field conditions at Bulldog Stadium in Burkburnett due to pouring rain, an earlier start time by two and a half hours, but couldn’t overcome eight total turnovers in the contest as Burkburnett survived 14-2 over the Leopards, putting Gainesville in danger of missing the playoffs. \nThe Leopards had multiple opportunities to cash in during the contest, but were either intercepted or lost the ball due to a fumble. \nGainesville’s lone points of the game came off a bad snap by Burkburnett on a fourth down deep inside their own territory, as the ball just crossed the goal line, giving the Leopards a 2-0 lead with 0:57 left in the first quarter. \nHowever, many will argue that the Leopards could have and probably should have had the lead long before the bobbled snap by the Bulldogs. \nBHS caused Calion Baker to fumble the ball inside the 30-yard line, before Turbeville was intercepted in the corner of the endzone by David Barron after and underthrown ball missed the intended receiver. \nOn the ensuing drive following the free kick on the safety, Luis Huerta was bitten by the fumble bug, as GHS was so many times throughout the contest, as the Bulldogs recovered the ball and took over. \nWith 7:08 left in the second quarter, Burkburnett took the lead with a touchdown to make it 7-2. \nTurbeville would be intercepted on the Gainesville drive following the score, but the Leopards defense would hold strong and get an interception of their own just before halftime to leave the score at 7-2. \nHuerta was extremely unlucky at the beginning of the second half, as he was stripped of the football just inside the one-yard line right before he was about to give the Leopards the lead over the Bulldogs. \nBryce Royal though made sure nothing came of it for BHS on the ensuing drive as he came up with a crucial interception to keep the Leopards well within striking distance going into the fourth quarter. \nUnfortunately, the Bulldogs’ Kolby Youngblood put the game away for Burkburnett with just over seven minutes to go in the fourth when he scored a touchdown from four yards out to make it 14-2. \nGainesville (1-7, 1-2) will need to win both of its remaining district games to keep its playoff hopes alive, starting with a matchup against Decatur next Friday night at 7:30 p.m. from Leopard Stadium.  ", "external_links": [], "published": "2015-10-24T08:27:00.000+03:00", "crawled": "2015-10-25T16:41:43.965+02:00", "highlightTitle": ""}