{"organizations": [], "uuid": "ad7a57960c309eba0a57db15ff01d199053f45ec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "savannahnow.com", "main_image": "http://savannahnow.com/sites/default/files/14764449_3.jpg", "site_section": "http://savannahnow.com/", "section_title": "savannahnow.com | Savannah Georgia's source for News, Entertainment, Sports, Weather, Classifieds, Jobs, Autos, Real Estate and St. Patricks Day", "url": "http://savannahnow.com/sports/2015-10-11/nathan-deen-maybe-wilson-something-ssu", "country": "US", "title": "NATHAN DEEN: Maybe Wilson is on to something at SSU", "performance_score": 0, "site": "savannahnow.com", "participants_count": 2, "title_full": "NATHAN DEEN: Maybe Wilson is on to something at SSU | savannahnow.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T14:22:00.000+03:00", "replies_count": 1, "uuid": "ad7a57960c309eba0a57db15ff01d199053f45ec"}, "author": "NATHAN DEEN", "url": "http://savannahnow.com/sports/2015-10-11/nathan-deen-maybe-wilson-something-ssu", "ord_in_thread": 0, "title": "NATHAN DEEN: Maybe Wilson is on to something at SSU", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photos SPECIAL OFFER FOR NEW READERS 99 cent digital subscription to savannahnow.com\nSubscriber-members get access to ALL our digital products AND become eligible for free event tickets, discount coupons and other benefits. SIGN UP FOR SUBSCRIBER BENEFITS As a Savannah Morning News / savannahnow.com subscriber, you're eligible for members-only discounts. Download your coupons now. SPECIAL OFFER FOR NEW READERS 99 cent digital subscription to savannahnow.com\nSubscriber-members get access to ALL our digital products AND become eligible for free event tickets, discount coupons and other benefits. SIGN UP FOR SUBSCRIBER BENEFITS As a Savannah Morning News / savannahnow.com subscriber, you're eligible for members-only discounts. Download your coupons now. By NATHAN DEEN Jovante Mobley knew a day like Oct. 3 would come eventually. He also knew it wouldn’t come right away.\nSure, the Savannah State football team recorded a win three games into the 2013 season in its first year under head coach Earnest Wilson III.\nBut Wilson didn’t take the SSU job just to win.\nHe knew there were other things that had to change if he was going to build a program that could win consistently. And so while he went to work on correcting those issues, the Tigers went through a 24-game losing streak, which they finally snapped nine days ago with a 37-27 home win over Florida A&M.\nWilson paid no mind to the scoreboard when the clock wound down to zero at a packed T.A. Wright Stadium. There wasn’t a moment, at least not right away, of personal gratification for the work he’s put in and the sacrifices he’s made.\n“I didn’t really look around too much,” Wilson said. “I was just happy for the players and the community. I was just happy for everybody.”\nYou hang around the Savannah State practice field long enough, and you notice there are some consistencies in the things the players tell you. There was never a moment when they doubted Wilson as their coach.\nThere was never a low point during the losing streak. There was never a worry about when the streak would end. They knew it would come — because they trusted Wilson.\nThey trust him because he has invested himself in them. Before Wilson, the school was more known for its players getting into trouble than winning football games, but he saw a group of kids who just needed to know their coach cared about them.\nAnd you don’t have to spend a lot of time around Wilson to know that he does care. He pushes them to do well in school and to be a part of the community. His door is always open whenever they need advice.\n“He keeps it real with you,” Mobley said. “He wants everyone to keep their academics first. He’s still hard on football, but he wants us to keep our academics first. We’ve been working harder since he got here. He pushed us more, and we pushed ourselves.”\nNot everyone bought in. Some of them left the team before the end of Wilson’s first season. A couple of those players texted him after the win to congratulate him. Those players have also expressed remorse for their decisions, Wilson said.\n“They realize now what we’re trying to get done,” Wilson said.\nFor those who remained, Wilson has gotten them to a point where they know, no matter what, they’re in this together. He’s brought in his own players — the players he wants representing the program. Unlike his first season, this year he hasn’t had to respond to calls in the middle of the night, whether from a police officer or a campus resident assistant, about a player getting into trouble. Everyone is focused on football.\nLet’s put into perspective just what an accomplishment a win is for this team. This is a team of mostly starting freshmen and sophomores who have no weightlifting facilities, no strength and conditioning coach, and are limited to eight fewer weekly practice hours than normal for teams because of NCAA violations. Those same violations also kept the Tigers from holding spring practice.\nJust as that win in 2013 over Fort Valley State was a smokescreen for the idea of an instant turnaround, perhaps the last 24 games have been a smokescreen for the notion that the Tigers are a lost cause.\nThat was the idea of this team I’ve had since I came to Savannah, because that’s what others have told me, and I’m sure it’s nothing Wilson hasn’t heard himself.\nHow many have asked him why he does what he does? How many have asked him how he does it?\nI never brought myself to ask Wilson those questions outright, but now that I’ve spent enough time around him, I don’t need to. I know the answers.\nI did ask him last week if he was committed and realized later that was a foolish question, because I knew the answer to that, too.\nIf he wasn’t, he wouldn’t be here now. And ...\n“Not like I have people calling me,” he joked.\nNathan Deen is a sports reporter for the Savannah Morning News. Contact him at 912-652-0353 or nathan.deen@savannahnow.com . Follow him on Twitter\n@NathanDeenSMN.", "external_links": ["http://sav-cdn.com/sites/all/themes/savannahnow/images/blank.gif", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/14764449_3.jpg", "http://sav-cdn.com/sites/default/files/imagecache/superphoto/14764449_3.jpg"], "published": "2015-10-11T14:22:00.000+03:00", "crawled": "2015-10-12T08:46:21.232+03:00", "highlightTitle": ""}