{"organizations": [], "uuid": "6c2611ca8a6ac13f9663855ffbe470830093c2e6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mcall.com", "main_image": "http://www.trbimg.com/img-5627f98a/turbine/mc-camden-riversharks-fold-20151021", "site_section": "http://www.mcall.com//sports/rss2.0.xml", "section_title": "Sports - The Morning Call", "url": "http://www.mcall.com/sports/mc-camden-riversharks-fold-20151021-story.html", "country": "US", "title": "Camden Riversharks fold after 15 seasons", "performance_score": 0, "site": "mcall.com", "participants_count": 1, "title_full": "Camden Riversharks fold after 15 seasons - The Morning Call", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T00:41:00.000+03:00", "replies_count": 0, "uuid": "6c2611ca8a6ac13f9663855ffbe470830093c2e6"}, "author": "mcall.com", "url": "http://www.mcall.com/sports/mc-camden-riversharks-fold-20151021-story.html", "ord_in_thread": 0, "title": "Camden Riversharks fold after 15 seasons", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CAMDEN, N.J. (AP) — A minor league baseball team that has spent 15 seasons playing in Camden says it failed to reach a lease deal for its stadium and will cease operations.\nThe Camden Riversharks, of the independent Atlantic League, announced Wednesday that they will be leaving Campbell's Field, which is owned by the Camden County Improvement Authority.\nIn a statement, the Riversharks say they did \"everything we could to keep affordable family entertainment alive and well in Camden.\" The team says it's having a sale on remaining team merchandise.\nIn September, the director of the Camden County freeholders board said other teams have contacted the county about playing in the stadium, near the Ben Franklin Bridge.\nSince then, there have been plans for a $1 billion development of offices, homes and retail spaces on lots adjacent to the stadium, a factor that would likely make the stadium a more attractive place for a team to move.\nBecause it's close to Philadelphia, the Philadelphia Phillies would have to give their approval for a team affiliated with any other major-league franchise to move in.\nA spokesman for the Camden County government did not immediately return a call seeking comment on plans for the stadium.\nThe Atlantic League, meanwhile, approved adding a franchise in New Britain, Connecticut, next year. But the team that will be there was not announced. One possibility would be that the Riversharks could move there. No one returned a call to the league office Wednesday afternoon.\nThe Atlantic League was formed in 1998 with six teams including the Lehigh Valley Black Diamonds, who played that season in Newburgh, N.Y., while a proposed stadium was under construction in Williams Township. However, the team never played in the greater Lehigh Valley, spending the 1999 season on the road and the 2000 season at Quakertown's Memorial Park while the team fought financical difficulties and ultimately bankruptcy.\nThe stadium was never completed and the franchise eventually was taken over by the league as a permanent road team to fill in schedules from year-to-year.", "external_links": [], "published": "2015-10-22T00:41:00.000+03:00", "crawled": "2015-10-22T16:16:47.933+03:00", "highlightTitle": ""}