{"organizations": [], "uuid": "ebd133e11e6be3f266572ad2f3f9e9aa66349ae4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seacoastonline.com", "main_image": "http://www.seacoastonline.com/storyimage/SO/20151015/SPORTS/151019440/AR/0/AR-151019440.jpg", "site_section": "http://www.seacoastonline.com/sports/highschool?template=rss&mime=xml", "section_title": "High School Sports - seacoastonline.com", "url": "http://www.seacoastonline.com/article/20151015/SPORTS/151019440/101032/SPORTS?rssfeed=true", "country": "US", "title": "HS football: Blue Devils brace for undefeated Winnisquam", "performance_score": 0, "site": "seacoastonline.com", "participants_count": 1, "title_full": "HS football: Blue Devils brace for undefeated Winnisquam", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T19:29:00.000+03:00", "replies_count": 0, "uuid": "ebd133e11e6be3f266572ad2f3f9e9aa66349ae4"}, "author": "Ryan O’Leary roleary@seacoastonline.com", "url": "http://www.seacoastonline.com/article/20151015/SPORTS/151019440/101032/SPORTS?rssfeed=true", "ord_in_thread": 0, "title": "HS football: Blue Devils brace for undefeated Winnisquam", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Oct. 15, 2015 at 11:29 AM By Ryan O’Leary Posted Oct. 15, 2015 at 11:29 AM » Social News EPPING — Last time out, against defending champion Campbell, the Epping-Newmarket football team talked about earning a separation win. This week’s more about a statement. The Blue Devils (2-3) emerge from their bye week in a share for the fourth and final playoff spot in the Division III South. They’ll see a playoff-bound team on Saturday in their road game at Winnisquam, a team that's piled up 185 points over its 5-0 start to the season. The Blue Devils, meanwhile, got 14 days to recover from their 19-14 win over Campbell on Oct. 3. The timing of their bye week came at an ideal time in the schedule — unlike last year, when they skipped Week 1 and played the next eight weeks in succession. “That win against Campbell was huge for this program,” Epping-Newmarket coach Justin Leonard said. “For the kids to enjoy that win for two weeks did a lot for our confidence.” It didn’t take long for the focus to shift ahead to Winnisquam. The Bears feature a triple-option offense with a core group of skill players at the forefront. Christian Serrano — who hurt the Blue Devils as a running back in last year’s meeting, a 43-12 Winnisquam win — is the Bears’ new starting quarterback. He’ll try to throw it to top wide out Tim Harmon, get to the edge himself on option runs, or hand it off inside to 5-foot-9, 220-pound fullback Jake Snow. “The fullback is a big, big kid,” Leonard said. “He’s built like me — not that it’s a negative thing. But as a high school kid, he’s a big kid to bring down.” Longtime Winnisquam head coach Pat Riberdy has been running his option attack out of the pistol formation, a version of the shotgun that places the quarterback a few yards behind the center with a running back behind him. The Bears ran their offense from under center in last year's meeting. “We’re expecting a heavy dose of triple-option and then some vertical threats,” Leonard said. “(Riberdy’s) going to try to pound us inside with Snow, and then he’s going to try to get Serrano out on the edge. And if that doesn’t work, he’s going to try and go deep. He has the weapons to do all three. They’re very good at the skill positions.” The Blue Devils continue to search for consistency within their own spread offense. Sophomore quarterback Jake Bisaillon passed for 231 and three touchdowns in the Campbell win, but two of those scores came early in the first quarter, and Epping-Newmarket struggled to sustain drives from there until back Jeremy Espo wiggled away for a game-winning, 70-yard score on a screen pass in the fourth quarter. Noah Armstrong is proving to be Bisaillon’s favorite target. He had two catches for 98 yards and two touchdowns against Campbell — all in the first quarter. The Blue Devils know scoring early could be a key to Saturday’s game. They had chances to score early in last year’s meeting with Winnisquam but were stopped by their own penalties. “The score didn’t indicate how well we played,” Leonard said. “We learned from it. We had a lot of freshmen on the football field in that game and hopefully we don’t make the same mistakes.” Missed opportunities against Winnisquam could spell doom. Campbell gave the Bears their toughest game, 35-21, but they posted a shutout in the second half and never relinquished control. “They can just keep piling on the points,” Leonard said of the Bears. “They're a high-scoring offense. They can move the ball at will. They like to run the ball, but Serrano being a first-year quarterback, he’s a pretty good one.” By Ryan O’Leary", "external_links": [], "published": "2015-10-15T19:29:00.000+03:00", "crawled": "2015-10-15T19:06:19.753+03:00", "highlightTitle": ""}