{"organizations": [], "uuid": "079b15bd06d7dc236e19b1803ae48e034e77bfb3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.al.com", "main_image": "http://imgick.al.com/home/brightcove01/width620/img/6/260701696001/201510/242/260701696001_4549464510001_4c79b9fd-6fcf-4f8b-b312-cb0ade1838e3-still.jpg?pubId=260701696001", "site_section": "http://blog.al.com/sports_birmingham_impact/atom.xml", "section_title": "Sports Birmingham Impact", "url": "http://www.al.com/alabamafootball/index.ssf/2015/10/inside_the_play_that_swung_the.html", "country": "US", "title": "Inside the play that 'swung the momentum' during Alabama win over Arkansas", "performance_score": 0, "site": "al.com", "participants_count": 1, "title_full": "Inside the play that 'swung the momentum' during Alabama win over Arkansas | AL.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T15:01:00.000+03:00", "replies_count": 0, "uuid": "079b15bd06d7dc236e19b1803ae48e034e77bfb3"}, "author": "Matt Zenitz | mzenitz@al.com", "url": "http://www.al.com/alabamafootball/index.ssf/2015/10/inside_the_play_that_swung_the.html", "ord_in_thread": 0, "title": "Inside the play that 'swung the momentum' during Alabama win over Arkansas", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The play that served as the turning point during Alabama's 27-14 win over Arkansas Saturday night had been worked on by the Tide since practice on Monday.\nAnalysis of Razorbacks game film showed that Arkansas plays a lot of Cover 4 coverage, which involves four defensive backs each dropping back and covering a quarter of the deep part of the field.\nThe play was designed to take advantage of that coverage.\nIt worked to perfection on the play that served as the turning point in the game, an 81-yard touchdown pass from quarterback Jake Coker to wide receiver Calvin Ridley that gave Alabama a 10-7 lead late in the third quarter.\nRELATED: Alabama beats Arkansas behind big play from freshman wide receiver\nThe Tide called the play. Arkansas got caught in Cover 4. Ridley got matched up over the middle with Razorbacks safety Santos Ramirez, whom Ridley got behind with a double move before catching a deep pass from Coker and running the rest of the way for the touchdown.\n\"That kind of swung the momentum in their favor for the rest of the day,\" Arkansas coach Bret Bielema said.\nAlabama was in a three wide-receiver set.\nArDarius Stewart and Richard Mullaney were the Tide's outside receivers.\nRidley was in the slot on the same side as Mullaney.\nMullaney and Stewart each ran post-corner routes.\nRidley ran an in-and-go.\nRamirez made an ill-fated move forward when Ridley faked the in. That left Ridley wide-open deep over the middle when he broke his route upfield.\n\"We were fortunate to catch them in it when we called it,\" Tide coach Nick Saban said. \"That's what we were looking for, and ran a great route, and it was a great throw. Really big play in the game.\"\nAfter trailing 7-3 since late in the second quarter, Alabama scored an additional 17 unanswered points following the touchdown.\nThe Tide led 27-7 before Arkansas scored a late touchdown.\n\"We had actually talked about it coming out of that break,\" Bielema said of the touchdown. \"It was the first play of the series there. They had traditionally gone to something like that in those type of scenarios. I think Santos just lost his eyes for a moment. It's something that's coachable and easily correctable.\"\nAlabama-Arkansas post game recap with Nick Saban Nick Saban talks about the momentum change after the half.", "external_links": ["https://vine.co/v/e0t0xh1tmjB/embed/simple", "https://vine.co/v/e0tE76MWPpp/embed/simple", "https://platform.vine.co/static/scripts/embed.js"], "published": "2015-10-11T15:01:00.000+03:00", "crawled": "2015-10-11T10:35:45.012+03:00", "highlightTitle": ""}