{"organizations": [], "uuid": "b95f41e782bd8ac228085ecb460d1e06d3548bfb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "wtop.com", "main_image": "http://wtop.com/wp-content/uploads/2015/10/Browns-Rams-Football12.jpeg", "site_section": "http://wtop.com/section/sports/feed/", "section_title": "WTOP » Sections » Sports", "url": "http://wtop.com/nfl/2015/10/gurley-carries-load-in-rams-24-6-win-over-browns/", "country": "US", "title": "Gurley carries load in Rams’ 24-6 win over Browns", "performance_score": 0, "site": "wtop.com", "participants_count": 1, "title_full": "Gurley carries load in Rams’ 24-6 win over Browns", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T07:58:00.000+02:00", "replies_count": 0, "uuid": "b95f41e782bd8ac228085ecb460d1e06d3548bfb"}, "author": "wtopstaff", "url": "http://wtop.com/nfl/2015/10/gurley-carries-load-in-rams-24-6-win-over-browns/", "ord_in_thread": 0, "title": "Gurley carries load in Rams’ 24-6 win over Browns", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home » News » Sports » NFL » Gurley carries load in… Gurley carries load in Rams’ 24-6 win over Browns By R.B. FALLSTROM October 26, 2015 1:58 am Cleveland Browns quarterback Johnny Manziel walks off the field following an NFL football game against the St. Louis Rams, Sunday, Oct. 25, 2015, in St. Louis. The Rams won 24-6. (AP Photo/Tom Gannam) \nST. LOUIS (AP) — Jeff Fisher coached Chris Johnson when he ran for 2,006 yards in 2009, and rode powerful Eddie George to a Super Bowl. He’s said he’s never had a back be so successful, so fast as Todd Gurley. \n“No, and I’ve been around some really good ones,” Fisher said after the rookie scored his first two career touchdowns and topped 100 yards for the third straight game in the St. Louis Rams’ 24-6 thumping of the Cleveland Browns on Sunday. “I don’t recall them having the numbers after three full games that Todd has.” \nThe 10th pick of the draft had three carries for minus-2 yards in the first quarter for an offense that got no traction. \nThe rest of the way, he was a handful. Gurley had gains of 14 and 15 yards in the second quarter, reeled off a 48-yarder in the third and brushed off would-be tacklers on a 16-yard touchdown run for the game’s final score in the fourth quarter, rewarding fans that had been chanting “GUR-LEY, GUR-LEY!.” \n“Oh man, it felt good to get my first two,” Gurley said. “Credit to the offensive line, they did great all day. Hopefully, we can keep this thing rolling.” \nGurley had 128 yards on 19 carries, falling short of joining Hall of Famers Eric Dickerson and Marshall Faulk as the lone Rams players to gain 140 or more yards for three straight games. He added four catches for 35 yards and felt so good he went without the brace he’s been wearing to protect his surgically repaired left knee. \n“Just an animal, really,” quarterback Nick Foles said. “There’s not many people that can run like that, that have ever played this game.” \nThe Rams totaled 158 yards rushing with a 6.1-yard average against the NFL’s worst run defense, which had been permitting 149.8 yards. Gurley was the fourth 100-yard rusher the last five games. \n“I felt at times we did a good job and other times we didn’t,” Browns coach Mike Pettine said. “He can make you miss, jump over you.” \nSome other observations from the Rams’ win over the Browns: \nSTOUT D: Coming off its bye, St. Louis (3-3) was strong defensively with four sacks and four fumble recoveries. The Rams scored 17 points off miscues, 10 of them on Cleveland’s first two series, a 17-yard fumble recovery by Rodney McLeod off a nice hit Janoris Jenkins and a field goal after the first of William Hayes’ two sacks and strips of Josh McCown on the day. \nGurley’s 1-yard run was the lone score that didn’t come off a turnover. \nQB INTRIGUE: Johnny Manziel got mop-up duty for the Browns (2-5) after McCown left for the locker room with a shoulder injury with about four minutes left. McCown said he was hurt on the second sack/fumble when he was hit on the elbow. \n“Obviously, it’s sore right now and we’ll just see how the week goes,” McCown said. \nManziel could be the starter next week at home at Arizona. \n“I hoped and thought I might get a chance to come in some time down the road, I didn’t know when that would be,” Manziel said. “It felt good to be back in the huddle.” \nCAN’T BEAT ‘EM: McCown has lost to the Rams three straight seasons with three different teams. He was with Chicago in 2013 and Tampa Bay last year. \n“It just seemed like we were just shooting ourselves in the foot,” McCown said. “The way we started the game, we were just fighting out of holes all day.” \nMcCown said he wasn’t necessarily surprised when he wasn’t checked for a concussion after getting hit on a play in the second half. He missed time with a concussion earlier in the year. \n“I try to think about what is going on in the game,” McCown said. “So I didn’t really process that.” \nCOSTLY MISTAKES: Penalties negated several would-be big plays for the Browns. Perhaps the biggest was a holding call on Joe Thomas late in the third that wiped out a 38-yard catch by Travis Benjamin that would have set the Browns up on the Rams 21 with a chance to take the lead. Cleveland, which entered the game as the league’s third most penalized team, drew 11 flags for 98 yards. \n___ \nAP NFL website: www.pro32.ap.org and www.twitter.com/AP_NFL Topics:", "external_links": [], "published": "2015-10-26T07:58:00.000+02:00", "crawled": "2015-10-26T08:34:39.658+02:00", "highlightTitle": ""}