{"organizations": [], "uuid": "4c466935ce17d0ac8292cd2d904e47b28e50c41f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "hamptonroads.com", "main_image": "http://media.hamptonroads.com/cache/files/imagecache/large_site_image_760x760/files/images/1926131000.jpg", "site_section": "http://hamptonroads.com/2007/10/high-school-sports", "section_title": "High School Sports | HamptonRoads.com | PilotOnline.com", "url": "http://hamptonroads.com/2015/10/new-coach-new-league-new-intensity-admirals", "country": "US", "title": "New coach, new league, new intensity for Admirals", "performance_score": 0, "site": "hamptonroads.com", "participants_count": 1, "title_full": "New coach, new league, new intensity for Admirals | HamptonRoads.com | PilotOnline.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "4c466935ce17d0ac8292cd2d904e47b28e50c41f"}, "author": "Jim Hodges", "url": "http://hamptonroads.com/2015/10/new-coach-new-league-new-intensity-admirals", "ord_in_thread": 0, "title": "New coach, new league, new intensity for Admirals", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NORFOLK Less than five minutes into the first Norfolk Admirals practice, coach Eric Veilleux blew a whistle, sent players behind the goal line and firmly lectured them.\nNot good enough. Not fast enough. Not enthusiastic enough. Just not enough - and all they had done so far is skate. There wasn't a puck in sight.\nThe message on the ice Monday reinforced one he had delivered only minutes before in the Scope dressing room: jobs are at stake. At the ECHL level, where the Admirals are operating after 15 seasons in the AHL, a lost job could mean the end of a hockey career.\n\"I told them what was expected, what type of team we were looking for,\" Veilleux said. \"They're all on the same level. There are going to be guys disappointed, for sure.\"\nNo nonsense. Straight forward.\n\"Today, Day 1, everybody's on the same sheet and it's a clean sheet, whether you're a returning veteran or a rookie,\" said Ben Boudreau, who was an assistant when the franchise was in Bakersfield, Calif., last season. He has moved into the same job in Norfolk, but with a new boss.\n\"Everybody's got to make an impression because Eric wasn't there last year. He didn't see the guys in Bakersfield. This is his first time in the East Coast and first impressions are going to be just that: first impressions. Just because you played last year doesn't mean you have a spot on the team this year.\"\nThe stoppage early in practice meant Veilleux was serious. So did drill after drill over the 90-minute session.\n\"We want a good (competition) level, and there's no better way to start it than at the first practice,\" Veilleux said. \"We don't have much time. We only have one exhibition game (Saturday at Reading), and it's important for us to see early to see who can do it and who can't.\n\"I want to give everybody a fair chance to be noticed.\"\nPlayers were warned to be in shape. At the end of the first practice, after sprints, some were on their knees gasping for breath. Others were doing the same thing, though still on skates.\n\"The end was just a conditioning drill, seeing who's in shape, who's not in shape,\" Veilleux said. \"That's another thing to check on the list. Who trained properly, who didn't.\"\nBy Friday's first cut, coaches will have a better idea of the 22 or 23 players who will be around for the season opener - Oct. 16 against Wheeling.\nThere are 33 players competing for those spots. Among them, 10 played in Bakersfield last season, five for Veilleux in junior hockey in Canada. Two - Steven Whitney and Michael Pelech - played for the AHL Admirals. Ryan Jasinsky played an NHL exhibition for Washington against Philadelphia in 2009 but lately has played in a men's league in Chesapeake.\n\"The coach demands hard work, and I think that's what this first practice was about: setting the bar,\" said center Chase Schaber, who spent last season shuttling between Bakersfield and AHL Oklahoma City, a franchise that was moved to Bakersfield at the end of the season. \"I think we responded well with the conditions for the first day, with the ice being soft (because of humidity).\"\nSchaber likes the hockey geography. As a free agent, anybody in the AHL can pluck him off the Admirals roster.\n\"Out East here, there are a lot of opportunities. From what I've seen on the map, there are a lot of teams in close proximity to here,\" he said. \"Anything can happen, any kind of call-up. I'm excited about that, and so are the guys.\"\nBefore impressing a scout, he has to do what the rest of the Admirals were trying to do Monday: impress their coach.\n\"He's the type of guy who doesn't put up with anything but the best,\" Boudreau said. \"You can tell some of the (former Bakersfield) players noticed the pure work ethic. There's a change here.\"\n1 of 5 photos: Admirals head coach Eric Veilleux talks to his players during the team's first practice on Monday, Oct. 5, 2015. (Stephen M. Katz | The Virginian-Pilot) Loading more photos... View all 5 photos | Buy Pilot photos Related Admirals set to open camp on Monday - Oct. 4, 2015 In AHL finale, Admirals' late rally falls just short - Apr. 19, 2015 In final home AHL game, Admirals win 4-2 - Apr. 18, 2015 The AHL in Norfolk: 2000-2015 - Apr. 17, 2015 Admirals blow late lead in regulation, but win in OT - Apr. 12, 2015 Posted to : Admirals Norfolk Norfolk Admirals Sports", "external_links": ["http://pilot.mycapture.com/mycapture/", "http://pilot.mycapture.com/", "http://pilot.mycapture.com/mycapture/remoteimage.asp?image=http://media.hamptonroads.com/cache/files/imagecache/large_site_image_760x760/files/images/1926131000.jpg&source=jsapi&backurl="], "published": "2015-10-06T03:00:00.000+03:00", "crawled": "2015-10-06T19:04:44.835+03:00", "highlightTitle": ""}