{"organizations": [], "uuid": "37abe41e56a869ed3fe5bb74f682209ab579bdb5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/editorials/paying-for-clean-air/144727.html", "country": "US", "title": "Paying for clean air", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "Paying for clean air", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "37abe41e56a869ed3fe5bb74f682209ab579bdb5"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/editorials/paying-for-clean-air/144727.html", "ord_in_thread": 0, "title": "Paying for clean air", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The National Green Tribunal has been imposing exacting demands, its pronouncements being equated with overreach and runaway activism. The judicial body has creditably shown no willingness to bend on the issue of environment protection. The additional tax on polluting trucks entering Delhi was one such stringent measure to check the national capital’s sickening air quality level. The Supreme Court has gone a step ahead. It has agreed to an ‘environment compensation charge’ of Rs 700 for every light commercial vehicle and Rs 1,300 for every truck entering Delhi. The order imposing the anti-pollution cess is expected. The urgency being shown is timely because air pollution worsens in winter, as cold air traps pollutants. A World Health Organisation study of 1,600 cities, released last year, ranked Delhi as the most polluted in the world. It had, on an annual average, more than double the safe limit of small particulates, with fuel-guzzling vehicles the most to blame. Though proposed as a disincentive for polluting vehicles entering the city, the cess would be levied on vehicles conforming to norms as well. It is a harsh price to pay, but necessary to deter non-compliance of emission standards. Transporters have been quick to protest, pointing out how the ‘severe’ ban on 10-year-old diesel vehicles has already taken the polluting carriers off the road. Any discernible impact of the ban is yet to be reported. The anti-pollution cess has to be collected at all entry points to Delhi, and will be levied for four months initially. Buses and vehicles carrying essential items like food will be exempt. The money collected is to be used by the Delhi government to augment public transport. It is estimated that 66,000 heavy commercial vehicles enter Delhi every day and the low toll rates could be the main reason why they avoid taking longer, alternative routes. That demands greater coordination with neighbouring Haryana, Rajasthan and Uttar Pradesh and the highway authorities. Also requiring urgent intervention are unfinished projects like the Kundli-Manesar-Palwal expressway. This alone would have considerably lowered the number of vehicles entering Delhi.", "external_links": [], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-12T00:04:19.785+03:00", "highlightTitle": ""}