{"organizations": [], "uuid": "e64c00a45070db6ef083cb10baa07f72d3915315", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/49412494.cms", "site_section": "http://timesofindia.indiatimes.com/", "section_title": "India News, Latest Sports, Bollywood, World, Business &amp; Politics News - Times of India", "url": "http://timesofindia.indiatimes.com/centre/EPFO-plans-to-settle-PF-claims-online-within-3-hrs/articleshow/49412437.cms", "country": "IL", "title": "EPFO plans to settle PF claims online within 3 hrs", "performance_score": 0, "site": "indiatimes.com", "participants_count": 4, "title_full": "EPFO plans to settle PF claims online within 3 hrs - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T00:35:00.000+03:00", "replies_count": 3, "uuid": "e64c00a45070db6ef083cb10baa07f72d3915315"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/centre/EPFO-plans-to-settle-PF-claims-online-within-3-hrs/articleshow/49412437.cms", "ord_in_thread": 0, "title": "EPFO plans to settle PF claims online within 3 hrs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW DELHI: All that paperwork for withdrawing your PF money may soon be history.\nRetirement fund body EPFO is hopeful of launching an online PF withdrawal facility by March end after the Supreme Court extended voluntary use of Aadhaar card to government schemes, including provident fund.\nThe Employees' Provident Fund Organisation with over five crore subscribers has been working on such a facility for online settlement of PF claims within three hours of receiving an application.\nOnce this is operational, subscribers can apply online for PF withdrawal, which will be transferred directly to their bank accounts.\n\"We have written to the labour ministry for approvals for starting an online PF withdrawal facility. We are hopeful of launching this by March end after yesterday's Supreme Court ruling,\" Central Provident Fund Commissioner K K Jalan told PTI.\nYesterday, the apex court extended voluntary use of Aadhaar for schemes like MGNREGA, all types of pension schemes and provident fund, PM's Jan Dhan Yojana.\nAt present, subscribers who wish to settle their accounts with the Employees' Provident Fund Organisation (EPFO) are required to apply manually.\nJalan said, \"We want to launch the PF withdrawal facility and sought certain approvals. But before launching that, we will ensure speedy verification of PF withdrawal cases of those applicants who will mention their Aadhaar in their claims.\"\nElaborating, he said, \"During this month, we will start settling all PF withdrawal claims having Aadhaar numbers within three days against the mandated period of 20 days though the claims will be filed manually only.\"\nIn order to push the online facility for subscribers, EPFO has become the registrar of the Unique Identification Authority of India (UIDAI) for purpose of enrolment. It is also an online authentication user agency for the Authority.\nHowever, for the online mechanism to work, at least 40 per cent of Unique (portable PF) Account Numbers (UANs) should be seeded with Aadhaar numbers and bank account details of the subscribers.\nAccording to EPFO website, the authority has issued 5.6 crore UANs, of which 92.88 lakh subscribers have provided their Aadhaar numbers and 2.75 crore bank account details.\nEPFO has verified or attested 64.67 lakh Aadhaar numbers and 1.9 crore banks accounts for seeding those with UANs. At present, there are 1.99 crore subscribers who have actually activated their UANs.\nThe seeding of Aadhaar with UAN is also required for providing online PF withdrawal claim facility. Stay updated on the go with Times of India News App. Click here to download it for your device.", "external_links": ["https://play.google.com/store/apps/details?id=com.toi.reader.activities"], "published": "2015-10-17T00:35:00.000+03:00", "crawled": "2015-10-17T06:29:59.398+03:00", "highlightTitle": ""}