{"organizations": [], "uuid": "d4d6a1617768aca3cfa60375f3e73ff6e39c472e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nydailynews.com", "main_image": "http://assets.nydailynews.com/polopoly_fs/1.280193!/img/httpImage/image.jpg_gen/derivatives/landscape_1200/amd-cosme-jpg.jpg", "site_section": "http://www.nydailynews.com/sports/high-school/index.html", "section_title": "New York High School Sports Coverage, Photos, HS Hoops, Recaps - NY Daily News", "url": "http://www.nydailynews.com/sports/high-school/madison-victor-cosme-continues-emergence-telecomm-article-1.280192", "country": "US", "title": "Madison's Victor Cosme continues emergence against Telecomm", "performance_score": 0, "site": "nydailynews.com", "participants_count": 1, "title_full": "Madison's Victor Cosme continues emergence against Telecomm - NY Daily News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "d4d6a1617768aca3cfa60375f3e73ff6e39c472e"}, "author": "NEW YORK DAILY NEWS", "url": "http://www.nydailynews.com/sports/high-school/madison-victor-cosme-continues-emergence-telecomm-article-1.280192", "ord_in_thread": 0, "title": "Madison's Victor Cosme continues emergence against Telecomm", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Pace for News Senior Victor Cosme pitches Madison to 11-1 victory over previously undefeated Telecomm on Friday, keeping Knights perfect. Madison remained unbeaten and unrivaled on Friday, knocking off previously undefeated Telecomm, 11-1, in a game shortened to five innings because of the PSAL's mercy rule.\nVictor Cosme, who began the year as the Knights' third starter, improved to 3-0 and a made a case to be staff ace, throwing just 49 pitches and mixing an overpowering fastball with a curve that kept hitters off-balanced and buckling at the knees.\nThe senior righthander struck out four, walked none and surrendered three singles, and he has yet to give up an earned run this season.\n\"Victor has been lights out this year,\" Madison coach Vincent Caiazza said. \"If you told me going into the season that my No. 1 and No. 2 pitchers would not be pitching a lot up until this point, and I had to rely on Victor, I'd say you're crazy.\"\nCosme has stepped up and filled in for James Wong and Jonathan Farina , the one-two combination that led the Knights to a 14-2 record and the Brooklyn 'A' East division title last season. Both have seen limited innings this spring with sore arms.\n\"He threw hard, had a good curve, and he threw strikes,\" Telecomm coach Ed D'Alessio said. \"It was probably the best performance against us this year. He's probably one of the better pitchers in the PSAL.\"\nKevin Laidlaw and Chris Dantuono led Madison with two hits and two RBI apiece, and the Knights took advantage of five Telecomm errors as they improved to 7-0 at Bay 8th Street Park. The Yellow Jackets, the top team in Brooklyn 'A' West, fell to 8-1.\n\"We got a lot of two-out hits, and that's what was big about this game. With men on base, we executed,\" Dantuono said. \"Coming in, I thought it was going to be much closer. But I'll take it.\"\nThe Yellow Jackets spotted Madison a two-run lead on a pair of throwing errors in the first and never had momentum, giving up two more runs in the second and seven over the fourth and fifth innings.\n\"We made some bad plays, and that's basically it,\" D'Alessio said. \"These guys are one of the best teams in the city, and you can't play like that.\"\nTelecomm's lone threat came in the second, and it was mild at best.\nChris Taveras and Euris Turbi hit back-to-back singles with one out, but were stranded on base following a strikeout - Cosme had Jason Galeano backing away from a curve that broke over the heart of the plate - and a groundball to second.\nThe Yellow Jackets' lone run was scored on an infield error in the fifth.\n\"It's the two powerhouses in Brooklyn going up against each other, so it was a good test for us,\" Cosme said. \"Our bats are coming along, and my pitching hasn't been too bad. It's been pretty good.\"\nSheepshead Bay 4, New Utrecht 3\nEddie Rodriguez stole second and moments later delivered the game-winning run, but it was more like a free pass.\nAfter walking with two out in the top of the ninth, Rodriguez bolted for second when relief pitcher Giovanni Cucuzza threw a pitch from the windup instead of the stretch. He scored on Armando Merino 's single down the left field line, a disputed hit that gave Sheepshead Bay a 4-3 victory over New Utrecht on Friday.\n\"It's just a mental mistake,\" New Utrecht coach Rick DeMarco said of allowing the runner to move into scoring position. \"We were trying to get (Cucuzza) to step off, but I didn't want him to stop his motion and balk the guy over ... He's a kid. He made a mistake. You can't crucify him for it.\"\nMerino stopped running halfway down the line after his shot to left, thinking the ball was foul. But he turned back and saw the umpire signaling otherwise.\n\"I didn't know it was going to be fair. It looked foul to me,\" Merino said. \"I was proud to come through for my team. It's a great feeling.\"\nA few New Utrecht players questioned the call on the field, but DeMarco - whose Utes squandered a three-run lead - refused to use the play as an excuse.\n\"There were so many mistakes before that,\" he said. \"You can't blame an umpire's call.\"\nNew Utrecht fell to 7-1 in Brooklyn 'A' West with the extra-inning loss; the Sharks improved to 4-4 in Brooklyn 'A' East.", "external_links": [], "published": "2015-10-11T03:00:00.000+03:00", "crawled": "2015-10-11T08:57:33.453+03:00", "highlightTitle": ""}