{"organizations": [], "uuid": "088b7dc69bdad35ce7c509f3b15a48208d1f9915", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.oregonlive.com", "main_image": "http://imgick.oregonlive.com/home/olive-media/width620/img/oregonian/photo/2015/10/03/18895440-large.jpg", "site_section": "http://www.oregonlive.com/", "section_title": "Oregon Local News, Breaking News, Sports &amp; Weather - OregonLive.com", "url": "http://www.oregonlive.com/pacific-northwest-news/index.ssf/2015/10/oregon_shooting_mathew_downing.html", "country": "US", "title": "Oregon shooting: Mathew Downing, 'the lucky one,' details harrowing day", "performance_score": 0, "site": "oregonlive.com", "participants_count": 12, "title_full": "Oregon shooting: Mathew Downing, 'the lucky one,' details harrowing day | OregonLive.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T03:56:00.000+03:00", "replies_count": 11, "uuid": "3ae0a17ac254133a124973f2be940e0c8a4250cc"}, "author": "Luke Hammill | The Oregonian/OregonLive", "url": "http://www.oregonlive.com/pacific-northwest-news/index.ssf/2015/10/oregon_shooting_mathew_downing.html#post-0", "ord_in_thread": 0, "title": "Oregon shooting: Mathew Downing, 'the lucky one,' details harrowing day", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\"Hey kid with the glasses,\" the gunman told Mathew Downing, looking directly at him inside the Roseburg classroom. \"You are the lucky one.\"\nThe gunman continued: \"I will not shoot you if you give this to the cops.\"\nDowning stood up. The shooter pointed his gun at him.\n\"This is the moment I thought I was going to die,\" Downing wrote in a statement released Friday evening.\nDowning, 18, was at Umpqua Community College when 26-year-old Chris Harper-Mercer fatally shot nine people and injured nine others on Oct. 1. His 734-word statement lays out what happened, as he saw it, in harrowing detail. Harper-Mercer spared Downing in return for delivering an envelope containing a flash drive to the police.\nAs is common when eyewitnesses recall traumatic events, some of Downing's account lines up with what others have said about what took place in the classroom, and some of it doesn't.\nRead Mathew Downing's full statement. \"Thursday started out as any other day would've,\" Downing began the statement. He arrived at school on time, sat down and pulled out a paper.\nThirty or 40 minutes into the Introduction to Expository Writing class, Downing heard \"a couple of shots fired,\" he wrote. Those shots, perhaps, killed Larry Levine , 67, the instructor and reportedly the first to perish.\n\"I couldn't hear anything when he had walked in because my ears where [sic] ringing so badly,\" Downing wrote. \"When I saw the gun when he walked in the first thought in my head was that this couldn't be real.\"\nThe gunman told everybody to get onto the ground, Downing wrote.\n\"I listened and figured that if I did so throughout I wouldn't be harmed,\" Downing continued. \"He then told everybody to get into the center of the room and be quiet.\"\nThe shooter then put his backpack on the front desk, pulled out an envelope and announced that anyone who survived the attack should give the flash drive inside to police.\nThat's when Harper-Mercer looked at Downing and told him he was \"the lucky one.\" After Downing stood up, the gunman handed him the envelope and told him to sit in the \"very back seat and face him,\" according to Downing.\nLocal pastor Randy Scroggins, the father of Downing's classmate Lacey Scroggins, told The Oregonian/OregonLive in a secondhand account that the killer shot several students before singling out Downing.\nIn any case, the killer \"fired a couple of shots into the crowd of students in the center\" after giving Downing the envelope, he wrote.\nThe shooter then asked another student to stand up and asked whether he was religious.\n\"The student said he was Christian and was shot,\" Downing wrote.\nThe killer told another student to stand up and posed the same question. The student replied that he was Catholic.\nDo you believe in the afterlife? the student was asked.\n\"I don't know.\"\n\"The shooter thanked him for standing up for his beliefs and shot him,\" Downing wrote.\nOne of the female students lying near the front of the class then told the shooter that she was sorry for whatever happened to him and for whatever she had done wrong.\n\"The shooter then said that he bets she was and shot her,\" Downing wrote.\n\"At that point he was just firing on people who were just lying there and stopped when he heard a woman outside and shot out the window by the door,\" Downing continued, referring perhaps to a woman who, according to The New York Times , came from a nearby computer lab to check on the classroom and ended up with a bloody chest.\nThe killer then looked out the door and saw a man standing outside, Downing wrote.\n\"The man asked him not to shoot him because it's his son's birthday,\" Downing continued, likely referring to Chris Mintz, the Army veteran whose family said he charged the shooter and was shot multiple times. \"The shooter then fired multiple shots out of the door and shut it.\"\nOther reports suggested that Mintz mentioned his son's birthday after being shot. Downing makes no mention in the statement about Mintz charging the killer.\nThe shooter asked another student to stand up, Downing wrote. She replied that \"her legs wouldn't move because she was in too much pain.\"\nHarper-Mercer at that point \"seemed to have lost interest,\" Downing continued. He pointed his gun at yet another student and told her to stand up.\n\"She got scared and picked up a desk to defend herself,\" Downing wrote, \"and he shot through it anyway and hit her in the leg.\"\nThen the police showed up, Downing wrote. The cops were yelling from outside. The killer looked outside and fired more shots. He reloaded two handguns with ammunition from his backpack.\n\"He never left the class but only leaned about half of his torso out of the classroom to fire on the police,\" Downing wrote. The account differs from those of Douglas County District Attorney Rick Wesenberg and Douglas County Sheriff John Hanlin , who said Roseburg police detectives arrived to find Harper-Mercer standing in the doorway of Snyder Hall.\n\"The shooter leaned out of the classroom about two times and was shot by one of the officers then retreated into the class,\" Downing continued.\n\"When this happened, he laid down on the ground and shot himself in the head.\"\nDowning released his statement the same day he met President Barack Obama at Roseburg High School and the two shared a particularly emotional exchange. Obama told Downing, \"You're here for a reason and don't forget that,\" according to Gov. Kate Brown.\n\"The final thing I want to add is that I and everybody else should get from this is that any day could be your last,\" Downing wrote. \"You don't want anybody's last memory of you to be a bad one so everybody needs to take it upon themselves to just be a lot nicer to people.\"\n-- Luke Hammill\nlhammill@oregonian.com\n503-294-4029\n@lucashammill\n* This post originally contained Downing's full statement and was updated. The full statement has been posted separately.", "external_links": ["http://www.nytimes.com/2015/10/04/us/confusion-horror-and-heroism-in-oregon-shooting.html?hp&action=click&pgtype=Homepage&module=second-column-region&region=top-news&WT.nav=top-news&_r=0", "http://www.twitter.com/lucashammill"], "published": "2015-10-10T03:56:00.000+03:00", "crawled": "2015-10-10T12:15:19.728+03:00", "highlightTitle": ""}