{"organizations": [], "uuid": "fb684942c61f2d6bb0dadbef544af2cfb2fb44f3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reporterherald.com", "main_image": "http://extras.mnginteractive.com/live/media/site47/2015/1021/20151021__22rhsEaglesw~1.jpg", "site_section": "http://feeds.reporterherald.com/mngi/rss/CustomRssServlet/47/244119.xml", "section_title": "Sports", "url": "http://www.reporterherald.com/sports/eagles/ci_29005775/colorado-eagles-blow-third-period-lead-lose-third?source=rss", "country": "IL", "title": "Colorado Eagles blow third-period lead, lose third straight to open season", "performance_score": 0, "site": "reporterherald.com", "participants_count": 1, "title_full": "Colorado Eagles blow third-period lead, lose third straight to open season", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T07:09:00.000+03:00", "replies_count": 0, "uuid": "fb684942c61f2d6bb0dadbef544af2cfb2fb44f3"}, "author": "Cris Tiller \n\nReporter-Herald Sports Writer", "url": "http://www.reporterherald.com/sports/eagles/ci_29005775/colorado-eagles-blow-third-period-lead-lose-third?source=rss", "ord_in_thread": 0, "title": "Colorado Eagles blow third-period lead, lose third straight to open season", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Colorado Eagles blow third-period lead, lose third straight to open season Allen scores two goals in less than 3 minutes for comeback win By Cris Tiller \nReporter-Herald Sports Writer Posted: 10/21/2015 10:08:55 PM MDT Colorado Eagles forward Kyle Ostrow (19) and Allen's Chad Costello (13) race for the puck behind the net at the Budweiser Events Center on Wednesday. ( Trevor L Davis / Loveland Reporter-Herald ) \nEverything it seemed was shaping up the Colorado Eagles' way, finally. \nThey weren't giving up many scoring chances, they scored first and snagged a lead heading into the final period in great shape to pick up their first win of the season. \nBut in an instant things changed and the tide turned. Allen netted two goals in less than 3 minutes and slipped out of the Budweiser Events Center on Wednesday with a 3-1 victory, sending Colorado to its third straight loss to open the season. \n\"Those first two (losses), they were what they were and we came out and worked hard Monday and Tuesday. We came out here and played solid for 40 minutes, and instead of stepping on their throat, we sat back,\" Eagles captain Trent Daavettila said. \"I think we learned a valuable lesson and we just have to stick together. Obviously starting the season 0-2-1 like it is looks awful, but if you do that in the middle of the season it's something that isn't the biggest deal in the world. \n\"We just can't tighten up. It's still early in the season; we have a lot of good players and a lot of good things to come for this team. As frustrating as it is, we can't let that control our play.\" \nWednesday was clearly Colorado's best opportunity yet to chalk up its first victory of the year, but one fluke mistake early in the third period killed all momentum for the Eagles (0-2-1, 1 point), while swinging it firmly to Allen. \nDrawing a 4-minute power play, the Eagles were set up perfectly to find an insurance goal, yet a puck got caught up in forward Nathan Moon's skates midway through and he couldn't find it as Allen's Casey Pierro-Zabotel scooped it up and scored to tie the contest at 1 with 14:40 remaining in the game. \nEagles netminder Jacob DeSerres served up a rebound 2:35 later and the Americans (2-2, 4 points) capitalized for the wining goal even though they were outshot 29-16. An empty-net score late sealed up the Americans' comeback. \n\"It was a frustrating play, and those are going to happen in a game, so it's not like it should've deflated us. It wasn't that they scored, it was that they took all the momentum away after our power play,\" Daavettila said. \"It was almost like we were sitting back thinking 'OK, we've got to win this, we've got to win this.' We didn't have that killer mentality. That's something we have to develop as a team and take that pressure off ourselves.\" \nUnlike Colorado's first two games of the year against Utah, it was a challenge for either side to touch the back of the net through the opening two periods. The Eagles and Allen spent most of the first trading possession and trying to find a foothold in the game. \nThe Eagles threw 15 shots on net in the second, while holding Allen to just six despite three power plays for the Americans. It was a positive sign for the Eagles, who struggled defensively in the opening series of the season, allowing nine goals (one on an empty net). \nYet through persistence, Colorado struck first for the second time in the season midway into the second period. The Eagles received contribution from their blue line once again as Collin Bowman jumped into the play, tickling twine for the second time this year. \nBowman snuck up the right side and found the puck from his older brother Drayson and let loose a rifled shot from the circle past Allen goaltender Joel Rumpel. It was a unique moment for the Bowman family, marking the first time the two hooked up for a goal in their professional careers. \nThe goal was exactly what the Eagles had been missing in a pair of lackluster performances to start the campaign, having never held a lead at any point in the second or third period against the Grizzlies. \nUnfortunately, finishing remains a problem for Colorado as several rebounds were surrendered around Allen's crease and nobody in an Eagles sweater could send the puck home. Missed opportunities proved deadly by the end. \n\"I think tonight we saw probably better effort, but again we're not capitalizing and I don't think we got the timely stops we needed,\" Colorado coach Chris Stewart said. \"When you're doubling a team in shots and not finding a way to win, that's no good. We have to find a way to finish. The right guys had possession of the puck and they're not scoring.\" \nColorado makes its first road trip of the season Friday, albeit a quick one as the Eagles travel to Rapid City as part of a home and home, returning to the BEC on Saturday to face the Rush (both at 7:05 p.m.). Rapid City sticks around for a Wednesday contest as well. \nCris Tiller: 970-669-5050 ext. 511, tillerc@reporter-herald.com or twitter.com/cristiller \nAmericans 3, Eagles 1 Allen 0 0 3 — 3 Colorado 0 1 0 — 1 \nFirst period — No scoring. \nSecond period — 1. Colorado, C. Bowman 2 (D. Bowman, Moon), 9:39. \nThird period — 2. Allen, Pierro-Zabotel 1, 5:20 (SH). 3. Allen, King 2 (Hanson, Pierro-Zabotel), 7:55. 4. Allen, Federico 1, (Gens), 19:20 (EN). \nShots on goal — Allen 16; Colorado 29. \nPower plays — Allen 0-for-4; Colorado: 0-for-5. \nGoalies (shots-saves) — Allen: Rumpel (29-28); Colorado: DeSerres (16-14).", "external_links": [], "published": "2015-10-22T07:09:00.000+03:00", "crawled": "2015-10-22T07:55:06.402+03:00", "highlightTitle": ""}