{"organizations": ["FIFA"], "uuid": "b284a9a52d79d71cdc195d86bd9f16b0819941e4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/82624eaef357459112273d3eaa205105.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/football/fifa-confirm-ethics-committee-investigations-into-beckenbaue/6969713/", "country": "JE", "title": "FIFA confirm ethics committee investigations into Beckenbauer and Villar Llona", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "FIFA confirm ethics committee investigations into Beckenbauer and Villar Llona", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T17:46:00.000+03:00", "replies_count": 0, "uuid": "b284a9a52d79d71cdc195d86bd9f16b0819941e4"}, "author": "", "url": "http://www.sport.co.uk/football/fifa-confirm-ethics-committee-investigations-into-beckenbaue/6969713/", "ord_in_thread": 0, "title": "FIFA confirm ethics committee investigations into Beckenbauer and Villar Llona", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Villar Llona", "Beckenbauer"], "text": "FIFA confirm ethics committee investigations into Beckenbauer and Villar Llona 21 Oct 2015 14:46:56 \ncomments \nFIFA has confirmed German World Cup winner Franz Beckenbauer and vice president Angel Maria Villar Llona are both subject to investigations by the organisation's ethics committee. \nBeckenbauer was a FIFA voter when Russia and Qatar were chosen to host the 2018 and 2022 World Cups respectively, while Villar Llona has sat as vice president on FIFA's executive committee since 1998. \nThe investigations into both men have been completed and are now awaiting verdict. \nA FIFA statement read: \"Proceedings relating to the two officials Angel Mari­a Villar Llona and Franz Beckenbauer have already been passed on to the adjudicatory chamber.\" \nBeckenbauer and Villar Llona are two of 11 names confirmed to be under investigation by FIFA which include president Sepp Blatter, secretary general Jerome Valcke and UEFA president Michel Platini. All three were handed provisional 90-day suspensions two weeks ago. \nThe other six officials identified are Worawi Makudi, Jeffrey Webb, Ricardo Teixeira, Amos Adamu, Eugenio Figueredo and Nicolas Leoz. \nBeckenbauer and Villar Llona had not been publicly named before as under investigation but a change in the ruling on Tuesday means FIFA's ethics committee can now reveal details of cases that are ongoing. \nBeckenbauer headed the organising committee for the 2006 World Cup and was forced to reject allegations on Sunday that a slush fund was set up to buy Germany votes to host the tournament. \nHe was also suspended last year for initially refusing to assist the investigation led by FIFA prosecutor Michael Garcia into the bidding for the 2018 and 2022 tournaments. Related Sport News", "external_links": [], "published": "2015-10-21T17:46:00.000+03:00", "crawled": "2015-10-21T20:14:22.218+03:00", "highlightTitle": ""}