{"organizations": ["Syracuse Orange Associated Press", "South Florida Bulls", "Syracuse", "USF Bulls", "Syracuse Orange", "Syracuse Orange South Florida", "Syracuse Orange Facebook Email Twitter Google", "Bulls"], "uuid": "7b0b7c32cd5b4cf8ced0ce6ff8989db46e0bfa67", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wtsp.com", "main_image": "http://www.gannett-cdn.com/-mm-/489efad1142179deef9ce5ef3cf126cd99e1a3f1/r=x633&amp;c=1200x630/http/cdn.tegna-tv.com/-mm-/e0a8d37eac76380030462fb43a86430acf453c1d/c=2-0-952-537/local/-/media/2015/10/10/WTSP/WTSP/635800670833019456-100915-fsf-cfb-willie-taggart-PI.vadapt.955.high.16.jpg", "site_section": "http://rssfeeds.wtsp.com/_/20/109957632/wtsp/sportsnews", "section_title": "WTSP - Sports", "url": "http://www.wtsp.com/story/sports/2015/10/10/preview-usf-bulls-host-syracuse-orange/73724406/", "country": "US", "title": "PREVIEW: USF Bulls host Syracuse Orange", "performance_score": 0, "site": "wtsp.com", "participants_count": 0, "title_full": "PREVIEW: USF Bulls host Syracuse Orange", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T16:47:00.000+03:00", "replies_count": 0, "uuid": "7b0b7c32cd5b4cf8ced0ce6ff8989db46e0bfa67"}, "author": "", "url": "http://www.wtsp.com/story/sports/2015/10/10/preview-usf-bulls-host-syracuse-orange/73724406/", "ord_in_thread": 0, "title": "PREVIEW: USF Bulls host Syracuse Orange", "locations": ["USA"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jonathan Dyer", "Willie Taggart"], "text": "Facebook Email Twitter Google+ LinkedIn Pinterest PREVIEW: USF Bulls host Syracuse Orange South Florida's Willie Taggart rejects the notion that beating Syracuse would give the struggling Bulls the type of victory needed to prove they're headed in the right direction under the third-year coach. Post to Facebook PREVIEW: USF Bulls host Syracuse Orange South Florida's Willie Taggart rejects the notion that beating Syracuse would give the struggling Bulls the type of victory needed to prove they're headed in the right direction under the third-year coach. Check out this story on wtsp.com: http://on.wtsp.com/1LnA1ek Cancel Send A link has been sent to your friend's email address. Posted! A link has been posted to your Facebook feed. Join the Conversation To find out more about Facebook commenting please read the Conversation Guidelines and FAQs PREVIEW: USF Bulls host Syracuse Orange Associated Press, AP 9:47 a.m. EDT October 10, 2015 Coach Willie Taggart leads the South Florida Bulls against the Syracuse Orange. (Photo: Jonathan Dyer, USA TODAY) 1 CONNECT TWEET LINKEDIN COMMENT EMAIL MORE \nTAMPA, Fla. (AP) -- South Florida's Willie Taggart rejects the notion that beating Syracuse would give the struggling Bulls the type of victory needed to prove they're headed in the right direction under the third-year coach. \nSure, the Orange (3-1) are off to a promising start and are members of a Power Five conference, however Taggart said that's not the only reason winning Saturday would be significant. \n\"I think one win right now can change a lot for our football team,\" Taggart said. \n\"It would be great to beat a Power Five football team, and Syracuse is a good football team,\" the coach added. \"They're not the team that they were before. They're not 3-1 for (no) reason, they're playing some good football. It's a good challenge for our guys to go beat a good, winning football team. It gives you a lot of confidence.\" \nIt would also support Taggart's belief that he's on the verge of turning around a program that's fallen on hard times since the Bulls rose as high as No. 2 in the nation in 2007. \nUSF (1-3) has lost three straight to Florida State, Maryland and Memphis, falling to 7-21 in two-plus seasons under the one-time Jim Harbaugh assistant. Taggart's players say they feel a sense of urgency to win because it's the next opportunity to stop the slide, not because they think their coach's job is in jeopardy. \n\"We're playing for each other,\" running back Darius Tice said, adding Taggart doesn't make the players \"feel that type of way.\" \n\"He comes out with energy and he pushes us to come out with energy each day,\" Tice added. \"He's a great coach, a great guy. He has our back, he's always there for us, so we just go out and play for each other. We feel like that will take care of the rest.\" \nSyracuse is coming off a bye following a 10-point loss to LSU and is playing on the road for the first time this season. The Orange has already matched its victory total for last season, and are not strangers to USF. \nThe teams played eight consecutive years from 2005 to 2012 before Syracuse moved from the Big East to the Atlantic Coast Conference. USF won the first five meetings, but the Orange has won two of the last three -- with both victories coming in Tampa. \n\"'We're going to be playing on the road for the first time and I think we'll adjust pretty well,\" receiver Steve Ishmael said. \n-", "external_links": [], "published": "2015-10-10T16:47:00.000+03:00", "crawled": "2015-10-10T17:12:08.236+03:00", "highlightTitle": ""}