{"organizations": [], "uuid": "7a9195d10ed4c23881489a712099cdea4960a188", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegram.com", "main_image": "http://www.telegram.com/storyimage/WT/20151011/SPORTS/151019801/AR/0/AR-151019801.jpg&MaxW=1200&MaxH=630", "site_section": "http://www.telegram.com/sports?template=rss&mime=xml", "section_title": "Sports - telegram.com", "url": "http://www.telegram.com/article/20151011/SPORTS/151019801/101360/NEWS?rssfeed=true", "country": "US", "title": "Patriots notes: Dont'a Hightower exits with rib injury", "performance_score": 0, "site": "telegram.com", "participants_count": 1, "title_full": "Patriots notes: Dont'a Hightower exits with rib injury", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T06:55:00.000+03:00", "replies_count": 0, "uuid": "7a9195d10ed4c23881489a712099cdea4960a188"}, "author": "Jim Donaldson and Mark Daniels @JDonaldsonProJo @MarkDanielsPJ", "url": "http://www.telegram.com/article/20151011/SPORTS/151019801/101360/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "Patriots notes: Dont'a Hightower exits with rib injury", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Patriots notes: Dont’a Hightower exits with rib injury Comment By Jim Donaldson and Mark Daniels@JDonaldsonProJo By Jim Donaldson and Mark Daniels@JDonaldsonProJo Posted Oct. 11, 2015 at 10:53 PM Updated Oct 11, 2015 at 10:55 PM By Jim Donaldson and Mark Daniels@JDonaldsonProJo Posted Oct. 11, 2015 at 10:53 PM Updated Oct 11, 2015 at 10:55 PM ARLINGTON, Texas — The Patriots lost one of their defensive leaders on Sunday when Dont’a Hightower when down with a rib injury. At 6:38 of the first quarter, the linebacker was down on the turf after a Joseph Randle 2-yard run. He stayed there for several minutes before walking to the bench on his own. He was seen walking around the sideline before departing for the locker room. The Patriots ruled Hightower out in the second half. He had a team-high four tackles and a sack when he left the game. Hightower was also wearing a green dot on his helmet, which meant he was signaling in the defense play calls. It was a tough loss for the Patriots, but the defense didn’t allow it to rattle them. Instead, the team got another outstanding performance from Jamie Collins and relied on captain Jerod Mayo and Jonathan Freeny to fill the void. “High goes out and Mayo comes in. For us, that’s nothing,” Devin McCourty said. “Mayo’s been in there for so many years. Especially for me, we don’t even think about it. Freeny has done a great job throughout the year whenever he’s called to be in there. I played with him in college. It was just keep playing. “We got a lot of guys at that position who can play. Between Mayo and Freeny and Jamie, whoever is in there we’re comfortable with whoever to keep executing our game plan.” Collins was the star of the defense on Sunday. The linebacker led the game with 10 tackles and forced a fumble. “The dude is not human, man,” McCourty said. “He was all over the field today. He made so many plays that he did not make on paper, just his presence of maybe being in the gap — he was all over the place. That’s coming from me, not watching the game, being in the game I could feel it. I can’t imagine being able to watch from up top and see all the plays he’s able to make. Added Sheard: \"I must agree. He’s a heck of an athlete. Freakish athlete. Plays hard every day. Gives it his all. Anything you’ve got a freakish guy like that, he’s going to draw a lot of attention. He did a good job of getting penetration on the line and I just played off of him.” It remains to be seen how long Hightower is out, but it’s convenient that the Patriots recently traded for a linebacker (Jon Bostic) to give them extra depth. Bostic was inactive on Sunday. QB change coming? Brandon Weeden hasn’t won a game as a starting quarterback since he was a rookie with Cleveland in 2012. He’s 0-9 as a starter since then, including an 0-3 mark this season with Cowboys after taking over for the injured Tony Romo. With the Cowboys putting up just six points Sunday against the Patriots, there is speculation in Dallas that recently acquired journeyman Matt Cassel could step in two weeks from now when, after their bye week, the Cowboys take on their NFC East rivals, the New York Giants, at the Meadowlands. “I don’t want to get into that,” Cowboys owner Jerry Jones said after Sunday’s 30-6 trouncing at the hands of Brady and the Patriots. “We can’t place the results that we had on our quarterback,” he said. “We do have to do better on offense, and usually that does include better, and more effective, quarterback play.” Weeden completed 26 of 39 passes against the Pats, for 188 yards, but led the Cowboys to just two field goals and threw an interception. “We just couldn’t get it going,” Weeden said. “We could never establish any momentum. It wasn’t good enough. It wasn’t something to be proud of.” As to whether he thought his performance was good enough to retain his starting job, Weeden said: “I don’t want to talk about it. That’s [a coaching] decision. That’s what their role is. My role is to be ready to play football. “Of course, I’m going to take a lot of the blame. That’s just part of playing this position. Right, wrong, or indifferent, that’s just the way it works. I won’t let it faze me. “I left everything I had out on the field. Didn’t get it done, but I can look myself in the mirror and say that I fought and battled.” It’ll be interesting to see what Cowboys coach Jason Garrett thinks after looking at the tapes of Sunday’s game. “Brandon didn’t play well enough,” Garrett said in his postgame press conference. “We didn’t play well enough. We’re going to watch the tape and evaluate each guy and each unit to see how we can play better. “Ultimately, we didn’t score enough points. Brandon was a part of that, but every else was a part of it, too.” Cassel, who was 10-5 as a starter for the Patriots in 2008, when Brady was lost for the year in the season opener with a knee injury, since has bounced from New England to Kansas City, Minnesota, and then Buffalo, which traded him to Dallas on Sept. 22nd. The Cowboys have been struggling since Romo broke his collarbone in the second game of the season. By Jim Donaldson and Mark Daniels@JDonaldsonProJo", "external_links": [], "published": "2015-10-12T06:55:00.000+03:00", "crawled": "2015-10-12T07:49:43.031+03:00", "highlightTitle": ""}