{"organizations": [], "uuid": "802b8fa3ce48a27e228c5074623fa2372ad7e434", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "abcnewsradioonline.com", "main_image": "http://abcnewsradioonline.com/storage/news-images-october-2015/Getty_101415_BlueJays.jpg?__SQUARESPACE_CACHEVERSION=1444868329281", "site_section": "http://abcnewsradioonline.com/sports-news/rss.xml", "section_title": "Sports News", "url": "http://abcnewsradioonline.com/sports-news/crazy-playoff-game-between-toronto-blue-jays-and-texas-range.html", "country": "US", "title": "Crazy Playoff Game Between Toronto Blue Jays and Texas Rangers Explained", "performance_score": 0, "site": "abcnewsradioonline.com", "participants_count": 1, "title_full": "Crazy Playoff Game Between Toronto Blue Jays and Texas Rangers Explained", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T12:28:00.000+03:00", "replies_count": 0, "uuid": "802b8fa3ce48a27e228c5074623fa2372ad7e434"}, "author": "Louis Milman", "url": "http://abcnewsradioonline.com/sports-news/crazy-playoff-game-between-toronto-blue-jays-and-texas-range.html", "ord_in_thread": 0, "title": "Crazy Playoff Game Between Toronto Blue Jays and Texas Rangers Explained", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Share Article \nPhoto by Jon Blacker/MLB Photos via Getty Images (TORONTO) -- The Texas Rangers and Toronto Blue Jays had a winner-take-all playoff game on Wednesday, and the level of drama only increased from there.In the seventh inning, with the teams tied at 2, the game reached a whole new level of crazy. Rangers second baseman Rougned Odor was on third base with outfielder Shin-Soo Choo at the plate. As Blue Jays catcher Russell Martin attempted to throw a ball back to the pitcher struck Choo's bat at bounded away, as Odor raced home with the tie-breaking run.Here's where it gets wild:Home plate umpire Dale Scott called the play dead as Odor raced home. After the umpires conferred, the run was counted. Blue Jays manager John Gibbons came out to protest, while Blue Jays fans hurled trash, beer and other projectiles onto the field. After a review of the rules, the run was confirmed.MLB's rules specifically state that \"if the batter is standing in the batter's box and he or his bat is struck by the catcher's throw back to the pitcher (or throw in attempting to retire a runner) and, in the umpire's judgement, there is no intent on the part of the batter to interfere with the throw, the ball is alive and in play.\" \n— Heidi Watney (@HeidiWatney) October 14, 2015 \nFor most games, even a tense playoff game, that would be the cherry on top. But not on Wednesday.The bottom of the seventh only upped the insanity level. The first batter of the inning grounded a ball to Rangers shortstop Elvis Andrus, who botched it for an error. The second batter grounded one to Rangers first baseman Mitch Moreland, but his throw to second base was dropped by Andrus. The ensuing batter bunted to third baseman Adrian Beltre whose throw to Andrus at third base was also dropped, leaving the bases loaded.The fourth batter of the inning grounded another ball to Moreland, whose throw home retired pinch runner Dalton Pompey. But umpires needed a review to see whether Pompey had interfered with the Rangers' catcher with his slide.Then, Blue Jays slugger and American League MVP candidate Josh Donaldson blooped a ball that seemed destined to be caught over Odor's head at second base. The tying run scored, but an out was recorded at second base.One batter later, Jose Bautista launched a baseball halfway to orbit, giving the Blue Jays a 6-3 lead. The home run was followed by a bat flip heard 'round the Internet, which appeared to upset some Rangers players, bringing both benches out for a near-brawl. \n— MLB (@MLB) October 15, 2015 \n\nThe Rangers eventually got the final two outs of the inning, but afterwards pitcher Sam Dyson said something to Blue Jays' shortstop Troy Tulowitzki, patting him on the rear. Tulowitzki appeared to take exception to the pat, but cooler heads -- finally -- prevailed.The Blue Jays eventually went on to win 6-3, advancing to the American League Championship Series against the winner of Wednesday night's matchup between the Kansas City Royals and the Houston Astros. \nCopyright © 2015, ABC Radio. All rights reserved. Thursday, October 15, 2015 at 5:28AM", "external_links": [], "published": "2015-10-15T12:28:00.000+03:00", "crawled": "2015-10-15T18:58:04.971+03:00", "highlightTitle": ""}