{"organizations": ["Dodgers", "Mets"], "uuid": "ccb0845604eb032f9ed17b1708fd8773f2a6d896", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.philly.com", "main_image": "http://media.philly.com/designimages/pcom-FB.jpg", "site_section": "http://www.philly.com/philly_sports.rss", "section_title": "Philly.com Sports", "url": "http://www.philly.com/philly/sports/phillies/20151012_Mets__Harvey_calls_Utley_s_takeout_slide_a__tackle_.html", "country": "US", "title": "Utley suspended 2 games for takeout slide", "performance_score": 0, "site": "philly.com", "participants_count": 0, "title_full": "Utley suspended 2 games for takeout slide", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T05:31:00.000+03:00", "replies_count": 0, "uuid": "ccb0845604eb032f9ed17b1708fd8773f2a6d896"}, "author": "", "url": "http://www.philly.com/philly/sports/phillies/20151012_Mets__Harvey_calls_Utley_s_takeout_slide_a__tackle_.html", "ord_in_thread": 0, "title": "Utley suspended 2 games for takeout slide", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Harvey", "Don Mattingly", "Utley", "Tejada"], "text": "WATCH: Daily fantasy baseball updates Whether the Mets will come back with retribution for Tejada's injury will be on everyone's mind on Monday night. It is uncertain if Utley will even be in the Dodgers' lineup. The 36-year-old second baseman did not start either of the series' first two games but has six hits in 18 career at-bats against Harvey. On Sunday, Dodgers manager Don Mattingly would not reveal any part of his Game 3 lineup, noting the obvious that Utley \"will definitely be a possibility.\"\nUtley, a six-time all-star and one of baseball's hardest-nosed players throughout his 12-plus seasons with the Phillies, reached base Saturday on a pinch-hit single. Then came Howie Kendrick's soft line drive up the middle, and Utley's breakup of the potential double play. Tejada was turning to unleash his throw to first when contact was made. \nUtley, ruled safe on the play after a challenge because Tejada did not touch second base, scored the game's go-ahead run after Adrian Gonzalez's key two-run double. After the game, Utley told reporters in Los Angeles he was \"going hard to try to break up the double play\" but \"had no intent to hurt anyone whatsoever.\" \n\"I feel terrible that he was injured. . . . You have to try and break up the double play. That's winning baseball.\" \nMattingly staunchly defended Utley on Sunday after the team arrived in New York. The Los Angeles skipper also said Tejada was \"courageous\" for attempting to turn two when he could have taken just the sure out at second. \nMattingly said he had not spoken to anyone from the league office regarding potential discipline for Utley, who has taken a backseat to Kendrick since the latter returned from injury late in the season. Utley was tested for a concussion after the collision and passed, Mattingly said. \n\"I look at it as a baseball play,\" Mattingly said. \"It was a hard, aggressive, legal slide to me. . . . Our organization is proud of the way Chase plays. We love the way he plays. He's got a reputation for playing the game right, playing it hard, and we're behind him 100 percent.\" \nUtley's slide, replayed over and over Sunday on televisions across the country, could result in a rule change that better protects middle infielders. \nBefore the 2014 season, Major League Baseball implemented new rules regarding home-plate collisions to protect catchers. That was in part a response to the 2011 broken leg suffered by San Francisco Giants star catcher Buster Posey on a play at the plate. \nUtley's slide could have a similar effect for second basemen and shortstops. In the Arizona Fall League that begins this week, MLB already was planning to experiment with having base runners work on sliding directly into second base, Joe Torre revealed when speaking to reporters at Dodger Stadium after Saturday's game. \nTorre, baseball's discipline czar, said Saturday the league was still looking at the situation to determine if discipline of Utley was necessary. Torre said he was concerned by \"the lateness of the slide.\" \n\"I know they're looking at it, and I'm going to let them make a decision, but we all, everybody in this room included, we all know how hard Chase plays and everything else,\" Mets manager Terry Collins said Sunday during his news conference back in New York. \"It was late. It was a late slide. \n\"Where he hit Ruben on the field certainly was something that needs to be addressed, but I'll let Major League Baseball handle that.\" \nIn Tejada, the Mets lost \"a pretty big piece of the puzzle,\" Collins said. Wilmer Flores will man shortstop in his place. \n\"Needless to say, [the players] were quite upset with the whole situation,\" Collins said. \"We don't need any more motivation, but that certainly gives us some extra motivation going into [Monday] night.\"", "external_links": [], "published": "2015-10-12T05:31:00.000+03:00", "crawled": "2015-10-12T05:45:49.021+03:00", "highlightTitle": ""}