{"organizations": ["Collegiate Sportswear & Merchandise"], "uuid": "42e4eef29d1354be1e347cf0fbe3d816e75b002a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.philly.com", "main_image": "http://media.philly.com/images/101415_hackenberg_1200.jpg", "site_section": "http://www.philly.com/philly_sports.rss", "section_title": "Philly.com Sports", "url": "http://www.philly.com/philly/sports/colleges/penn_state/20151022_Hackenberg__It_s_about_wins__not_stats.html", "country": "US", "title": "Hackenberg: It's about wins, not stats", "performance_score": 0, "site": "philly.com", "participants_count": 0, "title_full": "Hackenberg: It's about wins, not stats", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T00:40:00.000+03:00", "replies_count": 0, "uuid": "42e4eef29d1354be1e347cf0fbe3d816e75b002a"}, "author": "", "url": "http://www.philly.com/philly/sports/colleges/penn_state/20151022_Hackenberg__It_s_about_wins__not_stats.html", "ord_in_thread": 0, "title": "Hackenberg: It's about wins, not stats", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hackenberg"], "text": "SHOP: Collegiate Sportswear & Merchandise \n\"On a personal level, that really doesn't matter,\" he said Wednesday in a conference call with reporters. \"What matters is what we're being asked to do and we need to go out and execute at a high level. So that's how we approach it - that's how I approach it. \n\"The coaches game plan hard each and every week. We're working hard in the film room. We're working hard out on the practice field. We're just trying to win football games. So whatever is being asked of us, we deal with that at 1,000 miles an hour.\" \nWhatever the game plan, Hackenberg will turn to what he calls \"one of my best strengths . . . just being able to buy into that 100 percent and roll with it.\" \nWith Maryland as its opponent Saturday in Baltimore, Penn State will be dealing with one of the Big Ten's worst pass defenses. The Terrapins are 11th in the conference, allowing about 261 yards per game. The last time the Lions played against a poor pass defense, Hackenberg notched season highs with 21 completions and 39 attempts, good for 262 yards, against Indiana. \nHackenberg has remained patient through all the sputtering on offense. Patience is something he has exhibited his entire life. \n\"I'm the oldest of four boys,\" he said, \"so patience has been one thing that my parents have preached to me since as long as I can remember. I like to think that I have a pretty big fuse when it comes to that type of stuff.\" \nThe challenges this season have been well documented. Although the offensive line performed better with run blocking against Ohio State, it scuffled mightily in pass protection and prompted coaches to shuffle personnel. The wide receivers continue to have difficulty separating from their defenders, so Hackenberg has gone more to 6-foot-1, 208-pound Chris Godwin to win one-on-one battles with his opponent. \nThe running game will offer more support after freshman Saquon Barkley returned from an injury last week with 194 yards on 26 carries. That might loosen things up for the pass and get Hackenberg's productivity closer to his levels of the last two seasons. \nStill, he'll insist that the stats don't mean anything, but winning does. \n\"I don't worry about any of that,\" he said. \"I'm just worrying about making sure I'm the best teammate I can be, both on and off the field, and making sure I go out and execute the game plans at the highest level that I can. Trying to get wins is what we're all trying to do here and that's my focus.\"", "external_links": [], "published": "2015-10-22T00:40:00.000+03:00", "crawled": "2015-10-22T01:01:07.387+03:00", "highlightTitle": ""}