{"organizations": [], "uuid": "3256ccb6848c48d88ab079fdec7521fd78645551", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.northjersey.com", "main_image": "http://www.northjersey.com/designimages/NorthJerseyFacebook_377x196.jpg", "site_section": "http://www.northjersey.com/cmlink/sports-rss.rss", "section_title": "Sports News on NorthJersey.com", "url": "http://www.northjersey.com/sports/boxing/neumann-at-familiar-haunt-as-supervisor-1.1435426", "country": "US", "title": "Boxing: Gennady Golovkin wins by technical knockout", "performance_score": 0, "site": "northjersey.com", "participants_count": 0, "title_full": "Boxing: Gennady Golovkin wins by technical knockout", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T08:21:00.000+03:00", "replies_count": 0, "uuid": "3256ccb6848c48d88ab079fdec7521fd78645551"}, "author": "", "url": "http://www.northjersey.com/sports/boxing/neumann-at-familiar-haunt-as-supervisor-1.1435426", "ord_in_thread": 0, "title": "Boxing: Gennady Golovkin wins by technical knockout", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Gennady Golovkin"], "text": "Pages: 1 2 > display on one page \nNEW YORK — Gennady Golovkin would’ve preferred a cleaner conclusion Saturday night, but his superiority over David Lemieux was indisputable. \nThe Kazakh knockout artist spent much of seven-plus rounds pummeling the brave but overmatched Lemieux at a sold-out Madison Square Garden crowd of 20,548. With Lemieux wincing in pain from a Golovkin body shot, referee Steve Willis stopped their middleweight championship unification fight at 1:32 of the eighth round. \nGolovkin (34-0, 31 KOs) recorded his 21st straight knockout and made a 15th consecutive defense of the WBA middleweight title he won in August 2010. The 33-year-old Golovkin also defended the interim WBC middleweight championship and took the IBF 160-pound crown Lemieux (34-3, 31 KOs) won by beating France’s Hassan N’Dam via unanimous decision June 20 in Montreal. \nLemieux lost for the first time in 10 fights since Mexico’s Marco Antonio Rubio and Quebec’s Joachim Alcine beat him in back-to-back bouts in 2011. \n\"Dave is a very good fighter,\" said Golovkin, who acknowledged that he felt Lemieux’s power. [He’s] a stronger fighter. I can box him, too. I’m a boxer, too.\" \nGolovkin was ahead by the same score, 70-62, on all three scorecards when the fight was stopped. None of the three judges — Glenn Feldman, Julie Lederman and River Vale’s Steve Weisfeld — credited Lemieux with winning any of the seven completed rounds. \nAccording to unofficial CompuBox statistics, an extremely accurate Golovkin landed 51 percent of his overall punches (280 of 549), including 110 of his 190 attempted power punches (58 percent). CompuBox credited Lemieux with landing 89 of 335 overall punches (27 percent) and 54 of 144 power shots (38 percent). \nLemieux disagreed with Willis’ decision to stop the mostly one-sided fight, yet appeared to look in Willis’ direction after absorbing a punishing left hook to the body. Willis stopped the fight shortly thereafter. \n\"He’s a great fighter,\" Lemieux said. \"I have a lot of respect for him. I’m not too sure [about] the stoppage. … Hopefully in the near future, I’ll get my chance again.\" \nGolovkin won the first three rounds pretty easily, before his left hook hurt Lemieux just past the midway mark of the fourth round. After getting knocked backward, Lemieux bobbed and weaved his way out of more trouble and made it to the end of the round. \nAnother Golovkin left caused Lemieux to take a knee in the fifth round. Golovkin appeared to hit Lemieux with a straight right hand while he was down, but Willis didn’t deduct a point or warn Golovkin. \nThe fighters touched gloves once Lemieux got up, perhaps Golovkin’s way of acknowledging that he fouled Lemieux, who again made it the end of the round. Marc Ramsey, Lemieux’s trainer, entered the ring screaming at Willis once the fifth round ended, though nothing came of his complaint. \nIn the bout before Golovkin defeated Lemieux, emerging flyweight star Roman Gonzalez beat Brian Viloria by ninth-round technical knockout in the co-featured fight, the third of four broadcast by HBO Pay-Per-View. \nNicaragua’s Gonzalez improved to 44-0, recorded the 38th knockout of his 10-year pro career and made the third defense of the WBC 112-pound championship he won 13 months ago. \nViloria, of Waipahu, Hawaii, slipped to 36-5. He lost by knockout for just the second time in his 14-year pro career. \nGonzalez, 28, has assumed the top spot on many mythical pound-for-pound lists since Floyd Mayweather Jr. retired last month. Viloria, however, was the most accomplished opponent Gonzalez has fought. \nViloria, 34, is a former flyweight and light flyweight world champion. He also represented the United States at the 2000 Summer Olympics in Sydney. \nThe valiant Viloria never stopped trying Saturday night and landed his fair share of power shots, but he hadn’t encountered an opponent with the diverse skills, hand speed and power Gonzalez possesses. \n\"Roman is a tremendous fighter,\" Viloria said. \"I have nothing but respect for him. I had prepared for a different Roman and he surprised me with his defense and his speed. I do feel like the fight was stopped prematurely. I feel good and [could’ve kept] going.\" \nGonzalez dropped Viloria with a short right hand about 35 seconds into the third round, which marked the first knockdown of Viloria’s pro and amateur career. Viloria quickly reached his feet, but Gonzalez drilled Viloria with numerous left hooks to the body and head during the remainder of the round. \nViloria seemed to get the aggressive Gonzalez’s attention with a right hand early in the fourth round. The punch temporarily slowed Gonzalez’s attack, but it didn’t take him long to resume his consistent assault on Viloria’s head and body.  ", "external_links": [], "published": "2015-10-18T08:21:00.000+03:00", "crawled": "2015-10-18T15:14:27.892+03:00", "highlightTitle": ""}