{"organizations": [], "uuid": "389f1fe936027bac854a1dbd84e169269aeed1e1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wgem.com", "main_image": "http://WGEM.images.worldnow.com/images/9079536_G.jpg", "site_section": "http://www.wgem.com/category/123718/sports?&clienttype=rss", "section_title": "WGEM - SPORTS", "url": "http://www.wgem.com/story/30331327/2015/10/22/turning-back-the-clock-1985-qhs-vs-qnd-football-part-ii", "country": "US", "title": "Turning Back the Clock: 1985 QHS vs. QND football (Part II)", "performance_score": 0, "site": "wgem.com", "participants_count": 1, "title_full": "Turning Back the Clock: 1985 QHS vs. QND football (Part II)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T05:55:00.000+03:00", "replies_count": 0, "uuid": "389f1fe936027bac854a1dbd84e169269aeed1e1"}, "author": "Ben Marth", "url": "http://www.wgem.com/story/30331327/2015/10/22/turning-back-the-clock-1985-qhs-vs-qnd-football-part-ii", "ord_in_thread": 0, "title": "Turning Back the Clock: 1985 QHS vs. QND football (Part II)", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Turning Back the Clock: 1985 QHS vs. QND football (Part II) - WGEM.com: Quincy News, Weather, Sports, and Radio Member Center: Turning Back the Clock: 1985 QHS vs. QND football (Part II) Posted: bmarth@wgem.com The last time QHS and QND met on the gridiron the Blue Devils were 34-0 winners and snapped a 27-game losing skid. \nQUINCY, Ill. (WGEM) -- When QHS and QND squared off on opening night of the 1985 season the thought of another loss was far from the minds of the Blue Devils.\"I'll be honest with you...Notre Dame did not have a chance,\" former QHS offensive lineman John Schild exclaimed.\"That game was over before it began because we were so focused. We ended our practices with 'Beat Notre Dame.'Powered by junior quarterback Eric Bush, who accounted for 160 yards of offense, Quincy High went on to blank QND 34-0 putting an end to a 27-game losing streak.\"We had a pretty good group. We had a big senior class. I think we had 25 seniors that year (and) we had a great junior class behind us,\" Schild added.\"It was a case of we're going to start off right and we're going to end this streak.\"The victory kick-started a winning season for the Blue Devils and sent the Raiders in a tailspin.They didn't win a game in 1985.\"That summer we got a new coach. Coach (Dean) Cappel came in and kind of brought in a different mindset,\" former QHS defensive end Jeff Rupert noted.\"Notre Dame happened to be the first game of the year, so we were fired up. We knew we were going to come out swinging.\"30 years since the last meeting the crosstown showdown returns on Friday night.It's a two-year deal and the future of the series following next fall's contest remains in doubt.The former players suggest to the current players to cherish every moment.\"These are memories that are going to last a lifetime,\" Rupert said.\"I know we're all from Quincy (and) like a big family, and the kids all know each other, but it's like when you play your brother. You still want to win.\"Rupert feels now is better than ever to renew the rivalry.\"I think with both schools being at the height of their programs it's a great fit for Quincy and a great fit for the schools.\" Can't Find Something? 513 Hampshire Quincy, IL 62301 Switchboard: (217) 228-6600", "external_links": [], "published": "2015-10-23T05:55:00.000+03:00", "crawled": "2015-10-23T10:07:08.177+03:00", "highlightTitle": ""}