{"organizations": [], "uuid": "fb4072c6e73cd7d3ce36d3d4ae6cb63e816fb262", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcsandiego.com", "main_image": "http://media.nbcsandiego.com/images/1200*884/GettyImages-491343560.jpg", "site_section": "http://www.nbcsandiego.com/news/sports/?rss=y&embedThumb=y&summary=y", "section_title": "NBC 7 San Diego - San Diego Sports News, Photos, and Scores for the Padres, Chargers and More", "url": "http://www.nbcsandiego.com/news/sports/Chargers-See-Injuries-as-Opportunities-330789202.html", "country": "US", "title": "Chargers See Injuries as Opportunities", "performance_score": 0, "site": "nbcsandiego.com", "participants_count": 1, "title_full": "Chargers See Injuries as Opportunities", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T03:39:00.000+03:00", "replies_count": 0, "uuid": "fb4072c6e73cd7d3ce36d3d4ae6cb63e816fb262"}, "author": "DEREK TOGERSON", "url": "http://www.nbcsandiego.com/news/sports/Chargers-See-Injuries-as-Opportunities-330789202.html", "ord_in_thread": 0, "title": "Chargers See Injuries as Opportunities", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Get the latest Chargers news, scores, game photos, highlights, rumors and roster information Chargers See Injuries as Opportunities Moving players around starts in training camp Privacy Policy | More Newsletters At one point during the 4th quarter of the Chargers’ 30-27 win over the Browns on Sunday at Qualcomm Stadium the Bolts had two healthy wide receivers and two healthy cornerbacks available. They also had two healthy kickers available (Mike Scifres can and has kicked field goals) so that’s not exactly the kind of roster construction that lends itself to winning many games. Yet San Diego still pulled out a win because they were had just enough fingers to plug the dam. Sure, they had to dislocate a few fingers to make it happen, but believe it or not the constant changes did not take the Bolts by surprise. That’s what happens when you have a human Swiss Army Knife on your team. Running back Danny Woodhead got more than his share of snaps as a slot receiver after both Malcom Floyd and Stevie Johnson went down with injuries. Woodhead has played a bit in the slot before but even if he hadn’t the man would know exactly how to handle it. “It’s something I try to know anyway: what everyone is doing on the offense,” said Woodhead. “I like to make sure I’m ready, whatever may happen. Just know the concepts, know what the plays are and if we ever needed a situation like yesterday I’d be ready. That’s how we all approach it. We’re just trying to make sure we’re ready for the opportunity we’re given.” Tight end John Phillips took advantage of his opportunity. He was released after the preseason but signed on again after the injuries started piling up. Phillips also found himself in the slot on more than one occasion and even caught a touchdown pass from quarterback Philip Rivers. “We’re interchangeable,” said Phillips. “Phil can call any play at the line of scrimmage so you never know where you’re going to be lined up. You really just have to know all the positions. We just kind of threw guys out there and just kind of rolled with it.” Like Woodhead, Phillips knew what to do because of an interesting technique the Chargers coaching staff uses in training camp. They’ll go through the playbook with formations intact, but different players in different roles. “You put guys in a lot of situations,” said Phillips. “You say, hey, we’re going to play three tight ends and run all of our plays, or all receivers, or running backs. That’s just kind of the way our offense is built. You have to know what everybody does because we can go to any play at any time.” Rivers is not shy about checking to a play he thinks will work against what the defense is doing, regardless of who’s on the field. His grasp and comprehension of the playbook is almost encyclopedic … just like Woodhead. So if the unthinkable happened and the Chargers lost all their quarterbacks one Sunday, would Danny be in calling those audibles under center? “Let’s be honest,” said Woodhead. “In 5th and 6th grade I was a quarterback and we were pretty solid. It was also just the city of North Platte, NE, so I don’t know if I trust my quarterbacking that much.” But if it came down to it, I think the rest of us would trust him to pull it off. Published 13 minutes ago", "external_links": [], "published": "2015-10-06T03:39:00.000+03:00", "crawled": "2015-10-06T04:09:08.230+03:00", "highlightTitle": ""}