{"organizations": [], "uuid": "f26fc378edf508054a9aea9a031ed03de81913a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.baltimoresun.com", "main_image": "http://www.trbimg.com/img-56242549/turbine/la-sp-college-football-dufresne-20151019", "site_section": "http://www.baltimoresun.com/sports/rss2.0.xml", "section_title": "Sports - Baltimore Sun", "url": "http://www.baltimoresun.com/sports/la-sp-college-football-dufresne-20151019-column.html", "country": "US", "title": "There's losing all around in college football over the weekend", "performance_score": 0, "site": "baltimoresun.com", "participants_count": 1, "title_full": "There's losing all around in college football over the weekend", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T02:50:00.000+03:00", "replies_count": 0, "uuid": "f26fc378edf508054a9aea9a031ed03de81913a3"}, "author": "Chris Dufresne", "url": "http://www.baltimoresun.com/sports/la-sp-college-football-dufresne-20151019-column.html", "ord_in_thread": 0, "title": "There's losing all around in college football over the weekend", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "var ssaUrl = ('https:' == document.location.protocol ? 'https://' : 'http://') + 'pixel.sitescout.com/iap/0ea84626951144d2';new Image().src = ssaUrl;\"/> College Football There's losing all around in college football over the weekend Jim Harbaugh Christian Petersen / Getty Images \nMichigan Head coach Jim Harbaugh reacts on the sidlines during the second quarter of a game against Michigan State on Saturday. \nMichigan Head coach Jim Harbaugh reacts on the sidlines during the second quarter of a game against Michigan State on Saturday. (Christian Petersen / Getty Images) \nLost games, lost minds, lost opportunities, lost Twitter purpose and the vanquished simply lost for words. \nCall it the Lost Weekend. \nSeven teams in the Associated Press top 25 got dumped at the prom: No. 8 Florida, No. 9 Texas A&M, No. 12 Michigan, No. 13 Mississippi, No. 18 UCLA, No. 20 Northwestern and No. 21 Boise State. \nThe top teams, like eggnog, have started separating in the middle. \nOhio State survived some early-schedule body blow but looks like No.1 again after Saturday's wipeout victory against Penn State. \nOr, maybe it's Baylor. Any ESPN special on the Bears should be titled \"60 for 60.\" That's how many points per game they are averaging (actually 63.8). \nThe shame is we won't know how good Baylor really is until it actually plays someone in November. \nAlabama looks like the Crimson City Rollers again after knocking the haggis out of Texas A&M. \nThe Alabama offense led by offensive coordinator Lane Kiffin has assisted in consecutive victories over Texas A&M by the combined score of 100-23. \nKiffin is the despised former USC coach who was let go for general incompetency. \nTexas A&M is led by Kevin Sumlin, the coach many think should be the Trojans' next coach. \nKiffin actually may earn one more crack at USC (University of South Carolina). \nLouisiana State, which seems to play every week at home or against Western Kentucky, is the last undefeated team standing in the Southeastern Conference. \nUtah is also refusing to vacate premises, Clemson apparently can't just be wished away and Texas Christian has no defense but has vowed to become \"Baylor-esqe\" in its quest for offensive output. \nThe real story of the weekend, though, is the continuing downward spiral of humanity. \nTwitter is holding steady as the best/worst thing to ever happen — and just triple hat for college football! — but it is also a faceless wrecking ball. \nThe overwhelmingly positive things typed are shouted down by the anonymous, exclamation-point minority. \nNo person should have to endure what Michigan punter Blake O'Neill faced after he botched the end of the craziest football ending since Iron Bowl 2013. \nWith 10 seconds to play, Michigan needed to execute a simple catch and punt to defeat Michigan State in Ann Arbor. \nO'Neill dropped the ball, though, then mistakenly tried to kick it anyway, only to watch Jalen Watts-Jackson race 38 yards for the game-winning touchdown. \nThat must have hurt like 100 bee stings. \nCoach Jim Harbaugh tried to keep the end of the world in perspective, channeling Churchill as he vowed this horrible event would \"put steel in the spine.\" \nThe worst was yet to come, though, as some on social media took to attacking O'Neill, who averaged 44 yards, including an 80-yard punt, on the seven punts he got off. \nThere was plenty of support for O'Neill, a 22-year-old senior from Australia. \nThere was this: \n•\"Kill yourself you just cost us the game …\" \n•\"I hate you please transfer.\" \n•\"Go back to Australia.\" \n•\"Don't go to school on Monday.\" \nThere have always been wackos in society, we just never had this much instant access to them. \nJim Hackett, Michigan's interim athletic director, released a statement Sunday deploring the behavior of the few for their \"hurtful, spiteful and vicious comments to one of our students.\" \nHackett continued: \"I'm asking that our community not lose this game twice by condoning thoughtless comments …\" \nIt was nice someone invented an \"internet\" so that Hackett could so quickly convey the counter-punch. \nSee how this cuts both ways? \nTo a lesser extent, fans and trolls hammering USC's besieged program paused briefly when Athletic Director Pat Haden took ill on the field before Saturday's game at Notre Dame. \nOnly after it became clear that Haden would survive did someone tweet: \"He needs to step down.\" \nHaden did go down, actually, to one knee, on the artificial turf. \nOne question before Haden is run out of town: Would it be OK if he got checked out at the hospital? \nThere is, fortunately and unfortunately, no way of containing a beast that allows Steve Sarkisian to send best wishes from a rehab facility. \nSadly, the same people who cut you off in traffic also have free time and monthly wireless plans. \nIt's too bad Twitter can't offer a 20-second delay option to give people the chance to reconsider the first thing that pops in their head. \nA lot of this is just \"old journalism\" talking. \nTruth be told, hours of fun can be had watching a Trojan's mind work during an exciting game against Notre Dame. \nThe composite version goes something like this: \n\"Touchdown … ! Haha Domers! ... FireWilcox! ... We're down 21-10 but should be 35-10! ... Worse D-E-F-E-N-S-E since Grenada in 1982 … Get Well Pat! ... Fire Haden! ... Adoree Jackson has lost a step!!! ... Wow, is that Adoree fast! ... Run JuJu run! ... Tied at 24! ... Defense giving us a chance! … Full name of mural: Touchdown JesUSChrist! ... We're losing???! ... Horrible throw Cody! ... FireWilcox! ... Fact: we are 3-3 with losses to three teams once coached by Tyrone Willingham! ... Will sell one of my Beamers to pay for Nick Saban! ... \" \nPostscript: Watts-Jackson, the Michigan State hero who scored one of the most fantastic touchdowns in college football history, spent Sunday in the hospital. \nHe broke his hip in the postgame celebration at Ann Arbor. Sometimes winning can hurt as much as losing. \nSurgery will keep him on crutches for three months. Sure hope he tweets out some positive thoughts real soon. \nThe world really would like to know, so it can respond in kind (and unkind). \nBut here's the bottom-of-the-pile line: Watts-Jackson, like a lot of teams, players, coaches and fans, is lost for the season.", "external_links": [], "published": "2015-10-19T02:50:00.000+03:00", "crawled": "2015-10-21T07:44:59.901+03:00", "highlightTitle": ""}