{"organizations": ["Manchester United", "Arsenal"], "uuid": "b3b8d604ef287f8d04434cab0fbc98d48743f685", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/6944e952d6a203beb0c90db4fe2deae0.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/football/arsenals-francis-coquelin-win-over-manchester-united-shows/6893363/", "country": "JE", "title": "Arsenal's Francis Coquelin: Win over Manchester United shows we're contenders", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "Arsenal's Francis Coquelin: Win over Manchester United shows we're contenders", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T15:01:00.000+03:00", "replies_count": 0, "uuid": "b3b8d604ef287f8d04434cab0fbc98d48743f685"}, "author": "", "url": "http://www.sport.co.uk/football/arsenals-francis-coquelin-win-over-manchester-united-shows/6893363/", "ord_in_thread": 0, "title": "Arsenal's Francis Coquelin: Win over Manchester United shows we're contenders", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Francis Coquelin"], "text": "Arsenal's Francis Coquelin: Win over Manchester United shows we're contenders 05 Oct 2015 12:01:52 \ncomments \nMidfielder Francis Coquelin feels the impressive 3-0 win over Manchester United shows Arsenal were right to believe they are genuine contenders for the Barclays Premier League title. \nThe Gunners blew the Red Devils away with a blistering start which saw them 3-0 up at the Emirates Stadium inside 20 minutes, their opening two goals coming within 74 seconds of each other. \nIt was the perfect response following questions over the direction of Arsene Wenger's side in the wake of a home Champions League defeat by Olympiacos. \nThe players held a private meeting before the match against United, who had gone into the encounter looking to reinstate themselves at the top of the table but ended the weekend down in third place. \nCoquelin reckons the collective efforts shown in sweeping aside Louis van Gaal's team displayed the needed character to mount a sustained assault on the championship. \n\"We knew we had to put it right after Olympiacos and that is what we have done. A lot of people didn't expect us to win, but we proved a lot of people wrong,\" said the Frenchman, who has now become an integral member of the team, protecting the back four. \n\"Inside the dressing room we knew we could do good things this season, that we knew we could be contenders. But obviously we have to be consistent. \n\"The most important thing is to carry on now and keep getting the results.\" \nCoquelin continued: \"We are getting stronger against the big teams. \n\"We beat (Manchester) City last season, now United. It's all about consistency. \n\"The league is getting tougher because even the smaller teams are beating the bigger teams, so we need to be getting results every week.\" \nWhile Theo Walcott did not get on the scoresheet against United, it was another eye-catching performance from the England forward, who has been leading the line ahead of Olivier Giroud in recent matches. \nCoquelin said: \"It was not only offensively (his best game) - what he did defensively was absolutely amazing too. \n\"He was chasing the ball, which makes things easier for us at the back. \n\"When he is in this kind of mood he is not far off being unstoppable, and he [has shown] everyone he can play in this role up front.\" \nWenger had seen his own position come under scrutiny following the debacle against Olympiacos, where stand-in goalkeeper David Ospina dropped a corner over the line during the 3-2 loss as Arsenal conceded a third goal moments after drawing level. \nThe French coach remained convinced his side would produce the required response on Sunday, and now head into the international break just two points behind leaders City, ahead of United on goal difference. \n\"You go through disappointments in the season and the way we responded was very convincing. I like this group and I like even more the performance we have shown,\" Wenger said to Arsenal Player. \n\"Overall, that is what it is all about and shows that this group of players is very strong and united.\" Related Sport News", "external_links": [], "published": "2015-10-05T15:01:00.000+03:00", "crawled": "2015-10-05T18:50:01.999+03:00", "highlightTitle": ""}