{"organizations": [], "uuid": "a69e8e878c12955c5122d3361bbdc3ae7a18cc39", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.miamiherald.com", "main_image": "http://www.miamiherald.com/news/local/crime/tcaofy/picture38134503/ALTERNATES/LANDSCAPE_1140/10-09-Fentanyl-A", "site_section": "http://www.miamiherald.com/?widgetName=rssfeed&widgetContentId=712015&getXmlFeed=true", "section_title": "Breaking News, Sports, Weather & More | MiamiHerald.com &", "url": "http://www.miamiherald.com/news/local/crime/article38134512.html", "country": "US", "title": "Feds bust suspected South Florida fentantyl importer as deaths soar", "performance_score": 0, "site": "miamiherald.com", "participants_count": 1, "title_full": "Feds bust suspected South Florida fentantyl importer as deaths soar", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T02:11:00.000+03:00", "replies_count": 0, "uuid": "a69e8e878c12955c5122d3361bbdc3ae7a18cc39"}, "author": "David Ovalle and Jay Weaver \ndovalle@miamiherald.com", "url": "http://www.miamiherald.com/news/local/crime/article38134512.html", "ord_in_thread": 0, "title": "Feds bust suspected South Florida fentantyl importer as deaths soar", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Feds bust suspected South Florida fentantyl importer as deaths soar \nOverdoses of the potent ‘synthetic heroin’ have soared \nAgents say Miramar man imported the drugs via the Internet Aldolphe Joseph Miami-Dade Corrections Order Reprint of this Story \nFederal agents have busted a Miramar man they say was part of an international ring that used the Internet and U.S. mail to import a so-called synthetic heroin called fentanyl that is sweeping Florida and killing hundreds of users. \nThe arrest of Aldolphe Joseph, 34, comes as law enforcement agencies are working to stem the pipeline of synthetic drugs from China, which has helped fueled a spike in fentanyl-related deaths. Newly released statistics from the Florida Department of Law Enforcement show deaths caused by fentanyl overdoses statewide last year jumped a staggering 114 percent. \nFrom Molly to flakka to fentanyl, the wave of synthetic drugs from overseas has become a top priority for South Florida law enforcement and public health officials , as chronicled in the recent Miami Herald series Pipeline China. The ease of ordering drugs from Chinese websites has created a new breed of drug dealers that use U.S. mail services to deliver the cheaply made chemicals. \nWith users going on violent rampages in public, flakka has garnered the most national media attention, with the drug showing up in the blood of over 50 dead people in Broward County over the past year. But the chemical alone caused only one overdose death in Broward. Other users, died from taking a lethal mixture of flakka and assorted other drugs. \nFentantyl and its chemical variants, which are often laced into heroin, have been much more lethal. The fast-acting painkiller has been used as a surgical analgesic for decades, but in the last few years synthetically made versions of the drug exported from China and other countries have made their way to street. \n“Fentanyl is much deadlier than flakka,” said Raynette Savoy Kornickey, spokeswoman for the U.S. Drug Enforcement Administration in South Florida. “It's 50 times stronger than (pure) heroin and 80 times stronger than morphine. A minute amount will kill you. It is being mixed with heroin, flakka and other drugs and no one knows what they are taking. It's scary.” \nIt is being mixed with heroin, flakka and other drugs and no one knows what they are taking. It's scary. \nRaynette Savoy Kornickey, DEA spokeswoman \nThe fentanyl spike, along with a similar increase in heroin-related deaths, also coincides with a crackdown on Florida’s notorious “pill mill” clinics, which illegally doled out prescription painkillers. The FDLE report, which compiled 2014 statistics from medical examiners across the state, showed deaths related to oxycodone — one of the most popular painkillers — have steadily decreased. \nLaw enforcement officers believe many users have switched to heroin and unwittingly taken fentanyl or closely-related cousins. This year alone, fentanyl and its variants have outright caused or contributed to 53 deaths in Miami-Dade – more than double the toll in 2014. \n“The rate of growth is alarming,” said Liz Zaney, a toxicologist at the Miami-Dade Medical Examiner’s Office. \nMiami police homicide detectives also believe fentanyl and heroin may be to blame for 13 overdose deaths in the past couple months, with some addicts dropping dead in public bathrooms across the city. Toxicology reports are pending in those deaths. \n“The assumption is that this series of deaths may be the result of a bad batch of the drugs,” said Miami Police Maj. Delrish Moss. “We need help from entire community to help stem this. We have an obligation to warn people of these dangers. While we are working to get a grip on the situation, we cannot do it alone.” \nThe FDLE reported documented a surge of fentanyl-related deaths in Florida last year _ 538 compared to 292 in 2013. Miami-Dade, Broward and Palm Beach counties recorded 162, almost a third of the statewide total number in 2014. Medical examiners also recorded 447 heroin-related deaths in 2014, up from 199 the previous year. \nOther areas seeing sharp increases include Orlando, Sarasota and St. Petersburg. \nJoseph’s is believed to be the first suspect in South Florida to be accused of importing fentanyl from overseas through the mail. \nThe DEA’s investigation began in January when an 18-year-old man died of an overdose after smoking fentanyl in Grand Forks, North Dakota. That led agents to a man who admitted to buying the drug on an encrypted “Dark Web” Internet site called Evolution, which was believed to be a top supplier of narcotics before it mysteriously shut down in March. \nThe North Dakota dealer, according to a federal criminal complaint, used virtual money known as Bitcoin, the “preferred form of currency used for the online dark net purchases of contraband.” \nThe investigation then led to an Oregon man also receiving drugs in the mail, then reselling them through the mail across the country. The business was lucrative — 750 grams of fentanyl was worth $1.5 million on the street, the dealer told agents. \nHe got the drugs from a source in Canada, who had producers in China ship him fentanyl, according to the complaint. The Canadian source, prosecutors believe, was a Colombian national named Daniel Ceron – who ran his sophisticated business using a contraband cell phone while serving time in a Canadian prison outside Montreal. \nThe feds indicted Ceron and his ring in July. He was arrested in Panama, while on a layover to be deported after finishing his drug-trafficking and attempted murder sentence in Canada. \nCeron’s tentacles, agents believe, stretched to South Florida. A local DEA agent, posing as an undercover buyer, ordered nearly 400 tablets labeled Oxycodone from Ceron. They were actually a variant of fentantyl. \nInside Ceron’s prison cell, investigators found a phone and a ledger with Joseph’s name and the address of a Pembroke Pines private mail facility. Below the notation, agents found six tracking numbers for mail packages that had been sent from Canada. \nJoseph had been exchanging e-mails and buying pills from the inmate’s ring, according to a criminal complaint. One package seized by agents intended for Joseph contained 1,494 grams of fentantyl, potentially worth millions on the street. \nAccording to a criminal complaint, DEA Agent Michael Buemi created an account with a private messaging app, and began posing as Ceron. Joseph sent him nearly $3,000 in Bitcoin payments for one kilogram of “acetyl fentantyl” – to be shipped to a woman in Maine. \nJoseph, arrested Sept. 24 in Miami Gardens, was charged with importation and distribution of fentanyl. Officers believe that while driving his silver Mercedes, he was involved in a shooting with an unknown person in another car. He was also arrested on a state charge of possession of a firearm by a convicted felon. \nHe remains in federal custody. His attorney declined comment. \nAccording to state statistics, these are the top drugs that killed people in Florida in 2014: \n1) Benzodiazepines (1175)", "external_links": [], "published": "2015-10-08T02:11:00.000+03:00", "crawled": "2015-10-08T03:44:22.830+03:00", "highlightTitle": ""}