{"organizations": [], "uuid": "d982c771182ac7106db692a2cacc3e6b1bafef6e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deccanchronicle.com", "main_image": "http://www.deccanchronicle.com/sites/default/files/Sho.jpg", "site_section": "http://www.deccanchronicle.com/sports", "section_title": "Sports | Deccan Chronicle", "url": "http://www.deccanchronicle.com/151013/sports-cricket/article/%E2%80%98after-watching-sania-mirza-win-titles-i-was-inspired-do-well%E2%80%99", "country": "US", "title": "‘After watching Sania Mirza win titles, I was inspired to do well’", "performance_score": 0, "site": "deccanchronicle.com", "participants_count": 1, "title_full": "‘After watching Sania Mirza win titles, I was inspired to do well’", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T11:36:00.000+03:00", "replies_count": 0, "uuid": "d982c771182ac7106db692a2cacc3e6b1bafef6e"}, "author": "PTI", "url": "http://www.deccanchronicle.com/151013/sports-cricket/article/%E2%80%98after-watching-sania-mirza-win-titles-i-was-inspired-do-well%E2%80%99", "ord_in_thread": 0, "title": "‘After watching Sania Mirza win titles, I was inspired to do well’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PTI | October 13, 2015, 21.30 pm IST Hitting a patient century on Test comeback, former Pakistan captain Shoaib Malik on Tuesday credited his wife Sania Mirza for his success in international cricket since his recall to the national side this year. (Photo: AP) Karachi : Hitting a patient century on Test comeback, former Pakistan captain Shoaib Malik on Tuesday credited his wife Sania Mirza for his success in international cricket since his recall to the national side this year.\nMaking his first Test appearance since August 2010, Malik remained unbeaten on 124 at the end of the opening day's play in the first match against England in Abu Dhabi. The century was a continuation of the success Malik has enjoyed since being recalled to the national T20 and than ODI squads this year.\nWatch: For Shoaib Malik, Sania Mirza 'Abhi Toh Party Shuru Hui Hai'\n\"I think there was pressure on me to also perform as a professional sportsman after Sania's outstanding success in recent times on the tennis court,\" Malik said.\n\"We speak to each other every day and now I have become used to congratulating her on her titles and she on my success,\" Malik said.\nThe all-rounder, who came into bat at the crucial number three position on Monday, said he had learnt a lot from his tennis star wife.\n\"Sania has proved to be a inspiration for me in many ways even as a sportsman. After watching her win titles even after battling with fitness issues I was also inspired to match her feats as a professional sportsman,\" Malik added.\n‘Sania Mirza gives me the required cushion at a sportsman’s level’\n\"It is a healthy competition between husband and wife who are professional athletes. I credit my wife for my change in approach to training and my recent success and new international career,\" he said.\nThe former Pakistan captain said having a wife who is also an athlete made it easier for him to discuss sports related issues with her and seek advice.\nMalik said it was a gratifying feeling to score a century on his Test comeback.\nYounis Khan eclipses Javed Miandad’s record, becomes Pakistan's top run-getter\n\"Even when I was dropped from the test squad I didn't give up hope and I focussed on the other formats and first class cricket and foreign leagues and I think all that prepared me for my Test comeback,\" he said.\nMalik was fortunate to get a call up for the first test since Pakistan's regular number three batsman Azhar Ali was ruled out of the test with a toe infection while leg spinner Yasir Shah also got injured during training a day before the test on Monday.\nMalik admitted that he had steeled himself physically and mentally to make the most of his opportunities that now come his way.\n\"I am training harder now and I focus more. Playing a Test match after such a long time is never easy for anyone. But the rewards are worth this pressure,\" he added.\n Cricket Shoaib Malik Sania Mirza Younis Khan Pakistan vs England Also Read Younis Khan eclipses Javed Miandad’s record, becomes Pakistan's top run-getter Younis Khan fumes at PCB, claims not invited for PSL launch Younis Khan leads Pakistan recovery with century 'Junior Malik soon, Inshallah,' says Shoaib Malik", "external_links": ["http://platform.twitter.com/widgets.js", "http://dd508hmafkqws.cloudfront.net/sites/default/files/styles/article_node_view/public/Sho.jpg", "http://static.ak.fbcdn.net/connect.php/js/FB.Share", "http://campaign.bharatmatrimony.com/track/clicktrack.php?trackid=00100326114361", "http://twitter.com/share?url=http://www.deccanchronicle.com/151013/sports-cricket/article/‘after-watching-sania-mirza-win-titles-i-was-inspired-do-well’", "https://apis.google.com/js/plusone.js", "http://dd508hmafkqws.cloudfront.net/sites/default/files/Sho.jpg", "http://www.facebook.com/sharer.php", "http://vuukle.com/js/vuukle.js", "http://dd508hmafkqws.cloudfront.net/sites/default/files/BharatMatrimony_texlink_banner_620x40px.gif"], "published": "2015-10-14T11:36:00.000+03:00", "crawled": "2015-10-14T01:12:43.829+03:00", "highlightTitle": ""}