{"organizations": [], "uuid": "2cf6c15e6532c9cd1527a72fc7174ab3102e4dc8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.enterprisepub.com", "main_image": "http://bloximages.newyork1.vip.townnews.com/enterprisepub.com/content/tncms/assets/v3/editorial/4/14/41442590-747d-11e5-b592-6b53ea5f88ae/5621bd4b0705e.image.jpg?resize=620%2C598", "site_section": "http://www.enterprisepub.com//search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&c[]=sports,sports/*&f=rss", "section_title": "www.enterprisepub.com - RSS Results in sports,sports/* of type article", "url": "http://www.enterprisepub.com/sports/mistakes-mount-for-bears-in-loss-to-bennington/article_25d9c04e-747d-11e5-9dce-9f77adab599e.html", "country": "US", "title": "Mistakes mount for Bears in loss to Bennington", "performance_score": 0, "site": "enterprisepub.com", "participants_count": 1, "title_full": "Mistakes mount for Bears in loss to Bennington", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T06:14:00.000+03:00", "replies_count": 0, "uuid": "2cf6c15e6532c9cd1527a72fc7174ab3102e4dc8"}, "author": "Tyler Dahlgren", "url": "http://www.enterprisepub.com/sports/mistakes-mount-for-bears-in-loss-to-bennington/article_25d9c04e-747d-11e5-9dce-9f77adab599e.html", "ord_in_thread": 0, "title": "Mistakes mount for Bears in loss to Bennington", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Junior tight end Mills Macek bulls over two Badgers on a third quarter first down catch. Mistakes mount for Bears in loss to Bennington Tyler Dahlgren Buy Now Tyler Dahlgren \nEthan Cox takes his first carry since the opener against Elkhorn for a 40 yard touchdown in the Bears' 28-14 loss to Bennington on Friday night. Tyler Dahlgren \nJunior tight end Mills Macek bulls over two Badgers on a third quarter first down catch. \nEach time Blair would put itself in a position to make a run in Friday night's game at Bennington, something untimely, and, for the Bears, unfortunate, would unfold and spoil any semblance of momentum they had going. \nIn the end, the mistakes were insurmountable, and a 28-14 loss was the final product. A loss that is going to be tough to swallow, especially if the Badgers take care of Schuyler next week and clinch District B-3's bid to the state playoffs. \nTough to swallow because the Bears out-gained the Badgers 368 to 289 despite running nine fewer plays. \nTurnovers turned directly into 14 Bennington points, including a monumental turn of the tide just before halftime, when Jacob Wageman intercepted an Ethan Cox pass and took it to the Bears' 13. On third and 10 moments later, a busted Blair coverage resulted in an easy pitch and catch score for the Badgers, making it 21-7 heading into the break instead of 14-14 or 14-10. \nCox, playing his first game since the opener against Elkhorn, busted a 40-yard touchdown run on his first carry of the game to tie things up at 7-7 after Bennington found the end zone on their opening drive. \nBlair seemed to have momentum after forcing a three-and-out, but Bennington safety Ethan Preissler intercepted a pass early in the second quarter and raced to the Blair seven. Running back Cody Liske scored on the next play, giving Bennington a sudden 14-7 advantage. \nBlair received the ball to start the second half and struck right away when Cox floated an over-the-should fade rout into the arms of junior Jacob Sorensen, who broke a tackle and raced 66 yards for a touchdown. 21-14. The Bears were back in it. \nBennington proceeded to march the ball right down the field. Quarterback Ben Bohn bullied his way in from two yards out to put the Badgers back up by two scores at 28-14. \nAfter Blair turned the ball over on downs, another player back from an injury made a big impact. Senior safety Alex Wing knocked a third down pass down in the end zone and stuffed Liske on fourth and two. \nCox then found senior wide receiver Zach Dahlgren on a swing pass. Dahlgren broke loose down the sideline, gaining 43 yards before he was pushed out of bounds. Cox went back to Dahlgren on the next play for 14 more yards and Dalton Lewis carried to the one as time ran out in the third quarter. \nThe early minutes of the fourth quarter may have ultimately sealed Blair's fate, as Bennington mounted a goal line stand and then picked up several first downs to chew precious minutes off the clock. \nBlair traveled down the field late after getting the ball back as Cox found Dahlgren for a 34-yard gain. Time ran out on Blair, however, as did their inside track to the playoffs. \nCox finished the night 11-28 for 223 yards and a touchdown. Dahlgren hauled in five passes for a game-high 109 yards while Sorensen had four catches for 95 yards. Macek had one catch for 18 yards. \nDylan Rahlfs carried the ball nine times for 52 yards. Cox added 52 yards on the ground, while Lewis gained 36 on eight totes. \nThe Bears will wrap up the regular season next Friday when Mount Michael comes to town. ×", "external_links": [], "published": "2015-10-17T06:14:00.000+03:00", "crawled": "2015-10-17T07:57:25.257+03:00", "highlightTitle": ""}