{"organizations": [], "uuid": "09fc56858f54fac2e3d1c7b00c6216d062d842b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.completesportsnigeria.com", "main_image": "http://www.completesportsnigeria.com/wp-content/uploads/2015/10/troost1.png", "site_section": "http://www.completesportsnigeria.com/feed/", "section_title": "Complete Sports Nigeria", "url": "http://www.completesportsnigeria.com/how-super-eagles-rated-versus-cameroon/", "country": "US", "title": "How Super Eagles Rated Versus Cameroon", "performance_score": 0, "site": "completesportsnigeria.com", "participants_count": 1, "title_full": "How Super Eagles Rated Versus Cameroon", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T00:50:00.000+03:00", "replies_count": 0, "uuid": "09fc56858f54fac2e3d1c7b00c6216d062d842b2"}, "author": "Prince Imehiron", "url": "http://www.completesportsnigeria.com/how-super-eagles-rated-versus-cameroon/", "ord_in_thread": 0, "title": "How Super Eagles Rated Versus Cameroon", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Headlines / How Super Eagles Rated Versus Cameroon How Super Eagles Rated Versus Cameroon \nCompletesportsnogeria.com's JAMES AGBEREBI rates the Super Eagles' performances individually after their superb 3-0 win over Cameroon on Sunday… \nCARL IKEME Missed a back pass from Efe Ambrose but was lucky it didn't end in the back of the net. Made his first real save on 56 minutes when he tipped a deflected shot for a corner. (6/10) \nSHEHU ABDULLAHI Didn't do much going forward and the few times he ventured forward he was caught out of position. Improved in the second half but needs to work on his delivery. (5) \nLEON BALOGUN Did very well in central defence as he was neat and strong in his tackles, and also solid in the air. Came off in the final minutes of the game (7) \nEFE AMBROSE Made up for his first half error by scoring the first goal off a header. And like his defensive partner, gave a solid performance. (7) \nELDERSON ECHIEJILE Delivered a fine cross which led to the third goal. Aside from his assist, didn't do much going forward (6) \nOGENYI ONAZI Kept things easy and tidy. Solid and timely in his tackles. (6) \nMIKEL OBI Delivered a well-taken free-kick which resulted in the first goal for Nigeria. Oozed class throughout the time he spent on the field. (8) \nSYLVESTER IGBOUN Troubled the Cameroonian defence with his relentless runs and almost got on the score sheet on two occasions but for the Cameroonian keeper. Didn't offer much in the second half and was later substituted. (6) \nMOSES SIMON Scored the second goal after beating his marker. Laid a nice pass which Emenike failed to connect with. Got involved more in the second half after a disappointing first half. (7) \nEMMANUEL EMENIKE Disappointing performance, dwelled on the ball too long, clumsy in possession. Shot straight at the keeper when put through on goal, couldn't connect with a pass from Simon. Came off in the second half. (5) \nAHMED MUSA Floated a long-range pass which was expertly converted by Simon. Didn't really get a sniff of goal but still did reasonably well before he was substituted. (6) \nSUBS: \nReplaced Mikel Obi in the second half but didn't offer much. (5) \nRabiu Ibrahim Came on for Igboun but still lacks maturity in his play as he tends to play to the gallery and unnecessarily holds on to the ball for long. (5) \nOdion Ighalo Scored the third goal after connecting a fine header which went past the keeper. Will offer a lot to the team. (7) \nAlex Iwobi Replaced Musa and was full of running. Transition was good, held the ball well and was tidy with his passes. (6)", "external_links": [], "published": "2015-10-12T00:50:00.000+03:00", "crawled": "2015-10-12T01:40:01.576+03:00", "highlightTitle": ""}