{"organizations": [], "uuid": "de2c75abc75169538092fce20288ab623738e17e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nydailynews.com", "main_image": "http://assets.nydailynews.com/polopoly_fs/1.406051!/img/httpImage/image.jpg_gen/derivatives/landscape_1200/alg-steve-sarkisian-jpg.jpg", "site_section": "http://www.nydailynews.com/sports/college/index.html", "section_title": "College Sports News: College Football, College Basketball, College Baseball, NCAA - NY Daily News", "url": "http://www.nydailynews.com/sports/college/usc-drops-no-12-upset-loss-washington-florida-gators-stay-no-1-article-1.406050", "country": "US", "title": "USC drops to No. 12 after upset loss", "performance_score": 0, "site": "nydailynews.com", "participants_count": 1, "title_full": "USC drops to No. 12 after upset loss - NY Daily News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "de2c75abc75169538092fce20288ab623738e17e"}, "author": "NEW YORK DAILY NEWS", "url": "http://www.nydailynews.com/sports/college/usc-drops-no-12-upset-loss-washington-florida-gators-stay-no-1-article-1.406050", "ord_in_thread": 0, "title": "USC drops to No. 12 after upset loss", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Perine/AP Steve Sarkisian celebrates after his Washington Huskies pull off huge upset by knocking off No. 3 USC with late field goal. Southern California dropped nine spots and out of the top 10 in The Associated Press college football poll Sunday, and Washington moved into the rankings for the first time in six years.\nA day after the Huskies upset the Trojans 16-13 on a late field goal, USC fell from No. 3 to No. 12 in the media poll. The Trojans became the second preseason top-five team to lose in the first three weeks of the season. Preseason No. 3 Oklahoma lost its opener to BYU.\nWashington, ranked for the first time since Sept. 28, 2003, is No. 24.\nNo. 1 Florida and No. 2 Texas have held firm to their spots all season. No. 3 Alabama and No. 4 Mississippi moved up one spot in the latest poll, giving the Southeastern Conference three of the top four teams in the nation. Penn State remained No. 5.\nFlorida received 55 of 60 first-place votes. Texas had two and Alabama received three.\nBYU dropped the farthest this week, from seventh to 19th after a 54-28 home loss to Florida State . The Seminoles moved back into the rankings at No. 18.\nThe rest of the top 10 was California at No. 6, followed by LSU , Boise State, Miami and Oklahoma.\nThe Hurricanes made the biggest jump of the ranked teams from last week, moving up 11 spots after a 33-17 victory against Georgia Tech . The loss knocked the Yellow Jackets out of the rankings. Utah also dropped out after a loss.\nMiami is in the top 10 for first time since the final regular-season poll of the 2005 season. The Hurricanes play at No. 11 Virginia Tech on Saturday in a huge Atlantic Coast Conference game.\nMiami was the dominant team in college football during the early 2000s. In the latter part of the decade, USC has taken the Hurricanes' place.\nThe last time Miami was ranked higher than USC was Oct. 26, 2003. That week the Hurricanes were No. 2 and USC was No. 3. The next week, USC moved up a spot, Miami dropped to sixth and the two programs kept drifting apart. The Trojans became a top-10 fixture while the Hurricanes struggled to even crack the Top 25.\nSince Nov. 3, 2002, Pete Carroll 's second season at USC, the Trojans have spent only six weeks out of the top 10 - all in 2007 following an early October home loss to 40-point underdog Stanford .\nWashington, like Miami, contended for national championships earlier this decade, but the Huskies have fallen on even harder times than the 'Canes.\nWashington finished that 2003 season 6-5 and hasn't had a winning season since. The Huskies hit rock bottom last season, becoming the first Pac-10 team to go 0-12.\nJake Locker and the Huskies snapped a 15-game losing streak last week with a 42-23 victory against Idaho , but beating the Vandals could hardly be viewed as a sign that Washington was ready to defeat USC for the first time since 2001.\nNew coach Steve Sarkisian , a former USC assistant, and the Huskies did just that. Locker led a masterful late drive and Eric Folk kicked a 22-yard field goal with 3 seconds left in the game.\n\"We said early on that it wasn't going to take us very long,\" Sarkisian told reporters on Saturday. \"I think maybe some people outside our own little domain thought that that was just press-conference-speak.\"\nIt was only a week ago that USC, behind freshman quarterback Matt Barkley , was coming off a dramatic comeback victory against Ohio State . Barkley did not play against Washington because of a sore shoulder.\nThe Buckeyes are No. 13 in the new poll, followed by Cincinnati and TCU.\nOklahoma State , Houston , Florida State, BYU and Kansas round out the top 20. Georgia , North Carolina , Michigan , Washington and Nebraska are the final five.", "external_links": [], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-09T08:47:00.172+03:00", "highlightTitle": ""}