{"organizations": ["San Diego Padres", "Facebook Paint it Black Former San Diego Padres", "Black Facebook Email Twitter Google", "Nats", "LinkedIn Pinterest Paint it Black Former San Diego Padres", "New York Mets"], "uuid": "4ae172a40430217fc35e5290f36a9dbb8698fdb7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wusa9.com", "main_image": "http://cdn.tegna-tv.com/-mm-/4da536120dd2892b0f3b4486a4dcc3635a200ec0/c=0-293-2679-1806&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/15/WUSA/WUSA/635805039694965930-USATSI-8605513.jpg", "site_section": "http://rssfeeds.wusa9.com/_/20/108810098/WUSA-sports", "section_title": "WUSA - Sports", "url": "http://www.wusa9.com/story/sports/mlb/2015/10/15/paint-black/73980798/", "country": "US", "title": "Paint it Black", "performance_score": 0, "site": "wusa9.com", "participants_count": 0, "title_full": "Paint it Black", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T18:19:00.000+03:00", "replies_count": 0, "uuid": "4ae172a40430217fc35e5290f36a9dbb8698fdb7"}, "author": "", "url": "http://www.wusa9.com/story/sports/mlb/2015/10/15/paint-black/73980798/", "ord_in_thread": 0, "title": "Paint it Black", "locations": ["USA", "San Diego", "CA", "Petco Park"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Bud Black", "Sam C. LaPaille", "Jake Roth", "Jake Roth-USA"], "text": "Facebook Email Twitter Google+ LinkedIn Pinterest Paint it Black Former San Diego Padres manager Bud Black has emerged as the leading candidate to become the next Nats manager. Post to Facebook Paint it Black Former San Diego Padres manager Bud Black has emerged as the leading candidate to become the next Nats manager.  //on.wusa9.com/1RKdlWK   Join the Conversation To   Paint it Black Sam C. LaPaille, WUSA9 11:31 a.m. EDT October 15, 2015 Jun 3, 2015; San Diego, CA, USA; San Diego Padres manager Bud Black (20) jogs back to the dugout during the seventh inning against the New York Mets at Petco Park. Mandatory Credit: Jake Roth-USA TODAY Sports (Photo: Jake Roth, Jake Roth-USA TODAY Sports) CONNECT TWEET LINKEDIN COMMENT EMAIL MORE \nWASHINGTON (WUSA9) -- Only 10 days removed from the Matt Williams-era, a former MLB manager has already established himself as the leading candidate for the Nationals' open managerial job. \nBud Black, the former San Diego Padres manager (2007-15) who also enjoyed a 15-year playing career in the MLB as a pitcher (1981-95), will interview with the Nationals' front office on Thursday and there is a strong sense that Black has emerged as the front runner for the position. \nBlack declined to comment on the situation, noting that he would wait to say anything until the Nats do so first. \nBut the general feeling around the MLB is that Black is the \"preferred choice\" , especially because he brings immense managerial experience to the table. Former manager Matt Williams had not managed one game on any level of baseball before coming to the Nationals in 2014. Sources: Bud Black preferred choice of some in #Nationals ’ front office. Long list of candidates, however - and ownership Is unpredictable. — Ken Rosenthal (@Ken_Rosenthal) October 14, 2015 Former Padres manager Bud Black interviewing today for #Nationals manager job. Industry sources believe he is the favorite \nBlack even stated in an interview back on October 7th with Sirius XM's MLB Network Radio that the Nats job is a \"very attractive position.\" \nDuring his playing career, Black most notably pitched for the Kansas City Royals from 1982-88, winning a World Series in 1985. Black won 121 games over his 15 year career and later went on to win another World Series with the Anaheim Angels as their pitching coach in 2002. \nMay 29, 2015; San Diego, CA, USA; San Diego Padres manager Bud Black (C) smiles at right fielder Matt Kemp (27) after celebrating the walk-off grand slam by catcher Derek Norris (not pictured) as left fielder Justin Upton (L) looks on at Petco Park. Mandatory Credit: Jake Roth-USA TODAY Sports (Photo: Jake Roth, Jake Roth-USA TODAY Sports) \nIn eight-plus seasons as the Padres manager, Black went 649-713, failing to reach the playoffs in every season with San Diego. Black did win the 2010 National League Manager of the Year award when he lead the Padres to a 90-72 record, finishing just two games out of the NL West divisional crown. \nBlack has been heralded as a \"player's coach\" and brings an impressive pitching pedigree (both on the field and in the dugout) to the table, something the Nationals are in desperate need of. \nThe Nats plan on bringing in former MLB managers Dusty Baker and Ron Gardenhire to interview for the opening as well, but Black seems to remain as the man to beat for now. \nLike this story? Like us on Facebook . \nMORE NEWS:", "external_links": [], "published": "2015-10-15T18:19:00.000+03:00", "crawled": "2015-10-15T18:47:09.954+03:00", "highlightTitle": ""}