{"organizations": [], "uuid": "c21c279873ae41f15e3f5af70d8eea9b59cf1ed4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtontimes.com", "main_image": "http://media.washtimes.com.s3.amazonaws.com/media/image/2015/10/17/3c8af38db0371d2e850f6a706700765d.jpg", "site_section": "http://www.washingtontimes.com/rss/headlines/sports/", "section_title": "www.washingtontimes.com stories: Sports", "url": "http://www.washingtontimes.com/news/2015/oct/17/stevens-hansley-help-colorado-state-beat-air-force/", "country": "US", "title": "Stevens, Hansley help Colorado State beat Air Force 38-23", "performance_score": 0, "site": "washingtontimes.com", "participants_count": 1, "title_full": "Stevens, Hansley help Colorado State beat Air Force 38-23", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T02:19:00.000+03:00", "replies_count": 0, "uuid": "c21c279873ae41f15e3f5af70d8eea9b59cf1ed4"}, "author": "PAT GRAHAM", "url": "http://www.washingtontimes.com/news/2015/oct/17/stevens-hansley-help-colorado-state-beat-air-force/", "ord_in_thread": 0, "title": "Stevens, Hansley help Colorado State beat Air Force 38-23", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sports Stevens, Hansley help Colorado State beat Air Force 38-23 Colorado State wide receiver Joe Hansley (25) runs for a touchdown against the Air Force during the first half of an NCAA college football game Saturday, Oct. 17, 2015, in Fort Collins, Colo., (AP Photo/Jack Dempsey) more > By PAT GRAHAM   \nFORT COLLINS, Colo. (AP) - Nick Stevens threw three touchdown passes, including a pair to Joe Hansley, and Jasen Oden Jr. rushed for two scores as Colorado State beat Air Force 38-23 on Saturday. \nHansley came up big with All-American receiver Rashard Higgins limited by a hamstring injury and an illness. Hansley caught three passes for 75 yards to help Colorado State (3-4, 1-2 Mountain West) capture the Ram-Falcon Trophy, an award given to the winner since 1980. \nAir Force (3-3, 2-1) missed out on an opportunity to stay atop the Mountain Division with Utah State, which upset No. 21 Boise State on Friday. Even more, the Falcons lost fullback Shayne Davern in the third quarter with an apparent right knee injury. Davern had 76 yards rushing, including a 60-yard TD run. \nStevens had the Rams clicking on offense, finishing 23 of 30 for a career-best 296 yards. Oden added 89 yards on the ground. \nUp 14-13 late in the first half, Colorado State scored 24 straight points to pull away. The defense played a big role by stopping Air Force’s vaunted option attack and forcing two turnovers. Tyree Simmons had an interception and also forced a fumble that was recovered by Deonte Clyburn. \nHiggins appeared drained at times from an illness that kept him out of practice. He still finished with seven catches for 74 yards, including a diving 33-yard reception late in the third quarter that led to a field goal to put Colorado State up 38-13. \nHe also recovered an onside kick with 4:21 remaining after Air Force sliced the lead to 38-23. \nHansley had a big first half, with two TD catches. It could’ve been even more memorable, but his 75-yard punt return for a score in the first quarter was negated by an illegal block. \nThat didn’t matter, as the Rams scored five plays later when Stevens found a wide open Steven Walker for a 23-yard TD. \nAir Force quickly answered on Davern’s 60-yard run up the middle. Drew Oehrle missed the extra point off the upright. \nIt was just that sort of afternoon for the Falcons on special teams. They couldn’t attempt a 30-yard field goal after long-snapper Andrew Gikas sent the ball high to holder Brett Dune, who fumbled the football and had to pounce on it. \nThe Falcons sent Luke Strebel out to make a 41-yard field goal in the fourth quarter. \nColorado State coach Mike Bobo didn’t have to go far to find a resource for defending the option. His dad ran the wishbone as a high school coach in Georgia. Bobo’s dad once visited with legendary Falcons coach Fisher DeBerry to pick up tips on how to run the option. \nAir Force was held to 269 yards rushing, below its league-leading average of 320.8. \nThe Rams brought back Sonny Lubick to serve as an honorary captain. The longtime CSU coach guided the team to nine bowl games from 1993-2007.", "external_links": [], "published": "2015-10-18T02:19:00.000+03:00", "crawled": "2015-10-18T03:25:13.908+03:00", "highlightTitle": ""}