{"organizations": [], "uuid": "f9afc3f159fcb1d7599220f443bfed9b3a36220f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mb.com.ph", "main_image": "http://www.mb.com.ph/wp-content/uploads/2015/10/NCAA.jpg", "site_section": "http://www.mb.com.ph/category/sports/", "section_title": "mb.com.ph | Philippine News | Archive | Sports", "url": "http://www.mb.com.ph/will-mapua-jru-spoil-the-fun/", "country": "CA", "title": "Will Mapua, JRU spoil the fun?", "performance_score": 0, "site": "mb.com.ph", "participants_count": 1, "title_full": "Will Mapua, JRU spoil the fun? | mb.com.ph | Philippine News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "f9afc3f159fcb1d7599220f443bfed9b3a36220f"}, "author": "Christian Jacinto", "url": "http://www.mb.com.ph/will-mapua-jru-spoil-the-fun/", "ord_in_thread": 0, "title": "Will Mapua, JRU spoil the fun?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "by Christian Jacinto\nOctober 20, 2015 Games Today\n(Mall of Asia Arena)\n12 noon – Arellano vs Mapua (Jrs)\n2 p.m. – Letran vs Mapua (Srs)\n4 p.m. – San Beda vs JRU (Srs)\nMapua in the NCAA finals? Jose Rizal University (JRU), maybe?\nThey are the longest of long shots, but for schools that have not won the NCAA basketball championship for decades, now could be a chance of lifetime to end their drought.\nLetran’s Kevin Racal (left) and San Beda’s Art dela Cruy (right) need to step up once again if they want their respective teams to hurdle their NCAA Final Four rivals today. (Ernie U. Sarmiento)\nMapua takes on Letran in the first semifinal game at 2 p.m. while Jose Rizal plays defending champion San Beda at 4 p.m.\nBoth Mapua and Jose Rizal are underdogs. If these were not daunting enough, the two teams must beat their rivals two times as San Beda and Letran enjoy twice to-beat-advantages, by finishing first and second in the two-round elimination.\nMapua has not won the NCAA title since 1991, while Jose Rizal did it in 1972 when it was still a college, not a university. That was also the year a lanky fellow named Philip Cezar entered stardom by leading the Bombers to the championship.\nIn contrast, San Beda and Letran have championship pedigree. The Red Lions, who “revolutionized” college basketball – for good or bad – by being the first team to recruit African students, have combined for the most number of NCAA titles with San Beda winning nine of the last 10 disputed. It is gunning for its sixth straight.\nBut Mapua has to be taken seriously in this game which is do-or-die for the Cardinals as much as it is for the Bombers.\nThe Cardinals have won nine of their final 10 games, including against the Arellano University Chiefs whom they ousted for the last Final Four berth and then beat the Bombers in a playoff for third place to set the stage for the “Battle of Intramuros” with the Knights.\nThe Knights, bannered by Mark Cruz and Kevin Racal, turned heads through their patented pressure defense and tore through the elims to take second spot.\nThe Cardinals, on the other hand, got a gem of a find in Cameroonian Allwell Oraeme and rookie guards Darrell Menina and JP Nieles to make the semis for the first time since 2010.\nThe Bombers are no slouches either. They won their last six matches before losing to the Cardinals in last week’s playoff for No. 3 to settle for a date with the Lions.\nThat is why Jarin doesn’t see the contest as a cake walk despite a deep rotation led by pro-bound cagers Art dela Cruz and Baser Amer and import Ola Adeogun.\n“When JRU started the season, coach Vergel (Meneses) promised the entire community that they’re gonna make the Final Four and they’re here. They’re well coached, it’s gonna be tough,” said Jarin.\n“I’m very happy cause I have 15 players ready to play. For the entire elimination I never had that luxury but coming into the Final Four, we have a 15 man line-up so I’m satisfied,” he added.", "external_links": ["http://i.po.st/static/v3/post-widget.js#publisherKey=4qcr4d26tnrf260rqrda&retina=true"], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-20T02:28:54.012+03:00", "highlightTitle": ""}