{"organizations": [], "uuid": "4d47f7bc25336394925c6a7840bfc11efaf41fd5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "abcnews.go.com", "main_image": "", "site_section": "http://abcnews.go.com/sports", "section_title": "Sports News &amp; Articles – Scores, Pictures, Videos - ABC News", "url": "http://abcnews.go.com/Sports/mind-boggling-developments-djokovics-rout-nadal/story?id=34404000", "country": "US", "title": "Mind-boggling developments in Djokovic's rout of Nadal", "performance_score": 0, "site": "go.com", "participants_count": 1, "title_full": "Mind-boggling developments in Djokovic's rout of Nadal - ABC News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "4d47f7bc25336394925c6a7840bfc11efaf41fd5"}, "author": "abcNEWS", "url": "http://abcnews.go.com/Sports/mind-boggling-developments-djokovics-rout-nadal/story?id=34404000", "ord_in_thread": 0, "title": "Mind-boggling developments in Djokovic's rout of Nadal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Novak Djokovic arrived in Beijing this year undefeated at the China Open in 25 matches. He left in the same untarnished condition Sunday, this time without dropping a set as he ran his streak to 29 matches capped by a wince-inducing 6-2, 6-2 win against career rival Rafael Nadal in the final.\nThe final made you wonder, whatever became of those epic, gut-wrenching, six-trips-to-the-bathroom matches these men used to play?\nTwo things occurred to change that, one of them mildly surprising, the other totally unexpected: Djokovic, already the equal on any given day of Nadal and Roger Federer et al, has gotten better in 2015. His statistics this year show it. (He won three Grand Slam titles and made the final in the major he didn't win.)\nThe mind-boggling development is that Nadal has gotten worse. A lot worse -- quickly.\nNadal once was Djokovic's nemesis. In fact, he rolled through Djokovic in this same city in 2008, on his way to the singles gold medal in the Olympic games. And Nadal still leads their head-to-head 23-22. But Nadal went into a tailspin after he took off most of the backside of 2014, and his comeback has been halting -- painfully, conspicuously, agonizingly and perhaps even career-threateningly so.\nTo his credit, before the final, Nadal told his ATP handlers: \"I know today Novak is not in my league; he has been on a different level to me this year. So for me to be in the final is great news and tomorrow is a match to try to enjoy and try to play the way that I want to play, and we'll see.\"\nWhat we saw is that Djokovic exerted complete control of the match, playing from on, or inside, the baseline. Nadal, meanwhile, often looked like a man impersonating the player once known as the \"King of Clay.\"\nThe very first point of the match, with Nadal serving, produced a medium-length rally featuring great defense by Nadal, but penetrating, persistent stroking by Djokovic -- until the latter pulled the trigger on a sharp cross-court backhand that Nadal, at full stretch, barely ticked with his racket.\nIt was just a taste of things to come.\nNadal sometimes looked convincing, running east and west along the baseline, swinging his racket like a bolo, but he was mostly chasing and feeding. His shots too often lacked the critical, requisite degree of penetration. His return never really hurt Djokovic (credit Djokovic's underrated serve as well on that one), nor did the Nadal serve.\nIt's almost alarming, how easy Djokovic is making the game look these days. Traveling to Beijing in quest of his sixth China Open title, he give his co-coach Boris Becker the week off, and brought along his two brothers.\nThe trio went to visit the Great Wall. They probably brought fireworks and had fun setting them off, which is always a fun brother thing, right? Djokovic also took a wild card into the doubles to give one of his brothers, Djordje, a taste of the big time as a player. The pair actually won a match before eventual champs Jack Sock and Vasek Pospisil issued a reality check.\nIf you made a movie of all this, it could be called \"Djokovic Family Vacation.\"\nBut Djokovic was deadly serious on the court.\n\"Beast of Beijing\" may not have the same regal ring -- or universal reach -- as \"King of Clay,\" but it's difficult to come up with something catch-phrase based on hard-court excellence. It's too bad, because cement-based hard courts happen to be the most common surface on the ATP Tour, and they're one of the main reasons Djokovic is the dominant force in today's game. While Nadal leads the rivalry overall, Djokovic has a commanding hard-court lead -- now 11-6.\nDjokovic will now try to pile on even more hard-court wins at the Shanghai Masters 1000, where he's a mere 19-3.\nHow about, \"Sultan of Cement\"?\n Mind-boggling developments in Djokovic's rout of Nadal ", "external_links": ["https://s.abcnews.com/assets/js/merlin-ext.js?v=2", "http://media.video-cdn.espn.com/motion/2015/1011/dm_151011_SC_WNBA_Lynx_Fever_Game_4/dm_151011_SC_WNBA_Lynx_Fever_Game_4_default.jpg", "http://a.abcnews.com/assets/beta/js/abcn.js?v=47", "http://a.abcnews.com/assets/beta/js/custom/pages/trident_story.js?v=47", "http://abcnewsplayer-a.akamaihd.net/player/2.24.0.0000/amp.premier/amp.premier.min.js?v=2", "http://media.video-cdn.espn.com/motion/2015/1012/dm_151011_nfl_sf_nyg235/dm_151011_nfl_sf_nyg235_default.jpg", "http://twitter.com/intent/tweet?text=Mind-boggling+developments+in+Djokovic%27s+rout+of+Nadal+-+ABC+News+-+http%3A%2F%2Fabcnews.go.com%2FSports%2Fmind-boggling-developments-djokovics-rout-nadal%2Fstory%3Fid%3D34404000&via=ABC", "https://www.facebook.com/sharer.php?u=http%3A%2F%2Fabcnews.go.com%2FSports%2Fmind-boggling-developments-djokovics-rout-nadal%2Fstory%3Fid%3D34404000", "http://media.video-cdn.espn.com/motion/2015/1012/dm_151012_nfl_ny_sf267/dm_151012_nfl_ny_sf267_default.jpg", "http://api.addthis.com/oexchange/0.8/forward/email/offer?url=http://abcnews.go.com/Sports/mind-boggling-developments-djokovics-rout-nadal/story?id=34404000&title=Mind-boggling+developments+in+Djokovic%27s+rout+of+Nadal", "http://media.video-cdn.espn.com/motion/2015/1011/dm_151011_SC_Tim_Kurkjian_on_Chase_Utley_Suspension/dm_151011_SC_Tim_Kurkjian_on_Chase_Utley_Suspension_default.jpg", "http://a.abcnews.com/assets/js/s_code_15.js?v=4", "https://s.abcnews.com/assets/js/merlin-core.js?v=2"], "published": "2015-10-11T03:00:00.000+03:00", "crawled": "2015-10-12T17:54:21.336+03:00", "highlightTitle": ""}