{"organizations": [], "uuid": "77ce893fb0594fb2ef63242bd261a0dd317b7395", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.indiatvnews.com", "main_image": "http://images.indiatvnews.com/sportscricket/IndiaTv8f4fe3_India-South-Africa.jpg", "site_section": "http://www.indiatvnews.com/rssfeed/sports_cricket_news.xml", "section_title": "Sports >> Cricket News", "url": "http://www.indiatvnews.com/sports/cricket/south-africa-beat-india-by-runs-in-first-odi-take-lead-in-series-18230.html", "country": "SG", "title": "South Africa beat India by 5 runs in first ODI, take 1-0 lead in series", "performance_score": 0, "site": "indiatvnews.com", "participants_count": 0, "title_full": "South Africa beat India by 5 runs in first ODI, take 1-0 lead in series", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T20:45:00.000+03:00", "replies_count": 0, "uuid": "77ce893fb0594fb2ef63242bd261a0dd317b7395"}, "author": "", "url": "http://www.indiatvnews.com/sports/cricket/south-africa-beat-india-by-runs-in-first-odi-take-lead-in-series-18230.html", "ord_in_thread": 0, "title": "South Africa beat India by 5 runs in first ODI, take 1-0 lead in series", "locations": ["South Africa", "Kanpur", "India"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kanpur boasts world's largest manually operated scoreboard \nKanpur: Rohit Sharma's rollicking 150-run knock went in vain as South Africa pulled off a thrilling five-run victory in the first cricket One-dayer against India to continue their winning run here today. \nChasing a record 304 at the Green Park, the Indians fell agonisingly short of the target in the last over, giving the visitors a 1-0 lead in the five-match series. \nWith India needing 22 off the last two overs, captain Mahendra Singh Dhoni failed to finish the job after Rohit (150 runs off 133 balls) got out in the 47th over. The script went horribly wrong after Rohit's departure as India crumbled under pressure to end at 298 for seven. \nRohit's eighth ton in ODIs ended in a losing cause and it came after AB de Villiers's unbeaten 104 off 73 balls that propelled South Africa to 303 for five, the highest score at this venue surpassing 294 made by the hosts in 2007. \nIndia seemed set to chase down the total until they lost the plot in the final few overs with Dhoni (31), Suresh Raina (3) and Stuart Binny (2) falling well short of expectations. \nThey would have been nowhere near the target if it was not for Rohit, who opened the batting in Kanpur heat and lasted almost till the end. His herculean effort comprised 13 fours and six sixes. \nIndia, however, began the chase smoothly, scoring at run a ball to be 90 for one in 15 overs. The start would have been even better had Shikhar Dhawan (23) been not adjudged lbw to a questionable decision with the ball appearing to go down the leg side. \nAjnkya Rahane (60), who was a surprise inclusion in the team, came in at no.3 ahead of Virat Kohli and alongside Rohit, forged a carefully crafted partnership. \nDe Villers enthralled the local crowd in the first half of the game and then it was the turn of their own hero Rohit, whose strokes square off the wicket gelled beautifully with his cover drives. Back in the side, Rahane too began in style, punching a cover drive off speedster Kagiso Rabada. \nIndia seemed to be riding a steady ship with both of them at the crease, negotiating the pace heavy South African attack bolstered with the return of Dale Steyn and Morne Morkel. \nRohit got to his fifty cutting gently over backward point for four and followed it up with a flick between mid-on and mid-wicket. \n\n ", "external_links": [], "published": "2015-10-11T20:45:00.000+03:00", "crawled": "2015-10-12T01:56:25.389+03:00", "highlightTitle": ""}