{"organizations": [], "uuid": "6f82d18f87af5c48ec30f1e1ec8ca712a1c34612", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dallasnews.com", "main_image": "http://www.dallasnews.com/incoming/20150914-1442280387-ns_13cowboysgiants26.jpg.ece/BINARY/original/1442280387-NS_13CowboysGiants26.jpg", "site_section": "http://www.dallasnews.com/sports/columnists/rick-gosselin/", "section_title": "Rick Gosselin Sports Columns - Sports News for Dallas, Texas ", "url": "http://www.dallasnews.com/sports/columnists/rick-gosselin/20150914-gosselin-with-dez-bryant-out-for-cowboys-it-s-time-to-give-last-year-s-bit-pieces-more-opportunities.ece", "country": "US", "title": "With Dez Bryant out for Cowboys, it's time to give last year's bit pieces more opportunities", "performance_score": 0, "site": "dallasnews.com", "participants_count": 12, "title_full": "Gosselin: With Dez Bryant out for Cowboys, it's time to give last year's bit pieces more opportunities | Dallas Morning News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-15T04:31:00.000+03:00", "replies_count": 14, "uuid": "6f82d18f87af5c48ec30f1e1ec8ca712a1c34612"}, "author": "Gosselin", "url": "http://www.dallasnews.com/sports/columnists/rick-gosselin/20150914-gosselin-with-dez-bryant-out-for-cowboys-it-s-time-to-give-last-year-s-bit-pieces-more-opportunities.ece", "ord_in_thread": 0, "title": "With Dez Bryant out for Cowboys, it's time to give last year's bit pieces more opportunities", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Lance Dunbar and Gavin Escobar were afterthoughts a year ago on the NFC East champion Cowboys.\nThey were bit players on an offensive unit that finished fifth in the NFL in scoring and seventh in yards. Tony Romo threw 435 passes in 2014, but only 33 went to Dunbar and Escobar. When Romo threw the ball, it was usually in the direction of his Pro Bowlers Dez Bryant, Jason Witten and DeMarco Murray. Those were his money players.\nBut that's about to change.\nThe offensive dynamic has shifted dramatically for the Cowboys. Murray took his NFL rushing crown to Philadelphia in free agency this offseason, and Bryant hobbled off the field in the season opener Monday night with a broken foot. He could be out for up to eight weeks after surgery Monday.\nLook for Dunbar and Escobar to assume higher profiles going forward. Much higher profiles.\nI thought one of the major beneficiaries from the departure of Murray would be Dunbar, one of the few speed elements of the Dallas offense. I thought he could give the Cowboys the same big-play dimension that Darren Sproles, another undersized halfback, gave the San Diego Chargers when they had an annual top-10 offense from 2008-10.\nA pass-down specialist, Sproles had touchdown catches of 81, 66 and 57 yards and also a handful 30-yard runs on draw plays. That's what I envisioned from Dunbar in 2014 â” except that Murray wouldn't come off the field on third downs. He fancied himself as the offensive workhorse and wanted the ball as both a runner and a receiver. The Cowboys accommodated him, 449 touches worth.\nBut with Murray in Philadelphia, the role was there for Dunbar's taking. And he took it in the season opener, catching a team-high eight passes for a team-high 70 yards, including two huge receptions of 24 and 16 yards on the dramatic winning drive.\nRomo threw eight passes to Dunbar on the night, and he caught all of them. Those eight passes were more than Romo threw to Dunbar in any single month last season, much less one game. Romo targeted Dunbar for only 20 passes in 2014.\nEscobar carried an even lighter workload a year ago as he attempted to shake his label of underachiever. A second-round draft pick in 2013, Escobar caught only nine passes in each of his first two seasons. A year ago, Romo threw him only two passes in November and just two more in December.\nStill, I thought Escobar would pencil in as, essentially, the fourth wide receiver on the 2015 Cowboys. The Cowboys were thin on the flank after Bryant, Terrance Williams and Cole Beasley. I wasn't sold on inexperienced Devin Street or undrafted rookie Lucky Whitehead becoming significant contributors.\nEscobar could line up in the slot and give the Cowboys a two tight-end look with Witten that would create matchup problems. The 2011 AFC champion Patriots showed the NFL the effectiveness of a two-tight end set when Rob Gronkowski and Aaron Hernandez combined to catch 169 passes for 2,237 yards and 24 touchdowns.\nRomo threw Escobar all of 13 passes last season. But he threw him two balls Sunday night against the Giants and Escobar caught them both, including a 2-yard touchdown pass.\nWith Bryant out, Williams figures to draw the best coverage corner on defense. Williams will find out what Alvin Harper found out a few decades earlier. It's a far greater challenge to be the No. 1 option than No. 2. The double coverage that Bryant saw will free up a defender in his absence. That means an extra tackler in the box, making it tougher to run, and bracketing Witten on passing downs. Beasley also figures to see a better corner in the coverage pecking order.\nDunbar would then become the safest option for Romo. He represents a short pass that could instantly become a long gainer. And Escobar also represents a safe option as an outlet receiver. He's 6-6. Throw it high. No defender is going to take a high pass away from him. In his only multi-catch game of 2014, Escobar turned two of his three receptions against the Giants into touchdowns of 26 and 15 yards.\n\"Escobar has proven when he's given opportunities in his career, he's been pretty darn productive,\" Cowboys coach Jason Garrett said. \"So has Dunbar.\"\nIt's time to give them those opportunities. Yards and points are going to be more difficult to come by for this offense without Murray and Bryant. Dunbar and Escobar have something to offer. It's time to use them. If not now ... when?\nListen to Rick Gosselin at 10:50 a.m. Tuesdays on Sportsradio 1310 AM/96.7 FM The Ticket with Norm Hitzges.\nFollow Rick Gosselin on Twitter at @RickGosselinDMN.\n ", "external_links": ["https://twitter.com/RickGosselinDMN"], "published": "2015-09-15T04:31:00.000+03:00", "crawled": "2015-10-13T22:50:11.503+03:00", "highlightTitle": ""}