{"organizations": [], "uuid": "a81e49df8555d33e9a5c946c9834bb982ea3bc05", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dnaindia.com", "main_image": "http://static.dnaindia.com/sites/default/files/2015/10/17/386270-child-abuse-2.jpg", "site_section": "http://www.dnaindia.com/", "section_title": "DNA India | Latest News, Live Breaking News on India, Politics, World, Business, Sports, Bollywood", "url": "http://www.dnaindia.com/india/report-delhi-child-rape-cops-scanning-cctv-footage-to-identify-accused-2135961", "country": "SG", "title": "Delhi Child Rape: Cops scanning CCTV footage to identify accused", "performance_score": 0, "site": "dnaindia.com", "participants_count": 1, "title_full": "Delhi Child Rape: Cops scanning CCTV footage to identify accused | Latest News & Updates at Daily News & Analysis", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T19:10:00.000+03:00", "replies_count": 0, "uuid": "a81e49df8555d33e9a5c946c9834bb982ea3bc05"}, "author": "PTI", "url": "http://www.dnaindia.com/india/report-delhi-child-rape-cops-scanning-cctv-footage-to-identify-accused-2135961", "ord_in_thread": 0, "title": "Delhi Child Rape: Cops scanning CCTV footage to identify accused", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "During investigation, it came to light that the duo allegedly kidnapped the two-and-a-half-year-old girl taking advantage of a ten-minute-long power cut Hours after a toddler was allegedly kidnapped by two men riding a motorbike and raped brutally, Delhi Police are yet to identify any accused, with the prime lead in the case being a CCTV grab in which the registration number of the motorbike is partially visible. \"As many as 15 police teams have been put into this case to identify and nab the accused as early as possible,\" said Joint Commissioner of Police (Southwest) Dependra Pathak.\nDuring investigation, it came to light that the duo allegedly kidnapped the two-and-a-half-year-old girl taking advantage of a ten-minute-long power cut which took place in the locality around 11.30 PM, said a police official privy to the investigation. The girl and her grandmother were among the spectators at a Ramlila event organised close to their residence. The girl was standing a few metres away from her granny just to have a better glimpse of the drama, when the lights went off, said police.\n\"Cow Milk Party\" held in Lucknow in response to the beef controversy, Maulana Khalid Rasheed also in attendance. pic.twitter.com/mQh7O86zWB\n— ANI (@ANI_news) October 17, 2015\nThe Ramlila committee then turned on a generator and after the lights were back in around 10 minutes, the toddler's grandmother noticed that she was missing. When she raised an alarm, locals gathered around and started looking for the girl. When they failed, they reported the matter to the police. Around 1.30 AM, the girl was spotted - bleeding profusely and crying - at a park, less than half-a-kilometre away from her residence, said police. She was rushed to a hospital, where rape was confirmed and the girl had to be admitted. Meanwhile, the police obtained CCTV grabs from a shop in the locality. In the footage, the girl can be seen being seated between two men, not wearing helmets, on a motorcycle. However, the profiles of the accused were not clear enough for profiling, said the official.\nOn being processed, During investigation, it came to light that the duo allegedly kidnapped the two-and-a-half-year-old girl taking advantage of a ten-minute-long power cut\nPolice teams are, meanwhile, questioning locals in the area but no person was detained till now, said Joint CP Pathak. In the afternoon, agitated locals and relatives of the victim staged a protest at Nangloi-Najafgarh Road demanding immediate arrest of the accused. They also vandalised a few buses, throwing traffic out of gear for several hours.\nLater, a police team had to be deployed there and the crowd dispersed after intervention of senior officials who assured them of a speedy and unbiased probe, police added.", "external_links": ["http://t.co/mQh7O86zWB", "https://twitter.com/ANI_news/status/655355852061184001"], "published": "2015-10-17T19:10:00.000+03:00", "crawled": "2015-10-17T21:06:45.347+03:00", "highlightTitle": ""}