{"organizations": ["Inter Milan", "Reuters", "Juventus"], "uuid": "c6086bd17ee1fc6b82d25ad16dfc0610fe221a11", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "jakartaglobe.beritasatu.com", "main_image": "http://img.thejakartaglobe.com/2015/10/2015-10-18T204023Z_1130164442_GF10000250103_RTRMADP_3_SOCCER-ITALY-1024x734.jpg", "site_section": "http://jakartaglobe.beritasatu.com/rss/sports/", "section_title": "Sports | Jakarta Globe", "url": "http://jakartaglobe.beritasatu.com/football/juventus-frustrated-gladbach-buffon-breaks-record/", "country": "ID", "title": "Juventus Frustrated by Gladbach as Buffon Breaks Record", "performance_score": 0, "site": "beritasatu.com", "participants_count": 0, "title_full": "Juventus Frustrated by Gladbach as Buffon Breaks Record", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T21:53:00.000+03:00", "replies_count": 0, "uuid": "c6086bd17ee1fc6b82d25ad16dfc0610fe221a11"}, "author": "", "url": "http://jakartaglobe.beritasatu.com/football/juventus-frustrated-gladbach-buffon-breaks-record/", "ord_in_thread": 0, "title": "Juventus Frustrated by Gladbach as Buffon Breaks Record", "locations": ["Milan", "San Siro", "Italy"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Gianluigi Buffon", "Gladbach", "Buffon"], "text": "INDEX Juventus Frustrated by Gladbach as Buffon Breaks Record i Juventus' goalkeeper Gianluigi Buffon gives instructions to teammates during the Italian Serie A soccer match against Inter Milan at the San Siro stadium in Milan, Italy. (Reuters Photo/Stefano Rellandini) By : Reuters | on 8:53 AM October 22, 2015 Category : Sports , Football \nTurin, Italy. Juventus were held to a frustrating 0-0 home draw with Borussia Moenchengladbach in the Champions League on Wednesday, as the Italians dominated possession and chances but failed to break down the visitors' steely defense. \nThe hosts hogged the ball but were unable to find a breakthrough with Paul Pogba and Alvaro Morata both going close, while Mario Mandzukic had a penalty appeal rejected by referee Craig Thomson on 66 minutes. \nWhile Juventus failed to make a mark on the scoresheet, keeper Gianluigi Buffon entered the club's record books as he beat Alessandro Del Piero's record for minutes played for the \"Old Lady\" of Italian football. \nDel Piero previously held the record having played 48,867 minutes for the club, but it was surpassed by Buffon in the 73rd minute of an exasperating evening for Juventus. \n\"I overtook Del Piero, but I prefer the success of the team, to share it with friends, the public and the fans,\" a disappointed Buffon told reporters. \nThe draw left Juve in top spot in Group D, having picked up seven points from their opening three matches. \nManchester City, who beat Sevilla 2-1 at the Etihad Stadium, are second on six points, while the Spaniards are third on three and Gladbach remain bottom of the group with one. \nJuventus dominated possession in a first half littered with chances and almost took the lead on 23 minutes when a Juan Cuadrado effort narrowly missed Yann Sommer's goal. \nPogba became increasingly influential as the half wore on and both he and Morata saw long-range strikes fly just wide. \nMorata was involved in the key moment of the first half on 41 minutes when he was brought down by Alvaro Dominguez, who appeared to be the last man. \nDespite the furious protests of the Juventus players, the Spanish defender escaped with only a yellow card. \nPogba fashioned an excellent chance for Morata on 56 minutes with a superb lobbed pass, although the striker, who was hoping to break another of Del Piero's records by scoring in his sixth-consecutive Champions League match, took a touch too many and allowed Andreas Christensen to recover. \nSommer had to be at full stretch to beat away a Pogba free kick on 58 minutes, and the home fans' frustrations increased shortly afterwards when the referee rejected Mandzukic's penalty appeals after the striker fell in the box under pressure from Dominguez. \n\"We're creating a lot but not putting those chances away,\" said Juventus midfielder Claudio Marchisio. \n\"This applies to the team as a whole and not just the strikers...There's a lot of quality in this team.\" \nReuters", "external_links": [], "published": "2015-10-21T21:53:00.000+03:00", "crawled": "2015-10-22T08:47:49.383+03:00", "highlightTitle": ""}