{"organizations": ["Morgan St. Pierre", "Modesto Christian", "Sonora Wildcats", "Summerville Bears", "Wildcats", "Argonaut"], "uuid": "f42a8362c27a1a6b4a8ddb4930c01228861291a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.uniondemocrat.com", "main_image": "", "site_section": "http://feeds.feedburner.com/UnionDemocrat", "section_title": "The Union Democrat, Sonora, CA News, Sports, & Weather", "url": "http://www.uniondemocrat.com/index.php?option=com_content&task=view&id=117852&Itemid=73", "country": "US", "title": "Preps roundup: Sonora volleyball sweeps Amador", "performance_score": 0, "site": "uniondemocrat.com", "participants_count": 0, "title_full": "Preps roundup: Sonora volleyball sweeps Amador", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T01:10:00.000+03:00", "replies_count": 0, "uuid": "f42a8362c27a1a6b4a8ddb4930c01228861291a3"}, "author": "", "url": "http://www.uniondemocrat.com/index.php?option=com_content&task=view&id=117852&Itemid=73", "ord_in_thread": 0, "title": "Preps roundup: Sonora volleyball sweeps Amador", "locations": ["Bud Castle Gym", "Summerville", "San Andreas", "Sonora", "Thorsted Field", "Calaveras", "Modesto", "Mountain Springs"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kimball", "Riley Patterson", "Hayden Tolbert", "Adrianna Albanes", "Levi Houghton", "Keanu Perez", "Bret Harte", "Sophomore Emma Peller", "Riley Hennington", "Ethan Wright", "Janae Roberson", "Craddock", "Evans", "Kianna Pisula", "Alexis Stead", "Alan Wells", "Bella Petterson", "Kristin Chormicle", "Trey PetersonWood", "Keanu", "Jayanna Scott", "Hart McNeal", "Levi", "Allie Eveleth", "Sarah Boyer", "Julian", "Julian Craddock", "Claire Caldera", "Levi Hart McNeal", "Sophomore Riley Patterson", "Junior Megan Popovich", "Sinclair", "Fulkerson", "Kelsie Evans", "PetersonWood", "Eveleth", "Elza Parish", "Summerville", "Dave Reel", "Kim Evans", "Karen Sinclair", "Josh Martin", "Riley Carpenter", "Grace", "Jennifer Osterhout", "Carpenter", "Colton Pimentel"], "text": "Preps roundup: Sonora volleyball sweeps Amador Preps roundup: Sonora volleyball sweeps Amador By The Union Democrat Sports Department October 13, 2015 10:10 pm The Sonora Wildcats continued its Mother Lode League dominance Monday evening at Bud Castle Gym, defeating Amador 25-15, 25-8, 15-12. With the sweep, Sonora has still not lost a set since joining the Mother Lode League in 2014. Sophomore Riley Patterson led the Wildcats with 12 kills. She also finished the night with nine digs and three aces. Kelsie Evans had five kills, while Adrianna Albanes and Riley Carpenter had four. Carpenter also had two block assists. Kianna Pisula led Sonora with 24 assists. Bella Petterson and Riley Patterson each had three aces, while Evans had two. Riley Hennington had a team-high 11 digs, while Riley Patterson had nine and Kristin Chormicle had four. “I was proud of the girls for playing well on a Monday,” said Sonora head coach Kim Evans. “It is always different when you are out of your routine. Second half of league is always so important and you have to stay very focused. The girls had the right amount of balance in confidence and execution that they felt in control of the match and that is always a nice feeling.” Sonora (19-2, 7-0 MLL) will head to San Andreas on Thursday to play Calaveras. Sonora girls’ golf beats Modesto at home The Sonora girls’ golf team got a dominating 218-277 victory over Modesto Christian Tuesday at Mountain Springs. Junior Megan Popovich led the way for the Wildcats, shooting a 49 and earning medalist honors. Sophomore Emma Peller shot a 52, Elza Parish a 57 and sophomore Morgan St. Pierre finished the day with a 60. “We did what we needed to do out there today,” said Sonora head coach Karen Sinclair. “Homecoming week always takes a toll, but they did well and I’m very happy.” What Sinclair was most pleased with was the play of freshmen Alexis Stead and Jayanna Scott. They shot a 72 and 73 respectively. “It was the first time they played the full 9-holes at Mountain Springs,” Sinclair said. “It was a really good job for their first time out. They smiled the whole time.” ’Cats JV water polo rolls over Kimball 18-6 The Sonora JV boys’ water polo team defeated Kimball 18-6 Tuesday night in Sonora. Levi Houghton led the Wildcats with six goals. Keanu Perez scored four times, Colton Pimentel had three goals, Ethan Wright tallied two, and Alan Wells found the back of the goal once. “We came out strong and never looked back,” said head coach Josh Martin. “Perimeter defense was stifling, causing a lot of turnovers and our center defense play by Colton Pimentel was lockdown. Keanu and Levi were our engines again on offense, both scoring and getting the whole team involved. Another great game in the pipes by our goalie, Hayden Tolbert. His counter attack passing was on point, and he made a lot of great blocks. I’m very pleased with our aggressiveness on offense and our intensity on defense. The boys have made a lot of progress this year and I can’t wait to see where we end up.” Under the weather volley Bears beat Argonaut The Summerville volleyball team beat Argonaut in four sets (25-21, 23-25, 25-19, 26-24) Tuesday night in Tuolumne. Sophomore Grace Fulkerson led the Bears with 14 kills, as Julian Craddock was close behind with 12. Craddock also had 21 assists and was 11-13 serving with five aces. Sarah Boyer had a team-high 17 digs and Allie Eveleth had 16. Eveleth had a strong night serving the bal, going 12-13 with four aces. Sophomore Janae Roberson led the Bears with three blocks. The Bears head coach Jennifer Osterhout not only was happy that her team got the win, but was pleased that they won despite the fact that the majority of her team was under the weather. “Tonight was a long, slow match,” Osterhout said. “About 90-percent of our team is sick at the moment and it showed tonight. The court was quiet, we lacked motivation, but maintained a lead for most of the match, but only by a point or two. It felt like we put in as much energy as needed to pull off a win. But with that said, we still had some great moments in the court. Claire Caldera and Allie Eveleth have gotten stronger in their attacks. Janae Roberson has begun to be a forceful blocker in the middle and our setters, Grace and Julian, continue to push our offense to be better with each match. We face Bret Harte at home on Thursday and we are hoping to be rested and ready to put up a fight for a successful match.” Bears soccer posts 2-0 shutout The Summerville Bears boys’ soccer team shutout Argonaut 2-0 Tuesday night at Thorsted Field in Tuolumne. The Bears got both of their goals from Trey PetersonWood. He scored his first goal in the first half on a penalty kick. That was the only goal Summerville would score in the first 40 minutes. Levi Hart McNeal assisted PetersonWood for his second goal of the night. Hart McNeal had a shot to take, but passed to PetersonWood who had a clearer shot at the goal. Argonaut only took three shots all night, and none of them came in the second half. “We are just trying to make the most with what we do and try to get better,” said Summerville head coach Dave Reel. “A shutout is always good. We worked out some things and I am really proud of the guys. The Bears (6-1-1 MLL) will host Bret Harte at 7 p.m. on Thursday at Thorsted Field. Follow UnionDemocrat.com", "external_links": [], "published": "2015-10-14T01:10:00.000+03:00", "crawled": "2015-10-15T08:16:45.331+03:00", "highlightTitle": ""}