{"organizations": [], "uuid": "359dae03dc2f8de484a578c120107c400c3c7b24", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kctv5.com", "main_image": "http://kctv.images.worldnow.com/images/8992794_G.jpg", "site_section": "http://www.kctv5.com/", "section_title": "Kansas City, Missouri, Kansas News, Weather, Sports - KCTV5", "url": "http://www.kctv5.com/story/30234942/poll-donald-trump-still-leads-ben-carson-in-second", "country": "US", "title": "Poll: Donald Trump still leads, Ben Carson in second", "performance_score": 0, "site": "kctv5.com", "participants_count": 1, "title_full": "Poll: Donald Trump still leads, Ben Carson in second - KCTV5", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T22:00:00.000+03:00", "replies_count": 0, "uuid": "359dae03dc2f8de484a578c120107c400c3c7b24"}, "author": "Posted by Chris Oberholtz, Multimedia Producer", "url": "http://www.kctv5.com/story/30234942/poll-donald-trump-still-leads-ben-carson-in-second", "ord_in_thread": 0, "title": "Poll: Donald Trump still leads, Ben Carson in second", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(CBS News) - Donald Trump continues to lead the field nationally in the race to become the Republican nominee for president. Twenty-seven percent of Republican primary voters support Trump, giving him a six point lead over his closest competitor, neurosurgeon Ben Carson (21 percent).\nThe rest of the Republican field is in single digits, with Texas Senator Ted Cruz inching up into third place with nine percent, followed by Florida Sen. Marco Rubio with eight percent. Businesswoman Carly Fiorina and former Florida Gov. Jeb Bush follow at six percent each. Former Governor Mike Huckabee has also slipped considerably since the summer, from eight percent in August to just two percent today.\nWhen Republican voters are asked who would be their second choice for the nomination, Ben Carson (20 percent) and Marco Rubio (18 percent) are the most mentioned candidates.\nAmong Trump supporters, Carson is the top second choice, far ahead of any other candidate.\nSeven in ten Republican primary voters would support Trump if he became the party's eventual nominee, though many would have reservations. Twenty-nine percent would support Trump enthusiastically, while 42 percent would support him with reservations, and another eight percent would only support him because he is the party's nominee. One in five Republican primary voters would not support Trump if he became the nominee.\nTrump continues to be viewed as the most electable candidate in a general election. Thirty-five percent say Trump has the best chance of winning in November 2016, followed by Ben Carson (18 percent).\nViews of the candidates\nCarson, Trump, Rubio, and Fiorina are all viewed more favorably than unfavorably among Republican primary voters. At 62 percent, favorable views of Ben Carson are the highest of this group, only seven percent are unfavorable. Fifty-three percent have a favorable view of Donald Trump, and 50 percent have a positive assessment of Marco Rubio. While Trump's unfavorable rating is more than twice that of either Rubio or Fiorina, many don't have an opinion of the latter two candidates. Former Governor Jeb Bush is now viewed more unfavorably (38 percent) than favorably (32 percent) by Republican primary voters.\nWhile the favorable ratings of both Donald Trump and Marco Rubio have risen slightly since August among Republican primary voters, Bush's favorable rating has dropped 11 points.\nThese Republican candidates are viewed less positively among all registered voters nationwide.\nCarson has the highest favorable rating among this broader group of voters, and Fiorina is viewed more favorably than not. Voters divide in their views of Rubio. Many voters overall don't have an opinion of these three contenders.\nFifty-three percent of registered voters overall have an unfavorable opinion of Trump - the highest of the Republicans asked about. Bush is also viewed negatively.\nAssessing the \"outsiders\" on the issues\nMore Republican primary voters are very confident in Trump than in Carson or Fiorina to handle the economy and immigration. Few Republican primary voters are very confident in the ability of any of the three to handle an international crisis.\nCBS News Poll\nStill, most Republican primary voters have at least some confidence in the abilities of all three candidates to handle these issues.\nCandidate qualities\nRepublican primary voters choose honesty (39 percent) as the most important quality in their choice of a candidate, though nearly as many pick being a strong leader (36 percent). Far fewer choose caring about people like them (13 percent), having the right experience (eight percent), or being able to win the general election in November (two percent) as most important.\nBen Carson is the top choice of Republican primary voters who most value honesty, while Donald Trump is the top choice of those who value strong leadership.\nMost Republican primary voters give Trump, Carson, and Fiorina high marks on many of these candidate qualities, but Ben Carson is perceived as the most honest: Eight-one percent think he is honest and trustworthy, compared to 60 percent for Fiorina and 53 percent for Trump. Thirty-nine percent do not think Trump is honest and trustworthy, far more than either Carson or Fiorina.\nBen Carson is also seen as the candidate who most cares about people like them. Fifty-six percent think he cares a lot, more than twice as many as say the same for Trump or Fiorina.\nBut Donald Trump is seen as the strongest leader: Eighty-four percent think Trump has strong qualities of leadership, compared to 72 percent for Carson and 60 percent for Fiorina.\nMost think both Trump (59 percent) and Carson (53 percent) have the right kind of experience to be president, though they are less sure of Fiorina (43 percent).\nAs for what the right kind of experience is, most Republican primary voters think it's more important for the next President to have experience in the private sector (55 percent) than in politics or government (10 percent), though 34 percent say it doesn't matter.\nMore voters are tuning in\nVoters are increasingly turning their attention to the presidential campaign. Forty-two percent now say they are paying a lot of attention, up from 36 percent last month. More are paying a lot of attention now, compared to this point in time in the last two presidential election cycles.\nIn addition, most voters find this campaign interesting. Seven in 10 say they do, including majorities of Republicans, Democrats and independents. According to an October 2011 Pew Poll, just 40% of voters described the presidential campaign as interesting.\nWhen voters are asked in an open-ended question, which one issue they would like to hear the presidential candidates discuss, the economy and jobs (24 percent) is the top answer, followed by immigration (11 percent), and foreign policy (10 percent). Health care and guns are also mentioned.\nThe economy and jobs are the top priority for voters across party lines. Republicans are more likely than Democrats to want the candidates to talk about immigration.", "external_links": ["http://KCTV.images.worldnow.com/images/8992791_G.png"], "published": "2015-10-11T22:00:00.000+03:00", "crawled": "2015-10-12T00:02:10.314+03:00", "highlightTitle": ""}