{"organizations": [], "uuid": "79ac53b0ee7d3d49960fe47c8a19ffda617f98f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/2/8/151904/World/Region/EU-says-air-strikes-in-Syria-must-target-IS.aspx", "country": "EG", "title": "EU says air strikes in Syria must target IS - Region - World", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 2, "title_full": "EU says air strikes in Syria must target IS - Region - World - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 1, "uuid": "b73b996429632b6ea4f5db5e40558f4f7acbb132"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/2/8/151904/World/Region/EU-says-air-strikes-in-Syria-must-target-IS.aspx#post-0", "ord_in_thread": 0, "title": "EU says air strikes in Syria must target IS - Region - World", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Putin takes Syria spotlight; US coalition wants focus on IS Children among dead in Russian strikes on Syria: Monitor Russian planes destroy Islamic State headquarter, camp in Syria: Reports Iran troops to join Syria war, Russia bombs group trained by CIA The European Union said Friday that air strikes in Syria must target Islamic State militants and be coordinated to avoid civilian casualties, after mounting criticism of Russian strikes.\nMoscow insists it has only targeted the IS group, but Washington and others suspect it has largely hit mainly Western-backed opponents of President Bashar al-Assad, with monitoring groups saying civilians have been killed.\nEU foreign affairs spokeswoman Catherine Ray said: \"We are very concerned by the reports of strikes which have hit civilians in Homs ... We call on Russia to target carefully.\"\nPressed to say if the EU believed Russia's air strikes were acceptable, she replied: \"I won't qualify the strikes as acceptable or not, as EU we are not involved in military interventions.\n\"But the fight against Daesh must be directed against Daesh,\" she said, using an Arabic acronym for the IS group.\n\"Strikes should be coordinated against Daesh and should not be targeted against civilians.\"\nRussia insists it is bombing IS jihadists and other groups it calls \"terrorists\" seeking to overthrow Assad whom the West believes has no future in Syria.\nThe US and France are also carrying out airstrikes against IS targets in Syria.\nMembers of the US-led anti-IS coalition on Friday urged Moscow to stop targeting Syrian opposition forces.", "external_links": [], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-02T22:32:06.150+03:00", "highlightTitle": ""}