{"organizations": [], "uuid": "88de2c2d8c7f927ae6a2104be798449f54ec880d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mantecabulletin.com", "main_image": "http://media.morristechnology.com/webmedia/facebook_share_images/manteca_bulletin/manteca_facebook_share_image.jpg", "site_section": "http://www.mantecabulletin.com/syndication/feeds/atom/154/", "section_title": "Pro Sports", "url": "http://www.mantecabulletin.com/section/154/article/128631/", "country": "US", "title": "US-Mexico showdown set", "performance_score": 0, "site": "mantecabulletin.com", "participants_count": 0, "title_full": "US-Mexico showdown set", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T09:11:00.000+03:00", "replies_count": 0, "uuid": "88de2c2d8c7f927ae6a2104be798449f54ec880d"}, "author": "", "url": "http://www.mantecabulletin.com/section/154/article/128631/", "ord_in_thread": 0, "title": "US-Mexico showdown set", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tweet \nIRVINE (AP) — Clint Dempsey has been immersed in the U.S. soccer rivalry with Mexico pretty much from the moment he understood what the international game means to both nations. \n“I grew up in Texas, and I played with a lot of kids from Mexico that went to my high school, and we were always talking trash,” Dempsey said. “It’s just that competitive rivalry, being so close in proximity to Mexico. It’s just exciting to have big games like that and want to win so bad. I think both countries want to be able to flex their muscles, and want to be able to have bragging rights.” \nDempsey and his U.S. teammates were already anticipating the next chapter in this lively rivalry when they went through a workout Thursday under picturesque California sunshine on the UC Irvine campus. \nThe slumping Americans face Mexico on Saturday at the sold-out Rose Bowl in a one-game playoff for a spot in the 2017 Confederations Cup in Russia, a prelude to the 2018 World Cup. \nWhile Mexico had a raucous summer that included its Gold Cup triumph and the firing of coach Miguel Herrera, the U.S. team reaches Pasadena in need of a landmark victory. Their worst Gold Cup finish in 15 years is just part of an unimpressive year that has Landon Donovan suggesting coach Jurgen Klinsmann should be fired if the Americans don’t beat Mexico on Saturday. \nThe Americans don’t appear to see it as a make-or-break moment for a team that does not start World Cup qualifying until next month. They seem more excited about the chance to play a big-time game with real stakes against their closest rivals in front of a frenzied, bipartisan Southern California crowd. \n“Just the tension that’s involved in it, the passion from both sets of supporters, from the players, it just goes so far back,” U.S. striker Jozy Altidore said. “The game means that much more each time it’s played. I think this will be one of the biggest ones to date.” \nNobody in either jersey has forgotten that these teams met on the same Rose Bowl turf four years ago in the Gold Cup final, and that Mexico rallied from an early two-goal deficit for a riotous 4-2 victory. That loss led to the departure of U.S. coach Bob Bradley, and the Americans are 3-0-3 against Mexico since Klinsmann’s tenure began. \nThe Americans are underdogs heading into this playoff game, with Mexico fielding a strong lineup despite several injury problems and an interim coaching staff. Giovani Dos Santos, the LA Galaxy star who scored Mexico’s fourth goal in the 2011 Gold Cup final, has been ruled out. \nAltidore sees an opportunity for the U.S. team to right itself after a year of unimpressive results. The veteran striker hopes he’s a part of it. \n“I’m excited, because I never really get these opportunities with the national team,” said Altidore, who hurt his hamstring during the 2011 Gold Cup and missed the final. “Always something happens to me, or I get injured or something. So knock on wood I’m OK, and I get the chance if the coach gives it to me on Saturday to take part in a special event.” \nThe Confederations Cup is a valuable World Cup prelude for the eight teams that earn a berth. Teams from every international confederation get a trial run through the stadiums and facilities for the 2018 World Cup — and for the U.S. or Mexico, the tournament provides a rare opportunity to compete against the top teams from Europe and South America with real stakes. \nBut first, the U.S. and Mexico will add another game to the local rivalry. \n“I’ve always been very proud to represent the U.S., so any time you can put on the jersey and play in a big game, it’s a dream come true,” said Dempsey, who scored seven of the Americans’ 12 goals in the Gold Cup. “It’s what you dreamed about as a little kid: playing in games like this in a packed stadium, representing your country in important games.”", "external_links": [], "published": "2015-10-09T09:11:00.000+03:00", "crawled": "2015-10-09T11:38:33.897+03:00", "highlightTitle": ""}