{"organizations": [], "uuid": "abd31f77e597f81abc5df0e8d86abed6cd245d41", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.denverpost.com", "main_image": "http://extras.mnginteractive.com/live/media/site36/2015/1017/20151017__20151018_B1_CD17ARCADE~p1.jpg", "site_section": "http://www.denverpost.com/", "section_title": "Colorado Breaking News, Sports, Weather, Traffic, Jobs - The Denver Post", "url": "http://www.denverpost.com/news/ci_28985717/arcade-liberation-lakewood-zaps-law-from-bygone-era?source=mostpopular?source=hot-topic-bar", "country": "US", "title": "Could Lakewood's repeal of a 1981 law bring the city an arcade renaissance?", "performance_score": 0, "site": "denverpost.com", "participants_count": 1, "title_full": "Could Lakewood's repeal of a 1981 law bring the city an arcade renaissance? - The Denver Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T20:01:00.000+03:00", "replies_count": 0, "uuid": "abd31f77e597f81abc5df0e8d86abed6cd245d41"}, "author": "John Aguilar", "url": "http://www.denverpost.com/news/ci_28985717/arcade-liberation-lakewood-zaps-law-from-bygone-era?source=mostpopular?source=hot-topic-bar", "ord_in_thread": 0, "title": "Could Lakewood's repeal of a 1981 law bring the city an arcade renaissance?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LAKEWOOD — The sounds of twirling joysticks and clicking buttons in arcades across this city more than three decades ago, as players pounded their way through rounds of Pac-Man, Donkey Kong and Space Invaders, often added up to trouble.\n\"There were a lot of fights, occasionally a stabbing,\" Lakewood police spokesman Steve Davis said of the Reagan-era gaming outlets. \"Some of the gang activity that was starting up back in those days would kind of hang around those arcades.\"\nIt didn't take long for Lakewood's video-game halls to turn into sketchy gathering zones that racked up calls for service at police headquarters. The city passed a law in 1981 that placed strict controls — restricted hours of operation, distance buffers from schools, minimum distances from one another — on the amusement centers.\nBut with video-game play largely having migrated to home computers and handheld devices over the past 30 years, most arcades in Lakewood and elsewhere went the way of the rotary phone.\n\"We just don't have the arcades we had in the 1980s,\" said City Clerk Margy Greer. \"With more online and Internet games, it's become something of the past.\"\nSo, quietly and with almost no discussion, city leaders on Monday acknowledged that an era that helped define early adulthood for countless Coloradans had passed.\nThe Lakewood City Council, in a unanimous vote, did away with the 1981 ordinance.\nAdvertisement Only two businesses in Lakewood — Casa Bonita and Brunswick Zone Green Mountain — still hold arcade permits. And neither attracts the kind of patrons who caused havoc a couple generations ago.\nThe feeling inside Casa Bonita's game room, where visibly aging Centipede, Frogger and Galaga game cabinets blink and beep for attention from nostalgic customers, is anything but menacing.\nOn a recent afternoon, a couple of families with young children played the skeeball machines that line one wall, while two young women faced off over a game of Spider Stompin.\nRich Babich, owner of Denver-based Game Exchange of Colorado, said the industry has morphed from independent stand-alone arcades to large amusement offerings, including Dave & Buster's, with a wide variety of games and activities set in a cavernous space.\n\"Today, these entertainment centers are vibrant, family-friendly centers,\" said Babich, who bills his business as the largest wholesale distributor of amusement devices between Iowa and the West Coast.\nTwelve-year-old Edie Gott, getting into the Halloween spirit a couple of weeks early by dressing up as the title character from \"Alice in Wonderland,\" and her father, Jeff, play Feed Big Bertha at Casa Bonita last week. ( Helen H. Richardson, The Denver Post ) The repeal of Lakewood's ordinance could have the ironic effect of luring arcades back to the city, 33 years after the number of arcades in the United States peaked at 13,000, according to media reports at the time.\nWoody Adler, owner of The 1up - LoDo and The 1up - Colfax arcade and bar, said the company is looking to open a third site in the next year.\n\"We have discussed the Lakewood-Westminster corridor,\" Adler said. \"If a community becomes friendly to our operation, we are going to look at that area for an opportunity. It sort of changes the discussion.\"\nWhile the arcade industry probably will never regain its former glory, Adler said, it speaks loudly to the 40- to 50-year-old demographic who grew up trying to post high scores on a dizzying array of games after school and on weekends.\n\"If it's in your blood, then you get excited about it,\" he said.\nIt's in 45-year-old Tom Murphy's blood. The Aurora native and professional musician used to visit the Galaxy arcade on East Colfax when he was kid to try his hand at Tron, Battlezone and Tempest. Earlier this year, he was wowed by the video-game options he found at Hyperspace, a short-lived arcade just west of Casa Bonita on Reed Street.\nThere is a \"mystique\" to playing the simple-concept, crude-interface games of the 1980s that simply isn't present in today's high-resolution, hyper-realistic video games, he said.\n\"That era of games wasn't trying to reproduce reality — it was creating this abstract environment,\" Murphy said. \"It would be really quaint to anybody playing video games today.\"\nTechnology's leaps and bounds make Lakewood City Councilman Pete Roybal, 55, feel old. He remembers dropping quarters in machines at arcades along West Colfax Avenue 35 years ago.\nShortly before he voted to spike Lakewood's arcade ordinance last week, his daughter asked him what Donkey Kong was.\n\"Now, we are becoming the elders,\" Roybal said. \"It was good while it lasted.\"\nJohn Aguilar: 303-954-1695, jaguilar@denverpost.com or @abuvthefold", "external_links": ["http://extras.mnginteractive.com/live/media/site36/2015/1017/20151017__20151018_B1_CD17ARCADE~p2.jpg"], "published": "2015-10-18T20:01:00.000+03:00", "crawled": "2015-10-19T10:05:15.675+03:00", "highlightTitle": ""}