{"organizations": ["Manchester"], "uuid": "6d7e185502668ff69bb77c32418d716ff8d29939", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.themalaymailonline.com", "main_image": "http://www.themalaymailonline.com/uploads/articles/2015-10/bruyne2310.jpg", "site_section": "http://www.themalaymailonline.com/feed/rss/sports\r", "section_title": "The Malay Mail Online | Sports", "url": "http://www.themalaymailonline.com/sports/article/de-bruyne-wants-to-steal-manchester-derby-spotlight-from-rooney", "country": "MY", "title": "De Bruyne wants to steal Manchester derby spotlight from Rooney", "performance_score": 0, "site": "themalaymailonline.com", "participants_count": 0, "title_full": "De Bruyne wants to steal Manchester derby spotlight from Rooney", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T06:04:00.000+03:00", "replies_count": 0, "uuid": "6d7e185502668ff69bb77c32418d716ff8d29939"}, "author": "", "url": "http://www.themalaymailonline.com/sports/article/de-bruyne-wants-to-steal-manchester-derby-spotlight-from-rooney", "ord_in_thread": 0, "title": "De Bruyne wants to steal Manchester derby spotlight from Rooney", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["De Bruyne", "Rooney De Bruyne"], "text": "De Bruyne wants to steal Manchester derby spotlight from Rooney Friday October 23, 2015 Print Article \nManchester City's Kevin De Bruyne celebrates scoring their second goal against Sevilla in the Champions League match at the Etihad Stadium, October 21, 2015. — Reuters pic LONDON, Oct 23 — Manchester City midfielder Kevin de Bruyne is relishing the chance to inspire his first derby victory against Manchester United when the Premier League leaders visit Old Trafford this weekend. \nDe Bruyne will experience the hostility and passion of the Manchester derby for the first time following his £55 million (RM358 million) move from Wolfsburg in August. \nThe 24-year-old Belgian has already made a big impact at City and added to his popularity with the stoppage-time goal that clinched a crucial Champions League win against Sevilla on Wednesday. \nFrom the Denis Law flick that effectively relegated United in 1974 all the way through to Mario Balotelli's unveiling of his \"why always me\" t-shirt during a 6-1 romp four years ago, City fans have always reserved a special place in their hearts for players who can inflict misery on the old enemy. \nNow De Bruyne, who has five goals in nine appearances for Manuel Pellegrini's side, has set his sights on joining the select group of City stars who have tormented United. \n“I am very excited. These are the moments you live for as a player,” De Bruyne said. \n“There will be a lot of atmosphere. Great games and derbies are the most important games for the fans. Hopefully we can do good on Sunday.” \nCity have won on three of their last four visits to Old Trafford, but they lost 4-2 there last season, a result United surprisingly achieved without a goal from Wayne Rooney. \nWith 11 career goals in the Manchester derby, Rooney has been a constant menace to City and the United captain, whose brilliant overhead kick to win the derby in 2011, would dearly love to mark his 30th birthday tomorrow with another memorable contribution. \nA Rooney-inspired triumph would be especially timely as Louis van Gaal's team will leapfrog City to the top of the table if they win and Arsenal drop points against Everton on Saturday. \nExtra importance \nThat fixture at the Emirates Stadium has assumed extra importance for Arsenal defender Per Mertesacker, who knows his side can't afford to rest on their laurels following Tuesday's vital Champions League win over Bayern Munich. \nThe Gunners have won their last three Premier League matches and Mertesacker said: “We want to play a part in the title race. We need to have a certain consistency otherwise it will be difficult. \n“But if you get good wins against the good teams then it breeds confidence.” \nAfter a dismal start to their title defence, Chelsea can only look on enviously as their rivals step up their bids to take the trophy from Stamford Bridge. \nThe Blues are languishing 10 points behind City in 12th place after a campaign scarred by lacklustre displays, rumours of dressing room rifts and outbursts from the increasingly tetchy Jose Mourinho. \nYet Chelsea captain John Terry has seen encouraging signs in the last week following a 2-0 win over Aston Villa and a gritty goalless draw against Dynamo Kiev. \n“We are a great side and we will get there with the hunger and the ambition that is in the squad,” Terry said. \n“When the chips are down, I'd take this squad over any. We've got a great squad of players. More importantly we've still got the best manager in the world. \n“Everyone's fully behind him. There's stories and this and that, but believe me everyone's together.” \nOn Sunday, Liverpool manager Jurgen Klopp will take charge of his first home Premier League match when Southampton visit Anfield. \nMeanwhile, Steve McClaren has tried to play down the significance of his first Wear-Tyne derby as Newcastle manager. \nThe Magpies head for the Stadium of Light on Sunday determined to break a run of five successive defeats against bitter rivals Sunderland, who are still waiting for their first win this season after a 1-0 defeat in new boss Sam Allardyce's first game at West Bromwich Albion last weekend. \nNewcastle are also in the relegation zone so the stakes are high, but McClaren said: “It's just another game. We don't know anything about the five previous derbies. \n“It's a fresh game and a great opportunity.” \nFixtures (1400GMT unless stated) — tomorrow \nArsenal v Everton (1630GMT), Aston Villa v Swansea, Leicester v Crystal Palace, Norwich v West Brom, Stoke v Watford, West Ham v Chelsea \nSunday \nBournemouth v Tottenham (1305 GMT), Liverpool v Southampton (1515 GMT), Manchester United v Manchester City (1305 GMT), Sunderland v Newcastle (1100 GMT) — AFP", "external_links": [], "published": "2015-10-23T06:04:00.000+03:00", "crawled": "2015-10-23T06:12:14.839+03:00", "highlightTitle": ""}