{"organizations": [], "uuid": "3382c7274ab376b061c90ddb96a37efbbec8d224", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbssports.com", "main_image": "http://cbssports.com/images/blogs/ray-lewis-amani-toomer1.jpg", "site_section": "http://www.cbssports.com/partners/feeds/rss/home_news", "section_title": "Sports News : CBSSports.com", "url": "http://www.cbssports.com/nfl/eye-on-football/25347473/ray-lewis-discusses-atlanta-murder-trial-in-new-autobiography", "country": "US", "title": "Ray Lewis discusses Atlanta murder trial in new autobiography", "performance_score": 0, "site": "cbssports.com", "participants_count": 14, "title_full": "Ray Lewis discusses Atlanta murder trial in new autobiography - CBSSports.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T01:52:00.000+03:00", "replies_count": 14, "uuid": "3382c7274ab376b061c90ddb96a37efbbec8d224"}, "author": "Ryan Wilson", "url": "http://www.cbssports.com/nfl/eye-on-football/25347473/ray-lewis-discusses-atlanta-murder-trial-in-new-autobiography", "ord_in_thread": 0, "title": "Ray Lewis discusses Atlanta murder trial in new autobiography", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In a new book released Tuesday, former NFL linebacker and future Hall of Famer Ray Lewis writes about being charged with murder in the death of two men back in 2000.\nFollowing a Super Bowl party on Jan. 31, 2000, in Atlanta, a fight broke out between Lewis and his friends, and another group of people. Jacinth Baker and Richard Lollar were stabbed to death and Lewis, Reginald Oakley and Joseph Sweeting were indicted and charged with murder and aggravated assault.\nSeveral weeks into the trial, Lewis' attorney negotiated a plea agreement and the murder charge was dismissed in exchange for his testimony against Oakley and Sweeting, Lewis pled guilty to obstruction of justice. In June 2000, Oakley and Sweeting were acquitted of the charges.\nIn the book, entitled I Feel Like Going On: Life, Game and Glory , Lewis writes about the night, noting that as he and his entourage left the party for a limousine they were approached by two men who began \"making noise, making trouble.\" But Lewis, who was wearing a white suit that was never found, says he wasn't ready to fight , per the Sporting News .\n\"Remember, I was dressed out, had my jewelry on, my fine mink coat. I wasn't about to start mixing it up looking like that. That's the general rule of thumb when you're doing the town and looking good. The nicer you're dressed, the less inclined you are to get in a fight -- that is, if you're even inclined in that way to begin with.\"\nBut before the limo could drive away, Oakley was hit in the head with a champagne bottle.\n\"But I didn't engage with these dudes,\" Lewis wrote. \"No, sir. I tried to disengage, pushing the girls back in the car, and we all piled inside.\"\nLewis said that shots had been fired at the limo, blowing out a tire. They had the limo towed, and when he returned to the hotel and turned on the television, he first learned that the two men had been stabbed to death and authorities were looking for Lewis' limo.\n\"There I was, all dressed out in my mink coat, my fine suit. Dude dresses like that, he's not looking for a fight. How I was dressed, it made no sense with what went down, those shots being fired, all of that,\" Lewis wrote. \"Forget what kind of statement my clothes might have made. Forget that I might have been a little loud, over the top. Point is, when you're dressed like that, you're off to the sidelines, and here were these gangbangers stepping out to us from the shadows, looking to make trouble -- but it was trouble we drove right past.\"\nLewis was later arrested by nine police officers who came to his house. He was taken to the courthouse and charged.\n\"The charges made no sense. Told myself, that district attorney, he would suffer for this. Told myself, Ray, you got praying folks in your corner. That was my mind-set at the time. I came at this thing from a place of rage, a place of revenge. But in the end, I would be the one to suffer. Those poor boys, they paid the ultimate price, how many things went down for them that night. But me, I was made to pay for their deaths. In the court of public opinion, I was made to pay. In the detention facilities of the city of Atlanta, Georgia, I was made to pay. I was crucified, man.\"\nLewis spent several weeks in jail. He described his time in custody as \"demonic\" and \"pure evil,\" and eventually pleaded guilty to a misdemeanor charge of obstruction of justice because he had to, according to the former Raven. Lewis also settled with the victims' families in a civil suit. \nThe settlement \"was not an admission of guilt,\" he wrote, \"it was an expression of love, of sympathy.\"\n\"I could not bring those two young men back,\" Lewis wrote. \"I had no hand in their deaths, I could not ease the suffering of those families. But I had so many blessings in my life, I told myself I could use some of those blessings for those good people. They were hurting. I was hurting. ... I knew that money would never bring back what the families wanted most. But they asked for it so I gave.\"\nI Feel Like Going On: Life, Game and Glory was written with Daniel Paisner and published by Simon & Schuster.\n\nRay Lewis played 17 NFL seasons, all with the Ravens, and won two Super Bowls. (Ryan Wilson, CBSSports.com) \n\nTopics: Ryan Wilson , Baltimore Ravens , NFL", "external_links": [], "published": "2015-10-21T01:52:00.000+03:00", "crawled": "2015-10-21T03:55:49.695+03:00", "highlightTitle": ""}