{"organizations": [], "uuid": "b9028324a372d05d5317b6277c1750a9c477e824", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wickedlocal.com", "main_image": "http://www.wickedlocal.com/storyimage/WL/20151021/SPORTS/151029030/AR/0/Hanover-boys-golf.jpg", "site_section": "http://www.wickedlocal.com/sports?template=rss&mime=xml", "section_title": "Sports - Wicked Local", "url": "http://www.wickedlocal.com/article/20151021/SPORTS/151029030/2000/NEWS?rssfeed=true", "country": "US", "title": "H.S. GOLF: Duxbury wins sectional; Hanover takes 2nd", "performance_score": 0, "site": "wickedlocal.com", "participants_count": 1, "title_full": "H.S. GOLF: Duxbury wins sectional; Hanover takes 2nd", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T08:32:00.000+03:00", "replies_count": 0, "uuid": "b9028324a372d05d5317b6277c1750a9c477e824"}, "author": "Jay N. Miller For The Patriot Ledger", "url": "http://www.wickedlocal.com/article/20151021/SPORTS/151029030/2000/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "H.S. GOLF: Duxbury wins sectional; Hanover takes 2nd", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Oct. 21, 2015 at 12:25 AM Updated at 12:32 AM EASTON – Their own coach has been calling them “underachievers” all season, and the Duxbury High boys golf team has struggled to find its mojo this fall. But with all the chips on the table at Tuesday’s Division 2 South (Cape & Islands) Sectional qualifier, the Green Dragons re-asserted their dominance with a decisive first-place finish. While Duxbury’s score of 299 bested the other dozen teams playing at Easton Country Club by 14 strokes, junior Alex Jamieson posted the best individual score, with a 1-under-par 70. That gave him a four-stroke edge over a quartet of runners-up that included Drew Cratty of Hanover, Dillon Brown of Silver Lake and Cole Manning of Whitman-Hanson. Tuesday’s action determined teams, and individuals, which would advance to Monday’s Div. 2 state tournament at Crumpin-Fox Club in Bernardston. While Jamieson will lead 11 of his fellow Cape & Islands golfers into individual competition, only two teams advanced to states. That was a surprise to many, particularly Hingham, which took third place at 318, behind runner-up Hanover (313). After a fine 13-3 season, the Harbormen will be going home, except for senior captain Andrew Spaziani, whose 75 (tied for sixth overall) earned him a slot in the individual class. “They kind of pulled the rug out from under us when they announced just two teams would be going on,” Hingham coach Jack Curran said. “With 13 teams in our Sectional, we thought they’d take three teams, so it is frustrating. We just lost a dual match to Hanover by a stroke last week, and we split this season with Duxbury, so we were in the mix all year. Six teams from our league (Patriot League) made the states, so it was a good league, and we had a good year.” Spaziani was one of just two seniors on this year’s Hingham squad, so their success this fall has been a pleasant surprise. “We’ve had some kids really come on and improve greatly,” said Curran. “Sophomores Rich Miller (82) and Dylan Parnell (82), and junior Chris Boyd (80) really came on strong, and junior Aidan Cusack (80) really put his game together this season and moved up the most of anyone. So, we were somewhat pleased to take third place in this Sectional, but we felt we deserved to go further.” Duxbury, on the other hand, had not enjoyed the cruise through the league season that everyone expected after the Dragons lost the state title by just two strokes last year. “This has been an underachieving group, and I’ve been on them all year,” said Duxbury coach Jack Stoddard. “The only one who hasn’t been under-achieving is Alex Jamieson. But last week, finally, they started to play better. Page 2 of 2 - “Last year, going as far as we did, most of them were just sophomores, so we assumed they’d be better this year. But they’ve been going out and scoring about 10 strokes over their team scores from last year. They kept telling me they’d pull it all together at the end, and they can be very proud today to have proven themselves right, and me wrong.” If Duxbury was the known quantity, Hanover’s young team really peaked this fall, with a 16-1 season in which their only loss was to the Dragons. With sophomores Cratty (74) and Luke Smigliani (tied for sixth with a 75) leading the way, the Indians secured their team spot at states, while the dynamic duo also qualified as individuals. “I’m not surprised by today’s performance at all, because I’ve seen the way they worked all season,” said Hanover coach Jay Durfee. “I’m also convinced their best golf is yet to come. The majority of our team is underclassmen, and our two best and most consistent players are sophomores. We are really proud of the rounds they played today. “Duxbury breaking 300 is really an outstanding day. We played hard to the end of the regular season, and wanted something like this to keep our season going. Our goal was to go to the states as a team, but having two individuals also qualify is also a very good result.” Duxbury will have three golfers competing for Monday’s state individual crown as Jamieson will be joined by Matt Daley and Hunter Smith, who each shot 76 to finish in a four-way tie for eighth. Jamieson came into Tuesday’s round knowing he was the one to beat. “I’ve never done too great here,” said Jamieson, who noted he only plays at Easton CC in these type of Sectionals. “This is probably my fifth time here, but I hit 16 greens, which is good. But I wasn’t really putting that well. “I think what has helped me this year is just the experience – I’ve been playing these since freshman year, and I realize now that it is just golf, just one round, and whatever happens will happen.” *** Junior Johnny Antaya (77) was Duxbury’s fourth scorer, missing a slot in the individual state competition by a stroke. Nick Stewart (82) and Brendan Kates (87) rounded out the Duxbury lineup and will be part of the team competition on Monday. ... Hanover’s other scorers were John Carroll (81) and Charlie Banks (83). Also competing for the Indians were Colin Cleaves (85) and Christian Abbatte (89). ... Pembroke (334) was seventh in team scoring, led by Ryan Gibbons (80). ... Silver Lake (335) was eighth, led by Brown and James McKenna (82). ... Scituate (342) was 10th, led by Cole DeFreitas (81) and Christine Cutting (85). By Jay N. Miller", "external_links": [], "published": "2015-10-21T08:32:00.000+03:00", "crawled": "2015-10-21T08:35:43.870+03:00", "highlightTitle": ""}