{"organizations": ["MLB"], "uuid": "48c6ebc2efd37dc1dec65e3b87a8748a06530e5a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.indystar.com", "main_image": "http://www.gannett-cdn.com/-mm-/f21767a737e592a0d547173917625514b85bb872/c=0-25-848-504&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/22/Indianapolis/Indianapolis/635811472691520612-MLBawards.jpg", "site_section": "http://rssfeeds.indystar.com/indystar/allsports", "section_title": "Indystar - All Sports", "url": "http://www.indystar.com/story/sports/high-school/2015/10/23/hs-boys-tennis-finals-north-central-players-advance-semifinals/74481352/", "country": "US", "title": "IndyStar's MLB award picks", "performance_score": 0, "site": "indystar.com", "participants_count": 0, "title_full": "IndyStar's MLB award picks", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T23:56:00.000+03:00", "replies_count": 0, "uuid": "48c6ebc2efd37dc1dec65e3b87a8748a06530e5a"}, "author": "", "url": "http://www.indystar.com/story/sports/high-school/2015/10/23/hs-boys-tennis-finals-north-central-players-advance-semifinals/74481352/", "ord_in_thread": 0, "title": "IndyStar's MLB award picks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Nat Newell", "Manny Randhawa"], "text": "Manny Randhawa and Nat Newell , nat.newell@indystar.com 4:56 p.m. EDT October 23, 2015 MLB awards 1 CONNECT 11 TWEET LINKEDIN COMMENT EMAIL MORE \nWith the World Series set to begin Tuesday, IndyStar's Manny Randhawa and Nat Newell make their picks for MVP, Cy Young and Rookie of the Year award winners in each league: Manny Randhawa National League Most Valuable Player: Bryce Harper, Nationals \nBryce Harper led the majors with a 1.109 OPS in 2015. (Photo: USA TODAY Sports) \nThis is the easiest choice on the list. Harper had an incredible season at the plate, posting a .330/.460/.649 slash line with 42 home runs and 99 RBIs. The outfielder's 9.9 wins above replacement were tied for first in baseball with Dodgers pitcher Zack Greinke. He led the league in runs scored (118), home runs, on-base percentage, slugging percentage and OPS. His 1.109 OPS was 104 points higher than the next closest hitter, the Diamondbacks' Paul Goldschmidt. And at 23 years old, this won't be Harper's last MVP award. American League Most Valuable Player: Josh Donaldson, Blue Jays \nJosh Donaldson had a big August, helping propel the Blue Jays to an American League East title. (Photo: USA TODAY Sports) \nNat Newell will argue for Mike Trout. And Trout has a great case. If you go with most of the metrics, Trout's your guy -- he has the superior OPS, he's created more runs and he has a higher WAR (9.4 to Donaldson's 8.8). \nBut Donaldson was more valuable to the Blue Jays in getting them to the postseason, than Trout was to the Angels, who finished third in the American League West. Donaldson posted a 1.101 OPS in the second half of the season, helping fuel Toronto's run to an A.L. East title. Trout's second-half OPS was a respectable 956, but he slumped badly in August (.218/.352/.337) and the Angels went 10-19 (dropping from 2 games back in the West to 6 1/2). Donaldson hit .324/.408/.724 that month with 11 home runs and 35 RBIs in 27 games. The Blue Jays went 21-6. \nOverall, Donaldson has MVP numbers: .297/.371/.568 with 41 home runs and a league-leading 123 RBIs. National League Cy Young: Jake Arrieta, Cubs \nCubs right-hander Jake Arrieta had the greatest second half of a season by a starting pitcher in MLB history. (Photo: USA TODAY Sports) \nThis one is a three-man race, and by the looks of it, the vote had to have been one of the closest ever. Dodgers starters Zack Greinke and Clayton Kershaw, and Cubs ace Jake Arrieta are all deserving of the award. But two of them won't get it. \nGreinke finished with the lowest ERA among the three: 1.66. But a historic second half surge nearly helped Arrieta eclipse that; Arrieta finished with a 1.77 ERA. Kershaw's ERA was 2.13, but he led the majors in innings pitched (232 2/3) and strikeouts (301). Greinke had the highest WAR of any pitcher in baseball -- 9.9, tied with Bryce Harper for the MLB lead. Arrieta's was 8.9 and Kershaw's was 7.6. \nBut here's where Arrieta has the pair of Dodgers hurlers beat: He had the most dominant second half of any starting pitcher in baseball history. Arrieta's ERA after the All-Star break was 0.75 (9 earned runs in 1071/3 innings pitched). Over that span, Arrieta went 12-1 and had twice as many strikeouts (113) as hits allowed (55). His dominance was unprecedented, and it should earn him his first Cy Young trophy. American League Cy Young: David Price, Blue Jays \nDavid Price was 9-1 with a 2.30 ERA after being traded to the Blue Jays. (Photo: USA TODAY Sports) \nAnother close race between Price and Houston's Dallas Keuchel, but Price edges out Keuchel based on superior numbers down the stretch. Overall, both southpaws have similar stats: Keuchel went 20-8, Price 18-5. Price posted a 2.45 ERA, Keuchel a 2.48. Keuchel's WHIP was a league-best 1.02. Price wasn't far behind, at 1.08. Price had the edge in strikeouts (225 to 216). \nBut with the Astros fighting -- ultimately unsuccessfully -- to hold off the Rangers for a division title during the season's final month, Keuchel came down to earth; he went 4-2 with a 3.66 ERA. Meanwhile, Price -- newly acquired by the Blue Jays from the Tigers -- was a perfect 5-0 with a 2.32 ERA in September. With Toronto, he was 9-1 with a 2.30 ERA in 11 starts. National League Rookie of the Year: Kris Bryant, Cubs \nCubs rookie Kris Bryant hit 26 home runs and had 99 RBIs in 2015 for Chicago. (Photo: USA TODAY Sports) \nHe led the majors with a Cubs franchise record 199 strikeouts in 2015, but he also hit 26 home runs and drove 99 runs in. Bryant, the highly-touted phenom out of Chicago's farm system, finally burst onto the MLB scene and showed signs of a bright future. Bryant's chief competition in the N.L. Rookie of the Year race this season was Mets right-hander Noah Syndergaard. Syndergaard posted a 9-7 record with a 3.24 ERA in 24 starts for New York. But Bryant's everyday production in the middle of the lineup for a playoff contender puts him over the top. American League Rookie of the Year: Carlos Correa, Astros \nCarlos Correa drove in 68 runs in 99 games for the Astros in 2015. (Photo: USA TODAY Sports) \nAnother intriguing race. Both Houston's Correa and Cleveland's Francisco Lindor played in the same number of games (99) and had roughly the same number of plate appearances (432 for Correa, 438 for Lindor) in 2015. But Correa has slightly better numbers overall and played for a contender throughout the season, whereas Lindor's at-bats came for a team that finished 13 1/2 games out in the American League Central. \nLindor has Correa beat with a .313 batting average to Correa's .279. But Correa had a better OPS (.857 to .835), more home runs (22 to 12) and RBIs (68 to 51). Lindor is the better defensive player, but with the Astros in the hunt all season and eventually reaching the playoffs, it's Correa by a nose. Nat Newell National League Most Valuable Player: Bryce Harper, Nationals \nBryce Harper had a season of historic proportions in 2015. (Photo: USA TODAY Sports) \nLet’s start with the easiest pick. Harper led Major League Baseball in on-base percentage (.460) and slugging (.649, Mike Trout was No. 2 59 points behind him). If you like more traditional numbers, he led the National League in runs (118), homers (42), drove in 99 runs, walked 124 times and hit .330, finishing second for the batting title. The only players to post comparable numbers at a similar age (Harper is 23) – Ted Williams, Eddie Mathews, Mel Ott – are all in the Hall of Fame. Harper’s got maturity issues but if you hit 42 homers for me, I’m OK if you don’t run out a fly ball on occasion. Harper should be a unanimous MVP. American League Most Valuable Player: Mike Trout, Angels \nMike Trout is the reigning American League Most Valuable Player, and could add another MVP award to his name. (Photo: USA TODAY Sports) \nI won’t argue if you prefer Josh Donaldson. His counting stats are better (122 runs, 123 RBIs vs. 104 runs, 90 RBIs) and he led his team to the postseason but Trout was just a little bit better in the statistics I put more weight on: Slugging, .590 vs. .568 and on-base percentage, .402-.371. \nWhile I understand factoring in team success in the MVP voting, the Angels had a strong season and I won't fault Trout for not being surrounded by more talent. National League Cy Young: Zack Greinke, Dodgers \nZack Greinke was dominant all season, posting an MLB-best 1.66 ERA. (Photo: USA TODAY Sports) \nA fun debate. Greinke and Jake Arrieta would be Cy Young winners almost any season but they both chose 2015 to have monster seasons. Arrieta is, of course, the local favorite but I’m going with Greinke. His record (for what it’s worth) is better (19-3 vs. 22-6) and he’s got the edge in ERA (1.66 vs. 1.77). Arrieta has the edge in Fielding Independent Pitching (2.35 vs. 2.76; which looks at performance without factoring in defense) and he and the Cubs are the better story, but my vote goes to Greinke. Kershaw is a worthy contender but a half-step behind these two. American League Cy Young: Dallas Keuchel, Astros \nHouston's Dallas Keuchel was the American League's only 20-game winner in 2015. (Photo: USA TODAY Sports) \nWhile Manny seemed to be picking winners for year-long award based solely on the month of August, I thought this was an easy choice. David Price had another excellent season but Keuchel (20-8, 2.48 ERA, 232 innings, 216 strikeouts) is better. No one saw this coming. He posted a 5.00+ ERA his first two seasons in Houston after a minor league career that gave no indications of a future Cy Young-worthy performance. He broke out last year (12-9, 2.93 ERA) and was a key factor in the Astros emerging from nowhere to make the postseason. National League Rookie of the Year: Kris Bryant, Cubs \nKris Bryant hit 26 home runs and drove in 99 runs in his rookie campaign for the Cubs. (Photo: USA TODAY Sports) \nIt was a monster year for National League rookies so it’s only fair the debate comes down to 6-5, 215-pound Kris Bryant and Noah “Thor” Syndergaard. The choice is Bryant, who hit .275 with a .369 on-base percentage and a .488 slugging percentage, along with 26 homers, while handling third base and the outfield. Syndergaard (9-7, 3.24 ERA, 166 strikeouts in 150 innings) has been a key factor in the resurgence of the Mets but the (almost) full season by Bryant gives him the edge. American League Rookie of the Year: Carlos Correa, Astros \nCarlos Correa posted an .857 OPS for the Astros in his rookie season. (Photo: USA TODAY Sports) \nThe American League can’t compare to the National League but it’s still strong. The pick is Houston’s Carlos Correa over Francisco Lindor of Cleveland. Correa hit .279 with a .345 on-base percentage and a .512 slugging percentage, blasting 22 homers and stealing 14 bases while handling shortstop. Lindor has a Gold Glove reputation at short and exceeded expectations at the plate (.313/.353/.482), hitting 12 homers and 12 steals. With defense, it’s a close call but I’m not buying Lindor as an .800+ OPS hitter (yet) so give it to Correa. 1 CONNECT 11 TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http://indy.st/1S1ji1O TOP VIDEOS", "external_links": [], "published": "2015-10-23T23:56:00.000+03:00", "crawled": "2015-10-24T11:23:00.306+03:00", "highlightTitle": ""}