{"organizations": ["Manchester United", "Arsenal Blow United Away With Early Goals Arsenal Blow United", "Arsenal"], "uuid": "c6fe9a62caed1949289ec1b0b1254debcf08d041", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.sky.com", "main_image": "http://media.skynews.com/media/images/generated/2015/10/5/422250/default/v1/gettyimages-491298930-1-1600x900.jpg", "site_section": "http://feeds.skynews.com/feeds/rss/sports.xml", "section_title": "Sports News - Latest Sports and Football News | Sky News", "url": "http://news.sky.com/story/1563907", "country": "IL", "title": "Arsenal Blow United Away With Early Goals", "performance_score": 0, "site": "sky.com", "participants_count": 0, "title_full": "Arsenal Blow United Away With Early Goals", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T08:01:00.000+03:00", "replies_count": 0, "uuid": "c6fe9a62caed1949289ec1b0b1254debcf08d041"}, "author": "", "url": "http://news.sky.com/story/1563907", "ord_in_thread": 0, "title": "Arsenal Blow United Away With Early Goals", "locations": ["UK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Arsene Wenger"], "text": "Arsenal Blow United Away With Early Goals 06:01, UK, Monday 05 October 2015 Share by email Arsenal justified Arsene Wenger's pre-match title talk as three early goals blew away Manchester United at the Emirates. \nAlexis Sanchez (6) and Mesut Ozil (7) scored within 33 seconds before the Chilean belted a third to leave United three-down inside 20 minutes for the first time in the Premier League era. \nPetr Cech made a big stop from Anthony Martial right on half-time and United did improve after the break, but that was as much down to Arsenal re-evaluating their ambition as anything else, and three times counter-attacks almost brought a fourth goal. \nThe result leaves Arsenal two points behind Manchester City, the margin of victory enough to take them above United into second place. \nBoth managers had talked up the importance of the day in the build-up, Wenger calling it the season's \"first massive game\" and Louis Van Gaal suggesting three points would give his side the belief to mount a title challenge. \nFew bought into Wenger's pre-match insistence that Arsenal can win this season's Premier League, but the Arsenal manager's apparently unyielding faith in his players proved justified as they produced a positive response to their latest Champions League chastening. \nThe manager's message had clearly got across as his players rattled into United from the start: Sanchez tore terrifyingly at Matteo Darmian, Ozil demanded the ball and Gabriel unsuccessfully claimed a penalty as Bastian Schweinsteiger took an armful of his midriff from a corner. \nAnd there was a sense of the inevitable even so early in the game when Ozil got the byline and cut back a right-footed centre for Sanchez to flick the ball behind his standing leg and beyond a committed David De Gea. \nUnited had barely restarted when their pockets were picked again in midfield, Ozil shovelling a pass for Theo Walcott, who checked back and returned the favour for the German to side-foot a second. Just 33 seconds separated the goals. \nUnderpinning Arsenal's start was the composure of Santi Cazorla, who dictated play from deep and even mucked in to get his full-backs out of a hole here and there as the half wore on. \nAnd then there was Sanchez. Arsenal switched from right to left in the blink of an eye, and last season's top scorer continued to put a sluggish couple of post-Copa America months behind him as he cut in to hammer a rising shot to De Gea's left. Six goals in three games say Sanchez is back. \nAaron Ramsey should have had Arsenal out of sight only to volley off target, and when Martial spun Per Mertesacker to force a left-legged stop from Cech there was a palpable sense of nervousness among supporters who last season saw their side throw away a three-goal lead against Anderlecht. \nThey need not have been so concerned. Van Gaal's introduction of Marouane Fellaini gave United midfield muscle, but Wenger responded by asking Aaron Ramsey to tuck in as his side kept their shape and relied on Mertesacker and Gabriel to defend their 18-yard line. \nCech made a routine stop from Wayne Rooney and was allowed to make another by Schweinsteiger's poor touch, while at the other end Ozil and substitute Olivier Giroud swept first-time shots straight at De Gea. \nBy added time the Arsenal supporters had allowed themselves to relax, and Alex Oxlade-Chamberlain almost capped the day as he lifted Hector Bellerin's pass against the bar. Promoted Stories", "external_links": [], "published": "2015-10-05T08:01:00.000+03:00", "crawled": "2015-10-05T08:43:05.848+03:00", "highlightTitle": ""}