{"organizations": [], "uuid": "74c50a1fd1d2259918cdeed258fecfe0be510d4d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theleafchronicle.com", "main_image": "http://www.gannett-cdn.com/-mm-/1dc7156d51a711e6f143400ff2b81a36f7298003/c=0-109-500-391&amp;r=x633&amp;c=1200x630/local/-/media/2015/09/25/TNGroup/Clarksville/635787845644315876-CLR-Presto-cmcss.jpg", "site_section": "http://rssfeeds.theleafchronicle.com/clarksville/sports", "section_title": "Clarksville - Sports", "url": "http://www.theleafchronicle.com/story/sports/high-school/2015/10/16/clarksville-high-football-player-ineligible-parents-appeal/74086326/", "country": "US", "title": "Ex-Clarksville High player's family wants answers", "performance_score": 0, "site": "theleafchronicle.com", "participants_count": 0, "title_full": "Ex-Clarksville High player's family wants answers", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T05:13:00.000+03:00", "replies_count": 0, "uuid": "74c50a1fd1d2259918cdeed258fecfe0be510d4d"}, "author": "", "url": "http://www.theleafchronicle.com/story/sports/high-school/2015/10/16/clarksville-high-football-player-ineligible-parents-appeal/74086326/", "ord_in_thread": 0, "title": "Ex-Clarksville High player's family wants answers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ex-Clarksville High player's family wants answers George Robinson, grobinson@theleafchronicle.com 9:13 p.m. CDT October 16, 2015 CMCSS logo 48 CONNECT 11 TWEET LINKEDIN COMMENT EMAIL MORE \nCLARKSVILLE, Tenn. — The parents of the Clarksville High football player who was ruled ineligible by the TSSAA last week after the school self-reported an investigation into his residency have requested an appeal by the Clarksville-Montgomery County School System to allow their children to attend the school. \nStacey and Michael Fair Sr. have retained Clarksville lawyer Mark Olsen, who sent a letter to CMCSS Director of Schools B.J. Worthington and Director of Student Services Mary Davila Friday afternoon asking that the school system reverse its decision. If there is no response from the school system by Monday, Olsen said he may file suit. \nIn the letter, Olsen is seeking a response from the school system regarding the Fair family's situation. \n\"I am informed that there is a claim there is no available appeal of recent decision,\" the letter states. \"If this is the case, let me know as I will take action to get this matter resolved right away by Court action.\" \nStacey Fair sat down with The Leaf-Chronicle Friday afternoon to explain what has transpired the past couple of weeks. \nFair and her husband, Michael Fair Sr., were divorced for 10 years prior to recently reconciling and re-marrying. Stacey moved her three children from North Carolina to Clarksville this past summer and into an apartment complex across from Richview Middle School that is in the Clarksville High School zone. \n\"It's been very difficult on my children and my family,\" Stacey Fair said. \"My kids have never lived in Clarksville. I've never lived here. We initially didn't want to pack up and move our children while they were in high school, but we did because we, as parents, felt it was important for our kids to see that family dynamic. We've had our struggles, and we continue to struggle at times, but we did what we felt was best for our kids so we moved here.\" \nMichael Fair, who was stationed at Fort Campbell but retired from the Army two years ago, was living in a house in Northeast High's zone prior to re-marrying. His brother currently lives at that residence. \nThe apartment that the Fairs lease has been at the center of the issue regarding Clarksville High having to forfeit five of its six wins this season over the eligibility of junior wide receiver Michael Fair Jr. Ineligible player will result in CHS forfeiting 5 games \nMichael Fair Jr. was ruled ineligible by the Tennessee Secondary School Athletic Association last Friday, a day after the Wildcats' win against Northeast. Michael Fair Jr. did not play in that Northeast game so CHS was allowed to keep that victory. But the loss of those prior wins dropped the Wildcats out of the playoff picture with two games remaining on the regular season schedule. \nStacey Fair said she has provided the school system with documentation that suggests the family's primary residence is the apartment complex across from Richview Middle and that she and her husband only use the house address for work purposes. She said when she and her children moved to Clarksville last July she chose an apartment complex across from Richview because of its close proximity to the middle and high school. \n\"We own our own business and so often that requires us to spend time out of town quite a bit,\" Stacey Fair said. \"We do often work out of that house, but we live at our apartment. But the apartment is within walking distance of the school, and if me and my husband are out of town with work, I want my children to be able to get home quickly and easily.\" \nStacey Fair said she provided the school system with copies of their apartment lease agreement, water bills and electric bills on Oct. 5. The next day, she said the school system's Support Coordinator, Brett Burchwell, left his business card at the apartment requesting the Fair family to contact him. Stacey Fair said she tried on numerous occasions to speak with Burchwell but has yet to hear from him. \nWhile Stacey Fair says she's willing to fight for her son's athletic eligibility, her main goal is to have her children attending school. Her daughter was a member of the Clarksville High JV soccer team while her youngest son attended Richview Middle. All three are currently not enrolled at any school. \n\"I have asked Mary (Davila) what determines primary and secondary residence,\" Stacey Fair said. \"She said, 'Where they lay their head at night.' So I'm like, no question, that's the apartment. Then as the week went on, she tells me, 'Well, it's the parents' primary residence,' and she says that's at the house. Well that's not true because me and my kids moved from North Carolina, and the only place we have physically lived in is at that apartment.\" \nStacey Fair said she again asked what determines primary and secondary residence. \n\"Mrs. Davila won't give it to me,\" Stacey Fair said. \"She won't give me anything in writing.\" \nOlsen said if he doesn't hear from the school system Monday he will file suit as soon as the Fair family gives him permission. \n\"Here's the problem,\" Olsen said. \"They've made an arbitrary decision about where these people live. That decision prohibits that young man from participating in sports, and it's affected the remainder of the football team. And it's all incorrect. And why they are acting this way and taking this action just seems, to me, to be beyond belief. And I don't know where it's coming from.\" \nReach Prep writer George Robinson at 931-245-0747 and on Twitter @Cville_Sports. 48 CONNECT 11 TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http://leafne.ws/1RNsHK1 TOP VIDEOS", "external_links": [], "published": "2015-10-17T05:13:00.000+03:00", "crawled": "2015-10-17T08:13:49.208+03:00", "highlightTitle": ""}