{"organizations": [], "uuid": "d6788725dc3696b389e94a132e87d2b550102d83", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newsday.com", "main_image": "http://cdn.newsday.com/polopoly_fs/1.10963247.1444877425!/httpImage/image.JPG_gen/derivatives/display_600/image.JPG", "site_section": "http://www.newsday.com/sports", "section_title": "NY Sports News - Newsday - Scores, Schedules, News &amp; Standings | Newsday", "url": "http://www.newsday.com/sports/baseball/emotionally-charged-marcus-stroman-helps-pitch-blue-jays-to-alcs-1.10964234", "country": "US", "title": "Emotionally charged Marcus Stroman helps pitch Blue Jays to ALCS", "performance_score": 0, "site": "newsday.com", "participants_count": 1, "title_full": "Emotionally charged Marcus Stroman helps pitch Blue Jays to ALCS | Newsday", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T06:26:00.000+03:00", "replies_count": 0, "uuid": "d6788725dc3696b389e94a132e87d2b550102d83"}, "author": "ERIK BOLAND", "url": "http://www.newsday.com/sports/baseball/emotionally-charged-marcus-stroman-helps-pitch-blue-jays-to-alcs-1.10964234", "ord_in_thread": 0, "title": "Emotionally charged Marcus Stroman helps pitch Blue Jays to ALCS", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "TORONTO - Marcus Stroman was asked the same question as everyone else in the champagne and beer-doused Blue Jays clubhouse.\nAnd the 24-year-old righthander from Patchogue-Medford High School gave the same answer.\nMost popular baseball stories Greinke's future up in air after Game 5 With season on line, Mets turn to Jacob deGrom Mets must find way to ruin Greinke's paint job Blue Jays win wild Game 5, reach ALCS Why did deGrom warm up during Game 4? Had he ever been a part of that kind of game?\nData LI baseball stars drafted by MLB teams all-time \"Absolutely not,\" Stroman said after his club advanced to the ALCS with a 6-3 victory. \"This was an emotional roller coaster for sure. Lot of ups and downs.\"\nStroman experienced plenty of that himself as the Blue Jays starter, though it was more of the former. Making his second start of the series, Stroman allowed two runs, six hits and one walk, striking out four in six innings, leaving with the score tied at 2.\n\"Just what you expect from Stroman,\" catcher Russell Martin said. \"He's a superstar. He gets the job done. He takes the ball in big situations. Since the first time he took the ball this year he's been unbelievable. He's a guy you can rely on in any moment.\"\nThe always emotionally charged Stroman, making the biggest start of his young career, mostly went pitch for pitch with Rangers lefthander Cole Hamels, who came in 7-4 with a 3.05 ERA in 14 career postseason outings.\n\"I was going up against one of the best arms to pitch in playoff history and I went with him every step of the way,\" Stroman said. \"I did everything in my power to put my team in position to win. I knew we were bound to break out at some point and we did it.\"\nBaseball Blue Jays win wild Game 5, reach ALCS That Stroman even took the mound this season, let alone in a Game 5, was an upset of sorts. The righthander tore his ACL March 10 but, with the help of doctors at Duke where he finished up work for his degree, made it back by September, going 4-0 with a 1.67 ERA down the stretch.\n\"This is why I put in the hours, this is why I did six-hour workouts,\" Stroman said. \"It's all worth it now. This is what it was for. To be back with my brothers, bringing this to this city, it's been so special.\"\n ", "external_links": ["http://www.adobe.com/go/getflashplayer", "http://static.eplayer.performgroup.com/flash/js/performgroup.js", "http://images.eplayer.performgroup.com/namedImage/12637/install_flash.gif", "http://static.eplayer.performgroup.com/flash/js/swfobject.js"], "published": "2015-10-15T06:26:00.000+03:00", "crawled": "2015-10-15T19:38:30.655+03:00", "highlightTitle": ""}