{"organizations": [], "uuid": "e00578e780df9db33e55e32fe6aab2d33e7f884d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pr.com", "main_image": "", "site_section": "http://www.pr.com/news-by-category/157", "section_title": "Sports: Boxing Press Releases and News - PR.com", "url": "http://www.pr.com/press-release/641385", "country": "US", "title": "Man on Fire: Hot Rod Annihilates Domingos in Lakeland", "performance_score": 0, "site": "pr.com", "participants_count": 1, "title_full": "Man on Fire: Hot Rod Annihilates Domingos in Lakeland - PR.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "e00578e780df9db33e55e32fe6aab2d33e7f884d"}, "author": "PR.com", "url": "http://www.pr.com/press-release/641385", "ord_in_thread": 0, "title": "Man on Fire: Hot Rod Annihilates Domingos in Lakeland", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Man on Fire: Hot Rod Annihilates Domingos in Lakeland\nLakeland, FL, October 13, 2015 --( PR.com )-- Undefeated light heavyweight Radivoje “Hot Rod” Kalajdzic wasted no time in getting rid of Brazilian power puncher Gilberto Domingos yesterday evening at the Florida Orange Event Center in Lakeland.\nHeadlining Mad Integrity Fight Sports' “Bombs Away 4,” Kalajdzic had a vocal group of supporters backing him and was on the attack from the opening bell. Kalajdzic connected with quick punches to Domingos' mid section, hurting him just seconds into the fight. A visibly hurt Domingos unsuccessfully attempted to move and tighten his guard, finding himself on the canvas courtesy of a stinging combination. Moments later, the popular Saint Petersburg, FL resident unleashed another combination to deck Domingos for a second time, mercifully forcing the stoppage at 1:32 in the first of a scheduled eight rounds.\n“He left his body open and I knew if I connected he'd go down,” said Kalajdzic, who moved up to cruiserweight for this fight to accommodate Domingos and is now 20-0 with 13 wins by knockout. “It feels great to fight (close to home) and I would love to keep fighting here. I don't care who I fight as long as the money is right, but I'll let (my promoter) Lou DiBella handle that.”\nDomingos returns to Sao Paulo, Brazil with a record of 24-4 (21 KO's).\nIn the co-feature, hometown favorite Leanthony “Tyga” Fleming won a competitive decision against a very game Randy Hedderick. Coming in at a fit and ready 146.2 lbs, Fleming showed good movement ring generalship, leading with his jab throughout the bout. Hedderick wasn't intimidated by fighting on the road and effectively pressured the Lakeland native in spurts.\nScores were 40-36 and 39-37 twice. Fleming is now 1-1 while his Gulfport, MS based foe slips to 0-5.\nMiami's Armando “The Gentleman” Alvarez, 8-0 (4 KO's) dominated grizzled veteran Juan Aguirre, 6-16-1, of Jacksonville, FL. The long and lean Alvarez consistently connected with sharp punches, maintaining an impressive pace throughout the six round junior middleweight contest. Aguirre, who took many clean punches, was never in serious danger of being stopped and displayed a great chin.\nAll three judges scored the contest 60-54.\nIn the fight of the night, Clearwater, FL's Alex Nicholson scored a dramatic second round knockout of fellow debuting heavyweight Joseph White. Nicholson, who was outweighed by 40 pounds, nearly dropped White for the count at the end of the first but the Miamian made it back to his feet a split second before the bell sounded. In the second, White temporarily turned the tides by rocking Nicholson. Damaged but not defeated, Nicholson unleashed a vicious hook that put White down for the count at 2:24.\nIn other undercard bouts, junior lightweight Michael Guillen twice dropped and dominated Curtis Vert, while Wytama Faulk edged out Clark Brightwell in a lightweight contest.\nPrior to the main event, Mad Integrity Fight Sports presented a birthday cake to close friend and junior middleweight contender “Silky” Wilky Campfort while recognizing notable fighters in attendance including uncrowned junior lightweight champion Edner Cherry. Fans were also treated to an outstanding rendition of the national anthem by American Idol finalist Jeremy Rosado.\n“Everybody in attendance had a good time,” said Joey Orduna of Mad Integrity Fight Sports. “We had exciting bouts and some outstanding performances by talented up and coming fighters. There has been a lot of activity in Central Florida as of late and we look forward to continue promoting in this area.”\nFor the latest news on Mad Integrity Fight Sports, visit Facebook.com/MadIntegrityFightSports.\nContact: Matt Yanofsky (Publicist) – 551-206-0578 or @kopublicity", "external_links": [], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-22T20:32:40.652+03:00", "highlightTitle": ""}