{"organizations": ["Seahawks"], "uuid": "41517cba98b75331d33ba347758971b4286d0224", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wralsportsfan.com", "main_image": "http://wwwcache.wralsportsfan.com/asset/football/nfl/2015/10/23/15002132/76abb12b8d3d475384de194e7999fb84-Photo-1-700x485.jpg", "site_section": "http://www.wralsportsfan.com/news/rss/697/", "section_title": "Sports Fan stories from WRAL.com", "url": "http://www.wralsportsfan.com/wilson-seahawks-rule-rivalry-with-49ers-again-in-20-3-win/15002132/", "country": "US", "title": "Wilson, Seahawks rule rivalry with 49ers again in 20-3 win", "performance_score": 0, "site": "wralsportsfan.com", "participants_count": 0, "title_full": "Wilson, Seahawks rule rivalry with 49ers again in 20-3 win", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T18:07:00.000+03:00", "replies_count": 0, "uuid": "41517cba98b75331d33ba347758971b4286d0224"}, "author": "", "url": "http://www.wralsportsfan.com/wilson-seahawks-rule-rivalry-with-49ers-again-in-20-3-win/15002132/", "ord_in_thread": 0, "title": "Wilson, Seahawks rule rivalry with 49ers again in 20-3 win", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Wilson"], "text": "Wilson, Seahawks rule rivalry with 49ers again in 20-3 win \nPosted 11:03 a.m. today Your friends e-mail addresses (comma separated): * Subject: * You must enter the characters with black color that stand out from the other characters More on this 11 Images By JANIE McCAULEY, AP Sports Writer \nSANTA CLARA, Calif. — Menacing defender Michael Bennett has a new motto for these inconsistent Seattle Seahawks: Keep chopping wood. \n\"When you're chopping wood, just keep chopping until the tree falls, man,\" Bennett said. \"You can't get ahead of yourself.\" \nSeattle, looking to regain its status as a contender, certainly took a step on that path Thursday night. The defending NFC West champions delivered a commanding 20-3 victory against the San Francisco 49ers four days after a tough loss at home to Carolina. \nRussell Wilson threw a 43-yard touchdown pass to Tyler Lockett late in the first half and Marshawn Lynch added a leaping 1-yard score to send Seattle (3-4) to its fourth straight victory over its division rival. \nThe Seahawks have beaten the 49ers six of the last seven times, holding them to single digits in the past three, outscoring them 56-13. \n\"It felt like a really normal Seahawk night tonight,\" coach Pete Carroll said. \nEven if he didn't have nemesis and now-Michigan coach Jim Harbaugh facing him from the other sideline. \n\"We're on the verge,\" safety Kam Chancellor said. \nFor the 49ers, any momentum gained from ending a four-game losing streak by beating Baltimore on Sunday is gone. They lost to Seattle on another Thursday night at home, in an eerily similar scene to that 19-3 Thanksgiving defeat 11 months ago after which Richard Sherman chomped turkey on the field. \n\"Unacceptable....that was sorry,\" wideout Torrey Smith posted on Twitter. \nHere are some things to take from the Seahawks' latest lopsided result against San Francisco: \nHIGH-FLYING DEFENSE: Bennett led the way with 3 1/2 sacks as the Seahawks took down Colin Kaepernick six times. \nSan Francisco's 55 yards in the first half were the fewest allowed by the Seahawks defense in an opening half since Week 17 of the 2013 season against St. Louis. The 49ers finished with 142, fewer than the 164 they managed on Thanksgiving and their worst total since 133 yards against the Vikings on Nov. 5, 2006. \nIt was Seattle's second-lowest total allowed under Carroll. \n\"It gets us back on track knowing that we're the team we always knew we were,\" linebacker Bruce Irvin said. \nFINISHING 'EM OFF: While Carroll wasn't happy with two turnovers, he couldn't complain about how Seattle finished this one out after so many fourth-quarter collapses. \nThe Seahawks had been outscored 40-3 in the fourth quarter and overtime over their previous three games, blowing a 23-14 lead in the final 12 minutes Sunday against Carolina. \nThis was progress. \n\"That was the way it's supposed to be, it's supposed to be normal to finish a game like that,\" Carroll said. \"I don't make a big deal about it. That's the way we should be playing. We should be finishing like that.\" \nMORE KAP STRUGGLES: Kaepernick's errant passes sailed into both sidelines, one ball even hitting a 49ers staff member in the head early in the game and requiring him to be checked. The 49ers had more punts — nine — than first downs (eight). \nKaepernick fell to 1-6 in seven starts against the Seahawks with three touchdown passes to nine interceptions and 24 sacks. \n\"I'm not going to force a ball into a window and take a chance on a turnover,\" said Kaepernick, his right hand taped after the game because of a swollen thumb. \"We just didn't make plays when we needed to. I do know we didn't play well enough to win.\" \nFINDING THE HOLES: Wilson exploited San Francisco's defensive failures at every chance, regularly finding wide-open receivers down the middle, while Lynch powered his way to 122 yards and a leaping 1-yard touchdown. \nWhile Wilson's five sacks pushed his NFL-leading total to 31 and he threw two interceptions, he made enough big plays to get Seattle back in the win column. \n\"The biggest thing was we were able to put everything together, get the running game together,\" Lockett said. \nHAMPERED HYDE: Carlos Hyde played on an injured left foot and was limited to 40 yards on 11 carries. Kaepernick didn't have a rush for the first time in his 46 career starts, and the 49ers wound up with just 61 yards on the ground. \nWhen asked if he had a stress fracture, Hyde said, \"something like that,\" and noted he was at a 6 on a pain scale to 10. \n\"Offensively, we weren't in a rhythm,\" left tackle Joe Staley said. \n___ \nOnline: http://pro32.ap.org/poll and http://twitter.com/AP_NFL \nCopyright 2015 by The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Triangle Area Special Offers", "external_links": [], "published": "2015-10-23T18:07:00.000+03:00", "crawled": "2015-10-23T21:20:57.686+03:00", "highlightTitle": ""}