{"organizations": [], "uuid": "afc87a66475a7f39dd333732f78a2ab141e1b6bc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tri-cityherald.com", "main_image": "http://www.tri-cityherald.com/news/local/64wtcu/picture38785779/ALTERNATES/LANDSCAPE_1140/pile_up_081_4x6_med", "site_section": "http://www.tri-cityherald.com/?widgetName=rssfeed&widgetContentId=28324093&getXmlFeed=true", "section_title": "Breaking News, Sports, Weather & More | Tri-CityHerald.com &", "url": "http://www.tri-cityherald.com/news/local/article38755482.html", "country": "US", "title": "Infant killed, multiple people injured in Saturday crashes on Interstate 82, Highway 221", "performance_score": 0, "site": "tri-cityherald.com", "participants_count": 1, "title_full": "Infant killed, multiple people injured in Saturday crashes on Interstate 82, Highway 221", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T22:22:00.000+03:00", "replies_count": 0, "uuid": "afc87a66475a7f39dd333732f78a2ab141e1b6bc"}, "author": "Ty Beaver \nTri-City Herald", "url": "http://www.tri-cityherald.com/news/local/article38755482.html", "ord_in_thread": 0, "title": "Infant killed, multiple people injured in Saturday crashes on Interstate 82, Highway 221", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "October 11, 2015 Infant killed, multiple people injured in Saturday crashes on Interstate 82, Highway 221 Police and emergency responders talk Saturday next to a semi-truck and car wrecked in one of two multiple-vehicle crashes on Interstate 82. Courtesy photo Jack Jansons i Order Reprint of this Story \nAn 8-month old boy died, a 7-year-old boy is in critical condition and at least two other people are still hospitalized after car pileups ground traffic to a halt for hours Saturday afternoon on state Highway 221 and Interstate 82 in west Benton County. \nKadlec Regional Medical Center was forced to shift to mass casualty operations to treat the influx of patients. \nThe Washington State Patrol reported three different incidents between the two highways. \nAn initial four-car collision on the interstate just around 5:15 p.m. was caused by drivers failing to reduce their speed because of limited visibility from a grass fire fed by strong winds, state police said. \nThat was followed by another crash involving five cars and a semi-truck and trailer which is still under investigation. Both occurred just miles from Benton City. \nA seven-car pileup on 221 just 11 miles south of Prosser, reported just 15 minutes after the crashes on the interstate, was caused by poor visibility from dust kicked up by the same winds that fed the grass fire. State troopers are still investigating that crash too. \nThe crashes led authorities to close the interstate and Highway 221 in both directions for more than three hours, with both reopening around 9 p.m. The grass fire that burned next to the interstate consumed between 500 to 600 acres, fire officials said. \nLaw enforcement reported a dozen people injured in the crashes and sent to hospitals in Prosser, Richland and Spokane for treatment. But hospital officials said they saw more than that, with Kadlec receiving 16 patients combined from the three incidents. \n“We train for these types of incidents and our team did everything according to plan and responded very well,” Kadlec spokesman Jim Hall told the Herald. \nIn the initial crash on the interstate, Andrew Mills, 34, of Spokane slowed down his 2008 Chevy Suburban after driving up on smoke and blowing dust across the freeway. \nThe three drivers behind Mills failed to slow down. Timothy Dorko, 35, of Pasco, was at the back of the group and collided with Esteban Banda, 29, of Pasco. \nThat crash sent Banda's Volkswagen Jetta into the back of Robert Gonzalez's Dodge Charger, which then hit Mills. \nThe four drivers, and Gonzalez’s two passengers, were all wearing seat belts, state police said. Dorko, Banda and Mills weren’t hurt, but Gonzalez and his passengers were transported to Kadlec, where they were treated and released, hospital staff said. \nThe second crash on the interstate happened at the same mile marker. It started with Kevin D. Nichols, 49, of Pasco, running into the rear of a Nissan Altima with his semi-truck and trailer, state police said. That led the Altima’s driver, Diana L. Corey, 65, of Post Falls, Idaho, to spin out and hit a Saturn four-door driven by Kirk B. Fletcher, 36, of Prosser. \nMeanwhile, Marlene N. Schweighardt, 75, of Kennewick, ran into the back of Nichols’ trailer, Magali Ambriz-Arreola, 29, of Yakima, ran into Schweighardt’s Mercury Mariner with her Chevrolet Equinox and Robert W. Carrol, 63, of Kennewick, ran into Ambriz-Arreola with a Subaru Outback, state police said. \nCorey and her passenger, Kristopher T. Corey, 32, of Post Falls, Idaho, were the only injuries in that crash. She was treated and released. He remains in satisfactory condition at Kadlec. \nThe seven vehicles involved in the crash on Highway 221 were all southbound. Drivers and passengers hailed from the Tri-Cities, Grandview, Pendleton, Bremerton and South Jordan, Utah. \nThe infant died at Prosser Memorial Hospital of his injuries. The 7-year-old boy, who was in the same Dodge Caravan, is being treated at Sacred Heart Hospital in Spokane. The minivan’s driver, Jamie N. Haren, 26, of Kennewick, was not injured. \nPasco resident Ernesta Gonzalez, 43, who was driving a Hyundai Sonata, is listed in satisfactory condition at Kadlec. Five other drivers and passengers were treated and released. \nCharges are pending in all three crash investigations, the state patrol said. \nHall said Saturday’s crashes marked the second time in a week Kadlec had to put in place its incident command center, a protocol that helps staff quickly assess patient needs and who needs immediate treatment. \nThe hospital had to use a similar approach on Thursday to treat workers burned in an electrical explosion at Priest Rapids Dam, before they were transfered to Seattle’s Harborview Medical Center. \nTy Beaver: 509-582-1402; tbeaver@tricityherald.com ; Twitter: @_tybeaver Related content", "external_links": [], "published": "2015-10-11T22:22:00.000+03:00", "crawled": "2015-10-12T09:31:22.603+03:00", "highlightTitle": ""}