{"organizations": [], "uuid": "8b2d83370ec457c9f3c25f9515228e01e5e5584f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "jacksonville.com", "main_image": "http://jacksonville.com/sites/default/files/eeeeiden%20%281%29.jpg", "site_section": "http://feeds.jacksonville.com/JacksonvillecomSports#", "section_title": "Jacksonville sports news - Jacksonville.com and The Florida Times-Union", "url": "http://jacksonville.com/sports/high-schools/2015-10-22/story/high-school-volleyball-bolles-bk-creekside-providence-among", "country": "US", "title": "High school volleyball: Bolles, BK, Creekside, Providence among district winners", "performance_score": 0, "site": "jacksonville.com", "participants_count": 1, "title_full": "High school volleyball: Bolles, BK, Creekside, Providence among district winners", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T05:21:00.000+03:00", "replies_count": 0, "uuid": "8b2d83370ec457c9f3c25f9515228e01e5e5584f"}, "author": "Times-Union", "url": "http://jacksonville.com/sports/high-schools/2015-10-22/story/high-school-volleyball-bolles-bk-creekside-providence-among", "ord_in_thread": 0, "title": "High school volleyball: Bolles, BK, Creekside, Providence among district winners", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "High school volleyball: Bolles, BK, Creekside, Providence among district winners \nBy Times-Union Thu, Oct 22, 2015 @ 10:21 pm | updated Thu, Oct 22, 2015 @ 10:53 pm Back Photo: 1 of 5 Next Gary McCullough/For the Times-Union Providence's Carly Davey (1), left, Kailey Dean (17) and teammates celebrate defeating St. Johns Country Day in the high school Class 3A, District 2 volleyball championship at Providence School in Jacksonville, Fla., Thursday, October 22, 2015. Providence won in straight sets 25-20, 25-22, 25-16. (The Florida Times-Union, Gary McCullough) Back Photo: 2 of 5 Next Gary McCullough/For the Times-Union Providence's Kamara Kelly (9) taps the ball over a block by St. Johns Country Day's Avery Wasdin (11) during high school Class 3A, District 2 volleyball tournament championship action at Providence School in Jacksonville, Fla., Thursday, October 22, 2015. Providence won in straight sets 25-20, 25-22, 25-16. (The Florida Times-Union, Gary McCullough) Back Photo: 3 of 5 Next Gary McCullough/For the Times-Union Providence's Kamara Kelly (9) returns the ball defended by St. Johns Country Day's Madison Dill (23) during high school Class 3A, District 2 volleyball tournament championship action at Providence School in Jacksonville, Fla., Thursday, October 22, 2015. Providence won in straight sets 25-20, 25-22, 25-16. (The Florida Times-Union, Gary McCullough) Back Photo: 4 of 5 Next Gary McCullough/For The Times-Union St. Johns Country Day's Avery Wasdin (11) spikes the ball past a block by Providence's Kailey Dean (17) during high school Class 3A, District 2 volleyball tournament championship action at Providence School in Jacksonville, Fla., Thursday, October 22, 2015. Providence won in straight sets 25-20, 25-22, 25-16. (The Florida Times-Union, Gary McCullough) Back Photo: 5 of 5 Next Gary McCullough/For The Times-Union The Providence volleyball team after defeating St. Johns Country Day in the high school Class 3A, District 2 volleyball championship at Providence School in Jacksonville, Fla., Thursday, October 22, 2015. Providence won in straight sets 25-20, 25-22, 25-16. (The Florida Times-Union, Gary McCullough) \nKamara Kelly and the Providence volleyball team are back at the top. \nThe Stallions, a state semifinalist a year ago, knocked off top-seeded St. Johns Country Day 3-0 to win the District 2-3A championship on Thursday night, its 11th consecutive. \nProvidence’s 25-20, 25-22, 25-16 victory helped it atone for a 3-2 loss to the Spartans two weeks ago that cost them the top seed for the district tournament. \nThe freshman, who had been banged up since suffering an ankle injury in a match against Bishop Kenny, had 16 kills, tied for most on the team with Rebecca Rowan. The Stallions (16-11) will host John Paul II, while the Spartans travel to face Maclay on Tuesday. \n\nDISTRICT 4-7A: Creekside (21-4) fought from behind to knock off Gainesville Buchholz 14-25, 25-20, 17-25, 25-13, 15-11. \nDISTRICT 3-7A: Gateway Conference champion Fletcher repeated last week’s feat, defeating Atlantic Coast 25-19, 25-10, 25-18 to claim the title. Brooke Ruud and Brittany Wagner finished with eight kills each, and Kendal Owen added 18 assists. The Senators (23-4), who didn’t lose a game all season against Gateway foes, will play at home against Gainesville Buchholz (14-14) Tuesday. The Stingrays travel to Creekside. \nDISTRICT 3-6A: Middleburg maintained its accustomed postseason course, repeating as district champion in a 25-11, 25-20, 25-13 sweep of visiting Nease. Haileigh Riesenbeck had six kills and 19 assists for the Broncos, while Courtney King and Leigha Reynolds contributed 6 kills apiece. The Broncos will play at home against either Gainesville or Ocala Forest on Wednesday. The Panthers will travel to face the loser of Friday's Gainesville-Forest match. \nDISTRICT 5-5A: Ponte Vedra won its fifth consecutive district championship with a sweep (25-19, 25-14, 25-21) of Clay. The Sharks (18-8) will host Belleview, while the Blue Devils will travel to face Santa Fe Tuesday. Mackenzie Morris had 12 kills and Devyn D’Errico added 21 digs for the Sharks. \nDISTRICT 4-5A: Kirsten Sutherland’s 11 kills lifted Ridgeview to its first-ever district title, ousting Orange Park 25-23, 25-17, 25-13 in a Clay County battle. Anyssa Guzman had 29 digs and Emily Smith had 36 assists for the Panthers (21-6), who return to the postseason for the first time since 2003. Savannah Imus led Orange Park (11-14) with 22 digs and 20 assists. Ridgeview will play Stanton at home in Tuesday’s regional quarterfinal, while Orange Park will head to Bishop Kenny. \nDISTRICT 3-5A: Bishop Kenny cruised into the state playoffs with a 25-15, 25-7, 25-15 sweep of Stanton. The Crusaders (20-8) will host Orange Park (11-14), while Stanton will visit Ridgeview Tuesday. Kenny has won an area-high 19 consecutive district championships. \nDISTRICT 3-4A: Bolles had a sweep (25-23, 25-15, 25-23) of Episcopal to surge into the playoffs for an area-best 22nd consecutive season. The Bulldogs (23-4) got 19 kills from hitter Brittney Rayfield and 24 digs out of Anastasia Scott to beat the Eagles (17-11) for the fourth time this season. \nDISTRICT 4-4A: Abi Loose had 10 kills to lead Keystone Heights to a 25-23, 26-24, 25-18 win over Interlachen. The Indians will host Episcopal, while the Rams will visit Bolles on Wednesday. \nDISTRICT 3-2A: Megan Lang had 18 kills as Eagle's View beat Cornerstone Christian 25-20, 25-17, 23-25, 25-15 to win the district title. Macey Lee added 37 assists for the Warriors (19-4), who will host Leesburg's First Academy on Wednesday. \nDISTRICT 2-2A: Genelle Boyer's 27 kills helped Seacoast Christian defeat Christ’s Church 15-25, 25-22, 25-14, 17-25, 15-10 to win District 2-2A. Faith Kinman (39 assists) and Samantha Hinerman (27 digs) kept the Eagles (25-2) on course. Seacoast, seeking the school's first playoff victory, will play Wednesday at home against Tallahassee FAMU. Christ’s Church (14-10) will travel to Tallahassee Community Christian. \nDISTRICT 6-1A: Union County defeated Hilliard 25-11, 24-26, 25-13, 25-10 for the title. Madelyn Kish led the Tigers with 16 kills, while Kaylan Tucker (30 digs) and Madison Adams (46 assists) also starred.", "external_links": [], "published": "2015-10-23T05:21:00.000+03:00", "crawled": "2015-10-23T18:18:31.947+03:00", "highlightTitle": ""}