{"organizations": ["Marlins", "Facebook Marlins", "MLB"], "uuid": "600cbdec7891a2b30c9648f880a3217c90fd034a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cincinnati.com", "main_image": "http://www.gannett-cdn.com/-mm-/aa13e8c296e9b4d0298dea3a5892f7ae96c7b95a/c=0-93-2515-1514&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/04/USATODAY/USATODAY/635795789801953679-USP-MLB-Miami-Marlins-at-Philadelphia-Phillies-001.jpg", "site_section": "http://rssfeeds.cincinnati.com/cincinnati-sports", "section_title": "Cincinnati - Sports", "url": "http://www.cincinnati.com/picture-gallery/sports/nfl/bengals/2015/10/04/bengals-chiefs-tailgating/73330978/", "country": "US", "title": "Marlins' Ichiro Suzuki makes MLB pitching debut", "performance_score": 0, "site": "cincinnati.com", "participants_count": 0, "title_full": "Marlins' Ichiro Suzuki makes MLB pitching debut", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T07:05:00.000+03:00", "replies_count": 0, "uuid": "600cbdec7891a2b30c9648f880a3217c90fd034a"}, "author": "", "url": "http://www.cincinnati.com/picture-gallery/sports/nfl/bengals/2015/10/04/bengals-chiefs-tailgating/73330978/", "ord_in_thread": 0, "title": "Marlins' Ichiro Suzuki makes MLB pitching debut", "locations": ["USA"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ichiro", "Ichiro Suzuki", "Eric Hartline", "Gabe Lacques"], "text": "Marlins' Ichiro Suzuki makes MLB pitching debut Ichiro allowed one earned run and two hits in one inning. Post to Facebook Marlins' Ichiro Suzuki makes MLB pitching debut Ichiro allowed one earned run and two hits in one inning. Check out this story on USATODAY.com: http://usat.ly/1Ld0CuA Cancel Send A link has been sent to your friend's email address. Posted! A link has been posted to your Facebook feed. Join the Nation's Conversation To find out more about Facebook commenting please read the Conversation Guidelines and FAQs Marlins' Ichiro Suzuki makes MLB pitching debut Gabe Lacques , USA TODAY Sports 12:05 a.m. EDT October 5, 2015 Ichiro Suzuki allowed one earned run and two hits in one inning. (Photo: Eric Hartline, USA TODAY Sports) CONNECT TWEET LINKEDIN COMMENT EMAIL MORE \nOver his Hall of Fame-caliber 15-year major league career, Ichiro Suzuki was almost as good a showman as he was a player. \nAnd if Sunday was, indeed, his final major league game, Suzuki went out with a bang, taking the mound as a pitcher for the first time in his career. \nCertainly, the results were not as excellent as his work at the plate - Suzuki is a lifetime .314 hitter with 2,935 hits and 1,278 more in Japan. Suzuki pitched the eighth inning of the Miami Marlins' 7-2 loss to the Philadelphia Phillies, giving up a run and two hits, but hitting 87 mph on the radar gun. \nThis likely represents Suzuki's final season, as he batted .229 in 398 at-bats with the Miami Marlins. But Sunday's show ensured Suzuki did not go out as a .229 hitter. It meant he went out like he played most of his major league career - surprising and entertaining countless fans. Ichiro out there throwin sliders 😂 pic.twitter.com/Cbz5oQbiqg — Kent Murphy (@RealKentMurphy) October 4, 2015 \nGALLERY: POSITION PLAYERS PITCHING Posted! A link has been posted to your Facebook feed. Oct. 4: Ichiro Suzuki allows one run and two hits, but hits 87 mph on the radar gun. Eric Hartline, USA TODAY Sports Aug. 25: Yankees infielder Brendan Ryan pitches in the eighth inning against the Astros at Yankee Stadium. Andy Marlin, USA TODAY Sports Aug. 16: Athletics first baseman Ike Davis, who took the mound for the second time this season, allows a single and a walk in a scoreless eighth against the Orioles. Tommy Gilligan, USA TODAY Sports Aug. 5: Nationals INF Tyler Moore pitches 2/3 of shutout innings in the 9th in an 11-4 blowout against the Diamondbacks. Tommy Gilligan, USA TODAY Sports July 31: White Sox designated hitter Adam LaRoche pitches against the New York Yankees in the ninth inning at US Cellular Field. EPA July 30: Trailing 15-5 to the Reds in the top of the 9th inning, Pirates outfielder Jaff Decker allows two hits, but does not allow a run. Jamie Sabau, Getty Images July 28: In his second outing of the season, Rangers infielder Adam Rosales gives up a solo home run to Brett Gardner in a 21-5 loss to the Yankees. Tony Gutierrez, AP June 26: Rangers infielder Adam Rosales becomes the ninth position player in club history to take the mound. He gives up a home run to Blue Jays' Danny Valencia in a 12-2 loss. Tom Szczerbowski, Getty Images June 17: Padres shortstop Alexi Amarista, who hasn't pitched since he was 13 years old, needs just two pitches to get Athletics' Billy Burns on a fly ball to Matt Kemp for the final out of a 16-2 loss. Ben Margot, AP July 26: Cubs catcher David Ross pitches a perfect ninth inning against the Phillies in a 11-5 loss. Matt Marton, USA TODAY Sports June 17: The Cubs' 17-0 rout reaches the point where the Indians use a pair of position players -- outfielders Ryan Raburn and David Murphy. Rayburn allows two unearned runs in 2/3 of an inning. David Richard, USA TODAY Sports June 17: Indians OF David Murphy then surrenders a grand slam to Kris Bryant to cap off Chicago's seven-run ninth. David Richard, USA TODAY Sports Fullscreen June 16: Rays infielders Jake Elmore and Nick Franklin pitch the 8th and 9th inning in a 16-4 rout by the Nationals. Elmore who pitched an inning for the Astros back in 2013, gives up a home run to Wilson Ramos. He allows two more singles in the inning, but was able to escape without surrendering any other runs. Kim Klement, USA TODAY Sports June 16: Rays INF Nick Franklin, who last pitched when he was a starting pitcher back in high school, also gives up a home run to Nationals catcher Wilson Ramos in the 9th inning. Kim Klement, USA TODAY Sports Fullscreen June 16: Phillies outfielder Jeff Francoeur pitches two innings in a 19-3 loss to the Orioles, becoming the first Phillies position player to appear in a game since Casper Wells in 2013. He pitches a perfect seventh inning then allows two runs in the 8th. Tommy Gilligan, USA TODAY Sports Fullscreen May 23: Yankees 1B Garrett Jones gets the final two outs of the top of the 9th inning in their 15-4 loss to the Rangers, marking his first pitching appearance since he was a senior at Andrew High School in Tinley Park, Ill. Noah K. Murray,USA TODAY Sports May 9: With the Cubs trailing 12-4 loss, veteran catcher David Ross, who said he had not pitched since Little League, turns in a 1-2-3 eighth inning. Mike McGinnis, Getty Images April 21: Trailing 14-1 to the Angels, Athletics 1B Ike Davis pitches a 1-2-3 eighth inning, becoming the first Oakland position player to pitch in a game since Frank Menechino did it July 18, 2000, at Colorado. Gary A. Vasquez, USA TODAY Sports Like this topic? You may also like these photo galleries: Replay", "external_links": [], "published": "2015-10-05T07:05:00.000+03:00", "crawled": "2015-10-05T07:14:58.936+03:00", "highlightTitle": ""}