{"organizations": ["Atletico"], "uuid": "8b8c589c9d7abe24cb2b0b0b4c9544455f337164", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/08bf66ae451fe6d06c48d264a3030100.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/football/rafa-benitez-defends-his-tactics-after-atletico-rescue-derby/6892892/", "country": "JE", "title": "Rafa Benitez defends his tactics after Atletico rescue derby draw", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "Rafa Benitez defends his tactics after Atletico rescue derby draw", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T10:01:00.000+03:00", "replies_count": 0, "uuid": "8b8c589c9d7abe24cb2b0b0b4c9544455f337164"}, "author": "", "url": "http://www.sport.co.uk/football/rafa-benitez-defends-his-tactics-after-atletico-rescue-derby/6892892/", "ord_in_thread": 0, "title": "Rafa Benitez defends his tactics after Atletico rescue derby draw", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Rafa Benitez"], "text": "Rafa Benitez defends his tactics after Atletico rescue derby draw 05 Oct 2015 07:01:52 \ncomments \nRafa Benitez defended his tactics after his Real Madrid side conceded a late goal to Atletico Madrid to draw the Madrid derby and miss an opportunity to go top of the Primera Division. \nBenitez raised eyebrows by starting defensive midfielder Casemiro over the more attacking-minded Mateo Kovacic but the plan appeared to have paid off when Karim Benzema gave the visitors an eighth minute lead. \nHis side were let off the hook when Keylor Navas saved Antoine Griezmann's penalty but an equaliser eventually arrived via Luciano Vietto in the 83rd minute, and Atletico finished the game stronger. \nBut the coach insisted his side did not draw the game because they were too conservative. \n\"No, you have to give credit to Atletico, they were very intense and we didn't take advantage of our counter-attacks,\" Benitez told a press conference. \n\"We dominated the first half and had the game under our control. Atletico played with more intensity in the second half and we had eight counter-attacks but we weren't precise with our final passes.\" \nNonetheless, the coach did not hide his disappointment at losing the lead so late in the game. \nHe said: \"We lost two points today. We were ahead and we made two mistakes, the penalty and the goal, and we lacked precision on the counterattack.\" \n\"Atletico pushed us hard in the final quarter of an hour but we still had control. We are happy with what we did in the first half.\" \nMeanwhile, Atletico boss Diego Simeone thought his side should have won the game. \n\"We are left with the feeling that we have dropped two points because we were close to winning, and we created more chances,\" he said. \nThe Argentine also explained the decision to take off the lively Angel Correa, one of Atletico's best performers, and his reasoning behind bringing on Yannick Ferreira Carrasco for Oliver Torres. \n\"I changed Oliver for Carrasco because I felt we needed to get forward more, and with Arbeloa on the pitch we had more opportunities to attack down the left wing. We were trying down the right, but we improved when we attacked down the left, because we liberated Griezmann. \n\"I also thought Correa was playing well but I was worried that if we lost possession he could make an unnecessary foul (Correa had already been booked). He is young and it was risky and I wanted to put on fresh legs, and it didn't work out so bad, as Luciano scored the goal.\" Related Sport News", "external_links": [], "published": "2015-10-05T10:01:00.000+03:00", "crawled": "2015-10-05T18:50:03.797+03:00", "highlightTitle": ""}