{"organizations": [], "uuid": "97693a56b65a9497df9c209fdde3b1898924f64e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.app.com", "main_image": "http://www.gannett-cdn.com/-mm-/5298ff6067c5172d1d894545e5a57fcfaa612795/c=0-180-1920-1260&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/07/AsburyPark/B9319175389Z.1_20151007195810_000_GO2C5VVUC.1-0.jpg", "site_section": "http://www.app.com/rss/collegesports", "section_title": "Asbury Park - Sports", "url": "http://www.app.com/story/sports/high-school/soccer/2015/10/07/girls-soccer-shore-conference-rankings-october/73551552/", "country": "US", "title": "Girls Soccer: Shore Conference rankings for October 7", "performance_score": 0, "site": "app.com", "participants_count": 2, "title_full": "Girls Soccer: Shore Conference rankings for October 7", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T03:00:00.000+03:00", "replies_count": 1, "uuid": "b41965b522e80a4b0d097ec4461415824ddd5fed"}, "author": "app.com", "url": "http://www.app.com/story/sports/high-school/soccer/2015/10/07/girls-soccer-shore-conference-rankings-october/73551552/#post-0", "ord_in_thread": 0, "title": "Girls Soccer: Shore Conference rankings for October 7", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MORE The seeding meeting for the 2015 girls soccer Shore Conference Tournament is Sep. 19 and teams are in the second wave of their division schedules right now. No team has officially clinched a division title just yet but there are several intriguing division races going on right now and we’re talking about the Class A North, Class A Central, Class A South and Class B South divisions. Colts Neck (the Class B North division leader) and Shore Regional (the Class B Central division leader) are closing in on division titles. So, we’ve added projected SCT seeds to this week’s commentary on the best girls soccer teams in the Shore Conference.\nRank-Team-2015 Record-Last week’s rank\n1. Colts Neck (9-0-1, 1st)\nThe Cougars went 3-0 and are now the only undefeated team in the Shore Conference. Colts Neck has been challenged recently by posting a 1-0 win over Wall and a 2-1 triumph over Red Bank Catholic. However, the Cougars have only allowed that one goal in their last five games. The Cougars are closing in on the Class B North title with a two-game lead with five divisional games to go. Projected SCT seed: The Cougars are the No. 1 seed.\nGirls Soccer: King’s goal powers Colts Neck girls soccer past Red Bank Catholic\n2. Rumson-Fair Haven (9-1-1, 6th)\nThe Bulldogs are one of the hottest teams in the Shore Conference going 4-0 last week with wins over Trinity Hall, Monmouth, Manasquan and St. John Vianney. The Bulldogs have won seven games in a row and have allowed five goals in those seven games. The showdown with Holmdel (Oct. 8) will more than likely decide the Class A Central title and Rumson-Fair Haven has a nondivisional matchup with Shore on Oct. 17. Projected SCT seed: 7-10 range.\nGirls Soccer: 3 Shore Conference must-see games this week\n3. Holmdel (7-2, 7th)\nHolmdel defeated St. John Vianney, 3-2, Matawan, 4-2, and Manasquan, 2-1, to go 3-0 last week. The Hornets enter their Oct. 8 showdown with Rumson-Fair Haven on a four-game winning streak and they are looking to avenge a 5-4 loss to Rumson-Fair Haven on Sep. 18. If the Hornets want a chance at the Class A Central title, they’ll have to beat Rumson-Fair Haven on the road, which is a difficult task. Projected SCT seed: 7-10 range.\n4. Freehold Township (7-1-1, 2nd)\nThe Patriots went 2-1 last week with a loss to Howell and with victories over Wall and Middletown South. With the exception of the blemish to Howell, the Patriots have a solid season resume with wins over Shore, Toms River South, Manalapan, teams that are a combined 20-5-1. The huge rematch with Freehold is coming up on October 14. Projected SCT seed: Depending on how that Freehold game goes and which Class A North team wins the division, the Patriots are in the 1-3 range with a tight grasp on the No. 2 seed right now.\nGirls Soccer: Freehold Township’s Whitley scores twice in win over Toms River South\n5. Shore (8-2-1, 5th)\nThe Blue Devils went 3-0 last week as they earned wins over Lacey, Point Beach and Middletown South. Shore is on a nine-game unbeaten streak (8-0-1) after starting the season 0-2. The Blue Devils swept division opponents 4-0 in the first turn through the division schedule and look poised to win the Class B Central division. Shore has two big showdowns coming up, first, at Holmdel on Oct. 12 and versus Rumson-Fair Haven on Oct. 17. Those two nondivisional games will be a big factor in the SCT seeds for all teams involved. Projected SCT seed: 4-6 range.\n6. Wall (7-4, 4th)\nThe Crimson Knights went 2-2 last week with wins over Manasquan and Ocean and with losses to Colts Neck and Freehold Township. Wall is on the outside looking in on the Class B North division title race but the Crimson Knights still have a solid resume. They had a seven-game winning streak at one point this season and have signature wins over Red Bank Catholic and Ocean. Projected SCT seed: If the Crimson Knights, finish in second place in the Class B North division, they have an argument for a seed in the 4-7 range.\nGirls Soccer: Wall’s Alex Panasuk a “saving” grace\n7. Manalapan (6-1, NR)\nThe Braves made their debut in the APP top 10 this week and have victories over Howell (twice) and Freehold this season. Manalapan is in the mix for the Class A North title but that will depend on how the Braves play over their next four games. Manalapan will play at Middletown South (Oct. 8), versus South Brunswick (Oct. 13), at Freehold (Oct. 16) and versus Freehold Township (Oct. 19). Projected SCT seed: 7-10 range.\n8. Toms River South (7-2, NR)\nThe Indians are one of the other Class A South division leaders and they also make their debut in the APP top 10 this week. Toms River South has wins over Jackson Memorial, Southern (twice) and Toms River North. The Indians have the better division record 7-1 to Toms River East’s 7-2 and the Indians beat Toms River North, which was ranked all season long, and Toms River East didn’t. That’s why Toms River South gets the ever so slight nod for the higher ranking over the other two Toms River schools, for now. Projected SCT seed: 7-10 range but whatever Toms River school school wins the Class A South division should be seeded higher than the other two.\nGirls Soccer: Toms River South outlasts Toms River North in girls soccer\n9. Toms River North (6-1-3, 3rd)\nThe Mariners went 0-1-2 last week with a 2-1 loss to crosstown rival Toms River South and then had 1-1 ties with Southern and Brick Memorial. The ties have taken the Mariners out of the Class A South title race for the moment and they tumbled in the rankings this week. But the rematches with Toms River East (Oct. 7) and Toms River South (Oct. 19) will dictate how the division shakes out. Projected SCT seed: Currently, the Mariners are looking at a seed in the 7-10 range but how high will depend on if they win the Class A South division or not.\nGirls Soccer: Standings\n10. Toms River East (8-2, NR)\nToms River East is the other Class A South division leader and the Raiders join the top 10 for the first time this season. Toms River East has signature wins over Toms River South, Jackson Memorial and Brick Memorial. Depending on how the rematch with Toms River North (Oct. 7) and Toms River South (Oct. 13), the Raiders could be in a position to claim a part of the Class A South title. Projected SCT seed: 7-10 range.\nDropped out: No. 8 St. John Vianney (7-4-1), No. 9 Freehold (5-4-1) and No. 10 Ocean (7-5)\nOthers receiving votes (in no particular order): Howell (5-4), Jackson Memorial (7-4), Brick Memorial (5-2-3), Point Boro (8-1-1), Red Bank Catholic (6-5-2), St. John Vianney (7-4-1), Freehold (5-4-1), Ocean (7-5).\n2015 Girls Soccer Top 10 Archive\nSep. 28: Top 10\nSep. 22: Top 10\nSep. 14: Top 10\nPreseason: Top 10\nSherlon Christie: schristie@gannettnj.com", "external_links": [], "published": "2015-10-07T03:00:00.000+03:00", "crawled": "2015-10-08T18:08:49.112+03:00", "highlightTitle": ""}