{"organizations": [], "uuid": "922ca558a851e1fd582d1b02eb8987dbc28d4a9c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cleveland.com", "main_image": "http://imgick.cleveland.com/home/cleve-media/width620/img/plain-dealer/photo/2015/10/11/18948966-large.jpg", "site_section": "http://www.cleveland.com/pluto/", "section_title": "Cleveland, OH Sports Blog | Terry's Talkin' Sports - cleveland.com ", "url": "http://www.cleveland.com/pluto/index.ssf/2015/10/cleveland_browns_halftime_scri_31.html", "country": "US", "title": "Cleveland Browns Halftime Scribbles: Browns can't get into end zone, defense regroups in second quarter -- (photos)", "performance_score": 0, "site": "cleveland.com", "participants_count": 4, "title_full": "Cleveland Browns Halftime Scribbles: Browns can't get into end zone, defense regroups in second quarter -- Terry Pluto (photos) | cleveland.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T22:31:00.000+03:00", "replies_count": 3, "uuid": "638d99fe9975172936c99773b80fdcec3dab3ce8"}, "author": "Terry Pluto, The Plain Dealer", "url": "http://www.cleveland.com/pluto/index.ssf/2015/10/cleveland_browns_halftime_scri_31.html#post-0", "ord_in_thread": 0, "title": "Cleveland Browns Halftime Scribbles: Browns can't get into end zone, defense regroups in second quarter -- (photos)", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BALTIMORE, Maryland -- Scribbles in my halftime notebook as the Browns trail Baltimore, 14-9.\n1. The Browns defense was sliced up early in this game, allowing 14 points in the first quarter. The first touchdown came on a 61-yard drive. The next was on a 73-yard drive. So it's not as if the offense was putting the defense in bad position. They just couldn't stop the Ravens with Joe Flacco picking them apart with his passing. Flacco was 7-of-11 passing for 105 yards in the first quarter.\n2. On the second touchdown drive, Baltimore had the ball on its own 29-yard-line. It was 3rd-and-8. Then Flacco hit Kamar Aiken with a 48-yard pass. Aiken simply ran past Browns cornerback Tramon Williams. With Steve Smith hurt, Aiken has become a primary receiver for Ravens. He had been with four different teams starting in 2011 and never caught a pass in a regular season NFL game until 2014. The 47-yard catch was a career long for Aiken.\n3. The defense settled down in the second quarter, holding Baltimore scoreless. Flacco was 6-of-9 passing for only 33 yards in second period. In the first half, the Browns held the Ravens to 34 yards in 11 carries on the ground. Desmond Bryant had two excellent tackles for a loss. Danny Shelton had a tackle for a 4-yard loss. Line looks so much better with Desmond Bryant back.\n4. The Browns offense has been moving the ball, until the red zone. Josh McCown was 14-of-22 passing for 165 yards. Running game going nowhere, nine yards in eight attempts. They are having to rely on McCown's arm, and that's a tough assignment,\n5. Baltimore has been punting the ball to the sidelines to prevent a return by Travis Benjamin.\n6. Browns have had some very bad penalties. Jordan Poyer was flagged for a chop block. Something I've never seen before, kicker Travis Coons was flagged for a personal foul.\n7. Browns had two more trips to the red zone without a touchdown. They are an NFL worst 3-of-13 in that category.", "external_links": [], "published": "2015-10-11T22:31:00.000+03:00", "crawled": "2015-10-12T12:27:22.800+03:00", "highlightTitle": ""}