{"organizations": [], "uuid": "e4c43b55740b8a1bf9ea26ee52f15a76ed3f0903", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deccanherald.com", "main_image": "http://www.deccanherald.com/page_images/original/2015/10/11/505765.gif", "site_section": "http://www.deccanherald.com/rss/sports.rss", "section_title": "Deccan Herald - Sports", "url": "http://www.deccanherald.com/content/505765/momentum-our-side-saysamp8200ab.html", "country": "US", "title": "Momentum on our side, says AB", "performance_score": 0, "site": "deccanherald.com", "participants_count": 0, "title_full": "Momentum on our side, says AB", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T18:14:00.000+03:00", "replies_count": 0, "uuid": "e4c43b55740b8a1bf9ea26ee52f15a76ed3f0903"}, "author": "", "url": "http://www.deccanherald.com/content/505765/momentum-our-side-saysamp8200ab.html", "ord_in_thread": 0, "title": "Momentum on our side, says AB", "locations": ["Kanpur"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Momentum on our side, says&#8200;AB Momentum on our side, saysAB October 11, 2015,Kanpur, DHNS \nBy clinching the T20I series 2-0, South Africa captain AB de Villiers said that they have shown the world that they can beat India at home and would be looking to carry the momentum into the One-day International series. “I don’t think a lot of people expect us to be 2-0 up in the T20I series. It is not going to be easy playing India with lots of travelling and lot of different wickets and different grounds. It is going to be challenging but we have got very important momentum on our side and we are hoping to take that into tomorrow,” de Villiers told reporters.“We are hoping to win the series. I was part of an ODI series before where we drew 2-2 back in 2006 I think and we would love to win this series. We won the T20I series and we have shown the world that we can beat India here. India will try and bounce back to win the ODI series as quickly as they can and hopefully we can stop them from doing that.”De Villiers negated the presence of spin in the series and felt the pitch here doesn’t appear to be a spinning wicket. “I don’t think spin has been the theme of the series so far, our seamers have won the game for us. But we are expecting the wickets to get slower and turn more as we go on in the series. It (track here) doesn’t look like a spinning track, it looks like a good cricket wicket. We can expect normal spin but nothing out of this world. We will assess tomorrow when we get to the ground and try and expose India in certain areas,” he said.“We have got firepower in all departments in our bowling. We have good spin bowlers as well. We have an off-spinner and a leg-spinner, we have got (Aaron) Phangiso as an option as well. We have covered all bases.”The inclusion of Dale Steyn and Morne Morkel would add more experience to their attack and De Villiers was excited at the prospect of the two pacers bowling in tandem on Sunday. “We haven’t seen them for a while so they bring good energy and experience to the side. They look in really good form, especially Morne with his 100th ODI for South Africa tomorrow. We are all very happy for him, it is a great achievement and we are looking forward to walking on the field with a cheer,” he said.", "external_links": [], "published": "2015-10-10T18:14:00.000+03:00", "crawled": "2015-10-11T01:39:34.121+03:00", "highlightTitle": ""}