{"organizations": [], "uuid": "56260cf95a57187f6252fef6be2f6a851172cf2b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.masslive.com", "main_image": "http://imgick.masslive.com/home/mass-media/width620/img/falcons/photo/2015/10/02/18886654-standard.jpg", "site_section": "http://impact.masslive.com/sports/atom.xml", "section_title": "Sports - MassLive.com", "url": "http://www.masslive.com/falcons/index.ssf/2015/10/bruce_landon_and_bruce_cline_i.html", "country": "US", "title": "Bruce Landon and Bruce Cline Inducted into American Hockey League Hall of Fame", "performance_score": 0, "site": "masslive.com", "participants_count": 1, "title_full": "Bruce Landon and Bruce Cline Inducted into American Hockey League Hall of Fame", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T22:53:00.000+03:00", "replies_count": 0, "uuid": "56260cf95a57187f6252fef6be2f6a851172cf2b"}, "author": "Tim Culverhouse | tim.culverhouse@masslive.com", "url": "http://www.masslive.com/falcons/index.ssf/2015/10/bruce_landon_and_bruce_cline_i.html", "ord_in_thread": 0, "title": "Bruce Landon and Bruce Cline Inducted into American Hockey League Hall of Fame", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bruce Landon and Bruce Cline Inducted into American Hockey League Hall of Fame Bruce Landon AHL Hall of Fame.jpg The Springfield Hockey Heritage Society held their annual Hockeyday event on the grounds of the Eastern State Exposition in West Springfield. Here are Bruce Landon (left) and Tim Jacobs. Landon, along with former Falcon Bruce Cline and two others were inducted into the American Hockey League Hall of Fame on Friday. (Don Treeger / The Republican) (Treeger) Comments \nSPRINGFIELD - The American Hockey League announced on Friday the four people selected for induction into the American Hockey League Hall of Fame as the Class of 2016. \nHonored by the AHL Hall of Fame Selection Committee as the 11th group of enshrinees include former Springfield players Bruce Landon and Bruce Cline. \n\"The foundation of the American Hockey League has been formed by the outstanding achievements and contributions of those who have excelled here over the last eight decades,\" said David Andrews, AHL President and Chief Executive Officer. \"The AHL Board of Governors is proud to unanimously approve the Selection Committee's recommendation for the induction of these four individuals into the American Hockey League Hall of Fame.\" \nThe Class of 2016 will be honored as part of the festivities at the 2016 AHL All-Star Classic, hosted by the Syracuse Crunch. The American Hockey League Hall of Fame Induction and Awards Ceremony is scheduled for February 1, 2016, in Syracuse, N.Y. \nFormed in 2006 to recognize, honor and celebrate individuals for their outstanding achievements and contributions in the American Hockey League, the AHL Hall of Fame is housed online at www.ahlhalloffame.com and is accessible to fans worldwide with the click of a mouse as part of the AHL Internet Network. \nBruce Landon A mainstay in the American Hockey League for nearly half a century, Bruce Landon is considered by many to be synonymous with hockey in Springfield, Massachusetts. \nThe Ontario native was drafted as a goaltender by the Los Angeles Kings in 1969 and joined their AHL affiliate in Springfield that fall, helping the club reach the Calder Cup Finals in 1970 before winning the championship in 1971. He had a brief stints with the Jacksonville Barons and Rhode Island Reds before returning to Springfield in 1977, but a knee injury forced him to retire that December at the age of 28. \nLandon immediately took a marketing and public relations position in the Indians' front office, and he was honored in 1980 with the AHL's Ken McKenzie Award for outstanding promotion of his club. Landon was named general manager of the Indians in 1982, and in 1989 he was selected the winner of the James C. Hendy Memorial Award as the league's outstanding executive. \nLandon was the GM of Springfield's back-to-back Calder Cup championship teams in 1990 and 1991, an even more impressive feat considering the titles were won with two different NHL affiliates (New York Islanders, Hartford Whalers). Then in 1994, with the Indians moving to Worcester, Landon helped organize a group of investors and purchased an expansion franchise to keep the American Hockey League in Springfield. \nLandon was president and general manager of the Springfield Falcons from their inception in 1994 until stepping down in 2014. He has since continued to serve the club as director of hockey operations, and enters his 39th season as an executive in Springfield in 2015-16. \nFor his outstanding career contributions to the American Hockey League, Landon received the prestigious Thomas Ebright Award in 2002. \nBruce Cline Four-time Calder Cup winner Bruce Cline spent 13 seasons in the American Hockey League, making his name as one of the AHL's all-time great scorers. \nMaking his AHL debut in 1955-56, the Quebec native notched 57 points in 64 games, helping the Providence Reds' turnaround from last-place finisher the year previous to Calder Cup champions. Cline captured the Dudley (Red) Garrett Memorial Award as the AHL's outstanding rookie and played 30 games the following season with the New York Rangers, what would be the only National Hockey League stint of his career. \nAfter three seasons with Providence, Cline skated for the Buffalo Bisons in 1958-59, tallying 61 points in 70 games and reaching the Calder Cup Finals. He then began an impressive four-year run with the Springfield Indians, where he was a key member of the greatest dynasty in AHL history. The Indians won three consecutive championships in 1960, 1961 and 1962, and Cline ranked among the league's top goal-scorers over that time. He was named a First Team AHL All-Star in 1961 and was a Second Team selection in 1963. \nCline joined the Hershey Bears and finished his playing career there, playing five seasons in Chocolatetown. He retired with 321 goals – including eight 20-goal seasons – and 452 assists for 773 points in 823 regular-season games played in the American Hockey League, and was a prolific postseason performer as well: Cline's 89 games and 58 points in Calder Cup Playoff action still rank among the league's all-time leaders. \nClick here for the full release that included the full Hall of Fame class and their statistics.", "external_links": [], "published": "2015-10-02T22:53:00.000+03:00", "crawled": "2015-10-03T00:49:31.146+03:00", "highlightTitle": ""}