{"organizations": [], "uuid": "2e3e4cfc7014d41dcb04c6b6970a344015c344ed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kptv.com", "main_image": "", "site_section": "http://kptv.com//category/208630/sports?clienttype=rss", "section_title": "KPTV.com - Sports", "url": "http://www.kptv.com/story/30312352/a-look-at-the-halfway-point-in-college-football", "country": "US", "title": "A look at the halfway point in college football", "performance_score": 0, "site": "kptv.com", "participants_count": 1, "title_full": "A look at the halfway point in college football - KPTV - FOX 12", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "2e3e4cfc7014d41dcb04c6b6970a344015c344ed"}, "author": "cbs8", "url": "http://www.kptv.com/story/30312352/a-look-at-the-halfway-point-in-college-football", "ord_in_thread": 0, "title": "A look at the halfway point in college football", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By The Associated Press\nThe college football season is only half over and already four FBS coaches have been fired, one was suspended for three games and another future Hall of Famer has resigned. Four preseason top-10 teams are no longer ranked. Injuries to key players have been rampant. Scoring is up as long as Wake Forest is not involved.\nMichigan and Florida are back. Texas is not - yet.\nLeonard Fournette has exceeded his hype. Jeremy Johnson has not lived up to his.\nOhio State's quarterback competition is still going.\nThe good and the bad, awesome and awful, of the first seven weeks of the season:\nMost surprising undefeated team: No. 12 Iowa.\nSure the schedule has set up nicely for Iowa's 7-0 start, but only the most optimistic Hawkeyes fans believed that their team would be one upset in the Big Ten title game away from the College Football Playoff. Ferentz forever!\nMost disappointing team: Georgia Tech.\nAuburn, USC, Georgia and Oregon have slid from top 10 to out of the rankings and Arkansas and Tennessee went from programs on the rise to teams scarmbling to get bowl eligible. The Yellow Jackets, though, have totally tanked. After winning 11 games last season, Georgia Tech has lost five straight, four in the Atlantic Coast Conference.\nBest coaching job (head coach): Kyle Whittingham, Utah\nWhittingham lost both his offensive and defensive coordinators after last season and not only has there been no drop-off but the Utes have been even better. They just do not beat themselves. Utah is third in the nation in turnover margin at plus-12 and ninth in fewest penalties per game at 4.5.\nBest coaching job (coordinator): Brent Venables, Clemson\nMuch of the ferocious defense the Tigers fielded last season is playing in the NFL this season. Despite the departures, inexperience and less-than-ideal depth, Venables' guys rank 13th in the nation at 4.41 yards allowed per play and fourth in tackles for loss at 9.33 per game.\nBest turnaround by a first-year coach not named Jim: Pat Narduzzi, Pittsburgh.\nJim Harbaugh (Michigan) and Jim McElwain (Florida) have received much-deserved praise for quickly getting the Wolverines and Gators back into the national conversation, but how about a little love for the former Michigan State defensive coordinator? The 25th-ranked Panthers (5-1) have almost matched last season's win total even though star running back James Conner (knee) was lost for the season in the opener.\nBreakout player (offense): Christian McCaffrey, RB, Stanford.\nThe sophomore and son of former NFL receiver Ed McCaffrey was expected to be versatile and important cog in the Stanford offense, but he has emerged as its best player. He is third in the nation in yards from scrimmage (169.3 per game), behind only LSU's Leonard Fournette and Florida State's Dalvin Cook. More on those two later.\nBreakout player (defense): Carl Nassib, DE, Penn State.\nThe former walk-on and first-year starter leads the nation with 11.5 sacks while doing his best J.J. Watt impersonation.\nBreakdown player: Jeremy Johnson, QB, Auburn.\nMaybe it's not fair, but coach Gus Malzahn did nothing to tamp down the hype entering Johnson's first season as the Tigers' No. 1 quarterback. Johnson has thrown six interceptions and was benched for redshirt freshman Sean White after three starts.\nBest injury replacement: DeShone Kizer, QB, Notre Dame.\nSo many good players have gone down, but none had more pressure than Kizer, the redshirt freshman who stepped in when Malik Zaire broken an ankle in the second week of the season. Kizer threw a last-minute, game-winning TD pass in his first game and ranks 16th in the nation in passer rating (156.91) just behind Cal star Jared Goff and just ahead of Clemson's Deshaun Watson.\nPlayer who most deserves a hug: Mistakes happen. Michigan punter Blake O'Neill made a big one. But there has never been a game decided by one player and one play.\nBest footballing: Michigan State WR Aaron Burbridge against Michigan CB Jourdan Lewis.\nThe individual matchup of two of the best in the country at their positions was a joy to watch. The best moment came in the fourth quarter. Connor Cook made a beautiful back-shoulder throw down the sideline. Lewis had excellent coverage. Bubridge came back and made a great catch. If football can be art, that play should hang in the Met.\nWorst footballing: Wake Forest vs. Boston College.\nWake won 3-0 with five first downs but the last two minutes turned into a Shakespearean-level tragicomedy. BC fumbled the ball away in position to at least kick a tying field. The Demon Deacons fumbled the ball back at their 11 trying to run out the clock. BC took over with 56 seconds left, ran three plays and ran out of time at the 1. No better case could be made for soccer replacing football as America's favorite sport.\nWorst firing: North Texas.\nThere is no great way to fire somebody.\nIllinois got rid of Tim Beckman before the season even started. Maryland fired Randy Edsall a day after the Terps lost to Ohio State. Southern California terminated Steve Sarkisian after his personal issues became too much to manage.\nNone was as bad as the way North Texas fired Dan McCarney, who was canned right after the Mean Green were hammered on homecoming 66-7 by FCS Portland State. It was clear even going into the game that the end was approaching for McCarney, but athletic director Rick Villareal did not even let the coach hold a postgame news conference. McCarney, who just two seasons ago won a bowl game at North Texas, deserved better.\nCoaches on hot seat\nFollowing-up a suspension for violating school policy on contacting faculty by missing out on the postseason would likely put Rutgers coach Kyle Flood in dicey spot.\nOthers who likely need good finishes to keep their jobs (alphabetical order).\nAl Golden, Miami\nDarrell Hazell, Purdue\nMike London, Virginia\nScott Shafer, Syracuse\nCoaches who could be joining Steve Spurrier in retirement\nFrank Beamer, Virginia Tech. The future Hall of Fame coach won't be fired, but with the Hokies at it's looking more and more as if there will be some potentially difficult conversations in Blacksburg between Beamer and athletic director Whit Babcock.\nGeorge O'Leary, UCF. Probably heading for retirement regardless of how his winless team finishes.\nHot coaches\nExpect to hear these coaches from Group of Five schools mentioned a lot when searches start heating up (alphabetical order).\nJeff Brohm, Western Kentucky\nP.J. Fleck, Western Michigan\nJustin Fuente, Memphis\nMatt Campbell, Toledo\nMatt Rhule, Temple\nMatt Wells, Utah State\nHalf-way Heisman\n1. Leonard Fournette, LSU\n2. Trevone Boykin, TCU\n3. Dalvin Cook, Florida State\nTop four right now (not that important)\n1. Utah\n2. TCU\n3. Clemson\n4. Ohio State\nProjecting the playoff (much more important)\n1. Ohio State\n2. Baylor\n3. Alabama\n4. Notre Dame\n___\nCopyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-21T03:00:00.000+03:00", "crawled": "2015-10-21T11:10:57.924+03:00", "highlightTitle": ""}