{"organizations": [], "uuid": "d2f1ad8ffa0e6066a3704ed9a33dc777f2d6b713", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kentucky.com", "main_image": "http://media.kentucky.com/smedia/2015/10/01/18/40/uRnFx.AuSt.79.jpeg", "site_section": "http://www.kentucky.com/232/index.rss", "section_title": "Kentucky.com -- Sports Update", "url": "http://www.kentucky.com/2015/10/01/4066335/as-keeneland-meet-opens-americas.html", "country": "US", "title": "As Keeneland meet opens, America's hottest jockey has the horses to steal the show", "performance_score": 0, "site": "kentucky.com", "participants_count": 1, "title_full": "As Keeneland meet opens, America's hottest jockey has the horses to steal the show", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T01:39:00.000+03:00", "replies_count": 0, "uuid": "d2f1ad8ffa0e6066a3704ed9a33dc777f2d6b713"}, "author": "awincze@herald-leader.com (Alicia Wincze Hughes)", "url": "http://www.kentucky.com/2015/10/01/4066335/as-keeneland-meet-opens-americas.html", "ord_in_thread": 0, "title": "As Keeneland meet opens, America's hottest jockey has the horses to steal the show", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "As Keeneland meet opens, America's hottest jockey has the horses to steal the show By Alicia Wincze Hughes awincze@herald-leader.com October 1, 2015 Updated 7 hours ago 2015-10-02T04:14:06Z \nJockey Florent Geroux rode Work All Week to victory in the Breeders' Cup Sprint last year. This year, the native of France sits 12th in the nation with earnings of $6,866,268. JAE C. HONG — Associated Press \nKeeneland \nFall Meet: Friday through Oct. 24 (Racing every Wed.-Sun. First post, 1:05 p.m.) \nPrelude to the Cup: Oct. 29 \nBreeders' Cup World Championships: Oct. 30-31 \nThis weekend: Keeneland hosts its annual Fall Stars Weekend to open the meet, featuring nine graded stakes races worth $3.7 million, including seven Breeders' Cup \"Win and You're In\" events. \nMore information: 1-800-456-3412 or Keeneland.com \nKeeping up with Keeneland \nONLINE \nKentucky.com: The Herald-Leader's Alicia Wincze Hughes provides updates from the track throughout the meet on her blog: HorseRacing.bloginky.com . \nTwitter: Follow Alicia @horseracinghl \nTV \nLive racing: TVG shows every Keeneland race live, beginning at 1:05 p.m. \nRacing replay: Today at Keeneland , a nightly 30-minute show on The CW Lexington (10 p.m.), wraps up each day's races. \nThis weekend: Saturday's Shadwell Turf Mile and Claiborne Breeders' Futurity will be shown live on NBC from 5-6 p.m. Sunday's Juddmonte Spinster Stakes and Dixiana Bourbon Stakes will be live on NBC from 5-6 p.m. \nRADIO \n■ HorseRacingRadio.net will live stream most of Keeneland's major stakes races, which also can be found on WLXO-FM 96.1. \n■ Equine Forum, hosted by the Horse Racing Radio Network, airs Saturdays at 8 a.m. on WLXO-FM 96.1 and HorseRacingRadio.net . \nThe ringing in Doug Bredar's ears hasn't been this pronounced since his days as racing secretary at Churchill Downs, trying to oversee the most important week of racing at Thoroughbred racing's most famous track. \nBredar can barely go the length of a backstretch now without fielding multiple calls or heeding the ping of yet another text message — a small price to pay for the book of the jockey who appears magnetically drawn to the winner's circle of late. \n\"I was telling someone the other day, when I was racing secretary it would really get busy Derby week and that week the phone just wouldn't stop,\" said Bredar, the longtime racing official-turned-jockey's agent. \"And that's how my phone has been since Kentucky Downs. It's a good feeling to know that the business is coming in; it's awesome.\" \nWhen Bredar first met jockey Florent Geroux in 2010, they took a leap of faith that each could be what the other needed to ignite them on their respective career paths. \nHeading into the start of Keeneland's 17-day Fall Meet, during which Geroux will be a full-time fixture, it can be argued Bredar represents the hottest jockey in the nation. From flat-out owning Kentucky Downs, where he won 12 races during the five-day meet, to being the regular pilot for Grade I winners The Pizza Man and Work All Week — both of whom will have their final Breeders' Cup prep races the next two days — Geroux's bright, friendly eyes and skilled hands are seeing and moving as well as any top-level rider on any circuit. \nThe 29-year-old native of France already has surpassed his previous best single-season mark for earnings, sitting 12th in the nation with a bankroll of $6,866,268. Days after winning five races on a single card at Kentucky Downs for the second time during the micro-meet, Geroux picked up the third Grade I win of his career aboard the Larry Jones-trained filly I'm a Chatterbox in the $1 million Cotillion at Parx on Sept. 19. He also boasts a remarkable 28 percent win percentage over the past 30 days. \n\"I think he's able to keep his head in his helmet right now and stay humble and work hard,\" said Richard Papiese of Midwest Thoroughbreds, which owns The Pizza Man, likely favorite for Saturday's Grade I Shadwell Turf Mile, and reigning Eclipse Award Sprint champion Work All Week, defending winner of Friday's Grade III Phoenix Stakes. \"It's all about working. Once you feel like you're there, you're probably nowhere. But things are going so well for him. \n\"He's matured. He has ice water in his veins. You don't worry about him. I told him last year he was ready for prime time.\" \nSlow start \nThe past 12 months have been dotted with career-shaping moments for Geroux: his arms raised triumphantly after guiding Work All Week to victory in the Breeders' Cup Sprint in November, his emphatic gesturing to the Arlington Park crowd after bringing the house down when The Pizza Man became the first Illinois-bred to win the Grade I Arlington Million on Aug. 15. \nHe still rides with a hint of the more upright European style, but Geroux is otherwise unrecognizable from the jockey who initially struggled to transition to the stateside way of racing when he moved to California in 2007. He was winless in the 10 mounts he was able to book that year. Visa problems caused him to return to Europe for a few months, and then there was the broken wrist and fractured vertebrae he suffered during a spill at Keeneland that October. \nThe thought of simply remaining in France for good couldn't help but cross Geroux's mind during his recuperation. What he needed was some outside belief in his ability, which is what trainer and fellow Frenchman Patrick Biancone provided when he arranged for Geroux and Bredar to meet in 2010. \n\"I had been racing secretary and ... I just needed to try something different. Patrick said, 'Come to the barn, I've got someone you probably would like to meet,'\" said Bredar, who was racing secretary at Churchill Downs from 2002-06. \"Patrick told Florent, 'If this guy wants to take your book, you do it.' I shook his hand and said, 'When do we start?' \n\"It was incredibly challenging. It was a huge transition for both of us,\" he said. \"We both learned a lot, and I realized early on that he was a really sharp kid. Maybe the talent wasn't quite there yet but I knew he was really smart so that part stuck. We had our moments. We went 1-for-57 at Gulfstream that winter. But every meet we went to things just got a little bit better.\" \nGeroux's lone win during that Gulfstream Park meet was on Dade Babe, a filly who later gave him his first graded stakes win in the 2010 Grade III Pucker Up Stakes. \nTrainers like Wayne Catalano and Roger Brueggemann began steadily throwing their support behind Geroux's cool-headed style. But what has helped sell Geroux most is his ability to build off of crucial opportunities, like following up on his breakout Breeders' Cup win with the best riding of his life. \n\"Myself, I know I can do it, but you need to prove it to other people. People want to see results in the races,\" Geroux said. \"Slowly but surely I started getting on some better mounts, and ... those kind of horses can put you on the map.\" \nThe Pizza Man \nIn December 2011, Geroux got on the Brueggemann-trained gelding The Pizza Man for the first time. The career progressions of rider and horse have mirrored each other ever since. The 6-year-old bay gelding has gone from steady stakes performer, to locally loved Grade III winner, to a horse who could head to the Breeders' Cup with divisional honors a win away. \n\"I think (The Pizza Man) is like a good wine, he's getting better with age,\" Geroux said. \"He's just a horse who has a very big desire to win, he likes to be in a fight. The break over the winter really helped him. When he came back this year, he was a different horse. He was a very good horse last year, but he's almost a better horse this year.\" \nOngoing strife in the Illinois racing circuit has forced some of its mainstay participants like Midwest Thoroughbreds and Brueggemann to shift their focus elsewhere. Count Geroux in that equation, as he sold his house in Chicago and will be based more in Kentucky. \nWith I'm a Chatterbox already bound for the Breeders' Cup Distaff and Work All Week and The Pizza Man likely for the Sprint and Turf, respectively, Bredar's phone will be a soundtrack of success now that his jockey has the full attention of the racing community. \n\"Plenty of jockeys have made it to the top and then go down quick, so you have to make sure you keep humble, keep your head on your shoulders,\" Geroux said. \"Keep working hard, and anything can happen.\" \nOpening weekend stakes races \nFRIDAY \nGrade III , $250,000 Stoll Keenon Ogden Phoenix Stakes for 3-year-olds and up going six furlongs. Eclipse Award champion Work All Work won this race a year ago en route to taking the Breeders' Cup Sprint. His main challenge figures to come from Grade I winner Runhappy, but that one will have to overcome breaking from the inside rail. \nGrade I, $400,000 Darley Alcibiades for 2-year-old fillies going 1 1 ⁄ 16 -miles. Undefeated Dothraki Queen looks to give trainer Ken McPeek his fourth win in the Alcibiades as she comes into the race off a half-length win in the Grade II Pocahontas going 11⁄16 miles at Churchill Downs on Sept. 12. \nSaturday \nGrade III , $150,000 Woodford Stakes for 3-year-olds and up going 5 1/2 furlongs on the turf. Undrafted, winner of the Group I Diamond Jubilee at Royal Ascot in June, headlines a full field of 14 and is coming off a runner-up finish in the More Than Ready at Kentucky Downs on Sept. 5. \nGrade II, $250,000 Thoroughbred Club of America Stakes for fillies and mares 3-years-old and up going 6 furlongs. Judy the Beauty, winner of the 2013 edition of the TCA, seeks her first win in three starts this year in preparation for her attempted defense of the Breeders' Cup Filly & Mare Sprint. \nGrade I, $400,000 First Lady Stakes for fillies and mares 3-year-olds and up going 1 mile on the turf. Grade I winner Tepin stands as the class of the 11-horse field but will have her work cut out having to break from the far outside post. \nGrade I, $500,000 Claiborne Breeders' Futurity for 2-year-olds going 1 1 ⁄ 16 miles. Keith Desormeaux trainee Exaggerator stands as the 7-2 favorite coming off his bullish victory in the Grade II Saratoga Special. \nGrade I, $1 million Shadwell Turf Mile for 3-year-olds and up going 1 mile on the turf. Veteran gelding The Pizza Man has hit his peak at age 6, winning the Grade I Arlington Million in August. He was a stakes winner at the 1 mile earlier in his career. \nSunday \nGrade III, $250,000 Dixiana Bourbon Stakes for 2-year-olds going 1 1 ⁄ 16 -miles on the turf. The exceptional field size for Keeneland's first three cards continues in this spot with an overflow field of 14 entered. \nGrade I, $500,000 Juddmonte Spinster for fillies and mares 3-years-old and up going 1 1 ⁄ 8 miles. It's a showdown between Kentucky Oaks winners with 2014 heroine Untapable looking to regain the form that made her a divisional champion and this year's Oaks winner Lovely Maria seeking to halt a two-race losing skid. Alicia Wincze Hughes: (859) 231-1676. Blog: horseracing.bloginky.com. Twitter: @horseracinghl.", "external_links": [], "published": "2015-10-02T01:39:00.000+03:00", "crawled": "2015-10-02T13:55:29.114+03:00", "highlightTitle": ""}