{"organizations": ["Clemson", "ESPN"], "uuid": "ba4bb026d7c027a84bf302fdc5d2bce592157088", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.greenvilleonline.com", "main_image": "http://www.gannett-cdn.com/-mm-/ae9d618bdcb3a7c05d141d3953c5d920e37192a6/c=0-48-950-585&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/01/CarolinaGroup/Greenville/635792988145603776-Clemson-002397.JPG-copy.jpg", "site_section": "http://rssfeeds.greenvilleonline.com/greenville/sports", "section_title": "Greenville - Sports", "url": "http://www.greenvilleonline.com/story/sports/college/clemson/2015/10/01/clemson-football-rain-forecast-notre-dame/73144900/", "country": "US", "title": "Weather threats not affecting Clemson, ESPN plans", "performance_score": 0, "site": "greenvilleonline.com", "participants_count": 0, "title_full": "Weather threats not affecting Clemson, ESPN plans", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T00:17:00.000+03:00", "replies_count": 0, "uuid": "ba4bb026d7c027a84bf302fdc5d2bce592157088"}, "author": "", "url": "http://www.greenvilleonline.com/story/sports/college/clemson/2015/10/01/clemson-football-rain-forecast-notre-dame/73144900/", "ord_in_thread": 0, "title": "Weather threats not affecting Clemson, ESPN plans", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mandrallius Robinson"], "text": "Weather threats not affecting Clemson, ESPN plans Mandrallius Robinson , Sports Columnist 5:17 p.m. EDT October 1, 2015 Buy Photo 197 CONNECT 12 TWEET LINKEDIN 3 COMMENT EMAIL MORE \nRecords could be broken at Clemson Memorial Stadium on Saturday night, but not simply in attendance figures and passing yards. \nA “historic, potentially life-threatening rainfall event” is expected to pour over the Upstate this weekend, according to the National Weather Service. Nearly a foot of rain is forecasted to hit the Upstate. Frank Howard Field could be soaked Saturday night when Clemson hosts Notre Dame. \nDespite the threat, Clemson has no plans to alter its schedule for the game. \nAccording to a spokesman in the Clemson athletic department, school officials “will continue to monitor the changing weather conditions” and have been “in contact with the National Weather Service and the Atlantic Coast Conference.” \nAccording to the weather service, the system responsible for the expected rainfall is independent of the potential impact of Hurricane Joaquin. \nAccording to the Clemson spokesman, at this time, the school is preparing to hold all events as scheduled, unless authorities advise otherwise. The spokesman said Clemson officials are confident in the drainage system on the field and if plans are altered, Clemson will inform “fans, guests and students immediately.” \nESPN’s popular pre-game show “College GameDay” is scheduled to broadcast live from Clemson’s campus Saturday morning. Crews began assembling sets on Bowman Field on Thursday morning. According to Rachel Margolis Siegal, ESPN College Sports Public Relations Manager, the forecasts have not prompted any plans to move the show indoors. \nLouisiana State University cancelled its season opener Sept. 5. The scoreless game against McNeese State initially was suspended with 10:08 remaining in the first quarter after lightning struck near Tiger Stadium. After a three-hour delay, LSU athletic director Joe Alleva announced the game was canceled and would not be rescheduled. \nThe fallout from the cancellation explains team’s reluctance to cancel or postpone a game. The inconvenience is expensive. According to a report from The Advocate , Alleva estimated the final cost for LSU to refund tickets at face value and honor contracts for game expenses for that canceled opener will fall between $1.2 million and $3.2 million. The most expensive face value for that ticket was merely $35. The face value for a top deck ticket for Notre Dame-Clemson is $85. 197 CONNECT 12 TWEET LINKEDIN 3 COMMENT EMAIL MORE Read or Share this story: http://grnol.co/1FIumzc TOP VIDEOS", "external_links": [], "published": "2015-10-02T00:17:00.000+03:00", "crawled": "2015-10-02T22:06:39.069+03:00", "highlightTitle": ""}