{"organizations": ["Facebook", "Mt. Vernon Facebook Email Twitter Google"], "uuid": "8a870f9005bf005178cc0fe364f150583f644d9e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.indystar.com", "main_image": "http://www.gannett-cdn.com/-mm-/df338d76824f4df17a50484bbf5c78454416288e/c=0-59-640-421&amp;r=x633&amp;c=1600x630/local/-/media/2015/10/05/Indianapolis/Indianapolis/635796311315262888-Mike.Ertel.jpg", "site_section": "http://rssfeeds.indystar.com/indystar/allsports", "section_title": "Indystar - All Sports", "url": "http://www.indystar.com/story/sports/college/indiana/2015/10/07/ius-offensive-line-looks-recover-stressful-performance/73464322/", "country": "US", "title": "Preseason Fab 15 countdown: No. 14 Mt. Vernon", "performance_score": 0, "site": "indystar.com", "participants_count": 0, "title_full": "Preseason Fab 15 countdown: No. 14 Mt. Vernon", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T15:06:00.000+03:00", "replies_count": 0, "uuid": "8a870f9005bf005178cc0fe364f150583f644d9e"}, "author": "", "url": "http://www.indystar.com/story/sports/college/indiana/2015/10/07/ius-offensive-line-looks-recover-stressful-performance/73464322/", "ord_in_thread": 0, "title": "Preseason Fab 15 countdown: No. 14 Mt. Vernon", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kyle Neddenriep"], "text": "Facebook Email Twitter Google+ LinkedIn Pinterest Preseason Fab 15 countdown: No. 14 Mt. Vernon From now until the beginning of the high school boys basketball season we'll be counting down the Preseason Fab 15, a ranking of the top teams in Post to Facebook Preseason Fab 15 countdown: No. 14 Mt. Vernon From now until the beginning of the high school boys basketball season we'll be counting down the Preseason Fab 15, a ranking of the top teams in Check out this story on IndyStar.com: http://indy.st/1LfE509 Cancel Send A link has been sent to your friend's email address. Posted! A link has been posted to your Facebook feed. Join the Conversation Kyle Neddenriep , kyle.neddenriep@indystar.com 8:06 a.m. EDT October 6, 2015 Buy Photo \nMichael Ertel (Photo: Indy Star) \nFrom now until the beginning of the high school boys basketball season we'll be counting down the Preseason Fab 15, a ranking of the top teams in Central Indiana. We started with No. 15 Pendleton Heights . Next on our list: \nNo. 14 – Mt. Vernon \nComing off a promising 13-9 season, Mt. Vernon returns nearly all of its roster. Third-year coach Travis Daugherty likes his team, but with experience comes increased expectations. He's curious to see how the Marauders handle it. \n\"Ultimately, we haven't proved anything,\" Daugherty said. \"That's the challenge with us. We're better than we've been but there's not one team on our schedule that's going to give us anything. The hardest step moving forward is going from a really good team to an elite team in our area of the state.\" \nMt. Vernon was close to breaking through last year. The Marauders lost all nine games last year by 10 points or less and four by four points or less. A one-point overtime win over Noblesville in February was probably the most impressive of the season, though there were close calls to teams like Howe, Hamilton Southeastern and Lawrence Central. \nThe Marauders return almost entirely intact. A strong junior class is led by 6-foot point guard Michael Ertel (15.3 ppg, 3.1 rebounds, 3.0 assists) and 6-5 forward Erick Shepherd (13.3 ppg, 6.1 rebounds). \n\"Obviously we have guys who have been through it now and most of our primary players have played multiple seasons of varsity basketball,\" Daugherty said. \"Last year was important for us to take that next step forward. When you tell people you are young, that doesn't necessarily make you feel better about not getting over that hump. Sometimes part of the process at this level is to learn how to play night in and night out at a level that is required to win. By the end of the year I think we had a good idea of that.\" \nDaugherty, who coached five years at Tipton and four at Bishop Chatard before coming to Mt. Vernon in 2013, brings back several others along with Ertel and Shepherd. Miles Wayer , a 6-foot senior, averaged 10.6 points last season and shot 43 percent (49-for-113) from the 3-point line. Michael Thompson , a 6-4 senior, averaged 9.6 points, 5.7 rebounds and 3.2 assists last season. James McCloud , a 6-4 junior, averaged 5.5 points and 3.6 rebounds and may be the team's most improved player, Daugherty said. HS basketball preseason Fab 15: No. 15 Pendleton Heights \n\"I think all of our guys are capable of spreading the floor and making plays off the dribble,\" Daugherty said. \"This group has potential to put bigger defenders in a bind to deal with those guys on the outside. The strength of our team is our ability to spread out and shoot and attack off the dribble.\" \nErtel is the leading returning scorer but is also expected to distribute the ball and make the team go. \n\"He really surprised some people with his scoring last year,\" Daugherty said. \"This year, I think there will be games where he scores a lot but also he's going to get others involved. A lot of our success, not only with him but everyone, will depend on how well we are willing to share with each other. We've got a lot of depth in our skill. We have an unselfish group that plays for each other.\" \nShepherd dislocated his kneecap in June but is back to full speed. Daugherty said he sensed that the time off has reignited the fire in Shepherd's game. McCloud has impressed with his improvement and work ethic since the end of his sophomore year. \n\"The three (juniors) have gotten better since last year not just from a skill-level but understanding the game,\" Daugherty said. \"They are developing more leadership and raising the level of the guys around them. You won't be able to win unless guys do that.\" \nWayer also provides leadership, as well as his ability to knock down shots from the 3-point line. He was 4-for-9 from 3 in a 71-61 loss to Richmond in the sectional last year. \n\"He's the kind of kid you feel lucky to be able to coach,\" Daugherty said. \"He doesn't care about the unimportant stuff. He's the same guy every day.\" \nAnother senior who could play a role is Abraham Hadley , a 6-5 transfer from Horizon Christian. Hadley, who is 260 pounds, provides another inside presence. Demari Gatewood , a 6-1 sophomore, is an excellent athlete and will also see key minutes. \nThe perception of Mt. Vernon will change this season with so much experience returning. \n\"We'll see how we deal with the expectations,\" Daugherty said. \"In two years here, I don't think we've walked into too many real high-level games as the favorite. That will start to shift some this year. We'll see if we can handle it the right way. It's different when people expect you to win. I'm excited to see. That's why these guys have put the work in to be an elite program.\" \nWhy Mt. Vernon could be higher: The Marauders weren't far from being a 17- or 18-win team last season. They will be able to spread the floor with skilled players, making it tough for opponents to match up. It wouldn't be a surprise to see Mt. Vernon take another leap forward this year. \nWhy Mt. Vernon could be lower: As Daugherty pointed out, this team hasn't proven anything yet. It was improved last year but wasn't able to get over the hump and win close games against good teams. \nCircle the date: \nDec. 11, at Pendleton Heights. The schedule should allow for a good start. This game against its Hoosier Heritage Conference rival will be a good early test. Read or Share this story: http://indy.st/1LfE509 Most Popular", "external_links": [], "published": "2015-10-06T15:06:00.000+03:00", "crawled": "2015-10-08T03:07:34.063+03:00", "highlightTitle": ""}