{"organizations": [], "uuid": "6bab592f88f72eb219ad1e630311dbcaa70bf88a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.torontosun.com", "main_image": "http://storage.torontosun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297755514500_LARGE_BOX.jpg?quality=80&stmp=1443757588169&size=100x", "site_section": "http://www.torontosun.com/sports/hockey", "section_title": "Hockey | Sports | Toronto Sun", "url": "http://www.torontosun.com/2015/10/01/jets-need-youth-movement", "country": "CA", "title": "Winnipeg Jets youth movement will free up salaries for veteran contracts | Home", "performance_score": 0, "site": "torontosun.com", "participants_count": 1, "title_full": "Winnipeg Jets youth movement will free up salaries for veteran contracts | Home", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T11:16:00.000+03:00", "replies_count": 0, "uuid": "6bab592f88f72eb219ad1e630311dbcaa70bf88a"}, "author": "torontosun.com", "url": "http://www.torontosun.com/2015/10/01/jets-need-youth-movement", "ord_in_thread": 0, "title": "Winnipeg Jets youth movement will free up salaries for veteran contracts | Home", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "One aspect of the Winnipeg Jets youth movement we don't hear a lot about is the financial need for it.\nAs management gazes into a crystal ball that's showing rich new contracts for, potentially, Andrew Ladd, Dustin Byfuglien, Jacob Trouba and Mark Scheifele, all within the next several months, something has to give.\nEnter rookies like Nikolaj Ehlers, Nic Petan and Andrew Copp for higher-paid vets like Michael Frolik and Jim Slater.\nThe low end of the roster has to free up cash for the top end, especially when you're a budget team like the Jets.\nThat Ehlers, Petan and Copp look ready to contribute no doubt lessens the unease team brass might be feeling heading into the season.\nEhlers broke out offensively with a pretty goal and an assist in Thursday's 3-1 pre-season win over Calgary, while Petan showed off his hands by setting up one of Scheifele's two goals.\nCRUNCH TIME FOR LATE BLOOMER\nAustrian winger Thomas Raffl, the 29-year-old here on a tryout, with no contract, can't seem to buy a goal – so he tried to make an impact with his fists, Thursday.\nUnfortunately for him, teammate Anthony Peluso stepped in before he could get swinging with the Flames' Brandon Bollig.\nNo matter how it turns out, Raffl has been one of the most intriguing stories of camp, a late-bloomer who grew up dreaming of making the NHL while playing shinny in Villach, Austria.\n“It's probably the same everywhere -- it's not only in Canada,” Raffl told me before the game. “As kids you play pond hockey and all you dream about is the NHL. It was Gretzky here, Gretzky there, and you want to be playing there.\n“I got a chance now at 29 years... after all those years I've been working so hard. My development kicked in pretty late. Most of the other guys are at the point I'm at right now at 24 or 25. I've got a little disadvantage at that, but I feel great and I'm ready to play.”\nAs well put-together as he is spoken, Raffl wasn't worried about where he stood going into the last two pre-season games.\nHe says going into camp he decided to just give it his all for three weeks and see what happens.\nHe's done everything pretty well – except put the puck in the net when he got the chance.\nYou can't help but wonder if he needs to bury one in order to put himself above the younger prospects vying for the same jobs.\n“I don't need to -- but I hope it's going to pop in,” he said.\nOne thing Raffl does need: to end camp with no regrets, knowing he gave it his best shot.\n“That's what I want to make sure.”\nIf the Jets don't want him, he'll head back to Salzburg, in Austria, where he scored 26 goals in 52 games last season.\nON THE VERGE\nAs solid as Copp has looked and as much as he's played, he appears to have one mitt on the fourth-line centre position.\nBut the University of Michigan product said he had no idea where he stood going into Thursday's game.\n“I'm still here which is all I need to know,” Copp said. “Hopefully the chips fall the right way for me. All you can ask for in the pre-season is to play a decent amount of games, and I'm playing my fifth. Just compete and show coach I deserve to be on the team and try to earn his trust.”\nA fourth-round draft pick in 2013, Copp joined the Jets out of university late last season and played one game.\nHis first pro training camp hasn't offered up too many curve balls.\n“I came in with an open mind. It's been a grind, especially once we got into the pre-season... I started to feel better and better and am trying to improve every day. It's been a pretty smooth camp actually.\n“Coming in last year for a bit and knowing all the guys made it a lot easier.”\nWhile he isn't ready to set any goals for the season, Copp does allow himself to contemplate the type of NHL player he hopes to become: a two-way contributor.\n“I've worked my way from the bottom, up, everywhere I've gone,” he said. “So you're hoping that's going to be the same scenario.”\nD IS FOR DECISION\nThree defencemen – Adam Pardy, Paul Postma and Jay Harrison – are vying for what are likely to be two extra spots on the Jets blue line.\nCoach Paul Maurice is likely to go with 13 forwards and eight defencemen to start the season.\n“Probably,” the coach said. “We may have to make a decision.”\nBarring a trade, one of the three will be sent down to the AHL.\nBut he'll have to clear waivers first.\nWING NIGHT\nMaurice put a few players, Petan and Raffl included, on their wrong wings for Thursday's game, just to see how they handled it.\nA little versatility can go a long way.\n“Up front you just love the guys that were centremen and now can play either wing, because you can just find a place for them all over your lineup,” Maurice said. “And we didn't have any of that a year and a half ago. When Scheifele went down we were in a lot of trouble – we just didn't have any centre-ice men, and the wingers were lefties and didn't like going to the other side.”\npaul.friesen@sunmedia.ca\nTwitter: @friesensunmedia\nWinnipeg Jets youth movement will free up salaries for veteran contracts\nBy Paul Friesen , Winnipeg Sun First posted: Thursday, October 01, 2015 11:16 PM EDT | Updated: Thursday, October 01, 2015 11:39 PM EDT\nOne aspect of the Winnipeg Jets youth movement we don't hear a lot about is the financial need for it.\nAs management gazes into a crystal ball that's showing rich new contracts for, potentially, Andrew Ladd, Dustin Byfuglien, Jacob Trouba and Mark Scheifele, all within the next several months, something has to give.\nEnter rookies like Nikolaj Ehlers, Nic Petan and Andrew Copp for higher-paid vets like Michael Frolik and Jim Slater.\nThe low end of the roster has to free up cash for the top end, especially when you're a budget team like the Jets.\nThat Ehlers, Petan and Copp look ready to contribute no doubt lessens the unease team brass might be feeling heading into the season.\nEhlers broke out offensively with a pretty goal and an assist in Thursday's 3-1 pre-season win over Calgary, while Petan showed off his hands by setting up one of Scheifele's two goals.\nCRUNCH TIME FOR LATE BLOOMER\nAustrian winger Thomas Raffl, the 29-y\nAbout the author Paul Friesen Follow Paul Friesen on Twitter Other Stories 20-year-old forward Nic Petan making strong case to make Winnipeg Jets out of training camp\nHe'd grabbed the puck in the slot and passed up the shot.\n0\nWinnipeg Blue Bombers using hip-hop healing to liven things up after agonizing loss\nThey had three days to curse the officials, wallow in self pity and pick themselves up off the mat, yet again.\n0\nSee more from Paul Friesen »\nTop stories Popular Latest Videos Julian Fantino charged with assault over 1973 arrest\n0\nShould our health-care dollars really go to IVF for all?\n0\nOmar Khadr arrives in Toronto for visit with grandparents\n0\nBlue Jays bench falls short in never-ending Baltimore finale\n0\n'Mr. Big' in '09 drug bust found slain in driveway\n0\nCurves ahead: How plus-size shopping is changing\n0\nCouple locked in abusive marriage need to permanently separate\n0\nDoes your doctor always know best?\n0\n8 ways to reinvigorate your sex life\n0\nQuiz: Test your news knowledge\n0\nZabi Akbari - Witness To Kirby Rd Fatal Crash\nVaughan crash eyewitness\nPlenty Of Work Left For Leafs\nPat Kane Video\nRaptors media day\nMore from Home Curves ahead: How plus-size shopping is changing 0\nCouple locked in abusive marriage need to permanently separate 0\nDoes your doctor always know best? 0\n8 ways to reinvigorate your sex life 0\nQuiz: Test your news knowledge 0\nInside Toronto sun.com Life\nCurves ahead 0", "external_links": ["http://pubads.g.doubleclick.net/gampad/clk?id=182027221&iu=/3081/SMCO_ENUR_TSUN_EN_WEB", "http://pubads.g.doubleclick.net/gampad/clk?id=228633661&iu=/3081/SMCO_ENUR_TSUN_EN_WEB", "http://twitter.com/@friesensunmedia", "http://pubads.g.doubleclick.net/gampad/clk?id=182024221&iu=/3081/SMCO_ENUR_TSUN_EN_WEB", "http://pubads.g.doubleclick.net/gampad/clk?id=183052021&iu=/3081/SMCO_ENUR_TSUN_EN_WEB"], "published": "2015-10-02T11:16:00.000+03:00", "crawled": "2015-10-02T15:03:56.542+03:00", "highlightTitle": ""}