{"organizations": [], "uuid": "5086f196c954e163477b2a41d1c05d1a266f29e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.buffalonews.com", "main_image": "http://www.buffalonews.com/images/BNSocialShareLG.jpg", "site_section": "http://www.buffalonews.com/section/rssGen?profileID=1004&profileName=Sports", "section_title": "The Buffalo News - Sports", "url": "http://www.buffalonews.com/columns/mike-harrington/its-time-for-murray-to-explore-alternatives-in-net-20151025", "country": "US", "title": "It’s time for Murray to explore alternatives in net", "performance_score": 0, "site": "buffalonews.com", "participants_count": 4, "title_full": "It’s time for Murray to explore alternatives in net - Sports - The Buffalo News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T07:13:00.000+02:00", "replies_count": 3, "uuid": "5086f196c954e163477b2a41d1c05d1a266f29e2"}, "author": "Mike Harrington", "url": "http://www.buffalonews.com/columns/mike-harrington/its-time-for-murray-to-explore-alternatives-in-net-20151025", "ord_in_thread": 0, "title": "It’s time for Murray to explore alternatives in net", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "After all, the marketing slogan is “Next Chapter.” When it comes to goaltenders, the Sabres have had lots of practice the last couple of years.\nSaturday’s 4-3 loss to the New Jersey Devils was the tail end of a back-to-back and Buffalo’s third game in four nights. No way Chad Johnson was shouldering that load anyway but in the wake of his meltdown Friday against Montreal, it was certainly time for him to take a break and give someone else a chance.\nNext in line was 22-year-old Linus Ullmark, the latest entry to a bizarre list. Since Ryan Miller was traded to St. Louis nearly 20 months ago, the Sabres have suited up 13 goaltenders. Seriously.\nRecapping all over the map, the baker’s dozen spans from Jhonas Enroth and Michal Neuvirth to near tank-stopper Anders Lindback to prospects Andrey Makarov, Matt Hackett, Nathan Lieuwen and Connor Knapp, to this year’s veteran tandem of Johnson and Robin Lehner. Not to mention the dressed trio of Jaroslav Halak, HarborCenter employee Ryan Vinz and goalie coach Arturs Irbe that never saw the ice.\nFor all the talk about the wonders of Jack Eichel, the debuts of Evander Kane and Ryan O’Reilly and the growth of prospects like Sam Reinhart and Rasmus Ristolainen, it can all be made moot if the goaltending doesn’t hold up. And that’s before we find out what’s up with Kane, who suffered a scary-looking knee injury late in the third period Saturday.\nGeneral Manager Tim Murray has taken some big risks, most that were defensible. The biggest one came over the summer but it has quickly blown up on him.\nFrom that sunny June draft day in Fort Lauderdale when we learned Murray had shipped a first-round draft choice – say what? – to Ottawa for Robin Lehner, it was clear his eggs were all in the basket of the big Swede that he scouted and drafted for the Sens. Lehner hadn’t played since February due to a concussion, came to camp overweight and was clearly slow in the crease.\nAnd then he got hurt in the first game. It was a freak play, a high ankle sprain from catching a rut in his crease. No way it had anything to do with Lehner’s conditioning but it might turn into one of the key moments of the entire season. Murray was suddenly left with Johnson and the world.\nNot what we’ve been used to around here.\nThis is a unique time in Sabres history in goal, and not in a good way. This is a franchise that has almost always had the goaltending box checked off when it started a season.\nWhen you start to think of the names, it’s a who’s who of club history that stretches pretty much through the first 44 years: Roger Crozier. Gary Bromley and Gerry Desjardins. Don Edwards and Bob Sauve. Tom Barrasso and Daren Puppa. Grant Fuhr and Dominik Hasek. Marty Biron. And Miller.\nSince then? Chaos in the crease.\nUllmark is 6-foot-4 and 212 pounds, the kind of big-body prototype that Murray likes in his goalies. While his positioning seemed sound Saturday, Ullmark found trouble when he went down to the ice and wasn’t able to properly track the puck while prone on either of the Devils’ first two goals. And the third goal, by defenseman David Schlemko late in the second period, was a shot that leaked through the five-hole. Rookie or not, that puck has to be stopped.\nCoach Dan Bylsma said Ullmark “looked like an NHL goalie.” Perhaps. Down the road, almost certainly. Right now? Iffy at best. Johnson had been serviceable until giving up four dubious goals in the 7-2 loss to the Habs, his first real black mark on the stat sheet. But his 3.06 goals-against average and .879 save percentage won’t cut it long term.\nUllmark may get more looks with Lehner’s return a timetable that could legitimately take him close to the new year. The season would be long gone by then. This was a year the Sabres were allegedly going to start pushing to win. Right? It’s not going to happen if their goaltending stays 28th in save percentage.\nInitially, Murray’s patient approach has been reasonable. Maybe Johnson can channel some of the strong play he showed a couple of years ago in Boston, although the Sabres’ defense corps isn’t about to be confused with those Bruins.\nBut at this point, it sure looks like Murray overplayed his hand by at least not re-signing Lindback – who made 35 saves Saturday night in Arizona’s win at Ottawa – to compete with Lehner and Johnson. And that trade of Neuvirth for Johnson? Well, of course, we know why that one was done. Neuvirth was playing too well to stay here in the bizarro world of last February and March.\nIf you believe social media, something I don’t recommend, Murray was a fool not to claim Calgary’s Karri Ramo on waivers last week. Never mind that the Flames’ embattled opening night starter has the same save percentage as Johnson, a 4.37 goals-against average and a $3.8 million cap hit.\nRamo cleared and is in the AHL. Who else could Murray look at? Minnesota’s Nicklas Backstrom is 37 and coming off elbow surgery. He was so bad last year that the Wild traded for Devin Dubynk to get their season righted. Still, Murray and Wild GM Chuck Fletcher are the best of friends. Edmonton has buried Ben Scrivens in the minors after he played 57 games for the Oilers last year.\nBylsma put on a happy face about the play in goal, sans the last two nights. As for looking outside he said bluntly, “Not a road we’ve gone down.”\nEven at this early stage of the season, it may be about time to go make that left turn. Murray has lost his leverage and had better accept that fact. I wasn’t big on a quick claim of Ramo, but just about anything else would be better than what the Sabres have in goal right now.\nemail: mharringtonn@buffnews.com", "external_links": [], "published": "2015-10-25T07:13:00.000+02:00", "crawled": "2015-10-26T00:16:42.168+02:00", "highlightTitle": ""}