{"organizations": [], "uuid": "86dc02102b6c0b260126b6ced9dde5e18ef61891", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.lsureveille.com", "main_image": "http://bloximages.newyork1.vip.townnews.com/lsureveille.com/content/tncms/assets/v3/editorial/5/ff/5ffdefca-7568-11e5-a9c1-df87205047fa/562347ad36351.image.jpg", "site_section": "http://www.lsureveille.com//search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&nsa=eedition&c[]=sports,sports/*&f=rss", "section_title": "lsureveille.com - sports,sports/", "url": "http://www.lsureveille.com/daily/lsu-running-back-fournette-packs-a-punch-stiff-arms-his/article_ae8ce10c-75de-11e5-911d-63b89da580f8.html", "country": "US", "title": "LSU running back Fournette packs a punch, stiff arms his way to 180 rushing yards", "performance_score": 0, "site": "lsureveille.com", "participants_count": 1, "title_full": "LSU running back Fournette packs a punch, stiff arms his way to 180 rushing yards", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T00:24:00.000+03:00", "replies_count": 0, "uuid": "86dc02102b6c0b260126b6ced9dde5e18ef61891"}, "author": "cboutw2@lsu.edu(Christian Boutwell -The Daily Reveille)", "url": "http://www.lsureveille.com/daily/lsu-running-back-fournette-packs-a-punch-stiff-arms-his/article_ae8ce10c-75de-11e5-911d-63b89da580f8.html", "ord_in_thread": 0, "title": "LSU running back Fournette packs a punch, stiff arms his way to 180 rushing yards", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "by Christian Boutwell -The Daily Reveille \n“[LSU] Coach [Les] Miles told [us] that this was going to be like a street fight,” a sophomore Fournette said, taking Miles’ advice too literally. \nOn a third-and-four play, Fournette bumped and stumbled his lean, 230-pound muscular body to the right sideline, gaining 12 yards on the attempt and delivering a vicious blow to University of Florida junior defensive back Marcus Maye’s helmet with his left hand. He finished with 180 rushing yards and two touchdowns on a career-high 31 carries in LSU’s (6-0, 4-0 Southeastern Conference) 35-28 win against Florida (6-1, 4-1 SEC) on Saturday night at Tiger Stadium. \nSaturday marked Fournette’s eighth-straight 100-yard rushing game. He paced into the endzone twice against the Gators, moving himself to 14 touchdowns on the season — five away from the school-record 19 touchdowns set by LaBrandon Toefield in 2001. \nThrough six games this season, Fournette accumulated 1,202 rushing yards — placing himself 484 yards away from LSU’s single-season record, which is no accident. \n“Don’t let one guy take you down,” Fournette’s motto, is a large part of the reason behind his 1,202 rushing yards thus far. \nDuring the third-and-four run, Fournette reached the sideline then delivered “the punch.” \nHe attempted to shake off a Florida defender with the same brutal stiff arm that has buried the pride of a tackler one too many times before. \n“I was trying to stiff arm and get him off of me,” Fournette said. “There’s no excuse to let one guy tackle you. Make them miss and fight them off of you.” \nHe missed, but he followed the whiff with a left-handed, balled-fist to the side of Florida junior safety Marcus Maye’s helmet. What was intended to be a second, more successful stiff-arm, ended up resembling a strong punch. \nJunior defensive end Tashawn Bower said it’s not Fournette’s style to intentionally punch someone on the field, but Miles prepped Fournette for an 11-versus-11 brawl. \n“Coach Miles said get ready for a fist fight,” Fournette said. “So we had to go pound-for-pound on every play.” \n“I don’t know if he swung at a guy,” Miles said. “He more just moved someone out of his area.” \nFournette’s jab against Florida doesn’t simply signify one play, it’s a microcosm of LSU’s season, backed behind the powerful fist of its star sophomore phenom. \nWith Fournette in the backfield, LSU gets offensive opportunities elsewhere. This time, it was the passing game. \nSophomore quarterback Brandon Harris completed 13-of-19 passes for 202 yards and two touchdowns against Florida. \nA big chunk of Harris’ yardage was because of the fear of Fournette busting through the Florida defense, delivering the big-play, strong punch he’s capable of breaking on any play this season. \n“Leonard Fournette is a special back,” Miles said in a postgame news conference. \nOn first-and-10, Harris handed it off to Fournette, who charged forward for a yard, and Florida ate the bait. \nFournette then lobbed the ball back to Harris for the fabled flea-flicker. \nHarris completed the pass to sophomore wide receiver Malachi Dupre for a 52-yard gain against a Gator defense fearing the Fournette punch once again. \nOn the next play, Fournette raced into the endzone for a six-yard touchdown — his second score of the day. \n“Going against that defense we had to fight, scratch and crawl for every inch of every yard, and that’s what I tried to do,” Fournette said, exhausted and bruised after the game. \nFlorida feared the punch, tried to block it and still got hit.", "external_links": [], "published": "2015-10-19T00:24:00.000+03:00", "crawled": "2015-10-19T06:11:18.222+03:00", "highlightTitle": ""}