{"organizations": [], "uuid": "31e865c639a7e5f77561771fccf430223217e2db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chinapost.com.tw", "main_image": "http://www.chinapost.com.tw/cplogo.jpg", "site_section": "http://www.chinapost.com.tw/rss/sports.xml", "section_title": "China Post Online - Sports News", "url": "http://www.chinapost.com.tw/sports/olympics/2015/10/15/448377/Tokyo-governor.htm", "country": "", "title": "Tokyo governor vows that Olympic stadium is on track for 2020 games", "performance_score": 0, "site": "chinapost.com.tw", "participants_count": 0, "title_full": "Tokyo governor vows that Olympic stadium is on track for 2020 games", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T19:00:00.000+03:00", "replies_count": 0, "uuid": "31e865c639a7e5f77561771fccf430223217e2db"}, "author": "", "url": "http://www.chinapost.com.tw/sports/olympics/2015/10/15/448377/Tokyo-governor.htm", "ord_in_thread": 0, "title": "Tokyo governor vows that Olympic stadium is on track for 2020 games", "locations": ["TOKYO", "Tokyo", "London"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Boris Johnson"], "text": "Tokyo governor vows that Olympic stadium is on track for 2020 games AFPOctober   Tweet TOKYO -- Tokyo's scandal-tinged Olympic stadium will be completed in time for the 2020 games, the city's governor said Wednesday, as London Mayor Boris Johnson warned of the pitfalls of \"playing politics\" when hosting the competition. \nJapan's preparations for the global games suffered a humiliating setback this summer when the government pulled the plug on its flagship stadium following spiraling costs and complaints over the design. \nOrganizers have instead opted for a cheaper alternative stadium which must now be rushed to be completed in time. \n\"Cooperating with the national government ... we will do everything we can so that we will complete construction of a new national stadium by January 2020,\" Tokyo governor Yoichi Masuzoe told reporters Wednesday. \nHe added that the six new venues being built for the games were all \"proceeding on schedule.\" \nThe city governor's comments came ahead of a meeting later Wednesday with officials from the International Olympic Committee, in town to assess the ongoing preparations for the games. \nMasuzoe also welcomed London's famously eccentric Mayor Johnson, who won an election shortly before that city hosted the 2012 Olympics. \nThose games were held at a fraction of the cost of Beijing's four years earlier and came in significantly under budget — a rarity in the notoriously spendthrift world of Olympic hosting. \nAsked by reporters what the key to London's success was, Johnson said it was competent communication among all government and city departments involved in preparing the games. \n\"And that was the case all across all party lines. There was nobody who tried to make politics... that was I think very, very important for our success,\" he said. \nTokyo's stadium fiasco has pushed back a new venue's completion date, embarrassing Japanese sport officials who have also been forced to find an alternate showpiece site for Rugby World Cup matches in 2019. \nAt the time it was cancelled, Tokyo's stadium — designed by British architect Zaha Hadid — was on track to become the world's most expensive with a US$2.0 billion price tag. \nThe futuristic design had also been criticized by some architects who said it would be an eyesore. \nBut Johnson defended the stadium's aesthetics. \n\"Zaha did a fantastic job ... And I'm sure she will do lots of wonderful works in Japan and around the world,\" he said. \nSome have expressed concerns about Tokyo hosting the games in the summer, when the city often experiences intense heat. \nBut Masuzoe said he was confident authorities could keep athletes and spectators cool by \"spraying mist, holding a marathon race very early in the morning or paving roads with heat-absorbing technologies.\" SHARE", "external_links": [], "published": "2015-10-14T19:00:00.000+03:00", "crawled": "2015-10-15T08:15:35.442+03:00", "highlightTitle": ""}