{"organizations": [], "uuid": "e625572275c5f23591273e185d96428ab9b83d3e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.northjersey.com", "main_image": "http://www.northjersey.com/designimages/NorthJerseyFacebook_377x196.jpg", "site_section": "http://www.northjersey.com/cmlink/sports-rss.rss#", "section_title": "Sports News on NorthJersey.com", "url": "http://www.northjersey.com/sports/high-school-sports/field-hockey/lakeland-earns-bounce-back-win-1.1422741", "country": "US", "title": "H.S. field hockey report: Lakeland earns bounce-back win - Field Hockey", "performance_score": 0, "site": "northjersey.com", "participants_count": 1, "title_full": "H.S. field hockey report: Lakeland earns bounce-back win - Field Hockey - NorthJersey.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T04:21:00.000+03:00", "replies_count": 0, "uuid": "e625572275c5f23591273e185d96428ab9b83d3e"}, "author": "DAVE MEISEL", "url": "http://www.northjersey.com/sports/high-school-sports/field-hockey/lakeland-earns-bounce-back-win-1.1422741", "ord_in_thread": 0, "title": "H.S. field hockey report: Lakeland earns bounce-back win - Field Hockey", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "No team’s stock took a bigger leap over the last week than Lakeland’s. The fifth seed in the Passaic County tournament did suffer heartbreak in the quarterfinals, losing to fourth-seeded Wayne Valley in penalty strokes, but bounced back with a 2-1 victory over Passaic Valley on Tuesday.\nLakeland’s signature win of the season came Friday when goal scorers Sarah Anthony and Daphne Leenas helped the team to a 2-1 victory over Northern Highlands.\n\"Monday was a hard loss in the county first round [but] the team seems to have bounced back with a win against PV,\" said coach Patty Kebrdle. \"We have some heavy competition in the next week with Wayne Hills, Pompton [Lakes] and Ramsey still on the horizon. But I am very proud of the way we have come back after being behind.\"\nWEST MILFORD ON RISE: Third-seeded West Milford got past Passaic Valley’s sturdy defense, winning, 2-1, on goals by Bianca Cano and Gillian Grahame. Casey Butera and Maeve Gordon had the assists for West Milford, and goalie Megan Lamb had two saves. Emily Hyde had the Hornets’ goal.\n\"The girls worked hard in their county game against PV and are anxiously awaiting the semifinals against Pompton, with structured and skillful practices and team events,\" said coach Krista Rieder-Provost. \"Our momentum is only moving forward, and I’m excited to see what the next few weeks shall bring for the program.\"\nPASSAIC COUNTY TOURNAMENT UPDATE: Hannah Sikorski was the offensive hero in the Lakeland-Wayne Valley quarterfinal, which ended in a one-goal tie. Sikorski scored the Indians’ lone goal in regulation and converted her penalty stroke. Goalie Nicole Mottole also was instrumental, stopping 12 shots on goal.\nBoth semifinals matchups will be played Oct. 10. Second-seeded Pompton Lakes hosts No. 3 West Milford at a time to be determined, and top-seeded Wayne Hills hosts Wayne Valley at 10 a.m.\nRAMSEY TAKES TOP SPOT: Ramsey, for now, has stolen the crown of North Jersey field hockey. The Rams rarely allow goals. They have a prolific scorer — one of the best in the area — in Kassidy Shetler. On Monday, they beat Wayne Hills, 1-0, on a first-half Shetler goal in one of their two best results of the season; they also defeated Northern Highlands, 2-1, on Sept. 19. Their most lopsided win was a 4-1 victory over West Milford, fueled by a Shetler hat trick.", "external_links": [], "published": "2015-10-01T04:21:00.000+03:00", "crawled": "2015-10-01T08:43:38.788+03:00", "highlightTitle": ""}