{"organizations": [], "uuid": "14f67f4fb7dc53c4bdad299b9839c5f606d927d1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "espn1420.com", "main_image": "http://wac.450F.edgecastcdn.net/80450F/espn1420.com/files/2015/10/Quave.jpg?w=600&h=0&zc=1&s=0&a=t&q=89", "site_section": "http://espn1420.com/feed/", "section_title": "SPORTS RADIO ESPN 1420", "url": "http://espn1420.com/mykhael-quave-out-for-season-with-torn-rotator-cuff/", "country": "US", "title": "Mykhael Quave Out For Season With Torn Rotator Cuff", "performance_score": 0, "site": "espn1420.com", "participants_count": 1, "title_full": "Mykhael Quave Out For Season With Torn Rotator Cuff", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T02:23:00.000+03:00", "replies_count": 0, "uuid": "14f67f4fb7dc53c4bdad299b9839c5f606d927d1"}, "author": "Ryan Baniewicz", "url": "http://espn1420.com/mykhael-quave-out-for-season-with-torn-rotator-cuff/", "ord_in_thread": 0, "title": "Mykhael Quave Out For Season With Torn Rotator Cuff", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mykhael Quave Out For Season With Torn Rotator Cuff By Ryan Baniewicz October 7, 2015 6:23 PM Share on Twitter (photo by Brad Kemp/ragincajuns.com) \nOne of Ragin’ Cajun Nation’s favorite players, Offensive Lineman Mykhael Quave, will miss the rest of his senior season with a torn rotator cuff. \nReporters hate writing about injuries, especially for amateur athletes. Not only is Mykhael Quave a fantastic football player and a senior leader on Ragin’ Cajun Football, he’s also joyous big man who brings smiles and laughter to people. Quave’s NFL career might now be thrown into jeopardy with such a serious injury, and news of his injury brings heavy hearts around Acadiana. \nLuke Johnson of the Advocate broke the news on Twitter Wednesday afternoon. \nJohnson added that Quave’s injury will cost him nine months to an entire year, which means he won’t be able to participate in the Senior Bowl or NFL Combine, both events Head Coach Mark Hudspeth said Quave received invites to. \nQuave could still enter the NFL Draft, but for now recovery will be his first and foremost mission. The Cajuns will be without their leader on the line and in the locker room, and the media room will be missing a jovial and lovable character. \nFor a man that started 43 straight games wearing vermilion and white, it’s hard to believe when you hear the news. Send positive vibes his way, Cajun Nation. He certainly sent his share of positivity to everybody he ever saw, so it would only be right to give some back.", "external_links": [], "published": "2015-10-08T02:23:00.000+03:00", "crawled": "2015-10-08T04:39:29.351+03:00", "highlightTitle": ""}