{"organizations": [], "uuid": "5ea112e7824379c72027bed237110a3c99a0013a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/ncaafb", "section_title": "NCAA FB News, Scores, Schedule, Standings, Stats, Photos, Videos - Football - MSN Sports", "url": "http://www.msn.com/en-us/sports/ncaafb/the-game-plan-that-will-determine-ohio-states-season/ar-AAfspu9", "country": "US", "title": "The Game Plan That Will Determine Ohio State's Season", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "The Game Plan That Will Determine Ohio State's Season", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "5ea112e7824379c72027bed237110a3c99a0013a"}, "author": "Andrew Schnell", "url": "http://www.msn.com/en-us/sports/ncaafb/the-game-plan-that-will-determine-ohio-states-season/ar-AAfspu9", "ord_in_thread": 0, "title": "The Game Plan That Will Determine Ohio State's Season", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Game Plan That Will Determine Ohio State's Season Campus Insiders 1 day ago Andrew Schnell\nThis year's Ohio State team is better than the one that beat Oregon and Marcus Mariota for the national championship last season.\nAdChoices So why have the Buckeyes struggled so far in 2015?\nIt's not because of indecision around a starting quarterback, or even playing down to the competition.\n© Provided by Campus Insiders Speaking from experience, it's really hard to maintain an extra level of focus when everyone expects you to succeed.\nI've been on that team that was guaranteed to win the title, my junior year swimming at Stanford. There was never a sense of entitlement, we trained just as hard, and we were faster during the season than we had ever been. However, the year was taxing, and watching eventual national champion Auburn put forth a great showing at the SEC Championships was emotionally draining. It was the first time I remember thinking that year we could lose.\nThe mental makeup of a team can be the difference between a title and going home empty handed.\nMeyer knows this better than anyone, having nearly led the Florida Gators to back-to-back titles before imploding in the SEC Championship Game against Alabama.\nThe first reaction to the Ohio State - Virginia Tech game was that the Buckeyes were not the same squad from Arlington. But what I saw was a team mentally tough enough to overcome its first test of adversity.\nSo far the Buckeyes have jumped every hurdle this season. But each week the stakes grow a little bit higher and Meyer's job of keeping his players focused gets a little bit tougher - especially with coaches experienced in exploiting mental weaknesses, like Jim Harbaugh, waiting for their chance to ruin the perfect party.\nOn paper the Buckeyes can't be beat, but in their minds they can. How well Meyer executes the psychological game plan during the second half of the season will determine just how far Ohio State make it.\nMORE: Is Ohio State Projected To Make The CFP?\n© USA Today The Game Plan That Will Determine Ohio State's Season Go to MSN Home", "external_links": ["http://campusinsiders.com/news/2015-2016-college-football-bowl-projections-after-week-5-10-05-2015", "http://go.microsoft.com/fwlink/?LinkID=286759", "http://www.campusinsiders.com/"], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-16T05:12:51.245+03:00", "highlightTitle": ""}