{"organizations": [], "uuid": "778935211e99086a7f55abe0678e96e5b93c0514", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "nypost.com", "main_image": "https://thenypost.files.wordpress.com/2015/10/lee1.jpg", "site_section": "http://nypost.com/sports/feed/", "section_title": "| Sports | New York Post", "url": "http://nypost.com/2015/10/17/ex-knick-david-lee-talks-celtics-and-finding-time-to-get-title-ring/", "country": "", "title": "Ex-Knick David Lee talks Celtics and finding time to get title ring", "performance_score": 0, "site": "nypost.com", "participants_count": 1, "title_full": "Ex-Knick David Lee talks Celtics and finding time to get title ring | New York Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T04:07:00.000+03:00", "replies_count": 0, "uuid": "778935211e99086a7f55abe0678e96e5b93c0514"}, "author": "Marc Berman", "url": "http://nypost.com/2015/10/17/ex-knick-david-lee-talks-celtics-and-finding-time-to-get-title-ring/", "ord_in_thread": 0, "title": "Ex-Knick David Lee talks Celtics and finding time to get title ring", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "David Lee has a dilemma. How to get the championship ring for which he waited 11 years?\nThe Warriors will have their ring ceremony Oct 27 against New Orleans — the eve of the Celtics’ season opener in Boston. Lee is one of the few Warriors who didn’t return, traded in July when the Knicks made a pitch to inherit the final year of his contract ($16 million).\nInstead, the former Knicks All-Star power forward landed in Boston and wore the trademark green at the Garden Friday in the Celtics’ 101-95 loss. The Celtics aren’t in Oakland until April 1, which would have been an appropriate time for the Warrior of five years to get the jewelry.\n“I don’t know yet — I won’t be able to go out there for opening night, we play the next day in Boston,’’ said Lee, who started and scored four points with five rebounds in 23 minutes.“I don’t want to do that. It’s more important to be ready for opening night for this team.’’\nLee is a free agent in 2016 and could target the Knicks. He had an odd final season in Golden State when coach Steve Kerr bumped him out of the rotation. But in the NBA Finals, he made key contributions when Kerr turned to him with the Warriors down 2-1 to the Cavaliers.\n“Hopefully I’ll get a chance to play a little bit,’’ Lee said of his role with the Celtics. “That’s different from last year. It was a strange year last year, of course, with an unbelievable ending being able to contribute to a title. It was all worth it.\nLee, who spends a lot of the offseason in New York, is expected to be in the Celtics rotation. \n“Lucky — only the third team in 11 years,’’ said Lee, who left the Knicks in the summer of 2010 to allow them to sign Amar’e Stoudemire. “I’m bringing who I am more than anything. Be a hard worker, give us advice where I can because I have been through a lot in this league. The fit here is perfect to be a leader.’’\nLee admitted it felt odd being in a Celtics uniform at the Garden where he remembers preparing for “KG and Paul Pierce.’’\nShare this: Facebook Twitter Google Whatsapp Email Filed under boston celtics ,  david lee ,  golden state warriors ,  new york knicks", "external_links": [], "published": "2015-10-17T04:07:00.000+03:00", "crawled": "2015-10-17T09:18:47.469+03:00", "highlightTitle": ""}