{"organizations": [], "uuid": "4156139a9c6a768cee45dbb1f979da9ce3d19337", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/49386640.cms", "site_section": "http://timesofindia.indiatimes.com/rssfeeds/4719148.cms", "section_title": "The Times of India Sports: Extensive sports coverage, key statistics and free downloads", "url": "http://timesofindia.indiatimes.com/sports/chess/Viswanathan-Anand-off-form-in-World-Blitz-too-finishes-22nd/articleshow/49386564.cms", "country": "IL", "title": "Viswanathan Anand off-form in World Blitz too, finishes 22nd", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "Viswanathan Anand off-form in World Blitz too, finishes 22nd - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T22:17:00.000+03:00", "replies_count": 0, "uuid": "4156139a9c6a768cee45dbb1f979da9ce3d19337"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/sports/chess/Viswanathan-Anand-off-form-in-World-Blitz-too-finishes-22nd/articleshow/49386564.cms", "ord_in_thread": 0, "title": "Viswanathan Anand off-form in World Blitz too, finishes 22nd", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BERLIN (Germany): Former world champion Viswanathan Anand's bad form continued as he could only finish 22nd in the World Blitz Chess championship, which concluded on Thursday. \n\nAnand's final day was marred by draws and the silver lining for the Indian was the fact that he did not lose a single game on the last day that had 10 games. \n\nAfter finishing day one on a disappointing note with just 6.5 points out of 11, Anand got the same points getting seven draws and three victories on the final day. \n\nThe five times world champion will next take part in the Bilbao Final Masters as the defending champion later this month at Bilbao in Spain. \n\nGrandmaster P Harikrishna, who came here straight after winning the Poker Masters tournament in Isle of Man, ended as the second best scorer amongst Indians on 12 points, a half point ahead of Krishnan Sasikiran. \n\nAmong other Indians in the fray, Surya Shekhar Ganguly and Vidit Santosh Gujrathi scored an identical 11 points, B Adhiban ended his campaign on 10.5 while S P Sethuraman scored 9.5 points in all. \n\nGrandmaster Alexander Grischuk of Russia emerged as the deserving winner finishing with a flourish that got him eight points out of last nine rounds. The Russian scored an impressive 15.5 points from his 21 rounds, losing three drawing five and winning the remaining 13 games. \n\nIt was a two-way tie for the second spot and Frenchman Maxime Vachier-Lagrave finished second on his better tiebreak than Vladimir Kramnik of Russia who too came back strongly after a disappointing show in rapid chess. \n\nWorld champion in Classical and rapid, Magnus Carlsen of Norway could not keep the momentum ticking on the final day of the event and his 14 points were good for the 6th spot only. Stay updated on the go with Times of India News App. Click here to download it for your device.", "external_links": [], "published": "2015-10-15T22:17:00.000+03:00", "crawled": "2015-10-15T19:10:41.515+03:00", "highlightTitle": ""}