{"organizations": [], "uuid": "8bf1f5c35684f7a6c1db2222dc4ec79a54223a86", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freep.com", "main_image": "http://www.gannett-cdn.com/-mm-/58635ce9e056ebd35c62c67dc18e4d5868239d2e/c=9-63-851-539&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/16/DetroitFreePress/DetroitFreePress/635805527107070531-marathon.jpg", "site_section": "http://rssfeeds.freep.com/freep/sports", "section_title": "Detroit Free Press - Sports", "url": "http://www.freep.com/story/sports/columnists/jeff-seidel/2015/10/16/grosse-pointe-north-teacher-marathon/74033544/", "country": "US", "title": "Grosse Pointe North teacher finishes 50 marathons in 50 states before 50", "performance_score": 0, "site": "freep.com", "participants_count": 1, "title_full": "Grosse Pointe North teacher finishes 50 marathons in 50 states before 50", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T08:40:00.000+03:00", "replies_count": 0, "uuid": "8bf1f5c35684f7a6c1db2222dc4ec79a54223a86"}, "author": "freep.com", "url": "http://www.freep.com/story/sports/columnists/jeff-seidel/2015/10/16/grosse-pointe-north-teacher-marathon/74033544/", "ord_in_thread": 0, "title": "Grosse Pointe North teacher finishes 50 marathons in 50 states before 50", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MORE\nElizabeth Montgomery went from normal mobility and energy. To walking with a cane. To walking with two canes. To using a motorized scooter. To being completely bedridden. And she died of complications due to multiple sclerosis in 1999 at 66.\nHer daughter, Diane Montgomery, watched her struggle with this \"relentless and merciless\" disease for years. \"I have never taken my mobility for granted,\" she said.\nAnd that explains everything. That is why Montgomery runs marathons all over the country. Because she can. Because she has to. Because being able to run is an amazing gift, and she refuses to squander it.\nLast weekend, Montgomery completed a lifetime goal: finishing 50 marathons in 50 states before she turned 50. She did it with a month to spare. She will turn 50 in November. \"I've used my running goals later in life to combat, I don't know, a midlife crisis perhaps,\" she said.\nOn Sunday morning, she will celebrate by running, of course, competing in the international half marathon at the 38th Detroit Free Press/Talmer Bank Marathon. \"It's the kind of life achievement,\" she said. \"When people remember me, they will be like, 'Oh, she ran 50 marathons in 50 states.'\n\"I don't want to say it's greatest accomplishment in my life, because I'm a coach and I'm a teacher. But I think it's kind of one of those life-defining goals.\"\nThat's the great thing about Detroit's marathon, which will feature a record field of more than 27,000 runners, walkers, wheelers and handcyclists. It is so much bigger than a road race. It's a celebration of movement and mobility with more than 27,000 stories and reasons.\nSome are running for the competition. Some are running to lose weight. Some are running to raise money. And Diane Montgomery is going to use this as a victory lap. She will wear a special singlet for members of the 50 States Marathon Club.\n\"There are roughly 1,050 people who have finished 50 states,\" she said. \"I believe I'm the 371st woman in the U.S., and I'm the 11th woman in the state of Michigan.\"\nThink about it. Think about all of the logistical problems that come up, just getting to 50 states, much less running in them. And she was under a tight, self-imposed deadline. She couldn't even take time off for an injury.\n\"Oh, I've been plenty injured,\" she said. \"I've never let an injury stop me.\"\nDETROIT FREE PRESS\nFree Press Marathon: Everything you need to know\nDid I mention her hip?\nMontgomery, who lives in Lathrup Village, suffered an injured hip after a fall while trail running in late July. \"It was a pretty bad fall, and I torqued my hip,\" she said. \"I've had a pretty severe hamstring and glute pain since the end of July that I haven't been able to shake that much.\"\nLast weekend, when she finished her most recent marathon in Hartford, Conn., completing her goal by giving her a marathon in all 50 states, she was in serious pain. She ran for 5 hours, 5 minutes and 2 seconds (or an 11:39-per-mile pace). \"You have to understand where my pain threshold is,\" she said. \"The final miles were pretty painful, as far as moving my legs forward, with a shooting hamstring pain. That really bothered me.\"\nDid I mention the stress fracture?\nLast year, she ran in several marathons with a stress fracture in her foot. But she couldn't stop running.\n\"I try to drink a lot of beer while I'm running,\" she said, \"and it kind of numbs the pain.\"\nHmm. I love the way she thinks.\nRoute 66 Marathon in Tulsa, Okla. (Note: Wearing Detroit marathon hat!) (Photo: Courtesy of Diane Montgomery)\nFun in the 'D'\nMontgomery ran her first marathon in 1995. At the time, she was living in Georgia and ran one in Florida. \"Detroit was my second in 1997,\" she said.\nShe has a special connection with this marathon. It's the place where she ran her fastest marathon (3:42:24 in '97, an 8:29 pace) and qualified for the 2010 Boston Marathon (which she ran in 4:06:57). \"I love the Detroit marathon,\" she said. \"They do such a great job with organization, course design, spectator support and, of course, the medals are always awesome.\"\nThis year, she will be running the international half marathon with her sister, Sarah Coleman, who got her into marathon running. But there is only one problem, in Montgomery's eyes, about the international course, which goes to Canada over the Ambassador Bridge and returns to the U.S. through the Detroit-Windsor Tunnel.\n\"I won't go through Indian Village, which is where all of the beer is,\" she said. \"Last year, we had a riot in Indian Village. They make such a party out of it.\"\nLathrup Village’s Diane Montgomery, left, who has finished 50 marathons in 50 states, will miss running through Indian Village this year. “They make such a party out of it,” she said. (Photo: Courtesy of Diane Montgomery)\nLove on the run\nDiane Montgomery has used marathon running as a way to combat milestone birthdays.\nTo celebrate turning 40, she decided to run a 50-mile race.\n\"That really helped make it easier to turn 40,\" she said. \"When I turned 42, I needed a new goal.\"\nShe decided to run in 50 states, which has given her a different view of America. Some of the marathons have been simply beautiful, like running along the coastlines in California and Maine. And some have been bare bones: In Alaska, they drove the runners 26.2 miles out of town, dropped them off and had them run back on a gravel road.\nBut the afterparty at the Copper River Wild! Salmon Festival and Jam was amazing. She ran, and her boyfriend, Steve Gulian, an elementary teacher and musician from the band Rosetta Pebble, played a gig. He wrote a song about marathoning, \"One Foot First.\" He will play his guitar at strategic places along courses and perform appropriate songs like Pink Floyd's \"Comfortably Numb\" and Indigo Girls' \"Closer to Fine.\"\nRunning and music. That's their life.\n\"There are some really great marathons out there that do crazy things, or they are in really scenic places, or the personality of the town makes it special,\" she said. \"The Hatfield McCoy Marathon was one of my favorites. It's on the border of Kentucky and West Virginia, basically at the site of the Hatfield-McCoy feud. There are lots of Hatfields and McCoys who still live there. It's such a nice, embracing community. You go by a lot of the historic sites. They have people dressed up Hatfield and McCoy at the start and a great barbecue lunch at the finish line.\"\nDiane Montgomery hit the mark Saturday in Hartford. (Photo: Courtesy of Diane Montgomery)\nThe next milestone\nMontgomery is an English teacher at Grosse Pointe North, where she is the head coach of the boys cross-country team and an assistant coach of the girls track team.\n\"The biggest thrill in the world is when my former students or runners tell me they are running a half or full marathon,\" she said. \"Running is truly a lifelong sport. I often call it the purest sport because it is just you and your body out there battling — it doesn't even matter if the opponent is external or internal, there is always a competitive element to it.\n\"That is the greatest gift I think I give, inspiring others to find their strength by running long.\"\nNow, she has a new goal.\n\"I'm going to try to do 100 marathons by age 60,\" she said.\nShe already has run 60, including seven in Detroit. She loves running in Detroit. \"I also always love to see the marching band and cheerleaders from M.L. King High School,\" she said. \"I plan to run the full in Detroit every year of my 50s.\"\nWhy?\nBecause she can't squander this gift.\nContact Jeff Seidel: jseidel@freepress.com. Follow him on Twitter @seideljeff . To read his recent columns, go to freep.com/sports/jeff-seidel/ .\nGoing the distance\nWhat: 38th Detroit Free Press/Talmer Bank Marathon.\nWhen: 6:58 a.m. Sunday.\nWhere: Streets of Detroit and Windsor. Marathon starts and ends downtown on Fort near Cass.", "external_links": ["http://www.gannett-cdn.com/-mm-/734fac10538d13406c1d7cd31ef155a9e07b4676/r=300x400/local/-/media/2015/10/16/DetroitFreePress/B9319288800Z.1_20151016002137_000_GFJC8JHE6.1-0.jpg", "http://www.gannett-cdn.com/-mm-/33d97f8a03d5ea06baca0f7a30eca34c8bd87643/r=500x281/local/-/media/2015/10/16/DetroitFreePress/B9319288800Z.1_20151016002137_000_GFJC8JHJI.1-0.jpg", "http://www.gannett-cdn.com/media/2015/10/16/DetroitFreePress/B9319288800Z.1_20151016002137_000_GFJC8JHJI.1-0.jpg", "http://www.gannett-cdn.com/media/2015/10/16/DetroitFreePress/B9319288800Z.1_20151016002137_000_GFJC8JHJ5.1-0.jpg", "http://www.gannett-cdn.com/-mm-/cfd8001640d697a9ecb2a55786db5e2b0be4c97f/c=120-10-822-538&r=x408&c=540x405/local/-/media/2015/10/16/DetroitFreePress/B9319288800Z.1_20151016002137_000_GFJC8JHJI.1-0.jpg", "http://www.gannett-cdn.com/-mm-/d13bdbdc38b6a3f12f50a2b2ab9cfbd807ce9327/c=0-0-873-656&r=x408&c=540x405/local/-/media/2015/10/16/DetroitFreePress/B9319288800Z.1_20151016002137_000_GFJC8JHJ5.1-0.jpg", "http://www.twitter.com/seideljeff", "http://www.gannett-cdn.com/media/2015/10/16/DetroitFreePress/B9319288800Z.1_20151016002137_000_GFJC8JHE6.1-0.jpg", "http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/a56df27cadf84f9e897edee942eebcb811a9092b/c=684-0-2609-1925/local/-/media/2015/10/10/DetroitFreePress/B9319223021Z.1_20151010223512_000_GL9C6HIS8.1-0.jpg", "http://www.gannett-cdn.com/-mm-/ec12900d50e7336a35b282d1c65c5d0735229d27/c=15-33-705-953&r=183&c=0-0-180-240/local/-/media/2015/10/16/DetroitFreePress/B9319288800Z.1_20151016002137_000_GFJC8JHE6.1-0.jpg", "http://www.gannett-cdn.com/-mm-/c711c85d58e411988f13438d0dec93db9715f141/r=400x400/local/-/media/2015/10/16/DetroitFreePress/B9319288800Z.1_20151016002137_000_GFJC8JHJ5.1-0.jpg"], "published": "2015-10-16T08:40:00.000+03:00", "crawled": "2015-10-16T16:30:48.599+03:00", "highlightTitle": ""}