{"organizations": [], "uuid": "908ea5a1c253a461b6128ec0c96859b4eca65b76", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sportsnews.com.au", "main_image": "http://sportsnews.com.au/defaultimage.jpg", "site_section": "http://www.sportsnews.com.au/category/afl/feed/", "section_title": "Sports News Australia » AFL News", "url": "http://www.sportsnews.com.au/afl/bombers-saints-look-for-afl-trade-help/160533", "country": "US", "title": "Bombers, Saints look for AFL trade help", "performance_score": 0, "site": "sportsnews.com.au", "participants_count": 1, "title_full": "Bombers, Saints look for AFL trade help", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T21:04:00.000+03:00", "replies_count": 0, "uuid": "908ea5a1c253a461b6128ec0c96859b4eca65b76"}, "author": "AAP", "url": "http://www.sportsnews.com.au/afl/bombers-saints-look-for-afl-trade-help/160533", "ord_in_thread": 0, "title": "Bombers, Saints look for AFL trade help", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bombers, Saints look for AFL trade help Posted by AAP + on 21/10/2015 at 5:04 am AFL GRAND FINAL OFFER! If your team leads at any break but loses, CASH BACK up to $100!* PLUS Sign up now for a $501 Bonus Bet! \nEssendon and St Kilda continue to haggle over the proposed Jake Carlisle deal with less than 48 hours remaining in the AFL trade period. \nThe Bombers have demanded the Saints’ first-round pick this year, the fifth overall selection, in a straight swap for the 22-year-old from the outset but St Kilda have refused to budge. \nBut reports have emerged suggesting Sydney could become involved in a multi-club arrangement that would see Carlisle get his wish. \nOnly two trades were completed on Tuesday, with Gold Coast sending Charlie Dixon to Port Adelaide and Collingwood granting Nathan Freeman’s wish to move to St Kilda. \nWith time running out, Adam Treloar’s move from Greater Western Sydney to Collingwood, James Aish’s switch from Brisbane to the Magpies and Chris Yarran’s move from Carlton to Richmond are among the key deals still to be finalised. \nDixon, 25, flagged his desire to join Port before the trade period started but the Suns’ demands for more than the Power’s offer of their first-round draft pick (No.10) led to protracted negotiations. \nUltimately, Richmond’s involvement in those talks proved the circuit-breaker. \nUnder the deal, Port Adelaide sent pick 10 and next year’s second-round pick to Gold Coast in exchange for Dixon and pick 49, and the Tigers exchanged pick 31 at this year’s draft and their second-round pick next year for the Suns’ pick 19. \n“I’m really looking forward to joining Port Adelaide as I’ve been really impressed with the club and in particular with the structures that Ken Hinkley has put in place,” Dixon said via a club statement. \n“I’ve met a few of the players and I’m really excited about putting my head down, working hard to do what I can to help improve myself and the Port Adelaide Football Club.” \nPort football chief Chris Davies confirmed Dixon had signed a five-year deal with the Power. \nThe Magpies sent Freeman, selected 10th overall at the 2013 draft, to the Saints along with pick 68 in return for pick 63 this year and St Kilda’s second-round pick next year.  ", "external_links": [], "published": "2015-10-20T21:04:00.000+03:00", "crawled": "2015-10-20T21:10:06.112+03:00", "highlightTitle": ""}