{"organizations": [], "uuid": "e1993fac156d534dbb22ba89b3ce32e63236ebb7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/motorsports", "section_title": "NASCAR / Motors News, Race Results, Schedule, Standings, Photos, Videos - MSN Sports", "url": "http://www.msn.com/en-us/sports/motorsports/danica-promoting-breast-cancer-cause-at-dover/ar-AAf0edX", "country": "US", "title": "Danica promoting breast cancer cause at Dover", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "Danica promoting breast cancer cause at Dover", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "e1993fac156d534dbb22ba89b3ce32e63236ebb7"}, "author": "Brant James, USA TODAY Sports", "url": "http://www.msn.com/en-us/sports/motorsports/danica-promoting-breast-cancer-cause-at-dover/ar-AAf0edX", "ord_in_thread": 0, "title": "Danica promoting breast cancer cause at Dover", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Danica promoting breast cancer cause at Dover USA Today Sports 6 hrs ago by Brant James, USA TODAY Sports © Andrew Weber, USA TODAY Sports Andrew Weber, USA TODAY Sports DOVER, Del. – Danica Patrick understands the power of her platform, her ability to leverage fame and notoriety into philanthropy.\nAdChoices The Sprint Cup driver's latest opportunity comes this weekend at Dover International Speedway with GoDaddy's annual pink-swathed launch of a Breast Cancer Awareness month campaign to benefit the National Breast Cancer Foundation. Patrick hopes the effort can continue to underscore the importance of the cause at hand while perhaps encouraging awareness of less ubiquitous efforts.\n\"It's happening again another year and it's supporting the same cause, but through this repetitiveness, that really drives all the people to take awareness to their heath and do something about it,\" Patrick told USA TODAY Sports. \"I come back to [driver Martin Truex Jr. girlfriend] Sherry [Pollex] and I come back to her getting ovarian cancer. People don't know about that one. People know all about breast cancer and that's because of all these things we do around the month of October to raise awareness for it and what to look for and doing your own self-exam and things like that.\n\"It's very important to raise awareness. There's young girls today that don't know about self-exams, and they've got to learn about it and they have to know it's important. To be repetitive with the program, I think, is so very beneficial for those that don't know about it because there's always another generation coming up.\"\nAnyone watching at Dover this weekend will be instantly aware of her presence. She'll be awash in pink garb with her No. 10 Chevrolet and steering wheel. Sponsor GoDaddy, which since 2010 has built a national effort to support breast cancer awareness, will donate $50,000 to the NBCF and match employee contributions up to $500 each. Customers of the internet domain registrar will also have the option of rounding up orders by a cent, which has raised more than $1.1 million for various charity efforts, according to the company. The cause is personal for GoDaddy CEO Blake Irving, whose mother, Patty is the longest-surviving breast cancer patient in New Mexico.\n\"She's a testament to why awareness and early detection are so important. My mom is a woman who not only survived, but is thriving as an active member of her community, due in large part to early detection and an amazing attitude. It's inspiring,\" Irving said in a release.\nIt's personal for Patrick, too. A friend opted to undergo a pre-emptive double mastectomy in her 20s after testing positive for the gene indicating a higher risk of contracting breast cancer. She said is \"doing great,\" Patrick said, nearly a decade later.\n\"A story like that comes along out of the ability to learn through the breast cancer gene that you're at risk and if you're probably going to get it,\" Patrick said. \"That only happens because of research and learning more about it and giving women, or men, in this case, really, the opportunity to do something beforehand so they don't have to go through the pain and the struggles.\"\nPatrick said she feels obligated to help and fortunate to be in a position to do so. She's also been an advocate of COPD research, a respiratory condition that claimed her grandmother.\n\"We have so many things come to us and I know as an athlete and as a person I feel very fortunate, so if there's any little thing I can do or we can do or GoDaddy can do to give back, we're in a fortunate positon,\" she said. \"I think it's a give and take world and you can't just keep taking, so it's good to be part of a bigger plan.\"\nPHOTOS: DANICA PATRICK THROUGH THE YEARS\nDanica Patrick's NASCAR career\nGo to MSN Home", "external_links": ["http://www.usatoday.com/sports/", "http://go.microsoft.com/fwlink/?LinkID=286759"], "published": "2015-10-01T03:00:00.000+03:00", "crawled": "2015-10-02T01:44:37.027+03:00", "highlightTitle": ""}