{"organizations": [], "uuid": "9d0ad365942f04c65c4b5c9a716b0e37341981ec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48531/sports", "section_title": "Sports - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30216672/muhammad-alis-memoir-the-greatest-my-own-story-now-available-in-ebook-from-graymalkin-media", "country": "US", "title": "Muhammad Ali's Memoir \"The Greatest: My Own Story\" Now Available in eBook from Graymalkin Media", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Muhammad Ali's Memoir \"The Greatest: My Own Story\" Now Available in eBook from Graymalkin Media - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "9d0ad365942f04c65c4b5c9a716b0e37341981ec"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30216672/muhammad-alis-memoir-the-greatest-my-own-story-now-available-in-ebook-from-graymalkin-media", "ord_in_thread": 0, "title": "Muhammad Ali's Memoir \"The Greatest: My Own Story\" Now Available in eBook from Graymalkin Media", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Graymalkin Media\nLOS ANGELES , Oct. 8, 2015 /PRNewswire/ -- The knockout, best-selling autobiography from one of the most famous sports figures of all time is finally available in accessible eBook format to coincide with the 40 th anniversary of the Thrilla in Manila , Muhammad Ali's legendary fight against Joe Frazier (in October, 1975). Ali pulls no punches in \"The Greatest: My Own Story,\" as he chronicles his battles both in and out of the ring, edited by Nobel Prize-winning novelist, Toni Morrison . The eBook includes bonus photos of his private and public life.\nGrowing up in the South, surrounded by racial bigotry and discrimination, Ali fought not just for a living, but also for respect and rewards far more precious than money or glory. He became a symbol of hope and inspiration for millions around the world and was named Sportsman of the Century by Sports Illustrated and Sports Personality of the Century by the BBC. He transcended what it meant to be an athlete, and his mere presence shook stadiums like an earthquake.\nThis is a multifaceted portrait of Muhammad Ali only he himself could render: sports legend; unapologetic anti-war advocate; outrageous showman and gracious goodwill ambassador; fighter, lover, poet, and provocateur; an irresistible force to be reckoned with. Who better to tell the tale than the man who went the distance living it?\nRichard Durham travelled with Ali and worked with him over a period of six action-packed years to write \"The Greatest: My Own Story,\" which was originally published in 1975 to great acclaim and is mesmerizing in its brilliance, drama, humanity, and sheer entertainment. The book was adapted into a film starring Ali.\nPublishers Weekly says about the book, \"This is an extraordinary sports biography! The whole man is here as a whole raft of sportswriters never caught him.\"\nAnd the New York Times says, \"A splendid action-packed hurricane of a book! No routine athlete's autobiography ... to read it is like getting Ali alone in a room and hearing him answer all the questions one ever thought to ask.\"\nNow a new generation of readers can enjoy this exciting, inspirational, must-have autobiography on all tablets and devices. EBook available now. Paperback reprint available November 17, 2015 . For more information and title availability please visit Graymalkin Media's website .\nContact: Joyce Stein , press15@graymalkin.com\nPhoto - http://photos.prnewswire.com/prnh/20151008/275229\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/muhammad-alis-memoir-the-greatest-my-own-story-now-available-in-ebook-from-graymalkin-media-300156454.html\n ", "external_links": ["http://www.prnewswire.com/news-releases/muhammad-alis-memoir-the-greatest-my-own-story-now-available-in-ebook-from-graymalkin-media-300156454.html", "http://www.xmlnews.org/ns/", "http://graymalkin.com/the-greatest/", "http://photos.prnewswire.com/prnh/20151008/275229", "http://rt.prnewswire.com/rt.gif?NewsItemId=LA23312&Transmission_Id=201510081021PR_NEWS_USPR_____LA23312&DateId=20151008", "https://photos.prnewswire.com/prnvar/20151008/275229"], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T20:39:40.157+03:00", "highlightTitle": ""}