{"organizations": ["Tewksbury | High School Insider"], "uuid": "8e1e7219358d7273de88c70a81a16b30203d41e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "", "site_section": "http://bostonherald.com/sports/high_school", "section_title": "Sports: High School | Boston Herald", "url": "http://bostonherald.com/sports/high_school/high_school_insider/2015/10/high_school_football_friday_night_lights_all_right", "country": "US", "title": "HIGH SCHOOL FOOTBALL: Friday night lights all right for Tewksbury | High School Insider | with Danny Ventura & Jim Clark", "performance_score": 0, "site": "bostonherald.com", "participants_count": 0, "title_full": "HIGH SCHOOL FOOTBALL: Friday night lights all right for Tewksbury | High School Insider | with Danny Ventura & Jim Clark | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T03:00:00.000+03:00", "replies_count": 0, "uuid": "8e1e7219358d7273de88c70a81a16b30203d41e8"}, "author": "", "url": "http://bostonherald.com/sports/high_school/high_school_insider/2015/10/high_school_football_friday_night_lights_all_right", "ord_in_thread": 0, "title": "HIGH SCHOOL FOOTBALL: Friday night lights all right for Tewksbury | High School Insider | with Danny Ventura & Jim Clark", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Danny Ventura & Jim Clark", "BOB ALBRIGHT"], "text": "By BOB ALBRIGHT\n TEWKSBURY — Say this for Troy Carey and the Tewksbury Redmen, they sure picked out a good time to roll out the temporary lights at Doucette Field.\n Playing in only the second night game in the program’s 80-year history, Tewksbury took full command of the spotlight with a convincing 29-12 win over Andover in a clash of Merrimack Valley Conference unbeatens.\n Carey found his footing all evening long on what proved to be a very sloppy track on his way to 156 yards on 28 carries and a score. Carey also added a 76-yard kickoff return to open the second half that led to another score.\n Andover’s offense, which had looked so precise in last week’s huge upset of BC High, looked far different in the slop. Prolific junior triggerman E.J. Perry, who threw for over 300 yards and four scores a week ago, was held to just one scoring strike as he was hounded by the relentless Redmen defensive front and saw his stable of talented receivers blanketed all evening.\n “I’m not going to lie, the weather conditions might have helped us more than it helped them,” Tewksbury coach Brian Aylward said, “but you know what? If it’s different next week we’re still going to show up and be ready to play.”\n Leading 15-6 at the break, Carey’s slashing kickoff return set the hosts up deep in Andover territory. Two plays later, Tewksbury (4-0) went into its bag of tricks when junior running back Tyler Ward found a wide-open Steve Rosa on an option pass.\n Perry and Andover (3-1) marched right down the field to get back within 10 on Anthony Christopher’s 1-yard plunge, but Carey and the Tewksbury defense were not about to let the Golden Warriors extinguish this upset. Carey picked off Perry from his cornerback slot to officially put a cork in it with just two minutes to go.\n “E.J. is a good player and they run a good system,” said Aylward, who lauded the work of his assistant coaches and scout team. “It’s a matter of pick your poison and what do you try to take away from them. I think we were able to (be successful).”", "external_links": [], "published": "2015-10-03T03:00:00.000+03:00", "crawled": "2015-10-03T07:29:41.520+03:00", "highlightTitle": ""}