{"organizations": [], "uuid": "68caec2ff41cfa26850722c6e8e8cca1d9eb3186", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/88ab36c0ea20baeaebd63f3b09455f92.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/motorsport/nico-rosberg-blames-bad-luck-for-his-faltering-f1-season/6924145/", "country": "JE", "title": "Nico Rosberg blames bad luck for his faltering F1 season", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "Nico Rosberg blames bad luck for his faltering F1 season", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T20:01:00.000+03:00", "replies_count": 0, "uuid": "68caec2ff41cfa26850722c6e8e8cca1d9eb3186"}, "author": "", "url": "http://www.sport.co.uk/motorsport/nico-rosberg-blames-bad-luck-for-his-faltering-f1-season/6924145/", "ord_in_thread": 0, "title": "Nico Rosberg blames bad luck for his faltering F1 season", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Nico Rosberg"], "text": "Nico Rosberg blames bad luck for his faltering F1 season 11 Oct 2015 17:01:55 \ncomments \nNico Rosberg has rued a campaign he deems to have been fraught with bad luck after his hopes of winning the Formula One title all but ended in Russia on Sunday. \nThe German, who lost out to Lewis Hamilton at last year's championship decider in Abu Dhabi, led the opening phase of the race, but was forced to retire with a throttle issue after seven laps. \nWith Hamilton subsequently sauntering to his 12th victory of the season, Rosberg is now 73 points adrift of his Mercedes team-mate with just 100 left on the table. \nIndeed Rosberg, now third in the standings behind Hamilton and Sebastian Vettel, will be eliminated from the championship battle at the next race in Texas if Hamilton outscores him by two points. \n\"It is disappointing to see how this year has just been a lot of bad luck,\" said Rosberg, whose retirement in Russia marked the second time in four races he has failed to reach the finish. \n\"Just when I needed to launch an attack and go the other way it is just one thing after another - many small things - and some major things and race-stoppers have just derailed it in the last months. That has been tough.\" \nRosberg, winner of only three grands prix this season, added: \"You have to be realistic now as it is a lot of points, but it does not change my approach. We are still pushing to the maximum. I am committed and going for it . \n\"It is disappointing because I was looking to close the gap, but we will go to the next race and I want to win there. That is the goal at the moment.\" \nRosberg's sentiment sounded like the talk of a fighter, b ut with his shoes off and slumped on his chair inside the team's motorhome, he looked anything but. His boss Toto Wolff even urged the German to turn his attentions to next season. \n\"These boys have been in motor racing all their lives. They have won races and they have lost races,\" Wolff said. \n\"The reasons they are here is because they are strong characters, strong personalities. As gutted as he might be now, he is going to switch on to 2016 mode to try and bounce back next year.\" \nWolff had long since departed the Sochi track when a post-race stewards' investigation into Kimi Raikkonen's last-lap collision with Valtteri Bottas saw Mercedes clinch the team title. \nAsked about the investigation prior to the verdict which arrived two hours after Hamilton's win, Wolff replied: \"Whether we win it with a penalty or not I don't care.\" Related Sport News", "external_links": [], "published": "2015-10-11T20:01:00.000+03:00", "crawled": "2015-10-12T20:00:43.855+03:00", "highlightTitle": ""}