{"organizations": ["Manchester United", "Everton", "Red Devils"], "uuid": "5f83733c79a09e3dae0dcbc983cf09392956ff93", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/cd88159f288d6ecc4af63ff759019e23.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/football/everton-03-manchester-united-van-gaal-proud-of-red-devil/6960974/", "country": "JE", "title": "Everton 0-3 Manchester United: Van Gaal 'proud' of Red Devils performance", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "Everton 0-3 Manchester United: Van Gaal 'proud' of Red Devils performance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T12:16:00.000+03:00", "replies_count": 0, "uuid": "5f83733c79a09e3dae0dcbc983cf09392956ff93"}, "author": "", "url": "http://www.sport.co.uk/football/everton-03-manchester-united-van-gaal-proud-of-red-devil/6960974/", "ord_in_thread": 0, "title": "Everton 0-3 Manchester United: Van Gaal 'proud' of Red Devils performance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Van Gaal"], "text": "Everton 0-3 Manchester United: Van Gaal 'proud' of Red Devils performance By Harsh Biyani (columnist) 19 Oct 2015 09:16:34 \nreads \ncomments \nScorers: Schneiderlin 18', Herrera 22', Rooney 62' Attendance: 39,553 \nVan Gaal: I am very proud of my players and the performance Herrera: If we play like this we can beat anybody Schneiderlin: Great win and great performance from the team. Buzzing after my 1st goal! \nManchester United got back to winning ways and earned a first victory at Goodison Park since 2011 thanks to goals from Morgan Schneiderlin, Ander Herrera and Wayne Rooney. \nIt was the perfect way to get back in the Premier League after the international break and putting behind the humiliating 3-0 defeat against Arsenal. An outstanding away performance from Manchester United, and a hopeless home one from Everton secured The Reds a comfortable win over Everton. United were top-notch in all areas of the pitch, and Everton, aside from a 15-minute spell after half-time, were out passed, outplayed, and outclassed. Very disappointing for Roberto Martinez, but Louis van Gaal must be delighted as his team selection and tactics were spot-on. Smalling, Herrera, Schweinsteiger, Martial and Rooney were excellent, and their win was thoroughly deserved. \nA win over Everton also maintained the pressure on Table Topper- Manchester City, who secured a comfortable 5-1 over Bournemouth at the Etihad Stadium. \nHours before the match began, news came in that Howard Kendall, former Everton player and manager, had passed away at the age of 69 and hence the players wore a black armband as a mark of respect. A minute’s applause also preceded kickoff at Goodison Park. \nA slow start against Arsenal saw The Gunners score thrice within 20 minutes of the start of the game and the manager had pressed for a better opening in the Merseyside. The players had certainly learnt form their mistakes and Schneiderlin scored his first competitive goal for the Reds. Chris Smalling chested Rojo’s shot towards Schneiderlin and with a cool finish, he bagged his first goal in the 18th minute of the game. Just after 4 minutes, Herrera doubled the lead when the Spaniard ran into the area to head Rojo’s cross past Tim Howard, former Reds goalkeeper. \nJones briefly left the action at the 30th minute as he went to nurse his nose, which was continuously pouring with blood. It was a physical first half, which also saw Martial and De Gea, go down temporarily with knocks. Everton looked like scoring a goal before half time and pressed hard for it. They came closest at the 45th minute when a powerful effort from Barkley was clawed away from United’s goalkeeper. \nHalf-time Statistics \nEverton 0-2 Man United (HT): \nShots: 6-6", "external_links": [], "published": "2015-10-19T12:16:00.000+03:00", "crawled": "2015-10-19T20:17:01.698+03:00", "highlightTitle": ""}