{"organizations": [], "uuid": "7cd363c159b0ed1ebe7439e165d3553f5e6418d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.baltimoresun.com", "main_image": "http://www.trbimg.com/img-561ff380/turbine/bs-sp-catching-up-with-george-nock-1016-20151015", "site_section": "http://feeds.baltimoresun.com/baltimoresun/sports/college/rss2", "section_title": "College Sports - Baltimore Sun", "url": "http://www.baltimoresun.com/sports/bs-sp-catching-up-with-george-nock-1016-20151015-story.html", "country": "US", "title": "Catching Up With ... former Morgan State, NFL running back George Nock", "performance_score": 0, "site": "baltimoresun.com", "participants_count": 1, "title_full": "Catching Up With ... former Morgan State, NFL running back George Nock", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T21:12:00.000+03:00", "replies_count": 0, "uuid": "7cd363c159b0ed1ebe7439e165d3553f5e6418d9"}, "author": "Mike Klingaman", "url": "http://www.baltimoresun.com/sports/bs-sp-catching-up-with-george-nock-1016-20151015-story.html", "ord_in_thread": 0, "title": "Catching Up With ... former Morgan State, NFL running back George Nock", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Read more stories \nIt's delicate work, not what you'd expect of a one-time running back who helped Morgan win four conference titles, then played four years in the NFL (1969-72) before his knee blew out. But Nock had an artistic bent early on. \n\"At 7, I found I could visualize an animal and sculpt it out of clay,\" he said. \"I made a horse and said, 'Hey, I like this.' \" \nArt and football seemed to mix. \n\"During skull sessions I'd keep an extra playbook at my desk and doodle in it,\" he said. \"I'd draw anything from grizzly bears to receivers catching passes. Guys in the meeting would say, 'How can you do two things at once?' Well, drawing relaxed me and helped me concentrate\" on football. Sun Remembers Read more stories \nAt Morgan, Nock thrived on a juggernaut coached by the legendary Earl Banks and playing beside the likes of Lanier, John (Frenchy) Fuqua, Raymond Chester and a dozen more who went on to the NFL. \nAs a freshman, in the 1965 Orange Blossom Classic, Nock returned a punt 45 yards for a touchdown in a victory over Florida A&M for the mythical black college national championship. As a senior, he rushed for 87 yards to help beat Grambling, 9-7, in the first game played at Yankee Stadium between two historically black schools. Twice, he made All-Central Intercollegiate Athletic Associationfirst team and averaged six yards a carry. \n\"Great times,\" Nock said of Morgan's golden years. \"Coach Banks didn't think we should ever lose and prepared us that way. We didn't lift weights and only did calisthenics. But we had a mindset of being a team against the world. \n\"For instance, the players' meal tickets were worth just 20 cents more than those of regular students — the equivalent of a piece of cake. If not for the college girls on diets who fed us, we'd have had problems. Then we'd take road trips to other schools and see their all-you-can-eat training tables. We got mad, which added fuel to the fire to beat them all.\" \nOften, Morgan's games were so one-sided that the starters got shortchanged. During Nock's tenure, the Bears won by scores of 69-0, 66-7, 65-0, 63-0 and 53-0. \n\"We'd be up 30 points before halftime and the subs would come in for the rest of the game and play more than we did,\" he said. \nA 16th round draft pick of the New York Jets in 1969, he played three years there and one with the Washington Redskins. In Nock's best year (1970) he rushed for 402 yards, caught 18 passes and scored six touchdowns. In a 20-10 upset of the Minnesota Vikings, he ran for 117 yards, the only player to gain at least 100 yards that season against the NFL's No. 1-ranked defense \n\"If I had had more speed, I'd have been ridiculously great,\" he said. \"But then I'd have to do a sculpture of myself.\" \nHe'd like to create life-sized statues of Morgan State's two revered coaches, Banks and Eddie Hurt, and place them on campus. \n\"I've made inquiries about this for 20 years, but nothing has come of it yet,\" Nock said. \"I told Morgan I'd do it for free if they underwrite the cost of the materials. Those coaches are icons.\"", "external_links": [], "published": "2015-10-15T21:12:00.000+03:00", "crawled": "2015-10-15T22:25:13.470+03:00", "highlightTitle": ""}