{"organizations": [], "uuid": "8ac8317ce53aac61bb9da27de84ce769ae2ed71a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.oregonlive.com", "main_image": "http://imgick.oregonlive.com/home/olive-media/width620/img/oregonian/photo/2015/09/30/18871706-large.jpg", "site_section": "http://www.oregonlive.com/", "section_title": "Oregon Local News, Breaking News, Sports &amp; Weather - OregonLive.com", "url": "http://www.oregonlive.com/today/index.ssf/2015/09/hurricane_may_dump_10_inches_o.html", "country": "US", "title": "Hurricane Joaquin may dump 10 inches of rain on East Coast", "performance_score": 0, "site": "oregonlive.com", "participants_count": 1, "title_full": "Hurricane Joaquin may dump 10 inches of rain on East Coast | OregonLive.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T21:42:00.000+03:00", "replies_count": 0, "uuid": "8ac8317ce53aac61bb9da27de84ce769ae2ed71a"}, "author": "The Associated Press", "url": "http://www.oregonlive.com/today/index.ssf/2015/09/hurricane_may_dump_10_inches_o.html", "ord_in_thread": 0, "title": "Hurricane Joaquin may dump 10 inches of rain on East Coast", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "RALEIGH, N.C. — Steady rain drenched much of the East Coast on Wednesday, flooding roads, closing schools and forcing some people from their homes. And forecasters say the worst is yet to come.\nThe rainstorms may soon be joined by Hurricane Joaquin in a powerful weather system that could linger for days and dump as much as 10 inches through early next week in some places. The deluge has the potential to saturate the ground so heavily that trees topple onto power lines even without heavy winds.\n\"The bottom line is: We are expecting very heavy rains all the way from the Carolinas up into new England,\" said Bruce Terry, lead forecaster for the government's Weather Prediction Center.\nBefore the hurricane draws close to the U.S., an area of low pressure in the Southeast and a front stalled over the East Coast will pull moisture from the Atlantic Ocean that falls as rain over the next few days, Terry said.\nThe heaviest rain is expected in wide swaths of North Carolina and Virginia, along with parts of Maryland, Delaware and New Jersey, according to a National Weather Service forecast map.\nJoaquin could make the difference between a few days of constant rain and an especially damaging storm. But the hurricane's path was far from certain.\n\"That's still up for grabs,\" Terry said.\nSo far, there's been little consensus among computer-prediction models for the hurricane.\nThe National Hurricane Center in Miami was to send a plane aloft Wednesday to gather data about Joaquin that will hopefully \"get those models into better agreement,\" said Rick Knabb, the center's director. \"We're going to be throwing a lot more aircraft resources at this problem over the next few days.\"\nIn southwest Virginia, schools closed early Tuesday in several counties because of flooded roads. Blacksburg had a single-day record of 4.39 inches. In Salem, 30 members of a water-rescue team removed 100 people from a low-lying apartment complex and trailer park.\nTo the west in Elliston, 74-year-old Wendell Johns said floodwaters inundated his yard and left behind garbage and mud, but didn't make it into his trailer.\n\"I've got so much trash washed up, I don't know what I'm going to do,\" he said.\nWith water rising, he went Tuesday to stay at his sister's house after gathering what personal items he could carry, including an oxygen tank to help him breathe.\nHe said he spent an uneasy night wondering what would be waiting for him at home: \"I was just sitting there praying.\"\nNearby, Shannon Sledd waited out the storm in the house she shares with her disabled parents and her two sons. Floodwaters up to 5 feet deep rose up to her front door, but didn't get inside.\n\"My mom and dad are really nervous,\" Sledd said. \"We might have to get out.\"\nIn North Carolina, steady rains have already disrupted communities from the central part of the state to the coast.\nSome roads were closed Wednesday in Guilford County, and emergency medical service Director Don Campbell said he feared that more rain expected through the weekend would topple trees and knock out power.\nAlong the coast, parts of North Topsail Beach eroded from rains and an unusually high tide over the weekend, so officials were watching the hurricane's approach.\n\"We haven't had time to recover from last weekend,\" said Carin Faulkner, the assistant town manager.\nIn New England, a sudden downpour Wednesday led to flooding and slow commutes. Western Massachusetts got up to 5 inches in just hours, according to the National Weather Service.\nCollege student Krystal Diaz said her commute by bus to downtown Providence from nearby Johnston had been especially long because of poor visibility and heavy traffic.\n\"Buses were going slow,\" Diaz said. \"I was late for one of my classes.\"\n-- The Associated Press", "external_links": [], "published": "2015-09-30T21:42:00.000+03:00", "crawled": "2015-10-01T00:31:24.191+03:00", "highlightTitle": ""}