{"organizations": [], "uuid": "9404107a75f842211907d82e467236e5c82cbe61", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seacoastonline.com", "main_image": "http://www.seacoastonline.com/storyimage/SO/20151009/SPORTS/151009098/AR/0/AR-151009098.jpg", "site_section": "http://www.seacoastonline.com/sports/highschool?template=rss&mime=xml", "section_title": "High School Sports - seacoastonline.com", "url": "http://www.seacoastonline.com/article/20151009/SPORTS/151009098/101032/SPORTS?rssfeed=true", "country": "US", "title": "HS volleyball: Bobcats get 'big' win over Bears", "performance_score": 0, "site": "seacoastonline.com", "participants_count": 1, "title_full": "HS volleyball: Bobcats get 'big' win over Bears", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T06:36:00.000+03:00", "replies_count": 0, "uuid": "9404107a75f842211907d82e467236e5c82cbe61"}, "author": "Matt Winnett Foster's Daily Democrat", "url": "http://www.seacoastonline.com/article/20151009/SPORTS/151009098/101032/SPORTS?rssfeed=true", "ord_in_thread": 0, "title": "HS volleyball: Bobcats get 'big' win over Bears", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Oct. 9, 2015 at 10:36 PM By Matt Winnett Posted Oct. 9, 2015 at 10:36 PM » Social News DURHAM — Oyster River High School continued its winning home form in a 3-1 victory over Coe-Brown (5-7) on Friday night in Division II girls volleyball. The scores were 25-20, 24-26, 25-22, 26-24. The win means OR (7-5) has now won two in a row for the third time this season and split the series with C-B after a 3-0 defeat on Sept. 3 in Northwood. Early in the fourth game it looked as though Coe-Brown would even the match at 2-2. Katie Dyer had back-to-back kills and the power of her attacks caused Oyster River to make mistakes. Dyer was a threat all night with 11 kills overall to lead the Bears attack. But the Bobcats’ Holly Hoag proved a force at the net with five points from blocks in the match, two of which came in the final game. With the game needing an extra point to win, Samantha Walker rose to the occasion with a late kill and an ace to seal the win. “It was a big game for us and I think the girls knew that and came ready to play,” said Oyster River coach Cassandra Sweatt. “I thought our hitters did a good job cutting down on the errors in the third and fourth games. And blocking came up huge tonight.” The Bears bounced back to win an evenly fought second game after being behind for most of the first. At the net, Jordan Lippmeyer and Casey Davies put in several good blocks and proved too much for the OR front line. They combined for 16 kills in the match. Crucial for C-B though was the serving of Shannon Riley, she was 30 for 30 from the service line with one ace overall. In the second game it was her serving that got the Bears out to a 3-point advantage and that eventually closed the game. “I felt like we played really well,” said Davies. “We went for every ball, we didn’t give up on ourselves.” After losing the second game, the Bobcats were in a hole early in the third, going down by four points from the opening serve. But the serving of Cassidy Gibb and a kill from Walker swung the score in favor of OR, putting them up by two and the Bobcats were able to maintain that advantage for the remainder. The game was eventually decided by a Walker kill. She had 10 in the match with Gibb adding five along with seven assists. The Oyster River girls have yet to win three in a row this season. While their form at home is impressive with a 5-1 record, they are only 2-4 on the road. They’ll need a win next Wednesday at unbeaten Gilford to extend their winning streak. “We’ve worked on that a lot in practice. Our away games are definitely a struggle for us,” said Walker. “We have to work really hard for that third win. We have such a great group of girls, we’re just thinking we want to win and stay with this group for as long as we can.” Coe-Brown will be looking to get back to winning ways at home against Milford on the same day. After a turbulent start to the season the Bears had been on a three-match win streak until their loss at St. Thomas earlier in the week and again on Friday. “We gave away too many free balls. And when you do that to a hard hitting team such as Oyster River, you’re going to get burned,” said Coe-Brown coach Rick Veno. “We need to focus on consistency. That’s what it is all about.”", "external_links": [], "published": "2015-10-10T06:36:00.000+03:00", "crawled": "2015-10-10T06:05:40.392+03:00", "highlightTitle": ""}