{"organizations": [], "uuid": "93eb95875ba09bd80069f6d3e0bb308eeb7abab0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "abcnewsradioonline.com", "main_image": "http://abcnewsradioonline.com/storage/news-images-october-2015/GETTY_101615_FootballField.jpg?__SQUARESPACE_CACHEVERSION=1445009336520", "site_section": "http://abcnewsradioonline.com/sports-news/rss.xml", "section_title": "Sports News", "url": "http://abcnewsradioonline.com/sports-news/texas-high-school-players-suspended-from-sports-for-tackling.html", "country": "US", "title": "Texas High School Players Suspended from Sports for Tackling Ref", "performance_score": 0, "site": "abcnewsradioonline.com", "participants_count": 1, "title_full": "Texas High School Players Suspended from Sports for Tackling Ref", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T18:29:00.000+03:00", "replies_count": 0, "uuid": "93eb95875ba09bd80069f6d3e0bb308eeb7abab0"}, "author": "Jeanette Torres", "url": "http://abcnewsradioonline.com/sports-news/texas-high-school-players-suspended-from-sports-for-tackling.html", "ord_in_thread": 0, "title": "Texas High School Players Suspended from Sports for Tackling Ref", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Share Article \niStock/Thinkstock (SAN ANTONIO) -- Two Texas high school football players who blindsided a referee in an incident caught on video, were suspended from athletics indefinitely, the district and state athletics commission said.And the John Jay High School assistant coach accused of telling the players to hit the ref, Mack Breed, was suspended for a year, according to the Northside Independent School District. Both he and head coach Gary Gutierrez were publicly reprimanded and put on probation for two years, the University Interscholastic League said in a statement.The players were suspended from athletic activities for the rest of the year and \"in the future unless they make themselves available for testimony in front of the UIL,\" the district statement said.For one of the students, a senior, this is his last year of eligibility. The second student has to appear before the UIL's executive committee to ask for his eligibility to be reinstated, the UIL said.The students hit the ref, Robert Watts, during a game with Marble Falls High School on Sept. 4, 2015. The students, who spoke out publicly, claimed that the ref was making racial slurs and that they were ordered by the assistant coach to hit him.If either coach commits infractions during the probation period, they may incur more severe penalties, according to the UIL.Breed allegedly admitted to Gutierrez that he \"directed the students to make the referee pay for his racial comments and calls,\" according to a signed statement from the principal.Both students were moved to an alternative school for 75 days and will be allowed to return to John Jay in January, their lawyer said.The UIL said it is still investigating the claims that racial slurs were made. Watts has denied making them.Northside ISD Superintendent Dr. Brian Woods said the actions were \"fair and appropriate\" in a statement.A lawyer for the teens did not immediately respond to a call for comment. \nCopyright   Friday, October 16, 2015 at 11:29AM", "external_links": [], "published": "2015-10-16T18:29:00.000+03:00", "crawled": "2015-10-17T01:51:46.688+03:00", "highlightTitle": ""}