{"organizations": [], "uuid": "cdc3994ceddf1dfbeae25dc96126e7ebb2507f4e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "", "site_section": "http://www.financialexpress.com/section/sports/", "section_title": "Sports News:Sports News Headlines,Cricket News Updates,Cricket News Live Score | The Financial Express", "url": "http://www.financialexpress.com/article/sports/manchester-city-are-derby-favourites-says-united-boss-van-gaal/156368", "country": "IE", "title": "Manchester City are derby favourites, says United boss Van Gaal", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Manchester City are derby favourites, says United boss Van Gaal | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T06:24:00.000+02:00", "replies_count": 0, "uuid": "cdc3994ceddf1dfbeae25dc96126e7ebb2507f4e"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/sports/manchester-city-are-derby-favourites-says-united-boss-van-gaal/156368", "ord_in_thread": 0, "title": "Manchester City are derby favourites, says United boss Van Gaal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Cristiano Ronaldo sets the tone as Real Madrid top La Liga table Arsenal top Premier League table with 2-1 win over Everton Giroud, Koscielny head Arsenal to win over porous Everton Former manager David Moyes was castigated for playing down Manchester United’s chances during his short reign at Old Trafford, but present incumbent Louis van Gaal was at it on Friday ahead of the derby with Manchester City.\nVan Gaal, whose side are third in the Premier League, two points behind leaders City, enjoyed a 4-2 victory in the corresponding fixture last season but believes the visitors are expected to win the 170th derby on Sunday.\n“You have to ask the fans, it’s not so important who is the favourite,” Van Gaal told a news conference.\n“When you look at the facts they are first and we are second or third, they are the favourites I think.”\nWhile City played at home against Sevilla in the Champions League on Wednesday, United had a long trip to Moscow where they drew 1-1 with CSKA.\n“We have to do our work, prepare our game, but we had one day less so it’s more difficult for us,” the Dutchman said. “But we have to do that, we hope that we can beat Manchester City.”\nVan Gaal has more or less a full squad to choose from for Sunday’s Premier League game, with only Luke Shaw and Paddy McNair unavailable. Ashley Young is not quite ready after injury.\n“It’s always better that a manager can select from a lot of players. There have been times when I could not select from many, like last year, but this year it’s much better,” he said.\nCaptain Wayne Rooney is expected to start up front for United, despite his struggles in front of goal this season and criticism for his all-round contribution.\nShould Rooney, who turns 30 on Sunday, score he would move second on his own in the all-time Premier League scoring charts with 188. He would also equal Denis Law’s 237 goals for United and be joint-second on the club’s all-time scoring list behind Bobby Charlton on 249.\nRooney will be involved in his 20th Manchester derby having scored eight times, but for German midfielder Bastian Schweinsteiger it will be his first taste of one having joined from Bayern Munich.\n“I am definitely looking forward to the derby against City. I think it is something very special and we should be very happy that we have two big clubs in one city that are also playing in the Champions League,” he told United’s website.\n“I remember when I was in Munich we were always looking for that, but the other team at 1860 Munich didn’t play so well!\n“We were always looking for a derby but it was sadly not possible.”\n 24, 2015 11:24 pm", "external_links": [], "published": "2015-10-25T06:24:00.000+02:00", "crawled": "2015-10-25T08:47:56.024+02:00", "highlightTitle": ""}