{"organizations": [], "uuid": "97847ea3baf7c30037e3538e7929a81dedbb2de3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kentucky.com", "main_image": "http://media.kentucky.com/smedia/2015/09/17/18/19/1iB4MT.AuSt.79.jpeg", "site_section": "http://www.kentucky.com/232/index.rss", "section_title": "Kentucky.com -- Sports Update", "url": "http://www.kentucky.com/welcome_page/?shf=/2015/10/01/4066335_as-keeneland-meet-opens-americas.html", "country": "US", "title": "High school notebook: Bryan Station goes from overlooked to on top", "performance_score": 0, "site": "kentucky.com", "participants_count": 0, "title_full": "High school notebook: Bryan Station goes from overlooked to on top", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:31:00.000+03:00", "replies_count": 0, "uuid": "97847ea3baf7c30037e3538e7929a81dedbb2de3"}, "author": "", "url": "http://www.kentucky.com/welcome_page/?shf=/2015/10/01/4066335_as-keeneland-meet-opens-americas.html", "ord_in_thread": 0, "title": "High school notebook: Bryan Station goes from overlooked to on top", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Bryan Station"], "text": "[Hike! Your guide to Friday's top games] \nThe Defenders (5-1) don't have as many doubters these days. They're rated sixth in the Cantrall Ratings and eighth in the latest media poll (I ranked them sixth). They're one of the top scoring — averaging 46.5 points per game — and defensive — two shutouts for the first time since 2000 — teams in Class 6A. \nTheir lone loss was to No. 4 Simon Kenton (6-0), a result Coach Frank Parks attributed to a lack of mental acuity for the entire 48 minutes. \nSenior quarterback Andre Davis , whose 23 touchdown passes have him tied with Ray Zuberer (Owensboro Catholic) for the state lead, said he learned to be more patient and less forceful after going through that loss. He thinks it'll be a much different game if the two meet in the postseason. \n\"If we meet again I know it's gonna be a definite win,\" Davis said. \"No doubt.\" \nBefore a hypothetical rematch can occur, though, Station must finish the regular season. Its opponent Friday? No. 10 Lafayette. \nThe Generals were ranked sixth in the preseason and tout several Division I prospects. They've had an easy enough time finding their offensive identity but struggled to stop two fellow 6A stalwarts — Trinity (70-14 loss) and Scott County (65-46 loss). Henry Clay kept Lafayette honest in the second half last week in a 48-34 Generals win. \nOne expects Bryan Station to be another tough test for Lafayette (4-2), especially since the Defenders were glossed over in the preseason in favor of the Generals. \n\"We took that as motivation,\" Davis said. \"Coming in, everyone thought we were going to have a downfall because we lost our three top receivers ( Tequan Claitt, Marcus Floyd and CJ Walker ). We said, 'We're not going to let that destroy us.'\" \nStation boasts a dynamic two-way playmaker in senior Devon Key , who has visited Toledo and Miami (Ohio) in recent weeks. \nAside from Brice Phelps (Ohio County), Key is the only Class 6A player to appear among the state leaders as a rusher (90 yards per game) and receiver (64 yards per game). He leads the Defenders with 34 tackles and has two interceptions, including one he returned 108 yards for a TD last week against Tates Creek. That made him the 33rd player in state history with an interception returned 100-plus yards for a score and the first since 2011. \n\"It felt great to finally get a pick-six this year,\" Key said. \"The big thing I liked about that interception was once I got it, my teammates just turned around and blocked for me. That's what made it happen.\" \nStation and Lafayette each feature highly regarded players, Key said, and acknowledged that bragging rights are on the line Friday. \n\"We were underrated and everybody looked over us,\" Key said. \"Something I tell my teammates is, 'Go out, compete, and all of it will fall into place.'\" \nBelfry's out-of-state back-to-back \nBelfry, ranked first in the Class 3A media poll, is coming off a big win over an out-of-state foe at home. It travels to another out-of-state challenger Friday. \nThe Pirates (5-0) defeated Knoxville Catholic 38-14 last Friday. They were paced by Xondre Willis , who rushed for 157 yards on only 11 carries. \nThis week Belfry goes to Cabell Midland, near Huntington, W.Va. \nMidland, ranked No. 1 in West Virginia's top class (3A), has picked up wins over the No. 2 team in its class — defending state champion Capital — and last season's 3A runner-up, South Charleston. \n\"Defensively they have been able to limit big plays so far this season,\" reporter Grant Traylor of The Herald-Dispatch in Huntington told the Herald-Leader. He called the Knights' Jacob Hendricks \"an explosive rusher\" and Caperton Humphrey \"a bruising back.\" \nFriday's forecast calls for a chilly night and rain, so Traylor expects a \"trench war.\" \n\"Whoever wins the line of scrimmage and turnover battle will win the game,\" he said. \nFans looking to keep up with Belfry's trip across the state line should follow Traylor on Twitter @GrantTraylor. \n■ Jovon Williams had two interceptions, including one he returned for a 62-yard touchdown, in Harrison County's 25-14 win over Holmes last Friday. \n■ Jaylyn Williams rushed for 464 yards and six TDs in Letcher County Central's 33-6 win over Perry County Central. The senior has rushed for 1,532 yards and 21 TDs this season. \nState's top volleyball teams head to Chicago \nWhen No. 5 Henry Clay goes up against Lyons Township (Ill.) in the Asics Challenge in Chicago at 7 p.m. Friday, it'll seek more than its 25th win this season. \nThe Blue Devils' next victory will be No. 600 for head coach Dale Grupe , who's won 498 times with Henry Clay (Grupe spent his first four seasons at Woodford County). He's in his 22nd season as a head coach. \nThe KHSAA doesn't have many volleyball records on file, but Grupe's tally should rank near the top. He correctly assumed Assumption's Ron Kordes is the state leader; Kordes' is 970-96 over his 27-year career. \nGrupe said the club teams in Lexington continue to improve and allow more and more girls to develop their games year-round, which has enabled the city to become a bigger player statewide and nationally. \nTeams from six states will compete in the Asics Challenge, including Kentucky's Sacred Heart (No. 1), Assumption (No. 2) and Notre Dame (No. 4). Their state teams' rankings correspond to their seeding in pool play before the bracketed tournament begins Saturday. Henry Clay is seeded sixth overall. \n■ Western Hills Coach Kristi Buffenmyer reached a milestone this week, too. She earned her 300th win as a head coach when the Wolverines defeated Bryan Station on Monday, 3-1 (25-19, 22-25, 25-13, 25-11). \nBuffenmyer, an Ohio native and former middle hitter at Midway College, took over at Western Hills in 1995. She's loved watching the game change and grow, and has been instrumental in development of the Frankfort Elite Volleyball Association. \nFEVA \"gives these outskirt counties ... the year-round opportunities like the bigger schools up in Lexington and Louisville,\" Buffenmyer said. \"That's really helped us be competitive with those schools.\" \nThe Wolverines were 17-12 after a 3-0 win against 41st District foe Franklin County at home on Thursday. \nAll \"A\" soccer results \nThe boys' and girls' All \"A\" soccer champions were crowned Sunday in Frankfort. \nKentucky Country Day, ranked 13th in the Maher Rankings, defeated Sayre 3-2 in the boys' finals. \nIt was the first loss for the Spartans, who led 2-1 at the half on goals by Will Newton and Chris Saad . Coach Joe Porter said his group's \"performance against a top team in the state was exceptional.\" \nSayre fell 3-1 at Henry Clay on Tuesday and beat Paris 5-0 at home Thursday. It is now 9-2-4. \nNewport Central Catholic, ranked third in the latest coaches' poll, beat Lexington Christian 4-2 in the girls' title game. \nLCA led early on a fourth-minute goal by Peyton Nagle, but NewCath scored three goals in five minutes beginning in the ninth to overtake the lead. \nThe Thoroughbreds have won twice since taking the title and are now 19-0. \nThe Eagles, now 7-8-2, tied East Jessamine 0-0 Monday and fell 2-0 at No. 8 Boyle County on Wednesday. \n■ Former Sayre star Harrison Dunn , a sophomore at Centre College, scored two goals in 31 seconds in the Colonels' 4-0 win over Spalding on Sunday. That time is tied for the 14th-fastest between consecutive goals by a single player in Division III history. \nFellow sophomore Brandon Schweder , a standout at Lafayette, scored his first collegiate goal in the game. \n■ Paul Laurence Dunbar Coach Todd Bretz will be seeking his 434th soccer win — which would be a state record — when the Bulldogs travel to St. Louis for a tournament this weekend. \nSt. Xavier vs. D-I field? \nOverheard at the 9th Region boys' golf tournament Monday: \"St. Xavier could put up better rounds than some NCAA Division I teams.\" \nCrazy? Maybe not. The Tigers boast three golfers committed to D-I schools — Allen Hamilton (University of Kentucky), Matt Liston (UK) and Michael Sass (College of Charleston) — and two more, Billy Basham and Drew Kiehl , who are considering multiple D-I offers. \nSt. X aims to add to its state-leading 19 team titles at the boys' state golf tournament next week in Bowling Green. Josh Moore: (859) 231-1307. Blog: Kentucky.com/josh-moore. Twitter: @HLpreps.", "external_links": [], "published": "2015-10-02T03:31:00.000+03:00", "crawled": "2015-10-02T11:42:48.888+03:00", "highlightTitle": ""}