{"organizations": ["Ezra Shaw Getty Images"], "uuid": "31a0278ceddfd13ee5ba2a80b368f778e657c931", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.localnews8.com", "main_image": "http://www.localnews8.com/image/view/-/35651524/highRes/2/-/maxh/640/maxw/640/-/v81hhc/-/GB-vs--SF-Week-4-Aaron-Rodgers-Ezra-Shaw-Getty-Images-jpg.jpg", "site_section": "http://www.localnews8.com/14412878?format=rss_2.0&view=feed", "section_title": "Feed:Sports", "url": "http://www.localnews8.com/sports/packs-balanced-attack-beats-49ers/35651544", "country": "US", "title": "Pack's balanced attack beats 49ers", "performance_score": 0, "site": "localnews8.com", "participants_count": 0, "title_full": "Pack's balanced attack beats 49ers", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:28:00.000+03:00", "replies_count": 0, "uuid": "31a0278ceddfd13ee5ba2a80b368f778e657c931"}, "author": "", "url": "http://www.localnews8.com/sports/packs-balanced-attack-beats-49ers/35651544", "ord_in_thread": 0, "title": "Pack's balanced attack beats 49ers", "locations": ["Calif.", "SANTA CLARA"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Pack's balanced attack beats 49ers POSTED: 06:28 PM MDT Oct 04, 2015 Ezra Shaw Getty Images SANTA CLARA, Calif. - \nQuarterback Aaron Rodgers threw for 224 yards and one touchdown, and the Green Bay Packers remained undefeated with a 17-3 victory over the San Francisco 49ers on Sunday afternoon at Levi's Stadium. Related Content \nGreen Bay's defense dominated quarterback Colin Kaepernick and a struggling 49ers offense. Kaepernick was sacked six times. Linebacker Nick Perry had two sacks, while linebackers Clay Matthews, Jayrone Elliott, Julius Peppers and Mike Neal each had one.The 49ers (1-3) lost their third straight game and have been outscored 107-28 during that stretch.The Packers (4-0) had lost four straight games to San Francisco, including playoff defeats in the 2012 and 2013 seasons.Rodgers completed 22 of 32 passes with no interceptions. Wide receiver James Jones caught five passes for 98 yards, and running back Eddie Lacy carried 18 times for 90 yards.Kaepernick completed 13 of 25 passes for 160 yards and one interception. Running back Carlos Hyde gained just 20 yards on eight carries. Wide receiver Torrey Smith caught two passes for 54 yards.The Packers led 7-3 at halftime and made it 14-3 with7:10 left in the third quarter on fullback John Kuhn's 1-yard touchdown plunge. Green Bay drove 61 yards in nine plays for the scored.On third-and-7 from the 49ers' 46, Rodgers hit Jones along the left sideline for 38 yards, giving Green Bay first-and-goal at the 8. Jones got half a step behind cornerback Kenneth Acker, who never looked back for the ball, and got both feet down after grabbing Rodgers'After a holding penalty moved the Packers back 10 yards, Rodgers scrambled 17 yards around right end, and Kuhn did the rest.The Packers forced a quick punt as Matthews sacked Kaepernck on third-and-4 from the 49ers 26. Rodgers marched the Packers to the San Francisco 13, and Mason Crosby drilled a 31-yard field goal, increasing Green Bay's lead to 17-3 with 45 seconds left in the third quarter.Green Bay took the opening kick and drove 80 yards in 12 plays for a touchdown, Aaron Rodgers zipping a 9-yard scoring pass to tight end Richard Rodgers. The Packers quarterback sidestepped 49er pass rushers twice, buying time as Richard Rodgers worked across the back of the end zone, getting separation from safety Antoine Bethea.Green Bay's drive appeared to end when Rodgers faced third-and 11 from his 19 and was sacked by linebacker Ahmad Brooks and defensive tackle Quinton Dial. But an illegal contact penalty on linebacker Michael Wilhoite kept the drive alive.Rodgers, who was sacked three times Sunday, was under pressure throughout the first half and threw for just 129 yards.The 49ers cut Green Bay's lead to 7-3 with 4:25 left in the first half on Phil Dawson's 33-yard field goal. The 49ers had marched to Green Bay's 5, but back-to-back sacks by Perry and Elliott moved them back to the 22.NOTES: TE Vernon Davis (knee) was inactive for the 49ers. Backup Vance McDonald started in his place. ... Packers DT Letroy Guion was added to the active roster and serving a three-game suspension for violating the NFL's substance abuse policy. ... Packers WR Davante Adams (ankle) was inactive. James Jones started in his place. WR Jared Abbrederis was signed off the practice squad. ... San Francisco RB Reggie Bush, who missed the previous two games with a calf injury, was active against Green Bay. Distributed by LAKANA and The Sports Xchange. This material may not be published, broadcast, rewritten or redistributed. Recommended", "external_links": [], "published": "2015-10-05T03:28:00.000+03:00", "crawled": "2015-10-05T04:44:41.146+03:00", "highlightTitle": ""}