{"organizations": [], "uuid": "1d6b3f413791f3bbcba19f12f70314d10b71d115", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fox14tv.com", "main_image": "http://KOAM.images.worldnow.com/images/9017432_G.jpg", "site_section": "http://www.fox14tv.com/", "section_title": "Fox 14 News - FOX 14 TV Joplin and Pittsburg News Weather Sports |", "url": "http://www.fox14tv.com/story/30262856/kansas-colleges-take-on-concealed-carry", "country": "US", "title": "Kansas colleges take on concealed carry", "performance_score": 0, "site": "fox14tv.com", "participants_count": 1, "title_full": "Kansas colleges take on concealed carry - FOX 14 TV Joplin and Pittsburg News Weather Sports |", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T01:48:00.000+03:00", "replies_count": 0, "uuid": "1d6b3f413791f3bbcba19f12f70314d10b71d115"}, "author": "Carly Willis, Reporter", "url": "http://www.fox14tv.com/story/30262856/kansas-colleges-take-on-concealed-carry", "ord_in_thread": 0, "title": "Kansas colleges take on concealed carry", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PITTSBURG, KANSAS - The Kansas Board of Regents met on Pittsburg State's campus to tackle issues in higher education. The board has their own list to discuss including some policy changes, but students have their own concerns.\n\"They increase tuition almost every year. Every school year. And it's very very hard for us, especially as international students because the rate of the dollar keeps going up,\" senior Sandra Kanyigianya said.\nKanyigianya is an international student from Uganda, struggling to make ends meet with the rising cost of tuition.\n\"Now I feel like I have to cut down on my consumption of so many things, including textbooks. I can't honestly really afford them because they're super expensive. It's honestly very hard,\" Kanyigianya said.\nOthers are concerned with the prime topic of discussion at the Kansas Board of Regents monthly meeting: concealed carry policies for college campuses. Due to Kansas legislation passed in April of 2015, anyone can carry a concealed weapon without permit.\n\"With the shootings and stuff, definitely I want to push for more security. I know we have some cabinet officials who want the conceal and carry, and I'm totally against that. Because I feel like that threatens us,\" freshman Dominic Lopez said.\nChairman of the Board of Regents says no definite decision will be made at this meeting, but many sides will be heard on the issue.\n\"The Board of Regents and all the institutions will take a really deep dive over the next six months to a year in regards to the state law that's been passed. How do we go about implementing that on our college campuses. Getting a good feel for what is the law? What can we do? What can we not do? Develop a policy that then each institution can take and develop their own policy on their own campus,\" Shane Bangerter, Chairman of the Board of Regents said.", "external_links": [], "published": "2015-10-15T01:48:00.000+03:00", "crawled": "2015-10-15T15:45:04.343+03:00", "highlightTitle": ""}