{"organizations": [], "uuid": "6c79e7294f7cc8e070266a83a9228e09352789a8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/d5fbc1e00aaa3fc5c8a6268f21f474a7", "site_section": "http://www.news.com.au/sport", "section_title": "Sport | Sports News and Results | News.com.au", "url": "http://www.news.com.au/sport/tennis/nick-kyrgioss-bad-behaviour-could-lead-to-australian-open-ban/story-fndkzym4-1227572656395", "country": "AU", "title": "Grow up Nick - or miss the Open", "performance_score": 0, "site": "news.com.au", "participants_count": 1, "title_full": "Grow up Nick - or miss the Open", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T23:08:00.000+03:00", "replies_count": 0, "uuid": "6c79e7294f7cc8e070266a83a9228e09352789a8"}, "author": "news.com.au", "url": "http://www.news.com.au/sport/tennis/nick-kyrgioss-bad-behaviour-could-lead-to-australian-open-ban/story-fndkzym4-1227572656395", "ord_in_thread": 0, "title": "Grow up Nick - or miss the Open", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Video Image Jo-Wilfried Tsonga into Shanghai Rolex Masters semi-final 0:35 Tennis: Jo-Wilfried Tsonga has qualified for the Shanghai Rolex Masters semi-finals after his three set win over Kevin Anderson.\nOctober 17th 2015 4 days ago /video/video.news.com.au/Sport/Tennis/ Nick Kyrgios could get himself banned from the Australian Open, warns John Alexander.\nThe Sunday Telegraph THE on-court behaviour of Nick Kyrgios is the most talked-about issue on the tennis world tour and arguably in Australian sport right now.\nEveryone from Wally Masur, Lleyton Hewitt, Rod Laver and Roger Federer have had their say.\nSocial media reaction to Kyrgios’ latest outburst in Shanghai last week even drew the attention of Adelaide Crows captain Taylor Walker, who described Kyrgios as an ’‘absolute galoot’’.\nAnd now John Alexander, one of Australia’s longest-serving Davis Cup players, has had his say.\nAlexander, the Federal Member for Bennelong, believes Kyrgios is on a collision course to being banned from the Australian Open, while also declaring he needs to have a good ‘’look at himself’’.\n“If you were to run a book on it, is there a bet that you can make for him to pick up $6685 worth of fines before February to get a four-week ban?” Alexander said.\n“He’d be smart if he got a few more fines now and served the ban in the month of November. Because the way he’s going, he is likely to be banned for the Australian Open.\n“That would really hurt him. But maybe that’s what he needs before he then has some time to look at himself.’’\nAlexander implored Kyrgios to come forward with an apology in a bid to show the Australian public he is willing to improve his on-court behaviour while also opting to steal a line from former prime minister Tony Abbott.\nLEGEND: Shark attacks disrespectful Kyrgios\nDING DING: Kyrgios and Walker at it again\nNick Kyrgios’s behaviour could cost him dear. Source: AFP\n“I think it would be a very good thing for him to say ‘I’ve had a good talk with Wally (Masur), I’ve had a good talk with my parents and I understand the error of my ways and my New Year resolution is to be a better person’,’’ the former world No.8 said.\n“He’d be very good to Quote: Tony Abbott and say ‘I will seek to be my best self’.\n“The great frustration I have and a lot of people have, is that he’s such a talented guy.\n“If he knew all Australians are just willing him and wanting him to be a person that they can be proud of, he would die and go to heaven with no pain. It would be fantastic. He could be a cross between Pat Rafter and Lleyton Hewitt.’’\nAlexander, a passionate leader of his community, is currently in training for a 100km walk around his electorate this month, to raise funds for motor neurone disease.\n“It’s an awful disease,’’ Alexander said.\n“There’s no cure and there’s virtually no treatment. We’ll be trying to raise as much money as possible.’’\n Grow up Nick - or miss the Open", "external_links": ["http://cdn.newsapi.com.au/image/v1/external?url=http%3A%2F%2Fcontent4.video.news.com.au%2Ffoxsports%2Fprod%2Farchive%2F2015%2F10%2F17%2FFSD_171015_TEN_SHANG_QF_TSONGA_ANDERSON_WIPE_VSV.jpg&width=650&api_key=kq7wnrk4eun47vz9c5xuj3mc", "http://cdn.newsapi.com.au/image/v1/d5fbc1e00aaa3fc5c8a6268f21f474a7", "http://www.dailytelegraph.com.au/sport/tennis/nick-kyrgioss-bad-behaviour-could-lead-to-australian-open-ban/story-fnibcgxr-1227572656395", "http://cdn.newsapi.com.au/image/v1/origin:fatwire.", "http://www.sundaytelegraph.com.au/", "http://cdn.newsapi.com.au/image/v1/c3f44fa2b714e22c63e8ce744d5ab0f0", "http://widgets.outbrain.com/outbrain.js"], "published": "2015-10-17T23:08:00.000+03:00", "crawled": "2015-10-20T13:47:52.696+03:00", "highlightTitle": ""}