{"organizations": [], "uuid": "c3e8cc7f190bb6e0c8d553f063dfd4a41c94b8a9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-56168d14/turbine/ct-nvs-naperville-barricaded-man-st-1009-20151008", "site_section": "http://www.chicagotribune.com/", "section_title": "Chicago Tribune: Chicago breaking news, sports, business, entertainment, weather and traffic - Chicago Tribune", "url": "http://www.chicagotribune.com/suburbs/naperville-sun/crime/ct-nvs-naperville-barricaded-man-st-1009-20151008-story.html", "country": "US", "title": "Naperville condo barricade situation ends without incident Naperville Sun", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Naperville condo barricade situation ends without incident - Naperville Sun", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T22:43:00.000+03:00", "replies_count": 0, "uuid": "c3e8cc7f190bb6e0c8d553f063dfd4a41c94b8a9"}, "author": "Bill Bird", "url": "http://www.chicagotribune.com/suburbs/naperville-sun/crime/ct-nvs-naperville-barricaded-man-st-1009-20151008-story.html", "ord_in_thread": 0, "title": "Naperville condo barricade situation ends without incident Naperville Sun", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A standoff involving Naperville police and a man who barricaded himself Wednesday night inside his condominium unit ended peacefully early Thursday afternoon, with the man taken to a local hospital for observation and possible treatment.\n\"The situation was resolved just after 1:15 p.m.\" Thursday, with no injuries to the man, his neighbors, police officers or firefighters, said Naperville police Cmdr. Jason Arres, of the department's office of professional standards.\nThe trouble began Wednesday night in the RiverPlace Condominiums, at 509-511 Aurora Ave. The complex, which consists of two, six-story buildings, is west and south of the city's downtown, and directly across Aurora Avenue from the campus of Naperville Central High School.\n\"We're dealing with a mental health situation with an individual in one of the units,\" Arres said Thursday morning. The resident in question, a 44-year-old man, lives in one of the fifth-floor units of the 511 building.\nArres said \"about 10\" police officers were initially sent Wednesday night to assess the situation and secure the buildings. \"Just over a half-dozen\" were on the scene early Thursday afternoon, when the man was taken into custody, he said.\nNo one else was in the man's home at the time, and no weapons were displayed during the incident or found inside the unit, Arres said. No criminal charges have been filed.\nThe man was taken to Edward Hospital in Naperville for evaluation. Arres would not comment on what might have caused the trouble.\nClasses at Naperville Central were not in session Thursday, but other activities were reportedly taking place on the school's athletic fields during the standoff.\nwbird@tribpub.com\nCopyright © 2015, Naperville Sun", "external_links": ["http://www.trbimg.com/img-56168d14/turbine/ct-nvs-naperville-barricaded-man-st-1009-20151008"], "published": "2015-10-08T22:43:00.000+03:00", "crawled": "2015-10-09T00:58:12.222+03:00", "highlightTitle": ""}