{"organizations": [], "uuid": "70249b29ad6f3eb112cde1e3e7c61e388b105f8f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "nypost.com", "main_image": "https://thenypost.files.wordpress.com/2015/10/bn.jpg", "site_section": "http://nypost.com/sports/feed/", "section_title": "| Sports | New York Post", "url": "http://nypost.com/2015/10/01/nets-forced-to-relive-college-nightmares-and-triumphs/", "country": "", "title": "Nets forced to relive college nightmares — and triumphs", "performance_score": 0, "site": "nypost.com", "participants_count": 1, "title_full": "Nets forced to relive college nightmares — and triumphs | New York Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T01:10:00.000+03:00", "replies_count": 0, "uuid": "70249b29ad6f3eb112cde1e3e7c61e388b105f8f"}, "author": "Tim Bontemps", "url": "http://nypost.com/2015/10/01/nets-forced-to-relive-college-nightmares-and-triumphs/", "ord_in_thread": 0, "title": "Nets forced to relive college nightmares — and triumphs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "DURHAM, N.C. — When Thaddeus Young agreed to re-sign with the Nets, he had a feeling where he would be spending the first week of the upcoming season. And, as a proud Georgia Tech Yellow Jacket, he wasn’t thrilled.\n“This is not my first rodeo coming here,” Young said of spending the week at Duke University for training camp. “I came with [former Sixers coach] Doug [Collins], because his son Chris was on staff here, so we came here and did the same thing, and then I came here with Billy [King, then the Sixers’ general manager] when I first came into the league. … So this is definitely not my first rodeo.\n“I figured it was going to happen again.”\nFor Young, fellow Georgia Tech product Jarrett Jack, Wayne Ellington (North Carolina) and Shane Larkin (Miami), this week not only meant the start of training camp and a new season, but spending time around the campus of one of their schools’ top rivals.\nDuke Hall of Fame coach Mike Krzyzewski stopped in at Thursday’s practice and spoke to King, who played for him from 1984-88, coach Lionel Hollins and several players, including Jack.\nThe experience was different for each of the ACC guys, though. Ellington, for instance, went 5-1 during his three years playing for Duke archrival North Carolina from 2006-09, including going a perfect 3-0 at Cameron Indoor Stadium, so he could say pretty much whatever he wanted.\n“I’m used to just coming into Cameron and beating up on these guys,” Ellington said, smiling. “But once you start getting in here and playing, it’s just like any other gym.”\nLarkin had a similar feeling, given he went 2-1 during his two years at Miami — including an upset overtime win at Cameron as a freshman.\n“I don’t really look at them as enemies, because we did beat them two out of three times I played them,” Larkin said with a grin. “I respect them, and obviously Coach K has all of the titles and everything, but I don’t feel like I’m in enemy territory. … I won in Cameron one time, lost one time, so it’s an even playing ground over here.”\nThings were a little different for Jack and Young, though, at least for this week, considering Georgia Tech’s football team lost 34-20 at Duke less than two weeks ago.\n“Unfortunately, yes,” Jack said when asked if he had heard from King about the result. “And I watched it from start to finish.\n“Our guys, I don’t know, man. They just had a rough go of it that day. Rough two weeks, because we lost to Notre Dame and then lost to Duke. … Goodness gracious.”\n“[King] said he tweeted at me, but I didn’t see it,” Young said, shaking his head. “Good thing I didn’t, because I probably would have said something crazy.\n“But it’s cool. It happens. Every dog has its day. It is what it is.”", "external_links": [], "published": "2015-10-02T01:10:00.000+03:00", "crawled": "2015-10-02T05:49:02.954+03:00", "highlightTitle": ""}