{"organizations": [], "uuid": "cbf159509dbd3b0c5dc84d1b58ff52cb4109e59c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.staradvertiser.com", "main_image": "http://media.bclocalnews.com/images/Mets+Dodgers+Baseball_Ramo.jpg", "site_section": "http://www.staradvertiser.com/sports/breaking/index.rss", "section_title": "Breaking-Sports", "url": "http://www.staradvertiser.com/sports/breaking/20151011_Clean_slide_or_dirty_play_The_take_on_Utleys_takeout.html", "country": "US", "title": "Dodgers' Utley suspended 2 playoff games for 'illegal' slide", "performance_score": 0, "site": "staradvertiser.com", "participants_count": 10, "title_full": "Dodgers' Utley suspended 2 playoff games for 'illegal' slide - Hawaii News - Honolulu Star-Advertiser", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T19:50:00.000+03:00", "replies_count": 10, "uuid": "c6acec91d8f26a5fb29eff9a273659c59fdab052"}, "author": "Mike Fitzpatrick", "url": "http://www.staradvertiser.com/sports/breaking/20151011_Clean_slide_or_dirty_play_The_take_on_Utleys_takeout.html#post-0", "ord_in_thread": 0, "title": "Dodgers' Utley suspended 2 playoff games for 'illegal' slide", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK » Los Angeles Dodgers second baseman Chase Utley was suspended two playoff games Sunday night for his late takeout slide that broke New York Mets shortstop Ruben Tejada's right leg. In handing down the penalty, Major League Baseball executive Joe Torre called it an illegal slide. Umpires ruled it a legal play Saturday night.\nTorre said after a complete review, he concluded Utley's slide merited punishment.\nThere was no immediate confirmation on whether Utley would appeal, which could keep him eligible to play Games 3 and 4 this week in New York. If he contests the penalty, chances are MLB would try to hold a hearing Monday.\nThe best-of-five NL Division Series is tied at one apiece.\nThe 36-year-old Utley, a six-time All-Star, has a part-time role with the Dodgers after they acquired him Aug. 19 from Philadelphia. But before the suspension was announced, manager Don Mattingly said the infielder might start Game 3 on Monday night because of his solid numbers against Mets pitcher Matt Harvey and the lefty-righty matchup.\nWith the Dodgers trailing by a run in the seventh inning Saturday, Utley slammed into Tejada at second base to make sure the Mets could not complete a double play that would have kept them ahead. Utley went in high and hard, crashing into Tejada's legs and flipping the shortstop head over heels.\nThe tying run scored, Tejada was wheeled off with a fractured fibula and the Dodgers rallied for three more runs in the inning, going on to a 5-2 victory that evened the best-of-five series at one apiece.\n\"I recognize that there has been much commentary and many questions regarding the unfortunate play in last night's game in which Ruben Tejada was injured. As I said after the game, the determination of whether a baserunner has intentionally interfered with a player attempting to turn a double play is left to the judgment of the umpire on the field, and that judgment call is not subject to review. I should add that determining where to draw the line between illegal slide and a legitimate hard play is an extremely difficult call for our umpires,\" Torre said.\n\"However, after thoroughly reviewing the play from all conceivable angles, I have concluded that Mr. Utley's action warrants discipline. While I sincerely believe that Mr. Utley had no intention of injuring Ruben Tejada, and was attempting to help his club in a critical situation, I believe his slide was in violation of Official Baseball Rule 5.09(a)(13), which is designed to protect fielders from precisely this type of rolling block that occurs away from the base.\"\nThe Mets quickly released a statement saying they \"completely support the decision\" and \"feel this was the appropriate course of action.\"\n\"With this decision behind us, the team and our fans can now focus on playing winning baseball,\" the club said.\nTorre said MLB has been talking with the players' union this year about potential rules changes to better protect middle infielders.\n\"We intend to continue those discussions this offseason,\" he said.\nWhen the Mets and Dodgers played in the 1988 NL Championship Series, there also was a suspension. Reliever Jay Howell was penalized three games for having pine tar in his glove — he appealed, and his suspension was cut to two games.\nUtley batted .212 with eight homers and 39 RBIs in 107 games with the Phillies and Dodgers this season. He hit .202 with three home runs and nine RBIs in 34 games with Los Angeles.\nUtley had a pinch-hit single in the seventh inning Saturday to help the Dodgers rally.\n ", "external_links": [], "published": "2015-10-11T19:50:00.000+03:00", "crawled": "2015-10-12T20:59:17.106+03:00", "highlightTitle": ""}