{"organizations": [], "uuid": "2fd20d79c1e329de2179d0564716a4862930f8d4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ajc.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/07/30/39/08/cell-phone.jpg", "site_section": "http://www.ajc.com/", "section_title": "AJC.com: Atlanta News, Sports, Atlanta Weather, Business News | www.ajc.com", "url": "http://www.ajc.com/news/news/national/us-limiting-unlimited-data-plans-new-normal/nn5ZQ/", "country": "US", "title": "For US, limiting unlimited data plans is the new normal", "performance_score": 0, "site": "ajc.com", "participants_count": 1, "title_full": "For US, limiting unlimited data plans is the new normal | www.ajc.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T17:04:00.000+03:00", "replies_count": 0, "uuid": "2fd20d79c1e329de2179d0564716a4862930f8d4"}, "author": "Leah Becerra", "url": "http://www.ajc.com/news/news/national/us-limiting-unlimited-data-plans-new-normal/nn5ZQ/", "ord_in_thread": 0, "title": "For US, limiting unlimited data plans is the new normal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mobile providers seem to want their subscribers to cut down on data use, but the trend shows data use is still going up.\nOn Friday, Sprint announced it was going to begin \"protecting the 97%,\" referring to the vast majority of its patrons with unlimited data plans who only use a few gigabytes each month.\nThe company is placing a cap of 23 GB on its 4G network. After a Sprint subscriber reaches that point, their connection will be throttled to an aggravatingly slow speed if they're using a \"constrained\" tower — which is every tower if you live in a major metro. (Video via Sprint )\nCell phone To be fair, you can do a lot with 23 GB of data on a cellphone. And right now, according to one market research firm , the average user only racks up about 2 GB a month. But that number is going up.\n>> Read more trending stories\nNetworking company Cisco released a report estimating global growth of mobile data traffic. It said monthly data use had already grown — from 2013 to 2014 — by 69 percent to 2.5 exabytes (or about 2.5 billion gigabytes). Through 2019, data use is expected increase nearly tenfold to 24.3 EB per month.\nSo, more people are using more data on their phones — and it's going to keep going up. Which could actually be why providers keep implementing these caps.\nThere aren't stated limits for the average cellphone tower's capacity, but when that capacity gets congested — either by a large crowd being in the same spot at once, or by one individual using way more data than everyone else — the overall performance of the tower can plummet.\nT-Mobile throttles unlimited plans at 21 GB, AT&T clamps down at 22 GB, and Sprint is actually rejoining the throttling family with its 23 GB cap.\nAnother thing we should note about Sprint's new cap is for now, it will only affect you if you upgraded your plan after Oct. 16. And there's no word how the company will treat grandfathered unlimited plans.\nThis video includes images from Getty Images.\nTrending on Facebook\nHalf-eaten fish comes back to life, jumps on plate Kidnap victim uses Google to save himself Must read: Dad takes tardiness excuses to the next level Recall Alert: Mislabeled acetaminophen could lead to liver failure Woman's body hanging from fence mistaken for Halloween decoration More popular and trending stories", "external_links": ["https://www.facebook.com/CMGNationalNews", "http://www.mobidia.com/press-release/lte-network-usage-data-0", "http://www.cisco.com/c/en/us/solutions/collateral/service-provider/visual-networking-index-vni/white_paper_c11-520862.html", "http://www.youtube.com/watch?v=PQRUvp0lPmo", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/07/30/39/08/cell-phone.jpg"], "published": "2015-10-18T17:04:00.000+03:00", "crawled": "2015-10-19T05:15:00.096+03:00", "highlightTitle": ""}