{"organizations": [], "uuid": "4ad43ffbfccde90228118acd84b4870b9f0329fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fox8live.com", "main_image": "http://APMOBILE.images.worldnow.com/images/8941215_G.jpg", "site_section": "http://www.fox8live.com/", "section_title": "New Orleans News, Weather, Saints - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "url": "http://www.fox8live.com/story/30180691/new-york-city-explosion-kills-1-hurts-3-gas-leak-suspected", "country": "US", "title": "New York City explosion kills 1, hurts 3; gas leak suspected", "performance_score": 0, "site": "fox8live.com", "participants_count": 1, "title_full": "New York City explosion kills 1, hurts 3; gas leak suspected - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T11:00:00.000+03:00", "replies_count": 0, "uuid": "4ad43ffbfccde90228118acd84b4870b9f0329fe"}, "author": "cbs8", "url": "http://www.fox8live.com/story/30180691/new-york-city-explosion-kills-1-hurts-3-gas-leak-suspected", "ord_in_thread": 0, "title": "New York City explosion kills 1, hurts 3; gas leak suspected", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By JENNIFER PELTZ\nAssociated Press NEW YORK (AP) - The removal of a stove may have led to a gas leak that caused an explosion and fire that ripped through a three-story building in Brooklyn, killing a woman inside and injuring three passers-by, authorities said.\nFirefighters received a call at about 1 p.m. Saturday reporting an explosion at a building in the Borough Park neighborhood. Emergency crews found the entire front of the building blown into the street.\nGov. Andrew Cuomo ordered the state's Department of Public Service, the agency that regulates utility companies, to launch an investigation into the cause of the apparent gas blast, which he called \"the latest in a disturbing trend of incidents.\" He cited previous explosions in Harlem and the East Village.\nOfficials suspect the blast Saturday originated in an apartment on the second floor, where a tenant had recently disconnected a stove. Fire Commissioner Daniel Nigro said no one had reported smelling gas in the area.\n\"We are told that the tenant purchased a high-end stove and they were moving out of the apartment and were going to take that stove with them,\" Nigro said.\nCouncilman Brad Lander said the tenant who lived in that apartment had moved out about a week ago.\nLander said the woman who died was a tenant in her 60s who was originally from the Dominican Republic. He said the woman lived in a third-floor apartment with her daughter, who was out of town at the time.\nThe victim's body was discovered in a stairwell near the second floor, close to the apartment where the explosion started, Nigro said. Her name was not immediately released.\nA 33-year-old man and his 9-year-old son who were walking by the building when it exploded were injured, as was a 27-year-old man, authorities said. They said the three had been hit by flying debris; their injuries were considered not life-threatening.\nAuthorities are still trying to track down another person who lived in the building. Mayor Bill de Blasio said officials just wanted to confirm the person was not home at the time.\nNeighbor Harry Roth said a sign sprang off the building's storefront before \"the front of the building fell off and it started burning.\"\nShimon Fried was about five blocks away when he heard a boom.\n\"I just saw plumes of smoke coming out,\" he said. \"It was scary.\"\nThe blast rocked the largely Orthodox Jewish neighborhood in the middle of a Sabbath afternoon.\nDe Blasio, speaking on cable news station NY1, said the Sabbath could have saved lives because there are less people walking in the neighborhood.\n\"Had it been the next day it would have been a much worse situation,\" he said.\nA spokeswoman for National Grid declined to comment on the mayor's remarks but said the utility was assisting in the investigation.\nA message left at a possible phone number for the building's owner wasn't immediately returned.\nIn 2014, eight people were killed and 70 injured when two apartment buildings in East Harlem were leveled by a gas explosion. In March, an apparently illegally tapped gas line caused an explosion that killed two people, injured 19 more and destroyed three buildings in the East Village. And three construction workers were injured in August when someone lit a match while working on a gas line at a high school in the Bronx.\n\"The only common thread is natural gas and the dangers of natural gas,\" said James Leonard, the chief of department for the Fire Department.\nAssociated Press writers Michael Balsamo and Karen Matthews contributed to this report.\nCopyright 2015 The Associated Press. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-04T11:00:00.000+03:00", "crawled": "2015-10-04T12:49:27.609+03:00", "highlightTitle": ""}