{"organizations": [], "uuid": "4aeac56133eadc1591a96b5060271c7126bf4534", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.abqjournal.com", "main_image": "http://main.abqjournal.netdna-cdn.com/wp-content/plugins/journal-open-graph/img/albuquerque-journal.jpg", "site_section": "http://www.abqjournal.com/", "section_title": "Albuquerque and New Mexico News, Sports, Business and more | Albuquerque Journal News", "url": "http://www.abqjournal.com/653396/news/court-forest-maintenance-is-federal-job.html", "country": "US", "title": "Court: Forest maintenance is federal job", "performance_score": 0, "site": "abqjournal.com", "participants_count": 1, "title_full": "Court: Forest maintenance is federal job | Albuquerque Journal News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T08:05:00.000+03:00", "replies_count": 0, "uuid": "4aeac56133eadc1591a96b5060271c7126bf4534"}, "author": "Susan Montoya Bryan / The Associated Press", "url": "http://www.abqjournal.com/653396/news/court-forest-maintenance-is-federal-job.html", "ord_in_thread": 0, "title": "Court: Forest maintenance is federal job", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A federal court has struck down a state law that gave New Mexico counties the authority to remove trees and clear overgrown areas on national forest land without having to get approval from the U.S. Forest Service.\nChief U.S. District Judge Christina Armijo issued a ruling this week invalidating the state statute, saying it violated the supremacy clause of the U.S. Constitution.\n“It is well settled that, when state law conflicts with federal law, federal law pre-empts state law,” she wrote in a 66-page ruling filed Wednesday.\nHer decision came in a case spurred by an Otero County resolution that was based on the state law.\nThe county passed its resolution in 2011 and announced plans to thin tens of thousands of acres on the Lincoln National Forest to reduce the threat of wildfire. The move came as New Mexico embarked on what would be the first of two record-setting wildfire seasons.\n“Our forest has been overcrowded for too long,” County Commissioner Ronny Rardin said in a statement at the time. “We are going to show the world what an acre of forest land should look like.”\nThe U.S. Forest Service sued, saying federal law pre-empted the statute and the resolution.\nArmijo ruled that Congress – not the state or the county – has sole authority to control federal lands and that federal lawmakers have delegated that authority to the Forest Service to balance the demands of multiple uses.\nArmijo also dismissed arguments by the county and the state that the 10th Amendment reserves certain police powers to address a nuisance or threat on federal land and to protect the health, safety and welfare of New Mexico citizens.\nIt wasn’t immediately clear if the state or the county planned to appeal.\nThe state law was enacted in 2001, the year after the disastrous Cerro Grande fire burned hundreds of homes in Los Alamos, forced the evacuation of thousands of people and threatened one of the nation’s nuclear weapons laboratories.\nThe blaze – which started as a prescribed fire on federal land – was fed by dry conditions, strong winds and an overgrown forest.\nThe state statute reads that New Mexico citizens and officials had repeatedly and unsuccessfully petitioned the Forest Service to address the conditions that created a state of emergency in and surrounding national forests in New Mexico.", "external_links": [], "published": "2015-10-03T08:05:00.000+03:00", "crawled": "2015-10-03T09:46:55.059+03:00", "highlightTitle": ""}