{"organizations": [], "uuid": "f3507b8c551696268f9650ec33d249ffb3862761", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theglobeandmail.com", "main_image": "http://static.theglobeandmail.ca/1c2/sports/more-sports/article26866309.ece/ALTERNATES/w620/web-sp-hr-RyanMoore-1018.JPG", "site_section": "http://www.theglobeandmail.com/sports/?service=rss", "section_title": "The Globe and Mail - Sports", "url": "http://www.theglobeandmail.com/sports/more-sports/jockey-ryan-moore-earns-third-straight-win-at-pattison-canadian-international/article26866310/?cmpid=rss1", "country": "CA", "title": "Jockey Ryan Moore earns third straight win at Pattison Canadian International", "performance_score": 0, "site": "theglobeandmail.com", "participants_count": 1, "title_full": "Jockey Ryan Moore earns third straight win at Pattison Canadian International", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T04:23:00.000+03:00", "replies_count": 0, "uuid": "f3507b8c551696268f9650ec33d249ffb3862761"}, "author": "DAN RALPH", "url": "http://www.theglobeandmail.com/sports/more-sports/jockey-ryan-moore-earns-third-straight-win-at-pattison-canadian-international/article26866310/?cmpid=rss1", "ord_in_thread": 0, "title": "Jockey Ryan Moore earns third straight win at Pattison Canadian International", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A A \nRiding at Woodbine Racetrack brings out the best in jockey Ryan Moore. \nThe 32-year-old Englishman guided 5-to-2 favourite Cannock Chase to a 1 1/2-length victory in the $1-million Pattison Canadian International on Sunday. The victory was Moore’s third in a row in this race – he won aboard Joshua Tree in 2013 and Hillstar last year – and also rode British-bred Curvy to victory in the Grade 1 $500,000 E.P. Taylor Stakes. \nMoore became the first jockey to win three successive International races since 1958 when it became a turf event. In seven career appearances at Woodbine, Moore has three wins, two second-place finishes and a third. \n“I’ve been lucky enough to ride horses that have been laid out for the race and well prepared and the race was chosen carefully for them,” Moore said. “Yeah, things have worked out well here.” \nMoore is also the first jockey since Gary Stevens in 1998 to win the International and E.P. Taylor on the same day. \nCannock Chase became the 28th American-bred horse to win this event but the first since Marsh Side in 2008. Winning trainer Sir Michael Stoute, who didn’t attend, recorded his third International victory, winning in ‘96 with Singspiel and last year with Hillstar. \nCannock Chase won the 1 1/2-mile event in 2:29.26 on a good turf to secure the $600,000 winner’s share. \nUp With the Birds – one of four Canadian-bred horses in the race – was second ahead of Sheikhzayedroad as the British-bred rallied nicely from a terrible start that left him last in the 11-horse field. \nMoore said Cannock Chase also started poorly and after a mile the four-year-old Kentucky-bred stood 10th. But Moore had moved Cannock Chase to fourth in the straightaway and knew he had plenty of horse left coming home. \n“Once he was off the fence he travelled very powerfully around the bend and I put him into a gap,” Moore said. “As soon as we had room he quickened very well and he won easily.” \nJohn Velazquez, the Hall of Fame jockey aboard Sam-Son Farm-owned Up With the Birds, was ecstatic with the second-place finish of Canada’s 2013 horse of the year. \n“I had a perfect trip,” he said. “He tipped out and he was running so well that I thought they’re really going to have to run hard to beat him. \n“He was absolutely rolling down the lane. He ran so well.” \nSheikhzayedroad’s jockey Martin Lane explained why he was forced to go wide down the stretch. \n“I had a wall of horses in front of me going around the bend so I had to switch wide, which is never ideal,” he said. “With a bit further, we might have got second but looking at the winner that’s the best we could’ve done on the day.” \nThe remainder of the field, in order of finish, included: Kaigun; Reporting Star; Triple Threat; Danish Dynaformer; Power Ped; Second Step; Interpol; and Habibi. \nThe win was Cannock Chase’s second in six races this year and fourth in nine career starts. Bruce Raymond, the racing manager for owner Rabbah Bloodstock LLC, said he expects Cannock Chase will end his 2015 campaign a champion. \n“I would have to talk with [Sir] Michael Stoute about that but I would doubt him going,” he said. “I would think he’d be finished for the year.” \nCannock Chase paid $7.50, $4.60 and $3.40 while Up With the Birds returned $10.10 and $7.10. Sheikhzayedroad paid $6.10. \nMoore and Curvy finished the 1 1/4-mile E.P. Taylor turf race in 2:02.88. Talmada, at 10-to-1 odds, was second while Rosalind finished third.", "external_links": [], "published": "2015-10-19T04:23:00.000+03:00", "crawled": "2015-10-19T04:47:18.722+03:00", "highlightTitle": ""}