{"organizations": ["Photos Iowa City Regina", "Regina High School", "Solon"], "uuid": "ff2dc9cec2fd13c06ea1960d62eacc951e73d197", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thegazette.com", "main_image": "http://www.thegazette.com/storyimage/GA/20151015/ARTICLE/151019766/AR/0/AR-151019766.jpg", "site_section": "http://feeds.feedburner.com/~r/GazetteOnlineSports/~6/1", "section_title": "Eastern Iowa Sports News and Information from Gazette Online", "url": "http://www.thegazette.com/subject/sports/preps/football/nate-stenger-continuing-reginas-string-of-talented-quarterbacks-20151015", "country": "US", "title": "Nate Stenger continuing Regina’s string of talented quarterbacks", "performance_score": 0, "site": "thegazette.com", "participants_count": 0, "title_full": "Nate Stenger continuing Regina’s string of talented quarterbacks", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T02:09:00.000+03:00", "replies_count": 0, "uuid": "ff2dc9cec2fd13c06ea1960d62eacc951e73d197"}, "author": "", "url": "http://www.thegazette.com/subject/sports/preps/football/nate-stenger-continuing-reginas-string-of-talented-quarterbacks-20151015", "ord_in_thread": 0, "title": "Nate Stenger continuing Regina’s string of talented quarterbacks", "locations": ["Iowa City Regina", "Iowa", "Iowa City"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Drew Cook", "Regina", "Nate Stenger", "Stenger", "Susan Harman", "Nathan Stenger"], "text": "Nate Stenger continuing Regina's string of talented quarterbacks Nate Stenger continuing Regina's string of talented quarterbacks After catching passes from Drew Cook last year, Stenger has proven himself at QB Prep Football , Iowa City Regina , Iowa Prep Sports , Photos Iowa City Regina’s Nathan Stenger (8) celebrates a touchdown against Solon during the first half of a football again at Regina High School in Iowa City on Saturday, August 29, 2015. (Cliff Jette/The Gazette-KCRG TV9) Most Popular By Susan Harman, correspondent October 15, 2015 | 7:09 pm \nIOWA CITY — Regina has ridden the arm of some talented, tough and poised quarterbacks through five consecutive state championship seasons. \nTheir prodigious production and startling efficiency has helped lead the Regals into uncharted territory. \nThe scepter passed from Jack Verducci to Nate Streb to Mark Ward and finally to Drew Cook. All were first-team all-state picks. Cook, who was the most celebrated of the group, completed 67 percent of his passes for more than 5,000 yards, 51 touchdowns and just six interceptions in his two seasons as a starter. \nSo the obvious question for the Regals this season was who was next in the line of succession, and could he help his teammates keep the reign alive. \nSenior Nate Stenger, a wide receiver as a junior but a quarterback throughout the lower grades, seized the job. After a rocky first game against Solon, he’s completed 53 of 85 passes (.623) for 754 yards with no interceptions in his next six games. He’s also run for 400 yards, averaging 8.3 per carry, and nine TDs as a true dual threat. \n“He’s been fun to watch,” Regina Coach Marv Cook said. “About a year ago the light went on and his practice habits changed. He was always a hard worker, but he was practicing really smart, and he was competitive and challenging himself. \n“It’s that competitive nature that makes him such a good athlete and has helped his transition to the quarterback position.” \nThe 6-foot-3 Stenger has started at guard for two seasons on the basketball team and averaged 14 points for the state runner-up Regals. He caught and threw touchdown passes in last year’s state title game. \nHis running ability has been a key asset as defenses already have speedy Nick Phillips and rugged Justin Hunter to corral. His biggest adjustment has been learning to trust the play call and his sequence of reads. Early he locked onto Phillips, for example, at the expense of an open guy elsewhere. \n“Just trusting your teammates, and trusting the coaches,” he said. “I watched that (Solon) tape and learned from what I did. My footwork is coming along. I’m trying to get faster and more fluent with my reads.” \nIt would appear that the line of succession remains intact. Your Next Prep Football Articles", "external_links": [], "published": "2015-10-16T02:09:00.000+03:00", "crawled": "2015-10-16T21:08:16.124+03:00", "highlightTitle": ""}