{"organizations": [], "uuid": "9b6a1f27c3e1741550efb5810fca07dff217023c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wmur.com", "main_image": "http://www.wmur.com/image/view/-/35675820/highRes/2/-/maxh/630/maxw/1200/-/75xgsoz/-/Seahawks-Lions-jpg.jpg", "site_section": "http://www.wmur.com/9858832?format=rss_2.0&view=feed", "section_title": "Sports News", "url": "http://www.wmur.com/sports/seahawks-13-lions-10/35674966", "country": "US", "title": "Controversial non-call helps Seahawks seal victory", "performance_score": 0, "site": "wmur.com", "participants_count": 0, "title_full": "Controversial non-call helps Seahawks seal victory", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T19:16:00.000+03:00", "replies_count": 0, "uuid": "9b6a1f27c3e1741550efb5810fca07dff217023c"}, "author": "", "url": "http://www.wmur.com/sports/seahawks-13-lions-10/35674966", "ord_in_thread": 0, "title": "Controversial non-call helps Seahawks seal victory", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Controversial non-call helps Seahawks seal victory Seattle LB bats fumbled ball out of end zone UPDATED 12:16 PM EDT Oct 06, 2015 Photos Otto Greule Jr/Getty Images \nTwo games into Kam Chancellor's return, the Seattle Seahawks sure are glad the strong safety is back. Saints take down Cowboys 26-20 in OT \nRunning back C.J. Spiller used his speed on a wheel route to catch an 80-yard touchdown pass from quarterback Drew Brees and lift the New Orleans Saints to a 26-20 overtime victory over the Dallas Cowboys on Sunday night at the Mercedes Benz Superdome. Broncos hold off Vikings \nBrandon McManus kicked three field goals, including a 39-yarder with 1:51 remaining, and the Denver Broncos hung on to beat the Minnesota Vikings 23-20 Sunday to remain undefeated.Peyton Manning, shaking off two interceptions, led the Broncos into position for the tie-breaking score with C.J. Anderson and Ronnie Hillman also contributing key runs. Hillman had 103 yards rushing, including a 72-yard touchdown run.Denver, off to a 4-0 start for the seventh time in franchise history and the second time in the last three years, sealed the win when blitzing safety T.J. Ward ended the last-ditch possession of Minnesota (2-2) at midfield by sacking quarterback Teddy Bridgewater and forcing a fumble that linebacker Von Miller recovered. Bridgewater previously extended the drive with an 11-yard run on third-and-10.Up by a field goal at the half, the Broncos gained additional separation when Manning started the third quarter by leading the offense down the field, finishing the drive with a 1-yard touchdown pass on fourth down to wide open tight end Owen Daniels.But the Vikings came back to pull to within three points again. Facing fourth down and inches, the Vikings gave the ball to Adrian Peterson on a run up the middle. He broke through Denver's bunched-up defense at the line of scrimmage and into the clear for a 48-yard touchdown run cutting the Broncos' lead to 20-17 with 10:01 remaining.Minnesota tied it at 20-all on Blair Walsh's second field goal, a 33-yarder with 5:11 left to play that was set up by safety Harrison Smith's interception of Manning, the Denver quarterback's second pick of the game. Manning was 17 of 27 for 213 yards.Linebacker Anthony Barr stepped in front of wide receiver Andre Caldwell to intercept Manning the first time, returning it 32 yards to the Broncos' 27-yard line to set up the touchdown that pulled Minnesota to 13-10 at halftime.Bridgewater completed successive passes to wide receiver Mike Wallace, the second a 4-yarder in the end zone with 12 seconds left in the second quarter.Denver scored on the first play after Blair Walsh's 38-yard field goal try wide sailed wide left. With the ball at the Broncos' 28-yard line, Manning pitched the ball to Hillman. Daniels sprung him with a block on the edge and Hillman raced untouched down the left sideline en route to matching the fourth-longest touchdown run in Broncos' history.NOTES: Broncos LB DeMarcus Ware is the only player in the league with at least one sack in each of the first four games. … Denver is the only team in the NFL this season yet to allow a point in the first quarter. … Rookie LT Ty Sambrailo missed the game with a shoulder injury. … Minnesota was without WR Charles Johnson because of a rib injury. Also held out was S Andrew Sendejo (knee). … The Vikings were in Denver for the first time since 2007, Adrian Peterson's rookie season. Chargers beat Browns with late FG \nRookie Josh Lambo's 34-yard field goal with no time remaining lifted the San Diego Chargers past the Cleveland Browns 30-27 on Sunday.Lambo was wide right from 39 yards with two second left, but defensive back Tramon Williams was called offside, giving Lambo another chance.The Browns pulled to within 27-25 on tight end Gary Barnidge's 1-yard scoring catch with two minutes to play. Wide receiver Taylor Gabriel caught Josh McCown's pass for a 2-point conversion to tie the game, 27-27.Philip Rivers threw this third touchdown pass, a 1-yarder to tight end John Phillips, with 7:26 remaining. That gave the Chargers an eight-point lead, their biggest of the afternoon.Phillip's score was set up by a 68-yard reception from wide receiver Dontrelle Inman.Rivers completed 23 of 38 for three touchdowns and 358 yards.McCown was 32 of 41 for two touchdowns and 356 yardsTravis Coons booted his fourth field goal, this one from 40 yards, to slice the Browns' deficit to 20-19 with 10 minutes to play.The Chargers seized a 20-16 third-quarter edge when tight end Ladarius Green used his height advantage to reach over strong safety Donte Whitner for a 19-yard touchdown catch. Rivers placed the ball perfectly for Green, who is filling in for the suspended Antonio Gates. Coons converted a 33-yard field goal with six minutes remaining in the third quarter. Coons' kick gave the Browns 16-13 advantage, with the big play of the possession being a 53-yard reception by running back Isaish Crowell.The Browns ran a nifty two-minute offense toward the end of the half, with the result being Coons' 28-yard field goal, tying the game at 13-13.Lambo's 46-yard field goal with 10 minutes left in the half tied the score, 10-10. The drive featured 30 yards rushing on two carries by running back Melvin Gordon.McCown found a great match up early in the second quarter, spotting linebacker Donald Butler on running back Duke Johnson Jr. Johnson got at least a step on Butler and McCown hit Johnson with a perfect, arching pass in the back of the end zone. Johnson just did get two feet in and it was good for a 10-7 Browns cushion.The Chargers took a 7-3 lead late in the first quarter when Rivers clicked with wide receiver Keenan Allen on a 28-yard scoring strike. Allen, in single coverage with cornerback Pierre Desire, made a diving catch near the goal line for the score. It was Allen's team-high third touchdown reception to cap the 80-yard drive.The Browns struck first when Coons kicked a 36-yard field goal with 4:12 left in the first quarter.NOTES: Injuries forced the Chargers' offensive line to be without three starters: LT King Dunlap (concussion), LG Orlando Franklin (ankle) and C Chris Watt. ... WR Malcom Floyd (concussion) left in the first quarter and didn't return. ... WR/KR Jacoby Jones (ankle) missed his third straight game. ... CB Brandon Flowers (concussion) didn't play the fourth quarter ... Browns CB Joe Haden (ribs) was idle. ... WR Brian Hardline (rib) left if the first quarter and didn't return. ... QB Johnny Manziel was a 28th round pick of the San Diego Padres. Cutler drives Bears past Raiders \nThey were already starting to think it was the \"same old Jay\" on Sunday at Soldier Field when he threw a fourth-quarter interception that the Oakland Raiders turned into a go-ahead field goal against Cutler's Chicago Bears.But, despite the after-effects of a hamstring injury that kept him out of a game last week, Cutler instead played the hero instead of the goat. He drove the Bears 48 yards in the last two minutes, Robbie Gould kicked his third field goal of the game, a 49-yarder with two seconds remaining, and the Bears beat the Raiders, 22-20, for their first victory of the season.Cutler deferred credit to a jury-rigged offensive line, juggled because of injuries, but the difference in the game was the patience he showed — maybe because the hamstring forced him to — in completing 28 of 43 passes, including 5 of 8 on the winning drive.\"There were a lot of moving parts up there, and those guys held their own,\" said Cutler, who acknowledged that he was limited \"a little bit\" physically by the hamstring and deliberately kept himself from trying to scramble out of the pocket.\"He's a tough son of a bug,\" Chicago coach John Fox said of his quarterback. \"He's got an injury that some lesser guys might not have been out there.\"Chicago started the game with a backup replacing injured left tackle Jermon Bushrod and then had to juggle further when center Will Montgomery suffered an apparent broken leg on the third play from scrimmage. As a result, left guard Matt Slauson slid into the center spot and that may have been at least partially responsible for a fumbled snap that led to an Oakland touchdown.But staying in the pocket may prove the best strategy for Cutler, even when his hamstring is fully healthy, because it reduces the margin for error.Instead, it appeared it was the Raiders who made the most grievous error by settling for a field goal with 2:05 remaining to take a 20-19 lead and effect the sixth lead change of the game, rather than play aggressively for a touchdown that might have made a Chicago comeback more difficult.After they got to the Bears' 33-yard line with more than four minutes remaining, Oakland did not throw another pass, instead calling four consecutive running plays before Sebastian Janikowski kicked a 41-yard field goal.\"They were pretty conservative,\" Cutler said.Oakland coach Jack Del Rio defended the play calling, saying, \"I think we felt like we were moving it pretty good and thought we had a better shot to move the sticks on that third-and-two.\"One problem for the Raiders was that, by that point in the game, Del Rio already had benched his leading rusher, Latavius Murray, because of a lost fumble and two dropped passes, one of which Murray bounced into an interception.After the Janikowski kick, the Bears kick-started their winning drive with Cutler's fourth down completion to tight end Martellus Bennett, who caught 11 passes, second highest total of his career, for 83 yards.With the Bears essentially conceding the sideline passes to Cutler — allowing not only completions but clock stappages — the Bears had plenty of time to work downfield. Cutler found Matt Forte for seven yards and then Marquess Wilson for six on 3rd-and-3. After a downfield shot fell incomplete, Eddie Royal made a nifty sideline catch for 12 yards and then Wilson, who earlier on the drive dropped a pass, made a fingertip grab for nine.That was pretty much all Chicago needed and, after running Forte into the line for two, the Bears called on Gould — who, to that point had been the difference in the game due to a blocked extra point.Gould, whose other field goals were from 19 and 54 yards, nailed the winning kick with plenty to spare.\"It was awesome when we were celebrating with two seconds left on the clock,\" Gould said. \"Those are the type of wins you want to see, and usually, those type of wins catapult a team and give them a lot of confidence for the next week.\"There were \"a couple of areas that will stand out,\" Del Rio said, and the most that gnawed on him most clearly was his team's third-down defense. The Bears, who had converted only 16 of 42 third downs into first downs in their three losses, were 10 for 17 in this game.\"They played well, and we didn't play as well as we're capable of,\" Del Rio said. \"These things happen. They get paid, too.\"NOTES: QB Jay Cutler returned to the lineup after missing one game but the Bears played without three injured regulars including No. 1 wideout Alshon Jeffery. Also missing were OLT Jermon Bushrod and NT Jeremiah Ratliff. … The Bears lost C Will Montgomery with an ankle injury on the third play of the game, causing shuffling on the line. LG Matt Slauson moved to center and Patrick Omameh went in at left guard. … Oakland WR Michael Crabtree left the game with an ankle injury in the second quarter but returned. … Bears FS Antrell Rolle was injured (ankle) on the first play of the third quarter and did not return. More \nChancellor, whose holdout over a contract dispute led him to miss the season's first two games, came up with a win-preserving play Monday night. \nDetroit Lions wide receiver Calvin Johnson was approaching the end zone for a go-ahead touchdown in the final minutes, but Chancellor punched the ball away, saving the Seahawks' 13-10 victory in a defensive battle at CenturyLink Field. \nTrailing by three points with 6:23 remaining, the Lions drove from their own 9-yard line to the Seattle 11. On third-and-1, quarterback Matthew Stafford hit Johnson with a short pass on the left side. Just as Johnson was reaching for the goal line while being tackled by free safety Earl Thomas, Chancellor knocked the ball away from the receiver and through the end zone, resulting in a touchback. \n\"It's exactly what this team stands for,\" Chancellor said. \"We fight to the end. We fight for each other because we're brothers. ... We have faith in each other and faith in our ability.\" \nThe big play was not without controversy, which has been known to occur during \"Monday Night Football\" games in Seattle. On Chancellor's strip, Seahawks linebacker K.J. Wright knocked the ball out of the back of the end zone. \nAccording to the NFL rulebook, an illegal bat occurs if \"any player bats or punches a loose ball (that has touched the ground) in any direction, if it is in either end zone.\" Had the penalty been called, Detroit would have got the ball back inside the 1-yard line. \nLions coach Jim Caldwell discussed the issue with the officials, but the non-call stood, and the Seahawks took over on offense to close out the game. \n\"I know that the play at the end was a questionable play because it was a batted ball, but that goes to upstairs. So, there's nothing you can do about it,\" Caldwell said. \"What can you do? You know what I mean? You're not going to cry about it, that's for sure. ... We lost. No matter how we lost, we lost.\" \nSeattle coach Pete Carroll of the play, \"We were fortunate.\" \nNFL head of officials Dean Blandino acknowledged that the officials blew the call, saying that the back judge felt Wright inadvertently touched the ball. \nThe Seahawks' defense held the Lions' offense to 256 yards and three points but didn't force a turnover until Chancellor's game-saving play. \n\"We're one of the best defenses to ever play the game,\" Seattle defensive end Michael Bennett said. \"We're complete with Kam back, and we just continue to do what we always do: give up not a lot of points and not give up many yards.\" \nThe Detroit defense also shined. The Lions forced two fumbles, had four sacks and scored on a 27-yard fumble return by defensive tackle Caraun Reid. \nSeattle (2-2) managed 345 total yards. \n\"I think our defense did a tremendous job, just in terms of (getting turnovers) for us,\" Caldwell said. \"Giving us an opportunity to get the ball back. They had some very important stops that had them kicking field goals instead of scoring touchdowns. A lot of outstanding play from the guys up front.\" \nSeattle quarterback Russell Wilson completed 20 of 26 passes for 287 yards and a touchdown. He added 40 yards on 10 rushes but fumbled twice. \n\"Those were my fault,\" Wilson said. \"Those are on me. It's something we can fix.\" \nSeahawks rookie running back Thomas Rawls made his first career start in place of Marshawn Lynch (hamstring), and he rushed 17 times for 48 yards. \n\"It was exciting,\" Rawls said. \"But like I always said, even if I'm not the starter, whenever my number's called, I'm always going to be prepared. That's one thing I pride myself on. It's not about who's out there. It's the expectation for the position. If you're a running back in the backfield on the Seahawks' roster, you should go out there and produce.\" \nStafford finished 24-for-35 for 203 yards. \nThe Lions (0-4) got their lone offensive score on a 41-yard field goal by kicker Matt Prater in the second quarter. It was the only offensive drive that resulted in points against the Seahawks' defense in the past two games. \nEarly in the second quarter, Wilson sparked the Seahawks' offense with a scramble to avoid a sack on third-and-12, running from pressure and throwing a 34-yard completion to wide receiver Jermaine Kearse. On the next play, Wilson hit wide receiver Doug Baldwin over the middle for a 24-yard touchdown to get the Seahawks on the scoreboard. \nThe score, which capped a six-play, 67-yard drive, was the first offensive touchdown in the first half by Seattle this season. \nPrater's second-quarter field goal ended a streak of 13 consecutive drives against the Seahawks' defense that ended in punts, going back to Seattle's game last week against the Chicago Bears. \nSeattle countered with a 51-yard field goal by kicker Steven Hauschka with one minute remaining in the second quarter to take a 10-3 lead into halftime. Hauschka added a 52-yard field goal in third quarter. \nNOTES: Seattle RB Marshawn Lynch, who injured a hamstring last week against Chicago, was inactive Monday. It was the first time Lynch was ruled inactive for a game since he came to Seattle in 2010. He was shown on the television broadcast watching the game from a suite. ... Detroit RB Joique Bell (ankle) and TE Brandon Pettigrew (hamstring) were ruled out prior to the game. Rookie Ameer Abdullah replaced Bell in the starting lineup. ... Lions G Larry Warford missed the game because of an ankle injury. Starting LG Manny Ramirez moved to the right side to replace Warford, and rookie Laken Tomlinson started at left guard. ... Seattle RB Fred Jackson (ankle), DE Michael Bennett, CB Marcus Burley (thumb) and WR Ricardo Lockette (shortness of breath) left the game, as did Detroit TE Eric Ebron (knee) and DT Haloti Ngata (calf).", "external_links": [], "published": "2015-10-06T19:16:00.000+03:00", "crawled": "2015-10-06T19:36:29.377+03:00", "highlightTitle": ""}