{"organizations": [], "uuid": "3ab8304c72b7a690343cd2eacb0c54f98136ec51", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.timesunion.com", "main_image": "http://ww4.hdnux.com/photos/41/46/60/8809515/3/rawImage.jpg", "site_section": "http://timesunion.com//home/collectionRss/Homepage-HCat-Sports-6377.php", "section_title": "Sports news", "url": "http://www.timesunion.com/sports/article/Okposo-helps-Islanders-hand-Sharks-their-1st-6576058.php", "country": "US", "title": "Okposo helps Islanders hand Sharks their 1st loss, 6-3", "performance_score": 0, "site": "timesunion.com", "participants_count": 1, "title_full": "Okposo helps Islanders hand Sharks their 1st loss, 6-3 - Times Union", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T01:57:00.000+03:00", "replies_count": 0, "uuid": "3ab8304c72b7a690343cd2eacb0c54f98136ec51"}, "author": "timesunion.com", "url": "http://www.timesunion.com/sports/article/Okposo-helps-Islanders-hand-Sharks-their-1st-6576058.php", "ord_in_thread": 0, "title": "Okposo helps Islanders hand Sharks their 1st loss, 6-3", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: Mary Altaffer, AP Image 1 of / 8   8 San Jose Sharks goalie Alex Stalock (32) defends the net against a penalty shot by New York Islanders center Mikhail Grabovski (84) during the first period of an NHL hockey game Saturday, Oct. 17, 2015 in New York. San Jose Sharks goalie Alex Stalock (32) defends the net against a penalty shot by New York Islanders center Mikhail Grabovski (84) during the first period of an NHL hockey game Saturday, Oct. 17, 2015 in ... more Photo: Mary Altaffer, AP Image 2 of 8 San Jose Sharks center Tomas Hertl, right, takes a shot at goal past New York Islanders center John Tavares during the first period of an NHL hockey game, Saturday, Oct. 17, 2015 in New York. San Jose Sharks center Tomas Hertl, right, takes a shot at goal past New York Islanders center John Tavares during the first period of an NHL hockey game, Saturday, Oct. 17, 2015 in New York. Photo: Mary Altaffer, AP Image 3 of 8 New York Islanders goalie Jaroslav Halak (41) and defenseman Nick Leddy (2) defend the net against a shot by San Jose Sharks center Joe Thornton (19) during the first period of an NHL hockey game Saturday, Oct. 17, 2015 in New York. New York Islanders goalie Jaroslav Halak (41) and defenseman Nick Leddy (2) defend the net against a shot by San Jose Sharks center Joe Thornton (19) during the first period of an NHL hockey game Saturday, ... more Photo: Mary Altaffer, AP Image 4 of 8 New York Islanders left wing Josh Bailey (12) celebrates with his teammates after scoring a goal during the second period of an NHL hockey game against the San Jose Sharks, Saturday, Oct. 17, 2015 in New York. New York Islanders left wing Josh Bailey (12) celebrates with his teammates after scoring a goal during the second period of an NHL hockey game against the San Jose Sharks, Saturday, Oct. 17, 2015 in New York. Photo: Mary Altaffer, AP Image 5 of 8 New York Islanders left wing Josh Bailey (12) scores a goal past San Jose Sharks center Joe Thornton (19) during the second period of an NHL hockey game, Saturday, Oct. 17, 2015 in New York. New York Islanders left wing Josh Bailey (12) scores a goal past San Jose Sharks center Joe Thornton (19) during the second period of an NHL hockey game, Saturday, Oct. 17, 2015 in New York. Photo: Mary Altaffer, AP Image 6 of 8 New York Islanders goalie Jaroslav Halak (41) reacts as San Jose Sharks right wing Joel Ward (42) celebrates with his teammates after scoring a goal during the second period of an NHL hockey game, Saturday, Oct. 17, 2015 in New York. New York Islanders goalie Jaroslav Halak (41) reacts as San Jose Sharks right wing Joel Ward (42) celebrates with his teammates after scoring a goal during the second period of an NHL hockey game, Saturday, ... more Photo: Mary Altaffer, AP Image 7 of 8 San Jose Sharks center Joe Pavelski (8) scores a goal past New York Islanders goalie Jaroslav Halak (41) and defenseman Nick Leddy (2) during the first period of an NHL hockey game Saturday, Oct. 17, 2015 in New York. San Jose Sharks center Joe Pavelski (8) scores a goal past New York Islanders goalie Jaroslav Halak (41) and defenseman Nick Leddy (2) during the first period of an NHL hockey game Saturday, Oct. 17, 2015 in ... more Photo: Mary Altaffer, AP Image 8 of 8 Okposo helps Islanders hand Sharks their 1st loss, 6-3 1  /  8 Back to Gallery NEW YORK (AP) — Kyle Okposo scored the tiebreaking goal early in the third period and added two assists as the New York Islanders beat San Jose 6-3 Saturday night, handing the Sharks their first loss of the season.\nJohnny Boychuk , Anders Lee , Josh Bailey , Brock Nelson and Frans Nielsen also scored to help the Islanders win their third straight — all at their new Brooklyn home. Jaroslav Halak made his season debut after missing the first four games due to an undisclosed upper body injury and finished with 22 saves.\nJoe Pavelski , Nikolay Goldobin and Joel Ward scored for San Jose, which gave uup just two goals while opening the season 4-0-0. Alex Stalock stopped 28 shots in his first start of the season in place of Martin Jones .\nJustin Braun and Joe Thornton each had two assists for the Sharks.\nMikhail Grabovski had a penalty shot for the Islanders late in the first period, but his attempt was stopped by Stalock.\nOn the go-ahead goal, Okposo got the rebound of his own shot behind the net, skated around Sharks defender Brenden Dillon and beat Stalock to put the Islanders up for good with his second of the season at 4:18 of the third.\nNelson snapped in an insurance goal with 8:50 left and Nielsen added an empty-netter — his 100th goal and 300th point of his career — with just under 3 minutes to go.\nPavelski scored with just under 7 minutes remaining in the opening period to give the Sharks a 1-0 lead with their fifth first-period goal in five games this season.\nThe Islanders challenged the play for goalie interference, as Pavelski made incidental contact with Halak, but the goal stood after a video review.\nThe teams then combined for five goals in the second, with the Islanders tying it and the Sharks going ahead until Bailey's tip-in evened it for the final time with 6:02 to go.\nBoychuk's shot off the right post tied it 1-1 just 21 seconds into the second. However, Goldobin struck for his first NHL goal just 20 seconds later to put the Sharks back ahead.\nThe Islanders answered on the power play just 1:46 later when Lee got his second goal of the season. Stalock was initially struck in the mask by Ryan Strome's slap shot and appeared to attempt to take his headgear off to get a stoppage in play. The puck fell behind the net, and Lee scooped up the rebound, banking it off the goalie.\nAfter a short delay, the officials upheld the ruling on the ice of a goal.\nWard got his first goal as a Shark at 9:20, but Bailey's redirection on Okposo's shot just 4:38 later tied it 3-3.\nNOTES: Halak became the third Islanders goalie to start a game this season. Thomas Greiss was 2-0-1 in his three starts, and Jean-Francois Berube started last Saturday's loss at Chicago. ... Islanders D Thomas Hickey (hand) made his season debut and logged 14:51 of ice time. ... San Jose D Dylan DeMelo made his NHL debut, replacing Paul Martin , who was sidelined with a lower-body injury. ... The Sharks wrap up their four-game East Coast road trip Monday against the Rangers at Madison Square Garden.", "external_links": [], "published": "2015-10-18T01:57:00.000+03:00", "crawled": "2015-10-18T06:29:39.000+03:00", "highlightTitle": ""}