{"organizations": [], "uuid": "3dfef0a37b64f391c16d9a1c377fc087c81c7f3f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "nypost.com", "main_image": "https://thenypost.files.wordpress.com/2015/10/fisher3.jpg", "site_section": "http://nypost.com/sports/feed/", "section_title": "| Sports | New York Post", "url": "http://nypost.com/2015/10/08/derek-fisher-in-damage-control-mode-after-matt-barnes-attack/", "country": "", "title": "How Derek Fisher explained love triangle fight to Knicks players", "performance_score": 0, "site": "nypost.com", "participants_count": 1, "title_full": "How Derek Fisher explained love triangle fight to Knicks players | New York Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T07:07:00.000+03:00", "replies_count": 0, "uuid": "3dfef0a37b64f391c16d9a1c377fc087c81c7f3f"}, "author": "Marc Berman", "url": "http://nypost.com/2015/10/08/derek-fisher-in-damage-control-mode-after-matt-barnes-attack/", "ord_in_thread": 0, "title": "How Derek Fisher explained love triangle fight to Knicks players", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The ball had yet to be tipped off for the first preseason game Wednesday night when the Knicks again were starring in their annual circus of dysfunction.\nCoach Derek Fisher needed to address the team before beating Brazilian powerhouse Bauru 100-81 at the Garden in the preseason opener, reminding the players he is still committed to them despite The Post’s report on his love-triangle skirmish with Grizzlies forward Matt Barnes in Los Angeles on Saturday night.\nFisher missed Monday’s practice for what the team classified as “personal reasons,’’ but he had flown to LA on Saturday afternoon to see his kids and new girlfriend, Barnes’ estranged wife, Gloria Govan.\nThe Post reported Barnes attacked Fisher in the back yard of Govan’s home Saturday night.\nThe Knicks insist Fisher missed practice because he had equipment trouble on his flight Sunday night. Associate coach Kurt Rambis ran Monday’s practice.\nFisher’s turbulent personal life came to light last spring when he filed for divorce from his wife of 10 years , Candace. On Saturday, with just one day off between practices, Fisher flew to LA to see his kids and his girlfriend.\nIn his pregame press conference, Fisher revealed he had spoken to the team “to make sure … if they’re asked about it, they heard from me directly about my state of mind and how present I am,’’ Fisher said.\n“I’ve been through a lot in life. Sometimes we go through things we can’t or can control. I’m here. I’m focused. It’s not something that’s going to take me away from what we’re trying to do.”\nLast season, Fisher’s kids lived with him and his wife in New York. A Knicks spokesman said the franchise is in full support of Fisher.\n“It kind of caught everybody off guard,’’ Carmelo Anthony said of Fisher’s talk. “Nobody really knew what was going on. As a team, it was amongst us to let him deal with his own personal issues. Nowadays it’s a fine line between private lives and our day job. It’s starting to intertwine. You try to compartmentalize the personal stuff.’’\nThe NBA said it was too early to comment, but it is looking into whether Barnes will be disciplined. The Grizzlies also released a statement saying it was gathering information on the incident.\n“I don’t want to get into why I missed practice,’’ Fisher said. “I guess I’ll cover that at some point. You guys know my choice six, seven months ago in terms of my family and where my kids live. The guys are the ones who ultimately know who I am and what I’m about. Players are smart. They’re very acute. If guys feel I’m not here and not focused, they’ll find that out. At this point I don’t think that’s an issue.’’\nFisher is in the second year of a five-year deal. Phil Jackson, who handpicked his former Laker point guard, has often said he’s happy to have a young coach to teach the triangle who would be here for a while, even after he’s gone.\nNevertheless, Fisher, entering the preseason, made a remark, perhaps suggesting he won’t finish his contract if he doesn’t have success. Fisher guided the Knicks to a 17-65 record as a rookie. He has the worst winning percentage in team history.\n“Whether or not I keep the job or don’t keep the job, it has to be done in a way that I see fit,’’ Fisher said. “You can’t coach a team based on what everybody else thinks you should be doing.’’\nFisher was the one who asked Jackson for more input this season. Jackson went on at length how he’ll be more supportive of the coaching staff after spending last year more detached to allow Fisher space. In light of Fisher’s personal issues, Jackson’s support likely will be well received.\nThe Knicks travel to Memphis on Jan. 16, and face the Grizzlies at the Garden on Feb. 5.\nShare this: Facebook Twitter Google Whatsapp Email Filed under derek fisher ,  matt barnes ,  new york knicks ,  phil jackson", "external_links": [], "published": "2015-10-08T07:07:00.000+03:00", "crawled": "2015-10-08T19:28:39.696+03:00", "highlightTitle": ""}