{"organizations": [], "uuid": "e6f32a11da0786dfd7e925a5942dcc12f70ea205", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sltrib.com", "main_image": "http://www.sltrib.com/csp/mediapool/sites/dt.common.streams.StreamServer.cls?STREAMOID=ddF3QnlE9UWV$uVxzF3qms$daE2N3K4ZzOUsqbU5sYtanLG6FrBmH6gj14vsDU9qWCsjLu883Ygn4B49Lvm9bPe2QeMKQdVeZmXF$9l$4uCZ8QDXhaHEp3rvzXRJFdy0KqPHLoMevcTLo3h8xh70Y6N_U_CryOsw6FTOdKL_jpQ-&CONTENTTYPE=image/jpeg", "site_section": "http://sltrib.com//csp/cms/sites/sltrib/RSS/rss.csp?cat=Sports", "section_title": "Sports - The Salt Lake Tribune", "url": "http://www.sltrib.com/sports/3096366-155/world-series-2010-trade-helped-set", "country": "US", "title": "World Series: 2010 trade helped set foundation for Royals' success", "performance_score": 0, "site": "sltrib.com", "participants_count": 1, "title_full": "World Series: 2010 trade helped set foundation for Royals' success | The Salt Lake Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T03:00:00.000+03:00", "replies_count": 0, "uuid": "e6f32a11da0786dfd7e925a5942dcc12f70ea205"}, "author": "", "url": "http://www.sltrib.com/sports/3096366-155/world-series-2010-trade-helped-set", "ord_in_thread": 0, "title": "World Series: 2010 trade helped set foundation for Royals' success", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kansas City, Mo. • The groundwork for back-to-back World Series runs by the Kansas City Royals began on a cold December day in 2010 when they traded perhaps the game's best pitcher.\nBack then, the Royals were devoid of talent, going nowhere and doing it slowly. So general manager Dayton Moore packed off Zack Greinke to Milwaukee, swapping the Cy Young candidate for a quartet of prospects he hoped would help lead a renaissance in Kansas City.\nTwo of them were pitchers, Jeremy Jeffress and Jake Odorizzi.\nThe other two? Lorenzo Cain and Alcides Escobar.\nFive years later, both are All-Stars. Cain has grown into a .300 hitter and one of the game's best center fielders. Escobar has become such a slick-fielding shortstop that the question is not whether he will capture a Gold Glove but how many.\n  Both of them are MVPs of the AL Championship Series, too. Cain won the award a year ago. Escobar nabbed his Friday night when he helped Kansas City beat the Toronto Blue Jays 4-3 in Game 6 to earn the club's second straight trip to the Fall Classic.\n\"That's pretty good,\" said Hall of Famer George Brett, now a special assistant in the Royals front office, who has helped tutor both players the past few spring trainings.\nBrett was watching from a suite in Kauffman Stadium on Friday night, and someone asked him who he thought would be MVP. Before they even announced his name, Brett replied: \"Escobar is going to win. He stood head and shoulders above everybody else.\"\nIndeed, Escobar set a postseason record by getting a leadoff hit in the first four games of a series. He finished 11 for 23 against the Blue Jays, joining Dustin Pedroia of the Red Sox as the only hitters with at least 10 hits and five RBIs from the leadoff spot in LCS history.\n\"For me, it's a surprise,\" Escobar said. \"I know I'm playing really good and my team is playing really good. ... And when I heard the news, I was so happy for that.\"\nRoyals manager Ned Yost wasn't surprised. After all, he remembers watching Cain and Escobar come up through the Brewers system when he was managing the club in Milwaukee.\n\"I used to bring Esky to big league spring training when he was in A-ball because I used to love to watch him play,\" Yost said. \"For him to get the MVP this year is very satisfying to me. I have always known he was an MVP-type of player in these types of situations.\"\nIf he didn't win the award, it could have easily gone to Cain again.", "external_links": [], "published": "2015-10-24T03:00:00.000+03:00", "crawled": "2015-10-25T18:53:08.568+02:00", "highlightTitle": ""}