{"organizations": [], "uuid": "6346b1ea06eb05bbbc53fa1021951a5f24135673", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.miamiherald.com", "main_image": "http://www.miamiherald.com/news/state/florida/p1g00t/picture37741047/ALTERNATES/LANDSCAPE_1140/el%20faro", "site_section": "http://www.miamiherald.com/?widgetName=rssfeed&widgetContentId=712015&getXmlFeed=true", "section_title": "Breaking News, Sports, Weather & More | MiamiHerald.com &", "url": "http://www.miamiherald.com/news/state/florida/article37739610.html", "country": "US", "title": "Coast Guard finds large field of debris in search for lost ship, El Faro", "performance_score": 0, "site": "miamiherald.com", "participants_count": 1, "title_full": "Coast Guard finds large field of debris in search for lost ship, El Faro", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T01:12:00.000+03:00", "replies_count": 0, "uuid": "6346b1ea06eb05bbbc53fa1021951a5f24135673"}, "author": "Daniel Chang \ndchang@miamiherald.com", "url": "http://www.miamiherald.com/news/state/florida/article37739610.html", "ord_in_thread": 0, "title": "Coast Guard finds large field of debris in search for lost ship, El Faro", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Coast Guard finds large field of debris in search for lost ship, El Faro \nCargo ship with 33-member crew went missing late on Oct. 1 \nShip likely sailed into path of Hurricane Joaquin \nCoast Guard found wood, cargo, ship fenders near Bahamas Families gather at the Seafarers Union Hall Sunday, Oct. 4, 2015, in Jacksonville to wait for news on the crew of 33 aboard the missing cargo ship El Faro. The ship has not been heard from since it lost power and was taking on water in seas churned up by Hurricane Joaquin. Bruce Lipsky AP Family, union and company officials wait outside the Seafarer's International Union hall, Sunday, Oct. 4, 2015, in Jacksonville as an intensive search resumed Sunday in the southeastern Bahamas for a U.S. cargo ship with 33 people on board. The ship has not been heard from since it lost power and was taking on water as it was battered in fierce seas churned up by Hurricane Joaquin. Jason Dearen AP Petty Officer 1st Class Antonio Lockhart, watchstander at Coast Guard 7th District Command Center, updates search information regarding the missing cargo ship El Faro at the Coast Guard 7th District Command Center in Miami, Saturday, Oct. 3, 2015. The ship was heading from Jacksonville to San Juan, Puerto Rico when it was battered by waves. Petty Officer 2nd Class Jon-Paul AP Rear Adm. Scott Buschman, commander of the Coast Guard 7th District, receives an update brief for the missing cargo ship El Faro at the Coast Guard 7th District in Miami, Saturday, Oct. 3, 2015. The ship was heading from Jacksonville to San Juan, Puerto Rico when it was battered by waves. Petty Officer 2nd Class Jon-Paul AP 1 of 4 Order Reprint of this Story \nIn its search for the El Faro, a missing cargo ship with 33 people aboard that sailed into the path of Hurricane Joaquin last week, the U.S. Coast Guard reported finding a large field of debris about 100 miles northeast of Samana Cay in the southeastern Bahamas on Sunday. \nThe ship has been missing since its crew, which includes 28 Americans, sent a distress signal on Thursday from an area near Crooked Island — in the same southeastern area of the Bahamas where Joaquin passed as a slow-moving Category 4 storm that destroyed homes and flooded roads over the weekend . \nChief Petty Officer Bobby Nash of the U.S. Coast Guard said search crews, including a C-130 cargo plane, a helicopter and numerous ships, found debris including Styrofoam, wood, cargo and ship fenders across an area measuring about 225 square miles. #BreakingNews @USCGSoutheast C-130 just lands, reports 225 SqMi debris field of styrofoam, wood, cargo, other items. pic.twitter.com/4us2EP4L4C &mdash; USCGSoutheast (@USCGSoutheast) October 4, 2015 \nThough the Coast Guard has not yet definitively linked the debris to the El Faro, Nash said the finding was “pretty significant for us.” \n“At this point it's too early to say that it definitely belongs to that ship,” Nash said. But, he added, “it is consistent with things that look like that type of vessel.” \nNash said the Coast Guard is conducting other search and rescue operations in the area, but none for a ship such as El Faro, a 790-foot container ship that departed from Jacksonville on Tuesday when Joaquin was still a tropical storm. \nThe American-flagged El Faro, which means The Lighthouse in Spanish, was headed to Puerto Rico. Aboard the ship was a crew of 28 Americans and five from Poland \nJoaquin developed into a Category 4 storm with sustained winds of at least 130 mph beginning Thursday afternoon through Friday afternoon. The storm lost some punch before regaining Category 4 wind speeds on Saturday morning through about dawn on Sunday. \nThe storm swept across a large area of the Bahamas, and its eye passed over Samana Cay in the southeast portion of the island chain. \nNash said Coast Guard crews have found other items in their search. A total of seven vessels and aircraft have been searching for the El Faro, including one salvage tug from TOTE Maritime Puerto Rico, which owns the ship. \nThe search began in the last known location of the El Faro near Crooked Island, which is about 270 miles southeast of Nassau. \nAt this point, it's too early to say that it definitely belongs to that ship. \nChief Petty Officer Bobby Nash of the U.S. Coast Guard \nThe crew of the El Faro sent a Mayday call at about 7:30 a.m. Thursday as the ship lost propulsion near Crooked Island. A satellite report sent by the crew said the ship had taken on water and was listing at a 15-degree angle. \nAt around 7:30 p.m. Saturday, the Coast Guard announced that it had located a life ring belonging to the ship — but still no sign of the ship itself. &mdash; USCGSoutheast (@USCGSoutheast) October 4, 2015 \nCoast Guard Petty Ofc. Jon-Paul Rios said the life ring discovery shows that search crews are in the right vicinity, and it could be that the life ring simply blew off the ship during the storm. \nThe life ring was found 70 miles from the last known location of the ship. \nShortly before noon on Sunday, the Coast Guard reported that crews had found multiple items in the water, though they were not definitively linked to the El Faro. Search crews also spotted an oil sheen in various spots. \nTim Nolan, president of TOTE Maritime Puerto Rico, issued a statement noting that the company was working closely with the search and rescue effort led by the Coast Guard. Related content", "external_links": [], "published": "2015-10-05T01:12:00.000+03:00", "crawled": "2015-10-05T03:56:09.216+03:00", "highlightTitle": ""}