{"organizations": [], "uuid": "22844811009b2c411939b62a6b888af99cbb0ee8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/golf", "section_title": "Golf News, Leaderboard, Schedule, Photos, Videos - MSN Sports", "url": "http://www.msn.com/en-us/sports/golf/tour-confidential-is-the-presidents-cup-gaining-ground-on-the-ryder-cup/ar-AAfmWWK", "country": "US", "title": "Tour Confidential: Is the Presidents Cup Gaining Ground on the Ryder Cup?", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "Tour Confidential: Is the Presidents Cup Gaining Ground on the Ryder Cup?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "22844811009b2c411939b62a6b888af99cbb0ee8"}, "author": "Golf.com Staff", "url": "http://www.msn.com/en-us/sports/golf/tour-confidential-is-the-presidents-cup-gaining-ground-on-the-ryder-cup/ar-AAfmWWK", "ord_in_thread": 0, "title": "Tour Confidential: Is the Presidents Cup Gaining Ground on the Ryder Cup?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tour Confidential: Is the Presidents Cup Gaining Ground on the Ryder Cup? Golf 1 day ago Golf.com Staff © Golf\nEvery Sunday night, GOLF.com conducts an e-mail roundtable with writers from Sports Illustrated and Golf Magazine. Check in every week for the unfiltered opinions of our writers and editors and join the conversation in the comments section below.\nAdChoices 1. The Americans won the Presidents Cup for the sixth straight time but by a narrow margin. Did the closest result in more than a decade give the event more credibility?\nMichael Bamberger, senior writer, Sports Illustrated: Oh, for sure, and playing for fewer points made the difference, in addition to the Americans playing such a long-haul road game. I am way more interested in the the event than I used to be in part because there now seems to be a measure of antipathy that had not been there.\nJoe Passov, senior editor, Golf Magazine ( @joepassov ) : When a competition actually becomes competitive, it's clearly more compelling, and definitely more credible. Credit Nick Price and Tim Finchem for hammering out a compromise format that helped inject some spice and intrigue into this event.\nJosh Sens, contributing writer, GOLF Magazine : ( @JoshSens ): If it had been the Ryder Cup, Sunday singles would have been riveting. But in this country, at least, it's still an event of tepid interest. American fans only really get worked up about a sporting event when American dominance is threatened. Call it the Olympic basketball rule. Or the Ryder Cup rule, for that matter.\nCameron Morfit, senior writer, GOLF Magazine ( @CameronMorfit ): The close result helps the event, no doubt, given where it had been in recent years. It was a blast watching all that crazy 18th-hole drama between Holmes and Hideki, Bubba and Jaidee, Kirk and Lahiri , and finally Haas and Bae, even though it was past my bedtime.\nMark Godich, senior editor, Sports Illustrated ( @MarkGodich ): It was great theater, no doubt about it. I'd go so far as to say it even had a Ryder Cup feel to it. And I can't help but think that the intensity of the matches will serve the Americans well next year at Hazeltine.\nGary Van Sickle, senior writer, Sports Illustrated ( @GaryVanSickle ): It proved the Internationals can win. They coulda-shoulda won this one with Jason Day a nonfactor. No reason not to be a good show every two years.\nJeff Ritter, senior editor, SI Golf Group ( @Jeff_Ritter ): The tight finish and intensity on both sides helped bolster this event's status as a serious competition and not a hit-and-chuckle exhibition. It may never match the Ryder Cup, but the Prez had itself a week to build on.\n2. Some players stole the show at the Presidents Cup while others fizzled. Who emerged as your MVP?\nBAMBERGER: Grace! The most underrated player in all of golfdom. Could have won a U.S. Open if he could take back one hole, and maybe someday he will.\nPASSOV: All credit to (Hawaii) 5-0 Branden Grace, but Man of the Match goes to Phil Mickelson. Not only did the questionable captain's pick post a 3-0-1 record, but he also hit the majority of the week's most memorable shots. Beyond that, however, loomed a larger intangible. I thought the U.S. might come to Korea uninspired, after a long season and being a heavy favorite to win, but the emotion that Lefty displayed regarding the mere honor of being picked to play for his country spread to the rest of the team. That might have been the margin of victory.\nSENS: Branden Grace played the best golf start to finish, but let's keep the MVP to the winning team and give it to Zach Johnson, who tied with Phil for the most points by an American and didn't commit a rules gaffe along the way.\nMORFIT: Phil Mickelson emerged as the clear MVP for the Americans with his thumping of Charl Schwartzel in singles. Phil's solid record (3-0-1) was mighty impressive considering he hasn't exactly had the best of years. And when you add in the intangibles like players rubbing his belly for luck , and his ridiculous celebratory handshake with partner Zach Johnson, there was a lot to like. Good for him. Good for the Cup. Good for Jay Haas for picking him.\nGODICH: Say hello to Branden Grace. The 27-year-old showed he deserves a spot at the young-guns table along with Jordan, Jason, Rory, et al. On the U.S. side, I'm going with Phil Mickelson. Who saw that coming? Now here's the issue: What if Phil doesn't make the Ryder Cup team on points? Would Davis Love III use a captain's pick on him? Based solely on leadership, my best guess would be yes. But you have to wonder what kind of play you're going to get out of a guy who turns 46 next summer.\nVAN SICKLE: Louis Oosthuizen. He played well and came through in the clutch at the finish.\nRITTER: Phil went unbeaten and served as the team's heart and soul (and good-luck charm) . Not for nothing, he also delivered the best smack talk of the week. Lots of great performances, but Mickelson singlehandedly elevated the entire event.\n3. Amid an otherwise stellar Presidents Cup performance, Phil Mickelson was at the center of a controversial violation of the one-ball rule during the Friday fourballs match. Innocent mistake? Confusing rule? What's your takeaway from this episode?\nBAMBERGER: Really odd. I don't think I even understand how Phil could not have known that you cannot switch ball types intra-round. Can you ever do that? I don't think so. I don't understand what was going on there.\nPASSOV: Methinks we need GOLF’s The Rules Guy for further review. I'm with the crowd that says, \"How can you be even in match play on one hole and two down when you arrive at the next tee?\" Sure, I'm mystified that the officials bungled this one so badly, but maybe they were unduly shocked that they would have to rule on something that seemed so far-fetched, that anybody would violate the one-ball rule. I was surprised to learn that the rule is different for Ryder Cups played in the U.S. Why wouldn't there just be one rule for these events? That said, Phil should know better. He's played in 11 of these things. The only explanation is how Gary Van Sickle stated it: That's Phil being Phil.\nSENS: The rule is straightforward, and it's hard to imagine that Mickelson didn't know it. This one belongs in the \"what-was-Phil-thinking?\" category.\nMORFIT: As anyone who has covered Phil over the years knows, Mickelson is a competitor who is forever trying to gain an advantage. The violation of the one-ball rule was just an extension of that, although the penalty--a loss of two holes in one after he was wrongly advised to pick up his ball--was one for the ages. Why stop at two? Can you lose three holes in one? What about four? This one will be hard to forget even among golf's deep reservoir of inane rules quirks.\nGODICH: That's Phil being Phil, but I'd call it a stupid mistake. (Can you imagine the reaction if Dustin Johnson had been the culprit?) How do you not verse yourself on the rules? How is this not discussed during a team meeting?\nVAN SICKLE: It was an honest mistake but Phil shouldn't make a blunder like that. No one else did. How do you not know the rules after 10 PCs? That half point nearly cost the team win.\nRITTER : The rule isn't confusing at all and I'm surprised Phil didn't know it (even though I sure didn't). But again, this led to the week's best trash talk, Phil's post-round presser , so I say we write the whole thing off as a net gain for the event.\n4. Adam Scott crushed Rickie Fowler 6&5 during their singles match Sunday. Scott struggled with his transition to the short putter all week but got hot with it on Sunday. What do you predict for him when the anchoring ban takes effect in January?\nBAMBERGER: He'll be fine. His stroke was never yippy, he just didn't make much and was looking for something--anything--to improve. He's putted very well with a short putter and a long putter and if finds he can't make short putts with the short putter he'll do what they all will do, use the long putter without anchoring it, getting it really close to the chest without holding it there. You don't have to hold it in place to get the desired pendulum action.\nPASSOV: I'm not optimistic for Scott's chances to challenge for Number 1 again with the short blade in his hands. He was awful with it in the pre-broomstick era and has been spotty to putrid during his occasional experiments with it in 2015. Having said that, he's still a phenomenal ball-striker and once he commits fully to the smaller wand, he'll be OK--just nowhere near as good as he was in his anchoring heyday.\nSENS: Players don't switch to the anchored stroke because it looks sexy. They do it because they've developed the yips. It's hard to imagine Scott ever getting his putting back to what it was on a consistent basis. There might be streaks, as we saw in singles against Fowler. But the yips are like herpes. They don't go away for good.\nMORFIT: Adam will be okay once he picks a putting style and sticks with it. I think in 2015 he also fell into the traditional just-had-a-kid funk we've seen time and again on the PGA Tour.\nGODICH: Let's not get carried away with what we witnessed over 13 holes in a match where Scott's opponent didn't put up much of a fight. For three days, I saw a guy who appeared tentative and uncomfortable on the greens. Scott struck a slew of makeable putts that didn't even scare the hole. I'm afraid it's going to be a mighty struggle.\nVAN SICKLE: I look for Scott to enjoy a brief good run before the reasons he left the short putter come back to bite him. Then he goes unanchored long or, if I may suggest, face-on.\nRITTER: Despite a strong win over Rickie, Scott's future without the broomstick seems a little murky. He's never been a superior putter to begin with, and I wonder how hard he's willing to grind if he struggles.\n5. It was reported that Tiger Woods placed a call to Fred Couples and later talked to Davis Love III during the Presidents Cup with the message that he would be interested in serving as an assistant captain to Love at the 2016 Ryder Cup. Do you interpret that as Tiger not feeling too optimistic about playing his way on to the team?\nBAMBERGER: I feel it is Tiger's way of saying he is lonely and bored.\nPASSOV: As one who's been twice convicted of overly optimistic Tiger hype, I'm puzzled. If Tiger acknowledges that he won't be back until April and won't be able to earn his way onto the team, fine. Two words, however: captain's pick. Tiger had a career's worth of frustrations in 2015, yet his performances at the Masters and at Greensboro told the world there's still some Ryder Cup-worthy golf left in his tank. Why shouldn't he feel that he can improve on that for whatever months he does play in 2016? Until he calls it a day, I find it inconceivable that golf's greatest competitor would settle for a coaching job.\nSENS: Yes. It's like the opposite of a John Fogerty song: \"Put me in as coach, I'm not ready to play.\"\nMORFIT: I interpret this to mean Tiger is looking for something to do as he wanders around somewhat aimlessly amid the twilight of his career. It's nice that he's interested.\nGODICH: In no way is Tiger thinking he can't make the team. One thing he has never lost is his competitiveness. But let's be realistic here. There's absolutely nothing to suggest he's going to play his way on, but he knows what a special event the Ryder Cup is. Good for Tiger.\nVAN SICKLE: No, I see Tiger noting the new U.S. system and realizing that if he is going to captain a team, he needs to get on board. To me it says TW wants to be a captain. Excellent.\nRITTER: I interpret the phone call as Tiger being extremely excited about the event that was unfolding on his TV. I like that he's still eager to stay involved at the next Ryder Cup and am certain he's still hopeful to be there as a competitor.\n6. The Frys.com Open, the official start of the 2015-16 season, tees off on Thursday with Rory McIlroy in the field. After a forgettable 2014-2015 campaign that included an injury and losing his No. 1 ranking, what’s your prediction for McIlroy’s coming season?\nBAMBGERGER: I don't think he'll win the grand slam but he'll have a very good chance of completing it.\nPASSOV: Sorry, I'm not buying into the statement that Rory's 2014-15 campaign was forgettable. He remained Number 1 in the world for most of that period, he won early at Dubai, then beat everybody in golf at the WGC Accenture Match Play and then won Quail Hollow by a touchdown. In the three majors he did play, he finished fourth, T9 and 17th. It wasn't a great year by Rory standards, but it was hardly forgettable. Newly inspired by the two guys that passed him, Jordan Spieth and Jason Day, I look for Rory to come back huge in 2016.\nSENS: You know how onions are a biennial crop? Of course you do. Well, Rory will be just like that. Taking a year off to cycle back into peak shape. Assuming that he steers clear of pick-up soccer games, I expect him to put up an impressive showing in 2016.\nMORFIT: This is a monumentally important season for Rory. If he can't be motivated by what Jordan Spieth and Jason Day did this year, and by losing the No. 1 ranking, and by missing out on a St. Andrews British Open because of a dumb soccer injury, what WILL motivate him?\nGODICH: Let's see: two wins (one in a WGC event) and seven top 10s in 12 PGA Tour starts. How many players would love to have a \"forgettable\" season like that? In any event, after all of the hype about Spieth and Day, I believe Rory will be fully motivated in 2016. It'll be fun to watch.\nVAN SICKLE: Rory returns and starts wracking up wins and contending in majors. Business as usual. A good year ahead. Roars for Rors.\nRITTER: Health permitting, I like Rory to have a bounce-back season. He and Spieth and Day will battle for No. 1 all year long -- buckle up!\nThe Tour Confidential roundtable continues Monday on our new weekly show hosted by Jessica Marksbury. Tweet her your questions @Jess_Marksbury .\nGo to MSN Home", "external_links": ["http://www.golf.com/tour-and-news/phil-mickelson-takes-blame-presidents-cup-ball-blunder", "http://www.golf.com/rules-guy", "http://www.golf.com/us-holds-win-presidents-cup", "http://www.golf.com/tour-and-news/ready-new-season-rory-mcilroy-headlines-field-fryscom-open", "http://www.golf.com/golf-plus/rory-mcilroy-has-lost-his-grip-golfs-next-era", "https://twitter.com/joepassov", "https://twitter.com/CameronMorfit", "http://www.golf.com/tour-and-news/five-years-later-we-still-try-make-sense-dustin-johnsons-disastrous-bunker-debacle-whistling-straits", "https://twitter.com/garyvansickle", "http://www.golf.com/tour-and-news/watch-chris-kirks-clutch-presidents-cup-putt-vs-anirban-lahiri", "http://www.golf.com/tour-and-news/phil-mickelsons-rules-error-was-inexcusable-thats-phil-being-phil", "https://twitter.com/MarkGodich", "https://twitter.com/Jess_Marksbury", "https://twitter.com/JoshSens", "http://www.golf.com/tour-and-news/tiger-woods-calls-davis-love-iii-interested-being-ryder-cup-assistant", "http://www.golf.com/tour-and-news/team-usa-rubs-phil-mickelsons-belly-good-luck-presidents-cup", "http://www.golf.com/", "http://go.microsoft.com/fwlink/?LinkID=286759", "http://www.golf.com/tour-and-news/2015-presidents-cup-live-scores-and-results", "https://twitter.com/Jeff_Ritter"], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-14T03:57:04.431+03:00", "highlightTitle": ""}