{"organizations": [], "uuid": "fe2fbcd2872dbf77bf0f6c126b4295e04239ecc2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.oregonlive.com", "main_image": "http://imgick.oregonlive.com/home/olive-media/width620/img/oregonian/photo/2015/10/05/18907710-large.jpg", "site_section": "http://www.oregonlive.com/", "section_title": "Oregon Local News, Breaking News, Sports &amp; Weather - OregonLive.com", "url": "http://www.oregonlive.com/nfl/index.ssf/2015/10/live_monday_night_football_upd.html", "country": "US", "title": "Monday Night Football live chat recap: Seattle Seahawks 13, Detroit Lions 10", "performance_score": 0, "site": "oregonlive.com", "participants_count": 7, "title_full": "Monday Night Football live chat recap: Seattle Seahawks 13, Detroit Lions 10 | OregonLive.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T04:21:00.000+03:00", "replies_count": 41, "uuid": "99cf6e1a02a443b31646d70e3737afe15aad24d4"}, "author": "Billy Gates | The Oregonian/OregonLive", "url": "http://www.oregonlive.com/nfl/index.ssf/2015/10/live_monday_night_football_upd.html#post-0", "ord_in_thread": 0, "title": "Monday Night Football live chat recap: Seattle Seahawks 13, Detroit Lions 10", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Seattle Seahawks (1-2) host the Detroit Lions (0-3) Monday night in what is shaping up to be an early season \"must-win\" game for both teams.\nThe winless Lions have faced a brutal schedule through three weeks, and it won't get any easier on Monday Night Football in Seattle. The Lions are staring at 0-4 with a game against the Arizona Cardinals (3-1) looming next week. Only one team has made the playoffs after starting 0-4: The 1992 San Diego Chargers.\nThe Seahawks, who will be playing without Marshawn Lynch, are hoping to make up ground on the Cardinals and bank another home victory before hitting the road to face the undefeated Bengals on a short week. Heading to Cincinnati with a 1-3 record would not be ideal.\nStay with us for live updates and analysis throughout Monday night's game. The game is scheduled to kick off at 5:30 p.m. on ESPN.\nHow to watch Seahawks-Lions: TV channel & live stream First quarter updates : No scoring, and the Seahawks are giving Detroit quarterback Matthew Stafford all he can handle with a relentless pass rush. Seattle's offense, outside of a big play to backup running back Fred Jackson, hasn't done much of anything to speak of, either. Starting running back Marshawn Lynch is out with a hamstring injury.\nSecond quarter : Sometime during the quarter Detroit's Matt Prater hit a field goal. I was just as surprised as you were to see that, probably. The 13 opponent possessions in CenturyLink Field before the FG all ended in punts. Quite a streak there.\nA miraculous Russell Wilson scramble kept a play alive that eventually resulted in a big gain, and that set up a 24-yard touchdown pass to Doug Baldwin. The Seahawks are up 7-3 in a deafening CenturyLink Field, and the final two plays of the drive were Wilson at his best.\nHere's part of the play that set up the TD pass to Baldwin. While the offensive line did Wilson no favors, he somehow got out of trouble ...\nRussell Wilson turned this situation into a 34-yard gain, you guys. pic.twitter.com/FMfzLW8F7Q\n— NFLonCBS (@NFLonCBS) October 6, 2015\nWilson is starting to get into a groove just before the 2:00 mark. He found Tyler Lockett over the middle for a big gain, and then scrambled out of the pocket to get the Seahawks inside the Lions' 10-yard line.\nA big sack and some other offensive shenanigans pushed the Seahawks back from knocking on the door of the end zone to a 51-yard field goal attempt. Steven Hauschka did what he does, though, and he nailed the kick to give Seattle a 10-3 lead.\nAt the half, the Seahawks lead the Lions 10-3.\nThird quarter : Hauschka, from 53 yards, hammers it home. Seahawks up 13-3.\nA muffed punt ended up not hurting the Seahawks, and the Lions punt for the sixth time tonight. Seattle can put it away with another score here.\nThe Seahawks don't get a score, but Jon Ryan pins the Lions deep in their own territory with a nice punt. It should be some concern to the Seahawks that Wilson has been sacked 16 times this season, second-most in the league. Human statue Alex Smith of Kansas City has been sacked 18 times.\nAfter three quarters of play, Seattle leads Detroit 13-3 and I'm trying to not change the channel over to the Blazers game. It's tough.\nFourth quarter : Jimmy Graham has been found, so all those milk cartons he has been on can be thrown in the trash. That's good news for Seahawks fans.\nDetroit's Ziggy Ansah with the strip-sack on Wilson, and then Ansah recovers the fumble. The Lions absolutely have to score on this possession to stay in this game.\nThe Detroit offense can't get out of its own way. Penalties kill the drive and waste the Ansah fumble recovery and they have to give it back to the Seahawks. Even with Lynch out, expect the Seahawks to use Rawls, Jackson and Derrick Coleman to run the ball and milk some clock.\nWilson tries to dance out of pressure and coughs it up, and it's a 27-yard scoop and score for Detroit defensive lineman Caraun Reid. PAT is good, and the Lions cut the Seahawks lead to 13-10. What a time to actually convert a turnover.\nRyan hits a punt that registered on radars around the country, and Detroit will start this drive on its own 9-yard line, and that's very fortunate considered the initial catch was muffed and rolled into the end zone. All told, the punt was 70 yards. Massive.\nMatt Stafford led the Lions down the field, and hit Calvin Johnson over the middle with a pass. It looked as if Johnson was going to get in the end zone, but Seattle's Kam Chancellor comes up with the play of the game thus far and punches the ball out of Johnson's arms and through the end zone for a touchback. Wow.\nOn third down, Wilson evades pressure and hits Jermaine Kearse for a big gain and that is going to do it. Goodness gracious. The Seahawks dodged a huge bullet there and will move to 2-2.\nFinal score: Seattle 13, Detroit 10", "external_links": ["https://twitter.com/NFLonCBS/status/651202878510493696", "http://t.co/FMfzLW8F7Q"], "published": "2015-10-06T04:21:00.000+03:00", "crawled": "2015-10-06T10:19:59.223+03:00", "highlightTitle": ""}