{"organizations": [], "uuid": "ba104e1f9973a79667234c612fc23ddbfbe853ca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "http://www.bostonherald.com/sites/default/files/media/2015/10/08/100815celtics1.jpg", "site_section": "http://bostonherald.com/sports", "section_title": "Sports | Boston Herald", "url": "http://bostonherald.com/sports/celtics_nba/boston_celtics/2015/10/david_lee_cs_chance_to_be_like_warriors", "country": "US", "title": "David Lee C's chance to be like Warriors", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "David Lee C's chance to be like Warriors | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "ba104e1f9973a79667234c612fc23ddbfbe853ca"}, "author": "Mark Murphy", "url": "http://bostonherald.com/sports/celtics_nba/boston_celtics/2015/10/david_lee_cs_chance_to_be_like_warriors", "ord_in_thread": 0, "title": "David Lee C's chance to be like Warriors", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Since becoming a Celtic, David Lee heard the comparisons with his last NBA home, as frivolous as this wistful talk can sound.\nAs great as Golden State has become, with the best combination of offense and defense the league has seen in years, during the lockout-shortened 2011-12 season the Warriors were 23-43.\nThat was Lee’s first season in the Bay Area, after turning down a cap-limited offer from the Celtics to sign with a bad Western Conference team. The roster was so lean, Lee became an instant co-captain, along with a young third-year star named Stephen Curry. The team just hit the draft jackpot again with another shooter — Klay Thompson — even if the rest of the league hadn’t yet stirred to what was taking shape in Oakland.\nBut the Warriors continued to draft with great precision, following up 2009 seventh pick Curry and 2011 11th pick Thompson with Harrison Barnes (No. 7, 2012) and perhaps the most unexpected stroke of all, a 2012 second-rounder named Draymond Green. Their highest pick, Ekpe Udoh (No. 6, 2010), was part of a package traded to Milwaukee for center Andrew Bogut.\nWith their myriad of draft picks over the next four years, the Celtics are also best equipped to rebuild through the draft. And as the Warriors went from 23 wins to 47 the following year, the Celtics went from 25 in Brad Stevens’ first season to 40 wins last year.\nThat’s the juncture Lee can look at now.\n“It was really a two-year process in starting to get guys in there,” Lee said of his first season with Golden State. “The big step was getting into the playoffs my third year there. Nobody said we were a playoff-caliber team in the West and that’s the same thing these guys did last year. This team is about where we were in Year 3, where we made the playoffs and then lost in the second round. We were really a fringe playoff team, a six or eight (seed), and then we made some additions the next year.\n“I think (the Celtics) have the same ability to make those same strides. The front office has done a good job of getting the right guys in here.”\nOn an upward path\nBrian Scalabrine was an assistant coach on Mark Jackson’s last Golden State team, the one that finished 51-31 and set the table for Steve Kerr last season.\nAs wonderful as the Warriors have been to watch, Scalabrine looks at their defensive progression.\n“Twenty-sixth in defense, (13th), fourth, No. 1,” he said of the Warriors’ defensive rating over the last four seasons. “The Celtics were (19th) last year, 12th, and if they take the next step that would be a top five defense. If they’re a top five defense this year, then they’ll be on the same path as the Warriors.”\nStevens is rightly skeptical. The Eastern Conference is tougher than last spring when the Celtics made their surprising playoff run.\nEven the league’s 12th best defensive rating, and the Celts were actually third over the last month of the regular season, is a far cry from the top five. The Warriors, San Antonio, Memphis, Milwaukee and Washington comprised the top five last season.\nThe Celtics are a lot closer to where they were two seasons ago than what the Warriors accomplished the last two seasons.\n“There are some parallels and a lot of things that aren’t the same,” said Stevens. “They’ve done a great job of that and hats off to them. The thing about their team from the outside looking in, and David would second this, is that they have a great group of guys. They’re very versatile. Their length and versatility is different from most teams in the league, especially in perimeter defense. And then they have a pair of guys who can drop kick the ball in from anywhere on the court. That’s pretty unique. It’s a great team, and like you do with any great team, you try to take what you can from them.”\nThe biggest takeaway, according to Lee, is probably character. Curiously, he once again finds himself at the head of the table with another young team.\n“My first job is to play, obviously, but it’s also to help the younger guys and we have a lot of those,” said Lee. “More than anything it’s about leading by example and being a pro. We have to show the younger guys how to work on and off the court. That’s not a problem because we have really good character guys on the team. Just being there to give advice if needed. I don’t think any of these young guys want to hear someone preach to them all day. If I see a little something here and there I’m always offering help, but it’s about being a leader and taking care of my business.”\nFiguring things out\nOne variable that doesn’t match up to Golden State’s progression is the nature of the current Celtics roster. Marcus Smart may already be an elite defender, but he’s not an offensive star, certainly not the caliber of Curry, last season’s Most Valuable Player.\nInstead, the Celtics have a quality collection of role players.\n“I’m telling you right now, Brad has the hardest job in the NBA as far as figuring out the rotation of this team,” said Scalabrine. “It will be which combinations are successful, and not necessarily one individual player. An example would be Isaiah Thomas really plays well with a shooter. An example is Jae Crowder and Isaiah will play well if Jae is at the 4. The more shooting you have on the floor for Isaiah Thomas, the harder it will be to guard them because he has space to work. If he has space he’s one of the top five offensive players in the NBA. If he doesn’t have space he’ll struggle.\n“These are the things you have to figure in. It’s not this guy versus this guy, it’s combinations. Really difficult.”\nAt a similar stage in their development, the Warriors were feeling their way along, too.\n“I keep saying chemistry and character,” said Lee. “That mattered more than anything else because we built the right way with people who wanted to be there, people who are willing to go out and play hard for 82 games, that care about one another and support one another, and if you have that it’s going to take you further than you think you can go.\n“Now you take that confidence out of the experience you’ve gained. Even though (the Celtics) lost to Cleveland and got swept last year, you still can say now we’ve been in a playoff game, we know what the preparation is like and what playoff basketball is like, and you carry it into the next season.”", "external_links": [], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-09T11:00:58.602+03:00", "highlightTitle": ""}