{"organizations": [], "uuid": "1575c73d5ede3a15ea72b23e5d8d100edd49515c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "highschoolsports.lehighvalleylive.com", "main_image": "", "site_section": "http://blog.lehighvalleylive.com/lehighvalleylive_high_school_sports_homepage_feed/atom.xml", "section_title": "lehighvalleylive.com High School Sports", "url": "http://highschoolsports.lehighvalleylive.com/news/article/-2129532988403015154/heather-tostevin-wills-north-hunterdon-soccer-to-victory-over-belvidere/", "country": "IL", "title": "Heather Tostevin wills North Hunterdon soccer to victory over Belvidere", "performance_score": 0, "site": "lehighvalleylive.com", "participants_count": 0, "title_full": "Heather Tostevin wills North Hunterdon soccer to victory over Belvidere", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T23:42:00.000+03:00", "replies_count": 0, "uuid": "1575c73d5ede3a15ea72b23e5d8d100edd49515c"}, "author": "", "url": "http://highschoolsports.lehighvalleylive.com/news/article/-2129532988403015154/heather-tostevin-wills-north-hunterdon-soccer-to-victory-over-belvidere/", "ord_in_thread": 0, "title": "Heather Tostevin wills North Hunterdon soccer to victory over Belvidere", "locations": ["North Hunterdon"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Heather Tostevin"], "text": "Complete Box Score » \nNorth Hunterdon girls soccer team was in a battle with Belvidere on Saturday with a berth in the Hunterdon/Warren/Sussex semifinals on the line. \nAs much as the Lions were controlling the game, they couldn't shake off the County Seaters, who took the scoreless game into overtime. \nThat's where Lions senior midfielder Heather Tostevin made sure her strong play during the game wouldn't go to waste. \nShe scored off a rebound from a Rebecca Fontana direct kick with 4:56 left in the first extra period secure the 1-0 road victory for the Lions. \n\"She willed us to this win,\" North Hunterdon coach Steve DeLorenzo said. \"As a senior captain, I thought she was dominant out there. She played exceptionally well. And honestly, that's what a senior captain does.\" Heather Tostevin (Josh Folck | For lehighvalleylive.com) \n\"We got a handball at the top of the 18 and Becca stepped up to take the kick. She's playing great this year. We knew she could do it,\" Tostevin said. \"She placed a great ball right in front of the goal. I just happened to get a touch on it. The keeper (Christine Fox) saved the first one but I knew we were winning this game. So I just went after it with everything I had and put it in the back of the net.\" \nIt came after a lot of effort all game from Tostevin and her teammates. The Lions fired 20 shots towards Belvidere junior goalkeeper Christine Fox, but the keeper stood strong until the final shot. Tostevin even had one go off the post in the first five minutes of the game. \nBut in overtime, her shot went by the post and found the back of the net. \n\"I was ecstatic,\" Tostevin said. \"I was ecstatic, relieved, excited. These girls have worked extremely hard the entire season. We just deserved this so much.\" \nFox had 15 saves for the County Seaters. Lions junior goalkeeper Olivia Ripnyak had five saves to preserve the shutout. \nNext up for North Hunterdon in the Hunterdon/Warren/Sussex tournament is a road semifinal game against either Pope John or Sparta on Saturday. \n\"The next game I believe is definitely going to be tougher competition. As we go further in the tournament, we're going to have to continue to get better each time,\" Tostevin said. \"Working on things every single practice. Just keep moving forward.\" \nBut for now, the senior captain can celebrate one of the best moments of her career. \n\"I will remember this one for a lifetime,\" Tostevin said.", "external_links": [], "published": "2015-10-17T23:42:00.000+03:00", "crawled": "2015-10-18T02:56:10.189+03:00", "highlightTitle": ""}