{"organizations": [], "uuid": "76424f6af72f7ed6315fa57c96fb799b837f851a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxsports.com", "main_image": "http://a.fssta.com/content/dam/fsdigital/fscom/mlb/images/2015/10/22/102215-MLB-Cubs-Anthony-Rizzo-pi-ssm.vresize.1200.675.high.94.jpg", "site_section": "http://api.foxsports.com/v1/rss?partnerKey=zBaFxRyGKCfxBagJG9b8pqLyndmvo7UU&tag=jabo", "section_title": "FOX Sports Digital", "url": "http://www.foxsports.com/mlb/just-a-bit-outside/story/chicago-cubs-kyle-schwarber-kris-bryant-anthony-rizzo-addison-russell-castro-baez-future-102215?cmpid=feed:-sports-CQ-RSS-Feed", "country": "", "title": "Hope certainly not swept away in Chicago", "performance_score": 0, "site": "foxsports.com", "participants_count": 0, "title_full": "Hope certainly not swept away in Chicago", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T17:51:00.000+03:00", "replies_count": 0, "uuid": "76424f6af72f7ed6315fa57c96fb799b837f851a"}, "author": "", "url": "http://www.foxsports.com/mlb/just-a-bit-outside/story/chicago-cubs-kyle-schwarber-kris-bryant-anthony-rizzo-addison-russell-castro-baez-future-102215?cmpid=feed:-sports-CQ-RSS-Feed", "ord_in_thread": 0, "title": "Hope certainly not swept away in Chicago", "locations": ["Chicago"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Rob Neyer"], "text": "Hope certainly not swept away in Chicago Rob Neyer @robneyer \nGetting swept ... well, it sucks. As I remember, anyway. The Royals have been swept just twice in their postseason history, the first when they lost to the A's in a Division Series after the strike-shortened '81 season. Coming just a year after the Royals nearly won their first World Series, I just remember thinking, \"Is that all there is?\" \nBut this one's different. For one thing, the Cubs did beat the Pirates in the Wild Card Game, and they did beat the rival Cardinals in their Division Series. What's more, the Cubs are actually ahead of schedule; as Cee Angi wrote after the Cubs lost Game 2 , the organization seems well-positioned for the future. \nBut that's the big picture. Today, while the Mets begin their long pre-World Series vacation, I'd like to look at some of the Cubs' little things. \nAs you've probably heard, they've got an exceptionally young infield, which is all the more impressive since it's also an exceptionally good infield, book-ended by All-Stars Kris Bryant and Anthony Rizzo. Rookie Addison Russell took over as the everyday shortstop in early August, and looks like a future star. Which leaves only second base, where Javier Baez and Starlin Castro both have some claim on the job. Or maybe there's room for both, with Bryant potentially moving to the outfield. Whatever happens, the Cubs figure to have the best infield in the majors, with only the Giants offering any sort of competition. \nThe outfield picture's quite a bit hazier. Yes, Jorge Soler in right field. But the rest of the current outfield mix -- Kyle Schwarber, Chris Coghlan and Dexter Fowler -- raises nearly as many questions as it answers. Those three were obviously good enough for the Cubs to win 97 games and reach the NLCS. But there's also room for improvement, especially when it comes to run prevention. And Fowler's probably leaving this winter via free agency. Fortunately, the Cubs have three fine young prospects in Billy McKinney, Albert Almora, and recently signed Cuban star Eddy Julio Martinez ... not to mention the Cubs' presumed interest in free agent Jason Heyward. \nThere's no guarantee that McKinney or Almora or Martinez will help the big club in 2016 ... but then again, after seeing what Schwarber and Russell did this summer, just out of Double-A, would you want to bet against it? \nThe Cubs' top four starting pitchers combined for 128 starts this season, and all four are signed for next year. Management will no doubt be looking for another starter this winter, if only because you can't count on any quartet for another 128 starts. Still, the Cubs are nearly as set for starting pitchers as they could be. \nWhich leaves only the bullpen, and there's work to be done there. Closer Hector Rondon looks like the real thing, but otherwise the Cubs don't have two or three of those big strikeout pitchers that have become so de rigeuer in the Modern Game. \nBut of course now we're just picking nits. If your biggest worry is finding a couple of relief pitchers who can throw 95 and over the plate, you might as well spend January on a beach in the Bahamas. \nModern Baseball being Modern Baseball, Theo Epstein and Co. will probably eschew the Bahamas and similar dream vacations, and instead spend a cold winder in Big Shoulders City, trying to figure new ways to make people in St. Louis and Pittsburgh unhappy. And they, them. \nBaseball, modern or otherwise, can be cruel. Just ask Cubs fans right now. There aren't any guarantees. Two torn elbow ligaments can brings just about any team back to the pack. But thereâs no obvious reason to think the National League Central won't be as exciting in 2016 and beyond as in 2015. And there's no obvious reason to think the Cubs won't remain in the World Series hunt for the rest of this decade.", "external_links": [], "published": "2015-10-22T17:51:00.000+03:00", "crawled": "2015-10-22T18:35:09.780+03:00", "highlightTitle": ""}