{"organizations": ["Martinez Everton", "Dundee", "Everton"], "uuid": "5279b9a0a90b3997912fa1e86797932c3df5e81c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "http://s1.reutersmedia.net/resources/r/?m=02&d=20151015&t=2&i=1087204511&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB9E0QA", "site_section": "http://mf.feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "http://uk.reuters.com/article/2015/10/15/uk-soccer-england-eve-martinez-idUKKCN0S91NF20151015?feedType=RSS&feedName=sportsNews", "country": "US", "title": "Everton's Baines to return in two weeks, says Martinez", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "Everton's Baines to return in two weeks, says Martinez", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T16:13:00.000+03:00", "replies_count": 0, "uuid": "5279b9a0a90b3997912fa1e86797932c3df5e81c"}, "author": "", "url": "http://uk.reuters.com/article/2015/10/15/uk-soccer-england-eve-martinez-idUKKCN0S91NF20151015?feedType=RSS&feedName=sportsNews", "ord_in_thread": 0, "title": "Everton's Baines to return in two weeks, says Martinez", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kane", "Baines", "Leighton Baines", "Graham Stuart"], "text": "Everton's Baines to return in two weeks, says Martinez Everton's Leighton Baines and Dundee's Kane HemmingsMandatory Credit: Action Images / Graham Stuart \nEverton defender Leighton Baines is two weeks away from a return to first team action after spending the last five months on the sidelines with an ankle injury, manager Roberto Martinez said on Thursday. \nThe 30-year-old left-back missed the tailend of last season and is yet to feature in this campaign after twice undergoing ankle surgery, but has stepped up his recovery work during the international break. \n\"Leighton is not far off at all. We had a very good two weeks work. I'd say two weeks more,\" Martinez said during his pre-match news conference ahead of Saturday's visit of Manchester United in the Premier League. \nWith defenders John Stones and Seamus Coleman also fit, Martinez is optimistic that his side can beat United at Goodison Park for the fourth time in a row -- a feat they have never achieved in the Premier League. \n\"From a medical point of view they (Stones and Coleman) are fit but from a football point of view we need to make a decision over the next 48 hours,\" Martinez said. \n\"We respect this Manchester United side. When they hit top spot a few weeks ago it was a statement. But we want to be as good as we can.\" \nMidfielder Ross Barkley, who has been in fine form this season, also drew praise from his manager. \n\"In Ross's case I've been pleased with his assists, final movement and pulling people out of postion. That understanding has gone to a different level. \n\"It's not just scoring goals, it's using his presence in the final third a bit more. There's been a focus on him being a bit more aware of what he can do.\" \n(Reporting by Shravanth Vijayakumar in Bengaluru; Editing by Nick Said) \nOur top photos from the last 24 hours. Slideshow Trending On Reuters", "external_links": [], "published": "2015-10-15T16:13:00.000+03:00", "crawled": "2015-10-15T16:20:31.320+03:00", "highlightTitle": ""}