{"organizations": [], "uuid": "4d7d3099afad6d97cf0ac4f78d7e2364468ca0f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ksl.com", "main_image": "http://img.ksl.com/slc/2572/257292/25729200.jpg", "site_section": "http://www.ksl.com//xml/294.rss", "section_title": "KSL / Sports Home / Local", "url": "http://www.ksl.com/?sid=36872236&nid=858&s_cid=rss-extlink", "country": "US", "title": "Aggies looking to take advantage of key matchups against Fresno State", "performance_score": 0, "site": "ksl.com", "participants_count": 1, "title_full": "Aggies looking to take advantage of key matchups against Fresno State", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T00:01:00.000+03:00", "replies_count": 0, "uuid": "4d7d3099afad6d97cf0ac4f78d7e2364468ca0f5"}, "author": "Parker Robertson, KSL.com Contributor", "url": "http://www.ksl.com/?sid=36872236&nid=858&s_cid=rss-extlink", "ord_in_thread": 0, "title": "Aggies looking to take advantage of key matchups against Fresno State", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Aggies looking to take advantage of key matchups against Fresno State By Parker Robertson, KSL.com Contributor | Posted Oct 9th, 2015 @ 3:01pm 0  \nFRESNO, Calif. — Utah State is looking to start Mountain West Conference play with a 2-0 record for the second time in its three years in the league. To do that, the Aggies travel to Fresno State to take on a struggling Bulldog squad Saturday night in their first conference road game of the season. \nUSU has won 13 of its last 15 conference road games, while Fresno State has an 11-1 record in conference games played at home. Something will have to give. \n\nSenior running back Marteze Waller has been a bright spot in the backfield for the Bulldogs. Through five games he is averaging 4.3 yards per carry, however, he has yet to get in the end zone on the ground, due in part to Fresno State playing from behind in all but one game this season. \n\nZach Greenlee is expected to start for Fresno State against the Aggies, but reports indicate that redshirt freshman Kilton Anderson will see significant time. \nUtah State head coach Matt Wells talked about Greenlee and the pieces that surround him at Monday's press conference. \n\"As I look at them on offense, Zack Greenlee does some really good stuff out on the perimeter,\" Wells said. \"It's a veteran, physical offensive line. They've got some talented wideouts on the edge.\" \nAggie cornerback Jalen Davis, for one, is excited to face the Bulldog offense. \n\"It's always going to get me excited when a team has great players who are very quick and fast,\" he said. \"I just love playing \n\nUtah State offensive line was much improved against Colorado state, but it will still be looked at to continue to make strides against a tricky Fresno State defense. Wells talked about the skill and pressure the Bulldogs bring on defense. \n\"On defense, there are several guys that played against us in the Mountain West championship game several years ago,\" he said. \"(Defensive end Todd) Hunt and (linebacker) Kyrie Wilson both had really good games against us. I remember them, and I remember seeing them, especially Wilson running around making plays. \n\"I have a lot of respect for them and what Coach (Tim) DeRuyter and (defensive coordinator Nick) Toth do on defense, and all the pressure looks they give you. They give you multiple pressures, safety pressures, outside linebacker, inside linebackers. You name it, they're coming down that ramp blitzing and pressuring — man pressures and zone pressures. They do a lot of stuff on defense, and that scheme is a challenge and those guys do a good job, and they always have.\" \nThe Bulldogs bring a lot of pressure, but they also have struggled against the run this year, giving up 4.6 yards per carry. Additionally, the Bulldogs are giving up an average of 256 rush yards per game against FBS opponents this season. Opening up holes and establishing a run game early will help the Aggies take the Bulldog faithful out of the game early. \nThe game kicks off at 8:30 p.m. MT, and it can be seen on CBSSN.", "external_links": [], "published": "2015-10-10T00:01:00.000+03:00", "crawled": "2015-10-10T09:45:19.933+03:00", "highlightTitle": ""}