{"organizations": [], "uuid": "712f31f72cd4a06dedfda629b6a0c73e16a227b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.idsnews.com", "main_image": "http://duvq7ua50whdw.cloudfront.net/20150925QJxaKBpvYx/dist/img/IDS-fb-icon.png", "site_section": "http://www.idsnews.com/section/sports", "section_title": "Sports | Indiana Daily Student", "url": "http://www.idsnews.com/article/2015/10/how-will-iu-football-respond-to-its-performance-against-no-1-ohio-state-saturday", "country": "US", "title": "How will IU football respond to its performance against No. 1 Ohio State Saturday?", "performance_score": 0, "site": "idsnews.com", "participants_count": 1, "title_full": "How will IU football respond to its performance against No. 1 Ohio State Saturday? | Indiana Daily Student", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T08:48:00.000+03:00", "replies_count": 0, "uuid": "712f31f72cd4a06dedfda629b6a0c73e16a227b3"}, "author": "Tori Ziege", "url": "http://www.idsnews.com/article/2015/10/how-will-iu-football-respond-to-its-performance-against-no-1-ohio-state-saturday", "ord_in_thread": 0, "title": "How will IU football respond to its performance against No. 1 Ohio State Saturday?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "For IU football, the season always seemed to be building to Ohio State.\nFans enjoyed the hype of the team’s first 4-0 start in a quarter century, the possibility of hosting College GameDay and the chance to knock off the No. 1 team in the country.\nBut now, all that has passed. And the question arises.\nWhere do the Hoosiers go from here?\nAfter the Hoosiers came within one snap of defeating the nation’s top dog in an anomaly of a game, the unofficial start to the Big Ten season is now, and it is essential IU takes the transition into conference play in stride.\nThis weekend, the Hoosiers will trade the bleacher-swinging ruckus of Memorial Stadium for the 106,572 capacity of Beaver Stadium, the third-largest stadium in the world.\nIU enters Happy Valley — where it has never won — as Penn State’s homecoming opponent.\nIn fact, despite playing in the same conference for 21 years and meeting 18 times, the Hoosiers have only one win against the Nittany Lions, which came in 2013.\nThe latest installment in this series will be a test of the Hoosiers’ maturity — namely, how they handle the hangover from the national spotlight.\nLast year, IU fell flat in a similar scenario against Maryland, IU’s opponent after they beat No. 18 Missouri in what many deemed one of the biggest wins in program history.\nBut this time, the Hoosiers seem more aware.\nFor a budding football program, a victory against historic powerhouse Penn State serves as good a touchstone as any — and, from sophomore quarterback Zander Diamont to senior tight end Anthony Corsaro, IU Coach Kevin Wilson seems to have done his job in getting his team to buy into that sentiment.\n“That’s Coach Wilson’s biggest thing to us every day: You’ve got to do something every day,” Corsaro said. “It’s not just about Ohio State. It’s not just about whoever you circle on the schedule. It’s about every day, that’s an opportunity to get better and keep coming and fight.”\nGiven the bucket of crabs that is the Big Ten, this game will help determine the hierarchy of the conference behind Ohio State and Michigan State.\nThough IU opened as an eight-point underdog, IU and Penn State seem to stack up pretty evenly.\nWhat might serve as the Hoosiers’ downfall has nothing to do with maturity at all — rather, the absence of premier talents in senior quarterback Nate Sudfeld and junior running back Jordan Howard.\nThe status of IU’s two offensive facilitators remains uncertain, although both dressed for practice Tuesday.\nWithout them, IU could struggle mightily against a Penn State defense that is allowing an average of only 284 yards and has a Big Ten-high 4.2 sacks per game.\nBut if there’s one thing we learned in the loss to the Buckeyes, it’s that the Hoosiers can fight.\nNow, against the Nittany Lions, we’ll learn if they can follow through.\nvziege@indiana.edu", "external_links": [], "published": "2015-10-08T08:48:00.000+03:00", "crawled": "2015-10-09T08:21:25.172+03:00", "highlightTitle": ""}