{"organizations": [], "uuid": "a54b095755dc758646ce081b1c3b5ac0b4470e46", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "wtop.com", "main_image": "", "site_section": "http://wtop.com/section/sports/feed/", "section_title": "WTOP » Sections » Sports", "url": "http://wtop.com/golf/2015/10/ji-eun-hee-maintains-lead-in-lpga-taiwan-championship/", "country": "US", "title": "Ji Eun-hee maintains lead in LPGA Taiwan Championship", "performance_score": 0, "site": "wtop.com", "participants_count": 1, "title_full": "Ji Eun-hee maintains lead in LPGA Taiwan Championship", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T11:56:00.000+03:00", "replies_count": 0, "uuid": "a54b095755dc758646ce081b1c3b5ac0b4470e46"}, "author": "wtopstaff", "url": "http://wtop.com/golf/2015/10/ji-eun-hee-maintains-lead-in-lpga-taiwan-championship/", "ord_in_thread": 0, "title": "Ji Eun-hee maintains lead in LPGA Taiwan Championship", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By The Associated Press October 23, 2015 4:56 am \nTAIPEI, Taiwan (AP) — Ji Eun-hee took a one-stroke lead over Lydia Ko into the weekend in the LPGA Taiwan Championship, overcoming a double bogey with three straight birdies Friday in tricky wind conditions at Miramar. \nThe 29-year-old South Korean player finished with a 3-under 69 to reach 9-under 135. She made the double bogey on the par-5 sixth after hitting her drive left into the jungle, rallied with birdies on Nos. 9-11 and closed with seven straight pars. \nJi won the 2008 LPGA Championship and 2009 U.S. Women’s Open, both major tournaments, for her lone LPGA Tour titles. \nThe second-ranked Ko birdied the par-5 18th for a 67. She’s trying to regain the No. 1 spot in the world from South Korea’s Inbee Park, the winner last year at Miramar. \nThe 18-year-old New Zealander has four LPGA Tour victories this year, the last a major victory last month in France in the Evian Championship. She won the 2013 Swinging Skirts World Ladies Masters at Miramar for her first victory as a professional. \nPark is skipping her title defense to play in the Korea LPGA’s KB Financial Star Championship, where she dropped into a tie for seventh Friday after a 2-over 73. \nEngland’s Charley Hull and China’s Lin Xi-yu, both 19, were tied for third at 7 under. Hull shot a 69, and Lin had a 70. Hull missed a 5-foot birdie putt on 18. \nSouth Koreans So Yeon Ryu (69) and Sun Young Yoo (71) were 5 under. Norway’s Suzann Pettersen followed her opening 74 with a 66 — the best round of the day — to move into a tie for seventh at 4 under. She won the event in 2012 and 2013 at Sunrise. \nAmerican Morgan Pressel and Germany’s Sandra Gal, tied for third after opening rounds of 68, dropped off the leaderboard. Pressel had a 75 to fall into a tie for 16th at 1 under, and Gal was tied for 36th at 2 over after a 78. \nTaiwanese star Yani Tseng was tied for 32nd at 1 over after a 73. She won the inaugural event in 2011 at Sunrise. Jessica Korda, the winner two weeks ago in Malaysia, and Michelle Wie were 2 over after their second straight 73s. \nThird-ranked Stacy Lewis was tied for 55th at 5 over after a 72. She opened with a 77, her worst score since a 78 in the final round of the 2013 U.S. Women’s Open. The American finished second last year at Miramar. \nThe tournament is third in the five-event Asian Swing. The Blue Bay LPGA is next week in China, followed by the Japan Classic. Topics:", "external_links": [], "published": "2015-10-23T11:56:00.000+03:00", "crawled": "2015-10-23T12:33:38.542+03:00", "highlightTitle": ""}