{"organizations": [], "uuid": "6c1ad2836882490331a46b7d572e2e069fd9613c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "wtop.com", "main_image": "http://wtop.com/wp-content/uploads/2015/10/Notre-Dame-Showtime.jpeg", "site_section": "http://wtop.com/section/sports/feed/", "section_title": "WTOP » Sections » Sports", "url": "http://wtop.com/ncaa-football/2015/10/showtime-notre-dame-players-mostly-enjoy-reality-limelight/", "country": "US", "title": "Showtime: Notre Dame players mostly enjoy reality limelight", "performance_score": 0, "site": "wtop.com", "participants_count": 1, "title_full": "Showtime: Notre Dame players mostly enjoy reality limelight", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:42:00.000+03:00", "replies_count": 0, "uuid": "6c1ad2836882490331a46b7d572e2e069fd9613c"}, "author": "wtopstaff", "url": "http://wtop.com/ncaa-football/2015/10/showtime-notre-dame-players-mostly-enjoy-reality-limelight/", "ord_in_thread": 0, "title": "Showtime: Notre Dame players mostly enjoy reality limelight", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Showtime: Notre Dame players mostly enjoy reality limelight By TOM COYNE October 22, 2015 8:42 pm In this Oct. 10, 2015 photo, Notre Dame head coach Brian Kelly, right, and Navy head coach Ken Niumatalolo are filmed on the field by Showtime before an NCAA college football game in South Bend, Ind. Showtime is filming a series “A Season With Notre Dame Football,” a behind the scenes show of what goes on during the week before the game _ and the game. (AP Photo/Jeff Haynes) \nSOUTH BEND, Ind. (AP) — Running back C.J. Prosise and wide receiver Chris Brown were locked in an intense game of video soccer. Just then, the Showtime camera crew following Notre Dame players this season started talking to Prosise. He wasn’t happy. \n“Of course, while I’m answering questions, Chris scores,” Prosise said. “So I’m like, ‘Dude, I can’t talk anymore!'” \nToo late. Brown won 1-0 and taunted his roomie. \nThe headaches have become part of the deal for players-turned-reality-stars for the cable series, “A Season with Notre Dame.” The show is similar to HBO’s “Hard Knocks,” which followed a single NFL team through training camp. \nFighting Irish players have had to adjust to a crew of about dozen following them daily. That number grows to more than 50 on game days. The 11th-ranked Irish (6-1) say it was awkward at first. \nEven for coach Brian Kelly. He says he has been in the bathroom and realized he’s still miked. \nStill, they are enjoying the attention. \n“At times it can be a little much, a little bit of a hassle. But it’s kind of cool to say you have your own TV show and you’re part of a TV show,” Prosise said. \nShowtime has shown Notre Dame in a positive light, though Kelly wasn’t happy it aired a teaser with him telling the team that tackle Ronnie Stanley was not able to accept being a captain. The scene wasn’t included in the program. Stanley later revealed the reason he couldn’t was because of parking violations. \nStephen Espinoza, executive vice president of Showtime sports, said the network apologized. He also said Showtime works with the university on story lines and putting the show together and retains control over program content. The school is aware of what scenes Showtime plans to use, but doesn’t see the full program until it airs. Espinoza said the network also understands it is about student-athletes and doesn’t want to embarrass anyone. Players had the option of signing releases and can ask not to be filmed when they choose. \n“This show can only be produced in collaboration,” he said. \nViewers have seen some lows, including the raw emotion of quarterback Malik Zaire after he broke his ankle to end his season. \nThey saw the stress of players studying for midterms while preparing for rival USC. \nBut they also saw the team being rewarded with a meal of porterhouse steaks and crab legs after beating Navy. \n“I like crab legs,” linebacker Joe Schmidt says. “It tastes like victory.” \nThey’ve eavesdropped on Kelly’s impassioned locker room speeches, telling players before USC: “If you want something bad enough, you’ve got to go take it. That’s how we’re playing this game. We’re gonna go get it.” \nThe Irish won 41-31. \nViewers also have seen the close relationship between defensive captain Sheldon Day and freshman Jerry Tillery, including Day hazing Tillery a bit by ordering him to wear his helmet during a preseason practice when going to a portable toilet. \n“To go to the bathroom?” Tillery asks. \nViewers have watched linebacker Jaylon Smith bowling, receiver Corey Robinson playing the ukulele and singing and Day and cornerback Cole Luke coaching a women’s flag-football team. During their off week, crews accompanied some players home. \nEspinoza said the network is pleased with the weekly 30-minute show. \n“There’s been a lot of drama within the program. Some unexpected injuries, some come-from-behind wins. We couldn’t have scripted it any better,” he said. \nThe first three episodes averaged 663,000 viewers across all platforms. That compares favorably with Showtime’s most popular sports series, “Inside the NFL,” and is the third-most watched program through its streaming service, Espinoza said. \nThe program has followed the emergence of quarterback DeShone Kizer, showing how dorm mates covered his door with sticky notes of support, saying: “You’re a stud,””You seem like a nice person,””Wow,” and “Thank you.” \nIt aired a talk Kizer had with fellow student Jac Collinsworth, whose brother, Austin, was a Notre Dame safety and whose father, Cris, was a three-time Pro Bowl receiver and now an NBC analyst. Kizer talks about how dramatically his life changed after Zaire was injured. \n“There’s no transition at all. Coach Kelly looks at me differently. He just expects me to be the starting quarterback at Notre Dame. Everyone just expects it. No one really understands … All of a sudden I have all this pressure and all this obligation that you have that I never really prepared myself for,” he said. \nKeiVarae Russell admits to Kelly before the USC game that one reason he’s been struggling after being suspended from school last season was he hasn’t been working hard enough at practice. \n“What, were you being a prima donna?” Kelly asks. \n“Yeah, kinda,” Russell replies. \n“Yes sir,” Russell responds. \n“Get the hell out of here,” Kelly says. \nRussell had an interception against USC and deflected another pass that was intercepted by safety Max Redfield. \nMiked up conversations also turn out to be amusing. \n“I wonder if the pope watches our games,” Schmidt says to roommate Jarret Grace. \n“I know,” Grace responds. \n“He should, if he doesn’t,” Schmidt says. \nStanley said despite being disappointed that the reason he was not allowed to be captain got out, he thinks the show is a good idea. \nEspinoza said Showtime is interested in doing another show next year with Notre Dame or another school. \n“What we’re looking for is a top-notch program with compelling stories and a really interesting coaching staff,” he said. Topics:", "external_links": [], "published": "2015-10-23T03:42:00.000+03:00", "crawled": "2015-10-23T04:00:40.350+03:00", "highlightTitle": ""}