{"organizations": [], "uuid": "3e8ce368daac8b963cf1c3d9311cbfc7a954216e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.milforddailynews.com", "main_image": "http://www.milforddailynews.com/storyimage/WL/20151010/SPORTS/151019437/AR/0/AR-151019437.jpg", "site_section": "http://www.milforddailynews.com/sports/local-sports?template=rss&mime=xml", "section_title": "Local Sports - Milford Daily News", "url": "http://www.milforddailynews.com/article/20151010/SPORTS/151019437/12190/SPORTS?rssfeed=true", "country": "US", "title": "High School Notebook: Medway girls soccer still kicking despite injuries", "performance_score": 0, "site": "milforddailynews.com", "participants_count": 1, "title_full": "High School Notebook: Medway girls soccer still kicking despite injuries", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T01:37:00.000+03:00", "replies_count": 0, "uuid": "3e8ce368daac8b963cf1c3d9311cbfc7a954216e"}, "author": "Dan Cagen/Daily News Staff", "url": "http://www.milforddailynews.com/article/20151010/SPORTS/151019437/12190/SPORTS?rssfeed=true", "ord_in_thread": 0, "title": "High School Notebook: Medway girls soccer still kicking despite injuries", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "High School Notebook: Medway girls soccer still kicking despite injuries It was only logical to think the Medway girls soccer team would be one of the better clubs in the Tri-Valley League this season. The Mohawks are, after all, the two-time defending league champions, played for the Division 3 South title last season, and return two Division I college players. Comment By Dan Cagen/Daily News Staff Milford Daily News By Dan Cagen/Daily News Staff Posted Oct. 10, 2015 at 5:35 PM Updated at 5:37 PM By Dan Cagen/Daily News Staff Posted Oct. 10, 2015 at 5:35 PM Updated at 5:37 PM It was only logical to think the Medway girls soccer team would be one of the better clubs in the Tri-Valley League this season. The Mohawks are, after all, the two-time defending league champions, played for the Division 3 South title last season, and return two Division I college players. So their 9-1-1 burst to start the season is not surprising. How they’ve gotten there, though, has been anything but expected. “It’s been a trying season, believe it or not,” coach Jason Rojee said. Rojee is in his 13th season walking the Medway sideline, and has never seen injuries like the one his team has been dealt this year. Junior Kaelyn Beach tore her quad in the summer and has yet to take the field, and may miss the whole season. Junior MacKensie Coakley hurt her back and has sat the last three weeks. Most recently was the loss of junior Emily Ertmann to a knee injury. “I feel like Bill Belichick — it’s next girl up,” Rojee says with a laugh. “That’s the attitude.” As the Patriots coach would say, the Mustangs have done their job. Rojee points to a handful of players that have stepped up and gotten the job done, allowing Medway to maintain its place at the top of the TVL — forward Alexa Rasmussen, central midfielder Anna Brewer and keeper Erin O’Rourke. Sisters Abby and Becca Murphy have stabilized the back end. “They’re both really smart and they’re tough as nails,” Rojee said of his the Murphys. “You’ve got to be both those things to be a good defender in our system. It’s one-on-one and in the system, and they’ve both really elevated our team. We can be more aggressive. It’s not that big a deal if someone gets free because we can rely on them back there.” The mental aspect, too, has been crucial in keeping Medway focused, allowing it to use its physical abilities to remain a top-division club. The Mustangs could have folded up and allowed the injuries to be debilitating, to cut the legs out from what had all the signs of a banner season. Senior Shannon Simmons will be playing soccer at the University of Connecticut next fall. A year later, Shannon Aviza will join her in the college ranks at Syracuse University. Sarah DiPillo has been a force for the Mustangs. None of them wanted their final season as teammates to be derailed so easily. “It starts at the top,” Rojee said. “Shannon Simmons, Shannon Aviza and Sarah DiPillo, they’re better off the field than on the field. They’re leaders. If your best players work harder than everyone else, it’s huge. Page 2 of 2 - “It’s having girls that are relentless, and those three give everything every day. I think that’s where it all starts.” And those three are setting the example for the next generation. Rojee is excited about his underclassmen, a group of sophomores and freshmen that could carry the torch after his current group has moved on. That’s important for Rojee, a former Medway boys soccer player who also coaches the boys basketball team. After a baker’s dozen worth of years, he’s building a program as much as coaching a team. And while he admits that this current run of success is as much good timing as anything —“In high school, you go through up and downs, cycles,” he says — there is belief that this current crop will snowball into future generations, keeping Medway relevant on the soccer scene. “The younger girls see that,” Rojee said. “They see our girls are playing club, and they commit to higher-level club teams. They want to do it — they want to be the next Shannon Simmons, the next Shannon Aviza.” While Rojee admits it’s still too early in the season to say this is the best team he’s had, the coach knows the opportunity this team has. There’s buckets full of talent — Medway has a 32-7 goal differential this season — and plenty of motivation after a shootout loss to Dedham in last year’s sectional final. The Mustangs’ lone loss was to Holliston, a defeat that sharpened their focus and showed the importance of coming to play each game. “I think the potential is what we have in front of us,” Rojee said. “We control our fate more than most teams do. If we step up and play our game, we’ll be tough to beat. I honestly think the Div. 3 South title is going to go through Dover or Dedham. We’ve got a tough bracket. Our goal now is just to get a little bit better every day so that when we’re in November, we’re playing our best of the season.\" It’s a goal that seems possible — as long as the injury gods start to cooperate. In the hall The Westborough High School Athletic Hall of Fame will induct six new members later this month. The Class of 2015 includes James Anderson, Colleen Debish, Steve DeBoer, Courtney (MacLean) Murphy, Tom Power, and Amanda (Young) Walker. The class will be honored at the Oct. 17 football game at the high school. Dan Cagen can be reached at 508-626-3848 or dcagen@wickedlocal.com. Follow him on Twitter @DanCagen. By Dan Cagen/Daily News Staff Milford Daily News By Dan Cagen/Daily News Staff Posted Oct. 10, 2015 at 5:35 PM Updated at 5:37 PM", "external_links": [], "published": "2015-10-11T01:37:00.000+03:00", "crawled": "2015-10-11T06:15:31.667+03:00", "highlightTitle": ""}