{"organizations": [], "uuid": "0b2362411ffefa2dfafc3606b4348b0f0e6cc57d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/haryana/councillor-s-driver-shot-in-gurgaon/141553.html", "country": "US", "title": "Councillor’s driver shot in Gurgaon", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "Councillor’s driver shot in Gurgaon", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "0b2362411ffefa2dfafc3606b4348b0f0e6cc57d"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/haryana/councillor-s-driver-shot-in-gurgaon/141553.html", "ord_in_thread": 0, "title": "Councillor’s driver shot in Gurgaon", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tribune News Service\nGurgaon, October 4\nThe driver of a Gurgaon councillor was shot dead, which triggered a retaliatory attack on Sunday that left a man dead and another seriously injured, in what police said was a ‘gang war.’ Two people have been arrested for their involvement in the gang war. Ashok Kumar (25), driver of a former gangster and Gurgaon councillor, Binder Gujjar, was found dead in a Maruti Swift parked on Basai Road. Ashok was close to Binder Gujjar of ward no. 16, also a yesteryears gangster. He has been involved in over a dozen cases of murder, attempt to murder, robbery and others. Gujjar himself was attacked by a group of criminals three years back. On Sunday morning, the police control room received information about a car parked on Basai Road. Preliminary investigation revealed, Ashok had dropped two of his friends around 2am and at 6am.The police booked two unidentified youth and started investigating, when another firing incident took place in Arjun Nagar at Gurgaon. The victim, Manish Khurana, was shot outside his house by six men. He received bullet injuries near his ear and was admitted to Medanta Medicity Hospital in a critical condition. Sources revealed Khurana, a member of Sandeep Gadauli gang, are Binder Gujjar’s rivals. They claimed Gujjar’s men shot Khurana to seek revenge for the death of Gujjar’s driver, Ashok. Meanwhile, the police detained two men for shooting Manish Khurana, an accomplice of Sandeep Gadauli on Sunday morning. Police have recovered two revolvers from the shooters that were used for the attack.", "external_links": [], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-05T12:29:22.553+03:00", "highlightTitle": ""}