{"organizations": ["Thurgood Marshall Academy", "Kelly Campbell", "Stone", "Wildcats", "Hilltoppers", "Riverside Hawks", "Grand Street", "Copiague", "Rutgers", "Hawks", "Campbell", "Royals", "PSAL", "Mary Louis Academy", "Red Bank Catholic", "Emilyae Ward", "DePaul"], "uuid": "9119710ff607618fbddf5e5acf5e5e795c89661a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "nychoops.rivals.com", "main_image": "", "site_section": "http://sebaseball.rivals.com/rss2feed.asp?type=HS&state=NY", "section_title": "New York High School Sports Headlines", "url": "https://nychoops.rivals.com/content.asp?CID=1810656", "country": "IE", "title": "Rose Classic (Sunday Recaps)", "performance_score": 0, "site": "rivals.com", "participants_count": 0, "title_full": "Rose Classic (Sunday Recaps)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T23:56:00.000+03:00", "replies_count": 0, "uuid": "9119710ff607618fbddf5e5acf5e5e795c89661a"}, "author": "", "url": "https://nychoops.rivals.com/content.asp?CID=1810656", "ord_in_thread": 0, "title": "Rose Classic (Sunday Recaps)", "locations": ["NY", "Sydney Zambrotta", "Brooklyn", "H.S.", "Grand Street", "Demry", "Long Island Lutheran", "New York", "New Jersey", "Long Island", "Connetquot H.S.", "Manasquan", "New York Belles"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Addie", "Margarita Kilpatrick", "Jasmine Brunson", "Mike Rice", "Mary", "Victoria Pearce", "Emily Engstler", "Patterson", "Kadaja Bailey", "Danielle Patterson", "Molloy", "John Vianney", "John", "Celeste Moran", "Sarah Mortensen", "Shaniqua Edwards", "Wentz", "Jenna Silletti", "Scanlan", "Daja Wentz", "Fitzgerald-Greer", "Campbell", "Brandy Thomas '18", "Thomas", "Dominique Toussaint", "Abdul-Aziz", "Aislinn Flynn", "Taylor", "Bishop Loughlin", "Stanners", "Saeeda Abdul-Aziz", "H.S.", "Celeste Taylor", "Khadija Demry", "Katie Rice", "Katie Foos", "Masonius", "Addie Masonius", "Mohonasen", "Engstler", "Brunson", "Alyssa Torres", "Foos", "Edwards"], "text": "Talk about it in the nychoops Message Boards BROOKLYN, NY - Sunday's action at the Rose Classic saw many of New York's top girl players take the court as they look to prepare for the upcoming H.S. seasons. It was an intriguing day of action that provided everyone on hand a great day of games from some of the top H.S. and AAU programs in the area.One of the marquee matchups saw Long Island Lutheran take on the New York Belles. It was a matchup of LuHi's youth versus Christ the King's youth as the Belles were comprised of many of the Royals underclassmen, while the Crusaders brought a team full of their underclassmen as well.That was just one of the excellent games of the day though as we are here to bring you a recap of everything that took place from J.H.S. 113 and Bishop Loughlin in Brooklyn on Sunday. Long Island Lutheran Take Down New York Belles, 51-46 While this was a game that featured LuHi and Christ the King (The Belles are comprised completely of Royals), it wasn't a game with many of the stars from both teams.This Belles/CK team is without Sydney Zambrotta '16 and Dominique Toussaint '16 , while this LuHi team is without Jenna Silletti '16 and star Danish import Sarah Mortensen '16 . But it was a good chance to see how the future of Long Island Lutheran would do against the future of Christ the King.It was a tight back and forth contest for the first 6 minutes of the opening half, but after that the Belles started to pull away behind the play of dominant post player Emily Engstler '18 .If it wasn't spin inside while finishing with either hand, it was a three pointer from the outside or a drive going down the wings. At 6'1\", Engstler looks much more polished and confident than she did at any time during her freshman year with Christ the King, and she nearly singlehandedly put the Belles up 25-11 late in the half. Grace Stone '18 was able to connect on back to back baskets late in the half off of pressure defense that allowed LuHi to chip the game back into single digits as they trailed at the half 25-16.Whatever momentum that the Crusaders were able to gain late in the first half, they continued to take into the second as Celeste Taylor '19 proved to be a difference maker for LuHi as she took matters into her own hands and took the game over.First it was a short jumper from about 10 feet out, and then it was a slash down the right baseline going by a pair of Belles defenders. Taylor was able to really dominate from all over the floor as she scored 10 straight points to help the Crusaders get all the way back and tie the game up at 26 with 11:28 to go in the game, and when Stone connected on a runner over Engstler, LuHi had their first lead since very early in the game.Taylor then came back and finished on a layup off a nice save by LuHi post player Aislinn Flynn '17 and after the Belles took a 25-11 lead it became all LuHi as the Crusaders went on a 31-6 run to run out to a 42-31 lead with just 5:16 to go.While the Belles looked down and out, Brandy Thomas '18 did allow them to get 5 straight points as she hit on a pair of FT's, and then a turnover by Long Island Lutheran allowed Thomas to connect on a three from the right side, but that was as close as they would go.It was just too much Taylor as the freshman played well beyond her years. Stone and Alyssa Torres '16 , a transfer from Connetquot H.S., also played big roles as well, and even though Engstler did all she could possibly do, plus even more, it was not enough as the perimeter play of Long Island Lutheran was too good as they were able to hold on for a 51-46 victory.Taylor had 20 of her team high 25 points in the all-important second half as she paced LuHi in the win, while Stone added 11 for the Crusaders in the win.Engstler, who will be asked to provide another big scoring option for Christ the King this year, scored a game high 27 points for the New York Belles, though she certainly looked the part of a future star. Positive Direction Quiets Exodus Elite, 45-39 While playing under the name of Positive Direction, this was really The Mary Louis Academy that took the court on Sunday as the entire Hilltoppers squad was in the lineup for this PD squad, and even though they struggled early on, it was a big second half from both Danielle Patterson '17 and Jasmine Brunson '16 that helped them propel past the Exodus youngsters by 6.This was the Exodus 2018 and 2019 stars, the stars of tomorrow if you will, that took the floor and in the early going they seemed to be handling the pressure of Positive Direction as Daja Wentz (Msgr. Scanlan '19) was able to drain a pair of threes, while Emilyae Ward (Copiague '18) directed the traffic well and allowed Exodus to take a 18-11 lead with 4:12 to go in the opening half.The dynamic duo of Patterson and Brunson struggled to get going for most of the first half but in the late going they combined for 8 points as they buckled down defensively as well to go to the locker room tied at 19.The second half saw Khadija Demry (Christ the King '19) turn up her game for Exodus, but Patterson, be it on the inside where she routinely was able score around double teams or from the outside where she displayed the ability to beat defenders and get to the rim, really imposed her will on the game, and when she wasn't it was Brunson who was able to knock down deep balls to see Positive Direction/TMLA take control. Celeste Moran '16 was strong on the glass as well for PD, and while Wentz continued to be a threat each time she touched the ball, there was just too much offensive fire power for Positive Direction as they took a double digit lead for the first time with 3:44 to go and they held on for the 45-39 victory.Patterson proved just how good and dominant she can be in the CHSAA this season as she had a game high 23 points to lead Positive Direction, while Brunson added 15 as the Hilltoppers looked strong in against a solid Exodus squad.Exodus was paced by Wentz as the young freshman had 15 points, while another freshman in Demry added 10 in a solid all around effort. Exodus Wildcats Edge Grand Street Campus 52-50 This Exodus team is based out of New Jersey and coached by former Rutgers men's head man Mike Rice . His daughter, Katie Rice (Red Bank Catholic, NJ '18) is on the team, and while she put together a solid performance, it was some big plays late from DePaul commit Kelly Campbell (St. John Vianney, NJ '16) that helped push the Wildcats to the 2 point win over Grand Street, a team many consider the favorite in the PSAL this season.For as good and close as this game was it was interesting for the fact that Grand Street led for a total of less than a minute in the entire game, a tribute to the talent and determination of Exodus.The Wildcats got going to start as they were able to really do damage against Grand Street Campus' perimeter defense by knocking down 6 first half three pointers as the duo of Addie Masonius (Manasquan, NJ '17) and Katie Foos (Rumson-Fair Haven, NJ '17) helped them bolt out to the quick lead with some hot shooting from downtown.With Exodus finding it easy to score from long range, Grand Street needed to find an answer, and though star forward Shaniqua Edwards '16 was able to do a nice job inside, it was Thurgood Marshall Academy transfer Star Fitzgerald-Greer '16 that really stole the show for the Wolves as she was versatile enough to finish strong both inside and outside, keeping her team in the game, just down 25-21 at the half.Edwards, who had just 6 points in the opening half after being hit with a lot of double teams when she touched the ball inside, made more of a conscious effort to get the ball on the outside, allowing her to use her ball handling skills to get to the rim and show she can knock down 12-15 footers on the outside.The combination of Edwards starting to attack the defense, along with Fitzgerald-Greer getting open looks seemed to allow Grand Street to take momentum away, but each time the Wolves had a chance to take the lead, an Exodus player had an answer.Campbell hit a clutch three pointer after Grand Street tied the game at 35, and along with older sister Addie, Faith Masonius (Manasquan, NJ '19) was able to dribble drive past defenders to finish strong against the bigger Wolves defenders inside.Neither team was able to pull away, nor down the stretch it looked like this one could be headed to OT as Edwards was not missing when she touched the ball, but Exodus did not seem to be relenting either.The game was tied at 50 after an elbow jumper by Edwards with 52 seconds to play, and while the Wildcats seemed rattled by the Grand Street press off the ensuing inbounds, they eventually broke the trap and after initially looking to hold for the last shot, Campbell was able to use a screen to go down the right side and finish uncontested with 11 seconds left to give Exodus the 2 point lead.Grand Street had one more chance and the ball found its way into Edwards hands, but she seemed to lose track of time at the top of the key, and after dribbling around the defense she could only get off a 25 foot heave that was well short as Exodus from New Jersey came down to Brooklyn and took down Grand Street Campus, 52-50.It was a true team effort from Exodus as the older Masonius had 13 points to lead the way, while Campbell and Foos each had 11 to help the Wildcats in the winning effort.It may not have been the result she wanted but Edwards was a true force to be reckoned with both in the paint and on the fastbreak as she had a game high 22 points to lead Grand Street Campus. Fitzgerald-Greer added 14 points as well for the Wolves in what was a heartbreaking loss for the local PSAL squad. Riverside Hawks (Red) Whup Archbishop Molloy, 59-36 The Stanners have been severely hampered by the loss of players to graduation, and add in a couple of key missing pieces on Sunday and that meant a tough road against a strong Hawks team.Led by the 22 points of Saeeda Abdul-Aziz (Mohonasen '17) , Riverside was able to take control early on and never look back as they went up by double digits just over 5 minutes in, running away with this one for the comfortable 23 point victory over Archbishop Molloy.Along with Abdul-Aziz it was Victoria Pearce (Bay Shore '17) who had 16 points, while young St. John's commit Kadaja Bailey (St. Mary's '18) added 15 as the Hawks easily handled the Stanners for the win.In defeat, it was a strong performance from Margarita Kilpatrick '17 as the solid perimeter threat knocked down 5 threes en route to an 18 point effort in the loss for Molloy. FEATURED PRODUCT", "external_links": [], "published": "2015-10-05T23:56:00.000+03:00", "crawled": "2015-10-06T05:53:45.338+03:00", "highlightTitle": ""}