{"organizations": [], "uuid": "7584516580705aa3c06f3d547b445d2edf553d00", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266381/sports-general", "section_title": "Sports: General - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30184526/tropic-ocean-airways-is-utilizing-its-entire-fleet-to-assist-relief-efforts-of-devastated-out-islands-of-the-bahamas", "country": "US", "title": "Tropic Ocean Airways Is Utilizing Its Entire Fleet to Assist Relief Efforts of Devastated Out Islands of the Bahamas.", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Tropic Ocean Airways Is Utilizing Its Entire Fleet to Assist Relief Efforts of Devastated Out Islands of the Bahamas. - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T13:01:00.000+03:00", "replies_count": 0, "uuid": "7584516580705aa3c06f3d547b445d2edf553d00"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30184526/tropic-ocean-airways-is-utilizing-its-entire-fleet-to-assist-relief-efforts-of-devastated-out-islands-of-the-bahamas", "ord_in_thread": 0, "title": "Tropic Ocean Airways Is Utilizing Its Entire Fleet to Assist Relief Efforts of Devastated Out Islands of the Bahamas.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The airline is utilizing both its wheeled aircraft and seaplanes to reach less accessible islands.\nFort Lauderdale, FL (PRWEB) October 05, 2015\nTropic Ocean Airways, a local South Florida based airline, initiated relief efforts to those affected by Hurricane Joaquin in the Bahamas. The airline operates a fleet of Cessna Grand Caravan wheeled and seaplanes. The all-weather aircraft have high cargo capacity to accommodate supplies. The team has been working with organizations in both the Bahamas and South Florida to support their assistance plan.\nTropic Ocean Airways sent three aircraft to the Bahamas yesterday full of supplies such as water, baby food, and nonperishable items. They have some aircraft and crew based in George Town, Bahamas, while the others will run between Fort Lauderdale and other islands. The crew include ex-military personnel with relief experience from the earthquake and tsunami devastation in Japan in 2011 as well as other highly experienced pilots. The seaplanes will deliver supplies to the less accessible outer islands of the Bahamas in desperate need such as Rum Cay, Crooked Island, and Clarence Town Long Island.\nThe airline is utilizing its entire fleet this week to support the relief efforts in the Bahamas. Some organizations who have contributed thus far are Sheltair Aviation , Resorts World Bimini , Jet Aviation in Nassau, [Strachan’s Aviation in George Town, Bahamas, as well as generous individuals who are friends and guests of Tropic Ocean Airways. Items are still being accepted. Please contact the travel team at Tropic Ocean Airways reservations(at)flytropic(dot)com or 1-800-767-0897 for more information.\nAbout Tropic Ocean Airways:\nFounded in 2009 by US Navy TOPGUN Graduate Rob Ceravolo, Tropic Ocean Airways LLC is an FAA-certified air carrier specializing in luxury private aviation throughout Florida and the Caribbean. The company is owned and operated by highly experienced military aviators and backed by leading business executives with 20 years of experience managing high-end portfolios. Their fleet of showroom-quality aircraft are always flown by two pilots ensuring safety remains their top priority.\nFor more information, or to inquire about Tropic’s services, please visit their website at http://flytropic.com , call a dedicated associate at 1-800-767-0897, or send an email to reservations(at)flytropic(dot)com.\nTo contact a member of Tropic Management, or inquire about company information, partnership requests, and advertising, you may send an email to media(at)flytropic(dot)com, or contact via phone at 1-800-767-0897 Ext. 113.\nVisit Tropic Ocean Airways social media sites to receive news updates, special offers, and leave feedback.\nFacebook: TropicOceanAirways\nTwitter: @flytropic\nInstagram: Flytropic\n //www.prweb.com/releases/2015/10/prweb13002073.htm\n ", "external_links": ["https://instagram.com/flytropic/", "http://www.sheltairaviation.com/florida-properties/fortlauderdale", "https://www.facebook.com/tropicoceanairways", "http://www.prweb.com/releases/2015/10/prweb13002073.htm", "http://rwbimini.com/", "https://twitter.com/flytropic"], "published": "2015-10-05T13:01:00.000+03:00", "crawled": "2015-10-05T12:15:24.217+03:00", "highlightTitle": ""}