{"organizations": [], "uuid": "7f09908725cc91d3a22cd39da6a170c84f8e5006", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.al.com", "main_image": "http://imgick.al.com/home/brightcove01/width620/img/6/260701696001/201510/153/260701696001_4572630608001_HeadToHead-AlabamaTenn.jpg?pubId=260701696001", "site_section": "http://impact.al.com/alabama/atom.xml", "section_title": "Alabama Sports", "url": "http://www.al.com/sports/index.ssf/2015/10/alcom_all-access_is_butch_jone.html", "country": "US", "title": "AL.com All-Access: Butch Jones wants to be the next SEC wannabe to nick Saban", "performance_score": 0, "site": "al.com", "participants_count": 1, "title_full": "AL.com All-Access: Butch Jones wants to be the next SEC wannabe to nick Saban", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T17:48:00.000+03:00", "replies_count": 0, "uuid": "7f09908725cc91d3a22cd39da6a170c84f8e5006"}, "author": "Kevin Scarbinsky | kscarbinsky@al.com", "url": "http://www.al.com/sports/index.ssf/2015/10/alcom_all-access_is_butch_jone.html", "ord_in_thread": 0, "title": "AL.com All-Access: Butch Jones wants to be the next SEC wannabe to nick Saban", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "What was Kevin Sumlin's biggest win as a head coach? Texas A&M 29, Alabama 24 in 2012. \nGus Malzahn's? Auburn 34, Alabama 28 in 2013. \nHugh Freeze's? Ole Miss 23, Alabama 17 in 2014. \nSee a pattern here? For three straight years, a relatively new SEC head coach has made a statement by taking down the elephant in the room known as Nick Saban for the first time. \nIs Butch Jones next? \nOne big win over the best program in college football won't guarantee you a championship or put you on the fast track to coaching greatness. Freeze and Sumlin have yet to win the SEC West, and one of them likely will eliminate the other from contention this year when they meet Saturday in Oxford. \nMalzahn has the 2013 SEC title in his pocket but came up short in the national championship game that season, and his Auburn program finds itself at something of a crossroads Saturday at Arkansas. \nFreeze is the only one of those coaches to beat Saban a second time, going back-to-back in September with the considerable assistance of five Alabama turnovers. The Rebels since have lost twice. One shining moment is hard to achieve and even harder to maintain, but if you get the better of Saban and the Crimson Tide for 60 minutes, you've made everyone sit up and take notice. \nOn Saturday in Tuscaloosa, Jones gets the chance at his first real signature win as the Tennessee head coach. It would be just as significant for him to end eight years of frustration for the Big Orange Nation in what used to be a great rivalry. \nRELATED: Hunt for Alabama-Tennessee hatred a short one on Main Street \nFalling into a 27-0 hole doomed them to defeat last year in Knoxville, but the Vols actually outscored Alabama 20-7 from there over the game's final 37 minutes. The 34-20 final score was by far the closest UT had come to Alabama since the Mount Cody block game in 2009 when the Tide survived Lane Kiffin's audition in Bryant-Denny Stadium 12-10. \nWas last year's Tennessee comeback led by explosive quarterback Joshua Dobbs a sign of progress for the Vols - or was it a mirage? \nRELATED: Hollis says Alabama adds to Tennessee's woes in the series \nCoaches who surprise the college football world by upsetting Saban for the first time tend to do it suddenly, not gradually. Sumlin and A&M did it in their first SEC season. Freeze and Ole Miss did it a year after getting shut out by Alabama 25-0. \nMalzahn and Auburn turned a 49-0 defeat upside down in his first Iron Bowl as a head coach. Lost in the delirium of the Kick Six was a 55-point swing of historic proportion. \nOf course, Alabama answered by hanging double nickels on Auburn in last year's 55-44 slice of revenge. \nJones has taken the slower and steadier approach. He lost his first Alabama-Tennessee game 45-10. Then came 34-20. If that trend holds, Smokey and company will be the ones puffing on cigars Saturday evening. \nAs logical and statistical as that sounds, don't hold your breath. \nThat's my take. What's yours? Bring it to AL.com All-Access, our daily chat and confessional from 10-11 a.m.", "external_links": [], "published": "2015-10-23T17:48:00.000+03:00", "crawled": "2015-10-23T18:49:23.471+03:00", "highlightTitle": ""}