{"organizations": ["Vidarbha Vivek M V"], "uuid": "7503b9d5d82fe2e2d980b52d8a88ada8412b87cc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deccanherald.com", "main_image": "http://www.deccanherald.com/page_images/original/2015/10/17/506863.gif", "site_section": "http://www.deccanherald.com/rss/sports.rss", "section_title": "Deccan Herald - Sports", "url": "http://www.deccanherald.com/content/506863/ganesh-jaffer-power-vidarbha.html", "country": "US", "title": "Ganesh, Jaffer power Vidarbha", "performance_score": 0, "site": "deccanherald.com", "participants_count": 0, "title_full": "Ganesh, Jaffer power Vidarbha", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T16:48:00.000+03:00", "replies_count": 0, "uuid": "7503b9d5d82fe2e2d980b52d8a88ada8412b87cc"}, "author": "", "url": "http://www.deccanherald.com/content/506863/ganesh-jaffer-power-vidarbha.html", "ord_in_thread": 0, "title": "Ganesh, Jaffer power Vidarbha", "locations": ["Vidarbha Ganesh"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Vidarbha   Ganesh", "Jaffer"], "text": "  Ganesh, Jaffer power Vidarbha Ganesh, Jaffer power Vidarbha Vivek M V,October 17,2015, Bengaluru, DHNS \nCricket Ranji Trophy : Karnataka bowled out for 350; Visitors end day 2 at 172/2 \nA disciplined effort with bat and ball saw Vidarbha gain a slight upper hand against defending champions Karnataka on the second day of their Group ‘A’ Ranji Trophy encounter here at the Chinnaswamy Stadium on Friday. Resuming from their overnight score of 298 for six, the hosts were undone by some quality seam bowling from Ravikumar Thakur (4/50) and their pursuit of posting a strong first innings total came crashing down. With their lower order showing no stomach for a fight, Karnataka were restricted to 350 in their first essay.In response, the Vidarbha batsmen – on the back of hard-earned yet quality half-centuries from Ganesh Satish (81 n.o.) and Wasim Jaffer (68), made steady progress and finished at a respectable 172 for two at stumps.As the pitch continued to play slow for the second consecutive day, the second wicket stand of 117 runs between Jaffer and Ganesh has not only boosted Vidarbha’s chances of getting past Karnataka’s first innings total but it has also given them a small opening to aim higher.Abhimanyu Mithun jolted Vidarbha in the very second over of their innings when he removed opener Faiz Fazal (1) cheaply. Joining forces at three for one, Jaffer and Ganesh blended solid technique with immense concentration to ease the pressure.A veteran on the domestic circuit, Jaffer’s ability to construct a smooth innings with minimum risks involved hurt the Karnataka bowlers. Displaying sheer class, Jaffer was the aggressor of the two and slammed ten fours en route to his 81st half-century in first-class cricket.Ganesh, rattled by a terrific bouncer from Mithun that thudded onto his helmet early in his innings, showed immense confidence and frustrated the Karnataka bowling unit with his patient knock. Interestingly, it was Ganesh’s first match against his home state after shifting allegiance from them in 2014.Call it familiarity of the team he has known for years or downright talent, Ganesh was on top of both spin and pace in equal manner and importantly, remained unbeaten, raising visions of more runs to come. A rare opportunity of dismissing Ganesh passed by Karnataka when his late cut off Shreyas Gopal was dropped by Vinay Kumar at first slip. Though a difficult chance, the hosts would have loved to see the back of Ganesh, who was then batting on 38. The right-hander made sure there were no more nervy moments for him and went on to strike eight fours and one maximum in his score of 81.J Suchith gave Karnataka the much-needed breakthrough in the final session when he dismissed Jaffer. But Ganesh and skipper S Badrinath, fit to play after a knee injury suffered on day one, forged an alliance of 52 runs between them and took Vidarbha to safety.However, all is not lost for Karnataka, who have their task cut out to go hard at the Vidarbha batsmen. On a day when wickets were hard to get, the champions can call themselves a tad unlucky, as a few close calls for leg before wicket were turned down.Earlier, Karnataka’s lower-order showed unnecessary urgency and fell apart quickly. Left-arm seamer Thakur used the new ball well but rash shots from the batsmen also aided Vidarbha as the Karnataka innings folded up early. score board KARNATAKA (I Innings; O/n: 298/6): Robin Uthappa lbw Wagh 59 (134b, 10x4), KL Rahul c Thakur b Fazal 21 (48b, 4x4), R Samarth c Badrinath b Bandiwar 20 (46b, 1x4), Manish Pandey b Thakur 104 (163b, 13x4, 1x6), Karun Nair lbw Thakur 58 (87b, 7x4, 2x6), CM Gautam c Sharma b Thakur 30 (38b, 6x4), Shreyas Gopal c Fazal b Wakhare 18 (41b, 3x4), J Suchith b Thakur 1 (6b), Vinay Kumar (run out) 22 (28b, 4x4), Abhimanyu Mithun c Badrinath b Bandiwar 10 (23b), S Arvind (not out) 2 (2b). Extras (LB-5) 5. Total (all out, 102.4 overs) 350.Fall of wickets: 1-49 (Rahul), 2-87 (Samarth), 3-118 (Uthappa), 4-266 (Nair), 5-267 (Pandey), 6-298 (Shreyas), 7-303 (Suchith), 8-316 (Gautam), 9-347 (Mithun).Bowling: Shrikant Wagh 14-1-50-1, Swapnil Bandiwar 20-3-74-2, Ravikumar Thakur 27.4-12-50-4, Faiz Fazal 16-4-57-1, Akshay Wakhare 25-1-114-1.VIDARBHA (I Innings): Faiz Fazal c Pandey b Mithun 1 (4b), Wasim Jaffer c Nair b Suchith 68 (120b, 10x4), Ganesh Satish (batting) 81 (226b, 8x4, 1x6), S Badrinath (batting) 21 (83b, 2x4). Extras (NB-1) 1. Total (for two wkts, in 72 overs) 172. Fall of wicket: 1-3 (Fazal), 2-120 (Jaffer). Bowling: R Vinay Kumar 16-5-31-0, Abhimanyu Mithun 14-5-31-1 (NB-1), S Arvind 15-6-32-0, Karun Nair 1-0-5-0, J Suchith 11-3-27-1, Shryeas Gopal 15-0-46-0.", "external_links": [], "published": "2015-10-16T16:48:00.000+03:00", "crawled": "2015-10-17T00:02:28.199+03:00", "highlightTitle": ""}