{"organizations": [], "uuid": "6e2373a8b3d74702a5e28ea25e91fa29f07e1a03", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxsports.com", "main_image": "http://a.fssta.com/content/dam/fsdigital/RSN/Kansas%20City/2015/10/11/PI-NFL-Chiefs-Alex-Smith-2-101114.vresize.1200.675.high.22.jpg", "site_section": "http://api.foxsports.com/v1/rss?partnerKey=zBaFxRyGKCfxBagJG9b8pqLyndmvo7UU&tag=kansas-city", "section_title": "FOX Sports Digital", "url": "http://www.foxsports.com/kansas-city/story/qb-alex-smith-trying-to-rally-kansas-city-chiefs-after-losses-injuries-101515?cmpid=feed:-sports-CQ-RSS-Feed", "country": "", "title": "QB Alex Smith trying to rally Chiefs after losses, injuries", "performance_score": 0, "site": "foxsports.com", "participants_count": 0, "title_full": "QB Alex Smith trying to rally Chiefs after losses, injuries", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T22:50:00.000+03:00", "replies_count": 0, "uuid": "6e2373a8b3d74702a5e28ea25e91fa29f07e1a03"}, "author": "", "url": "http://www.foxsports.com/kansas-city/story/qb-alex-smith-trying-to-rally-kansas-city-chiefs-after-losses-injuries-101515?cmpid=feed:-sports-CQ-RSS-Feed", "ord_in_thread": 0, "title": "QB Alex Smith trying to rally Chiefs after losses, injuries", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Alex Smith"], "text": "Updated Oct 15, 2015 at 4:02p ET \nKANSAS CITY, Mo. -- The nature of the position dictates that the quarterback is the leader, the one in the locker room that teams are supposed to rally around when times are tough and the outlook dire. When the quarterback is also a veteran, that tends to be doubly true. \nSo when Chiefs running back Jamaal Charles went down with a season-ending knee injury in the third quarter of last weekend's game against Chicago, and Kansas City lost another heartbreaker at home to fall to 1-4 on the season, people predictably turned their attention to Alex Smith. \nTheir question: What are you going to do now? \n\"Obviously, a four-game slide is hard,\" Smith replied. \"I think the natural thing as a young guy is to overcompensate, try to over-correct, to try to do too much. When you look back at these games and go over them, it's coming down to the little things.\" \nMissed blocking assignments. Dropped passes. Penalties. \n\"All those little things, it's the difference between winning and losing,\" he said. \"The margins are so small. This Sunday was a great example of that. I felt like there were a handful of plays -- you don't know when they're coming -- but that's part of doing your job.\" \nAfter Charles left the game, the Chiefs managed just 59 yards of total offense. They had a field goal blocked that could have helped seal a victory, and so many quick three-and-outs that the Bears had enough time to frantically rally for an 18-17 win. \nSmith was complicit in the collapse, going 16 of 30 for just 181 yards. \n\"Every guy on this team had a handful of plays that he wish he had back that would've changed the game. Every single guy, myself included,\" he said. \"And for me, yeah, a few of those came in the second half. If you make those, who knows? Changes the game.\" \nLookin' good! Flip through our photo album of NFL cheerleaders . Denny Medley / USA TODAY Sports \nMight have changed the season, too. The Chiefs are in jeopardy of having their playoff hopes vanish by the midway point, making Sunday's trip to Minnesota a virtual must-win situation. \nThat means a must-perform moment for Smith, who has struggled all year. His inability to throw deep downfield has been exposed, and the amount of pressure he's been under -- the Chiefs have allowed 22 sacks already -- has made him skittish in the pocket. \nThe result has been inconsistency for a quarterback who, while never a star, has at least been dependable. \n\"He's seen some ups and downs in his career, as far as wins and losses, and he's always battled through,\" Chiefs coach Andy Reid said. \"I think that's an important (characteristic) that he has that he can relay to our players, the guys around him -- how you reach a little deeper.\" \nLeadership is one of the reasons Reid and general manager John Dorsey traded for Smith in the first place. They sent two second-round picks to San Francisco for him, and hoped that by gambling with the future they would be able to solidify the present. \nSmith did enough to earn a contract extension, but his modest production this season has turned many fans against him. Suddenly, backup Chase Daniel is the most popular man in town. Outside of the Kansas City Royals, at least. \nSmith understands the fickle nature of the NFL. Opinions change every minute, whims in an instant. With a solid performance in Minnesota, he'll be back in many peoples' good graces, and with a victory over the Vikings, the Chiefs could be back on track. \nHe also understands that another loss could send everything headed in another direction. \n\"I mean, it's a sense of urgency,\" Smith said. \"If you're having to motivate people at this level, there's a problem. And it's usually not the case, guys don't get here unless they're internally motivated for the most part. And I think it's a matter of collectively doing it, just working it out. Continue to focus in and not let some of this stuff be a distraction.\" \nNotes: LB Tamba Hali did not practice Thursday with a knee injury. DT Dontari Poe (high ankle sprain) and LB Josh Mauga (lower leg injury) also remained sidelined and their availability against Minnesota is in question. Mauga missed last week's game against Chicago.", "external_links": [], "published": "2015-10-15T22:50:00.000+03:00", "crawled": "2015-10-16T02:21:13.353+03:00", "highlightTitle": ""}