{"organizations": [], "uuid": "d8df13d1f2e5e527d36c010fac85182453bddb06", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/2/8/151889/World/Region/Children-among-dead-in-Russian-strikes-on-Syria-Mo.aspx", "country": "EG", "title": "Children among dead in Russian strikes on Syria: Monitor - Region - World", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Children among dead in Russian strikes on Syria: Monitor - Region - World - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "d8df13d1f2e5e527d36c010fac85182453bddb06"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/2/8/151889/World/Region/Children-among-dead-in-Russian-strikes-on-Syria-Mo.aspx", "ord_in_thread": 0, "title": "Children among dead in Russian strikes on Syria: Monitor - Region - World", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Russian planes destroy Islamic State headquarter, camp in Syria: Reports Russian air strikes in Syria to last three to four months: Russian lawmaker Russia striking IS, Al-Nusra targets in Syria, like US: Lavrov Putin says claims civilians killed in Russian Syria air strikes 'information attack' Two children were among at least seven civilians killed in air strikes carried out by Russian warplanes in Syria's northwestern province of Idlib, a monitoring group said Friday, citing witnesses.\n\"Four civilians, including a child and a woman, were killed in raids conducted by Russian military aircraft,\" said the Syrian Observatory for Human Rights.\nThe air strikes hit the district of Jabal al-Zawiya, in an area under the control of Al-Qaeda's affiliate in Syria and other Islamist rebel groups, said the Britain-based monitor.\n\"Three other civilians, including a girl and a woman, were killed in bombing by these planes of the village of Habeet,\" in the same province that borders Turkey, said the group, which relies on a network of sources on the ground for its information.\nRussian air strikes on Syria have killed 28 people since they were launched on Wednesday, according to the Observatory.\nSyria's main opposition group accused Moscow of killing 36 civilians in the central province of Homs on Wednesday, but the Kremlin has denied any civilians were among the dead.\nRussian President Vladimir Putin has hit back at the allegations, describing them as \"information warfare\".\nMoscow says it is targeting the Islamic State jihadist group, but Washington and its allies suspect its military intervention is aimed at keeping in power President Bashar al-Assad under the guise of fighting \"terrorism\".\nIS is not known to be operational in the areas targeted by Russia on Thursday.", "external_links": [], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-02T22:29:27.673+03:00", "highlightTitle": ""}