{"organizations": [], "uuid": "7a9022780ea5857a4aa95038efe1aad75f930509", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nytimes.com", "main_image": "http://static01.nyt.com/images/2015/10/01/sports/01GIANTSweb/01GIANTSweb-facebookJumbo.jpg", "site_section": "http://www.nytimes.com/services/xml/rss/nyt/Sports.xml", "section_title": "NYT &gt; Sports", "url": "http://www.nytimes.com/2015/10/01/sports/football/giants-victor-cruz-leaves-practice-after-calf-injury-setback.html", "country": "US", "title": "Giants’ Victor Cruz Leaves Practice After Calf Injury Setback", "performance_score": 1, "site": "nytimes.com", "participants_count": 1, "title_full": "Giants’ Victor Cruz Leaves Practice After Calf Injury Setback - The New York Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T00:02:00.000+03:00", "replies_count": 0, "uuid": "7a9022780ea5857a4aa95038efe1aad75f930509"}, "author": "Bill Pennington", "url": "http://www.nytimes.com/2015/10/01/sports/football/giants-victor-cruz-leaves-practice-after-calf-injury-setback.html", "ord_in_thread": 0, "title": "Giants’ Victor Cruz Leaves Practice After Calf Injury Setback", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " The star wide receiver Victor Cruz, who on Sunday was expected to return to the Giants’ lineup for the first time in nearly a year, aggravated a strained left calf muscle that has been bothering him since mid-August and left practice Wednesday.\nThe Giants offered no diagnosis for the severity of Cruz’s injury, and Cruz was not available after practice, which is closed to the news media except for an early warm-up period.\nBut because Cruz has been hobbled by the calf for roughly six weeks and unable to practice, another setback to the same muscle could mean an indefinite absence.\nCruz has not played since Oct. 12, when he ruptured the patellar tendon in his right knee during a game in Philadelphia. Cruz said Monday that he expected to play Sunday against the Buffalo Bills and emphasized that he was running without pain or discomfort in either leg.\nContinue reading the main story Related Coverage Giants’ Victor Cruz Returns to Practice SEPT. 28, 2015 N.F.L. Thursday Matchup: Baltimore Ravens at Pittsburgh Steelers SEPT. 30, 2015 Analysis: Green Bay Packers’ Aaron Rodgers Outdoes Himself at Lambeau SEPT. 29, 2015 After Defeat, Jets Share Blame, Which Is Plentiful SEPT. 28, 2015 N.F.L. Roundup: Aaron Rodgers’s Five Touchdowns Lead Packers Over Chiefs SEPT. 28, 2015 In a statement from the team, Coach Tom Coughlin said: “Victor came out and tried to do individuals. He felt the calf again, and that’s all he did.”\nContinue reading the main story Sports Newsletter Get the big sports news, highlights and analysis from Times journalists, with distinctive takes on games and some behind-the-scenes surprises, delivered to your inbox every week.\nCoughlin was referring to a portion of practice when players work within groups before practicing as a team. Cruz was expected to be eased back into Wednesday’s practice. He ran some pass routes but never completed the practice. Customarily, especially under Coughlin, players who cannot practice do not play for the Giants.\nWide receiver Rueben Randle said he thought Cruz was running tentatively Wednesday, saying that Cruz did not look like himself.\nRandle added, “I don’t think he’s too far away, but I don’t think he’s quite there yet.”\nEli Manning, when asked about Cruz, answered: “He did some individuals and ran a few routes and that was about it. We’ll see how it goes.”\nAsked how disappointed he was to see Cruz, who has had three seasons with more than 70 receptions, sidelined again, Manning said: “We’re going about our business. We’ve got guys who have been playing and practicing. We’ve got a job to do.”\nWhile Odell Beckham Jr. has been productive for the Giants this season, and Randle had a strong performance last week, the Giants have been eagerly waiting to get Beckham and Cruz on the field at the same time. It is the combination Giants fans have been waiting to see as well.\n“It can be frustrating, but I just told him to not worry about it,” cornerback Prince Amukamara said of Cruz. “It’s a long, long season. It’s just one of those things. If it’s not right, it’s not right.”\nIn other injury news, left tackle Ereck Flowers, cornerback Dominique Rodgers-Cromartie and defensive end Robert Ayers practiced.\nLoading... Go to Home Page »\nSite Index The New York Times News World U.S. Politics N.Y. Business Tech Science Health Sports Education Obituaries Today's Paper Corrections Opinion Today's Opinion Op-Ed Columnists Editorials Contributing Writers Op-Ed Contributors Opinionator Letters Sunday Review Taking Note Room for Debate Public Editor Video: Opinion Arts Today's Arts Art & Design ArtsBeat Books Dance Movies Music N.Y.C. Events Guide Television Theater Video Games Video: Arts Living Automobiles Crossword Food Education Fashion & Style Health Jobs Magazine N.Y.C. Events Guide Real Estate T Magazine Travel Weddings & Celebrations Listings & More Classifieds Tools & Services Times Topics Public Editor N.Y.C. Events Guide TV Listings Blogs Cartoons Multimedia Photography Video NYT Store Times Journeys Subscribe Manage My Account Subscribe Subscribe Times Premier Home Delivery Digital Subscriptions NYT Opinion Crossword Email Newsletters Alerts Gift Subscriptions Corporate Subscriptions Education Rate Mobile Applications Replica Edition International New York Times", "external_links": ["http://static01.nyt.com/images/2015/09/29/sports/CITY-JETS/CITY-JETS-thumbStandard.jpg", "http://static01.nyt.com/images/2015/09/30/sports/29nfl-2/29nfl-2-thumbStandard.jpg", "http://static01.nyt.com/images/2015/09/30/sports/30RODGERSweb/30RODGERSweb-thumbStandard.jpg", "http://static01.nyt.com/images/2015/09/29/sports/29GIANTSweb/29GIANTSweb-thumbStandard.jpg", "http://a1.nyt.com/assets/article/20150928-155824/images/foundation/logos/"], "published": "2015-10-01T00:02:00.000+03:00", "crawled": "2015-10-01T01:08:07.975+03:00", "highlightTitle": ""}