{"organizations": [], "uuid": "76d3bb135dea6787a0a35f4f613c7a9a19aca95b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fox8live.com", "main_image": "http://WVUE.images.worldnow.com/images/7597429_G.jpg", "site_section": "http://www.fox8live.com/", "section_title": "New Orleans News, Weather, Saints - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "url": "http://www.fox8live.com/story/30336557/candidates-voters-get-ready-for-last-day-of-campaigning", "country": "US", "title": "Candidates, voters get ready for last day of campaigning", "performance_score": 0, "site": "fox8live.com", "participants_count": 1, "title_full": "Candidates, voters get ready for last day of campaigning - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T22:53:00.000+03:00", "replies_count": 0, "uuid": "76d3bb135dea6787a0a35f4f613c7a9a19aca95b"}, "author": "Written by: Chris Finch, Digital Content Director", "url": "http://www.fox8live.com/story/30336557/candidates-voters-get-ready-for-last-day-of-campaigning", "ord_in_thread": 0, "title": "Candidates, voters get ready for last day of campaigning", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Candidates running for office locally and statewide are making a final push to sway undecided voters.\nPolls open Saturday morning.\nIt has been a long journey for the gubernatorial candidates, but now after all of the critical campaign ads and quirky commercials, where many of the candidates pointed fingers at each other, voters will make their choices\nAccording to a recent Raycom Media poll, the top two candidates are Democratic State Representative John Bel Edwards and Republican U.S. Senator David Vitter.\nThe poll, which is more than a week old, shows that Edwards is in the lead with 24% percent, and Vitter is right behind him at 21%.\nDuring a FOX 8 and Raycom debate we hosted Monday, Edwards took the stage along with Public Service Commissioner Scott Angelle, and Lt. Governor Jay Dardenne. Vitter chose not to attend.\nThe candidates were asked about the biggest issues facing the state like higher education, which all the attending candidates agreed needs more funding.\nAs far as fixing the budget deficit, Dardenne wants to start with cuts to inefficient areas of government.\nAngelle and Edwards agreed they would look at trimming tax credits.\nAll three agreed that addressing mental health issues are important.\nAngelle said he would ask for a statewide assessment of within the first 180 days of office.\nEdwards said he would make sure databases show who should not have a gun by virtue of criminal conduct or mental illness.\nDardenne said we need more beds without constructing new buildings.\nAside from the Governor's race, voters will also take to the polls this Saturday to decide the next Jefferson Parish president.\nKenner mayor Mike Yenni and Councilman-at-Large Elton Lagasse are vying to become the parish's next president.\nBoth say code enforcement and economic development are their top priorities.\nOutgoing Parish President John Young is running for lieutenant governor against former Plaquemines Parish President Billy Nungesser and Baton Rouge\nMayor Kip Holden, among others, including Elbert Guillory.\nIn St. Bernard, Parish President Dave Peralta will fight to stay in office.\nHe is running against several other candidates while facing indictments in three parishes.\nPeralta has pleaded not guilty to nearly two dozen corruption charges.\n Copyright 2015 WVUE . ", "external_links": [], "published": "2015-10-23T22:53:00.000+03:00", "crawled": "2015-10-24T04:50:29.980+03:00", "highlightTitle": ""}