{"organizations": [], "uuid": "8717ae3053d5106437c70f3710f041a0b71e0bbe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/2/8/161244/World/Region/Pentagon-says-Khorasan-Group-leader-killed-in-Syri.aspx", "country": "EG", "title": "Pentagon says Khorasan Group leader killed in Syria air strike - Region - World", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Pentagon says Khorasan Group leader killed in Syria air strike - Region - World - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "8717ae3053d5106437c70f3710f041a0b71e0bbe"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/2/8/161244/World/Region/Pentagon-says-Khorasan-Group-leader-killed-in-Syri.aspx", "ord_in_thread": 0, "title": "Pentagon says Khorasan Group leader killed in Syria air strike - Region - World", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Russian intervention in Syria upsets all calculations on the ground: Syrian opposition Russia's aim in Syria is defeat of Islamic State, not prop up Assad: PM Medvedev Senior al-Qaeda commander killed in an airstrike in Syria Scottish nationalists to oppose any UK anti-ISIS air strikes in Syria The leader of a group of Al-Qaeda veterans which Washington calls the Khorasan Group has been killed in a coalition air strike in Syria, the Pentagon said Sunday.\nSanafi al-Nasr, a Saudi national also known as Abdul Mohsen Abdullah Ibrahim al-Sharikh, was killed in an air attack in the northwest of the country Thursday, it said.\n\"This operation deals a significant blow to the Khorasan Group's plans to attack the United States and our allies,\" Secretary of Defense Ash Carter said in a statement.\nSyrian Observatory for Human Rights, a Britain-based monitoring group, had reported al-Nasr's death on Friday, saying he was killed in a strike in Aleppo province.\nAl-Nasr was listed as a \"specially designated global terrorist\" by the US Treasury Department in 2014. He had been erroneously reported dead in the past.\n\"The United States will not relent in its mission to degrade, disrupt and destroy Al-Qaeda and its remnants,\" added Carter.\nThe Pentagon described al-Nasr as a \"long-time jihadist\" who funneled money and fighters for Al-Qaeda and said he was the fifth senior Khorasan Group leader killed in the last four months.", "external_links": [], "published": "2015-10-18T03:00:00.000+03:00", "crawled": "2015-10-19T08:05:08.295+03:00", "highlightTitle": ""}