{"organizations": ["Hamilton Tiger-Cats", "Saskatchewan Roughriders"], "uuid": "ae302190bdd48354feeb77fb52498eaaed69c7b8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leaderpost.com", "main_image": "http://www.leaderpost.com/cms/binary/11428986.jpg", "site_section": "http://rss.canada.com/get/?F278", "section_title": "Leader-Post - Sports", "url": "http://www.leaderpost.com/sports/football/roughriders-football/roughriders+playoff+chase/11428985/story.html", "country": "CA", "title": "Roughriders bow out of playoff chase", "performance_score": 0, "site": "leaderpost.com", "participants_count": 0, "title_full": "Roughriders bow out of playoff chase", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T09:39:00.000+03:00", "replies_count": 0, "uuid": "ae302190bdd48354feeb77fb52498eaaed69c7b8"}, "author": "", "url": "http://www.leaderpost.com/sports/football/roughriders-football/roughriders+playoff+chase/11428985/story.html", "ord_in_thread": 0, "title": "Roughriders bow out of playoff chase", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tiquan Underwood", "Peter Power"], "text": "Roughriders bow out of playoff chase Hamilton Tiger-Cats receiver Tiquan Underwood celebrates after a touchdown catch against the host Saskatchewan Roughriders on Friday night. Photograph by: Peter Power , THE CANADIAN PRESS \nHAMILTON — It’s goodbye playoffs and hello next year for the Saskatchewan Roughriders. \nThe Riders’ faint post-season hopes were finally extinguished as a result of Friday’s 30-15 CFL loss to the host Hamilton Tiger-Cat. The defeat left the Riders with a league-worst 2-13 record heading into their bye week. The Tiger-Cats improved to 9-5. \n“It’s always disappointing to not make the playoffs and to give yourself a chance to go to the Grey Cup,’’ Riders defensive back Tristan Jackson said as 24,222 spectators were filing out of Tim Hortons Field. “It was just how our season was going. We just have to finish strong and prepare for next season or whatever will happen next.’’ \nSaskatchewan is off until Oct. 24 — when they play host to the Edmonton Eskimos at 5 p.m. — after entering their second bye week of the season. Saskatchewan closes out the regular season with road games against the Calgary Stampeders (Oct. 31) and Montreal Alouettes (Nov. 8). \nThe bye week won’t be sweet for the Riders after Friday’s defeat. \n“Like this season, it’s going to be tough to go home with a 2-13 record,’’ Jackson said. “I don’t care who or what you look at ... the injuries or all of the young players. It has just been a tough year.’’ \nThe Riders won’t have anything meaningful to play for, at least with regard to the post-season, when they do return. Yet, some players feel there will still be some meaning to Saskatchewan’s remaining three regular-season games. \n“They will say a lot about who we are and how we’re going to finish,’’ said running back Jerome Messam. “You’re going to see a lot of guys getting some opportunities so that will be good to see.’’ \nInterim head coach Bob Dyce said he would use the bye week to talk about what happened and what’s ahead for the Riders with interim general manager Jeremy O’Day. \n“We have a week off where we can sit back and talk about other things,’’ Dyce said. “There have been some significant events that have happened this season. We’ll go back, analyze and go forward.’’ \nThe Riders had every intention of going forward after Friday’s game. The Riders took a backward step in Friday’s first half, during which they were soundly outplaye. Quarterback Jeff Mathews, making just his second CFL start, completed two touchdown passes in the first half as the Tiger-Cats raced into a 20-0 lead. \nIt was the second consecutive week in which the Riders had been lit up by a young quarterback. Last Saturday, B.C.’s Jonathon Jennings threw four touchdown passes and caught another TD pass as the Lions thumped the visiting Riders 46-20. \n“Both of those guys are pretty good,’’ Jackson said. “I don’t know what it is. We didn’t make plays when we should have made plays and they made big plays. It’s just on us.’’ \nOn Friday, Riders quarterback Kevin Glenn wasn’t able to generate much first-half offence. He completed 11 of 17 passes for 67 yards and was intercepted once. \nBrett Smith replaced Glenn in the second half. Smith completed 11 of 20 passes for 243 yards and was intercepted once in the second half. He connected for touchdown passes with Weston Dressler (89 yards) and Ryan Smith (68 yards). Brett Smith and Ryan Smith also hooked up on a two-point convert. \n“It was nice to see some offence generated, but there wasn’t a lot pleasing in that game,’’ Dyce said. \nDyce felt that replacing Glenn, who declined to talk to the Leader-Post after Friday’s game, was the best move to help the Riders win. \n“It certainly wasn’t representative of Kevin’s play,’’ Dyce said. “We had some balls put on the ground in the first half and we had zero points. We made to make some changes and make things happen in the second half. That’s the decision that I went with.’’ \nOverall, Mathews completed 22 of 33 passes for 385 yards and wasn’t intercepted while completing three touchdown passes. Tiquan Underwood, Terrell Sinkfield and Luke Tasker caught touchdown passes. Justin Medlock connected on all three of his field-goal attempts.", "external_links": [], "published": "2015-10-10T09:39:00.000+03:00", "crawled": "2015-10-11T08:28:18.594+03:00", "highlightTitle": ""}