{"organizations": [], "uuid": "4edf2e9853fef9caae926950dbccd4866c3ddbf8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mercurynews.com", "main_image": "http://local.mercurynews.com/common/dfm/assets/logos/1200x627/mercurynews.png", "site_section": "http://feeds.mercurynews.com/mngi/rss/CustomRssServlet/568/200904.xml", "section_title": "Other Sports", "url": "http://www.mercurynews.com/sports/ci_28989162/local-sports-digest-stanford-mens-soccer-extends-streak?source=rss", "country": "IL", "title": "Local sports digest: Stanford men's soccer extends streak", "performance_score": 0, "site": "mercurynews.com", "participants_count": 1, "title_full": "Local sports digest: Stanford men's soccer extends streak", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T07:10:00.000+03:00", "replies_count": 0, "uuid": "4edf2e9853fef9caae926950dbccd4866c3ddbf8"}, "author": "Bay Area News Group", "url": "http://www.mercurynews.com/sports/ci_28989162/local-sports-digest-stanford-mens-soccer-extends-streak?source=rss", "ord_in_thread": 0, "title": "Local sports digest: Stanford men's soccer extends streak", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Local sports digest: Stanford men's soccer extends streak Bay Area News Group Posted: 10/18/2015 08:02:17 PM PDT Updated: 10/18/2015 08:06:08 PM PDT Stanford sophomore Corey Baird got his first two goals of the season, junior Jordan Morris scored a goal for the fifth consecutive game, and the No. 3 Cardinal beat host San Diego State 3-1 on Sunday. \nThe win extended Stanford's unbeaten streak to 12 matches, the second-longest stretch in program history. The longest was 20 matches in 1996-97. Coupled with Friday's victory at UCLA, it's the first time the Cardinal (11-1-1, 4-0-1 Pac-12) has earned six points on a conference road weekend since 2006 when it defeated Washington and Oregon State. \nSan Diego State dropped to 6-5-2 overall, 1-4-0 in the Pac-12. \nSanta Clara (6-7-1, 1-1-1 WCC) and visiting Pacific (1-11-1, 0-2-1) played to a scoreless draw. \nWill Kendall's header in the 98th minute gave Saint Mary's (5-8-1, 2-1-0 WCC) a 1-0 victory at USF (4-10-0, 2-1-0). Men's golf Maverick McNealy shot a 5-under-par 67 to finish in a four-way tie for individual honors at the U.S. Collegiate Championship in Atlanta. McNealy was 6-under 210 for the three rounds. The Cardinal was sixth overall, 14 strokes behind Auburn and Wake Forest, which tied for first. \nFreshman Collin Morikawa made eight birdies on his way to an individual-best 5-under-par 67 to help put Cal atop the leader board after the first day of the Tavistock Collegiate Invitational in Windermere, Florida. The Bears were at 9-under 279, five strokes ahead of second-place South Carolina. Advertisement Women's golf Stanford was first, two shots ahead of UCLA and Washington, after the first round of the Stanford Intercollegiate. Cal was in a three-way tie for seventh, 10 strokes behind the Cardinal. Stanford's Casey Danielson and Quirine Eijkenboom were among four players tied for sixth among individuals at even-par 71. The Cardinal's Shannon Aubert and Cal's Hannah Suh were among five players at 72. \nSan Jose State was 17th in the team standings, led by My Leander's 3-over 74. Men's water polo Luca Cupido scored three goals, and No. 3 Cal held off No. 7 UC Irvine 12-10 at Spieker Aquatics Complex. Colin Mulcahy, Johnny Hooper, Odysseas Masmanidis and Conor Neumann each scored two goals, and Vassilis Tzavaras added one for the Bears (16-3, 2-0 Mountain Pacific Sports Federation). Kyle Trush led UC Irvine (11-6, 1-2) with three goals. \nNo. 4 Stanford (14-6, 0-3 MPSF) lost 11-7 to No. 5 Pacific (16-2, 3-0) in Stockton. Adam Abdulhamid scored two goals for the Cardinal. \nTop-ranked UCLA (17-0) won 10-0 over San Jose State (2-14). Women's soccer Arielle Ship and Ifeoma Onumonu scored goals to lead No. 23 Cal (11-3-2, 4-2-0 Pac-12) to a 2-0 win against Utah (5-7-3, 2-4-0) at Edwards Stadium. The Bears won their fifth straight. \nNo. 19 Santa Clara (10-5-0, 3-1-0 WCC) won 1-0 at Portland (6-9-0, 2-3-0) on Janae Gonzalez's goal. Women's volleyball Lara Vukasovic had 17 kills as Cal (7-12, 1-7 Pac-12) defeated Utah 22-25, 25-13, 12-25, 25-19, 15-11 in Salt Lake City. \nStanford freshman Hayley Hodson had 22 kills, but the No. 6 Cardinal (11-5, 5-3 Pac-12) lost 23-25, 25-27, 25-23, 21-25 at Colorado (12-8, 4-4). Field hockey Sarah Helgeson, Katie Keyser, Fran Tew and Clemence Couteau scored goals as No. 12 Stanford defeated visiting Cal 4-0. The Cardinal (10-4, 2-2 America East) outshot the Bears (9-6, 3-1) 14-4. Surfing Brazilian Rafael Teixeira won the O'Neill Coldwater Classic in Santa Cruz. Derek Peters finished second, Randy Bonds third and Chris Waring fourth.", "external_links": [], "published": "2015-10-19T07:10:00.000+03:00", "crawled": "2015-10-19T07:56:14.142+03:00", "highlightTitle": ""}