{"organizations": [], "uuid": "7da0366c06773965a59ab56bfe51267a0e94f967", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.oregonlive.com", "main_image": "http://imgick.oregonlive.com/home/olive-media/width620/img/opinion_impact/photo/14672471-standard.jpg", "site_section": "http://www.oregonlive.com/", "section_title": "Oregon Local News, Breaking News, Sports &amp; Weather - OregonLive.com", "url": "http://www.oregonlive.com/opinion/index.ssf/2015/10/odds_still_favor_hillary_clint.html", "country": "US", "title": "Odds still favor Hillary Clinton: Albert Hunt", "performance_score": 0, "site": "oregonlive.com", "participants_count": 6, "title_full": "Odds still favor Hillary Clinton: Albert Hunt | OregonLive.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T23:00:00.000+03:00", "replies_count": 5, "uuid": "edc56d978887b48ac5c33b2fb68ac300980405c4"}, "author": "Syndicated columns", "url": "http://www.oregonlive.com/opinion/index.ssf/2015/10/odds_still_favor_hillary_clint.html#post-0", "ord_in_thread": 0, "title": "Odds still favor Hillary Clinton: Albert Hunt", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Albert Hunt\nIf you had asked any oddsmaker in January to pick the most likely next U.S. president, Hillary Clinton would have been the overwhelming choice.\nSince then, the former secretary of state has had a dreadful year, rivaled in political misery only by those of Jeb Bush, Rand Paul and a few Republican contenders who had to drop out.\nNonetheless, if you asked those oddsmakers the same question today, before the first Democratic presidential debate Tuesday, the answer still would be Clinton.\nThis time, however, that assessment wouldn't reflect her strength, but rather the lack of a strong alternative at this stage. Even Democrats worried about her general election prospects -- a growing population -- dismiss the possibility of her rival Bernie Sanders winning the nomination. And they are skeptical that Vice President Joe Biden will run or, if he did jump in, that he would win. The Republicans are in such chaos that a pathway to victory appears elusive.\nYet looking at Clinton's problems, and some of her less-often-cited promise, suggests how on the mark those odds may be.\nHer cavalier and clumsy reaction to the controversy over the use of her private e-mail system as secretary of state is a case study in arrogance and poor political instincts. There probably isn't a smoking gun and the House Republicans' Benghazi investigative committee, before which she will testify next week, has been discredited as a partisan assault.\nYet she has taken a hit in the polls; voters don't like revisiting the trials and tribulations of Clintonland.\nThe campaign makes surprising blunders, leaking stories about tactics -- Hillary will offer a softer image-- or her electoral firewalls.\nDemocratic professionals say that, in contrast to her last presidential campaign, she has strong leadership with John Podesta as chief executive and Robby Mook as campaign manager or chief operating officer. Privately, however, there is concern that crisis management sometimes comes down to a small coterie of personal intimates, her daughter, Chelsea, and Huma Abedin, a longtime aide and surrogate daughter.\nStill, there are also encouraging signs for her supporters. After stiffing the media for the first part of her campaign, Clinton has done well in a series of recent interviews. She hates the press but does better when she engages.\nNo campaign has offered more substance, even if it was overshadowed by the e-mail contretemps. To be sure, some of this is politically calculated: Her biggest threat would be losing the first few nominating contests to Sanders, so her campaign is determined to protect the left flank.\nHer only really egregious act of pandering was her announcement last week that she opposed the Trans-Pacific Partnership, the trade agreement involving the U.S. and 11 countries, which will encompass 40 percent of the global economy. She long supported such a pact; her stated rationale for opposing it was specious and added to questions about her credibility or trustworthiness.\n(Some of the outrage from the Washington establishment, while justified, contrasts with the silence when it come to the disingenuous pandering of others: Jeb Bush's flip-flops on discrimination under the guise of protecting religious expression, or John Kasich who, under the shadow of Donald Trump, endorsed a wall along the Mexican border.)\nThere's a lot of real meat elsewhere. No one has offered a more sensible or feasible proposal to deal with the crushing debt imposed on many families by the costs of college. The same holds for her proposals to establish a sliding-scale capital gains tax rate, her focus on longer term economics, and initiatives to give financial regulators more powers and to impose a \"risk fee\" on big banks.\nThese offerings have drawn fire from the left and the right. But the financial measures were carefully crafted: She consulted experts including top Wall Street executives and former Rep. Barney Frank. Her July remarks on \"quarterly capitalism\" was one of the best economic speeches of this political season.\nThe two big tests she faces over the next 10 days -- the debate and the Benghazi hearings -- are opportunities to reaffirm the current odds and overcome much of this year's self- inflicted damage.\n-- Albert Hunt is a Bloomberg columnist.\nFor more columns from Bloomberg View, visit http://www.bloomberg.com/view\n(c) 2015, Bloomberg View.", "external_links": ["http://www.bloomberg.com/view"], "published": "2015-10-12T23:00:00.000+03:00", "crawled": "2015-10-13T04:13:42.952+03:00", "highlightTitle": ""}