{"organizations": [], "uuid": "748b1c78a101b6a3d0f28d6de4dbda7dfc6b132a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.northlandsnewscenter.com", "main_image": "http://media.northlandsnewscenter.com/images/ice39.jpg", "site_section": "http://www.northlandsnewscenter.com/sports/index.rss2", "section_title": "KBJR - Sports", "url": "http://www.northlandsnewscenter.com/sports/On-the-Leading-Edge-of-Competitive-Cheer-331179512.html", "country": "US", "title": "On the Leading Edge of Competitive Cheer", "performance_score": 0, "site": "northlandsnewscenter.com", "participants_count": 0, "title_full": "On the Leading Edge of Competitive Cheer", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T05:41:00.000+03:00", "replies_count": 0, "uuid": "748b1c78a101b6a3d0f28d6de4dbda7dfc6b132a"}, "author": "", "url": "http://www.northlandsnewscenter.com/sports/On-the-Leading-Edge-of-Competitive-Cheer-331179512.html", "ord_in_thread": 0, "title": "On the Leading Edge of Competitive Cheer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "On the Leading Edge of Competitive Cheer \nBy Norman Seawright III October 7, 2015 Updated Oct 7, 2015 at 9:41 PM CDT \nDuluth, MN (NNCNOW.com) -- As a fifth-grader, Cloquet native Chelsie Waller knew what her passion was—and it was thanks to a movie. \n\"I was in fifth grade when 'Bring It On' came out,\" she said. \"I went to my sister who was eight years older than me and said, 'I want to do that.'\" \nClick here to subscribe to our daily newsletter. \nBy \"that,\" Waller really meant competitive cheerleading. Sideline cheerleading didn't do it for her (she did that for a year at the University of Minnesota-Duluth), and she followed up on her dream by opening Ideal Cheer Elite—the first (and, so far, only) of its kind in Duluth. She wants, more than anything, to grow the competitive aspect of the sport. \n\"We're not a dance studio,\" Waller said. \"We're not a gymnastics gym.\" \nThough those two things exist, and stand on their own merits as sports, they aren't competitive cheer. Waller's group is an All-Star program, meaning that it isn't affiliated with a school—and what they do, is train for competition. \nTo support her, Waller has coaches who focus on each of the group's teams—all of which compete at different levels. \n\"The most rewarding thing, I think, would be everyone coming together as a family,\" said Megan Kruger, one of the coaches. \"I got to know a lot of people I never would have known if I hadn't started coaching.\" \nThe coaches share the same passion, and are thrilled when the students begin to love the sport as well. \nCoach Amanda Anagnos said what is most rewarding to her is \"seeing the athletes love it just as much as I did when I cheered, and seeing them want to work for that goal.\" \nThe goal is to get as close to perfection as possible; not practicing to get routines right, but practicing until the team can no longer get the routines wrong. \n\"All the judges see is two-and-a-half minutes on that blue mat,\" Waller said. \"Make it or break it.\" \nBecause Waller and her coaches travel annually to Chicago to learn from nationally-known names and programs in cheerleading, they are able to elevate the sport at the high school and collegiate levels. St. Scholastica's squad decided it could benefit from her instruction. \n\"If you're just clapping, that's great,\" said Saints captain Shannon Phelps. \"But it's not exciting.\" \nIn its third season, Ideal Cheer Elite is well on its way to accomplishing the goal of elevating the sport of cheerleading in Duluth.", "external_links": [], "published": "2015-10-08T05:41:00.000+03:00", "crawled": "2015-10-08T10:39:08.410+03:00", "highlightTitle": ""}