{"organizations": ["Lone Star State", "University of Texas Rio Grande Valley"], "uuid": "adec64eac233d5d38a47c2427c3e16bd28470ab7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deseretnews.com", "main_image": "http://img.deseretnews.com/images/article/hires/200/200.jpg", "site_section": "http://www.deseretnews.com/sports/uvu/index.rss", "section_title": "Utah Valley University sports scores, stats, schedules and UVU news - Deseret News", "url": "http://www.deseretnews.com/article/865638575/Mens-soccer-23rd-ranked-UVU-Wolverines-head-to-Lone-Star-State.html", "country": "US", "title": "Men's 23rd-ranked Wolverines head to Lone Star State", "performance_score": 0, "site": "deseretnews.com", "participants_count": 0, "title_full": "Men's soccer: 23rd-ranked UVU Wolverines head to Lone Star State | Deseret News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "adec64eac233d5d38a47c2427c3e16bd28470ab7"}, "author": "", "url": "http://www.deseretnews.com/article/865638575/Mens-soccer-23rd-ranked-UVU-Wolverines-head-to-Lone-Star-State.html", "ord_in_thread": 0, "title": "Men's 23rd-ranked Wolverines head to Lone Star State", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "No. 23 heads to the Lone Star State this week for a pair of WAC matches beginning with the University of Texas Rio Grande Valley on Friday at 7 p.m. CT.\nMore Coverage Utah Valley women set to host WAC foes New Mexico State, UTRGV No. 23 heads to the Lone Star State this week for a pair of WAC matches beginning with the University of Texas Rio Grande Valley on Friday at 7 p.m. CT/. On Sunday, the Wolverines face Houston Baptist at 1 p.m. Friday's game can be seen live on the WAC Digital Network.\nThe Wolverines (9-2-0, 2-0-0) moved up two spots in the NSCAA Top 25 Coaches Poll on Tuesday, after debuting at No. 25 on Sept. 29. UVU also moved into the College Soccer News Top 30 Poll on Monday, also at No. 23. Of its final eight regular season games, Utah Valley will play five on the road starting with this weekend's contests.\n\"We've been a very disciplined and focused team on the road and this weekend in Texas will be no exception,\" UVU head coach Greg Maas said. \"UTRGV and HBU are organized and athletic sides, and we will need to execute our game plan in order to secure two good results on the road.\"\nAbout the opposition\nUTRGV is coming off the first-year program's biggest win to date, a 1-0 victory at UNLV on Sunday. The Vaqueros (4-5-1, 1-1-0) fell, 1-0, at Grand Canyon in the WAC opener last Friday. Nine scored goals for UTRGV with three players tied for the team lead with two apiece. Goalkeeper Leo Castillo was named the WAC Defensive Player of the Week after recording the shutout win at UNLV.\nHouston Baptist, one of five affiliate members of the WAC in men's soccer, is an old Great West Conference foe of Utah Valley. The Huskies are 4-6-0 overall and 0-2-0 in the WAC and will host Seattle U on Friday night. HBU lost at UNLV (2-1) and at Grand Canyon (3-1) last weekend but enter this week at 2-0-0 at home. George Kelly and Marcelo Acuna have accounted for 10 of the team's 13 goals, with Kelley's six leading the way.\nLast time out\nUVU opened WAC play with a pair of home wins, defeating Air Force in overtime, 2-1, before a 3-0 shutout of Missouri-Kansas City. Against the Falcons, the Wolverines trailed 1-0 at the half before Austin Buxton tied the match, and Skyler Milne finished it in overtime with a golden goal on a Buxton assist. The win improved UVU to 3-1-0 in overtime matches this season.\nAgainst UMKC, Utah Valley scored all three of its goals in the first half, starting with Karson Payton 's WAC-leading fourth game-winning goal of the year. Payton's four game-winners are tied for third in the nation in that category. Milne and Paul Hoffmeister also scored for the Wolverines with Hoffmeister and Aaron Meyer picking up two assists apiece in the win.\nUp next\nThe Wolverines host San José State on Friday, Oct. 16, as part of a women's and men's doubleheader. The women host Grand Canyon at 5 p.m., prior to the men's 7:30 p.m. start. UVU wraps up next week's action at CSU Bakersfield on Sunday, Oct. 18.\nClint Burgi is the associate athletic director for communications and marketing at . ", "external_links": ["http://www.wolverinegreen.com/roster.aspx?rp_id=2496", "http://www.wolverinegreen.com/roster.aspx?rp_id=2512", "http://www.wolverinegreen.com/roster.aspx?rp_id=2504", "http://www.wolverinegreen.com/roster.aspx?rp_id=2501", "http://www.wolverinegreen.com/roster.aspx?rp_id=2491", "http://www.wolverinegreen.com/coaches.aspx?rc=198"], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-09T05:28:20.484+03:00", "highlightTitle": ""}