{"organizations": [], "uuid": "447798dda1c5e6e23535c30a000cca0442475114", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sacbee.com", "main_image": "http://www.sacbee.com/news/local/health-and-medicine/healthy-choices/36gd6p/picture40444560/ALTERNATES/LANDSCAPE_1140/HealthBeat%20Cancer%20Screening.JPG", "site_section": "http://www.sacbee.com/?widgetName=rssfeed&widgetContentId=713546&getXmlFeed=true", "section_title": "Breaking News, Sports, Weather & More | Sacbee.com &", "url": "http://www.sacbee.com/news/local/health-and-medicine/healthy-choices/article40427604.html", "country": "US", "title": "UC Davis study: Get mammograms based on menopause status, not age", "performance_score": 0, "site": "sacbee.com", "participants_count": 1, "title_full": "UC Davis study: Get mammograms based on menopause status, not age", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T09:00:00.000+03:00", "replies_count": 0, "uuid": "447798dda1c5e6e23535c30a000cca0442475114"}, "author": "Claudia Buck \ncbuck@sacbee.com", "url": "http://www.sacbee.com/news/local/health-and-medicine/healthy-choices/article40427604.html", "ord_in_thread": 0, "title": "UC Davis study: Get mammograms based on menopause status, not age", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "UC Davis study: Get mammograms based on menopause status, not age \nBefore menopause, women should get annual mammograms, regardless of age, study suggests \nWomen who are past menopause can safely go to biennial breast screenings \nStudy of 15,440 U.S. women part of new American Cancer Society guidelines Healthy Choices \nNews and inspiration for healthy living in Northern California A radiologist uses a magnifying glass to check mammograms for breast cancer in Los Angeles. Damian Dovarganes AP i \ncbuck@sacbee.com \nFor years, women were advised to get their annual mammogram starting at age 40, an effort to detect breast cancer before it turned deadly. But that guideline became contentious with the medical community divided on what age – and how often – women should get their breast checks done. Some recommended that women over age 50 scale back to once-every-two-year mammograms. \nTuesday, a new UC Davis study says women should get annual mammograms based on their menopausal status, not their age. Its research is folded into new American Cancer Society breast cancer screening guidelines, expected to be released today. Previously, the society recommended yearly mammograms for all women over age 40. \n“We found menopausal status was a much better predictor of who benefits from screenings,” said Diana Miglioretti, a biostatistics professor with the UC Davis Department of Public Health Sciences, who conducted the research project, which looked at mammogram results from more than 15,000 U.S. women. \nHer study, conducted at the request of the American Cancer Society, found that women who haven’t gone through menopause – no matter their age – were more likely to develop aggressive cancers if they waited every two years for a mammogram. According to the research, that means premenopausal women should stay with annual screenings if they want to detect cancers at earlier stages when they’re more treatable. \nOn the flip side, the research found that women who were postmenopausal – whether that occured in their 40s or later – didn’t show any statistical increase in aggressive, later-stage breast cancer whether they had annual screenings or biennial screenings. \nThe average age of menopause for U.S. women is 51. \n“Our study provides another piece of evidence that biennial screenings – every other year – are safe for some women: namely, postmenopausal women,” said Miglioretti. \nThe study looked at data from 15,440 U.S. women, ranging in age from 40 to 85, who were diagnosed with breast cancer within a year or two of their mammograms. Their screening frequency was compared with their type of cancer based on three factors: tumor size (15 millimeters or larger), aggressiveness (stage II B or higher) and involvement of lymph nodes (positive or negative). \nWhat they found was that premenopausal women diagnosed with invasive breast cancer after a biennial screening mammogram were more likely to have tumors with “less favorable” characteristics than those who were diagnosed after a 12-month screening mammogram. For women who have yet to go through menopause, the risk of breast cancer is associated with their body’s circulating hormones, which can affect how fast a tumor grows. \nMiglioretti’s research was conducted through her work as a co-leader with the Breast Cancer Surveillance Consortium, a research group affiliated with the National Cancer Institute to conduct research into breast cancer screening and pathologies. The current study was based on data from a San Francisco/Marin County mammography center, plus others in Washington state, Vermont, New Hampshire and North Carolina. \nAlthough the research suggests that premenopausal women should have a a mammogram every year, not every woman should automatically go in for annual testing, Miglioretti said. “There’s a tradeoff between the benefits and harms of more screenings,” she said, noting that rates of false-positive mammogram results can increase with annual testing. “Your chance of having a false alarm is 1.5 to 2 times higher if you’re screened every year, compared to two years.” \nShe also noted that women who have had their ovaries removed or use birth control methods that result in no menstrual periods may not know their actual menopause status. Those women may want to base their screening decisions on their age instead. \n“That’s why it’s a personal choice,” said Miglioretti. “Women should weigh the benefits and harms and decide on screening frequency, based on their values and preferences.” \nClaudia Buck: 916-321-1968 , @Claudia_Buck Diana Miglioretti, UC Davis biostatistics professor and breast cancer researcher. UC Davis and Robert Durell Robert Durell i", "external_links": [], "published": "2015-10-20T09:00:00.000+03:00", "crawled": "2015-10-20T20:10:39.984+03:00", "highlightTitle": ""}