{"organizations": ["Raiders"], "uuid": "c85af9d4a77703abbc4827fa4a024c6184b150a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pendletontimespost.com", "main_image": "", "site_section": "http://pendletontimespost.com//feed/sec/6000/", "section_title": "PendletonTimesPost.com - Sports News", "url": "http://www.pendletontimespost.com/view/story/3badec7b03004239b12fc5543d970428/FBN--Raiders-Del-Rio/", "country": "US", "title": "Late mistakes doom Raiders in loss to Bears", "performance_score": 0, "site": "pendletontimespost.com", "participants_count": 0, "title_full": "Late mistakes doom Raiders in loss to Bears", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T02:25:00.000+03:00", "replies_count": 0, "uuid": "c85af9d4a77703abbc4827fa4a024c6184b150a0"}, "author": "", "url": "http://www.pendletontimespost.com/view/story/3badec7b03004239b12fc5543d970428/FBN--Raiders-Del-Rio/", "ord_in_thread": 0, "title": "Late mistakes doom Raiders in loss to Bears", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["JOSH DUBOW"], "text": "Failed 3rd down on offense, lack of 4th down stop on defense led to Raiders' latest loss By JOSH DUBOW AP Sports Writer First Posted: October 05, 2015 - 7:25 pmLast Updated: October 05, 2015 - 7:25 pm We also have more stories about: (click the phrases to see a list) \nPeople: \nCalifornia (1459) \n\nALAMEDA, California — For coach Jack Del Rio, the latest loss for the Oakland Raiders really boiled down to two plays. \nSure there were a couple of unforced turnovers by Latavius Murray, a blown coverage that left another tight end wide open in the end zone and a handful of other crucial plays throughout the game. \nBut if Oakland had either converted a third-and-2 just before the two-minute warning or stopped Chicago on a fourth-and-5 on the ensuing drive, the Raiders (3-1) would be heading into this week's showdown with Denver with a shot to move into first-place in the AFC West . \n\"We had our opportunities there,\" Del Rio said Monday. \"We feel like we prepared well. We didn't quite execute the way we wanted and came up a little bit short.\" \nThe first key play came on the Raiders' final drive. After an interception by Charles Woodson thwarted a Chicago scoring chance, Derek Carr drove the Raiders down the field with two big passes to Michael Crabtree. Roy Helu Jr. converted a third-and-2 from the Bears 33 and followed that up with a pair of 4-yard runs. \nThat set up another third-and-2 from the Chicago 22 with just under three minutes remaining and Oakland trailing 19-17. Del Rio opted for another run in hopes of converting the first down or running out more time if it was unsuccessful. Pernell McPhee beat rookie tight end Clive Walford at the line and hit Helu for a 1-yard loss. \nSebastian Janikowski converted the 41-yard field goal to give the Raiders a 20-19 lead but the Bears had 2:05 remaining to get the winning score. \n\"You can always second-guess the call, whether it's run or pass,\" Del Rio said. \"It was definitely there, if we executed the play. But we also have to give 92 some credit. He's a game-wrecker kind of guy.\" \nThe Raiders still had a chance when the Bears faced a fourth-and-5 with 1:30 to play on their first series of downs. But Bears quarterback Jay Cutler found Martellus Bennett for a 7-yard gain to extend the drive. Four more completions and a short run by Matt Forte set up Robbie Gould's 49-yard field goal to win it and sent the Raiders regrouping. \n\"It's a loss,\" Woodson said after the game. \"They're all hard to swallow. It is what it is. We got a tough, tough game coming up. You can't dwell on this one too long, because the week gets on you fast. It'll be time to get back to work.\" \nThere were a few key plays earlier, most notably the two turnovers by Murray. The first came in the second quarter when Murray bobbled a pass right into McPhee's hands. Then in the fourth quarter, Murray dropped an easy pitch from Carr for a fumble. \nMurray did not play the final drive and took the blame for the loss after the game. Del Rio said he still has confidence in his young back. \n\"None of us are perfect,\" he said. \"We're all capable of making mistakes. I think the sooner you own up to mistakes, the quicker you can put them behind you and move forward.\" \nThe other frustrating play for the Raiders was Bennett's 5-yard TD catch in the second quarter when he was left all alone in the corner of the end zone. The Raiders had placed a priority on shutting down tight ends after allowing five TD catches to them the first three weeks. \nFor the season, opposing tight ends have 32 catches for 388 yards and six touchdowns in four games. \n\"We've had a couple of issues,\" Del Rio said. \"It hasn't been one position or one error. It's kind of been shared. We're working hard at it. There were times it was a whole lot better. He had an occasion where he popped free like that. Clearly that's a mistake on our part.\" \nOnline: \nAP NFL website: http://www.pro32.ap.org and http://www.twitter.com/AP_NFL \n ", "external_links": [], "published": "2015-10-06T02:25:00.000+03:00", "crawled": "2015-10-06T03:30:06.620+03:00", "highlightTitle": ""}