{"organizations": [], "uuid": "6f1460ba31d752003863ec90ee32bfc2f67f756c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.uticaod.com", "main_image": "http://www.uticaod.com/storyimage/NY/20151016/SPORTS/151019477/AR/0/AR-151019477.jpg", "site_section": "http://www.uticaod.com/sports?template=rss&mime=xml", "section_title": "Sports - Uticaod", "url": "http://www.uticaod.com/article/20151016/SPORTS/151019477/2000/NEWS?rssfeed=true", "country": "US", "title": "Herkimer football routs Frankfort in finale", "performance_score": 0, "site": "uticaod.com", "participants_count": 1, "title_full": "Herkimer football routs Frankfort in finale", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T07:33:00.000+03:00", "replies_count": 0, "uuid": "6f1460ba31d752003863ec90ee32bfc2f67f756c"}, "author": "Ron Moshier", "url": "http://www.uticaod.com/article/20151016/SPORTS/151019477/2000/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "Herkimer football routs Frankfort in finale", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Herkimer football routs Frankfort in finale The two-game losing streak is over, and the Herkimer High School football team is back in the Section III playoffs after a 39-6 Class C East win over Frankfort-Schuyler on Friday. Comment Posted Oct. 16, 2015 at 10:09 PM Updated at 11:33 PM Posted Oct. 16, 2015 at 10:09 PM Updated at 11:33 PM • GALLERY: Friday Night Football That two-game skid is history and Herkimer High’s football team – a Section III finalist the last four seasons – is back in the Class C playoffs. With a wild-card playoff berth at stake, the state-ranked No. 23 Magicians scored two touchdowns just 18 seconds apart – before Frankfort-Schuyler ran its first play from scrimmage – and Herkimer ended its regular season with Friday night’s 39-6 Class C East victory over the Maroon Knights. Herkimer senior quarterback Mitchell Scherer scored on three short touchdown runs, raising his season total to 13, and junior tailback Antonio Aceto rushed for 182 yards on 15 carries as the Magicians – who had lost to state-ranked league rivals Notre Dame and Holland Patent the last two weeks – improved to 5-2 overall and finished third in the Class C East. Aceto scored on runs of 9 and 57 yards and Herkimer’s defense, anchored by tackle Brian Lawson, end Anthony Luppino and middle linebacker Angelo Marroccolo, limited a Frankfort-Schuyler team that was missing injured starting quarterback Ethan Irons to 61 total yards. Scherer rushed for 68 yards on 17 carries for the Magicians, who will find out after Sunday’s Section III seeding meeting who, when and where they will play a Class C quarterfinal game next weekend. Jalen Reeves rushed for 69 yards on 23 carries and threw a touchdown pass to Gaetano Spina for the Maroon Knights (1-2, 3-4), who will play a nonleague crossover game next weekend. Herkimer needed just 79 seconds to take a 16-0 lead. Jacob Bray returned the opening kickoff 65 yards, and three plays later Scherer’s 1-yard sneak opened the scoring. Seconds later, Herkimer’s John Zaleski recovered a squibbed kickoff at the Frankfort 38, and one play after Aceto’s 36-yard scamper, Scherer scored again to make it 16-0 just 1:19 into the game. With Reeves taking the shotgun snap, the Maroon Knights put together their only drive of the night just before the rain came down and the wind picked up. The senior tailback did most of the work on a 65-yard march that ended with his play-action touchdown toss to Spina from 8 yards out. Herkimer fumbled the ball away twice midway through the first half, but its defense stiffened both times and Aceto carried six straight times for 66 yards, including a 9-yard score that made it 24-6 at the half. Scherer’s 25-yard pass to Aceto led to the third quarter’s only score, a 1-yard plunge by Scherer, and Aceto bolted 57 yards for a fourth-quarter touchdown. Herkimer 39, Frankfort-Schuyler 6 Herkimer 16 8 8 7 — 39 Frankfort-Schuyler 6 0 0 0 — 6 First Quarter H— Mitchell Scherer 1 run (Mike Barreto run). H— Scherer 2 run (Barreto run). Page 2 of 2 - FS— Gaetano Spina 8 pass from Jalen Reeves (run failed). Second Quarter H— Antonio Aceto 9 run (Scherer run). Third Quarter H— Scherer 1 run (Scherer run). Fourth Quarter H— Aceto 57 run (Jacob Bray kick). Follow @OD_Delaney on Twitter or call her at 792-4963.", "external_links": [], "published": "2015-10-17T07:33:00.000+03:00", "crawled": "2015-10-17T08:38:45.184+03:00", "highlightTitle": ""}