{"organizations": [], "uuid": "803fda7ce8a1ca8ecc8c95bab988dd9a2fce50b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtontimes.com", "main_image": "http://media.washtimes.com.s3.amazonaws.com/media/image/2015/10/19/AP_564282041481.jpg", "site_section": "http://www.washingtontimes.com/rss/headlines/sports/", "section_title": "www.washingtontimes.com stories: Sports", "url": "http://www.washingtontimes.com/news/2015/oct/19/snap-counts-redskins-defensive-end-stephen-paea-ac/", "country": "US", "title": "Snap counts: Redskins defensive end Stephen Paea active, but did not play", "performance_score": 0, "site": "washingtontimes.com", "participants_count": 1, "title_full": "Snap counts: Redskins defensive end Stephen Paea active, but did not play", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T19:42:00.000+03:00", "replies_count": 0, "uuid": "803fda7ce8a1ca8ecc8c95bab988dd9a2fce50b1"}, "author": "Anthony Gulizia", "url": "http://www.washingtontimes.com/news/2015/oct/19/snap-counts-redskins-defensive-end-stephen-paea-ac/", "ord_in_thread": 0, "title": "Snap counts: Redskins defensive end Stephen Paea active, but did not play", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Snap counts: Redskins defensive end Stephen Paea active, but did not play By Anthony Gulizia - The Washington Times   \nLeft tackle Trent Williams, center Kory Lichtensteiger, tight end Jordan Reed, wide receiver DeSean Jackson, running back Matt Jones and cornerbacks Chris Culliver and DeAngelo Hall were all inactive for the Washington Redskins in Sunday’s 34-20 loss to the New York Jets at MetLife Stadium. \nBecause of injuries, the Redskins had no choice but to activate players that are normally inactive, such as third-string quarterback Robert Griffin III. \nPerhaps the Redskins also have more injuries that are preventing guys from playing than they have available inactive openings. \nDefensive end Stephen Paea was questionable for Sunday’s game with a back injury and was active, but he did not play a single snap in Sunday’s loss to the Jets. \nIn the last two games, Chris Baker has been seeing more snaps at defensive end and was named the starter ahead of Paea, who signed a four-year, $21 million deal as a free agent in the offseason. \nWhile the Redskins have favored Baker as of late — he had three sacks in the two games before Sunday — Paea still played 34 percent of the defensive snaps against Atlanta. \nWithout Paea on the field on Sunday, often-released defensive end Frank Kearse played his first defensive snaps of the season. He played 12 of 67 snaps. \nFor the most part, coach Jay Gruden did not make excuses about the team’s rash of injuries on Sunday. \nThough he did say, “I’d like to see what happens when we get our full cast of characters back,” before evaluating Kirk Cousins’ fourth two-interception performance of the season, he did not use it as a crutch for things like the failing running game or the Redskins’ inability to adjust in the third quarter. \n“I don’t like to make excuses about anything,” Gruden said. “I just know that we had an opportunity to play the New York Jets today with 46 able players and they were better than us.” \nIf the Redskins had 46 able players, does that mean Paea was fine? It’s hard to imagine Paea has fallen completely out of favor with the Redskins’ coaching staff, but his absence on Sunday is worth monitoring. \nHere are a few other observations from Sunday’s snap counts. \n** Wide receiver Andre Roberts played 32 of 63 offensive snaps while Ryan Grant played 30. While rookie Jamison Crowder has replaced Roberts as the slot receiver, the Redskins have been using Grant as the outside receiver opposite Pierre Garcon since Jackson was injured. Roberts was inactive against Philadelphia in Week 4 and played just nine snaps last week. \nGrant played the most snaps out of the Redskins receiver’s last week. On Sunday, he played less than Pierre Garcon, Crowder and Roberts. Most of Roberts’ time came in the second-half when the game was out of reach, so perhaps the Redskins were trying to get another look at the veteran receiver since he was benched in Week 4. \n** On the topic of wide receivers, Garcon played 52 of 63 offensive snaps, but was not targeted in the second half. No, that’s not a typo. Garcon had eight targets for five receptions in the first half. Crowder and running back Chris Thompson had four and five, respectively. In the second half, Crowder and Thompson both had five targets. Without Jackson or Reed in the lineup, it’s hard to imagine Garcon not getting any looks in the second half, especially when the Redskins needed to get back in the game.", "external_links": [], "published": "2015-10-19T19:42:00.000+03:00", "crawled": "2015-10-19T21:37:24.908+03:00", "highlightTitle": ""}