{"organizations": [], "uuid": "0662969f1b5625568ab4d6d55e198dc56d9739ef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.oregonlive.com", "main_image": "http://imgick.oregonlive.com/home/olive-media/width620/img/opinion_impact/photo/2015/08/24/18611593-standard.jpg", "site_section": "http://www.oregonlive.com/", "section_title": "Oregon Local News, Breaking News, Sports &amp; Weather - OregonLive.com", "url": "http://www.oregonlive.com/opinion/index.ssf/2015/10/living_in_a_world_playboy_made.html", "country": "US", "title": "Living in a world Playboy made: Leonard Pitts Jr.", "performance_score": 0, "site": "oregonlive.com", "participants_count": 2, "title_full": "Living in a world Playboy made: Leonard Pitts Jr. | OregonLive.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T20:30:00.000+03:00", "replies_count": 1, "uuid": "0662969f1b5625568ab4d6d55e198dc56d9739ef"}, "author": "Syndicated columns", "url": "http://www.oregonlive.com/opinion/index.ssf/2015/10/living_in_a_world_playboy_made.html", "ord_in_thread": 0, "title": "Living in a world Playboy made: Leonard Pitts Jr.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Leonard Pitts Jr. By Leonard Pitts Jr.\nI used to love Playboy magazine.\nAnd yes, it was mainly for the articles. But I wasn't exactly repulsed by the pictures.\nYou may find that an odd admission for an avowed feminist, but I've always felt the argument over the sexual objectification of women tends to miss an important point. Namely, that sexuality is a part of life - indeed, one of the best parts. So what's wrong is not presenting women as objects of allure. What's wrong is behaving as if women can only be objects of allure, as if they have no value beyond that expressed by face and form.\nAll that said, I've been trying to figure out how I feel about the recent news that Playboy, which pioneered the so-called \"sophisticated\" men's magazine, will soon stop publishing nude photos of women. Beginning in March, its models will be scantily clad, but clad nevertheless. It feels not unlike hearing that Disney World has fired Mickey Mouse or McDonald's has stopped selling Big Macs: a famous brand jettisoning the very thing for which it is most famous, the thing by which it is defined.\nIt's been 20 years or more since I was even a semi-regular reader of Hugh Hefner's magazine. Apparently, I'm not the only one to fall away. In the '70s, when I first picked up Playboy, it claimed a circulation north of 5.5 million. That number has reportedly withered to about 800,000.\nAt one level, then, this is just a new iteration of an old story: the decline of print. Jet magazine disappeared from newsstands last year. Newsweek's print edition died - then was resurrected. Many once-robust newspapers now resemble pamphlets.\nAt another level, however, Playboy's woes and its response to same present an interesting snapshot of a culture that, sexually speaking, pushed the envelope until it tore. At its founding in 1953, after all, Playboy was revolutionary, a frank celebration of carnal pleasures in the Eisenhower era, when Lucy and Ricky were forced to sleep in separate beds and couldn't say \"pregnant\" on TV. Years before Elvis scandalized America by wiggling his hips, there was Hefner presenting screen goddess Marilyn Monroe, posing starkers and coquettish on red velvet.\nIn those stodgy and repressed years, this carried significance beyond mere titillation.\nBut yes, it also carried titillation, and 62 years later, Playboy has been swallowed by its own revolution, swamped by its own tsunami. As CEO Scott Flanders told The New York Times, \"You're now one click away from every sex act imaginable for free, and so it's just passe at this juncture.\"\nIn other words, if Playboy was born in an era of repression, it has reached its AARP years in a sexual Wild West of free and easy pornography that makes its airbrushed perfection of breasts and backsides feel quaint and anachronistic. More to the point, it is an era wherein the commodification of the feminine form is ubiquitous, the double entendre has become, for some, one entendre too many to bother with, and sex is everywhere all the time, often tiresomely so.\nOne doesn't feel liberated from sexual repression - that battle is over. One doesn't even feel titillated. One simply feels numb. You want to say, \"OK, I get it! Insert Tab A into Slot B, and it feels pretty good. But then what?\"\nThat unanswered \"what\" is the whole world outside of sex. There is one, you know, though sometimes, watching television or surfing the Net, you might forget.\nFor all its undeniable success in forcing a more honest appraisal of, and appreciation for, human sexuality, Hefner's magazine also seems the living embodiment of the axiom about being careful what you wish for. Sixty-two years later, we are living in a world Playboy made, and if anyone is having trouble doing that, take heart:\nApparently, Playboy's having trouble with it, too.\n(c) 2015, The Miami Herald\nLeonard Pitts Jr. is a columnist for the Miami Herald. Readers may write to him at lpittsmiamiherald.com.", "external_links": [], "published": "2015-10-23T20:30:00.000+03:00", "crawled": "2015-10-24T11:47:51.355+03:00", "highlightTitle": ""}