{"organizations": ["Stoke", "Villa"], "uuid": "094db27b8764a21e5c8cc694f2ff7a9643d56309", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/d55d93017755d88819cf867f1a6f3a22.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/football/glen-johnson-wants-stoke-to-build-on-villa-win/6888790/", "country": "JE", "title": "Glen Johnson wants Stoke to build on Villa win", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "Glen Johnson wants Stoke to build on Villa win", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T15:31:00.000+03:00", "replies_count": 0, "uuid": "094db27b8764a21e5c8cc694f2ff7a9643d56309"}, "author": "", "url": "http://www.sport.co.uk/football/glen-johnson-wants-stoke-to-build-on-villa-win/6888790/", "ord_in_thread": 0, "title": "Glen Johnson wants Stoke to build on Villa win", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Glen Johnson"], "text": "Glen Johnson wants Stoke to build on Villa win 04 Oct 2015 12:31:52 \ncomments \nGlen Johnson has urged Stoke to build on their Villa victory as the Potters kick-started their season. \nMarko Arnautovic's strike clinched a 1-0 victory at Aston Villa on Saturday, a third straight success for Mark Hughes' side. \nStoke had failed to win any of their opening seven games but have now beaten Fulham in the Capital One Cup and sealed victories against Bournemouth and Villa in the Barclays Premier League. \nJohnson set up Arnautovic for his second-half strike and believes Stoke must continue their improvement. \n\"We've played well in the last few games and probably not picked up as many points as we should have done,\" he told Stoke Player. \n\"We go into every game searching for the win, we got that and it is now something to build on when we come back from the international break. \n\"We had to dig deep late on, but that was always going to happen when they're fighting for the game and throwing everybody forward. \n\"The lads were brilliant. We all put in a shift and at times played some very nice football.\" \nHughes' side moved five points above Villa who remain rooted in the relegation zone after their first eight games. \nThey are four points from the safety line and have not won since the opening day, earning just a point in their seven outings since. \nBoss Tim Sherwood came under fire from fans after the game and admitted his side are yet to seriously impress. \nHe said: \"They are there in patches, not on a consistent basis I will be honest. I see good possession in patches. It's a little bit boring at times - passing the ball square and backwards too much. \n\"I want it passed forward. Sometimes you need someone on the pitch who can open people up - drop their shoulder. At the moment, we haven't got that.\" Related Sport News", "external_links": [], "published": "2015-10-04T15:31:00.000+03:00", "crawled": "2015-10-05T18:50:21.048+03:00", "highlightTitle": ""}