{"organizations": [], "uuid": "2a8b36ecbf80a4284dbedef8587fae9b2caed0a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "kentuckysportsradio.com", "main_image": "http://kentuckysportsradio.com/wp-content/uploads/2015/10/Stoops-spurrier-600x399.png", "site_section": "http://kentuckysportsradio.com/comments/feed/", "section_title": "Comments for Kentucky Sports Radio", "url": "http://kentuckysportsradio.com/football-2/espn-writer-names-stoops-a-potential-replacement-for-spurrier/", "country": "US", "title": "Comment on ESPN writer names Stoops a potential replacement for Spurrier by john wall", "performance_score": 0, "site": "kentuckysportsradio.com", "participants_count": 1, "title_full": "Comment on ESPN writer names Stoops a potential replacement for Spurrier by john wall", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T02:02:00.000+03:00", "replies_count": 0, "uuid": "2a8b36ecbf80a4284dbedef8587fae9b2caed0a4"}, "author": "john wall", "url": "http://kentuckysportsradio.com/football-2/espn-writer-names-stoops-a-potential-replacement-for-spurrier/", "ord_in_thread": 0, "title": "Comment on ESPN writer names Stoops a potential replacement for Spurrier by john wall", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ESPN’s Travis Haney named six candidates to take over for Steve Spurrier at South Carolina , and Mark Stoops is second on his list. \nStoops is joined by Kirby Smart, Alabama’s defensive coordinator; Chad Morris, head coach at SMU; Tom Herman, head coach at Houston; Justin Fuente, the head man at Memphis; and Shane Beamer, Virginia Tech’s associate head coach. \nHere’s some of what Haney had to write about Stoops: \nMore than a few coaches have noted that Mark Stoops likely understands the ceiling at Kentucky. Sometimes an in-division move makes sense; South Carolina will always be the better football job, just as Kentucky will always be the better basketball job. \nIf Mark Stoops gets the Cats to a bowl game, and he should, then this is absolutely a name to note . [ ESPN Insider ] \nHaney was a guest on Paul Finebaum earlier this afternoon, and once again mentioned Stoops as a coach who should be on South Carolina’s short list, along with Herman. \nIt is with a great deal of respect that I would like to say this isn’t happening. Stoops has been given everything he’s asked for at Kentucky, including his own designs for a new practice facility; and the talent gap is narrow, if it even exists at all. Not to mention, he loves Lexington and Ohio is just across the river. \nStoops isn’t leaving for South Carolina. I’ll put BTI’s salary on it. Article written by Drew Franklin I can recite every line from Forrest Gump, blindfolded. Follow me on Twitter: @DrewFranklinKSR 11 responses to “ESPN writer names Stoops a potential replacement for Spurrier” BigAbes4UK October 13, 2015 at 6:25   \nNo way this is happening and this guy is out of touch. Kentucky is changing the culture here. UK is NOW more a football school than USCjr. Anyone that takes an objective look will see that is the case. \nBut the ceiling comment is just ridiculous. We are going to have some of the best facilities in the nation and we play in the best conference with plenty of backing from all parties. We have the right coach getting the right players. The game can, will and IS changing for UK. There is NO CEILING HERE! john wall October 13, 2015 at 7:02 pm | Permalink \nwe blew that old ceiling hiring stoops and investing in the program. Stoops will stay and take us to the next level UKnowMe October 13, 2015 at 6:26   \nUSC jr. at this point, is a lateral move at best. Mike October 13, 2015 at 6:28   \nDrew, I tweeted the same sentiment when I heard Brett McMurphy say it on the 9 am SportsCenter. SC isn’t even the better job now. Stoops has already surpassed the talent on the trail. He has basically got carte blanche along with the complete support of the university administration. He’s adjacent to arguably the richest recruiting area in the country, which happens to be his stomping grounds and roots. Coach Stoops has a chance to leave his name on a program here at UK, not unlike The Bear at Alabama or Bowden at FSU. To say that Kentucky has a ceiling as a program is ridiculous. You get the gist. Go Cats. BBNRTP October 13, 2015 at 6:29   \nvery tired of hearing the excuse that UK is a basketball school. yes UK is a great basketball school, the greatest actually and it is a birthright and honor to be a fan. HOWEVER, I don’t not for o e second believe that we are ONLY a basketball school. We’ve had 5 out of 6 sell out games this year and we’ve only played 5! We beat auburn and I’ll bet we sell out at least 3 more times. Now that the Administration has finally look at the simple economics of the situation and saw that you have to spend money to make money, we’re finally starting to see the results on the field. ( football earns twice as much revenue as the basketball team). UK is in a prime time to become something special. Luke October 13, 2015 at 6:32   \nUSC is just Kentucky with more humidity and more mosquitoes. BBNRTP October 13, 2015 at 6:41 pm | Permalink \nColumbia is a slum compared to Lexington shelby October 13, 2015 at 6:39   \nIt’s Stoops’ choice, but I don’t see this happening; personally, I do not believe SC is a better football job than KY. SC has been relevant ONLY because of Spurrier – Stoops can do the same thing at UK. Not to mention he’s been given EVERYTHING he’s asked for to make it happen. UK can win the SEC east in a few years in my honest opinion; if you can win the SEC east, you can win the conference, if you can win the conference, you can get into the playoffs. Sounds crazy? I don’t think so. Heck, just finishing in the top 2 or 3 in the east will land a major bowl most years. UK “CAN” become a football power with Stoops here – I say he’ll stay here and do it. John October 13, 2015 at 6:45   \nLoyalty counts for something to the Stoops brothers. Petrinos they are not. DylanG October 13, 2015 at 6:46   \nHere we go again…. Why can’t we just have Stoops and now have “HE’S GOING BLAH BLAH BLAH SOMEWHERE ELSE” Sad. People just don’t want us UK Football fans to be happy. PLEASE GOD, STOOPS DON’T LEAVE! W.C October 13, 2015 at 6:52   \nThe truth is Spurrier probably helped his friend Stoops get the job. We are for a long time been a sleeping cat and there are coaches in the know realize that, so as the cat awakens why in the world would Stoops leave for South Carolina. It’s a perfect marriage with the rich recruiting grounds just north of Lexington, name me a recruiting area around Columbia that’s not being fought over by Fl.,Ga, Tn. The fact that these Ohio boys can come south in 4 to 6 hours max and play in the toughest conference is a strong selling point, not one that Coach Stoops plans to leave anytime soon! It won’t be much longer before the national media realizes we have something special going on here in Lexington and it just isn’t basketball! STOOPS TROOPS!!! Post Comment - New and Improved (not really, it just works now)", "external_links": [], "published": "2015-10-14T02:02:00.000+03:00", "crawled": "2015-10-14T02:04:24.325+03:00", "highlightTitle": ""}