{"organizations": ["Associated Press"], "uuid": "bf8f33f0e2528fa36a78fb887e500dd2d09c8ee8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usatoday.com", "main_image": "http://www.gannett-cdn.com/-mm-/6447ef12a810232782d6ec9d5f81717bb6bc632f/c=0-128-2152-1338&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/12/USATODAY/usatsports/4e1866cfb8b38b2d840f6a706700ed08.jpg", "site_section": "http://www.usatoday.com/sports/", "section_title": "USA Today | Sports", "url": "http://www.usatoday.com/story/sports/nfl/2015/10/12/ravens-plan-to-overcome-injuries-and-rebound-from-1-4-start/73835246/", "country": "US", "title": "Ravens plan to overcome injuries and rebound from 1-4 start", "performance_score": 0, "site": "usatoday.com", "participants_count": 0, "title_full": "Ravens plan to overcome injuries and rebound from 1-4 start", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T00:54:00.000+03:00", "replies_count": 0, "uuid": "bf8f33f0e2528fa36a78fb887e500dd2d09c8ee8"}, "author": "", "url": "http://www.usatoday.com/story/sports/nfl/2015/10/12/ravens-plan-to-overcome-injuries-and-rebound-from-1-4-start/73835246/", "ord_in_thread": 0, "title": "Ravens plan to overcome injuries and rebound from 1-4 start", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Photo: The Associated Press)\n1 CONNECT 5 TWEET LINKEDIN COMMENT EMAIL MORE OWINGS MILLS, Md. (AP) — Off to the worst start in franchise history and carrying an expansive injury list, the last-place Baltimore Ravens have reached a pivotal point in a stunningly disappointing season.\nThe Ravens (1-4) couldn't hold a 12-point lead against Cleveland in a 33-30 defeat Sunday that further reduced their chances of returning to the playoffs.\nFrom 1970 through 2014, 206 NFL teams started 1-4. Only 10 (a scant 4.9 percent) reached the postseason.\nIf Baltimore is to buck the odds, it will have to do so short-handed.\nCornerback Will Davis tore his ACL on Sunday and is lost for the season. Running back Justin Forsett sprained his right ankle, linebacker Elvis Dumervil left with a strained groin injury and cornerback Lardarius Webb missed the entire second half with a thigh injury.\nIn spite of it all, coach John Harbaugh hasn't lost faith in his team's ability to win.\n\"Obviously, we face a lot of challenges right now,\" Harbaugh said Monday. \"I believe we're up to the task.\"\nThe road back begins in San Francisco on Sunday. At this point, it would be foolish for the Ravens to look beyond that game.\n\"That's all we need to be thinking about right now and that's all we'll be focusing on,\" Harbaugh said.\nThis team does not resemble the ones that Harbaugh took to the playoffs in six of the past seven years. The Ravens can't close out tight games, they're allowing opponents to convert third downs and they've been called for an alarming amount of penalties.\nAdd it all up and you've got four losses by a total of 17 points.\n\"There have been four games where we had the lead in the fourth quarter and we haven't finished,\" Harbaugh lamented. \"We've had one game where we have. That's on us. We've got to get the job done there.\"\nThe Ravens led 21-9 in the third quarter Sunday and 27-22 with 5:56 left but couldn't hold on. Cleveland converted 12 of 19 third-down plays, amassed 505 yards of offense and took advantage of 12 Baltimore penalties — including two in the fourth quarter when the Ravens lined up in the neutral zone.\nAnd that is why Baltimore sits alone in the AFC North cellar.\n\"We don't need to play harder, we need to play better. We don't need to coach harder, we need to coach better,\" Harbaugh said.\nAlthough Harbaugh has never been in this situation before, he has confidence that his team won't quit on him.\n\"I don't doubt our character. I don't doubt that our guys are going to play to the level of expectation that the Ravens expect,\" he said. \"That's just not really an option.\"\nIn the wake of Sunday's defeat, the players expressed the kind of resolve their coach expects.\n\"The worst thing we could do is to give in and start pointing fingers right now,\" defensive tackle Timmy Jernigan said. \"That's not what a family does. We have to stay together and figure this thing out.\"\nThat includes the coaching staff. Harbaugh said there won't be any changes anytime soon.\n\"No way. Our coaches are doing a great job,\" he said. \"We've got tough challenges that we're facing, but we've got just the men for the job right here.\"\nAfter facing the 49ers, Baltimore completes its brutal early season schedule with a trip to Arizona. After that, six of the last nine games are at home.\nThe Ravens can only hope to still have a shot at salvaging their season by the time that latter stretch kicks in. Then again, they've have had difficulty thus far winning at home or on the road.\n\"I don't think anyone in here thought we'd be where we are,\" offensive tackle Eugene Monroe said. \"But we're here, so we've got to get ourselves out of it.\"\n___\nAP NFL websites: http://pro32.ap.org and http://twitter.com/AP_NFL\n1 CONNECT 5 TWEET LINKEDIN COMMENT EMAIL MORE Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.\nTOP VIDEOS", "external_links": ["http://www.linkedin.com/shareArticle?url=http%3A//usat.ly/1Lr95KZ&mini=true", "http://www.gannett-cdn.com/-mm-/edaefef96b4c533ff54ccd7c694b47a9fbf78e08/c=98-0-2053-1466&r=x404&c=534x401/local/-/media/2015/10/12/USATODAY/usatsports/4e1866cfb8b38b2d840f6a706700ed08.jpg", "https://twitter.com/intent/tweet?url=http%3A//usat.ly/1Lr95KZ&text=Ravens%20plan%20to%20overcome%20injuries%20and%20rebound%20from%201-4%20start&via=usatoday", "http://twitter.com/AP_NFL"], "published": "2015-10-13T00:54:00.000+03:00", "crawled": "2015-10-13T02:00:16.725+03:00", "highlightTitle": ""}