{"organizations": [], "uuid": "0dbc2e5dbbf21cabc536592908b8ca9f32fbccaf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.boston.com", "main_image": "http://p.o0bc.com/rf/image_1920x1190/Boston/2011-2020/2015/09/11/Boston.com/ReceivedContent/Images/davis_nepitt25_spts.jpg", "site_section": "http://www.boston.com/", "section_title": "Boston, MA news, breaking news, sports, video | Boston.com", "url": "http://www.boston.com/sports/football/patriots/2015/10/15/the-more-fans-know-about-deflategate-the-more-they-disagree/h4C5o5j6GPfTsnGMwYejfN/story.html", "country": "", "title": "The more fans know about Deflategate, the more they disagree - Patriots", "performance_score": 0, "site": "boston.com", "participants_count": 1, "title_full": "The more fans know about Deflategate, the more they disagree - Patriots", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "0dbc2e5dbbf21cabc536592908b8ca9f32fbccaf"}, "author": "boston.com", "url": "http://www.boston.com/sports/football/patriots/2015/10/15/the-more-fans-know-about-deflategate-the-more-they-disagree/h4C5o5j6GPfTsnGMwYejfN/story.html", "ord_in_thread": 0, "title": "The more fans know about Deflategate, the more they disagree - Patriots", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A New York Times survey found that knowing more about Deflategate makes people disagree even more on Brady’s guilt.\nAmong Patriots fans who correctly answered three questions about Deflategate, just 10 percent thought Brady was guilty. At the same time, fans of other teams who correctly answered those questions believed Brady was guilty 65 percent of the time. For Patriots fans, knowing more only made people’s opinion of Brady’s innocence more certain.\nIt might seem counter-intuitive that people who know more would have starkly different views. Yet in sports as in politics, researchers have found that facts don’t fix misinformation, but actually strengthen incorrect views.\nAdvertisement - Continue Reading Below The survey also found that those who believe the U.S. government perpetrated the 9/11 attacks and that Obama was born in Kenya are more likely to believe Deflategate-related conspiracies.\nThe Times survey asked respondents if the U.S. government was complicit in 9/11 , if Obama was born in America , as well as two Deflategate conspiracies. One was a pro-Tom Brady conspiracy, saying that the NFL punished the quarterback to distract from the league’s problems. The other claim was an anti-Brady conspiracy, that a federal judge’s decision to lift Brady’s four-game suspension was influenced by the fame and wealth of Brady and the Patriots.\nThere was a strong correlation in the responses to these claims. Of those who rejected birther and 9/11 truther claims, 44 percent believed each of the Brady conspiracies. But of those who believed the birther and 9/11 conspiracies, belief increased to 59 percent for the pro-Brady theory and 65 percent for the anti-Brady theory.\nOnce you believe in one conspiracy theory, others become more believable.\nIn all, about two-thirds of survey respondents said they thought Brady broke the rules. Those opinions largely stuck with the respondents’ team of choice. Just 16 percent of Pats fans thought Brady broke the rules, compared to 90 percent of Colts fans.\nGallery: Casting the Deflategate movie\nPrevious -- of -- Next Ben Affleck as Tom Brady: If Ben can don Batman's cape and cowl, the \"Good Will Hunting\" co-conspiritor has as good a shot as anyone at filling the No. 12 jersey. and Chris Pizzello / AP Previous -- of -- Next Steve Buscemi as Tom Brady Sketch: If Buscemi is the first actor to audition for the role of Brady Sketch 1, then all others would be sent home immediately. Sketch by Jane Rosenberg (left) / Photo courtesy HBO Previous -- of -- Next Elizabeth Banks as Gisele Bundchen: The Pittsfield native's role as Vinnie Papale's love interest in Disney's \"Invincible\"certainly gives Banks the leg up for the highly coveted role as Tom Brady's supermodel wife. Fernanda Calfat / Getty (left) and Jamie Trueblood / AP Previous -- of -- Next Rob Gronkowski as Rob Gronkowski: There is only one Gronk. Accept no immitations. Robin Marchant / Getty (left) and Charles Krupa / AP Previous -- of -- Next Casey Affleck as Julian Edelman: The younger Affleck makes perfect sense to take on the role as Tom Brady's favorite receiver and superpal Julian Edelman. Scott Eisen / Getty (left) amd David Lee / Universal Pictures Previous -- of -- Next Advertisement Previous -- of -- Next Conan O'Brien as Roger Goodell: Brookline's own red-headed late-night host would bring a dark, comedic edge to the Commish's character. Richard Drew / AP (left) and Mario Anzuoni / Reuters Previous -- of -- Next Terrence Howard as Ted Wells: Many say the pure acting chops of Howard's \"Hustle & Flow\" is enough to secure the role of lead Deflategate investigator Ted Wells. But sometimes a good mustache can get you places in this world. Handout photo (left) and Damian Dovarganes / AP Previous -- of -- Next Denis Leary as Bill Belichick: Sarcastic? Check. Unwilling to suffer fools lightly? Check. Experience playing a head coach on the big screen... the Browns even! Check. Slam dunk casting. Jim Davis / The Boston Globe (left) and Todd Heisler / New York Times Previous -- of -- Next Craig Robinson as Vince Wilfork: It's pure swagger that gives Robinson the edge to play the former Patriots nose tackle's role in the film. A hot tub that can travel through time certainly helps. Brynn Anderson / AP (left) and Vivian Zink / NBC Previous -- of -- Next John Slattery as Robert Kraft: Boston's own slick John Slattery of \"Mad Men\" fame could certainly portray Patriots wealthy owner and unwavering Brady supporter Robert Kraft. Slattery's role as a Ford executive in \"Dirty Dancing: Havana Nights\" gives him the necessary upper class experience. Gene J. Puskar / AP (left) and Richard Shotwell / AP Previous -- of -- Next Advertisement Previous -- of -- Next Steve Carell as Walt Anderson: Would you trust Michael Scott from \"The Office\" to inspect for footballs before the AFC Championship Game? Gene J. Puskar / AP (left) and Disney Enterprises Previous -- of -- Next Jason Mewes as Jim McNalley and Kevin Smith as John Jastremski: Perhaps this could be the perfect - and hilarious - scene from \"Deflategate,\" as the Patriots locker room equipment attendants deliver Brady a basketball after a texting mishap. Photo courtesy of Tracy Bennett Previous -- of -- Next Louis C.K. as the football: The pigskin is the undisputed king of sports these days, and this Boston comedian is undeniably one of the best. Brad Barket / AP Previous -- of -- Next Dane Cook as the pump: Need to take the air out of a fellow comic? Cook could do the trick. Handout Photos Previous -- of -- Next Michael Schur as the Patriots lawyer who wrote The Wells Report in Context: It's not entirely clear if the writer behind Fire Joe Morgan and \"Parks & Recreation\" - also the actor that played Mose Schrute in \"The Office\" - was the inspiration for wellreportcontext.com. But judging from the breakdown, is sure seems likely. Wellsreportcontext.com (left) and Photo courtesy of NBC Previous -- of -- Next Advertisement Previous -- of -- Next Mark Wahlberg and Matt Damon as the Barstool Sports protesters: The quick cameo is perfectly suited for these two Hollywood heavyweights, and also right up the Farrelly brothers alley. Photo courtesy of @LAKEdwards / Twitter (left) and Warner Bros. Previous -- of -- Next James Spader as Jeffrey Kessler: Brady may have only hired high-powered attorney Jeffrey Kessler because Spader's Alan Shore was unavailable... and also fictional. Brendan McDermid / Reuters and Crain Blankenhorn / NBC Previous -- of -- Next Robert De Niro as Richard M. Berman: The iconic actor of \"Raging Bull\" fits in nicely as New England's favorite U.S. District Court Judge. \"Are you looking at me, Roger? Are you looking at me?\" Larry Neumeuister / AP (left) and Andrew H. Walker / Getty", "external_links": ["https://en.wikipedia.org/wiki/9/11_Truth_movement", "https://en.wikipedia.org/wiki/Barack_Obama_citizenship_conspiracy_theories", "http://www.nytimes.com/2015/10/16/upshot/tom-brady-and-political-beliefs-it-depends-what-team-youre-on.html"], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-15T20:01:45.743+03:00", "highlightTitle": ""}