{"organizations": [], "uuid": "8275151b4f6564eadedf50d7d66ac042fe242848", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.signalscv.com", "main_image": "", "site_section": "http://www.the-signal.com/syndication/feeds/rss/19/", "section_title": "SCV Prep Sports", "url": "http://www.signalscv.com/section/19/article/143927/", "country": "US", "title": "SCV prep football preview: week 8", "performance_score": 0, "site": "signalscv.com", "participants_count": 1, "title_full": "SCV prep football preview: week 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T07:27:00.000+03:00", "replies_count": 0, "uuid": "8275151b4f6564eadedf50d7d66ac042fe242848"}, "author": "Dan Agnew", "url": "http://www.signalscv.com/section/19/article/143927/", "ord_in_thread": 0, "title": "SCV prep football preview: week 8", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SCV prep football preview: week 8 Golden Valley faces tough Hart team after first Foothill win; SCCS, Trinity in action Posted: October 22, 2015 9:27   22, 2015 9:27 p.m. \nPerhaps lost in the chaos and excitement of Golden Valley football’s first Foothill League win last week was the development of another interesting storyline. \nCould these Grizzlies make the playoffs? \nWith the first league victory finally out of the way, it’s suddenly possible that Golden Valley could potentially put together a top-three finish in league, which would assure it a first-ever postseason berth. \n“Our objective is to win every week. ... We can’t map out the season and choose who we’re going to play against and what if this happens and what if that happens,” said Kelley of the playoff possibility. \nFor winning its first league game, Golden Valley (5-2 overall, 1-1 Foothill League) gets rewarded this week by facing a Hart team that has been the area’s best all season long. \nEven so, Hart head coach Mike Herrington sees this week’s game as a challenge. \n“(Kelley) has got those kids believing. They’re executing their fundamentals. They tackle really well. They run the ball well. Their offensive line is playing really well,” Herrington said of Golden Valley. \nThe CIF-Southern Section West Valley Division No. 6 Indians (6-1, 2-0) have exploded for 97 points in their first two league games behind Nelson James’ running and Nick Moore’s throwing to various wide receivers like Brock Williams, Ethan Lazarek and Dominic Carrillo. \nJames has been especially dangerous so far, scoring seven total touchdowns in Hart’s wins over Canyon and West Ranch the last two weeks. \n“They get the ball to a lot more guys (compared to last year). They’re not quite as one-dimensional. They’re getting the ball to multiple players, and that’s hard to defend,” Kelley said of Hart. \nThe matchup to watch in this game will be Hart’s offense against a Golden Valley defensive front that has been very disruptive against both the run and pass. \nDefensive end Tai Brown and linebacker Bryan Barrera have led that effort with a combined 11.5 sacks. \nWest Ranch (3-4, 0-2) at Valencia (4-3, 2-0), 7 p.m. tonight. In two league contests, Valencia’s defense has allowed just seven total points. \nIn that same span, West Ranch has scored 14. \nThat means the challenge of getting its offense going won’t get any easier for West Ranch. \nAs for the key to doing so, West Ranch head coach Jan Miller put it plainly: “We have to execute and we have to make our reads. Execution on offense is everything.” \nThe Wildcats were mostly held in check last week with Wyatt Eget starting at quarterback in place of injured Jackson Clark. \nMiller said there’s a good chance Clark will be back in action this week. \nOn the other hand, Valencia head coach Larry Muir said he’d like to see his own team’s passing game get back on track after being virtually shut down by Saugus last week. Instead it was running back Jahmar Berkley and the ground game that helped carry the Vikings to a 21-7 comeback victory. \n“It was a combination of a lot of mistakes,” Muir said of the passing struggles. “I think we have to kind of jump-start it and get it going early.” \nSaugus (3-4, 1-1) at Canyon (1-6, 0-2), 7:30 p.m. tonight In recent years, this matchup has not only been important in terms of playoff implications, it’s also featured some exciting games. \nLast year, Saugus (3-4, 2-2) had the ball in Canyon territory with a chance to tie late in the game. But Canyon prevailed 28-20. \nThe year before, the Centurions missed a potential game-tying 29-yard field goal attempt in the closing seconds of a 23-20 loss. \nBoth teams enter tonight’s game coming off difficult losses. Canyon’s was a particularly emotional one, losing 35-6 to previously winless-in-league Golden Valley. \nIf Canyon (1-6, 0-2) loses, it will fall to 0-3 in Foothill play and will be in serious danger of missing out on the playoffs for the first time since 2008. \nSaugus, on the other hand, is coming off a hard-fought 21-7 loss to Valencia a week ago in a game where the Vikings were held to just 34 yards passing. \nAnother strong defensive effort could propel the Cents and allow them to avenge two straight narrow losses to Canyon. \nTrinity Classical Academy (4-2) at Mary Star of the Sea (4-3), 7 p.m. tonight at San Pedro Once again, Trinity Classical Academy will go up against a team that is bigger in both size and number of players on the roster. \nTrinity hits the road to face Mary Star of the Sea of San Pedro in another quest to boost its resume for a potential playoff berth. But this isn’t going to be a walk in the park for the Knights, who are down to just 14 healthy players on the roster going up against a 42-person Mary Star squad. \nMary Star is a very run-heavy team that uses three different primary backs: William Davis, Vinny Lauro and Jardo Alves. The leader of the group is Davis, the 5-foot-9-inch, 225-pound senior who has 681 yards and 10 touchdowns this season. Lauro isn’t far behind at 673 yards and 12 scores. \nThe savvy Trinity defense has proven it can find ways to stop bigger players before, though.“If we can slow their run down and get our passing game going, it’ll be a good sight,” said Trinity head coach Les Robinson. \nTrinity quarterback Tyler Lee has thrown for 961 yards and 11 touchdowns this year. He’ll be helped by his usual offensive weapons, running back Caden Kulp and tight end/linebacker Ian Caddow. \nSanta Clarita Christian (6-1 overall, 2-0 in San Joaquin League) vs. Capistrano Valley Christian (2-5, 1-1), 7 p.m. Saturday at Canyon High Santa Clarita Christian football’s move into a CIF top 10 ranking this week for the first time as an 11-man program probably says a lot about the strides the Cardinals (6-1 overall, 2-0 in San Joaquin League) have made this season. \nThe Cards are tied for the No. 10 spot in the East Valley Division rankings. \nThe 2-5 record of their Saturday opponent might say far less. \nCapistrano Valley Christian not only gave East Valley No. 5 Saddleback Valley Christian its toughest game of the season in week 6 (Saddleback won 13-10), but CVC actually outscored its opponent in week zero only to forfeit the game because of an “illegal” player, according to The Vista Press. \nThe Eagles are coming off a 36-20 San Joaquin win over Fairmont Prep. \nSCCS is fresh off a league win of its own, a crucial 34-24 victory over The Webb Schools. \nCardinals quarterback Tristan Miller did, however, throw four interceptions against Webb to give him 16 on the year, most in the East Valley Division, according to MaxPreps. \nHe also leads the division in yards (2,386) and touchdowns (32), and he’ll likely need to be at his best against an Eagles team that beat SCCS 49-15 last year. \nCVC’s quarterback, junior Dawson Piper, has thrown for 1,433 yards. \nHe’s tossed 14 touchdowns against seven interceptions. \nHis main target has been senior Ben Sukut, who’s hauled in a team-high 34 passes for 625 yards and 10 touchdowns.SCCS has lost to CVC in each of the last three seasons, including a 36-33 heartbreaker in 2013. \nBut this Cardinals team has already won more games than it did in 2013 or ‘14. \nSignal Staff Writer Mason Nesbitt contributed to this story.", "external_links": [], "published": "2015-10-23T07:27:00.000+03:00", "crawled": "2015-10-23T10:33:18.168+03:00", "highlightTitle": ""}