{"organizations": [], "uuid": "5c0870a235b95c90f181761c125f2ea3ae5a3f21", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.beaumontenterprise.com", "main_image": "http://ww3.hdnux.com/photos/41/26/71/8744530/3/rawImage.jpg", "site_section": "http://www.beaumontenterprise.com/sports/baseball/collectionRss/Sports-Baseball-Heds-7391.php", "section_title": "Sports Baseball Heds", "url": "http://www.beaumontenterprise.com/sports/article/Collins-Hinch-among-4-managers-prepping-for-6552660.php", "country": "US", "title": "Collins, Gibbons among 4 managers making playoff debuts", "performance_score": 0, "site": "beaumontenterprise.com", "participants_count": 1, "title_full": "Collins, Gibbons among 4 managers making playoff debuts", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T13:29:00.000+03:00", "replies_count": 0, "uuid": "5c0870a235b95c90f181761c125f2ea3ae5a3f21"}, "author": "MIKE FITZPATRICK, AP Baseball Writer", "url": "http://www.beaumontenterprise.com/sports/article/Collins-Hinch-among-4-managers-prepping-for-6552660.php", "ord_in_thread": 0, "title": "Collins, Gibbons among 4 managers making playoff debuts", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Close Image 1 of 6 \nHouston Astros manager A.J. Hinch looks to the outfield during a workout at Yankee Stadium in New York, Monday, Oct. 5, 2015, for an American League Wild Card baseball game against the New York Yankees on Tuesday. Photo: Kathy Willens, AP Houston Astros manager A.J. Hinch looks to the outfield during a... Image 2 of 6 \nToronto Blue Jays manager John Gibbons, right, celebrates with relief pitcher LaTroy Hawkins after winning the first baseball game of a doubleheader against the Baltimore Orioles, Wednesday, Sept. 30, 2015, in Baltimore. Toronto won 15-2 to clinch the American League East. Photo: Patrick Semansky, AP Toronto Blue Jays manager John Gibbons, right, celebrates with... Image 3 of 6 \nTexas Rangers manager Jeff Banister, right, poses for a photo with fan Amber McDonald during batting practice before a baseball game against the Los Angeles Angels in Arlington, Texas, Friday, Oct. 2, 2015. Photo: LM Otero, AP Texas Rangers manager Jeff Banister, right, poses for a photo with... Image 4 of 6 \nToronto Blue Jays manager John Gibbons celebrates after winning the first baseball game of a doubleheader against the Baltimore Orioles, Wednesday, Sept. 30, 2015, in Baltimore. Toronto won 15-2 to clinch the American League East. Photo: Patrick Semansky, AP Toronto Blue Jays manager John Gibbons celebrates after winning the... Image 5 of 6 \nTexas Rangers manager Jeff Banister, second from left, gets a hug as his team celebrates winning a baseball game against the Los Angeles Angels in Arlington, Texas, Sunday, Oct. 4, 2015. The Rangers finally clinched the AL West title on the last day of the regular season with the 9-2 win. Photo: LM Otero, AP Texas Rangers manager Jeff Banister, second from left, gets a hug... Image 6 of 6 \nToronto Blue Jays manager John Gibbons adjusts his cap as he waits for the start of a baseball game against the Tampa Bay Rays Saturday, Oct. 3, 2015, in St. Petersburg, Fla. Photo: Steve Nesius, AP Toronto Blue Jays manager John Gibbons adjusts his cap as he waits... Collins, Gibbons among 4 managers making playoff debuts 1 / 6 Back to Gallery NEW YORK (AP) — Late in the season, as the New York Mets closed in on their NL East championship, one opponent after another sat in the visitors' dugout at Citi Field and commended manager Terry Collins . \"Real happy for T.C.,\" was the sentiment echoed by Atlanta skipper Fredi Gonzalez and others. The popular Collins, at 66 the oldest manager in the majors and the consummate example of a baseball lifer, is about to make his playoff managerial debut. He's one of four bench bosses who reached the postseason for the first time this year — each the fulfillment of a unique journey. \"It means a lot to me,\" Collins said late last week. \"We sat up here and we told our fan base and our media that it's going to get better and next year we're going to win. And then to be sitting today and say we told you, it means a lot. It does.\" Texas rookie Jeff Banister , Toronto retread John Gibbons and Houston whiz kid A.J. Hinch are the other managers making their initial October moves this month. In his second stint running the Blue Jays , Gibbons finally guided them to their first playoff berth in 22 years. The AL East champs host Banister and the Rangers on Thursday in the opener of their best-of-five Division Series. \"I was able to exhale a little bit,\" Gibbons said. \"A lot of satisfaction.\" Now comes the hard part. Even the first-timers are well aware that being a novice is no picnic in the playoffs, when every pressure-packed decision gets magnified and scrutinized. Plenty of successful managers, from Casey Stengel and Grady Little years ago to Matt Williams and Ned Yost just last season, have been widely criticized — even vilified — for fateful moves gone wrong. This time of year, fans are not forgiving. \"The first thing you have to do is forget about the regular season,\" said Hall of Fame hockey coach Scotty Bowman , who chatted with Gibbons behind the batting cage Saturday before the Blue Jays faced Tampa Bay. \"The way you played in the season is probably not going to be good enough. You've got to be a little better.\" Bowman won a record nine Stanley Cups. Meanwhile, Collins and the rest of this year's playoff neophytes have been working their entire careers to earn one shot at a World Series ring. \"I'm a baseball guy and I'm a baseball development guy,\" said Collins, who leads the Mets against the Dodgers beginning Friday night in Los Angeles. \"This summer, all I did was write the lineup and try to keep the clubhouse a fun place to be, and it worked out. So I was pretty happy the other day when we won that thing.\" Hinch gets the first crack at winning in the playoffs when his surprising Astros play at Yankee Stadium in the AL wild-card game Tuesday night. \"Octobers usually come through New York. At least they have in my career,\" he said Monday. Hinch was 34 and by far the youngest manager in the majors when the Stanford graduate took over the Arizona Diamondbacks in 2009. With no previous experience in that role, his ineffective tenure didn't last long. But he's been a big hit this year in his first season piloting the young Astros. \"Very open door. Very much a player's manager. For us, that's great. We need a guy like that, that lets us play,\" Houston ace Dallas Keuchel said. \"Kind of a trial by fire, but he has our backs. That's what he's done all year.\" Collins' career could hardly be more opposite. He managed in Japan and Venezuela, Vero Beach and Buffalo. He coached with Tampa Bay, scouted for the Chicago Cubs and spent more than a decade all told with the Dodgers during separate stints in their storied farm system. Along the way, the diminutive pepper pot developed a fiery reputation and seemingly crossed paths with almost everyone working in baseball. Still, he likes to joke about how his wife calls him \"an idiot\" whenever a pinch hitter or pitching change backfires. Collins managed Triple-A Albuquerque to a 1987 minor league championship in the Pacific Coast League . But until now, his only chance to wear a big league uniform in the postseason came as mentor Jim Leyland 's bullpen coach with the 1992 Pittsburgh Pirates . Once he got his opportunity to manage in the majors, Collins finished in second place five times during the 1990s, his Astros and Angels teams squandering several late leads. This time around, New York made needed moves to upgrade its muddling offense before the July 31 trade deadline. Given enough talent to win for the first time during his five-year tenure, Collins steered the Mets expertly as they pulled away from heavily favored Washington to claim their first playoff spot since 2006. \"In my years of managing in the major leagues, I never had these kind of changes on my team, and I was in pennant races for five straight years until the last week,\" Collins said. \"Now I see what the difference can make. I certainly wish I would have known that at those times because I would have pushed a lot harder to make some moves.\" His own task with the Mets has been complicated, though. New York often juggled its rotation down the stretch to rest its prized young pitchers — front-office decisions that sometimes ran counter to Collins' old-school instincts. \"He says things when he needs to, but he's definitely not on us all the time,\" Mets outfielder Curtis Granderson said. \"Lets us go ahead and learn from our bruises — all right, we fell down, we've got to find a way to pick ourselves back up.\" Entering his first postseason as a manager, that's one move Collins mastered long ago. ___ AP Baseball Writer Ronald Blum , and AP freelancers Mark Didtler in St. Petersburg, Florida, and Jose Romero in Phoenix contributed to this report. Southeast Texas sports news", "external_links": [], "published": "2015-10-06T13:29:00.000+03:00", "crawled": "2015-10-06T15:20:06.886+03:00", "highlightTitle": ""}