{"organizations": [], "uuid": "065a0308f9f7ecfedc1531a81c2bf8643a1596ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.clintonherald.com", "main_image": "http://clintonherald.com/content/tncms/live/global/resources/images/_site/og_image_clintonherald.jpg", "site_section": "http://www.clintonherald.com/search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&nsa=eedition&c[]=sports/high_school_sports,sports/high_school_sports/*&f=rss", "section_title": "Clinton Herald - sports/high school sports,sports/high school sports/", "url": "http://www.clintonherald.com/sports/high_school_sports/the-final-one-is-huge/article_1b69c53f-c2ff-5ed5-a2ef-20b3fd2cffec.html", "country": "US", "title": "The final one is huge", "performance_score": 0, "site": "clintonherald.com", "participants_count": 1, "title_full": "The final one is huge", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T14:00:00.000+03:00", "replies_count": 0, "uuid": "065a0308f9f7ecfedc1531a81c2bf8643a1596ad"}, "author": "Zach James Herald Asst. Sports Editor", "url": "http://www.clintonherald.com/sports/high_school_sports/the-final-one-is-huge/article_1b69c53f-c2ff-5ed5-a2ef-20b3fd2cffec.html", "ord_in_thread": 0, "title": "The final one is huge", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The final one is huge Win gives Kings a home playoff game The final one is huge By Zach James Herald Asst. Sports Editor The Clinton Herald \nCLINTON — The final regular-season football game for Clinton has great meaning. \nThe River Kings (5-3, 2-1 Class 4A District 8) will travel to Dubuque tonight to face Senior (3-5, 1-2), and Clinton’s seed in next week’s playoffs depends on the outcome. \nIf Clinton wins, it will clinch the No. 2 seed in the district, but if the Rams win, Clinton could drop to the No. 4 seed. A win also means the River Kings play at Coan Field next Wednesday for Round 1 of the playoffs. \nA loss puts them back on the road. \n“This game is the biggest game these guys have played in their football career,” Clinton Coach Jon Wauford said. “The stakes are great for us, and we’re attacking the game with that mentality. We handled and discussed it immediately on Saturday after our game last week. There’s no sense in pretending that there aren’t a lot of stakes on the line. These guys, our coaches and players have to understand it’s a big game.” \nThe River Kings picked up the No. 4 seed last season, and that didn’t turn out so well in the playoffs. \n“A two-seed would be awesome,” Clinton quarterback Johnny Sullivan said. “We have something special going on this year. Last year definitely isn’t the same as this year.” \nSullivan needs 24 passing yards Friday to get to 2,100 total for the season, and is two away from 25 touchdowns. \nClinton running back Gage Harris needs 26 rushing yards to reach the 1,000-yard milestone for the season. He also needs just 6 yards to have 1,300 total offensive yards from scrimmage. \nSenior’s lone win in district play this season was against Davenport West in Week 6, and the Rams have dropped two straight games. \nThe Rams have statistically turned to passing more in 2015. Their quarterback is Lee Bonifas, who has 824 passing yards, eight touchdowns and five interceptions. His completion percentage is near 47 percent. \nHis favorite target is Collin Seymour, with 21 connections for 277 yards and for two scores. \nJacob Osterberger is the team’s leading rusher with 525 yards on 124 carries, but Bonifas has kept the ball 118 times for 503 yards and six touchdowns. \n“They’re an offense that relies on their quarterback,” Wauford said. “It’s very obvious that he’s the guy that makes it go. He’s the guy we’ll be focusing on.” Sign Up / Sign In With your existing account from... {* loginWidget *}", "external_links": [], "published": "2015-10-23T14:00:00.000+03:00", "crawled": "2015-10-23T18:35:45.019+03:00", "highlightTitle": ""}