{"organizations": ["Red Bull"], "uuid": "745d2ca33ee67b939e12354970a202954cad067d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.sky.com", "main_image": "http://media.skynews.com/media/images/generated/2015/10/9/423118/default/v1/gettyimages-479552842-1-1600x900.jpg", "site_section": "http://feeds.skynews.com/feeds/rss/sports.xml", "section_title": "Sports News - Latest Sports and Football News | Sky News", "url": "http://news.sky.com/story/1566595", "country": "IL", "title": "Red Bull In Limbo Amid Engine Supply Problems", "performance_score": 0, "site": "sky.com", "participants_count": 0, "title_full": "Red Bull In Limbo Amid Engine Supply Problems", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T12:26:00.000+03:00", "replies_count": 0, "uuid": "745d2ca33ee67b939e12354970a202954cad067d"}, "author": "", "url": "http://news.sky.com/story/1566595", "ord_in_thread": 0, "title": "Red Bull In Limbo Amid Engine Supply Problems", "locations": ["UK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Red Bull In Limbo Amid Engine Supply Problems 10:26, UK, Friday 09 October 2015 Share by email Ferrari are believed to have decided against supplying Red Bull with engines for the 2016 Formula One season. \n\"Red Bull don't have an engine - I think it's absolutely clear that Ferrari won't and can't supply them with 2016 engines,\" Sky F1 pundit Martin Brundle confirmed. \nThe news seemingly leaves the former world champions on the brink of leaving F1 at the end of the season. \"Their only option is to walk away or rebuild bridges with Renault,\" added Brundle. \nSky F1 understands that Mercedes rejected fresh overtures from Red Bull for an engine supply last week - a month after first turning down their request. \nGerman publication Auto Motor Und Sport claims Ferrari are only willing to provide engines to Red Bull's junior outfit Toro Rosso amid fears that the former world champions would become too strong even if armed with a year-old set of V6 units. \n\"There are a lot of negotiations going on,\" Red Bull team boss Christian Horner told Sky F1. \"Nothing is fixed.\" \nDietrich Mateschitz, the owner of both Red Bull and Toro Rosso, has repeatedly warned since the start of season that he would withdraw from the sport unless his teams were given a competitive supply of engines. \nFt chief executive Bernie Ecclestone told reporters upon arriving in Sochi for this weekend's Russian GP that he was powerless to force Ferrari - who are already contracted to supply Haas and Sauber next year - to reach a deal with Red Bull. \nDivorce papers were served on their current suppliers, Renault, two months ago. Since then, Mercedes have formally rejected Red Bull's request for an engine supply while Honda, the only other engine suppliers on the grid, have an exclusive deal with McLaren for 2016. \n\"Unless the Renault contract has been declared null and void they still have a deal for next season,\" suggested Sky F1's David Croft. \"For 2017 there's nothing in place, but as far as I know for 2016 there is that contract in place. \n\"So Red Bull could carry on with Renault engines or they could walk away. But it's quite hard to see them making up to the extent they can all be happy families again.\" \nIt was the inadequacies of Renault's engines, unchanged since the start of the year, which first gave rise to fears that Red Bull would leave F1. \nHorner declared last week that he believed the French manufacturer was \"at least two to three years\" behind Ferrari and Mercedes. Promoted Stories", "external_links": [], "published": "2015-10-09T12:26:00.000+03:00", "crawled": "2015-10-09T15:03:11.293+03:00", "highlightTitle": ""}