{"organizations": [], "uuid": "fca4c9c8811a9afca1954f7cc41c015b3177a42e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.weei.com", "main_image": "http://www.weei.com/sites/default/files/pictures/redsox/Ramirez-Hanley%20Red%20Sox%2006.15.15.jpg", "site_section": "http://www.weei.com/all_columns/feed", "section_title": "Weei.com sports news and analysis", "url": "http://www.weei.com/sports/boston/baseball/red-sox/john-tomase/2015/10/06/five-red-sox-players-we-have-no-idea-how-read-", "country": "US", "title": "Five Red Sox players we have no idea how to read entering offseason", "performance_score": 0, "site": "weei.com", "participants_count": 1, "title_full": "Five Red Sox players we have no idea how to read entering offseason", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T08:28:00.000+03:00", "replies_count": 0, "uuid": "fca4c9c8811a9afca1954f7cc41c015b3177a42e"}, "author": "John Tomase", "url": "http://www.weei.com/sports/boston/baseball/red-sox/john-tomase/2015/10/06/five-red-sox-players-we-have-no-idea-how-read-", "ord_in_thread": 0, "title": "Five Red Sox players we have no idea how to read entering offseason", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Weei » Columnists » John Tomase » Five Red Sox players we have no idea how to read entering offseason john tomase Five Red Sox players we have no idea how to read entering offseason Tue, 10/06/2015 - 1:28am Tweet \nThe building blocks are clearly in place. Xander Bogaerts and Mookie Betts have the potential to be franchise players, and both only just turned 23. Young catcher Blake Swihart provides another enviable talent up the middle. \nIt's the question marks that concern me as we sit here at the start of the offseason. Consider the following five players and their importance to 2016. If you can say with certainty what the Red Sox can expect from each, God bless. I know I can't. \n1. Hanley Ramirez \nThe hope remains that the Red Sox find a way to get him gone. Ramirez was a disaster practically from start to finish, and Dombrowski has already made it clear that he's not interested in the return of weightlifter Hanley next spring. \nHe wants Ramirez to lose 15-20 pounds, regain his leaner body type, and shift to first base. Hanley loves his bulked up physique – in retrospect, it probably should've been a red flag that David Ortiz admonished him not to get any bigger over the winter – and there's no guarantee he'll slim down. \nIn fact, pretty much nothing is guaranteed with Ramirez. Can he lose weight? Can he play first? Can he stay healthy? It feels like the answer to all of these questions will be no, which is why Dombrowski must do his best to make him someone else's problem. \nHowever, as many a wisecracking TV sidekick has noted: \"Good luck with that.\" \n2. Jackie Bradley Jr. \nI mentioned this in a random-thoughts column the other day, so to recap: \nBradley hit .188 over his first 550 lifetime plate appearances, followed by .446 for 25 games this August and September, and then finally .138 over the last month. \nThat's a sub-.200 hitter for 90 percent of his career and a monster for the other 10. That's concerning. \nAnd yet many are jumping straight to the argument of whether Bradley or Betts should start in center next year. Let's back up. The real question is: can Bradley hit enough to remain a viable everyday player? \nWe still don't know. By September, he was back to popping up, striking out, and rolling over, though he did at least hit some balls hard over the final week. \nHaving a transcendent month is better than not having one, but it doesn't establish him as an everyday player. Not by a longshot. \nThe Red Sox do not want a repeat of 2014, when they entrusted Bradley with a job and he responded by hitting .198, so they'd best acquire some veteran competition to join him in Fort Myers. \n3. Rusney Castillo \nThis one is basically a corollary to Bradley. \nWhile Castillo is advanced defensively, he's no Bradley. And besides, left field is an offensive position in Fenway Park . \nWho knows what was in the water in August, but Castillo went off, too, hitting .391 with three homers, 18 RBIs, and a 1.051 OPS from Aug. 1-24. \nHe was a disaster the rest of the way, though, batting .185 with a .458 OPS. He finished the season with a .647 OPS. \nThat's not good enough for a fourth outfielder, let alone a $72.5 million investment. Castillo often looks overmatched, his speed does not play up because he's slow out of the box, and his power is inconsistent. \nHis best tool is his arm, and the longest throw he's going to make from left is about 260 feet. \nIs he good enough? The Red Sox should be looking to create competition in his outfield spot, too. \n4. Rick Porcello \nThere's a feeling that after a lost 2015 season, perhaps the best we should realistically hope for out of Porcello is the 2014 he authored in Detroit, when he went 15-13 with a 3.43 ERA and only 129 strikeouts in 204 2/3 innings. \nDombrowski clearly didn't think much of that, because rather than extend Porcello, he shipped him to the Red Sox last winter for outfielder Yoenis Cespedes, a trade that ended up favoring Detroit. \nWith Porcello, 26, entering his prime and the Red Sox on the hook for more than $20 million annually starting next year, it seemed reasonable to assume his game would take another step forward. But maybe not. \n\"I can't do things that I'm not capable of doing,\" Porcello told colleague Rob Bradford last week. \"I'm not going to have success doing that. I'm going to go out there and go back to doing the way I've done it my entire career, be a steady worker for our ballclub. That's where my value is and I think that's why I was brought here. Not to be somebody else, but to be who I have been.\" \nIf Porcello's ceiling is what he produced in 2014, then he'll be the highest-paid third- or fourth-starter in history. There's still value there, but not necessarily bang for the buck. \n5. Joe Kelly \nTo paraphrase Eminem, won't the real Joe Kelly please stand up? \nIs he the starter who won eight straight outings from Aug. 1 to Sept. 9 with a 2.59 ERA? Or is he the struggling right-hander who got himself demoted to Triple-A Pawtucket in June because he couldn't command the strike zone or pitch much beyond the fifth? \nWe still don't know for certain, in part because Kelly's season ended on Sept. 15, when he left his start against the Orioles with a stiff shoulder. \nKelly subsequently said he was fine, but we won't know for certain until we see him again in Fort Myers. In the meantime, we're left to wonder if his August performance represents the turning of a corner, or just another tantalizing false start.", "external_links": [], "published": "2015-10-06T08:28:00.000+03:00", "crawled": "2015-10-06T08:42:53.214+03:00", "highlightTitle": ""}