{"organizations": [], "uuid": "f41c1b1289845add4edb356e1fea1e9cb88bca84", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.baltimoresun.com", "main_image": "http://www.trbimg.com/img-561c354c/turbine/ph-hs-district-v-golf-championship-20151012", "site_section": "http://www.baltimoresun.com/sports/high-school/rss2.0.xml#", "section_title": "High School Sports - Baltimore Sun", "url": "http://www.baltimoresun.com/news/maryland/howard/sports/ph-hs-district-v-golf-championship-20151012-story.html", "country": "US", "title": "Marriotts Ridge, Jung steal headlines at District V golf championships", "performance_score": 0, "site": "baltimoresun.com", "participants_count": 1, "title_full": "Marriotts Ridge, Jung steal headlines at District V golf championships", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T14:56:00.000+03:00", "replies_count": 0, "uuid": "f41c1b1289845add4edb356e1fea1e9cb88bca84"}, "author": "Brent Kennedy", "url": "http://www.baltimoresun.com/news/maryland/howard/sports/ph-hs-district-v-golf-championship-20151012-story.html", "ord_in_thread": 0, "title": "Marriotts Ridge, Jung steal headlines at District V golf championships", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Marriotts Ridge, Jung steal headlines at District V golf championships Mt. Hebron's Josephine Jung wins second District V golf title \nMt. Hebron's Josephine Jung talks about winning her second straight District V golf title Monday, Oct. 12. (Brent Kennedy and Dan Griffin, Baltimore Sun Media Group) \nMt. Hebron's Josephine Jung talks about winning her second straight District V golf title Monday, Oct. 12. (Brent Kennedy and Dan Griffin, Baltimore Sun Media Group) Brent Kennedy Contact Reporter At District V Championships, Marriotts Ridge's golf team and Mt. Hebron's Josephine Jung defend their titles \nThe Marriotts Ridge golf team and Mt. Hebron senior Josephine Jung appear to have figured out the formula that goes along with peaking at the right time. \nAt the District V Championships on Monday at Fairway Hills, the Mustangs — posting a program-record score of 296 — and Jung — firing a round of 71 to win by three — were both repeat winners. In the final tune-up before the state tournament scheduled for Oct. 26-28 at the University of Maryland golf course, a championship pedigree went a long way. \n“This is just a really, really special bunch of guys,” said Marriotts Ridge coach Mark Dubbs, whose team has now won four straight District championships and will be aiming for its fourth straight state title as well in a couple weeks. “We’ve gotten to the point now where our goals go beyond winning … we are looking at scores. Today, for example, the goal was to break 300 and I think they were all motivated to break that mark. \n“They continue to rise to the challenge and it’s not just one guy … it’s all of them.” \nJung, who needed some strong play on the back nine to hold off a surge from Howard’s Jackie Cherry, said she’s seen a steady progression from herself to the point where she’s now establishing a legacy of her own. Broadneck's Connor Jaenke takes title at District V Championships \nWhile the team race and girls individual competition saw familiar faces come out on top, the boys championship came down to two guys that had never finished inside the top three at the event. \nUltimately, Broadneck’s Connor Jaenke outlasted Marriotts Ridge’s Jackson Courtney on the first playoff hole to win the title. Jaenke, who won the Anne Arundel County Championship tournament last week, had watched Courtney eagle the final hole in regulation to force extra holes. \nWhile the team race and girls individual competition saw familiar faces come out on top, the boys championship came down to two guys that had never finished inside the top three at the event. \nUltimately, Broadneck’s Connor Jaenke outlasted Marriotts Ridge’s Jackson Courtney on the first playoff hole to win the title. Jaenke, who won the Anne Arundel County Championship tournament last week, had watched Courtney eagle the final hole in regulation to force extra holes. See more videos \n“It feels really good because I started freshman year and I was not very good. I then have slowly improved each year,” she said. “Having the mental game this time, not freaking out or anything … it really helped.” \nWhile the team race and girls individual competition saw familiar faces come out on top, the boys championship came down to two guys that had never finished inside the top three at the event. \nUltimately, Broadneck’s Connor Jaenke outlasted Marriotts Ridge’s Jackson Courtney on the first playoff hole to win the title. Jaenke, who won the Anne Arundel County Championship tournament last week, had watched Courtney eagle the final hole in regulation to force extra holes. \nFairway Hills Golf Course played host to the District V championship golf tournament on Monday, October 12,2015. (Matt Hazlett for the Baltimore Sun Media Group photos) \nBut playing No. 18 head-to-head in sudden death, Jaenke locked things up by sinking a 20-foot putt for par to win by one. \n“The last putt — I had been missing them short all day — I was not missing that one short,” said Jaenke. “As soon as I hit it, I felt like it was going in. So it was a good way to finish.” \nCourtney, whose 72 during regulation marked the best postseason round of his high school career, had no regrets afterward. \n“If he’s going to make a 25-footer on the last hole for par, then he kind of deserves it,” he said. “To even get there, you know, I didn't really have the best day and made a lot of mistakes … but I hit a really, really good shot on 18 and I eagled to get in the playoff. \n“All in all it was a good day. Postseason means a lot and I guess it’s kind of good to show good form right before states.” \nWhile he came up short individually, Courtney’s efforts did go a long way in the team competition. His two-over-par round was followed closely behind by a pair of 73s from Bennett Buch and John Szymanski. Throw in a 78 by Nick Mejia and the Mustangs had four of the top eight boys golfers in the tournament. \nMarriotts Ridge wasn’t the only Howard County success story, though. Led by Jung, Mt. Hebron also qualified for states as a team to make a little program history. \nThe quartet of Jung, Jack Montgomery (76), Lake Lloyd (83) and Liam Hall (89) produced a team total of 319 to become the first Vikings’ golf team — since golf became an official varsity sport again in Howard County in 2005 — to make the season-ending tournament. \n“We’ve had individuals go to states, like Josephine and Patrick the last couple years, but we’ve never gone as a team. So for our program, it’s spectacular,” said Mt. Hebron coach Don Walters. “It was in the back of our mind that if everyone pulled their weight, and Josephine came up with a nice low score, we would have a real chance to sneak in as a team. So to actually see that happen is just awesome.” \nHaving a star like Jung leading the charge paid huge dividends for Mt. Hebron, especially down the stretch. The senior, who had fired a round of 75 last year on her way to eventually winning the tournament in a playoff, played her final five holes Monday in 2-under par en route to winning in regulation this time around. \nTrailing Cherry by two shots heading to the 13 th hole, Jung said she knew she had to pick things up. At the same time, though, she never panicked. \n“I did get a little nervous, but I was thinking that there was a lot of golf left and anything could really happen,” Jung said. \nJung made a birdie on No. 14, her second birdie of the day at the time, and then later added another birdie on her final hole to seal the victory. \nFor Cherry, who had made back-to-back birdies on holes No. 11 and 12 to grab sole possession of the lead for the first time all day, the runner-up finish was disappointing but still showcased tremendous improvement since a year ago. \n“I’m definitely happy overall and, while it would have been nice to win, I improved 11 strokes from last year,” Cherry said. “I’m proud of my progress.” \nAs a whole, Howard County qualified six individuals — three boys and three girls — for the state tournament. Reservoir’s Daniel Kim (77), Atholton’s Nick Osterman (78) and Glenelg’s Hayden Mikk (79) made it for the boys, while Cherry, Marriotts Ridge’s Katelyn McIlvain (80) and Howard’s Alex Abrams (87) qualified among the girls. \nTeam scores: 1. Marriotts Ridge, 296 (1A/2A); 2. Mt. Hebron, 319; 3. Broadneck, 326; 4. Glenelg, 329; 5. River Hill, 333; 6. Reservoir, 336; 7. Severna Park, 342; 8. Arundel, 344; 9. Howard, 356; 10. South River, 365. \n11. Chesapeake, 369; 12. Centennial, 371; 13. Atholton, 401; 14. Old Mill, 409; 15. Long Reach, 446. \nQualifying boys individuals: 1. Connor Jaenke, Broadneck, 72*; 2. Jackson Courtney, Marriotts Ridge, 72; 3. Bennett Buch, Marriotts Ridge, 73; 3. John Szymanski, Marriotts Ridge, 73. 5. Jack Montgomery, Mt. Hebron, 76; 6. Daniel Kim, Reservoir, 77; 7. Nick Mejia, Marriotts Ridge, 78; Nick Osterman, Atholton, 78; 9. Cameron McCartney, Broadneck, 79; 9. Joe Gaulin, South River, 79; Drew Kirby, Glen Burnie, 79; Jordan Strom, Severna Park, 79; Matt Snowdon, Severna Park, 79; Hayden Mikk, Glenelg, 79. \nQualifying girls individuals: 1. Josephine Jung, Mt. Hebron, 71; 2. Jacqueline Cherry, Howard, 74; 3. Brianna Cochran, Annapolis, 80; 3. Katelyn McIlvain, Marriotts Ridge, 80; 5. Alex Abrams, Howard, 87.", "external_links": [], "published": "2015-10-12T14:56:00.000+03:00", "crawled": "2015-10-14T01:22:45.010+03:00", "highlightTitle": ""}