{"organizations": [], "uuid": "e0057c203523101e82b2d6da6ae59436ea36f2cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www2.ljworld.com", "main_image": "http://worldonline.media.clients.ellingtoncms.com/static/ljworld.com/images/ljw-logo-1200.jpg", "site_section": "http://www2.ljworld.com/rss/headlines/sports/professional/", "section_title": "LJWorld.com stories: Professional sports", "url": "http://www2.ljworld.com/news/2015/oct/17/vikings-peterson-lends-support-kcs-charles/", "country": "US", "title": "Vikings’ Peterson lends support to K.C.’s Charles", "performance_score": 0, "site": "ljworld.com", "participants_count": 1, "title_full": "Vikings’ Peterson lends support to K.C.’s Charles", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T08:00:00.000+03:00", "replies_count": 0, "uuid": "e0057c203523101e82b2d6da6ae59436ea36f2cd"}, "author": "Associated Press", "url": "http://www2.ljworld.com/news/2015/oct/17/vikings-peterson-lends-support-kcs-charles/", "ord_in_thread": 0, "title": "Vikings’ Peterson lends support to K.C.’s Charles", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Associated Press — Associated Press October 17, 2015 \nAdvertisement \nIn the days after Adrian Peterson tore the ligaments in his left knee in a game against Washington, Chiefs running back Jamaal Charles reached out to him with encouragement. \nCharles was already going through rehab for the same injury sustained earlier that season. \nNow, four years later, Peterson is returning the favor. \nThe Vikings running back said this week he will invite Charles to work out with him in the offseason — both are native Texans who return home during the summer. The idea is that he could help push Charles through rehab after his second torn ACL sustained last Sunday. \n“I hate for him to go down like that, my guy go down,” said Peterson, whose Vikings host the Chiefs on Sunday. “He’s been through it before with his left knee and now he knows what to expect doing his rehab. That’s one positive.” \nCharles tore the ACL in his right knee early in the 2011 season, while Peterson was hurt in December. Both of them were back on the field by the start of the next season. \nStill, there are no guarantees with such a devastating injury, particularly to a running back whose speed is his biggest asset. While Charles was able to overcome his first torn ligament, the surgery and rehab required four years later may not leave him the same player as before. \n“I would caution you in trying to compare the last injury to this one, and who’s made it back and how fast they made it back,” Chiefs trainer Rick Burkholder said. \nThe Chiefs already have spoken with noted orthopedist Dr. James Andrews, who performed the surgery on Charles four years ago. Andrews likely will handle this procedure as well. \n“It looks like he’s leaning that way, going down there to have it done,” Burkholder said. “(Charles) has already been through some rehab sessions here to get ready.” \nCharles was hurt early in the third quarter of Sunday’s loss to Chicago, when he made a jump cut and his right knee buckled. He immediately reached for his right knee, and never put weight on it as he was helped off the field. The Chiefs confirmed the torn ACL after an MRI on Monday. \nThe injury not only deprives the Chiefs (1-4) of their biggest playmaker, but also the most consistent performer on an inconsistent offense. \nCharles averages more than five yards per carry, and his ability to loosen up defenses is helpful to quarterback Alex Smith, who has yet to prove that he can carry the Chiefs on the strength of his right arm. \nThe Chiefs worked out several running backs, including former Texans rusher Ben Tate, but decided to elevate Spencer Ware from the practice squad. The former LSU standout will be part of a running back-by-committee approach with Knile Davis and Charcandrick West. \n“They all need to work together and do their thing,” Chiefs coach Andy Reid said.", "external_links": [], "published": "2015-10-17T08:00:00.000+03:00", "crawled": "2015-10-17T12:38:36.971+03:00", "highlightTitle": ""}