{"organizations": ["FIFA"], "uuid": "c60133ea2c3a43804588c5b46fd801466f4c46c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "jakartaglobe.beritasatu.com", "main_image": "http://img.thejakartaglobe.com/2015/10/FBL-FIFA-CORRUPTION-192206-01-02-1024x681.jpg", "site_section": "http://jakartaglobe.beritasatu.com/rss/sports/", "section_title": "Sports | Jakarta Globe", "url": "http://jakartaglobe.beritasatu.com/football/beckenbauer-villar-named-fifa-ethics-probe/", "country": "ID", "title": "Beckenbauer and Villar Named in FIFA Ethics Probe", "performance_score": 0, "site": "beritasatu.com", "participants_count": 0, "title_full": "Beckenbauer and Villar Named in FIFA Ethics Probe", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T23:49:00.000+03:00", "replies_count": 0, "uuid": "c60133ea2c3a43804588c5b46fd801466f4c46c1"}, "author": "", "url": "http://jakartaglobe.beritasatu.com/football/beckenbauer-villar-named-fifa-ethics-probe/", "ord_in_thread": 0, "title": "Beckenbauer and Villar Named in FIFA Ethics Probe", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Villar", "Beckenbauer"], "text": "INDEX Beckenbauer and Villar Named in FIFA Ethics Probe i The ethics committee was given the right to disclose information about cases by FIFA's executive committee on Tuesday and wasted no time in taking advantage of its new freedom. (AFP Photo/Fabrice Coffrini) Category : Sports , Football \nZurich. The FIFA scandal swept up one of the greatest football players of all time on Wednesday, when Franz Beckenbauer's name appeared on a new list of individuals facing possible sanction from the scandal-hit body's ethics committee. \nFIFA and UEFA vice-president Angel Maria Villar of Spain and other former FIFA executive committee members were also named on Wednesday. \nEarlier this month FIFA suspended president Sepp Blatter for 90 days along with European football head Michel Platini — like Beckenbauer, once a legendary international player. \nThe ethics committee was given the right to disclose information about cases by FIFA's executive committee on Tuesday and wasted no time in taking advantage of its new freedom. \nThe committee said it had completed investigations into both Beckenbauer and Villar and the cases had been passed to its ethics judge for a final decision. \nA spokesman for the Adjudicatory Chamber of the Ethics Committee said both cases related to non-cooperation with the committee's investigations. \nBeckenbauer was a World Cup winner with West Germany as a player and coach and a FIFA executive committee member from 2007 to 2011. \nVillar has been president of the Spanish Football Federation since 1988 and is a vice-president of both FIFA and European governing body UEFA as well as head of FIFA's legal committee. \nIn June 2014, Beckenbauer was suspended for 90 days by FIFA for refusing to cooperate with then ethics investigator Michael Garcia's probe into the World Cup votes. The ban was lifted after two weeks when the German agreed to answer Garcia's questions but his behaviour has faced further scrutiny from Garcia's replacement as investigator, Cornel Borbely. \nThe ethics committee confirmed that, as widely reported, \"proceedings are ongoing\" against Blatter and Platini \"regarding a payment of CHF 2 million from FIFA to Michel Platini in February 2011.\" \nBoth men have already been given 90-day provisional bans pending their full investigations and are appealing against those suspensions. \nBid for presidency \nBlatter has called the payment, which was made nine years after Platini finished working for FIFA as an adviser, a \"gentlemen's agreement.\" \nBoth men have denied wrongdoing but the affair has thrown grave doubt over Platini's bid to replace Blatter as FIFA president in an election scheduled for February 26. \nSuspended FIFA secretary general Jerome Valcke's \"ongoing proceedings\" were also confirmed. The ethics committee said his case \"related to the suspicion of misuse of expenses and other infringements of FIFA's rules and regulations.\" \nValcke was suspended by FIFA in September shortly after he had been accused by a ticket-dealer of having been part of a scheme to sell World Cup tickets at a marked-up price. \nThe committee also said six other former FIFA executive committee members were under investigation. All have been suspended or have resigned from office. \n\"Formal investigation proceedings relating to the suspicion of infringements of the FIFA Code of Ethics are amongst others ongoing against Worawi Makudi, Jeffrey Webb, Ricardo Teixeira, Amos Adamu, Eugenio Figueredo and Nicolás Leoz,\" said the statement. \nCayman Islander Webb, president of the Confederation for North and Central America and the Caribbean, was arrested in May as one of 14 officials and sports marketing executives indicted on corruption charges by the US Department of Justice. \nSeven of those named by the ethics committee on Wednesday were members of the FIFA executive committee which voted in December 2010 to hand the World Cup hosting rights for 2018 to Russia and 2022 to Qatar. \nThree members of that committee, former Caribbean official Jack Warner, American Chuck Blazer and Mohammed Bin Hammam of Qatar, have been banned for life. South Korean Chung Mong-joon was banned from the game for six years by the ethics committee earlier this month. \nThat means 11 of the 22 men who voted to back Russia and Qatar have been banned or are under investigation. \nReuters", "external_links": [], "published": "2015-10-21T23:49:00.000+03:00", "crawled": "2015-10-22T08:48:44.398+03:00", "highlightTitle": ""}