{"organizations": ["ASU", "Alabama News Network"], "uuid": "6629c132c44c833a728f5c528f1cc1de706e336b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.alabamanews.net", "main_image": "http://redirect.bimfs.com/package/thumb/e018ea48ffb7166aa75d3cbe64ace304a3058422.jpg", "site_section": "http://www.waka.com/sports/index.rss2", "section_title": "WAKA - CBS 8 Sports", "url": "http://www.alabamanews.net/sports/ASU-ENJOYS-BYE-WEEK-336076271.html", "country": "US", "title": "ASU ENJOYS BYE WEEK", "performance_score": 0, "site": "alabamanews.net", "participants_count": 0, "title_full": "ASU ENJOYS BYE WEEK", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T02:31:00.000+03:00", "replies_count": 0, "uuid": "6629c132c44c833a728f5c528f1cc1de706e336b"}, "author": "", "url": "http://www.alabamanews.net/sports/ASU-ENJOYS-BYE-WEEK-336076271.html", "ord_in_thread": 0, "title": "ASU ENJOYS BYE WEEK", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Alabama News Network \nStory Created: Oct 22, 2015 at 6:31 PM CDT MONTGOMERY – While the Alabama State University's football team will be off this week there continues to be a lot of work that has to be done. Head Coach met with the local media today for his weekly press conference and discussed what the team was doing during the off week. \n\"Anytime you can get an off week, get your guys healed up a little bit, get a chance to refresh yourselves as coaches and get a chance to look at some film you normally don't get a chance to look at during the week and see some things you need to correct and it gives you a good chance to return to the football fundamentals,\" Jenkins said. \"More than anything else football fundamentals gives you a chance to win some ball games. There have been some football fundamentals we have not been doing well during the year that we need to correct. So yes definitely it has come at the right time.\" It is also a week where the coaches will have some time to contact some recruits and to hit the recruiting trail. \"It (the off week) gives us a chance to get out on the road and recruit and sell our program,\" Jenkins said. \"We are coming off a victory, we are coming off a televised game and it gives us a chance to go and see some of the guys we have been targeting for the future. So it is important to have this open weekend right now so we can go and see where these guys are at and then you also have a chance with what's left of the season to see some other guys.\" Even though the next game is still 10 days away, it is the Magic City Classic. It will be Jenkins first time to coach in the Classic and already he has heard from the ASU fans how important the game is. \"The fan base, their kids, their unborn kids are letting me know (how big a game this is), it's been crazy,\" Jenkins said. \"To me I see every game like I see the Magic City Classic. I see it as a rivalry game, a game of importance and it's a game that we want to win and that we're going to prepare for.\" Coach Jenkins also announced today the Hornets have adopted E.D. Nixon Elementary School. Next week the Hornets will go to the school at 1 p.m. to spend some Halloween trick or treat time with the students.", "external_links": [], "published": "2015-10-23T02:31:00.000+03:00", "crawled": "2015-10-23T16:32:24.763+03:00", "highlightTitle": ""}