{"organizations": [], "uuid": "bc88ef4855af8ea38c731510837f04786ba2999b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.adelaidenow.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/external?url=http://content4.video.news.com.au/foxsports/prod/archive/2015/10/12/FSD_121015_WLEAGUE_LAUNCH.jpg&width=650&api_key=kq7wnrk4eun47vz9c5xuj3mc", "site_section": "http://www.adelaidenow.com.au/sport", "section_title": "Sport | Sports News and Results | The Advertiser", "url": "http://www.adelaidenow.com.au/sport/cricket/mike-hussey-set-to-lead-out-prime-ministers-xi-against-new-zealand/story-fnii0bxe-1227572776582", "country": "US", "title": "Mike Hussey set to lead out Prime Minister’s XI against New Zealand", "performance_score": 0, "site": "adelaidenow.com.au", "participants_count": 1, "title_full": "Mike Hussey set to lead out Prime Minister’s XI against New Zealand | The Advertiser", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T03:01:00.000+03:00", "replies_count": 0, "uuid": "bc88ef4855af8ea38c731510837f04786ba2999b"}, "author": "DAVID PACKWOOD", "url": "http://www.adelaidenow.com.au/sport/cricket/mike-hussey-set-to-lead-out-prime-ministers-xi-against-new-zealand/story-fnii0bxe-1227572776582", "ord_in_thread": 0, "title": "Mike Hussey set to lead out Prime Minister’s XI against New Zealand", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "IT will be a case of second time lucky when former Australian cricketer Mike Hussey leads the Prime Minister’s XI into battle against the New Zealand Black Caps at Manuka Oval on Friday.\nHussey was selected to captain the PM’s side last summer but a calf injury playing for the Sydney Thunder in the Big Bash League forced him to withdraw.\nHowever the man nicknamed ‘Mr Cricket’ is back and excited by the opportunity to lead the PM’s XI against the Black Caps.\n“I’m really looking forward to following in the footsteps of cricketing greats such as Ricky Ponting and Brett Lee in captaining the PM’s XI side,” Hussey said.\n“I was really disappointed to miss last year’s clash so I’m personally looking to put on a good show for the fans,” he added.\n“The team that will be selected is sure to include a host of emerging young cricketers all keen to perform well against a quality side like the Kiwi’s.”\nCricket Australia CEO, James Sutherland said that the Prime Minister’s XI fixture has always been an important annual event on the Australian cricket calendar.\n“New Zealand are one of the most competitive teams on the international stage and that augers well for a great contest at what we hope will be another full house at Manuka Oval,” he said.\nFriday’s match will be the New Zealand’s first official match on Australian shores before the first Test match in Brisbane which begins on November 5.\nSimone Nalder has enjoyed a stellar year. Source: News Corp Australia\nCANBERRA Darters import Simone Nalder has capped off an outstanding Australian Netball League season by taking out the club’s Player of the Year Award. Nalder, who was a member of the Victoria Fury ANL championship winning side from 2011-13, joined the Darters this season as one of two imports.\nThe former AIS scholarship holder was a focal point in the shooting circle scoring 92 goals in her seven appearances for the Darters.\n“Simone was a great asset for us this season with her experience important among a relatively young squad,” Darters coach Melinda Clarke said.\n“As the season progressed her partnership with Australian U21 representative Allison Miller got stronger and proved a real handful for opposition defenders.”\n“Simone’s leadership both on and off the court was outstanding.”\nThe player who received the most votes in the Australian Netball League MVP award determined the Darter’s Player of the Year award.\nThat player is also inducted into the Darters Hall of Fame with Nalder now joining some very illustrious company. Former Darters import and Melbourne Vixens ANZ championship winning player Caitlyn Strachan was inducted into the Hall of Fame in 2011.\nOther past recipients include former Australian U21 player Keely Rodrigo (2013-14), Jo Pivac (2008- 2012) and Susan Pratley (2004-05).\nMichelle Heyman will be back with the Matildas to face China. Source: Getty Images\nCANBERRA United striker Michelle Heyman and goalkeeper Lydia Williams have been selected in the 21-player Matildas squad for upcoming international matches in China.\nThe Matildas will play matches against China and England with the possibility of a third game being added onto the tour.\n“These are important games for the Matildas as they will be crucial preparation ahead of our Olympic qualifiers in February next year,” Matildas coach Alen Stajcic said.\n“It’s a good opportunity for players who were in our World Cup squad to keep their spot but also an opportunity for some new players to show what they can do at the international level.”\nThe Matildas squad includes four new faces with Amy Harrison, Caitlin Cooper, Georgia Yeoman-Dale and Tara Andrews impressing selectors at a recent training camp in Canberra.\nMeanwhile, defending W-League champions Canberra United will take on the Brisbane Roar in their opening game of the season at Suncorp Stadium.\nThe match commences at 2pm.\n Hussey returns for Capital assignment", "external_links": ["http://www.dailytelegraph.com.au/sport/cricket/mike-hussey-set-to-lead-out-prime-ministers-xi-against-new-zealand/story-fni2fnmo-1227572776582", "http://resources3.news.com.au/images/2015/10/17/1227572/775359-08b33816-74a9-11e5-9c0a-ce1ed3f9b0e3.jpg", "http://resources2.news.com.au/images/2015/10/17/1227572/776526-e961af06-74a8-11e5-9c0a-ce1ed3f9b0e3.jpg"], "published": "2015-10-18T03:01:00.000+03:00", "crawled": "2015-10-17T15:38:25.555+03:00", "highlightTitle": ""}