{"organizations": [], "uuid": "12df590e29489705974c71c4b0ca0efd865fd879", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtontimes.com", "main_image": "http://media.washtimes.com.s3.amazonaws.com/media/image/2015/10/10/383243598c1f642d840f6a7067003f40.jpg", "site_section": "http://www.washingtontimes.com/rss/headlines/sports/", "section_title": "www.washingtontimes.com stories: Sports", "url": "http://www.washingtontimes.com/news/2015/oct/10/doeren-disappointed-as-wolfpack-fades-after-fast-s/", "country": "US", "title": "Doeren disappointed as Wolfpack fades after fast start", "performance_score": 0, "site": "washingtontimes.com", "participants_count": 1, "title_full": "Doeren disappointed as Wolfpack fades after fast start", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T07:48:00.000+03:00", "replies_count": 0, "uuid": "12df590e29489705974c71c4b0ca0efd865fd879"}, "author": "HANK KURZ Jr.", "url": "http://www.washingtontimes.com/news/2015/oct/10/doeren-disappointed-as-wolfpack-fades-after-fast-s/", "ord_in_thread": 0, "title": "Doeren disappointed as Wolfpack fades after fast start", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sports Doeren disappointed as Wolfpack fades after fast start North Carolina State head coach Dave Doeren leaves the field after an NCAA college football game against Virginia Tech, Friday, Oct. 9, 2015, in Blacksburg, Va. Virginia Tech won 28-13. (Matt Gentry/The Roanoke Times via AP) LOCAL TELEVISION OUT; SALEM ... more > By HANK KURZ Jr. - Associated Press - 12:48 a.m., Saturday, October 10, 2015 \nBLACKSBURG, Va. (AP) - A fast start had North Carolina State feeling good at Lane Stadium on Friday night. \nWhat followed left coach Dave Doeren disappointing, and grateful for a week off ahead. \nBrenden Motley and Isaiah Ford teamed up for three second-quarter touchdown passes and Virginia Tech found a winning formula at home again, snapping a two-game slide in a 28-13 victory against North Carolina State. \nThe Wolfpack (4-2, 0-2 Atlantic Coast Conference) dropped its second straight league game after rolling through September. And they did it after rolling to a 10-0 lead against the Hokies. \n“Obviously, disappointed is an understatement,” Doeren said. “We had a fast start to the game and I thought we battled back in the third quarter, but very disappointed in our second quarter. Obviously their response was good and ours wasn’t in the second quarter.” \nThat was when the Hokies (3-3, 1-1) outscored them 21-0 and outgained them 156-2, beginning a closing stretch that saw the Wolfpack gain 145 yards in the first quarter and just 125 - and score just 3 more points - the rest of the way. \nThose three, on Kyle Bambard’s second field goal, made it 21-13 late in the third quarter, but the Hokies responded by converting a third-down play, and then setting Travon McMillian loose for a clinching 59-yard touchdown run with 6:54 to play. \n“We came back and we were fighting to get back in the game and gave up the big play,” Doeren said. \nThe Hokies avoided their third home loss in four games. \nMotley, who has been filling in while injured starter Michael Brewer recovers from a broken left collarbone, got his fifth start when Brewer was cleared to practice, but not play in a game. Motley was 14 of 28 for 158 yards and ran for 44 yards on nine tries. \nMcMillian’s touchdown was the first of his career. \nVirginia Tech also ended Wolfpack quarterback Jacoby Brissett’s streak of attempts without being intercepted at 241. Adonis Alexander did the honors, picking off a pass with 1:20 remaining. \nBrissett was 12 of 25 for just 113 yards. He was sacked four times. \nThe Hokies, needing badly to reverse a trend that had seen them lose six of their last seven home games against teams from the Power Five conferences, finally found some offensive consistency after falling behind. \nMotley hit McMillian for 19 yards and Cam Phillips for 14 yards on consecutive plays early in the second quarter. Three plays later, on third-and-6, Motley hit Ford from 27 yards, a touchdown making it just 10-7.", "external_links": [], "published": "2015-10-10T07:48:00.000+03:00", "crawled": "2015-10-10T08:49:50.667+03:00", "highlightTitle": ""}