{"organizations": [], "uuid": "090815613675dd4958a63cc382a9ab20b2dcec39", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.saudigazette.com.sa", "main_image": "", "site_section": "http://www.saudigazette.com.sa/index.cfm?method=home.cat&categoryid=2015100565339", "section_title": "Sports | Saudi Gazette", "url": "http://www.saudigazette.com.sa/index.cfm?method=home.con&contentid=20151005258726", "country": "US", "title": "Scherzer throws no-hitter again", "performance_score": 0, "site": "saudigazette.com.sa", "participants_count": 1, "title_full": "Scherzer throws no-hitter again | Sports | Saudi Gazette", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T05:29:00.000+03:00", "replies_count": 0, "uuid": "090815613675dd4958a63cc382a9ab20b2dcec39"}, "author": "NEW YORK", "url": "http://www.saudigazette.com.sa/index.cfm?method=home.con&contentid=20151005258726", "ord_in_thread": 0, "title": "Scherzer throws no-hitter again", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Washington Nationals’ starting pitcher Max Scherzer (C) celebrates his no hitter against the New York Mets with catcher Wilson Ramos (L), Dan Uggla (R), and teammates in the second baseball game of a doubleheader in New York Saturday. — AP\nNEW YORK — Washington Nationals’ Max Scherzer threw his second no-hitter of the season Saturday, striking out a franchise-record 17 in a 2-0 win over the New York Mets in the second game of a doubleheader.\nScherzer is just the sixth pitcher in Major League Baseball history to achieve the milestone in the same year and he did it against a Mets team that had already locked up the National League East Division title.\n“To throw a no-hitter, sometimes it takes a little luck,” Scherzer said. “I was able to execute all four of my pitches whether I was behind in the count or ahead in the count.”\nFormer Philadelphia Phillies pitcher Roy Halladay was the last to throw two no-hitters in the same year, in 2010, tossing the first in the regular season and another in the playoffs.\nScherzer allowed just one Mets batter to reach base. Kevin Plawecki hit a leadoff grounder in the sixth to third baseman Yunel Escobar, who bounced his throw to first for an error.\nPlawecki was forced out on a grounder by pinch-hitter Daniel Murphy and Scherzer ended the inning by striking out right fielder Curtis Granderson.\nScherzer walked none and struck out nine in a row between the sixth and ninth innings. He got to a three-ball count just twice.\nScherzer also tossed a no-hitter against the Pittsburgh Pirates on June 20. And just like that one Scherzer retired the first 26 batters he faced. He struck Pirates pinch-hitter Jose Tabata with a pitch as he missed perfection by one batter.\nNolan Ryan was the previous pitcher to achieve the feat in the regular season, in 1973. Virgil Trucks (1952) and Allie Reynolds (1951) also did it and Johnny Vander Meer threw no-hitters in consecutive starts in 1938.\nNationals 3, Mets 1 (1st game): Center fielder Bryce Harper launched a tie-breaking, two-run homer in the eighth inning as the Washington Nationals beat the New York Mets in the opener of a double header.\nGiants 3, Rockies 2: Second baseman Kelby Tomlinson hit the ninth inside-the-park home run at AT&T Park in the first inning, which propelled the San Francisco Giants to a 3-2 victory over the Colorado Rockies.\nRight fielder Marlon Byrd and shortstop Brandon Crawford also had solo homers for the Giants, while Jake Peavy allowed four hits and just one run in five innings.\nPeavy (8-6) walked one and struck out two.\nCubs 1, Brewers 0: Kyle Hendricks struck out eight as the Chicago Cubs kept their hopes of hosting the National League wild card game alive with a 1-0 victory over the Milwaukee Brewers.\nChicago (96-65) is one game behind Pittsburgh in the wild-card race after the Pirates lost 3-1 to the Cincinnati Reds.\nHendricks (8-7) was perfect through 5-1/3 innings.\nFinnegan (2-2) gave up one run and three hits in six innings. The right-hander walked two and struck out six.\nIn other games it was: Reds 3, Pirates 1; Marlins 7, Phillies 6 (1st game); Marlins 5, Phillies 2 (2nd game); Dodgers 2, Padres 1; Cardinals vs. Braves (postponed).\nAmerican League\nRoyals 5, Twins 1: The Minnesota Twins’ playoff chances unraveled for good in a sloppy seventh inning against the Kansas City Royals. The Royals scored four times in the seventh, taking advantage of a two misplays by the Twins in the field.\nMinnesota was officially eliminated from the American League wild card race. The Twins had been two games behind the Houston Astros for the second wild card spot before the game.\nOrioles 9, Yankees 2 (1st game): Gerardo Parra got four hits and three RBIs while Manny Machado homered and also drove in three runs as the Baltimore Orioles rolled to victory over the New York Yankees in the first part of a double header.\nParra finished 4-for-5 with his three RBIs.\nMachado went 2-for-5, including a solo homer in the fifth.\nOrioles 4, Yankees 3 (2nd game): Paul Janish scored on the second wild pitch of the eighth inning by New York’s Dellin Betances to give the Baltimore Orioles a 4-3 victory over the Yankees and complete a sweep of their double header.\nNew York (87-74) needed only one win to clinch the home-field advantage in the wild-card playoff.\nOther results: Angels 11, Rangers 10; Rays 4, Blue Jays 3; Indians 2, Red Sox 0; White Sox 4, Tigers 3; A’s 7, Mariners 5 (13 innings).\nInter-League\nAstros 6, Diamondbacks 2: Colby Rasmus homered twice while Collin McHugh threw seven strong innings to help lead the Houston Astros past the Arizona Diamondbacks to keep the Astros’ division title hopes alive.\nJose Altuve doubled, homered and scored twice for the Astros, who remain one game behind the Texas Rangers in the AL West with only Sunday’s games remaining.\nHouston also stayed a game ahead of the Los Angeles Angels for the AL’s second wild card spot.\nMcHugh (19-7) held the Diamondbacks to one run on six hits over seven innings while striking out five. — Agencies", "external_links": [], "published": "2015-10-05T05:29:00.000+03:00", "crawled": "2015-10-05T02:56:49.914+03:00", "highlightTitle": ""}