{"organizations": [], "uuid": "254ac4845182be5ee5433f0e062f6695a6a3f5d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pnj.com", "main_image": "http://www.gannett-cdn.com/-mm-/dd09a125eeb95d2b61e703de7a6b3e02c5fc6651/c=0-448-2400-1798&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/03/Pensacola/B9319053353Z.1_20151003214638_000_GIQC4HRP4.1-0.jpg", "site_section": "http://rssfeeds.pnj.com/pensacola/sports", "section_title": "Pensacola - Sports", "url": "http://www.pnj.com/story/sports/college/university-west-florida/2015/10/03/uwf-football-scrimmage/73314366/", "country": "US", "title": "UWF scrimmage ends with players greeting fans", "performance_score": 0, "site": "pnj.com", "participants_count": 0, "title_full": "UWF scrimmage ends with players greeting fans", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T06:43:00.000+03:00", "replies_count": 0, "uuid": "254ac4845182be5ee5433f0e062f6695a6a3f5d3"}, "author": "", "url": "http://www.pnj.com/story/sports/college/university-west-florida/2015/10/03/uwf-football-scrimmage/73314366/", "ord_in_thread": 0, "title": "UWF scrimmage ends with players greeting fans", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "UWF scrimmage ends with players greeting fans Bill Vilona, pnj.com 10:43 p.m. CDT October 3, 2015 UWF head football coach Pete Shinnick shouts instructions to his players during the Blue vs White team scrimmage held Saturday at UWF. Bruce Graner/bgraner@pnj.com The University of West Florida Argonauts Blue and White teams held a scrimmage/practice Saturday afternoon. Bruce Graner/bgraner@pnj.com University of West Florida Argonauts head football coach Pete Shinnick talks with members of the White (scrimmage) Team Saturday during their practice against the UWF Blue Team. Bruce Graner/bgraner@pnj.com Caleb Perry, No. 17 of the UWF Argos White scrimmage team closes in on Mike Beaudry, a QB for the UWF Blue scrimmage team during their practice Saturday afternoon at UWF. Bruce Graner/bgraner@pnj.com Red shirted UWF QB Gray Jackson walks back to the huddle during the Blue & White teams scrimmage held Saturday at UWF. Bruce Graner/bgraner@pnj.com University of West Florida Argonauts head football coach Pete Shinnick talks with members of the White (scrimmage) Team Saturday during their practice against the UWF Blue Team. Bruce Graner/bgraner@pnj.com During the University of West Florida Argonauts Blue & White team scrimmage White Team QB Gunnar Ballant scrambles out of the pocket looking for a receiver Saturday afternoon. Bruce Graner/bgraner@pnj.com Members of the Sigma Alpha Epsilon fraternity watch the University of West Florida Argonauts Blue & White team football scrimmage Saturday from the comfort of a couch they brought onto the practice field. Bruce Graner/bgraner@pnj.com Spectators gather on benches to watch the University of West Florida Argonauts football team scrimmage Saturday on the practice field. Bruce Graner/bgraner@pnj.com Members of the UWF Sigma Alpha Epsilon fraternity position the couch they brough onto the UWF practice field so they could watch the Argo scrimmage Saturday afternoon. Bruce Graner/bgraner@pnj.com Travis King, No. 88 of the UWF Argos White (scrimmage) Team gets a handful of jersey as he tries to pull down Lemott Hodges of the Blue Team during their practice Saturday afternoon at UWF. Bruce Graner/bgraner@pnj.com Spectators watch as Mike Beaudry of the University of West Florida Argonauts Blue Team takes the snap during their scrimmage against the UWF White Team on their practice field Saturday afternoon. Bruce Graner/bgraner@pnj.com University of West Florida Argonauts head football coach Pete Shinnick talks with members of the White (scrimmage) Team Saturday during their practice against the UWF Blue Team. Bruce Graner/bgraner@pnj.com A.J. Hunt of the University of West Florida Argonauts White Team battles his way through UWF Blue Team members during the scrimmage practice held Saturday at the UWF practice field. Bruce Graner/bgraner@pnj.com Fullscreen Cody McDaniel, No. 60 of the University of West Florida White Team, scoops up a loose ball from red-shirted Blue Team QB, Gray Jackson, and takes it in for a White Team TD during their scrimmage practice session held Saturday at UWF. Bruce Graner/bgraner@pnj.com Fullscreen Cody McDaniel, No. 60 of the University of West Florida White Team, scoops up a loose ball from red-shirted Blue Team QB, Gray Jackson, and takes it in for a White Team TD during their scrimmage practice session held Saturday at UWF. Bruce Graner/bgraner@pnj.com Red shirted UWF QB Gray Jackson hands off the ball to a teammate during their scrimmage Saturday afternoon on the UWF practice field. Bruce Graner/bgraner@pnj.com Like this topic? You may also like these photo galleries: Replay Last Slide Next Slide Cody McDaniel, No. 60 of the University of West Florida White Team, scoops up a loose ball from red-shirted Blue Team QB, Gray Jackson, and takes it in for a White Team TD during their scrimmage practice session held Saturday at UWF. (Photo: Bruce Graner/bgraner@pnj.com) \nOnce the final whistle blew, the handshakes ensued to end Saturday's second-ever University of West Florida football scrimmage. \nBut not among players. \nInstead, it was players thanking the hundreds of spectators. It became Meet The Fans day. They went up and down each sideline in a single row to thank everyone attending. They greeted the people standing, the ones sitting on blankets, the ones who smartly brought their own chairs. \nYou don't see this everywhere. UWF football retaining its numbers heading to scrimmage \nWell, check that, you don't see this most anywhere. All part of the one big family that UWF coach Pete Shinnick and his staff have instilled. \nWhen they say it's all in, it really means more than players and coaches as one. It means parents, fraternities, sororities, all students, boosters, donors and casual observers. \n\"We thank them because it's a scrimmage and to take the time out of your day to come out to a scrimmage means a lot to us,\" said receiver Antoine Griffin, one of the few non-freshman (he's a sophomore transfer) on the first-year roster. He made a couple standout plays in the scrimmage. \n\"We don't play anybody this year ... we play each other. So this means a lot to us,\" said Griffin, who played at Cocoa High near Cocoa Beach, then played last year at Valley City State in North Dakota. Bense: UWF accomplishments come with black lining \nFrom the day he was hired, Shinnick has stressed the team being ambassadors for the school and the community. He knows from past experience in starting football from scratch at North Carolina-Pembroke. \n\"We would have a scrimmage and all of a sudden there are 200 people or 500 people and it was like, hey thank the fans ... and our guys would turn around and say thank you and wave,\" Shinnick said. \n\"Here, there are no stands,\" he said. \"Our field is the stands. We want our players to engage with them. That is part of this process. That is part of us saying, thank you for showing up. \n\"We know you are the reason we are here.\" UWF senior co-founds shop in spray-painted bus \nThe next scrimmage at 11 a.m. Oct. 17 will be the biggest one. It will be at Blue Wahoos Stadium. \nIt will be an event UWF will use to recruit prospective players for the 2016 signing class, show off the place the Argos will play, plus market to prospective fans and boosters in selling season tickets. \nThe scrimmage was carefully placed on a calendar where Shinnick hopes his team can show its own progression. \n\"I think we will be at the right place at that time,\" he said. \"When people ask how a scrimmage went, I always say, we won. (Yesterday), the Argos won. Football won (yesterday) no matter how you slice or dice it.\" \nIn two scrimmages, the UWF defense has won. That is to be expected. It's normal for what happens even with established programs during spring practice or preseason in August. It's magnified in this case. \nSaturday, defensive tackle Louis Sobh, a Bartram Trail High grad, had one of the scoring plays. He picked up a fumbled exchange and rumbled 30-plus yards for a touchdown. He was mobbed by defensive teammates. \nThe other scoring plays were by the offense. Running back Jaylon Hamer from Orlando, who has looked like one of UWF's best runners, scored late in the scrimmage. It was set up by Griffin hauling in a long pass from quarterback Mike Beaudry, then hooking up for another catch. \n\"Antoine has been our best receiver,\" Shinnick said. \"We feel very good with where he is right now.\" \nThe other points were on a short field goal. \n\"The first scrimmage didn't go too well for us (UWF offense). We come out here (yesterday) and it was a little slow the first two quarters and we kinda picked it up the third quarter,\" Griffin said. \"I'm sure it will give everybody a positive vibe and hopefully we can keep that going rest of the season.\" \nGriffin knows the misfired passes, lack of offensive line cohesion and other issues are normal. \n\"Offensively, it's hard to pick up a new offense coming out of high school,\" he said \"We have a lot of freshmen (most of the team), so it's going to take time.\" \nShinnick said offensive line play,\" is the toughest position to progress as a unit.\" \n\"We see some great days out of them and then we see some days where they have to improve,\" he said. \nBeginning this week, more evaluation will lead to decisions on which positions need to be addressed hardest in recruiting, which players look like they can compete best for starting positions for next season. \nThe roster will be pared into a group of players who are well ahead of the other players. \n\"What I think is becoming more evident is the guys who are learning, growing and getting ready,\" Shinnick said. \"And the the guys who are not. Ninety percent of the guys we are playing would be redshirted in most programs. \n\"All they would be doing is practice Tuesday and Wednesday as scout team players. But we are asking them to play at a high level. We know there was going to be gaps there.\" \nWhat isn't a void is connection with supporters. That has been evident from the start. University of West Florida running back A.J. Hunt uses his blockers Wednesday during practice. Ben Twingley/btwingley@pnj.com University of West Florida football defense and offense face off Wednesday while getting ready for a scrimmage this Saturday. Ben Twingley/btwingley@pnj.com University of West Florida football players shake hands after practice Wednesday while getting ready for a scrimmage this Saturday. Ben Twingley/btwingley@pnj.com University of West Florida football players ice down in tubs next to the practice field recently after practice. Ben Twingley/btwingley@pnj.com University of West Florida quarterback Gunnar Ballant looks for a receiver Wednesday during practice. Ben Twingley/btwingley@pnj.com University of West Florida football coach Pete Shinnick calls out directions to his players Wednesday during practice. Ben Twingley/btwingley@pnj.com University of West Florida's Elijah Howard wraps up a Rodney Coates in a two point conversion play Wednesday during practice. Ben Twingley/btwingley@pnj.com University of West Florida football players gather after practice. Ben Twingley/btwingley@pnj.com University of West Florida football players ice down in tubs next to the practice field recently after practice. Ben Twingley/btwingley@pnj.com University of West Florida football players shake hands after practice Wednesday while getting ready for a scrimmage this Saturday. Ben Twingley/btwingley@pnj.com University of West Florida running back Miles Graham shakes a tackle during practice Wednesday as the Argos prepare for a scrimmage on Saturday. Ben Twingley/btwingley@pnj.com University of West Florida football coach Pete Shinnick gathers his players after practice on Wednesday while getting ready for a scrimmage this Saturday. Ben Twingley/btwingley@pnj.com University of West Florida football players ice down in tubs next to the practice field recently after practice. Ben Twingley/btwingley@pnj.com University of West Florida football coach Pete Shinnick shouts out to his players Wednesday during practice. Ben Twingley/btwingley@pnj.com University of West Florida wide receiver Mike Syrakis is brought down by the defense Wednesday as the team prepares for a scrimmage this Saturday. Ben Twingley/btwingley@pnj.com University of West Florida football coach Pete Shinnick gathers his players after practice on Wednesday while getting ready for a scrimmage this Saturday. Ben Twingley/btwingley@pnj.com Like this topic? You may also like these photo galleries: Replay", "external_links": [], "published": "2015-10-04T06:43:00.000+03:00", "crawled": "2015-10-04T15:41:04.424+03:00", "highlightTitle": ""}