{"organizations": [], "uuid": "f1761971b1494808f547503dc14d70bb51530c0c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nytimes.com", "main_image": "http://static01.nyt.com/images/2015/10/24/sports/CITY-NFL/CITY-NFL-facebookJumbo.jpg", "site_section": "http://www.nytimes.com/services/xml/rss/nyt/Sports.xml", "section_title": "NYT &gt; Sports", "url": "http://www.nytimes.com/2015/10/24/sports/football/nfl-roundup-johnny-manziel.html", "country": "US", "title": "Johnny Manziel’s Job Appears Safe Despite Inquiry Into Domestic Incident", "performance_score": 0, "site": "nytimes.com", "participants_count": 1, "title_full": "Johnny Manziel’s Job Appears Safe Despite Inquiry Into Domestic Incident - The New York Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T05:08:00.000+03:00", "replies_count": 0, "uuid": "f1761971b1494808f547503dc14d70bb51530c0c"}, "author": "The Associated Press", "url": "http://www.nytimes.com/2015/10/24/sports/football/nfl-roundup-johnny-manziel.html", "ord_in_thread": 0, "title": "Johnny Manziel’s Job Appears Safe Despite Inquiry Into Domestic Incident", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Johnny Manziel is expected to remain Cleveland’s backup quarterback as the N.F.L. investigates whether he violated its personal conduct policy.\nManziel was questioned on Oct. 12 by the police in Avon, Ohio, after he and his girlfriend, Colleen Crowley, argued while Manziel drove on a highway. Crowley told the police that Manziel had hit her several times.\nManziel denied having struck Crowley and was not arrested, and the couple was allowed to leave together. Manziel could face a fine, a suspension or banishment if the league finds he broke its conduct policy.\nA league spokesman had no updates Friday on the inquiry.\nManziel admitted having drunk alcohol a few hours before his argument with Crowley, who the police said was intoxicated.\nAfter practice on Friday, Browns Coach Mike Pettine said Manziel would “more than likely” back up Josh McCown on Sunday when Cleveland visits the St. Louis Rams. The Browns made Manziel active against Denver on Sunday despite the incident.\nThe Browns’ only other option at quarterback is Austin Davis. MACLIN CLEARED TO PLAY Chiefs wide receiver Jeremy Maclin has passed the league’s concussion protocol and should be available Sunday against the Steelers.\nMaclin was hurt in Sunday’s loss in Minnesota. He did not work out early in the week while undergoing tests, but practiced Friday on a limited basis.\nThe Chiefs (1-5) have lost five straight. Maclin is their leading receiver, with 39 catches for 531 yards and a touchdown.\nMARIOTA HIT LEADS TO FINE Miami Dolphins defensive end Olivier Vernon has been fined $37,363 by for two hits on the Tennessee Titans’ rookie quarterback Marcus Mariota.\nVernon was docked for two roughing-the-passer infractions. For the hit that hurt Mariota, Vernon was fined $17,363. He was also assessed a $20,000 fine for hitting Mariota in the head and neck on another play.\nMariota’s left medial collateral ligament was injured on Vernon’s low hit, and he will not play this week against Atlanta.\nBETHEA’S SEASON ENDS San Francisco 49ers safety Antoine Bethea was placed on season-ending injured reserve with a shoulder injury he sustained in Thursday’s 20-3 loss to Seattle.\nThe move cleared room on the 53-man roster for wide receiver Jerome Simpson’s return after a suspension. Bethea grabbed Seahawks wideout Doug Baldwin in the second quarter and received a face mask penalty, and that is believed to be when Bethea was hurt.\nBethea, 31, had started all 23 games since joining the 49ers last March and recorded 44 tackles and a sack this season.\nINJURIES PLAGUE WASHINGTON Redskins cornerbacks DeAngelo Hall and Chris Culliver, receiver DeSean Jackson and center Kory Lichtensteiger will miss their home game against the Tampa Bay Buccaneers because of injuries.\nLoading... Go to Home Page »\nSite Index The New York Times News World U.S. Politics N.Y. Business Tech Science Health Sports Education Obituaries Today's Paper Corrections Opinion Today's Opinion Op-Ed Columnists Editorials Contributing Writers Op-Ed Contributors Opinionator Letters Sunday Review Taking Note Room for Debate Public Editor Video: Opinion Arts Today's Arts Art & Design ArtsBeat Books Dance Movies Music N.Y.C. Events Guide Television Theater Video Games Video: Arts Living Automobiles Crossword Food Education Fashion & Style Health Jobs Magazine N.Y.C. Events Guide Real Estate T Magazine Travel Weddings & Celebrations Listings & More Classifieds Tools & Services Times Topics Public Editor N.Y.C. Events Guide TV Listings Blogs Multimedia Photography Video NYT Store Times Journeys Subscribe Manage My Account Subscribe Subscribe Times Insider Home Delivery Digital Subscriptions NYT Opinion Crossword Email Newsletters Alerts Gift Subscriptions Corporate Subscriptions Education Rate Mobile Applications Replica Edition International New York Times", "external_links": ["http://a1.nyt.com/assets/article/20151023-153751/images/foundation/logos/"], "published": "2015-10-24T05:08:00.000+03:00", "crawled": "2015-10-24T04:58:12.865+03:00", "highlightTitle": ""}