{"organizations": [], "uuid": "e296772296f3a4c8660b9551617fbc6284cca92a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "wtop.com", "main_image": "", "site_section": "http://wtop.com/section/sports/feed/", "section_title": "WTOP » Sections » Sports", "url": "http://wtop.com/ncaa-basketball/2015/10/boeheim-to-start-40th-season-with-orange/", "country": "US", "title": "Boeheim to start 40th season with Orange", "performance_score": 0, "site": "wtop.com", "participants_count": 1, "title_full": "Boeheim to start 40th season with Orange", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T03:50:00.000+03:00", "replies_count": 0, "uuid": "e296772296f3a4c8660b9551617fbc6284cca92a"}, "author": "wtopstaff", "url": "http://wtop.com/ncaa-basketball/2015/10/boeheim-to-start-40th-season-with-orange/", "ord_in_thread": 0, "title": "Boeheim to start 40th season with Orange", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Boeheim to start 40th season with Orange By MARK FRANK October 16, 2015 8:50 pm \nSYRACUSE, N.Y. (AP) — Jim Boeheim doesn’t think the specter of NCAA sanctions, the loss of prized freshman Chris McCullough to a season-ending knee injury or a self-imposed post-season tournament ban were distractions for his Syracuse team last season. \nFor Boeheim, entering his 40th year as head coach at alma mater, the explanation was simple. He just didn’t think his 2014-15 team, which finished with un-Syracuse-like 18-13 record, was very good. \n“Last year was last year. It’s over,” Boeheim said Friday at his team’s media day. “It’s been well documented. It is what it is. You can have some very difficult problems some years and have a great year. There’s no correlation between how many games you win and what kind of difficulties you have. I’ve had some difficult years off the court and had great seasons. We just didn’t have a good team last year, I don’t think. We had too many weaknesses. We just weren’t good enough.” \nOne of those weaknesses was 3-point shooting. Syracuse finished 13th in the Atlantic Coast Conference, shooting 30 percent from beyond the arc and just 43 percent overall. Boeheim is hopeful that seniors Trevor Cooney and Michael Gbinije, the top 3-point shooters last year, an improved Kaleb Joseph, and sharpshooting freshmen Malachi Richardson and Tyler Lydon will help remedy that situation. \n“We relied on Trevor. Mike made some 3s. This year we think those guys can make 3s. Kaleb has really improved his shooting, and we know Malachi and Tyler can shoot 3s,” Boeheim said. “I think we have five guys, legitimately, who we can try to get 3-point shots for. I think that is going to be a big key as to how successful we’re going to be. \n“If you shoot a lot of 3s and make them you’re going to be good. If you don’t make a lot of them it’s going to be a problem,” Boeheim added. “That’s the best way for this team to play and that’s the most significant change I’d like to see this year.” \nOne of the big question marks entering the season is the health of junior center DaJuan Coleman, who hasn’t played in nearly two years and sat out last season with a knee injury. The 6-foot-9, 255-pounder, out of Jamesville-DeWitt High School, just a short drive from the Carrier Dome, could be a big presence in the middle replacing the departed Rakeem Christmas, now with the NBA’s Indiana Pacers. Christmas led last year’s team in scoring at 17.5 points a game. \n“DaJuan has practiced every day, has not missed any days,” Boeheim said. “Obviously, when you haven’t played in two years you’re going to be a little rusty. He’s rusty.” \nThe Orange enter the season under the radar, and Boeheim agreed with that assessment. \n“When you lose a guy like Rak (Christmas), your best player, and, obviously, didn’t have a great year, I think the question marks that surround us are more than usual,” he said. “I think it’s a fair rating.” \nWhile many of the storm clouds from last season have cleared, Boeheim and his team will be dealing with the ramifications of NCAA sanctions handed down earlier this year. Boeheim has been suspended for nine ACC games, a penalty Boeheim feels is grossly unfair. \n“As far as the nine games, whenever that happens, it’ll be a difficult time. The one thing I do know is I believe the team will be 100 percent ready. If you have a good system and a good plan, there aren’t a lot of changes that happen,” Boeheim said. “It’ll be difficult because you can’t talk to the players, which I think is crazy. It’s one thing to punish the coach. I get that. But you punish the players because I brought them all here. They want to listen to me and they can’t talk to me for nine games, which is a month. It’s a pretty harsh penalty. It’s a very severe punishment.” \nAssistant coach Mike Hopkins, who will lead the Orange when Boeheim retires in three years, will lead the team for those games. Topics:", "external_links": [], "published": "2015-10-17T03:50:00.000+03:00", "crawled": "2015-10-17T04:03:52.238+03:00", "highlightTitle": ""}