{"organizations": ["Lakers"], "uuid": "5bbd45c40d54801f949d7391387c92bbfb202e1b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxsports.com", "main_image": "http://a.fssta.com/content/dam/fsdigital/RSN/West/2014/2/13/021314-West-NBA-Kevin-Durant-PI.vresize.1200.675.high.92.jpg", "site_section": "http://api.foxsports.com/v1/rss?partnerKey=zBaFxRyGKCfxBagJG9b8pqLyndmvo7UU&tag=nba", "section_title": "FOX Sports Digital", "url": "http://www.foxsports.com/nba/story/oklahoma-city-thunder-los-angeles-lakers-kevin-durant-rumors-093015", "country": "", "title": "Report: Kevin Durant wants to join the Lakers if he leaves OKC", "performance_score": 0, "site": "foxsports.com", "participants_count": 0, "title_full": "Report: Kevin Durant wants to join the Lakers if he leaves OKC", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T23:52:00.000+03:00", "replies_count": 0, "uuid": "5bbd45c40d54801f949d7391387c92bbfb202e1b"}, "author": "", "url": "http://www.foxsports.com/nba/story/oklahoma-city-thunder-los-angeles-lakers-kevin-durant-rumors-093015", "ord_in_thread": 0, "title": "Report: Kevin Durant wants to join the Lakers if he leaves OKC", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kevin Durant"], "text": "  4:56p ET \nOklahoma City Thunder superstar Kevin Durant has made no indications that he plans on leaving the Thunder when he hits free agency in 2016, but that's not going to stop the rumor mill from running rampant. \nOne such rumor: Kevin Durant to the Los Angeles Lakers . \nWhile talking on Tuesday about Durant's free agency on ESPN's First Take show, Steven A. Smith said that Durant preferred the Lakers over the Miami Heat and his hometown Washington Wizards if he chooses to leave the Thunder, according to Steve DelVecchio of Larry Brown Sports . \n\"Regardless of how senseless it may (sound), in one breath I’m hearing that if Kevin Durant doesn’t stay in Oklahoma City, L.A. is his primary objective and landing spot as opposed to South Beach or even his home of Washington, D.C.,\" Smith said. \nIf this is report is true, it's interesting because, while the Lakers have still been getting meetings with elite stars over the past few summers, they haven't been able to sell players on a Kobe Bryant , Byron Scott and Jim Buss-led core. \nNow, however, the Lakers have tantalizing young talent with the likes of D'Angelo Russell, Julius Randle and Jordan Clarkson . Bryant is on his way out in the next year or two. Scott could be fired at a star's request. And Jim Buss might be losing his power within the organization. \nThe Lakers have a rich tradition of winning, and someone has to take the torch from Bryant. Durant is the type of player Bryant would have no choice but to accept and respect. The two have played on the 2008 and 2012 Olympics squads together and are supposedly fond of each other. \nThat doesn't mean Durant is going to join L.A. -- the most likely scenario is Durant staying put in Oklahoma City -- but it's not entirely far-fetched either. \nDurant will have the option to join basically any time next summer. The Lakers are not the only attractive alternative. \nThe Wizards were perceived to be the biggest threat, as they're Durant's hometown team and have a nice young core of John Wall and Bradley Beal, but perhaps we've been wrong all along. Perhaps the boogeyman that hangs over every major free-agent decision is real. Perhaps the Lakers can pull off another heist in 2016 and reload on the fly. \nUntil next summer, though, it's all speculation.", "external_links": [], "published": "2015-09-30T23:52:00.000+03:00", "crawled": "2015-10-01T00:45:20.812+03:00", "highlightTitle": ""}