{"organizations": [], "uuid": "299b5e924afb2605455a15ae3604a88ef5ed5090", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thenews.com.pk", "main_image": "http://www.thenews.com.pk/images/h1_11.jpg", "site_section": "http://feeds.feedburner.com/TheNewsInternational-Sports", "section_title": "The News International - Sports", "url": "http://www.thenews.com.pk/Todays-News-10-343841-My-best-year-yet,-says-more-complete-Djokovic", "country": "US", "title": "My best year yet, says more complete Djokovic", "performance_score": 0, "site": "thenews.com.pk", "participants_count": 0, "title_full": "My best year yet, says more complete Djokovic", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T22:00:00.000+03:00", "replies_count": 0, "uuid": "299b5e924afb2605455a15ae3604a88ef5ed5090"}, "author": "", "url": "http://www.thenews.com.pk/Todays-News-10-343841-My-best-year-yet,-says-more-complete-Djokovic", "ord_in_thread": 0, "title": "My best year yet, says more complete Djokovic", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Novak Djokovic", "Djokovic"], "text": "BEIJING: Novak Djokovic said Sunday he had no regrets about missing a calendar-year Grand Slam in what he described as his best season yet — even better than his sublime 2011. \n\nSerena Williams was left shattered by her narrow failure to win all four major titles, but the men’s world number one said losing the French Open final had only spurred him on to greater things. \n\nDjokovic said defeat to Stan Wawrinka in Paris had given him the hunger to win Wimbledon and the US Open, and a newfound maturity helped him enjoy his successes even more. \n\n“Winning three out of four Grand Slams and playing another final is not a disappointment,” he said at the China Open. “On the contrary, it’s as good as it can get. One match more and it’s a perfect score. \n\n“Somehow I feel like this one is even better (than 2011),” he added. “I have no reason to regret anything that happened this year. I feel like Roland Garros final was very emotional, but it happened for a reason. \n\n“Because I have lost that match, I feel like I was even more eager to come back and play well on Grand Slams. I think this was a big part of my success in Wimbledon and US Open.” \n\nDjokovic also won three Grand Slam titles in 2011 among 10 trophies, one of the great seasons of modern times. But he said getting married and becoming a father last year made 2015 even sweeter. \n\n“I just feel like as a more complete person and a player. I’m a father and a husband,” said Djokovic, who has seven titles so far this year. \n\n“Just different circumstances that happen in my life in the last couple of years, that have helped me to enjoy all the success that I have on the tennis court even more.” \n\nDjokovic has teamed successfully with Boris Becker over the past two seasons and said that after retirement, he planned to follow his mentor’s lead by taking up coaching. \n\n“I would assume because tennis is my life, I definitely will after my active playing career, stay somehow in tennis, definitely involved, and eventually coach somebody one day,” he said. \n\nFirst, though, will come his expected assault on Roger Federer’s record of 17 Grand Slam titles. Djokovic, who has established himself as a class apart this year, is currently on 10. \n\n“I still have a lot to work on and a lot to win in order to get to the level where he is,” said Djokovic, adding that he was “flattered” to be compared to Federer. \n\n“To be actually winning 10 Grand Slams, it’s a great achievement. So I’m proud of it and I’ll keep on going,” he added. \n\nHe said that despite his long year, he had no thoughts of skipping tournaments in China where fans uniformly give him a warm welcome, something he does not always receive elsewhere. \n\n“I feel like the support I get here over the years with all the fans, the way they wait for me in front of the hotel and the club, is something that I don’t experience really more or less anywhere,” he said. \n\nAnd Djokovic, who is on a 24-match winning streak at the China Open, added that his main motivation was still simply the enjoyment of hitting tennis balls and competing on court. \n\n“I don’t take that for granted. That’s why I keep on going and try to push my own borders, which I don’t determine,” he said. \n\n“I don’t like to say where my limits are. I try to just be in the moment, use my imagination, and all of a sudden your possibilities become limitless.”", "external_links": [], "published": "2015-10-04T22:00:00.000+03:00", "crawled": "2015-10-05T14:28:25.549+03:00", "highlightTitle": ""}