{"organizations": [], "uuid": "2146c7b366d9a5cf001c4ca6bdbf01d86edf15d4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deccanchronicle.com", "main_image": "http://www.deccanchronicle.com/sites/default/files/nissan_1.jpg", "site_section": "http://www.deccanchronicle.com/sports/motor-sports", "section_title": "Motor Sports | Deccan Chronicle", "url": "http://www.deccanchronicle.com/151020/business-autos/article/poor-service-hits-nissan-car-sales", "country": "US", "title": "Poor service hits Nissan car sales", "performance_score": 0, "site": "deccanchronicle.com", "participants_count": 1, "title_full": "Poor service hits Nissan car sales", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T09:01:00.000+03:00", "replies_count": 0, "uuid": "2146c7b366d9a5cf001c4ca6bdbf01d86edf15d4"}, "author": "Deccan", "url": "http://www.deccanchronicle.com/151020/business-autos/article/poor-service-hits-nissan-car-sales", "ord_in_thread": 0, "title": "Poor service hits Nissan car sales", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Deccan Chronicle | October 20, 2015, 00.56 am Even as car manufacturers rush to meet the seasonal hike in demand for new cars, Nissan — manufacturer of such worldwide hits as the GTR and the Juke — continue to struggle in India. Hyderabad : Even as car manufacturers rush to meet the seasonal hike in demand for new cars, Nissan — manufacturer of such worldwide hits as the GTR and the Juke — continue to struggle in India. According to reports, the company has witnessed an epic 33 per cent drop in sales (as of March, 2015) and going by word on the street, there seems to be no bottom in sight — it’s a free fall. Much of the trouble lies in its ageing fleet of cars for India that seem to be offering “nothing new” — and its astonishingly incompetent customer service. There was an all-wheel drive version of the Terrano SUV apparently in the pipeline but that hasn’t gone beyond the point of a rumour. The Terrano meanwhile, has also taken a hit from other soft-roaders including the fully-packed Ecosport from Ford. Nissan’s SUV remains expensive, cheap on the insides and has enough reasons to make one wonder why he or she should pay over 10 lakh for a car that’s not the segment leader in either luxury or performance. The insides of the car still look like there’re from 2013. Customer service too is far from perfect. “They need to guarantee customers that cars will be free of manufacturing defects,” says a former Nissan Sunny owner. “My clutch was troublesome, spares were dubious and I have noticed problems with economy and other nagging issues with the build of the car,” he adds. Even bookings test drives have proven to be painful for customers with dealerships cancelling requests at the very last minute. Forums online are filled to the brim with prospective customers attacking Nissan’s sales agents, who take “days to comply with simple requests”. A search online also reveals dozens of complaints against Nissan’s “non-responsive” customer service hotline. Owners have gone as far suggesting they have been “cheated”. Website consumercomplaints.in has given Nissan a satisfaction rating of just one per cent — the car maker was able to resolve just one of the 164 complaints listed on the website. The mediocre dealership and service network has also left Nissan’s other offerings in limbo - including its Micra hatchback and the very boring, Sunny. Both cars have suffered from weak brakes and those hoping to munch miles on the highway, have been left stunned by the lethargic Sunny. It’s no surprise then customers are walking past Nissan’s dimly-lit shops, without even a glance through the windows this festive season. It’s known for making fantastic cars but in India, in one of the world’s fastest-growing car markets, Nissan seems to be driving around in circles. business autos NIssan Terrano Also Read Banking fraud instances increased in the last two years British Airways offers up to 50 per cent off on select flights from India Use dips to buy quality stocks RBI plans new norms to make e-commerce transactions easier", "external_links": ["http://platform.twitter.com/widgets.js", "http://static.ak.fbcdn.net/connect.php/js/FB.Share", "http://campaign.bharatmatrimony.com/track/clicktrack.php?trackid=00100326114361", "https://apis.google.com/js/plusone.js", "http://vuukle.com/js/vuukle.js", "http://www.facebook.com/sharer.php", "http://twitter.com/share?url=http://www.deccanchronicle.com/151020/business-autos/article/poor-service-hits-nissan-car-sales", "http://dd508hmafkqws.cloudfront.net/sites/default/files/nissan_1.jpg", "http://dd508hmafkqws.cloudfront.net/sites/default/files/styles/article_node_view/public/nissan_1.jpg", "http://dd508hmafkqws.cloudfront.net/sites/default/files/BharatMatrimony_texlink_banner_620x40px.gif"], "published": "2015-10-20T09:01:00.000+03:00", "crawled": "2015-10-19T22:33:12.715+03:00", "highlightTitle": ""}