{"organizations": [], "uuid": "5ae46eb50228751d1b8d1b1b47efc00c50fc3d2f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kptv.com", "main_image": "http://images.worldnow.com/AP/images/8914444_G.jpg", "site_section": "http://kptv.com/category/208630/sports?clienttype=rss", "section_title": "KPTV.com - Sports", "url": "http://www.kptv.com/story/30155187/pirates-top-cardinals-8-2-in-doubleheader-opener", "country": "US", "title": "Pirates top Cardinals 8-2 in doubleheader opener", "performance_score": 0, "site": "kptv.com", "participants_count": 1, "title_full": "Pirates top Cardinals 8-2 in doubleheader opener - KPTV - FOX 12", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "5ae46eb50228751d1b8d1b1b47efc00c50fc3d2f"}, "author": "cbs8", "url": "http://www.kptv.com/story/30155187/pirates-top-cardinals-8-2-in-doubleheader-opener", "ord_in_thread": 0, "title": "Pirates top Cardinals 8-2 in doubleheader opener", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By WILL GRAVES\nAP Sports Writer PITTSBURGH (AP) - The chat was brief. Clint Hurdle figured he didn't need to elaborate on the stakes when the Pittsburgh manager told Gerrit Cole he was starting the opener of a doubleheader against St. Louis on Wednesday, hoping to keep their team's slim chances of catching the frontrunning Cardinals.\n\"He said, 'We need a win. You're going,'\" Cole said. \"I said 'all right.' It's a compliment. ... You just try not to mess up when you have the opportunity.\"\nNo chance.\nCole pitched seven solid innings and Francisco Cervelli hit a grand slam off a shaky Michael Wacha in an 8-2 win that put St. Louis' NL Central title hopes on hold.\nThe Cardinals' magic number remained at two for their third straight division championship after the Pirates rode their budding ace. Cervelli delivered the big blow, a shot to left field with the bases loaded in the fourth.\n\"The understatement of the day would be for me to say that was a big swing,\" Hurdle said.\nNeil Walker also homered for the Pirates, who moved within three games of St. Louis for first and inched closer to homefield advantage in next week's NL wild-card game.\nCole (19-8) allowed two runs and seven hits in seven innings in likely his final regular-season start after Hurdle altered his rotation slightly, sending Cole out to start the day-night opener rather than Charlie Morton, who was bumped to the nightcap.\n\"We're still in pursuit,\" Hurdle said when asked about the decision to flip-flop his starters.\nFor a few more hours anyway.\nWhile Cole credited Cervelli for his immaculate game calling, he was still plenty good enough to keep the champagne outside the visiting clubhouse at PNC Park on ice.\nMatt Carpenter hit a 435-foot solo homer off Cole in the sixth that bounced into the Allegheny River but the Cardinals could do little else against Cole, who will almost certainly get the call against the Chicago Cubs in the wild-card game if the Pirates don't overtake St. Louis for the division crown.\n\"He truly wants to be the guy,\" Hurdle said of Cole, who is 12-2 in September in his brief career.\nPittsburgh blew a chance to apply heavy pressure on the Cardinals on Monday, when the Pirates stranded 16 runners in a 3-0 loss that assured St. Louis the Central title barring a historic collapse.\nStill, Cole wasn't in the mood to cede anything just yet. He retired his first nine batters, giving the Pirates a chance to get to the normally unflappable Wacha. The right-hander has dominated Pittsburgh, including a dazzling performance in Game 4 of the 2013 NL Division Series with the Cardinals facing elimination.\nThe stakes weren't quite as high this time, and Wacha wasn't quite as crisp. Walker led off the second with his 16th homer, and Wacha's control abandoned him in the fourth.\nAndrew McCutchen led off with a single and Aramis Ramirez walked. Wacha intentionally walked Pedro Alvarez to load the bases with one out, and Cervelli sent the second pitch into the bleachers to put the Pirates up 5-1. Gregory Polanco added an RBI double later in the inning.\nWacha allowed six runs, four hits and four walks in four innings.\n\"I just haven't been making pitches like I need to this past month,\" said Wacha, who is 2-2 with a 6.75 ERA in his last four starts. \"I've got to figure something out and start competing a lot better out there.\"\nTRAINER'S ROOM\nCardinals: RHP Adam Wainwright returned from a five-month stay on the disabled list and gave up one run in the eighth, his first appearance out of the bullpen since 2006.\nThe three-time All-Star tore his left Achilles on April 25, an injury that was thought to sideline him until 2016. Wainwright made it back well ahead of schedule, and manager Mike Matheny expects Wainwright to be in the mix to start in the playoffs barring a setback.\nThat's fine by the 34-year-old Wainwright, who called his grueling rehab \"not a fun deal\" but one that could pay off in October.\n\"I got a little tightening up to do,\" Wainwright said. \"Other than a couple inches here or there, I'm happy where I am. My arm feels great, it's recovering well.\"\nUP NEXT\nThe Cardinals take another shot at wrapping up the division in Game 2 when they send out Tyler Lyons (2-1, 3.96) to face Morton (9-8, 4.54). Lyons has an ERA of 4.93 in seven starts this year and a 1.76 ERA in eight relief appearances. Morton is just 2-11 against St. Louis and hasn't beaten the Cardinals since April 4, 2011.\nCopyright 2015 The Associated Press.   This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-10-01T01:01:28.212+03:00", "highlightTitle": ""}