{"organizations": [], "uuid": "9fb9916ef8c86609e5c5b4b3cc09e67dc752486f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fox8live.com", "main_image": "http://APMOBILE.images.worldnow.com/images/8926454_G.jpg", "site_section": "http://www.fox8live.com/", "section_title": "New Orleans News, Weather, Saints - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "url": "http://www.fox8live.com/story/30168517/public-health-emergency-declared-due-to-lead-in-flint-water", "country": "US", "title": "Public health emergency declared due to lead in Flint water", "performance_score": 0, "site": "fox8live.com", "participants_count": 1, "title_full": "Public health emergency declared due to lead in Flint water - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "9fb9916ef8c86609e5c5b4b3cc09e67dc752486f"}, "author": "cbs8", "url": "http://www.fox8live.com/story/30168517/public-health-emergency-declared-due-to-lead-in-flint-water", "ord_in_thread": 0, "title": "Public health emergency declared due to lead in Flint water", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By COREY WILLIAMS\nAssociated Press DETROIT (AP) - Officials in Michigan declared a public health emergency Thursday over the city of Flint's water, after months of resident complaints about its smell and taste, in response to tests that showed children with elevated levels of lead.\nA day after Gov. Rick Snyder said the consequences of using the Flint River for the city's drinking water weren't \"fully understood,\" Genesee County Commissioners recommended that people not use the water unless it first goes through an approved filter at taps.\nA group of doctors called a news conference last week to report high levels of lead in blood samples from children, as the corrosive water is apparently releasing lead from old pipes in homes. It was among the most significant challenges to the quality of Flint water since the city decided last year to stop paying Detroit for its water service.\nMayor Dayne Walling said Thursday residents should follow the county commission's declaration on using filters certified for lead removal, having water tested and flushing cold water for five minutes before drinking it.\nA coalition of local citizens and national groups petitioned the Environmental Protection Agency on Thursday to order Michigan and state environmental officials to reconnect Flint to Detroit water.\n\"As evidenced by the ongoing poisoning of the children of Flint, it's time for the EPA to take immediate action to provide us with a safe water source,\" said LeeAnne Walters, a Flint parent and member of the Water You Fighting For group.\nDetroit's water system serves about 4 million people in communities across southeastern Michigan.\n\"This department is always willing to explore possibilities that may be beneficial ... for the residents of Flint and the other communities that we serve,\" William Wolfson of the Detroit Water Department told The Associated Press.\nFlint is among a number of communities that have complained about the rising cost of Detroit's water and sewerage service. City officials estimated the cost of buying water from Detroit at $16 million. They turned off Flint's tap to Detroit water in April 2014 and opted for Flint River water until the city switches to a new pipeline from Lake Huron. The overall annual cost to be part of the Lake Huron system would be $12.5 million.\nThe decision to break away from the Detroit system was made while a Snyder-appointed emergency manager was running the long-struggling city, which had reached a financial crisis.\n\"In terms of a mistake, what I would say is we found there are probably things that weren't as fully understood when that switch was made,\" Snyder said Wednesday.\nBut residents have been unhappy with the taste and appearance of water from the Flint River. They also have raised health concerns, reporting rashes, hair loss and other problems. A General Motors plant stopped using the water, saying it was rusting its parts.\nDespite the complaints, city officials had said state tests showed the water met federal safety guidelines.\nMore concerns surfaced after Virginia Tech researchers posted an online report in early September saying Flint's water is \"creating a public health threat\" in old homes that have lead pipes or pipes fused with lead solder.\nFlint officials say they know which homes have risky pipes but the information is on about 45,000 index cards and difficult to retrieve.\nThe city is now telling residents to use only cold water for drinking, cooking and making baby formula, and recommending they use the certified filters. The General Motors Foundation, the local United Way and others have given at least $105,000 to buy filters for 5,000 residents.\nBut Kary Moss, director of the American Civil Liberties Union of Michigan - one of the group's filing the petition with the EPA - says the first step has to be removing the Flint River as the city's source of water.\nCopyright 2015 The Associated Press. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-01T03:00:00.000+03:00", "crawled": "2015-10-02T08:42:08.515+03:00", "highlightTitle": ""}