{"organizations": [], "uuid": "8c363bbb1caaf6af7e2705b47e457046d026bb69", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.signalscv.com", "main_image": "http://media.morristechnology.com/webmedia/upload/santa_clarita/article/2015/10/07/1003_sports_Hart_fball_dw_05.jpg", "site_section": "http://www.signalscv.com/syndication/feeds/rss/19/", "section_title": "SCV Prep Sports", "url": "http://www.signalscv.com/section/19/article/143341/", "country": "US", "title": "2015 Foothill League Football Preview: Questions left to be answered", "performance_score": 0, "site": "signalscv.com", "participants_count": 1, "title_full": "2015 Foothill League Football Preview: Questions left to be answered", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T08:56:00.000+03:00", "replies_count": 0, "uuid": "8c363bbb1caaf6af7e2705b47e457046d026bb69"}, "author": "Dan Agnew", "url": "http://www.signalscv.com/section/19/article/143341/", "ord_in_thread": 0, "title": "2015 Foothill League Football Preview: Questions left to be answered", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "2015 Foothill League Football Preview: Questions left to be answered A lot remains unclear as league play kicks off Friday night Posted: October 7, 2015 10:56   7, 2015 10:56 p.m. Valencia quarterback Cole Parkinson and the Vikings are looking to turn things around in league play and make a run at a seventh straight Foothill title. Signal photo by Katharine Lotze Hart running back Nelson James leads all Foothill League backs with 400 yards rushing through five games. Signal photo by Dan Watson Saugus running back David Aubrey (45) has teamed with quarterback Louis Eusebi to key the Cents' rushing attack. Photo by Jayne Kamin-Oncea/For The Signal A A A \nThe most memorable moments, games and matchups of a high school football season usually don’t take place in September. \nWe’re exactly halfway through the prep football season, and you may as well hit the reset button now that Foothill League play begins on Friday. \nThis is when it really matters. \nAnd no team knows that better than six-time defending league champion Valencia. \n“Now it’s the second season and you’re 0-0 regardless of what you’ve done,” said Valencia head coach Larry Muir. “It doesn’t matter what you’ve done.” \nMuir’s sentiment is literally true. Due to the playoff bracket format in the CIF-Southern Section West Valley Division, only the top three Foothill finishers advance to the playoffs. There are no at-large spots, so non-league records are irrelevant. \nBut while that may be true, the first five games of the season can certainly give us a lot of clues as to what to expect the rest of the way. At the same time, it also presents a lot of questions. \nAs league play approaches, let’s examine the most important issues of Foothill football. \nWhat we learned: Hart is pretty good \nBy most measurements, Hart has been the most impressive and consistent team in the league so far. \nThe Indians are 4-1 against a relatively difficult schedule that included Downey and Paraclete, two teams that reached CIF championship games last year. \nThe only thing that stopped them from an undefeated preleague slate was a narrow 42-38 loss to a powerful St. Bonaventure team that ranks 41st in the state, according to Calpreps. \nThe Indians are a far different team than they were in 2014, when they were built around the record-breaking quarterback-wide receiver duo of Brady White and Trent Irwin. \nThe 2015 Indians are winning with more of a team effort. They’re the Foothill’s highest scoring team at 38 points per contest thanks to an offense that boasts two of the league’s top three leading rushers in running back Nelson James and quarterback Nick Moore. James leads the league with 400 yards and eight touchdowns on the ground, while the dual-threat junior Moore is third with 316 yards in the run game. \nThat has led to a very balanced and efficient offensive attack. \n“I tell every reporter every year we take what the defense gives us,” said Hart head coach Mike Herrington. “We have to be prepared to run and prepared to pass.” \nOn top of that, Hart’s young defensive secondary has done an incredible job getting their hands on the football, tallying a league-best 12 interceptions. Hart juniors A.J. Stanley and C.J. Stokes each have four interceptions already. \nWhat we need to learn: Can Hart parlay this success into league play? \nHart finished with strong preleague records in 2011, 2012 and 2013, but it failed to translate that into a league title all three times. \nIn recent years, Valencia continues to demonstrate it has Hart’s number in Foothill play. Can the Indians finally reverse that trend? \nWhat we learned: Golden Valley is also good \nThe Grizzlies are tied with Hart for the league’s best record at 4-1, which means they’re off to their best start in school history. No Golden Valley team before this one has ever won more than three games in a season. \nThis team is brimming with confidence as it heads into Friday’s league opener at Valencia. \n“The buzz is great here at Golden Valley right now. Not just the football team but the whole campus,” said second-year Golden Valley head coach Dan Kelley. “The kids really believe in themselves, and anytime a team believes in themselves, they’re a dangerous football team. I think we’re looking forward to league. We’ve played some good teams in our preseason. Our kids have done a great job, but we know playing in our league is like playing in the playoffs.” \nThe Grizzlies have leaned on their defense, which has allowed a league-low 91 points so far, has forced 12 turnovers and tallied a league-high 13 sacks. \nThat impressively disruptive pass rush is led by senior linebacker Bryan Barrera (league-leading four sacks) and junior defensive lineman Tai Brown (3.5 sacks). \nBarrera also helps lead the effort on the offensive line, which has paved the way for a strong rushing attack that is averaging 176 yards per game. That’s second only to Hart’s 183 among Foothill teams. \nWhat we need to learn: Has Golden Valley finally turned a corner? \nLast year, Golden Valley entered league play 3-2 but still came up winless against Foothill teams after blowing two second-half leads to West Ranch and Saugus to end the season. \nWill nine years of Foothill League futility come to an end this fall? \nWhat we learned: Strength of schedule matters \nCanyon (1-4) and Valencia (2-3) don’t have the prettiest looking records entering league play, but both teams played a brutal stretch of opponents in the opening half of the season. \nThe Cowboys’ schedule has been particularly tough, with its five opponents so far combining for a 21-6 record. Three of those teams (Calabasas, Thousand Oaks, St. Francis) are ranked third or higher in their respective CIF-SS divisional polls. \nValencia faced the granddaddy of all tests last week when it took on state No. 1-ranked Centennial of Corona. \nIn facing such difficult competition, both teams took their lumps. But both coaches like the fact that some weaknesses were exposed early to give them time to fix the issues. \n“We learned a lot about ourselves all the way through, I think all five games,” Muir said. “I think we learned a lot of lessons, and I think we’ve grown. I think we’ve grown a lot.” \nSaid Canyon head coach Rich Gutierrez on the subject: “It’s something we look at. You go and you know it’s a tough schedule. You put in the work and you just kind of preach that it’s all about getting us prepared.” \nAnd Canyon will need to be prepared as it hosts Hart in Friday’s league opener. \nWhat we need to learn: How have the tough schedules prepared each team? \nValencia is notorious for facing formidable opponents in non-league play, and the six straight league titles indicate it’s served the Vikings well. It remains to be seen if they can keep that streak going. \nOn the other hand, this was an unusually tough slate for Canyon, and it will be interesting to see how the team responds these next five weeks. \nWhat we learned: The stars have come out \nStrong opponents or not, Valencia and Canyon are two of the area’s established power programs for a reason. Both have seen some impressive performances so far. \nValencia senior quarterback Cole Parkinson has been consistently good, win or lose. He’s thrown for 1,036 yards and nine touchdowns, both ranked second in the league, to go with four interceptions. \nEffie Davalos and Jahmar Berkley provide a combination of solid running backs behind an experienced offensive line. \nThe Vikings’ strong linebacking corps is also picking up steam, as Tariq Speights leads the group with 43 tackles and a forced fumble. In the defensive backfield, Brandon Brooks has snatched a team-high three interceptions. \nCanyon has also displayed some athleticism on defense. Fourth-year varsity middle linebacker Travis Clarke is once again pacing the unit with 49 tackles, and he’s been helped by the strong play of defensive back Markeill Taylor and utility man Marquan West. \nTaylor has also gotten some work in at running back with 224 yards and five touchdowns on just 22 carries. Henry Arellano is Canyon’s leading rusher with 243 yards. \nWhat we need to learn: Will impact players continue to find success? \nThere’s no question that Valencia and Canyon have some athletes to work with on the roster. In some cases, it’s all about finding the best roles for those players. We’ll have to keep an eye on how these coaching staffs try to get the most out of their playmakers. \nWhat we learned: The Cats and Cents are hard to read \nWest Ranch (3-2) and Saugus (2-3) are two teams coming off up-and-down non-league seasons. Now, these two teams face off on Friday at College of the Canyons in a game that will reveal a lot about both squads. \nThe Wildcats are the most explosive passing team in the league thus far as senior Jackson Clark stands above all other Foothill quarterbacks with 1,249 passing yards and 14 touchdowns. West Ranch also has the league’s leading receiver in senior Adam Varga-Thompson, who has 587 yards and six touchdowns. \nThe bulk of Clark’s passing yards (1,017 of them) have come in West Ranch’s three wins. He totaled just 232 combined yards in back-to-back lopsided losses to Antelope Valley and Thousand Oaks. After that, he bounced back and threw for a season-high 407 yards in a thrilling 35-34 come-from-behind victory over Oxnard on Sept. 25. \n“The offensive system is just starting to click,” said West Ranch head coach Jan Miller. “This is our second year into this particular offensive system, and it’s taken a while.” \nSaugus probably runs the fastest-paced offense in the league, and it’s a thing of beauty when it’s working. The option running game has been anchored by quarterback Louis Eusebi and running back David Aubrey, who have combined for 484 yards on the ground. \nThe primary difference between the Centurions’ wins and losses has been ball security. Saugus has turned the ball over 10 times in its three losses and zero times in its two wins. \n“Hopefully (we’re a team) that has grown and matured and learned from both the successes and failures of the first five games,” said Saugus head coach Jason Bornn. \nWhat we need to learn: Which team can find enough consistency in league play? \nWhich version of these two teams will show up Friday? It’s tough to say given how similar their seasons have played out to this point. Both teams are coming off bye weeks which followed big victories. Who can keep the momentum rolling? \nThis week’s game could end up playing a key role in the battle for a top three finish in league and a possible playoff berth.", "external_links": [], "published": "2015-10-08T08:56:00.000+03:00", "crawled": "2015-10-08T09:45:54.372+03:00", "highlightTitle": ""}