{"organizations": [], "uuid": "a23bd8722d212cfb068e3a5ad7289ab163e966cc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "nypost.com", "main_image": "https://thenypost.files.wordpress.com/2015/10/degrom.jpg", "site_section": "http://nypost.com/sports/feed/", "section_title": "| Sports | New York Post", "url": "http://nypost.com/2015/10/21/mets-play-goliath-to-win-pennant-with-bigger-title-in-reach/", "country": "", "title": "Mets play Goliath to win pennant, with bigger title in reach", "performance_score": 0, "site": "nypost.com", "participants_count": 1, "title_full": "Mets play Goliath to win pennant, with bigger title in reach | New York Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T02:46:00.000+03:00", "replies_count": 0, "uuid": "a23bd8722d212cfb068e3a5ad7289ab163e966cc"}, "author": "Mike Vaccaro", "url": "http://nypost.com/2015/10/21/mets-play-goliath-to-win-pennant-with-bigger-title-in-reach/", "ord_in_thread": 0, "title": "Mets play Goliath to win pennant, with bigger title in reach", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO — There was no holding back now, not for anyone in these cramped dressing quarters, certainly not for the man who was enjoying every little bit, every little detail, as much as David Wright was. \nChampagne in the eyes? Let ’em burn. \nTwelve ounces of ice-cold beer down the back of his shirt?\nLet it flow. \nTalking about this Mets team, one he had to take leave of for more than four months? One that was in first place when he departed in early April and was somehow still in first when he returned in late August? One that will officially deliver him to the only baseball place he has ever wanted to go next Tuesday, for Game 1 of the World Series?\nYeah. He could do that. He could do that all night.\n“You’re talking about the 2015 Mets,” Wright said, his eyes wide and his smile wider, “one of the greatest Mets teams ever assembled.”\nOn this night, he was allowed that swatch of hyperbole, they all were. Four more wins and perhaps they really will earn that distinction. Four more wins and they can certainly be part of the discussion, alongside the 1969 Miracle Boys and the ’86 Fun Bunch, and even if that happens those will be debates for the bitter cold nights of January.\nFor now, for the rest of October, there is still a fairy tale to craft, another chapter to create. This 8-3 stomping of the Cubs finished off a sweep of the National League Championship Series that had to be seen to be believed: the Mets never trailed in any of the 36 innings.\nThat probably didn’t sit well in the flyover states, or anywhere else where the Cubs had been adopted as America’s Team. The Mets? They were Apollo Creed, Clubber Lang, Ivan Drago. They were Cobra Kai. They were the Tattaglias and the Barzinis. They stood in the way of the story.\nIt was nothing personal. The Mets are likeable enough, just not lovable. The Cubs are lovable. They are also hibernating, early, for the 107th consecutive season.\n“I think what you saw,” said Steve Matz, the Long Island kid who was given the ball last night and threw 4 ²/₃ gritty, gutsy innings that he won’t soon forget, “is what I saw the first day I arrived with these guys. This is a team that refuses to be told it can’t. We had goals and dreams. And look where we’re going now.”\nThey are going to a fifth World Series, a journey that will begin in either Kansas City or Toronto and could start on the North Pole for all the Mets care; they’ll be ready.\nThey go there led by a manager, Terry Collins, who has selected every proper button for six weeks, his latest trick sticking with Lucas Duda even when it seemed Duda might never get another hit. All Duda did was crush a back-breaking three-run homer in the first and drive in five runs.\nFans celebrate after the Mets clinch World Series berth. Photo: Anthony J. Causi “I knew if I stuck with him and he came through,” Collins said, “that he could carry us.”\nThe same could be said for Collins himself, of course, given a third crack at managing with a Mets club that was raggedy on its best days for most of four years, and then blossomed into this kaleidoscope of baseball wonder this year. Few would tab Collins over his old coach, Joe Maddon, if you were picking sides and looking for a skipper; all Collins did these last five days was outfox, outmaneuver and out-manage his old colleague.\nWell, and he also wrote Daniel Murphy’s name on his lineup card every day. That’s pretty smart managing, too. It took Murphy until the eighth inning before he cleared the wall this time — sixth straight game, seventh overall — and he went 4-for-5 to win the NLCS MVP in a landslide that made Reagan-Mondale look like a nail-biter.\n“I’m going to be able to tell my kids I played with Babe Ruth,” Curtis Granderson said, laughing.\n“I can’t explain it,” Murphy said. “I really can’t.”\nHe doesn’t have to. The trophy is his. The pennant belongs to the Mets. And the last laugh belonged to the thousand or so Mets fans who stuck around a full hour after the final out was recorded at 10:39 local time, amusing themselves with an old standard:\n… East side, West Side\nEverybody’s coming down …\nTo meet the M-E-T-S Mets\nOf New … York … Town! \nThey turned the lights off on them at Wrigley. They didn’t budge. They had waited as long as David Wright for a night like this, for a moment like this. There was another chorus to sing. And four more games to win.\nSorry, America. The Mets have their own plans.\nShare this: Facebook Twitter Google Whatsapp Email Filed under chicago cubs ,  mlb playoffs ,  new york mets ,  terry collins", "external_links": [], "published": "2015-10-22T02:46:00.000+03:00", "crawled": "2015-10-22T09:21:07.787+03:00", "highlightTitle": ""}