{"organizations": [], "uuid": "0865d09e6af3040e8738d571b5522d3dcc5fdfe9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/49312959.cms", "site_section": "http://timesofindia.indiatimes.com/sports/racing/top-stories/articlelist/10514745.cms", "section_title": "Top Stories - Racing - Sports - The Times of India", "url": "http://timesofindia.indiatimes.com/sports/racing/top-stories/Lewis-Hamilton-wins-dramatic-Russian-Grand-Prix/articleshow/49312163.cms", "country": "IL", "title": "Lewis Hamilton wins dramatic Russian Grand Prix", "performance_score": 0, "site": "indiatimes.com", "participants_count": 6, "title_full": "Lewis Hamilton wins dramatic Russian Grand Prix - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T03:00:00.000+03:00", "replies_count": 5, "uuid": "0865d09e6af3040e8738d571b5522d3dcc5fdfe9"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/sports/racing/top-stories/Lewis-Hamilton-wins-dramatic-Russian-Grand-Prix/articleshow/49312163.cms", "ord_in_thread": 0, "title": "Lewis Hamilton wins dramatic Russian Grand Prix", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SOCHI (Russia): Lewis Hamilton won a dramatic Russian Formula One Grand Prix on Sunday to take a huge step towards his third world championship after Mercedes teammate Nico Rosberg retired early on with throttle failure.\nThe win was Hamilton's ninth of the season, and the 42nd of his career, and the Briton's untroubled afternoon was a stark contrast to his German team mate's woes.\nFerrari's Sebastian Vettel finished runner-up at the Olympic Park circuit to overtake Rosberg as Hamilton's closest rival, 66 points adrift of the Briton with four races and a maximum 100 points remaining.\nIf results go Hamilton's way, he can secure his second successive title in Austin, Texas, in two weeks' time.\nHamilton, who also won the inaugural Russian Grand Prix last year and has now surpassed the tally of victories racked up by the late triple champion Ayrton Senna, now has 302 points to Vettel's 236 and Rosberg on 229.\n\"It looked like we were going to have a race and I was thinking this is great and we were going to put on a good show,\" said Hamilton, after collecting the winners' trophy from Russian president Vladimir Putin.\n\"Nico made a mistake at turn one and went wide. I overtook him and after that, or maybe even before, he started to have some problems. It is very unfortunate for the team.\"\n\"Those last five laps I was just taking it in. I don't know how many times I'll be in this position again,\" added the champion.\nMexican Sergio Perez finished third for Force India, in a race with two safety car interludes following crashes, after Finnish drivers Valtteri Bottas and Kimi Raikkonen collided while battling for the final podium place.\nRaikkonen finished fifth for Ferrari, a result that kept Mercedes waiting for their second successive constructors' championship.\nHowever, the Finn faced a stewards enquiry into the collision, with the possibility of a penalty for ramming the rear of Bottas's Williams.\nOPENING LAP\nThe safety car was deployed after Perez's teammate Nico Hulkenberg spun on the opening lap and was hit by the Sauber of Marcus Ericsson with Max Verstappen's Toro Rosso also caught up in the action.\nRosberg had led from pole, holding off Hamilton through the opening corners, but was forced to retire in the pits on the seventh of 53 laps.\n\"F1 is pretty incredible sometimes how tough it is,\" the German told the BBC.\n\"After a great start, leading the race and feeling confident. Straight after the safety car the pedal broke. It was quite dangerous. Definitely not a nice way to end the day.\"\nHamilton had already taken over the lead as Rosberg wrestled with the problem but his advantage was whittled away when Frenchman Romain Grosjean crashed heavily on lap 12 and brought out the safety car again.\nPerez had thought his podium hopes had gone when Bottas and Raikkonen, on fresher tyres, passed him in the closing laps but the collision put him right back for his first top three finish of the season.\n\"One lap before the end it seemed like everything went away from us. I was very unhappy with myself but in the end I thought ''I gave it all\",\" said the Mexican.\n\"I did plenty of laps with my tyres and had massive degradation. On the last lap when it came it was just amazing.\"\nBrazilian Felipe Massa finished fourth for Williams while Russian Daniil Kvyat was sixth for Red Bull, ahead of Sauber's Brazilian Felipe Nasr and Venezuelan Pastor Maldonado in a Lotus.\nIn a boost for struggling McLaren, Jenson Button and Fernando Alonso finished ninth and 10th respectively.\nSpanish rookie Carlos Sainz, who was in hospital only a day earlier after crashing his Toro Rosso in practice, had been heading for his best result after running as high as sixth but retired eight laps from the end.", "external_links": [], "published": "2015-10-11T03:00:00.000+03:00", "crawled": "2015-10-19T23:33:29.822+03:00", "highlightTitle": ""}