{"organizations": [], "uuid": "27f0b0f7e2525dc45396b47c20412daf830ab3f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.miamiherald.com", "main_image": "http://www.miamiherald.com/news/local/community/miami-dade/vki480/picture39413928/ALTERNATES/LANDSCAPE_1140/11358281473_f786456484_o", "site_section": "http://www.miamiherald.com/?widgetName=rssfeed&widgetContentId=712015&getXmlFeed=true", "section_title": "Breaking News, Sports, Weather & More | MiamiHerald.com &", "url": "http://www.miamiherald.com/news/local/community/miami-dade/article39413934.html", "country": "US", "title": "Everglades National Park seeks volunteers to preserve Cold War history", "performance_score": 0, "site": "miamiherald.com", "participants_count": 1, "title_full": "Everglades National Park seeks volunteers to preserve Cold War history", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T21:03:00.000+03:00", "replies_count": 0, "uuid": "27f0b0f7e2525dc45396b47c20412daf830ab3f5"}, "author": "STEPHANIE BRITO \nsbrito@miamiherald.com", "url": "http://www.miamiherald.com/news/local/community/miami-dade/article39413934.html", "ord_in_thread": 0, "title": "Everglades National Park seeks volunteers to preserve Cold War history", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "October 16, 2015 Everglades National Park seeks volunteers to preserve Cold War history \nThe Nike Hercules Missile Base HM-69 is seeking volunteers to preserve its oral history and the site \nMissiles at the base could travel 2,700 mph and could be launched in 15 minutes \nThe site reminds veterans and others who lived through the crisis about the genuine fear they felt A missile in front Section Barn in 1977. Two years later, the Nike Missile Base would cease official use. NPS Two workers check the arming device of a missile at the Nike Missile Base on Jan. 17, 1968. NPS 1 of 2 Order Reprint of this Story \nThe U.S. Army Corps of Engineers built the Nike Hercules Missile Base HM-69 at Everglades National Park immediately following the Cuban Missile Crisis of October 1962. Today, the site serves no official use, but is a relic of the height of the Cold War in South Florida. \nTo continue to preserve the oral history of the site, Everglades National Park is seeking volunteers to lead tours and collaborate with veterans. \nThe Nike Hercules Missile Site is one of four sites in South Florida that were once part of a missile defense system put in place following the Cuban Missile Crisis. The Everglades base is the only one that remains intact. \nThe site’s official use ended in 1979, but remnants of a pivotal point in contemporary U.S. history are open to the public. In 2004, the U.S. Department of the Interior’s National Register of Historic Places listed the missile base as a historic district. \nIn 2012, in observance of the 50-year anniversary of the Cuban Missile Crisis, the missile was refurbished and new historic memorabilia was brought to the site. \nWhen military veteran Ted Swanson served on the base from 1966 to 1968, missiles at the center was capable of traveling 2,700 mph and could be launched in just 15 minutes. As the base became recognized as an historical site, Swanson began collecting the names of veterans who served at the base. The list now has about 1,500 names. \nTo Swanson and other veterans, the base serves as a reminder of the genuine fear people felt during the Cuban Missile Crisis, particularly in South Florida. \n“Most of us that lived through the Cuban Missile Crisis were genuinely scared. It was a nervous time period and they brought missiles down in planes and on trucks and trains,” he said. \nBut the true impact is that the base serves as a reminder that there wasn’t nuclear war and that these fears were alleviated. \n“[The base] reminds people that with a strong military you can actually avoid a conflict. It’s part of our history and if you don’t pay attention to history you’re going to relive it,” Swanson said. \nA mandatory volunteer training for the Nike Missile Base programs will be held from 8:45 a.m. to 3 p.m., Oct. 24 starting at the Ernest F. Coe Visitor Center, 40001 State Hwy. 9336. Lunch will provided and volunteers are expected to read Appendix One of Cold War in South Florida Historic Resource Study before the training. \nIf you go \n▪ What: Mandatory volunteer training for Nike Missile Base volunteers, including lunch. \n▪ Where: Ernest F. Coe Visitor Center, 40001 State Hwy. 9336, Homestead \n▪ When: 8:45 a.m. to 3 p.m., Oct. 24 \n▪ Before: Read Appendix One of Cold War in South Florida Historic Resource Study Related content", "external_links": [], "published": "2015-10-16T21:03:00.000+03:00", "crawled": "2015-10-16T22:58:05.421+03:00", "highlightTitle": ""}