{"organizations": [], "uuid": "66bb707af65d5387fd97786b60cd7037301cba4d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.si.com", "main_image": "http://cdn-jpg.si.com/sites/default/files/styles/si_gallery_slide/public/2015/10/19/timbers-power-rankings-mls-33.jpg?itok=xXpJgZrQ", "site_section": "http://www.si.com/htmlsitemap/2014/01/page-1", "section_title": "The Sports Illustrated HTML Sitemap Index for January, 2014 - SI.com", "url": "http://www.si.com/planet-futbol/2015/10/19/mls-power-rankings-week-33-decision-day-toronto-fc-grella-portland-timbers-playoffs", "country": "US", "title": "MLS Power Rankings Week 33: Decision Day nears; Timbers bust out - Planet Futbol", "performance_score": 0, "site": "si.com", "participants_count": 1, "title_full": "MLS Power Rankings Week 33: Decision Day nears; Timbers bust out - Planet Futbol - SI.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "66bb707af65d5387fd97786b60cd7037301cba4d"}, "author": "Liviu Bird", "url": "http://www.si.com/planet-futbol/2015/10/19/mls-power-rankings-week-33-decision-day-toronto-fc-grella-portland-timbers-playoffs", "ord_in_thread": 0, "title": "MLS Power Rankings Week 33: Decision Day nears; Timbers bust out - Planet Futbol", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "by Liviu Bird Twitter Email Posted: Mon Oct. 19, 2015 Playoff spots in each conference and the Supporters' Shield remain up for grabs after a wild penultimate week in the 2015 Major League Soccer regular season. Following the international break, the league resumed with a full schedule and no shortage of teams jumping places with interesting results. It started on Wednesday, where the legend of Sebastian Giovinco continued to grow almost as soon as the Italian stepped off the plane from Euro qualifiers. On the same day, FC Dallas clinched first place in the West with another solid performance, and the Portland Timbers topped Real Salt Lake to set themselves up for a weekend showdown with the LA Galaxy. A relatively calm Friday and Saturday gave way to a bonkers day on Sunday, in which three of the eight teams involved scored four or more goals. It’s no surprise that a goalscoring record was broken on the crazy day, but what was at least a little surprising was Portland’s second win of the week, a five-goal, comeback victory over LA that announced the Timbers’ intentions for the postseason quite clearly. Here are a few thoughts ahead of MLS Decision Day: Timbers aren’t to be taken lightly Teams in 2015 MLS playoffs so far EAST WEST New York Red Bulls FC Dallas D.C. United LA Galaxy Columbus Crew Vancouver Whitecaps Toronto FC Montreal Impact Portland hasn’t gotten two results more important this season than those it managed this week. It was the sixth time the Timbers have played consecutive games on the road, but only the first that they won both.\nCaleb Porter likes to say that on their day, the Timbers can beat anybody, and they showed it by putting up five goals at StubHub Center against the defending champion with all its stars on the field. It was the first time in the MLS era that the Timbers defeated LA in California, and a week like this one should give Portland some belief heading into the postseason.\nThe team showed great character coming back from a goal down, although the Timbers came very close to scoring a couple times in the first half and only trailed thanks to a Robbie Keane wonder strike. It’s not certain yet that they will qualify for the playoffs–a series of results could put Portland on the outside looking in still–but it’s hard to bet against a home win against the Colorado Rapids after the week the Timbers have had.\nAnd after that? Well, they have indeed shown that they can beat anybody.\nRed Bulls come out of their shell again It’s been a few weeks since the Red Bulls really took a team to task with their attack—the last time was probably in two 3-0 wins over Toronto and D.C. United in August—but that’s exactly what they did to the Philadelphia Union on Sunday. Mike Grella started it after just seven seconds, breaking the record for fastest MLS goal after a comedy of defensive errors, and it continued from there.\nWATCH: Grella sets MLS record for fastest goal The Red Bulls scored on three of their first four shots and added another before halftime to bury their opponent quickly. The attack crackled all day, finishing with 63% possession and 13 shots, and the Red Bulls led nearly every statistical category.\nThey and Dallas can’t be caught at the top of their conferences, but they’re dead even in the Supporters’ Shield race with the same record ahead of the final day of the season. The Red Bulls have a six-goal advantage in goal difference, though, and face an easier opponent in Chicago than Dallas faces at home against the San Jose Earthquakes. For the second time in three seasons, the Supporters' Shield could find its way to Red Bull Arena, which would be quite the accomplishment after all of the club's offseason turmoil.\nSTRAUS: Inside Ali Curtis's 300-page plan for the Red Bulls Toronto FC finally breaks the streak After a nine-year wait, Toronto FC is in the playoffs. Likely MVP award winner Giovinco made sure of it with his crazy run through the New York Red Bulls defense on Wednesday in what should be a Goal of the Year candidate.\nPlanet Futbol Giovinco’s incredible goal clinches Toronto FC’s first-ever playoff berth by Ben Estes", "external_links": ["http://twitter.com/liviubird"], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-20T02:39:57.979+03:00", "highlightTitle": ""}