{"organizations": [], "uuid": "b47ee95f4ac75e401208059f5a19c26ff7c9de88", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.beaumontenterprise.com", "main_image": "http://ww1.hdnux.com/photos/41/22/30/8726072/5/rawImage.jpg", "site_section": "http://www.beaumontenterprise.com//otherpubs/collectionRss/Home-HCat-Sports-7274.php", "section_title": "Home HCat Sports", "url": "http://www.beaumontenterprise.com/sports/hs/article/West-Brook-upsets-Channelview-61-38-6544734.php", "country": "US", "title": "West Brook upsets Channelview 61-38", "performance_score": 0, "site": "beaumontenterprise.com", "participants_count": 1, "title_full": "West Brook upsets Channelview 61-38", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T07:03:00.000+03:00", "replies_count": 0, "uuid": "b47ee95f4ac75e401208059f5a19c26ff7c9de88"}, "author": "Daniel Maher,By", "url": "http://www.beaumontenterprise.com/sports/hs/article/West-Brook-upsets-Channelview-61-38-6544734.php", "ord_in_thread": 0, "title": "West Brook upsets Channelview 61-38", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Close Image 1 of 35 \nWest Brook's Nick Sorrell finds an opening in Channelview's defense as he runs the ball during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken   Photo by Kim Brent Photo: Kim Brent West Brook's Nick Sorrell finds an opening in Channelview's defense... Image 2 of 35 \nWest Brook's Joel Denly runs around the side as he carries the ball against Channelview during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken   Photo by Kim Brent Photo: Beaumont Enterprise West Brook's Joel Denly runs around the side as he carries the ball... Image 3 of 35 \nWest Brook's Corry McGill leaps to try for the interception on the pass to Channelview's Anthony Means, who caught it for a touchdown during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken   Photo by Kim Brent Photo: Beaumont Enterprise West Brook's Corry McGill leaps to try for the interception on the... Image 4 of 35 \nWest Brook's student section get in the spirit as they root on the Bruins during their homecoming match-up with Channelview Thursday at the Thomas Center in Beaumont. Photo taken   Photo by Kim Brent Photo: Kim Brent West Brook's student section get in the spirit as they root on the... Image 5 of 35 \nWest Brook's Innis Gaines eyes the action as he and the defense prepare to take over against Channelview during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken   Photo by Kim Brent Photo: Kim Brent West Brook's Innis Gaines eyes the action as he and the defense... Image 6 of 35 \nWest Brook's Missial Tovar kicks off the ball to Channelview during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken   Photo by Kim Brent Photo: Kim Brent West Brook's Missial Tovar kicks off the ball to Channelview   35 \nWest Brook's Channelview's during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken   Photo by Kim Brent Photo: Kim Brent West Brook's Channelview's during Thursday night's match-up at the... Image 8 of 35 \nWest Brook's David Chassion pumps up the crowd as they battle Channelview during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken   Photo by Kim Brent Photo: Kim Brent West Brook's David Chassion pumps up the crowd as they battle... Image 9 of 35 \nWest Brook's fans make their way to the stands as the sun sets before the Bruins' game against Channelview during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken   Photo by Kim Brent Photo: Kim Brent West Brook's fans make their way to the stands as the sun sets... Image 10 of 35 \nWest Brook's Justin Essex hands off the ball to Joel Denly as they battle Channelview during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken   Photo by Kim Brent Photo: Kim Brent West Brook's Justin Essex hands off the ball to Joel Denly as they... Image 11 of 35 \nWest Brook's Channelview's during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken   Photo by Kim Brent Photo: Kim Brent West Brook's Channelview's during Thursday night's match-up at the... Image 12 of 35 \nWest Brook's Channelview's during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken   Photo by Kim Brent Photo: Kim Brent West Brook's Channelview's during Thursday night's match-up at the... Image 13 of 35 \nWest Brook's dance team lines up before taking the field during Thursday night's match-up with Channelview at the Thomas Center in Beaumont. Photo taken   Photo by Kim Brent Photo: Beaumont Enterprise West Brook's dance team lines up before taking the field during... Image 14 of 35 \nWest Brook's head coach Kevin Flanigan awaits the game start with Channelview during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken   Photo by Kim Brent Photo: Beaumont Enterprise West Brook's head coach Kevin Flanigan awaits the game start with... Image 15 of 35 \nWest Brook's head coach Kevin Flanigan gives starters advice before taking the field against Channelview during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken   Photo by Kim Brent Photo: Beaumont Enterprise West Brook's head coach Kevin Flanigan gives starters advice before... Image 16 of 35 \nWest Brook's Gracie Prause shares a moment in-between cheers alongside Sparkle Team member Michael Littlefield as they gear up for the homecoming bout against Channelview during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken   Photo by Kim Brent Photo: Kim Brent West Brook's Gracie Prause shares a moment in-between cheers... Image 17 of 35 \nWest Brook's fans enjoy the pre-game activities before facing Channelview during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken   Photo by Kim Brent Photo: Kim Brent West Brook's fans enjoy the pre-game activities before facing... Image 18 of 35 \nWest Brook's dance squad lines up before taking the field as the Bruins face Channelview during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken   Photo by Kim Brent Photo: Kim Brent West Brook's dance squad lines up before taking the field as the... Image 19 of 35 \nWest Brook's fans enjoy the pre-game activities before facing Channelview during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken   Photo by Kim Brent Photo: Kim Brent West Brook's fans enjoy the pre-game activities before facing... Image 20 of 35 \nWest Brook's Bruins burst onto the field to face Channelview during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken   Photo by Kim Brent Photo: Kim Brent West Brook's Bruins burst onto the field to face Channelview during... Image 21 of 35 \nWest Brook's dance team joins in the school song before their homecoming match-up with Channelview Thursday night at the Thomas Center in Beaumont. Photo taken   Photo by Kim Brent Photo: Kim Brent West Brook's dance team joins in the school song before their... Image 22 of 35 \nWest Brook's Gracie Prause cheers alongside Sparkle Team member Michael Littlefield as they gear up for the homecoming bout against Channelview during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken   Photo by Kim Brent Photo: Kim Brent West Brook's Gracie Prause cheers alongside Sparkle Team member... Image 23 of 35 \nWest Brook's fans enjoy the pre-game activities before facing Channelview during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken   Photo by Kim Brent Photo: Kim Brent West Brook's fans enjoy the pre-game activities before facing... Image 24 of 35 \nWest Brook's Channelview's during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken   Photo by Kim Brent Photo: Kim Brent West Brook's Channelview's during Thursday night's match-up at the... Image 25 of 35 \nWest Brook's Jacoby Harris dives to try and stop Channelview's Jalen Hurts during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken   Photo by Kim Brent Photo: Kim Brent West Brook's Jacoby Harris dives to try and stop Channelview's... Image 26 of 35 \nWest Brook's fans enjoy the pre-game activities before facing Channelview during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken   Photo by Kim Brent Photo: Kim Brent West Brook's fans enjoy the pre-game activities before facing... Image 27 of 35 \nWest Brook's fans take in the pre-game activities before facing Channelview during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken   Photo by Kim Brent Photo: Kim Brent West Brook's fans take in the pre-game activities before facing... Image 28 of 35 \nWest Brook's homecoming court make their way onto the field during Thursday night's match-up with Channelview at the Thomas Center in Beaumont. Photo taken   Photo by Kim Brent Photo: Kim Brent West Brook's homecoming court make their way onto the field during... Image 29 of 35 \nWest Brook's dance team takes the field during Thursday night's match-up with Channelview at the Thomas Center in Beaumont. Photo taken   Photo by Kim Brent Photo: Kim Brent West Brook's dance team takes the field during Thursday night's... Image 30 of 35 \nWest Brook's dance team awaits entry onto the field as they get ready to face Channelview during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken   Photo by Kim Brent Photo: Kim Brent West Brook's dance team awaits entry onto the field as they get... Image 31 of 35 \nWest Brook's varsity line up before facing Channelview during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken   Photo by Kim Brent Photo: Kim Brent West Brook's varsity line up before facing Channelview during... Image 32 of 35 \nWest Brook's homecoming court takes the field before the Bruins face Channelview during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken   Photo by Kim Brent Photo: Kim Brent West Brook's homecoming court takes the field before the Bruins... Image 33 of 35 \nWest Brook's fans enjoy the pre-game activities before facing Channelview during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken   Photo by Kim Brent Photo: Kim Brent West Brook's fans enjoy the pre-game activities before facing... Image 34 of 35 \nWest Brook's Bruins burst onto the field to face Channelview during Thursday night's match-up at the Thomas Center in Beaumont. Photo taken   Photo by Kim Brent Photo: Kim Brent West Brook's Bruins burst onto the field to face Channelview during... Image 35 of 35 West Brook upsets Channelview 61-38 1 / 35 Back to Gallery \nWest Brook neutralized Channelview's star quarterback Jalen Hurts behind five rushing touchdowns and 279 yards from Joel Denly to give the Bruins a 61-38 upset over the previously unbeaten Falcons. \nWHAT HAPPENED: The Bruins committed to the ground game and enjoyed great success gaining 346 yards. Most of the workload was borne by Denly, who had 42 carries. As a consequence, Hurts, a dual threat who had accounted for 27 touchdowns entering Thursday's game, settled for one rushing touchdown and another through the air. \n\"We've been challenging the offensive line to come out more aggressively,\" said Bruins coach Kevin Flanigan . \"I though they did a great job of that (Thursday night).\" \nTURNING POINT: After Channelview got a 77-yard kickoff return touchdown from Tuciano Pope in the final minute of the third quarter to close within 40-38, West Brook turned the game over to Denly, giving him the ball seven times in eight plays on the subsequent scoring drive. \nHis 6-yard TD burst opened the floodgates on 21 unanswered fourth quarter points for the Bruins. \n\"Denly did a great job all night with being patient. It was the most patient I've seen him all year,\" said Flanigan. \nMOST-SPECTACULAR PLAY: Just four plays after West Brook quarterback Justin Essex let Channelview take a 31-27 lead on a pick six, Flanigan called his number again, letting him throw deep on second-and-14 to a streaking Keith Corbin who outran defenders on a deep post for a 76-yard score and a lead that West Brook never lost. \n\"We'd kind of been getting their safeties sucked up with our running game, so I thought we'd take a chance,\" said Flanigan. \"They actually lined up differently then I expected, so I second guessed myself but it worked out.\" \nBY THE NUMBERS: West Brook had six rushing touchdowns, with Denly getting the first five. Essex's bomb to Corbin was his lone passing TD on a night when he was 9 of 16 with an interception and 201 yards. Corbin grabbed five passes for 142 yards and the TD. \nHurts struggled against West Brook's constant pressure, completing just 10 of 27 throws for 198 yards and a touchdown. He passed for only three yards in the second half. \nChannelview's Demontre Tuggle led the Falcons in rushing with 145 yards and a touchdown on 17 carries. \nHE SAID IT: \"We took some chances and manned up. We got in his face, and after the first quarter I felt we did a good job containing him,\" said Flanigan in explaining the game plan that held Hurts in check. \nRECORDS: West Brook 4-2, 1-1. Channelview 5-1, 1-1. \nNEXT UP: West Brook plays at Deer Park next Friday at 7:00 p.m. Southeast Texas sports news", "external_links": [], "published": "2015-10-02T07:03:00.000+03:00", "crawled": "2015-10-02T07:49:17.360+03:00", "highlightTitle": ""}