{"organizations": ["Tottenham"], "uuid": "27bb42a96d4d2d9073a71d3fd7b7aefc2ef3a13e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ibtimes.co.uk", "main_image": "http://d.ibtimes.co.uk/en/full/1463949/wembley-stadium.jpg", "site_section": "http://ibtimes.co.uk//rss/sports", "section_title": "IBTimes.co.uk : Sports", "url": "http://www.ibtimes.co.uk/chelsea-muscle-tottenham-attempt-secure-wembley-4-year-offer-ground-share-possible-1524315", "country": "US", "title": "Chelsea muscle in on Tottenham attempt to secure Wembley with 4-year offer but ground-share possible", "performance_score": 0, "site": "ibtimes.co.uk", "participants_count": 0, "title_full": "Chelsea muscle in on Tottenham attempt to secure Wembley with 4-year offer but ground-share possible", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T16:30:00.000+03:00", "replies_count": 0, "uuid": "27bb42a96d4d2d9073a71d3fd7b7aefc2ef3a13e"}, "author": "", "url": "http://www.ibtimes.co.uk/chelsea-muscle-tottenham-attempt-secure-wembley-4-year-offer-ground-share-possible-1524315", "ord_in_thread": 0, "title": "Chelsea muscle in on Tottenham attempt to secure Wembley with 4-year offer but ground-share possible", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "October 16, 2015 14:30 BST Chelsea eye four-year stay at the home of English football Getty \nA lucrative four-year offer from Chelsea to use Wembley could force Tottenham Hotspur to rethink their efforts to find a temporary home while their new stadium is being completed. But the Football Association is strongly considering the possibility of the London rivals sharing the national team stadium for the 2017-18 season, according to Spurs chairman Daniel Levy. \nTottenham will move into their new £400m ($618m) stadium, which is to be built adjacent to the current White Hart Lane, in time for the start of the 2018-19 campaign. The north London club will have to find another home for the 2017-18 season, with chairman Daniel Levy confirming in August the club were in discussions with the FA over a temporary move to Wembley, located just 13 miles from their current home. \nChelsea, meanwhile, will have to vacate Stamford Bridge while development to increase its capacity to 60,000 is carried out. The Daily Mail suggests the club will have to leave their south-west London home from the 2017-18 season, with their new home set for completion in 2020. \nThe FA has until recently remained distant to the idea of a Premier League side using the national team stadium for their home games. It would appear that stance has softened, though, aided by Chelsea's offer to agree to a lucrative four-year deal with English football's governing body. \nTottenham are willing to pay £15m to make Wembley their home for their season, an offer dwarfed by Chelsea's, which will reportedly be worth closer to £60m and will allow them use of the venue until 2021. \nThe topic was recently discussed at a meeting between the Tottenham Hotspur Supporters' Trust and chairman Levy. Minutes from the meeting noted : \"Daniel Levy said the FA's stance for some time has been that is was a national stadium and they were not interested in any Premier League club playing at Wembley. So, despite offers from THFC, there has been no willingness from the FA to progress discussions. \n\"Chelsea's offer of a four-year deal, which would deliver a substantial sum of money, had changed this position and the FA would now consider a PL team. A four-year deal was thought to be far more attractive to Wembley than a one-year deal, although Daniel Levy stressed the 'per season' income to Wembley was unlikely to be materially different from either club. Levy also felt that the FA acknowledged the need to treat clubs equally. \n\"The FA has now said it will go away and consider the practicalities of a ground share. Until that is decided, no further discussions can take place.\" \nLevy also revealed in the meeting that the Wembley board will also give its recommendation to the FA, who will make the final decision. Tottenham have until March 2017 to have arrangements over their temporary home finalised. \nChelsea have also explored the option of a temporary stay at Twickenham, an idea favoured by some Chelsea supporters' groups . Tottenham, meanwhile, have also considered the possibility of a ground-share with League One side MK Dons at the Arena:MK, located 54 miles away from White Hart Lane. More about Premier League", "external_links": [], "published": "2015-10-16T16:30:00.000+03:00", "crawled": "2015-10-16T16:42:35.921+03:00", "highlightTitle": ""}