{"organizations": [], "uuid": "054805a4a78bd7aaf1721383bed2686a571007e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/Portal/6/Sports.aspx", "section_title": "Sports - Ahram Online ", "url": "http://english.ahram.org.eg/NewsContent/6/55/153831/Sports/World/Spain-boss-Del-Bosque-faces-selection-headache.aspx", "country": "EG", "title": "Spain boss Del Bosque faces selection headache - World", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Spain boss Del Bosque faces selection headache - World - Sports - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "054805a4a78bd7aaf1721383bed2686a571007e8"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/6/55/153831/Sports/World/Spain-boss-Del-Bosque-faces-selection-headache.aspx", "ord_in_thread": 0, "title": "Spain boss Del Bosque faces selection headache - World", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related I've never been negative about Spain: Barcelona defender Pique Vicente del Bosque relieved after Spain qualification Injured Spain duo Silva and Morata to miss Ukraine game Lionel Messi to be tried in Spain on tax fraud charges Spain's Del Bosque hints he may stay after Euro 2016 Spain coach Vicente del Bosque acknowledged he faces a tough task in deciding who to leave out of his 23-man squad for Euro 2016, with a particular embarrassment of riches in midfield.\nThe holders wrapped up their Group C qualifying campaign with a 1-0 victory away to Ukraine on Monday, when Del Bosque had the luxury of fielding an experimental side with Spain already through as section winners.\nWhile the eight defenders and four forwards may be easier to select, among the midfielders who will be pushing for a place at the tournament in France next year are Cesc Fabregas, Isco, Thiago Alcantara, Sergio Busquets, Koke, Andres Iniesta, Santi Cazorla, David Silva, Juan Mata,Javi Martinez, Mikel San Jose and Bruno Soriano.\nMost of those players would make it into any national team but four are likely to miss out as Spain chase an unprecedented third consecutive continental title after their triumphs in 2008 and 2012.\n\"It was good that we were able to look at some different players and test whether they will be of use,\" Del Bosque told a news conference at Kiev's Olympic Stadium.\n\"It's going to be a problem choosing 23 players but there is still a long way to go,\" he added.\n\"We have a good substance, some good players, and that makes the coach's task easier.\"\nSpain's eighth qualifying win in a row put them on 27 points from 10 matches and they have gone eight competitive games without conceding for the first time.\nSlovakia finished with 22 points and Ukraine, who go into the play-offs, with 19, eight ahead of fourth-placed Belarus.\nDel Bosque praised goalkeeper David De Gea, who was deputising for captain Iker Casillas and made a host of fine saves to deny Ukraine.\nDe Gea is the natural successor to Casillas but the former Real Madrid keeper, now at Porto, will almost certainly remain Spain's No 1 for what would be his final major tournament.\n ", "external_links": ["https://twitter.com/AO_Sports", "https://www.facebook.com/AhramOnlineSports?fref=ts"], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T16:52:29.080+03:00", "highlightTitle": ""}