{"organizations": [], "uuid": "00982bac1f516b14c8c4b6e72264b1e206d998ff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kptv.com", "main_image": "http://images.worldnow.com/AP/images/8975335_G.jpg", "site_section": "http://kptv.com/category/208630/sports?clienttype=rss", "section_title": "KPTV.com - Sports", "url": "http://www.kptv.com/story/30219458/with-platini-suspended-fifa-election-field-more-uncertain", "country": "US", "title": "With Platini suspended, FIFA election field more uncertain", "performance_score": 0, "site": "kptv.com", "participants_count": 1, "title_full": "With Platini suspended, FIFA election field more uncertain - KPTV - FOX 12", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "00982bac1f516b14c8c4b6e72264b1e206d998ff"}, "author": "cbs8", "url": "http://www.kptv.com/story/30219458/with-platini-suspended-fifa-election-field-more-uncertain", "ord_in_thread": 0, "title": "With Platini suspended, FIFA election field more uncertain", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By ROB HARRIS\nAP Sports Writer LONDON (AP) - From sure bet to suspended, Michel Platini's career in soccer politics could be over.\nThe UEFA president is likely to be barred from standing in February's emergency FIFA presidential election, with his minimum 90-day ban starting only a few weeks before he would have had to pass integrity checks.\nThursday's decision by the FIFA ethics committee throws into doubt who will succeed Sepp Blatter as head of the world's most popular sport on Feb. 26.\nHere's a look at some of the questions concerning the election:\n___\nWHY HAS PLATINI BEEN SUSPENDED?\nOfficially, the FIFA ethics committee is not saying why because of secrecy rules the all-powerful executive committee refused to ease last month. But Platini was suspended for 90 days along with FIFA President Sepp Blatter two weeks after they both became embroiled in a Swiss criminal investigation.\nThey were questioned by the Swiss investigators about why Platini received 2 million Swiss francs (about $2 million) from FIFA in 2011 for work carried out up to 2002.\nThe case appears to be more serious for Blatter, who is considered a suspect. Platini is being treated \"between a witness and an accused person,\" according to Swiss authorities. Both deny wrongdoing and have not been charged.\nThe case could hinge partially on whether there is a written contract that shows Platini was owed the money. Platini said he wasn't paid in 2002 because of FIFA's financial predicament.\n___\nWHY IS THERE A PRESIDENTIAL VACANCY AT FIFA?\nBlatter was re-elected for a fifth, four-year term as FIFA president on May 29, despite some of his closest allies being arrested in Zurich after they were indicted by U.S. authorities in a far-reaching soccer bribery case.\nFour days later, the 79-year-old Blatter announced his decision to quit, seemingly under pressure from sponsors and the threat of legal action.\nThe presidential election date was set for Feb. 26, with the deadline for contenders to submit their candidacies on Oct. 26. Not only do they require the backing of five of the 209 federations but they must pass integrity checks to show they are suitable to run FIFA.\nPlatini submitted his candidacy documents on Thursday morning, shortly before he was suspended by FIFA. It's seems highly unlikely he could be approved to make the ballot while banned from carrying out any role in soccer for 90 days.\n___\nIF NOT PLATINI, WHO COULD WIN?\nPlatini's closest challenger before his suspension was Prince Ali bin al-Hussein. The Jordanian had the support of Platini and much of Europe in the May election when he challenged Blatter, but the prince turned on the Frenchman when it became clear they would be rivals in the new election.\nThe prince will hope to sweep up support in Europe, but for now Platini appears to have maintained his backers.\nAnd when Europe's 54 nations meet on Thursday at UEFA headquarters in Nyon, Switzerland, they will be discussing whether to stick with Platini or search for a new candidate to support.\nSouth Korea's Chung Mong-joon, a former FIFA vice president, was ruled out of contention on Thursday when he was banned from soccer for six years over breaches relating to the investigation into the 2022 World Cup bidding contest.\nHere are some other people who have expressed an interest in standing for FIFA president but who have yet to say if they have five nominations:\n- Brazil great Zico\n- Former Trinidad and Tobago captain David Nakhid\n- Former Nigeria player Segun Odegbami\n- Liberia federation president Musa Bility\n- Former Nigerian state governor Orji Uzor Kalu\n___\nOTHER POTENTIAL CONTENDERS?\n- Two Gulf sheikhs, who are members of FIFA's executive committee, are constantly linked with the presidency: Asian Football Confederation President Sheikh Salman Bin Ebrahim Al Khalifa from Bahrain and Sheikh Ahmad Fahad Al Ahmad Al Sabah, an Olympic powerbroker from Kuwait. Neither has offered any public intention they want the top job.\n- South African businessman Tokyo Sexwale, a longtime confidante of Nelson Mandela, says he is still considering whether to stand. He made a high-profile international trip on FIFA business last week, mediating between the Palestinian and Israeli soccer federations in Tel Aviv.\n- Jerome Champagne, a former FIFA deputy secretary general, is still mulling over his options after failing to gain the five federation nominations required to stand in May.\n- German soccer federation president Wolfgang Niersbach is expected to be a future leader, but his immediate ambition appeared to be replacing Platini at UEFA.\n___\nCAN ANYONE BE FIFA PRESIDENT?\nA recent FIFA rule states that would-be candidates must have an active role in soccer for two of the past five years.\nBut International Olympic Committee President Thomas Bach called for a \"credible external presidential candidate.\" Some IOC officials have suggested a figure like former U.N. Secretary-General Kofi Annan could be a possibility for the presidency.\n___\nRob Harris can be followed at www.twitter.com/RobHarris and www.facebook.com/RobHarrisReports\nCopyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-09T05:13:40.173+03:00", "highlightTitle": ""}