{"organizations": [], "uuid": "9fdce4132166e811c2414ae37bcbe8e8624eb212", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/punjab/consultations-over-sonia-to-take-call-after-meeting-capt/147425.html", "country": "US", "title": "Consultations over, Sonia to take call after meeting Capt", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "Consultations over, Sonia to take call after meeting Capt", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "9fdce4132166e811c2414ae37bcbe8e8624eb212"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/punjab/consultations-over-sonia-to-take-call-after-meeting-capt/147425.html", "ord_in_thread": 0, "title": "Consultations over, Sonia to take call after meeting Capt", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Aditi Tandon\nTribune News Service\nNew Delhi, October 17\nThe Congress is inching closer to the resolution of Punjab leadership crisis with consultations on the issue nearly over and the ball resting in party president Sonia Gandhi’s court. The process of discussions with stakeholders on the matter was led by Congress vice-president Rahul Gandhi, who undertook “the widest possible consultation” to find a way forward on the issue that has been troubling the party for almost a year now. After meeting Congress MLAs from Punjab, district party presidents and party leaders in the four major municipal corporations of the state, Rahul today held elaborate discussions on the matter with Congress general secretary and in charge of party’s Punjab affairs Shakeel Ahmad, who said the “discussion was on”. The Tribune has, meanwhile, learnt that Rahul had indicated his mind on the reorganisation to Sonia Gandhi, who is likely to take a call on the matter after meeting former Punjab Chief Minister Captain Amarinder Singh. Amarinder has been leading the call for the replacement of incumbent Punjab Pradesh Congress Committee chief Partap Singh Bajwa. Sources said the Congress leadership was pondering over Amarinder’s role and whether to name him the state party president or the campaign committee chief. Party sources said majority of the MLAs were with Amarinder. However, MLAs alone did not make up the party in Punjab. “The party is made up of district chiefs and also municipal leaders. There is no doubt Captain Amarinder Singh will have a major role in the reorganised Punjab Congress,” said a source. Although a section of Punjab leaders who met Rahul are learnt to have argued that Amarinder enjoyed the support of the Hindu community, some others have argued otherwise. One section of Punjab leaders has reportedly told the party leadership that Amarinder could not have registered a win in the Amritsar Lok Sabha segment without the support of Hindu voters, who should have ideally voted for his rival and BJP leader Arun Jaitley. The Congress is equally aware of the possibility of Amarinder quitting the party if he is given a role where he will not have much power in the strategy formulation for the 2017 elections and ticket distribution. Amarinder has been privately arguing that if the party expects him to deliver in the Assembly elections, it should give him powers to design strategy also. It, however, remains to be seen how the Congress would respond to the challenge of balancing its electoral interest in Punjab with the larger interest of keeping all factions happy.", "external_links": [], "published": "2015-10-18T03:00:00.000+03:00", "crawled": "2015-10-18T04:05:17.014+03:00", "highlightTitle": ""}