{"organizations": ["NFL", "Jacksonville Jaguars", "AP", "Wembley"], "uuid": "ae7faad64d8564e7d0273003eeafe56dc4df5cd7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fox23.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/22/88/88/decc44cdfece478d820723df034e59c7-7a7d55ab17314b768b025944a6dd8da1-0.jpg", "site_section": "http://www.fox23.com/list/rss/ap/sports-update/ak5/", "section_title": "Sports Update", "url": "http://www.fox23.com/ap/ap/sports/nfl-extends-deal-to-play-games-at-wembley-through-/nn7jy/", "country": "US", "title": "NFL extends deal to play games at Wembley through 2020", "performance_score": 0, "site": "fox23.com", "participants_count": 0, "title_full": "NFL extends deal to play games at Wembley through 2020", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T18:35:00.000+03:00", "replies_count": 0, "uuid": "ae7faad64d8564e7d0273003eeafe56dc4df5cd7"}, "author": "", "url": "http://www.fox23.com/ap/ap/sports/nfl-extends-deal-to-play-games-at-wembley-through-/nn7jy/", "ord_in_thread": 0, "title": "NFL extends deal to play games at Wembley through 2020", "locations": ["England", "LONDON", "London", "Wembley"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Dunham", "Marcell Dareus", "EJ Manuel", "Ron Brooks", "Stefan Charles"], "text": "Updated: 10:36 a.m. Thursday, Oct. 22, 2015 | Posted: 10:35 a.m. Thursday, Oct. 22, 2015 NFL extends deal to play games at Wembley through 2020 ﻿ View Larger Buffalo Bills defensive tackle Marcell Dareus, center, cornerback Ron Brooks, left, and defensive tackle Stefan Charles, right, walk off the field at the end of an NFL training session at the Grove Hotel in Chandler's Cross, England, Thursday, Oct. 22, 2015. The Buffalo Bills play the Jacksonville Jaguars at Wembley stadium in London on Sunday in a regular season NFL game. (AP Photo/Matt Dunham) View Larger Buffalo Bills quarterback EJ Manuel smiles during a press conference after an NFL training session at the Grove Hotel in Chandler's Cross, England, Thursday, Oct. 22, 2015. The Buffalo Bills play the Jacksonville Jaguars at Wembley stadium in London on Sunday in a regular season NFL game. (AP Photo/Matt Dunham) Sponsored Links   LONDON — \nThe NFL extended its agreement with Wembley Stadium on Thursday for another five years, meaning the league will play at least two regular-season games a year at the London venue through 2020. \nThe Jacksonville Jaguars will continue to play at Wembley every year throughout the agreement. \nThe NFL also has an option to extend the Wembley deal for an extra five years beyond 2020. \nThe league has played regular-season games at Wembley every year since 2007, and is playing three games in London this year for the second straight season. \nThe new deal was announced ahead of Sunday's game between the Jaguars and Buffalo Bills. \nEarlier this year, the NFL announced a separate deal to play at least two games a season over a 10-year period at Premier League club Tottenham's new stadium, scheduled to open in 2018. \n\"These agreements reiterate the NFL's commitment to the UK, with two stadium deals running concurrently,\" said Mark Waller, executive vice president of NFL International. \"To be playing in Wembley, the national stadium, and at Tottenham, in what will be London's newest stadium, is fantastic.\" \nThe Jaguars are in the third year of a four-year deal to play one home game at Wembley per year. \nJaguars owner Shad Khan said the extension of the deal until 2020 \"is great news for the Jaguars and the stability of the team in Jacksonville, which has come to embrace London as our home away from home.\" \nNFL owners recently approved a resolution to continue playing international regular-season games abroad through 2025, including possibly in Mexico, Germany and Canada. Copyright   Sign up for our FOX23 News This Morning Newsletter Sign Up", "external_links": [], "published": "2015-10-22T18:35:00.000+03:00", "crawled": "2015-10-23T10:26:13.176+03:00", "highlightTitle": ""}