{"organizations": [], "uuid": "5756a496344b915b3c01b7f4bcc118032070023f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dnaindia.com", "main_image": "http://static.dnaindia.com/images/2015/dna-logo-shared.jpg", "site_section": "http://www.dnaindia.com/", "section_title": "DNA India | Latest News, Live Breaking News on India, Politics, World, Business, Sports, Bollywood", "url": "http://www.dnaindia.com/analysis/editorial-dnaedit-modern-slavery-2133462", "country": "SG", "title": "#dnaEdit: Modern slavery", "performance_score": 0, "site": "dnaindia.com", "participants_count": 1, "title_full": "#dnaEdit: Modern slavery | Latest News & Updates at Daily News & Analysis", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T14:40:00.000+03:00", "replies_count": 0, "uuid": "5756a496344b915b3c01b7f4bcc118032070023f"}, "author": "dna     | From the print edition", "url": "http://www.dnaindia.com/analysis/editorial-dnaedit-modern-slavery-2133462", "ord_in_thread": 0, "title": "#dnaEdit: Modern slavery", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The brutal treatment meted out to an Indian woman working as a domestic help in Saudi Arabia by her employer once again reveals the inhuman conditions under which unskilled Indian workers are living in many Arab countries. It is however heartening that the external affairs ministry has taken note of the incident and demanded stern action from the Saudi government. According to media reports, 50-year-old Kasturi’s employer flew into a rage and cut off her arm after she complained of the heavy workload and torture and demanded her salary arrears. Her employer, a woman, appears to have been placed under arrest but it is incumbent upon the Indian embassy in Riyadh that the case is monitored to its logical conclusion to ensure that the employer receives a stiff jail term.\nFor years now, cases of torture inflicted on domestic maids by their employers have been reported from Saudi Arabia. In recent times, the country did appear to be in the process of redeeming this terrible state of affairs as was evident from the labour pact it inked last year with India and Sri Lanka, their largest contributor of female domestic help. The agreement entitled domestic workers to eight hours of respite between daily shifts, weekly offs, bank accounts to deposit paychecks, the right to retain their own passports. The agreement also laid down penalties for corrupt recruiting agents. But agreements between governments do not automatically translate into better working relationships between employers and employees, as has been yet again been proven in the Kasturi case.\nA primary contributing factor to such cruel exploitation of vulnerable human beings is the culture that prevails in countries like Saudi Arabia, making it difficult to distinguish between the violence executed by the State and its guilty citizens. Arguably, many Saudis have imbibed the culture of sadistic retributive punishments ordained by the State like beheading, chopping of hands, and whipping. Having abolished slavery as late as 1960s, Saudi Arabia still seems to be in the grip of repressive feudal culture. For India, which is trying to live down the implications of having to let go a Saudi diplomat who allegedly subjected two Nepalese domestic helps to gang-rape and torture, Kasturi’s traumatic experience is a wake-up call to secure the lives of thousands of emigrant domestic maids and other workers.\nIt is on the basis of assurances of safety given by recruiting agents that women and men embark on this uncertain journey and come to live with unknown employers, far from home. Though contracts are executed between domestic workers and their employers before their departure, a different exploitative power equation governs that relationship once the employee starts living at the employer’s residence. There have been suggestions that domestic workers should not be sent to countries like Saudi Arabia which have a weak legal system and poor human rights record. But for developing countries, the remittances from these workers are a crucial — and often — the only source of livelihood.\nOver the years, the Overseas Indian ministry has improved its safety provisions for overseas workers. In a controversial move, it has banned women under 30 from taking up jobs as domestic workers, besides prescribing minimum wages, implementing an emigration clearance system to vet contracts, setting up offices of Protector of Emigrants in more Indian cities as well as a registration mechanism for recruiting agents. Yet, none of this has helped domestic workers in distress in receiving timely help. It is true that the sheer numbers of Indian workers who are in West Asia as well as the limitations imposed by foreign jurisdiction, do pose logistical challenges for our missions in these countries. But a mechanism has to be found to ensure safety for Indian workers abroad. Perhaps, tough action at home against corrupt recruiting agents will go some way in ensuring that they too are made accountable for the condition of the workers they send abroad.", "external_links": [], "published": "2015-10-12T14:40:00.000+03:00", "crawled": "2015-10-12T04:23:20.474+03:00", "highlightTitle": ""}