{"organizations": [], "uuid": "978983742e79d3094bb62c83095e1c41f50f721d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "http://images.tribuneindia.com/cms/gall_content/2015/10/2015_10$largeimg13_Tuesday_2015_104907652.jpg", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/nation/jagan-s-on-fast-for-6-days-health-deteriorates-hospitalised/145446.html", "country": "US", "title": "Jagan's, on fast for 6 days, health deteriorates; hospitalised", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "Jagan's, on fast for 6 days, health deteriorates; hospitalised", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "978983742e79d3094bb62c83095e1c41f50f721d"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/nation/jagan-s-on-fast-for-6-days-health-deteriorates-hospitalised/145446.html", "ord_in_thread": 0, "title": "Jagan's, on fast for 6 days, health deteriorates; hospitalised", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Guntur, October 13\nYSR Congress president Y S Jaganmohan Reddy, who began an indefinite fast six days ago seeking special status to Andhra Pradesh, was today forcibly admitted to a government hospital here following concerns over his worsening health condition.\nA team of policemen led by ASP Bhaskarrao shifted Jagan from his fasting camp at Nallapadu to the Guntur Government hospital (GGH) here in an ambulance around 4.30 AM amid a large number of YSRCP supporters and volunteers trying to prevent the cops from moving their leader out of the area.\nDoctors, who monitored Jagan's health condition said that the ketones in his body have risen, which may lead to kidney-related problems, besides various complications. Other health parameters too were worrisome.\nDoctors treating him at the hospital also suggested that Jagan take a liquid diet to improve his condition though he wanted to continue with his hunger strike. They administered him fluids intravenously. The Leader of Opposition in AP Assembly has been kept under observation.\nSpeaking to mediamen after Jagan's hospitalisation, his sister Sharmila alleged that CM Chandrababu Naidu made the 42-year-old leader break his fast as Prime Minister Narendra Modi was visiting the state on October 22 to lay the foundation stone for the state's new capital Amaravati.\nMeanwhile, YSRCP leader Botsa Satyanarayana lauded Jagan's determination to fight for people of Andhra Pradesh and said that the party would chalk out its next course of action towards achieving special category status to the state.\nThe promise of special category status was made to Seemandhra (new Andhra Pradesh) by the then Prime Minister Manmohan Singh in Parliament during bifurcation of Andhra Pradesh last year.\nYSR Congress, Congress, Left parties have been hitting out at the TDP-BJP combine for not granting special status even one year after coming to power.\nThe NDA government has asked NITI Aayog Vice Chairman Arvind Panagariya to go into the issue. —PTI", "external_links": [], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T11:28:37.123+03:00", "highlightTitle": ""}