{"organizations": [], "uuid": "612e87b037b6c9cb2505703d457e84bebeafece0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.abqjournal.com", "main_image": "http://main.abqjournal.netdna-cdn.com/wp-content/plugins/journal-open-graph/img/albuquerque-journal.jpg", "site_section": "http://www.abqjournal.com/", "section_title": "Albuquerque and New Mexico News, Sports, Business and more | Albuquerque Journal News", "url": "http://www.abqjournal.com/656303/opinion/progun-lobby-akin-to-terrorism.html", "country": "US", "title": "Pro-gun lobby akin to terrorism", "performance_score": 0, "site": "abqjournal.com", "participants_count": 4, "title_full": "Pro-gun lobby akin to terrorism | Albuquerque Journal News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T08:02:00.000+03:00", "replies_count": 4, "uuid": "8ff95b510fb3cd82aad44058da49aaf9ca742e98"}, "author": "Miranda Viscoli / Board Member, New Mexicans To Prevent Gun Violence", "url": "http://www.abqjournal.com/656303/opinion/progun-lobby-akin-to-terrorism.html#post-0", "ord_in_thread": 0, "title": "Pro-gun lobby akin to terrorism", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "On Oct. 1, a young man armed with three handguns, a long gun and several magazines entered a classroom at a community college in Oregon, lined students up based on their religious beliefs and shot them.\nIronically at the very same hour that he was executing students, members of New Mexicans to Prevent Gun Violence were in a classroom with 20 students discussing how they would like to participate in the Oct. 21st Student Pledge Against Gun Violence.\nThe students decided to collect shoes that would represent the 20 children under the age of 17 that have been shot and killed in New Mexico since last year’s pledge. They will make paper cutouts of the things these children loved to do – a football, ice skates, a skateboard, etc. The students plan to lay the shoes and cut-outs in the shape of a heart on the gym floor.\nTwo days earlier, New Mexicans to Prevent Gun Violence members were working with a group of students from another New Mexican school during their lunch hour. They cut out and painted life-size cardboard bodies to represent the children killed by firearms in New Mexico.\nThey will present these statues in an all-school assembly that they themselves have organized. When New Mexicans to Prevent Gun Violence asked this class of 28 how many of them knew someone who had been shot, over half of them raised their hands.\nThis month, students and teachers in New Mexico are practicing songs in their choirs, creating art and discussing the issue of gun violence as part of this year’s pledge.\nAfter the most recent shooting, it is difficult not to feel like all of this is the ultimate exercise in futility. It is doubtful that meaningful change will occur because of the Oregon shooting. The parents of 10 people will join the club no parent ever wants to be a part of – a club that grows almost weekly in our country. The only members allowed are those who have lost a child in a mass shooting.\nThe corporate gun lobby and the NRA will use the Oregon shooting as an opportunity to sell more guns as they did after Sandy Hook. They will manipulate the horrific execution of these students as the means by which to further their agenda to allow guns on every campus in our country.\nThey will continue to try to convince Americans that if they don’t want to be shot, they need to be armed and loaded everywhere they go – arguing that true safety only exists with a gun on your hip. They will persist in trying to pass laws that make every corner of our country a “gun zone,” be it on college campuses, churches, movie theaters, bars, even kindergartens.\nAs we continue down this path of gun violence, parents who can afford it will look into getting their children into colleges abroad. We will visit movie theaters less and less. Some of us will think twice before we go to church. Our trust in our neighbors will erode and we will live in fear everywhere we go.\nSounds like terrorism to me.\nPresident Obama courageously used Great Britain and Australia as examples of what other advanced nations have done after mass shootings. They simply got rid of the guns. Not us – we buy more.\nIf we really want to see change, then we need to heed his advice. Refuse to vote for politicians that vote against gun violence prevention laws. Be present, be loud and be clear that you are not OK with the fact that 32,000 people a year are killed by firearms, over 80,000 are injured and that every three hours a child is killed by a gun in our country.", "external_links": [], "published": "2015-10-08T08:02:00.000+03:00", "crawled": "2015-10-08T18:16:59.507+03:00", "highlightTitle": ""}