{"organizations": ["Suns", "Jazz Len", "AP Image"], "uuid": "962d08be86927312051c5e9d76aa770ef330c473", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.beaumontenterprise.com", "main_image": "http://ww4.hdnux.com/photos/41/34/54/8768319/3/rawImage.jpg", "site_section": "http://www.beaumontenterprise.com/sports/basketball/collectionRss/Sports-Basketball-Heds-7404.php", "section_title": "Sports Basketball Heds", "url": "http://www.beaumontenterprise.com/sports/article/Len-Morris-lead-Suns-to-101-85-preseason-win-6562890.php", "country": "US", "title": "Len, Morris lead Suns to 101-85 preseason win over Jazz", "performance_score": 0, "site": "beaumontenterprise.com", "participants_count": 0, "title_full": "Len, Morris lead Suns to 101-85 preseason win over Jazz", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T07:30:00.000+03:00", "replies_count": 0, "uuid": "962d08be86927312051c5e9d76aa770ef330c473"}, "author": "", "url": "http://www.beaumontenterprise.com/sports/article/Len-Morris-lead-Suns-to-101-85-preseason-win-6562890.php", "ord_in_thread": 0, "title": "Len, Morris lead Suns to 101-85 preseason win over Jazz", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Len", "Morris", "Ross D. Franklin"], "text": "Len, Morris lead Suns to 101-85 preseason win over Jazz Updated 11:36 pm, Friday, October 9, 2015 Photo: Ross D. Franklin, AP Image 1 of / 6 Close Image 1 of 6 \nPhoenix Suns' Markieff Morris, right, gets past Utah Jazz's Rudy Gobert (27), of France, for a basket during the first half of an NBA preseason basketball game Friday, Oct. 9, 2015, in Phoenix. Photo: Ross D. Franklin, AP Phoenix Suns' Markieff Morris, right, gets past Utah Jazz's Rudy... Image 2 of 6 \nUtah Jazz's Derrick Favors (15) goes in for a reverse dunk against the Phoenix Suns as teammate Rudy Gobert, of France, watches during the first half of an NBA preseason basketball game Friday, Oct. 9, 2015, in Phoenix. Photo: Ross D. Franklin, AP Utah Jazz's Derrick Favors (15) goes in for a reverse dunk against... Image 3 of 6 \nPhoenix Suns' Alex Len (21), of Ukraine, dunks as Utah Jazz's Jeff Withey, left, and Trey Lyles (41) watch during the first half of an NBA preseason basketball game Friday, Oct. 9, 2015, in Phoenix. Photo: Ross D. Franklin, AP Phoenix Suns' Alex Len (21), of Ukraine, dunks as Utah Jazz's Jeff... Image 4 of 6 \nUtah Jazz's Rudy Gobert, right, of France, dunks over Phoenix Suns' Cory Jefferson, left, during the first half of an NBA preseason basketball game Friday, Oct. 9, 2015, in Phoenix. Photo: Ross D. Franklin, AP Utah Jazz's Rudy Gobert, right, of France, dunks over Phoenix Suns'... Image 5 of 6 \nPhoenix Suns' Devin Booker, middle, is defended by Utah Jazz's Alec Burks, left, and Rodney Hood, right during the first half of an NBA preseason basketball game Friday, Oct. 9, 2015, in Phoenix. Photo: Ross D. Franklin, AP Phoenix Suns' Devin Booker, middle, is defended by Utah Jazz's Alec... Image 6 of 6 \nUtah Jazz head coach Quin Snyder, right, talks with Elijah Millsap during the first half of an NBA preseason basketball game against the Phoenix Suns, Friday, Oct. 9, 2015, in Phoenix. Photo: Ross D. Franklin, AP Utah Jazz head coach Quin Snyder, right, talks with Elijah Millsap... Len, Morris lead Suns to 101-85 preseason win over Jazz 1 / 6 Back to Gallery PHOENIX (AP) — Center Alex Len scored 14 of his team-high 21 points in the first half and Markieff Morris added 18 points in 16 minutes, leading the Phoenix Suns to a 101-85 win over the Utah Jazz Friday night. Gordon Hayward led Utah with 24 points, including four 3-pointers in a team-high 32 minutes. Utah led 47-45 at halftime. The Suns pulled away behind a 3-pointer from Brandon Knight late in the third quarter that gave them an 80-67 lead. JAZZ: Coach Quin Snyder said before the game he wanted to see how a bigger backcourt combination is developing, with the emphasis on how Hayward, Alec Burks and Rodney Hood played together. Burks played 23 minutes and scored six points, and Hood played 24 with eight points. SUNS: Forward Jon Leuer , who had 17 points and 13 rebounds in the Suns' preseason opener against Sacramento, didn't see action until the second half and finished with five points and five rebounds. BOOKER SUSPENDED: Jazz forward Trevor Booker will miss one regular season game without pay after the NBA suspended him for his altercation with the Los Angeles Lakers ' Roy Hibbert in a preseason game earlier this week. Booker, who played Friday and scored eight points, was punished by the league for striking Hibbert with an open hand to the head. DNP/REST: Jazz guard Trey Burke and forward Joe Ingles were given Friday night off. Burke is averaging 12.5 points, four rebounds and four assists in two preseason games. Suns starting guard Eric Bledsoe did not play Friday, rested by coach Jeff Hornacek . UP NEXT: The Jazz host the Portland Trail Blazers in their fourth preseason game on Monday night. The Suns host the Houston Rockets in their third preseason game on Tuesday night.  ", "external_links": [], "published": "2015-10-10T07:30:00.000+03:00", "crawled": "2015-10-10T07:44:27.967+03:00", "highlightTitle": ""}