{"organizations": [], "uuid": "6488bacdaec4bb520fcb2bad020e830e8cf3ebea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tigernet.com", "main_image": "http://i3.tigernet.com/stories/15/football/Kearse_Jayron_GT_700.jpg", "site_section": "http://feeds.feedburner.com/tigernet", "section_title": "TigerNet.com - Clemson Tigers Sports News", "url": "http://www.tigernet.com/story/football/Kearse-And-Tell-14167", "country": "US", "title": "Kearse And Tell", "performance_score": 0, "site": "tigernet.com", "participants_count": 0, "title_full": "Kearse And Tell", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T14:01:00.000+03:00", "replies_count": 0, "uuid": "6488bacdaec4bb520fcb2bad020e830e8cf3ebea"}, "author": "", "url": "http://www.tigernet.com/story/football/Kearse-And-Tell-14167", "ord_in_thread": 0, "title": "Kearse And Tell", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kearse"], "text": "Vance, SC View Full Profile , but he's out indefinitely with a neck injury.” \nKearse begs to differ, and he told TigerNet this week that he feels like he is one the country’s top safeties. \n“Oh yeah definitely. I definitely feel like I am one of the top safeties in the country,” Kearse said. “Put my numbers against anybody and I guarantee it will match up. No matter who it is. I've been making plays since I was a freshman and I am continuing to make plays. Nobody is playing better than me at my position and I'm doing everything I got to do to go out there and show that. If the world takes notice then they do, but like I said, if they don't, I'm still going to enjoy my time as a college football player.” \nKearse is not only solid against the pass, he has proven this season that he is also a force against the run. He proved that again last week when he continually stifled Georgia Tech’s option attack. \n“I always felt like I was a guy that could get up in the box and go out and make those big plays - those tackles behind the line of scrimmage,” he said. “But, it was about what the defense and Coach V needed me to do. If he needed me to go back and play in the middle of the field, then I can do that. This year, it has mainly been me up in the box a lot and having the opportunity to make some tackles and make some plays in the backfield and I've been stepping up and doing that. It's just whatever the team needs me to do, is what I'll do.” \nDoes he feel like he’s done enough to make the NFL scouts take notice? \n“Hopefully, I did, but if I didn't then, it is what it is,” he said. “Right now, I'm a college football player and student athlete and I'm going to enjoy my experience.” \nThis week, the Tigers will be facing a Boston College team in desperate need of a win. The Eagles have started out at 0-3 in the conference but also boast the nation’s top-ranked defense. It’s just another challenge for the focused Kearse. \n“It's good for the offense and it's good for us going up against Boston College being that they have the number one defense in the nation,” he said. “They are number one in a lot of categories. It's going to be a task for us and a task for the offense because we want to go out there and show that we are the better defense on the field. Our offense wants to go out there and show that they are a good offense and they can do it against anybody. \n“We don't want to keep it low scoring. We want to keep it low scoring as far as us on defense, but we want our offense to score and put up a lot of points. They are a good defense. We have a good offense. Our offense right now is clicking on all cylinders. We feel like we can go out there and score and we want to go out there and do our job as a defense to keep them from scoring.” \nKearse said the Eagles still run the same system they’ve seen the last two years. \n“They are a pretty similar team. A lot of running the ball. A lot of ground and pound,” he said. “Once they lull you to sleep they want to try and run play action play and beat you deep. They want to try and get you to be undisciplined. They try to play the run so much that you forget about your responsibilities as a safety or corner back. I feel like there are a lot of similarities between them and Georgia Tech.” \n“It's a challenge getting the line the right way, getting your eyes on the right thing. You can come out there on one play and they are in 21 personnel, then the next play, they are out there empty. It presents a lot of challenges on us as the defense. That's why we like this game. It challenges us and it's going to make us better for going on through the season. We are seeing all of these different formations. A lot of the trick things they do, so we get to see those things. That will just help us later on down the season and someone wants to do those same things, we already have experience with that.” \nBoston College has scored just seven points in three conference games, and Kearse said he doesn’t understand the Eagles’ struggles. \n“I really don't know what's been going wrong. They are a team that lulls you to sleep and then they get a big 40-yard bomb down the field,” he said. “When they get down there, I guess its hard for those guys to punch it in the end zone because you shrink the field and they are a run dominant team, so you just stack the box and you go man to man on the outside, so I believe that is probably one of the issues when you can't get those big chunk plays and trick plays when you're down in the tight zone.” \nAsked whether he prefers to get an interception or make a big tackle behind the line of scrimmage, Kearse allows himself the briefest of smiles before letting his true emotions show. \n“I really don't have a preference for it. Whichever play that is going to be made, I'm going to make it,” he said. “I'm going to get excited off of either one.” Rate this Story: Send Feedback to David Hood: Email | Comment", "external_links": [], "published": "2015-10-16T14:01:00.000+03:00", "crawled": "2015-10-17T09:23:45.182+03:00", "highlightTitle": ""}