{"organizations": [], "uuid": "c5656b9290ee7000ba1188cce3ded1f715a99903", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.idahostatesman.com", "main_image": "http://media.idahostatesman.com/smedia/2015/10/21/23/22/PVMbY.AuSt.36.jpeg", "site_section": "http://www.idahostatesman.com/rss/sports", "section_title": "Idahostatesman.com -- Sports", "url": "http://www.idahostatesman.com/2015/10/21/4046714/entering-rarefied-air.html", "country": "US", "title": "Rocky Mountain soccer star nears 100 career goals, keeps focus on state", "performance_score": 0, "site": "idahostatesman.com", "participants_count": 1, "title_full": "Rocky Mountain soccer star nears 100 career goals, keeps focus on state", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T08:10:00.000+03:00", "replies_count": 0, "uuid": "c5656b9290ee7000ba1188cce3ded1f715a99903"}, "author": "mlycklama@idahostatesman.com (Michael Lycklama)", "url": "http://www.idahostatesman.com/2015/10/21/4046714/entering-rarefied-air.html", "ord_in_thread": 0, "title": "Rocky Mountain soccer star nears 100 career goals, keeps focus on state", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Rocky Mountain soccer star nears 100 career goals, keeps focus on state By Michael Lycklama mlycklama@idahostatesman.com October 21, 2015 Updated 11 hours ago 2015-10-22T06:01:46Z Order a reprint of this story \nRocky Mountain senior Raimee Sherle enters the state tournament with 95 career goals and a shot to become the first 5A SIC girls player to notch 100 goals since 2010. “She’s a finisher,” Boise coach Chris Siegenthaler said. “Raimee knows how to score. She’ll do whatever it takes. ... Whether it’s up front, out wide or dropped back a bit, she still has the ability to score from wherever.” KYLE GREEN — kgreen@idahostatesman.com | Buy Photo Related Stories: \nSTATE SOCCER: TODAY THROUGH SATURDAY \nTOURNAMENT FACTS \n• There are six tournaments, 48 teams and about 900 players \n• All six championship games are Saturday at Rocky Mountain High in Meridian or Middleton High \n• Based on history, expect Treasure Valley teams to dominate this week \n\nFOLLOW ALL TOURNAMENTS AT IDAHOSTATESMAN.COM \n• Follow our Varsity Extra blog every day for scoring updates from all six tournaments. \n• Coverage also includes photo galleries, daily videos, feature stories, game recaps and stats. \nProductive four years \nRocky Mountain senior Raimee Sherle has started since her freshman campaign. But she took off as a sophomore and has harassed defenses around the Treasure Valley ever since. \nG 59 249 \nRocky Mountain senior Raimee Sherle still remains in awe of a pair of high school soccer players she watched growing up — Rocky Mountain graduate Hallie Widner, a sophomore at the University of Montana, and Centennial graduate Sofia Huerta, a pro with the Chicago Red Stars. \nBut with the records Sherle is setting, she’s developing a following of her own. And a big weekend at the 5A state tournament could vault her into another rare category. \nNo girl in the 5A Southern Idaho Conference has scored at least 100 goals in her career since 2010, when Mountain View’s Shalese Miller finished with 116 and Huerta capped her four years with 126. \nSherle (pronounced Shirley) has found the back of the net 95 times entering the state tournament, where Rocky Mountain (14-3-0) opens against Lake City (12-0-2) at 11:30 a.m. Thursday at Meridian High. She said joining a club with players like Huerta and Miller is hard to fathom. \n“That’d be crazy,” Sherle said. “Being with the Sofia Huertas ... gosh, our club idolized her. Rocky soccer, she’s legendary here. Everyone knows about her. That just doesn’t seem possible. It seems weird we’d be in the same thing.” \nA five-goal outburst over three games wouldn’t be anything new for the potent 5-foot-2 Montana commit. She owns every offensive record at Rocky Mountain, from goals (95) to assists (59) to points (249) to game-winning goals (36), leaving second place in the dust long ago. \n“She has put the scoring records at Rocky Mountain so far out of reach,” Grizzlies coach Donal Kaehler said, “that I can’t even see anybody coming into the program that will come close to one of them, let alone all of them.” \nAnd she’s set all those records while taking more of a playmaking role this season. \nTired of seeing her shadowed around the field, Kaehler opted to push Sherle back from forward into the central midfield. The Grizzlies tried that at times last season, but Kaehler made the move at the start of the season, thinking the stress of assigning a defender to follow around a midfielder would dissuade opponents. \nNo dice. Sherle said she faced a dedicated defender in about half of her games this season. \nThat attention increases to two, sometimes three, defenders when she charges for goal. And she’s notched 12 assists this fall because of it. \n“Some of the assists that she’s made, I could have been on the field and I could have put the goals away,” Kaehler said. \nSherle’s stats took a dip in her senior year to 22 goals and 18 assists entering state, down from 34 goals and 22 assists at the end of last season. That’s partly because of the new role in the midfield, but it’s largely due to her desire to win state. Kaehler said he’s had to get on her about drifting too far back into the defensive zone to win balls. \n“She’s been pulling our formation out of shape because she wants to win so badly that she is willing to give up goal scoring and all that other stuff to make sure that we win,” Kaehler said. \nWherever Sherle lines up, Boise coach Chris Siegenthaler said she makes it all look easy. He compared her to Miller in that a defense can smother her for 79 minutes, but if it forgets her for one second, she’ll pounce. \n“She’s just smooth,” Siegenthaler said. “Everything she does, it just comes naturally to her. \n“If the ball is coming to her, she doesn’t have to move or change her body to receive a certain service. She just takes it down however it needs to be taken down. One-footed, inside, outside both legs, she does what needs to be done. She doesn’t have to think about it.” \nSherle remains flattered to even be mentioned in the same breath as Huerta and Miller. But a state title is her only focus this weekend. She wouldn’t even entertain the question of if she’d rather finish her high school career with 100 goals or her first state title. \n“Oh, winning state,” she said. “Winning state, no matter what. That’d be a dream come true.” Michael Lycklama: 377-6424; Twitter: @MichaelLycklama", "external_links": [], "published": "2015-10-22T08:10:00.000+03:00", "crawled": "2015-10-22T20:29:54.056+03:00", "highlightTitle": ""}