{"organizations": [], "uuid": "55eecb254d2d91efeda084838aebf0f02dead23f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "kentuckysportsradio.com", "main_image": "http://kentuckysportsradio.com/wp-content/uploads/2015/10/behanan-with-kaitna.jpg", "site_section": "http://kentuckysportsradio.com/comments/feed/", "section_title": "Comments for Kentucky Sports Radio", "url": "http://kentuckysportsradio.com/main/the-gift-that-keeps-giving-chane-behanan-has-something-to-say/", "country": "US", "title": "Comment on The Gift that Keeps Giving: Chane Behanan has Something to Say by Roofus Howls", "performance_score": 0, "site": "kentuckysportsradio.com", "participants_count": 1, "title_full": "Comment on The Gift that Keeps Giving: Chane Behanan has Something to Say by Roofus Howls", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T14:05:00.000+03:00", "replies_count": 0, "uuid": "55eecb254d2d91efeda084838aebf0f02dead23f"}, "author": "Roofus Howls", "url": "http://kentuckysportsradio.com/main/the-gift-that-keeps-giving-chane-behanan-has-something-to-say/", "ord_in_thread": 0, "title": "Comment on The Gift that Keeps Giving: Chane Behanan has Something to Say by Roofus Howls", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted in Main | 29 Responses Indianapolis Business Journal \nWe’ve heard from many former players, but the one we’ve been waiting on has finally decided to talk. Chane Behanan posted THIS to Facebook earlier tonight. \n\nI always thought of Rick as a man that would put “respect for women” as his first priority. \nBehanan quickly followed those comments by changing his profile picture to a photo of him having a moment with the National Championship trophy, and sending a statement of firm support for Jurich and Pitino. Article written by Nick Roush \"Look upon the doughnut, and not upon the hole.\" @RoushKSR 29 responses to “The Gift that Keeps Giving: Chane Behanan has Something to Say” Chris October 20, 2015 at 10:07 pm | Permalink | Reply \nProves one thing, the English department at Louisville is as good as advertised! To Cool two be # too October 20, 2015 at 11:31 pm | Permalink \nYes, props too the U of L English Dept Sarah White October 20, 2015 at 10:09 pm | Permalink | Reply \nI was going to say the same thing – evidently he missed all of his English classes in college and possibly high school. JD October 20, 2015 at 10:12 pm | Permalink | Reply \nSomeone needs too tell Chane that too spell too incorrectly all the time is making UL look dumb too. I think you are respected too Chane, in the strip clubs….. October 20, 2015 at 10:13 pm | Permalink | Reply \nWhat a dumb bastard a21CATSfan October 20, 2015 at 10:22 pm | Permalink | Reply \nIs this the first nonanonymous public admission to what went on? He only denies going to Louisville because of these women and denies Ricky Ps involvement. I wonder if the NCAA will even talk to him? Troy October 20, 2015 at 10:26 pm | Permalink | Reply \nAn the uh South Carolina and such as the Iraq… I be well respected na wa I’m sayin’ Allison October 20, 2015 at 10:27 pm | Permalink | Reply \nOh, the grammatical errors. Someone should really encourage him to review the difference between “to” and “too.” This just in! October 20, 2015 at 10:29 pm | Permalink | Reply \nAt least Luke Handcock was said to not be involved. See what I did there? JD October 20, 2015 at 10:35 pm | Permalink \nLol, well there is some Handcock going on in this picture. JD October 20, 2015 at 10:34 pm | Permalink | Reply \nSo Chane is not denying any of these allegations, he is just saying that he didn’t come to Louisville because of these women. He came because of the bird course at UL, better known as English 101. My lord this kid is a special kind of stupid,SMH. Rixter October 20, 2015 at 11:34 pm | Permalink \nObviously, he wouldn’t come to Louisville just because of some hoes. The weed in Louisville is top-notch. Too October 20, 2015 at 10:36 pm | Permalink | Reply \nChane was tired of people responding to his previous posts with “too*” so he decided to spell two, to, and too the same way. BigBlueSkyDog October 20, 2015 at 10:37 pm | Permalink | Reply \nAndre McGee is shaping up to be the Frank Pentangeli of The Cardfather II. Chane Behanan is looking like Fredo Corleone. Chane October 20, 2015 at 10:38 pm | Permalink | Reply \nI’m in love wit’ a stripper. KevinM October 20, 2015 at 10:39 pm | Permalink | Reply \nNow that is the perfect example of a ‘Louisville Man’. Sam Sharp October 20, 2015 at 10:39 pm | Permalink | Reply \nTOO b or not TOO b. Booby Petrino October 20, 2015 at 10:40 pm | Permalink | Reply \nWow, does he have a speech writer? That was incredibly believable and well-written. John Ellis October 20, 2015 at 10:44 pm | Permalink | Reply \nMethinks he doth protest two much. Pity the kid didn’t come to UK, Cal might have straightened him out. A wasted life apparently. Chane October 20, 2015 at 10:45 pm | Permalink | Reply \nCoach P, wont u let Kat give it too you. Sloth October 20, 2015 at 10:50 pm | Permalink | Reply \nMe think Ande do all by self. Maybe Kevin Wares leg snapped cause he was “weak in the knees” That Guy October 20, 2015 at 10:59 pm | Permalink | Reply \nClearly, his gifted opportunity of a free education was wasted. Never mind he did nothing to refute the scandal, yet I counted at least 41 grammatical, mechanical, and spelling errors in his most eloquent diatribe. kdub October 20, 2015 at 11:12 pm | Permalink | Reply \nMakes me wish I was a graduate of UofL. Academics appear to be on point. Kentucky Gentleman October 20, 2015 at 11:49 pm | Permalink | Reply \nI love the “I am very respected in the city” comment, is that supposed to be a serious attempt or some kind of joke, can’t figure that one out. ok-cats-computer October 21, 2015 at 12:10 am | Permalink | Reply \nThe sad part is the reason Chane felt compelled to make this statement. There was a lot of speculation by Louisville fans on social media that Chane was one of the 5 anonymous former players that substantiated the allegations for ESPN. The Louisville fans speculated that because Chane was forced to leave Louisville under negative circumstances, he was “snitching” on the Cards. It was really ugly on Twitter. Louisville fans have really sunk to a new and disgusting low during the Cards’ most recent sex scandle. bbn4LIFE October 21, 2015 at 1:07 am | Permalink | Reply \nDumbass thug is all he is. Illiterate dumb shit who has smoked his brain retarded. It’s sad. AzubuikeandFitch October 21, 2015 at 1:32 am | Permalink | Reply \nThis is your brain, and this is your brain on drugs. Jason October 21, 2015 at 1:56 am | Permalink | Reply \nAh…Good ole Chane Bohannan as Clark Kellogg would say. KT October 21, 2015 at 2:07 am | Permalink | Reply \nI don’t condone no English stuff. Coach P preach ball no books. \nWow. Was Chane a graduate school player for them? Post Comment - New and Improved (not really, it just works now)", "external_links": [], "published": "2015-10-21T14:05:00.000+03:00", "crawled": "2015-10-21T14:26:24.889+03:00", "highlightTitle": ""}