{"organizations": [], "uuid": "bfd365ae3af25de791badfc862d79867fba51054", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "http://s3.reutersmedia.net/resources/r/?m=02&d=20151023&t=2&i=1089175775&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB9M0F6", "site_section": "http://mf.feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "http://uk.reuters.com/article/2015/10/23/uk-golf-european-idUKKCN0SH10W20151023?feedType=RSS&feedName=sportsNews", "country": "US", "title": "Rose blossoms as Poulter lurks in Hong Kong", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "Rose blossoms as Poulter lurks in Hong Kong", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T13:26:00.000+03:00", "replies_count": 0, "uuid": "bfd365ae3af25de791badfc862d79867fba51054"}, "author": "", "url": "http://uk.reuters.com/article/2015/10/23/uk-golf-european-idUKKCN0SH10W20151023?feedType=RSS&feedName=sportsNews", "ord_in_thread": 0, "title": "Rose blossoms as Poulter lurks in Hong Kong", "locations": ["Hong Kong", "Hong Kong HONG KONG", "England", "Hong Kong Rose", "China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Poulter", "Justin Rose"], "text": "Rose blossoms as Poulter lurks in Hong Kong HONG KONG Justin Rose of England reacts after making his birdie putt on the 10th hole during the first day of the Hong Kong Open golf tournament in Hong Kong, China October 22, 2015. Reuters/Tyrone Siu \nHONG KONG England's Justin Rose fired a four-under-par 66 to grab the halfway lead at the co-sanctioned Hong Kong Open on Friday with past champion and late arrival Ian Poulter well placed in the chasing pack. \nWorld number seven Rose, who missed the cut on his one previous appearance at Fanling in 2011, overcame his first bogey of the week to fire five birdies and post a nine-under tally of 131 at the European and Asian Tour event. \nThe 2013 U.S. Open champion was one clear of in-form Dane Lucas Bjerregaard, who has three top 10 finishes in the last month and also shot a 66 on Friday. \nJoint overnight leader Lu Wei-chih of Taiwan was in a share of third after a second-round 69 left him tied with Englishman Poulter on seven-under. \nRose was wary of his compatriot, who was a last minute entry for the tournament, fell outside of the top 50 in the world rankings on Sunday and needed to play another European Tour event to preserve his membership for next year. \n\"Poulter is a past champion is and he's on the leaderboard,\" Rose said of the 2010 champion. \n\"He's always good when he's got something to prove, and he's probably a dangerous guy now that he's outside the top 50 in the world, and I know that he'll be desperate to get back in it. \n\"He always plays well when he has motivation, so he's obviously going to be tough to beat too.\" \nPoulter completed a mad dash from Florida on Wednesday after 2002 U.S. PGA Champion Rich Beem gave up his place in the field. \nThe Englishman showed no ill-effects of the long journey, lack of practice and absence of his usual caddie to fire a 66. \n\"I know this golf course. I've shot 60 around here before,\" said Poulter, 12-times a winner on the European Tour. \n\"So albeit that I had not played a practice round but I've got good memories on this golf course. I've had a couple of top fives in the last five years around here as well. So I know the place, I like it, and hopefully I can have a good weekend.\" \nIndia's Anirban Lahiri was at six-under after a second 67 left him tied fifth alongside 2009 U.S. PGA Champion Yang Yong-eun (66), British Masters winner Matthew Fitzpatrick (67), Australian Nathan Holman (66) and England's Matt Ford (65). \nIt wasn't such a good day for world number eight Dustin Johnson, who could only muster a two-over 74 which left the American at one-over and outside the cut mark.", "external_links": [], "published": "2015-10-23T13:26:00.000+03:00", "crawled": "2015-10-23T13:51:17.477+03:00", "highlightTitle": ""}