{"organizations": [], "uuid": "d5fa8a354541cdc1769af25e9a17c15e79fe553c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tigernet.com", "main_image": "http://i3.tigernet.com/stories/15/football/Tiger_Cub_700.jpg", "site_section": "http://feeds.feedburner.com/tigernet", "section_title": "TigerNet.com - Clemson Tigers Sports News", "url": "http://www.tigernet.com/story/football/Pigskin-Prophet-Fan-Grief-Edition-14192", "country": "US", "title": "Pigskin Prophet: Fan Grief Edition", "performance_score": 0, "site": "tigernet.com", "participants_count": 0, "title_full": "Pigskin Prophet: Fan Grief Edition", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T02:01:00.000+03:00", "replies_count": 0, "uuid": "d5fa8a354541cdc1769af25e9a17c15e79fe553c"}, "author": "", "url": "http://www.tigernet.com/story/football/Pigskin-Prophet-Fan-Grief-Edition-14192", "ord_in_thread": 0, "title": "Pigskin Prophet: Fan Grief Edition", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Pigskin Prophet: Fan Grief Edition by Pigskin Prophet - Contributor - Thursday, October 22, 2015 7:01 PM | \nThe sobbing Michigan fan will live on in infamy. \nIn case you missed it – I know you didn’t – Michigan lost to Michigan St. last weekend in somewhat spectacular fashion. The Wolverines needed to just punt the ball away and maybe play defense for one play. Instead, they lined up gunners on the outside even though Michigan St. was rushing 11 (who can figure that one out?), the Aussie punter flubbed the snap and the rest is history. \nThat caused one Michigan fan to sob – openly and unashamedly – after the game. He joins the ranks of Pig Girl at Arkansas, who sang to her broken quarterback, as perfect examples of fans who crack under the stress of a loss. The polar opposite – the guy at NC State who pulled off his shirt and danced on a pole after the Pack defeated Florida St. \nBecause I live in the wonderful state of South Carolina, it made me decide to open up a College Football Grief Counseling Service. I can help people who have to live on the precipice of grief and exhilaration, sometimes all within a few seconds. There are a lot of South Carolina fans in this state – it should be a booming business. \nNow onto the picks, and remember blah blah fun blah Crump blah blah feelings. \nTHURSDAY \nCAL AT UCLA \nUCLA just isn’t the same joint (lol) it was when Snoop Dogg’s son was on the team and that’s the straight dope (snicker). This team just doesn’t play well outside of the hash (snicker). Even my cousin Mary Jane (haha) refuses to watch them. Their season has hit a bump in the road with a resounding bong (lol) sound. And I’m not just stirring the pot (snicker). They flax (yet another one) their muscles and knock off Cal to keep their season’s hopes alive. UCLA 34, CAL 30 \nSATURDAY \nCLEMSON AT MIAMI \nThe Tigers travel down to the land of Crockett and Tubbs for a date with a Hurricane. The last time Clemson danced with a Hurricane, it defeated Notre Dame in a driving rainstorm. The weather for this matchup is supposed to be hot and steamy – kind of like a Miami football or Louisville basketball recruiting gala – but it won’t matter for the hungry Tigers. This one is close, closer than Clemson fans would like, but the forecasted Hurricane warning turns into a light squall – as in their fans squall as they leave the stadium. CLEMSON 30, MIAMI 24 \nNC STATE AT WAKE FOREST \nI really, really wish I could give you a reason to watch this game. It’s at Wake Forest – which has almost as many fans as Miami (give or take 7,000). I’m not sure that ole Mike Hogewood could get excited about this tilt. PACK 20, WAKE 17 \nNORTHWESTERN AT NEBRASKA \nThis game intrigues me because Nebraska is another fan base that has lost in excruitating ways this season and their fans could use my services. Sure, Northwestern was hot early and beat Duke and Stanford, but they’ve come back to earth in recent weeks and a trip to the cornfields isn’t what they need. Husker nation rises up as one ear of corn and shucks the Wildcats. NEBRASKA 23, NORTHWESTERN 17 \nAUBURN AT ARKANSAS \nHow bout those Tigers? Just when you thought they were left for dead, they switch quarterbacks and look decent in beating an overrated Kentucky team. Arkansas was ranked high early in the season – only because their coach talks big but can’t back it up and they are in the SEC West. However, this week’s game presents Auburn with a matchup they aren’t suited for – Arkansas can throw the football and Auburn can’t cover or tackle. Guschoke and Company take a step back in Wal-Mart, and there will need to be a cleanup in Aisle 3. WAL-MART 28, ALLBARN 26 \nTENNESSEE AT ALABAMA \nI really thought Bama had a chance to be upset last week at Texas A&M, but not even Myles Garrett and the kissing cadets and Reveille could stand in the way of three pick-sixes. The Bama defense is playing pretty well right now, even against the spread teams, and they take on Butch Jones and his mercurical hillbillies this week. The hillbillies get stampeded by the elephants. BAMMER 35, VOLS 23 \nTEXAS A&M AT OLE MISS \nTHESE ARE THE TWO BEST TEAMS IN THE COUNTRY!! I AM LEE CORSO AND I APPROVE THIS MESSAGE!!! Actually, they aren’t the two best teams, they’re just good teams with flaws like everybody else. The good news for Ole Mess is that the loss to Memphis last week didn’t matter when it comes to the SEC, while the Aggies are reeling from on old-fashioned curb stomp at the hands of Little Nicky. The difference in this game is that the Rebs are playing at home (everybody gets a job!!) and there are too many hotties and toddies for the Aggies to overcome. And too much Swag. Mama Nkemdeche celebrates. OLE MESS 38, AGGIES 26 \nDUKE AT VIRGINIA TECH \nThese are the people who rattle keys and eating turkey legs and think that a turkey gobble is a frightening sound. They get a chance at Coastal front-runner Duke this weekend in a crucial matchup – for the Blue Devils. Duke has had a few weeks to prepare for the Hokies, but the Hokies have a fighting chance in this one because their quarterback is Michael Brewer, who isn’t 6-7 andohmygoshthebestlookingahtleteeversaysheatherdinich. Duke is winning with defense and special teams and an offense that is very offensive, but it will be enough in this one because the Hokie D has Frank Beamer looking like a confused Mike Shashefsky. DUKE 17, VA. TECH 13 \nFLORIDA ST. AT GEORGIA TECH \nThis stinker of a matchup got a primetime slot because….well, I don’t know why. Tech is reeling – their offensive linemen have forgotten how to fall down – and Pa l Johnson looks more sour than ever. However, night games in Atlanta are always tricky – and we don’t mean the girls on the corners outside of fraternity row – and Tech managed to grind its way to 376 yards on the ground last week. Tech’s defense thrives off turnovers, but the only turnover at Florida St. has been in the university police department (snicker, snicker). The Noles grind out another win, but it ain’t easy. FSU 33, TECH 27 \nOPEN DATE AT SOUTH CAROLINA \nFunny story – South Carolina fans joked about Dabo Swinney dancing and we heard “we don’t do that in the SEC.” Then their interim head coach danced after beating mighty Vanderbilt last week (snicker, snicker) and we heard that he needs to quit because “we don’t do that in the SEC.” Then I saw NFL coaches dancing on Sunday, and I tweeted out that they don’t do that in the SEC. They don’t play much defense in the SEC, either. Nor do their coaches stick around when it gets tough. OPEN DATE 34, DANCERS 28 \nUTAH AT THE REAL USC \nHow about those Utes? They keep finding a way to win, and Kyle Whittingham is hotter than a South Carolina fan watching another fourth quarter lead slip away. Can the Utes keep up their winning ways against a Southern Cal team that needs a win in the worst way. The Trojans have been leaky (snicker) on defense and haven’t been stiff enough on offense. The trend continues – Utah puts a hole in the Trojans. UTAH 31, SOCAL 27 \nUTSA VS OPEN DATE", "external_links": [], "published": "2015-10-23T02:01:00.000+03:00", "crawled": "2015-10-23T09:52:06.593+03:00", "highlightTitle": ""}