{"organizations": [], "uuid": "46f2244f6e9215ec3e5df9bd46db3a5e51a782ec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/4a3a320a2489c25d9f606301ff43eca0.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/football/ayre-klopp-will-have-final-say-on-adding-exreds-to-backroo/6912417/", "country": "JE", "title": "Ayre: Klopp will have final say on adding ex-Reds to backroom staff", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "Ayre: Klopp will have final say on adding ex-Reds to backroom staff", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T15:01:00.000+03:00", "replies_count": 0, "uuid": "46f2244f6e9215ec3e5df9bd46db3a5e51a782ec"}, "author": "", "url": "http://www.sport.co.uk/football/ayre-klopp-will-have-final-say-on-adding-exreds-to-backroo/6912417/", "ord_in_thread": 0, "title": "Ayre: Klopp will have final say on adding ex-Reds to backroom staff", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Klopp"], "text": "Ayre: Klopp will have final say on adding ex-Reds to backroom staff 09 Oct 2015 12:01:52 \ncomments \nLiverpool chief executive Ian Ayre will let new manager Jurgen Klopp decide whether to bring in any former Reds players to help bridge a gap to the club's gloried past. \nThe German's arrival on Merseyside saw former midfielder Gary McAllister removed from his coaching position - which he had only held since the summer - on Thursday and moved into an ambassadorial role. \nThere has already been speculation about whether Jamie Carragher could be persuaded to ditch his television commitments to return to Anfield, or whether ex-captain Steven Gerrard would be enticed back from LA Galaxy. Former Germany midfielder Dietmar Hamann, a Liverpool player between 1999-2006, has also had his name mentioned. \nKlopp, a man who appreciates Liverpool's rich history, will have the final say. \n\"Those decisions will be Jurgen's but the near future is about what we have here and what Jurgen has to work with and that is for him to assess,\" said Ayre. \n\"There were some changes (in the coaching staff) yesterday but it is about moving forward and there are no plans at this stage other than for Jurgen to get together with his staff and take it from there.\" \nThe appointment of Klopp, rated as one of the best coaches in Europe, is a major coup for owners Fenway Sports Group who moved quickly after sacking Brendan Rodgers on Sunday. \nAyre believes the 48-year-old is a perfect fit. \n\"When we started the search it was important we found someone who we believed could bring success to the club, who could take on the size, the might and the ambition of the club,\" he added. \n\"Jurgen ticks those boxes. When you spend time together, there is a connection and an understanding of the culture of this club. \n\"It was good to feel that from Jurgen that he understood the size and ambition of the club.\" Related Sport News", "external_links": [], "published": "2015-10-09T15:01:00.000+03:00", "crawled": "2015-10-09T19:51:48.562+03:00", "highlightTitle": ""}