{"organizations": [], "uuid": "9c4c40d3594e0430e26af03dfe0b96bfbee4323d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailyamerican.com", "main_image": "http://bloximages.newyork1.vip.townnews.com/dailyamerican.com/content/tncms/assets/v3/editorial/6/d9/6d91d296-7478-11e5-ae9c-93e227c7e81d/5621b55a86726.image.jpg?resize=760%2C608", "site_section": "http://www.dailyamerican.com/search/?q=&t=article&l=25&d=&d1=&d2=&s=start_time&sd=desc&c[]=sports*&f=rss", "section_title": "Daily American - sports", "url": "http://www.dailyamerican.com/sports/somerset-uses-second-half-surge-against-bm/article_4fb19388-7478-11e5-b809-43d9993e2b47.html", "country": "US", "title": "Somerset uses second-half surge against BM", "performance_score": 0, "site": "dailyamerican.com", "participants_count": 1, "title_full": "Somerset uses second-half surge against BM", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T05:39:00.000+03:00", "replies_count": 0, "uuid": "9c4c40d3594e0430e26af03dfe0b96bfbee4323d"}, "author": "CHRISTINA DUNMYER cdunmyer@dailyamerican.com", "url": "http://www.dailyamerican.com/sports/somerset-uses-second-half-surge-against-bm/article_4fb19388-7478-11e5-b809-43d9993e2b47.html", "ord_in_thread": 0, "title": "Somerset uses second-half surge against BM", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Somerset uses second-half surge against BM By CHRISTINA DUNMYER cdunmyer@dailyamerican.com dailyamerican.com | 0 comments JOHNSTOWN — A strong second half effort powered the Somerset Eagles to a 27-16 victory over host Bishop McCort Friday in Week 7 of the high school football season. The Crushers opened some big plays on the Eagles defense in the first half and really kept Somerset on its heels early. After a missed field goal on the previous possession, Somerset (6-1) finally got on the board with 1:21 left in the first quarter with a Dylan Barnes one-yard touchdown run. The Wes Reed PAT was good for a 7-0 lead. Bishop McCort (1-6) got on the board on its first possession of the second quarter. The Crushers drove from their 25 in just under three minutes to score. Anthony Walters capped the eight-play drive with a three-yard touchdown run. The Shane Steele PAT was good for a 7-7 tie with 3:45 left in the second quarter. A crazy sequence of events then ended the first half. The Crushers attempted a field goal with :07 left in the quarter. Somerset blocked the kick, recovered the ball behind the line of scrimmage and started to run down the field with it as time expired. The play was whistled dead. After a conference by the referees, the play was ruled as an inadvertent whistle and the down was replayed. The Crushers again kicked the field goal – this time it was good and they led 10-7 at the break. “We had things go the other way for us the whole season, so it was nice to see something rolling in our favor this time,” said head coach Brian Basile. “I was happy with our game plan. We had them on the ropes a little bit, but that’s a great team over there. Their skill made some big plays when it counted. Our offense moved the ball and we made a big play when we needed to. We just didn’t get the stop to start the second half like we needed to.” Somerset out gained Bishop McCort 154 yards to 38 in the third quarter. The Eagles scored on back-to-back scoring drives in the third quarter. Barnes had touchdown runs on both drives. The senior quarterback had TD runs of 37 yards and one yard. He finished with 107 yards rushing and was 7 of 11 passing for another 82 yards. “Our guys mindset was knowing what we needed to do offensively in the second half and we did it,” head coach Bob Landis said. “They broke some plays because they have some great athletes. They are getting better every week. We told our guys to just stick with the system. We did and we came out and took care of the game in the second half.” But the Crushers came right back. They countered with an 11-play scoring drive in the fourth. Walters bowled his way in from two yards out. The PAT was no good. Somerset led 20-16. Walters finished with 46 yards rushing. The Eagles answered with a five-play scoring drive capped by a five-yard rushing touchdown by Jake Heiple. The kick was good to set the final score. “We are getting better every week,” said Landis. “We are where we need to be heading into Week 8, but we head to Patton which is another tough road trip for us. Coach Lewis is doing great things up there in Cambria Heights right now.” Bishop McCort’s Carnell Andrews had 70 yards rushing. Levi Cook was 8 of 14 for 140 yards passing. The Crushers travel to Bishop Guilfoyle next Saturday.", "external_links": [], "published": "2015-10-17T05:39:00.000+03:00", "crawled": "2015-10-17T06:31:51.158+03:00", "highlightTitle": ""}