{"organizations": ["Penguins"], "uuid": "8f2b62c80d2e0a134e722846da72c940fe3f8a89", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "ca.news.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/v5Hx1CSa3mtWN0ECQ9.ivQ--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://media.zenfs.com/en_ca/News/Capress/PAGP102-1015_2015_192127_high.jpg", "site_section": "https://ca.news.yahoo.com/sports/rss/?format=rss&.tsrc=samsungwn", "section_title": "Yahoo News Canada - Sports Headlines", "url": "https://ca.news.yahoo.com/evgeni-malkin-scores-1st-goal-7-months-penguins-020400331--nhl.html?.tsrc=samsungwn", "country": "", "title": "Evgeni Malkin scores 1st goal in 7 months, Penguins beat Senators 2-0 for 1st victory", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Evgeni Malkin scores 1st goal in 7 months, Penguins beat Senators 2-0 for 1st victory", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T05:50:00.000+03:00", "replies_count": 0, "uuid": "8f2b62c80d2e0a134e722846da72c940fe3f8a89"}, "author": "", "url": "https://ca.news.yahoo.com/evgeni-malkin-scores-1st-goal-7-months-penguins-020400331--nhl.html?.tsrc=samsungwn", "ord_in_thread": 0, "title": "Evgeni Malkin scores 1st goal in 7 months, Penguins beat Senators 2-0 for 1st victory", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Evgeni Malkin"], "text": "View Photo \nOttawa Senators' Jared Cowen (2) checks Pittsburgh Penguins' Phil Kessel … PITTSBURGH, Pa. - Daniel Sprong watched the puck sail past Ottawa goaltender Craig Anderson and into the net. And for a brief second, the 18-year-old who made the Pittsburgh Penguins out of training camp with his energetic play decided to finally act his age. \nThe rookie forward raised his arms in triumph, saw the nearest pane of glass and did a vertical belly flop in celebration. \n\"I didn't know what I was going to do,\" Sprong said. \"I saw the glass close by and decided to jump on it.\" \nSprong's first NHL goal provided the emotional high point of a 2-0 win over the Senators on Thursday. Evgeni Malkin picked up his first goal in seven months and Marc-Andre Fleury stopped 22 shots for his 39th career shutout, as the Penguins put a decisive halt to the franchise's worst start in a decade. \n\"I don't think we had a full consistent game and tonight it felt really good from the start until the end,\" Fleury said. \nAnderson made 34 saves, but the Senators failed to muster significant momentum a night after dropping seven goals on Columbus. Ottawa went 0 for 3 on the power play and rarely tested Fleury over the final two periods, as the Senators lost on the road for the first time in four tries. \n\"I thought we were a little flat,\" Ottawa defenceman Marc Methot said. \"There's only so much you can do when you don't have the legs beneath you.\" \nThe Penguins came in scuffling after the franchise's worst start in a decade, managing all of three goals during an 0-3 stretch that left their stars frustrated and head coach Mike Johnston imploring them — again — to shoot the puck more often. \nFor a night anyway, the message appeared to get through. \nFresh after being given a day off and facing a team that must have gotten weary celebrating so often during a 7-3 dismantling of the Blue Jackets the night before, Pittsburgh wasted little time, playing with the kind of tempo it lacked for much of the first week of the season. \nThe Penguins sent 16 pucks at Anderson during the opening 20 minutes. None found the back of the net but the string of consistently aggressive shifts built momentum that finally crested with the team's first lead of the year. Malkin took a lead pass from Patric Hornqvist and beat Anderson with a wrist shot from just inside the right circle 23 seconds into the second period for his first goal since March 6. \n\"I not score goal in long time, obviously last season, too, I not score playoffs,\" Malkin said. \"It's a little bit pressure on myself, too. It's easy when you score and you have more confidence out there.\" \nThe Penguins' lead doubled just over two minutes later when Sprong showcased why his tryout period with the team might turn into something more permanent. The second-round pick made the club out of training and Pittsburgh has nine games to get a look at what Sprong can do before deciding whether to send him back to the junior ranks or keep him up. \nThe kid made a pretty compelling case when moved up to the third line. Sprong needed only a flick of the wrist to become the second Dutch-born player to score in an NHL game. Matt Cullen skated down the left side and centred it to Sprong, who zipped it past a sprawled Anderson. \n\"I felt he deserved to bump up a little bit tonight,\" Johnston said. \"He responded with a good working game. ... I like what I see in him, how competitive he is.\" \nFleury and a defence that kept traffic in front of him light made the advantage stand up. Ottawa's best chances came on long range blasts from the point that consistently sailed wide of the net as the Senators' early road dominance came to an abrupt halt. \n\"We didn't make the adjustment and realize, OK we're not on our game tonight,\" Ottawa coach Dave Cameron said. \"We continued to try to put the square peg in the round hole.\" \nNOTES: The Penguins recalled F Brian Rust from Wilkes-Barre/Scranton of the AHL on Thursday to replace Beau Bennett, who was scratched with an undisclosed injury. Bennett scored his first goal of the season in Tuesday's loss to Montreal. ... Pittsburgh also scratched D Rob Scuderi and F Sergei Plotnikov. ... The Senators scratched F Clarke MacArthur and D Chris Wideman. ... The Penguins host Toronto on Saturday. The Senators welcome Nashville on Saturday.  ", "external_links": [], "published": "2015-10-16T05:50:00.000+03:00", "crawled": "2015-10-16T06:26:59.376+03:00", "highlightTitle": ""}