{"organizations": [], "uuid": "7f31a2f9f3f950935fa17c0d3c06ea632dda21cf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.naharnet.com", "main_image": "http://images0.naharnet.com/images/170742/w140.jpg?1444376761", "site_section": "http://www.naharnet.com/sports", "section_title": "Naharnet — Sports", "url": "http://www.naharnet.com/stories/en/191612-challenges-facing-juergen-klopp-at-liverpool", "country": "US", "title": "Challenges Facing Juergen Klopp at Liverpool", "performance_score": 0, "site": "naharnet.com", "participants_count": 3, "title_full": "Challenges Facing Juergen Klopp at Liverpool — Naharnet", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T18:46:00.000+03:00", "replies_count": 2, "uuid": "88621f92243edaa64a9ecc810b2f709e1be8486d"}, "author": "Naharnet Newsdesk", "url": "http://www.naharnet.com/stories/en/191612-challenges-facing-juergen-klopp-at-liverpool#post-0", "ord_in_thread": 0, "title": "Challenges Facing Juergen Klopp at Liverpool", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Juergen Klopp takes over a Liverpool team in transition, in 10th place in the Premier League, and — unfortunately in the eyes of many fans — lumbered with the Europa League.\nHere's a look at the immediate challenges facing Klopp as he settles in at Anfield as the replacement for Brendan Rodgers:\nIMPOSE STYLE\nKlopp has described his preferred approach as \"heavy-metal football\" — exciting, high tempo, high pressure and relentless. It asks a lot of his players but when it comes off, it's worth all the effort.\nRodgers had a similar style in the 2013-14 season, when Liverpool almost won the Premier League title with Luis Suarez swarming over opposition defenses and at his prolific best.\nIs the current Liverpool squad capable of adapting to Klopp's philosophy? And can Klopp's approach work in the intense, exhausting English season where there is no winter break to recharge the batteries?\nFIX DEFENSE\nDefensively, Liverpool always seemed vulnerable under Rodgers, who preferred to focus more on the team's attack. That may even have cost the Reds the Premier League title in 2014.\nMartin Skrtel has been a mainstay at center back but doesn't have a reliable partner, there is no permanent fixture at left back, and Nathaniel Clyne is still settling in at right back after his offseason move from Southampton.\nMeanwhile, there hasn't been adequate protection for the defense in center midfield since the decision to abandon the experiment of playing Steven Gerrard as an anchorman. It appears Lucas Leiva no longer has the legs for the role.\nThe whole defensive structure needs firming up, whether it's through work on the training ground or maneuvers in the transfer market.\nDEFINE TARGETS\nSpeaking of the transfer market, Liverpool is still in the midst of an overhaul in the post-Gerrard era and plenty of cash should be available because of the huge TV deals associated with being in the Premier League and from the big-money departures of Luis Suarez and Raheem Sterling.\nLiverpool's transfer committee is complex, with strands incorporating an executive from Fenway Sports Group, scouts, a director of technical performance and the manager himself. And there remains an adherence to the \"Moneyball\" approach of using statistical analysis to extract maximum value.\nKlopp must be in charge here and push for his own targets, rather than get bossed around by others. Knowledge of the German leagues may come in handy, too.\nDECIDE ON FIRMINO\nAt 29 million pounds ($44 million), Roberto Firmino was Liverpool's big gamble in the transfer market over the summer and the Brazil forward has been ineffective so far in his first season in English football.\nKlopp must figure out if and/or where Firmino fits into his system, whether he and playmaker Philippe Coutinho can play in the same team, or even whether to cut Liverpool's losses with him.\nKlopp will have seen Firmino play in the German leagues for Hoffenheim and may already know if he's the type of player he wants in his team.\nSECURE STARS\nCoutinho lacks the consistency of the world's great playmakers but is the gem in Liverpool's squad and Klopp needs to get the Brazil international onside.\nAmid the unsettling atmosphere surrounding the departure of Rodgers, reports emerged that Coutinho might be attracted by offers from Barcelona or Real Madrid. That would have been a worry to Liverpool fans, considering the departures they from Anfield in recent years.\nDaniel Sturridge, England's first-choice striker when fit, may also be wondering if he needs to move on to get the most out of his career.\nKlopp cannot allow Coutinho or Sturridge to leave.\nFINGERS CROSSED\nInjuries to key players hampered Rodgers' chances of a strong start to the season.\nSturridge missed the first few games because of a hip problem hanging over from last season, then made his return just as top summer signing Christian Benteke picked up an injury. Liverpool fans have only seen the strikers start one game together — and that lasted only 45 minutes against Norwich before Benteke was replaced.\nNew captain and midfield fulcrum Jordan Henderson is also currently out with a heel injury.\nLiverpool has a decent squad, but remains reliant on its big names. They need to stay fit for Klopp to stand a chance of securing Champions League football for next season.", "external_links": [], "published": "2015-10-09T18:46:00.000+03:00", "crawled": "2015-10-09T20:31:08.239+03:00", "highlightTitle": ""}