{"organizations": ["NFL"], "uuid": "3aee4f0ef0b92487ebc6d2a3a0467562fed064c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.abc2news.com", "main_image": "http://sharing.abc2news.com/sharescnn/photo/2015/10/13/1444759732_25157498_ver1.0_640_480.jpg", "site_section": "http://www.abc2news.com/feeds/rssFeed?obfType=RSS_FEED&siteId=10009&categoryId=10004", "section_title": "Sports | WMAR", "url": "http://www.abc2news.com/newsy/nfl-stretches-copyright-reach-to-gifs-on-twitter", "country": "US", "title": "NFL stretches copyright reach Twitter GIFs", "performance_score": 0, "site": "abc2news.com", "participants_count": 0, "title_full": "NFL stretches copyright reach Twitter GIFs", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T22:01:00.000+03:00", "replies_count": 0, "uuid": "3aee4f0ef0b92487ebc6d2a3a0467562fed064c4"}, "author": "", "url": "http://www.abc2news.com/newsy/nfl-stretches-copyright-reach-to-gifs-on-twitter", "ord_in_thread": 0, "title": "NFL stretches copyright reach Twitter GIFs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jamal Andress"], "text": "NFL Stretches Copyright Reach To GIFs On Twitter Jamal Andress 3:01 PM, Oct 13, 2015 \nPhoto Credit: Getty Images / Ronald Martinez \nYou've heard it a million times: \"This telecast is copyrighted by the NFL for the private use of our audience. Any other use of this telecast or of any pictures, descriptions or accounts of the game without the NFL's consent is prohibited.\" \nThe NFL is a multibillion-dollar enterprise, but it didn't get that way by being lenient about who can use its content. \nOn Monday, Twitter accounts for Deadspin and SBNation were suspended after complaints of copyright infringement, but the accounts didn't post live video or sound from the game. Instead, the league's reach has now extended to short GIFs and Vine videos on Twitter, which the NFL considers highlights. \nAlso, the complaints didn't just come from the NFL . Twitter also received notices from the UFC and two NCAA conferences — the SEC and Big 12. \nThe NFL, like most sports leagues, has very strict guidelines to keep others from broadcasting its content, but GIFs and Vines were largely uncharted territory until Monday night. \nAccording to the NFL , it didn't \"request any Twitter account be suspended\" but rather just sent \"routine notices as part of its copyright enforcement program.\" \nEither way, the Deadspin and two SB Nation Twitter accounts were suspended, and the most recent GIFs were removed. The SBNationGIFs account was still down Tuesday morning. \nIt's hard to miss the irony in this suspension coming just weeks after Twitter inked a multiyear deal with the NFL to broadcast more content on the online platform. \nThere's no official rule about using animated GIFs and Vine videos of copyrighted sports content. While leagues argue that small clips from broadcasts are still copyright-protected, others say fair use of the material should allow outlets to post the snippets. \nNot to mention, other popular sports Twitter accounts have GIFs still playing after Monday night's suspension spree. Twitter has yet to comment on those suspensions. \nThis video includes images from Getty Images.", "external_links": [], "published": "2015-10-13T22:01:00.000+03:00", "crawled": "2015-10-13T22:43:45.447+03:00", "highlightTitle": ""}