{"organizations": [], "uuid": "b0654596b0e37a8c00553e5a5b77544f096cde67", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.lsureveille.com", "main_image": "http://bloximages.newyork1.vip.townnews.com/lsureveille.com/content/tncms/assets/v3/editorial/3/cd/3cd2e79c-6a52-11e5-86b9-fb268cb0626f/5610ae127a8fc.image.jpg", "site_section": "http://www.lsureveille.com//search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&nsa=eedition&c[]=sports,sports/*&f=rss", "section_title": "lsureveille.com - sports,sports/", "url": "http://www.lsureveille.com/daily/the-art-of-the-lsu-defensive-attack/article_d0e68c76-6c7e-11e5-96cf-8b9c4d730417.html", "country": "US", "title": "The art of the LSU defensive attack", "performance_score": 0, "site": "lsureveille.com", "participants_count": 1, "title_full": "The art of the LSU defensive attack", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T02:06:00.000+03:00", "replies_count": 0, "uuid": "b0654596b0e37a8c00553e5a5b77544f096cde67"}, "author": "kmpreveille@gmail.com(Morgan Prewitt -The Daily Reveille)", "url": "http://www.lsureveille.com/daily/the-art-of-the-lsu-defensive-attack/article_d0e68c76-6c7e-11e5-96cf-8b9c4d730417.html", "ord_in_thread": 0, "title": "The art of the LSU defensive attack", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "by Morgan Prewitt \nIn the world of backyard football, blitzing is easy. Just count to 10 Mississippi and rush the quarterback. \nBut in elite college football, the simple concept translates into a sophisticated science, balancing personnel and scheme timing to precisely attack the weakest point of an opponent’s formation. \nAlthough former LSU defensive coordinator John Chavis’ mastery of the blitz was well documented during his six years in Baton Rouge, first-year LSU defensive coordinator Kevin Steele has utilized blitzing as a complement to the Tigers’ relentless defensive line, giving the rest of the defense a chance to make plays in the backfield in 2015. \n“It’s amazing,” said junior safety Rickey Jefferson. “It gives me that thrill, like I got the quarterback, I got the quarterback. I’m looking forward to getting me some more sacks. I almost had me one, but he threw it.” \nLSU’s defensive line has ample talent to pressure the quarterback on its own, tallying 9.5 sacks and nine quarterback hurries in the Tigers’ first four games. But blitzing adds another element to the Tigers’ pass rush — speed from the outside. \n“We have a lot of athletes back there,” said junior defensive tackle Christian LaCouture. “With [sophomore safety] Jamal [Adams], Rickey [Jefferson] and when [senior safety] Jalen [Mills] gets back, they create a lot of opportunities for us to make different blitzes.” \nThroughout the Les Miles era, LSU defensive backs made a name for their ability to make plays behind the line of scrimmage in addition to what they do in coverage. \nDuring his two-year career as a Tiger, 2011 Bednarik Award Winner Tyrann Mathieu became a menace as a corner blitzer, especially out of the LSU’s nickel defense. \nAgainst the University of Kentucky on Oct. 1, 2011, Mathieu lined up on the right side of the defensive line ready to blitz. \nGiven a clear shot to Kentucky’s quarterback Maxwell Smith, Mathieu sacked Smith, forced his third fumble of the season and returned it 23 yards for a touchdown. \nFor LSU’s current starting nickelback junior Dwayne Thomas, a blitz call represents a change of pace and an opportunity to make a play. \n“Blitzing is so much fun,” Thomas said. “I can tell you one reason why — you don’t have to run and cover. But you have the opportunity to sack the quarterback and make a big play. You want to get pressure on the quarterback, just so the guys that are covering don’t have to cover for so long because it can get tiring sometimes.” \nAlthough the glory for a sack normally goes to the blitzer, Thomas stressed the importance of teamwork along the defensive line for the success of blitzes. \nIn 2014, Thomas worked side-by-side with former LSU defensive end Danielle Hunter as a blitzing cornerback, tallying 1.5 sacks in first five games before being sidelined with a season-ending knee injury. Thomas said lining up beside a respected defensive lineman helps an outside blitz because the offensive player has to account for both the lineman and the extra defender. \nThis season, the New Orleans-native established a similar chemistry with freshman defensive end Arden Key. \n“I was explaining to Key, the freshman, how me and Danielle Hunter used to do it on the line,” Thomas said. “Danielle used to pass rush, help my job become easier and make me come free. Key is starting to learn that ... It’s a fun game for us now.” \nThe speed of the linebacking corps, especially from senior linebacker Deion Jones, allows them to get a share of the action along with the corners and safeties. \nAlthough the Tigers’ energy in the pass rush usually translates into game-changing plays, sometimes the eagerness to blitz can create mistakes. Against Eastern Michigan University on Saturday, junior linebacker Kendell Beckwith’s excitement to get to the quarterback landed him an offside penalty in the third quarter. \n“It’s like an adrenaline rush almost, flying in there trying to blitz,” Beckwith said. “I actually got an offside penalty I was so ready to blitz Saturday.”", "external_links": [], "published": "2015-10-07T02:06:00.000+03:00", "crawled": "2015-10-11T19:44:52.530+03:00", "highlightTitle": ""}