{"organizations": [], "uuid": "ebf592fee0559e91b226d34dabe7287e6095df09", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/ncaabk", "section_title": "NCAA BK News, Scores, Schedule, Standings, Stats, Photos, Videos - Basketball - MSN Sports", "url": "http://www.msn.com/en-us/sports/ncaabk/it-takes-two-point-guards-to-win-it-all-in-the-ncaa/ar-BBmhS9g", "country": "US", "title": "It takes two point guards to win it all in the NCAA?", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "It takes two point guards to win it all in the NCAA?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "ebf592fee0559e91b226d34dabe7287e6095df09"}, "author": "Jaquam Bodden", "url": "http://www.msn.com/en-us/sports/ncaabk/it-takes-two-point-guards-to-win-it-all-in-the-ncaa/ar-BBmhS9g", "ord_in_thread": 0, "title": "It takes two point guards to win it all in the NCAA?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "It takes two point guards to win it all in the NCAA? The Sports Quotient 1 day ago Jaquam Bodden © John David Mercer/USA TODAY Sports North Carolina Tar Heels guard Nate Britt leads a squad that returns every player from last season and could help continue the trend of dual-threat point guards on national championship teams The 2013 Louisville Cardinals, the 2014 UConn Huskies, and the 2015 Duke Blue Devils. All three teams have two things in common: they all won the National Championship but more interestingly, all three were led by dual point guard backcourts.\nAdChoices Strong guard play is vital to succeed in college basketball. Of course you can also have one of the best wing players as well as the best big men but if you follow college basketball closely, you will know that teams aren’t successful without strong guard play. Let’s take a look at how the backcourts of the past National Championship teams fared.\n2012-13 Louisville Cardinals: Peyton Siva and Russ Smith\nThe backcourt of Russ Smith and Peyton Siva played a huge part in Louisville’s 2013 NCAA title run. Siva played more the role of ball handler and distributor while Russ Smith took on most of the scoring load as the secondary ball handler.\nIf you take a look at their per-40 minute stats during the regular season, Russ averaged 24.7 points and 3.8 assists per game and Peyton Siva averaged 13 points and 7 assists per game. Calculating combined stats, Russ Smith and Peyton Siva averaged 32.3 points per game and 5.3 assist point per game during the NCAA tournament .\n2013-14 UConn Huskies: Shabazz Napier and Ryan Boatright\nDuring the 2013-14 season, UConn was mentioned as one of the dark horses to compete for a National Championship, and if you look at their numbers during the regular season, you can easily see how they were one of the top five backcourts in the nation. Shabazz averaged 20.5ppg and 5.6 apg per 40 minutes , while Ryan Boatright averaged 14.9 ppg and 4.1 assists per 40.\nOut of all three backcourts in this article the combination of Shabazz Napier and Ryan Boatright averaged the most points and assists with 35 points per game and seven assists per game during the 2014 NCAA tournament. Heading into the Final Four, Shabazz and Ryan had the highest scoring average of all final four backcourts that year. Despite being one of the smallest backcourts in the nation that season, Boatright and Napier were also good on the defensive end as well. In the championship against Kentucky in 2014, Napier and Boatright combined for 6 steals which contributed to a good amount of Kentucky’s 13 turnovers, both players had an advantage over the much bigger backcourt of the Harrison Twins. In that game, Boatright and Napier scored 36 of Uconn’s 60 points.\nThe offense ran through Napier, and he was able to score, rebound, and dish the basketball in most games. Ryan Boatright came up huge when Shabazz struggled; in pivotal moments he scored key buckets as well as created offensive opportunities for his teammates. Napier had the championship experience while contributing to Kemba Walker’s cinderella run in 2011 while Ryan Boatright became the dependable running mate he needed. We all know players such as Deandre Daniels and Niels Giffey were also a huge part of that team but one thing is for sure if it wasn’t for Shabazz and Boatright UConn wouldn’t have won the 2014 championship .\n2014-15 Duke Blue Devils: Tyus Jones and Quinn Cook\nThe 2014-15 Duke Blue Devils were a very special team that had a few flaws but they always showed up during big games that counted. Duke was one of the best offensive teams in the country and averaged 79 points per game (sixth in the nation) and an offensive rating of 119.4 (fourth in the nation). A lot of their success on offense is owed to their dual point guard backcourt of Tyus Jones and Quinn Cook. We all know that Jahlil Okafor and Justice Winslow were a huge part of the team, but you can make an argument that Jones and Cook always delivered when running the offense through Okafor didn’t work.\nDuring the 2014-15 regular season, Tyus Jones and Quinn Cook averaged a combined 30 points per game and nine assists per 40 minutes. If you want more proof of their impact during the 2014-15 season check out how their contributions led Duke to big comeback wins vs St. John’s (Coach K’s iconic 1,000th victory), the win vs. UNCat Cameron Indoor Stadium, and the National Championship game vs. Wisconsin. Both players had the impressive ability to take over late in games. If you go back to the National Championship game vs Wisconsin, Tyus Jones hit two big three pointers which decided the game . Tyus hit his first big three pointer with four minutes remaining which gave them a 59-58 lead, he then hit his second one with 1:24 remaining in the half which was the dagger that gave Duke a 66-58 lead.\nDuring the 2015 NCAA Tournament, the backcourt of Jones and Cook averaged a combined 26.3 points per game and 5.3 assists per game, and both guards showed their ability push the temp and create opportunities for their teammates.\n———\nNow that we know about the success of past championship teams with dual point guard backcourts, the question remains: can this trend continue? The answer is yes, but it really depends on who will be starting for their respective teams this upcoming season. Here are a few potential dual point guard backcourts on some teams that have a high chance of competing for a national title in 2016. I must note that these are only guesses based on the knowledge of the current rosters and we will only know more when the season starts in November.\nKentucky: A Combination of top freshmen?\nOne of the most talented teams coming in to this season will be the Kentucky Wildcats, of course, who have a very interesting starting five. My guess is that there will be a possible dual point guard combination with two of their top three freshman Tyler Ulis, Isaiah Briscoe and Jamal Murray. This is just a guess but it’s a strong chance all three will be in the starting five. Most of the lineup will consist of Tyler Ulis at the point guard with Isaiah Briscoe as the second PG and Jamal Murray at the wing. This gives Kentucky two ball handlers in John Calipari’s dribble-drive offense. Kentucky is one team that will be in the conversation for championship contention even though they have a few new faces, but many players from their past two Final Four appearances will be returning.\nVillanova: An Archy/Brunson Backcourt for the Wildcats?\nA backcourt combo of Ryan Archadiacono and Jalen Brunson seems very imminent for Villanova. Brunson, a 5-star recruit from Chicago who is a true point guard, can shoot lights out along with Ryan Archadiacono, the senior floor general. They could be the best backcourt in the Big East as well as one of the top backcourts in the country. There is a chance that Archy could likely be moved to the shooting guard position by the time the season starts. The Wildcats may not be known as a National Championship favorite by majority of the analysts, but the success of this potential backcourt could be huge for them this season.\nUNC: Nate Britt/Joel Berry and Marcus Paige\nThis loaded UNC squad will be a favorite to win the National Championship with every single player from last season’s squad returning. Next season is expected a big year for Nate Britt. A big year from Britt would help the Tar Heels and would make the backcourt combination of him and Marcus Paige one of the best in the ACC. As a sophomore, Britt averaged 14.3 points and 3.9 assists per game per 40 minutes which is greater than his per game average of 5.5 points and 2 assists. We already know what Marcus Paige can bring to the table as a scorer but he also has shown last season that he can dish the rock as well. Paige averaged 5.4 assists per 40 minutes last season. It’s more likely that Paige will play more off the ball if possible, making this another experienced, lethal duo.\nGo to MSN Home", "external_links": ["https://youtu.be/yGl__bIM_6Y", "http://thesportsquotient.com/", "https://youtu.be/h7Gl3V-WEz0", "https://youtu.be/yTXNYqvyuI4", "http://www.sports-reference.com/cbb/schools/duke/2015.html", "http://www.sports-reference.com/cbb/players/shabazz-napier-1.html", "https://youtu.be/Vu1Dm2vuiOo", "http://go.microsoft.com/fwlink/?LinkID=286759"], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-23T18:53:38.620+03:00", "highlightTitle": ""}