{"organizations": ["Sunday Trent Williams"], "uuid": "a2abff7843658465cfc94dc3b20410e4d8a507bd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonpost.com", "main_image": "http://img.washingtonpost.com/rf/image_908w/2010-2019/Wires/Images/2015-10-11/Getty/492294878.jpg", "site_section": "http://www.washingtonpost.com/rss/sports", "section_title": "Sports", "url": "https://www.washingtonpost.com/news/football-insider/wp/2015/10/14/trent-williams-ailing-with-neck-and-spine-pain-but-hopes-to-play-sunday/", "country": "US", "title": "Trent Williams ailing with neck and spine pain, but hopes to play Sunday", "performance_score": 0, "site": "washingtonpost.com", "participants_count": 0, "title_full": "Trent Williams ailing with neck and spine pain, but hopes to play Sunday", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T00:17:00.000+03:00", "replies_count": 0, "uuid": "a2abff7843658465cfc94dc3b20410e4d8a507bd"}, "author": "", "url": "https://www.washingtonpost.com/news/football-insider/wp/2015/10/14/trent-williams-ailing-with-neck-and-spine-pain-but-hopes-to-play-sunday/", "ord_in_thread": 0, "title": "Trent Williams ailing with neck and spine pain, but hopes to play Sunday", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Trent Williams", "Liz Clarke"], "text": "Trent Williams ailing with neck and spine pain, but hopes to play Sunday Resize Text By Liz Clarke October 14 at 5:05 PM Follow @lizclarketweet Trent Williams reacts after Sunday’s game ended in overtime. (Kevin C. Cox/Getty Images) \nAt some point in Sunday’s game at Atlanta, without notice or comment, Redskins left tackle Trent Williams injured his neck. Reporters were barred from speaking to him in the locker room afterward, with a team official explaining that he didn’t feel well. \nThe discomfort remained significant enough on Wednesday that Williams, among the team’s more durable players, was withheld from most of practice, taking part only in individual drills and watching the rest from the sideline. \nAsked later whether he expected to play Sunday at the New York Jets, Williams said: “Got to wait and see what coach says, see what the doctor says. Obviously if there is any chance I’m gonna play, I’m gonna play.” \nWilliams is attending all meetings at Redskins Park, but Gruden explained that the coaching and medical staff are taking a cautious approach about subjecting him to contact, citing a “spine” injury. \n“He’s still participating from a mental standpoint; just physically, we want to make sure he’s right,” Gruden said. “We don’t want to have an unnecessary guy hit him in the neck area or have somebody trip and have him fall and injure himself. He’s such a big part of our offense that we want to make sure that he is right. He’ll let us know when he is ready. I think he’ll be okay.” \nWilliams, 27, a three-time Pro Bowl honoree, seemed as if things were weighing on him in the locker room after practice. But as the offense’s captain, he fielded questions from the media, nonetheless, as he routinely done. Most were about the Redskins’ difficulty in running the ball against Atlanta and the challenge the Jets’ defensive front will present in that regard. \nThe Falcons outgained the Redskins on the ground 176 yards to 51 in the 25-19 overtime loss. \nEven though the Redskins led most of the game, Gruden called 32 passing plays to 24 rushing plays, frustrated by a running attack that gained just 2.1 yards per carry. \nWilliams affirmed what Gruden has conceded this week: To be effective, the Redskins offense must get its rushing game back on track. \n“We want to establish the run game,” Williams said. “Obviously, Atlanta was pretty stout in the run game, which they have been all year. It’s gonna be the same way with the Jets. \n“We can’t abandon it and try to drop back 50 times a game. I don’t know how good that would be for our offense. You need to keep teams off balance with what you’re throwing at them.” \nMore from The Post :", "external_links": [], "published": "2015-10-15T00:17:00.000+03:00", "crawled": "2015-10-15T00:29:03.319+03:00", "highlightTitle": ""}