{"organizations": [], "uuid": "ca51d4ab10f223d8594537455c869d55e5d34301", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/soccer", "section_title": "Soccer News, Scores, Schedule, Standings, Stats, Photos, Videos - MSN Sports", "url": "http://www.msn.com/en-us/sports/soccer/usa-to-face-colombia-in-two-leg-playoff-for-olympic-berth/ar-AAfDkmf", "country": "US", "title": "USA to face Colombia in two-leg playoff for Olympic berth", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "USA to face Colombia in two-leg playoff for Olympic berth", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "ca51d4ab10f223d8594537455c869d55e5d34301"}, "author": "Kyle McCarthy", "url": "http://www.msn.com/en-us/sports/soccer/usa-to-face-colombia-in-two-leg-playoff-for-olympic-berth/ar-AAfDkmf", "ord_in_thread": 0, "title": "USA to face Colombia in two-leg playoff for Olympic berth", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "USA to face Colombia in two-leg playoff for Olympic berth FOXSports 22 hrs ago Kyle McCarthy © MEXSPORT Action photo during the match Cuba vs United States, Corresponding to Group A of 2015 CONCACAF Mens Olympic Qualifying Championship at Sporting Park Stadium, in the photo: Cameron Carter-Vickers celebrates his goal with Jordan Morris and Jerome Kiesewetter of United States Foto de accion durante el partido Cuba vs Estados Unidos, Correspondiente al Grupo B del Campeonato Preolimpico-Hombres de la CONCACAF 2015 en el Estadio Sporting Park, en la foto: Cameron Carter-Vickers celebra su gol con Jordan Morris y Jerome Kiesewetter de Estados Unidos 03/10/2015/MEXSPORT/Jorge Martinez. The United States under-23 national team will face Colombia in a two-legged playoff next March to determine a berth at the 2016 Rio Olympics.\nAdChoices Colombia will host the first leg of the home-and-home series, while the Americans will stage the second leg at a site to be determined later, according to a release from U.S. Soccer. The exact dates for the two matches are still uncertain at this point, but the games must be played by the end of March, according to FIFA regulations.\nThis playoff offers the Americans a chance to snatch an Olympic spot at the last possible instance after failing to seal one of the two available berths during the 2015 CONCACAF Olympic qualifying tournament.\nAndreas Herzog's side romped through Group A to reach the semifinals, but the Americans lost the critical semifinal to Honduras and squandered a chance to qualify directly in the process. The subsequent victory over Canada in the third-place match arranged this playoff against Colombia, the second-place finishers in the 2015 South American Youth Football Championship held in Uruguay earlier this year.\nColombia leaned on Juventus starlet Andrés Tello (currently on loan to Cagliari) and a host of domestic-based prospects to finish second in the under-20 tournament used to determine the Olympic and FIFA Under-20 World Cup berths earlier this year. Colombia under-23 coach Carlos Restrepo is expected to gather a more experienced squad for matches against China, South Korea and Morocco in China next month.\nIf the Americans can overcome Colombia next year, then they will return to the Olympics for the first time since 2008 and take their place in the 16-team field next summer.\nGo to MSN Home", "external_links": ["http://www.foxsports.com/", "http://go.microsoft.com/fwlink/?LinkID=286759"], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-20T21:03:40.993+03:00", "highlightTitle": ""}