{"organizations": [], "uuid": "1f1a61c2b80daf6364d14625aaf1e950fa154cff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.torontosun.com", "main_image": "http://storage.torontosun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297758851365_LARGE_BOX.jpg?quality=80&stmp=1444495011113&size=100x", "site_section": "http://www.torontosun.com/sports/hockey", "section_title": "Hockey | Sports | Toronto Sun", "url": "http://www.torontosun.com/2015/10/10/fantasy-fare-three-days-of-surprises", "country": "CA", "title": "Fantasy Fare: Three days of surprises | Hockey Toronto Sun", "performance_score": 0, "site": "torontosun.com", "participants_count": 1, "title_full": "Fantasy Fare: Three days of surprises | Hockey | Sports | Toronto Sun", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T00:17:00.000+03:00", "replies_count": 0, "uuid": "1f1a61c2b80daf6364d14625aaf1e950fa154cff"}, "author": "torontosun.com", "url": "http://www.torontosun.com/2015/10/10/fantasy-fare-three-days-of-surprises", "ord_in_thread": 0, "title": "Fantasy Fare: Three days of surprises | Hockey Toronto Sun", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Some takeaways from an interesting first three days of the NHL schedule:\n— The Canucks decided, literally last-minute, to replace Radim Vrbata as the RW of the Sedins line for their opening game Wednesday in Calgary. Sutter, who was expected to centre the second line after being acquired from the Pens in the off-season, had only minimal experience on the wing with his Red Deer juniors years ago, but made a seamless transition in his Canucks debut with a goal, an assist and a plus-3. The eighth-year veteran scored 21 goals and 33 points (both career highs) as a third-line centre in Pittsburgh last season, but that will be easily surpassed if he sticks with the resurgent Sedins. Taking over the second-line centre spot is Bo Horvat (which we projected, just not so soon) playing between Vrbata and Sven Baertschi.\n— Another surprise, this time out of Chicago, was that Teuvo Teravainen, who’d been skating as a third-line centre or second-line left wing in exhibition, lined up for Wednesday’s opener as LW on the top line with Jonathan Toews and Marian Hossa and scored a goal. But he didn’t last there and was replaced by Andrew Shaw mid-game, though we doubt he’s the answer, either. We figure the hook came rather quickly, however, and that Teravainen will get another shot. The projected second line of Patrick Kane, Artem Anisimov and rookie Artemy Panarin stayed in tact with Panarin roofing a wrist shot off a nice Kane feed past Henrik Lundqvist.\n— The Islanders went with Dylan Strome, and not Kyle Okposo, as John Tavares’ RW in their opener against Chicago. Anders Lee remained on the left side.\n— The Stars obviously (and wisely) reconsidered their plans to load up the top line and left newcomer Patrick Sharp on the second unit with Jason Spezza. Valeri Nichushkin, meanwhile, who was expected to return to his role alongside Jamie Benn and Tyler Seguin after missing most of last season hurt, stayed on the Spezza-Sharp line (his fantasy owners can’t complain about that) while veteran checking centre Cody Eakin got the nod to play between Seguin and Benn.\n— The Sabres appear to have flipped centres Jack Eichel and Ryan O’Reilly, the rookie skating second line with Evander Kane and Zemgus Girgensons, the veteran between Matt Moulson and Tyler Ennis.\n— Fantasy owners with an itchy waiver-wire finger, looking for that next surprise breakout player, usually take notice when a rookie scores in his first game. And that happened 10 times over the first three days. And while Eichel is, no doubt, not available, check the Waiver Watch section below for an early thought or two on a few other fast-starting freshmen. We’ll get to the others, such as Jets’ Nic Petan, hopefully next week.\n— Have the Kings’ scoring woes followed them into the new season? After managing one goal on just 20 shots in their opening loss to the Sharks, the Kings peppered 41 attempts at the Coyotes on Friday but again were held to a single goal. The story here, though, was goalie Jonathan Quick, who now has an .833 save percentage through two home-ice losses.\n— Speaking of scoring woes, looks like fantasy owners can safely avoid the Maple Leafs forwards this year. Through two games, their only goal was produced when a puck glanced in off James van Riemsdyk’s skate. Of course, things won’t stay that stagnant at the ACC, but we still have our doubts that this collection of second- and third-liners will reach 150 goals for the season.\n— Stars netminder Antti Niemi has more points (2) than anyone on the Leafs in half as many games. Don’t you just love the first week of the season?\nHOT AND NOT (Through the first week)\nJustin Abdelkader DET 3 goals, plus-2 in 1 GP\nZach Parise MIN 3 goals, plus-2 in 1 GP\nAlex Burmistrov WPG 1-1-2, plus-4 in 2 GP\nFrancois Beauchemin COL 3 assists, plus-1 in 1 GP\nJ.T. Miller NYR 3 assists, plus-2 in 2 GP\n- - - - - -\nRick Nash NYR 0 goals, 0 assists in 2 GP\nSidney Crosby PIT 0 points, 0 shots in 1 GP\nClaude Giroux PHIL 0 points, minus-1 in 1 GP\nGAMES THIS WEEK\n4 — ANA, CLB, EDM, FLA, STL, TB, VAN, WPG\n2 — PHIL, TOR\n(All other teams play three games)\nTHOSE OTHER STATS: PENALTY MINUTES\nDerek Dorsett VAN 15\nBrandon Prust VAN 15\nBrandon Bollig CGY 15\nMike Brown SJ 9\nAndy Andreoff LA 7\nBarclay Goodenow SJ 7\nWAIVER WATCH\n(With fantasy rating out of 5)\nOscar Lindberg C, Rangers * *\nWhile he did make one appearance last season, the 23-year-old Swede has scored in each of his first two games this week, though on third-line ice time and just four total shots. Still, the 2010 second-rounder showed a nice scorer’s touch on both goals after potting 28 last year in the AHL.\nMax Domi C, Coyotes * * *\nProjected as the next best non-McDavid/Eichel rookie, he didn’t disappoint those owners who drafted him, tallying a goal (on a quick-release wrist shot past Jonathan Quick) and an assist in his debut on Friday. He opened on the top line with Mikkel Boedker and Antoine Vermette.\nRobby Fabbri RW, Blues * * *\nHis first NHL goal was the proverbial two-foot putt, converting Jori Lehtera’s dazzling backhand pass. But the former Canadian world junior has been a prolific scorer everywhere he’s played and, even skating on the third line with Lehtera and Jaden Schwartz, should put up respectable numbers.\nDylan Larkin RW, Red Wings * * *\nFirst-rounder in 2014 looked like a polished pro skating with Henrik Zetterberg and Justin Abdelkader on Friday against the Leafs with a goal and an assist\nJoonas Donskoi LW, Sharks * * *\nSkated with Joe Thornton and Joe Pavelski on the top line and scored his first goal while adding a plus-3. A fourth-rounder in 2010, he rolled up 49 points in 58 games last year in the Finnish league.\nMattias Janmark C, Stars * *\nHis goal in his NHL debut was more the result of a linemate’s nifty setup. A third-round pick in 2013 as a 20-year-old, he looks more like a solid two-way third-liner with a low to medium offensive ceiling.\nINJURY UPDATES\nTwo key injuries on Thursday, both involving key acquisitions: James Wisniewski lost to the Canes for the year with a torn ACL, and Sabres goalie Robin Lehner likely out for a while with a leg issue ... Jordan Eberle (shoulder) will miss the first 4-6 weeks ... The Bruins say Seth Griffith’s MCL sprain will keep him out a month ... Danny DeKeyser (foot) is out until November ... The Devils, as expected, placed Patrik Elias (knee) on IR ... If Zdeno Chara doesn’t return Saturday, he’s not far off ... The Caps now figure Nicklas Backstrom could miss only four or five games coming off hip surgery. They’ll know more this week after he visits the surgeon.\nFantasy Fare: Three days of surprises\nBy Joel Colomby , Toronto Sun First posted: Saturday, October 10, 2015 12:17 PM EDT | Updated: Saturday, October 10, 2015 12:24 PM EDT\nSome takeaways from an interesting first three days of the NHL schedule:\n— The Canucks decided, literally last-minute, to replace Radim Vrbata as the RW of the Sedins line for their opening game Wednesday in Calgary. Sutter, who was expected to centre the second line after being acquired from the Pens in the off-season, had only minimal experience on the wing with his Red Deer juniors years ago, but made a seamless transition in his Canucks debut with a goal, an assist and a plus-3. The eighth-year veteran scored 21 goals and 33 points (both career highs) as a third-line centre in Pittsburgh last season, but that will be easily surpassed if he sticks with the resurgent Sedins. Taking over the second-line centre spot is Bo Horvat (which we projected, just not so soon) playing between Vrbata and Sven Baertschi.\n— Another surprise, this time out of Chicago, was that Teuvo Teravainen, who’d been skating as a third-line centre or second-line left wing in exhibition, lined up\nAbout the author Joel Colomby Other Stories Fantasy Fare: Late line changes\nIf they hadn’t been so successful at it in recent years, it would be easy to gloss over the overhaul of the forward corps done by the Chicago Blackhawks this off-season.\n0\n2015-16 NHL fantasy preview: Forwards\nOn to the second half of our preview, breaking down the top 40 centres and 70 wingers. Obviously there will be more than 110 fantasy-worthy forwards and a handful of fantasy gems should come out of the lists at the bottom of old reliables or rising youngsters from which you can select in the later rounds.\n0\nSee more from Joel Colomby »\n Hockey 0\nFantasy Fare: Three days of surprises 0\nEdmonton Oilers' Connor McDavid skill-set yet to include faceoffs\nWinnipeg Jets win second straight game to start NHL season 0\n ", "external_links": ["http://pubads.g.doubleclick.net/gampad/clk?id=182027221&iu=/3081/SMCO_ENUR_TSUN_EN_WEB", "http://pubads.g.doubleclick.net/gampad/clk?id=228633661&iu=/3081/SMCO_ENUR_TSUN_EN_WEB", "http://pubads.g.doubleclick.net/gampad/clk?id=182024221&iu=/3081/SMCO_ENUR_TSUN_EN_WEB", "http://pubads.g.doubleclick.net/gampad/clk?id=183052021&iu=/3081/SMCO_ENUR_TSUN_EN_WEB"], "published": "2015-10-11T00:17:00.000+03:00", "crawled": "2015-10-10T20:38:24.484+03:00", "highlightTitle": ""}