{"organizations": ["Ex-Louisville", "Associated Press", "UMKC Ex-Louisville", "UMKC", "Former University of Louisville"], "uuid": "3ed67ce2ad86e419e94249e982669c93f06a6d22", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.indystar.com", "main_image": "http://www.gannett-cdn.com/-mm-/7f51b3adaab5352aad2f815708b8756758968a1a/c=0-15-533-316&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/23/Indianapolis/Indianapolis/635812162924019612-andremcgee.jpg", "site_section": "http://rssfeeds.indystar.com/indystar/collegesports", "section_title": "Indystar - College Sports", "url": "http://www.indystar.com/story/sports/college/2015/10/23/ex-louisville-director-basketball-operations-andre-mcgee-resigns-umkc/74479748/", "country": "US", "title": "Ex-Louisville director of basketball operations Andre McGee resigns from UMKC", "performance_score": 0, "site": "indystar.com", "participants_count": 0, "title_full": "Ex-Louisville director of basketball operations Andre McGee resigns from UMKC", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T00:01:00.000+03:00", "replies_count": 0, "uuid": "3ed67ce2ad86e419e94249e982669c93f06a6d22"}, "author": "", "url": "http://www.indystar.com/story/sports/college/2015/10/23/ex-louisville-director-basketball-operations-andre-mcgee-resigns-umkc/74479748/", "ord_in_thread": 0, "title": "Ex-Louisville director of basketball operations Andre McGee resigns from UMKC", "locations": ["Louisville"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jeff Greer", "Andre McGee", "Andrew Wolfson"], "text": "Ex-Louisville director of basketball operations Andre McGee resigns from UMKC Andrew Wolfson and Jeff Greer, Louisville Courier-Journal 5:01 p.m. EDT October 23, 2015 Former University of Louisville director of basketball operations Andre McGee (Photo: Associated Press) CONNECT 2 TWEET LINKEDIN 1 COMMENT EMAIL MORE \nAndre McGee, the figure at the center of University of Louisville’s basketball scandal , resigned Friday morning as assistant basketball coach at the University of Missouri-Kansas City, head coach Kareem Richardson confirmed to The Courier-Journal. \nMcGee, the former director of basketball operations at U of L, had been placed on administrative leave at UMKC after the publication of Katina Powell’s book in which she alleges he paid her $10,000 from 2010-14 to provide dancers and escorts to entertain U of L players and recruits. \nMcGee said in an email to the athletic director of the Kansas City school that he had “reluctantly” decided to resign because the team deserves a full-time assistant and he was not able to provide that “while the false allegations against me are investigated.” \nMcGee’s lawyer, Scott C. Cox of Louisville, declined comment Friday but previously said McGee \"has never supplied a prostitute or escort to a player or recruit at the University of Louisville.\" Rick Pitino: 'I will not resign and let you down' \nRichardson declined comment on McGee's resignation, saying that until the investigations are complete, \"I won't have further comments about Andre or the allegations.\" \nPowell has said in the book and interviews that McGee provided money for parties with strippers in U of L’s Minardi Hall and for “side deals” in which he paid for escorts to have sex with players, recruits and their guardians. \nU of L Coach Rick Pitino earlier this week called for McGee to come forward and “tell the truth” about the scandal. \nMcGee, 28, played four years at U of L, helping the Cardinals reach the NCAA tournament's regional finals twice. After leaving Louisville, he spent a year playing for Phoenix Hagen, a professional basketball club in Germany. \nHe returned to U of L after that experience, first serving on coach Rick Pitino's staff as a program assistant. In 2012, he was promoted to director of basketball operations, a job that involves coordinating class schedules for players, keeping them up with their academic requirements, planning team activities and trips and several other responsibilities. \nAfter two years in that role, McGee became an assistant coach at UMKC under Richardson, a former U of L assistant. \nThis story will be updated.", "external_links": [], "published": "2015-10-24T00:01:00.000+03:00", "crawled": "2015-10-25T00:47:39.229+03:00", "highlightTitle": ""}