{"organizations": [], "uuid": "d1bd5af35fd5a0632769655d81c5b12d30c0a39a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usatoday.com", "main_image": "http://www.gannett-cdn.com/-mm-/6b8ac5c13751fcbbcd69471d360368a552194a24/c=0-96-2000-1221&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/02/USATODAY/usatsports/94527c5dca346b2b830f6a706700c032.jpg", "site_section": "http://www.usatoday.com/sports/", "section_title": "USA Today | Sports", "url": "http://www.usatoday.com/story/sports/soccer/2015/10/02/doctor-in-mourinho-dispute-criticizes-fa-over-sexism-cases/73198994/", "country": "US", "title": "Doctor in Mourinho dispute criticizes FA over sexism cases", "performance_score": 0, "site": "usatoday.com", "participants_count": 1, "title_full": "Doctor in Mourinho dispute criticizes FA over sexism cases", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T17:41:00.000+03:00", "replies_count": 1, "uuid": "034176136f27164397a74c59a58bf532f8b40b1c"}, "author": "", "url": "http://www.usatoday.com/story/sports/soccer/2015/10/02/doctor-in-mourinho-dispute-criticizes-fa-over-sexism-cases/73198994/#post-0", "ord_in_thread": 0, "title": "Doctor in Mourinho dispute criticizes FA over sexism cases", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Photo: The Associated Press)\n1 CONNECT TWEET LINKEDIN 1 COMMENT EMAIL MORE The English Football Association is failing to tackle sexism and making life difficult for women, former Chelsea doctor Eva Carneiro said Friday as she broke almost two months of silence on a dispute with manager Jose Mourinho that has engulfed the club.\nMourinho publicly criticized Carneiro after she ran onto the field to treat an injured player near the end of Chelsea's opening game of the season, and her duties were later downgraded.\nFA chairman Greg Dyke believes Mourinho committed \"a failure of his personal judgment and public behavior\" by rebuking Carneiro in public. But the FA cleared Mourinho of directing discriminatory comments toward Carneiro on the sideline without interviewing her as part of the investigation.\n\"I wonder whether this might be the only formal investigation in this country where the evidence of the individuals involved in the incident was not considered relevant,\" Carneiro said in a statement. \"Choosing to ignore some of the evidence will surely influence the outcome of the findings.\"\nCarneiro feels the FA also did not adequately address \"verbal abuse\" she endured during a game at West Ham last season.\n\"Following complaints by the public, the FA produced a communication to the press saying there had been no sexist chanting during this game,\" she said. \"At no time was I approached for a statement despite the fact that vile unacceptable, sexually explicit abuse was clearly heard.\n\"It is incidents such as these and the lack of support from the football authorities that make it so difficult for women in the game.\"\nThe statement is likely to intensify the pressure on Mourinho to apologize.\n\"For the past two months I didn't open my mouth and I'm going to keep it like this. One day I will speak and I will choose a day,\" Mourinho said Friday ahead of Carneiro's statement being released. \"I'm quiet about it for a long time. I read and I listen and I watch and I'm quiet.\n\"I'm telling you, we can be here all day. My time to speak will arrive when I decide.\"\nThe dispute came at the start of a season that has seen Chelsea win only two of seven games in the Premier League. Chelsea also lost in the Champions League at FC Porto on Tuesday.\n\"I define (this) as the worst period of my career, with the worst results in my career,\" Mourinho said ahead of Saturday's game against Southampton. \"I get it as a fantastic experience — an experience that I don't want to repeat. I want to finish tomorrow and win some matches again.\n\"I think it comes too late, to come after 15 years is too late, but it's something that is helping me to be better, a great negative experience.\"\n1 CONNECT TWEET LINKEDIN 1 COMMENT EMAIL MORE Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.\nTOP VIDEOS", "external_links": ["http://www.gannett-cdn.com/-mm-/791e321f1d0d398d895981e074fff90d8e8ba1b1/c=122-0-1877-1316&r=x404&c=534x401/local/-/media/2015/10/02/USATODAY/usatsports/94527c5dca346b2b830f6a706700c032.jpg", "http://www.linkedin.com/shareArticle?url=http%3A//usat.ly/1L8FVjn&mini=true", "https://twitter.com/intent/tweet?url=http%3A//usat.ly/1L8FVjn&text=Doctor%20in%20Mourinho%20dispute%20criticizes%20FA%20over%20sexism%20cases&via=usatoday"], "published": "2015-10-02T17:41:00.000+03:00", "crawled": "2015-10-02T17:38:13.096+03:00", "highlightTitle": ""}