{"organizations": [], "uuid": "c4a8c20f78ac8f7293e56916454e04be9dd8ea07", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mantecabulletin.com", "main_image": "http://media.morristechnology.com/webmedia/facebook_share_images/manteca_bulletin/manteca_facebook_share_image.jpg", "site_section": "http://www.mantecabulletin.com/syndication/feeds/atom/154/", "section_title": "Pro Sports", "url": "http://www.mantecabulletin.com/section/154/article/128604/", "country": "US", "title": "Raiders’ Charles Woodson still going strong at age 39", "performance_score": 0, "site": "mantecabulletin.com", "participants_count": 0, "title_full": "Raiders’ Charles Woodson still going strong at age 39", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T11:06:00.000+03:00", "replies_count": 0, "uuid": "c4a8c20f78ac8f7293e56916454e04be9dd8ea07"}, "author": "", "url": "http://www.mantecabulletin.com/section/154/article/128604/", "ord_in_thread": 0, "title": "Raiders’ Charles Woodson still going strong at age 39", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Charles Woodson"], "text": "  Raiders’ Charles Woodson still going strong at age 39 Raiders’ Charles Woodson still going strong at age 39 Tweet \nALAMEDA . (AP) — When Charles Woodson entered the NFL nearly two decades ago, the idea that he’d still be playing at age 39 never crossed his mind. \nYet here he still is in his 18th season, ignoring a banged-up shoulder that limits his practice time and his tackling ability and still grinding away for the Oakland Raiders with the energy of a much younger player. \n“I never looked that far into the future to say I’d play past 10 years,” Woodson said Wednesday on his 39th birthday. “To be at 18, man, it’s amazing even to me. I think about it more and more because I hear about it all the time but it’s pretty crazy to be here at 18 years.” \nWoodson will have some company in the old-man brigade on Sunday when the Raiders (2-2) host Denver (4-0). Broncos quarterback Peyton Manning also entered the NFL in the 1998 draft class — picked first, three spots ahead of Woodson — and is still playing at a high level. \nThe only other player remaining from that draft class is quarterback Matt Hasselbeck, who also started last week. But only Woodson is doing it at a position where he has to dole out hits and run all around the field. \n“It’s definitely something we all look at,” teammate Aldon Smith said. “I’m 26 and I feel like I can’t complain about certain things because he’s doing it and he’s been doing it for a while and he does it at a high level. It makes you want to step up and play hard.” \nWoodson is more than just an inspirational leader for the Raiders. He is also a major contributor. Despite the injury late in Week 1, Woodson has played 96 percent of the defensive snaps, second on the team to Malcolm Smith. \nHe has two interceptions, sealing a Week 3 win in Cleveland with one and setting up a late, go-ahead score last week in Chicago with the 62nd of his career. The Raiders ended up losing that game when the Bears kicked a late field goal. \nOnly Darrell Green and Clay Matthews Sr. have intercepted passes at an older age than Woodson. \n“When I was 39, I was the head coach at that time, my first year,” Raiders coach Jack Del Rio said. “I thought I could still do it, but he’s doing it. It’s pretty impressive to see what he’s done.” \nLike Woodson, Manning is not quite the same player he was in his prime but he is still quite successful. He has the Broncos at the top of the AFC West once again and is growing more comfortable by the week in coach Gary Kubiak’s offense. \n“We’re still hanging in there,” Manning said. “Woodson has had two, what really should have been, game-saving interceptions. It should have probably helped them win the Chicago game and it definitely helped them seal the Cleveland game. He’s making a lot of plays. He’s the leader of that defense back there. It’s a real credit to him to be playing at a high level like he is.” \nFor all that Woodson has accomplished with a Super Bowl title, an AP Defensive Player of the Year, three first-team All Pro selections and 13 defensive touchdowns, there is at least one thing missing. \nWoodson has never intercepted a pass from Manning, the player he beat out for the Heisman Trophy in 1997. Woodson has intercepted passes from 40 quarterbacks, but has none in eight career meetings against Manning. \n“I don’t want to put too much on it about being Peyton,” Woodson said. “Every time I step on the field, it doesn’t matter who we’re playing, I want to get an interception. This week will be no different. Would it be great to intercept Peyton? No question about it.” \nNOTES: Woodson did not practice as is typical on Wednesdays as he rests his shoulder. ... DT Denico Autry (concussion), DB TJ Carrie (chest), WR Michael Crabtree (ankle), RB Taiwan Jones (foot), S Taylor Mays (ankle), DE Justin Tuck (knee) and DT C.J. Wilson (calf) also missed practice. ... RB Latavius Murray was limited with a shoulder injury. ... DE Benson Mayowa (knee) and CB Keith McGill (foot) returned on a limited basis.", "external_links": [], "published": "2015-10-08T11:06:00.000+03:00", "crawled": "2015-10-09T05:15:31.325+03:00", "highlightTitle": ""}