{"organizations": ["CET Local Black Stars", "Local Black Stars"], "uuid": "4cd416e134d7336adb7987d3cb476f4fe3806409", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/h40of66fey_localblack.jpg", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=2&gender=1", "section_title": "Sports News", "url": "http://www.modernghana.com/sports/649298/2/local-black-stars-to-play-cote-divoire-on-sunday.html", "country": "US", "title": "Local Black Stars to play Cote d'Ivoire on Sunday", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "Local Black Stars to play Cote d'Ivoire on Sunday", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T01:00:00.000+03:00", "replies_count": 0, "uuid": "4cd416e134d7336adb7987d3cb476f4fe3806409"}, "author": "", "url": "http://www.modernghana.com/sports/649298/2/local-black-stars-to-play-cote-divoire-on-sunday.html", "ord_in_thread": 0, "title": "Local Black Stars to play Cote d'Ivoire on Sunday", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sports News | 14 October 2015 23:00 CET Local Black Stars to play Cote d'Ivoire on Sunday By GNA \nAccra, Oct. 14, GNA - The Local Black Stars will commence their search for another ticket to the Championship of Africa Nations (CHAN) this weekend, with a game against Cote D'Ivoire. \nThe game fixed for the Baba Yara Stadium, on Sunday, October 18, will be the first leg encounter for the team, with the second leg fixed for two weeks' time in Cote D' Ivoire. \nThe team has been in camp at the Len Clay Stadium, Obuasi under the guidance of Dauda Lutterodt, whilst head coach Maxwell Konadu was with the main Black Stars in the United States of America (USA). \nAccording to the GFA, the team will arrive in Kumasi on Wednesday for test match ahead of the game against the Ivorians. \nThe statement said, the Elephants of La Cote D'Ivoire are also expected to arrive in Kumasi on Friday, October 16. \nAccording to the GFA, the VIP will go for GH¢10.00, with Centre Line going for GH¢5.00, whilst Popular Stand will go for GH¢3.00. \nThe GFA earlier invited 30 players to camping at the Obuasi Len Clay Stadium. \nAmong the invited players are; Fatau Dauda - Ashgold, Richard Ofori - Wa All Stars, Osei Kwame - Inter Allies, Felix Annan - WAFA, Godfred Saka - Aduana Stars, Amos Frimpong - Asante Kotoko, Patrick Asmah - B.A. United, Joshua Tijani - Ashgold, Baba Mensah - Inter Allies, Abdul Ganiyu - Wa All Stars, Ahmed Adams - Asante Kotoko, Abeiku AInooson - Asante Kotoko, Sabahn Laryea - Hearts of Oak, Kadri Mohammed - Ashantigold, Leonard Owusu - Dreams FC, Zakari Mumuni - WAFA, Eric Donkor - Asante Kotoko, Isaac Twum - Heart of Lions, Isaac Acheampong - Sekondi Hasaacas, Kwasi Donsu - Medeama SC, Emmanuel Osei - Ashantigold and Kofi Owusu - Berekum Chelsea. \nThe rest are; Nuhu Fuseini - New Edubiase, Eric Kumi - Hearts of Oak, Daniel Appiah - Great Olympics, Dauda Mohammed - Asante Kotoko, Bright Lukman - Dwarfs, Joel Fameyeh - Asokwa Deportivo, Isaac Amoah - Amidaus Professionals and Samuel Tetteh - WAFA. \nGNA", "external_links": [], "published": "2015-10-15T01:00:00.000+03:00", "crawled": "2015-10-15T01:55:14.675+03:00", "highlightTitle": ""}