{"organizations": ["Holmes Central"], "uuid": "61aea2d0c1f0d8ff2df93e2ffe64e65ed14b67c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.clarionledger.com", "main_image": "http://www.gannett-cdn.com/-mm-/b4cbe23111f2fc3d9853b36dc29e2cabbd399771/c=0-143-997-706&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/22/JacksonMS/JacksonMS/635811080297077152-Tony-Woolfork.JPG", "site_section": "http://rssfeeds.clarionledger.com/jacksonms/highschoolsports", "section_title": "Jackson MS - HIgh School Sports", "url": "http://www.clarionledger.com/story/sports/2015/10/21/week-high-school-football-schedule/74356954/", "country": "US", "title": "Holmes Central coach resigns, denies texting students", "performance_score": 0, "site": "clarionledger.com", "participants_count": 0, "title_full": "Holmes Central coach resigns, denies texting students", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T18:48:00.000+03:00", "replies_count": 0, "uuid": "61aea2d0c1f0d8ff2df93e2ffe64e65ed14b67c2"}, "author": "", "url": "http://www.clarionledger.com/story/sports/2015/10/21/week-high-school-football-schedule/74356954/", "ord_in_thread": 0, "title": "Holmes Central coach resigns, denies texting students", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tony Woolfork", "Courtney Cronin", "Bracey Harris"], "text": "Holmes Central coach resigns, denies texting students Bracey Harris and Courtney Cronin, The Clarion-Ledger 10:48 a.m. CDT October 22, 2015 Tony Woolfork on Twitter 25 CONNECT 26 TWEET LINKEDIN COMMENT EMAIL MORE \nHolmes County Central High school will name an interim football coach following the resignation of head coach Tony Woolfolk. \nWJTV-TV reported Woolfolk, who was also the school's athletic director, resigned Tuesday. Superintendent Powell Rucker told the station that Woolfolk \"violated the district’s texting policy with students.\" \nShalonda Brooks told reporter Mallary Pullen that Woolfolk sent Brook's 15-year-old daughter hundreds of messages. Brooks said that she filed a complaint with the Holmes County Sheriff's Department Monday. \nWednesday Sheriff Willie March told The Clarion-Ledger that he had not received a complaint. \nAccording to WAPT-TV, district policy \"prohibits faculty and staff from texting students.\" \nThe subject matter of the alleged text messages has not been disclosed. \nWoolfolk denied the improper communication to The Clarion-Ledger and stated that the reason for his resignation is to care for his ailing father. \n\"I'm going home to take care of my dad,\" Woolfolk said. \"He's sick. He's fallen, and he's at that age that I need to go take care of him.\" \nWoolfolk said he met with his team Tuesday to make them aware of his departure. He said he did not know who will be taking over his role on an interim basis. \n\"I talked to my players, the coaches yesterday,\" he said. \"They know exactly what's going on.\" \nWoolfolk is eligible to collect retirement from the state of Mississippi after serving as a coach and teacher in the public school and university ranks for more than 25 years. Prior to spending two seasons at Holmes County, Woolfolk coached at Yazoo City for 14 seasons and held positions on staff at Alcorn State, Albany State and South Carolina State. \n\"I've got 30 years of experience all the way around,\" he said. \"In 30 years of coaching, I've never had anything like that (referring to the allegations of texting student-athletes) go on anywhere. All my players I've coached will tell you that. It's weird coming from Holmes County.\" \nMultiple calls to from The Clarion-Ledger to Rucker were not returned Wednesday. \nThe Jaguars are 6-2 this season and in a three-way tie for second place in Region 2-5A. The team is scheduled to play Grenada on Friday. \nContact Bracey Harris (601) 961-7248 or bharris2@jgannett.com. Contact Courtney Cronin at (601) 961-7091 or ccronin@jgannett.com. Follow @braceyharris and @CourtneyRCronin on Twitter. 25 CONNECT 26 TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http://on.thec-l.com/1RWv1hY TOP VIDEOS", "external_links": [], "published": "2015-10-22T18:48:00.000+03:00", "crawled": "2015-10-23T18:18:30.986+03:00", "highlightTitle": ""}