{"organizations": [], "uuid": "ae52fe0fd259559fec92bc5d973ea851b5300872", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ksl.com", "main_image": "http://img.ksl.com/slc/2573/257319/25731933.jpg", "site_section": "http://www.ksl.com/xml/635,840,901.rss", "section_title": "KSL / UofU / sports stories", "url": "http://www.ksl.com/?sid=36931144&nid=635&s_cid=rss-extlink", "country": "US", "title": "Utah's success breeds coaching rumors for Whittingham", "performance_score": 0, "site": "ksl.com", "participants_count": 0, "title_full": "Utah's success breeds coaching rumors for Whittingham", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T18:21:00.000+03:00", "replies_count": 0, "uuid": "ae52fe0fd259559fec92bc5d973ea851b5300872"}, "author": "", "url": "http://www.ksl.com/?sid=36931144&nid=635&s_cid=rss-extlink", "ord_in_thread": 0, "title": "Utah's success breeds coaching rumors for Whittingham", "locations": ["Whittingham Utah", "Utah"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Whittingham", "Josh Furlong"], "text": "Utah's success breeds coaching rumors for Whittingham By Josh Furlong | Posted Oct 13th, 2015 @ 9:21am 51  \nSALT LAKE CITY — After a 5-0 start on the season and a No. 4 ranking in the Associated Press Top 25 Poll , Utah head coach Kyle Whittingham is looking like an attractive candidate for football programs looking to upgrade its coaching talent. \nSuccess does that for a head coach. \nWinning is the key to every college football program as each tries to obtain only what one team can eventually claim at the end of the season. It's no different for Utah as it works at building its resume for a possible appearance in the College Football Playoffs and potential berth to the National Championship game. But success often breeds change — sometimes unwanted change for those left in the dust. \nWhittingham's team has certainly made a strong case for being included in the talk about college football's best team: an opening week win over a now surging Michigan team that has shutout its last three opponents, a 42-point road win over an Oregon team slipping in its Pac-12 dominance, and a grind-it-out victory over an undefeated Cal team that features one of the best quarterbacks in the nation. \nIt's hard to argue that Utah hasn't had a successful season. The figurative stocks are rising for every coach at the University of Utah after each win, including the top dog himself. On Monday, Whittingham was bestowed the Dodd Trophy Coach of the Week award, which is given to a coach that \"embodies the award's three pillars of scholarship, leadership and integrity.\" \n\"It is great to see a head coach that has been so loyal to a university and program achieve success the way Coach Whittingham has at Utah,\" said Jim Terry, Chairman of the Bobby Dodd Coach of the Year Foundation in a statement. \nNow, after 21 years as Utah's coach in some form or another, Whittingham has the potential to jump ship while the iron is hot for a new coaching experience or continue to see the program he's helped establish over the last two decades work toward being a consistent powerhouse in the Pac-12. Either decision brings about risk, but also a potential reward (and more money). \nIt's not as if this is the first time Whittingham's name has been linked to coaching vacancy rumors. Following Utah's undefeated 2008 season, Whittingham was in a similar position where outside universities were rumored to have attempted to court him away to so-called greener pastures. But Whittingham stayed and navigated his program through a rocky introduction to a Power 5 conference. \nWhile exciting for the program to be included in a tougher conference, Whittingham soon learned the difficulties of playing in the Pac-12. After a decent first season, Utah suffered back-to-back losing seasons and he faced a potential coaching \"hot seat\" prior to the 2014 season. But Utah proved otherwise and finished last season with a 9-4 record and plenty of momentum leading into the 2015 season. \nAfter Monday's firing of Steve Sarkisian at USC , in addition to other coaching vacancies around the country, the rumor mills have begun and Whittingham's named has been linked as a possible suitor, or at least a candidate on a glorified wishlist of sorts. Coach who I suspect may have some intriguing options this winter: Utah's Kyle Whittingham. — Bruce Feldman (@BruceFeldmanCFB) October 9, 2015 Kyle Whittingham is a 7/2 favorite to be the next head coach at #USC . Chip Kelly is 6/1 https://t.co/DSjd1tLVGG pic.twitter.com/tC2Orb2oyU — Bovada Official (@BovadaLV) October 13, 2015 \nMany will look at last year's end-of-season coaching dilemma between Whittingham and athletic director Chris Hill as a reason to cast a shadow over the entire process for Utah's ability to keep its one of its longest-tenured coaches. But a loyalty to the program and deep connection with the state and family in the area also bolsters Utah's chances of keeping Whittingham. \nOutside programs have a difficult task ahead of them if they choose to come for Whittingham. Times have changed for Utah and Whittingham since their days in the Mountain West Conference. Most Power 5 coaching vacancies at the time would have be an instant upgrade to the situation Utah was immediately facing. \nNow, though, Utah is riding high in a Power 5 conference many have argued to rival that of the SEC. Any move to a rival Pac-12 team would seemingly be linear and not serve as a benefit unless Whittingham wants a new scene and opportunity. \nWhatever the path for Whittingham in the coming months, Hill will be forced to pony up the cash and make a compelling sales pitch to keep the status quo at Utah, or roll the dice and gamble a little bit with the future. Related Stories", "external_links": [], "published": "2015-10-13T18:21:00.000+03:00", "crawled": "2015-10-13T23:14:47.787+03:00", "highlightTitle": ""}