{"organizations": [], "uuid": "713f30d5b7f3b133965964054183884255d41e72", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "cherokeetribune.com", "main_image": "http://matchbin-assets.s3.amazonaws.com/public/sites/625/thumbs/J6BN_rgbEtowah_at_Milton_04.jpg", "site_section": "http://cherokeetribune.com/rss/rss/Sports?instance=Sports&content_type=article&tags=sports&tag_inclusion=or&offset=0&limit=10&page_name=rss", "section_title": "Sports", "url": "http://cherokeetribune.com/bookmark/26902347", "country": "US", "title": "Etowah pulls away for victory at Milton", "performance_score": 0, "site": "cherokeetribune.com", "participants_count": 1, "title_full": "Etowah pulls away for victory at Milton", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T10:27:00.000+03:00", "replies_count": 0, "uuid": "713f30d5b7f3b133965964054183884255d41e72"}, "author": "Chris Raimondi Tribune Sports Writer (noreply@cherokeetribune.com)", "url": "http://cherokeetribune.com/bookmark/26902347", "ord_in_thread": 0, "title": "Etowah pulls away for victory at Milton", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Etowah pulls away for victory at Milton by Chris RaimondiTribune Sports Writer Cherokee Tribune October 10, 2015 02:27 AM | 585 views | 0 | 3 | | Vincent Riley and his Etowah teammates had the edge in Friday’s game at Milton, winning to remain among the region’s top teams. Special photo by William Lofton slideshow MILTON — Etowah outscored Milton 21-6 in the second half and picked up a 38-20 road win Friday.Running back Tyray Devezin rushed for 129 yards and two touchdowns, while quarterback Patrick Ferris went 12-for-14 for 210 yards and three touchdown passes.“I thought our kids did a good job of continuing to stay with our game plan,” Etowah coach Dave Svehla said. “I thought we were pretty physical (Friday). This is the fourth week in a row that we are behind 7-0 a minute into the game. It says a lot about the resiliency of our kids.”The win allowed Etowah (6-1, 4-1) to stay in a tie with Walton for second in the region standings behind Roswell, though the Raiders hold the tiebreaker with their win over the Eagles on Sept. 11.Etowah came out of halftime with a slim 17-14 lead when it started to take control. Devezin handled the first two carries of the third quarter, taking the first for 34 yards and the second for 46 to make it a 24-14 game just 20 seconds into the half.Milton (1-4, 1-3) took its next possession 60 yards before Ethan Suda’s 38-yard field kept it a one-possession game at 24-17. After a pair of rushes from Devezin went for no gain on Etowah’s ensuing possession, Ferris linked up with Bronson Rechsteiner, who caught the Milton secondary napping and cashed in an 80-yard touchdown pass for a 31-17 lead.Etowah cruised through the rest of the second half, only allowing another field goal to in the fourth quarter. Devezin, meanwhile rushed for his second touchdown of the game with 7 minutes to go, which put things out of reach.“The game is about responding to the circumstances that you are dealt, and I thought our defense did a good job responding, and I thought our offense did a good job of pushing it down the field,” Svehla said.Things started rocky for Etowah as Milton took a 7-0 lead on the second play from scrimmage when Cameron Adams bounced to his left and got around the edge for a 75-yard touchdown run.Etowah responded with a 14-play, 80-yard drive in which Ferris capped off with a 22-yard pass to Jackson Sisk to tie the game at 7-all.After Milton punted on its next possession, Troy Simon scooped up an Etowah fumble on the first play of the second quarter and ran it back 30 yards to give Milton a 14-7 advantage.Etowah caught a break midway through the second quarter when Milton fumbled a snap and failed to recover it. Ferris and Co. took over in good field position at Milton’s 36-yard line and, six plays later, Etowah tied the game at 14-all when Blake Jones hauled in a 7-yard touchdown pass from Ferris.Milton went three-and-out on its final possession of the first half, and Etowah took its first lead of the game at 17-14 on a 31-yard Cameron Allen field goal with 27 seconds remaining in the second quarter.Etowah will look to continue its momentum when it hosts Lassiter next week, before entering its second bye week.", "external_links": [], "published": "2015-10-10T10:27:00.000+03:00", "crawled": "2015-10-11T05:02:10.923+03:00", "highlightTitle": ""}