{"organizations": [], "uuid": "fa28052f9344f700583550fac74ccfb9dd5b9ad1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/a67734f693efb21b17e9bd8f989878a8", "site_section": "http://www.news.com.au/sport/american-sports", "section_title": "American Sports | US Sports News | News.com.au", "url": "http://www.news.com.au/sport/american-sports/injury-opens-door-for-jarryd-hayne/story-fnq2nnu6-1227571239491", "country": "AU", "title": "Jarryd Hayne NFL: Carlos Hyde injury opens door for 49ers rookie", "performance_score": 0, "site": "news.com.au", "participants_count": 1, "title_full": "Jarryd Hayne NFL: Carlos Hyde injury opens door for 49ers rookie", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T17:49:00.000+03:00", "replies_count": 0, "uuid": "fa28052f9344f700583550fac74ccfb9dd5b9ad1"}, "author": "Cameron Tomarchio", "url": "http://www.news.com.au/sport/american-sports/injury-opens-door-for-jarryd-hayne/story-fnq2nnu6-1227571239491", "ord_in_thread": 0, "title": "Jarryd Hayne NFL: Carlos Hyde injury opens door for 49ers rookie", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Video Image Jarryd Hayne trains with San Francsico first team 0:28 NFL: Jarryd Hayne continues to impress in the NFL, this week the rookie was seen training with the San Francsico 49ers first team\nOctober 15th 2015 6 days ago /video/video.news.com.au/Sport/More Sports/ Could Jarryd Hayne make his first start at running back?\nCameron Tomarchio news.com.au AN INJURY to first-choice 49ers running back Carlos Hyde has provided an opportunity for Jarryd Hayne to make his first NFL start in just his sixth game.\nHyde walked gingerly from the practice field today with a foot problem, and also missed practice on Wednesday.\nWith back-up Reggie Bush sitting out with a calf injury, the door has opened for Hayne, according to the San Jose Mercury News.\nThe most likely running back option, however, is Mike Davis with suggestions the 49ers coaching still feel it as a risk to throw Hayne in the deep end so soon.\nIn one particularly scathing article — written before the latest Hyde injury development — KNBR.com’s Dieter Kurtenbach said Hayne should be left out of the 49ers game day squad entirely because it was becoming “detrimental” to the team’s chances of winning.\n“Hayne is new to football, and both he and the 49ers have admitted there’s a significant learning curve,” Kurtenbach wrote .\n“If the Niners only asked Hayne to return punts, he wouldn’t be a liability — he’s their best option on special teams.\n“But despite Hayne’s progress in picking up the new sport, it’s clear that Jim Tomsula’s coaching staff does not trust him to play running back at the NFL level.”\nJarryd Hayne and Mike Davis are battling it out for running back duties. Source: Getty Images\nKurtenbach said there was no doubt Davis was the better option.\n“The rookie from South Carolina might not be a change-of-pace guy like Bush, but the Niners coaches have no issue in playing him,” he added.\n“With Bush sidelined, Davis saw 40 snaps in Week Two and 18 in Week Three. He was a poor man’s Hyde and was an above-average pass blocker to boot.\n“Hayne was only needed in emergency situations in those two games, playing a total of six offensive snaps.\n“If Bush’s calf doesn’t cooperate — he missed practice, along with Hyde Wednesday — and he’s sidelined for Sunday’s game, there’s no question that Davis will slide into the backup role, not Hayne. The Australian will be used in emergency roles and will be back to return punts.”\nSan Francisco offensive coordinator Geep Chryst said he expected Hyde to play, explaining their first choice RB might be the type of player who goes through the season with light practices but still suiting up on game day.\n“As the course of the season goes on, you want to make sure that they’re as fresh as possible on game day,” Chryst said.\nChryst drew a comparison between Hyde and Carolina Panthers running back Jonathan Stewart, who “didn’t do a whole lot during the week and then played great on Sundays”.\n“I would expect the same out of Carlos. That’s what Carlos wants to do,” he added.\nJump back to top\nsport breaking news 18:13 PM Live: Victoria closes on second spot 21:14 PM Heartache Hilton: Bulls down dogged CA XI 20:00 PM Giants unapologetic over Treloar, McCarthy 14:28 PM Fanning ‘upset’ by KFC’s shark attack ad 11:07 AM Proteas keeper equals Sachin Tendulkar", "external_links": ["http://cdn.newsapi.com.au/image/v1/external?url=http%3A%2F%2Fcontent4.video.news.com.au%2Ffoxsports%2Fprod%2Farchive%2F2015%2F10%2F15%2FDVU_151015_NFL_HAYNE_TRAINS_WITH_FIRST_TEAM_PKG.jpg&width=650&api_key=kq7wnrk4eun47vz9c5xuj3mc", "http://cdn.newsapi.com.au/image/v1/53bd824ceda282d334c5f932417f1504", "http://cdn.newsapi.com.au/image/v1/origin:fatwire.", "http://cdn.newsapi.com.au/image/v1/a67734f693efb21b17e9bd8f989878a8", "http://www.knbr.com/2015/10/14/kurtenbach-haynes-inexperience-becoming-a-liability-for-49ers/", "http://widgets.outbrain.com/outbrain.js"], "published": "2015-10-16T17:49:00.000+03:00", "crawled": "2015-10-20T17:49:09.939+03:00", "highlightTitle": ""}