{"organizations": [], "uuid": "52a651df36b79a5b4463c9b91cb3ada631cd9ded", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.abqjournal.com", "main_image": "http://main.abqjournal.netdna-cdn.com/wp-content/plugins/journal-open-graph/img/albuquerque-journal.jpg", "site_section": "http://www.abqjournal.com/", "section_title": "Albuquerque and New Mexico News, Sports, Business and more | Albuquerque Journal News", "url": "http://www.abqjournal.com/653336/opinion/putin-outsmarts-feckless-obama.html", "country": "US", "title": "Putin outsmarts feckless Obama", "performance_score": 0, "site": "abqjournal.com", "participants_count": 1, "title_full": "Putin outsmarts feckless Obama | Albuquerque Journal News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T08:02:00.000+03:00", "replies_count": 0, "uuid": "52a651df36b79a5b4463c9b91cb3ada631cd9ded"}, "author": "Charles Krauthammer / Syndicated Columnist", "url": "http://www.abqjournal.com/653336/opinion/putin-outsmarts-feckless-obama.html", "ord_in_thread": 0, "title": "Putin outsmarts feckless Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "“Russia hits Assad’s foes, angering U.S.”\n– Headline, Wall Street Journal, Oct. 1\nWASHINGTON – If it had the wit, the Obama administration would be not angered, but appropriately humiliated. President Obama has, once again, been totally outmaneuvered by Vladimir Putin.\nTwo days earlier at the United Nations, Obama had welcomed the return, in force, of the Russian military to the Middle East – for the first time in decades – in order to help fight the Islamic State.\nThe ruse was transparent from the beginning. Russia is not in Syria to fight the Islamic State. The Kremlin was sending fighter planes, air-to-air missiles and SA-22 anti-aircraft batteries. Against an Islamic State that has no air force, no planes, no helicopters?\nRussia then sent reconnaissance drones over Western Idlib and Hama, where there are no Islamic State fighters. Followed by bombing attacks on Homs and other opposition strongholds that had nothing to do with the Islamic State.\nIndeed, some of these bombed fighters were U.S. trained and equipped.\nAsked if we didn’t have an obligation to support our own allies on the ground, Defense Secretary Ashton Carter bumbled that Russia’s actions exposed its policy as self-contradictory.\nCarter made it sound as if the Russian offense was to have perpetrated an oxymoron, rather than a provocation – and a direct challenge to what’s left of the U.S. policy of supporting a moderate opposition.\nThe whole point of Russian intervention is to maintain Assad in power. Putin has no interest in fighting the Islamic State. Indeed, the second round of Russian air attacks was on rival insurgents opposed to the Islamic State. The Islamic State is nothing but a pretense for Russian intervention.\nAnd Obama fell for it.\nJust three weeks ago, Obama chided Russia for its military buildup, wagging his finger that it was “doomed to failure.” Yet by Monday, he was publicly welcoming Russia to join the fight against the Islamic State.\nHe not only acquiesced to the Russian buildup, he held an ostentatious meeting with Putin on the subject, thereby marking the ignominious collapse of Obama’s vaunted campaign to isolate Putin diplomatically over Crimea.\nPutin then showed his utter contempt for Obama by launching his air campaign against our erstwhile anti-Assad allies not 48 hours after meeting Obama. Which the U.S. found out about when a Russian general knocked on the door of the U.S. Embassy in Baghdad and delivered a brusque demarche announcing that the attack would begin within an hour and warning the U.S. to get out of the way.\nIn his subsequent news conference, Secretary Carter averred that he found such Russian behavior “unprofessional.”\nGood grief. Russia, with its inferior military and hemorrhaging economy, had just eaten Carter’s lunch, seizing the initiative and exposing American powerlessness – and the secretary of defense deplores what? Russia’s lack of professional etiquette.\nMakes you want to weep.\nConsider: When Obama became president, the surge in Iraq had succeeded and the U.S. had emerged as the dominant regional actor, able to project power throughout the region. Last Sunday, Iraq announced the establishment of a joint intelligence-gathering center with Iran, Syria and Russia, symbolizing the new “Shiite-crescent” alliance stretching from Iran across the northern Middle East to the Mediterranean, under the umbrella of Russia, the rising regional hegemon.\nRussian planes roam free over Syria attacking Assad’s opposition as we stand by helpless. Meanwhile, the U.S. secretary of state beseeches the Russians to negotiate “de-conflict” arrangements – so that we and they can each bomb our own targets safely.\nIt has come to this.\nWhy is Putin moving so quickly and so brazenly? Because he’s got only 16 more months to push on the open door that is Obama. He knows he’ll never again see an American president such as this – one who once told the General Assembly that “no one nation can or should try to dominate another nation” and told it again last Monday of “believing in my core that we, the nations of the world, cannot return to the old ways of conflict and coercion.”\nThey cannot? Has he looked at the world around him – from Homs to Kunduz, from Sanaa to Donetsk – ablaze with conflict and coercion?\nWouldn’t you take advantage of these last 16 months if you were Putin, facing a man living in a faculty-lounge fantasy world? Where was Obama when Putin began bombing Syria? Leading a U.N. meeting on countering violent extremism.\nSeminar to follow.\nCopyright, Washington Post Writers Group; email to letters@charleskrauthammer.com .", "external_links": [], "published": "2015-10-03T08:02:00.000+03:00", "crawled": "2015-10-03T09:47:17.183+03:00", "highlightTitle": ""}