{"organizations": ["Chelsea", "West Ham Jose Mourinho"], "uuid": "2205359edee03321aefe9365d9c03a041d59b437", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/81b7735c9f6cce87def7d7bc359761fd.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/football/jose-mourinho-blanks-media-after-being-sent-off-in-chelseas/6984487/", "country": "JE", "title": "Jose Mourinho blanks media after being sent off in Chelsea's loss to West Ham", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "Jose Mourinho blanks media after being sent off in Chelsea's loss to West Ham", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T19:47:00.000+03:00", "replies_count": 0, "uuid": "2205359edee03321aefe9365d9c03a041d59b437"}, "author": "", "url": "http://www.sport.co.uk/football/jose-mourinho-blanks-media-after-being-sent-off-in-chelseas/6984487/", "ord_in_thread": 0, "title": "Jose Mourinho blanks media after being sent off in Chelsea's loss to West Ham", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jose Mourinho"], "text": "Jose Mourinho blanks media after being sent off in Chelsea's loss to West Ham 24 Oct 2015 16:47:05 \ncomments \nJose Mourinho refused to speak to the media after he was sent to the stands during Chelsea's 2-1 defeat at West Ham. \nThe Blues' dreadful season hit a new low as they imploded at Upton Park with midfielder Nemanja Matic, first-team coach Silvino Louro and then Mourinho himself all dismissed. \nEarlier this month, Mourinho was fined £50,000 and given a suspended stadium ban for criticising referee Robert Madley following their loss to Southampton on October 3. \nAnd the embattled Blues boss dodged the usual post-match press conference after his side slumped to their fifth defeat in 10 matches. \nOn Friday Mourinho said his relationship with the media would change after phone camera footage of him walking around in west London was published. \nThe 'Special One' now finds himself as short as 3/1 to be the next Premier League manager to leave his club following what was, even by Chelsea's standards this season, a terrible day at the office. \nTheir meltdown began in the 44th minute when Matic, already on a yellow card after fouling Mauro Zarate, cynically brought down Diafra Sakho to earn his marching orders. \nThe Blues players surrounded referee Jonathan Moss in protest with the official eventually booking Fabregas and skipper John Terry. \nMourinho stood impassively on the touchline but, behind him, the incensed Louro's histrionics saw him removed from the dugout. \nOnly when the Portuguese failed to retake his position pitchside, instead appearing in the stand amidst a flurry of camera phones - which no doubt would not have improved his mood - did word filter out that he too had been sent off. \nMourinho already has a suspended stadium ban hanging over him for previous indiscretions this season and is now likely to find himself in hot water with the Football Association once more. \nAlready trailing to Zarate's 17th-minute strike, Chelsea managed to haul themselves level in the 56th minute after Kurt Zouma and Gary Cahill challenged for Willian's corner, the ball falling kindly for the latter to thrash home. \nHowever, West Ham substitute Andy Carroll had the final say, emerging from the bench to powerfully head in Aaron Cresswell's cross with 10 minutes left to inflict another damaging defeat and one which could yet have serious ramifications for Mourinho and the Blues. Related Sport News", "external_links": [], "published": "2015-10-24T19:47:00.000+03:00", "crawled": "2015-10-25T20:23:31.497+02:00", "highlightTitle": ""}