{"organizations": ["IAC Large School Championship SIMON WHEELER", "Replay Taylor Bennett", "Molly Arnold", "IAC Large School", "Purple Lions", "Tompkins Cortland Community College"], "uuid": "c12f63f9e27e97a6a85b872409b60b0da537db27", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stargazette.com", "main_image": "http://www.gannett-cdn.com/-mm-/60de2ae2c5a0bd08e015f58e557bcb5eca40617a/c=0-151-1498-997&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/17/CNYGroup/Ithaca/635806990901680666-ELM-ND-Dryden-Girls-Soccer-01.JPG", "site_section": "http://rssfeeds.ithacajournal.com/ithaca/sports", "section_title": "Ithaca - Sports", "url": "http://www.stargazette.com/story/sports/high-school/2015/10/17/dryden-tops-notre-dame-girls-soccer-title/74081580/", "country": "US", "title": "Dryden tops Notre Dame for girls soccer title", "performance_score": 0, "site": "stargazette.com", "participants_count": 0, "title_full": "Dryden tops Notre Dame for girls soccer title", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T04:50:00.000+03:00", "replies_count": 0, "uuid": "c12f63f9e27e97a6a85b872409b60b0da537db27"}, "author": "", "url": "http://www.stargazette.com/story/sports/high-school/2015/10/17/dryden-tops-notre-dame-girls-soccer-title/74081580/", "ord_in_thread": 0, "title": "Dryden tops Notre Dame for girls soccer title", "locations": ["Dryden"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Camille Vandermeer", "Maura Glovins", "Taylor Bennett", "Bennett", "Dryden", "Lexi Tracy", "Andrew Legare", "Victoria Schutrum"], "text": "Dryden tops Notre Dame for girls soccer title Andrew Legare, alegare@stargazette.com | @SGAndrewLegare 9:50 p.m. EDT October 17, 2015 Buy Photo Notre Dame's Maura Glovins left, and Dryden's Lexi Tracy try to control the ball during their IAC Large School girls championship game Saturday afternoon at Tompkins Cortland Community College in Dryden. SIMON WHEELER / Staff Photo Fullscreen Buy Photo Notre Dame's Camille Vandermeer, left, and Dryden's Molly Arnold battle for the ball at midfield during their IAC Large School girls championship game Saturday afternoon at Tompkins Cortland Community College in Dryden. SIMON WHEELER / Staff Photo Fullscreen Buy Photo Notre Dame's Victoria Schutrum, left, and Maura Glovins, right attempt to stop Dryden's Taylor Bennett, Saturday afternoon during the IAC Large School Championship game at TC3. Bennett scored both goals in their 2-1 win. SIMON WHEELER / Staff Photo Notre Dame vs Dryden girls soccer IAC Large School Championship SIMON WHEELER / Staff Photo Notre Dame vs Dryden girls soccer IAC Large School Championship SIMON WHEELER / Staff Photo Notre Dame vs Dryden girls soccer IAC Large School Championship SIMON WHEELER / Staff Photo Notre Dame vs Dryden girls soccer IAC Large School Championship SIMON WHEELER / Staff Photo Notre Dame vs Dryden girls soccer IAC Large School Championship SIMON WHEELER / Staff Photo Notre Dame vs Dryden girls soccer IAC Large School Championship SIMON WHEELER / Staff Photo Notre Dame vs Dryden girls soccer IAC Large School Championship SIMON WHEELER / Staff Photo Notre Dame vs Dryden girls soccer IAC Large School Championship SIMON WHEELER / Staff Photo Notre Dame vs Dryden girls soccer IAC Large School Championship SIMON WHEELER / Staff Photo Notre Dame vs Dryden girls soccer IAC Large School Championship SIMON WHEELER / Staff Photo Notre Dame vs Dryden girls soccer IAC Large School Championship SIMON WHEELER / Staff Photo Notre Dame vs Dryden girls soccer IAC Large School Championship SIMON WHEELER / Staff Photo Notre Dame vs Dryden girls soccer IAC Large School Championship SIMON WHEELER / Staff Photo Notre Dame vs Dryden girls soccer IAC Large School Championship SIMON WHEELER / Staff Photo Like this topic? You may also like these photo galleries: Replay Taylor Bennett scores twice as Purple Lions beat Crusaders for second year in a row in IAC Large School final Buy Photo Notre Dame's Camille Vandermeer, left, and Dryden's Molly Arnold battle for the ball at midfield during their IAC Large School girls championship game Saturday afternoon at Tompkins Cortland Community College in Dryden. (Photo: SIMON WHEELER / Staff Photo) Buy Photo 4 CONNECT 8 TWEET LINKEDIN COMMENT EMAIL MORE \nWith her brilliant high school career nearing a close, Dryden senior Taylor Bennett is making the most of her chances in big games. \nThe Purple Lions' career scoring leader scored a goal in each half Saturday afternoon as Dryden beat Elmira Notre Dame for the second straight year in the Interscholastic Athletic Conference Large School girls soccer championship game, taking the rematch by a 2-0 score at Tompkins Cortland Community College in Dryden. The title was the third in four years for Dryden (14-2-1), which beat Lansing on Thursday in a tiebreaker for the IAC North Large School title. \n\"This is my third title being on the team, and it's still exciting,\" Bennett said. \"It doesn't ever get watered down or anything. I don't know that these girls know what they just accomplished. I'm really excited, and I hope they're as excited as I am.\" \nBennett scored the first goal with 7 minutes, 32 seconds remaining in the first half and added the insurance marker with 27:37 to go. Bennett, a two-time Class B first-team all-state pick who has committed to Syracuse University, scored the only goal in last year's 1-0 win over the Crusaders, who lost in the IAC final for the fourth year in a row. \n\"It's disappointing to come up here each year and not perform as well as I think we could have performed,\" Crusaders head coach Steve Weber said. \"We just looked out of sync. The first 15 minutes, we were doing stuff we don't normally do, just trying to play the ball up through the middle of the field. We weren't attacking out wide. We just didn't make adjustments out on the field.\" \nNotre Dame (13-1) came into the game having allowed just one goal this season, and goalkeeper Mackenzie Maloney kept it that way by making a diving save on a Bennett shot from about 15 yards out early in the game. Maloney got to her feet to make another diving stop on the rebound. \nBennett broke free later in the half and ended up on the doorstep of the goal, easily getting the ball past Maloney this time. \n\"She tends to come up big when we need her to,\" said Dryden head coach Janine Bennett, who is Taylor's mom. \"She's just different. She's a force to be reckoned with.\" \nNotre Dame marked Bennett with all-state defender Victoria Schutrum. \n\"When you have a player like that, you have to get support from more than one person,\" Weber said. \"We weren't really getting that all the time. It wasn't just her that beat us today. They were beating us to the majority of 50/50 balls.\" \nNotre Dame's best scoring chance in the first half came on an open shot from Camille VanderMeer, but Dryden goalie Sarah Westcott made the save with relative ease. \nWhen Bennett scored again less than 13 minutes into the second half, that made things even tougher on the Crusaders. Dryden finished with an 8-6 edge in shots. \n\"Our goal in the beginning of the year was to get to this game,\" Janine Bennett said. \"Winning it is icing on the cake. Of course, that was part of our goal, but our focus was to get to the championship game. We dropped it early, we started out real slow this year and have been building, have been building. To get to this point was really outstanding for us.\" \nFourth-seeded Dryden plays again at 3:30 p.m. Tuesday at home against No. 5 Newark Valley in a Section 4 Class B quarterfinal. Top-seeded Notre Dame has a bye in the first round of the Class C tournament and will host either Candor or Sidney in a quarterfinal Friday. \nOn Twitter: @SGAndrewLegare 4 CONNECT 8 TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http://stargaz.tt/1RORdKU TOP VIDEOS", "external_links": [], "published": "2015-10-18T04:50:00.000+03:00", "crawled": "2015-10-18T14:15:34.231+03:00", "highlightTitle": ""}