{"organizations": [], "uuid": "18fdece2b85ba1012da7908a08a5aaa34de96d47", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailyherald.com", "main_image": "http://www.dailyherald.com/gfx/site/logos/dailyherald_marble_300.jpg", "site_section": "http://www.dailyherald.com/rss/feed/?feed=sports_all", "section_title": "DailyHerald.com &gt; Sports", "url": "http://www.dailyherald.com/article/20151025/sports/151029165/", "country": "US", "title": "Chicago Bulls' Hoiberg remembers Saunders", "performance_score": 0, "site": "dailyherald.com", "participants_count": 1, "title_full": "Chicago Bulls' Hoiberg remembers Saunders", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T04:30:00.000+02:00", "replies_count": 0, "uuid": "18fdece2b85ba1012da7908a08a5aaa34de96d47"}, "author": "Mike McGraw", "url": "http://www.dailyherald.com/article/20151025/sports/151029165/", "ord_in_thread": 0, "title": "Chicago Bulls' Hoiberg remembers Saunders", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Chicago Bulls coach Fred Hoiberg considers Flip Saunders one of the biggest influences on his coaching career.\nSo Hoiberg obviously had strong feelings after news broke Sunday that Saunders died at age 60 after battling cancer.\n\"I'm in a little bit of shock right now, I guess,\" Hoiberg said. \"Flip played a huge part in my life, everything from bringing me in and giving me a chance (as a player) to taking a lot of the philosophy that he had.\n\"He was a great mentor, a great leader … a special, special person.\nHoiberg played for Saunders from 2003-05 in Minnesota. After 10 seasons coaching the Timberwolves, Saunders coached Detroit and Washington before returning to the Minnesota bench last year.\nHe was diagnosed with Hodgkin lymphoma in the summer.\n\"You're riding home on a plane, win or lose, Flip was always upbeat, talking to you,\" Hoiberg said. \"He'd sit down and just see how you were feeling. Especially during struggles, he was a fatherly figure.\n\"He was such a caring individual. It's awful how this whole thing went down with the complications from his cancer. It's a sad, sad day. He'll be missed.\n\"There's not one person you could talk to, I think, who would tell you one bad thing about Flip Saunders.\"\nRose's minutes unknown: Coach Fred Hoiberg said he expects Rose to play in Tuesday's season opener at the United Center but isn't sure if Rose will start.\nHoiberg tried his point guard with both units during Sunday's practice.\n\"He was good,\" Hoiberg said. \"He went through every rep in practice today, so I was really pleased with that. He's getting his wind up a little bit.\n\"He was obviously very gassed after both stretches he played over in Nebraska, but he's good.\n\"We probably have to be a little bit careful with him because he hasn't had a ton of reps out there. I don't know how many minutes he'll play on opening night, but it will be good to have him out there.\"\nNo stopping James: When it comes to guarding LeBron James, coach Fred Hoiberg knows there's only so much the Bulls can do.\n\"Jimmy (Butler), I think, did as good a job as anybody last year, as far as trying to guard LeBron,\" Hoiberg said. \"It's a tough cover.\n\"Tony (Snell) had a few reps on him. Jimmy will spend a lot of time on him, but at some point in the game Tony's going to have to try to guard him.\"\nHoiberg's top assistant, Jim Boylen, spent the past two years in San Antonio, so he brought some ideas about playing defense to Chicago.\n\"Jim Boylen brings a different perspective in how they tried to play against Cleveland,\" Hoiberg said. \"Pete Myers, a couple years ago from being at Golden State, has some input as well.\"\nGet great articles like this sent to your inbox! Click here to sign up for the Bulls Newsletter No Thanks Sports NBA Bulls Basketball Pro Men", "external_links": ["https://twitter.com/share"], "published": "2015-10-26T04:30:00.000+02:00", "crawled": "2015-10-26T21:38:20.518+02:00", "highlightTitle": ""}