{"organizations": [], "uuid": "b02cfd846e66c5c3cecdfe3c0cd979bb3ae7aa39", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.contracostatimes.com", "main_image": "http://local.contracostatimes.com/common/dfm/assets/logos/1200x627/contracostatimes.png", "site_section": "http://feeds.contracostatimes.com/mngi/rss/CustomRssServlet/571/225005.xml", "section_title": "Sports", "url": "http://www.contracostatimes.com/sports/ci_28987054/pac-12-football?source=rss", "country": "IL", "title": "Pac-12 football:", "performance_score": 0, "site": "contracostatimes.com", "participants_count": 1, "title_full": "Pac-12 football:", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T09:30:00.000+03:00", "replies_count": 0, "uuid": "b02cfd846e66c5c3cecdfe3c0cd979bb3ae7aa39"}, "author": "Associated Press", "url": "http://www.contracostatimes.com/sports/ci_28987054/pac-12-football?source=rss", "ord_in_thread": 0, "title": "Pac-12 football:", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted: 10/17/2015 11:25:39 PM PDT Updated: 10/17/2015 11:30:42 PM PDT Notre Dame 41, USC 31: Corey Robinson made a diving catch in the end zone midway through the fourth quarter and the No. 14 Irish rebounded to beat the Trojans on Saturday in South Bend, Indiana, after squandering a two-touchdown lead. C.J. Prosise ran for 143 yards and two touchdowns, and DeShone Kizer threw two scoring passes, the second the 10-yarder to Robinson that made it 38-31. \nSouthern California (3-3) played for the first time since firing coach Steve Sarkisian on Monday. Clay Helton directed the Trojans as interim coach. \nUSC athletic director Pat Haden was feeling lightheaded just before kickoff and was taken to the locker room. Haden made a stop at the hospital, then headed back to Los Angeles on a private plane. \nThe Fighting Irish (6-1) bounced back from an embarrassing 35-point loss to USC in the regular-season finale last year. Utah 34, Arizona State 18: Travis Wilson threw for 297 yards and two touchdowns and No. 4 Utah remained the lone undefeated team in the Pac-12. Special teams nearly buried the Utes. Tim White had a 100-yard kickoff return for a touchdown to put Arizona State on the board in the first quarter. De'Chavon Hayes' 48-yard punt return set up a field goal that gave the Sun Devils a 10-7 lead. Utah (6-0, 3-0) gave up a safety on a failed trick kickoff return and Arizona State (4-3, 2-2) added three more points on the ensuing possession to take an 18-14 lead. Advertisement \nDevontae Booker put Utah ahead for good at 21-18 on a 25-yard touchdown run in the fourth quarter. Oregon 26, Washington 20: Oregon quarterback Vernon Adams Jr. returned after missing the previous two games with an injured finger on his throwing hand to throw for 272 yards and two touchdowns, and the Ducks won their 12th straight over Washington. Adams threw touchdown passes of 36 and 9 yards to Darren Carrington, returning after missing the first six games of the season. Washington's Myles Gaskin rushed for 155 yards including a 72-yard touchdown and Jake Browning threw a 3-yard TD to Jaydon Mickens with 3:35 left, but there was no miracle finish for the Huskies. Washington State 52, Oregon State 31: Luke Falk tied the school record with six touchdown passes, all in the first half, as the Cougars beat the Beavers. Washington State (4-2, 2-1 Pac-12), coming off an upset victory at Oregon, hadn't beaten a Pac-12 opponent in Martin Stadium in Pullman, Washington, since November 2013. \nThe Cougars have already eclipsed last season's three-win total, and this was the 100th win of coach Mike Leach's career. \nGiving up over 40 points for the third straight week, the Oregon State Beavers fell to 2-4, 0-3. Arizona 38, Colorado 31: Jared Baker ran for a career-high 207 yards and scored three touchdowns, powering Arizona past Colorado. Baker scored untouched on runs of 79 and 45 yards and then hauled in a 25-yard pass from Anu Solomon to break a 24-all tie in the fourth quarter. That play capped a 94-yard drive and followed a 97-yard drive sparked by backup QB Jerrard Randall. \n-- ASSOCIATED PRESS", "external_links": [], "published": "2015-10-18T09:30:00.000+03:00", "crawled": "2015-10-18T09:34:29.484+03:00", "highlightTitle": ""}