{"organizations": [], "uuid": "a553b73056a110bdae295d6c25ac508dc8eefb3a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "http://s3.reutersmedia.net/resources/r/?m=02&d=20151016&t=2&i=1087391080&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB9F06Q", "site_section": "http://www.reuters.com/news/sports", "section_title": "Sports News, Highlights &amp; Coverage | Reuters.com", "url": "http://www.reuters.com/article/2015/10/16/us-golf-world-kuchar-idUSKCN0SA0HA20151016", "country": "US", "title": "Team man Kuchar buoyant about World Cup change", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Team man Kuchar buoyant about World Cup change | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T10:50:00.000+03:00", "replies_count": 0, "uuid": "a553b73056a110bdae295d6c25ac508dc8eefb3a"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/10/16/us-golf-world-kuchar-idUSKCN0SA0HA20151016", "ord_in_thread": 0, "title": "Team man Kuchar buoyant about World Cup change", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MELBOURNE Matt Kuchar has applauded the decision to switch the World Cup of Golf back to a team-based competition after a much-criticized format change saw the last edition dominated by an individual-focused tournament.\nWorld number 16 Kuchar partnered Gary Woodland to win the World Cup for the United States in China in 2011 but was left cold by the 2013 tournament in Melbourne, which placed the emphasis on individual strokeplay.\nThe individual tournament, won by Australia's Jason Day at Royal Melbourne, hogged the lion's share of the prize money and left the team component, won by Day and Adam Scott, an afterthought.\n\"I think that's the right decision for the tournament,\" Kuchar told reporters after taking a two-stroke lead at the Fiji International after a windy second round on Friday.\n\"I think it needs to go back to what it was. You look at the list of champions -- the list of champions is as good a list as maybe there is in golf.\n\"The teams that have partnered up from the Jack (Nicklaus) and Arnies (Arnold Palmer) to the Davis Love and Fred Couples -- might have a Tiger (Woods) and David Duval on there.\n\"It's quite impressive that list of champions.\n\"I think great players enjoy playing that different format, for a team format, getting to have a partner, to have some fun with a partner and challenge some good golf courses.\n\"I've played the team format, I've played the individual format, I think the team format is much more fun and more alluring to the top players.\n\"The top players play enough stroke-play events.\"\nThe 2016 tournament will return to Melbourne where there will be no individual event, only two-man teams from each country playing four rounds of 'best ball' and 'alternate shot' -- the modes used in the Presidents Cup.\nThe highest-ranked player from each participating country has the chance to select a partner.\nA huge fan of Melbourne's sand-belt courses, Kuchar has toured them a number of times and was a member of the United States' victorious Presidents Cup team at Royal Melbourne in 2011.\nOrganizers have yet to pick a venue for the 2016 World Cup, but 37-year-old Kuchar left them in little doubt where his sympathies lay.\n\"I think Royal Melbourne's a fantastic golf course and it would be a great draw for the tournament,\" he said.\n(Reporting by Ian Ransom ; Editing by Peter Rutherford )", "external_links": [], "published": "2015-10-16T10:50:00.000+03:00", "crawled": "2015-10-16T10:41:49.885+03:00", "highlightTitle": ""}