{"organizations": [], "uuid": "c46753eeafc8fea4a07f977a516a6f18ec021383", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribtown.com", "main_image": "http://d1bdhkmqqz901h.cloudfront.net/1200x630/smart/s3.amazonaws.com/hne-smedia/9/2/9202da43e4c24db1bbe20ab7d003ea01/web_full_663849899689.jpg", "site_section": "http://www.tribtown.com//feed/sec/6000", "section_title": "TribTown.com - Sports News", "url": "http://www.tribtown.com/view/story/9202da43e4c24db1bbe20ab7d003ea01/CAR--Safer-IndyCar", "country": "US", "title": "IndyCar Series still taking long, hard look at complicated issue of finding safer ways to race", "performance_score": 0, "site": "tribtown.com", "participants_count": 0, "title_full": "IndyCar Series still taking long, hard look at complicated issue of finding safer ways to race", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T03:03:00.000+03:00", "replies_count": 0, "uuid": "c46753eeafc8fea4a07f977a516a6f18ec021383"}, "author": "", "url": "http://www.tribtown.com/view/story/9202da43e4c24db1bbe20ab7d003ea01/CAR--Safer-IndyCar", "ord_in_thread": 0, "title": "IndyCar Series still taking long, hard look at complicated issue of finding safer ways to race", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["MICHAEL MAROT"], "text": "IndyCar Series still taking long, hard look at complicated issue of finding safer ways to race By MICHAEL MAROT AP Sports Writer   8:02   8:03   \nPeople: \nIndiana (876) \nINDIANAPOLIS — Mark Miles will never forget the first time he saw an IndyCar driver seriously hurt. \nIt was October 2013, after a race at Fontana. When he walked into the hospital room, he found Justin Wilson lying in bed, awake and alert with a bunch of tubes attached to his body. \nAs the CEO of IndyCar's parent company talks about it now, a little more than a month after Wilson died from a head injury sustained in another racing accident, there's a pause to gather his thoughts and remind everyone that IndyCar's first mission is to make the high-risk sport of open-wheel racing safer. \n\"There's been a lot of sadness,\" Miles said Tuesday after nearly 600 people gathered to give Wilson one final salute at Indianapolis Motor Speedway. \"On safety, I think the drivers know the work is ongoing. It's our highest priority.\" \nThe recent series of wrecks and scary moments has left series officials with no choice. \nIn August, Wilson was fatally injured at Pocono after being hit by a piece of debris from another car. Four years ago, two-time Indianapolis 500 champ Dan Wheldon was killed during a race in Las Vegas after his car went airborne and hit a support pole along the catch-fence. In 2013, a horrific crash in Houston left four-time IndyCar champ and three-time 500 winner Dario Franchitti with such a severe concussion he was forced to retire. Two weeks later, Wilson broke his pelvis and bruised a lung when he got T-boned by another car — an image Miles has never allowed to fade away. \nBut what happened this season has put safety front and center once again in the IndyCar world. \nThe season opened with mounting concern over large debris fields from the new chasses, so series officials instructed the two engine manufacturers to makes structural upgrades to the cars. \nWhen Indianapolis was turned upside-down after three cars flipped over in practice, series officials slowed everyone down by taking away the extra horsepower. \nWhen another popular driver, James Hinchcliffe, sustained life-threatening injuries May 18 after a broken suspension piece pierced his left leg at Indy, the series made an equipment change to prevent a repeat. \nWilson's death has ramped up calls to find other forms of life-saving protection. \n\"I'm mad that for no explainable reason, Justin had to be ripped away from us. What are the odds of what happened to him?\" sports car owner Michael Shank said during the 50-minute celebration of Wilson's life. \"I'm mad that Justin had to be taken away from this world for race-car safety to be re-examined.\" \nMiles has met twice over the past two weeks with a handful of drivers to hear suggestions, get advice and re-inforce the series' stance about putting safety first. \nThe bigger debate will be over solutions. \nDr. Terry Trammell, an IndyCar safety consultant and a member of the Global Institute for Motorsports Safety, has spent more than two decades working with Formula One looking for ways to reduce objects from getting into the cockpits. \nWhat they have found is that the solutions usually proposed — such as placing a canopy or \"halo\" device over the top of open-wheel cockpits — have actually produced additional problems. \nFor instance, Trammell said, that the original concept of using a deflector shield protected drivers but launched large objects long distances and at great velocities, putting other drivers and even fans in harm's way. \nAdditional tests have found that lowering the shield could cause punctures in the safety piece. \nEngineers later tested a protective windshield-like device, but the drivers thought it impaired their vision. The latest design calls for a center post to be attached to a car's chassis with a flat hoop over the drivers head. And while it has shown promise, it is not foolproof. \n\"It keeps the big things, like a tire, out of the cockpit. The smaller objects would still get through to the driver,\" Trammell said. \"Though smaller, they would presumably have less mass but they could have more velocity. ... And it not only has to prevent the material from entering the drivers' space, it has to be strong enough not to break.\" \nSome traditionalists believe placing any device over the open cockpit would change the sport. \nBut drivers like Hinchcliffe, an IndyCar safety committee member, disagree. \n\"I think any solution that helps saves drivers' lives is pro-traditional,\" Hinchcliffe said. \"That argument, in my opinion, is a stupid one. But there is no one solution right now that doesn't create other problems, so we need to keep looking.\" \nMiles intend to do just that — even if a solution is five or more years away as Hinchcliffe and Trammell both believe. \n\"There's basically two things we can do, everything can be tethered and we can protect the cockpit,\" Miles said. \"If we had a good answer, it would be on there by now.\" \n ", "external_links": [], "published": "2015-10-01T03:03:00.000+03:00", "crawled": "2015-10-01T03:52:58.613+03:00", "highlightTitle": ""}