{"organizations": ["NC State"], "uuid": "b5a2d91fda8996e6cdb215c551b8440be5999e4e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wralsportsfan.com", "main_image": "http://wwwcache.wralsportsfan.com/asset/soccer/2015/10/01/14940471/14940471-1443718818-646x485.jpg", "site_section": "http://www.wralsportsfan.com/news/rss/697/", "section_title": "Sports Fan stories from WRAL.com", "url": "http://www.wralsportsfan.com/nc-state-celebrates-soccer-legacy/14940414/", "country": "US", "title": "NC State celebrates soccer legacy", "performance_score": 0, "site": "wralsportsfan.com", "participants_count": 0, "title_full": "NC State celebrates soccer legacy", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T20:03:00.000+03:00", "replies_count": 0, "uuid": "b5a2d91fda8996e6cdb215c551b8440be5999e4e"}, "author": "", "url": "http://www.wralsportsfan.com/nc-state-celebrates-soccer-legacy/14940414/", "ord_in_thread": 0, "title": "NC State celebrates soccer legacy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NC State celebrates soccer legacy \nPosted 1:03 p.m. today Your friends e-mail addresses (comma separated): * Subject: * Are you human? * You must enter the characters with black color that stand out from the other characters \nAfter starting their season with a 9-1 record, the 1990 NC State men’s soccer team lost three of five matches entering their final regular season home game against UNC-Greensboro. Like the Wolfpack soccer squads of yore, it appeared this team was destined for the same late-season swoon that had befallen their talent-laden predecessors. \nHenry Gutierrez, the team’s leading scorer and co-captain, was suspended for the game against UNC-G along with senior striker Tommy Tanner. Then the bombshell: head coach George Tarantini sat Roy Lassiter, the team’s second-leading goalscorer, and Dario Brose, their All-American midfielder, for reasons no one can remember. “It was probably something we did in training or something like that,” Lassiter says. \nSophomore defender Scott Schweitzer was sent off with a red card early in the match. Tarantini soon followed him, ejected with the Pack trailing at halftime. \nDuring intermission, the players implored assistant coach Dennis Allen to insert Lassiter and Brose, and he obliged. The team was so angry at themselves that many discarded their shin guards, optional equipment at the time. \nWith Tarantini peering through an adjacent hedgerow, Lassiter and Brose combined for three second-half goals as the Wolfpack came back to win, 4-3. \n“Dario and I got in the game, and we iced them up,” Lassiter recalls. “Coach was still screaming through the bushes. You couldn’t see him, but he was screaming, ‘Run, run, run!’ Henry and Tommy were cheering on the sidelines. We took off our shin guards, and we just played.” \nNC State won their next six games, twice upending mighty Virginia to win the ACC Championship and advance to the NCAA Men’s College Cup, college soccer’s version of the Final Four. To this day, it’s the only Wolfpack soccer team to accomplish either feat. \nOn the 25th anniversary of their ACC Championship and College Cup run, the 1990 NC State team will be honored at halftime of this Saturday’s home football game against Louisville, as well as Sunday’s home soccer match against Notre Dame. \nMany of the players and coaches are reuniting in Raleigh for the occasion, some traveling from as far away as Europe and South America. But while its athletic accomplishments are singular in Wolfpack soccer history, the 1990 NC State team’s most enduring legacy is its ongoing contribution to the Triangle soccer community. “We knew we had the goods” \nNC State was runner-up to the ACC Championship four out of the six years preceding 1990. But even with such legendary All-Americans as Sam Okpodu, Chris Ogu and Tab Ramos, the Wolfpack never hoisted the conference crown. Indeed, the school had never won a game in the NCAA Tournament. \n“We bonded over the fact that NC State was always the team that had fallen short of expectations,” says Curt Johnson, the 1990 team’s senior co-captain. “The program had incredible players, like Tab Ramos. But we ultimately hadn’t had great success or championships. We were the consummate underdogs.” \nPropelled by the comeback win over UNC-Greensboro, NC State rolled through the opening two matches of the conference tournament, played in Durham. The Wolfpack dispatched both Maryland and Clemson by 3-1 margins. That set the stage for a championship showdown against the Virginia Cavaliers, coached by Bruce Arena. \nVirginia had won the ACC title four of the last seven seasons and was co-national champions in 1989. Moreover, NC State hadn’t beaten the Cavaliers since 1981. The 3-2 overtime loss at Virginia a month earlier was the first time the Wolfpack had netted a goal against the Cavaliers since 1985. \n“We knew that to get where we wanted to go – winning the ACC championship and through the NCAA Tournament – we had to go through Virginia,” Gutierrez says. \nThe Wolfpack defeated Virginia 2-1 to win the ACC Championship. Gutierrez was named tournament MVP along with winning ACC Player of the Year. Gutierrez, Lassiter, Brose, Tanner, Alex Sanchez and Erwin Aguilera were named to the All-Tournament team. \nNC State next ousted South Carolina in the second round of the NCAA Tournament, the school’s first-ever NCAA tourney win. Then just three weeks after beating Virginia in the ACC final, the Pack hosted the Cavaliers for the right to advance to the College Cup. \nThe teams were tied 1-1 at the end of overtime, with Brose scoring the Wolfpack’s lone goal. Seven frames were ultimately required for State to topple Virginia 7-6 in a penalty shootout. \n“That game was hard as nails, and we wanted it really, really bad,” Lassiter remembers. “The game came down to PKs, and that’s what it was going to take to beat Bruce Arena and Virginia. They were an outstanding side, but we knew we were good, too. We knew we had the goods, and knew we could beat anyone at anytime, anywhere.” \nFive days later, the Wolfpack traveled to Tampa, Fla., to face UCLA in the national semifinals. The Bruins, coached by Sigi Schmid, featured some of soccer's biggest names, including past and future World Cup players Cobi Jones, Brad Friedel, Joe-Max Moore, Chris Henderson and Mike Lapper. \nNC State took the attack to UCLA, pelting them with an astounding 33 shots. The Bruins also played a man down for the final 28 minutes of regulation and overtime. But the Wolfpack – which outscored their opponents by a combined 72-26 margin that season – couldn’t muster a goal. \n“It basically became a one-sided game: us trying to score on [goalkeeper] Brad Friedel,” Gutierrez says. “It was a shooting gallery on Friedel, but we couldn’t get one by him.” \nThe scoreless game eventually went to a penalty kick shootout, and with Friedel – one of the greatest goalkeepers in American soccer history – minding the net, NC State fell 5-3. \nNC State’s flight home didn’t depart until the day after the national championship final. When the Wolfpack players walked into the stadium to watch UCLA win the NCAA title over Rutgers, the 4,600 spectators gave them a standing ovation. \n“I think what that showed was the level of respect for the way we played, the talent we had on our team and – whether we won the national championship or not – that we were the best team,” Johnson says. A long list of accomplishments for Coach Tarantini \n“Oh boy – Tarantini, Tarantini,” Lassiter says, sounding suddenly inundated with a rush of bygone memories. “He’s a person who you love one day, and you don’t like the next day. You never knew what you were going to get from Tarantini back in those days.” \nGeorge Tarantini is the winningest soccer coach in NC State history. When he retired after the 2010 season, he had served the Wolfpack program for 29 years, 25 of them as its head coach. Tarantini earned ACC Coach of the Year honors in 1992 and 1994. He produced 12 All-Americans and four ACC Players of the Year during his tenure. And he accomplished much of this against such esteemable ACC coaching contemporaries included Arena, Duke’s John Rennie, I.M. Ibrahim at Clemson, and both Anson Dorrance and Elmar Bolowich at North Carolina. \nBut the stories of Tarantini’s eccentricity are as legendary as his coaching accomplishments, from his touchline gesticulations to his occasional unorthodox tactics, like purposefully playing one or more men down when upset at his players in order to impart some indefinite lesson. \n“He comes from a particular background of the game, with his brother Alberto playing in the 1978 World Cup,” Gutierrez explains. “He grew up in the Argentina environment, and he understood the game extremely well. Yes, sometimes his message and how he got it across was strong at times. But he didn’t just care about you as a player or part of the team, but made sure that you became a young man. He always taught that we needed to be good people outside the game of soccer. Sometimes the words were strong. But he was a teacher.” \nTarantini’s biggest imprint on college soccer was a technical, attacking style of play imported from his native Argentina. \n“He was one of the first people in college soccer who outspokenly attached himself to attacking soccer,” Johnson says. “Now it’s commonplace—every coach does that. But it wasn’t commonplace then. He wanted to entertain fans and wins games with a possession, technical style and attack-minded mentality. And that was not the usual form at all. \n“He was ahead of his time as it relates to college soccer and soccer in general in the United States.” \nFollowing NC State’s 1990 conference championship, Virginia reeled off five straight ACC titles and four consecutive NCAA Championships. Saddled with increasingly substandard soccer facilities, NC State didn’t appear in the ACC Championship final again until 2009, the year after the opening of Dail Soccer Field. NC State also returned to the NCAA Tournament that season for the first time since 2005. \n“Coach Tarantini was extremely passionate,” Lassiter admits. “He loved this game, he knew this game. He was an old school-type coach, so I wouldn’t say all the dynamics of a coach were there. I wouldn’t even say his ability to communicate with players was there. He liked when players could play soccer. He wanted to win for sure, and he would come outside of himself to win.” State players turn to teaching the game \nGutierrez earned his second straight All-American and ACC Player of the Year honors in 1991. Schweitzer won both awards in 1992. When the ACC named its 50th Anniversary soccer team in 2002, four members of the 1990 NC State squad were among the 50 players chosen: Gutierrez, Lassiter, Brose and Schweitzer. \nBut in the pre-Major League Soccer era, the options for professional soccer in America were limited to lower divisions and indoor leagues. Gutierrez, Brose and Schweitzer bounced around the lower leagues of French football for several seasons, with Brose also ending up in Germany. Lassiter played five years in Costa Rica. By 1994, Gutierrez, Schweitzer, Tanner and Dewan Bader were teammates on the Cleveland Crunch indoor soccer team, where they won the 1996 NPSL championship. Schweitzer and Tanner were also teammates on the Rochester Rhinos, where in 1999 they were part of the last team outside of MLS to win the U.S. Open Cup. \nWhen MLS launched in 1996, Lassiter joined the Tampa Bay Mutiny. He scored a league-best 27 goals that year, an MLS single-season record that still stands. Despite only playing seven seasons in MLS, his 88 career goals is tenth-most in league history. Lassiter, also a graduate of Athens Drive High School in Raleigh, was inducted into the N.C. Soccer Hall of Fame in 2011. \nPerhaps the most intriguing post-NC State career belongs to a player who didn’t appear at all during the 1990 season: Roberts Gibbs, a backup goalkeeper. Gibbs became a political advisor and press secretary, most notably for President Obama from 2009-2011. Today, Gibbs is executive vice president and chief communications officer for McDonald’s. \nStill, for all their on-field accolades, the 1990 NC State team’s biggest impact is the number of former players who are furthering soccer at all levels throughout the Triangle. \nSchweitzer became the first head coach of the Carolina RailHawks for their inaugural 2007 and 2008 seasons. He was also director of Next Level Academy in Morrisville. \nAfter serving as general manager of the Richmond Kickers and Kansas City Wizards, Johnson became president of the RailHawks in 2011. In 2013, Johnson was inducted in the N.C. Soccer Hall of Fame. \nAfter co-founding Next Level Academy, Bader and Marlow Campbell have been Directors of Coaching for Triangle Futbol Club (now TFC Alliance) since 2004. Bader is an assistant coach for the RailHawks and served as head coach of the Carolina RailHawks U-23 team, winning the USASA National Championship in 2011 & 2013. Gutierrez is the Holly Springs-Fuquay Varina regional director for TFCA. \nAfter directing youth development for TFC, Brose co-founded Wake Futbol Club in 2002. David Allred, the starting goalkeeper on the 1990 team, is currently executive director of Wake FC. \n“We were unified as a group and team, and we took care of each other,” Gutierrez says. “So over time, it was inevitable that if we ended up in the same area we were going to look out for one another.” Fond memories of success at State \n“Those were the last days of being a kid,” Johnson says wistfully. “The reality was we were standing on the field one day, you lose narrowly in a penalty kick shootout in the national semifinals and two days later you’re back on campus for exams. College was nearly over, there was no real pro soccer opportunity at that moment and graduation is right around the corner. \n“For a couple of weeks, we were the big men on campus. But then, I’ll tell you, life changes quickly.” \nNo matter where life took the members of the 1990 NC State soccer team, they still share an affection for both soccer and their alma mater. \n“I loved NC State when I was there, athletically and socially,” says Lassiter, who today coaches youth academy soccer in Temecula, California. “I loved everything about it. And I was on a fantastic team with a fantastic group of players.” \n“I spent four great years at NC State and enjoyed every minute of it,” Gutierrez adds. “I wouldn’t trade it for anything in the world.” \nYet one question persists: Did George Tarantini intentionally get himself ejected from that UNC-Greensboro game so it would fall on his assistant, not himself, to acquiesce and sub Lassiter and Brose into the game? \n“George would do something like that, seriously,” Lassiter says. Credits Reporter Neil Morris \nCopyright 2015 by Capitol Broadcasting Company. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Triangle Area Special Offers", "external_links": [], "published": "2015-10-01T20:03:00.000+03:00", "crawled": "2015-10-02T06:20:56.733+03:00", "highlightTitle": ""}