{"organizations": [], "uuid": "5e68abc7aaea8be9a2c75d817469d6df1999cc4c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "mndaily.com", "main_image": "http://mndaily.com/", "site_section": "http://www.mndaily.com//rss/sports", "section_title": "Sports", "url": "http://mndaily.com/sports/volleyball/2015/10/15/minnesota-drops-badgers", "country": "US", "title": "Minnesota drops Badgers", "performance_score": 0, "site": "mndaily.com", "participants_count": 1, "title_full": "Minnesota drops Badgers", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T16:59:00.000+03:00", "replies_count": 0, "uuid": "5e68abc7aaea8be9a2c75d817469d6df1999cc4c"}, "author": "jthomas@mndaily.com", "url": "http://mndaily.com/sports/volleyball/2015/10/15/minnesota-drops-badgers", "ord_in_thread": 0, "title": "Minnesota drops Badgers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Gophers had to rally after losing the first set on the road to Wisconsin. By Emily Polglaze October 15, 2015 The Gophers volleyball team earned a tight road victory against the University of Wisconsin-Madison Wednesday evening, in their sixth extra-set match of the season. The No. 11 Gophers improved to 14-3 overall and 6-1 in the Big Ten with the victory. “I was impressed with the way we battled,” head coach Hugh McCutcheon said. “It was a difficult match, and Wisconsin is a very strong opponent, and the kids fought.” The Badgers got off to a 6-3 lead in the first set after winning a challenge. Tapp answered with a kill, but the Badgers went on a four-point run, and the Gophers took a timeout down 9-4. A strong attack by Wisconsin kept the Gophers from finding a rhythm, and they dropped the first set 25-11. Minnesota started the second set stronger, getting a 4-1 lead off of a Paige Tapp kill, assisted by freshman setter Samantha Seliger-Swenson. Later, Wisconsin fought back, and a Minnesota error narrowed the Gophers lead to 12-11. A pair of Daly Santana kills and a Wisconsin error put Minnesota back on top 16-14. Wisconsin stayed close behind, and Minnesota took a timeout leading 21-19. From there, Minnesota went to set point, but Wisconsin strung together four quick points to make it 24-24. A Badgers error put Minnesota back to set point again, and a Paige Tapp kill ended the set 26-24, knotting the teams 1-1. “In the first set, we were out of rhythm and not completely balanced in all aspects of the game,” Seliger-Swenson said. “But going into that second set we really unified … We had more discipline.” The Gophers got out to an early 6-3 lead in the third set as Santana tallied her second ace of the night. Wisconsin went on a three-point run of their own, but back-to-back Santana kills got the Badgers to take a timeout with the Gophers leading 11-6. Another Santana kill took the Gophers to set point, and they finished the set with a 25-16 victory. The fourth set opened with back-to-back Wisconsin points, but Minnesota took advantage and went up 6-2 on a Seliger-Swenson kill, forcing a Wisconsin timeout. The timeout gave the Badgers some life, and they went up 7-6, making the Gophers take a timeout of their own. The teams went back-and-forth for the rest of the set, with the Badgers ultimately taking the set 26-24 to force an extra set. In the fifth set, Minnesota broke an early tie and went up 7-3. The Badgers were able to tally three straight points to cut their deficit to 8-6, but it wasn’t enough. Minnesota took the final set 15-11 and claimed the match 3-2. The start of a two-part border battle, Minnesota will face Wisconsin again at home on Saturday . “We won’t have any expectations, and we’ll come out strong on the first point,” Santana said.", "external_links": [], "published": "2015-10-15T16:59:00.000+03:00", "crawled": "2015-10-15T18:27:06.526+03:00", "highlightTitle": ""}