{"organizations": ["Giants Sports Eagles", "NFL", "AP", "Giants Philadelphia Eagles"], "uuid": "d011753d28d54f3042f64d9699f2cef02b2fa623", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtontimes.com", "main_image": "http://media.washtimes.com.s3.amazonaws.com/media/image/2015/10/16/59dae4185cbae82e840f6a706700c4f9.jpg", "site_section": "http://www.washingtontimes.com/rss/headlines/sports/", "section_title": "www.washingtontimes.com stories: Sports", "url": "http://www.washingtontimes.com/news/2015/oct/16/eagles-look-to-avoid-slow-starts-vs-giants/", "country": "US", "title": "Eagles look to avoid slow starts vs. Giants", "performance_score": 0, "site": "washingtontimes.com", "participants_count": 0, "title_full": "Eagles look to avoid slow starts vs. Giants", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T00:12:00.000+03:00", "replies_count": 0, "uuid": "d011753d28d54f3042f64d9699f2cef02b2fa623"}, "author": "", "url": "http://www.washingtontimes.com/news/2015/oct/16/eagles-look-to-avoid-slow-starts-vs-giants/", "ord_in_thread": 0, "title": "Eagles look to avoid slow starts vs. Giants", "locations": ["Philadelphia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sam Bradford", "Rourke"], "text": "Sports Eagles look to avoid slow starts vs. Giants Philadelphia Eagles quarterback Sam Bradford (7) throws a pass at the NFL football team’s practice facility, Thursday, Oct. 15, 2015, in Philadelphia. (AP Photo/Matt Rourke) more > By -   \nPHILADELPHIA (AP) - As quarterback Sam Bradford goes, so go the Philadelphia Eagles. Or is it the other way around? \nBoth Bradford and the Eagles have gotten off to poor starts in four of the team’s five games this season. They also have had good turnarounds in the second halves in three of the five games. \nHere are the numbers: \nFirst half - Bradford has completed 54 of 96 passes (56 percent) with two touchdowns and three interceptions for a quarterback rating of 65.6. The Eagles have been outscored 53-37. \nSecond half - Bradford has completed 66 of 94 passes (70 percent) with six touchdowns and three interceptions for a quarterback rating of 102.0. The Eagles have outscored their opponents 80-50. \n“I think there have been some times where we have just gotten into a rhythm in the second half, not just me but the offense as a whole,” Bradford said as he prepared to face the New York Giants on Monday night. “Obviously, we’d like to start faster in the first half. Last week (against New Orleans), take away my turnovers, and we started fast. We had 300 yards in the half, if I don’t turn the ball over twice, it’s probably 24-7.” \nBradford threw two end-zone interceptions against the Saints and the Eagles led just 10-7 at the half. In the second half the team scored on all six possessions. \n“I think it is the adjustments sometimes,” Bradford said. “We figure out how exactly they’re playing us and we figure out a way to beat it. Maybe we need to make those adjustments quicker.” \nPhiladelphia coach Chip Kelly joked this week that maybe the team could play a game earlier in the day. \n“See if we get a scrimmage going before it, a doubleheader,” Kelly said. “He’d be great at a doubleheader. That would be awesome. \n“I don’t know, we’ll talk to him a little bit about it, but I think he needs to see some things, and it kind of seems like he gets settled. He’s one of those guys where if he gets hit, he feels a little bit better, but you also don’t want to have him get hit. So, I don’t have an answer for that. But I think it’s not just Sam, it’s the whole offense that’s starting slowly.” \nNOTES: Four players remained out of practice and will likely miss Monday’s game. Linebackers Kiko Alonso (knee) and Mychal Kendricks (hamstring), wide receiver Nelson Agholor (leg) and defensive end Brandon Bair (groin) all sat out practice for the fourth straight day. Running back Ryan Mathews (hamstring) was limited in practice. \n___", "external_links": [], "published": "2015-10-17T00:12:00.000+03:00", "crawled": "2015-10-17T01:33:23.795+03:00", "highlightTitle": ""}