{"organizations": [], "uuid": "a42c99ae671b56e261f97a74091031ae340f891c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.themaneater.com", "main_image": "http://www.themaneater.com/media/2015/1021/photos/fbKentrell009O_jpg_900x600_q85.jpg", "site_section": "http://www.themaneater.com/feeds/sections/sports/", "section_title": "The Maneater: Sports", "url": "http://www.themaneater.com/stories/2015/10/21/kentrell-brothers-ncaas-tackles-leader/", "country": "US", "title": "Kentrell Brothers is NCAA’s tackles leader", "performance_score": 0, "site": "themaneater.com", "participants_count": 1, "title_full": "Kentrell Brothers is NCAA’s tackles leader", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T08:00:00.000+03:00", "replies_count": 0, "uuid": "a42c99ae671b56e261f97a74091031ae340f891c"}, "author": "Alec Lewis", "url": "http://www.themaneater.com/stories/2015/10/21/kentrell-brothers-ncaas-tackles-leader/", "ord_in_thread": 0, "title": "Kentrell Brothers is NCAA’s tackles leader", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Google+ \nOn Dec. 30, 2013, coach Gary Pinkel said then-sophomore Kentrell Brothers had “similar abilities” to Sean Weatherspoon. \nTwo SEC East championships later, Brothers, a linebacker, has recorded 91 tackles through seven games. How many did Weatherspoon have through seven games in 2008, the year he led the NCAA in tackles? 78. \nHeading into Nashville, Tennessee, to face Vanderbilt this weekend, the Tigers have only allowed 12.9 points per game, which is good enough for sixth in the nation. Without the front-seven led by Brothers, there’s no telling where this Missouri team would be. \n“It’s never a point fingers type of thing (with the offense and the defense),” junior linebacker Michael Scherer said. “We all know the offense isn’t doing well, nobody needs to bring it up or point it out, we’re just going to go about our business and do what we do.” \nBrothers might not bring that up, but he’ll find another way to get inside your head. \nSmack talk is prevalent among locker room conversations with Brothers, says senior free safety Ian Simon. Be it video games, hunting or other sports, Brothers always finds a way to claw at something. \n“Kentrell is the type of the guy in the locker room where he’ll just go up to you and start talking smack about anything,” Simon said. “There’s tons of Kentrell stories you could tell, he’s an off-the-wall kind of guy, and you never know what you’re going to get from him.” Going back down the line of D-line Zou talents and defensive talents that played at Faurot, from Weatherspoon to Kony Ealy, the progression made by Brothers is similar. \nSmall towns sparked a strong work ethic in these linemen. Ealy has New Madrid. Weatherspoon has Jasper, Texas. Brothers has Guthrie, Oklahoma. \nThen, it’s the discipline in Mizzou’s weight room, in the classroom and with their team that propel them on the field. \n“No, I don’t think he’s any good,” Scherer said jokingly of Brothers. “Kentrell is just good, he finds a way to get to the ball a lot and he works really hard.” \n“He’s just making a lot of plays, I don’t know if it’s his mental approach or what. Of course he’s gotten a lot better with time but he’s obviously figured out what works for him.” \nMarshall’s Evan McKelvey ranks second in the NCAA in tackles with 77. That fails in comparison to Brothers' 91. \nCan the production continue? Can Brothers continue to make arguably the biggest one-man impact on any defense in America? Simon believes so. \n“I feel like he is the best linebacker in the nation,” Simon said. “Just his attitude, his mindset, I feel like I’ve learned a lot from Kentrell watching how he prepares for the game — he’s just a great player all-around.”", "external_links": [], "published": "2015-10-21T08:00:00.000+03:00", "crawled": "2015-10-22T02:12:06.647+03:00", "highlightTitle": ""}