{"organizations": [], "uuid": "97517dd93363959d3b88ded633e74a719a102401", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.oneindia.com", "main_image": "http://www.oneindia.com/img/2015/10/05-1444053448-shahidafridi-new-600.jpg", "site_section": "http://news.oneindia.in/rss/news-sports-fb.xml", "section_title": "India Sports News, Latest Cricket News, Hockey, Tennis, Golf News - Oneindia Sports", "url": "http://www.oneindia.com/sports/cricket/shahid-afridi-slams-australia-cancelling-bangladesh-tour-over-minor-issues-1890201.html", "country": "", "title": "Shahid Afridi slams Australia for cancelling Bangladesh tour over 'minor issues'", "performance_score": 0, "site": "oneindia.com", "participants_count": 0, "title_full": "Shahid Afridi slams Australia for cancelling Bangladesh tour over 'minor issues'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T16:45:00.000+03:00", "replies_count": 0, "uuid": "97517dd93363959d3b88ded633e74a719a102401"}, "author": "", "url": "http://www.oneindia.com/sports/cricket/shahid-afridi-slams-australia-cancelling-bangladesh-tour-over-minor-issues-1890201.html", "ord_in_thread": 0, "title": "Shahid Afridi slams Australia for cancelling Bangladesh tour over 'minor issues'", "locations": ["Australia", "Bangladesh"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Shahid Afridi"], "text": "Shahid Afridi slams Australia for cancelling Bangladesh tour over 'minor issues' Updated: Monday, October 5, 2015, 19:29 [IST] \nKarachi, Oct 5: Pakistani all-rounder Shahid Afridi criticised Australia's decision to call off their Bangladesh tour citing terrorism fears, saying Monday that while security was paramount tours should \"not be cancelled over minor issues\". \nAustralia scrapped its two-Test tour of Bangladesh last week after official warnings militants may attack Western interests. Shahid Afridi \nThe head of the Bangladesh Cricket Board Nazmul Hassan said measures to tighten security should have satisfied any safety concerns, telling reporters in Dhaka that while many countries face such terror threats, \"it never stops cricket\". \nAfridi echoed that statement on the sidelines of a visit in Karachi to meet Pakistan and Bangladesh's women's teams. \"Security is paramount but tours should not get cancelled over minor issues,\" he told reporters. \n\"Pakistan, India, Bangladesh and Sri Lanka should show some unity and counter these security fears as we have suffered a lot with international teams not coming to Pakistan,\" said Afridi. \nInternational cricket was suspended in Pakistan after a deadly 2009 attack on the Sri Lanka team bus in Lahore. \nBut the country hosted its first Test-playing nation in six years in May, when Zimbabwe toured for a short limited-over series, raising hopes that bigger teams might also come to Pakistan again. Afridi said Bangladesh's decision to send their women's team was a good sign. \n\"Our country is going through a difficult phase but cricket will be revived through the efforts of Pakistan Cricket Board and we should thank the Bangladesh government for sending their women's team,\" he said. \n\"I am sure this is the first good step before sending Bangladesh men's team.\" \nThe popular Twenty20 captain appeared to have charmed the Bangladeshi players, with many posing for selfies with him. \n\"It's nice to see women playing good cricket and I congratulate both the teams for their competitive style,\" said Afridi. \nFormer Bangladesh opener Athar Ali Khan said Afridi's visit had been \"great encouragement\" for the women's teams. \n\"It will go a long way in raising their performance in the last match,\" said Khan, who played 19 one-day internationals for Bangladesh. Pakistan beat Bangladesh in both Twenty20 matches, and lead the two-match one-day series 1-0. The last match is on Tuesday in Karachi. \nAFP", "external_links": [], "published": "2015-10-05T16:45:00.000+03:00", "crawled": "2015-10-05T17:15:39.514+03:00", "highlightTitle": ""}