{"organizations": ["National Anthem", "Nissan Stadium", "AP Tennessee Titans", "NFL", "Tennessee Titans", "Nissan", "TENNESSEAN", "Titans", "AP Photo/Weston Kenney", "AP Bills", "AP Fullscreen Tennessee Titans", "TENNESSEAN Buffalo", "Buffalo Bills", "AP", "Buffalo", "Jurrell Casey"], "uuid": "83e317545b08f5eae51c917954b07a8251732580", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dnj.com", "main_image": "http://www.gannett-cdn.com/-mm-/2af24a8dd19ed2fa466b060ef70d782b6801f739/c=0-113-3599-2146&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/11/Nashville/Nashville/635801774472320597-NAS-Titans-vs-Bills-166.jpg", "site_section": "http://rssfeeds.dnj.com/murfreesboro/sports", "section_title": "Murfreesboro - Sports", "url": "http://www.dnj.com/story/sports/high-school/2015/10/12/mur-sports-prep-schedule-1013/73824224/", "country": "US", "title": "Titans again fail to finish", "performance_score": 0, "site": "dnj.com", "participants_count": 0, "title_full": "Titans again fail to finish", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:17:00.000+03:00", "replies_count": 0, "uuid": "83e317545b08f5eae51c917954b07a8251732580"}, "author": "", "url": "http://www.dnj.com/story/sports/high-school/2015/10/12/mur-sports-prep-schedule-1013/73824224/", "ord_in_thread": 0, "title": "Titans again fail to finish", "locations": ["Tenn.", "Hopkinsville", "Cincinnati", "Nissan Stadium", "Weston Kenney", "Ky.", "Nashville", "Tennessee", "THE TENNESSEA Buffalo", "Tenn", "Alabama", "Jackson", "Buffalo"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Avery Williamson", "Sankey", "Colton Page", "Andy Gallik", "Mark Zaleski", "Gilmore", "Ken Whisenhunt", "Searcy", "Chris Hogan", "Kyle Williams", "Brian Orakpo", "Corey Graham", "Delanie Walker", "Tyrod Taylor", "George Walker", "Duke Williams", "Bishop Sankey", "Herron", "Jurrell Casey", "Jared Devine", "Eric Wood", "Preston Brown", "Wright", "Nigel Bradham", "John Lehmkuhl", "Julie Tomlinson", "Denarius Moore", "Tyler Page", "Ashton Willis", "Al Woods", "Rex Ryan", "Phillip Supernaw", "Aaron Williams", "Angelo Blackson", "Walker", "Zaleski", "Jason Wolf", "Marcus Mariota", "Dexter McCluster", "Stephon Gilmore", "Jerry Hughes", "Marcua", "Ryann Gray", "Coty Sensabaugh", "Wesley Woodyard", "Jae S. Lee", "Justin Hunter", "Taylor", "Anthony Dixon", "Jalston Fowler", "Lisa Purtee", "Manny Lawson", "Antonio Andrews", "Percy Harvin", "Nickell Robey", "Craig Stevens", "Derrick Morgan", "Jason McCourty", "Mary Russell", "Kendall Wright", "Craig Wayne Boyd", "Beau Brinkley", "Zach Brown"], "text": "Titans again fail to finish Jason Wolf , jwolf@tennessean.com 7:17 p.m. CDT October 11, 2015 Buy Photo Bills quarterback Tyrod Taylor is pressured by Titans outside linebacker Derrick Morgan in the second half. George Walker IV / The Tennessean Buy Photo Fullscreen Buy Photo Titans wide receiver Kendall Wright (13) wrestles for the ball with Bills cornerback Stephon Gilmore (24) late in the fourth quarter at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. George Walker IV / THE TENNESSEAN A general overall view of Nissan Stadium in the second half of an NFL football game between the Tennessee Titans and the Buffalo Bills Sunday, Oct. 11, 2015, in Nashville, Tenn. (AP Photo/Weston Kenney) Weston Kenney, AP Tennessee Titans inside linebacker Avery Williamson enters the field during pre-game festivities in the first half of an NFL football game against the Buffalo Bills Sunday, Oct. 11, 2015, in Nashville, Tenn. (AP Photo/Mark Zaleski) Mark Zaleski, AP Fullscreen Tennessee Titans center Andy Gallik wears pink gloves, in recognition of breast cancer awareness, as he holds his hand to his heart during the National Anthem before an NFL football game against the Buffalo Bills Sunday, Oct. 11, 2015, in Nashville, Tenn. (AP Photo/Mark Zaleski) Mark Zaleski, AP Bills coach Rex Ryan shakes hands with Titans quarterback Marcus Mariota (8) after the Bills beat the Titans 14-13 at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. George Walker IV / THE TENNESSEA Titans wide receiver Kendall Wright (13) is checked out after suffering an injury in the second half at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. George Walker IV / THE TENNESSEA Fullscreen Bills defensive tackle Kyle Williams (95) and Bills middle linebacker Preston Brown (52) celebrate the team's interception late in the fourth quarter to hold on for the 14-13 win over the Titans at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. George Walker IV / THE TENNESSEA Bills cornerback Stephon Gilmore (24) intercepts a pass intended for Titans wide receiver Kendall Wright (13) late in the fourth quarter at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. George Walker IV / THE TENNESSEA Fullscreen Buy Photo Tennessee Titans quarterback Marcus Mariota (8) is pulled by Buffalo Bills outside linebacker Nigel Bradham during the fourth quarter at Nissan Stadium in Nashville, Tenn., Sunday, Oct. 11, 2015. Titans lost 14-13. Jae S. Lee / The Tennessean Buy Photo Fullscreen Buy Photo Buffalo Bills cornerback Stephon Gilmore (24) intercepts a pass intended for Tennessee Titans wide receiver Kendall Wright (13) to seal a 14-13 win during the fourth quarter at Nissan Stadium in Nashville, Tenn., Sunday, Oct. 11, 2015. Jae S. Lee / The Tennessean Fullscreen Buy Photo Tennessee Titans head coach Ken Whisenhunt, right, shakes hands with Buffalo Bills head coach Rex Ryan at Nissan Stadium in Nashville, Tenn., Sunday, Oct. 11, 2015. Titans lost 14-13. Jae S. Lee / The Tennessean Buy Photo Fullscreen Buy Photo Tennessee Titans quarterback Marcus Mariota leaves the field after a 14-13 loss to Buffalo Bills at Nissan Stadium in Nashville, Tenn., Sunday, Oct. 11, 2015. Jae S. Lee / The Tennessean Buy Photo Titans defensive end Jurrell Casey grabs Bills wide receiver Percy Harvin. Jae S. Lee / The Tennessean Buy Photo Fullscreen Buy Photo Titans and Bills players scramble to gain control of the loose ball at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. George Walker IV / THE TENNESSEAN Buy Photo Fullscreen Buy Photo Titans quarterback Marcus Mariota (8) throws on the run over Buffalo defenders in the second half at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. Jae S. Lee / THE TENNESSEAN Buy Photo Fullscreen Buy Photo Titans cornerback Coty Sensabaugh (24) lays out to try to prevent the catch by Bills wide receiver Chris Hogan (15) at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. Jae S. Lee / THE TENNESSEAN Buy Photo Titans running back Antonio Andrews (26) leaps over Bills cornerback Stephon Gilmore (24) on a running play at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. George Walker IV / THE TENNESSEA Fullscreen Buy Photo Bills center Eric Wood (70) tries to gain control of the loose ball as Titans players close in at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. George Walker IV / THE TENNESSEAN Buy Photo Fullscreen Buy Photo Bills center Eric Wood (70) tries to gain control of the loose ball as Titans players close in at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. George Walker IV / THE TENNESSEAN Buy Photo Fullscreen Buy Photo Bills quarterback Tyrod Taylor (5) heads down the field on a run in the second half at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. George Walker IV / THE TENNESSEAN Buy Photo Fullscreen Buy Photo Titans strong safety Da'Norris Searcy (21) tries to trip up Bills quarterback Tyrod Taylor (5) in the second half at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. George Walker IV / THE TENNESSEAN Buy Photo Fullscreen Buy Photo Titans running back Dexter McCluster (22) is tackled by Bills strong safety Duke Williams (27) in the second half at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. Jae S. Lee / THE TENNESSEAN Fullscreen Buy Photo Bills quarterback Tyrod Taylor (5) is pressured by Titans defensive end Angelo Blackson (95) at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. Jae S. Lee / THE TENNESSEAN Buy Photo Fullscreen Buy Photo Bills wide receiver Chris Hogan (15) and quarterback Tyrod Taylor (5) celebrate Taylor's touchdown at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. George Walker IV / THE TENNESSEAN Buy Photo Fullscreen Buy Photo Titans inside linebacker Wesley Woodyard (59) tackles Bills running back Anthony Dixon (26) at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. George Walker IV / THE TENNESSEAN Fullscreen Buy Photo Titans nose tackle Al Woods (96) tries to tackle Buffalo's Boom Herron (38) at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. George Walker IV / THE TENNESSEAN Buy Photo Fullscreen Buy Photo Titans nose tackle Al Woods (96) knocks the ball out of the hands of Boom Herron (38) at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. George Walker IV / THE TENNESSEAN Buy Photo Bills coach Rex Ryan at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. Jae S. Lee / THE TENNESSEAN Fullscreen Buy Photo Titan's coach Ken Whisenhunt talks to Marcus Mariota as he walks toward the sidelines at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. Jae S. Lee / THE TENNESSEAN Fullscreen Buy Photo Titans outside linebacker Brian Orakpo (98) hands the flag back to the referee after a penalty was called at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. Jae S. Lee / THE TENNESSEAN Buy Photo Fullscreen Buy Photo Titans defensive end Jurrell Casey (99) brings down Bills quarterback Tyrod Taylor (5) for a loss Sunday at Nissan Stadium on Oct. 11, 2015, in Nashville, Tenn. George Walker IV / THE TENNESSEAN Buy Photo Fullscreen Buy Photo Titans fullback Jalston Fowler (45) and Titans long snapper Beau Brinkley (48) break a a play with Buffalo's Denarius Moore at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. Jae S. Lee / THE TENNESSEAN Buy Photo at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. Jae S. Lee / THE TENNESSEAN Buy Photo Fullscreen Buy Photo Titans quarterback Marcus Mariota (8) was effective with his legs as he runs past two defenders at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. Jae S. Lee / THE TENNESSEAN Buy Photo Fullscreen Buy Photo Titans tight end Delanie Walker (82) makes a catch over Bills free safety Corey Graham (20) at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. Jae S. Lee / THE TENNESSEAN Buy Photo Fullscreen Buy Photo Titans defensive end Jurrell Casey (99) grabs Bills wide receiver Percy Harvin (18) as he runs upfield at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. Jae S. Lee / THE TENNESSEAN Buy Photo Fullscreen Buy Photo Bills running back Anthony Dixon (26) is tackled by Titans inside linebacker Zach Brown (55)at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. Jae S. Lee / THE TENNESSEAN Buy Photo Fullscreen Buy Photo Titans running back Antonio Andrews (26) dives through the line to score Tennessee's first touchdown at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. George Walker IV / THE TENNESSEAN Fullscreen Buy Photo Titans tight end Delanie Walker (82) pulls in a catch over Bills free safety Corey Graham (20) at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. George Walker IV / THE TENNESSEAN Buy Photo Fullscreen Buy Photo Titans quarterback Marcus Mariota (8) goes to work in the second half at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. Jae S. Lee / THE TENNESSEAN Buy Photo Fullscreen Buy Photo Titans defensive end Jurrell Casey (99) sacks Bills quarterback Tyrod Taylor (5) during the second quarter at Nissan Stadium Sunday Oct. 11, 2015, in Nashville, Tenn. George Walker IV / THE TENNESSEAN Fullscreen Buy Photo Titans head coach talks with quarterback Marcus Mariota (8) during the second quarter against the Bills at Nissan Stadium Sunday Oct. 11, 2015, in Nashville, Tenn. George Walker IV / THE TENNESSEAN Buy Photo Fullscreen Buy Photo Titans wide receiver Justin Hunter (15) is brought down by Bills free safety Corey Graham (20) after catching a pass during the second quarter at Nissan Stadium Sunday Oct. 11, 2015, in Nashville, Tenn. George Walker IV / THE TENNESSEAN Buy Photo Fullscreen Buy Photo Titans head coach Ken Whisenhunt argues a referees call during the second quarter against the Bills at Nissan Stadium Sunday Oct. 11, 2015, in Nashville, Tenn. George Walker IV / THE TENNESSEAN Buy Photo Fullscreen Buy Photo Titans quarterback Marcus Mariota (8) gets off a pass before Bills defensive end Jerry Hughes (55) can reach him at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. George Walker IV / THE TENNESSEAN Fullscreen Buy Photo Titans wide receiver Justin Hunter (15) makes a catch against Bills defensive back Nickell Robey (37) at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. George Walker IV / THE TENNESSEAN Buy Photo Fullscreen Buy Photo Titans running back Antonio Andrews (26) runs against Buffalo defenders Nigel Bradham (53) and Manny Lawson (91) in the first half at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. Jae S. Lee / THE TENNESSEAN Fullscreen Buy Photo Titans running back Antonio Andrews (26) runs into a group of Buffalo defenders on a run in the first half at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. Jae S. Lee / THE TENNESSEAN Buy Photo Wide receiver Kendall Wright leads the Titans in targets, receptions and receiving yards through four games. George Walker IV / The Tennessean Buy Photo Fullscreen Buy Photo Titans quarterback Marcus Mariota (8) scrambles through the line in the first half at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. Jae S. Lee / THE TENNESSEAN Buy Photo Fullscreen Buy Photo Bills cornerback Stephon Gilmore breaks up a pass intended for Titans wide receiver Kendall Wright in the first half. Gilmore would later seal the win for the Bills with an interception of a pass intended for Wright. Jae S. Lee / The Tennessean Fullscreen Buy Photo Titans quarterback Marcus Mariota (8) hands off to Titans running back Dexter McCluster (22) in the first quarter at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. George Walker IV / THE TENNESSEAN Buy Photo Fullscreen Buy Photo Titans quarterback Marcus Mariota (8) in the first quarter at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. George Walker IV / THE TENNESSEAN Fullscreen Buy Photo Titans running back Bishop Sankey (20) runs up the sideline in the first quarter at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. George Walker IV / THE TENNESSEAN Buy Photo Fullscreen Buy Photo Titans quarterback Marcus Mariota (8) looks upfield trying to find a receiver at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. George Walker IV / THE TENNESSEAN Buy Photo Fullscreen Buy Photo Titans running back Bishop Sankey (20) loses the ball on the opening kick-off at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. It was recovered by Buffalo but a penalty caused a re-kick. George Walker IV / THE TENNESSEAN Fullscreen Buy Photo Titans running back Bishop Sankey (20) loses the ball on the opening kick-off at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. It was recovered by Buffalo but a penalty caused a re-kick. George Walker IV / THE TENNESSEAN Fullscreen Buy Photo Titans running back Bishop Sankey (20) loses the ball on the opening kick-off at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. It was recovered by Buffalo but a penalty caused a re-kick. George Walker IV / THE TENNESSEAN Buy Photo Fullscreen Buy Photo Titans running back Bishop Sankey (20) loses the ball on the opening kick-off at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. It was recovered by Buffalo but a penalty caused a re-kick. George Walker IV / THE TENNESSEAN Buy Photo Fullscreen Buy Photo Titans running back Bishop Sankey (20) loses the ball on the opening kick-off at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. It was recovered by Buffalo but a penalty caused a re-kick. George Walker IV / THE TENNESSEAN Buy Photo Fullscreen Buy Photo Titans wide receiver Kendall Wright (13) tried to shake defender Bills strong safety Aaron Williams (23) at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. George Walker IV / THE TENNESSEAN Buy Photo Fullscreen Buy Photo Backed by great cancer survivors, country music artist Craig Wayne Boyd sings the National Anthem before Sunday's Titans game against Buffalo at Nissan Stadium on Oct. 11, 2015, in Nashville, Tenn. George Walker IV / THE TENNESSEAN Buy Photo Fullscreen Buy Photo Titans cornerback Jason McCourty (30) runs out onto the field at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn., his first game of the season after being out with injury. George Walker IV / THE TENNESSEAN Buy Photo Fullscreen Buy Photo Titans defensive end Jurrell Casey (99) runs through the tunnel and out onto the field for Sunday's game against Buffalo at Nissan Stadium on Oct. 11, 2015, in Nashville, Tenn. George Walker IV / THE TENNESSEAN Buy Photo Fullscreen Buy Photo Titans tight end Phillip Supernaw (89), Titans tight end Delanie Walker (82) and Titans tight end Craig Stevens (88) head out onto the field before the start of the game at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. George Walker IV / THE TENNESSEAN Buy Photo Fullscreen Buy Photo Tennessee Titans defensive end Jurrell Casey (99) with his fiancŽ Ryann Gray, left, and her mother, Mary Russell, a breast cancer survivor, in honor of breast cancer awareness, at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. George Walker IV / THE TENNESSEAN Buy Photo Fullscreen Buy Photo Titans outside linebacker Derrick Morgan (91) heading onto the field for the start of Sunday's game against Buffalo at Nissan Stadium on Oct. 11, 2015, in Nashville, Tenn. George Walker IV / THE TENNESSEAN Buy Photo Fullscreen Buy Photo John Lehmkuhl, from Cincinnati, attending the game on his birthday, just to see Titans quarterback Marcua Mariota at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. George Walker IV / THE TENNESSEAN Buy Photo Fullscreen Buy Photo Fans get hand-slaps from Titans quarterback Marcus Mariota (8) as he heads back into the locker room before the start of the game at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. George Walker IV / THE TENNESSEAN Buy Photo Buy Photo Titans quarterback Marcus Mariota warming up at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. George Walker IV / THE TENNESSEAN Buy Photo Fullscreen Buy Photo Titans coach Ken Whisenhunt watches the team warm up at Nissan Stadium before Sunday's game against the Bills. George Walker IV / The Tennessean Fullscreen Buy Photo A Tennessee Titans fan watches players warming up from the stand prior to the Buffalo Bills game at Nissan Stadium in Nashville, Tenn., Sunday, Oct. 11, 2015. Jae S. Lee / The Tennessean Fullscreen Buy Photo Tennessee Titans fans Tyler Page, left, and his cousin Colton Page, both of of Jackson, Tenn., wait to see players coming into the tunnel prior to the Buffalo Bills game at Nissan Stadium in Nashville, Tenn., Sunday, Oct. 11, 2015. Jae S. Lee / The Tennessean Buy Photo Fullscreen Buy Photo Tennessee Titans fan Lisa Purtee, of Hopkinsville, Ky., wears Titans shoes as she waits to enter the stadium prior to the Buffalo Bills game at Nissan Stadium in Nashville, Tenn., Sunday, Oct. 11, 2015. She said she won a season ticket through the Titans Hall of Fans contest. \"I almost dropped the phone,\" she said. Jae S. Lee / The Tennessean Buy Photo Fullscreen Buy Photo Tennessee Titans fan Lisa Purtee, of Hopkinsville, Ky., shows her support prior to the Buffalo Bills game at Nissan Stadium in Nashville, Tenn., Sunday, Oct. 11, 2015. She said she won a season ticket through the Titans Hall of Fans contest. \"I almost dropped the phone,\" she said. Jae S. Lee / The Tennessean Fullscreen Buy Photo Tennessee Titans Jared Devine, 12, who traveled from Alabama with his friend's family prior to the Buffalo Bills game at Nissan Stadium in Nashville, Tenn., Sunday, Oct. 11, 2015. Jae S. Lee / The Tennessean Buy Photo Fullscreen Buy Photo A motion-activated mannequin that Titans fan Julie Tomlinson, of Nashville, Tenn., decorated with Titans gear stands at her tailgating tent prior to the Buffalo Bills game at Nissan Stadium in Nashville, Tenn., Sunday, Oct. 11, 2015. Jae S. Lee / The Tennessean Buy Photo Fullscreen Buy Photo Titans fans wait to get autographs from players as they arrive at Nissan Stadium before the game against the Bills Sunday Oct. 11, 2015, in Nashville, Tenn. George Walker IV / THE TENNESSEAN Buy Photo Fullscreen Buy Photo Ashton Willis 6, tosses the ball as he waits for Titans to take on the Bills at Nissan Stadium Sunday Oct. 11, 2015, in Nashville, Tenn. George Walker IV / THE TENNESSEAN Fullscreen Buy Photo Titans wide receiver Justin Hunter (15) pulls in a pass as he warms up before the game against the Bills at Nissan Stadium Sunday Oct. 11, 2015, in Nashville, Tenn. George Walker IV / THE TENNESSEAN Fullscreen Buy Photo Titans running backs Bishop Sankey and Dexter McCluster sprint down the field as they warm up before the game against the Bills at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. George Walker IV / THE TENNESSEAN Buy Photo Fullscreen Buy Photo Titans cornerback Jason McCourty (30) pulls in a catch as he warms up before the game against the Bills at Nissan Stadium Sunday Oct. 11, 2015, in Nashville, Tenn. George Walker IV / THE TENNESSEAN Buy Photo Fullscreen Buy Photo Titans running back Dexter McCluster signs autographs for fans before the game against the Bills at Nissan Stadium Sunday Oct. 11, 2015, in Nashville, Tenn. George Walker IV / THE TENNESSEAN Buffalo's Stephon Gilmore (24) makes the interception of a pass intended for Kendall Wright (13) late in the fourth quarter, giving Buffalo the 14-13 win. George Walker IV / THE TENNESSEA Dealing Walker goes high for the reception over defender Nickell Robey at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. George Walker IV / THE TENNESSEA Buffalo's Preston Brown (52) looks on as the Titans' Justin Hunter goes for the catch at Nissan Stadium on Sunday Oct. 11, 2015, in Nashville, Tenn. George Walker IV / THE TENNESSEA Like this topic? You may also like these photo galleries: Replay", "external_links": [], "published": "2015-10-12T03:17:00.000+03:00", "crawled": "2015-10-13T09:32:39.190+03:00", "highlightTitle": ""}