{"organizations": [], "uuid": "18adf2a9a85c73d2b17d4b2f4bc8b9a7aa022f75", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.idahostatesman.com", "main_image": "http://media.idahostatesman.com/smedia/2015/10/17/23/49/qWn1Y.AuSt.36.jpeg", "site_section": "http://www.idahostatesman.com/rss/sports", "section_title": "Idahostatesman.com -- Sports", "url": "http://www.idahostatesman.com/2015/10/17/4040845/steelheads-veteran-and-rookie.html", "country": "US", "title": "Steelheads’ veteran and rookie are goalies sharing ice time and learning experiences", "performance_score": 0, "site": "idahostatesman.com", "participants_count": 0, "title_full": "Steelheads’ veteran and rookie are goalies sharing ice time and learning experiences", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T08:48:00.000+03:00", "replies_count": 0, "uuid": "18adf2a9a85c73d2b17d4b2f4bc8b9a7aa022f75"}, "author": "", "url": "http://www.idahostatesman.com/2015/10/17/4040845/steelheads-veteran-and-rookie.html", "ord_in_thread": 0, "title": "Steelheads’ veteran and rookie are goalies sharing ice time and learning experiences", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Chris Langrill Special"], "text": "Steelheads veteran and rookie are goalies sharing ice time and learning experiences By Chris Langrill Special to the Statesman October 17, 2015 Updated 3 hours ago 2015-10-18T14:41:57Z Order a reprint of this story \nRush rally past Steelheads Goalie Philippe Desrosiers, above , stopped 28 shots, but gave up a goal with 1 second remaining in regulation as the Rush forced overtime and went on to win 5-4 on Saturday night at CenturyLink Arena. Jonathan Narbonne scored two minutes into the extra period for the win. Jefferson Dahl recorded a goal and an assist for Idaho, which led 4-1 after the first period. BOX SCORE, S6 OTTO KITSINGER — For the Idaho Statesman | Buy Photo \nMEET THE STEELHEADS’ GOALIES \nHometown: White Bear Lake, Minn. \nHeight: 6-4 \nWeight: 205 \nFast facts: Was U.S. College Hockey Online’s player of the year in 2013. Holds Quinnipiac’s career records for save percentage and goals-against average. \nPhilippe Desrosiers \nHeight: 6-2 \nWeight: 200 \nFast facts: Won the Quebec Major Junior Hockey League (QMJHL) championship in 2015. Holds the all-time record for Rimouski Oceanic (of the QMJHL) for longest shutout streak at 171:08. \nOne goalie is younger, without any pro experience. The other is six years older, with two years of professional experience. One is from Minnesota, and the other is from Quebec. \nThey certainly have their differences, but how Philippe Desrosiers and Eric Hartzell perform  and how their relationship develops  will go a long way in determining the success of the Idaho Steelheads this season. \nThe dynamic between the two, I think its really good, said Mike Valley, the Dallas Stars director of goaltending development. Theyre both hungry. Theyre on different paths, different journeys, but theyre both trying to get to the same spot, which is the next level up. \nValleys position and role changed this offseason. Previously the NHL teams goalie coach, he will now focus on the development of the younger players in the Stars system. \nHe spent the past week in Boise, mainly to help Desrosiers transition into his first season of pro hockey. The 20-year-old was selected by the Stars in the second round of the 2013 NHL Draft, and he spent the previous four seasons in the Quebec Major Junior Hockey League. \nWhen we sent Phil (to Idaho), I wanted to make sure that we set the tone right away that, hey, hes an important piece of the Dallas Stars organization, Valley said. Its also important that he comes here with the right approach. ... And Ill not only work with him, but Eric as well. Its our affiliation, so its our job to make sure were helping as much as we can. \nHartzell, 26, is the more experienced of the two. In 2013, he led Quinnipiac to its first national championship game and was a Hobey Baker Award finalist and the ECAC Player of the Year. He signed an entry-level contract with the Pittsburgh Penguins and spent the past two seasons splitting time between the ECHL and the AHL. He spent time around the Penguins, too, hoping one day to be playing in Pittsburghs net. But it wasnt to be. \nI had my two years in the Pittsburgh organization, and sometimes things dont always go the way that you want them to, Hartzell said. It doesnt mean that Im a bad goalie. I have a lot of confidence in myself. \nIndeed, he chooses to be philosophical rather than pessimistic about the past two seasons. \nThere have been plenty of ups and plenty of downs, Hartzell said. Ive learned a lot about myself, a lot about pro hockey and a lot about how to carry myself on and off the ice. \nValley believes that insight and experience could be perfect for the relationship between Hartzell and Desrosiers. \nYou have a guy who has a little more experience who might be able to serve as a mentor, Valley said. On the other hand, you have a young guy who is really, really hungry and hes pushing for playing time. \nSo, I wanted to set the tone and say, Look, you guys are competing against each other for playing time, but you also have to be extremely supportive of one another, and help each other every day.  \nValley said he has emphasized to Desrosiers that the most important thing the rookie can do is to get playing time in the net. \nIf you look at him and his age group, hes one of the best, Valley said. Hes got a ton of talent, and hes very refined and polished. ... The big thing for him now is experience. I told Phil that (L.A. Kings goalie) Jonathan Quick played more games in the ECHL than the American League. Its just so important for a young guy to play. \nAnd the young goalie seems to understand that message. \nFor sure, I want to be in Texas with the AHL team, said Desrosiers, who was named the Canadian Hockey Leagues goalie of the year last season. But Im here to work on my game. Im a young guy, 20 years old, and being an NHL goalie is a long process. \nThe first part of that process is just adapting to a whole new world. \nBeing far away from home, I have a new team and a new language, too. Im French Canadian, he said. But I just need to make sure Im ready for every game. Im ready for the pro level. \nHartzell has already played a few seasons at the pro level, but he feels like there is still much to prove. \nIm 26, and I still feel young, he said. My dream is still to play in the NHL, and its a process. \nThat process will continue as Idahos season unfolds. Neil Graham said hes excited about the two players hell have in net as he begins his first season coaching the Steelheads. \nTheyre both capable and theyre both going to get their minutes this year, Graham said. Especially at the start of the year, you need both goalies engaged. ... I expect both of them to be big parts of this team this year.", "external_links": [], "published": "2015-10-18T08:48:00.000+03:00", "crawled": "2015-10-18T20:23:11.572+03:00", "highlightTitle": ""}