{"organizations": [], "uuid": "b8c308e068207c10496a73d62c521826d00c417c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "nypost.com", "main_image": "https://thenypost.files.wordpress.com/2015/10/kris1.jpg", "site_section": "http://nypost.com/sports/feed/", "section_title": "| Sports | New York Post", "url": "http://nypost.com/2015/10/17/superstitions-curses-cubs-young-stars-arent-buying-it/", "country": "", "title": "Superstitions? Curses? Cubs young stars aren’t buying it", "performance_score": 0, "site": "nypost.com", "participants_count": 1, "title_full": "Superstitions? Curses? Cubs young stars aren’t buying it | New York Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T05:41:00.000+03:00", "replies_count": 0, "uuid": "b8c308e068207c10496a73d62c521826d00c417c"}, "author": "Zach Braziller", "url": "http://nypost.com/2015/10/17/superstitions-curses-cubs-young-stars-arent-buying-it/", "ord_in_thread": 0, "title": "Superstitions? Curses? Cubs young stars aren’t buying it", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Curses don’t scare the young Cubs. Want proof?\nKris Bryant, their wunderkind third baseman, owns a black cat named “Wrigley.” When told of the black cat that found its way onto the field at Shea Stadium in September 1969, walked past Cubs star Ron Santo in the on-deck circle, and stared at manager Leo Durocher in the dugout, Bryant laughed about any connection. The Cubs famously blew a 9 ¹/₂ -game lead to the Mets, who went on to win the World Series — and some faulted the cat for the collapse. \n“There are no superstitions,” Bryant said after Friday’s workout. “Maybe it’s good, maybe it’s bad.” \nKyle Schwarber, another of the Cubs’ powerful and lethal rookies, isn’t worried about any curses, either. The Cubs are one of only four teams remaining, after all. \n“It’s over with, we’re all moved on,” he said, when asked about the 1969 black-cat curse. “Maybe not the fans have moved on, but we’re moved on. How many years is it? I can’t do math like that. \n“It’s 2015. We’re ready to keep pushing on, hopefully get to our ultimate goal.”\nThe carefree and loose attitude the Cubs have played with all season reminds team president Theo Epstein of another team that snapped a major hex —the 2004 Red Sox, the self-described “idiots” who ended The Curse of the Bambino, winning it all after 86 years of misery in Boston. \n“It’s a very similar vibe. All these guys are younger than those teams were,” Epstein said. “They enjoy each other’s company, make each other crack up, coming out raking, going back laughing about it.” \nThe Cubs’ drought is even longer — their last World Series berth was 1945, and their last title was 1908. But that doesn’t seem to shake them. Nothing has bothered the team of young stars, who knocked off the Pirates in the wild-card game and stunned the rival Cardinals in four games in the NLDS. \nAge, to them, doesn’t matter. \n“There’s really no inexperience now,” the 22-year-old Schwarber said. “It’s grind time. It’s the playoffs. There’s no excuses for being inexperienced.” \nShare this: Facebook Twitter Google Whatsapp Email Filed under chicago cubs ,  kris bryant ,  kyle schwarber ,  mlb playoffs ,  new york mets", "external_links": [], "published": "2015-10-17T05:41:00.000+03:00", "crawled": "2015-10-17T18:37:57.633+03:00", "highlightTitle": ""}