{"organizations": [], "uuid": "88d46d7ae25b0967632eea7c756acfebbc50cf26", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/travel/fort-of-fatal-surprises-deadly-innovations/146319.html", "country": "US", "title": "Fort of fatal surprises & deadly innovations", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "Fort of fatal surprises & deadly innovations", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "88d46d7ae25b0967632eea7c756acfebbc50cf26"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/travel/fort-of-fatal-surprises-deadly-innovations/146319.html", "ord_in_thread": 0, "title": "Fort of fatal surprises & deadly innovations", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Salil Desai\nLocated 14 km near Aurangabad city, known for the Ajanta-Ellora caves, is Daulatabad fort a medieval marvel of diabolical architectural ingenuity. Built by the Yadav dynasty in 1187, its original name Deogiri was changed to Daulatabad, when the notorious Mohammed Tughlaq shifted his capital here from Delhi in 1327. This ill-considered move and the horrific death toll it exacted, earned him the epithet of the ‘mad sultan.’ Daulatabad then changed hands to the Bahamani kingdom, followed by Nizamshah’s rule. Later the Mughals took over and after the Peshwas held it briefly, it eventually passed into the possession of the Nizam of Hyderabad. It is perhaps the only fort in Maharashtra, where the great Maratha king Shivaji’s connection is notably absent. Each clan added such wonderful innovations to the fort’s defences that Daulatabad was considered virtually impregnable and is said to have been conquered on each occasion only through treachery. Firstly the fort’s main gates were fitted with sharp in-built pikes making it impossible to use elephants to charge them. The bastions, ramparts and cannons were also designed to give defenders every advantage in repelling enemies while unleashing mayhem on them with a variety of devices. If the enemy managed to penetrate ‘Amberkot’ and ‘Mahakot’— the first two massive fortification lines, the defences of the third line, ‘Kalakot’ were even more daunting. A wet moat separated the main citadel from the outer expanse of the hillock on which the fort stands. 16 metres wide and 24 metres deep, this moat was infested by crocodiles and snakes. Enemy soldiers would dare not cross with makeshift bridges because of terrible dangers from above and below, nor could they attempt scaling the steep rocks on either side of the moat, cut and smoothened to such an extent that they did not offer even the slenderest foothold. A leather drawbridge that could be folded up swiftly during an attack was the only way across. Moreover in what can only be termed as a stupendous engineering achievement, the level of water could even be raised to submerge the bridge if necessary. If some intrepid enemy managed to cross over, what awaited him was sheer terror in the form of a long, labyrinthine dark passage cut through rock. Known as Andhari, it was the ultimate combination of deception and psychological warfare that wreaked havoc on the nerves of enemy soldiers. Steep and winding like a deep, subterranean cave, the passage was full of fatal surprises. Conceived as an intricate ‘bhul-bhulayya’ , the passage had small, strategic openings of light and air that lured bewildered enemies to terrible deaths like a drop into the moat below or gruesome slaughter by their adversaries, lurking in the adjacent darkness with spears, swords, boiling oil and other deadly contraptions like poisoned nails scattered on the floor. Even if enemy soldiers used torches, they would never be able to sight the defenders first. Indeed it was the perfect chamber of horrors for attackers. Daulatabad also boasts of the majestic Chand Minar, looming just 6 metres lower in height than its famous cousin, Qutab Minar. The special feature of this victory tower is that it is visible from every corner of the fort, no matter where you look from. So don’t give this magnificent fort a miss.", "external_links": [], "published": "2015-10-18T03:00:00.000+03:00", "crawled": "2015-10-18T04:02:19.762+03:00", "highlightTitle": ""}