{"organizations": [], "uuid": "8c5caba82767342889c6ff4123576ff9cca9876c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wausaudailyherald.com", "main_image": "http://www.gannett-cdn.com/-mm-/0ed888dbbc902d62d8fb33800e1033d8c9d9001d/c=0-154-3008-1846&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/10/Wausau/B9319205729Z.1_20151010000211_000_GBSC6O97I.1-0.jpg", "site_section": "http://rssfeeds.stevenspointjournal.com/stevenspoint/sports", "section_title": "Stevens Point - Sports", "url": "http://www.wausaudailyherald.com/story/sports/2015/10/10/athens-abby-wins-set-key-matchup-finale/73710762/", "country": "US", "title": "Athens, Abby wins set up key matchup in finale", "performance_score": 0, "site": "wausaudailyherald.com", "participants_count": 0, "title_full": "Athens, Abby wins set up key matchup in finale", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T07:12:00.000+03:00", "replies_count": 0, "uuid": "8c5caba82767342889c6ff4123576ff9cca9876c"}, "author": "", "url": "http://www.wausaudailyherald.com/story/sports/2015/10/10/athens-abby-wins-set-key-matchup-finale/73710762/", "ord_in_thread": 0, "title": "Athens, Abby wins set up key matchup in finale", "locations": ["Athens"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Abby", "Mitchell"], "text": "Athens, Abby wins set up key matchup in finale Mitchell A. Skurzewski 11:12 p.m. CDT October 9, 2015 Football roundup. CONNECT TWEET LINKEDIN COMMENT EMAIL MORE \nThe Abbotsford Falcons football team is one week away from securing an undefeated season. Even with an unblemished 8-0 record after Friday’s 34-12 victory over Loyal, the Falcons still haven’t wrapped up a Cloverwood Conference title. \nBehind a huge night from Jake Stange, the Athens Bluejays improved to 7-1 with a matchup against Abbotsford in the final week of the regular season looming. Athens has bounced back from a rough performance against Assumption and can earn a co-conference title with a win over the Falcons. \nOther teams with important games in Week 8 included Wausau West, Mosinee and Colby. Wausau West has gotten itself off the deck and has done it with standout defense. Wausau West sat at 0-4 after four weeks, but has now won three of its last four games, including a 20-0 shutout effort on Friday. In their three wins, the Warriors’ defense has allowed a total of 14 points. \nWausau West now sits at 3-4 in the VFA-South and 3-5 overall. With a win in the final week of the regular season against Appleton West, the Warriors will have a .500 conference record and will be playoff eligible. \nMosinee sat at 3-3 — a game against Weston was canceled — and faced a 5-2 Merrill team on the road. With the 33-16 win Mosinee assured itself of finishing at least .500 in conference play and can clinch a playoff spot with a win over Lakeland. \nMosinee’s defense had been struggling all year, including giving up 68 total points in back-to-back losses Antigo and Medford. But, Mosinee’s defense answered the bell with an outstanding performance on Friday and with Lakeland on the docket, Mosinee has an outstanding chance of clinching a playoff spot next week after becoming playoff eligible on Friday. \nLandon Stepan had a nice performance for Mosinee with 180 yards and two touchdowns through the air, 131 of those yards to Bryce Graveen, and added 80 yards and a touchdown on the ground. \nThe Colby Hornets are not assured of a playoff spot even by winning the final two weeks, but it gives them hope. Colby dismantled Osseo-Fairchild 43-16 in Week 8 and has Neillsville standing in its path of potentially earning a postseason berth. \nAdams-Friendship earned a big win, downing Mauston 32-14 to become playoff eligible at 5-3. A-F is 2-2 in conference and can clinch a berth with a win over Wisconsin Dells, which won its first South Central Conference game over Westfield in Week 8. \nWeek 8 Scores", "external_links": [], "published": "2015-10-10T07:12:00.000+03:00", "crawled": "2015-10-10T07:25:59.751+03:00", "highlightTitle": ""}