{"organizations": [], "uuid": "d28a23267cf7226c8ac9497950b03764076dbe4f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ocregister.com", "main_image": "http://images.onset.freedom.com/ocregister/gallery/nw3av6-b88537637z.120151011212133000gicch9f1.10.jpg", "site_section": "http://ocregister.com//common/rss/rss.php?catID=18901", "section_title": "The Orange County Register - News Headlines : Sports", "url": "http://www.ocregister.com/articles/anderson-687131-music-need.html", "country": "US", "title": "Dodgers' Brett Anderson gets rage flowing even for normal starts", "performance_score": 0, "site": "ocregister.com", "participants_count": 0, "title_full": "Dodgers' Brett Anderson gets rage flowing even for normal starts - The Orange County Register", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "d28a23267cf7226c8ac9497950b03764076dbe4f"}, "author": "", "url": "http://www.ocregister.com/articles/anderson-687131-music-need.html", "ord_in_thread": 0, "title": "Dodgers' Brett Anderson gets rage flowing even for normal starts", "locations": ["NEW YORK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Brett Anderson"], "text": "NEW YORK – Baseball is the greatest game on earth. It’s also the most infuriating.\nThose two sentences are Brett Anderson’s two favorite things to say after ballgames he pitches. At least a quarter of the time this season, he said them in some form, with one modification or another. He deployed them after he lost when the Dodgers were held hitless in August; he used them after many of his better starts.\nThey are his crutch, and the dichotomy within those words provides a window into his personality. Anderson loves baseball, but he is aware of its deficiencies. Anderson is opinionated, but he is quiet. Anderson is quiet, but he listens to “the most obnoxious, awful music possible” to get himself ready to start every five days.\nAnd he knows the consistencies that make up his personality.\n“I’m about as boring and even-keeled as you can get,” Anderson said. “I need enough caffeine to incapacitate a horse and metal music to get some adrenaline flowing, some rage flowing, to get me up for a normal start.”\nThe start he will make Monday night at Citi Field will not be a normal start. It will be the second playoff start of the 27-year-old’s career, on his biggest stage yet. It could be the last start he makes as a Dodger, as he will become a free agent at postseason’s end.\nIt will be especially tense, given Saturday’s seventh inning and both teams’ comments in the hours since. And he will still need plenty of caffeine and angry music.\n“I mean, obviously it's a little more ramifications and more people and a hostile environment, but no, I'm still going to,” Anderson said. “So I need to listen to my heavy metal and kind of rage out for a little bit and get some caffeine and Red Bull in me. Once you get out there and start warming up, the playoff adrenaline kind of ramps up. You try to treat it just like another start, but once you feel the adrenaline, feel the crowd, it'll kick in, and it'll be fun.”\nAsked to list his preferred music options for the day of games, he names a few bands: Bring Me The Horizon, August Burns Red, some Metallica. And then he settles on an easier way to explain: “Music that would scare your kids, if you have any.”\n“It works for me,” he said. “Some people need to calm down, some need to mellow out. For some reason, that stuff does both for me.”\nAnderson is confident in his successes and admitting in his failures. He is naturally gifted as a pitcher and remarkably unathletic – “I sweat in a snowstorm,” he says – in doing anything else. He is the rare player who is both willing to proclaim success and admit defeat.\n“I’ve told people since the beginning, I think I’m a good pitcher when I’m healthy,” Anderson said this week. “I’ve been able to do that this year.”\nAnderson made a career-high 31 starts, threw a career-high 1801/3 innings, and pitched to a better-than-his-career-average 3.69 ERA. He had an inarguably solid season, prompting praise to floweth out of catcher A.J. Ellis’ mouth last month.\n“He’s been as big a part of this ballclub as anybody,” Ellis said. “Brett might be the MVP of our pitching staff, just the way that he’s been able to battle and make his turn in the rotation each time.”\nThere’s no way he was actually the MVP. There are two far better candidates, one of whom is ace Clayton Kershaw, who has known Anderson for a decade now. The two pitched on the USA under-18 national team together. Told last week that Anderson seems to be a particularly quiet man, Kershaw smiled.\n“Yeah, to you guys,” he said.\nKershaw said Anderson has not changed much as long as he’s known him. He threw harder as a teenager, but he knew less about how to pitch. He threw two breaking balls, a curveball and a slider, as he still does, but he didn’t know how to spin a sinker to get the majors’ highest ground-ball rate.\n“So, for him, it was always a matter of health,” Kershaw said. “I knew that coming in. If he was healthy, he was going to make 30 starts for us and have a good year, and he did.”\nEach day during the playoffs, the next day’s starting pitcher customarily addresses the media in an MLB-sanctioned news conference. As Anderson’s obligations concluded Sunday evening, he jumped up, apparently pleased with his performance, and headed to Citi Field’s outfield, to complete a light cardio workout.\n“Nailed it,” he said.\nContact the writer: pmoura@ocregister.com", "external_links": [], "published": "2015-10-11T03:00:00.000+03:00", "crawled": "2015-10-12T13:31:08.843+03:00", "highlightTitle": ""}