{"organizations": [], "uuid": "660a7a6852223adca8bb05deb9082d11b7e5bfcf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theguardian.com", "main_image": "https://i.guim.co.uk/img/media/00582f8ab41fdaf41f122360f239eaa8cc67aa81/0_108_4062_2438/master/4062.jpg?w=1200&amp;q=85&amp;auto=format&amp;sharp=10&amp;s=2ac79c1491baef1a79b9c0b5963e9833", "site_section": "http://www.theguardian.com/us", "section_title": "Latest US news, world news, sports and opinion from the Guardian | theguardian.com | The Guardian", "url": "http://www.theguardian.com/world/2015/oct/19/slowing-growth-china-commodities-global-economy", "country": "GB", "title": "Slowing growth in China raises red flag for global economy | World news", "performance_score": 1, "site": "theguardian.com", "participants_count": 3, "title_full": "Slowing growth in China raises red flag for global economy | World news | The Guardian", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:02:00.000+03:00", "replies_count": 2, "uuid": "660a7a6852223adca8bb05deb9082d11b7e5bfcf"}, "author": "Phillip Inman", "url": "http://www.theguardian.com/world/2015/oct/19/slowing-growth-china-commodities-global-economy", "ord_in_thread": 0, "title": "Slowing growth in China raises red flag for global economy | World news", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "China’s economic growth slowed in the latest quarter to a six-year low of 6.9%, adding to concerns that the world economy is entering a period of low growth that will extend into next year.\nOne economic forecaster immediately cut its global growth forecasts for 2016 in response to the official figures from China , while stock markets and oil prices slid backwards.\nThe FTSE 100 dropped 26 points to 6352, while in New York the Dow Jones recovered from a near 100-point fall after its opening bell to be down 17 points at 17,218 by midday. Brent crude oil lost 2.9% to $49.02 a barrel.\nEarlier, the Shanghai Composite, China’s main index, fell by 0.7% to 3,367.70 before the region’s largest market, Japan’s Nikkei index , tumbled 0.6% to 18,177.\nRelated: Chinese economic slowdown or a slow rebalancing?\nThe fall in China’s growth rate, which c ompared to annual expansion of 7% in the previous quarter, follows a dramatic drop in trade that has reverberated across the world.\nAn overheated property market in the country has prompted a contraction in construction output while the manufacturing sector has slumped as exports slumped.\nThe decline in heavy industry and construction has depressed demand for oil, iron ore and other commodities, dragging on growth in Australia, Brazil and other supplier countries.\nIn recent weeks, the US Federal Reserve shelved plans for an interest rate rise, while the European Central Bank has been forced to consider launching a second stimulus package this year.\nSuch is the persistent weakness in demand at home and abroad, China’s combined exports and imports fell 8.1% in the first nine months of the year compared with the same period in 2014, well below the full-year official target of 6% growth.\nAlthough it was slightly better than economists expected, the 6.9% growth rate was the slowest since the 6.2% recorded in the first quarter of 2009, during the global recession.\nOxford Economics, an independent forecaster, said it cut its forecast for world economic growth to 2.5% for 2015 and 2.7% for 2016, down from 2.6% and 3% respectively in June.\nIt said the chances of 2016 being the year when the global recovery regained momentum were now “meagre”.\nLouis Kuijs, one of the forecaster’s economists, said: “Continued downward pressures from real estate and exports caused GDP growth to drop. But robust consumption and infrastructure prevented a sharper slowdown.”\nThe one bright spot in the Chinese economy was that consumers bucked the trend for slowing growth that also dragged business investment lower. Retail sales rose by a better-than-forecast 10.9%.\nThe output growth of China’s huge manufacturing sector cooled more than expected to 5.7% in September, disappointing analysts who expected it to rise 6% on an annual basis after a rise of 6.1% the previous month.\nFixed-asset investment growth eased to 10.3% year-on-year in the first nine months of the year, also missing market expectations.\nSome analysts said the true growth rate was likely to be exaggerated by official figures and has persistently languished below 4% all year, only being kept near the 7% government target by pressure from Beijing.\nYet the latest dip was still seen as the first official confirmation of investors’ fears about economic growth since a Chinese stock market slump and surprise currency devaluation in July and August .\nThe communist government has reacted to the slowing economy with a raft of measures since last November, when it began to cut interest rates. After two years of tightening credit conditions, regulators loosened access to credit in the summer and devalued the currency , though the move was only muted after it sent shockwaves across global markets.\nEconomists expected the Beijing government would stick to its policy of intervening to stimulate growth.\n“The manufacturing industry might cause most concern as it is a pillar of China’s economy,” said Li Huiyong, an economist at Shenwan Hongyuan Securities in Shanghai.", "external_links": ["http://www.bbc.co.uk/news/business/markets/asiapacific/tsenik_tokn"], "published": "2015-10-20T03:02:00.000+03:00", "crawled": "2015-10-19T21:41:08.535+03:00", "highlightTitle": ""}