{"organizations": [], "uuid": "362d86b1ab4eeac7d6cfdd5fa0b24b8735844ccc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seacoastonline.com", "main_image": "http://www.seacoastonline.com/storyimage/SO/20151007/SPORTS/151009307/AR/0/AR-151009307.jpg", "site_section": "http://www.seacoastonline.com/sports/professional?template=rss&mime=xml", "section_title": "Pro Sports - seacoastonline.com", "url": "http://www.seacoastonline.com/article/20151007/SPORTS/151009307/101035/SPORTS?rssfeed=true", "country": "US", "title": "NHL: Questions surround Bruins as season begins", "performance_score": 0, "site": "seacoastonline.com", "participants_count": 1, "title_full": "NHL: Questions surround Bruins as season begins", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T23:33:00.000+03:00", "replies_count": 0, "uuid": "362d86b1ab4eeac7d6cfdd5fa0b24b8735844ccc"}, "author": "Mike Loftus Patriot Ledger", "url": "http://www.seacoastonline.com/article/20151007/SPORTS/151009307/101035/SPORTS?rssfeed=true", "ord_in_thread": 0, "title": "NHL: Questions surround Bruins as season begins", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Oct. 7, 2015 at 3:33 PM By Mike Loftus Posted Oct. 7, 2015 at 3:33 PM » Social News BOSTON – So are they back in, or are they out again? Many Bruins aren't accustomed to the question. For the past five or six years, they've been asked more often about contending for the Stanley Cup, and which teams they considered their primary competition. A more realistic question for the 2015-16 Bruins is whether they can return to the playoffs after missing them last season for the first time since 2007. There's not an easy answer. The Bruins didn't quite blow up what, at this time last year, was thought to be a contending team. CEO Charlie Jacobs said \"it hasn't been necessarily a reboot, maybe just a refresh.\" But the offseason changes were hardly cosmetic. Don Sweeney, who replaced fired general manager Peter Chiarelli, cut ties with everything from a first-line forward (Milan Lucic) and first-pairing defenseman (Dougie Hamilton) to fourth-liners and backups, plus players in between. Those changes will be evident in Thursday's season opener against the Jets, but what's not yet clear is whether those changes will make the Bruins a better team. -Is former Anaheim Duck Matt Beleskey a first-line upgrade over Lucic? -Is Ryan Spooner a bona fide NHLer, and as capable a No. 3 center as Carl Soderberg? -Will the Bruins' array of right wings perform well enough on their assigned lines to allow Loui Eriksson the long-awaited opportunity to skate with Brad Marchand and Patrice Bergeron, where Reilly Smith got to play for two years? -Does anyone on the roster even remotely resemble Hamilton? Those are just the big questions. The Bruins also have to figure out if some newcomers can effectively replace the fourth-line/penalty-killing duo of Daniel Paille and Gregory Campbell, determine if NHL veteran Jonas Gustavsson will be a more suitable backup to No. 1 goalie Tuukka Rask, even come up with an on-site spare defenseman who can step into the lineup, like Matt Bartkowski did for the better part of three years. Despite the continued presence of head coach Claude Julien and his staff, top-tier core pieces like Rask, centers Patrice Bergeron and David Krejci and defenseman Zdeno Chara, and other long-timers like winger Brad Marchand and defenseman Adam McQuaid, too much is new for the Bruins to make bold, \"We shall return\" statements – at least not in the first week of October. \"We do have a bigger turnover than in a number of years,\" said team president Cam Neely, \"so we want to see how everybody plays together, what kind of group we're going to ice here, and see how they develop over the course of the year.\" The potential to return to the playoffs hinges mainly, but not exclusively, on whether and how well the Bruins come together. The competition has a say, too, and the Bruins might have an advantage playing in the Atlantic Division. Stanley Cup finalist Tampa Bay and Montreal, 1-2 in the division last season, may be out of the Bruins' reach, but that's not necessarily the case with the teams they'd likely have to pass to finish third and guarantee a berth. The Red Wings (100 points), four points better than the Bruins last season, are no longer led by coaching guru Mike Babcock. The still-young Senators, who finished three points up, have to prove that last season's epic 23-4-4 charge to an Eastern Conference wild-card slot wasn't a fluke. The Bruins were actually closer to a wild-card berth last season, finishing just two points behind the Metropolitan Division's Penguins, but with that division considered the stronger of the two in the East – and with everyone expecting the Columbus Blue Jackets to emerge as another playoff contender – the Bruins' easier path to the playoffs would be through their division.", "external_links": [], "published": "2015-10-07T23:33:00.000+03:00", "crawled": "2015-10-08T02:14:55.439+03:00", "highlightTitle": ""}