{"organizations": ["Utah State"], "uuid": "9313c68543c3d2ec37209f3b852838ec244e7b46", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deseretnews.com", "main_image": "http://img.deseretnews.com/images/article/hires/1609295/1609295.jpg", "site_section": "http://www.deseretnews.com/sports/index.rss", "section_title": "Sports news and headlines for the Utah Jazz, BYU Cougars, Utah Utes and high schools, Salt Lake City sports, Utah sports  - Deseret News", "url": "http://www.deseretnews.com/article/865638731/Utah-State-heads-back-out-on-the-road-to-battle-Fresno-State.html?pg=all", "country": "US", "title": "Utah State heads back out on the road to battle Fresno State", "performance_score": 0, "site": "deseretnews.com", "participants_count": 0, "title_full": "Utah State heads back out on the road to battle Fresno State", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T09:41:00.000+03:00", "replies_count": 0, "uuid": "9313c68543c3d2ec37209f3b852838ec244e7b46"}, "author": "", "url": "http://www.deseretnews.com/article/865638731/Utah-State-heads-back-out-on-the-road-to-battle-Fresno-State.html?pg=all", "ord_in_thread": 0, "title": "Utah State heads back out on the road to battle Fresno State", "locations": ["Fresno"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Matt Wells"], "text": "Oct. 10, 8:30 p.m. 0 Days 16 Hrs 6 Mins 23 Secs “ They will be ready to play, and I know there will be rallying cries in Fresno and we will get their best shot.” Utah State coach Matt Wells \nLOGAN — Heading into Saturday night's showdown at Fresno State, the Utah State Aggies would be happy to continue what they started last week, while the Bulldogs are desperate to change what’s been happening to them the past month. \nUtah State (1-0 in the Mountain West, 2-2 overall) comes into the game at Bulldog Stadium on the upswing thanks to following up a bye week with a 33-18 victory over Colorado State last weekend at Maverik Stadium. \nConversely, Fresno State (0-2, 1-4) is trying to stop a four-game losing streak. After opening the season with a 34-13 home win over Abilene Christian, the Bulldogs have dropped a home game to Utah (45-24) while getting roughed on the road at Ole Miss (73-21), San Jose State (49-23) and San Diego State (21-7). \n\"(Fresno State coach) Tim DeRuyter is a guy that I've coached with and have a tremendous amount of respect for, as well as his staff,\" said Utah State coach Matt Wells, who was an assistant at Navy with DeRuyter from 1999-2001. \"They will be ready to play, and I know there will be rallying cries in Fresno and we will get their best shot. \n\"They're coming off of two road games going into play at home at Bulldog Stadium, where it's a tough place to play. I've played there, and I've coached there. It's a great atmosphere for them, so we do know what we're getting into, and we will get their best shot schematically, as well as emotionally and physically. They will be ready to play.\" \nFresno State does own a six-game winning streak over the Aggies, which includes a 24-17 victory in the Mountain West championship game in 2013, the last time the two old foes faced each other. The Bulldogs, who are 11-1 at Bulldog Stadium in Mountain West games, are 13-2-1 at home all time vs. Utah State, with the Aggies' last win in Fresno coming in 1980. \nThe Bulldogs head into Saturday’s game second in the Mountain West in sacks with 15 in five games — including nine in their last two contests — and senior linebacker Ejiro Ederaine currently leads the conference in sacks with four. However, Fresno State is also last in the Mountain West in scoring defense (40.2 pg) and 10th in total defense (437.2 ypg). \nBut Wells said several of the top defensive players from two years ago are still there (most notably defensive end Todd Hunt and linebacker Kyrie Wilson), and that the scheme presented by DeRuyter and FSU defensive coordinator Nick Toth is difficult to prepare for. \n“They give you multiple pressures, safety pressures, outside linebacker, inside linebackers,” Wells noted. “You name it, they’re coming down that ramp blitzing and pressuring — man pressures and zone pressures. They do a lot of stuff on defense, and that scheme is a challenge. Those guys do a good job, and they always have.” \nOffensively, the Bulldogs and Aggies are both near the bottom of the conference in most categories. Fresno State is ninth in scoring offense (21.8 ppg), just a bit better than the 11th-place Aggies (19.0 ppg). Those positions are reversed for total offense, with Utah State averaging 328 yards per game, while the Bulldogs are managing just 291.8 ypg. \nSophomore quarterback Zack Greenlee has played in four games, completing 35 of 71 passes for 390 yards, seven touchdowns and one interception. Greenlee didn’t play in the loss to San Jose State after the 20-year-old was arrested for possession of alcohol by a minor and suspended for one game, along with FSU linebacker Brandon Hughes. \n“Greenlee does some really good stuff out on the perimeter, and it’s a veteran, physical offensive line,” Wells said. “And they’ve got some talented wideouts on the edge.” \nMeanwhile, the Aggies are feeling very good about their quarterback situation. Forced into service due to a sprained MCL in the right knee of senior Chuckie Keeton, sophomore Kent Myers responded by running for 191 yards in the win over Colorado State. Myers was named the Mountain West Offensive Player of the Week after setting a new school record for rushing yards for a quarterback. \n“We played very well for it being my first start of the season,” Myers said. “There are some mental things we have to work on with flags after big plays, but other than that, the offense got used to me fast and we started scoring a lot of points. I’m excited to see what we can do next.” \nMyers’ 191 yards on 16 carries are the most by an FBS quarterback this season, and eclipsed the old school record of 121 held by both Keeton and Tony Adams. Myers scored a 26-yard rushing touchdown, and he also completed 12 of 21 passes for 137 yards and another score without throwing an interception. Recommended Stories", "external_links": [], "published": "2015-10-10T09:41:00.000+03:00", "crawled": "2015-10-10T13:25:26.299+03:00", "highlightTitle": ""}