{"organizations": [], "uuid": "5469224818171f4de67e9966733044566910023b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/nba", "section_title": "NBA News, Scores, Schedule, Standings, Stats, Photos, Videos - Basketball - MSN Sports", "url": "http://www.msn.com/en-us/sports/nba/report-mavericks-waive-dalembert-centers-scarce/ar-BBmoHg1", "country": "US", "title": "Report: Mavericks waive Dalembert, centers scarce", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "Report: Mavericks waive Dalembert, centers scarce", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T03:00:00.000+03:00", "replies_count": 0, "uuid": "5469224818171f4de67e9966733044566910023b"}, "author": "Colorado theater shooter James Holmes assaulted in prison", "url": "http://www.msn.com/en-us/sports/nba/report-mavericks-waive-dalembert-centers-scarce/ar-BBmoHg1", "ord_in_thread": 0, "title": "Report: Mavericks waive Dalembert, centers scarce", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Report: Mavericks waive Dalembert, centers scarce FOXSports 8 hrs ago © Jerome Miron-USA TODAY Sports Apr 20, 2014; San Antonio, TX, USA; Dallas Mavericks center Samuel Dalembert (1) fights for the rebound with San Antonio Spurs forward Kawhi Leonard (2) during the first quarter in game one during the first round of the 2014 NBA Playoffs at AT&T Center. Mandatory Credit: Jerome Miron-USA TODAY Sports At this rate, the Mavs won't have any choice but to go small in 2015-16. Jerome Miron USA TODAY Sports If small-ball is all the rage in the modern NBA, the Dallas Mavericks might be set. Because after the team's latest roster move, there's not a whole lot of depth at the center position in Dallas.\nAdChoices On Saturday, the team reportedly waived Samuel Dalembert, according to Yahoo! Sports' Shams Charania:\nThe Dallas Mavericks are releasing center Samuel Dalembert, league sources tell Yahoo. Dalembert had a guaranteed vet minimum contract.\n— Shams Charania (@ShamsCharania) October 24, 2015 Dalembert had reportedly arrived at camp overweight; 29-year-old rookie Salah Mejri will likely take Dalembert's spot as a center in Dallas' rotation, as the Tunisian big man has impressed the Mavericks front office during preseason.\nOn paper, the Mavericks retain three centers even after waiving Dalembert: Mejri, Zaza Pachulia and JaVale McGee. Dwight Powell, a second-year player, can also play up to center. But when you parse the actual rotation, things get mucked up in a hurry. Pachulia is a vastly underrated player in the NBA, versatile and a good passer. The Mavericks are in good hands when Pachulia is on the floor next to Dirk Nowitzki.\nAfter Pachulia, however, Dallas has plenty of questions at center. Mejri has no NBA experience, although he's demonstrated this preseason that he's comfortable banging against seasoned professionals. Expecting much out of him seems foolish. The Mavericks also have JaVale McGee on the roster. McGee has tantalized NBA teams for years, as he has all the physical skills to become a Tyson Chandler-type who dominates on defense and terrifies opponents with his runs to the rim out of the pick and roll. But he's never been able to put those skill to good use, and he enters the season injured.\nJaVale McGee will also make the Mavs roster. Decent chance he's the starting center once he's healthy and in shape.\n— Tim MacMahon (@espn_macmahon) October 24, 2015 Owner Mark Cuban and coach Rick Carlisle are some of the brightest basketball minds in the NBA. It's fair to trust that they'll figure this out, and they should be praised for not letting the sunk cost of Dalembert's guaranteed contract tempt them into giving playing time to a player who was going to drag the team down. But it doesn't look good right now.\nMORE NEWS: Want stories delivered to you? Sign up for our NBA newsletters. Go to MSN Home", "external_links": ["http://www.foxsports.com/", "http://www.mavsmoneyball.com/2015/10/24/9606588/mavericks-cut-samuel-dalembert-salah-mejri-roster", "https://twitter.com/espn_macmahon/status/657966376112553984", "https://twitter.com/ShamsCharania/status/657958679568871425", "http://www.foxsports.com/other/daily-newslettersignup?intcmp=fscom-newsletter_nbastory", "http://go.microsoft.com/fwlink/?LinkID=286759"], "published": "2015-10-24T03:00:00.000+03:00", "crawled": "2015-10-25T04:16:44.988+02:00", "highlightTitle": ""}