{"organizations": [], "uuid": "a6aa29d3d4ff203727dcb97d1fc7aa7b2d56542b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "knox.villagesoup.com", "main_image": "http://knox.villagesoup.com/media/Common/CourierPublications/2015/10/22/1697579/t600-IMG_0172.jpg", "site_section": "http://knox.villagesoup.com//rss/story/sports", "section_title": "Knox VillageSoup Sports Headlines", "url": "http://knox.villagesoup.com/p/upset-minded-mariners-nipped-by-black-raiders-in-ot-heartbreaker/1431557?source=rss", "country": "US", "title": "Upset-minded Mariners nipped by Black Raiders in OT heartbreaker", "performance_score": 0, "site": "villagesoup.com", "participants_count": 1, "title_full": "Upset-minded Mariners nipped by Black Raiders in OT heartbreaker", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T18:37:00.000+03:00", "replies_count": 0, "uuid": "a6aa29d3d4ff203727dcb97d1fc7aa7b2d56542b"}, "author": "news@courierpublicationsllc.com (Staff)", "url": "http://knox.villagesoup.com/p/upset-minded-mariners-nipped-by-black-raiders-in-ot-heartbreaker/1431557?source=rss", "ord_in_thread": 0, "title": "Upset-minded Mariners nipped by Black Raiders in OT heartbreaker", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "View More... \nWinslow — It took just over 100 minutes for a goal to be scored in the season-long story between No. 10 Oceanside and No. 2 Winslow, as the high school field hockey squads squared off in a Class B North quarterfinal playoff game on Wednesday, Oct. 21. \nAnd while it was the Mariners who scored first, it was the Black Raiders who wrote the final chapter of Oceanside's season as the visitors were dealt a heartbreaking 2-1 loss in overtime. \nIt was the second game of the season between the squads, and the second to go to overtime. \nA link to more photos from this game will appear soon with this story. \nThe teams battled to a scoreless tie — which included two 30-minute halves and two 8-minute overtimes — in its regular-season showdown on Sept. 22 in Rockland. \nWednesday, it was Mary Allen — who scored the game-winning goal in double-overtime days prior in a 2-1 prelim playoff win over No. 7 Nokomis of Newport — who scored Oceanside's lone goal off a deflection with just over five minutes to play in the first half. \nOceanside held a 1-0 lead at halftime, but Winslow — the state Class C champions from a year ago — came out strong in the second half and found the back of the cage when Cierra Poulin fired a shot, off an assist from Weslee Littlefield, with 22:11 left in regulation. \nThen, with 4:04 left in the first overtime, Littlefield scored the game-winner for the Black Raiders. \nMariner goalie Mattie Hooper made five saves on six shots, while Black Raider goalie Delaney Wood made 13 saves on 14 shots. \nHooper played in her third straight game for Oceanside in place of teammate Lauren Hoppe, who had not played since being inadvertently struck in the head with a football moments after getting off the bus for the team's regular-season finale Oct. 13 at Leavitt of Turner. \nHoppe had been medically cleared by doctors, but had not yet completed the school-mandated concussion return-to-play protocol. \nWinslow held a 12-7 edge in penalty corners. \nIn a unique twist, the Mariners sported Star Wars-themed hair bands/ties. \nThe Black Raiders will host No. 3 Foxcroft Academy of Dover-Foxcroft, which defeated No. 6 Belfast 3-2 in overtime thriller that went to three rounds of penalty corners. \nCourier Publications' sports staff can be reached by email at sports@villagesoup.com or by phone at 594-4401.", "external_links": [], "published": "2015-10-22T18:37:00.000+03:00", "crawled": "2015-10-22T18:47:19.882+03:00", "highlightTitle": ""}