{"organizations": ["ALCS FOXSPORTS Royals", "Blue Jays"], "uuid": "817d93d3e994fe8e231f07fbda4946af242ec4ff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxsports.com", "main_image": "http://a.fssta.com/content/dam/fsdigital/RSN/Midwest/2015/10/15/PI-MLB-Royals-Sal-Perez-101515.vresize.1200.675.high.54.jpg", "site_section": "http://api.foxsports.com/v1/rss?partnerKey=zBaFxRyGKCfxBagJG9b8pqLyndmvo7UU&tag=kansas-city", "section_title": "FOX Sports Digital", "url": "http://www.foxsports.com/kansas-city/story/royals-ready-to-rumble-with-fiesty-blue-jays-in-game-1-of-alcs-101615?cmpid=feed:-sports-CQ-RSS-Feed", "country": "", "title": "Royals ready to rumble with fiesty Blue Jays in Game 1 of ALCS", "performance_score": 0, "site": "foxsports.com", "participants_count": 0, "title_full": "Royals ready to rumble with fiesty Blue Jays in Game 1 of ALCS", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T08:16:00.000+03:00", "replies_count": 0, "uuid": "817d93d3e994fe8e231f07fbda4946af242ec4ff"}, "author": "", "url": "http://www.foxsports.com/kansas-city/story/royals-ready-to-rumble-with-fiesty-blue-jays-in-game-1-of-alcs-101615?cmpid=feed:-sports-CQ-RSS-Feed", "ord_in_thread": 0, "title": "Royals ready to rumble with fiesty Blue Jays in Game 1 of ALCS", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "FOXSPORTS Royals ready to rumble with fiesty Blue Jays in Game 1 of ALCS \nThe Royals and Blue Jays already have played a contentious set of games this season, including a matchup in Toronto marked by two bench-clearing incidents. Peter Llewellyn / USA TODAY Sports By Dave Skretta AP Oct 16, 2015 at 1:16a ET 0Shares \nKANSAS CITY, Mo. -- The Kansas City Royals and Toronto Blue Jays promise plenty of fireworks in their AL Championship Series, and not just because one team features power arms and the other power bats. \nThe Royals and Blue Jays already have played a contentious set of games this season, including a matchup in Toronto marked by two bench-clearing incidents. And while both sides said during Thursday's workouts that previous rancor has been forgotten, the emotionally charged atmosphere of playoff baseball means there could be some short fuses in the opener Friday night. \n\"It's over with. We've got to move forward,\" insisted the Royals' Edinson Volquez, who will start Game 1 and was arguably the biggest instigator when the teams met in August. \nIt was Volquez whose inside pitching drew the ire of the Blue Jays, eventually leading to the first of those bench-clearing moments. And after the game, he called Blue Jays star Josh Donaldson \"a little baby\" for complaining about his inside pitching. \nAsked whether he intends to pitch inside again Friday night, Volquez replied: \"Of course.\" \nRoyals manager Ned Yost was one word more succinct: \"Absolutely.\" \nEven if it might mean more bad blood. \n\"I'm not a mind reader. I'm not a fortune teller. I don't know if it's going to be an issue,\" Yost said. \"But we'll pitch inside aggressively. That's a power-laden club over there. We're going to formulate a really good game plan and try to go out and execute.\" \nThe Blue Jays, who start Marco Estrada in the opener, won three straight elimination games against Texas to reach their first AL Championship Series since 1993. The last of those games Wednesday was as tense as they come. \nAfter the Rangers took the lead on a fluke play, the Blue Jays stormed back thanks in part to three Texas errors. Donaldson's blooper tied the game, and Jose Bautista capped the comeback with a long three-run homer, emphatically flipping his bat nearly as high in the air. \nBautista's reaction wasn't taken well by the Rangers, who essentially called it bush league, and the entire affair touched off a wide-spread debate about decorum. \n\"You look at all professional sports in general, everybody celebrates more so than they used to,\" Blue Jays manager John Gibbons said. \"In our particular sport, if it's happening for your team, your guy gets a big hit, nobody minds it. If you're on the other side, nobody likes it.\" \nIt's not just what has gone on this postseason, or even in the regular season, that makes this ALCS matchup so juicy. It's also the history the two franchises share. \nThey met once before in the ALCS, with the Royals rallying from a 3-1 deficit in the first year of seven-game series. The last two wins came in Toronto, providing the Royals with so much momentum that they went on to beat the St. Louis Cardinals for their only World Series triumph. \nThere was plenty of emotion in that series, too. \n\"I think you just see so much drama at times because it's the postseason,\" Blue Jays shortstop Troy Tulowitzki said. \"Obviously, that series in Toronto (earlier this year) was two competitive teams. I think that's why we're here right now, because it's two teams that really take pride in doing things to protect their teammates, to show that the team has a better club.\" \nThe two best teams in the American League go about things in different ways. \nMuch like that '85 Royals team, this one is built upon pitching and defense -- hard-throwing starters and relievers, and enough speed to track down just about anything that stays in their park. \nThat was a big reason why they were able to down the Astros in their divisional series. \n\"A big part of their success is they flag the ball down, because a lot of teams can't, because the outfield is so big here,\" said Gibbons, a former bench coach in Kansas City. \"We're built a little bit differently. I think a lot of it has to do with where we play.\" \nThe Blue Jays play in hitter-friendly Rogers Centre, so naturally they're among the best in baseball at scoring with a single swing. Bautista's shot against the Rangers was proof, but so were the major league league-leading 232 homers that Toronto hit during the regular season. \nThat's why the Royals intend to pitch the Blue Jays inside, to mitigate their power. And also why there could be some testy moments when the teams begin their best-of-seven showdown. \n\"We all know Toronto is a better team than Houston. They've got more veteran guys and more power hitters,\" Volquez said. \"We're going to play our game. We're going to stay with the plan and do it. Like I said, do our best to win the game.\" 0", "external_links": [], "published": "2015-10-16T08:16:00.000+03:00", "crawled": "2015-10-16T12:06:36.637+03:00", "highlightTitle": ""}