{"organizations": [], "uuid": "263e959868c10e8d3bbd2a580ac6b647f02becf5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nytimes.com", "main_image": "http://static01.nyt.com/images/2015/10/24/sports/CITY-METS/CITY-METS-facebookJumbo-v2.jpg", "site_section": "http://www.nytimes.com/services/xml/rss/nyt/Sports.xml", "section_title": "NYT > Sports", "url": "http://www.nytimes.com/2015/10/24/sports/baseball/despite-thirst-for-world-series-mets-and-collins-savor-some-time-off.html?partner=rss&emc=rss", "country": "US", "title": "Despite Thirst for World Series, Mets and Collins Savor Some Time Off", "performance_score": 3, "site": "nytimes.com", "participants_count": 1, "title_full": "Despite Thirst for World Series, Mets and Collins Savor Some Time Off", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T05:43:00.000+03:00", "replies_count": 0, "uuid": "263e959868c10e8d3bbd2a580ac6b647f02becf5"}, "author": "SETH BERKMAN", "url": "http://www.nytimes.com/2015/10/24/sports/baseball/despite-thirst-for-world-series-mets-and-collins-savor-some-time-off.html?partner=rss&emc=rss", "ord_in_thread": 0, "title": "Despite Thirst for World Series, Mets and Collins Savor Some Time Off", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Despite Thirst for World Series, Mets and Collins Savor Some Time Off By SETH BERKMAN Supported by Photo Juan Uribe at the Mets’ voluntary workout at Citi Field on Friday afternoon. A chest injury has kept him from playing in either of the team’s postseason series. Credit Ben Solomon for The New York Times \nAdvertisement With over four decades of professional baseball experience, Mets Manager Terry Collins said he had never taken the time to dream about competing in the World Series. “I always wondered what I was going to do tomorrow,” Collins said. But tomorrow and every day until Tuesday, Collins will prepare his players for the Mets’ first World Series appearance since 2000 and his first World Series appearance ever. It will come 44 years after he hit .306 as a 22-year-old rookie with the Niagara Falls Pirates of the Class A New York-Pennsylvania League. It is, by any standard, a long wait. And yet on Friday, which marked the Mets’ first day back at Citi Field for baseball activity since winning the National League Championship Series, Collins still did not appear to be in any rush to get to the promised land. OCT. 22, 2015 He would not reveal his starting rotation for the Series or provide much of an update regarding injuries to Juan Uribe and Yoenis Cespedes, his injured infielder and outfielder. Instead, he spent the majority of the afternoon preaching the advantages of a respite that the Mets had earned from clinching the pennant early and how it would particularly benefit his veteran players and pitchers. Photo The Mets’ Jacob deGrom, who could start Game 1 of the World Series, during a voluntary workout at Citi Field. Credit Ben Solomon for The New York Times “The extra rest we’re going to get right now, I think, is going to benefit us more than hurt us,” Collins said. There are worries that teams can stunt their postseason momentum with too many days between series. In 2012, for instance, the Detroit Tigers swept the Yankees in the American League Championship Series, with their final victory coming on Oct. 18. They were then off for nearly a week before starting the World Series against the San Francisco Giants on Oct. 24. The Giants, on the other hand, had reached the Series after a seven-game battle with the St. Louis Cardinals that extended to Oct. 22, just two days before the Series began. But it was the Giants who had the upper hand once the Series started, winning in four straight. Collins knows all that, but it does not bother him. His concern lies with his team’s reliance on its young starting pitchers — Jacob deGrom, Steven Matz, Noah Syndergaard and Matt Harvey — who have all pitched more innings this season than in any other year of their professional careers. With each of those four expected to make at least one start in the Series, adding to those innings totals, a couple of extra days of rest right now would seem to be a blessing. Certainly, Collins sees it that way. “Our pitching right now could use a blow,” Collins said. “We’re pushing them pretty hard.” It is not as though Collins’s rotation will undergo any drastic changes when the Series starts. The Mets could tinker a bit with the rotation based on who their opponent is, but in all likelihood they will lean toward deGrom as the Game 1 starter, followed by Syndergaard, Harvey and Matz, the same order they used in sweeping the Chicago Cubs in the N.L.C.S. Collins said it was a possibility that deGrom, who has established himself as the team’s ace this season, could pitch three times in the World Series if there was a Game 7, which would almost certainly limit Harvey, already at 202 innings this year, to one start. But Collins also noted that deGrom had looked erratic at times in recent outings, which he attributed to a bit of fatigue. Continue reading the main story Sports Newsletter Get the big sports news, highlights and analysis from Times journalists, with distinctive takes on games and some behind-the-scenes surprises, delivered to your inbox every week. \nAdvertisement", "external_links": [], "published": "2015-10-24T05:43:00.000+03:00", "crawled": "2015-10-24T06:08:31.236+03:00", "highlightTitle": ""}