{"organizations": [], "uuid": "9a28f8a099de86b7acd53dedc380b4c7e56ef99d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "staugustine.com", "main_image": "http://staugustine.com/sites/default/files/14832078.jpg", "site_section": "http://staugustine.com/taxonomy/term/84759/2/feed", "section_title": "National Sports", "url": "http://staugustine.com/sports/national-sports/2015-10-23/dodgers-and-mattingly-part-ways-mutual-agreement", "country": "US", "title": "Dodgers and Mattingly part ways in mutual agreement", "performance_score": 0, "site": "staugustine.com", "participants_count": 1, "title_full": "Dodgers and Mattingly part ways in mutual agreement", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T07:09:00.000+03:00", "replies_count": 0, "uuid": "9a28f8a099de86b7acd53dedc380b4c7e56ef99d"}, "author": "BETH HARRIS", "url": "http://staugustine.com/sports/national-sports/2015-10-23/dodgers-and-mattingly-part-ways-mutual-agreement", "ord_in_thread": 0, "title": "Dodgers and Mattingly part ways in mutual agreement", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Dodgers and Mattingly part ways in mutual agreement Posted: October 23, 2015 - 12:09am | Updated: October 23, 2015 - 12:12am Photos Frank Franklin II FILE - In this Oct. 12, 2015, file photo, Los Angeles Dodgers manager Don Mattingly arrives for a news conference before Game 3 of baseball's National League Division Series against the New York Mets at CitiField in New York. A person familiar with the decision tells The Associated Press that Don Mattingly is out as manager of the Dodgers. The person spoke on the condition of anonymity Thursday, Oct. 22, 2015, because the team has not announced his departure(AP Photo/Frank Franklin II) By BETH HARRIS Associated Press \nLOS ANGELES — Don Mattingly won’t return as manager of the Los Angeles Dodgers next year after agreeing with his bosses that he and the team needed a fresh start. \nBefore they came to that decision, the parties discussed extending Mattingly’s contract beyond next year, its final season. \n“When we started on Friday we expected him to be our manager in 2016,” Andrew Friedman, president of baseball operations, said Thursday at a Dodger Stadium news conference. “I think that was his thought process also.” \nBut things clearly changed as the discussions wore on. Friedman and general manager Farhan Zaidi repeatedly declined to specify why the sides parted ways, all the while expressing their respect and admiration for Mattingly. \n“If there is a reason that this happened we would share it,” Friedman said. “It’s not so black-and-white here. There’s a huge middle, and it’s gray there. We’re not hiding anything. It really is how things played out.” \nLos Angeles was 446-363 in five years under Mattingly, finishing with a winning record in every season and claiming the last three NL West titles. But the Dodgers have not reached the World Series since winning the championship in 1988. \nThe 54-year-old former Yankees star ranks sixth in wins among Dodgers managers. \nFriedman said he expects to hire a manager by the start of baseball’s winter meetings that run Dec. 7-10 in Nashville, Tennessee. He and Zaidi began discussing possible candidates on Wednesday, including those with and without previous managerial experience. They declined to reveal names. \n“We expect to have a younger team going forward,” Zaidi said. \nThe contracts of Mattingly’s coaches are expiring, and they have been told they are free to look for new jobs, Friedman said. \nMattingly said in a statement distributed by the team that it’s “the right time and right move for both parties.” \nHe was scheduled to discuss his departure in a conference call later Thursday. \nZaidi said a contract extension was discussed, but no official offer was made. \n“I’ve had my own level of cynicism hearing about people mutually parting ways,” he said. “We can sit up here with all level of sincerity and say that’s how it came about.” \nFriedman called the circumstances of Mattingly’s departure “a little bit of an unusual situation. To boil it down to one thing, it just wasn’t that simple.” \nAfter the Dodgers lost 3-2 to the New York Mets in a decisive Game 5 of the NL Division Series, Mattingly met over the last week with Friedman, Zaidi and Josh Byrnes, senior vice president of baseball operations. \n“I never appreciated hearing the way Game 5 developed was Don Mattingly’s fault,” Friedman said. \nThe franchise with baseball’s highest payroll, a record $289.6 million as of the end of the regular season, managed just two playoff victories before losing to the Mets. \nLos Angeles reached the postseason in three straight years for the first time but the Dodgers won just one series, beating Atlanta in the Division Series two years ago, while losing three. \nMattingly was a holdover from the previous front office regime, having been manager Joe Torre’s hand-picked successor in 2010 after he coached under the Hall of Famer for seven seasons in New York and Los Angeles. \nMattingly returned to his offseason home in Evansville, Indiana, earlier this week. \n“I’m honored and proud to have had the opportunity to manage the Los Angeles Dodgers,” he said in a statement distributed by the team. “I’ve enjoyed my experiences and relationships with the organization’s staff and players throughout my eight years in LA.” \nMattingly worked this season under the new tandem of Friedman and Zaidi, who had greater hands-on management than what Mattingly was used to under former GM Ned Colletti. \nBetween Zaidi’s expertise in advanced analytics and Friedman’s reputation for building a roster by crunching numbers, Mattingly had a plethora of data at his disposal this season. \n“We encourage disagreement,” said Friedman, adding that Mattingly was free to make up the daily lineups as he saw fit. “There were plenty of times we disagreed with Donnie and Donnie disagreed with us.” \nThe laidback Mattingly had the support of his players, who appreciated his support and positive attitude. \n“He’s our guy and I believe in him,” first baseman Adrian Gonzalez said last week. \nLeft fielder Kike Hernandez said, “He had nothing to do with this.” \nMattingly said he still wants to manage. His name surfaced last month for the Miami Marlins’ opening. There also are current managerial openings in San Diego, Seattle and Washington. \nWhile there was speculation the Dodgers would need to make a deep postseason run for Mattingly to keep his job, the front office was publicly supportive of him. \n‘’We agreed to part ways with a guy who is a tremendous baseball guy,” Friedman said. “We’re going to do everything we can to find a really good leader for us in 2016.”", "external_links": [], "published": "2015-10-23T07:09:00.000+03:00", "crawled": "2015-10-23T07:43:24.395+03:00", "highlightTitle": ""}