{"organizations": ["Cardinals", "NCAA", "AP"], "uuid": "63d2bd34469451e0c838f5f61a39bacb673118ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.courier-journal.com", "main_image": "http://www.gannett-cdn.com/-mm-/a9f3f1aee2ed4170af48f4d8704553f6d7d028a2/c=0-211-2255-1485&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/05/Louisville/Louisville/635796739803467422-Louisville-Escorts-Ba-init.jpg", "site_section": "http://rssfeeds.courier-journal.com/courierjournal/sports", "section_title": "Courier Journal - Sports", "url": "http://www.courier-journal.com/story/sports/college/louisville/2015/10/05/dick-cady-says-katina-powells-claims-are-pretty-damn-credible/73420236/", "country": "US", "title": "Cady: Powell's claims 'pretty damn credible'", "performance_score": 0, "site": "courier-journal.com", "participants_count": 0, "title_full": "Cady: Powell's claims 'pretty damn credible'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T05:03:00.000+03:00", "replies_count": 0, "uuid": "63d2bd34469451e0c838f5f61a39bacb673118ce"}, "author": "", "url": "http://www.courier-journal.com/story/sports/college/louisville/2015/10/05/dick-cady-says-katina-powells-claims-are-pretty-damn-credible/73420236/", "ord_in_thread": 0, "title": "Cady: Powell's claims 'pretty damn credible'", "locations": ["Louisville", "Ind"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jeff Greer", "Joe Raymond", "Andre McGee", "Rick Pitino", "Powell", "McGee"], "text": "Cady: Powell's claims 'pretty damn credible' Jeff Greer , @jeffgreer_cj 11:25 p.m. EDT October 5, 2015 \"I base things on the truth,\" Rick Pitino said after being asked about his mindset regarding sex allegations of recruits in a book recently published. File-This Feb. 12, 2009, file photo shows Louisville coach Rick Pitino, left, talking with guard Andre McGee during the first half of an NCAA college men's basketball game against Notre Dame in South Bend, Ind. Louisville said Friday, Oct. 2, 2015, it has launched an investigation into allegations that former Cardinals staffer McGee paid an escort service to provide sex for recruits.(AP Photo/Joe Raymond, File) (Photo: Joe Raymond, AP) 261 CONNECT 167 TWEET LINKEDIN 5 COMMENT EMAIL MORE \nINDIANAPOLIS – The veteran journalist who co-authored a book filled with explosive allegations against the University of Louisville men's basketball program said Monday that the escort he wrote with is \"pretty damn credible.\" \nDick Cady, a Pulitzer Prize-winning journalist based in Indianapolis, insisted that Katina Powell – a Louisville prostitute who claims a former U of L staff member paid thousands of dollars and gave game tickets to her and other escorts, including her own daughters, to provide sexual services to players and recruits – \"never tried to back down or amplify or gussy something up.\" \n\"Every time that we went after a fact, we either found it or found something resembling it,\" said Cady, who did most of the book's reporting and writing with Patricia Keiffner, publisher of the Indianapolis Business Journal Book Publishing. \n\"Every time we hit her with a new question or an explanation, she came through. … I thought she was pretty damn credible for what she was.\" \nCady was a part of a team of Indianapolis Star reporters that won the 1975 Pulitzer Prize for Local Investigative Specialized Reporting for its work exposing police corruption. Cady and fellow Star journalist William Anderson were indicted for attempting to bribe a policeman in late 1974 when they say they followed an informant to witness what he said would be police bribery. Instead, they were accused of having a hand in the bribe, though those charges were dropped by the prosecutor, who said \"there is no evidence a crime has been committed.\" Cady has called the charges a \"frame-up\" job. Sullivan | What Pitino doesn't know could hurt him \nPowell's claims, chronicled in five journals that she allegedly kept from 2010-14, when she says the illicit activities took place, have prompted U of L to hire its own private investigator. The book, titled \"Breaking Cardinal Rules: Basketball and the Escort Queen,\" has also caught the attention of the NCAA's enforcement arm. \nThe former Louisville staffer in question, Andre McGee, who is now an assistant coach at University of Missouri-Kansas City, has been placed on administrative leave there and has hired Louisville lawyer Scott Cox. \nMcGee's former coach and employer, U of L head coach Rick Pitino, reiterated Monday to ESPN that neither he nor any of his other staff members or players who were at U of L from 2010-14 \"had any knowledge\" of Powell or the alleged activities involving Louisville's players or recruits. \nPowell, in a September interview with the IBJ, said McGee told her Pitino \"knows everything\" that goes on with his basketball program. \n\"That was the implication, yes,\" Cady said during an hour-long interview in his home on Monday. \nBut, he explained, that claim was not in the book, which was released online on Friday night, because Powell did not make that same claim to him or Keiffner. U of L accuser says she was told Pitino knew \n\"When you've got all this stuff going on for such a long time, and it's so loud – let's remember, they were playing rap music and hip hop, and it was so loud,\" Cady said. \"And nobody knows nothing? Yeah, OK.\" \nCady said he was first approached about Powell's book idea in April. Powell, he said, came to the IBJ \"with a bag full of her journals.\" After the IBJ's book division looked over the content of Powell's journals, Cady was asked to assess them and write the book. \n\"I didn't want to take part in the project,\" he said. \"I saw it as an awful lot of work involving a lot of time ...\" \nCady said he expected \"a lot of problems\" would pop up while researching the book. But he ultimately decided to take on the project because it was \"a hell of a story.\" \nCady and Keiffner took six months to report, write and edit the book. He estimated that he spoke to Powell 10-15 times, while Keiffner spoke with her \"practically every day.\" They read each page of Powell's journals, copies of which Cady keeps in a closet in his home office and stack about two feet high. Get the CJ’s free UofL CardsHQ newsletter \nThe IBJ hired Indianapolis-based Certified Fraud & Forensic Investigation to comb through Powell's phone and corroborate phone calls and text messages and match up the phone numbers she was claiming she was contacting. The firm digging through Powell's phone, Cady said, eased any concerns they had about the supposed \"virus\" that Powell claims in the book erased hundreds of text messages with McGee. \nAsked if the firm confirmed that it was indeed McGee who was contacting Powell, Cady thumbed a stack of cellphone data records and said, \"Oh, yeah.\" Cady declined to share the records with The Courier-Journal. \nAsked if he ever doubted the veracity of any of Powell's claims at any point in the process, Cady flatly said no. \n\"It seemed to me that there were three things there: No. 1, the university stuff; No. 2, this incredible thing about the escort business; and No. 3, the unbelievable thing about her and her daughters,\" Cady said, referring to Powell's claims that she used her daughters as entertainers and prostitutes. U of L hoops' accuser: 'Men wanted her body' \n\"I just thought it was a hell of a story. It is a hell of a story. Really, I can't think of any book that quite compares to it.\" \nCady also vehemently denied theories that have popped up over the weekend that Indiana University, and specifically IBJ chairman and IU booster Mickey Maurer, had ulterior motives to publishing the book after U of L lured ace recruiter Kenny Johnson away from IU after the 2013-14 season. \nOr that Keiffner, who was the general manager of the Lexington Chamber of Commerce from 1984-88, according to her LinkedIn page, had any desire to bring down the school that rivals the University of Kentucky. \n\"Not a factor at all,\" Cady said. \nAfter Cady and Keiffner approached U of L about the book in late August, the university hired former NCAA enforcement officer Chuck Smrt to conduct an investigation into Powell's allegations. \nU of L athletic director Tom Jurich said Friday that Smrt, who is coordinating his investigation with Louisville's athletics compliance office, is \"probably the No. 1 person in the country that does this kind of thing. We want to know the facts.\" \nJurich said the university would hand over to Smrt any and all video recordings kept at the Minardi Hall dormitory, where U of L's basketball players live and where Powell alleges that most of the parties took place. He also said U of L had provided Smrt and his team with the log-in and log-out books to Minardi Hall. U of L book leaves dots yet to be connected \nU of L's media relations director, John Karman, said Monday that EdR, a private firm that manages dormitories across the country, including four living halls at U of L and one at UK, was in charge of the front-desk security at Minardi Hall. \nBut Cady, with a strong sense of sarcasm in his voice, said logbooks wouldn't prove or disprove any of Powell's claims, and that he had also sought them out during their reporting for the book. Powell told Cady and Keiffner that there was \"one old man\" at the front desk when the escorts came through the front door with McGee for their parties. \n\"Well, yeah, they registered every time they went in: 'Katina Powell, hooker,'\" Cady said. \"You know what? A dorm is porous. You want to get your girlfriend in that dorm? You're going to get your girlfriend in that dorm, and her name ain't going to be on any log.\" \nThe book also mentions a side door used to access the building. \nCady said he and Keiffner met with Smrt and U of L's associate athletic director for compliance, John Carns, on Friday. McGee's lawyer, Cox, asked to be present at the meeting, but neither the investigators nor authors wanted Cox there, Cady added. \nCady said Keiffner spoke with Cox on Friday. Harrell says he knows nothing of allegations \n\"She is interested in money,\" Cox said, a statement that neither Powell nor Cady have denied. \nDuring the meeting with Smrt and Carns, Cady said the investigators asked most of the questions. When Cady and Keiffner, pressed for more information, asked Smrt if he had spoken with McGee, they \"never got an answer,\" Cady said. \nCady and Keiffner refused to hand over copies of the documentation they had collected for the reporting and writing process of Powell's book. They did not supply Smrt with any phone records or any of the journal entries that Powell wrote, he said. \nCady said he hoped Smrt and the investigative team reads the book for more information. \n\"My feeling is that they needed more groundwork before they could really jump into stuff,\" he said. \"They need to see the book.\" \nAt his meeting with U of L officials back in August, Cady said there \"might still be a couple skunks in the closet\" at Louisville. His reasoning, he said, is Powell alleges someone other than McGee called and told her that Louisville wanted them to start bringing white women to dance for players and recruits. She didn't know who called her. \n\"Who the hell was that?\" Cady asked. \nThat call, among other reasons, including the desire to be paid for her story, was part of the impetus for Powell to shop her book idea. Sullivan | U of L fans want answers, need patience \n\"If you look at the manuscript, the book, and read it carefully, there are some things that would suggest that, yes, someone else was involved,\" Cady said. \"These things are pretty obvious, and I think they need to be addressed. We certainly couldn't prove them, but they need to be addressed. Maybe they're not true. But maybe they are.\" \nIn the last chapter of the book, Cady wrote about meeting with Powell and the other escorts. In his interviews with the prostitutes and dancers, who were the only ones to confirm any of Powell's claims, Cady said the women were \"having fun\" with the U of L players and recruits. \nThe photos of the dancers and U of L players, sprinkled throughout the book, have come under sharp criticism by the book's skeptics because they do not explicitly depict any nefarious activity. Many of them resemble the scores of posed photos taken of basketball players in a hoops-loving city like Louisville. \nBut, Cady said, the only objective of the photos is to \"add to the texture and the reality of it.\" \n\"What do you want, pictures of guys getting (sex acts)?\" Cady said. \"You're not going to get that. You're not going to take that. But you've got the women undressing in the bathroom and on and on and on. \n\"Well, they know these women. Who are these women, anyway? Are they, by the way, strippers and hookers inside their dorm? Oh, OK … Where were the supervisors? Who's minding the store?\" Amid scandal, Pitino, players focus on hoops \nCady did reach four or five former Louisville players, he said, though many others declined to comment or hung up on him. He did not expect them to know anything, and they claimed they didn't, he said, \"but there were some other aspects that looked promising.\" \nHe acknowledged that many dots still need to be connected. He said if he and Keiffner had another six months to research Powell's claims, they would have \"made a chain that would wrap around someone's neck.\" \n\"We did the best we could,\" he said. \"The other side was, can those dots be connected by an independent investigation? Absolutely – if there is one. I get a little nervous when people start investigating themselves.\" \nA few minutes later, Cady said an \"independent investigation\" would vindicate the book and Powell. \n\"What if it's all true? Then how the hell could it happen?\" he said. \"What if it's half true? How the hell could it happen? What if it's one quarter true? How the hell could it happen? Ten percent? Shouldn't be going on.\" \nAn earlier version of this story has been updated to clarify the position of Patricia Keiffner, who is the publisher for Indianapolis Business Journal Book Publishing, not the Indianapolis Business Journal. 261 CONNECT 167 TWEET LINKEDIN 5 COMMENT EMAIL MORE Read or Share this story: http://cjky.it/1LeSEkA TOP VIDEOS", "external_links": [], "published": "2015-10-06T05:03:00.000+03:00", "crawled": "2015-10-06T10:42:33.235+03:00", "highlightTitle": ""}