{"organizations": ["Boston Herald"], "uuid": "d2a74dc43e9b61ea426b1cb8abc2bb747367abce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.google.com", "main_image": "http://www.bostonherald.com/sites/default/files/media/ap/d1d988b93bfc4275a1bf261c519a3225.jpg", "site_section": "http://news.google.com/news?pz=1&cf=all&ned=us&hl=en&topic=s&output=rss", "section_title": "Sports - Google News", "url": "http://news.google.com/news/url?sa=t&fd=R&ct2=us&usg=AFQjCNGaFsgWHKFQmnu1TUtfvvyGCPh0Lw&clid=c3a7d30bb8a4878e06b80cf16b898331&cid=52778974227013&ei=FWwrVuCPGtaLa4_lo_gL&url=http://www.bostonherald.com/sports/patriots/2015/10/patriots_enjoy_picking_on_ryan_fitzpatrick", "country": "IL", "title": "Patriots enjoy picking on Ryan Fitzpatrick - Boston Herald", "performance_score": 0, "site": "google.com", "participants_count": 0, "title_full": "Patriots enjoy picking on Ryan Fitzpatrick - Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T08:15:00.000+03:00", "replies_count": 0, "uuid": "d2a74dc43e9b61ea426b1cb8abc2bb747367abce"}, "author": "", "url": "http://news.google.com/news/url?sa=t&fd=R&ct2=us&usg=AFQjCNGaFsgWHKFQmnu1TUtfvvyGCPh0Lw&clid=c3a7d30bb8a4878e06b80cf16b898331&cid=52778974227013&ei=FWwrVuCPGtaLa4_lo_gL&url=http://www.bostonherald.com/sports/patriots/2015/10/patriots_enjoy_picking_on_ryan_fitzpatrick", "ord_in_thread": 0, "title": "Patriots enjoy picking on Ryan Fitzpatrick - Boston Herald", "locations": ["FOXBORO"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ryan Fitzpatrick"], "text": "FOXBORO — Ryan Fitzpatrick is plenty capable of hurting the Patriots. \nFor how long and whether he can lead his team to victory against them remain questionable, however. \nThat doesn’t mean that when his New York Jets come to Gillette Stadium tomorrow that he can’t help hand the Pats their first loss. What usually happens when Fitzpatrick leads a team against the Patriots, though, is he puts up decent yardage and completion-percentage numbers, but mistakes and costly turnovers do him in. \nThat’s the plan the Pats will try to follow against the signal caller who has been in the league since 2005 and faced the Patriots seven times as a member of the Buffalo Bills. In those contests, he had an 1-6 record with 13 touchdown passes and 17 interceptions. \nThe most glaring example of his up-and-down nature against the Pats came in the 2011 regular season finale at Gillette, when he led the Bills to a 21-0 lead in the first quarter with a pair of touchdown passes. He eventually ended up with four picks, though, in a 49-21 loss. \n“I think every time we’ve played him, he’s been pretty solid in terms of how he’s performed, what he’s done on the field,” safety Devin McCourty said. “I think he’s having a good year so far this year.” \nStill, the key stat is while Fitzpatrick has thrown for nine touchdowns this season, he has also been picked off seven times. \nThe difference this year, however, is Fitzpatrick is on a team with the No.1 defense in the league and one which possesses a running game that can exploit a Patriots defense that hasn’t shut opposing teams down when they commit to it. \nTherefore, getting Fitzpatrick to make those mistakes will be critical. \n“It’s big,” McCourty said. “We’ve got to take advantage of any turnover opportunities we do get. We know what it is. We’re going against a team with a good defense, a good running game, who if you do get opportunities, those could change the game.” \nJets coach and ex-Cardinals defensive coordinator Todd Bowles has brought a system over from Arizona that values the run game and play-action pass, and if linebacker Dont’a Hightower is not able to play tomorrow — he’s been sidelined with a rib injury suffered against the Dallas Cowboys — then that game plan could work against the Patriots. \nBut Fitzpatrick has thrown at least one pick in every game this season. \n“When you got two offenses, one offense that can run and our offense is good at moving the ball, sometimes that takes up clock, and there might not be many possessions in the game,” McCourty said. “So if you can get a turnover here or there, it’s big. Our defense will be looking for it, and I know New York, their defense will be looking for turnovers, too.” More On:", "external_links": [], "published": "2015-10-24T08:15:00.000+03:00", "crawled": "2015-10-24T14:32:10.452+03:00", "highlightTitle": ""}