{"organizations": [], "uuid": "a1a4f58b90e46b1f29a8891792ccfbe0ff65206c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "amestrib.com", "main_image": "http://amestrib.com/sites/amestrib.com/files/field/media/web1_HSFootball_GilbertVsBoone-BA-08_1.jpg", "site_section": "http://amestrib.com/taxonomy/term/3/feed", "section_title": "Sports", "url": "http://amestrib.com/sports/prep-football-dvorak-becoming-gilbert-s-lead-playmaker", "country": "US", "title": "Prep Football: Dvorak becoming Gilbert’s lead playmaker", "performance_score": 0, "site": "amestrib.com", "participants_count": 0, "title_full": "Prep Football: Dvorak becoming Gilbert’s lead playmaker", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T06:04:00.000+03:00", "replies_count": 0, "uuid": "a1a4f58b90e46b1f29a8891792ccfbe0ff65206c"}, "author": "", "url": "http://amestrib.com/sports/prep-football-dvorak-becoming-gilbert-s-lead-playmaker", "ord_in_thread": 0, "title": "Prep Football: Dvorak becoming Gilbert’s lead playmaker", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Dvorak", "Gilbert"], "text": "Prep Football: Dvorak becoming Gilbert’s lead playmaker Prep Football: Dvorak becoming Gilbert’s lead playmaker \nGilbert's Cody Dvorak leads the Tigers with 792 rushing yards and 12 touchdowns. File Photo by Brian Achenbach/Special to the Tribune Prep Football: Dvorak becoming Gilbert’s lead playmaker \nGilbert's Cody Dvorak has scored 14 total touchdowns, including by rushing, this season. File Photo by Brian Achenbach/Special to the Tribune \nBy Cody Goodwin cgoodwin@amestrib.com \nGILBERT — Before the Gilbert football team played Bondurant-Farrar on Friday night, a coach in the press box raved about the Tigers’ star tailback, Cody Dvorak. He praised his speed, gushed over his playmaking ability and talked of how he can make cuts on a dime. \n“Just watch,” he told anybody who would listen. “You’ll see.” \nDvorak backed up all the hype on the game’s first play from scrimmage. He took the opening kickoff 90 yards for a touchdown and caused those in attendance — and there were plenty, with it being Gilbert’s homecoming game — to stand and roar loudly as he waltzed into the end zone. \n“Told ya,” the coach leaned back and said afterward. \nThe game, a 22-20 Tiger victory, became another stellar showing for Dvorak, a junior who is the lead playmaker for a team that’s now won five-straight games. He ended up scoring three touchdowns and rushing for 146 yards on just 15 carries. \nDvorak has accounted for 16 total touchdowns this season — 12 rushing, two receiving, one on a punt return and another on Friday night’s opening kickoff. He had 18 total last season. There are still three regular-season games to be played. \nEven more, Dvorak has rushed for 792 yards, averaging 132 per game. By that figure, he is on pace to finish the regular season with 1,188 rushing yards, which would be 87 more than he had through 11 games a year ago. \nThe coach in the press box said before Friday night’s game that Dvorak might be the fastest high-school football player he’s ever seen. Gilbert head coach Scott Auderer took it a step further. \n“He’s unbelievable,” he said. “He’s one of the best high school athletes I’ve ever coached in my 23 years. He’s just that gifted.” \nAuderer added that Dvorak possesses the rare capability to completely change the game anytime he touches the ball. Against Bondurant-Farrar, he showed why. \nAfter his kickoff-return score, the Blue Jays rattled off 13-straight points to take the lead, but it lasted just one play. Dvorak took a handoff down the left side for a 60-yard touchdown run, putting Gilbert back in the lead. \nAt one point during Friday’s game, Dvorak had touched the ball just four times and had scored three touchdowns. \n“I have to give all the credit to my blockers,” he said. “I wouldn’t be able to do what I do without them. Half the time, when we’re running plays to the edge, even the receivers, they’re blocking all the way down the field. \n“That’s the reason I’m doing as well as I am. That’s all on my teammates. It’s not just me. It’s a team effort.” \nDvorak’s success is forcing opposing teams to key in on him. Gilbert is trying to use that to its advantage by shifting him away from the play, he said, allowing other players to shine with the ball in their hands. \nZach Becker, the thunder to Dvorak’s lightning, has been the primary beneficiary. He’s rushed for 478 yards this season and has scored six touchdowns — the latter of which is the second-most on the team behind Dvorak. \nBecker was Gilbert’s workhorse as a sophomore in 2013, when he rushed for 1,001 yards and scored 15 touchdowns. He tore up his knee before last season, and has eased his way back into action this year. \nOn Friday, Becker went down with another injury, but fought through it and continued playing. It is unclear how healthy he will be moving forward, but Dvorak appears to be more than capable of carrying the load on his own, if need be. \n“He did a lot of work on his own (on Friday),” Becker said. “His run game’s improved a lot. His ability to read blocks, his field vision — he’s come a long way. It’s been good.”  ", "external_links": [], "published": "2015-10-04T06:04:00.000+03:00", "crawled": "2015-10-04T10:22:53.149+03:00", "highlightTitle": ""}