{"organizations": ["Arizona Cardinals", "Pittsburgh Steelers", "NFL", "Steelers Arizona Cardinals", "Pittsburgh Steelers <!--iframe--> Kent Somers"], "uuid": "5f5b9fb5eed7e01f8b1daeaecdacebde98d6cf8b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.azcentral.com", "main_image": "http://www.gannett-cdn.com/-mm-/164332a32994a1186b9d6e757c5331bd8658bfff/c=0-113-4000-2373&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/18/Phoenix/Phoenix/635807827832493637-Cardsfront2.jpg", "site_section": "http://rssfeeds.azcentral.com/phoenix/sports", "section_title": "Phoenix - Sports", "url": "http://www.azcentral.com/story/sports/nfl/cardinals/2015/10/18/arizona-cardinals-stumble-bumble-way-loss-against-pittsburgh-steelers/74182916/", "country": "US", "title": "Cardinals stumble, bumble way to loss against Steelers", "performance_score": 0, "site": "azcentral.com", "participants_count": 0, "title_full": "Cardinals stumble, bumble way to loss against Steelers", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T23:46:00.000+03:00", "replies_count": 0, "uuid": "5f5b9fb5eed7e01f8b1daeaecdacebde98d6cf8b"}, "author": "", "url": "http://www.azcentral.com/story/sports/nfl/cardinals/2015/10/18/arizona-cardinals-stumble-bumble-way-loss-against-pittsburgh-steelers/74182916/", "ord_in_thread": 0, "title": "Cardinals stumble, bumble way to loss against Steelers", "locations": ["Pittsburgh"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["John Brown", "James Harrison"], "text": "Arizona Cardinals stumble, bumble way to loss against Pittsburgh Steelers <!--iframe--> Kent Somers , azcentral sports 2:51 p.m. MST October 18, 2015 Arizona Cardinals wide receiver John Brown (12) fumbles after being hit by Pittsburgh Steelers outside linebacker James Harrison (92) in the third quarter of an NFL football game on Sunday, Oct. 18, 2015, in Pittsburgh. (Photo: Don Wright/AP) 6 CONNECT 4 TWEET LINKEDIN 11 COMMENT EMAIL MORE \nPITTSBURGH – If playing poorly and winning is the next step in the Cardinals’ evolution, they are still waiting to take it. \nIt didn’t happen on Sunday when the Cardinals stumbled and bumbled their way to a 25-13 loss to the Steelers at Heinz Field. \nThe Cardinals committed eight penalties for 96 yards and committed three turnovers, the final one coming with 2:20 remaining. \nThe Cardinals (4-2) were driving and had a first down at the Steelers 20. \nBut Carson Palmer’s pass to John Brown was intercepted by safety Mike Mitchell in the end zone . \nPalmer appeared to never see Mitchell, who broke on the ball quickly. \nThe Steelers then put the game away. Landry Jones, who relieved Mike Vick in the second half, hit Martavis Bryant on a simple “in” route. \nBryant evaded safety Tyrann Mathieu, out-ran cornerback Patrick Peterson and scored from 88 yards out. \nThat gave the Steelers a 25-13 lead with 1:58 remaining. \nThe Steelers scored the first 15 points of the second half to take a 15-10 lead midway through the third quarter. \nThey kicked a field goal on their first possession and took advantage of a Cardinals fumble on the second. \nLinebacker James Harrison blasted Brown, dislodging the ball. \nThe Steelers recovered at the Cardinals 32, and scored four plays later. The two-point conversion failed but the Steelers had their first lead of the day. \nThe Cardinals offense, which moved the ball in the second half, spun in place in the third quarter, thanks to Brown’s fumble and a holding call on guard Jonathan Brown. \nThe Cardinals finally got something going on offense late in the quarter. Carson Palmer hit John Brown with a 42-yard pass that set up a 39-yard field goal to make it 15-13. \nThe Steelers responded with a field goal, to extend the lead to five points. \nThe Cardinals dominated the first half in every significant statistic except score. They had just a 10-3 lead at intermission despite gaining 279 yards to Pittsburgh’s 59, including a 233-to-1 passing yardage ratio. \nThat’s right. The Steelers had 1 passing yard in the first half. \nYet, they trailed by only a touchdown because they gained 75 yards on Cardinals penalties. \nThat did not please Cardinals coach Bruce Arians, who called a timeout late in the half in part because he wanted to complain to referee Ed Hochuli. \nIt didn’t help. Two plays later, Steelers cornerback Ross Cockrell pulled receiver Michael Floyd’s T-shirt after Floyd ran by him in the end zone \nThe pass was incomplete and the Cardinals had to kick a field goal to make it 10-3. \nThe Steelers went nowhere against the Cardinals defense, which obviously had no respect for the Steelers’ suspect passing game. \nThey limited running back Le’Veon Bell to 29 yards on 10 carries in the first half. \nVick completed just 3 of 7 passes for 6 yards. \nPalmer, meanwhile, passed for 233 yards, but the Cardinals were hindered by penalties, including a personal foul call on tackle Bobby Massie, a chop block on running back Chris Johnson and pass interference call on Floyd. \nPhotos from the Cardinals-Steelers game: Like this topic? You may also like these photo galleries: Replay", "external_links": [], "published": "2015-10-18T23:46:00.000+03:00", "crawled": "2015-10-19T01:37:13.483+03:00", "highlightTitle": ""}