{"organizations": [], "uuid": "ec6cc61e666289822e481327308d07b6d78fa39b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mcall.com", "main_image": "http://www.trbimg.com/img-5621b327/turbine/mc-divisionsiiandiii-football-preview-capsules-1016-20151016", "site_section": "http://www.mcall.com//sports/college/rss2.0.xml", "section_title": "College Sports - The Morning Call", "url": "http://www.mcall.com/sports/college/mc-divisionsiiandiii-football-preview-capsules-1016-20151016-story.html", "country": "US", "title": "East Stroudsburg, Kutztown, Moravian and Muhlenberg football preview capsules", "performance_score": 0, "site": "mcall.com", "participants_count": 1, "title_full": "East Stroudsburg, Kutztown, Moravian and Muhlenberg football preview capsules - The Morning Call", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T06:14:00.000+03:00", "replies_count": 0, "uuid": "ec6cc61e666289822e481327308d07b6d78fa39b"}, "author": "Tom Housenick", "url": "http://www.mcall.com/sports/college/mc-divisionsiiandiii-football-preview-capsules-1016-20151016-story.html", "ord_in_thread": 0, "title": "East Stroudsburg, Kutztown, Moravian and Muhlenberg football preview capsules", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NO. 18/18 HARVARD (4-0) AT LAFAYETTE (1-5)\nWhen: 3:30 p.m. Saturday, Oct. 17, Fisher Stadium, Easton.\nSeries: Crimson 15-3. Last meeting: Crimson 24-14 ('14).\nVideo streaming: Campus Insiders, goleopards.com.\nLafayette leaders: DeSean Brown, 53 car, 197 yds, 1 TD; Drew Reed, 100-149-3, 988 yds, 6 TDs; Matt Mrazek, 34 rec, 395 yds, 2 TDs; Rocco Palumbo, 28 rec, 239 yds; Brandon Bryant, 73 tackles (5.5 TFL); Jared Roberts, 3 interceptions.\nHarvard leaders: Paul Stanton, 63 car, 375 yds, 5 TDs; Noah Reimers, 36 car, 165 yds, 5 TDs; Scott Hosch 63-107-1, 952 yds, 9 TDs; Anthony Firkser, 12 rec, 223 yds, 1 TD; Jacob Lindsey, 26 tackles (3 TFL); Dan Moody, 3 sacks.\nThe skinny: Crimson has dominated a weak non-Ivy League schedule, scoring 179 points, allowing just 40. Senior-loaded team – 8 starters on offense, 9 starters on defense. Veteran offensive line hasn't allowed a sack. Crimson has scored points on 17 of 21 trips into the red zone. Injury-plagued Leopards have had problems on both sides of the ball. Offense has points in only 8 of 17 red-zone trips and has allowed opponents to block the last four FG tries. Defense has allowed opponents to convert 53 percent of third-down plays. Running game has been almost non-existent. Loss would put Leopards at 1-6 for the firtst time since 2010.\nPaul Reinhard's pick : Harvard 38-17.\nTwitter: Follow @Reinhardpaul for in-game tweets.\nMILLERSVILLE (0-6 overall, 0-3 PSAC EAST) at ESU (3-3, 2-1)\nWhen/Where : 2:05 p.m. today, Eiler-Martin Stadium, East Stroudsburg\nTV :Blue Ridge TV-13, esuwarriors.com\nRadio : WVPO-AM 840 AM and redzonemedia.com\nSeries : ESU leads 40-25-1\nLast meeting : ESU won 35-13 last year in Millersville.\nMillersville leaders :Fr. RB Phil Overton (59 carries, 208 yards, 1 TD; 12 catches, 91 yards, 3 TDs); Jr. QB J.J. Paige (72 of 121, 696 yards, 5 TDs, 3 INTs); So. WR Kevin Wiggins (19 catches, 216 yards); Sr. S Rasheed Johnson (71 tackles, 2 for loss, 1 INT); Fr. LB Rob Varner (52 tackles, 3.5 for loss, 1 INT); So. LB Sean Dugan (45 tackles, 4.5 for loss).\nESU leaders :Jr. RB Robert Healy (80 carries, 478 yards, 1 TD; 31 catches, 505 yards, 1 TD); Sr. QB Matt Soltes (153 of 272, 2,348 yards, 27 TDs, 6 INTs); Sr. WR Jon Schnaars (62 catches, 902 yards, 14 TDs); Sr. RB Gerald Van De Cruz (74 carries, 264 yards, 9 TDs); So. S Marc Gaudet (41 tackles, 1 INT); So. LB Sekou Jones (39 tackles, 6 for loss, 1.5 sack); Jr. S Jimmy Verzicco (35 tackles, 1 INT)\nThe skinny :ESU has scored 60 points in consecutive games for the first time in program history, including last Saturday's 69-7 rout of Cheyney. Millersville has scored 67 points this season. … Healy (983 rushing yards) and Schnaars (902 receiving yards) have the most combined rushing/receiving yards of any Division II tandem. … Soltes leads Division II in passing yards, TD passes and total offense. … Schnaars leads Division II in receptions, receiving yards and receiving TDs. … Healy needs 156 rushing yards to become ESU's career leader (Rick Sterner, 2,579 from 1998-92). … Millersville has lost its last 35 games in a row to teams other than Cheyney and hasn't won a PSAC game against someone other than Cheyney since beating ESU 31-27 on Oct. 22, 2011. … Van De Cruz's fourth-quarter TD last week, a 6-yarder, was the longest of his 21 career scores. … Johnson's 71 tackles lead the PSAC.\nKUTZTOWN (3-3, 2-1) AT BLOOMSBURG (4-2, 3-0)\nWhen/Where : 2 p.m. today, Danny Hale Field at Robert Redman Stadium, Bloomsburg\nTV :None\nRadio : KU Radio-1670 AM ( www.Kutztown.edu/KUR ), WHLM-930 AM ( www.whlmam.com )\nSeries : Bloomsburg leads 46-21-1.\nLast meeting : Bloomsburg won 31-13 last year in Kutztown.\nBloomsburg leaders :Jr. RB Lawrence Elliott (104 carries, 675 yards, 5 TDs); Sr. QB Tim Kelly (76 fro 149, 809 yards, 3 TDs, 5 INTs); Jr. WR Chad Hoffman (16 catches, 201 yards); Sr. LB Tyrik Clary (31 tackles, 4 for loss, 1 INT); Jr. S Jerrin Toomey (29 tackles, 2 INTs); So. DB Mark Collins (27 tackles).\nKutztown leaders :Sr. QB Chad Barton (104 of 159, 1,347 yards, 12 TDs, 6 INTs); Jr. WR Kellen Williams (30 catches, 500 yards, 5 TDs); Sr. WR Kodi Reed (28 catches, 447 yards, 4 TDs); Sr. RB Terry Williams (42 carries, 211 yards, 2 TDs); Fr. ATH Craig Reynolds (16 carries, 205 yards, 2 TDs; 23 catches, 208 yards); Jr. LB Zack Delp (38 tackles, 5 for loss, 2 sacks); Jr. S Kurt Kenny (32 tackles, 1.5 for loss, 1 INT).\nThe skinny :Whitehall grad Andrew Harris, a junior linebacker, is among seven area players at Bloomsburg. He has 20 tackles, 2.5 for loss. Pen Argyl product Scott Beltz, a sophomore defensive end, has 15 tackles (1.5 sacks). Tony David, a senior defensive end from Salisbury, has 10 tackles (1 sack). Pocono Mountain West product Travon Pugh, a junior defensive back, has four tackles. Junior tight end Nate Hoenl, a Whitehall product, has 10 catches for 110 yards and 1 TD. Sophomore Jesse Mancuso from Stroudsburg is the second-string left guard. Pocono Mountain West grad Qmac Quiteh is a freshman running back. … Bloomsburg has the fourth-most wins in Division II (146-38) since 2000. … The Huskies have 16 consecutive winning seasons and are 21-0 when leading at halftime under coach Paul Darragh. … The Huskies have had a 1,000-yard rusher in 13 of last 15 seasons. … The Huskies are first in the PSAC in scoring defense (14.3 ppg.). … Bloomsburg has won the last 10 meetings at home.\nMORAVIAN (4-1 overall, 3-1 Centennial Conference) AT SUSQUEHANNA (2-3, 1-3)\nWhen/Where : 1 p.m. today, Amos Alonzo Stagg Field at Lopardo Stadium, Selinsgrove\nTV :None\nRadio : None\nSeries : Moravian leads 21-20-1\nLast meeting : Susquehanna won 24-21 last year in Bethlehem.\nSusquehanna leaders :So. QB Nick Crusco (100 of 168, 1,057 yards, 9 TDs, 9 INTs); So. RB Cameron Ott (50 carries, 256 yards, 1 TD); So. WR Diamente Holloway (22 catches, 352 yards, 2 TDs); Sr. WR Patrick Cutillo (32 catches, 248 yards, 4 TDs); Sr. LB Jim Barry (56 tackles, 2.5 for loss, 2 fumble recoveries); Sr. DB Tim Lurz (50 tackles, 2.3 for loss); Sr. LB Mason Spangler (Emmaus grad, 31 tackles, 1.5 for loss).\nMoravian leaders :Jr. RB Chris Negron (138 carries, 684 yards, 11 TDs; 12 catches, 114 yards); So. RB Eli Redmond (51 carries, 215 yards, 4 TDs; 8 catches, 85 yards, 2 TDs); Jr. QB Mike Hayes (69 of 121, 833 yards, 6 TDs, 4 INTs); Jr. WR Jalen Snyder-Scipio (21 catches, 213 yards, 3 TDs); Sr. S Anthony Orlando (39 tackles, 2 INTs, 1 fumble recovery); Sr. LB Brendan Downey (37 tackles); Fr. LB Steve Ewald (31 tackles, 3 sacks, 1 INT).\nThe skinny : Susquehanna senior linebacker Tom McLoughlin has 23 tackles in two games and both times was named conference defensive player of the week. … After Saturday, Moravian's last four games are in the Lehigh Valley (three in a row at home followed by the regular-season finale at rival Muhlenberg). … Moravian is 4-1 for the first time since 2008. … Hayes is 11 t h on Moravian's career passing yardage list with 2,514 yards. … Palmerton grad John Snyder had four tackles for loss, including two sacks, and a forced fumble in Moravian's rout two weeks ago of Ursinus. … Susquehanna has won the last four meetings. … Negron ran for 202 yards, 2 TDs in last year's meeting. He currently leads the conference in rushing and scoring.\nMUHLENBERG (3-2, 2-2) AT GETTYSBURG (5-0, 4-0)\nWhen/Where : 1 p.m. today, Shirk Field at Musselman Stadium, Gettysburg\nTV :None\nRadio : None\nSeries : Gettysburg leads 43-35-1\nLast meeting : Muhlenberg won 47-6 last year in Allentown.\nGettysburg leaders :Sr. TB Kyle Wigley (105 carries, 602 yards, 5 TDs); Sr. QB Sam McDermott (66 of 119, 1,056 yards, 15 TDs, 2 INTs; 67 carries, 367 yards); Jr. WR Jordan Kelso (21 catches, 373 yards, 6 TDs); Sr. LB Kodie McNamara (52 tackles, 3 for loss); Jr. LB Chris Miller (45 tackles, 4 for loss); Sr. DB Mike Kornegay (38 tackles).\nMuhlenberg leaders :Jr. QB Nick Palladino (105 of 152, 1,138 yards, 12 TDs, 6 INTs; 63 carries, 326 yards, 1 TD); So. TB Nick Savant (56 carries, 329 yards, 4 TDs); Jr. WR Ryan Delaney (31 catches, 307 yards, 3 TDs); Sr. LB Lenny Smith (37 tackles, 2 sacks); So. LB Jake Morra (33 tackles, 2.5 for loss, 1 fumble recovery); Fr. S Luke Wiley (25 tackles, 2 INTs, 1 fumble recovery).\nThe skinny :Palladino needs six yards to move into second place on Muhlenberg's career passing yardage list (Eric Santagato, 6,152). ... McNamara has 341 career tackles, including a career-high 20 in a Week 2 win over Ursinus, and a 3.9 GPA as a mathematics major. His 52 tackles are third-most this year in the conference. … Muhlenberg has won the last three meetings. … Gettysburg has not been to the postseason since 1985. … Muhlenberg leads the conference in rushing defense (97.8 yards per game allowed) and total defense (278.6 ypg). … Gettysburg is first in rushing offense (301.2 ypg) and total offense (512.4 ypg). ... Muhlenberg also leads the conference in opponents' fourth-down conversions (1 of 9 made) and time of possession. … Gettysburg's Brian Calatozzo is tied for the Division III lead with five interceptions. ... Gettysburg hasn't started 6-0 since 1987. … Today's winner takes home the Old Tin Cup which has been part of the rivalry off and on since 1954.\nDivision II and III capsules compiled by Tom Housenick", "external_links": ["http://www.Kutztown.edu/KUR"], "published": "2015-10-17T06:14:00.000+03:00", "crawled": "2015-10-17T06:14:16.950+03:00", "highlightTitle": ""}