{"organizations": [], "uuid": "778c8d61ca61776e52d682622dae48860ee12038", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266381/sports-general", "section_title": "Sports: General - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30313804/the-florida-knifemakers-associations-18th-annual-custom-knife-show-is-scheduled-for-dec-5-6-in-sikes-hall-at-the-lakeland-center", "country": "US", "title": "The Florida Knifemakers Associations 18th Annual Custom Knife Show Is Scheduled for Dec. 5-6 in Sikes Hall at the Lakeland Center", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "The Florida Knifemakers Associations 18th Annual Custom Knife Show Is Scheduled for Dec. 5-6 in Sikes Hall at the Lakeland Center - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T15:11:00.000+03:00", "replies_count": 0, "uuid": "778c8d61ca61776e52d682622dae48860ee12038"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30313804/the-florida-knifemakers-associations-18th-annual-custom-knife-show-is-scheduled-for-dec-5-6-in-sikes-hall-at-the-lakeland-center", "ord_in_thread": 0, "title": "The Florida Knifemakers Associations 18th Annual Custom Knife Show Is Scheduled for Dec. 5-6 in Sikes Hall at the Lakeland Center", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Talented artisans from around the Sunshine State will put their handiwork on display at the Florida Knifemakers Association’s 18th annual Custom Knife Show Dec. 5-6 at the Lakeland Center. Details about the intricacy of their artistry can be found at http://www.floridaknifemakers.org/show.html .\nLakeland, FL (PRWEB) October 21, 2015\nSteel, wood and ivory transformed into the stuff dreams are made of will be on display at the Florida Knifemakers Association’s 18th annual Knife Show, Dec. 5-6, at the Lakeland Center. Admission is $10. The pubic is invited to attend. For details, visit http://www.floridaknifemakers.org/show.html .\nThe popular show features artisans from Pensacola to Key Largo who use their talent and imagination to painstakingly and passionately work with exotic materials, to create custom, modern, vintage and collectible knives.\nShow hours are Saturday, 10 a.m. to 5 p.m., and Sunday, 9 .m. to 3 p.m. Parking is free. Organizers said a limited number of vendor slots are still available. In all, 100 display tables are anticipated in Sikes Hall when the doors open Dec. 5 at The Lakeland Center, 701 W. Lime St. Lakeland, FL.\nFKA President, John Davis says Florida’s knifemakers represent people from all works of life: Dentists, lawyers, construction workers, and office workers.\n“All have a passion,” he said. “That passion has taken them into making their own knives—their own pieces of art.”\nSome of the handiwork on display will concentrate on overall functionality and cutting ability. Other examples reveal the maker’s imagination and go beyond functionality into artistry, in effect painting a picture with steel, wood and ivory, that tells a story in three dimensions.\nCenterpiece of the show is FKA’s first ever raffle knife, a collaborative work of functional art: Damascus forged, ground, etched, and polished by FKA President Davis, with finger-guard, pommel, spacers and file work and fit-up by Ralph Turnbull. Master Engraver, Roland J. Robidoux, was tabbed to add finishing touches. After engraving, the knife goes to Jimmie Smith for scrimshaw and its presentation box\n\"It was a privilege to be associated with this worthwhile project,\" said Turnbull, an award-winning artisan who has been making quality knives since 1973.\n“100 percent of the proceeds will go to the Shriners Hospitals for Children ,” said FKA President Davis, adding that the drawing will be at the FKA Show on Sunday, Dec. 6.\n“The Florida Knifemakers' Association was founded in 1997, to promote and advance the craft, art, and science of knife making and to improve the overall quality, performance, and value of knives, edged tools, cutlery, and related products,” Davis said.\nThe Association assists members with respect to technical and esthetic values, quality of work, and business ethics, he said. It also works to educate the general public with respect to the fabricating processes and the skills involved in knife making.\nThe annual Knife Show is one FKA’s major outreach efforts.\nKnife making and ownership is more than a hobby, says the organization’s president. He described it as a passion with a deep connection to the past, drenched in rich memories.\n“For as long as I can remember, I’ve had a knife in my pocket,” Davis recalls. “Even as a 5-year-old heading to the woods to go fishing, I had a knife in my pocket,” adding that, “My Dad made sure I knew how to use it.”\nFor more information about the Florida Knifemakers Association and its upcoming show, including details about FKA’s first official Club Knife raffle, contact Jimmie Smith at (352) 771-6481, John David at (209) 740-7125 or visit http://www.floridaknifemakers.org/index.html .\nABOUT: The Florida Knifemakers Association was founded in 1997 to promote and advance the craft, art, and science of knife making. The 18th annual FKA Custom Knife Show takes place in Sikes Hall at the Lakeland Center. Show hours are Saturday, Dec. 5, 10 a.m. to 5 p.m., and Sunday, Dec. 6, 9 .m. to 3 p.m. Admission is $10. Parking is free. ( https://www.facebook.com/Florida-Knifemakers-Association-272251796212165 )\n //www.prweb.com/releases/FKAclubknifeShriners/HopitalsforChildren/prweb13027329.htm\n ", "external_links": ["https://www.facebook.com/Florida-Knifemakers-Association-272251796212165", "http://www.floridaknifemakers.org/index.html", "http://www.floridaknifemakers.org/show.html", "http://www.prweb.com/releases/FKAclubknifeShriners/HopitalsforChildren/prweb13027329.htm"], "published": "2015-10-21T15:11:00.000+03:00", "crawled": "2015-10-21T19:47:40.052+03:00", "highlightTitle": ""}