{"organizations": [], "uuid": "2d61f9dfd4393fd4d63d936a62c51643549a2fad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bernews.com", "main_image": "http://cloudfront.bernews.com/wp-content/uploads/2015/10/argo-gold-cup-finals-2015-37-FBB-header.jpg", "site_section": "http://bernews.com/category/sports/feed", "section_title": "Bernews.com » Sports", "url": "http://bernews.com/2015/10/photos-minoprio-wins-67th-argo-group-gold-cup/", "country": "US", "title": "Photos & Results: Argo Group Gold Cup Finals", "performance_score": 0, "site": "bernews.com", "participants_count": 1, "title_full": "Photos & Results: Argo Group Gold Cup Finals", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T19:59:00.000+03:00", "replies_count": 0, "uuid": "2d61f9dfd4393fd4d63d936a62c51643549a2fad"}, "author": "M", "url": "http://bernews.com/2015/10/photos-minoprio-wins-67th-argo-group-gold-cup/", "ord_in_thread": 0, "title": "Photos & Results: Argo Group Gold Cup Finals", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "October 12, 2015 | 0 Comments \nAdam Minoprio is a past match racing world champion [2009] but hasn’t sailed a regatta this year, however he made an emphatic statement in his return to the helm, winning the Argo Group Gold Cup on Sunday [Oct 11]. \nMinoprio’s BlackMatch team from New Zealand defeated Keith Swinton’s Black Swan Racing from Australia, 3-2, in the final of the 67th annual Argo Group Gold Cup. \nMinoprio and crew Nick Blackmon, Andrew Burgess and Tom Powrie won $35,000 of the $100,000 prize purse. Swinton and crew Ted Hackney, Henry Kernot and Björn Lundgren won $16,000. \nSlideshow with 200 photos of the Argo Group Gold Cup final day: \n. \n“I’m ecstatic. It’s amazing. I’ve been trying to win this event for a long time and to do so feels wonderful,” said the 30-year-old Minoprio from Auckland, New Zealand, who was competing for the sixth time. “Some of my crew talked me into coming back here and we were able to get some good results and have a good time.” \nMinoprio has previously finished runner-up twice [2008, ’09] and today he had to work hard for the victory. With a southerly wind blowing around 10 knots the crews were racing the width of Hamilton Harbour. That placed the windward mark under the southern shore and in very shifty and patchy winds. \nNo lead was safe coming out of the windward mark and there were frequent lead changes, including the fourth race when it appeared Minoprio would seal the victory. He led by about four boatlengths beginning the run to the finish line but Swinton overcame his rival with a series of jibes and a final luff to force the final, winner-take-all race. \n“We thought we might’ve broken their spirit on that one,” said the 29-year-old Swinton from Perth, Western Australia. “We’re disappointed to lose but happy with our performance. Adam kept improving throughout the day, especially his starts, while our performance stayed the same.” \nIn the fifth and final race Minoprio forced Swinton into a poor start that saw the Aussie put in a jibe at the committee boat end as the start gun sounded while Minoprio sailed onto the course with speed. Swinton trailed all the way around and although it appeared he might have one final chance after rounding the windward mark for the final time, it never materialized. \n“We were in a bad spot there,” Swinton said of the start. “It couldn’t have been much worse.” \nMinoprio and Swinton made the final after winning their semifinal matches against Taylor Canfield’s US One and Björn Hansen’s Nautiska Racing, respectively. \nCanfield entered the final day of racing with an undefeated record [10-0] and seemingly on a course to the championship. He chose to race Minoprio because he thought that the Kiwi was rustier than the other sailors since he hadn’t match raced all year. But that decision backfired in the fifth and deciding race. \nMinoprio was over the start line early in the final race, which gave Canfield a large early lead. Canfield maintained that advantage around the course and led by about 30 seconds at the final windward mark. \nAfter rounding he jibed to starboard while Minoprio held port after rounding. Moments later it was apparent that Canfield was in trouble as his spinnaker hung from the rigging. Minoprio, however, was sailing down in a nice streak of pressure that he used to cross the finish line about two lengths ahead of Canfield and into the final. \n“We got nervous about halfway down that leg,” said Canfield, 26, from St. Thomas in the U.S. Virgin Islands. “It was a tricky balance of boat-on-boat sailing versus tactical sailing. We were maneuvering in between the puffs and trying to cover. It was the worst case scenario.” \nSwinton, meanwhile, watched that race from the dock as he advanced to the final after defeating Hansen, 3-1. Swinton seemed to attack Hansen in the pre-starts, but the Swede said he was happy with his starting. Swinton just found better pressure on the racecourse to pull out the victory. \n“It was a minefield out there,” said Hansen, 47, from Mariehamm, Sweden. “When you’re ahead you have to choose which mark to round and you don’t always have time to see where the puffs are. Or if you see them, sometimes they’re gone when you get there. We took the wrong leeward mark a couple of times. You need to have luck. But we were happy to beat Taylor in the Petite Final.” \nHansen beat Canfield, 2-1, in the Petite Final to win $12,000 while Canfield’s US One crew earned $11,000 for fourth place. \nThe Argo Group Gold Cup is the penultimate event on the World Match Racing Tour. The final event is the Monsoon Cup, scheduled for late January 2016. Based on the final results Hansen, Canfield and Ian Williams, the overall tour leader who placed seventh in the Argo Group Gold Cup, will have a shot at winning the match racing world championship. The three skippers are separated by 5 points. \nThe Argo Group Gold Cup is sponsored by the Argo Group, an international underwriter of specialty insurance and reinsurance products in areas of the property and casualty market. Additional sponsors include the Bermuda Tourism Authority, Bacardi, Guy Carpenter,RenaissanceRe, Aon Benfield, and the World Match Racing Tour and Match Racing Association. \nArgo Group Gold Cup Final Standings 1. Adam Minoprio [NZL] BlackMatch, $35,000 [Crew: Nick Blackman, Andrew Burgess, Tom Powrie] 2. Keith Swinton [AUS] Black Swan Racing, $16,000 [Crew: Ted Hackney, Henry Kernot, Björn Lundgren] 3. Björn Hansen [SWE] Nautiska Racing, $12,000 [Crew: Massimo Bortoletto, Mathias Bredin, Phillip Kai Guhle] 4. Taylor Canfield [ISV] US One, $11,000 [Crew: Garth Ellingham, Hayden Goodrick, Mike Rehe] 5. Phil Robertson [NZL] WAKA Racing, $8,000 [Crew: Sylvain Barielle, Sam Bell, Luke Payne] 6. Eric Monnin [SUI] Swiss Match Race Team, $7,000 [Crew: Simon Brugger, Jean-Claude Monnin, Marc Monnin, Mathieu Richard] 7. Ian Williams [GBR] GAC Pindar, $6,000 [Crew: Chris Main, Gerry Mitchell, Mal Parker] 8. Chris Steele [NZL] 36 Below Racing, $5,000 [Crew: Stewart Dodson, Adam Negri, Justin Wong] \nClick to enlarge photos:", "external_links": [], "published": "2015-10-12T19:59:00.000+03:00", "crawled": "2015-10-12T22:35:16.423+03:00", "highlightTitle": ""}