{"organizations": [], "uuid": "b0536130b4cfd1c97914e93b20c8a636f7b715f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.philly.com", "main_image": "http://media.philly.com/images/sixers2-1200.jpg", "site_section": "http://www.philly.com/", "section_title": "Philadelphia local news, sports, jobs, cars, homes - Philly.com", "url": "http://www.philly.com/philly/sports/sixers/20151024_Sixers_face_roster_moves_after_loss_in_preseason_finale.html", "country": "US", "title": "Sixers face roster moves after loss in preseason finale", "performance_score": 0, "site": "philly.com", "participants_count": 21, "title_full": "Sixers face roster moves after loss in preseason finale", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T03:00:00.000+03:00", "replies_count": 23, "uuid": "b0536130b4cfd1c97914e93b20c8a636f7b715f7"}, "author": "Keith Pompey,", "url": "http://www.philly.com/philly/sports/sixers/20151024_Sixers_face_roster_moves_after_loss_in_preseason_finale.html", "ord_in_thread": 0, "title": "Sixers face roster moves after loss in preseason finale", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MANCHESTER, N.H. - The 76ers now have tough decisions to make.\nDo they keep T.J. McConnell as a reserve point guard? Have Scottie Wilbekin and Jordan McRae shown enough to make the roster? And will Carl Landry's leadership qualities outweigh the fact he's going to be sidelined until January?\nThe deadline to trim NBA rosters from 20 players to 15 is Monday at 5 p.m.\nCoach Brett Brown and the team will mostly wait until the last few hours to release players. But for most, the final dress rehearsal came Friday night in an 81-65 setback to the Boston Celtics at the Verizon Wireless Arena.\nMore coverage Download FREE Philly Sports Now app for iPhone! VOTE: Can the 76ers make the playoffs? Forum: Does Hinkie have 76ers on right track? Buy 76ers jerseys, memorabilia, and other gear Latest Sixers videos It was a game where Sixers small forward Robert Covington suffered a game-ending right knee sprain in the fourth quarter. Covington was carried to the locker room by teammateswill have an MRI on the knee on Saturday.\nCovington's was the latest of a long list of team injuries this preseason.\n\"The injuries have as much to do with anything with this year's roster as any season I ever coached either in [San Antonio] Spurs life or 76ers life,\" said third-year coach Brown, a former longtime Spurs assistant. \"It's dizzying, truly the people who aren't available.\"\nBut Brown noted that he wants to have competitive practices. That will be hard to do without a full complement of healthy players.\nAs a result, the Sixers will have to make a tough decision on the 32-year-old Landry.\nThe ninth-year veteran would provide much needed veteran leadership as the only player over 24 years of age.\nHowever, he had surgery on June 2 to repair a torn ligament in his right wrist. Landry removed his cast last month. He'll just be an observer for the next few months. Meanwhile, undrafted rookie Christian Wood has been impressive throughout the preseason. The 6-foot-11 is also one of those diamond-in-the-rough players the Sixers covet.\nPlus, there was a thought that the Sixers would eventually try to buyout or waive Landry when he was acquired in a trade from the Sacramento Kings in July.\nSo waiving him would allow the Sixers to develop Wood and Furkan Aldemir, another reserve post player.\n\"That's why the injuries have real significant role in decisions more so than any team I ever been around on,\" Brown said.\nMcConnell could make the squad as a much-needed reserve as Tony Wroten and Kendall Marshall both rehabilitate anterior cruciate ligament tears in their right knees.\nWhile Wilbekin came into training camp as a point guard, he and McRae might for the final shooting guard spot.\nRookie center Jahlil Okafor led the Sixers with 12 points and eight rebounds. Power forward Nerlens Noel had nine points, eight rebounds, four steals and three blocks.\nThis was a crazy day for the Sixers as they fired back at Republican presidential candidate John Kasich moments after he made light of their talent level Friday morning.\nKasich, Ohio's governor, told a small town hall here in Manchester than he saw the Sixers at his hotel Friday morning.\n\"How did I know who they were?\" he asked. \"They were really tall, okay.\"\nThe town hall meeting was for a business-focused crowd, and Kasich spoke of the importance of having job skills. Then he poked fun at the Sixers basketball skill.\n\"The reason why some of them make a lot of money is because they have skills,\" he said of the team that lost 127 games the last two seasons. \"Not too many Sixers have had that many skills lately, but they do.\"\nThe Sixers responded on Twitter: \"At least we win more than 2% of the time.\"\nThey later deleted the tweet, but Kasich clearly didn't mind the jab. He responded with a bit of humor of his own: Just getting warmed up. 3pts cc @Sixers (don't delete this) Great young team.\nkpompey@phillynews.com\n@PompeyOnSixers\nwww.inquirer.com/deepsixer", "external_links": ["http://www.avantlink.com/click.php?tt=cl&mi=11081&pw=159355&ctc=article&url=http%3A%2F%2Fwww.fanatics.com%2FNBA_Philadelphia_76ers", "http://www.inquirer.com/deepsixer"], "published": "2015-10-24T03:00:00.000+03:00", "crawled": "2015-10-24T15:18:35.799+03:00", "highlightTitle": ""}