{"organizations": ["UT", "Power T logo Copyright 2015 Journal Media Group"], "uuid": "92bb2452130b81203d4ba1c4ab9db81d5284c9f3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.knoxnews.com", "main_image": "http://mediaassets.knoxnews.com/photo/2015/10/09/utlogo_25038517_ver1.0_640_480.jpg", "site_section": "http://www.knoxnews.com/feeds/rssFeed?obfType=RSS_FEED&siteId=100106&categoryId=70504", "section_title": "Other Sports | KNS", "url": "http://www.knoxnews.com/govolsxtra/other-sports/past-present-team-up-for-ut-intrasquad-swim-meet_55522915", "country": "US", "title": "Past, present team up for UT swim meet", "performance_score": 0, "site": "knoxnews.com", "participants_count": 0, "title_full": "Past, present team up for UT swim meet", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T04:06:00.000+03:00", "replies_count": 0, "uuid": "92bb2452130b81203d4ba1c4ab9db81d5284c9f3"}, "author": "", "url": "http://www.knoxnews.com/govolsxtra/other-sports/past-present-team-up-for-ut-intrasquad-swim-meet_55522915", "ord_in_thread": 0, "title": "Past, present team up for UT swim meet", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Past, present team up for UT intrasquad swim meet 9:06 PM, Oct 9, 2015 Power T logo Copyright 2015 Journal Media Group. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. Show Caption Next \nPast, present at meet \nTennessee swimming and diving past and present teamed up Friday for the annual Orange and White Intrasquad Meet at the Allan Jones Intercollegiate Aquatic Center. \nFor the first time, alumni competed alongside this season's edition of the Vols. The Orange held on for a 668-667 victory. \nFrank Bryant, the oldest competing member and a part of Tennessee's first SEC championship team in 1969, was eighth in the 50-yard freestyle. \n\"I think we're all overwhelmed by the number of alumni who came back and their absolute love for the program that brought them back into the pool,\" coach Matt Kredich said in a school release. \"They still love to swim and they love the program. I think it's great for the current team to see the people who care so much about what they do and how they do it.\" \nDiving coach Dave Parrington was presented a book commemorating his 25 years at UT. \n\"It's been emotional and overwhelming,\" Parrington said. \"It's so very special that so many divers from my former teams could find the time to come on out to spend time on this awesome day. There were some former divers — all of whom are retired — who did some amazing stuff. They were throwing up some big dives and having a lot of fun.\" \nSophomore Sam McHugh won three events for the White, with victories in the 200 free, 100 butterfly and 200 IM. \nNews Sentinel staff Copyright 2015 Journal Media Group. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.", "external_links": [], "published": "2015-10-10T04:06:00.000+03:00", "crawled": "2015-10-10T06:33:09.455+03:00", "highlightTitle": ""}