{"organizations": [], "uuid": "5f1c094ebc6931a3bae2e2a8f934bf201060fed4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kcchronicle.com", "main_image": "http://www.kcchronicle.com/images/avatar.png", "site_section": "http://www.kcchronicle.com/?rss=sports/preps", "section_title": "Prep Sports", "url": "http://www.kcchronicle.com/2015/10/15/kcchronicle-compreps-football-game-of-the-week-i-batavia-at-geneva/ahup308/", "country": "US", "title": "KCChronicle.com/preps football game of the week I: Batavia at Geneva", "performance_score": 0, "site": "kcchronicle.com", "participants_count": 0, "title_full": "KCChronicle.com/preps football game of the week I: Batavia at Geneva", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T06:51:00.000+03:00", "replies_count": 0, "uuid": "5f1c094ebc6931a3bae2e2a8f934bf201060fed4"}, "author": "", "url": "http://www.kcchronicle.com/2015/10/15/kcchronicle-compreps-football-game-of-the-week-i-batavia-at-geneva/ahup308/", "ord_in_thread": 0, "title": "KCChronicle.com/preps football game of the week I: Batavia at Geneva", "locations": ["Geneva", "Batavia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["CHRIS CASEY"], "text": "KCChronicle.com/preps football game of the week I: Batavia at Geneva Published: Thursday, Oct. 15, 2015 10:51 p.m. CDT By CHRIS CASEY – ccasey @shawmedia.com \nBATAVIA (6-1, 4-0 UPSTATE EIGHT CONFERENCE RIVER DIVISION) at GENEVA (7-0, 4-0 UEC RIVER), 7:30 p.m. TODAY \nThe buzz in the stands \nThere really is no need to amp this one up any more, although Geneva coach Rob Wicinski said he can't remember any recent entry in this series receiving more hype than tonight's game. \nEverything is on the line for the Bulldogs, who have the much talked about 29-game UEC River win streak, and Geneva, who remained unbeaten this year after beating Glenbard East last week. The Upstate Eight Conference River Division championship is up for grabs in this winner-take-all matchup. \nBatavia coach Dennis Piron expects nothing less than a game that will be talked about for a long time. \n\"They've got playmakers, we've got playmakers and it's going to be a great game,\" said Piron, who hasn't lost a River game in his four-plus years as head coach. \"There's nothing quite like this environment, and I know our kids are excited to get out there and play in a game that we hope is one that people talk about for years to come.\" \nThe marquee matchup \nThis game features two of the better quarterbacks in the area in Geneva's Sean Chambers and Batavia's Kyle Niemiec. If both are provided time, it could turn into a shootout, as both have weapons galore. \nWhile both excel in their play-making abilities when the pocket breaks down, it will be important to keep their jerseys clean – in the metaphorical sense, of course, with Burgess Field providing a turf surface. \n\"They're going to bring pressure, and we have to be able to handle it,\" Wicinski said. \"If we can give Sean some time, we might be able to get some guys loose. On the other side, they have a big offensive line and if they want to go toe-to-toe and start smash mouthing, that'll be interesting to see how we handle that.\" \nAlthough both teams have strong running backs, in Justin Taormina (Geneva) and Zach \"Zippy\" Garrett (Batavia), when the final buzzer sounds, I think whichever quarterback has more time to throw the football will come out victorious. \nThe X-factor \nThere's no doubt when these two take the field tonight that the energy will be electric. Well, at least it should be as Wicinski joked to players, \"Shame on you\" if there's not. \nWhile being amped up is one thing, taking the field and controlling the emotion of a game like this will be invaluable. \n\"That's huge. I always tell the guys you need to get in that mindset of a good business attitude, but you're also flying,\" Wicinski said. \"The guys have all played sports long enough and usually it's not an issue. It's difficult to play well in this game, so staying level-headed is going to be important.\" \n\"We expect there to be a lot of momentum swings and trying to control them will be big,\" Piron said. \"We actually, in my time here, have played better in big games on the road than we have at home, so the atmosphere and being too amped up isn't something that concerns me too much. The guys have had the right mentality in these games and we're excited.\" \nBest case-scenario for the Bulldogs \nI think for Batavia to be successful, it will have to get pressure on Chambers and change up defensive looks. There isn't anything that Geneva will do that Batavia hasn't seen, and vice-versa. These two teams know just about everything about each other, so giving Chambers looks he hasn't seen or isn't expecting could prove vital. \nBest case-scenario for the Vikings \nBe ready for anything. In a couple of big games this season, Piron has pulled out onside kicks, trick plays, etc. Geneva needs to be prepared to see just about anything with the River Division title on the line. Between that and limiting the big plays between Niemiec and go-to weapon Canaan Coffey, Geneva will hang with the Bulldogs if that goes accordingly. I don't expect either team to hold anything back with the setting tonight will present. \nChris Casey's prediction \nGeneva 41, Batavia 38 \nStreak over. Call it an upset if you'd like, and it wouldn't surprise me if this score is flipped, or even higher-scoring, but I'm going with Geneva, at home, to remain unbeaten and end the Batavia conference winning streak. This one could very well come down the the last possession of the game, which I think it will. I'll take the \"underdog\" for the win, although I expect both programs to make deep runs into November.", "external_links": [], "published": "2015-10-16T06:51:00.000+03:00", "crawled": "2015-10-16T11:23:19.883+03:00", "highlightTitle": ""}