{"organizations": [], "uuid": "945d01a560925c5ce7cd2ca04c9197eca35b66c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtontimes.com", "main_image": "", "site_section": "http://www.washingtontimes.com/rss/headlines/sports/", "section_title": "www.washingtontimes.com stories: Sports", "url": "http://www.washingtontimes.com/news/2015/oct/8/things-looking-up-for-louisville-entering-weekend-/", "country": "US", "title": "Things looking up for Louisville entering weekend off", "performance_score": 0, "site": "washingtontimes.com", "participants_count": 1, "title_full": "Things looking up for Louisville entering weekend off", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T00:52:00.000+03:00", "replies_count": 0, "uuid": "945d01a560925c5ce7cd2ca04c9197eca35b66c2"}, "author": "GARY B. GRAVES", "url": "http://www.washingtontimes.com/news/2015/oct/8/things-looking-up-for-louisville-entering-weekend-/", "ord_in_thread": 0, "title": "Things looking up for Louisville entering weekend off", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Things looking up for Louisville entering weekend off By GARY B. GRAVES   \nLOUISVILLE, Ky. (AP) - Things could be worse for Louisville’s football program. \nThe Cardinals enter a weekend off at 2-3 - following an 0-3 start - and with extra time to prepare for an important Atlantic Coast Conference matchup at No. 12 Florida State. \nThe Cardinals began 0-3 for the first time since 1984 and seemed confused in many areas, especially at quarterback. They’ve responded with back-to-back wins against Samford and at North Carolina State, a contest that solidified freshman Lamar Jackson as their starting quarterback. \nCoach Bobby Petrino still has plenty of work ahead of him but after a front-loaded schedule featuring two ranked teams in the first 12 days, the bye offers Louisville time to take a back-to-basics approach as it prepares for a third ranked opponent. \n“Being between two very difficult road teams, I think it’s a good time to have a bye,” Petrino said this week. “We go back to working hard on our technique and fundamentals and getting back to doing some of the drills that we haven’t done for a while and going against each other. \n“We spend about the other half of it getting some extra preparation for our next opponent. It always seems to work out pretty well for us.” \nPetrino’s outlook was a little cloudy two weeks ago after Louisville’s 20-17 loss to then-No. 11 Clemson revealed an unsettled team on both sides of the ball. The Cardinals’ biggest concern was quarterback, where Jackson and sophomores Reggie Bonnafon and Kyle Bolin had each started without definitively establishing themselves. \nThe coach then chose the mobile Jackson, who has set a single-season school record for rushing yards (435) by a QB. Most of that yardage has come the past two games, during which he has gained 313 on 37 carries with big runs of 73 against FCS Samford and 68 (for a touchdown) against the Wolfpack. \nJackson has completed 51 percent of his passes for 315 yards and two touchdowns during that span, including chunk passes of 36 yards (for a TD) and 20. \nNot bad, considering Louisville’s young offensive line has endured growing pains with pass protection and run blocking. The Cardinals allowed three sacks at North Carolina State and have given up 16 overall. But Petrino believes that starting freshmen tackles Geron Christian and Kenny Thomas will have long-term blocking benefits on the edges. \n“We know what we are and where we need to improve,” Petrino said. “We’re really focusing hard on our technique and fundamentals in practice and getting better on the practice field.” \nAs Louisville’s offense takes shape, the defense is looking like its old stingy self despite replacing seven starters. \nThe Cardinals continue to be opportunistic, tying for eighth nationally with 12 turnovers including nine interceptions to tie for seventh in that category. More importantly, they held North Carolina State to just 228 yards and are showing they won’t give up ground easily. \nFlorida State presents a huge road challenge on Oct. 17 for Louisville, but the second-half schedule appears less daunting than the first as the Cardinals pursue the six-win threshold needed for their sixth straight postseason berth. \nBad as things looked at 0-3, Louisville lost those games by just 13 total points. That start is now a distant memory after a 20-13 victory over N.C. State that provided confidence for the Cardinals aim to build on.", "external_links": [], "published": "2015-10-09T00:52:00.000+03:00", "crawled": "2015-10-09T02:02:05.949+03:00", "highlightTitle": ""}