{"organizations": [], "uuid": "e8e297cd2cd0f69bb5b6e39342784a7e18e16243", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "wtop.com", "main_image": "http://wtop.com/wp-content/uploads/2015/10/Rockies-Giants-Baseball-.jpeg", "site_section": "http://wtop.com/section/sports/feed/", "section_title": "WTOP » Sections » Sports", "url": "http://wtop.com/mlb/2015/10/weiss-return-with-rockies-in-limbo-after-losing-season/", "country": "US", "title": "Weiss’ return with Rockies in limbo after losing season", "performance_score": 0, "site": "wtop.com", "participants_count": 1, "title_full": "Weiss’ return with Rockies in limbo after losing season", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T23:01:00.000+03:00", "replies_count": 0, "uuid": "e8e297cd2cd0f69bb5b6e39342784a7e18e16243"}, "author": "wtopstaff", "url": "http://wtop.com/mlb/2015/10/weiss-return-with-rockies-in-limbo-after-losing-season/", "ord_in_thread": 0, "title": "Weiss’ return with Rockies in limbo after losing season", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home » News » Sports » MLB » Weiss' return with Rockies… Weiss’ return with Rockies in limbo after losing season By PAT GRAHAM October 5, 2015 4:01 pm Colorado Rockies' Justin Morneau hits a single to drive in two runs against the San Francisco Giants during the ninth inning of a baseball game, Sunday, Oct. 4, 2015, in San Francisco. (AP Photo/Tony Avelar) \nDENVER (AP) — Nolan Arenado has the stats to be an MVP. His team doesn’t have the wins to really give him any sort of chance. \nThe Colorado Rockies’ Gold Glove third baseman was one of the few bright spots in a sour 68-94 season that saw All-Star shortstop Troy Tulowitzki traded to Toronto and prized pitching prospects struggle at Coors Field. They struggled elsewhere, too, finishing with a league-worst 5.04 ERA. \nArenado tied for the NL lead in homers with 42 and led the league with 130 RBIs, all while turning in highlight-reel plays at the hot corner virtually every night. \nHe’s not stumping for MVP votes but for his manager, Walt Weiss, to stick around next season. \n“We haven’t been able to win. That’s not a reflection on him,” Arenado said. “He’s doing a fine job.” \nFirst-year GM Jeff Bridich said every aspect of the organization will get a hard look in the offseason, including Weiss’ contract, which runs through 2016. They’re scheduled to meet Tuesday. The Rockies are 208-278 in Weiss’ three years in charge. \nBridich shook things up at the trade deadline, dealing Tulowitzki to the Blue Jays for pitching prospects and veteran shortstop Jose Reyes. \nThere are no untouchables this winter, not even slugger Carlos Gonzalez, even after his bounce-back year that saw him reach the 40-homer mark. \n“We’ll operate the same way we have, which is we’ll listen on just about anything,” said Bridich, who took over as GM last October. “The only way to operate in this industry is that you have to keep options open and have to be creative and aggressive at times.” \nAs for Weiss’ future, Bridich would only say the Rockies are “cognizant of the challenges this team has faced. There’s a lot that Walt has done really well and continues to do well.” \nSome notes and takeaways after the Rockies’ fifth straight losing season: \nKEY HITS: Everyone expected Arenado to have another big year with his glove, which he did and should be a lock for a third straight Gold Glove. No one expected Arenado to leap from 18 to 42 homers. “Forty is a big, big number,” Weiss said. “It’s quite a milestone, especially in this day and age.” Arenado and Gonzalez combined to hit 82 homers and drove in 227 runs, Colorado’s most productive tandem since Todd Helton and Larry Walker had a combined 87 homers and 269 RBIs in 2001. \nCOSTLY ERRORS: A shaky rotation was besieged by injuries. The Rockies also lost first baseman Justin Morneau (concussion symptoms) for an extended stretch and outfielder Corey Dickerson (plantar fasciitis) as well. “Injuries are going to be a part of every season. But I think our depth certainly was tested,” Bridich said. “Something that needs to get better at the major league level, in terms of impactful depth.” \nCOORS CONFIDENCE: Young right-hander Jon Gray — the No. 3 overall pick in 2013 — couldn’t get comfortable at Coors Field. “I feel like my road numbers are pretty good. Here, they’re really bad,” he said. True enough, he was 0-1 with a 2.70 ERA on the road and 0-1 with an 8.27 ERA at home. \nMORNEAU DECISION: Should this have been Morneau’s final at-bat for the Rockies, he certainly made the most of it — a game-winning single on the last day of the season. Morneau has a $9 million club option with a $750,000 buyout. If exercised, he may void and forfeit the buyout. Pitcher Kyle Kendrick also will be a free agent. \nBYE, BYE TULO: The Rockies went 26-39 after the trade of Tulowitzki. “It’s not easy when you lose a guy like that,” said Arenado, who counted Tulowitzki as one of his mentors. “If we can get healthy and add a couple of pieces here and there, things can turn around.” Topics:", "external_links": [], "published": "2015-10-05T23:01:00.000+03:00", "crawled": "2015-10-05T23:24:33.519+03:00", "highlightTitle": ""}