{"organizations": [], "uuid": "41309f2500e3898829ec75ed61dc9703ba62c24c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sportsnews.com.au", "main_image": "http://sportsnews.com.au/defaultimage.jpg", "site_section": "http://www.sportsnews.com.au/category/afl/feed", "section_title": "Sports News Australia » AFL News", "url": "http://www.sportsnews.com.au/afl/griffin-slams-ffa-board-election-process/158610", "country": "US", "title": "Griffin slams FFA board election process", "performance_score": 0, "site": "sportsnews.com.au", "participants_count": 1, "title_full": "Griffin slams FFA board election process", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T09:34:00.000+03:00", "replies_count": 0, "uuid": "41309f2500e3898829ec75ed61dc9703ba62c24c"}, "author": "AAP", "url": "http://www.sportsnews.com.au/afl/griffin-slams-ffa-board-election-process/158610", "ord_in_thread": 0, "title": "Griffin slams FFA board election process", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Griffin slams FFA board election process   4:34 pm AFL GRAND FINAL OFFER! If your team leads at any break but loses, CASH BACK up to $100!* PLUS Sign up now for a $501 Bonus Bet! \nAdelaide United chairman Greg Griffin says the process that has all but ensured Steven Lowy will become the next chairman of Football Federation Australia has stirred up “unpleasant” feelings among the A-League clubs. \nLowy Jr is set to succeed his father, current FFA head Frank Lowy, as the game’s most powerful figure after he was announced as one of four candidates for only four vacancies on the FFA board. \nThe terms of Lowy Sr, deputy chairman Brian Schwartz and Phil Wolanski expire next month while Peter Tredinnick, who recently resigned from the board, will also be replaced at next month’s annual general meeting. \nBut several A-League clubs are furious they were unable to put forward a candidate of their own, former Sydney Olympics boss Mal Hemmerling, who was unable to secure a seconding vote from at least two of the state federations. \nThe state federations refused to support any candidate that didn’t go through a selection process controlled by FFA, which had engaged international headhunting firm Egon Zehnder to identify potential board members. \n“It’s not as if we’re acting capriciously or are attempting some sort of unfair manoeuvre,” Griffin told AAP. \n“All we were trying to do was put forward one director on a board of nine. \n“It’s hardly storming the citadel, is it? Just to put (forward) an incredibly experienced sports administrator, who had been the chairman of the NBL, run the Olympics, run the Formula One grand prix, and had actually owned a franchise, the Adelaide 36ers. \n“Just as they ensured their chosen candidates were seconded by the states, it would have been sensible, reasonable and appropriate for them to do likewise with our candidate.” \nThe other approved candidates are former Socceroo and lawyer Daniel Moulis, investment banker Crispin Murray and Commonwealth Bank executive Kelly Bayer Rosmarin. \nGriffin said the implications for the game’s governance would be widespread. \n“You have a major stakeholder in the game in Australia denied an opportunity to put forward one candidate for nomination,” he said. \n“One has to wonder what role (is there for) the major stakeholder, which the clubs believe we are. \n“We can just be sent off to the corner whenever the states and the board of the FFA determine.” \nGriffin said the A-League clubs were now owed an explanation by Lowy Jr, who has long been considered an FFA chairman-in-waiting. \n“If Steven is elected chairman and one assumes that will occur, one would have thought Steven will address these issues with us very early in his tenure,” he said. \n“I have no interest in discussing it with Schwartz, Wolanski or Frank. No interest at all. \n“They’re the ones with the problem, not me. It was a nomination from the majority of the clubs, we’ve acted incredibly reasonably and I think it’s now up to those on the other side of the table to try and explain to us how this was permitted to occur. \n“They don’t have to, they can just ignore us. Which I expect them to do.”  ", "external_links": [], "published": "2015-10-02T09:34:00.000+03:00", "crawled": "2015-10-02T09:42:53.450+03:00", "highlightTitle": ""}