{"organizations": [], "uuid": "9a04648e8c5ddf9ca4d9fe64414889f8dd1f0e03", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "http://s1.reutersmedia.net/resources/r/?m=02&d=20151013&t=2&i=1086581169&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB9C072", "site_section": "http://www.reuters.com/news/sports", "section_title": "Sports News, Highlights &amp; Coverage | Reuters.com", "url": "http://www.reuters.com/article/2015/10/13/us-nfl-steelers-tomlin-idUSKCN0S70CM20151013", "country": "US", "title": "Under daredevil Tomlin, Steelers thrive on risks", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Under daredevil Tomlin, Steelers thrive on risks | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T09:42:00.000+03:00", "replies_count": 0, "uuid": "9a04648e8c5ddf9ca4d9fe64414889f8dd1f0e03"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/10/13/us-nfl-steelers-tomlin-idUSKCN0S70CM20151013", "ord_in_thread": 0, "title": "Under daredevil Tomlin, Steelers thrive on risks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Pittsburgh Steelers coach Mike Tomlin has proven to be a late-game daredevil, not afraid of taking a gamble in the final seconds, and it paid off with the most dramatic win of the season on Monday night.\nThe Steelers, undeterred by the game's final seconds or past results, edged the San Diego Chargers 24-20 on a risky play call as time expired.\nPittsburgh had the ball at San Diego's one yard-line while trailing by three and just five seconds remaining.\nA field goal would have been the safe call and extended the game to overtime, but the Steelers instead ran a direct snap to running back Le'Veon Bell who was met quickly by the defense but narrowly stretched over the goal-line and avoided the loss.\n\"We have to play to win and that’s what we did,\" Tomlin told reporters.\n\"We had an opportunity to win the game and we're on the road in a hostile environment. We have to run the ball.\"\nTomlin, known for his stoic poker face on the sidelines, has boldly stared defeat in the face in consecutive weeks with mixed results. He faced wide criticism a week and a half ago when the Steelers attempted a fourth down play rather than a field goal in overtime, leading to their loss to Baltimore.\nTomlin was seen on camera saying \"my bad\" into his headset, acknowledging responsibility to his coaching staff.\n\"When you lose, you’re open to criticism,\" Tomlin told the Pittsburgh Post-Gazette. \"We lost, so I’m not going to try to justify anything that we did. Anything we did, I take responsibility for.\"\nTomlin’s willingness to take chances may in part stem from his pedigree as coach and the franchise he works for.\nThe Steelers are historically loyal to their head coaches and have employed just three over the past 46 years.\nTomlin, 43, has reached two Super Bowls and captured one since he took the helm in 2007 and remains secure in his position and confident in his fearless philosophy.\n\"I’m glad that coach (Tomlin) has the confidence in us to go out there and complete the job,\" Bell said.\n\"He puts the confidence in us and we have to go out there and deliver.\"\n(Writing by Jahmal Corner in Los Angeles; editing by Amlan Chakraborty )", "external_links": [], "published": "2015-10-13T09:42:00.000+03:00", "crawled": "2015-10-13T09:38:46.819+03:00", "highlightTitle": ""}