{"organizations": [], "uuid": "944305a58f26329b72426d0551f26d759e971214", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/2/9/152399/World/International/Belarus-writer-Svetlana-Alexievich-wins-Nobel-Lite.aspx", "country": "EG", "title": "Belarus writer Svetlana Alexievich wins Nobel Literature Prize - International - World", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Belarus writer Svetlana Alexievich wins Nobel Literature Prize - International - World - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "944305a58f26329b72426d0551f26d759e971214"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/2/9/152399/World/International/Belarus-writer-Svetlana-Alexievich-wins-Nobel-Lite.aspx", "ord_in_thread": 0, "title": "Belarus writer Svetlana Alexievich wins Nobel Literature Prize - International - World", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Nobel Prize in literature: What to look out for Scientists from Sweden, U.S. and Turkey win Nobel chemistry award for work on DNA repair From refugees to anti-nukes, Nobel Peace Prize bets are on Belarussian writer Svetlana Alexievich won the 2015 Nobel Literature Prize on Thursday, honoured for her work chronicling the horrors of war and life under the repressive Soviet regime.\nThe Swedish Academy hailed the 67-year-old for writings that were \"a monument to suffering and courage in our time\" -- tableaux of World War II, Chernobyl and the war in Afghanistan, crafted through thousands of interviews.\n\"By means of her extraordinary method -- a carefully composed collage of human voices -- Alexievich deepens our comprehension of an entire era,\" it said.\nAlexievich dedicated the prize to her native Belarus.\n\"It's not an award for me but for our culture, for our small country, which has been caught in a grinder throughout history,\" she told a press conference in Minsk.\nHistory showed there was no place for deals with oppressors, Alexievich added.\n\"In our time, it is difficult to be an honest person,\" she said. \"There is no need to give in to the compromise that totalitarian regimes always count on.\"\nIn separate comments to daily Svenska Dagbladet, she said the prize would help the fight for freedom of expression in Belarus and Russia.\n\"I think my voice will carry more weight now... It won't be so easy for those in power to dismiss me with a wave of the hand anymore. They will have to listen to me,\" she said.\nAlexievich, only the 14th woman to win the prize since it was first awarded in 1901, had been the top choice among literary observers and among the bookies' favourites.\nThe Academy's permanent secretary, Sara Danius, speaking to the Nobel Foundation, called her \"an extraordinary writer\", saying \"it's a history of emotions she's offering us.\"\nBy chronicling her thousands of interviews, \"she's offering us a history of (Man), about whom we didn't really know that much, at least not in this systematic manner. At the same time she's offering us a history of emotions. A history of the soul if you wish,\" she said.\n\"She has invented a new literary genre where she transcends journalism. Others have been there too but she expanded it,\" Danius said.\nAlexievich takes home the sum of eight million Swedish kronor (around $950,000 or 855,000 euros). The last woman to win was Canada's Alice Munro in 2013.\nAlexievich has seen her works translated into numerous languages and has scooped several international awards.\nBut her books, controversially written in Russian, are not published in her home country, long ruled by authoritarian President Alexander Lukashenko, amid what the author has described as \"a creeping censorship\".\nShe began tape-recording accounts of female soldiers who took part in World War II while she was working as a local newspaper reporter in the 1970s.\nThe resulting book, \"War's Unwomanly Face\", was long barred from publication because it focused on personal tragedies and did not emphasise the role of the Communist Party. It was finally published in 1985 under the perestroika reforms.\nAlexievich later used the same technique of first-person testimonies to document the despair of mothers who lost their sons in the Soviet invasion of Afghanistan -- in \"Zinky Boys\".\n\"I need to catch a person at a moment when they have been shaken up,\" Alexievich told Russia's Ogonyok weekly magazine.\n\"It's very important to listen when someone is speaking up. I always keep my ear to the ground.\"\nIn 1998, she published \"Voices From Chernobyl\", a collection of horrifying accounts from people who had worked on the nuclear clean-up of the 1986 disaster. The fall-out affected Belarus more than any other country.\nHer most recent book \"Second-Hand Time\" -- a non-fiction work examining the legacy of the Soviet mentality over 20 years after the collapse of Communism -- was awarded France's prestigious Prix Medicis essai in 2013.\nSince Lukashenko came to power in 1994, Alexievich's books have not been published in Belarus and she has lived most of her life on writers' scholarships in Italy, Germany, France and Sweden.\nShe has openly criticised Lukashenko's tight control of Belarus under a Soviet-style economic system and the country's continued use of the death penalty.\nShe has also weighed into the debate over the crisis in Ukraine by praising protestors who ousted Kremlin-backed leader Viktor Yanukovych in February 2014 for trying to shatter the links with the country's Soviet history.\nThe author has however angered the literary and intellectual elite in Belarus by writing in Russian, not in the Belarussian language, amid a strong drive to revive national culture and language.\nAlexievich was born in 1948 during the Stalin era, in the Ukrainian town of Ivano-Frankivsk, the daughter of a Belarussian father and Ukrainian mother, both of whom were teachers.\nShe studied journalism at the University of Minsk from 1967 to 1972, and worked at a local newspaper in Brest, in today's Belarus, later returning to Minsk to work for the Sel'skaja Gazeta newspaper.\nThe Nobel awards week continues on Friday with the other most closely-watched Nobel award, the peace prize.\nThe economics prize will wrap up this year's Nobel season on October 12.", "external_links": [], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-09T01:30:05.323+03:00", "highlightTitle": ""}