{"organizations": [], "uuid": "eef37c0d438c683db8e2466630a2e5ce2f4b3d5e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "nypost.com", "main_image": "https://thenypost.files.wordpress.com/2015/10/sv1.jpg", "site_section": "http://nypost.com/sports/feed/", "section_title": "| Sports | New York Post", "url": "http://nypost.com/2015/10/12/vereens-tiki-barber-trait-adds-whole-new-giants-dimension/", "country": "", "title": "Vereen’s Tiki Barber trait adds whole new Giants dimension", "performance_score": 0, "site": "nypost.com", "participants_count": 1, "title_full": "Vereen’s Tiki Barber trait adds whole new Giants dimension | New York Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T02:16:00.000+03:00", "replies_count": 0, "uuid": "eef37c0d438c683db8e2466630a2e5ce2f4b3d5e"}, "author": "Paul Schwartz", "url": "http://nypost.com/2015/10/12/vereens-tiki-barber-trait-adds-whole-new-giants-dimension/", "ord_in_thread": 0, "title": "Vereen’s Tiki Barber trait adds whole new Giants dimension", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Some of what the Giants have put on display in the fourth quarter of their games this season has been hard to watch. But what Shane Vereen saw Sunday night was oh so easy on his eyes.\n“As soon as I caught the ball, I turned around and I saw after [Weston] Richburg had kicked his guy out, I saw nothing but green grass,’’ Vereen said Monday. “It’s very comforting as a running back to see a lot of green grass.’’\nIt has been very comforting for the Giants to see Vereen wearing their uniform. He helped save the day by accounting for 51 of the 82 yards on the game-winning touchdown drive in a 30-27 comeback victory over the 49ers. After providing a comfortable security blanket for Eli Manning on check-down throws of 11 and 16 yards, the possession really got cooking when Vereen took a middle screen from Manning, got a block Richburg at center and was off and running for 24 yards until he was hauled down at the San Francisco 20-yard line with 30 seconds remaining. Two plays later, Manning found tight end Larry Donnell for the winning touchdown.\nTom Coughlin described the screen as seeing the Red Sea parting, and shame on the 49ers if this came as a surprise. Vereen was signed by the Giants mainly as a pass-catching threat out of the backfield. The guy caught 10 of Tom Brady’s passes last February in the Super Bowl. Without him, the final drive against the Niners is not even jump-started, much less completed.\nVereen knew Odell Beckham Jr. and Rueben Randle were not on the field with the Giants trailing 27-23 with 1:41 remaining, but he also knew how the 49ers had played him, and he anticipated getting the call from Manning.\n“I knew I had been singled up for the whole game, it was one-on-one coverage so I knew I was going to have my opportunities to make some plays,’’ Vereen said. “I was just focused on just winning my matchups, trying to be an option for Eli to throw the ball to.’’\nVereen has 20 receptions in the first five games, including a touchdown grab in the second quarter as he scooted around NaVorro Bowman at the goal line, a mismatch for any linebacker, given Vereen’s skill and savvy as a receiver.\n“[Sunday] night was a great example of some of the things that he can do in certain situations when the defense may in fact think they’ve got you in a position where they have the upper hand,’’ Coughlin said. “And someone like Shane can determine that might not necessarily be so.’’\nThe Giants have not had this dimension in their backfield since Tiki Barber, who retired after the 2006 season.\n“Have we ever had a player like this, to be able to utilize his talents?’’ Coughlin said. “Probably not to this degree.’’\nShare this: Facebook Twitter Google Whatsapp Email Filed under new york giants ,  shane vereen", "external_links": [], "published": "2015-10-13T02:16:00.000+03:00", "crawled": "2015-10-13T09:31:31.977+03:00", "highlightTitle": ""}