{"organizations": [], "uuid": "faa02793b1d4bafb01cbd051c28ce641888e3700", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.abqjournal.com", "main_image": "http://main.abqjournal.netdna-cdn.com/wp-content/uploads/2015/10/life06_jd_11oct_symphony-218x400.jpg", "site_section": "http://www.abqjournal.com/", "section_title": "Albuquerque and New Mexico News, Sports, Business and more | Albuquerque Journal News", "url": "http://www.abqjournal.com/657953/entertainment/symphony-offers-fall-tribute-to-mozart-schubert.html", "country": "US", "title": "Santa Fe Symphony offers a fall tribute to Viennese masters Mozart and Schubert", "performance_score": 0, "site": "abqjournal.com", "participants_count": 1, "title_full": "Santa Fe Symphony offers a fall tribute to Viennese masters Mozart and Schubert | Albuquerque Journal News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T08:02:00.000+03:00", "replies_count": 0, "uuid": "faa02793b1d4bafb01cbd051c28ce641888e3700"}, "author": "Kathaleen Roberts / Journal Staff Writer", "url": "http://www.abqjournal.com/657953/entertainment/symphony-offers-fall-tribute-to-mozart-schubert.html", "ord_in_thread": 0, "title": "Santa Fe Symphony offers a fall tribute to Viennese masters Mozart and Schubert", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Santa Fe Symphony principal violist Kimberly Fredenburgh will perform Mozart with the orchestra next Sunday.\nAs autumn’s alchemy gilds the aspens, the Santa Fe Symphony offers a fall tribute to two Viennese masters.\nMozart’s Sinfonia Concertante for Violin, Viola & Orchestra in E-flat Major, K. 364 (1779) is widely regarded as the composer’s greatest string concerto.\nSchubert’s monumental and final Symphony in C Major earned the nickname “Great” for its grandeur and sense of space.\n“Mozart and Schubert” is slated for next Sunday in Santa Fe’s Lensic Performing Arts Center.\nSymphony concertmaster David Felberg will join principal violist Kimberly Fredenburgh in performing Mozart’s deeply expressive masterpiece. Written essentially as a double concerto, the piece gives both instruments equal weight.\n“It’s an early use of the viola as a solo instrument,” Felberg said.\n“It’s some of the best music Mozart has written,” he continued. “The second movement is very special. Apparently he wrote it when he heard of his mother’s death. It’s beautiful, sad and quite moving.”\nThe first movement follows the sonata format as the soloists take turns weaving throughout the composition. The fast-paced third movement is virtuosic, he added.\n“All Mozart is difficult,” Felberg said. “You have to get the precision and the crispness. Every note has to sound like a jewel. To do that takes an amazing amount of effort and it’s very rewarding.”\nIf you go\nWHAT: “Mozart & Schubert” presented by the Santa Fe Symphony\nWHEN: 4 p.m. Oct. 18\nWHERE: Lensic Performing Arts Center, 211 W. San Francisco St., Santa Fe\nHOW MUCH: $25-$80. Call 505-983-1414 or 1-800-480-1319 or 505-988-1234 There was a time when musicians deemed Schubert’s “Great” symphony unplayable. Performers were daunted by both its length and the energy demanded to keep it buoyant.\nMendelssohn, who conducted its premier in Leipzig, a decade after the composer’s death, cut it. Other orchestras proved equally scornful.\nMusicians found the music challenging because of the long woodwind and string parts. When taking the symphony to Paris in 1842 and London in 1844, Mendelssohn found orchestras completely unwilling to play the symphony; in London, the violinists collapsed in laughter when rehearsing the second subject of the finale.\nToday it is considered the “Great.”\n“We think of Schubert as one of the greatest melodists and songwriters of all time,” conductor Philip Mann said. “Everyone from the classical artists to Frank Sinatra has used Schubert’s melodies. He was one of history’s greatest songwriters.”\nMann is the music director of the Arkansas Symphony Orchestra.", "external_links": ["http://main.abqjournal.netdna-cdn.com/wp-content/uploads/2015/10/life06_jd_11oct_symphony-218x400.jpg"], "published": "2015-10-11T08:02:00.000+03:00", "crawled": "2015-10-11T10:23:31.118+03:00", "highlightTitle": ""}