{"organizations": [], "uuid": "311f483bbee973a1a8b0d6871c0be5a6f3d60252", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/soccer", "section_title": "Soccer News, Scores, Schedule, Standings, Stats, Photos, Videos - MSN Sports", "url": "http://www.msn.com/en-us/sports/uefa-euro-2016/bosnia-herzegovina-2-0-wales-bale-and-co-qualify-despite-defeat/ar-AAfjwP0", "country": "US", "title": "Bosnia-Herzegovina 2-0 Wales: Bale & Co qualify despite defeat", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "Bosnia-Herzegovina 2-0 Wales: Bale & Co qualify despite defeat", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "311f483bbee973a1a8b0d6871c0be5a6f3d60252"}, "author": "Quaid taken into custody in Vermont trying to cross border", "url": "http://www.msn.com/en-us/sports/uefa-euro-2016/bosnia-herzegovina-2-0-wales-bale-and-co-qualify-despite-defeat/ar-AAfjwP0", "ord_in_thread": 0, "title": "Bosnia-Herzegovina 2-0 Wales: Bale & Co qualify despite defeat", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bosnia-Herzegovina 2-0 Wales: Bale & Co qualify despite defeat Goal.com 12 hrs ago © Provided by Goal.com Wales qualified for Euro 2016 despite suffering a 2-0 defeat to Bosnia-Herzegovina at the Stadion Bilino Polje.\nAdChoices Chris Coleman's side would have secured its place in France with a point, but Israel's loss to Cyprus secured progression from Group B regardless, as well as moving Bosnia third in the pool.\nBosnia set about its task immediately and dominated possession from the early exchanges, though Edin Visca was unable to convert its first, and best, opening of the first half.\nWales threatened on the break but was unable to take the chances it forged, and it proved costly as substitute Filip Djuric headed Bosnia ahead with less than 20 minutes remaining.\nBosnia then made sure its destiny was in its own hands going into its final fixture against Cyprus, as Vedad Ibisevic turned home Djuric's shot at the back post in the final minute of normal time.\nWith three points crucial to the ambitions of Bosnia, the game began in an open manner with Wales looking to play on the counterattack.\nAs Bosnia assumed control of possession, Aaron Ramsey almost caught Asmir Begovic out of position with an ambitious 35-yard free kick that flew narrowly wide of the target four minutes later.\nThe hosts were finding it difficult to break down Wales' five-man defense and, six minutes later, Begovic became the first keeper to be forced into a save, but Bale's skidding set-piece effort required little movement to deny.\nIn the last action of the first half, Hal Robson-Kanu released Ramsey in behind the defense, but the Arsenal man dallied on the ball and Neil Taylor was unable to slide home as Begovic smothered it.\nGaps continued to show in the Bosnia defesce and one such opening presented Bale with a great chance to open the scoring 11 minutes after the restart. After being released by Joe Ledley, though, he skewed a wild shot wide of the near post.\nIt proved a costly miss in the 71st minute as Bosnia finally broke the deadlock.\nIbisevic stopped Ashley Williams from getting his head to Pjanic's free kick from deep, and substitute Djuric looped a header beyond Wayne Hennessey and into the back of the net.\nRamsey missed a chance to draw Wales level and Mehmed Bazdarevic's men rounded off the scoring in the 90th minute as Ibisevic was in the right place at the right time to tap home from Djuric's cross following a corner.\nAlthough Wales' place in France was secured despite the defeat, it slipped to second as Belgium triumphed over Andorra 4-1. Bosnia, meanwhile, just needs to match or better Israel’s result in its final outing against Cyprus.\nGo to MSN Home", "external_links": ["http://go.microsoft.com/fwlink/?LinkID=286759", "http://www.goal.com/en-us"], "published": "2015-10-10T03:00:00.000+03:00", "crawled": "2015-10-11T11:57:59.913+03:00", "highlightTitle": ""}