{"organizations": [], "uuid": "6aa22505aacd6ddbe669d9f42fc8332d4d6755bf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.philly.com", "main_image": "http://media.philly.com/images/101215_steve-mason_1024.jpg", "site_section": "http://www.philly.com/philly_sports.rss", "section_title": "Philly.com Sports", "url": "http://www.philly.com/philly/sports/flyers/20151013_Flyers__Mason_out_do_to__family_matter_.html", "country": "US", "title": "Flyers' Mason out due to 'family matter'", "performance_score": 0, "site": "philly.com", "participants_count": 0, "title_full": "Flyers' Mason out due to 'family matter'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T06:26:00.000+03:00", "replies_count": 0, "uuid": "6aa22505aacd6ddbe669d9f42fc8332d4d6755bf"}, "author": "", "url": "http://www.philly.com/philly/sports/flyers/20151013_Flyers__Mason_out_do_to__family_matter_.html", "ord_in_thread": 0, "title": "Flyers' Mason out due to 'family matter'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ron Hextall"], "text": "Latest hockey odds \"With regards to 'Mase,' we just ask that you respect his privacy,\" general manager Ron Hextall said afterward. \"It's a sensitive issue and I think it's a fair request.\"\nGiven that the issue seems like a serious one, it's fair to suspect Mason will not return to the team until after tomorrow's game against Chicago, given the Flyers don't play their next game until six days later. \nMason, 27, played what he called the worst game of his career in Saturday's 7-1 blowout loss in Florida. Neither Hextall nor coach Dave Hakstol would comment on whether they thought the issue had anything to do with his performance. Mason practiced Sunday. \nWith Mason away from the team, the Flyers recalled Jason LaBarbera from Lehigh Valley to serve as Neuvirth's backup. \nNeuvirth was signed this offseason to improve the Flyers' goal-tending depth. He surely didn't expect to be sent into starter's action the third game of the year. \n\"It's part of the business and I gotta be ready, no matter what,\" Neuvirth said. \"I'm happy I'm going to get to start, but obviously it's very sad news to have a teammate . . . what he's been through is probably so tough. I feel really bad for him.\" Snider misses opener, feeling 'fantastic' Flyers chairman Ed Snider was not in the building last night for the team's home opener. The Flyers sent out a statement yesterday afternoon, saying Snider was at his home in California \"resting and recharging after recent medical therapy.\"\nSnider, 82, battled an unspecified stomach cancer in May 2014 before saying he was \"cancer-free\" that September. \nYesterday was the first time Snider, who started the franchise in 1967, missed a home opener. \nA Flyers spokesman said he talked to Snider yesterday and he was \"doing great. He is under great care. He feels fantastic. He is working out regularly and going out to dinner. Just needs some time to recharge.\" \nHextall said he talked to Snider over the weekend. \n\"I talked to him (Sunday) and Friday,\" Hextall said. \"As far as I know, he's doing well. He was in a good mood . . . I think everything's fine. He's excited about the team. He was excited about our first game and I said, 'I've never heard you happy after a loss.' \" \nHow about after Saturday's 7-1 loss? \n\"He wasn't quite as happy,\" Hextall said with a smile. Umberger on the mend When R.J. Umberger wasn't a participant in Sunday's practice, the Flyers said it was just a maintenance day for the 33-year-old winger. But Umberger wasn't on the ice for yesterday morning's skate and Hextall said afterward he was day-to-day with an \"upper-body injury.\"\nHextall said Umberger suffered the injury in Saturday's game. \nWith Umberger out, coach Dave Hakstol was forced to use the same shuffled lines he used in practice on Sunday. Sam Gagner got his first regular-season game action on a line with Sean Couturier and Brayden Schenn. Wayne Simmonds replaced Umberger on a line with Scott Laughton centering and Matt Read on the wing. \nGagner was used on the Flyers' second power-play unit, as well. \n\"I know what I can bring,\" he said. \"I'm confident in my ability, and I just have to go out there and play my game.\" Slap shots Hakstol also made a change on the blue line. Luke Schenn was replaced in the lineup by Radko Gudas, who made his first appearance in a regular-season game since Dec. 29, 2014, when he was with Tampa Bay. Gudas, acquired by the Flyers in March, missed the rest of the season after undergoing right knee surgery. Hakstol, before the game, said about Gudas: \"He's done a good job. He made a lot of progress, coming off the injury, during training camp. And that's kind of all in the past right now.\" . . . Former Flyers coach Craig Berube was in the building working as a scout for Hockey Canada . . . Former Flyer Danny Briere, who retired from the league this summer, reportedly is back with the organization working in some capacity part-time with Flyers president Paul Holmgren. On Twitter: @Jeff_Neiburg", "external_links": [], "published": "2015-10-13T06:26:00.000+03:00", "crawled": "2015-10-13T06:44:59.688+03:00", "highlightTitle": ""}