{"organizations": [], "uuid": "f84581c9443d4de935f5adb705b29240ef215ace", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "buckeyextra.dispatch.com", "main_image": "http://buckeyextra.dispatch.com/content/graphics/2015/10/1012-urban-meyer-kr.jpg", "site_section": "http://dispatch.com//content/syndication/sports_osu.xml", "section_title": "The Columbus Dispatch OSU Sports Feed", "url": "http://buckeyextra.dispatch.com/content/stories/2015/10/12/1012-meyer-osufb-news-conf.html", "country": "US", "title": "Ohio State football | Black uniforms, 2 quarterbacks will greet Penn State on Saturday | Buckeye Xtra Sports", "performance_score": 0, "site": "dispatch.com", "participants_count": 1, "title_full": "Ohio State football | Black uniforms, 2 quarterbacks will greet Penn State on Saturday | Buckeye Xtra Sports", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T17:05:00.000+03:00", "replies_count": 0, "uuid": "f84581c9443d4de935f5adb705b29240ef215ace"}, "author": "The Columbus Dispatch", "url": "http://buckeyextra.dispatch.com/content/stories/2015/10/12/1012-meyer-osufb-news-conf.html", "ord_in_thread": 0, "title": "Ohio State football | Black uniforms, 2 quarterbacks will greet Penn State on Saturday | Buckeye Xtra Sports", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ohio State will roll out dressed in black against Penn State on Saturday night, perhaps buoyed more by the thought it has a two-quarterback system that appears to be a workable plan moving forward.\nCardale Jones threw for a career-high 291 yards last week in the 49-28 win over Maryland, while J.T. Barrett – the records-setting starter all regular season last year before suffering a broken ankle – entered when the team reached the red zone. Barrett wound up rushing for three touchdowns as the Buckeyes went 6 for 6 inside the red zone, Barrett accountable for five of those TDs.\nSo coach Urban Meyer was asked if that’s the way it’s going to be again this week and weeks to come?\n“I think so, but I’m not writing that in Sharpie yet,” Meyer said during his weekly media conference. “We’ll see how it goes.\n“Everyone on our team, to see him (Barrett) and his energy -- and he's a good player. He gives us that extra (threat in terms of being a niftier runner. Cardale can certainly run, but when you have that threat, you saw it Saturday, and you have to defend that now.”\n>>  Dispatch  sports editor Ray Stein answers your questions about Buckeyes football during our weekly chat, 1 p.m. Thursday, dispatch.com/osuchat \nThe next chance to see the tango will come Saturday, and this time the QBs will be evaluated while wearing almost all-black uniforms, including helmets, in the prime time game vs. the Nittany Lions. Athletic director Gene Smith said a lot of discussion went into the decision to go with the motif (Ohio State has worn an alternate uniform at least one game a year starting in 2009), and that the first rendition submitted by Nike was sent back for changes, including brighter scarlet numbers and stripes on the pants.\nBut the new ones fit the bill. The trend continues.\n“We’re going to pick one game every year where we try to do this,” Smith said.\nAlong with being popular with the current players, as a brief survey by the media the past couple weeks indicates, the alternate uniform also has an impact on recruiting, Meyer and Smith said.\n“Huge. Huge,” is the way Smith described it. And he added, “We’re going to respond to that.”\nBut the priority for Meyer, with his team sitting No.1 in both major polls, and riding the nation’s longest win streak at 19 games, is preparing for Penn State. The Nittany Lions (5-1) almost upset the Buckeyes’ national championship season last year, taking OSU to two overtimes before a couple Barrett runs for TDs and a last-play sack by Joey Bosa delivered the win.\n“Excellent defense,” Meyer said of the PSU unit which is 10th in the country this week in total defense. “We had a hard time moving them last year, very good defense.\n“Offensively, it seems to me they’re coming into their own (with junior quarterback Christian Hackenberg). … They started slow, but they're really moving it (coming off a 29-7 last week). So, obviously, we have a lot of respect for Penn State and their players.”\ntmay@dispatch.com \n@TIM_MAYsport", "external_links": [], "published": "2015-10-12T17:05:00.000+03:00", "crawled": "2015-10-12T21:16:37.357+03:00", "highlightTitle": ""}