{"organizations": ["Browns", "Falcons", "Buffalo"], "uuid": "41fbb8b3eb229e2a65610e2008c526bc6cab7673", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestar.com", "main_image": "http://www.thestar.com/content/dam/thestar/sports/football/2015/10/11/nfl-bengals-browns-falcons-win-in-overtime/packers-rams.jpg", "site_section": "http://www.thestar.com/sports/football.html", "section_title": "Football, CFL, and NFL News | Sports | Toronto Star", "url": "http://www.thestar.com/sports/football/2015/10/11/nfl-bengals-browns-falcons-win-in-overtime.html", "country": "CA", "title": "NFL: Bengals, Browns, Falcons win in overtime", "performance_score": 0, "site": "thestar.com", "participants_count": 0, "title_full": "NFL: Bengals, Browns, Falcons win in overtime | Toronto Star", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "41fbb8b3eb229e2a65610e2008c526bc6cab7673"}, "author": "", "url": "http://www.thestar.com/sports/football/2015/10/11/nfl-bengals-browns-falcons-win-in-overtime.html", "ord_in_thread": 0, "title": "NFL: Bengals, Browns, Falcons win in overtime", "locations": ["NASHVILLE"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NASHVILLE—With so many key Bills sidelined by injuries, Buffalo needed someone to provide some kind of offensive boost.\nAnd quarterback Tyrod Taylor came through by doing a little bit of everything. Even catching a pass.\nTaylor threw a touchdown pass and ran for another in rallying the Buffalo Bills to a 14-13 win over the Tennessee Titans on Sunday.\n“Quarterback’s got the biggest heart,” Bills coach Rex Ryan said of Taylor. “Man, it was tough sledding, but he’s got guts, he’s got heart. He wasn’t playing great, but at the end of the day he’s the reason we won the game.”\nTaylor ran for 76 yards as the Bills (3-2) snapped a five-game skid against Tennessee. The Titans (1-3) blew a second straight double-digit lead at home, this by 10 points. They have lost two straight by a combined three points.\nBengals 27, Seahawks 24 (OT) Andy Dalton led the Bengals from a 17-point fourth-quarter deficit to a 27-24 overtime victory on Sunday over the Seattle Seahawks, keeping Cincinnati undefeated with the second-biggest comeback in its history.\nTrailing 24-7 as the fourth quarter started, Dalton threw for a touchdown, ran for another and led the Bengals on a 69-yard drive without a timeout. Mike Nugent tied it with a 31-yard field goal on the final play of regulation.\nNugent was good again from 42 yards with 3:36 left in overtime, the ball deflecting off the left upright before going through. It matched the second-biggest comeback in Cincinnati’s history when trailing in the fourth quarter.\nThe Bengals are 5-0 for the first time since 1988, the last time they went to the Super Bowl.\nSeattle (2-3) punted twice in overtime, giving the Bengals a chance to pull it out.\nFalcons 25, Redskins 19 (OT) Robert Alford returned an interception 59 yards for a touchdown, keeping the Falcons unbeaten.\nThe Redskins had the first possession of OT, and Kirk Cousins moved the team to midfield. When wide receiver Ryan Grant slipped on a pass route, Alford caught Cousins’ pass and was left with open field down the Falcons’ sideline for the touchdown.\nDevonta Freeman’s apparent 13-yard TD catch in the final minute of regulation was ruled incomplete on a review. Freeman scored on 6-yard run two plays later to give Atlanta a 19-16 lead. Dustin Hopkins’ 52-yard field goal on the final play of regulation forced overtime.\nThe Falcons (5-0) overcame two interceptions and a lost fumble by Matt Ryan. Freeman had 27 carries for 153 yards and the touchdown.\nThe Redskins (2-3) were denied their attempt for their first back-to-back wins in almost a year — since Weeks 7 and 8 in 2014.\nBrowns 33, Raven 30 (OT) Travis Coons kicked a 32-yard field goal in overtime and Josh McCown threw for a team-record 457 yards.\nCleveland (2-3) had lost 13 of the previous 14 meetings between these AFC North foes, but in this one the Browns rallied from a 12-point deficit to leave the Ravens (1-4) alone in the division cellar.\nPlaying its second straight overtime game, Baltimore went three-and-out on the first possession of the extra session. McCown then used more than seven minutes to move the Browns 51 yards before Coons kicked his fourth field goal with 6:43 left in OT.\nMcCown completed 36 of 51 passes with two touchdowns in becoming the first quarterback in Browns history with three straight 300-yard games. He broke the team record of 444 yards passing set by Brian Sipe on Oct. 25, 1981, against the Baltimore Colts.\nJoe Flacco ran for two 1-yard touchdowns and threw for a score, but fell to 13-2 against Cleveland.\nPackers 24, Rams 10 Aaron Rodgers threw for two touchdowns and 241 yards, but his impressive string of not being intercepted at Lambeau Field ended.\nRodgers was 19 of 30 for 241 yards with long scoring strikes to receivers Ty Montgomery and James Jones. But NFL-record streaks of 587 pass attempts and 49 touchdown passes at home without an interception for Rodgers ended in the first quarter on linebacker James Laurinaitis’ diving pick of a tipped ball for the Rams (2-3).\nRodgers threw another interception in the second quarter before losing a fumble in the third.\nRelentless pressure on quarterback Nick Foles helped keep the Packers (5-0) unbeaten. Foles threw a career-worst four interceptions, two in the fourth quarter inside the Packers 10.\nRookie cornerback Quinten Rollins returned an interception 45 yards for a touchdown for a 14-0 lead in the first quarter, and picked off another pass at the 7 with 23 seconds left.\nPatriots 30, Cowboys 6 Tom Brady threw for two touchdowns, with a 1-yard plunge for another score, and the Patriots pulled away from a powerless Dallas offence missing Tony Romo and Dez Bryant.\nBrady guided two long touchdown drives in the second half after getting sacked five times before halftime, including once each by Greg Hardy and Rolando McClain in their returns from four-game suspensions.\nThe 38-year-old Brady joined Peyton Manning and Fran Tarkenton as the only NFL quarterbacks to get off to 4-0 starts at least four times. The Super Bowl champions won their seventh straight game, including the playoffs last season.\nThe Cowboys (2-3) lost their third straight without Romo and his top receiver, and backup Brandon Weeden lost his 11th in a row as a starter.\nBroncos 16, Raiders 10 Chris Harris Jr. returned a fourth-quarter interception 74 yards for a touchdown and the Broncos overcame a shaky day from Peyton Manning.\nManning was intercepted twice by 1998 draft classmate Charles Woodson and failed to lead the Broncos (5-0) to an offensive touchdown for the second time in five games this season. But Denver’s defence made sure it didn’t matter, getting a third defensive touchdown of 2015.\nDerek Carr threw for 249 yards and one touchdown for the Raiders (2-3), but was done in by the interception midway through the fourth quarter with Oakland in position for a possible go-ahead field goal.\nThe Raiders added a late 50-yard field goal by Sebastian Janikowski following a 48-yard pass interference penalty on Bradley Roby, but Denver recovered the onside kick.\nManning finished 22 for 35 for 266 yards, was sacked twice and had two interceptions. Denver ran for only 43 yards.\nThis was Denver’s second-lowest scoring regular season with Manning as quarterback, ahead of only a seven-point effort last year against St. Louis.\nThe Broncos have now won eight straight in this series but the Raiders had plenty of chances in this one. Janikowski missed a pair of field goals before Carr’s late gaffe ended Oakland’s hopes.\nCardinals 42, Lions 17 Carson Palmer threw for three touchdowns, while Matthew Stafford was benched after throwing a third interception.\nThe Cardinals (4-1) have a two-game lead in the NFC West. The Lions (0-5) have the dubious distinction of being the NFL’s only winless team and are off to their worst start since becoming the league’s only 0-16 team in 2008.\nPalmer was poised and efficient, completing 11 of 14 passes for 161 yards, with a 14-yard pass to Darren Fells, an 18-yard connection to John Brown, and a 2-yard strike to Larry Fitzgerald for scores.\nStafford simply struggled, getting picked off on passes well short of receivers and missing at least one wide-open option. He was replaced in the third quarter by Dan Orlovsky. Orlovsky played on the 0-16 Lions.\nBears 18, Chiefs 17 Jay Cutler led the Bears to a pair of fourth-quarter touchdowns, the second an alert toss to Matt Forte with 18 seconds left.\nKansas City lost star running back Jamaal Charles to a potentially season-ending right knee injury.\nChicago (2-3) trailed 17-3 early in the third quarter when Charles went down while trying to make a cut. The preliminary diagnosis was a torn ACL and Charles will have an MRI exam Monday.\nThe Bears quickly seized the momentum.\nAfter Robbie Gould’s second field goal got them going, Cutler led an 88-yard drive that he capped with a 22-yard strike to Marquess Wilson with 3:05 left. The 2-point conversion came up short, but the Bears defence responded by forcing a quick three-and-out.\nWith help from a pass interference call on Chiefs rookie Marcus Peters, the Bears quickly moved downfield. That’s when Cutler took a snap from the shotgun, dropped the ball, picked it up and spotted Forte running past safety Husain Abdullah in the end zone for the go-ahead score.\nThe Chiefs (1-4) tried a 66-yard field goal that came up short as time expired.\nEagles 39, Saints 17 Sam Bradford overcame two red-zone interceptions and threw for 333 yards and two touchdowns, Fletcher Cox forced two fumbles on sacks.\nRyan Mathews and DeMarco Murray each rushed for touchdowns to help the Eagles (2-3) break out of their offensive slump. They snapped a three-game losing streak at home that dated to last season.\nDrew Brees had three turnovers leading to 17 points for Philadelphia, and the Saints fell to 1-4 a week after an overtime win against Dallas.\nBradford and the rest of the offence struggled through the first quarter of the season. It looked like more of the same after he threw two INTs in the end zone, but he bounced back from the rough start. Philadelphia rushed for 186 yards.\nBuccaneers 38, Jaguars 31 Doug Martin ran for 123 yards and scored three touchdowns, helping Jameis Winston rebound from his worst pro performance.\nThe Bucs (2-3) snapped an 11-game home losing streak that dated to December 2013, the same month the Jaguars (1-4) began an equally agonizing road skid that now stands at 12.\nWinston threw for 209 yards and one touchdown without an interception, redeeming himself after turning the ball over five times in a 14-point loss to Carolina last week.\nBlake Bortles passed for 303 yards and four TDs, but also threw an interception that set up a Bucs touchdown. The Jaguars gave up a 58-yard punt return that led to Martin’s 10-yard TD reception, and rookie Corey Grant lost a third-quarter fumble that defensive end Jacquies Smith returned 3 yards for a score that put Tampa Bay ahead for good.\nMore on thestar.com\nKeuchel, Astros push Royals to brink\nDickey thought playoffs would be an annual exercise in Toronto", "external_links": ["http://static.freeskreen.com/publisher/52/freeskreen.min.js"], "published": "2015-10-11T03:00:00.000+03:00", "crawled": "2015-10-12T05:12:31.741+03:00", "highlightTitle": ""}