{"organizations": [], "uuid": "5cb96aff429a998efb972a94fcacb47bbb75a2cf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sportsnews.com.au", "main_image": "http://sportsnews.com.au/defaultimage.jpg", "site_section": "http://www.sportsnews.com.au/feed", "section_title": "Sports News Australia", "url": "http://www.sportsnews.com.au/nrl/cowboys-turn-into-kings-of-townsville/158931", "country": "CA", "title": "Cowboys turn into Kings of Townsville", "performance_score": 0, "site": "sportsnews.com.au", "participants_count": 1, "title_full": "Cowboys turn into Kings of Townsville", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:54:00.000+03:00", "replies_count": 0, "uuid": "5cb96aff429a998efb972a94fcacb47bbb75a2cf"}, "author": "AAP", "url": "http://www.sportsnews.com.au/nrl/cowboys-turn-into-kings-of-townsville/158931", "ord_in_thread": 0, "title": "Cowboys turn into Kings of Townsville", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Cowboys turn into Kings of Townsville   11:54 am \nWas the 2015 NRL grand final the greatest played in the modern era? \nFor the success-starved people of North Queensland, nothing else compares. \nThere have been some epic grand finals in recent decades. The 1989 clash between Balmain and Canberra is a standout, as is the 1997 ARL decider in which Newcastle winger Darren Albert stole the win over Manly on fulltime. \nBut ask north Queenslanders and those don’t come close to Sunday’s epic all-Queensland showdown. \nAs Kyle Feldt channelled his inner Albert to cross in the final seconds of regular time, the chorus of cheers could be heard from Winton to Weipa. \nAnd when Johnathan Thurston slotted the match-winning golden-point field goal to clinch the title decider 17-16 over Brisbane, the streets of Townsville erupted in elation. \nThey were jammed into the Cowboys Leagues Club, but they also partied in the car park where a temporary big screen had been erected. \nThey filled every pub from the Upper Ross to Magnetic Island. \nChristmas won’t sell as much crepe paper and tinsel as the Cowboys win did. \nEvery second house in Townsville, Cairns and every township scattered throughout North Queensland was dressed up for the occasion. \nBrown lawns scorched by drought were brought to life with blue, gold and grey spray paint. \nNow those colours will fly over Brisbane after Townsville Mayor Jenny Hill made a bet with her Brisbane counterpart Graham Quirk in which the loser will display the winner’s flag in their city for a week. \n“I hand delivered the Cowboys flag to the Brisbane City Council so they can honour the bet,” Cr Hill said. \n“They now need to fly our Cowboys flag for a week in Brisbane. \n“The flag is 9 metres by 12 metres. It fills an entire suitcase.” \nRenegade federal MP Bob Katter lays claim to being one of the proudest North Queenslanders every to pull on an Akubra. \nThe Cowboys made his chest puff out an extra couple of inches. \n“Not a prouder night to be a North Queenslander,” he said. \nQueensland Premier Annastacia Palaszczuk acknowledged the long-suffering North Queensland faithful. \n“It’s been a long time coming, but no one deserves it more than North Queensland and their diehard fans,” she said. \nThe party is set to continue well into the week. \nThe Cowboys will arrive home in Townsville to a heroes welcome on Monday before the gates of 1300 Smiles Stadium are thrown open for a civic reception at 3pm. \nAnd for the thousands of beaming fans who will cram in, 2015 will always be the year of the Cowboy.  ", "external_links": [], "published": "2015-10-05T03:54:00.000+03:00", "crawled": "2015-10-05T04:01:50.530+03:00", "highlightTitle": ""}