{"organizations": [], "uuid": "5aba35ea47d798e0c42d0c037e99c5f86d54e687", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/47529300.cms", "site_section": "http://timesofindia.indiatimes.com/rssfeeds/4720867.cms", "section_title": "Top Stories - Golf - Sports - The Times of India", "url": "http://timesofindia.indiatimes.com/sports/golf/top-stories/Viraj-leds-Indias-challenge-at-Asia-PacificAmateur-Cship/articleshow/49166717.cms", "country": "IL", "title": "Viraj leds India's challenge at Asia-Pacific Amateur C'ship", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "Viraj leds India's challenge at Asia-Pacific Amateur C'ship - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T18:05:00.000+03:00", "replies_count": 0, "uuid": "5aba35ea47d798e0c42d0c037e99c5f86d54e687"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/sports/golf/top-stories/Viraj-leds-Indias-challenge-at-Asia-PacificAmateur-Cship/articleshow/49166717.cms", "ord_in_thread": 0, "title": "Viraj leds India's challenge at Asia-Pacific Amateur C'ship", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW DELHI: The Indian Golf Union (IGU) nominated its top six amateur players on the World Amateur Golf Rankings for the Asia-Pacific Amateur Championship (AAC) that gets underway at Hong Kong tomorrow. \n\nThe team for the four-day stroke play event will feature one of India's brightest young golfers - Viraj Madappa of Kolkata who won the Taiwan Amateur Golf Championship earlier this year and also became the first Indian to play at the Porter Cup. \n\nHaving played this tournament twice in the past (Australia in 2014; China in 2013), Madappa is expected to mentor first timers Samarth Dwivedi, Karandeep Kochhar, Priyanshu Singh and Veer Ahlawat at the Clearwater Bay country & golf club. \n\nPatna's Aman Raj, the current leader of IGU's Men's Order of Merit who finished as the second best Indian at last year's event, is also expected to put up a good finish. \n\nThe championship features more than 120 players from 37 countries including Australian Ryan Ruffels, currently ranked 8th in the world, his countryman Antonio Murdaca who is also a defending champion and the 2012 AAC Champion Guan Tianlang from China. \n\nIGU has been sending players for the Asia-Pacific Amateur since its inauguration in 2009 and the players have been selected as per their World Amateur Golf Rankings. \n\nArun Kumar Singh, Director General, IGU, who is accompanying the team, said: \"The field is quite difficult but we have the right skills amongst the six players. All our boys will have to believe in themselves and should imagine their name on top of the leader board on the final day.\" \n\nOrganised by the Asia Pacific Golf Confederation in conjunction with the Masters Tournament and the R & A, the event provides a unique opportunity for players to win a ticket to the 2016 Masters Tournament at Augusta National Golf Club. \n\nThe winner and runner-up will also be eligible to compete in the Open qualifying series, Asia or Australasia for the 2016 Open Championship to be played at the Royal Troon Golf Club, Scotland and the winner will also receive an invitation to the 2016 Qatar Masters. \n\nContinuing under its banner of 'Creating Future Heroes', the AAC will feature 120 players from the APGC's member associations and will be played over 72-holes of stroke play, with a cut for the leading 60 players plus ties after 36 holes. In the past, AAC has produced an attractive list of winners that includes two-time champion Japanese Hideki Matsuyama who has finished in top-20 in all four majors after turning professional in 2013. \n\n ", "external_links": [], "published": "2015-09-30T18:05:00.000+03:00", "crawled": "2015-10-01T07:23:40.864+03:00", "highlightTitle": ""}