{"organizations": [], "uuid": "faec877a2a8e683434dfe3b7979a158fadac09c8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.berkshireeagle.com", "main_image": "http://local.berkshireeagle.com/common/dfm/assets/logos/1200x627/berkshireeagle.png", "site_section": "http://feeds.berkshireeagle.com/mngi/rss/CustomRssServlet/101/204008.xml", "section_title": "Berkshire Eagle: Local Sports", "url": "http://www.berkshireeagle.com/localsports/ci_28923007/some-surprises-after-nescac-footballs-week-2?source=rss", "country": "IL", "title": "Some surprises after NESCAC football's week 2", "performance_score": 0, "site": "berkshireeagle.com", "participants_count": 1, "title_full": "Some surprises after NESCAC football's week 2", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T14:20:00.000+03:00", "replies_count": 0, "uuid": "faec877a2a8e683434dfe3b7979a158fadac09c8"}, "author": "Howard Herman\nhherman@berkshireeagle.com @howardherman on Twitter", "url": "http://www.berkshireeagle.com/localsports/ci_28923007/some-surprises-after-nescac-footballs-week-2?source=rss", "ord_in_thread": 0, "title": "Some surprises after NESCAC football's week 2", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted: 10/05/2015 07:20:34 AM EDT Updated: 10/05/2015 07:21:58 AM EDT \nThe old song on Sesame Street goes \"One of these things is not like the other.\" One could certainly use that song to describe the second week of the NESCAC football season. \nAmherst, Middlebury, Trinity and Tufts are all sitting atop the conference standings with identical 2-0 records. The outlier of those three is most certainly Tufts. \nFifth-year head coach Jay Civetti has the Jumbos at 2-0 and the Jumbos are an impressive 6-4 in their last 10 games. That is especially impressive when you realize that in Civetti's previous three years, Tufts was a combined 0-24. \nThe Jumbos won their second close game of the season Saturday, beating Bates 17-16. Willie Holmquist, who kicked a game-winning field goal in overtime during a win against Hamilton two weeks ago, missed a 23-yard field goal against Bates. But nailed a 28 yarder with 14 minutes left in the fourth quarter to provide Tufts with the decisive points. \nThe Jumbos had the offensive player of the week in wide receiver Jack Cooleen. Cooleen had 178 receiving yards on seven catches and caught a pair of touchdowns. It was the most yardage by a Tufts receiver since October, 2010. \nTufts will have a chance to go 3-0 this weekend as it plays at home against winless Bowdoin. Advertisement \nThe Berkshire County home team saw its record fall to 1-1 on Saturday. Williams was shut out by Trinity 24-0 on Saturday on a day where the Ephs had only 176 yards in total offense on 66 plays. \nOnce again, Red Zone issues plagued the Ephs. They had a 17-play drive in the second quarter stall on the Trinity two-yard line. The score at the time was 14-0, but a touchdown there might have changed things. \n\"We were able to move the ball so there were some really bright spots and the score isn't really indicative of the way the game actually went,\" Williams coach Aaron Kelton said in a postgame statement. \"If we were able to tuck it in a couple of those times we were in the Red Zone, it's a different football game.\" \nIt might have been a different game, but the outcome might not have changed. \nStatistically, sophomore tailback Connor Harris is sixth in the conference in rushing. Harris has run for 121 yards in two games on 30 carries, for a 4.0-yard per carry average. \nQuarterback Austin Lommen, who threw for only 90 yards against Trinity, fell to seventh in NESCAC in passing and in passing efficiency. \nPart of that was due to the fact that Trinity free safety Spencer Donahue was the NESCAC defensive player of the week. \nDonahue had nine tackles and forced two costly Williams turnovers. He intercepted a pass and recovered a fumble on the Bantam six-yard line. Both came with the score 14-0. \nThe top quarterback in the conference continues to be Middlebury's Matt Milano. He leads in passing per game and pass efficiency. Williams gets to see him in two weeks in Vermont. \nThe Ephs will open their home season Saturday at Farley-Lamb Field against 0-2 Bates. Contact Howard Herman at 413-496-6253.", "external_links": [], "published": "2015-10-05T14:20:00.000+03:00", "crawled": "2015-10-05T16:11:26.049+03:00", "highlightTitle": ""}