{"organizations": ["Royals", "Astros", "Royals Strong", "Eric Christian Smith Getty Images HOUSTON"], "uuid": "c0a4ead63e541f3fe666f7f2487cb6a6fdb151e9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.channel4000.com", "main_image": "http://www.channel4000.com/image/view/-/35784202/highRes/2/-/maxh/640/maxw/640/-/4ir9uy/-/HOU-v--KC-Game-3-ALDS-Jason-Castro-Eric-Christian-Smith-Getty-Images-jpg.jpg", "site_section": "http://www.channel4000.com/131066?format=rss_2.0&view=feed", "section_title": "Sports News", "url": "http://www.channel4000.com/sports/astros-4-royals-2/35785262", "country": "GB", "title": "Strong outing by Kuechel propels Astros over Royals", "performance_score": 0, "site": "channel4000.com", "participants_count": 0, "title_full": "Strong outing by Kuechel propels Astros over Royals", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T05:38:00.000+03:00", "replies_count": 0, "uuid": "c0a4ead63e541f3fe666f7f2487cb6a6fdb151e9"}, "author": "", "url": "http://www.channel4000.com/sports/astros-4-royals-2/35785262", "ord_in_thread": 0, "title": "Strong outing by Kuechel propels Astros over Royals", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kuechel"], "text": "Strong outing by Kuechel propels Astros over Royals Author: By The Sports Xchange Published On: Oct 11 2015 07:55:30 PM EDT Updated On: Oct 11 2015 10:38:56 PM EDT Eric Christian Smith Getty Images HOUSTON - \nLeft-hander Dallas Keuchel performed in his first postseason home start like he did throughout the regular season, throwing seven strong innings in the Houston Astros' 4-2 win over the Kansas City Royals on Sunday at Minute Maid Park in Game 3 of this American League Division Series. \nKeuchel (2-0) tossed a season-high 124 pitches and dug deep into his reservoir to strand runners at third base in each of his final two frames. \nThe close of the seventh was particularly dramatic, with Keuchel staying in to face Royals center fielder Lorenzo Cain, who homered off Keuchel leading off the fourth and represented the tying run in a two-run game. Related Content Astros take ALDS opener 5-2 against Royals \nKeuchel struck out Cain to cap his outing and preserve his lead. \nThe Astros took a 2-1 lead in the best-of-five series behind Keuchel, who allowed one run on five hits and three walks with seven strikeouts, and first baseman Chris Carter, whose wobbly defense early was negated by his three-hit effort. \nCarter finished a triple shy of the cycle after smacking a one-out double in the fifth inning and later scoring the go-ahead run, and hitting a first-pitch leadoff homer in the seventh off Royals lefty Danny Duffy. \nGame 4 is Monday afternoon at Minute Maid Park. The Astros will send rookie right-hander Lance McCullers to the mound seeking a berth in the AL Championship Series opposite Royals right-hander Yordano Ventura, who suffered the loss in the series opener. \nRoyals right-hander Edinson Volquez (0-1) was electric through four innings, relying on a breaking ball that befuddled the Astros. However, he carried a tenuous 1-0 lead into the fifth and surprisingly started to unravel against the bottom of the Houston order. \nCarter doubled after third baseman Luis Valbuena worked a walk, setting the table for catcher Jason Castro, who was hitless in nine postseason at-bats. Castro delivered a seeing-eye single to center field, scoring both Valbuena and Carter and delivering Houston a 2-1 lead. \nThe Astros tacked on insurance runs in the sixth and seventh, both coming from the leadoff spot. Right fielder George Springer doubled and scored off Volquez in the sixth, coming home when center fielder Carlos Gomez laced a first-pitch single to center with two outs. Carter added his first career postseason home run an inning later, a deep blast to left. \nVolquez allowed three runs on five hits and four walks with eight strikeouts, departing with two outs in the sixth inning. Royals left fielder Alex Gordon smacked a leadoff homer to left in the ninth against Astros closer Luke Gregerson, who rallied to strike out Cain with a runner on first to end the threat. \nNOTES: Astros CF Carlos Gomez was in the starting lineup for the first time this series, batting sixth. Gomez homered in the American League Wild Card Game win over the Yankees but re-aggravated the left intercostal strain that first sidelined him in mid-September. He appeared as a pinch runner in Games 1 and 2 of the AL Division Series. ... Royals manager Ned Yost was leaning toward starting RHP Yordano Ventura in Game 4 of the ALDS even before Ventura pitched a rain-shortened two innings in Game 1 last Thursday. Ventura threw just 42 pitches before being lifted following a 49-minute rain delay. ... Astros manager A.J. Hinch declined to name a starter should the series extend to five games. RHP Collin McHugh would seem to be the logical choice after winning the opener on Oct. 8, allowing two runs on four hits and two walks with one strikeout over six innings in a 5-2 victory. Distributed by LAKANA and The Sports Xchange. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-12T05:38:00.000+03:00", "crawled": "2015-10-12T15:34:32.747+03:00", "highlightTitle": ""}