{"organizations": [], "uuid": "8a1591359418cf0a8803aaa6a9065f5f0391b8ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.denverpost.com", "main_image": "http://extras.mnginteractive.com/live/media/site333/2015/1015/20151015__FBCBigTenInjuryBug~1.jpg", "site_section": "http://www.denverpost.com/colleges", "section_title": "College Sports - The Denver Post", "url": "http://www.denverpost.com/colleges/ci_28973121/lengthy-injury-list-becoming-coachs-headache-big-ten", "country": "US", "title": "Lengthy injury list becoming a coach's headache in Big Ten", "performance_score": 0, "site": "denverpost.com", "participants_count": 1, "title_full": "Lengthy injury list becoming a coach's headache in Big Ten - The Denver Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T10:18:00.000+03:00", "replies_count": 0, "uuid": "8a1591359418cf0a8803aaa6a9065f5f0391b8ae"}, "author": "Eric Olson  AP College Football Writer", "url": "http://www.denverpost.com/colleges/ci_28973121/lengthy-injury-list-becoming-coachs-headache-big-ten", "ord_in_thread": 0, "title": "Lengthy injury list becoming a coach's headache in Big Ten", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Big Ten is hurtin' for certain.\nLast week, top Iowa defensive lineman Drew Ott tore the ACL in his right knee and is out the rest of the season.\nThe week before, Big Ten rushing leader Jordan Howard and his Indiana teammate, quarterback Nate Sudfeld, injured ankles and haven't played since.\nThree weeks ago, Minnesota all-conference cornerback Briean Boddy-Calhoun went down with an injury to his right knee and is yet to return.\nThe injury list has been long across the nation, especially so in the Big Ten.\n\"You look across the landscape of college football, guys are dropping left and right, and it's a lot of different things, it's not one particular thing,\" Purdue coach Darrell Hazell said. \"You are seeing ACLs, concussions, shoulders, ankles, all those things. I don't know if there is a magical formula to keep guys healthy other than you gotta watch the amount of reps that you give them.\"\nWhile defending national champion Ohio State has not had any starters miss a game because of injury, Minnesota had eight out in last week's win over Purdue.\n\"I've never seen anything like it in my 32 years of coaching,\" Gophers coach Jerry Kill said. \"Just one of those years. What do you do? Like I tell our guys, you can't get down. You just coach them. We're going to play with some young players probably, and that's part of it. They'll have to grow up, and we'll be better down the road for it.\"\nAdvertisement Michigan State has lost three starters on offense and three on defense, and that was after rising star linebacker Ed Davis went out for the season when he hurt a knee in preseason practice.\nMichigan's defense was without three starters last week, and its running backs have been dinged up all season.\nNebraska's defense has started 20 different players and has had 19 man-games lost to injury by projected starters or top reserves. Maryland, Rutgers and Purdue also have had a bunch of key defensive players out.\nPenn State running backs Saquon Barkley and Akeel Lynch have missed the last two games, a top linebacker was lost in the opener and its secondary has had starters in and out of the lineup.\nOtt is the latest in a line of Iowa players who are hurt. The Hawkeyes also could be without a starting receiver, running back and two offensive linemen when they play at Northwestern on Saturday.\nNorthwestern, bitten hard by the injury bug last year, had cornerback Matthew Harris go out with broken bones in his face after he was hit in the head by a knee last week against Michigan, and receiver Austin Carr is among other Wildcats who have been banged up.\nNorthwestern coach Pat Fitzgerald said all but a few of the injuries have occurred in games, so it's not as if the practice regimen has been a cause.\n\"When you get limited numbers — last year we had close to 40 players out for our last couple weeks — that totally changes the way you can practice,\" Fitzgerald said. \"You can't get reps from a full-speed standpoint. You have to practice smarter and have to try to find a way to get the guys to the race. It's tough to develop a team when you have to practice that way.\"\nIllinois lost top running back Josh Ferguson to a shoulder injury Oct. 3, and wide receiver Geronimo Allison has gone through concussion protocol tests after getting hit hard last week against Iowa.\nWisconsin tailback Corey Clement had sports hernia surgery a month ago, and the Badgers have played four different starting offensive lines. Center Dan Voltz, who has started 26 games over three seasons, injured an arm last week against Nebraska and is questionable this week for Purdue.\n\"I don't know how to explain the trend, if that's what it is,\" Badgers coach Paul Chryst said. \"I've been around teams and years here where you see kind of the same injury popping up, and maybe it's something you're doing with the way you're training or practicing. But when it's kind of all over the place, it's a little bit harder to pinpoint.\"\n———\n Freelance writers Dennis Semrau and Jeff Washburn and AP Sports Writers Dave Campbell and David Ginsburg contributed.\n———\nAP college football website: collegefootball.ap.org", "external_links": [], "published": "2015-10-15T10:18:00.000+03:00", "crawled": "2015-10-16T00:58:28.635+03:00", "highlightTitle": ""}