{"organizations": ["Barca Chase"], "uuid": "9c9da22753a543f7a4f27efbd62962c16e5bf262", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/robinvanpersie620x400.jpg", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=2&gender=1", "section_title": "Sports News", "url": "http://www.modernghana.com/sports/649787/2/barca-chase-van-persie.html", "country": "US", "title": "Barca Chase van Persie", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "Barca Chase van Persie", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T13:48:00.000+03:00", "replies_count": 0, "uuid": "9c9da22753a543f7a4f27efbd62962c16e5bf262"}, "author": "", "url": "http://www.modernghana.com/sports/649787/2/barca-chase-van-persie.html", "ord_in_thread": 0, "title": "Barca Chase van Persie", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sports News | 17 October 2015 11:48 CET Barca Chase van Persie By Daily Guide \nRobin van Persie's career could be set for an unexpected Nou Camp swansong with Barcelona considering signing the 32-year-old Dutch forward in January. \nVan Persie’s role would be to act as back-up for Neymar, Luis Suarez and Lionel Messi, a similar job to the one Henrik Larsson did when he moved to Barca in 2004 after seven years at Celtic. \nBarcelona have Messi out injured and Suarez is also a doubt for Saturday's game against Rayo Vallecano. That leaves Neymar up front alongside youngsters Sandro and Munir El Haddadi. \nHaving sold Pedro to Chelsea this summer, Barca will look to bring in a new forward in January when their player registration ban is finally lifted. \nThe club have been linked with Celta Vigo's Spain forward Nolito. The 28-year-old has played for Barcelona before and worked with coach Luis Enrique. But his â‚¬18million (£13.3m) buy-out clause is a problem because Barcelona are already at the limits of their self-imposed financial restrictions. \nBarcelona's sporting director Robert Fernandez watched Van Persie head past his own keeper as Holland failed to reach Euro 2016 this week. He also scored at the right end as the Dutch lost 3-2 to the Czech Republic. \nThe striker has fallen out of favour at Fenerbahce and could be available in the winter transfer window. The former Manchester United forward has been linked with Barcelona before. \nThe fact that he started out as a winger at Feyenoord before becoming a centre forward always seemed to make him a good fit for Barca's 4-3-3 system. There are close links between the player and Darren Dein, son of former Arsenal director David, and someone who played a part in Cesc Fabregas, Thierry Henry and Alex Song all ending up at the Nou Camp. \nThere would be some opposition to any move for Van Persie. Enrique would be happier with Nolito but for around £2.2m, Van Persie is being pushed as a better short-term solution.", "external_links": [], "published": "2015-10-17T13:48:00.000+03:00", "crawled": "2015-10-17T18:48:14.254+03:00", "highlightTitle": ""}