{"organizations": [], "uuid": "3adc8da1a556b5fcdd93771f7367d3565b0843bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freepressjournal.in", "main_image": "http://www.freepressjournal.in/wp-content/uploads/2014/12/Mumbai-City-FC-220x220.jpg", "site_section": "http://freepressjournal.in/?cat=1155&feed=rss2", "section_title": "Free Press Journal » Sports", "url": "http://www.freepressjournal.in/mumbai-face-tough-task-against-delhi/", "country": "IN", "title": "ISL 2015: Mumbai face tough task against Delhi", "performance_score": 0, "site": "freepressjournal.in", "participants_count": 1, "title_full": "ISL 2015: Mumbai face tough task against Delhi | Free Press Journal", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T21:40:00.000+03:00", "replies_count": 0, "uuid": "3adc8da1a556b5fcdd93771f7367d3565b0843bb"}, "author": "PTI", "url": "http://www.freepressjournal.in/mumbai-face-tough-task-against-delhi/", "ord_in_thread": 0, "title": "ISL 2015: Mumbai face tough task against Delhi", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "> Mumbai: Winless Mumbai City FC are bound to find things difficult against high-flying Delhi Dynamos when the two teams lock horns in an Indian Super League football game at the D Y Patil Stadium tomorrow. The Nicholas Anelka-coached side is holding a solitary point in their kitty after a goalless drawn encounter with Kerala Blasters, while losing to FC Pune City (1-3) and Chennayin FC (0-2) in the other two games.\nMumbai’s big hopes of turning a new leaf at their home venue after the first two away games came to naught when they were thrashed 2-0 by Chennayin FC. In three games, Anelka’s side has scored only once – in their opening Maharashtra Derby against FC Pune City. Mumbai, thus, would be eager to find the mark as well as notch up their first win of the season against Delhi.\nRoberto Carlos-coached Delhi, on the other hand, would want to carry on their three-match victory streak further and the not-so-settled Mumbai offer them as fine a chance as any. Possessing a hard-working midfield, they have been impressive in the past three games after having lost to FC Goa 0-2 in their season-opener. Successive wins over Chennayin FC (1-0), Pune (2-1) and Kerala Blasters (1-0) have given them a shot in the arm and piloted them to the second spot on the league table with 9 points.\nIndia forward Robin Singh, Brazilian Gustavo Santos and Richard Gadze of Ghana need to be closely monitored by the Mumbai deep defence. The hosts’ midfielders would also face a tough battle against their Delhi counterparts manned by the likes of former France international Florent Malouda and Dutchman Hans Mulder.\nIn short, Mumbai need to find their feet quickly or else they would stay rooted to the 7th spot that they are occupying currently or even slide lower down to the last rung.\nMumbai’s assistant coach Oscar Bruzon expressed deep concern at his side’s winless predicament. “There is no doubt that we are in an emergency situation. This is not the beginning that we wanted and all the guys are concerned to take the three points tomorrow because there is no more room for mistakes. This league is very short and this is the moment to win when we have another four games at home,” he said today.\nAsked to chalk out his side’s strategy against a side which has a strong midfield, Bruzon said the team needs to show attitude. “We have analysed all the strong points of Delhi. Mumbai City need to see inside, within ourselves, put out the strongest team, show a very good attitude and from there, we’re going to build for the next games”.\nHe made it clear that marquee player-coach Anelka was unavailable to play. “No. We have two players who are not available for tomorrow. One is Brandon (Fernandes) and the other is Nico. Of course both of them are important in attack but we’re not focusing on the players who cannot help but in the others.”\nHe also expected India skipper and star forward Sunil Chhetri to be at his best. “What I said last time was that from the players who were with the national team, Sunil was the only one who played 90 minutes. So in the last game I don’t think he was at his best. Tomorrow defender (Lalchhuanmawia) Fanai, (goalkeeper) Subrata (Pal) and Sunil are going to be on the pitch and it’s up to them and the others who have the chance (to play tomorrow) to fight for this club on the pitch.”\nHe also hinted at fielding a rejigged midfield for the game. “I have respect for Delhi because they have won the last two matches and have six points. Our team has been very good and has played well but unfortunately have not got results,” Subrata Pal said.\n“I have full trust in my fellow players and my coach. Whatever has happened is in the past. Now we’re starting from tomorrow. Tomorrow (is like) our first game and the boys are going for it,” he added.", "external_links": [], "published": "2015-10-20T21:40:00.000+03:00", "crawled": "2015-10-20T20:55:55.321+03:00", "highlightTitle": ""}