{"organizations": [], "uuid": "8abbd4c1bef601b904634f0c8e924206a069ec55", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/himachal/bali-warns-of-stern-action-against-pulses-hoarders/148940.html", "country": "US", "title": "Bali warns of stern action against pulses hoarders", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "Bali warns of stern action against pulses hoarders", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "8abbd4c1bef601b904634f0c8e924206a069ec55"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/himachal/bali-warns-of-stern-action-against-pulses-hoarders/148940.html", "ord_in_thread": 0, "title": "Bali warns of stern action against pulses hoarders", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kuldeep Chauhan\nTribune News Service\nShimla, October 21\nPutting all blames of shortage of pulses and oil seeds in the country on the Narendra Modi-led Central government, Food and Civil Supplies Minister GS Bali today warned the traders and whole sellers of stern action if they resort to hoarding and black marketing of pulses and other food items in the state. Responding to the Central Consumer Affairs Ministry directive of taking preventing steps to check hoardings and black marketing of pulses in state, Bali said it was the wrong polices of the Central government that have failed to control prices of pulses and other commodities in the country. These gave a free run to the hoardings and black marketers in the country, he alleged. The hoarders were taking advantage of the situation that had developed due to drop of about 4 billion tonnes in production of oil seeds, pulses and food items in the country, revealed officials. The Central government is importing 5,000 tonnes of pulses this year to make up for the shortage in the country. As the prices of commodities are increasing, this has made the lives of common man miserable, he told the mediapersons here today. “We squarely blame the Centre as they should have taken preventive steps to check this”, he added. Talking about the steps taken by the Food and Civil Supplies Department on checking hoardings and black marketing in the state, Bali claimed that the state government had managed the supplies of essential commodities before hand at its own level by making available the supplies of essential commodities including pulses at the government-run retail shops across the state. “We have kept a strict vigil on the hoarders and black marketers in the state”, he claimed. Not only this, the state has allocated Rs 210 crore for providing subsidized ration to the card holders through its retail shops in the state, Bali said. “We have been providing cheap ration and pulses to consumers”, Bali asserted. He said the department had been directed to review the availability of food items in the state-run godowns. Food controllers have been asked to act against black marketers and inspect that each shop display rate list of commodities in compliance with the government’s directions, he asserted. The state has been controlling prices of other items, including onions, at its level besides ensuring that consumers get subsidized rice, wheat flour, pulses, edible oils, sugar, salt and other items every month in its retail shops, Bali claimed.", "external_links": [], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-22T04:13:00.005+03:00", "highlightTitle": ""}