{"organizations": [], "uuid": "3a67fcfb7b567ee4d9de07152aa34b9d1104c598", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "http://images.tribuneindia.com/cms/gall_content/2015/10/2015_10$largeimg03_Saturday_2015_003859713.jpg", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/jammu-kashmir/leh-poll-bjp-faces-tough-fight-from-cong-pdp/140797.html", "country": "US", "title": "Leh poll: BJP faces tough fight from Cong, PDP", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "Leh poll: BJP faces tough fight from Cong, PDP", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T03:00:00.000+03:00", "replies_count": 0, "uuid": "3a67fcfb7b567ee4d9de07152aa34b9d1104c598"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/jammu-kashmir/leh-poll-bjp-faces-tough-fight-from-cong-pdp/140797.html", "ord_in_thread": 0, "title": "Leh poll: BJP faces tough fight from Cong, PDP", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Arteev Sharma\nTribune News Service\nJammu, October 2\nThe saffron party’s dream to gain control over the powerful Ladakh Autonomous Hill Development Council (LAHDC), Leh, which governs the district politically, may suffer a jolt as it faces a tough electoral battle with its arch-rival Congress and its alliance partner Peoples Democratic Party. The PDP’s decision not to ally with any political party for the Leh Council elections is being taken as a setback for the BJP as the latter, on September 19, had announced an alliance with the former for the poll. On September 20, the PDP had categorically stated that it would contest the poll without entering into an alliance with the BJP. Furthermore, the Congress, which too faces the threat of anti-incumbency, has been vigorously campaigning against the BJP’s “failure” to fulfil the commitments made by it during the Lok Sabha elections last year. The Congress has fielded its candidates in all 26 constituencies of the Council, which are going to the polls on October 17, while the BJP has decided to contest 24 seats. The PDP and the National Conference, which don’t have high stakes in the Council elections, will be contesting from eight constituencies each whereas the newly formed New Ladakh Movement (NLM) will fight from 16 seats. Sources said the PDP had also fielded its candidates against the BJP candidates on some constituencies which may give a slight edge to the Congress over the saffron party. The Congress had been ruling the outgoing LAHDC while the BJP has been waiting to taste victory with a thumping majority in the Council since its constitution in 1995. After its first-ever poll victory from the Ladakh Lok Sabha seat in 2014, the BJP had to suffer a major setback in the last Assembly elections when it failed to open its account in the cold desert and lost both seats of Leh district to the Congress. Sat Sharma, the BJP state vice-president and election in charge for LAHDC, admitted the differences between the PDP and the BJP at the local level in Leh but exuded confidence that his party would take control over the LAHDC for the first time. “We (BJP and PDP) decided to contest the Council polls jointly after getting a nod from the Central leadership but there were some kind of apprehensions between the local units of the two parties. Also, we did not want to interfere in the functioning of two local units and it was decided that both parties would contest the poll separately,” Sharma said. He, however, said it would not make any significant impact on the seat tally of the party. The BJP, he claimed, would win the elections with a thumping majority. “This time, we will have our own Chief Executive Councillor in the Leh Council,” he said. Meanwhile, senior Congress leader and Leh MLA Nawang Rigzin Jora was also confident of his party sweeping the elections with thumping majority. “They (BJP) will draw a blank as they have made hollow promises with the people of Ladakh,” Jora said. The outgoing Council had 22 Congress members and four BJP members.", "external_links": [], "published": "2015-10-03T03:00:00.000+03:00", "crawled": "2015-10-03T00:22:07.849+03:00", "highlightTitle": ""}