{"organizations": [], "uuid": "540d1f40673de964d10c3827ddf28b9f2bdb5777", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "lasvegassun.com", "main_image": "//photos.lasvegassun.com/media/img/photos/2015/10/11/20151010_Sun_UNLV_SanJose_Football_LE51_t378.jpg?42670983c634e7c20626cc4856c543752c0d8b2f", "site_section": "http://lasvegassun.com/news/sports/", "section_title": "Sports - Las Vegas Sun News", "url": "http://lasvegassun.com/news/2015/oct/14/rebels-trying-to-build-momentum-heading-into-bye-w/", "country": "EU", "title": "Rebels trying to build momentum as bye week nears", "performance_score": 0, "site": "lasvegassun.com", "participants_count": 1, "title_full": "Rebels trying to build momentum as bye week nears - Las Vegas Sun News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "540d1f40673de964d10c3827ddf28b9f2bdb5777"}, "author": "Taylor Bern", "url": "http://lasvegassun.com/news/2015/oct/14/rebels-trying-to-build-momentum-heading-into-bye-w/", "ord_in_thread": 0, "title": "Rebels trying to build momentum as bye week nears", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Rebel Room On to Fresno You need to upgrade your Flash Player The Rebels' comeback fell short in overtime against San Jose State but Las Vegas Sun sports editor Ray Brewer and reporters Case Keefer and Taylor Bern aren't feeling too down about UNLV's outlook as it prepares for the short week and a trip to Fresno State.\nMore Coverage Rebels ‘devastated’ after comeback falls short against San Jose State Bern’s-Eye View: Mountain West football picks Week 6 The Sun's UNLV football section Next week is a big one for the Rebels’ recruiting efforts, as the staff will spread out across the country during the bye week. First, though, UNLV (2-4, 1-1) travels to Fresno State (1-5, 0-3) for a Friday night clash that kicks off at 7:32 p.m. on ESPN2.\nThe bye week comes at a good time — most coaches prefer it in the middle of the season — with the bonus of getting two weeks to prepare for the Mountain West’s toughest team, Boise State. But even though Fresno State ranks last in the league in points allowed and third-down defense and ranks second to last in red-zone offense, the Rebels aren’t in a position to look past anyone.\nAs usual this season, the quarterback position was an important subject that coach Tony Sanchez discussed during Tuesday’s news conference at Lied Athletic Complex …\n• “We’ll see where we go from here, but right now Kurt’s got the ball.”\nSanchez estimated that Blake Decker , who injured his left, non-throwing shoulder in the win at UNR, is at about 90 percent. He’ll be the backup and is available if the Rebels should need him, either because of an injury or if Kurt Palandech struggles to the point that Sanchez would want to make a change.\nAlthough Decker has more pass attempts (83) than Palandech (68), the sophomore has played just as many snaps as the senior this year, if not more. Sanchez thinks Palandech’s finish to Saturday's game — after San Jose State fumbled, he went 8-of-12 for 153 yards and two touchdowns — is a sign of his continued improvement\nIf UNLV’s defense continues its strong season, it might not matter who’s playing quarterback, and senior safety Blake Richmond said his unit is looking forward to the shortened week …\n• “I think it’s exciting to get out there earlier after that loss.”\nThe Rebels aren’t changing much about their plans this week before heading to Fresno on Thursday. Each practice is a little bit longer to make up for the lost day, but at this stage of the season it’s more about tweaking and refining than any major new developments.\nThe quarterback UNLV’s defense will face is expected to be redshirt freshman Kilton Anderson, but Fresno State has used four guys this season and no one would be surprised to see sophomore Zack Greenlee get some action.\nThe Rebels are more concerned with themselves than their opponent, but there are a couple of guys on the other sideline whom Sanchez keeps an eye on most weeks. They’re linebackers Robert Stanley and Nela Otukolo, and both played for him at Bishop Gorman High …\n• “Great kids. We’ve shared some great times together. I’m rooting for them every game except this one.”\nOtukolo, a true freshman, was briefly the first Gael to follow Sanchez to UNLV before he had a change of heart and switched his commitment to Fresno State. The Rebels’ defense has been solid and their recruiting has gone relatively well, so there likely aren’t many hard feelings about the situation.\nWell, as long as UNLV wins. Last week’s game was heading toward lopsided before the rally, but when it still ends up a loss, things don’t feel all that much different.\nThe Rebels believe in the progress they’ve made, but it won’t feel quite the same if they enter the bye week off back-to-back losses. If they’re going to make a serious push toward winning the West Division and bowl eligibility, this is the type of game they can’t afford to lose.\nOther than winning the Fremont Cannon, UNLV’s big accomplishment might be that it was the last team to score on Michigan, which has outscored opponents 97-0 in three games since their meeting. A reporter reminded Sanchez of that stat toward the end of his news conference …\n• “Hopefully we can hang our hat on something more than that by the end of the year.”\nTaylor Bern can be reached at 948-7844 or taylor.bern@lasvegassun.com . Follow Taylor on Twitter at twitter.com/taylorbern .\nJoin the Discussion: Check this out for a full explanation of our conversion to the LiveFyre commenting system and instructions on how to sign up for an account.\nFull comments policy\nOct. 16, 7:30 p.m. (PST)\n UNLV: Schedule & Stats | Roster Fresno State: Schedule & Stats | Roster Location: Television: ESPN2, Cox ch. 31, HD 1031 NCAA: Odds Rebel Tweets from @TaylorBern Follow the Rebels", "external_links": ["http://www.twitter.com/taylorbern", "https://twitter.com/TaylorBern", "http://web.adblade.com/js/ads/show.js", "http://api.html5media.info/1.1.5/html5media.min.js", "http://www.php.net/manual/en/ref.datetime.php#datetime.constants", "http://www.svendtofte.com/javascript/javascript-date-string-formatting/", "http://blogsearch.google.com/blogsearch?hl=en&ie=utf-8&num=10&q=link:http://www.lasvegassun.com", "http://www.xs4all.nl/~ppk/js/introdate.html", "http://www.uic.edu/depts/accc/software/isodates/leapyear.html", "http://www.xs4all.nl/~ppk/js/beat.html", "http://www.cl.cam.ac.uk/~mgk25/iso-time.html", "http://widgets.outbrain.com/outbrain.js", "http://zor.livefyre.com/wjs/v3.0/javascripts/livefyre.js", "http://blogsearch.google.com/blogsearch_feeds?hl=en&ie=utf-8&num=10&output=atom&q=link:http://www.lasvegassun.com"], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-14T13:43:58.761+03:00", "highlightTitle": ""}