{"organizations": [], "uuid": "07d10eefc0a5fda83589265fbd5b09cb3dbd2b74", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "dailytrojan.com", "main_image": "http://dailytrojan.com/wp-content/uploads/2015/10/web-sark3.jpg", "site_section": "http://dailytrojan.com/category/sports//feed/", "section_title": "Daily Trojan » Sports", "url": "http://dailytrojan.com/2015/10/11/sarkisian-not-good-enough-for-usc/", "country": "US", "title": "Sarkisian not good enough for USC", "performance_score": 0, "site": "dailytrojan.com", "participants_count": 1, "title_full": "Sarkisian not good enough for USC", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T02:33:00.000+03:00", "replies_count": 0, "uuid": "07d10eefc0a5fda83589265fbd5b09cb3dbd2b74"}, "author": "Daily Trojan Staff", "url": "http://dailytrojan.com/2015/10/11/sarkisian-not-good-enough-for-usc/", "ord_in_thread": 0, "title": "Sarkisian not good enough for USC", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "0 Comments / in Columns , Sports \nIf the USC football program wants to win national championships, then Steve Sarkisian cannot be the head coach. I originally wrote this column before the news broke that Sark is taking a forced leave of absence, but the fact that he is further substantiates the fact that he should not be on the sidelines representing USC at any more games. \nIt’s tough to call for someone’s job, especially a guy like Sark who seems to be well-liked and appreciated by his players and staff. There also seem to be elements at play that are much greater and more important than football. If Sark is dealing with issues, I hope he gets the help he needs and is able to get his life back on track. \nUnfortunately as callous as it is to say, dealing with off-the-field issues as a head coach is not conducive to success. Additionally, being nice and fun aren’t exactly the requisite traits one looks for in a potentially dynastic head, coach. This team, like last years, is undisciplined and unfocused, which is most likely a direct manifestation of the coaching staff’s lackadaisical approach to certain facets of the game. \nThe way Sark coached the Washington game combined with his leave of absence serves as an affirmation of his inability to steward the Trojans’ program back toward relevancy and greatness. \nMany things in college football are complex. There are nuances and subtleties to amateurism, student athlete compensation and the widening schism between ground and pound football and aerial spread attacks. One of the few black-and-white issues that remains in college football is winning, and what it takes to have a stalwart program. There are no shades of gray when it comes to victories; a team needs a championship caliber coach. At this point, it is abundantly clear that Sark just doesn’t fit that model. \nThe best coaches are widely revered CEO-type figures on the weekdays and shrewd tacticians on gameday. Sark is unfortunately neither. It’d be one thing if he embarrassed USC with his drunken antics, and then put together blowout victories on a weekly basis. Instead, outside of recruiting, the only time USC makes the news under Sark is from an upset loss or a scandal that has nothing to do with the on-the-field product. That is simply unacceptable. \nThe fact that the same players are committing the same penalties and making the same mistakes against Washington that that they made against Arkansas State is mind boggling and inexcusable. A top-flight coaching staff addresses and corrects these mistakes, or finds players who are intelligent and disciplined enough to not commit drive- and game- killing penalties. Instead, Sark and co. have let these continue unabated, occasionally blowing up on the sideline at the most egregious of all fouls. \nThe issue with penalties isn’t what ails the Trojans. It is just a symptom of the more pervasive problem with the program: the fact that the team lacks an elite leader. Again, these conclusions don’t just come from the Washington game, as woeful as that may have been. One could, and many have, fill up entire columns chronicling the ineptitude that took place at the Coliseum on Thursday night. \nIt’s more than just those things. Not blitzing the life out of a true freshman QB starting on the road, forcing passes to the sidelines, refusing to just run the ball when it worked so well are all decisions that are emblematic of a coaching staff that shouldn’t be at the helm of any team with championship aspirations. \nMany Sark apologists will point to sanctions or his admittedly tremendous recruiting talents as reasons for him to stay. However, sanctions aren’t the reason Sark gets outcoached four or five times per year. As for recruiting, USC recruits USC. Lane Kiffin, Pete Carroll and even Paul Hackett, who brought in both Matt Leinart and Carson Palmer, attracted great talent. It doesn’t matter how many five-star recruits you get to commit if you can’t beat inferior talent because of poor coaching. \nMy hope was that Sark’s recruiting prowess would compensate for his inadequacies as an actual head coach. Apparently, I was misguided in this hope. I expected the team to lose when they faced off against equally talented teams, due to a coaching disadvantage. What I didn’t foresee was USC also losing to teams that they should beat by four touchdowns. Every team has letdowns, but Saban and Meyer limit those to once or twice a year and still sometimes find a way to win. Sark’s teams have letdowns every other week it seems. \nOne of the most striking comments from Sark on Thursday was that fans needed to get used to close games in the deep and talented Pac-12. I think I speak for most reasonable fans when I say that we would all be fine with close games, if we won them more than we lost. Outside of Stanford’s woeful performance and the Arizona kicker’s missed chip shot field goal last season, USC hasn’t won a close game against a quality opponent under Sark. It’s the height of insanity to basically tell fans to expect some losses, when Sark has the resources and talent he has at his disposal. \nUSC needs a coach who wins these close games, but also who combines USC’s significant talent advantage with his own significant abilities to once again be a prominent national contender, not a preseason prediction that fell by the wayside. \nNot all of the blame lies with Sark however. Some of it lies with Athletic Director Pat Haden as well. While he has certainly cleaned up the Athletic Department and made strides in other sports, football and basketball have underperformed under his tenure. It’s great to win championships in water polo and have a high APR, but fans, and the boosters who fund a lot of these programs, care about only one percentage and that is how many wins vs. how many losses the Trojan football team has. \nTrojan fans expect excellence, and Sark isn’t excellent. It may only be a year and a half into his tenure, but at this point he is a sunk cost. A clean break from Sark is what the Trojan football program needs in order to be relevant again. They should be in the news for winning games and not for the possibility that the team is led by a coach battling substance abuse issues. \nThere is nothing I want more than to be proven wrong about this. If Sark is able to get healthy and turn his life around, and then somehow lead the Trojans back into the upper echelon of college football programs, I will be the first to congratulate him and cheer him on. Most USC fans and supporters just want what is best for Sark as a human being and for the program; there is no other agenda. \nUnfortunately, that seems like a pipe dream at this point. Sark just does not seem to be the guy to transform the Trojans back into a championship contender, more likely, he is the guy who will keep them mired in mediocrity. With the leave of absence, it might take a while to find out, if ever, but hopefully this disastrous situation ends well for both Sark and the USC program. Sometimes relationships don’t work out, and I hope someone in charge can be mature and rational and end this ill-fated hire before the USC program is irreparably damaged. \nJake Davidson is a junior majoring in accounting. His column, “Davidson’s Direction,” runs Mondays. Share this entry", "external_links": [], "published": "2015-10-12T02:33:00.000+03:00", "crawled": "2015-10-12T17:11:30.524+03:00", "highlightTitle": ""}