{"organizations": [], "uuid": "5d5976eaa7dbc9af82784ab36b2d3ac5d585f3ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.commercialappeal.com", "main_image": "", "site_section": "http://www.commercialappeal.com/sports/index.rss", "section_title": "Sports", "url": "http://www.commercialappeal.com/sports/grizzlies-notes-nba-tv-to-televise-griz-camp-friday-210c9696-53e6-09e0-e053-0100007f23b1-330350431.html", "country": "US", "title": "Grizzlies Notes: NBA TV to televise Griz camp Friday", "performance_score": 0, "site": "commercialappeal.com", "participants_count": 1, "title_full": "Grizzlies Notes: NBA TV to televise Griz camp Friday", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T05:31:00.000+03:00", "replies_count": 0, "uuid": "5d5976eaa7dbc9af82784ab36b2d3ac5d585f3ce"}, "author": "Ronald Tillery", "url": "http://www.commercialappeal.com/sports/grizzlies-notes-nba-tv-to-televise-griz-camp-friday-210c9696-53e6-09e0-e053-0100007f23b1-330350431.html", "ord_in_thread": 0, "title": "Grizzlies Notes: NBA TV to televise Griz camp Friday", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SANTA BARBARA, Calif. — NBA TV's weeklong NBA Real Training Camp series lands here Friday afternoon to showcase the Grizzlies' practice session from 3-5 p.m. CST.\nThe Griz have conducted four training camp workouts since arriving on the campus of the University of California, Santa Barbara. They practiced once for nearly three hours Thursday after conducting two workouts on Wednesday.\nGriz coach Dave Joerger doesn't have any more two-a-day practices planned and acknowledged that the NBA TV look-in will be a bit toned down.\n\"We'll get some work done,\" Joerger said. \"You don't show any of your real stuff. You just go about your business as usual.\"\nThe Real Training Camp series began airing Tuesday with the Minnesota Timberwolves. The Milwaukee Bucks were shown on Wednesday, and NBA TV peeped into the Cleveland Cavaliers' practice Thursday.\nThe Grizzlies' edition of the show will include interviews with players, coaches and front-office personnel. Jared Greenberg will host the program with NBA Hall of Famer Reggie Miller.\nThe show also can be seen live on NBA.com.\nConley comfortable with mask\nWhen the Grizzlies are going through non-contact drills at training camp, point guard Mike Conley's face is bare. He slaps on a mask for live game action, and that's how he plans to operate this season.\nConley healed fine from the facial fractures he suffered in the playoffs last April, but he'll continue to wear the clear mask.\n\"I feel more comfortable with it on whenever I'm playing because I already know I get hit in my face all the time,\" Conley said earlier this week as the Griz began training camp. \"I'm a little dude, so I'm around elbows and stuff all the time.\"\nConley needed two metal plates inserted surgically to repair broken bones around his left eye after he received an inadvertent elbow from Portland's C.J. McCollum during their first-round playoff series.\nDoctors declared Conley was completely healed in June.\nGriz announce FedExForum security changes\nMetal detectors have been installed at all entrances to FedExForum, and will be standard practice for entering guests starting with the Grizzlies' first preseason game Tuesday against the Houston Rockets.\nThe new security measure, mandated by the NBA, will remain a standard operating procedure at all Griz games, including the entire preseason and postseason, and at all NBA arenas.\nThe walk-through metal detectors will enhance security and replace hand-held devices as the primary tool at FedExForum. Fans are encouraged to arrive at all Griz games early to avoid any delays entering FedExForum.", "external_links": [], "published": "2015-10-02T05:31:00.000+03:00", "crawled": "2015-10-02T06:32:35.155+03:00", "highlightTitle": ""}