{"organizations": [], "uuid": "28b26eb3c30dc738ced0fa8993d924a04bfedb12", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "cjonline.com", "main_image": "http://cjonline.com/sites/default/files/images/sms-default-facebook-share.png", "site_section": "http://cjonline.com/taxonomy/term/2/feed", "section_title": "Sports", "url": "http://cjonline.com/sports/2015-10-10/kevin-haskin-ranked-teams-leave-kansas-two-varying-wins", "country": "US", "title": "Kevin Haskin: Ranked teams leave Kansas with two varying wins", "performance_score": 0, "site": "cjonline.com", "participants_count": 1, "title_full": "Kevin Haskin: Ranked teams leave Kansas with two varying wins", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T06:29:00.000+03:00", "replies_count": 0, "uuid": "28b26eb3c30dc738ced0fa8993d924a04bfedb12"}, "author": "Kevin Haskin", "url": "http://cjonline.com/sports/2015-10-10/kevin-haskin-ranked-teams-leave-kansas-two-varying-wins", "ord_in_thread": 0, "title": "Kevin Haskin: Ranked teams leave Kansas with two varying wins", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Kevin Haskin kevin.haskin@cjonline.com \nMANHATTAN — Television programmers got it right on the start times for the major-college football staged Saturday in the state of Kansas. \nWith visitors ranked No. 2 and 3 nationally, slotting was important, yet simple, for Fox Sports. \nThe day game — a dull, predictable mismatch — was something virtually no one wanted to see. On television. In person. Didn’t matter. No. 3 Baylor drubbed Kansas 66-7 in Memorial Stadium. \nThe nightcap — an entertaining, unpredictable shootout — was something people who were not in attendance may claim to have seen. But then, the television production, with Big Fox on the call, was a pretty good alternative. Kansas State gave No. 2 TCU fits, even led by 18 points at halftime, before falling 52-45 in Snyder Family Stadium. \nWith all that, expect little change at the top of the polls. Unless Baylor jumps TCU. \nNot sure that should happen, though. \nThe Frogs proved resilient enough to win in a tough atmosphere. Quarterback Trevone Boykin looked to be flubbing any shot at the Heisman Trophy, but then took off for a 69-yard touchdown to put TCU up 45-42 (after a two-point conversion pass) with 6:07 left. Later he added a decisive 55-yard TD throw. \nTCU also happened to capitalize on some weird play-calling from K-State. \nThe Cats seemed intent down the wire to have Joe Hubener throw it, even though the junior quarterback enjoyed a 111-yard rushing effort, with four TDs on the ground. \nBut then, TCU had some puzzling calls, too. It scored on the first play from scrimmage. On an 84-yard rush from Aaron Green. Then the Frogs ran just three more times in the first half. \nThat reflected the totality of K-State’s response. The Cats used 28 second-quarter points to grab a halftime bulge. Capitalized on nine turnovers, three of them pass interference calls against the same defender, Corry O’Meally. \nFor the Horned Frogs, it was beginning to seem as if Bill Snyder had soured the Big 12 punch bowl. For the sellout crowd, he was a man deserving of naming rights on stadiums, highways, mentoring programs and just about any building K-State wants to unveil as part of an initiative trumpeted Friday by its university president. \nThen the Cats lost grip of their command, in part because of its unwillingness to do what it does so well — milk clock. \nThey battled. Even tied it after surrendering the lead. Jack Cantele achieved that with a 37-yard field goal. \nStill, 1:47 remained, making the choice to kick for the tie, rather than go for the win all the more curious. \nTwo plays later, Boykin connected with his favorite target, Josh Doctson, for the final score. TCU’s elite receiver slipped by the single coverage Jesse Mack, a juco transfer from Highland, attempted to apply. \nThat did it. No more wizardry. No more magic. No more upset bid. Hubener lost a fumble with 53 seconds left to quickly douse any further possibility of an upset. \nTo the contrary, the lack of second-half run calls, which also happen to milk clock, was a baffling end to a game K-State controlled at the break. \nAfter looking so sharp, so sensational after TCU’s early touchdown, the Cats fell to 0-2 in the Big 12, a spot also occupied by, well ... \n* * * * * * \nLAWRENCE — The difficulty of any football recovery on Mount Oread grew obvious, again, during Baylor’s rout of KU. \nThe Jayhawks responded to a quick touchdown by the Bears with a scoring drive Ryan Willis engineered in his first start. The freshman created a nice impression with the darts he threw to move KU downfield, but the Jayhawks never answered again. \nAs for Baylor’s response, it was telling. \nStarters removed their pads before sitting out the second half. \nKU coach David Beaty did not bristle when asked about the steps taken to ensure the inactivity of the Bears’ regulars, who were essentially told to smoke ’em if you got ’em during the second half. \n“Yeah, when the starters are done a lot of times, they'll take their pads off,” Beaty said. “Art is a very unique coach, and I admire him because he doesn't do things the way they've always been done just because they've always been done that way. He's very unique.” \nPlain enough too to instruct his starters to come out sharp. \n“They told us, ‘You’re not going to play much. You need to get your balls early and then you’ll be out of there,’” said wide receiver Corey Coleman, who snagged the first of three touchdown passes thrown by Seth Russell. \nYes, the quarterback who committed to former KU coach Turner Gill. When Beaty was on the Jayhawks staff. While recruiting, Beaty visited Russell’s home. It was in the same neighborhood in Garland, Texas, where Beaty was raised. \nCharlie Weis dumped Russell as a recruit. Now, Russell quarterbacks the No. 3 team in the land. \n“You look around and wonder what it would be like to play here,” Russell admitted. “It crossed my mind just very quickly, then I got my mind back in the game.” \nHis arm and legs, too. Russell engineered a 52-7 halftime lead, but the Bears’ conservative approach in the second half led to just two more touchdowns and preserved a couple of all-time records for opponents against KU — 71 points by Oklahoma in 1987 and 799 yards by Nebraska in 1979. \nHardly a moral victory ... something the Jayhawks seem destined to settle for in Beaty’s first season. \nKevin Haskin can be reached at (785) 295-1159 or kevin.haskin@cjonline.com .", "external_links": [], "published": "2015-10-11T06:29:00.000+03:00", "crawled": "2015-10-11T07:51:42.288+03:00", "highlightTitle": ""}