{"organizations": ["News Tribune Seahawks", "NFL.com", "Outbrain AR", "Lions", "NFL", "Panthers", "News Tribune", "Carolina", "Hawks", "Marshawn Lynch", "NFL Media", "ESPN.com", "Atlanta Falcons", "Seattle", "USC", "Bengals", "Seattle Times", "Seahawks"], "uuid": "165ceea52c1ad935fcb863801e7b5c46f1d0db9e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattlepi.com", "main_image": "http://ww4.hdnux.com/photos/41/50/51/8817243/4/rawImage.png", "site_section": "http://www.seattlepi.com/sports/collectionRss/Sports-Slidepro-9235.php", "section_title": "Sports Slidepro", "url": "http://www.seattlepi.com/sports/football/slideshow/What-people-are-saying-Panthers-top-Hawks-118963.php", "country": "US", "title": "What people are saying: Panthers top Hawks", "performance_score": 0, "site": "seattlepi.com", "participants_count": 0, "title_full": "What people are saying: Panthers top Hawks", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T00:46:00.000+03:00", "replies_count": 0, "uuid": "165ceea52c1ad935fcb863801e7b5c46f1d0db9e"}, "author": "", "url": "http://www.seattlepi.com/sports/football/slideshow/What-people-are-saying-Panthers-top-Hawks-118963.php", "ord_in_thread": 0, "title": "What people are saying: Panthers top Hawks", "locations": ["Cincinnati", "Seattle", "seattlepi.com", "Carolina", "Tacoma"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Dave Boling", "Greg Olsen", "Matt Calkins", "Newton", "Cam Newton", "Earl", "Quinn", "Danny Kelly", "Kelly", "Brian", "Jayson Jenks", "Kam Chancellor", "Jerricho Cotchery", "Jimmy Graham", "Dan Quinn", "Devin Funchess", "Doug Farrar", "Rosenthal", "Monson", "Sheil Kapadia", "Marshawn Lynch", "ARI LILJENWALL", "Graham", "Brian Beverluis", "Kevin Pierre-Louis", "Brady Henderson", "Boling", "Richard Sherman", "Bell", "Adam Schein", "Cam", "Gregg Rosenthal", "Russell Wilson", "Steven Hauschka", "Beverluis", "Olsen", "Sam Monson", "Pete Carroll", "Wilson", "Andy Dalton", "Cowboys", "Gregg Bell", "Calkins", "Farrar", "Carroll", "Roman Harper", "Kapadia", "Jenks", "Earl Thomas", "Schein"], "text": "What people are saying: Panthers top Hawks By By ARI LILJENWALL on October 19, 2015 2:46 PM Image 1 of / 13 Close Image 1 of 13 NFL Media columnist Adam Schein said that while Seattle's opponents deserve their share of credit for putting together their big comebacks, the Seahawks still must shoulder the blame for their inablity to execute while they're ahead.\"You credit Cam and the Panthers like you credited Andy Dalton and the Bengals in Week 5. These kinds of wins demand credit. But it's fair to criticize the loser, too,\" Schein wrote.\"Remember when nobody could pass on the \"Legion of Boom,\" when Seattle had the best defense in the NFL, bar none? \"Over the last two weeks, the unit has given up 30 fourth-quarter points. Andy Dalton's had an earned rep for not playing big in big games. He carved up Seattle when it mattered two Sundays ago. This past Sunday, Newton did whatever he wanted, throwing to the likes of rookie Devin Funchess and well-traveled veteran Jerricho Cotchery. Newton was 12 for 15 for 162 yards in the fourth quarter.\" NFL Media columnist Adam Schein said that while Seattle's opponents deserve their share of credit for putting together their big comebacks, the Seahawks still must shoulder the blame for their inablity to ... more NFL Media columnist Adam Schein said that while Seattle's... Photo-8817243.118963   13 A great deal of the Week 6 postgame analysis centered around Cam Newton's game-winning touchdown pass to Greg Olsen in the final minute.After the game, members of the Seattle secondary admitted that there was a miscommunication and that they ended up running two different coverages, allowing Olsen to slip behind them virtually uncontested. Danny Kelly of FieldGulls delved into the specifics.\"The Seahawks' eleven defenders were in two different coverage calls, meaning assignments were completely screwed up,\" Kelly wrote. \"Richard Sherman and Kevin Pierre-Louis handed Olsen off to Earl Thomas, believing that Earl had the deep half to their side in a classic Cover-2 scheme; instead, Earl was in Cover-3, where he's responsible for post and seam routes, and didn't get wide enough quickly enough to cover Olsen, who ran up the numbers (in between a seam route and a sideline route).\" A great deal of the Week 6 postgame analysis centered around Cam Newton's game-winning touchdown pass to Greg Olsen in the final minute. After the game, members of the Seattle secondary admitted that there ... more A great deal of the Week 6 postgame analysis centered around Cam... Photo-8817246.118963   13 Over at ESPN.com, Seahawks beat writer Sheil Kapadia said that Seattle's problems may run deeper than simply finishing games.Wrote Kapadia: \"The Seahawks insist the sky is not falling. They could beat the 49ers and Cowboys, enter the bye 4-4 and still be in the mix for a playoff spot. But it's just as possible this defense is not as good as it has been the previous two seasons and the offense's search for identity will continue into December.With a loss Thursday to the 49ers, the Seahawks would be in last place in the NFC West.\" Over at ESPN.com, Seahawks beat writer Sheil Kapadia said that Seattle's problems may run deeper than simply finishing games. Wrote Kapadia: \"The Seahawks insist the sky is not falling. They could beat the ... more Over at ESPN.com, Seahawks beat writer Sheil Kapadia said that... Photo-8817247.118963   13 The Seattle Times' Jayson Jenks noted the contrast between Seattle's finishing woes this season and the Seahawks teams of past years that prided themselves on being able to close out their opponents.Wrote Jenks: \"It stands at odds with what the Seahawks have been about offensively. They prided themselves on being a team that could run the ball and wear teams out, and usually they could. But on their final two drives with the lead against Carolina, the Seahawks ran the ball twice for 5 yards (both carries by Marshawn Lynch) and dropped back to pass four times.\" The Seattle Times' Jayson Jenks noted the contrast between Seattle's finishing woes this season and the Seahawks teams of past years that prided themselves on being able to close out their opponents. The Seattle Times' Jayson Jenks noted the contrast between... Photo-8817250.118963   13 Seattle Times columnist Matt Calkins got in on the act with a critical take, suggesting that the 2-4 start is evidence that the Seahawks are simply not as good as they have been the last couple of seasons.\"After Seattle’s 27-23 loss to Carolina on Sunday, a few press-box wags were saying that the Seahawks could easily be 5-1 given their late-game slips vs. the Rams, Bengals and Panthers,\" Calkins wrote. \"What they failed to mention was that they could also be 1-5 if not for Kam Chancellor’s last-second strip against the Lions. The truth is, aside from that Monday-night miracle, Seattle’s signature playmaking simply hasn’t been there this year. And the players are well aware.\" Seattle Times columnist Matt Calkins got in on the act with a critical take, suggesting that the 2-4 start is evidence that the Seahawks are simply not as good as they have been the last couple of ... more Seattle Times columnist Matt Calkins got in on the act with a... Photo-8817248.118963   13 Sports Illustrated's Doug Farrar questioned the notion that the Seahawks are merely a few tweaks from correcting their recent issues, saying that the evidence suggests that the recent results may be reflective of Seattle's true identity.\"Good teams don’t waste opportunities,\" Farrar wrote. \"Good teams don’t let themselves get suckered out of wins over and over again. Good teams stay relaxed and understand that winning football is a play-to-play exercise. Good teams don’t continually insist that they’re playing well when they’re not, which is perhaps Seattle’s primary flaw right now. There appears to be a continued belief among the Seahawks that they are just a few tweaks away from turning it around, no matter how much evidence to the contrary.\" Sports Illustrated's Doug Farrar questioned the notion that the Seahawks are merely a few tweaks from correcting their recent issues, saying that the evidence suggests that the recent results may be ... more Sports Illustrated's Doug Farrar questioned the notion that... Photo-8817251.118963 - seattlepi.com Image 7 of 13 Brady Henderson of 710 ESPN Seattle went over the highlights of 710's Monday interview with Pete Carroll in which Carroll pointed out the rarity of having his team win the turnover battle and still managing to lose the game -- a dubious occurrence that has already happened to the Seahawks three times this season.\"Just like last week, Carroll was at a loss to explain how the Seahawks could lose another game in which they won the turnover battle. That was the case against Cincinnati and again on Sunday as Seattle picked off two Carolina passes and didn't turn the ball over on offense. Winning the turnover battle has been a formula for success for Carroll's teams dating back to his days at USC. The Seahawks were 33-6 from 2010-2014 when finishing ahead in turnover differential, but they're 0-3 in such games this season. Carroll said he 'can't fathom' how that could continue to be the case: 'This turnover thing is crazy. This goes so far against all of our numbers and our statistics and all of that.'\" Brady Henderson of 710 ESPN Seattle went over the highlights of 710's Monday interview with Pete Carroll in which Carroll pointed out the rarity of having his team win the turnover battle and still managing ... more Brady Henderson of 710 ESPN Seattle went over the highlights of... Photo-8817254.118963 - seattlepi.com Image 8 of 13 Sam Monson of ProFootballFocus attempted to explain the reason Seattle's defense has given up so many big plays this year compared to past years, saying that the loss of defensive coordinator Dan Quinn (now the head coach of the Atlanta Falcons) may be contributing to the communication issues.Wrote Monson: \"This type of coverage bust happens, and sometimes they happen at the worst possible times, but the data shows they have happened significantly more for the Seahawks this season through six games than they did a year ago. Perhaps Quinn’s exit has caused a fraying around the edges of a unit that was previously so well-organized. Whatever the reason, the 2-4 Seahawks need to get it under control before it costs them too many games.\" Sam Monson of ProFootballFocus attempted to explain the reason Seattle's defense has given up so many big plays this year compared to past years, saying that the loss of defensive coordinator Dan Quinn (now ... more Sam Monson of ProFootballFocus attempted to explain the reason... Photo-8817255.118963 - seattlepi.com Image 9 of 13 NFL.com's Gregg Rosenthal had one of the more optimistic takes on Seattle's current situation, saying that there is still plenty to build on despite the 2-4 start, particularly on offense.\"At 2-4, the Seahawks have some serious ground to make up, but they have a lot to build off offensively from this game,\" Rosenthal wrote. \"Marshawn Lynch looked like his old despite only rushing for 54 yards, and Jimmy Graham easily had his best day in Seattle, showing off all his athleticism for 140 yards and a score. Note to Panthers: Stop trying to cover Graham with Roman Harper.\" NFL.com's Gregg Rosenthal had one of the more optimistic takes on Seattle's current situation, saying that there is still plenty to build on despite the 2-4 start, particularly on offense. \"At 2-4, the ... more NFL.com's Gregg Rosenthal had one of the more optimistic takes... Photo-8817299.118963 - seattlepi.com Image 10 of 13 The (Tacoma) News Tribune columnist Dave Boling says that Sunday's loss should bring up questions about the team's identity and why they have been unable to replicate their past dominance so far in 2015.\"Another squandered lead led to a 27-23 loss to the Panthers at CenturyLink Field on Sunday, dropping the Seahawks to 2-4 and forcing a serious reevaluation of who this team is,\" Boling wrote. \"Searching for the answer to 'why?' I recalled the best description of what the team used to be. It came from cornerback Richard Sherman, who used to say that the Seahawks played like a bunch of 'raggedy dogs.'He said that throwing the ball against the Hawks was like tossing out fresh meat to a pack of wolves.The Seahawks still make plays; they still have tons of talent. But at the end, do we see that kind of rabid intensity, that sense of urgency, that slobbering aggressiveness of a pack of feral hounds? Not lately.\" The (Tacoma) News Tribune columnist Dave Boling says that Sunday's loss should bring up questions about the team's identity and why they have been unable to replicate their past dominance so far in ... more The (Tacoma) News Tribune columnist Dave Boling says that... Photo-8817261.118963 - seattlepi.com Image 11 of 13 On the Panthers side of things, CatScratchReader's Brian Beverluis put the Carolina victory into context, saying that the comeback win was a necessary morale boost for a team that had struggled against Seattle in recent years.\"It was pretty clear that this game was different and not just for the Panthers,\" Beverluis wrote. \"These two teams don't like each other and it turned into a slug fest with lots of emotions boiling over. But instead of creating dumb penalties (like the 2013 team did in the playoffs) they hung in there and rallied back. This was an important game, to the fans and the locker room.\" On the Panthers side of things, CatScratchReader's Brian Beverluis put the Carolina victory into context, saying that the comeback win was a necessary morale boost for a team that had struggled against ... more On the Panthers side of things, CatScratchReader's Brian... Photo-8817263.118963 - seattlepi.com Image 12 of 13 The (Tacoma) News Tribune Seahawks beat writer Gregg Bell took a look at the impact of tight end Jimmy Graham, who exploded for 140 yards on Sunday after having his role in the Seattle offense questioned through the first five weeks of the season. Bell says Graham's improved feel for reading Russell Wilson's scrambling and improvising was instrumental in the breakout performance.\"Mostly, it was good by Graham to read what his quarterback needed,\" Bell wrote. \"His best catches Sunday came after he broke off his called route and ran to new spots during Russell Wilson’s improvisational scrambles. Graham’s 45-yard catch in the fourth quarter, which set up Steven Hauschka’s field goal for a Seattle 23-14 lead, came after Wilson scrambled right and pointed. Graham dutifully turned his short out route into a long sprint down the right sideline behind the defense. He made the same in-play adjustment for a 25-yard gain in the second quarter. That got Seattle into the red zone for Marshawn Lynch’s 1-yard touchdown run.\" The (Tacoma) News Tribune Seahawks beat writer Gregg Bell took a look at the impact of tight end Jimmy Graham, who exploded for 140 yards on Sunday after having his role in the Seattle offense questioned ... more The (Tacoma) News Tribune Seahawks beat writer Gregg Bell took a... Photo-8817264.118963 - seattlepi.com Image 13 of 13 Outbrain AR 6 Item-38490.118963 - seattlepi.com What people are saying: Panthers top Hawks 1 / 13", "external_links": [], "published": "2015-10-20T00:46:00.000+03:00", "crawled": "2015-10-20T02:41:20.616+03:00", "highlightTitle": ""}