{"organizations": [], "uuid": "e3011e41987d0cae24d5781367596ff4a824f00a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dnainfo.com", "main_image": "http://assets.dnainfo.com/generated/photo/2015/10/mikal-rishad-1445440509.jpg/extralarge.jpg", "site_section": "http://www.dnainfo.com/new-york/topics/sports.rss", "section_title": "Sports Top Stories on DNAINFO.com - Thursday, October 22, 2015 | 12:29pm", "url": "http://www.dnainfo.com/new-york/20151022/flushing/meet-men-women-who-keep-citi-field-running", "country": "US", "title": "Meet the Men and Women Who Keep Citi Field Running", "performance_score": 0, "site": "dnainfo.com", "participants_count": 0, "title_full": "Meet the Men and Women Who Keep Citi Field Running", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T19:21:00.000+03:00", "replies_count": 0, "uuid": "e3011e41987d0cae24d5781367596ff4a824f00a"}, "author": "", "url": "http://www.dnainfo.com/new-york/20151022/flushing/meet-men-women-who-keep-citi-field-running", "ord_in_thread": 0, "title": "Meet the Men and Women Who Keep Citi Field Running", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Nicole Levy"], "text": "Meet the Men and Women Who Keep Citi Field Running By Nicole Levy | October 22, 2015 12:21pm View Full Caption Instagram/@queenscapes \nWhen the Mets play games three, four and five of the World Series at Citi Field, you're bound to hear cheers of \"Thor!\" and \"D -da!\" and \"MVP!\" \nIt's the players who are swimming in well-deserved praise after sweeping the Cubs in this year's four-game National League Championship Series and clinching their first pennant in 15 years. But what about the men and women working behind the scenes, serving hot dogs at the stands, ushering fans into their seats, and selling gear at the shops? \n\"If you think about it, there is a direct correlation between the Mets' success and what they’re doing, because they’re part of the team,\" said street photographer and Queens Village resident Steve Vazquez, whose Instagram account Queenscapes features portraits of Citi Field employees. \nA \"die-hard Mets fan\" since the age of 10, Vazquez, now 35, began posting the photos and corresponding captions a week ago as a tribute to the men and women who make up the team's invisible foundation. \nThe images on his account are, he said, \"pintpointing and congratulating and thanking the people who work [at the stadium], because it’s not just about David Wright and the players. It’s about these people that day in and day out help provide and should be involved in the success of the Mets.\" \nLike chef Mikal Rishad of Jamaica: A photo posted by Adolfo Steve Vazquez (@queenscapes) on Oct 13, 2015 at 4:23pm PDT \nVazquez's behind-the-scenes look at Citi Field and its staff extends his #CapturedInQueens series, an effort to document the diversity of people living in and visiting the borough. The freelance photographer and limo dispatcher credits the idea of turning his lens toward the stadium's workforce to Times-Ledger photo editor Michael Shain. \nSaid Vazquez of his project, “This is about me showing my appreciation\" as a Mets fan. If the team clinches the playoffs, he plans on returning to Citi Field to snap and post more pictures, the captions of which conclude with a \"thank you: For courage. For honesty. For labor. For joy.\" A photo posted by Adolfo Steve Vazquez (@queenscapes) on Oct 6, 2015 at 6:45pm PDT \nA photo posted by Adolfo Steve Vazquez (@queenscapes) on Oct 7, 2015 at 4:36pm PDT", "external_links": [], "published": "2015-10-22T19:21:00.000+03:00", "crawled": "2015-10-22T19:34:04.172+03:00", "highlightTitle": ""}