{"organizations": [], "uuid": "1cbf54bbde4a9216e531293610558cf268b7b9a8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wcax.com", "main_image": "", "site_section": "http://www.wcax.com/category/13537/business-news", "section_title": "Business &amp; economy news - WCAX.COM Local Vermont News, Weather and Sports-", "url": "http://www.wcax.com/story/30158006/china-manufacturing-index-improves-slightly-services-wobble", "country": "US", "title": "China manufacturing index improves slightly, services wobble", "performance_score": 0, "site": "wcax.com", "participants_count": 1, "title_full": "China manufacturing index improves slightly, services wobble - WCAX.COM Local Vermont News, Weather and Sports-", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "1cbf54bbde4a9216e531293610558cf268b7b9a8"}, "author": "wcax.com", "url": "http://www.wcax.com/story/30158006/china-manufacturing-index-improves-slightly-services-wobble", "ord_in_thread": 0, "title": "China manufacturing index improves slightly, services wobble", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING (AP) - Chinese manufacturing activity improved slightly in September while growth in service industries slowed due to disruptions from a massive military parade, surveys showed Thursday.\nAn official manufacturing index based on a survey of factory purchasing managers edged up to 49.8 in September from August's 49.7, which was the lowest level since August 2012. In July, it was 50.0.\nThe index, compiled by the Chinese Federation for Logistics and Purchasing, is based on a 100-point scale on which numbers above 50 indicate expansion.\nManufacturing may have been weighed down by temporary factory closures and a two-day national holiday for a military parade in Beijing in early September. Manufacturing, however, also faces ongoing downward pressure from weak foreign demand and official efforts to make consumption a bigger part of the Chinese economy.\nChina's economic growth held steady at 7 percent in the latest quarter ending in June, which was the weakest performance since the 2008 global crisis. Officials hope to maintain the growth rate for the rest of the year but many economists doubt the target will be met.\nA separate manufacturing index compiled by financial magazine Caixin and Markit fell to 47.2 in September from 47.3 in August. The figure is better than the preliminary result of 47.0 released on Sept. 23.\nCaixin's survey focuses on smaller, private enterprises while the federation's survey is weighted toward larger, state-owned companies in China's manufacturing industry, which employs tens of millions.\nCaixin's services index fell to a 14-month low of 50.5 in September from August's 51.5.\nIn interviews for the survey, some companies said they had lost business in early September because of the massive military parade to mark the 70th anniversary of Japan's World War II surrender, which caused some businesses and roads to close.\nCopyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-10-05T17:34:03.060+03:00", "highlightTitle": ""}