{"organizations": [], "uuid": "e87ae154a828dcd2343583327448a53bbc514839", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.sky.com", "main_image": "http://media.skynews.com/media/images/generated/2015/10/23/425732/default/v2/hamilton-vettel-gossip-3362353-1-1600x900.jpg", "site_section": "http://feeds.skynews.com/feeds/rss/sports.xml", "section_title": "Sports News - Latest Sports and Football News | Sky News", "url": "http://news.sky.com/story/1574761", "country": "IL", "title": "Vettel Penalty Brings Hamilton Title Closer", "performance_score": 0, "site": "sky.com", "participants_count": 0, "title_full": "Vettel Penalty Brings Hamilton Title Closer", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T11:20:00.000+03:00", "replies_count": 0, "uuid": "e87ae154a828dcd2343583327448a53bbc514839"}, "author": "", "url": "http://news.sky.com/story/1574761", "ord_in_thread": 0, "title": "Vettel Penalty Brings Hamilton Title Closer", "locations": ["United States"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sebastian Vettel", "Lewis Hamilton"], "text": "Vettel Penalty Brings Hamilton Title Closer 09:20,   Share by email Lewis Hamilton's chances of wrapping up his third world title at this weekend’s United States GP have been boosted by the news that Sebastian Vettel - his nearest championship rival - will serve a 10-place grid penalty for an engine change. \nHamilton will successfully retain the crown if he wins in Austin and Ferrari driver Vettel finishes third or lower. Vettel is 66 points behind in the standings, with Hamilton's Mercedes team-mate Nico Rosberg a further seven adrift, and there are just 75 points to play for after Sunday's race. \nVettel, however, will start the race no higher than 11th on the grid after the German confirmed on Thursday that his Ferrari will be fitted with its fifth engine of the season - one more than the penalty-free limit, triggering a 10-place grid penalty. \nFerrari team-mate Kimi Raikkonen will also serve a penalty for the introduction of his own fifth engine. \nVettel had unlocked his fourth unit of the season at Monza in early September and Ferrari had been mulling whether or not to introduce their latest updates in Austin. And although the timing of the upgrade will inevitably compromise his chances of prolonging the 2015 title fight beyond Sunday, Vettel believes Ferrari are right to focus on the bigger, longer-term picture. \n\"We will have the hit of 10 places penalty for a new engine at this event,\" Vettel confirmed. \"But it has always been the plan, it's not a big secret and no surprise for us. \n\"This was always the plan for us, to have the strongest engine available at every single point in the season. Our engine guys have done a massive job so this should not be understood as a down side. \n\"If anything, this is a very positive sign because we've been pushing very hard and the guys have managed to make big steps in terms of performance.\" \nSky Sports F1 understands that the revised engine features a narrower engine block for an aerodynamic gain. Ferrari's Monza-spec update, when they spent three tokens improving the internal combustion engine, was deemed to be a success and cut their single-lap deficit to Mercedes in qualifying. \nMercedes were already favourites to claim their 13th win of the season at the Circuit of The Americas even before Ferrari's engine changes were announced, with Hamilton eyeing his fourth win at the US GP. \nVettel has finished second or higher on six occasions this season, but has only started outside the front two rows three times in 15 races. Hamilton, meanwhile, is eyeing his 10th race victory of the year on Sunday. \nThe 30-year-old reckons he is currently performing to the best of his abilities, but is aware there are always fresh challenges around the corner in F1. \n\"The great thing about motor racing is you never perfect winning - and that's probably the same for all the sports,\" Hamilton told Sky Sports News HQ. \n\"The game is always changing and you're always having to adjust and innovate the way in which you do it. I would say I've tweaked my tool to be able to utilise it to the best of my ability. But there's going to be many challenges coming up, shifts and changes, but I feel best prepared now - I'm 30, I'm experienced, I've been racing 22 years - in terms of being able to interpret those changes and handle them the best way I can. \n\"So I'm definitely in the peak shape that I've been for a long time.\" \nHamilton is on the verge of becoming the first of Britain's 10 world champions to successfully defend his title, while a third crown would also tie Sir Jackie Stewart's national record. Promoted Stories", "external_links": [], "published": "2015-10-23T11:20:00.000+03:00", "crawled": "2015-10-23T19:40:26.107+03:00", "highlightTitle": ""}