{"organizations": [], "uuid": "2e7ed3508e78d3d93108bebb2b8c43d85cba64d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/47529300.cms", "site_section": "http://timesofindia.indiatimes.com/sports/TOI-CRI/articlelist/47722085.cms", "section_title": "Top Stories - TOI CRI - Sports - The Times of India", "url": "http://timesofindia.indiatimes.com/sports/toi-cri/top-stories/Ayyappas-six-for-hand-Andhra-3-points-against-Mumbai/articleshow/49217206.cms", "country": "IL", "title": "Ayyappa's six for hand Andhra 3 points against Mumbai", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "Ayyappa's six for hand Andhra 3 points against Mumbai - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T02:56:00.000+03:00", "replies_count": 0, "uuid": "2e7ed3508e78d3d93108bebb2b8c43d85cba64d8"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/sports/toi-cri/top-stories/Ayyappas-six-for-hand-Andhra-3-points-against-Mumbai/articleshow/49217206.cms", "ord_in_thread": 0, "title": "Ayyappa's six for hand Andhra 3 points against Mumbai", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "VIZIANAGARAM: Medium-pacer Bandaru Ayyappa wreaked havoc with the ball to hand Andhra a vital seven runs first innings lead and ensure three crucial points for his side after their opening Group B Ranji Trophy match against Mumbai ended in a draw on Sunday.\nIn reply to Andhra's 244, Mumbai were bowled out for 237 in 91.5 overs in their first innings.\nAyyappa (6/71) turned out to be the tormentor-in--chief for Andhra as he decimated Mumbai's lower-middle order with four wickets today, including the all-important wicket of Siddhesh Lad (86), to add to his Saturday's tally two scalps.\nResuming their first innings at the overnight score of 158 for five, Mumbai's lower middle-order crumbled like of a pack of cards in front of a fiery spell from Ayyappa.\nMumbai could add just 79 runs to their overnight score before being bundled out to hand Andhra the edge.\nFor Mumbai, the onus was on Lad and Abhishek Nayar to take Mumbai to safety but it was not to be as Nayar was run out for 23.\nLad added 23 runs to his last night's score before he became Ayyappa's first victim of the day. Lad faced 163 balls and struck 12 fours and six during his knock.\nThereafter, Ayyappa ran through the Mumbai lower order, picking up the wickets of Dhawal Kulkarni, Shardul Thakur (25) and Balwinder Sandhu to skittle out Mumbai in 91.5 overs.\nAt stumps on the fourth and final day of the match, Andhra made 176 for three in 65 overs with opener Prasanth Kumar (59) hitting a half-century.\nBesides, K S Bharath made 43 and skipper Mohammad Kaif remained unbeaten on 49 when the umpires decided to call off the proceedings.\nVishal Dabholkar (2/26) scalped two wickets for Mumbai in Andhra's second innings.\nWhile Andhra took away three points, Mumbai had to be contend with one point.\nBrief Scores:\nAndra: 244 & 176 for three in 65 overs (Prasanth Kumar 59, Mohammad Kaif 49 not out, K S Bharath 43; Vishal Dabholkar 2/26).\nMumbai 1st innings: 237 all out in 91.5 overs (Siddhesh Lad 86; Bandaru Ayyappa 6/71).\nResult: Match drawn\nPoints: Andhra 3, Mumbai 1. ", "external_links": ["https://play.google.com/store/apps/details?id=com.toi.reader.activities"], "published": "2015-10-05T02:56:00.000+03:00", "crawled": "2015-10-05T13:07:40.314+03:00", "highlightTitle": ""}