{"organizations": [], "uuid": "cead5d80902f4b315a2ea16da7c28bf04d5e6a9a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.sky.com", "main_image": "http://media.skynews.com/media/images/generated/2015/10/16/424402/default/v2/great-britain-womens-team-pursuit-track-world-championships-paris-3266710-1-1600x900.jpg", "site_section": "http://feeds.skynews.com/feeds/rss/sports.xml", "section_title": "Sports News - Latest Sports and Football News | Sky News", "url": "http://news.sky.com/story/1570483", "country": "IL", "title": "Gold For Both GB Teams In Paris Pursuit Event", "performance_score": 0, "site": "sky.com", "participants_count": 0, "title_full": "Gold For Both GB Teams In Paris Pursuit Event", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T07:43:00.000+03:00", "replies_count": 0, "uuid": "cead5d80902f4b315a2ea16da7c28bf04d5e6a9a"}, "author": "", "url": "http://news.sky.com/story/1570483", "ord_in_thread": 0, "title": "Gold For Both GB Teams In Paris Pursuit Event", "locations": ["Paris", "UK", "Switzerland", "Great Britain"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Gold For Both GB Teams In Paris Pursuit Event 05:43, UK, Friday 16 October 2015 Share by email Great Britain’s men’s and women’s pursuit teams both won gold in dominant fashion at the European Track Championships in Switzerland. \nThe women's quartet of Laura Trott, Joanna Rowsell Shand, Elinor Barker and Katie Archibald made an electric start to their final and had caught opponents Russia after just 2km of the 4km distance, eventually stopping the clock in 4min 17.010sec. \nThey could well have challenged their previous best time of 4min 16.552sec but lost ground when they had to overtake the Russians on the outside. \nThe men's quartet of Sir Bradley Wiggins, Owain Doull, Andy Tennant and Jon Dibben also made a flying start to their final and had all but sewn up gold when they pulled 2.6 seconds clear by the halfway mark. \nOpponents Switzerland began closing the gap in the final 1km but Britain never looked like relinquishing their lead and eventually stopped the clock in 3min 55.243sec. \nWiggins told Eurosport: \"That was classic team pursuiting there against a nation that has pushed us in every round. Until the end there, the last few laps, it wasn't in the bag and we had to fight and that is the spectacle of the team pursuit. I just love it. \n\"I'm not getting any younger, I'm 35 now, so I want concentrate on the team pursuit and earn my place in the Olympics. With these guys now, don't underestimate how good they are. I'm like an old boxer coming back to the ring. You don't want to get knocked down.\" \nEarlier in the day, Britain's men and women were both knocked out of the team sprint in the qualifying round. \nThe men's trio of Philip Hindes, Jason Kenny and Lewis Oliva could only qualify fifth fastest, less than one tenth of a second outside of the top-four place they needed to reach the medal finals. \nBritain's women's pair of Jess Varnish and Katy Marchant suffered an almost identical fate, finishing less than one tenth of a second outside of the top four in fifth. Promoted Stories", "external_links": [], "published": "2015-10-16T07:43:00.000+03:00", "crawled": "2015-10-16T08:50:36.739+03:00", "highlightTitle": ""}