{"organizations": [], "uuid": "ca3a795c6f26b580421d2850356b524c393dab6a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ajc.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/21/0f/d0/faro6.jpg", "site_section": "http://www.ajc.com/", "section_title": "AJC.com: Atlanta News, Sports, Atlanta Weather, Business News | www.ajc.com", "url": "http://www.ajc.com/news/news/national/refrigeration-unit-found-bahamas-el-faro/nn72r/", "country": "US", "title": "Refrigeration unit found in the Bahamas matches tracking...", "performance_score": 0, "site": "ajc.com", "participants_count": 1, "title_full": "Refrigeration unit found in the Bahamas matches tracking... | www.ajc.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T13:12:00.000+03:00", "replies_count": 0, "uuid": "ca3a795c6f26b580421d2850356b524c393dab6a"}, "author": "Phil Amato", "url": "http://www.ajc.com/news/news/national/refrigeration-unit-found-bahamas-el-faro/nn72r/", "ord_in_thread": 0, "title": "Refrigeration unit found in the Bahamas matches tracking...", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Possible debris from El Faro is starting to wash ashore in the Bahamas, and a refrigeration unit found on the beach there has been confirmed to be from El Faro.\nThe tracking number on the unit, SEG9028902, matches information in Tote Maritime Puerto Rico's customer portal for a container that was on board El Faro.\nAction News Jax has obtained new photos of other items believed to be part of the cargo shipment on El Faro.\nThe ship's last known position was just off Crooked Island and the debris has been washing up on San Salvador.\nAction News Jax’s Phil Amato spoke with a reporter covering this story in the Bahamas.\nDebris, likely part of a container, has been washing up on two islands in the Bahamas as early as Friday, according to a Nassau Guardian newspaper reporter who received pictures of other items washed ashore, including dozens of deodorant containers and body wash.\nBeach-goers also found syringes and other toiletries, as well as tennis shoes, shaving cream and containers filled with a colored liquid.\nReporter Travis Cartwright-Carroll said people told him they discovered the items on San Salvador and Exuma Island.\nGallery: Possible debris from El Faro found in the Bahamas \"Now a lot of residents were reportedly going on the beach and taking whatever items that they found from what we're told,” Cartwright-Carroll said on Wednesday.\nExuma Island is northwest of Crooked Island and San Salvador is northeast of Crooked Island, near where El Faro is believed to have sunk\nUp until Tuesday, no one had been to the islands to verify if any of the items were from El Faro\n\"I reached out to Tote Maritime, which owns the El Faro, and they told me they would make some inquires. The island administrators, I asked them if they were able to reach out to anybody or if anyone contacted them about these items and they said no ... so it sounds like it's just something that people are just becoming aware of,\" Cartwright-Carroll said.\nAnother section of a container also washed ashore along with a jar of yellow capsules. More unusual items were found, as well.\n\"One resident in San Salvador told me that they found a freezer filled with candy bars and chocolate and stuff like that,\" Cartwright-Carroll said.\nA spokesperson for Tote Services, sister company of Tote Maritime, sent Action News Jax a statement that said in part: \"Tote Services is aware of the situation and is working with the relevant authorities to verify that the material is from the El Faro.\"\nNational Transportation Safety Board spokesman Peter C. Knudson released the following statement: \"The NTSB has not received any direct reports of debris from El Faro being recovered in the Bahamas. We would be interested in documenting any debris related to vital systems such as lifesaving equipment.\"\nWe are still awaiting word from the U.S. Navy to see if they are trying to identify the items that washed ashore at both locations.\nThe debris has gotten the attention Lonnie Samuels, whose brother was a crew member on the ship.\nSamuels said he wants answers.\n“We really need closure,” Samuels said.\nHe said his family won’t believe their loved one is gone until there is concrete evidence.\n“All we can do is hope and pray right now,” Samuels said.\nPossible debris from El Faro in the Bahamas\n ", "external_links": ["https://www.facebook.com/CMGNationalNews", "http://www.actionnewsjax.com/gallery/news/local/gallery-possible-debris-el-faro-found-bahamas/gCXgW/", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/275/img/photos/2015/10/21/20/3d/faro8.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/10/21/0f/d0/faro6.jpg"], "published": "2015-10-22T13:12:00.000+03:00", "crawled": "2015-10-23T00:33:02.884+03:00", "highlightTitle": ""}