{"organizations": [], "uuid": "fc10a4ce8085747851f83e2a0e8324023ed86f4f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.winnipegfreepress.com", "main_image": "http://media.winnipegfreepress.com/images/617*432/DBC105302930_high.jpg", "site_section": "http://www.winnipegfreepress.com/rss/?path=/sports", "section_title": "Winnipeg Free Press: Sports", "url": "http://www.winnipegfreepress.com/sports/toronto-manager-john-gibbons-expects-even-matchup-in-playoff-series-with-rangers-331105211.html", "country": "US", "title": "Texas Rangers motivated by underdog role, look to take down Blue Jays", "performance_score": 0, "site": "winnipegfreepress.com", "participants_count": 1, "title_full": "Texas Rangers motivated by underdog role, look to take down Blue Jays - Winnipeg Free Press", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T16:28:00.000+03:00", "replies_count": 0, "uuid": "fc10a4ce8085747851f83e2a0e8324023ed86f4f"}, "author": "Neil Davidson, The Canadian Press", "url": "http://www.winnipegfreepress.com/sports/toronto-manager-john-gibbons-expects-even-matchup-in-playoff-series-with-rangers-331105211.html", "ord_in_thread": 0, "title": "Texas Rangers motivated by underdog role, look to take down Blue Jays", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "TORONTO - The Texas Rangers have arrived in Toronto with a chip on their shoulder.\nBeing overlooked by the bookmakers and others has only served to motivate the AL West champions as they prepare to meet the surging Blue Jays on Thursday in the American League Division Series.\n\nToronto Blue Jays manager John Gibbons, left, and bench coach DeMarlo Hale laugh during a team workout at the Rogers Centre in Toronto on Tuesday, October 6, 2015. The Blue Jays start the American League Division Series against the Texas Rangers in Toronto on Thursday. THE CANADIAN PRESS/Darren Calabrese \nTexas manager Jeff Bannister says there are plenty of emotions in his clubhouse.\n\"I think it's full of energy, belief, confidence,\" he said Wednesday. \"But yet they're the ones that aren't being given a chance. So I also think that there's a little different edge. And I thank you all.\"\nThe Rangers have already worked one miracle under their rookie manager, climbing from last place in the American League (67-95) in 2014 to make the playoffs. Only four other teams in the majors have done that before.\nToronto manager John Gibbons sees the ALDS contest as more of an \"even matchup.\"\n\"Our teams are very similar,\" he said. \"Good offences. Balanced. They've got some pretty good team speed over there.\"\nAnd they both went out and made big pitching acquisitions with Toronto trading for David Price and Texas picking up Cole Hamels. They also looked to bolster their bullpens.\n\"Both GMs attacked it the same way,\" said Gibbons. \"They saw what they needed and they went out and did it.\"\nToronto sends out Price, its left-handed ace, against right-hander Yovani Gallardo as post-season baseball returns to the Rogers Centre for the first time since Joe Carter took Philadelphia's Mitch Williams deep in Game 6 of the 1993 World Series.\nThat walkoff homer has since become part of Canadian sports lore, as has the accompanying memorable call from the late Tom Cheek — \"Touch 'em all, Joe. You'll never hit a bigger home run in your life.\"\nA new band of free-swinging Blue Jays hopes to add to that legacy, backed by a fervent following that stretches across the country like the Trans-Canada Highway.\nCanadians have celebrated the Jays' rise to prominence. But deep down in Texas, the Rangers were also making some noise.\nBoth teams swing big bats, with more than 400 homers between them, and tore up the second half of the season when they went 1-2 in the majors in scoring runs (405 for Toronto and 381 for Texas).\nToronto finished with a 93-69 record in the regular season while Texas was 88-74. The Jays were 48-23 after the all-star break while the Rangers were 46-28.\nThe Jays, while full of belief in their team, aren't getting carried away by their rave reviews.\n\"It doesn't really mean anything once you step on the field,\" said centre-fielder Kevin Pillar.\nToronto third baseman Josh Donaldson, while acknowledging the Jays have to beat a \"very good Texas Rangers team,\" is confident his team's offence will keep firing.\n\"Have you looked at our lineup?\" he asked. \"Well that's why.\"\nThe Rogers Centre is being gussied up for the playoffs. Baseball loves a party.\nMini \"2015 AL East Champs\" pennants now hang in the Jays' well-appointed clubhouse. There is a space between the pennants hanging high above centre field, waiting for the bigger version of the 2015 pennant to be put into place.\nToronto knuckleballer R.A. Dickey wore a T-shirt that read \"The East is ours.\" New nameplates with the ALDS logo are atop the Jays' lockers. Uniforms have sparkling post-season logo on the shoulder.\nBoth managers were complimentary about their opponents. But Bannister's assessment came with a polite but noticeable edge.\n\"Look we know that that's a really good ball club over there. We look at the numbers, we've seen it. We hear everything that's being said. Dynamic ball club. Lot of power. They love playing in this ball club.\n\"We know that we've got to play well. We've got to pitch well, play well. If we do that, we've got an opportunity.\"\nPrice versus Gallardo is a fascinating opening matchup.\nPrice is 9-1 as a Blue Jay with an earned-run average of 2.30. Over his career, he is 11-1 at the Rogers Centre.\nHe comes into Thursday's game on 11 days rest, with his last real outing Sept. 26 in Tampa.\n\"You take guys with great arms and they can locate the ball, now you got the superstars. ... He's a complete pitcher with a great arm,\" Gibbons said of his six-foot-six ace.\nAnd yet the former Tampa Bay and Detroit pitcher is 1-5 in the playoffs with a 4.50 ERA.\nGallardo, meanwhile, is a Blue Jays bogeyman.\nTexas won two of six meetings with Toronto this season and Gallardo was on the mound for both of them, throwing 13.2 scoreless innings.\n\"He lives and dies on the corners,\" said Gibbons. \"He likes to get you to chase out of the zone.\"\n\"He was on both those games so he's confident going in, he's got to be confident going in,\" he added. \"We're hoping third time's the charm for us.\"\nThere was no immediate word on whether the roof will be open Thursday. The forecast for the 3:37 p.m. ET start calls for 14 Celsius and a 20 per cent chance of precipitation.\nA sellout crowd of some 48,000 is expected. Price says the fans will play their part.\n\"It can turn 95 (m.p.h) into 96. It can make that hitter get to that pitcher's pitch,\" he said. \"It pumps you up.\n\"Whenever you have that many fans and they're that loud, it's just that added element. I mean everybody out there (Thursday) is going to have adrenalin but it'll take it to that next level and it's a big factor.\"\nFollow @NeilMDavidson on Twitter\n ", "external_links": [], "published": "2015-10-07T16:28:00.000+03:00", "crawled": "2015-10-08T09:19:01.679+03:00", "highlightTitle": ""}