{"organizations": [], "uuid": "2b2636a3535e728128155b745d0bca0942bff3ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mysanantonio.com", "main_image": "http://ww3.hdnux.com/photos/25/44/67/5656050/3/rawImage.jpg", "site_section": "http://www.mysanantonio.com/rss/feed/mySA-Sports-921.php", "section_title": "mySA Sports", "url": "http://www.mysanantonio.com/sports/college_sports/longhorns/article/Texas-mascot-Bevo-XIV-dies-6574240.php", "country": "US", "title": "Texas mascot Bevo XIV dies", "performance_score": 0, "site": "mysanantonio.com", "participants_count": 1, "title_full": "Texas mascot Bevo XIV dies - San Antonio Express-News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T19:53:00.000+03:00", "replies_count": 0, "uuid": "2b2636a3535e728128155b745d0bca0942bff3ab"}, "author": "Mike Finger", "url": "http://www.mysanantonio.com/sports/college_sports/longhorns/article/Texas-mascot-Bevo-XIV-dies-6574240.php", "ord_in_thread": 0, "title": "Texas mascot Bevo XIV dies", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: Joe Robbins, Getty Images Image 1 of / 16 16 14 things you didn't know about Bevo\nBevo XIV, the University of Texas at Austin mascot since 2004, has died after fighting a life-threatening illness. The longhorn steer has a long history at the state university. Here are 14 things you should know about Bevo XIV and his predecessors.\nh/t Daily Texan ; University of Texas 14 things you didn't know about Bevo\nBevo XIV, the University of Texas at Austin mascot since 2004, has died after fighting a life-threatening illness. The longhorn steer has a long history at the state... Photo: Joe Robbins, Getty Images Image 2 of 16 1. They ate the first Bevo. The original Bevo was too expensive to keep. So after serving four years as the school's good luck charm, the mascot was slaughtered and fed to hungry students at a winter banquet in 1920. 1. They ate the first Bevo. The original Bevo was too expensive to keep. So after serving four years as the school's good luck charm, the mascot was slaughtered and fed to hungry students at a winter banquet... Photo: Eric Gay, Associated Press Image 3 of 16 2. Bevo II was an impostor.\nThe second Bevo only served for three games in 1936 (The school did not have a steer mascot between 1921 to 1936 and again until 1945). Multiple reports say he was out-of-control and likely not even a real longhorn, but in fact a hereford. 2. Bevo II was an impostor.\nThe second Bevo only served for three games in 1936 (The school did not have a steer mascot between 1921 to 1936 and again until 1945). Multiple reports say he was out-of-control... Photo: Chris Covatta, Getty Images Image 4 of 16 3. Bevo XIV attended George W. Bush's inauguration in 2004.\nBevo has chilled with friends like Matthew McConaughey and Kristen Bell. The celebrity steer can pull in the big bucks too. Chevrolet paid $4.8 million to name a Longhorns version of the Silverado \"the official truck of Bev\" last year. 3. Bevo XIV attended George W. Bush's inauguration in 2004.\nBevo has chilled with friends like Matthew McConaughey and Kristen Bell. The celebrity steer can pull in the big bucks too. Chevrolet paid $4.8... Photo: TOM FOX/Staff Photographer, The Dallas Morning News Image 5 of 16 4. The first Bevos were wild.\nOnly in the past few decades did the steers chosen to be Bevo prove domesticated enough to handle a screaming football fans (Handlers say the steers are not drugged to keep them calm). Past Bevos allegedly have charged at cheerleaders and opposing team benches. He sometimes got in the way too. In this photo here star UT running back Earl Campbell smashes into a photographer and the mascot. 4. The first Bevos were wild.\nOnly in the past few decades did the steers chosen to be Bevo prove domesticated enough to handle a screaming football fans (Handlers say the steers are not drugged to keep... Photo: George Honeycutt, © Houston Chronicle Image 6 of 16 5. There's a Bevo Museum.\nThe University of Texas at Austin opened a museum dedicated to the mascot at Royal-Memorial Stadium in 2006. 5. There's a Bevo Museum.\nThe University of Texas at Austin opened a museum dedicated to the mascot at Royal-Memorial Stadium in 2006. Photo: Eric Gay, Associated Press Image 7 of 16 6. You can rent Bevo for $3,000.\nIn addition to football games, Bevo, when healthy, attends various school functions throughout the year. He's also available for private parties, with the Daily Texan quoting the steer's price at $3,000 in 2013. 6. You can rent Bevo for $3,000.\nIn addition to football games, Bevo, when healthy, attends various school functions throughout the year. He's also available for private parties, with the Daily Texan quoting... Photo: Thomas Boyd, Associated Press Image 8 of 16 7. A longhorn steer can have horns as long as seven feet across.\nThe current Bevo maxes out around six feet. 7. A longhorn steer can have horns as long as seven feet across.\nThe current Bevo maxes out around six feet. Photo: LM Otero, Associated Press Image 9 of 16 8. The Texas Society for the Prevention of Cruelty to Animals has no problem with Bevo.\nIn 2013, a spokeswoman told the Daily Texan that as long as the animal is not mistreated the organization does not have any issue with domesticated animals as mascots. 8. The Texas Society for the Prevention of Cruelty to Animals has no problem with Bevo.\nIn 2013, a spokeswoman told the Daily Texan that as long as the animal is not mistreated the organization does not have... Photo: Karen Warren, Chronicle Image 10 of 16 9. Bevo travels in style.\nThe steer rides to games in a custom-made trailer that allows room for the horns. The trailer also contains two air-conditioning units. When not traveling, Bevo lives on a 250-acre northwest of Austin. 9. Bevo travels in style.\nThe steer rides to games in a custom-made trailer that allows room for the horns. The trailer also contains two air-conditioning units. When not traveling, Bevo lives on a 250-acre... Photo: Brian Bahr, Getty Images Image 11 of 16 10. The school doesn't own him.\nThe University of Texas doesn't own the Bevo clan. The owners are ranchers Betty and John T. Baker. Bevo VIII through the current steer have come from their farm. Bevo XIV was originally named Sunrise Studly. 10. The school doesn't own him.\nThe University of Texas doesn't own the Bevo clan. The owners are ranchers Betty and John T. Baker. Bevo VIII through the current steer have come from their farm. Bevo XIV was... Photo: gcalzada@express-news.net Image 12 of 16 11. Longhorn steer can live up to 30 years.\nTheir lifespans seems to range from early 20s to 30 years old. Bevo XIII lived until age 22 (retiring two years prior to his death). 11. Longhorn steer can live up to 30 years.\nTheir lifespans seems to range from early 20s to 30 years old. Bevo XIII lived until age 22 (retiring two years prior to his death). Photo: FILE Image 13 of 16 12. Hook'em horns didn't start until 1955.\nThe longhorn steer's iconic horns are represented by UT fans who extend an index and pinky fingers. But the hand sign wasn't introduced until a 1955 pep rally when head cheerleader Harley Clark popularized it. Clark went on to become a district judge in the state. She died in 2014. 12. Hook'em horns didn't start until 1955.\nThe longhorn steer's iconic horns are represented by UT fans who extend an index and pinky fingers. But the hand sign wasn't introduced until a 1955 pep rally when... Photo: Houston Chronicle Image 14 of 16 13. The Aggies had nothing to do with Bevo's name.\nLegend has it that students at rival Texas A&M had a hand in naming Bevo. In 1917, students at then-called Agricultural and Mechanical College of Texas kidnapped the first mascot and branded him with the score, 13-0, to commemorate a 1915 victory. That part is true. But the creative UT students didn't change the 13-0 branding so it looked like \"Bevo,\" according to UT historian Jim Nicar . He already had the name. After an alum purchased the steer to bring to a football game in 1915, someone gave the animal the name \"Bevo\" as a play on the plural for beef, \"beeve.\" 13. The Aggies had nothing to do with Bevo's name.\nLegend has it that students at rival Texas A&M had a hand in naming Bevo. In 1917, students at then-called Agricultural and Mechanical College of Texas... Photo: Brian Bahr, Getty Images Image 15 of 16 14. The Silver Spurs is the name of the student group that handle and take care of Bevo.\nThe organization is almost as old as the Bevo tradition. The Silver Spurs formed in 1937, according to the Daily Texan .\n14. The Silver Spurs is the name of the student group that handle and take care of Bevo.\nThe organization is almost as old as the Bevo tradition. The Silver Spurs formed in 1937, according to the Daily Texan . Photo: Houston Chronicle Image 16 of 16 Texas mascot Bevo XIV dies 1 / 16 Back to Gallery AUSTIN — Bevo XIV, the longhorn steer that served as Texas’ mascot since 2004, died in his sleep Friday at an area ranch, the university announced.\nThe 2,100-pound national grand champion show steer had been diagnosed with bovine leukemia virus earlier this month, and did not make the trip to the Longhorns’ 24-17 upset victory over Oklahoma in Dallas last week. Earlier this week, the school announced Bevo XIV officially retired as the school’s mascot.\nAccording to information released by UT, Bevo XIV spent his final days in the company of “his best friend Spike,” another steer. The Silver Spurs alumni association, which is in charge of taking care of the animal, has begun a search for Bevo XIV’s replacement.\n“Bevo XIV was so much more than a traditional mascot,” Silver Spurs executive director Ricky Brennes said. “He was so big and strong, but he had such a sweet personality and a gentle soul.”", "external_links": ["http://ww3.hdnux.com/photos/25/44/67/5656050/3/920x920.jpg", "http://ww4.hdnux.com/photos/23/42/01/5120119/6/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/01/37/32/390846/3/square_gallery_thumb.jpg", "http://www.houstonchronicle.com/news/houston-texas/houston/article/UT-rakes-in-corporate-sponsorships-6236636.php?t=58e96b2168&cmpid=twitter-premium", "http://ww3.hdnux.com/photos/01/37/32/390846/3/920x920.jpg", "http://ww1.hdnux.com/photos/37/15/43/8182008/7/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/37/15/43/8182008/7/920x920.jpg", "http://ww4.hdnux.com/photos/23/42/01/5120119/6/920x920.jpg", "http://ww4.hdnux.com/photos/36/15/02/7917699/3/square_gallery_thumb.jpg", "http://news.utexas.edu/2014/08/30/100-facts-about-bevo-history", "http://ww3.hdnux.com/photos/26/07/54/5798718/13/square_gallery_thumb.jpg", "http://www.dailytexanonline.com/news/2013/09/15/life-of-bevo-%E2%80%94-the-past-and-present-of-the-texas-longhorn-mascot", "http://ww4.hdnux.com/photos/05/32/10/1417739/5/920x920.jpg", "http://jimnicar.com/ut-traditions/bevo/", "http://ww1.hdnux.com/photos/41/13/43/8698068/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/37/15/43/8182002/7/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/35/06/57/7629810/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/26/07/54/5798718/13/920x920.jpg", "http://ww3.hdnux.com/photos/24/21/05/5312862/3/920x920.jpg", "http://ww3.hdnux.com/photos/25/46/02/5660806/3/920x920.jpg", "http://ww3.hdnux.com/photos/24/21/05/5312862/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/30/44/54/6441756/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/35/06/57/7629810/3/920x920.jpg", "http://ww3.hdnux.com/photos/25/46/02/5660806/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/25/44/67/5656050/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/04/77/05/1306951/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/37/15/43/8182002/7/920x920.jpg", "http://ww4.hdnux.com/photos/05/32/10/1417739/5/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/30/44/54/6441756/3/920x920.jpg", "http://ww1.hdnux.com/photos/41/31/16/8754108/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/41/13/43/8698068/3/920x920.jpg", "http://ww4.hdnux.com/photos/36/15/02/7917699/3/920x920.jpg", "http://ww4.hdnux.com/photos/04/77/05/1306951/3/920x920.jpg", "http://ww1.hdnux.com/photos/41/31/16/8754108/3/920x920.jpg"], "published": "2015-10-16T19:53:00.000+03:00", "crawled": "2015-10-16T20:30:42.947+03:00", "highlightTitle": ""}