{"organizations": [], "uuid": "2ab784e183274f3ef869e864312817b83974b01f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mndaily.com", "main_image": "http://www.mndaily.com/sites/default/files/images/photos/2015/10/18/101915stfb1019g-1.jpg", "site_section": "http://www.mndaily.com//rss/sports", "section_title": "Sports", "url": "http://www.mndaily.com/sports/football/2015/10/19/gophers-dominated-huskers", "country": "US", "title": "Gophers dominated by Huskers", "performance_score": 0, "site": "mndaily.com", "participants_count": 1, "title_full": "Gophers dominated by Huskers", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T18:06:00.000+03:00", "replies_count": 0, "uuid": "2ab784e183274f3ef869e864312817b83974b01f"}, "author": "jthomas@mndaily.com", "url": "http://www.mndaily.com/sports/football/2015/10/19/gophers-dominated-huskers", "ord_in_thread": 0, "title": "Gophers dominated by Huskers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sports » Football Gophers dominated by Huskers Quarterback Mitch Leidner throws a pass to make Gopher's first touchdown of the game at TCF Bank Stadium Saturday where Minnesota fell to the Nebraska Cornhuskers 48-25. By The only lead Minnesota had all game on Saturday lasted 82 seconds. And it was all Nebraska after that. The Gophers defense allowed more points in a game than they had since 2011, and Minnesota found itself on the wrong end of a 48-25 offensive routing. “We have high expectations, and there are a lot of things that are out of our control,” head coach Jerry Kill said. “But the year is not over and we get some pieces of the puzzle back, and we will go back to work. College football is a strange game.” Fans started to leave early in the fourth quarter, but despite being down 16 points late in the game, the Gophers still had a slim chance to win. Minnesota (4-3, 1-2 Big Ten) was 26 yards away from a touchdown over halfway through the fourth quarter and facing third-and-20. Redshirt junior quarterback Mitch Leidner chose to scramble and gained only five yards. The team then elected to kick a field goal to make it a 13-point game. Even if the Gophers had scored a touchdown and a two-point conversion on the drive, they would have needed another touchdown and two-point conversion just to tie the game. “We felt that if we get [the field goal] there, we can get an onside kick, and we’ve done that before,” Kill said. “That is a decision that I made, and you can put it on me.” The Gophers did not recover the onside kick, and Nebraska added a field goal and later an interception return for a touchdown to finish the game. “We were ready for a lot of different scenarios,” senior safety Antonio Johnson said. “I don’t think they out-schemed us. They just made more plays.” The blowout spoiled Leidner’s best game of the season, as the redshirt junior finished with a career-high 26 completions on 40 attempts for 301 yards. The quarterback threw two interceptions, but both came late in the fourth quarter with the Gophers needing to score fast. Leidner’s favorite target of the day was redshirt senior wide receiver KJ Maye, who set a career high of 11 receptions for 94 receiving yards. Both Leidner and Maye also finished with a rushing touchdown. The Gophers running game fell apart while their passing game thrived, with rookie running backs Shannon Brooks and Rodney Smith combining for 45 yards on 16 carries. “You’ve still got to be able to run the ball, and it was one of those things. We weren’t moving them,” Kill said. “We had to throw it more, but we did a good job throwing it when we threw it.” Minnesota started the game off strong. Leidner completed his first five passes in a nine-play 75-yard touchdown drive that gave the Gophers an early 7-0 lead. But their lead vanished three plays later as Nebraska junior running back Terrell Newby ran for a 69-yard touchdown and tied the game early in the first quarter. The Gophers blitzed a cornerback on the play and left Newby a large running lane. Newby found success on the ground all game, running for a total of 116 yards, with another touchdown in the second quarter. “We had a lot of players in position to make plays, but today the dice just didn’t roll our way,” senior cornerback Eric Murray said. “We just got to play better and continue to work, and when those plays come around again, we have to make them.” The Gophers trailed 24-14 later in the third quarter when punter Peter Mortell placed Nebraska at their one-yard line. The Cornhuskers responded with a 99-yard drive that ended with quarterback Tommy Armstrong Jr. airing a touchdown pass to junior Cethan Carter, putting Nebraska up 31-14. “It’s very hard to do, go down and score and take a 99-yard drive and use that clock,” Kill said. “Certainly, from a defensive side of the ball, the kids get tired, and we didn’t have anybody else to go to, so I think it took a lot out of us, no question.” Armstrong Jr. picked apart the Gophers’ secondary, finishing with 261 yards and three touchdowns on 26 attempts. Six different receivers had catches for the Cornhuskers, with junior Alonzo Moore and sophomore De’Mornay Pierson-El also catching touchdown passes. “Things like this happen, and you have to be able to keep fighting back and give everything you got every single day and keep coming to work,” Leidner said. “You definitely don’t like to lose like that, but you just have to keep coming.”", "external_links": [], "published": "2015-10-19T18:06:00.000+03:00", "crawled": "2015-10-19T18:15:19.053+03:00", "highlightTitle": ""}