{"organizations": [], "uuid": "8d644f89f33d8ed7902e57bc5f4cb3479da69ed8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "", "site_section": "http://mf.feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "http://uk.reuters.com/article/2015/10/20/uk-soccer-asia-marketing-idUKKCN0SE1V120151020?feedType=RSS&feedName=sportsNews", "country": "US", "title": "Exclusive - Asian soccer chiefs plan new marketing deal without tender: sources", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "Exclusive - Asian soccer chiefs plan new marketing deal without tender: sources", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T17:16:00.000+03:00", "replies_count": 0, "uuid": "8d644f89f33d8ed7902e57bc5f4cb3479da69ed8"}, "author": "", "url": "http://uk.reuters.com/article/2015/10/20/uk-soccer-asia-marketing-idUKKCN0SE1V120151020?feedType=RSS&feedName=sportsNews", "ord_in_thread": 0, "title": "Exclusive - Asian soccer chiefs plan new marketing deal without tender: sources", "locations": ["SINGAPORE"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Patrick Johnston"], "text": "SINGAPORE | By Patrick Johnston \nSINGAPORE The Asian Football Confederation (AFC) has lined up a new eight-year deal with a sports marketing agency owned by French media group Lagardere ( LAGA.PA ) without offering it to a formal tender, two sources close to the process told Reuters. \nThe marketing agreement with World Sports Group (WSG), re-named Lagardere Sports last month in a re-brand by the French group, replaces an existing $1-billion (0.64 billion pound) deal which still had more than four years to run, the sources said. \nSpeaking on condition of anonymity because minor aspects of the agreement are still being finalised, the sources said the new contract overwrites the master rights agreement signed in 2009 with former Asian soccer chief Mohamed bin Hammam. \nBin Hammam was banned from soccer for life by the sport's global governing body FIFA in 2012 for unspecified ethics breaches. Bahrain's Sheikh Salman bin Ebrahim Al Khalifa replaced him as AFC president in 2013. \nLagardere Chief Operating Officer Andrew Georgiou told Reuters he was confident of a new deal. \"We have had negotiations and expect to renew the contract,\" he told Reuters on Tuesday. \nLagardere Sports activities include among others marketing rights management, athlete management and brand consulting. \nThe sources close to the process said the AFC would receive a significant financial increase on the 2009 deal but did not specify how much. \nThe AFC declined to say whether a deal had been agreed with Lagardere Sports. \n\"We have discussed our next commercial contract with a number of companies and when any deal is concluded we will announce it in the usual way,\" an AFC spokesperson said. \nThe contract renewal comes at a time of increased scrutiny of the multi-million-dollar marketing deals soccer bodies reach with FIFA, engulfed in an unprecedented crisis. \nIn May, the United States indicted 14 sports marketing executives and soccer officials, including several from FIFA on bribery, money laundering and wire fraud charges. \nThe charges were brought against mainly Caribbean and North, Central and South American officials by Swiss and U.S. authorities who extended investigations to look at awarding of the rights to host the 2018 and 2022 World Cups. \nFIFA president Sepp Blatter, who is under investigation by Swiss authorities, and European body UEFA's president Michel Platini, were both suspended for 90 days by FIFA’s ethics committee earlier this month, pending a full investigation. Both have announced they will appeal and have denied wrongdoing. \nMalaysian Peter Velappan, a former Salman ally, stepped down as general secretary of the AFC in 2007 after 29 years in the role. He told Reuters that during his time at the regional body, transparency on contract renewals was paramount. \n\"I am out of the AFC for seven years but at that time everything was transparent and legal and if we had to have a sponsor there was a tender,\" he said. \n\"(It was always) four-year contracts, subject to renewal so I don't know what happened to that part.\" \n\nCLEAN UP \nThe 47-member Asian confederation has also had issues to confront in recent years. \nA 2012 report by consultancy PwC, commissioned by the AFC, into the governance of the body during Bin Hammam's nine years in power, highlighted a number of issues with the AFC-World Sports Group contract signed in 2009 to cover the period 2013-2020. \nThe report, published by British newspaper The Sunday Times, showed PwC had advised the AFC to seek legal advice to see if there was sufficient grounds to renegotiate or cancel the contract. \nPwC also feared the deal \"may be considerably undervalued\" after discovering a \"number of areas of concern for the AFC\". \nThe document showed that PwC questioned a lack of itemisation on the $250 million costs WSG said they would incur, and recommended the AFC seek legal advice to check whether there had been any criminal or civil breaches. \nAn AFC spokesperson said the body had already \"implemented the majority of its recommendations in the last two years.\" \nThe new deal will be the first signed under Salman, who was elected the 10th president of the Asian body on a promise of transparency. \nSalman replaced Bin Hammam, vowing to \"clean up the past\" and implemented a new code of conduct upon assuming power. \nArticle 3.7 of the code states: \"We seek transparency and strive to maintain a good compliance culture with checks and balances.\" \nA spokesperson for the Bahraini said there were no plans to publish the PwC report, saying it was already accessible online. \nSources said Lagardere, which as WSG has been an AFC partner since 1993, had begun talking to Salman about a new contract once the Bahraini came to power, with meetings taking place in Manama and on the sidelines of the Asian Cup in Australia at the start of this year. \nSalman was re-elected AFC president unopposed for a four-year term in April and is expected to run for FIFA president in an election in February.. \n(Editing by Susan Thomas)", "external_links": [], "published": "2015-10-20T17:16:00.000+03:00", "crawled": "2015-10-20T17:54:55.341+03:00", "highlightTitle": ""}