{"organizations": [], "uuid": "fb2aaaa71726691e2dc684e33f999b02853e024e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nydailynews.com", "main_image": "http://assets.nydailynews.com/polopoly_fs/1.2393838!/img/httpImage/image.jpg_gen/derivatives/landscape_1200/wilt13a-4-web.jpg", "site_section": "http://www.nydailynews.com/sports/index.html", "section_title": "Sports News &amp; Articles: Today’s Latest Sports News - NY Daily News", "url": "http://www.nydailynews.com/sports/basketball/nba-legend-wilt-chamberlain-dies-1999-article-1.2393843", "country": "US", "title": "Wilt Chamberlain, NBA legend, dies at 63 in 1999", "performance_score": 0, "site": "nydailynews.com", "participants_count": 1, "title_full": "Wilt Chamberlain, NBA legend, dies at 63 in 1999 - NY Daily News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "fb2aaaa71726691e2dc684e33f999b02853e024e"}, "author": "NEW YORK DAILY NEWS", "url": "http://www.nydailynews.com/sports/basketball/nba-legend-wilt-chamberlain-dies-1999-article-1.2393843", "ord_in_thread": 0, "title": "Wilt Chamberlain, NBA legend, dies at 63 in 1999", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "FILES/BETTMANN/UPI Hall of Fame basketball player Wilt Chamberlain was found dead at the age of 63, a Los Angeles Lakers spokesman said on October 12, 1999. (Originally published by the Daily News on October 13, 1999. This story was written by Dave Goldiner.)\nWilt (The Stilt) Chamberlain, a basketball legend and American icon who scored a record-setting 100 points in a single game, died yesterday. He was 63.\nParamedics found the 7-foot-1 Chamberlain at his mansion in suburban Los Angeles around noon.\nA Los Angeles Fire Department spokesman said Chamberlain, who had been treated for an irregular heartbeat, apparently died of a heart attack.\n\"Wilt was one of the greatest ever, and we will never see another one like him,\" said fellow basketball great Kareem Abdul-Jabbar.\nChamberlain had lost nearly 50 pounds in recent weeks, was scheduled to undergo hip surgery and had been in excruciating pain from a tooth extraction last week, relatives said.\nIt was not clear whether other medical problems could have contributed to the heart ailment.\nChamberlain, one of the most versatile hoopsters who ever played, was the NBA's second-leading all-time scorer, trailing only Abdul-Jabbar.\nOn a single night in 1962, the Philadelphia Warriors center scored a mind-boggling 100 points in a game against the Knicks.\nThe record stands as one of the most enduring marks in sports and has never been challenged in the nearly four decades since - not even by the incomparable Michael Jordan.\nChamberlain played 47,859 minutes but never fouled out of a game.\nNew York Daily News The New York Daily News published this article on Oct. 13, 1999. New York Daily News The New York Daily News published this article on Oct. 13, 1999. New York Daily News The New York Daily News published this article on Oct. 13, 1999. Previous Next Enlarge He was so dominating, he forced the NBA to change the rules to limit his offensive output.\n\"Wilt was a competitor in the truest sense of the word,\" presidential candidate Bill Bradley, a former Knick, said yesterday.\nYears after his retirement, Chamberlain made headlines for another head-spinning mark. In a 1992 autobiography, he estimated that he had made love to 20,000 women.\nBut the towering Chamberlain will be remembered first and foremost for his immense, uncontainable talent on the basketball court.\nWilton Norman Chamberlain was born Aug. 21, 1936, and grew up one of nine children in West Philadelphia. His father was a handyman who worked odd jobs for $60 a week, and his mother was a domestic worker.\nAfter building a schoolyard legend at Overbrook High School, he attended the basketball powerhouse University of Kansas.\nEager to support his family, he left before his senior year and joined the Harlem Globetrotters. He was drafted by his hometown Philadelphia Warriors and immediately became one of the most dominating players in the league.\nAlong with his 31,419 points, Chamberlain was the NBA's all-time top rebounder and a four-time MVP during a 14-year career.\n\"He was one of the two or three greatest athletes of the 20th century,\" said sportscaster Dick Schaap.\nThe legend grew on March 2, 1962, during a game in Hershey, Pa. Chamberlain hit 36 baskets and 28 foul shots that night to reach triple digits.\nJEFF TAYLOR/REUTERS Chamberlain is shown at the University of Kansas' Allen Fieldhouse after his jersey was retired during a halftime ceremony on January 17, 1998. Despite his limitless talent, Chamberlain was dogged by criticism throughout his career that he was a less-than-perfect team player.\nHe enjoyed a career-long rivalry with fellow legend Bill Russell. But Russell's Celtics won 11 championships in 13 years, while Chamberlain won just two rings in his career.\nHe summed up the domination and the criticism with a signature comment: \"Nobody roots for Goliath.\"\nThat seemed to say it all. Chamberlain was an eloquent and outspoken star in an era when most athletes - especially black athletes - were much more circumspect.\n\"I was a brash young man of color coming into a white societal sport and taking over - commanding and demanding,\" he said in a 1997 interview. \"Do you think I was liked for that? I don't think so.\"\nHe retired in 1973 but stayed in remarkable physical shape for years afterward. Two decades later, he sparked whispers in NBA circles when rumors spread that he might try a comeback at age 56.\nIn the early 1990s, Chamberlain's X-rated boast about his sexual prowess - which came not long after Magic Johnson announced he was infected with the AIDS virus - attracted a firestorm of criticism.\nTennis great Arthur Ashe leveled a blistering critique at Chamberlain and Johnson in a memoir published after his death.\n\"These two college-trained black men of international fame and immense personal wealth do their best to reinforce the stereotype,\" Ashe wrote.\nPrivaetly, Chamberlain was an introspective man.\nAP Wilt Chamberlain is shown as a member of the Harlem Globetrotters in this 1959 photo. PAUL VATHIS/AP Wilt Chamberlain of the Philadelphia Warriors holds a sign reading \"100\" in the dressing room in Hershey, Pa., after he scored 100 points as the Warriors defeated the New York Knickerbockers 169-147, in 1962. Previous Next Enlarge He read voraciously, spoke several languages and would wake friends at midnight to spar about the finer points of philosophy.\n\"He made his living playing basketball,\" said Sy Goldberg, Chamberlain's personal assistant. \"But he was much more than that.\"\nIn the city, even those far too young to have seen him play were stunned by the sudden loss.\nMichael Ingram, 38, of Manhattan buried his face in his hands during a break from the action at the W. Fourth St. court.\n\"It's the loss of a great player. No one will be able to do what he did,\" Ingram said. \"His agility, his physical dominance. He was a pure athlete.\"\nEven younger guys like Shawn Johnson, 27, of Brooklyn knew the legend.\n\"He had talents that back then big men didn't have,\" Johnson said. \"He could do things that nowadays most centers can't do.\"\nLamar Antwon Robinson said Chamberlain's legacy will live on.\n\"There isn't a center in the league who hasn't looked to him for technique and inspiration,\" said Robinson, 29, of Brooklyn. \"Every center out there has a piece of Wilt Chamberlain in him.\"\nWith Bill Egbert\nTags: archives", "external_links": [], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-12T18:47:06.308+03:00", "highlightTitle": ""}