{"organizations": ["USC", "Facebook", "UW Facebook Email Twitter Google", "KING"], "uuid": "0233d5f76a3f09e7e1ed444ba5049b50a9e30634", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.king5.com", "main_image": "http://www.gannett-cdn.com/-mm-/489efad1142179deef9ce5ef3cf126cd99e1a3f1/r=x633&amp;c=1200x630/http/cdn.tegna-tv.com/-mm-/1990bc6fb4618fd48f1ef0cc8668e6c8653b313b/c=3-0-798-449/local/-/media/2015/10/13/NWGroup/KING/635802928864830529-sarkisian-uw.jpg", "site_section": "http://rssfeeds.king5.com/_/20/110049264/king5/sports", "section_title": "KING 5 - Sports", "url": "http://www.king5.com/story/sports/2015/10/13/sarkisianfired/73853900/", "country": "US", "title": "Sarkisian's troubling behavior dates back to UW", "performance_score": 0, "site": "king5.com", "participants_count": 0, "title_full": "Sarkisian's troubling behavior dates back to UW", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T07:28:00.000+03:00", "replies_count": 0, "uuid": "0233d5f76a3f09e7e1ed444ba5049b50a9e30634"}, "author": "", "url": "http://www.king5.com/story/sports/2015/10/13/sarkisianfired/73853900/", "ord_in_thread": 0, "title": "Sarkisian's troubling behavior dates back to UW", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sarkisian", "Danielle Leigh", "Steve Sarkisian", "Pinterest Sarkisian"], "text": "Facebook Email Twitter Google+ LinkedIn Pinterest Sarkisian's troubling behavior dates back to UW The firing of USC Head Football Coach Steve Sarkisian is taking a serious tone amidst accusations of alcohol abuse. Post to Facebook Sarkisian's troubling behavior dates back to UW The firing of USC Head Football Coach Steve Sarkisian is taking a serious tone amidst accusations of alcohol abuse.   KING5.com: http://www.king5.com/story/sports/2015/10/13/sarkisianfired/73853900/   Join the Conversation To   Sarkisian's troubling behavior dates back to UW Danielle Leigh, KING 5 News 9:28 p.m. PDT October 12, 2015 The firing of USC Head Football Coach Steve Sarkisian is taking a serious tone amidst accusations of alcohol abuse. Steve Sarkisian CONNECT TWEET LINKEDIN COMMENT EMAIL MORE \nThe firing of USC Head Football Coach Steve Sarkisian is taking a serious tone amidst accusations of alcohol abuse. \nMany have called an August rally the beginning of the end for the troubled coach, when he slurred his words and used an expletive. \nSarkisian later apologized, but concerns about potential alcohol abuse dating back to his time as head football coach at the University of Washington began to surface. \nAn LA Times Report uncovered a long list of receipts with large alcohol tabs while Sarkisian was at UW. \nA former player for UW told KING5, \"Sarkisian was known for liking to party.\" The former player added, \"But, he always showed up ready for football.\" \nMonday USC let Sarkisian go, one day after announcing he would take a leave of absence, over fears he was unfit to coach. \nAlong with the news, the mood on Twitter changed, transitioning from playful tweets about Sarkisian's drinking to expression of true concern. \nOn the Danny, Dave and Moore show on 710 ESPN several minutes were devoted to talk of Sarkisian and his alleged alcohol abuse. \nDanny Dave and Moore on 710 ESPN radio. \n\"I think everybody now that you know there is a problem, it's not funny anymore, and we all hope he gets better,\" said Dave Wyman. \nSarkisian used to coach under Seahawks Coach Pete Carroll during his time at USC. \nDuring a press conference Carroll said Sarkisian would have his support and added, \"It's been hard on him and he's been hard on others two, and he's got to take the steps to take care of business now.\" \nAmy Shaffer is a counselor in Seattle specializing in substance abuse. \nShe says the loss of a job can be the rock bottom it takes for someone to seek help. \n\"Until those things start to happen it's really hard to admit it's a problem because they are managing everything,\" Shaffer said adding the road back would be long and demanding. \n\"You have to make a constant decision to seek treatment and stay in treatment,\" Shaffer said. \nNow, as Sarkisian reportedly seeks treatment, the sports world is wishing him a quick recovery. \n\"I hope he gets better,\" said Danny O'Neil. \nThe UW athletics department declined a KING5 request for interview. \nIn a written statement, Director Scott Woodward said, \"It is evident that Steve is dealing with a serious personal matter and we wish him the best in facing whatever challenges lay ahead.\" \nOffensive Coordinator Clay Helton will serve as interim Head Coach at USC.", "external_links": [], "published": "2015-10-13T07:28:00.000+03:00", "crawled": "2015-10-13T07:45:49.054+03:00", "highlightTitle": ""}