{"organizations": [], "uuid": "ccd3ae5a2d2426d396144224cae91f800b45d99d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wcax.com", "main_image": "http://wncontent.images.worldnow.com/images/7467305_G.jpg", "site_section": "http://www.wcax.com/category/38882/latest-health-news", "section_title": "Latest Health News - WCAX.COM Local Vermont News, Weather and Sports-", "url": "http://www.wcax.com/story/30327692/adhd-may-have-different-effects-on-brains-of-boys-and-girls", "country": "US", "title": "ADHD may have different effects on brains of boys and girls", "performance_score": 0, "site": "wcax.com", "participants_count": 1, "title_full": "ADHD may have different effects on brains of boys and girls - WCAX.COM Local Vermont News, Weather and Sports-", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "ccd3ae5a2d2426d396144224cae91f800b45d99d"}, "author": "wcax.com", "url": "http://www.wcax.com/story/30327692/adhd-may-have-different-effects-on-brains-of-boys-and-girls", "ord_in_thread": 0, "title": "ADHD may have different effects on brains of boys and girls", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Tara Haelle\nHealthDay Reporter\n(HealthDay News) -- Attention-deficit/hyperactivity disorder (ADHD) manifests itself differently in the brains of girls than in the brains of boys, new research suggests.\nThe results may help scientists better understand how ADHD affects boys and girls in unique ways, the researchers said.\n\"The findings showed differences in the white matter microstructure between boys and girls,\" said study co-author Lisa Jacobson, a pediatric neuropsychologist at the Kennedy Krieger Institute, in Baltimore. White matter helps different regions of the brain communicate with each other.\n\"These structural differences were associated with observed behavioral differences,\" Jacobson said. \"Taken together, our findings provide preliminary evidence for unique differences in the brain's white matter structure and function between boys and girls with ADHD.\"\nKathryn Moore, a psychologist at Providence Saint John's Child and Family Development Center in Santa Monica, Calif., said, \"Females are more likely to present with the inattentive symptoms of ADHD, while males are more likely to present with hyperactive and impulsive features of ADHD.\"\nMoore, who was not involved with the new research, noted that the study authors could not explain the reasons for their findings. ADHD is also diagnosed in boys at about twice the rate as in girls, she said, but this study does not necessarily explain why that is.\n\"The most striking finding in this study is that there are differences in brain functioning between boys and girls with ADHD,\" Moore added. \"Perhaps the disorder of ADHD is caused by these neurological differences, or perhaps ADHD causes these neurological differences.\"\nFor the study, 120 children between the ages of 8 and 12 had a type of MRI called diffusion tensor imaging, which allows researchers to see neurological differences in the brain. Half of the children had been diagnosed with ADHD. The children without ADHD were matched to the children with ADHD, based on age, IQ and handedness (being left- or right-handed). Each of the groups, with and without ADHD, had 30 boys and 30 girls.\nThe researchers found several differences in the white matter of children with ADHD compared to those without ADHD, but the variations showed up in different parts of the brain based on gender.\nIn boys with ADHD, the differences showed up in the primary motor cortex, a part of the brain responsible for controlling basic motor functions. In girls with ADHD, the differences appeared in the prefrontal regions of the brain, which control motivation and ability to regulate emotions, the study authors said.\nIt's possible that the differences seen relate to how the different sexes mature, suggested Dr. Glen Elliott, chief psychiatrist and medical director of Children's Health Council in Palo Alto, Calif.\n\"Boys and girls differ in a number of different ways, obviously including rates of maturation,\" Elliott said. He added that differences in the brains of males and females are present even during fetal development.\n\"Certainly some aspects of these findings might be reflective of previous studies done by other researchers showing that ADHD is associated with a delay in maturation, especially of frontal brain structure,\" Elliott said.\nMoore explained that the differences seen in the brain functioning of people with ADHD, regardless of sex, is generally in the same larger region of the brain, the frontal lobe. The frontal lobe controls executive functioning, which involves \"impulse control, decision-making, cognitive flexibility and planning,\" she said.\nElliott said: \"Possibly more relevant are the findings that, as they move through their teens into adulthood, boys with ADHD tend to get into trouble with externalizing problems, such as conduct disorder and reckless behaviors, while girls with ADHD have, in general, a more internalizing presentation, with depression, anxiety, eating disorders and self-harm.\"\nBut none of this might make a difference in how the disorder is treated, Elliott said.\n\"The 'why' of these differences remains unclear and could well be associated with quite distant other parts of the brain that connect to the regions being studied,\" Elliott said. \"Similarly, the findings do not really suggest unique treatment options.\"\nThe primary first-line treatment for ADHD is still medication, usually stimulants, Moore said.\n\"Most psychologists would also advocate for additional interventions, such as using rewards and consequences to shape behavior, learning better problem-solving skills and increasing effective communication between parents and the child,\" Moore added.\nThe study findings were published Oct. 22 in the Journal of the American Academy of Child and Adolescent Psychiatry .\nMore information\nFor more about ADHD, visit the U.S. Centers for Disease Control and Prevention ", "external_links": ["http://images.worldnow.com/Revenue/images/275529_G.jpg", "http://www.cdc.gov/ncbddd/adhd/", "http://www.healthday.com/"], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-26T01:25:55.397+02:00", "highlightTitle": ""}