{"organizations": [], "uuid": "442bcf3c37fc104e05c1ae5de8d3f4530559374a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "virginiapreps.rivals.com", "main_image": "", "site_section": "http://www.rivals.com/rss2feed.asp?type=HS&state=VA", "section_title": "Virginia High School Sports Headlines", "url": "https://virginiapreps.rivals.com/content.asp?CID=1814148", "country": "US", "title": "Mid-Atlantic: Five up, two down", "performance_score": 0, "site": "rivals.com", "participants_count": 0, "title_full": "Mid-Atlantic: Five up, two down", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T14:01:00.000+03:00", "replies_count": 0, "uuid": "442bcf3c37fc104e05c1ae5de8d3f4530559374a"}, "author": "", "url": "https://virginiapreps.rivals.com/content.asp?CID=1814148", "ord_in_thread": 0, "title": "Mid-Atlantic: Five up, two down", "locations": ["Mid-Atlantic"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Adam Friedman"], "text": "Mid-Atlantic: Five up, two down Adam Friedman Rivals.com Football Recruiting \nPlayers can improve or hurt their stock throughout the season and with a handful of games already in the books, here is an early look at some players who should move up and possibly a little down in the next round of rankings.\nNote: This list is in alphabetical order. UP Scott Bracey Richmond (Va.) Benedictine While his rating hasn't changed, Bracey, a Rivals100 Duke commit, has steadily slid down the Rivals100. That's not to say his skills have been eroding. They haven't, and he's reminded us of that this season. At Benedictine, he plays quarterback, wide receiver, running back and also plays some on defense. Throughout the early part of the season, Bracey has shown he is as big, strong and fast as he has ever has been and he has not regressed as a wide receiver. His routes are crisp, he has good hands still and is a difficult matchup for any defensive back he comes across. Bracey may have even gotten better with the ball in his hands, often carrying the ball on designed runs from the quarterback position. He will be the best recruit Duke is ever landed and his best days are still ahead of him. UP Jarrett Guarantano Oradell (N.J.) Bergen Catholic Despite the possibility he might be out for the rest of this season, few quarterbacks in the country have played as well as Guarantano. His poise has improved tremendously and his decision-making has gotten a lot better as well. He takes a beating at Bergen Catholic year in and year out, but still manages to have great performances and keep his team in contention against some of the nation's best. There's no doubting his arm strength or his mobility and his future looks very bright at Tennessee. UP Keandre Jones Olney (Md.) Good Counsel As a junior, Jones was an incredibly athletic and intelligent linebacker that knew where to be and when be there. As the senior he has really stepped up his game and is playing at a much higher level. Jones' physicality is off the charts. That was the only phase of Jones's game that was a bit of a question mark and he has really answered all of his doubters this year. UP Drew Singleton (2017) Paramus (N.J.) Paramus Catholic Though everyone watching Paramus Catholic might be focusing in on five-star defensive tackle Rashan Gary , Singleton has had an outstanding season. His ability to read and react quickly has improved and his full athleticism and aggressiveness has been on display this year. With great size and tremendous speed to go along with it, Singleton's ceiling is extremely high. His offer sheet is already very long and look for more schools to come calling. UP Chase Young (2017) Hyattsville (Md.) DeMatha The offseason went well for Young, but few expected him to have this great of a season. Throughout the early games of DeMatha's treacherous schedule, Young has arguably been their best player on a talented roster that features multiple four-star players. Young isn't extremely imposing from a physical standpoint, but he does have a good frame with lots of room to fill out. His success this season is a reflection of how far along he is technically. Young's hand techniques an understanding of how to play with leverage is tremendous. As Young adds to his frame, there will be few that can stop him. DOWN Cameron Brown Potomac (Md.) Bullis School There's no doubt Brown is a special athlete, but his skills playing in space as a linebacker have a long way to go. He's got a great frame, is very good at coming off the edge and blitzing, but being able to stand up at the point of attack and really flow to the football are areas he has not progressed in. Expect him to be a major contributor after a year or two at Penn State , but at this point he's not ready to step in and contribute as a freshman. DOWN Keion Joyner Havelock, N.C. After a less-than-impressive offseason, things were looking up for Joyner in August. He was back in shape and really looking like he would have a big season. Joyner's senior campaign started off with mixed results and earlier this week, we learned that Joyner was no longer part of the Havelock team. It is yet to be determined whether this will have a major impact on his recruitment. but it certainly is not good for his development. It's tough to see someone with so much potential go through such a rough time. \nAdam Friedman", "external_links": [], "published": "2015-10-15T14:01:00.000+03:00", "crawled": "2015-10-17T07:18:49.749+03:00", "highlightTitle": ""}