{"organizations": [], "uuid": "8befb9447da5902f6b9b09df4540c80d777bf6d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.latimes.com", "main_image": "http://www.trbimg.com/img-5619776f/turbine/la-sp-sn-us-mexico-concacaf-cup-playoff-what-to-watch-for-html-20151009", "site_section": "http://www.latimes.com/sports/rss2.0.xml", "section_title": "Sports - Los Angeles Times", "url": "http://www.latimes.com/sports/sportsnow/la-sp-sn-us-mexico-concacaf-cup-playoff-what-to-watch-for-html-20151009-htmlstory.html", "country": "US", "title": "U.S. vs. Mexico: What to watch for in tonight's CONCACAF Cup playoff", "performance_score": 0, "site": "latimes.com", "participants_count": 1, "title_full": "U.S. vs. Mexico: What to watch for in tonight's CONCACAF Cup playoff", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T20:00:00.000+03:00", "replies_count": 0, "uuid": "8befb9447da5902f6b9b09df4540c80d777bf6d5"}, "author": "Kevin Baxter", "url": "http://www.latimes.com/sports/sportsnow/la-sp-sn-us-mexico-concacaf-cup-playoff-what-to-watch-for-html-20151009-htmlstory.html", "ord_in_thread": 0, "title": "U.S. vs. Mexico: What to watch for in tonight's CONCACAF Cup playoff", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "There is no shortage of story lines going into Saturday’s CONCACAF Cup soccer match between Mexico and the U.S. at a sold-out Rose Bowl. Here are a few worth watching: 1. The Rose Bowl spotlight: \nIn addition to the 93,000-plus fans who are expected to attend Saturday’s game and the millions more who will watch on TV, organizers say more than 800 media credentials have been issued, the most for a soccer game in the U.S. since the Women’s World Cup final at the Rose Bowl in 1999. (And another 500 applications were declined.) The Americans edged China in penalty kicks in that 1999 game, but the men’s team hasn’t been as lucky in the Rose Bowl, where it hasn’t beaten Mexico in 21 years. In the last match-up, four years ago, Mexico, playing before a largely partisan crowd, rallied from a 2-0 deficit to win the Gold Cup final 4-2, costing U.S. Coach Bob Bradley his job. \nSee the most-read stories in Sports this hour >> 2. Speaking of fans: \nA change in the ticketing policy for Saturday’s game will create separate rooting sections for fans — Mexico in the north end, the U.S. to the south. It is also expected to even out the number of fans for each team; in the 2011 game, the crowd skewed heavily in favor of Mexico and in deference to the crowd the on-field awards ceremony after the game was conducted largely in Spanish. Now U.S. Coach Juergen Klinsmann hopes to win those fans over. “Hopefully by the end of the game they pull that [Mexican] jersey off and have the red, white and blue underneath. This is our goal,” he said. No chance, Mexican star Javier Hernandez told the New York Times. “For the most part, I think, the Mexicans in America have had hard lives, have pushed so hard to reach America that when they have a chance to celebrate the Mexican national team, they are back in their country. To Mexicans, it’s all there is. Soccer is everything.” 3. Dos a Cero: \nThe U.S. has beaten Mexico by the score of 2-0 in each of the last four World Cup qualifying tournaments, and five of the Americans’ last seven wins overall against Mexico have come by that same score. That’s something U.S. fans routinely bring up during games with Mexico, chanting the score in Spanish. But U.S. Soccer may have taken the taunt a little too far for this game, hanging banners emblazoned with “Dos a Cero, Once Again” from a stage erected in the Rose Bowl parking lot for Saturday’s Fan Fest celebration. Isn’t this how curses get started? \nNEWSLETTER: Get the day's top headlines from Times Editor Davan Maharaj >> 4. What’s at stake: \nSaturday’s game, which has been dubbed the CONCACAF Cup, is essentially a one-game playoff to determine the region’s representative in the 2017 Confederations Cup, an eight-team dress rehearsal for the 2018 World Cup in Russia. But that’s where it gets complicated. Until this year, CONCACAF, the ruling body for soccer in North America, Central America and the Caribbean, awarded its Confederations Cup berth to the champion of the preceding Gold Cup, the federation’s biennial regional championship. Under those rules Mexico, which won this summer’s Gold Cup, would be CONCACAF’s representative. But a rule change designed to give meaning to every Gold Cup now requires a team to win both tournaments in any given four-year World Cup cycle to automatically qualify for the Confederations Cup. Since the U.S. won the Gold Cup two years ago, the U.S. and Mexico must meet on the field Saturday to determine who will play in Russia two years from now. \nFollow Kevin Baxter on Twitter @kbaxter11 \nALSO", "external_links": [], "published": "2015-10-10T20:00:00.000+03:00", "crawled": "2015-10-11T02:45:39.504+03:00", "highlightTitle": ""}