{"organizations": [], "uuid": "d4823b6d49cb2ebccc7f63b17f36de2648d115c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/6/55/161543/Sports/World/Stop-treating-players-like-horses,-says-Klopp.aspx", "country": "EG", "title": "Stop treating players like horses, says Klopp - World - Sports", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Stop treating players like horses, says Klopp - World - Sports - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "d4823b6d49cb2ebccc7f63b17f36de2648d115c2"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/6/55/161543/Sports/World/Stop-treating-players-like-horses,-says-Klopp.aspx", "ord_in_thread": 0, "title": "Stop treating players like horses, says Klopp - World - Sports", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Klopp gets 1st taste of Anfield in Europa League Klopp says no 'magic dust' needed to improve Liverpool Klopp backs 'fun' Origi to fill Liverpool gaps Klopp's Liverpool reign begins with draw against Tottenham New Liverpool manager Juergen Klopp has criticized the demands placed on young players in England and believes they should be given time to develop, not treated like \"horses\".\nLiverpool's Jordan Rossiter returned to the club with an injury which will keep him out for a month after he played for England's under-19 side against Macedonia, Finland and Italy.\nAll three games were played in less than a week.\n\"I have never heard of such a young player being asked to play three games in five days,\" Klopp told reporters.\n\"I don't know who I need to speak to about this but people from the club will be contacting the FA because this is not OK,\" added Klopp, who will take charge of his first game at Anfield when Liverpool welcome Rubin Kazan in the Europa League on Thursday.\n\"If we handle them like horses then we get horses. We would prefer them to have time to develop and not feel too much pressure. Three games in five days for an 18-year-old is just wrong,\" he added.\nWhile the former Borussia Dortmund boss wants his side to be fit enough to outrun the opposition, he also wants them to be able to adapt to different styles.\n\"We need to have a plan and that's what we are trying to do, but we don't have to run 150km a game to be successful -- we have to be prepared for each style we want to do,\" Klopp told reporters at a news conference on Wednesday.\n\"There is always talk about, 'Can they do this every three days?' Yes, of course we need healthy players, but we don't kill the players -- we train with them and they have the confidence and physical skills to do this because they are young, healthy and professionals.\n\"If you play against a much better team and are not ready to run more than they are, then you are crazy,\" the 48-year-old added.\n(For more sports news and updates, follow Ahram Online Sports on Twitter at @AO_Sports and on Facebook at AhramOnlineSports .)", "external_links": ["https://twitter.com/AO_Sports", "https://www.facebook.com/AhramOnlineSports?fref=ts"], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-22T13:43:26.409+03:00", "highlightTitle": ""}