{"organizations": [], "uuid": "3b595e7b9e951955971bbed0ac6cd039b2433b8b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.timesunion.com", "main_image": "http://ww2.hdnux.com/photos/41/31/31/8754773/3/rawImage.jpg", "site_section": "http://www.timesunion.com/default/feed/default/feed/Sports-News-64.php", "section_title": "Sports News", "url": "http://www.timesunion.com/sports/article/UAlbany-football-trying-to-identify-leaders-6557332.php", "country": "US", "title": "UAlbany football trying to identify leaders - Times Union", "performance_score": 0, "site": "timesunion.com", "participants_count": 1, "title_full": "UAlbany football trying to identify leaders - Times Union", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:52:00.000+03:00", "replies_count": 0, "uuid": "3b595e7b9e951955971bbed0ac6cd039b2433b8b"}, "author": "Mark Singelais", "url": "http://www.timesunion.com/sports/article/UAlbany-football-trying-to-identify-leaders-6557332.php", "ord_in_thread": 0, "title": "UAlbany football trying to identify leaders - Times Union", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: Michael P. Farrell Image 1 of / 8 Caption\nClose\nImage 1 of 8 UAlbany head football coach Greg Gattuso watches his team practice field goal offense and defense at Bob Ford Field on Wednesday Oct. 7, 2015 in Albany , N.Y. (Michael P. Farrell/Times Union)\nBuy this photo Photo: Michael P. Farrell UAlbany head football coach Greg Gattuso watches his team practice... Image 2 of 8 UAlbany QB DJ Crook, (14) ,during practice at Bob Ford Field on Wednesday Oct. 7, 2015 in Albany , N.Y. (Michael P. Farrell/Times Union)\nBuy this photo Photo: Michael P. Farrell UAlbany QB DJ Crook, (14) ,during practice at Bob Ford Field on... Image 3 of 8 UAlbany QB DJ Crook, (14) ,during practice at Bob Ford Field on Wednesday Oct. 7, 2015 in Albany , N.Y. (Michael P. Farrell/Times Union)\nBuy this photo Photo: Michael P. Farrell UAlbany QB DJ Crook, (14) ,during practice at Bob Ford Field on... Image 4 of 8 UAlbany LB Julian Cox, (6), during practice at Bob Ford Field on Wednesday Oct. 7, 2015 in Albany , N.Y. (Michael P. Farrell/Times Union)\nBuy this photo Photo: Michael P. Farrell UAlbany LB Julian Cox, (6), during practice at Bob Ford Field on... Image 5 of 8 UAlbany LB Julian Cox, (6), during practice at Bob Ford Field on Wednesday Oct. 7, 2015 in Albany , N.Y. (Michael P. Farrell/Times Union)\nBuy this photo Photo: Michael P. Farrell UAlbany LB Julian Cox, (6), during practice at Bob Ford Field on... Image 6 of 8 UAlbany OL Kevin Malloy ,(67), during practice at Bob Ford Field on Wednesday Oct. 7, 2015 in Albany , N.Y. (Michael P. Farrell/Times Union)\nBuy this photo Photo: Michael P. Farrell UAlbany OL Kevin Malloy ,(67), during practice at Bob Ford Field on... Image 7 of 8 UAlbany OL Kevin Malloy ,(67), during practice at Bob Ford Field on Wednesday Oct. 7, 2015 in Albany , N.Y. (Michael P. Farrell/Times Union)\nBuy this photo Photo: Michael P. Farrell UAlbany OL Kevin Malloy ,(67), during practice at Bob Ford Field on... Image 8 of 8 UAlbany football trying to identify leaders 1 / 8 Back to Gallery Albany\nUniversity at Albany sophomore quarterback DJ Crook gathered the first-team offense for a talk before practice began on Tuesday.\nComing off a 37-0 loss at Holy Cross on Saturday, Crook felt the Great Danes were \"going through the motions too much.\" He told his teammates they needed to show more urgency with a critical home game against Maine approaching on Saturday.\nCrook said the offensive starters got his message.\n\"This is our season,\" Crook said. \"We're starting conference play. We've just got to pick it up. We can't be getting shut out, ever. From now on, with practice, we attacked it, we went after it, guys were working hard, and things are looking a lot better this week.\"\nMore Information\nUAlbany vs. Maine\nWhen: 3:30 p.m. Saturday\nWhere: Bob Ford Field, Albany\nRadio: WOFX (980 AM)\nIn a small way, Crook's words addressed a problem that head coach Greg Gattuso mentioned after Saturday's rout: a lack of leadership on a team that has only four senior starters on the depth chart and none on defense.\nIt was an issue exacerbated by the season-ending injuries to junior linebacker Michael Nicastro and junior tight end Nic Ketter of Queensbury, both captains, not to mention a serious shoulder injury to junior safety Kyle Sakowski , out indefinitely.\nAs Gattuso put it, \"We're struggling for leadership.\"\nTo that end, Gattuso said he is elevating sophomore wide receiver Brad Harris and senior defensive tackles Samuel Gray and Zach Troutman to captain. They will join junior linebacker Neil Morrison and junior center Adam Wierbinski, already captains.\n\"They have been trying desperately to rise up and I wanted to recognize them for how hard they've been playing and how hard they've been practicing,\" Gattuso said. \"Brad Harris is the epitome of what we're looking for in a football player. Great kid, hard worker, does everything we're asking him to do. Never complains and he's out here busting his butt every single day at practice. We're trying to show them who the leaders are.\"\nCrook, in his first year after transferring from Penn State, isn't one of the team captains even though the quarterback is viewed as a leader just by the demands of the position.\n\"I don't think he wants to be in that role at this moment, but it's going to be in his future,\" Gattuso said. \"He's a good leader. He works hard. He's so new, that's a problem, too.\"\nCrook acknowledged that is hasn't been easy adjusting to a new program and offensive system while earning his teammates' trust. However, he said the Great Danes have been very receptive to him.\n\"There's definitely an expectation (of leadership) from my position, specifically,\" Crook said. \"I've tried to pick that up throughout the season. I'm still continuing to go on (with) it. For the whole team, we need the older guys, guys with experience to lead us and take control and guide these younger guys. We're finally starting to have guys come up.\"\nJunior offensive tackle Kevin Malloy said setting an example doesn't have to come from talking more, but just making sure his offensive teammates are \"doing the right thing,\"\n\"I think especially since a lot of the guys that were known as leaders, they've been hurt, it's time for other people to step up and take a role,\" Malloy said. \"I think I need to do a better job because we still have a lot of young guys. I think just get those guys on track and we can turn this whole season around.\"\nA future leader could be freshman linebacker Julian Cox , who has stepped in for the injured Nicastro and now leads the Great Danes with 43 tackles. Right now, though, he's just one of a group of young Great Danes trying to get the hang of college football. Gattuso said some of his young players are being pushed to their limit and might be hitting a wall.\n\"Learning from guys like Nicastro and the guys who were here before me, I know the game is going to come fast to me,\" Cox said. \"I know I'm not where I need to be at. Right now, I know the game. I know my position well. I need to get a lot smarter. Coach said I have a lot of learning to do.\"\nThe crash course continues with Maine on Saturday.\nNote: UAlbany has called a news conference for Thursday to announce the selling of naming rights to the football stadium. UAlbany officials wouldn't disclose the name.\nmsingelais@timesunion.com • 518-454-5509 • @MarkSingelais", "external_links": ["http://ww2.hdnux.com/photos/41/31/31/8754777/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/31/31/8754777/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/31/31/8754774/3/920x920.jpg", "http://ww4.hdnux.com/photos/41/31/31/8754775/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/41/31/31/8754776/3/920x920.jpg", "http://timesunion.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20Times%20Union&image=http://ww3.hdnux.com/photos/41/31/31/8754774/3/628x471.jpg", "http://ww1.hdnux.com/photos/41/31/31/8754780/3/square_gallery_thumb.jpg", "http://timesunion.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20Times%20Union&image=http://ww1.hdnux.com/photos/41/31/31/8754776/3/628x471.jpg", "http://ww1.hdnux.com/photos/41/31/31/8754780/3/920x920.jpg", "http://ww1.hdnux.com/photos/41/31/31/8754776/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/41/31/31/8754775/3/920x920.jpg", "http://ww3.hdnux.com/photos/41/31/31/8754778/3/square_gallery_thumb.jpg", "http://timesunion.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20Times%20Union&image=http://ww2.hdnux.com/photos/41/31/31/8754773/3/628x471.jpg", "http://timesunion.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20Times%20Union&image=http://ww3.hdnux.com/photos/41/31/31/8754778/3/628x471.jpg", "http://timesunion.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20Times%20Union&image=http://ww2.hdnux.com/photos/41/31/31/8754777/3/628x471.jpg", "http://ww2.hdnux.com/photos/41/31/31/8754773/3/920x920.jpg", "http://timesunion.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20Times%20Union&image=http://ww4.hdnux.com/photos/41/31/31/8754775/3/628x471.jpg", "http://timesunion.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20Times%20Union&image=http://ww1.hdnux.com/photos/41/31/31/8754780/3/628x471.jpg", "http://ww2.hdnux.com/photos/41/31/31/8754773/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/31/31/8754774/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/31/31/8754778/3/920x920.jpg"], "published": "2015-10-08T03:52:00.000+03:00", "crawled": "2015-10-08T03:57:21.438+03:00", "highlightTitle": ""}