{"organizations": [], "uuid": "8528ac05ddd5d22674d38817a76ef7629285d3f3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtontimes.com", "main_image": "http://media.washtimes.com.s3.amazonaws.com/media/image/2015/10/16/7ea6b4fb865b022e850f6a7067003b35.jpg", "site_section": "http://www.washingtontimes.com/rss/headlines/sports/", "section_title": "www.washingtontimes.com stories: Sports", "url": "http://www.washingtontimes.com/news/2015/oct/16/quinn-says-really-good-falcons-must-protect-ball-b/", "country": "US", "title": "Quinn says 'really good' Falcons must protect ball better", "performance_score": 0, "site": "washingtontimes.com", "participants_count": 1, "title_full": "Quinn says 'really good' Falcons must protect ball better", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T00:07:00.000+03:00", "replies_count": 0, "uuid": "8528ac05ddd5d22674d38817a76ef7629285d3f3"}, "author": "CHARLES ODUM", "url": "http://www.washingtontimes.com/news/2015/oct/16/quinn-says-really-good-falcons-must-protect-ball-b/", "ord_in_thread": 0, "title": "Quinn says 'really good' Falcons must protect ball better", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sports Quinn says ‘really good’ Falcons must protect ball better In this Thursday, Oct. 15, 2015 photo, Atlanta Falcons head coach Dan Quinn signals to Atlanta Falcons players during the first half of an NFL football game against the New Orleans Saints, in New Orleans. The New Orleans Saints won ... more > By CHARLES ODUM -   \nFLOWERY BRANCH, Ga. (AP) - Following his first loss as Falcons coach, Dan Quinn’s simple lesson was “it’s about the ball.” \nAs in it’s all about protecting the ball. \n“The truth is we’ve got a really good team and we didn’t play like we were capable of,” Quinn said Friday. \nThe Falcons (5-1) lost three fumbles, gave up five sacks and had a punt blocked for a touchdown in Thursday night’s 31-21 loss to the Saints. \nIt was Atlanta’s second straight week with three turnovers after having only two in the first four games. That’s why Quinn left his players with a lesson about ball security as they started a rare stretch of three straight off days. \n“That’s a hard lesson for us to go through when we end up being minus-three for the day,” Quinn said of the turnover ratio. “We didn’t play football like we like to play in terms of takeaways and creating opportunities for the offense. Give New Orleans credit for that.” \nThe Falcons also lost three turnovers in a 25-19 overtime win over Washington on Oct. 11. \n“When we talked about the turnovers last week we played with fire and this week we got burned,” Quinn said. \nRookie running back Tevin Coleman had one of the lost fumbles. Quarterback Matt Ryan recovered his own fumble on an unsuccessful fourth-and-one play in the first quarter but lost another fumble. The third fumble came on a botched shotgun snap by fill-in center James Stone. \n“We just didn’t play the way we are capable of, in terms of ball security,” Ryan said after the game. “I mean we knew it was going to be difficult coming down here … but when you don’t protect the football and have a number of turnovers, it’s just difficult to win.” \nRyan has been sacked 14 times this season, including eight in the last two games. \nThe Falcons’ defense was again strong against the run but it chipped in with its share of mistakes. Saints tight end Ben Watson continually made plays in the middle of the defense and finished with 10 catches for 127 yards and a touchdown. \nThe Saints were held to only 81 yards rushing, but running back Mark Ingram had two touchdown runs. \nQuinn said the mistakes can be fixed. \n“We can play so much better,” he said. “We had more mental errors in this game than we’d had in previous ones. … The miscues, those are things that we can control and that’s why we get so optimistic knowing there are so many ways for us to improve.”", "external_links": [], "published": "2015-10-17T00:07:00.000+03:00", "crawled": "2015-10-17T01:33:46.710+03:00", "highlightTitle": ""}