{"organizations": [], "uuid": "6624f13a867aea62e1a036006e00ccfcbe325d1d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sportsnews.com.au", "main_image": "http://sportsnews.com.au/defaultimage.jpg", "site_section": "http://www.sportsnews.com.au/category/rugby-union/feed/", "section_title": "Sports News Australia » Rugby Union News", "url": "http://www.sportsnews.com.au/rugby-union/carter-takes-on-pollard-in-world-cup-semi/160735", "country": "CA", "title": "Carter takes on Pollard in World Cup semi", "performance_score": 0, "site": "sportsnews.com.au", "participants_count": 1, "title_full": "Carter takes on Pollard in World Cup semi", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T04:12:00.000+03:00", "replies_count": 0, "uuid": "6624f13a867aea62e1a036006e00ccfcbe325d1d"}, "author": "AAP", "url": "http://www.sportsnews.com.au/rugby-union/carter-takes-on-pollard-in-world-cup-semi/160735", "ord_in_thread": 0, "title": "Carter takes on Pollard in World Cup semi", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Carter takes on Pollard in World Cup semi Posted by AAP + on 22/10/2015 at 12:12 pm \nDan Carter in the closing minutes of his illustrious career facing Handre Pollard, the rising star of fly-halves – it will be a salivating clash. \nCarter is 33 and has played 110 Tests, Pollard is 21 and has played 18 Tests. \nThe veteran and the fledgling will be calling the shots on Saturday, responsible for guiding the All Blacks and Springboks through the Twickenham cauldron in their high-stakes World Cup semi-final. \nCarter, twice the World player of the year and holder of the World Test points-scoring record, draws the curtain on his 13-year international career at the end of the World Cup. \nThat will be 80 or 160 minutes away depending on Saturday’s outcome. \nPollard is just starting out, but is displaying the same fearlessness and all-round skills that set Carter apart when he made his debut as a 21-year-old in 2003. \nFrom the time Pollard played his first Test as a 20-year-old last year against Scotland he has been earmarked as someone special. \nSpringbok coach Heyneke Meyer started the inevitable comparison with Carter immediately after Pollard’s debut international. \n“There are one or two players I can name, one of them is Carter, who have an unbelievable attacking game, but also a good tactical game,” Meyer said. \n“You don’t get a lot of No 10s like that. They’re either running fly-halves or tactical fly-halves. Handre’s got no grey areas, he’s got everything.” \nSix games on from Scotland and the novice Pollard, having vaulted over Morne Steyn and Pat Lambie in South Africa’s fly-half pecking order, stunned the All Blacks when he set up a dramatic 27-25 win for the Springboks. \nThe result ended a 22-match unbeaten run by the All Blacks, and Pollard’s impact was evident from the scoreline. \nWhen he was spelled early in the second half South Africa held a commanding 24-13 lead with Pollard contributing 19 of those points. \nIn a high pressure World Cup semi-final Meyer is confident that Pollard, like Carter, has nerves of steel. \n“A key thing is the players must be able to trust their No 10, they must know he’s got a cool head and is calm under pressure. Handre’s shown he’s mentally tough.” \nWhile Carter is signing off at his fourth World Cup, he has lost little of the magic he showed against the British and Irish Lions in 2005 when he was first labelled the best fly-half in the world. \nHis imperious skills were all on display when he orchestrated the All Blacks’ stunning 62-13 win over France in the quarter-finals last weekend. \nHe showed his class when he went over to shake the hand of veteran French fly-half Frederic Michalak as he hobbled off injured in the first half. \nPollard may not yet have the wisdom that Carter has from years in the hotseat, but All Blacks coach Steve Hansen has first hand knowledge that experience is not everything. \n“I remember when Dan Carter didn’t have any Test caps and I was coaching Wales. And he smashed us.” \nCarter scored a try and landed six conversions and penalty when the All Blacks beat Wales 55-3 in his maiden Test. \nPollard kicked five conversions and two penalties in his debut international when South Africa beat Scotland 55-6.  ", "external_links": [], "published": "2015-10-22T04:12:00.000+03:00", "crawled": "2015-10-22T05:39:59.942+03:00", "highlightTitle": ""}