{"organizations": [], "uuid": "61ca09b329183ed584fbd7099fbe5ce3498500b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "thecabin.net", "main_image": "", "site_section": "http://thecabin.net/taxonomy/term/60/2/feed", "section_title": "TheCabin.net - Conway, Arkansas - Sports", "url": "http://thecabin.net/sports/2015-10-21/both-bielema-and-malzahn-seek-positive", "country": "US", "title": "Both Bielema and Malzahn seek the positive", "performance_score": 0, "site": "thecabin.net", "participants_count": 1, "title_full": "Both Bielema and Malzahn seek the positive", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:26:00.000+03:00", "replies_count": 0, "uuid": "61ca09b329183ed584fbd7099fbe5ce3498500b2"}, "author": "NATE ALLEN", "url": "http://thecabin.net/sports/2015-10-21/both-bielema-and-malzahn-seek-positive", "ord_in_thread": 0, "title": "Both Bielema and Malzahn seek the positive", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Both Bielema and Malzahn seek the positive Posted: October 21, 2015 - 7:26pm By NATE ALLEN SPECIAL TO THE LOG CABIN \nFAYETTEVILLE — Preseason picked No. 6 and No. 18 in the nation, the unranked, Auburn Tigers (4-2 overall/1-2 in the SEC West) and the unranked 2-4,1-2 in the SEC West Arkansas Razorbacks obviously were tabbed for better things going in Saturday’s clash. \nHow are they able to motivate projected good teams going bad, third-year Arkansas Coach Bret Bielema and Gus Malzahn, the third-year Auburn coach and Arkansas native and former Arkansas championship high school coach at Springdale and Shiloh Christian and 2006 Razorbacks’ offensive coordinator, were both asked on Wednesday’s SEC Coaches/Media Teleconference. \nBoth can point to recently positive outings. Totally positive for Auburn winning its last game on Oct. 15 over SEC foe Kentucky in Lexington, Ky. and relatively positive for Arkansas, coming off a 24-20 SEC victory over Tennessee to lead reigning SEC champion Alabama, 7-3 into the third quarter before losing, 27-14 on Oct. 10 in Tuscaloosa, Ala. before last week’s open date. \n“Since we have got to October, I have sensed the difference in our team. The urgency and everything that goes with it,” Malzahn said. \n“We are starting to kind of settle in on our personnel and moving forward. I can tell the guys have more confidence. So far, obviously, we didn’t get off to a very good start, but we are 4-2 and we have got the rest of our schedule. We think our best football is ahead of us now and we have the meat of our schedule coming up, too, starting with Arkansas.” \nBielema says a team that stayed motivated through early-season heartbreaks in 2014 to win 3 of its last 4 with SEC shutouts in Fayetteville over LSU and Ole Miss and a 31-7 trashing of Texas in the Advocare Texas Bowl in Houston has stayed on motivational course against stiff competition. \nTennessee opened the season in the Top 25 while the four that have beaten Arkansas are a combined 22-4. \nThree are in the Top 25. Alabama, 6-1, is No. 8; Texas A&M, 5-1, is No. 15 and Toledo, 6-0, is No. 19. \nTexas Tech, 5-2, is among those receiving votes outside the Top 25. \n“The four teams we have lost to have an unbelievable record and have lost only to some really good teams,” Bielema said. \n“It’s not like they are getting their tail kicked into oblivion. They have played competitive games. They have been right there swinging every way possible. They are hearing a lot of good things from people they respect about the the way they are playing. You turn on the game film and you watch it and you see how competitive they are and they are not about to quit. These kids have been playing their tails off.” \nSounds like they may have to play their galoshes off Saturday. \nHeavy thunderstorms have been forecast for Saturday. \nThat has to be all wet no fun for Razorbacks fans but the Razorbacks themselves seem happier about it than Hogs in slop. \n“One of the things we tell our kids is to control the controllables,” Bielema said. “You embrace whatever the situation is we have played well on rainy days. Going back last year to LSU and Ole Miss, both those games there was a little bit of that. The Tennessee game was supposed to be a monsoon. It wasn’t, but it did rain a little bit. \nLast year we didn’t win the game (losing 14-13 in Fayetteville on a blocked PAT) against Alabama but it was as a wet first half. It’s not something our kids are afraid of.”", "external_links": [], "published": "2015-10-22T03:26:00.000+03:00", "crawled": "2015-10-22T07:14:02.739+03:00", "highlightTitle": ""}