{"organizations": ["Pittsburgh Steelers", "NFL", "Cincinnati Bengals", "AP", "ESPN"], "uuid": "7f7872241ccb16bbc352bec203faa70512f4c610", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wftv.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/21/62/4c/193b25e368fc4a4183c5c93ebc37edbd-2faa83976bc044b59b0d239c8bd30e50-0.jpg", "site_section": "http://www.wftv.com/feeds/categories/sports/", "section_title": "News | Sports", "url": "http://www.wftv.com/ap/ap/sports/espn-is-cutting-about-300-jobs-or-4-percent-of-sta/nn69n/", "country": "US", "title": "ESPN is cutting about 300 jobs, or 4 percent of staff", "performance_score": 0, "site": "wftv.com", "participants_count": 0, "title_full": "ESPN is cutting about 300 jobs, or 4 percent of staff", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T19:41:00.000+03:00", "replies_count": 0, "uuid": "7f7872241ccb16bbc352bec203faa70512f4c610"}, "author": "", "url": "http://www.wftv.com/ap/ap/sports/espn-is-cutting-about-300-jobs-or-4-percent-of-sta/nn69n/", "ord_in_thread": 0, "title": "ESPN is cutting about 300 jobs, or 4 percent of staff", "locations": ["Cincinnati", "New York"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kohl", "John Skipper", "ESPN"], "text": "Updated: 12:41 p.m. Wednesday, Oct. 21, 2015 | Posted: 12:41 p.m. Wednesday, Oct. 21, 2015 ESPN is cutting about 300 jobs, or 4 percent of staff Related View Larger FILE - This Sept. 16, 2013 file photo shows the ESPN logo prior to an NFL football game between the Cincinnati Bengals and the Pittsburgh Steelers, in Cincinnati. ESPN. Disney's ESPN on Wednesday, Oct. 21, 2015 confirmed it is cutting about 300 jobs, or 4 percent of its staff, amid signs that the traditional cable bundle is less far-reaching than it once was. (AP Photo/David Kohl, File) View Larger FILE - In this Oct. 6, 2014, file photo, ESPN President John Skipper smiles during a news conference in New York. Disney's ESPN on Wednesday, Oct. 21, 2015 confirmed it is cutting about 300 jobs, or 4 percent of its staff, amid signs that the traditional cable bundle is less far-reaching than it once was. Skipper says, in a memo to employees that was posted online, these cuts are part of changes being made to keep ESPN as the \"premier sports destination on any platform.\" (AP Photo/Mark Lennihan, File) Sponsored Links The Associated Press NEW YORK — \nDisney's ESPN is cutting about 300 jobs, or 4 percent of its staff, amid signs that the traditional cable bundle is less far-reaching than it once was. \nESPN spokeswoman Amy Phillips confirmed the number of job losses Wednesday. \nThe Bristol, Connecticut-based sports channel is one of the linchpins of the traditional cable bundle of hundreds of channels, which is under pressure from viewers migrating online. A few are choosing to bypass paying for a cable subscription entirely, opting instead for a growing number of choices of online TV alternatives. \nThe job cuts are a \"necessary part of our continued strategic evolution to ensure ESPN remains the leader in sports as well as the premier sports destination on any platform,\" said ESPN CEO John Skipper in a memo to employees that was posted online. \nDisney in August trimmed its TV profit outlook because of a loss of ESPN subscribers. ESPN gets money from cable and satellite companies that carry its channels, and it's the most expensive of the basic pay TV channels. Data provider SNL Kagan has estimated that ESPN costs cable and satellite TV companies $6.61 per monthly subscriber. \nSo ESPN comes under pressure as people skip the cable bundle or choose cheaper TV packages with fewer channels. \nThe company has said that it doesn't expect big declines in traditional TV subscribers over the next few years. But CEO Bob Iger said in August that if the business declines, Disney would consider selling ESPN straight to viewers. \nThere are already big media brands doing that, like HBO, CBS and Showtime. \nFor affected ESPN employees: Skipper said they would get a minimum of 60 days' notice, severance packages and job search assistance. \nShares of Burbank, California-based The Walt Disney Co. rose $1.69 to $111.53 in midday trading Wednesday. \n___", "external_links": [], "published": "2015-10-21T19:41:00.000+03:00", "crawled": "2015-10-21T20:43:15.388+03:00", "highlightTitle": ""}