{"organizations": [], "uuid": "0a452a9371d98568feb46a413d6b0cfceb3b0cb9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.commercialappeal.com", "main_image": "http://media.jrn.com/images/1007_masp_griz_barnes03.JPG", "site_section": "http://www.commercialappeal.com/sports/index.rss", "section_title": "Sports", "url": "http://www.commercialappeal.com/sports/grizzlies-small-ball-lineups-a-work-in-progress-21ff72a0-a664-6416-e053-0100007f6a57-332570382.html", "country": "US", "title": "Grizzlies’ small-ball lineups a work in progress", "performance_score": 0, "site": "commercialappeal.com", "participants_count": 1, "title_full": "Grizzlies’ small-ball lineups a work in progress", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T01:45:00.000+03:00", "replies_count": 0, "uuid": "0a452a9371d98568feb46a413d6b0cfceb3b0cb9"}, "author": "Ronald Tillery", "url": "http://www.commercialappeal.com/sports/grizzlies-small-ball-lineups-a-work-in-progress-21ff72a0-a664-6416-e053-0100007f6a57-332570382.html", "ord_in_thread": 0, "title": "Grizzlies’ small-ball lineups a work in progress", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Grizzlies didn't get to see the Cleveland Cavaliers roster that they will likely face in the regular-season opener Oct. 28 in FedExForum.\nStarters Kyrie Irving and Kevin Love were still rehabbing injuries and didn't appear Monday night during the Grizzlies' 91-81 preseason win on the campus of The Ohio State University.\nHowever, Griz coach Dave Joerger used the opportunity to take a serious look at how he might deploy a small-ball lineup with newcomer Matt Barnes playing power forward next to center Marc Gasol. They were on the court with Mike Conley, Courtney Lee and Tony Allen.\nHow would one grade that group's cohesion and effectiveness?\nIt's fair to give them a D based on turnovers, missed shots and a general lack of flow.\n\"It's a learning process for me with this group and for Matt (Barnes) as well. It's going to take a little while,\" Joerger said. \"It wasn't really pretty. But Matt found shots that were wide open. And also, Beno (Udrih) will get shots and the paint is more open for Brandan Wright.\"\nUdrih had already left the game because of a right ankle sprain. Wright was in foul trouble most of the night. Barnes, meanwhile, took two shots — including a wide-open, corner 3-pointer that he missed. Barnes shot well all week when the Griz held training camp at the University of California, Santa Barbara.\nBut he's 0 for 9 from long range in three preseason games.\n\"I'm just trying to find my way around the court and learn my teammates,\" Barnes said.\nIn fairness to Barnes, he's being asked to learn both forward positions and the Griz don't function like most NBA teams.\n\"It's going to take a minute for him to learn how to play the four with us,\" Joerger said. \"A lot of teams that play small ball, they have their four just stand behind the 3-point line. But we're trying to move people around a little bit. We were playing a team that likes to play small so it was a way for us to evaluate and keep looking at some different lineups. That's really valuable, more than people think.\"\nGasol, Carter shine\nAfter going through several drills, the Griz had a couple of shooting contests for several hundred fans Tuesday afternoon during their annual open practice. Gasol electrified the crowd by making a team-high 19 baskets in a 3-point shooting contest that included Conley, Lee, Jeff Green and Vince Carter.\nMoments later, Carter not only connected on a few half-court shots but the 38-year-old impressively used a regular shooting motion instead of heaving the basketball.\nInjury update\nReserve forward JaMychal Green has a mildly sore elbow, according to Joerger. His absence in the game against the Cavs was for precautionary reasons. Udrih ended up suffering a sprain on the right ankle that required surgery during the offseason.\n\"It's not what he needed,\" Joerger said of Udrih. \"He needs the minutes and put himself in a tough spot. But he'll get there.\"\nUdrih and Allen (elbow) didn't participate in the Grizzlies' open practice.", "external_links": ["https://www.youtube.com/embed/0uJ5587oxS8"], "published": "2015-10-14T01:45:00.000+03:00", "crawled": "2015-10-14T10:32:28.576+03:00", "highlightTitle": ""}