{"organizations": ["A&M", "AP", "Texas A&M"], "uuid": "04a9074958b5581fd8a66d5372de9bd23cd906d6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usatoday.com", "main_image": "", "site_section": "http://www.usatoday.com/sports/", "section_title": "USA Today | Sports", "url": "http://www.usatoday.com/story/sports/ncaaf/2015/10/14/a-ms-young-qb-kyle-allen-ready-for-challenge-of-alabama/73955174/", "country": "US", "title": "A&M's young QB Kyle Allen ready for challenge of Alabama", "performance_score": 0, "site": "usatoday.com", "participants_count": 0, "title_full": "A&M's young QB Kyle Allen ready for challenge of Alabama", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T02:31:00.000+03:00", "replies_count": 0, "uuid": "04a9074958b5581fd8a66d5372de9bd23cd906d6"}, "author": "", "url": "http://www.usatoday.com/story/sports/ncaaf/2015/10/14/a-ms-young-qb-kyle-allen-ready-for-challenge-of-alabama/73955174/", "ord_in_thread": 0, "title": "A&M's young QB Kyle Allen ready for challenge of Alabama", "locations": ["Texas", "Alabama"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kyle Allen"], "text": "CONNECT TWEET LINKEDIN COMMENT EMAIL MORE COLLEGE STATION, Texas (AP) — Kyle Allen is still a teenager. However, the second-year quarterback with No. 9 Texas A&M doesn't feel like one heading into the game against No. 10 Alabama.\n\"I feel a lot older than 19 right now,\" said Allen, shaking his head.\nThe sophomore might feel that way because he's been on campus since age 17 and will make his 11th career start on Saturday.\n\"I felt old when I came here when I was 17, when I was stressed out with college when my friends were at prom,\" he said.\nReceiver Josh Reynolds laughed when asked if it's funny to think that Allen still hasn't reached his 20s.\n\"Yeah, I forget he's on 19 sometimes, too,\" Reynolds said. \"It's always good to have a young quarterback that's as confident as him. That's what we need with this big game coming up. It's always good to have him in the pocket relaxed.\"\nAllen didn't start against the Crimson Tide last season, but took over a week later after Kenny Hill was benched following the embarrassing 59-0 loss by A&M. He came in late in the fourth quarter of the blowout loss and prefers to forget the results of his brief work.\n\"I think my first snap was right over my head into the end zone,\" he said. \"So I'm hoping it's going to be a little different this year.\"\nThough that game was one that Aggies would prefer to forget, the previous two meetings with Alabama helped Allen shape his ideas about the school and its football program.\nJohnny Manziel boosted his stock as a Heisman Trophy winner when he led Texas A&M to a 29-24 win over top-ranked Alabama in 2012 in Tuscaloosa, Alabama.\n\"I think it changed a lot of people's mind on A&M in general,\" Allen said of that game. \"I think everyone thought A&M was a good team in the SEC, but being able to beat a No. 1 opponent on the 2:30 CBS game is huge. And I think that is what really put A&M on the map and has kept us on the map.\"\nA year later Manziel's five-touchdown performance wasn't quite enough and the Crimson Tide collected a 49-42 win at Kyle Field. Allen attended that game as part of his official recruiting visit to the school and remembers the electric atmosphere at the stadium.\nThis time instead of Johnny Football, it's Allen who will be at the center of things when the Aggies try to keep their record unblemished. He insists that he doesn't let outside influences put undue pressure on him and that he's undaunted by the challenge.\n\"It's about us,\" Allen said. \"We don't really care what's going on outside of us. We just care that we're getting done what we need to get done to win on Saturday.\"\nAllen has thrown for 1,274 yards with 13 touchdowns and two interceptions this season. Allen threw an interception in the season opener, but has tossed just one pick in the last four games combined. He said a reminder from his coaches to take better care of the ball after his miscue in the Arizona State game has helped him limit turnovers.\n\"I think you could see that over the past three or four games that I've tried a lot harder to take care of the ball, and I think it's one of the main reasons we've won is because we're winning the turnover battle now,\" Allen said.\nCONNECT TWEET LINKEDIN COMMENT EMAIL MORE Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.\nTOP VIDEOS", "external_links": ["http://www.linkedin.com/shareArticle?url=http%3A//usat.ly/1RIN2QQ&mini=true", "https://twitter.com/intent/tweet?url=http%3A//usat.ly/1RIN2QQ&text=A%26M%27s%20young%20QB%20Kyle%20Allen%20ready%20for%20challenge%20of%20Alabama&via=usatoday"], "published": "2015-10-15T02:31:00.000+03:00", "crawled": "2015-10-15T01:54:29.883+03:00", "highlightTitle": ""}