{"organizations": [], "uuid": "56452e89d5fddaaabf232810ef4191b8a00fb664", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ocvarsity.com", "main_image": "http://images.onset.freedom.com/ocvarsity/medium/nw6okk-countdown7.560.jpg", "site_section": "http://www.ocvarsity.com/common/rss/rss.php?cat=Sports", "section_title": "OCVarsity.com Sports : Sports", "url": "http://www.ocvarsity.com/articles/countdown-80506-calhoun-week.html", "country": "US", "title": "Calhoun Countdown: Calvary Chapel will put up fight for title", "performance_score": 0, "site": "ocvarsity.com", "participants_count": 1, "title_full": "Calhoun Countdown: Calvary Chapel will put up fight for title", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T02:18:00.000+03:00", "replies_count": 0, "uuid": "56452e89d5fddaaabf232810ef4191b8a00fb664"}, "author": "DAMIAN CALHOUN", "url": "http://www.ocvarsity.com/articles/countdown-80506-calhoun-week.html", "ord_in_thread": 0, "title": "Calhoun Countdown: Calvary Chapel will put up fight for title", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "STAFF WRITER \nThis week the Calhoun Countdown spotlight shines on … Calvary Chapel. \nAfter opening the season with consecutive victories, the Calvary Chapel football team hit a rough patch. \nFirst there was a 17-14 loss to Ontario Christian, which was followed by a 28-27 loss to University. \nAfter a bye week, Calvary Chapel came back and dropped a 55-27 result to Saddleback Valley Christian. Losses are never fun, but those three teams enter this week with a combined record of 17-1. \nAfter being tested through that stretch, Calvary Chapel (3-3, 1-0), which was picked to finish second in the Orange Coast League, opened league play with a 23-21 victory over defending league champion Estancia. \n“The kids have stayed focused,” Calvary Chapel coach Chris Cox said. “Estancia is a good team and (Coach Mike ) Bargas is a phenomenal coach. Our kids kept playing hard and came away with the victory. \nAccording to Cox, Friday’s victory is just the second over Estancia for Calvary Chapel in 14 years. \nAs with any successful team, Cox said the credit belongs to big boys up on the offensive line. Shane Martinez (290 pounds), Marcus Time (340), Bryan Kazarian (245), Kevin Pimentel (230) and Aidan Vega (230). \n“They’re a big deal,” he said. “They have helped our quarterback ( Patrick Glasgow ) more than anything.” \nGlasgow, a senior, has completed 117 of 199 passes (58.8 percent) for 1,372 yards with 13 touchdowns and three interceptions. \nCox has had a front-row seat to watching Glasgow’s development. As a freshman, Glasgow was the quarterback for Cox at the freshman level. \n“He’s a tough-minded kid,” Cox said of Glasgow. “He’s hard to get rattled. I’m proud of him. This year, he’s better at reading defenses and he’s mentally tough.” \nThis week, Cox and the Eagles take on Godinez. The Grizzlies, led by Bryan Ibarra , opened league play with a 44-7 victory over Saddleback. \nThe Orange Coast League is another of the smaller leagues where there are a handful of teams thinking they have a legit shot at the league title. In the preseason poll, Estancia, Calvary Chapel and Saddleback all received first-place votes. \n“I agree with the assessment that the league title is up for grabs,” Cox said. “The kids are ready to fight and compete.” \nWhen watching Calvary Chapel, make sure to located Josh Debernarde (No. 8), Luke Thompson (No. 2) and Braeden Stack (No. 21). \nHere is the rest of the Calhoun Countdown: \nThe Countdown Showdown of the Week: St. John Bosco vs. Mater Dei, at Santa Ana Stadium, Friday. Could Mater Dei do something that no other team has been able to this season? Once St. John Bosco turns up the heat, no one has been able to cool them off this season. \nThe Braves, led by quarterback Quentin Davis (18 touchdowns, one interception), are only averaging 63.6 points a game. St. John Bosco routed Santa Margarita, 62-14, last week, which surprised me. Even if you thought Bosco would win, did anyone think the game would end with a running clock? \nIf the Braves hit the Monarchs with the running clock this week, I would like to vote to advance the Braves all the way to the Pac-5 finals. \nKeep an eye on: \nSean McGrew, St. John Bosco: He’s fast. \nFrank Martin, Mater Dei: If Martin and the big boys up front can control the line of scrimmage, then maybe Mater Dei can run the ball and keep the Bosco offense off of the field. \nThe Countdown Showdown of the Week, Part 2: Buena Park at La Habra. Last year, the Coyotes were extremely close to upsetting La Habra, falling 42-35 in a thriller at Buena Park. The Highlanders haven’t lost a league game since 2006. \nThe Coyotes have bounced back from their 38-0 loss to Edison, winning four consecutive games including last week’s 47-24 victory over Fullerton. Aside from the 37-32 victory over Los Alamitos, the La Habra defense has downright beastly. \nIf you take out that game, the Highlanders are allowing 8.8 points per game. \nKeep an eye on: \nElijah Gates and Elijah Bynum, Buena Park: Not just because they’re both named Elijah. They’re two keys to the Coyotes attack. Bynum gained 245 yards last week. Gates gained 83 with two touchdowns. \nJacob Colacion, La Habra: The key to the Highlander defense. Coyotes will need to keep an eye on him at all times. \n(Don’t worry, I’m capping it at two showdowns of the week.) \nJordan Leonard vaults to the top: Jorge Briseno (Santa Ana) was slowed by injury last week. That only means the rush for the county rushing top becomes a little crowded at the top heading into this week. \nBrethren Christian's Jordan Leonard , the county’s best kept secret, rushed for 181 yards in a 45-16 victory over Rio Hondo Prep to vault into the top spot in the county with 1,160 yards. \nBriseno is second with 1,150. Sonora’s Jacob Fimbres is third with 1,024. Leonard is averaging 193 yards a game, with Briseno averaging 191 a game. \nMy vote in the this week’s O.C. Top 10 looked like this: 1. Mater Dei; 2. Mission Viejo; 3. Orange Lutheran; 4. Santa Margarita; 5. San Juan Hills; 6. Servite; 7. Tesoro; 8. La Habra; 9. San Clemente; 10. El Toro. \nThe Real American Hero (for Week 6): Jonathan Briseno, Santa Ana. With his twin brother Jorge out of the game, Jonathan picked up the slack last week, rushing for 185 yards and scoring three touchdowns for the Saints. \nThe player to watch this week: Eric Barriere , La Habra. Barriere didn’t have the best of games last week against Sonora (50 yards rushing, 5 of 21 passing for 79 yards). He will need a much better performance if the Highlanders are to hold off Buena Park this week in what likely amounts to the Freeway League title game.", "external_links": [], "published": "2015-10-14T02:18:00.000+03:00", "crawled": "2015-10-14T04:44:40.720+03:00", "highlightTitle": ""}