{"organizations": ["USC", "Columbia", "NCAA", "Williams-Brice Post", "AP"], "uuid": "0482548bbd24520b1654d7dc452a11c52abc4e8b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.greenvilleonline.com", "main_image": "http://www.gannett-cdn.com/-mm-/5bc751442f2d6e10253e54ded90798144388ce10/c=51-0-973-521&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/03/CarolinaGroup/Greenville/635795075455645053-South-Carolina-Missouri-Football-17-.jpg", "site_section": "http://rssfeeds.greenvilleonline.com/greenville/sports", "section_title": "Greenville - Sports", "url": "http://www.greenvilleonline.com/story/sports/college/clemson/2015/10/05/dodd-goodson-honored-acc/73382540/", "country": "US", "title": "Weather forces USC staff from stadium", "performance_score": 0, "site": "greenvilleonline.com", "participants_count": 0, "title_full": "Weather forces USC staff from stadium", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T13:11:00.000+03:00", "replies_count": 0, "uuid": "0482548bbd24520b1654d7dc452a11c52abc4e8b"}, "author": "", "url": "http://www.greenvilleonline.com/story/sports/college/clemson/2015/10/05/dodd-goodson-honored-acc/73382540/", "ord_in_thread": 0, "title": "Weather forces USC staff from stadium", "locations": ["South Carolina", "Columbia", "Missouri", "Mo."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Willie T. Smith III", "G. Patterson", "Steve Spurrier", "L.G. Patterson"], "text": "Weather forces USC staff from stadium The Columbia floods force Steve Spurrier to evacuate Williams-Brice Post to Facebook Weather forces USC staff from stadium The Columbia floods force Steve Spurrier to evacuate Williams-Brice Check out this story on greenvilleonline.com: http://grnol.co/1Rqqfcr Cancel Send A link has been sent to your friend's email address. Posted! A link has been posted to your Facebook feed. Join the Conversation Willie T. Smith III , wtsmith@greenvillenews.com 6:11 a.m. EDT October 5, 2015 South Carolina head coach Steve Spurrier argues a call during the first quarter of an NCAA college football game against Missouri Saturday, Oct. 3, 2015, in Columbia, Mo. (AP Photo/L.G. Patterson) (Photo: L.G. Patterson, AP) 6 CONNECT 3 TWEET LINKEDIN COMMENT EMAIL MORE \nCOLUMBIA – The flood in Columbia affected South Carolina coach Steve Spurrier and his staff on Sunday. \nThe staff was forced to leave Williams-Brice Stadium due to the floods in downtown Columbia. \n“A bunch of us coaches were able to get in this morning to the stadium to watch the game tape before we were told to get out of town (go home),” said Spurrier. “We left about 11:30 a.m., something like that. \n“But, hopefully, these waters will get out of here as soon as possible and our city can return to normal.” \nSpurrier said he and the remainder of the staff made it home safely and everyone appeared to be fine. \n“A lot of guys live in town. Shawn Elliott lives right off that Gills Creek so he is probably in more danger than any of us where his house is. \n“They think it is going to recede, hopefully, in a day or two. I think we’ll be able to get in (Monday) morning. We’ll just have to wait and see.” \nSpurrier doesn’t believe practice for Saturday’s home game against LSU will be affected. \nWhat he saw on film, however, was virtually the same think he witnessed Saturday against Missouri. \nHe said freshman quarterback Lorenzo Nunez did not play as well as in his first start against Central Florida, but will need some help. \n“Lorenzo, for his first game, he took some steps, he looked downfield and threw the ball,” said Spurrier. Unfortunately, (Saturday), at times he didn’t quite look downfield and he just took off. That’s a freshman playing in sort of a passing offense for the first time. \n“He makes some beautiful runs, I tell you what. He was out leading rusher again, I think. We’ve got to get the running backs involved. We’ve got to block better. We’ve got to run better. We’ve got to do a lot of things better. \n“The offense can’t just depend on the quarterback run.” \nNOTE…Spurrier said running back Brandon Wilds is expected to return to action against LSU and the trainers believes Nunez’s shoulder will be fine. \nIf that is the case, he said the freshman will continue to start. 6 CONNECT 3 TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http://grnol.co/1Rqqfcr TOP VIDEOS", "external_links": [], "published": "2015-10-05T13:11:00.000+03:00", "crawled": "2015-10-05T21:46:21.955+03:00", "highlightTitle": ""}