{"organizations": [], "uuid": "785b3cf21637406dff10ace81b02cd3962f91867", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/49333020.cms", "site_section": "http://timesofindia.indiatimes.com/Sports/More-sports/Shooting/articlelist/3413165.cms", "section_title": "Shooting - More sports - Sports - The Times of India", "url": "http://timesofindia.indiatimes.com/india/Sri-Lankan-navy-arrests-24-Tamil-Nadu-fishermen/articleshow/49333000.cms", "country": "IL", "title": "Sri Lankan navy arrests 24 Tamil Nadu fishermen", "performance_score": 0, "site": "indiatimes.com", "participants_count": 4, "title_full": "Sri Lankan navy arrests 24 Tamil Nadu fishermen - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T19:07:00.000+03:00", "replies_count": 4, "uuid": "fffdc6dde5fe1fcfe23b05c35436e9e991ebd1e3"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/india/Sri-Lankan-navy-arrests-24-Tamil-Nadu-fishermen/articleshow/49333000.cms#post-0", "ord_in_thread": 0, "title": "Sri Lankan navy arrests 24 Tamil Nadu fishermen", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "RAMESWARAM: The Sri Lankan navy on Tuesday arrested 24 fishermen from and also chased away at gun point several others for allegedly fishing in Lankan waters near Katchatheevu in the Palk Straits.\nMore then 3,000 fishermen in 600 boats had put out to sea from here last night. The Lankan navy personnel came in 10 patrol boats and sea bikes, threatened the fishermen and arrested 24 of them besides chasing away others at gun point, fishermen organisation leaders S Emerite and Sagayaraj said.\nThe fishermen were fishing near Katchatheevu in Palk Straits, they said claiming the fishermen were fishing in traditional waters.\nOn October 10, the navy personnel had arrested 19 fishermen from Nagapattinam district on charges of violating the International Maritime Boundary Line prompting Tamil Nadu Chief Minister Jayalalithaa to write to Prime Minister Narendra Modi urging him to take up the continued arrests of state's fishermen at a high political level with Sri Lanka.\nIn another instance on October 2, seven fishermen from Rameswaram had been arrested by Sri Lankan naval personnel off Katchatheevu islet for allegedly crossing the IMBL and fishing in their waters.\nEmirite said the livelihood of fishermen would be hit hard if the Sri Lankan navy continued the arrests besides threatening them while fishing in traditional waters. He also wanted the Centre and state governments to take necessary steps to prevent such incidents. Stay updated on the go with Times of India News App. Click here to download it for your device.", "external_links": ["https://play.google.com/store/apps/details?id=com.toi.reader.activities"], "published": "2015-10-13T19:07:00.000+03:00", "crawled": "2015-10-13T09:54:33.941+03:00", "highlightTitle": ""}