{"organizations": [], "uuid": "04d04336fa9a10611903dc67a20b16403256b5b9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mercurynews.com", "main_image": "http://local.mercurynews.com/common/dfm/assets/logos/1200x627/mercurynews.png", "site_section": "http://feeds.mercurynews.com/mngi/rss/CustomRssServlet/568/200904.xml", "section_title": "Other Sports", "url": "http://www.mercurynews.com/sports/ci_28989085/sports-digest-idle-earthquakes-mls-playoff-hopes-dim?source=rss", "country": "IL", "title": "Sports digest: Idle Earthquakes' MLS playoff hopes dim", "performance_score": 0, "site": "mercurynews.com", "participants_count": 1, "title_full": "Sports digest: Idle Earthquakes' MLS playoff hopes dim", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T08:16:00.000+03:00", "replies_count": 0, "uuid": "04d04336fa9a10611903dc67a20b16403256b5b9"}, "author": "Associated Press", "url": "http://www.mercurynews.com/sports/ci_28989085/sports-digest-idle-earthquakes-mls-playoff-hopes-dim?source=rss", "ord_in_thread": 0, "title": "Sports digest: Idle Earthquakes' MLS playoff hopes dim", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sports digest: Idle Earthquakes' MLS playoff hopes dim Associated Press Posted: 10/18/2015 07:38:04 PM PDT Updated: 10/18/2015 07:38:05 PM PDT The Earthquakes' slim hopes of qualifying for the MLS playoffs took another hit Sunday with the Portland Timbers' rout of the Los Angeles Galaxy and the Seattle Sounders' 1-1 tie with Houston. \nPortland leapfrogged into a third-place tie in the Western Conference with its 5-2 win, and the Sounders moved into a tie with Sporting Kansas City for the final two conference playoff berths. \nThe idle Quakes fell to seventh. They are one point out of sixth with one game remaining, but will be eliminated with a loss and have a less-favorable schedule than the three teams they are chasing. \nSan Jose ends the regular season Sunday at division champion Dallas. Portland and Seattle also have one match left -- home games against last-place Colorado and ninth-place Real Salt Lake, respectively. Sporting Kansas City has two games left; both at home and the first against Colorado. \nIn other MLS matches: Mike Grella scored in 7 seconds for the fastest goal in MLS history, and the New York Red Bulls beat the Philadelphia Union 4-1 to earn the top seed in the Eastern Conference playoffs. ... D.C. United beat Chicago 4-0 to move into second place in the East. Sailing Advertisement Artemis Racing of Sweden rebounded from a pre-race collision with an umpires boat to win the second of three races Sunday and claim the overall championship of the America's Cup World Series stop in Bermuda. Artemis finished with 52 points, two ahead of Emirates Team New Zealand, which won the third race. Two-time defending America's Cup champion Oracle Team USA, which won the first race, was third. \nEmirates Team New Zealand, which lost to Oracle in the 2013 America's Cup on San Francisco Bay, won the season series, with Oracle in second and Land Rover BAR in third. Golf Lexi Thompson closed with a 3-under 69 to beat Yani Tseng and Sung Hyun Park by a stroke in the LPGA KEB Hana Bank Championship. Lydia Ko missed a chance to take the top spot in the world from Inbee Park, finishing with a 72 that dropped the 18-year-old into a tie for fourth at 13 under with Amy Yang and Gerina Piller. Yang birdied the final nine holes for a 62. She tied the LPGA Tour record for consecutive birdies. \nBernhard Langer rallied to win the San Antonio Championship for his second victory of the year and 25th overall on the Champions Tour. He birdied the final two holes for a three-stroke victory over Scott Dunlap. Langer won after losing playoffs in the event in 2012 and 2013. \nJohn DalCorobbo won the Senior PGA Professional National Championship in Seaside. DalCorobbo closed with a 3-under 69 for a one-stroke victory over PGA Tour winner Jim Carter. Horse racing California Chrome, last year's Kentucky Derby and Preakness winner, could return to racing early next year at Santa Anita. Trainer Art Sherman says last year's Horse of the Year might run in the San Pasqual Stakes on Jan. 9. The 4-year-old colt had been recovering the last few months from a bone bruise injury.", "external_links": [], "published": "2015-10-19T08:16:00.000+03:00", "crawled": "2015-10-19T08:42:52.604+03:00", "highlightTitle": ""}