{"organizations": ["Associated Press", "Vikings Vikings"], "uuid": "3ed70972cf4c4db91b2f63ab7443752b252c019e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pendletontimespost.com", "main_image": "", "site_section": "http://pendletontimespost.com//feed/sec/6000/", "section_title": "PendletonTimesPost.com - Sports News", "url": "http://www.pendletontimespost.com/view/story/fbcd9efd3f854b6a904d52635151cefb/FBN--Vikings-Munnerlyn/", "country": "US", "title": "Munnerlyn thriving in 2nd season with Vikings", "performance_score": 0, "site": "pendletontimespost.com", "participants_count": 0, "title_full": "Munnerlyn thriving in 2nd season with Vikings", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T04:24:00.000+03:00", "replies_count": 0, "uuid": "3ed70972cf4c4db91b2f63ab7443752b252c019e"}, "author": "", "url": "http://www.pendletontimespost.com/view/story/fbcd9efd3f854b6a904d52635151cefb/FBN--Vikings-Munnerlyn/", "ord_in_thread": 0, "title": "Munnerlyn thriving in 2nd season with Vikings", "locations": ["Minnesota"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["BRIAN", "Munnerlyn"], "text": "Vikings' Captain Munnerlyn becomes a vital piece in secondary in his 2nd season in Minnesota By BRIAN HALL Associated Press   9:23   9:24   \nPeople: \nMinnesota (434) \n\nEDEN PRAIRIE, Minnesota — Captain Munnerlyn walked toward the line of scrimmage and patted the top of his helmet, recognizing what he had seen on film. \nMunnerlyn, the cornerback in his second season with the Minnesota Vikings, diagnosed the play quickly and fought through a block as soon as Kansas City snapped the ball, tackling receiver Jeremy Maclin for a 2-yard loss and leaving the Chiefs at their 2 in Minnesota's 16-10 victory Sunday. \nThose types of plays that were missing too often last season are becoming more common for Munnerlyn. After rededicating himself in the offseason, the seven-year veteran has become a vital piece of the secondary, even as his playing time has decreased. \n\"I know how to work in this system, so I'm doing a whole lot better job of understanding things and going out there competing,\" Munnerlyn said. \"That's what I like to do, I'm a competitor. So I go out there and try to make some plays.\" \nMunnerlyn went from a prized free-agent signing to a player many wondered if he would see the second season of his contract after a poor 2014 season. \nSigned to be the veteran leader of a young secondary, Munnerlyn never meshed with coach Mike Zimmer's schemes and techniques and often reverted to what he was familiar with in Carolina. The approach caught the ire of Zimmer and the two sides admitted to a level of disconnect as the team departed for the offseason. \nMunnerlyn, who signed a three-year, $11.25 million contract, changed teams for the first time in his NFL career and the adjustment proved to be more of a challenge than Munnerlyn expected. \n\"It was definitely new to me,\" Munnerlyn said. \"I don't make excuses for my poor play last year or things like that, because I'm not a guy that makes excuses. But I just had to go out there and reevaluate myself in the offseason. Reevaluate myself and get locked back in. That's something I did this offseason.\" \nZimmer has seen a player more in tune with what the coach is trying to accomplish. \n\"He's doing what I ask him to do pretty much, Zimmer said. \"He's trying to do everything we ask him to do and that's important. I think he's studying better. I think he's understanding the things that we're trying to get done. \nZimmer added: \"That happens a lot with free agent guys, to be honest with you. They come from a different system, especially if they're an older guy, they come in and they may not play as well their first year in your system. But they tend to figure it out the second year, usually.\" \nNotes: CB Josh Robinson returned to practice for the first time since tearing a pectoral muscle lifting weights in the offseason. Robinson has been on the physically unable to perform list and Minnesota has three weeks to make a roster move, though Robinson's not expected to play this week. ... DE Everson Griffen is still out with an illness that caused him to be deactivated before Sunday's game. Zimmer said Griffen was having more tests done on Wednesday. ... Zimmer clarified that DT Shamar Stephen was placed on injured reserve on Tuesday because of a broken foot. The team signed Kenrick Ellis to replace him on the roster. \nOnline: \nAP NFL websites: http://www.pro32.ap.org and http://www.twitter.com/AP_NFL \nAll content copyright ©2015 Pendleton Times-Post, a division of Home News Enterprises unless otherwise noted.", "external_links": [], "published": "2015-10-22T04:24:00.000+03:00", "crawled": "2015-10-22T05:11:00.968+03:00", "highlightTitle": ""}