{"organizations": [], "uuid": "634ae4acf9269c55498925544418956a25c01866", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kctv5.com", "main_image": "http://images.worldnow.com/AP/images/9092690_G.jpg", "site_section": "http://kctv5.com//category/208603/sports?clienttype=rss", "section_title": "KCTV Kansas City - Sports", "url": "http://www.kctv5.com/story/30342413/playoff-pulse-utah-florida-state-fall-to-unranked-teams", "country": "US", "title": "Playoff pulse: Utah, Florida State fall to unranked teams", "performance_score": 0, "site": "kctv5.com", "participants_count": 1, "title_full": "Playoff pulse: Utah, Florida State fall to unranked teams - KCTV5", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T03:00:00.000+03:00", "replies_count": 0, "uuid": "634ae4acf9269c55498925544418956a25c01866"}, "author": "cbs8", "url": "http://www.kctv5.com/story/30342413/playoff-pulse-utah-florida-state-fall-to-unranked-teams", "ord_in_thread": 0, "title": "Playoff pulse: Utah, Florida State fall to unranked teams", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By RALPH D. RUSSO\nAP College Football Writer Scratch No. 3 Utah and No. 9 Florida State off the list of unbeaten teams chasing a spot in the College Football Playoff.\nBoth the Utes and Seminoles were knocked off Saturday by unranked foes; Utah in resounding fashion and Florida State in a stunning finish that rivaled Michigan State's miracle last week and Auburn's 2013 Kick-6.\nThe Utes were drubbed by USC 42-24, ending one of the most surprising rises of this season. Utah started unranked but was the only unbeaten team in the Pac-12 heading into the second half of the season.\nThe Utes (6-1) have been winning with excellent special teams, opportunistic defense and a strong running game. They had earned all the praise they had been getting and even made a good case to be the No. 1 team in the country.\nBut even with all the success, Utah never looked like a dominant team. Against a talented but underachieving USC squad, the Utes couldn't keep up.\n\"In my opinion, that's the best team we have played all year long, for certain from a personnel standpoint,\" Utah coach Kyle Whittingham said.\nUtah is still in control of the Pac-12 South race, but there is potential for some serious cannibalization in that division. Both the Utes and Trojans still have to play UCLA.\nFor Florida State (6-1), the end of its perfect season was shocking. Georgia Tech returned a blocked field goal on the last play of regulation for a touchdown to beat the Seminoles 22-16. The Yellow Jackets had lost five in a row.\n\"We still have a chance to be a very good football team,\" Seminoles coach Jimbo Fisher said. \"A lot of our goals are still out there. Our main goal is to try and be the best we can be. That hasn't been there.\"\nThe loss takes some of the luster off what is likely to still be the biggest game in the Atlantic Coast Conference this season. Florida State goes to No. 6 Clemson (7-0) on Nov. 7. It's a game that could still decide the Atlantic Division, but instead of determining the ACC's leading playoff contender, it could help knock the conference out of the playoff altogether.\nThe Tigers are still unbeaten after crushing Miami 58-0.\nDeshaun Watson and the Tigers have already beaten Notre Dame, but the rest of their schedule beyond the Seminoles provides little chance to catch the playoff selection committee's attention - unless they are blowing out teams. Clemson has won its last three games by a combined 135-41.\nThat'll work.\nUnbeaten will likely be enough to get any Power Five conference team into the playoff, though one-loss teams such as No. 8 Alabama, No. 17 Oklahoma and No. 10 Stanford might change that.\nThe first playoff rankings come out Nov. 3, a few days before a showdown games between LSU and Alabama, and the still-very-important Clemson-Florida State game. The committee showed last year with Florida State that it is willing to place an unbeaten team behind one with a loss if that undefeated team hasn't been overwhelming.\nSo far Clemson is doing its best to avoid a similar fate.\n___\nBAMA ESCAPES\nAlabama finished a grueling stretch with a great escape.\nThe Crimson Tide held off Tennessee 19-14 at home to win its fourth Southeastern Conference game in four weeks. Alabama now gets a week off before hosting No. 5 LSU.\nThe Tide has won five straight overall since losing to Mississippi, looking every bit the playoff contender. Alabama won at Georgia, against Arkansas and at Texas A&M by a combined 106-47. Nick Saban's team had to work much harder to extend its winning streak against the Vols to nine, but be careful about trying to ding the Tide for a close victory at the end of a tough stretch.\nThe Tide has some offensive limitations, but the defensive front is as good as any in the country and running back Derrick Henry alone gives them a reliable weapon.\nAlabama (7-1) still needs help just to get to the Southeastern Conference title game in the form of an Ole Miss loss.\nThat didn't come Saturday. The 24th-ranked Rebels beat No. 15 Texas A&M 23-3 in Oxford, Mississippi.\nThe Rebels success is not good news for the SEC's playoff hopes. A two-loss Ole Miss team - with a loss to Memphis - as SEC champ could very well leave the conference out of the playoff.\n___\nREBOUNDING SOONERS\nIt was tempting to count out No. 17 Oklahoma after the Sooners stumbled against Texas in the Red River Rivalry two weeks ago.\nAfter a second straight blowout, the Sooners are creeping back into the playoff conversation.\nOklahoma beat Texas Tech 63-27 on Saturday, a strong follow-up to its 55-0 victory at Kansas State last week.\nBaker Mayfield and the Sooners play Kansas and Iowa State next before finishing the season at No. 2 Baylor, against No. 4 TCU and at No. 14 Oklahoma State.\nWhen considering the best one-loss teams, the Sooners need to be in the mix.\n___\nAP college football website: collegefootball.ap.org\nCopyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-24T03:00:00.000+03:00", "crawled": "2015-10-25T08:43:33.651+02:00", "highlightTitle": ""}