{"organizations": [], "uuid": "bd94d78d135c31cc6c5d36ed3be169ab84e1374d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thenewstribune.com", "main_image": "http://www.thenewstribune.com/sports/nfl/seattle-seahawks/cl4tr3/picture38550036/ALTERNATES/LANDSCAPE_1140/AP_288324677530", "site_section": "http://www.thenewstribune.com/sports/?widgetName=rssfeed&widgetContentId=712015&getXmlFeed=true", "section_title": "College & professional Sports news | TheNewsTribune.com &", "url": "http://www.thenewstribune.com/sports/nfl/seattle-seahawks/article38550039.html", "country": "US", "title": "Marshawn Lynch out for Sunday’s game at Cincinnati", "performance_score": 0, "site": "thenewstribune.com", "participants_count": 1, "title_full": "Marshawn Lynch out for Sunday’s game at Cincinnati", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T06:09:00.000+03:00", "replies_count": 0, "uuid": "bd94d78d135c31cc6c5d36ed3be169ab84e1374d"}, "author": "GREGG BELL \nStaff writer", "url": "http://www.thenewstribune.com/sports/nfl/seattle-seahawks/article38550039.html", "ord_in_thread": 0, "title": "Marshawn Lynch out for Sunday’s game at Cincinnati", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "October 9, 2015 Marshawn Lynch out for Sunday’s game at Cincinnati Seahawks running back Marshawn Lynch did not travel with the team to Cincinnati on Friday and will miss his second consecutive game. It is just the third game in five seasons Lynch will miss. Elaine Thompson The Associated Press i \nWonder what Marshawn Lynch is going to be doing on the West Coast this weekend. \nBecause he isn’t going to be playing for the Seahawks on Sunday in Cincinnati. \nLynch didn’t even get on the team plane to Ohio on Friday afternoon. That was a couple hours after Seattle declared the foundation of its offense out for the second consecutive game with a strained hamstring. Coach Pete Carroll said the injury has improved, but it’s not worth the risk of re-injuring this weekend. \nThe 29-year-old Lynch will in the span of six days miss twice as many games as he had in his first five seasons with the Seahawks combined. \nInstead of boarding one of the team’s buses to SeaTac Airport following Friday’s light indoor practice he missed, Lynch was in the lobby of team headquarters greeting VIPs that were making the trip without him. He got hurt catching a fourth-down pass in the second quarter of the Sept. 27 win against Chicago. \n“He actually did a little bit of work,” coach Pete Carroll said Friday of Lynch returning to practice on a limited basis Thursday for the first time since Sept. 24. “He is running very well. However, it’s just two weeks now. He’s just getting over it. \n“We’ve seen some guys around the league try to come back. He could try to come back and play, but we think he’d be vulnerable. He needs another weekend to get through it, and then by next week, by Wednesday or something, we can get him going again. So we are just about over the hump.” \nCarroll called Lynch’s hamstring strain “legit,” adding “that means there’s some tissue that’s damaged.” \n“You’ve just got to wait it out,” Carroll said. “He’s very close, but we can’t guarantee that he can make it through the game. That means we could get set back again, so we’re just going to wait it out and see if we can get him right next week (for the home game against Carolina).” \nSo Thomas Rawls is likely to get a second consecutive start at lead back against the Bengals. Rawls rushed for 104 yards on 16 carries against the Bears the day Lynch got hurt, then struggled to 48 yards on 17 carries against the winless Lions. \nFred Jackson sustained a high-ankle sprain Monday when a 300-plus-pound defensive tackle from Detroit fell on the back of his right leg. Yet Carroll said he expects the 34-year-old third-down back and Lynch’s good pal to be able to play against the Bengals six days after the injury. \nThat is kind of crazy. \n“Fred had a fantastic recovery. ... He’s going and we think he’s going to make it,” Carroll said. “He’ll have to work out on game day, but he looks really good and we think he’s going to be able to play. \n“It’s just unusual ... way ahead of schedule. You can’t figure out how he’s doing it ... it’s a miraculous recovery.” \nCarroll didn’t rule out adding another running back to the roster if Jackson ends up not being able to play Sunday, but the team would have to change its gut feeling about him soon to do so. The Seahawks would need to make any move by 10 a.m. Pacific Time Saturday for that addition to be able to play at Cincinnati. PATRICK LEWIS TO CENTER? \nAsked if his besieged offensive line will remain intact with the same five starters against the Bengals, Carroll said: “Yes.” \nHe paused for a few seconds and added, “for the most part.” \nThen the coach smiled. \nPatrick Lewis started four games late last season when since-traded Max Unger was hurt. He could replace first-year starter Drew Nowak at center on Sunday against Cincinnati’s aggressive defensive front. \nSeattle has allowed Russell Wilson to be sacked 18 times in four games. By comparison, the Bengals’ Andy Dalton’s been sacked just twice this season. \n“Yeah, Patrick could play,” Carroll said. “He’s ready to go.” \nCarroll said the line has made some internal changes this week. \n“Well, we have done some things. But, those are adjustments and things that we’ve made that aren’t worth reporting. I appreciate you asking,” Carroll said. “We have done some things and hopefully we’ll see our play pick up.” EXTRA POINTS \nCarroll said defensive back Marcus Burley ’s surgery Thursday on his broken thumb went well and that he should be back playing nickel in three weeks. … Brandon Mebane practiced all week. The nose tackle is good to go for Sunday after missing the Lions game with a strained groin. … Reserve CB Tharold Simon just can’t get on the field. He remains out with a broken toe, and there is a possibility he could go on injured-reserve if he doesn’t progress. … Usual safety Steven Terrell may play Sunday at cornerback because of the depth issues there. \nSUNDAY: Seattle (2-2) at Cincinnati (4-0), \n10 a.m., Ch. 13, 710-AM, 97.3-FM, 1030-AM Related content", "external_links": [], "published": "2015-10-10T06:09:00.000+03:00", "crawled": "2015-10-10T21:56:39.070+03:00", "highlightTitle": ""}