{"organizations": [], "uuid": "d8b54e3c4d203b129ce9a11dbad2d24a9f49f93f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.torontosun.com", "main_image": "http://storage.torontosun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297764286810_LARGE_BOX.jpg?quality=80&stmp=1445818665429&size=100x", "site_section": "http://www.torontosun.com/sports/rss.xml", "section_title": "Top Sports stories", "url": "http://www.torontosun.com/2015/10/25/breaking-down-world-series-matchup-from-scouts-perspective", "country": "CA", "title": "Breaking down World Series matchup from scout's perspective", "performance_score": 0, "site": "torontosun.com", "participants_count": 0, "title_full": "Breaking down World Series matchup from scout's perspective", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T01:05:00.000+02:00", "replies_count": 0, "uuid": "d8b54e3c4d203b129ce9a11dbad2d24a9f49f93f"}, "author": "", "url": "http://www.torontosun.com/2015/10/25/breaking-down-world-series-matchup-from-scouts-perspective", "ord_in_thread": 0, "title": "Breaking down World Series matchup from scout's perspective", "locations": ["KANSAS CITY"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "KANSAS CITY - \nThe 111th World Series begins on Tuesday night at Kauffman Stadium. \nIt isn’t a match made in post-season heaven as the New York Mets and the Kansas City Royals have little history. Well, OK, tiny history. They have met three time during 19 years of inter-league series: Aug. 2-4, 2013, at Citi Field in Flushing, June 11-13, 2004 at Kauffman Stadium and in June 2002 at Shea Stadium. \nDespite that fact, the Sun’s official post-season prognosticator, former scout Ken Bracey, is putting his 1-1 record on the line — after picking the Jays in both of their series — and going with the Royals, who just knocked off Toronto in six games. \n“The team with the best position players is K.C.,” said Bracey from Dunlap, Ill. “The team with the best pitching staff is the Mets. \n“I pick the Royals because of their experience.” \nThe Royals lost in seven games to the San Francisco Giants in last year’s World Series. \nBracey cautions against wagering on this one, however, adding that “if those first three Mets starters pitch like they did against the Cubs, the Royals will have troubles.” \nBracey headed south in 1956 after signing with the New York Yankees organization, pitching nine seasons in the minors for the Yankees and San Francisco Giants. \nHe read in Sports Illustrated about how the Royals noticed David Price’s breathing patterns (a deep sigh meant he was not going to throw anything hard). \n“Yeah, for the 1984 World Series, we had that Willie Hernandez opened up only when he threw his screwball,” said Bracey, who worked for the San Diego Padres at the time. “I don’t think we got a hit off him the whole time. \n“The whole Toronto-K.C. series probably came down to that botched ball,” he added, referring to Ben Zobrist’s shallow fly ball to right field in Game 2 that dropped between Ryan Goins and Jose Bautista and ignited a game-winning rally for the Royals. \nLast year was Bracey’s 47th year scouting. He worked for the Giants (1968), Padres (1969-86, 1991-2009), Milwaukee Brewers (1987-90) and the Dodgers (2010-14). \nWhile the World Series does not come down to which left fielder gets the most hits, a position-by-position breakdown is always one way of examining the two teams. \nAnd now for our 26th annual post-season matchups complete with players’ stats, Bracey’s comments and his ratings out of 10: \nCATCHER \nMets: Travis d’Arnaud (.268, 12, 41, .825) “This guy doesn’t look like a good hitter but he can hit a mistake and put a charge into it. He handles an excellent staff well, his staff is around the plate but they all throw hard and he handles them. He’s a heck of a lot larger than he looks.” \nRoyals: Salvador Perez (.260, 21, 70, .706) “He is in Yadier Molina’s class and a clutch hitter. He used the whole field. He’s hitting in a good spot in the lineup. He can’t carry a club but down there (hitting seventh) but he can so some damage.” \nRating: Perez 8, d’Arnaud 7. \nFIRST BASE \nMets: Lucas Duda (.244, 27, 73, .838). “If you watched the Mets against the Cubs, that’s the guy he is: a strong guy with good power, but he can be pitched to. On TV you hear guys say: ‘Oh, he’s not hitting right now.’ That’s because they’re pitching guys well. The last game against the Cubs, he got something to hit. He’s a solid first baseman.” \nRoyals: Eric Hosmer (.297, 18, 93, .822). “One of the better players in either league. He’s good against right-handed pitching. You have to made good pitches when it’s left on left. He’s a solid defensive player. Long as he doesn’t get hurt, he’s going to be a great player for a long, long time. \nRating: Hosmer 8, Duda 6 \nSECOND BASE \nMets: Daniel Murphy (.281, 14, 73, .770) “He’s like Babe Ruth now, but I might be light. He always looked like he could hit, not with this power. He’s never had a position — left field one day, third base the next. He’s not a great second baseman, but they finally found a position for him. He has a big chest and is not far from first. I imagine he’ll hit home runs, he might hit two or three more.” \nRoyals: Ben Zobrist (.276, 13, 5, 6, .809). “He’s going to get a ton of money (as a free agent). There’s no reason if you want a position player, why you wouldn’t make him an offer. Great family, great makeup. He’s a perfect fit in K.C., as a No. 2 hitter — not fourth as he was with Tampa Bay.” \nRating: Murphy 8, Zobrist 8. \nTHIRD BASE \nMets: David Wright (.289, five, 17, .814) “If Wright gets on between those two left-handed hitters (Curtis Granderson and Murphy), the Mets have a great chance. Granderson and Murphy get on a lot. Wright is not a good hitter any more. Sometimes he has a good idea of the zone, sometimes he does not. Average with the bat. Good defensively.” \nRoyals: Mike Moustakas (.284, 22, 82, .817) “Much more dangerous that Wright and just as good at third. He might not have Wright’s leadership. Moustakas used to want to pull everything, but he’s figured it out. Now, he’s a good all-around player.” \nRating: Wright 6, Moustakas 6. \nSHORTSTOP \nMets: Wilmer Flores (.263, 16, 59, .703): “Not near the player (Alcides) Escobar is. He gets more hits than I think he’s going to when I see him coming to the plate. He doesn’t look like a hitter. He doesn’t scare me, but not a bad shortstop.” \nRoyals: Alcides Escobar (.257, 26, 75, .614): “Getting better all the time. He killed Toronto. He won’t hit like that against the Mets. He’s going to have a great career if he stays healthy. ” \nRating: Escobar 7, Flores 5. \nLEFT FIELD \nMets: Michael Conforto (.270, nine, 26, .841) “Everyone says he’s the left fielder of the future. Sometimes he looks overmatched. He’s just a kid. The Cubs didn’t throw him any strikes a couple of games I saw. He’s young to have that much pressure on him. He hasn’t stepped up.” \nRoyals: Alex Gordon (.271, 13, 48, .809) “I’m not sure he’s completely healthy. He’s better off than Troy Tulowitzki. That was a shame he was injured. Gordon is a very good outfielder. He bears watching. As good a left fielder as I’ve ever seen — when healthy.” \nRating: Gordon 6, Conforto 5. \nCENTRE FIELD \nMets: Yoenis Cespedes (.291, 35, 105, .870) “He’s a mistake hitter with big-time power. If you can pitch to him and stay ahead, then no problem. If you are going to throw him meatball fastballs, you are going to lose. He hits the ball as hard, or harder, than anyone. He likes the ball middle in, He’ll chase up, he’ll chase down. If you throw it where he can reach, extra bases. He’s the reason the Mets are here.” \nRoyals: Lorenzo Cain (.307, 16, 72, .838, 28 steals) “He played against Toronto like he played against everyone else. He hustles and improves. He has improved so much the past two years. He went from everyday guy to star. He scored twice on singles from first base — no one does that. One of the better players in either league.” \nRating: Cain 8, Cespedes 7, \nRIGHT FIELD \nMets: Curtis Granderson (.259, 26, 70, .821) “Every at-bat he gives you is his best. He and Cain have similar attitudes. He’ll strike out, but he’s an aggressive leadoff hitter. He had to get on for the Mets to win. He has a chance. Will steal a base.” \nRoyals: Alex Rios (.255, 15, 67, .640) “Like the last game against Toronto, if you can’t get him out you are going to lose. Toronto didn’t get him out. Toronto lost. He’s a good average player nowadays. They talk about how fast he runs. He doesn’t run that fast when I am in the park.” \nRating: Granderson 7, Rios 6 \nDH \nMets: Kelly Johnson (.265, 14, 47, .750) or Michael Cuddyer (.259, 10, 41, .699): “This isn’t going to be to the Mets advantage. They got more out of Johnson than a lot of people expected. I know Cuddyer has been hurt, but he’s a veteran guy. He could muscle up.” \nRoyals: Kendrys Morales (.290, 22, 106, .847) “Dead mistake hitter — they aren’t coming back. He’s like Kyle Schwarber of the Cubs. Problem is Schwarber was drafted by an NL team. Morales is the right fit here. Above-average DH because of the power he displays from both sides.” \nRating: Morales 7, Cuddyer 4, Johnson 4. \nSTARTERS \nMets: Matt Harvey (13-8, 2.71), Jacob deGrom (14-8, 2.54), Noah Syndergaard (9-7, 3.24) and Steven Matz (4-0, 2.27) “Not bad this year. Not bad next year. And not bad for a few years and they are missing Zack Wheeler who is injured. The first three if they are on ... well not even K.C., is going to score many runs. When you throw 97-98 mph and stay down in the zone, not many guys get hits down there.” \nRoyals: Edison Volquez (13-9, 3.55), Yordano Ventura (13-8, 4.08), Johnny Cueto (11-13, 3.44) and Chris Young (11-6, 3.06) “Volquez gets his breaking ball over better than he did a year or so ago. Ventura is still a thrower. I’m not sure which Cueto will show up. Neither are the Royals. Young competes like heck. The first three starters will keep you in the game. It’s a good rotation, not great.” \nRating: Mets 8, Royals 7. \nCLOSER \nMets: Jeurys Familia (2-2, 1.85, 43 saves) “This guy has been very impressive. He goes out and throws pitches sometimes that he doesn’t need to throw. Why throw your secondary stuff when you can overpower hitters? I like him a lot. He’s down, always down in the zone.” \nRoyals: Wade Davis (8-1, 0.94, 17 saves) “He did OK pitching out of the first-and-third, none-out jam in the ninth. Like I said before the ALCS, there is no chance of back-to-back hits off him. Maybe one, but not back-to-back.” \nRating: Davis 9, Familia 8. \nBULLPEN \nMets: Tyler Clippard (5-4, 2.92, 19 saves), Addison Reed (3-3, 3.38), Bartolo Colon (14-13, 4.16), Jon Niese (9-10, 4.13), Hansel Robles (4-3, 3.67): “They added some guys at the deadline and moved Colon from the rotation to the bullpen.” \nRoyals: Kelvin Herrera (4-3, 2.71), Ryan Madson (1-2, 2.13), Luke Hochevar (1-1, 3.73), Franklin Morales (4-2, 3.18), Kris Medlen (6-2, 4.01), Danny Duffy (7-8, 4.08) “I don’t know if the bullpen is any less deep than a year ago. I like K.C.’s depth in the middle. They have the better arms.” \nRating: Royals 8, Mets 7. \nBENCH \nMets: Juan Lagares (.259, six, 41, .647), Kirk Nieuwenhuis (.208, four, 13, .688), Kevin Plawecki (.219, three, 21, .576) Cuddyer or Johnson: “They’re going to be hurt with four games in the AL park without a legit DH.” \nRoyals: Paulo Orlando (.249, 7, 27, .713), Jarrod Dyson (.250, 2, 18, .691, 26 steals), Drew Butera (.198, one, five, .533), Terrance Gore (.000, 0, 0, .250) “K.C., has some speed in Dyson and Gore. Can the Mets slow that down?” \nRating: Royals 6, Mets 6. Sponsored Links", "external_links": [], "published": "2015-10-26T01:05:00.000+02:00", "crawled": "2015-10-26T02:25:33.062+02:00", "highlightTitle": ""}