{"organizations": [], "uuid": "6f6bab9c51f99eafe921025794b2c7836d99ddf2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "http://images.tribuneindia.com/cms/gall_content/2015/10/2015_10$largeimg20_Tuesday_2015_010312418.jpg", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/nation/customary-child-marriages-prevalent-in-india-study/148275.html", "country": "US", "title": "Customary child marriages prevalent in India: Study", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "Customary child marriages prevalent in India: Study", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "6f6bab9c51f99eafe921025794b2c7836d99ddf2"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/nation/customary-child-marriages-prevalent-in-india-study/148275.html", "ord_in_thread": 0, "title": "Customary child marriages prevalent in India: Study", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Aditi Tandon\nTribune News Service\nNew Delhi, October 19\nPranav (24) had no idea that one day he would become the subject of a physically and emotionally taxing levirate marriage. Despite being married himself, he was compelled by his family to marry his three sisters-in-law after his elder brothers died in a series of accidents. “I was the youngest of my brothers. All of us were married to four sisters in a group wedding. I was 14-year-old at that time. By the time I turned 21, my brothers died in accidents. Between us, we had 14 children. My family was worried who would take care of the children if my widowed sisters-in-law left. So, they pressured me to marry them,” says Pranav, who now has four wives and 14 children and spends sleepless nights figuring out ways of sustaining a family that’s not of his making. Pranav’s is one of the 57 life stories researchers from the Tata Institute of Social Sciences (TISS) have collected as part of their new study of child marriages across eight Indian states—Bihar, Andhra Pradesh, Assam, Madhya Pradesh, Meghalaya, Rajasthan, West Bengal and Telangana. The research, presented at a UNFPA-TISS conference recently, approaches the oft-studied issue through perspectives of child marriage subjects. The study found while all subjects (42 women and 15 men) knew the legal age of marriage (21 for boys and 18 for girls), they acknowledged that rural people had no reverence for the law. A majority of them said biological considerations of age should not determine legal age for marriage; rather the age of completion of education and of getting a job should become the signifiers of preparedness for marriage. Prof S Parasuraman, Director, TISS, says the Prohibition of Child Marriage Act-2006 does not appear to have made much of a difference. “The only difference we found is instead of marrying girls off before 15 years, parents are marrying them off between 15 and 18,” he said. The study also found widespread prevalence of customary marriage practices like atta-satta in Rajasthan where one family marries off a pair of minor siblings to a similar pair from another family to equalise the dowry burden; Dham in Bihar where poor families bring children to marry them off in small groups; Kali Bari in Bengal where young couples routinely elope to Kali Bari temple in Kolkata and tie the nuptial knot to escape parental pressure of arranged weddings. While Pranav is in a levirate marriage, Jyotsna from Mahbubnagar in Telangana was forced into a sororate marriage with her brother-in-law after her elder sister died. Examples of consanguineous weddings among Muslims and some South Indian Hindu communities were also easy to find. The study documents the story of 21-year-old Devi from Andhra’s Kurnool. She was married to her maternal uncle when she was 10. “My parents thought I would be secure with my uncle and he also wanted someone to take care of my ailing grandmother. So we were married,” Devi says.", "external_links": [], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-20T10:18:48.710+03:00", "highlightTitle": ""}