{"organizations": ["Saskatchewan Roughriders"], "uuid": "8af8ab7aa6010cab11290ffb6b9e95099632733d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leaderpost.com", "main_image": "http://www.leaderpost.com/cms/binary/11428990.jpg", "site_section": "http://rss.canada.com/get/?F278", "section_title": "Leader-Post - Sports", "url": "http://www.leaderpost.com/sports/football/roughriders-football/vanstone+playoff+dream+finally+dashed/11428989/story.html", "country": "CA", "title": "Vanstone: Playoff dream finally dashed", "performance_score": 0, "site": "leaderpost.com", "participants_count": 0, "title_full": "Vanstone: Playoff dream finally dashed", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T09:39:00.000+03:00", "replies_count": 0, "uuid": "8af8ab7aa6010cab11290ffb6b9e95099632733d"}, "author": "", "url": "http://www.leaderpost.com/sports/football/roughriders-football/vanstone+playoff+dream+finally+dashed/11428989/story.html", "ord_in_thread": 0, "title": "Vanstone: Playoff dream finally dashed", "locations": ["Hamilton Tiger-Cats"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hamilton", "Peter Power", "Ed Gainey", "Tim Hortons", "Spencer Moore", "Rob Vanstone", "Vanstone"], "text": "By Rob Vanstone, The Leader-Post Ed Gainey of the Hamilton Tiger-Cats, right, battles for a loose ball with the Saskatchewan Roughriders’ Spencer Moore on Oct. 9, 2015 after blocking a punt at Tim Hortons Field. The blocked punt set up a touchdown that helped Hamilton win 30-15. Photograph by: Peter Power , THE CANADIAN PRESS \nREGINA — The Saskatchewan Roughriders have established that they can expedite the development of young quarterbacks — the problem being that they are calling signals for the opposition. \nOne week ago, the B.C. Lions’ Jonathon Jennings threw four touchdown passes and caught a 10-yarder for another major as the Riders fell 46-20 in Vancouver. \nThe Roughriders followed up with another sickly showing on the road, losing 30-15 to the Hamilton Tiger-Cats on Friday. Hamilton’s Jeff Mathews — who, like Jennings, was making his second pro start — threw for 385 yards and three scores. \nBy the time the Riders turned to their young quarterback, Brett Smith, the cause was lost. \nBut, really, we knew that several weeks ago. \nNonetheless, the Riders persisted in dreamily discussing the thinnest of playoff hopes, to the point where it was either sad or comedic (take your pick). \nIf nothing else, Friday’s loss — Saskatchewan’s 12th in succession on the road, dating back to last season — will put an end to the eye-glazing chatter about mathematical possibilities, etc. \nAnd maybe, just maybe, the Roughriders’ 13th loss in 15 games this season will compel the team’s brain trust to finally make a full commitment to the future. \nInterim head coach Bob Dyce kept saying that veteran Kevin Glenn, 36, gave the team its best chance to win — not that a victory would have meant a great deal. \nAgainst B.C., the Roughriders had a mere field goal to show for 11 full possessions with Glenn at the controls of the, er, offence. \nThen came Friday, when a Glenn-led offence failed to score in five possessions as the Riders were en route to trailing 20-0 at halftime (although a missed chip-shot field goal by Paul McCallum did not help matters). \nOnly with the game completely out of hand did Dyce turn to Smith, who threw for 243 yards — including long touchdown strikes to Weston Dressler (79 yards) and Ryan Smith (68 yards). \nOftentimes, it was schoolyard football, with Smith zigging and zagging and dodging and dashing from Hamilton to Ancaster to Burlington and back before locating a receiver. At least it was entertaining. At least there is a modicum of hope with Smith behind centre. \nAt some point — and please accept a columnist’s profuse apologies for having written this 947 times before — the Roughriders have to develop someone who can be an heir apparent to the legendary Darian Durant. \nIs Smith that person? Who knows? But it is time to make every effort to find out. Otherwise, what can be salvaged from the three obligatory games on the Roughriders’ 2015 schedule? \nNow that the painful playoff prattle has mercifully been muted, Smith should start the games that remain. And it wouldn’t hurt to take a look at a prospect named Keith Price, either. \nThis is not intended as a slight against Glenn. After Durant was felled by a ruptured left Achilles tendon midway through the regular-season opener, Glenn’s contributions enabled the offence to keep purring. He did his job, and then some, at a stage of the season when the Roughriders’ hopes had not yet evaporated. \nBut now it is time for an all-out rebuild that coincides with another ambitious construction project. The priority has to be to field a championship-calibre team by the time the Roughriders move into the gleaming Mosaic Stadium 2.0 in 2017. \nSome of the requisite pieces are in place, but not nearly enough. That was all too evident once again on Friday, when the Roughriders reprised their worst side. \nEver a paragon of consistency, Saskatchewan has just lost for the fifth time this season while surrendering precisely 30 points. \nAs easy as it is to obsess about quarterbacking, it should be remembered that the Roughriders’ matador defence has contributed to the team’s woes this season. \nTypically, there were far too many missed tackles — one of which magically transformed what should have been a seven-yard gain into an 87-yard touchdown by Terrell Sinkfield. \nThere was passive coverage (see: Tiquan Underwood’s touchdown) or no coverage at all (see: Luke Tasker’s touchdown). \nTasker happens to be the Tiger-Cats’ best receiver. So why pay any attention to him?", "external_links": [], "published": "2015-10-10T09:39:00.000+03:00", "crawled": "2015-10-10T21:03:06.999+03:00", "highlightTitle": ""}