{"organizations": [], "uuid": "5086daf988203854bfbab77b1ef8259f19d76a31", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.baltimoresun.com", "main_image": "http://www.trbimg.com/img-560f2a05/turbine/ph-cc-sp-fb-winters-mill-liberty-1003-20151002", "site_section": "http://www.baltimoresun.com/sports/high-school/rss2.0.xml#", "section_title": "High School Sports - Baltimore Sun", "url": "http://www.baltimoresun.com/sports/high-school/ph-cc-sp-fb-winters-mill-liberty-1003-20151002-story.html", "country": "US", "title": "Football: Bonomo, big plays boost Lions", "performance_score": 0, "site": "baltimoresun.com", "participants_count": 1, "title_full": "Football: Bonomo, big plays boost Lions", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T03:52:00.000+03:00", "replies_count": 0, "uuid": "5086daf988203854bfbab77b1ef8259f19d76a31"}, "author": "Jake Rill", "url": "http://www.baltimoresun.com/sports/high-school/ph-cc-sp-fb-winters-mill-liberty-1003-20151002-story.html", "ord_in_thread": 0, "title": "Football: Bonomo, big plays boost Lions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Football: Bonomo, big plays boost Lions \nThe Liberty Lions take on Winters Mill in Eldersburg Friday, Oct. 2. (Staff photos by Dave Munch) Jake Rill Contact Reporter Carroll County Times Nick Bonomo had 125 yards and four touchdowns in Liberty's win. \nNick Bonomo was on the sidelines preparing to see Liberty's defense take the field to begin Friday's game against Winters Mill, after his Lions won the coin toss and deferred to the second half. \nA misplayed kickoff by the Falcons and 38 seconds later, Bonomo was scoring the first of his three first-half touchdowns. \nBonomo rushed for four touchdowns and the Liberty defense shut down Winters Mill in a big 35-0 win on a night where heavy rain and high winds forced both teams to keep the ball on the ground most of the game. \n\"We took on the elements and did what we did,\" said Bonomo, who had 125 total yards. \"We game-planned all week for it, we knew it was going to be like this.\" \nWinters Mill let the opening kickoff bounce to the 10-yard line and waited for the ball to roll out of bounds. The problem for the Falcons was that it never did. The Lions started the game with a first-and-goal and two plays later, Bonomo scored from 12 yards out. \nThat was just the beginning for the Liberty senior running back. With 10:57 to go in the second quarter, Bonomo scored for the second time on a 4-yard run, capping a 53-yard drive for the Lions (3-2, 1-1 county). \nThen on the next Liberty possession, Bonomo had his third touchdown of the half on an 18-yard run, putting the Lions up 21-0 with 7:51 until halftime. \n\"We got a big play early and capitalized on it,\" Liberty coach Larry Luthe said. \"It's a bad night with the rain, and when you get momentum like that, you have to run with it, and we were able to run with it. Our kids made some nice plays.\" \nBonomo scored his fourth touchdown on a 1-yard run with 2:31 to go in the third quarter to push the Lions' lead to 28-0. And before the quarter was over, Liberty had a 35-point lead as sophomore Noah Rohrer returned a punt 40 yards for the team's final score of the night. \nMeanwhile, Liberty's defense dominated the Falcons through the first two quarters. Winters Mill mustered 17 yards of offense, struggling to get anything going on the ground or through the air. \nLiberty's Jarrett Pfeifer had an interception off Falcons quarterback Patrick Brown, who completed just one of his six pass attempts in the first half. \n\"Last year's team was very happy being sexy offensively and this team has a tremendous amount of pride in their ability to play defense,\" Luthe said. \"And I think that shows. They just play with pride.\" \nThe Falcons (1-4, 0-2) never got their offense going, and coach Matt Miller said the lack of focus on the opening kickoff led into the offensive struggles. \n\"Ugly, just ugly,\" Miller said. \"It was hard for us to get in a rhythm.\" \nThe Lions were coming off a shutout defeat at the hands of South Carroll, their crosstown rival. After alternating wins and losses through the first five weeks of the season, they'll hope to build some momentum into another home game next week against North Carroll. \n\"Every time we come out here,\" Bonomo said, \"we're looking to get the 'W.'\" \nWinters Mill 0 0 0 0 — 0 \nLiberty 7 14 7 0 — 35 \nSCORING SUMMARY \nL-Nick Bonomo 12 run (Brett Dardzinski kick) \nL-Bonomo 4 run (Dardzinski kick) \nL-Bonomo 18 run (Brendan Bird kick) \nL-Bonomo 1 run (Brett Dardzinski kick) \nL-Noah Rohrer 40 punt return (Bird kick) \nUNOFFICIAL STATISTICS \nRushing \nWM-Patrick Brown 14-47, Glen Acha 11-47, Jason Utz 7-7, Kyle Fisher 1-(-2); L-Nick Bonomo 22-99, Max Kirin 11-24, Zach Soderlund 3-11, Ben Agostino 1-6, Noah Rohrer 1-0. \nPassing \nWM-Brown 2-9-1 0; L-Agostino 13-21-0 166. \nReceiving \nWM-Fisher 1-3, Jake Callahan 1-(-3); L-Kirin 3-55, Bonomo 3-26, Jarrett Pfeifer 3-25, David Downs 2-38, Tyler Bowling 2-22.", "external_links": [], "published": "2015-10-03T03:52:00.000+03:00", "crawled": "2015-10-03T06:57:27.016+03:00", "highlightTitle": ""}