{"organizations": [], "uuid": "6baed74820ad6ab01b881ee88fd23888cec32b2b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kirotv.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/08/07/9a/2c/garbage_barge_am_pitch.jpg", "site_section": "http://www.kirotv.com/", "section_title": "Seattle News, Weather, Traffic, Video and Sports | KIRO 7... | www.kirotv.com", "url": "http://www.kirotv.com/news/news/sorting-marine-debris-waiting-permit-seattle/nn7nG/", "country": "US", "title": "Sorting of marine debris waiting on permit in Seattle", "performance_score": 0, "site": "kirotv.com", "participants_count": 1, "title_full": "Sorting of marine debris waiting on permit in Seattle | www.kirotv.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T17:11:00.000+03:00", "replies_count": 0, "uuid": "6baed74820ad6ab01b881ee88fd23888cec32b2b"}, "author": "kirotv.com", "url": "http://www.kirotv.com/news/news/sorting-marine-debris-waiting-permit-seattle/nn7nG/", "ord_in_thread": 0, "title": "Sorting of marine debris waiting on permit in Seattle", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Organizers of a cleanup along coastlines in Alaska and British Columbia are waiting for authorization to be able to sort through a pile of marine debris that has been delivered to Seattle.\nThe Gulf of Alaska Keeper is one of the main organizations behind the debris cleanup, KMXT-FM reports . The nonprofit's president, Chris Pallister, said Waste Management applied for a permit about two weeks ago to accept the debris into its yard, where it will be sorted.\nPallister said he is not sure how long it will take to get the permit.\nPallister's organization has been working with another group called Parley for the Oceans, which will sort through the debris and recycle it.\n\"They make designer clothing out of it. Any plastic that they can use in their process. I think they're gonna take all the nets and lines and then they get it all and run it through their process and come up with a fiber at the end of it,\" Pallister said.\nThe groups will be able to move the debris into storage and later recycle it once a permit has been issued.\n\"Waste Management's doing their very best to get it sorted out, and they really, truly want to recycle this stuff, so they're going to the extra mile to make it happen and they're providing their yard free of charge and the rest of it, and Parley's putting money into building containment facilities and things like that, so everybody's trying really hard to get this done,\" Pallister said.\nPallister said this is the first time his organization has gone through the process of sorting through a marine debris cleanup. He said they will be more prepared for the process in the future.\n\"I think that even Waste Management didn't realize we'd need a permit and none of us did, of course, and if we knew this, we would have applied,\" he said.\nIn August, a barge the size of a football field carrying debris from the massive Japanese earthquake and tsunami made its way into South Seattle .", "external_links": ["http://w.sharethis.com/button/buttons.js", "http://bit.ly/1KpHTXK"], "published": "2015-10-22T17:11:00.000+03:00", "crawled": "2015-10-22T20:45:44.823+03:00", "highlightTitle": ""}