{"organizations": [], "uuid": "4f2d83c340e81855a8e7966ddd2885d871d6386f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/golf", "section_title": "Golf News, Leaderboard, Schedule, Photos, Videos - MSN Sports", "url": "http://www.msn.com/en-us/sports/golf/holmes-replaces-injured-furyk-on-us-presidents-cup-team/ar-AAf38Cb", "country": "US", "title": "Holmes replaces injured Furyk on US Presidents cup team", "performance_score": 0, "site": "msn.com", "participants_count": 2, "title_full": "Holmes replaces injured Furyk on US Presidents cup team", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T03:00:00.000+03:00", "replies_count": 1, "uuid": "26536e628efb97a8bac1598545d30b719a61dc6b"}, "author": "Brendan Mohler", "url": "http://www.msn.com/en-us/sports/golf/holmes-replaces-injured-furyk-on-us-presidents-cup-team/ar-AAf38Cb#post-0", "ord_in_thread": 0, "title": "Holmes replaces injured Furyk on US Presidents cup team", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\nHolmes replaces injured Furyk on US Presidents cup team Golf 2 days ago Brendan Mohler © Golf J.B. Holmes will replace Jim Furyk on the U.S. Presidents Cup team. Following back-to-back withdrawals due to a nagging wrist injury, Jim Furyk will not play in the Presidents Cup next week . U.S. team captain Jay Haas has chosen J.B. Holmes as Furyk’s replacement for the matches held October 8-11 at Jack Nicklaus Golf Club in South Korea.\nFuryk pulled out of the BMW Championship after six holes and did not hit a shot at the Tour Championship but remained optimistic that he would be able to compete in the biennial event.\nAdChoices “While I am disappointed to miss this week’s event in Atlanta, I am now placing all my efforts on being healthy and ready to play in the Presidents Cup,” Furyk said following his WD from the season-ending tournament at East Lake.\nThe 45-year-old will still travel with the team and serve as the fourth assistant captain.\n\"Jim did everything he could to be ready, and I'm sad that he won't be able to play,\" Haas said. \"He's a totally selfless team player who will be missed. He's had another great year, and I believe he was pointing toward this event to cap it off. Even though he won't be able to play, to have both Tabitha [Furyk's wife] and him in Korea will be a boost to the entire team.\"\nNEWSLETTERS: Sign up to get the latest golf news in your inbox\nFuryk has a career record of 20-10-3 in Presidents Cup play; only Tiger Woods has won more matches (23) in the event. This will be Holmes' first Presidents Cup appearance, but he was a member of the victorious 2008 U.S. Ryder Cup team (where he went 2-0-1) and had a strong year on Tour. He recorded a victory at the Shell Houston Open, two runner-up finishes and three other top-10s, including a T4 at the BMW Championship and a T8 at the Tour Championship.\n\"J.B. is excited for the opportunity and will be ready to play,\" Haas said. \"He's had two top 10s to end the FedEx Cup Playoffs, so he's playing well and he'll be a good fit. We're all looking forward to a great week.\"\nGo to MSN Home", "external_links": ["http://www.presidentscup.com/content/presidents-cup/news/2015/10/02/jb-holmes-presidents-cup.html", "http://www.golf.com/static/newsletter/signup", "http://go.microsoft.com/fwlink/?LinkID=286759", "http://www.golf.com/"], "published": "2015-10-03T03:00:00.000+03:00", "crawled": "2015-10-05T11:55:24.045+03:00", "highlightTitle": ""}