{"organizations": ["Cubs", "NL", "Cardinals"], "uuid": "2528b9c669eca2851bfe010081620bb351158d3f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribtown.com", "main_image": "http://d1bdhkmqqz901h.cloudfront.net/1200x630/smart/s3.amazonaws.com/hne-smedia/b/c/bccb5700a8754383a4de0578643bb2f6/web_full_527566783952.jpg", "site_section": "http://tribtown.com//feed/sec/6000", "section_title": "TribTown.com - Sports News", "url": "http://www.tribtown.com/view/story/bccb5700a8754383a4de0578643bb2f6/BBN--NLDS-Cardinals", "country": "US", "title": "Season ends for Cardinals with 6-4 loss to Cubs in Game 4 of NL Division Series", "performance_score": 0, "site": "tribtown.com", "participants_count": 0, "title_full": "Season ends for Cardinals with 6-4 loss to Cubs in Game 4 of NL Division Series", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T08:19:00.000+03:00", "replies_count": 0, "uuid": "2528b9c669eca2851bfe010081620bb351158d3f"}, "author": "", "url": "http://www.tribtown.com/view/story/bccb5700a8754383a4de0578643bb2f6/BBN--NLDS-Cardinals", "ord_in_thread": 0, "title": "Season ends for Cardinals with 6-4 loss to Cubs in Game 4 of NL Division Series", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["JAY COHEN"], "text": "Season ends for Cardinals with 6-4 loss to Cubs in Game 4 of NL Division Series By JAY COHEN AP Sports Writer   1:19   1:19   \nPeople: Photo Gallery: \nClick to view (5 Photos) \nCHICAGO — All those injuries finally caught up to the St. Louis Cardinals . It's going to be one long winter for Yadier Molina and the team that led the majors with 100 wins. \nStephen Piscotty hit a two-run homer for the second straight day, but John Lackey lasted just three innings and St. Louis was eliminated with a 6-4 loss to the Chicago Cubs in Game 4 of the NL Division Series on Tuesday. \nKevin Siegrist served up two home runs, including a massive drive to right by rookie Kyle Schwarber in the seventh for Chicago's 10th homer in its third straight victory. Despite owning the best record in baseball for most of the season, the Cardinals were no match for the powerful Cubs in a rare playoff failure for one of the majors' most successful franchises. \n\"You can judge us however you want,\" manager Mike Matheny said. \"We've got to look in the mirror. Once again, it doesn't always matter how it's perceived by everybody else.\" \nMolina could only watch as the Cardinals were knocked out in the first round of the playoffs for the first time in their active run of five consecutive postseason appearances. The All-Star catcher was scratched with weakness in his left thumb after he gamely tried to play with a strained ligament that sidelined him for the last part of the regular season. \n\"I tried everything,\" Molina said. \"That's why I didn't play.\" \nMolina plans to see a doctor on Wednesday. He said he might have made the injury worse when he played in Game 3; he winced on a swing-and-miss in the fourth inning of Monday night's loss, and then was removed for a pinch hitter in the sixth. \nMolina is one of baseball's best defensive catchers, and he hit .270 with 61 RBIs this season. Tony Cruz got the start behind the plate and contributed an RBI double, but Molina's absence was notable while the Cubs kept pounding the Cardinals pitchers. \n\"I'm always going to be quick to say no matter who it is we don't have, we'd like to have him, and then we make the decision who's going to give us the best chance,\" Matheny said. \n\"So with that being said, we have all the faith in the world that Tony Cruz can get the job done, and tonight necessarily wasn't on him, of course, and we don't say that things would have been different had we had someone else in there.\" \nSt. Louis overcame several injuries to key performers while storming to its third consecutive NL Central title. But it missed electric right-hander Carlos Martinez against the slugging Cubs, while banged-up Jon Jay got just one at-bat after returning late in the year and Matt Adams was left off the postseason roster entirely due to injury. \nMatheny decided to go with Lackey on short rest with St. Louis facing elimination, and it looked like a smart decision when the right-hander struck out his final two batters in a perfect first. \nBut the second inning quickly got away from Lackey, who was visibly angry after yielding a two-out RBI single to pitcher Jason Hammel. \n\"If I had that one pitch to go back, I would definitely do something different,\" Lackey said. \"That pitch kind of hung over the plate.\" \nJavier Baez followed with a three-run homer to right, giving the Cubs a 4-2 lead and sending a charge through the frenzied crowd of 42,411 at Wrigley Field. \nThe collapse in the second wasted a fast start for St. Louis, which grabbed a 2-0 lead when Piscotty connected on Hammel's fourth pitch of the game. Piscotty, who made his major league debut on July 21, also hit a two-run homer in the Cardinals' 8-6 loss on Monday night. \nCruz's clutch double got St. Louis within one in the sixth, but he was cut down at home by outfielder Jorge Soler when he tried to score on Brandon Moss' tying RBI single. \n\"We're a bazooka arm in right field away from taking the lead right there,\" said Adam Wainwright, who made an impressive return from an Achilles injury to pitch out of the bullpen in the playoffs. \nWainwright was replaced by Siegrist to begin the sixth, and the left-hander yielded a tiebreaking homer to Anthony Rizzo with two out. The lefty-batting Rizzo also connected against Siegrist in Game 3. \nSchwarber then began the seventh with his third homer of the playoffs, and the Cubs were well on their way to clinching a postseason series at Wrigley for the first time. \n\"They had two lefties that made us pay, and that really is the difference in the game,\" Matheny said. \nJay Cohen can be reached at http://www.twitter.com/jcohenap \n ", "external_links": [], "published": "2015-10-14T08:19:00.000+03:00", "crawled": "2015-10-14T09:18:10.689+03:00", "highlightTitle": ""}