{"organizations": ["Man United", "Manchester United", "Anthony Martial", "Reuters"], "uuid": "5fe6014b947df779ba493773ca8d297b2aca855d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "http://s4.reutersmedia.net/resources/r/?m=02&d=20151021&t=2&i=1088757605&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB9K1GY", "site_section": "http://mf.feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "http://uk.reuters.com/article/2015/10/22/uk-soccer-champions-csk-mun-idUKKCN0SF2WP20151022?feedType=RSS&feedName=sportsNews", "country": "US", "title": "Martial in spotlight as Man United draw in Moscow", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "Martial in spotlight as Man United draw in Moscow", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T10:36:00.000+03:00", "replies_count": 0, "uuid": "5fe6014b947df779ba493773ca8d297b2aca855d"}, "author": "", "url": "http://uk.reuters.com/article/2015/10/22/uk-soccer-champions-csk-mun-idUKKCN0SF2WP20151022?feedType=RSS&feedName=sportsNews", "ord_in_thread": 0, "title": "Martial in spotlight as Man United draw in Moscow", "locations": ["Moscow MOSCOW", "Moscow"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Dmitriy Rogovitskiy Anthony Martial", "Chris Smalling", "Anthony Martial", "Andrew Boyers"], "text": "Martial in spotlight as Man United draw in Moscow MOSCOW | By Dmitriy Rogovitskiy Anthony Martial celebrates with Chris Smalling after scoring the first goal for Manchester United. Action Images via Reuters / Andrew Boyers left Anthony Martial scores the first goal for Manchester United. Action Images via Reuters / Andrew Boyers left 2 of 4 right Anthony Martial celebrates with team mates after scoring the first goal for Manchester United. Action Images via Reuters / Andrew Boyers left Anthony Martial scores the first goal for Manchester United. Action Images via Reuters / Andrew Boyers left 4 of 4 right \nMOSCOW Anthony Martial went from villain to hero as his second-half equaliser earned Manchester United a deserved point in a 1-1 draw against CSKA Moscow in Champions League Group B on Wednesday. \nThe French teenager conceded a first-half penalty but popped up with a fine header to keep United two points behind group leaders VfL Wolfsburg, level with CSKA and a point ahead of PSV Eindhoven. \n\"In the first half we could not play in a higher tempo because it was too slow in my opinion and that's what I said at half time that we had to improve,\" United manager Louis van Gaal told reporters. \nThe visitors started well but fell behind after 15 minutes after Martial was correctly adjudged to have hand-balled in the penalty area. \nRoman Eremnko’s spot-kick was brilliantly palmed on to the post by David de Gea, but the ball rebounded into the path of Seydou Doumbia who had the easiest of finishes. \nAhmed Musa almost doubled the lead midway through the first half side as he looked to chip the Spanish international from distance, but De Gea produced another top-class save to keep his team in the game. \nUnited had to wait until just before the hour mark to force Igor Akinfeev in the CSKA goal to make a save as he kept out a Wayne Rooney header. \nBut the momentum was with the visitors and they drew level on 65 minutes. \nAntonio Valencia produced a good cross from the right which was met by Martial who sent a glancing header past Akinfeev and in off the post. \nUnited, with Marouane Fellaini on as a focal point for the attack, swarmed forward in search of the winner but failed to create any clearcut chances and were forced to settle for a point. \n\"Our key players began to tire in the second half and we lost the ball on a lot of occasions,\" CSKA coach Leonid Slutskiy said. \n\"As a result we were constantly having to defend. However, I would not say that Manchester United created a hatful of chances.\"", "external_links": [], "published": "2015-10-22T10:36:00.000+03:00", "crawled": "2015-10-22T11:03:26.277+03:00", "highlightTitle": ""}