{"organizations": [], "uuid": "a49a83bc7d2fe2faa4bf263e651725ab34ddec9b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mysanantonio.com", "main_image": "http://ww2.hdnux.com/photos/36/01/33/7870189/3/rawImage.jpg", "site_section": "http://www.mysanantonio.com/rss/feed/mySA-Sports-921.php", "section_title": "mySA Sports", "url": "http://www.mysanantonio.com/sports/pro-sports/article/Is-Kawhi-Leonard-really-the-NBA-s-best-defender-6580156.php", "country": "US", "title": "Is Kawhi Leonard really the NBA's best defender?", "performance_score": 0, "site": "mysanantonio.com", "participants_count": 1, "title_full": "Is Kawhi Leonard really the NBA's best defender? - San Antonio Express-News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T07:38:00.000+03:00", "replies_count": 0, "uuid": "a49a83bc7d2fe2faa4bf263e651725ab34ddec9b"}, "author": "Nick Moyle", "url": "http://www.mysanantonio.com/sports/pro-sports/article/Is-Kawhi-Leonard-really-the-NBA-s-best-defender-6580156.php", "ord_in_thread": 0, "title": "Is Kawhi Leonard really the NBA's best defender?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: Edward A. Ornelas, Staff / San Antonio Express-News Image 1 of / 35 Caption\nClose\nImage 1 of 35 San Antonio Spurs general manager R.C. Buford (from left) San Antonio Spurs' Kawhi Leonard, and Kia Motors America Vice President Eastern Sales Operation Percy Vaughn poses for photos during a press conference where Leonard was named NBA Defensive Player of the Year Thursday April 23, 2015 at the Spurs practice facility. San Antonio Spurs general manager R.C. Buford (from left) San Antonio Spurs' Kawhi Leonard, and Kia Motors America Vice President Eastern Sales Operation Percy Vaughn poses for photos during a press ... more Photo: Edward A. Ornelas, Staff / San Antonio Express-News Image 2 of 35 Kia Motors America Vice President Eastern Sales Operation Percy Vaughn (left) and San Antonio Spurs' Kawhi Leonard poses for photos during a press conference where Leonard was named NBA Defensive Player of the Year Thursday April 23, 2015 at the Spurs practice facility. Kia Motors America Vice President Eastern Sales Operation Percy Vaughn (left) and San Antonio Spurs' Kawhi Leonard poses for photos during a press conference where Leonard was named NBA Defensive Player of ... more Photo: Edward A. Ornelas, Staff / San Antonio Express-News Image 3 of 35 Kawhi Leonard facts Kawhi Leonard facts Image 4 of 35 1. He is the youngest child and has four older sisters. 1. He is the youngest child and has four older sisters. Photo: San Antonio Express-News Image 5 of 35 2. He was born to Mike Leonard and Kim Robertson on June 29, 1991 in Los Angeles. 2. He was born to Mike Leonard and Kim Robertson on June 29, 1991 in Los Angeles. Photo: Edward A. Ornelas, San Antonio Express-News Image 6 of 35 3. He looked something like this when Tim Duncan was drafted. 3. He looked something like this when Tim Duncan was drafted. Photo: San Antonio Express-News Image 7 of 35 4. He attended Martin Luther King High School in Los Angeles, California, and graduated in 2009. The same year, he earned the title of Mr. Basketball California. 4. He attended Martin Luther King High School in Los Angeles, California, and graduated in 2009. The same year, he earned the title of Mr. Basketball California. Photo: Edward A. Ornelas, San Antonio Express-News Image 8 of 35 5. He drove the same ride he had in college, a Chevy Malibu, during his first year in the NBA then finally spoiled himself with a Porsche, after being pressured by his family and friends. \"I don't have a car not on it. It's good on gas. It's a good commuter car [...],\" he told the San Diego Union-Tribune. 5. He drove the same ride he had in college, a Chevy Malibu, during his first year in the NBA then finally spoiled himself with a Porsche, after being pressured by his family and friends. \"I don't have a ... more Image 9 of 35 6. He's known for being reserved but somehow he's been able to make some pretty popular friends. Here he is with rapper Lil Wayne and his manager, Cortez Bryant, who is a mega Spurs fan. 6. He's known for being reserved but somehow he's been able to make some pretty popular friends. Here he is with rapper Lil Wayne and his manager, Cortez Bryant, who is a mega Spurs fan. Image 10 of 35 7. He is the first Jordan Brand athlete to be named Finals MVP since Michael Jordan. 7. He is the first Jordan Brand athlete to be named Finals MVP since Michael Jordan. Photo: Dan McCarney Image 11 of 35 8. And, at 22, he was the youngest Finals MVP since Magic Johnson. 8. And, at 22, he was the youngest Finals MVP since Magic Johnson. Photo: San Antonio Express-News Image 12 of 35 9. He attended San Diego State for two years. He'd leave his house at 5 a.m. every morning to workout before his college classes and it paid off -- he was 2-time first team all-conference and a consensus second team all-American his sophomore year. 9. He attended San Diego State for two years. He'd leave his house at 5 a.m. every morning to workout before his college classes and it paid off -- he was 2-time first team all-conference and a consensus ... more Photo: Flickr: Dirkhansen Image 13 of 35 10. After missing basketball tryouts due to lack of transportation because his mom was out of town, he lost a spot on the team. He told The New York Times he emailed his coach about the situation but was still unable to play. So, he played football instead his freshman year. 10. After missing basketball tryouts due to lack of transportation because his mom was out of town, he lost a spot on the team. He told The New York Times he emailed his coach about the situation but was ... more Photo: Edward A. Ornelas, San Antonio Express-News Image 14 of 35 11. He spent some of his childhood bonding and helping out his father at his car wash. 11. He spent some of his childhood bonding and helping out his father at his car wash. Photo: San Antonio Express-News Image 15 of 35 12. He wants to be in a Spurs jersey for his \" whole life \" and finish out his career in San Antonio.\n12. He wants to be in a Spurs jersey for his \" whole life \" and finish out his career in San Antonio. Photo: EDWARD A. ORNELAS, SAN ANTONIO EXPRESS-NEWS Image 16 of 35 13. He had the team's fifth Larry O'Brien trophy with him in San Diego as part of the tour but it spent two of the three days of the trip in his condo because his devotion to his three-a-day workouts kept him occupied.\n\"I don't have time to do anything with it,\" he told the San Diego Union Tribune . \"I'm just a low-key guy. I'm just happy we won it. I don't even care about the trophy. The title matters most.\" 13. He had the team's fifth Larry O'Brien trophy with him in San Diego as part of the tour but it spent two of the three days of the trip in his condo because his devotion to his three-a-day workouts kept ... more Photo: San Antonio Express-News Image 17 of 35 14. Months before being drafted, he was focused on his college career over raking in millions. \"My family doesn't need the money right now. We're not starving, hungry, living poor. It will be nice to have a lot of money, but I think my family could hold out for two more years if I play through my senior year,\" he told The New York Times. 14. Months before being drafted, he was focused on his college career over raking in millions. \"My family doesn't need the money right now. We're not starving, hungry, living poor. It will be nice to have a ... more Photo: 2011 Getty Images Image 18 of 35 15. He was originally drafter by the Indiana Pacers. Thankfully, he found out he had been traded to the Spurs five minutes after shaking hands with David Stern in a Pacers hat, because that just doesn't look right. 15. He was originally drafter by the Indiana Pacers. Thankfully, he found out he had been traded to the Spurs five minutes after shaking hands with David Stern in a Pacers hat, because that just doesn't look ... more Photo: 2011 Getty Images Image 19 of 35 16. According to the San Diego Union Tribune, he shared a two-story home with his mom during his first three years in San Antonio.\n\"The idea was that he was 19 when he was drafted after his sophomore year at SDSU, and he wanted to ensure her baby has to worry about only playing basketball, not what he was eating for dinner or how much detergent to pour in the washing machine,\" the Union Tribune reported. 16. According to the San Diego Union Tribune, he shared a two-story home with his mom during his first three years in San Antonio.\n\"The idea was that he was 19 when he was drafted after his sophomore year... Photo: San Antonio Express-News Image 20 of 35 17. He didn't think the bobbleheads given out to fans at the AT&T Center to celebrate his return from a hand injury looked like him. “It’s all right. It doesn’t look like me. I just take it for what it is,\" he said. 17. He didn't think the bobbleheads given out to fans at the AT&T Center to celebrate his return from a hand injury looked like him. “It’s all right. It doesn’t look like me. I just take it for what... Photo: Dan McCarney Image 21 of 35 18. He has a soft, funny spot for young fans, obviously. 18. He has a soft, funny spot for young fans, obviously. Photo: San Antonio Express-News Image 22 of 35 19. His skills are so impressive, coaches of other teams and broadcasters in rival cities are fans of him. Back when the New Orleans Pelicans were the Hornets, he made a dunk that made a sports analyst in the Big Easy call him \"Kawow.\" 19. His skills are so impressive, coaches of other teams and broadcasters in rival cities are fans of him. Back when the New Orleans Pelicans were the Hornets, he made a dunk that made a sports analyst in ... more Image 23 of 35 20. Despite what everyone else may think, he told the San Antonio Express-News in 2012 he does smile.\n\"You might see it,\" Leonard said. \"If we win the championship.\" Two years later, he made good on his promise. 20. Despite what everyone else may think, he told the San Antonio Express-News in 2012 he does smile.\n\"You might see it,\" Leonard said. \"If we win the championship.\" Two years later, he made good on his... Photo: Tony Gutierrez /Associated Press Image 24 of 35 21. Head coach Gregg Popovich and the Big Three have called Leonard the future of the Spurs. If true, the team is in qualified, big hands that measure 11.25\" wide. 21. Head coach Gregg Popovich and the Big Three have called Leonard the future of the Spurs. If true, the team is in qualified, big hands that measure 11.25\" wide. Photo: Edward A. Ornelas, San Antonio Express-News Image 25 of 35 22. Leonard was named to the NBA all-Rookie first team in 2012, and to the NBA all-defense second team in 2014.\n22. Leonard was named to the NBA all-Rookie first team in 2012, and to the NBA all-defense second team in 2014. Photo: Kin Man Hui, San Antonio Express-News Image 26 of 35 24. Eight of the 14 players drafted ahead of him in 2011 have not made it to the playoffs once. Leonard has made the playoffs every year of his career. 24. Eight of the 14 players drafted ahead of him in 2011 have not made it to the playoffs once. Leonard has made the playoffs every year of his career. Photo: San Antonio Express-News Image 27 of 35 San Antonio Spurs' Kawhi Leonard waits to be interviewed after a press conference where he was named NBA Defensive Player of the Year Thursday April 23, 2015 at the Spurs practice facility. San Antonio Spurs' Kawhi Leonard waits to be interviewed after a press conference where he was named NBA Defensive Player of the Year Thursday April 23, 2015 at the Spurs practice facility. Photo: Edward A. Ornelas, Staff / San Antonio Express-News Image 28 of 35 San Antonio Spurs' Kawhi Leonard waits to be interviewed after a press conference where he was named NBA Defensive Player of the Year Thursday April 23, 2015 at the Spurs practice facility. San Antonio Spurs' Kawhi Leonard waits to be interviewed after a press conference where he was named NBA Defensive Player of the Year Thursday April 23, 2015 at the Spurs practice facility. Photo: Edward A. Ornelas, Staff / San Antonio Express-News Image 29 of 35 San Antonio Spurs' Kawhi Leonard poses for photos with his NBA Defensive Player of the Year trophy during a press conference Thursday April 23, 2015 at the Spurs practice facility. San Antonio Spurs' Kawhi Leonard poses for photos with his NBA Defensive Player of the Year trophy during a press conference Thursday April 23, 2015 at the Spurs practice facility. Photo: Edward A. Ornelas, Staff / San Antonio Express-News Image 30 of 35 Photo: Dan McCarney Image 31 of 35 San Antonio Spurs’ Tim Duncan gives teammate Kawhi Leonard the NBA Defensive Player of the Year trophy before the start of the game against the Los Angeles Clippers of Game 3 in the Western Conference playoffs Friday April 24, 2015 at the AT&T Center. San Antonio Spurs’ Tim Duncan gives teammate Kawhi Leonard the NBA Defensive Player of the Year trophy before the start of the game against the Los Angeles Clippers of Game 3 in the Western Conference ... more Photo: Edward A. Ornelas /San Antonio Express-News Image 32 of 35 Kawhi Leonard, trying to block a shot by Dallas' Dirk Nowitzki, was voted to the second five on the NBA's All-Defensive team. Kawhi Leonard, trying to block a shot by Dallas' Dirk Nowitzki, was voted to the second five on the NBA's All-Defensive team. Photo: Kin Man Hui / San Antonio Express-News Image 33 of 35 San Antonio Spurs' Kawhi Leonard steals the ball from Miami Heat's Dwyane Wade as Boris Diaw helps out during the first half in game two of the NBA Finals at the AT&T Center, Sunday, June 8, 2014. San Antonio Spurs' Kawhi Leonard steals the ball from Miami Heat's Dwyane Wade as Boris Diaw helps out during the first half in game two of the NBA Finals at the AT&T Center, Sunday, June 8, 2014. Photo: Jerry Lara, By Jerry Lara, San Antonio Express_News Image 34 of 35 Spurs small forward Kawhi Leonard (right) gives opponents such as the Heat's LeBron James fits by getting his hands in the passing lanes, often making deflections and steals. Spurs small forward Kawhi Leonard (right) gives opponents such as the Heat's LeBron James fits by getting his hands in the passing lanes, often making deflections and steals. Photo: Edward A. Ornelas / Express-News Image 35 of 35 Is Kawhi Leonard really the NBA's best defender? 1 / 35 Back to Gallery Kawhi Leonard can do things few on this planet can.\nFor the hoops layman, watching a specific player on defense can be an exercise in tedium, but Leonard is one of the few who can unite statheads and casual observers, who can draw eyes both when he has the ball and when he's guarding it.\nLike a condor at full width, ball handlers are enveloped by his wings. Guards and bigs alike are baited into believing a play is safe, but with Leonard lurking, the only safety is off the court.\nHe doesn't fear Kevin Durant or Carmelo Anthony or anything prolific scorer, regardless of shape or size.\nHe's one of the few that doesn't quake or search for help when he finds himself in isolation with the King.\nLeonard is the reigning Defensive Player of the Year. Twenty-seven percent of NBA general managers named him the league's best defensive player in their annual survey . Forty-four percent named him the best perimeter defender.\nIn both categories, he ranks No. 1.\nAbove Anthony Davis and Draymond Green and LeBron James and hundreds of others.\nBut when someone ascends to the top of the mountain, particularly a mountain of this lofty height, the whispers blow in on the wind: are they worthy?\nTo help bring patently silly basketball conversations into the 21st century, NBA.com provides us with its own mountain of data, which can help us determine if Kawhi belongs atop his.\nLooking strictly at the 2014-2015 season in comparison to his peers, we should be able to tell if his anointment was just or not.\nLeonard led the league with 2.3 steals per game, just the third forward to do so in the past 20 seasons.\nIt's a stat that can be inflated by risk-takers and gamblers, though he's neither of those things. It's also more important than you know, but we'll return to that.\nOpponents averaged 9.2 shots per game on Leonard. He held them to 44.2 percent shooting , 0.4 percent less than their regular season average, which is good, but lags behind Tony Allen, Draymond Green and Anthony Davis, all of whom are under 40 percent.\nLeonard held opponents to 48.9 percent shooting at the rim on 2.8 attempts per game — for comparison, Green held opponents to 46.9 percent on 6.1 attempts, LeBron 49.3 percent on 2.1 attempts.\nAllen rarely finds himself on a bigger forward unless on a switch, and Davis typically sticks to other power forwards and centers, but he is capable of handling guards and wings on a switches, which is a terrifying prospect given his immensity.\nJames, especially on those trap-happy Heat teams, was an elite defender, but no longer. He rarely guards the opposing team's primary option anymore and has proven more lethargic on that end of the court in recent seasons.\nA more apt contemporary is Green, who slides all over the court depending on matchups, but deals with similar challenges to Leonard. Green actually does a much better job of holding his opponents to a lower field goal percentage than Leonard, according to the NBA's tracking data.\nLeonard loses the defensive rating battle, too, though just barely.\nWith Green on the court, the Warriors gave up 96 points per 100 possessions, third in the league behind Allen and his teammate Andrew Bogut.\nLeonard doesn't trail much: the Spurs gave up 97.1 per 100 with the reigning DPOY on the court, the league's ninth-best mark.\nBut there are some things stats simply can't measure, no matter how many advanced cameras encircle a court.\nLeonard's ball-denial is menacing. One of the reasons Green and Davis give up 14 shots per game, opposed to Leonard's 9, is that Kawhi smothers his man, making escape exhausting.\nThere's no reprieve when Leonard is locked on, no plays off and no breathers, not until the coach calls in a sub.\nHe deftly navigates screens, slithering around picks from behemoths and sticking to his man's hip at all times; this is critical on shooters like Durant, Anthony or Steph Curry, who can hoist shots in a blink.\nHe's also a master of the poke.\nNo, not the creepy Facebook poke — the ball-poke.\nLeonard's hands — seemingly equal in size to an Alaskan King Crab — find a way of reaching any ball, regardless of the handler's position.\nNot every jab turns into a steal, but it disrupts the offensive flow and drains precious seconds off the clock. A loose ball fluttering into the backcourt, killing time, is nearly as critical as a steal, though it sadly has no place on a stat sheet.\nBut when the pokes and prods do turn into steals — here's where Leonard's camp gains a powerful ally.\nLeonard played in 64 regular season games last year. He recorded at least one steal in all but five, and two or more in 37.\nAccording to FiveThirtyEight's Benjamin Morris , a steal is the most valuable play in basketball.\n\"Think about all that occurs in a basketball game — no matter who is playing, there will be plenty of points, rebounds and assists to go around,\" Morris wrote in 2014.\n\"But some things only happen because somebody makes them happen. If you replaced a player with someone less skilled at that particular thing, it wouldn't just go to somebody else. It wouldn't occur at all. Steals are disproportionately those kinds of things.\"\nBy Morris' metric, a steal is equivalent to 9.1 points.\nGoing off that analysis, Leonard's 2.3 steals were worth 20.7 points each night.\nCombine that with his blocks, worth 6.1 points according to Morris' readjusted statistical values, and Leonard's defense is worth 25.81 points per game.\nGreen is nearly his equal at 22.49 points, but they both pale in comparison to Davis, whose 2.9 blocks and 1.5 steals equate to 31.34 points per game.\nThen, does Davis dethrone Leonard atop the mountain?\nIt'd be difficult to argue against it, but the truth is, the argument for best defensive player is a flawed one.\nEven though the stats can fill out their own AP math book, it remains difficult to fairly compare the impact of Leonard vs. DeAndre Jordan, or Allen vs. Davis.\nLast year, the voters told us Leonard was the best defender in the NBA.\nBut Green received the most first-place votes, and Jordan received just four less than Leonard.\nThis statistical discourse could continue indefinitely, but there's a certain point when it seems prudent to close the box scores and open your eyes.\nLeonard is the best wing defender since Ron Artest before the Malace, and he'll spend his career chasing Scottie Pippen for the title of greatest wing defender.\nYour eyes can tell you that Kawhi Leonard can do things few on this planet can; your eyes can tell you that he's best defender in the NBA.", "external_links": ["http://ww2.hdnux.com/photos/32/32/35/6924157/3/920x920.jpg", "http://ww4.hdnux.com/photos/30/43/05/6435139/7/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/37/32/24/8234272/4/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/32/32/35/6924155/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/37/32/27/8234457/4/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/36/02/66/7875975/31/920x920.jpg", "http://ww3.hdnux.com/photos/34/45/40/7493654/5/920x920.jpg", "http://ww3.hdnux.com/photos/34/45/40/7493654/5/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/30/42/71/6434389/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/31/47/06/6713730/3/920x920.jpg", "http://ww4.hdnux.com/photos/30/50/50/6457863/21/920x920.jpg", "http://ww2.hdnux.com/photos/37/32/27/8234457/4/920x920.jpg", "http://ww2.hdnux.com/photos/36/01/33/7870185/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/30/42/71/6434389/3/920x920.jpg", "http://ww3.hdnux.com/photos/37/32/27/8234470/4/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/32/32/35/6924152/3/920x920.jpg", "http://ww4.hdnux.com/photos/30/50/50/6457863/21/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/30/43/05/6435139/7/920x920.jpg", "http://ww1.hdnux.com/photos/27/01/44/6035724/31/square_gallery_thumb.jpg", "http://www.nytimes.com/2011/03/25/sports/ncaabasketball/25leonard.html?_r=0", "http://ww3.hdnux.com/photos/37/23/66/8207802/5/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/36/01/33/7870188/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/36/00/33/7866069/19/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/36/03/43/7878874/7/square_gallery_thumb.jpg", "https://www.youtube.com/embed/ap5wg-jZo00", "http://ww3.hdnux.com/photos/37/23/66/8207802/5/920x920.jpg", "http://ww1.hdnux.com/photos/36/01/33/7870188/3/920x920.jpg", "http://ww3.hdnux.com/photos/32/32/35/6924150/3/920x920.jpg", "http://ww1.hdnux.com/photos/27/01/44/6035724/31/920x920.jpg", "http://ww1.hdnux.com/photos/36/01/33/7870184/3/920x920.jpg", "http://ww2.hdnux.com/photos/33/73/13/7320293/11/920x920.jpg", "http://ww1.hdnux.com/photos/31/11/65/6593860/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/32/32/35/6924150/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/30/30/61/6392943/3/920x920.jpg", "http://ww1.hdnux.com/photos/31/47/06/6713732/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/32/32/35/6924157/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/31/47/06/6713730/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/32/32/35/6924158/3/920x920.jpg", "http://ww2.hdnux.com/photos/31/47/05/6713725/3/920x920.jpg", "http://ww2.hdnux.com/photos/30/50/47/6457849/21/square_gallery_thumb.jpg", "https://vine.co/v/OYulXrXgZuM/embed/simple", "http://www.utsandiego.com/news/2014/aug/16/sdsu-basketball-kawhi-leonard-contract/4/?#article-copy", "http://ww1.hdnux.com/photos/32/32/35/6924140/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/37/32/20/8234025/4/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/26/70/42/5998781/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/30/30/61/6392943/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/32/32/35/6924140/3/920x920.jpg", "http://ww3.hdnux.com/photos/36/01/33/7870186/3/square_gallery_thumb.jpg", "http://fivethirtyeight.com/features/the-hidden-value-of-the-nba-steal/", "https://platform.vine.co/static/scripts/embed.js", "http://ww4.hdnux.com/photos/32/32/35/6924155/3/920x920.jpg", "http://ww2.hdnux.com/photos/31/47/05/6713725/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/26/70/42/5998781/3/920x920.jpg", "http://ww1.hdnux.com/photos/36/01/33/7870184/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/33/73/13/7320293/11/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/31/11/65/6593860/3/920x920.jpg", "http://ww3.hdnux.com/photos/32/32/35/6924158/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/30/50/47/6457849/21/920x920.jpg", "http://ww1.hdnux.com/photos/32/32/35/6924152/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/36/00/33/7866069/19/920x920.jpg", "http://ww1.hdnux.com/photos/31/47/06/6713732/3/920x920.jpg", "http://www.nba.com/news/features/john_schuhmann/nba-com-2015-16-gm-survey/", "http://ww2.hdnux.com/photos/37/34/11/8241737/4/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/36/01/33/7870185/3/920x920.jpg", "http://stats.nba.com/league/player/defense/#!/?sort=D_FG_PCT&dir=-1&CF=G*GE*58&Season=2014-15&SeasonType=Regular%20Season", "http://ww3.hdnux.com/photos/36/03/43/7878874/7/920x920.jpg", "http://ww2.hdnux.com/photos/36/01/33/7870189/3/920x920.jpg", "http://stats.nba.com/league/player/#!/advanced/?sort=DEF_RATING&dir=-1&Season=2014-15&SeasonType=Regular%20Season&CF=GP*GE*58%7CMIN*GE*20", "http://ww3.hdnux.com/photos/37/32/27/8234470/4/920x920.jpg", "http://ww1.hdnux.com/photos/37/32/24/8234272/4/920x920.jpg", "http://ww4.hdnux.com/photos/36/02/66/7875975/31/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/37/32/20/8234025/4/920x920.jpg", "http://ww2.hdnux.com/photos/37/34/11/8241737/4/920x920.jpg", "http://ww2.hdnux.com/photos/36/01/33/7870189/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/33/73/22/7320730/3/920x920.jpg", "http://ww3.hdnux.com/photos/36/01/33/7870186/3/920x920.jpg", "http://ww3.hdnux.com/photos/33/73/22/7320730/3/square_gallery_thumb.jpg"], "published": "2015-10-21T07:38:00.000+03:00", "crawled": "2015-10-21T12:20:12.032+03:00", "highlightTitle": ""}