{"organizations": [], "uuid": "9b2ac7bd922a092ea2f2b3870f28c413a8b3db45", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.timesunion.com", "main_image": "http://ww4.hdnux.com/photos/41/25/16/8737711/3/rawImage.jpg", "site_section": "http://timesunion.com//sports/collectionRss/Sports-Block-States-Homepage-48042.php", "section_title": "Sports Block States Homepage", "url": "http://www.timesunion.com/sports/article/Newton-Norman-help-unbeaten-Panthers-improve-to-6550220.php", "country": "US", "title": "Newton, Norman help unbeaten Panthers improve to 4-0", "performance_score": 0, "site": "timesunion.com", "participants_count": 1, "title_full": "Newton, Norman help unbeaten Panthers improve to 4-0 - Times Union", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T05:40:00.000+03:00", "replies_count": 0, "uuid": "9b2ac7bd922a092ea2f2b3870f28c413a8b3db45"}, "author": "timesunion.com", "url": "http://www.timesunion.com/sports/article/Newton-Norman-help-unbeaten-Panthers-improve-to-6550220.php", "ord_in_thread": 0, "title": "Newton, Norman help unbeaten Panthers improve to 4-0", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: Brian Blanco, AP Image 1 of / 5   5 Carolina Panthers cornerback Josh Norman (24) heads for the end zone after intercepting a pass from Tampa Bay Buccaneers quarterback Jameis Winston during the first quarter of an NFL football game   Tampa, Fla.\nPhoto: Brian Blanco, AP Carolina Panthers cornerback Josh Norman (24) heads for the end... Image 2 of 5 Carolina Panthers wide receiver Ted Ginn Jr., left, celebrates with quarterback Cam Newton after scoring a touchdown against the Tampa Bay Buccaneers during the third quarter of an NFL football game   Tampa, Fla.\nPhoto: Phelan M. Ebenhack, AP Carolina Panthers wide receiver Ted Ginn Jr., left, celebrates with... Image 3 of 5 Tampa Bay Buccaneers running back Doug Martin (22) breaks away from Carolina Panthers outside linebacker Shaq Green-Thompson (54) during the third quarter of an NFL football game   Tampa, Fla.\nPhoto: Phelan M. Ebenhack, AP Tampa Bay Buccaneers running back Doug Martin (22) breaks away from... Image 4 of 5 Tampa Bay Buccaneers quarterback Jameis Winston (3) throws a pass against the Carolina Panthers during the first quarter of an NFL football game   Tampa, Fla.\nPhoto: Brian Blanco, AP Tampa Bay Buccaneers quarterback Jameis Winston (3) throws a pass... Image 5 of 5 Carolina Panthers quarterback Cam Newton throws a pass in the rain against the Tampa Bay Buccaneers during the first quarter of an NFL football game   Tampa, Fla.\nPhoto: Chris O'Meara, AP Carolina Panthers quarterback Cam Newton throws a pass in the rain... Newton, Norman help unbeaten Panthers improve to 4-0 1  /  5 Back to Gallery TAMPA, Fla. (AP) — The Carolina Panthers aren't apologizing for who they have beaten during their fastest start in 12 years. What really matters is they are undefeated heading into their bye week after Sunday's 37-23 victory over the struggling Tampa Bay Buccaneers .\n\"How many other teams are 4-0? We're going to continue to keep pounding regardless of what they say, because at the end of the day, they're not where we're at,\" cornerback Josh Norman said.\nCam Newton threw for two touchdowns with no interceptions, and Norman returned one of his two interceptions of Jameis Winston 46 yards for a TD.\nEd Dickson lumbered 57 yards after recovering a fumble to score for Carolina, which is off to its best start since 2003, when the Panthers began with five consecutive victories and wound up playing in the Super Bowl.\n\"It's nice to be in the situation we are in,\" Panthers coach Rob Rivera said. \"We still think we have room to improve and be a better football team.\"\nThey've done it without star middle linebacker Luke Kuechly , who has missed the past three games after suffering a concussion.\n\"It gives us confidence,\" Newton said. \"But through it all, we still haven't played the football that we know we're capable of.\"\nNewton threw scoring passes of 6 and 12 yards to Ted Ginn, Jr. He had a modest day statistically, with 124 yards passing and a team-leading 51 more rushing. But the fifth-year pro had just one turnover — a third-quarter fumble — on a day when play was affected at times by heavy rain.\nMeanwhile, Norman was center stage again, a week after making a game-saving interception in the end zone against New Orleans. He has four picks overall, and he's scored twice.\nAccording to the NFL, the fourth-year pro became the first Carolina player to return a pair of interceptions for TDs in the first four weeks of a season. He's the first in the league to do it in the past five years.\n\"This will be Josh Norman's best year,\" Newton said. \"Up until this point he's playing lights out, giving everybody confidence.\"\nThe Bucs (1-3), have lost five straight in the NFC South rivalry and have dropped 11 consecutive homes games — 10 under second-year coach Lovie Smith — dating to December 2013.\n\"All losses are disappointing,\" Smith said, \"but we shouldn't be getting beat that way.\"\nSome things to know about Carolina's success and Tampa Bay's struggles:\nDISRUPTING JAMEIS: The Panthers only sacked Winston twice, but they also had six quarterback hits while forcing the rookie into some poor decisions. The No. 1 overall pick finished 26 of 43, including TDs of 10 yards to Charles Sims and 6 yards to Vincent Jackson , who had 10 receptions for 147 yards.\nFINDING WAYS TO LOSE: The Bucs outgained the Panthers 411 yards to 244 and limited Newton's top receiver, tight end Greg Olsen , to two catches for 28 yards. That sounds like a recipe for success, except for the team's kicking woes and costly turnovers that led to 27 points for Carolina.\nKICKING WOES: Smith declined to say whether he's considering a change after another poor performance by Kyle Brindza . \"We're not going to start kicking people off (the team) in the press conference,\" the coach said.\nSTRIVING FOR BALANCE: The Bucs rushed for 141 yards, which is an encouraging sign. Doug Martin averaged 5.3 yards per carry, with a long of 26 yards on Sunday. His 5-yard TD run in the second quarter trimmed Tampa Bay's deficit to 17-10.\nFORTUNATE BOUNCE: Jonathan Stewart rushed for 50 yards on 10 carries. He gained 8 before fumbling on the zany play, in which Dickson recovered the loose ball in midair and took off for the end zone in the third quarter. \"Just seeing the ball pop up like a greased pig, nobody really panicked because Ed picked it up mid-stride,\" Newton said. \"We've just got to work on him taking that car out of neutral when he's running.\"\n___\nAP NFL website: www.pro32.ap.org and http://twitter.com/AP_NFL", "external_links": [], "published": "2015-10-05T05:40:00.000+03:00", "crawled": "2015-10-05T10:30:56.345+03:00", "highlightTitle": ""}