{"organizations": [], "uuid": "17e87505740f321c09bbe5504c2dede16dcbadf9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/bf50d8bf44c41d49e2d38c090ae6b9c8.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/football/roy-hodgson-revels-in-englands-perfect-10/6930409/", "country": "JE", "title": "Roy Hodgson revels in England's perfect 10", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "Roy Hodgson revels in England's perfect 10", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T09:31:00.000+03:00", "replies_count": 0, "uuid": "17e87505740f321c09bbe5504c2dede16dcbadf9"}, "author": "", "url": "http://www.sport.co.uk/football/roy-hodgson-revels-in-englands-perfect-10/6930409/", "ord_in_thread": 0, "title": "Roy Hodgson revels in England's perfect 10", "locations": ["England"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Roy Hodgson"], "text": "Roy Hodgson revels in England's perfect 10 13 Oct 2015 06:31:57 \nRoy Hodgson insists he never doubted his players were capable of winning all 10 of their Euro 2016 qualifying matches. \nEngland completed a perfect qualifying campaign on Monday night when they beat Lithuania 3-0 in Vilnius. \nRoss Barkley and Alex Oxlade-Chamberlain found the net while Giedrius Arlauskis scored an own goal in the straightforward win at the LFF Stadium. \nAlthough England's group was perhaps the easiest, their achievement should not be sniffed at. \nThis is the first time they have qualified for a major tournament with a 100 per cent qualifying record in this format and no other nation went through the qualification campaign without dropping a point. \nAnd after last year's disappointingly early World Cup exit, the achievement of a perfect 10 deserves praise. \n\"I did believe the team could go unbeaten,\" the England manager said. \n\"It was a big goal to set - perhaps too big in some respects - but something in me said they are good players here, and we're not dependent upon 11; if we play well, with focus and continue to try and get better, we could go through unbeaten. \n\"But qualification was the main thing. I would have been happy with six wins and four draws.\" \nThe only negative for England was that their fans became embroiled in nasty scuffles with home supporters before kick-off and after Barkley had scored the first goal. \nHaving bought tickets in the home end, the England fans were mixing with their Lithuanian counterparts and it seemed inevitable there would be trouble. \nRiot police were called in to separate the fans - some of whom sang anti-IRA songs. \nThe Football Association, which has been warned by FIFA about the chants before, will be hoping the skirmishes do not overshadow the impressive achievement of Hodgson and his players. \nHodgson has been loath to praise Barkley too much since he called the 21-year-old into the England fold for the first time, but the England manager had some encouraging words of praise for the midfielder after his display in the Baltic nation. \n\"We always believed in Ross and it's nice to see him maturing game by game, for Everton and England,\" Hodgson added. \n\"The game was very important, getting us off the mark, so we were pleased with him. \n\"Being in a comfortable position allowed me to give a few other guys a chance and give others a rest. \n\"I was pleased with the victory and the performance. From the offset we showed our intentions and were very dominant from the first minute. \n\"It's a nice feeling to have played 10 matches and showed the quality of football and concentration to win them.\" \nIgoris Pankratjevas did not hang around to give his verdict on the match. \nThe Lithuania coach walked out of the press conference room after giving a brief resignation speech. \nHe said: \"Everything has its ending. This is the end of the qualifying cycle and my job. \n\"I'm resigning from the team. I want to thank everyone for supporting me and the team. Goodbye.\" Related Sport News", "external_links": [], "published": "2015-10-13T09:31:00.000+03:00", "crawled": "2015-10-13T20:06:32.116+03:00", "highlightTitle": ""}