{"organizations": ["Auburn Tigers", "Auburn"], "uuid": "1e293de132e693f45cc7f64191ccb048d5231485", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.google.com", "main_image": "http://imgick.al.com/home/bama-media/width620/img/alphotos/photo/2015/10/15/18979492-large.jpg", "site_section": "http://news.google.com/news?pz=1&cf=all&ned=us&hl=en&topic=s&output=rss", "section_title": "Sports - Google News", "url": "http://news.google.com/news/url?sa=t&fd=R&ct2=us&usg=AFQjCNEqBlCy5qJN-hZbFPRbEdTDE0icVA&clid=c3a7d30bb8a4878e06b80cf16b898331&cid=52778969811068&ei=XW0gVrj4M5zVa53KoagI&url=http://www.al.com/auburnfootball/index.ssf/2015/10/live_updates_analysis_auburn_v_4.html", "country": "IL", "title": "Rewinding key plays in Auburn's 30-27 win over Kentucky - AL.com", "performance_score": 0, "site": "google.com", "participants_count": 0, "title_full": "Rewinding key plays in Auburn's 30-27 win over Kentucky - AL.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T05:38:00.000+03:00", "replies_count": 0, "uuid": "1e293de132e693f45cc7f64191ccb048d5231485"}, "author": "", "url": "http://news.google.com/news/url?sa=t&fd=R&ct2=us&usg=AFQjCNEqBlCy5qJN-hZbFPRbEdTDE0icVA&clid=c3a7d30bb8a4878e06b80cf16b898331&cid=52778969811068&ei=XW0gVrj4M5zVa53KoagI&url=http://www.al.com/auburnfootball/index.ssf/2015/10/live_updates_analysis_auburn_v_4.html", "ord_in_thread": 0, "title": "Rewinding key plays in Auburn's 30-27 win over Kentucky - AL.com", "locations": ["Kentucky", "Lexington"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Welcome to Commonwealth Stadium in Lexington, Kentucky, where the Auburn Tigers (3-2, 0-2) are seeking their first SEC of the season. \nWe'll provide live updates in the space below, so refresh this page regularly for the latest information. \nGUS MALZAHN'S POST-GAME PRESS CONFERENCE \n-- Malzahn gives Kentucky's defense credit in the third quarter for holding the Tigers to 13 yards. \"We were close\" on a couple plays, he says \n-- Daniel Carlson's 51-yard field goal was \"huge.\" \n-- \"I'll say this -- it was a big win for us... We needed this win... We're going in the right direction.\" \n-- Malzahn said Jeremy Johnson \"got better\" but White gave the team the best chance to win. \n-- Malzahn hopes to get Carl Lawson back at the end of the season. Lawson made the trip to Lexington and is off crutches, but did not play. \"He's one of our leaders\" \n-- Auburn's defense allowed 497 yards, but Malzahn praises the defense's ability to come up big \n-- Malzahn says Louis helped the team win tonight and it was the first time he was fully healthy all year. \n-- \"We wanted to be more aggressive... The week off was big for us.\" \n-- On Malzahn's decision to punt on fourth-and-1 late in the game: \"There was a little bit of discussion, but as a coach you get a feel for the game. I thought it was going to be a 50-50 deal.\" \n-- Malzahn says the defense \"came up big\" \n-- Praises Sean White and Ricardo Louis and the team's ball control. \n-- \"We probably played our best overall game of the year.\" \nFINAL: Auburn 30, Kentucky 27 \n-- Auburn's defense holds, as Cassanova McKinzy and Justin Garrett sack Towles on fourth down to preserve the win \nFOURTH QUARTER \n-- Auburn chews up as much clock as it can, but chooses to punt the ball away with 2:12 left in the game. \nAuburn 30, Kentucky 27 (4:06 / 4Q) \n-- Running back Mikel Horton scores on a 1-yard rush \n-- Kentucky's Jeff Badet catches a 27-yard pass near the goal line \n-- Auburn DT Montravius Adams is shaken up as trainers assist him off the field \nAuburn 30, Kentucky 20 (7:56 / 4Q) \n-- The Tigers are back in the end zone, as Barber scores on a 3-yard rush, his second touchdown of the night. \n-- Sean White eludes a defender and hits Ricardo Louis up the middle for 34 yards. Auburn is in a great spot at Kentucky's 12-yard line \n-- Peyton Barber fumbles at Kentucky's 42-yard line, but the call is under reversed following an official review. Call of the year for Auburn. — Kevin Scarbinsky (@KevinScarbinsky) October 16, 2015 \n-- Auburn's defense shows up, and Kentucky goes three-and-out. The Tigers will take over at their own 33-yard line, but will they be able to move the ball? \nTHIRD QUARTER \n-- The final play of the third quarter is an incompletion from Sean White. The Tigers have just 13 yards of offense since halftime. More stats: Stats after 3: pic.twitter.com/FaR7d57jHo — James Crepea (@JamesCrepea) October 16, 2015 \n-- Kerryon Johnson with a nice return for the Tigers, who take over at their own 36-yard line. \nAuburn 23, Kentucky 20 (1:03 / 3Q) \n-- MacGinnis hits a 31-yard field goal for the Wildcats. \n-- Back-to-back first downs for Kentucky \n-- Kentucky converts on 4th-and-1 to keep its drive alive on Auburn's 44-yard line \n-- Auburn goes three-and-out as the Wildcats sack Sean White for a big loss on third down \n-- After reaching Auburn's 42-yard line, Kentucky's drive stalls with a drop from Garrett Johnson. Byron Cowart with the pressure on Towles and Blake Countess defended Johnson. Wildcats punt the ball into the end zone \n-- Former Auburn commit Chris Westry with a big pass break-up on third down for Kentucky, and the Tigers punt the ball away. Kentucky will take over on its own 20-yard line. This could get interesting. \n-- Marcus Davis catches a 15-yard pass from Sean White on Auburn's first offensive play of the second half. \n-- Kentucky DT Melvin Lewis will not return after suffering a lower leg injury in the second quarter \nAuburn 23, Kentucky 17 (11:49 / 3Q) \n-- Williams cuts into Auburn's lead with a 6-yard touchdown run, extending his arm to break the plane of the goal line. Officials confirm the play after a review. \n-- A 13-yard gain from Boom Williams, who did not record a carry in the second half, puts Kentucky on Auburn's 6-yard line. \n-- Patrick Towles' 16-yard pass to Garrett Johnson was originally ruled incomplete, but officials reverse the call after reviewing the tape. Kentucky now at Auburn's 32-yard line. \n-- Kentucky begins the second half on its own 25-yard line \nHALFTIME: Auburn 23, Kentucky 10 \n-- Auburn is outgaining Kentucky in total yards, 297-240. \n-- Auburn QB Sean White is 12-for-18 for 186 yards, while Kentucky's Patrick Towles is 10-for-18 for 161 yards and an interception. \n-- Auburn RB Peyton Barber has 15 carries for 59 yards and one touchdown. Boom Williams has five carries for 74 yards and a score, but did not record a carry in the second quarter. \n-- Top receivers are Auburn's Ricardo Louis (five catches, 114 yards) and Garrett Johnson (five catches, 103 yards) \n-- Auburn is 8-for-11 on third downs. More stats: Halftime stats for Auburn / Kentucky http://t.co/hLRRXzRfZb pic.twitter.com/S6qTVu2e3V — Wesley Sinor (@WesleySinor) October 16, 2015 \nSECOND QUARTER \nAuburn 23, Kentucky 10 (0:00 / 2Q) \n-- Carlson booms a 51-yard field goal as time expires \n-- Tony Stevens catches Sean White's 34-yard bomb in the end zone, but is ruled out of bounds. \n-- Auburn takes over at its own 42 as Marcus Davis returns Kentucky's punt for just 1 yard. \n-- Auburn's Davonte Lambert sacks Towles on third down, and the Tigers call a timeout with 57 seconds left in the half. Auburn should get the ball back in decent field position with one timeout left to burn. \nAuburn 20, Kentucky 10 (1:43 / 2Q) \n-- Daniel Carlson is good from 29 yards out \n-- Roc Thomas has no room to run as the Wildcats force fourth down. \n-- Kentucky DT Melvin Lewis injured and flagged for unsportsmanlike conduct \n-- Peyton Barber's back-to-back runs get the Tigers into the red zone. Austin Golson flagged for unsportsmanlike conduct, but the penalty is offset with a Kentucky unsportsmanlike conduct flag \n-- Tony Stevens makes his first catch of the season for Auburn \nAuburn 17, Kentucky 10 (4:55 / 2Q) \n-- Prattville native Austin MacGinnis nails a 28-yard field goal for Kentucky. \n-- Auburn safety Rudy Ford sacks Towles on third down, and its a loss of seven yards. \n-- Towles overthrows Johnson, who comes up with an incredible one-handed catch to for 36 yards to set the Wildcats up at Auburn's 10-yard line. \n-- Auburn's defense slips up on third-and-22 at Kentucky's own 13-yard line, as Patrick Towles hits Garrett Johnson for a 39 yard gain. \nAuburn 17, Kentucky 7 (8:59 / 2Q) \n-- Auburn's offense stalls as Sean White throws the ball out of bounds in the end zone. The Tigers extend their lead with a 34-yard field goal from Daniel Carlson. \n-- Kerryon Johnson on the move with a 14-yard rush and a 13-yard rush on the drive. \n-- Auburn freshman Carlton Davis intercepts Kentucky's Patrick Towles in the end zone to get the Tigers out of trouble \nFIRST QUARTER — Wesley Sinor (@WesleySinor) October 15, 2015 \n-- Kentucky gets three first downs in three plays. Charles Walker comes up with a big 20-yard catch in traffic for a first down, Patrick Towles gets another with a 12-yard carry and the Wildcats follow it up with a 20-yard passing play. \n-- Auburn's Avery Young is flagged for holding, making it 2nd-and-20. Roc Thomas drops a pass, Tigers can't convert and have punted the ball away. Kentucky taking over after a fair catch at its own 6-yard line. \n-- Auburn forces a three-and-out as Kentucky receivers fall down and drop the ball on back-to-back plays. Tigers over at their own 45. \nAuburn 14, Kentucky 7 (6:10 / 1Q) \n-- Tigers use the Wildcat again, and freshman Kerryon Johnson scores the first touchdown of his Auburn career. Looks like Gus lost his visor and found his imagination. — Kevin Scarbinsky (@KevinScarbinsky) October 15, 2015 \n-- Ricardo Louis has four catches for a season-high 97 yards. Already. Career high is 137. \n-- First and goal for the Tigers after another White-to-Louis play, this one for 7 yards \n-- Sean White hits Ricardo Louis for 41 yards, and Auburn's back in business at Kentucky's 18-yard line. \nAuburn 7, Kentucky 7 (8:46 / 1Q) \n-- Boom Williams gets Kentucky on the board with a 1-yard run to cap a six-play, 75-yard in 2 minutes and 25 seconds. \n-- Kentucky's Boom Williams puts the Wildcats in scoring position with a 60-yard dash right up the middle of Auburn's defense. \nAuburn 7, Kentucky 0 (11:07 / 1Q) \n-- Auburn caps its opening drive (12 plays, 80 yards) with a touchdown as Peyton Barber scores on a 1-yard run, his seventh touchdown of the season. Tigers were 4-for-4 on third downs during the drive. \n-- Auburn crosses midfield with a 10-yard catch from Melvin Ray \n-- Sean White hits Ricardo Louis for a 27-yard gain for Auburn's initial first down \n-- Roc Thomas starts at running back for Auburn \nPREGAME \n-- Auburn wins the toss and elects to receive \n-- Tonight's Auburn captains are Jonathan Wallace and Jonathan Jones \n-- Gus Malzahn will be visor-free tonight to honor Steve Spurrier, who resigned at South Carolina this week. \n-- Gus Malzahn says Kerryon Johnson could play in the slot tonight. Freshman was warming up with second-team receivers Ryan Davis and Jonathan Wallace. \n-- Devonte Danzey will be the backup center for Auburn. Xavier Dampeer unable to play following his jaw injury. \n-- Pregame chat with AL.com reporters James Crepea and Wesley Sinor: \nAuburn Football pregame chat \n-- Malzahn to Auburn IMG Sports Network: \"I like this team. We're a close group. We haven't played our best, we understand that... but I can really feel the tide turning.\" \n-- Freshman DL Jauntavius Johnson is suited up and participating in pregame warm-ups. Coming off an ACL injury. \n-- Injured defenders Tim Irvin and Tre' Williams are both dressed and warming up \n-- Injured defensive end Carl Lawson made the trip to Lexington and is off his crutches during warm-ups, but is not dressed for the game. \n-- The Tigers will start Sean White at quarterback after a week and a half of speculation. Head coach Gus Malzahn opened up the competition between White and Jeremy Johnson following the team's win over San Jose State Oct. 4. — The War Eagle Reader (@wareaglereader) October 15, 2015 \n-- Auburn will be relying on its experience on Thursday nights, having played and won at Kansas State last season. This will be the first Thursday night game Kentucky has played at home. The Tigers are 21-24-4 all-time in Thursday games and holds a 17-23-3 record in road Thursday games. \n-- The Wildcats are 4-1 this season and 2-1 in the SEC with wins over Missouri and South Carolina and a 14-9 loss to undefeated Florida. Kentucky will go with Patrick Towles at quarterback, who threw a pair of touchdowns to help the team's survive an overtime scare to FCS opponent Eastern Kentucky Oct. 4. \n-- Kentucky running back Stanley \"Boom\" Williams returns to the starting lineup after missing the EKU game for a personal reason. \n-- Auburn last played at Kentucky in 2010 and hasn't lost in Lexington since 1966 . \n-- NFL scouts credentialed for this game: Bengals, Bills, Cardinals, Chargers, Cowboys, Dolphins, Jets, Panthers, Patriots, Titans and Vikings. Head To Head: Auburn vs. Kentucky prediction Annice Deweese (66-24) and Kevin Scarbinsky (60-30) take a look at Auburn's critical game against the Wildcats of Kentucky. Can the Tigers turn their season around in Lexington?", "external_links": [], "published": "2015-10-16T05:38:00.000+03:00", "crawled": "2015-10-16T06:22:29.671+03:00", "highlightTitle": ""}