{"organizations": [], "uuid": "cccc50cc074f9c8902951aea7bae902478e722e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/2/9/153844/World/International/Refugee-influx-threatens-Germanys-balanced-budget-.aspx", "country": "EG", "title": "Refugee influx threatens Germany's balanced budget: Schaeuble - International - World", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Refugee influx threatens Germany's balanced budget: Schaeuble - International - World - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "cccc50cc074f9c8902951aea7bae902478e722e7"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/2/9/153844/World/International/Refugee-influx-threatens-Germanys-balanced-budget-.aspx", "ord_in_thread": 0, "title": "Refugee influx threatens Germany's balanced budget: Schaeuble - International - World", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Merkel's deputy expects Germany to get over a million refugees in 2015 Germany says registered 577,000 asylum seekers from Jan-Sept Germany fetes 25 years of unity with call for refugee welcome Merkel tells Europe: Germany can't cope with migrants alone One million refugees could come to Germany this year: Vice chancellor German Finance Minister Wolfgang Schaeuble conceded Tuesday that Berlin could miss its goal of achieving a balanced budget in its public finances next year because of the record migrant influx.\n\"We want to achieve this without taking on new debt, if possible,\" said Schaueble.\n\"They've asked me why I say 'if possible'. But the truth is: I don't know,\" the finance minister told a Berlin congress of machine-tool manufacturers.\nLast year -- for the first time since 1969, and a year ahead of plans -- Germany managed to balance its budget, meaning the state did not take on any new debt.\nThe government under Chancellor Angela Merkel hopes that this will become the norm.\nBut the unanticipated costs of taking in up to one million asylum-seekers expected this year is going to place an additional burden on the public purse.\nThe massive influx constituted \"a bigger challenge than a lot of things we've had to face in the past 65 years,\" Schaeuble said, adding that the costs posed \"an incredibly large risk potential\" for public finances.\nNevertheless, the minister insisted that \"we can and will\" cope with the challenge.\nThe government has promised billions of euros in aid to the regional and municipal authorities housing the migrants.\nThe federal government will play a flat-rate sum for each asylum-seeker \"to put an end to all this wailing\" from the local authorities, Schaeuble said.\nGermany's hardline stance on budgetary rigour has been criticised by economists and many of the country's eurozone partners, who accuse Berlin of not investing enough.", "external_links": [], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T16:11:26.330+03:00", "highlightTitle": ""}