{"organizations": [], "uuid": "049410f1794e268232e0e1086ed63e0b2433fdbf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "cherokeetribune.com", "main_image": "http://matchbin-assets.s3.amazonaws.com/public/sites/625/thumbs/F9W2_rgbRU___Aaron_catches_ball.jpg", "site_section": "http://cherokeetribune.com/rss/rss/Sports?instance=Sports&content_type=article&tags=sports&tag_inclusion=or&offset=0&limit=10&page_name=rss", "section_title": "Sports", "url": "http://cherokeetribune.com/bookmark/26902985", "country": "US", "title": "Reinhardt mounts stunning run against Faulkner", "performance_score": 0, "site": "cherokeetribune.com", "participants_count": 1, "title_full": "Reinhardt mounts stunning run against Faulkner", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T08:46:00.000+03:00", "replies_count": 0, "uuid": "049410f1794e268232e0e1086ed63e0b2433fdbf"}, "author": "Alex Resnak aresnak@cherokeetribune.com (noreply@cherokeetribune.com)", "url": "http://cherokeetribune.com/bookmark/26902985", "ord_in_thread": 0, "title": "Reinhardt mounts stunning run against Faulkner", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Reinhardt mounts stunning run against Faulkner by Alex Resnak October 11, 2015 12:46 AM | 414 views | 0 | 2 | | Reinhardt’s Aaron Kennedy makes a catch over Faulkner’s Dushonta Broughton. Kennedy and the Eagles won with 52 unanswered points. Special photo by Stephanie Scott slideshow WALESKA — Reinhardt scored 52 straight points to come back from another big deficit and it beat No. 10 Faulkner 55-27 to keep its perfect season alive.The game seemed to be getting away from the 13th-ranked Eagles (6-0, 1-0 Mid-South West Division) when Faulkner’s Joe Jones broke off touchdown runs of 39, 3 and 93 yards to put Reinhardt in a 21-3 hole less than 2 minutes into the second quarter. But a big fourth-down conversion turned momentum, and Reinhardt owned the next 40 minutes of the game.“Our boys just keep playing,” coach Drew Cronic said. “Now that they’ve done it a few times, they understand. That’s twice we’ve been down by that much, and they just believe that we have to keep hanging in there, and they believe in what we’re doing. We have a great group of kids.”Reinhardt took the lead for good when quarterback Ryan Thompson led the Eagles on a nine-play, 80-yard drive in the final 2:08 of the first half. The Eagles cemented that lead when they marched 69 yards in 15 plays on the half’s opening drive to take a 31-21 lead.L.J. Stegall (92 yards) and Niagel Curtis (90 yards, two touchdowns) led the Reinhardt rushing attack that accumulated 299 yards, but it was the newfound passing game that made the difference for the Eagles.After only throwing the ball six times last week against Bluefield, Thompson was 20-of-31 for 347 yards and two touchdowns. Aaron Kennedy led all Reinhardt receivers with 90 yards on four catches, while Sam Jones (four catches, 54 yards), Tyler Bradley (four catches, 53 yards) and Nate Holton (two catches, 50 yards) also came up big in the passing game.Reinhardt controlled the clock all day, holding the ball for more than 35 minutes, and the offense ran 95 plays for 646 total yards by operating at a tempo that was too much for Faulkner (3-2, 0-2) to handle.“That up-tempo style is really just who we are,” Cronic said. “We’re able to stay fresh deeper into games, because we run the kids a lot and practice at that tempo. It also helps our defense, because they practice against that tempo all week.“It’s not to say we’re in better shape than other teams. We’re just more used to it.”As good as the offense played, Cronic was even more impressed with his defense.“For them to just shut (Faulkner) down like they did, after getting run through for three touchdowns, showed an unbelievable ability to make adjustments,” Cronic said. “It was an unbelievable job of kids responding.”The defense was led by Marcus Miller, who recorded eight tackles, and Quincy Standifer, who had six stops.Reinhardt will travel to 3-3 Cumberland next week before awaiting a visit from current NAIA No. 1 Lindsey Wilson on Oct. 24.", "external_links": [], "published": "2015-10-11T08:46:00.000+03:00", "crawled": "2015-10-11T20:20:17.894+03:00", "highlightTitle": ""}