{"organizations": [], "uuid": "105948cc0dda74e9ffc6505b3723e8507443ffef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tennessean.com", "main_image": "http://www.gannett-cdn.com/-mm-/b2a1b22b6c8ec2a879a56b93fc93f0099ff436ca/c=0-808-2718-2337&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/18/USATODAY/usatsports/938ba4c0d533212e850f6a706700ec72.jpg", "site_section": "http://www.tennessean.com/sports/", "section_title": "The Tennessean|Sports", "url": "http://www.tennessean.com/story/sports/ncaaf/2015/10/18/american-uprising-memphis-temple-join-houston-in-ap-top-25/74178618/", "country": "US", "title": "American uprising: Memphis, Temple join Houston in AP Top 25", "performance_score": 0, "site": "tennessean.com", "participants_count": 1, "title_full": "American uprising: Memphis, Temple join Houston in AP Top 25", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T22:23:00.000+03:00", "replies_count": 0, "uuid": "105948cc0dda74e9ffc6505b3723e8507443ffef"}, "author": "tennessean", "url": "http://www.tennessean.com/story/sports/ncaaf/2015/10/18/american-uprising-memphis-temple-join-houston-in-ap-top-25/74178618/", "ord_in_thread": 0, "title": "American uprising: Memphis, Temple join Houston in AP Top 25", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The American Athletic Conference wants to be considered closer in quality to the Power Five conferences than it is to its fellow Group of Five leagues.\nThat claim is backed up by the results this season, including an American uprising in the AP Top 25.\nMemphis and Temple jumped into The Associated Press college football poll for the first time this season, joining Houston to give the American Athletic Conference three ranked teams for the first time in the history of the three-year old league.\nOhio State remained No. 1 in the AP Top 25 released Sunday. For the second straight week, six teams received first-place votes in the media poll, led by the Buckeyes with 28. No. 2 Baylor has 12, No. 3 Utah received 16, No. 4 TCU got three and No. 5 LSU and No. 6 Clemson each have one.\nThe Utes and LSU Tigers each edged ahead one spot after home victories on Saturday.\nMichigan State stayed at No. 7 after its miracle against Michigan and Alabama is No. 8 after handing Texas A&M its first loss.\nMemphis (6-0) had the big upset of the weekend against Mississippi. The Tigers 37-24 victory vaulted them into the rankings at No 18.\n\"It's one of the biggest wins we've had. It may be the most important based on where we are now,\" Commissioner Mike Aresco said Sunday. \"UCF's big win over Baylor (in the 2014 Fiesta Bowl) was really important because it gave us some instant credibility that year.\"\nMemphis has only been ranked two other times: For one week during the 2004 season the Tigers were 25th and in the final poll of last season they were 25th.\nTemple (6-0) was ranked No. 22. The Owls are in the AP poll for the first time since the final 1979 rankings.\n\"I'm really proud of our players and it's a tribute to them that people have noticed how they have played to this point,\" Temple coach Matt Rhule. \"I am thrilled that we have been able to get off to a 6-0 start. But I'll repeat what I have said before, it's a long season and I'll be happier if we can finish the year ranked among the best in the country.\"\nNo. 21 Houston is also 6-0 under new coach Tom Herman.\nThe American is what is left of the old Big East football conference after realignment stripped it of many of its top schools, such as Pittsburgh, West Virginia and Louisville. Aresco kept the conference alive by wooing a handful of Conference USA teams, including Memphis and Houston, and adding former independent Navy this season to create a 12-team conference.\nThe switch from the BCS to the College Football Playoff bumped the American into the Group of Five and out of the so-called power conferences that include the Atlantic Coast Conference, Big 12, Big Ten, Pac-12 and Southeastern Conference.\nBut the American has held its own against the Power Five this season, going 7-11 with wins against Penn State, Miami and Louisville. The Mountain West, Mid-American Conference, Sun Belt and Conference USA are a combined 9-73 against the Power Five teams.\n\"Our goal has always been to be viewed in the conversation with the so-called Power Five,\" Aresco said.\nAresco said he hopes coaching and a commitment from administrations that have been willing to invest in their football programs will help the American sustain success. The conference is stocked with coaches on the rise such as Rhule, Herman and Justin Fuente at Memphis, but keeping them around long-term could be tough.\nFor this season, the American is well-positioned to earn the spot saved for the highest ranked champion from the Group of Five in the New Year's Six bowls, but Aresco is thinking bigger.\n\"We want to be considered for the playoff spot,\" he said. \"We're not just content to be playing for a Group of Five spot on New year's Day.\"\n___\nCONFERENCE CALL\nSEC — 5.\nBig Ten — 4.\nBig 12 — 4.\nACC — 4.\nAmerican — 3.\nPac-12 — 3.\nIndependent — 1.\nMAC — 1.\nIN\nPittsburgh moved into the rankings at No. 25 and is off to a 5-1 start under new coach Pat Narduzzi. The Panthers are ranked for the first time since the 2010 preseason poll.\nOUT\nUCLA, Northwestern and Boise State each took their second losses of the season and fell out of the rankings.\nUP\nNo. 10 Stanford and No. 12 Iowa each moved up five spots after decisive victories and against conference rivals.\nDOWN\nThe biggest drops this week were all in the Southeastern Conference. No. 24 Mississippi fell 11 spots after being upset at Memphis. Texas A&M dropped six places into a tie for 15th after losing at home to Alabama. Florida fell five, from eighth to 13th after losing at LSU.\nMichigan's excruciating last-second loss to the Spartans cost the Wolverines two spots in the poll. They are tied with Texas A&M at 15.\nRANKED VS. RANKED\nAn elimination game in the SEC West is the only matchup of ranked teams this week.\nNo. 15 Texas A&M at No. 24 Mississippi.\n___\nFollow Ralph D. Russo www.Twitter.com/ralphDrussoAP\n___\nAP college football site: http://collegefootball.ap.org", "external_links": [], "published": "2015-10-18T22:23:00.000+03:00", "crawled": "2015-10-19T03:03:37.201+03:00", "highlightTitle": ""}