{"organizations": ["Giants"], "uuid": "bbe58c40413d239dc391fdf6a21e25c62e8f4a92", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "espn.go.com", "main_image": "http://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2015%2F1025%2Fr20029_1246x1246_1%2D1.jpg", "site_section": "http://news.google.com/news?pz=1&cf=all&ned=us&hl=en&topic=s&output=rss", "section_title": "Sports - Google News", "url": "http://espn.go.com/nfl/story/_/id/13973687/in-nfc-east-surprised-giants-coach-tom-coughlin-last-man-standing", "country": "IL", "title": "O'Connor: Don't be surprised if Giants coach Tom Coughlin is last man standing ... - ESPN", "performance_score": 0, "site": "go.com", "participants_count": 0, "title_full": "O'Connor: Don't be surprised if Giants coach Tom Coughlin is last man standing ... - ESPN", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T04:50:00.000+02:00", "replies_count": 0, "uuid": "bbe58c40413d239dc391fdf6a21e25c62e8f4a92"}, "author": "", "url": "http://espn.go.com/nfl/story/_/id/13973687/in-nfc-east-surprised-giants-coach-tom-coughlin-last-man-standing", "ord_in_thread": 0, "title": "O'Connor: Don't be surprised if Giants coach Tom Coughlin is last man standing ... - ESPN", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tom Coughlin"], "text": "print comment \nEAST RUTHERFORD, N.J. -- Tom Coughlin was walking down the tunnel leading to his locker room, his 100th regular-season victory with the New York Giants tucked firmly inside his hip pocket, when he was asked if his players' fight and resolve were reflections of the 69-year-old man paid to inspire them. \n\"I think it is, if truth be known,\" Coughlin told ESPN.com. \"That's probably a true statement.\" \nThe old man had a firm bounce in his step as he gestured toward the MetLife field, still lit up and buzzing after the Giants took first place in their oil spill of a division on a 100-yard kickoff return from Dwayne Harris , a former Dallas Cowboy who needed only 13 seconds to go coast to coast and break his former employer's heart. \n\"I still love this,\" Coughlin said. \"I still love the winning, I do. But I'm not crazy about the losing.\" \nAt the locker-room door, as his winning players bustled about, Coughlin stopped and said he was proud of how his team embodied his own resilient spirit. \"Especially when things are down,\" he said. \"This was not a great week for us, as you know.\" Editor's Picks Giants beat Cowboys for the first time since 2012 \nThe Giants took advantage of the Cowboys' injuries and some critical mistakes, snapping a five-game losing streak to their division rival. \nIn fact, this was the week Tom Coughlin's Giants were supposed to come undone. Just like last year, they had started 0-2 and bounced back to win three straight before suffering a demoralizing loss in Philadelphia. That 2014 defeat started a seven-game losing streak and, at season's end, compelled owner John Mara to effectively issue a playoffs-or-else mandate for his head coach and general manager, Jerry Reese. \nThe Cowboys followed the Eagles on the schedule this year, just like they followed them on the schedule last year. But this time Coughlin promised the beatdown in Philly would not define a season that would otherwise be his last. \nHe was right. He had no choice to be right. The Giants won ugly, won on the long Harris sprint and a Dominique Rodgers-Cromartie interception return for a touchdown. They won by a 27-20 count despite mediocre performances from their two best players, Eli Manning and Odell Beckham Jr ., a result reminding everyone who cares about the NFC East that Coughlin remains a pretty good bet to win it. \nBefore he disappeared into the night, Coughlin was told that everyone believes he does his best work when his circumstances are dire. The coach smiled. He knew this was a polite way of saying that everyone believes he does his best work when he's in danger of being fired. \n\"I don't understand that,\" Coughlin said, \"but if it's true that's the way it goes.\" \nBut why it is true? \n\"I don't know,\" he said. \"Nature. Nature of the animal.\" New York Giants coach Tom Coughlin congratulates wide receiver Dwayne Harris after a catch as defensive end Robert Ayers looks on. William Hauser/USA TODAY Sports \nThis has been Coughlin's nature for a long time. The first time he was nearly fired, at the end of the 2006 season, the Giants played hard enough for him in a playoff loss in Philly to persuade Mara to give him one last chance. The following season, with the 0-2 Giants down two touchdowns against Washington at halftime, Mara got out of his seat and told Reese he couldn't bear to watch anymore. \nThe Giants won that game, and ultimately won Super Bowl XLII over the 18-0 New England Patriots . Four seasons later, with Coughlin back on the brink with a 7-7 record, he beat his noisy neighbor, Rex Ryan, on Christmas Eve and ultimately won a second Super Bowl over his former Giants staffmate, Bill Belichick. \nThe 2015 Giants don't have the pass rush that those two championship teams had; in fact, the 2015 Giants don't have a pass rush at all. They could use even 40 percent of Jason Pierre-Paul, who injured his hand in a fireworks accident and might or might not return. On the other side of the ball, they could use whatever injured tackle Will Beatty and injured receiver Victor Cruz can give them if and when they return. \nUntil then, Coughlin will keep coaching his you-know-what off. He'll keep coaching the Giants with controlled desperation. \n\"I think he sets the example and challenges us every week,\" Eli Manning said as he headed for the MetLife Stadium exits. \"He has a lot of spirit and a lot of fight in him. He always talks a lot to us about finishing games and elevating our play, and I think we've responded to a lot of his challenges.\" \nManning has never played for another NFL coach, and he has never missed a single meaningful snap for Coughlin; together they've made 185 consecutive starts, postseason included. As he made his way to his car, Manning was asked if he was motivated by the cause of protecting his coach's job. \n\"I think that's a big part of it,\" he told ESPN.com. \"I definitely play for Coach Coughlin. I play for the players, ownership, our other coaches. I have great respect for all those guys. ... I want Coach to be a Hall of Famer. You definitely want to be a blessing in their lives and do your part for them.\" \nMaybe Coughlin has already done enough to earn his bust in Canton, and maybe he hasn't. But if he can lead these Giants to the postseason, it sure won't hurt his campaign. \nNo, they're hardly the only NFC East contender trying to work its way around devastating injuries. Truth is, if the Cowboys had Tony Romo and Dez Bryant on the field Sunday, they surely would've beaten the Giants for a sixth consecutive time. \nRemember Coughlin in early September assessing his talent? \"We're ready to start the season,\" he said. \"Whether you like it or not, it's right there. We're going to start the season.\" \nHe knew that he would be coaching for his job with an underwhelming circle of non-playmakers, and that it was possible the franchise's biggest concern in December would be figuring out a way to make his exit a thanks-for-the-memories celebration rather than a firing. \nBut there he was Sunday in MetLife, working it hard under a sunshiny sky that gave way to a picturesque moon. After Rodgers-Cromartie picked off a Matt Cassel pass to Terrance Williams in the third quarter and started his touchdown celebration a full 44 yards from paydirt, Coughlin let him have it. \n\"I try to get him not to hold the ball up in the air with a guy [running a 4.3 40] right behind him,\" Coughlin said in his postgame news conference. \"I just mentioned it to him in [the locker room], and he agreed.\" \nThe Giants usually do get around to agreeing with Coughlin. Not everyone in the organization was thrilled with Rodgers-Cromartie's choice to leave the game with what appeared to be a relatively minor hand injury, but the cornerback returned to gather in two interceptions, including the difference-maker, and to allow the Giants to stand alone in first place at 4-3. \n\"It keeps us relevant,\" Coughlin said. \"It keeps us in the hunt.\" \nHe praised his special teams for pouncing on Dallas mistakes, and he praised his quarterback for resisting the urge to play as recklessly as he had last week. But more than anything, Coughlin praised the Giants' willingness to fight the good fight in a game that was especially hard on the eyes. \n\"We wanted it bad,\" Coughlin said. \nThey want it as much as their old coach wants it. The NFC East has devolved into an unruly streetfight, a battle royale with bodies flying this way and that. Don't be surprised if Tom Coughlin is the last man standing in the end. 0 Shares", "external_links": [], "published": "2015-10-26T04:50:00.000+02:00", "crawled": "2015-10-26T05:28:50.773+02:00", "highlightTitle": ""}