{"organizations": [], "uuid": "bcc17ae3d4043208a1a72c62e23cd1b975188dd8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thenewsstar.com", "main_image": "http://www.gannett-cdn.com/-mm-/1a7130d0282cf5da91c714abdef48d0c5ba233c1/c=0-124-2401-1475&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/02/Monroe/B9319096985Z.1_20151002225738_000_GCIC4DN1B.1-0.jpg", "site_section": "http://rssfeeds.thenewsstar.com/monroe/sports", "section_title": "Monroe - Sports", "url": "http://www.thenewsstar.com/story/sports/high-school/2015/10/02/rebels-rock-ridgeway/73255606/", "country": "US", "title": "Rebels rock Ridgeway", "performance_score": 0, "site": "thenewsstar.com", "participants_count": 0, "title_full": "Rebels rock Ridgeway", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T06:02:00.000+03:00", "replies_count": 0, "uuid": "bcc17ae3d4043208a1a72c62e23cd1b975188dd8"}, "author": "", "url": "http://www.thenewsstar.com/story/sports/high-school/2015/10/02/rebels-rock-ridgeway/73255606/", "ord_in_thread": 0, "title": "Rebels rock Ridgeway", "locations": ["West Monroe"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Cody Futrell", "Slade Bolden"], "text": "Rebels rock Ridgeway Cody Futrell , cfutrell@thenewsstar.com 10:02 p.m. CDT October 2, 2015 West Monroe’s Slade Bolden (10) runs for a Rebel touchdown in first half action against the Ridgeway Roadrunner Friday night in West Monroe. (Photo: MICHELLE TRIPP/THE NEWS-STAR) 4 CONNECT 6 TWEET LINKEDIN COMMENT EMAIL MORE \nWest Monroe played the tough nosed host, rolling to a 38-13 win Friday over Ridgeway High of Memphis, Tennessee at Don Shows Field at Rebel Stadium. \nQuarterback Slade Bolden scored two touchdown runs and passed for one to Chandler Neal. Bolden led a Rebel offense that had its way most of the night both pawing and running the ball with success. \nGETTING DEFENSIVE: The West Monroe defense had a stellar effort as well. West Monroe linebacker Jacob Adams had a huge night against Ridgeway. Adams forced three fumbles and had several tackles for losses as he seemed to be in the Roadrunner backfield as much as the visitors. \nGOOD PLAY: West Monroe quarterback Robert Scott Foust rolled out of trouble on a key third down in the second quarter and fired deep into the back of the endzone to wide receiver Jake Norris for a 19-yard touchdown and a 24-0 lead with 5:42 left before halftime. \nSlade Bolden also fired a touchdown pass to tight end Chandler Neal in the second quarter on a Mickey executed jump pass. Bolden ran for a nine-yard touchdown in the first quarter as well. \nLinebacker John Bailey Gullatt made a big defensive play with an interception of Roadrunners quarterback Tyrique Sandusky. Sandusky had a rough night under pressure with four turnovers (three fumbles) but passed for 114 yards against the Rebels (5-0). \nRidgeway (4-3) scored its lone touchdown on a Lilotis Walker touchdown with 4:52 left in the fourth quarter. \nSOMETHING SPECIAL: Ridgeway principal Dr. Jon Stencel is a former coach and teacher at West Monroe. Stencel was back on Friday with the Roadrunners. The Stencel family still has family living in West Monroe. \nStencel coached at the high school as soccer coach 1997-1998 and was a football coach at West Monroe Junior High. \nBAD PLAY: West Monroe attempted to execute a fake punt in the first quarter but Bolden was stopped short of the marker. It was one of a handful of plays that didn’t go right on Friday as most everything the a Rebels did was positive during a 24-0 halftime lead. \nUP NEXT: West Monroe travels to Ruston to begin District 2-5A play next Friday, October 9. Ridgeway hosts Kingsbury (Tennessee). \nConnect with Cody on Twitter @cfutrellTNS or via e-mail cfutrell@thenewsstar.com 4 CONNECT 6 TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http://tnsne.ws/1RlHdbZ TOP VIDEOS", "external_links": [], "published": "2015-10-03T06:02:00.000+03:00", "crawled": "2015-10-03T06:54:45.390+03:00", "highlightTitle": ""}