{"organizations": [], "uuid": "63d9192c8a3b6b6137b83d9b78eebd6045e67d07", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.baltimoresun.com", "main_image": "http://www.trbimg.com/img-5619e20e/turbine/fl-miami-hurricanes-fsu-game-1011-20151010", "site_section": "http://feeds.baltimoresun.com/baltimoresun/sports/college/rss2.0.xml", "section_title": "College Sports - Baltimore Sun", "url": "http://www.baltimoresun.com/sports/college/fl-miami-hurricanes-fsu-game-1011-20151010-story.html", "country": "US", "title": "Hurricanes lose to No. 12 Seminoles - again", "performance_score": 0, "site": "baltimoresun.com", "participants_count": 1, "title_full": "Hurricanes lose to No. 12 Seminoles - again", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T10:39:00.000+03:00", "replies_count": 0, "uuid": "63d9192c8a3b6b6137b83d9b78eebd6045e67d07"}, "author": "Christy Cabrera Chirinos", "url": "http://www.baltimoresun.com/sports/college/fl-miami-hurricanes-fsu-game-1011-20151010-story.html", "ord_in_thread": 0, "title": "Hurricanes lose to No. 12 Seminoles - again", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Hurricanes lose to No. 12 Seminoles — again Hurricanes QB Brad Kaaya: 'We had them on the ropes' \nMiami quarterback Brad Kaaya on the disappointment of losing to FSU. \nMiami quarterback Brad Kaaya on the disappointment of losing to FSU. 'Canes drop sixth in a row in series against rival Seminoles \nThe Hurricanes came into this rivalry game having lost five straight to Florida State. \nThey were reeling after an embarrassing loss to Cincinnati. And they and their coach have been facing an increasing amount of criticism from a frustrated fan base desperate to see the program back on track. \nAnd Saturday night in Tallahassee, Miami came tantalizingly close to getting the kind of win it has so desperately wanted in recent seasons, but a familiar face broke the Hurricanes’ hearts again. \nMinutes after Miami took its first and only lead against FSU early in the fourth quarter on an improbable touchdown catch by Stacy Coley, Seminoles running back Dalvin Cook scored on a 23-yard run that proved the eventual difference in FSU’s 29-24 win over the Hurricanes at Doak Campbell Stadium. \nIt’s the second straight year the former Miami Central star – and former teammate of Hurricanes running back Joe Yearby – has scored the go-ahead touchdown in the fourth quarter. \nHighlights of the the Miami Hurricanes at Florida State Seminoles at Bobby Bowden Field at Doak Campbell Stadium in Tallahassee, Fla., Saturday, Oct. 10, 2015, from Sentinel staff photographers Stephen M. Dowell and Joe Burbank. \nThat run was just one of the highlights from a 22-carry, 222-yard effort from Cook, who established a new series high against Miami by a Seminoles (5-0) running back with his performance Saturday. \n“He’s a great back. He’s a great back and we missed too many tackles on him and obviously, he got free in the open field,” a dejected Miami coach Al Golden said. “Talented player.” \nStill, even after Cook’s score, the Hurricanes had one last chance to drive down the field, taking over on their final possession with 2:45 left. But FSU’s defense harassed Miami quarterback Brad Kaaya and batted down three of his passes to end the Hurricanes’ threat. \nPerhaps no yearly matchup in college football has spawned a greater collection of NFL-caliber talent--certainly over the past three decades--than the annual Miami Hurricanes-Florida State Seminoles game. Here are a collection of the series' standout performances----throughout a game, or even in a crucial moment of a win. (Steve Svekis) \nFor Miami, now the focus becomes making sure the season doesn’t unravel. After each of their previous two losses to FSU in 2013 and 2014, Miami has sputtered, combining to go 2-6 against ACC and postseason opponents. \nWith Miami now facing a stretch of seven games conference games that can't happen again. And Kaaya, the unquestioned leader in the Hurricanes’ locker room, said it wouldn't. \n“We have to bounce back from it. We can’t let what happened last year happen again. We can’t let this linger,” said Kaaya, who threw for a career-high 405 yards with three touchdowns in the loss. “We have to get right back to it starting tomorrow. We have the Coastal [Division] now and that’s been our goal since day one, to win the Coastal and it starts with Virginia Tech this next week. That’s a good team.” \nThough Miami (3-2) had its chances in the second half, the first half looked eerily similar to how things played out early in last week’s loss at Cincinnati. \nAgain, Miami saw an opponent get off to a quick start. Again, the Hurricanes looked to be in serious trouble. And yet again, the offense found a little bit of a spark and the defense made a few key stops to keep the game from getting completely out of reach before the half. \nWhat was slightly different though was how this time, Miami’s opponent dominated on the ground. \nWhile at Cincinnati it was quarterback Hayden Moore that shone for the Bearcats, here in Tallahassee it was Cook, who for the second straight week, scored a long touchdown run on his first carry of the game. \nAgainst Wake it was a 94-yarder, against Miami it was a 72-yard run, one during which he sprinted past multiple Miami defenders that couldn’t catch the speedy sophomore as he got into the end zone. \nWhile the Hurricanes answered with an 11-play, 62-yard drive that culminated with a 30-yard field goal from Michael Badgley, Cook made his presence felt again on FSU’s ensuing drive. \nThis time, it was Cook catching a pass from Everett Golson and going 36 yards for a touchdown that extended FSU’s lead to 14-3 after Roberto Aguayo’s extra point. \nGolson, who has had some ups and downs early in the season, was a force Saturday. He completed 9 of his first 10 passes for 124 yards before going on to finish the night 25 of 33 for 291 yards. \nThe 12th-ranked Seminoles pushed their lead to 17-3 after a 22-yard field goal from Aguayo, and it was after that that Miami’s offense found a little bit of life thanks to Kaaya and Rashawn Scott. \nThe duo connected three times on the drive, including on a beauty of a 58-yard touchdown catch from Scott that seemed a precursor for what was to come in the second half from the Hurricanes offense. \nScott finished with six catches for 108 yards, while Stacy Coley had a career-high 139 yards on seven catches. It marked the first time since Nov. 16, 2013 that two Miami receivers topped the 100-yard mark. \nccabrera@tribpub.com ; On Twitter @ChristyChirinos.", "external_links": [], "published": "2015-10-11T10:39:00.000+03:00", "crawled": "2015-10-11T19:29:46.493+03:00", "highlightTitle": ""}