{"organizations": [], "uuid": "5239093e0182dc76f293342963ea9b61ea2a85ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "nypost.com", "main_image": "https://thenypost.files.wordpress.com/2015/10/sm3.jpg", "site_section": "http://nypost.com/sports/feed/", "section_title": "| Sports | New York Post", "url": "http://nypost.com/2015/10/13/stone-cold-steven-matzs-history-as-big-game-pitcher/", "country": "", "title": "Stone-cold Steven Matz’s history as big-game pitcher", "performance_score": 0, "site": "nypost.com", "participants_count": 1, "title_full": "Stone-cold Steven Matz’s history as big-game pitcher | New York Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T04:12:00.000+03:00", "replies_count": 0, "uuid": "5239093e0182dc76f293342963ea9b61ea2a85ae"}, "author": "Howie Kussoy", "url": "http://nypost.com/2015/10/13/stone-cold-steven-matzs-history-as-big-game-pitcher/", "ord_in_thread": 0, "title": "Stone-cold Steven Matz’s history as big-game pitcher", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Steven Matz’s face looked no different than any point since being called up by the Mets this summer, his voice the same as in casual conversation.\nOne day from pitching the biggest game of his career, the Long Island lefty revealed no more sentiment than stone, feeling fully prepared — as a rookie with six career starts — for the weight that comes with starting Game 4 of the NLDS against the Dodgers, for the opportunity to send his hometown team to the NLCS.\n“I’m taking the emotions out of it, treating it like any other game,” Matz said before Monday’s 13-7 victory gave the Mets a 2-1 series lead. “You prepare for this point, so that’s what I’m going to do. … I have a job to do and that’s what I’m going to focus on is to help my team win this game.”\nFor Matz, the words appear closer to truth than cliché, having pitched his best in postseason-clinching chances the past two years while in the minors. In 2013, Matz threw 5 ²/₃ scoreless innings and struck out nine to win a championship for Single-A Savannah. The next season, he started the title-clincher for Double-A Binghamton, striking out 11 and taking a no-hitter into the seventh inning.\nMatz’s family, who attended Monday’s game and will occupy another eight seats at Citi Field on Tuesday night, repeatedly have seen over the years how the southpaw’s focus tightens when the stakes suggest it.\n“It’s odd, but when there’s pressure on, he does better,” said Bert Moller, Matz’s grandfather. “If he has the bases loaded and a 3-2 count, he’s going to strike the guy out. It seems to be, he needs a little pressure.”\nWhen healthy, Matz has proven his place among the Mets’ other young aces — going 4-0 with a 2.27 ERA in six starts — but since debuting on June 28, he missed two months with a lat injury, then left his first start back due to a blister.\nMatz has not pitched in the majors since Sept. 24 because of a back injury, but said he’s no longer bothered by the ailment and is unconcerned about the layoff. Recent enough was Matz’s home start against the Yankees on Sept. 18, in which the 24-year-old allowed one run in an intense six-inning outing.\n“I think that did help me a lot because now this won’t be the first time I’ll be pitching in front of a crowd like that,” said Matz, who also threw six shutout innings against the Dodgers in his second career start. “Now it’s kind of like I’ve been there and I feel ready to do it.”\nMatz may be ready, but his family still finds it hard to fathom.\nSaturday night, Matz arrived in New York after throwing in Port St. Lucie, his father, Ron, picking him up at Long Island’s MacArthur Airport and bringing him back to their Stony Brook home. Inside was where Matz watched so many Mets games growing up, including the 2006 NLCS. Outside was where he dreamed of playing pro baseball, hitting and throwing in the yard until dark.\nPart of it all still feels like a dream — and part of it probably always will.\n“It just blows my mind,” his dad said. “I’m going to be numb. When he’s pitching, it’s almost like you go into a zone where it doesn’t feel like it’s really happening. It’s a surreal zone.\n“It’s just unbelievable. He’s definitely focused and feels great. The last two years in a row, he pitched the deciding game and the outcome was always pretty damn good.”\nShare this: Facebook Twitter Google Whatsapp Email Filed under mlb playoffs ,  new york mets ,  steven matz", "external_links": [], "published": "2015-10-13T04:12:00.000+03:00", "crawled": "2015-10-13T09:32:23.171+03:00", "highlightTitle": ""}