{"organizations": [], "uuid": "962791336b2f65d89e3d2a6f55e6f8dc0d51e7e1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.miamiherald.com", "main_image": "http://www.miamiherald.com/news/local/community/miami-dade/coral-gables/vpjc71/picture41103837/ALTERNATES/LANDSCAPE_1140/Paseo%204", "site_section": "http://www.miamiherald.com/?widgetName=rssfeed&widgetContentId=712015&getXmlFeed=true", "section_title": "Breaking News, Sports, Weather & More | MiamiHerald.com &", "url": "http://www.miamiherald.com/news/local/community/miami-dade/coral-gables/article41103843.html", "country": "US", "title": "Coral Gables tentatively OKs Paseo project", "performance_score": 0, "site": "miamiherald.com", "participants_count": 1, "title_full": "Coral Gables tentatively OKs Paseo project", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:05:00.000+03:00", "replies_count": 0, "uuid": "962791336b2f65d89e3d2a6f55e6f8dc0d51e7e1"}, "author": "Lance Dixon \nldixon@miamiherald.com", "url": "http://www.miamiherald.com/news/local/community/miami-dade/coral-gables/article41103843.html", "ord_in_thread": 0, "title": "Coral Gables tentatively OKs Paseo project", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Coral Gables tentatively OKs Paseo project \nDevelopers proposed reducing part of project to 133 feet \nSome residents remain concerned over height, traffic \nCommission asked for more staff and community input before next vote A rendering of the proposed Paseo de la Riviera project as seen from Jaycee Park in Coral Gables. NP International An overhead view of the Holiday Inn on South Dixie Highway, which a developer wants to replace with a pair of Mediterranean-style towers. NP International 1 of 2 Order Reprint of this Story \nCoral Gables commissioners initially approved Thursday the much-debated Paseo de la Riviera project on the site of the Holiday Inn on South Dixie Highway, across from the University of Miami. \nThey approved three requests at the special meeting: A land-use change from commercial low-rise to high-rise intensity, a zoning code amendment and a planned area development review for the site. \nThe City Commission voted 4-1 on the three items with Commissioner Jeannett Slesnick voting against each ordinance. \nThe proposed development would replace the existing Holiday Inn at 1350 S. Dixie Hwy., with a Mediterranean-style complex of two 140-foot towers — one a hotel, the other apartments — joined by a cafe-lined public plaza. \nA major sticking point has been the height of the project and Thursday’s approval included reducing the proposed height of the apartment building from 142 feet to 133 feet (which includes a parking garage). The portion of that building that faces the residential Riviera neighborhood on Madruga Avenue would be capped at 45 feet. The proposal for the 10-story hotel would remain unchanged. \nThe developers, NP International, accepted that any-site specific changes to zoning would apply only to the Paseo project site not the entire tract of land it sits on. \nDuring the nearly eight-hour meeting, many residents on both sides said they supported some kind of development, but opposing voices raised concerns about traffic, the project’s scale and the potential for other large-scale projects to follow. \n“It’s a beautiful building on paper, but I’m afraid it won’t be as pretty once it takes form,” said resident Roberta Neway. \nSupporters emphasized the proximity to Metrorail, the pedestrian bridge now being built across South Dixie Highway, connecting UM and the Metrorail station with the shopping center that houses TGIFriday’s, Bagel Emporium and other tenants. They said the corridor needed more notable development. \n“We can’t live in a time capsule; change is inevitable,” said resident Heidi Roth. \nThe commission was mostly unanimous in its request that the developer and staff meet to discuss reducing the size and density of the project and to get more residents’ input before the next vote. The next vote, which would be the final vote, will be sometime in November. \n“I do think we have a nice design and I do think we have a developer that’s willing to work with the neighborhood,” said Vice Mayor Frank Quesada. “However, if it does stay at the same scale that it’s currently at, my vote at the second hearing will be a no.”", "external_links": [], "published": "2015-10-23T03:05:00.000+03:00", "crawled": "2015-10-23T05:36:20.227+03:00", "highlightTitle": ""}