{"organizations": ["UCI", "AP"], "uuid": "0de984d3883126e7d5567b802a937aea01e53abd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newsleader.com", "main_image": "http://www.gannett-cdn.com/-mm-/7083d6523cd356d929eca7c37420df7b4123df28/c=0-1-4076-2304&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/02/Staunton/Staunton/635793817546796175-World-Championships-C-Wolf-2-.jpg", "site_section": "http://rssfeeds.newsleader.com/staunton-sports", "section_title": "Staunton - Sports", "url": "http://www.newsleader.com/story/sports/2015/10/03/pittsburgh-holds-virginia-tech/73294148/", "country": "US", "title": "King's road to Richmond", "performance_score": 0, "site": "newsleader.com", "participants_count": 0, "title_full": "King's road to Richmond", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T22:24:00.000+03:00", "replies_count": 0, "uuid": "0de984d3883126e7d5567b802a937aea01e53abd"}, "author": "", "url": "http://www.newsleader.com/story/sports/2015/10/03/pittsburgh-holds-virginia-tech/73294148/", "ord_in_thread": 0, "title": "King's road to Richmond", "locations": ["Serbia", "United States", "Va.", "Ukraine", "Richmond Eden Otero", "Ireland", "Richmond", "New Zealand"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Andriy Khripta", "Ben King", "Jesse Sergent", "Dean Hoffmeyer", "Conor Dunne", "Ivan Stevic", "Robert E. Lee"], "text": "King's road to Richmond Eden Otero , eotero@newsleader.com 3:24 p.m. EDT October 2, 2015 An early breakaway group, including, from left, Conor Dunne, of Ireland; Jesse Sergent, of New Zealand;; Ben King, of the United States; Ivan Stevic, of Serbia; and Andriy Khripta, of Ukraine, cycles past the Robert E. Lee statue on Monument Avenue during the UCI men's elite road championship in Richmond, Va., on Sunday, Sept. 27, 2015 (Dean Hoffmeyer/Richmond Times-Dispatch via AP) (Photo: Dean Hoffmeyer, AP) 2 CONNECT 1 TWEET LINKEDIN COMMENT EMAIL MORE \nWith crowds gathered around the steep, cobbled pathway, the climb up Libby Hill in Richmond will live on as one of Ben King’s greatest accomplishments. \nThis year, the UCI Road Cycling World Championships was held in Richmond, it was the first time since 1986 that Americans were able to compete for the world title on their home soil. \nBut for King, it was more than competing in America. It meant competing in his home state just 70 miles away from Charlottesville — the city he calls home. \n“This is the only race that (my family) has had to see me in,” King said. “Richmond is not necessarily on the map for cycling for the U.S., but it is now.” \nWhile King’s season was completed after he finished the World Championship, his road to Richmond wasn’t an easy one. \nFrom a dangerous crash during the Tour of Utah to nearly having his bike stolen in the Tour of Spain and then getting sick during his last week of racing in Spain, this season was one that left the cyclist wondering if he would be fit enough to take on the world title. \n“When I came home from Spain when I rode easy I felt absolutely terrible,” King said. “I was just like, ‘What am I doing out here, I just want to turn around and go back to bed,’ and when I would go hard, it wouldn’t feel great, but I could just go so hard. I would look down and go, ‘Wow, I’m in pretty good shape right now.’” \nKing’s stint in Spain was only his second grand tour in his career — his first being the Tour of France in 2014 — but he credits the three week long race to his physicality heading into worlds. \nWhile King joked that the difference between the Tour of Spain and the Tour of France was the language, he said the difference in pressure and mental toughness was key in his training for Richmond. \nThe Tour of France was high-pressure and high stakes for King, while the Tour of Spain was more relaxed but still highly competitive. \nIt was the perfect training regimen for a cyclist preparing for a big race. \n“Doing any grand tour kind of puts you to a new level physically that you wouldn’t usually be at,” King said. “It kind of toughens you up, hardens you. ...For me it was perfect.” \nKing’s job during the Richmond race was to lead eight to 10 guys into a breakaway, so America wouldn’t have to chase at any point. As he made the first breakaway in the race, it set up his teammate Alex Howes to take 12th overall place. \nKing may not have placed, but it’s not about picking up the win for himself. The cyclist is known for his workhorse mentality and drive to get his team into positions in which they can compete and, hopefully, win. \nIt’s what makes him such an asset to teams. 2 CONNECT 1 TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http://www.newsleader.com/story/sports/2015/10/02/ben-king-road-cycling-championship-richmond/73202414/ TOP VIDEOS", "external_links": [], "published": "2015-10-02T22:24:00.000+03:00", "crawled": "2015-10-03T23:51:49.804+03:00", "highlightTitle": ""}