{"organizations": [], "uuid": "72760544c9ef1ee187167b11164223e80edcdf29", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.completesportsnigeria.com", "main_image": "http://www.completesportsnigeria.com/wp-content/uploads/2015/10/AMA310366.jpg", "site_section": "http://www.completesportsnigeria.com/feed/", "section_title": "Complete Sports Nigeria", "url": "http://www.completesportsnigeria.com/ikeme-benched-onazi-oboabona-ekong-oshaniwa-in-action/", "country": "US", "title": "Ikeme Benched; Onazi, Oboabona, Ekong, Oshaniwa In Action", "performance_score": 0, "site": "completesportsnigeria.com", "participants_count": 1, "title_full": "Ikeme Benched; Onazi, Oboabona, Ekong, Oshaniwa In Action", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T22:16:00.000+03:00", "replies_count": 0, "uuid": "72760544c9ef1ee187167b11164223e80edcdf29"}, "author": "Nurudeen Obalola", "url": "http://www.completesportsnigeria.com/ikeme-benched-onazi-oboabona-ekong-oshaniwa-in-action/", "ord_in_thread": 0, "title": "Ikeme Benched; Onazi, Oboabona, Ekong, Oshaniwa In Action", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Eagles Euro Roundup / Ikeme Benched; Onazi, Oboabona, Ekong, Oshaniwa In Action Ikeme Benched; Onazi, Oboabona, Ekong, Oshaniwa In Action Eagles Euro Roundup , Headlines \nBy James Agberebi: \nSuper Eagles keeper, Carl Ikeme, was an unused substitute for Wolverhampton Wanderers in their 4-2 away loss to Derby County on Sunday. Ikeme, who was in goal for the Super Eagles during the international break, has appeared three times for Wolves this season. In Serie A, Ogenyi Onazi made his second appearance for Lazio but couldn’t prevent them from losing 2-1 away to Sassuolo. Onazi was to later come off for Balde Diao Keita in the 46th minute of the encounter. \nGodfrey Oboabona made a 90 minute appearance for Rizespor in their Turkish league encounter against Besiktas. But a 63rd minute Ricardo Quaresma condemned Rizespor to a 1-0 defeat. Also in Turkey, Raheem Lawal was in the starting 11 for Eskisehirspor in their 1-0 away loss to Akhisar Belediye. Lawal was substituted for Alpaslan Ozturk in the 61st minute. Former Ashdod defender, Juwon Oshaniwa, started in Hearts’ 1-0 away win against Dundee United in a Scottish league clash. Oshaniwa later made way for Liam Smith in the 71st minute. \nGent’s on-loan defender, William Troost-Ekong, featured for 90 minutes in Haugesund’s 2-0 loss to Lillestrom in Norway. It was Ekong’s 11th league appearance for Haugesund this term. Former Flying Eagles star, Michael Olaitan, was in action for FC Twente as they beat NEC Nijmegen 1-0 in the Dutch Erdivisie. Olaitan was later substituted for Thomas Agyepong in the 65th minute. \nStill in the Dutch league, Nigerian striker, Abiola Dauda, replaced Chelsea’s on-loan player Dominic Solanke, as Vitesse thrashed home side PEC Zwolle 5-1. Solanke scored one of the goals for Vitesse. In the Belgian league, Nigerian forward, Joseph Akpala, was introduced in the 47th minute for Knowledge Musona but was unable to rescue at least a point for Oostende who lost 1-0 to Club Brugge. His Nigerian team-mate, Saviour Godwin, was an unused substitute. One-cap Super Eagles forward, Imoh Ezekiel, made a 90 minute appearance for Anderlecht in their 4-0 thumping of Zulte-Waregem. Ezekiel was however booked as early as the 13th minute. In Sweden, vormer Super Eagles and Fulham midfielder, Dickson Etuhu, was in action for 90 minutes for AIK as they defeated Halmstad 1-0. But it wasn’t a day to remember for former Flying Eagles star, John Owoeri, whose side Aatvidaberg were thrashed 6-0 by Falkenbergs.", "external_links": [], "published": "2015-10-18T22:16:00.000+03:00", "crawled": "2015-10-19T01:13:00.862+03:00", "highlightTitle": ""}