{"organizations": ["UEFA Champions League Group Stage", "Bayern Munich", "Reuters", "ArsenalAction Images via Reuters", "Arsenal"], "uuid": "615fd160e7900575b7622c21dfed7298f170668e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "http://s2.reutersmedia.net/resources/r/?m=02&d=20151020&t=2&i=1088469190&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB9J1F4", "site_section": "http://mf.feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "http://uk.reuters.com/article/2015/10/20/uk-soccer-champions-ars-fcb-idUKKCN0SE2RH20151020?feedType=RSS&feedName=sportsNews", "country": "US", "title": "Resilient Arsenal bounce back to beat Bayern", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "Resilient Arsenal bounce back to beat Bayern", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T00:51:00.000+03:00", "replies_count": 0, "uuid": "615fd160e7900575b7622c21dfed7298f170668e"}, "author": "", "url": "http://uk.reuters.com/article/2015/10/20/uk-soccer-champions-ars-fcb-idUKKCN0SE2RH20151020?feedType=RSS&feedName=sportsNews", "ord_in_thread": 0, "title": "Resilient Arsenal bounce back to beat Bayern", "locations": ["England", "London"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Philipp LahmReuters", "Alexis Sanchez", "Giroud", "Bayern Olivier Giroud", "Petr Cech", "Dylan MartinezLivepic"], "text": "Olivier Giroud scores the first goal for Arsenal. Reuters / Dylan MartinezLivepic left 1 of 5 right Football - Arsenal v Bayern Munich - UEFA Champions League Group Stage - Group F - Emirates Stadium, London, England - 20/10/15Mesut Ozil celebrates with team mates after scoring the second goal for ArsenalReuters / Dylan MartinezLivepicEDITORIAL USE ONLY. left 2 of 5 right Football - Arsenal v Bayern Munich - UEFA Champions League Group Stage - Group F - Emirates Stadium, London, England - 20/10/15Arsenal's Petr Cech makes a saveAction Images via Reuters / Tony O'BrienLivepicEDITORIAL USE ONLY. left 3 of 5 right Football - Arsenal v Bayern Munich - UEFA Champions League Group Stage - Group F - Emirates Stadium, London, England - 20/10/15Olivier Giroud scores the first goal for ArsenalAction Images via Reuters / Tony O'BrienLivepicEDITORIAL USE ONLY. left 4 of 5 right Football - Arsenal v Bayern Munich - UEFA Champions League Group Stage - Group F - Emirates Stadium, London, England - 20/10/15Arsenal's Alexis Sanchez in action with Bayern Munich's Philipp LahmReuters / Dylan MartinezLivepicEDITORIAL USE ONLY. left 5 of 5 right \nLONDON Arsenal bounced back off the ropes to land two late sucker-punches and score an unlikely 2-0 win over Bayern Munich after the Germans had dominated an outstanding Champions League match on Tuesday. \nOlivier Giroud came off the bench after 74 minutes and headed the opener three minutes later while Mesut Ozil scored with virtually the last kick of the game against his World Cup-winning team mate Manuel Neuer to hand Arsenal a memorable victory. \nTheir first win in Group F after two defeats rekindled their chances of reaching the last 16 and ended Bayern's run of 12 successive wins in all competitions. \n\"It was important to reproduce our Premier League form tonight and we did that. We got the balance right between defence and attack,\" Arsenal manager Arsene Wenger told reporters. \nBut for long periods, it looked as if a goalless draw or a Bayern win would be the most likely outcome. \nBayern dominated possession but could not find a way past a superb Arsenal defence in which Laurent Koscielny and Per Mertesacker played superbly and Petr Cech made some important saves. \nAt the other end, Arsenal had more chances, but never looked like getting the better of Neuer who made one stunning save to deny Theo Walcott from scoring with a header after 34 minutes, but then cost his team dearly when he flapped at Santi Cazorla's 77th minute freekick, allowing Giroud, who had just replaced Walcott, to stoop low and head home. \nOzil scored on a breakaway with virtually the final kick when his shot just crossed the line with Neuer scooping it clear just too late. \nThe victory means Bayern and Olympiakos have six points apiece, Dinamo Zagreb and Arsenal three each with Arsenal travelling to Munich and Olympiakos at home to Dinamo next. \nBayern, without the injured Arjen Robben, Franck Ribery and Mario Goetze, still had plenty of potency going forward and although Robert Lewandowski, with 15 goals in his last seven games, was kept relatively quiet, they continually forced Arsenal on to the backfoot. \nAlthough there were no goals before the break, both teams produced football of the highest quality with the pace never relenting from the kickoff, which some 300 Bayern fans missed. \nThey staged a \"stay-away\" for the first five minutes to protest over the cost of a ticket for the match, but when they took their seats, applause rang around the stadium from both home and visiting supporters.", "external_links": [], "published": "2015-10-21T00:51:00.000+03:00", "crawled": "2015-10-21T01:06:42.937+03:00", "highlightTitle": ""}