{"organizations": ["Athletics", "Giants"], "uuid": "450a46c2813b2ffc8103b7ae85b887f556b5d439", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wgal.com", "main_image": "http://www.wgal.com/image/view/-/31313588/highRes/2/-/maxh/630/maxw/1200/-/a02rio/-/Barry-Zito--San-Francisco-Giants--2013-jpg.jpg", "site_section": "http://www.wgal.com/9361456?format=rss_2.0&view=feed", "section_title": "Sports News", "url": "http://www.wgal.com/sports/former-cy-young-winner-zito-announces-retirement/35924550", "country": "US", "title": "Former Cy Young winner Zito announces retirement", "performance_score": 0, "site": "wgal.com", "participants_count": 0, "title_full": "Former Cy Young winner Zito announces retirement", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T00:16:00.000+03:00", "replies_count": 0, "uuid": "450a46c2813b2ffc8103b7ae85b887f556b5d439"}, "author": "", "url": "http://www.wgal.com/sports/former-cy-young-winner-zito-announces-retirement/35924550", "ord_in_thread": 0, "title": "Former Cy Young winner Zito announces retirement", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Zito"], "text": "Former Cy Young winner Zito announces retirement Left-hander played 15 seasons for Giants, Athletics UPDATED 5:16 PM EDT Oct 19, 2015 Photos Denis Poroy/Getty Images \nLeft-hander Barry Zito, the 2002 American League Cy Young Award winner while with the Oakland Athletics, officially announced his retirement Monday. Cubs' Maddon preaches patience \nZito finished his career with a 165-143 record and 4.04 ERA in 2,576 2/3 innings over 15 seasons with the A's and San Francisco Giants. He was part of two World Series winners in San Francisco. He made three All-Star teams and went 6-3 with a 2.83 ERA over 10 postseason starts. \nZito announced the news in a first-person article on The Players' Tribune website . \n\"I'm retiring today from baseball, but I'll never be too far away from the game that made me who I am,\" Zito wrote. \"I am beyond thankful to be at peace with walking away, thanks in large part to my year of renewal in Nashville with the Sounds. \n\"My return to Oakland last month was a 'cherry on top' moment in my life that my family and I will never forget. I will no doubt be in the stands on both sides of the Bay in years to come.\" \nThe 37-year-old Zito was referring to the 2015 season he spent with Oakland's Triple-A team, the Nashville Sounds, before the A's called him up to the majors in late September. He made three appearances, including two starts, and pitched seven innings, giving up eight runs for a 10.29 ERA. \nZito's late parents were in the music industry. He said playing last season in \"Music City\" in Nashville, Tenn., allowed him to reconnect with those roots and start a new career. \n\"Today, I am very excited to be a 'rookie' all over again in a new field: songwriting,' Zito wrote. \"I am sure the lessons baseball has taught me will help me develop the thick skin I'll need for this new endeavor. If one day you ever happen to hear a song of mine, I hope you'll be honest about what you think. I have been building a skill set of handling adversity for years, so fire away!\" Distributed by LAKANA and The Sports Xchange.  ", "external_links": [], "published": "2015-10-20T00:16:00.000+03:00", "crawled": "2015-10-20T04:07:42.660+03:00", "highlightTitle": ""}