{"organizations": ["Manchester United"], "uuid": "15c74443b4e87ddac8674c269718817dee8fb94e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/gk0ner5ddx_3969784269471_4942389293211.jpg", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=2&gender=1", "section_title": "Sports News", "url": "http://www.modernghana.com/sports/648942/2/rio-ferdinand-admits-he-was-upset-at-being-snubbed.html", "country": "US", "title": "Rio Ferdinand admits he was upset at being snubbed for Manchester United captaincy", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "Rio Ferdinand admits he was upset at being snubbed for Manchester United captaincy", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T16:06:00.000+03:00", "replies_count": 0, "uuid": "15c74443b4e87ddac8674c269718817dee8fb94e"}, "author": "", "url": "http://www.modernghana.com/sports/648942/2/rio-ferdinand-admits-he-was-upset-at-being-snubbed.html", "ord_in_thread": 0, "title": "Rio Ferdinand admits he was upset at being snubbed for Manchester United captaincy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Rio Ferdinand"], "text": "  14:06 CET Rio Ferdinand admits he was upset at being snubbed for Manchester United captaincy By Wires \nFormer Manchester United centre-back Rio Ferdinand has admitted he was upset at being overlooked for the Manchester United captaincy by Sir Alex Ferguson. \nThe former England captain spent 12 years at Old Trafford and captained the club in the 2008 Champions League final in place of the injured Gary Neville, but was never formally given the armband by Ferguson. \nSpeaking to CNBC he admitted that the snub hurt him, \"I would be lying (if I said) it didn't.\" \nBut the 36-year-old BT Sport pundit continued, \"It is one of the things that pushed me on. \n\"It was good. He was very much about personalities and working you out. I used to feel I was never given enough credit. Me and Vidic used to talk about it quite a lot.\" \nFerdinand, who won six Premier League titles in his time at the club, admits that Ferguson's 'tough love' management was difficult to work under, but that it got the best out of him, particularly at a young age. \n\"Sometimes there's situations during your career you think, 'Am I getting the credit I feel I deserve?' But, at the same time that is one of the things that maybe pushed me on to keep improving year in, year out, to sustain and stay at that level for all them years,\" he said. \n\"I think I needed, as a person, for something to try and get to and grasp onto. If I had everything at one time, it might have been detrimental to my growth, maybe.\" \n\"He spoke to me and said: 'Your personality, if I had given you too much credit you might have gotten carried away, when you were younger, especially,'\" Ferdinand added. \nFollow Joy Sports on Twitter: @Joy997FM. Our hashtag is #JoySports Sports News Follow Us There is nothing urgently needed in this world as to seek and maintain relationship with God. By: FRANCIS TAWIAH(Duisb", "external_links": [], "published": "2015-10-13T16:06:00.000+03:00", "crawled": "2015-10-13T17:08:39.724+03:00", "highlightTitle": ""}