{"organizations": [], "uuid": "939854a1e11b393fab8f8200f24ae22e050d61c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "wtop.com", "main_image": "http://wtop.com/wp-content/uploads/2015/10/World-Championships-First-World-Problems-Gymnastics.jpeg", "site_section": "http://wtop.com/section/sports/feed/", "section_title": "WTOP » Sections » Sports", "url": "http://wtop.com/sports/2015/10/american-stars-face-stiff-test-from-each-other/", "country": "US", "title": "American stars face stiff test from each other", "performance_score": 0, "site": "wtop.com", "participants_count": 1, "title_full": "American stars face stiff test from each other", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T21:35:00.000+03:00", "replies_count": 0, "uuid": "939854a1e11b393fab8f8200f24ae22e050d61c9"}, "author": "wtopstaff", "url": "http://wtop.com/sports/2015/10/american-stars-face-stiff-test-from-each-other/", "ord_in_thread": 0, "title": "American stars face stiff test from each other", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home » News » Sports » American stars face stiff… American stars face stiff test from each other By WILL GRAVES October 23, 2015 2:35 pm FILE - At left, in a Sept. 12, 2015, file photo, U.S. gymnast Aly Raisman poses at the Karolyi Ranch in New Waverly, Texas. At right, also in a Sept. 12 file photo, U.S. gymnast Gabby Douglas poses at the Karolyi Ranch. The U.S. women's gymnastics team should stroll through qualifying at the world championships on Saturday, in Glascow, Scotland. Yet one of the three Americans who will compete in the all-around _ defending Olympic champion Gabby Douglas, two-time world champ Simone Biles or three-time Olympic medalist Aly Raisman _ will have to watch the all-around finals from the stands thanks to the rules that limit each country to two competitors in the finals. (AP Photo/David J. Phillip, File) \nGLASGOW, Scotland (AP) — Their resumes are impeccable, filled with bling from London to China and back. \nOne is arguably the greatest gymnast on the planet. One the reigning Olympic champion. The other has a pair of Olympic gold medals tucked away somewhere and appears to be getting stronger in her 20s, a rarity in a sport that prizes youth among its most valuable commodities. \nAnd no matter what, one of them won’t make the world championship all-around finals this week. \nSorry Simone Biles, Gabby Douglas and Aly Raisman, but rules are rules. \nBarring catastrophe during the U.S.’s qualifying on Friday, all three of them will post scores more than good enough to finish in the top 24, the cutoff to make it to next week’s finals. One problem: regulations stipulate only two gymnasts per country can advance. It’s designed to spread the wealth and prevent a medal stand sweep. \nAnd it’s also a bit unfair, particularly if you happen to compete for an unstoppable force akin to a gymnastics version of Taylor Swift: overwhelming and everywhere. \nExcept without the bad blood. \nAll three insist their focus is on pushing the U.S. to extending a dominant run that started at the 2011 world championships and shows no signs of ending anytime soon. Besides, getting pushed by your friends is kind of fun. Kind of. \n“It’s such a big competition and such a big deal in your life,” said Biles, the two-time defending champion. “You can’t say ‘Oh well, I’ve been here before, I’ve done this.’ You still have to prepare like it’s your first time here and we all know we can push each other.” \nThey all understand these are first-world gymnastics problems. While historic powerhouses like Romania and Russia deal with injuries and an infrastructure in need of a makeover, the Americans are rolling. They’ve won every major team or individual competition since the 2011 world championships, sweeping the team and the all-around titles at the 2012 Olympics and each of the last two world meets. \nThat success comes with an unusual challenge for national team coordinator Martha Karolyi, who places as much value on what will happen over the next week in Scotland as she does what will happen at the Rio Games next summer. For Karolyi, gold is gold no matter where it comes from. \n“Worlds isn’t any different than the Olympics,” Karolyi said. “It’s the same gymnasts. The same judges. Everything is the same.” \nIncluding the knowledge that at least one American will almost certainly be forced to watch the all-around final from the stands. It happened to Douglas four years ago, when she was a national team newcomer and came in fifth during qualifying behind teammates Jordyn Wieber and Raisman. \nIf the near-miss affected the then 15-year-old, it didn’t show. Less than 10 months later, Douglas dazzled in winning the all-around title in London while Wieber didn’t make it to the finals. Competing in pain with stress fractures in her leg, Wieber finished fourth in qualifying behind Douglas and Raisman. While Wieber stoically handled her disappointment, teammate McKayla Maroney shrugged her shoulders and infamously summed up her friend’s disappointment by saying “that’s gymnastics and sometimes it sucks.” \nIn its own way, the restrictions help keep the Americans sharp. The most demanding gymnastics meets on the planet every year are usually held in private at the Karolyi Ranch just north of Houston, Texas before every major international competition. For two harrowing days national team members compete in near silence in an atmosphere that Biles’ coach Aimee Boorman jokingly described as so tense you become very aware of how loud you’re breathing. \nAnd that’s just how Karolyi likes it. She understands the danger that comes when one of your best comes up painfully short — at least by the rules. Sure it might not be fair. It doesn’t matter. The only thing Karolyi might like as much as success is resiliency. \nLook no further than Wieber for proof. Two days after failing to make the finals in London, Wieber was a key part of the “Fierce Five’s” race to the U.S.’s second team Olympic gold and never competed again, content with her career rather than pushing on to Rio. \nBy making the preparation so difficult, simply by making the trip the six-woman American squad has already won. And Maggie Nichols, Madison Kocian and Brenna Dowell — who will compete on certain events for the U.S. during qualifying — would almost certainly be in the all-around mix if Karolyi had provided them the opportunity. Instead Karolyi opted with what amounts to a “Dream Team,” even if one of her stars will have her dream of a world title end sometime Saturday evening. \nWhoever misses will just have to get over it and “settle” for going for a team gold, which is what Karolyi values most of all. \n“We put on extra pressure,” Karolyi said, explaining that gymnasts who can’t perform under pressure and with high expectations won’t make it. “So we always want to select the toughest girls mentally.” Topics:", "external_links": [], "published": "2015-10-23T21:35:00.000+03:00", "crawled": "2015-10-23T21:55:14.540+03:00", "highlightTitle": ""}