{"organizations": ["Cornell", "Vestal Ithaca", "Ithaca High", "Jamestown Community College A Lansing", "Newman Golf Course", "Colgate"], "uuid": "1408f20c2562bb1e4807fa2aeeee3fda502aaf03", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stargazette.com", "main_image": "http://www.gannett-cdn.com/-mm-/f22b5a459326cf4fb44d7be391770e9315a1c80e/c=0-102-479-373&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/06/CNYGroup/Ithaca/635797383945397823-ITH-1007-FleischmanColGOLF.jpg", "site_section": "http://rssfeeds.stargazette.com/elmira/sports", "section_title": "Elmira - Sports", "url": "http://www.stargazette.com/story/sports/2015/10/06/ny-ag-fantasy-sports/73494750/", "country": "US", "title": "Ithaca's boys soccer team sent a message against Vestal", "performance_score": 0, "site": "stargazette.com", "participants_count": 0, "title_full": "Ithaca's boys soccer team sent a message against Vestal", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T01:01:00.000+03:00", "replies_count": 0, "uuid": "1408f20c2562bb1e4807fa2aeeee3fda502aaf03"}, "author": "", "url": "http://www.stargazette.com/story/sports/2015/10/06/ny-ag-fantasy-sports/73494750/", "ord_in_thread": 0, "title": "Ithaca's boys soccer team sent a message against Vestal", "locations": ["Ithaca City Senior", "Ithaca", "Newman G.C"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tom Fleischman", "LaMarr Peters", "Jim Atsedes", "Matt Ryan"], "text": "Ithaca's boys soccer team sent a message against Vestal Tom Fleischman, tfleischman@ithacajournal.com | @TomF_IJSports 6:01 p.m. EDT October 6, 2015 Ithaca High's top-ranked boys' soccer team features several players who've played a lot of soccer over the past few months, much of it with Coach LaMarr Peters' WAZA Flo travel squad. Jim Atsedes, left, defeated Matt Ryan, 1-up, in the final of the Ithaca City Senior golf championship last week at Newman Golf Course. Atsedes is a seven-time city and county golf champion. (Photo: PEGGY BEACH / Provided photo) Story Highlights Many of Ithaca's players were on LaMarr Peters' WAZA Flo squad that played in the spring and summer Jim Atsedes won the city senior golf title with a 1-up defeat of Matt Ryan last week at Newman G.C. The TC3 soccer teams both scored victories over the weekend at Jamestown Community College A Lansing duo will help lead Colgate's men's soccer team into Tuesday's match with Cornell 18 CONNECT 6 TWEET LINKEDIN COMMENT EMAIL MORE \nI finally got the chance Monday night to see the undefeated — and now top-ranked — Ithaca High boys soccer team play, and did they ever look like a team with a state title squarely in its sights after its 7-0 shellacking of Vestal. \nRemember how the DeLorean in \"Back to the Future\" needed to reach 88 miles an hour for the flux capacitor to send Marty McFly (and/or Dr. Brown) through time? Well, it took the Little Red — more accurately, forward Tristan Cornell-Roberts — just 88 seconds to put the Golden Bears in their rear-view mirror. The diminutive but blindingly quick senior twice got behind the Vestal defense and beat helpless Golden Bears goalie Joe Pirc, and in less than a minute and a half, the game was, for all intents and purposes, over. \nCornell-Roberts, who completed a natural hat trick at the 16:32 mark of the first half, admitted to me after the game that coming out and sending an early message was on the minds of his squad, particularly after the teams' first meeting. Senior Andrew Araneo's late-first-half goal was the only one Ithaca got in a 1-0 victory on Sept. 12 in Vestal, the closest the Little Red has come to not winning so far in 2015. \n\"The first game, we didn't think that we played our best, and we wanted to really assert our dominance in this league,\" Cornell-Roberts said. As of Monday, that dominance can be measured by a season score line that reads Ithaca 63, Opponents 2. \nLike I said, it was the first time this season that I'd seen Coach Gilbert Antoine's Little Red, which Monday afternoon rose to No. 1 in the state sportswriters' Class AA rankings. But it's not the first time this year that I'd seen several of those players, who spent the spring and part of the summer playing for tireless WAZA Flo coach LaMarr Peters in both the Thruway League and in a local adult league — not to mention numerous training sessions in all sorts of weather. \nMany of Antoine's older players, including Cornell-Roberts, were on the team along with my youngest nephew, Andy Johndrew, who graduated this past spring from South Seneca High. The family and I got numerous chances to see not only our not-so-little-anymore guy, but some of the best high school players in the New York state. It's safe to say that the Little Red's fans will have several more chances to see this talented, athletic team play before the snow flies. \nIthaca wraps up the regular season with games Wednesday night at home vs. Binghamton and Friday at Corning, then looks toward the Southern Tier Athletic Conference playoffs. Wednesday will be Senior Night at Moresco Stadium, and the Little Red's 14-member senior class will be recognized for its accomplishments, including helping lead Ithaca to the state final four a year ago, and to a pair of Section 4 Class AA titles — so far. \nADDING TO HIS LEGEND: Anyone who's been a part of the golf community in Ithaca for any length of time will know exactly who you're talking about if you refer to \"Legend.\" \nThat's the well-earned nickname of one Jim Atsedes, seven-time city and county champion who made a foray into professional golf in the early 1990s but has just recently regained his amateur status. In his mid-70s, Jim can shoot his age most days, and last week added another championship to his rather oversized collection of them. \nAtsedes made and up-and-down par at the last and defeated Matt Ryan, 1-up, to capture his first Ithaca City Senior Championship at Newman Municipal Golf Course. That Atsedes should win a title on the sneaky-challenging nine-hole city layout should come as absolutely no surprise: He's a 13-time club champion down by the inlet. \nRyan went 2-up heading into the back nine, but Atsedes rallied to take a 1-up lead into the final hole, where both players made par to give \"Legend\" the victory. Atsedes, qualifying medalist with an even-par 72, earned a berth in the final by defeating Tom Hanna in the quarterfinals, then Rich Favaro in the semis. Ryan got his spot in the title match by eliminating Paul Grennell, then Dan Miller. \nMiller won the third-place match, while Ivan Tomic defeated Dan Baker to take first-flight honors. A total of 16 golfers participated in the event. \nAnd speaking of the name Atsedes: Jim's daughter, LPGA professional Lori Atsedes, placed 12th overall with a three-day total of even-par 216 at the Teaching and Club Professional National Championship, held in late August at Reunion Resort in Kissimmee, Florida. It was her first competitive event after spending about a month back home in Ithaca, catching up with some old friends and giving a few lessons. \nLori qualified by winning the senior division of a two-day regional qualifier in Las Vegas. After her showing in Florida, she finished tied for 28th at the LPGA Legends Championship, held Aug. 29 to 30 at French Lick (Indiana) Resort. Juli Inkster won the title with a 5-under 139, topping a field that included LPGA greats Pat Hurst, Laura Davies, Rosie Jones and Jan Stephenson. \nPANTHER UPDATE: The Tompkins Cortland Community College men's soccer team got back to .500 on the season with a come-from-behind 3-2 defeat of Jamestown CC on Saturday in Jamestown. The Panthers (5-5-2 overall, 4-4-2 Region III) trailed 2-0 after 45 minutes, but began their comeback early in the second half with a off the foot off Dryden High graduate Jacob Czapranski, his first of the season. He then added his second just five minutes later, setting the stage for Brit Darren Serrano-Griffiths, whose goal in the final 10 minutes was the winner. Corey Swarthout, of Elmira, got the win with two saves. \nAnd TC3's women's team improved to 6-4-1 (6-4-0 Region III) on Saturday with a 4-0 defeat of Jamestown. Emma DeLisio, of Woodstock, led the charge with two goals and an assist, while Molly Graves, of Newark Valley, earned her second shutout of the season by making two saves. Both Panther squads take the field on Wednesday at Corning CC. \nDISSA AND DATA: When the Cornell men's soccer team hosts Colgate at 7 p.m. Tuesday at Berman Field, the game will be a homecoming of sorts for a pair of Raiders. Former Lansing stars Ethan Kutler and Benji Geisler are key players for Coach Erik Ronning's squad; Kutler leads the team in goals (4) and assists (3), and Geisler has started all nine games on defense. Colgate is 4-4-1 heading into Patriot League games Wednesday against Boston University and Saturday at Bucknell. ... Empire 8 weekly awards have gone out to a trio of Ithaca College student-athletes — junior Haley Kusak, of the 9-0 women's tennis team, senior cross country runner Sawyer Hitchcock, and a Bomber sophomore women's golfer with arguably the best name in local sports: Indiana Jones. She tied for seventh at the Middlebury Invitational, leading IC to an eighth-place finish. \nTom Fleischman is The Journal's sportswriter; he can be reached at tfleischman@ithacajournal.com. On Twitter: @TomF_IJSports. 18 CONNECT 6 TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http://ithacajr.nl/1LgdC2x TOP VIDEOS", "external_links": [], "published": "2015-10-07T01:01:00.000+03:00", "crawled": "2015-10-08T16:24:02.859+03:00", "highlightTitle": ""}