{"organizations": [], "uuid": "35fbd2f8e267a624b8d24e0ccba628aa259ba59e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.saudigazette.com.sa", "main_image": "", "site_section": "http://www.saudigazette.com.sa/index.cfm?method=home.cat&categoryid=2015100565339", "section_title": "Sports | Saudi Gazette", "url": "http://www.saudigazette.com.sa/index.cfm?method=home.con&contentid=20151005258738", "country": "US", "title": "Bayern crushes Dortmund", "performance_score": 0, "site": "saudigazette.com.sa", "participants_count": 1, "title_full": "Bayern crushes Dortmund | Sports | Saudi Gazette", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "35fbd2f8e267a624b8d24e0ccba628aa259ba59e"}, "author": "MUNICH", "url": "http://www.saudigazette.com.sa/index.cfm?method=home.con&contentid=20151005258738", "ord_in_thread": 0, "title": "Bayern crushes Dortmund", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MUNICH — Thomas Mueller and Robert Lewandowski struck twice each to steer Bayern Munich to a 5-1 demolition of second-placed Borussia Dortmund Sunday, which allowed the champion to open a seven-point lead at the top of the Bundesliga as it equaled its record of eight consecutive wins at the start of a season.\nGermany international Mueller opened his account in the 26th minute and doubled the hosts' lead with a penalty nine minutes later for his eighth league goal as the Bundesliga leader took control of the top-of-the-table clash.\nPierre-Emerick Aubameyang kept up his remarkable run of scoring in every one of Dortmund's league matches this season as he slotted in from close range a minute later.\nBut Bayern forward Lewandowski killed off any hopes of a comeback with two goals early in the second half to take his tally to 12 goals in all competitions in the last 12 days alone and nine in their last three Bundesliga matches, a league record.\nHis 12 league goals on the first eight matchdays also equalled the Bundesliga record set by Christian Mueller in 1964/65 and Gerd Mueller in 1968/69 seasons.\nFormer Dortmund teammate Mario Goetze added a fifth goal for the dazzling Bavarians in the 66th with the visitors having unconditionally surrendered.\nUndefeated Bayern, which is chasing a record fourth consecutive league crown, are on 24 points, seven clear of Dortmund.\nBayer Leverkusen drew 1-1 with visiting Augsburg, which took the lead in the 12th when goalkeeper Bernd Leno misjudged a simple back pass, kicked air and let the ball roll into the net.\nKarim Bellarabi equalized on a rebound in the 39th after Javier Hernandez' initial effort hit the post.\nEarlier Sunday, Cologne substitute Simon Zoller scored one minute after coming on as Schalke's six-game winning streak ended with a 3-0 defeat.\nJuventus rallies\nFour-time defending champion Juventus recorded only its second league win of the season as it came from behind to beat bottom side Bologna 3-1, while Inter Milan also fought back to salvage a 1-1 draw at Sampdoria and move provisionally top of Serie A Sunday.\nSami Khedira sealed the win for Juventus on his Serie A debut after Paulo Dybala's penalty and Alvaro Morata's equalizer. Anthony Mounier had given Bologna the lead thanks in part to a rare error from Gianluigi Buffon.\nIt was a first home league win for Juventus, which moved up to 12th.\nInter moved a point above Fiorentina, which plays Atalanta later. Lazio beat Frosinone 2-0 to move below Fiorentina on goal difference.\nRoma was a point further back after winning 4-2 at Palermo.\nElsewhere, Sassuolo saw its unbeaten run end with a 1-0 loss at Empoli and Udinese drew 1-1 against Genoa. — Agencies", "external_links": [], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-05T02:57:34.880+03:00", "highlightTitle": ""}