{"organizations": [], "uuid": "ab552368cf779e57ccd3dbb3701b81c41e05e51a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "http://www.bostonherald.com/sites/default/files/media/2015/10/11/19davidross.jpg", "site_section": "http://bostonherald.com/sports/red_sox_mlb", "section_title": "Sports: Red Sox &amp; MLB | Boston Herald", "url": "http://bostonherald.com/sports/red_sox_mlb/mlb_coverage/2015/10/graybeard_ross_goes_on", "country": "US", "title": "Graybeard Ross goes on", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "Graybeard Ross goes on | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "ab552368cf779e57ccd3dbb3701b81c41e05e51a"}, "author": "Scott Lauber", "url": "http://bostonherald.com/sports/red_sox_mlb/mlb_coverage/2015/10/graybeard_ross_goes_on", "ord_in_thread": 0, "title": "Graybeard Ross goes on", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK — A few hours before the start of Game 2 of the NL Championship Series last night, David Ross walked into an interview room at Citi Field and eyed two bottles of an energy drink — blue- and orange-colored, in honor of the Mets — positioned on either side of the microphone.\n“Can I drink this?” he asked. “Or are they just for show?”\nBackup catchers with a .176 batting average aren’t often invited to participate in postseason press conferences. But Ross isn’t any ordinary light-hitting reserve.\nIn his first season with the Cubs, the 38-year-old has done exactly what he did the previous two seasons with the Red Sox, or in the four seasons before that with the Braves.\nRoss showed them how to win.\n“He’s caught the last pitch of the World Series,” rookie slugger Kyle Schwarber said. “He’s won a ring. He’s someone this team needs.”\nAnd nobody gets a bigger kick out of being on the postseason stage than Ross. He’s a father of two, a 14-year veteran and one of the few players to appear in the College World Series for two schools (Florida and Auburn). But there’s something about the playoffs that turns Ross into a Little Leaguer living out his fantasy.\nTwo years ago, as the Red Sox marched through October, Ross reacted to seeing a hoodie with a World Series logo hanging in his locker like a kid who found a present under the tree on Christmas morning. He marveled to his wife about playing in the only games left on the baseball schedule. He paused from warming up Jon Lester in the Fenway Park bullpen to watch the flyover before Game 1 and said he was “stoked” to be in the postgame interview room after driving in the winning run with a ground-rule double in Game 4.\nWhenever he could, Ross pinched himself to make sure he wasn’t dreaming.\n“Great memories,” said Ross, who has had frequent text-message exchanges during the playoffs with Mike Napoli, Dustin Pedroia, David Ortiz and Jonny Gomes. “I’m not enjoying it as much this year. I’m so stressed out. Because these young guys are just so talented, I want what’s best for them and to see them succeed on this stage. And they’ve by far exceeded my expectations of the way they handle things.”\nIndeed, Ross is the Cubs’ grizzled veteran, and not only because he kept the salt-and-pepper beard that became his look in Boston.\nWhile the 2013 Red Sox were filled with veterans, the Cubs are stocked with kids. In Game 1, a 4-2 loss to the Mets, manager Joe Maddon’s lineup contained four rookies. Schwarber, third baseman Kris Bryant and shortstop Javier Baez were back in there for Game 2.\nRoss’ role with the Cubs, then, is two-fold. He’s Lester’s personal catcher, continuing a symbiosis formed with the Sox. He’s also a leader by example, and his influence can be seen in every one of the Kiddie Cubbies, from Bryant and Schwarber to All-Star first baseman Anthony Rizzo.\n“I think it’s just being the same person when I come in, or (Maddon) comes in, or Jon, or the veterans,” Ross said. “We don’t change day to day. There’s no panic. We don’t get down. What’s the point of getting down on yourselves? When you’ve won as much as we have in the last 3-4 weeks, there’s no reason to get down on yourselves.”\nIt’s a testament to Ross’ value that the Cubs signed him last winter to a two-year contract. Moreover, they put him on the playoff roster despite a 4-for-34 funk to finish the year — and having two other catchers in Miguel Montero and Schwarber.\nSometimes, Ross challenges his young teammates to fulfill their potential with strong-worded pep talks. Others, he uses self-deprecating humor to lighten the mood.\nAsked yesterday for his thoughts on the impressive power of Schwarber, the carefree 22-year-old who was in instructional league at this time last year, Ross said, “It’s given me a complex about how bad I am, to be honest with you.”\nAnd Ross never hesitates to remind the young Cubs to take a few minutes every so often to appreciate where they are.", "external_links": [], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-19T11:04:36.747+03:00", "highlightTitle": ""}