{"organizations": [], "uuid": "d6d7c14115913ed1d27bc023c7b0ad88ebfb1add", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/7c3e5f49b989e00afee387c825d91195", "site_section": "http://www.news.com.au/sport/more-sports", "section_title": "More Sports | More Sports | Sports News and Results | News.com.au", "url": "http://www.news.com.au/sport/more-sports/australian-olympic-champion-sally-pearson-cant-even-pick-up-a-cup/story-fndukor0-1227571671828", "country": "AU", "title": "Olympic Games: Sally Pearson can’t lift a cup with her broken hand", "performance_score": 0, "site": "news.com.au", "participants_count": 1, "title_full": "Olympic Games: Sally Pearson can’t lift a cup with her broken hand", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T21:21:00.000+03:00", "replies_count": 0, "uuid": "d6d7c14115913ed1d27bc023c7b0ad88ebfb1add"}, "author": "Tyson Otto", "url": "http://www.news.com.au/sport/more-sports/australian-olympic-champion-sally-pearson-cant-even-pick-up-a-cup/story-fndukor0-1227571671828", "ord_in_thread": 0, "title": "Olympic Games: Sally Pearson can’t lift a cup with her broken hand", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Video Image Sally Pearson on why female athletes miss out on sports sponsorship. 7:30 Meet the Press, Ep 34, Seg4\nOctober 27th 2013 2 years ago /video/video.news.com.au/News/Meet The Press/ Sally Pearson is on track.\nTyson Otto news.com.au SALLY Pearson has revealed just how difficult it is preparing to defend an Olympic Games gold medal when you can barely move your arm.\nThe 29-year-old 100m hurdles Olympic champion is able to ignore discomfort when she runs during training sessions, but it’s off the track that her so-called “car crash” broken wrist has really made things difficult for the Gold Coast-based star.\nPearson needed multiple surgeries to correct a “shattered” left wrist she herself described as a “bone explosion” after a horrific fall during a Diamond League athletics meet in Rome in June.\nShe missed the IAAF World Championships in Beijing in August.\nHer recovery program has been a rough ride.\nPearson, who was earlier this week announced as a Cadbury Olympic ambassador alongside cyclist Anna Meares, last month made headlines when she made an emotional entry in her personal blog, admitting to shedding tears over the difficult road she has ahead of her on the comeback trail.\nNow we know why.\nPearson remains adamant she will be back to her best for the 2016 Olympic Games in Rio de Janeiro, beginning August 5.\nIt seems a long time ago since Sally’s Commonwealth Games gold in Glasgow. Source: Getty Images\nRight now though, she just wants to be able to feed her dogs.\nThe surgeries on Pearson’s wrist and arm means she is unable to turn her wrist sideways.\nIt means simple things like opening doors and picking up a cup have become significant obstacles.\nIn a sit down interview with news.com.au, Pearson showed she can’t rotate her wrist in a circle and has limited movement moving the joint back and forward.\n“I’m still sore and stiff through here in this area,” Pearson says pointing to the top of her wrist.\n“That’s all I’ve got (for movement).\n“I’m four months now. It takes a long time.\n“I haven’t had any pain since my second surgery. It’s just stiffness more than anything. I’d like to be able to move it again, but that’s not stopping me from running at all.\n“A lot of people don’t realise how much you use your arms when you run. You use them in everything you do. Your hands, your wrist and your arms all day long.\n“The only thing I’m limited in is picking something up that’s right in front of me. I can’t pick up that phone underneath like that and hold it. I have to hold it on the side. Picking up a bowl or picking up a glass, I can’t do that. I can’t stick my hand out like that. My hand doesn’t turn out. That’s quite frustrating. Especially when I have two dogs and I’m trying to feed them, but if that’s my only limitation that’s not that bad.”\nSally Pearson's x-ray on her broken wrist Source: Supplied\nThis is where the role of her new coach Ashley Mahoney has become such a key in Pearson’s Olympic hopes.\nThe 2011 IAAF Female Athlete of the Year says she has no idea how she can compete with the best in the world when she is only able to do limited strength and conditioning training on her upper body.\nBut the important thing is that Mahoney knows exactly how she’s going to do it. He just refuses to tell her what the exact plan is for getting her to peak fitness before Rio.\n“He doesn’t tell me,” Pearson said.\n“I like to stay in the moment. I take everything one session at a time. He’s got everything planned right up until Rio. He won’t give that away to anyone.\n“I’m doing a lot less in my arms simply because I can’t do it. At the end of the day, my legs are more important that my arms for running. We’ll just do what I can for the upper body.\n“Rehab is hard, but I’ve done everything that’s been asked of me and the reason you do that is because you want to get back to where you were. You want to be the best and rehab is the only way.\n”It should get you back to the best you can be. I want that best to be another gold medal. That’s the important thing for me to keep that in my head.”\nMeanwhile, Meares insists her incredible record of five Olympic medals, including two gold, has done nothing to blunt her motivation to compete in Rio next year.\nAnna Meares and Sally Pearson have not done it easy. Source: News Corp Australia\nMeares is pushing to become the first Aussie female cyclist to compete in four Games, after debuting at the 2004 Olympics in Athens.\nThe 32-year-old, who was also announced as a Cadbury ambassador for the Games, admits the Rio event will be different for her alongside the rising stars of the Australian sprint cyclist team, which she believes can come away with Australia’s greatest ever haul of medals in Brazil.\nJump back to top\nsport breaking news 18:13 PM Live: Victoria closes on second spot 21:14 PM Heartache Hilton: Bulls down dogged CA XI 20:00 PM Giants unapologetic over Treloar, McCarthy 14:28 PM Fanning ‘upset’ by KFC’s shark attack ad 11:07 AM Proteas keeper equals Sachin Tendulkar", "external_links": ["http://cdn.newsapi.com.au/image/v1/7c3e5f49b989e00afee387c825d91195", "http://cdn.newsapi.com.au/image/v1/7f1384be4138d4ce5fa343b810cf885f", "http://cdn.newsapi.com.au/image/v1/origin:fatwire.", "http://cdn.newsapi.com.au/image/v1/external?url=http%3A%2F%2Fcontent5.video.news.com.au%2FNDM_-_news.com.au%2F255%2F713%2FPearson_Thumb__289849.jpg&width=650&api_key=kq7wnrk4eun47vz9c5xuj3mc", "http://cdn.newsapi.com.au/image/v1/a768c4f17ed51a09f867d8b4143a3ecb", "http://cdn.newsapi.com.au/image/v1/b90e11506bca9b34ede1805a203c72e5", "http://widgets.outbrain.com/outbrain.js"], "published": "2015-10-16T21:21:00.000+03:00", "crawled": "2015-10-20T18:30:02.092+03:00", "highlightTitle": ""}