{"organizations": ["Dolphins"], "uuid": "315868b83cff24b6d637224c4892f6488b25ddcf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.rep-am.com", "main_image": "http://www.rep-am.com/content/articles/2015/10/05/sports/nfl/doc5612ac588b9ee411703065.jpg", "site_section": "http://www.rep-am.com/feed/sports/", "section_title": "Sports News  From Rep-am.com", "url": "http://www.rep-am.com/sports/NFL/doc5612ac588b9ee411703065.txt", "country": "US", "title": "Dolphins coach fired 4 games into his 4th season", "performance_score": 0, "site": "rep-am.com", "participants_count": 0, "title_full": "Dolphins coach fired 4 games into his 4th season", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T20:58:00.000+03:00", "replies_count": 0, "uuid": "315868b83cff24b6d637224c4892f6488b25ddcf"}, "author": "", "url": "http://www.rep-am.com/sports/NFL/doc5612ac588b9ee411703065.txt", "ord_in_thread": 0, "title": "Dolphins coach fired 4 games into his 4th season", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Monday, October 5, 2015 1:05 PM EDT \nDolphins coach fired 4 games into his 4th season FILE - In this Sept. 27, 2015, file photo, Miami Dolphins head coach Joe Philbin looks down during the second half of an NFL football game against the Buffalo Bills in Miami Gardens, Fla. Philbin was fired Monday, Oct. 5, 2015, four games into his fourth season as coach of the Dolphins, and one day after a flop on an international stage that apparently sealed his fate. (AP Photo/Wilfredo Lee, File) Browse for Republican American Reprints MIAMI (AP) — Joe Philbin was fired Monday four games into his fourth season as coach of the Miami Dolphins, and one day after a flop on an international stage that apparently sealed his fate. Tight ends coach Dan Campbell, who has been with the Dolphins since 2010, was expected to be promoted to interim coach. The Dolphins (1-3) lost their third game in a row and turned in their fourth consecutive lackluster performance when they were beaten Sunday in London by the archrival New York Jets, 27-14. Midseason head coaching changes are unusual in the NFL, but few will accuse owner Stephen Ross of impatience. He ignored calls to fire Philbin in December after the Dolphins faded to finish 8-8 for a second successive season. But doubts only grew this season regarding Philbin's inability to motivate players with his bland demeanor. \"This was a tough decision for me to make, knowing how tirelessly Joe worked in his four years here to make this a winning team,\" Ross said in a statement. \"He is a man of the highest character and integrity that I developed a close personal relationship with. I am extremely disappointed with how we have started the season, but I feel confident that we can improve quickly with the talent we have on our roster.\" The Dolphins have started poorly in every game and have been outscored 37-3 in the first quarter. The offensive line has been a problem throughout Philbin's tenure, and the defense has progressively gotten worse under coordinator Kevin Coyle. They rank last in the AFC in rushing and offensive points per game, and last in the NFL in sacks and run defense. Philbin, who was hired as a first-time head coach in 2012, went 24-28. He failed to reach the playoffs or even finish above .500. More Stories About: NFL", "external_links": [], "published": "2015-10-05T20:58:00.000+03:00", "crawled": "2015-10-05T21:39:00.234+03:00", "highlightTitle": ""}