{"organizations": [], "uuid": "02a83d5c32469ed6eba7cb3c33db9aa5602e439e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "wtop.com", "main_image": "http://wtop.com/wp-content/uploads/2015/10/Astros-Mariners-Baseball2.jpeg", "site_section": "http://wtop.com/section/sports/feed/", "section_title": "WTOP » Sections » Sports", "url": "http://wtop.com/mlb/2015/10/mariners-cano-to-undergo-hernia-surgery-oct-13/", "country": "US", "title": "Mariners’ Cano to undergo hernia surgery Oct. 13", "performance_score": 0, "site": "wtop.com", "participants_count": 1, "title_full": "Mariners’ Cano to undergo hernia surgery Oct. 13", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T03:03:00.000+03:00", "replies_count": 0, "uuid": "02a83d5c32469ed6eba7cb3c33db9aa5602e439e"}, "author": "wtopstaff", "url": "http://wtop.com/mlb/2015/10/mariners-cano-to-undergo-hernia-surgery-oct-13/", "ord_in_thread": 0, "title": "Mariners’ Cano to undergo hernia surgery Oct. 13", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home » News » Sports » MLB » Mariners' Cano to undergo… Mariners’ Cano to undergo hernia surgery Oct. 13 By The Associated Press October 2, 2015 8:03 pm Seattle Mariners second baseman Robinson Cano turns a double play as Houston Astros' Colby Rasmus slides into second base during the fourth inning of a baseball game, Wednesday, Sept. 30, 2015, in Seattle. (AP Photo/Stephen Brashear) \nSEATTLE (AP) — Robinson Cano will undergo surgery to repair a sports hernia in two weeks and expects to be fully recovered by spring training. \nThe Mariners’ star second baseman, who will turn 33 on Oct. 22, plans to play in the final three games of the season before having surgery on Oct. 13. \n“I was hoping not to get surgery but they did a test two days ago and that’s when we decided to do surgery,” he said. \nCano sustained an abdominal injury on July 22 that the team’s medical director, Dr. Edward Khalfayan, determined to be a core muscle injury, or sports hernia. \n“It’s one of those injuries that athletes can play with, and can play well,” Dr. Khalfayan said. “He has been managing it very well. \n“It is painful at times but he has been able to perform. It’s not doing any more damage by continuing to play.” \nCano, who hit just .254 in the first half, has been playing quite well in the second half pf the season. Since July 1, he is hitting .331 with 50 runs scored, 15 doubles, 16 home runs and 52 RBIs. He’s closing the season with a 13-game hitting streak — currently the longest active in baseball — while hitting .365 during that span. \nOn Sept. 23 at Kansas City, he got his 2,000th hit, the 14th player in history — and first second baseman — to reach that milestone in his first 11 seasons. \nThe surgery will be performed by Philadelphia surgeon Dr. William Meyers and will require a six-week rehab period. It will be the first surgery in Cano’s big-league career. \n“He’ll be cleared to return to all baseball activities (after six weeks),” Khalfayan said. \nTypically, Cano said after the baseball season ends he takes four to six weeks to get completely away from baseball. So his timetable will not depart much from his usual offseason routine. \n“I can go to spring training and don’t have to worry about anything,” Cano said. “Everything is going to be normal, starting at the same time. I just got to be careful. I’m not supposed to lift anything heavy or anything like that.” \nCano is finishing the second year of a 10-year, $240 million contract. \nAsked why he doesn’t just take the final three games off, Cano said, “I love to play baseball. I played like this for the last two months. I love the game so much. I love to be out there.” Topics:", "external_links": [], "published": "2015-10-03T03:03:00.000+03:00", "crawled": "2015-10-03T04:08:19.068+03:00", "highlightTitle": ""}