{"organizations": ["Kinnick Nile C. Kinnick"], "uuid": "a8de9efaea36faca56ba5321036e844c236f7c82", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stripes.com", "main_image": "http://www.stripes.com/polopoly_fs/1.372499.1444408737!/image/image.JPG_gen/derivatives/landscape_490/image.JPG", "site_section": "http://feeds.stripes.com/starsandstripes/sports#", "section_title": "Stars and Stripes Sports", "url": "http://www.stripes.com/sports/pacific/yokota-bounces-back-from-loss-to-thump-kinnick-1.372485", "country": "US", "title": "Yokota bounces back from loss to thump Kinnick", "performance_score": 0, "site": "stripes.com", "participants_count": 0, "title_full": "Yokota bounces back from loss to thump Kinnick", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T19:18:00.000+03:00", "replies_count": 0, "uuid": "a8de9efaea36faca56ba5321036e844c236f7c82"}, "author": "", "url": "http://www.stripes.com/sports/pacific/yokota-bounces-back-from-loss-to-thump-kinnick-1.372485", "ord_in_thread": 0, "title": "Yokota bounces back from loss to thump Kinnick", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Abby Bissell/Special", "Kinnick Yokota", "Chauncey Jamerson", "C. Kinnick", "Brad Deibel", "Yokota", "C.J. Thomas"], "text": "Yokota bounces back from loss to thump Kinnick Nile C. Kinnick quarterback Brad Deibel looks for running room against Yokota. Abby Bissell/Special to Stars and Stripes Nile C. Kinnick running back Chauncey Jamerson looks to cut outside on Yokota's C.J. Thomas. Abby Bissell/Special to Stars and Stripes Related Yokota page \nYOKOSUKA NAVAL BASE, Japan – Marcus Henagan sat out the last two weeks with a chest injury. His return came at a good time for Yokota, which on Friday faced a Nile C. Kinnick team bent on winning its homecoming game and defending its two-time DODDS Japan title. \nHenagan accounted for 254 yards total offense and rushed and passed for two touchdowns each, while Shota Sprunger recorded 326 offensive yards and scored five times as the Panthers outlasted the Red Devils 62-34. \n“We didn’t think of Shota as an interior runner, but tonight he ran between the tackles well and he caught some passes,” Yokota coach Tim Pujol said. \nIt was the highest winning score by any team in the Pacific this season, and the Panthers padded their regional scoring offense lead. In six games, Yokota (5-1) has averaged 44.83 points per game. That includes a 27-13 loss to Kubasaki on Oct. 3. \nKinnick matched Yokota touchdown-for-touchdown in the early going, led 14-13 midway through the first quarter and torched the Panthers’ defensive interior for 250 rushing yards in the first half. \n“We made some adjustments at halftime,” Pujol said. “We did a better job of stopping their run game, which gave us some more possessions.” \nSprunger finished with 249 yards and three rushing touchdowns on 20 carries, caught two touchdown passes for 77 total yards and had three returns for 74 yards – a total of 400 all-purpose yards. Henagan was 6-for-9 for 139 yards and ran 15 times for 115 yards and two touchdowns. Jamarvin Harvey and Tony Ford each added touchdown runs. \nAll that offset a 365 all-purpose yard performance by Kinnick junior Chauncey Jamerson. He had 269 yards and two touchdowns on 30 carries. Brad Deibel ran for two scores and tossed a 69-yard TD pass to Tarick Mitchell, which glanced off the hands of defensive back Marquis Smith-Brown. \nBut it was three lost fumbles that did in the Devils, coach Dan Joley said. “We have to take better care of the football,” he said. “It was a fun game for a half. That’s a good Yokota football team.” \nKinnick next travels to Kubasaki for a 6 p.m. Saturday kickoff. Yokota next visits Zama for the Trojans’ homecoming game with a 7 p.m. Friday kickoff. Join the conversation and share your voice. \nShow Comments", "external_links": [], "published": "2015-10-09T19:18:00.000+03:00", "crawled": "2015-10-09T20:07:47.859+03:00", "highlightTitle": ""}