{"organizations": [], "uuid": "b88ff119c783e362522d61685b75046b2644b2d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "lancasteronline.com", "main_image": "http://bloximages.newyork1.vip.townnews.com/lancasteronline.com/content/tncms/custom/image/20c2e932-c72b-11e4-8e4f-7f4064859d3c.jpg?_dc=1425994877", "site_section": "http://lancasteronline.com//search/?q=&t=article&l=25&d=&d1=&d2=&s=start_time&sd=desc&c[]=sports/olympics*&f=rss", "section_title": "lancasteronline.com - RSS Results in sports/olympics* of type article", "url": "http://lancasteronline.com/sports/olympics/wada-to-consider-independent-testing-proposal-next-month/article_a4c6a705-56c3-57f8-b5f1-d38b0d3e0da1.html", "country": "US", "title": "WADA to consider independent testing proposal next month", "performance_score": 0, "site": "lancasteronline.com", "participants_count": 1, "title_full": "WADA to consider independent testing proposal next month", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T20:53:00.000+03:00", "replies_count": 0, "uuid": "b88ff119c783e362522d61685b75046b2644b2d0"}, "author": "STEPHEN WILSON AP Sports Writer", "url": "http://lancasteronline.com/sports/olympics/wada-to-consider-independent-testing-proposal-next-month/article_a4c6a705-56c3-57f8-b5f1-d38b0d3e0da1.html", "ord_in_thread": 0, "title": "WADA to consider independent testing proposal next month", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WADA to consider independent testing proposal next month WADA to consider independent testing proposal next month By STEPHEN WILSON AP Sports Writer Updated Comments \nLONDON (AP) — The World Anti-Doping Agency is taking a cautious approach to a proposal that it should take over responsibility for drug-testing from sports federations. \nIn a potentially major shift, Olympic leaders agreed Saturday to make testing \"independent from sports organizations\" and asked WADA to study taking over the testing on a global level. \nThe recommendation, which came out of an \"Olympic Summit\" held in Lausanne, Switzerland, under the leadership of IOC President Thomas Bach, is aimed at giving more credibility to drug-testing by turning it over to an independent body. \nWADA President Craig Reedie told The Associated Press on Monday that he will submit the issue for discussion at the agency's executive committee and foundation board meeting from Nov. 17-18 in Colorado Springs, Colorado. \n\"I was there as a member of the Olympic Summit, and was asked if WADA would consider taking on that responsibility,\" Reedie said in a telephone interview. \"I said, 'Yes, we will take the suggestion to the executive committee in November.'\" \nReedie, who is also an International Olympic Committee vice president, said he would not discuss the pros or cons of the proposal ahead of the meeting. \nThe IOC said a study would be carried out by a WADA working group including Olympic leaders and government representatives. No time frame was given. \nThe proposal came out of the blue to some participants at the summit. It followed a presentation by recently-elected IAAF President Sebastian Coe of his idea for an independent body to handle drug-testing in track and field. \nPutting WADA in charge of testing would pose numerous logistical and financial issues for the Montreal-based agency, which was set up in 1999 to oversee anti-doping efforts around the world. With a current budget of about $26 million, WADA accredits labs to analyze samples, draws up a list of prohibited substances and monitors the World Anti-Doping Code. The agency does not carry out its own testing, however. \nMaking WADA responsible for testing would require a major change in funding. Money that federations and other bodies spend on testing would have to be transferred to the agency. \nUnder the IOC proposal, while the testing itself would be handled independently, the disciplinary procedures and sanctioning would be done by the federations. \nWADA has its hands full at the moment with several high-profile investigations. \nA three-person commission, headed by former WADA president Dick Pound, is looking into allegations made in a German television documentary last year of widespread doping and cover-ups in Russia, particularly in track and field. \nThe WADA panel is also examining more recent reports by German and British media outlets that obtained files from an IAAF database containing the results of confidential blood test results. The reports alleged that one-third of medals in endurance races at the Olympics and world championships over a 10-year period were won by athletes who recorded suspicious doping tests. \nWADA hopes that Pound's report will be completed early next month. \n___ \nFollow Stephen Wilson on Twitter: http://twitter.com/stevewilsonap More Headlines", "external_links": [], "published": "2015-10-19T20:53:00.000+03:00", "crawled": "2015-10-24T10:26:21.649+03:00", "highlightTitle": ""}