{"organizations": [], "uuid": "c4bb89a4f0dfd9f8fba79db78de8defbc9aa2f09", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.commercialappeal.com", "main_image": "http://media.jrn.com/images/707670.jpg", "site_section": "http://www.commercialappeal.com/sports/index.rss", "section_title": "Sports", "url": "http://www.commercialappeal.com/sports/tony-allen-in-stride-as-griz-beat-twolves-2268a3f8-e777-409c-e053-0100007f14a5-333960751.html", "country": "US", "title": "Tony Allen in stride as Griz beat T’wolves", "performance_score": 0, "site": "commercialappeal.com", "participants_count": 1, "title_full": "Tony Allen in stride as Griz beat T’wolves", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T05:57:00.000+03:00", "replies_count": 0, "uuid": "c4bb89a4f0dfd9f8fba79db78de8defbc9aa2f09"}, "author": "Ronald Tillery", "url": "http://www.commercialappeal.com/sports/tony-allen-in-stride-as-griz-beat-twolves-2268a3f8-e777-409c-e053-0100007f14a5-333960751.html", "ord_in_thread": 0, "title": "Tony Allen in stride as Griz beat T’wolves", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Credit: Nikki Boertman October 18, 2015 — Memphis Grizzlies Russ Smith shoots defended by Minnesota Timberwolves Gorgui Dieng, left, and Adreian Payne, right, at FedExForum. (Nikki Boertman/The Commercial Appeal) Credit: Nikki Boertman October 18, 2015 — Memphis Grizzlies Mike Conley shoots defended by Minnesota Timberwolves Tayshaun Prince, left, at FedExForum. (Nikki Boertman/The Commercial Appeal) Credit: Nikki Boertman October 18, 2015 — Memphis Grizzlies Tony Allen (9) lands on Minnesota Timberwolves Zach LaVine (8) under the basket as they battle for the ball during the preseason game at FedExForum. (Nikki Boertman/The Commercial Appeal) The first shot Tony Allen attempted Sunday evening, he immediately pulled up and buried the basketball from 11 feet.\nAllen then took off with a giddy up and smacked himself on the backside. Allen's next two scores were just as animated.\nThe veteran swingman cut to the basket for a dunk off a feed from Zach Randolph, who again found Allen darting through the lane for a layup on the Grizzlies' next possession.\nMeanwhile, the player Allen defended — Minnesota Timberwolves guard Andrew Wiggins — made just one shot in the first half of the Grizzlies' 90-68 preseason victory in FedExForum.\nThe Griz have two more exhibition contests remaining before their Oct. 28 regular-season opener against the Cleveland Cavaliers at FedExForum.\nAllen, though, already looks to be in midseason form after having last season cut short by a hamstring injury in the Western Conference semifinals.\n\"I'm going hard in all of these games,\" Allen said after amassing 13 points on 6-of-9 shooting and two steals. \"I nurtured (the hamstring) a lot this summer. But as far as training camp, I did a lot of strengthening. That was my main focus to get back to first-team all-defense level. That's basically what my mindset was, just being healthy for the remainder of the year.\"\nAllen strained his left hamstring early in the Grizzlies' playoff series against the Golden State Warriors. The injury forced him to miss a pivotal Game 5. Allen attempted to play in Game 6 but was limited.\nHe acknowledged taking more time off than usual during the offseason so the hamstring wouldn't be an issue in training camp. That was bad news for teammate Courtney Lee, whose torrid shooting is something Allen half-jokingly claims credit for during the preseason.\nLee continued his impressive offensive training camp with 18 points and three 3-pointers against the Timberwolves.\n\"I've been sticking Courtney this whole training camp. He's going out there (in the games) and it's light work for him now,\" Allen said. \"He's going against First Team. I'm harassing him every day in practice, so Courtney is going to blossom this year.\"\nTeammates have enjoyed the backcourt battle.\n\"It works both ways,\" center Marc Gasol said. \"Tony needs a focus on defense. He puts the target on C-Lee and C-Lee goes at Tony on offense. It works great for both guys. It's great for practice because the competitiveness rises. Then, the game becomes easier for both guys.\"\nEvident against Minnesota was how Allen made the offense flow easier when Gasol and Randolph were double-teamed. Griz coach Dave Joerger has plenty to contemplate about whether he'll start Allen or Jeff Green at small forward.\nAllen's instinctive ability to find driving lanes and play off the Grizzlies' all-star big men was on display against the Timberwolves.\n\"He flashes under the goal and gets a layup, then the next time they aren't playing him hard enough and he gets another layup,\" Joerger said. \"It's important for those guys to catch a rhythm and that's what we're trying to do.\"\nGreen, Matt Barnes, Vince Carter and Brandan Wright didn't play. Beno Udrih (ankle) and Jordan Adams (knee) are injured.\nAllen played extended minutes with the starters for just the second time during the preseason. He was on the floor for long stretches with Lee, Gasol, Randolph and Mike Conley on Oct. 12 when the Griz played Cleveland at Ohio State.\nWhat's obvious is that continuity counts for something with Allen on the floor. Of five combined assists for Gasol and Randolph, three benefited Allen.\n\"I know their sweet spots as far as Marc and Zach. We just feed well off each other,\" Allen said. \"I try not to do too much when I'm around them because they cause so much attention. When I just let them be them, it opens doors for me. The lane is open. I can always cut. You just have to be a piece to the puzzle while you're out there. But we still hang our hats on the defensive end, and if I was to grade myself, I'd say I've still got a lot of work to do.\"", "external_links": ["http://media.jrn.com/images/200*314/194466.jpg", "http://media.jrn.com/images/200*287/668502.jpg", "http://media.jrn.com/images/194466.jpg", "http://media.jrn.com/images/668502.jpg", "http://media.jrn.com/images/200*154/670037.jpg", "http://media.jrn.com/images/670037.jpg", "https://www.youtube.com/embed/AIIhEsNVzpQ"], "published": "2015-10-19T05:57:00.000+03:00", "crawled": "2015-10-19T10:20:14.866+03:00", "highlightTitle": ""}