{"organizations": [], "uuid": "18c270ca0e15382401cc795aa4ed8068085ca930", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "thetimes-tribune.com", "main_image": "", "site_section": "http://www.thetimes-tribune.com/cmlink/1.8274", "section_title": "Sports from thetimes-tribune.com", "url": "http://thetimes-tribune.com/sports/hs-football-honesdale-at-lakeland-1.1962398", "country": "US", "title": "HS FOOTBALL: Honesdale at Lakeland", "performance_score": 0, "site": "thetimes-tribune.com", "participants_count": 1, "title_full": "HS FOOTBALL: Honesdale at Lakeland", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T07:00:00.000+03:00", "replies_count": 0, "uuid": "18c270ca0e15382401cc795aa4ed8068085ca930"}, "author": "Dave Lauriha / Correspondent", "url": "http://thetimes-tribune.com/sports/hs-football-honesdale-at-lakeland-1.1962398", "ord_in_thread": 0, "title": "HS FOOTBALL: Honesdale at Lakeland", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sign Up Text Alerts | newsletter JASON FARMER / STAFF PHOTOGRAPHER Honesdale’s Julio Galarza makes the grab over Lakeland’s Garth Estadt. JASON FARMER / STAFF PHOTOGRAPHER Lakeland’s Mike Lowry turns the corner past Honesdale’s Jason Reed during Friday’s game. \nSCOTT TWP. — Garth Estadt likes to play with a cool demeanor, not wanting opposing teams to think they can rattle the Lakeland senior. \nHonesdale found out the hard way Friday night in its Lackawanna Football Conference Division II game at Lakeland Stadium. \nIn the second quarter, after the Hornets beat Estadt for a touchdown that drew them back into a one-score deficit, the senior made his own big play by returning the ensuing kickoff 92 yards for a touchdown to slam the door shut on Honesdale. He also scored another touchdown less than two minutes later as 10th ranked Lakeland posted a 49-13 win. \nMike Lowry added 166 rushing yards and Eric Ferko had two touchdowns and 108 yards on eight carries for Lakeland (2-1 LFC II, 5-3). \nHonesdale (0-3, 2-6) trimmed its deficit with 5:01 left in the first half as Julio Galarza reached over Estadt and controlled the ball to the ground in the end zone. Even though the Hornets had the extra-point kick blocked, they trailed only 21-13. \n“I jumped for the ball, and I tipped it off my hands and he caught it,” Estadt said of Galarza’s play. “I didn’t let that bother me, or let it get into my head. I just want to do my best for the team.” \nThe ensuing kickoff even seemed to work in Honesdale’s favor as the ball went over Estadt’s head and he backtracked to the Lakeland 8, facing away from where he wanted to go. \nYet in just 14 seconds, the Lakeland senior turned, broke from the center of the field toward the Chiefs’ sideline and motored in for the score that deflated the Hornets. \n“I caught it over my head, and I turned around and looked for the biggest lane,” Estadt said. “Our line did a good job of sustaining their blocks, and I busted it open to the end zone. \n“I had to completely stop from where I was going, run backwards, stop again and then run toward the end zone.” \nHe did all that in 14 seconds, not bad for a track runner who isn’t a sprinter but said that he has run the 100 in 11.2 seconds, and that was running in a straight line without an assortment of pads. \n“The quarterback (Clay Hewlett) made a great throw and (Galarza) made a great catch,” Lakeland head coach Jeff Wasilchak said. “Garth used his speed and his gifts, and he made a nice play to answer that. \n“You work hard to score, and then all of a sudden, you give it all back in one fell swoop.” \nIt was the second time in the game Lakeland did that to Honesdale. The Hornets opened the game with an eight-minute, 17-second scoring drive, only to have Lakeland return the kickoff to the 50-yard line and scored three plays later to complete the tying drive in 43 seconds. \n“We did some nice things, came out and moved the ball,” Honesdale head coach Mike Jurkowski said. \n“We get within one score before that half, and they bust one up. We had some guys out of position, and took the wind out of our sails going in at halftime.” \nContact the writer: \nsports@timesshamrock.com We welcome user discussion on our site, under the following guidelines: To comment you must first create a profile and sign-in with a verified DISQUS account or social network ID. Sign up here. Comments in violation of the rules will be denied, and repeat violators will be banned. Please help police the community by flagging offensive comments for our moderators to review. By posting a comment, you agree to our full terms and conditions. Click here to read terms and conditions .", "external_links": [], "published": "2015-10-24T07:00:00.000+03:00", "crawled": "2015-10-24T11:59:38.125+03:00", "highlightTitle": ""}