{"organizations": [], "uuid": "456f960eb1eb0f87df7398768f53f8bbff258481", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "union-bulletin.com", "main_image": "http://unionbulletin.media.clients.ellingtoncms.com/img/photos/2013/08/29/UB_logo.png", "site_section": "http://union-bulletin.com/rss/headlines/sports/local/", "section_title": "union-bulletin.com stories: Local Sports", "url": "http://union-bulletin.com/news/2015/oct/14/hiker-celebrates-80th-birthday-atop-mount-mcloughl/", "country": "US", "title": "Hiker celebrates 80th birthday atop Mount McLoughlin", "performance_score": 0, "site": "union-bulletin.com", "participants_count": 1, "title_full": "Hiker celebrates 80th birthday atop Mount McLoughlin", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T21:20:00.000+03:00", "replies_count": 0, "uuid": "456f960eb1eb0f87df7398768f53f8bbff258481"}, "author": "Mark Freeman The (Medford) Mail Tribune", "url": "http://union-bulletin.com/news/2015/oct/14/hiker-celebrates-80th-birthday-atop-mount-mcloughl/", "ord_in_thread": 0, "title": "Hiker celebrates 80th birthday atop Mount McLoughlin", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Hiker celebrates 80th birthday atop Mount McLoughlin Mark Freeman The (Medford) Mail Tribune Print this article Advertisement BUTTE FALLS, Ore. — During the previous 41 times climbing to the top of Mount McLoughlin, Art Ekerson would soak up the views of Southern Oregon and Northern California in a panorama like none other. But trip No. 42 on Sept. 15 had a distinctly familial feel. He couldn’t let his eyes venture past son Kevin and daughter Cheryl as they peered off the peak like they did the first time they joined their father atop Mount McLoughlin 45 years earlier. And next to them stood 22-year-old granddaughter Keely, who helped save Ekerson’s life in a nearly fatal climb in 2010. Hell of a place to celebrate Ekerson’s 80th birthday. “It’s kind of like a reunion,” Ekerson says. “There comes a time you realize there’s a last time for that sort of thing.” What started as the adventure of a Boy Scout 66 years ago and continued over the decades through all sorts of family milestones, Ekerson’s regular dates with the 11-mile round trip on Mt. McLoughlin may be over, but the love affair will never die. “It’s local, it’s close and when you get up there it’s a beautiful view,” he says. “It’s like the old saying, ‘Why do you climb it? ‘Because it’s there.’ “You feel like you’ve accomplished something,” he says. “Then you eat your lunch, and it’s all downhill from there.” Ascending Mount McLoughlin has been a constant in Ekerson’s life, from those teenage days through his tour as mountain-climbing instructor in the U.S. Army and later as the owner of Medford’s Rogue Ski Shop for more than three decades. Since retirement, the Ekersons winter on a boat in the Bahamas and regularly make it back to the Rogue Valley, where Ekerson regularly entertains visitors at the family cabin at Lake of the Woods. Often the visits transformed into a day on the mountain. “He likes to host people on things they normally wouldn’t do,” says son Kevin Ekerson, 52, of Jacksonville. “That lets people learn they can do something they didn’t think they could and he’s always liked that.” That leadership tendency began in 1949, when Art Eckerson was a 14-year-old attending the Boy Scout camp near the trail. That campout included a hike up the mountain. “It was exciting and I got to where I loved it,” he says. The next three years he worked at the camp for $1 a day, and his duties included leading a half-dozen Boy Scout groups on ascents while he worked his way up to Eagle Scout. Ekerson helped parlay those experiences and training into a stint teaching climbing in Japan to American and other armed forces during the mid-1950s. Ekerson, however, kept returning to the mountain of his youth, and over time he noticed the ascent numbers accumulate. The 75th birthday trip almost became his last. While on the descent, Ekerson’s trifocals betrayed him, causing him to slip on a rock and plunge about 12 feet down. He struck a boulder head-on, and he thought it was over. His granddaughter Keely, then a teenager, scrambled up enough gauze to keep his wound in check before he was airlifted more than four hours later to safety. The 26 stitches left a scar on his scalp but not on his mindset. “I wanted to do it one more time and I did,” Ekerson says. “I thought that would be my last time. Then I turned 80.” The clan had to wait past Ekerson’s Aug. 16 birthday in a bow to family schedules and to give Kevin Ekerson more time to heal from a skiing accident. They nailed the trip, with Ekerson feeling just as spry the day after the climb than ever. The man who kept in shape by hiking, skiing and moonlighting as a rancher still has a pop in his step. “I still feel great,” he says. “I still can do anything, but it won’t last much longer. That’s a fact.” So is the realization that there won’t be any more Ekerson family reunions at the top of Southern Oregon. At least not with their patriarch there. “My kids made me sign a statement saying I’d never do it again,” Ekerson says. More like this story", "external_links": [], "published": "2015-10-14T21:20:00.000+03:00", "crawled": "2015-10-14T22:44:26.581+03:00", "highlightTitle": ""}