{"organizations": ["Cubs", "St. Louis Cardinals", "Longtime Chicago Cubs", "Associated Press", "Chicago Cubs"], "uuid": "177b36cc937bf53eea72b8e5b56deb126407d1a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.statesboroherald.com", "main_image": "http://media.morristechnology.com/webmedia/upload/statesboro_herald/article/2015/10/08/Chicago_Hope_Baseball_Heal.jpg", "site_section": "http://www.statesboroherald.com/syndication/feeds/rss/3/", "section_title": "Sports", "url": "http://www.statesboroherald.com/section/3/article/70545/", "country": "US", "title": "Chicago Cubs give their longest-suffering fans a bit of hope", "performance_score": 0, "site": "statesboroherald.com", "participants_count": 0, "title_full": "Chicago Cubs give their longest-suffering fans a bit of hope", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T05:52:00.000+03:00", "replies_count": 0, "uuid": "177b36cc937bf53eea72b8e5b56deb126407d1a7"}, "author": "", "url": "http://www.statesboroherald.com/section/3/article/70545/", "ord_in_thread": 0, "title": "Chicago Cubs give their longest-suffering fans a bit of hope", "locations": ["Wrigley", "Cubswin", "Wrigley Field", "Chicago", "Pittsburgh", "CHICAGO"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Dave Hillman", "Bailey", "Joseph G. Spreitzer", "Ernie Banks", "Loretta Czyzewski", "Joseph Spreitzer", "Margaret Bailey", "Ron Santo", "Moe Drabowsky", "Steve Bartman", "Rosann Volpe", "Louie Caffero", "Edith Heath", "Heath", "DON BABWIN", "Jake Arrieta", "Joe Maddon", "Caffero", "Kris Bryant"], "text": "Posted: October 8, 2015 11:04   8, 2015 10:52 p.m. Longtime Chicago Cubs fan Joseph Spreitzer, 72, sits in his wheelchair at Little Sisters of the Poor, Thursday, Oct. 8, 2015, in Chicago. Winning it all has been a goal of the Cubs for a long, long time, of course. Their World Series drought dates to 1908, one of the longest in sports history. By DON BABWIN Associated Press CHICAGO (AP) — Living in a nursing home run by the Little Sisters of the Poor, 82-year-old Edith Heath knows something about faith. As a fan of the Chicago Cubs who was born 25 years after her favorite team last won the World Series, she knows there are only so many times she can get her hopes up only to be disappointed. So this year is it. \"I'll give up if they don't win this year,\" Heath said Thursday in the lobby of the nursing home about a mile from Wrigley Field. \"If they don't do it, I wouldn't want to even hear their name. I would just say I've had it.\" Winning it all has been a goal of the Cubs for a long, long time, of course. Their World Series drought dates to 1908 and there has been more heartbreak along the way than Heath or any other Cubs fan would care to remember. But this year has a different feel to it. There's a new owner and new front office personnel calling the shots for Chicago and more young talent in the Friendly Confines than there has been in a long time. There is a bona fide Cy Young candidate in ace Jake Arrieta, a possible rookie of the year in Kris Bryant and maybe the league's best manager in Joe Maddon. So when the Cubs beat Pittsburgh in the wild-card game Wednesday night, there were celebrations — but also a sense of more to come. Next up is the National League Division Series against the hated St. Louis Cardinals. Over the next several days, plenty of twentysomething fans will proudly say they have waited their whole lives for the Cubs to win it all. But for those whose love affair with the Cubsstarted well before Steve Bartman was born, this playoff run brings with it feelings that fans who don't remember Wrigley without lights or recall days when ladies got in free can't possibly understand. \"It's time for our hopes to come true,\" 81-year-old Margaret Bailey said at a community pool near Wrigley, just before her older friend — she won't say how much older — Loretta Czyzewski added: \"While we can still enjoy it.\" Outside, 52-year-old construction worker Louie Caffero does not trace his fandom as far back as Bailey, who recalls fondly moving to Chicago in 1955 and knowing players like Moe Drabowsky and Dave Hillman as both Cubs and neighbors in her apartment building. But he is old enough to know he doesn't want to be one of those people in his family — or the Cubsfamily, like Ron Santo and Ernie Banks — who lived and died without ever seeing the Cubswin a World Series. \"I want to see it in my lifetime,\" Caffero said. \"My grandfather talked about back when theCubs were in the World Series (in 1945) but he never saw them win the World Series. \" Caffero said he is a lot more willing to show his excitement than his 78-year-old father, from whom he inherited his love for the Cubs. \"He's keeping his cool but maybe that's because he's had a lot more disappointment along the way than I have,\" he said. Back at the Little Sisters of the Poor, Heath is tempering her hope, saying she's not quite ready to let go of that sneaking suspicion that the Cubs won't win it all, that something will happen, as it always does, to prevent it. And she is sure not ready to put a World Series in the one-thing-before-I-go category, either. Others at the nursing home say the heck with that. \"I'm in all the way,\" said Rosann Volpe, who is 74. \"I want to see them win before I close my eyes.\" And fellow resident Joseph G. Spreitzer, 72, said he fully expects that his long wait for a World Series is just about over. \"Miracles do happen,\" he said.  ", "external_links": [], "published": "2015-10-09T05:52:00.000+03:00", "crawled": "2015-10-09T12:21:12.695+03:00", "highlightTitle": ""}