{"organizations": [], "uuid": "63726e9105bc8ee9f4c8b3c246aa4e4e1b7bbb18", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thegazette.com", "main_image": "http://www.thegazette.com/storyimage/GA/20151011/ARTICLE/151019938/AR/0/AR-151019938.jpg", "site_section": "http://feeds.feedburner.com/~r/GazetteOnlineSports/~6/1", "section_title": "Eastern Iowa Sports News and Information from Gazette Online", "url": "http://www.thegazette.com/subject/sports/b1g-rewind-a-maize-ing-juggernaut-20151011", "country": "US", "title": "B1G Rewind: A-Maize-ing juggernaut", "performance_score": 0, "site": "thegazette.com", "participants_count": 0, "title_full": "B1G Rewind: A-Maize-ing juggernaut", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T18:44:00.000+03:00", "replies_count": 0, "uuid": "63726e9105bc8ee9f4c8b3c246aa4e4e1b7bbb18"}, "author": "", "url": "http://www.thegazette.com/subject/sports/b1g-rewind-a-maize-ing-juggernaut-20151011", "ord_in_thread": 0, "title": "B1G Rewind: A-Maize-ing juggernaut", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Scott Dochterman"], "text": "Scott Dochterman , The Gazette October 11, 2015 | 12:18 pm \nThe Big Ten boasts the nation’s top-ranked team and two squads in the top five. But its best team right now has one loss and is engaged in an epic turnaround. \nMichigan (5-1, 2-0) missed the postseason last year and hired Jim Harbaugh last December to restore the Wolverines to their previous lofty heights. In six games, the maize-and-blue juggernaut is back in Ann Arbor. \nIn a battle of the nation’s top two scoring defenses, No. 21 Michigan manhandled No. 14 Northwestern 38-0 on Saturday. The Wolverines ruthlessly battered the Wildcats (5-1, 1-1) in every way possible. Northwestern had allowed only 35 points in its first five games, and the Wolverines put up 38. The Wildcats had allowed just three touchdowns in their first five games; Michigan scored three in the first quarter. \n“The fellas really came out balling and played a heck of a ballgame,” Harbaugh said. “I’m really pleased.” \n“They brought it all day,” Northwestern superback Dan Vitale said. “All the credit goes to them. They fought us all day and put the pressure on the quarterback. They played hard every single play.” \nThe superlatives are astounding. Michigan has unleashed a 97-0 scoring onslaught against its last three foes and over the last 19 quarters, it has buried its opponents 157-7. \nThe Wolverines became the first Big Ten team to shut out three consecutive opponents since they did it in 1980. Two of those opponents — BYU and Northwestern — were ranked, and Michigan dispatched them 69-0. \nNo opponent has rushed for 100 yards in the Wolverines’ last five games and only three times during that span did a team boast a drive of at least 50 yards. Michigan allows just 65.8 rushing yards and 115.6 passing yards a game. \n“With a couple of exceptions, we really shut down their running game,” Harbaugh said. “For all intents and purposes, we shut down the running game. Coverage, our guys were in their hip pocket most every route, getting their hands on the ball. They threw the back shoulder on (cornerback) Jourdan Lewis a couple of times and one time he made an incredible interception. \n“The pass rush was intense. All three of those phases were at the highest level (Saturday) and working together. A-plus-plus.” \nMichigan set the tone with Jehu Chesson returning the opening kickoff 96 yards for a touchdown. Chesson broke from the left side of the field and sprinted diagonally to the right sideline and up for the score. \n“The blocks were sharp and crisp,” Harbaugh said. “The timing was nearly perfect. Eleven guys hustling, 10 of them blocking, blocking for Jehu. He is the fastest player on the team, and he showed it (Saturday).” \nWith the Wolverines leading 21-0, Northwestern quarterback Clayton Thorson appeared to complete a pass to Mike McHugh near the 35-yard line. However Lewis snagged the ball from McHugh along the sideline and raced 37 yards for the score. \nMichigan’s offense has become nearly as efficient as the defense is stout. The Wolverines turned all three red-zone trips into points and now have scored on 19-for-20 possessions inside their opponents’ 20-yard line. \nFormer Iowa and current Michigan quarterback Jake Rudock completed 17 of 23 passes for 179 yards. He also rushed for a touchdown. \n“I think Jake took what we gave him,” Northwestern Coach Pat Fitzgerald said. “You can’t take everything away. He was able to find things. He is a veteran quarterback. He has played a lot of Big Ten games and he was smart with the ball, got it out of his hands quickly. Especially when we had some pressure.” \nRudock now is 3-0 starting against the Wildcats. In 2013, Rudock guided Iowa to a 17-10 overtime victory. The last two years, Rudock’s teams have beaten Northwestern a combined 86-7. \n“It’s never going to be easy. Having played those guys for a number of years, they’re a really solid defense,” Rudock said. “It’s just great to be able to go out there and put points on the board. \n“I am absolutely ecstatic to see Jake Rudock graduate,” Fitzgerald said. “He has been a thorn in our side at two institutions. He is a great young man. I want to congratulate him. It’s good to see him graduate.” \nWEST DIVISION ELIMINATOR \nWisconsin and Nebraska entered the season as the Big Ten’s West Division favorites. But after nail-biting defeats in their Big Ten openers, their game virtually would eliminate the loser from the divisional race. \nIn what has become a trend, Nebraska failed to secure a lead in the final seconds and Wisconsin (4-2, 1-1) pulled off a 23-21 win at Memorial Stadium. It was the third time the Cornhuskers (2-4, 0-2) lost a game it led in the final 10 seconds. The team’s other defeat was in overtime. \n“I don’t think I’ve ever really seen this before,” Nebraska Coach Mike Riley said. “But, we’re in it. When you’ve had games like we’ve had, you will look at many different circumstances on how your playing or coaching could make a difference. I feel like there are tangible things we’ve just got to do better.” \nWhile bad luck is an intangible, Nebraska’s propensity for poor pass defense and penalties are a tangible detriment. The Cornhuskers rank last nationally in pass defense at 348.5 yards per game, 22 yards worse than runner-up Bowling Green. Nebraska ranks 120th nationally at 82.6 penalty yards per game. \nIn Nebraska’s three last-second losses, its pass defense and penalties let it down. Quarterbacks from BYU, Illinois and Wisconsin combined for 22 completions in 44 attempts for 356 yards and three touchdowns (no interceptions) in the fourth quarter. Those three schools had 14 passing first downs in the final period alone. The defense committed three pass interference penalties, which led to 14 opponent points. Those teams outscored Nebraska 37-7 in the fourth quarter. \n“We have to keep working with the guys technically,” Riley said. “It’s like we did during camp and like we continue to do. I know it doesn’t necessarily look like it, but we are in better shape. (Wisconsin QB Joel Stave) threw some balls that were nice balls, they made some nice plays on the boundary. At the same time, we have to continue to help them and improve that. Just get a little bit better vision on the football.” \nIOWA HOLDS TOGETHER \nMuch has been discussed about Iowa Coach Kirk Ferentz’s semi-makeover in his approach. But perhaps the most impressive part of Iowa’s 6-0 start has been its ability to stick together despite a slate of injuries that normally would cripple most teams. \nThe Hawkeyes have played two games without their starting left tackle (Boone Myers) and top wide receiver (Tevaun Smith). Iowa’s original starting running back (LeShun Daniels) has been hampered since the second game with an ankle sprain. Saturday against Illinois, right tackle Ike Boettger (lower leg) and top defensive end Drew Ott (knee) both were lost with injuries. It’s feared Ott is out for the season with a torn ACL. \n“We’ve got some guys nicked up,” Ferentz said. “We’ve got some guys jumping in, and next man in, and then next man ready on top of it.” \nIowa’s makeshift offensive line Saturday consisted of former walk-on now left tackle Cole Croston and true freshman guard (and right tackle) James Daniels paving the way for former second-team running back Jordan Canzeri to run for 256 yards on a school-record 43 carries. Canzeri’s run total was the third highest in school history. \nGuard Jordan Walsh left the game in the first half with a shoulder injury but fought through it to play in the second half. \n“It just shows that through adversity the offensive line regathers and tries to execute,” Walsh said. \nRANKING GAME \nOhio State remained on top of the USA Today/Coaches poll, while Michigan State slipped to fourth. Michigan soared seven spots to 14th, and Iowa moved up six spots to 17. Northwestern fell to 21st, while Wisconsin, Penn State and Illinois each received votes. \nTHUMBS UPS \nMichigan kept the ball for 37:05 and held Northwestern to just 168 total yards. ... Iowa improved to 6-0 for the second time under Coach Kirk Ferentz and first since 2009. ... Wisconsin’s defense stifled Nebraska to just 4.6 yards per pass attempt (11-28, 129 yards). ... Minnesota outrushed Purdue 326-68. ... Penn State held Indiana to just 234 total yards after the Hoosiers averaged 498.2 yards per game. ... Michigan State converted 11 of 17 third-down opportunities. \nTHUMBS DOWNS \nNorthwestern rushed for 38 yards on 25 carries and was just 2 of 13 on third down. ... Illinois held the ball just 3:08 in the fourth quarter. ... Nebraska entered the day ranked last in penalty yards per game and added nine more for 89 yards. ... Purdue was just 3 of 17 on third down and held the ball for less than 24 minutes. ... Ohio State allowed Maryland, the league’s 11th-ranked rushing attack, to run for 253 yards. ... The Terrapins completed just 10 of 27 passes for 133 yards and two interceptions. ... Indiana scored just seven points after averaging 36.0 entering Saturday’s game at Penn State. ... Rutgers struggled on third down with only 3 of 12 conversions. \nWEEKEND STARS \nMichigan cornerback Jourdan Lewis returned an interception 37 yards for a score, had a tackle for loss and a pass breakup. ... Iowa running back Jordan Canzeri rushed for 256 yards on a school-record 43 carries and scored two TDs. ... Minnesota freshman running back Shannon Brooks ran 17 times for 176 yards and a TD. ... Maryland RB Perry Hills rushed for 170 yards and two TDs. ... Penn State QB Christian Hackenberg completed 21 of 39 passes for 262 yards and two TDs and rushed for two more scores. ... Rutgers WR Leonte Carroo returned from suspension to catch seven passes for 134 yards and three TDs. \nNOTEWORTHY \nIllinois wide receiver Geronimo Allison grabbed eight passes for 148 yards and a TD. ... Wisconsin WR Alex Erickson caught seven passes for 113 yards a week removed from a game-ending injury. ... Nebraska punter Sam Foltz averaged 43.8 yards on nine punts with only one touchback. ... Northwestern’s Deonte Gibson had five tackles, including 2.5 sacks. ... Purdue linebacker Danny Ezechukwu had 10 tackles, including a sack and an interception. ... Ohio State DE Tyquan Lewis had five tackles, including 2.5 for loss. ... Indiana punter Erich Toth averaged 41 yards on his 11 punts and placed four inside the 20. ... Michigan State WR Aaron Burbridge caught nine passes for 146 yards. \nPOWER RANKINGS \n1. Michigan (3C) 5-1 2-0 \nNo more half-measures: Wolverines are Big Ten’s best team right now \n2. Ohio State (1) 6-0 2-0 \nBuckeyes have yet to translate talent into domination \n3. Iowa (3B) 6-0 2-0 \nPatching up holes with duct tape but a rugged outfit \n4. Michigan State (2) 6-0 2-0 \nHave yet to win with style points \n5. Wisconsin (6) 4-2 1-1 \nRoad win keeps Badgers alive in West Division race \n6. Northwestern (3A) 5-1 1-1 \nHow will Wildcats respond after thrashing? \n7. Penn State (9) 5-1 2-0 \nMethodically taking steps as a program \n8. Minnesota (11) 4-2 1-1 \nWhere did that offensive output come from? \n9. Illinois (8) 4-2 1-1 \nAfter Michigan, maybe league’s most improved team \n10. Indiana (7) 4-2 0-2 \nWe’ll know if Hoosiers are a bowl team this week \n11. Nebraska (10) 2-4 0-2 \nPenalties, pass defense tell story of continual heartbreak \n12. Rutgers (13) 2-3 0-2 \nStill has a chance to turn around season despite turmoil \n13. Purdue (12) 1-5 0-2 \nFlattened and flatlined against Minnesota \n14. Maryland (14) 2-4 0-2 \nProgram has untapped potential for success \nSTANDINGS", "external_links": [], "published": "2015-10-11T18:44:00.000+03:00", "crawled": "2015-10-11T20:37:06.945+03:00", "highlightTitle": ""}