{"organizations": [], "uuid": "21ae895f22f0cdab0cadbddfdaa86747856ce9a1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcdfw.com", "main_image": "http://media.nbcdfw.com/images/1200*675/blue-jays-at-rangers-2014.jpg", "site_section": "http://www.nbcdfw.com/news/sports/?rss=y&embedThumb=y&summary=y", "section_title": "NBC 5 Dallas-Fort Worth - Dallas-Fort Worth Sports News, Analysis, and Scores for the Giants, Jets. Patriots, Huskies, Knicks and More", "url": "http://www.nbcdfw.com/news/sports/On-Deck-Blue-Jays-at-Rangers-Games-3-4-331888531.html", "country": "US", "title": "On Deck: Blue Jays at Rangers, Games 3-4", "performance_score": 0, "site": "nbcdfw.com", "participants_count": 1, "title_full": "On Deck: Blue Jays at Rangers, Games 3-4", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T00:19:00.000+03:00", "replies_count": 0, "uuid": "21ae895f22f0cdab0cadbddfdaa86747856ce9a1"}, "author": "ADAM BOEDEKER", "url": "http://www.nbcdfw.com/news/sports/On-Deck-Blue-Jays-at-Rangers-Games-3-4-331888531.html", "ord_in_thread": 0, "title": "On Deck: Blue Jays at Rangers, Games 3-4", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Privacy Policy | More Newsletters NBC 5 News On Deck will be here all season to provide you with everything you need to know (and a few things you don't) about every Rangers series during the 2015 season. The Opponent : The Blue Jays are like Mike Tyson, and the Rangers are Buster Douglas, and Tyson just got that first hit to the mouth that staggered him before the big knockout blow. Toronto was seen as the World Series favorite entering the postseason — 23 ESPN \"experts\" picked the series, and 23 picked Toronto — but now they must win three straight from Texas to avoid being first-round fodder. Past 2015 Meetings : The Blue Jays won the regular-season series 4-2, but after the Rangers' two wins to start the series north of the border, we're all square at four wins apiece, including the postseason. Pitching Matchups : Sunday — Martin Perez (3-6, 4.46 ERA) vs. Marco Estrada (13-8, 3.13); *Monday — Derek Holland (4-3, 4.91) vs. R.A. Dickey (11-11, 3.91). *if necessary What's Hot : After going through some peaks and valleys this year — expected after Tommy John surgery last May — Perez has been pretty solid over the last month, which is probably why he was a somewhat surprising choice to pitch Game 3 of the series — that and groundball ratio. In his last four starts, he's 1-1 with a 2.25 ERA and has averaged right at six innings per start. If he can do that Sunday and turn the game over to his bullpen, he'll be in good shape. The Rangers' pen has been the star of the club in the first two games, as Jake Diekman, Keone Kela, Sam Dyson, Ross Ohlendorf and Shawn Tolleson have combined for two saves and 11 innings with just one run allowed (a solo home run off Kela). The Rangers' bats have been carried by their two youngest everyday players in Delino DeShields and Rougned Odor. DeShields is 5-for-11 with two doubles, three runs, two RBIs and a stolen base, while Odor has perhaps been the star of the series so far with a 2-for-7 clip, but has added a walk and two hit-by-pitches for an on-base percentage of .500. He has a homer and has scored five runs in the two games. Over the past month, both Estrada and Dickey have been really solid for the Jays with a 2.94 ERA and 3.16, respectively, over the last four times through the rotation (five starts for Estrada). Of all the big bats in the Blue Jays' lineup, it's been light-hitting speedster Ben Revere at the top of the order who's been carrying the load offensively. Revere is batting .300 with an RBI and a stolen base over the last two games. What's Not : Josh Hamilton is 0-for-10 with four strikeouts over the first two games and is now 0-for his last 28 postseason at-bats, dating back to Game 7 of the 2011 World Series. Elvis Andrus, Shin-Soo Choo and Prince Fielder are all stuck at just one hit apiece over the first two games. Josh Donaldson homered in Friday's Game 2 loss, but that's about all the AL MVP candidate has done, as that was his only hit over the first two games of the series to go with a walk. Troy Tulowitzki, who was injured and returned the final week of the regular season, is playing, but we're not so sure he's 100 percent. The noted Rangers killer is 0-for-10 in the series with four strikeouts. Perhaps the Blue Jays' best reliever at the moment, Brett Cecil, tore his calf muscle in Friday's loss, dealing a huge blow to the Blue Jays' pen. Familiar Faces : R.A. Dickey came up in the Rangers' organization, struggled and then reinvented himself as a knuckleballer before winning a Cy Young with the Mets and then cashing in with a big deal with the Blue Jays. Blue Jays first baseman Justin Smoak was once a prized Rangers prospect before he was the key piece to the trade that brought back Cliff Lee from Seattle for the final few months of the magical 2010 season. Published 42 minutes ago", "external_links": [], "published": "2015-10-11T00:19:00.000+03:00", "crawled": "2015-10-11T01:28:33.268+03:00", "highlightTitle": ""}