{"organizations": [], "uuid": "0e9645f36078ad832723b58ebfef4bdce622e4be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www2.ljworld.com", "main_image": "http://worldonline.media.clients.ellingtoncms.com/img/croppedphotos/2015/10/20/Masoncrop_t800.jpg?90232451fbcadccc64a17de7521d859a8f88077d", "site_section": "http://www2.ljworld.com/rss/headlines/sports/ku/", "section_title": "LJWorld.com stories: KU sports", "url": "http://www2.ljworld.com/news/2015/oct/21/media-day-self-envisions-lineups-kansas-city/", "country": "US", "title": "Media Day: Self envisions lineups in Kansas City", "performance_score": 0, "site": "ljworld.com", "participants_count": 1, "title_full": "Media Day: Self envisions lineups in Kansas City", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T08:02:00.000+03:00", "replies_count": 0, "uuid": "0e9645f36078ad832723b58ebfef4bdce622e4be"}, "author": "Gary Bedore", "url": "http://www2.ljworld.com/news/2015/oct/21/media-day-self-envisions-lineups-kansas-city/", "ord_in_thread": 0, "title": "Media Day: Self envisions lineups in Kansas City", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Gary Bedore — Lawrence Journal-World October 21, 2015 \nAdvertisement \nKansas City, Mo.  Three weeks into training camp, with a bunch of practices in the books, Kansas University basketball coach Bill Self continues to envision a starting lineup that includes quick ball-handling guards Devonté Graham, Frank Mason III and Wayne Selden, Jr. \n“I think it gives us more play-making. I think it gives us more speed and I think will create more easy baskets for our big guys because we’ll have better passers in the game,” Self said at Tuesday’s Big 12 Media Day in Sprint Center. \n“Frank’s a much better player than he was last year,” Self said of the 5-11 junior. “He’s going to continue to get better because his understanding of the game is going to get better. I think what Frank is, he’s not a true point guard. People think he’s a point guard because he’s not very tall. But Devonté and him together, I think you’ll see Frank playing a lot off the ball. Devonté (6-2 sophomore) in a lot of ways is more of a true point than Frank, and I think that will free Frank up to even score more.” \nAnd it’d free 6-foot-5 junior Selden to accept passes on the wing where he can drive for easy buckets or spot up and shoot the three. That is, if he can shake the effects of a nasty ankle sprain that’s slowed him for about a month. \n“He’s had a good camp. His ankle has not allowed him to be explosive yet,” Self said. “Inside ankle sprain takes forever to heal.” \nThe obvious player to fill the starting power forward position at this early date (KU opens the exhibition season against Pittsburg State on Nov. 4) is senior Perry Ellis. The post is up for grabs. \n“Perry has been our best player so far,” Self said. “We’ve got good balance in our frontcourt without question. We’ve got six guys I’m confident we can put in there at any time,” he added of the ‘bigs’ group of Ellis, Carlton Bragg, Landen Lucas, Jamari Traylor, Hunter Mickelson and Cheick Diallo if he’s eligible. \nWhile noting that “we are not near as deep on the perimeter as we are inside,” he also has able bodies in Svi Mykhailiuk, Brannen Greene and Lagerald Vick to battle for minutes with Mason, Selden and Graham. \n“I think this year we could play nine (in rotation) — five perimeter players and four big guys,” Self said. “The (rules) meeting I just sat through ... there’s a chance we could play 11 this year because I think everybody is going to foul until they get used to the game. I think inside depth is going to be important.” \nIn an attempt to make the game more free-flowing, officials, Self said, will call fouls for “illegal screens, displacing guys on the post, illegal blockouts. I’ve always been (telling) a guy on a blockout, ‘hit and go get.’ Now ‘hit’ is illegal. You’ve got to change your techniques on how you do some things.” \nSelf said practices have been going well for the most part. Like Selden, Traylor has been slowed by an ankle sprain this week. \n“What do I like? We are better playmakers. I think Perry, Wayne and Frank are much better players than they were last year,” Self said. “I think experience. There’s a lot to like but also a lot of things not to like too. The guys are pretty competitive. They want it bad and they like each other. That encourages me.” \nOf sophomore guard Mykhailiuk, Self said: “He’s a much better player than he was last year, much stronger.” \nAs far as a possible update on Diallo, who is awaiting word on his eligibility from the NCAA, Self said: “We think there could be an update obviously soon because our season starts here in three weeks. The reality is he’s practicing and hasn’t been cleared to play. We do think it’ll come to a conclusion in the next couple weeks.” \nRecruiting: Mitch Lightfoot, a 6-8 senior from Gilbert (Arizona) Christian, who is ranked No. 117 in the Class of 2016 by Rivals.com, will announce his college choice at 3 p.m., Central time, Saturday at the Arizona Preps Fall Showcase. Several analysts believe KU is the leader over Arizona, Utah, Stanford and St. John’s.", "external_links": [], "published": "2015-10-21T08:02:00.000+03:00", "crawled": "2015-10-21T08:31:47.827+03:00", "highlightTitle": ""}