{"organizations": [], "uuid": "25245a2fb97f27649b581c22b280350a50b93f0b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.google.com", "main_image": "http://www.stuff.co.nz/content/dam/images/1/7/9/8/k/m/image.related.StuffLandscapeSixteenByNine.620x349.1798gg.png/1443755004381.jpg", "site_section": "http://news.google.com/news?pz=1&cf=all&ned=us&hl=en&topic=s&output=rss", "section_title": "Sports - Google News", "url": "http://news.google.com/news/url?sa=t&fd=R&ct2=us&usg=AFQjCNEPB1a1yGOILwFTXk4aAWDO-jVsqQ&clid=c3a7d30bb8a4878e06b80cf16b898331&cid=52778962408102&ei=hwgOVtDZEYvTafCTv-gP&url=http://www.stuff.co.nz/sport/racing/72654352/sarah-stewart-hopeful-pheasant-will-soar-to-cup-start", "country": "IL", "title": "Sarah Stewart hopeful Pheasant will soar to cup start - Stuff.co.nz", "performance_score": 0, "site": "google.com", "participants_count": 0, "title_full": "Sarah Stewart hopeful Pheasant will soar to cup start - Stuff.co.nz", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T06:04:00.000+03:00", "replies_count": 0, "uuid": "25245a2fb97f27649b581c22b280350a50b93f0b"}, "author": "", "url": "http://news.google.com/news/url?sa=t&fd=R&ct2=us&usg=AFQjCNEPB1a1yGOILwFTXk4aAWDO-jVsqQ&clid=c3a7d30bb8a4878e06b80cf16b898331&cid=52778962408102&ei=hwgOVtDZEYvTafCTv-gP&url=http://www.stuff.co.nz/sport/racing/72654352/sarah-stewart-hopeful-pheasant-will-soar-to-cup-start", "ord_in_thread": 0, "title": "Sarah Stewart hopeful Pheasant will soar to cup start - Stuff.co.nz", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Andrew Gorrie", "Sarah Stewart"], "text": "Sarah Stewart hopeful Pheasant will soar to cup start MAT KERMEEN Last updated 16:03, October 2 2015 Andrew Gorrie \nRyan Bishop and Pheasant will chase down a New Zealand Cup start in the North Canterbury Cup. \nThere is no better bet than Pheasant falling back before flying home on Saturday. \nAnd it is because of that racing style that 23-year-old trainer Sarah Stewart is daring to dream of a start in the Group III New Zealand Cup. \nPheasant, a winner of five races from 49 starts, will contest the $25,000 North Canterbury Cup at Riccarton on Saturday - the winner is guaranteed a start in November's cup. \n\"The reason we are racing in open handicaps is because the winner is exempt from the ballet,\" Stewart said. \nWith 77 rating points Pheasant would likely need another win to make the field. \nPheasant has been in carer best form since joining Stewart, with two wins and two fourths from his last four starts, and the Riccarton based trainer believes he would \"stay all day\". \n\"His racing style should really suit a race like the cup because he relaxes so well and when he does pick his moment to go he tries so hard. \n\"He's bred to stay and he's more than capable of getting the distance because he doesn't spend his pennies early,\" Stewart said. \nIt might be a Group III, but Stewart, like most in the industry, still regard the cup as one of the most prestigious races around. \n\"It would be unreal if we could get a start, I never thought I would be in a position to have a horse even close to getting a start in a New Zealand Cup this soon,\" she said. Ad Feedback \nBoth Pheasant's recent wins came in rating 75 company but the last start fourth behind Benzini was at open handicap level and Pheasant hit the line strongly after coping a check in the straight. \nFor Stewart, a start in the cup would be a continuation of the dream beginning to her training carer that only started earlier this year. \nWith three winners already on the board, two coming this season, Stewart is still pinching herself, but she credits much of her success to her partner Daryl Long. \nWith five horses in work, Stewart and Long ride their own track work, which Stewart said was a major advantage because they knew exactly where their runners are at every day. \nStewart has been spacing the 8-year-old's races to help combat the firmer tracks. \n\"The cup is the main aim but he will have to prove he can handle the firmer tracks,\" she said. \n\"He's always grown an extra leg in the mud but his last few starts in dead and slow tracks have been encouraging.\" \nStewart doubts the Thorn Park gelding would be competitive over shorter trips on a good track, but believes he can be over two miles. \nPheasant began his racing career with Guy Lowry and Grant Cullen before moving to Prebbleton trainer Brian Gliddon. \nWhen Gliddon did not renew his license this season his runners were transferred to Stewart. \n\"We're very fortunate to be given this opportunity,\" Stewart said. \nBecoming a trainer was a natural progression for Stewart who started riding ponies at the age of six and went on to cut her teeth in racing working for Shane Laming and Lisa Latta. \nRyan Bishop has been aboard Pheasant almost exclusively since February 2014 and Stewart did no hesitation sticking with him this season. \n\"Because he knows him so well he can give us really detailed feedback and he has a very positive attitude,\" Stewart said. - Stuff", "external_links": [], "published": "2015-10-02T06:04:00.000+03:00", "crawled": "2015-10-02T07:31:34.152+03:00", "highlightTitle": ""}