{"organizations": [], "uuid": "6aa96a9e2daf2b25629987efe683bfdbbc0a72b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.detroitnews.com", "main_image": "http://www.gannett-cdn.com/-mm-/b9fbbb0f2ea74db1cd9ca4e806656abe3cbbe89a/c=0-172-4678-2815&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/09/DetroitNews/B99313140Z.1_20151009220550_000_GVIJV1NU.1-0.jpg", "site_section": "https://feeds.feedblitz.com/detroit/sports", "section_title": "Detroit News - Sports", "url": "http://www.detroitnews.com/story/sports/nhl/red-wings/2015/10/09/wings-franzen-relieved-healthy-last/73697010/", "country": "US", "title": "Wings’ Franzen is relieved he’s healthy at last", "performance_score": 0, "site": "detroitnews.com", "participants_count": 3, "title_full": "Wings’ Franzen is relieved he’s healthy at last", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T02:47:00.000+03:00", "replies_count": 2, "uuid": "99e74892d34575ac912a53ef045c47b26e96d0ab"}, "author": "detroitnews.com", "url": "http://www.detroitnews.com/story/sports/nhl/red-wings/2015/10/09/wings-franzen-relieved-healthy-last/73697010/#post-0", "ord_in_thread": 0, "title": "Wings’ Franzen is relieved he’s healthy at last", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Detroit left wing Johan Franzen, left, and left wing Justin Abdelkader celebrate Abdelkader's first goal in the first period. (Photo: David Guralnick / Detroit News) \nDetroit — Much of the talk surrounding Friday night’s Red Wings season opener has been about rookie Dylan Larkin, new coach Jeff Blashill, Toronto coach Mike Babcock’s return to Detroit.\nIn a way, it was easy to forget about Johan Franzen’s return to playing.\nFranzen was in the lineup for his first official game since Jan. 6.\nHe played 13 minutes, 21 seconds, had an assist on Justin Abdelkader’s power-play goal which opened the scoring in a 4-0 Red Wings victory, and was credited with two hits.\nFranzen was blindsided in a collision with Oilers forward Rob Klinkhammer that evening in January, which led to Franzen getting another concussion and ultimately ending his hockey season.\nBut he gradually recovered, slowly got back into hockey shape, and after going through training camp and playing in four exhibition games, he was officially back in the NHL again.\nFranzen was very anxious to get back into the swing of the season.\n“I’m looking forward to it,” he said in front of a large media contingent after Friday’s morning skate. “I missed a hockey a lot. I don’t know when I got hurt last season, but it feels like I haven’t played in a year or two.”\nIt hasn’t been that long, obviously, but it’s easy to understand why Franzen feels it has.\nFranzen admits there were many long, dark, difficult days the first few months as he was struggling with piercing headaches.\nThe headaches were painful, he couldn’t train and keep in condition, and maybe most painful of all, couldn’t play with his kids.\nThough Franzen never thought about retirement, it was a difficult period to overcome.\n“I was in a dark place for a while,” Franzen said. “But it was never really on my mind it would stay like that forever. My focus was on getting back to playing.\n“It was like that the whole time.”\nFranzen was on a line centered by Riley Sheahan, with Teemu Pulkkinen on the other wing (replacing Luke Glendening, who had occupied the spot most of the exhibition season).\nFranzen was excited about the fact they all contribute different elements to the line and could become an effective, dangerous combination.\nWith a spot, also, on the power play, Franzen hopes to relive some of his big offensive seasons. With his size and offensive touch, a healthy, productive Franzen would be a boost to the Red Wings’ offense.\nCoach Jeff Blashill, too, was anxious to see Franzen in a regular-season setting and hoped to see what a productive Franzen could bring to the Red Wings.\n“He’s been a really good player in this league for a long time, so I want him to do what he does best,” Blashill said. “He’s a very accountable defensive player and obviously has a great ability to score goals.”\nFranzen sounded as if there was going to be a few butterflies in Friday’s return. But the anticipation was never so sweet.\nOpposing coaches \nBabcock is pleased Blashill, his former assistant, replaced him as Red Wings coach.\n“I know he’s enjoying being the Red Wings coach and he should be the Red Wings coach, he’s a Michigan guy,” Babcock said. “He’s done a lot to get to this opportunity and he has a good team and he’ll have fun with that and I’ll have fun coaching the Leafs.”\nBlashill made a point of saying it was players and the two teams who were the focus — and not the head coaches.\nIce chips \nGoaltender Petr Mrazek will start tonight in Carolina.\n… Henrik Zetterberg turned 35 Friday.\n…Friday’s sellout was the 189th consecutive at Joe Louis Arena, every game since Dec. 19, 2010.\nted.kulfan@detroitnews.com \ntwitter.com/tkulfan", "external_links": [], "published": "2015-10-10T02:47:00.000+03:00", "crawled": "2015-10-10T15:34:45.282+03:00", "highlightTitle": ""}