{"organizations": [], "uuid": "6c61488e47ab4d6c87b16ad7307b3f9b575c751c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sfgate.com", "main_image": "http://ww2.hdnux.com/photos/41/53/44/8829233/3/rawImage.jpg", "site_section": "http://www.sfgate.com/rss/feed/Top-Sports-Stories-RSS-Feed-487.php", "section_title": "Top Sports Stories RSS Feed", "url": "http://www.sfgate.com/sharks/article/Blue-Jackets-change-coaches-6582886.php", "country": "US", "title": "Columbus Blue Jackets change coaches", "performance_score": 0, "site": "sfgate.com", "participants_count": 1, "title_full": "Columbus Blue Jackets change coaches", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T02:24:00.000+03:00", "replies_count": 0, "uuid": "6c61488e47ab4d6c87b16ad7307b3f9b575c751c"}, "author": "Associated Press", "url": "http://www.sfgate.com/sharks/article/Blue-Jackets-change-coaches-6582886.php", "ord_in_thread": 0, "title": "Columbus Blue Jackets change coaches", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Columbus fired head coach Todd Richards after losing their first seven games of the season. Columbus fired head coach Todd Richards after losing their first seven games of the season. Photo: Jay LaPrete, Associated Press Columbus Blue Jackets change coaches 1 / 1 Back to Gallery \nJohn Tortorella hoisted a Stanley Cup with Tampa Bay and led the New York Rangers to the verge of a championship berth. \nAt woebegone Columbus, the Blue Jackets have a more modest goal for the longtime head coach: Win a game. \nTortorella is back coaching in the NHL after the Blue Jackets fired Todd Richards on Wednesday with the team winless in seven games. \n“He’s proven he’s a good coach,” said center Brandon Dubinsky , who played for Tortorella with the Rangers from 2008 through ’12. “He’s going to help our group. Unfortunately, it’s going to be at the expense of a great person and a great coach, (but) we got another one. We’ve got to step up for him.” \nTortorella, who won the Stanley Cup with the Tampa Bay Lightning in 2004, has been out of hockey since the Canucks fired him in May 2014 after one season in Vancouver. He replaces Richards, who had been with the Blue Jackets since 2012 and led them to only their second NHL playoff appearance in 2013-14, when they lost to the Penguins in the opening round. \n“One of the problems right now is expectations,” Tortorella said. “Expectations that weren’t there last year with this club.” \nColumbus is the sixth NHL team in history to open with seven consecutive losses after a 4-0 decision against the New York Islanders on Tuesday night. It’s the Blue Jackets’ worst start in franchise history, and their longest losing streak since dropping seven straight in regulation in November 2005. \nTuesday’s games \nCanadiens 3, Blues 0: Carey Price made 38 saves for his second shutout in his past three starts and Alex Semin scored his first goal as host Montreal won a team-record seventh in a row to begin the season. Max Pacioretty and Torrey Mitchell also scored for the Canadiens, who broke the St. Louis’ four-game winning streak. \nIslanders 4, Blue Jackets 0: Jaroslav Halak stopped 37 shots for his 37th career shutout to lead visiting New York to its fourth straight win. Nikolay Kulemin gave the Islanders the lead late in the first period, and Thomas Hickey , Cal Clutterbuck and John Tavares all scored in the third period. \nDevils 3, Coyotes 2: Travis Zajac had a goal and two assists and set up Adam Larrson’s game-winner 43 seconds into overtime to lift host New Jersey, which won its second straight overtime game under new head coach John Hynes after opening the season 0-3-1. \nPenguins 3, Panthers 2: Evgeni Malkin scored on the power play in overtime and Sidney Crosby picked up his first goal of the season to lead host Pittsburgh. Crosby netted his first three points of the season on the first-period goal and two assists. \nStars 2, Flyers 1: Tyler Seguin and Jamie Benn each had a goal and an assist as visiting Dallas won its fourth straight. Antti Niemi made 34 saves to improve to 3-1 in four career starts against the Flyers. Niemi was in because starting goalie Kari Lehtonen is 1-10-2 in 13 games against Philadelphia. \nPredators 5, Lightning 4: Filip Forsberg scored the only goal of the shootout to help Nashville beat visiting Tampa Bay. James Neal scored twice and Mike Fisher and Shea Weber also scored for the Predators, winners of five of six. Nashville’s past two wins have come via a shootout. Steven Stamkos , Nikita Kucherov, Ryan Callahan and Erik Condra scored for the Lightning, who have dropped three of four. \nCapitals 6, Flames 2: Nicklas Backstrom scored twice and Alex Ovechkin added a goal and an assist for Washington in its first road game of the season. Andre Burakovsky, T.J. Oshie and Jason Chimera also scored, and Evgeny Kuznetsov added three assists. The goal was Ovechkin’s fourth of the season, and 900th career point. \nSharks on Thursday \nWho: Los Angeles (2-3-0) at Sharks (4-2-0) \nWhere: SAP Center", "external_links": [], "published": "2015-10-22T02:24:00.000+03:00", "crawled": "2015-10-22T02:33:41.879+03:00", "highlightTitle": ""}