{"organizations": [], "uuid": "a3b534182cbeb85ebd661efa2f26a81000e11d75", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.baltimoresun.com", "main_image": "http://www.trbimg.com/img-56247117/turbine/os-ncaa-pushes-end-marijuana-testing-20151018", "site_section": "http://www.baltimoresun.com/sports/rss2.0.xml", "section_title": "Sports - Baltimore Sun", "url": "http://www.baltimoresun.com/sports/os-ncaa-pushes-end-marijuana-testing-20151018-story.html", "country": "US", "title": "NCAA pushes to end marijuana testing, suspensions in favor of treatment", "performance_score": 0, "site": "baltimoresun.com", "participants_count": 1, "title_full": "NCAA pushes to end marijuana testing, suspensions in favor of treatment", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T22:17:00.000+03:00", "replies_count": 0, "uuid": "a3b534182cbeb85ebd661efa2f26a81000e11d75"}, "author": "Matt Murschel", "url": "http://www.baltimoresun.com/sports/os-ncaa-pushes-end-marijuana-testing-20151018-story.html", "ord_in_thread": 0, "title": "NCAA pushes to end marijuana testing, suspensions in favor of treatment", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "var ssaUrl = ('https:' == document.location.protocol ? 'https://' : 'http://') + 'pixel.sitescout.com/iap/0ea84626951144d2';new Image().src = ssaUrl;\"/> College Football NCAA pushes to end marijuana testing, suspensions in favor of treatment Football's Marijuana Culture - An Orlando Sentinel Special Report \nThe Sentinel explores the marijuana epidemic in college football. \nThe Sentinel explores the marijuana epidemic in college football. NCAA leaders say suspending athletes for positive marijuana tests hasn't reduced use of the drug \nAt first glance, there is nothing special about the white business card. \nMost likely, you'll find it in the wallets of many of the Florida Atlantic University football players. \nThe message, written in red ink, embodies a commitment between the athlete and his coach. \n‘GET OUT CARD! Coach Partridge will NOT let me do drugs or embarrass the program. If bad things are about to happen, LEAVE NOW! You/Your team are at risk.' \nOn the back it reads, ‘How to ‘Win Today:' Know where to be. Be on time! Treat people with respect. Make good decisions. NO DRUGS!!' \nFAU athletics director Patrick Chun said the cards were given out by football coach Charlie Partridge at the beginning of the season and if players ever find themselves in a situation where drugs are present, they should pull the card out and present it. Courtesy of FAU Athletics FAU football players are given business cards urging them to make sound decisions and avoid drug use. FAU football players are given business cards urging them to make sound decisions and avoid drug use. (Courtesy of FAU Athletics) \nPartridge was hired after former FAU coach Carl Pelini and one of his top assistant coaches were accused of using drugs during the football season. Pelini initially did not protest the conditions of his resignation, but he has since said during interviews with national media outlets he never used drugs. \nRegardless of Pelini's comments, Chun has made it clear FAU is taking a firm stance against substance abuse. \nThe cards are a way to create an exchange between coach and athletes about drug use. \n“We encourage our coaches on Day 1 to have open and honest dialogues with our student-athletes about using drugs,” Chun said. Courtesy of FAU Athletics FAU football players are given business cards urging them to make sound decisions and avoid drug use. FAU football players are given business cards urging them to make sound decisions and avoid drug use. (Courtesy of FAU Athletics) \n“We recognize that it's out there and we recognize that it's really out there on these college campuses, so to have this open dialogue about it and about the issues and the negative sides of using drugs is a part of our duty as athletic administrators, teachers and coaches at the end of the day.” \nWhile Chun is clear about his approach to dealing with recreational drugs like marijuana, there are varying standards for both testing and sanctions for positive tests at major football programs throughout the country. \nNCAA leaders are pushing to move away from championship-level drug suspensions they believe do not work, while some schools officials aren't as comfortable with dropping what they see as the most stringent incentive they've got to curtail marijuana use. \nMarijuana's popularity \nThe NCAA has been testing for marijuana usage for nearly three decades — since 1986 — but a culture change in our country has forced the group to take a closer look at the impact of the drug on college athletics. \nTwenty-three states and the District of Columbia have legalized marijuana usage in one form or another and four states (Alaska, Colorado, Oregon and Washington) and the District of Columbia have legalized marijuana for recreational use. \nBut despite its growing acceptance across the country, marijuana use is still illegal on college campuses, with universities forced to comply with the Drug Free Schools and Communities Act. Schools that fail to follow federal guidelines run the risk of losing government funding. \nAnd outside of alcohol, marijuana is the most popular recreational drug among college students. \nAccording to the latest NCAA research, nearly one-third of college athletes said they have used marijuana at least once in a 12-month period. \nSixteen percent of all Division I athletes and 17.4 percent of Division I football players admitted to using marijuana in a 12-month period, according to the study. \nMarijuana is among several substances on the NCAA's list of banned street drugs, along with amphetamines, cocaine and synthetic marijuana. Among these substances, marijuana (21.9 percent) was rated among the highest in usage by athletes during a 12-month period. \nAn NCAA shift \nThe NCAA does year-round drug testing, but it currently only tests for marijuana during bowl games in football and at the championship level for other Division I sports. If an athlete tests positive for marijuana, the person cannot participate in the bowl game or championship event and must sit out half of the ensuing season. \nUniversity of Oregon wide receiver Darren Carrington was among the most recent examples of athletes hindered by the NCAA testing policy, with the Associated Press, ESPN and many other media outlets reporting Carrington had to miss last season's national title game against Ohio State because he tested positive for marijuana during an NCAA drug test. \nNCAA leaders would like to eliminate testing for recreational drugs altogether, instead placing the onus on member schools to test athletes. \nIn January, the NCAA's Committee on Competitive Safeguards and Medical Aspects of Sports introduced a proposal that would change the association's approach toward recreational drugs like marijuana. Instead of testing for the sake of punishment, the NCAA would work with schools to help educate athletes about drugs, deter athletes from using drugs and identify athletes who suffer from addiction. \nMary Wilfert, the associate director of the NCAA's Sports Science Institute, said discussions on what to do with recreational drug use began several years ago, but it became more prevalent in 2012 with one main question needing to be answered: “Does it make sense for the NCAA, the national governing body, to test for recreational drug use which is not performance enhancement?” \n“In December of 2014, the committee determined that a best-practice approach would be for the NCAA to no longer test for marijuana in its championships-testing program — which is when we do test as far as the NCAA testing goes — and that it would make more sense for institutions to focus in on the deterrents and intervention at the local level,” she said. \n“In other words, an educational interventions, counseling, whatever approach made more sense on recreational drug use than a punitive approach, which is all the NCAA program does right now.” \nThat recommendation, however, did not receive enough support from the NCAA governing members, so it was sent back to the committee this past June with the hope the group could come up with more guidance on how the changes could be implemented. \n“What would be some tools and some best practices that we should be putting in place in order to effectively deter and intervene when we discover drug use?” Wilfert said, explaining school leaders' concerns. \nThe committee's members have worked to put together a toolkit — a resource or guidelines for schools in handling recreational drug use, especially marijuana — and plan to resubmit it to the member schools in December. \nWilfert said while the data shows that drug testing deters athletes from using performance-enhancing drugs, it doesn't seem to discourage them from using recreational drugs. In most cases, the issue can go deeper than occasional use in social situations. \n“We do believe if we are going to be able to effectively deter or to intervene when student-athletes are experiencing a substance-abuse problem, testing and putting them out of a sport is not effective,” she said. “When someone has a substance-abuse problem, there needs to be treatment. There needs to be intervention. \n“Telling someone to just say no doesn't work.” \nThat's why school officials requested a more in-depth plan when it comes to the committee's recommendations, according to Wilfert. \n“They want some strategy, some approach that effectively deters their student-athletes from using marijuana,” she said. \nSchool rules \nDrug policies among institutions vary from school to school. \nIn some cases, an athlete who fails multiple drug tests during a season can face punishment ranging from game suspensions or removal from the team. Sometimes policies differ dramatically among schools in the same conference. \n“Our member schools can conduct their own testing programs and that is totally independent of NCAA policy or oversight because they don't have to test. They can test for what they want, they can test for what they determine is important and they assign penalties as they see fit or whether or not it is an intervention or counseling or whatever,” Wilfert said. \nWhile the lack oversight could open the door to being lenient on star players, school leaders insist they put the welfare of the athletes ahead of the needs of the team. \n“I think it's just as much a societal issue as it is football, but obviously we want our players to play healthy and take care of their [bodies,]” Missouri coach Gary Pinkel said. “So we're all concerned about those things for obvious reasons.” \nChun, who worked at Ohio State before taking over at FAU, said coaches and athletics directors throughout the country are focused about helping players make healthy decisions. \n“I would say that the health, safety and well-being of our student-athletes are our No. 1 concern on a daily basis and ultimately setting our student-athletes up for success well beyond college is at the forefront of what we do,” Chun said. “Anything in terms of drugs, education, healthy habits — part of what we do is we're obligated to teach these kids the impact and the perils of using drugs.” \nAnd despite a growing acceptance of marijuana use, Chun believes school administrators across the country are still concerned about the short- and long-term impact on its students. \n“Regardless of what emphasis the NCAA does or doesn't want to put on it from Indianapolis, I would be surprised if a majority of athletics departments across the country aren't prioritizing drug awareness and education,” he said. \nStandardizing drug testing among institutions would be challenging, with the cost of testing being the biggest obstacle. Schools situated among the so-called Power 5 conferences — the ACC, SEC, Big 12, Big Ten and Pac-12 — have more capital to work with than schools like FAU in Conference USA. \n“You know, budgets at our level range from Louisiana-Monroe to Texas and Ohio State, so it's a full array drug of budgets. . . . Every campus has to do what is right for them,” Chun said. “I think what you'll see is the penalty side of whatever drug policy that you have on your campus is probably going to be more reflective in to how much money you can infuse into actual drug testing.” \nMost schools rely on a combination of education, testing and sanctions to comply with NCAA and federal marijuana rules. \n“Part of it is you have a coach and a coaching staff that are serious about keeping your kids in line on the matter,” UCF president John Hitt said, stressing the importance of taking the issue of marijuana use seriously. “I don't think it would be very hard [for] any university or college in the country to [have] a problem in that area or let it generate itself. I think you can mark a lot of that down to the kind of self-discipline that is taught and demanded in our program.” \nAt the end of the day, schools like FAU continue to be creative in finding ways to educate and support its athletes. \n“If you can plant one seed in one person and it impacts them making a choice whenever they're put in those situations, then we've done our jobs as administrators,” Chun said.", "external_links": [], "published": "2015-10-19T22:17:00.000+03:00", "crawled": "2015-10-21T07:45:01.849+03:00", "highlightTitle": ""}