{"organizations": ["All Blacks"], "uuid": "528b363dc534d6f55a0e8932b3897b977168dd1b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.themalaymailonline.com", "main_image": "http://www.themalaymailonline.com/uploads/articles/2015-10/nzz0310.JPG", "site_section": "http://www.themalaymailonline.com/feed/rss/sports", "section_title": "The Malay Mail Online | Sports", "url": "http://www.themalaymailonline.com/sports/article/rwc-more-questions-than-answers-for-all-blacks-after-43-10-georgia-victory", "country": "MY", "title": "RWC: More questions than answers for All Blacks after 43-10 Georgia victory", "performance_score": 0, "site": "themalaymailonline.com", "participants_count": 0, "title_full": "RWC: More questions than answers for All Blacks after 43-10 Georgia victory", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T03:22:00.000+03:00", "replies_count": 0, "uuid": "528b363dc534d6f55a0e8932b3897b977168dd1b"}, "author": "", "url": "http://www.themalaymailonline.com/sports/article/rwc-more-questions-than-answers-for-all-blacks-after-43-10-georgia-victory", "ord_in_thread": 0, "title": "RWC: More questions than answers for All Blacks after 43-10 Georgia victory", "locations": ["Georgia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Print Article \nNew Zealand's Julian Savea scores their sixth try completing his hat trick during the New Zealand v Georgia IRB Rugby World Cup 2015 Pool C game at Millennium Stadium, Cardiff, Wales. — Reuters pic CARDIFF, Oct 3 — New Zealand gave themselves many questions to answer after their academic run-out against Georgia turned into a tight battle that highlighted All Black deficiencies to potential quarter-final rivals. \nThe defending champions ran out 43-10 winners at Cardiff’s Millennium Stadium, scoring seven tries to nab a bonus point and become the first side to book their place in the last eight. \nBut the victory did not come easy for the strongest All Black side coach Steve Hansen could have lined up, featuring household names captain Richie McCaw, playmaker Dan Carter and code-swapping centre Sonny Bill Williams. \nSuch are the high standards New Zealand normally offer up, the 33-point deficit over the Georgians will surely be dissected as not sufficient. \nThere was a general lack of cutting edge and precision, an unusually high level of handling errors and a shaky scrum, while Georgia were importantly happy to dictate the rhythm of the match for large periods to better suit their abrasive, rumbling pack. \n“There’s a lot of things we could have done better, for sure. Our skill execution at times was not great,” said Hansen. \nCaptain Richie McCaw insisted there were no longer any easy games in the World Cup. \n“For a lot of the game, especially up front and defensively, we took a step up,” McCaw said. \n“If you look at the game as a whole, it’s a little bit disappointing some of the errors we made, but that’s an easy thing to fix.” \nGeorgia coach Milton Haig, a New Zealander, picked the east European nation’s most experienced side ever but one that will likely feature 10 changes for their final crunch game against Namibia next week. \nVictory in that game in Exeter would guarantee Georgia third place in Pool C — and automatic qualifying spot for the 2019 World Cup in Japan. \nGeorgian pride \nBut there was no shortage of Georgian pride on show in Cardiff, even by that raft of players who will likely play no part against Namibia. \nIn the face of a fiercely competitive Georgian scrum and a hard-hitting defence led by skipper Mamluka Gorgodze, No 8 Lasha Lomidze, and centre pairing Tamaz Mchedlidze and Davit Kacharava, New Zealand at times looked a shaken outfit. \nThe All Blacks, having already beaten closest rivals Argentina 26-16 and Namibia 58-14, dominated possession and territory. \nThey scored two tries in the first-half off set-piece ball—through Waisake Naholo off a line-out and Julian Savea off a scrum. \nBut their attack was ridden with errors, scrum-half Aaron Smith unusually failing to find his target on numerous occasions, several final passes going to ground or bypassing the intended receiver to go straight into touch and Carter even misfiring from fly-half. \nWhat will have Hansen most concerned is the struggle his team had up against a Georgian front five, tighthead prop Charlie Faumuina in particular up against it from Karlen Asieshvili. \n“The scrum was difficult, the Georgians scrummed well and they were trying to shear across and we had to keep their tighthead square and we found that difficult but finally worked our way through it,” said Hansen. \nGorgodze and his back-row teammates more than matched the Kiwi trio based around the mighty McCaw, who hobbled off with 20 minutes to play, his right thigh and calf immediately iced up. \nNew Zealand scored two late tries to put some gloss on the scoreboard. They now turn their attention to their final match against Tonga on October 9 at Newcastle’s St James’ Park where they will hope to rediscover their mojo before moving on to the quarter-finals where they will play France, Ireland or Italy. \n“I wouldn’t say the game was great, but it doesn’t have to be at the moment,” said a bullish Hansen. \n“You don’t get any gold medals for winning these games, you get to qualify and we did that tonight and we’re in a position to say we’re in the quarter-finals and that’s quite exciting.” \nMcCaw paid a final credit to Georgia, saying: “They played the game like you expect and it was tough physically. \n“The teams have been a lot better than they have been in previous World Cups.” — AFP", "external_links": [], "published": "2015-10-03T03:22:00.000+03:00", "crawled": "2015-10-03T03:28:36.461+03:00", "highlightTitle": ""}