{"organizations": [], "uuid": "6bf337420cd9fa4dd34ca0a66da819c2b3df7f63", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wcax.com", "main_image": "", "site_section": "http://www.wcax.com/category/13571/political-news", "section_title": "Political News - WCAX.COM Local Vermont News, Weather and Sports-", "url": "http://www.wcax.com/story/30248435/aclu-sues-psychologists-over-cia-interrogation-tactics", "country": "US", "title": "ACLU sues psychologists over CIA interrogation tactics", "performance_score": 0, "site": "wcax.com", "participants_count": 1, "title_full": "ACLU sues psychologists over CIA interrogation tactics - WCAX.COM Local Vermont News, Weather and Sports-", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "6bf337420cd9fa4dd34ca0a66da819c2b3df7f63"}, "author": "wcax.com", "url": "http://www.wcax.com/story/30248435/aclu-sues-psychologists-over-cia-interrogation-tactics", "ord_in_thread": 0, "title": "ACLU sues psychologists over CIA interrogation tactics", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By ERIC TUCKER\nAssociated Press WASHINGTON (AP) - The American Civil Liberties Union on Tuesday sued two former Air Force psychologists who designed a CIA program that used harsh interrogation techniques to elicit intelligence from suspected terrorists, saying the pair endorsed and taught torture tactics under the guise of science.\nThe lawsuit comes 10 months after the release of a damning Senate report that said the interrogation techniques had inflicted pain on al-Qaida prisoners far beyond the legal limits and did not yield lifesaving intelligence.\nThe suit accuses the psychologists, James E. Mitchell and John \"Bruce\" Jessen, of developing an interrogation program that relied on beatings, sleep deprivation, starvation, waterboarding and other methods that caused physical and psychological suffering on prisoners in CIA custody.\nHenry Schuelke III, a lawyer who has represented the pair in the past, said Tuesday that he was not yet involved in the case and did not have any comment.\nThe suit was filed in federal court in Washington state on behalf of three former CIA prisoners. One, Gul Rahman, was interrogated in a dungeon-like Afghanistan prison called the Salt Pit, subjected to isolation, darkness and extreme cold water, and was later found dead of hypothermia. The other two, Suleiman Abdullah Salim and Mohamed Ahmed Ben Soud, were held in CIA prisons but were never charged with any crimes and are now free.\nThe lawsuit was brought under the Alien Tort Statute, which allows noncitizens to sue in U.S. courts over human-rights violations. A 2010 Associated Press report, citing former U.S. officials, said the CIA had promised to cover at least $5 million in legal fees for the psychologists if the program ran into trouble.\n\"They claimed that their program was scientifically based, safe and proven, when in fact it was none of those things. The program was unlawful and its methods barbaric,\" Steven Watt, a senior staff attorney with the ACLU Human Rights Program, said in a statement.\nThe suit repeats many of the allegations from an exhaustive Senate investigation issued last year that identified sweeping flaws in the CIA's approach to interrogations.\nThe complaint alleges that the psychologists, despite having no expertise in al-Qaida, devised a program for the CIA that drew from 1960s experiments involving dogs and the theory of \"learned helplessness.\" The two spent years training military officials to resist interrogations and had subjected U.S. troops in training sessions to harsh techniques, but had no experience as interrogators themselves, according to the Senate report.\nIn making their case to the CIA, the psychologists argued that just as abused dogs will ultimately become passive and compliant, humans subject to \"uncontrollable pain\" would \"become helpless and unable to resist an interrogator's demand for information,\" the lawsuit contends.\nThe pair, who worked as independent contractors for the CIA, formed a company that was ultimately paid $81 million and, as of April 2007, directly employed 11 of the 13 interrogators employed by the agency, according to the complaint.\nThe ACLU also says the men themselves were involved in some of the interrogations, including of Abu Zubaydah, a captured al-Qaida operative who was waterboarded dozens of times.\nThe Justice Department approved the use of harsh interrogation methods proposed by the CIA in legal memos that were subsequently withdrawn and discredited. The CIA also says it hasn't utilized waterboarding in years.\nFollowing release of the Senate report last year, Mitchell told AP that he could not confirm his involvement with the CIA because of a secrecy agreement. But he challenged the conclusion that the interrogation tactics did not produce otherwise unobtainable intelligence.\n\"I completely understand why the human rights organizations in the United States are upset by the Senate report,\" Mitchell said then. \"I would be upset by it too, if it were true.\"\n\"What they are asking you to believe is that multiple directors of the CIA and analysts who made their living for years doing this lied to the federal government, or were too stupid to know that the intelligence they were getting wasn't useful.\"\nCIA officials grew concerned by 2003 that the psychologists had a potential financial and ethical conflict of interest since they were being paid both to design interrogation techniques and assess their effectiveness, the lawsuit says. In its response to the Senate report, the CIA acknowledged that the conflict \"raised concern and prompted deliberation.\" But it also defended hiring the two men.\n\"We believe their expertise was so unique that we would have been derelict had we not sought them out when it became clear that CIA would be heading into the uncharted territory of the program,\" the agency said.\n____\nFollow Eric Tucker on Twitter at http://www.twitter.com/etuckerAP\n ", "external_links": ["http://www.twitter.com/etuckerAP"], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-16T06:46:08.056+03:00", "highlightTitle": ""}