{"organizations": [], "uuid": "e3522f39cb127f61ddad7c0cf908e8fe06d4bd9d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.themaneater.com", "main_image": "", "site_section": "http://www.themaneater.com/feeds/sections/sports/", "section_title": "The Maneater: Sports", "url": "http://www.themaneater.com/stories/2015/10/20/missouri-scores-three-senior-day-beat-tennessee-3-/", "country": "US", "title": "Missouri scores three on Senior Day to beat Tennessee, 3-1", "performance_score": 0, "site": "themaneater.com", "participants_count": 1, "title_full": "Missouri scores three on Senior Day to beat Tennessee, 3-1", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T08:00:00.000+03:00", "replies_count": 0, "uuid": "e3522f39cb127f61ddad7c0cf908e8fe06d4bd9d"}, "author": "Tyler Kraft", "url": "http://www.themaneater.com/stories/2015/10/20/missouri-scores-three-senior-day-beat-tennessee-3-/", "ord_in_thread": 0, "title": "Missouri scores three on Senior Day to beat Tennessee, 3-1", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Google+ \nThe Missouri seniors could not have asked for more on Senior Day as the Tigers faced off against the Tennessee Volunteers on Sunday at Audrey J. Walton Soccer Stadium. \nFive seniors as well as one student manager were honored before the match that ended in a 3-1 Missouri victory. \n“(I was) definitely trying to block it all out,” senior defender Candace Johnson said. “I still am because I feel like if I let loose I’m going to become a blubbering mess.” \nThe game started off quickly as senior midfielder Reagan Russell collected the ball at the top of the 18-yard box. She then dribbled to her left and fired a shot into the roof of the net to put the Tigers up 1-0 in the sixth minute. \nThe game then took a drastic turn in the 38th minute of the first half as Tennessee’s Gabby Santorio was given a red card for running into the referee, leaving the Volunteers with only 10 players for the remainder of the match. \nMissouri capitalized on Tennessee’s weakness as the Tigers scored a beautiful goal in the 40th minute. \nSophomore forward Allie Hess controlled a throw in and then headed it into the path of oncoming junior forward Jessica Herrman, who slid and fired the ball into the upper right corner of the goal from six yards out, putting Missouri up 2-0. \n“It was great,” coach Bryan Blitz said. “They’re all pretty to me as long as we’re winning and scoring goals but certainly that had a little bit of style.” \nThe shorthanded Volunteers would answer in the 49th minute on a goalkeeping blunder by Missouri junior Kristen Rivers. \nRivers charged out to meet the ball, but was beaten to it by Tennessee junior forward Amy Neal. Neal dribbled past Rivers and then scored an easy goal into the open Missouri net to bring the score to 2-1. \nChances mounted for both teams, but the Tigers were able to clinch the victory when they were given a penalty kick in the 76th minute. \nSophomore forward Jessica Johnson was taken down inside of the 18-yard box as she raced after a through ball from junior midfielder Lauren Selaiden. Johnson then calmly stepped up and Fired the penalty kick into the lower left corner of the net to seal the Missouri victory at 3-1. \n“It felt great,” Johnson said. “It definitely felt great to sink it, I was really excited.” \nAfter the final whistle blew, the seniors were elated as they walked off the field. \n“It was awesome,” Russell said. “It was great because we had a Senior Day curse for a little while there. I don’t think we won for like, four or five senior days so it was awesome to get that win.” \nWith the win, Missouri is now tied for first place in the Southeastern Conference with Florida and South Carolina. With only three games left in the regular season, the Tigers hope to finish strong. \n“Before the game, we did talk about how close we are to our goal of winning SECs and getting to the tournament so I think that helped motivate us for today,” Johnson said. “During the game we try not to think about it and take advantage of our opportunities because we don’t want to regret anything later.” \nMissouri will travel to Alabama on Friday to take on the Crimson Tide at 7 p.m. The match will be broadcast on Watch ESPN. \nMissouri’s final home game and final game of the season is scheduled for Oct. 29 at 8 p.m., when the Tigers will take on Texas A&M at Walton Stadium. The match will also be broadcasted on the SEC Network.", "external_links": [], "published": "2015-10-20T08:00:00.000+03:00", "crawled": "2015-10-20T18:59:24.886+03:00", "highlightTitle": ""}