{"organizations": [], "uuid": "16480a28b5d6569d335f920e7ba27ca71899b38d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/2/8/161707/World/Region/Several-Yemeni-fishermen-killed-in-Saudiled-strike.aspx", "country": "EG", "title": "Several Yemeni fishermen killed in Saudi-led strikes: Witnesses - Region - World", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Several Yemeni fishermen killed in Saudi-led strikes: Witnesses - Region - World - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T03:00:00.000+03:00", "replies_count": 0, "uuid": "16480a28b5d6569d335f920e7ba27ca71899b38d"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/2/8/161707/World/Region/Several-Yemeni-fishermen-killed-in-Saudiled-strike.aspx", "ord_in_thread": 0, "title": "Several Yemeni fishermen killed in Saudi-led strikes: Witnesses - Region - World", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related UN envoy says warring parties in Yemen agree to talks Qaeda makes Aden inroads under cover of Yemen conflict Rockets kill at least 22 civilians in Yemen's Taez: Medics US reconnaissance drone crashes in Yemen: Locals At least 40 people were killed, including several fishermen, when Saudi-led coalition strikes hit two Yemeni islands on the Red Sea overnight, several locals said on Saturday.\nSaudi Arabia has been leading an Arab military intervention since March to try to restore Yemen's President Abd-Rabbu Mansour Hadi and his government, forced into exile by an advance of Houthi fighters allied to Iran. The Houthis are also backed by forces loyal to former president Ali Abdullah Saleh.\nThe coalition has gained ground in the south, and Hadi's government is now based in the southern Yemeni port of Aden, but Houthi forces remain in control of much of the country despite the almost daily air strikes.\nLocal fishermen told Reuters that coalition helicopters and warships targeted several military locations belonging to the Houthis and forces loyal to Saleh on Aqban and Kadman islands on Friday night. The strikes killed several fishermen who live on the islands and destroyed several fishing boats, they said.\nReuters could not independently confirm this account and a spokesman for the Saudi-led coalition forces could not immediately be reached for comment.\nOn Thursday, a resident in the northern province of Hajjah said coalition planes had bombed a small island in the Red Sea close to the port of Midi, killing 10 fishermen.\nAir strikes by the Arab coalition have struck civilian targets at least four times in recent weeks, including a wedding party on Sept. 28 that killed 131 people.\nAt least 5,400 people have been killed since the war began in March.", "external_links": [], "published": "2015-10-24T03:00:00.000+03:00", "crawled": "2015-10-24T14:02:58.746+03:00", "highlightTitle": ""}