{"organizations": [], "uuid": "4a0baab09a4a2b57b6434f3cd47037efbad6fd34", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wgem.com", "main_image": "http://WGEM.images.worldnow.com/images/9096491_G.jpg", "site_section": "http://www.wgem.com/category/123718/sports?&clienttype=rss", "section_title": "WGEM - SPORTS", "url": "http://www.wgem.com/story/30346099/2015/10/25/national-champion-softball-coach-holds-clinic-in-gem-city", "country": "US", "title": "National champion softball coach holds clinic in Gem City", "performance_score": 0, "site": "wgem.com", "participants_count": 0, "title_full": "National champion softball coach holds clinic in Gem City", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T05:38:00.000+02:00", "replies_count": 0, "uuid": "4a0baab09a4a2b57b6434f3cd47037efbad6fd34"}, "author": "", "url": "http://www.wgem.com/story/30346099/2015/10/25/national-champion-softball-coach-holds-clinic-in-gem-city", "ord_in_thread": 0, "title": "National champion softball coach holds clinic in Gem City", "locations": ["Ill.", "Gem City", "QUINCY"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "National champion softball coach holds clinic in Gem City Posted: QUINCY, Ill. (WGEM) - \nDuring her time as a softball coach at Illinois State and Fresno State, Margie Wright won 1,386 games and a national championship in 1998. Sunday, she was at Quincy Notre Dame High School holding a clinic for local softball players hoping to improve their game.\"I'm trying to spread the message to make this the love of your life,\" said Wright. \"Make softball something you love and want to do all the time. I'm trying to spread that it takes a lot of hard work.\" When Wright retired from coaching in 2012, she held the record for most wins by a softball coach in NCAA Division I history and still holds that title. Sunday, more than 100 softball players listened to Wright as they tried to gain any advantage they could. \"She came up tome within two pitches and already found out something I was doing wrong,\" said Highland senior pitcher Dana Flanagan. \"She's already changed me and it was awesome. I mean, she noticed something I've been doing for years that I didn't even know.\" For the athletes still searching for an offer and a scholarship to play at the collegiate level, Wright had a special message. \"If you want to keep playing at a higher level, pretty soon you're going to find out that the commitment changes,\" she said. \"The commitment gets much bigger. I want them to understand that.\" The head coach of the Lady Raiders U-14 softball team, Lori Vogel, played for Wright as a freshman at Illinois State and organized the event that brought her former coach to the Gem City.\"(The players) have a lot of questions, said Vogel.\" \"What is it like to play in college? What is it like to travel and balance homework. We're also not able to help them with the skills on the field but off the field.\" The clinic also helped the local softball community is another way. All the money raised during the clinic will go towards the Lady Raiders U-14 softball team. ? Latest Illinois sports Rookie Todd Gurley rushed for 128 yards and his first two touchdowns, helping the St. Louis Rams put away the punchless Cleveland Browns 24-6 on Sunday. More >> Rookie Todd Gurley rushed for 128 yards and his first two touchdowns, helping the St. Louis Rams put away the punchless Cleveland Browns 24-6 on Sunday. More >> Red Bulls beat Fire 2-1, win Supporters' Shield Sacha Kljestan had a goal and an assist and the New York Red Bulls won the Supporters' Shield as Major League Soccer's regular-season champion with a 2-1 victory over the Chicago Fire on Sunday night. More >> Sacha Kljestan had a goal and an assist and the New York Red Bulls won the Supporters' Shield as Major League Soccer's regular-season champion with a 2-1 victory over the Chicago Fire on Sunday night. More >> LeBron practices for first time since back injection LeBron James has gone through a full practice for the first time since he received an anti-inflammatory injection in his back. More >> LeBron James has gone through a full practice for the first time since he received an anti-inflammatory injection in his back. More >> Toews' goal in OT gives Blackhawks 1-0 win over Lightning Jonathan Toews scored his first goal of the season 17 seconds into overtime to give the Chicago Blackhawks a 1-0 victory over the Tampa Bay Lightning on Saturday night in a rematch of last June's Stanley Cup... More >> Jonathan Toews scored his first goal of the season 17 seconds into overtime to give the Chicago Blackhawks a 1-0 victory over the Tampa Bay Lightning on Saturday night in a rematch of last June's Stanley Cup Final. More >> Southern Illinois beats Youngstown State in overtime, 38-31 Mark Iannotti threw for 275 yards with three touchdown passes - including the game-winner in overtime - to help Southern Illinois beat Youngstown State 38-31 on Saturday. More >> Mark Iannotti threw for 275 yards with three touchdown passes - including the game-winner in overtime - to help Southern Illinois beat Youngstown State 38-31 on Saturday. More >> Hare leads Northern Illinois past Eastern Michigan, 49-21 Drew Hare threw four touchdown passes and Joel Bouagnon rushed for 136 yards and a score to help Northern Illinois beat Eastern Michigan 49-21 on Saturday. More >> Drew Hare threw four touchdown passes and Joel Bouagnon rushed for 136 yards and a score to help Northern Illinois beat Eastern Michigan 49-21 on Saturday. More >> Illinois St. uses ground game to beat Western Illinois 48-28 Marshaun Coprich ran for 206 yards and two scores as Illinois State defeated Western Illinois 48-28 on Saturday. More >> Marshaun Coprich ran for 206 yards and two scores as Illinois State defeated Western Illinois 48-28 on Saturday. More >> Houston steps in to lead Badgers past Illinois, 24-13 Bart Houston came off the bench to throw for 232 yards and two touchdowns, and Wisconsin beat Illinois 24-13 on Saturday. More >> Bart Houston came off the bench to throw for 232 yards and two touchdowns, and Wisconsin beat Illinois 24-13 on Saturday. More >>", "external_links": [], "published": "2015-10-26T05:38:00.000+02:00", "crawled": "2015-10-26T15:20:59.619+02:00", "highlightTitle": ""}