{"organizations": [], "uuid": "8a7ef021759e0c26bff2bb54d47616988b7959ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nytimes.com", "main_image": "http://static01.nyt.com/images/2015/10/07/sports/07NCAAFOODweb/07NCAAFOODweb-facebookJumbo.jpg", "site_section": "http://www.nytimes.com/services/xml/rss/nyt/Sports.xml", "section_title": "NYT &gt; Sports", "url": "http://www.nytimes.com/2015/10/07/sports/ncaafootball/next-arms-race-in-major-sports-is-at-the-food-table.html", "country": "US", "title": "Next Arms Race in Major Sports Is at the Food Table", "performance_score": 2, "site": "nytimes.com", "participants_count": 1, "title_full": "Next Arms Race in Major Sports Is at the Food Table - The New York Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T00:36:00.000+03:00", "replies_count": 0, "uuid": "8a7ef021759e0c26bff2bb54d47616988b7959ad"}, "author": "Zach Schonbrun", "url": "http://www.nytimes.com/2015/10/07/sports/ncaafootball/next-arms-race-in-major-sports-is-at-the-food-table.html", "ord_in_thread": 0, "title": "Next Arms Race in Major Sports Is at the Food Table", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " For nearly a decade, the sports dietitian Sarah Wick ran a one-woman operation at Ohio State. She oversaw the eating habits of 1,000 athletes, most of whom paid little attention to her efforts.\n“My first years were just knocking on coaches’ doors, asking if I could do a prevent presentation,” said Wick, who joined the Ohio State staff in 2003. “It had nothing to do with what we’re serving them.”\nToday, she leads a full sports nutrition department that includes four registered dietitians , interns, a logo and a food budget of more than $1.5 million, an increase that is more than double what Ohio State paid to feed its athletes only a year ago.\n On College Football: Stanford Rolls to the Rhythms of David Shaw OCT. 4, 2015 Campus Corner: Boise State’s Broncos Are Fast, but Only One Is Hoofed OCT. 3, 2015 For U.A.B. Football Diaspora, a Second Wind OCT. 1, 2015 The massive increase is consistent with programs across the Big 5 conferences this year, according to a survey released last week by the Collegiate and Professional Sports Dietitians Association. The survey of about two dozen top programs found that average spending increased 145 percent — to $1.3 million from about $534,000 — just since Aug. 1, 2014, which is when the N.C.A.A. lifted its limitations on meals and snacks for Division I athletes, allowing colleges to provide as much food and beverages to their players as they want.\nContinue reading the main story Sports Newsletter Get the big sports news, highlights and analysis from Times journalists, with distinctive takes on games and some behind-the-scenes surprises, delivered to your inbox every week.\nA result has been a veritable arms race in college kitchens: money pouring into projects like new athletic cafeterias; the hiring of chefs and full-time dietitians; and the introduction of separate kitchens stocked with fresh food in practice facilities and stadiums. One university, the report said, went from a food budget of $50,000 in the 2013-14 academic year to $1.2 million a year later. Another college doubled its budget to $2.8 million.\nSports dietitians said the focus on athletes’ diets was long overdue, but the new spending also has raised concerns about increasing the rich-poor divide in college sports, where athletic departments in the country’s five wealthiest conferences — which receive most of the television money and other revenue — splurge while the rest of the nation’s colleges increasingly tighten their belts.\nThe survey by the dietitians association represented a small sample size: The respondents made up only 7 percent of Division I universities, and all were members of the so-called Big 5, the nation’s five wealthiest conferences. But the increase in spending has outpaced what some analysts and administrators expected, and it has happened at a dizzying rate. Eleven of the 23 programs surveyed have budgeted at least $1.5 million this year on food costs alone, when the previous high for any university was $1.3 million, according to figures provided by the dietitians association.\nAt Ohio State, officials wasted no time last summer constructing what it called athlete “fuel zones” at two training facilities; each was fully supplied with fresh sandwiches, chips, fruits, yogurts and hummus for athletes to consume before and after practice. A third setup is on its way.\nWith a $145 million budget, according to revenue figures compiled by USA Today, Ohio State can afford to spend what it wants. And with the N.C.A.A. no longer regulating who can receive free meals, or what and how much schools can provide, there is little deterrent.\nAdvertisement\nContinue reading the main story Advertisement\nContinue reading the main story “This is what we, as sports dietitians, have been wanting for a long time,” Wick said. “I think most of the universities are realizing the importance of nutrition and hydration for athletes.”\n“It’s always been bananas and recovery shakes,” said Auburn’s Scott Sehnert, the dietitians association president, referring to what programs could offer at training tables, the meals that were allowed to be offered once daily alongside a practice or game. “But a year ago, for the most part, the floodgates were opened.”\nThe 1991 decision by the N.C.A.A. to limit meals to one training table per day was intended to ensure competitive balance among its members. But at the 2014 Final Four, Connecticut guard Shabazz Napier revealed to reporters that he often went to bed hungry because of limits on the amount of food UConn could provide.\nContinue reading the main story OPEN Graphic Graphic: 2015 Heisman Trophy Watch The comments drew sharp rebukes from fans and analysts, who deemed the restrictions unethical, and days later the N.C.A.A. voted to lift them. According to Dave Ellis, a past president of the dietitians association and a consultant to several athletic programs, the massive increases in spending in the past year simply represent what it costs to provide adequate fueling to the athletes in large athletic programs.\n“It costs money to feed,” he said.\nThe survey figures were more alarming for administrators in smaller programs or smaller conferences, however, where money is tighter. Tina Kunzer-Murphy, the athletic director at Nevada-Las Vegas, a program that has struggled financially, sounded stunned when she was read the numbers provided by the dietitians’ study. There are plans for better nutritional facilities at U.N.L.V., she said, but a 145 percent jump overnight was out of the question.\n“It’s significant; it’s something we think is important,” Kunzer-Murphy said of her department’s planned increases. “But it’s not anywhere near what I saw on that list.”\nStacey Brook, a sports economist at Iowa, said that he expected most Division I colleges to try to compete with the expansive grocery lists of the top programs because that was the nature of college athletics. But he said he would advise them not to bother.\n“The reality,” Brook said, “is they’re losing out in many cases already.”\nEllis said he believed that finding resources to finance food provisions should not be difficult. Donors will want to give to programs if they think athletes are going hungry, he predicted.\n“Everybody can build a 24-7 fueling station and get that funded,” Ellis said. “There’s no reason you can’t.”\nBut not everybody can, for example, do what Auburn has done just in the last year: add three full-time registered dietitians; open a $6.6 million wellness kitchen ; and add such amenities as a Greek yogurt bar with 12 topping choices to the fueling stations.\nA result was not surprising. “We’ve probably ended up spending more than we first anticipated,” Sehnert said.\nLoading... Go to Home Page »\nSite Index The New York Times News World U.S. Politics N.Y. Business Tech Science Health Sports Education Obituaries Today's Paper Corrections Opinion Today's Opinion Op-Ed Columnists Editorials Contributing Writers Op-Ed Contributors Opinionator Letters Sunday Review Taking Note Room for Debate Public Editor Video: Opinion Arts Today's Arts Art & Design ArtsBeat Books Dance Movies Music N.Y.C. Events Guide Television Theater Video Games Video: Arts Living Automobiles Crossword Food Education Fashion & Style Health Jobs Magazine N.Y.C. Events Guide Real Estate T Magazine Travel Weddings & Celebrations Listings & More Classifieds Tools & Services Times Topics Public Editor N.Y.C. Events Guide TV Listings Blogs Cartoons Multimedia Photography Video NYT Store Times Journeys Subscribe Manage My Account Subscribe Subscribe Times Insider Home Delivery Digital Subscriptions NYT Opinion Crossword Email Newsletters Alerts Gift Subscriptions Corporate Subscriptions Education Rate Mobile Applications Replica Edition International New York Times", "external_links": ["http://www.auburn.edu/administration/auxiliary_services/dining/WellnessKitchen.php", "http://static01.nyt.com/images/2014/09/05/sports/ncaafootball/heisman-watch-1409953614405/heisman-watch-1409953614405-master180.jpg", "http://static01.nyt.com/images/2015/10/02/sports/02UABweb1/02UABweb1-thumbStandard.jpg", "http://www.cnn.com/2014/04/07/us/ncaa-basketball-finals-shabazz-napier-hungry/", "http://a1.nyt.com/assets/article/20151005-135251/images/foundation/logos/", "http://static01.nyt.com/images/2015/10/04/sports/DOG-campus/DOG-campus-thumbStandard.jpg", "http://static01.nyt.com/images/2015/10/05/sports/05TRACY/05TRACY-thumbStandard.jpg", "http://sportsmedicine.osu.edu/ourteam/sports_nutrition/index.cfm"], "published": "2015-10-07T00:36:00.000+03:00", "crawled": "2015-10-07T00:17:08.772+03:00", "highlightTitle": ""}