{"organizations": [], "uuid": "a71ec928d840358d863393314e4b044aa529c6e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "", "site_section": "http://bostonherald.com/sports/college", "section_title": "Sports: College | Boston Herald", "url": "http://bostonherald.com/sports/college/college_football/2015/10/harvard_football_team_on_point", "country": "US", "title": "Harvard football team on point", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "Harvard football team on point | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "a71ec928d840358d863393314e4b044aa529c6e3"}, "author": "John Connolly", "url": "http://bostonherald.com/sports/college/college_football/2015/10/harvard_football_team_on_point", "ord_in_thread": 0, "title": "Harvard football team on point", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "It is nice to be smart. It is better to be creative.\nThrough four games, the inventive and innovative Harvard offense has amassed 179 points — 44.8 per game, tops among the Ivies and the most by a Crimson team to this point in a season since 1892. Winners of 18 straight, the second-longest run in the nation to Ohio State’s 19, Harvard (4-0, 2-0) is at Lafayette (1-5) at 3:30 p.m. next Saturday.\nThe Crimson pummeled host Cornell (0-4, 0-2) 40-3 on Saturday. Lafayette lost 38-7 to Georgetown, whom Harvard demolished 45-0 just 10 days ago.\nLest one think coach Tim Murphy — who installed a no-huddle, hurry-up offense two decades ago — is simply pass happy, Harvard is second in the Ancient Eight in rushing at 201.8 yards per game. Ten of the Crimson’s 14 red-zone touchdowns have come on the ground.\n“I don’t know if it’s creativity. I think maybe it’s that we have good players and good players across the board,” said offensive coordinator Joel Lamb, a former Harvard quarterback. “It starts with the offensive line, the receivers and tight ends. We feel our personnel allows us to quite a lot. A lot of it, quite honestly, is execution, too. We have experience and I think it helps when you have kids running the plays over and over again. Also, I would credit our defense. They have been giving us great field position which gives you a lot of opportunities.”\nLed by senior quarterback Scott Hosch, the passing game ranks fourth in the Ivy in passing yards per game with 274.0, leads with 9.1 yards per completion, and shares top honors with Dartmouth for touchdowns (10).\n“I love playing in the spread offense that we have here. It’s one of big things for me coming out of high school,” said Hosch. “Coach Murphy and coach Lamb do a great job drawing up schemes. Another thing is the people we have. We have a lot of people who can make plays. At receiver we have four receivers who are very competitive. We have two great tight ends, maybe NFL-type guys. Our offensive line performs well and our running backs are great.”\nMinute moments\nThere were a few bright spots in UMass’ 62-38 drubbing at Bowling Green.\nSenior Tajae Sharpe brought in 159 yards of receptions, his eighth-career 100-yard game and 40th straight with at least one catch. Tight end Rodney Mills also reached 100 receiving yards, the second such game of his season and career.\nBlake Frohnapfel posted his fourth career 400-yard passing game with 409, while James Oliphant’s 97-yard kickoff return for a touchdown in the third quarter tied for seventh-longest in the program’s history.\nAround the region\nNifty game turned in by Brown junior receiver Alexander Jette of North Attleboro, who nabbed 16 receptions for 216 yards in the Bears’ 25-24 win at Holy Cross . Senior quarterback Marcus Fuller connected on 33-of-50 passes for 412 yards while senior kicker Grant Senne boomed three field goals, including the 35-yard game-winner with 2:06 to play. . . .\nSometimes a balanced offense alone is not the answer. Take UM ass-Dartmouth, which featured a neatly packaged 168 passing yards and 167 rushing yards only to fall, 34-13 at home to Bridgewater State . The victorious Bears drew three touchdown runs from freshman back Alex McLaughlin of Littleton. . . .\nSophomore running back Cameron Nash accounted for 296 of Central Connecticut State ’s 553 total offensive yards to spark a 35-33 upset of visiting Bryant . Nash posted 90 yards rushing, 104 yards receiving — including an 84-yard TD catch — and 102 yards on kickoff returns.", "external_links": [], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-12T07:28:16.042+03:00", "highlightTitle": ""}