{"organizations": [], "uuid": "11b64716aeda732a62706ff8e1a244b61358f4a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wcax.com", "main_image": "", "site_section": "http://www.wcax.com/category/13530/national-news", "section_title": "National News - WCAX.COM Local Vermont News, Weather and Sports-", "url": "http://www.wcax.com/story/30150487/mom-accused-of-tossing-newborn-girl-had-baby-son-die-in-2008", "country": "US", "title": "Mom accused of tossing newborn girl had baby son die in 2008", "performance_score": 0, "site": "wcax.com", "participants_count": 1, "title_full": "Mom accused of tossing newborn girl had baby son die in 2008 - WCAX.COM Local Vermont News, Weather and Sports-", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "11b64716aeda732a62706ff8e1a244b61358f4a7"}, "author": "wcax.com", "url": "http://www.wcax.com/story/30150487/mom-accused-of-tossing-newborn-girl-had-baby-son-die-in-2008", "ord_in_thread": 0, "title": "Mom accused of tossing newborn girl had baby son die in 2008", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By MICHAEL BALSAMO\nAssociated Press NEW YORK (AP) - A woman charged this week with tossing her newborn daughter to her death from a seventh-story window had an infant son die seven years ago, and prosecutors have now reopened their investigation into his death, authorities said Wednesday.\nThe 2 1/2-week-old boy was found dead in the basement of Jennifer Berry's home in 2008. A medical examiner ruled he died of natural causes related to sudden infant death syndrome.\nBut prosecutors in Westchester County decided to reopen their probe into the boy's death after Berry was charged Tuesday in the Bronx with tossing her baby daughter from the window of her boyfriend's apartment.\n\"In light of what has transpired, we will be reviewing that death again,\" said Lucian Chalfen, a spokesman for Westchester County District Attorney Janet DiFiore.\nIn her most recent pregnancy, Berry's family and friends didn't even know she was expecting, authorities said. She told them she had miscarried, police said.\nThe 33-year-old from Yonkers was charged with murder and manslaughter in the girl's death Monday.\nWhen police showed up at the Bronx apartment building in the quiet, residential neighborhood of University Heights on Monday afternoon, they found the girl's body in a garbage-filled alley behind the building.\nBerry was questioned for hours by detectives and initially denied she was pregnant before saying she had given birth in the shower, authorities said. She claimed the newborn wasn't breathing when she threw the baby - and the placenta - from the window, police said.\nBut prosecutors say she knew the baby was alive when she threw her, umbilical cord still attached, into the alley below. The medical examiner said the baby died from blunt force trauma in the fall, meaning she was born alive.\nThe city's Administration for Children's Services is investigating the circumstances that led to the baby's death.\nBerry briefly worked for the child welfare agency from July 2007 until January 2008. The first three months were in classroom-style training to become a child protective specialist, who would investigate reports of child abuse and refer parents to classes on how to raise their children. The rest of Berry's time at the city agency was spent as a trainee, where she had limited interaction with families. She was fired from her job after she stopped showing up for work.\nBerry appeared in court late Tuesday and pleaded not guilty to the felony charges. Her attorney didn't immediately respond to a message seeking comment.\nAssistant District Attorney Georgia Barker said the baby weighed 8 pounds - the weight of a full-term newborn.\n\"There was air in the lungs. This was a healthy baby girl,\" Barker said in court, according to the Daily News of New York.\nBerry's boyfriend told police he was in another room when the baby was born. He told investigators he didn't realize that his girlfriend had given birth, that the baby had plunged from the window or even that his girlfriend was expecting.\nAs authorities continued their investigation, neighbors passed crime scene tape that was still tied to banisters in the seven-floor apartment building, and others left small keepsakes in a makeshift memorial in the lobby.\n\"Why did she do this? I'll just never understand,\" said Lourdes Ayala, who lives down the road. \"It tugs at your heart as a mother. I just couldn't believe it. There are just no words to describe how horrible it was.\"\nA cardboard box that held a small teddy bear, flowers and a bottle had a handwritten note that read: \"Came into this life unknown, not knowing what would happen to me, I didn't have a chance. May her soul rest in peace with God.\"\nNew York law allows parents to anonymously give up a child by leaving a baby - up to 30 days old - at a safe place without fear of prosecution. The state's Abandoned Infant Protection Act protects parents from being prosecuted as long as the child is dropped at a hospital, police station or fire station and the parent notifies someone of the infant's location.\n___\nAssociated Press writers Colleen Long and Jake Pearson contributed to this report.\n ", "external_links": [], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-10-02T23:21:00.802+03:00", "highlightTitle": ""}