{"organizations": [], "uuid": "0be75a725f61623394270546121d754123f7762f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/49515636.cms", "site_section": "http://timesofindia.indiatimes.com/sports/articlelist/3055865.cms", "section_title": "Interviews - Tennis - Sports - The Times of India", "url": "http://timesofindia.indiatimes.com/india/Kejriwal-visits-turmoil-hit-Punjab-condemns-sacrilege-acts/articleshow/49515557.cms", "country": "IL", "title": "Kejriwal visits turmoil-hit Punjab, condemns sacrilege acts", "performance_score": 0, "site": "indiatimes.com", "participants_count": 6, "title_full": "Kejriwal visits turmoil-hit Punjab, condemns sacrilege acts - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T21:06:00.000+03:00", "replies_count": 5, "uuid": "0be75a725f61623394270546121d754123f7762f"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/india/Kejriwal-visits-turmoil-hit-Punjab-condemns-sacrilege-acts/articleshow/49515557.cms", "ord_in_thread": 0, "title": "Kejriwal visits turmoil-hit Punjab, condemns sacrilege acts", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "AMRITSAR: Terming as painful the alleged incidents of desecration of holy books, Delhi chief minister Arvind Kejriwal on Saturday said it was a \"willful act\" to disturb Punjab as he prayed at the Golden Temple here for \"return of peace\" in the state.\nIt \"is unfortunate and painful. It seems it is a willful act by somebody who wanted to disturb peace in the state,\" Kejriwal told reporters here after he arrived on his first visit to Punjab since becoming the chief minister in February and was set to meet families of two Sikhs killed in police firing during anti-desecration protests at Faridkot.\nThe AAP leader condemned the police action, saying it was wrong to use force against people who were protesting peacefully against acts of sacrilege.\nKejriwal said it was the responsibility of Punjab government to arrest the real culprits behind the incidents of desecration of holy books, saying no innocent person should be slapped with \"false cases\".\nHe refused to answer more queries, saying he was here to pray for peace in Punjab.\n\"Golden Temple has great spiritual power and I prayed before the Almighty for early peace and normalcy to get rid of current turmoil in Punjab,\" he said after paying obeisance at the Sikh shrine.\nHis visit to Punjab assumes significance as AAP is eying the 2017 Assembly polls and has re-structured its unit in the state, where it won its four seats in the last Lok Sabaha elections. The fledgling AAP recently suspended two of the MPs for \"anti-party\" activities.\nWhile paying obeisance at the Sanctum Sanctorum of the Golden Temple, Kejriwal preferred to go inside along with other devotees, ignoring the VIP passage.\nThereafter, he also paid obeisance in front of Akal Takht (the highest Sikh Temporal Seat).\nEarlier before entering Golden Temple, he was he was honoured with Siropa (robe of honour) and presented a set of Sikh religious books at the information centre. However, he did not register his visit in the visitors' book of the shrine.\nAfter paying obeisance, he went to Kotkapura by road to meet families of two persons who were killed in police firing.\nAlleged incidents of sacrilege took place at seven villages in the state in the recent past plunging the state into turmoil with Sikh protesters blocking highways and other key roads.\nPolice have so far arrested six persons, mostly working in Sikh shrines, in connection with the sacrilege incidents.\nPunjab police has alleged \"foreign hand\" behind the incidents of sacrilege even as the Centre has sought a report from the Punjab government on the matter. ", "external_links": ["https://play.google.com/store/apps/details?id=com.toi.reader.activities"], "published": "2015-10-24T21:06:00.000+03:00", "crawled": "2015-10-24T16:10:20.546+03:00", "highlightTitle": ""}