{"organizations": [], "uuid": "f238fa5587600912407283250724a6d72818b31f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/149655/sports", "section_title": "Sports - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30234773/jags-te-julius-thomas-active-expected-to-make-season-debut", "country": "US", "title": "Jags TE Julius Thomas active, expected to make season debut", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Jags TE Julius Thomas active, expected to make season debut - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "f238fa5587600912407283250724a6d72818b31f"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30234773/jags-te-julius-thomas-active-expected-to-make-season-debut", "ord_in_thread": 0, "title": "Jags TE Julius Thomas active, expected to make season debut", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By The Associated Press\nJacksonville Jaguars tight end Julius Thomas is active and expected to make his debut with his new team at Tampa Bay on Sunday.\nThomas, who left the Denver Broncos as a free agent, practiced this week without a cast for the first time since breaking his right hand in the preseason opener Aug. 14. He had surgery Sept. 2.\nAnother key pass-catcher, Atlanta receiver Julio Jones, is active against the Washington Redskins after being listed as questionable with hamstring and toe injuries.\nOffensive tackle Jake Long, who signed on Sept. 15, is active for the first time for the Falcons.\nAs expected, the Seattle Seahawks, who play at Cincinnati, are without Marshawn Lynch for the second game in a row with an injured hamstring, while the Buffalo Bills won't have receiver Sammy Watkins, or running backs LeSean McCoy and Karlos Williams, all because of injuries.\nThe Titans chose to keep right guard Chance Warmack out a second straight game, giving him an extra week to heal a sprained MCL in his right knee.\nBryan Bulaga is back for the Packers at right tackle after missing the past three games with a left knee injury. It's a boost for a Green Bay offensive line that must contend with the active defensive front of the St. Louis Rams.\n___\nWASHINGTON at ATLANTA\nRedskins: QB Robert Griffin III, WR DeSean Jackson, CB DeAngelo Hall, CB Chris Culliver, DE Frank Kearse, OG Arie Kouandjio, TE Jordan Reed.\nFalcons: LB Justin Durant, WR Justin Hardy, S Charles Godfrey, CB Dez Southward, C Gino Gradkowski, T Bryce Harris, DE Malliciah Goodman.\n___\nST. LOUIS AT GREEN BAY\nRams: QB Sean Mannion, S Maurice Alexander, LB Alec Ogletree, LB Jo-Lonn Dunbar, T Darrell Williams, G Cody Wichmann, DL Ethan Westbrooks\nPackers: QB Brett Hundley, WR Davante Adams, S Sean Richardson, CB LaDarius Gunter, S Morgan Burnett, LB Jake Ryan, G Lane Taylor\n___\nJACKSONVILLE at TAMPA BAY\nJaguars: WR Marqise Lee, RB Denard Robinson, S James Sample, LB Paul Posluszny, OL Tyler Shatley, DE Chris Smith, DT Sen'Derrick Marks.\nBuccaneers: QB Ryan Griffin, CB Johnthan Banks, C Evan Smith, G Logan Mankins, TE Austin Seferian-Jenkins, TE Luke Stocker, WR Russell Shepard.\n___\nCLEVELAND AT BALTIMORE\nBrowns: QB Austin Davis, RB Shaun Draughn, RB Robert Turbin, S Tashaun Gipson, LB Craig Robertson, WR Dwayne Bowe, TE E.J. Bibbs.\nRavens: WR Steve Smith, WR Breshad Perriman, RB Lorenzo Taliaferro, CB Rashaan Melvin, C/G Ryan Jensen, TE Crockett Gillmore, DE Chris Canty.\n___\nSEATTLE AT CINCINNATI\nSeahawks: CB Tye Smith, RB Marshawn Lynch, CB Marcus Burley, LB Kevin Pierre-Louis, OL Kristjan Sokoli, OL Alvin Bailey, DE Demarcus Dobbs.\nBengals: WR Greg Little, WR Mario Alford, CB Chris Lewis-Harris, TE C.J. Uzomah, DT Marcus Hardison, DT Pat Sims, DE Margus Hunt.\n___\nCHICAGO AT KANSAS CITY\nBears: QB David Fales, WR Alshon Jeffery, WR Eddie Royal, S Antrel Rolle, OL Patrick Omameh, OT Jermon Bushrod, DL Will Sutton.\nChiefs: QB Aaron Murray, WR Albert Wilson, CB Marcus Cooper, OL Jah Reid, TE Brian Parker, LB Josh Mauga, DL Rakeem Nunez-Roches.\n___\nBUFFALO AT TENNESSEEE\nBills: WR Sammy Watkins, RB LeSean McCoy, RB Karlos Williams, S Bacarri Rambo, LB Tony Steward, C Gabe Ikard, DE Alex Carrington.\nTitans: QB Charlie Whitehurst, RB Terrance West, RG Chance Warmack, TE Chase Coffman, DL Mike Martin, NT Sammie Hill.\n___\nNEW ORLEANS AT PHILADELPHIA\nSaints: P Thomas Morstead, QB Garrett Grayon, FB Austin Johnson, DE Obum Gwacham, T Terron Armstead, G Jahri Evans, DE Bobby Richardson\nEagles: QB Thad Lewis, RB Kenjon Barner, CB Denzel Rice, LB Kiko Alonso, OL Julian Vandervelde, LB Mychal Kendricks, DE Brandon Bair.\n___\nOnline:\nAP NFL website: www.pro32.ap.org and AP NFL Twitter feed: http://twitter.com/AP_NFL\n All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": ["http://twitter.com/AP_NFL"], "published": "2015-10-11T03:00:00.000+03:00", "crawled": "2015-10-11T21:34:01.238+03:00", "highlightTitle": ""}