{"organizations": [], "uuid": "a2097268937e73119b11895cf9b63f0e87b36813", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.timesunion.com", "main_image": "http://www.timesunion.com/img/pages/article/opengraph_default.jpg", "site_section": "http://www.timesunion.com/default/feed/default/feed/Sports-News-64.php", "section_title": "Sports News", "url": "http://www.timesunion.com/sports/article/Union-hockey-comes-up-short-against-New-Hampshire-6588974.php", "country": "US", "title": "Union hockey comes up short against New Hampshire", "performance_score": 0, "site": "timesunion.com", "participants_count": 1, "title_full": "Union hockey comes up short against New Hampshire - Times Union", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T06:20:00.000+02:00", "replies_count": 0, "uuid": "a2097268937e73119b11895cf9b63f0e87b36813"}, "author": "Sean Martin", "url": "http://www.timesunion.com/sports/article/Union-hockey-comes-up-short-against-New-Hampshire-6588974.php", "ord_in_thread": 0, "title": "Union hockey comes up short against New Hampshire", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Schenectady\nPerhaps the play that best symbolized Union's game against New Hampshire came when Spencer Foo was leaving the penalty box in the third period and was promptly whistled for interference when he collided with a Wildcats skater while stepping back onto the ice.\nAs was the case most of the night, the Dutchmen were often in the wrong place at the wrong times and came up with a mostly flat performance in dropping their first game of the year with a 5-2 loss Saturday night at Messa Rink.\nUnion (2-1-3) surrendered four unanswered goals to New Hampshire (2-2-1) a night after skating to a 5-5 tie with Michigan while the Wildcats were coming off a 6-6 tie Friday with Massachusetts in a game they once led 6-1.\n\"Hats off to UNH, Dick Umile and his staff did a great job,\" Bennett said. \"Better than our staff of getting the guys in a short turnaround for the second night when we each had some tough nights the night before in regards with how the games played out.\"\nMore Information\nNEW HAMPSHIRE 5, UNION 2\nNew Hampshire 1 2 2 — 5\nUnion 2 0 0 -— 2\nFirst period— 1. Union, Foo 2, (Supinski), 4:25, (pp); 2. New Hampshire, Correale 5, (Kelleher, Marks), 9:13; 3. Union, Scarfo 3, (Light, Henry), 15:37. Penalties— Cleland, UNH, (cross-checking), 3:44; Henry, Uni, (slashing), 18:02.\nSecond period— 4. New Hampshire, Gaudreault 4, (unassisted), 5:06; 5. New Hampshire, Kelleher 3, (Poturalski, Correale), 10:48. Penalties— Pontarelli, Uni, (high-sticking), :51; New Hampshire bench, (too many men on ice-served by Nazarian), 3:04; Scarfo, Uni, (interference), 5:06; Cleland, UNH, (interference), 15:13; Vecchione, Uni, (tripping), 19:15.\nThird period— 6. New Hampshire, Poturalski 3, (Kelleher, Cleland), :59, (pp); 7. New Hampshire, Boyd 1, (Miller, Marks), 18:00, (en). Penalties— Foo, Uni, (boarding), 5:12; Kelleher, UNH, (interference), 7;25; Taylor, Uni, (roughing), 14:32.\nShots On Goal—New Hampshire 12-8-8—28; Union 9-15-12—36.\nPower-play opportunities— New Hampshire 1 of 7; Union 1 of 4.\nGoalies— New Hampshire, Adam Clark 1-0-0 (36 shots-34 saves); Union, Jake Kupsky 1-1-0 (27-23).\nT— 2:11. A— 1,977.\nUnion was whistled for seven minor penalties in all and the crisp passing and all-around energy shown against Michigan was lacking against New Hampshire.\n\"If I start on the ECAC reffing, it's not going to go well,\" Bennett said. \"I'm just going to leave it at that. You've got to keep at it, especially with a younger group. We just want to try to keep attacking, be relentless every period, we've got a lot of work to do. It's going to take some time.\"\nFoo opened the scoring with a power-play goal at 4:25 of the first period and, after the Wildcats tied it on Dan Correale 's goal at 9:13, Ryan Scarfo give the Dutchmen a 2-1 lead when he knocked in a rebound of Connor Light's shot at 15:37 of the first.\nUnion could not sustain the momentum into the second and misfortune struck on both of New Hampshire's goals in the period.\nWith Union on the power play and holding the lead, defenseman Nick DeSimone 's shot went wide and the puck caromed out to the center-ice sideboards, where Maxim Gaudreault picked up the loose puck and skated in alone before beating Dutchmen goaltender Jake Kupsky with a backhander to tie the game two seconds after the Union power play expired.\nLater in the period, DeSimone tripped at center ice, giving the Wildcats an odd-man rush that culminated with Tyler Kelleher's go-ahead goal at 10:48.\n\"We need more energy as a group and we've got to come out a bit harder,\" Foo said. \"Things are going to happen but we've got to rally around that.\"\nKupsky finished with 23 saves in his second start, giving up Andrew Poturalski's power play goal 59 seconds into the third when Poturalski was allowed to hold the puck unchecked in front of Kupsky before putting it in the net when the freshman goaltender tried to dive on the puck.\n\"The fault is not on the goaltending, we were pretty sloppy in the D-zone, losing our men and stuff like that,\" defenseman Jeff Taylor said. \"Being the second night, I think guys were tired but that is no excuse. We're going to have back-to-back games every weekend.\"\nSean Martin , a local freelance writer, is a frequent contributor to the Times Union .", "external_links": [], "published": "2015-10-25T06:20:00.000+02:00", "crawled": "2015-10-25T09:23:15.078+02:00", "highlightTitle": ""}