{"organizations": [], "uuid": "156fc1a76ed61f8d75202032f4f46df39ebdeed7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fox8live.com", "main_image": "http://ksla.images.worldnow.com/images/9040957_G.jpg", "site_section": "http://www.fox8live.com/", "section_title": "New Orleans News, Weather, Saints - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "url": "http://www.fox8live.com/story/30284491/authorities-id-guard-slain-during-liquor-store-robbery", "country": "US", "title": "Authorities ID guard slain during liquor store robbery", "performance_score": 0, "site": "fox8live.com", "participants_count": 1, "title_full": "Authorities ID guard slain during liquor store robbery - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T08:45:00.000+03:00", "replies_count": 0, "uuid": "156fc1a76ed61f8d75202032f4f46df39ebdeed7"}, "author": "KSLA Staff", "url": "http://www.fox8live.com/story/30284491/authorities-id-guard-slain-during-liquor-store-robbery", "ord_in_thread": 0, "title": "Authorities ID guard slain during liquor store robbery", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SHREVEPORT, LA (KSLA) - Authorities just released the identity of the armed guard who was slain during a liquor store holdup in Shreveport's Cedar Grove neighborhood.\nMichael Wayne Henry, 56, of Shreveport, was working security in Thrifty Liquor in the 8400 block of Linwood Avenue just after 10 p.m. Friday when an armed male entered the store and confronted him, Shreveport police Cpl. Marcus Hines said.\nThe gunman fired one round, which struck Henry in the upper body, during the confrontation. The wounded guard was taken to University Health, where he was pronounced dead.\nThe gunman, a black male wearing a dark hooded sweatshirt and distinctive pink gloves, then proceeded to rob the store of an undisclosed amount of cash. He ran south from the store and is believed to have gotten into a silver or gray Lincoln Town Car with a black roof, Hines said.\nAuthorities have reason to suspect the gunman also might be responsible for other armed robberies committed by someone matching a similar description, Hines said. \"Shreveport police investigators are working feverishly in efforts to identify and apprehend the person responsible for this crime and are reviewing surveillance video captured from the business.\"\nIn addition to the guard, several employees and customers were in the store at the time of the shooting and subsequent robbery. No one else was wounded.\nAuthorities urge anyone with information about the slaying and robbery at Thrifty Liquor to call Shreveport-Caddo Crime Stoppers at (318) 673-7373 or visit its website at lockemup.org. Crime Stoppers will pay up to $1,000 for information leading to an arrest.\nCopyright 2015 KSLA . ", "external_links": [], "published": "2015-10-17T08:45:00.000+03:00", "crawled": "2015-10-18T02:15:43.991+03:00", "highlightTitle": ""}