{"organizations": [], "uuid": "2659098c13e19bcbf002721742a3ac88d770ba11", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/chandigarh/audio-clip-stings-city-bjp/147883.html", "country": "US", "title": "Audio clip stings city BJP", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "Audio clip stings city BJP", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "2659098c13e19bcbf002721742a3ac88d770ba11"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/chandigarh/audio-clip-stings-city-bjp/147883.html", "ord_in_thread": 0, "title": "Audio clip stings city BJP", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Rajinder Nagarkoti\nTribune News Service\nChandigarh, October 18\nAfter a clash between supporters of local BJP president Sanjay Tandon and former Union Minister Harmohan Dhawan, an audio clip, purportedly a telephonic conversation between BJP general secretary-cum-election in charge for Chandigarh Prem Kaushik and former BJP colony cell convener Dalip Sharma has gone viral in the city. The 11-minute conversation has raised questions over the internal poll of the party. In the leaked audio clip, Kaushik is alleged to have said that he is aware about the wrong practices in the internal poll of the party. Kaushik is heard saying, “Mujhe pata hai galat ho raha hai”. Senior leader of the local BJP, including former Union Minister Harmohan Dhawan, former MP Satya Pal Jain and three former party presidents, have already raised questions over the internal poll of the party and have targeted the current party president, Sanjay Tandon. In the audio clip, Sharma has raised questions over the internal poll saying, “Guruji (Kaushik), kya kar rahe ho? Meri to kuch samajh mein nahi aa raha”. Replying to Sharma’s question, Kaushik is heard saying, “Hota to aise hi hai. Pehle Jain (former MP Satya Pal Jain) ke hath mein thi command to wo bhi aise hi karte the. Ab Sanjay (party president Sanjay Tandon) ke hath mein command hai aur meri ye majburi hai uske sath chalne ki. Is samay Sanjay ka group bahut bada ho chuka hai”. In the conversation, the name of Haryana Chief Minister Manohar Lal Khattar also figures once and has been allegedly held responsible for “finishing Jain’s era” in the Chandigarh BJP. Kaushik is heard saying, “Jis tarah Manohar Lal Khattar ne Jain ko khatam kiya, usi tarah sangathan (organisation) ka koi aadmi aaye to kuch hoga. Nahi to aise hi chalta rahega”. From 2007 to 2010, Khattar was the organisation secretary of the BJP for the region, including Chandigarh. During his tenure, the city BJP witnessed a change of leadership after a long time. Before Khattar arrived on the scene, senior party leader Satya Pal Jain’s group dominated the party. Later, Sanjay Tandon was brought in as general secretary and subsequently elevated as president. Due to the change in equations, there was infighting in the party, which led to its defeat in the Lok Sabha elections in 2009. I was betrayed by Sharma, says Kaushik BJP general secretary-cum-election in charge for Chandigarh Prem Kaushik confirmed the conversation, but said he was betrayed by Sharma. “Dalip Sharma has now lost his credibility. After this audio leak, nobody will trust him,” Kaushik said. On Haryana Chief Minister Manohar Lal Khattar, he said he actually wanted to say that Khattar made the party structure strong in Chandigarh during his term as organisation secretary of the Chandigarh BJP. On the internal poll of the party, Kaushik said the elections were being held as per the constitution and there was nothing wrong. “In the audio clip, whatever I said was to get information from the other side,” Kaushik said. Not aware about the audio clip: Dalip Dalip Sharma, former BJP colony cell convener, said he was not aware about any such audio clip. Note: (Chandigarh Tribune cannot vouch for the authenticity of voices in the audio)", "external_links": [], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-19T02:11:41.762+03:00", "highlightTitle": ""}