{"organizations": [], "uuid": "05c7642915f0a295b9347adf8adaffe66107f67a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "onlineathens.com", "main_image": "http://onlineathens.com/sites/default/files/N1203P59005C.jpg", "site_section": "http://ath-cdn.com/taxonomy/term/2/feed", "section_title": "Sports", "url": "http://onlineathens.com/sports/2015-10-09/oconee-jefferson-meet-region-semifinals", "country": "US", "title": "Oconee, Jefferson to meet in region semifinals", "performance_score": 0, "site": "onlineathens.com", "participants_count": 1, "title_full": "Oconee, Jefferson to meet in region semifinals", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T06:36:00.000+03:00", "replies_count": 0, "uuid": "05c7642915f0a295b9347adf8adaffe66107f67a"}, "author": "Staff", "url": "http://onlineathens.com/sports/2015-10-09/oconee-jefferson-meet-region-semifinals", "ord_in_thread": 0, "title": "Oconee, Jefferson to meet in region semifinals", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Oconee, Jefferson to meet in region semifinals From Staff Reports – updated Saturday, October 10, 2015 - 12:05am \nOconee County and Jefferson, the top two volleyball teams in Region 8-AAA will square off at 11:45 a.m. today in the semifinals of the region tournament at the Arena in Jefferson. \nTop-seeded Oconee County (26-12) defeated fourth-seeded Morgan County 25-12, 25-16 Thursday in Watkinsville while No. 2 seed Jefferson (33-5) defeated third-seed East Jackson 25-14, 26-24 at home. \nThe Warriors were led by Maggie Carlson (12 kills, six aces), Caroline Jansen (five kills) and Rachel Blanton (five kills). \nAgainst East Jackson, the Dragons were led by Abby Wood (10 digs, eight kills), Grace Haney (seven assists, six digs), Lindsey Nilsen (six kills), Madison Corbett (16 assists) and Olivia Przybysz (10 digs). \nEast Jackson (17-13), which earlier Thursday defeated Jackson County 25-9, 25-6, was led by Emi Melendez (six aces) and Sydney Mathis (19 kills). \nAlso today, the Eagles will square off against Morgan County at 1:30 p.m. to determine seeding for the Class AAA state tournament. The tournament finals are set for 3 p.m. \nCLARKE CENTRAL PULLS OFF UPSET: At Bethlehem, seventh-seeded Clarke Central defeated No. 2 seed Winder-Barrow (21-25, 25-18, 25-18) in the Region 8- tournament. Winder-Barrow stayed alive in the tournament by defeating Loganville 25-23, 25-11. \nTop seed Apalachee defeated eighth seed Cedar Shoals 25-10, 25-20. Cedar Shoals also lost to Flowery Branch in the loser’s bracket. \nToday, Apalachee will face Lanier and Clarke Central will play Gainesville in winner’s bracket games. The losers will meet Flowery Branch and Winder-Barrow. The finals are set for 1:30 p.m. \nATHENS ACADEMY ADVANCES: At Bogart, Athens Academy posted two victories in the Area 6-A tournament to advance to today’s semifinals and qualify for the Class A Private state tournament. \nThe Spartans (32-2) defeated Prince Avenue Christian (25-9, 25-11) and Tallulah Falls (25-12, 25-14) to reach today’s 11:15 a.m. semifinals, where they’ll meet Hebron Christian, which defeated Athens Christian and George Walton on Thursday. The finals are set for 3:30 p.m. today. \nWESTMINSTER CHRISTIAN DROPS TWO: At Watkinsville, Westminster Christian lost a pair of matches to North Georgia Christian (3-2) and Heritage Academy (2-0). \nAgainst North Georgia Christian, Morgan Britt had eight of the team’s 27 kills, Elie Campbell recorded four blocks and setter Mary Ford had 23 assists and 11 digs. \nAgainst Heritage Academy, Ford had a six-point service run (including five aces). \nThe Lions host Augusta Eagles (5 p.m.) and Heritage Academy (7 p.m.) on Monday. \nNORTH OCONEE FINISHES SECOND: At Buford, North Oconee lost to Buford in finals of the Region 8-AAAA tournament, 20-25, 12-25, 14-25, and will be the second seed from the region in the Class AAAA state tournament. \nThe Titans (34-8) will host the No. 3 seed from Region 5-AAAA on Wednesday at a time to be determined. \nSOFTBALL \nATHENS CHRISTIAN WINS TWO: At Nicholson, Athens Christian defeated Hebron Christian 12-1 in five innings and later topped Commerce 14-0 in four innings in the early rounds of the Class A tournament. \nAgainst Hebron Christian, Kinsley Dickerson went 4-for-4 with two runs, and she was followed by Kiara Barron and Gina Urell, who both went 3-for-3, and Olivia Pineo (two hits), Abby Resop (two hits) and Lexi Veamoi (two hits). Morgan McCannon was the winning pitcher, striking out three and surrendering one unearned run. \nAgainst Commerce, Veamoi earned the pitching victory, striking out nine and allowing but one hit in four innings. Athens Christian had 19 hits and was led at the plate by Resop (four hits), Brook Aiken (two hits), Toni Davis (two hits) and Veamoi (two hits). \nThe Eagles face the Providence Christian-George Walton loser at 10 a.m. today. \nOCONEE COUNTY SPLITS: At Madison, the Warriors defeated East Jackson 2-0 and then fell to Morgan County 3-2 in championship round in the Region 8-AAA tournament. \nAgainst East Jackson, Jessie Michael pitched a complete-game six-hitter with one walk and nine strikeouts. Chloe Fambrough hit a home run, Maura Grace Dickens had a hit, an RBI and a run, McKenzie Pollock had a hit and Ansley Hart contributed a hit. \nAgainst Morgan County (which won the game in the bottom of the seventh inning), Fambrough sustained the pitching loss, giving up six hits, two earned runs, four walks in a strikeout in a complete-game performance. Ansley Hart had three hits and a run, Fambrough had a hit and an RBI, Michael had a hit and an RBI and Hanna Manders added a hit. \nOconee County (13-15), the second seed from the region, will host Pepperell, the No. 3 seed from Region 5-AAA in a doubleheader on Wednesday in the first round of the Class AAA state tournament. An “if necessary” game is scheduled for Thursday. \nNORTH OCONEE SWEPT: At Buford, North Oconee dropped a pair of games to Buford, 6-3 and 5-4 in the semifinals of the Region 8-AAAA tournament. \nBuford scored four runs in its final at-bat in the second game to sweep the series. \nBuford (21-6) will host North Hall (20-7) at 1 p.m. today for the region title. North Hall defeated Madison County (19-10) 1-0 and 12-4 on Thursday to reach the finals. Madison County and North Oconee will play at 11 a.m. today for third place in the region. \nFLOWERY BRANCH 5, WINDER-BARROW 2: At Flowery Branch, the Bulldoggs fell to the Falcons in the Region 8- tournament and will be the No. 4 seed from the tournament. \nWinder-Barrow (15-14) will open play in the Class state tournament on Wednesday at Chapel Hill. \nFROM WEDNESDAY \nSOFTBALL \nOCONEE COUNTY GOES 1-1: At Madison, Oconee County lost 1-0 in eight innings to East Jackson and then turned around with a dramatic come-from-behind 3-2 victory over Jefferson in the quarterfinals of the Region 8-AAA tournament. \nDown 2-1 against Jefferson, Maura Grace Dickens hit a double with the bases loaded in the bottom of the seventh inning to drive home the winning run. The Warriors collected eight hits and were led by Chloe Fambrough (two hits), Hannah Patridge (two hits), Megan Tyler (one hit), Roni Payne (one hit), Jessie Michael (one hit) and Dickens. \nMichael pitched a complete-game four-hitter with one earned run and six strikeouts. \nAgainst East Jackson, Oconee County had five hits – two from Fambrough and one each from Dickens, Patridge and Tyler. Michael pitched eight innings, allowing four hits and striking out nine. \nFROM TUESDAY \nCROSS COUNTRY \nI \nRWIN, GUEST LEAD ATHENSD CHRISTIAN: At the Hebron Lions Showcase in Dacula, Athens Christian’s Noah Irwin finished second among 185 runners in the boys race and Tanner Guest was third among 121 runners in the girls race. \nIrwin crossed the finish line in 17 minutes, 43.20 seconds and was followed by teammate Samuel Hayes, who finished 24th at 19:20. 37. The Eagles finished sixth overall with 147 points behind Wesleyan (30 points), Mountain View (83), Eastside (95), Tallulah Falls (123) and Berkmar (128). \nGuest finished in 21:33.43 and was followed by Drew Davis Bailey, who finished in 11th place at 23:09.07. The Eagles finished second with 52 points behind Wesleyan (27 points). Prince Avenue Christian, led by Sara Beth Johnson (29th place, 23:10.92) and Megan Garth (30th place, 25:24.89), came in fifth with 141 points. \nOnlineAthens.com aims to foster constructive, respectful civic conversation. With your help, we will provide a friendly, safe, easy to use place on the Web for everyone in the area to share not only opinions but also information of community interest. Racist, harassing, abusive and libelous comments will not be tolerated. \nBy logging in or creating a new account, you agree to our Terms of Service. \nIf you are logging in for the first time after June 29, 2015, you will need to create a new account . Go to the previous story", "external_links": [], "published": "2015-10-10T06:36:00.000+03:00", "crawled": "2015-10-10T07:40:21.489+03:00", "highlightTitle": ""}