{"organizations": ["Facebook Albom", "Detroit Lions", "Arizona Cardinals", "Ford Field", "Detroit Free Press"], "uuid": "4dea9448f0879838e849c64ca62cf2cbd18ca334", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freep.com", "main_image": "http://www.gannett-cdn.com/-mm-/c20b4970770f6475e38eeb3cc343f2c89e4495a4/c=0-63-1734-1043&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/13/DetroitFreePress/DetroitFreePress/635802929095337651-Lions-011115-kd-13.jpg", "site_section": "http://rssfeeds.freep.com/freep/sports", "section_title": "Detroit Free Press - Sports", "url": "http://www.freep.com/story/sports/nfl/lions/2015/10/13/detroit-lions-collapse-quarterback-controversy/73853968/", "country": "US", "title": "Albom: Stafford's benching, maybe, but the warning?", "performance_score": 0, "site": "freep.com", "participants_count": 0, "title_full": "Albom: Stafford's benching, maybe, but the warning?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T07:42:00.000+03:00", "replies_count": 0, "uuid": "4dea9448f0879838e849c64ca62cf2cbd18ca334"}, "author": "", "url": "http://www.freep.com/story/sports/nfl/lions/2015/10/13/detroit-lions-collapse-quarterback-controversy/73853968/", "ord_in_thread": 0, "title": "Albom: Stafford's benching, maybe, but the warning?", "locations": ["Detroit", "Michigan"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mitch Albom", "Dan Orlovsky", "Kirthmon F. Dozier", "Jim Caldwell", "Stafford", "Matthew Stafford", "Albom"], "text": "Albom: Stafford's benching, maybe, but the warning? Mitch Albom on Detroit Lions coach Jim Caldwell's handling of his quarterback's benching Post to Facebook Albom: Stafford's benching, maybe, but the warning? Mitch Albom on Detroit Lions coach Jim Caldwell's handling of his quarterback's benching Check out this story on Freep.com: http://on.freep.com/1LrEHQA Cancel Send A link has been sent to your friend's email address. Posted! A link has been posted to your Facebook feed. Join the Conversation To find out more about Facebook commenting please read the Conversation Guidelines and FAQs Albom: Stafford's benching, maybe, but the warning? Mitch Albom, Detroit Free Press Columnist 12:42 a.m. EDT October 13, 2015 Detroit Lions quarterback Matthew Stafford (No. 9) was replaced by Dan Orlovsky during third quarter action against the Arizona Cardinals on Sunday, October 11, 2015 at Ford Field in Detroit, Michigan. (Photo: Kirthmon F. Dozier, DFP) CONNECT TWEET LINKEDIN COMMENT EMAIL MORE \nMatthew Stafford had never been pulled from a game. Not in high school. Not in college. Not in seven years in the NFL. But Jim Caldwell pulled him Sunday. Took him out after his third interception of the day, less than five minutes into the third quarter. Stafford stood on the sidelines for the rest of the game, looking out with faraway eyes, like a man on an island wondering if a ship might come over the horizon. \nIt may have seemed like the only thing to do. It may have been, football-wise, the right thing to do. But Caldwell did one thing wrong in my opinion. He warned Stafford at halftime that if he threw another interception, he’d be yanked. \nWhat was he trying to accomplish? Does a veteran quarterback need to be warned? Does he need another sword hanging over his head? It’s not like Stafford was intentionally trying to throw picks. \n“I was a little caught off-guard, to be honest,” Stafford admitted Monday. “I went out there and tried to play aggressive. We’re down 21 points. Try and get us back in the ball game. Tried to make a big play to Calvin Johnson, and obviously Patrick Peterson made a good play, intercepted the football ... and I got to watch the rest of the night. \n“Not something I’m accustomed to being around.” \nListen. I’ve known Stafford since he arrived in Detroit. I’ve heard his voice in all kinds of situations. He was not happy about this. I get the sense he was embarrassed. \nBad play is bad enough. \nBeing punished publicly is something else. \nSo you have to ask Caldwell: In the long run, does benching help or hurt? \nStafford felt scolded \nNow, with all the vitriol spewing around the Lions, few people this morning will be sympathetic to Stafford, even if they were the same ones predicting great things for him nine months ago. \nBut being angry doesn’t make you right. I think Caldwell got angry, too. Perhaps he was frustrated that yet another game — and likely the season — was being tossed away on fumbles and picks. Sharp: Time for Ford to clean house with Lions \nBut what was benching Stafford going to accomplish? Dan Orlovsky is not going to take over for good. Stafford is the franchise quarterback, a guy with undeniable talent who has taken an awful lot of physical punishment behind a porous line this season without a peep of complaint. I’m not saying he deserves praise for that. But sending him to the bench — especially if the coach knows he’s never been benched before — runs the risk of turning a give-it-all attitude into a resentful one. \n“How tough was standing on the sidelines?” Stafford was asked. \n“It was tough,” Stafford said. “I don’t suit up on Sundays to do that. I suit up on Sundays to play and play to the final whistle. Not getting the opportunity to do that wasn’t my favorite moment.” \nStafford admitted that he felt scolded by Caldwell’s warning. I asked how someone with his personality responds to that. \n“I don’t know how I’m supposed to respond to it other than to just go out there and try to throw the ball as aggressively in that point in the game as I possibly could,” Stafford said. “I play the game the way I know how.” \nRisky move \nCaldwell said he pulled Stafford like a manager pulls a pitcher on a bad day. He said the team was going nowhere and he was looking for a spark. He was quick to add there was no quarterback controversy. \nBut time will tell. Controversies aren’t just between players. If a dent was made in the coach-player relationship, the Lions did more damage to themselves than the 42-17 score. Stafford said Monday that even after the third interception, “I wasn’t going to stop playing until somebody told me I couldn’t. I was going to fight until the end.” \nBut Caldwell had offensive coordinator Joe Lombardi tell Stafford to take a seat. The rest of the game was a camera pointing in Stafford’s face, trying to capture his frustration. Being a reality TV piñata isn’t fun. \n“It’s obviously not a situation I want to be part of ever again,” Stafford said. \nMaybe that’s what Caldwell was after. Maybe he wanted to make Stafford so mad he’ll never throw interceptions again. If it works, great. Good psychology. \nBut you run a risk when you do that. You run a risk of a festering sore. You also send a message to your team about confidence in your star player. \nThe good news was, by pulling Stafford, Caldwell may have saved him from serious injury, the kind that comes when a beaten team isn’t blocking as hard as it should. Calvin Johnson was taken out for similar reasons. \nBut I’m not sure warning that the next mistake will get you benched works on a veteran quarterback the way it does on a college kid. A lot of players could have been benched for poor play Sunday. The one everyone will remember is Stafford. \nThat might not be the best thing to hang around the neck of a guy you need to lead you out of the muck Lions' Stafford on pace for worst season \nContact Mitch Albom: malbom@freepress.com . Download our free Lions Xtra app on your Apple and Android devices. \nCheck out the latest updates with his charities, books and events at mitchalbom.com . Catch \"The Mitch Albom Show\" 5-7 p.m. weekdays on WJR-AM (760). Follow him on Twitter @mitchalbom . To read his recent columns, go to freep.com/sports/mitch-albom . Read or Share this story: http://on.freep.com/1LrEHQA TOP VIDEOS", "external_links": [], "published": "2015-10-13T07:42:00.000+03:00", "crawled": "2015-10-13T07:59:17.100+03:00", "highlightTitle": ""}