{"organizations": [], "uuid": "cff15b353b81cac0b237e9bf45eee76d81a9a166", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nytimes.com", "main_image": "http://static01.nyt.com/images/2015/10/19/sports/19rugby/19rugby-facebookJumbo.jpg", "site_section": "http://www.nytimes.com/services/xml/rss/nyt/InternationalSports.xml", "section_title": "NYT &gt; International Sports", "url": "http://www.nytimes.com/2015/10/19/sports/rugby/rugby-world-cup-new-zealand-all-blacks-defeat-france-semifinal-south-africa.html", "country": "US", "title": "All Blacks Book a Semifinal Date With South Africa at Rugby World Cup - The New York Times", "performance_score": 1, "site": "nytimes.com", "participants_count": 1, "title_full": "All Blacks Book a Semifinal Date With South Africa at Rugby World Cup - The New York Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T11:59:00.000+03:00", "replies_count": 0, "uuid": "cff15b353b81cac0b237e9bf45eee76d81a9a166"}, "author": "Huw Richards", "url": "http://www.nytimes.com/2015/10/19/sports/rugby/rugby-world-cup-new-zealand-all-blacks-defeat-france-semifinal-south-africa.html", "ord_in_thread": 0, "title": "All Blacks Book a Semifinal Date With South Africa at Rugby World Cup - The New York Times", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Continue reading the main story Share This Page Continue reading the main story Continue reading the main story CARDIFF, Wales — It would be easy for the other teams left at the Rugby World Cup to look at the numbers and wonder if they have a chance against New Zealand after it crushed France, 62-13, in their quarterfinal at Millennium Stadium.\nNew Zealand’s 62 points on Saturday were the most France has conceded in 722 international matches over 109 years, and it was also the most ever scored against a major rugby nation in a World Cup match. The overwhelming victory marked a complete exorcism for the All Blacks, who have struggled against the French in previous World Cups, losing in big upsets in 1999 and 2007 and barely winning the final four years ago in Auckland, New Zealand, by a score of 8-7.\nBut if New Zealand is the top global rugby power of the last few decades, then South Africa is No. 2 — and the Springboks are next up for the All Blacks as they try to repeat as champions.\nHistory indicates that South Africa should have more than a fighting chance on Saturday at Twickenham Stadium in London. The All Blacks are 52-35 against South Africa all-time, by far New Zealand’s closest record against any of the major rugby nations. In World Cup matches, South Africa holds a 2-1 advantage.\nSouth Africa advanced to the semifinals with a 23-19 come from behind victory Saturday over Wales at Twickenham.\nWhile calling his team’s 49-point win “a pretty special performance,” New Zealand Coach Steve Hansen made it clear Saturday that he was already looking forward to next Saturday’s matchup.\n“I love playing South Africa because we have a special relationship, which goes back well before my time,” he said at the postgame press conference. “They are the team New Zealand has had the greatest challenges against for many years, and playing them at the World Cup is special.”\nHansen and his captain, Richie McCaw, were united in pointing out that New Zealand has won nothing yet.\n“All we did today is to earn the chance to play in the semifinal. Come Monday we have to come back in and start again,” said McCaw, one of two players left from the 2007 squad that lost to France, 20-18, in the quarterfinals here at Millennium Stadium. “I’ve learned the hard way that you don’t get ahead of yourself.”\nWhile New Zealand’s previous performances at this World Cup had been subdued, Saturday marked a reminder of why and how the All Blacks have dominated world rugby in recent years.\nThierry Dusautoir, France’s captain, said his team had “felt impotent for most of the game.”\n“Every time we lost the ball, we were punished,” said France Coach Philippe Saint-André. “And when one of our players went forward, they would have six men against our one.\n“They play with such speed and skill. They are the Brazil of rugby.”\nThe All Blacks scored nine tries, including three from winger Julian Savea, who also scored a hat trick against Georgia in the pool stage in the same stadium. The replacement scrumhalf Tawera Kerr-Barlow crossed twice within five minutes after he entered the game in the 65th minute.\nAdvertisement\nContinue reading the main story Advertisement\nContinue reading the main story Two scores showed New Zealand at its best. The second try saw a slick exchange of passes between Ma’a Nonu and Conrad Smith, two veteran centers playing together for the 60th time. Their exchanges threw France’s defensive cover off-balance enough to allow the wing Nehe Milner-Skudder to cut in from the right, sidestep his defender and sail untouched to the line.\nThe seventh try saw prop Charlie Faumuina lumbering untouched through a defensive gap created by sharp passing. Though attacking is far down his list of duties, Faumuina was still skilled and aware enough to find the back-row forward Kieran Read up in support and ready to score. It was typical of New Zealand’s play all night — and of its best performances throughout its history — in that a supporting runner was available for a toss and a score.\nFrance battled to stay close during the first half and cut New Zealand’s lead to 24-13 when its powerful No. 8 Louis Picamoles forced his way over.\nDusautoir thought France still had a chance when it entered halftime trailing 29-13. “There was 16 points difference. It is feasible,” he said.\nBut its hopes died when Picamoles was yellow-carded for 10 minutes early in the second half for striking McCaw.\n“Today was the last match for some players who have done a lot for France, but the next generation have learned a lot from this World Cup and will bring France victories in the future,” said Saint-André after his final game in charge of France. His coaching tenure ended with a record-setting defeat and included France’s worst sequence of seasons in the European Six Nations championship since the 1920s.\nDusautoir said it was too soon to say if he would quit international rugby.\nAt Twickenham, South Africa was trailing, 19-18, to Wales, which has beaten it only twice in 30 previous meetings, with five minutes to go. A brilliant piece of handling by South Africa’s No. 8, Duane Vermeulen, created the space for scrumhalf Fourie du Preez, a veteran of its World Cup-winning team of 2007 and the current captain, to score the decisive try. Wales had earlier scored a try through its own scrumhalf Gareth Davies, but was ultimately worn down by the relentless pressure of the highly physical South Africans.\n“We don’t want to make any excuses. South Africa won and we weren’t good enough to win,” said Wales Coach Warren Gatland. “South Africa did what South Africa do. They got one chance, and they took it and that was the result.”", "external_links": [], "published": "2015-10-18T11:59:00.000+03:00", "crawled": "2015-10-18T12:34:28.255+03:00", "highlightTitle": ""}