{"organizations": [], "uuid": "1146979bfcb45616a880a069696716af95437e90", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.oregonlive.com", "main_image": "http://imgick.oregonlive.com/home/olive-media/width620/img/oregonian/photo/2015/09/15/18758306-large.jpg", "site_section": "http://www.oregonlive.com/", "section_title": "Oregon Local News, Breaking News, Sports &amp; Weather - OregonLive.com", "url": "http://www.oregonlive.com/marijuana/index.ssf/2015/09/at_midnight_marijuana_is_legal.html", "country": "US", "title": "At midnight, marijuana is legal to buy in Oregon", "performance_score": 1, "site": "oregonlive.com", "participants_count": 8, "title_full": "At midnight, marijuana is legal to buy in Oregon | OregonLive.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T01:00:00.000+03:00", "replies_count": 7, "uuid": "11641fe29dc7fd0edd29faf9982d30ab143dfe6f"}, "author": "Sue Jepsen | The Oregonian/OregonLive", "url": "http://www.oregonlive.com/marijuana/index.ssf/2015/09/at_midnight_marijuana_is_legal.html#post-0", "ord_in_thread": 0, "title": "At midnight, marijuana is legal to buy in Oregon", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "At midnight, marijuana will not only be legal to possess but to buy , a lot like liquor in Oregon. For advocates and critics alike, this is a big day.\nAnd right now in Oregon, pot is big news . Wrote Mark Katches, the editor of The Oregonian/OregonLive, \"You may never want to buy it, sell it, grow it, or smoke it. But there's no escaping the fact that legal marijuana will impact all of us – whether it's a proliferation of new shops sprouting up in our communities, the potential impact on neighborhood safety or the way drug testing is managed in the places we work.\"\nStarting at midnight tonight, The Oregonian/OregonLive will have reporters and photographers reporting on the first day of legal marijuana sales. Find our coverage on OregonLive , on Twitter at #OregonPot , on Snapchat and on Periscope.\nMaking your first recreational marijuana purchase? What you need to know Marijuana dispensary owner, Melissa Egan, explains what to expect at a dispensary when making a recreational marijuana purchase starting October 1st.\nBefore you head out to purchase marijuana, take a look at this Q&A for answers to many frequently asked questions, including who can buy marijuana, what can be bought and what can't, how to roll a joint and pack a pipe.\nSo, where can you buy it in Oregon ? Statewide, more than 200 dispensaries have told the state they plan to sell recreational cannabis.\nThe Real Dope Having trouble keeping up with all the developments as Oregon wades deeper into legal marijuana? Sign up for The Real Dope , a weekly newsletter emailed directly to you every Tuesday from The Oregonian/OregonLive. Here's a map of all the dispensaries , although not all of them will be selling marijuana on Thursday.\nBut it won't be for sale in many Oregon cities , and here's the list. In many towns, marijuana remains shunned by the majority and is seen as something that shouldn't be given any official stamp of approval.\nIf you do plan to go shopping, here are five things you should know . They include bring cash, the shops don't take debit or credit, and bring an ID, because you must be 21 to purchase pot.\nOn the health front:\nIf you buy marijuana on Thursday, you'll be handed an information card with warnings to keep pot away from kids. It also contains a hotline number and warnings about using marijuana while pregnant\nAnd about those kids, the Oregon Health & Science University is one of the 13 research institutions participating in a federal study looking into the effects of marijuana use on children .\nOn the job:\nWill pot get me fired? (VIDEO) Watch a breakdown of typical workplace policy when it comes to marijuana and what would have to change in order to better detect impairment on the job.\nThursday may be the day that pot is legal in Oregon, but that doesn't make it OK on the job. You can still lose your job if you test positive for pot, even if you're not under the influence at work.\nThe United Food & Commercial Workers Local 555 recently negotiated a contract on behalf of employees at a Portland dispensary. The contract sets out wages, pension contributions, health insurance and paid holidays and vacation.\nAnd on the political front:\nIn Portland, the city has moved to protect existing medical marijuana dispensaries from being crowded out by another pot retailer.\nIn Clackamas County, commissioners have launched the first countywide effort in the Portland area to write zoning rules for the marijuana industry .\n\"It's real and it's here to stay,\" Chairman John Ludlow. \"Voters approved it and there are 8,000 growers in Clackamas County. Recreational sales start Oct. 1, so we might as well work on our land-use ordinances.\"\n-- Sue Jepsen", "external_links": ["https://twitter.com/search?q=%23oregonPot&src=typd", "https://twitter.com/oregonian"], "published": "2015-10-01T01:00:00.000+03:00", "crawled": "2015-10-01T12:06:57.515+03:00", "highlightTitle": ""}