{"organizations": ["Freeport"], "uuid": "1e486ea25d67858bc1493e2c1d828283585ffdbe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kcchronicle.com", "main_image": "http://www.kcchronicle.com/images/avatar.png", "site_section": "http://www.kcchronicle.com/?rss=sports/preps", "section_title": "Prep Sports", "url": "http://www.kcchronicle.com/2015/10/03/saturdays-prep-roundup-kaneland-xc-earns-freeport-sweep/aajdj2x/", "country": "US", "title": "Saturday's prep roundup: Kaneland XC earns Freeport sweep", "performance_score": 0, "site": "kcchronicle.com", "participants_count": 0, "title_full": "Saturday's prep roundup: Kaneland XC earns Freeport sweep", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T01:00:00.000+03:00", "replies_count": 0, "uuid": "1e486ea25d67858bc1493e2c1d828283585ffdbe"}, "author": "", "url": "http://www.kcchronicle.com/2015/10/03/saturdays-prep-roundup-kaneland-xc-earns-freeport-sweep/aajdj2x/", "ord_in_thread": 0, "title": "Saturday's prep roundup: Kaneland XC earns Freeport sweep", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["KANE"], "text": "Saturday's prep roundup: Kaneland XC earns Freeport sweep Published: Saturday, Oct. 3, 2015 5:00 p.m. CDT • Updated: Saturday, Oct. 3, 2015 5:06 p.m. CDT By KANE COUNTY CHRONICLE \nFREEPORT – Monroe, Wis., sits north of Kaneland and the Freeport Invitational cross country course at Highland Community College. \nOn Saturday, however, Monroe's Cheesmakers and the rest of the field were looking up at Kaneland's boys and girls programs. \nThe Knights earned both team titles, with the boys scoring 37 points to top Monroe (54) and the rest of the 12-team field. The Kaneland girls defeated Rockford Boylan via tiebreaker, as both teams finished with 61 points. \nIn the boys race, Matt Richtman (second, 15:05) and Austin Kintz (fourth, 15:21) paced a Kaneland group that ran to its best pack split – 70 seconds – of the season. \n\"They kind of separated themselves with the two boys from Rock Falls probably in the first mile,\" Knights boys coach Chad Clarey said. \nFour other Knights were part of the top 13, led by Sean Spaetzel, who was eighth in 16:10. \nIn the 11-team girls race, the tiebreaker went to the sixth score, and Kaneland earned the victory against Boylan as Sarah Daley took 30th overall in 20:43. \nKaneland's Brianna Bower was third overall in 17:41, finishing behind two Boylan athletes. The next finishers were over a minute away from the lead pack. \n\"From a talent perspective, it was very powerful up front,\" Clarey said. \nFOOTBALL \nFenwick 42, Marmion 21: At Oak Park, turnovers plagued the Marmion football team in a 42-21 loss at Chicago Catholic League Green rival Fenwick. \nMarmion trailed, 27-14, at halftime, scoring on Johnny Tate's 7-yard touchdown pass to Jett Haas and on a defensive fumble recovery in the end zone. Tate, of St. Charles, returned from a high ankle sprain sustained in a Week 3 home loss to St. Francis, and added a second touchdown pass in the third quarter. \nThe Cadets struggled to contain Friars wide receiver Sherman Martin, however, as his third touchdown reception of the afternoon put Fenwick ahead by the final margin in the closing minutes of the third quarter. \nMarmion, bidding for its third successive playoff berth, must win its three remaining games – at De La Salle (1-4) and home against Aurora Christian (3-3) and Montini (6-0) – to become playoff-eligible. Playoff points could be dicey even if the Cadets sweep that stretch, as the team earned one of its victories via forfeit. \nBOYS SOCCER \nGateway City Classic: At St. Louis, St. Charles East finished the two-day event with a 2-0-1 mark, earning victories against Lexington (Ky.) Dunbar and Francis Howell, a school in St. Charles, Mo. \nMarmion 2, Oswego 0: At Aurora, Quinn Gratz scored twice to boost Marmion. \nBurlington Central 2, Johnsburg 1: At Johnsburg, Jack Schramme converted a penalty kick with 19:11 remaining in the second half to provide the winning goal for Central (8-7-1, 7-2 Big Northern Conference East). Cole Tecza opened the scoring midway through the first half. \nBOYS GOLF \nLake Park Invitational: At Indian Lakes in Bloomingdale, St. Charles North placed seventh among 24 teams with a 331. Michael Stasczuk (79) and Hank Zimmer led the way. \nBatavia took eighth with a 335, as Nick Robinson's 78 tied for 11th individually. Andrew Nelson followed with an 83. \nEarlier this week, the North Stars and Bulldogs finished in a third-place tie in the Upstate Eight Conference River Division season standings. \nGIRLS CROSS COUNTRY \nWheaton North Classic: At St. James Farm Forest Preserve in Warrenville, St. Charles East senior Anastasia Honea placed 12th in the first flight of the girls race, finishing in 17:59.", "external_links": [], "published": "2015-10-04T01:00:00.000+03:00", "crawled": "2015-10-04T04:12:33.653+03:00", "highlightTitle": ""}