{"organizations": ["K-State Snyder"], "uuid": "0e3129d2f405eeb50c760213d1f6cc5e6920ce75", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxsports.com", "main_image": "http://www.foxsports.com/content/fsdigital/fscom.img.png", "site_section": "http://api.foxsports.com/v1/rss?partnerKey=zBaFxRyGKCfxBagJG9b8pqLyndmvo7UU&tag=cfb", "section_title": "FOX Sports Digital", "url": "http://www.foxsports.com/college-football/story/snyder-knows-he-has-to-set-tone-for-struggling-k-state-101915?cmpid=feed:-sports-CQ-RSS-Feed", "country": "", "title": "Snyder knows he has to set tone for struggling K-State", "performance_score": 0, "site": "foxsports.com", "participants_count": 0, "title_full": "Snyder knows he has to set tone for struggling K-State", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T00:47:00.000+03:00", "replies_count": 0, "uuid": "0e3129d2f405eeb50c760213d1f6cc5e6920ce75"}, "author": "", "url": "http://www.foxsports.com/college-football/story/snyder-knows-he-has-to-set-tone-for-struggling-k-state-101915?cmpid=feed:-sports-CQ-RSS-Feed", "ord_in_thread": 0, "title": "Snyder knows he has to set tone for struggling K-State", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Snyder"], "text": "Snyder knows he has to set tone for struggling K-State AP \nOct 19, 2015 at 5:47p ET + Updated Oct 19, 2015 at 5:47p ET \nKansas State coach Bill Snyder was asked Monday about his Wildcats being 0-3 in Big 12 play for the second time in three seasons, this time after their most lopsided loss in 25 years. \n''If I can't present the right attitude and approach, then I can't expect the players to,'' Snyder said on the weekly Big 12 coaches teleconference. ''It's a dramatic disappointment, but we all have to fight back, that disappointment turns into anger.'' \nThe Wildcats (3-3, 0-3 Big 12) only lost two league games a year ago, including the regular-season finale against Baylor that was their third loss overall. After losing their first three conference games in 2013, they responded with four consecutive victories. \nK-State lost 55-0 at home Saturday to No. 17 Oklahoma. Next up for the Wildcats is Texas (2-4, 1-2), which had an open date after its 24-17 win over those same Sooners at the State Fair of Texas. \nTexas coach Charlie Strong quickly dispelled the notion that he had to guard against overconfidence by his players because of what happened to K-State. \n''We have nothing to guard against, because before Oklahoma, we go play TCU and get hammered (50-7),'' Strong said. ''We're not thinking about what Oklahoma did against Kansas State, because I know they're a well-coached football team. It may have happened last week, but it's not going to happen two weeks in a row. ... Good teams are always going to bounce back.'' \nWhile the Wildcats were getting embarrassed, Kansas (0-6, 0-3) made quite a comeback before coming close to their first victory in holding down offensive powerhouse Texas Tech. \nThe Red Raiders led 20-0 at halftime, but Kansas was within 23-20 before Tech's interception return for a touchdown with 4 minutes left. \n''I saw dramatic improvement from our team defensively against a really good offensive unit,'' first-year Jayhawks coach David Beaty said. ''We had an opportunity. We just simply didn't get it done. The next step in the maturation process now kind of looking at, ''Hey, what prevented us from finishing that game out?''' \nMAYFIELD VS. TECH: Baker Mayfield is throwing for 313 yards a game with 19 touchdowns and only three interceptions in his first season as Oklahoma's quarterback. He had to sit out last season with the Sooners after transferring from Texas Tech. With the Red Raiders at Oklahoma on Saturday, Tech coach Kliff Kingsbury was asked Monday about his thought process for players who want to transfer. \n''That whole talk is something that I'm really going to stay away from this week,'' Kingsbury said. ''Just focus on the game and two very good teams going at it.'' \nSooners coach Bob Stoops said he's not too worried about Mayfield getting too hyped about the game. \n''He's handled himself really well, he's played well,'' Stoops said. ''I wouldn't expect him to do any different this week.'' \nSome other notes from the Big 12 call: \n- With a week to go before the first College Football Playoff rankings, the Big 12 still has three undefeated teams - No. 2 Baylor, No. 4 TCU and No. 14 Oklahoma State. They all play each other in November. Asked if he felt the Big 12 would avoid another playoff snub this season, Oklahoma State coach Mike Gundy quickly responded: ''No question, there will be a Big 12 team in there.'' \n- Baylor still has the nation's top offense, piling up 719.7 total yards and 63.8 points a game. The Bears have also won an FBS-best 19 consecutive home games, and play Iowa State on Saturday. So how do you stop the Bears offense? ''I would say dang-near impossible,'' Iowa State coach Paul Rhoads said. \n- TCU and West Virginia both have Saturday off, ahead of their Thursday night game (Oct. 29) in Fort Worth.", "external_links": [], "published": "2015-10-20T00:47:00.000+03:00", "crawled": "2015-10-20T01:05:54.448+03:00", "highlightTitle": ""}