{"organizations": [], "uuid": "9d2acde37ae0246f7a45d3914c3b22eed8037c5f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "wtop.com", "main_image": "http://wtop.com/wp-content/uploads/2015/10/Britain-Jets-Dolphins-Football9.jpeg", "site_section": "http://wtop.com/section/sports/feed/", "section_title": "WTOP » Sections » Sports", "url": "http://wtop.com/nfl/2015/10/dolphins-fall-27-14-to-jets-as-pressure-mounts-on-philbin/", "country": "US", "title": "Dolphins fall 27-14 to Jets as pressure mounts on Philbin", "performance_score": 0, "site": "wtop.com", "participants_count": 1, "title_full": "Dolphins fall 27-14 to Jets as pressure mounts on Philbin", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T22:45:00.000+03:00", "replies_count": 0, "uuid": "9d2acde37ae0246f7a45d3914c3b22eed8037c5f"}, "author": "wtopstaff", "url": "http://wtop.com/nfl/2015/10/dolphins-fall-27-14-to-jets-as-pressure-mounts-on-philbin/", "ord_in_thread": 0, "title": "Dolphins fall 27-14 to Jets as pressure mounts on Philbin", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home » News » Sports » NFL » Dolphins fall 27-14 to… Dolphins fall 27-14 to Jets as pressure mounts on Philbin By SHAWN POGATCHNIK October 4, 2015 3:45 pm New York Jets' Buster Skrine blocks a pass intended for Miami Dolphins' Greg Jennings during the NFL football game between the New York Jets and the Miami Dolphins and at Wembley stadium in London, Sunday, Oct. 4, 2015. (AP Photo/Matt Dunham) \nLONDON (AP) — The Miami Dolphins lost their third straight game in demoralizing fashion Sunday, falling 27-14 to the New York Jets as coach Joe Philbin faced mounting criticism for fielding a team that struggles to run, pass or get sacks. \nPlaying as the official home team in front of more than 83,000 in London’s sold-out Wembley Stadium, the Dolphins (1-3) struggled in virtually every phase of the game as they fell deeper into last place in the AFC East. \nAsked whether he feared for his job, the fourth-year coach replied, “Not at all. I’m worried about getting this team straightened out, fixed, and ready to play the Tennessee Titans.” \nPhilbin said he met with owner Stephen Ross immediately after the defeat and planned to meet again this week, but had no clue about his job security going into Miami’s bye week. \n“We’ll see,” he said. \nWithout a running game or reliable pass protection, besieged Ryan Tannehill struggled with accuracy for much of the game, finishing 19 of 44 for 198 yards with two touchdowns and two interceptions. He was sacked three times, including twice by defensive end Muhammad Wilkerson, as the Jets utilized aggressive blitz packages. \n“We didn’t move the ball like we wanted to, we got behind, and it really opened up their whole blitz package — and it’s an extensive one,” said Tannehill, who radiated frustration and disappointment. “We’re up against the wall right now. … I feel like I’m beating my head against the wall.” \nWhen asked whether he was concerned about Philbin’s possible firing, Tannehill said, “That’s out of my hands and I can’t think about that.” \nThe Dolphins’ biggest plays came on kick returns by Jarvis Landry and on Jets pass interference calls, but the offense repeatedly failed to turn good field position in the second half into points. The Dolphins finished 0 for 12 on third down and, even more painfully, 0 for 4 on fourth down. Jets coach Todd Bowles said he’d never seen a defense shut down the other team like that before. \nMiami’s defense, designed to terrorize opposing quarterbacks with the offseason acquisition of Ndamukong Suh, couldn’t contain Chris Ivory, who ran for a career-high 166 yards on 29 carries and scored a touchdown on the Jets’ opening drive. \nNor could Suh or his teammates sack Ryan Fitzpatrick, who instead finished 16 of 29 for 218 yards and evaded pressure to convert three long third downs using his feet. \nSuh, when asked why the Dolphins had a single sack in their first four games, said the figure didn’t matter. \n“If we had zero sacks, and we were 3-1, I wouldn’t care. At the end of the day statistics don’t win games for you,” said Suh, who refused to answer several questions during a sometimes tense appearance at the podium. \nThe Dolphins ran for just 59 yards on 11 attempts, but Tannehill and Philbin said the team had no choice but to air it out once they had fallen behind by 20 points early in the second half. \nMiami’s first scoring drive in the second quarter came courtesy of two back-to-back interference calls on Jets defensive backs. The drive’s third play involved nifty misdirection as Tannehill faked a screen pass right to Lamar Miller, then pinwheeled and lofted a fadeaway to reserve tight end Jake Stoneburner in the left corner of the end zone. \nThat pulled the Dolphins within 13-7 of the Jets, who then scored two touchdowns on either side of halftime to put the game out of apparent reach at 27-7. \nA 38-yard Zack Bowman interception return and two fine Landry punt returns gave the Dolphins three drives that started in Jets territory — and produced just seven points. \nStarting from the Jets 37 following a 28-yard Landry return, Tannehill completed four straight passes, two each to tight end Jordan Cameron and wide receiver Kenny Stills, who caught a 10-yard pass for his first touchdown as a Dolphin to complete the scoring with 10 minutes left. \nThe Dolphins had a first-and-goal from the 4 with more than six minutes remaining, but failed to score despite getting nine shots at the end zone thanks to Jets penalties. Tannehill’s final fourth-and-9 shot to Landry was intercepted by Darrelle Revis in the end zone as Landry fell on the play. Topics:", "external_links": [], "published": "2015-10-04T22:45:00.000+03:00", "crawled": "2015-10-05T00:04:07.245+03:00", "highlightTitle": ""}