{"organizations": [], "uuid": "32fa558f7a9a7bb16cd201bbe12fbb87cee8876e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fredericknewspost.com", "main_image": "http://bloximages.newyork1.vip.townnews.com/fredericknewspost.com/content/tncms/custom/image/0fa3e2d0-fff4-11e4-89a9-77b204e19fad.jpg?_dc=1432238442", "site_section": "http://www.fredericknewspost.com//search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&c[]=sports,sports/*&f=rss", "section_title": "www.fredericknewspost.com - RSS Results in sports,sports/* of type article", "url": "http://www.fredericknewspost.com/sports/level/high_school/lions-bounce-back-cruise-past-cougars/article_3ef15328-bf79-5dca-b9f6-582b41878bbd.html", "country": "US", "title": "Lions bounce back, cruise past Cougars", "performance_score": 0, "site": "fredericknewspost.com", "participants_count": 1, "title_full": "Lions bounce back, cruise past Cougars", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T08:00:00.000+03:00", "replies_count": 0, "uuid": "32fa558f7a9a7bb16cd201bbe12fbb87cee8876e"}, "author": "John Cannon jcannon@newspost.com", "url": "http://www.fredericknewspost.com/sports/level/high_school/lions-bounce-back-cruise-past-cougars/article_3ef15328-bf79-5dca-b9f6-582b41878bbd.html", "ord_in_thread": 0, "title": "Lions bounce back, cruise past Cougars", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Lions bounce back, cruise past Cougars By John Cannon jcannon@newspost.com 0 \nTHURMONT — Before Friday’s game, Walkersville running backs Ty Littleton and Chad Gleason smacked hands. \nSuch things happen all the time on the sidelines. The only difference was, Gleason was lying on his back at the time while someone worked on his leg. \n“I’ve been having a few injuries with my ankles and stuff,” said Gleason, who didn’t play last week. “This is my first game back. I’ve only played two full games this year.” \nHe put in a full night’s work on Friday. \nGleason rushed for 196 yards and two touchdowns on 30 carries, helping the Lions roll to a 27-0 win over Catoctin. \n“Felt good to get back,” Gleason said. \nHe was even happier to see Walkersville (5-1) chalk up another win after suffering a 7-6 overtime loss to Linganore the previous week. \n“We knew we played our best and we knew we were moving on to the next game,” Gleason said. “We put it all behind us. We don’t need to worry about it anymore.” \nJust like in the Linganore loss, Walkersville’s defense was stout, posting its second straight shutout in regulation and holding the Cougars to 41 offensive yards. \nAnd as usual, Walkersville’s offense relied on its ground game. But unlike last week, Gleason got to contribute in the backfield. \n“He’s fine,” Walkersville coach Joe Polce said. “We rested him up, now he’s ready to go. He had a great game. We’re excited to have him back.” \nGleason scored the game’s first touchdown on a 14-yard run, jumping to avoid a tackle, with 7:39 left in the first quarter. And his 12-yard touchdown run gave the Lions a 20-0 lead with 1:17 left in the third quarter, providing some breathing room. \nMost of the night, Gleason and Littleton alternated carries. Littleton finished with 111 yards on 23 carries. Both backs rank among Frederick County’s rushing leaders, as do Walkersville’s Jacob Wetzel and Tyler Gleason, and Gleason was quick to point out the big holes opened up by his offensive linemen. \n“If you look over the years, our running game has been ridiculous. That’s our strength, definitely,” Chad Gleason said. “And we’re very young, so the future’s very bright.” \nChad Gleason is a junior, while Wetzel, Littleton and Tyler Gleason are sophomores. And two other Lions who rushed for touchdowns on Friday, Christian Policelli and Billy Gant, are also sophomores. \n“Having all those good players, that’s what makes a good team,” Gleason said. “It’s not just about one player or two players.” \nWhen Gleason saw limited action, Wetzel was asked to contribute more. With Gleason back in form, Wetzel got to take a break on Friday. \n“He had been getting a bunch of carries since Chad was out,” Polce said. “We told him to be ready if we needed him, and it worked out that he got to rest tonight.” \nWalkersville piled up 369 rushing yards. \n“They block very well and they play good defense,” Catoctin coach Doug Williams said. “They’re a good team.” \nWalkersville’s defense held the Cougars (3-3) to 17 rushing yards. On Catoctin’s first possession, Walkersville’s Pat Sichette reacted to an option pitch and tackled Bradley Reaver for a 3-yard loss. \nDefenders like Christian Policelli, Zac Saylor, Austin Farinholt and Jacob Yingling made big tackles. Aaron Jahnke made an interception at Catoctin’s 17, setting up a drive that ended with Gleason’s second touchdown. \nWhen asked to describe his defense, Policelli said, “Tough run-stoppers, good pass (defense). We play our hearts out, that’s all there is to it.” Tags", "external_links": [], "published": "2015-10-10T08:00:00.000+03:00", "crawled": "2015-10-10T23:03:48.929+03:00", "highlightTitle": ""}