{"organizations": [], "uuid": "084f47d76160fd33a262f3163d78275d464db098", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kptv.com", "main_image": "http://RAYCOMGROUP.images.worldnow.com/images/9043518_G.jpg", "site_section": "http://kptv.com/category/208630/sports?clienttype=rss", "section_title": "KPTV.com - Sports", "url": "http://www.kptv.com/story/30288356/ca-canceled-wedding-leads-to-meals-for-homeless", "country": "US", "title": "CA: Canceled wedding leads to meals for homeless", "performance_score": 0, "site": "kptv.com", "participants_count": 1, "title_full": "CA: Canceled wedding leads to meals for homeless - KPTV - FOX 12", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T08:35:00.000+03:00", "replies_count": 0, "uuid": "084f47d76160fd33a262f3163d78275d464db098"}, "author": "cbs8", "url": "http://www.kptv.com/story/30288356/ca-canceled-wedding-leads-to-meals-for-homeless", "ord_in_thread": 0, "title": "CA: Canceled wedding leads to meals for homeless", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SACRAMENTO, CA (KCRA/CNN) - The tables were set, food hot out of the oven, and one by one, the guests arrived.\nThese weren’t the men, women and children the Duane family originally planned to host, but they’re happy to do it nonetheless.\nEarlier in the week, the would-be groom got cold feet and called off the wedding. Rather than cancel the $35,000 outing, the bride’s family invited the city’s homeless for a once-in-a-lifetime meal at one of Sacramento’s finest hotels.\n“When I found out Monday that the wedding would not be taking place, it just seemed like, of course this would be something that we would do to give back,” said Kari Duane, mother of the would-be bride.\nThe crowd was appreciative.\n“I think it’s very generous, actually,” said Erika Craycraft, who is homeless and attended the meal. “To lose out on something so important to yourself and then give it to someone else is really giving.”\nMany, including Rashad Abdullah,came with their families, giving their kids a rare night out.\n“when you’re going through a hard time and struggle, for you to get out to do something different and with your family, it was really a blessing,” Abdullah said.\nThe food was similar to what you’d find at the hotel’s four-star restaurant, Grange. There was salad, cauliflower, salmon, even tri-tip beef.  \nWhile full stomachs and smiles were everywhere, the night was still painful for the Duanes. Their 27-year-old daughter chose to stay home.\n“I feel a lot of heartache and heartbreak for her, but I will take away something good from this - I will,” her mother said.\nThe family turned a night that was supposed to be about them into one that took care of others.\nPart of the $35,000 price tag included a non-refundable honeymoon, so mother and daughter will take the trip, instead, to Belize.\nCopyright 2015 KCRA via CNN. All rights reserved.", "external_links": [], "published": "2015-10-18T08:35:00.000+03:00", "crawled": "2015-10-19T14:11:40.059+03:00", "highlightTitle": ""}