{"organizations": [], "uuid": "63ad3a91694a17b29264d1ee6da9693fea3f4a0e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mysanantonio.com", "main_image": "http://www.mysanantonio.com/img/pages/article/opengraph_default.jpg", "site_section": "http://www.mysanantonio.com/rss/feed/mySA-Sports-921.php", "section_title": "mySA Sports", "url": "http://www.mysanantonio.com/sports/pro-sports/cowboys/article/In-return-to-Houston-Johnson-burns-Texans-6560332.php", "country": "US", "title": "In return to Houston Johnson burns Texans", "performance_score": 0, "site": "mysanantonio.com", "participants_count": 1, "title_full": "In return to Houston Johnson burns Texans - San Antonio Express-News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T07:46:00.000+03:00", "replies_count": 0, "uuid": "63ad3a91694a17b29264d1ee6da9693fea3f4a0e"}, "author": "mysanantonio.com", "url": "http://www.mysanantonio.com/sports/pro-sports/cowboys/article/In-return-to-Houston-Johnson-burns-Texans-6560332.php", "ord_in_thread": 0, "title": "In return to Houston Johnson burns Texans", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON — Andre Johnson proved to his former team that he still has plenty left.\nJohnson caught two touchdown passes from Matt Hasselbeck , including one for 2 yards in the fourth quarter, to help the Indianapolis Colts beat the Houston Texans 27-20 on Thursday night.\nReleased by Houston in March after 12 seasons with the team, Johnson had six catches for 77 yards.\nThe Colts (3-2) extended their AFC South winning streak to an NFL-record 16 games.\nBrian Hoyer , who replaced Ryan Mallett for Houston (1-4) in the second quarter, threw a pass up for grabs that was intercepted by Mike Adams with less than 2 minutes left.\nThe 40-year-old Hasselbeck was filling in for Andrew Luck , who missed his second straight game with a shoulder injury. Hasselbeck may not have been 100 percent, either, after missing practice Tuesday with an illness.\nJohnson extended the lead to 27-17 with the 2-yard reception with about 101/2 minutes left. The Texans intercepted Hasselbeck’s pass in the end zone earlier in that drive, but the play was negated because of defensive holding on Eddie Pleasant.\nMallett got the wind knocked out of him on an illegal hit midway through the second quarter and was replaced by Hoyer. Mallett looked to be OK soon after that, but coach Bill O’Brien stuck with Hoyer. He finished with 312 yards passing with two touchdowns. Both of the touchdowns were to rookie Jaelen Strong — one on a desperation pass at the end of the first half — and they came on his first two NFL receptions.\nDeAndre Hopkins had 11 receptions for 169 yards for Houston.\nFoster, who was shaken up in the second quarter but returned after halftime, had 44 yards rushing and 77 yards receiving in his second game back after groin surgery.\nThe Colts opened the second half with a drive capped by Frank Gore ’s 3-yard touchdown that made it 20-10. Gore finished with 98 yards rushing.\nStrong’s second catch and touchdown came on an 11-yard pass by Hoyer to get Houston to 20-17 in the third quarter.\nJohnson entered the game without a catch in the last two games after having just one such game in his entire career in Houston.", "external_links": [], "published": "2015-10-09T07:46:00.000+03:00", "crawled": "2015-10-09T08:36:00.113+03:00", "highlightTitle": ""}