{"organizations": [], "uuid": "cf7ccfacd85277df67c50abe38d1fa74ab08a409", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/motorsports", "section_title": "NASCAR / Motors News, Race Results, Schedule, Standings, Photos, Videos - MSN Sports", "url": "http://www.msn.com/en-us/sports/motorsports/dover-dooms-johnsons-bid-for-seventh-title/ar-AAf6rZU", "country": "US", "title": "Dover dooms Johnson's bid for seventh title", "performance_score": 0, "site": "msn.com", "participants_count": 3, "title_full": "Dover dooms Johnson's bid for seventh title", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 2, "uuid": "15b47215ac5473120fd3dd22e7b526f36475c9bb"}, "author": "Brant James, USA TODAY Sports", "url": "http://www.msn.com/en-us/sports/motorsports/dover-dooms-johnsons-bid-for-seventh-title/ar-AAf6rZU#post-0", "ord_in_thread": 0, "title": "Dover dooms Johnson's bid for seventh title", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Dover dooms Johnson's bid for seventh title USA Today Sports 1 day ago by Brant James, USA TODAY Sports © Brian Lawdermilk, Getty Images Brian Lawdermilk, Getty Images DOVER, Del. — The end of Jimmie Johnson’s bid for a seventh Sprint Cup championship came with a vibration and didn’t last long, much, astonishingly, like his 2015 Chase for the Sprint Cup.\nAdChoices A broken right rear axle seal, a $50 part, had seized, rendering a race car that costs a quantum sum useless until a lengthy repair on Sunday at Dover International Speedway. His title chase was effectively over before slogging the rest of the race to a 41st-place finish that dropped him from fifth in points to 14th and outside the 12-driver field that remains eligible into the next round beginning Saturday at Charlotte Motor Speedway.\n“It definitely hurts and not being at the root cause of the mistake, I guess I’ll sleep a little better but you have this risk of mechanicals,” said Johnson, who had recovered to finish sixth at New Hampshire last week despite sustaining a flat tire mid-race. “You have this risk of flat tires causing an issue. Last week and we were fortunate to rebound from the flat, not have it totally take us out of the running. But it’s racing.”\nJohnson sat in his No. 48 Chevrolet in the garage for an agonizing 38 laps midway through the AAA 400 before returning to chase just a few possible positions and points and needing one of the other 13 drivers not qualified for the second round of the Chase to fall out. It never happened. In finishing tied for his season-worst result, Johnson left Dover eliminated from title contention with Jamie McMurray, Paul Menard and Clint Bowyer.\nJohnson was undone on Lap 104 of 400, forcing him to the garage as crewmen — including crew chief Chad Knaus wielding a jack — made repairs. Johnson, who had been running mid-pack before the failure because on an earlier pit road speeding penalty, rejoined the field last, provisionally holding the 12th in the standings. Kevin Harvick’s win from the 15th points position snared another precious spot ahead of him.\n“Once you’re behind the wall and you get more than one or two (laps) down, it’s out of your hands,” Johnson said on pit road. “And I knew that sitting in there, so I was trying to run through scenarios, Chad updated me a couple times with what needed to happen. And we needed a few big pile-ups to get us back in the thing and I just didn’t see that happening.”\nMcMurray, who advanced to the Chase on points, was squeezed out of the playoffs by Dale Earnhardt Jr. on a tie-breaker, which was based on their result Sunday. Earnhardt Jr. passed McMurray on the last restart and finished third, McMurray fourth. The Chip Ganassi Racing driver said that in finishing 16th in the Chase opener at Chicago and 14th at New Hampshire, his team “just didn’t have a good enough car the first two races.” He finished the first round 13th in the driver standings.\n“I’ve known (Earnhardt) a long time. And you know what? That was a deserving pass he put on to be able to make it through to the next round,” McMurray said. “Our car wasn’t that good on the outside and I didn’t expect anyone else’s to be that good. I know I was better than him the run before, so I just didn’t expect it. And I went through that corner as good as I could. He just got a little bit of a run on me.”\nThough winless, Bowyer had appeared to enter the Chase with momentum that was quickly stemmed at the postseason-opener at Chicagoland Speedway. After finishing an uncompetitive 19th, his team was assessed a 25-point penalty stemming from a post-race inspection failure. Bowyer was then a woeful 26th at New Hampshire, and after an appeal of his penalty was denied this week, he entered this weekend 16th and 39 points out of 12th place. He finished the first round 16th in points, missing the cut by 52 points.\nElimination concludes an eventful week for Bowyer, who now races out his contract with a Michael Waltrip Racing team that will be shuttered next season. Bowyer was announced earlier this week as the heir to Tony Stewart’s No 14 Chevrolet at Stewart-Haas Racing pending his retirement after the 2016 season. He will race a stop-gap campaign with HScott Motorsports next year.\nMenard followed Richard Childress Racing teammate Ryan Newman into the Chase and did almost exactly what he has done all season, finishing 17th at Chicago and 15th at New Hampshire. His average result this season was 16.7 before finishing 25th on Sunday. That wasn’t nearly enough to push him into the second round with fellow non-winner Newman and Jeff Gordon. He is 15th in points, missing the cut by 25 points.\nFollow James on Twitter @brantjames\nGo to MSN Home", "external_links": ["http://www.usatoday.com/sports/", "http://twitter.com/brantjames", "http://go.microsoft.com/fwlink/?LinkID=286759"], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-06T22:05:35.894+03:00", "highlightTitle": ""}