{"organizations": [], "uuid": "7250a5409b08b6f7be326d848e67514892805ec5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theday.com", "main_image": "http://www.theday.com/Assets/images/facebook/day_logo_291.png", "site_section": "http://www.theday.com/section/rss11", "section_title": "The Day RSS Feeds - UConn Sports News", "url": "http://www.theday.com/uconn-sports/20151013/diacos-happy-about-adding-eagles-to-the-schedule", "country": "US", "title": "Diaco's happy about adding Eagles to the schedule", "performance_score": 0, "site": "theday.com", "participants_count": 1, "title_full": "Diaco's happy about adding Eagles to the schedule", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:09:00.000+03:00", "replies_count": 0, "uuid": "7250a5409b08b6f7be326d848e67514892805ec5"}, "author": "GAVIN KEEFE", "url": "http://www.theday.com/uconn-sports/20151013/diacos-happy-about-adding-eagles-to-the-schedule", "ord_in_thread": 0, "title": "Diaco's happy about adding Eagles to the schedule", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Diaco's happy about adding Eagles to the schedule Published October 13. 2015 8:09PM \nStorrs — Coach Bob Diaco heard the reports about UConn and Boston College renewing its New England rivalry. \nDiaco is all for any football game against a regional opponent. \nHe just can't comment on the deal, which reportedly has UConn visiting Boston College next season and hosting the Eagles in November of 2017. The two teams will stage another home and home series in 2022 (at BC) and 2023 (at UConn). \n\"I can't really talk about it because it's not an executed contract,\" Diaco said during his weekly press conference on Tuesday. \nDiaco didn't stop there. \n\"But I will say, like I've said in the past, to play regional teams is awesome,\" Diaco said. \"As many times as we can play a Syracuse, Boston College, Pitt, West Virginia, Penn St., Rutgers, Maryland, these are great games for our fans and our team and for our university community to play.\" \nUConn hasn't faced Boston College on the football field since 2004 and never won a game in the series, going 0-10-2. \nThe icy relationship between the two schools that developed during Big East Conference days apparently has thawed. The Eagles now belong to the Atlantic Coast Conference while the Huskies are in the American Athletic Conference. \nUConn also reached a four-game deal with UMass, according to the Daily Hampshire Gazette. The two New England neighbors will meet at Rentschler Field in 2018 and 2020 and play at Gillette Stadium in Foxborough, Mass., in 2019 and 2021. \nThat series dates back to the old Yankee Conference. The Minutemen hold a 36-34-2 edge overall. \nGaining confidence \nThe Huskies are coming off their first blowout win of the season — a 40-13 rout at Central Florida on Saturday. It also was their first road victory and improved their record to 3-3 overall. That's one more victory than last season. \nThey also had a season high for points and total yards with 433. \nThe lopsided victory reinforced their belief that they're on a positive path. \n\"We were definitely happy with the victory,\" quarterback Bryant Shirreffs said. \"It was exciting to be able to see our work pay off. ... We know how close we are and then to see evidence off that in a game is definitely reinforcing.\" \nDiaco was pleased that he was able to go deep into his roster, giving numerous underclassmen valuable experience. \n\"That is very, very positive for the team...,\" Diaco said. \"That's how you get better and you don't have that dip.\" \nNext up is South Florida (2-3, 0-1), which beat Syracuse, 45-24, on Saturday to end a three-game losing streak. The Bulls visit Rentschler Field for a noon homecoming game on Saturday. \nAt 1-1 in the conference, the Huskies are tied for second place in the East Division with East Carolina. \nNews and notes \nSophomore tailback and kick returner Arkeel Newsome continues to impress. He earned AAC special teams player of the week honors for his performance last week. He returned three kickoffs for 106 yards and finished with 257 all-purpose yards vs. UCF. \"If I was a defender, I wouldn't want to have to tackle Newsome because he seems so shifty and he's so elusive getting out of tackles,\" Shirreffs said. \"It's really exciting to see from my perspective.\" ... With all three of his interceptions in the last three games, red-shirt junior cornerback Jhavon Williams now leads the AAC in that category. \"He's studying a lot, which is great,\" Diaco said. \"So he's going into the games more prepared.\" The Huskies have eight interceptions overall, matching last year's total. ... UConn is ranked first in the AAC in pass defense (186.5 yards per game) and stands second in scoring defense (18.7 points) and total defense (339.2). But the Huskies are 11th in scoring offense at 19.8 and 10th in total offense (323.8 yards). \ng.keefe@theday.com", "external_links": [], "published": "2015-10-14T03:09:00.000+03:00", "crawled": "2015-10-14T03:25:56.302+03:00", "highlightTitle": ""}