{"organizations": ["Gutterson Fieldhouse"], "uuid": "7876cfa2ca8540925dec4657766cd7ac9cc22170", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.burlingtonfreepress.com", "main_image": "http://www.gannett-cdn.com/-mm-/4d36398308bd66f69750d8ebe207168fcc8bc8c8/c=0-128-2541-1564&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/24/Burlington/Burlington/635812819552126567-uscpcent02-6mtb3bsoslhiizcne2n-original.jpg", "site_section": "http://rssfeeds.burlingtonfreepress.com/burlington/uvm", "section_title": "Burlington - UVM Sports", "url": "http://www.burlingtonfreepress.com/story/sports/college/vermont/2015/10/24/north-dakota-sweeps-vermont/74574112/", "country": "US", "title": "No. 1 North Dakota sweeps Vermont", "performance_score": 0, "site": "burlingtonfreepress.com", "participants_count": 0, "title_full": "No. 1 North Dakota sweeps Vermont", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T05:15:00.000+02:00", "replies_count": 0, "uuid": "7876cfa2ca8540925dec4657766cd7ac9cc22170"}, "author": "", "url": "http://www.burlingtonfreepress.com/story/sports/college/vermont/2015/10/24/north-dakota-sweeps-vermont/74574112/", "ord_in_thread": 0, "title": "No. 1 North Dakota sweeps Vermont", "locations": ["North Dakota", "Burlington", "Vermont"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["BRIAN JENKINS", "Anthony Petruzzelli", "Ted Ryan"], "text": "No. 1 North Dakota sweeps Vermont Ted Ryan , Correspondent 11:15 p.m. EDT October 24, 2015 Catamount forward Anthony Petruzzelli (28) takes a shot during the men's hockey game between North Dakota and Vermont at Gutterson Fieldhouse on Friday night October 23, 2015 in Burlington. (Photo: BRIAN JENKINS/ for the FREE PRESS) CONNECT TWEET LINKEDIN COMMENT EMAIL MORE \nWhen it mattered, really mattered, Saturday night at Gutterson Fieldhouse, North Dakota flaunted its superiority by coolly and methodically closing out a 5-2 victory for a sweep of the non-conference hockey series with Vermont. \nFor 40 minutes, that had not been the situation despite UND’s 3-2 lead. Yet in the third, when the Catamounts should have been primed to forge the upset of the country’s No. 1 team, North Dakota smothered UVM defensively and preyed on UVM errors for the final goal spread. \n“Once they got the two-goal lead in the third, they played extremely well,” said UVM head coach Kevin Sneddon. “We tried to press and do things that we’re just not capable of doing.” \nHeld in check in every way during Friday’s 3-0 loss, the Catamounts spent two periods Saturday carrying the game to UND goalie Matt Hrynkiw (27 saves). They outshot the invaders 25-20 in that time but their only reward was a tie score at 2 that lasted 24 seconds. \n“It’s hard; it’s hard for our guys when they played so much better tonight than they did (Friday) in a lot of ways. It certainly wasn’t good enough,” Sneddon said. “We’ve got try to pull the positives from it. We have league play coming up and the past two weekends were tough on our guys but I think in the long run, it will help us strengthen and be better down the stretch.” \nThe loss concluded UVM’s season-opening 5-game confrontation with three of the nation’s Top 10 teams, leaving the Catamounts with a four-game losing streak, a 1-4-0 record overall and an 0-4-0 home record. \n“It doesn’t make 1-and-4 sound any better or any easier, but I don’t think that anybody else has played as tough a schedule as we have,” said Sneddon, whose Catamounts open Hockey East competition at Northeastern on Thursday with a return game Saturday at Gutterson. \nSaturday, the Catamounts displayed the necessary intensity and desire from the game’s early minutes. They tied the game at 1 before falling behind 2-1 through one period. Midway through the second, Jarrid Privitera’s second rebound goal of the game knotted the score at 2 at 9:39, but 24 seconds later, Christian Wolatin tipped the puck past UVM goalie Mike Santaguida (31 saves). \nBut any momentum UVM carried through the rest of the second dissipated early in the third and the game quickly slipped beyond the Catamounts’ grasp when Bryn Chyzyk cashed in UND’s fourth goal off a Vermont turnover. At the same time, UVM’s offense sputtered with one shot in the first 13 minutes. \n“We played hard. We won races to the puck. We used our speed,” Sneddon said. “We didn’t let them always dictate the pace of the play. We were proactive versus reactive. \n“Those third and fourth goals in particular were too easy for them,” Sneddon said. “The deflection (on Wonanin’s goal) was nice but the puck should never have been in the zone at that point. We made a great breakout pass and bobbled the puck coming out and one of our players loses a stick. Next thing you know, we’re scrambling and the kid makes a great play and then the fourth goal was just a real ugly play by our guys.” \nSneddon pointed to Santaguida, who had a career-high 39 saves Friday, as UVM’s best player throughout the weekend. \n“He played great both nights. He was peppered all weekend. We can’t fault him at all,” Sneddon said. \nSneddon also singled out Privitera, saying, “He’s one of the smallest guys in the locker room and he’s scoring rebound goals every weekend because he’s going hard to the net. Let’s learn from him. He’s playing with the heart of a lion right now. \n“We’re a little wounded at the minute. Confidence is down; pride is down,” Sneddon said. “We’re going to have to get our guys going this week.” \nThis story was originally published Oct. 24, 2015. Correspondent Ted Ryan covers UVM hockey for The Burlington Free Press. Contact him at TedRyanVT@aol.com and follow him on Twitter at @TedRyanVT. Read or Share this story: http://bfpne.ws/1S3BdVC TOP VIDEOS", "external_links": [], "published": "2015-10-25T05:15:00.000+02:00", "crawled": "2015-10-25T05:50:52.687+02:00", "highlightTitle": ""}