{"organizations": [], "uuid": "bc956937222c4c556904e7b33a4044689451e044", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.torontosun.com", "main_image": "http://storage.torontosun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297762043479_ORIGINAL.jpg?quality=80&size=100x", "site_section": "http://www.torontosun.com/sports/rss.xml", "section_title": "Top Sports stories", "url": "http://www.torontosun.com/2015/10/19/kevin-pillar-does-his-best-devon-white-impression", "country": "CA", "title": "Kevin Pillar does his best Devon White impression", "performance_score": 0, "site": "torontosun.com", "participants_count": 0, "title_full": "Kevin Pillar does his best Devon White impression", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T06:43:00.000+03:00", "replies_count": 0, "uuid": "bc956937222c4c556904e7b33a4044689451e044"}, "author": "", "url": "http://www.torontosun.com/2015/10/19/kevin-pillar-does-his-best-devon-white-impression", "ord_in_thread": 0, "title": "Kevin Pillar does his best Devon White impression", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Devon White", "Kevin Pillar"], "text": "For you kids who never saw Devon White glide into the gap, Kevin Pillar has him beat. \nAbout 200 dives to nil. \nAsked once why he never dove, White answered “because I don’t have to.” \nThe seven-time gold glove winner had a quick shot-from-cannons acceleration burst so that he went 0-to-maximum speed within a stride, roaming either to his left or his right. \nOr racing in, or back to the wall as he did in Game 3 of the 1992 World Series. \nBack before high-def TV and replay, there was only an umpire’s naked eye. \nWhite, known as a fine defensive centre fielder with three World Series rings, threw out the ceremonial first pitch Monday night before Game 3 of the best-of-seven American League Championship Series. He also should be known as the “Man who made the catch for only the second triple play in World Series history.” \nThe Atlanta Braves had Deion Sanders at second and Terry Pendleton at first with none out. David Justice turned around a Juan Guzman pitch with a bullet to dead centre. A double? A three-run homer? \nWhite wheeled, sprinted to the wall, leapt at the very last second and collected the ball backhanded a split-second before he thundered into the padding. \nIt was as if he’d jumped with Velcro on the front of his uniform onto the padding of the centre field wall, his blue No. 25 pasted flat against the wall. \nWhen White came down, he wheeled and threw to Robbie Alomar. Pendleton had already passed Sanders at second, making him an automatic out. Still, Alomar threw to first, tempting Sanders to head for third. He got into a rundown with Kelly Gruber, but was ruled safe at second by second base ump Bob Davidson. \nBack then there wasn’t any replay, but there was the Toronto Sun. \nThe next day before working Game 4, Davidson took a look at the front page and admitted he missed the tag. \n“When I first called the play, I thought I had it 100% right,” Davidson told our Bill Lankhof. “It was right there, right in front of me.” \nDavidson said “Gruber told me right away that he had gotten his (Sanders’) heel. I thought I was correct at first, but when I saw the picture I had to admit I probably missed it.” \nWhite batted .231 as the Jays beat the Braves and .292 with a homer and seven RBIs the next year as they beat the Philies. And he hit .242 with the 1997 Florida Marlins who won the Series. Born in Kingston, Jamaica, raised in Washington Heights, N.Y., he hit .296 with three homers and 20 RBIs in 49 post-season games. \n“I’m not lying,” White said of his 1992 catch. “I’ve made better, but not one that was more important. The situation makes it extra special.” \nCleveland Indians second baseman Bill Wambsganss turned an unassisted triple play Game 5 of the 1920 Series in an 8-1 win over the Brooklyn Robins. \nWhite threw a Kingston strike to Mark Buehrle to get proceedings underway. \nTRICKY STUFF \nTalk of that Game 5 ALDS Russell Martin toss to Aaron Sanchez won’t go away. Martin caught the pitch from Sanchez, looked Texas Rangers runner Rougned Odor back to third, went down on his right knee and flipped the ball to the mound as he has done time and again in his 10,574 previous innings catching in the majors. \nThe ball hit Shin-Soo Choo’s bat and trickled up the third-base line as Odor ran home and plate ump Dale Scott waved off the play. \nOut came Rangers manager Jeff Banister to argue, the umps huddled and the tie-breaking run was waved home. This is where fan John Randolph picks up the story. He was seated two seats behind the Rangers dugout near the eight-man Rangers front-office delegation. \n“Banister looked up walking off and winked to them,” Randolph said. “He had the biggest smirk on his face. I may have grey hair but this I’m 1,000% sure was a pre-set play.” \nAdding to the intrigue is the fact that both Martin and Banister were together with the Pittsburgh Pirates last year and Banister was the catching coach. \n“I don’t believe it’s true,” Martin said. “That has never happened to me before. (Banister) never warned me about guarding against it.” \nSo, there you have it conspiracy theorists. \n“All I know that the Baseball Gods fixed things,” Randolph said. The Rangers clanked the first three ground balls, Josh Donaldson knocked in a run and Jose Bautista hit a three-run homer. \nTOP QUESTIONS IN K.C. \nThe most oft-asked queries in Missouri were not “how does Marco Estrada do it?” as was the case in Arlington, Tex., but rather 1. “When did Toronto start busing in fans from Buffalo Bills games?” ... 2. “Why isn’t Buehrle on the roster against all those free-swinging Royals hitters?” Buehrle was 1-0 with a 3.21 in two starts against K.C. and is 26-12 with a 3.54 ERA in 54 starts ... 3. “No way a Canadian would throw cold beer away, what country were those fans from?” The uproar was over Odor scoring as Martin’s toss to the mound hit Choo’s bat. \nMEMORIES OF 1985 \nDue to a hotel shortage in K.C. for the 1985 St. Louis Cardinals-Royals World Series, the media was housed at a Holiday Inn in Lenexa, Kan. The mayor, a character along the lines of former Philadelphia mayor Ed Rendell, lugged suitcases from the bus to the front desk. He even declared an official Jay Horwitz Day in honour of the New York Mets crack P.R. whiz, who was working the series. \nMY FAVORITE NETWORK \nJoe Magrane on MLB Network said that Martin’s pitch calling in the seventh inning of Game 2 had too much of a pattern to it, especially left-hander David Price throwing change ups to left-handed hitters Eric Hosmer and Mike Moustakas — both delivered run-scoring singles ... Former Colorado Rockies general manager Dan O’Dowd said Bautista’s answers to the pop up Ryan Goins pulled away on were a sign of bad feelings in the Jays clubhouse ... Magrane said after Bautista’s bat flip: “Character is defined by how you handle adversity. Not when you’re flipping the bat 50 feet in the air.” ... Bautista tweeted, “My thoughts on Magrane’s comments: Prejudiced, distorted, inequitable and irresponsible.” \nNOT JON LESTER \nPrice didn’t throw over to first base once in his past seven starts according to scouts. And only five times since the all-star break. “Why would he?” a National League scout said. “He’s so quick to the plate and Martin gets rid of the ball so quickly.” \nWhen Hosmer broke for second in the seventh inning of the Royals Game 2, five-run rally with Kendrys Morales at the plate, it was a rarity. No one has attempted to steal against Price since Sept. 28, 2014, according to Sports Illustrated’s Tom Verducci. \nWhen Morales made contact, there wasn’t any stolen base attempt as Morales was thrown out at first by shortstop Troy Tulowitzki. \nBOURN, SWISHER, MURPHY \nWhat do the names Michael Bourn, Nick Swisher and David Murphy have to do with the future of the Blue Jays? \nWell general manager Chris Antonetti and president Mark Shapiro brought all three to the Cleveland Indians. Bourn siged a four-year $48-million deal and Swisher a four-year $56-million deal with the Indians leading into 2013. \nThe next year Murphy was signed to a two-year $12-million deal. \nMurphy was sent to the Los Angeles Angels for minor leaguer Eric Stamets on July 28 after playing 213 games with the Indians. \nOn Aug. 7, Swisher, Bourn and cash were sent to the Atlanta Braves for Chris Johnson. Bourn played 331 games and Swisher played 272. \nAnd there is still no word on whether GM Alex Anthopoulos retains his job as Wednesday marks 50 days since Rogers Communications hired Shapiro as its new president. \nSTARS IN THE CROWD \nHall of Famer George Brett, who helped K.C. rally from a 3-1 deficit in the 1985 ALCS. Toronto won the first two games at Exhibition Stadium before Doyle Alexander decided to go against manager Bobby Cox’s orders and challenge Brett in Game 3. Brett went 4-for-4 with three RBIs and two homers ... Tom Gage, 2015, J.G. Taylor Spink award winner, covering the series like a tarp for The Sporting News. Gage used to work for the Detroit News and has a summer home in Kingsville, Ont. ... Toronto Raptors all-star DeMar DeRozan. Sponsored Links", "external_links": [], "published": "2015-10-20T06:43:00.000+03:00", "crawled": "2015-10-20T06:54:12.118+03:00", "highlightTitle": ""}