{"organizations": [], "uuid": "cc5a7a93dde0dae5d4e318413add023429cadacb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/ncaafb", "section_title": "NCAA FB News, Scores, Schedule, Standings, Stats, Photos, Videos - Football - MSN Sports", "url": "http://www.msn.com/en-us/sports/ncaafb/where-does-usc-football-go-from-here-after-firing-sarkisian/ar-AAfpWa9", "country": "US", "title": "Where Does USC Football Go from Here After Firing Sarkisian?", "performance_score": 0, "site": "msn.com", "participants_count": 3, "title_full": "Where Does USC Football Go from Here After Firing Sarkisian?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 2, "uuid": "cc5a7a93dde0dae5d4e318413add023429cadacb"}, "author": "Bryan Fischer", "url": "http://www.msn.com/en-us/sports/ncaafb/where-does-usc-football-go-from-here-after-firing-sarkisian/ar-AAfpWa9", "ord_in_thread": 0, "title": "Where Does USC Football Go from Here After Firing Sarkisian?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Where Does USC Football Go from Here After Firing Sarkisian? Bleacher Report 20 hrs ago Bryan Fischer < PREVIOUS SLIDE SLIDE 1 of 3 NEXT SLIDE > © Provided by Bleacher Report As it did elsewhere around the country, the sun rose in Los Angeles on Tuesday morning everywhere from the San Gabriel Mountains to the South Bay.\nAdChoices The sun and the sky were still there. The only abnormal thing seemed to be the unusually high temperatures in the area, which sent Angelinos on frantic searches for air conditioning.\nFor USC fans who had been worried what the next sunrise would bring, Tuesday morning represented something new: a chance to look forward for once.\nAfter an abrupt end to the Steve Sarkisian era, the Trojans football team finds itself at yet another crossroads in a half-decade full of them.\nWhere does the storied program go from here, though?\nThe first step comes Saturday. If there is anything USC needs at this time, it's a win on the field.\nThe Trojans will fly to South Bend, Indiana, later this week and try to channel their frustrations into upsetting their fierce rivals. They have the talent to win, and they very likely have the will to win, too. While they may not have the coaching to beat Notre Dame, they can make up for that with the other two.\nAnd make no mistake: This USC squad that was picked by many to win the rough-and-tough Pac-12 could certainly beat an Irish team that has suffered more key injuries than just about any program in the country. If Virginia can push Notre Dame to the brink, USC can do the same.\nIn a season of disarray, getting to 1-0 in a new era comes first and foremost.\nAfter that, however, and especially as the calendar turns from October to November, the Trojans are going to have to figure out how to move on from a five-year period in which just about everything that could have gone wrong did.\nIt's a laundry list nobody in cardinal and gold is proud of: the worst NCAA sanctions since SMU, four head coaches (five if you count current interim Clay Helton twice), firing one of those coaches at the airport, a scandal involving a lying team captain, and, oh yeah, five seasons of disappointing finishes on the field despite a wealth of talent.\nUSC has nowhere to go but up, so long as it can stop being a daily telenovela.\nThe most pressing order of business comes at the top. Athletics director Pat Haden's first job is to save his own. Alumni, fans and, most importantly, boosters are none too pleased with him, and Haden's once-sterling reputation has taken a significant hit with the hiring and firing of Sarkisian.\nIt will take a lot to force Haden out, so even with the recent events hanging over Heritage Hall, it's doubtful he will be pushed from his post. As a favored son of Troy who as a player was responsible for some of the team's greatest accomplishments, Haden isn't likely to leave until he decides he cannot do the job.\nThat time does not appear to be now.\n\"I love this place,\" Haden said Tuesday at a press conference. \"I know a lot of people are questioning my leadership, but I think there have been a lot of great things that have happened here in the past five years.\n\"I believe our future is bright.\"\nHaden enjoys the support of the school's president but will have to work overtime to convince others he's still qualified to pick the Trojans' next head coach.\n\"Pat Haden has been doing an outstanding job in leading Trojan Athletics in the past five years, and I want to take this opportunity to reiterate my unwavering support for him,\" USC President Max Nikias said in a statement released Tuesday. \"I look forward to working with Pat Haden as our USC AD for many years to come.\"\nOnce Haden's footing is more secure, the next step may be to bring in an outsider to oversee the football program. As the head of a sprawling, multimillion dollar athletic department, Haden's focus is often elsewhere, so upon taking the job he installed his best friend, former receiver (and son of the legendary head coach with the same name) J.K. McKay, as senior associate athletic director for football.\nWhile Haden has taken the lion's share of the blame—as he should—for the state of affairs at USC, the Kiffin saga(s) and Sarkisian incident(s) happened under McKay's watch, too. McKay is a sharp individual, but perhaps the athletic director's best friend is not the right person to oversee the biggest sport on campus.\nFinding an outsider who will say no to bad ideas while adding a dose of common sense would be beneficial to all, especially the man at the top.\nThen it's time to turn the program's attention to finding its next head coach.\n\"This is an inexact science,\" Haden said. \"But again, I own (getting the Sarkisian hire) wrong.\"\nTo say this is an important hire would be understating the obvious. The Trojans need some (any?) sort of stability after the turmoil of the past few years, but whoever is hired will still be taking over a top-five program.\nWith players like Adoree' Jackson and JuJu Smith-Schuster coming back, USC is built to win in 2016.\nHaden opted to try to recreate the success of the Pete Carroll era with his first hire, but we all saw that Lane Kiffin 2.0 turned out to be...Lane Kiffin 2.0. If a potential candidate has ties to Carroll, the Trojans need to eliminate him by default.\nSorry, the third time will not be the charm for USC. That means passing on a triumphant Ed Orgeron return.\nInstead, the Trojans have to figure out what the program needs to become. For example, ruling a candidate out because he runs a spread or uptempo offense would be foolish and unwise.\nChip Kelly's name will come up constantly over the coming months, but he's not returning to college football anytime soon, nor would the USC brass, especially Haden, even consider hiring him. Sure, Kelly would prove successful right away in Los Angeles, but if he's not coming and the Trojans don't want to hire him, it's not happening.\nIf Haden does want to go back to any well, going after a coach inside the Pac-12 might be a good idea. Utah's Kyle Whittingham will be a hot name connected to the search and would bring a winning credibility, along with the much-needed tough attitude the program has been lacking. He would have to adjust to the media environment in Los Angeles, but it's nothing the longtime head coach couldn't handle.\nWhile Whittingham has been a lifer in the Beehive State and his family is ensconced in Salt Lake City, tensions between him and his athletic director have run high in recent years. Plus, two decades at one school is a lot for anybody. It makes sense on both sides, but it remains to be seen if Haden even looks in Whittingham's direction.\nCrosstown rival Jim Mora's name will come up, and some are even bandying about Notre Dame's Brian Kelly . While they may not be able to win a national title at their current stops, one can see either winning one at USC. But that might not be enough to lure them away.\nNFL head coaches with USC ties will be discussed as well. That means the St. Louis Rams' Jeff Fisher and Oakland Raiders' Jack Del Rio. Perhaps if Haden had gone after those two prior to hiring Sarkisian, it would have made sense, but not now. An NFL attitude is the last thing the program needs, even if some boosters pine for those big names.\nCall Bob Stoops to see if he's interested in a change of scenery from Norman, Oklahoma. Texas A&M's Kevin Sumlin would be the perfect hire, but it's doubtful he'd leave College Station for another college job. Mike Gundy might finally be fed up enough with the drama around Oklahoma State to pull the trigger on another job, but it will still be tough to pry him from his alma mater.\nRealistically, three coaches could be in play for the Trojans.\nDan Mullen makes a lot of sense. He's an offensive mind who took Mississippi State—Mississippi State!—to No. 1 in the country last year. He has six-plus years of head coaching experience at an SEC program and possesses the personality to handle the USC job.\nIf Haden wants an up-and-comer, Memphis' Justin Fuente fits the bill. He took one of the worst programs in all of FBS and turned it into a winner. His work at TCU with Andy Dalton should not go unnoticed either.\nLast but not least, Houston's Tom Herman has only been a head coach for five games, but his attitude, acumen and dedication to physicality in the trenches line up perfectly with the job at hand in Los Angeles.\nUSC can move on from all this adversity. It can find a good head coach and remain a powerhouse program in college football like it has for decades.\nOn Wednesday, the sun rose again in Los Angeles. For the Trojans, it provided yet another opportunity to move forward, put this tumultuous era behind them and live up to their motto to fight on.\nBryan Fischer is a national college football columnist at Bleacher Report. You can follow him on Twitter at @BryanDFischer .\nGo to MSN Home", "external_links": ["http://www.sltrib.com/sports/1992101-155/utah-football-sources-say-growing-rift?fullpage=1", "http://bleacherreport.com/bob-stoops", "http://www.usctrojans.com/blog/2015/10/sarkisian-terminated-as-usc-football-coach.html", "http://bleacherreport.com/", "https://w.graphiq.com/w/gXiQZ1C9w5T?data-mcuid=7d00c4a52b&data-mccampaign=564835ba62", "http://www.ocolly.com/sports/article_fb5106a2-7c20-11e4-8e1e-2359d0614a26.html", "http://www.usctrojans.com/blog/2015/10/nikias-supports-haden.html", "http://bleacherreport.com/lane-kiffin", "http://www.twitter.com/bryandfischer", "http://bleacherreport.com/brian-kelly", "http://go.microsoft.com/fwlink/?LinkID=286759"], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-14T23:14:23.115+03:00", "highlightTitle": ""}