{"organizations": [], "uuid": "380ba83b42062b8df52fce05300e99c167b22346", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.northjersey.com", "main_image": "http://www.northjersey.com:80/polopoly_fs/1.1434908!/fileImage/httpImage/nickgarciafile101715.JPG", "site_section": "http://www.northjersey.com/cmlink/sports-rss.rss#", "section_title": "Sports News on NorthJersey.com", "url": "http://www.northjersey.com/sports/h-s-football-roundup-nick-garcia-pascack-hills-too-much-for-dumont-1.1434907", "country": "US", "title": "H.S. football roundup: Nick Garcia, Pascack Hills too much for Dumont - Sports", "performance_score": 0, "site": "northjersey.com", "participants_count": 1, "title_full": "H.S. football roundup: Nick Garcia, Pascack Hills too much for Dumont - Sports - NorthJersey.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T03:48:00.000+03:00", "replies_count": 0, "uuid": "380ba83b42062b8df52fce05300e99c167b22346"}, "author": "FROM STAFF REPORTS |", "url": "http://www.northjersey.com/sports/h-s-football-roundup-nick-garcia-pascack-hills-too-much-for-dumont-1.1434907", "ord_in_thread": 0, "title": "H.S. football roundup: Nick Garcia, Pascack Hills too much for Dumont - Sports", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Quarterback Nick Garcia carried 17 times for 202 yards and three touchdowns as Pascack Hills bounced back from an early deficit to defeat Dumont, 28-7, in a Big North football game Friday night at Montvale.\nBuy this photo Pascack Hills’ Nick Garcia scored on runs of 40, 3 and 39 yards in Friday’s win over Dumont. Garcia scored on runs of 40, 3 and 39 yards. Christian Piantino had two interceptions for the Cowboys (4-2).\nDan Feliciano caught a 7-yard TD pass from Sean McCabe as the Huskies (2-4) took a 7-0 lead after one quarter.\nRAMSEY 28, RIDGEFIELD PARK 20 (at Ridgefield Park) — Mario Ferraro and Thomas Feehan combined for 150 yards and three touchdowns on 27 carries to lift the Rams (4-2) over the Scarlets (5-2). Feehan also completed 9 of 14 passes for 156 yards.\nHACKENSACK 26, FAIR LAWN 0 (at Hackensack) — Tommy Smith carried three times for 109 yards and a touchdown to lead the Comets (3-2) by the Cutters (1-6).\nWESTWOOD 41, FORT LEE 13 (at Washington Township) — Steele Lombardi completed 12 of 21 passes for 168 yards and two touchdowns, and ran for a 1-yard TD to lead the Cardinals (3-3) by the Bridgemen (1-5).\nWAYNE VALLEY 41, NORTHERN HIGHLANDS 13 (at Allendale) — Will Kearney had 137 yards and a touchdown on only seven carries as the Indians (6-0) jumped out to a 34-0 lead over the Highlanders (2-4).\nRIVER DELL 57, DWIGHT MORROW 24 (at Oradell) — Dylan Connolly (16 carries, 204 yards, four TDs) was one of three Golden Hawks (7-0) to top 100 yards on the ground. Alec Lanza rushed for 124 yards and two TDs on 12 carries, and Charlie Connell had 102 yards and two scores on 14 attempts.\nAnthony Jones threw TD passes of 11, 68 and 68 yards for the Maroon Raiders (1-5). Quanzie Lumsden caught an 11-yard TD pass and returned the second-half kickoff 86 yards for a Dwight Morrow score.\nMAHWAH 49, CLIFFSIDE PARK 0 (at Mahwah) — James Ciliento threw three touchdown passes and returned an interception 48 yards for a score to power the Thunderbirds (6-0) over the Red Raiders (0-6). Mahwah also got defensive touchdowns from Justin Grippo (22-yard fumble return) and Joe Chizmadia (recovered fumble in end zone).\nNJIC \nSECAUCUS 19, NORTH ARLINGTON 18 (at Secaucus) — Evander Pons’ 1-yard touchdown run with three seconds to go helped lift the Patriots (1-5). Pons finished with 187 yards and two touchdowns on 38 carries.\nMichael Manzo-Lewis threw a 5-yard TD pass to Timothy Ford and ran for a 30-yard TD for the Vikings (2-4).\nWEEHAWKEN 32, WALLINGTON 15 (at Wallington) — Joan Andujar rushed for 218 yards and four touchdowns on 33 carries to power the Indians (4-2).\nNEW MILFORD 33, HARRISON 14 (at New Milford) — Christian Correa had 223 yards and a touchdown on 22 rushes, and sophomore quarterback Ryan Picinic completed 7 of 13 passes for 106 yards and three TDs in his first start for the Knights (3-3). Justice Witowski had five receptions for 85 yards and two scores, and Jhari Rogers led New Milford’s defense with 10 tackles. Mike O’Donnell ran for a 1-yard score and threw a 5-yard TD pass for the Blue Tide (1-5).\nRUTHERFORD 47, ELMWOOD PARK 0 (at Rutherford) — Tom Reid had touchdown receptions of 14, 16 and 47 yards from Nick Birchby as the Bulldogs (6-0) rolled by the Crusaders (0-6). Birchby also tossed a 35-yard TD pass to Laris Mulic, and Johnny Mendez scored on runs of 9 and 21 yards.\nNJAC \nPEQUANNOCK 20, KINNELON 7 (at Pequannock) — Tommy Crooks had touchdown runs of 15 and 7 yards, and Sean Klimek added a 10-yard TD rush as the Golden Panthers (5-1) jumped out to a 20-0 lead. Chris Hausler ran for a 1-yard score for the Colts (0-6).\nBUTLER 34, HOPATCONG 13 (at Butler) — Dan Castiglia caught six passes for 166 yards and three touchdowns and ran for 35 yards and a score on eight carries to led lead the Bulldogs (4-2).\nHCIL \nNORTH BERGEN 43, KEARNY 0 (at North Bergen) — Nathaniel Zamot had touchdown runs of 13 and 78 yards, and returned a fumble 28 yards for a score, all in the third quarter, as the Bruins (3-3) romped.\nNONCONFERENCE \nDePAUL 21, POLY PREP 0 (at New York) — Nasir Hooker and Kareem Walker each rushed for a touchdown, and Hasise Dubois caught a 15-yard TD pass as the Spartans (2-4) snapped a four-game losing streak.", "external_links": [], "published": "2015-10-17T03:48:00.000+03:00", "crawled": "2015-10-17T08:33:46.490+03:00", "highlightTitle": ""}