{"organizations": [], "uuid": "1abf4bace7a1bb07141c1a9f882a6078ca81d3c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtontimes.com", "main_image": "http://media.washtimes.com.s3.amazonaws.com/media/image/2015/10/06/2ebbfe38e806072c840f6a7067001e8d.jpg", "site_section": "http://www.washingtontimes.com/rss/headlines/sports/", "section_title": "www.washingtontimes.com stories: Sports", "url": "http://www.washingtontimes.com/news/2015/oct/6/scott-has-busy-finish-to-year-and-maybe-an-early-s/", "country": "US", "title": "Scott has busy finish to year, and maybe an early start", "performance_score": 0, "site": "washingtontimes.com", "participants_count": 1, "title_full": "Scott has busy finish to year, and maybe an early start", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T12:18:00.000+03:00", "replies_count": 0, "uuid": "1abf4bace7a1bb07141c1a9f882a6078ca81d3c9"}, "author": "DOUG FERGUSON", "url": "http://www.washingtontimes.com/news/2015/oct/6/scott-has-busy-finish-to-year-and-maybe-an-early-s/", "ord_in_thread": 0, "title": "Scott has busy finish to year, and maybe an early start", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sports Scott has busy finish to year, and maybe an early start International team player Charl Schwartzel of South Africa, right, talks with his teammate Adam Scott of Australia during a practice round ahead of the Presidents Cup golf tournament at Jack Nicklaus Golf Club Korea in Incheon, South Korea, Tuesday, Oct. ... more > By DOUG FERGUSON -   \nINCHEON, South Korea (AP) - With three months left in the year, Adam Scott is just getting warmed up. \nThe Presidents Cup is the start of a busy stretch for the 35-year-old Australian, who will be playing seven of the next nine weeks in six countries on three continents, all but one of them counting toward the world ranking. \nThe biggest change for Scott is that two of them count toward the FedEx Cup. \nScott didn’t play his first tournament this year until the Cadillac Championship at Doral in March. He played the HSBC Champions the previous fall (tie for 12th) and with his slow start in America, never was a factor in the FedEx Cup. He started the playoffs at No. 94, missed the cut at The Barclays and his season was over. \nScott will leave the Presidents Cup and play the Japan Open, and then picked up two PGA Tour starts by playing the CIMB Classic in Malaysia and the HSBC Champions in Shanghai. He then heads home for the Australian Masters and Australian Open before returning to his other home, the Bahamas, for the Hero World Challenge. \n“There’s no doubt you’re rewarded in the FedEx Cup by playing more,” Scott said. “I was surprised by my FedEx Cup number when I was out and my money rank - 67 (money list) and 106 (FedEx Cup). That’s a big difference. But that’s the way it is. The answer is always to play better, and I didn’t. But look, I certainly see it as a positive to go to CIMB and HSBC and start quickly. Then I don’t feel like I’ve given up the rest of the fall to the guys.” \nAnd then he takes his big winter break? Not necessarily. \n“I’m not discouraged by this year, but I sat back and had to watch everybody play well after playing so well myself the last few years,” he said. “I want to make sure I’m in it by April, so I think there will be less of a break.” \nWhile his schedule is not set, Scott said he might play the Sony Open in Honolulu on his way back from Australia. He also plans to play in either the Northern Trust Open - he said Riviera is “my favorite track on tour” - or the Honda Classic. \nThat would give him an additional three starts compared with what he played last season on the PGA Tour. \n___ \nRICKIE’S TATTOO: Rickie Fowler was sporting a new tattoo at the Presidents Cup packed with some special meaning. \nIt’s nothing more than the outline of a block “G” under his left elbow. And no, it doesn’t stand for “golf.” \nFowler added the tattoo in support of Georgia Veach, the daughter of Seattle-based pastor Chad Veach and his wife Julia. Georgia was 4 months old when she was diagnosed with lissencephaly, a rare brain disorder characterized by the absence of folds in the cerebral cortex. It also is known as “smooth brain.” \nHe got to know Veach through Judah Smith, also at The City Church in Seattle, who also is friends with Bubba Watson.", "external_links": [], "published": "2015-10-06T12:18:00.000+03:00", "crawled": "2015-10-06T14:12:45.142+03:00", "highlightTitle": ""}