{"organizations": [], "uuid": "1c3d8de90b474a3543545919511811367c43609d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266381/sports-general", "section_title": "Sports: General - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30319122/skycoach-announced-that-it-now-provides-custom-networking-set-ups-for-instant-replay-solution", "country": "US", "title": "SkyCoach Announced That It Now Provides Custom Networking Set ups for Instant Replay Solution", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "SkyCoach Announced That It Now Provides Custom Networking Set ups for Instant Replay Solution - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T00:11:00.000+03:00", "replies_count": 0, "uuid": "1c3d8de90b474a3543545919511811367c43609d"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30319122/skycoach-announced-that-it-now-provides-custom-networking-set-ups-for-instant-replay-solution", "ord_in_thread": 0, "title": "SkyCoach Announced That It Now Provides Custom Networking Set ups for Instant Replay Solution", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SkyCoach announced today that it now provides custom networking set ups to ensure that every team's needs are met, including West Monroe, who desired to film an end zone view from atop of their scoreboard. West Monroe put in one of the largest high school scoreboards in the nation at their football field; however, the custom view that it is giving them for SkyCoach, their sideline instant replay solution, is the real game changer.\nShreveport, LA (PRWEB) October 21, 2015\nSkyCoach, the market leader in high school instant replay, today announced their offering of custom networking set ups to complement their instant replay product. West Monroe High School in Louisiana made news last year with their amazing new scoreboard. One of the lesser known benefits of the new scoreboard is the recording platform at the top. This platform atop the scoreboard provides the West Monroe football team a totally unique end zone view.\nSkyCoach helps West Monroe take advantage of this game changing view during their games. West Monroe began using the SkyCoach cloud version during the 2014 football season. This year, West Monroe upgraded to the SkyCoach No Internet Kit which is a portable closed network optimized for football stadiums.\nWest Monroe’s end zone setup was not your typical tripod set up just behind the end zone. Trey Long, the team video coordinator, says, “We needed Wi-Fi access to the SkyCoach network from on top of our scoreboard. I called SkyCoach, and they immediately knew what to do. I called on Monday, and we were ready to film before Friday.” SkyCoach created a custom networking set up that modified the \"out of the box\" No Internet Kit. \"We realized that there is no one size fits all solution so we decided to offer custom set ups to meet the needs of any team, regardless of the scenario,\" says Keith Simpson, SkyCoach CIO.\nThe SkyCoach instant replay system allows West Monroe to record videos from the top of their scoreboard, and within a couple of seconds, the videos are available for review in the press box as well as on the sideline.\n“SkyCoach is a very good product. It makes us better!” says Coach Jerry Arledge.\nSkyCoach is changing the way high school football games are coached. Whiteboards are being replaced with TVs, and SkyCoach is leading the way! You can learn more about this revolutionary product at http://www.myskycoach.com\n //www.prweb.com/releases/2015/10/prweb13034466.htm\n ", "external_links": ["http://www.prweb.com/releases/2015/10/prweb13034466.htm"], "published": "2015-10-22T00:11:00.000+03:00", "crawled": "2015-10-22T02:52:18.849+03:00", "highlightTitle": ""}