{"organizations": ["Shaw Media", "Bryan Andrews"], "uuid": "7df4569a3b2e9d10771a93cafba693b5f69c04f9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mysuburbanlife.com", "main_image": "http://www.mysuburbanlife.com/_internal/cimg!0/h0iywe1dn496oncq9ck9eliz2nh2vrz", "site_section": "http://mysuburbanlife.com//?rss=sports", "section_title": "Sports", "url": "http://www.mysuburbanlife.com/2015/10/21/high-school-football-glenbard-east-willowbrook-in-need-of-wins-for-shot-at-postseason/a86es59/", "country": "US", "title": "High school football: Glenbard East, Willowbrook in need of wins for shot at postseason", "performance_score": 0, "site": "mysuburbanlife.com", "participants_count": 0, "title_full": "High school football: Glenbard East, Willowbrook in need of wins for shot at postseason", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T15:30:00.000+03:00", "replies_count": 0, "uuid": "7df4569a3b2e9d10771a93cafba693b5f69c04f9"}, "author": "", "url": "http://www.mysuburbanlife.com/2015/10/21/high-school-football-glenbard-east-willowbrook-in-need-of-wins-for-shot-at-postseason/a86es59/", "ord_in_thread": 0, "title": "High school football: Glenbard East, Willowbrook in need of wins for shot at postseason", "locations": ["Glenbard East", "Willowbrook", "West Chicago"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Lucas Seeman", "Bartlett"], "text": "High school football: Glenbard East, Willowbrook in need of wins for shot at postseason Published: Friday, Oct. 23, 2015 7:30 a.m. CDT Caption (Shaw Media file photo) Glenbard East's Bryan Andrews (right) pursues West Chicago's Lucas Seeman in a game on Sept. 25. The Rams face a must-win scenario against Bartlett on Oct. 23 if they hope to make the playoffs. By SUBURBAN LIFE MEDIA \nLOMBARD – In a sport where nearly every game is laden with significance, Glenbard East’s football team will play its biggest game of the season on Oct. 23. Related Links High school football: Glenbard East 'business as usual' before big game against West Aurora \nThe 4-4 Rams host 4-4 Bartlett in the Upstate Eight Valley finale, and both teams need a win to have any shot at the playoffs. \nHeading into the game, East is sitting at No. 29 in the Class 8A playoff field; the top 32 teams will make the postseason cut. Bartlett is No. 32. With 41 playoff points (combined win total of opponents), the Rams have one of the highest totals in Class 8A. \nThe Rams are in the must-win scenario after falling 31-28 against host West Aurora on Oct. 16. The Rams led 28-14 late in the game but surrendered a 75-yard punt return touchdown. \nAn interception set up a West Aurora touchdown pass with 1:02 left in the fourth quarter. \nEast missed a 39-yard field- goal attempt at the end of regulation, and West converted a field goal in overtime before intercepting a pass to end the game. \nThe Rams led 21-14 at halftime thanks to touchdowns by Philip Abruzino (5-yard run), Mitch Luttrell (4-yard run) and Connor Glennon (30-yard pass from Abruzino). \nGlennon hauled in a 25-yard pass from Abruzino in the third to make it 28-14. \nDevonta Owens led East with 75 rushing yards. Abruzino passed for 126 yards and Glennon had 90 yards receiving. \nMontini 48, Fenwick 7 \nFenwick scored the first touchdown of the game when it hosted Montini on Oct. 17. \nAfter that, it was all Broncos. \nMontini built a 41-7 halftime lead and initiated the running clock on Justin Blake’s 13-yard touchdown run in the third quarter. \nBlake connected with Dylan Maher on a 10-yard touchdown for the first score for Montini (8-0, 3-0 Chicago Catholic Green) and hit Brandon Beyer for a 16-yard TD that made it 24-7. \nPrince Walker (13- and 62-yard runs) and Mitch West (69-yard run) had first-half touchdowns, and Michael Cooney booted a pair of 27-yard field goals. \nMontini closes out the regular season against host Marmion at 7:30 p.m. Oct. 23. \nWillowbrook 23, Downers Grove South 22 \nWillowbrook was down to its last chance. \nTrailing 22-17 and in danger of slipping to 4-4 on the season, Billy Degnan hit Ron Reitz for a 66-yard touchdown that put the Warriors up 23-22 against Downers Grove South. \nThe Mustangs missed a last-second field-goal attempt and Willowbrook’s record moved to 5-3, drastically improving its odds of making the playoffs. A win against host Leyden on Oct. 23 puts the Warriors into the Class 7A playoff field. \nJack Jessen (73 yards rushing) put Willowbrook up 7-0 with a 1-yard touchdown run in the first quarter, and Degnan (198 yards passing) hit Josan Murphy for a 64-yard score on the last play of the first quarter, cutting the DGS lead to 16-14. Mike Dembrowski’s 42-yard field goal gave the Warriors a 17-16 halftime lead. \n– \nWho: Bartlett at Glenbard East \nWhen: 7:30 p.m. Oct. 23 \nWhere: 1014 S. Main St., Lombard \nRecords: Bartlett 4-4 (3-1 UEV), East 4-4 (2-2) \nOutlook: The playoffs technically start Oct. 30, but this Upstate Eight Valley battle is virtually a playoff game for the Hawks and Rams as the winner has a shot at the postseason. Bartlett has the stingiest defense in the UEV (135 points against) while Glenbard East is one of the most potent offenses (289 points).", "external_links": [], "published": "2015-10-23T15:30:00.000+03:00", "crawled": "2015-10-23T22:37:21.580+03:00", "highlightTitle": ""}