{"organizations": [], "uuid": "d7f95b757130b1121ed640488551a66402980fac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.oregonlive.com", "main_image": "http://imgick.oregonlive.com/home/olive-media/width620/img/hovde/photo/10605981-standard.jpg", "site_section": "http://www.oregonlive.com/", "section_title": "Oregon Local News, Breaking News, Sports &amp; Weather - OregonLive.com", "url": "http://www.oregonlive.com/hovde/index.ssf/2015/10/elizabeth_hovde_hope_in_the_ba.html", "country": "US", "title": "Elizabeth Hovde: Hope in the battle against sex trafficking (OPINION)", "performance_score": 0, "site": "oregonlive.com", "participants_count": 1, "title_full": "Elizabeth Hovde: Hope in the battle against sex trafficking (OPINION) | OregonLive.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T18:00:00.000+03:00", "replies_count": 0, "uuid": "d7f95b757130b1121ed640488551a66402980fac"}, "author": "Syndicated columns", "url": "http://www.oregonlive.com/hovde/index.ssf/2015/10/elizabeth_hovde_hope_in_the_ba.html", "ord_in_thread": 0, "title": "Elizabeth Hovde: Hope in the battle against sex trafficking (OPINION)", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\"Why don't we see more buyers getting four years?\" That was one of former Congresswoman Linda Smith's comments when I asked her for insight about the sentencing of Julia Haner, the young woman found guilty of arranging sex acts for an underage classmate at Lake Oswego High School.\nIt's a good question. More deterrence and possibly fewer people buying sex with minors would mean less demand for a market that's thriving and getting younger.\nOn Sept. 28, Haner, who was 20 at the time of her sentencing and who's been described in the news as a former Lake Oswego cheerleader, was sentenced to four years in federal prison for violating the federal Mann Act. The act makes it a crime to transport someone between states for prostitution. Haner had arranged prostitution gigs in Portland, Eugene and Vancouver for a victim she used to ride to high school with on the school bus. She was working with a 31-year-old man believed to be her pimp. He awaits sentencing.\nWhile delivering Haner's four-year sentence, U.S. District Judge Michael Mosman told Haner she had betrayed her friends but that he was giving her less than the possible 10-year sentence she faced because she, too, had been betrayed while a minor. While high-school aged, Haner started stripping in Portland's land of adult-entertainment plenty. She had sex for money at a pimp's direction, prosecutors say.\nSome girls eventually become what Smith says is called a \"bottom girl.\" That's a prostitute appointed by a pimp to help him supervise others. Haner sounds like a bottom girl.\nSmith runs Shared Hope International, a nonprofit organization based in Vancouver that's devoted to fighting sex trafficking. She knows far more than many would ever want to know about this dark world, and she uses her knowledge to save girls from being lost in it forever one Brianna and Lacy at a time. (Those are two survivors the organization highlights in awareness materials it created and who we can all learn from.) Meanwhile, there are a lot of Julias trapped in the darkness.\nSex trafficking is happening all around us, to girls in crisis and to higher-achieving \"good\" girls in your neighborhood. The pimps usually start out as what the girls think of as boyfriends who romance them and buy them gifts. They make them feel loved and valued. They tell them how they seem much older than their age -- sophisticated, smart, beautiful.\nAnd if they get them involved in photographs, stripping or a sex act, one time is often all it takes, Smith explains. They keep girls escalating in the trade by threatening to expose them to their families, sports teams or youth groups. Or they do it by physically punishing them or telling them they know where to find their family members, which can include younger sisters who they say they'll also recruit.\nShared Hope tells family, friends, educators and coaches to keep an eye out for older boyfriends, boyfriends with significant and unexplainable money, or secret boyfriends in the lives of girls they know. Watch out for expensive items girls suddenly have or tattoos that act as brandings for pimps to show ownership of a girl to other predators. Some girls pretend to attend school or say they're going to a friend's house when they're actually going to strip or sell sex.\nIn addition to bringing awareness, Shared Hope has been been instrumental in getting 48 states, including Oregon, to make it a felony to buy sex with a child. Tools are starting to exist that can significantly penalize buyers. But often, even if arrested, many men are able to reduce their charges considerably. Why? Because we're the jury, Smith says. She suggests it still seems more fitting to many to punish pimps and prostitutes rather than men who are seen as members of a family who had a lapse in judgment, a \"one-time\" indiscretion or who say they lacked knowledge they bought sex from a minor.\nEnough.\nThis is about supply and demand. We need to make sure we legally and socially hold accountable the \"good\" and \"bad\" men driving this problem. And too many people don't realize or care that many older sex workers -- ya know, 20-year-olds -- started or were recruited when underage. That needs to change.\nGet the word out. Educate yourself. Let's make it clear, as Shared Hope says, that our area's girls are not for sale.\nElizabeth Hovde writes Sunday columns for The Oregonian/OregonLive. Reach her at dehovde@gmail.com", "external_links": [], "published": "2015-10-17T18:00:00.000+03:00", "crawled": "2015-10-17T21:43:34.264+03:00", "highlightTitle": ""}