{"organizations": [], "uuid": "6808b8607d07e18d9fb5c3e53b5baa00c6f422d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailyunion.com", "main_image": "http://dailyunion.com/content/tncms/live/global/resources/images/_site/facebook_share_img.jpg", "site_section": "http://www.dailyunion.com/search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&nsa=eedition&c[]=sports,sports/*&f=rss", "section_title": "Daily Jefferson County Union - sports,sports/", "url": "http://www.dailyunion.com/sports/article_4674e3fc-798b-11e5-ae7a-9b27a2404075.html", "country": "US", "title": "Johnson strong in Fort shootout win", "performance_score": 0, "site": "dailyunion.com", "participants_count": 0, "title_full": "Johnson strong in Fort shootout win", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T16:37:00.000+03:00", "replies_count": 0, "uuid": "6808b8607d07e18d9fb5c3e53b5baa00c6f422d9"}, "author": "", "url": "http://www.dailyunion.com/sports/article_4674e3fc-798b-11e5-ae7a-9b27a2404075.html", "ord_in_thread": 0, "title": "Johnson strong in Fort shootout win", "locations": ["Fort"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Johnson"], "text": "Johnson strong in Fort shootout win \nWATERFORD — It came down to the final shooter in a shootout, and luckily for Fort Atkinson High School boys’ soccer, the final save. \nThe No. 5 Blackhawks defeated No. 4 Waterford off of a penalty shootout save from junior goalkeeper Page Johnson as Fort won 1-1 (4-3) in a WIAA Division 2 Regional at Waterford on Thursday. \n“Really excited, the boys had by far their best effort of the year,” said Fort head coach Kent Lovejoy. “We ended up with 35 shots on goal which is a ton for us, unfortunately we couldn’t put more in goal but they have a really good goalkeeper.” \nFort has had a problem with giving up early goals and Thursday’s match was no different as Waterford’s Cameron Prailes broke the deadlock in the opening two minutes of the game. \nThe striker, who the Blackhawks had specifically scouted, pounced on a miscommunication in the back for a 1-0 early lead. \nLuckily for Fort, a midseason move payed off. \nHalfway through the season Lovejoy brought up a number of young JV players, including Thursday’s goal scorer Javier Meza. \nMeza took a shot from the right side in the 30th minute to tie things up for the Blackhawks and has a couple goals on the season. \n“We had our goal from Javier Meza a freshman, and that really speaks volumes about where we are going to be in a couple years with a freshman putting the ball in the net on a regular basis with the varsity,” Lovejoy said. “So we’re really excited to have Javier with us.” \nAfter a scoreless second half and overtime, things came down to a shootout. \nSenior Brendan Knoflicek, and juniors Martin Bernabe, Luis Jarillo and Logan Peterson converted the penatly kicks for Fort and Johnson came up big to earn the win for the Blackhawks. \n“Most exciting ending I have had as the high school coach,” Lovejoy said. \nFort will take on No. 1 seed Elkhorn, at Elkhorn on Saturday in the Regional final. Gametime is at 4 p.m. \nThe Fort-Elkhorn winner advanes to next Thursday’s Sectional semifinal, and will play either Sotughton or Milton.", "external_links": [], "published": "2015-10-23T16:37:00.000+03:00", "crawled": "2015-10-26T12:22:58.488+02:00", "highlightTitle": ""}