{"organizations": [], "uuid": "1ac8e3444ab65df749f6cc445b055018578d53b7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.torontosun.com", "main_image": "http://storage.torontosun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297756872945_LARGE_BOX.jpg?quality=80&stmp=1444089871146&size=100x", "site_section": "http://www.torontosun.com/sports/football", "section_title": "Football | Sports | Toronto Sun", "url": "http://www.torontosun.com/2015/10/05/not-another-house-cleaning--lame-duck-status-might-put-jolt-into-blue-bombers-coach-mike-oshea", "country": "CA", "title": "Not another house-cleaning ... Lame-duck status might put jolt into Blue Bombers", "performance_score": 0, "site": "torontosun.com", "participants_count": 1, "title_full": "Not another house-cleaning ... Lame-duck status might put jolt into Blue Bombers", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T06:39:00.000+03:00", "replies_count": 0, "uuid": "1ac8e3444ab65df749f6cc445b055018578d53b7"}, "author": "torontosun.com", "url": "http://www.torontosun.com/2015/10/05/not-another-house-cleaning--lame-duck-status-might-put-jolt-into-blue-bombers-coach-mike-oshea", "ord_in_thread": 0, "title": "Not another house-cleaning ... Lame-duck status might put jolt into Blue Bombers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The bandwagon has cleared right out, leaving only the loyalists. And they, too, are grumbling.\nSome are even cursing the fact they were fooled yet again into believing in Blue.\nThis season was going to be different for the Bombers.\nThe head coach and GM had a year under their belts, enough time to leave their stamps on the roster, game plans and coaching staff.\nIn a league where a second-year expansion team has won eight of 13 games, Mike O’Shea and Kyle Walters have had time to restore some of the shine on this yellowing and pitted franchise by building a playoff team, one that could make some noise heading into a home Grey Cup.\nYet at 4-10 and sinking like a stone, it’s been more of the same, the Bombers assured only of finishing with a losing record for the seventh time in the last eight years.\nSo what to do?\nThe easy response would be to make like Molly Maid and clean house. Again.\nToss one or both out the door and start all over.\nGeez, how many times have we gone through that?\nSince 1991, the year after they won their last championship, the Bombers have had seven different head coaches and four different GM’s (Mike Kelly didn’t hold that title, but he was in charge of all things football).\nThey say a GM should get to hire at least two coaches before his own head is on the block.\nBut Walters hasn’t earned that luxury by building a winner elsewhere. It looks more and more like he just hasn’t supplied the horses for his head coach.\nWhich brings us to O’Shea.\nWhat’s that they say — if you don’t learn from history, you’re doomed to repeat it?\nSome recent history, then, for the Bombers to learn from.\nIt was after the 2000 season, and then-head coach Dave Ritchie’s seat was getting warm.\nRitchie, like O’Shea, had taken over a mess. The Bombers had gone 3-15 in 1998, the same feeble record they had in 2013, when O’Shea took over.\nRitchie went just 6-12 his first season, then 7-10-1 in Year 2, sneaking into a playoff spot. Not exactly fever-pitch progress.\nGoing into the third and final year of his contract, Gramps, as some in the front office called him, was under the gun: his deal called for a fourth year only if he managed a winning record through three.\nTechnically, Ritchie had to go 14-4 in 2001 to keep getting paid.\nAnd that’s exactly what he did.\nThen-CEO Lyle Bauer actually handed him an extension before that season was over, when the Bombers were well into a 12-game win streak. But you get the point.\nRitchie’s lame-duck status was well known going into that season. And his players, who loved him, came through for him.\nFast forward to the present.\nO’Shea’s Bombers went 7-11 his first year. Year 2 they could still sneak into a playoff spot, whether they deserve it or not, with a losing record.\nO’Shea’s players, still playing hard, seem to love him, too. And why wouldn’t they? He backs them even when they don’t deserve it.\nSo with one more year on his deal, the answer seems obvious.\nSend him into 2016 with the heat on high.\nLet’s see if that injects a little more urgency into everything he does, from roster decisions to who he hires and fires on his coaching staff.\nAnd let’s see, just as importantly, how his players react.\nBecause last time I checked, winning was the only way to keep your job in professional sports.\nSo I wouldn’t worry about a lame duck.\nIt’s the dead duck we’ve seen all too often.\nSTILL FIGHT IN BOMBERS\nThe Winnipeg Blue Bombers will begin practice Tuesday for a must-win game in B.C., trying to regroup from their latest crushing loss.\n“Definitely going to need some time to recover from this loss,” receiver Clarence Denmark said following Saturday’s 24-23 heartbreaker against Edmonton. “We’ve still got to fight. We’ve got to still be pros.”\nDenmark at least returns to work knowing he had his best game since mid-July, hauling in three passes for 95 yards.\nKicker Lirim Hajrullahu has to pick himself up after missing four field goals and his sixth convert of the year.\n“He’s going to be all right. I believe in Lirim,” kick returner Troy Stoudermire said.\nStoudermire was one of the players who tried to pick up their kicker before he attempted, and made, his last field goal with just over a minute to go.\n“I know you’re not really supposed to talk to him. But he was down,” Stoudermire said.\nEdmonton kicker Sean White nailed a 53-yarder on the last play for the win.\nThe Bombers could audition import kicker Sergio Castillo this week in practice.\nHOG’S HEAD UP\nCentre Dominic Picard insists he’s not tired of saying his team, now 4-10, is close.\n“We’re looking around us and we believe,” Picard said. “We’re still in in it, that’s the crazy thing.”\nPicard liked the play of the hogs, as the Bombers held Edmonton without a sack.\n“Up front we picked up their blitzes. We handled their front pretty well,” he said. “We were physical. And we put a toll on these guys ... we’ve got to find a way to close the deal.”\nPAUL FRIESEN\nNot another house-cleaning ... Lame-duck status might put jolt into Blue Bombers coach Mike O'Shea.\nBy Paul Friesen , Winnipeg Sun First posted: Monday, October 05, 2015 06:39 PM EDT | Updated: Monday, October 05, 2015 07:23 PM EDT\nThe bandwagon has cleared right out, leaving only the loyalists. And they, too, are grumbling.\n Some are even cursing the fact they were fooled yet again into believing in Blue.\nThis season was going to be different for the Bombers.\nThe head coach and GM had a year under their belts, enough time to leave their stamps on the roster, game plans and coaching staff.\nIn a league where a second-year expansion team has won eight of 13 games, Mike O’Shea and Kyle Walters have had time to restore some of the shine on this yellowing and pitted franchise by building a playoff team, one that could make some noise heading into a home Grey Cup.\nYet at 4-10 and sinking like a stone, it’s been more of the same, the Bombers assured only of finishing with a losing record for the seventh time in the last eight years.\nSo what to do?\nThe easy response would be to make like Molly Maid and clean house. Again.\nAbout the author Paul Friesen Follow Paul Friesen on Twitter Other Stories Winnipeg Jets youth movement will free up salaries for veteran contracts\nOne aspect of the Winnipeg Jets youth movement we don't hear a lot about is the financial need for it.\n0\n20-year-old forward Nic Petan making strong case to make Winnipeg Jets out of training camp\nHe'd grabbed the puck in the slot and passed up the shot.\n0\nSee more from Paul Friesen »\nTop stories Popular Latest Videos Manslaughter plea in 2009 slaying of Christopher Skinner\n0\nTory urges calm when celebrating Jays' victories\n0\nZeisberger's top 10 storylines for 2015-16 NHL season\n0\nLive coverage: Madonna brings Rebel Heart tour to Toronto\n0\nCanada reaches tentative Trans-Pacific trade deal with 11 other countries\n0\nTrudeau election platform targets middle class\n0\nOld City Hall: A shopper’s dream\n0\nCouncillor defends business class flight to South Africa\n0\nStrange alliances in niqab debate\n0\nLandmark ban on Raffi Torres sends right message\n0\nZabi Akbari - Witness To Kirby Rd Fatal Crash\nVaughan crash eyewitness\nLotto Max winners\nBabcock Expects More From Leafs\nDemers on possible Quebec NHL team\nMore from Football Ottawa RedBlacks focused on task at hand 0\nColts 'hope and expect' Andrew Luck to start Thursday 0\nKryk Slants: Dolphins owner kicks Joe Philbin to curb 0\nNot another house-cleaning ... Lame-duck status might put jolt into Blue Bombers coach Mike O'Shea. 0\nUndisciplined Bills need to worry about their own play 0\nInside Toronto sun.com News\nNine dead in historic South Carolina flooding 0", "external_links": ["http://pubads.g.doubleclick.net/gampad/clk?id=182027221&iu=/3081/SMCO_ENUR_TSUN_EN_WEB", "http://pubads.g.doubleclick.net/gampad/clk?id=228633661&iu=/3081/SMCO_ENUR_TSUN_EN_WEB", "http://twitter.com/@friesensunmedia", "http://pubads.g.doubleclick.net/gampad/clk?id=182024221&iu=/3081/SMCO_ENUR_TSUN_EN_WEB", "http://pubads.g.doubleclick.net/gampad/clk?id=183052021&iu=/3081/SMCO_ENUR_TSUN_EN_WEB"], "published": "2015-10-06T06:39:00.000+03:00", "crawled": "2015-10-06T05:08:33.906+03:00", "highlightTitle": ""}