{"organizations": [], "uuid": "469afca75cd05c96dc5142dc5280aaac30678eb1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtontimes.com", "main_image": "http://media.washtimes.com.s3.amazonaws.com/media/image/2015/10/17/709dc1e1af2b182e850f6a7067009131.jpg", "site_section": "http://www.washingtontimes.com/rss/headlines/sports/", "section_title": "www.washingtontimes.com stories: Sports", "url": "http://www.washingtontimes.com/news/2015/oct/22/salah-an-issue-as-roma-visits-fiorentina-in-1-vs-2/", "country": "US", "title": "Salah an issue as Roma visits Fiorentina in 1 vs. 2 matchup", "performance_score": 0, "site": "washingtontimes.com", "participants_count": 1, "title_full": "Salah an issue as Roma visits Fiorentina in 1 vs. 2 matchup", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T14:26:00.000+03:00", "replies_count": 0, "uuid": "469afca75cd05c96dc5142dc5280aaac30678eb1"}, "author": "ANDREW DAMPF", "url": "http://www.washingtontimes.com/news/2015/oct/22/salah-an-issue-as-roma-visits-fiorentina-in-1-vs-2/", "ord_in_thread": 0, "title": "Salah an issue as Roma visits Fiorentina in 1 vs. 2 matchup", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sports Salah an issue as Roma visits Fiorentina in 1 vs. 2 matchup Roma’s Mohamed Salah, right, is challenged by Empoli’s Lorenzo Tonelli during their Serie A soccer match at Rome’s Olympic stadium, Italy, Saturday, Oct. 17, 2015. (AP Photo/Gregorio Borgia) more > By ANDREW DAMPF - Associated Press - Thursday, October 22, 2015 \nROME (AP) - Mohamed Salah’s move from Fiorentina to Roma has been a hot topic of debate ahead of an enticing matchup between the two clubs in Serie A this weekend. \nFIFA opened a breach of contract investigation last month regarding Salah, which could result in the player being sanctioned and a transfer ban for Chelsea, which holds his rights. \nFiorentina challenged Chelsea’s right to let the Egypt winger join Roma on a season-long loan in August. Salah scored nine goals in all competitions over the second half of last season on loan at Fiorentina, which claims it had an agreement to extend his stay. \n“The matter is certainly not over,” Fiorentina chief executive Sandro Mencucci said this week. “FIFA will decide if Salah’s behavior was fair or not. If it wasn’t fair then he can be sanctioned as FIFA deems fit.” \nFIFA typically takes months to rule on contractual breach claims. If proven, sanctions include four-month bans for players and one-year bans on clubs registering new players. \n“Everyone has their own view. But we don’t have anything to do with this case,” Roma sporting director Walter Sabatini responded. “Salah won’t be banned because even the minimal reasons don’t exist to do so.” \nSalah has scored four goals in eight Serie A matches for Roma, which is one point behind surprise leader Fiorentina. \nInter Milan, which is level on points with Roma, visits Palermo on Saturday and could take the provisional lead before the Fiorentina-Roma match a day later. \nAlso this weekend, it’s: Empoli vs. Genoa; Carpi vs. Bologna; Sampdoria vs. Hellas Verona; AC Milan vs. Sassuolo; Juventus vs. Atalanta; Udinese vs. Frosinone; Lazio vs. Torino; and Chievo Verona vs. Napoli. \nHere are a few things to know about Serie A entering this weekend’s games: \n___ \nGOODBYE CATENACCIO \nThrough 80 Serie A matches this season, only two games have finished 0-0 - the first time that has happened in 65 years. \nFor a league long known for its “catenaccio” or lock-down defenses, this season has represented a big shift toward attacking. \nRoma leads the offensive outburst with 20 goals, followed by Napoli with 18 and Fiorentina with 15.", "external_links": [], "published": "2015-10-22T14:26:00.000+03:00", "crawled": "2015-10-22T16:15:09.553+03:00", "highlightTitle": ""}