{"organizations": ["Hawthorne Christian", "H.S."], "uuid": "8c21424dc298c987c7efe3b98e26f555b0016188", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.northjersey.com", "main_image": "http://www.northjersey.com:80/polopoly_fs/1.1440305!/fileImage/httpImage/renewhite102415.JPG", "site_section": "http://www.northjersey.com/cmlink/high-school-sports-rss.rss", "section_title": "High School Sports on NorthJersey.com", "url": "http://www.northjersey.com/sports/h-s-boys-soccer-hawthorne-christian-depends-on-rene-white-1.1440302", "country": "US", "title": "H.S. boys soccer: Hawthorne Christian depends on Rene White", "performance_score": 0, "site": "northjersey.com", "participants_count": 0, "title_full": "H.S. boys soccer: Hawthorne Christian depends on Rene White", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T06:49:00.000+03:00", "replies_count": 0, "uuid": "8c21424dc298c987c7efe3b98e26f555b0016188"}, "author": "", "url": "http://www.northjersey.com/sports/h-s-boys-soccer-hawthorne-christian-depends-on-rene-white-1.1440302", "ord_in_thread": 0, "title": "H.S. boys soccer: Hawthorne Christian depends on Rene White", "locations": ["Passaic County"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Rene White"], "text": "Buy this photo MARKO GEORGIEV/STAFF PHOTOGRAPHER Prolific scorer Rene White (9) is a big reason Hawthorne Christian is in the Passaic County final. The Defenders are looking for their first county championship today. \nHawthorne Christian has one of the most dangerous offensive threats in North Jersey on its side. Wayne Valley must figure out a way to counterbalance Rene White’s firepower if it is to thrive. \nThe Defenders, led by senior forward White, meet the resilient Indians in the Passaic County boys soccer tournament final today at noon at Clifton Stadium. \nHawthorne Christian is aiming for its first PCT crown in school history in any sport, boys or girls. Wayne Valley is seeking its sixth PCT title and first since 2009. \nA two-time All-North Jersey selection, White has dominated with 27 goals and 12 assists. He scored three times in Hawthorne Christian’s 5-1 semifinal win over Wayne Hills and contributed two assists when the Defenders downed Passaic, 3-1, in the PCT quarterfinals. \nFor his career, White has a school-record 123 goals with 46 assists. The smooth and precise 6-foot, 160-pounder from Bloomfield can slice through the smallest of openings and still launch a quality shot from anywhere inside 40 yards. \n“Definitely, he [White] is an excellent all-around player with great talent, speed and vision and he must be accounted for every minute all the way through the game,” Wayne Valley coach Sam Roca said. \n“But we can’t put too much attention on one player at the cost of everyone else on the field. We must be able to adapt to any development and we can’t let anyone else [have] much space either, it has to be an all-out, two-way, complete effort for our team.” \nSecond-seeded Hawthorne Christian (13-3) also receives strong offensive support from senior midfielder Will Woodfin (14 goals, 14 assists), who has 50 goals and 39 assists in his high school career. Woodfin and White complement each other well and seniors Denys Falcon and Frank Generoso and sophomore David Falcon also will pose difficulties for Wayne Valley. \nThe ninth-seeded Indians (7-9-1) have their own offensive standouts, including senior midfielder Alex Kasperowicz. In Wayne Valley’s 3-2 PCT semifinal win over Clifton, Kasperowicz (8 goals, 3 assists) scored all three goals, including the overtime game winner. \nOther keys for Wayne Valley are seniors Stas Lembryk, Anthony Minnella and Peter Leva. Lembryk is one of North Jersey’s top long-distance throw-in artists and his effort led directly to Kasperowicz’s game-decider against Clifton. \nThe Indians will have their hands full with a Hawthorne Christian team that won its first sectional championship last year (4-3 over Morristown-Beard in the North Non-Public B final). \n“We’ve been extremely blessed in this recent successful run that we’ve had [76-19-5 in the last five seasons],” said Tyler Van Dyk, Hawthorne Christian coach and athletic director. \n“We’ve established what we want from our students in terms of commitment, academic standards and fitness requirements. And they’ve definitely bought into it and really made themselves successful and built up a strong winning tradition in that time.” \nEmail: mills@northjersey.com © 2015 North Jersey Media Group Tags:", "external_links": [], "published": "2015-10-24T06:49:00.000+03:00", "crawled": "2015-10-24T08:33:03.464+03:00", "highlightTitle": ""}