{"organizations": [], "uuid": "13c8c0dbeada69e3442a18d88c8651e3ae21bf65", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxsports.com", "main_image": "http://www.foxsports.com/content/fsdigital/fscom.img.png", "site_section": "http://api.foxsports.com/v1/rss?partnerKey=zBaFxRyGKCfxBagJG9b8pqLyndmvo7UU&tag=cfb", "section_title": "FOX Sports Digital", "url": "http://www.foxsports.com/college-football/story/college-football-today-101015", "country": "", "title": "College Football Today", "performance_score": 0, "site": "foxsports.com", "participants_count": 0, "title_full": "College Football Today", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T04:37:00.000+03:00", "replies_count": 0, "uuid": "13c8c0dbeada69e3442a18d88c8651e3ae21bf65"}, "author": "", "url": "http://www.foxsports.com/college-football/story/college-football-today-101015", "ord_in_thread": 0, "title": "College Football Today", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  9:37p ET \nSTARS \n- Joshua Dobbs , Tennessee , threw for 312 yards, ran for 118 more and accounted for five TDs as the Vols erased a 21-point deficit in a 38-31 victory over No. 19 Georgia. \n- Jordan Canzeri , Iowa , ran for 256 yards on a school-record 43 carries and the No. 22 Hawkeyes beat Illini 29-20 for their sixth straight win. \n-Patrick Mahomes, Texas Tech threw for 428 yards and five TDs to lead the Red Raiders past Iowa State 66-31. \n- Shannon Brooks , Minnesota , ran for 176 yards and changed the game with a 71-yard TD run early in the third quarter in a 41-13 blowout at Purdue. \n- Marlon Mack , South Florida, rushed for 179 yards and a pair of second-half TDs in a 45-24 victory over Syracuse. \n- Dalyn Williams , Dartmouth , passed for a career-high 435 yards and four TDs in a 35-3 win over Yale 35-3. \n- Michael Sanders , Idaho State, passed for 427 yards and four TDs, including a 27-yarder to Jakori Ford for the winning score, in a 37-31 upset of North Dakota. \n- Kyle Nolan , Georgetown , passed for a career-high five TDs to a 38-7 win over Lafayette. \n- Vad Lee , James Madison, threw five TD passes in a 51-30 win over Towson. \n- Chase Edmonds , Fordham , rushed for 230 yards and scored four TDs in a 48-45 win over Penn. \n--- \nCHUBB HURT \nGeorgia running back Nick Chubb injured his left knee on the first play from scrimmage against Tennessee. \nChubb was running toward the sideline when he was hit by cornerback Emmanuel Moseley and later by linebacker Jalen Reeves-Maybin . He was helped off the field and remained on the sideline surrounded by a crowd of players and team officials as the 19th-ranked Bulldogs began their second offensive series. He later was carted away. \nThis marks the second straight time Georgia has lost a running back to a potentially serious injury during a trip to Tennessee. In the Bulldogs' 34-31 overtime victory at Tennessee in 2013, Georgia running back Keith Marshall and wide receiver Justin Scott-Wesley tore their anterior cruciate ligaments in their right knees to knock them out for the remainder of that season. \n--- \nRED RIVER RELIEF \nCharlie Strong put that gold cowboy hat on his head and flashed a huge smile filled with relief, joy and vindication. \nIf last week's beat down at TCU was rock bottom for Strong at Texas, his first victory against rival Oklahoma might be what changes the trajectory of his program. Or maybe it was just a temporary respite for the beleaguered Longhorns and their coach. \nRegardless, the 24-17 win against the 10th-ranked Sooners was no ordinary victory for Texas. \nWhen Jerrod Heard and the Longhorns offense got the ball with 3:33 left and Texas leading 24-17, they never gave it back. The Longhorns churned out three first downs, took a knee and then stormed the field as if they won championship trophy. \n--- \n19-Years since Georgia Tech last lost four straight games. \n35-Years since Michigan had three straight shutouts. \n41-Years since Temple last started 5-0. \n62-Years since Duke opened 5-1 in consecutive years. \n--- \nHOME AWAY FROM HOME \nSouth Carolina was forced to play its game against LSU on the road due to flooding and the Tigers made them feel right at home. \nSeveral days of record-setting downpours have left at least 17 dead, flooded hundreds of homes and businesses, shut down a 13-mile stretch of I-95 and left thousands without drinking water. \nLSU put all sorts of touches on the day to make it feel as much like a home game as possible for the visitors. The band played the South Carolina alma mater before kickoff and stadium speakers blared electronic music hit ''Sandstorm'' as is standard practice in South Carolina's Williams-Brice Stadium. \nBillboards around town were programmed to read ''Geaux Gamecocks! Make yourself at home.'' \n--- \nBUCKEYES WIN AGAIN \nOhio State coach Urban Meyer used Cardale Jones to start drives and J.T. Barrett to finish them as Ohio State - still unbeaten and mostly underwhelming - shook off Maryland in the second half for a 49-28 win. \nJones threw two touchdown passes, Barrett scored three times and the top-ranked Buckeyes (6-0, 2-0 Big Ten), who haven't met enormous expectations this season, scored 28 unanswered points in the second half to put away the Terrapins in what may have been Maryland coach Randy Edsall's final game. \nEzekiel Elliott had two short TD runs, Joey Bosa recorded a sack and several pressures and the Buckeyes extended the nation's longest winning streak to 19. Ohio State has won 26 straight regular-season conference games, but again struggled against a huge underdog.", "external_links": [], "published": "2015-10-11T04:37:00.000+03:00", "crawled": "2015-10-11T05:00:05.477+03:00", "highlightTitle": ""}