{"organizations": [], "uuid": "0f6584ea441453e7a8e8989795c6e1e7e753cacb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www2.ljworld.com", "main_image": "http://worldonline.media.clients.ellingtoncms.com/img/croppedphotos/2015/10/01/tencrop_t800.jpg?90232451fbcadccc64a17de7521d859a8f88077d", "site_section": "http://www2.ljworld.com/rss/headlines/sports/", "section_title": "LJWorld.com stories: Sports", "url": "http://www2.ljworld.com/news/2015/oct/02/fshs-fourth-lhs-10th-league-tennis/", "country": "US", "title": "FSHS fourth, LHS 10th at league tennis", "performance_score": 0, "site": "ljworld.com", "participants_count": 1, "title_full": "FSHS fourth, LHS 10th at league tennis", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T08:35:00.000+03:00", "replies_count": 0, "uuid": "0f6584ea441453e7a8e8989795c6e1e7e753cacb"}, "author": "Chris Duderstadt", "url": "http://www2.ljworld.com/news/2015/oct/02/fshs-fourth-lhs-10th-league-tennis/", "ord_in_thread": 0, "title": "FSHS fourth, LHS 10th at league tennis", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Chris Duderstadt — Lawrence Journal-World October 2, 2015 \nAdvertisement \nPrairie Village  Free State High’s doubles tandems of Caitlin and Ali Dodd and Rachel Walters and Andrea Chen each placed in the top 10 to fuel the Firebirds to finish fourth as a team Thursday at the Sunflower League girls tennis tournament at Harmon Park. \nThe Dodd sisters went 2-2 after receiving a first-round bye to take fourth place, while Walters and Chen fought through the back side of the bracket to finish ninth. \nThe Dodds’ losses came to eventual league champions Joie Freidrich and Lucy Kendall of Shawnee Mission East, and in the third-place match to SM Northwest’s Colleen Freeman and Lexy Drummond. Photo by Mike Yoder Free State High tennis player Kalia Fowler competes against Lawrence High's Payton Smith in a match Thursday at the Sunflower League meet in Overland Park. \n“I feel like both of us were a lot more aggressive at the net, which we’ve been working on that, so it was really good to see that outcome,” Ali said. “I just feel like our ground strokes were overall pretty solid.” \nCaitlin echoed her younger sister’s comments on the strides the two have made with their play at the net. \n“Last year, that was probably our biggest weakness,” Caitlin said of playing at the net. “Just that compared to this year, you can really see how much it has helped us in all of our success.” \nWalters and Chen’s win over Shawnee Mission West was the final match of the day and brought Free State’s point total to 20, one more than Olathe East and Olathe South. Photo by Mike Yoder Free State High tennis player Katie Piper reaches a ball at the net during competition Thursday at the Sunflower League meet in Overland Park. \n“I didn’t want to tell them (beforehand) that that match was pretty big-time,” FSHS coach Keith Pipkin said. “That was huge that they pulled that one off. Last match of the day, and they were still playing hard.” \nFree State’s No. 1 singles player, Katie Piper, went 3-2, including back-to-back victories after falling to league singles champ Josephine Cao of SM West. \n“I kind of put myself down after that, but I realized that I had to get back up because she was such a good player and that I needed to learn from that and keep going to win more matches later on,” Piper said. \nKalia Fowler followed up Piper at No. 2 singles with a record of 2-2. \nLHS ties for 10th \nLawrence High’s doubles teams of Natalie Cote and Betsy Smoot, and Caroline Baloga and Maddie Mask each went 2-2 to lead LHS to a 10th-place team finish, leaving LHS coach Chris Marshall with a lot of optimism heading into the regional tournament. \n“Betsy and Natalie started a little slow, and part of it had to do with the fact they had to sit around and had that bye, so it was kind of a disadvantage to get the bye, but they played some pretty good tennis. It gives us an idea of what we need to work on because they can play better, which is always a positive,” Marshall said. “Caroline and Maddie played some of the best tennis that they’ve played all year, which is a real positive. They had opportunities to do even better than they did.” Photo by Mike Yoder Lawrence High tennis player Payton Smith competes against Free State's Kalia Fowler in a match Thursday at a Sunflower League meet in Overland Park. \nBoth of Lawrence’s doubles tandems ran into Walters and Chen while they were on their hot streak through the consolation side of the bracket. Despite falling to Walters and Chen, 9-5, Cote enjoyed being able to compete against the crosstown Firebirds just two days removed from the City Showdown. \n“This one was a weird one because she (Chen) is one of my best friends,” Cote said. “That was cool to be able to play her in a different but still friendly setting. It was a little more of a competitive setting than usual.” \nErin Ventura and Payton Smith went 1-2 and 0-2, respectively, for the Lions in singles. \nSmith, Cote and Smoot battled injuries. \nSmith and Free State’s Fowler met to open the day, and the LHS No. 2 singles player injured her wrist as she dove for a return shot. A few matches later, Smoot and Cote collided on the same court in almost the same spot. \nMarshall admired how his players were able to push through their remaining matches, but he did not show any love for what seemed to be a cursed Court No. 7 for the Lions. \n“It shows their characteristics that they wanted to keep playing and all that,” Marshall said. “I might avoid Court 7 from now on, though.” \nSunflower League \nThursday at Prairie Village \nTeam scores — Shawnee Mission East 47, SM West 30, SM Northwest 28, Free State 20, Olathe East 19, Olathe South 19, Shawnee Mission South 11, Leavenworth 9, Olathe North 6, Lawrence High 5, Olathe Northwest 5, Shawnee Mission North 0. \nFree State Results \nDoubles \nCaitlin Dodd-Ali Dodd (fourth place) — bye; def. Chen-Metzger, OE, 9-0; def. Li-Serwatka, OS, 9-8, (8-6); lost to Freidrich-Kendall, SME, 9-2; lost to Freeman-Drummond, SMNW, 9-5. \nAndrea Chen-Rachel Walters (ninth place) — def. Baker-Wilkerson, Leavenworth), 9-0; lost to Sommerla-Oliver, SMNW, 9-3; def. Nichols-Weise, SMW, 9-1; def. Baloga-Mask, LHS, 9-6; def. Smoot-Cote, LHS, 9-5; def. Robinette-Na, SMW, 9-6. \nSingles \nKatie Piper — def. Lexi Reiher, Leavenworth, 9-1; lost to Josephine Cao, SMW, 9-0; def. Macie Fulton, ONW, 9-3; def. Keely Franklin, ON, 9-4; lost to Kylie Hance, SMS, 9-3. \nKalia Fowler — def. Payton Smith, LHS, 9-3; lost to Kady Lynn, OS, 9-0; def. Marissa Hansett, SMN, 9-1; lost to Kylie Hance, SMS, 9-1. \nLawrence High Results \nDoubles \nNatalie Cote-Betsy Smoot — lost to Anderson-Prauser, SMS, 9-3; def. Loo-Gerber, ON, 9-1; def. Stigall-Menke, OS, 9-4; lost to Walters-Chen, FSHS, 9-5. \nCaroline Baloga-Maddie Mask — def. Hamedi-Marin, ON, 9-2; lost to Cooper-McLiney, SME, 9-1; def. Wilson-Schimming, SMS, 9-3; lost to Walters-Chen, FSHS, 9-6. \nSingles \nErin Ventura — def. Aleesha Gonzalez, SMN, 9-0; lost to Michaela Magee, OE, 9-1; lost to Keely Franklin, ON, 9-4. \nPayton Smith — lost to Kalia Fowler, FSHS, 9-3; lost to Janel Dean, ON, 9-0.", "external_links": [], "published": "2015-10-02T08:35:00.000+03:00", "crawled": "2015-10-02T09:31:27.100+03:00", "highlightTitle": ""}