{"organizations": [], "uuid": "94d5ef17c3f7314f5e778107d901ba18ee2deade", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/c532be4d72c6384951a52bf7483093bd.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/motorsport/lews-hamilton-praises-nico-rosberg-after-team-success/6930561/", "country": "JE", "title": "Lews Hamilton praises Nico Rosberg after team success", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "Lews Hamilton praises Nico Rosberg after team success", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T14:20:00.000+03:00", "replies_count": 0, "uuid": "94d5ef17c3f7314f5e778107d901ba18ee2deade"}, "author": "", "url": "http://www.sport.co.uk/motorsport/lews-hamilton-praises-nico-rosberg-after-team-success/6930561/", "ord_in_thread": 0, "title": "Lews Hamilton praises Nico Rosberg after team success", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Lews Hamilton", "Nico Rosberg"], "text": "Lews Hamilton praises Nico Rosberg after team success 13 Oct 2015 11:20:51 \ncomments \nLewis Hamilton has paid tribute to his team-mate Nico Rosberg after Mercedes celebrated successive team championships on Monday. \nBoth Hamilton, who has one hand on a third Formula 1 title after his victory in Russia, and Rosberg flew in to the team's headquarters in Brackley and Brixworth to toast Mercedes' constructors' triumph with their 1,100-strong staff. \nBut for Rosberg, the celebrations would have been bittersweet after he retired from Sunday's race at Sochi's Olympic Park with a mechanical issue. The German will now be eliminated from this year's championship battle if Hamilton outscores him by a mere two points at the next race in Austin in a fortnight's time. \n\"I know everyone at the factories will keep pushing to keep us at the front and myself and Nico will definitely be doing the same,\" said Hamilton, who is now almost certain to become the first British driver to successfully defend his Formula One crown. He is 66 points ahead of Sebastian Vettel and 73 points clear of Rosberg with only four races remaining. \nHamilton added: \"I just want to mention too what a great team-mate Nico is. He's had a much tougher season so far than I have but has been a real team player throughout. \n\"I know he'll be fighting back through the many years to come in which we'll no doubt be competing hard against each other.\" \nWhile bad luck has contributed to Rosberg's demise this term - he has failed to finish two of the last four races through no fault of his own - the German has also largely been outclassed by his team-mate. Hamilton has recorded nine victories this season while Rosberg has triumphed at just three. The Briton also leads his team-mate 12-3 in qualifying. \nRosberg's championship challenge lasted until the final race last term, but he is now facing up to the real prospect of having little more than pride to play for in the remaining four races. \n\"It's been a tough couple of days for me - but being back at the factories and seeing all my colleagues so happy after the championship win really puts a smile back on my face,\" said Rosberg. \n\"I've seen this team grow since the start of the Silver Arrows project in 2010 and the level we've got to now, all working together, is unbelievable. \n\"What's amazing is that there's so much potential here too. Together, there's no limit to what we can achieve in the coming years.\" \nMercedes, winners of 27 races from the last 33, have been the dominant force in Formula One for the past two years. \nTeam boss Toto Wolff added: \"From go-karting onwards, the titles that everybody talks about are the individual ones for the drivers, but this time both Nico and Lewis are winners. \n\"We let Nico down on Sunday, but he has been such a fundamental part of the team from the beginning, he has helped make the team what it is and this is his championship as well. \n\"Lewis is riding the crest of the wave and having an incredible season. He has built himself into this team since 2013 and helped carry us forward with his determination and hard work. We owe them both so much.\" Related Sport News", "external_links": [], "published": "2015-10-13T14:20:00.000+03:00", "crawled": "2015-10-13T20:04:46.597+03:00", "highlightTitle": ""}