{"organizations": [], "uuid": "93bf1f730c54ce26fcb174c3192e6752f70e1a30", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/tennis", "section_title": "Tennis News, Scores, Schedule, Standings, Stats, Photos, Videos - MSN Sports", "url": "http://www.msn.com/en-us/sports/tennis/paire-upsets-nishikori-to-advance-to-japan-open-final/ar-AAfj5hW", "country": "US", "title": "Paire upsets Nishikori to advance to Japan Open final", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "Paire upsets Nishikori to advance to Japan Open final", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "93bf1f730c54ce26fcb174c3192e6752f70e1a30"}, "author": "Quaid taken into custody in Vermont trying to cross border", "url": "http://www.msn.com/en-us/sports/tennis/paire-upsets-nishikori-to-advance-to-japan-open-final/ar-AAfj5hW", "ord_in_thread": 0, "title": "Paire upsets Nishikori to advance to Japan Open final", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Paire upsets Nishikori to advance to Japan Open final Associated Press 21 hrs ago < PREVIOUS SLIDE SLIDE 1 of 17 NEXT SLIDE > Kei Nishikori of Japan reacts as he lost a point against Benoit Paire of France during their singles semifinal match at the Japan Open men's tennis tournament in Tokyo, Saturday, Oct. 10, 2015. (AP Photo/Eugene Hoshiko) © (AP Photo/Eugene Hoshiko TOKYO (AP) -- Unseeded Benoit Paire of France beat defending champion Kei Nishikori 1-6, 6-4, 6-2 Saturday to advance to the Japan Open final where he faces top-seeded Stan Wawrinka.\nAfter breezing through the opener when he broke Paire twice, Nishikori struggled in the second set and failed to convert any of his five break points. Paire won the set with a powerful backhand winner down the line to break the second-seeded Nishikori, who was bidding for his third Japan Open title.\nAdChoices ''I beat myself and that's why I lost,'' Nishikori said. ''I made some basic mistakes. If I had been aggressive the way I was in the first set, the result of the match would have been different.''\nPaire, who had 11 aces and saved seven of nine break points, raced ahead 4-1 in the third set and secured the win on his first match point when Nishikori hit a lob long.\n''In the third set, it was different. I was playing very well, aggressively and serving well,'' Paire said. I think I was better in the third set.''\nPaire, who captured his first ATP title at Bastad in July, also beat Nishikori in the U.S. Open first round this year.\nFrench Open winner Wawrinka had eight aces to beat Gilles Muller 6-4, 7-6 (5).\nThe Swiss reached his fourth final of the year when Muller angled his backhand volley wide in the tiebreaker.\nIn Sunday's final, Wawrinka will be looking to add to his wins at Chennai, Rotterdam and Roland Garros.\nGo to MSN Home", "external_links": ["http://ap.org/", "http://go.microsoft.com/fwlink/?LinkID=286759"], "published": "2015-10-10T03:00:00.000+03:00", "crawled": "2015-10-11T13:46:19.442+03:00", "highlightTitle": ""}