{"organizations": [], "uuid": "4b9dca5ed3877e0c6e1f083da88de8279cc334b8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "cjonline.com", "main_image": "http://cjonline.com/sites/default/files/14795907.jpg", "site_section": "http://cjonline.com/taxonomy/term/2/2/feed", "section_title": "Sports", "url": "http://cjonline.com/sports/2015-10-08/astros-rain-royals-parade-game-1-alds", "country": "US", "title": "Astros rain on Royals' parade in Game 1 of ALDS", "performance_score": 0, "site": "cjonline.com", "participants_count": 1, "title_full": "Astros rain on Royals' parade in Game 1 of ALDS", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:43:00.000+03:00", "replies_count": 0, "uuid": "4b9dca5ed3877e0c6e1f083da88de8279cc334b8"}, "author": "Jeff Deters", "url": "http://cjonline.com/sports/2015-10-08/astros-rain-royals-parade-game-1-alds", "ord_in_thread": 0, "title": "Astros rain on Royals' parade in Game 1 of ALDS", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Astros rain on Royals' parade in Game 1 of ALDS KC falls 5-2 as Ventura struggles early Posted: October 8, 2015 - 7:43pm Photos Charlie Riedel Kansas City Royals' Eric Hosmer walks back to the dugout after flying out to end the eighth inning in Game 1 of baseball's American League Division Series against the Houston Astros, Thursday, Oct. 8, 2015, in Kansas City, Mo. (AP Photo/Charlie Riedel) \nResult Thursday: Houston 5, Kansas City 2 \nGame Friday: Houston at Kansas City, 2:45 p.m. (FS1) \nGame Sunday: Kansas City at Houston, 3:10 p.m. (MLBN) \nx-Game Monday: Kansas City at Houston, TBA \nx-Game Oct. 14: Houston at Kansas City, TBA By Jeff Deters jeff.deters@cjonline.com \nKANSAS CITY, Mo. — If the Kansas City Royals are going to return to the World Series this October, they were probably going to have to wade through some tough waters eventually to get there. \nThursday at Kauffman Stadium, they got a double dose thanks to Mother Nature and the Houston Astros. \nUnable to rekindle the same magic of last year’s wild-card game, the Royals fell 5-2 to the wild-card Astros in Game 1 of the American League Division Series in a game that was delayed 49 minutes by rain after the second inning. By the time play resumed, Royals starter Yordano Ventura had already hit the showers as a combination of the delay and a 3-1 deficit forced manager Ned Yost to go to his bullpen. \n“He was just settling in when it started to rain,” Yost said. “He got hurt with his curveball the first inning, two pitches that were up in the zone a little bit. But besides that, he did a nice job of kind of limiting the damage there. Could have been worse.” Ventura, who just a couple days before was anointed the team’s ace for the postseason, reverted back to old form when that label proved problematic and too much of a heavy burden. Ventura gave up three runs on four hits and a walk in two innings of work. \nVentura (0-1) entered postseason play on a roll, going 4-1 in September and 9-2 since the All-Star break. But he did so pitching behind Johnny Cueto, who will start Game 2 at 2:45 p.m. Friday. Cueto will square off against left-hander Scott Kazmir. \nThe Astros got to Ventura right away, scoring two runs on two hits and a walk in the first inning. The first three batters reached as Jose Altuve singled to left, George Springer walked and Carlos Correa singled to right. \nConsecutive groundouts by Colby Rasmus and Evan Gattis produced runs before Ventura got out of it with a strikeout. \n“There is no doubt the first inning set the tone and gave our team a little bit of an exhale,” Astros manager A.J. Hinch said. “To put up five quality at-bats and get two runs, that is sort of announcing our presence there.” \nThe Astros, though, weren’t done yet. They tacked on another run in the second with a two-out rally, and again Altuve was in the middle of it. Center fielder Jake Marisnick hit a double to the left-center field gap, and Altuve drove him in with a base hit to right to put the Royals in a 3-0 hole. \nKendrys Morales gave the Royals some life as he swatted the first of his two homers off Astros starter Collin McHugh in the second to put the Royals on the board just minutes before the delay began. \nWhen play resumed, Chris Young stood tall on the mound backed by a roaring crowd of 40,146 fans. And in an omen of things to come, he struck out the side and calmed the waters over the next four innings. \nYoung, who was at one time a possible Game 4 starter, fanned seven, including five in a row. He allowed one run on three hits. His only blemish was a solo homer to George Springer in the fifth. \n“Pitching is pitching,” Young said. “You take the ball and compete. That’s it. I wish we had been able to come out on top, and I wish I had been able to keep the game closer, but we’ll bounce back. Nobody said this was going to be easy.” \nYoung, though, certainly won’t start Game 4. In fact, Yost is planning on going back to Ventura, who threw just 42 pitches. \n“Yeah, absolutely,” Yost said. “We’ll probably bring him back now.” \nMcHugh (1-0) stayed in it for six innings, giving up four hits and two runs to go with a walk and a strikeout. After homering in the second, Morales went yard in the fifth, cutting the deficit to 3-2. That’s as close as the Royals would get as the sometimes shaky Houston bullpen kept the KC offense at bay the rest of the way. \nKelvin Herrera worked a scoreless seventh for the Royals, but the Astros added another insurance run in the eighth as Rasmus walloped Ryan Madson’s first pitch over the wall in right-center field. \nThe Royals tried to put together a two-out rally in their half of the eighth as Ben Zobrist and Lorenzo Cain singled, but Eric Hosmer fouled out against left-hander Oliver Perez to end the threat. \n“It was the first time facing him all year, and I just wanted to see what he had and what his pitches looked like,” Hosmer said. “He just missed a slider 1-1 there, and looking back on it, I probably should have been a little more aggressive 1-0. But I just didn’t get it done.” \nSo here the Royals sit. Down 0-1 in the best-of-five series. The last time the Royals lost a series opener was in last year’s Fall Classic, a series they ultimately lost in seven games to the San Francisco Giants. \nThis year, though, the Royals have shown plenty of resiliency. And now they are hoping to stop the Astros from taking momentum and making a deep run like they did a year ago. \n“You take it day by day,” Yost said. “It's a five-game series. The first team to win three is going to be the winner. It's not a death sentence to lose Game 1.” \n■ Morales’ two-homer game marked the fifth time in team history a Royals player hit multiple home runs in a postseason game. The last player to do so was George Brett in the 1985 ALCS against Toronto. Brett also holds the team record with three homers in a game. \n■ Rasmus became the fifth player in baseball history to have an extra-base hit in his first five postseason games. \nJeff Deters can be reached at jeff.deters@cjonline.com .", "external_links": [], "published": "2015-10-09T03:43:00.000+03:00", "crawled": "2015-10-09T14:10:13.933+03:00", "highlightTitle": ""}