{"organizations": [], "uuid": "9383586d5ce4e625489d43671d7cb227f03b239a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestar.com", "main_image": "http://www.thestar.com/content/dam/thestar/sports/bluejays/2015/10/09/jays-rangers-ratings-terrible-south-of-the-border-mudhar/fans.jpg", "site_section": "http://www.thestar.com/sports/baseball.html", "section_title": "Baseball and MLB News | Sports | Toronto Star", "url": "http://www.thestar.com/sports/bluejays/2015/10/09/jays-rangers-ratings-terrible-south-of-the-border-mudhar.html", "country": "CA", "title": "Jays-Rangers ratings terrible south of the border: Mudhar", "performance_score": 0, "site": "thestar.com", "participants_count": 1, "title_full": "Jays-Rangers ratings terrible south of the border: Mudhar | Toronto Star", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "9383586d5ce4e625489d43671d7cb227f03b239a"}, "author": "Raju Mudhar", "url": "http://www.thestar.com/sports/bluejays/2015/10/09/jays-rangers-ratings-terrible-south-of-the-border-mudhar.html", "ord_in_thread": 0, "title": "Jays-Rangers ratings terrible south of the border: Mudhar", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The sports media story of the Blue Jays-Rangers series is likely going to be gangbusters ratings in Canada but with minimal interest in the U.S.\nOvernight ratings from Sportsnet say that Thursday’s Game 1 was watched by an average audience of 2.35 million Canadian viewers — highest in the network’s history — with reportedly 6.5 million Canadians tuning into some of the game. Even with two months of Blue Jay fever increasing in intensity, the numbers here can still grow.\nIn the U.S., Major League Baseball said Fast National overnight ratings had 1.75 million viewers nationally which, just for a point of comparison, paled to the NL wild-card game on TBS which averaged 8.3 million viewers, the highest number on cable since 2011.\nThe U.S. numbers will undoubtedly be worse for Friday’s marathon Game 2 which, beyond its noon start time, was only being carried in the U.S. on MLB Network, which is a subscription channel in most of the U.S.\nSunday night’s prime time Game 3 can only fare better. But so far, any U.S. network fears about the small American appeal of the Jays will continue, as a number of circumstances have combined to give it less than stellar viewer numbers.\nTHE GAMBLER SPEAKS : Not that we should care about the utterances of the disgraced hit king of baseball but Pete Rose, serving as analyst for Fox Sports 1 had some incredibly out of touch comments after Josh Donaldson’s head injury in Game 1 of the ALDS.\nHe said: “I just don’t understand. I mean, does everybody know what we’re playing for now? I mean, you get a tweak and you got to leave the game. You get a knee on the head and you’ve got a helmet on and you got to leave the game to go take a test that you pass. I mean, cause you’re a little light-headed? I got light-headed how many times in my career. I still went out there and played. I guess it’s just different from when I played to when they’re playing today, Frank. I can’t see you sliding into second there and leaving the game. I really can’t. And this guy is the MVP.”\nYes, Pete, it is different these days now that we know the extent of head injuries and the effect they can have on athletes. Another analyst pointed out players don’t get to decide whether they get to stay out, as leagues have concussion protocols now.\nSportsnet’s Jamie Campbell had an interview with MLB commissioner Rob Manfred prior to Game 2 and asked him about Rose’s comments.\n“Pete’s not been involved in the game for a while,” said Manfred. “The views he expressed are not of this era.”\nAsked for his reaction, Donaldson took the high road.\n“Pete Rose is a great player. What do you want me to say to Pete?” he said in the post-game scrum. “Everyone is entitled to their own opinion.”\nYOU ARE MISSED : There is nothing like big-time American announcers to make you miss the local guys. Twitter reaction to Thursday’s game had many complaints, from the way the Fox Sports announcing team pronounced Toronto to the provincial attitude toward Canada. So of course, there were calls for the familiar voices of Buck Martinez and Pat Tabler, even from some who admit they have been generally critical of the pair.\nFor Game 1, the bulk of the complaints centred on Fox analyst Harold Reynolds, who raised the ire of many viewers for complaining about the turf and supposedly low lights in the Rogers Centre. The turf looks like it is going to be a continuing point of interest throughout the series as such talk continued in Game 2. Judging from the Twitter reaction, it seems like nobody on either side of the border is happy with the broadcasting; complaints weren’t just from Canadians, as many American viewers were equally exasperated by Reynold’s obvious utterances.\nThere were also similar criticisms of Chris Berman, best known as ESPN’s swami of the NFL coverage, who was calling the game on ESPN radio. He’s universally considered a horrible play-by-play caller, and didn’t distinguish himself. At one point said the Jays needed to engage in a hockey fight to get back in it. For Game 2, I thought Bob Costas did a decent job, although there was an embarrassing moment when Friday’s team of Costas, Jim Katt and Ken Rosenthal denigrated baseball analytics, basically saying ‘math is hard.’ Costas also later referenced Albert Belle when he meant Adrian Beltre. To their credit, the MLB team did do a good job criticizing the umpire’s calls.\nIf you want local voices calling the game, your only option is listening on the radio where Jerry Howarth and Joe Siddall have the call as always. But because of rights, you’ll have to listen to an actual radio. If you have to listen online, download the Tunein Radio app, which has the ESPN radio feed.\nSTREAMING UPDATE : Like many, the early start to Game 1 meant life interfered with how I watched Thursday’s game, so I streamed it at my desk, popped into a bar for a few innings, listened to Sportsnet radio in a cab and then picked up watching again on my iPhone while I attended my kid’s swim class.\nIt was absolutely scattered way to watch the games, although I was impressed with the quality of the streams and online access through my various devices, and much better than even last year when I would have followed on Twitter or just texted play-by-play on an app. But if you are watching on anything other than TV, it is best to be in isolation, as there is a definite lag, sometimes as much as two minutes on the various streams. I had plays spoiled by people reactions who were watching on TVs in the office, text messages from friends, and notifications on my phone from The Score’s app. I’m not really complaining, as this is absolutely a first world problem, but it’s just another reason that shows how television still reigns supreme with live sports, although that availability and convenience on the move was fantastic.\nMore on thestar.com\nBlue Jays’ Brett Cecil out with torn calf muscle\nBlue Jays fall in extra innings to Rangers in Game 2 of ALDS", "external_links": ["http://static.freeskreen.com/publisher/52/freeskreen.min.js"], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-10T01:50:21.531+03:00", "highlightTitle": ""}