{"organizations": [], "uuid": "ab456212f7f3bc4f16e4e7aed220b4321f11a153", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.herald.ie", "main_image": "http://www.independent.ie/incoming/article31616900.ece/ALTERNATES/h342/page2_dunne.jpg", "site_section": "http://www.herald.ie/sport/schools/other-sports/", "section_title": "Other Sports - Herald.ie", "url": "http://www.herald.ie/news/don-gang-link-to-300k-cash-haul-seized-by-gardai-34116504.html", "country": "US", "title": "Don gang link to €300k cash haul seized by gardai", "performance_score": 0, "site": "herald.ie", "participants_count": 1, "title_full": "Don gang link to €300k cash haul seized by gardai - Herald.ie", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T10:30:00.000+03:00", "replies_count": 0, "uuid": "ab456212f7f3bc4f16e4e7aed220b4321f11a153"}, "author": "Ken Foy", "url": "http://www.herald.ie/news/don-gang-link-to-300k-cash-haul-seized-by-gardai-34116504.html", "ord_in_thread": 0, "title": "Don gang link to €300k cash haul seized by gardai", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A massive €300,000 cash haul seized by gardai after a major surveillance operation is suspected to belong to close associates of Brian O'Reilly, the best pal of slain gang boss Eamon 'The Don' Dunne . Sources have revealed that the cash - in both euro and sterling - is linked to a key associate of north Dublin criminal O'Reilly (46) who has survived two assassination attempts, most recently in a shooting in Balbriggan in June 2014. He has since recovered from his injuries.\nBrian O'Reilly The Herald can also reveal that a criminal tried to claim the cash sum - which was the subject of a court case last week - back from gardai.\nHe claimed that he needed the money as it had been set aside to pay part of a seven-figure bill to the Criminal Assets Bureau. The €300,000-plus sum was ultimately confiscated by the State as part of last week's court proceedings.\nThe confiscation order was made by Judge Martin Nolan at the sentencing hearing of another O'Reilly associate, William Trimble (57), in the Dublin Circuit Court.\nTrimble, of Edenmore Drive, Coolock was jailed for four-and -a-half years after being caught with more than €290,000 and £12,000.\nHe had pleaded guilty to a sample count of possessing €243,000, knowing or believing it to be the proceeds of criminal conduct, at a Kinsealy apartment on July 21, 2014.\nDetectives set up surveillance and arrested Trimble leaving the property with a vacuum pack machine.\nThey found €24,000 hidden in a false compartment at the back of his jeep and €23,000 in a fake wardrobe compartment in the apartment.\nGardai found four packages containing €50,000 in a safe at Edenmore Drive, as well as a smaller package with €15,000 and a pink bag holding €5,850.\nA further €6,750 was found in a bedroom, along with €16,000 in envelopes in the garden shed as well as the £12,000.\nThe cash bust was the second major seizure against the gang in the space of just three months last year. Previously, more than €250,000 in cash was seized in a raid in Coolock.\nSources say that the fact that the group continue to be active despite over €500,000 being seized from them is an indication of the levels of cash they have been making from drugs trafficking.\n\"They were able to absorb whatever blow the loss of this cash was to them and continue as normal,\" a source explained.", "external_links": ["http://www.independent.ie/incoming/article31616900.ece/48cc6/ALTERNATES/w620/page2_dunne.jpg"], "published": "2015-10-17T10:30:00.000+03:00", "crawled": "2015-10-17T16:02:55.223+03:00", "highlightTitle": ""}