{"organizations": [], "uuid": "9f3ca74d4992b853d86d24d41174381058d8b6e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.arcamax.com", "main_image": "http://www.arcamax.com/apple-touch-icon.png", "site_section": "http://www.arcamax.com/sports/", "section_title": "Sports | ArcaMax Publishing", "url": "http://www.arcamax.com/sports/hockey/s-1735856?fs", "country": "US", "title": "Big third period lifts Red Wings to 4-3 win over Hurricanes | Hockey", "performance_score": 0, "site": "arcamax.com", "participants_count": 1, "title_full": "Big third period lifts Red Wings to 4-3 win over Hurricanes | Hockey | ArcaMax Publishing", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "9f3ca74d4992b853d86d24d41174381058d8b6e8"}, "author": "arcamax.com", "url": "http://www.arcamax.com/sports/hockey/s-1735856?fs", "ord_in_thread": 0, "title": "Big third period lifts Red Wings to 4-3 win over Hurricanes | Hockey", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "RALEIGH, N.C. -- The Detroit Red Wings survived an emotional letdown and surged through with a third-period rally.\nThe Wings got a hard night's work out of their penalty killers and goaltender Petr Mrazek Saturday at PNC Arena, allowing them to rally for a 4-3 victory over the Carolina Hurricanes.\nHenrik Zetterberg added a goal and a big assist. Teemu Pulkkinen scored twice in the third period after the Wings had fallen behind 2-1, and Justin Abdelkader reached four goals as the Wings improved to 2-0.\nMrazek made 44 saves.\nThe Wings came into the game on the strength of a season opener that saw them pulsate with energy. This night there was neither the storied rivalry with the opponent nor the decade-long history surrounding the opposing coach, but still the performance was bafflingly bad.\nA night after they allowed just 22 shots all game, the Wings needed Mrazek to make 18 saves in the first period alone. Early penalty trouble saw Carolina handed 46 seconds with two extra skaters, but that shift Mrazek only had to make one stop, thanks to the gutsy play of Luke Glendening, Drew Miller and Jonathan Ericsson.\nThe Wings weren't able to regroup to get much going against Cam Ward, who only had to make stops on Brendan Smith and Dylan Larkin through 20 minutes.\nThe second period began with a spill-over penalty kill and continued as the Wings got nabbed with two many men on the ice. When Larkin directed a puck at Ward, it was only his third save of the game, and that was near the midpoint. Mrazek had made 20 more, including a stop on Justin Faulk after he'd weaved his way around three Wings.\nMrazek got a little post help during the Canes' fifth power play, which saw John-Michael Liles blast the puck from the blue line only to have it go clank.\nZetterberg scored at 11:33 when he strode in from the right corner before whipping out front and guiding the puck around Ward to score on what was only Detroit's six shot on net. Victor Rask knocked in Noah Hanefin's shot three minutes later, and the Canes scored again on their next attempt, when Nathan Gerbe tipped Ryan Murphy's shot in the last minute of the second period.\nThe Wings responded with a better third period as lines were shuffled to inject energy, with the payoff being an early goal from Pulkkinen after he was left unattended, and then a Pulkkinen deflection off a Tomas Tatar shot through traffic. Zetterberg set up Abdelkader with 3:35, which became the game-winner when Faulk scored with 2.1 seconds remaining in regulation.\n(c)2015 Detroit Free Press\nVisit the Detroit Free Press at www.freep.com\nDistributed by Tribune Content Agency, LLC.\nShare Comment", "external_links": ["http://twitter.com/share?url=http://www.arcamax.com/sports/hockey/s-1735856&hashtags=ArcaMax", "http://www.facebook.com/sharer.php?u=http://www.arcamax.com/sports/hockey/s-1735856&h=Big+third+period+lifts+Red+Wings+to+4%2D3+win+over+Hurricanes", "https://plus.google.com/share?url=http://www.arcamax.com/sports/hockey/s-1735856"], "published": "2015-10-10T03:00:00.000+03:00", "crawled": "2015-10-11T14:23:35.226+03:00", "highlightTitle": ""}