{"organizations": [], "uuid": "c30b753b0be3e4f7e4dcaca5fcddc66a1ad67914", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reporterherald.com", "main_image": "http://extras.mnginteractive.com/live/media/site36/2015/1011/20151011_084940_peyton-manning.jpg", "site_section": "http://feeds.reporterherald.com/mngi/rss/CustomRssServlet/47/244125.xml", "section_title": "Pro Sports", "url": "http://www.reporterherald.com/sports/ci_28969023/ty-sambrailo-returns-practice-aqib-talib-demarcus-ware?source=rss", "country": "IL", "title": "Peyton Manning strives for fewer interceptions, improving in red zone", "performance_score": 0, "site": "reporterherald.com", "participants_count": 1, "title_full": "Peyton Manning strives for fewer interceptions, improving in red zone", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T23:08:00.000+03:00", "replies_count": 0, "uuid": "c30b753b0be3e4f7e4dcaca5fcddc66a1ad67914"}, "author": "Cameron Wolfe \nThe Denver Post", "url": "http://www.reporterherald.com/sports/ci_28969023/ty-sambrailo-returns-practice-aqib-talib-demarcus-ware?source=rss", "ord_in_thread": 0, "title": "Peyton Manning strives for fewer interceptions, improving in red zone", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Peyton Manning strives for fewer interceptions, improving in red zone Ty Sambrailo returns to practice; Aqib Talib, DeMarcus Ware sat out Bronco Bus fan forum \nQuarterback Peyton Manning is well aware of the offensive struggles. He hears it weekly, but this week there's more feeling of optimism than discouragement. \nThe Broncos are able to move the ball up-and-down the field better every week, but there's one thing that's preventing the offense from scoring more points. \n\"Finishing drives helps a lot. It's the difference of scoring touchdowns and settling for field goals or certainly when you turn it over down there you get no points,\" Manning said. \"We want to be able to capitalize on those big plays with touchdowns.\" \nThe red zone has been a big Achilles' heel for the offense. But the turnovers might be more concerning. \nManning has thrown seven interceptions, including at least one in every game this season. \n\"Some have been poor decisions. A couple of them have been bad luck. Regardless, I need to eliminate them and it'd be a great week to do that this week,\" Manning said. Injury updates \nA group of wounded Broncos arrived for practice Wednesday. Six starters sat out while dealing with their respective injuries. \nDenver did get some positive news when left tackle Ty Sambrailo returned to practice Wednesday on a limited basis for the first time since September. He's been out for the last two games while dealing with a shoulder injury. \n\"He did all the individual, did some punching, we're hoping tomorrow's better,\" coach Gary Kubiak said. \"We'll see if we put the pads on tomorrow. We'll make a decision. Advertisement \nEven if Sambrailo is good to go Sunday, Kubiak said he would likely play in a platoon role with the other tackles. \nAqib Talib (ankle), DeMarcus Ware (back), Louis Vasquez (knee), Evan Mathis (hamstring), Demaryius Thomas (neck), Manning (not injury related), Owen Daniels (not injury related) and Juwan Thompson (hamstring) were all spectators at practice. \nTalib was seen wearing a brace on his right ankle Monday, but he looked like he was moving around well Wednesday. He even broke out a few dance moves. \nWare was the only player not on the field for practice. He was carted off the field Sunday after he said his \"back locked up on him.\" \n\"We're in a day-to-day process. I know there's a lot of reports out there, but I can tell you this he looks really good today,\" Kubiak said. \nThe bye week could have an impact towards the end of the week. \nThomas has been battling a neck injury for the past couple of weeks, but he hasn't missed a game due to the ailment, yet. \nManning, Vasquez, Mathis and Daniels all have typical veteran rest days to heal their ailing injuries and to recover from nicks and bruises. \nAnother return to Wednesday's practice was receiver Cody Latimer. He missed Sunday's game against Oakland due to a groin injury but was moving around well in practice. Get sports news and updates right in your inbox \nSign up to receive news alerts and a daily roundup of all things Colorado sports delivered to your inbox. \nCameron Wolfe: 303-954-1891, cwolfe@denverpost.com or @CameronWolfe Peyton Manning (18) of the Denver Broncos signals to the sideline vs. the Oakland Raiders at O.Co Coliseum in Oakland, Calif., on Oct. 11, 2015. ( Joe Amon, The Denver Post )", "external_links": [], "published": "2015-10-14T23:08:00.000+03:00", "crawled": "2015-10-14T23:34:42.338+03:00", "highlightTitle": ""}