{"organizations": [], "uuid": "f8474cef6b996c2d21f8960165dc3dd73a2fd9e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "buckeyextra.dispatch.com", "main_image": "http://buckeyextra.dispatch.com/content/graphics/woody-hayes/woody-nixon-1.jpg", "site_section": "http://dispatch.com//content/syndication/sports_osu.xml", "section_title": "The Columbus Dispatch OSU Sports Feed", "url": "http://buckeyextra.dispatch.com/content/stories/2015/10/20/woody-hayes-archive-1968_nixon_rally.html", "country": "US", "title": "The Woody Hayes Archive | Statehouse rally with Richard Nixon (1968) | Buckeye Xtra Sports", "performance_score": 0, "site": "dispatch.com", "participants_count": 0, "title_full": "The Woody Hayes Archive | Statehouse rally with Richard Nixon (1968) | Buckeye Xtra Sports", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T11:32:00.000+03:00", "replies_count": 0, "uuid": "f8474cef6b996c2d21f8960165dc3dd73a2fd9e5"}, "author": "", "url": "http://buckeyextra.dispatch.com/content/stories/2015/10/20/woody-hayes-archive-1968_nixon_rally.html", "ord_in_thread": 0, "title": "The Woody Hayes Archive | Statehouse rally with Richard Nixon (1968) | Buckeye Xtra Sports", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Richard Nixon"], "text": "Editor's Note: \nEach week during the football season, BuckeyeXtra.com will bring subscribers the original coverage of an event in the life of legendary Ohio State coach Woody Hayes, taken from the archives of The Columbus Dispatch newspaper . These stories, photos and clippings predate the Internet era and are being presented in digital form for the first time. \n*  *  * \nCONTEXT: Woody Hayes was not shy about sharing his political views, which is how he ended up on the speakers' platform with then-candidate Richard M. Nixon at a Statehouse rally in the final weeks of Nixon's campaign against Humbert Humphrey in 1968. Woody  and Nixon remained friends through the decades, and Nixon would deliver the eulogy at Woody's funeral.\n(These stories originally were published on the front page on October 23, 1968) \nNixon Devastates Humphrey During Grueling Ohio Day By GEORGE EMBREY \nDispatch Washington Bureau\nRichard M. Nixon, the cautious candidate who saved the best part of his attack until last, pulled out all stops in Ohio Tuesday.\nSumming up in Columbus midway through his grueling, once-in-a-campaign railroad whistle stop, Nixon said \"both campaigns are stepped up.\"\nNixon said Vice President Humphrey is hoping \"he is going to do what President Truman did in 1948.\"\nBut Nixon said he will be the man on the attack in the final 13 days of the 1968 election.\nDuring his nine speeches in eight Ohio cities and the village of Deshler, Nixon criticized Humphrey by name and hit hard at other top members of the Johnson-Humphrey administration.\nCampaigning the home state of his father and two of his grandparents, Nixon threw everything at Humphrey he could find, including Ohio State University football.\nNixon told the Statehouse crowd, estimated at more than 10,000 persons, that he \"could learn from Woody Hayes,\" seated on the platform nearby, and from the OSU team.\n\"They play rock 'em, sock 'em football and that's what we are going to play for the balance of this campaign,\" Nixon declared.\nThe present administration has \"lost the ball and we need some new ball carriers. This year not only are we going to rock 'em, sock 'em, but we can throw the ball at them. We are going to throw it a little, I can assure you,\" Nixon said. . . .\n \n*  *  *\nWoody applauded, too Republican Fumbles, But Picks Up Yards By HOWARD HUNTZINGER \nOf The Dispatch Staff\nRichard M. Nixon gained plenty of yardage Tuesday with his comments about Ohio State University football and Coach Woody Hayes and fumbled only twice.\nHayes, who sat on the speakers' platform, received such a lengthy ovation that Nixon went to the side of the platform, grabbed the coach's hand and held it in the air while the cheering grew to a higher pitch.\nThe Republican presidential candidate told the crowd -- estimated 10,000 down to 7,500 because some had to leave when the lunch hour evaporated -- he was grabbed by a \"Nixon girl\" as he approached the platform.\nThe girl, he continued, said she was from OSU and said, \"We're No. 1.\"\n\"And we,\" said Nixon, meaning the GOP presidential ticket, \"are going to be No. 1.\" He went on before the football conscious throng:\n\"Ohio State plays rock 'em, sock 'em football and that's what we're going to play in the final two weeks of this campaign.\"\nNixon bobbled the ball when he recalled coming to Columbus \"in 1958\" when OSU played an undefeated University of Iowa team. Actually, it was in 1957.\nOSU won that game, he noted correctly, but then said a quarterback by the name of White carried the ball 12 times in a row to score and win the game.\nAvid Central Ohio football fans winced, realizing Bob White was a fullback not a quarterback and that before this season some OSU quarterbacks did not carry the ball 12 times all year.\nBut back to politics ...\nNixon did not acknowledge the few signs in the audience calling for the election of Vice President Hubert H. Humphrey or former Alabama Governor George Wallace.\nHe also ignored the \"Nixon Afraid to Debate HHH?\" sign that hung before his eyes from State Democratic Headquarters in the Neil House.\nAn official at Penn Central called The Dispatch to complain the railroad was receiving unjustified complaints about the tardy Nixon train.\nNixon was scheduled to arrive at 12:10 p.m., according to timetables of county and state GOP headquarters. He arrived at 1:15 p.m. The railroad said the official train schedule called for arrival at 12:45 p.m.\nFederal, state, county and city security men were in abundance in and around the Statehouse before and during the Nixon speech. There was security also in the sky as helicopters flew over Union Station and the downtown area.", "external_links": [], "published": "2015-10-20T11:32:00.000+03:00", "crawled": "2015-10-20T17:17:40.891+03:00", "highlightTitle": ""}