{"organizations": ["Rangers", "Blue Jays", "AP Toronto Blue Jays Jose Bautista"], "uuid": "fec31fecf29c24a1a68b8a6acba44689b537521e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.northjersey.com", "main_image": "http://www.northjersey.com:80/polopoly_fs/1.1432398!/fileImage/httpImage/jaysalds.jpg", "site_section": "http://www.northjersey.com/cmlink/sports-rss.rss", "section_title": "Sports News on NorthJersey.com", "url": "http://www.northjersey.com/sports/blue-jays-beat-rangers-6-3-to-win-wild-game-5-1.1432397", "country": "US", "title": "Blue Jays beat Rangers, 6-3, to win wild Game 5", "performance_score": 0, "site": "northjersey.com", "participants_count": 0, "title_full": "Blue Jays beat Rangers, 6-3, to win wild Game 5", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T17:08:00.000+03:00", "replies_count": 0, "uuid": "fec31fecf29c24a1a68b8a6acba44689b537521e"}, "author": "", "url": "http://www.northjersey.com/sports/blue-jays-beat-rangers-6-3-to-win-wild-game-5-1.1432397", "ord_in_thread": 0, "title": "Blue Jays beat Rangers, 6-3, to win wild Game 5", "locations": ["Toronto"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Chris"], "text": "Buy this photo Chris Youn/The Canadian Press via AP Toronto Blue Jays Jose Bautista tosses his bat after hitting a three-run home run during the seventh inning in Game 5 of the American League Division Series, Wednesday, Oct. 14, 2015 in Toronto. \nTORONTO — Jose Bautista wiped out the need for protests or umpire reviews with the Toronto Blue Jays’ biggest home run since Joe Carter’s historic shot. \nToronto earned its first trip to the American League Championship Series since Carter’s World Series-ending drive in 1993, overcoming one of the craziest plays in playoff history when Bautista hit a three-run homer after three Texas Rangers errors for a 6-3 victory Wednesday in the deciding Game 5 of the Division Series. \n“It’s the most emotionally charged game that I’ve ever played,” Bautista said. \nThe Blue Jays became the third team to win a best-of-five series after losing the first two games at home. The 2001 Yankees also did it against Oakland, and the 2012 Giants did it against Cincinnati. Both of those teams went on to reach the World Series. \n“The odds were against us but I don’t think these guys ever thought we were out of it,” Blue Jays manager John Gibbons said. \nToronto, who led the majors in homers this season, will play the Royals, who beat Houston in Game 5 of their series, a rematch of the 1985 ALCS. Game 1 is Friday night in Kansas City. \n“It doesn’t really matter, we’re just happy we’re going to the next round,” Blue Jays slugger Josh Donaldson said. “Whoever we play is a very, very good opponent.” \nBautista’s homer capped an event-filled, 53-minute seventh inning that took a turn when Toronto catcher Russell Martin’s seemingly routine throw back to the pitcher deflected off batter Shin-Soo Choo and allowed the tiebreaking to score. \n“That was crazy,” Blue Jays starter Marcus Stroman said. “With all that happened, we did a good job of keeping our emotions in check.” \nThe Blue Jays filed a protest after an umpire review ruled Rougned Odor was allowed to cross home plate. Toronto fans pelted the field with debris during the 18-minute delay. \nThe Rangers started the bottom half by making errors on three straight groundballs, and Toronto rallied. Benches cleared twice in the Blue Jays’ half of the inning. \nRoberto Osuna got the final five outs for his first postseason save. \nOsuna turned toward the outfield after striking out Wil Venable, looked to the sky and was mobbed by his teammates as jubilant fans rocked the Rogers Centre. \nAfter Edwin Encarnacion tied it 2-all with a second-deck drive off tough-luck loser Cole Hamels in the sixth, Odor led off the seventh with a single and went to third on a sacrifice and groundout. \nWith Choo up, Martin’s throw back to reliever Aaron Sanchez deflected off Choo and dribbled toward third base. \nHome plate umpire Dale Scott initially ruled it a dead ball but, after Rangers manager Jeff Banister questioned the call, the umpires huddled and Odor was sent home. Martin was given an error. \n“I just caught the ball and threw it back very casually and it hit his bat and then next thing you know run scores,” Martin said. “It’s never happened in my life before. It’s just one of those moments, and it created an opportunity for us to do something special.” \nScott acknowledged making a mistake with his initial ruling. \n“I was mixing up two rules,” Scott said. “If there’s no intent, if he’s not out of the box, that throw is live.” \nFans littered the field with objects during the delay as umpires sorted out a play that is certain to rank up there with Derek Jeter’s Jeffrey Maier homer in 1996 or Reggie Jackson’s hip block of a throw in the 1978 World Series as one of the craziest in the postseason. \n“We went in the tunnel back there (behind the dugout) to get out of the way,” Rangers pitcher Sam Dyson said of the barrage of bottles and other items. \nAccording to rule Major League Baseball rule 6.03(a)(3), the batter is not to be charged with interfering with the catcher if the batter is still in the batter’s box and doesn’t make a movement to block or disrupt the throw. \nThis type of play is not subject to manager’s review but Scott, the crew chief, after discussing the ruling with Blue Jays manager John Gibbons, called an umpire’s review. After a delay of 2 minutes, 32 seconds, the play stood and fans continued to throw objects on the field. \nThe Blue Jays filed a protest. \nNo need for the paperwork, though. \nThe Rangers made three consecutive errors to start the bottom half, with Martin reaching on a fielding error by shortstop Elvis Andrus to start it off.  ", "external_links": [], "published": "2015-10-15T17:08:00.000+03:00", "crawled": "2015-10-15T19:50:45.746+03:00", "highlightTitle": ""}