{"organizations": ["CIARAN FAHEY Associated Press", "Cologne", "Bayern"], "uuid": "4bf2a91ed62c7987ea20a3639493c958cbffe835", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pendletontimespost.com", "main_image": "", "site_section": "http://pendletontimespost.com//feed/sec/6000/", "section_title": "PendletonTimesPost.com - Sports News", "url": "http://www.pendletontimespost.com/view/story/b198227e9e44478ca9810229a58bf5e6/SOC--German-Roundup/", "country": "US", "title": "Bayern gets 1,000th Bundesliga victory, extends record start", "performance_score": 0, "site": "pendletontimespost.com", "participants_count": 0, "title_full": "Bayern gets 1,000th Bundesliga victory, extends record start", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T19:17:00.000+03:00", "replies_count": 0, "uuid": "4bf2a91ed62c7987ea20a3639493c958cbffe835"}, "author": "", "url": "http://www.pendletontimespost.com/view/story/b198227e9e44478ca9810229a58bf5e6/SOC--German-Roundup/", "ord_in_thread": 0, "title": "Bayern gets 1,000th Bundesliga victory, extends record start", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bayern beats Cologne 4-0 for 1,000th Bundesliga victory, extends record start By CIARAN FAHEY Associated Press   12:17 pmLast   12:17 pm   \nPeople: Photo Gallery: \nClick to view (7 Photos) \nBERLIN — Arjen Robben scored on his return from injury Saturday as Bayern Munich defeated visiting Cologne 4-0 for the club's 1,000th Bundesliga victory. \nRobben, who hadn't played since picking up a groin injury on international duty on Sept. 3, broke the deadlock in the 35th minute after Robert Lewandowski's initial effort was blocked. \n\"Very happy,\" Robben said. \"It's nice when you are rewarded for your hard work by being back on the pitch.\" \nArturo Vidal made it 2-0 five minutes later with a lightly deflected effort after Kingsley Coman pulled the ball back, Lewandowski claimed his 13th of the season in the 62nd with a header off Douglas Costa's free kick, and Thomas Mueller completed the scoring with a penalty in the 77th. \n\"They defended with 10 men. It was important for us to score the first goal. Then when you get the second goal before half time — I wouldn't say it's settled — but it looks good,\" Robben said. \nBayern, which experienced its first defeat of the season at Arsenal in the Champions League on Tuesday, moved provisionally 10 points clear of Borussia Dortmund after extending its league record start to 10 wins from 10 games. \n\"You have to congratulate them. We wanted to prevent it. We defended well enough but you can't stop everything,\" Cologne coach Pewter Stoeger said. \nAlso Saturday, Admir Mehmedi scored in the 89th minute for Bayer Leverkusen to overturn a two-goal deficit and beat Stuttgart 4-3, Wolfsburg defeated Darmstadt 1-0, Eintracht Frankfurt came from behind to win 2-1 at Hannover and Werder Bremen won 3-1 at Mainz. \nPromoted Ingolstadt hosted Hertha Berlin in the late game. \nStuttgart went 2-0 up with goals from Martin Harnik in the 51st and Daniel Didavi three minutes later. Karim Bellarabi pulled one back — shortly after coming on as a substitute — only for Lukas Rupp to restore the visitors' two-goal advantage when he was set up by Timo Werner. \n\"I believed the whole time that we could come back,\" said Leverkusen coach Roger Schmidt, whose last game was a wild 4-4 draw with Roma in the Champions League on Tuesday. \nSchmidt's side pulled level with two goals in two minutes from Sebastian Boenisch and then Javier \"Chicharito\" Hernandez in the 71st, before Mehmedi sealed all the points on a counterattack. \n\"Whether it's an issue of tactics or quality, I don't know,\" said Didavi after Stuttgart's seventh defeat in 10 games. \nDaniel Caligiuri's 78th-minute strike was enough for Wolfsburg to beat Darmstadt and consolidate fourth place. \nFrankfurt had 19-year-old Marc Stendera to thank for ending its five-game run without a win. \nA brilliant run from Japan midfiedler Hiroshi Kiyotake set up Felix Klaus to put Hannover ahead in the 51st, only for Stendera to equalize six minutes later and claim the winner in the 65th. \nThree goals in eight minutes gave Bremen a 3-0 half-time lead at Mainz and ended the side's run of five defeats. \nAnthony Ujah scored twice, first with his head in the 39th and then with his left boot in the 44th, before Fin Bartels scored in first-half injury time. \nJapanese forward Yoshinori Muto claimed Mainz' last-minute consolation. \n ", "external_links": [], "published": "2015-10-24T19:17:00.000+03:00", "crawled": "2015-10-24T20:20:24.581+03:00", "highlightTitle": ""}