{"organizations": ["NJSIAA"], "uuid": "ea2cf29e698a42e25fbcf5afa36956cd78869370", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailyrecord.com", "main_image": "http://www.gannett-cdn.com/-mm-/6c4857fb74b27cc0080f9b8ffa958c784c511c5a/c=0-447-2000-1572&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/09/Morristown/B9319201844Z.1_20151009173529_000_GDPC6KM03.1-0.jpg", "site_section": "http://rssfeeds.dailyrecord.com/morristown/sports", "section_title": "Morristown - Sports", "url": "http://www.dailyrecord.com/story/sports/high-school/tennis/2015/10/09/tennis-notebook/73651488/", "country": "US", "title": "NJSIAA tennis tournament continues", "performance_score": 0, "site": "dailyrecord.com", "participants_count": 0, "title_full": "NJSIAA tennis tournament continues", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T02:52:00.000+03:00", "replies_count": 0, "uuid": "ea2cf29e698a42e25fbcf5afa36956cd78869370"}, "author": "", "url": "http://www.dailyrecord.com/story/sports/high-school/tennis/2015/10/09/tennis-notebook/73651488/", "ord_in_thread": 0, "title": "NJSIAA tennis tournament continues", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Paige Godau", "Dan Breeman", "Montville"], "text": "Dan Breeman, Correspondent 7:52 p.m. EDT October 9, 2015 Buy Photo Montville first doubles player Paige Godau returns the ball during the Morris County Tournament. (Photo: Karen Mancinelli/Correspondent) Buy Photo 1 CONNECT TWEET LINKEDIN COMMENT EMAIL MORE \nThe pursuit of sectional and group team titles will give way this weekend to the quest for individual honors as the NJSIAA singles/doubles tournament resumes at Mercer County Park in West Windsor and Veterans Park in Hamilton Township. \nSix Morris County singles players, including three-time defending Morris County Tournament first singles champion Scarlett Blydenburgh of Chatham, will continue their chase for glory today with third- and fourth-round action at Mercer County Park beginning at 9 a.m. Blydenburgh, the tournament’s No. 4 seed, will be opposed by a familiar face in the third round: Morristown second singles Meghan Acampora. \nOn the same side of the draw will be Kinnelon freshman Britany Lau, an MCT first singles finalist who survived a stern first-round test from Rutgers Prep’s Jessica Pil. She will be opposed by Brenda Peng of Watchung Hills. Lau is seeded 9-16 in the tournament. \nMorristown's first singles player Stef Elling will be the underdog against 5-8 seed Andrea Cerdan of Paramus Catholic in the third round. A win could set up a Lau-Elling showdown in the fourth round. \n“I just need to stay aggressive and play my game,” Elling said. \nMendham’s Lauren Hassell, a 9-16 seed, will be challenged by Sharon Jin of Gill St. Bernards in the third round. On the other side of the singles draw Chatham freshman Seden Agar looks to advance against Brianne Lauria of Manasquan. \nJust down the road at Veterans Park, three Morris County doubles teams will continue on with second-round play, including MCT first doubles champions Charlie Trinco and Alexandra Smith of Mendham, seeded in the 9-13 group. \nOne player who had been through the grind of the doubles tournament before is Montville senior Paige Godau, who made it to the final last year with partner Jillian Garfunkel before falling to Montgomery. Godau has a new partner, Emma Bernstein, and is again looking forward to the challenge. A win over Westfield’s second doubles team in today’s second round would likely set up a third-round meeting with top-seeded Millburn. \n“I’m excited going into the weekend,” Godau said. “It’s my senior year and we know it’s a big challenge. We’re just going to have fun, play the best we can, and get as far as possible.” \nThe Mountain Lakes duo of Melissa Mao and Allie Gregorek, which lost in three sets to Godau and Bernstein in the MCT semifinals, will play a third-round match against West Deptford. \nAll of today’s winners will return to Mercer County Park on Sunday morning for quarterfinal and semifinal-round action. Both the singles and doubles final are tentatively set for Oct.17 at the same site. 1 CONNECT TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http://dailyre.co/1LmBi5E TOP VIDEOS", "external_links": [], "published": "2015-10-10T02:52:00.000+03:00", "crawled": "2015-10-10T03:21:20.756+03:00", "highlightTitle": ""}