{"organizations": [], "uuid": "eff34ed871e13634f71f12deb3b5c211665e07e6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.torontosun.com", "main_image": "http://storage.torontosun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297758188562_LARGE_BOX.jpg?quality=80&stmp=1444337196291&size=100x", "site_section": "http://www.torontosun.com/sports/rss.xml", "section_title": "Top Sports stories", "url": "http://www.torontosun.com/2015/10/08/breaking-down-the-art-ross-trophy-candidates", "country": "CA", "title": "Breaking down the Art Ross Trophy candidates [Video]", "performance_score": 0, "site": "torontosun.com", "participants_count": 0, "title_full": "Breaking down the Art Ross Trophy candidates [Video]", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T23:38:00.000+03:00", "replies_count": 0, "uuid": "eff34ed871e13634f71f12deb3b5c211665e07e6"}, "author": "", "url": "http://www.torontosun.com/2015/10/08/breaking-down-the-art-ross-trophy-candidates", "ord_in_thread": 0, "title": "Breaking down the Art Ross Trophy candidates [Video]", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Report an error \nSidney Crosby was the popular pick. \nWhether it was goaltenders (Henrik Lundqvist), defenceman (Zdeno Chara) or goal-scoring forwards (Steven Stamkos), nearly everyone we asked at the NHL Player Media Tour in September picked the Pittsburgh Penguins captain to emerge as this season’s Art Ross Trophy winner. \n“I think Crosby’s going to win it,” said New Jersey Devils goaltender Cory Schneider. “With (Phil) Kessel there, I think he’s going to have a good bounce-back year. Not that (Crosby) had a bad year last year, but he’ll get the Art Ross this year.” \nThere were other choices, of course. Some liked Washington’s Alex Ovechkin or Chicago’s Jonathan Toews. Anaheim’s Ryan Getzlaf and New York Islanders’ John Tavares received votes. There was even love for St. Louis’ Vladimir Tarasenko and Pittsburgh’s Phil Kessel. \n“Maybe Jamie Benn will go back to back,” said Dallas’ Tyler Seguin. “That will be great for our team.” \nIt was a safe pick. After all, Benn led the league with 87 points last season (three more than Crosby, who played five fewer games). Seguin, who was Benn’s linemate, finished in the top-10 with 37 goals and 77 points. \n“We haven’t come close to touching where we’re going to go,” Seguin said of himself and Benn. “I’m 23 and he’s 25. We get better every game, every year … But I think more people on the team are concerned with winning the Stanley Cup than the Art Ross right now.” \nChances are the two players, who were also in top-10 in scoring in 2013-14, will be amongst the leaders again. However, history might be against Benn repeating. \nThe last time a player won two years in a row was in 2001, when Jaromir Jagr won his fourth straight Art Ross Trophy. In fact, the last six years have featured six different scoring champions. If that trend holds true, than someone other than Benn, Sidney Crosby, Martin St. Louis, Evgeni Malkin and Daniel and Henrik Sedin will win this season’s award. \nFor now, the award seems like it is Crosby’s to lose — as long as he stays healthy. \nThe 28-year-old, who finished third in scoring with 84 points last season, has been in the top-4 in each of the last three years. With Kessel joining Crosby on the wing, the Penguins’ offence could be the most potent in the league — as evidenced by the five goals and nine points Crosby and Kessel combined for in four exhibition games. \n“Hopefully, they can’t figure it out,” said Toews. “If they do, we’re all in trouble. There’s an overdose of skill there if Kessel ends up playing with one or the other. \n“It’s pretty amazing what a pure sniper, a pure goal-scorer can do with two guys who can move the puck and can control the puck like Crosby and (Evgeni) Malkin. Good thing they’re in the Eastern Conference, so I have to worry about them only once in a while.” Poll Who will claim this year's Art Ross Trophy? Crosby", "external_links": [], "published": "2015-10-08T23:38:00.000+03:00", "crawled": "2015-10-08T23:58:30.355+03:00", "highlightTitle": ""}