{"organizations": [], "uuid": "29c58044a866de450158b50c562c69317b69b686", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.capecodtimes.com", "main_image": "http://www.capecodtimes.com/Global/images/head/nameplate/fb/capecodtimes_200x200.png", "site_section": "http://www.capecodtimes.com/sports/high-school?template=rss&mime=xml", "section_title": "Local Sports - capecodtimes.com", "url": "http://www.capecodtimes.com/article/20151014/SPORTS/151019670/101036?rssfeed=true", "country": "US", "title": "School volleyball: Turco gets win No. 600 as Raiders take crown", "performance_score": 0, "site": "capecodtimes.com", "participants_count": 1, "title_full": "School volleyball: Turco gets win No. 600 as Raiders take crown", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T05:59:00.000+03:00", "replies_count": 0, "uuid": "29c58044a866de450158b50c562c69317b69b686"}, "author": "Cape Cod Times sports@capecodonline.com", "url": "http://www.capecodtimes.com/article/20151014/SPORTS/151019670/101036?rssfeed=true", "ord_in_thread": 0, "title": "School volleyball: Turco gets win No. 600 as Raiders take crown", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Oct. 14, 2015 at 9:59 PM By Cape Cod Times Posted Oct. 14, 2015 at 9:59 PM » Social News DARTMOUTH - Barnstable Red Raiders’ girls volleyball coach Tom Turco keeps racking up the milestones, earning win No. 600 with his team’s 25-19, 25-22, 25-10 victory over the Dartmouth Indians on Wednesday evening. Turco’s milestone also proved the Old Colony League championship clincher for Barnstable, now 11-1 on the season and 4-0 in the league. The OCL title is the Red Raiders’ 16th straight, as Barnstable has won 16 state titles under Turco. Senior captain Madison Sollows led Turco’s charges Wednesday with 14 kills, six blocks and four digs while freshman Riley James added 11 kills and 13 digs. Junior Danielle Derosier had a pair of game-highs, finishing with 14 digs and 15 service points, including two aces Senior captain Megan Dombrowski added three blocks while senior captain Michaela Cornwall had 12 digs, four kills and three blocks and sophomore Caroline Brodt added seven assists and seven digs. Upper Cape 3, Holbrook 1: Alexandra Hill and Jillian Lizotte provided strong service games in the Rams’ 25-23, 18-25, 25-18, 25-19 win over the Bulldogs in Bourne. Hill led Upper Cape (8-6, 4-2 Mayflower Small) with 21 service points, including a pair of aces, while Lizotte added 16 points at the service line. Hill also contributed a pair of kills and three hits while Lizotte had seven tips. Molly Horn was also strong at the service line with 15 points, including a pair of aces, adding 11 hits, four kills, 13 digs and a block. Erika Kelly contributed nine hits and four kills while Alexa Gelson had 17 sets and assists. Bourne 3, Greater New Bedford Voke 0: The Canalmen put together an impressive team effort in blanking the powerful Bears in Bourne. Skye McCarthy recorded five kills and two blocks for Bourne (11-3, 9-3 SCC) , which topped Greater New Bedford by scores of 25-20, 26-24 and 25-21. Also having big games for the Canalmen were Zoe Slade (four kills), Miranda Partosan (four kills and three aces), and Leah Hidenfelter ( four aces and 18 digs). Aly Hickey was also a force for the winners with eight digs and 21 assists. Bourne is off until Friday when it travels to South Coast Conference foe Apponequet. By Cape Cod Times", "external_links": [], "published": "2015-10-15T05:59:00.000+03:00", "crawled": "2015-10-15T08:45:32.254+03:00", "highlightTitle": ""}