{"organizations": [], "uuid": "74676adf464d4ee9a6b9855e5f0d949054990e92", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deseretnews.com", "main_image": "http://img.deseretnews.com/images/article/hires/1613641/1613641.jpg", "site_section": "http://deseretnews.com/sports/utah-utes/index.rss", "section_title": "University of Utah Utes sports scores, stats, schedules and Utah Utes News  - Deseret News", "url": "http://www.deseretnews.com/article/865639431/Runnin-Utes-center-Jakob-Poeltl-hopes-experience-gives-him-more-power-in-the-paint-video.html?pg=all", "country": "US", "title": "Runnin' Utes center Jakob Poeltl hopes experience gives him more power in the paint (+video)", "performance_score": 0, "site": "deseretnews.com", "participants_count": 1, "title_full": "Runnin' Utes center Jakob Poeltl hopes experience gives him more power in the paint (+video) | Deseret News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "74676adf464d4ee9a6b9855e5f0d949054990e92"}, "author": "Carter Williams", "url": "http://www.deseretnews.com/article/865639431/Runnin-Utes-center-Jakob-Poeltl-hopes-experience-gives-him-more-power-in-the-paint-video.html?pg=all", "ord_in_thread": 0, "title": "Runnin' Utes center Jakob Poeltl hopes experience gives him more power in the paint (+video)", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Not many college basketball players spend their summer playing against NBA talent in meaningful games, but that's exactly how Utah center Jakob Poeltl spent his. The sophomore hopes to take his summer lessons and apply them for the Utes this season.\nMore Coverage Ute basketball team ready to put dog days behind, play in front of fans “ My coaches tell me I've (been) playing more physical throughout practices, and that they think that's a good thing. I should keep it up that way.”\nJakob Poeltl\nSALT LAKE CITY — Not many college hoops players spend their summer learning from and jarring against basketball's top talent across two continents, but that's exactly how Utah center Jakob Poeltl spent his.\nPoeltl participated in the inaugural Nike Basketball Academy back in June with a handful of college hoops' top players, receiving insight from some of the NBA's best players.\nThe sophomore and Kareem Abdul-Jabbar Award watch list candidate then flew home to his native Austria and clocked valuable minutes for the Austrian national team during the Trentino Cup against such countries as Germany, Italy and Lithuania in friendly action.\nIn one particular game against Lithuania, Poeltl matched up in the paint against Toronto Raptors center Jonas Valanciunas and dropped 27 points in 28 minutes on the former NBA lottery pick, shooting 11-of-15 from the field. He also pulled down five rebounds.\n\"I think I learned a lot over the summer,\" Poeltl said, brandishing a battle wound above his right eye from one of the games. \"European basketball — not only the national teams, but also club teams — it's very different to college style and also going against grown men who play in the NBA. It's probably more physical, so that's something I had to deal with through the summer and learned to adapt to through the summer.\"\nWhen practices began for the Utes two weeks ago, Poeltl brought his coaches souvenirs from his summer adventures.\n\"My coaches tell me I've (been) playing more physical throughout practices,\" Poeltl said, while trying to hold back a grin, \"and that they think that's a good thing. I should keep it up that way. I don't know where it's coming from. Maybe it's from the summer, maybe it's just a different mindset, but I think it can definitely help me out this season.\"\nIn addition to his improved physicality, head coach Larry Krystkowiak said Poeltl gained 30 pounds since last year and has improved on both his post game and free throw shooting, where he shot just 44 percent last season.\n\"I think having a little more confidence and being comfortable is going to help him,\" Krystkowiak said. \"Then simplify. There's no reason in the post to have a bunch of crazy moves.\"\nAfter mulling whether to jump to the NBA, Poeltl returns as the Utes ' third-best scorer from last season and top rebounder, averaging 9.1 points and 6.8 rebounds during his freshman campaign. Poeltl led the Utes in rebounding in 18 games last season and in scoring four times.\nThough Krystkowiak said many of the roles on the team have yet to be established for the coming season, what is expected from returning players like Poeltl won't change much.\nIt's just a matter of refining their play from last season.\n\"We watched a lot of clips last year and (Poeltl) would often times — he'd try to out-quick people,\" Krystkowiak said. \"That quick herky-jerky, get to the rim as fast as I can and some of that is self-consciously knowing you're not a good foul shooter and so I'm going to dodge some contact. Often times when he missed (a shot), he wasn't getting the rebound because he wasn't in position to get his own miss and he certainly wasn't putting the defense in a precarious situation.\n\"He has to be on balance and make stronger moves in and around the post.\"\nWhile his summer helped him gain strides for this season and possibly even his NBA draft stock for the coming draft (major NBA mock draft sites still view him as a lottery pick if he decides to enter the NBA draft in 2016), having experience from one full season of college basketball under his belt helps just as much.\n\"I just tried to learn from every practice and every game that I got to be on the court,\" Poeltl said. \"At the start, it was learning a lot from (former Utah center) Dallin Bachynski. I wasn't used to playing a physical guy like him. He was a lot stronger and heavier than me, so I had to adapt to that and I think I did that. Come game time, I played against a lot of really, really good basketball players in the post like Jahlil Okafor or I played against (Josh) Scott from Colorado, who was really good — experienced guys.\n\"I think those kind of experiences, at least for me, is where I develop as a player and get better from it.\"", "external_links": [], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-20T20:13:19.866+03:00", "highlightTitle": ""}