{"organizations": [], "uuid": "c46a52d8940af54d5af8772e3bae03ff23fc16c7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266381/sports-general", "section_title": "Sports: General - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30284708/new-wolves-of-yellowstone-photography-safari-from-wildlife-expeditions-of-teton-science-school-announced-for-2016", "country": "US", "title": "New Wolves of Yellowstone Photography Safari from Wildlife Expeditions of Teton Science School Announced for 2016", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "New Wolves of Yellowstone Photography Safari from Wildlife Expeditions of Teton Science School Announced for 2016 - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T11:11:00.000+03:00", "replies_count": 0, "uuid": "c46a52d8940af54d5af8772e3bae03ff23fc16c7"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30284708/new-wolves-of-yellowstone-photography-safari-from-wildlife-expeditions-of-teton-science-school-announced-for-2016", "ord_in_thread": 0, "title": "New Wolves of Yellowstone Photography Safari from Wildlife Expeditions of Teton Science School Announced for 2016", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Wildlife Expeditions of Teton Science Schools, known for its exceptional biologist-led tours of Yellowstone National Park, has created a new small-group U.S. safari to experience and photograph the park’s famous wolves. Offering an unparalleled intimate eight-day wildlife adventure for March 2016, the Wolves of Yellowstone Photography Safari includes a scenic flight for breathtaking aerial views of wolf habitat.\nJackson Hole, Wyo. (PRWEB) October 17, 2015\nA trip-of-a-lifetime opportunity for photographers and wildlife enthusiasts, Wildlife Expeditions of Tetons Science Schools ’ exciting new March 2016 Wolves of Yellowstone Photo Safari provides a photographer’s eye view of the Lamar Valley – known as the American Serengeti – and the wolf packs that call it home. Incorporating a scenic flight for breathtaking aerial views of Yellowstone National Park and beyond, the all-new eight-day tour is open to all levels of photographers who wish to see and photograph one of North America’s wildest places. Recently recommended by The New York Times , the new adventure travel experience combines useful tips and techniques from Wildlife Expeditions’ expert photographers with the deep knowledge and wildlife spotting skills of the group’s highly skilled biologist guides. The rare small-group U.S. safari is available to a limited number of people on specific dates from March 6 – 28.\nOver the course of eight days, small groups of just six people per customized Mercedes-Benz safari vehicle will have the opportunity to discover some of the U.S.’s most remarkable scenery and wildlife – while gaining skills to capture the adventure through a camera lens like a pro. The tour begins in Bozeman, Mont., heading to Yellowstone’s Paradise Valley and on to explore the geothermal features of Mammoth Hot Springs.\nNext, guests experience three days in the Lamar Valley, known for its one-of-a-kind wolf-viewing opportunities. In addition to the extensive focus on the wolves, the Lamar Valley leg of the tour will also provide the chance to see and photograph other wildlife that may include bison, pronghorn, elk, eagles, bighorn sheep and bears. Groups will comfortably ride in Wildlife Expeditions Mercedes Sprinter safari vehicles customized with large viewing windows and sunroofs, perfect for photography. Overnights in Montana hotels will be arranged by Wildlife Expeditions, as well as daily meals and snacks.\nThe seventh day of the new wolf photography safari offers a scenic private flight over wolf habitat in Yellowstone National Park, as well as the Grand Canyon of the Yellowstone River, Old Faithful and possibly the Tetons and Jackson Hole, weather permitting. The tour then returns to Yellowstone for an afternoon hike on snowshoes, followed by an overnight at Chico Hot Springs Resort. Groups will depart from Bozeman on the final day of the tour.\nThe new Wolves of Yellowstone Photography Safari is offered on three sets of dates in 2016: March 6 - 12, March 13 - 20 and March 21 - 28. Each trip is limited to six people to accommodate photography equipment as well as comfortable riding space in the custom vehicles, and guests will receive expert photography instruction using their own cameras and equipment. The cost of the eight-day adventure is $4,495/person.\nAbout Wildlife Expeditions of Teton Science Schools:\nWildlife Expeditions of Teton Science Schools has a well-earned reputation of leading exceptional safari tours and locating wild animals in the wilderness in and around Yellowstone and Grand Teton National Parks. As Jackson Hole, Wyoming's premier and original safari provider, Wildlife Expeditions offers family-friendly educational tours year-round in a stunning natural environment. The tour company has been recognized by national media including Conde Nast Traveler and USA Today’s “10 Amazing Adventures under $1,000.” Teton Science Schools is an authorized concessioner of the National Park Service, providing snowcoach tours, ski and snowshoe trips, photography and chartered programs in Yellowstone National Park. For more information or to book a Wildlife Expeditions tour, visit http://www.tetonscience.org .\nMedia Contact: Amy Stark, WordenGroup Public Relations, amy(at)wordenpr(dot)com 307.734.5335\n //www.prweb.com/releases/2015/10/prweb13028019.htm\n ", "external_links": ["http://www.nytimes.com/2015/10/16/travel/tour-and-park-news-sonoma-by-bike-photos-in-yellowstone.html?rref=collection%2Fcolumn%2Fin-transit&action=click&contentCollection=travel&region=stream&module=stream_unit&version=latest&contentPlacement=1&pgtype=collection&_r=1", "http://www.prweb.com/releases/2015/10/prweb13028019.htm", "http://www.tetonscience.org/wildlife-expeditions/home/", "http://www.tetonscience.org/wildlife-expeditions/multiday-yellowstone-photo", "http://www.cntraveler.com/stories/2015-05-20/on-safari-in-yellowstone-national-park-americas-own-serengeti"], "published": "2015-10-17T11:11:00.000+03:00", "crawled": "2015-10-17T12:59:42.763+03:00", "highlightTitle": ""}