{"organizations": [], "uuid": "777ae3fe3a12103a9ef02c2c7afc78c2042c9aa5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deccanchronicle.com", "main_image": "http://www.deccanchronicle.com/sites/default/files/IndvsPak%20Afp_0_0_0_0_0_0_0_0_0.jpg", "site_section": "http://www.deccanchronicle.com/sports", "section_title": "Sports | Deccan Chronicle", "url": "http://www.deccanchronicle.com/151019/sports-cricket/article/ex-chiefs-advise-pcb-stop-chasing-india-series", "country": "US", "title": "Ex chiefs advise PCB to stop chasing India for series", "performance_score": 0, "site": "deccanchronicle.com", "participants_count": 1, "title_full": "Ex chiefs advise PCB to stop chasing India for series", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T10:17:00.000+03:00", "replies_count": 0, "uuid": "777ae3fe3a12103a9ef02c2c7afc78c2042c9aa5"}, "author": "PTI", "url": "http://www.deccanchronicle.com/151019/sports-cricket/article/ex-chiefs-advise-pcb-stop-chasing-india-series", "ord_in_thread": 0, "title": "Ex chiefs advise PCB to stop chasing India for series", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PTI | October 19, 2015, 19.10 pm The former President of the ICC Ehsan Mani has already advised the PCB to ensure Pakistan is not grouped with India in the league matches of the World T20 in India next year in a bid to exert pressure on the ICC to interfere in Indo-Pak cricket matters. (Photo: AFP) Karachi : Former chiefs of the Pakistan Cricket Board (PCB) have advised against continuing talks with the BCCI officials to have the bilateral series with India in December in UAE.\nIjaz Butt, Lt General (retd) Tauqir Zia and Khalid Mahmood said after the incident at the BCCI headquarters in Mumbai on Monday, the PCB must drop the idea of trying to convince India to play the series in December.\n\"I don't know why the PCB is after India to play the series. It is very apparent they don't want to play with us,\" Butt told PTI.\n\"Shaharyar had asked me to speak to my contacts in India to push for the series. I did and I got a negative answer and I told Shaharyar to forget about India agreeing to play us in December.\nI will tell Shaharyar again that he should stop chasing India as it has become embarrassing for us,\" he added.\nZia also criticised PCB's stance, saying: \"It is strange that the BCCI decided to meet with our officials in Mumbai knowing well the situation in the city due to some extremist elements. I see what happened today as an insult to our board.\nRead: Indo-Pak talks: BCCI president Shashank Manohar invites PCB to India\nPakistan cricket has to send a strong message to the Indian board that we can survive without them. If they (BCCI) are causing so many problems about wanting to play at a neutral venue then what can I hope for future ties,\" he questioned.\nZia called on the PCB officials to return to Pakistan and focus on the Pakistan Super League (PSL) and inviting other teams.\nMahmood said, \"What happened today is shameful and unfortunate. It shows that the Indian board is also not interested in playing with us.\"\nAlso Read: It is a waste of time; India is not interested to play against us: Ijaz Butt on India-Pakistan series\nThe former President of the ICC Ehsan Mani has already advised the PCB to ensure Pakistan is not grouped with India in the league matches of the World T20 in India next year in a bid to exert pressure on the ICC to interfere in Indo-Pak cricket matters.\n Cricket Team India Pakistan BCCI PCB Ijaz Butt Tauqir Zia Khalid Mahmood Also Read Shiv Sena workers barge into BCCI office, talks with PCB chief rescheduled Politics shouldn't be mixed with cricket, says ICC president Zaheer Abbas Rajeev Shukla condemns attack on BCCI office by Shiv Sena workers", "external_links": ["http://platform.twitter.com/widgets.js", "http://static.ak.fbcdn.net/connect.php/js/FB.Share", "http://dd508hmafkqws.cloudfront.net/sites/default/files/IndvsPak%20Afp_0_0_0_0_0_0_0_0_0.jpg", "http://campaign.bharatmatrimony.com/track/clicktrack.php?trackid=00100326114361", "https://apis.google.com/js/plusone.js", "http://twitter.com/share?url=http://www.deccanchronicle.com/151019/sports-cricket/article/ex-chiefs-advise-pcb-stop-chasing-india-series", "http://www.facebook.com/sharer.php", "http://dd508hmafkqws.cloudfront.net/sites/default/files/styles/article_node_view/public/IndvsPak%20Afp_0_0_0_0_0_0_0_0_0.jpg", "http://vuukle.com/js/vuukle.js", "http://dd508hmafkqws.cloudfront.net/sites/default/files/BharatMatrimony_texlink_banner_620x40px.gif"], "published": "2015-10-20T10:17:00.000+03:00", "crawled": "2015-10-19T23:49:17.741+03:00", "highlightTitle": ""}