{"organizations": ["ES North", "First Quarter ESN", "Cavaliers", "Red Rovers", "East Stroudsburg North", "Mounties", "Stroudsburg High School", "ES South", "ES North Posted", "Timberwolves", "Cardinals", "Kutteroff", "Stroudsburg", "Cavs", "Brome", "Pocono East", "Rovers"], "uuid": "2be959ba15927726a373c27a0b473701dc740e5a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.poconorecord.com", "main_image": "http://www.poconorecord.com/Global/images/head/nameplate/poconorecord_logo.png", "site_section": "http://www.poconorecord.com/sports?template=rss&mime=xml", "section_title": "Sports - poconorecord.com", "url": "http://www.poconorecord.com/article/20151004/SPORTS/151009768/101011/NEWS?rssfeed=true", "country": "US", "title": "Mounties survive scare from ES North", "performance_score": 0, "site": "poconorecord.com", "participants_count": 0, "title_full": "Mounties survive scare from ES North", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T00:21:00.000+03:00", "replies_count": 0, "uuid": "2be959ba15927726a373c27a0b473701dc740e5a"}, "author": "", "url": "http://www.poconorecord.com/article/20151004/SPORTS/151009768/101011/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "Mounties survive scare from ES North", "locations": ["East Stroudsburg South", "Pocono Mountain East", "Easton", "STROUDSBURG", "Swiftwater", "Pleasant Valley", "ES North East Stroudsburg North", "Stroudsburg", "South", "East ALLENTOWN", "Pocono Mountain West", "East Stroudsburg South EASTON"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Thomas Melchiorre", "Chris Monaco", "Bruno", "Jake Higgins Stroudsburg", "Dylan Della Valle", "Zach Sturniolo", "Riccardi", "Hodge", "Craig Stahlecker", "Khair Bowman", "David Kutteroff", "Jacob Keane", "Gage Scott", "Brown", "Matt Bruno", "Kyle Banashefski", "John Huss", "Justin Richardson", "North", "Cirillo", "Brome", "Changa Hodge", "Marcello Riccardi", "Easton", "Jakobsen", "Melchiorre", "Matt Fisher", "Austyn Borre", "Mikey Brown", "Jacob Cirillo", "Jarrad Pope", "Mike Kuhns", "Jake Jakobsen", "Joey Brown", "Borre", "Allen", "Jamaal Brome"], "text": "Posted Oct. 4, 2015 at 4:21 PM Posted Oct. 4, 2015 at 4:21 PM » Social News STROUDSBURG- Stroudsburg High School stepped up to a very large challenge Friday night, beating East Stroudsburg North 26-18 at home. “It’s nice to know we can come up big in big moments,” senior Marcello Riccardi said. \"We played physical football all night against a very good team.” That physicality created three turnovers against North’s potent triple option offense. They were also able to stop the Timberwolves on fourth and 2 from their own 28 with 33 seconds left in the game as ES North pressed to send the game to overtime. The Mounties' offense came up big again as well. Jake Jakobsen completed 9-of-16 passes for 148 yards and a touchdown. The touchdown pass to Kyle Banashefski was Jakobsen's 29th of his career, setting the Stroudsburg touchdown passing record. Jamaal Brome had another big game with 18 carries for 164 yards and 3 touchdowns. Riccardi had five catches for 108 yards, including a 43 yard catch to the 1 yard line on third and 17, setting up Brome’s second touchdown. “Our guys work hard every day,\" Riccardi said after the win. \"We are already ready to get back to work for next week.” Stroudsburg will be on the road in Swiftwater next week to take on Pocono Mountain East. ES North East Stroudsburg North showed a tremendous amount of tenacity and resilience despite a tough loss to Stroudsburg Friday night. The Timberwolves lost three fumbles against the Mounties, yet found a way to continue fighting until the final seconds of the game. Quarterback Thomas Melchiorre kept North in the game, pacing the offense with 20 carries for 148 yards, one rushing touchdown and one passing touchdown. Joey Brown augmented a very dangerous offense, adding 22 carries for 100 yards and a touchdown. Melchiorre, Brown, and teammate Khair Bowman were instrumental in the Timberwolves' final drive. Down 26-18 with 1:32 seconds left, Melchiorre and the offense took control of the ball at the 49. Converting on third and fourth down during the drive, the T’wolves seemed determined to send the game to overtime. Unfortunately, a high snap on fourth and 2 turned the ball back over to the Mounties, ending the game. PM East ALLENTOWN – Anytime a team runs for nearly 350 yards in a game, a running back or two can thank their offensive linemen. That was the case Friday night after Pocono East ran by Allen 34-6, piling up 342 yards rushing. Matt Fisher enjoyed a huge night in the Cardinals’ backfield. The junior had 188 yards by halftime, and darted his way to 252 for the game. Credit Fisher for some nifty runs, and a big second-effort rush in the second quarter that put PM East up 21-0. The game was academic after that point. Senior offensive tackle Matt Bruno has been the leader on the offensive and defensive lines for the Cardinals this year. Bruno (6-1, 270) has improved his game a great deal since his junior year, and looks to be a player that is going to make some college program happy a year from now. Quarterback Jacob Keane is showing he can run the ball as well, rolling up 72 yards on the ground – the second straight game he’s hit the 70-yard mark.  Mike Kuhns East Stroudsburg South EASTON – Friday night was a night to forget for East Stroudsburg South. The Cavaliers (1-4) fell 63-14 to Easton on a night when nothing seemed to go their way. With two blocked punts early in the game, botched tackles and special teams issues all night, the Red Rovers ran over the Cavaliers defense for 315 rushing yards. Still, there were good things seen from East Stroudsburg South. Jacob Cirillo’s two touchdown passes to Changa Hodge were beautiful floaters thrown way downfield. Hodge outran the defenders both times en route to monster touchdowns of 51 and 63 yards respectively. And when the Cavs’ offensive line did its job, Jarrad Pope was typically able to find nice seams to work through, rushing 17 times for 88 yards. But that offensive line struggled mightily against Easton’s defense. Cirillo faced pressure seemingly every time he would drop back to pass. He was sacked five times for 32 yards. And when special teams was called into action, the unit had issues of its own. Cirillo and Gage Scott split punting duties Friday night, combining to punt the ball seven times for just an average of 17 yards. The first punt from Cirillo was blocked hardly before it left his foot, rolling back 11 yards where the Rovers would start their drive from ES South’s 36. Four punts later, Easton’s Craig Stahlecker got his hands and body on another one, setting his team up for another touchdown drive from South’s 28. East Stroudsburg South will look to get back on track this Friday when it hosts Pleasant Valley. - Zach Sturniolo Pleasant Valley vs. PM West BROADHEADSVILLE - It was a big night for Pleasant Valley senior running back Austyn Borre in Friday night's 42-14 victory over Pocono Mountain West. Borre broke two huge runs for touchdowns from 73 and 84 yards. He also had the first touchdown of the night from five yards out. Borre has 56 career touchdowns at Pleasant Valley. The wet night made ball handling an issue as each team had three fumbles, but only lost one. The passing game was rough for both teams, and most success was found from screens and short passes. West quarterback Dylan Della Valle’s longest throw was about 25 yards down the left sideline to Chris Monaco, who then ran it in for a 42-yard touchdown reception. PV quarterback Mikey Brown had two touchdown passes of 11 and 13 yards. Bears wideout Justin Richardson showed his athleticism this week by running a 12-yard curl down the right sideline. He kept his feet in the end zone as he caught the ball while falling out of bounds for a touchdown. The Panthers running game was hard fought by the Bears' defense. West’s biggest run of the night was a 28-yard touchdown run in the second quarter by Chris Monaco. - Jake Higgins Stroudsburg 26, ES North 18 Stroudsburg 7 7 6 6 26 ES North 6 0 6 6 18 First Quarter ESN - Joey Brown 5 yard run kick failed) SHS - Jamaal Brome 15 run David Kutteroff kick) Second Quarter SHS - Brome 1 run (Kutteroff kick) Third Quarter SHS - Brome 21 run (kick failed) ESN - John Huss 25 pass from Thomas Melchiorre (2 pt. conversion failed) Fourth Quarter ESN - Melchiorre 1 run (2 pt. conversion failed) SHS - Kyle Banashefski 20 pass from Jake Jakobsen (kick failed) Team Statistics", "external_links": [], "published": "2015-10-05T00:21:00.000+03:00", "crawled": "2015-10-05T15:20:42.724+03:00", "highlightTitle": ""}